{"doi":"10.1177\/0305735607077835","coreId":"66371","oai":"oai:dro.dur.ac.uk.OAI2:1719","identifiers":["oai:dro.dur.ac.uk.OAI2:1719","10.1177\/0305735607077835"],"title":"Understanding the ensemble pianist : a theoretical framework.","authors":["Kokotsaki, D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-01","abstract":"The aim of this study was to develop a theoretical model of the attainment of high quality in musical ensemble performance as perceived by the pianist and to identify the factors affecting this process. The research has followed an inductive interpretative approach, applying qualitative methods. The analytic material was collected through the process of interviewing and analysed following grounded theory procedures and techniques. The analysis of the data allowed five categories to emerge, namely, searching for balance, externalization of attention, regulating, time availability and achieving integration, which mainly reflected the pianists' thoughts and concerns about their participation in ensemble music-making in relation to the co-performers' co-action as they collectively attempt to reach for high quality in musical ensemble performance. The five categories were eventually brought together in an integrative model to propose elements of a theory of the attainment of high quality in musical ensemble performance from the pianist's point of view. This article will present the emergent theoretical framework, together with an account of the methodological process followed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66371.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1719\/1\/1719.pdf","pdfHashValue":"dc64c4334a3fddd9dde3f3d3f3ba4d141be867ee","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1719<\/identifier><datestamp>\n      2016-07-06T08:48:30Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Understanding the ensemble pianist : a theoretical framework.<\/dc:title><dc:creator>\n        Kokotsaki, D.<\/dc:creator><dc:description>\n        The aim of this study was to develop a theoretical model of the attainment of high quality in musical ensemble performance as perceived by the pianist and to identify the factors affecting this process. The research has followed an inductive interpretative approach, applying qualitative methods. The analytic material was collected through the process of interviewing and analysed following grounded theory procedures and techniques. The analysis of the data allowed five categories to emerge, namely, searching for balance, externalization of attention, regulating, time availability and achieving integration, which mainly reflected the pianists' thoughts and concerns about their participation in ensemble music-making in relation to the co-performers' co-action as they collectively attempt to reach for high quality in musical ensemble performance. The five categories were eventually brought together in an integrative model to propose elements of a theory of the attainment of high quality in musical ensemble performance from the pianist's point of view. This article will present the emergent theoretical framework, together with an account of the methodological process followed.<\/dc:description><dc:subject>\n        Ensemble playing<\/dc:subject><dc:subject>\n         Group interaction<\/dc:subject><dc:subject>\n         Grounded theory<\/dc:subject><dc:subject>\n         Musical performance.<\/dc:subject><dc:publisher>\n        Sage<\/dc:publisher><dc:source>\n        Psychology of music, 2007, Vol.35(4), pp.641-668 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1719<\/dc:identifier><dc:identifier>\n        issn:0305-7356<\/dc:identifier><dc:identifier>\n        issn: 1741-3087<\/dc:identifier><dc:identifier>\n        doi:10.1177\/0305735607077835<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1719\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/0305735607077835<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1719\/1\/1719.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the Journal Psychology of music 35\/4 2007 Copyright © 2007 by Society for Education, Music, and Psychology Research by SAGE Publications Ltd at the Psychology of music page: http:\/\/pom.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0305-7356","issn:0305-7356","issn: 1741-3087"," 1741-3087"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Ensemble playing","Group interaction","Grounded theory","Musical performance."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n11 November 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKokotsaki, D. (2007) ’Understanding the ensemble pianist : a theoretical framework.’, Psychology of music.,\n35 (4). pp. 641-668.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/0305735607077835\nPublisher’s copyright statement:\nThe final definitive version of this article has been published in the Journal Psychology of music 35\/4 2007 Copyright\n2007 by Society for Education, Music, and Psychology Research by SAGE Publications Ltd at the Psychology of music\npage: http:\/\/pom.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n11 November 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKokotsaki, D. (2007) 'Understanding the ensemble pianist : a theoretical framework.', Psychology of music.,\n35 (4), pp.\u0000641-668.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1177\/0305735607077835\nPublishers copyright statement:\nThe final definitive version of this article has been published in the Journal Psychology of music 35\/4 2007\nCopyright © 2007 by Society for Education, Music, and Psychology Research by SAGE Publications Ltd at\nthe Psychology of music page: http:\/\/pom.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\u0000\u0000\n  \n \n \n \n \nUNDERSTANDING THE ENSEMBLE PIANIST: \nA THEORETICAL FRAMEWORK \n 1\n 2\n \nDIMITRA KOKOTSAKI \n \nContact details: \nUniversity of Durham \nSchool of Education \nLeazes Road \nDH1 1TA \nDurham \nTel: 0191 3348410 \/ 0191 3344219 \nEmail: dimitra.kokotsaki@durham.ac.uk \n \nBiographical note: \nDr Dimitra Kokotsaki is jointly appointed by the CEM Centre and the School of Education \nat the University of Durham.  As a member of the Education Evaluation Group, she is \ncarrying out a variety of evaluations of educational initiatives while her teaching role at the \nSchool of Education involves running the PGCE in secondary music education.  Her current \nresearch interests involve studies in social interaction and communication, performance \nanxiety, music educational research and the determinants of high quality in musical \nperformance.  She has published a number of related articles in academic journals and \ninternational conferences. \n ABSTRACT \nThe aim of this study was to develop a theoretical model of the attainment of high quality \nin musical ensemble performance as perceived by the pianist and to identify the factors \naffecting this process.  The research has followed an inductive interpretative approach \napplying qualitative methods. The analytic material was collected through the process of \ninterviewing and analysed following Grounded Theory procedures and techniques as \ndeveloped by Strauss and Corbin (1990).   \nThe analysis of the data allowed five categories to emerge, namely, Searching for \nBalance, Externalisation of Attention, Regulating, Time Availability and Achieving \nIntegration which mainly reflected the pianists’ thoughts and concerns about their \nparticipation in ensemble music making in relation to the co-performers’ co-action as they \ncollectively attempt to reach for high quality in musical ensemble performance.  The five \ncategories were eventually brought together in an integrative model to propose elements of a \ntheory of the attainment of high quality in musical ensemble performance from the pianist’s \npoint-of-view.  This paper will present the emergent theoretical framework together with an \naccount of the methodological process followed. \n 3\nKEYWORDS \n \nPianist \nMusical Performance \nEnsemble Playing \nGroup Interaction \nGrounded Theory \n \n \n 4\nINTRODUCTION – BACKGROUND OF THE STUDY \nThis study aimed to develop a theoretical model of the attainment of high quality in \nmusical ensemble performance from the pianist’s, as an ensemble member’s, point of view \nand to identify the factors affecting this process.  Pianists with relevant experience were \ninterviewed to identify the perceived steps towards the production of a satisfying collective \nmusical result for those involved.  The aim was not to investigate the musical performance \nper se, but to shed light on those issues that a pianist belonging in such a group would \nperceive to be significant in the group’s preparation for a high quality performance. \n Here, musical performance will be defined as one ‘in which a performer, or a group of \nperformers, self-consciously enacts music for an audience.  In our Western culture, such \nmusic is often written by someone not directly involved in the performance.  The performers \nrealize a pre-existent composition’ (Sloboda, 1985, p.67).  As such, a musical performance is \nthe end result of the musicians’ preparation and involves a single attempt to play the music in \nthe best possible way aiming to make the performance a worthy experience for the audience \nand the performer(s) involved. \n The musical ensemble represents an interesting study case in the framework of the \nmusical performance since, in addition to the requirements imposed upon the player in any \nmusical performance, ensemble playing carries the extra weight of inter-performer \ninteractions.  The relevant literature, in particular, suggests that the nature and quality of \ninteractions among co-performers in terms of verbal and non-verbal communication largely \ndetermine the quality of the musical production itself (Davidson, 1997; Young & Colman, \n1979; Murninghan & Conlon, 1991; Yarbrough, 1975).  The musical ensemble, therefore, \ncan be viewed as both a task performance system as well as a socio-emotional entity where \nthe latter seems to largely determine and define the performance of the task at least as \nperceived by the participating musicians themselves. \n 5\nThe interest in studying the pianist’s point of view arose out of the consideration of the \ndiverse roles that the pianist may adopt in music making.  Firstly, given its harmonic and \nmelodic nature, the piano is a musically self-contained instrument being perfectly capable of \nproducing complete and self-sufficient sounds as a solo instrument.  The pianist, therefore, \ncan effectively function as a solo player in the musical performance.  In this case, the pianist \nemerges as an autonomous type of musician characterised by strong individuality and an \nability to create his\/her own interpretation (Kemp, 1996). \nAdditionally, its harmonic and timbre possibilities make the piano a popular and essential \ncompanion in most small musical ensembles offering the harmonic background for the \nsingle-line string and wind instruments (Kentner, 1991).  Indeed, a wide variety of works \nwhere the piano holds a crucial role, exist, such as piano duos, trios, quartets and quintets.  \nOn the other hand, the pianist may perform an accompanist’s role in the musical ensemble in \nthe sense of providing musical support to a soloist, such as a singer, a wind or string \ninstrumentalist, in order to assist him\/her perform at his\/her best (Moore, 1994; Duchen, \n1994; Spillman, 1985). \nThe consideration of the multi-functional role of the pianist in the musical performance \ngenerated an interest in trying to understand how ensemble pianists perceive their role in \ngroup music making drawing on the similarities and any possible differences between \naccompanying and chamber music playing. \nThis paper will give an account of the methodological process followed and will present \nthe emergent theoretical model.  No raw data will be presented here due to space limitations.  \nInstead, the elements of each category will be visually represented in the form of a chart to \nillustrate the nature of the main elements of the emerging theory. \n 6\nMETHODOLOGY \nThe research has followed an inductive interpretative approach applying qualitative \nmethods with the aim of identifying how pianists perceive the process through which a high \nquality performance can be reached.  On the one hand, the study aimed to allow the \nimportant analytic dimensions to emerge from the data without imposing prior expectations \nand assumptions on the phenomenon under investigation (Patton, 1990).  The study’s \nadherence to an interpretative analytic design, on the other hand, served the purpose of \nunderstanding and explaining the research participants’ experiences from the ‘inside’ \n(Charmaz, 1995) by trying to shed light on the meanings that pianists assign to the issue of \ngroup interaction in musical ensemble performance.  In particular, the study employed the \nGrounded Theory approach as a qualitative method of data analysis (see Glaser & Strauss, \n1967; Glaser, 1978; Strauss & Corbin, 1990; Strauss & Corbin, 1998).  The Grounded \nTheory approach was chosen as an appropriate methodological tool since it allows the \nresearcher to inductively build theory from the interpretation of the data, which was also the \nstudy’s main objective.  The researcher does not have any preconceived concepts or \nhypotheses before embarking on a Grounded Theory project.  Instead, the analytic categories \nderive directly from the data leading to the development of theory based on the respondents’ \nperceptions and interpretations.   \nDATA COLLECTION \nINTERVIEWS \nSince the main objective of the study was to uncover pianists’ viewpoints on issues of \ngroup interaction in ensemble playing rather than attempting to explore the ensemble \nmembers’ actions as would be perceived by an outside observer, it was considered \nappropriate to use interviews in order to investigate pianists’ inner perceptions on this issue \n(Arksey & Knight, 1999).     \n 7\nThe study was of the semi-structured interview type.  This is particularly useful when a \ndetailed picture of the respondent’s viewpoints and perceptions on a particular topic needs to \nbe gained (Smith, 1995).  This study attempted to capture all potentially relevant aspects of \nthe topic under investigation by basing the data collection on the rearrangement of the \nquestions and the introduction of new ones according to emerging themes and issues (for a \nsample of the interview schedule see Appendix).  Indeed, the study’s respondents led the \nconversation as any interesting issues that arose were further followed and elaborated in \ndetail.  Moreover, since in Grounded Theory the analysis literally emerges and is shaped by \nthe nature of the collected data, the analysis in this study began as soon as the first bit of \ninformation was collected.  Data analysis then drove subsequent data collection aiming \ntowards developing theory.  However, where can the data necessary for the development of \nthe evolving theory be obtained? This question is answered by following the logic and \nprocedures of theoretical sampling discussed in the next section.   \nTHEORETICAL SAMPLING \nThe sampling process carries particular significance since it represents the conceptual \nbuilding blocks of the evolving research.  Sampling needs to be ‘purposeful’ (Lincoln & \nGuba, 1985), in other words, it needs to be planned and conducted thoughtfully, since the \nsample of respondents will affect the collected information and will determine the \nresearcher’s interpretations about the meaning of that information (Arksey & Knight, 1999).  \nThe term ‘purposeful sampling’ is more or less synonymous with the term ‘theoretical \nsampling’ used by the developers of Grounded Theory (Lincoln & Guba, 1985).  However, \nthe latter term underlines particularly the evolving nature of the sampling procedure, which is \nbased on concepts that emerged from the analysis and that appear to have relevance to the \nevolving theory.  Sampling in Grounded Theory, therefore, proceeds on theoretical grounds, \ni.e. in terms of concepts and incidents, and not persons (Corbin & Strauss, 1990). \n 8\nThere are three types of theoretical sampling in Grounded Theory, namely, open \nsampling, axial and selective sampling, following the purpose and the logic of the three types \nof coding (see section on Coding Procedures).  At the open sampling stage of the study, the \naim was to generate as many potentially relevant categories as possible.  As far as the axial \nkind of sampling was concerned, the categories and subcategories that were uncovered \nduring open sampling were now related to each other, and relationships were proposed \namong the subcategories of each category by specifically identifying the conditions that give \nrise to each category, the strategies employed and the resulting consequences.  Sampling on \nthe basis of selective coding allowed the integration of categories along the dimensional level \nto form a theory.  Sampling at this stage became directed and deliberate in order to \n‘maximize opportunities for verifying the story line, relationships between categories, and for \nfilling in poorly developed categories’ (Strauss & Corbin, 1990, p.187).   \nDuring data collection, the content of the interview schedule became more and more \nfocused to accommodate to the logic and the aims of the three types of sampling.  In other \nwords, the questions asked gained new focus as more concepts and relationships emerged \nfrom the analysis.  \n The pianists interviewed were classically trained professionals having participated on \nvarious occasions in musical ensemble performances and had, therefore, acquired extensive \nensemble playing experience.  The original sample included nine pianists who lived and\/or \nworked around the University of Sheffield area.  Subsequently, the number of participants \nwas gradually increased in a two-fold manner.  Firstly, some of the pianists interviewed \nnominated others who they thought might have been worth talking to.  This is known as \nsnowball or chain sampling and it is used to locate potentially good interview subjects in \nproviding rich information for the topic under investigation (Arksey & Knight, 1999).  \nAdditionally, web search facilities were used in identifying potential participants that \n 9\nfulfilled the study’s requirements.  The pianists were contacted and given information about \nthe aims and the process of the research.  If they were willing to take part in the study, \nvisiting arrangements were made.  Equal numbers of both male and female pianists were \ninterviewed.  The age of the interview participants ranged from 25 to 55 years.  The final \nanalysis was based on twenty semi-structured interviews.   \nCONDUCTING THE INTERVIEWS AND PILOT RESEARCH \nThe researcher needs to consider a number of ethical obligations such as asking for \npermission to record, being honest about the intended use and purposes of the research, \nletting people know that their participation is fully voluntary, that anonymity will be \npreserved and that, if they wish, their answers will be kept confidential (Rubin & Rubin, \n1995).  All these ethical obligations were taken into account during the interviewing process.  \nThe interviews took place in three stages over twenty months.  The first five interviews \nrepresented the study’s pilot research as their results led to the identification of interesting \nareas that would shape the content of the next interview schedule.   \nAfter the first five interviews, five more interviews followed which allowed further \nfocusing on emergent areas and issues of interest.  The analysis of those ten interviews led to \nthe identification of five categories along with some of their conditions, strategies and \nconsequences.  The ten final interviews aimed to further develop the emergent categories in \nterms of the elements of the paradigm model (see section on Coding Procedures) and verify, \nmodify or discard the assumptions and hypotheses raised during the analytic process.   \nAll interviews were tape-recorded and transcribed in order to maintain closeness to the \nmeaning of the data and preserve the participants’ own words.  Each interview lasted \napproximately one hour and a half.  An attempt was particularly made for the interviewees to \nfeel comfortable and willing to express their views in an unconstrained, open and direct \nmanner.  For this reason, each interview started with an informal ‘warm-up’ type of \n 10\nconversation before the main topic of the research was introduced and further elaborated.  \nMoreover, all interviews took place in the pianists’ own personal or professional space which \nseemed to enhance feelings of security and ease.   \nDATA ANALYSIS \nThere is a systematic set of procedures for conducting Grounded Theory research.  These \nprocedures facilitate the researcher’s theoretical sensitivity and the application of detailed \nand well-developed coding processes. \nTHEORETICAL SENSITIVITY \nTheoretical sensitivity is a term often associated with Grounded Theory.  It is considered \nto be an essential attribute allowing the researcher to make sense of the data by perceiving \nthe subtle nuances and meanings in data, recognising similarities, delicate differences, and \nthe connections between concepts.  This process, deriving from the researcher’s theoretical \nsensitivity, will allow the developing theory to be ‘well integrated’, ‘conceptually dense’ and \n‘grounded’ (Strauss & Corbin, 1990, p. 42). \nNot all researchers have the same degree of theoretical sensitivity.  There may be varying \ndegrees of sensitivity depending upon the researcher’s knowledge, experience and familiarity \nwith the area under study.  According to Strauss and Corbin (1990), theoretical sensitivity \nmay come from different sources, such as the reading of the relevant literature, the \nresearcher’s professional and personal experience, and the analytic process itself (pp.42-43).  \nThese sources have been used here.  The use of the research literature, in particular, assisted \nthe formulation of an initial set of questions, which would guide the first interviews.  \nRelevant literature was also sought during the research itself to stimulate further research \nquestions during the process.  After the data collection and analysis, another literature search \nwas conducted in order to reflect on the validity of the findings.  The researcher’s \nprofessional experience was used as another source of theoretical sensitivity.  This came \n 11\nfrom the development of understanding of the field under investigation by being involved in \nperforming as a pianist in musical ensembles.  Furthermore, personal experience had been \ngained by interaction with performing musical ensembles. \nThe final source of theoretical sensitivity, the analytic process itself, was developed \nduring the analysis through a consistent interaction with the data by making comparisons, \nasking questions, developing concepts and reflecting on their relationships.   \nCODING PROCEDURES \nCoding refers to the researcher’s analytic work.  It involves a process of working with \ntheoretical sensitivity to make comparisons and discover relationships and variations in the \ndata.  There are three types of coding involved: open, axial and selective. \nThe open coding procedure gives names and categorises the emergent phenomena in the \ndata.  The concepts that seemed to apply to the same phenomenon were then grouped \ntogether and led to the emergence of categories.  Each category had several properties or \ncharacteristics which were expressed in terms of different dimensions, and was given a more \nabstract conceptual name than the concepts grouped under it.  The conceptual names given to \nthe data were drawn from the literature, from the pianists’ own words following the “in-vivo” \nnaming technique, or they were given other descriptive names because of the imagery or \nmeaning they called forth when examined comparatively and in their context (Strauss & \nCorbin, 1990). \nThe axial coding part of the analysis involved the development of categories by \nunravelling the relationships between a category (the phenomenon) and its subcategories \nwith the application of the Paradigm Model.  This lies at the heart of the Grounded Theory \nanalytic procedures.  It provides the researcher with an analytic scheme that can be used to \norganise the emerging connections around a phenomenon.  In particular, through the \napplication of the Paradigm Model, the phenomenon is developed in terms of the causal, \n 12\ncontextual and intervening conditions that give rise to it, the action\/interaction strategies \nadopted to manage the phenomenon and its results or consequences.  To differentiate among \nthe three different kinds of conditions, causal conditions refer to the events or incidents that \nlead to the occurrence or development of a phenomenon, the context is the particular set of \ncharacteristics that pertain to a phenomenon, and intervening conditions are the broad and \ngeneral conditions acting to either facilitate or constrain the action\/interactional strategies \n(Strauss & Corbin, 1990; 1998).   \nIt was appropriate to stop collecting data when each category was fully developed in terms \nof its relationships and no new information came from additional interviews.  The researcher, \ntherefore, decides that the point of theoretical saturation had been reached.  Reaching the \npoint of theoretical saturation seems to acquire particular importance in Grounded Theory \nprojects since, as Strauss and Corbin (1998) argued, ‘unless a researcher gathers data until all \ncategories are saturated, the theory will be unevenly developed and lacking density and \nprecision’ (p.212).  \nThe selective type of coding referred to the process of selecting the core category, which \nis the central phenomenon around which all the other categories are integrated, and \nsystematically relating the other categories to the core category by means of the paradigm, \ni.e. conditions, context, strategies, consequences.  The main interest here was how pianists \nperceive their participation in the musical ensemble.  The analysis of the interview data \nallowed the identification of such individual actions and group interactions to emerge.  \nMoreover, their effects both upon the interacting musicians and on the quality of the musical \nproduct were gradually revealed.  The core concept that appeared to link all categories \ntogether was found to be the musicians’ desire to reach high quality in the ensemble \nperformance as seen from the perspective of the pianists interviewed.  Figure 1 presents a \ngraphical representation of the coding procedures used in this study. \n 13\n<< let in figure 1 near hear >> - please display as whole page \nMEMOS \nGrounded theorists consider the writing of memos as a particularly significant activity \nduring the data analysis process since these represent the intermediary stage between the \ncollection of data and the first draft of the completed analysis.  Memos are simply the \nresearcher’s thoughts, any ideas, questions, hypotheses, comparisons that may arise during \nthe coding process (open, axial and selective) and seem relevant or are likely to have some \ntheoretical significance for the issue under investigation.  For Glaser, the writing of \ntheoretical memos is ‘the core stage in the process of generating theory, the bedrock of \ntheory generation’ (1978, p.83).  The power of memos to generate theory lies on their \npotential, firstly, to reveal processes in the data, secondly, to define patterns by going beyond \nindividual cases and, last but not least, to explore ‘implicit, unstated and condensed \nmeanings’ (Charmaz, 1995, p.43). \nThe analytic process here used three different memo types, namely, quotation memos, \ncode memos and general theoretical memos, which were facilitated by ATLAS.ti, a software \ndesigned to facilitate the analysis of qualitative data (Muhr, 1997).  The quotation memos \nwere those comments associated with a specific quotation and were used to highlight its \nsignificance or likely contribution in the evolving theory.  The code memos were used to \nexplain the meaning of a particular code or illuminate possible relations among codes.  They \nincluded, in other words, comments relevant to both open and axial coding processes.  \nFinally, the general theoretical memos involved any emergent hypotheses or assumptions \nwhich would then have to be checked against actual data in order to be verified, modified or \ndiscarded from the evolving theoretical framework.. \n 14\nVALIDITY AND RELIABILITY \nThis study has made use of Lincoln and Guba’s (1985) concepts of validity.  They \npropose four criteria, namely, credibility, transferability, dependability and confirmability \nwhich are close to the nature and logic of qualitative research.   \nCREDIBILITY \nLincoln and Guba (1985) suggest five major techniques that can enhance the credibility of \nqualitative research findings: activities increasing the probability that credible findings will \nbe produced (prolonged engagement, persistent observation, triangulation), peer debriefing, \nnegative case analysis, referential adequacy, and member checks. \n Activities Increasing the Probability that Credible Findings will be Produced \nProlonged engagement ‘is the investment of sufficient time to achieve certain purposes: \nlearning the culture, testing for misinformation introduced by distortions either of the self or \nof the respondents and building trust’ (Lincoln & Guba, 1985, p.301).  Firstly, being a pianist \nmyself, I had participated in ensemble playing both as an accompanist and as a chamber \nmusic player on various occasions and, as a result, I was already familiar with the ‘culture’ of \nensemble playing especially as the pianist perceives it. \nSecondly, I tried to avoid both personal and respondents’ distortions.  On the one hand, I \nspent some time explaining to the interviewees my ensemble playing experience as a pianist \nand the reasons that led me to the choice of the research topic.  I tried in this way to become \naccepted by the study’s pianists as a member of their ‘culture’ and avoid being a ‘stranger in \na strange land’ (Lincoln & Guba, 1985, p.302).  Moreover, to avoid distortions based on my \nown ‘a priori values and constructions’, I kept an open-minded attitude basing the analysis \nexclusively on the data generated and not forcing my own preconceptions into the research.  \nOn the other hand, to avoid distortions introduced by the respondents, I ensured that the \nquestions were constructed simply and clearly by rephrasing questions when necessary.  \n 15\nAdditionally, I tried to make sure that the respondents would not answer in an ‘appropriate’ \nway by making clear at the beginning of the interview that I did not expect particular \nanswers. \nPersistent observation provides depth and salience to the research.  It particularly aims to \n‘identify those characteristics and elements in the situation that are most relevant to the \nproblem or issue being pursued and focusing on them in detail’ (Lincoln & Guba, 1985, \np.304).  To meet this aspect of credibility, the researcher needs to sort out irrelevancies and \navoid coming to a premature closure.  This research took place at three different stages \nduring a period of twenty months.  Each interview essentially led to the next one where more \nand more adaptations and refocusing of the topic were made as the most significant issues for \nthe interviewees were revealed.  Furthermore, the collection of data did not stop until all the \ncategories had been sufficiently developed in terms of their properties and dimensions and no \nmore new information was provided.  This was a sign that the data collection phase had \nreached the point of theoretical saturation.   \nThe technique of triangulation refers to the application of various sources and methods of \ndata collection to increase the credibility of research findings.  However, it was not seen as \nappropriate for triangulation to be applied here for the following two reasons.  Firstly, the \nresearch sought to apply purely qualitative methods for the purpose of investigating the \npianists’ points of view on the issue of the attainment of high quality in ensemble playing \nusing an inductive interpretative approach.  Secondly, since the study’s main interest was the \nexploration of pianists’ inner perceptions and not their actions as would be perceived by an \nexternal observer, other qualitative modes of data collection, such as observation, would \nproduce findings falling out of the study’s scope. \n 16\nPeer debriefing \nThe technique of peer debriefing has been explained as ‘a process of exposing oneself to a \ndisinterested peer in a manner paralleling an analytic session and for the purpose of exploring \naspects of the inquiry that might otherwise remain only implicit within the inquirer’s mind’ \n(Lincoln & Guba, 1985, p.308).  In short, the debriefer could be someone from the \nresearcher’s professional environment who could play the role of the ‘devil’s advocate’ in \ngiving his\/her critical and honest suggestions about the process and the findings of the \nresearch.  Here, the role of the debriefer was played by two other experienced researchers \nwho had experience in the same substantive area and were well aware of the study’s aims and \nobjectives as well as of the processes that led to the research design and proposal, and the \nconstruction of the interview schedule.  In particular, they tested concepts and their \nrelationships and challenged interpretations of the data helping to bring forth and examine \nunthought-of aspects of the phenomenon. \nNegative Case Analysis    \nThis technique refers to the process of constantly refining a hypothesis ‘until it accounts \nfor all known cases without exception’ (Lincoln & Guba, 1985, p.309).  The present study \ndid not make use of the negative case analysis technique because the aim was not to test any \npreconceived hypotheses.  Rather, the relevant issues and their relationships were allowed to \nemerge.  However, it needs to be emphasised that instances of each category in the form of \nconditions, context, strategies and consequences can be found in all interviewees’ comments \nand the ‘umbrella’ major concepts were mentioned and explained by most pianists.   \nReferential Adequacy \nReferential adequacy refers to storing the raw data in archives so that different analysts \ncan ‘reach similar conclusions’ and ‘test the validity of the conclusions’ (Lincoln & Guba, \n1985, p.313).  All interviewing material was imported in the Atlas-ti software for easy \n 17\naccess.  This, however, could invoke ethical conflicts since the interviewees were informed at \nthe beginning of the study that the information they provided would only be used for the \npurposes of the current research. \nMember Checks \nLincoln and Guba (1985) maintain that member checking is the most important technique \nfor establishing credibility.  It involves asking the participants to check the research findings \nand provide feedback on their credibility.  After the first coding had been conducted, new \ninterviewees were asked to verify, modify or discard previously given information and \nexplain the reasons for doing so.  The provision of feedback about emergent issues and \nhypotheses was assured throughout the data collection.  Additionally, the final analytic \nfindings were confirmed by previously interviewed participants. \nTRANSFERABILITY \nThis study does not claim that the proposed theoretical model can be applied in the case of \nall small musical ensembles.  Not being able to make claims regarding the external validity \nof the inquiry, i.e. the generalisation of the results, comments can only be made about the \npotential for transferability.  ‘The best advice to give to anyone seeking to make a transfer is \nto accumulate empirical evidence about contextual similarity; the responsibility of the \noriginal investigator ends in providing sufficient descriptive data to make such similarity \njudgements possible’ (Lincoln & Guba, 1985, p.298).  According to Robson (1993), the \nresponsibility now shifts to the person interested in making such a transfer.   \nDEPENDABILITY \nThe criterion of dependability is analogous to reliability whose key concepts, as \nmentioned above, are those of stability and consistency (see definitions provided by \nHammersley, 1987).  Regarding qualitative research, however, Lincoln and Guba (1985) \nstate that ‘the naturalist sees reliability as part of a larger set of factors that are associated \n 18\nwith observed changes.  In order to demonstrate what may be taken as a substitute criterion \nfor reliability - dependability - the naturalist seeks means for taking into account both factors \nof instability and factors of phenomenal or design induced change.  It can be argued that this \nnaturalist view is broader than the conventional, since it accounts for everything that is \nnormally included in the concept of reliability plus some additional factors’ (p.299).  \nTechniques for enhancing dependability involve triangulation and the operation of an inquiry \nauditor whose responsibility is to examine the process of the inquiry as well as its product, in \nother words, to ensure its internal coherence by attesting that the interpretations and \nrecommendations made are supported by data.  For reasons explained in the following \nsection, an inquiry auditor has not been appointed in this project.  However, all findings have \nbeen supported by raw data in all cases. \nCONFIRMABILITY \nThe confirmability criterion in qualitative inquiry places emphasis on the data rather than \non the investigator.  ‘The issue is no longer the investigator’s characteristics but the \ncharacteristics of the data: Are they or are they not confirmable? The naturalist prefers this \nconcept to that of objectivity’ (Lincoln & Guba, 1985, p.300).  The major technique proposed \nby Lincoln and Guba for attesting confirmability is provided by the confirmability audit.  It \ninvolves the appointment of a person as auditor to examine categories of information \nprovided by the investigator (the audit trail), such as raw data, analysis products, process and \npersonal notes, pilot forms, schedules and so on, and determine the project’s auditability, in \nother words, whether the material is comprehensible, useful and linked to the purposes of the \nstudy.  It is, however, as Robson (1993) maintains, ‘over-optimistic, and probably over-\nformalistic, to expect all small-scale researchers to follow this route at this time’ (p.407). \n 19\nThe present study was not tested by a confirmability auditor in the manner described \nabove due to financial constraints but Robson’s suggestion was kept in mind throughout and \nall material was collected and analysed as if audited in this way. \nFinally, in accordance with Lincoln and Guba’s (1985) advice, a reflexive journal \ncontaining information about self and method was maintained.  It included material on daily \nscheduling, personal reflections and methodological decisions.  This was provided \nthroughout the course of the study and archived in the form of memos in the Atlas-ti \nsoftware. \n \nSELECTIVE CODING PROCEDURES  \nThe selective coding procedures involve the execution of a number of steps in accordance \nwith Strauss and Corbin’s (1990) recommendations.  The researcher needs to explicate the \nstory line, select the core category and integrate all the other categories around the core \ncategory by means of the paradigm, i.e. conditions, context, strategies, consequences.  These \neventually form the essential building blocks of the theory. \nThe main interest here was how pianists perceive their participation in the musical \nensemble.  The analysis of the interview data allowed the identification of individual actions \nand group interactions to emerge.  Moreover, their effects both upon the interacting \nmusicians and on the quality of the musical product were gradually revealed.  The story line \nof the present study, therefore, would present the pianists’ perceptions on the steps taken by \nthe interacting musicians to attain high quality in musical ensemble performance together \nwith the conditions and consequences of such actions.  Ultimately, the coding and analysis of \nthe data led to the emergence of five categories: Searching for Balance, Externalisation of \nAttention, Regulating, Time Availability and Achieving Integration (see Figures 2, 3, 4, 5 and \n 20\n6 for a graphical representation of the main elements of each category as emerged from the \nanalysis). \n<< let in figures 2 to 6 near here>> - please display as whole pages \nCODE INTERRELATIONS \nThis section attempts to bring together the primary elements of the proposed theoretical \nmodel in a more abstract level of analysis.  It is interesting to notice how the relations among \nthe codes point out the identification of connections among the categories themselves.  \nIndeed, the same code could represent different component parts of the paradigm model in \ndifferent categories.  As Strauss and Corbin (1990) maintained, in particular, ‘the \nconsequences of one set of actions may become part of the conditions (as context or \nintervening ones) affecting the next set of action\/interactions occurring in a sequence – or \neven part of conditions that follow in still another sequence.  Therefore, what are \nconsequences of action\/interaction at one point in time may become part of the conditions in \nanother’ (p.106).   \nOverall, forty-nine instances of code interrelations, i.e. one code appearing in more than \none category, have been identified which allowed the emergence of connections among the \nfive major categories.  Recognising the limits of space, twelve illustrative cases are cited \nbelow (for a visual representation of how some of these codes interrelate see also figure 7). \nThe achieving co-ordination code was linked to a number of codes in the category \nsearching for balance such as experience facilitation, technical ability, musical balance, being \ninseparable but distinct and it was also a consequence of the musicians’ attempt to externalise \ntheir attention and achieve effective communication with one another. \nThe code technical ability was identified as an intervening condition in the categories \nsearching for balance and externalisation of attention.  It was additionally linked to a number \n 21\nof codes in the regulating category, such as the piano as an anchor instrument and the codes \nmusical adaptation and piano music requirements. \nThe code connection\/empathy was linked to the familiarity code in the category time \navailability in the sense that the pianists interviewed expressed the desire to connect and \nempathise with one another for a musical performance of high quality.  In turn, these feelings \nassisted them perform at their best and achieve integration with the co-performers (Achieving \nIntegration category) \nThe code visual communication appeared in the category externalisation of attention \nindicating the use of the visual sense as a means through which ensemble musicians can \ndirect their attention towards the ensemble environment.  Communicating effectively through \nthe visual mode was also found to be a strategy employed by the ensemble musicians to \nperform at their best in the category achieving integration. \nThe importance of an active kind of listening appeared in all categories.  Firstly, the code \nlistening to partners was identified as a strategy employed by the ensemble musicians during \ntheir search for balance and their attempt to communicate aurally with each other in the \nexternalisation of attention category.  It also facilitated the players’ ability to instantly \nrecognise and react to cues given from the co-performers in the regulating category.  \nMoreover, the code aural communication was associated as a strategy with the players’ \nachievement of integration and a kind of active listening signified an element of quality \nresulting from the existence of enough preparation time in the category time availability.   \nFurthermore, searching for balance and getting involved in an externalisation of attention \nprocess were found to improve the ensemble musicians’ listening ability, out of which \nfinding the code learning to listen was identified. \nThe code difficult to listen was one of the drawbacks of the ensemble musicians’ reliance \non sight-reading ability.  It appeared in the externalisation of attention category as an \n 22\nintervening condition and in the time availability category as a consequence of the \nmusicians’ focus on quantity rather than quality when there was not enough practice time \navailable. \nThe code informed action appeared under the categories searching for balance, \nexternalisation of attention and regulating.  It generally signified the importance for the \nensemble musician to judge his\/her intentions against the co-performers’ actions and act \naccordingly. \nThe code spontaneity was linked to four categories, namely, externalisation of attention, \nregulating, time availability and achieving integration.  In particular, being spontaneous in \nthe musical ensemble served the purpose of introducing or acting on the basis of unexpected \nmusical ideas initiated by the co-performers for the generation and transmittance of an \nelement of excitement and emotional thrill to listeners as well as among co-performers \nduring the performance. \nThe code getting out of self appeared under the category externalisation of attention as a \ncontextual condition where it allowed the musicians to step out of their self in order to be \nconstantly aware of the co-performers.  In addition, it signified the co-performers’ attempt to \nlose caution and overcome technical preoccupations and other worries in order to generate \nand transmit an element of excitement, spontaneity and emotional thrill to the listeners in the \nachieving integration category. \nThe code musical adaptation was linked with both the searching for balance and \nregulating categories.  It denoted, on the one hand, the ensemble players’ attempt to adapt \nmusically to each other in order to reach common musical ground and, on the other, the \naccompanist’s role in adapting to the soloist’s needs for the purpose of assisting him\/her to \nperform at his\/her best.  Similarly, the code following indicated the accompanist’s role in \n 23\nfacilitating the soloist’s performance and also appeared in the searching for balance and \nregulating categories. \nThe learning to be fast code was linked to the categories of regulating and time \navailability and denoted an important attribute for the ensemble pianist, namely, being able to \nrapidly recognise and respond to cues given from co-performers and to quickly adapt to the \nrequirements of the ensemble rehearsal. \nSTORY LINE \nThe main story concerns the process through which high quality can be attained in \nmusical ensemble performance as perceived by the pianist-as-member-of-the-ensemble.  \nAiming for high quality in performance required the ensemble players to reach common \nmusical ground and achieve co-ordination out of the plurality of ideas and performance \napproaches brought into the ensemble playing context by balancing the extremes regarding \nboth interpretative considerations as well as their personal characteristics.  The main reason \nwhy this equilibrium seeking process needed to occur was the conjunctive nature of the \nmusical ensemble where all members were required to contribute effectively for the well-\nfunctioning of the group.  In order to respond to the need for balance, ensemble musicians \ngot involved in a process of musical adaptation whereby alternative musical possibilities \nwere considered in an open and flexible manner by experimenting with different sounds and \ngetting engaged in a kind of active listening.  However, a number of conditions such as the \nsize of the group, the hall acoustics, the players’ technical ability, their prior experience or \nlack of experience, could enhance or constrain this balance seeking process.       \nThe need to find balance in ensemble playing required the pianists’ direction of attention \nout of themselves in order to become aware of the co-performers.  The musicians’ attention \nin ensemble playing was mainly externalised through the auditory and visual modes \naccording to the pianists interviewed.  Aural communication, in particular, involved active \n 24\nlistening fluctuating between one’s own playing, the others’ playing and the overall sound.  \nVisual communication, on the other hand, involved the direction of the players’ attention \ntowards those visual stimuli that allow the exchange of valuable bodily information about the \nco-performers’ intentions and imminent action for the purpose of achieving co-ordination.  \nOvercoming any technical limitations and preparing adequately the musical material \nfacilitated the pianists’ ability to perceive visual and aural cues in the ensemble playing \ncontext.  Ensemble members used their social skills, such as being democratic, encouraging \neach other, showing respect and politeness, negotiating, showing discretion and sensitivity, in \norder to support each other and allow each musician’s potential to be brought out rather than \nbeing discouraged.  Through this process, not only were the participants’ social skills further \ndeveloped, but also they were able to observe their own self through the co-performers’ eyes \nand develop, therefore, a more objective and consciously informed perspective.  When the \nplayers managed to externalise their attention towards the ensemble environment efficiently \nby achieving effective aural and visual communication with the co-performers, the quality of \nthe ensemble playing was enhanced.  \n The players’ externalisation of attention towards the ensemble environment seemed to be \nespecially useful for the pianist who was found to hold a regulatory function in the musical \nensemble.  Two main reasons explained the emergence of the pianist as a strong link, firstly, \nthe specificities of the piano as an instrument which allowed the pianist to support the other \ninstruments in the ensemble and, secondly, the central position of the piano particularly in the \npiano trio repertoire.  Moreover, the pianist acquired a regulatory role in the accompanying \ncontext, where he\/she held a supportive role both in a musical and a moral sense.  In order to \nmeet the requirements of his\/her role, the pianist had the full score during playing which \nappeared to allow him\/her to cope with any unpredictable circumstances that might occur \nduring the performance.  The main purpose of the pianist would be to restore the musical \n 25\nflow and bring the ensemble back on the right course of action by taking remedial action and \nmaking decisions on the spot when necessary.  Considering the unpredictability of the live \nperformance, the pianist was also required to recognise and react to the cues given from co-\nperformers by listening actively, being alert, fast and spontaneous.  However, conditions such \nas group size, experience facilitation, repertoire mediation and the pianist’s restrained bodily \napproach were found to affect the regulating role of the pianist in the musical ensemble.  \nMoreover, in his\/her attempt to contribute to a high quality performance, the pianist was \nparticularly preoccupied with the fear of letting the co-performers down experiencing, \ntherefore, high levels of responsibility. \n The attainment of high ensemble quality eventually emerged as a state of integration both \namong co-performers and with the audience where the musicians performed as a unified \nwhole rather than as separate elements.  The achievement of integration among the co-\nperformers seemed to involve all musicians’ deep involvement with each other which was \nalso found to attract the attention of the audience and assist, therefore, in the musicians’ \nintegration seeking process with the audience. In addition to the musicians’ involvement, the \nachievement of integration with the audience also involved the musicians’ consideration of \nthe expectations and reactions of the audience.  Moreover, the pianists felt that they \nperformed at their best, firstly, when they felt closely connected with each other, secondly, \nwhen they enjoyed the repertoire and were adequately prepared, thirdly, when they sensed \nthe co-performers’ enjoyment and, finally, when they were engaged in an effective aural \ncommunication with each other.  This integrated state was described as a kind of flow \nexperience, on the one hand, whereby the co-performers were effortlessly attuned to each \nother’s sound and expressive intentions.  On the other hand, it appeared to lead to the \nemergence of a group kind of self where each individual contribution was an essential \ncomponent part of the overall musical result but did not exist in isolation.  However, the \n 26\nachievement of integration with the co-performers and with the audience would be inhibited \nby a number of factors.  These involved the derogatory attitude that some audience members \noften hold regarding the accompanist’s role in the musical ensemble as well as the derogatory \nbehaviour and exaggerated expectations that some singers may have of the pianist. \nHigh quality in musical ensemble performance would also be enhanced by the existence \nof enough time for practising and rehearsing.  Time drew a major divide between short-term \nand long-term musical ensembles.  In the latter case, the players’ prior familiarity and \nconnection with each other appeared to provide a foundation where further ensemble \npreoccupations were built upon.  When there was time available, ensemble musicians were \ncommitted to practising individually before and\/or after rehearsing with the co-performers.  \nHowever, when there was not enough time for practice, the ability to sight-read was \nbeneficial.  Conditions, such as the importance of the performance, the familiarity, difficulty, \nenjoyment and choice of the repertoire appeared to affect the amount of rehearsal time \nrequired for a particular performing occasion. \n The existence of sufficient practice time in the musical ensemble has been found to \nsignify an element of quality and of deliberate manipulation of sound in contrast to the \nconsequences of lack of time which would denote rather an element of quantity.  In other \nwords, time availability has been linked to a kind of active listening and the attainment of \ndepth in the musical production, which was additionally found to involve profound \nunderstanding and knowledge rather than the pure employment of skill.  The reliance on \nsight-reading, however, was found to have drawbacks, such as a difficulty to listen actively \nto the co-performer, rapidity and superficiality in the learning of the music unlike the depth \nand thoroughness that time availability appeared to entail.  In short, lack of practice time was \nreported to indicate the employment of skill rather than knowledge where the purpose was to \n 27\nmake the performance work with the means available in contrast to the attainment of high \nquality in the musical ensemble performance. \nThe main concepts of the story line are presented in figure 7. \n<< let in figure 7 near here >> - please display as whole page \n \nSUGGESTIONS FOR ELEMENTS OF AN EMERGENT THEORY \nThe phenomenon under investigation here is how the pianist perceives the ensemble \nmusicians’ action and interaction for the purpose of performing. The core concept that \nappeared to link all categories together was found to be the musicians’ desire to reach high \nquality in the ensemble performance.  The attempt to locate all categories around the \nParadigm Model led to the identification of the category searching for balance as the cause \nbeing directly linked to the externalisation of attention category which was considered to be \nthe context.  Regulating is the action of the phenomenon of group interaction in musical \nensemble performance as perceived by the pianist.  The musicians’ externalisation of \nattention and regulating capacity could lead to the achievement of integration or lack of \nintegration among ensemble members and with the audience as a consequence of their \ninteraction.  Moreover, time availability or lack of time was found to facilitate or constrain \nrespectively the ensemble musicians’ interaction as perceived by the pianist.  The way the \ncategories are linked to each other in terms of the paradigm model is presented in figure 8. \n<< let figure 8 near here >> \nAn attempt was made to diagrammatically represent the emergent categories in an abstract \nway and eventually the elliptical form shown in figure 9 was created. \n<< let figure 9 near here >> \nAs figure 9 shows, the musicians’ desire to reach high musical quality in the ensemble \nperformance is related to all categories.  For this reason, it was placed outside the ellipse \n 28\nindicating that it affects all categories.  As the categories were located around the paradigm \nmodel, searching for balance was identified as the cause, externalisation of attention as the \ncontext, regulating as the action, and the achievement of integration or lack of integration \nwas identified as the consequence.  Finally, the time availability or lack of time category \ninvolved the conditions that could facilitate or constrain respectively the musicians’ \ninteraction.  Particular attention should be given to the arrows named conditions, which \nrepresent those factors found to affect the various steps towards the attainment of high \nquality in musical ensemble performance.  These factors are the sum of the intervening \nconditions identified in each category. \nOverall, this study has primarily been an attempt to investigate how pianists understand \nwhat they do as active members of musical ensembles in their interaction with other \nensemble players.  In particular, the study’s main interest was to understand the pianist’s \nperspective on the nature of the ensemble players’ emotional and behavioural involvement \nwith one another as they get engaged in a preparation process for the purpose of performing \nin public.  The study was based on the points of view of professional pianists with ample \nensemble playing experience who were all experts in their field.  They offered, therefore, rich \nand valuable information on those elements that would enhance the ensemble players’ \neffective interaction as well as on the particular aspects of a pianist’s skill that would \ncontribute to the attainment of high quality in musical ensemble performance.  \nHowever, it cannot be claimed that the model would apply to every professional pianist \nwho has experienced participation in small musical ensembles in the classical tradition \nmedium.  Hence, a limitation of this kind of study is its lack of ‘generalisability’.  This was \nan unavoidable outcome of the study’s primary aim of gaining a deep understanding of the \npianists’ viewpoints for two reasons.   \n 29\nFirstly, the investigation of the subject required theoretical sampling based on the pianists’ \nextensive participation in ensemble music making.  Not all pianists that were contacted could \ntake part in the study.  Moreover, the considerable demands of the interviewing process in \nterms of travelling time and financial requirements acted as a constraining factor during the \ndata collection process.  \nSecondly, the twenty in-depth interviews produced an enormous amount of data repeated \nagain and again as the interviewing process progressed.  This was a sign that the study had \nreached the point of theoretical saturation, which, according to the Grounded Theory \nmethodology, indicates the closure of the data collection stage of the research.  Thus, the five \ncategories were fully developed in terms of their conditions, strategies and consequences \nbefore the end of the data collection phase.  However, more research needs to be done to \ninvestigate the ‘generalisability’ of the model to other samples of pianists.   \nFuture research could also employ quantitative methodological approaches to test the \nresults of this study.  Such studies could take into account, for instance, variables such as \nyears of ensemble playing experience, educational background, personality, age, gender or \ncognitive style.   \n Moreover, further research could apply, elaborate and extend the proposed model, \ntogether with the conditions found to affect it to other members of small musical ensembles \nand to other related disciplines.  In particular, the consideration of the perspectives of other \nensemble musicians, such as string and wind players or singers, would allow the validation of \nthe present model and its extension to a broader theory on the issue of how different \nmusicians perceive their participation in small musical ensembles and what particular skills \nthey need in doing so.  Such viewpoints would provide insights into the nature of group \nmembership in the case of ensemble playing.  It would also be interesting to draw on the \nexperience of different instrumentalists or singers and compare how the particularities of \n 30\n 31\neach instrument or of the singing act would affect and shape the musicians’ perceptions of \ntheir own contribution to the group and of the various musical and social interactions among \ngroup participants.   \nFinally, considering the positive effects of ensemble playing participation on the musical \nand social development of music students, music educators should encourage their students’ \nparticipation in musical ensembles by arranging them in small performing groups as often as \npossible.  Moreover, it would be of interest if such effects could be further examined in order \nto identify specific variables and factors, such as personality, age, gender and ability that \nwould optimise the benefits that music students can gain from their participation in small \nmusical ensembles. \nThe above mentioned points will assist the expansion of the theoretical model presented in \nthis paper which investigated the pianist’s perspective on the attainment of high quality in \nmusical ensemble performance offering unique insights into the nature of a pianist’s \nparticipation in the ensemble playing context. \nREFERENCES \nArksey, H. & Knight, P. (1999). Interviewing for Social Scientists. London: Sage. \nCharmaz, K. (1995). Grounded Theory. In J.A. Smith, R. Harre & L. Van Langenhove \n(Eds.), Rethinking Methods in Psychology (pp. 27-49). London: Sage. \nDavidson, J. W. (1997). The Social in Musical Performance. In D.J. Hargreaves & A.C. \nNorth (Eds.), The Social Psychology of Music (pp.209-228). New York: Oxford University \nPress. \nDuchen, J. (1994). In the Back ground. Strad, 105(1253), 872-875. \nGlaser, B.G. (1978). Theoretical Sensitivity: Advances in the Methodology of Grounded \nTheory. Mill Valley, CA: Sociology Press. \nGlaser, B.G. & Strauss, A. (1967). The Discovery of Grounded Theory: Strategies for \nQualitative Research. New York: Aldine de Gruyter. \nHammersley, M. (1987). Some Notes on the Terms ‘Validity’ and ‘Reliability’. British \nEducational Research Review, 13(1), 73-81. \nKemp, A.E. (1996). The Musical Temperament: Psychology and Personality of Musicians. \nNew York: Oxford University Press. \nKentner, L. (1991). Piano. London: Kahn & Averill. \nLincoln, Y.S. & Guba, E.G. (1985). Naturalistic Inquiry. Newbury Park, CA: Sage \nPublications. \nMoore, G. (1994). The Accompanist and the Singer. In K. Falkner (Ed.), Voice (pp.270-\n276). London: Kahn & Averill. \nMuhr, T. (1997). ATLAS.ti Software – User’s Manual. Berlin. \nMurnighan, J.K. & Conlon, D.E. (1991). The Dynamics of Intense Work Groups: A Study \nof British String Quartets. Administrative Science Quarterly, 36, 165-186. \n 32\nPatton, M.Q. (1990). Qualitative Evaluation and Research Methods (Second Edition). \nNewbury Park, CA: Sage Publications. \nRobson, C. (1993). Real World Research: A Resource for Social Scientists and Practitioner-\nResearchers. Oxford: Blackwell. \nRubin, H.J. & Rubin, I.S. (1995). Qualitative Interviewing: The Art of the Hearing Data. \nThousand Oaks: Sage. \nSloboda, J.A. (1985). The Musical Mind: The Cognitive Psychology of Music. Oxford: \nClarendon Press. \nSmith, J.A. (1995). Semi-Structured Interviewing and Qualitative Analysis. In J.A. Smith, \nR. Harre & L. Van Langenhove (Eds.), Rethinking Methods in Psychology (pp. 9-26). London: \nSage. \nSpillman, R. (1985). The Art of Accompanying. New York: Schirmer Books. \nStrauss, A.L. & Corbin, J. (1990). Basics of Qualitative Research: Grounded Theory \nProcedures and Techniques. London: Sage Publications. \nStrauss, A.L. & Corbin, J. (1998). Basics of Qualitative Research: Techniques and \nProcedures for Developing Grounded Theory. London: Sage Publications. \nYarbrough, C. (1975). Effect of Magnitude of Conductor Behaviour on Students in Mixed \nChoruses. Journal of Research in Music Education, 23, 134-146. \nYoung, V.M. & Colman, A.M. (1979). Some Psychological Processes in String Quartets. \nPsychology of Music, 7(1), 12-18.   \n \n \n \n \n \n \n 33\n CODING PROCEDURES\nDATA COLLECT IO N\nO PEN CO DING\nAXIAL CODING\nSELECTIVE CO DING\nNAMES (Labelling the phenom ena)\nCATEG ORIES  (G rouping the labels; Categorising the\nphenom ena; Creating subcategories)\nPRO PERTIES (Characteristics of a category)\nDIM ENSIO NS (Locations of a property)\nDEVELO PM ENT of Each Category\nCAUSAL CO NDITIO NS\nIDENTIFICATIO N of CO NTEXT\nINTERVENING  CO NDITIO NS\nACTIO N\/INTERACTIO N STRATEG IES\nCO NSEQ UENCES\nSELECTING  the Core Category\nVALIDATING  the Relationships am ong Categories\nREFINING  Categories\nINTEGRATING other Categories to the Core\n  Figure 1: Coding Procedures in Grounded Theory  (Taken from Zafeiriou, 2000, p.116)\n 34\nSEARCHING\nFOR BALANCE\nACTION\/\nINTERACTION\nSTRATEGIES\nINTERVENING\nCONDITIONS\nCONTEXTUAL\nCONDITIONS\nCAUSAL\nCONDITIONS\nRole\nAlternation\nCommon\nM usical\nGround\nConjunctive\nEnsemble\nPlurality of\nIdeas\/M anners\nTechnical\nAbility\nSpatial\nDynamics\nHuman\nBalance\nM usical\nBalance\nExperience\nFacilitation\nThe Piano as\nan Instrument\nObtaining Outside\nPerspective\nM echanical\nAge\nInstruments'\nIncompatibility\nGroup Size\nContemporary\nRepertoire\nCONSEQUENCES\nM usical\nAdaptation\nConsidering\nComposer's\nIntentions\nListening to\nPartners\nExploring\nBoundaries\nM usicality\nDevelopment\nPhrase Alternation\nMercurial Ensem ble\nPlaying\nUnantic ipated\nGetting Right\nProm inence\nBeing Alert\nAs Strong as its\nW eakest Link\nInterpretation\nPhrasing\nRhythm ic\/\nExpressive Issues\nOpportunities to\nShine\nDynam ics\nPartnership\nHom ogeneous\nAbility\nEquality of Strength\nand Tem peram ent\nCom m itm ent\nMotivation\nCom m on Goals\nRepertoire\nEnjoym ent\nRhythm\nBreathing\nInterpretation\nCom m on\nIntentionality\nMapping out\nthe Narratives\nSound\nDistinctiveness\nRecordings\nLarger Groups\nSm aller Groups\nAll-Contributing\nLess Room  for the\nIndividual Voice\nPiano Lid\nPlayers' Sitting Position\nHall Acoustics\nLighting\nAudibility\nInform ed\nAction\nTalking\/Playing in\nRehearsal\nShow ing Clarity\nAdaptation W ithout\nCom prom ising\nReconsidering\nExpectations\nOpenness and\nFlexibilityLearning About\nOther Instrum ents\nBecom ing Aw are of\nAlternative Approaches\nGetting Perspective in\nSound\nReappraising V iews\nLearning to Listen\nGetting Sense of\nPhysical Production\nTim e\nIm proving Melodic\nProjection\nExperimenting\nBeing Exposed\nRelating\nBalancing the\nExtrem es\nAchieving Co-\nordination\nBeing Inseparable\nbut Distinct\nArticulation\nDynam ics\nPhrasing\nUsing Every\nFinger\nSound Quality\nKeeping\nIndividuality\nA live\nDeviating from\nthe Exact\nSynchronisation\nListener Reception\nMore Dif ficult to\nReach Consensus\nMore Dif ficult to\nAdapt on the Spot\nIm m ediate Piano\nEffect\nCo-ordination\nDifficulties\nIntonation\nDiff icult Rhythm s\nUnpredictability\nSize of the Piano\nCom m unicating\nEffectively\nLack of\nConfidence\nVisibility\nPoor\nBetter Ensem ble\nQuality\nGood\nAccom panying Skill\nEducational\nBenefits\nFollow ing\nPre-form ed\nExpectations\nCom prom ising in\nEnsem ble\nOffering Musical\nSupport\nOffering Moral\nSupport\nTaking Evasive\nAction\nEnsemble\nImproving\nSolo Playing\nCom m unicating\nEffectively\nPhrasing\nBreathing\ncause\ncause\nstrategystrategy\nconsequence\nstrategies\ns trategy\nstrategies\nstrategy\nstrategy\nstrategy\ncause\nconsequence\nstrategyAchieving Co-\nordination\nconsequence\nconsequences\nconsequence\nTrusting Own\nInstincts\nco\nnse\nqu\nen\nce\nca\nus\ne\ncause s\ntrate\ngy\nstrategy\nconsequencestrategy\ncondition\nstrategies\ncau\nse\ncaus\ne\ncause\ncause\ncause\ncause\ncon\nsequ\nenc\ne\nstrategy\n \nFigure 2: Conditions, Strategies and Consequences of the Search for Balance in Ensemble Playing\n 35\nEXTERNALISATIO N\nO F ATTENTIO N\nAC T ION\/\nINT ER ACT ION\nST R AT EG IES\nINT ER VENING\nC ONDIT IONS\nC ONT EXT UAL\nC ONDIT IONS\nG etting out of\nSelf\nSm elling\nIndicator\nCapacity\nA ural\nC om m unication\nVisual\nC om m unication\nAdequate\nPreparation\nTechnical A bility\nSight R eading\nD raw backs\nC ONSEQUENCES\nEnsem ble\nP laying\nC ivilising\nFunction\nK nock-on E ffec t\nP hys ica l\nP roxim ity\nE ye Contac t\nA chiev ing Co-\nordination\nV isual S ignals\nM ovem ent\nE ncoding\/\nDecoding\nConduc ting\nGes tures\nW atch ing Takes\nA w ay from\nLis ten ingW atch ing\nRehearsed\nP eriphera l V is ion\nThe P ian is t's\nRes tra ined B odily\nA pproach\nTuning-in\nUnrehearsed\nRhythm ica l\nConnection\nEnjoym ent\nFeedback\nGetting S ense of\nPhys ica l\nP roduc tion Tim e\nP hys ica lly\nUninh ib ited\nInsp ira tion f rom\nW atch ing\nFocus ing on the\nOvera ll S ound\nLis ten ing to\nPartners\nFocus ing on Ow n\nP laying\nOpenness and\nFlexib ility\nHum an Ins ight\nD isc retion\nLarger\nGroups\nS oc iab ility\nE ncouraging\nA dopting an\nObjec tive S tance\nS elf-\nConsc iousness\nLoss  in\nPerform ance\nCom m unicating\nE f fective ly\nD eveloping\nEnvironm ental\nA w areness\nGroup S elf\nD if f icu lt to  L is ten\nS ens itiv ity\nDealing w ith\nArgum ents\nBeing Dem ocratic\nNegotia ting\nShowing R espect\/\nPo liteness\nIn form ed Ac tion\nM ulti-Task A bilityLearn ing to  L is ten\nThink ing of  the\nM usic\nE ffortless\nConcentra tion\nGetting out o f\nS elf\nSocial Skills\nInternal\nM em orisation\nK eeping the\nS core\nCom m unicating\nE f fective ly\nS ecurity\nB ody\nLanguage\nFreedom  of\nE xpress ion\nD iscuss ion\nDec is ion\nM ak ing\nB eing D ip lom atic\nP lura lity o f  Ideas \/\nM anners\nSelf-S uff ic iency\nof the P iano\/\nP ian is ts\nS tarting f rom\nS m all E nsem bles\nS oc iab ility\nDevelop ing\nSoc ia l S k ills\nP artnersh ip\nLearn ing\nP artnersh ip\nFac ilita tion\nS pontaneity\nP laying w ith\nS ign if icant\nOthers\nE ffortless\nP layingR ecord ings\ncause\nstr\nate\ngy\nstra\nteg\ny\nstrategy\nstrategyconsequenceconsequence\nconsequence\nconsequence\ncondition\ns tra tegies\ncondition\nc ondition\nstr\nate\ngy\nconsequence\nco n s e q u e n ce\nc ause\ns trategy\nstrategy\nstrategy\ncause\ncons\neque\nnce strategies\ncontext\nstrategy\ncondition\nconsequence\n        cause\nc ondition\nco\nnd\nitio\nn\nconsequences\nS tandard\nE levation\nIntrins ic\nM otivation\n \nFigure 3: Conditions, Strategies and Consequences of the Musicians’ Externalisation of Attention in \nEnsemble Playing \n 36\nRE G U LA TIN G\nAC T IO N\/\nINT ER AC T IO N\nS T R AT EG IES\nINT ER VE NING\nC O NDIT IONS\nC O NT EX T UAL\nC O NDIT IONS\nP ianist: Strong\nLink\/R egulator\nA ccom panist:\nG uide\/Facilitator\nC ONSE QUE NC ES\nD efin ite Ideas\nP iano Trio\nThe P iano 's\nC entra l P os ition\nP olyphon ic\nIns trum ent\nA w are o f  W hole\nM us ica l P ic ture\nB eing A lert\nPianist H aving\nFull Score\nP iano\nS pec if ic ities\nThe P ianist's\nR estrained\nB odily A pproach\nG roup Size\nFixed In tonation\nP iano  S ound\nM etam orphos is \/\nA dapta tion\nM os t A ud ib le\nIns trum ent\nA nchor\nIns trum ent\nH old ing the\nH arm ony\nF lexib ility\nLeve ling\nIn tonation\nEqua lity  o f\nS tre ngth a nd\nTempe ra me nt\nB ro ader So nic\nAw are ne ss\nP iano  P la y ing\nPo ss ibilities\nTa king o n\nD iffe rent So unds\nTechn ica l\nA b ility\nD ecora tive\nS trings  R ole\nP laying a ll the\nTim e\nP laying M ost\nN o tes\nP iano M us ic\nR equirem ents\nD ev e lo ping\nS tamina\nSupporting a nd\nHo lding the\nEns emble\nB e ing A ssessed\nB ring ing  out\nP otentia l\nV oca l C oach ing\nLess  E xperienced\nP erform ers\nO ffe ring  M ora l\nS upport\nB e ing A lert\nM us ica l\nA dap ta tion\nOf fering  M us ica l\nS upport\nA nxie ty\nK eep ing\nC om posure\nFo llow ing\nP ro tec ting\nLack of\nFam iliarisation\nw ith  the P iano\nPart\nExperience\nFacilitation\nR eperto ire\nM ediation\nIm proper M enta l\nR epresenta tion\nInstant\nR ecognition &\nR eaction\nTak ing  E vas ive\nA ction\nM aking  D ec is ions\non the  S pot\nP erform ance\nU npred ic tab ility\nW rong E n try\nIm probab ility\nR esto ring  M us ica l\nFlow\nS ight R ead ing\nFac ilita tion\nFam ilia rity\nFac ilita tion\nE s tab lish ing\nTem po\nE s tab lish ing\nD ynam ics  and\nM ood\nC onduc ting  S k ills\nB e ing in  the\nM om ent\nLea rn ing to  be\nFas t\nL is ten ing to\nP artners\nC oncentra tion\nS pontane ity\nIn form ed A c tion\nIm prov isa tion\nC onf idence\nR esponsib ility  in\nEnsem ble\nLess  E xperienced\nP erform ers\nC onjunc tive\nE nsem ble\nS hared B urden\nLetting  the S ide\nD ow n\nLetting  Yourse lf\nD ow n\nA udience\nC ons idera tion\nE xpec ted\nP erfec tion  f rom\nthe A ccom panis t\nA ll-C on tribu ting\nP erform ance\nIm portance\nP lay ing w ith\nS ignifica nt O the rs\nK eep ing up to\nE xpec ta tions\nP artne rs '\nIn f luence\nLow er A nxie ty\nLeve ls\nK nock -on\nE ffec t\nK eep ing\nC om posure\nca\nus\ne\ncause\nstr\nat.\ncons.\nc ons.\nR espons ib ility\ncons.\nstrat\nst\nra\nt\nco\nns\neq\nue\nnc\ne\nstrategy\nco\nns\n.\nca\nus\ne\nca\nus\ne\nstr\nate\ngy\nstra\ntegy\nstrategy\nstrategy\nstrategyconsequence\nc onsequenc e\nst\nra\nte\ngy\nstr\nat\neg\ny\nco\nns\neq\nue\nnc\ne\nca\nuse\ncause\nc onseq.\nconseq.\ncondition\ncondition\ns tra tegies\ncondition\nstrategy\nconseq.\nca\nus\ne\ncaus\ne\ncause\ncause\ncontextcontext\nc onse\nquenc\ne\ncons equence\nstr\nate\ngy\nconseq.\n \nFigure 4: Conditions, Strategies and Consequences of the Pianist's Regulating Role in the Musical Ensemble\n 37\nT IM E\nA V A IL A B IL IT Y\nL A C K  O F  T IM E\nC O N S E Q U E N C E S\nA C T IO N \/\nIN T E R A C T IO N\nS T R A T E G IE S\nIN T E R V E N IN G\nC O N D IT IO N S\nC O N T E X T U A L\nC O N D IT IO N S\nC O N S E Q U E N C E S\nA C T IO N \/\nIN T E R A C T IO N\nS T R A T E G IE S\nC O N T E X T U A L\nC O N D IT IO N S\nFam iliarity\nL on g-Term\nE n sem b les\nP iano  Trio\nFam ily E nsem b le\nS tring  Q ua rte t\nFam ilia rity Founda tion\nTim e  P res su re\nC om m on  In ten tiona lity\nP red ic ting\nL im ited  R ehea rs ing\nTim e\nC onnec tion \/E m pa thy\nU n fam ilia rity\nD if f icu ltie s\nM us ic  D irec t\nE xp ress ion  o f\nP e rs ona lity\nFac il ita ting\nM em oris a tion\nC om p lexity\nD ep th\nE f fo rtles s  P laying\nIn te rna lis ing  Tem po\nC om m on  Language\nU nde rs tand ing\nP a rtne rs\nU n fam ilia rity\nU np red ic tab il ity\nSho rt-Term\nE n sem b les\nM us ica l\nP e rs ona lity\nM us ica l A b il i ty\nP u tting  ou t\nFee le rs\nM us ic  as  a\nS ub lim ina l\nLanguage\nM us ic a l\nId ios ync ras ies\nVa ria tio n in\nF e e lings  To w a rds\nC o -pe rfo rme rs\nIns tinc tiv e\nIn te rac tion\nE nsem b le\nQ ua lity\nS pon tane ity\nTrus ting\nC o mmunica ting\nE ffe c tive ly\nM ak ing  the\nP e rfo rm ance  W ork\nU n fam ilia rity in\nA c com panying\nR ep erto ire\nM ed iatio n\nP erfo rm ance\nIm p ortance\nR epe rto ire  Fam ilia rity\nR epe rto ire  D if f icu lty\nR epe rto ire  C ho ic e\nR epe rto ire  E n joym en t\nE nsem b le\nR eh earsa l\nIn d ivid ual P ractice\nV a lu ing  R ehea rs a l\nTim e\nF irs t R ehea rsa l\nLandm ark\nD o ing  the  G roundw ork\nD e f in ite  Ideas\nR ehea rs a l\nE n joym en t\nP iano  M us ic\nR equ irem en ts\nTeam w ork\nP roduc tiv ity\nA ll-con tribu ting\nInd iv idua l\nP rac tice  E xten t\nR e he a rs a l\nInfo rming P ra c tic e\nR ehea rs a l\nU npred ic tab il ity\nIndiv idua l P ra c tic e\nE njo y me nt\nD e c is io n M a king\nLe tting  the\nS ide  D ow n\nLea rn ing  to  be\nFas t\nF o cus ing o n\nE ns e mble  Is s ue s\nB ird 's  E ye  V iew\nLea rn ing  A ll P a rts\nP rac tic e  M ak ing  S ens e\nTow ards  R ehea rsa l\nR ehea rs a l E xten t\nB e ing  R e liab le\nR eten tive  M em ory\nP lay ing\nTa lk ing  a t E a rly S tages\nO pen ing  a  P a th\nC o mmo n M us ica l\nG ro und\nE xpe rim en ting\nR eso lv ing\nM us ica l Is sues\nP e rfo rm ance\nE nd  R es u lt\nP e rfo rm ance\nU n iqueness\nP e rfo rm ance\nU np red ic tab il ity\nP laying  the\nM us ic  O nc e\nHa v ing R e he a rsa l\nC o nc e rts\nO n  the  S po t\nM us ic  M ak ing\nE m o tiona l\nF luc tua tions\nHe ighte ne d S ta te\no f Aw a re ne s s\nF irs t C onc e rt\nLandm ark\nP hys ica l\nC hanges\nFrag ile\nC oncen tra tion\nAnxie ty\nQ U A L IT Y A c tive  L is ten ingK now ledge\nD ep th M e mo riza tio n a s  a\nP o s se s s io n\nSigh t R ead in g\nFacilitation\nP erfo rm ing  U n fam ilia r\nR epe rto ire\nP iano  M us ic\nR equ irem en ts\nLas t M inu te\nE ngagem en ts\nR epe rto ire  V a rie ty\nP a rtne r V a rie ty\nLea rn ing  to  be  Fas t\nE a rn ing  R epu ta tion\nTrying  O u t N ew  P ieces\nQ U A N TIT Y\nS k ill\nS igh t R ead ing\nD raw back s\nR ap id ity\nTak ing  E v as ive\nA c tion\nS igh t R ead ing\nas  a  La te ra l\nA c tiv ity\nD if f ic u lt to\nL is ten\nIm ped ing\nM em oris a tion\nLack  o f\nTho roughness\nLack  o f  D ep th\nU n fam ilia rity\nS upe rf ic ia lity\nco\nns\neq\nue\nnc\ne\nco\nns\neq\nue\nnc\ne\nco\nns\neq\nue\nnc\ne\ncon\nseq\nuen\nce\nc ons\neque\nnce\nc onseq\nuenc e\nc onsequenc e\ncause\nconsequence\n   \n   \n   \n  c\non\nse\nqu\nen\nce\n   \n   \n   \n   \n   \nco\nns\neq\nue\nnc\ne\nco\nnd\niti\non\nstr\nat\neg\ny\nco\nnd\nitio\nn\nca\nus\ne\ncons.\nc ons.\nstrat.\n                 c onsequenc es\nc onsequenc e\n         c onsequenc e\nco\nns\neq\nue\nnc\ne\ncon\nseq\nuen\nce\nc ause\ncau\nse\nc ause\nc onsequenc e\nstrategy\n            strategy            stra tegy\n             strategy\n            strategy\n             strategy\n    \n    \n  c\non\ndit\nion\nc onseq.\nstrat.\ncause\ncause\nc ause\nc ause\nc aus\ne\nc onseq.\nconsequence\n \nFigure 5: Conditions, Strategies and Consequences of Time Availability or of Lack of Time in \nEnsemble Playing\n 38\nACHIEVING\nINTEGRATION\nCONTEXTUAL\nCONDITIONS\nIntegration\namong Partners\nIntegration with\nAudience\nPartners' Involvement\nAudience\nConsideration\nAudience Feedback\nCommucating\nEffectively\nEnergy Exchange\nEffortless\nConcentration\nImpressive\nEnsemble\nW atching\nConsidering\nAudience\nExpectations\nTalking to the\nAudience\nConsidering\nAudience\nReactions\nAudience\nEngagement\nSubjective\nPerformance\nReception\nDuring\nPerformance\nPost-Performance\nSilence\nApplause\nBody\nLanguage\nPositive\nFeedback\nAppreciation\nby Significant\nOthers\nMotivation\nPost-\nPerformance\nFeelings\nUnaffected\nAltered\nINTERVENING\nCONDITIONS\nLack of\nIntegration with\nAudience\nLack of\nIntegration\namong Partners\nDerogatory Attitude\nTowards the\nAccompanist\nSubordinate\nAccompanying\nRole\nEquality in\nChamber\nExpected\nPerfection from\nthe Accompanist\nAudience\nNoticing the\nAccompanist Less\nOfficial\nAnnouncements\nThe Piano Being\nAccompanied\nAccompanists'\nFight for\nRecognition\nCD Covers\nProgramme\nAnnouncement\nNames Printed\nin Different\nFonts\nNot Mentioned\nat All\nIncorrect\nListening\nSpecialized\nListener\nSingers' Behaviour\nSingers' Expectations\nDerogatory Attitude\nTowards the\nAccompanist\nEnd of Co-operation\nbetween Soloists and\nAccompanists\nThe Diva\nMentality\nA Paradox: Big\nPiano Parts\nLacking\nEnsemble Spirit\nEquality of\nStrength and\nTemperament\nExceptionality of\nthe Singing Act\nVocal Coaching\nChanging the\nPitch\nVoice Being\nthe Instrument\nFacing the\nAudience\nSinging W ords\nVoice\nVulnerability\nAnxiety\nTransposition\nSkills\nLack of\nMusical\nFoundation\nA Paradox:\nBecoming the\nHidden Star\nSubordinate\nAccompanying\nRole\nCrucial Piano\nPart\nProviding\nthe Pitch\nCreative\nAccompanying\nTime Between\nItems\nComposers\/\nPianists\nSetting the\nScene\nSinger's Power to Draw\nthe Audience Attention\nTowards or Away from\nthe Pianist\nACTION\/\nINTERACTION\nSTRATEGIES\nPerforming at\nBest\nHall Acoustics\nConnection\/Empathy\nEnjoyment Feedback\nMusical Ability\nRepertoire Enjoyment\nFamiliarity Facilitation\nAural Communication\nGetting Satisfaction of\nAchievement\nVisual Communication\nCapturing the Frisson\nAdequate Preparation\nInstant\nRecognition &\nReaction\nBeing Alert\nBeing in the\nMoment\nSpontaneity\nGetting out of Self\nCommon Musical\nGround\nCONSEQUENCES\nFlow\nGroup Self\nEffortless Playing\nTuning-in\nGreater than the Sum\nof its Parts\nThe Third\nElement\nstra\nteg\ny\nst\nra\nte\ngy\nstr\nate\ngy\nconsequence\nstra\nteg\ny\nstrate\ngy\nconsequence\nconsequence\nstr\nate\ngy\nstr\nat\neg\ny\nco\nnd\niti\non\nstr\nate\ngie\ns\n                     conseq.\nconseq.\ncontrast\ncausecontradiction\n     consequence\ncondition\ncondition\ncondition\ncause\nconseq.\nstr\nat\neg\ny\nstrategy\ncause\ncontradiction\nstrategy\nstrategy\ncause\nco\nns\neq\nue\nnc\ne\nconsequence\n       condition\ncon\nditio\nn\nstrateg\ny\nstrategy\nstrategy\nstrategystrategystrategystrategystrategystrategy\nconsequence\nstrategystrategy\ncons\nequ\nenc\ne\nconsequence\nconsequence\nst\nra\nte\ngy\nstrategy\ncau\nse\n \nFigure 6: Conditions, Strategies and Consequences of the Achievement of Integration in Ensemble \nPlaying \n 39\nH IG H  E N S E M B L E\nQ U A L IT Y\nA C H IE V IN G\nIN T E G R A T IO N\nR E G U L A T IN G\nE X T E R N A L IS A T IO N\nO F  A T T E N T IO N\nS E A R C H IN G  F O R\nB A L A N C E\nT IM E  A V A IL A B IL IT Y\nc au s e\nc on d ition s\nac tion\nc on text\nc on text\nc on d ition s\nc on text\nac tion\nac tion\nc on seq u en c es\nc on seq u en c es\nc on text\nc on seq u en c es\nac tion\nc on d ition s\nL A C K  O F\nIN T E G R A T IO N\nc on d ition s\nac tion\nc on seq u en c es\nL A C K  O F  T IM E\nc on text\nac tion\nc on seq u en c es\nc o n ju n c t iv e  e n s e m b le\np lu ra l ity  o f  id e a s\nc o m m o n  m u s ic a l\ng ro u n d\nc o m m o n  in te n t io n a l i ty\na c h ie v in g  c o -o rd in a t io n\nte c h n ic a l a b i l i ty\ng ro u p  s ize\ne xp e rie n c e  f a c i l i ta t io n\nh a l l  a c o u s t ic s\nm u s ic a l a d a p ta tio n\ne xp e rim e n tin g\nv is u a l c o m m u n ic a t io n\nb o d y  la n g u a g e\na c tiv e  l is te n in g\no p e n n e s s  &  f le x ib i l i ty\na d o p t in g  a n  o b je c tiv e\ns ta n c e\np ia n is t: s tro n g  l in k \/\nre g u la to r\na c c o m p a n is t: g u id e \/\nfa c i l i ta to r\nta k in g  e v a s iv e  a c tio n\no f f e rin g  m o ra l &\nm u s ic a l s u p p o rt\nd e f in i te  id e a s\nin s ta n t re c o g n itio n  &\nre a c tio n\nin f o rm e d  a c tio n\ns p o n ta n e ity\nb e in g  a le rt\nle tt in g  th e  s id e  d o w n\ne xp e rie n c e  f a c i l i ta t io n\nre p e rto ire  m e d ia tio n\np ia n is t's  re s tra in e d\nb o d i ly  a p p ro a c h\nf a m il ia ri ty  fa c i l i ta tio n\ng e tt in g  o u t o f  s e lf\nin te g ra t io n  w ith\na u d ie n c e\nin te g ra t io n  a m o n g\np a rtn e rs\np a rtn e rs ' in v o lv e m e n t\na u d ie n c e  c o n s id e ra t io n\np e rf o rm in g  a t b e s t\ng ro u p  s e lf\nf lo w\ntu n in g -in\ne f f o rtle s s  p la y in g\nd e ro g a to ry  a tti tu d e  to\nth e  a c c o m p a n is t\ne xp e c te d  p e rf e c tio n\nf ro m  th e  a c c o m p a n is t\ns in g e rs ' b e h a v io u r\ns in g e rs ' e xp e c ta tio n s\nlo n g -te rm  e n s e m b le s\nf a m il ia ri ty\nc o n n e c t io n \/e m p a th y\nin d iv id u a l p ra c tic e\ne n s e m b le  re h e a rs a l\nQ U A L ITY : k n o w le d g e\np e rf o rm a n c e\nim p o rta n c e\nre p e rto ire  m e d ia tio n\ns h o rt-te rm  e n s e m b le s\ns ig h t-re a d in g\nfa c i l i ta t io n\nle a rn in g  to  b e  f a s t\ns ig h t re a d in g  d ra w b a c k\nd if f ic u lt to  l is te n\nQ U A N TITY : s k i l l\nc on text\na c t io n\na c t io n\nc o n s e q u e n c e\nc o n d itio n\na c tio n\n c o n d it io n\na c t io n\na c tio n\nc o n s e q u e n c e\na c t io n\na c t io n\nc o n d itio n\nc o n s e q u e n c e\n      c a u s e\na c t io n\n   c o n d itio n\nc o n s e q u e n c e\nc o n s e q u e n c e\nc o n s e q u e n c e\n \n Figure 7: Story Line - Main Concepts \n 40\nthe cause searching for balance\nexternalisation of attentionthe context\nregulatingthe action\ntime availability \/ lack of timethe condition\nachieving integration \/\nlack of integration\nthe consequence\nREACHING FOR HIGH\nENSEMBLE QUALITY\n \nFigure 8: Categories Identification \n \n \n \n 41\nsearch in g  fo r b a lan ce\n(cau se)\nex tern a lisa tio n  o f a tten tio n\n(co n tex t)\nreg u la tin g\n(ac tio n )\nach iev in g  in teg ra tio n  \/\nlack  o f in teg ra tio n\n(co n seq u en ce)\ntim e\navailab ility  \/\nlack o f tim e\ncon\nditio\nn\nA im ing  for H igh  Q uality in  M usica l\nE nsem ble  P erform ance\nc ond itions\ncon d itions\nc ond itions\nT h e  P ian is t's  P ersp ective  o n  th e  A tta in m en t o f\nH ig h  Q u a lity  in  M u s ica l E n sem b le  P erfo rm an ce\nc ond itio ns\n \nFigure 9: The Pianist's Perspective on the Attainment of High Quality in Musical\nCONDITIONS: \ngroup size, instruments’ incompatibility, mechanical age, technical ability, experience facilitation, \nfamiliarity facilitation, the piano as an instrument (size of the piano), spatial dynamics (hall acoustics), \nadequate preparation, sight-reading drawbacks (difficult to listen), the pianist’s restrained bodily approach, \nlack of familiarisation with the piano part, repertoire familiarity, repertoire difficulty, repertoire \nenjoyment\/choice, derogatory attitude towards the accompanist, expected perfection from the accompanist, \nsingers’ behaviour, singer’s expectations, performance importance \n 42\n \nAPPENDIX - A SAMPLE OF THE INTERVIEW SCHEDULE \nThe questions that follow are only a sample of the ones covered in the interviews.  As mentioned in \nthe Methodology chapter, depending on each particular pianist’s interests and concerns, new questions \nwere added and non-relevant ones were omitted in order for the flow of the conversation to be \nfollowed in accordance with the semi-structured interview schedule.  \n \nWhat is your ensemble experience at present? How was your interest in ensemble playing developed?  \nWhat differences, if there are any, could you identify in yourself, according to your experience, between \nplaying with somebody else and playing solo? \nWhat do you think would be the similarities & differences between accompanying and chamber music \nplaying?  What do you like more during the performance, being the soloist or the accompanist or a chamber \nmusic player? Why?  What kind of abilities do you think that a pianist in ensemble should possess?  \nDo you think that it is important for the pianist in ensemble playing to possess sight-reading ability or not? \nWhat are the pros and cons of sight-reading in ensemble playing? \nWhat is your attitude towards improvisation and composition? Would some knowledge of improvisation and \ncomposition help the pianist in ensemble playing or not? \nDo you perform from memory? \nDo ensemble players try to achieve balance? In what respect? Why? How can balance be achieved? \nDo you try to achieve co-ordination in the ensemble? How is it achieved? How would you define co-\nordination in ensemble playing? \nDo you vary yourself\/your approach in any way depending on the different individuals that you play with and \nthe different situations you find yourself in? If yes, how? In what sense? \nHow do you choose your repertoire? Do you usually like the repertoire you perform? \nWhat is your attention focused on \/ directed towards during ensemble playing? \nDo you exchange feedback with the co-performer(s)? In what manner? \nHow do you think co-performers should behave towards one another? Why? Do you have any \narguments\/disagreements with the soloist or the chamber music partner? How do you approach those? \nDo you feel that as the pianist you have a central, equal or subordinate role in ensemble performance?  \nWhat are your concerns in ensemble performance? \nWhen are you more nervous, when you perform solo or when you play in ensemble? \nHow many people do you usually like to play with? \nDo you usually rehearse and perform with musicians that you know in advance or with unfamiliar musicians \nas well? What do you prefer? Why? \nDo you practise each piece before the rehearsal with the soloist (or with your partner in chamber music)? \nHow much do you usually rehearse with the soloist or your chamber music partner before the performance? \nHow would you describe the rehearsal process in terms of teamwork? \nWhen do you feel that you perform at your best? How do you feel when this happens? How would you \nperceive an ensemble performance of high quality as an audience member? \n \n 43\n"}