{"doi":"10.1111\/j.1475-4762.2007.00750.x","coreId":"15489","oai":"oai:dro.dur.ac.uk.OAI2:7127","identifiers":["oai:dro.dur.ac.uk.OAI2:7127","10.1111\/j.1475-4762.2007.00750.x"],"title":"Geographies of age : thinking relationally.","authors":["Hopkins,  P.","Pain,  R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-09-01","abstract":"In contrast to recent treatment of other social identities, geographers' work on age still focuses disproportionately on the social-chronological margins – the very young and (to a far lesser extent) the very old – and rarely connects them directly. We outline the benefits of creating relational geographies of age, in order to build out from the recent explosion of children's geographies, and discuss three helpful concepts: intergenerationality, intersectionality and lifecourse. We suggest that participation provides one epistemological vehicle for getting beyond geographies which are mainly adults'","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15489.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7127\/1\/7127.pdf","pdfHashValue":"8aff85d33ae691253dbad50ddff33d2824385f23","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7127<\/identifier><datestamp>\n      2010-08-03T14:28:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Geographies of age : thinking relationally.<\/dc:title><dc:creator>\n        Hopkins,  P.<\/dc:creator><dc:creator>\n        Pain,  R.<\/dc:creator><dc:description>\n        In contrast to recent treatment of other social identities, geographers' work on age still focuses disproportionately on the social-chronological margins – the very young and (to a far lesser extent) the very old – and rarely connects them directly. We outline the benefits of creating relational geographies of age, in order to build out from the recent explosion of children's geographies, and discuss three helpful concepts: intergenerationality, intersectionality and lifecourse. We suggest that participation provides one epistemological vehicle for getting beyond geographies which are mainly adults'. <\/dc:description><dc:subject>\n        Age<\/dc:subject><dc:subject>\n         Intergenerationality<\/dc:subject><dc:subject>\n         Intersectionality<\/dc:subject><dc:subject>\n         Lifecourse<\/dc:subject><dc:subject>\n         Relationality.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Area, 2007, Vol.39(3), pp.287-294 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7127<\/dc:identifier><dc:identifier>\n        issn:0004-0894<\/dc:identifier><dc:identifier>\n        issn: 1475-4762<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1475-4762.2007.00750.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7127\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1475-4762.2007.00750.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7127\/1\/7127.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1475-4762"," 1475-4762","issn:0004-0894","0004-0894"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Age","Intergenerationality","Intersectionality","Lifecourse","Relationality."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n03 August 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHopkins, P. and Pain, R. (2007) ’Geographies of age : thinking relationally.’, Area., 39 (3). pp. 287-294.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1475-4762.2007.00750.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nPublished on behalf of the Royal Geographical Society (with the Institute of British Geographers).\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nGeographies of age: thinking relationally \nPeter Hopkins* and Rachel Pain** \n \n \n* Department of Geography, Lancaster University, Lancaster LA14YB UK \np.hopkins@lancaster.ac.uk \n \n \n** Department of Geography, Durham University, South Road, Durham DH1 3LE \nUK rachel.pain@durham.ac.uk  \n \nAbstract \n \nIn contrast to recent treatment of other social identities, geographers’ work on \nage still focuses disproportionately on the social-chronological margins; the very \nyoung and (to a far lesser extent) the very old, and rarely connects them directly. \nWe outline the benefits of creating relational geographies of age, in order to build \nout from the recent explosion of children’s geographies, and discuss three helpful \nconcepts: intergenerationality, intersectionality and lifecourse. We suggest that \nparticipation provides one epistemological vehicle for getting beyond \ngeographies which are mainly adults’.  \n \nKeywords: age, intergenerationality, intersectionality, lifecourse, relationality \n \nIntroduction \n \n With regards to the study of race in geography, Alastair Bonnett (1997, \n194) observed a decade ago that there has been ‘a perversely intense focus \nupon the marginal subject-groups constituted within the Western and imperial \nimagination. The White centre of that imagination has not been discussed’. \nFollowing familiar parallel histories, research on gender in geography before the \n1990s largely concerned women as its subject (Women and Geography Study \nGroup 1997), and work on sexuality focused on sexualities at the margins rather \nthan heterosexualities (Hubbard 2000). \n  The study of age in geography is also undergoing striking change, with a \nrecent explosion of interest in children and young people following a far more \nlimited interest in the very old. Yet geographers have still to break out of the \ntradition of fetishising the margins and ignoring the centre. While work on age \nmight still be accused of being, in many ways, adults’ geographies (Maxey 2006; \nWeller 2006), there are no geographies of adults in sight. In this paper we ask \nwhy, and suggest what relational geographies of age might look like. \n The problem is not that geographers have ignored the situated, fluid and \ncontested nature of age. The earliest geographical studies of childhood \nproblematised the common association of qualities, capacities, roles and life \nexperiences with fixed chronological age groups (James 1990; Winchester \n1991). This conceptual mainstay has been developed over the last 15 years in \ndifferent fields (e.g. Katz 1993; Panelli 2002; Valentine 1996). Attention to older \npeople’s lives has been far patchier. Beyond mapping ill health and service \nprovision, the critical literature on old age is miniscule. In the geographical work \nwhich exists, however, ‘old age’ has also been viewed as culturally variable and \nunderpinned by a range of social and economic processes, lived experiences \nand spatial practices (e.g. Harper 1997; Harper and Laws 1995; Mansvelt 1997; \nLaws 1994; Pain et al 2000). Thus, drawing on ideas within the ‘new social \nstudies of childhood’ (Holloway and Valentine 2000) and critical social \ngerontology (e.g. Bytheway 1995; Featherstone and Wernick 1995), it has \nbecome a mantra among geographers that: \n \nAge is a concept which is assumed to refer to a biological reality.  However, \nthe meaning and experience of age, and of the process of ageing, is subject \nto historical and cultural processes … Both youth and childhood have had \nand continue to have different meanings depending on young people’s \nsocial, cultural and political circumstances.  \n                        (Wyn and White, 1997: 10).  \n \nThis shift from seeing age and lifecourse stages as socially constructed \ncategories rather than independent variables means that space and place gain \nsignificance. People have different access to and experiences of places on the \ngrounds of their age, and spaces associated with certain age groups influence \nwho uses them and how. Further, people actively create and resist particular age \nidentities through their use of space and place (see Pain et al 2001; Valentine \n2004).  \n Despite all this, age has been given a fixity which belies the suggestion of \ncultural variance and fluidity. Our very focus on children, and the development of \na solid sub-discipline of scholarship around them, often seems at odds with how \nwe would like to conceptualise their experiences. We might pause here to reflect \nwhy it is the very young who now have such disproportionate research attention \nin geography. Both older and young people inhabit the social-chronological \nmargins, the argument goes, and in western societies are stereotyped as \neconomically dependent, physically less able and socially excluded (Pain et al \n2001). These sweeping generalisations belie the vast social, cultural and \neconomic diversity among both old and young and in the patterns of their lives. \nHowever children, it seems from scanning recent geographical work, are far \nmore accessible, appealing and rewarding as research subjects. The current \nexplosion is a far cry from James’ (1990) plea for not ignoring children. Even \nteenagers have been relatively neglected within all of this (Hopkins, 2006a, \nValentine, 2003, Weller 2006). Yet the aged geographies, particularly of young \nand middle aged adults, are missing altogether (Maxey 2006). The politics of an \nexclusive focus on narrow identity groups – particularly those at the margins of \nsociety – are disturbing. For example, Burton et al (1996) demonstrate how the \npaucity of research on the particular experiences of teenagers of colour acts to \nlabel them as deviant. Equally, without situating older people clearly within the \nsocial and political relations that connect them (and which they share) with the \nyoung, analysing issues such as the fear of crime runs the risk of imagining them \nas fearful, irrational victims (see for example Loader et al 1998).   \nOne way forward, as we elaborate in the rest of the paper, is to create \nmore relational geographies of age. If we think about and work with age as being \nproduced in the interactions between different people, then it becomes more \ndifficult to talk about geographies of children, older people or anyone else in \nisolation. For example, as Tracey Skelton illustrates: \n \nThe focus on children as individuals is potentially important as part of \ndebates about their rights but in poorer communities separating children \nfrom inter-generational networks in the communities can have disastrous \nconsequences. Such networks are often part of complex reciprocal relations \nthat are invaluable at times of crisis or insecurity. \n                                          (Skelton, forthcoming 2007) \n \n A second important consideration and core theme for our paper is \nparticipation. We suggest this somewhat cautiously, as despite recent \nproliferation of interest in human geography, it cannot offer a panacea for identity \nresearch. But if we accept that much work on geographies of age is planned, \nconducted, theorised and disseminated by young and middle-aged adults – and \nthat our positionalities and perspectives are as aged as the experiences we are \ninvolved in researching - then participation in the form of co-research with non-\nacademics becomes a feasible way forward. We return to this point in our \nconclusion. \n In the remainder of the paper, we highlight three concepts which \ngeographers are beginning to adopt in their work on age which, together, \nundermine the narrow focus on the very young and the very old, and provide a \nframework for thinking about age relationally. These are intergenerationality, \nintersectionality and lifecourse. We want to be clear that these concepts are not \nnew; they have a reasonably long heritage in other disciplines, and are beginning \nto be employed by geographers.    \n \nIntergenerationality \n \n Relationality does not just pose interesting questions about age, but marks \na fundamental change in the way we approach and think about it. Maxey (2006), \nPunch (2002), Skelton (2000, 2007), Tucker (2003) and Valentine (2003) are \namongst those who have raised some important questions in this regard. This \ncurrent interest in relationality and networks tends to focus more widely on \nfamilies, generations and interactions, and situates people of particular ‘ages’ \nwithin these contexts.  \n Intergenerationality is a keystone of these more relational geographies of \nage, and has implications which merit far more attention than it has received so \nfar. It refers to the relations and interactions between generational groups. \nViewing intergenerationality as an aspect of social identity suggests that \nindividuals’ and groups’ sense of themselves and others is partly on the basis of \ngenerational difference or sameness. These identities are not fixed but dynamic, \naffected by the relations between different age groups or generations which may \nvary (Bytheway 1995; Edmunds and Turner 2002a). Interaction, isolation, \ndivergence, conflict, cooperation and so on all have material effects on the \nexperiences and quality of life of older and younger people in particular settings. \nA stance that intergenerationality is important in understanding the construction \nand experience of identity entails more than, for example, acknowledging that \nwhat it is to be a child is affected by people of other age groups. It also suggests \nthat identities of children and others are produced through interactions with other \nage\/generational groups and are in a constant state of flux. Therefore, children \nand childhood interact with others in family and community settings and so are \nmore than children alone; studying them in context adds new layers to our \nunderstanding.  \n These interactions, relations and their outcomes are also dynamic, and \nthe variability of intergenerationality in different situated contexts should be of \ngreat interest to geographers (see Pain 2005; Vanderbeck 2007). There are \nissues at a range of scales and sites that geographers could usefully interrogate, \nand small numbers have begun this task. The impacts of global age profiles and \nthe intergenerational contract within nation states tend to be seen in very \nnegative terms, although a critical literature is developing (see Harper 2005). \nIssues of social identity among and between generational groups at macro levels \nhave also seen some critical attention outside of geography (e.g. Edmunds and \nTurner 2002a, 2002b; Kerns 2003), including work on pensions and the ‘cost’ of \ndifferent generations to others (Walker 1996). Local cultural differences within \ntheir global contexts have proven of interest to geographers focusing on \ngenerational patterns and change over time (Chant and McIlwaine 1998; Katz \n1993, 2004). Most research interest has focused on these levels of nation state \nor family, rather than interactions and connections in public spaces\/public \narenas. Nonetheless several geographers’ investigations into young people’s use \nof urban spaces have raised, though not fully explored, issues of \nintergenerational conflict (Skelton 2000, Matthews et al 2000, Pain 2003). \nTucker’s (2003) work explores the concept of generation in relation to girls’ \nspatial lives in more depth. More positive aspects of intra-community relations \nsuch as cohesion and learning are often missing from this body of geographical \nwork, though Shirlow’s work in Northern Ireland (e.g. Shirlow 2003) is an \nimportant exception. At all of these scales, intergenerationality tends to be \nconstituted in terms of crisis, conflict and fearfulness, rather than ambivalence, \ncohesion or hope.  \n At the intra-family scale, a small but important body of work in geography \non parenting and parent-child relations also provides a springboard for further \nwork on the complex webs of generational relations, notably fathering (Aitken \n2000, 2005, Hopkins 2006b), mothering (Holloway 1998, 1999) and families’ \ntime-space patterns (Jarvis 2005), as well as parents’ and children’s everyday \npractices in contesting the use of space (McKendrick 1997; Valentine 2004; \nValentine and Holloway 2001). The emotional aspects of intergenerational \nrelationships have been explored recently by Ross et al (2005), who focused on \nthe relationships between teenagers and their grandparents, emphasising their \nimportance for young people’s feelings of connectedness, the influence of \nchange over time and the importance of particular events (such as parental \ndivorce) in these relationships. Hopkins’ (2006b) research on the relationships \nbetween young Muslim men and their parents, in particular their fathers, found \nthat they often respected the hard-working nature of their parents’ generation, \nand in so doing challenged the notion of generational conflict within ethnic \nminority communities. Work outside the global North also throws these issues \ninto sharp perspective - see Young and Ansell’s (2003) account of families \naffected by HIV\/AIDS in southern Africa which identifies the complexities of \nintergenerational relations when traditional family structures are disrupted.  \n \nIntersectionality \n \n To advance geographers’ understandings and appreciation of age in \ndifferent places and times, another mechanism is to adopt the concept of \nintersectionality. Crenshaw (1993) employed intersectionality to analyse the \nvarious ways in which gender and race influence the multi-dimensional nature of \nBlack women’s employment experiences. As she observes, her intention was  \n \n…to illustrate that many of the experiences Black women face are not \nsubsumed within the traditional boundaries of race or gender discrimination \nas these boundaries are currently understood, and that the intersection of \nracism and sexism factors into Black women’s lives in ways that cannot be \ncaptured wholly by looking at the race of gender dimensions of those \nexperiences separately. \nCrenshaw (1993, 1244) \n \nMore recently, Brah and Phoenix (2004) have revisited debates about \nintersectionality, highlighting a range of important works across the social \nsciences that have sought to explore the ways in which various markers of social \ndifference – gender, class, race, (dis)ability, sexuality, age, and so on – intersect \nand interact. Although some human geographers have also contributed to such \nunderstandings (e.g. Dwyer 1999, Nayak 2003), much work has still to be done \nwith regard to the intersection of particular age, generational and other identities \nand their spatial specificity (see for example Hopkins 2007a). Clearly, the ways in \nwhich age is lived out and encountered are likely to vary according to different \nmarkers of social difference; the everyday experiences of people belonging to \nparticular age groups are diverse and heterogeneous. A primary question is \nalways who else older, middle-aged or young people are.  \n Two examples of youth geographies research demonstrate possible \nroutes for taking intersectionality forward. First, Dwyer’s (1999) work has drawn \nattention to the ways in which religious, ethnic and gendered identities intersect \nwith age in the experiences of young Muslim women in the west. She highlights \nthe ways in which young women’s everyday identities were influenced by \nethnicised and religious discourses, and describes how they were also expected \nto reproduce the parental culture with a particular emphasis upon family honour \n(izzat). This work demonstrates the potential for both intersectional and \nintergenerational geographies of age to advance understandings of people and \nthe places they inhabit. A second example from McDowell’s (2003) research \ndemonstrates how class, masculinity and place intersect with understandings of \nwork to create particular experiences for working-class young men in the UK. \nHere, a series of intersectional influences on the young men – their performance \nof their masculine identities, their locality and class-based expectations and their \nfamilial experiences and outlooks – all combine to determine their employment \nprospects and future trajectories.  \n Relational geographies of age could usefully build upon such work. \nDifferent markers of identity may intersect with age in interesting and important \nways, influencing for example how different generational groups perceive and \nrelate to each other in different settings (see Arber and Ginn 1995; Bairner and \nShirlow 2003; Edmunds and Turner 2002b; Katz and Monk 1993; Pain et al \n2000). Some markers may intersect with age in very powerful ways; others may \nmake age far less significant in relation. Geographers have much to contribute to \nexisting work in the social sciences here, particularly in highlighting the \nsignificance of place and the importance of locality to intersectional and \nintergenerational experiences of age.  \n \nLifecourse \n  A lifecourse approach involves recognition that, rather than following fixed \nand predictable life stages, we live dynamic and varied lifecourses which have \nthemselves different situated meanings. The term lifecourse has ‘been adopted \nas a way of envisaging the passage of a lifetime less as the mechanical turning \nof a wheel and more as the unpredictable flow of river’ (Hockey and James, \n2003, 5). Again, it is a well established concept in other disciplines, but lifecourse \ngeographies, aside from important collections by Katz and Monk (1993) and \nTeather (1999), have not been addressed in detail.  \n There is much to be done from a geographical perspective in excavating \npathways and experiences over the lifecourse, and examining the relation of \ndifferent experiences across it. This more relational perspective has begun with \nrecent work on transitions. Studies have focused on the increasingly problematic \nmove from school to work (McDowell 2003) and from childhood to parenting \n(Bynner 2001), and explored the fuzzy (teenage) generational boundaries \nbetween childhood and youth (Skelton 2000; Valentine 2003; Weller 2006). As \nJeffrey and McDowell observe, ‘the transition to adulthood is perhaps more \ncomplex and contested that in any previous era’ (2004, 131), and Jones notes \nthat ‘young people can become adult according to one criterion but not another’ \n(2002, 2). Young people’s ability to move through these transitions is likely to be \ninfluenced by their class position as well as their gender, race, sexuality, \n(dis)ability and locality. Along similar lines, the work of the developmental \npsychologist Arnett (2004) has shown how young people’s transitions to \nadulthood are becoming elongated. Arnett (2004, 8) has developed a theory of \n‘emerging adulthood’ which is characterised as having certain fluid \ncharacteristics: an age of identity exploration, an age of instability, the self-\nfocused age, the age of feeling in-between and the age of possibilities. As \nMcIlwaine and Datta (2004, 485) note in discussing youth transitions in the global \nNorth and the South, ‘the transition from childhood to adulthood is partial, \ninconsistent and contradictory’ in both hemispheres. For these reasons, Punch \n(2002) pursues a contextual and relational approach to youth transitions, and \nwhat she calls ‘negotiated interdependence’, which might usefully be extended \nacross the lifecourse.  \n Very few geographers have explored other lifecourse transitions, or \nindeed the lifecourse in its entirety. Examples which are likely to provide rich \nseams of understanding are the transition to and meaning of ‘middle-age’, \nexperiences of retirement, and oral history approaches which link and relate the \nexperiences of individuals and broader processes over time and space. \nExperiences of lifecourse transitions are also constantly changing (Arnett 2004); \nif some young people are obtaining ‘adult’ status later in life, what happens to \ntheir expectations and experiences of other lifecourse transitions? What do \npeople perceive as key points in the lifecourse and what are their expectations of \nthese? How do particular stages of the lifecourse differ over time and space? \nHere intergenerational and intersectional geographies come together, as familial \nrelations and tensions as well as the range of markers of social difference \ninfluence and demarcate people’s experiences of the lifecourse. \n Participation: geographies with older people, children, and everyone in \nbetween… \nIf geography continues to be adultist, and the geographies it produces adults’, \nthen there is a need to think seriously about ways and means of making good our \ncommitment to inclusion and to benefits accruing to ‘researched’ populations. \nMatthews (2005, 271) has recently argued that geographers’ approach to \nchildren and young people must differ from our approach to women and people \nwith disabilities, on the basis that ‘most children are not in positions where they \ncan routinely challenge the sustaining hegemony…[and are] unlikely ever to be \npart of the Academy’ (Matthews 2005: 271). We differ slightly, as participatory \nco-research provides one way in which young people have been involved in \nacademic work and social change, producing geographies of age which are \nshaped by a far wider range of aged perspectives (e.g Cahill 2007a, 2007b; \nLeyshon 2002; Maxey 2004; McIlwaine and Datta 2004). Lively recent debate \nabout the limits to and dangers of promising participation has not dampened \ngeographers’ search for methods, theories and practices of participation that \nwork (Cameron and Gibson 2004; Kesby forthcoming; Kindon et al in press; \nMohan 2001; Pain 2004). As concerns older people, such debates and \napproaches for meaningful inclusion in the academy are barely present in \ngeography (though well developed elsewhere; see HelpAge 2002 and Pain \n2005). Nor have participatory approaches been used with adults as adults by \ngeographers.  \n Participatory research approaches are well suited to relational knowledge \ncreation. For example, participatory techniques have been widely used outside \ngeography by groups of older and young people in intergenerational practice, \nwhere knowledge and\/or social action outcomes are jointly created (Pain 2005). \nThese are also used to develop common understanding of how other identities \nintersect, and to work through associated problems and seek solutions (for \nexample see www.magicme.co.uk). Finally, as Andrews et al (2006) show in their \ncall for the reinvigorated use of oral histories in human geographical research, \nthere exist other interesting methods with which to explore intersectionality, \nintergenerationality, lifecourse within participatory approaches. \n \nConclusions: moving forward \n A call for more relational geographies of age runs throughout this paper. \nThis is one way forward, we suggest, conceptually. In this brief discussion of a \nnew seam of geographical scholarship on age, and the large territory which \nremains to be mapped, we have argued that the three concepts of \nintergenerationality, intersectionality and lifecourse undermine the narrow focus \nof geographers to date on the very young and the very old, and provide a \nframework for thinking about age relationally. Further, rather than suggesting \nthey are deployed in isolation, we have tried to show how they relate to each \nother. This means of conceptualising geographies of age is relevant to all areas \nof the discipline, not just the social geographies of identity where most interest \nhas focused to date.  \nFew studies within the discipline have made an explicit attempt to link \nthese three concepts. However, there is some recent work which may provide a \nuseful reference point for developing future relational geographies of age. \nAlongside Vanderbeck’s (2007) recent call for a focus upon intergenerational \ngeographies, Rawlins (2006) highlights important ways in which young girls’ \nsenses of identity and fashion are interwoven with their relationships with their \nmothers. Hopkins (2006b) discusses the importance of intergenerational \nrelationships between young Muslim men and their fathers, their multiply \nintersecting identities (Hopkins, 2007a) and their location across the lifecourse to \ntheir experiences of everyday life.  \n These concepts are never neutral, but are contested and power-laden \nideas in themselves which need some careful handling and exploration. They \nraise questions about who decides which identities, ages or generations are \nprominent in structuring people’s experiences. Particular ‘age groups’ tend to \ndominate different settings under examination, as well as policy and research \nencounters (Pain 2005). Part of geographers’ work might be continuing to \nchallenge the stereotypes associated with particular ages, and explore how \nalternative ways of being an adult or a child disrupt fixed-age geographies \nfurther, including but not restricted to adult education, adult play, non-working \nadulthood, differential experiences of adultness, constructions of family, \nparenting and alternatives, child carers, child labour and prostitution (see for \nexample, Robson 2004a, 2004b; Van Blerk 2006; Young and Ansell 2003). \nGeographers have now produced many examples of the disciplining and \nregulation of children and childhood spaces, as well as examples of ageism in \nolder people’s lives; exploring some very different and often more positive \nalternative lives might provide a refreshing break for theory and empirical \npractice. Furthermore, relatively little work has drawn out the dynamic shape and \nexperience of age and generational identities at different times and in different \nspaces, and the ways in which this relates to the politics of scale (Hopkins, \n2007b). \n A second important theme has been participation. This is one way \nforward, we suggest, epistemologically and methodologically, and participatory \nresearch approaches are well suited to relational knowledge creation. \nParticipation provides another answer to the concerns recently voiced that \nchildren’s geographies in particular have become descriptive with no end \npurpose (Horton and Kraftl 2005; Matthews 2005), and promotes a usefulness \nand relevance led by younger (or older) people - in combination with, rather than \nin opposition to, the development of exciting theory (see Beale 2006; Pain 2006). \nFor many, too, participation into the academy involves more than research; it \napplies to teaching students (see Kindon and Elwood forthcoming), including \nolder students from non traditional backgrounds, in our links with schools \n(Hopkins 2006a), activism within the academy (see Chatterton 2005) and other \npublic and outreach activities.  \n In conclusion, it is time for analysis of age in human geography to take a \nmore inclusive and holistic view, and at the same time to become more \nconscious of the politics of fetishising the social-chronological margins. As yet, \nanalysis of age is a little way off taking its place among the other maturing \napproaches to social identities and difference in human geography.  \n \nAcknowledgements \nWe are grateful for the constructive comments of two reviewers.  \nReferences \n \nAitken S 2000 Fathering and faltering: ‘Sorry, but you don’t have the necessary \naccoutrements’ Environment and Planning A 32 581–98 \nAitken S 2005 The awkward spaces of fathering in Van Hoven B and \nHorschelmann K eds Spaces of masculinities Routledge, London 222–36 \nAndrews G J, Kearns R A, Kontos P and Wilson V 2006 Their finest hour: \nolder people, oral histories and the historical geography of social life \nSocial and Cultural Geography 7  2  153-25 \nArber S and Ginn J 1995 Connecting gender and ageing: a sociological \napproach Open University Press, Buckingham \nArnett JJ 2004 Emerging Adulthood: the winding road from the late tends \nthrough the twenties Oxford University Press, Oxford \nBairner P and Shirlow P 2003 When leisure turns to fear: understanding the \nreproduction of ethno-sectarianism in Belfast. Leisure Studies 22 203-221 \nBeale N 2006 The practicalities of theory: engagement, relevance and \napplication Children’s Geographies 4(2) 219 - 224 \nBonnett A 1997 Geography, ‘race’ and Whiteness: invisible traditions and \ncurrent challenges Area 29(3) 193-199 \nBrah A Phoenix A 2004 Ain’t I a woman? Revisiting intersectionality Journal of \nInternational Women’s Studies 5(3) 75-86. \nBurton L M, Obeidallah D A and Allison K 1996 Ethnographic insights on \nsocial context and adolescent development among inner-city African-\nAmerican teens. In Jessor R, Colby A and Shweder R A (eds) \nEthnography and human development: context and meaning in social \ninquiry  University of Chicago Press, Chicago 395-418 \nBynner J 2001 British youth transitions in comparative perspective Journal of \nYouth Studies 4 5-23 \nBytheway 1995 Ageism Open University Press, Buckingham \nCahill C 2007a Doing research with young people: participatory research and the \nrituals of collective work Children’s Geographies. \nCahill C 2007b The personal is political: developing new subjectivities in a \nparticipatory action research process Gender, Place, and Culture.  \nChant S and McIlwaine C 1998 Three generations, two genders, one world: \nwomen and men in a changing century Zed Books, London \nChatterton P 2005 Can we teach and research our way out of this mess? Paper \npresented to the Royal Geographical Society\/Institute of British \nGeographers Annual Conference, London, September 2005.  \nCrenshaw K 1993 Mapping the margins: intersectionality, identity politics, and \nviolence against women of color Stanford Law Review  43(6) 1241-1276 \nDwyer C 1999 Contradictions of community: questions of identity for young \nBritish Muslim women Environment and Planning A 31(1) 53-68. \nEdmunds J and Turner B S 2002a Generational consciousness, narrative, and \npolitics Rowman and Littlefield, Lanham \nEdmunds J and Turner B S 2002b Generations, culture and society OUP \nBuckingham. \nFeatherstone M and Wernick A 1995 Images of aging: cultural representations \nof later life Routledge, London \nHarper S 1997 Constructing later life\/constructing the body: some thoughts from \nfeminist theory in Critical Approaches to Ageing and Later Life eds \nJamieson A Harper S Victor C Open University Press, Buckingham 160-\n74  \nHarper S 2005 Ageing societies Hodder, London \nHarper S and Laws G 1995 Rethinking the geography of ageing Progress in \nHuman Geography 19(2) 199-221  \nHelpAge International 2002 Participatory research with older people: a \nsourcebook  http:\/\/www.helpage.org\/research\/pla\/plamiddle.html  \nHill M & Tisdall K 1997 Children and Society Pearson Education, Essex \nHockey J & James A 2003 Social identities across the life course Palgrave \nMacmillan, New York \nHolloway S L 1998 ‘‘She lets me go out once a week’: mothers’ strategies for \nobtaining personal time and space’ Area 30(4) 321-30 \nHolloway S L 1999 ‘Reproducing motherhood’ in Laurie N Dwyer C Holloway S \nand Smith F Geographies of new femininities Longman, Harlow \nHolloway S L and Valentine G 2000 Spatiality and the new social studies of \nchildhood. Sociology, 34, 763--783. \nHopkins PE 2006a Youth transitions and going to university: the perceptions of \nstudents attending a geography summer school access programme Area \n38(3) 240-247 \nHopkins PE 2006b Youthful Muslim masculinities: gender and generational \nrelations Transactions of the Institute of British Geographers 31(3) 337-\n352 \nHopkins PE 2007a Young people, masculinities, religion and race: new social \ngeographies Progress in Human Geography \nHopkins, PE 2007b Global events, national politics, local lives: young Muslim \nmen in Scotland Environment and Planning A 39(3) \nHorton J and Kraftl P 2005 For more-than-usefulness: six overlapping points \nabout children’s geographies. Children’s Geographies 3(2) 131-43 \nHubbard P J 2000 Desire\/disgust: moral geographies of heterosexuality \nProgress in Human Geography 24(2)191-217 \nJames S 1990: Is there a place for children in geography? Area 22(3) 278-83. \nJeffrey C McDowell L 2004 Youth in a comparative perspective: global change, \nlocal lives, Youth and Society 36(2) 131-142 \nJones G 2002 The youth divide: diverging paths to adulthood Joseph Rowntree \nFoundation, York \nKatz C 1993 Growing girls\/closing circles: limits on the spaces of knowing in rural \nSudan and US cities. In Katz C and Monk J  Full Circles: Geographies of \nWomen over the Lifecourse. London, Routledge 88-106. \nKatz C and Monk J 1993 Full Circles: Geographies of Women over the \nLifecourse. London: Routledge. \nKatz C 2004 Growing up global: economic restructuring and children’s everyday \nlives University of Minnesota Press, Minnesota \nKerns M 2003 Post-solidarity and postmodern intergenerational relationships \nGerontologist 43 252 \nKindon S, Pain R and Kesby M in press Participatory action research \napproaches and methods; connecting people, participation and place \nRoutledge, London \nKindon S and Elwood S forthcoming Widening participation? Participatory \naction research and geography teaching Journal of Geography in Higher \nEducation \nLaws G 1994 Aging, contested meanings, and the built environment \nEnvironment and Planning A  26  1787-1802 \nLeyshon M 2002 On being ‘in the field’: practice, progress and problems in \nresearch with young people in rural areas Journal of Rural Studies 18 179-\n91. \nLoader I, Girling E and Sparks R 1998 Narratives of decline: youth, dis\/order \nand community in an English ‘Middletown’ British Journal of Criminology \n38  3  388-403 \nMansvelt J 1997 Working at leisure: critical geographies of ageing Area 29(4)  \n289-98 \nMatthews H 2005 Editorial: rising four: reflections on the state of growing-up \nChildren’s Geographies 3(3) 271-3 \nMatthews H Limb M and Taylor M 2000 The street as ‘thirdspace’, in Holloway \nSL and Valentine G eds. Children’s Geographies: Playing, Living, \nLearning, London: Routledge 63-79. \nMaxey L 2004 The participation of younger people within intentional \ncommunities: evidence from two case studies Children’s Geographies 2(1) \n29-48. \nMaxey L 2006 Playing with age: performativity and participation within children's \ngeographies. Unpublished paper, University of Swansea \nMcDowell L 2003 Redundant masculinities: employment change and white \nworking class youth Blackwell, Oxford. \nMcIlwaine C and Datta K 2004 ‘Endangered Youth?’: Youth, Gender and \nSexualities in Urban Botswana Gender, Place and Culture 11(4) 483-511. \nMcKendrick J 1997 Regulating children’s street life: a case study of everyday \npolitics in the neighbourhood. SPA Working Paper 39, School of \nGeography, University of Manchester.  \nNayak A 2003 Last of the ‘Real Geordies’? White masculinities and the \nsubcultural response to deindustrialisation Environment and Planning D: \nSociety and Space 21(1) 7-25. \nPain R 2003 Youth, age and the representation of fear. Capital and Class 60 \n151-71 \nPain R 2005 Intergenerational relations and practice in the development of \nsustainable communities Report to Office of the Deputy Prime Minister, \nLondon. \nPain R 2006 Social geography: seven deadly myths in policy research Progress \nin Human Geography  \nPain R, Mowl G Talbot C (2000) Difference and the negotiation of ‘old age’ \nEnvironment and Planning D: Society and Space 18(3) 377-94    \nPain R Barke M Gough J Fuller D MacFarlane R Mowl G 2001 Introducing \nSocial Geographies Arnold, London \nPanelli R 2002 Young rural lives: strategies beyond diversity Journal of Rural \nStudies 18 113-122 \nPunch S 2002 Youth transitions and interdependent adult-child relationships in \nrural Bolivia Journal of Rural Studies 18 123-33 \nRawlins E 2006 Mother knows best? Intergenerational notions of fashion and \nidentity Children’s Geographies 4(3) 359-377 \nRobson E 2004 Hidden child workers: Young carers in Zimbabwe Antipode \n36(2) 227-248  \nRobson E 2004 Children at work in rural Northern Nigeria: Patterns of age, \nspace and gender Journal of Rural Studies 20 193-210  \nRoss N Hill M Sweeting H & Cunningham-Burley S 2005 Grandparents and \nteen grandchildren: exploring intergenerational relationships CRFR, \nEdinburgh \nShirlow P 2003 Ethno-sectarianism and the reproduction of fear in Belfast \nCapital and Class 60(2) 77-94 \nSkelton T 2000  Nothing to do, nowhere to go?’: teenage girls and ‘public’ space \nin the Rhondda Valleys, South Wales, in Holloway SL and Valentine G \n(eds.) Children’s Geographies: Playing, Living, Learning  London: \nRoutledge  80-99 \nSkelton T 2007 Children, young people, UNICEF and participation. Children’s \nGeographies \nTeather E 1999 ed Embodied geographies: spaces, bodies and rites of passage  \nRoutledge, London \nTucker F 2003 Sameness or difference? Exploring girls’ use of recreational \nspace. Children’s Geographies 1(1) 111-24 \nValentine G 1996 Angels and devils: moral landscapes of childhood, \nEnvironment and Planning D: Society and Space, 14: 581-599. \nValentine G 2003 Boundary crossings: transitions from childhood to adulthood. \nChildren’s Geographies 1(1) 37-52 \nValentine G 2004 Public space and the culture of childhood Ashgate, Aldershot \nVan Blerk 2005 Ethiopia's 'business girls': negotiating strategies for \nempowerment and belonging through commercial sex, AAG Annual \nConference, Denver, 5-9th April 2005  \nVanderbeck R 2007 Intergenerational geographies: age relations, segregation \nand reengagements. Geography Compass in press \nWalker A 1996 The new generational contract: intergenerational relations, old \nage and welfare UCL Press, London \nWeller S 2006 Situating (young) teenagers in geographies of children and youth \nChildren’s Geographies 4(1) 97-108 \nWinchester H 1991 The geography of children Area 23(4) 357-60. \nWomen and Geography Study Group 1997 Feminist Geographies: \nExplorations in Diversity and Difference Addison Wesley \nWyn J & White R 1997 Rethinking Youth Sage, London \nYoung L and Ansell N 2003 Fluid households, complex families: the impacts of \nchildren's migration as a response to HIV\/AIDS in southern Africa The \nProfessional Geographer 55(4) 464-479  \n \n"}