{"doi":"10.1016\/j.gca.2010.10.002","coreId":"53604","oai":"oai:nora.nerc.ac.uk:12998","identifiers":["oai:nora.nerc.ac.uk:12998","10.1016\/j.gca.2010.10.002"],"title":"Numerical model to determine the composition of H2O–NaCl–CaCl2 fluid inclusions based on microthermometric and microanalytical data","authors":["Steele-MacInnis, M.","Bodnar, R.J.","Naden, J."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2011","abstract":"Natural fluids approximated by the H2O–NaCl–CaCl2 system are common in a wide range of geologic environments, including sedimentary basins associated with hydrocarbon occurrences and MVT deposits, submarine hydrothermal systems, and other metamorphic, magmatic and hydrothermal environments. We present a comprehensive numerical model and Microsoft® Excel©-based computer program to determine the compositions of fluid inclusions in the H2O–NaCl–CaCl2 system based on microthermometric and microanalytical data. The model consists of six polynomial correlation equations that describe liquid salinity as a function of NaCl\/CaCl2 ratio and melting temperature on each of the ice, hydrohalite, halite, antarcticite, CaCl2·4H2O and CaCl2·2H2O vapor-saturated liquidus surfaces. The cotectic and peritectic boundaries are determined from the intersections of the liquidus surfaces. The model is implicitly internally consistent and topologically correct.\\ud\n\\ud\nThe model expands upon the compositional range of applicability and the data types that can be used for compositional determination. It reproduces experimental data for all compositions that lie within the H2O–NaCl–CaCl2·4H2O compositional triangle in the H2O–NaCl–CaCl2 system and yields accurate reproductions of the H2O–NaCl and H2O–CaCl2 binaries. Furthermore, in comparison to previously published models, the one presented here eliminates systematic errors, wavy isotherms and cotectic and peritectic curves with local “bumps.”\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53604.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/12998\/1\/Steele-MacInnis_et_al.pdf","pdfHashValue":"e34447e86c782bc8b7520e7479c3b144061e4d52","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:12998<\/identifier><datestamp>\n      2012-11-22T12:17:26Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      7375626A656374733D5337<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12998\/<\/dc:relation><dc:title>\n        Numerical model to determine the composition of H2O–NaCl–CaCl2 fluid inclusions based on microthermometric and microanalytical data <\/dc:title><dc:creator>\n        Steele-MacInnis, M.<\/dc:creator><dc:creator>\n        Bodnar, R.J.<\/dc:creator><dc:creator>\n        Naden, J.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:subject>\n        Chemistry<\/dc:subject><dc:description>\n        Natural fluids approximated by the H2O–NaCl–CaCl2 system are common in a wide range of geologic environments, including sedimentary basins associated with hydrocarbon occurrences and MVT deposits, submarine hydrothermal systems, and other metamorphic, magmatic and hydrothermal environments. We present a comprehensive numerical model and Microsoft® Excel©-based computer program to determine the compositions of fluid inclusions in the H2O–NaCl–CaCl2 system based on microthermometric and microanalytical data. The model consists of six polynomial correlation equations that describe liquid salinity as a function of NaCl\/CaCl2 ratio and melting temperature on each of the ice, hydrohalite, halite, antarcticite, CaCl2·4H2O and CaCl2·2H2O vapor-saturated liquidus surfaces. The cotectic and peritectic boundaries are determined from the intersections of the liquidus surfaces. The model is implicitly internally consistent and topologically correct.\\ud\n\\ud\nThe model expands upon the compositional range of applicability and the data types that can be used for compositional determination. It reproduces experimental data for all compositions that lie within the H2O–NaCl–CaCl2·4H2O compositional triangle in the H2O–NaCl–CaCl2 system and yields accurate reproductions of the H2O–NaCl and H2O–CaCl2 binaries. Furthermore, in comparison to previously published models, the one presented here eliminates systematic errors, wavy isotherms and cotectic and peritectic curves with local “bumps.”\\ud\n\\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12998\/1\/Steele-MacInnis_et_al.pdf<\/dc:identifier><dc:format>\n        other<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12998\/2\/mmc1.xls<\/dc:identifier><dc:identifier>\n         \n\n  Steele-MacInnis, M.; Bodnar, R.J.; Naden, J..  2011  Numerical model to determine the composition of H2O–NaCl–CaCl2 fluid inclusions based on microthermometric and microanalytical data.   Geochimica et Cosmochimica Acta, 75 (1). 21-40.  https:\/\/doi.org\/10.1016\/j.gca.2010.10.002 <https:\/\/doi.org\/10.1016\/j.gca.2010.10.002>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00167037<\/dc:relation><dc:relation>\n        10.1016\/j.gca.2010.10.002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/12998\/","http:\/\/www.sciencedirect.com\/science\/journal\/00167037","10.1016\/j.gca.2010.10.002"],"year":2011,"topics":["Earth Sciences","Chemistry"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Steele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n1 \nNumerical model to determine the composition of  1 \nH2O-NaCl-CaCl2 fluid inclusions based on 2 \nmicrothermometric and microanalytical data 3 \n 4 \nM. Steele-MacInnis1, R. J. Bodnar1 and J. Naden2 5 \n 6 \n1. Department of Geosciences, Virginia Tech, Blacksburg, VA 24061 7 \n2. British Geological Survey, Keyworth, Nottingham UK NG12 5GG 8 \n 9 \nREVISED MANUSCRIPT W7363 10 \nSubmitted August 13, 2010 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n17 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n2 \nAbstract 18 \nNatural fluids approximated by the H2O-NaCl-CaCl2 system are common in a wide range of 19 \ngeologic environments, including sedimentary basins associated with hydrocarbon occurrences 20 \nand MVT deposits, submarine hydrothermal systems, and other metamorphic, magmatic and 21 \nhydrothermal environments. We present a comprehensive numerical model and Microsoft® 22 \nExcel©-based computer program to determine the compositions of fluid inclusions in the H2O-23 \nNaCl-CaCl2 system based on microthermometric and microanalytical data. The model consists of 24 \nsix polynomial correlation equations that describe liquid salinity as a function of NaCl\/CaCl2 25 \nratio and melting temperature on each of the ice, hydrohalite, halite, antarcticite, CaCl2·4H2O and 26 \nCaCl2·2H2O vapor-saturated liquidus surfaces. The cotectic and peritectic boundaries are 27 \ndetermined from the intersections of the liquidus surfaces. The model is implicitly internally 28 \nconsistent and topologically correct. 29 \nThe model expands upon the compositional range of applicability and the data types that can 30 \nbe used for compositional determination. It reproduces experimental data for all compositions 31 \nthat lie within the H2O-NaCl-CaCl2·4H2O compositional triangle in the H2O-NaCl-CaCl2 system 32 \nand yields accurate reproductions of the H2O-NaCl and H2O-CaCl2 binaries. Furthermore, in 33 \ncomparison to previously published models, the one presented here eliminates systematic errors, 34 \nwavy isotherms and cotectic and peritectic curves with local “bumps.” 35 \n 36 \n37 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n3 \nList of Symbols 38 \nni number of moles of component i 39 \nXi Mole fraction of component i  [= (ni)\/(ntotal)] 40 \nΨ The molar fraction of NaCl relative to NaCl + CaCl2   41 \n [= (XNaCl)\/(XNaCl + XCaCl2)] 42 \nΦ The weight fraction of NaCl relative to NaCl + CaCl2 43 \n [= (wt.% NaCl)\/(wt.% NaCl + wt.% CaCl2)] 44 \nΩ The molar fraction of CaCl2 relative to H2O + CaCl2 45 \n [= (XCaCl2)\/(XCaCl2 + XH2O)] 46 \nTm,x Temperature (°C) at which solid phase x melts on the one-solid-stable vapor-47 \nsaturated liquidus surface. 48 \nTpb,x Temperature (°C) at which solid phase x melts on either a cotectic or peritectic 49 \nphase boundary curve, in the presence of liquid plus vapor plus another solid. 50 \nSubscripts x: ice (= H2O solid); hh (= hydrohalite); h (= halite); ant (= 51 \nantarcticite); Ca4h (tetrahydrate = CaCl2·4H2O); Ca2h 52 \n(dihydrate = CaCl2·2H2O = sinjarite) 53 \nSmol Total salinity on a mole fraction basis [= XNaCl + XCaCl2]. 54 \nSwt Total salinity on a wt.% basis [= (wt.% NaCl + wt.% CaCl2)] 55 \nai Regression coefficient. 56 \n57 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n4 \nIntroduction 58 \nAqueous fluids in which NaCl and CaCl2 are the two most abundant salts and which may 59 \nbe adequately described by the system H2O-NaCl-CaCl2 are common in many geologic 60 \nenvironments. Fluids of this composition are commonly found in sedimentary basins (COLLINS, 61 \n1975; LOWENSTEIN et al., 2003; HANOR and MACINTOSH, 2007), Mississippi Valley-Type Pb-Zn 62 \ndeposits (HAYNES and KESSLER, 1987; BASUKI and SPOONER, 2002; STOFFELL et al., 2008), 63 \nArchean lode gold deposits (ROBERT and KELLY, 1987), skarn and greisen deposits (KWAK and 64 \nTAN, 1981; LAYNE and SPOONER, 1991; SAMSON et al., 2008), iron-oxide Cu-Au (IOCG) -type 65 \ndeposits (XU, 2000), magmatic Cu-Ni deposits (LI and NALDRETT, 1993), crystalline rocks of the 66 \nCanadian Shield (FRAPE et al., 1984), mafic pegmatoids associated with platinum deposits in  the 67 \nBushveld Complex (SCHIFFRIES, 1990) and elsewhere (NYMAN et al., 1990), and in sub-seafloor 68 \nhydrothermal systems (VANKO, 1988; VANKO et al., 1988). Thus, fluid inclusions approximated 69 \nby the system H2O-NaCl-CaCl2 are common in a diverse range of geologic environments, and a 70 \nmethodology to interpret microthermometric data obtained from these inclusions is necessary to 71 \nbetter understand geologic processes such as diagenesis, hydrocarbon migration, evolution of 72 \nhydrothermal systems, metal transport, metamorphism and crystallization of magmas. 73 \nThe best source of information concerning the compositions of paleo-geologic fluids 74 \ncomes from fluid inclusions (ROEDDER, 1984). The temperatures at which phase changes occur 75 \nwithin a fluid inclusion during heating can be used to estimate the fluid composition, assuming 76 \nthat PTX phase relationships of representative fluid systems are available. In addition, the 77 \nelemental ratios in saline aqueous inclusions can be determined by microanalysis, for example by 78 \nlaser ablation ICPMS (LA-ICPMS) (GÜNTHER et al., 1998), which provides an additional 79 \nconstraint for determining the fluid composition when combined with microthermometric data. 80 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n5 \nThe system H2O-NaCl-CaCl2 (Fig. 1) is a three-component system, and the phase rule 81 \nrequires that two variables must be specified to determine a unique liquid composition on the 82 \nvapor-saturated liquidus, whereas one variable is sufficient to determine a unique liquid 83 \ncomposition on any vapor-saturated, two-solid-plus-liquid boundary (cotectic or peritectic 84 \ncurve). The temperatures of last melting of solid phases, either on a cotectic or peritectic curve 85 \n(Tpb,x1) or on the one-solid liquidus (Tm,x2), are two possible sources of data; elemental ratios 86 \ndetermined from LA-ICPMS represent another data source. (Note that whereas several previous 87 \nstudies of the H2O-NaCl-CaCl2 system have used the term “XNaCl” to refer to the weight ratio of 88 \nNaCl relative to NaCl+CaCl2, we adopt the more common notation such that XNaCl refers to the 89 \nmole fraction of NaCl, and we instead denote the weight and molar ratios of NaCl relative to 90 \nNaCl+CaCl2 as Φ and Ψ, respectively). As discussed in detail below, depending upon which data 91 \nare available, fluid inclusion compositions may be determined using a combination of either the 92 \ntemperature of melting on a cotectic or peritectic and a temperature of melting on the vapor-93 \nsaturated liquidus surface (Tpb,x1 + Tm,x2), or a temperature of melting on the vapor-saturated 94 \nliquidus surface and the ratio of the amount of NaCl relative to the total amount of NaCl and 95 \nCaCl2, (Tm,x + either Φ or Ψ – the two compositional ratios can be directly converted to one 96 \nanother via the molar masses of the species) or the temperature of melting of one phase on a 97 \ncotectic or peritectic and the temperature of melting of a second phase on a cotectic or peritectic 98 \n(Tpb,x1 + Tpb,x2). 99 \nCompositions of H2O-NaCl-CaCl2 fluid inclusions can be approximated using 100 \ngraphically-displayed phase equilibrium data (e.g., KONNERUP-MADSEN, 1979; ROBERT and 101 \nKELLEY, 1987) or using empirical or theoretical data (OAKES et al., 1990; WILLIAMS-JONES and 102 \nSAMSON, 1990; NADEN, 1996; CHI and NI, 2007), and several computer packages have been 103 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n6 \ndeveloped to interpret data from fluid inclusions whose compositions are approximated by the 104 \nsystem H2O-NaCl-CaCl2 (NADEN, 1996; BAKKER, 2003; CHI and NI, 2007). While each model 105 \nworks well over a limited range of T-X conditions, none of the currently available models is 106 \nequipped to calculate fluid inclusion compositions over the complete range in compositions 107 \nreported for natural H2O-NaCl-CaCl2 fluid inclusions. Moreover, some of the previously 108 \npublished equations (OAKES et al., 1990; NADEN, 1996; CHI and NI, 2007) are characterized by 109 \nstructured residuals with respect to the experimental data, or have inflections (“bumps”) between 110 \ndata points and local extrema along calculated isotherms and univariant curves, as described in 111 \nmore detail below. Finally, none of the previously published models provide the ability to 112 \ndetermine fluid compositions using the complete range of possible input data, such as the 113 \ntemperature of melting on a cotectic or peritectic and a temperature of melting on the vapor-114 \nsaturated liquidus surface (Tpb,x1 + Tm,x2), or a temperature of melting on the vapor-saturated 115 \nliquidus surface and the weight fraction of NaCl relative to NaCl + CaCl2 (Tm,x + Φ), or the 116 \ntemperature of melting of one phase on a cotectic or peritectic and the temperature of melting of 117 \na second phase on a cotectic or peritectic (Tpb,x1 + Tpb,x2), as described below. The model 118 \npresented here incorporates those aspects of previous models that have been shown to be 119 \nconsistent with the phase equilibria determined from experimental data, and adds new equations 120 \nand methods to expand the T-X range of applicability, remove anomalies inherent in some 121 \nprevious statistical models, and expands the range of input data that may be used to estimate the 122 \ncomposition of H2O-NaCl-CaCl2 fluid inclusions. 123 \nThe goal of this study is to provide a comprehensive set of empirical equations that 124 \ndescribe the portion of the vapor-saturated H2O-NaCl-CaCl2 system that includes the range of 125 \ncompositions of natural fluid inclusions and the range of available experimental data. As such, 126 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n7 \nthis study covers a region within the ternary system bounded by the H2O apex, the NaCl apex 127 \nand the composition of CaCl2·4H2O on the H2O-CaCl2 binary (Fig. 1b). The equations derived in 128 \nthis study have been assembled into a Microsoft® Excel-based program to allow users to easily 129 \ncalculate fluid inclusion compositions in this complex system over the complete compositional 130 \nrange reported from natural fluid inclusions, using a variety of input data, including Tpb,x1 + Tm,x2, 131 \nTm,x + Φ or Tpb,x1 + Tpb,x2. The program is available as an electronic annex to this paper. 132 \nWe emphasize that the model developed in this study applies to stable equilibrium 133 \nmelting behavior in the system H2O-NaCl-CaCl2, but metastable melting phenomena are also 134 \nfrequently encountered in CaCl2-bearing fluids (e.g., POTTER and CLYNNE, 1978; ROEDDER, 135 \n1984; VANKO et al., 1988; BAUMGARTNER and BAKKER, 2009). For instance, VANKO et al. 136 \n(1988) reported that some of their synthetic H2O-NaCl-CaCl2 fluid inclusions could not be 137 \ncompletely frozen, while others could only be frozen to a metastable phase assemblage. 138 \nLikewise, LINKE (1958) and BAUMGARTNER and BAKKER (2009) report the occurrence of several 139 \nmetastable phase assemblages in the H2O-CaCl2 binary system. While we acknowledge that 140 \nmetastable behavior in the H2O-NaCl-CaCl2 system does occur, the model presented in this study 141 \nspecifically represents only the stable phase relations on the vapor-saturated H2O-NaCl-CaCl2 142 \nliquidus. 143 \nVapor-Saturated Phase Relations in the H2O-NaCl-CaCl2 System 144 \nPhase relations on the vapor-saturated liquidus of the H2O-NaCl-CaCl2 ternary system are 145 \nshown in Figure 1. The system is characterized by at least eight fields in which a single solid 146 \nphase is in equilibrium with liquid and vapor.  Six of these fields are described in this study; two 147 \nadditional fields in the high salinity, CaCl2-rich, low weight fraction NaCl (Φ) part of the system 148 \n(near the CaCl2 apex; Fig. 1a) are not considered here because experimental data are not 149 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n8 \navailable in that part of the ternary system (although these phases have been characterized along 150 \nthe H2O-CaCl2 binary, e.g. LINKE, 1958). Figure 1 shows phase relationships in the part of the 151 \nsystem that includes the range of reported compositions of natural fluid inclusions. The phase 152 \nboundaries shown in Figure 1c were calculated using the equations derived in this study and 153 \nbelow we compare these calculated phase boundaries with experimental data. 154 \nEach field shown in Figure 1 is labeled according to the solid phase that is in equilibrium 155 \nwith liquid and vapor. At low salinity, near the H2O apex, the stable solid phase on the liquidus 156 \nsurface is H2O ice (Fig. 1a, c). At intermediate to high salinity and Rwt > 0.04, halite (NaCl) is 157 \nthe stable solid phase (Fig. 1a, c). A field in which hydrohalite (NaCl·2H2O) is the stable solid 158 \nphase separates the ice- and halite-stable fields (Fig. 1a, c). At intermediate to high salinity and 159 \nRwt < 0.04, calcium chloride hydrates are the stable solid phases: antarcticite (CaCl2·6H2O) is the 160 \nstable phase from about 30 to 50 wt.% total salt, “tetrahydrate” (CaCl2·4H2O) is the stable solid 161 \nfrom 50 to about 57 wt.% salt, and “dihydrate” (CaCl2·2H2O = sinjarite) is stable from about 57 162 \nto 75 wt.% salt (Fig. 1a, c). To our knowledge, ternary experimental data are not available for the 163 \nH2O-NaCl-CaCl2 system at salinities above 75 wt.% total salt, thus the CaCl2·H2O and CaCl2 164 \n(anhydrous) stable fields are not included in this study (area near the CaCl2 apex on Fig. 1a 165 \nlabeled with a question mark, ?). Also shown in Figure 1c are the compositions of hydrohalite 166 \n(61.86 wt.% NaCl on the H2O-NaCl binary), antarcticite (50.07 wt.% CaCl2 on the H2O-CaCl2 167 \nbinary), CaCl2·4H2O (60.63 wt.% CaCl2 on the H2O-CaCl2 binary) and CaCl2·2H2O (75.49 wt.% 168 \nCaCl2 on the H2O-CaCl2 binary). 169 \nThe fields in which one solid is in equilibrium with liquid and vapor are separated from 170 \neach other by peritectic or cotectic boundary curves. Ice and hydrohalite are separated by the ice 171 \n+ hydrohalite (I+HH) cotectic, which extends from the ternary eutectic point (E) at -52°C 172 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n9 \n(YANATIEVA, 1946) to the binary H2O-NaCl eutectic (E') at -21.2°C (HALL et al., 1988). Ice and 173 \nantarcticite are separated by the ice + antarcticite (I+A) cotectic, which extends from the ternary 174 \neutectic (E) to the binary H2O-CaCl2 eutectic (E'') at -49.8°C (YANATIEVA, 1946). The 175 \nhydrohalite and antarcticite fields are separated from each other by the hydrohalite + antarcticite 176 \n(HH+A) cotectic curve, which extends from the ternary eutectic (E) to the first ternary peritectic 177 \n(P1) at -22.4°C (YANATIEVA, 1946). The hydrohalite field is separated from the halite field by the 178 \nhydrohalite + halite (HH+H) peritectic curve, which extends from the first ternary peritectic (P1) 179 \nto the binary H2O-NaCl peritectic (P') at +0.1°C (LINKE, 1958). The halite field is separated from 180 \nthe antarcticite field by the halite + antarcticite (H+A) cotectic curve, which extends from the 181 \nfirst ternary peritectic (P1) to the second ternary peritectic (P2) at +29°C (SCHIFFRIES, 1990). The 182 \nhalite field is separated from the tetrahydrate field by the halite + tetrahydrate (H+Ca4h) cotectic, 183 \nwhich extends from the second ternary peritectic (P2) to the third ternary peritectic (P3) at 184 \napproximately +45°C (estimated from the data of LINKE, 1958). The halite field is separated 185 \nfrom the dihydrate field by the halite + dihydrate (H+Ca2h) cotectic curve, which extends from 186 \nthe third ternary peritectic (P3) to the fourth ternary peritectic at >110°C (LINKE, 1958). The 187 \nantarcticite field is separated from the tetrahydrate field by the antarcticite + tetrahydrate 188 \n(A+Ca4h) peritectic curve, which extends from the second ternary peritectic point (P2) to the first 189 \nbinary H2O-CaCl2 peritectic (P1'') at +30.1°C (LINKE, 1958). Tetrahydrate is separated from 190 \ndihydrate by the tetrahydrate + dihydrate (Ca4h+Ca2h) peritectic curve, which extends from the 191 \nthird ternary peritectic point (P3) to the second binary H2O-CaCl2 peritectic (P2'') at +45.1°C 192 \n(LINKE, 1958). The locations of other boundary curves that occur at higher salinity conditions 193 \nclose to the H2O-CaCl2 binary and near the CaCl2 apex are not known. A detailed summary of 194 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n10 \nthe stable melting paths followed by H2O-NaCl-CaCl2 fluid inclusions having compositions in 195 \nthe various fields described above is provided in Appendix A. 196 \nSources of Experimental Data 197 \nThe experimental data used in the regression analysis are summarized in Table 1 and 198 \nFigure 2. 199 \nPhase Boundaries 200 \nPhase boundaries on the vapor-saturated liquidus in the system H2O-NaCl-CaCl2 are 201 \nbroadly characterized by either cotectic relationships or peritectic relationships. Note that on a 202 \ncotectic boundary, the phase change behavior that is observed upon heating is always 203 \n“solid1+solid2→solid2+liquid →liquid”, whereas on a peritectic boundary, the reaction 204 \nobserved upon heating is “solid1+liquid→solid2+liquid→liquid”. In other words, as a fluid 205 \ninclusion is heated, the inclusionist would observe two solids shrinking (melting) along a cotectic 206 \ncurve until one disappeared leaving behind the second solid and liquid, whereas s\/he would 207 \nobserve one solid growing at the expense of the other along a peritectic curve. 208 \nIn addition to the T-X data along the cotectic and peritectic phase boundaries summarized 209 \nin Table 1 and Figure 2, SCHIFFRIES (1990) reported the temperature at the second peritectic 210 \npoint (P2) of +29°C, which provides an additional constraint on the location of the A+Ca4h, 211 \nA+H and Ca4h+H phase boundary curves. 212 \nLiquidus Surfaces 213 \nIn addition to compositions that lie on each divariant liquidus surface, data for the 214 \nunivariant boundary curves (peritectics or cotectics) adjacent to the surface were included in the 215 \nregression for each liquidus surface. For example, in modeling the hydrohalite field, data from 216 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n11 \nthe I+HH, HH+A and HH+H phase boundaries were used in addition to the hydrohalite-only 217 \nliquidus data. For each liquidus field, the number of data points that have been used in the 218 \nregression, including data within the field and those on the phase boundary curves, are listed in 219 \nTable 1. 220 \nFor the halite liquidus, the high temperature data of CHOU (1987) were omitted from the 221 \nregression analysis, but these data are in excellent agreement with those of STERNER et al. 222 \n(1988). In addition, the experimental data analyzed in this study include several liquidus 223 \ntemperature measurements along the anhydrous NaCl-CaCl2 binary (ZHANG et al., 1995), but 224 \nthose data are not included in the data set for regression. 225 \nFor the tetrahydrate liquidus, LINKE (1958) reports multiple polymorphs of CaCl2·4H2O 226 \ncoexisting with different salinity liquids. We have followed the suggestion of POTTER and 227 \nCLYNNE (1978), who point out that consideration of the phase rule indicates that the “beta” and 228 \n“gamma” polymorphs are metastable, and so we have included only the “alpha” polymorph 229 \nsolubility data of LINKE (1958). 230 \nEquations Describing the Liquidus and Phase Boundary Curves 231 \nThe liquidi in a ternary system are divariant surfaces, and thus the total salinity (Swt) can 232 \nbe represented as a function of the weight fraction of NaCl relative to NaCl + CaCl2 (Φ) and the 233 \ntemperature of melting of the last solid phase on the vapor-saturated liquidus (Tm,x). The cotectic 234 \nand peritectic curves are univariant lines and therefore both Φ and Swt can be represented as a 235 \nfunction of the temperature of melting of solid phase x on the cotectic or peritectic (Tpb,x). 236 \nPrevious studies have generally approached the problem of regression modeling of the vapor-237 \nsaturated liquidi of ternary systems by fitting separate univariant regression equations to the 238 \nexperimental data on the phase boundary curves (e.g., STERNER et al., 1988; NADEN, 1996). 239 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n12 \nWhile that approach often produces a system of equations with small errors with respect to the 240 \nexperimental data, it also generally yields a model that is not internally consistent because 241 \npredicted phase boundary curves will not necessarily intersect at the invariant points (eutectic 242 \nand peritectic points) and predicted isotherms of adjacent fields will not always intersect at the 243 \nunivariant curves as they should. The approach taken in this study has been to regress the data 244 \nfor each liquidus surface, and weight the cotectic and peritectic curve appropriately to ensure that 245 \nunivariant curves represent the intersection of the adjacent liquidus surfaces. This approach has 246 \ntwo advantages: First, it yields a model that is implicitly internally consistent, and secondly, it 247 \nprovides additional constraints on liquidus fields that are represented by sparse experimental 248 \ndata. For example, the only data available for the tetrahydrate field are along the H2O-CaCl2 249 \nbinary (as described above). However, isotherms are available at the intersections of the 250 \ntetrahydrate field with the adjacent antarcticite, halite and dihydrate fields, and these data, 251 \ncombined with data along the H2O-CaCl2 binary, provide reasonable constraints on the locations 252 \nof isotherms within the tetrahydrate field. 253 \nRegression analyses were conducted using SAS© JMP 8 statistical software. The 254 \nexperimental data on each liquidus surface were regressed to find the equation that best satisfied 255 \nthree criteria: First, the equation was required to accurately reproduce the experimental data; 256 \nsecondly, the resulting isotherms were required to be smooth and monotonic, meaning free of 257 \nlocal extrema and inflections; and thirdly, the equations for adjacent liquidus surfaces were 258 \nrequired to intersect such that the cotectic and peritectic phase boundaries predicted by the 259 \nintersection were consistent with experimental data. The percent residuals of each equation with 260 \nrespect to the experimental data were calculated by the expression {(1 - 261 \ncalculated\/measured)*100%}. 262 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n13 \nIce field 263 \nSalinities of fluid inclusions for which H2O ice is the final solid to melt are described by the 264 \nfollowing equation, modified from NADEN (1996): 265 \n \n \nSwt = ai\ni=0\n5\n∑ Tm,icei + ai\ni=6\n7\n∑ Φ(i−5) + a8Φ Tm,ice2 + a9Φ Tm,ice5 − 0.185exp(−Tm,ice − 52) (1) 266 \nwhere Tm,ice is the final ice melting temperature in degrees Celsius and the ai’s are fitting 267 \nparameters given in Table 2. We have added the exponential term at the end of the equation 268 \noriginally provided by NADEN (1996) to improve the intersection with the antarcticite field, as 269 \ndiscussed below. The equation for the ice liquidus surface of CHI and NI (2007) (their Eqn. (4)) 270 \nis based upon extrapolation from their I+HH boundary, and is therefore valid only at high 271 \nsalinity (Tm,ice ≤ -21°C), and it shows significant structure in the residuals as a function of salinity 272 \n(Fig. 3). The equation of OAKES et al. (1990) (their Eqn. (2)) fits the data well at salinities from 0 273 \nto 25 wt. %, but provides a poorer fit to the higher salinity data of YANATIEVA (1946), with a 274 \nnegative-sloped, apparently linear structure in the residuals in this range (Fig. 3). Equation (1) 275 \ndoes not reproduce the lowest salinity experimental data as well as the equation of OAKES et al. 276 \n(1990), but it provides a better fit in general over the entire salinity range of the ice field (Fig. 3). 277 \nFor these reasons, Eqn. (1) is recommended as the general equation for the ice field, and is 278 \nadopted for all figures and examples herein, while the equation of OAKES et al. (1990) may be 279 \npreferable if all data to be analyzed have a Tm,ice ≥ -15°C. The numerical model described later 280 \noffers users the option to select the equation of OAKES et al. (1990) if their microthermometric 281 \ndata are in the range in which that model predicts values that are in better agreement with 282 \nexperimental values.  283 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n14 \nHydrohalite field 284 \nThe salinity of fluid inclusions in which hydrohalite is the final solid phase to melt is 285 \ndescribed by: 286 \n \n \nSmol = ai\ni= 0\n2\n∑ (Tm,hh + 52)i + a3Ψ−1 + aiΨi−2\ni= 4\n5\n∑ + aiΨ (Tm,hh + 52)i−4 + a8Ψ2(Tm,hh + 52)\ni= 6\n7\n∑  (2) 287 \nwith the ai’s listed in Table 2. Residuals associated with calculation of the total salinity in terms 288 \nof weight percent (Swt) using Eqn (2) are generally within ± 5 % of experimental values, 289 \nexcluding one outlier (Fig. 3). Equation (2) does not significantly improve on the residuals 290 \nassociated with the equation of NADEN (1996) for the hydrohalite field (Fig. 3); however, the 291 \nequation of NADEN (1996) tends to over-fit the data, and isotherms generated using NADEN's 292 \nequation have local extrema between data points, (at some temperatures crossing the H+HH 293 \nperitectic curve to predict compositions that are within the halite field) (Fig. 4). Isotherms 294 \ngenerated using Eqn. (2) are smooth and without local extrema (Fig. 4), and thus better reflect 295 \nthe geometry of the hydrohalite liquidus surface. 296 \nHalite field 297 \nThe liquid salinity on the halite liquidus is described by: 298 \n \n \nSmol = ai(Tm,h\ni= 0\n3\n∑ + 52)i + a4Ψ−1 + ai\ni= 5\n6\n∑ Ψ (Tm,h + 52)i−3\n+ ai\ni= 7\n9\n∑ Ψ2(Tm,h + 52)i−7 + exp(−Tm,h − 52)\n (3) 299 \nValues of the fitting cofficients ai are listed in Table 2. Residuals for Eqn. (3) are shown in 300 \nFigure 3. In addition, the data of ZHANG et al. (1995) along the NaCl-CaCl2 binary are predicted 301 \nby Eqn. (3) to within ± 4 %, even though the ZHANG et al. data were not included in the 302 \nregression analysis. In comparison to Eqn. (3), the equation of NADEN (1996) for the halite 303 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n15 \nliquidus surface predicts wavy isotherms with local extrema, compared to the smooth, monotonic 304 \nisotherms generated using Eqn. (3) and shown on Fig. 5. The equation of NADEN (1996) also 305 \ndoes not adequately reproduce the high salinity H2O-NaCl binary data of STERNER et al. (1988) 306 \n(Fig. 3). WILLIAMS-JONES and SAMSON (1990) developed a theoretical equation to calculate 307 \nhalite solubility on the halite liquidus surface, and they report their results graphically as 308 \nisotherms on the ternary phase diagram. WILLIAMS-JONES and SAMSON (1990) do not provide an 309 \nerror analysis of their model, and their model cannot be compared directly to our results because 310 \nthey do not provide the values for the Pitzer parameters, which they obtained from graphical 311 \ninterpolation. However, based on visual inspection, the isotherms presented by WILLIAMS-JONES 312 \nand SAMSON (1990) appear to be in good agreement with those predicted by our Eqn. (3). 313 \nAntarcticite field 314 \nThe salinity on the antarcticite liquidus surface is described by the following relationship:  315 \n \n \nSmol = ai(Tm,ant + 52)\ni\ni= 0\n5\n∑ + aiΨi−5(Tm,ant + 52)i−6\ni= 6\n7\n∑  (4) 316 \nValues of the fitting parameters, ai, are listed in Table 2. Residuals associated with Eqn. (4) are 317 \nall within ± 5 % of the experimental values (Fig. 3). To our knowledge, no equations have been 318 \npublished previously that describe the relationship between salinity and temperature on the H2O-319 \nNaCl-CaCl2 ternary antarcticite liquidus surface. 320 \nTetrahydrate and dihydrate fields 321 \nQuantitative representation of the tetrahydrate and dihydrate fields is limited by the 322 \nscarcity of available experimental data; however, the narrow compositional range of these fields 323 \n(Fig. 1c) limits the absolute error in the weight fraction of NaCl in the solution (Φ) to <0.058. 324 \nThe form of each of the equations for the tetrahydrate and dihydrate fields was based in part on 325 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n16 \nthe requirement that the cotectic and peritectic curves bounding these fields must be predicted by 326 \nthe intersection of the equations for the adjacent liquidus fields, because the locations of 327 \nisotherms in those fields are better constrained than those in the tetrahydrate and dihydrate fields 328 \nand thus provide a means of checking the validity of the expressions for those fields. The salinity 329 \non the tetrahydrate liquidus surface is described by 330 \n \n \nSmol = ai\ni= 0\n2\n∑ (Tm,Ca 4 h + 52)i + Ψ\ni= 3\n4\n∑ (Tm,Ca4 h + 52)i−3 + exp(100Ψ −10) (5) 331 \nand the salinity on the dihydrate liquidus surface is described by 332 \n \n \nSmol = ai(\ni= 0\n3\n∑ Tm,Ca 2h + 52)i + a4Ψ  (6) 333 \nThe ai parameters are listed in Table 2. Residuals of Eqn. (5) are all within ± 2 % of 334 \nexperimental values, and those for Eqn. (6) are within ± 3 %. 335 \nComparison with data for the binary systems 336 \nThe equations described above for modeling the ternary H2O-NaCl-CaCl2 system may 337 \nalso be used to predict liquidi for the binary H2O-NaCl and H2O-CaCl2 systems using Eqns. (1) 338 \nto (6), as shown on Figure 6. The predicted H2O-NaCl eutectic (E') is at -21.18°C, compared to 339 \nthe experimentally determined -21.2°C (HALL et al., 1988). The predicted H2O-NaCl peritectic 340 \npoint (P') is at +0.14°C, compared to the experimental value of +0.1°C (LINKE, 1958). The 341 \npredicted H2O-CaCl2 eutectic point (E'') is at -49.9°C, compared to the experimentally 342 \ndetermined temperature of -49.8°C (YANATIEVA, 1946). The predicted first and second H2O-343 \nCaCl2 peritectic points (P1'' and P2'') are at +30.0°C and +44.7°C, respectively, compared to the 344 \nexperimental values of +30.1°C and +45.1°C (LINKE, 1958). 345 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n17 \nPhase Boundary Curves 346 \nEach univariant curve is represented by the intersection of the adjacent divariant surfaces, 347 \nrather than by a separate equation, as discussed above. For example, the liquid composition on 348 \nthe I+HH cotectic is represented by the intersection of the ice and hydrohalite liquidi, or in other 349 \nwords by the collection of T-X conditions that simultaneously satisfy Eqns. (1) and (2). 350 \nMetastable extensions are not represented in this model. Residuals associated with determining 351 \nthe total salinity in weight percent (Swt) and the weight fraction of NaCl (Φ) along the phase 352 \nboundary curves by this method are shown in Figures 7 and 8, respectively. Residuals associated 353 \nwith salinity estimation are all within ± 4 % for the I+HH and HH+A cotectics, and within ± 6 % 354 \nfor the HH+H peritectic curve and H+CaCl2·nH2O cotectics (Fig. 7). Percent residuals associated 355 \nwith estimation of Φ on the phase boundary curves are generally larger, with ± 20 % for the 356 \nI+HH curve, ± 5 % for the HH+A curve, ± 60 % for the HH+H curve, and ± 50 % for the H+ 357 \nCaCl2·nH2O curves (Fig. 8). These large percent errors in part reflect the fact that Φ is a small 358 \nnumber (< 1), such that small absolute errors yield large percent errors. It also reflects some 359 \nscatter in the experimental data that we intentionally did not attempt to over-fit, owing to our 360 \nrequirement that the phase boundary curves predicted by the equations must be smooth and 361 \nmonotonic. 362 \nIdentifying pairs of liquidus equations that provided smooth cotectic and peritectic curves 363 \nthat accurately reproduced the experimental values involved some trial and error. In some cases, 364 \nwhile the individual equations for the liquidus fields adequately reproduced data in those fields, 365 \ntheir intersections sometimes showed significant offset in isotherms on the cotectic or peritectic 366 \ncurves, or did not intersect at experimentally-determined T-X conditions on these curves, or 367 \nproduced topologies for the curves that were not supported by experimental data. As an example, 368 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n18 \nwe found that the equation for the H+HH peritectic curve from NADEN (1996) that describes the 369 \nweight fraction of NaCl (Φ) as a function of the melting temperature of hydrohalite on the 370 \nperitectic curve (Tpb,hh) is over-fitted and predicts an unrealistic curvature, whereas the 371 \nintersection of Eqns. (2) and (3) from this study is comparably much smoother (Fig. 9). BAKKER 372 \n(2003) incorporated the equations of OAKES et al. (1990) and NADEN (1996), without 373 \nmodification, into a computer package that added the option to model the univariant curves by 374 \nthe intersections of the adjacent liquidus surfaces (the same approach taken in this study). 375 \nHowever, the equations of NADEN (1996) for the hydrohalite and halite liquidi intersect along a 376 \nwavy curve with local extrema in salinity, which causes anomalous predictions from the 377 \ncomputer package of BAKKER (2003), whereas Eqns. (1) and (3) from the present study intersect 378 \nmore smoothly and without extrema (Fig. 10). 379 \nSome structure is observable in the residuals associated with the H+CaCl2·nH2O cotectics 380 \nand the HH+A cotectic (Figs. 7 and 8). This structure could be reduced or eliminated by 381 \nadjusting equations for the adjacent fields; however, this approach would then compromise the 382 \ndegree to which those equations for the adjacent fields would reproduce experimental data for 383 \nthose fields. As such, we chose to give preference to achieving the most accurate fit on the I+HH 384 \nand HH+H boundaries, because phase changes along those boundaries are reported more 385 \ncommonly in studies of natural fluid inclusions. Thus, we have to some extent sacrificed the 386 \nfidelity with which data along the less commonly reported HH+A and H+CaCl2·nH2O curves are 387 \nreproduced. However, we believe that this approach is justified because the antarcticite, 388 \ntetrahydrate and dihydrate fields encompass a very narrow range of weight fraction NaCl (Φ < 389 \n0.05), and the liquid salinity on each of those liquidi surfaces is not very sensitive to the weight 390 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n19 \nfraction of NaCl. Furthermore, since Φ is always < 0.05 in this part of the system, relatively large 391 \npercent errors translate into small absolute errors in the weight fraction of NaCl in the inclusion. 392 \nMethodologies For Determining Inclusion Bulk Compositions 393 \nThe model presented here allows fluid inclusion compositions to be determined using a 394 \nvariety of input data, including the melting temperature of a phase on a cotectic or peritectic 395 \nboundary and the temperature of melting of the last solid on the liquidus surface (Tpb,x1 + Tm,x2), 396 \nor the temperature of melting of the last solid on the liquidus surface and the weight ratio of 397 \nNaCl in the inclusion determined from microanalysis (Tm,x + Φ), or the melting temperature of 398 \ntwo phases on a cotectic or peritectic boundary, either melting simultaneously (Tpb,x1 = Tpb,x2) or 399 \nat different temperatures (Tpb,x1 + Tpb,x2). The following sections describe the methodologies to 400 \ndetermine bulk composition using the various types of input data. 401 \nFinal melting on a cotectic curve (Tpb,x1 = Tpb,x2, two solid phases dissolve simultaneously) 402 \nIn the simplest case where two solids dissolve simultaneously on a cotectic curve, the 403 \nbulk composition is uniquely specified by the melting temperature in accordance with the phase 404 \nrule. The measured melting temperature can be used to calculate the fluid inclusion composition 405 \nby solving for the intersection of the adjacent surfaces at that temperature, in other words by 406 \nfinding the value of the weight fraction of NaCl (Φ ) for which the two adjacent liquidus surface 407 \nsalinity equations yield the same salinity at the measured temperature of melting. For example, 408 \nconsider a fluid inclusion in which ice and hydrohalite dissolve simultaneously at -25°C. The 409 \nsalinity in the ice field at -25°C and a given weight fraction of NaCl (Φ) can be found from Eqn. 410 \n(1), while the salinity in the hydrohalite field at -25°C and Ψ can be estimated from Eqn. (2). By 411 \niteration, we find that a weight fraction of NaCl, Φ, of 0.57 yields a liquid salinity of 24.7 wt.% 412 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n20 \nat -25°C in both Eqns. (1) and (2). Thus, the intersection of the ice and hydrohalite liquidus 413 \nsurfaces  occurs at a salinity of 24.7 wt.% (NaCl + CaCl2) and a weight fraction of NaCl of 0.57, 414 \nand this represents the bulk composition of the fluid inclusion. 415 \nLast melting temperature (Tm,x) and NaCl weight fraction (Φ)  416 \nIf available data include the melting temperature of the last solid obtained from 417 \nmicrothermometry, and the weight fraction of NaCl (Φ) determined by microanalysis (e.g., LA-418 \nICPMS), the fluid bulk composition is determined by finding the intersection of the isotherm of 419 \nthe final melting temperature with the pseudobinary defined by the NaCl weight fraction (Φ). 420 \nThose two variables may be input directly into the appropriate equation (with Φ converted to Ψ 421 \nwhere required). As an example, consider a fluid inclusion that contains a halite daughter mineral 422 \nthat dissolves at 200°C, and has a weight fraction of NaCl relative to NaCl + CaCl2 (Φ) of 0.7 423 \nbased on LA-ICPMS analysis of the inclusion. A weight fraction of NaCl of 0.7 equals a molar 424 \nfraction, Ψ, of 0.815, and substituting those values of Ψ (0.815) and Tm,h (200°C) into Eqn. (3) 425 \nyields a total salinity on a mole fraction basis, Smol, of 0.116, which corresponds to a total 426 \nsalinity of 33.1 wt.%. 427 \nTwo unique melting temperatures, Tpb,x1 + Tm,x2 or Tpb,x1 + Tpb,x2 428 \nIf available data include two unique melting temperatures from microthermometry – 429 \neither a cotectic (or peritectic curve) melting temperature (Tpb,x1) plus the temperature of melting 430 \nof the last solid phase on the liquidus (Tm,x2), or a cotectic melting temperature (Tpb,,x1) plus a 431 \nunivariant peritectic melting temperature (Tpb,x2) – various calculation procedures may be used 432 \ndepending on which solid phases and phase changes are involved. On Figure 11, the ternary 433 \nsystem is divided into several numbered fields that identify compositions within the H2O-NaCl-434 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n21 \nCaCl2 ternary that involve the same phase changes as input data or follow similar calculation 435 \nprocedures. 436 \nField 1 – Tpb,hh < Tm,ice 437 \nDuring heating from the eutectic temperature, fluids with compositions in field 1 (Fig. 438 \n11) lose hydrohalite along the I+HH cotectic and ice is the last solid phase to melt on the ice 439 \nliquidus surface. The composition of the liquid at the temperature of hydrohalite dissolution on 440 \nthe cotectic is determined from the intersection of the hydrohalite and ice liquidi at the 441 \ntemperature of hydrohalite melting (Tpb,hh), from Eqns. (1) and (2). After hydrohalite disappears, 442 \nbecause the last remaining solid is pure H2O ice (solid solution between solid phases in this 443 \nsystem is negligible), the weight fraction of NaCl (Φ) of the liquid phase does not change during 444 \ncontinued heating and ice melting, and the liquid composition moves directly towards the H2O 445 \napex. Thus, the weight fraction of NaCl (Φ) determined from the temperature of hydrohalite 446 \nmelting on the cotectic and the final ice melting temperature (Tm,ice), can be input directly into 447 \nEqn. (1) to determine the bulk salinity. 448 \nField 2 – Tpb,ant<Tm,ice 449 \nThe calculation procedure to determine the composition of fluids that exhibit antarcticite 450 \ndissolution on the I+A cotectic, followed by final melting of ice on the ice liquidus surface (field 451 \n2; Fig. 11) is analogous to that for fluids in field 1, substituting Tpb,ant for Tpb,hh, and substituting 452 \nEqn. (4) for Eqn. (2). 453 \nField 3 – Tpb,ice<Tm,hh 454 \nFor fluid inclusions in which ice is the phase that disappears along the I+HH cotectic and 455 \nwhich subsequently show hydrohalite as the last solid to melt on the hydrohalite liquidus (field 3; 456 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n22 \nFig. 11), the liquid composition at the temperature of ice melting on the I+HH cotectic is 457 \ndetermined from the intersections of Eqns. (1) and (2), as described previously for field 1. After 458 \nice melts on the ice-hydrohalite cotectic curve, with further heating the liquid composition 459 \nevolves along a straight line extending from the composition of the liquid at Tpb,ice to the 460 \ncomposition of hydrohalite (61.86 wt.% NaCl). The intersection of that line with the isotherm of 461 \nhydrohalite dissolution yields the unique bulk fluid composition. As an example, consider a fluid 462 \ninclusion in which ice melts on the I+HH cotectic at -25°C and hydrohalite is the last solid to 463 \nmelt at -10°C. At the last ice melting temperature, the liquid contains 14.3 wt.% NaCl and 10.4 464 \nwt.% CaCl2, from the intersection of Eqns. (1) and (2) at Tpb,ice = -25°C. The fluid inclusion bulk 465 \ncomposition lies on a mixing line between the composition of the liquid on the I+HH cotectic 466 \nand the composition of hydrohalite. The equation of the mixing line can be determined using the 467 \nslope and intercept method, where the x- and y-axes are wt.% NaCl and wt.% CaCl2, 468 \nrespectively, and the input xy coordinates are the compositions of liquid (14.3 wt.% NaCl, 10.4 469 \nwt.% CaCl2) and hydrohalite (61.9 wt.% NaCl, 0 wt.% CaCl2). The equation of this line (in xy 470 \ncoordinates) is also the equation of the vertical plane containing the line (in xyz coordinates, 471 \nwhere the z-axis is temperature), because the linear equation of the mixing line is independent of 472 \ntemperature. Thus, by iteratively solving for the pair of values of wt.% NaCl and wt.% CaCl2 473 \nthat satisfy both this linear equation and Eqn. (2), we find the bulk composition. In our example, 474 \na composition of 16.4 wt.% NaCl and 9.9 wt.% CaCl2 satisfies both equalities, and is thus the 475 \nbulk fluid composition of the inclusion. 476 \nField 4 Tpb,ant<Tm,hh 477 \nFor fluid inclusions that exhibit antarcticite melting in the presence of hydrohalite along 478 \nthe HH+A cotectic, followed by hydrohalite final melting (field 4; Fig. 11), the calculation 479 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n23 \nprocedure is analogous to that for field 3, the only difference being that Tpb,ant is substituted for 480 \nTpb,hh, and the liquid composition on the HH+A boundary is determined from the intersections of 481 \nEqns. (2) and (4).  482 \nField 5 Tpb,hh<Tm,h 483 \nFluid inclusions that have compositions within field 5 (Fig. 11) show halite as the last 484 \nsolid phase to melt, and hydrohalite as the next-to-last solid phase to melt. The calculation 485 \nprocedure for fluid inclusion compositions in this field depends on the input data that are 486 \navailable. 487 \nFor fluid inclusions in field 5 with compositions to the high-salinity side of the line 488 \nextending from CaCl2·6H2O to NaCl·2H2O (Figs. 1 and 11) (field 5a), the sub-solidus 489 \nassemblage is halite+hydrohalite+antarcticite, and first melting occurs at the first peritectic P1 490 \n(Fig. 1). At this temperature (-22.4°C), antarcticite is consumed and the liquid composition 491 \nsubsequently evolves along the HH+H peritectic curve, until hydrohalite is consumed at Tpb,hh. 492 \nThe liquid composition at Tpb,hh is determined from the intersection of Eqns. (2) and (3). The 493 \nliquid composition on the peritectic curve is recast in terms of the molar proportion of CaCl2 494 \nrelative to CaCl2+H2O (Ω) according to: 495 \n Ψ =\nSmol − SmolΨmol\n1− SmolΨmol\n (7) 496 \nUpon departure from the HH+H peritectic curve, the value of Ω of the liquid remains constant 497 \nwith further heating, as the liquid composition evolves along a straight line towards the NaCl 498 \napex. The fluid inclusion bulk composition is found as the intersection of the vertical plane 499 \ncontaining that line of constant Ω with the isotherm of final halite melting. 500 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n24 \nFor fluid inclusions in field 5 that lie within the ice-hydrohalite-antarcticite triangle  (fields 5b 501 \nand 5c) (Fig. 11), first melting occurs at the eutectic and the liquid composition evolves along 502 \neither the HH+A or HH+I curve until either ice or antarcticite is consumed, after which the liquid 503 \ncomposition evolves across the hydrohalite field along a straight line towards the composition of 504 \nhydrohalite. Upon intersecting the HH+H peritectic curve, halite nucleates and the liquid 505 \ncomposition evolves along the HH+H curve until hydrohalite is consumed. The liquid 506 \ncomposition then evolves along a straight line towards the NaCl apex with further heating until 507 \nhalite is completely consumed. For each of the fields 5b and 5c, there are thus three melting 508 \ntemperatures that may be observed and recorded (Tpb,ice (or Tpb,ant) + Tpb,hh + Tm,h), and any pair 509 \nof these is sufficient to fix the bulk fluid composition. VANKO et al. (1988) describe the methods 510 \nby which either pair of these data may be used to determine the fluid bulk composition. If the 511 \ndata available are Tpb,hh and Tm,h, the method used to calculate the inclusion composition is the 512 \nsame as outlined above for field 5a. However, as discussed by ROEDDER (1984) and VANKO et 513 \nal. (1988), the final melting of hydrohalite can be difficult to observe, and hydrohalite may 514 \npersist metastably for several degrees Celsius above the equilibrium melting temperature. For 515 \nthose reasons, it is sometimes more practical to measure Tpb,ice + Tm,h (VANKO et al., 1988). In 516 \nthat case, the liquid composition is determined at Tpb,ice using Eqns. (1) and (2), and the equation 517 \nof the straight line that extends from the cotectic liquid composition at Tpb,ice to the composition 518 \nof hydrohalite (as described above for field 3) (Fig. 12). The intersection of the vertical plane 519 \ncontaining that line with the isotherm of Tm,h on the halite liquidus (Eqn. (3)) represents the bulk 520 \nfluid composition (VANKO et al., 1988) (Fig. 12). Fluid inclusions with compositions in field 5c 521 \nare treated in a similar manner to those in field 5b, substituting Tpb,ant for Tpb,ice, and substituting 522 \nEqn. (4) for Eqn. (1). 523 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n25 \nField 6 Tpb,ant, Ca4h or Ca2h<Tm,h 524 \nThe calculation method for fluid inclusions that exhibit cotectic melting of one of the 525 \nthree CaCl2 hydrates in the presence of halite, followed by halite dissolution as the last solid 526 \nphase, is similar for each of the three halite+CaCl2·nH2O cotectics. Field 6a includes fluid 527 \ninclusion compositions for which antarcticite disappears on the H+A cotectic, field 6b includes 528 \nthose that lose tetrahydrate along the H+Ca4h cotectic, and field 6c includes those that lose 529 \ndihydrate on the H+Ca2h cotectic (Fig. 11). The method employed for each of these fields is to 530 \ndetermine the liquid composition (Ω) on the cotectic at the temperature of last hydrate melting 531 \nfrom the intersection of Eqn (3) with either Eqn. (4), Eqn. (5) or Eqn. (6) (depending on the last 532 \nhydrate to melt). The fluid inclusion bulk composition is found as the intersection of the vertical 533 \nplane containing the line of constant Ω with the isotherm of final halite melting (Tm,h). 534 \nField 7 – Tpb,x<Tm,ant, Ca4h or Ca2h 535 \nField 7 (Fig. 11) includes a narrow compositional range near the CaCl2 binary, and is 536 \ncharacterized by at least seven possible melting sequences and pairs of input data, although 537 \nobservation of melting sequences in this part of the system has yet to be reported unequivocally 538 \nfor natural fluid inclusions. 539 \nBecause the weight fraction of NaCl (Φ) in this part of the system is everywhere less than 540 \n0.05, the fluid bulk composition can be estimated with reasonable precision from Tm,CaCl2·nH2O 541 \nalone. The liquid Φ on the appropriate cotectic or peritectic curve can be determined directly as 542 \noutlined for the other fields, by the intersection of the adjacent liquidi, and the bulk composition 543 \nlies on the straight line that extends from that composition to the composition of the final melting 544 \nof solid CaCl2 hydrate. Again, the weight fraction of NaCl (Φ) in the bulk fluid in this part of the 545 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n26 \nsystem does not significantly affect the calculated total salinity and, in the absence of a next-to-546 \nlast melting temperature, Φ must be between 0-0.05. 547 \nDescription of the Numerical Model 548 \nThe numerical model developed in this study has been built into a Microsoft® Excel© program 549 \nthat estimates H2O-NaCl-CaCl2 fluid inclusion compositions. The program is available for 550 \ndownload as an electronic annex to this paper. Compositions that may be calculated using the 551 \nmodel are defined by a triangle bounded by the H2O apex, the NaCl apex and the composition of 552 \nCaCl2·4H2O on the H2O-CaCl2 binary (Fig. 13). For comparison, the compositional limits of 553 \nother published numerical models (CalcicBrine (NADEN, 1996); Aqso1e and AqSo2e (BAKKER, 554 \n2003); “H2O_NaCl-CaCl2” (CHI and NI, 2007)) are also shown in Figure 13. The compositional 555 \nrange of the numerical model developed in this study extends the applicability to fluid inclusions 556 \nthat have liquid compositions that evolve along an antarcticite-bearing cotectic curve, as well as 557 \nfluid inclusions that exhibit first melting at the first or second ternary peritectic, for which the 558 \ncomposition cannot be determined using the previously published models. The programs 559 \n“H2O_NaCl_CaCl2” (CHI and NI, 2007) and “AqSo2e” (BAKKER, 2003) do not allow the input 560 \nof a known weight fraction of NaCl (Φ) to calculate fluid inclusion bulk composition. 561 \nFurthermore, “AqSo2e” (BAKKER, 2003) does not allow the input of the combination of melting 562 \nof ice on a cotectic or peritectic (Tpb,ice) and melting of halite on the liquidus surface (Tm,h). 563 \n  564 \nExamples of Application of the Model to Natural Fluid Inclusions 565 \nApplication of the numerical model developed in this study to interpretation of natural 566 \nfluid inclusions can be demonstrated using data from previously published studies. Where 567 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n27 \navailable, data for individual fluid inclusions have been input into the numerical model derived 568 \nin this study to determine bulk fluid compositions.  In other cases, ranges of measured 569 \ntemperatures of phase transitions have been input into the model to estimate ranges in fluid 570 \ncompositions. 571 \nFluid inclusions that show ice as the final solid phase to melt are reported in many studies 572 \n(e.g., see BASUKI and SPOONER (2002) for references). The “Stage III” inclusions in epidote of 573 \nLAYNE and SPOONER (1991) are used as examples here to demonstrate the applicability of the 574 \nnumerical model developed in the present study. The compositions of these fluid inclusions, 575 \ndetermined using the microthermometric data of LAYNE and SPOONER (1991) in the numerical 576 \nmodel developed in this study range from 17.4 to 26.5 wt.% total salt, and a weight fraction of 577 \nNaCl (Φ) of 0.064 to 0.081 (Fig. 14). These compositions are in good agreement with those 578 \nreported by LAYNE and SPOONER (1991), differing by less than 1 wt.% total salinity for each 579 \ninclusion (Table 3). 580 \nFluid inclusions in which hydrohalite is the last solid to melt have been reported by, 581 \namong others, NYMAN et al. (1990), LAYNE and SPOONER (1991), and XU (2000). The 582 \nmicrothermometric data of NYMAN et al. (1990) are reported only as temperature ranges, and the 583 \nminimum and maximum melting temperatures were used to estimate the range of fluid inclusion 584 \ncompositions using our numerical model (Fig. 14; Table 3). The range in salinities determined 585 \nhere based on the microthermometric data of NYMAN et al. (1990) is 26.4 to 30.4 wt. % NaCl, 586 \nwith a range in weight fraction of NaCl (Φ) of 0.16 to 0.63, whereas NYMAN et al. (1990) report 587 \nsalinities of 26 to 27 wt.% NaCl and Φ from 0.6 to 0.7. The difference in Φ reported by NYMAN 588 \net al. (1990) compared to values determined in this study is likely due to the inaccuracy 589 \nassociated with graphically interpolating isotherms in the hydrohalite field that was used in the 590 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n28 \nprevious study, compared to the numerical methods used here. However, the bulk salinities 591 \nestimated by NYMAN et al. (1990) are in good agreement with those estimated here. 592 \nNatural fluid inclusions that show halite as the final solid to melt are described by VANKO 593 \net al. (1988), NYMAN et al. (1990), SCHIFFRIES (1990), LAYNE and SPOONER (1991) and XU 594 \n(2000). Microthermometric data from VANKO et al. (1988) for individual fluid inclusions in 595 \nquartz from a vein in hornblendite from the Mathematician Ridge, East Pacific Rise, have been 596 \nused to estimate fluid inclusion compositions (Fig. 14). Those fluid inclusions from VANKO et al. 597 \n(1988) in which ice melts in the presence of metastable halite have been excluded in this 598 \nexample. The compositions of the fluid inclusions determined using our numerical model are in 599 \ngood agreement with the compositions determined by VANKO et al. (1988), differing by less than 600 \n2 wt.% for each inclusion (Table 3). 601 \nMicrothermometric data from “Type 1” and “Type 3” inclusions from the Bushveld 602 \nComplex reported by SCHIFFRIES (1990) include cotectic melting temperatures of various CaCl2 603 \nhydrates. SCHIFFRIES (1990) did not estimate a bulk fluid composition due the uncertainty in 604 \nlocating the H+A and H+Ca2h cotectic curves, and the small number of experimental data in this 605 \npart of the phase diagram (SCHIFFRIES, 1990). The “Type 1” inclusions exhibit eutectic melting, 606 \nand the liquid evolves along the H+A cotectic before losing antarcticite (Tpb,ant) and undergoing 607 \nfinal melting by halite dissolution (Tm,h). The data for “Type 1” inclusions indicate salinities 608 \nranging from 46 to 51 wt.% total salt and weight fraction of NaCl (Φ) ranging from 0.15 to 0.24 609 \n(Fig. 14; Table 3). The “Type 3” inclusions of SCHIFFRIES (1990) show first melting at the 610 \nsecond ternary peritectic (P2) (Fig. 1), and the liquid evolves along the H+Ca4h cotectic before 611 \nlosing tetrahydrate (Tpb,Ca4h), and the last solid phase to melt is halite (Tm,h). The ranges of 612 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n29 \nTpb,Ca4h and Tm,h from SCHIFFRIES (1990) indicate salinities for the “Type 3” inclusions of 49 to 613 \n54 wt.% total salt, with Φ ranging from 0.14 to 0.25 (Fig. 14; Table 3). 614 \nNo examples are given in Figure 14 and Table 3 of fluid inclusions in which antarcticite 615 \nis the last solid phase to melt, because fluid inclusions of this type have not been unequivocally 616 \nidentified in previous studies. The apparent lack of fluid inclusions of this type may be due in 617 \npart to the narrow compositional range of the antarcticite field (Fig. 1), but also possibly due to 618 \nthe difficulty of recognizing antarcticite in fluid inclusions (see ROEDDER, 1984). For example, 619 \nROBERT and KELLEY (1987) identified salt hydrate as the last melting phase of some H2O-NaCl-620 \nCaCl2 fluid inclusions from gold-bearing quartz veins at the Sigma Mine, but were unable to 621 \ndetermine whether the phase was hydrohalite or antarcticite. ULMER-SCHOLLE et al. (1993) 622 \nreport antarcticite as the final solid phase to melt in fluid inclusions in diagenetic quartz from the 623 \nDelaware Basin (Texas and New Mexico), but the identification was based on melting 624 \ntemperatures up to +3.1°C for fluid inclusions with homogenization temperatures of 53-81°C 625 \n(ULMER-SCHOLLE et al., 1993). Fluid inclusions with such low homogenization temperatures 626 \ntend to eliminate the vapor bubble upon freezing, due to the volume expansion associated with 627 \nthe water-ice transition, and thus the melting temperatures were obtained under vapor-absent 628 \nconditions. Under such conditions, the temperatures of solid-liquid phase transitions cannot be 629 \nproperly interpreted with respect to experimental data for the vapor-saturated liquidus 630 \n(ROEDDER, 1967). As shown by ROEDDER (1967), a final melting temperature of +3.1°C is not 631 \nincompatible with metastable melting of ice in the pure H2O system under vapor-absent 632 \nconditions. 633 \nAlthough fluid inclusions that have antarcticite as the final solid phase to melt have not 634 \nbeen unambiguously identified, fluid inclusions with low NaCl weight fraction (Φ) (e.g., KWAK 635 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n30 \nand TAN, 1981; LAYNE and SPOONER, 1991) as well as those described by SCHIFFRIES (1990) in 636 \nwhich the liquid composition evolves along the H+A and H+Ca4h cotectics, indicate that fluid 637 \ncompositions in the CaCl2-rich portion of the phase diagram occur in nature. Furthermore, 638 \nRaman analysis has been used to identify CaCl2 hydrates in fluid inclusions (DUBESSY et al., 639 \n1982; SAMSON and WALKER, 2000; BAUMGARTNER and BAKKER, 2009). The numerical model 640 \ndeveloped in this study allows fluid compositions to be determined in this part of the phase 641 \ndiagram, and will be useful if fluid inclusions with high salinity and low weight fraction of NaCl 642 \n(Φ) are discovered in the future. 643 \n 644 \nSummary 645 \nThe empirical equations developed in this study completely describe the geometry of the 646 \nliquidus surface and cotectic curves for the part of the H2O-NaCl-CaCl2 phase diagram between 647 \nthe H2O apex, the NaCl apex and the composition of CaCl2·4H2O on the H2O-CaCl2 binary. The 648 \nnumerical model described herein incorporates this comprehensive set of equations to allow fluid 649 \ninclusion compositions to be determined anywhere within that compositional range, using a 650 \nvariety of combinations of input data. The model has been applied to estimate compositions of 651 \nnatural fluid inclusions using microthermometric data reported in the literature. The Microsoft® 652 \nExcel© program that implements the model to estimate fluid inclusion compositions is available 653 \nfor download as an electronic annex to this paper. The authors recommend that the model 654 \npresented here should be used in preference to CalcicBrine. 655 \n 656 \nAcknowledgements 657 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n31 \nThe authors thank Dave Vanko, Iain M. Samson and an anonymous reviewer for their comments 658 \nand suggestions that significantly clarified, improved and shortened an earlier version of this 659 \nmanuscript. The authors also thank Associate Editor Bob Burruss for his comments and sage 660 \nadvice on editorial issues. Thanks to Tobias Schlegel for testing the computer package and 661 \nsuggesting some improvements to the user interface. This material is based upon work supported 662 \nby the National Science Foundation under grant nos. EAR-0711333 and OCE-0928472. The 663 \nInstitute for Critical Technology and Applied Science (ICTAS) at Virginia Tech provided 664 \nsupport for Steele-MacInnis. Naden publishes with the permission of the Executive Director, 665 \nBritish Geological Survey (NERC). 666 \n667 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n32 \nReferences 668 \nBakker, R. J., 2003. Package FLUIDS; 1, Computer programs for analysis of fluid inclusion data 669 \nand for modelling bulk fluid properties. Chemical Geology 194, 3-23. 670 \nBasuki, N. I. and Spooner, E. T. C., 2002. A review of fluid inclusion temperatures and salinities 671 \nin Mississippi valley-type Zn-Pb deposits; identifying thresholds for metal transport. 672 \nExploration and Mining Geology 11, 1-17. 673 \nBaumgartner, M. and Bakker, R. J., 2009. CaCl2-hydrate nucleation in synthetic fluid inclusions. 674 \nChemical Geology 265, 335-344. 675 \nBodnar, R. J., 1994. Synthetic fluid inclusions; XII, The system H2O-NaCl; experimental 676 \ndetermination of the halite liquidus and isochores for a 40 wt% NaCl solution. 677 \nGeochimica et Cosmochimica Acta 58, 1053-1063. 678 \nChi, G. and Ni, P., 2007. Equations for calculation of NaCl\/(NaCl + CaCl2) ratios and salinities 679 \nfrom hydrohalite-melting and ice-melting temperatures in H2O-NaCl-CaCl2 system. 680 \nYanshi Xuebao 23, 33-37. 681 \nChou, I-Ming, 1987. Phase relations in the system NaCl-KCI-H2O. Part III: Solubilities of halite 682 \nin vapor-saturated liquids above 445°C and redetermination of phase equilibrium 683 \nproperties in the system NaCl-H20 to 1000°C and 1500 bars. Geochimica et 684 \nCosmochimica Acta 51, 1965-1975. 685 \nCollins, A. G., 1975. Geochemistry of oilfield waters. Elsevier Scientific Publishing Company, 686 \nAmsterdam; New York. 687 \nDubessy, J., Audeoud, D., Wilkins, R., and Kosztolanyi, C., 1982. The use of the Raman 688 \nmicroprobe MOLE in the determination of the electrolytes dissolved in the aqueous phase 689 \nof fluid inclusions. Chemical Geology 37, 137-150. 690 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n33 \nFrape, S. K., Fritz, P., and McNutt, R. H., 1984. Water-rock interaction and chemistry of 691 \ngroundwaters from the Canadian Shield. Geochimica et Cosmochimica Acta 48, 1617-692 \n1627. 693 \nGünther, D., Audetat, A., Frischknecht, R., and  Heinrich, C. A., 1998, Quantitative analysis of 694 \nmajor, minor and trace elements in fluid inclusions using laser ablation - inductively 695 \ncoupled plasma mass spectrometry: Journal of Analytical Atomic Spectroscopy, 13, p. 696 \n263-270. 697 \nHall, D.L., Sterner, S.M. and Bodnar, R.J., 1988, Freezing point depression of NaCl-KCl-H2O 698 \nsolutions. Economic Geology and the Bulletin of the Society of Economic Geologists, 83, 699 \n197-202. 700 \nHanor, J. S. and McIntosh, J. C., 2007. Diverse origins and timing of formation of basinal brines 701 \nin the Gulf of Mexico sedimentary basin. Geofluids 7, 227-237. 702 \nHaynes, F. M. and Kesler, S. E., 1987. Chemical evolution of brines during Mississippi valley-703 \ntype mineralization; evidence from East Tennessee and Pine Point. Economic Geology 704 \nand the Bulletin of the Society of Economic Geologists 82, 53-71. 705 \nKonnerup-Madsen, J., 1979. Fluid inclusions in quartz from deep-seated granitic intrusions, 706 \nsouth Norway. Lithos 12, 13-23. 707 \nKwak, T. A. P. and Tan, T. H., 1981. The importance of CaCl2 in fluid composition trends; 708 \nevidence from the King Island (Dolphin) skarn deposit. Economic Geology and the 709 \nBulletin of the Society of Economic Geologists 76, 955-960. 710 \nLayne, G. D. and Spooner, E. T. C., 1991. The JC tin skarn deposit, southern Yukon Territory; I, 711 \nGeology, paragenesis, and fluid inclusion microthermometry. Economic Geology and the 712 \nBulletin of the Society of Economic Geologists 86, 29-47. 713 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n34 \nLi, C. and Naldrett, A. J., 1993. High chlorine alteration minerals and calcium-rich brines in fluid 714 \ninclusions from the Strathcona deep copper zone, Sudbury, Ontario. Economic Geology 715 \nand the Bulletin of the Society of Economic Geologists 88, 1780-1796. 716 \nLinke, W. F., 1958. Solubilities, inorganic and metal organic compounds; a compilation of 717 \nsolubility data from the periodical literature. Van Nostrand, Princeton, NJ. 718 \nLowenstein, T. K., Hardie, L. A., Timofeeff, M. N., and Demicco, R. V., 2003. Secular variation 719 \nin seawater chemistry and the origin of calcium chloride basinal brines. Geology 31, 857-720 \n860. 721 \nNaden, J., 1996. CalcicBrine; a Microsoft Excel 5.0 add-in for calculating salinities from 722 \nmicrothermometric data in the system NaCl-CaCl2-H2O. In: Brown, P. E. and Hagemann, 723 \nS. G. Eds.)PACROFI VI, Madison, WI. 724 \nNational Research Council, 1928. International critical tables of numerical data, physics, 725 \nchemistry and technology. McGraw-Hill, New York. 726 \nNyman, M. W., Sheets, R. W., and Bodnar, R. J., 1990. Fluid-inclusion evidence for the physical 727 \nand chemical conditions associated with intermediate-temperature PGE mineralization at 728 \nthe New Rambler Deposit, southeastern Wyoming. The Canadian Mineralogist 28, 629-729 \n638. 730 \nOakes, C. S., Bodnar, R. J., and Simonson, J. M., 1990. The system NaCl-CaCl2-H2O; 1, The ice 731 \nliquidus at 1 atm total pressure. Geochimica et Cosmochimica Acta 54, 603-610. 732 \nOakes, C. S., Sheets, R. W., and Bodnar, R. J., 1992. (NaCl + CaCl2)[aq]; phase equilibria and 733 \nvolumetric properties. In: Hall, D. S. and Sterner, S. M. Eds.)PACROFI IV Extended 734 \nAbstracts, Lake Arrowhead, CA. 735 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n35 \nPotter, R. W., II and Clynne, M. A., 1978. Solubility of highly soluble salts in aqueous media; 736 \nPart 1, NaCl, KCl, CaCl2 , Na2SO4 , and K2SO4 solubilities to 100°C. Journal of 737 \nResearch of the U. S. Geological Survey 6, 701-705. 738 \nRobert, F. and Kelly, W. C., 1987. Ore-forming fluids in Archean gold-bearing quartz veins at 739 \nthe Sigma Mine, Abitibi greenstone belt, Quebec, Canada. Economic Geology and the 740 \nBulletin of the Society of Economic Geologists 82, 1464-1482. 741 \nRoedder, E., 1967. Metastable superheated ice in liquid water inclusions under high negative 742 \npressure. Science 155, 1412-1417. 743 \nRoedder, E., 1984. Fluid inclusions. Reviews in Mineralogy 12, 644. 744 \nSamson, I. M. and Walker, R. T., 2000. Cryogenic Raman spectroscopic studies in the system 745 \nNaCl-CaCl2-H2O and implications for low-temperature phase behavior in aqueous fluid 746 \ninclusions. The Canadian Mineralogist 38, 35-43. 747 \nSamson, I. M., Williams-Jones, A. E., Ault, K. M., Gagnon, J. E. & Fryer, B. J. (2008). Source 748 \nof fluids forming distal Zn-Pb-Ag skarns: Evidence from laser ablation-inductively 749 \ncoupled plasma-mass spectrometry analysis of fluid inclusions from El Mochito, 750 \nHonduras. Geology 36, 947-950. 751 \nSchiffries, C. M., 1990. Liquid-absent aqueous fluid inclusions and phase equilibria in the 752 \nsystem CaCl2-NaCl-H2O. Geochimica et Cosmochimica Acta 54, 611-619. 753 \nSterner, S. M., Hall, D. L., and Bodnar, R. J., 1988. Synthetic fluid inclusions. V. Solubility 754 \nrelations in the system NaCl-KCl-H2O under vapor-saturated conditions. Geochimica et 755 \nCosmochimica Acta 52, 989-1005. 756 \nStoffell, B., Appold, M. S., Wilkinson, J. J., McClean, N. A. & Jeffries, T. E. (2008). 757 \nGeochemistry and evolution of Mississippi valley-type mineralizing brines from the Tri-758 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n36 \nState and Northern Arkansas Districts determined by LA-ICP-MS microanalysis of fluid 759 \ninclusions. Economic Geology and the Bulletin of the Society of Economic Geologists 760 \n103, 1411-1435. 761 \nUlmer-Scholle, D. S., Scholle, P. A., and Brady, P. V., 1993. Silicification of evaporites in 762 \nPermian (Guadalupian) back-reef carbonates of the Delaware Basin, West Texas and 763 \nNew Mexico. Journal of Sedimentary Petrology 63, 955-965. 764 \nVanko, D. A., 1988. Temperature, pressure, and composition of hydrothermal fluids, with their 765 \nbearing on the magnitude of tectonic uplift at mid-ocean ridges, inferred from fluid 766 \ninclusions in oceanic layer 3. Journal of Geophysical Research 93, 4595-4611. 767 \nVanko, D. A., Bodnar, R. J., and Sterner, S. M., 1988. Synthetic fluid inclusions; VIII, Vapor-768 \nsaturated halite solubility in part of the system NaCl-CaCl2-H2O, with application to fluid 769 \ninclusions from oceanic hydrothermal systems. Geochimica et Cosmochimica Acta 52, 770 \n2451-2456. 771 \nWilliams-Jones, A. E. and Samson, I. M., 1990. Theoretical estimation of halite solubility in the 772 \nsystem NaCl-CaCl2-H2O; applications to fluid inclusions. The Canadian Mineralogist 28, 773 \n299-304. 774 \nXu, G., 2000. Fluid inclusions with NaCl-CaCl2-H2O composition from the Cloncurry 775 \nhydrothermal system, NW Queensland, Australia. Lithos 53, 21-35. 776 \nYanatieva, O. K., 1946. Solubility polytherms in the systems CaCl2-MgCl2-H2O and CaCl2-777 \nNaCl-H2O. Zhurnal Prikladnoi Khimii 19, 709-22. 778 \nZhang, Y., Han, Y., and Wang, S, 1995. Phase diagram of the ternary system SmCl3-NaCl-779 \nCaCl2. Thermochimica Acta 254, 383-90. 780 \n 781 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n37 \nAppendix A. Stable Melting Paths of H2O-NaCl-CaCl2 Fluid Inclusions 782 \nThe compositions of natural fluid inclusions that are described by the system 783 \nH2O-NaCl-CaCl2 may be determined based on the temperature and sequence of phase 784 \nchanges observed during heating from low temperatures. The temperatures of phase 785 \nchanges and the sequence of phase changes, in turn, depend on the bulk composition of 786 \nthe inclusion. The temperature of first melting provides an indication of which 787 \nrepresentative system is appropriate for interpreting the fluid inclusion composition, and 788 \nmay also provide an indication of the compositional range (e.g., first melting at the 789 \neutectic versus first melting at a peritectic point). However, the phase changes that are 790 \nmost often used to determine bulk compositions of fluid inclusions from 791 \nmicrothermometric data are the melting temperatures of the last and next-to-last solid 792 \nphases, so it is not necessary to measure the temperatures of all phase changes. The 793 \nreader is referred to SCHIFFRIES (1990) for a complete discussion of the many potential 794 \nstable melting pathways in the H2O-NaCl-CaCl2 system, and to VANKO et al. (1988) and 795 \nBAUMGARTNER and BAKKER (2009) for some examples of metastable melting sequences. 796 \nNote that if the last or next-to-last solid phase to melt is metastable, it can lead to 797 \nmisinterpretation of the fluid inclusion composition, as discussed by ROEDDER (1984) 798 \nand BAUMGARTNER and BAKKER (2009). 799 \nFluid inclusions approximated by the system H2O-NaCl-CaCl2 and having 800 \ncompositions that lie within the ice-hydrohalite-antarcticite triangle (triangle \"1\"; Fig. 1b) 801 \nare characterized by the subsolidus assemblage ice+hydrohalite+antarcticite, and have 802 \nfirst melting at the ternary eutectic (E) at -52°C (Fig. 1c). The vapor bubble (the presence 803 \nof which is required to demonstrate vapor-saturated conditions) is considered to be of 804 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n38 \nnegligible mass and does not contribute to the fluid composition (except perhaps for high 805 \ntemperature (≥ 400°C) fluid inclusions that contain a vapor bubble larger than a few 10’s 806 \nof volume percent at the time of last melting). Inclusions with compositions that lie 807 \nwithin the hydrohalite+halite+antarcticite triangle (triangle “2”; Fig. 1b) contain the 808 \nsubsolidus assemblage hydrohalite+halite+antarcticite. For these compositions, first 809 \nmelting occurs at the first peritectic point (point “P1”; Fig. 1c), and the first solid phase to 810 \nbe consumed is antarcticite. SCHIFFRIES (1990) has also identified fluid inclusions that are 811 \nliquid-absent at room temperature and characterized by the sub-solidus assemblage 812 \nantarcticite+halite+tetrahydrate (triangle \"3\"; Fig. 1b) and exhibit first melting at the 813 \nsecond ternary peritectic (P2) (Fig. 1c) at +29°C (SCHIFFRIES, 1990). Fluid inclusions 814 \nshowing second peritectic (or higher) first melting behavior are liquid-absent at room 815 \ntemperature and can be easily overlooked or mistaken for mineral inclusions during 816 \nroutine petrographic examination (SCHIFFRIES, 1990). 817 \n Natural H2O-NaCl-CaCl2 fluid inclusions that show ice as the last solid phase to 818 \nmelt have been described in many studies and are common in MVT deposits (e.g., see 819 \nBASUKI and SPOONER, 2002). For inclusions that have ice as the last solid phase to melt 820 \nthe liquid composition may evolve along either the I+HH cotectic (path E→a1; Fig. A1-821 \na) or the I+A cotectic (path E→a3; Fig. A1-a) during heating from the eutectic 822 \ntemperature, depending on the bulk composition. Thus, the melting temperature of ice 823 \n(Tm,ice) will be preceded by melting of hydrohalite (Tpb,hh) (path E→a1→a2, Fig. A1-a) 824 \nfor inclusions that contain more than 0.058 weight fraction of NaCl (Φ) relative to NaCl 825 \n+ CaCl2, corresponding to the composition at the eutectic,  but the melting temperature of 826 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n39 \nice will be preceded by Tpb,ant (path E→a3→a4, Fig. A1-a) if the bulk composition lies to 827 \nthe CaCl2-rich side of the eutectic composition (Φ = 0.058). 828 \nFor fluid inclusions whose bulk composition lies within the hydrohalite field, 829 \nhydrohalite is the last solid phase to melt and either ice or antarcticite must be the next-830 \nto-last solid phase to melt. Thus, the melting temperature of hydrohalite (Tm,hh) is 831 \npreceded by either the melting of ice (Tpb,ice; path E→b1→b2; Fig. A1-b) or the melting 832 \nof antarcticite (Tpb,ant; path E→b3→b4; Fig. A1-b). The fluid composition evolves 833 \ndirectly toward the composition of hydrohalite upon departure from the I+HH or HH+A 834 \ncotectic (path segments b1→b2 and b3→b4, respectively; Fig. A1-b), until final melting 835 \noccurs by hydrohalite disappearance (points “b2” and “b4”; Fig. A1-b). Natural fluid 836 \ninclusions that show hydrohalite as the last solid to melt have been described by NYMAN 837 \net al. (1990), LAYNE and SPOONER (1991) and XU (2000). 838 \nFluid inclusions with bulk compositions in the halite field may lose ice on the 839 \nI+HH cotectic (path E→c1→c2 →c3→c4; Fig. A1-c) or lose antarcticite on the HH+A 840 \ncotectic (path E→c5→c6 →c7→c8 ; Fig. A1-c). For example, consider a fluid inclusion 841 \nwith bulk composition shown by point “c4” in Figure A1-c. First melting occurs at the 842 \neutectic (point “E,” Fig. A1-c), where antarcticite is completely consumed. The liquid 843 \ncomposition then evolves along the I+HH cotectic upon further heating until ice is 844 \ncompletely consumed at point “c1” (Fig. A1-c). Then, the liquid composition evolves 845 \nacross the hydrohalite field along a straight line toward the composition of hydrohalite on 846 \nthe H2O-NaCl binary. Upon intersection of the HH+H reaction curve at point “c2” 847 \nhydrohalite reacts to produce halite + liquid. The liquid composition then evolves along 848 \nthe HH+H peritectic curve as halite grows at the expense of hydrohalite, until all 849 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n40 \nhydrohalite is consumed at point “c3”, and the liquid composition then evolves along a 850 \nstraight line towards halite with further heating, until final melting of halite at point “c4”, 851 \nrepresenting the fluid inclusion bulk composition (Fig. A1-c). This melting sequence can 852 \ntheoretically yield temperatures for the melting of ice along the I+HH cotectic (Tpb,ice) 853 \n(point “c1”; Fig. A1-c) (or melting of antarcticite along the HH+A cotectic, (Tpb,ant) 854 \n(point “c5”)), the melting of hydrohalite along the HH+H peritectic (Tpb,hh) and the 855 \nmelting of halite on the vapor-saturated halite liquidus (Tm,h) (Fig. 2c). However, in 856 \npractice the disappearance of the first phase to melt, either ice or antarcticite, may be 857 \ndifficult to recognize, or the melting temperature of hydrohalite may be difficult to 858 \ndetermine accurately owing to sluggish melting or metastability, for instance due to the 859 \nkinetic barrier to halite nucleation on the HH+H peritectic curve. Fluid inclusions that 860 \nfollow this melting sequence have been described in natural samples by VANKO et al. 861 \n(1988), NYMAN et al. (1990), LAYNE and SPOONER (1991) and XU (2000).  862 \nFluid inclusions with compositions in the halite field can also exhibit liquid 863 \nevolution along one or more of the halite-CaCl2 hydrate cotectics. For example, consider 864 \na fluid inclusion with a bulk composition shown by point “c10” in Figure A1-c. This bulk 865 \ncomposition lies within the hydrohalite+halite+antarcticite triangle (triangle “2”; Fig. 1b), 866 \nso the subsolidus assemblage is hydrohalite+halite+antarcticite. For this composition, 867 \nfirst melting occurs at the first peritectic point (point “P1”; Fig. A1-c), and the first solid 868 \nphase to be consumed is antarcticite. The liquid composition then evolves along the H+A 869 \ncotectic until it intersects the second peritectic point (point “P2”; Fig. A1-c), at which 870 \npoint antarcticite reacts to produce tetrahydrate + liquid. Once antarcticite is completely 871 \nconsumed, the liquid composition evolves along the H+Ca4h cotectic with further 872 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n41 \nheating, until tetrahydrate is completely consumed at point “c9” (Fig. A1-c), after which 873 \nthe liquid composition evolves along a straight line toward the composition of halite 874 \n(NaCl) until halite is completely consumed at point “c10”, representing the fluid 875 \ninclusion bulk composition. In theory, this melting sequence can provide values for Tpb,ant  876 \n(the second peritectic temperature) and Tpb,Ca4h along with Tm,h. Natural fluid inclusions 877 \nexhibiting this sequence of phase changes have been described by SCHIFFRIES (1990). 878 \nAs pointed out by SCHIFFRIES (1990), several phase change sequences corresponding to 879 \ncompositions within the expected range of geologic fluid compositions have yet to be 880 \nreported in natural H2O-NaCl-CaCl2 fluid inclusions. Most notably, natural fluid 881 \ninclusions in which the last solid phase to melt is a CaCl2 hydrate have yet to be 882 \nunequivocally identified, although some previous studies have reported a salt hydrate, 883 \nthought to be antarcticite, as the last solid phase to melt (e.g., ULMER-SCHOLLE et al., 884 \n1993), and final melting of CaCl2 hydrates has been observed in synthetic H2O-CaCl2 885 \nfluid inclusions (BAUMGARTNER and BAKKER, 2009). Several possible sequences of 886 \nphase changes are contained within the compositional range of the CaCl2 hydrate liquidi 887 \n(e.g., paths E→d1→d2 and E→d3→d4; Fig. A1-d). 888 \n889 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n42 \n 890 \nFigure Captions 891 \n  892 \nFigure 1. Vapor-saturated liquidus phase relations in the H2O-NaCl-CaCl2 system. (a) A 893 \ndistorted, schematic representation of the ternary H2O-NaCl-CaCl2 system 894 \nshowing the relative locations of the liquidus fields. (b) The shaded region on 895 \nthe ternary diagram shows the part of the system that is modeled in this study. 896 \nThe numbered triangles show fields of sub-solidus phase assemblages. Bulk 897 \ncompositions within triangle “1” contain the equilibrium assemblage 898 \nice+hydrohalite+antarcticite when frozen; those in triangle “2” contain 899 \nhydrohalite+halite+antarcticite when frozen; and those compositions in triangle 900 \n“3” contain halite+antarcticite+tetrahydrate when frozen. (c) Phase boundaries 901 \n(cotectic and peritectic curves) and isotherms calculated using the equations 902 \ndeveloped in this study (see text for discussion). The invariant points and 903 \nunivariant curves are labeled according to the terminology described in the 904 \ntext. Arrows on the univariant curves point up-temperature.  905 \n 906 \nFigure 2. Summary of sources of experimental data for the H2O-NaCl-CaCl2 system 907 \nused in this study. The data are sorted according to the phase assemblage on 908 \nthe vapor-saturated liquidus, and the source of the data (see the legend). The 909 \nphase boundary curves were calculated from the equations derived in this study 910 \n(described in detail in the text). 911 \n 912 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n43 \nFigure 3. Residuals, in percent difference between experimental and calculated values 913 \n{(1 - calculated\/measured)*100%}, associated with the liquid salinity on the 914 \nvapor-saturated liquidi of ice (a), hydrohalite (b), halite (c) and antarcticite (d) 915 \nas a function of the experimental salinity. Calculated salinities are based on the 916 \nmelting temperature of the last solid on the liquidus (Tm,x) and the weight ratio 917 \nof NaCl relative to NaCl + CaCl2 (Φ) calculated from Eqns. (1) to (4). The 918 \nsymbols used for the residuals correspond to the equation used and the source 919 \nof experimental values to which the predicted values are compared (see the 920 \nlegend). 921 \n 922 \nFigure 4. Comparison of the composition (salinity vs. NaCl weight ratio) on the -10°C 923 \nisotherm on the vapor-saturated hydrohalite liquidus predicted by the equation 924 \nof NADEN (1996) (dashed line) and by equation (2) from this study (solid line). 925 \nExperimental data on the -10°C isotherm from YANATIEVA (1946) are shown 926 \nas open circles. 927 \n 928 \nFigure 5. Comparison of the salinity on the +94.5°C isotherm on the vapor-saturated 929 \nhalite liquidus predicted by the equation of NADEN (1996) (dashed line) and by 930 \nequation (3) from this study (solid line). Experimental data on the +94.5°C 931 \nisotherm from the NATIONAL RESEARCH COUNCIL (1928) are shown as open 932 \ncircles. These experimental data were chosen for comparison because of the 933 \nlarge number of data points extending over a wide range of compositions along 934 \nthe +94.5°C isotherm in the NRC report.  935 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n44 \n 936 \nFigure 6. Liquidus curves for the H2O-NaCl (top) and H2O-CaCl2 (bottom) binary 937 \nsystems, calculated from Eqns. (1) to (6). Experimental data are from 938 \nNATIONAL RESEARCH COUNCIL (1928) (halite); YANATIEVA (1946) (ice, 939 \nhydrohalite, halite, antarcticite); LINKE (1958) (ice, hydrohalite, halite, 940 \nantarcticite, tetrahydrate, dihydrate); POTTER and CLYNNE (1978) (halite, 941 \nantarcticite, tetrahydrate, dihydrate); STERNER et al. (1988) (halite); and OAKES 942 \net al. (1990) (ice). 943 \n 944 \nFigure 7. Residuals, in percent difference between experimental and calculated values 945 \n{(1 - calculated\/measured)*100%}, associated with liquid salinity on the 946 \nI+HH, HH+H, HH+A and H+CaCl2·nH2O phase boundary curves as a function 947 \nof temperature from Eqns. (1), (2), (3), (4) and (6), plotted against the 948 \nexperimental salinity. Symbols used are the same as for Figure 3. 949 \n 950 \n Figure 8.  Residuals, in percent difference between experimental and calculated values 951 \n{(1 - calculated\/measured)*100%}, associated with Φ on the I+HH, HH+H, 952 \nHH+A and H+CaCl2·nH2O phase boundary curves as a function of temperature 953 \nfrom Eqns. (1), (2), (3), (4) and (6), plotted against the experimental weight 954 \nfraction of NaCl (Φ). The dashed vertical line in the I+HH residuals plot (upper 955 \nleft) shows the eutectic composition. Symbols used are the same as for Figure 956 \n3. 957 \n 958 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n45 \nFigure 9. Comparison of the weight fraction of NaCl in the liquid (Φ) as a function of 959 \ntemperature on the HH+H peritectic curve predicted by the equation of NADEN 960 \n(1996) (dashed line) and by the intersection of equations (2) and (3) from this 961 \nstudy (solid line). Experimental data (solid triangles) are from YANATIEVA 962 \n(1946) and LINKE (1958). 963 \n 964 \nFigure 10. Comparison of the liquid salinity as a function of temperature on the HH+H 965 \nperitectic curve predicted by the method of intersection of adjacent liquidus 966 \nsurfaces from NADEN (1996), implemented by BAKKER (2003) (dashed line) 967 \nand by the Equations (1) and (3) from this study (solid line). Experimental data 968 \n(solid triangles) are from YANATIEVA (1946) and LINKE (1958). 969 \n 970 \nFigure 11. Phase relations in the H2O-NaCl-CaCl2 system under vapor-saturated 971 \nconditions showing the eleven different composition fields, based on the 972 \nsequence and temperatures of the final two (or three) solids to melt during 973 \nheating. See text for discussion of phase changes corresponding to each field 974 \nand identification of symbols. 975 \n 976 \nFigure 12. Schematic heating sequence for a fluid inclusion with a composition within 977 \nfield 5b (Fig. 11), showing the melting events that may be observed during 978 \nmicrothermometry. Isotherms of the relevant phase changes are shown as 979 \ndotted lines. Antarcticite is lost at the eutectic (point “E”), . The liquid 980 \ncomposition then evolves along the I+HH cotectic with further heating until 981 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n46 \nice is consumed at point “a” (Tpb,ice). At this point, because hydrohalite is the 982 \nonly solid phase present, the liquid composition evolves along a straight line 983 \ntowards the composition of hydrohalite with further heating (segment a→b). 984 \nThe HH+H curve is intersected at point “b,” where halite nucleates (Tpb,hh*). 985 \nOn further heating, the liquid composition evolves along the HH+H peritectic 986 \ncurve (segment b→c), until hydrohalite is consumed at point “c” (Tpb,hh). At 987 \nthis point, halite is the only remaining solid phase, so with further heating the 988 \nliquid composition evolves towards the NaCl apex until intersecting the Tm,h 989 \nisotherm at point “d,” which is the bulk fluid inclusion composition. Note that 990 \nthe bulk composition lies along the mixing line “a-NaCl·2H2O” (between the 991 \nliquid composition at Tpb,ice and pure hydrohalite), and the mixing line “c-992 \nNaCl” (between the liquid composition at Tpb,hh and pure halite), therefore any 993 \npair of Tpb,ice, Tpb,hh or Tm,h, is sufficient to fix the bulk composition. 994 \n 995 \nFigure 13. Comparison of the compositional ranges over which the model presented in 996 \nthis study (top) and previously published models of the H2O-NaCl-CaCl2 997 \nsystem are valid (middle and bottom). Top: The compositional range of 998 \napplicability of the model presented in this study. Middle: The shaded field 999 \nshows the range of applicability of the model AqSo1e (BAKKER, 2003) and is 1000 \nalso the range for the model of CHI and NI (2007), except for a small region 1001 \nnear the H2O-CaCl2 binary as described in the text.  Bottom: The shaded area 1002 \nshows the range of applicability of the model AqSo2e (BAKKER, 2003) and 1003 \nCalcicBrine (NADEN, 1996).  1004 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n47 \nFigure 14. Examples of H2O-NaCl-CaCl2 fluid inclusion compositions determined from 1005 \npublished microthermometric data (sources listed in the legend) using the 1006 \nmodel developed in this study. Isotherms of measured melting temperatures 1007 \nshown in thin sold lines; pseudobinaries of liquid composition determined 1008 \nfrom measured cotectic melting temperatures shown as thin dashed lines. See 1009 \ntext for description of the data and Table 3 for comparison of the results with 1010 \nthose of the original studies. 1011 \n 1012 \nFigure A1.  Example melting pathways, or liquid lines of ascent (up temperature), for 1013 \nselect compositions in the H2O-NaCl-CaCl2 system. (a) A fluid with 1014 \ncomposition “a2” shows first melting at the eutectic (point E, -52°C) where 1015 \nantarcticite is consumed. The liquid composition evolves along the I+HH 1016 \ncotectic until hydrohalite is consumed at point “a1” (Tpb,hh), after which the 1017 \nliquid evolves toward the H2O apex until ice is consumed at point “a2” (Tm,ice), 1018 \nrepresenting the fluid inclusion bulk composition. A fluid with composition 1019 \n“a4” shows hydrohalite melting at the eutectic (point “E”) and the liquid 1020 \nevolves along the I+A cotectic until point “a3,” (Tpb,ant) where antarcticite 1021 \nmelts, with final melting at point“a4” (Tm,ice), representing the fluid inclusion 1022 \nbulk composition. (b) A fluid of composition “b2” will show the same initial 1023 \nmelting sequence as that for composition “a2” except that ice is consumed 1024 \nbefore hydrohalite on the I+HH cotectic at point “b1” (Tpb,ice), whereupon the 1025 \nliquid composition evolves directly towards the composition of hydrohalite 1026 \nuntil Tm,hh at point “b2”. For composition “b4” ice is lost at the eutectic (point 1027 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n48 \nE) and the liquid composition then evolves along the I+A cotectic until Tpb,ant 1028 \nat point “b3” where antarcticite is consumed. The liquid then evolves along a 1029 \nstraight line toward the composition of hydrohalite until Tm,hh at point “b4”. (c) 1030 \nFor composition “c4” first melting occurs at the eutectic (point “E”) where 1031 \nantarcticite is lost. The liquid then evolves along the I+HH cotectic until ice is 1032 \ncompletely consumed at point “c1” (Tpb,ice). The liquid composition then 1033 \nevolves directly towards the composition of hydrohalite until the HH+H curve 1034 \nis intersected at point “c2”, whereupon halite begins to grow at the expense of 1035 \nhydrohalite, and the liquid composition evolves along the HH+H peritectic 1036 \ncurve. Hydrohalite is finally consumed at point “c3” (Tpb,hh), and the liquid 1037 \ncomposition then evolves towards the NaCl apex until halite melts at Tm,h 1038 \n(“c4”), representing the fluid inclusion bulk composition. Fluid inclusions with 1039 \ncomposition “c8” follow an analogous pathway, but lose ice at the eutectic 1040 \n(point “E”) and next lose antarcticite on the HH+A cotectic at point “c5” 1041 \n(Tpb,ant). The liquid composition then evolves toward the composition of 1042 \nhydrohalite until the HH+H curve is intersected at point “c6,” where halite first 1043 \nnucleates. The liquid composition then evolves along the HH+H curve as halite 1044 \ngrows at the expense of hydrohalite with further heating. Hydrohalite is 1045 \ncompletely consumed at point “c7” (Tpb,hh), whereupon the liquid composition 1046 \nevolves directly toward the composition of halite until reaching Tm,h at point 1047 \n“c8”, representing the bulk composition. Fluid inclusions with composition 1048 \n“c10” have first melting at the first ternary peritectic point (“P1”) where 1049 \nhydrohalite is lost, and the liquid evolves along the H+A cotectic until 1050 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n49 \nintersecting the second ternary peritectic point (“P2”), where a reaction occurs 1051 \nand tetrahydrate grows at the expense of antarcticite by incongruent melting. 1052 \nThe liquid composition then evolves along the H+Ca4h cotectic until 1053 \ntetrahydrate is completely consumed at point “c9” (Tpb,Ca4h). The liquid then 1054 \nevolves towards the NaCl apex until final halite melting at point “c10” (Tm,h). 1055 \n(d) For a fluid inclusion with bulk composition “d2,” first melting occurs at the 1056 \neutectic (“E”) where hydrohalite is consumed. The liquid then evolves along 1057 \nthe I+A cotectic curve until ice is completely consumed at point “d1” (Tpb,ice), 1058 \nwhereupon the liquid composition evolves directly towards the composition of 1059 \nantarcticite until antarcticite is completely consumed at point “d2” (Tm,ant). A 1060 \nfluid inclusion with composition “d4” loses ice at the eutectic (point “E”), after 1061 \nwhich the liquid evolves along the HH+A cotectic until hydrohalite is 1062 \nconsumed at point “d3” (Tpb,hh). The liquid then evolves towards the 1063 \ncomposition of antarcticite until antarcticite is consumed at point “d4” (Tm,ant).  1064 \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n50 \nTable 1. Summary of the number of published experimental T-X data points for the H2O-NaCl-CaCl2 system used in this study. \n Solid phase(s) on cotectic and peritectic curves and on liquidus surfacesa \nSource I+HH I+A HH+H HH+A H+A H+Ca2h I HH H A Ca4h Ca2h \nNational Research Council (1928)         19    \nYanatieva (1946) 9 3 6 7 8  57 30 13 20   \nLinke (1958)   4  1 2 21 1 57 15 7 12 \nPotter and Clynne (1978)         11 4 5 5 \nVanko et al. (1988)         10    \nOakes et al. (1990) 1      168      \nOakes et al. (1992) 3            \nSterner et al. (1988)         8    \nSub-total       246 31 118 39 12 17 \nTotalb 13 3 10 7 9 2 262 61 137 58 12 19 \n(a) I = ice; HH = hydrohalite; H = halite; A = antarcticite; Ca4h = tetrahydrate; Ca2h = dihydrate \n(b) For each one-solid liquidus surface, the total number of data points used in the regression analysis is the sum of the subtotal (data \non the one-solid surface) plus the number of data points for the adjacent boundary curves.\nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n51 \n \n \nTable 2. Coefficients for Equations 1-6. \n \nai \nIce \n(Eqn. 1) \nHydrohalite \n(Eqn. 2) \nHalite \n(Eqn. 3) \nAntarcticite \n(Eqn. 4) \nTetrahydrate \n(Eqn. 5) \nDihydrate \n(Eqn. 6) \na0 0.46685 0.06039097042 0.0586472647 0.06467408472 1.041627135 0.096475342 \na1 -2.0508125 -2.967800E-5 2.2759389E-4 6.9903747E-4 -0.02232533 1.677838E-3 \na2 -0.08997493 7.0463278E-6 0 -2.607825E-5 1.3792920E-4 -1.3572629E-5 \na3 -2.5468641E-3 1.237133E-3 8.8841217E-9 1.0162876E-6 -2.95841861 4.5571671E-8 \na4 -3.7319837E-5 -1.290978E-3 1.2272697E-3 4.3288357E-9 0.032785047 -0.11534086 \na5 -2.1478861E-7 -5.219129E-3 -3.9989511E-6 1.1648119E-10   \na6 -1.138304 -3.178747E-6 -6.680437E-9 0.06779525838   \na7 0.269882 -1.408898E-7 0.0284636532 -1.0833486E-3   \na8 6.8878422E-3 1.0353807E-3 0    \na9 1.37774273E-8  3.1094576E-6    \nSteele-MacInnis et al. The system H2O-NaCl-CaCl2 (v. 081310) \n52 \n \nTable 3. Compositions of natural fluid inclusions estimated using the numerical model developed in this study. The \ncompositions reported in the original studies are shown for comparison.  \n     Salinity Φ \nSource Measured melting temperatures From \nSource \nThis Study From \nSource \nThis Study \nLayne and Spooner (1991) Tpb,hh Tm,ice     \n -44.5 -33.5 27 26.5 0.081 0.081 \n -49.1 -31.3 26.1 25.6 0.069 0.064 \n -49.2 -23.4 23.1 22.3 0.065 0.064 \n -49.6 -22.6 22.8 21.9 0.070 0.063 \n -45.9 -21.7 22.4 21.5 0.076 0.075 \n -46.6 -19.3 21.2 20.3 0.075 0.072 \n -43.7 -18.0 20.3 19.7 0.079 0.085 \n -46.5 -18.0 20.4 19.6 0.069 0.073 \n -45.6 -17.5 20 19.4 0.075 0.076 \n -47.2 -14.2 17.9 17.4 0.073 0.070 \nNyman et al. (1990) Tpb,ice Tm,hh     \n -41.0 to -25.0 -9.6 to -7.0 26 to 27 26.4 to 30.4 0.6 to 0.7 0.16 to 0.63 \nVanko et al. (1988) Tc,ice Tm,h     \n -30.9 +278 41 39.7 0.74 0.70 \n -34.8 +402 51.3 50.7 0.87 0.85 \n -29.9 +288 41.5 40.1 0.76 0.72 \n -30.8 +286 41.5 40.2 0.75 0.71 \nSchiffries (1990) –“Type 1” Tpb,ant Tm,h     \n +22 to +29 +161 to +201 - 46.5 to 50.3 - 0.15 to 0.24 \nSchiffries (1990) –“Type 3” Tpb,Ca4h Tm,h     \n +31 to +38 +173 to +225 - 49.8 to 53.9 - 0.14 to 0.25 \n \nH\n2O\nCa\nCl\n2\nN\naC\nl\nI\nH\nH\nH\nA\nCa\n4h\nCa\n2h\n?\n75\n w\nt.%\n C\naC\nl 2\nN\naC\nl 7\n5 \nw\nt.%\nH\n2O\nH\nyd\nro\nha\nlit\ne\nA\nnt\nar\nct\nic\nite\nH\nal\nite\nIc\ne\nCa\nCl\n2·6\nH\n2O\nNaC\nl·2H\n2O\nE’\n’ P 1 P 2\nP 1\n’’\nE’ P\n’\n-1\n0°\n-2\n0°\n-3\n0°\n20\n0° 3\n00\n° 4\n00\n°\nE’\n’ P 1\nH\nH\n +\n H\nH+\nA\nH+\nA\n-3\n0°\n-2\n0°\n10\n0°\nI+\nA\nH\nH\n+H\nHH\n+A\nE\n-2\n0°\nCa\nCl\n2·4\nH\n2O\nCa\nCl\n2·2\nH\n2O\nP 2\n’’\nP 3\n’’\nP 3\nI+\nHH\nI+\nH\nH\nH+\nCa4\nh\nH+\nCa2\nh\nE\n-4\n0°\nH\n2O\nCa\nCl\n2\nN\naC\nl\nCa\nCl\n2·\n4H\n2O\nN\naC\nl·2\nH\n2O\nCa\nCl\n2·\n6H\n2O\nCa\nCl\n2·\n2H\n2O\n1\n2\n3\nI =\n Ic\ne\nH\nH\n =\n H\nyd\nro\nha\nlit\ne\nH\n =\n H\nal\nite\nA\n =\n A\nnt\nar\nct\nic\nite\nCa\n4h\n =\n Te\ntr\nah\nyd\nra\nte\nCa\n2h\n =\n D\nih\nyd\nra\nte\n(?\n =\n n\no \nda\nta\n)\na) b)\nc)\nNational Reseach Council (1928)\nYanatieva (1946)\nLinke (1958)\nPotter and Clynne (1978)\nVanko et al. (1988)\nOakes et al. (1990)\nOakes et al. (1992)\nSterner et al. (1988)\nI H HH A\nI+HH\nHH+H\nI+A\nHH+A\nH+A\n75 % CaCl2 NaCl 75 %\nH2O\nCa4h Ca2h\nH+Ca2hSource\n-2\n0\n-1\n001020\n-2\n0\n-1\n001020\nH\nal\nite\nLi\nqu\nid\nus\nIc\ne \nLi\nqu\nid\nus\n20\n25\n30\n35\n40\n-2\n0\n-1\n001020\nSa\nlin\nity\n (w\nei\ngh\nt p\ner\nce\nnt\n N\naC\nl +\n C\naC\nl 2)\n30\n35\n40\n45\n50\n-2\n0\n-1\n001020\nA\nnt\nar\nct\nic\nite\n L\niq\nui\ndu\ns\nPercent Di\u001ference {(1-calc\/meas)*100}\n-2\n0\n-1\n001020\n0\n5\n10\n15\n20\n25\n30\n35\n-2\n0\n-1\n001020\n-2\n0\n-1\n001020\nH\nyd\nro\nha\nlit\ne \nLi\nqu\nid\nus\n25\n50\n75\n10\n0\n-2\n0\n-1\n001020\nd)\na)\nb)\nc)\nN\nad\nen\n, 1\n99\n6 \n= \nTh\nis\n S\ntu\ndy\nO\nak\nes\n e\nt a\nl.,\n 1\n99\n0\nCh\ni a\nnd\n N\ni, \n20\n07\nTh\nis\n S\ntu\ndy\nN\nad\nen\n, 1\n99\n6\nTh\nis\n S\ntu\ndy\nN\nad\nen\n, 1\n99\n6\nTh\nis\n S\ntu\ndy\nIc\ne \nLi\nqu\nid\nus\nIc\ne \nLi\nqu\nid\nus\nH\nyd\nro\nha\nlit\ne \nLi\nqu\nid\nus\nH\nal\nite\nLi\nqu\nid\nus\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\n20253035\nH\nyd\nro\nha\nlit\ne \nLi\nqu\nid\nus\n-1\n0°\nC \nIs\not\nhe\nrm\nTh\nis\n S\ntu\ndy\nN\nad\nen\n (1\n99\n6)\nEx\npe\nrim\nen\nta\nl\nR w\nt {\nw\nt.%\n N\naC\nl\/(\nw\nt.%\n N\naC\nl+\nCa\nCl\n2)\n}\nSalinity (wt. % NaCl+CaCl\n2\n)\n253545556\n5 0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\nH\nal\nite\n L\niq\nui\ndu\ns\n94\n.5\n°C\n Is\not\nhe\nrm\nTh\nis\n S\ntu\ndy\nN\nad\nen\n (1\n99\n6)\nEx\npe\nrim\nen\nta\nl\nR w\nt {\nw\nt.%\n N\naC\nl\/(\nw\nt.%\n N\naC\nl+\nCa\nCl\n2)\n}\nSalinity (wt. % NaCl+CaCl\n2\n)\n-25\n75\n175\n275\n375\n475\n575\n675\n775\n0 10 20 30 40 50 60 70 80 90 100\n-22\n-17\n-12\n-7\n-2\n3\n8\n13\n18\n0 4 8 12 16 20 24 28\nTe\nm\npe\nra\ntu\nre\n (°\nC)\nSalinity (weight percent NaCl)\nH2O-NaCl Binary\nExperimental\nThis study\nIce Halite HH\n-55\n-35\n-15\n5\n25\n45\n65\n85\n105\n125\n145\n165\n0 10 20 30 40 50 60 70\n20\n30\n40\n50\n60\n42.5 47.5 52.5 57.5\n-50\n-45\n-40\n-35\n-30\n24 26 28 30 32 34\nH2O-CaCl2 Binary\nExperimental\nThis study\nIce Ant Ca4h Ca2h\nTe\nm\npe\nra\ntu\nre\n (°\nC)\nSalinity (weight percent CaCl2)\na)\nb)\n20\n25\n30\n35\n-1\n0-6-22610\n25\n30\n35\n-1\n0-6-22610\n30\n31\n32\n33\n34\n35\n-1\n0-6-22610\n30\n40\n50\n-1\n0-6-22610\nSa\nlin\nity\n (w\nei\ngh\nt p\ner\nce\nnt\n N\naC\nl +\n C\naC\nl 2)\nPercent Di\u001ference {(1-calc\/meas)*100}\nI+\nH\nH\n C\not\nec\ntic\nH\nH\n+H\n P\ner\nite\nct\nic\n C\nur\nve\nH\nH\n+A\n C\not\nec\ntic\nH\n+C\naC\nl 2\n·n\nH\n2O\n C\not\nec\ntic\ns\n60\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\n-4\n0\n-2\n002040\nI+\nH\nH\n C\not\nec\ntic\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\nH\nH\n+H\n P\ner\nite\nct\nic\n C\nur\nve\n0.\n04\n0.\n05\n0.\n06\n-1\n0-6-22610\nH\nH\n+A\n C\not\nec\ntic\nH\n+C\naC\nl 2\n·n\nH\n2O\nCo\nte\nct\nic\ns\n0.\n02\n0\n0.\n03\n0\n0.\n04\n0\nR w\nt {\nw\nt.%\n N\naC\nl\/(\nw\nt.%\n N\naC\nl+\nCa\nCl\n2)\n}\nPercent Di\u001ference {(1-calc\/meas)*100}\n0.\n01\n0\n-6\n0\n-2\n0206010\n0 0 -3\n0\n-1\n0103050\n-2\n5\n-2\n0\n-1\n5\n-1\n0\n-5\n0\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\nTh\nis\n s\ntu\ndy\n N\nad\nen\n (1\n99\n6)\nEx\npe\nrim\nen\nta\nl\nR w\nt\nH\nyd\nro\nha\nlit\ne+\nH\nal\nite\n P\ner\nite\nct\nic\n C\nur\nve\nTe\nm\npe\nra\ntu\nre\n (°\nC)\nCa\nlc\nul\nat\ned\nRwt {wt.% NaCl\/(wt.% NaCl+CaCl2)}\n-2\n5\n-2\n0\n-1\n5\n-1\n0\n-5\n0\n253\n0\n35\nTh\nis\n s\ntu\ndy\n B\nak\nke\nr (\n20\n03\n)\nEx\npe\nrim\nen\nta\nl\nSa\nlin\nity\nCa\nlc\nul\nat\ned\nH\nyd\nro\nha\nlit\ne \n+ \nH\nal\nite\n P\ner\nite\nct\nic\n C\nur\nve\nTe\nm\npe\nra\ntu\nre\n (°\nC)\nSalinity (wt.% NaCl+CaCl2)\n75 % CaCl2 NaCl 75 %\nH2O\nNaCl·2H\n2 O\nH \n+ \nA\nI+A\nHH\n+A 1\n3\n5b\n5c\n6a\n4\n2\n7\n7\n2\n1\n3\n5b\n6a\n(To NaCl)\n6b\n6c\n5a\n(Limit of Model\nApplicability)H+\nCa\n2h\n7\n5c\nCaCl2·6H2O\nCaCl2·4H2O\nHH + H\nI + HH\nNa\nCl·2\nH2\nO N\naC\nl\nIc\ne\nH\nal\nite\nbu\nlk\nco\nm\npo\nsi\ntio\nn\nH\nyd\nro\nha\nlit\ne\nAnt\narc\ntici\nte\nCa4\nh\nCa2\nh\nE\nE’\nP’\nP 1\nP 3\nP 2\nT p\nb,\nic\ne\nT p\nb,\nhh\nT m\n,h\nI+\nH\nH\nH\nH\n+H\nT p\nb,\nhh\n*\na\nb\nc\nd\nH2O\nNaCl·2H2O\nE\nCaCl2·4H2O\nNaClCaCl2\nH2O\nNaCl·2H2O\nE\nCaCl2·4H2O\nNaClCaCl2\nH2O\nNaCl·2H2O\nE\nCaCl2·4H2O\nNaClCaCl2\nH2O_NaCl_CaCl2\n(Chi and Ni, 2007)\n+\nAqso1e\n(Bakker, 2003)\nCalcicBrine\n(Naden, 1996)\n+\nAqso2e\n(Bakker, 2003)\nThis Study\n \n-35\nH2O\n16\n1\n20\n1\n17\n3\n22\n5\n-14.2\n-33 -9.6-7.0\n-25\n-41\nNaCl·2H2O\nNaCl 75 %75 % CaCl2 (To NaCl)\n402\n278288\n22\n29\n31\n38\n-30\nIce \nHydrohalite \nHalite\nLayne and Spooner (1991)\nNyman et al. (1990)\nVanko et al. (1988)\nSchi\u001fries (1990) “Type 1”\nSchi\u001fries (1990) “Type 2”\nLiquidus\nPhase Source Symbol\na) c)\nb)\nd)\npa\nth\n E\n   \n   \na1\n   \n   \na2\na1\n =\n T\npb\n,h\nh\na2\n =\n T\nm\n,ic\ne\npa\nth\n E\n   \n   \na3\n   \n   \na4\na3\n =\n T\npb\n,a\nnt\na4\n =\n T\nm\n,ic\ne\npa\nth\n E\n   \n   \nb1\n   \n   \nb2\nb1\n =\n T\npb\n,ic\ne\nb2\n =\n T\nm\n,h\nh\npa\nth\n E\n   \n   \nb3\n   \n   \nb4\nb3\n =\n T\npb\n,a\nnt\nb4\n =\n T\nm\n,h\nh\npa\nth\n E\n   \n  c\n1 \n   \n c\n2 \n   \n c\n3 \n   \n c\n4\nc1\n =\n T\npb\n,ic\ne\nc2\n =\n T\npb\n,h\nh*\nc3\n =\n T\npb\n,h\nh\nc4\n =\n T\nm\n,h\npa\nth\n E\n   \n   \nc5\n   \n   \nc6\n   \n   \nc7\n   \n   \nc8\nc5\n =\n T\npb\n,a\nnt\nc6\n =\n T\npb\n,h\nh*\nc7\n =\n T\npb\n,h\nh\nc8\n =\n T\nm\n,h\npa\nth\n P\n1  \n   \n P\n2  \n   \n c\n9 \n   \n  c\n10\nc9\n =\n T\npb\n,C\na4\nh\nc1\n0 \n= \nT m\n,h\npa\nth\n E\n   \n   \nd1\n   \n   \nd2\npa\nth\n E\n   \n   \nd3\n   \n   \nd4\nd1\n =\n T\npb\n,ic\ne\nd2\n =\n T\nm\n,a\nnt\nd3\n =\n T\npb\n,h\nh\nd4\n =\n T\nm\n,a\nnt\nNa\nCl·2\nH2\nO\nCaC\nl2·6\nH2\nO\nCa\nCl\n2\nN\naC\nl\nIc\ne H\nal\nite\nc4\nc1\n0\nc8\nH\nyd\nro\nha\nlit\ne\nAnt\narc\ntici\nte\nE\nE’\nE”\nP’\nP 1\nP 3\nP 2\nP 1\n”\nP 2\n”\nc1\nc2\nc3\nc5\nc6\nc7\nc9\nCa\n4h\nCa\n2h\nNaC\nl·2H\n2O\nCaC\nl2·6\nH2\nO\nIc\ne\nAnt\narc\ntici\nte\nH\nyd\nro\nha\nlit\ne\nb1\nb3\nCa\n4h\nCa\n2h\nE\nE’\nE”\nP’\nP 1\nP 3\nP 2\nP 1\n”\nP 2\n”\nb2\nb4\nCaC\nl2·6\nH2\nO\nIc\ne\nAnt\narc\ntici\nte\nH\nyd\nro\nha\nlit\ne\nd1\nd2\nH\nal\nite\nE\nE”\nP 1\nP 2\nP 1\n”\nCa\n4h\nd3\nd4\nH\n2O\nAnt\narc\ntici\nte\nIc\ne\nH\nyd\nro\nha\nlit\ne\na1\na3\nE\nE’\nE”\na2\na4\n"}