{"doi":"10.1016\/S0047-2484(02)00162-8","coreId":"65753","oai":"oai:dro.dur.ac.uk.OAI2:4903","identifiers":["oai:dro.dur.ac.uk.OAI2:4903","10.1016\/S0047-2484(02)00162-8"],"title":"The evolution of the cortico-cerebellar complex in primates : anatomical connections predict patterns of correlated evolution.","authors":["Whiting,  B.","Barton, R. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-01-01","abstract":"Investigations into the evolution of the primate brain have tended to neglect the role of connectivity in determining which brain structures have changed in size, focusing instead on changes in the size of the whole brain or of individual brain structures, such as the neocortex, in isolation. We show that the primate cerebellum, neocortex, vestibular nuclei and relays between them exhibit correlated volumetric evolution, even after removing the effects of change in other structures. The patterns of correlated evolution among individual nuclei correspond to their known patterns of connectivity. These results support the idea that the brain evolved by mosaic size change in arrays of functionally connected structures. Furthermore, they suggest that the much discussed expansion of the primate neocortex should be re-evaluated in the light of conjoint cerebellar expansion","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65753.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4903\/1\/4903.pdf","pdfHashValue":"f29342e87d1eead7b19fd3a7c4a33850610cd57a","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4903<\/identifier><datestamp>\n      2011-09-09T13:41:17Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The evolution of the cortico-cerebellar complex in primates : anatomical connections predict patterns of correlated evolution.<\/dc:title><dc:creator>\n        Whiting,  B.<\/dc:creator><dc:creator>\n        Barton, R. A.<\/dc:creator><dc:description>\n        Investigations into the evolution of the primate brain have tended to neglect the role of connectivity in determining which brain structures have changed in size, focusing instead on changes in the size of the whole brain or of individual brain structures, such as the neocortex, in isolation. We show that the primate cerebellum, neocortex, vestibular nuclei and relays between them exhibit correlated volumetric evolution, even after removing the effects of change in other structures. The patterns of correlated evolution among individual nuclei correspond to their known patterns of connectivity. These results support the idea that the brain evolved by mosaic size change in arrays of functionally connected structures. Furthermore, they suggest that the much discussed expansion of the primate neocortex should be re-evaluated in the light of conjoint cerebellar expansion.<\/dc:description><dc:subject>\n        Brain<\/dc:subject><dc:subject>\n         Evolution<\/dc:subject><dc:subject>\n         Primate<\/dc:subject><dc:subject>\n         Cerebellum<\/dc:subject><dc:subject>\n         System<\/dc:subject><dc:subject>\n         Mosaic.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Journal of human evolution, 2003, Vol.44(1), pp.3-10 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4903<\/dc:identifier><dc:identifier>\n        issn:0047-2484<\/dc:identifier><dc:identifier>\n        doi:10.1016\/S0047-2484(02)00162-8<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4903\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/S0047-2484(02)00162-8<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4903\/1\/4903.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0047-2484","0047-2484"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Brain","Evolution","Primate","Cerebellum","System","Mosaic."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 February 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWhiting, B. and Barton, R. A. (2003) ’The evolution of the cortico-cerebellar complex in primates :\nanatomical connections predict patterns of correlated evolution.’, Journal of human evolution., 44 (1). pp.\n3-10.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/S0047-2484(02)00162-8\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n10 February 2009\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWhiting, B. and Barton, R. A. (2003) 'The evolution of the cortico-cerebellar complex in primates : anatomical\nconnections predict patterns of correlated evolution.', Journal of human evolution., 44 (1), pp.\u00003-10.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1016\/S0047-2484(02)00162-8\nWhiting & Barton \n1 \n \n \nEvolution of the cortico-cerebellar complex in primates. \n \nB.A. Whiting a,b and R.A. Barton a \na Evolutionary Anthropology Research Group, University of Durham, UK \nb Present address: Neurocognitive Development Unit, Institute of Child Health, London, \nUK \n \n \n \nCorresponding Author: \n \nBryony Whiting     Direct Line: +44 (020) 7905 2748 \nNeurocognitive Development Unit   Mobile: +44 (07968) 831052 \nInstitute of Child Health, UCL   Fax:  +44 (020) 7242 7717 \n30 Guilford Street      \nLondon      e-mail:        b.whiting@ich.ucl.ac.uk \nWC1N 1EH       \n \nSecond Author: \n \nRobert Barton      e-mail:        r.a.barton@durham.ac.uk \nDepartment of Anthropolgy \nUniversity of Durham \n43 Old Elvet \nDurham \nDH1 3HN \n \n \n \nKeywords:   Brain, evolution, primate, cerebellum, system, mosaic \n \nRunning Title: Anatomical connections and brain evolution \n \n \n \n \n \nWhiting & Barton \n2 \n \n \nAbstract \n \nInvestigations into the evolution of the primate brain have generally neglected the role of \nconnectivity in determining which brain structures have changed in size, focussing \ninstead on changes in the size of the whole brain or of individual brain structures, such as \nthe neocortex, in isolation. We show that the primate neocortex, cerebellum and \nvestibular nuclei exhibit correlated volumetric evolution.  At a relatively fine-grained \nlevel of resolution, the evolutionary correlations correspond to known patterns of \nconnectivity among these structures (amongst specific nuclei, for example).  These results \nsupport the idea that brains evolved by mosaic size change in arrays of connected \nstructures.  Furthermore, they suggest that the much discussed expansion of the primate \nneocortex should be re-evaluated in the light of conjoint cerebellar expansion.  \n \n \n \nWhiting & Barton \n3 \nIntroduction \nCompared to other mammals of similar body size, primates have evolved an unusually \nlarge brain1,2.  This large size is not thought to be due to the production of new structures, \nbut due to the modification of existing ones3-5.  Hence, the brains of primates and other \nmammals are similar in terms of the types of structures which they contain.  Where they \ndiffer is in the precise form, arrangement and relative size of these structures.  \nDifferences can vary from simple changes in size to more complex reorganization of \nneurons and their connections.  However, research on brain evolution has focussed \nprimarily on simple size changes in overall brain size or individual brain structures, \nparticularly the neocortex (refs).  While such research is certainly justified, it is limited \nby the fact that brain structures do not function in isolation, but rather as parts of \ndistributed systems (refs). \n \nBrain systems are groups of brain structures which are intimately connected and which \ncooperate to effectively process a particular type of information.  The format of systems \nis such that the expertise of each of the different brain structures involved is exploited for \na particular function of that system of which it forms a part: these are functional systems \nwith a division of labour.  The brain contains large numbers of such brain systems and \nthese often work in parallel, thereby increasing the efficiency of the brain.   \n \nInvestigations into the evolution of the primate brain should take account of these \nsystems by looking at interconnected structures rather than focussing solely on individual \nbrain regions.  At present, there is much controversy over whether the brain evolves as a \ncoordinated whole6 or whether individual structures or systems can evolve independently \nWhiting & Barton \n4 \nof changes in other parts of the brain (mosaic evolution)7.  This paper tests the mosaic \nchange hypothesis by analysing patterns of correlated evolution among interconnected \nstructures.  Given that functional systems are distributed across multiple structures, it is \npredicted that individual structures will be found to show correlated changes with other \nstructures involved in the same functional system independently of structures involved in \ndifferent systems.  One important point to note here is the fact that brain structures may, \nand often do, participate in more than one functional system (most notably the neocortex \nwhich is involved in numerous different systems).  This means that changes in the size of \none structure may be related to a large number of functional systems, not just one.  For \nthis reason, it is necessary to look at sub-parts of brain structures, to look at small-scale \nchanges in the particular areas included in the system of interest.  In this way, it should be \npossible to gain a more precise understanding of what a change in the size of a brain \nstructure actually means, that is to say, to discover precisely which system this change \nreflects. \n \nIn this paper we focus on inter-relationships among the cerebellum, neocortex, the relays \nbetween them (pons and thalamus) and the vestibular system.  Despite the fact that the \ncerebellar cortex has a simple and uniform structure, its function is highly heterogeneous.  \nIt has been implicated in the planning, execution and control of motor actions as well as, \nmore controversially, in a number of cognitive functions8-10.  Cerebellar systems are of \ninterest because recent evidence suggests that they have expanded in some groups of \nprimates11.  In addition, there is evidence for conjoint expansion of the cerebellum with \nan area that has been the subject of intense scrutiny, the neocortex7. Finally, volumetric \ncomparative data are available on individual cerebellar and vestibular nuclei12. \nWhiting & Barton \n5 \n \n \n \nThe cerebellar systems \nThe cerebellum receives input from the neocortex (via the pons), the vestibular system \n(lateral vestibular nucleus) and the spinal cord.  The output structures of the cerebellum \nare the cerebellar nuclei, which send projections to the neocortex (motor, premotor and \nprefrontal areas) via the ventrolateral nucleus of the thalamus.  The cerebellar nuclei also \nsend projections to the spinal cord via the lateral vestibular nucleus, the red nucleus or the \nbrain stem reticular formation.   \n \nThe current paper aims to investigate correlated evolution among these structures.  \nUnfortunately, data are not currently available on the volumes of the red nucleus, the \nreticular formation or particular regions of the spinal cord and it will therefore not be \npossible to include these structures in the current analyses.  Data are, however, available \non the volume of the individual structures involved in both the cerebellar-vestibular \nsystem and the cerebellar-neocortical system and these two important brain systems will \nbe the focus of the current investigation.  The principal connections involved in these \ncerebellar systems are illustrated in Figure 1 below. \n \n \n-----------------FIGURE 1 HERE------------------ \n \n \nWhiting & Barton \n6 \nThe investigation is split into the following three parts: \n \n(i) The neocortex and the cerebellum \n \nThe first part expands on studies showing that the cerebellum has undergone correlated \nevolutionary size changes with the neocortex7,13,14.  The evolution of the cerebellum and \nthe neocortex is investigated in more detail here to determine which particular areas of \nthe cerebellum have shown correlated evolutionary changes with the neocortex.  Data are \ncurrently available for the volume of the cerebellum as a whole and for the volume of the \ncerebellar nuclei, and these are used to calculate the volume of the non-nuclear \ncerebellum (which includes the cerebellar cortex, the major input area of the cerebellum). \nIt is crucial that in these analyses, variation in the size of other brain structures is \npartialled out.  This means that any significant relationships found between cerebellar and \nneocortical evolution are independent of evolutionary changes in other structures, hence \nspecific to the cortico-cerbellar structures under investigation.. \n \n(ii) The pons and the thalamus \n \nIn the second part, the pons and the thalamus are analysed.  This is important because \nthere are no direct neural connections between the neocortex and the cerebellum.  \nProjections from the neocortex to the cerebellum pass through the pons, and projections \nfrom the cerebellum back to the neocortex pass through the thalamus.  \n \nWhiting & Barton \n7 \n(iii) The vestibular system \n \nThe final part looks at the other projections to and from the cerebellum.  As can be seen \nin Figure 1, in addition to the neocortical circuit, the cerebellum also receives information \nfrom, and sends information to, the vestibular system.  It is the lateral vestibular nucleus \nin particular that has connections to the cerebellum.  This nucleus projects to the \nflocculonodular lobe of the cerebellum. Outputs back to the lateral vestibular nucleus \ncome from the middle cerebellar nucleus (MCN). Unfortunately, data are currently \nlacking on the volumes of the ventrolateral nucleus of the thalamus and on the \nflocculonodular lobe of the cerebellum.  The volume of the whole thalamus and the \nvolume of the non-nuclear cerebellum, respectively, are therefore used as the best \ncurrently possible approximations. \n \nMethods \nWe used the method of independent contrasts, which enables the assessment of correlated \nevolution in comparative data sets (refs).  The method works by calculating standardised \ncontrasts between sister taxa in the phylogeny.  Hence, a contrast score represents the \nevolutionary change that has occurred since the common ancestor of the sister taxa.  \nThese contrasts can then be subjected to standard methods of correlation and regression. \nThe particular computer package used in the current analyses is C.A.I.C. (Comparative \nanalysis by independent contrasts)15 which uses Felsenstein’s method of independent \ncomparisons.   \n \nWhiting & Barton \n8 \nAs we were interested in whether particular components of cerebellum, neocortex and \nvestibular system evolved together independently of variation in other brain structures, \nwe also calculated contrasts for the rest of the brain (whole brain size-\n(cerebellum+neocortex+vestibular nuclei)), and then partialled out the effects of this \nvariable using regression.  This was done by regressing contrasts in, for example, the \ncerebellum, on contrasts in the rest of the brain, and taking residuals.  These residuals are \nreferred to as relative contrasts in cerebellum size. \n \nData on the volume of the cerebellum (including individual cerebellar nuclei), the \nneocortex, the vestibular system (including the individual vestibular nuclei) and the \nthalamus for up to 44 species of primates comes from Stephan16.  Data on the volume of \nthe pons comes from Matano et al.17.  The original estimates of cerebellar volume \nincorporated the pons (Matano et al. 1985), so we obtained cerebellum volumes by \nsubtracting the volume of the pons from these estimates.  Data on the volume of the \ncerebellum and the whole brain in Pan paniscus and Pongo pigmaeus (which was not \nincluded in the Stephan et al. data set) come from Semendeferi and Damasio18 and \nmeasurements of the volume of the neocortex in these species comes from Rilling and \nInsel19.  Volumes of the cerebellar nuclei are obtained from Matano and Hirasaki12 and \nvolumes of the non-nuclear cerebellum are calculated by subtracting the volumes of the \nnuclei from whole cerebellum volume. \"Rest of the brain\" volumes are calculated by \nsubtracting the relevant brain structures from whole brain volumes for the various \ndifferent calculations.  All data were analysed in logarithmic form making them suitable \nfor independent contrasts analysis15.  A total of 44 species of primate were included. \n \nWhiting & Barton \n9 \n \n \nResults \nIn each case the significance level is set at p<0.05.  The graphs are provided only for \nthose correlations which are significant. \n \n(i) The neocortex and the cerebellum \n \nCorrelations between relative contrasts in neocortex size and relative \ncontrasts in cerebellum size are presented in Table 1. \n \nGraphs (i), (ii) and (iii) show the significant evolutionary relations for this data set. All \nthree of the comparisons between the neocortex and the cerebellum were found to be \nsignificant.  The most significant relationships were between the neocortex and the whole \ncerebellum (r2=0.29, p=0.0003) and the non-nuclear cerebellum alone (r2=0.28, \np=0.0003,).  A weaker though still significant positive correlation was found between the \nneocortex and the cerebellar nuclei (r2=0.20, p=0.003). \n \n(ii) The pons and the thalamus \n \nRelative contrasts in pons size and thalamus size show varying correlations with relative \ncontrasts in cerbellum and neocortex size (Table 2). \n \nWhiting & Barton \n10 \nThe pons and the neocortex have shown significantly and positively correlated volumetric \nchanges over evolutionary time (r2=0.15, p=0.01,).  A slightly weaker but still significant \ncorrelation is found between the cerebellum and the pons (r2=0.10. p=0.04).  However, \nthe pons correlates only with the non-nuclear part of the cerebellum (r2=0.09, p=0.05), \nand not with the cerebellar nuclei (r2=0.06, p=0.14).  Conversely, the thalamus correlates \npositively and highly significantly with the cerebellar nuclei (r2=0.54, p<0.0001), but not \nwith the non-nuclear part of the cerebellum (r2=0.14, p=0.07).  These findings accord \nwith the anatomical connections, since the pons projects directly to the cerebellar cortex, \nwhilst the thalamus receives direct projections from the cerebellar nuclei (Figure 1). \n \n \n(iii) The vestibular system \nRelative contrasts in vestibular system size and lateral vestibular nucleus size show \nvarying correlations with relative contrasts in cerebellum and neocortex size (Table 3). \nRelative vestibular nucleus volumes are uncorrelated with relative volume of both the \nwhole cerebellum and of the non-nuclear part of the cerebellum.   There is, however, a \nstrong positive correlation between vestibular and cerebellar nuclei.  As predicted by \nanatomical connections, this correlation is strongest for the medial cerebellar nucleus \n(r2=0.48, compared with 0.33 and 0.17 for the other two cerebellar nuclei).  When the \nlateral vestibular nucleus is regressed on each of the  three cerebellar nuclei using \nmultiple regression, only the medial cerebellar nucleus shows a significant relationship \n(MCN, t=3.99, p=0.0003; ICN, t=0.57, p=-0.57; LCN, t=-0.50, p=0.62).  Similarly \nanother multiple regression indicates that, of the vestibular nuclei, it is the lateral nucleus \nwhich shows the closest relationship with the medial cerebellar nucleus (LVN, t=3.87, \nWhiting & Barton \n11 \np=0.0005; SVN, t=-0.34, p=0.73; MVN, t=2.11, p=0.04; DVN, t=1.36, p=0.18).  Hence, \npatterns of correlated evolution reflect the strong anatomical relationship between medial \ncerebellar and lateral vestibular nuclei. \n \n---------------TABLES 1,2 and 3 HERE---------------- \n \n------------------FIGURE 2 HERE------------------- \n \n \nDiscussion \nThese results corroborate the suggestion that, during the radiation of the primate order, \nthe neocortex and cerebellum have undergone correlated evolution (Barton & Harvey \n2000). They additionally show that other related structures, the pons, thalamus and \nvestibular complex, have also changed in concert.  Furthemore, we have shown that, at a \nfiner scale, the patterns of correlated evolution are to a great extent predictable from \ninformation on anatomical connectivity.  Hence these findings lend further weight to the \nidea that the primate brain has evolved as a functional mosaic.  The functional systems \ninvolved are distributed across major brain regions, including the brainstem, midbrain \nand forebrain, emphasizing the need for comparative studies to go beyond the analysis of \nindividual brain structures and to focus instead on distributed systems.  Whilst the \nlimitations of the available data dictate that our analyses are still crude in terms of \ndefining functional systems, it is encouraging that such predictions as could be made \nwere supported.  In the future it would be useful to see further refinement of hypotheses \nWhiting & Barton \n12 \nand tests using data on, for example, individual thalamic nuclei (but see Barton 1998), \nand regions of the cerebellar cortex.  \n \nThe neocortex projects, via the pons, directly to the cerebellar cortex, but not to cerebellar \nnuclei.  In accord with this, the neocortex and pons correlated more strongly with \ncerebellar cortex than with the cerebellar nuclei.  The cerebellar nuclei, on the other hand, \nwere found to correlate strongly with the thalamus, the structure to which they project.  \nFor the cerebellar-vestibular system, correlated evolution was found at the level of \nindividual cerebellar nuclei.  In these analyses, the two nuclei with direct connections, the \nlateral vestibular nucleus and medial cerebellar nucleus, exhibited strongly correlated \nevolution even after controlling for variation in the size of the other nuclei.  \n \nAlthough the thalamus and neocortex are extensively connected, there was only a weak \ncorrelation between these two structures (p=0.06).  Possible explanations include the fact \nthat there was a reduced sample size for thalamus volume and the fact that data were not \navailable for the particular area of the thalamus which is involved in the cerebellar-\nneocortical system (the ventrolateral thalamic nucleus). \n \nA mechanism by which the coordinated evolution of cortico-cerebellar elements might \nhave occurred, was proposed by Matano & Hirasaki12. They suggested that a decrease in \nthe size of a nucleus reflects either a decrease in the number of neurons that it contains, or \na decrease in the size of the arborization of dendrites and thus a decrease in the number of \nsynaptic terminals.  Therefore, a decrease in the size of one area might indicate that there \nare simply not enough neurons for the number of synaptic connections that existed \nWhiting & Barton \n13 \nbefore, or that the level of dendritic arborization is not high enough to support the same \nlevel of connectivity.  Either way, a decrease in the size of a cerebellar nucleus will result \nin a decrease in the connections of that nucleus.  Conversely, an increase in size would \neither reflect an increase in the number of neurons, or an increase in the number of \nsynaptic terminals available for forming new connections, thus increasing the number of \nprojections.  This clearly shows that changes in the size of a brain structure affect the \nconnections of that structure and consequently also the areas to which it is connected. \n \n \nConclusions and summary \nPrevious work on the evolution of the primate brain has generally focussed on changes in \nindividual structures.  Brain structures, however, do not function in isolation, but \ncontribute to distributed functional systems.  The present analyses demonstrate correlated \nevolution among neocortex, cerebellum, vestibular complex and relay stations (pons and \nthalamus). At as fine a scale as allowed by the available data, the patterns of correlated \nevolution reflect functional connectivity.  Finally, our results suggest that the focus on the \nneocortex as the principle area of change in primate brain evolution (references:  Barton \n& Dunbar & others) may have been excessive, and that some attention should now be \npaid to cortico-cerbellar circuits and the cognitive functions they mediate.  These might \ninclude… \nWhiting & Barton \n14 \nReferences \n \n1. Passingham, R.E.P. (1982). The Human Primate.  Oxford: W.H. Freeman and Co.  \n \n2. Deacon, T.W. (1990). Fallacies of progression in theories of brain-size evolution.  \nInternational Journal of Primatology 11, 193-236  \n \n3. Simpson G.G. (1967). Meaning of Evolution: A study of the history of life and of \nits significance for man.  Yale University Press  \n \n4. Jacob, F. (1982). The possible and the actual.  New York: Pantheon Books  \n \n5. Preuss, T.M. (1995). The argument from animals to humans in cognitive \nneurosciences.  In Gazzaniga, M.S. (Ed.): The Cognitive Neurosciences.  London: \nMIT Press  \n \n6. Finlay, B.L. & Darlington, R.B. (1995). Linked regularities in the development \nand evolution of mammalian brains.  Science 268, 1578-84  \n \n7. Barton, R.A. & Harvey, P.H. (2000). Mosaic evolution of brain structure in \nmammals.  Nature 405, 1055-58  \n \nWhiting & Barton \n15 \n8. Fiez, J.A., Petersen, S.E., Cheney, M.K. & Raichle, M.E. (1992). Impaired non-\nmotor learning and error-detection associated with cerebellar damage – a single \ncase-study.  Brain 115, 155-178  \n \n9. Leiner, H.C., Leiner, A.L. & Dow, R.S. (1993). Cognitive and language functions \nof the human cerebellum.  Trends in Neurosciences 16, 444-447  \n \n10. Fabbro F., Moretti, R. & Bava, A. (2000). Language impairments in patients with \ncerebellar lesions.  Journal of Neurolinguistics 13, 173-188  \n \n11. Rilling, J.K. & Insel, T.R. (1998). Evolution of the cerebellum in primates: \ndifferences in relative volume among monkeys, apes and humans.  Brain, \nBehaviour and Evolution 52, 308-314  \n \n12. Matano, S. & Hirasaki, E. (1997). Volumetric comparisons in the cerebellar \ncomplex of anthropoids, with special reference to locomotor types.  American \nJournal of Physical Anthropology 103, 173-183  \n \n13.  Barton, R.A. (2002). How did brains evolve?  Nature 415, 134-135  \n \n14. Clark, D.A., Mitra, P.P. & Wang, S.S.H. (2001). Scalable architecture in \nmammalian brains.  Nature 411, 189-193  \n \nWhiting & Barton \n16 \n15. Purvis, A. & Rambaut, A. (1995). Comparative analysis by independent contrasts \n(C.A.I.C.): An apple macintosh application for analysing comparative data.  \nComputer Appl. Biosciences 11, 247-251  \n \n16. Stephan, H., Frahm, H.D. & Baron, G. (1981). New and revised data on volumes \nof brain structures in insectivores and primates. Folia Primatologica 35: 1-29  \n \n17. Matano, S., Stephan, H. & Baron, G. (1985). Volume comparisons in the \ncerebellar complex of primates 1. Ventral Pons.  Folia Primatologica 44, 171-181  \n \n18. Semendeferi, K. &  Damasio, H. (2000). The brain and its main anatomical \nsubdivisions in living hominoids using magnetic resonance imaging.  Journal of \nHuman Evolution 38, 317-332  \n \n19. Rilling, J.K. & Insel, T.R. (1999). The primate neocortex in comparative \nperspective using magnetic resonance imaging.  Journal of Human Evolution 37, \n191-233  \n \n \n \n \nWhiting & Barton \n17 \nFigure 1: The major connections of the cerebellum. \n \nAdd: there are also projections to the reticular formation and the red nucleus, however \nsufficient volumes for these structures are not yet available for primates and it is therefore \nnot yet possible to include these structures in our analyses. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nNeocortex \nPons \nCerebellum \nCortex \nThalamus \nLCN \nICN \nMCN \nVestibular \nsystem \nWhiting & Barton \n18 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nNeocortex \nPons \nCerebellum \nCortex \nThalamus \nSpinal cord \nRed \nnucleus \nReticular \nformation \nVestibular \nsystem \nNuclei \nWhiting & Barton \n19 \nFigure 2. Regression plots after independent contrast analysis to show the \ncorrelated evolution of pairs of brain structures involved in cerebellar systems. \n \n \n(i) The whole cerebellum and the neocortex \n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\n.05\nR\ne\nla\nti\nv\ne\n C\ne\nre\nb\ne\nll\nu\nm\n s\niz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04\nRelative Neocortex size\n \n(ii) The non-nuclear cerebellum and the  \nneocortex \n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\nR\ne\nla\nti\nv\ne\n N\ne\no\nc\no\nrt\ne\nx\n s\niz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04 .05\nRelative Non-nuclear cerebellum size  \n(iii) The cerebellar nuclei and the neocortex  \n-.05\n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\n.05\n.06\nR\ne\nla\nti\nv\ne\n c\ne\nre\nb\ne\nll\na\nr \nn\nu\nc\nle\ni \n(T\nC\nN\n) \nsi\nz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04\nRelative Neocortex size  \n(iv) The neocortex and the pons \n-.05\n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\nR\ne\nla\nti\nv\ne\n P\no\nn\ns\n s\niz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04\nRelative Neocortex size\n \n(v) The whole cerebellum and the pons \n-.05\n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\nR\ne\nla\nti\nv\ne\n P\no\nn\ns\n s\niz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04 .05\nRelative Cerebellum size  \n(vi) The non-nuclear cerebellum and the pons \n-.05\n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\n.04\nR\ne\nla\nti\nv\ne\n P\no\nn\ns\n s\niz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03 .04 .05 .06\nRelative non-nuclear Cerebellum size  \n(vii) The cerebellar nuclei and the thalamus \n \n-.04\n-.03\n-.02\n-.01\n0\n.01\n.02\n.03\nR\ne\nla\nti\nv\ne\n T\nh\na\nla\nm\nu\ns \nsi\nz\ne\n-.04 -.03 -.02 -.01 0 .01 .02 .03\nRelative Cerebellar nuclei (TCN) size  \n(viii) The middle cerebellar nucleus (MCN) \nand the lateral vestibular nucleus \n \n-.06\n-.04\n-.02\n0\n.02\n.04\n.06\n.08\nR\ne\nla\nti\nv\ne\n L\na\nte\nra\nl \nv\ne\nst\nib\nu\nla\nr \nn\nu\nc\nle\nu\ns \nsi\nz\ne\n-.06 -.04 -.02 0 .02 .04 .06\nRelative Middle Cerebellar Nucleus (MCN) size  \nWhiting & Barton \n20 \n \nTable 1.   Correlated volumetric evolution of the neocortex and cerebellar areas as \nrevealed by bivariate regressions on residuals of independent contrasts. \n \n Whole Cerebellum Non-nuclear cerebellum \nCerebellar  \nnuclei \nNeocortex \np \nf \nr2 \nd.f. \n0.0003 \n16.23 \n0.29 \n1, 40 \np \nf \nr2 \nd.f. \n0.0003 \n15.38 \n0.28 \n1, 40 \np \nf \nr2 \nd.f. \n0.0033 \n9.82 \n0.20 \n1, 40 \n \n \n \n \n \nTable 2.  Correlated volumetric evolution among brain structures involved in the \ncerebellar-neocortical system as revealed by bivariate regressions on residuals of \nindependent contrasts. \n \n \nNeocortex Whole Cerebellum \nNon-nuclear \ncerebellum \nCerebellar \nnuclei \n    Pons \np \nf \nr2 \nd.f. \n0.013 \n6.86 \n0.15 \n1, 39 \np \nf \nr2 \nd.f. \n0.04 \n3.99 \n0.10 \n1, 39 \np \nf \nr2 \nd.f. \n0.05 \n3.91 \n0.09 \n1, 39 \np \nf \nr2 \nd.f. \n0.14 \n2.29 \n0.06 \n1, 39 \n    Thalamus \np \nf \nr2 \nd.f. \n0.06 \n3.90 \n0.15 \n1, 22 \np \nf \nr2 \nd.f. \n0.06 \n4.01 \n0.15 \n1, 22 \np \nf \nr2 \nd.f. \n0.07 \n3.63 \n0.14 \n1, 22 \np \nf \nr2 \nd.f. \n<0.0001 \n25.49 \n0.54 \n1, 22 \n \nWhiting & Barton \n21 \n \n \nTable 3: Correlated volumetric evolution among brain structures involved in the \ncerebellar-vestibular system as revealed by bivariate regressions on residuals of \nindependent contrasts. \n \n Whole Cerebellum \nNon-nuclear \ncerebellum \nCerebellar \nnuclei MCN \n   Vestibular    \n   System \np \nf \nr2 \nd.f. \n0.75 \n0.10 \n0.003 \n1, 38 \np \nf \nr2 \nd.f. \n0.85 \n0.037 \n0.001 \n1, 38 \np \nf \nr2 \nd.f. \n<0.0001 \n21.84 \n0.37 \n1, 38 \np \nf \nr2 \nd.f. \n<0.0001 \n35.00 \n0.48 \n1, 38 \n   Lateral  \n   vestibular  \n   nucleus \np \nf \nr2 \nd.f. \n0.75 \n0.32 \n0.003 \n1, 38 \np \nf \nr2 \nd.f. \n0.86 \n0.03 \n0.001 \n1, 38 \np \nf \nr2 \nd.f. \n0.0002 \n16.49 \n0.30 \n1, 38 \np \nf \nr2 \nd.f. \n<0.0001 \n35.18 \n0.48 \n1, 38 \n \nP values, f values, regression coefficients (r2) and degrees of freedom (d.f.) are given for each \ncorrelation.  Significant f values indicate that the two structures in question have shown highly \ncorrelated change over evolution after the effects of evolutionary change in the rest of the brain \nhas been removed. \n"}