{"doi":"10.1017\/S0020589300064733","coreId":"202623","oai":"oai:eprints.lse.ac.uk:7404","identifiers":["oai:eprints.lse.ac.uk:7404","10.1017\/S0020589300064733"],"title":"The legality of NATO's action in the former republic of Yugoslavia (FRY) under international law","authors":["Chinkin, Christine"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/202623.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/7404\/1\/The%20legality%20of%20NATO%27s%20action%20in%20the%20former%20republic%20of%20Yugoslavia%20%28FRY%29%20under%20international%20law%28lsero%29.pdf","pdfHashValue":"900e9a7d8ffad558b0c36f7d209d35eb093c40fd","publisher":"Cambridge University Press for the British Institute of International and Comparative Law","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:7404<\/identifier><datestamp>\n      2012-08-23T13:42:29Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3139<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4C4C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/7404\/<\/dc:relation><dc:title>\n        The legality of NATO's action in the former republic of Yugoslavia (FRY) under international law<\/dc:title><dc:creator>\n        Chinkin, Christine<\/dc:creator><dc:subject>\n        JX International law<\/dc:subject><dc:publisher>\n        Cambridge University Press for the British Institute of International and Comparative Law<\/dc:publisher><dc:date>\n        2000-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/7404\/1\/The%20legality%20of%20NATO%27s%20action%20in%20the%20former%20republic%20of%20Yugoslavia%20%28FRY%29%20under%20international%20law%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Chinkin, Christine  (2000) The legality of NATO's action in the former republic of Yugoslavia (FRY) under international law.  International and Comparative Law Quarterly, 49 (4).  pp. 910-925.  ISSN 0020-5893     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=ILQ<\/dc:relation><dc:relation>\n        10.1017\/S0020589300064733<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/7404\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=ILQ","10.1017\/S0020589300064733"],"year":2000,"topics":["JX International law"],"subject":["Article","PeerReviewed"],"fullText":"  \nChristine Chinkin \n The legality of NATO's action in the former \nrepublic of Yugoslavia (FRY) under \ninternational law \n \nArticle (Published version) \n(Refereed) \n Original citation: \nChinkin, Christine (2000) The legality of NATO's action in the former republic of Yugoslavia \n(FRY) under international law. International & comparative law quarterly, 49 (4). pp. 910-925. \nISSN 0020-5893  \nDOI: 10.1017\/S0020589300064733 \n \n© 2000 British Institute of International and Comparative Law \n  \nThis version available at: http:\/\/eprints.lse.ac.uk\/7404\/ \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n910 International and Comparative Law Quarterly [VOL. 49\n\"negotiations\" of the issues (presented by NATO) were not normal negotiations\nbut were conducted under the threat of massive use of force. It is positively\nOrwellian for Lord Robertson to speak of \"negotiations\".\n27. The modalities of the operations against Yugoslavia are substantially\nincompatible with humanitarian intervention. I refer to the use of very powerful\nmodern weapons in urban areas, the offensive generally against the economy of a\nwhole country, and the use of cluster bombs. Many civilians were killed or\nmaimed, hospitals were damaged and internal refugee flows induced. Moreover,\nduring the bombing the declared purpose of the operations was to induce the\npopulation to overthrow the lawful government of Yugoslavia.\n28. One of the difficulties attending the legal evaluation of the military\noperations is the substantial doubt about the real purpose of the war. Even if\nhumanitarian intervention were lawful, it is difficult to see the NATO attack (or\nits aftermath) as a genuine example (on the facts) of such action.\nIAN BROWNUE, CBE, QC\nand CJ. APPERLEY, LLM\nT H E LEGALITY OF NATO'S ACTION IN THE FORMER\nREPUBLIC OF YUGOSLAVIA (FRY) U N D E R\nINTERNATIONAL LAW\nI. INTRODUCTION\nTHE use of force has been prohibited in international relations since at least the\nUnited Nations Charter, 1945. Article 2 (4) of the Charter states:\nAll members shall refrain in their international relations from the threat or use of\nforce against the territorial integrity or political independence of any state, or in any\nother manner inconsistent with the United Nations.\nThis principle is accepted customary international law and regarded as a\nperemptory norm of international law (jus cogens) by many authors. Operation\nAllied Force, as an undoubted use of force against the territory of another State, is\naccordingly contrary to international law unless it either:\n(i) comes within the terms of an exception to the prohibition against force;\nor\n(ii) can be justified under customary international law that has evolved\nindependently of, and consistently with, the Charter.\nThis paper will consider first the legality of Operation Allied Force under the UN\nCharter and secondly the position under customary international law. The legal\nanalysis is complex and this paper does not purport to be comprehensive. Rather\nit raises some of the many arguments that might be made.\nA. The Law of the UN Charter\nThe Charter recognises three exceptions to the prohibition against the use of\nforce: self-defence; enforcement action under Chapter VII; and enforcement\naction by regional arrangements under Chapter VIII.\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 911\n1. Individual or Collective Self-defence\nUN Charter, article 51, preserves the inherent right of self-defence \"if an armed\nattack occurs against a Member of the United Nations ...\" No NATO Member\nState had suffered any \"armed attack\", nor was under any threat of attack.\nSelf-defence could only be justified in terms of the collective self-defence of\nKosovo. However the right to self-defence under both the UN Charter and\ncustomary international law appertains to States, not to sub-State entities. Since\nKosovo is not a State the right to self-defence under article 51 is inapplicable.\n2. Chapter VII Action\nUN Charter, Article 24 gives the Security Council the \"primary\" (not exclusive)\nresponsibility for the maintenance of international peace and security. The UN\ncollective security arrangements are provided for in Chapter VII. The UN\nCharter, Article 39 provides for the Security Council to determine the existence of\na threat to the peace, breach of the peace or act of aggression and then to \"make\nrecommendations, or decide what measures shall be taken in accordance with\nArticle 41 and 42 ...\". Article 42 authorises the Security Council \"to take such\naction by air, sea or land forces as may be necessary to maintain or restore\ninternational peace and security\". There may still be arguments about the legal\nbasis of Security Council authorisation in the absence of armed forces agreements\nunder Article 43. However in the case of Kosovo there was no Security Council\nauthorisation.\n2.1. NATO's Action Received No Prior Security Council Authorisation\nIn Security Council Resolution 1160, 31 March 1998 the Security Council acted\nunder Chapter Vll to impose an arms embargo on the FRY in accordance with\nArticle 41. It therefore understood the situation to constitute a threat to\ninternational peace and security. It called upon all States to \"act strictly in\nconformity with this resolution\".\nThe Security Council allocated no broad or specific competence for the\nimplementation of this resolution, as it did for example in the Beria Resolution\nwhen the United Kingdom was authorised to enforce the sanctions imposed upon\nSouthern Rhodesia.1\nIn Security Council Resolution 1203,24 October 1998 specific obligations were\ndirected towards the Kosovo Albanian leadership: to comply with all relevant\nresolutions; to condemn terrorist actions; and to pursue its goals by peaceful\nmeans only. It also made demands of the Yugoslav Government: compliance with\nall relevant resolutions; full implementation of the Agreements of 15 October\n1998 between itself and NATO; compliance with the OSCE Verification Mission\nand the NATO Air Verification Mission over Kosovo; and to be mindful of its\nprimary responsibility for the safety and security of all diplomatic personnel and\nfor the safe return of refugees and displaced persons.\nOther States were only urged to provide personnel for the OSCE Verification\nMission and resources for humanitarian assistance. It can be argued that the\n1. SC Resolution 217,20 Nov. 1965.\n912 International and Comparative Law Quarterly [VOL. 49\nresolution envisaged the possibility of the use of force in its endorsement of\nNATO and OSCE agreements with Belgrade for the deployment of verifiers\nwithin Kosovo and its affirmation in paragraph 9 that \"in the event of an\nemergency, action may be needed to ensure their safety and freedom of\nmovement.\"\nThis wording, however, assumes the use of force only for a specific and limited\nreason—the protection of the Verification Mission. It cannot be construed as a\nbroader authorisation of force. In the event, the Verification Mission left Kosovo\nimmediately before the commencement of Operation Allied Force so concern for\nits safety did not figure in the decision to use force.\nThe Security Council resolved in Resolution 1199, 23 September 1998 \"to\nconsider further action and additional measures to maintain or restore peace and\nstability in the region\" in the event of noncompliance. In Resolution 1203 a month\nlater it decided only \"to remain seized of the matter\". In the event the possibility\nof the use of the veto by the Russian Federation meant that no further Security\nCouncil action was authorised.\n2.2. Authorisation Cannot Be Implied From Omission\nIt is becoming commonplace to argue that omissions by the Security Council to\nauthorise certain actions are \"as good as\" positive votes. Such justifications have\nbeen given for example for the bombing of Iraq in December 1998 and for the use\nof force to maintain air lanes over Iraq. In this context the response to a question\nin the United Kingdom Parliament about the legality of the use of force in\nresponse to noncompliance with Security Council Resolution 949, 15 October\n1994 is informative. In that resolution, acting under Chapter VII of the UN\nCharter, the Security Council demanded that Iraq not deploy military units to the\nSouth of Iraq. When asked whether the use of force without any further Security\nCouncil resolution would be justified if Iraq were to deploy troops to the South,\nthe government spokesperson in the House of Lords replied that it would not.2 On\nthe other hand, at the time of the bombing of Iraq in December 1998 for\nnoncompliance with UNSCOM, the government considered the use of force to be\nlegal, despite no specific authorisation for the use of force for this purpose in a\nstring of resolutions dating back to the ceasefire resolution, 687, 3 April 1991.\nIt has been suggested, for example by Professor R. Wedgewood, that the lack of\na vote in the Security Council prior to the onset of Operation Allied Force can be\nread as tacit approval.3 Professor Wedgewood has further argued that account\nshould be taken of informal statements from \"a high-ranking Russian official with\nsenior foreign policy responsibilities\" that some use of force against the FRY\nwould not be unuseful. This is an argument that international law should give\nweight to the \"back-channel communications of states\".\nThe argument that omission is an implied authorisation is flawed. Article 27 of\nthe Charter lays down the Security Council voting procedure and 27(3) provides\nfor the veto for non-procedural matters. It cannot simply be discounted in favour\n2. HL Debs, 561, WA, 6 Feb. 1995.\n3. R. Wedgewood, \"Kosovo and the Law of Humanitarian Intervention\", 93 A J.I.L. 828\n(1999).\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 913\nof \"off the record\" remarks by officials. This would fuse diplomacy and law and\nundermine consistency and certainty in the application of the Charter. It would\nalso inhibit open and frank discussion in negotiations for fear that statements\nwould be taken as authoritative of a State's position in preference over its forma]\nvote in the Council. Since, in the case of Kosovo, no such vote was ever taken,\nthere can only be speculation as to how States would in fact have voted over what\nspecific proposals. Speculation cannot be a basis for legal authorisation and what\nremains clear is that the Security Council did not authorise the use of force against\nthe FRY in March 1999.\n2.3. The Action Has Been Endorsed Ex Post Facto\nThis argument is discussed below in the context of regional enforcement.\n3. Regional Enforcement under Chapter VIII\n3.1. Requirement for Security Council Authorisation\nHowever the action against the FRY was not unilateral but the joint action of a\ncollective self-defence organisation, NATO.\nChapter VIII of the UN Charter provides for regional enforcement.\nArticle 53 states:\nThe Security Council shall, where appropriate, utilize such regional arrangements or\nagencies for enforcement action under its authority. But no enforcement action shall\nbe taken under regional arrangements or by regional agencies without the\nauthorization of the Security Council...\nIt has been suggested that ex post facto authorisation (or ratification) of the\nenforcement action of a regional agency is sufficient, for example in the context of\nthe OAS blockade of Cuba in 1963. However the literal wording of Article 53 is\nunambiguous: no enforcement action shall be taken without authorisation by the\nSecurity Council. Article 31 of the Vienna Convention on the Law of Treaties,\n1969 requires that words be given their literal meaning and Article 53 does not\nseem open to any other interpretation. Further, the purpose of Article 53 is that\nthe Security Council should retain control over situations requiring enforcement\naction. The meaning of enforcement action has also been controversial, but there\nis little doubt that Operation Allied Force comes within it.\n3.2. NATO and Subsequent Practice under Article 53\nNevertheless it has also been suggested that Article 53 has been made more\nflexible through subsequent practice and by tacit acquiescence in this practice by\nthe Security Council.\nThe UN has neither the resources nor the capability to resolve all issues that\narise and increasingly has looked to regional bodies for assistance. Accordingly in\nan Agenda for Peace, 1992 and its 1995 Supplement, former Secretary-General\nBoutros Boutros-Ghali urged the development of complementary and coherent\nstrategies between regional and global organisations.\nThis was done in the conflicts surrounding the dissolution of the former\nYugoslavia, notably in Bosnia-Herzegovina where the Security Council used\nNATO, a collective defence organisation, for humanitarian purposes.\n914 International and Comparative Law Quarterly [VOL. 49\nFor example, SC Resolution 770,13 August 1992 called upon States to take\nnationally or through regional agencies . . . \"all measures necessary to facilitate\nand co-ordinate with the United Nations . . . humanitarian assistance.\"\nSimilaily, pursuant to SC Resolution 816, 31 March 1993 the Security Council\nauthorised \"Member States acting nationally or through regional organizations to\nenforce no-fly zones over Bosnia.\" NATO carried out this function.\nIt is worth noticing that these events assumed NATO to be a regional agency or\narrangement within the terms of UN Charter, Chapter VIII, although these terms\nare also open to various interpretations. Further, NATO used force for\nhumanitarian ends in a non-Member State (Bosnia-Herzegovina) on the basis of\nthese resolutions despite article 5 of the North Atlantic Treaty, 1949, which\nprovides for the use of force only in collective self-defence of its members.\nThus there has been adaptation of NATO's competence, as defined by its\nconstituent treaty, through Security Council resolutions. It does not follow from\nthis, however, that it can use force on humanitarian grounds without such\nauthorisation.\n3.3. Article 53 and Operation Allied Force\nThese two interlocking arguments—that ex post facto ratification by the Security\nCouncil is sufficient authorisation and that the Security Council has through its\npractice accorded regional arrangements greater flexibility in enforcement\naction—can be applied to Operation Allied Force. It can be argued that the\nNATO action with respect to the FRY was implicitly endorsed by the Security\nCouncil through Security Council Resolution 1203, 24 October 1998 and\nsubsequently endorsed by its failure to condemn the bombing campaign and by\nthe adoption of Security Council Resolution 1244,10 June 1999, after the end of\nthe bombing campaign.\nFirst, Security Council Resolution 1203, 24 October 1998 endorsed and\nsupported the agreements signed in Belgrade on 15 and 16 October 1998\n(between the FRY and the OSCE and NATO respectively) after NATO had\nindicated that force might be required against the FRY. If the Council had\nconsidered inappropriate the indication (threat) that force might be used (and\nUN Charter, Article 2(4) applies to the threat, as well as the use, of force), it is\nunlikely that it would have supported the terms of the agreements.\nSecond, a draft resolution proposed by the Russian Federation, Belarus and\nIndia on 26 March 1999 condemning the bombing as violating UN Charter\nArticles 2(4), 24 and 53 was rejected by a vote of 12-3. This might be taken as tacit\napproval.\nThird, Security Council Resolution 1244,10 June 1999 adopted in its Annex 2\nthe Agreement on the Principles to move towards a Resolution of the Kosovo\nCrisis (the Peace Plan), authorised the international security presence in Kosovo\nto exercise \"all necessary means\" to fulfil its responsibilities and entrusted the\nSecretary-General with organising a parallel international civil presence there.\nAn argument can be made that the Security Council would not have endorsed the\nPeace Plan if it was condemning the action that led to it, and thus that Resolution\n1244 can be read as bestowing subsequent approval (authorisation) upon\nOperation Allied Force.\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 915\nThe previous occasion that most closely resembles this situation is the\nintervention by ECOWAS through its enforcement arm, ECOMOG, in Liberia in\n1990-2. ECOMOG intervened in the civil war in Liberia without Security Council\nauthorisation. Its action was at first primarily humanitarian but it subsequently\nentered into more offensive action, more appropriately seen as enforcement\naction. ECOMOG is the military force of a regional economic organisation.\nUnder the Protocol Relating to Mutual Assistance on Defense, 1981 it was\nenvisaged that ECOMOG might be called upon to act \"in cases of armed conflict\nbetween two or more members\". It was not envisaged that it would intervene in\ninternal conflict in its own Member States (as was the case in Liberia and\nsubsequently Sierra Leone). Thus ECOMOG (like NATO) intervened in an\ninternal situation and outside the terms of its own constituent Treaty,4 but unlike\nNATO intervened only within Member States.\nIn Security Council Resolution 788,19 November 1992 the Security Council, in\noperative paragraph 1 (that is not just in the Preamble), \"commend[ed]\nECOWAS for its efforts to restore peace security and stability in Liberia\". It also\ncondemned armed attacks against ECOWAS forces (which it termed peacekeep-\ning forces). The Security Council reiterated its commendation of ECOWAS in\nResolution 856, 10 August 1993 when it authorised military observers to go to\nLiberia prior to the establishment of UNOMIL.\nThe importance of these resolutions is that they suggest a change of Security\nCouncil practice whereby subsequent authorisation might suffice. However, in\nSecurity Council Resolutions 788 and 856, ECOWAS is commended by name. In\ncontrast, Security Council Resolution 1244 welcomes the general principles with\nrespect to the settlement of the political crisis in Kosovo, but nowhere refers\ndirectly to NATO, or its enforcement action. Further, unlike Security Council\nResolution 1203 which \"endorses and supports\" the October 1998 Agreements\nbetween NATO and the FRY, Security Council Resolution 1244 welcomes the\nPeace Plan in the preamble but only \"decides that a political solution to the\nKosovo crisis shall be based on [its] general principles\" in the operative\nparagraph. This language accepts the status quo without explicitly endorsing the\naction.\nEven if the argument that retroactive authorisation of enforcement action by\nregional agencies is sufficient compliance with UN Charter, Article 53 is accepted,\nthe case for asserting that this occurred in Security Council Resolution 1244 is\nweak. It is only through implication; there is no explicit commendation as\noccurred with ECOWAS.\nThe Security Council's attitude with respect to Operation Allied Force has\nbeen one of sitting on the sidelines, neither rejecting nor approving the action that\nwas unfolding without its participation.\nArguments for the legality of NATO's actions in the FRY are strengthened by\ntaking all these actions together: the Security Council recognised the situation in\nKosovo as warranting Chapter VII action; it imposed those measures upon which\nit could secure agreement; prior to the bombing it affirmed the on-going actions of\n4. See further See V. Nanda et al., \"Tragedies in Somalia, Yugoslavia, Haiti, Rwanda and\nLiberia—Revisiting the Validity of Humanitarian Intervention under International Law—\nPart II\", 26 Denver Journal of International Law 827 (1998).\n916 International and Comparative Law Quarterly [VOL. 49\nvarious European organisations, the EU, the OSCE and NATO, that did not\ninvolve the use of force; when it could take no stronger measures itself it did not\ncondemn the regional agency that did so act; and subsequent to the action it made\nits decisions on the basis of the political agreement that had been reached. These\nactions imply some approval but they do not substitute for the fact that there was\nno prior authorisation of the action. The plain words of Article 53 were\ndiscounted.\nIt seems that there has been a creeping evolution with respect to both the\nSecurity Council and NATO. The former has extended Chapter VII by using it to\nauthorise humanitarian assistance and then calling upon regional agencies or\narrangements to provide the necessary forces to secure its delivery, thus moving\ncloser to intervention on humanitarian grounds. The latter, an organisation\nestablished for collective self-defence, has undertaken collective humanitarian\nintervention with, and subsequently without, Security Council authorisation. At\neach stage the interpretation of the Charter and the North Atlantic Treaty has\nbeen further extended, until the actions fall outside the terms of both.\nB. Customary International Law: Humanitarian Intervention\nIf the legality of Operation Allied Force cannot be based on the UN Charter, it\nmight nevertheless be legal under customary international law that has developed\nalongside and consistently with the Charter. The most obvious contender is the\nso-called doctrine of humanitarian intervention. The use of force against the FRY\nwas described by a United Kingdom representative as \"directed exclusively to\naverting a humanitarian catastrophe\".3 Many similar statements from the leaders\nof other NATO States can be found.\nThe doctrine of humanitarian intervention has been asserted by a number of\nwriters as allowing intervention, including the use of force on the territory of\nanother State, for protection against gross violations of human rights committed\nagainst that State's own citizens.' (Where intervention is to protect a State's own\ncitizens it is more properly considered as an aspect of self-defence.)\nI. Is The Doctrine of Humanitarian Intervention Applicable in International\nLaw?\nIn the 19th century there were a number of incidents of intervention by States\neither to rescue their own nationals, or those of other States, from actual or\nthreatened harm on the territory of another State. Such incidents have no\n5. UK Permanent Representative in the Security Council, 24 March 1999, cited Legality\nof the Use of Force (Yugoslavia v. UK) Oral Pleadings, ICJ Doc. CR\/99\/23, para. 7,11 May\n1999.\n6. For a selection of the opposing views on international law in this area see R. Lillich ed.,\nHumanitarian Intervention and the United Nations (1973); M. Bazlyer, \"Re-examining the\ndoctrine of humanitarian intervention in light of the atrocities in Kampuchea and Ethiopia\",\n23 Stanford Journal of International Law (1987) 547; M. Walzer, Just and Unjust Wars: A\nMoral Argument with Historical Illustrations (New York, Basic Books, 2nd ed. 1992);\nS. Simon, \"Contemporary legality of unilateral humanitarian intervention\", 24 California\nWestern International Law Journal (1993) 117; S. Murphy, Humanitarian Intervention: The\nUnited Nations in an Evolving World Order (1996); N. Ronzitti, Rescuing Nationals Abroad\nthrough Military Coercion and Intervention on Grounds of Humanity (1985).\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 917\nprecedent effect today because of the colonial environment in which they took\nplace and the changed regime with respect to the use of force established by the\nUN Charter.\nThe UN Charter establishes a legal regime based upon the sovereign equality of\nStates (Article 2(1)), the obligation to settle disputes peacefully (Article 2(3)), the\nprohibition of the use of force (Article 2(4)), and non-intervention into the\ndomestic jurisdiction of States (Article 2(7)). All these foundational principles\nwere reiterated in the Declaration on Principles of International Law Concerning\nFriendly Relations and Cooperation among States in Accordance with the\nCharter of the United Nations.7 Any intervention into another State, even upon\nhumanitarian grounds, is incompatible with these principles and as such contrary\nto the Charter.\nTwo interlocking arguments against this view have been advanced:\n1.1. Humanitarian intervention is consistent with the terms of the Charter\nThere are two schools of thought with respect to Article 2(4). The view that\nprobably remains dominant is that it is a comprehensive exclusion of the use of\nforce in international relations and that the clause \"against the territorial integrity\nor political independence of any State, or in any other manner inconsistent with\nthe purposes of the United Nations\" amplifies the totality of States' rights. The\nother view is that this clause limits the prohibition against the use of force. The\nonly force that is prohibited is that that is contrary to the territorial integrity or\npolitical independence of any State, or the purposes of the United Nations.\nAccordingly if the force does not come within these categories it is legal.\nThe U.K. argued the second position in the Corfu Channel Case} It asserted\nthat its actions in sweeping the Corfu Channel for mines was not against the\nterritorial integrity or political independence of Albania. It was solely to protect\nnavigation and to collect evidence of the existence of mines there. The\nInternational Court of Justice found the U.K. to have acted contrary to\ninternational law. However the argument for intervention is stronger in the\ncontext of human rights. The maintenance of international peace and security is\nnot the only purpose of the United Nations. Article 1(3) states as another purpose\nof the Organisation:\nTo achieve international co-operation in solving international problems of an\neconomic, social, cultural or humanitarian character, and in promoting and\nencouraging respect for human rights and for fundamental freedoms ...\nFurther, Article 56 states:\nAll members pledge themselves to take joint and separate action in co-operation\nwith the Organization for the achievement of the purposes set forth in Article 55.\nArticle 55(c) spells out in more detail the purposes of Article 1(3):\nuniversal respect for, and observance of, human rights and fundamental freedoms for\nall without distinction as to race, sex, language or religion.\n7. GA Res. 2625 (XXV), 24 October 1970.\n8. {UK v. Albania) 1949 ICJ Rep. (Judgment of 9 April 1949).\n918 International and Comparative Law Quarterly [VOL. 49\nIt can be argued that where the force is aimed solely at the protection of human\nrights it does not threaten the political independence and territorial integrity of\nany State and is entirely consistent with the purposes of the UN Charter. Further,\nthe domestic jurisdiction exclusion, UN Charter, Article 2(7) has not been\nallowed to interfere with the growth of the human rights regime and the\nunderstanding that how a State treats its own citizens is not shielded from\ninternational scrutiny. States parties to the International Covenant on Civil and\nPolitical Rights 1966 have undertaken to \"respect and ensure\" the rights within\ntheir own territories. Under the Preamble they also recognise that the rights \"can\nonly be achieved if conditions are created whereby everyone may enjoy his civil\nand political rights, as well as his economic, social and cultural rights\". It is not\nsuch a large step to make this a more general obligation to ensure human rights\nwithin other territories as well, an obligation that can also be read into the pledge\nto take \"joint action\" in UN Charter, Article 56. From these instruments the case\ncan be made that the use of force in defence of human rights in extreme cases is\nnot contrary to the UN Charter, falls within its purposes and is certainly morally\njustified. On the other hand, it must also be acknowledged that the structure of the\nUN Charter gives priority to State sovereignty.\n1.2. Humanitarian Intervention is a Principle of Customary International Law\nThe other interlocking argument supporting a doctrine of intervention justified\non humanitarian grounds is that there is sufficient uniform and consistent State\npractice, accompanied by the required opinio juris (belief in the existence of the\nlaw), to establish the principle as a customary international law exception to the\nUN Charter.\nState practice has to be considered according to whether or not an instance of\nintervention was authorised by the Security Council. In the post-cold war era\nwhen the use or threat of veto has been lessened, the Security Council has\nauthorised intervention on humanitarian grounds under Chapter VII of the\nCharter without the consent of the State in question. In 1991 with respect to the\nsituation of the Kurds at the end of the Gulf War, Security Council Resolution\n688, S April 1991 insisted that Iraq allow access by international humanitarian\norganisations and appealed to all Member States \"to contribute to these\nhumanitarian relief efforts\". This paved the way for the Security Council to\nauthorise intervention on humanitarian grounds, which it did in the case of\nSomalia. Security Council Resolution, 794, 3 December 1992 determined the\nhumanitarian situation to be a threat to international peace and security and\nauthorised the use of \"all necessary means\" to establish a \"secure environment for\nhumanitarian relief operations\". This resolution was ground-breaking in two\nways: the assertion that a humanitarian crisis had implications for international\npeace and security and thus warranted Security Council intervention and the fact\nthat no consent was given by Somalia.\nSince Somalia, humanitarian assistance backed by military force has been\nauthorised in Bosnia and Rwanda. It can be confidently asserted that Security\nCouncil practice has extended the concept of what constitutes a threat to\ninternational peace and security, and thus the conditions for intervention, to cover\nhumanitarian catastrophes. The legitimate use of force in such situations has\nremained controversial. The resolutions have authorised \"all necessary means\" to\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 919\nensure the delivery of humanitarian assistance but not to assist any warring side in\nan internal conflict. Force was therefore initially limited to actions in self-defence,\nbut this position has been undermined by the use of force to protect no-fly zones in\nBosnia as described above, and the NATO bombing of Bosnian Serb positions,\nfor example in August 1995.\nHowever the fact that the Security Council has authorised, intervention on\nhumanitarian grounds under Chapter VII does not automatically legitimate such\naction without authorisation. The customary international law requirement of\nopinio juris cannot be deduced from the actions of States that are authorised by\nthe Council. It is necessary to consider unauthorised interventions and here the\npicture is less clear. The most commonly cited examples are the intervention of\nIndia into Pakistan in 1971 for the protection of the Bengalis, which led to the\ncreation of the State of Bangladesh; the intervention of Tanzania in 1979 that\ncaused the overthrow of Idi Amin in Uganda; and that of Vietnam which\nterminated the murderous regime of the Khmer Rouge in Cambodia. However in\nall three cases the States in question did not claim the right to humanitarian\nintervention, but rather that of self-defence in that there had been border\ninvasions and other acts or threats of force committed against them. In addition,\nthe response of the international community was equivocal. Bangladesh was\nrecognised as an independent State and admitted to the United Nations but the\nHeng Samrin regime in Cambodia was not accorded recognition in the West, nor\nwas it allowed to represent Cambodia in the UN.\nIn other situations where humanitarian intervention might have been appli-\ncable, other legal justifications for the action were also argued by the protagonists.\nThese include: rescue of a state's own nationals (U.S. action in Grenada in 1983;\nIsraeli action in Entebbe in 1976; U.S. attempt to rescue the hostages held in\nTehran in 1980); invitation from the legitimate government (U.S. action in\nGrenada in 1983 and Panama in 1989; USSR action in Afghanistan); restoration\nof democracy (U.S. action in Grenada in 1983 and Panama in 1989).\nIn each of these instances the response of the international community was at\nbest equivocal and there were condemnatory resolutions in the General\nAssembly. They also of course reflect the cold war divisions of their day.\nIt should also be remembered that in the context of Korea the General\nAssembly recommended the use of force under the Uniting for Peace Resolution\nwhen the Security Council was unable to continue its authorisation because of the\nSoviet veto. In the Certain Expenses of the United Nations Opinion9 the ICJ\nconsidered the costs to be legitimate expenses of the UN provided the action was\nwithin the overall purposes of the UN. On the one hand this shows that the\nSecurity Council has only primary (as opposed to exclusive) responsibility for the\nmaintenance of international peace and security, on the other that there remains a\npreference for some form of UN response. The General Assembly has not\nrecommended a similar intervention on humanitarian grounds (although it has\nrecommended humanitarian assistance).\nIn what is perhaps the fullest defence of humanitarian intervention, Fernando\nTeson has justified it by reference to the sovereignty and security of peoples.10\n9.1962 ICJ Rep. (Adv.Op. 20 July 1962).\n10. F. Tes6n, Humanitarian Intervention: An Inquiry into Law and Morality 2nd ed. 1997.\n920 International and Comparative Law Quarterly [VOL. 49\nTcs6n considers that the ultimate justification for the continuation of the State is\nthe protection of the natural rights of its citizens. A government violating those\nrights forfeits domestic and international legitimacy, and foreign intervention to\nsuppress government abuse is justified. Other writers have been less clear about\nthe legality of humanitarian intervention but consider it a form of \"international\ncivil disobedience\". Tes6n's view may receive some support from the Copenh-\nagen Document of the Conference on the Human Dimension of the CSCE (as it\nthen was), 29 June 1990, although it is not a legally binding instrument.\nArticle 1 of the Copenhagen Document expresses the commitment of the\nparticipating States to the protection of human rights and fundamental freedoms\nas a \"basic purpose of government\". Article 6 asserts that the \"will of the people\nfreely and fairly expressed . . . is the basis of authority and legitimacy of the\ngovernment.\" The Document goes on to recognise the responsibility of the\nparticipating States to defend and protect, in accordance with their laws, their\ninternational human rights obligations and their international commitments, and\nalso in Article 11 recognises the importance of remedies. Article 11.2 recognises\nthe \"right of the individual to seek and receive assistance from others in defending\nhuman rights\".\nIt could be argued that the individuals of Kosovo did just this and that the\nNATO States responded by giving assistance. However article 37 states firmly\nthat none of these commitments may be interpreted as implying any right to\nengage in any activity contrary to the UN Charter, including the territorial\nintegrity of States.\nI do not think that State practice is sufficient to conclude definitively that the\nright to use force for humanitarian reasons has become part of customary\ninternational law. I would submit that the most that can be asserted is that there is\nan emerging concept of humanitarian intervention based upon the purposes of the\nCharter, the growing commitment to the active protection of human rights and\nlimited State practice. The exception is genocide. Under the Genocide Conven-\ntion, 1948, article 1 States parties \"undertake to prevent and punish\" the crime of\ngenocide. As far as 1 am aware, this justification was not made for NATO's action.\n2. What are the Conditions for Humanitarian Intervention?\nThose in favour of a legal doctrine of unilateral humanitarian intervention have\nbeen concerned to emphasise its exceptional nature and the need for strict criteria\nfor its application. There is no authoritative decision on the criteria but among\nthose most commonly asserted are:\n(i) A gross violation of human rights occurring in the targeted State\nSince coercive intervention is prima facie illegal, circumstances purporting to\njustify it must be strictly construed. Accordingly the violations of human rights\nmust be of the most fundamental rights of the sort most frequently designated as\njus cogens (e.g. right to life; right to be free from torture; right not to be subject to\ngenocide). It is controversial whether economic and social rights can be included\nbut systematic denial of food (as in Somalia) would appear to do so. Perhaps a\ngood guide would be to consider whether those denials of human rights that\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 921\nconstitute crimes against humanity under the Rome Statute for an International\nCriminal Court, 1998 would warrant intervention. Concern about political\nsecurity and the instability of a regime do not warrant intervention on\nhumanitarian grounds.\n(ii) The UN is unable or unwilling to act\nThe primary responsibility of the Security Council for the maintenance of\ninternational peace and security under UN Charter, article 24 gives a priority to\nSecurity Council action. While the Security Council's mandate is not explicitly\ndirected at human rights, it has extended its Chapter VII powers to such situations\n(Somalia, Bosnia) and such authorised intervention is clearly legal. However if\nthe UN is unwilling or unable to authorise action, there is a moral imperative for\nsome other body to act in its place, preferably through collective action, and such\naction should not be deemed illegal.\n(iii) An overwhelming necessity to act\nThe objective is to prevent, or put an end to, gross human rights abuses when there\nis no longer any expectation that the domestic authorities will do this, the UN is\nunable or unwilling to act, all non-military options have been explored and there\nis some impartial and neutral evidence (for example a report from the\nInternational Committee of the Red Cross; reports from inter-governmental\norganisations such as the bodies of the Human Rights Commission, or regional\nhuman rights bodies; NGO human rights reports) that the humanitarian situation\ncan no longer be contained.\nThere is a dilemma between the need to wait until the intervention is necessary\naccording to some objective criteria, and the additional loss of lives likely as a\nresult of delay. This was most tragically demonstrated in Rwanda where early\nwarnings of the impending genocide were ignored. If the doctrine of humanitarian\nintervention is to have practical benefits, it seems likely that it will move into one\nof \"anticipatory humanitarian intervention\" (on an analogy with \"anticipatory\nself-defence\")\" This shows the very real tension between State sovereignty and\nhuman rights guarantees for a doctrine that is inherently difficult to formulate in a\nprecise and legal way. Yet since the doctrine is intended to operate as an\nexception to the prohibition on the use of force and against state sovereignty, it\nmust be strictly construed.\n(iv) The Intervention must be Proportionate\nThis relates to the means of intervention rather than the decision to intervene.\nThe 1949 Geneva Red Cross Conventions and the First 1977 Protocol Additional\nto the Geneva Conventions that provide the legal regime for the conduct of\ninternational armed conflict are applicable to all international armed conflict\nregardless of whether the use of force is justified by international law.\n11. J. Charney, \"Anticipatory Humanitarian Intervention in Kosovo\", 93 AJ.I.L. 834\n(1999).\n922 International and Comparative Law Quarterly [VOL. 49\n3. Were the Conditions Satisfied in the Case of Operation Allied Force?\nThere is little doubt that there were significant violations of human rights in\nKosovo. Security Council Resolution 1199,23 September 1998 refers to \"reports\nof increasing violations of human rights and of international humanitarian law\",\nthe Security Council's alarm at the \"impending humanitarian catastrophe\" and\nthe need to prevent its occurrence. Reports of massacres such as that in Racak in\nJanuary 1999 added to the picture of the commission of gross and widespread\nhuman rights abuses. The displacement of over 230,000 persons from their homes\nis also pointed to in Security Council Resolution 1199.\nWhat is less clear is whether the intervention was \"necessary\", whether all other\nmeans of preventing the continuing violations of human rights had been sought,\nand whether the intervention was limited to humanitarian objectives.\nHuman rights abuses had been reported in Kosovo for many years without\nforeign, armed intervention. While their cumulative effect was mounting it is not\nclear that there was a greater emergency in March 1999 than at other times. The\nprecipitating factors appear to have been the intensification of fighting between\nthe KLA and Serbian forces and the refusal of the FRY government to accept the\nterms of the Rambouillet Agreement. The insistence at Rambouillet on what\nwere termed \"non-negotiable principles\" and the threat of NATO force\nundermined that process as an attempt at a negotiated settlement. The\nwithdrawal of the OSCE Verification Mission after the failure of a negotiated\nsettlement removed a restraint upon abuses by Serbian forces, and violations\nintensified.\nIn addition, both the Rambouillet principles and the five principles initially\nasserted by NATO as the conditions for cessation of bombing show the problems\nof applying the doctrine of humanitarian intervention. At Rambouillet the\nterritorial integrity of the FRY and the self-government and guarantee of human\nrights of the people of Kosovo were both stressed. The role and participation of\nthe OSCE and other international bodies to ensure the latter undermine the\nformer. Similarly NATO stressed among its objectives an end to the killings by\nYugoslav army and police (an end to human rights violations) and the deployment\nof a NATO led international force. It may well be the case that long-term\nprotection of the civilian population could not be achieved without such\ncontinuing intervention. However such realities make the purported requirement\nof humanitarian intervention, that it be limited to humanitarian objectives,\nunworkable. It is hard to envisage a way to bring about a permanent end to human\nrights abuses of a sufficient gravity to warrant foreign intervention without some\nfar-reaching political settlement. This will inevitably undermine the political\nindependence of the targeted State.\nAerial air strikes are not effective for protecting people on the ground who aie\nlikely to suffer additional discrimination and abuse because of the bombing. In the\nshort term the action did not achieve its humanitarian goals and might be more\naccurately labelled reprisal or forcible countermeasures for prior illegal acts.\nThere is no exception to UN Charter, article 2(4) allowing for reprisals.12 In the\n12. Declaration on Principles of International Law Concerning Friendly Relations and\nCooperation among States in Accordance with the Charter of the United Nations, G A Res.\n2625 (XXV), 24 Oct. 1970.\nOCTOBER 2000] The Legality of NA TO's Action in Yugoslavia 923\nlong term, NATO's forcible intervention and subsequent peace building through\nKFOR may bring about that situation (although in April 2000 this is looking\nbleak). This highlights still another dilemma of humanitarian intervention: the\ntension between short term and long term consequences. The doctrine does not\ngive adequate guidance on this question.\nIt has been argued, for example by Professor Cassese, that the Geneva\nConventions and Protocol I constitute customary international law. It would be\npossible to go through the articles of the Geneva Conventions to determine the\nconformity of the NATO action with them, but that would be beyond the scope of\nthis survey of the law. However one of the over-riding principles of international\nhumanitarian law is the distinction between combatants and non-combatants.\nWhile NATO stressed its selection of military targets, it is arguable that the form\nof combat, high aerial bombing and the use of cluster bombs, were contrary to this\nbasic principle of humanitarian law.\nIn determining whether the action satisfies the requirement of proportionality,\ntwo other considerations are those of human rights and environmental law. In its\nadvisory opinion on The Legality of Nuclear Weapons,\" the International Court\nof Justice considered the relevance of each.\nThe Court opined that the International Covenant on Civil and Political Rights,\n1966 does not cease to be applicable in times of war (para. 25). All NATO\nmembers are parties to the ICCPR. Article 6 guarantees the right not to be\narbitrarily deprived of life. The Court considered that the determination of what\nconstitutes arbitrary deprivation of life must be determined by the lex specialis,\ninternational humanitarian law, which again warrants examination of the\nobservance of the distinction between combatant and non-combatant in the\ncampaign. It should be noted that the UN High Commissioner for Human Rights\nhas expressed concern about NATO's compliance with human rights law.\nFurther, the General Assembly and the UN Committee on Economic and Social\nRights have both emphasised the importance of complying with continuing\nhuman rights obligations in the context of unilateral economic measures. The\nGeneral Assembly has urged States to refrain from adopting or implementing\n\"any unilateral measures... impeding the full realization of the rights set forth in\nthe Universal Declaration of Human Rights\".14 The human rights of the civilian\npopulation include their right to an adequate standard of living under the\nInternational Covenant on Economic, Social and Cultural Rights, 1966, article 11,\nto which the U.K. (and other NATO members, but not the U.S.) is a party.13\nThe Legality of Nuclear Weapons advisory opinion is also relevant with respect\nto the environmental consequences of conflict. The Court considered that\nenvironmental considerations must be taken into account when assessing what is\nnecessary and proportionate action in pursuit of military objectives. It referred to\nthe General Assembly's Resolution On the Protection of the Environment in\nTimes of Armed Conflict,16 where the General Assembly stated that destruction\n13. JCJ Reports, 1996 (Adv. Op. 8 July 1996).\n14. GA Res. 53\/141,8 March 1999, Human Rights and unilateral coercive measures.\n15. The relationship between economic sanctions and respect for economic, social and\ncultural rights. General Comment 8 (E\/C. 12\/1997\/8), 5 Dec. 1997.\n16. GA Res. 47\/37, 25 Nov. 1992.\n924 International and Comparative Law Quarterly [VOL. 49\nof the environment not justified by military necessity and carried out wantonly is\nclearly contrary to customary international law. While NATO's action was not\n\"wanton\" the assessment of environmental damage against military necessity in a\ncampaign of this sort is less clear.\nI do not have access to objective data about either the human rights situation of\nYugoslav civilians or the environmental conditions in the FRY. It is to be noted\nthat the European Union has urged the provision of fuel for heating in areas\nwhere the opposition is in control in Yugoslavia indicating the shortage of and\nneed for such essentials. Environmental damage, notably to the Danube, is\ndisrupting communications and trade to third States. Such facts must be taken\ninto account in determining whether the action was necessary and proportionate.\nC. Summary of Conclusions\n1. The NATO bombing does not come within the exceptions to the prohibition\nagainst the use of force provided for by the UN Charter. It was neither\nindividual nor collective self-defence; it was not authorised by the Security\nCouncil in accordance with either Chapter VII (articles 39 and 42) or Chapter\nVIII (article 53).\n2. The doctrine of unilateral humanitarian intervention (that is without Security\nCouncil authorisation) remains controversial in customary international law.\nProponents of the doctrine assert that it is supported by Security Council\nauthorised intervention in Somalia, former Yugoslavia and Rwanda, as well\nas by unilateral action such as that by India (1971), Tanzania (1979) and\nVietnam (1979). Others argue that there is no unequivocal State practice and\nthat such a principle conflicts with those of sovereignty, non-intervention and\nUN Charter, Article 2(7). The Security Council has been inconsistent,\nalthough there has been a trend towards the authorisation of intervention on\nhumanitarian grounds and instances of what might be termed unilateral\n\"humanitarian intervention\" can be justified on other grounds, in particular\nself-defence. There is no authoritative opinion on this disputed area of\ninternational law, although it is clear that the doctrine has greater support\nthan, for example, a decade ago.\n3. If it is accepted that there is a right under international law to intervene with\nthe use of force in the territory of another State for the protection of human\nrights, it must be as an exception to the prohibition on the use of force and\nonly permissible under certain exceptional conditions: there must be a gross\nviolation of human rights occurring in the targeted State that the domestic\nState is unable or unwilling to alleviate; the UN must be unwilling or unable to\nact; the action must be limited to humanitarian purposes; there must be a\nnecessity for such action and the action must be proportionate to the\nhumanitarian objectives. There is a preference for collective action.\n4. It is not clear that the NATO action satisfied these stringent conditions.\n5. Even if the use of force is found to be legal, the obligations of the laws of war\nand human rights remain. The Geneva Conventions on the Laws of War, 1949\nand the First 1977 Protocol distinguish between combatants and non-\nOCTOBER 2000] The Legality of NATO's Action in Yugoslavia 925\ncombatants. While it is not suggested that military targets were not pursued,\nmaintenance of this legal distinction is difficult to reconcile with cluster\nbombing from a considerable height and the foreseeable continued civilian\ncasualties from unexploded bombs.\n6. The General Assembly and the UN Committee on Economic and Social\nRights have both emphasised the importance of continuing human rights\nobligations in the context of unilateral measures. These include the rights of\nthe civilian population of the FRY to an adequate standard of living under the\nInternational Covenant on Economic, Social and Cultural Rights, 1966,\nArticle 11, to which the U.K. (and other NATO members, but not the U.S.) is\na party.\n7. Reprisals or forcible countermeasures are not permissible under inter-\nnational law.\n8. It must be remembered that NATO's action, as State practice, will itself\ncontribute to the affirmation of international law and thought must therefore\nbe given to the precedent effect of the action.\n9. While Operation Allied Command does not fall directly under any of the\ndoctrines of international law permitting the use of force, the cumulative\neffect of the arguments may be thought to be persuasive. The Security\nCouncil was aware of the action and did not condemn it; humanitarian\nconsiderations were important and the subsequent Peace Plan has been made\noperational with Security Council authorisation. I can see the force of the\narguments that led Professor Simma to conclude that the NATO actions fall\non the right side of the \"thin red line\" that divides legality from illegality.17 In\nthis view the actions have a legitimacy, if not strict legality under international\nlaw. However I do not consider that the accumulative effect is to bestow\nlegality and conclude that there must be considerable doubt as to whether the\nbasis for military intervention in the FRY was sufficient. What is clear is that\nthe NATO intervention is leading international law into new areas. As a\nmatter of policy, broadening the parameters for the international use of force\nwithout articulation by the constitutionally authoritative body further\nweakens the prohibition on the use of force and the authority of the Charter.\nThe aftermath in Kosovo also emphasises the need for full, prior consider-\nation to be given to peace-building and reconstruction.\n10. The veto is part of the UN Charter and currently there is no requirement upon\nthe permanent members to give reasons for their use, or anticipated use of the\nveto power.\" This is a matter for Security Council reform, which is an\non-going question upon which Her Majesty's government has expressed its\nviews.\nCHRISTINE CHINKJN*\n17. B. Simma, \"NATO, the UN and the Use of Force: Legal Aspects\", 10 European\nJournal of International Law 1 (1999).\n18. See L. Henkin, \"Kosovo and the Law of Humanitarian Intervention\", 93 AJIL 824\n(1999).\n• Professor of International Law, London School of Economics and Political Science,\nOctober 1999.\n"}