{"doi":"10.1063\/1.3662133","coreId":"197782","oai":"oai:lra.le.ac.uk:2381\/10038","identifiers":["oai:lra.le.ac.uk:2381\/10038","10.1063\/1.3662133"],"title":"The instability of the boundary layer over a disk rotating in an enforced axial flow","authors":["Hussain, Z.","Garrett, Stephen J.","Stephen, S.O."],"enrichments":{"references":[{"id":43731145,"title":"33Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables, edited","authors":[],"date":"1972","doi":"10.1090\/s0025-5718-1969-0415959-7","raw":"33Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables, edited by M. Abramowitz and I. A. Stegun (Dover, New York, 1972). 34However, we will revert back to a rotating frame in Sec. V B where the necessary amendments to the formulation are discussed.","cites":null},{"id":43731118,"title":"A mathematical model of the fluid mechanics and gas-phase chemistry in a rotating disk chemical vapor deposition reactor,”","authors":[],"date":"1989","doi":"10.1149\/1.2096750","raw":"19M. E. Coltrin, R. J. Kee, and G. H. Evans, “A mathematical model of the fluid mechanics and gas-phase chemistry in a rotating disk chemical vapor deposition reactor,” J. Electrochem. Soc. 136, 819 (1989).","cites":null},{"id":43731122,"title":"Absolute and convective instability in the incompressible boundary layer on a rotating disk,”","authors":[],"date":"1998","doi":"10.1007\/s001620050123","raw":"23M. Turkyilmazoglu and J. S. B. Gajjar, “Absolute and convective instability in the incompressible boundary layer on a rotating disk,” CLSCM Report No. CLSCM-1998-002 (University of Manchester, 1998).","cites":null},{"id":43731147,"title":"Absolute instability of the boundary layer on a rotating disk,”","authors":[],"date":"1995","doi":"10.1007\/978-3-642-79765-1_46","raw":"35R. J. Lingwood, “Absolute instability of the boundary layer on a rotating disk,” J. Fluid Mech. 299, 17 (1995).","cites":null},{"id":43731149,"title":"Absolute instability of the Ekman layer and related flows,”","authors":[],"date":"1997","doi":"10.1017\/s0022112096004144","raw":"36R. J. Lingwood, “Absolute instability of the Ekman layer and related flows,” J. Fluid Mech. 331, 405 (1997).","cites":null},{"id":43731117,"title":"An analytic study of the chemical vapor deposition (CVD) processes in a rotating pedestal reactor,”","authors":[],"date":"2007","doi":"10.1016\/0022-0248(86)90025-4","raw":"Eng. Math. 57, 253 (2007). 18K. Chen and A. R. Mortazavi, “An analytic study of the chemical vapor deposition (CVD) processes in a rotating pedestal reactor,” J. Cryst.","cites":null},{"id":43731101,"title":"An asymptotic investigation of the stationary modes of instability of the boundary layer on a rotating disk,”","authors":[],"date":"1986","doi":"10.1098\/rspa.1986.0066","raw":"1P. Hall, “An asymptotic investigation of the stationary modes of instability of the boundary layer on a rotating disk,” Proc. R. Soc. London, Ser. A 406, 93 (1986).","cites":null},{"id":43731105,"title":"An experimental investigation of the flow engendered by a rotating cone,”","authors":[],"date":"1962","doi":null,"raw":"5F. Kreith, D. Ellis, and J. Giesing, “An experimental investigation of the flow engendered by a rotating cone,” Appl. Sci. Res. A11, 430 (1962).","cites":null},{"id":43731173,"title":"An experimental study of absolute instability of the rotating-disk boundary-layer flow,”","authors":[],"date":"1996","doi":"10.1017\/s0022112096000365","raw":"37R. J. Lingwood, “An experimental study of absolute instability of the rotating-disk boundary-layer flow,” J. Fluid Mech. 314, 373 (1996).","cites":null},{"id":43731111,"title":"Behaviour of spiral vortices on a rotating cone in axial flow,”","authors":[],"date":"1984","doi":"10.1007\/bf01177066","raw":"11Y. Kohama, “Behaviour of spiral vortices on a rotating cone in axial flow,” Acta Mech. 51, 105 (1984).","cites":null},{"id":43731114,"title":"Boundary-layer transition and the behaviour of spiral vortices on rotating spheres,”","authors":[],"date":"1983","doi":"10.1017\/s0022112083002335","raw":"14Y. Kohama and R. Kobayashi, “Boundary-layer transition and the behaviour of spiral vortices on rotating spheres,” J. Fluid Mech. 137, 153–164 (1983).","cites":null},{"id":43731110,"title":"Boundary-layer transition on a rotating cone in axial flow,”","authors":[],"date":"1983","doi":"10.1017\/s002211208300275x","raw":"10R. Kobayashi, Y. Kohama, and M. Kurosawa, “Boundary-layer transition on a rotating cone in axial flow,” J. Fluid Mech. 127, 341 (1983).","cites":null},{"id":43731109,"title":"Boundary-layer transition on a rotating cone in still fluid,”","authors":[],"date":"1983","doi":"10.1017\/s0022112083002761","raw":"9R. Kobayashi and H. Izumi, “Boundary-layer transition on a rotating cone in still fluid,” J. Fluid Mech. 127, 353 (1983).","cites":null},{"id":43731104,"title":"Boundary-layer transition on broad cones rotating in an imposed axial flow,”","authors":[],"date":"2010","doi":"10.2514\/1.j050021","raw":"4S. J. Garrett, Z. Hussain, and S. O. Stephen, “Boundary-layer transition on broad cones rotating in an imposed axial flow,” AIAA J. 48(6), 1184 (2010).","cites":null},{"id":43731123,"title":"Convective and absolute instabilities in the incompressible boundary layer on a rotating disk,”","authors":[],"date":"2006","doi":"10.1007\/s001620050123","raw":"24M. Turkyilmazoglu, “Convective and absolute instabilities in the incompressible boundary layer on a rotating disk,” Hacettepe J. Math. Stat. 35, 117 (2006).","cites":null},{"id":43731116,"title":"Experimental investigation of absolute instability of a rotating-disk boundary layer,”","authors":[],"date":"2006","doi":"10.1017\/s0022112006001546","raw":"16H. Othman and T. C. Corke, “Experimental investigation of absolute instability of a rotating-disk boundary layer,” J. Fluid Mech. 565, 63 (2006). 17T. C. Corke, E. H. Matlis, and H. Othman, “Transition to turbulence in rotating-disk boundary layers-convective and absolute instabilities,” J.","cites":null},{"id":43731113,"title":"Experimental study of hydrodynamics and transfer process of a rotating disk,”","authors":[],"date":"1976","doi":"10.1007\/bf00860579","raw":"13B. I. Fedorov, G. Z. Plavnik, I. V. Prokhorov, and L. G. Zhukhovitskii, “Experimental study of hydrodynamics and transfer process of a rotating disk,” J. Eng. Phys. 31, 1448 (1976).","cites":null},{"id":43731106,"title":"Heat and mass transfer from rotating cones,”","authors":[],"date":"1963","doi":"10.1017\/s0022112063001142","raw":"6C. L. Tein and D. T. Campbell, “Heat and mass transfer from rotating cones,” J. Fluid Mech. 17, 105 (1963).","cites":null},{"id":43731142,"title":"Laminar Boundary Layers, 1st ed.","authors":[],"date":"1963","doi":null,"raw":"30L. Rosenhead, Laminar Boundary Layers, 1st ed. (Oxford University Press, Oxford, 1963).","cites":null},{"id":43731144,"title":"Laminer Boundary Layer Theory (Addison–Wesley,","authors":[],"date":"1968","doi":null,"raw":"31H. Evans, Laminer Boundary Layer Theory (Addison–Wesley, Reading, MA, 1968). 32Ka´rma´n and T. von, “Uber laminare und turbulente Reiburg,” Z. Angew.","cites":null},{"id":43731135,"title":"Linear growth rates of type I & II convective modes within the rotating-cone boundary layer,” Fluid Dyn.","authors":[],"date":"2010","doi":"10.1088\/0169-5983\/42\/2\/025504","raw":"27S. J. Garrett, “Linear growth rates of type I & II convective modes within the rotating-cone boundary layer,” Fluid Dyn. Res. 42, 025504 (2010).","cites":null},{"id":43731108,"title":"Mass transfer from a rotating cone in axisymmetric flow,”","authors":[],"date":"1965","doi":"10.1115\/1.3689138","raw":"8F. Salzberg and S. P. Kezios, “Mass transfer from a rotating cone in axisymmetric flow,” J. Heat Transfer 87, 469 (1965).","cites":null},{"id":43731107,"title":"Mass transfer on rotating cones,”","authors":[],"date":"1973","doi":"10.1149\/1.2407875","raw":"7R. Kappesser, R. Greif, and I. Cornet, “Mass transfer on rotating cones,” Appl. Sci. Res. 28, 442 (1973).","cites":null},{"id":43731174,"title":"Model for unstable global modes in the rotating-disk boundary layer,”","authors":[],"date":"2010","doi":"10.1017\/s0022112010003836","raw":"38J. J. Healey, “Model for unstable global modes in the rotating-disk boundary layer,” J. Fluid Mech. 663, 148 (2010). 114108-13 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011) Downloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions","cites":null},{"id":43731124,"title":"Non-linear and non-stationary modes of the lower branch of the incompressible boundary layer flow due to a rotating-disk,”","authors":[],"date":"2007","doi":"10.1090\/s0033-569x-07-01050-x","raw":"25M. Turkyilmazoglu, “Non-linear and non-stationary modes of the lower branch of the incompressible boundary layer flow due to a rotating-disk,” Quart. Appl. Math. 65, 43 (2007).","cites":null},{"id":43731112,"title":"On the stability of threedimensional boundary layers with application to the flow due to a rotating disk,”","authors":[],"date":"1955","doi":"10.1098\/rsta.1955.0013","raw":"12N. Gregory, J. T. Stuart, and W. S. Walker, “On the stability of threedimensional boundary layers with application to the flow due to a rotating disk,” Philos. Trans. R. Soc. London, Ser. A 248, 155 (1955).","cites":null},{"id":43731119,"title":"Parametric effects on thin film growth and uniformity in an atmospheric pressure impinging jet CVD reactor,”","authors":[],"date":"2004","doi":"10.1016\/j.jcrysgro.2004.03.039","raw":"20S. P. Vanka, G. Luo, and N. G. Glumac, “Parametric effects on thin film growth and uniformity in an atmospheric pressure impinging jet CVD reactor,” J. Cryst. Growth 267, 22 (2004).","cites":null},{"id":43731140,"title":"Spiral vortex behaviour in transition region and separation of three-dimensional boundary layers on spheres rotating in axial flow,”","authors":[],"date":"1989","doi":"10.1007\/978-3-642-84103-3_50","raw":"29R. Kobayashi and T. Arai, “Spiral vortex behaviour in transition region and separation of three-dimensional boundary layers on spheres rotating in axial flow,” in Proceedings of the IUTAM Symposium on Laminaturbulent Transition, Toulouse, France, 11–15 September 1989, edited by D. Arnal and R. Michel (Springer-Verlag, Berlin, 1990), pp. 551–557, A91–39901 16–34.","cites":null},{"id":43731121,"title":"Stability and transition of three-dimensional rotating boundary layers,","authors":[],"date":"2010","doi":null,"raw":"22Z. Hussain, “Stability and transition of three-dimensional rotating boundary layers, Ph.D. dissertation (University of Birmingham, 2010).","cites":null},{"id":43731115,"title":"Stationary traveling mode cross-flow mode interactions on a rotating disk,”","authors":[],"date":"1998","doi":"10.1017\/s0022112097007738","raw":"15T. C. Corke and K. F. Knasiak, “Stationary traveling mode cross-flow mode interactions on a rotating disk,” J. Fluid Mech. 355, 285 (1998).","cites":null},{"id":43731120,"title":"The absolute instability of the boundary layer on a rotating cone,”","authors":[],"date":"2007","doi":"10.1016\/j.euromechflu.2006.08.002","raw":"21S. J. Garrett and N. Peake, “The absolute instability of the boundary layer on a rotating cone,” Eur. J. Mech. B 26, 344 (2007).","cites":null},{"id":43731103,"title":"The crossflow instability of the boundary layer on a rotating cone,”","authors":[],"date":"2009","doi":"10.1017\/s0022112008005181","raw":"3S. J. Garrett, Z. Hussain, and S. O. Stephen, “The crossflow instability of the boundary layer on a rotating cone,” J. Fluid Mech. 622, 209 (2009).","cites":null},{"id":43731102,"title":"The neutral curve for stationary disturbances in rotatingdisk flow,”","authors":[],"date":"1986","doi":"10.1017\/s0022112086002550","raw":"2M. R. Malik, “The neutral curve for stationary disturbances in rotatingdisk flow,” J. Fluid Mech. 164, 275 (1986).","cites":null},{"id":43731137,"title":"Vortex-speed selection within the boundary-layer flow over a rotating sphere placed in an enforced axial flow,”","authors":[],"date":"2009","doi":"10.1016\/j.euromechflu.2009.11.004","raw":"28S. J. Garrett, “Vortex-speed selection within the boundary-layer flow over a rotating sphere placed in an enforced axial flow,” Eur. J. Mech. B 29, 84 (2009).","cites":null},{"id":43731125,"title":"Vortex-speed selection within the rotating-disk boundary layer,”","authors":[],"date":"2010","doi":"10.1260\/1748-3018.4.1.71","raw":"26S. J. Garrett, “Vortex-speed selection within the rotating-disk boundary layer,” J. Algorithms Comput. Technol. 4(1), 71 (2010).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-11-30","abstract":"We consider the convective instability of stationary and traveling modes within the boundary layer over a disk rotating in a uniform axial ﬂow. Complementary numerical and high Reynolds number asymptotic analyses are presented. Stationary and traveling modes of type I (crossﬂow) and type II (streamline curvature) are found to exist within the boundary layer at all axial ﬂow rates considered. For low to moderate axial ﬂows, slowly traveling type I modes are found to be the most ampliﬁed, and quickly traveling type II modes are found to have the lower critical Reynolds numbers. However, near-stationary type I modes are expected to be selected due to a balance being struck between onset and ampliﬁcation. Axial ﬂow is seen to stabilize the boundary layer by increasing the critical Reynolds numbers and reducing ampliﬁcation rates of both modes. However, the relative importance of type II modes increases with axial ﬂow and they are, therefore, expected to dominate for sufﬁciently high rates. The application to chemical vapour deposition (CVD) reactors is considered.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/pof.aip.org\/resource\/1\/phfle6\/v23\/i11\/p114108_s1","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10038\/2\/PhysFluids_23_114108.pdf","pdfHashValue":"34bc12a4752723c5896034550533d2553e4e9cca","publisher":"American Institute of Physics (AIP)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10038<\/identifier><datestamp>\n                2014-02-28T13:24:21Z<\/datestamp><setSpec>\n                com_2381_445<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_3823<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe instability of the boundary layer over a disk rotating in an enforced axial flow<\/dc:title><dc:creator>\nHussain, Z.<\/dc:creator><dc:creator>\nGarrett, Stephen J.<\/dc:creator><dc:creator>\nStephen, S.O.<\/dc:creator><dc:description>\nWe consider the convective instability of stationary and traveling modes within the boundary layer over a disk rotating in a uniform axial ﬂow. Complementary numerical and high Reynolds number asymptotic analyses are presented. Stationary and traveling modes of type I (crossﬂow) and type II (streamline curvature) are found to exist within the boundary layer at all axial ﬂow rates considered. For low to moderate axial ﬂows, slowly traveling type I modes are found to be the most ampliﬁed, and quickly traveling type II modes are found to have the lower critical Reynolds numbers. However, near-stationary type I modes are expected to be selected due to a balance being struck between onset and ampliﬁcation. Axial ﬂow is seen to stabilize the boundary layer by increasing the critical Reynolds numbers and reducing ampliﬁcation rates of both modes. However, the relative importance of type II modes increases with axial ﬂow and they are, therefore, expected to dominate for sufﬁciently high rates. The application to chemical vapour deposition (CVD) reactors is considered.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2012-01-24T15:26:27Z<\/dc:date><dc:date>\n2012-01-24T15:26:27Z<\/dc:date><dc:date>\n2011-11-30<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:type>\nArticle<\/dc:type><dc:identifier>\nPhysics of Fluids, 2011, 23 (11), 13 pp.<\/dc:identifier><dc:identifier>\n1070-6631<\/dc:identifier><dc:identifier>\nhttp:\/\/pof.aip.org\/resource\/1\/phfle6\/v23\/i11\/p114108_s1<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10038<\/dc:identifier><dc:identifier>\n10.1063\/1.3662133<\/dc:identifier><dc:identifier>\n1089-7666<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© 2011 American Institute of Physics.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.  This article may be downloaded for personal use only.  Any other use requires prior permission of the author and the American Institute of Physics.  The following article appeared in Physics of Fluids, 2011, 23 (11), 13 pp.  and may be found at http:\/\/pof.aip.org\/resource\/1\/phfle6\/v23\/i11\/p114108_s1<\/dc:rights><dc:publisher>\nAmerican Institute of Physics (AIP)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1070-6631","issn:1089-7666","1070-6631","1089-7666"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Journal Article","Article"],"fullText":"The instability of the boundary layer over a disk rotating in an\nenforced axial flow\nZ. Hussain, S. J. Garrett, and S. O. Stephen \n \nCitation: Phys. Fluids 23, 114108 (2011); doi: 10.1063\/1.3662133 \nView online: http:\/\/dx.doi.org\/10.1063\/1.3662133 \nView Table of Contents: http:\/\/pof.aip.org\/resource\/1\/PHFLE6\/v23\/i11 \nPublished by the American Institute of Physics. \n \nRelated Articles\nA study of similarity solutions for laminar swirling axisymmetric flows with both buoyancy and initial momentum\nflux \nPhys. Fluids 23, 113601 (2011) \nOn particle spin in two-way coupled turbulent channel flow simulations \nPhys. Fluids 23, 093302 (2011) \nFirst-order virial expansion of short-time diffusion and sedimentation coefficients of permeable particles\nsuspensions \nPhys. Fluids 23, 083303 (2011) \nThe stochastic Burgers equation with vorticity: Semiclassical asymptotic series solutions with applications \nJ. Math. Phys. 52, 083512 (2011) \nRoles of particle-wall and particle-particle interactions in highly confined suspensions of spherical particles being\nsheared at low Reynolds numbers \nPhys. Fluids 23, 083302 (2011) \n \nAdditional information on Phys. Fluids\nJournal Homepage: http:\/\/pof.aip.org\/ \nJournal Information: http:\/\/pof.aip.org\/about\/about_the_journal \nTop downloads: http:\/\/pof.aip.org\/features\/most_downloaded \nInformation for Authors: http:\/\/pof.aip.org\/authors \nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nThe instability of the boundary layer over a disk rotating in an enforced\naxial flow\nZ. Hussain,1 S. J. Garrett,1 and S. O. Stephen2\n1Department of Mathematics, University of Leicester, Leicester LE1 7RH, United Kingdom\n2School of Mathematics, University of Birmingham, Birmingham B15 2TT, United Kingdom\n(Received 13 July 2011; accepted 20 October 2011; published online 30 November 2011)\nWe consider the convective instability of stationary and traveling modes within the boundary layer\nover a disk rotating in a uniform axial flow. Complementary numerical and high Reynolds number\nasymptotic analyses are presented. Stationary and traveling modes of type I (crossflow) and type II\n(streamline curvature) are found to exist within the boundary layer at all axial flow rates\nconsidered. For low to moderate axial flows, slowly traveling type I modes are found to be the\nmost amplified, and quickly traveling type II modes are found to have the lower critical Reynolds\nnumbers. However, near-stationary type I modes are expected to be selected due to a balance being\nstruck between onset and amplification. Axial flow is seen to stabilize the boundary layer by\nincreasing the critical Reynolds numbers and reducing amplification rates of both modes. However,\nthe relative importance of type II modes increases with axial flow and they are, therefore, expected\nto dominate for sufficiently high rates. The application to chemical vapour deposition (CVD)\nreactors is considered.VC 2011 American Institute of Physics. [doi:10.1063\/1.3662133]\nI. INTRODUCTION\nThis paper extends the work of Refs. 1 and 2 by consid-\nering the effect of a uniform axial flow on the type I and II\nmodes of convective instability within the boundary-layer\nflow over a rotating disk. This paper is part of a series by the\npresent authors which consider the convective instability of\nthe boundary-layer flow over a family of rotating cones\n(including the disk as the limiting half angle) both in and out\nof axial flow. This series commenced with an investigation\ninto a family of cones rotating in an otherwise still fluid3\nusing both numerical and asymptotic methods, as is done\nhere. The mathematical formulation of the rotating-disk\nproblem in axial flow is necessarily different to that for the\nrotating cone and this motivates separate publication of the\npreliminary cone investigation in Ref. 4.\nThe transition of the boundary layer on the surface of\nrotating disks and cones has been the subject of a number of\nexperimental investigations. These were motivated by the\ndesire to understand transition to turbulence of crossflow vor-\ntices, present in three-dimensional boundary layers. Although\nwe are unaware of experimental investigations explicitly into\nthe vortex dynamics within boundary-layer flows over rotat-\ning disks placed in axial flow, equivalent experimental inves-\ntigations on broad cones (half-angle> 40!) placed in axial\nflow are extensive. Early experimental work on such cones\nwas limited to measurements of the transitional Reynolds\nnumbers.5–8 Following these, detailed flow visualizations and\nhot-wire measurements by Kobayashi and Izumi,9 Kobayashi\net al.,10 and Kohama11 demonstrated the existence of\nco-rotating spiral vortices in the non-turbulent part of the\nboundary layer, which are fixed on the cone for all rotation\nand axial flow rates. These vortices are identical to those\nobserved on the disk rotating in still fluid12,13 and on the\nrotating sphere.14 Such vortices are known to arise from type\nI (crossflow) and type II (streamline curvature) modes of\ninstability. More recently, the experimental investigations of\nCorke and co-workers15–17 on disks rotating in otherwise still\nfluid have shown that traveling modes can be important in\nthe transition process over smooth, clean disks.\nOur interest in the rotating-disk boundary layer arises\nfrom the desire for completeness in the series of papers on\nthe family of rotating cones and also from industrial applica-\ntions in the electrochemical industry, in particular. Here,\nflows arising from rotating disks are present in types of\nchemical vapour deposition (CVD) reactors used for deposit-\ning thin films of optical and electrical materials on sub-\nstrates. Such reactors operate by forcing a carrier gas\n(containing the reactive molecules) onto the substrate held\nwithin a disk-like support placed horizontally in the flow.\nThe set-up is contained within a closed reactor and the sup-\nport is rotated to compensate for any non-uniformity of the\nincident flow. The gas flow can be considered as a uniform\naxial flow incident on a rotating disk and it is desirable that\nthe flow close to the substrate be laminar and free from insta-\nbility to ensure uniform deposition. Although a large amount\nof literature exists on the theoretical and experimental study\nof the reactor-flow parameters (see Refs. 18–20 and referen-\nces contained therein), these are concerned with the changes\nin the laminar-flow profiles that can be achieved and the\neffect these have on deposition growth rates; no stability\nanalyses exist for the flows in question. We pay particular\nattention to Ref. 18 which considers a simple laminar-flow\nmodel that is closely related to the basic flow used in the sta-\nbility investigation presented here. Although the temperature\nand compressibility of the carrier gas are important in the\nphysical process of deposition and are indeed considered in\nRef. 18 and all following laminar-flow investigations, the\nincompressible study presented in this paper can be\n1070-6631\/2011\/23(11)\/114108\/13\/$30.00 VC 2011 American Institute of Physics23, 114108-1\nPHYSICS OF FLUIDS 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nconsidered as a preliminary investigation into how relevant\ninstability analyses are to the design of CVD processes.\nThis paper is related to the theoretical investigations of\nGarrett and Peake,21 recently revisited by the current\nauthors,4 which consider the absolute instability of the\nboundary-layer flows over a family of cones rotating within\nimposed axial flows. There the rotating disk is considered as\na special case of cone with half-angle 90!. As can be seen in\nthose papers, the onset of absolute instability is sensitive to\nthe imposed axial flow rate and the location of onset is sig-\nnificantly delayed with increased flow. Absolute instability is\nnot considered further here.\nThe current paper begins with a description of the math-\nematical formulation of the problem in Sec. II and outlines\nthe asymptotic stability analyses in Sec. III. We subsequently\nproceed to study the neutral curves for stationary modes of\ninstability using complementary asymptotic and numerical\nmethods in Sec. IV. The asymptotic analysis for stationary\nmodes is presented in more detail in Ref. 22, while the nu-\nmerical analysis is used to study the linear growth rates\nwithin the unstable regime. Traveling modes are subse-\nquently studied in Sec. V using two distinct formulations.\nThe first is in the rotating frame of reference and presents\nneutral curves and growth rates for disturbances traveling at\nfixed frequencies, in an approach that is consistent with, for\nexample, Turkyilmazoglu and Gajjar’s work.23–25 Both as-\nymptotic and numerical approaches are used. The asymptotic\napproach models traveling modes in axial flow for the first\ntime, and as such builds on the analyses in Hussain’s Ph.D.\ndissertation22 (still fluid) and23–25 (traveling modes). Mean-\nwhile, the second formulation is in the inertial (stationary)\nframe of reference and considers disturbances traveling at\nfixed phase speeds with respect to the disk surface. This is\nrelated to Garrett’s recent numerical studies of the rotating\ndisk, cone, and sphere boundary layers26–28 where disturban-\nces traveling at around 75% of each body’s surface are found\nto be most amplified. This is consistent with Kobayashi and\nArai’s29 experimental observation of slow vortices over\nrotating spheres under particular conditions. In the analysis\nof stationary modes, identical neutral curves arise in the two\nframes of reference. Furthermore, in the analysis of traveling\nmodes, the two formulations lead to neutral curves which\nmust be compared at specific values of the local Reynolds\nnumber. Following this approach, we observe excellent\nagreement for a range of traveling modes in axial flow.\nII. FORMULATION\nThe asymptotic and numerical investigations presented\nin this paper use slightly different formulations. We give a\nsummary of the formulation used in the asymptotic investi-\ngation here and mention the amendments relevant to the for-\nmulation of the numerical investigations at relevant points in\nthe text.\nConsider a rigid disk of infinite extent rotating about the\nz*-axis which passes through the center of the disk. The ra-\ndial and azimuthal coordinates are x* and h, respectively,\nwhich rotate with the disk surface. The disk is placed in an\nincompressible fluid with oncoming axial flow aligned paral-\nlel to the z*-axis at upstream infinity. At the edge of the\nboundary layer, the dimensional surface velocity distribution\nalong the disk is given by the well-known potential-flow so-\nlution U\"0 x\n\"ð Þ ¼ C\"x\" (see Refs. 30 and 31 for example).\nHere, C* is a scale factor determined by the free-stream axial\nflow incident on the disk. Asterisks indicate dimensional\nquantities. A diagram of the formulation can be seen in\nFigure 1 of Ref. 21 when setting the half-angle to w¼ 90!.\nThe non-dimensionalization of the asymptotic study\nfollows that detailed in Ref. 3 when w¼ 90!, leading to the\nReynolds number\nR ¼ X*l*\n2\n!*\n: (1)\nHere, X* is the angular speed of rotation of the disk, l* is\na characteristic length scale along the disk surface, and !*\nis the kinematic viscosity of the fluid. Distances in the\nz*-direction are scaled on the boundary-layer thickness\nd*¼ (!*=X*)1=2, leading to the non-dimensional variable\nf¼ z*=d*. We note that the boundary-layer thickness is\nO(R&1=2). Note that this scaling is different to that used in\nRef. 18 and this is discussed in Sec. VI.\nThe basic steady flow over the disk has the form\nxU(f; Ts), xV (f; Ts), and R\n&1=2W(f; Ts) in the radial,\nazimuthal, and normal directions, respectively, and these are\ndetermined by the non-dimensional Navier–Stokes and\ncontinuity equations at leading order,\nW0 þ 2U ¼ 0; (2)\nWU0 þ U2 & ðV þ 1Þ2 ¼ T2s þ U00; (3)\nWV0 þ 2UðV þ 1Þ ¼ V00; (4)\nsubject to boundary conditions\nU ¼ 0; V ¼ 0; W ¼ 0; on f ¼ 0;\nU ! Ts; V ! &1; as f!1: (5)\nA prime denotes differentiation with respect to f. The param-\neter Ts is the ratio of the local slip velocity at a radial posi-\ntion to the rotational speed of the disk surface at that\nlocation,\nTs ¼ C*x*X*x* ¼\nC*\nX*\n:\nWe note that in this geometry, Ts is independent of x* and\nthis simplifies the analysis for the rotating disk; this is a cru-\ncial difference between this analysis and that of a rotating\ncone in axial flow. Ts¼ 0 represents the disk rotating in oth-\nerwise still fluid and we recover the familiar von Ka´rma´n\nequations.32\nEquations (2)–(4), subject to conditions (5), are solved\nusing a fourth-order Runge–Kutta integration method, in\nconjunction with a two-dimensional Newton–Raphson\nsearching routine to iterate on the outer boundary conditions\nfor different values of Ts. Figure 1 shows the resulting mean-\nflow profiles for Ts¼ 0 – 0.25.\n114108-2 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nIII. LINEAR STABILITYANALYSIS\nWe consider type I and type II modes in order to derive\nestimates of the wavenumber cd\" and waveangle \/ of the\nresulting disturbances in the large Reynolds number limit.\nTo derive the linear disturbance equations, we introduce\nsmall perturbations around the basic flow which lead to gov-\nerning equations independent of Ts and identical to those\ngiven by Eqs. (3.1)–(3.4) of Ref. 3. The analysis of each\nbasic-flow profile determined by Ts= 0 then proceeds in a\nsimilar way to that given in Refs. 1,3, and 22. For this rea-\nson, we focus on the quantitative differences that arise in the\nanalysis of Ts= 0 and present only a brief overview of the\nmethods used. The interested reader is referred to Refs. 1,3,\nand 22 for full details.\nA. Inviscid type I modes\nPhysically, modes of type I are known to arise from an\ninflection point in the mean velocity profiles and are inviscid\nin origin. To analyse these modes, the disturbance wave-\nlengths are scaled on the boundary-layer thickness. A small\nparameter e ¼ R&16 is introduced and we define the perturba-\ntion velocities and pressure as functions of the wall-normal\ncoordinate z¼ f\"3 in the form,\nð~u; ~v; ~w; ~pÞ ¼ ðuAðzÞ; vAðzÞ;wAðzÞ; pAðzÞÞ\n( exp i\n\"3\nðx\naAðx; \"Þdxþ bAð\"Þh& \"xAt\n\" #$ %\n:\nThe disturbances associated with these perturbations are neu-\ntrally stable and hence aA and bA are considered as real quan-\ntities. We proceed by expanding the radial and azimuthal\nwavenumbers as well as the traveling mode frequency in the\nform,\naA ¼ a0 þ \"a1 þ ) ) ) ;\nbA ¼ b0 þ \"b1 þ ) ) ) ;\nxA ¼ x0 þ \"x1 þ ) ) ) ;\nwhere the perturbation radial velocity in the inviscid layer is\nexpanded as\nuA ¼ u0ðfÞ þ \"u1ðfÞ þ ) ) ) :\nSimilar expansions are used for vA, wA, and pA, and the\nresulting perturbation equations are solved at each order.\nConsequently, for the first order eigenmodes, follow-\ning Ref. 1, we observe the existence of two layers: an\ninviscid layer of thickness O(\"3) and a viscous layer of\nthickness O(\"4) to incorporate the no-slip condition at the\nwall, which is found by balancing convection and diffusion\nterms in the disturbance equations. Subsequently, we pro-\nceed to match the leading-order solution in the wall layer,\nusing the wall-normal coordinate r¼ \"&4z, to the first-\norder solution in the inviscid layer to arrive at the follow-\ning eigenrelation:\nw0ð0Þ2Ai0ðs0Þ\nc\nÐ1\ns0\nAiðsÞds ¼ 2 a0a1þ\nb0b1\nx2\n$ %\nI1þ a1b0\n&b1a0\nb20\n !\nI2þx0!I3:\n(6)\nHere w is the leading-order Rayleigh eigenfunction, normal-\nised such that its wall-gradient w0(0)¼ 1. Furthermore,\nc¼ [i(a0xU0(0)þb0V0(0))]1=3 and the integrals I1, I2 are\ndefined and calculated numerically in Refs. 1,3, and 22.\nMeanwhile, the eigenrelation differs from the stationary\nmodes case only in the Airy function terms on the left-hand\nside as well as the addition of the third term on the right-\nhand side, which is observed also by Turkyilmazoglu and\nGajjar23 for traveling modes over a rotating disk in still\nfluid. The wall layer normal coordinate is re-scaled to give\ns¼ crþ s0, where s0¼&ix0=c2 and the integral, as defined\nin Ref. 24 for the still fluid problem is\n!I3 ¼\nð1\n0\nw20ðhÞ\n!U\n00ðhÞ\n!U\n2ðhÞ dh:\nThe effective velocity profile !U ¼ a0xU þ b0V is defined in\nRefs. 1,3, and 22. In a similar fashion to I2 in Refs. 1,3, and\n22, !I3 is calculated using numerical integration and the resi-\ndue theorem due to the singularity present at the location of\nthe inviscid critical layer, where !U ¼ !U00 ¼ 0. The values of\n!I3 corresponding to axial flows in the range Ts¼ 0–0.25 are\ngiven in the Appendix.\nB. Viscous type II modes\nPhysically, modes of type II are known to originate from\nviscous effects close to the disk boundary. To analyse these\nmodes, we consider a triple-deck structure to be built on a\nsmall parameter, now given by \" ¼ R& 116. The lower, main,\nand upper decks have thicknesses of order \"9, \"8, and \"4,\nrespectively, and we define inner variables n, f, and Z to rep-\nresent O(1) variation within these decks. The wavenumbers\nare scaled upon a viscous length-scale, so that the velocity\nand pressure perturbations become\nFIG. 1. Basic-flow profiles for Ts¼ 0, 0.05, 0.15, and 0.25 (arrow indicates\ndirection of increasing Ts).\n114108-3 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nð~u; ~v; ~w; ~pÞ ¼ ðuAðzÞ; vAðzÞ;wAðzÞ; pAðzÞÞ\n( exp i\n\"4\nðx\naAðx; \"Þdxþ bAð\"Þh& \"2xAt\n\" #$ %\n:\nWe proceed by expanding the radial and azimuthal wave-\nnumbers as well as the frequency as\naA ¼ a0 þ \"2a1 þ \"3a2 þ ) ) ) ;\nbA ¼ b0 þ \"2b1 þ \"3b2 þ ) ) ) ;\nxA ¼ \"x0 þ \"2x1 þ \"3x2 þ ) ) ) :\nnoting that the O(\") terms in aA, bA are zero, while ai, bi are\nreal quantities (where i¼ 0, 1, 2,…).\nThe solution for the first-order problem, which matches\nwith the main deck, follows the form of that found in Ref. 25\nfor the type II modes of a rotating disk in still fluid; the main\ndifference is the presence of the traveling mode frequency\nleading to an additional term in x0. This is manifest in the\nmodified eigenrelation\nc20I3 þ\nic0b0U\n0ð0Þ\nðb0 & a0xTsÞ2\n1þ V\n0ð0Þ2\nU0ð0Þ2\n !\nI4 þ ic0x0D\n3\n4\nðb0 & a0xTsÞ2\nI5\n¼ ic0D\n1\n2\nðb0 & a0xTsÞ2\nða1xU0ð0Þ þ b1V0ð0ÞÞ; (7)\nwhere c0 ¼\nffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi\na20 þ b20=x2\nq\nis the leading order type II wave-\nnumber and I3, I4 are numerical integrals defined and calcu-\nlated in Refs. 1,3, and 22. The final integral on the left-hand\nside is also calculated numerically and given by\nI5 ¼\nÐ1\n0 h\n2Uð0; hÞdhffiffiffi\n2\np\nUð0; 0Þ ¼ 1:347;\nwhere U(0, h) is the parabolic cylinder function defined in\nRef. 33.\nAs discussed in Refs. 1,3, and 22, we investigate the\nboundary-layer structure by obtaining leading order solutions\nin each of the decks. In the upper deck, disturbances decay\nexponentially, whereas in the main deck, we use the no-slip\ncondition to argue that the effective wall shear tends to zero\nas f ! 0. This was experimentally observed by Fedorov\net al.13 for Ts¼ 0 and is numerically verified in Sec. IV B for\nall Ts. The leading-order radial and azimuthal wavenumbers\nare therefore chosen such that\na0U0ð0; TsÞ þ b0\nx\nV0ð0; TsÞ ¼ 0: (8)\nIn the lower deck, the decay of the leading order solution is\nmanifest in terms of the parabolic cylinder function\nUð0;p2D14nÞ through the balance of viscous and Coriolis\nforces, where\nD ¼ i\n2\nða0xU00ð0Þ þ b0V00ð0ÞÞ\n¼ & ia0x\n2\nð1þ T2s Þ:\nIV. THE ANALYSIS OF STATIONARY MODES\nA. Asymptotic analysis in the rotating frame\nFor both type I and type II modes, the asymptotic analy-\nses for stationary modes correspond directly to the lack of\ntime-dependent terms in the linearised perturbation equa-\ntions. Hence, the absence of the traveling mode frequency\nsuch that xA¼ 0 leads to the simplification of both the invis-\ncid and viscous stability analyses. For type I modes, there is\nno need to calculate the integral !I3, whereas for type II\nmodes, the integral I5 is not required; both are eliminated\nfrom the process of solving eigenrelations (6) and (7),\nrespectively.\n1. Inviscid type I modes\nAs discussed in Ref. 3, estimates for cd\" and \/ for vorti-\nces arising from the type I mode are expressed as\ncId\" ¼ a2A þ\nb2A\nx2\n$ %1\n2\n¼ c0 þ a0a1 þ\nb0b1\nx2\n$ %\n\"=c0 þ ) ) )\n¼ AIs & BIsR&1=3L þ ) ) ) (9)\nand\ntan\np\n2\n& \/I\n( )\n¼ aAx\nbA\n¼ a0x\nb0\nþ a1\nb0\n& b1a0\nb20\n !\nx\"þ ) ) )\n¼ CIs þ DIsR&1=3L þ ) ) ) ; (10)\nwhere the numerical values of AIs, B\nI\ns, C\nI\ns, and D\nI\ns are listed in\nTable I. Note that c20 ¼ a20 þ b\n2\n0\nx2 and RL¼R1=2x is the Reyn-\nolds number based on the boundary-layer thickness (this\nremoves any dependence on the radial location x). Numerical\nvalues for some underlying quantities are given in the\nAppendix for comparison with those calculated by Hall,1\nGarrett et al.,13 and Hussain22 when Ts¼ 0.\n2. Viscous type II modes\nThe analysis leads to the following estimates for the\nproperties of the vortices arising from type II instabilities:\nTABLE I. Numerical values for the asymptotic expansions of cId\" and \/\nI in\nEqs. (9) and (10), respectively.\nTs AIs B\nI\ns C\nI\ns D\nI\ns\n0.00 1.162 8.314 4.256 16.535\n0.05 1.224 8.476 3.932 12.710\n0.10 1.294 8.817 3.561 9.449\n0.15 1.369 9.252 3.203 6.984\n0.20 1.445 9.755 2.879 5.200\n0.25 1.522 10.335 2.596 3.918\n114108-4 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\ncIId\" ¼ a2A þ\nb2A\nx2\n$ %1\n2\nR&\n1\n4;\n¼\n1þ V\n0ð0Þ2\nU0ð0Þ2\n !3\n4\n1þ V\n0ð0ÞTs\nU0ð0Þ\n**** ****\nU0ð0ÞI4\nI3\n$ %1\n2\nx&\n1\n2R&\n1\n4 þ ) ) ) ;\n¼ AIIs R&\n1\n2\nL þ ) ) ) (11)\nand\ntan\np\n2\n& \/II\n( )\n¼ aAx\nbA\n;\n¼ a0x\nb0\nþ \"2 a1\nb0\n& b1a0\nb20\n !\nxþ ) ) ) ;\n¼ CIIs þ DIIs R&\n1\n4\nL þ ) ) ) ; (12)\nwhere the numerical values of AIIs , C\nII\ns , and D\nII\ns are listed in\nTable II.\nB. Numerical analysis in the inertial frame\nThe numerical study uses the length scale provided by\nthe boundary-layer thickness in all spatial scalings, and we\nconsider the disk to be rotating in a fixed frame of reference.\nThis formulation is consistent with that discussed in the rele-\nvant sections of Refs. 3,4,21,26–28 and permits control of\nthe speed at which vortices rotate with respect to the disk\nwithin the analysis.34\nThe mean flow is found by solving equations equivalent\nto Eqs. (2)–(4) but with amendments due to the different\nframe of reference. The governing disturbance equations are\nthen formed by perturbing the mean flow with quantities\nðu^; v^; w^; p^Þ ¼ ðuðfÞ; vðfÞ;wðfÞ; pðfÞÞ expðiðaxþ bRLh& ctÞÞ:\nThe quantity a is complex and b and c are real, as required\nby the spatial analysis used here. It is assumed that b is O(1).\nAs defined above, RL is the local Reynolds number that\narises from using the boundary-layer thickness as the length\nscale, whereas the non-dimensional normal distance variable\nf is defined in the asymptotic analysis.\nThe governing perturbation equations in this formula-\ntion are identical to those given as Eqs. (4.2)–(4.7) in Ref. 3,\nand we see that the effect of Ts= 0 is to change the basic\nflow on which the analysis is performed. The analysis on\neach basic flow is similar to that described in Ref. 3 and\ninterested readers are referred there for further information.\n1. Neutral curves\nWe begin by explicitly assuming that the vortices rotate\nwith the surface of the disk; this involves fixing the disturb-\nance phase velocity c¼ c=b¼ 1. Spatial branches for each Ts\nhave been plotted by solving the dispersion relation for com-\nplex a¼ arþ i ai at fixed RL by marching through values of\nc¼b. This approach has been denoted method 2 in Ref. 26.\nAt each Ts, two spatial branches are found to determine the\ninstability of the flow, with behavior similar to those shown\nin Figure 7 of Ref. 3. These branches arise from crossflow\n(type I) effects and streamline-curvature (type II) effects.\nThe associated neutral curves (described by ai¼ 0 at each\nRL) have two distinct lobes with the larger lobe, character-\nized by higher wavenumbers, due to the type I instability,\nand the smaller lobe due to the type II instability. The neutral\ncurve calculated for Ts¼ 0 is identical to that calculated by\nMalik.2\nFigures 2 and 3 show a comparison between the numeri-\ncally calculated neutral curves and asymptotic estimates at\nhigh Reynolds number, in terms of the wavenumber\nkd ¼\nffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi\na2 þ b2\np\nand waveangle \"¼ arctan(b=a) which are\nidentified with the asymptotic quantities cd\" and \/, respec-\ntively. We see excellent agreement between the numerical\nand asymptotic predictions of wavenumber and waveangle\nfor both modes of instability, even though different frames\nof reference and formulations have been used.\nFigures 2 and 3 show that the type I mode remains the\nmost dangerous (has lower critical RL) for the values of Ts\nconsidered. However, as the axial flow rate is increased, the\ntype II mode becomes more important. Figure 4 shows the\nneutral curves in terms of ar for Ts¼ 0–0.40, and we see that\nthe type II mode has become the most dangerous by\nTs¼ 0.40. Physically, this behavior is to be expected as\nincreasing the axial flow rate forces fluid towards the disk\nTABLE II. Numerical values for the asymptotic expansions of cIId\" and \/\nII\nin Eqs. (11) and (12), respectively.\nTs AIIs C\nII\ns D\nII\ns\n0.00 1.225 1.207 2.312\n0.05 1.323 1.222 2.249\n0.10 1.438 1.231 2.164\n0.15 1.571 1.232 2.060\n0.20 1.720 1.224 1.939\n0.25 1.884 1.207 1.809\nFIG. 2. Neutral-stability curves in terms of predicted wavenumber for\nTs¼ 0, 0.05, 0.15, and 0.25 (a)–(d). Solid line: numerical, dashed line:\nasymptotic.\n114108-5 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nsurface and so any instability is more likely to develop from\nviscous effects close to the wall location, rather than further\nup in the boundary layer. The type II modes should, there-\nfore, become dominant as Ts increases. Plots of the effective\nvelocity profile, Q(f; U, Ts)¼U(f; Ts) cos (U)þV (f; Ts) sin\n(U), resolved at an angle from the radial direction in the\ndirection of rotation, U, show the presence of an inflection\npoint at certain values of U for all values of Ts (see Figure 5\nfor example). Hence, the type I mode is expected to exist at\nall axial flow rates, as is observed in Figure 4.\nThe asymptotic analysis assumes that the effective wall\nshear is zero along the lower (type II) branch. This assump-\ntion is not necessary in the numerical investigation and\nindeed we are able to justify it using the numerical formula-\ntion. The effective wall shear along the lower branch can be\ncalculated from the values of aU0(0; Ts)þ bV0(0; Ts) along\nthe type II branch of the numerical results. This quantity is\nidentified with Eq. (8) from the asymptotic investigation and\nhas been investigated for Ts¼ 0–0.40. We can confirm that\nits value tends to zero as RL increases and is consistent with\nthe equivalent calculation of Ref. 2 for Ts¼ 0.\n2. Linear amplification rates\nWe have so far shown that the critical Reynolds number\nfor the type II mode is reduced relative to the type I mode as\nthe axial flow rate is increased. However, in order to better\nunderstand the mode selection process in practice, it is nec-\nessary to consider the linear growth rates of both modes\nthrough the convectively unstable region. In doing this, we\nfollow the analysis of Ref. 26 that considers linear growth\nrates within the rotating-disk boundary layer for Ts¼ 0. That\nwork has since been extended to the boundary-layer flows\nover the family of rotating cones and spheres by Garrett27,28\nwith a view to understanding the vortex-speed selection pro-\ncess over smooth bodies (see Sec. V).\nIn order to compare the effect of incident axial flow, the\namplification rates over an equal extent of RL are required.\nWe have chosen to consider a region of extent of 215 in RL.\nThis is approximately the extent of the convectively unstable\nregion for Ts¼ 0 until local absolute instability is encoun-\ntered at RA * 507, as determined by Lingwood.35,36 This is\nknown to be close to the experimentally observed onset of\nturbulence for a rotating disk (see Ref. 37 for example), and\nso for comparison purposes can be interpreted as the extent\nof spiral vortices within the boundary layer. However, recent\ninvestigation by Healey38 suggests that edge effects of the\nrotating disk may contribute to the linear global instability of\nthe flow, and that infinite rotating disks may remain globally\nstable despite the existence of local absolute instability. Fur-\nthermore, axial flow is known to significantly delay the onset\nof absolute instability and so potentially the onset of turbu-\nlence (see Refs. 4 and 21). Hence, a range of RL should be\nconsidered, and so to facilitate the comparison, an extent of\n215 is used for all Ts> 0.\nFigure 6 shows the amplification rates of stationary\nmodes through a convective unstable region of around 215\nFIG. 3. Neutral-stability curves in terms of predicted waveangle for Ts¼ 0,\n0.05, 0.15, and 0.25 (a)–(d). Solid line: numerical, dashed line: asymptotic.\nFIG. 4. Neutral-stability curves in the (ar, RL)-plane for Ts¼ 0 (dotted line),\n0.05, 0.15, 0.25, 0.30, 0.35, and 0.40 (left to right).\nFIG. 5. The effective mean velocity profiles (in the rotating frame) for\nTs¼ 0.40 at U¼ 90!–0! in increments of 10! (bottom to top).\n114108-6 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nin RL from the onset of the type I mode in the range\nTs¼ 0–0.25. We see that the amplification rates are signifi-\ncantly reduced with axial flow and the type II mode becomes\nincreasingly important relative to the type I mode. For suffi-\nciently high axial flow rates, the amplification rates of the\ntype II mode is expected to become larger than the type I\nmode and could be selected in practice. However investiga-\ntions have showed that this would be at rates far in excess of\nT¼ 0.40. Similar behavior has been found in the rotating-\nsphere boundary layer in Ref. 28.\nV. THE ANALYSIS OF TRAVELING MODES\nAs discussed in Sec. I, the recent experimental investi-\ngations of Corke and co-workers, for example, have shown\nthat non-stationary modes can be important in the transi-\ntion process over smooth disks. This is particularly rele-\nvant in the CVD application where highly polished and\nclean surfaces are used. It is important to note that this\nexperimental observation is consistent with the theoretical\ninvestigations into the boundary-layer flow over a disk\nrotating in otherwise still fluid due to Turkyilmazoglu and\nGajjar.23–25 There, results are presented which demonstrate\nthat disturbances arising from the type II mode moving at\ndifferent speeds relative to the disk surface can have con-\nsiderably lower critical Reynolds numbers than the station-\nary type I mode.\nThe stability of traveling disturbances for different val-\nues of Ts is considered here using two distinct approaches.\nThe first is consistent with the rotating-frame analyses in the\nliterature referred to above, and both numerical and asymp-\ntotic analyses are presented within this frame. The second\napproach is via method 2 within the inertial frame, as dis-\ncussed in Sec. IV B. Although it was possible to compare the\nrotating-frame asymptotic analysis with the inertial-frame\nnumerical analysis in Sec. IV B, this was only because sta-\ntionary disturbances were being considered. The approaches\nin the different frames are inconsistent for traveling modes\nand direct comparisons of the neutral curves are not possible.\nA. Rotating-frame asymptotic analysis\nWe now consider the case of traveling modes of\nfrequency xA for type I and type II disturbances. In both\ncases, the stability analyses presented are similar to\nSec. IV A for stationary modes. However, the inclusion of\ntime-dependence in the disturbance equations leads to an\nadditional terms in the eigenrelation for both the inviscid and\nviscous modes. These distinguish the analyses from those\npresented in Ref. 22 for stationary modes and Refs. 23–25\nfor traveling modes in still fluid.\n1. Inviscid type I modes\nThe inviscid traveling mode analysis reveals the non-\nexistence of time-dependent terms in the leading order solu-\ntion. As a result, we recover the leading-order estimates for\nthe stationary type I modes, so that for any xA= 0 the\nleading-order wavenumber AIt ¼ AIs and the leading-order\nwaveangle CIt ¼ CIs for varying axial flow strengths Ts; in the\nstill fluid case of the rotating disk, the same is observed by\nTurkyilmazoglu.24\nAs in Sec. III A, we proceed to solve Eq. (6) for x0= 0\nand re-scale in terms of the Reynolds number based on\nboundary-layer thickness RL. Hence, we arrive at the first-\norder corrections for the type I wavenumber cId\" and wavean-\ngle \/I, which are given by\ncId\" ¼ AIt & BItR&1=3L þ ) ) ) (13)\nand\ntan\np\n2\n& \/I\n( )\n¼ CIt þ DItR&1=3L þ ) ) ) ; (14)\nwhere the numerical values of BIt and D\nI\nt are given in\nTable III for values of xA corresponding to numerical\ntraveling-mode frequencies x¼&5, 4, 7.9, and 10 at\nRL¼ 107 (see Sec. V B for a definition of x).\n2. Viscous type II modes\nIn the upper and main decks, the analysis leads to\nEq. (8), due to the requirement of zero effective wall shear.\nHence, at leading-order, the traveling mode solution for the\nwaveangle \/II agrees with the stationary mode case, so that\nCIIt ¼ CIIs . Qualitatively, the effects of time-dependent terms\nin \/II do not appear until the first-order problem is consid-\nered within the lower deck.\nFIG. 6. Linear convective growth rates for stationary disturbances at various\nTs at a fixed extent of 215 in RL into the convectively unstable region.\nTABLE III. First-order numerical values for the asymptotic expansions of\ncId\" and \/\nI in Eqs. (13) and (14), for x&2=3x0¼&0.0001, &0.000862,\n0.00017, and 0.000215 (left to right), which correspond to x¼&5, 4, 7.9,\nand 10, respectively, at RL¼ 107.\nTs BIt D\nI\nt B\nI\nt D\nI\nt B\nI\nt D\nI\nt B\nI\nt D\nI\nt\n0.00 8.318 16.541 8.314 16.547 8.313 16.549 8.312 16.551\n0.05 8.478 12.708 8.474 12.713 8.472 12.715 8.471 12.716\n0.10 8.843 9.500 8.839 9.503 8.837 9.505 8.836 9.506\n0.15 9.321 7.089 9.316 7.091 9.314 7.092 9.313 7.093\n0.20 9.900 5.362 9.895 5.365 9.893 5.366 9.892 5.366\n0.25 10.596 4.134 10.591 4.136 10.588 4.137 10.587 4.137\n114108-7 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nWe proceed to solve Eq. (7) for x0= 0 to obtain esti-\nmates for the leading order wavenumber and the first order\nwaveangle. Comparing real and imaginary parts leads to the\nfollowing eigenrelation:\naII !x0 þ bII!c0\n1\n4 & !c0\n9\n4 ¼ 0; (15)\nwhere !x0 ¼ x0x&1=8, !c0 ¼ c0x1=2 and the coefficients\naII ¼\ncos\n3p\n8\n& sin 3p\n8\n+ ,\n1þ V\n0ð0ÞTs\nU0ð0Þ\n$ %2 V0ð0ÞU0ð0Þ\n$ %3\n4 1þ T2s\n2\n$ %3\n4\n( 1þ V\n0ð0Þ2\nU0ð0Þ2\n !5\n8\nI5\nI3\n;\nbII ¼ U\n0ð0Þ\n1þ V\n0ð0ÞTs\nU0ð0Þ\n$ %2 1þ V0ð0Þ2U0ð0Þ2\n !3\n2\nI4\nI3\n:\nFor a given re-scaled frequency !x0, the solution to Eq. (15)\nis shown in Figure 7, with increasing axial flow having the\neffect of increasing the re-scaled leading-order wavenumber\n!c0. Substituting this solution back into Eq. (7) leads to a cor-\nresponding eigenrelation for the first-order waveangle in the\nform,\n!\/1 ¼ bII1 ð!c0\n3\n2 þ aII1 !c0&\n3\n4 !x0Þ; (16)\nwhere !\/1 ¼ \/1x&5=4 and the coefficients\naII1 ¼\nsin\n3p\n8\n1þV\n0ð0ÞTs\nU0ð0Þ\n$ %2 V0ð0ÞU0ð0Þ\n$ %3\n4 1þT2s\n2\n$ %3\n4\n1þ V\n0ð0Þ2\nU0ð0Þ2\n !5\n8\nI5\nI3\n;\nbII1 ¼\n2I3\njU0ð0ÞV0ð0Þj12ð1þT2s Þ\n1\n2\n1þV\n0ð0ÞTs\nU0ð0Þ\n$ %2\n1þ V\n0ð0Þ2\nU0ð0Þ2\n !&14\n:\nThe solution to Eq. (16) is shown in Figure 8. For small\npositive !x0, increasing axial flow has the effect of reducing\nthe re-scaled first-order waveangle !\/1, whereas for suffi-\nciently large and negative !x0, !\/1 is increased. Furthermore,\nfrom Figures 7 and 8, it is clear that for small positive values\nof !x0, a second type II mode exists, which has also been\nobserved in Ref. 25 for the type II traveling modes on a rotat-\ning disk in still fluid. We subsequently proceed to follow\nSec. III B, as the solutions to Eqs. (15) and (16) result in the\nleading-order estimate for the type II wavenumber cIId\" and\nthe first-order correction for the waveangle \/II in the form,\ncIId\" ¼ AIIt R&1=2L þ ) ) ) (17)\nand\ntan\np\n2\n& \/II\n( )\n¼ CIIt þ DIIt R&1=4L þ ) ) ) ; (18)\nwhere the values of AIIt and D\nII\nt are given in Table IV for\nvalues of xA corresponding to numerical frequencies\nx¼&5, 4 at RL¼ 107. The second branch is also presented\nfor x¼ 4 (see Sec. V B for a definition of x).\nB. Rotating-frame numerical analysis\nWe now present a numerical analysis conducted in the\nrotating frame of reference. The formulation of the problem\nis slightly different to that presented in Sec. IV B in that\nFIG. 8. Re-scaled first-order waveangle \/1 against the re-scaled frequency\nx0 shown for increasing axial flow Ts.\nTABLE IV. Leading-order numerical values for the asymptotic expansions\nof cIId\" and \/\nII in Eqs. (17) and (18) for !x0 ¼ &0:667; 0:533 (left to right),\nwhich correspond to x¼&5,4, respectively, at RL¼ 107 (the final column is\nthe second branch for !x0 ¼ 0:533).\nTs AIIt D\nII\nt A\nII\nt D\nII\nt A\nII;2\nt D\nII;2\nt\n0.00 1.542 1.211 0.826 3.902 0.074 16.024\n0.05 1.657 1.201 0.908 3.729 0.072 16.465\n0.10 1.790 1.185 1.009 3.511 0.068 17.042\n0.15 1.942 1.161 1.129 3.260 0.062 17.684\n0.20 2.110 1.127 1.266 2.993 0.056 18.356\n0.25 2.291 1.083 1.419 2.722 0.050 18.973\nFIG. 7. Re-scaled leading-order wavenumber c0 against the re-scaled fre-\nquency x0 shown for increasing axial flow Ts.\n114108-8 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nCoriolis terms appear at O(1=RL) in the perturbation equa-\ntions and the azimuthal component of the basic flow is modi-\nfied so as to maintain the non-slip condition. The\nperturbation equations are not stated here but are identical to\nthose stated as Eqs. (14)–(19) in Ref. 35. To facilitate\ncomparisons with experiments where the frequency spectra\nof traveling disturbances are studied explicitly (rather than\nvortex speeds observed), we work in terms of a dimension-\nless frequency x¼ cRL (see Refs. 15–17 for example).\nWe proceed to calculate neutral curves for fixed x,\nwhich determines c at each location determined by RL.\nEnforcing x> 0 is interpreted as analysing modes that travel\nat speeds greater than the disk surface. However, the\nazimuthal wavenumber b is now a free parameter and so this\nanalysis differs from the inertial-frame analysis in that we\nare not fixing the phase speed of disturbances.\nThis approach is entirely consistent with the theoretical\ninvestigation of Ref. 23 for Ts¼ 0, and we use those results to\nvalidate the amended version of our code in this frame of\nreference. Figure 9 shows neutral curves of the wavenumbers,\nwaveangle, and number of vortices n for various x that are\nidentical to those shown in Figure 5 of Ref. 23. In particular,\nfor x> 0, we see the exaggeration of the lower lobe leading\nto lower critical Reynolds numbers for the type II mode, and\nfor sufficient x< 0, the lower lobe is removed. We see that a\nglobally minimum critical Reynolds number of RL¼ 64.47\noccurs for a type II mode when x¼ 7.9. This critical Reyn-\nolds number (and indeed all characteristics calculated for\neach x) agrees with those of Turkyilmazoglu and Gajjar to\nthe second decimal place. However, as discussed in Ref. 3,\nour previous numerical and asymptotic analyses have failed\nto reproduce their “kink” in the lower branch at very high RL.\nThat the type II mode is exaggerated for disturbances\ntraveling more quickly than the disk surface is consistent\nwith the results of the inertial-frame analysis presented in\nSec. V D, although quantitative comparisons of neutral\ncurves are not possible between the two formulations.\nFigure 10 demonstrates the effect of increasing the\nenforced axial flow rate. As with the stationary-mode analy-\nsis of Sec. IV B, axial flow is seen to stabilise the flow\nto traveling modes of both types. For each Ts, increasing x\nis again seen to exaggerate the relative importance of\nthe type II mode such that it becomes the most dangerous.\nThe value of xmin;Ts which gives the globally minimum\ncritical Reynolds number is seen to increase slightly\nwith Ts, in particular xmin,0.05¼ 8.4, xmin,0.15¼ 10.1, and\nxmin,0.25¼ 11.9. Calculations of neutral curves for stationary\ndisturbances within the rotating frame (x¼ 0) were found to\nbe identical to those calculated in the inertial-frame analysis\nof Sec. IV B for all Ts.\n1. Linear amplification rates\nAs discussed in Sec. IV B, it is instructive to consider\nthe maximum linear growth rates in each case. We continue\nby doing this in the rotating frame of reference for\nTs¼ 0–0.25.\nFigure 11 demonstrates that a traveling mode with\nx¼&16.5 is the most amplified in the rotating frame of\nFIG. 9. Neutral-stability curves calculated in the rotating frame for x¼ 0\n“–”; x¼ 4 “– –”; x¼ 7.9 “–.”; x¼ 10 “)))”; x¼&5 “–” (Ts¼ 0). FIG. 10. Neutral-stability curves of traveling modes in the rotating frame\nfor Ts¼ 0, 0.05, 0.15, and 0.25 (left to right).\nFIG. 11. Growth rates for Ts¼ 0 in the rotating frame for various x.\n114108-9 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nreference for Ts¼ 0. This corresponds to a mode traveling\nmore slowly that the disk surface, which is qualitatively con-\nsistent with the prediction of slowly traveling vortices in the\ninertial frame. We also see that the type II mode becomes\nincreasingly important for x> 0, which is again consistent\nwith the results of the inertial-frame analysis. Increasing x\nto around 20 is sufficient for the type II mode to have the\ngreater amplification rate at Ts¼ 0. However, the critical\nReynolds numbers for the onset of both of these modes are\nsignificantly higher than those that occur for jxj closer to\nzero; this has implications for the mode selection process as\ndiscussed in Sec. VI.\nInvestigation of traveling modes for Ts> 0 has shown\nthat the frequency of the most amplified mode reduces with\nTs. For example, the most amplified mode (as sampled in the\nlatter part of the convectively unstable region prior to the\nonset of absolute instability) has x¼&22.3 at Ts¼ 0.05.\nC. Comparison between asymptotic and numerical\nresults\nIn order to develop consistent comparisons for traveling\nmodes between the asymptotic analysis in Sec. V A and the\nnumerical formulation in Sec. V B, we must compare the\nrespective frequencies used in the normal mode expansions\nof both formulations.\nFor type I modes, xA\"&2 ¼ x. This leads to xAx&2=3\n¼ R&2=3L x, where RL¼R1=2x and \"¼R&1=6. Hence, at large\ndisplacement-thickness Reynolds numbers around O(107)\nand O(1) values of the numerical frequency x, small corre-\nsponding values of xAx&2=3 are required in order to achieve\nrelevant comparisons. For example, for type I modes with\nnumerical frequencies x¼&5 and 4, we require asymptotic\nfrequencies xAx&2=3 ¼ &0:0001 and 0.0000862, respec-\ntively, in order to compare asymptotic and numerical results\nat the specific displacement-thickness Reynolds number of\nRL¼ 107.\nSimilarly, for type II modes, we have xA\"&1 ¼ x. As a\nresult, xAx&1=8 ¼ R&1=8L x, where RL¼R1=2x and for the\nviscous modes \"¼R&1=16. Therefore, for large Reynolds\nnumbers and O(1) numerical frequencies, again small corre-\nsponding values of xAx&1=8 enable suitable comparisons. For\nexample, for type II modes with numerical frequencies\nx¼&5 and 4, we require asymptotic frequencies\nxAx&2=3 ¼ &0:667 and 0.533, respectively, to facilitate com-\nparisons at RL¼ 107. Importantly, from Figures 7 and 8, we\nsee that there exists no traveling mode solutions for\nxAx&2=3 > 0:7, which restricts the range of available com-\nparisons with the numerical results.\nFigure 12 shows comparisons applicable at RL¼ 9( 104\n(the highest value for which the numerical code could obtain\ntraveling mode results for all x), at Ts¼ 0.25 and x¼&5.2\nand 4. We see excellent agreement for the effective wave-\nnumber and waveangle predictions of both mode types\n(where applicable). Although only these particular cases are\nshown here, very similar comparisons were found at each Ts\nand x. The slight discrepancy in the type I effective wave-\nnumber predictions is expected to be a consequence of the\nrelatively low Reynolds number used.\nD. Numerical analysis in the inertial frame\nFull neutral curves and amplification rates for vortices\ntraveling at particular speeds relative to the rotating-disk\nsurface can be computed by changing the value of c within\nthe method-2 analysis described in Sec. IV B, i.e., within the\ninertial frame.\nDisturbance speeds have been considered in the\nrange c¼ 0.5–20 at each Ts and neutral curves computed.\nFigures 13–15 present the neutral curves in terms of ar, n, kd,\nand \" for c¼ 0.8, 5, and 20 together with the c¼ 1 results\nfrom Sec. IV B. Note that c¼ 0.8 corresponds to disturban-\nces traveling at 80% of the disk surface speed, and c¼ 5 and\n20 corresponds to disturbances traveling at speeds much\ngreater than the disk surface.\nIn each case, we find that the globally critical Reynolds\nnumber for the type I mode is given for stationary disturban-\nces, c¼ 1. In addition, we find that the lobe arising from the\ntype II mode is sensitive to the disturbance speed. In\nFIG. 12. Neutral-stability curves for Ts¼ 0.25 for traveling modes. Solid\nlines: numerical, dashed lines: asymptotic.\nFIG. 13. Neutral-stability curves for traveling mode disturbances for Ts¼ 0;\nc¼ 0.8 “)))”; c¼ 1 “–”; c¼ 5 “–.”; c¼ 20 “–x”.\n114108-10 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nparticular, the type II lobe is quickly eliminated for c< 1 and\nexaggerated for c> 1. In all cases where c> 1, the type II\nmode is the more dangerous than in the type I mode in the\nsense of lowest critical Reynolds number. Imposed axial\nflow appears to increase the sensitivity of the type II mode to\ndisturbance speed.\nThe result that traveling type II modes are the most\ndangerous (in the sense of lowest critical RL) for all Ts is\nconsistent with the previous theoretical results of Sec. V B.\nHowever, it is important to note that the range of waveangles\nand vortex numbers predicted to be unstable to traveling\nmodes is extremely narrow, which is in a sense a stabilizing\neffect. The narrow range of waveangles and vortex numbers\nappears to be a significant barrier to the selection of quickly\ntraveling modes.\nHow traveling modes are selected in practice is influ-\nenced by the amplification rates within the convectively\nunstable region. Garrett’s previous analysis in Ref. 26 has\nshown that traveling modes with phase speeds of c¼ 0.75\nare the most amplified in zero axial flow. Investigation of\nTs> 0 shows that the phase speed of the most amplified\nmode increases very slightly with Ts. For example, the most\namplified mode (as sampled in the latter part of the convec-\ntively unstable region prior to the onset of absolute instabil-\nity) remains at c¼ 0.75 for Ts¼ 0.05 and is c¼ 0.76 for\nTs¼ 0.15.\nVI. CONCLUSION\nIn this paper, we have extended the work of Refs. 1 and\n2 by considering the theoretical effect of enforcing a uniform\naxial flow onto the rotating-disk boundary layer. Both\nstationary and traveling modes have been considered. This\ninvestigation is part of a series by the present authors into\nthe convective instability of the boundary layer over a family\nof rotating cones placed both in and out of axial flow.\nThe introduction of axial flow necessarily affects the equa-\ntions governing the basic flow. For the rotating disk, all\ndependence on the radial position is removed leading to a\nmodified form of the von Ka´rma´n ordinary differential equa-\ntions. This does not happen when axial flow is incident on a\nrotating cone with w= 90!, and the resulting analysis is\ndifferent. This crucial difference motivates separate publica-\ntion of the two cases and a preliminary Orr–Sommerfeld analy-\nsis of the rotating-cone boundary layer is presented in Ref. 4.\nA. Stationary modes\nWe began by explicitly studying stationary modes of\ninstability. This is consistent with the existence of surface\nroughness on the disk (as would naturally occur in many\npractical applications) which is known to select stationary\nvortices.\nIncreasing the axial flow rate is found to stabilize the\nrotating-disk boundary layer to both type I and type II sta-\ntionary modes of instability. This is evident from the increas-\ningly narrow range of waveangles predicted to be unstable in\nboth the asymptotic and numerical investigations and also\nfrom the increasing critical Reynolds numbers at the onset of\neither mode predicted by the numerical investigation. The\nnumerical investigation also demonstrates that both station-\nary instability modes are evident in the boundary layer for\nall axial flow rates considered, and, although the type I mode\nis the most dangerous (in the sense of lowest critical Reyn-\nolds number) for low rates of axial flow, the type II mode\nbecomes increasingly important with increased Ts, becoming\nmost dangerous at some critical value around 0.40. Axial\nflow is seen to reduce the amplification rates of stationary\nmodes, confirming again that it has a stabilising effect. It\nalso acts to increase the importance of the type II mode rela-\ntive to the type I mode. However, the type I mode is still the\nmost amplified for all Ts+ 0.40 considered here.\nPhysically, these results are to be expected as increasing\nthe axial flow rate forces fluid towards the disk surface and\nso instabilities are more likely to develop from viscous\neffects close to the wall location.\nThe asymptotic analysis necessarily assumes that the\neffective wall shear is zero along the type II branch, and we\nhave been able to confirm this a posteriori at all Ts using the\nFIG. 14. Neutral-stability curves for traveling mode disturbances for\nTs¼ 0.05; c¼ 0.8 “)))”; c¼ 1 “–”; c¼ 5 “–.”; c¼ 20 “–x”.\nFIG. 15. Neutral-stability curves for traveling mode disturbances for\nTs¼ 0.15; c¼ 0.8 “)))”; c¼ 1 “–”; c¼ 5 “–.”; c¼ 20 “–x”.\n114108-11 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nnumerical analysis. The asymptotic and numerical investiga-\ntions have shown consistent predictions of the wavenumber\nand waveangle of disturbances arising from both type I and\nII modes, and excellent quantitative agreement has been\nfound in all cases even though the two problems were formu-\nlated in different frames of reference.\nB. Traveling modes\nIn practical applications where highly polished, smooth\ndisks are used (for example in CVD reactors), non-stationary\nmodes are known to occur in the boundary layer. The stabil-\nity of traveling modes was considered using two distinct for-\nmulations: The first used the rotating frame of reference and\nallowed control of the disturbance frequency within the\nboundary-layer flow (consistent with experiments of the type\nconducted by Corke and co-workers, for example). The sec-\nond used the inertial frame of reference and allowed control\nof the vortex speed with respect to the disk surface (consist-\nent with experiments of the type conducted by Kohama and\nArai on the rotating sphere). Although the two formulations\ndo not facilitate direct quantitative comparisons of neutral\ncurves, there is a common result observed in both cases:\nnamely, the most amplified disturbances are those traveling\nslower than the disk surface. Exactly what this means for\nvortex-speed selection over smooth disks is not clear cut\nsince the type I modes (which dominate the type II modes in\nall cases considered) were found to have higher critical\nReynolds numbers than their stationary counterpart. A bal-\nance is therefore to be struck between the near-stationary\nmodes that occur earlier in the unstable region and the more\namplified “slow” disturbances that occur later on. It is likely\nby the point that the “slow” disturbances can arise, the near-\nstationary modes will have grown sufficiently to remain the\nmost dominant. This is a more subtle process than previously\nproposed in Ref. 26.\nAs with stationary modes, enforced axial flow was seen\nto stabilise the boundary layer by increasing the critical\nReynolds numbers and also reducing the amplification rates\nof both modes. It is also seen to increase the relative impor-\ntance of the type II mode with respect to the type I mode.\nHowever, the type I mode is still dominant for all Ts consid-\nered here. Axial flow is seen to very slightly increase the\nphase speed of the most amplified traveling mode, even\nthough the frequency of the mode becomes increasingly neg-\native with Ts.\nC. CVD applications\nThe scalings used in this investigation are different to\nthose presented by Chen and Mortazavi,18 who investigate\nthe laminar-flow profiles arising from an equivalent (but\ncompressible) model for CVD reactors. Specifically, their\nboundary-layer thickness is considered to be of orderffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffiffi\n!\"=ðC\" þ X\"Þp , which leads to two parameters appearing in\ntheir basic-flow equations: R1¼X*=(C*þX*) and\nR2¼C*=(C*þX*). These parameters can be expressed in\nterms of our single parameter as R1¼ 1=(1þ Ts) and\nR2¼Ts=(1þTs). Their investigation considers the deposition\nproperties of the laminar flows in the regimes R1¼ 0, R2¼ 1\n(equivalent to Ts ! 1); R1¼ 0.5, R2¼ 0.5 (equivalent to\nTs¼ 1), and R1¼ 1, R2¼ 0 (equivalent to Ts¼ 0). In terms of\nthese parameters, our investigation has R1¼ 1 and R2¼ Ts\nwhich is consistent with their formulation when Ts<< 1.\nOur analysis focuses on Ts+ 0.25 and we therefore conclude\nthat the two analyses are consistent in this range. Our formu-\nlation has the advantage that Ts does not appear in the pertur-\nbation equations and Reynolds number, which greatly\nsimplifies the stability analysis and interpretation of results.\nHowever, if we were to consider large axial flow rates (rela-\ntive to rotation rate) then the scalings used in Ref. 18 would\nbe more suitable and compressibility would also need to be\nconsidered.\nDescriptions within Ref. 20 indicate that CVD reactor-\nflows can reach Reynolds numbers of around R, 104, which\ncan be confirmed by noting that a typical length scale within\na reactor is around 10 cm and the substrate can be rotated at\nrates up to 1500 rpm. Our results show that this Reynolds\nnumber is well within the unstable region for all values of Ts\nconsidered. This clearly shows that the stability characteris-\ntics of any reactor-flow design should be considered if the\nlaminar flow is to remain in practice.\nWith regards the simple rotating-disk model of Ref. 18,\ntheir results indicate that the growth rates of deposition\nincrease with both axial flow rate and rotation rate. This is\ndue to the narrowing of the boundary layer which necessarily\nincreases the concentration of reactive molecules close to the\nsubstrate. Our work furthers this conclusion by suggesting\nthat increasing the axial flow rate is to be preferred as it may\nact to preserve the laminar flow over a greater region of the\nsupport disk. However, the impact of compressibility and\ntemperature profiles needs to be considered in the stability\nanalysis to comment further. It is not possible to summarise\nprevious investigations here, although the effect of wall-\ncooling or heating is expected to be significant.\nACKNOWLEDGMENTS\nZ.H. wishes to acknowledge financial support from the\nSchool of Mathematics, University of Birmingham, and the\nEPSRC. S.J.G. wishes to acknowledge study leave granted\nby the University of Leicester. This work was partially\nsupported by the EPSRC [Grant No. EP=G061637=1].\nAPPENDIX: VALUES FROM THE ASYMPTOTIC\nANALYSES\nTable V presents numerical values for some underlying\nquantities used in the asymptotic analysis. These are given\nTABLE V. Numerical values of quantities used in the asymptotic analysis.\nTs !f I1 I2 !I3\n0.00 1.458 0.0966 0.0582þ 0.0315i &4.4495& 1.0023i\n0.05 1.394 0.0868 0.0710þ 0.0408i &4.4166& 1.0464i\n0.10 1.326 0.0765 0.0902þ 0.0546i &4.3777& 1.0816i\n0.15 1.260 0.0669 0.1153þ 0.0735i &4.3292& 1.1069i\n0.20 1.198 0.0584 0.1466þ 0.0982i &4.2703& 1.1228i\n0.25 1.140 0.0509 0.1843þ 0.1296i &4.2050& 1.1299i\n114108-12 Hussain, Garrett, and Stephen Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\nso that comparisons can be made with equivalent quantities\ncalculated by Hall1 and Garrett et al.3 when Ts¼ 0. The defi-\nnitions of these quantities can be found in Refs. 1 and 3.\n1P. Hall, “An asymptotic investigation of the stationary modes of instability\nof the boundary layer on a rotating disk,” Proc. R. Soc. London, Ser. A\n406, 93 (1986).\n2M. R. Malik, “The neutral curve for stationary disturbances in rotating-\ndisk flow,” J. Fluid Mech. 164, 275 (1986).\n3S. J. Garrett, Z. Hussain, and S. O. Stephen, “The crossflow instability\nof the boundary layer on a rotating cone,” J. Fluid Mech. 622, 209\n(2009).\n4S. J. Garrett, Z. Hussain, and S. O. Stephen, “Boundary-layer transition on\nbroad cones rotating in an imposed axial flow,” AIAA J. 48(6), 1184\n(2010).\n5F. Kreith, D. Ellis, and J. Giesing, “An experimental investigation of the\nflow engendered by a rotating cone,” Appl. Sci. Res. A11, 430 (1962).\n6C. L. Tein and D. T. Campbell, “Heat and mass transfer from rotating con-\nes,” J. Fluid Mech. 17, 105 (1963).\n7R. Kappesser, R. Greif, and I. Cornet, “Mass transfer on rotating cones,”\nAppl. Sci. Res. 28, 442 (1973).\n8F. Salzberg and S. P. Kezios, “Mass transfer from a rotating cone in axi-\nsymmetric flow,” J. Heat Transfer 87, 469 (1965).\n9R. Kobayashi and H. Izumi, “Boundary-layer transition on a rotating cone\nin still fluid,” J. Fluid Mech. 127, 353 (1983).\n10R. Kobayashi, Y. Kohama, and M. Kurosawa, “Boundary-layer transition\non a rotating cone in axial flow,” J. Fluid Mech. 127, 341 (1983).\n11Y. Kohama, “Behaviour of spiral vortices on a rotating cone in axial flow,”\nActa Mech. 51, 105 (1984).\n12N. Gregory, J. T. Stuart, and W. S. Walker, “On the stability of three-\ndimensional boundary layers with application to the flow due to a rotating\ndisk,” Philos. Trans. R. Soc. London, Ser. A 248, 155 (1955).\n13B. I. Fedorov, G. Z. Plavnik, I. V. Prokhorov, and L. G. Zhukhovitskii,\n“Experimental study of hydrodynamics and transfer process of a rotating\ndisk,” J. Eng. Phys. 31, 1448 (1976).\n14Y. Kohama and R. Kobayashi, “Boundary-layer transition and the behav-\niour of spiral vortices on rotating spheres,” J. Fluid Mech. 137, 153–164\n(1983).\n15T. C. Corke and K. F. Knasiak, “Stationary traveling mode cross-flow\nmode interactions on a rotating disk,” J. Fluid Mech. 355, 285 (1998).\n16H. Othman and T. C. Corke, “Experimental investigation of absolute\ninstability of a rotating-disk boundary layer,” J. Fluid Mech. 565, 63\n(2006).\n17T. C. Corke, E. H. Matlis, and H. Othman, “Transition to turbulence in\nrotating-disk boundary layers-convective and absolute instabilities,” J.\nEng. Math. 57, 253 (2007).\n18K. Chen and A. R. Mortazavi, “An analytic study of the chemical vapor\ndeposition (CVD) processes in a rotating pedestal reactor,” J. Cryst.\nGrowth 77, 199 (1986).\n19M. E. Coltrin, R. J. Kee, and G. H. Evans, “A mathematical model of the\nfluid mechanics and gas-phase chemistry in a rotating disk chemical vapor\ndeposition reactor,” J. Electrochem. Soc. 136, 819 (1989).\n20S. P. Vanka, G. Luo, and N. G. Glumac, “Parametric effects on thin film\ngrowth and uniformity in an atmospheric pressure impinging jet CVD\nreactor,” J. Cryst. Growth 267, 22 (2004).\n21S. J. Garrett and N. Peake, “The absolute instability of the boundary layer\non a rotating cone,” Eur. J. Mech. B 26, 344 (2007).\n22Z. Hussain, “Stability and transition of three-dimensional rotating bound-\nary layers, Ph.D. dissertation (University of Birmingham, 2010).\n23M. Turkyilmazoglu and J. S. B. Gajjar, “Absolute and convective instabil-\nity in the incompressible boundary layer on a rotating disk,” CLSCM\nReport No. CLSCM-1998-002 (University of Manchester, 1998).\n24M. Turkyilmazoglu, “Convective and absolute instabilities in the incom-\npressible boundary layer on a rotating disk,” Hacettepe J. Math. Stat. 35,\n117 (2006).\n25M. Turkyilmazoglu, “Non-linear and non-stationary modes of the lower\nbranch of the incompressible boundary layer flow due to a rotating-disk,”\nQuart. Appl. Math. 65, 43 (2007).\n26S. J. Garrett, “Vortex-speed selection within the rotating-disk boundary\nlayer,” J. Algorithms Comput. Technol. 4(1), 71 (2010).\n27S. J. Garrett, “Linear growth rates of type I & II convective modes within\nthe rotating-cone boundary layer,” Fluid Dyn. Res. 42, 025504 (2010).\n28S. J. Garrett, “Vortex-speed selection within the boundary-layer flow over\na rotating sphere placed in an enforced axial flow,” Eur. J. Mech. B 29, 84\n(2009).\n29R. Kobayashi and T. Arai, “Spiral vortex behaviour in transition region\nand separation of three-dimensional boundary layers on spheres rotating in\naxial flow,” in Proceedings of the IUTAM Symposium on Lamina-\nturbulent Transition, Toulouse, France, 11–15 September 1989, edited by\nD. Arnal and R. Michel (Springer-Verlag, Berlin, 1990), pp. 551–557,\nA91–39901 16–34.\n30L. Rosenhead, Laminar Boundary Layers, 1st ed. (Oxford University\nPress, Oxford, 1963).\n31H. Evans, Laminer Boundary Layer Theory (Addison–Wesley, Reading,\nMA, 1968).\n32Ka´rma´n and T. von, “Uber laminare und turbulente Reiburg,” Z. Angew.\nMath. Mech. 1, 233 (1921).\n33Handbook of Mathematical Functions with Formulas, Graphs, and Mathe-\nmatical Tables, edited by M. Abramowitz and I. A. Stegun (Dover, New\nYork, 1972).\n34However, we will revert back to a rotating frame in Sec. V B where the\nnecessary amendments to the formulation are discussed.\n35R. J. Lingwood, “Absolute instability of the boundary layer on a rotating\ndisk,” J. Fluid Mech. 299, 17 (1995).\n36R. J. Lingwood, “Absolute instability of the Ekman layer and related\nflows,” J. Fluid Mech. 331, 405 (1997).\n37R. J. Lingwood, “An experimental study of absolute instability of the\nrotating-disk boundary-layer flow,” J. Fluid Mech. 314, 373 (1996).\n38J. J. Healey, “Model for unstable global modes in the rotating-disk bound-\nary layer,” J. Fluid Mech. 663, 148 (2010).\n114108-13 The instability of the boundary layer over a disk Phys. Fluids 23, 114108 (2011)\nDownloaded 30 Nov 2011 to 143.210.42.241. Redistribution subject to AIP license or copyright; see http:\/\/pof.aip.org\/about\/rights_and_permissions\n"}