{"doi":"10.1080\/01608061003756273","coreId":"15273","oai":"oai:dro.dur.ac.uk.OAI2:7951","identifiers":["oai:dro.dur.ac.uk.OAI2:7951","10.1080\/01608061003756273"],"title":"Outside the organization : the analysis of consumer behavior.","authors":["Hantula,  D.A.","Wells,  V.K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15273.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7951\/1\/7951.pdf","pdfHashValue":"2ed6376e0c85ef84edba55297f0816ac18d978b8","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7951<\/identifier><datestamp>\n      2012-08-23T14:09:01Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Outside the organization : the analysis of consumer behavior.<\/dc:title><dc:creator>\n        Hantula,  D.A. <\/dc:creator><dc:creator>\n        Wells,  V.K.<\/dc:creator><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Journal of organizational behavior management, 2010, Vol.30(2), pp.87-91 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7951<\/dc:identifier><dc:identifier>\n        issn:0160-8061<\/dc:identifier><dc:identifier>\n        issn: 1540-8604<\/dc:identifier><dc:identifier>\n        doi:10.1080\/01608061003756273<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7951\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/01608061003756273<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7951\/1\/7951.pdf<\/dc:identifier><dc:rights>\n        This is an electronic version of an article published in Hantula, D.A. and Wells, V.K. (2010) 'Outside the organization : the analysis of consumer behavior.', Journal of organizational behavior management., 30 (2). pp. 87-91.\\ud\nJournal of organizational behavior management is available online at: http:\/\/www.informaworld.com\/smpp\/ with the open URL of your article.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0160-8061"," 1540-8604","issn: 1540-8604","0160-8061"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n09 February 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHantula, D.A. and Wells, V.K. (2010) ’Outside the organization : the analysis of consumer behavior.’, Journal\nof organizational behavior management., 30 (2). pp. 87-91.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/01608061003756273\nPublisher’s copyright statement:\nThis is an electronic version of an article published in Hantula, D.A. and Wells, V.K. (2010) ’Outside the organization :\nthe analysis of consumer behavior.’, Journal of organizational behavior management., 30 (2). pp. 87-91. Journal of\norganizational behavior management is available online at: http:\/\/www.informaworld.com\/smpp\/ with the open URL\nof your article.\nAdditional information:\nSpecial Issue: Consumer behavior analysis.\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nCONSUMER BEHAVIOUR ANALYSIS \n \nAN INTRODUCTION TO THE SPECIAL ISSUE  \n \n \n \n \n \n \n \nIn this paper, we describe the nature of consumer behavior analysis, the development \nof a model of human consumer choice, and some of the research that it has inspired, \nand to draw some conclusions about the development of consumer behavior analysis. \nFirst, we describe the background thinking that inspired this work, notably by \nreference to the Behavioral Perspective Model as a device we have used to introduce \nbehavior analytical thinking into the consumer domain, and also to some of the \nresearch endeavor that this has led to. We turn, finally, to the contents of this issue \nand their relationship to the ongoing consumer behavior analysis research program.  \n \n \nTHE NATURE OF CONSUMER BEHAVIOR ANALYSIS    \nConsumer psychology is usually cognitive in orientation. Scores of consumer  \nbehavior texts assume this theoretical position without considering the philosophical \nimplications of the concepts on which they rely to explain choice, let alone offering \nany philosophical justification for the cognitive stance itself. It is rare for the writers \nof these texts, as it is for consumer psychologists generally, to consider that an \nalternative paradigm, behavior analysis, can assist in the explanation of consumer \nchoice. Yet there is a large volume of evidence to show that economic behavior is \nsensitive to environmental contingencies. Specifically, the subdiscipline of behavioral \neconomics is concerned with the combination of experimental economics and operant \npsychology to elucidate economic relationships. Much of the work in behavioral \neconomics has been concerned with nonhuman animals, though there is an increasing \ntendency to apply the methods developed in the operant chamber to a wide range of \napplied human problems. Consumer behavior analysis is the application of behavioral \neconomics to the sphere of human consumer choice, particularly in the context of \nadvanced marketing-oriented economies. Now, marketing brings a further level of \ncomplexity to what is already a multi-disciplinary exercise. There are considerations \nstemming from human marketing activity that are never encountered in the laboratory \nregardless of whether the subjects are human or nonhuman. The very concept of \nexchange, for instance, is either non-existent in the non-marketing environment or \nvery much less complicated. Considerations of price, which are easily replicable in \nexperiments, are compounded by those of advertising, distribution, and subtleties of \nproduct characteristics, as well as by issues of status consumption and interpersonal \neffects that are absent from behavioral economics work in non-marketing \nenvironments. It is the aim of consumer behavior analysis to comprehend marketing-\nled consumer choice in terms of behavior analysis: to understand how far the methods \nof behavioral economics can be transferred from their original contexts to the \nmarketing sphere, to recognize differences in human marketing behavior that require \nbehavioral economics to be modified, to arrive at the boundaries of a behavior \nanalytical interpretation of complex human behavior.  \n THE BEHAVIORAL PERSPECTIVE MODEL     \nThe BPM is an elaboration of the three-term contingency, modified to take into \naccount the complexities introduced by social and economic institutional \narrangements that govern marketing activity. Consumer choice takes place at the \nintersection of the consumer’s learning history and the current consumer behavior \nsetting, i.e., where the experience of consumption meets an opportunity to consume \nanew. This intersection of time and space forms the consumer situation, the \nimmediate shaper of approach—avoidance responses involved in purchase and \nconsumption. The consumer behavior setting is composed of the stimulus antecedents \nof that behavior, some of which will have been present on earlier consumption \noccasions. In the presence of the individual’s learning history, these initially neutral \nstimuli are transformed into the discriminative stimuli that set the occasion for current \nchoice; in particular, his or her consumption history invests them with kind of \nmeaning, i.e., the capacity to generate specific kinds of approach and or avoidance \nbehaviors which produce consequences that regulate the rate of recurrence of the \nbehaviors that produced them. The consumer situation consists also of motivating \noperations (MOs) such as rules that invest the consequences inherent in the \ndiscriminative stimuli with additional motivating or inhibitory power by making the \nconsequences of radical behaviorism appear more or less reinforcing, more or less \npunishing. \n \nLike the three-term contingency, then, the BPM specifies behaviorally \nantecedent stimulus conditions (the behavior setting) but combines the concepts of \ndiscriminative stimuli and motivating operations by means of the construct of \nbehavior setting scope, the extent to which these setting elements encourage or inhibit \nthe behavior predicted to occur in such settings. Behavior setting scope is \nconceptualized as a continuum from closed to open in which the former type of \nsetting permits one or at best a very few behaviors to be enacted within its confines, \nwhile the latter type permits a whole range of often competing behaviors to be \nenacted. \n \nThe consequences of behavior fall into three types: utilitarian reinforcement \nwhich consists in the functional outcomes of behavior, informational reinforcement, \nwhich stems from the symbolic outcomes, principally performance feedback, and \naversive\/punishing consequences, the costs of purchase and consumption. Such \naversive outcomes can themselves be subdivided into those that are utilitarian in \nnature and those that are symbolic. \n \n In summary, then, we are looking at consumer behavior as a function of \nutilitarian reinforcement, informational reinforcement, and aversive consequences.  \n \n \nOperant Classes of Consumer Behavior     \nBy combining high and low levels of utilitarian reinforcement and high and low levels \nof informational reinforcement, we can posit four operant classes of consumer \nbehavior as shown in Figure xx. This figure represents at this stage no more than a \nhypothesis and the labels attached to the four classes of consumer behavior are purely \narbitrary – though they have proved very useful in subsequent research.  \n \nThe four broad classes of consumer behavior which can be inferred from the pattern \nof high\/low utilitarian and informational reinforcement that maintains them are as \nfollows. \n \nAccomplishment is consumer behavior reflecting social and economic achievement: \nacquisition and conspicuous consumption of status goods, displaying products and \nservices that signal personal attainment.  \n \nHedonism includes such activities as the consumption of popular entertainment.  \n \nAccumulation includes the consumer behaviors involved in certain kinds of saving, \ncollecting, and installment buying.  \n \nFinally, Maintenance consists of activities necessary for the consumer’s physical \nsurvival and welfare (e.g. food) and the fulfillment of the minimal obligations entailed \nin membership of a social system (e.g. paying taxes).  \n \nNote that both types of reinforcer figure in the maintenance of each of the four \nclasses, though to differing extents. \n \n \nThe BPM Contingency Matrix      \nAdding in the scope of the current behavior setting, leads to the eightfold way \ndepicted here which shows the variety of contingency categories that exclusively \nconstitute a functional analysis of consumer behavior. Let us take a closer look at the \nfour broad operant classes of consumer behavior with the added complexity of \nconsumer behavior setting scope added in. \n \nAccomplishment \n Accomplishment in an open setting consists in general in the purchase and \nconsumption of status goods. A familiar instance is pre-purchase consumer behavior \nfor luxuries and radical innovations such as exotic vacations and iPhones. These \nbehaviors, including window-shopping and browsing, involve search for and \ncomparative evaluation of information about many products and services. Most of the \nitems in question are possessed and used for the pleasure or ease of living they confer, \nthe wellbeing they make possible for the individual: they thereby provide extensive \nhedonic rewards. But they are often status symbols and their conspicuous \nconsumption also strengthens the behavior in question. They attest directly, and often \npublicly and unambiguously, to the consumer's attainments, especially economic. \nGoods in this category are usually highly differentiated — by novel function in the \ncase of innovations, by branding in the case of luxuries. \n In a closed setting, Accomplishment can be generally described as fulfillment. \nIn such a context, it comprises personal attainments gained through leisure, often with \na strong element of recreation or excitement as well as achievement. This category \nrefers to the material contribution to fulfillment and could include both the completion \nof a personal development seminar such as Insight and gambling in a casino. \nGambling in so closed a setting is an activity maintained by both hedonic and \ninformational consequences. In addition, few consumer behaviors are maintained so \nthoroughly by social rules. All these elements of the setting unambiguously signal \nboth the positive consequences of approved approach behaviors and the potentially \npunishing implications of escape or avoidance responses which flout established rules \nand gaming conventions. Although several games may be available in the casino, \nthere is one principal reinforcer: winning. Pleasure and social approval stem mainly \nfrom success, though a certain amount of enjoyment and prestige may be derived \nfrom being part of a somewhat exclusive social group and conforming to its code of \nbehavior. Closely defined acts must be performed in order to participate, including \nobtaining membership, dressing appropriately, entering the game at the right time and \nin an acceptable manner. \n \nHedonism \n In an open setting, this behavior generally consists of popular entertainment. \nObvious examples are watching television game shows which provide near-constant \nhedonic reward, and the reading of mass fiction which contains a sensation on almost \nevery page. iPods and DVDs have made such reinforcement more immediate to the \npoint of its being ubiquitous. Mass culture presents frequent and predictable, \nrelatively strong and continuous hedonic rewards which are not contingent on long \nperiods of concentrated effort. Indeed, the arrangement of reinforcers is such that \nviewing, listening or reading for even a short interval is likely to be rewarded. \nInformational feedback is more obvious on some occasions than others, as when game \nshows allow the audience to pit their own performances against that of the competing \nparticipants, but it is not the main source of reward. \n Hedonism in closed settings consists as a generalization of inescapable \nentertainment and amelioration. The behaviors in question are potentially pleasurable \nbut — in this context — may be irksome because they are unavoidable. As a result, \nconsumption of these products and services may be passive rather than active. An \nexample is the situation in which long distance airline passengers must purchase \nmeals and movies along with their travel. The meals are usually consumed, like the \nin-flight movies which follow them, without alternative. The setting, which cannot be \nother than highly restrictive if one is to arrive safely, is further closed by the pulling \nof blinds, the disappearance of cabin staff, the impossibility of moving around the \nplane, and the attention of one's fellow passengers to the movie. To try to read or \nengage in other activities may even invite censure. \n \nAccumulation \n In an open setting, Accumulation is generally described as saving and \ncollecting. For example, purchases for which payments are made prior to \nconsumption -- installments for a holiday which can only be taken once the full \namount has been paid. Another example is payments into a Christmas club. \nDiscretionary saving with the intention of making a large purchase once a certain \namount has accumulated, would fall into this category, too. Promotional deals \nrequiring the accumulation of coupons or other tokens before a product or service can \nbe obtained also belong here. The important reward, in every case, is informational, \nfeedback on how much one has accumulated, how close one is to the ultimate \nreinforcer. \n Accumulation occurring in a closed setting may be described, in general \nterms, as token-based buying. This also involves collecting — through schemes in \nwhich payment for one item provides tokens which will pay for another. Although \nsome examples of this are quite recent, the practice is simply an extension of the \nfamiliar prize schemes open to collectors of cigarette cards or trading stamps. For \nexample, the ―air-miles‖ earned by frequent flyers on domestic and international \nairlines constitute informational reinforcers (Foxall, 1997b). Some hotels also offer \ngifts to customers who accumulate points by staying there frequently. The collection \nof these tokens is reinforced by gaining additional free air travel or hospitality, or by \naccess to different types of reinforcer such as prizes. Purchase and consumption of the \nbasic product, the air travel or accommodation originally demanded are maintained by \nboth the intrinsic hedonic rewards they embody and the feedback on progress that is \nbeing made toward the ultimate incentive. The setting is relatively closed because the \nfirst item would probably be purchased anyway in some form or other and the \nconsumer's income constraint makes it likely that the second or backup reinforcer \nwould be obtained only in this way. \n \nMaintenance \n In an open setting, Maintenance may be generally described as routine \npurchasing and consumption. This includes the regular buying of goods necessary for \nsurvival. For example, the habitual purchasing of grocery items at a supermarket. \nConsumer behavior in these circumstances is indeed routine: it occurs as if \nreinforcement were available only at fixed intervals. Further, contrary to the usual \ndepiction, the frequent consumer of , say, baked beans is highly rational, having tried \nand evaluated many brands in the relevant product class. But his or her behavior is not \nstatic: again in contrast to the received wisdom of the marketing texts, comparatively \nfew such consumers are brand loyal in the sense of always choosing the identical \nbrand in a long sequence of shopping trips. There is so much choice that the consumer \nenjoys considerable discretion among versions of the product (Ehrenberg, \n1988\/1972). \n Maintenance is generally characterized in closed settings as mandatory \npurchase and consumption. It includes all forms of consumer behavior necessary to \nremain a citizen: the payment of taxes for public and collective goods, for instance; \nless extremely, it includes payments into pension schemes linked to employment, \npayments of endowment insurance premiums linked to mortgages. To this extent, \nMaintenance is the consumer behavior inherent in pursuing the normal business of \ncitizenship. In the workplace, it may include the enforced use of areas under smoking \nbans which, for smokers, represent a severe limitation on behavior (though for \nnonsmokers, particularly the allergic, they constitute an opening of the setting, a \nmeasure that permits a wider range of behaviors). \n \n \nRESEARCH         \n \nThree strands of research exemplify the attempt to test the model: the prediction of \nverbal behavior with respect to consumers’ emotional responses to retail and \nconsumption environments, the application of matching and maximization techniques \nto consumer choice, and the analysis of consumer demand. We are also developing \nexperimental work and a methodology of case study, but I will concentrate here on \nthe first three. \n \nVerbal behavior and emotional response     \nThe first aim was to test the model as a whole, to understand whether (and if so how) \nthe three structural variables of setting scope, utilitarian reinforcement and \ninformational reinforcement interacted. The first study, undertaken in England, \nemployed A tripartite classification of verbal responses to the emotions engendered \nby different environments, based on Mehrabian and Russell’s theory of environmental \npsychology. The three dominant emotions are pleasure, arousal, and dominance. The \nverbal measures of these emotions were interpreted as predictable in various \nconsumer contexts defined by the BPM. Utilitarian reinforcement was proposed as \nengendering the verbal responses that Mehrabian and Russell proposed to measure \npleasure which implied satisfaction and utility. Informational reinforcement, the \nverbal responses related to arousal which emphasize environmental feedback and the \nmonitoring of changing circumstances. The scope of the consumer behavior setting \nwas assumed to correspond to the verbalizations that M&R linked to dominance \n(being in control as opposed to being subject to another).  \n \nThis is not the kind of research framework that experimental behavior analysis would \nenjoin upon us, but it seems particularly appropriate for the testing of what is \nessentially an interpretive device for understanding complex human behavior rather \nthan an experimental technique for use in the closed settings of the operant laboratory. \n \nBoth the predictions and the results of this work are shown here. The expectations of a \nlarger pleasure score for higher utilitarian reinforcement, denoted by an uppercase as \nopposed to a lower case P was borne out. Similarly a larger arousal score was found \nfor greater informational reinforcement (denoted by A), and a larger dominance score \ncharacterized a more open consumer behavior setting scope (D).  \n \nThe results indicate that by using P, A and D, as predicted verbal responses to the \nconsumer situations defined by the BPM contingency matrix, it is possible to make \nuseful predictions of consumer behavior. This work has been replicated in Venezuela, \nin Spanish, with similar results.  \n \n \nMatching and maximization \nWe turn now to a research area much closer to the heart of behavioral economics. An \nimportant debate in the evolution of behavioral economics has been – and to some \nextent remains – the question whether consumers maximize in some sense or follow \nsome other decision rule such as satisficing. Controversy has long surrounded \neconomists’ assumption that consumer behaviour maximizes utility (or the satisfactions \nobtained from owning and using economic products and services).  \nFailure to generate definitive experimental data has not deterred these behavioral \nscientists from suggesting, in the absence of any direct evidence, how the behaviour of \nhuman consumers is related to the system of rewards that ostensibly maintains it. The \napplication has, however, devised and tested a method of obtaining data on consumers' \npurchase choices over time which have direct relevance to our understanding more \nclearly how consumer choice is distributed over a sequence of purchase occasions, and \nwhen such behaviour can be said to maximize.  \n \nMatching refers to the tendency of animals and humans to distribute their \nresponses between two choices in proportion to the patterns of reward programmed to be \ncontingent on each choice. Herrnstein discovered, defined and built upon this \nphenomenon. Defining choice not as an internal deliberative process but as a rate of \nintersubjectively observable events that are temporally distributed, Herrnstein’s \ndependent variable was not the single response that needed contextual explication in \nterms of a single contingent reinforcer: it was the relative frequency of responding, \nwhich he explained by reference to the relative rate of reinforcement obtained from \nthe behavior.  \n \nMost choices for human consumers require the allocation of a fixed income between \nalternative choices, each of which exacts a different monetary sacrifice. In this case, \nresponses take the form of surrendering money in varying amounts, while the reward is \nthe receipt of a fixed amount of the good in question. Price is the ratio of units of money \nthat must be exchanged for units of the good. Both matching and maximizing theories \nmake a similar prediction of behaviour on such schedules: the individual will maximize \nby exclusively selecting the schedule that provides the higher return. Studies of animal \nchoice confirm this prediction. \n \n Matching, then, is the tendency of individual organisms to allocate responses \namong alternatives in proportion to the reinforcement obtained from each. The \nmatching relationship is represented by the Generalized Matching Law (Baum, 1974): \n \nlog (B1\/B2) = s log (R1\/R2) + log  b                                              (1) \nwhere B1 and B2 are the allocations of behavior to choices 1 and 2 respectively, R1 \nand R2 are the rates of reinforcement derived from choices 1 and 2 respectively, b is a \nmeasure of bias in favor of either B1 or B2 that stems from factors other than the \nschedules of reinforcement in operation, and s is the sensitivity of the behavior ratio \n(B1\/B2) to the reinforcement ratio (R1\/R2).  \n The parameter log b or bias constitutes the intercept of the linear log-log \nformulation of the law. Deviations of this parameter from unity are interpreted as \nindicating a consistent preference for one option independently of its reinforcement \nrate schedule. Such bias is generally a result of experimental artifacts that could make \none response less costly than the other. The exponent s constitutes the slope of the \nlinear log-log formulation, and corresponds to a deviation from ideal matching (s = 1), \nindicating that the individual favors the richer (s>1, overmatching) or the poorer (s<1, \nundermatching) schedule of reinforcement more than predicted by the matching law. \nFurthermore, research using matching analysis with qualitatively different reinforcers \n(e.g. food and water) has shown to be an exception to the predictions of matching law. \nWhen using qualitatively different commodities, as gross complements (i.e. when an \nincrease on the consumption of one product requires the increase of the consumption \nof a second product, as is the case with food and water), it has been found that choice \nratio has an inverse relationship with the reinforcement ratio, showing the exact \nopposite of what the matching law predicts. Hence, this particular effect has been \nnamed antimatching, and in operational terms it consists of a result of s<0 in the \ngeneralized matching equation. \nOn the assumption that s is a measure of the substitutability of the choice \nalternatives available, under- or over-matching and anti-matching presumably indicate \nsome level of the independence or complementarity of these options. Another \nassumption of our empirical work was that the price structures faced by consumers \nresemble the ratio schedules. As predicted in the case of behavior on such schedules, \nconsumers should both match and maximize by always selecting the most favorable \noption, the cheapest alternative. By and large, our analyses found both patterns: brand \ncompetition was generally marked by ideal matching, while product choices, as \ndemonstrated here by wine and cola purchases by some degree of under-, over- or \nanti-matching. Relative demand curves were generally down-ward sloping. Again \nwith some exceptions, consumers maximized by purchasing the least expensive of the \nbrands composing their considerations sets – shown here by their consistently \nselecting to the right of the midpoint.  \n \n Where there were exceptions from the predictions of matching and \nmaximizing theories, they occurred for reasons peculiar to the marketing context: \nfirst, because the composition of consumers’ consideration sets often meant that their \nselections were among premium priced, higher quality brands, or at least those more \nhighly differentiated through promotional activity, rather than among all of the brands \nthat made up the product category. As a result, their selecting the least expensive \nbrand refers only to their choosing within the limitations of this subset of available \nproduct versions. A second source of exception was that some consumers bought \nmore than one brand on a single shopping trip, often adding a rather more expensive \nbrand to the cheapest within their consideration set. No doubt the different brands \nwere intended for distinct situations of usage, as when a standard and less expensive \nfruit juice is purchased for consumption by children of the household in the course of \nthe day and a more expensive version is obtained for the family’s use at breakfast. \nThe sheer desire for variety sometimes led consumers to select a more expensive \nbrand on occasion, either in addition to or instead of the cheapest alternative. In the \nqualitative phase of the research one respondent reported that she ―just had to‖ buy a \ndistinctively-flavored brand of butter from time to time; another, that she would \npurchase a cheaper store brand sometimes even though this was not part of her regular \nrepertoire simply as a result of the convenience of shopping at a different \nsupermarket. But, apart from these predictable exceptions, the predictions of both \nmatching and maximization theories were fulfilled. Although matching is a truism in \nthe case of consumer choice – the more one buys, the more one spends, and at more \nor less constant prices the relative amount spent on one brand will be proportionally \nsimilar to the relative amount of it that is bought – these studies have clarified a \nnumber of matters in marketing and consumer research.       \n \n \nConsumer demand analysis \n \nMuch of the work on demand analysis has involved comparison of the buying \npatterns of consumers grouped by their predominant purchasing of brands having \nspecific patterns of informational and utilitarian reinforcement. Hence, consumers \nwere classified in one of six groups, derived from the combination of the three levels \nof informational and the two levels of utilitarian reinforcement, on the basis of the \ninformational-utilitarian level of the brands they bought more frequently. The six \ngroups were named as follows: Group 1 - Informational Level 1 and Utilitarian Level \n1; Group 2 - Informational Level 1 and Utilitarian Level 2; Group 3 – Informational \nLevel 2 and Utilitarian Level 1; Group 4 – Informational Level 2 and Utilitarian Level \n2; Group 5 – Informational Level 3 and Utilitarian Level 1; and Group 6 – \nInformational Level 3 and Utilitarian Level 2.  \nGroups’ buying patterns were compared in terms of elasticity of demand, \nusing the equation         \n \n \nLog Quantity = a - b (Log Price)      (2) \nas suggested by Kagel et al. (1995). \n \n           \nAll regressions, using the above equation (calculated with relative measures of \nquantity and price), were statistically significant (i.e., p < .000 for all groups). The \nvalues of R\n2\n were not very large and ranged from .22 to .46, indicating that other \nvariables that did not enter the equation also influenced the quantities consumers \nbought. The values of standard error were all ten or more times smaller than the \ncorresponding coefficients of price elasticity, b, suggesting accurate estimations of the \nlatter. All price elasticity coefficients were negative indicating that the quantity \nconsumers bought tended to decrease with increases in price. Moreover, all \ncoefficient values were between zero and –1.0, indicating that demand was inelastic \nfor all consumer groups. Despite these similarities, the absolute values of elasticity \ncoefficients were lower for the extreme groups, Groups 1 and 6, than for the other \ngroups, suggesting that consumers that buy predominantly intermediate-level brands \nshowed higher price responsiveness than those buying predominantly the least- and \nhighest-differentiated brands (split-sample reliability analyses confirm this trend).  \n \nIntra- and inter-brand elasticities \nThe observed decreases in the quantity bought with increases in prices, \nindicated by negative elasticity coefficients, may, however, have been associated with \ndifferent response patterns by different groups. The tendency to buy larger quantities \nwhen prices are lower may be related to one or more of the following three patterns:  \n \n1) buying larger quantities of a product when its price was below its usual, \naverage, price rather than when its price was above its average price (i.e., intra-brand \nor absolute elasticity); 2) buying larger quantities when buying brands belonging to \ncheaper, lower informational levels than when buying brands belonging to more \nexpensive, higher informational levels (i.e., informational inter-brand or relative \nelasticity); and 3) buying larger quantities when buying brands belonging to cheaper, \nlower utilitarian levels than when buying brands belonging to more expensive, higher \nutilitarian levels (i.e., utilitarian inter-brand or relative elasticity).  \n \nOne way of measuring such patterns is to decompose the global price elasticity \ncoefficient into three different coefficients, namely, intra-brand, informational inter-\nbrand, and utilitarian inter-brand coefficients. This analysis would yield an equation \nin which the quantity bought would be a function of intra-brand changes in price, \ninformational reinforcement levels of the purchased brands, and the utilitarian \nreinforcement levels of the purchased brands, that is,  \n \nLog Quantity = a – b1 (Log Intra-Brand Price) – b2 (Log Informational  \nLevel) – b3 (Log Utilitarian Level).    (3) \n \nAll regressions were statistically significant (i.e., p < .000 for all groups). The \nvalues of R\n2\n were not very large and ranged from .06 to .36, indicating that other \nvariables that did not enter the equation also influenced the quantities consumers \nbought. Only three, out of 18, values of standard error were ten or more times smaller \nthan the corresponding coefficients of price elasticity, b, suggesting that coefficient \nestimations were not very accurate (although split-sample reliability analyses \ncorroborated the observed patterns). Collinearity analyses yielded values of tolerance \nand VIF close to 1.00, suggesting that there was no significant covariance among \nvariables included in the equation. All price elasticity coefficients were negative \nindicating that the quantity consumers bought tended to decrease with increases in \nintra-brand price variations, informational level and utilitarian level. Moreover, with \nthe exception of the intra-brand coefficient for Group 2 (-1.51), all coefficient values \nwere between zero and –1.0, indicating that all three types of demand tended to be \ninelastic for all consumer groups. Despite such similarities, the absolute values of \nintra-brand, informational inter-brand, and utilitarian inter-brand elasticity \ncoefficients differed across consumer groups, as shown in here: \n \nIntra-brand elasticity coefficients were lower for Groups 1 and 6 than for the \nintermediate groups, showing a decreasing trend from Group 2 to Group 6. This \nsuggests that consumers buying predominantly the cheapest, least-differentiated \nbrands (i.e., Group 1) do not change much the quantity they buy as a function of \nchanges in brand price relative to their usual (average) price. This result suggests a \ntendency of buying the cheapest brands, irrespective of other, a little more expensive, \nbrands. If this interpretation is correct, the observed pattern for intra-brand elasticity, \nwhich was largest for Group 2 and decreased systematically as group classification \nincreased up to Group 6, can be interpreted as suggesting that responsiveness to intra-\nbrand changes in price decreases as group classification increases. In other words, if \nthe low intra-brand elasticity observed for Group 1 is a consequence of buying the \ncheapest brands most of the time, these findings point to the conclusion that as the \nlevel of differentiation of the purchased brands increases (i.e., as the price of \npurchased brands increases), the responsiveness of consumers to changes in prices \ndecreases.  \nInformational inter-brand elasticities were smaller than intra-brand elasticities \nfor all six groups and followed a similar pattern, with Group 1 showing a low \ncoefficient, Group 2 showing the largest one which decreases systematically with \nincreases in group classification up to Group 6. This suggests that consumers buying \nmostly the least-differentiated, cheapest brands do not change much the quantities \nthey buy as a function of informational brand level, whereas the responsiveness to \ninformational reinforcement of those buying intermediate-level brands decreases \nsystematically with increases in the informational level of the predominantly \npurchased brands. This value is close to zero for Group 6, suggesting that consumers \nthat already usually buy the highest informational and utilitarian level brands are not \nsensitive to changes in informational level (similar to a ―satiation‖ effect, since \nsatiated animals are not expected to be responsive to food, i.e., to do things to get \nfood).  \nUtilitarian inter-brand elasticity, indicated by the filled circles, was higher for \nthe three groups that bought predominantly low utilitarian-level brands (i.e., Groups \n1, 3 and 5) than for the other three that bought high utilitarian-level brands. This \nfinding indicates that consumers who buy predominantly brands with low utilitarian \nlevels tend also to buy smaller quantities of higher utilitarian brands, whereas those \nthat buy predominantly brands with high utilitarian levels do not seem to vary much \nthe quantities they buy as a function of utilitarian brand level. Hence, the utilitarian \ninter-brand elasticities followed a slightly different pattern from the informational \ninter-brand elasticities, though like them they were mostly smaller than intra-brand \nelasticities. Group 1 is the only exception with a coefficient larger than that of the \nintra-brand elasticities, if only marginally. Whereas the other two curves follow a \nsimilar pattern, the shape of the utilitarian curve is different in that it follows a zigzag \ncourse with Group 2 showing a lower coefficient than Group 1 and 3, and similarly \nGroup 4 and 6 displaying a lower coefficient than their neighbor groups. The \nimplications of this pattern are more complicated because it suggests that consumers \nbuying mostly at utilitarian level 1, i.e. Groups 1, 3 and 5, are more sensitive to \nchanges in utilitarian level than consumers with a preference for utilitarian level 2, \nindependent of the informational level of the brand. For example, consumers who \nmostly buy the least-differentiated, cheapest brands (i.e. Group 1) are more likely to \nbuy larger quantities than consumers who buy at but a higher utilitarian but at the \nsame informational level (i.e. Group 2). Consumers of Group 3 however, with a lower \nutilitarian level than Groups 2 and 4 but a higher informational level than Group 2 and \nthe same informational level as Group 4, is in turn more responsive to utilitarian \nreinforcement than both Group 2 and 4.  \n \nCombining Matching and Demand Analysis \nFinally we would like to mention, albeit briefly, some work that is in progress right \nnow. The combination of matching analysis and elasticity of demand has led to the \ntesting an equation that relates amount spent to quantity bought, utilitarian \nreinforcement obtained, informational reinforcement obtained, and price paid (which \ndetects promotions).  \n \n The results for a single product so far – the humble but ubiquitous baked bean \n– indicate that the expected relationships between all these variables were found, and \nthat – very reassuringly – the R2 value is high.  \n \n \n"}