{"doi":"10.1016\/S0921-8009(00)00135-X","coreId":"208507","oai":"oai:eprints.lse.ac.uk:18906","identifiers":["oai:eprints.lse.ac.uk:18906","10.1016\/S0921-8009(00)00135-X"],"title":"In defense of historical accountability for greenhouse gas emissions","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17236114,"title":"Allocating CO2-Emissions by Using Equity Rules and Optimization,","authors":[],"date":"1992","doi":null,"raw":"Janssen,  M.A.,  den  Elzen,  M.G.J.  and  Rotmans,  J.,  1992.  Allocating  CO2-Emissions  by  Using  Equity  Rules  and  Optimization,  RIVM,  Report  nr. 222901012.  Dutch  National  Institute for Public Health and the Environment, Bilthoven.","cites":null},{"id":17236122,"title":"Allocating Responsibility for Global Warming: The Natural Debt Index.","authors":[],"date":"1991","doi":null,"raw":"Smith,  K.,  1991.  Allocating  Responsibility  for  Global  Warming:  The  Natural Debt Index. Ambio, 20: 95-96.","cites":null},{"id":17236118,"title":"Anarchy, State and Utopia.","authors":[],"date":"1974","doi":"10.1007\/978-3-531-90400-9_89","raw":"Nozick, R., 1974. Anarchy, State and Utopia. Blackwell, Oxford.","cites":null},{"id":17236065,"title":"Climate Change 1995: The Science of Climate Change— Contribution of Working Group I to the Second Assessment Report of the Intergovernmental Panel on Climate Change.","authors":[],"date":"1996","doi":"10.1016\/s0959-3780(97)82913-5","raw":"IPCC, 1996. Climate Change 1995: The Science of Climate Change— Contribution of Working Group I to the Second Assessment Report of the Intergovernmental Panel on Climate Change. Cambridge University Press, Cambridge.","cites":null},{"id":17236064,"title":"Climate Negotiations: The North\/South Perspective. In: I.M. Mintzer (Editor), Confronting Climate Change: Risks, Implications and Responses.","authors":[],"date":"1992","doi":"10.1017\/cbo9780511608292.023","raw":"Hyder, T.O., 1992. Climate Negotiations: The North\/South Perspective. In: I.M. Mintzer  (Editor),  Confronting  Climate  Change:  Risks,  Implications  and Responses. Cambridge University Press, Cambridge: 323-336.","cites":null},{"id":17236059,"title":"Global Warming in an Unequal World. Centre for Science and Environment,","authors":[],"date":"1991","doi":null,"raw":"Agarwal, Anil and Suita Narain, 1991. Global Warming in an Unequal World. Centre for Science and Environment, New Delhi.","cites":null},{"id":17236138,"title":"Global Warming Negotiations: Does Fairness Matter?.","authors":[],"date":"1991","doi":null,"raw":"Young, H. P. and Wolf, A., 1991. Global Warming Negotiations: Does Fairness Matter?. Brookings Review, 10: 46-51. 20 ENDNOTES 1 If instead of a base year, future projected business-as-usual emissions or populations are the reference points, the formulas have to be slightly modified.","cites":null},{"id":17236116,"title":"International Environmental Law - Primary Materials. Kluwer Law and Taxation Publishers,","authors":[],"date":"1991","doi":null,"raw":"Molitor, M.R. (Editor), 1991. International Environmental Law - Primary Materials. Kluwer Law and Taxation Publishers, Deventer\/Boston.","cites":null},{"id":17236134,"title":"Kyoto Protocol to the United Nations Framework Convention on Climate Change.","authors":[],"date":"1997","doi":"10.1017\/cbo9781139171380.013","raw":"United Nations, 1997. Kyoto Protocol to the United Nations Framework Convention  on  Climate  Change.  New  York,  online  available  at http:\/www.unfccc.de.","cites":null},{"id":17236060,"title":"On the Influence of Carbonic Acid","authors":[],"date":null,"doi":"10.1086\/121158","raw":"Arrhenius,  S.,  1896.  On  the  Influence  of  Carbonic  Acid  in  the  Air  Upon  the Temperature on the Ground. Philosophical Magazine and Journal of Science S15, 41: 237-276.","cites":null},{"id":17236120,"title":"Recommendation on the Implementation of the Polluter-pays Principle,","authors":[],"date":"1974","doi":"10.1163\/ilwo-vj6","raw":"OECD,  1974.  Recommendation  on  the  Implementation  of  the  Polluter-pays Principle, C(74)223. OECD, Paris. 19 Rose, A., Stevens, B., Edmonds, J. and Wise, M., 1998. International Inequality and  Differentiation  in  Global  Warming  Policy.  Environmental  and  Resource Economics, 12: 25-51.","cites":null},{"id":17236063,"title":"Seeking Fair Weather: Ethics and the International Debate on Climate Change.","authors":[],"date":"1995","doi":"10.2307\/2624836","raw":"Grubb, M., 1995. Seeking Fair Weather: Ethics and the International Debate on Climate Change. International Affairs, 71: 463-496. 18 Grubb, M., Sebenius, J., Magalhaes, A. and Subak, S., 1992. Sharing the Burden. In: I.M. Mintzer (Editor), Confronting Climate Change: Risks, Implications and Responses. Cambridge University Press, Cambridge: 305-322.","cites":null},{"id":17236062,"title":"Structuring the Equity Issue in Climate Change. In: A.N. Achanta (Editor), The Climate Change Agenda - An Indian Perspective. Tata Energy Research Institute,","authors":[],"date":"1993","doi":null,"raw":"Ghosh,  P.,  1993.  Structuring  the  Equity  Issue  in  Climate  Change.  In:  A.N. Achanta (Editor), The Climate Change Agenda - An Indian Perspective. Tata Energy Research Institute, New Delhi: 267-274.","cites":null},{"id":17236130,"title":"The Basics of Greenhouse Gas Indices. In:","authors":[],"date":"1995","doi":null,"raw":"Smith,  K.,  1995:  The  Basics  of  Greenhouse  Gas  Indices.  In:  P.  Hayes  and  K. Smith (Editors), The Global Greenhouse Regime: Who Pays?. Earthscan, London: 20-50.","cites":null},{"id":17236061,"title":"The Equitable International Allocation of Tradable Carbon Emission Permits.","authors":[],"date":"1995","doi":"10.1016\/0959-3780(95)00054-r","raw":"Beckerman, W. and Pasek, J., 1995. The Equitable International Allocation of Tradable Carbon Emission Permits. Global Environmental Change, 5: 405-413.","cites":null},{"id":17236132,"title":"United Nations Framework Convention on Climate Change.","authors":[],"date":"1992","doi":"10.1017\/cbo9781139171380.012","raw":"United  Nations,  1992.  United  Nations  Framework  Convention  on  Climate Change. New York, online available at http:\/www.unfccc.de.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-05","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/208507.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/18906\/1\/__Libfile_repository_Content_Neumayer%2C%20E_In%20defense%20of%20historical%20accountability%20for%20greenhouse%20gas%20emissions_In%20defense%20of%20historical%20accountability%20for%20greenhouse%20gas%20emissions%20%28LSE%20RO%29.pdf","pdfHashValue":"4b2dd6b6c5b67859c85c56489b641d2f3273bbf9","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:18906<\/identifier><datestamp>\n      2012-08-13T13:22:25Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/18906\/<\/dc:relation><dc:title>\n        In defense of historical accountability for greenhouse gas emissions<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2000-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/18906\/1\/__Libfile_repository_Content_Neumayer%2C%20E_In%20defense%20of%20historical%20accountability%20for%20greenhouse%20gas%20emissions_In%20defense%20of%20historical%20accountability%20for%20greenhouse%20gas%20emissions%20%28LSE%20RO%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2000) In defense of historical accountability for greenhouse gas emissions.  Ecological Economics, 33 (2).  pp. 185-192.  ISSN 0921-8009     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/503305\/description#description<\/dc:relation><dc:relation>\n        10.1016\/S0921-8009(00)00135-X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/18906\/","http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/503305\/description#description","10.1016\/S0921-8009(00)00135-X"],"year":2000,"topics":["GE Environmental Sciences"],"subject":["Article","PeerReviewed"],"fullText":"  \nEric Neumayer \nIn defense of historical accountability for \ngreenhouse gas emissions \n \nArticle (Accepted version) \n(Refereed) \n \nOriginal citation: \nNeumayer, Eric (2000) In defense of historical accountability for greenhouse gas emissions. \nEcological economics, 33 (2). pp. 185-192. ISSN 0921-8009  \n \nDOI: 10.1016\/S0921-8009(00)00135-X  \n \n© 2000 Elsevier Science \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/18906\/  \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \nElectronic copy available at: http:\/\/ssrn.com\/abstract=224089\n1 \n \nIn Defence of Historical Accountability \nfor Greenhouse Gas Emissions \n \n \n \n \nPublished in: \nEcological Economics, 33 (2), 2000, pp. 185-192 \n \n \n \n \n \nEric Neumayer \n \nCorresponding address: \nDepartment of Geography and Environment, London School of Economics and \nPolitical Science, Houghton Street, London WC2A 2AE, United Kingdom \nTel: +44-171-955-7598. Fax: +44-171-955-7412. \nEmail: e.neumayer@lse.ac.uk \n \nElectronic copy available at: http:\/\/ssrn.com\/abstract=224089\n2 \n \nIn Defence of Historical Accountability \nfor Greenhouse Gas Emissions \n \nAbstract \nThis commentary argues in defence of equal per capita emissions with historical \naccountability as a general rule for allocating the right to emit greenhouse \ngases. Historical accountability takes into account historical inequalities in per \ncapita emissions. Implicitly it gives every human being an equal share of the \nglobal resource atmosphere, independent of place or time. Three reasons are \nput forward to argue why historical accountability should be the guiding prin-\nciple for an international agreement allocating rights of emissions. In addition, \nas it has been dismissed by many scholars, six arguments are given to refute \nobjections against historical accountability. \n \nKeywords: Global warming; Emission rights; Historical accountability; Alloca-\ntion rules; Kyoto protocol \n \n \nAcknowledgement \nThis paper has benefited from discussions with Ademar Romeiro and Mauricio \nde Carvalho Amazonas, both from Instituto de Economia at Unicamp, Campi-\nnas, São Paulo, and both leading members of the Brazilian chapter of the Inter-\nnational Society for Ecological Economics (ECO-ECO). I would like to thank \nthree anonymous referees for very helpful comments. All remaining errors are \nmine. Financial assistance from the European Commission’s (DG XII) Marie \nCurie Research Scheme on Climate and Environment and from the LSE’s staff \nresearch fund is gratefully acknowledged. \n3 \n \n‘The idea that developing countries like India and China must share the \nblame for heating up the earth and destabilising its climate (...) is an excel-\nlent example of environmental colonialism.’ (Agarwal and Narain, 1991, p. 1). \n \n1. Introduction \nAllocating rights to greenhouse gas emissions will always be a most contentious \nissue, no matter what the total reduction rate. Indeed, the more overall reduc-\ntion takes place, the more contentious will the allocation rule be. Parties to a \ntreaty aiming for reductions of greenhouse gas emissions pay high attention to \nwho has to reduce emissions and by how much, as can be seen from the ex-\nhausting negotiations that took place leading to the Kyoto Protocol in late 1997 \n(United Nations, 1997). \nThere are many different general rules on how to allocate rights to emit \ngreenhouse gases. The most prominent ones are allocation proportional to \nemissions in a specified base year or future business-as-usual projected emis-\nsions (a rule known as ‘grandfathering’), allocation on an equal per capita basis \nwithout historical accountability and allocation on an equal per capita basis \nwith historical accountability — or any mixture thereof. The ‘grandfathering’ \nrule regards differences in base year or future projected business-as-usual per \ncapita emissions as basically justified, as these differences are prolonged into \nthe future. The second rule regards unequal per capita emissions as unjustified \nand allocates future emission rights on an equal per capita basis, but disregards \nhistorical inequalities of emissions. The third rule is different from the equal per \ncapita rule only in that differences in historical emissions are also taken into \naccount. It holds countries accountable for the amount of greenhouse gas emis-\n4 \n \nsions remaining in the atmosphere emanating from a country’s historical emis-\nsions. It demands that the major emitters of the past also undertake the major \nemission reductions in the future as the accumulation of greenhouse gases in \nthe atmosphere is mostly their responsibility and the absorptive capacity of na-\nture is equally allocated to all human beings no matter when or where they live. \nHistorical accountability is also known under the name ‘natural debt’ and has \nbeen pioneered by Grübler and Fujii (1991) and Smith (1991). \nThese allocation rules can be defined formally. Assume, for simplicity of ex-\nposition, that a treaty encompassing all countries specified a worldwide emis-\nsion target for each year t over a future time period of T years (t = 1,...,T). Then \nthe rules can be defined in their most simple form as follows: \nw\nw\nx\nx\nt\nb\nb\nit\ni ⋅=   (allocation proportional to base year emissions) \nw\nPop\nPop\nx\nt\nb\nw\nb\nit\ni ⋅=  (allocation on an equal per capita basis without historical \naccountability) \nwhere xti  is country i‘s allocation of emissions for each target year t, x\nb\ni  are \ncountry i‘s emissions in a specified base year (which might or might not be the \ncurrent year), wb  are base year world emissions and wt  are world target emis-\nsions for the year t. Popbi  is country i‘s base year population and Pop\nb\nw\n is base \nyear world population.1 \nThe same rule, but with historical accountability, is not quite as straightfor-\nward to formalise. First of all, we have to explicate what we mean by ‘historical \naccountability’. Define the Historical Emission Debt (HEDi ) of a country i as fol-\nlows: \n5 \n \n∑\n\n\n\n\n\n\n\n\n⋅−=\n=\ne\nsj ww\ni\nii jyjPop\njPopjyHED )()(\n)()(  \nwhere s is the start year, e is the end year of accounting (which need not be \nidentical to b), )( jPopi  and )( jPopw  are defined as above for year j, )( jyi  and \n)( jyw  are country i‘s and world emissions from year j, which are still remaining \nin the atmosphere in the end year of accounting. \nThe idea behind historical accountability is that countries which have in the \npast emitted in excess of an equal per capita allocation should have less than \ntheir equal per capita allocation of emission rights in the future and vice versa \nfor countries which have in the past emitted less than their equal per capita al-\nlocation. In other words, countries with a positive HED have to compensate \ncountries with a negative HED for their past emissions in excess of their popula-\ntion share up until their HED is fully compensated for. (Note that of course the \nsum of HED over all countries is equal to zero.) \nThere are two further complications, however. First, in addition to an \nagreement on s and e, i.e. the accounting period, agreement is also needed upon \nthe time period over which this compensation takes place. This is because for \nmany countries it would simply be impossible to compensate for their HED in \none year, as their HED might well exceed their total emission permits for that \nyear. Second, if compensation takes place over a range of years rather than in \none year, then it also has to be taken into account that a country’s HED de-\ncreases over time as the stock of past emissions in the atmosphere decreases \nslowly according to a certain decay rate, which depends among other things on \nthe type of greenhouse gas and the concentration of this gas in the atmosphere. \nBecause of decay, countries with a positive HED would want this period to be \n6 \n \nlong and would want compensation to occur in the later part of that time pe-\nriod, whereas countries with a negative HED would want a short period and \ncompensation to occur in the early part of that time period. Assume, for sim-\nplicity, that countries agreed on N, the number of years during which compen-\nsation takes place, which need not be identical to T. Assume further, somewhat \narbitrarily, that they agreed that compensation is required according to the fol-\nlowing formula: \n),...,1(1 NnHEDNC\nn\ni\nn\ni ==  \nwhere HEDni  is the HED of country i still remaining in the atmosphere in \nyear n. Then, the rule which allocates emission rights on an equal per capita \nbasis with historical accountability can formally be defined as follows: \nCw\nPop\nPop\nx\nn\ni\nt\nb\nw\nb\nit\ni −⋅=  (allocation on an equal per capita basis with \n   historical accountability) \n‘Grandfathering’, the first allocation rule, is in the interest of developed or \nAnnex 1 countries. It allows the continuation of their unequal access to the \ncommon resource atmosphere. In addition, they are not held accountable for \ntheir historical emissions that gave rise to the problem of global warming in the \nfirst place.2 That emission rights should be allocated on an equal per capita ba-\nsis and that historical differences in emissions should also be accounted for is, \non the other hand, the shared view of almost every scholar and policy maker \nfrom the developing world (e.g. Agarwal and Narain, 1991; Hyder, 1992; \nGhosh, 1993). It is the objective of this commentary to argue in defence of this \nview. Section 2 lists three reasons in favour of historical accountability. Maybe \n7 \n \nmore importantly, the commentary also aspires to refute some of the many ob-\njections that have been raised against historical accountability in the literature \n(section 3). \n \n \n2. Three reasons in favour of historical accountability \nFirst, on the most basic level, science is on the side of historical accountability. It \nis undisputed that global warming is a consequence of the increased concentra-\ntion of greenhouse gases in the atmosphere which is a function of emissions \nthat accumulated over time. It is true that emissions also decay slowly over time, \nbut that does not invalidate the fundamental insight that global warming is not \ncaused by current emissions of any particular year, but by a history of emis-\nsions over a long time span. To neglect historical accountability is therefore tan-\ntamount to ignoring the physical laws that give rise to the environmental prob-\nlem of global warming. \nSecond, historical accountability is buttressed by the polluter-pays-principle \nwhich has been embraced by the OECD-countries as long ago as 1974 (OECD, \n1974). According to the polluter-pays-principle those who caused the environ-\nmental damage in the first instance have to compensate for it. Because global \nwarming is caused by cumulative emissions and the developed countries have \ncontributed much more to cumulated emissions than the developing world, \nhistorical accountability ensures that the payment is indeed undertaken by the \npolluter and not by the victims of pollution.3 It is expected that global warming \nwill hurt the developing countries relatively more than the developed ones \n8 \n \n(IPCC, 1996, p. 218). Ignoring historical accountability would give a retrospec-\ntive licence to past emitters from developed countries to disadvantage the \npoorer countries. This would clearly violate Principle 21 of the Declaration of \nthe 1972 United Nations Conference on the Human Environment in Stockholm \nwhich postulates that nation-states‘ ‘sovereign right to exploit their own re-\nsources’ is subject to not causing ‘damage to the environment of other states or \nof areas beyond the limits of national jurisdiction’ (Molitor, 1991, p. 83). This \nprinciple has been re-iterated in the preamble to the United Nations Framework \nConvention on Climate Change (United Nations, 1992). \nThird, historical accountability is supported by the principle of equality of \nopportunity. The natural absorptive capacity of the planet earth that allows for \nthe decay of a certain amount of greenhouse gas emissions truly belongs to no-\nbody and should therefore be equally assigned to everybody in order to give \neverybody equal opportunity to benefit from emissions. To account for histori-\ncal emissions ensures equality of opportunity to use the global resource atmos-\nphere, no matter where or when he or she happens to live. To ignore historical \naccountability would mean to privilege those who lived in the past in the de-\nveloped countries and to discriminate against those who live in the present or \nwill live in the future developing countries. It is sometimes suggested in the \nspirit of Locke and Nozick that a long history of emissions might have estab-\nlished the right for developed countries to prolong current emission levels into \nthe future and that such ‘squatter’s rights’ can be derived from a common law \ndoctrine of ‘adverse possession’ (e.g. Young and Wolf, 1991). Such a suggestion \nignores the fact, however, that even Nozick (1974, p. 175) acknowledged that an \n9 \n \nappropriation of property rights can only be regarded as just if “the situation of \nothers is not worsened” which is clearly not the case with global warming. \n \n \n3. A refutation of some objections against historical accountability \nLet us turn to some objections against historical accountability now and try to \nrefute them. A first objection claims that past generations have been ignorant of \nthe detrimental consequences of emitting greenhouse gases and that the devel-\noped countries should therefore not be held accountable for historic emissions \n(Grubb, 1995, p. 491). While the first warning of global warming dates back to \nthe last century (Arrhenius 1896), it is presumably fair to say that it was not be-\nfore the mid-1980s that the public and decision makers became aware of the \ngreenhouse effect. Does this therefore imply that emissions before, say, 1985 can \nbe justly ignored? The answer is no. It is an established principle of the legal \nsystem of almost every country that ignorance does not exempt one from liabil-\nity for damage caused in the case of civil law or from punishment in the case of \ncriminal law. But surely, liability and punishment is often lower in case of igno-\nrance than in case of conscious or even deliberate infliction of harm. Does it fol-\nlow therefore that while historical accountability might be accepted, past emis-\nsions should be heavily discounted because of ignorance? Again, the answer is \nno. Historical accountability does not depend on past generations having delib-\nerately or consciously caused harm to the global commons. It is not about blame \nor collective moral guilt, as Beckerman and Pasek (1995, p. 410) suggest, not \neven about awareness of harm caused, but about assigning an equal share of the \n10 \n \nbeneficent existence of the absorptive capacity of nature to every individual, \nindependent of his or her place in either space or time. The developed countries \nhave exploited this capacity in excess of what an equal per capita allocation \nwould have granted them. Now they must be held accountable for it. \nA second objection holds that the present generation of developed countries \nmust not be held accountable for something that was caused not by themselves, \nbut by individuals in the past who are long since dead (Beckerman and Pasek, \n1995, p. 410). So even if historical accountability was accepted, this argument \nwould call for limiting it to a period of the last 50 years or so. This objection \nraises a number of difficult and contentious issues that reach into debates far \nbeyond global warming. For example, most young Germans seem to accept that \nwhile none of them can justifiably be blamed for Nazi crimes undertaken half a \ncentury ago, as a people they are held accountable for what some of their ances-\ntors did. Similarly, we are currently witnessing the phenomenon that Swiss and \nother banks as well as German companies cannot uphold their position that \nthey should not compensate for wrongs done by banks and companies in the \npast that were different from the current ones in all but the name. Their legalis-\ntic claim would presumably survive in court, but the political and moral pres-\nsure forces them to be accountable whether legally required to do so or not be-\ncause it is felt that they benefited from the wrongs of the past. \nBut would it not be utterly wrong to directly compare war atrocities and \ngenocide to the emission of greenhouse gases? Yes, of course. However, the \nvery last point made above brings us back to the issue of global warming. The \nfundamental counter-argument against not being held accountable for emis-\n11 \n \nsions undertaken by past generations is that the current developed countries \nreadily accept the benefits from past emissions in the form of their high stan-\ndard of living and should therefore not be exempted from being held account-\nable for the detrimental side-effects with which their living standards were \nachieved.4 There can be no doubt that the development of the ‘Northern’ coun-\ntries was eased, if not made feasible in the first place, by having had the possi-\nbility of burning large amounts of fossil fuel with the consequence of an accu-\nmulation of carbon dioxide in the atmosphere, the major greenhouse gas with a \nlong atmospheric residence time. Janssen et al. (1992) have found a significant \nrelationship between GNP per capita and the relative contribution to the carbon \ndioxide concentration rise by fossil fuel combustion per capita in a regression \nanalysis over 11 world regions. The relative regional contribution to the carbon \ndioxide concentration explains two thirds of the variations in GNP per capita in \n1990 (R square 0.67). \nA third objection against (full) historical accountability holds that some of \nthe benefits of past emissions are not confined to the emitting countries. Grubb \net al. (1992, p. 316), for example, argue that past emissions enabled the devel-\nopment of public goods such as modern medicine or better technologies that \nhave also raised living standards in developing countries and make it easier for \nlater developing countries to gain the same living standards with less emis-\nsions. In principle, this argument is correct, but it is difficult to quantify the ex-\nact share of emissions that can be attributed to the provision of these kinds of \npublic goods. My guess is that most scholars would agree that the vast bulk of \nemissions generated benefits to the developed countries themselves and not to \n12 \n \nthe world as a whole. Maybe therefore historical emissions should be slightly \ndiscounted, but the argument does not invalidate historical accountability as \nsuch. \nA fourth objection is based on practical reasons. Because of boundary \nchanges, so the argument put forward by Grubb et al. (1992, p. 316), it will be \ndifficult to attribute past emissions to current nation-states. The break-up of the \nSoviet Union as well as the creation of new nations in the process of decoloniza-\ntion are often invoked as examples. The question is whether these boundary \nchanges really pose that much of a problem, however. For firstly, the bounda-\nries of many of the major emitters in the past, like Northern America, (Western) \nEurope, Japan, Australia and New Zealand, have been relatively stable over \ntime, at least much more stable than the boundaries of countries in the develop-\ning world. Second, where boundary changes have occurred as in the case of the \nformer Soviet Union there is no reason why a new nation-state should not be \nheld accountable for emissions that were undertaken on the territory within its \ncurrent boundaries. If such detailed statistical data on fossil fuel consumption \nand chlorofluorocarbon (CFC) emissions cannot be traced back directly, then \none can take population share or GNP share as a proxy. Thirdly, if one feels un-\neasy about the implications of boundary changes in the last century then one \nmight want to restrict historical accountability to some time in this century. This \nmight also be a good idea given that the reliability of historical emission data in \ngeneral decreases for periods longer back in time. \nA fifth objection is again based on practical reasons. Because historical ac-\ncountability would mean that either the developed countries sooner or later \n13 \n \nhave to drastically cut back their greenhouse gas emissions or have to buy sub-\nstantial amounts of permits in the case of a tradable emission permit system \nfrom the developing countries, an equal per capita allocation rule with histori-\ncal accountability in its pure version would require massive economic costs for \ndeveloped countries. Rose et al. (1998) provide some figures on the differences \nin costs for developed countries following from different allocation rules.5 For a \nglobal gross emission reduction of 16.5% by 2020, Rose et al. compute a present \ncost to Annex 1 countries of 119.2 billion of 1990 US dollar if emission permits \nare ‘grandfathered’. If the same emission reduction is achieved with emission \npermits allocated on an equal per capita basis, Annex 1 countries face costs of \n913.6 billion of 1990 US dollar, most of which result from buying emission per-\nmits from developing countries. Rose et al. (1998) do not compute costs to An-\nnex 1 countries for the equal per capita allocation rule with historical account-\nability, but costs would of course be even higher. \nBarrett (1992, p. 106), for example, therefore dismisses equal per capita allo-\ncation with historical accountability as being politically non-viable: there will be \nrather no global agreement on global warming whatsoever than one that allo-\ncates permits on an equal per capita basis and holds countries accountable for \nhistoric emissions. On this objection it has to be said that a right principle is not \nrefuted by the mere fact of not currently being politically feasible. While it \nmakes sense for developing countries not to insist on a strict application of \nequal per capita emission rights with historical accountability now, they would \nbe ill advised to give up their insistence on this allocation rule coming into ef-\nfect some time not too far into the future. In the meantime they might accept \n14 \n \npartly or fully another allocation rule if they have the clear commitment from \ndeveloped countries that eventually they would give in towards an equal shar-\ning of the global commons. \nA sixth objection claims that historical accountability is almost irrelevant be-\ncause it is closely correlated with current emissions. Grübler and Fujii (1991, p. \n1406) compute that the developed world is responsible for 85.9% of the contri-\nbution in the increase in atmospheric concentration of carbon dioxide since \n1800, but also for 73.6% of current carbon dioxide emissions in 1987, while their \npopulation share is only approximately 21% (Bos et al. 1994). The reason why \nthe developing countries should insist on historical accountability nevertheless \nand not just on an equal per capita rule without historical accountability, is two-\nfold: first, the difference between historically accumulated and current carbon \ndioxide emissions of developed countries is likely to increase in the future. This \nis because current emissions of developing countries are likely to increase faster \nthan developed countries’ ones and because of the time lag until this translates \ninto significantly lower cumulated emissions for developed countries. The sec-\nond reason is that methane, the second most important greenhouse gas after \ncarbon dioxide, has a relatively low estimated atmospheric residence time of \nabout 10 years (Smith 1995, p. 24). Because developing countries emit relatively \nmore methane than carbon dioxide than the developed countries do and be-\ncause of the low residence time of methane, the gap between historical and cur-\nrent emissions will widen if the ‘comprehensive’ approach is taken. Eventually \ntherefore the difference between historical and current emissions will matter. \n \n15 \n \n \n4. Conclusion \nWhere is the international community of nation-states standing with respect to \nhistorical accountability? The preamble to the United Nations Framework Con-\nvention on Climate Change acknowledges that ‘the largest share of historical \nand current global emissions of greenhouse gases has originated in developed \ncountries’ and Art. 3 speaks of ‘common but differentiated responsibilities’ for \nclimate protection (United Nations, 1992). The Kyoto Protocol demands emis-\nsion restrictions only from developed countries (on average Annex 1 countries \nhave to reduce their 1990 emissions by 5.2 per cent until the period 2008-2012), \nwhereas developing countries can increase their emissions without restriction. \nOne could therefore interpret this Protocol as a first step away from historical \nand current inequalities in emissions. On the other hand, neither the Frame-\nwork Convention nor the Kyoto Protocol include any commitment of devel-\noped countries to eventually accept an allocation rule based on equal per capita \nemissions, let alone accept accountability for historically unequal emissions. It is \ntherefore far from certain that the developed countries are willing to abandon \ninequalities in greenhouse gas emissions in their favour. \nPresumably at no time in the future will the rights to greenhouse gas emis-\nsions ever be allocated strictly on an equal per capita basis with historical ac-\ncountability. There will always be a political compromise. This will be accept-\nable to developing countries as long as the basic validity of the allocation rule is \naccepted. A strict application of the rule would also suffer from the fact that it is \ndifficult to estimate the relative contribution of a country to the build-up of \n16 \n \ngreenhouse gases in the atmosphere with full confidence. This is because of the \ndifficulties in getting reliable estimates of historical data and because the re-\nmoval of greenhouse gases from the atmosphere is a complex process and is (up \nto a certain threshold) a positive function of gross emissions: the higher emis-\nsions, the higher is also the removal (IPCC, 1996, p. 93f.). \nRight now it is not in the interest of the developed countries to accept the \nbasic validity of equal per capita allocation with historical accountability and \nthe developing countries do not have the bargaining strength to enforce it. But \nthings can change over time. The biggest bargaining power of developing coun-\ntries — especially of big ones like China, India, Brazil and Indonesia — is their \nability to obstruct. As their current emissions and populations grow faster than \nthe ones in developed countries, any comprehensive treaty in the early next \ncentury will be futile without the cooperation of these countries. By that time it \nmight become the interest of the developed world to accept the basic validity of \nequal per capita allocation with historical accountability in order to strengthen \nthe incentives for the major developing countries to join a truly global agree-\nment. The sooner the developed countries realise this, the better. If this com-\nmentary could contribute even the least bit to speed up the process of accep-\ntance, it would have fully achieved its objective. \n17 \n \nReferences \nAgarwal, Anil and Suita Narain, 1991. Global Warming in an Unequal World. \nCentre for Science and Environment, New Delhi. \nArrhenius, S., 1896. On the Influence of Carbonic Acid in the Air Upon the \nTemperature on the Ground. Philosophical Magazine and Journal of Sci-\nence S15, 41: 237-276. \nBarrett, S., 1992. 'Acceptable' Allocations of Tradeable Carbon Emission Enti-\ntlements in a Global Warming Treaty. In: United Nations Conference on \nTrade and Development (Editor), Combating Global Warming - Study on \na Global System of Tradeable Carbon Emissions Entitlements. United Na-\ntions, New York: 85-113. \nBeckerman, W. and Pasek, J., 1995. The Equitable International Allocation of \nTradable Carbon Emission Permits. Global Environmental Change, 5: 405-\n413. \nBos, E., Vu, M.T., Massiah, E. and Bulatao, R.A., 1994. World Population Projec-\ntions 1994-95 Edition. Johns Hopkins University Press, Baltimore\/London. \nGhosh, P., 1993. Structuring the Equity Issue in Climate Change. In: A.N. \nAchanta (Editor), The Climate Change Agenda - An Indian Perspective. \nTata Energy Research Institute, New Delhi: 267-274. \nGrubb, M., 1995. Seeking Fair Weather: Ethics and the International Debate on \nClimate Change. International Affairs, 71: 463-496. \n18 \n \nGrubb, M., Sebenius, J., Magalhaes, A. and Subak, S., 1992. Sharing the Burden. \nIn: I.M. Mintzer (Editor), Confronting Climate Change: Risks, Implications \nand Responses. Cambridge University Press, Cambridge: 305-322. \nGruebler, A. and Fujii, Y., 1991. Inter-Generational and Spatial Equity Issues of \nCarbon Accounts. Energy, 16: 1397-1416. \nHyder, T.O., 1992. Climate Negotiations: The North\/South Perspective. In: I.M. \nMintzer (Editor), Confronting Climate Change: Risks, Implications and \nResponses. Cambridge University Press, Cambridge: 323-336. \nIPCC, 1996. Climate Change 1995: The Science of Climate Change— Contribu-\ntion of Working Group I to the Second Assessment Report of the Intergov-\nernmental Panel on Climate Change. Cambridge University Press, Cam-\nbridge. \nJanssen, M.A., den Elzen, M.G.J. and Rotmans, J., 1992. Allocating CO2-\nEmissions by Using Equity Rules and Optimization, RIVM, Report nr. \n222901012. Dutch National Institute for Public Health and the Environ-\nment, Bilthoven. \nMolitor, M.R. (Editor), 1991. International Environmental Law - Primary Mate-\nrials. Kluwer Law and Taxation Publishers, Deventer\/Boston. \nNozick, R., 1974. Anarchy, State and Utopia. Blackwell, Oxford. \nOECD, 1974. Recommendation on the Implementation of the Polluter-pays \nPrinciple, C(74)223. OECD, Paris. \n19 \n \nRose, A., Stevens, B., Edmonds, J. and Wise, M., 1998. International Inequality \nand Differentiation in Global Warming Policy. Environmental and Re-\nsource Economics, 12: 25-51. \nSmith, K., 1991. Allocating Responsibility for Global Warming: The Natural \nDebt Index. Ambio, 20: 95-96. \nSmith, K., 1995: The Basics of Greenhouse Gas Indices. In: P. Hayes and K. \nSmith (Editors), The Global Greenhouse Regime: Who Pays?. Earthscan, \nLondon: 20-50. \nUnited Nations, 1992. United Nations Framework Convention on Climate \nChange. New York, online available at http:\/www.unfccc.de. \nUnited Nations, 1997. Kyoto Protocol to the United Nations Framework Con-\nvention on Climate Change. New York, online available at \nhttp:\/www.unfccc.de. \nYoung, H. P. and Wolf, A., 1991. Global Warming Negotiations: Does Fairness \nMatter?. Brookings Review, 10: 46-51. \n20 \n \nENDNOTES \n                                                 \n1 If instead of a base year, future projected business-as-usual emissions or populations are the \nreference points, the formulas have to be slightly modified.  \n2 Annex 1 countries comprise the OECD-countries and the economies in transition in Eastern \nEurope and the Russian Federation. Annex 1 and developed countries is used interchangeably \nhere. \n3 Payment would take place via the buying of emission permits from developing countries, for \nexample. \n4 Again this argument does not depend on morally blaming past generations in developed coun-\ntries for their emissions. \n5 The reader should take these as rough figures only. In estimating these costs, much depends \non the modelling approach and the underlying assumption.  \n"}