{"doi":"10.1140\/epjst","coreId":"67765","oai":"oai:eprints.lancs.ac.uk:35023","identifiers":["oai:eprints.lancs.ac.uk:35023","10.1140\/epjst"],"title":"Rogue waves in superfluid helium.","authors":["Efimov, V. B.","Ganshin, A. N.","Kolmakov, G. V.","McClintock, P. V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Rogue waves have been observed in superfluid helium. The experimental system consists of high intensity second sound (temperature-entropy) waves within a resonant cavity. Under steady state conditions, with a constant oscillatory driving force at the resonant frequency, the waves are turbulent and there are fluxes of energy towards both high and low frequencies. Rogue waves appear under the nonequilibrium conditions that prevail shortly after the drive has been switched on, prior to establishment of the steady state. The experiment is described briefly, relevant results are presented and discussed theoretically in terms of nonlinear wave interactions, and possible connections to rogue waves on the ocean are considered","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67765.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35023\/1\/epjrogues5PostPrint.pdf","pdfHashValue":"9e985d5b33a1ac78ef48ea230056713264eaf549","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35023<\/identifier><datestamp>\n      2018-01-24T03:06:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Rogue waves in superfluid helium.<\/dc:title><dc:creator>\n        Efimov, V. B.<\/dc:creator><dc:creator>\n        Ganshin, A. N.<\/dc:creator><dc:creator>\n        Kolmakov, G. V.<\/dc:creator><dc:creator>\n        McClintock, P. V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Rogue waves have been observed in superfluid helium. The experimental system consists of high intensity second sound (temperature-entropy) waves within a resonant cavity. Under steady state conditions, with a constant oscillatory driving force at the resonant frequency, the waves are turbulent and there are fluxes of energy towards both high and low frequencies. Rogue waves appear under the nonequilibrium conditions that prevail shortly after the drive has been switched on, prior to establishment of the steady state. The experiment is described briefly, relevant results are presented and discussed theoretically in terms of nonlinear wave interactions, and possible connections to rogue waves on the ocean are considered.<\/dc:description><dc:date>\n        2010<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35023\/1\/epjrogues5PostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1140\/epjst\/e2010-01248-5<\/dc:relation><dc:identifier>\n        Efimov, V. B. and Ganshin, A. N. and Kolmakov, G. V. and McClintock, P. V. E. (2010) Rogue waves in superfluid helium. European Physical Journal - Special Topics, 185 (1). pp. 181-193. ISSN 1951-6355<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35023\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1140\/epjst\/e2010-01248-5","http:\/\/eprints.lancs.ac.uk\/35023\/"],"year":2010,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"EPJ manuscript No.\n(will be inserted by the editor)\nRogue waves in superfluid helium\nV. B. Efimov1,2,a, A. N. Ganshin1,b, G. V. Kolmakov1,3,c, P. V. E. McClintock1,d, and\nL. P. Mezhov-Deglin2,e\n1 Department of Physics, Lancaster University, Lancaster, LA1 4YB, UK\n2 Institute of Solid State Physics RAS, Chernogolovka, Moscow region, 142432, Russia\n3 Department of Chemical and Petroleum Engineering, Pittsburgh University, Pittsburgh, PA 15261,\nUSA.\nAbstract. Rogue waves have been observed in superfluid helium. The experimen-\ntal system consists of high intensity second sound (temperature-entropy) waves\nwithin a resonant cavity. Under steady state conditions, with a constant oscilla-\ntory driving force at the resonant frequency, the waves are turbulent and there\nare fluxes of energy towards both high and low frequencies. Rogue waves appear\nunder the nonequilibrium conditions that prevail shortly after the drive has been\nswitched on, prior to establishment of the steady state. The experiment is de-\nscribed briefly, relevant results are presented and discussed theoretically in terms\nof nonlinear wave interactions, and possible connections to rogue waves on the\nocean are considered.\n1 Introduction\nRogue waves have long been recognized by sailors as a menace to shipping and believed to\nbe responsible for the unexplained losses of vessels of all sizes, including e.g. 22 super-carriers\nbetween 1968 and 1994 [1,2]. Rogue waves on the laboratory scale are in principle easier to\ninvestigate, and have now been been observed in a number of different systems, including\nsuperfluid 4He [3] as we discuss below. In the rest of this introduction we summarize very briefly\nthe notion of rogue waves in Sec. 1.1 and then in Sec. 1.2 we provide the basic information about\nsuperfluid 4He needed to understand our recent experiments on rogue waves in second sound.\nThe experiments themselves are described in Sec. 2 and discussed theoretically in Sec. 3. The\nresults and the possible relationship of rogue waves in second sound to oceanic rogue waves are\npresented and considered in Sec. 4, and we draw conclusions in Sec. 5.\n1.1 Rogue waves\nRogue waves on the ocean [2] are rare, and are much higher (and steeper) than all the other\nwaves around them. They seem to appear from nowhere and subsequently to disappear without\ntrace [4,5]. Following the famous “New Year wave” [6] measured by instruments on the Draupner\nNorth Sea oil rig at the beginning of 1995, the existence of oceanic rogue waves is no longer in\ndoubt. On account of their interest and commercial importance, intensive research is in progress\na e-mail: efimov@issp.ac.ru\nb e-mail: a.ganshyn@lancaster.ac.uk\nc e-mail: gek11@pitt.edu\nd e-mail: p.v.e.mcclintock@lancaster.ac.uk\ne e-mail: mezhov@issp.ac.ru\nPublished in Eur. Phys. J. - Spec. Topics 185, 181-193 (2010).\n2 Will be inserted by the editor\nto try to establish how rogue waves arise, in the hope that understanding may help in avoiding\nand possibly even controlling them.\nThere have been several suggestions about possible mechanisms for the creation of rogue\nwaves. These include the combined effects of wind and currents, and the focusing effects asso-\nciated with the profile of the ocean floor and nearby shorelines. Where rogue waves appear in\ndeep water far from any shore, which they sometimes do, it seems likely that they must evolve\nthrough nonlinear interactions within the “noisy background” of smaller wind-blown waves [7].\nRogue waves have been modeled theoretically, especially by exploiting the special properties of\nthe nonlinear Schro¨dinger equation [8,1,9,4,5]. They have been sought experimentally and\/or\nstudied in large wave tanks [10], optical systems [11,12], and superfluid 4He [3]. Despite this\ngrowing body of work, extraordinarily little can be stated with confidence about the origins of\nrogue waves on the ocean. Open questions include:\n1. Is the rogue wave phenomenon linear or nonlinear?\n2. How do rogue waves appear? Is the phenomenon related to the modulation instability [13]?\n3. What is the spectral content of rogue waves?\n4. How important is the distribution of wave amplitudes in registering the rogue waves?\n5. Can rogue waves be considered as classical large fluctuations [14–16]? In this context we\ncomment that they might then be expected to possess deterministic features in the sense of\ndeveloping and decaying along optimal paths, despite the inherently random, fluctuational,\nmechanisms that generate them.\nIn Sec. 5 we will return to these questions and consider the extent to which the present research\nilluminates them.\n1.2 Superfluid helium\nWhen cooled below 4.2K under atmospheric pressure, 4He condenses to form a colourless\nliquid that has many unusual features including, in particular, a density three times smaller\nthan estimated for hard spheres the size of 4He atoms in contact with each other [17]. The low\ndensity arises on account of the large quantum mechanical zero-point energy, combined with the\nvery weak Van der Waals interatomic force: the liquid expands to minimise its free energy. The\nlarge interatomic separation endows the liquid with gas-like properties, so that it undergoes\nBose-Einstein condensation [18] when cooled though a temperature T = Tλ = 2.17K. Below\nTλ, the properties of the liquid are so utterly different that it is called He II to distinguish it\nfrom He I above Tλ. Remarkably, He II behaves as though it were a mixture of two different\nfluids: a normal fluid component with viscosity and carrying all of the thermal energy of the\nliquid; and an inviscid superfluid component with zero entropy. The two fluids pass through\neach other without interaction: each of them separately fills the containing vessel. Oscillatory\ncounterflow of the two components can occur at constant density and pressure, corresponding\nto the temperature-entropy wave known as second sound.\nSecond sound has a relatively low phase velocity (∼20ms−1) and an extremely small atten-\nuation coefficient for frequencies below about 1MHz. Its velocity u2 depends strongly on its\namplitude δT and can be approximated as\nu2 = u20(1 + αδT ), (1)\nwhere u20 is the velocity at vanishingly small amplitude. The nonlinearity coefficient α [19]\ncan be made large, and either positive or negative, by adjustment of the temperature. Because\nα determines the strength of the wave interactions, which can thus be easily controlled, these\nproperties make He II an ideal medium for systematic studies of nonlinear interactions between\nwaves.\n2 Experiments on wave turbulence in second sound\nThe experiment involves studying second sound within a resonant cavity. Because of its small\nattenuation coefficient for frequencies below 1MHz, the quality Q factor is typically ∼3000,\nWill be inserted by the editor 3\nFig. 1. Schematic diagram to illustrate the experimental arrangements.\nenabling large wave amplitudes to be achieved without difficulty. These lead to nonlinear wave\ninteractions and to the range of interesting phenomena that we describe below. First, we provide\na brief account of how the experiments were performed.\n2.1 Experimental details\nFig. 1 provides a schematic illustration of the experimental arrangements [20,21]. The resonator\nconsists of a cylindrical quartz tube of length L = 7 cm and inner diameter D = 1.5 cm, filled\nwith superfluid helium. Being a temperature wave, second sound can conveniently be excited\nwith a heater and detected thermometrically. Accordingly, a thin-film heater and bolometer\nwere deposited on the surfaces of flat glass plates capping the ends of the tube. The heater was\ndriven by a harmonic voltage generator in the frequency range 0.1 – 100 kHz. The frequency of\nthe second sound (twice the frequency of the voltage generator) was set close to a longitudinal\nresonance. The amplitude δT of the standing wave could be varied between 0.05 mK and a few\nmK. The temperature was maintained at T ≈ 2.08 K, for which α ≈ −7.7 K−1. The resonator’s\nQ-factor, determined from the widths of longitudinal resonances at small heat flux densities\n(linear regime), was Q ∼ 3000 for resonance numbers 30 < n < 100. The second sound wave\nshape detected by the bolometer was recorded as a time series, and its power spectrum was\nsubsequently computed by fast Fourier transform (FFT).\n2.2 Results under steady state conditions\nFig. 2(a) shows typical steady state results under experimental conditions such that only the\ndirect cascade exists. Energy injected at the driving frequency flows steadily towards higher\nfrequencies with negligible dissipation until the viscous cut-off is reached, beyond which it\nis rapidly dissipated as heat. Fig. 2(b) shows the very different situation that applies under\nconditions such that the inverse and direct cascades coexist. The energy flux from the drive is\nthen shared between the two cascades. As before, some energy flows towards higher frequencies,\nbut half or more of it flows towards lower frequencies. It is believed that energy flowing in the\nlatter (inverse) cascade is eventually dissipated by normal fluid damping on the resonator walls.\nThe inverse cascade appears quite suddenly as the amplitude is increased or the detuning\nof the drive from the resonant frequency is decreased, and it appears to be associated with an\ninstability against the formation of subharmonics. To characterise the instability quantitatively,\nwe use the energy contained in the low-frequency part of the spectrum ω < ωd,\nELF =\n1\n2\n(\n∂C\n∂T\n) ∑\nω<ωd\n|δTω|2, (2)\n4 Will be inserted by the editor\n1000 10000 100000\n1E-4\n1E-3\n0.01\n0.1\n \n \nf, (Hz)\nm\nK\ns)\n1000 10000\n1E-4\n1E-3\n0.01\nf, (Hz)\nm\nK\ns)\n \n \nFig. 2. Steady state power spectral amplitudes δTω of standing waves in the resonant cavity, for T =\n2.079K. Left: direct energy cascade when driving close to the 37th resonant frequency, fd = 3780Hz.\nThe ac heat flux density from the heater was W = 30mW\/cm2. Right: coexistence of the inverse and\ndirect energy cascades for the 96th resonance with W = 19.2mW\/cm2.\nas an indicator. Here C is the heat capacity per unit volume. For small W with fixed detuning,\nwe did not observe any subharmonic generation at all [20]; then, above a critical flux Wc, ELF\nrose rapidly [3], as shown in Fig. 3. This critical character of the phenomenon is fully in accord\nwith theoretical expectations (see below and [3]. At T = Tα = 1.88 K for which α vanishes [19],\nno subharmonics were observed, regardless of the magnitude of W , thus confirming the crucial\nimportance of nonlinearity. These phenomena appear in the regime where the energy cascade\ntowards the high frequency domain (i.e. direct cascade, with a Kolmogorov-like spectrum [20,\n22]), is already well-developed. We have found that they are attributable mainly to 3-wave in-\nteractions, i.e. to a decay instability whereby the wave decays into two waves of lower frequency\ngoverned by the energy (frequency) conservation law\nω1 = ω2 + ω3 (3)\nwhere ωi = u20ki is the frequency of a linear wave of wave vector ki. The inverse process is, of\ncourse, also possible.\n2.3 Results in transient evolution and rogue waves\nThe results shown in Fig. 2 were recorded after leaving the system for a few minutes to reach\nits steady state for any give parameter set. It of particular interest, however, to observe the\ntransient evolution of the system after the drive is switched on or off, or after a parameter\nis changed. Fig. 4 presents typical results obtained when driving at a relatively high resonant\nfrequency ωd (the 96th longitudinal resonance of the cell). Fig. 4(a) plots the measured second\nsound signal after switching on the drive at t ∼ 0.4 s. Figs. 4(b) shows an expanded window\njust after switch-on and (c) shows its power spectrum. These data are similar to those for the\ndirect Kolmogorov-like cascade under steady state conditions (Fig. 2(a) [20]), when driving\nclose to resonance. Thus it can be seen that the direct cascade appears almost immediately\nafter switch-on. Figs. 2(f),(g) provide comparable plots for window-3, where it is evident that\nthe results are approaching those for the steady state when the inverse cascade is active (Fig.\n2(b)).\nOf particular interest in the present context are the results of Fig. 4(a) in the intermediate\nrange. A sequence of rogue waves is clearly evident; (d) plots an expansion of the one seen in\nwindow-2, and (e) gives its power spectrum. So far, we have only observed rogue waves under\ntransient conditions like those illustrated, during the development of the inverse energy cascade.\nWill be inserted by the editor 5\n0 28 56 84\n0\n4\n8\n12\n9540 9544\n0\n10\n \nE L\nF x\n10\n6\nd\/2  (Hz)E\nLF\n x\n10\n6  (\nJ\/\ncm\n3 )\nW (mW\/cm2)\nWc\n \n \nFig. 3. The energy ELF contained in the low-frequency part of the spectrum as a function of the AC\nheat flux density W , while driving near to the 96th resonance for T ' 2.08 K. The threshold value of\nW , marked by the (green) arrow, was Wc = 10.4 mW\/cm\n2. The points are from experiment; dashed\nlines are guides to the eye. Inset: the dependence of ELF on ωd, measured for W = 55.6 mW\/cm\n2; the\n(red) arrow labels the maximum value of ELF , which is taken to the main figure. From [3]\n3 Theoretical considerations\nIn seeking to understand the peculiarities of this transient process we have undertaken analyt-\nical and numerical studies of the dynamics of the nonlinear wave system. Full details of the\ntechniques have been given elsewhere [23,20] but, in essence, it involves direct integration of the\ntwo-fluid hydrodynamical equations, expanded up to quadratic terms in the wave amplitude.\nWe use a representation of the second sound waves in the resonator in term of Hamiltonian\nvariables [23], a numerical technique somewhat similar to that used in [7]. It allows one to cap-\nture accurately the shape of the wave at large amplitudes and\/or gradients [8]. The equation\nof motion governing energy balance in the system is\ni\n∂bn\n∂t\n=\n∑\nn1,n2\nVn,n1,n2(bn1bn2δn−n1−n2 + 2bn1b\n∗\nn2δn1−n2−n)− iγnbn + F, (4)\nwhere bn(t) = (1\/2)(B−1n Sn + iBnβn) is the time-dependent canonical amplitude of second\nsound at the n-th resonant frequency fn; Sn and βn are the space Fourier components ∼\ncos(2pifnx\/u20L) of the entropy and of the potential of the normal-superfluid relative velocity;\nBn = (fnC\/T )1\/2; Vn,n1,n2 ∝ α(nn1n2)1\/2 describes the three-wave interaction; γn = νn2\nmodels the viscous damping of second sound; and F ∝W is the amplitude of the force driving\nthe n-th resonant mode. In this representation the wave spectrum can be calculated as Af ∝\nBn (bn + b∗n).\n3.1 Generation of low frequency waves near the instability threshold\nFirst, we consider generation of low-frequency harmonics due to nonlinearity of the second\nsound wave. It is known that the problem of nonlinear wave propagation and interaction can\nbe mapped onto the problem of coupled oscillator dynamics (see [24] for general formalism and\n[25,23] for application to second sound in 4He). Based on quite general considerations [26], we\nmay expect the production of waves in the low-frequency domain to be initiated at a frequency\nclose to half that at which the energy is being injected into the system. Accordingly, to establish\nconditions for the wave instability, we consider a simplified problem where just two interacting\n6 Will be inserted by the editor\nFig. 4. (a) Transient evolution of the second sound wave system after switching on the drive at a\nfrequency near the 96th resonance. The AC heat flux density was W = 42.1 mW\/cm2. The signals\n(b),(d),(f) and instantaneous spectra (c),(e),(g) correspond to the time windows indicated in (a) by\nthe arrows 1-3 respectively. Note the linear ordinate scales in (c),(e),(g) (cf. the logarithmic ordinates\nin Fig. 2).\nwave modes at ω = ωd and ω = ωd\/2 are taken into account. In this case the model Hamiltonian\nof the system reads\nH = ω1|b1|2 + ω2|b2|2 + λb21b∗2 + λb∗21 b2. (5)\nHere ω1 and ω2 are the resonant frequencies of second sound waves of infinitely small ampli-\ntude, b1 and b2 are normal coordinates (below we will call them the amplitudes of second sound\nwaves), λ is the amplitude of the three-wave interactions proportional to the nonlinearity co-\nefficient of second sound. The two terms cubic in the wave amplitude describe the interaction\nof waves due to nonlinearity [27]. The subscript “1” labels the wave of lower frequency (the\nlow-frequency, or LF wave), and subscript “2” labels the wave of higher frequency (the high\nfrequency or HF wave), i.e. ω1 < ω2. We assume also that the external driving force is applied\nat a frequency close to the frequency ω2.\nThe equations of motion for the amplitudes of weakly dissipating second sound waves are\n[24,25]\nib˙1 =\n∂H\n∂b∗1\n− iγ1b1, ib˙2 = ∂H\n∂b∗2\n− iγ2b2 + F (t), (6)\nwhere γ1 and γ2 are the damping coefficients of second sound waves, and F (t) is a monochro-\nmatic driving force applied at a frequency ω,\nF (t) = F exp(−iωdt),\nF is the time-independent driving amplitude, and the dot denotes a derivative with respect to\ntime t. For further analysis it is convenient to use an interaction representation for the wave\nWill be inserted by the editor 7\n0 1 2 3 4 5\nr\n0\n0.1\n0.2\na\nFig. 5. Dependence of the a parameter on the ratio r = Q1\/Q2 of the quality factors at the frequencies\nof the LF and HF second sound waves.\namplitudes,\nb1 = A1 exp(−iωdt\/2), b2 = A2 exp(−iωdt) (7)\nwhere A1 and A2 are new variables. In steady state, A1 and A2 are time-independent. In this\ncase the equations (6) read\n0 = iA˙1 = −12(∆ω + 2iγ1)A1 + 2λA\n∗\n1A2, (8)\n0 = iA˙2 = −(∆ω + iγ2)A2 + λA21 + F. (9)\nHere ∆ω = ωd−ω2 is the detuning of the driving force with respect to the resonance frequency\nof the HF wave.\nThe amplitude of the HF wave can be eliminated from the set of equations (8), (9). The\nresulting equation for the amplitude of the LF wave in steady-state reads\n(∆ω2 − 2γ1γ2 − 4λ2|A1|2)2 +∆ω2(γ1 + 2γ2)2 = 16λ2|F |2 (10)\nFor convenience, we now introduce dimensionless variables for the wave amplitude, driving\nforce, detuning, and damping:\nξ1 =\n2λ|A1|\nγ2 + 2γ1\n, f =\n4λ|F |\n(γ2 + 2γ1)2\n, ∆ =\nω − ω2\nγ2 + 2γ1\n, a =\n2γ1γ2\n(γ2 + 2γ1)2\n. (11)\nIn terms of these dimensionless variables, equation (10) becomes\nξ1 =\n[\n(f2 −∆2)1\/2 +∆2 − a\n]1\/2\n(12)\nThe parameter a is expressed in terms of the quality factor of the resonator Q1 = ω1\/γ1 and\nQ2 = ω2\/γ2 at frequencies equal to the frequencies of LF and HF waves, as follows\na =\nQ1Q2\n(Q1 +Q2)2\nThe dependence of the a(r) parameter on the ratio r = Q1\/Q2 is shown in Fig. 5. It has a\nmaximum a = 1\/4 at r = 1. Assuming the dependence on frequency of the damping coefficient\nfor second sound takes the form γ(ω) = ν0ω2, which is typical for sound waves in an unrestricted\nliquid, we may evaluate the a coefficient as (recall here that ω1 ≈ ω2\/2)\nγ1\/γ2 = 0.25, a ≈ 0.2\n8 Will be inserted by the editor\na\n∆0\nfc\na\na−a 1\/21\/2\n1\/2\n-2 -1 0 1 2\n1\n2\n∆\nξ 1\n1\n2\nFig. 6. Left: calculated dependence of the critical amplitude of the driving force on the detuning ∆\nfrom the second sound resonant frequency. Right: amplitude of the LF wave plotted as a function of\ndetuning for two driving amplitudes, f = 0.4 (i.e. f < a1\/2, curve 1), and f = 2 (f > a1\/2, curve 2).\nThe damping is a = 1\/4.\nthat is close to its maximum value. It follows from Eq. (12) that the amplitude of the LF wave\nis nonzero only if the amplitude of the driving force at the frequency of the HF wave exceeds\na critical value fc = max(fc1, fc2), and if fc1 and fc2 obey the following conditions:\nfc1 − |∆| = 0, (13)\n(f2c2 −∆2)1\/2 +∆2 − a = 0. (14)\nThe dependence of the critical amplitude of the driving force fc on the detuning ∆ defined by\n(13) and (14) is shown in Fig. 6(left).\nIt follows from subsequent analysis that, in the area inside the rectangle (∆| < a1\/2, a <\nf < a1\/2) in Fig. 6(left), the generation of the LF wave is somewhat similar to a second\norder transition, because the amplitude ξ1 starts from zero. At f > a1\/2 the generation of\nthe LF frequency is of the hard type, however, analogous to a first order transition, and it is\naccompanied by a finite jump in wave amplitude.\nTo demonstrate this, let us consider the dependence of the amplitude of the LF wave ξ1 on\nthe detuning ∆ for a given value of the driving force f . At f ≤ fcmin = a the amplitude ξ1 is\nequal to zero. At f > fcmin there are two possibilities: in accordance with Eq. (12) the second\nderivative the amplitude ξ1 with respect to ∆ taken at ∆ = 0,\nd2ξ1\nd∆2\n∣∣∣∣\n∆=0\n=\n1− 2f\n2f(f − a)1\/2. (15)\nIf a < f < a1\/2, the second derivative (15) is negative, and the amplitude ξ2 at half the driving\nfrequency decreases with increasing ∆ (curve 1 in the right plot of Fig. 6). Recall that a is\nalways less than unity. For the case f > a1\/2 the wave amplitude ξ2 rises with an increase in\nthe detuning (curve 2).\nTo estimate the critical wave amplitude above which generation of the low-frequency wave\nbecomes possible, we take ξ1 ∼ 1, and [27]\nλ =\n√\nρs\nρρn\nασω3\/2\n6\n√\n2u2(∂σ\/∂T )\n, δT =\n√\nω\n(∂S\/∂T )\n|A|, |A| = (γ2 + 2γ1)\n2λ\nξ1, u\n2\n2 =\nρsσ\n2\nρn(∂σ\/∂T )\n(16)\nFrom here one can estimate the critical second sound wave amplitude as δT ∼ γ\/|α|ω = 1\/|α|Q\nwhere γ is the damping coefficient of the second sound wave, and Q is the quality factor of the\nresonator. Taking the values Q ∼ 103, |α| ∼ 7.7K−1 one has δT ∼ 0.1 × 10−3K by order of\nmagnitude, consistent with the experimental observations.\nWill be inserted by the editor 9\n 0\n 0.2\n 0.4\n 0.6\n 0.8\n 1\n 1.2\n 1.4\n 1.6\n 0  100  200  300  400  500  600\n|b 0\n|\ntime\n 0\n 0.5\n 1\n 1.5\n 2\n 2.5\n 3\n 3.5\n 0  100  200  300  400  500  600\n|b 6\n|\ntime\nFig. 7. Calculated evolution with time of the second sound wave amplitudes at the 1st (left) and 6th\n(right) resonant frequencies. The driving force is being applied at the 6th resonant frequency.\n3.2 Numerical simulations\nIf the driving force amplitude exceeds the critical value for generation of low frequency waves\n(the region above the full curve in Fig. 6 left) multiple waves with ω < ωd may be excited as the\nresult of nonlinearity. At high driving amplitudes the dynamics cannot be reduced to a simple\nmodel (5), and the full set of equations (4) must be considered. In this case, the nonlinear\ndynamics of the wave system is complicated and must be analyzed numerically. To capture the\nmain characteristic features of the development of the inverse cascade while, at the same time,\nkeeping the system simple enough to be analyzed in detail, we carry out a simulation within\nthe framework of equations (4) taking account of relatively small numbers of waves N : the\nsummation in Eq. (4) was made for n1, n2 ranging from 1 to N . In what follows we present\nthe results obtained for N = 10. We assume that a periodic driving force is applied to the 6th\nresonant frequency.\nIt is important to note that, in accordance with Sec. 3.1, the inverse cascade develops as the\nresult of instabilities in the wave at the driving frequency and in its harmonics. At small time, the\ndependence of the low frequency harmonic amplitudes on time is close to bn(t) ∝ bn(0) exp(νnt),\nwhere νn is the instability increment. If the initial conditions are set to bn(0) = 0, the ampli-\ntudes will be kept formally equal to zero at any time t > 0. In simulations with zero initial\nconditions, the instability can be strongly affected by “numerical noise” due to discretization\nin the computational scheme. To avoid any such influence and resultant numerical artifacts, we\napply non-zero initial conditions in our simulations for wave amplitudes at frequencies below\nthe driving frequency. That is, we set the initial wave amplitudes to a very small non-zero\nvalue, bn(0) = b0; for the results reported here we took b0 = 10−4. We also checked that neither\nthe details of the transient process, nor the final steady-state wave spectrum, depend on b0\nprovided that b0 is taken to be sufficiently small with respect to steady-state wave amplitudes\nmeasured at large time.\nFig. 7 shows the time dependence of the wave amplitudes at the 1st and 6th (driving)\nresonant frequencies. It is clearly evident that a low frequency wave is generated at n = 1 as\nthe result of nonlinear interactions in the system. We checked in the computations that if we set\nthe nonlinearity coefficient Vn,n1,n2 to zero, waves with frequencies below the driving frequency\nare not then excited. Fig. 7 shows that the transient process extends over a relatively long\ntime (t ∼ 200 in numerical units), that is, a time much longer than the characteristic nonlinear\ntime (∼ 1) of this system. Fig. 8 demonstrates the steady-state wave spectrum computed for\nt = 1000. The driving frequency is marked by an arrow. It is evident that, in the low-frequency\nspectral domain, the wave amplitude rises with decreasing resonance number n, in accordance\nwith experimental observations (Sec.2).\nFig. 9 shows the dependence on time of the wave amplitude computed at the edge of the\nresonator δT (t, x = 0) (corresponding to the bolometer signal in our experiments). It can be\nseen that, at relatively small times (left plot) after the driving force was switched on, the signal\n10 Will be inserted by the editor\n0 2 4 6 8 10\nn\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n|b n\n|\nωd\nFig. 8. Steady state second sound wave spectrum computed for t = 1000. The arrow indicates the\nfrequency ωd of the driving force.\npresents a series of “freak waves” of amplitude more than twice that of the surrounding waves.\nAt large times, t ∼ 300, where the system is close to its steady state, the signal oscillates strongly\nat a low frequency which, again, is in qualitative agreement with experimental observations,\nFig. 4(f).\n4 Discussion\nIt is evident that the theory provides a good qualitative description of the phenomena seen in\nthe experiments. How might these results be related to the appearance of rogue waves on the\nocean? We will first discuss this question explicitly, then consider more generally whether rogue\nwaves can usefully be considered as classical large fluctuations and whether this perception may\nhelp in their analysis, and finally return to the open questions listed in Sec. 1.1.\n4.1 Rogue waves on the ocean and in superfluid 4He\nThere are differences as well as similarities between rogue waves on the ocean and in superfluid\n4He. The similarities include –\n1. In both cases, the phenomena under consideration are non-equilibrium in nature. Energy is\ncontinuously injected into the system, as entropy variations in the case of second sound and\nby e.g. wind and tide in the cases of ocean waves. In both cases the energy is eventually\ndissipated as heat.\nFig. 9. Time dependence of the second sound wave amplitude computed at the edge of the resonator\nfor small, t ∼ 0.1 (left), and large, t ∼ 300 (right), times after the moment when the driving force was\nswitched on. Note the creation of rogue waves at early time.\nWill be inserted by the editor 11\n2. In both cases, the rogue waves are rare, extreme, events – albeit less rare in the 4He case\nwhere the rogue waves appear at first singly, but then in small groups that become progres-\nsively larger as the inverse cascade develops (not shown in Fig. 4). Of course, this might\nno longer be the case if we could identify steady state conditions for rogue waves in second\nsound but, at present, the possibility remains an open question.\n3. In both cases, the phenomena appear to arise from an instability of large amplitude waves:\na decay instability in the case of second sound, and (probably) a modulation instability of\nthe ocean waves.\nThe differences include –\n1. The second sound waves in the experiment are produced directly by a periodic driving force,\nwhereas on the ocean roughly periodic waves are created by e.g. wind of a sufficient velocity.\n2. The second sound waves are one-dimensional standing waves, within the volume of the fluid,\nwhereas the ocean waves are on the surface and can propagate in two dimensions.\n3. Rogue waves on the ocean can apparently appear under steady state conditions, whereas\nthose in second sound have so far only been observed during the interval while the inverse\nenergy cascade is evolving after switching on the drive and after establishment of the direct\ncascade.\n4.2 Rogue waves as classical large fluctuations\nTaken at face value, rogue waves look just like what physicists working on stochastic dynamics\nrefer to as large fluctuations; mathematicians call them large deviations. The subject has a long\nhistory. The importance of large fluctuations seems first to have been recognized by Boltzmann\n[28] who introduced the concept in his 1904 speech in St Louis. Later, the idea was taken up\nand substantially developed by Onsager and Machlup [14] who introduced the notion of optimal\nfluctuational paths along which the system fluctuates with overwhelming probability when a\nlarge fluctuation occurs. Many theorists contributed to the further development of the idea,\nusually assuming the limit of vanishingly small noise intensity, which of course is not what\npertains in real physical systems. There was little connection to reality until the appropriate\nstatistical quantity, the prehistory probability distribution, had been introduced [15]. Only then\ncould it be appreciated that, in a real system with finite fluctuation intensity, the optimal\npath corresponds to the ridge (locus of maxima) along the top of the prehistory distribution.\nThis opened the way for experimental demonstrations [16,29] of the time-reversal symmetry\nof large fluctuations in equilibrium systems, and their asymmetry in nonequilibrium systems,\nconfirming Onsager and Machlup’s earlier prescient ideas [14].\nGiven that the wave energy per unit area changes relatively slowly compared to the charac-\nteristic times associated with individual waves, it seems reasonable to suppose that the ocean\ncan be regarded in this context as a quasi-equilibrium system. Consequently, one might hypoth-\nesize that the evolution and decay of rogue waves follow identical but time-reversed optimal\npaths. At least for numerical simulations, therefore, and possibly also for very large wave tanks,\nit may be possible to infer the evolutionary process by studying the decay of an artificially cre-\nated rogue wave: the optimal path during evolution should simply be the time-reversed decay.\nIt may also prove possible to map out the prehistory probability distribution of the rogue waves\nthat we have observed in second sound, and we hope to attempt this project in the future.\nOf course, viewing rogue waves as classical large fluctuations cannot by itself provide an\nadequate explanation because they appear too frequently. In this picture, one would have to\ninvoke nonlinearity and specific mechanisms, e.g. of the kind described above, to account for\nthe clearly non-Gaussian tails of the wave amplitude distribution. Nonetheless it may prove\nuseful to bear this more general scenario in mind while considering detailed transformation\nmechanisms for the wave energy.\n12 Will be inserted by the editor\n4.3 Origins of rogue waves\nWe can now return to the open questions posed in Sec. 1.1. In the light of the experiments\nand numerical simulations, and treating second sound acoustic turbulence as a model of what\nmay happen on the ocean surface, we suggest that rogue waves are a nonlinear phenomenon\nthat arises through the modulation instability (analogous to the decay instability in superfluid\nhelium). The present experiments reveal immediately the spectral content of a wave system\nthat includes rogue waves (Fig. 4(e)): we can of course select windows of different size in Fig.\n4(a) to facilitate extraction of whatever spectral information is needed. The distribution of wave\namplitudes in our measurements away from the rogue waves would seemingly not tell us that\na rogue wave was imminent: the rogues are quite distinct from neighbouring waves and do not\nseem to have any precursors. Finally, regardless of the details of the production mechanism,\nrogue waves clearly have much in common with classical large fluctuations and this perception\nof rogue waves is likely to be worth pursuing.\n5 Conclusion\nSecond sound in superfluid 4He constitutes a convenient laboratory-scale experimental system\nfor studies of rogue waves. We have shown through experimental observations and numerical\nsimulation that it is the nonlinear interaction between the waves that is responsible for gener-\nation of the direct and inverse cascade in the wave system. Multiple freak waves were found\nto be created during the transient process towards the state where the inverse cascade exists\nin steady state. We suggest that the underlying mechanism for the development of the freak\nwaves in superfluid helium, i.e. the decay instability of large amplitude waves, is similar to that\nresponsible for the generation of huge waves on the ocean surface.\nAcknowledgements\nWe acknowledge valuable discussions with Mark Dykman, Evgenii Kuznetsov, Alexandr Levchenko\nand Vladimir Zakharov. The work was supported by the Engineering and Physical Sciences Re-\nsearch Council (UK), by the Royal Society of London, by the Presidium of the Russian Academy\nof Sciences, and by the Russian Foundation for Basic Research.\nReferences\n1. C. Kharif, E. Pelinovsky, Eur. J. Mech. B\/Fluids 22, 603 (2003)\n2. E.N. Pelinovsky, A. Slunyaev, A. Slunyaev, Rogue Waves in the Ocean (Springer-Verlag, Berlin,\n2008)\n3. A.N. Ganshin, V.B. Efimov, G.V. Kolmakov, L.P. Mezhov-Deglin, P.V.E. McClintock, Phys. Rev.\nLett. 101(6), 065303 (2008)\n4. N. Akhmediev, A. Ankiewicz, M. Taki, Phys. Lett. A 373, 675 (2009)\n5. N. Akhmediev, J.M. Soto-Crespo, A. Ankiewicz, Phys. Lett. A 373, 2137 (2009)\n6. S. Haver, O.J. Andersen, Freak waves: Rare realizations of a typical population or typical realizations\nof a rare population?, in Proc. 10th Intern. Offshore and Polar Engineering Conf., edited by J.S.\nChung, R.M.W. Frederking, H. Saeki, W. Koterayama (ISOPE, Cupertino, CA, 2000), Vol. III,\npp. 123–130\n7. A.I. Dyachenko, V.E. Zakharov, JETP Lett. 81, 255 (2005)\n8. V.E. Zakharov, J. Appl. Mech. Tech. Phys. 9(2), 190 (1968)\n9. N. Akhmediev, J.M. Soto-Crespo, A. Ankiewicz, Phys. Rev. A 80, 043818 (2009)\n10. M. Onorato, T. Waseda, A. Toffoli, L. Cavaleri, O. Gramstad, P.A.E.M. Janssen, T. Kinoshita,\nJ. Monbaliu, N. Mori, A.R. Osborne et al., Phys. Rev. Lett. 102(11), 114502 (2009)\n11. D.R. Solli, C. Ropers, P. Koonath, B. Jalali, Nature 450(06402), 1054 (2007)\n12. A. Montina, U. Bortolozzo, S. Residori, F.T. Arecchi, Phys. Rev. Lett. 103, 173901 (2009)\nWill be inserted by the editor 13\n13. D.H. Peregrine, J. Austral. Math. Soc. Ser. B 25, 16 (1983)\n14. L. Onsager, S. Machlup, Phys. Rev. 91(6), 1505 (1953)\n15. M.I. Dykman, P.V.E. McClintock, V.N. Smelyanskiy, N.D. Stein, N.G. Stocks, Phys. Rev. Let.\n68(18), 2718 (1992)\n16. D.G. Luchinsky, P.V.E. McClintock, Nature 389(6650), 463 (1997)\n17. J. Wilks, The Properties of Liquid and Solid Helium (Clarendon Press, Oxford, 1967)\n18. F. London, Nature 141, 643 (1938)\n19. A.J. Dessler, W.H. Fairbank, Phys. Rev. 104, 6 (1956)\n20. G.V. Kolmakov, V.B. Efimov, A.N. Ganshin, P.V.E. McClintock, L.P. Mezhov-Deglin, Phys. Rev.\nLett. 97, 155301 (2006)\n21. V.B. Efimov, A.N. Ganshin, P.V.E. McClintock, G.V. Kolmakov, L.P. Mezhov-Deglin, J. Low\nTemp. Phys. 145, 155 (2006)\n22. G. Falkovich, M. Meyer, Phys. Rev. E 54, 4431 (1996)\n23. M.Y. Brazhnikov, V.B. Efimov, G.V. Kolmakov, A.A. Levchanko, E.V. Lebedeva, L.P. Mezhov-\nDeglin, Low Temp. Phys. 30(6), 441 (2004)\n24. V.E. Zakharov, V.S. L’vov, G. Falkovich, Kolmogorov Spectra of Turbulence I (Springer, Berlin,\n1992)\n25. V.L. Pokrovskii, I.M. Khalatnikov, Sov. Phys. JETP 44, 1036 (1976)\n26. V.S. L’vov, V.B. Cherepanov, Sov. Phys. JETP 54, 746 (1982)\n27. G.V. Kolmakov, Low Temp. Phys. 29(6), 495 (2003)\n28. L. Boltzmann, in Theoretical Physics and Philosophical Problems, edited by B. McGuinness (Reidel,\nDordrecht, 1974), p. 15972\n29. D.G. Luchinsky, P.V.E. McClintock, M.I. Dykman, Rep. Prog. Phys. 61(8), 889 (1998)\n"}