{"doi":"10.1111\/j.1365-2133.2006.07549.x","coreId":"138328","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2288","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2288","10.1111\/j.1365-2133.2006.07549.x"],"title":"Trichophyton species: use of volatile fingerprints for rapid identification and discrimination.","authors":["Sahgal, Natasha","Monk, Barry","Wasil, Mohammad","Magan, Naresh"],"enrichments":{"references":[{"id":38071578,"title":"Chemometrics: Data analysis for the laboratory and chemical plants.","authors":[],"date":"2003","doi":"10.1007\/s10809-005-0223-6","raw":"Brereton, R. G. (2003). Chemometrics: Data analysis for the laboratory and chemical plants. Chichester: Wiley.","cites":null},{"id":38071573,"title":"Detection and differentiation between mycotoxigenic and nonmycotoxigenic strains of Fusarium spp. using volatile production profiles and hydrolytic enzymes.","authors":[],"date":"2000","doi":"10.1046\/j.1365-2672.2000.01185.x","raw":"Keshri G, Magan N. Detection and differentiation between mycotoxigenic and nonmycotoxigenic strains of Fusarium spp. using volatile production profiles and hydrolytic enzymes. J Appl Microbiol 2000; 89: 825-833.","cites":null},{"id":38071577,"title":"Detection of Mycobacterium tunerculosis (TB) in vitro and in situ using electronic nose in combination with a neural netwrok system. Biosens Bioelectron","authors":[],"date":"2004","doi":"10.1016\/j.bios.2004.03.002","raw":"Pavlou AK, Magan N, Meecham-Jones J, Brown J, Klatser P, Turner APF. Detection of Mycobacterium tunerculosis (TB) in vitro and in situ using electronic nose in combination with a neural netwrok system. Biosens Bioelectron 2004; 20: 538-544.","cites":null},{"id":38071569,"title":"Early detection and differentiation of spoilage of bakery products. Sens Actuators B","authors":[],"date":"2005","doi":"10.1016\/j.snb.2004.05.032","raw":"Needham R, Williams J, Beales N et al. Early detection and differentiation of spoilage of bakery products. Sens Actuators B 2005; 106: 20-23.","cites":null},{"id":38071575,"title":"Early detection of spoilage moulds in bread using volatile production patterns and quantitative enzyme assays.","authors":[],"date":"2002","doi":"10.1046\/j.1365-2672.2002.01515.x","raw":"Keshri G, Vosey P, Magan N. Early detection of spoilage moulds in bread using volatile production patterns and quantitative enzyme assays. J Appl Microbiol 2002; 92: 165-172.","cites":null},{"id":38071581,"title":"Electronic nose for quality and safety control.","authors":[],"date":"2006","doi":"10.1002\/9780470277805.ch6","raw":"Magan N, Sahgal N. Electronic nose for quality and safety control. In Food Diagnostics, 2006. Edt. L.Nollet and F.Toldra. Blackwell. In Press.14","cites":null},{"id":38071579,"title":"Electronic nose technology for the detection of microbial and chemical contamination of potable water.","authors":[],"date":null,"doi":"10.1016\/j.snb.2004.05.029","raw":"Canhoto O, Magan N. Electronic nose technology for the detection of microbial and chemical contamination of potable water. Sens Actuators B 2005;106: 3-6.","cites":null},{"id":38071571,"title":"Electronic noses and disease diagnostics.","authors":[],"date":"2004","doi":"10.1038\/nrmicro823","raw":"Turner APF, Magan N. Electronic noses and disease diagnostics. Nature Microbiology Reviews 2004; 2: 161-166.","cites":null},{"id":38071574,"title":"Milk sense: a volatile sensory system for detection of microbial spoilage by bacteria and yeasts in milk. Sens Actuators B","authors":[],"date":"2001","doi":"10.1016\/s0925-4005(00)00621-3","raw":"Magan N, Pavlou A, Chrysanthakis I. Milk sense: a volatile sensory system for detection of microbial spoilage by bacteria and yeasts in milk. Sens Actuators B 2001; 72: 28-34.","cites":null},{"id":38071567,"title":"Rapid discrimination among dermatophytes, Scytalidium spp., and other fungi with a PCR-restriction fragment length polymorphism ribotyping method.","authors":[],"date":"2001","doi":"10.1128\/jcm.39.2.685-690.2001","raw":"Machouart-Dubach M, Lacroix C, de Chauvin MF et al. Rapid discrimination among dermatophytes, Scytalidium spp., and other fungi with a PCR-restriction fragment length polymorphism ribotyping method. J Clin Microbiol 2001; 39: 685-690.","cites":null},{"id":38071568,"title":"Species identification and strain differentiation of dermatophyte fungi using polymerase chain reaction amplification and restriction enzyme analysis.","authors":[],"date":"2003","doi":"10.1067\/mjd.2003.491","raw":"Shin J-H, Sung J-H, Park S-J, Kim JA et al. Species identification and strain differentiation of dermatophyte fungi using polymerase chain reaction amplification and restriction enzyme analysis. J Am Acad Dermat 2003; 48: 857-865.","cites":null},{"id":38071566,"title":"The dermatophytes. Clin Microbiol Rev","authors":[],"date":"1995","doi":null,"raw":"Wietzman I, Summerbell, RC. The dermatophytes. Clin Microbiol Rev 1995; 8:240-","cites":null},{"id":38071570,"title":"The how and why of electronic noses.","authors":[],"date":"1998","doi":"10.1109\/6.715180","raw":"Nagle H. T., Schiffman S. S., Gutierrez-Osuna R. The how and why of electronic noses. IEEE Spectrum 1998; 35: 22-34.13","cites":null},{"id":38071576,"title":"Use of an electronic nose system for diganoses of urinary tract infections. Biosens Bioelectron","authors":[],"date":"2002","doi":null,"raw":"Pavlou A, Magan N, McNulty C et al. Use of an electronic nose system for diganoses of urinary tract infections. Biosens Bioelectron 2002; 17; 893-899.","cites":null},{"id":38071572,"title":"Volatiles in grain as an indicator of fungal spoilage, odour descriptors for classifying spoiled grain and the potential for early detection using electronic nose technology: A review.","authors":[],"date":"2000","doi":"10.1016\/s0022-474x(99)00057-0","raw":"Magan N, Evans P. Volatiles in grain as an indicator of fungal spoilage, odour descriptors for classifying spoiled grain and the potential for early detection using electronic nose technology: A review. J Stored Prod Res 2000; 36: 319-340.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12","abstract":"Background: Fungal infection of the skin is a common clinical problem, and laboratory\nconfirmation of the diagnosis is important to ensure appropriate treatment. The identification\nof the species of fungus is also important, because different fungal species have different\nmodes of transmission, and this may be of importance both in preventing re-infection or in\navoidance of infection of others.\nObjective: This study examined the potential of using volatile production patterns for the\ndetection and discrimination between four Trichophyton species (T. mentagrophytes, T.\nrubrum, T. verrucosum and T. violaceum) in vitro on solid media and in broth culture.\nMethods: Two different sensor array systems (conducting polymer and metal oxide sensors)\nwere examined for comparing the qualitative volatile fingerprints produced by these species\nover periods of 24-120 hrs in the headspace. The relative sensitivity of detection of two of the\nspecies (T. mentagrophytes, T. rubrum) was determined for log1 to log7 inoculum levels over\nthe same time period.\nResults: The conducting polymer based system was unable to differentiate between species\nbased on volatile fingerprints over the experimental period. However, metal oxide-based\nsensor arrays were found to be able to differentiate between the four species within 96 hrs of\ngrowth using PCA analysis which accounted for approximately 93% of the data in PC1 and 2\nbased on the qualitative volatile production patterns. This differentiation was confirmed by\nthe Cluster analysis of the data using Euclidean distance and Ward’s linkage. Studies of the\nsensitivity of detection showed that for T. mentagrophytes and T. rubrum it was possible to\ndifferentiate between log3, log5 and log7 inoculum levels within 96 hrs.\nConclusions: This is the first detailed study of the use of qualitative volatile fingerprints for\nidentification and discrimination of dermatophytes. This approach could have potential for\nrapid identification of patient samples reducing significantly the time to treatment","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138328.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/2288","pdfHashValue":"32d13efefec95ceba1604f751d466d8ab79f2333","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2288<\/identifier><datestamp>2008-02-05T09:54:41Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Trichophyton species: use of volatile fingerprints for rapid identification and discrimination.<\/dc:title><dc:creator>Sahgal, Natasha<\/dc:creator><dc:creator>Monk, Barry<\/dc:creator><dc:creator>Wasil, Mohammad<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:subject>Trichophyton species<\/dc:subject><dc:subject>early detection<\/dc:subject><dc:subject>electronic nose<\/dc:subject><dc:subject>volatile fingerprints<\/dc:subject><dc:description>Background: Fungal infection of the skin is a common clinical problem, and laboratory\nconfirmation of the diagnosis is important to ensure appropriate treatment. The identification\nof the species of fungus is also important, because different fungal species have different\nmodes of transmission, and this may be of importance both in preventing re-infection or in\navoidance of infection of others.\nObjective: This study examined the potential of using volatile production patterns for the\ndetection and discrimination between four Trichophyton species (T. mentagrophytes, T.\nrubrum, T. verrucosum and T. violaceum) in vitro on solid media and in broth culture.\nMethods: Two different sensor array systems (conducting polymer and metal oxide sensors)\nwere examined for comparing the qualitative volatile fingerprints produced by these species\nover periods of 24-120 hrs in the headspace. The relative sensitivity of detection of two of the\nspecies (T. mentagrophytes, T. rubrum) was determined for log1 to log7 inoculum levels over\nthe same time period.\nResults: The conducting polymer based system was unable to differentiate between species\nbased on volatile fingerprints over the experimental period. However, metal oxide-based\nsensor arrays were found to be able to differentiate between the four species within 96 hrs of\ngrowth using PCA analysis which accounted for approximately 93% of the data in PC1 and 2\nbased on the qualitative volatile production patterns. This differentiation was confirmed by\nthe Cluster analysis of the data using Euclidean distance and Ward’s linkage. Studies of the\nsensitivity of detection showed that for T. mentagrophytes and T. rubrum it was possible to\ndifferentiate between log3, log5 and log7 inoculum levels within 96 hrs.\nConclusions: This is the first detailed study of the use of qualitative volatile fingerprints for\nidentification and discrimination of dermatophytes. This approach could have potential for\nrapid identification of patient samples reducing significantly the time to treatment.<\/dc:description><dc:publisher>Blackwell Publishing<\/dc:publisher><dc:date>2008-02-05T09:53:23Z<\/dc:date><dc:date>2008-02-05T09:53:23Z<\/dc:date><dc:date>2006-12<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>N. Sahgal, B. Monk, M. Wasil, N. Magan, Trichophyton species: use of volatile fingerprints for rapid identification and discrimination. British Journal of Dermatology, 2006, v155(6), 1209–1216.<\/dc:identifier><dc:identifier>0007-0963<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/2288<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1111\/j.1365-2133.2006.07549.x<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0007-0963","0007-0963"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Trichophyton species","early detection","electronic nose","volatile fingerprints"],"subject":["Postprint"],"fullText":"1British Journal of Dermatology, Volume 155, Issue 6, pp1209-1216, December 2006\nTrichophyton species: use of volatile fingerprints for rapid identification\nand discrimination\nNatasha Sahgal, Barry Monk*, Mohammad Wasil* and Naresh Magan\nApplied Mycology Group, Cranfield Health, Cranfield University, Silsoe, Bedford MK45\n4DT, U.K. and *Bedford Hospital NHS Trust, South Wing, Britania Road, Bedford MK42\n9DJ, U.K.\nCorresponding author: Prof. N. Magan, Applied Mycology Group, Cranfield Health,\nCranfield University, Silsoe, Bedford MK45 4DT, U.K. Tel: 01525 863539; Fax: 01525\n863540; e-mail: n.magan@cranfield.ac.uk\nKey words: Trichophyton species, early detection, electronic nose, volatile fingerprints\nConflict of interest: None\n2Summary\nBackground: Fungal infection of the skin is a common clinical problem, and laboratory\nconfirmation of the diagnosis is important to ensure appropriate treatment. The identification\nof the species of fungus is also important, because different fungal species have different\nmodes of transmission, and this may be of importance both in preventing re-infection or in\navoidance of infection of others.\nObjective: This study examined the potential of using volatile production patterns for the\ndetection and discrimination between four Trichophyton species (T. mentagrophytes, T.\nrubrum, T. verrucosum and T. violaceum) in vitro on solid media and in broth culture.\nMethods: Two different sensor array systems (conducting polymer and metal oxide sensors)\nwere examined for comparing the qualitative volatile fingerprints produced by these species\nover periods of 24-120 hrs in the headspace. The relative sensitivity of detection of two of the\nspecies (T. mentagrophytes, T. rubrum) was determined for log1 to log7 inoculum levels over\nthe same time period.\nResults: The conducting polymer based system was unable to differentiate between species\nbased on volatile fingerprints over the experimental period. However, metal oxide-based\nsensor arrays were found to be able to differentiate between the four species within 96 hrs of\ngrowth using PCA analysis which accounted for approximately 93% of the data in PC1 and 2\nbased on the qualitative volatile production patterns. This differentiation was confirmed by\nthe Cluster analysis of the data using Euclidean distance and Ward’s linkage. Studies of the\nsensitivity of detection showed that for T. mentagrophytes and T. rubrum it was possible to\ndifferentiate between log3, log5 and log7 inoculum levels within 96 hrs.\nConclusions: This is the first detailed study of the use of qualitative volatile fingerprints for\nidentification and discrimination of dermatophytes. This approach could have potential for\nrapid identification of patient samples reducing significantly the time to treatment.\n3Introduction\nDermatophytes are one of the most common human fungal infectious diseases in the world\nand the leading cause of hair, nail and skin infections in humans. Infection is usually\nrestricted to the cutaneous layers of the skin where dead tissue layers prevail1. The\nTrichophyton group of species are particularly important anthrophilic species. Isolation and\nrapid recognition of such dermatophytes to species level is important to enable appropriate\nremedial drug treatments to be provided. At present this requires samples to be plated on agar-\nbased media to isolate the dominant species present and diagnose whether the relevant species\nis responsible for the infection. This often requires 7-10 days for fast growing species and up\nto three weeks for slow growing species, e.g. T. violaceum. Molecular diagnostics approaches\nhave also shown promise, although in some cases DNA sequences have been found to be\nsimilar to other non-dermatophyte species 2,3. These are neither very cost effective nor\nsuitable for routine clinical testing.\nPrevious studies have demonstrated that different yeasts and filamentous fungal\nspecies produce specific volatile compounds, including alcohols (e.g. butanols, propanols,\nhexanols and octenols), ketones (e.g. propan-, butan-, penta-, and heptan-2-ones), aldehydes\n(e.g. hexanal, 2- and 3-methyl-butan-1-als), and aromatics (e.g. benzaldehyde, benzene based\ncompounds) and methyl, butyl and ethyl esters when analysed using GC-MS4. Sensor arrays\nhave been developed which when exposed to the different volatile groups result in a change in\ntheir physical properties such as mass, conductivity or capacitance which can be measured. It\nis essential that individual sensors have varying sensitivities to the same substance so that\ndifferent odours have a distinct volatile response pattern across the sensors enabling an\nunknown odour to be identified5. Thus by assembling appropriate sensor arrays it is possible\nto obtain a volatile production fingerprint. By using statistical techniques the data can be\n4analysed to try and discriminate between these volatile fingerprints. This has resulted in the\ndevelopment of electronic noses which consist of three basic building blocks: a sensor array,\nsignal conversion system, and software analysis resulting in an output\/result i.e. pattern\nrecognition system. Care is needed to prevent the sensors becoming saturated and thus\naffecting responses to volatiles. These systems are thus ideally placed to be used for early and\nrapid detection of microbial activity in environmental, food and medical applications6. There\nare different sensor array systems which have been used and described in detail elsewhere5,6.\nThe two used in the current study: conducting polymer based systems work at ambient\ntemperatures, while metal oxide and metal ion-based sensors worked effectively at elevated\ntemperatures (200-500°C).\nWhile a significant body of research exists on the application of volatile fingerprints\nfor the detection of fungi in food matrices less attention has been given to medical\nmycological applications 6,8-11. Recent studies have demonstrated that it was possible to\ndifferentiate between bacteria responsible for UTI and also the analyses of sputum samples\nfor the detection of TB 11-12. However, no detailed studies have been conducted in relation to\nfilamentous fungal infections. With regard to dermatophytes the ability to discriminate\nbetween types of infecting species within a few days of isolation would be a major advantage.\nThe objectives of this study were to (a) evaluate two electronic nose-based systems\nbased on conducting polymer and metal oxide sensor arrays for detecting volatile production\npatterns produced by Trichophyton species, (b) using the best system to determine the\noptimum time at which effective discrimination between four different Trichophyton species\ncould be done over periods of 24-120 hrs growth on different solid agar and in liquid broth\ncultures and (c) determine the sensitivity threshold for detection of two individual species, T.\nmentagrophytes and T. rubrum when present at initial concentrations of log1-log7 CFUs ml-1.\n5Materials and Methods\nFungal species\nThe four species used in this study were Trichophyton mentagrophytes (stat. conid. of\nArthroderma vanbreuseghemii, No. 224); T. rubrum (No.115 and strain D12); T. verrucosum\n(No. 685); and T. violaceum (No. 677). All were human isolates and obtained from the\nNational Collection of Pathogenic Fungi, Bristol, U.K., except strain D12 which was kindly\nprovided by the University of Oxford.\nCultivation media\nFor in vitro studies the cultures were grown on two types of solid media:\nSabouraud Brain Heart Infusion (SABHI) Agar was prepared by mixing Brain Heart Infusion\n(BHI) agar (Oxoid) and supplementing with the required amount of Glucose (Acros\nChemicals) with the addition of a small amount of the antibiotic, Chloramphenicol (Sigma)\n[47g l-1 BHI + 38 g l-1 Glucose]. The second agar-based medium was Sabouraud Dextrose\nAgar (SDA) which was prepared in house by mixing 10g l-1 Mycological peptone\n(Amersham), 40 g l-1 Glucose (Acros Chemicals) and 15 g l-1 Agar technical no. 3 (Oxoid). A\nsmall amount of antibiotic, Chloramphenicol (Sigma) was also added. The liquid broth\nmedium was Sabouraud Dextrose as prepared for SDA above, without the addition of the agar.\nDiscrimination between species\nAt least 25 replicate agar plates were inoculated with 0.25 ml of a 106 spore ml suspension of\neach of the four Trichophyton species and spread plate on the agar surface. The plates were\nincubated at 25°C for 24-120 hrs and 5 replicate plates destructively sampled. Four 2 cm\ndiameter discs of the cultures were placed into 25 ml vials left for 1 hr to equilibrate and then\nthe headspace was analysed using the two sensor array systems. Studies were carried out with\n6each of the solid and liquid media and repeated at least twice. Initial studies suggested that at\n>120 hrs significant visible growth occurred and the amount of volatiles produced by all\nspecies resulted in saturation of the sensor arrays and thus less separation between fungal\ntreatments.\nSensitivity of detection\nStudies were conducted with T. mentagrophytes and T. rubrum using both the solid agar\nmedia and liquid broth medium. Spore suspensions were made from 10-15 day old cultures\nand the initial concentration determined using a haemocytometer. The stock solution was\ndiluted appropriately to obtain treatments of 101, 103, 105 and 107 CFUs ml-1. Treatment\nmedia were spore lawn inoculated and 25 replicates of each incubated at 25°C for up to 120\nhrs as before. Studies were also carried out in the liquid SD broth medium in shaken cultures.\nIn all cases four 2 cm diameter agar discs from the solid media were placed in the\nsample tubes which were sealed with a septa and screw top lid. The samples were allowed to\nequilibrate for 1 hr before measurement of the volatile production profiles.\nElectronic sensor array systems\nConducting polymer-based system: Single replicate 9 cm diameter Petri plate cultures were\nplaced in sampling bags (500 ml capacity), with the lid carefully removed, filled with filter-\nsterilized air and sealed. The bags were incubated for 1 h at 25oC, to equilibrate the headspace.\nThe headspace from each bag was subsequently sampled through an air-filter system, which\nconsisted of a bio-filter (0.45 m, PTFE Whatman, Hepa-Vent) and an activated carbon filter\n(Whatman), to ensure clean airflow. An electronic nose system (BH114, Bloodhound Sensors,\nUK) that uses an array of 14 conducting polymer sensors was used in this study. Samples\n7were analysed randomly, including the controls. The data was collected and analysed by the\ne-nose software package system5.\nMetal oxide\/ion sensor array system (Applied Sensors): Samples were placed in the NST\n3220 Lab Emission Analyser carousel. This system has 10 MOSFET sensors, 12 MOS\nsensors, a CO2 and Humidity sensor. It employs an automated robotic needle to draw sample\nheadspace from a sealed container sampling vial, and the sample exposed to the sensor array.\nData were analyzed using principal component analysis (PCA) and cluster analysis (CA).\nData analysis\nThe data collected was analysed by in-built software packages in the electronic nose systems\nand Statistica 7. For the Bloodhound, normalised data for divergence, a sensor parameter\nindicating maximum step response, was analysed using XLStat (a Microsoft Excel add-in).\nMultivariate statistics involving Principal Component Analysis (PCA) and hierarchical\nCluster Analysis (CA) were applied to the obtained sensor responses.\nPrincipal Component Analysis (PCA): This is an effective unsupervised and linear\npattern recognition technique which helps identify general relationships within the data. It\nreduces the dimensionality of the data by preserving maximum information from the original\ndata set (seeks a direction in space which captures maximal variance) with minimum number\nof variables. The new variables (principal components, PC) are derived such that the first PC\naccounts for as much of the variance as possible in the data, with each subsequent PC\narranged in decreasing order of variance. It thus helps in summarising the data with little loss\nof information. The relationship between the samples can be visualised by means of a score\nplot.\n8Cluster Analysis (CA): This is another unsupervised, linear pattern recognition\ntechnique that enables one to establish\/determine the relationships between samples and\nsample groups in a graphical way. Initially, the similarities between the samples are\ndetermined by measuring the distances between them, two at a time using the various distance\nmeasures (for e.g. Euclidean distance). Samples are said to be similar when the distance\nbetween them is short. Then clusters with the smallest distance are aggregated together by\nlinkage algorithms (for e.g. Ward’s method) to form larger clusters, the result of which is\nrepresented by means of a dendrogram i.e. tree-diagram13. The axis on the dendrogram\ndenotes the linkage distance.\nResults\nDiscrimination between Trichophyton species\nExperiments were initially conducted with all four species grown on agar-based media and\nthe headspace of up to 5 replicates per treatment were examined using both the conducting\npolymer and metal oxide\/ion based sensor array for discrimination. The replication of the\ntreatments was examined and found to be very consistent. Figure 1 compares the sensor array\nresponses for the metal oxide\/ion based system by comparing responses of blanks with a\ntreatment species. There are clear differences in volatile fingerprints between treatments and\nthe variation between replicates was relative small and consistent. The relative respiration of\nthe treatments also increased with time, over the incubation period. Figure 2 shows that over\nthe experimental time period (24 to 120 hrs) the respiration of each species was slightly\ndifferent and generally increased with time. This period was chosen because it represents\nearly microscopic and visible growth, when identification is difficult.\n9Figure 3 shows the PCA using the conducting polymer sensor array. This produced\nvery little discrimination between the species examined. However, much better results were\nobtained with the alternative sensor array system. Within 72 hrs T. mentagrophytes and T.\nrubrum was differentiated from the other species based on the PCA analyses (highlighted by\nthe author) (Figure 4). Figure 5 shows that after 96 hrs it was possible to separate all four\nspecies based on their volatile fingerprints (highlighted by the author). This accounted for\napprox 97 % of the data. Data after 24-48 hrs was found to be too early for adequate volatile\nproduction to enable discrimination between the species.\nThis was confirmed when the Cluster analysis (using the Euclidean distance measure\nand Ward’s linkage) were examined between the different replicates and treatments. This\nshowed that the blanks and all four species were clustered independently (Figure 6). Similar\nresults were obtained in both agar-based and in the liquid broth media.\nThreshold detection limits\nStudies were conducted with T. mentagrophytes and T. rubrum to identify the concentrations\nof spores at which volatile fingerprints could be used for detection. Within 72 hrs it was\npossible to discriminate between the log5 and log7 treatments. Figure 7 shows that after 96\nhrs growth it was possible to differentiate between log3, log5 and log7 initial concentration\nusing PCA 1 and 2 for T. mentagrophytes (highlighted by the author). This accounted for\n>99% of the data. However, log1 and blanks could not be effectively differentiated. This was\nconfirmed by examining the Euclidean distances between the samples. The replicates were\nclustered separately for the log3-log7 treatments, with a mixed grouping of the blanks and\nlog1 initial concentrations (Figure 8). Similar results were obtained for T. rubrum with a\nsensitivity of detection after 96 hrs of log3 initial concentration (data not shown).\n10\nDiscussion\nThis is the first study where qualitative volatile production patterns have been used to try and\ndiscriminate between growth of different Trichophyton species. This suggests that the\nresponses of the metal oxide\/ion sensor array systems were more sensitive to the volatiles\nproduced by this group of filamentous fungi than the conducting polymer based system. This\nmay be because the volatiles generated in the headspace by Trichophyton species are at very\nlow concentrations initially or that the type of volatiles cause very small changes in the\nresistance of the conducting polymer sensor array resulting poor discrimination between\ntreatments.\nThe use of qualitative volatile fingerprints for differentiating between the four species\nrequired at least 96 hrs growth, regardless of medium used. After 24hrs the amount of\nvolatiles produced is too low to enable any discrimination between species. However,\ndiscrimination of the two faster growing species, T. mentagrophytes and T. rubrum, could be\nachieved earlier (48-72 hrs). Previous studies with filamentous fungi have shown that on\nfood-based matrices it was possible to discriminate between Aspergillus and Penicillium\nspecies within about 48 hrs of growth, much earlier than other techniques such as enzyme\nassays and traditional plate counts, which required at least 72 hrs 10. In these studies, no\nvisible growth was present after 48 hrs. More recent studies to discriminate between a\nbacterium, yeast and filamentous fungal species showed that discrimination between the\nspecies was possible using the qualitative volatiles production patterns after 72 hrs. In these\nstudies differences in some key volatiles such as 2-butanone, butanol, pentanol, methyl\nbenzene and 1-hexanol were correlated with this discrimination using GC-MS 5.\nThe threshold level of detection of an individual microbial species is important\nknowledge to enable the potential application of the technique for early and rapid detection of\na pathogen or contaminant. This study suggests that for the two most common Trichophyton\n11\nspecies (T. mentagrophytes and T. rubrum) an initial concentration of about log3-4 spores can\nbe discriminated. Lower initial concentrations (log1-2) produce very low levels of volatiles in\nthe headspace making discrimination very difficult. However, this is comparable with\ndetection limits of bacteria in water 14, micro-organisms in milk 9 and for detection of\nmicrobial contaminants in other food matrices15.\nThis paper has described a potential new and novel method for the rapid identification\nof dermatophytes based on growth from microconidial cultures. Of course, the ability to\ndirectly examine skin scrapings or cultures from skin which may contain arthrospores may be\nmore challenging. However, provided enough background data is acquired a library of\ninformation can be obtained for valid comparisons to be made and a diagnostic decision\nobtained. This would ensure that more rapid appropriate treatments can be made. The\nidentification of the species of fungus is also important, because different fungal species have\ndifferent modes of transmission, and this may be of importance, both in preventing re-\ninfection or in avoidance of infection of others. For example, in a case of tinea corporis, the\npresence of Trichophyton rubrum should lead to investigation for other sites of infection, such\nas associated tinea pedis or tinea unguium, whilst the presence of Microsporum canis would\nsuggest contact with a cat or dog.\nConventionally the presence of a dermatophyte may be confirmed by direct\nmicroscopy of skin scrapings in a potassium hydroxide preparation, and the species may be\nsubsequently identified by the appearance on culture using Sabouraud’s medium (or similar).\nMicroscopy has the disadvantage that it requires time and a skilled physician or technician,\ncommodities which are not universally available in a busy clinic; false negative results may\noccur through sampling error. Culture is slow, taking up to three weeks, and this may delay\ninitiation of treatment. This time delay also creates difficulties when one is monitoring\nresponse to treatment (i.e. taking further specimens to confirm clearance) because the results\n12\nmay be some weeks behind the clinical scenario. The fact that culture does take such a long\ntime is also a reason why in practice it is not routine to undertake sensitivity testing in the way\nthat is routine in bacteriology laboratories.\nIn summary, this study has shown a potential method for the rapid identification of\ndermatophytes which allows definition of different species with results available in 96 hours,\nand which may be capable of identifying the presence of fungi in very small quantities. If the\ntechnique could be applied in clinical practice it would present significant advantages to the\nclinician, in terms of early laboratory confirmation of diagnosis, and might even make it\npossible for sensitivity testing to be routine, thereby optimising treatment regimes. We\npropose to undertake a formal study of this technique in a clinical context in the near future.\nReferences\n1. Wietzman I, Summerbell, RC. The dermatophytes. Clin Microbiol Rev 1995; 8:240-\n259.\n2. Machouart-Dubach M, Lacroix C, de Chauvin MF et al. Rapid discrimination among\ndermatophytes, Scytalidium spp., and other fungi with a PCR-restriction fragment\nlength polymorphism ribotyping method. J Clin Microbiol 2001; 39: 685-690.\n3. Shin J-H, Sung J-H, Park S-J, Kim JA et al. Species identification and strain\ndifferentiation of dermatophyte fungi using polymerase chain reaction amplification\nand restriction enzyme analysis. J Am Acad Dermat 2003; 48: 857-865.\n4. Needham R, Williams J, Beales N et al. Early detection and differentiation of spoilage\nof bakery products. Sens Actuators B 2005; 106: 20-23.\n5. Nagle H. T., Schiffman S. S., Gutierrez-Osuna R. The how and why of electronic\nnoses. IEEE Spectrum 1998; 35: 22-34.\n13\n6. Turner APF, Magan N. Electronic noses and disease diagnostics. Nature Microbiology\nReviews 2004; 2: 161-166.\n7. Magan N, Evans P. Volatiles in grain as an indicator of fungal spoilage, odour\ndescriptors for classifying spoiled grain and the potential for early detection using\nelectronic nose technology: A review. J Stored Prod Res 2000; 36: 319-340.\n8. Keshri G, Magan N. Detection and differentiation between mycotoxigenic and non-\nmycotoxigenic strains of Fusarium spp. using volatile production profiles and hydrolytic\nenzymes. J Appl Microbiol 2000; 89: 825-833.\n9. Magan N, Pavlou A, Chrysanthakis I. Milk sense: a volatile sensory system for\ndetection of microbial spoilage by bacteria and yeasts in milk. Sens Actuators B 2001;\n72: 28-34.\n10. Keshri G, Vosey P, Magan N. Early detection of spoilage moulds in bread using\nvolatile production patterns and quantitative enzyme assays. J Appl Microbiol 2002;\n92: 165-172.\n11. Pavlou A, Magan N, McNulty C et al. Use of an electronic nose system for diganoses\nof urinary tract infections. Biosens Bioelectron 2002; 17; 893-899.\n12. Pavlou AK, Magan N, Meecham-Jones J, Brown J, Klatser P, Turner APF. Detection\nof Mycobacterium tunerculosis (TB) in vitro and in situ using electronic nose in\ncombination with a neural netwrok system. Biosens Bioelectron 2004; 20: 538-544.\n13. Brereton, R. G. (2003). Chemometrics: Data analysis for the laboratory and chemical\nplants. Chichester: Wiley.\n14. Canhoto O, Magan N. Electronic nose technology for the detection of microbial and\nchemical contamination of potable water. Sens Actuators B 2005;106: 3-6.\n15. Magan N, Sahgal N. Electronic nose for quality and safety control. In Food\nDiagnostics, 2006. Edt. L.Nollet and F.Toldra. Blackwell. In Press.\n14\nFigure legends\nFigure 1. Comparison of the replicate responses of (a) metal ion sensors, CO2 and humidity\nsensors and (b) metal oxide sensors to five replicates of blank (B) medium and a treatment\nspecies after 72 hrs growth. The dotted lines indicate the T. mentagrophytes (M) treatment\nresponses.\nFigure 2. The temporal production of CO2 for some treatments over the time scale of the\nexperimental period.\nFigure 3. The PCA map of the data for three Trichophyton species achieved using the\nelectronic nose based on 14 conducting polymer sensor array system after 96 hrs incubation.\nThere is little discrimination between the fungal species. Key to treatments: B1-B5, blank\nagar medium; M1-M5, T. mentagrophytes; R1-R5, T. rubrum, V1-V5, T. verrucosum.\nFigure 4. The PCA map of the data of three Trichophyton species and the blank treatments\nafter 96 hrs using the metal oxide\/ion based electronic nose. This shows clear differentiation\nbetween the species examined on SABHI medium at 25°C. Incubation was for 1 hr in sample\nchambers before headspace analysis. Key to treatments: B, blank agar medium; M, T.\nmentagrophytes; R, T. rubrum, V, T. verrucosum.\nFigure 5. The PCA map showing the discrimination between four species of Trichophyton\nspecies and the blanks after 96 hrs incubation on SDA at 25°C. Samples incubated for 1 hr in\nsample chambers prior to headspace analyses. Key to treatments: B, blank agar medium; M, T.\nmentagrophytes; R, T. rubrum, VE, T. verrucosum; VI, T. violaceum. This is based on using\nseven selected sensors).\n15\nFigure 6. Dendrogram showing the Cluster analysis and separation of the four Trichophyton\nspecies and the blanks after 96 hrs on SDA medium using Wards method and the Euclidian\ndistances between samples. Key to treatments: B, Blank; VI, T. violaceum; VE, T.verrucosum\nand; R, T. rubrum; M, T. mentagrophytes.\nFigure 7. PCA map of treatments of T. mentagrophytes of different initial concentrations\n(log1-log7) grown for 96hrs at 25°C on a solid agar medium.\nFigure 8. Dendrogram showing the Cluster analysis and separation of the different initial\nconcentrations (log1 to log7) of T. mentagrophytes after 72 hrs at 25°C using Wards method\nand the Euclidian distances between samples. Key to treatments: B, Blank; 1, log1; 3, log3, 5,\nlog5, 7, log7.\n"}