{"doi":"10.1088\/0169-5983","coreId":"113873","oai":"oai:epubs.surrey.ac.uk:2918","identifiers":["oai:epubs.surrey.ac.uk:2918","10.1088\/0169-5983"],"title":"A study of mixing in coherent vortices using braiding factors","authors":["Turner, MR","Berger, MA"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04-01","abstract":"This paper studies the use of braiding fluid particles to quantify the amount of mixing within a fluid flow. We analyze the pros and cons of braid methods by considering the motion of three or more fluid particles in a coherent vortex structure. The relative motions of the particles, as seen in a space–time diagram, produce a braid pattern, which is correlated with mixing and measured by the braiding factor. The flow we consider is a Gaussian vortex within a rotating strain field that generates cat's eyes in the vortex. We also consider a modified version of this strain field that contains a resonance frequency effect that produces multiple sets of cat's eyes at different radii. As the thickness of the cat's eyes increases, they interact with one another and produce complex Lagrangian motion in the flow that increases the braiding of particles, hence implying more mixing within the vortex. It is found that calculating the braiding factor using only three fluid particles gives useful information about the flow, but only if all three particles lie in the same region of the flow, i.e. this gives good local information. We find that we only require one of the three particles to trace a chaotic path to give an exponentially growing braiding factor. i.e. a non-zero 'braiding exponent'. A modified braiding exponent is also introduced which removes the spurious effects caused by the rotation of the fluid. This analysis is extended to a more global approach by using multiple fluid particles that span larger regions of the fluid. Using these global results, we compare the braiding within a viscously spreading Gaussian vortex in the above strain fields, where the flow is determined both kinematically and dynamically. We show that the dynamic feedback of the strain field onto the flow field reduces the overall amount of braiding of the fluid particles","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Institute of Physics","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2918<\/identifier><datestamp>\n      2017-10-31T14:07:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2918\/<\/dc:relation><dc:title>\n        A study of mixing in coherent vortices using braiding factors<\/dc:title><dc:creator>\n        Turner, MR<\/dc:creator><dc:creator>\n        Berger, MA<\/dc:creator><dc:description>\n        This paper studies the use of braiding fluid particles to quantify the amount of mixing within a fluid flow. We analyze the pros and cons of braid methods by considering the motion of three or more fluid particles in a coherent vortex structure. The relative motions of the particles, as seen in a space–time diagram, produce a braid pattern, which is correlated with mixing and measured by the braiding factor. The flow we consider is a Gaussian vortex within a rotating strain field that generates cat's eyes in the vortex. We also consider a modified version of this strain field that contains a resonance frequency effect that produces multiple sets of cat's eyes at different radii. As the thickness of the cat's eyes increases, they interact with one another and produce complex Lagrangian motion in the flow that increases the braiding of particles, hence implying more mixing within the vortex. It is found that calculating the braiding factor using only three fluid particles gives useful information about the flow, but only if all three particles lie in the same region of the flow, i.e. this gives good local information. We find that we only require one of the three particles to trace a chaotic path to give an exponentially growing braiding factor. i.e. a non-zero 'braiding exponent'. A modified braiding exponent is also introduced which removes the spurious effects caused by the rotation of the fluid. This analysis is extended to a more global approach by using multiple fluid particles that span larger regions of the fluid. Using these global results, we compare the braiding within a viscously spreading Gaussian vortex in the above strain fields, where the flow is determined both kinematically and dynamically. We show that the dynamic feedback of the strain field onto the flow field reduces the overall amount of braiding of the fluid particles.<\/dc:description><dc:publisher>\n        Institute of Physics<\/dc:publisher><dc:date>\n        2011-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2918\/2\/mixing_using_braids_3.1_FDR.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2918\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Turner, MR and Berger, MA  (2011) A study of mixing in coherent vortices using braiding factors   Fluid Dynamics Research, 43 (3), 035501.       <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/0169-5983\/43\/3\/035501<\/dc:relation><dc:relation>\n        10.1088\/0169-5983\/43\/3\/035501<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2918\/","http:\/\/dx.doi.org\/10.1088\/0169-5983\/43\/3\/035501","10.1088\/0169-5983\/43\/3\/035501"],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"A study of mixing in coherent vortices using\nbraiding factors\nM. R. Turner 1 2 & M. A. Berger\nMathematics Research Institute,\nCollege of Engineering, Mathematics and Physical Sciences,\nUniversity of Exeter,\nExeter EX4 4QF, U.K.\nAbstract\nThis paper studies the use of braiding fluid particles to quantify the amount\nof mixing within a fluid flow. We analyze the pros and cons of braid methods by\nconsidering the motion of three or more fluid particles in a coherent vortex structure.\nThe relative motions of the particles, as seen in a space–time diagram, produces a\nbraid pattern, which is correlated with mixing and measured by the braiding factor.\nThe flow we consider is a Gaussian vortex within a rotating strain field which\ngenerates cat’s eyes in the vortex. We also consider a modified version of this strain\nfield which contains a resonance frequency effect that produces multiple sets of cat’s\neyes at different radii. As the thickness of the cat’s eyes increase they interact with\none another and produce complex Lagrangian motion in the flow which increases\nthe braiding of particles, hence implying more mixing within the vortex.\nIt is found that calculating the braiding factor using only three fluid particles\ngives useful information about the flow, but only if all three particles lie in the same\nregion of the flow, i.e. this gives good local information. We find that we only require\none of the three particles to trace a chaotic path to give an exponentially growing\nbraiding factor. i.e. a non–zero ‘braiding exponent’. A modified braiding exponent\nis also introduced which removes the spurious effects caused by the rotation of the\nfluid.\nThis analysis is extended to a more global approach by using multiple fluid par-\nticles that span larger regions of the fluid. Using these global results we compare\nthe braiding within a viscously spreading Gaussian vortex in the above strain fields,\nwhere the flow is determined both kinematically and dynamically. We show that the\ndynamic feedback of the strain field onto the flow field reduces the overall amount\nof braiding of the fluid particles.\n1 Current address: Sir Harry Ricardo Laboratories, School of Computing,\nEngineering and Mathematics, Cockcroft building, University of Brighton, Lewes\nRoad, Brighton. BN2 4GJ. UK\n2 Corresponding author: M.R.Turner@brighton.ac.uk\n12 February 2011\n1 Introduction\nVarious techniques have been used to measure the amount of mixing within\nchaotic flows, such as using the effective diffusion (Shuckburgh and Haynes,\n2003; Turner et al., 2008, 2009b) and Lyapunov exponents (Wolf et al., 1985;\nLichtenberg and Lieberman, 1992; Pierrehumbert and Yang, 1993) to name\nbut two. One of the latest techniques studied for such a purpose is that of par-\nticle braiding (Boyland et al., 2000; Kin and Sakajo, 2005; Thiffeault, 2005,\n2010). Braiding uses the trajectories of particles within the flow to give a mea-\nsure of their entanglement, and hence how chaotic the flow is. The measure\nof entanglement is known as the ‘braiding exponent’ (or the braid’s topolog-\nical entropy) and is a lower bound on the rate of stretching of material lines\n(Boyland et al., 2000) which is related to the traditional finite–time Lyapunov\nexponents (Wolf et al., 1985); the largest positive Lyapunov exponent provides\na measure of chaotic motion in advection (Aref, 1984). The main appeal of the\nbraiding exponent compared to the Lyapunov exponent is the ease with which\nit can be computed, even from crude data sets, without knowledge of the un-\nderlying fluid flow (Kin and Sakajo, 2005; Thiffeault, 2005, 2010). The braiding\nexponent is also more sensitive to global properties of the flow compared to\nLyapunov exponents. The fact that the braiding exponent can be easily com-\nputed makes it appealing to use on fluid dynamics problems, because mixing\nproperties of particular flows can be inferred by solely considering the paths\nof individual particles such as tracer particles in experiments. So far braiding\nhas mainly been used to quantify the mixing properties of idealized dynami-\ncal systems, such as free point vortices (Boyland et al., 2000), fixed blinking\nvortices (Kin and Sakajo, 2005; Thiffeault, 2005) or rod stirring devices etc.\n(Finn et al., 2003; Vikhansky, 2004; Binder and Cox, 2008; Thiffeault et al.,\n2008). Thiffeault (2010) then applied the braiding technique to a set of sea\nfloat data to imply information about the complex motion of the Labrador\nsea (Davis, 2004), however this study did not thoroughly investigate the use\nof braiding on a ‘real’ flow because the flow field in the Labrador sea was not\nknown explicitly, so no connections could be made between the braiding re-\nsults and the motion of the fluid in real space. Therefore, the aim of this work\nis to use this technique on another real flow problem, consisting of a coherent\nvortex structure in a rotating strain field, to examine the pros and cons of this\ndiagnostic and link the braiding results to the motion of the fluid particles in\nreal space. The main reason for conducting this study is because braiding can\nbe used to infer information about a fluid flow, such as the Labrador sea data,\nwithout requiring knowledge of the flow field itself, which could aid experi-\nments where tracer particles are placed in the flow, but the flow field itself is\nunknown.\n2\nWe study the evolution of fluid particle trajectories within the two–dimensional\naxisymmetric Gaussian vorticity field\nω0(r, t) =\n1\n4pi(L2 + tR−1)\nexp\n(\n− r\n2\n4(L2 + tR−1)\n)\n, (1.1)\nwhere L is some initial width of the vortex and R = Γ\/ν is the Reynolds\nnumber based on the total circulation Γ. This vortex is placed in an irrotational\nexternal strain field ψext which takes one of the following two forms: either ψext\nis a steadily rotating strain field with angular velocity αext which generates\ncat’s eyes at a single radius rext within the vortex (Turner and Gilbert, 2007) or\nψext is a rotating strain field with multiple resonant frequencies that generates\nmultiple cat’s eyes which, if wide enough, overlap and produce regions of\ncomplex Lagrangian motion. We examine the effect of both these strain fields\non a steady vortex (1.1) (with R =∞) using a kinematic integral flow model.\nThis approach does not incorporate any feedback of the strain field onto the\nbasic vortex profile (Bassom and Gilbert, 1999; Turner and Gilbert, 2007).\nThis part of the study will provide a flow field which will allow us to examine\nthe limitations of the braiding method and determine in which situations this\ntechnique will be useful.\nOnce the properties of the braiding method have been established for the\nsteady kinematic flow model, we use it to compare the mixing properties of\na kinematic flow and a dynamical flow model. For the strain field which gen-\nerates one set of cat’s eyes in the vortex at r = rext, the dynamical aspects\nof the flow cause the azimuthal averaged profile, ω0(r, t), to flatten (Turner\nand Gilbert, 2007) which leads to enhanced spreading and mixing within the\nvortex. However, it was also observed that this flattening leads to a reso-\nnance effect occurring within the vortex which produces further mixing and\nspreading (Turner and Gilbert, 2009). The resonance effect occurs because the\nvortex profile (1.1) has a particular radius rcat(t) at which inviscid cat’s eyes\nof infinitesimal width can exist without the application of an external strain\nfield (Le Dize`s, 2000). When the radius rcat(t) becomes close to the externally\nforced radius rext(t) there is a rapid feedback in the vorticity field, producing\nlarge–amplitude, non–axisymmetric components of the vorticity field. When\nwe consider the case R = 104 with an initial vortex profile close to a point\nvortex, we find that the value of rcat(0) ≈ 0 and rext(0) lies outside the vortex.\nThen, as the vortex spreads, rcat(t) moves radially outwards (i.e. rcat(t) in-\ncreases) while rext(t) moves radially inwards (rext(t) decreases), until rcat ≈ rext\nand the resonant response occurs. This resonant response does not occur in\nthe kinematic flow model because there is no dynamical feed back onto the\nflow field to generate non–axisymmetric components of vorticity. Bassom and\nGilbert (1999) found that applying a white noise random strain field to (1.1)\nsuppressed the amount of mixing in the core of the vortex. This was extended\nby Turner et al. (2009a), in a nonlinear study, who found that at the edge of\n3\nthe vortex is a ‘vorticity staircase’ which forms a barrier with the core that\nstops vorticity flowing out and creates a ‘surf zone’ of well mixed fluid around\nthe core. In this study we expect to see an enhanced mixing effect similar to\nthis for the multiple cat’s eye strain field as this multiple frequency forcing\nis akin to a random strain, which contains all possible frequencies. The ap-\nproach studied in Turner and Gilbert (2009) is an Eulerian approach which\ngenerated results with a visual appearance of mixing, therefore the present\nstudy quantifies this further by focusing on the Lagrangian aspects of the\nflow.\nThe content of the paper is laid out as follows. In §2 we formulate the kinematic\nintegral flow model, while in §3 we discuss how the braiding results will be\ncalculated. These results are used in §4 where we examine the effect of the\ntwo strain fields on the steady Gaussian vortex (1.1). In §5 we extend these\nresults to an unsteady viscously spreading vortex and compare the kinematic\nflow model results with the dynamical flow simulations. Our conclusions and\ndiscussions are given in §6.\n2 Formulation\nWe study the evolution of a two–dimensional axisymmetric vortex with vor-\nticity profile ω∗0(r\n∗, t∗) in an externally imposed irrotational strain field with\nstream function ψ∗ext(r\n∗, θ, t∗) where (r∗, θ) are plane polar coordinates and the\nstars represent dimensional variables. The irrotational strain field ψ∗ext(r\n∗, θ, t∗)\ntakes the form\nψ∗ext(r\n∗, θ, t∗) = q∗(t∗)r∗meimθ + complex conjugate, (2.1)\nand corresponds to a strain field with an m−fold symmetry in the θ−direction\nand a time dependent part q∗(t∗). The precise form of q∗(t∗) will be given\nlater, but we assume that it has some amplitude Aˆ and that t∗ appears in\nthe combination αextt\n∗, where αext is the angular velocity of the strain field.\nTherefore we introduce the non–dimensional variables\nt = αextt\n∗, r = (αext\/Γ)1\/2r∗,\nwhere Γ is the total circulation in the vortex at t = 0. Therefore, in non–\ndimensional variables, the strain field (2.1) becomes\nψext(r, θ, t) = q(t)r\nmeimθ + complex conjugate, (2.2)\nwhere the amplitude of q(t) is now\nA =\nAˆ\nαext\n(\nαext\nΓ\n)2−m\n, (2.3)\n4\nand in the case where m = 2, corresponds solely to the ratio of dimensional\nstrain amplitude to the dimensional strain angular velocity.\nThe major part of this work focuses on the kinematic flow model where the\ntotal stream function of the flow is given by ψ(r, θ, t) = ψ0(r, t) + ψext(r, θ, t),\nand ψ0(r, t) is found by solving ω0 = −∇2ψ0 for the vortex (1.1). Therefore we\ncan then follow the evolution of an individual fluid particle by simultaneously\nsolving the equations\ndr\ndt\n=\n1\nr\n∂ψ\n∂θ\n,\ndθ\ndt\n= −1\nr\n∂ψ\n∂r\n. (2.4)\nIn this kinematic flow approach, the initial vorticity field is not changed by the\nstrain field, while in the dynamical flow approach, there would be a nonlinear\nfeed back from the velocity field onto the vorticity field through the relation\nω = −∇2ψ (Turner and Gilbert, 2009). The effect of such a feedback and its\ncomparison to the kinematic flow approach is examined in §5.2. Although this\ndynamical flow approach is more realistic in flows with large forcing amplitudes\nA, the kinematic flow simulations are very useful because they contain many\nof the key features seen in the fully dynamical simulations and are much easier\nto simulate and understand.\nIn this paper we focus our attention on the viscously spreading vorticity field\n(1.1) which corresponds to the flow field with stream function\nψ0(r, t) = − 1\n2pi\n∫ r\n0\n1\ns\n(\n1− exp\n(\n− s\n2\n4(L2 + tR−1)\n))\nds, (2.5)\nwhere the parameter L gives the width of the Gaussian vortex at t = 0. We\nset the value L = 0.04 in this study so that comparisons with the work of\nTurner and Gilbert (2009), with R = 104, can be made.\nThe time dependent part of the strain field q(t) from (2.2) will take either of\nthe two forms\nq1(t) = Ae\n−imt, (2.6)\nor\nq2(t) =\nA\nβ\n(\neβe\n−imt − 1\n)\n, (2.7)\nwhere A is the amplitude (2.3) of the forcing and β is a nonlinearity parameter.\nThe stream function ψext with q1(t) (which we denote as ψext1) rotates with\nangular velocity of magnitude unity and generates cat’s eyes in the co–rotating\nstream function ψco = ψ0 + ψext1 + r\n2\/2 at the radius rext. The value of rext is\nfound by solving α(rext, t) = 1 for a particular value of t, where\nα(r, t) =\n1\nr2\n∫ r\n0\nω0(s, t)s ds =\n1\n2pir2\n(\n1− exp\n(\n− r\n2\n4(L2 + tR−1)\n))\n, (2.8)\n5\nis the angular velocity of the vortex (1.1). From (1.1) we can see that the\nvortex spreads on an O(R) timescale, and as the vortex spreads the value of\nrext found by solving α(rext, t) = 1 reduces, until eventually rext = 0 and the\ncat’s eyes vanish from the flow field. It can be shown that the cat’s eyes will\nvanish at t = tvan which satisfies\ntvan = R((8pi)\n−1 − L2),\nwhich for the case L = 0.04 occurs at tvan ≈ 382. For more information on this\nprocess see §3 of Turner and Gilbert (2009). The other strain field ψext with\nq2(t) (denoted by ψext2) is related to ψext1, because in the limit β → 0 both\nstrain fields are identical and only excite one harmonic frequency in the vortex.\nHowever when β 6= 0 then ψext2 excites cat’s eyes at multiple radii which,\nwhen wide enough, interact with one another and produce chaos within the\nvelocity field through resonance overlap (Lichtenberg and Lieberman, 1992).\nWe expect this chaos to produce large amounts of mixing within the vortex,\nso we follow trajectories of individual particles placed in the flow field and\nuse this information to analyse the flow using braiding theory (Boyland et al.,\n2000). For the results in this paper we set the nonlinearity parameter β = 1 as\nthis gives an interesting flow pattern to study. We also solely consider the case\nm = 2, as m = 1 is a pure translation mode, which is of no dynamical interest,\nso m = 2 is the first non–trivial solution to the dynamical flow problem, with\nwhich we make comparisons in §5. Although we only consider m = 2 here, we\nexpect quantitatively similar results for m > 2.\n3 Braid diagnostics\n3.1 Acquiring braid patterns from the flow history\nTo calculate the braiding information we place N particles in the flow field at\ntime t = 0. We then follow their motions. As they move in two–dimensional\nspace and time, a three–dimensional space–time diagram can be used to record\nthe history of their motions. The history of each individual particle is then\ncaptured as a curve in this diagram; the set of N curves can intertwine in some\ncomplex fashion, forming a braid. We choose initial points for the particles at\nthe radial values\nri =\n1\n10\n+\n(i− 1)\n2(N − 1) , i = 1, . . . N, (3.1)\nwith the corresponding θi values distributed randomly in the range [0, 2pi]\nusing a uniform distribution. We analyze the braiding in the flow using at\nleast N = 3 particles. In general, if we follow N particles, we can either\n6\nexamine the complete braid of N curves; or choose subsets of p curves (where\n3 ≤ p < N), to obtain a distribution of braids.\nThe procedure we use to examine the braiding evolution of the particles is\nan extension of that used by Boyland et al. (2003), Vikhansky (2003), and\nThiffeault (2005). The main aim of the method is to relate the motion of the\nparticles to elements of the braid group. Thiffeault (2010) uses an alternative\nmethod to calculate the braiding exponent based on the method of Moussafir\n(2006). This method is more difficult to implement numerically than the one\nwe use in this paper, but it has been shown to give a more accurate braiding\nexponent, while the method in Thiffeault (2005) only gives a lower bound for\nthis value. However, we expect the results of each method to agree qualita-\ntively with one another, and this is sufficient for determining the usefulness\nor otherwise of using braiding on the flows considered here. If more accurate\nvalues of the braiding exponent are required then the method in Thiffeault\n(2010) should be implemented.\nInitially we project the positions of the particles onto the x−axis (this choice is\npurely arbitrary and any reference line can be used), and we label the particles\n1 to p from the smallest x value to the largest. A crossing of two particles\noccurs when they change positions on the x−axis. The interchange can occur\nas an ‘over’ or ‘under’ braid, which refers to a clockwise or counterclockwise\nbraid respectively. Thus we define σi as the clockwise interchange of particles\ni and i + 1, and σ−1i as the counterclockwise interchange, see figure 1. By\nnaming all the such interchanges in this way, we note that the elements σi\nfor i = 1, 2, ..., p − 1 are the generators of the Artin braid group on p strings\n(Murasugi, 1996).\n(a)\ni i+1 i+2\nσ\nσi\ni\n−1\n(b)\ni i+1 i+2\nσi\nσi\n−1\nFig. 1. Diagram showing the possible detected crossings in the flow: (a) Two possible\npartial crossings, each of which are associated to different braid group elements; (b)\nTwo crossings that give no net braid. The reference line is given by the dotted line.\n7\n3.2 The braiding factor\nWe represent each element of the braid group by matrices given by the Burau\nrepresentation (Burau, 1936; Jones, 1987) of the p−braid group. Each element\nof the p−braid group is represented by the (p− 1)× (p− 1) matrix defined by\n[σi]kl = δkl + δk,i−1δli − δk,i+1δli,\nwith inverses\n[σ−1i ]kl = δkl − δk,i−1δli + δk,i+1δli,\nwhere i, k, l = 1, ..., p − 1 and we set δk,0 = δk,p = 0. Note that here σi\nrepresents both the interchange of two particles and its matrix in the Burau\nrepresentation of the Artin braid group. Each of these matrices has determi-\nnant 1, and satisfies the ‘physical braid’ conditions (Murasugi, 1996)\nσiσj = σjσi for |i− j| ≥ 2,\nand\nσiσi+1σi = σi+1σiσi+1.\nFor the case when p = 3, the two braid group elements are represented by the\n2× 2 matrices\nσ1 =\n 1 −1\n0 1\n σ2 =\n 1 0\n1 1\n , (3.2)\nand the physical braid condition reduces to\n∆ = σ1σ2σ1 = σ2σ1σ2, (3.3)\nwhere (3.3) defines ∆.\nAs crossings are detected, due to the motion of the particles, we keep a running\ntotal of the product of these matrices. We denote the product of P (t) matrices\n(P (t) crossings after time t) as\nM (P ) = σ(P )σ(P−1) · · ·σ(2)σ(1), (3.4)\nwhere σ(j) ∈ {σi, σ−1i : i = 1, 2, ..., p − 1}. From this matrix we can define\nthe braiding factor\nλ(t) = max({|eigenvalues of M (P )|}), (3.5)\nat time t .\nThe topological entropy µ(t) is the logarithm of this quantity. The topological\nentropy can be interpreted as follows: if we repeat the braid pattern M (P ) N\n8\ntimes, then at least one material line drawn in the fluid medium will lengthen\nby a factor (\nλ(t)\n)N\n= eµ(t)N . (3.6)\nAs we gather longer and longer histories of the flow, the braid pattern increases\nin length, with a corresponding increase in maximum eigenvalue. For complex\nflows this increase is exponential in time. Thus we can define the finite time\nbraiding exponent as\nΛ(t) =\n1\nt\nln |λ(t)|, (3.7)\nand in the limit t → ∞ we have the braiding exponent defined by Thiffeault\n(2005). When this exponent is positive then we say that the braid sequence\nexhibits ‘topological chaos’. We note that the quantity Λ(t) is a function of\nthe number of particle tracers p.\nIn §4 and §5 when we use the 3−braid braiding factor to analyze local regions\nof the flow, we define the trio of particles starting from radii ra, rb and rc in\n(3.1) as the trio of particles (a, b, c). We also use the p−braid with p > 3 to\ngive us a view of the braiding properties, and hence mixing properties, of the\nwhole flow field.\n3.3 Correcting the braiding factor\nThiffeault (2005) observes that the braiding factor can often exhibit a highly\nerratic behaviour. We also see this behaviour in our simulations (see figure\n5(a)) where the braiding factor suddenly returns to unity at regular intervals.\nIn this section we explain why this happens and define a modification of the\nbraiding factor (3.13) which removes this behaviour.\nThe source of the difficulty with braiding factors lies with the effect of uniform\nrotations. A uniform rotation of a flow should not lead to any mixing, as\nmaterial particles keep their relative positions. Unfortunately, the braiding\nfactor is not completely immune to the influence of rotations, as particles\nstill interchange position on the reference line and so M (P ) gets multiplied by\nanother interchange matrix.\nFor the three–braid system, a half turn of the vortex results in the braid ∆\ndefined in (3.3); a complete turn results in ∆2. The braid ∆2 commutes with\nany other braid B, i.e. ∆2B = B∆2. We note that complete turns do not cause\nany difficulties, as ∆2 has no effect on the braiding factor: the Burau matrix\nis\n∆2 =\n−1 0\n0 −1\n ; (3.8)\n9\nthus the matrix representing a braid ∆2B has the same eigenvalues (in mag-\nnitude) as the matrix representing B.\nHalf turns, however, have an interesting effect. They almost commute with\nother braid elements, in the sense that\n∆σ1 =σ2∆; ∆σ\n−1\n1 = σ\n−1\n2 ∆; (3.9)\n∆σ2 =σ1∆; ∆σ\n−1\n2 = σ\n−1\n1 ∆. (3.10)\nGiven a braid B, let B′ be the braid obtained by switching all 1 indices with\n2 indices; for example if B = σ31σ\n−1\n2 σ1, then B\n′ = σ32σ\n−1\n1 σ2. So we have\n∆B = B′∆ (3.11)\nand\n∆B∆B = ∆2B′B. (3.12)\nRecall that the topological entropy and the braiding factor can be interpreted\nas assuming a braid pattern repeats n times; the stretching of a material line\nin a mixing flow grows exponentially with n (3.6). Thus to understand the\nbehaviour of the braiding factor, we need to understand what happens when\na braid is repeated (see figure 2).\n(a) (b) (c)\nFig. 2. (colour online) (a) The braid M = σ1σ2−1. (b) The braid M ′ = σ2σ1−1. (c)\nThe braid MM ′ = σ1σ2−1σ2σ1−1 = I. The last braid can be smoothed to three\nstraight lines.\n10\nFor example, consider the braid\nM = ∆σ1\naσ2\n−a,\nand let it repeat:\nMM = ∆σ1\naσ2\n−a∆σ1aσ2−a,\n= ∆2σ2\naσ1\n−aσ1aσ2−a,\n= ∆2.\nBy repeating this braid we note that we have lost the entire braid other than\nthe ∆2 term. This vanishing braid occurs whenever our initial braid has an odd\npower of ∆. However if the power of ∆ is even, there would be no cancellation\nof the braid.\nThus in any problem where a braid can acquire net rotations, such as in our\nrotating fluid problem, there is expected to be some erratic behaviour in the\nbraiding factor as the power of ∆ in M (P ) changes from odd to even. the origin\nof this behaviour can be seen in figure 5(a). Thus we modify the braiding factor\nby removing the dependence on powers of ∆ altogether. We achieve this by\nredefining the braiding factor as follows:\nλ(t) = max({|eigenvalues of M (P )|, |eigenvalues of ∆M (P )|}). (3.13)\nThe result significantly smooths the plot of λ(t) vs. time, as seen in the next\nsection.\n4 Steady kinematic flow simulations\nIn this section we examine the braiding properties of the inviscid kinematic\nflow field generated by the vorticity field (1.1) with R = ∞ in each external\nstrain field ψext1 and ψext2. These steady results will provide an example flow\nfield where we can robustly examine the braiding diagnostic using particles\nwithin the flow and link the regions of rapid braiding to regions of chaos within\nthe flow. Here we set the Reynolds number R = 1010, so that in the time frame\nof the simulations, the vortex (1.1) does not spread, so we are able to integrate\n(2.4) for a sufficient amount of time to see interesting behaviour in the vortex.\nAs the vortex does not spread in space, we can produce Poincare´ sections of\nthe velocity field to show how individual particles placed in the flow move as\nthe strain field is applied. These plots for the flow ψ1 = ψ0 +ψext1 can be seen\nin figure 3 and for the flow ψ2 = ψ0 + ψext2 in figure 4, both for (a) A = 0.01,\n(b) A = 0.02 and (c) A = 0.03. These figures are produced by integrating the\n11\nequations (2.4) for 20 evenly spaced particles placed along the y−axis, over\n2000 periods of the strain field and plotting the position of the particle at the\nend of each period. In figure 3 we see that the strain field ψext1 creates cat’s\neyes in the vortex which are clearly visible at the radius rext which satisfies\nα(rext) = 1 (rext = 0.399 in this case). The cat’s eyes increase in size as the\n(a) (b) (c)\nFig. 3. Poincare´ sections of the flow field ψ1 = ψ0 + ψext1 for (a) A = 0.01, (b)\nA = 0.02 and (c) A = 0.03. The cat’s eyes present occur at r = rext which satisfies\nα(rext) = 1.\namplitude value A increases, but it is clear that these flow fields contain no\nregions of chaos. Therefore we should expect no exponential increase in the\nbraiding factor as observed in non–chaotic flows by Thiffeault (2005).\n(a) (b) (c)\nFig. 4. Poincare´ sections of the flow field ψ2 = ψ0 + ψext2 for (a) A = 0.01, (b)\nA = 0.02 and (c) A = 0.03.\nFor the multiple cat’s eye forcing (2.7), we see that for small amplitude values\nin figure 4(a) the multiple cat’s eyes are clearly visible at many radii, located\nbetween r = 0 and r = rext. Between the cat’s eyes lies a coherent flow\nfield with no visible regions of complex Lagrangian motion. However as we\nincrease the amplitude of the forcing to A = 0.02 and 0.03 in figures 4(b) and\n4(c) respectively, the cat’s eyes overlap with one another and give regions of\nchaos within the vortex. This resonance overlap phenomenon (Lichtenberg and\nLieberman, 1992) is a common way to generate chaos in simple systems and the\nresulting flow will produce regions of braiding with a braiding factor which\ngrows exponentially in time. This type of external forcing which produces\nmultiple cat’s eyes within a fluid flow is related to random forcings which occur\nnaturally in flows such as the atmosphere or turbulence. Random forcings do\nnot contain a discrete selection of forcing frequencies, but rather a continuous\nspectrum of all frequencies and so the resonance overlap phenomena naturally\n12\noccurs. We study the forcing (2.7) as it produces similar effects to a random\nforcing but is much simpler to generate and study.\nBefore we make comparisons between the braiding factors of the two velocity\nfields ψ1 and ψ2 we first consider the braiding factor for the strain field ψext1.\nIn figure 5 we plot the trio of particles (3, 15, 37) (defined at the end of §3.2)\nwith A = 0.01. This strain field only generates one pair of cat’s eyes in the\n(a) t\nλ\n 0\n 50\n 100\n 150\n 0  50  100  150  200  250 (b) t\nλ\n 0\n 50\n 100\n 150\n 0  50  100  150  200  250\nFig. 5. Plot of the braiding factor λ(t) for the trio (3, 15, 37) in the flow field ψ1. In\npanel (a) λ(t) is calculated using method (3.5) and in panel (b) λ(t) is calculated\nusing (3.13).\nvortex with no chaos in the flow field. In figure 5(a) we plot the braiding factor\nas given in (3.5) which is the largest eigenvalue of the matrix M (P ), and in this\ncase λ(t) grows linearly in time and regularly returns to unity as the vortex\nrotates. This behaviour is almost identical to that seen by Thiffeault (2005)\n(cf figure 2(a) of his study).\nHowever, this rapid returning to unity is due to the rotation of the vortex,\nand can be removed by taking into consideration the effects of rotation on\nBurau matrices, as discussed in the previous section. Figure 5(b) plots the\nmodified braiding factor for the trio in figure 5(a) using the definition (3.13).\nThis braiding factor contains all the same important information as the first\nbraiding factor, but does not keep returning to unity. The graph becomes\nsmoother and it is now possible to plot more than one braiding factor on\nthe same graph without the figure becoming congested. For these reasons we\nadopt this modified braiding factor as our definition for the remainder of this\npaper.\nIn figure 6(a) we plot the braiding factor λ(t) for the flow field ψ1 with (a)\nA = 0.01 for the trios 1-(20, 21, 22), 2-(10, 20, 30) and 3-(3, 15, 37). These three\ntrios were chosen because result 1 gives three particles very close together and\nso they will all lie within the chaotic region for the forcing ψext2, result 2\ngives three particles which are well spread within the vortex and result 3 has\nthree particles which give one of the highest values of λ(t) at the final time\nt = 250 for the strain field ψext1. These three sets of trios give a good range\n13\n(a)\nλ\nt\n1\n2\n3\n 0\n 50\n 100\n 150\n 0  50  100  150  200  250 (b) t\nλ\n1\n3\n2\n 0\n 50\n 100\n 150\n 0  50  100  150  200  250\nFig. 6. Plot of the braiding factor λ(t) for the flow field ψ1 and (a) A = 0.01 with\ntrios 1-(20, 21, 22), 2-(10, 20, 30) and 3-(3, 15, 37) and (b) the trio (3, 15, 37) with\nA = 0.03, A = 0.02 and A = 0.01 numbered from 1− 3 respectively.\nFig. 7. Plot of r(t) for the three particles from the (3, 15, 37) trio for A = 0.02 and\nψ1.\nof behaviours for trios seen in the vortex. We see that results 2 and 3 give a\nλ(t) which grow linearly in time with very little fluctuation, while the result\nfor trio 1 also gives a linear growth but at a much slower rate and with a\nlot more fluctuation in λ. This linear growth in λ(t) is caused because each\nparticle from the trio is performing a periodic orbit in the vortex. This can\nbe seen in figure 7 which plots the radial coordinates, r(t) from (2.4), of the\n(3, 15, 37) trio for A = 0.02. The θ(t) plot, also from (2.4), would show periodic\nbehaviour, but the figure is much more congested, so we do not show it here.\nFigure 6(b) shows the trio (3, 15, 37) with A = 0.03, A = 0.02 and A = 0.01\nnumbered 1 − 3 respectively. This panel shows that as the size of the cat’s\neyes in the flow ψ1 increases, the growth rate of the braiding factor actually\ndecreases, while all the time remaining linear, although the overall change in\nthe growth rate is small. This is because even though the cat’s eyes increase\nin size, the flow still remains non–chaotic, therefore we only expect the fluid\nparticles to interchange position along the reference line due to the vortex\nrotations, and as this is the case for a vortex with smaller cat’s eyes too, we\n14\nexpect the amount of braiding to be similar in both cases. However, for the\nforcing (2.7), we expect to see significantly different results when the forcing\namplitude A is varied and when we consider different sets of trios.\nλ\n3\nt\n1\n2\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n1010\n 0  200  400  600  800  1000\nFig. 8. Plot of the braiding factor λ(t) for the flow field ψ2 with A = 0.02 and the\ntrios 1-(20, 21, 22), 2-(10, 20, 30) and 3-(3, 15, 37).\n(a) (b)\n(c)\nFig. 9. Plot of r(t) for the flow field ψ2 with A = 0.02 for the trios (a) (20, 21, 22),\n(b) (10, 20, 30) and (c) (3, 15, 37). In panel (a) the paths 21 and 22 have had the\nconstants 0.2 and 0.4 added to each r point respectively to separate them from one\nother.\nFigure 8 plots the braiding factor λ(t) for the flow field ψ2 with A = 0.02 and\nthe three trios (20, 21, 22), (10, 20, 30) and (3, 15, 37) labeled 1 to 3 respectively.\nWe observe that the trio (3, 15, 37) (result 3) which gave the largest braiding\n15\nfactor for the ψ1 case in figure 6(a) only has the largest braiding factor up to\nt ≈ 200. Beyond this time the braiding factor appears to level off on the log\nscale in this figure. Actually the braiding factor is still growing in this region,\nonly now the growth is linear in time. After t = 800 the braiding factor again\ngrows more rapidly. The exponential growth observed in figure 8, which means\nan intense braiding of the fluid particles, was seen in the work of Thiffeault\n(2005) for his chaotic flow, and so it is no surprize that we also see it here.\nWhat is interesting about our result for the braiding factor is that we see a\nregion of exponential growth, i.e. a very long range of braiding, followed by\na region of linear growth, i.e. braiding where all three particles trace periodic\norbits and then another region of exponential growth. These periodic orbits\ncan be clearly seen in figure 9(c) which plots r(t). This figure shows that\nparticles 3 and 37 have periodic orbits, and particle 15 undergoes chaotic\nmotion initially and beyond t = 800. This change in motion agrees well with\nthe change in growth of the braiding factor result in figure 8. Thus, this study\nshows that we only require one of the particles to undergo chaotic motion to\ngive an exponentially growing braiding factor (positive braiding exponent),\nwhile the other two remain in periodic orbits.\nThe trio (10, 20, 30) (result 2) in figure 8 has a region of no braiding from t = 0\nto t ≈ 400 where we see a region of linear growth for λ(t), then we observe a\nregion of rapid exponential growth for λ as particle 20 moves into a chaotic\norbit to produce a large amount of braiding in the vortex which can be seen in\nfigure 9(b). The result 1, which is for three particles very close to one another,\nhas an exponential λ(t) initially and this function remains exponential over\nthe time interval considered. This exponential growth of λ(t) is due to all three\nparticles producing chaotic orbits, so if one of the particles falls into a periodic\norbit, then there is a second particle still tracing a chaotic orbit to give the\npositive braiding exponent. One thing to notice for these results is that all\nof them contain regions of linear growth of λ(t) (i.e. poor mixing) some of\nwhich are long (results 2 and 3) and some of which are much shorter as in\nresult 1. This sort of behaviour is to be expected of a flow which has regions of\nchaos and regions of no chaos, as the exponential growth of λ(t) only requires\n1 particle of the trio to have a chaotic orbit. Therefore, if this particle then\nbecomes close to the edge of the chaotic region, it can spend some time close\nto a periodic orbit and so the braiding rate drops until the particle makes its\nway back into the main part of the chaotic region where the braiding rate,\nλ(t), then grows exponentially again. This is one of the major difficulties with\ntrying to measure the amount of mixing in these types of flows. Some of these\nproblems can be overcome by considering the 50−braid braiding factor (see\nlater) but even these results are not as clean as one would like.\nIn figure 10 we plot the trios (10, 20, 30) and (3, 15, 37) in panels (a) and (b)\nrespectively for A = 0.01, 0.02 and 0.03 numbered 1 to 3 in each panel. For\neach trio the A = 0.01 result gives a linear growth in λ(t) but this could have\n16\n(a)\nλ\nt\n1\n2\n3\n100\n102\n104\n106\n108\n1010\n1012\n1014\n1016\n1018\n1020\n 0  200  400  600  800  1000 (b)\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n 0  200  400  600  800  1000\nt\n1\n2\n3\nλ\nFig. 10. Plot of the braiding factor λ(t) for the flow field ψ2 and (a) the trio\n(10, 20, 30) and (b) the trio (3, 15, 37) for 1- A = 0.01, 2- A = 0.02 and 3- A = 0.03.\nFig. 11. Plot of r(t) for the flow field ψ2 with A = 0.03 and the trio (10, 20, 30).\nbeen anticipated from the Poincare´ section in figure 4(a) in which the vortex\ncontains no visible regions of chaos. For the trio (10, 20, 30) in panel (a) we\nsee that as the forcing amplitude increases, the braiding factor again grows\nlinearly at first and then once particles 20 and 30 move into a region of chaos,\nthe braiding factor grows exponentially in time, interspersed with regions of\nlinear growth (See figure 11 for a plot of r(t) for this trio of particles where it\nis difficult to distinguish between particles 20 and 30 as they trace out their\nrespective paths). This exponential growth of λ(t) occurs earlier as A increases\nbut the overall braiding exponent remains similar to the A = 0.02 result. The\nexponential growth happens earlier because, as can be seen in figure 4, the\nregion of chaos increases in size as A increases, so particles are subject to\nchaotic orbits more readily. In figure 10(b) the result for A = 0.02 (result 2)\nhas chaotic mixing, and an exponential growth in λ(t) for t < 200 and then a\nlinear growth and no mixing until t ≈ 800 where it again grows exponentially\nin time. One might expect as A is increased to 0.03 that there is more mixing\nwithin the flow, but in fact for this trio the exponential growth in λ(t) is\nvery similar for both A = 0.02 and 0.03. However, this could be due to the\nrandom initialization of θi placing the particles in different positions on the\n17\nsame radius.\n(a)\nλ\nt\n 0\n 50\n 100\n 150\n 200\n 0  200  400  600  800  1000 (b)\nFig. 12. Plot of the braiding factor λ(t) for the flow field ψ2 with A = 0.03 and the\ntrio (3, 15, 50) and (b) the corresponding r(t) for this trio.\nOne important thing to note when analysing the 3−braid braiding factor of\na flow is, we have to be very careful about which trio of particles we pick. In\nfigure 12(a) we pick the trio (3, 15, 50) to analyse the chaotic forcing (2.7) for\nA = 0.03 and we find that the braiding factor grows linearly with time, but we\nknow from the Poincare´ section in figure 3(c) that this flow contains a large\nregion of chaos, so one might expect an exponentially growing braiding factor.\nHowever, this case gives an example of a 3−braid where all three particles\nare performing approximate periodic orbits as seen in the r(t) plot in figure\n12(b). Therefore, if we try to infer information about the flow using just these\nthree particles then we might incorrectly assume that there is no chaos in\nthe flow. For this example we know that this is incorrect because we have\nthe Poincare´ section in figure 3(c) to show us otherwise, but if one does not\nhave any information about the flow field, such as the Labrador sea example\nin Thiffeault (2010), then one could infer incorrect characteristics of the flow\nif the wrong trio is analysed. The conclusion here is, the 3−braid gives an\nexcellent indication of how much mixing is going on in specific regions of the\nflow, but to get an overall impression of the mixing properties of the flow,\none should consider the motion of more particles and thus consider a larger\np−braid braiding factor.\nIn figure 13(a) we plot the p−braid braiding factor for the flow field ψ2 with\nA = 0.02 and p = 5, 10, 25 and 50 numbered 1− 4 respectively. Here rather\nthan pick specific particles, we choose equally spaced particles from (3.1).\nThis gives us a braiding factor for the part of the flow we are considering i.e.\n0.1 . r . 0.6. Ideally we would have particles in the entire flow field, but\nas all the interesting behaviour is in this region we don’t expect the braiding\nfactor to change much with the inclusion of particles outside this region. As\nwe increase p, we see that the braiding exponent increases and as p becomes\nlarge the braiding exponent tends to the same value for all p, but with a slow\nincreasing drift. This result is in accord with the findings of Thiffeault (2005)\nwho also found this slow drift in the braiding exponent for large p. In panel (a)\n18\n(a)\n3\n2\n1\n4\nλ\nt\n100\n105\n1010\n1015\n1020\n1025\n1030\n 200  400  600  800  1000 (b)\nλ\nt\n100\n105\n1010\n1015\n1020\n1025\n1030\n 0  200  400  600  800  1000\nFig. 13. Plot of (a) the p−braid braiding factor for ψ2 with A = 0.02 for p = 5, 10, 25\nand 50 numbered 1− 4 respectively. Panel (b) shows the 50−braid braiding factor\nbefore it has been artificially smoothed to give result 4 in panel (a).\nall the braiding factors have been artificially smoothed by considering a 1000\npoint average of the original data which has a time spacing of ∆t = 2.5×10−3,\nso as to remove the rapid oscillations seen in panel (b) which shows the p = 50\nbraiding factor which has not been smoothed. The rapid oscillations are due\nto the increased number of crossings compared to the 3−braid plots, and\nunlike the 3−braid, we cannot easily remove some of these oscillations using\nan argument similar to that in §3.3. This is because when we consider more\nthan three particles in the flow, the number of crossings increases greatly,\nand just removing half turns, as we did for the 3−braid problem, makes no\nsignificant difference to the braiding factor. To smooth out the braiding factor\none would also have to remove partial turns where only some particles have\ninterchanged positions, so this would involved a more complicated form of\n(3.13) where the number of elements in the set to be maximised is much\nlarger. This would greatly increase the running time of the code and hence\nmake it less practical.\nThe use of the p−braid with p large becomes obvious if one is interested in\ncalculating the approximate instantaneous gradient of the lines in figure 13(a)\nto give the time dependent braiding exponent Λ(t). However, the purpose of\nthis paper is to examine the robustness of the use of braids in more ‘realistic’\nfluid flow problems. At this stage we are not interested specifically in the value\nfor the braiding exponent, i.e. we don’t want to state that a flow with A = 0.02\nhas a braiding exponent of 0.4 for example, we just want to know if λ(t) is\nlinear or exponential in time, and whether or not this behaviour changes as\nthe flow evolves in time.\n19\n5 Unsteady kinematic flow and dynamical flow simulations\nThe aim of this research is two fold: Firstly to understand the mixing proper-\nties of vortices by examining their braiding factors, and secondly to compare\nthe results of the kinematic integral flow model with those of the dynamical\nflow model to examine similarities and differences. However as discussed in\n§1, we wish to compare the kinematic flow results with the dynamical flow\nresults of Turner and Gilbert (2009) who show that when rext ≈ rcat in a vis-\ncously spreading vortex, there is a large feedback of the resonant harmonics\nin the vortex which grow rapidly changing the azimuthally averaged vortex\nprofile and producing visual signs of mixing. The purpose of this study is to\nquantify whether or not mixing actually exists in this model. The kinematic\nflow approach will not experience this resonance, and so it is interesting to see\nthe difference between the kinematic and dynamic flow results. Thus in the\nnext section we examine braiding results for a viscously spreading vortex with\nReynolds number R = 104 and we compare these results with the non–linear\ndynamical flow results, of Turner and Gilbert (2009). Before we begin making\ncomparisons between the kinematic integral flow model and dynamical flow\nmodel results, let us first examine the braiding factor of the kinematic flow\nmodel and make comparisons with the steady results in §4, to highlight the\nkey differences.\n5.1 Kinematic integral flow\nTo see what the flow field looks like for the kinematic flow, we plot Poincare´\nsections at various times in figures 14 and 15. As the vortex is viscously spread-\ning for this value of R, we produce Poincare´ sections of what the flow field\nwould look like if it were steady at the various times (a) t = 100, (b) t = 200,\n(c) t = 300 and (d) t = 350 for the velocity field ψ1 with A = 0.02 in figure\n14. To produce these plots we take the form of the vortex at the appropriate\ntime from (1.1) and then produce a steady form of the Poincare´ section. Thus\nwe are taking snapshots of the flow field at a time t.\nWe observe that as the vortex spreads, the cat’s eyes move inward to smaller\nradial values, until eventually at t = tvan = 382 they disappear altogether. We\nnote that as these cat’s eyes move towards the origin, the forcing still does\nnot generate any complex Lagrangian motion in the flow. However, at a time\nclose to when the cat’s eyes vanish, there may be interaction between the cat’s\neyes themselves.\nIn figure 15 we plot the same panels as in figure 14, except this time we plot the\nflow field ψ2 with A = 0.02 which does generate complex Lagrangian motion\n20\n(a) (b)\n(c) (d)\nFig. 14. Poincare´ sections for the flow field ψ1 = ψ0 + ψext1 with R = 104 and\nA = 0.02 at (a) t = 100, (b) t = 200, (c) t = 300 and (d) t = 350.\nin the vortex. In this case we see that at early times we have complex motion\nin the vortex, exactly as in the steady case, but by the time t = 200 in panel\n(b) we see that the flow has become periodic everywhere and we are left with\na vortex with a large set of cat’s eyes, as in the ψext1 forcing case in figure\n14(b), and a smaller set close to r = 0.2. The small set of cat’s eyes remaining\nnear r = 0.2 soon disappear and for the remaining times in panels (c) and\n(d) we have velocity fields which look like their ψ1 counterparts of figure 14.\nHence for these flows we expect to see large amounts of braiding at early times,\nλ(t) growing exponentially in time, but less braiding later, linear λ(t), once\nthe vortex spreads and the complex motion disappears. At this point we then\nexpect the flow to behave like the ψ1 flow.\nIn figure 16 we plot the 3−braid braiding factor for A = 0.02 for the flow\nfields (a) ψ1 and (b) ψ2 for three different trios. For the flow field ψ1, both the\ntrios (3, 15, 37) (result 1) and (10, 20, 30) (result 2) have a similar behaviour, in\nthat their respective braiding factors λ(t) grow linearly up to t ≈ 200 and then\nthere is a brief rapid increase in λ(t), before this growth slows down and λ(t)\ngrows linearly again at later times. The trio (20, 21, 22) (result 3) does not see\nthe same increase around t = 20, and instead just grows linearly for all times,\n21\n(a) (b)\n(c) (d)\nFig. 15. Poincare´ sections for the flow field ψ2 = ψ0 + ψext2 with R = 104 and\nA = 0.02 at (a) t = 100, (b) t = 200, (c) t = 300 and (d) t = 350.\n(a) t\nλ\n3\n1\n2\n 0\n 500\n 1000\n 1500\n 2000\n 0  200  400  600  800  1000 (b) t\n1\n2λ\n3\n 0\n 500\n 1000\n 1500\n 2000\n 0  200  400  600  800  1000\nFig. 16. Plot of the braiding factor λ(t) for the case R = 104 and A = 0.02 for the\nflow fields (a) ψ1 and (b) ψ2. In each panel the lines represent the trios 1–(3, 15, 37),\n2-(10, 20, 30) and 3-(20, 21, 22)\njust as for the steady case in §4. The increase in λ(t) is due to the particles\nbeing shifted around in the vortex as it spreads and appears to correspond\nto the time when two particles radial values coincide. This can be seen for\nthe (3, 15, 37) trio in figure 17(a) where we plot r(t). We see that the particle\nnumbered 37 lies within a cat’s eye initially and so gets drawn towards the\n22\n(a) (b)\nFig. 17. Plot of r(t) for (a) the trio (3, 15, 37) in the flow field ψ1 with R = 104 and\n(b) the trio (20, 21, 22) in the flow field ψ2 with R = 104. The amplitude A = 0.02\nin both panels.\ncentre of the vortex as time increases, and eventually escapes the cat’s eye at\nt ≈ 382 when they disappear. The other two particles on the other hand, which\nlie inside the radius of the cat’s eyes rext, get thrown outwards as they meet\nthe inward moving cat’s eyes. However, as there is no complex Lagrangian\nmotion in the strain field, the particles continue to complete periodic orbits\nas the vortex evolves. Maybe surprisingly, the trios considered here behave\nvery similarly in the flow field ψ2 for which λ(t) is plotted in figure 16(b). The\nonly obvious difference here is that now a different trio gives the largest value\nof λ(t) at large times. When we see how the radius values of the individual\nparticles move in figure 17(b), we see they move similarly to the ψ1 case. The\nearly complex motion moves the particles around in the vortex, and particles\n20 and 21 become trapped within different cat’s eyes and move inwards, while\nparticle 22 remains at a larger radii. Unlike the steady case, the particles are\nnot given enough time in the ‘chaotic’ region to braid sufficiently which would\ngive a positive braiding exponent, and instead the particles have periodic\norbits. This is why the results are similar to the ψ1 flow case.\n(a)\nλ\nt\n1\n2\n3\n 0\n 500\n 1000\n 1500\n 2000\n 0  200  400  600  800  1000 (b) t\nλ\n2\n3\n1\n 0\n 2000\n 4000\n 6000\n 8000\n 0  200  400  600  800  1000\nFig. 18. Plot of the braiding factor λ(t) with R = 104 for the flow fields (a) ψ1 and\n(b) ψ2 for the trio (3, 15, 37). In each panel the lines represent the forcing amplitudes\nA = 0.01, 0.02 and 0.03 numbered 1 to 3 respectively.\nNow that the cat’s eyes are not static in the vortex, and move towards the\n23\ncentre of the vortex, this can affect various aspects of the braiding factor\nevolution. For example in figure 18(b), which shows λ(t) for the trio (3, 15, 37)\nfor the flow ψ2 for A = 0.01, 0.02 and 0.03 numbered 1 − 3 respectively, we\nsee that as A is increased, then so too does λ(t). While for the flow ψ1 in\nfigure 18(a) we find that the A = 0.02 case has a larger value of λ than the\nA = 0.03 case at large times. This could just be a consequence of the starting\nposition of each particle in the different runs, as we note that the initial θ\nposition of each particle is random. However, these results highlight the need\nto consider p−braid braiding factors for these flows with p > 3, so as to get a\ngood quantitative information from the entire vortex.\n5.2 Comparison of the kinematic integral flow model and the dynamical flow\nmodel\nWe now have a large amount of information about how braiding can be used\nto determine mixing properties of flows. In this section we use this information\nto make a comparison between the kinematic integral flow model in §5.1 and\nthe dynamical flow simulations of Turner and Gilbert (2009).\nThe fully nonlinear simulations in Turner and Gilbert (2009) solve the non–\ndimensional Navier–Stokes equations in cylindrical polar coordinates\n∂tω + J(ω, ψ + ψext) = R\n−1∇2ω, ∇2ψ = −ω, (5.1)\nrJ(a, b) = (∂ra)(∂θb)− (∂θa)(∂rb), ψext = q(t)rmeimθ + c.c, (5.2)\nby time stepping (5.1) and seeking solution for ω(r, θ, t) and ψ(r, θ, t) in the\nform of a truncated sum of Fourier harmonics\nω(r, θ, t) =\nQ∑\nk=−Q\nωmk(r, t)e\nimkθ, ψ(r, θ, t) =\nQ∑\nk=−Q\nψˆmk(r, t)e\nimkθ.\nThe external strain field ψext in (5.2) with m = 2 drives the m = 2 mode\nof the vorticity field which then excites higher Fourier harmonics, as well as\nmodifying the basic profile ω0 via the nonlinear terms J(ω, ψ + ψext) of (5.1).\nTo integrate (5.1) we use the Crank–Nicolson method on the linear terms\nand the second order Adams–Bashforth method on the nonlinear terms. The\ndiscretisation in the radial direction uses a finite difference method with S\ngrid points in the range 0 ≤ r ≤ r0, and the Poisson equation for ψ(r, θ, t)\nin (5.1) is solved by inverting a tridiagonal matrix system. The code uses Q\nFourier harmonics and for this study typical resolution values are (Q,S, r0) =\n(128, 1500, 6) for R = 104.\nTurner and Gilbert (2009) only consider the effect of the strain field ψext1,\nand they find that when rext ≈ rcat, the natural quasi–mode radius in the\n24\nvortex at which cat’s eyes can persists with no external forcing, there is a\nresonance effect in the vortex and the vorticity spreads out rapidly until the\ncat’s eyes vanish. For more information on quasi–modes and the resonant effect\nthe reader is referred to this paper. Although this paper did not consider the\nexternal forcing ψext2, we expect similar results to the ψext1 forcing because\nwe saw in figure 15 that the initial complex Lagrangian motion disappears as\nthe vortex spreads leaving a single set of cat’s eyes as in ψext1.\n(a)\n(b)\nFig. 19. (colour online) Plot of the vorticity field for the dynamical flow simulations\nwith R = 104 and A = 0.03 for (a) ψext1 and (b) ψext2. In each panel the vorticity\nhas been scaled so that red (dark grey at the origin) denotes the maximum at that\ntime value.\nIn figure 19 we plot the vorticity field for the nonlinear simulations with R =\n104 and A = 0.03 for (a) ψext1 and (b) ψext2. The addition of the complex\nmotion in ψext2 makes very little difference in these figures, possibly because\nat this Reynolds number the viscous spreading of the vortex is too fast for\nthe complex motion to have a significant effect. However, the complex motion\nin ψext2 does slow the rate of decrease of ω(r = 0, t) which can be seen in\n25\nfigure 20. In figure 20 line 1 gives the slow viscous decrease of the vorticity\n 1\n 10\n 0  100  200  300  400  500\nt\nω(\n1\n2 and 3\n4\n5\n67\nr=0,t)\nFig. 20. Plot of the vorticity value at the origin, ω(r = 0, t) for the dynamical flow\nsimulations with R = 104. Result 1 is the value taken by the kinematic flow model,\nresults 2 and 3 are for ψext1 and ψext2 with A = 0.01, results 4 and 5 are for ψext1\nand ψext2 with A = 0.02 and results 6 and 7 are for ψext1 and ψext2 with A = 0.03.\nThe top horizontal line indicates when rext ≈ rcat while the lower horizontal line is\nwhen the cat’s eyes vanish from the vortex.\nat the origin for the kinematic flow model. We can see that the inclusion of\nthe feedback between the external forcing and flow field causes the value of\nω(r = 0, t) to drop more rapidly due to the resonance effect discussed earlier.\nResult 6 which is for A = 0.03 and ψext1 shows the effect of one set of cat’s\neyes in the vorticity field as reported in Turner and Gilbert (2009). The new\nresult here is the result 7 which gives ω(r = 0, t) for ψext2, and we see that the\ninclusion of the complex Lagrangian motion has made the result differ from\nresult 1 earlier, but also that the rapid decline in ω(r = 0, t) is now slower. We\ntry to quantify this difference in behaviour using the 50–braid braiding factor\nbelow.\nWhen we look at the 50–braid braiding factor for the external forcing ψext1 in\nfigure 21, we see that both the figures for (a) the kinematic flow simulations\nand (b) the dynamical flow simulations look very similar. While curves 2 and\n3 in each panel seem to increase slightly around the time that the cat’s eyes\nvanish (300 ≤ t ≤ 400 in panel (a) and 100 ≤ t ≤ 200 for panel (b)) the\ngrowth in λ(t) is too rapid to tell whether or not it is exponential in time\nat this point, giving a positive braiding exponent, which would then imply\ncomplex Lagrangian motion in the vortex. The reason we don’t see any clear\nexponential growth could be one of three reasons: firstly there may not actually\nbe any complex motion in the vortex as the cat’s eyes vanish, secondly the\namount of complex motion might be small, so the rapid spreading of the vortex\nmight not give us enough time to see such an event or thirdly, we did not place\nparticles close enough to the centre of the vortex to see any complex motion.\nOne could increase the Reynolds number in an attempt to see any complex\n26\n(a) t\nλ\n1\n3\n2\n 0\n 100\n 200\n 300\n 400\n 500\n 600\n 0  100  200  300  400  500 (b)\n13\n2\nλ\nt\n 0\n 200\n 400\n 600\n 800\n 1000\n 1200\n 0  100  200  300  400  500\nFig. 21. Plot of the 50−braid braiding factor for the external forcing ψext1 for (a) the\nkinematic flow simulations and (b) the dynamical flow simulations forA = 0.01, 0.02\nand 0.03 numbered 1− 3 respectively.\nmotion as the cat’s eyes vanish, but Turner and Gilbert (2009) showed that\neven for R = 105 (the top end of the computational time for their code) the\ntime spent with the vortex having cat’s eyes close to vanishing is very short.\nAn examination of the 50–braid braiding factor for ψext2 in figure 22 shows\n(a) t\nλ\n1\n2\n3\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5\n10\n6\n10\n7\n 0  100  200  300  400  500\n(b)\n1\n2\n3\nλ\nt\n100\n101\n102\n103\n104\n105\n106\n 0  100  200  300  400  500\nFig. 22. Plot of the 50−braid braiding factor for the external forcing ψext2 for (a) the\nkinematic flow simulations and (b) the dynamical flow simulations forA = 0.01, 0.02\nand 0.03 numbered 1− 3 respectively.\nthat this gives a much more interesting result. We find that for the kinematic\nflow simulations in panel (a) only λ(t) for the A = 0.03 result (result 3)\nhas an obvious region of exponential growth, and this occurs up to t ≈ 200.\nBeyond this time the complex motion disappears and so the growth in λ(t)\nbecomes linear in time again. The A = 0.02 result (result 2) has a small\nregion of exponential growth up to t ≈ 100, but the small amplitude result\n(result 1) appears to just have linear growth. While the A = 0.01 result for\nthe dynamical flow simulations in panel (b) appears to grow linearly like its\n27\nkinematic counterpart, the other two results both have regions of exponential\ngrowth up to t ≈ 100 which is the time when the rapid spread of vorticity\noccurs. This figure also shows that the rate of increase of λ(t) with time is\ngreater for the dynamical simulation and, at least for A = 0.03, the value of\nλ(500) is less than the kinematic value. This means that the material lines in\nthe chaotic region will be stretched more in the kinematic model but the rate\nof stretching is faster in the dynamic model. The reason they are stretched\nmore in the kinematic model is solely due to the fact that they are stretched\nfor a longer period of time. Approximate values for the braiding exponents\nof both the A = 0.03 results are 0.08 and 0.1 for the kinematic integral flow\nmodel and dynamical flow model respectively. Therefore the outcome is that\nthe nonlinear feedback of the strain field on the vorticity field suppresses the\ntotal amount of braiding (and hence mixing), but the maximum rate at which\nbraiding occurs is increased.\n6 Conclusions and Discussion\nThis work studied the effectiveness of using the braiding diagnostic to quantify\nthe amount of mixing within coherent vortical structures. We used the method\ndetailed in Thiffeault (2005) which represented each of the braiding elements as\nmatrices using their Burau representation. These matrices are then multiplied\ntogether as the trajectories of the fluid elements braid and we computed the\nbraiding factor λ(t) which is the largest eigenvalue of the matrix M (P ) defined\nin (3.4). Other useful invariants could have been computed from the resulting\nbraid (Berger, 2001), but we believe the braiding factor gives the clearest\ninterpretation of mixing in the flow, and thus is the best diagnostic to consider.\nWe also defined a modification of the braiding factor which removes spurious\neffects on the Burau matrices caused by rotation.\nWe found that the braiding factor (and hence the braiding exponent) for three\nparticles gave useful information about the mixing properties of the vortex,\nbut only if all three particles are located in the same region of the flow. When\nthis is the case we found a very clear braiding exponent which increased in\nregions with more chaos. When the three particles were more spread out in the\nflow we still found a positive braiding exponent as long as at least one particle\ntraced out a chaotic trajectory. Usually in this case the regions of exponential\ngrowth in λ(t) are interspersed with regions of linear growth, this suggests\nthat mixing is occurring and then stopping on a regular basis. However, for\nthe flow examples in this paper we knew this was not the case and thus this is a\nlimitation of the 3–braid braiding factor. We found that this limitation can be\novercome by considering more fluid particles that span a larger area of the flow\nfield. By using the 50–braid braiding factor we found more consistent results,\nand if we know information about the flow field, then we can cluster the points\n28\naround the region where mixing is expected to take place. One problem that\ncomes from this multiple particle approach is the uncertainty of how many\nparticles should be used. Fifty particles gave a good, approximately straight\nline (for example see result 4 in figure 13(a)) but this took approximately 16\nhours of CPU time, whereas 25 particles takes only a quarter of this time due\nto the p2 nature of the algorithm, where p is the number of particles. Therefore\na balance needs to be achieved between time taken to compute the braiding\nfactor and the number of particles used in the computation. The other issue\ncomes from the slow increase in the braiding factor as the number of particles\nis increased. This slow drift means that it will be difficult to give a definitive\nbraiding exponent for a flow, but as long as p is large enough then the results\nshould be consistent.\nUsing this 50–braid braiding factor we examined the mixing properties of\na multiple frequency strain field which exhibits resonance overlap (akin to a\nrandom forcing) for both the kinematic flow model and dynamical flow model.\nThe results showed that braiding occurred faster in the dynamical flow model\n(i.e. has a larger maximum rate), while the total braiding was slightly more in\nthe kinematic flow model. This was because, the vortex in the dynamical flow\nmodel spreads more rapidly, due to the enhanced mixing and therefore there\nwas less time where the vortex contained complex Lagrangian motion.\nWe conclude that using the braiding diagnostic is useful for determining the\namount of mixing within a flow field and we believe that it is beneficial over\ndiagnostics such as Lyapunov exponents because information of the flow field\nand its derivatives is not required. Although, it is important to consider a\nsufficient amount of particles in the flow to give a good global picture of the\nmixing. Further investigation of other invariants of the braid itself is now\nrequired to determine if they can improve the understanding of dynamical\nfluid problems.\nAcknowledgments\nThe authors would like to thank Andrew Gilbert for his useful comments and\nsuggestions in the production of this article. This work was partially supported\nby the EPSRC grants EP\/D032202\/1 (University of Exeter), EP\/F069855\/1\n(University of Brighton) and EP\/G000034\/1 (University of Keele).\nReferences\nAref, H. (1984). Stirring by chaotic advection. J. Fluid Mech., 143, 1–21.\nBassom, A. P. and Gilbert, A. D. (1999). The spiral wind-up and dissipation\n29\nof vorticity and a passive scalar in a strained planar vortex. J. Fluid Mech.,\n398, 245–270.\nBerger, M. A. (2001). Topological invariants in braid theory. Lett. Math.\nPhys., 55(3), 181–192.\nBinder, B. J. and Cox, S. M. (2008). A mixer design for the pigtail braid.\nFluid Dynam. Res., 40(1), 34–44.\nBoyland, P., Aref, H., and Stremler, M. A. (2000). Topological fluid mechanics\nof stirring. J. Fluid Mechanics, 403, 277–304.\nBoyland, P., Stremler, M., and Aref, H. (2003). Topological fluid mechanics\nof point vortex motions. Phys. D, 175(1-2), 69–95.\nBurau, W. (1936). U¨ber zopfgruppen und gleichsinnig verdrillte verkettungen.\nAbh. Math. Sem. Hanischen Univ., 11, 171–178.\nDavis (2004). WOCE subsurface float data assembly centre, http:\/\/wfdac.\nwhoi.edu.\nFinn, M. D., Cox, S. M., and Byrne, H. M. (2003). Topological chaos in\ninviscid and viscous mixers. J. Fluid Mech., 493, 345–361.\nJones, V. F. R. (1987). Hecke algebras and a polynomial invariant for knots.\nAnn. Math, 126, 335–388.\nKin, E. and Sakajo, T. (2005). Efficient topological chaos embedded in the\nblinking vortex system. Chaos, 15(2), 023111, 9.\nLe Dize`s, S. (2000). Non-axisymmetric vortices in two-dimensional flows. J.\nFluid Mech., 406, 175–198.\nLichtenberg, A. J. and Lieberman, M. A. (1992). Regular and Chaotic Dy-\nnamics, 2nd ed. Springer (New York).\nMoussafir, J.-O. (2006). On computing the entropy of braids. Funct. Anal.\nOther Math., 1(1), 37–46.\nMurasugi, K. (1996). Knot theory and its applications. Birkha¨user (Boston).\nPierrehumbert, R. T. and Yang, H. (1993). Global chaotic mixing on isentropic\nsurfaces. J. Atmos. Sci., 50, 2462–2480.\nShuckburgh, E. and Haynes, P. H. (2003). Diagnosing transport and mixing\nusing a tracer-based coordinate system. Phys. Fluids, 15, 3342–3357.\nThiffeault, J.-L. (2005). Measuring topological chaos. Phys. Rev. Lett., 94,\n084502.\nThiffeault, J.-L. (2010). Braids of entangled particle trajectories. Chaos, 20,\n017516.\nThiffeault, J.-L., Finn, M. D., Gouillart, E., and Hall, T. (2008). Topology of\nchaotic mixing patterns. Chaos, 18(3), 033123, 8.\nTurner, M. R. and Gilbert, A. D. (2007). Linear and nonlinear decay of cat’s\neyes in two-dimensional vortices, and the link to Landau poles. J. Fluid\nMech., 593, 255–279.\nTurner, M. R. and Gilbert, A. D. (2009). Spreading of two–dimensional ax-\nisymmetric vortices exposed to a rotating strain field. J. Fluid Mech., 630,\n155–177.\nTurner, M. R., Gilbert, A. D., and Thuburn, J. (2008). Effective diffusion of\nscalar fields in a chaotic flow. Phys. Fluids, 20(10), 107103–1–14.\n30\nTurner, M. R., Bassom, A. P., and Gilbert, A. D. (2009a). Diffusion and\nthe formation of vorticity staircases in randomly strained two–dimensional\nvortices. J. Fluid Mech., 638, 49–72.\nTurner, M. R., Thuburn, J., and Gilbert, A. D. (2009b). The influence of\nperiodic islands in the flow on a scalar tracer in the presence of a steady\nsource. Phys. Fluids, 21(6), 067103.\nVikhansky, A. (2003). Chaotic advection of finite-size bodies in a cavity flow.\nPhys. Fluids, 15(7), 1830–1836.\nVikhansky, A. (2004). Simulation of topological chaos in laminar flows. Chaos,\n14(1), 14–22.\nWolf, A., Swift, J. B., Swinney, H. L., and Vastano, J. A. (1985). Determining\nLyapunov exponents from a time series. Physica D, 16, 285–317.\n31\n"}