{"doi":"10.5194\/angeo-25-2053-2007","coreId":"71090","oai":"oai:eprints.lancs.ac.uk:6718","identifiers":["oai:eprints.lancs.ac.uk:6718","10.5194\/angeo-25-2053-2007"],"title":"The driving mechanisms of particle precipitation during the moderate geomagnetic storm of 7 January 2005","authors":["Longden, N.","Honary, F.","Kavanagh, A. J.","Manninen, J."],"enrichments":{"references":[{"id":16384319,"title":"A superposed epoch analysis of geomagnetic storms,","authors":[],"date":"1994","doi":"10.1007\/s005850050088","raw":"Taylor, J., Lester, M., and Yeoman, T.: A superposed epoch analysis of geomagnetic storms, Ann. Geophys., 12, 612–624, 1994, http:\/\/www.ann-geophys.net\/12\/612\/1994\/.","cites":null},{"id":16384287,"title":"Auroral absorption of HF radio waves in the ionosphere: A review of results from the ﬁrst decade of riometry,","authors":[],"date":"1969","doi":"10.1109\/proc.1969.7275","raw":"Hargreaves, J.: Auroral absorption of HF radio waves in the ionosphere: A review of results from the ﬁrst decade of riometry, P. IEEE, 57, 1348–1373, 1969.","cites":null},{"id":16384307,"title":"Correlated effects of energetic electrons at the 6.6Re equator and the auroral zone during magnetospheric substorms,","authors":[],"date":"1968","doi":null,"raw":"Parks, G., Arnoldy, R., Lezniak, T., and Winckler, J.: Correlated effects of energetic electrons at the 6.6Re equator and the auroral zone during magnetospheric substorms, Radio Sci., 3, 715–719, 1968.","cites":null},{"id":16384303,"title":"Cosmic noise absorption accompanying geomagnetic storm sudden commencements,","authors":[],"date":"1962","doi":"10.1029\/jz067i011p04169","raw":"Ortner, J., Hultqvist, B., Brown, R., Hartz, T., Holt, O., Landmark, B., Hook, J., and Leinbach, H.: Cosmic noise absorption accompanying geomagnetic storm sudden commencements, J. Geophys. Res., 67, 4169–4186, 1962.","cites":null},{"id":16384305,"title":"Cosmic radio-noise absorption bursts caused by solar wind shocks,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-2973-2004","raw":"Osepian, A. and Kirkwood, S.: Cosmic radio-noise absorption bursts caused by solar wind shocks, Ann. Geophys., 22, 2973– 2987, 2004, http:\/\/www.ann-geophys.net\/22\/2973\/2004\/.","cites":null},{"id":16384269,"title":"Differences between CME-driven Storms and CIR-driven","authors":[],"date":"2006","doi":"10.1029\/2005ja011447","raw":"Borovsky, J. and Denton, M.: Differences between CME-driven Storms and CIR-driven Storms, J. Geophys. Res., 111, A07S08, doi:10.1029\/2005JA011447, 2006.","cites":null},{"id":16384313,"title":"Evidence for the large-scale azimuthal drift of electron precipitation during magnetospheric substorms,","authors":[],"date":"1970","doi":"10.1029\/ja075i028p05576","raw":"Rosen, L. and Winckler, J.: Evidence for the large-scale azimuthal drift of electron precipitation during magnetospheric substorms, J. Geophys. Res., 75, 5576–5581, 1970.","cites":null},{"id":16384284,"title":"Geomagnetic activity associated with Earth passage of interplanetary shock disturbances and coronal mass ejections,","authors":[],"date":"1991","doi":"10.1029\/91ja00316","raw":"Gosling, J., McComas, D., Phillips, J., and Bame, J.: Geomagnetic activity associated with Earth passage of interplanetary shock disturbances and coronal mass ejections, J. Geophys. Res., 96, 7831–7839, 1991.","cites":null},{"id":16384317,"title":"Geomagnetic negative sudden impulses: Interplanetary causes and polarization distribution,","authors":[],"date":"2002","doi":"10.1029\/2001ja900152","raw":"Takeuchi, T., Araki, T., Viljanen, A., and Watermann, J.: Geomagnetic negative sudden impulses: Interplanetary causes and polarization distribution, J. Geophys. Res., 107, A7, doi:10.1029\/2001JA900152, 2002.","cites":null},{"id":16384276,"title":"Geomagnetic storms driven by ICME- and CIRdominated solar wind,","authors":[],"date":"2006","doi":"10.1029\/2005ja011436","raw":"Denton, M., Borovsky, J., Skoug, R., Thomsen, M., Lavraud, B., Henderson, M., McPherron, R., Zhang, J., and Liemohn, M.: Geomagnetic storms driven by ICME- and CIRdominated solar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436, 2006.","cites":null},{"id":16384261,"title":"Global structure of geomagnetic sudden commencements,","authors":[],"date":"1977","doi":"10.1016\/0032-0633(77)90053-8","raw":"Araki, T.: Global structure of geomagnetic sudden commencements, Planet. Space Sci., 25, 373–384, 1977.","cites":null},{"id":16384323,"title":"High-resolution global storm index: Dst versus SYM-H,","authors":[],"date":"2006","doi":"10.1029\/2005ja011034","raw":"Wanliss, J. and Showalter, K.: High-resolution global storm index: Dst versus SYM-H, J. Geophys. Res., 111, A02202, doi:10.1029\/2005JA011034, 2006.","cites":null},{"id":16384267,"title":"High-Z energetic particles at geosynchronous orbit during the great solar proton event series of","authors":[],"date":"1989","doi":"10.1029\/92ja01139","raw":"Belian, R., Gisler, G., Cayton, T., and Christensen, R.: High-Z energetic particles at geosynchronous orbit during the great solar proton event series of October 1989, J. Geophys. Res., 97, 16897– 16906, 1992.","cites":null},{"id":16384315,"title":"Investigations of ionospheric radio wave absorption processes using imaging riometer techniques,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00072-0","raw":"Stauning, P.: Investigations of ionospheric radio wave absorption processes using imaging riometer techniques, J. Atmos. Terr. Phys., 58, 753–764, 1996.","cites":null},{"id":16384271,"title":"Large-scale electron bombardment of the atmosphere at the sudden commencement of a geomagnetic storm,","authors":[],"date":"1961","doi":"10.1029\/jz066i004p01035","raw":"Brown, R., Hartz, T., Landmark, B., Leinbach, H., and Ortner, J.: Large-scale electron bombardment of the atmosphere at the sudden commencement of a geomagnetic storm, J. Geophys. Res., 66, 1035–1041, 1961.","cites":null},{"id":16384298,"title":"Longden et al.: Particle precipitation during 7","authors":[],"date":null,"doi":null,"raw":"Kokubun, S., Yamamoto, T., Acuna, M., Hayashi, K., Shiokawa, K., www.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 20072068 N. Longden et al.: Particle precipitation during 7 January 2005 storm and Kawano, H.: The GEOTAIL Magnetic Field Experiment, J.","cites":null},{"id":16384321,"title":"Modeling the Earth’s magnetospheric ﬁeld conﬁned within a realistic magnetospause,","authors":[],"date":"1995","doi":"10.1029\/94ja03193","raw":"Tsyganenko, N.: Modeling the Earth’s magnetospheric ﬁeld conﬁned within a realistic magnetospause, J. Geophys. Res., 100, 5599–5612, 1995.","cites":null},{"id":16384265,"title":"Near-equatorial, high-resolution measurements of electron precipitation at Lw6.6,","authors":[],"date":"1981","doi":"10.1029\/ja086ia04p02295","raw":"Baker, D., Stauning P., Hones Jr., E., Higbie, P., and Belian, R.: Near-equatorial, high-resolution measurements of electron precipitation at Lw6.6, J. Geophys. Res., 86(A4), 2295–2313, 1981.","cites":null},{"id":16384296,"title":"Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1306-8","raw":"Khan, H. and Cowley, S.: Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8 Data, Ann. Geophys., 17, 1306–1335, 1999, http:\/\/www.ann-geophys.net\/17\/1306\/1999\/.","cites":null},{"id":16384270,"title":"On the poleward expansion of ionospheric absorption regions triggered by sudden commencements of geomagnetic storms,","authors":[],"date":"1978","doi":"10.1029\/ja083ia03p01169","raw":"Brown, R.: On the poleward expansion of ionospheric absorption regions triggered by sudden commencements of geomagnetic storms, J. Geophys. Res., 83(A3), 1169–1171, 1978.","cites":null},{"id":16384263,"title":"Particle substorms observed at the geostationary orbit,","authors":[],"date":"1969","doi":"10.1029\/ja074i021p05019","raw":"Arnoldy, R. and Chan, K.: Particle substorms observed at the geostationary orbit, J. Geophys. Res., 74, 5019–5028, 1969.","cites":null},{"id":16384273,"title":"Preconditions for the triggering of polar magnetic substorms by storm sudden commencements,","authors":[],"date":"1972","doi":"10.1029\/ja077i028p05629","raw":"Burch, J.: Preconditions for the triggering of polar magnetic substorms by storm sudden commencements, J. Geophys. Res., 77, 5629–5632, 1972.","cites":null},{"id":16384272,"title":"Quadruple conjugate pair observations of the sudden commencement absorption event on","authors":[],"date":"1965","doi":"10.1029\/ja077i028p05602","raw":"Brown, R., Leinbach, H., Akasofu, S.-I., Driatsky, V., and Schmidt, R.: Quadruple conjugate pair observations of the sudden commencement absorption event on June 17, 1965, J. Geophys. Res., 77, 5602–5607, 1972.","cites":null},{"id":16384302,"title":"Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_20","raw":"McComas, D., Bame, S., Barker, P., Feldman, W., Phillips, J., Riley, P., and Griffee, J.: Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci. Rev., 86, 563–612, 1998.","cites":null},{"id":16384311,"title":"Sources of geomagnetic storms for solar minimum and maximum conditions during 1972–2000,","authors":[],"date":"2001","doi":"10.1029\/2001gl013052","raw":"Richardson, I., Cliver, E., and Cane, H.: Sources of geomagnetic storms for solar minimum and maximum conditions during 1972–2000, Geophys. Res. Lett., 28, 2567–2572, 2001.","cites":null},{"id":16384300,"title":"The 10th generation international geomagnetic reference ﬁeld,","authors":[],"date":"2005","doi":"10.1016\/j.pepi.2005.03.006","raw":"Maus, S., MacMillan, S., Chernova, T., Choi, S., Dater, D., Golovkov, V., Lesur, V., Lowes, F., L¨ uhr, H., Mai, W., McLean, S., Olsen, N., Rother, M., Sabaka, T., Thomson, A., and Zvereva, T.: The 10th generation international geomagnetic reference ﬁeld, Phys. Earth Planet. In., 151, 320322, 2005.","cites":null},{"id":16384278,"title":"The Comprehensive Plasma Instrumentation (CPI) for the GEOTAIL spacecraft,","authors":[],"date":"1994","doi":"10.5636\/jgg.46.23","raw":"Frank, L., Ackerson, K., Paterson, W., Lee, J., English, M., and Pickett, G.: The Comprehensive Plasma Instrumentation (CPI) for the GEOTAIL spacecraft, J. Geomagn. Geoelectr., 46, 23–37, 1994.","cites":null},{"id":16384290,"title":"The Solar-Terrestrial Environment,","authors":[],"date":"1992","doi":"10.1017\/cbo9780511628924","raw":"Hargreaves, J.: The Solar-Terrestrial Environment, Cambridge University Press, 1992.","cites":null},{"id":16384309,"title":"Theoryontheprecipitationofmagnetosphericelectrons at the time of sudden commencement,","authors":[],"date":"1972","doi":"10.1029\/ja077i001p00101","raw":"Perona, G.: Theoryontheprecipitationofmagnetosphericelectrons at the time of sudden commencement, J. Geophys. Res., 77, 101– 111, 1972.","cites":null},{"id":16384293,"title":"Two step development of geomagnetic storms,","authors":[],"date":"1998","doi":"10.1029\/97ja03337","raw":"Kamide, Y., Yokoyama, N., Gonzalez, W., Tsurutani, B., Daglis, I., Brekke, A., and Masuda, S.: Two step development of geomagnetic storms, J. Geophys. Res., 103, 6917–6921, 1998.","cites":null},{"id":16384282,"title":"What is a geomagnetic storm?,","authors":[],"date":"1994","doi":"10.1029\/93ja02867","raw":"Gonzalez, W., Joselyn, J., Kamide, Y., Kroehl, H., Rostoker, G., Tsurutani, B., and Vasyliunas, V.: What is a geomagnetic storm?, J. Geophys. Res., 99, 5771–5792, 1994.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71090.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6718\/1\/art_866.pdf","pdfHashValue":"d3cd3ab461db145b1a04e80ca08fa3cb2689ad4b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6718<\/identifier><datestamp>\n      2018-01-24T03:16:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The driving mechanisms of particle precipitation during the moderate geomagnetic storm of 7 January 2005<\/dc:title><dc:creator>\n        Longden, N.<\/dc:creator><dc:creator>\n        Honary, F.<\/dc:creator><dc:creator>\n        Kavanagh, A. J.<\/dc:creator><dc:creator>\n        Manninen, J.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2007-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6718\/1\/art_866.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-25-2053-2007<\/dc:relation><dc:identifier>\n        Longden, N. and Honary, F. and Kavanagh, A. J. and Manninen, J. (2007) The driving mechanisms of particle precipitation during the moderate geomagnetic storm of 7 January 2005. Annales Geophysicae, 25 (9). pp. 2053-2068. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6718\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-25-2053-2007","http:\/\/eprints.lancs.ac.uk\/6718\/"],"year":2007,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Ann. Geophys., 25, 2053–2068, 2007\nwww.ann-geophys.net\/25\/2053\/2007\/\n© European Geosciences Union 2007\nAnnales\nGeophysicae\nThe driving mechanisms of particle precipitation during the\nmoderate geomagnetic storm of 7 January 2005\nN. Longden1, F. Honary1, A. J. Kavanagh1, and J. Manninen2\n1Department of Communication Systems, Lancaster University, UK\n2Sodankyla¨ Geophysical Observatory, Sodankyla¨, Finland\nReceived: 29 March 2007 – Revised: 20 July 2007 – Accepted: 18 September 2007 – Published: 2 October 2007\nAbstract. The arrival of an interplanetary coronal mass ejec-\ntion (ICME) triggered a sudden storm commencement (SSC)\nat ∼09:22 UT on the 7 January 2005. The ICME followed\na quiet period in the solar wind and interplanetary magnetic\nfield (IMF). We present global scale observations of ener-\ngetic electron precipitation during the moderate geomagnetic\nstorm driven by the ICME. Energetic electron precipitation\nis inferred from increases in cosmic noise absorption (CNA)\nrecorded by stations in the Global Riometer Array (GLO-\nRIA). No evidence of CNA was observed during the first\nfour hours of passage of the ICME or following the sud-\nden commencement (SC) of the storm. This is consistent\nwith the findings of Osepian and Kirkwood (2004) that SCs\nwill only trigger precipitation during periods of geomagnetic\nactivity or when the magnetic perturbation in the magneto-\nsphere is substantial. CNA was only observed following en-\nhanced coupling between the IMF and the magnetosphere,\nresulting from southward oriented IMF. Precipitation was ob-\nserved due to substorm activity, as a result of the initial in-\njection and particles drifting from the injection region. Dur-\ning the recovery phase of the storm, when substorm activity\ndiminished, precipitation due to density driven increases in\nthe solar wind dynamic pressure (Pdyn) were identified. A\nnumber of increases in Pdyn were shown to drive sudden im-\npulses (SIs) in the geomagnetic field. While many of these\nSIs appear coincident with CNA, SIs without CNA were also\nobserved. During this period, the threshold of geomagnetic\nactivity required for SC driven precipitation was exceeded.\nThis implies that solar wind density driven SIs occurring dur-\ning storm recovery can drive a different response in particle\nprecipitation to typical SCs.\nKeywords. Ionosphere (Particle precipitation) – Magne-\ntospheric physics (Solar wind-magnetosphere interaction;\nStorms and substorms)\nCorrespondence to: N. Longden\n(n.longden@lancs.ac.uk)\n1 Introduction\nRiometers enable the investigation of precipitation of ener-\ngetic electrons into the D-region of the ionosphere through\nmeasurement of the absorption of cosmic noise (CNA).\nOne mechanism for the enhancement of precipitation in\nthe auroral zones is the compression of the magnetosphere as\na result of an increase in the dynamic pressure (Pdyn) of the\nsolar wind (Brown et al., 1961). Compression of the mag-\nnetosphere results in the stimulation of VLF waves, which\nin turn drive the pitch-angle diffusion necessary for trapped\nparticles to precipitate into the ionosphere (Perona, 1972).\nMagnetospheric compression can be observed as an impul-\nsive perturbation in the horizontal component of the geo-\nmagnetic field measured on the ground; i.e. a sudden com-\nmencement (SC). When followed by a geomagnetic storm,\nthe event is termed a sudden storm commencement (SSC),\nand when not a sudden impulse (SI). Conversely, when the\nsolar wind pressure decreases the magnetosphere can expe-\nrience rapid expansion. The signature of expansion is a neg-\native sudden impulse (SI−) in the horizontal component of\nthe geomagnetic field measured at mid to low latitudes (e.g.\nTakeuchi et al., 2002).\nPrecipitation driven by a SC can be observed by riome-\nters as short-lived CNA coincident with the onset of the\nSC, known as Sudden Commencement Absorption (SCA)\n(Brown et al., 1961). CNA observed following an SI is\ntermed Sudden Impulse Absorption (SIA). When observed,\nSCA and SIA exhibit a geomagnetic latitude and local\ntime dependency, with probability of occurrence maximis-\ning around local noon between 65◦ and 70◦ magnetic lat-\nitude (Perona, 1972). Osepian and Kirkwood (2004) have\ndetermined that a storm SC event during a period of activ-\nity, defined as a period when the geomagnetic index Kp is\ntwo or greater, will result in SCA proportional to the magni-\ntude of the magnetic impulse observed at equatorial latitudes.\nHowever, a storm SC event during a period of quiet activity\n(Kp<2) would only result in SCA if the magnitude of the\nPublished by Copernicus Publications on behalf of the European Geosciences Union.\n2054 N. Longden et al.: Particle precipitation during 7 January 2005 storm\nmagnetic impulse exceeded a threshold of around 30 nT. In\ntheir study, SCA was evident during active periods irrespec-\ntive of the local time of the observing riometer. However,\nat quiet times, the local time sector altered the threshold of\nmagnetic field perturbation required for SCA to occur, with a\ngreater perturbation required for SCA in the local afternoon\nthan local morning.\nMagnetospheric compression has been linked to substorm\nprocesses, such as reducing the period of southward IMF re-\nquired for substorm activity to occur (Burch, 1972) and the\ntriggering of substorms (Brown, 1978). Precipitation due to\nsubstorms has been linked to a number of forms of CNA\n(e.g. Stauning, 1996, and references therein), including CNA\naround local midnight, presumably close to the injection re-\ngion of the substorm, and in the morning sector, due to the\ndrift of injected electrons.\nInterplanetary Coronal Mass Ejections (ICME) are the\ninterplanetary (IP) counterpart of Coronal Mass Ejections\n(CME). When earthward directed, ICMEs are known to drive\ngeomagnetic storms with levels of activity ranging from the\nmost intense storms observed (Richardson et al., 2001) to rel-\native inactivity (Gosling et al., 1991). Taylor et al. (1994)\nhave shown that ICMEs are the most likely drivers for SSC\nevents.\nIn this paper we study the global-scale effects on particle\nprecipitation of a moderate geomagnetic storm triggered by\nan ICME that collided with the magnetosphere on 7 January\n2005 and consider the effects in the context of the survey\nof SSC-related absorption by Osepian and Kirkwood (2004).\nThe ICME followed a period of low activity in both the so-\nlar wind and magnetosphere indicating little energy coupling\ninto the system. The storm developed over the course of two\ndays and exhibited at least two periods of substorm activity,\nobserved by the Los Alamos National Laboratory (LANL)\nsatellites at geosynchronous orbit. The recovery phase of the\nstorm on the 8 January 2005 was accompanied by a num-\nber of solar wind density-driven sudden impulses that led to\nprecipitation confined mostly to the dayside magnetosphere.\nThere was an advantageous configuration of riometers with\ncoverage of both magnetic noon and midnight at the time of\nthe sudden commencement and during a good portion of the\nrecovery phase of the storm making this an interesting case\nstudy on the effects of an ICME on energetic electron precip-\nitation on global scales.\n2 Instrumentation\nObservations of the solar wind and IMF during the event are\ntaken from the ACE satellite, in orbit around the L1 point,\nand the Geotail satellite. During this event, Geotail was lo-\ncated off the dawn flank moving towards noon close to the\nEarth. The solar wind velocities and magnetic structure ob-\nserved by the ACE satellite are consistent with those ob-\nserved by Geotail, indicating that Geotail is located outside\nthe bow shock and magnetosphere, directly in the solar wind\nthroughout this event. The IMF data are obtained from the\nACE magnetic fields experiment (MAG) instrument (Smith\net al., 1998) and the Geotail Magnetic Field Measurement\n(MGF) instrument (Kokubun et al., 1994). The ACE solar\nwind data are obtained from the Solar Wind Electron Pro-\nton Alpha Monitor (SWEPAM) instrument (McComas et al.,\n1998) and the Geotail solar wind data are obtained from\nthe Comprehensive Plasma Instrument (CPI) (Frank et al.,\n1994).\nThe global scale effects of the ICME in the ionosphere\nwere investigated using two riometer chains; the NORSTAR\nriometer chain (formerly CANOPUS), covering CANADA,\nand the SGO riometer chain in Fennoscandia. Data from\nthe central beam (beam 25) of the imaging riometer (IRIS)\nlocated at Kilpisja¨rvi was also used. These riometers are\ndetailed in Table 1 and form part of the GLORIA project\n(Global Riometer Array). Magnetic latitudes are given in the\nCorrected Geomagnetic (CGM) coordinate system using the\nInternational Geomagnetic Reference Field (IGRF) model\nfor 2005 (e.g. Maus et al., 2005). GLORIA aims to link\nthe data from riometers located throughout the Northern and\nSouthern Hemispheres to enable investigation of the effect of\nelectron precipitation simultaneously across the globe. Small\nerrors in the calculation of the quiet day curves for the riome-\nters at Abisko and Rovaniemi could result in errors of the ab-\nsolute magnitude of CNA of the order of 0.1 to 0.2 dB during\nthis event.\nThe geomagnetic field local to the riometers was inves-\ntigated using data from ground based magnetometers. The\nIMAGE magnetometer chain is located close to the SGO\nchain of riometers and the CARISMA magnetometer chain\n(formerly CANOPUS) is located close to the NORSTAR ri-\nometers. Three of the magnetometer stations used are not\nlocated in the region of one of the riometers detailed in Ta-\nble 1. These are at Muonio (station code MUO), Rørvik (sta-\ntion code RVK) and Ouluja¨rvi (station code OUJ). These sta-\ntions have a geographic latitude and longitude of 68.02◦ N,\n23.53◦ E, 64.94◦ N, 10.98◦ E and 64.52◦ N, 27.23◦ E respec-\ntively. Pi2 pulsations were investigating using the lowest lat-\nitude CARISMA station (Pinawa) and the York magnetome-\nter (station code YOR) from the SAMNET magnetometer\nchain, located at 53.95◦ N, 1.05◦ W (geographic).\nGeosynchronous particle flux intensity measurements are\ntaken from the Synchronous Orbit Particle Analyzer (SOPA)\ninstrument (Belian et al., 1992) on board the LANL satel-\nlites. At the time of the ICME, data was available from five\nLANL satellites with SOPA instrumentation; 084, 095, 97A,\n01A and 02A. These satellites were located at geographic\nlongitudes of 166.13◦ W, 38.54◦ W, 145.36◦ E, 8.16◦ E and\n69.30◦ E, respectively, during this event. Figure 1 indicates\nthe geographic location of the GLORIA riometers used in\nthis study. The geographic longitude of the five LANL satel-\nlites are shown in red.\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2055\n3 Observations of the ICME in the solar wind\nAt approximately 08:42 UT on the 7 January 2005, the signa-\nture of an ICME was first observed in the solar wind and IMF\ndata from the ACE satellite at the L1 point. Figure 2 shows\nthe solar wind and IMF data observed by ACE and Geotail\non the 7 and 8 January 2005. Panels (a) to (c) show the\nIMF total magnetic field strength, the magnetic field strength\ncomponent in the Y direction GSM (East-West), and the\nmagnetic field strength component in the Z direction GSM\n(North-South), respectively. Panels (d) and (e) give the solar\nwind velocity in the X direction GSM and the proton num-\nber density in the solar wind from both satellites. Panel (f)\ndisplays the solar wind dynamic pressure from Geotail only\nand panel (g) shows the ratio between the helium alpha num-\nber density and the proton number density in the solar wind\nfrom ACE only. The ICME arrival was evident at Geotail at\n∼09:24 UT, indicated by the vertical line on Fig. 2. Solar\nwind conditions returned to ambient levels by the 9 January\n2005.\nComparison of the IMF data from ACE and Geotail indi-\ncates a consistent magnetic structure in the solar wind. The\nbest cross-correlation between the datasets of the satellites\nis achieved when the ACE data are delayed by ∼42.6 min.\nThe ACE data given in Fig. 2 has been shifted in time by\nthis amount. This value is close to the mean delay time be-\ntween the satellites of ∼45 min, calculated according to their\nseparation and the velocity of the solar wind (e.g. Khan and\nCowley, 1999). The ACE solar wind data are unavailable for\nthe period from ∼20:59 UT (∼21:41 UT at Geotail) on the\n7 January to ∼03:11 UT (∼03:53 UT at Geotail) on the 8\nJanuary 2005 whereas the Geotail solar wind dataset is com-\nplete. Data from both satellites are shown as ACE provides\ninformation about the helium alpha particle content of the\nsolar wind.\nWith the onset of the ICME, the solar wind velocity in-\ncreases from approximately 500 km s−1 to 600 km s−1. This\nis followed by a decrease to pre-ICME levels over the du-\nration of the event. The IMF exhibits two periods of\nextended southward orientation, the first between ∼13:38\nand ∼15:47 UT on the 7 January and the second between\n∼21:41 UT on the 7 January and ∼02:00 UT on the 8 Jan-\nuary. The Pdyn is highly variable and elevated from ambient\nlevels throughout the event, during periods of both northward\nand southward IMF. It should be noted that the Pdyn is calcu-\nlated for Geotail CPI assuming that the helium alpha particle\nnumber density of the solar wind is constantly 5% of the pro-\nton number density. From the limited data set available from\nACE SWEPAM, it can be seen that the ratio of helium al-\npha number density to proton number density exceeds this\nfor extended periods throughout the event, reaching levels of\napproximately 0.34. Therefore, the Pdyn will at times be un-\nderestimated in the Geotail data set.\n4 Observations of the SSC\nAt ∼09:22 UT on 7 January, a global scale SC signature\nwas identified in ground based magnetometer readings in\nthe Northern Hemisphere, confirmed by the NOAA NGDC\n(National Oceanic and Atmospheric Administration National\nGeophysical Data Center1). The SC signature was identi-\nfied in mid to low latitude ground based magnetometers. The\nmagnitude of the perturbation of the horizontal component\nof the geomagnetic field ranged from −4 nT to −6.6 nT at\nstations from the SAMNET array. The SC was initiated by\nthe step increase in the Pdyn at the start of the ICME as the\nvelocity of the solar wind rises sharply.\nOf the ten stations that recorded the SC, four magnetome-\nters recorded a class B event (defined as “Fair, ordinary but\nunmistakable” by the NOAA) while the six remaining mag-\nnetometers recorded a class C event (defined as “Very poor,\ndoubtful observation”). The magnetometers located at mag-\nnetic latitudes of ∼47◦ N and above recorded a preliminary\nreverse impulse (PRI) where the magnetic perturbation was\nobserved to decrease before the main positive impulse (MI),\ndetermined as the SC* signature by Araki (1977). Below\nthese latitudes, the standard SC signature of a positive im-\npulse only was observed by the magnetometer stations. The\nstations at which the SC signature was observed are detailed\nin Table 2.\nQuiet conditions were observed prior to the SC; the Kp\nindex did not exceed a value of 0+ between 00:00 and\n09:00 UT on the 7 January 2005. This suggests that the mag-\nnetosphere was in a relatively unprimed state before the ar-\nrival of the ICME. We define unprimed as without sufficient\ntrapped particles for precipitation to be identified in riometer\nCNA. The Kp index on the 7 and 8 January 2005 is shown in\nthe top panel of Fig. 3.\nThe SC was followed by a moderate geomagnetic storm;\nthe definition of a moderate storm as when minimum Dst\nfalls in the range of −50 to −100 nT (Gonzalez et al., 1994)\nhas been used. The Dst index during the 7 and 8 January\n2005 is given in the second panel of Fig. 3. It should be\nnoted that Dst is not the most appropriate index with which\nto identify certain types of geomagnetic activity. Fast solar\nwind streams, for example, cause little deflection in Dst but\nstill input significant energy to the system (e.g. Borovsky and\nDenton, 2006; Denton et al., 2006). However, Dst is consid-\nered an appropriate index to use in the identification of ICME\ndriven storms.\nThe storm develops in two phases with partial recovery\nbetween minima; Kamide et al. (1998) termed this a type 2\nstorm as opposed to a sharp decrease in Dst and a gradual re-\ncovery (type 1). The first Dst minimum occurs at 16:00 UT\non the 7 January, with a magnitude of −46 nT. It should be\n1ftp:\/\/ftp.ngdc.noaa.gov\/STP\/SOLAR DATA\/RELATED\nINDICES\/Geomagnetic PDF Files\/Geomagnetic Storm Sudden\nCommencements 0501.pdf\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2056 N. Longden et al.: Particle precipitation during 7 January 2005 storm\nTable 1. GLORIA stations used in this study ordered by descending magnetic latitude.\nCode Station Geographic Latitude Geographic Longitude Magnetic Latitude MLT (at 00:00 UT) L Shell\nTAL Taloyoak 69.54◦ N 93.56◦ W 78.59◦ N ∼17:19\nCON Contwoyto 65.75◦ N 111.26◦ W 73.00◦ N ∼15:43 11.86\nRAN Rankin Inlet 62.82◦ N 92.11◦ W 72.53◦ N ∼17:35 11.25\nFCH Fort Churchill 58.76◦ N 94.09◦ W 68.62◦ N ∼17:28 7.63\nRAB Rabbit Lake 58.23◦ N 103.68◦ W 67.08◦ N ∼16:37 6.68\nKIL Kilpisja¨rvi 69.05◦ N 20.79◦ E 65.98◦ N ∼02:44 6.12\nDAW Dawson 64.05◦ N 139.11◦ W 65.92◦ N ∼13:32 6.09\nABK Abisko 68.40◦ N 18.90◦ E 65.41◦ N ∼02:31 5.86\nIVA Ivalo 68.55◦ N 27.28◦ E 65.17◦ N ∼02:59 5.75\nSOD Sodankyla¨ 67.42◦ N 26.39◦ E 64.06◦ N ∼02:53 5.30\nROV Rovaniemi 66.78◦ N 25.94◦ E 63.42◦ N ∼02:50 5.07\nOUL Oulu 65.09◦ N 25.89◦ E 61.69◦ N ∼02:47 4.51\nPIN Pinawa 50.20◦ N 96.04◦ W 60.24◦ N ∼17:22 4.12\nJYV Jyva¨skyla¨ 62.42◦ N 25.28◦ E 58.95◦ N ∼02:40 3.81\n 180oW  120oW   60oW    0o    60oE  120oE  180oW \n  48oN \n  54oN \n  60oN \n  66oN \n  72oN \n  78oN \nRAN\nTAL\nFCH\nPIN\nRAB\nCONDAW\nSGO ChainNORSTAR Chain\n01A 02A 97A084 095\nFig. 1. Geographic location of the GLORIA stations used in this study. The geographic longitude of the five LANL satellites in orbit on the\n7 January 2005 are shown in red for all riometer latitudes. Red dots indicate the approximate footprint of a geomagnetic field line mapped\nfrom the equator at 6.6RE at the longitude of each of the LANL satellites. The field line mapping was performed using the Tsyganenko 89C\nmodel (Tsyganenko, 1995).\nnoted that Dst also reaches the value of −46 nT at 18:00 UT\nafter a slight recovery at 17:00 UT. The second Dst mini-\nmum occurs at 02:00 UT on the 8 January, with a magni-\ntude of −96 nT. Between the two minima, the Dst recovers\nto−34 nT at 21:00 UT on the 7 January, a recovery of 12 nT.\nFrom observations of the onset of the decline in Dst prior\nto each minimum, it can be inferred that ring current en-\nhancement begins between 14:00 and 15:00 UT and again\nbetween 22:00 and 23:00 UT. As Geotail shows extended\nnegative Bz from ∼13:38 UT until ∼15:47 UT and from\n∼21:41 UT on the 7 January 2005 until ∼02:00 UT on the\n8 January 2005 it, therefore, seems probable in this case\nthat the two phase development of the storm is linked to the\ntwo significant periods of southward IMF in the ICME pas-\nsage. Prior to the second enhancement, the storm would have\nbeen classified as small or weak, i.e. Dst>−50 nT (Gonzalez\net al., 1994).\nThe third panel of Fig. 3 presents the SYM-H index. The\nSYM-H index can be considered a high-resolution Dst index\n(Wanliss and Showalter, 2006) and is derived from the hor-\nizontal component of the geomagnetic field recorded at six\nmid to low latitude ground based magnetometers. As it pro-\nvides one minute resolution, this index can be used to inves-\ntigate the effects of Pdyn pulses (e.g. Takeuchi et al., 2002).\nThe quick look values for the upper and lower auroral elec-\ntrojet indices (AU and AL, respectively) are given in the bot-\ntom two panels of Fig. 3.\nFigure 4 shows the electron flux intensity measured by the\nSOPA instrument on the LANL satellites during the period\nof the 7 and 8 January 2005. The flux intensity is given for\nenergy channels in the range of 50 to 500 keV. From top to\nbottom, the panels show the electron flux recorded by the\nLANL-97A, 084, 095, 01A and 02A satellites. The mag-\nnetic local times (MLT) for these satellites at 00:00 UT are\n∼09:19, ∼12:31, ∼21:03, ∼00:09 and ∼04:11, respectively.\nDuring the storm, two periods of substorm activity with\nmultiple particle injections were identified in the electron\nflux intensity at geosynchronous orbit. The LANL SOPA\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2057\nTable 2. Magnetometer stations recording an SC signature at 09:22 UT on 7 January 2005, ordered by descending magnetic latitude.\nCode Station Geographic Latitude Geographic Longitude Magnetic Latitude Class SC Type\nLER Lerwick 60.13◦ N 1.18◦ W 57.92◦ N B SC*\nNUR Nurmija¨rvi 60.50◦ N 24.65◦ E 56.97◦ N C SC*\nESK Eskdalemuir 55.32◦ N 3.20◦ W 52.57◦ N B SC*\nHAD Hartland 50.99◦ N 4.48◦ W 47.44◦ N B SC*\nBDV Budkov 49.08◦ N 14.02◦ E 44.43◦ N C SC\nMMB Memambetsu 43.91◦ N 144.19◦ E 37.26◦ N C SC\nSPT San Pablo Toledo 39.55◦ N 4.35◦ W 32.10◦ N C SC\nKAK Kakioka 36.23◦ N 140.19◦ E 29.46◦ N C SC\nKNY Kanoya 31.42◦ N 130.88◦ E 24.85◦ N C SC\nGUI Guima 28.32◦ N 16.44◦ W 13.03◦ N B SC\n0\n10\n20\nSolar Wind and IMF Data: 7 to 8 January 2005\n \n \n−20\n0  \n20 \n−20\n0\n20\n−550\n−450\n0\n40\n80\n0\n20\n00 06 12 18 00 06 12 18 00\n0\n0.1\n0.2\n0.3\nUT (hh)\nGeotail\nDelayed ACE\nIMF |B| (nT)\nIMF By (nT)\nIMF Bz (nT)\nSW Vx (km\/s)\nSW Np (#\/cc)\nSW DP(nPa)\nSW Na\/Np\n7 January 2005 8 January 2005\na\nb\nc\nd\ne\nf\ng ICME Onset\nFig. 2. Solar Wind and Interplanetary Magnetic Field Data from the ACE and Geotail satellites on the 7 and 8 January 2005. ACE data has\nbeen adjusted to the time of observation at Geotail. From (a) to (g), the panels show total magnetic field strength of the IMF, IMF By GSM,\nIMF Bz GSM, solar wind speed in X direction GSM, solar wind proton number density, solar wind dynamic pressure and the ratio between\nhelium number density and proton number density in the solar wind.\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2058 N. Longden et al.: Particle precipitation during 7 January 2005 storm\n0\n4\n8\n−80\n−40\n−120\n−80\n−40\n0\n−400\n0\n400\n00 06 12 18 00 06 12 18 00\n−2000\n−1000\n0\nKp\nGeomagnetic Indices: 7 to 8 January 2005\nICME Onset\nDst\n(nT)\nSYM−H\n(nT)\nAU\n(nT)\nAL\n(nT)\nUT (hh)7 January\n2005\n8 January\n2005\nFig. 3. Geomagnetic indices on the 7 and 8 January 2005. From\ntop to bottom, the panels show the Kp index, the Dst index, the\nSYM-H index, the AU index and the AL index.\ndata during the onset of the first period of substorm activ-\nity is shown in Fig. 5a, covering the period of 14:00 UT to\n15:15 UT on the 7 January 2005. From Fig. 5a, the injec-\ntion signature of a substorm is evident in the electron flux\ndata of LANL-97A at ∼14:12 UT. At this time, the satellite\nwas located at an MLT of ∼23:56, inside the injection re-\ngion. After approximately three minutes, the onset of a dis-\npersed injection signature of drifting electrons was observed\nin the electron flux of LANL-084, located at ∼03:12 MLT.\nThe dispersed signature results from electrons with different\nenergies orbiting at different velocities away from the injec-\ntion region; the drift velocity of a particle is directly propor-\ntional to its energy (e.g. Hargreaves, 1992). Both satellites\nshow evidence of a second enhancement in electron flux at\n∼14:53 UT.\nThis substorm activity follows the first decrease in Dst , af-\nter 14:00 UT, and a southward turning of the IMF. Conditions\nremain disturbed following the substorm onset. Large en-\nhancements of electron flux are not evident after∼16:43 UT,\nalthough depletions can be seen at later times by LANL-97A\nand 02A.\nA seemingly dispersionless injection can be seen in the\nelectron flux intensity at LANL-02A at∼22:27 UT on 7 Jan-\nuary (∼02:39 MLT), indicating the onset of the second pe-\nriod of substorm activity at this time. The electron flux in-\ntensity from the LANL SOPA instruments between 22:15 UT\nand 23:30 UT on the 7 January 2005 are shown in Fig. 5b.\nThis activity follows the second decrease in Dst , occurring\nbetween 22:00 UT and 23:00 UT, and a period of southward\nIMF. This was followed by more activity at around 22:50 UT,\nwith a seemingly dispersionless injection signature at LANL-\n095 (∼19:53 MLT) and 01A (∼22:59 MLT) at this time. The\ndispersed signature of drifting electrons is evident at LANL-\n02A (∼03:00 MLT). A clear injection signature can also be\nseen at LANL-095 at ∼03:33 UT on the 8 January 2005\n(∼00:35 MLT), with dispersed signatures evident at the other\nsatellites. The geosynchronous electron flux intensity during\nthis injection is shown in Fig. 5c.\n5 Observations of particle precipitation\nThe ionospheric CNA data observed by seven of the SGO ri-\nometers and IRIS at Kilpisja¨rvi throughout the ICME event\nis shown in Fig. 6a. From top to bottom, the plots relate to\nthese stations ordered by descending geomagnetic latitude.\nThe SGO riometers and IRIS have operating frequencies in\nthe range 29.9 MHz to 38.2 MHz. As frequency can be con-\nsidered to be a scaling factor for absorption magnitude (e.g.\nHargreaves, 1969), all absorption data have been scaled to a\nfrequency of 30 MHz. The scaling was performed according\nto Eq. (1), where f30 is a frequency of 30 MHz, fo is the op-\nerational frequency of the riometer and A is the absorption at\na given frequency.\nA(f30) = A(fo) (fo)\n2\n(f30)2\n(1)\nFigure 6b shows the CNA data for the event from seven of\nthe NORSTAR riometers. From top to bottom, the plots re-\nlate to these stations ordered by descending geomagnetic lat-\nitude. All NORSTAR riometers have a frequency of 30 MHz.\nThe vertical lines on Fig. 6 indicate the timing of the SC, at\n∼09:22 UT, and the onset of two substorms, at ∼14:12 UT\nand ∼22:27 UT, for both the SGO riometers and IRIS and\nthe NORSTAR riometers.\n5.1 Precipitation prior to substorm onset\nThe GLORIA riometers provided simultaneous dayside\nand nightside coverage of the ionosphere at the time of\nthe SC. The SGO and IRIS riometers were around lo-\ncal noon, in a suitable position for the detection of SCA.\nThe NORSTAR riometers were located in the night sector\n(22:50–03:00 MLT) and so would be less likely to observe\nprecipitation effects (e.g. Ortner et al., 1962; Brown et al.,\n1972). No significant CNA is detected by any of the riome-\nters following the SC. The absence of SCA is expected as the\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2059\n101\n103\n105\nF l\nu x\n I n\nt e\nn s\ni t y\n ( #\n\/ c m\n2 \/ s\n\/ s\nr \/ k\ne V\n)\n101\n103\n105\n \n \n101\n103\n105\n00 06 12 18 00 06 12 18 00\n101\n103\n105\nUT (hh)\n101\n103\n105\nLANL SOPA Electron Flux: 7 to 8 January 2005\n50−75 keV 75−105 keV 105−150 keV 150−225 keV 225−315 keV 315−500 keV\n1990−095\n1994−084\n01A\n02A\n97A\n7 January 2005 8 January 2005\nFig. 4. Electron flux for particles with energies in the range of 50 to 500 keV from the LANL satellites used in the study on the 7 and 8\nJanuary 2005.\nconditions for SCA (Osepian and Kirkwood, 2004) are not\nmet; Kp<2 and geomagnetic perturbation <30 nT.\nDuring the first fours hours of passage of the ICME, prior\nto the onset of the first substorm at ∼14:12 UT on 7 January,\nCNA is limited. The majority of the riometers show only\nsmall fluctuations in CNA of the order of 0.15 dB, which is\nconsistent with CNA fluctuations prior to the ICME. A step\nincrease of ∼0.22 dB can be seen at Abisko at ∼14:05 UT\non 7 January, although this is most likely to be due to the\nsmall error in CNA calculation stated in Sect. 2. Isolated\ninstances of CNA are evident at this time at Rabbit Lake, up\nto ∼0.63 dB, and at Dawson, of the order of 0.3 dB.\nThe horizontal component of the geomagnetic field\nrecorded by ground based magnetometer stations in the IM-\nAGE chain (panel a) and the CARISMA chain (panel b) are\nshown in Fig. 7. The plots show the stations ordered by de-\nscending magnetic latitude. The bottom panels show the hor-\nizontal magnetic field component of the SAMNET York sta-\ntion and the CARISMA Pinawa station filtered for Pi2 pulsa-\ntions. The data show that there is little geomagnetic activity\nin the period prior to substorm onset. The vertical lines mark\nthe time of the SC and the onset of the two substorm periods.\n5.2 Precipitation during the first period of substorm activity\nAt the time of onset of the first period of substorm activity\n(∼14:12 UT on the 7 January 2005), the NORSTAR riome-\nter stations are in the local morning (∼03:44–07:47 MLT)\nand the SGO riometers and IRIS are located towards dusk\n(∼16:43–17:11 MLT). Figure 8 shows the CNA data for the\nevent from 14:00 UT until 22:00 UT on the 7 January 2005,\ncovering this period of activity. Figure 9a shows the IMAGE\nmagnetometer data during this period.\nDawson, the most westerly NORSTAR station, observes\nCNA from ∼14:16 UT (∼03:44 MLT). The CNA is sus-\ntained, not reaching pre-onset levels until ∼18:03 UT, and\nreaches levels above 4 dB. A further three stations, Rabbit\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2060 N. Longden et al.: Particle precipitation during 7 January 2005 storm\n101\n103\n105\nF l\nu x\n I n\nt e\nn s\ni t y\n ( #\n\/ c m\n2 \/ s\n\/ s\nr \/ k\ne V\n)\n101\n103\n105\n \n \n101\n103\n105\n1400 1415 1430 1445 1500 1515\n101\n103\n105\nUT (hhmm)\n101\n103\n105\nLANL SOPA Electron Flux\n7 January 2005\n101\n103\n105\nLANL SOPA Electron Flux\n7 January 2005\n101\n103\n105\n \n \n101\n103\n105\n101\n103\n105\n2215 2230 2245 2300 2315 2330\n101\n103\n105\nUT (hhmm)\n101\n103\n105\nLANL SOPA Electron Flux\n8 January 2005\n101\n103\n105\n \n \n101\n103\n105\n101\n103\n105\n0315 0330 0345 0400 0415 0430\n101\n103\n105\nUT (hhmm)\n50−75 keV 75−105 keV 105−150 keV 150−225 keV 225−315 keV 315−500 keV\n1990−095\n1994−084\n01A\n02A\n97A\na b c\nFig. 5. Electron flux for particles with energies in the range of 50 to 500 keV from the LANL satellites used in the study. Panel (a) shows\ndata during the period of 14:00 UT to 15:15 UT on the 7 January 2005. Panel (b) shows data during the period of 22:15 UT to 23:30 UT on\nthe 7 January 2005. Panel (c) shows data during the period of 03:15 UT to 04:30 UT on the 8 January 2005.\nLake, Pinawa and Fort Churchill, show the onset of a sus-\ntained period of CNA around ∼14:26 UT (at ∼06:49 MLT,\n∼07:34 MLT and ∼07:40 MLT, respectively). Of the three\nriometers located above 70◦ N geomagnetic latitude (Rankin\nInlet, Contwoyto and Taloyoak) only Contwoyto shows sig-\nnificant CNA during the substorm. However, the onset at this\nstation does not occur until ∼14:48 UT (∼06:31 MLT), de-\nspite being the second most westerly station from the chain.\nThe location of the riometers and the duration of the CNA in-\ndicate that this is likely to be Slowly Varying (Morning) Ab-\nsorption (SVA) caused by the hardening of eastward drifting\nelectrons from the substorm injection (e.g. Stauning, 1996,\nand references therein).\nCNA is evident in IRIS and all SGO riometer stations\nexcept Jyva¨skyla¨ after ∼14:35 UT (∼17:05–17:34 MLT at\nCNA onset). Jyva¨skyla¨ is located at the lowest magnetic lat-\nitude of the SGO stations (58.95◦ N, L≈3.81). LANL satel-\nlites located eastward (LANL-02A) and westward (LANL-\n01A) of the position of these riometers do not show an in-\ncrease in electron flux intensities consistent with particle in-\njection. They also do not show a significant variation across\nenergy channels consistent with drifting particles at the time\nof the CNA.\nThe CNA is sporadic and exhibits a different tempo-\nral signature at each riometer station, although the profiles\nat Rovaniemi and Sodankyla¨ (30 MHz) are similar. The\nCNA appears to end following a peak that moves latitudi-\nnally northward from Rovaniemi (onset at ∼16:05 UT) to\nKilpisja¨rvi (onset at ∼16:35 UT). CNA largely disappears at\n∼16:50 UT. Some small impulsive CNA is seen at IRIS un-\ntil∼18:00 UT. IMAGE magnetometer observations (Fig. 9a)\nshow disturbed conditions at all stations during the peri-\nods of CNA, from ∼14:25 UT. They show recovery from\n∼16:35 UT, although minor fluctuations continue, consistent\nwith the end of the CNA period. The disturbance originates\nat high latitude and propagates southward. The initial small\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2061\n0\n3\n6\nSGO Riometers and IRIS Absorption: 7 to 8 January 2005\n0\n3\n6\n0\n3\n6\n0\n3\n6\nA\nb s\n ( d\nB )\n0\n3\n6\n0\n3\n6\n00 06 12 18 00 06 12 18 00\n0\n3\n6\nUT (hh)\n0\n3\n6\nNORSTAR Riometers Absorption: 7 to 8 January 2005\n0\n3\n6\n0\n3\n6\n0\n3\n6\nA\nb s\n ( d\nB )\n0\n3\n6\n0\n3\n6\n00 06 12 18 00 06 12 18 00\n0\n3\n6\nUT (hh)\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nSOD\n64.06o N\nROV\n63.42o N\nOUL\n61.69o N\nJYV\n58.95o N\nTAL\n78.59o N\nCON\n73.00o N\nRAN\n72.53o N\nFCH\n68.62o N\nRAB\n67.08o N\nDAW\n65.92o N\nPIN\n60.24o N\n7 January\n2005\n8 January\n2005\n7 January\n2005\n8 January\n2005\n~0922 UT ~1412 UT ~2227 UT ~0922 UT ~1412 UT ~2227 UT\n   a\n   b\nFig. 6. Ionospheric CNA from the selected GLORIA stations on the 7 and 8 January 2005. The stations are ordered by descending magnetic\nlatitude. Panel (a) shows data from the SGO riometers and IRIS at Kilpisja¨rvi. Panel (b) shows data from the NORSTAR riometers.\nincrease in CNA is associated with the appearance of the sub-\nstorm current system overhead and precedes the increase in\nPdyn; this may influence the subsequent increase in CNA but\nthat is inconclusive. The lack of electron flux at the local\nLANL satellite can be explained if the electrons responsible\nfor the absorption are of lower than usual energy and if the\ncurrent system is confined earthward of geostationary orbit at\nthat magnetic local time. Inspection of a north-south aligned\nrow of beams in IRIS indicates that the CNA drops away with\nincreasing latitude such that the footprint of geostationary or-\nbit corresponds to essentially background CNA.\nVariations in solar wind pressure can be observed at Geo-\ntail from ∼14:30 UT, with an impulse at ∼14:57 UT. These\nvariations occur during the first period of substorm activity,\nwhen CNA is also observed at the SGO riometers and IRIS.\nThe Pdyn increase is due to an increase in the proton number\ndensity of the solar wind rather than velocity and is highly\nvariable. At this time, the Kp index indicates active condi-\ntions (Kp≥5).\nThe global geomagnetic field at this time can be investi-\ngated via the SYM-H index. An overall decrease in SYM-\nH can be observed from the time of the substorm onset at\n∼14:12 UT. Some deviations from the trend of SYM-H that\nseem to reflect changes in Pdyn can be seen. However, there\nare many Pdyn variations that appear to have no effect on\nSYM-H. The sudden decrease in Pdyn observed by Geotail\nat ∼17:56 UT is mirrored by a sudden decrease in SYM-H\nat ∼18:00 UT, indicating rapid expansion of the magneto-\nsphere. The decreases in Pdyn and SYM-H occur at the time\nat which the period of CNA also finally tails off at both chains\nof riometers and IRIS.\nWhile the CNA at SGO and IRIS occurs during a period of\nPdyn variations, there is no evidence that the CNA is directly\ndriven by Pdyn at this time. For example, the most significant\npeak in CNA at IRIS, observed from ∼16:30 UT, does not\ncorrespond to an impulse in the Pdyn or SYM-H index.\nCNA related to magnetospheric compression is difficult to\nidentify in the NORSTAR riometers, which are located in the\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2062 N. Longden et al.: Particle precipitation during 7 January 2005 storm\n9000\n10500\nIMAGE Magnetometers: 7 to 8 January 2005\n10000\n11500\n10000\n11500\n10000\n11500\nH\n ( n\nT )\n10000\n11500\n12500\n14000\n00 06 12 18 00 06 12 18 00\n12000\n13500\n00 06 12 18 00 06 12 18 00\n−8\n0\n8\nUT (hh)\nP i\n2\nH\n ( n\nT )\n3500\n5000\nCARISMA Magnetometers: 7 to 8 January 2005\n7000\n8500\n1000\n2500\n7500\n9000\nH\n ( n\nT )\n10000\n11500\n8500\n10000\n00 06 12 18 00 06 12 18 00\n14000\n15500\n00 06 12 18 00 06 12 18 00\n−40\n0\n40\nUT (hh)\nP i\n2\nH\n ( n\nT )\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nMUO\n64.81o N\nSOD\n64.06o N\nRVK\n62.27o N\nOUJ\n61.08o N\nYOR\n50.84o N\n7 January\n2005\n8 January\n2005\nTAL\n78.59o N\nCON\n73.00o N\nRAN\n72.53o N\nFCH\n68.62o N\nRAB\n67.08o N\nDAW\n65.92o N\nPIN\n60.24o N\n7 January\n2005\n8 January\n2005\na\nb\n~0922 UT ~1412 UT ~2227UT ~2227UT~1412 UT~0922 UT\nPIN\n60.24o N\nFig. 7. The horizontal component of the geomagnetic field from ground based magnetometers on the 7 and 8 January 2005. The stations\nare ordered by descending magnetic latitude. Panel (a) shows data from the IMAGE magnetometer chain. Panel (b) shows data from the\nCARISMA magnetometer chain. Pi2 filtered data are shown for the SAMNET York station and the CARISMA Pinawa station.\nmorning at this time, as the impulses occur during ongoing\nsubstorm related precipitation. Following the end of the sub-\nstorm activity, CNA is still evident at some of the NORSTAR\nriometers at latitudes below 70◦ N. However, this does not\nappear to be linked to Pdyn variations as coincident impulses\nin SYM-H are not evident.\nAt ∼20:30 UT, a two-step increase in SYM-H of around\n30 nT is evident following a Pdyn decrease followed almost\nimmediately by rapid increases. This coincides with a period\nof enhanced CNA at NORSTAR with multiple peaks. As\nprecipitation is observed prior to the impulse, the CNA may\nsimply be a continuation of the previous activity.\n5.3 Precipitation during the second period of substorm ac-\ntivity\nAt the time of onset of the second period of substorm activ-\nity (∼22:27 UT on the 7 January 2005), the SGO riometers\nand IRIS were located post-midnight (∼00:58–01:26 MLT)\nwhile the NORSTAR riometers were in the local afternoon\n(∼11:59–16:02 MLT). Figure 10 shows the CNA data for the\nevent from 22:00 UT on the 7 January 2005 until 02:00 UT\non the 8 January 2005, covering this period of activity.\nThe IMAGE magnetometer data for this period is shown in\nFig. 9b.\nThe SGO riometers (except Jyva¨skyla¨) and IRIS begin to\nshow enhanced CNA from∼22:28 UT. There is evidence of a\nrapid longitudinal motion westward in the CNA. It is first ob-\nserved in the most easterly station, Ivalo, before progressing\nto the most westerly station, Abisko, after a time delay of the\norder of two minutes. This CNA occurs after the onset of the\nsecond period of substorm activity with the apparently dis-\npersionless injection at ∼22:27 UT at LANL-02A (Fig. 5b).\nThe CNA remains enhanced (with discrete increases) from\nthe start of the substorm activity until ∼14:34 UT on 8 Jan-\nuary 2005. The signature is similar in riometers in which\nCNA is observed, although timings of individual features\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2063\n0\n1\n2\nSGO Riometers and IRIS Absorption: 7 January 2005\n0\n1\n2\n0\n1\n2\n0\n1\n2\nA\nb s\n ( d\nB )\n0\n1\n2\n0\n1\n2\n14 15 16 17 18 19 20 21 22\n0\n1\n2\nUT (hh)\n0\n2\n4\nNORSTAR Riometers Absorption: 7 January 2005\n0\n2\n4\n0\n2\n4\n0\n2\n4\nA\nb s\n ( d\nB )\n0\n2\n4\n0\n2\n4\n14 15 16 17 18 19 20 21 22\n0\n2\n4\nUT (hh)\n14 15 16 17 18 19 20 21 22\n0\n−50\nUT (hh)S\nY M\n− H\n( n\nT )\n20\nS W\n D\nP\n( n\nP a\n)\n0\n20\nS W\n D\nP\n( n\nP a\n)\n14 15 16 17 18 19 20 21 22\n−50\nUT (hh)S\nY M\n− H\n( n\nT )\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nSOD\n64.06o N\nROV\n63.42o N\nOUL\n61.69o N\nJYV\n58.95o N\nTAL\n78.59o N\nCON\n73.00o N\nRAN\n72.53o N\nFCH\n68.62o N\nRAB\n67.08o N\nDAW\n65.92o N\nPIN\n60.24o N\n   a\n   b\nFig. 8. Ionospheric CNA from the selected GLORIA stations during the period of 14:00 UT until 22:00 UT on the 7 January 2005. The\nstations are ordered by descending magnetic latitude. Panel (a) shows data from the SGO riometers and IRIS at Kilpisja¨rvi. Panel (b) shows\ndata from the NORSTAR riometers. Solar wind dynamic pressure data from Geotail and the SYM-H index are shown at the bottom of each\npanel.\nvary on a timescale of the order of five minutes. CNA is\nprimarily seen at the higher latitude stations of the SGO\nchain and IRIS. However, between ∼23:32 and 23:55 UT,\nCNA reaching levels greater than 1.5 dB can even be seen at\nJyva¨skyla¨. This indicates an expansion of the auroral oval to\nlatitudes below 60◦ N during this time.\nThe CNA over Fennoscandia also coincides with local\ngeomagnetic disturbances identified in the IMAGE magne-\ntometer data (Fig. 9b). The later periods of CNA coincide\nwith impulsive short-lived disturbances in the local geomag-\nnetic field.\nPrior to 23:30 UT on 7 January 2005, the global geomag-\nnetic field in the form of the SYM-H index appears to be\ndominated by the effects of the substorm activity. After this,\ncompression and expansion of the magnetic field can be seen\nfollowing some of the large Pdyn pulses observed at Geotail.\nInitially, while the riometers are located in the night sec-\ntor, the precipitation appears to be directly related to the sub-\nstorm activity. Much of this CNA occurs at times of elevated\nelectron flux intensities observed by LANL-01A and 02A.\nDuring the progression of the substorms, Pdyn is elevated\nand impulsive signatures in the SYM-H index appear coinci-\ndent with CNA, for example at the time of CNA at Jyva¨skyla¨.\nHowever, at these times some riometers in the SGO chain and\nIRIS exhibit CNA prior to the impulse and so it is not pos-\nsible to attribute the CNA to the impulse due to the ongoing\nprecipitation.\nThroughout this substorm, the NORSTAR riometers see\nlittle CNA. When CNA is present, it is at individual sta-\ntions and is limited in time. The most significant CNA is\nrecorded by Pinawa, the most equatorward of the riometers\nin the chain, with onset at ∼22:35 UT (∼15:57 MLT). There\nis evidence of enhanced electron flux at LANL-97A across\nall energy channels which does not exhibit a dispersed signa-\nture. The other NORSTAR riometers lying in a meridional\nchain with Pinawa do not show any enhancement in CNA at\nthis time. Therefore it is unlikely to be the result of substorm\nrelated precipitation. Despite the impulsive profile, this CNA\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2064 N. Longden et al.: Particle precipitation during 7 January 2005 storm\n10700\n11200\nIMAGE Magnetometers: 7 January 2005\n11300\n11800\n11000\n11500\n11400\n11900\nH\n ( n\nT )\n11300\n11800\n13000\n13500\n14 15 16 17 18 19 20 21 22\n12800\n13300\n14 15 16 17 18 19 20 21 22\n−8\n0\n8\nUT (hh)\nP i\n2\nH\n ( n\nT )\n22 23 00 01 02\n−8\n0\n8\nUT (hh)\nP i\n2\nH\n ( n\nT )\n22 23 00 01 02\n12000\n14000\n10000\n12500\n12000\n14000\n10000\n12000\nH\n ( n\nT )\n10000\n11500\n10000\n12000\n11000\n9500\nIMAGE Magnetometers: 7 to 8 January 2005\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nMUO\n64.81o N\nSOD\n64.06o N\nRVK\n62.27o N\nOUJ\n61.08o N\nYOR\n50.84o N\na b KIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nMUO\n64.81o N\nSOD\n64.06o N\nRVK\n62.27o N\nOUJ\n61.08o N\nYOR\n50.84o N\nFig. 9. The horizontal component of the geomagnetic field from selected IMAGE magnetometer stations. The stations are ordered by\ndescending magnetic latitude. Panel (a) shows the data during the period of 14:00 UT until 22:00 UT on the 7 January 2005. Panel (b) shows\nthe data during the period of 22:00 UT on the 7 January 2005 until 02:00 UT on the 8 January 2005. Pi2 filtered data are shown for the\nSAMNET York station.\nis not coincident with Pdyn variations and there is no impulse\nin SYM-H at this time, ruling out SIA. Dawson also observes\nCNA at ∼23:16 UT (∼12:48 MLT) that is unrelated to im-\npulses in SYM-H. Signatures of the substorm are clear in\nthe IMAGE magnetometer data (Fig. 7). The second bay\nat ∼03:45 UT indicates a double onset or intensification but\nmay simply be a continuation of the earlier substorm related\nprecipitation.\n5.4 Precipitation following the substorm activity\nThe last clear dispersionless injection signature indicating\nsubstorm activity was observed in the LANL SOPA electron\nflux intensity at ∼03:33 UT on the 8 January 2005. Fig-\nure 11 shows the CNA data for the event from 04:00 UT\nuntil 10:00 UT on the 8 January 2005, covering the period\nfollowing the previous activity. Instances of CNA are still\nevident at both chains of riometers. At this time, the effects\nof isolated instances of rapid magnetospheric compression\non precipitation while geomagnetic activity is still high can\nbe investigated.\nFor example, at ∼04:19 UT on the 8 January 2005, the\nPdyn at Geotail began to rapidly increase, reaching a peak\nvalue of ∼39 nPa at ∼04:30 UT, an increase of over 30 nPa.\nThis was followed by a 48 nT positive impulse in SYM-H.\nThe onset of the impulse in SYM-H occurred at ∼04:21 UT,\nreaching a peak value at ∼04:36 UT. At this time, Kp was\n6−, well above the activity threshold found by Osepian\nand Kirkwood (2004). Four of the SGO riometers show\nan increase in CNA simultaneously at ∼04:22 UT where\nthey had previously shown recovery to quiet levels follow-\ning the preceding activity. Two further riometers also show\nan increase in CNA from this time on a background of\ndecreasing CNA. At the onset of this CNA, the riometers\nwere located in the morning sector (∼06:53–07:21 MLT).\nCNA from this impulse can also be seen at the NORSTAR\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2065\n0\n3\n6\nSGO Riometers and IRIS Absorption: 7 to 8 January 2005\n0\n3\n6\n0\n3\n6\n0\n3\n6\nA\nb s\n ( d\nB )\n0\n3\n6\n0\n3\n6\n22 23 00 01 02\n0\n3\n6\nUT (hh)\n0\n1\n2\nNORSTAR Riometers Absorption: 7 to 8 January 2005\n0\n1\n2\n0\n1\n2\n0\n1\n2\nA\nb s\n ( d\nB )\n0\n1\n2\n0\n1\n2\n22 23 00 01 02\n0\n1\n2\nUT (hh)\n22 23 00 01 02\n0\n−50\n−100\nUT (hh)\nS Y\nM\n− H\n( n\nT )\n20\n40\nS W\n D\nP\n( n\nP a\n)\n0\n20\n40\nS W\n D\nP\n( n\nP a\n)\n22 23 00 01 02\n−50\n−100\nUT (hh)\nS Y\nM\n− H\n( n\nT )\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nSOD\n64.06o N\nROV\n63.42o N\nOUL\n61.69o N\nJYV\n58.95o N\nTAL\n78.59o N\nCON\n73.00o N\nRAN\n72.53o N\nFCH\n68.62o N\nRAB\n67.08o N\nDAW\n65.92o N\nPIN\n60.24o N\n   a\n   b\nFig. 10. Ionospheric CNA from the selected GLORIA stations during the period of 22:00 UT on the 7 until 02:00 UT on the 8 January 2005.\nThe stations are ordered by descending magnetic latitude. Panel (a) shows data from the SGO riometers and IRIS at Kilpisja¨rvi. Panel (b)\nshows data from the NORSTAR riometers. Solar wind dynamic pressure data from Geotail and the SYM-H index are shown at the bottom\nof each panel.\nriometers, located in the dusk-midnight sector. CNA in-\ncreases occur simultaneously at Dawson (∼18:00 MLT) and\nChurchill (∼21:56 MLT) at ∼04:28 UT. There is a slight de-\nlay (∼4 min) at higher latitudes, for example at Rankin Inlet\nand Contwoyto. It should be noted that there is no longitu-\ndinal progression between stations. This appears to be evi-\ndence of global scale particle precipitation following a Pdyn\ndriven geomagnetic impulse.\nA number of Pdyn increases can be mapped to CNA in-\ncreases at the SGO and IRIS riometers in this manner, with\ncorresponding geomagnetic impulses in SYM-H. There-\nfore, it seems that the CNA observed from 04:22 UT, un-\ntil ∼12:45 UT is SIA. However, no more clear examples of\nglobal scale SIA have been identified with particle precipi-\ntation evident in NORSTAR riometers as well, likely due to\nthe local time positions of the instruments, under the magne-\ntotail.\nFrom Fig. 11, a period of excellent coincidence between\ndayside CNA, the SYM-H index and Pdyn at Geotail can be\nseen from 06:00 UT until 08:30 UT. Throughout this period,\nthe SGO riometers and IRIS at Kilpisja¨rvi were at MLTs in\nthe range ∼08:31 to ∼11:29 and so were ideally located to\nobserve any SIA effects.\nIt should be noted that impulses in SYM-H are observed\nwithout coincident CNA at any riometers and CNA is seen\non occasions without signatures of magnetospheric compres-\nsion, indicating instances of both external and internal con-\ntrol of precipitation. Many of the impulses in SYM-H are\nsmall and have not been confirmed as Sudden Impulses.\nHowever, the observations of CNA relative the timing of\nimpulses in SYM-H imply that SIs will not always induce\nSIA when they occur during active periods. In the Osepian\nand Kirkwood (2004) study, 88.2% of storm SCs observed\nduring an active period resulted in SCA at a single riometer\n(Loparskaya, L≈5.3). The impulses during the geomagnetic\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2066 N. Longden et al.: Particle precipitation during 7 January 2005 storm\n0\n1\n2\nSGO Riometers and IRIS Absorption: 8 January 2005\n0\n1\n2\n0\n1\n2\n0\n1\n2\nA\nb s\n ( d\nB )\n0\n1\n2\n0\n1\n2\n04 05 06 07 08 09 10\n0\n1\n2\nUT (hh)\n0\n0.5\n1\nNORSTAR Riometers Absorption: 8 January 2005\n0\n0.5\n1\n0\n0.5\n1\n0\n0.5\n1\nA\nb s\n ( d\nB )\n0\n0.5\n1\n0\n0.5\n1\n04 05 06 07 08 09 10\n0\n0.5\n1\nUT (hh)\n04 05 06 07 08 09 10\n0\n−50\n−100\nUT (hh)\nS Y\nM\n− H\n( n\nT )\n20\n40\nS W\n D\nP\n( n\nP a\n)\n0\n20\n40\nS W\n D\nP\n( n\nP a\n)\n04 05 06 07 08 09 10\n−50\n−100\nUT (hh)\nS Y\nM\n− H\n( n\nT )\nKIL\n65.98o N\nABK\n65.41o N\nIVA\n65.17o N\nSOD\n64.06o N\nROV\n63.42o N\nOUL\n61.69o N\nJYV\n58.95o N\nTAL\n78.59o N\nCON\n73.00o N\nRAN\n72.53o N\nFCH\n68.62o N\nRAB\n67.08o N\nDAW\n65.92o N\nPIN\n60.24o N\n   a\n   b\nFig. 11. Ionospheric CNA from the selected GLORIA stations during the period of 04:00 UT until 10:00 UT on the 8 January 2005. The\nstations are ordered by descending magnetic latitude. Panel (a) shows data from the SGO riometers and IRIS at Kilpisja¨rvi. Panel (b) shows\ndata from the NORSTAR riometers. Solar wind dynamic pressure data from Geotail and the SYM-H index are shown at the bottom of each\npanel.\nstorm of the 7 and 8 January 2005 differ from storm SCs as\nthey are not isolated incidents and occur during ongoing geo-\nmagnetic activity. Also, the storm SCs are related to the pas-\nsage of interplanetary shocks whereas the impulses during\nthis ICME are due to Pdyn variations, controlled by changes\nin density.\nAt the time of the Pdyn pulses coincident with CNA, the\nelectron flux intensity at the LANL satellites show small in-\ncreases simultaneously across all energy channels. Studies\nconducted have shown a broad correlation between geosyn-\nchronous electron flux intensity and CNA during substorms\n(e.g. Parks et al., 1968; Arnoldy and Chan, 1969; Rosen\nand Winckler, 1970). Baker et al. (1981) present a number\nof events where riometers record CNA rises at the time of\ngeosynchronous flux intensity increases at conjugate LANL\nsatellites during the near midnight and morning sectors,\nagain during substorms.\n6 Summary and conclusions\nWe have presented a case study of energetic electron precip-\nitation during a moderate geomagnetic storm driven by the\npassage of an ICME. Observations were made by riometers\nin Canada and Fennoscandia that comprise part of GLORIA;\nthe locations of the instruments at the time of the storm on-\nset were particularly advantageous for studying both external\nand internal precipitation trigger mechanisms during the pe-\nriod of elevated geomagnetic activity.\nThe storm that began on 7 January 2005 was prefaced by a\nperiod of very low geomagnetic activity, leaving the magne-\ntosphere in an unprimed state in terms of the trapped electron\npopulation. A small increase in solar wind dynamic pressure\nled to a weak sudden commencement as recorded by mid and\nlow latitude magnetometers. Riometers located close to local\nnoon recorded zero increases in CNA; this is consistent with\nthe findings of Osepian and Kirkwood (2004).\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\nN. Longden et al.: Particle precipitation during 7 January 2005 storm 2067\nCNA was only observed following periods of enhanced\nIMF-magnetosphere coupling (as indicated by negative Bz)\nwhich led to substorm activity with associated injections of\nelectrons into the inner magnetosphere. An increase in CNA\nclose to dusk has been associated with the westward edge of\nthe substorm current system rather than a coincident small in-\ncrease in Pdyn. Subsequent larger steps in the pressure might\naffect the precipitation but the observations are inconclusive.\nMuch of the CNA observed during the storm was linked\nto substorm activity, through the precipitation of freshly in-\njected electrons or following gradient curvature drift. How-\never, additional absorption directly driven by solar wind con-\nditions was also observed. During the recovery phase of\nthe storm, substorm activity diminished and the effect of\nchanges in Pdyn on CNA could be determined. For an im-\npulse at ∼04:20 UT, riometers in both the post-dawn and\ndusk-midnight sectors recorded a response; the rise time was\nsimilar for all instruments indicating a global response to the\npressure enhancement.\nBetween 04:00 and 12:00 UT the dayside riometers record\na good correlation with the SYM-H index; although not all\nimpulses recorded in SYM-H show a corresponding absorp-\ntion signature. The nightside riometers do not show any fur-\nther enhancements. Thus solar wind density-controlled SIs\nduring the recovery phase of a storm can produce a very dif-\nferent precipitation response to typical SCs.\nAcknowledgements. The authors wish to thank M. Denton for use-\nful conversations. The ACE and Geotail solar wind and IMF data\nwere obtained from the NASA CDAWeb (http:\/\/cdaweb.gsfc.nasa.\ngov). The data originated from the Imaging Riometer for Iono-\nspheric Studies (IRIS), operated by the Department of Communi-\ncations Systems at Lancaster University (UK) in collaboration with\nthe Sodankyla¨ Geophysical Observatory, and is funded by the Sci-\nence and Technology Facilities Council (STFC, formerly PPARC).\nThe NORSTAR riometer project is supported by the Canadian\nSpace Agency. We are grateful to E. Spanswick who baselined the\nNORSTAR data used in this study. We thank the institutes who\nmaintain the IMAGE magnetometer array and the Finnish Meteo-\nrological Institute; the IMAGE magnetometer data are collected as\na joint European collaboration. The authors thank the SAMNET\nteam for magnetometer data. SAMNET is operated by Lancaster\nUniversity and funded by STFC (formerly PPARC). The authors\nthank I. R. Mann and the CARISMA team for data. CARISMA\nis operated by the University of Alberta with support from the\nCanadian Space Agency. The Dst and Kp indices data were ob-\ntained from NOAA’s Space Physics Interactive Data Resources\n(http:\/\/spidr.ngdc.noaa.gov). The SYM-H and auroral electrojet in-\ndices data were obtained from the Kyoto World Data Center for\nGeomagnetism (http:\/\/swdcdb.kugi.kyoto-u.ac.jp). We thank Dot\nDeLapp and team at LANL for providing the SOPA data.\nTopical Editor I. A. Daglis thanks M. Jarvis and another anony-\nmous referee for their help in evaluating this paper.\nReferences\nAraki, T.: Global structure of geomagnetic sudden commence-\nments, Planet. Space Sci., 25, 373–384, 1977.\nArnoldy, R. and Chan, K.: Particle substorms observed at the geo-\nstationary orbit, J. Geophys. Res., 74, 5019–5028, 1969.\nBaker, D., Stauning P., Hones Jr., E., Higbie, P., and Belian, R.:\nNear-equatorial, high-resolution measurements of electron pre-\ncipitation at Lw6.6, J. Geophys. Res., 86(A4), 2295–2313, 1981.\nBelian, R., Gisler, G., Cayton, T., and Christensen, R.: High-Z ener-\ngetic particles at geosynchronous orbit during the great solar pro-\nton event series of October 1989, J. Geophys. Res., 97, 16 897–\n16 906, 1992.\nBorovsky, J. and Denton, M.: Differences between CME-driven\nStorms and CIR-driven Storms, J. Geophys. Res., 111, A07S08,\ndoi:10.1029\/2005JA011447, 2006.\nBrown, R.: On the poleward expansion of ionospheric absorption\nregions triggered by sudden commencements of geomagnetic\nstorms, J. Geophys. Res., 83(A3), 1169–1171, 1978.\nBrown, R., Hartz, T., Landmark, B., Leinbach, H., and Ortner, J.:\nLarge-scale electron bombardment of the atmosphere at the sud-\nden commencement of a geomagnetic storm, J. Geophys. Res.,\n66, 1035–1041, 1961.\nBrown, R., Leinbach, H., Akasofu, S.-I., Driatsky, V., and Schmidt,\nR.: Quadruple conjugate pair observations of the sudden com-\nmencement absorption event on June 17, 1965, J. Geophys. Res.,\n77, 5602–5607, 1972.\nBurch, J.: Preconditions for the triggering of polar magnetic sub-\nstorms by storm sudden commencements, J. Geophys. Res., 77,\n5629–5632, 1972.\nDenton, M., Borovsky, J., Skoug, R., Thomsen, M., Lavraud,\nB., Henderson, M., McPherron, R., Zhang, J., and Liemohn,\nM.: Geomagnetic storms driven by ICME- and CIR-\ndominated solar wind, J. Geophys. Res., 111, A07S07,\ndoi:10.1029\/2005JA011436, 2006.\nFrank, L., Ackerson, K., Paterson, W., Lee, J., English, M., and\nPickett, G.: The Comprehensive Plasma Instrumentation (CPI)\nfor the GEOTAIL spacecraft, J. Geomagn. Geoelectr., 46, 23–37,\n1994.\nGonzalez, W., Joselyn, J., Kamide, Y., Kroehl, H., Rostoker, G.,\nTsurutani, B., and Vasyliunas, V.: What is a geomagnetic storm?,\nJ. Geophys. Res., 99, 5771–5792, 1994.\nGosling, J., McComas, D., Phillips, J., and Bame, J.: Geomagnetic\nactivity associated with Earth passage of interplanetary shock\ndisturbances and coronal mass ejections, J. Geophys. Res., 96,\n7831–7839, 1991.\nHargreaves, J.: Auroral absorption of HF radio waves in the iono-\nsphere: A review of results from the first decade of riometry, P.\nIEEE, 57, 1348–1373, 1969.\nHargreaves, J.: The Solar-Terrestrial Environment, Cambridge Uni-\nversity Press, 1992.\nKamide, Y., Yokoyama, N., Gonzalez, W., Tsurutani, B., Daglis, I.,\nBrekke, A., and Masuda, S.: Two step development of geomag-\nnetic storms, J. Geophys. Res., 103, 6917–6921, 1998.\nKhan, H. and Cowley, S.: Observations of the response time of\nhigh-latitude ionospheric convection to variations in the inter-\nplanetary magnetic field using EISCAT and IMP-8 Data, Ann.\nGeophys., 17, 1306–1335, 1999,\nhttp:\/\/www.ann-geophys.net\/17\/1306\/1999\/.\nKokubun, S., Yamamoto, T., Acuna, M., Hayashi, K., Shiokawa, K.,\nwww.ann-geophys.net\/25\/2053\/2007\/ Ann. Geophys., 25, 2053–2068, 2007\n2068 N. Longden et al.: Particle precipitation during 7 January 2005 storm\nand Kawano, H.: The GEOTAIL Magnetic Field Experiment, J.\nGeomagn. Geoelectr., 46, 7–21, 1994.\nMaus, S., MacMillan, S., Chernova, T., Choi, S., Dater, D.,\nGolovkov, V., Lesur, V., Lowes, F., Lu¨hr, H., Mai, W., McLean,\nS., Olsen, N., Rother, M., Sabaka, T., Thomson, A., and Zvereva,\nT.: The 10th generation international geomagnetic reference\nfield, Phys. Earth Planet. In., 151, 320322, 2005.\nMcComas, D., Bame, S., Barker, P., Feldman, W., Phillips, J., Riley,\nP., and Griffee, J.: Solar Wind Electron Proton Alpha Monitor\n(SWEPAM) for the Advanced Composition Explorer, Space Sci.\nRev., 86, 563–612, 1998.\nOrtner, J., Hultqvist, B., Brown, R., Hartz, T., Holt, O., Land-\nmark, B., Hook, J., and Leinbach, H.: Cosmic noise absorp-\ntion accompanying geomagnetic storm sudden commencements,\nJ. Geophys. Res., 67, 4169–4186, 1962.\nOsepian, A. and Kirkwood, S.: Cosmic radio-noise absorption\nbursts caused by solar wind shocks, Ann. Geophys., 22, 2973–\n2987, 2004,\nhttp:\/\/www.ann-geophys.net\/22\/2973\/2004\/.\nParks, G., Arnoldy, R., Lezniak, T., and Winckler, J.: Correlated\neffects of energetic electrons at the 6.6Re equator and the auroral\nzone during magnetospheric substorms, Radio Sci., 3, 715–719,\n1968.\nPerona, G.: Theory on the precipitation of magnetospheric electrons\nat the time of sudden commencement, J. Geophys. Res., 77, 101–\n111, 1972.\nRichardson, I., Cliver, E., and Cane, H.: Sources of geomag-\nnetic storms for solar minimum and maximum conditions during\n1972–2000, Geophys. Res. Lett., 28, 2567–2572, 2001.\nRosen, L. and Winckler, J.: Evidence for the large-scale azimuthal\ndrift of electron precipitation during magnetospheric substorms,\nJ. Geophys. Res., 75, 5576–5581, 1970.\nSmith, C., L’Heureux, J., Ness, N., Acun˜a, M., Burlaga, L., and\nScheifele, J.: The ACE Magnetic Fields Experiment, Space Sci.\nRev., 86, 613–632, 1998.\nStauning, P.: Investigations of ionospheric radio wave absorption\nprocesses using imaging riometer techniques, J. Atmos. Terr.\nPhys., 58, 753–764, 1996.\nTakeuchi, T., Araki, T., Viljanen, A., and Watermann, J.: Ge-\nomagnetic negative sudden impulses: Interplanetary causes\nand polarization distribution, J. Geophys. Res., 107, A7,\ndoi:10.1029\/2001JA900152, 2002.\nTaylor, J., Lester, M., and Yeoman, T.: A superposed epoch analysis\nof geomagnetic storms, Ann. Geophys., 12, 612–624, 1994,\nhttp:\/\/www.ann-geophys.net\/12\/612\/1994\/.\nTsyganenko, N.: Modeling the Earth’s magnetospheric field con-\nfined within a realistic magnetospause, J. Geophys. Res., 100,\n5599–5612, 1995.\nWanliss, J. and Showalter, K.: High-resolution global storm in-\ndex: Dst versus SYM-H, J. Geophys. Res., 111, A02202,\ndoi:10.1029\/2005JA011034, 2006.\nAnn. Geophys., 25, 2053–2068, 2007 www.ann-geophys.net\/25\/2053\/2007\/\n"}