{"doi":"10.1136\/bmjqs.2010.048561","coreId":"219800","oai":"oai:eprints.lse.ac.uk:36852","identifiers":["oai:eprints.lse.ac.uk:36852","10.1136\/bmjqs.2010.048561"],"title":"Team situation awareness and the anticipation of patient progress during ICU rounds","authors":["Reader, Tom W.","Flin, Rhona","Mearns, Kathryn","Cuthbertson, Brian H."],"enrichments":{"references":[{"id":17279687,"title":"A knowledge elicitation approach to the measurement of team situation awareness.","authors":[],"date":"2001","doi":null,"raw":"Cooke N, Stout R, Salas E, et al. A knowledge elicitation approach to the measurement of team situation awareness.  In: McNeese M, Salas E, Endsley M, eds. New trends in cooperative activities: Understanding system dynamics in complex environments. Santa Monica: Human Factors and Ergonomics Society 2001.","cites":null},{"id":17279649,"title":"A look into the nature and causes of human errors in the intensive care unit. Crit Care Med","authors":[],"date":"1995","doi":"10.1097\/00003246-199502000-00015","raw":"Donchin Y, Gopher D, Olin M, et al. A look into the nature and causes of human errors in the intensive care unit. Crit Care Med 1995;23:294-300.","cites":null},{"id":17279636,"title":"A systematic review of the literature on multidisciplinary rounds to design information technology.","authors":[],"date":null,"doi":"10.1197\/jamia.m1992","raw":"Gurses A, Xiao Y. A systematic review of the literature on multidisciplinary rounds to design information technology. J Am Mel Inform Assoc 2006;13:267-76.","cites":null},{"id":17279676,"title":"Accuracy of predictions of survival at admission to the intensive care unit.","authors":[],"date":null,"doi":"10.1053\/jcrc.2001.21794","raw":"Barrera R, Nygard S, Sogoloff H, et al. Accuracy of predictions of survival at admission to the intensive care unit. J Crit Care 2001;16:32-35.","cites":null},{"id":17279656,"title":"Advances in measuring team cognition. In: Salas E, Fiore S, eds. Team cognition: understanding the factors that drive process and performance.","authors":[],"date":null,"doi":"10.1037\/10690-005","raw":"Cooke N, Salas E, Kiekal P, et al. Advances in measuring team cognition. In: Salas E, Fiore S, eds. Team cognition: understanding the factors that drive process and performance. Washington, DC: American Psychological Association 2004:83-106.","cites":null},{"id":17279682,"title":"An audit of interruptions in intensive care: implications for safety and quality. Intensive Care Med","authors":[],"date":"2007","doi":null,"raw":"Nimmo G, Mitchell C. An audit of interruptions in intensive care: implications for safety and quality. Intensive Care Med 2007;33 (Suppl 2):198-203.","cites":null},{"id":17279670,"title":"An examination of learning processes during critical incident training: Implications for the development of adaptable trainees.","authors":[],"date":null,"doi":"10.1037\/0021-9010.91.6.1276","raw":"Neal A, Godley S, Kirkpatrck T, et al. An examination of learning processes during critical incident training: Implications for the development of adaptable trainees. J Appl Psychol 2006;91:1276-91.","cites":null},{"id":17279669,"title":"An initial investigation into the cognitive processes underlying mental projection.","authors":[],"date":"2003","doi":"10.1037\/e577042012-072","raw":"Jones D, Quoetone E, Feree J, et al. An initial investigation into the cognitive processes underlying  mental  projection.  Proceedings  of  the  Human  Factors  and  Ergonomics Society 2003.","cites":null},{"id":17279648,"title":"Association between nurse-physician collaboration and patient outcomes in three intensive care units. Crit Care Med","authors":[],"date":"1999","doi":"10.1097\/00003246-199909000-00045","raw":"Baggs J, Schmitt M, Mushlin A, et al. Association between nurse-physician collaboration and patient outcomes in three intensive care units. Crit Care Med 1999;27:1991-8.","cites":null},{"id":17279671,"title":"Availability: a heuristic for judging frequency and probability.","authors":[],"date":null,"doi":"10.1017\/cbo9780511809477.012","raw":"Tversky A, Kahneman D. Availability: a heuristic for judging frequency and probability. Cognitive Psychology 1973;5:207-32.","cites":null},{"id":17279632,"title":"Building situation awareness in healthcare teams. In:","authors":[],"date":null,"doi":null,"raw":"Wright M, Endsley M. Building situation awareness in healthcare teams. In: Nemeth C, ed. Improving healthcare team communication: Ashgate 2008:97-114.","cites":null},{"id":17279675,"title":"Can the experienced ICU physician predict ICU length of stay and outcome better than less experienced colleagues? Intensive Care Med","authors":[],"date":"2004","doi":"10.1007\/s00134-003-2139-7","raw":"Vicente F, Lomar F, Melot C, et al. Can the experienced ICU physician predict ICU length of  stay  and  outcome  better  than  less  experienced  colleagues?  Intensive  Care  Med 2004;30:655-59. Reader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety.","cites":null},{"id":17279658,"title":"Clinician predictions of intensive care unit mortality. Crit Care Med","authors":[],"date":"2004","doi":"10.1097\/01.ccm.0000126402.51524.52","raw":"Rocker G, Cook D, Sjokvist P, et al. Clinician predictions of intensive care unit mortality. Crit Care Med 2004;32:1149-54.","cites":null},{"id":17279653,"title":"Communication and team situation awareness in the OR: Implications for augmentative information display. J Biomed Inform In","authors":[],"date":null,"doi":"10.1016\/j.jbi.2010.04.002","raw":"Parush A, Kramer C, Foster-Hunt T, et al. Communication and team situation awareness in the OR: Implications for augmentative information display. J Biomed Inform In Press.","cites":null},{"id":17279646,"title":"Communication behaviours in a hospital setting: an observational study.","authors":[],"date":null,"doi":"10.1136\/bmj.316.7132.673","raw":"Coiera E, Tombs V. Communication behaviours in a hospital setting: an observational study. BMJ 1998;316:673-6.","cites":null},{"id":17279674,"title":"Comparisons of outcome predictions made by physicians, by nurses, and by using the mortality prediction model.","authors":[],"date":null,"doi":null,"raw":"Copeland-Fields L, Griffin T, Jenkins T, et al. Comparisons of outcome predictions made by physicians, by nurses, and by using the mortality prediction model. Am J Crit Care 2001;10:313-19.","cites":null},{"id":17279680,"title":"Critical care physician cognitive task analysis: an exploratory study. Crit Care","authors":[],"date":"2009","doi":"10.1186\/cc7740","raw":"Fackler J, Watts C, McHugh A, et al. Critical care physician cognitive task analysis: an exploratory study. Crit Care 2009;13:R33.","cites":null},{"id":17279643,"title":"Defining and modeling situation awareness: A critical review. In:","authors":[],"date":"2004","doi":null,"raw":"Rousseau R, Tremblay S, Breton R. Defining and modeling situation awareness: A critical review. In: Banbury S, Tremblay S, eds. A cognitive approach to situation awareness: Theory and application. Bodmin, Cornwall: Ashgate 2004:3-21.","cites":null},{"id":17279647,"title":"Developing a team performance framework for the Intensive Care Unit. Crit Care Med","authors":[],"date":"2009","doi":"10.1097\/ccm.0b013e31819f0451","raw":"Reader T, Flin R, Mearns K, et al. Developing a team performance framework for the Intensive Care Unit. Crit Care Med 2009;35:1787-93.","cites":null},{"id":17279683,"title":"Dichotomization, partial correlation, and conditional independence.","authors":[],"date":null,"doi":"10.2307\/1165272","raw":"Vargha A, Rudas T, Delaney H, et al. Dichotomization, partial correlation, and conditional independence. Journal of Educational and Behavioural Statistics 1996;21:264-282.","cites":null},{"id":17279684,"title":"Discrepant attitudes about teamwork among critical care nurses and physicians. Crit Care Med","authors":[],"date":"2003","doi":"10.1097\/01.ccm.0000056183.89175.76","raw":"Thomas EJ, Sexton J, Helmreich RL. Discrepant attitudes about teamwork among critical care nurses and physicians. Crit Care Med 2003;31:956-959.","cites":null},{"id":17279638,"title":"Distributed cognition in the heart room: How situation awareness arises from coordinated communications during cardiac surgery.","authors":[],"date":null,"doi":"10.1016\/j.jbi.2007.02.001","raw":"Hazlehurst  B,  McMullen  C,  Gorman  P.  Distributed  cognition  in  the  heart  room:  How situation awareness arises from coordinated communications during cardiac surgery. J Biomed Inform 2007;40:539-51.","cites":null},{"id":17279686,"title":"Enhancing team mental model measurement with performance appraisal practices.","authors":[],"date":null,"doi":"10.1177\/109442810034001","raw":"Webber  S,  Chen  G,  Payne  S,  et  al.  Enhancing  team  mental  model  measurement  with performance appraisal practices. Organizational Research Methods 2000;3:307-322.","cites":null},{"id":17279651,"title":"Group interaction and flight crew performance.","authors":[],"date":"1988","doi":"10.1016\/b978-0-08-057090-7.50013-8","raw":"Foushee H, Helmreich RL, Weiner E, et al. Group interaction and flight crew performance. San Diego, CA: Academic Press 1988.","cites":null},{"id":17279635,"title":"Improving care by understanding the way we work: human factors and behavioural science in the context of intensive care. Crit Care","authors":[],"date":"2009","doi":"10.1186\/cc7787","raw":"Sevdalis N, Brett S. Improving care by understanding the way we work: human factors and behavioural science in the context of intensive care. Crit Care 2009;13:139.","cites":null},{"id":17279637,"title":"Improving communications in the ICU using daily goals.","authors":[],"date":null,"doi":"10.1053\/jcrc.2003.50008","raw":"Pronovost P, Berenholtz S, Dorman T, et al. Improving communications in the ICU using daily goals. J Crit Care 2003;18:71-5.","cites":null},{"id":17279650,"title":"Interdisciplinary communication in the intensive care unit.","authors":[],"date":null,"doi":"10.1093\/bja\/ael372","raw":"Reader T, Flin R, Mearns K, et al. Interdisciplinary communication in the intensive care unit. Br J Anaesth 2007;98:347-52. Reader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety.","cites":null},{"id":17279677,"title":"Interruptive communication patterns in the intensive care unit ward round.","authors":[],"date":null,"doi":"10.1016\/j.ijmedinf.2005.03.017","raw":"Alvarez G, Coiera E. Interruptive communication patterns in the intensive care unit ward round. Intl J Med Inf 2005;74:791-96.","cites":null},{"id":17279685,"title":"Investigating linear and interactive effects of shared mental models on safety and efficiency in a field setting.","authors":[],"date":null,"doi":"10.1037\/0021-9010.90.3.523","raw":"Smith-Jentsch KA, Mathieu JE, Kraiger K. Investigating linear and interactive effects of shared  mental  models  on  safety  and  efficiency  in  a  field  setting.  J  Appl  Psychol 2005;90:523-535.","cites":null},{"id":17279667,"title":"Long-term mortality outcome associated with prolonged admission to the ICU.","authors":[],"date":null,"doi":"10.1378\/chest.129.4.954","raw":"Laupland K, Kirkpatrick A, Kortbeek J, et al. Long-term mortality outcome associated with prolonged admission to the ICU. Chest 2005;129:954-9.","cites":null},{"id":17279681,"title":"Making it safe: The effects of leader inclusiveness and professional status on psychological safety and improvement efforts in health care teams.","authors":[],"date":null,"doi":"10.1002\/job.413","raw":"Nembhard  I,  Edmondson  AC.  Making  it  safe:  The  effects  of  leader  inclusiveness  and professional status on psychological safety and improvement efforts in health care teams. J Organ Beh 2006;27:941-966.","cites":null},{"id":17279642,"title":"Measurement of team situation awareness in low experience level aviators.","authors":[],"date":null,"doi":"10.1080\/10508410709336936","raw":"Prince C, Ellis E, Brannick MT, et al. Measurement of team situation awareness in low experience level aviators. Int J Aviat Psychol 2007;17:41-57.","cites":null},{"id":17279665,"title":"Multiple organ failure: by the time you predict it, it's already there.","authors":[],"date":"1999","doi":"10.1097\/00005373-199904000-00007","raw":"Cryer H, Leong K, McArthur D, et al. Multiple organ failure: by the time you predict it, it's already there. J Trauma 1999;46:597-604.","cites":null},{"id":17279634,"title":"Non-technical skills in the Intensive Care Unit.","authors":[],"date":null,"doi":"10.1093\/bja\/ael067","raw":"Reader T, Flin R, Lauche K, et al. Non-technical skills in the Intensive Care Unit. Br J Anaesth 2006;96:551-9.","cites":null},{"id":17279657,"title":"Objective measures of situation awareness in a simulated medical environment. Qual Saf Health Care","authors":[],"date":"2004","doi":null,"raw":"Wright  MC,  Taekman  JM,  Endsley  M.  Objective  measures  of  situation  awareness  in  a simulated medical environment. Qual Saf Health Care 2004;13:65-71.","cites":null},{"id":17279689,"title":"Observational Skill-based Clinical Assessment tool for Resuscitation (OSCAR): Development and validation. Resuscitation In","authors":[],"date":null,"doi":"10.1016\/j.resuscitation.2011.03.009","raw":"Walker S, Brett S, McKay A, et al. Observational Skill-based Clinical Assessment tool for Resuscitation (OSCAR): Development and validation. Resuscitation In Press.","cites":null},{"id":17279666,"title":"Prolonged intensive care unit stay in cardiac surgery: risk factors and long-term-survival. Ann Thorac Surg","authors":[],"date":"2006","doi":"10.1016\/j.ejcts.2006.01.004","raw":"Hein  O,  Birnbaum  J,  Wernecke  K,  et  al.  Prolonged  intensive  care  unit  stay  in  cardiac surgery: risk factors and long-term-survival. Ann Thorac Surg 2006;81:880-5.","cites":null},{"id":17279645,"title":"safety, and cooperative work in the intensive care unit.","authors":[],"date":null,"doi":"10.1007\/s10111-006-0057-5","raw":"Albolino  S,  Cook  RI,  O'Connor  M.  Sensemaking,  safety,  and  cooperative  work  in  the intensive care unit. Cogn Technol & Work 2007;9:131-7.","cites":null},{"id":17279655,"title":"Situation Awareness: Progress and directions. In:","authors":[],"date":"2004","doi":"10.1093\/oxfordhb\/9780199757183.013.0006","raw":"Endsley M. Situation Awareness: Progress and directions. In: Banbury S, Tremblay S, eds. A cognitive approach to situation awareness: Theory and application. Bodmin, Cornwall: Ashgate 2004:317-341.","cites":null},{"id":17279652,"title":"Skillful anticipation: maternity nurses' perspectives on maintaining safety.","authors":[],"date":null,"doi":"10.1136\/qshc.2007.024547","raw":"Lyndon A. Skillful anticipation: maternity nurses' perspectives on maintaining safety. Qual Saf Health Care 2010;19:1-5.","cites":null},{"id":17279654,"title":"Supporting structures for team situation awareness and decision making: insights from four delivery suites.","authors":[],"date":null,"doi":"10.1111\/j.1365-2753.2008.00953.x","raw":"Mackintosh N, Berridge E, Freeth D. Supporting structures for team situation awareness and decision making: insights from four delivery suites. J Eval Clin Pract 2009;15:46-54.","cites":null},{"id":17279644,"title":"Team cognition: Understanding the factors that drive process and performance.","authors":[],"date":"2004","doi":"10.1037\/10690-000","raw":"Salas  E,  Fiore  S.  Team  cognition:  Understanding  the  factors  that  drive  process  and performance. Washington, DC: American Psychological Association 2004.","cites":null},{"id":17279640,"title":"Team decision making in complex environments.","authors":[],"date":null,"doi":"10.1002\/bdm.381","raw":"Orasanu J, Salas E. Team decision making in complex environments. In: Orasanu J, Salas E, Klein  GA,  Calderwood  R,  eds.  Decision  making  in  action:  models  and  methods. Norwood, NJ: Ablex 1993:327-45.","cites":null},{"id":17279679,"title":"Team leadership in the Intensive Care Unit. The perspective of specialists. Crit Care Med In","authors":[],"date":null,"doi":"10.1097\/ccm.0b013e318218a4c7","raw":"Reader  T,  Flin  R,  Cuthbertson  B.  Team  leadership  in  the  Intensive  Care  Unit.  The perspective of specialists. Crit Care Med In Press.","cites":null},{"id":17279678,"title":"The nature of constraints on collaborative decision making in health care settings. In: Salas","authors":[],"date":null,"doi":null,"raw":"Patel V, Arocha J. The nature of constraints on collaborative decision making in health care settings. In: Salas E, Klein G, eds. Linking Expertise and Naturalistic Decision Making. New Jersey: Lawrence Erlbaum Associates 2001:383-405.","cites":null},{"id":17279668,"title":"The SOFA (Sepsis-Related Organ Failure Assessment) score to describe organ dysfunction\/failure. Intensive Care Med","authors":[],"date":"1996","doi":"10.1007\/bf01709751","raw":"Vincent  JL,  Moreno  R,  Takala  J,  et  al.  The  SOFA  (Sepsis-Related  Organ  Failure Assessment)  score  to  describe  organ  dysfunction\/failure.  Intensive  Care  Med 1996;22:707-10.","cites":null},{"id":17279688,"title":"Thinking ahead of the surgeon - An interview study to identify scrub practitioners' non-technical skills.","authors":[],"date":null,"doi":"10.1016\/j.ijnurstu.2010.11.005","raw":"Mitchell L, Flin R, Yule S, et al. Thinking ahead of the surgeon - An interview study to identify  scrub  practitioners'  non-technical  skills.  International  Journal  of  Nursing Studies. Int J Nurs Stud. In Press.","cites":null},{"id":17279631,"title":"Towards a theory of situation awareness in dynamic systems.","authors":[],"date":"1995","doi":"10.1518\/001872095779049543","raw":"Endsley  M.  Towards  a  theory  of  situation awareness  in  dynamic  systems.  Hum  Factors 1995;37:32-64.","cites":null},{"id":17279633,"title":"Translational cognition for decision support in critical care environments: A review.","authors":[],"date":null,"doi":"10.1016\/j.jbi.2008.01.013","raw":"Patel V, Zhang J, Yoskowitz N, et al. Translational cognition for decision support in critical care environments: A review. J Biomed Inform 2008;41:413-31.","cites":null},{"id":17279672,"title":"Visual search while driving: Skill and awareness during inspection of the scene.","authors":[],"date":null,"doi":"10.1016\/s1369-8478(02)00008-6","raw":"Underwood  G,  Chapman  P,  Boweden  K,  et  al.  Visual  search  while  driving:  Skill  and awareness during inspection of the scene. Transportation Research, Part F 2002;5:87-97.","cites":null},{"id":17279639,"title":"Who is flying this plane anyway? What mishaps tell us about crew member role assignment and aircrew situation awareness. Hum Factors","authors":[],"date":"1999","doi":"10.1518\/001872099779577237","raw":"Jentsch F, Barnett J, Bowers C, et al. Who is flying this plane anyway? What mishaps tell us about  crew  member  role  assignment  and  aircrew  situation  awareness.  Hum  Factors 1999;41:1-14.","cites":null},{"id":17279673,"title":"Withdrawal of mechanical ventilation in anticipation of death in the intensive care unit.","authors":[],"date":null,"doi":"10.1056\/nejmoa030083","raw":"Cook D, Rocker G, Marshall J, et al. Withdrawal of mechanical ventilation in anticipation of death in the intensive care unit. New Engl J Med 2003;349:1123-32.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"Background The ability of medical teams to develop and maintain team situation awareness (team SA) is crucial for patient safety. Limited research has investigated team SA within clinical environments. This study reports the development of a method for investigating team SA during the intensive care unit (ICU) round and describes the results","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219800.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36852\/1\/Team_Situation_Awareness_and_the_Anticipation_of_Patient_Progress_During_ICU_Rounds_%28lsero%29.pdf","pdfHashValue":"c4affdb94e8544f88f89771ccfc33d6e88d31d51","publisher":"BMJ Publishing Group Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36852<\/identifier><datestamp>\n      2017-11-06T15:13:12Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36852\/<\/dc:relation><dc:title>\n        Team situation awareness and the anticipation of patient progress during ICU rounds<\/dc:title><dc:creator>\n        Reader, Tom W.<\/dc:creator><dc:creator>\n        Flin, Rhona<\/dc:creator><dc:creator>\n        Mearns, Kathryn<\/dc:creator><dc:creator>\n        Cuthbertson, Brian H.<\/dc:creator><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Background The ability of medical teams to develop and maintain team situation awareness (team SA) is crucial for patient safety. Limited research has investigated team SA within clinical environments. This study reports the development of a method for investigating team SA during the intensive care unit (ICU) round and describes the results.<\/dc:description><dc:publisher>\n        BMJ Publishing Group Ltd<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36852\/1\/Team_Situation_Awareness_and_the_Anticipation_of_Patient_Progress_During_ICU_Rounds_%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Reader, Tom W. and Flin, Rhona and Mearns, Kathryn and Cuthbertson, Brian H.  (2011) Team situation awareness and the anticipation of patient progress during ICU rounds.  BMJ Quality and Safety, 20 (12).  pp. 1035-1042.  ISSN 2044-5415     <\/dc:identifier><dc:relation>\n        http:\/\/qualitysafety.bmj.com\/<\/dc:relation><dc:relation>\n        10.1136\/bmjqs.2010.048561<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/36852\/","http:\/\/qualitysafety.bmj.com\/","10.1136\/bmjqs.2010.048561"],"year":2011,"topics":["RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \nTom W. Reader \nTeam situation awareness and the \nanticipation of patient progress during ICU \nrounds \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nReader, Tom W. and Flin, R. and Mearns, Kathryn and Cuthbertson, Brian H. (2011) Team \nsituation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality & \nSafety . ISSN 2044-5415 (In Press) \nDOI: 10.1136\/bmjqs.2010.048561 \n \n© 2011 BMJ Publishing Group Ltd. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36852\/ \nAvailable in LSE Research Online: July 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n1 \nTeam situation awareness and the anticipation of patient progress during ICU rounds  \n \nTom W Reader PhD*, Rhona Flin PhD**, Kathryn Mearns PhD**, Brian H Cuthbertson*** MD FRCA,  \n* Institute of Social Psychology, London School of Economics, Houghton Street, London, UK, WC2A 2AE \n** School of Psychology, University of Aberdeen, Kings College, Aberdeen, Scotland, UK, AB24 2UB \n*** Department of Critical Care Medicine, Sunnybrook Health Sciences Centre, Toronto, 2075 Bayview \nAvenue, Toronto, Canada \nShort title: Team Situation Awareness in the ICU \nName of institution where worked performed: University of Aberdeen, Aberdeen Scotland, UK.  \nAddress for correspondence: Dr Tom Reader, Institute of Social Psychology, London School of Economics, \nHoughton Street, London, UK, WC2A 2AE \nPhone +44 7955 7712; Fax +44 20 7955 7565; E-mail t.w.reader@lse.ac.uk  \nFinancial support: This work was supported by the College of Life Sciences and Medicine, University of \nAberdeen \nReprints: Will not be offered. \nConflicts of interest: None.  \nFinancial interests: None of the authors have any financial interests relating to this work. \n \n \n \n  \n \n \n \nKey words: ICU; Teamwork; Team Situation Awareness; Decision-making; Communication  \nWord count: 3350\nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n2 \nABSTRACT \n \nBackground. The ability of medical teams to develop and maintain team situation awareness \n(team SA) is crucial for patient safety. Limited research has investigated team SA within \nclinical environments. This study reports the development of a method for investigating team \nSA during the ICU round, and describes the results. \nMethods. In one ICU, a sample of doctors and nurses (n=44, who combined to form 37 \ndifferent teams) were observed during 34 morning ward rounds. Following the clinical review \nof each patient (n=105), team members individually recorded their anticipations for expected \npatient developments over 48 hours. Patient outcome data was collected to determine the \naccuracy of anticipations. Anticipations were compared amongst ICU team members, and the \ndegree of consensus was used as a proxy measure of team SA. Self-report and observational \ndata measured team member involvement and communication during patient reviews.  \nResults. For over half of 105 patients, ICU team members formed conflicting anticipations as to \nwhether patients would deteriorate within 48 hours. Senior doctors were most accurate in their \npredictions. Exploratory analysis found that team processes did not predict team SA. However, \nthe involvement of junior and senior trainee doctors in the patient decision-making process \npredicted the extent to which those team members formed team SA with senior doctors.  \nConclusions. A new method for measuring team SA during the ICU round was successfully \nemployed. A number of areas for future research were identified, including refinement of the \nsituation awareness and teamwork measures. \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n3 \nSituation awareness (SA) refers to an individual’s perception of the information within a task \nenvironment, comprehension of its meaning, and anticipation of potential future states 1. When \nmedical and nursing staff perform clinical work together, the development of shared and \naccurate SA between team members (termed team situation awareness) is important for patient \nsafety 2 3. Team SA has been identified as especially important for the ICU due to its reliance on \nmultidisciplinary teamwork and complex patient populations 3-5. In particular, Team SA is \nimportant during daily rounds, a task where ICU teams collaborate to review patients and share \ninformation pertinent to specific roles and care tasks (e.g. daily goals) 6 7. The SA developed \nduring daily rounds will likely influence how team members monitor the patient, prioritise \ntasks, and anticipate urgent events. Teams with mismatching SA for a patient’s condition or \nexpected development are susceptible to enacting uncoordinated and erroneous activities.  \n \nTeam processes related to team members sharing information and perspectives underpin the \ndevelopment of team SA 8-13. Such processes are central to daily rounds; senior doctors lead \ndecision-making through communicating and performing “sensemaking” activities to collect \ninformation, diagnose illnesses, and understand potential developments 14-16. Open \ncommunication is important for developing a shared understanding of patient care plans, and \nsenior doctors influence trainee and nursing staff behaviour during the round 7 17-19. This \nresonates with aviation research showing teams with sub-optimal SA to be characterised by \npoor information sharing, and the rejection of junior crew member contributions 9 10 20. Daily \nrounds may support the development of team SA through i) team members perceiving and \nsharing patient information (e.g. diagnosis, physiological data, team member opinions), and ii) \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n4 \nteam members interpreting information to understand patient conditions (influenced by team, \nexperience\/expertise, prior knowledge of patient), and anticipate progression.  \n \nThis article describes the development and trial of a measure of team SA for the ICU round. \nAlthough team SA appears important for patient safety 2 3 21 , real-life healthcare research on \nthis topic is minimal, with team SA being assessed through team observations 22-23. Although \nsuch methods have acknowledged limitations 24, developing non-observational measures of \nteam SA for live environments is highly complex 25. Measurement tools should capture SA as \nteams perform taskwork (without disrupting performance), and then compare SA between team \nmembers. Ideally, SA should be measured against objective situational measures 26. We report \non the results of a feasibility study to test the validity and potential utility of an ICU round-\nspecific team SA measure. Furthermore, we explore team SA theory through investigating the \nrelationship between team processes and team SA during patient reviews.  \n \nMETHOD \n \nSetting and Participants  \nThe study was based in a 16-bed ICU in a UK teaching hospital treating 800 patients per year \n(mean stay 4.8 days), and a 21% ICU mortality rate. A convenience sample of 44 ICU \ncaregivers volunteered to participate, consisting of 7 senior doctors (consultants), 6 senior \ntrainee doctors (specialist registrars), 23 junior trainee doctors (basic speciality trainees), and 8 \nsenior nurses. No demographic information was collected. Data were collected over 3 months. \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n5 \nDue to shift patterns, the 44 participants combined to form 37 different teams (with overlapping \npersonnel). Ethical approval was given by an NHS research ethics committee.   \n \nProcedure \n \nDeveloping a measure of Team SA  \nThe team SA measure was developed with ICU senior physicians and senior nurses and was \nintended to be used immediately after the discussion of a patient during the round. The measure \nassesses team member anticipations for the following four events on a likelihood scale of 0-100 \n27: i) the patient being discharged from the ICU during the next 48hrs (Discharge likelihood); ii) \nthe patient deteriorating during the next 48hrs (Deterioration likelihood); iii) the patient \nremaining on (or requiring) ventilator support during the next 48hrs (Ventilation likelihood), \nand iv) the patient surviving (Survival likelihood). Each anticipated event was designed to be \ncomparable with objective patient outcomes, in order that the ability of team members to \nanticipate future events could be assessed against objective data. For example, discharge, \nventilation and survival likelihood were retrospectively verifiable from ICU clinical audit \nsystems. Deterioration likelihood was determined through the sequential organ failure \nassessment (SOFA) calculation, which is used to track illness severity trajectory 28-31. Compared \nto much of the SA literature, the focus upon anticipations was unusual, but not unique 21 32-35. \nAnticipations were investigated in order to i) develop a standardised SA scale (irrespective of \nspecific pathologies) that allows accuracy to be easily assessed (i.e. by evidence of change), ii) \nmake standardised comparisons between team members’ SA, and iii) avoid priming participant \nattention\/SA by asking them to focus on specific data\/illnesses. In addition, anticipating patient \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n6 \noutcomes is considered important for ICU decision-making, with an established literature \nmeasuring clinical and nursing predictive accuracy 27 36-39.  \n \nSA Data collection \nDuring the daily round, team member SA for each patient was measured immediately at the end \nof the discussion for that patient. Participants recorded their anticipations (using a PDA device \nissued to each team member) for Discharge likelihood, Deterioration likelihood, Ventilation \nlikelihood, and Survival likelihood, alongside their perceived involvement in the patient \ndecision-making process. Structured observations also noted communication events during \npatient reviews, and patient outcome data were collected. Figure 1 outlines the full study \nprocedure, and the section below describes the team observational measures and involvement \nquestion item in greater detail.  \n \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n7 \nMeasuring team process \nAn observational protocol was designed to measure team communication events during each \npatient review (see table 1). Firstly, the number of verbal communications by senior trainee \ndoctors, junior trainee doctors, and senior nurses was noted. Trainee and nursing \ncommunications during ICU rounds often focus on information provision and sharing 18 40 41, \nand higher numbers of verbal communications were expected to indicate greater information \nsharing between team members (potentially enhancing team SA). Secondly, the number of \nprompts by senior doctors for contributions from trainees and nursing staff was noted. These \nwere expected to be significant for developing team SA (e.g. promoting knowledge sharing, \nhighlighting knowledge gaps), and are considered important for developing patient treatment \nplans 42. Communication frequencies (and not content) were noted in order to limit the \nworkload associated with managing both the SA and team data collection process.  \n \nIn addition to the team observations, participants reported their perceived involvement (on a 0-\n100 scale) in the patient decision-making process (involvement). Participants answered the \nquestion using the PDA device immediately after recording their anticipations of patient \ndevelopment. During the round, senior doctors are usually the main decision-makers, and they \ninvolve team members in the decision-making process in order to gather information on patients \n(e.g. from trainees monitoring patients), to share information (e.g. goals), and to educate \ntrainees 7 42 43. Therefore, trainee and nursing involvement during patient reviews may facilitate \nteam SA through i) increasing levels of perspective and information sharing by trainees and \nnursing staff, ii) helping trainees and nursing staff to understand the senior doctor’s goals and \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n8 \ninterpretation of information, and iii) allowing senior doctors to identify and resolve gaps in the \nknowledge\/understanding of team members.  \n \nLastly, observations also noted a number of control variables that might be found to influence \nteam processes or team SA (please see table 1). These included, i) the length of patient review \n(shorter reviews may indicate lower levels of patient complexity, or provide less opportunity for \ninformation sharing), ii) the number of team members attending each patient review (bigger \nteams may reduce opportunities for interactions between team members), iii) the senior doctor \nleading the patient review (senior doctors may have different preferences for involving trainees \nand nurses) 44, and iv) the number of times patient reviews were interrupted (potentially \ndisrupting the flow of conversations and understanding being developed by teams) 45.  \n \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n9 \n \n \nAnalysis \n \nTeam SA.  \nThe validity and sensitivity of the individual SA measures were assessed in order to consider \ntheir potential for further analysis and development. Firstly, it was expected that the anticipatory \nmeasures would regularly detect instances of shared and divergent team SA (and therefore \ndemonstrate variance). Secondly, it was expected that the measures would be sensitive to \nexpertise, with senior doctors being most accurate in anticipating patient outcomes. Lastly, it \nwas expected that where SA diverged, the anticipations of the majority would be more accurate \nTable 1 \nObservational categories of data collected during patient reviews \nCoding category Definition for observational coding Purpose of measurement \nVerbal communications \nduring the patient review by \nthe senior trainee doctor, \njunior trainee doctor, or \nsenior nurse  \n \n \nThe number of times the senior trainee, junior \ntrainee, or senior nurse  verbally communicated \nduring (and relating to) the patient review. Only the \nfrequencies of contributions, and not the lengths, \nwere recorded. \n \nTo capture contributions to the care discussion by \ntrainees and nurses.  Contributions by senior \ndoctors were not captured due to them accounting \nfor a majority of verbalisations during the patient \nreview \nThe verbal prompts for \ninput in the assessment (by \na senior doctor) from other \nteam members \nThe number of times a senior doctor prompted \neither the team, or individuals in the team, for some \nform of input (e.g. patient physiological \ninformation, underlying pathology of patients, \nopinions, potential care plans) \n \nTo capture prompts from the senior doctor to \nencourage team member contribution during the \npatient review. \nStart \/ finish time The time at which the patient review begins and \nends.  \n \nControl variable. To calculate the average number \nof team process behaviours (e.g. verbal \ncontributions) shown during patient reviews. Also \nused as a control variable for measuring the \nlength of each patient review. \n \nTeam size Number of team members present at the beginning \nof the patient review. \nControl variable. Increased numbers of team \nmembers are expected to reduce the number of \ntimes individuals communicate during the round \n \nSenior doctor  The individual senior doctor leading the round Control variable. To control for potential \ndifferences in the leadership style of consultants \nduring the patient review. \n \nInterruptions An interruption by an individual or event not \nrelated to the patient review. \nControl variable. To control for potential \ndisruptions to the patient review \n   \n \nNote. For purposes of analysis, the number of observations for each behavioural category is divided by the \nnumber of minutes taken for each patient review \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n10 \nthan the minority. To assess the formation of shared and accurate SA during patient reviews, \ndirections of team member anticipations were compared 46. Where respondents indicated an \nanticipation to be more than 55% likely, the response was classified ‘likely’. Items rated as less \nthan 45% likely were classified ‘unlikely’ (This margin was introduced after post-study \ndebriefings found a small number of participants to use the 45-55% range as proxy for \n‘uncertain either way’). A team was assessed to have developed shared SA for a patient if all \nteam member’ anticipations for the SA measure were the same (i.e. all ‘likely’ or ‘unlikely’). \nTo test SA accuracy, the anticipations of teams and individuals were compared to actual patient \nevents and progress.   \n \nTeam process data. The analysis assessed whether the team process data reflected findings from \nthe ICU team literature showing team member roles and group hierarchies to influence \nteamwork 17 19 44 47. Firstly, it was expected that trainees and nursing staff would report lower \nlevels of involvement in patient decision-making than senior doctors. Secondly, it was expected \nthat when team members were more involved in patient reviews, this would be associated with \nincreased communication events. Finally, it was expected that higher numbers of senior doctor \nprompts for information would be associated with increased team member communications.  \n \nTeam SA and Team Processes. Finally, for the appropriate measures, exploratory analyses \ninvestigate whether team processes measured during the patient review predict the strength of \nteam SA convergence. To measure convergence, we emulated previous team cognition research \n48 49\n and calculated the average squared Euclidian space between team member anticipations of \nlikely patient progression (on the 0-100 scale). Based on the distances between team member \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n11 \nanticipations, a team SA index was calculated. To explore team SA theory on the relationship \nbetween team processes and team SA 2 regression analyses investigate the relationship between \nteam processes and team SA within the ICU team. It is hypothesised that higher levels \ninvolvement, communication, and prompts for information will predict strength of team SA \nconvergence. Furthermore, considering the structure of ICU teams (with senior doctors as \ndecision-makers who share information and delegate tasks\/goals to specific team members 42), a \ndyadic analysis using regression investigates whether the involvement and communication \nbehaviours of trainees and senior nurses predict the degree to which they share SA with the \nsenior doctor (termed sub-team SA).  \n \n \nRESULTS \nA total of 37 ICU teams provided data on 105 patients. Of the patients, 70% survived, 53% \nwere not on ventilation after 48 hours, 36% were discharged after 48 hours, and 47% showed a \ndeterioration in condition within 48 hours. \n \ni) Team SA \nFor each SA item, table 2 shows the percentage of patients for which team members formed \nshared anticipations. Binomial tests found teams to form shared SA more often than chance (all \np < 0.05) for all individual items except deterioration likelihood, which showed greater \nvariance. In addition, Pearson chi-square tests found senior doctors to be more accurate in \nanticipating deterioration likelihood than junior trainees (p < 0.05, with a moderately strong \nCramer’s V effect size of 0.26) and senior nurses (p < 0.05, with a moderate Cramer’s V effect \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n12 \nsize of 0.23). For items where all team members formed shared SA (n=252), anticipations were \ncorrect for 71% of items. For items where team members did not form shared SA, 77% had a \nsingle team member diverging from the group (senior nurses 31%, senior doctors 27%, junior \ntrainees 25%, and senior trainees 17%). In these cases, the majority grouping was more likely to \nbe correct in their predictions (p < 0.01). When in a minority, senior doctor anticipations were \nincorrect for 58% of items.  \n \nTable 2 \nProportion of patients for which the ICU team formed shared \nanticipations of patient progression, and the accuracy of anticipations \nfor predicting patient outcomes.  \n \nSituation awareness item \n% of patients for which the \nteam formed shared \nanticipations \n% of anticipations accurate for predicting \npatient outcomes (by team member)  \n \n Team member \n \n Senior \nDoctor \nSenior \nTrainee \nJunior \nTrainee \nSenior \nNurse \nDischarge likelihood 64 65 77* 61* 66 \nDeterioration likelihood 45 75* 70 59* 60* \nVentilation likelihood 64 70 67 69 69 \nSurvival likelihood 65 67 65 65 63 \n \n* Significantly different at p < 0.05 \nN ≤ 105 patients \n \nii) Team process data \nA one-way ANOVA found trainees and nursing staff to report lower levels of involvement than \nsenior doctors (p<0.001).  In addition, self-ratings of involvement during patient reviews were \nfound to correlate with the verbal communications made by nursing staff (p<0.05), senior \ntrainees (p<0.01) and junior trainees (p<0.01). Finally, senior doctor prompts for information \ncorrelated with verbal contributions from nursing staff (p<0.05), senior trainees (p<0.01) and \njunior trainees (p<0.01). See table 3 for correlations and descriptive statistics. \n \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n13 \nTable 3.  \nPearson correlations and descriptive statistics for measures of team member involvement, \ncommunication behaviours (per minute)  and senior doctor prompts for input (per minute) during \npatient reviews. \n \nVariable 1.   SD \ninvolvement \n2.   ST \ninvolvement \n3.   JT \ninvolvement \n4.   SN \ninvolvement \n5.   ST \ncomms \n6.   JT \ncomms \n7.   SN \ncomms \n8.  SD  Prompts \nfor input \n1.   SD involvement -        \n2.   ST involvement \n-0.01 -       \n3.   JT involvement \n-0.17 -0.07 -      \n4.   SN involvement 0.29** -0.21 0.17 -     \n5.   ST communication \n-0.14 0.27** -0.01 -0.01 -    \n6.   JT communication 0.09 0.05 0.28** 0.22* 0.38*** -   \n7.   SN communication 0.10 -0.10 0.02 0.21* 0.16 0.33** -  \n8.  SD Prompts for input 0.09 0.00 0.03 0.18 0.61*** 0.42*** 0.10 - \n         \nMean. 87.8 70.8 57.4 25.4 0.52 0.43 0.10 0.41 \nSD 20.1 14.8 24.4 20.1 0.41 0.36 0.19 0.30 \n \nNote. N <= 105 patients;  SD = Senior doctor; ST = Senior trainee doctor; JT = Junior trainee doctor; SN = Senior nurse \n* p < 0.05.  ** p < 0.01.  *** p < 0.001 \n \n \niii) Teamwork processes and team SA \nThe analysis between team processes and team SA convergence focussed on deterioration \nlikelihood. This item showed considerable variance in the extent to which teams formed shared \nSA, and appeared more sensitive to expertise for predicting outcomes. A hierarchical regression \nwas conducted, with 1) reported involvement of team members during patient decision-making \nbeing regressed onto team SA for deterioration likelihood, 2) team member communication \nbehaviours being introduced to the regression, 3) the inclusion of control variables (see table 1). \nThe regression was non-significant.   \n \nFurther analysis investigated whether the involvement and communication behaviours of \ntrainees and senior nurses predicted the degree to which they formed convergent sub-team SA \n(Table 4). A series of hierarchical regressions was performed for each team member\/senior \ndoctor dyad, with 1) reported involvement of team members during patient decision-making \nbeing regressed onto sub-team SA for deterioration likelihood, 2) team member communication \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n14 \nbehaviours being introduced to the regression, and 3) inclusion of control variables. Senior \ntrainee involvement during patient decision-making predicted senior doctor\/senior trainee sub-\nteam SA for deterioration likelihood (R2 = 0.07, p < 0.05), however this was non-significant \nwhen including communication behaviours and control variables. Junior trainee involvement \nduring patient decision-making predicted senior doctor\/junior trainee sub-team SA for \ndeterioration likelihood (R2 = 0.18, p < 0.001). Communication behaviours and control \nvariables explained no further variance. Analysis of the senior nurse\/senior doctor dyad yielded \na non-significant regression.  \n \nTable 4. \nHierarchical regression of Senior Trainee \/ Senior Doctor and Junior \nTrainee \/ Senior Doctor sub-team SA for deterioration likelihood on \nmeasures of team process during the ICU round \n \nSenior Trainee\/Senior Doctor \nsub-team SA for deterioration \nlikelihood \nJunior Trainee \/Senior Doctor \nsub-team SA for deterioration \nlikelihood \nPredictor Step 1 Step 2 Step 3 Step 1 Step 2 Step 3 \nInvolvement       \n Trainee involvement .26* .24* .20† .42*** .44*** .45*** \n Senior Doctor involvement .05 .04 .07 .12 .12 .10 \nObserved behaviours       \n Trainee contributions  .09 .14  .10 .07 \n Senior Doctor prompts for input  .08 .07  .07 .04 \nControl variables       \n Senior Doctor   .06   .03 \n Number of team members   -.04   .00 \n Length of review   .06   -.08 \n Interruptions to the review   -.16   -.03 \n      \n  \n R2 .07* .08 .11 .18*** .18*** .19* \n ∆R2  .01 .03  .00 .01 \nNote. N = 93 patients. Regression values are standardized betas.  \n†p < 0.10.  * p < 0.05.  ** p < 0.01.  *** p < 0.001 \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n15 \nDISCUSSION \n \nThis study tested a method for measuring team SA during the ICU round, and a number of \ncomments can be made on the results.  \n \nMeasurement of team SA \nThe study measured team SA though focussing upon shared anticipations for aspects of patient \nprogression. More often than chance, ICU teams were found to develop shared anticipations of \ndischarge, ventilation, and survival likelihood. When teams did not form shared SA, a majority \nview was most accurate for predicting patient outcomes. Teams formed shared anticipations of \ndeterioration likelihood for less than half of patients, with senior doctor’ predictions most \naccurate. On reflection, the measures of discharge, ventilation, and survival likelihood had clear \nphysical\/visible outcomes or were dependent upon system factors (e.g. discharge), and were \ntherefore reasonably predictable (e.g. most patients survive ICU). Patient deteriorations may \nhave required greater expertise to predict (and therefore be a more effective measure of SA) as \nthey are subtle (e.g. not physically obvious), measured by a variety of clinical data, can occur \nearly during a patient stay, and are caused by a variety and combination of illness and treatment \nfactors 28-30.  \n \nThe handheld computers were efficient for measuring team SA during the round, and could be \nadapted to handovers processes or pre-operative checks, or focus on anticipations of specific \npatient developments (e.g. sepsis). Notably, despite team members being present during patient \ndiscussions, teams frequently formed different anticipations for patient progression. We cannot \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n16 \nestablish whether this was due to differences in the information perceived (or comprehended) \nduring patient reviews, however it may indicate anticipations to be an alternative diagnostic of \nSA for teams where members have differing roles, knowledge and expertise. Furthermore, it is \nnot possible to demonstrate that team members understood and answered the SA questions \nconsistently. For example, the implications of team members being uncertain or having \nanticipations that agree, but vary in strength, is unclear. This reflects debate on the \nmeaningfulness of comparing team member cognitions 50. The study also found examples of \nteams forming shared and incorrect anticipations of patient progression. This could arise from a \ndominant senior doctor leading opinion, yet it was also notable that senior doctor’ anticipations \nwere incorrect for approximately half of items where they were found to hold divergent \nanticipations to the team. This may highlight the importance of multidisciplinary collaboration \nfor forming accurate shared SA during patient reviews, whilst also pointing towards the \nlimitations of using anticipations of highly complex and uncertain patients to measure team SA.  \n \nTeam processes and team SA \nTeam processes were only found to predict sub-team SA at the dyadic level (between senior \ndoctors and trainees) for deterioration likelihood. Trainee involvement during patient decision-\nmaking processes may help develop sub-team SA through, i) promoting information sharing by  \ntrainees, ii) helping trainees to understand the senior doctor’s goals and to interpret information \nusing the senior doctors expertise, and iii) allowing senior doctors to identify and remedy gaps \nin trainee’ knowledge and understanding. This is consistent with team SA theory in healthcare 2, \nwith strong team SA emerging when team members share information pertinent to roles and \ntasks. Senior doctors report the engagement of trainees as particularly important when \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n17 \ndistributing tasks during the round 42. However, interpretation of the results is restricted due to \nlimitations in the data analysis. The analysis aggregated perceptions of SA to the group level, \nwith each patient treated as an individual data point. Data were collected from 37 unique teams \nwith overlapping team members (e.g. senior doctors and junior trainees), and the non-\nuniformity of data excluded hierarchical linear modelling. Thus, the regression analysis does \nnot test whether certain combinations of team members are particularly proficient at forming \nshared SA. In addition, extraneous variables may have influenced the study, including audibility \nof discussions and underlying patient complexity. These limitations reflect complexities in the \ncollection of team SA data within live healthcare environments. Even within the (relatively) \ncontrolled environment of an ICU ward round, the structure and nature of changing ICU teams, \ncomplex patient profiles, and environmental constraints influence how team SA can be \ncollected and analysed.   \n \nThe team process data reflected findings from the ICU team performance literature 16, with team \nmember involvement during decision-making being influenced by role. Informal post-study \ndiscussions found nurses to report a lack of opportunity\/need to contribute to decision-making, \nand difficulties in finding physical space to be involved. Junior trainees reported feeling \ninvolved when presenting patients, contributing opinions\/information to the decision-making \nprocesses, or participating in the diagnosis of new patients. In addition, junior trainees and \nnursing staff reported ‘confirming’ patient review outcomes with senior trainees after the round \nif they were unclear on an aspect of patient management. To encourage involvement, senior \ndoctors reported using eye contact, requests for information\/contributions, and temporary \ndelegation of decision-making to senior trainees (who reported high levels of involvement). \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n18 \nWhilst team members agreed their involvement in patient decision-making was important for \nbuilding shared SA, they acknowledged that this was not always possible (e.g. during very high \nworkloads).  \n \nFuture research will use structured qualitative observations to measure team processes, with a \nfocus on specific processes identified as important for team performance. The current study \nfound trainee involvement to contribute to the development of sub-team SA. This was not the \ncase for senior nurses, who reported being the least involved in rounds, and were observed to \nmake limited verbal contributions. Yet, monitoring and anticipatory skills are important for \nnursing practice in both surgical and intensive care teams 21 51 52, and future research should \ninvestigate why team members do not become involved in patient decision-making, and identify \nthe leadership behaviours and team skills that might increase participation. Future SA research \nmay also wish to further identify the shared information requirements of teams, and dyads of \nteam members, for different tasks\/scenarios (i.e. to understand optimal team SA). It may also \ninvestigate why teams develop shared but inaccurate SA during the round, alongside the \nimplications for performance, and methods for re-establishing and maintaining accurate SA. \nThis will allow future studies to explore whether there is a predictive relationship between team \nSA and patient outcomes, and to use team SA as a measure of team performance during the \nround.  \n \nConclusions \n \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n19 \nThis study successfully piloted an experimental method for measuring team SA during the ICU \nround. Further development is required to refine the SA measures, with potential applications to \na number of domains. Furthermore, the research may indicate a need to develop concepts of \nteam SA within healthcare, and to link them with patient outcomes. Research needs to reflect \nthe nature of developing shared SA in hierarchical multidisciplinary teams where training is \nongoing, and team members have different responsibilities, knowledge and experience.  \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n20 \nACKNOWLEDGEMENTS \nThe authors would like to thank the ICU staff who supported and participated in the study. We \nwould also like to thank the reviewers for their advice in redrafting the article.   \n \nLicence for Publication: \nThe Corresponding Author has the right to grant on behalf of all authors and does grant on \nbehalf of all authors, an exclusive licence (or non exclusive for government employees) on a \nworldwide basis to the BMJ Publishing Group Ltd to permit this article (if accepted) to be \npublished in BMJ:Quality and Safety and any other BMJPGL products and sublicences such \nuse and exploit all subsidiary rights, as set out in our licence.  \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n21 \nReferences \n \n1. Endsley M. Towards a theory of situation awareness in dynamic systems. Hum Factors \n1995;37:32-64. \n2. Wright M, Endsley M. Building situation awareness in healthcare teams. In: Nemeth C, ed. \nImproving healthcare team communication: Ashgate 2008:97-114. \n3. Patel V, Zhang J, Yoskowitz N, et al. Translational cognition for decision support in critical \ncare environments: A review. J Biomed Inform 2008;41:413-31. \n4. Reader T, Flin R, Lauche K, et al. Non-technical skills in the Intensive Care Unit. Br J \nAnaesth 2006;96:551-9. \n5. Sevdalis N, Brett S. Improving care by understanding the way we work: human factors and \nbehavioural science in the context of intensive care. Crit Care 2009;13:139. \n6. Gurses A, Xiao Y. A systematic review of the literature on multidisciplinary rounds to design \ninformation technology. J Am Mel Inform Assoc 2006;13:267-76. \n7. Pronovost P, Berenholtz S, Dorman T, et al. Improving communications in the ICU using \ndaily goals. J Crit Care 2003;18:71-5. \n8. Hazlehurst B, McMullen C, Gorman P. Distributed cognition in the heart room: How \nsituation awareness arises from coordinated communications during cardiac surgery. J \nBiomed Inform 2007;40:539-51. \n9. Jentsch F, Barnett J, Bowers C, et al. Who is flying this plane anyway? What mishaps tell us \nabout crew member role assignment and aircrew situation awareness. Hum Factors \n1999;41:1-14. \n10. Orasanu J, Salas E. Team decision making in complex environments. In: Orasanu J, Salas E, \nKlein GA, Calderwood R, eds. Decision making in action: models and methods. \nNorwood, NJ: Ablex 1993:327-45. \n11. Prince C, Ellis E, Brannick MT, et al. Measurement of team situation awareness in low \nexperience level aviators. Int J Aviat Psychol 2007;17:41-57. \n12. Rousseau R, Tremblay S, Breton R. Defining and modeling situation awareness: A critical \nreview. In: Banbury S, Tremblay S, eds. A cognitive approach to situation awareness: \nTheory and application. Bodmin, Cornwall: Ashgate 2004:3-21. \n13. Salas E, Fiore S. Team cognition: Understanding the factors that drive process and \nperformance. Washington, DC: American Psychological Association 2004. \n14. Albolino S, Cook RI, O'Connor M. Sensemaking, safety, and cooperative work in the \nintensive care unit. Cogn Technol & Work 2007;9:131-7. \n15. Coiera E, Tombs V. Communication behaviours in a hospital setting: an observational study. \nBMJ 1998;316:673-6. \n16. Reader T, Flin R, Mearns K, et al. Developing a team performance framework for the \nIntensive Care Unit. Crit Care Med 2009;35:1787-93. \n17. Baggs J, Schmitt M, Mushlin A, et al. Association between nurse-physician collaboration \nand patient outcomes in three intensive care units. Crit Care Med 1999;27:1991-8. \n18. Donchin Y, Gopher D, Olin M, et al. A look into the nature and causes of human errors in \nthe intensive care unit. Crit Care Med 1995;23:294-300. \n19. Reader T, Flin R, Mearns K, et al. Interdisciplinary communication in the intensive care unit. \nBr J Anaesth 2007;98:347-52. \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n22 \n20. Foushee H, Helmreich RL, Weiner E, et al. Group interaction and flight crew performance. \nSan Diego, CA: Academic Press 1988. \n21. Lyndon A. Skillful anticipation: maternity nurses' perspectives on maintaining safety. Qual \nSaf Health Care 2010;19:1-5. \n22. Parush A, Kramer C, Foster-Hunt T, et al. Communication and team situation awareness in \nthe OR: Implications for augmentative information display. J Biomed Inform In Press. \n23. Mackintosh N, Berridge E, Freeth D. Supporting structures for team situation awareness and \ndecision making: insights from four delivery suites. J Eval Clin Pract 2009;15:46-54. \n24. Endsley M. Situation Awareness: Progress and directions. In: Banbury S, Tremblay S, eds. \nA cognitive approach to situation awareness: Theory and application. Bodmin, Cornwall: \nAshgate 2004:317-341. \n25. Cooke N, Salas E, Kiekal P, et al. Advances in measuring team cognition. In: Salas E, Fiore \nS, eds. Team cognition: understanding the factors that drive process and performance. \nWashington, DC: American Psychological Association 2004:83-106. \n26. Wright MC, Taekman JM, Endsley M. Objective measures of situation awareness in a \nsimulated medical environment. Qual Saf Health Care 2004;13:65-71. \n27. Rocker G, Cook D, Sjokvist P, et al. Clinician predictions of intensive care unit mortality. \nCrit Care Med 2004;32:1149-54. \n28. Cryer H, Leong K, McArthur D, et al. Multiple organ failure: by the time you predict it, it's \nalready there. J Trauma 1999;46:597-604. \n29. Hein O, Birnbaum J, Wernecke K, et al. Prolonged intensive care unit stay in cardiac \nsurgery: risk factors and long-term-survival. Ann Thorac Surg 2006;81:880-5. \n30. Laupland K, Kirkpatrick A, Kortbeek J, et al. Long-term mortality outcome associated with \nprolonged admission to the ICU. Chest 2005;129:954-9. \n31. Vincent JL, Moreno R, Takala J, et al. The SOFA (Sepsis-Related Organ Failure \nAssessment) score to describe organ dysfunction\/failure. Intensive Care Med \n1996;22:707-10. \n32. Jones D, Quoetone E, Feree J, et al. An initial investigation into the cognitive processes \nunderlying mental projection. Proceedings of the Human Factors and Ergonomics \nSociety 2003. \n33. Neal A, Godley S, Kirkpatrck T, et al. An examination of learning processes during critical \nincident training: Implications for the development of adaptable trainees. J Appl Psychol \n2006;91:1276-91. \n34. Tversky A, Kahneman D. Availability: a heuristic for judging frequency and probability. \nCognitive Psychology 1973;5:207-32. \n35. Underwood G, Chapman P, Boweden K, et al. Visual search while driving: Skill and \nawareness during inspection of the scene. Transportation Research, Part F 2002;5:87-97. \n36. Cook D, Rocker G, Marshall J, et al. Withdrawal of mechanical ventilation in anticipation \nof death in the intensive care unit. New Engl J Med 2003;349:1123-32. \n37. Copeland-Fields L, Griffin T, Jenkins T, et al. Comparisons of outcome predictions made \nby physicians, by nurses, and by using the mortality prediction model. Am J Crit Care \n2001;10:313-19. \n38. Vicente F, Lomar F, Melot C, et al. Can the experienced ICU physician predict ICU length \nof stay and outcome better than less experienced colleagues? Intensive Care Med \n2004;30:655-59. \nReader, T., Flin, R., Mearns, K., & Cuthbertson, B. (In Press). Team situation awareness and the anticipation of patient progress during ICU rounds. BMJ Quality and Safety. \n \n23 \n39. Barrera R, Nygard S, Sogoloff H, et al. Accuracy of predictions of survival at admission to \nthe intensive care unit. J Crit Care 2001;16:32-35. \n40. Alvarez G, Coiera E. Interruptive communication patterns in the intensive care unit ward \nround. Intl J Med Inf 2005;74:791-96. \n41. Patel V, Arocha J. The nature of constraints on collaborative decision making in health care \nsettings. In: Salas E, Klein G, eds. Linking Expertise and Naturalistic Decision Making. \nNew Jersey: Lawrence Erlbaum Associates 2001:383-405. \n42. Reader T, Flin R, Cuthbertson B. Team leadership in the Intensive Care Unit. The \nperspective of specialists. Crit Care Med In Press. \n43. Fackler J, Watts C, McHugh A, et al. Critical care physician cognitive task analysis: an \nexploratory study. Crit Care 2009;13:R33. \n44. Nembhard I, Edmondson AC. Making it safe: The effects of leader inclusiveness and \nprofessional status on psychological safety and improvement efforts in health care teams. \nJ Organ Beh 2006;27:941-966. \n45. Nimmo G, Mitchell C. An audit of interruptions in intensive care: implications for safety \nand quality. Intensive Care Med 2007;33 (Suppl 2):198-203. \n46. Vargha A, Rudas T, Delaney H, et al. Dichotomization, partial correlation, and conditional \nindependence. Journal of Educational and Behavioural Statistics 1996;21:264-282. \n47. Thomas EJ, Sexton J, Helmreich RL. Discrepant attitudes about teamwork among critical \ncare nurses and physicians. Crit Care Med 2003;31:956-959. \n48. Smith-Jentsch KA, Mathieu JE, Kraiger K. Investigating linear and interactive effects of \nshared mental models on safety and efficiency in a field setting. J Appl Psychol \n2005;90:523-535. \n49. Webber S, Chen G, Payne S, et al. Enhancing team mental model measurement with \nperformance appraisal practices. Organizational Research Methods 2000;3:307-322. \n50. Cooke N, Stout R, Salas E, et al. A knowledge elicitation approach to the measurement of \nteam situation awareness. In: McNeese M, Salas E, Endsley M, eds. New trends in \ncooperative activities: Understanding system dynamics in complex environments. Santa \nMonica: Human Factors and Ergonomics Society 2001. \n51. Mitchell L, Flin R, Yule S, et al. Thinking ahead of the surgeon - An interview study to \nidentify scrub practitioners' non-technical skills. International Journal of Nursing \nStudies. Int J Nurs Stud. In Press. \n52. Walker S, Brett S, McKay A, et al. Observational Skill-based Clinical Assessment tool for \nResuscitation (OSCAR): Development and validation. Resuscitation In Press. \n \n \n \n \n \n \n"}