{"doi":"10.1016\/j.ecolmodel.2010.03.008","coreId":"140810","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6475","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6475","10.1016\/j.ecolmodel.2010.03.008"],"title":"Implementation and calibration of the parameter-sparse Yield-SAFE model to\npredict production and land equivalent ratio in mixed tree and crop systems\nunder two contrasting production situations in Europe","authors":["Graves, Anil R.","Burgess, Paul J.","Palma, João H. N.","Keesman, K. J.","van der Werf, Wopke","Dupraz, Christian","van Keulen, Herman","Herzog, F.","Mayus, Martina"],"enrichments":{"references":[{"id":37919187,"title":"A framework for quantifying the various effects of tree-crop interactions.","authors":[],"date":"1996","doi":null,"raw":"Ong, C.K., 1996. A framework for quantifying the various effects of tree-crop interactions. In: Ong, C.K. and Huxley, P. (eds.), Tree-Crop Interactions A Physiological Approach, pp. 1-23. Wallingford, Oxford: CAB International.","cites":null},{"id":37919162,"title":"Adequate design of control treatments in long term agroforestry experiments with multiple objectives.","authors":[],"date":"1998","doi":"10.1007\/978-94-017-0679-7_2","raw":"Dupraz, C., 1998. Adequate design of control treatments in long term agroforestry experiments with multiple objectives. Agroforestry Systems 43, 35-48.","cites":null},{"id":37919165,"title":"Bio-economic evaluation of agroforestry systems for Europe. Unpublished PhD thesis.","authors":[],"date":"2005","doi":null,"raw":"Graves, A.R., 2005. Bio-economic evaluation of agroforestry systems for Europe. Unpublished PhD thesis. Cranfield University, Bedfordshire, UK 254 pp.","cites":null},{"id":37919192,"title":"CLIGEN Weather Generator. United States Department of Agriculture Agricultural Research Service and United States Forest Service. Available: http:\/\/topsoil.nserl.purdue.edu\/nserlweb\/weppmain\/cligen\/","authors":[],"date":"2005","doi":null,"raw":"United States Department of Agriculture (2005). CLIGEN Weather Generator. United States Department of Agriculture Agricultural Research Service and United States Forest Service. Available: http:\/\/topsoil.nserl.purdue.edu\/nserlweb\/weppmain\/cligen\/ (February 28 2008) Van der Werf, W., Keesman, K., Burgess, P.J., Graves, A.R., Pilbeam, D., Incoll, L.D., Metselaar, K., Mayus, M., Stappers, R.,van Keulen, H., Palma, J., Dupraz, C., 2007. Yield-SAFE: a parameter-sparse process-based dynamic model for predicting resource capture, growth and production in agroforestry systems. Ecological Engineering 29, 419-433.","cites":null},{"id":37919161,"title":"Commission of the European Union","authors":[],"date":"2005","doi":"10.1016\/b0-12-369400-0\/00401-4","raw":"Commission of the European Union (2005). Council Regulation (EC) No 1698\/2005 on support for rural development by the European Agricultural Fund for Rural Development (EAFRD): OJ L 277, 21.10.2005; Bull. 9-2005. Brussels, Belgium, 40 pp.24 Corlett, J.E., Black, C.R., Ong, C.K., Monteith, J.L., 1992. Microclimate modification in a leucaena\/millet alley cropping system II. Light interception and dry matter production. Agricultural and Forest Meteorology 60, 73-91.","cites":null},{"id":37919195,"title":"Concepts in production ecology for analysis and quantification of agricultural input-output combinations.","authors":[],"date":"1997","doi":"10.1016\/s0378-4290(97)00037-3","raw":"Van Ittersum, M.K., Rabbinge, R., 1997. Concepts in production ecology for analysis and quantification of agricultural input-output combinations. Field Crops Research 52, 197-208.","cites":null},{"id":37919164,"title":"Database of historical climate data compiled by Global Data Systems for the United States Department of Agriculture World Weather Board from World Meteorological Organisation climate reporting systems. Available http:\/\/hydrolab.arsusda.gov\/nicks\/nicks.htm.","authors":[],"date":"2005","doi":null,"raw":"Global Data Systems, 2005. Database of historical climate data compiled by Global Data Systems for the United States Department of Agriculture World Weather Board from World Meteorological Organisation climate reporting systems. Available http:\/\/hydrolab.arsusda.gov\/nicks\/nicks.htm. (May 5 2005).","cites":null},{"id":37919172,"title":"Development and application of bio-economic modelling to compare silvoarable, arable and forestry systems in three European countries.","authors":[],"date":"2005","doi":"10.1016\/j.ecoleng.2006.09.018","raw":"Graves, A.R., Burgess, P.J., Palma, J.H.N., Herzog, F., Moreno, G., Bertomeu, M., Dupraz, C., Liagre, F., Keesman, K., van der Werf, W., Koeffeman de Nooy, A., van den Briel, J.P., 2005. Development and application of bio-economic modelling to compare silvoarable, arable and forestry systems in three European countries. Ecological Engineering 29, 434-449.","cites":null},{"id":37919199,"title":"Development and use of a database of hydraulic properties of European soils.","authors":[],"date":"1999","doi":"10.1016\/s0016-7061(98)00132-3","raw":"Wösten, J.H.M., Lilly, A., Nemes, A., Le Bas, C. 1999. Development and use of a database of hydraulic properties of European soils. Geoderma 90, 169-185.26","cites":null},{"id":37919170,"title":"Development and use of a framework for characterising computer models of silvoarable economics.","authors":[],"date":"2005","doi":"10.1007\/s10457-004-5545-0","raw":"Rigueiro-Rodríguez, J.H. McAdam, and M.R, Mosquera-Losada. Springer. Graves, A.R., Burgess, P.J., Liagre, F., Terreaux, J.P., Dupraz, C., 2005. Development and use of a framework for characterising computer models of silvoarable economics. Agroforestry Systems 65, 53-65.","cites":null},{"id":37919168,"title":"Farmer perceptions of silvoarable systems in seven European countries. In: Advances in Agroforestry Vol 6: Current Status and Future Prospects.","authors":[],"date":"2008","doi":"10.1007\/978-1-4020-8272-6_4","raw":"Graves, A.R., Burgess, P.J., Liagre, F., Pisanelli, A., Paris, P., Moreno, G.M., Bellido, M., Mayus, M., Postma, M., Schlindler, B., Mantzanas, K., Papanastasis, V.P. Dupraz, C., 2008. Farmer perceptions of silvoarable systems in seven European countries. In: Advances in Agroforestry Vol 6: Current Status and Future Prospects. Eds. A.","cites":null},{"id":37919186,"title":"Methodological approach for the assessment of environment effects of agroforestry at the landscape scale.","authors":[],"date":"2007","doi":"10.1016\/j.ecoleng.2006.09.016","raw":"Palma, J.H.N., Graves, A.R., Burgess, P.J., Keesman, K.J., van Keulen, H., Mayus, M., Reisner, Y., Herzog, F., 2007b. Methodological approach for the assessment of environment effects of agroforestry at the landscape scale. Ecological Engineering 29, 450-462.","cites":null},{"id":37919183,"title":"Modeling environmental benefits of silvoarable agroforestry in Europe.","authors":[],"date":"2007","doi":"10.1016\/j.agee.2006.07.021","raw":"Palma, J.H.N., Graves, A.R., Bunce, R.G.H., Burgess, P.J., de Filippi, F., Keesman, K.J., van Keulen, H., Liagre, F., Mayus, M., Moreno, G., Reisner, Y. & Herzog, H., 2007a. Modeling environmental benefits of silvoarable agroforestry in Europe. Agriculture, Ecosystems and Environment 119, 320-334.","cites":null},{"id":37919157,"title":"Poplar (Populus spp) growth and crop yields in a silvoarable experiment at three lowland sites in England.","authors":[],"date":"2004","doi":"10.1007\/s10457-004-7169-9","raw":"Burgess. P.J., Incoll, L.D., Corry, D.T., Beaton, A., Hart, B.J., 2004. Poplar (Populus spp) growth and crop yields in a silvoarable experiment at three lowland sites in England. Agroforestry Systems 63: 157-169.","cites":null},{"id":37919179,"title":"Post-dispersive losses of acorns from Mediterranean savannah-like forests and shrublands.","authors":[],"date":"2003","doi":"10.1016\/s0378-1127(02)00294-3","raw":"Leiva, M.J., Fernández-Alés, R., 2003. Post-dispersive losses of acorns from Mediterranean savannah-like forests and shrublands. Forest Ecology and Management 176, 265-271.25 McAdam, J.H., Burgess, P.J., Graves, A.R., Rigueiro-Rodríguez, A. & Mosquera-Losada, M.R., 2009. Classifications and functions of agroforestry systems in Europe. In : Agroforestry in Europe : Current Status and Future Prospects 21-41. (Eds. A. Rigueiro-Rodríguez, J. McAdam & M.R. Mosquera-Losada. Springer.","cites":null},{"id":37919175,"title":"Production ecology of agroforestry systems: a minimal mechanistic model and analytical derivation of the land equivalent ratio.","authors":[],"date":"2007","doi":"10.1016\/j.mbs.2007.04.001","raw":"Keesman, K.J., van der Werf, W., van Keulen, H. 2007. Production ecology of agroforestry systems: a minimal mechanistic model and analytical derivation of the land equivalent ratio. Mathematical Biosciences 209, 608-623.","cites":null},{"id":37919158,"title":"Provisional Yield Tables for Poplar in Britain. Forestry Commission Technical paper 6. Edinburgh:","authors":[],"date":"2004","doi":null,"raw":"Burgess, P.J., Graves, A.R., Metselaar, K., Stappers, R., Keesman, K., Palma, J, Mayus, M., van der Werf, W., 2004a. Description of the Plot-SAFE Version 0.3. Unpublished document, 15 September 2004. Silsoe, Bedfordshire: Cranfield University, 52 pp. Available http:\/\/montpellier.inra.fr\/safe\/. (May 5 2005) Christie, J.M. (1994). Provisional Yield Tables for Poplar in Britain. Forestry Commission Technical paper 6. Edinburgh: Forestry Commission, 35 pp.","cites":null},{"id":37919177,"title":"Report on farming in the Eastern Counties of","authors":[],"date":"2004","doi":null,"raw":"Lang, B., 2004. Report on farming in the Eastern Counties of England 2003\/2004, 139 pp. Cambridge University, Cambridge, United Kingdom.","cites":null},{"id":37919173,"title":"Silvoarable systems in Europe – past, present and future prospects.","authors":[],"date":"2006","doi":"10.1007\/s10457-005-1111-7","raw":"Eichhorn, M.P., Paris, P., Herzog, F., Incoll, L.D., Liagre, F., Mantzanas, K., Mayus, M., Moreno, G., Papanastis, V.P., Pilbeam, D.J., Pisanelli, A, Dupraz, C. 2006. Silvoarable systems in Europe – past, present and future prospects. Agroforestry Systems 67, 29-50.","cites":null},{"id":37919189,"title":"Target regions for silvoarable agroforestry in Europe.","authors":[],"date":"2007","doi":"10.1016\/j.ecoleng.2006.09.020","raw":"Reisner, Y, de Filippia, R., Herzog, F., Palma, F. (2007). Target regions for silvoarable agroforestry in Europe. Ecological Engineering 29, 4, 401-418 Shakesby, R.A., Coelho, C.O.A., Schnabel, S., Keizer, J.J., Clarke, M.A., Lavado-Contador, J.F., Walsh, R.P.D., Ferreira, A.J.D., Doerr, S.H., 2002. A ranking methodology for assessing relative erosion risk and its application to dehesas and montados in Spain and Portugal. Land Degradation and Development 13, 129-140.","cites":null},{"id":37919180,"title":"The concept of a “Land Equivalent Ratio” and advantages in yields from intercropping.","authors":[],"date":"1980","doi":"10.1017\/s0014479700010978","raw":"Mead, R., Willey, R.W., 1980. The concept of a “Land Equivalent Ratio” and advantages in yields from intercropping. Experimental Agriculture 16, 217-228.","cites":null},{"id":37919182,"title":"Unusual fine root distributions of two deciduous tree species in southern France: what consequences for modelling of tree root dynamics?","authors":[],"date":"2006","doi":"10.1007\/s11104-005-3770-6","raw":"Mulia, R., Dupraz, C., 2006. Unusual fine root distributions of two deciduous tree species in southern France: what consequences for modelling of tree root dynamics? Plant and Soil 281, 71-85.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-07-10T00:00:00Z","abstract":"Silvoarable agroforestry, the integration of trees and arable crops on the same\narea, has the potential to offer production, ecological, and societal benefits.\nHowever, the uptake of such systems in Europe has been limited by a combination\nof unsupportive policies and uncertainty concerning their productivity,\nprofitability, and environmental impact. Faced with a lack of experimental data,\nthe parameter-sparse Yield-SAFE model offers one method for generating plausible\nyield data and improving understanding of production in mixed tree–crop systems\nunder European conditions. The applicability of the model was examined by: (i)\nselecting two contrasting sites in France and the UK with measured agricultural,\nsilvoarable and\/or forestry data, (ii) implementing the model in a software\npackage, and (iii) inputting data and parameters on the climate, soils,\nmanagement regime, and tree and crop types. Following calibration, Yield-SAFE\nprovided credible descriptions of measured arable and tree (Populus spp.) yields\nin the monoculture and silvoarable systems at the two sites. An examination of\nthe response of the model to changes in model parameters and environmental and\nmanagement data showed that silvoarable crop yields were most sensitive to\nvariations in tree parameters. Increased soil depths increased timber yields,\nand increasing stand density increased stand volume whilst decreasing individual\ntree volume. In all the simulations, the model predicted greater efficiency in\nuse of land, i.e. greater land equivalent ratios, when trees and crops were\ncombined rather than grown as sole crops. These results, supported by the sparse\nexperimental data available, indicate that agroforestry provides a method of\nincreasing food, timber and biomass production from limited land resources in\nEuro","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140810.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ecolmodel.2010.03.008","pdfHashValue":"47ce94375a3876ba5dff0658af8af376a7e2083a","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6475<\/identifier><datestamp>2012-09-11T10:43:13Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Implementation and calibration of the parameter-sparse Yield-SAFE model to\npredict production and land equivalent ratio in mixed tree and crop systems\nunder two contrasting production situations in Europe<\/dc:title><dc:creator>Graves, Anil R.<\/dc:creator><dc:creator>Burgess, Paul J.<\/dc:creator><dc:creator>Palma, João H. N.<\/dc:creator><dc:creator>Keesman, K. J.<\/dc:creator><dc:creator>van der Werf, Wopke<\/dc:creator><dc:creator>Dupraz, Christian<\/dc:creator><dc:creator>van Keulen, Herman<\/dc:creator><dc:creator>Herzog, F.<\/dc:creator><dc:creator>Mayus, Martina<\/dc:creator><dc:description>Silvoarable agroforestry, the integration of trees and arable crops on the same\narea, has the potential to offer production, ecological, and societal benefits.\nHowever, the uptake of such systems in Europe has been limited by a combination\nof unsupportive policies and uncertainty concerning their productivity,\nprofitability, and environmental impact. Faced with a lack of experimental data,\nthe parameter-sparse Yield-SAFE model offers one method for generating plausible\nyield data and improving understanding of production in mixed tree–crop systems\nunder European conditions. The applicability of the model was examined by: (i)\nselecting two contrasting sites in France and the UK with measured agricultural,\nsilvoarable and\/or forestry data, (ii) implementing the model in a software\npackage, and (iii) inputting data and parameters on the climate, soils,\nmanagement regime, and tree and crop types. Following calibration, Yield-SAFE\nprovided credible descriptions of measured arable and tree (Populus spp.) yields\nin the monoculture and silvoarable systems at the two sites. An examination of\nthe response of the model to changes in model parameters and environmental and\nmanagement data showed that silvoarable crop yields were most sensitive to\nvariations in tree parameters. Increased soil depths increased timber yields,\nand increasing stand density increased stand volume whilst decreasing individual\ntree volume. In all the simulations, the model predicted greater efficiency in\nuse of land, i.e. greater land equivalent ratios, when trees and crops were\ncombined rather than grown as sole crops. These results, supported by the sparse\nexperimental data available, indicate that agroforestry provides a method of\nincreasing food, timber and biomass production from limited land resources in\nEurop<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-17T23:02:41Z<\/dc:date><dc:date>2011-10-17T23:02:41Z<\/dc:date><dc:date>2010-07-10T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>A.R. Graves, P.J. Burgess, J. Palma, K.J. Keesman, W. van der Werf, C. Dupraz, H. van Keulen, F. Herzog, M. Mayus, Implementation and calibration of the parameter-sparse Yield-SAFE model to\npredict production and land equivalent ratio in mixed tree and crop systems\nunder two contrasting production situations in Europe, Ecological Modelling, Volume 221, Issues 13-14, 10 July 2010, Pages 1744-1756.<\/dc:identifier><dc:identifier>0304-3800<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ecolmodel.2010.03.008<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6475<\/dc:identifier><dc:rights>NOTICE: this is the author’s version of a work that was accepted for publication in Ecological Modelling. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Ecological Modelling, VOL 221, ISSUE 13-14, (2010) DOI:10.1016\/j.ecolmodel.2010.03.008<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0304-3800","issn:0304-3800"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":"1Ecological Modelling, Volume 221, Issue 13-14, 10th July 2010, Pages 1744-1756.\ndoi:10.1016\/j.ecolmodel.2010.03.008\nImplementation and calibration of the parameter-sparse Yield-SAFE\nmodel to predict production and land equivalent ratio in mixed tree and\ncrop systems under two contrasting production situations in Europe\nA.R. Graves 1, P. J. Burgess 1, J. Palma 3, K. Keesman 4, W. van der Werf 4, C. Dupraz 2, H.\nvan Keulen4, F. Herzog 3, M. Mayus4\n1Cranfield University, Cranfield, Bedfordshire MK43 0AL, United Kingdom\n2Institut National de la Recherche Agronomique, UMR System, 2 Place Viala, 34060\nMontpellier, France\n3Agroscope Reckenholz-Tänikon Research Station, Reckenholzstrasse 191, 8046 Zurich,\nSwitzerland\n4Wageningen University, P.O. Box 43, 6700 AA, Wageningen, the Netherlands\nFull address for correspondence:\nA.R. Graves, Cranfield University, Cranfield, Bedfordshire, MK43 0AL, U.K\nTelephone number: +44-(0)1234 750111\nE-mail address: a.r.graves@cranfield.ac.uk\nKey words: Yield-SAFE, PlotSAFE, modelling, simulation, land equivalent ratio, LER,\ncrop yield, timber volume, agroforestry, silvoarable\n2ABSTRACT\nSilvoarable agroforestry, the integration of trees and arable crops on the same area, has the\npotential to offer production, ecological and societal benefits. However, the uptake of such\nsystems in Europe has been limited by a combination of unsupportive policies and\nuncertainty concerning their productivity, profitability, and environmental impact. Faced\nwith a lack of experimental data, the parameter-sparse Yield-SAFE model offers one\nmethod for generating plausible yield data and improving understanding of production in\nmixed tree-crop systems under European conditions. The applicability of the model was\nexamined by: i) selecting two contrasting sites in France and the UK with measured\nagricultural, silvoarable and\/or forestry data, ii) implementing the model in a software\npackage, and iii) inputting data and parameters on the climate, soils, management regime,\nand tree and crop types. Following calibration, Yield-SAFE provided credible descriptions\nof measured arable and tree (Populus spp) yields in the monoculture and silvoarable systems\nat the two sites. An examination of the response of the model to changes in model\nparameters and environmental and management data showed that that silvoarable crop\nyields were most sensitive to variations in tree parameters. Increased soil depths increased\ntimber yields, and increasing stand density increased stand volume whilst decreasing\nindividual tree volume. In all the simulations, the model predicted greater efficiency in use\nof land, i.e. greater land equivalent ratios, when trees and crops were combined rather than\ngrown as sole crops. These results, supported by the sparse experimental data available,\nindicate that agroforestry provides a method of increasing food, timber and biomass\nproduction from limited land resources in Europe.\n3INTRODUCTION\nThe European Commission’s Rural Development Regulation for 2007-2013 (Commission of\nthe European Union, 2005) has introduced measures to promote agroforestry because of its\n“high ecological and social value” and because of the potential of producing high-quality\nforestry products. This is an exciting development as agroforestry systems have often been\nneglected because of the administrative separation of forestry and agriculture departments\n(McAdam et al. 2009). One form of agroforestry practice is silvoarable agroforestry where\narable crops are grown between widely-spaced trees (Burgess et al., 2004). Such arable\ncultivation is practiced at some time on about 10-16% of the 3 million ha of the dehesas of\nSpain and the montados of Portugal (Eichhorn et al., 2006). An important role of the\ncultivation is to control the invasion of shrubs which are not grazed by livestock. Silvoarable\nagroforestry integrating poplar trees with cereal crops is practiced in the Po Valley region of\nItaly, and such systems have been used in the UK (Eichhorn et al., 2006). In France, about\n2000 ha of silvoarable systems were planted in the winter of 2007-2008 and a further half a\nmillion hectares could potentially be planted. For Europe as a whole, it has been estimated\nthat approximately 56% of arable land could support silvoarable systems with about 40%\nbenefitting from improvement of an existing environmental problem (Reisner et al., 2006).\nHowever, there is limited knowledge on the productivity of these mixed tree-crop systems,\nin comparison to tree or crop monocultures, under European conditions.\nModelling can help to generate insight into the productivity of agroforestry systems, based\non robust principles governing resource acquisition and use efficiency in crop and tree\nsystems (van Ittersum & Rabbinge, 1997). To apply those principles to agroforestry\nsystems, the Yield-SAFE model (van der Werf et al., 2007) was conceptualized to provide a\nparameter sparse but ecophysiologically-based simulation model for tree and crop growth in\n4agroforestry systems. The model, which operates on a daily time-step, simulates growth and\ndry matter accumulation of trees and crops over the whole growing cycle of a tree stand.\nFor each day, the model calculates light interception by the trees and the crop, and derives\nthe potential dry matter production. The actual, water-limited, dry matter production is then\nderived by taking into account water availability for the tree and the crop, and a simple\nwater balance model. Growth and senescence of leaf cover of trees and crop is calculated at\ndaily basis, based on simulation of phenological processes, driven by temperature, and the\nassimilates available for growing leaves. The Yield-SAFE was designed to be “as simple as\npossible”. Thus, the model consists of only seven differential equations, for (1) crop leaf\narea, (2) tree leaf area, (3) crop biomass, (4) tree biomass, (5) number of tree branches; (6)\nsoil water, and (7) temperature sum. Despite the parsimonious modelling philosophy, the\nYield-SAFE model still has 22 ecophysiological parameters characterizing the plant-\nenvironment interactions, and further parameters and forcing functions representing\nmanagement. The only environmental inputs are daily mean temperature, daily incoming\nradiation, and daily precipitation. A concise description of the equations and parameters is\ngiven in van der Werf et al. (2007). This paper advances that work by aiming to demonstrate\nthe applicability of the Yield-SAFE model to: i) simulate existing systems at two contrasting\nsites and to ii) predict the responses of trees and crops in novel arable, forestry and\nagroforestry systems.\nGiven the parameter requirements of Yield-SAFE, and the scarcity of agroforestry\nexperiments in Europe, parameterisation is a non-trivial task. Here, we provide an example\nof how the model the Yield-SAFE model was parameterised in an iterative process, using\ncrop, tree, soils and climate data from two contrasting sites in Europe. One site is based in a\nrelatively cool Atlantic climate, and the other site in a Mediterranean climate where\n5radiation, temperature and drought stress levels are greater. After model parameterisation,\nand evaluation of the main model results, a sensitivity analysis was conducted to determine\nthe main factors affecting the productivity of agroforestry, compared to monocultures of\ntrees and crops.\nMETHOD\nThe broad method of demonstrating the applicability of the Yield-SAFE model can be\ndescribed as a five-stage process (Fig. 1). The first three stages were i) identifying and\ndescribing two field sites with measured data, ii) implementing the Yield-SAFE model code\ndescribed by van der Werf et al. (2007), and iii) selecting model inputs for the climate, soil,\ncrop, tree and management regime (Fig. 1) and a first estimation of model eco-physiological\nparameters based on bibliography and expert knowledge. The fourth stage comprised a\nperiod of iteration where up to three parameters were modified until the outputs of the\nmodel matched the measured outputs. These stages are described within this method\nsection. Using parameter values that resulted in modelled yields similar to the measured\nyields, the model was then used to predict the tree and crop yields for different tree densities\nand soil depths. This process is described in the results section.\nIdentification of field sites\nThe first stage was to identify two European sites where there was a series of silvoarable\ntree and crop yield data. The two sites were Vézénobres in the Languedoc-Roussillon\nregion of southern France, and Silsoe in the county of Bedfordshire in Eastern England\n(Table 1). Both are located on land that is typically used in arable production in their\nrespective areas. Although the sites were chosen because of the availability of field\nmeasurements, there were still gaps in the data. At the Vézénobres and Silsoe sites, data\nwere available for the early stage of a tree rotation, but the trees had not been harvested.\n6Because of this, some of the tree and crop data had to be derived from a synthesis of field\nmeasurements, statistical data, and expert opinion.\nVézénobres\nThe Vézénobres site in Southern France is located in a region where half the land is used for\nagriculture and half for forestry; typical agricultural crops are vines, forage crops and\ncereals. In 1996, a 1.57 ha silvoarable and forestry experiment was planted using 5 m un-\nrooted sets of poplar (Populus spp) clones I-214 and I-4551. The trial included a forestry (7\nm x 7 m spacing; 204 trees ha-1) and a silvoarable (139 trees ha-1) area. The tree rows in the\nsilvoarable area were oriented in a north-south direction with a spacing of 4.5 m x 16 m\n(including a 1-m wide tree strip). The owner of the site had leased the intercrop area of the\nsilvoarable system to a farmer, who also managed the arable control. There was an\nagreement that the owner should prune the trees so that overhanging branches would not\nimpede the movement of agricultural machinery in the intercrop area. Otherwise the\nmanagement of the forestry and arable plots was typical for forestry and arable systems in\nthe area. The trees at the site potentially have access to a high water table.\nIn Vézénobres, the height and diameter of poplar clone I-214 were recorded annually from\nplanting in 1996 to 2005. The trees in silvoarable plots were initially smaller than those in\nforestry plots, but nine years after planting they were of similar size. Expert opinion was\nused to derive estimates of the timber volumes of the silvoarable (0.98 m3 tree-1) and forestry\n(0.88 m3 tree-1) trees at a harvestable age of 15 years (Fig. 2a). The crops grown in the\nsilvoarable system were predominantly durum wheat (Triticum durum Desf.), but also\nincluded one year of asparagus and sorghum and two years of fallow. Hence a combination\nof assumed and measured yields were used to derive a yield profile of the arable crops that\ndecreased from a relative value of 90% in year 1 to 30% in year 12 (Fig. 2c), after which it\n7was assumed that no intercrop would be grown. A typical yield for durum wheat in the area\n(4.0 t ha-1) was used as a reference yield for the arable plot.\nSilsoe\nThe Silsoe site in Eastern England is located in an area dominated by cereal, oilseed rape\nand protein field crops (64% of the agricultural area); woodlands occupy only about 7% of\nthe area. The experimental silvoarable site was managed as part of the UK silvoarable\nnetwork and is fully described by Burgess et al. (2004). The silvoarable and “forestry”\ncomponents covered 2.5 ha and comprised three replicate blocks that included each\ncombination of four poplar hybrids (Beaupré, Trichobel, Gibecq, and Robusta) and one\nforestry and two silvoarable treatments. Between March and April 1992, in both the forestry\nand silvoarable treatments, poplar was planted at a spacing of 10 m x 6.4 m (156 trees ha-1)\nwith rows oriented north-south. Planting stock consisted of 1.5 - 2.0 m un-rooted sets which\nwere inserted to a depth of 0.6 m in the soil. The “intercrop” area within the “forestry”\ntreatment was kept fallow by regular cultivation, whilst the silvoarable area was cropped on\nan annual basis. Following poor crop yields in the initial three years, a wheat (Triticum\naestivum L.) crop was harvested in 1995, 1996 and 1997, followed by field beans (Vicia\nfaba L.), two more wheat crops, a bare-fallow, barley (Hordeum vulgare L.), and field\nbeans. Arable control plots, located at least 15 m from the nearest poplar, were managed in\nthe same way as the silvoarable intercrop. Yield data reported in Burgess et al. (2004) show\nthat the interference by the trees on crop growth in the arable control plots has been\nminimal.\nTree and crop measurements taken at Silsoe showed that twelve years after planting, timber\nvolume was 0.35 m3 tree-1 in the forestry plots and 0.25 m3 tree-1 in the silvoarable plots\n(Fig. 2b) (Burgess et al., 2003; 2004). The dimensions and volumes of poplar trees in the\n8forestry treatments were between those for empirical growth models of poplar for Yield\nClasses 12 and 14 (Christie, 1994). Mean timber volumes for Yield Classes 12 and 14 were\ntherefore used to predict growth beyond the period provided by field measurements to final\nharvest. This provided a reference timber volume of 2.41 m3 tree-1 in the forestry plot in\nyear 30. In the case of the silvoarable treatment, the current yield was similar to the growth\nshown for Yield Class 10. This then provided a timber volume of 1.85 m3 tree-1 in the\nsilvoarable plot in year 30. Because the timeliness of some crop management operations\nwas sub-optimal, resulting in late planting or planting into wet seedbeds, arable crop yields\nwere often below commercial levels. Therefore the yield for the intercrop was expressed as\na proportion of crop yield in the arable plot. This showed a yield decline from about 80%\nfrom years 1 to 4 to 70% between years 4 and 8, and 60% between years 9 and 12 (Fig. 2d).\nThe reference yields for control arable crops of wheat (8.23 t ha-1), barley (6.83 t ha-1) and\noilseed (3.44 t ha-1) were derived from statistical data for yields on Bedfordshire clay and\nare typical of the area (Lang, 2004).\nImplementing Yield-SAFE model code\nThe Yield-SAFE equations developed to predict crop and tree yields in arable, forestry and\nsilvoarable systems, described by van der Werf et al. (2007), were implemented in a\nMicrosoft Excel© spreadsheet platform called Plot-SAFE by Burgess et al. (2004a). The\ncore equations were implemented in a single worksheet called “Yield-SAFE”, which uses\ndefault values for the meteorological, soil, tree, and crop parameters from a second\nworksheet called “Bio-parameters”. A third worksheet called “Crop-manager” describes the\noverall system including the crop rotation and tree management. A description of Plot-\nSAFE and a user guide for this version are available from Cranfield University (Graves and\nBurgess, 2007).\n9Selection of model inputs and parameters\nThe third stage of the process was to input data relating to i) meteorology, ii) soil, iii) site\nmanagement, iv) the tree species, and v) the crop. These are described in turn.\nMeteorological data\nThe required meteorological inputs to the model were daily solar radiation, temperature, and\nrainfall. Data for Vézénobres consisted of a 12-year dataset from a local site, from January\n1996 to December 2008; the first year and the last two years of this data were repeated to\nprovide a 15 year dataset. For Silsoe, 30 years of data were developed using a weather\ngenerator, CLIGEN 5.2 (United States Department of Agriculture, 2005). The reference\nvalues (Global Data Systems, 2005) for Silsoe were generated from a weather station in\nCranfield, approximately 15 km north-west.\nThe mean annual solar radiation and mean air temperature at Vézénobres (5121 MJ m-2;\n14.4°C) were greater than at Silsoe (4356 MJ m-2; 9.1°C). The mean annual rainfall at\nVézénobres (1000 mm) was also greater than at Silsoe (611 mm). However the seasonal\ndistribution of the rainfall at Vézénobres was more uneven, with rainfall primarily occurring\nduring the winter months. The data for both sites are summarised in Table 1.\nSoil data\nThe soils were classified in terms of their texture, and their hydraulic properties were\nderived from Wösten et al. (1999). In Vézénobres, the soil was medium-textured and\nbecause of the presence of a relatively high water table, the effective soil depth in terms of\nthe model was assumed to be 2.0 m (Table 2). The effect of assuming a large soil depth was\nto increase the amount of soil water available to the trees and the crop. In Silsoe, the soil\nwas clay (Burgess et al. 2004) and classified as “fine-textured” with a depth of 1.5 m.\n10\nManagement parameters\nThe management parameters within the Yield-SAFE model relate to the initial tree stand\ndensity, and the management of the trees and the crops (Tables 1, 3 and 4). The crop\nmanagement parameters comprised the choice of crop (Table 1) and the date of sowing\n(Table 4). The management parameters for the forestry systems were selected to be as close\nas possible to actual practice as determined during field visits and discussions with farmers\nat each site. At Vézénobres and Silsoe, the forestry systems were planted at 204 and 156\npoplar trees ha-1 respectively.\nThe management parameters related to the trees include the timing and extent of pruning\n(Table 3). In many agroforestry systems, side branches arising from the main stem below a\ncertain height (the bole height) are pruned in order to maximise the volume of knot-free\ntimber. At each site, it was assumed that pruning took placed in increments of 1.0-1.5 m,\nensuring that the bole height was never more than 50-60% of the tree height, up to a\nmaximum height of 7-8 m (Table 3). The proportion of the shoots (s) pruned on each\noccasion were also assumed.\nThe silvoarable systems were parameterised so that they integrated the tree species of the\nforestry system with the crop species and rotation of the arable system. In Vézénobres and\nSilsoe, the trees were arranged in rows, and the intercrop area was calculated by subtracting\na 2-m wide strip of aggregate tree row length in each system from the total area of the\nsystem. In Vézénobres, these dimensions resulted in an intercrop area of 87.5% (16-m row\nwidth) and in Silsoe 80% (10-m row width).\n11\nTree and crop parameters\nThe parameters used to describe growth of different tree and crop species in Yield-SAFE\nwere determined from published material and the calibration of the model for “potential”\ntree and crop yields (Van Ittersum and Rabbinge, 1997). An initial calibration of Yield-\nSAFE for “potential” monoculture yields was undertaken against datasets of timber volume\nand crop yields under high yielding conditions in Atlantic and Mediterranean zones,\nassuming that light and temperature but not water, limited growth within the model. The\ntree parameters included initial values for the number of shoots per tree, biomass, and leaf\narea, and fixed values for radiation use efficiency, light extinction coefficient, and the\nrelative attrition rate of tree biomass (Table 3). The crop parameters included initial values\nfor leaf area and above-ground dry mass, and fixed values for radiation use efficiency, light\nextinction coefficient, specific leaf area, base temperatures and thermal time requirements\n(Table 4).\nCalibration of model by modification of three parameters\nThe fourth step in using the model was to adjust the value of no more than three parameters\nto improve the agreement between the model outputs and the available data. The three\nparameters that could be altered were the transpiration coefficient (the amount of water\ntranspired per unit of above-ground (crop) or woody (tree) biomass), the harvest index, and\na management factor (Table 5). The default value for the transpiration coefficient (0.28-\n0.65 m3 kg-1) varied with crop species (C3 v C4 plants) and the humidity of the agro-\necological zone (humid Atlantic zone v dry Mediterranean zone). Within the calibration\nexercise, the values for transpiration for an individual species were allowed to vary within\nthis range. The default value for the harvest index for the tree (proportion of above ground\nbiomass allocated to timber) was 0.5. Lastly a management factor (range: 50 to 100%),\nwhich was assumed to act directly on the radiation use efficiency could also be altered. The\n12\nfinal values used were considered to be within acceptable physiological boundaries (Graves,\n2005). This iterative process ensured that the mean modelled yield of the monoculture\narable crops matched the reference value for those crops, and the modelled monoculture tree\nyield matched the reference tree yield at final harvest.\nModel predictions and sensitivity analysis\nOnce calibrated, simulations were undertaken to determine the sensitivity of the modelled\ntree biomass to changes in management, such as tree spacing, and environmental conditions,\nsuch as soil depth. The densities examined varied from 50 to 1000 trees ha-1 for both the\nforestry and silvoarable systems, and the three soil depths examined were 0.5, 1.5, and 2.5\nm. In order to simplify the analysis of the results, no thinning or pruning was assumed in\nthe sensitivity analysis.\nIt has been common practice in agroforestry and intercropping studies to consider yield\nbenefits in terms of the land equivalent ratio (LER) (Mead and Willey, 1980; Ong, 1996;\nDupraz, 1998). The LER is typically defined as “the ratio of the area under sole cropping to\nthe area under the agroforestry system, at the same level of management that gives an equal\namount of yield” (Ong, 1996) and can be used as a measure of the relative benefit of\ncalculated using:\nLER = ்௥௘௘\u0003௦௜௟௩௢௔௥௔௕௟௘\u0003௬௜௘௟ௗ\n்௥௘௘\u0003௠ ௢௡௢௖௨௟௧௨௥௘\u0003௬௜௘௟ௗ\n+ ஼௥௢௣\u0003௦௜௟௩௢௔௥௔௕௟௘\u0003௬௜௘௟ௗ\n஼௥௢௣\u0003௠ ௢௡௢௖௨௟௧௨௥௘\u0003௬௜௘௟ௗ\nEquation 1\nA second set of simulations was undertaken for a sensitivity analysis, to investigate which\nparameters dominated LER. To do this, the parameter values were altered by plus and\n13\nminus 10% of their nominal values and the resulting tree and crop yield stored. Having\ncalculated the LER, the sensitivity was calculated using:\nΔ௬\nΔ௣௜\n= ௬(௣௜ାο௣௜)ି௬ሺ௣௜ି ο௣௜ሻ\nଶο௣௜\nEquation 2\nwhere ݕ(݌݅൅ ο݌ )݅\u0003ܽ݊݀\u0003ݕሺ݌݅െ ο݌ ሻ݅y was the model output (e.g. LER) when only the ith\nparameter was changed by amount ∆_pi whist the other parameters were kept at their\nnominal values. To avoid scale effects, the relative sensitivity or elasticity (eLER) of LER for\na specific parameter pi using with nominal values ݌ଓഥ and LERതതതതതത was calculated using:\n୐݁୉ୖ = ο୐୉ୖο௣௜ ௣పതതത୐୉ୖതതതതതത Equation 3\nThe systems assumed for the sensitivity analysis were identical to those developed for\nVezenobres and Silsoe, except that continuous wheat was assumed for the duration of the\nrotations.\nRESULTS\nModel outputs\nBecause the yield of the monoculture arable crop was calibrated to the reference value, the\nmean values for the crop yields matched the assumed reference values. However the annual\nvariation in the weather data resulted in substantial variation in the predicted annual yields.\nBecause the relative inter-annual variation in rainfall was greater than that for temperature\nand solar radiation, the yields at Silsoe were more closely correlated with the rainfall during\nthe cropping season (Fig. 3) than levels of solar radiation or temperature. By contrast,\n14\narable crop yields at Vézénobres (data not shown) did not show this response, possibly\nbecause of the larger soil depth assumed and the greater autumn and winter rainfall.\nTree yields in a monoculture\nAs described previously, the tree models were calibrated so that the forestry monoculture\ngave the same final yield as the measured timber yields, e.g. 0.88 m3 tree-1 at 204 trees ha-1\nat 15 years after planting at Vézénobre, and 2.41 m3 tree-1 at 156 trees ha-1 at 30 years after\nplanting at Silsoe. The results for Vézénobres showed that the Yield-SAFE model predicted\nlower annual timber increments than those measured during initial growth, before\nconverging on the measured value in the final year of the tree rotation in year 15 (Fig. 4a);\nby contrast the predicted and reference results for the forestry system at Silsoe were more\nclosely matched (Fig. 4d). The under-prediction of timber volumes in the initial period of\ntree growth is probably a result of constraints within the Michaelis-Menten function.\nCrop and tree yields in silvoarable systems\nFollowing calibration for the monoculture system, the Yield-SAFE model was used to\ndescribe the annual change in tree and crop yields within the experimental agroforestry\nsystems at Vézénobres (139 trees ha-1) and Silsoe (156 trees ha-1). At both sites, the model\npredicted a decline in relative crop yields that was similar to the experimental data (Fig. 4c\nand f). The decline in crop yields was relatively fast because the fast growth of the poplars\nmeant that they intercepted a major proportion of the incoming light early in the tree\nrotation.\nAt Vézénobres the tree yields in the agroforestry system showed a similar pattern to the\nexperimental data in that the timber volume per tree in the silvoarable system eventually\nexceeded that of the forestry trees (Fig. 4b). One reason for this is that the silvoarable trees\nwere planted at a lower density than the forestry trees and were eventually able to intercept\n15\nmore light on a per tree basis. The final yield from the Yield-SAFE prediction (0.99 m3 tree-\n1) also closely matched that assumed for the silvoarable treatment (0.98 m3 tree-1). By\ncontrast, at Silsoe, the timber volumes in the silvoarable system (Fig. 4e) remained below\nthose in the forestry system, even though the tree densities were the same in both systems,\nbecause the yield in the agroforestry system was reduced by crop competition for water\n(Burgess et al. 2004). This reflected the measured data, and based on these measured data,\nthe assumed yield pattern for the silvoarable treatment, which was also less than that for the\nforestry treatment. Although the final Yield-SAFE prediction for the silvoarable system\n(2.20 m3 tree-1) was greater than that for the assumed response of the silvoarable treatment\n(1.85 m3 tree-1) which is based on an empirical poplar growth model of Yield Class 10 (Fig.\n4e), it is worth noting that this assumed silvoarable response is based on the early growth of\nthe trees, and is also uncertain. For example, it is possible that as the silvoarable trees\nbecome larger and rooting depth increases, the effect of crop competition for water may be\nreduced, so that the silvoarable tree growth then exceeds the currently assumed response.\nThis would prompt the need to increase the assumed Yield Class for the silvoarable\ntreatment, which would more closely match the Yield-SAFE prediction.\nModel predictions\nOnce it was clear that the Yield-SAFE model was capable of producing credible\nsimulations, the model was used to predict the responses of tree and crop yields to different\ntree densities and rooting depths.\nResponse to tree density\nWhen the water component of the Yield-SAFE model was turned off, the predicted tree\nvolumes from a forestry and silvoarable treatment at the same tree density resulted in the\n16\nsame tree yield (Fig 5 a,b,d,e). This would be expected as the model assumes that the only\neffect of the understorey crop on tree yield is to alter the available water in the soil. As\nwould be expected the volume of an individual tree decreased as the tree density increased,\nand the stand volume reached a plateau at high tree densities.\nWhen the water component of the Yield-SAFE model was turned on and assuming a soil\ndepth of 1.5 m, the model predicted substantial reductions in the tree and stand volumes for\nboth the forestry and agroforestry treatments. Both Vézénobres and Silsoe are in areas of\nrelatively low rainfall, and drought stress is known to constrain tree growth at both sites.\nThe predicted tree volumes for a given density was less for the agroforestry than the forestry\nsystem because of the competition from the understorey crop for water.\nThe relative tree yield reduction due to drought stress (assuming a soil depth of 1.5 m) was\ngreater at the Vézénobres site (15 year rotation), than at Silsoe (30 year rotation). The\nincreased sensitivity of the trees at the Vézénobres site could be a result of the period of tree\nestablishment (when a tree crop is particularly sensitive to water competition) forming a\nproportionately greater part of the tree rotation. It could also be a result of the lack of\nsummer rainfall in Southern France when competition for water by the crops and the trees is\nmost acute.\nThe mean relative crop yield over the length of the tree rotation declined with tree density\n(Figure 5c and 5f) because of the reduced planting area, and light and water competition. At\nboth sites, when the water component of the Yield-SAFE model was turned on, the relative\nyield of the crop component was greater than that when the water component was turned-\n17\noff. This is because under the water-limiting conditions, tree growth is reduced (Figures 5\na,b,d,e) and hence there is greater resource availability for the understorey crop.\nResponse to soil depth\nAs would be expected, the Yield-SAFE model showed that trees and stand volume for a\ngiven stand density decreased as the soil depth became more shallow (Fig 6 a,b,d,e). The\ntrees at Vézénobres were more sensitive to soil depth than those at Silsoe, probably because\nof the greater importance of the soil being able to store winter rainfall into the summer.\nThe crop yields within the agroforestry system were also sensitive to the soil depth (Fig 6c\nand 6d). However the effect of soil depth became less critical as the tree density increased.\nIt is assumed that this was because the additional water available in a deeper soil was\nincreasingly used by the tree component of the system.\nRelationship between tree yields and crop yields\nThe model was also used to determine the relationship between mean tree yields, crop\nyields, and soil depth. For both sites, the relationship between tree yield and crop yield was\ncurvilinear (Fig 7) because the capture of solar radiation and water increased from\nintegrating tree and crop production. Increasing the soil depth also increased the production\nboundary for each system, as this also allowed the trees and crops to capture more water.\nAs described earlier, the sensitivity of tree and crop production to soil depth seemed to be\ngreater at Vézénobres than at Silsoe. The curves also indicate that the greatest improvement\nin resource use by integrating tree and crop production tends to occur within the forestry\nsystem, probably because a crop can most effectively increase resource capture in the initial\nyears of a forestry rotation before a full tree canopy is achieved. By contrast within the crop\ndominated systems, adding an additional tree tends to lead to an equivalent linear loss in\ncrop yield.\n18\nSensitivity analysis\nThe sensitivity analysis showed that the absolute value of most parameter sensitivities was\nless than 0.05 indicating relatively small effects on the LER of the silvoarable systems\n(Table 6). Of those dominant parameters showing sensitivities larger than 0.05, most were\ntree parameters (i.e. the light extinction coefficient (kt), the light use efficiency of the tree\n(t), the initial number of shoots per tree (Nt)o, the maximum leaf area per shoot (Am), and\nthe critical value at which transpiration starts to be reduced (pFcrit)t), whilst only one (the\nlight use efficiency (c)), was associated with crop and only for Silsoe.\nDISCUSSION\nAs noted previously, this paper aims to demonstrate the applicability of the Yield-SAFE\nmodel to: i) describe existing systems at two contrasting sites and to ii) predict the responses\nof trees and crops in novel arable, forestry and agroforestry systems. These are discussed\nbelow.\nApplicability of the model to describe existing systems\nA key concept behind the Yield-SAFE model was to minimise the number of modelled\nparameters, whilst being able to model tree and crop growth within arable, forestry and\nagroforestry systems. The parameterisation and calibration process comprised of two\nphases: parameterisation of the monoculture forestry and arable systems for “potential” tree\nand crop yields in the absence of drought stress, and then calibration for “actual”\nmonoculture tree and crop systems assuming potential water constraints.\nThrough the calibration process, the mean “actual” yield of the modelled monoculture crop\nwas fixed to equal a measured or reference yield at each site. However inter-annual\n19\nvariability of the climate meant that the actual yield in a particular year varied around that\nmean. At Silsoe, where the assumed soil depth was 1.5 m, the modelled crop yield was\nclosely linked to the seasonal rainfall (Fig 3). Because the inter-annual variation in solar\nradiation and thermal time was relatively small, the inter-annual variation in crop yields due\nto radiation and temperature were also relatively small.\nAfter appropriate calibration of the monoculture situation, the Yield-SAFE model gave\ndescriptions of the growth and yield of trees and crops in the silvoarable systems that were\nsimilar to those measured at the two contrasting sites (Figs. 4a,b,d, and e). At each site the\nmodel predicted that crop yields steadily reduced as the trees grew and captured greater\namounts of solar radiation and available water in the soil. Increasing tree densities in the\nsilvoarable systems increased the capture of light and water by trees, to the detriment of the\ncrop. These observations indicate that Yield-SAFE can provide credible estimates of the\nbiomass yields and partitioning between crops and trees in silvoarable systems in a range of\nclimate and soil conditions, and for a range of tree and crop species. The Yield-SAFE\nmodel was also able to predict long-term changes between the relative growth of trees in\nforestry and agroforestry systems at both sites. Thus, the growth per tree in the silvoarable\nsystem at Vézénobres (0.99 m3 tree-1 at 139 trees ha-1) eventually exceeded that in the\nforestry system (0.88 m3 tree-1 at 204 trees ha-1) (Figs. 4a and b), whilst in contrast at Silsoe,\nthe growth in the silvoarable systems (2.20 m3 tree-1 at 156 trees ha-1) was lower than that in\nthe forestry system (2.43 m3 tree-1 at 156 trees ha-1) (Figs. 4d and e).\nResponses to tree planting density\nThe Yield-SAFE model predicted that timber production per hectare increased as tree\ndensity increased, and that timber production per tree decreased as tree density increased\nbecause the available solar radiation and water resources were partitioned amongst fewer\n20\ntrees. This can have beneficial economic impacts, as in many countries, the value of timber\nof equivalent volume increases as tree size increases. Unfortunately the authors have been\nunable to find published data describing the relative growth of poplar trees at very low and\nhigh tree densities which would indicate if the increased timber volumes predicted by Yield-\nSAFE at low densities are “reasonable”. Therefore one recommendation is the need for\nfurther literature searching and\/or experimental work to determine the growth of freely-\ngrown trees of species commonly grown in forestry and agroforestry systems.\nThe model was also used to predict the tree yield and crop yield profiles for different tree\ndensities. Such an analysis can be useful in comparing the effect of tree density on\nprofitability and feasibility (Graves et al. 2007), or selected environmental impacts (Palma et\nal., 2007a).\nRelationship between tree and crop yields\nIn each of the silvoarable systems, tree and crop yields were individually lower on a per\nhectare system basis than the crop yields in the arable system and the tree yields in forestry\n(Fig. 6). However the combined levels of production, for example in terms of biomass\nproduction, were higher when the trees and crops were grown together rather than as\nseparate systems (Fig. 7).\nAs noted previously, it has been common practice in agroforestry and intercropping studies\nto consider the land equivalent ratio (LER) (Mead and Willey, 1980; Ong, 1996; Dupraz,\n1998). In practice the calculated ratio is heavily influenced by the assumed sole-cropping\nregime. If the sole-cropping regime is sub-optimal for maximising the yield component\nbeing considered, then it can artificially inflate the LER of the agroforestry system. The\nability to investigate a range of tree densities using a model means that it can be possible to\n21\nidentify higher tree density “control” treatments for the calculation of the denominator for\nthe tree component of the LER, compared to the data available experimentally. Hence the\nmaximum LER ratio suggested by Figure 7 of about 1.12 is less than that previously\nsuggested for the poplar-arable cropping system of 1.22-1.45 by Graves et al. (2007).\nSensitivity analysis\nMost of the dominant tree parameters (i.e. kt, t, (Nt)o, Am) had negative normalized\nsensitivities in that an increase of the parameter value would lead to a decrease in the LER.\nThus, although tree growth increased for larger values of these tree parameters, the negative\neffect on the crop as a result of increased shading by the tree caused an overall reduction in\nLER. However, (pFcrit)t, which is a measure of the critical soil water potential at which the\ntree starts to experience drought stress, showed a positive sensitivity. This means that the\neffect of an increase of (pFcrit)t on increased tree growth was greater than the negative effect\non crop growth, therefore increasing the LER of the silvoarable system.\nIn the case of the dominant crop parameter, an increase in the light use efficiency of the crop\n(c) led to an increase in the crop yield. However, because this increased competition for\nwater, the reduction in the tree yield was greater than the increase in crop yield, thus\nresulting in a negative sensitivity result, meaning that LER was reduced. This effect was\nonly dominant in Vézénobres, where the overall LER was also significantly higher than in\nSilsoe.\nThe sensitivity results for the dominant tree parameters appear to be consistent with field\nexperience in silvoarable systems, in that crop yields are reduced as the trees capture more\nresources that would otherwise be available to the crop. The principal exception is the result\nfor (pFcrit)t, where an increased capacity of the tree to extract water from a dry soil increased\n22\nLER, because the tree was utilizing water unavailable to the crop. At present the Yield-\nSAFE model does not consider the root zone in two layers, i.e. a crop and tree root zone and\na tree only zone. In future versions of the model, it would be good to include this effect to\nbetter simulate the effects on LER for crop species with differing relative root depths. Some\ncrops are likely to be less complementary than others.\nCONCLUSIONS\nThis paper describes the implementation of a biophysical tree and crop model, including the\nselection and measurement of sites to calibrate the model, the process of obtaining the input\ndata for the model, and the validation of the model. Only after the results from the model\nwere found to be credible, was the model used to predict the effect of different tree planting\ndensities on tree and crop yields, and lastly to provide predictions of the land equivalent\nratio.\nAgroforestry systems are an alternative method for increasing tree cover whilst maintaining\ncrop yields. In France and England they may provide a means of establishing trees where\nthey are scarce. However, since experimental data on silvoarable systems are rare in\nEurope, computer simulations are needed to provide an estimate of tree and crop yields in\nmixed systems. Once calibrated against reference arable and forestry yields for each site,\nYield-SAFE provided reasonable predictions of tree and crop yields in silvoarable systems\nin accordance with expert opinion and field measurements at sites in France and the UK.\nThe predicted LERs for modelled silvoarable systems were lower than LERs reported for\nfield experiments because of the capacity to consider a greater range of tree densities for the\nmonoculture tree system. However the calculated LERs are still greater than one and they\nshow that more harvestable biomass could be produced by combining trees and crops on the\n23\nsame area of land rather than growing them separately. When used in the way described\nhere, Yield-SAFE is able to provide useful predictions of yields in silvoarable systems,\nrelative to arable and forestry systems, throughout Europe. The model-based approach\npresented in this paper could potentially be used to help illuminate current debates on how\nland should be used to meet competing demands for fuel, food, and fibre.\nACKNOWLEDGEMENTS\nThis research was carried out as part of the SAFE (Silvoarable Agroforestry for Europe)\ncollaborative research project. SAFE was funded by the EU under its Quality of Life\nprogramme, contract number QLF5-CT-2001-00560, and the support is gratefully\nacknowledged. We would also like to that the reviewers for their comments and feedback\non this paper since this has allowed us to greatly improve its quality.\nREFERENCES\nBurgess, P.J., Incoll, L.D., Hart, B.J., Beaton, A., Piper, R.W., Seymour, I., Reynolds, F.H.,\nWright, C., Pilbeam D., Graves, A.R., 2003. The Impact of Silvoarable Agroforestry\nwith Poplar on Farm Profitability and Biological Diversity. Final Report to DEFRA.\nProject Code: AF0105. Silsoe, Bedfordshire: Cranfield University, 63 pp.\nBurgess. P.J., Incoll, L.D., Corry, D.T., Beaton, A., Hart, B.J., 2004. Poplar (Populus spp)\ngrowth and crop yields in a silvoarable experiment at three lowland sites in England.\nAgroforestry Systems 63: 157-169.\nBurgess, P.J., Graves, A.R., Metselaar, K., Stappers, R., Keesman, K., Palma, J, Mayus, M.,\nvan der Werf, W., 2004a. Description of the Plot-SAFE Version 0.3. Unpublished\ndocument, 15 September 2004. Silsoe, Bedfordshire: Cranfield University, 52 pp.\nAvailable http:\/\/montpellier.inra.fr\/safe\/. (May 5 2005)\nChristie, J.M. (1994). Provisional Yield Tables for Poplar in Britain. Forestry Commission\nTechnical paper 6. Edinburgh: Forestry Commission, 35 pp.\nCommission of the European Union (2005). Council Regulation (EC) No 1698\/2005 on\nsupport for rural development by the European Agricultural Fund for Rural\nDevelopment (EAFRD): OJ L 277, 21.10.2005; Bull. 9-2005. Brussels, Belgium, 40\npp.\n24\nCorlett, J.E., Black, C.R., Ong, C.K., Monteith, J.L., 1992. Microclimate modification in a\nleucaena\/millet alley cropping system II. Light interception and dry matter\nproduction. Agricultural and Forest Meteorology 60, 73-91.\nDupraz, C., 1998. Adequate design of control treatments in long term agroforestry\nexperiments with multiple objectives. Agroforestry Systems 43, 35-48.\nDupraz, C, Burgess, P.J., Gavaland, A., Graves, A.R., Herzog, F., Incoll, L.D., Jackson, N.,\nKeesman, K., Lawson, G., Lecomte, I., Mantzanas, K., Mayus, M., Palma, J.,\nPapanastasis, V., Paris, P., Pilbeam, D.J., Reisner, Y., van Noordwijk, M., Vincent,\nG. van der Werf, W., 2005. SAFE (Silvoarable Agroforestry for Europe) Synthesis\nReport. SAFE Project (August 2001-January 2005).\nGlobal Data Systems, 2005. Database of historical climate data compiled by Global Data\nSystems for the United States Department of Agriculture World Weather Board from\nWorld Meteorological Organisation climate reporting systems. Available\nhttp:\/\/hydrolab.arsusda.gov\/nicks\/nicks.htm. (May 5 2005).\nGraves, A.R., 2005. Bio-economic evaluation of agroforestry systems for Europe.\nUnpublished PhD thesis. Cranfield University, Bedfordshire, UK 254 pp.\nGraves, A.R., Burgess, P.J., 2007. PlotSAFE. Available:\nhttp:\/\/www.cranfield.ac.uk\/sas\/naturalresources\/research\/projects\/plotsafe.jsp\n(February 28 2008).\nGraves, A.R., Burgess, P.J., Liagre, F., Pisanelli, A., Paris, P., Moreno, G.M., Bellido, M.,\nMayus, M., Postma, M., Schlindler, B., Mantzanas, K., Papanastasis, V.P. Dupraz,\nC., 2008. Farmer perceptions of silvoarable systems in seven European countries.\nIn: Advances in Agroforestry Vol 6: Current Status and Future Prospects. Eds. A.\nRigueiro-Rodríguez, J.H. McAdam, and M.R, Mosquera-Losada. Springer.\nGraves, A.R., Burgess, P.J., Liagre, F., Terreaux, J.P., Dupraz, C., 2005. Development and\nuse of a framework for characterising computer models of silvoarable economics.\nAgroforestry Systems 65, 53-65.\nGraves, A.R., Burgess, P.J., Palma, J.H.N., Herzog, F., Moreno, G., Bertomeu, M., Dupraz,\nC., Liagre, F., Keesman, K., van der Werf, W., Koeffeman de Nooy, A., van den\nBriel, J.P., 2005. Development and application of bio-economic modelling to\ncompare silvoarable, arable and forestry systems in three European countries.\nEcological Engineering 29, 434-449.\nEichhorn, M.P., Paris, P., Herzog, F., Incoll, L.D., Liagre, F., Mantzanas, K., Mayus, M.,\nMoreno, G., Papanastis, V.P., Pilbeam, D.J., Pisanelli, A, Dupraz, C. 2006.\nSilvoarable systems in Europe – past, present and future prospects. Agroforestry\nSystems 67, 29-50.\nKeesman, K.J., van der Werf, W., van Keulen, H. 2007. Production ecology of agroforestry\nsystems: a minimal mechanistic model and analytical derivation of the land\nequivalent ratio. Mathematical Biosciences 209, 608-623.\nLang, B., 2004. Report on farming in the Eastern Counties of England 2003\/2004, 139 pp.\nCambridge University, Cambridge, United Kingdom.\nLeiva, M.J., Fernández-Alés, R., 2003. Post-dispersive losses of acorns from Mediterranean\nsavannah-like forests and shrublands. Forest Ecology and Management 176, 265-\n271.\n25\nMcAdam, J.H., Burgess, P.J., Graves, A.R., Rigueiro-Rodríguez, A. & Mosquera-Losada,\nM.R., 2009. Classifications and functions of agroforestry systems in Europe. In :\nAgroforestry in Europe : Current Status and Future Prospects 21-41. (Eds. A.\nRigueiro-Rodríguez, J. McAdam & M.R. Mosquera-Losada. Springer.\nMead, R., Willey, R.W., 1980. The concept of a “Land Equivalent Ratio” and advantages in\nyields from intercropping. Experimental Agriculture 16, 217-228.\nMontero, G., San Miguel, A., Cañella, I., 2000. Systems of Mediterranean Agriculture: the\ndehesa, 48pp. Departmento Selvicultura, CIFOR-INIA, Madrid, Spain.\nMulia, R., Dupraz, C., 2006. Unusual fine root distributions of two deciduous tree species in\nsouthern France: what consequences for modelling of tree root dynamics? Plant and\nSoil 281, 71-85.\nPalma, J.H.N., Graves, A.R., Bunce, R.G.H., Burgess, P.J., de Filippi, F., Keesman, K.J.,\nvan Keulen, H., Liagre, F., Mayus, M., Moreno, G., Reisner, Y. & Herzog, H.,\n2007a. Modeling environmental benefits of silvoarable agroforestry in Europe.\nAgriculture, Ecosystems and Environment 119, 320-334.\nPalma, J.H.N., Graves, A.R., Burgess, P.J., Keesman, K.J., van Keulen, H., Mayus, M.,\nReisner, Y., Herzog, F., 2007b. Methodological approach for the assessment of\nenvironment effects of agroforestry at the landscape scale. Ecological Engineering\n29, 450-462.\nOng, C.K., 1996. A framework for quantifying the various effects of tree-crop interactions.\nIn: Ong, C.K. and Huxley, P. (eds.), Tree-Crop Interactions A Physiological\nApproach, pp. 1-23. Wallingford, Oxford: CAB International.\nReisner, Y, de Filippia, R., Herzog, F., Palma, F. (2007). Target regions for silvoarable\nagroforestry in Europe. Ecological Engineering 29, 4, 401-418\nShakesby, R.A., Coelho, C.O.A., Schnabel, S., Keizer, J.J., Clarke, M.A., Lavado-Contador,\nJ.F., Walsh, R.P.D., Ferreira, A.J.D., Doerr, S.H., 2002. A ranking methodology for\nassessing relative erosion risk and its application to dehesas and montados in Spain\nand Portugal. Land Degradation and Development 13, 129-140.\nUnited States Department of Agriculture (2005). CLIGEN Weather Generator. United\nStates Department of Agriculture Agricultural Research Service and United States\nForest Service. Available: http:\/\/topsoil.nserl.purdue.edu\/nserlweb\/weppmain\/cligen\/\n(February 28 2008)\nVan der Werf, W., Keesman, K., Burgess, P.J., Graves, A.R., Pilbeam, D., Incoll, L.D.,\nMetselaar, K., Mayus, M., Stappers, R.,van Keulen, H., Palma, J., Dupraz, C., 2007.\nYield-SAFE: a parameter-sparse process-based dynamic model for predicting\nresource capture, growth and production in agroforestry systems. Ecological\nEngineering 29, 419-433.\nVan Ittersum, M.K., Rabbinge, R., 1997. Concepts in production ecology for analysis and\nquantification of agricultural input-output combinations. Field Crops Research 52,\n197-208.\nWösten, J.H.M., Lilly, A., Nemes, A., Le Bas, C. 1999. Development and use of a database\nof hydraulic properties of European soils. Geoderma 90, 169-185.\n26\nTable 1. Location and description of the trees in the forestry and agroforestry system at\nVézénobres and Silsoe. The actual and assumed cropping systems are indicated.\nVézénobres, France Silsoe, UK\nLatitude; longitude 44º3’ N; 4º8’ E 52°0’ N; 0°26’ W\nAltitude (m) 103 50\nTrees planted 1996 1992\nMeteorological conditions\nMean annual solar radiation (MJ m-2) 5121 4356\nMean annual temperature (oC) 14.4 9.1\nMean annual rainfall (mm) 1000 611\nForestry system\nComponents Widely-spaced poplar\n(Populus spp.) with\ncultivated but uncropped\nalleys\nWidely-spaced poplar\n(Populus spp.) with\ncultivated but uncropped\nalleys\nTree row orientation North-South North-South\nArea (ha) 0.42 0.84\nTree spacing (m) 7 x 7 10 x 6.4\nTree density (ha-1) 204 156\nSilvoarable system\nComponents Widely-spaced poplar\nhybrids with cultivated\ncropped alleys\nWidely-spaced poplar\nhybrids with cultivated\ncropped alleys\nTree row orientation North-South North-South\nArea (ha) 1.15 1.69\nTree spacing (m) 16 x 4.5 10 x 6.4\nTree density (ha-1) 139 156\nTree strip width (m) 1 2\nArable system\nActual crop species and rotation Durum wheat, asparagus,\nsorghum and fallow\nCereals\nand break crops\nModelled crop species and rotation Autumn-sown continuous\ndurum wheat\nAutumn-sown: wheat,\nwheat, barley, oilseed rape\n27\nTable 2. Soil parameters assumed for the two sites.\nParameter Symbol Unit Vézénobres Silsoe\nSoil type Medium Fine\nInitial water content o mm mm\n-1 0.552 0.552\nSaturation water content s mm mm\n-1 0.439 0.520\nResidual water content r mm mm\n-1 0.010 0.010\nDepth of soil D m 4.0 1.5\nWater tension at field capacity pFFC log(cm) 2.3 2.3\nCritical pF value for evaporation (pFcrit)E log(cm) 2.3 2.3\npF where soil evaporation = 0 (pF)E=0 log(cm) 4.2 4.2\nVan Genuchten parameter  cm-1 0.0314 0.0367\nVan Genuchten parameter n 1.1804 1.1012\nParameter affecting drainage rate below root zone  0.07 0.07\nSoil hydraulic conductivity at saturation KS mm d-1 12.1 24.8\nPotential evaporation per unit energy eva mm MJ\n-1 0.15 0.15\n28\nTable 3. Tree parameters used in the Yield-SAFE model for poplar in Vezenobre and\nSilsoe, a Mediterranean and Atlantic climate respectively\nParameter Symbol Vézénobres Silsoe\nTree management\nTree species Poplar Poplar\nDay of year for planting tplant DOY 2 2\nDay of year for pruning tprune DOY 350 350\nPruning height increment hprune M 1.5 1.5\nProportion of shoots removed per prune s 0.2 0.1\nMaximum bole height\/tree height (Hbole\/H)m 0.5 0.5\nMaximum bole height (Hbole)m M 8 8\nInitial conditions\nNumber of shoots per tree (Nt)o tree-1 1.7938 0.6225\nBiomass of tree (Bt)o g tree-1 100 100\nBole height (Hbole)o M 0 0\nLeaf area of tree (LAt)o m2 tree-1 0 0\nParameters\nRadiation use efficiency t g MJ\n-1 1.1900 1.4086\nLight extinction coefficient kt 0.8 0.8\nMaximum leaf area of single shoot Am m2 0.025 0.05\nTime constant of leaf area growth of shoot t D 10 10\nRelative attrition rate of tree biomass a d-1 0.0001 0.0001\nDay of year for bud burst tbudburst DOY 100 100\nDay of year for leaf fall tleaffall DOY 300 300\nExponent relating tree diameter to height q 1 1\nForm factor F 0.367 0.367\nMaximum number of shoots per tree Nm tree-1 10000 10000\nDensity of dry timber timber g m\n-3 410000 410000\nRatio of tree height to tree diameter height 68.556 68.556\nRatio of canopy width to depth canopy 0.6 0.6\nCritical pF value (pFcrit)t log(cm) 4.0 4.0\npF value at permanent wilting point (pFpwp)t log(cm) 4.2 4.2\nNote: In the default calibrations, the value of s was fixed to 0.\n29\nTable 4. Crop parameters used in the Yield-SAFE model.\nSpecies\nWheat, durum\nwheat and oats\nOilseed\nrape\nManagement\nDay of sowing ts DOY -45 -116\nDay of harvest (if Sh not reached) th DOY 300 225\nInitial conditions\nAbove-ground dry mass (Bc)o g m-2 10 10\nLeaf area of crop (Lc)o m2 m-2 0.1 0.1\nPartioning factor to leaves (l)o 0.8 0.8\nParameters\nRadiation use efficiency of the crop c g MJ\n-1 1.34 0.8\nLight extinction coefficient kc 0.7 0.7\nCritical pF value for transpiration (pFcrit)c log(cm) 2.9 2.9\npF value when transpiration = 0 (pFpwp)c log(cm) 4.2 4.2\nSpecific leaf area  m2 g-1 0.005 0.02\nHeat sum at harvest Sh °Cd 1312 2000\nBase temperature Tb °C 5 5\nHeat sum at emergence Semerge °Cd 57 79\nHeat sum when partitioning leaves\nstarts to decrease\nS1 °Cd 456 500\nHeat sum when partitioning to leaves\nceases\nS2 °Cd 464 1300\nBarley was assumed to have the same parameters as wheat, except the DOYsowing was -60.\n30\nTable 5. Reference calibrations and assumed values for the transpiration coefficient, harvest\nindex and the management factor for a) tree species and b) crop species at the three sites.\na) Tree parameters Symbol Unit Vézénobres Silsoe\nTree species Poplar Poplar\nTime of clear fell year 15 30\nReference yield m3 tree-1 0.88 2.41\nTranspiration coefficient t m\n3 kg-1 0.440 0.280\nHarvest index HI % 54 43\nManagement factor M % 100 100\nb) Crop parameter Unit Vézénobres Silsoe\nCrop species Wheat Wheat Barley Oilseed\nrape\nReference crop yield ts t ha-1 4.00 8.23 6.83 3.44\nTranspiration coefficient c m\n3 kg-1 0.440 0.300 0.318 0.420\nHarvest index HI % 42 57 46 29\nManagement factor M % 76 100 100 51\n31\nTable 6. Tree and crop yields and the land equivalent ratios (LER) for silvoarable systems\nin Vezenobres and Silsoe with a ± 10% change in the nominal value of selected parameters\nNominal\ntree\nparameters\nMonoculture Silvoarable LER Elasticity:(∆ࡸࡱࡾ\nࡸࡱࡾ\n)\/(∆࢖࢏\n࢖࢏\n)tree yield(m3 ha-1) cropyield\n(t ha-\n1)\ntree yield\n(m3 ha-1)\ncrop yield\n(t ha-1)\nVézénobres Base\nscenario\n180 60 137 37 1.37\nTree parameters kt\n0.8 155 60 116 39 1.39 -0.12\n198 60 155 35 1.35\nt\n1.1877 162 60 122 38 1.39 -0.11\n194 60 150 35 1.36\n(Nt)o 1.7938 166 60 126 38 1.38 -0.09\n191 60 147 36 1.36\nNm\n10000 178 60 135 37 1.37 0.00\n181 60 139 36 1.37\nAm\n0.025 164 60 124 38 1.38 -0.09\n193 60 149 35 1.36\nt\n0.44 194 60 148 37 1.37 -0.02\n168 60 128 36 1.37\n(pFcrit)t\n4 176 60 129 37 1.35 0.10\n174 60 134 36 1.38\nHI 0.543 162 60 124 37 1.37 0.00198 60 151 37 1.37\nCrop parameters\nc\n1.34 180 50 143 30 1.39 -0.13\n180 69 131 43 1.35\nSemerge\n57 180 61 137 37 1.37 0.00\n180 60 138 36 1.37\nSh\n1312 180 55 139 34 1.38 -0.09\n180 64 136 39 1.36\nHI 0.42 180 54 137 33 1.37 0.00180 66 137 40 1.37\nc\n0.44 180 62 141 37 1.38 -0.07\n180 58 134 36 1.36\n(pFcrit)c\n2.9 180 58 140 35 1.38 -0.08\n180 61 135 37 1.36\nSilsoe Base\nscenario\n379 247 335 98 1.28\nTree parameters kt\n0.8 344 247 295 113 1.32 -0.24\n404 247 364 87 1.25\nt\n1.4086 355 247 309 108 1.31 -0.18\n398 247 356 90 1.26\n(Nt)o 0.6225 360 247 313 106 1.30 -0.15\n395 247 352 92 1.26\nNm\n10000 377 247 332 99 1.28 -0.01\n381 247 337 97 1.28\nAm\n0.05 358 247 311 107 1.30 -0.16\n396 247 355 91 1.26\nt\n0.28 415 247 365 100 1.29 -0.04\n349 247 309 96 1.28\n(pFcrit)t\n4 363 247 277 118 1.24 0.14\n354 247 317 94 1.28\nHI 341 247 301 98 1.28 0.00417 247 368 98 1.28\nCrop parameters\nc\n1.34 379 239 344 89 1.28 -0.01\n379 253 325 107 1.28\nSemerge\n57 379 255 328 107 1.28 -0.02\n379 241 340 92 1.28\nSh\n1312 379 238 336 96 1.29 -0.04\n379 255 334 101 1.27\nHI 0.57 379 222 335 88 1.28 0.00379 272 335 108 1.28\nc\n0.30 379 272 341 105 1.28 -0.02\n379 226 329 93 1.28\n(pFcrit)c\n2.9 379 239 348 88 1.28 -0.04\n379 252 321 108 1.27\n32\nFig. 1. Outline of the modelling process\nYield-\nSAFE\nProgram\n2) Implemention\nof the model\ncode 4a) Modeloutputs\nModelled\ntree yields\nModelled\ncrop yields\n5) Use\nmodel for\nprediction\n4b) Are\nthe modelled\noutputs\ncredible?\n1) Identification and description of field sites\nincluding measured crop and tree yields\nNo\nYes\nPhysical world\nModelled world\n3) Model inputs\nClimate data\nSoil data\nManagement\nparameters\nCrop parameters\nTree parameters\n33\na) Vézénobres: tree volume b) Silsoe: tree volume\nc) Relative crop yield at Vézénobres d) Relative crop yield at Silsoe\nFig. 2 Measured a) silvoarable and forestry timber yields at Vézénobres, b) forestry timber\nvolumes at Silsoe, c) relative crop yields at Vézénobres, and f) relative crop yield at Silsoe\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nTi\nm\nbe\nrv\nol\num\ne\n(m\n3\ntr\nee\n-1\n)\nTime from planting (a)\nMeasured foresty response\nAssumed forestry response\nMeasured silvoarable response\nAssumed silvoarable response\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nTime from planting (a)\nMeasured forestry response\nAssumed forestry response\nMeasured silvoarable response\nAssumed silvoarable response\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nR\nel\nat\niv\ne\ncr\nop\nyi\nel\nd\nTime from planting (a)\nArable\nMeasured silvoarable response\nAssumed silvoarable response\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nTime from planting (a)\nArable\nMeasured silvoarable response\n34\nFig. 3. Relationship between the modelled crop yield of wheat and the rainfall in the period\nfrom crop sowing to crop harvest for the Silsoe site (Yield (in t ha-1) = 0.01629 ( 0.00018)\nRainfall (in mm); n = 29; r2 = 0.76).\n0\n2\n4\n6\n8\n10\n12\n0 200 400 600\nM\nod\nel\nle\nd\nw\nhe\nat\nyi\nel\nd\n(t\nha\n-1\n)\nRainfall during the cropping period (mm)\n35\na) Vézénobres: forestry tree volume d) Silsoe: forestry tree volume\nb) Vézénobres: silvoarable tree volume e) Silsoe: silvoarable tree volume\n0.0\n0.5\n1.0\n0 5 10 15\nTi\nm\nbe\nrv\nol\num\ne\n(m\n3\ntr\nee\n-1\n)\nTime from planting (a)\nMeasured forestry response\nAssumed forestry response\nYield-SAFE forestry prediction\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0 10 20 30\nTime from planting (a)\nMeasured forestry response\nAssumed forestry response\nYield-SAFE forestry prediction\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nTi\nm\nbe\nrv\nol\num\ne\n(m\n3\ntr\nee\n-1\n)\nTime from planting (a)\nMeasured silvoarable\nAssumed silvoarable response\nYield-SAFE silvoarable prediction\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0 10 20 30\nTime from planting (a)\nMeasured silvoarable response\nAssumed silvoarable response\nYield-SAFE silvoarable prediction\n36\nc) Vézénobres: relative crop yield f) Silsoe: relative crop yield\nFig. 4. Comparison of predicted and measured timber yields at a) and b) Vézénobres, d) and\ne) Silsoe, and relative crop yields at c) Vézénobres and f) Silsoe.\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 5 10 15\nR\nel\nat\niv\ne\ncr\nop\nyi\nel\nd\nTime from planting (a)\nArable\nMeasured silvoarable response\nAssumed silvoarable response\nYield-SAFE silvoarable prediction\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 10 20 30\nR\nel\nat\niv\ne\ncr\nop\nyi\nel\nd\nTime from planting (a)\nArable\nMeasured silvoarable response\nYield-SAFE silvoarable prediction\n37\na) Vézénobres: tree volume d) Silsoe: tree volume\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\nTr\nee\nvo\nlu\nm\ne\n(m\n3 )\n0\n2\n3\n5\n6\nb) Vézénobres: stand volume e) Silsoe: stand volume\n0\n200\n400\n600\nS\nta\nnd\nvo\nlu\nm\ne\n(m\n3\nha\n-1\n)\n0\n200\n400\n600\n800\nc) Vézénobres: crop yield f) Silsoe: crop yield\n0.0\n0.5\n1.0\n0 500 1000\nRe\nla\nti\nve\ncr\nop\nyi\nel\nd\nTree density (tree ha-1)\n0.0\n0.5\n1.0\n0 500 1000\nTree density (tree ha-1)\nFig 5. The effect of tree density and the incorporation of the drought-stress model within the\nmodel on the a) tree volume, b) stand volume and c) mean relative crop yield at Vézénobres\nover 15 years assuming a 1.5 m soil depth, and on the d) tree volume, e) stand volume and f)\nmean relative crop yield at Silsoe over 30 years assuming a 1.5 m soil depth. The treatments\nare forestry and agroforestry with no water stress (▬▬), forestry with water stress (▬ ▬ \n▬) and agroforestry with drought stress (▪▪▪▪▪▪).\n38\na) Vézénobres: tree volume d) Silsoe: tree volume\n0\n1\n2\nTr\nee\nvo\nlu\nm\ne\n(m\n3 )\n0\n2\n4\n6\nb) Vézénobres: stand volume e) Silsoe: stand volume\n0\n100\n200\n300\nSt\nan\nd\nvo\nlu\nm\ne\n(m\n3\nha\n-1\n)\n0\n200\n400\n600\nc) Vézénobres: crop yield f) Silsoe: crop yield\n0\n1\n2\n3\n0 500 1000\nM\nea\nn\ncr\nop\nyi\nel\nd\n(t\nha\n-1\n)\nTree density (tree ha-1)\n0\n2\n4\n6\n8\n0 500 1000\nTree density (tree ha -1)\nFig 6. The effect of soil depth and tree density within the model on the a) tree volume, b)\nstand volume and c) relative crop yield at Vézénobres after 15 years, and on the d) tree\nvolume, e) stand volume and f) relative crop yield at Silsoe after 30 years. The soil depths\nare 0.5 (▪▪▪▪▪▪), 1.5 (▬ ▬ ▬), and 2.5 m (▬▬).\n39\na) Vézénobres b) Silsoe\n0\n4\n8\n12\n16\n0 1 2 3 4\nM\nea\nn\nan\nnu\nal\nin\ncr\nem\nen\nt(\nm\n3\nha\n-1\na-\n1 )\nMean crop yield (t ha-1 a-1)\n1.5 m\n0.5 m\n0\n4\n8\n12\n16\n0 2 4 6\nMean crop yield (t ha-1 a-1)\n1.5 m\n0.5 m\nFig 7. The modeled interaction between the mean annual increment of the tree component\nand the mean crop yield of the crop component for a) Vézénobres and b) Silsoe for two soil\ndepths.\n"}