{"doi":"10.1144\/GSL.SP.2004.223.01.09","coreId":"56060","oai":"oai:nora.nerc.ac.uk:10880","identifiers":["oai:nora.nerc.ac.uk:10880","10.1144\/GSL.SP.2004.223.01.09"],"title":"Carboniferous and Permian magmatism in Scotland","authors":["Upton, B.G.J.","Stephenson, David","Smedley, Pauline","Wallis, S.M.","Fitton, J.G."],"enrichments":{"references":[],"documentType":{"type":0.6666666667}},"contributors":["Wilson, M.","Neumann, E.-R.","Davies, G.R.","Timmerman, M.J.","Heeremans, M.","Larsen, B.T."],"datePublished":"2004","abstract":"Extensional tectonics to the north of the Variscan Front during the Early Carboniferous generated fault-controlled basins across the British Isles, with accompanying basaltic magmatism. In Scotland Dinantian magmatism was dominantly mildly alkaline-transitional in composition. Tournaisian activity was followed by widespread Visean eruptions largely concentrated within the Scottish Midland Valley where the lava successions, dominantly of basaltic-hawaiitic composition, attained thicknesses of up to 1000 m. Changing stress fields in the late Visean coincided with a change in the nature of the igneous activity; subsequently, wholly basic magmatism persisted into the Silesian. As sedimentary basin fills increased, sill intrusion tended to dominate over lava extrusion. In the Late Carboniferous (Stephanian) a major melting episode, producing large volumes of tholeiitic magma, gave rise to a major dyke swarm and sills across northern England and Scotland. Alkali basaltic magmatism persisted into the Permian, possibly until as late as 250 Ma in Orkney. Geochemical data suggest that the Carboniferous-Permian magmas were dominantly of asthenospheric origin, derived from variable degrees of partial melting of a heterogeneous mantle source; varying degrees of interaction with the lithosphere are indicated. Peridotite, pyroxenite and granulite-facies basic meta-igneous rocks entrained as xenoliths within the most primitive magmas provide evidence for metasomatism of the lithospheric mantle and high-pressure crystal fractionation. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/56060.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10880\/1\/Document1.pdf","pdfHashValue":"37cd01407168b1004534701c6ef993b69d3c55f5","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10880<\/identifier><datestamp>\n      2012-11-22T12:20:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10880\/<\/dc:relation><dc:title>\n        Carboniferous and Permian magmatism in Scotland<\/dc:title><dc:creator>\n        Upton, B.G.J.<\/dc:creator><dc:creator>\n        Stephenson, David<\/dc:creator><dc:creator>\n        Smedley, Pauline<\/dc:creator><dc:creator>\n        Wallis, S.M.<\/dc:creator><dc:creator>\n        Fitton, J.G.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Extensional tectonics to the north of the Variscan Front during the Early Carboniferous generated fault-controlled basins across the British Isles, with accompanying basaltic magmatism. In Scotland Dinantian magmatism was dominantly mildly alkaline-transitional in composition. Tournaisian activity was followed by widespread Visean eruptions largely concentrated within the Scottish Midland Valley where the lava successions, dominantly of basaltic-hawaiitic composition, attained thicknesses of up to 1000 m. Changing stress fields in the late Visean coincided with a change in the nature of the igneous activity; subsequently, wholly basic magmatism persisted into the Silesian. As sedimentary basin fills increased, sill intrusion tended to dominate over lava extrusion. In the Late Carboniferous (Stephanian) a major melting episode, producing large volumes of tholeiitic magma, gave rise to a major dyke swarm and sills across northern England and Scotland. Alkali basaltic magmatism persisted into the Permian, possibly until as late as 250 Ma in Orkney. Geochemical data suggest that the Carboniferous-Permian magmas were dominantly of asthenospheric origin, derived from variable degrees of partial melting of a heterogeneous mantle source; varying degrees of interaction with the lithosphere are indicated. Peridotite, pyroxenite and granulite-facies basic meta-igneous rocks entrained as xenoliths within the most primitive magmas provide evidence for metasomatism of the lithospheric mantle and high-pressure crystal fractionation. \\ud\n<\/dc:description><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:contributor>\n        Wilson, M.<\/dc:contributor><dc:contributor>\n        Neumann, E.-R.<\/dc:contributor><dc:contributor>\n        Davies, G.R.<\/dc:contributor><dc:contributor>\n        Timmerman, M.J.<\/dc:contributor><dc:contributor>\n        Heeremans, M.<\/dc:contributor><dc:contributor>\n        Larsen, B.T.<\/dc:contributor><dc:date>\n        2004<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10880\/1\/Document1.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Upton, B.G.J.; Stephenson, David; Smedley, Pauline; Wallis, S.M.; Fitton, J.G..  2004  Carboniferous and Permian magmatism in Scotland.    In: Wilson, M.; Neumann, E.-R.; Davies, G.R.; Timmerman, M.J.; Heeremans, M.; Larsen, B.T., (eds.) Permo-Carboniferous magmatism and rifting in Europe.  London, UK, Geological Society of London, 195-218.      \n <\/dc:identifier><dc:relation>\n        http:\/\/sp.lyellcollection.org\/content\/vol223\/issue1\/<\/dc:relation><dc:relation>\n        10.1144\/GSL.SP.2004.223.01.09<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10880\/","http:\/\/sp.lyellcollection.org\/content\/vol223\/issue1\/","10.1144\/GSL.SP.2004.223.01.09"],"year":2004,"topics":["Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":"Carboniferous and Permian magmatism in \nScotland \n \n1. B. G. J. Upton1,  \n2. D. Stephenson2,  \n3. P. M. Smedley3,  \n4. S. M. Wallis1 and  \n5. J. G. Fitton1 \n+Author Affiliations \n1. 1School of Geosciences, University of Edinburgh , West Mains Road, Edinburgh EH9 3JW, \nUKbupton@glg.ed.ac.uk \n2. 2British Geological Survey , Murchison House, West Mains Road, Edinburgh EH9 3LA UK \n3. 3British Geological Survey , Maclean Building, Wallingford, Oxfordshire OX10 8BB, UK \n \nExtensional tectonics to the north of the Variscan Front during the Early Carboniferous generated \nfault-controlled basins across the British Isles, with accompanying basaltic magmatism. In \nScotland Dinantian magmatism was dominantly mildly alkaline-transitional in composition. \nTournaisian activity was followed by widespread Visean eruptions largely concentrated within the \nScottish Midland Valley where the lava successions, dominantly of basaltic-hawaiitic composition, \nattained thicknesses of up to 1000 m. Changing stress fields in the late Visean coincided with a \nchange in the nature of the igneous activity; subsequently, wholly basic magmatism persisted \ninto the Silesian. As sedimentary basin fills increased, sill intrusion tended to dominate over lava \nextrusion. In the Late Carboniferous (Stephanian) a major melting episode, producing large \nvolumes of tholeiitic magma, gave rise to a major dyke swarm and sills across northern England \nand Scotland. Alkali basaltic magmatism persisted into the Permian, possibly until as late as 250 \nMa in Orkney. Geochemical data suggest that the Carboniferous-Permian magmas were \ndominantly of asthenospheric origin, derived from variable degrees of partial melting of a \nheterogeneous mantle source; varying degrees of interaction with the lithosphere are indicated. \nPeridotite, pyroxenite and granulite-facies basic meta-igneous rocks entrained as xenoliths \nwithin the most primitive magmas provide evidence for metasomatism of the lithospheric mantle \nand high-pressure crystal fractionation.  \n \n"}