{"doi":"10.1016\/j.envpol.2005.11.043","coreId":"140613","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1186","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1186","10.1016\/j.envpol.2005.11.043"],"title":"Identifying source correlation parameters for hydrocarbon wastes using compound-\nspecific isotope analysis.","authors":["Hough, Rupert L.","Whittaker, Martin","Fallick, Anthony E.","Preston, Tom","Farmer, John G.","Pollard, Simon J. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-01T00:00:00Z","abstract":"A preliminary evaluation of compound-specific isotope analysis (CSIA) as a\nnovel, alternative method for identifying source correlation compounds in soils\ncontaminated with residual heavy or weathered petroleum wastes is presented.\nOil-contaminated soil microcosms were established using soil (sandy-loam, non-\ncarbonaceous gley) amended with ballast-, crude- or No.6 fuel oil. Microcosms\nwere periodically sampled over 256 days and δ13C values (which express the ratio\nof 13C to 12C) determined at each time point for five n-alkanes and the\nisoprenoid norpristane using gas chromatography–isotope ratio mass spectrometry\n(GC-IRMS). Although some temporal variation was observed, no significant\ntemporal shifts in the δ13C values for the five n-alkanes were measured in all\nthree oils. Isoprenoid isotope ratios (δ13C) appeared to be least affected by\nbiotransformation, especially in the No.6 fuel oil. The research suggests that\nthe δ13C of isoprenoids such as norpristane, may be of use as source correlation\nparameters. Compound-specific isotope analysis (CSIA) is a promising method for\nidentifying source correlation compounds in soils contaminated with heavy or\nweathered petroleum ","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140613.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.envpol.2005.11.043","pdfHashValue":"dda32f2a680d85ee17c24a4e5a7c43ccf037fd45","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1186<\/identifier><datestamp>2011-10-07T11:11:17Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Identifying source correlation parameters for hydrocarbon wastes using compound-\nspecific isotope analysis.<\/dc:title><dc:creator>Hough, Rupert L.<\/dc:creator><dc:creator>Whittaker, Martin<\/dc:creator><dc:creator>Fallick, Anthony E.<\/dc:creator><dc:creator>Preston, Tom<\/dc:creator><dc:creator>Farmer, John G.<\/dc:creator><dc:creator>Pollard, Simon J. T.<\/dc:creator><dc:subject>Stable isotopes<\/dc:subject><dc:subject>Heavy oils<\/dc:subject><dc:subject>Environmental diagnostics<\/dc:subject><dc:subject>Contaminated land<\/dc:subject><dc:description>A preliminary evaluation of compound-specific isotope analysis (CSIA) as a\nnovel, alternative method for identifying source correlation compounds in soils\ncontaminated with residual heavy or weathered petroleum wastes is presented.\nOil-contaminated soil microcosms were established using soil (sandy-loam, non-\ncarbonaceous gley) amended with ballast-, crude- or No.6 fuel oil. Microcosms\nwere periodically sampled over 256 days and δ13C values (which express the ratio\nof 13C to 12C) determined at each time point for five n-alkanes and the\nisoprenoid norpristane using gas chromatography–isotope ratio mass spectrometry\n(GC-IRMS). Although some temporal variation was observed, no significant\ntemporal shifts in the δ13C values for the five n-alkanes were measured in all\nthree oils. Isoprenoid isotope ratios (δ13C) appeared to be least affected by\nbiotransformation, especially in the No.6 fuel oil. The research suggests that\nthe δ13C of isoprenoids such as norpristane, may be of use as source correlation\nparameters. Compound-specific isotope analysis (CSIA) is a promising method for\nidentifying source correlation compounds in soils contaminated with heavy or\nweathered petroleum w<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-09-29T17:46:34Z<\/dc:date><dc:date>2011-09-29T17:46:34Z<\/dc:date><dc:date>2006-10-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Rupert L. Hough, Martin Whittaker, Anthony E. Fallick, Tom Preston, John G. Farmer and Simon J.T. Pollard, Identifying source correlation parameters for hydrocarbon wastes using compound-specific isotope analysis, Environmental Pollution, Volume 143, Issue 3, , October 2006, Pages 489-498.<\/dc:identifier><dc:identifier>0269-7491<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.envpol.2005.11.043<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1186<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0269-7491","issn:0269-7491"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Stable isotopes","Heavy oils","Environmental diagnostics","Contaminated land"],"subject":["Article"],"fullText":" 1\nIDENTIFYING SOURCE CORRELATION PARAMETERS FOR HYDROCARBON 1 \nWASTES USING COMPOUND-SPECIFIC ISOTOPE ANALYSIS 2 \n 3 \nRupert L. Hougha, Martin Whittakerb, Anthony E. Fallickc, Tom Prestonc, John G. Farmerb 4 \nand Simon J.T. Pollarda* 5 \naIntegrated Waste Management Centre, Sustainable Systems Department, School of Industrial & Manufacturing 6 \nScience, Cranfield University, Cranfield, MK43 0AL, UK. 7 \nbSchool of Geosciences, University of Edinburgh, West Mains Road, Edinburgh, EH9 3JJ, UK. 8 \ncScottish Universities Research and Reactor Centre, East Kilbride, Glasgow, G75 0QF, UK. 9 \n 10 \nCapsule 11 \nCompound-specific isotope analysis (CSIA) is a promising method for identifying source 12 \ncorrelation compounds in soils contaminated with heavy or weathered petroleum wastes. 13 \n 14 \nAbstract 15 \nA preliminary evaluation of compound-specific isotope analysis (CSIA) as a novel, alternative 16 \nmethod for identifying source correlation compounds in soils contaminated with residual heavy 17 \nor weathered petroleum wastes is presented.  Oil-contaminated soil microcosms were established 18 \nusing soil (sandy-loam, non-carbonaceous gley) amended with ballast-, crude- or No. 6 fuel oil. 19 \nMicrocosms were periodically sampled over 256 days and δ13C values (which express the ratio of 20 \n13C to 12C) determined at each time point for five n-alkanes and the isoprenoid norpristane using 21 \ngas chromatography-isotope ratio mass spectrometry (GC-IRMS).  Although some temporal 22 \nvariation was observed, no significant temporal shifts in the δ13C values for the five n-alkanes 23 \n                                                 \n* Corresponding author.  Tel: +44 (0)1234 754 101; Fax +44 (0)1234 751 671; E-mail s.pollard@cranfield.ac.uk \n 2\nwere measured in all three oils.  Isoprenoid isotope ratios (δ13C) appeared to be least affected by 1 \nbiotransformation, especially in the No. 6 fuel oil. The research suggests that the δ13C of 2 \nisoprenoids such as norpristane, may be of use as source correlation parameters. 3 \n 4 \nKeywords:  stable isotopes, heavy oils, environmental diagnostics, contaminated land. 5 \n 6 \nINTRODUCTION 7 \nAt sites featuring contamination of the soil environment by heavy oils or residual petroleum 8 \nwastes, the vast complexity of the waste-soil-groundwater matrix and the hydrophobicity, 9 \ninaccessibility and recalcitrance of individual waste components are such that resolution of these 10 \nissues is fraught with uncertainties (Potter & Simmons, 1998; Pollard et al., 2004).  Particular 11 \nchallenges that such sites present may be categorised into two broad themes; (i) analytical 12 \nchallenges associated with the chemical characterisation of these wastes (Pollard et al, 1994; 13 \nWhittaker et al, 1996), and (ii) challenges associated with the assessment of biotransformation of 14 \nheavy oil contaminants and their potential sources, particularly following prolonged weathering 15 \n(Whittaker, 1996). 16 \nFingerprinting of petroleum products in the environment is commonly undertaken to assess 17 \nthe source of a particular contamination event.  It is commonly achieved through a qualitative 18 \ncomparison of mass chromatograms, but can also be achieved by quantifying the ratio of one 19 \nbiomarker to another.  Fingerprinting is important for differentiating between potential 20 \ncontaminant sources and for establishing potential liability for a spillage; for example when 21 \ncontaminants migrate across boundaries of ownership (Douglas et al., 1992; Douglas & Uhler, 22 \n1993). 23 \n 3\nRatios of certain biomarkers, referred to as source correlation indices, are sensitive to the 1 \ngeological source of an oil, but remain consistent between related oils.  Moreover, because of the 2 \nenvironmental persistence of biomarker compounds, their values remain unaltered by oil 3 \nweathering and biotransformation processes.  The most commonly used source correlation 4 \nindices are [pristane:phytane] and [17α(H),21β(H)-hopane:17α(H),21β(H)-norhopane] 5 \n(Whittaker et al., 1999).  For heavy or residual petroleum contaminants, diagnostic fingerprinting 6 \ncreates uncertainties, especially because of the high degree of weathering experienced by the 7 \ncontaminants.  Instead, diagnostic parameters that compare relative abundance of biomarker 8 \nisomers and polyaromatic hydrocarbons (PAHs) in crude oils have been shown to be reliable 9 \nsource indices for marine spills (Douglas et al., 1992; Wang et al., 1994).  However, there is little 10 \nknowledge of the effectiveness of these indices for heavy oils in the contaminated soil, as 11 \nopposed to the marine, environment. 12 \nOur own work, on the characterisation of heavy oils, has focussed on improved analytical 13 \nstrategies and methods (Pollard et al., 1994; Whittaker et al., 1996; 1999; Pollard et al., 2004) for 14 \nthese problematic environmental matrices.  Screening whole reference oils by stable carbon 15 \nisotope fingerprinting without GC separation (Whittaker et al., 1996) demonstrated the utility of 16 \nthe technique for source term characterisation and highlighted the need for compound-specific 17 \nstudies.  The advent of compound-specific isotope analysis (CSIA) for assessing the isotopic 18 \nsignature of carbon in crude oils and crude oil fractions by gas chromatography-coupled isotope 19 \nratio mass spectroscopy (GC-IRMS) was first developed by Barrie et al. (1984). Since then, 20 \nfurther technical examination and development of the method in crude oils and crude oil fractions 21 \nhas been undertaken (Reiley et al., 1991; Eakin et al., 1992; Merrit et al., 1994; Sessions et al., 22 \n2001).  These refinements have elevated the characterisation of petroleum hydrocarbons to a 23 \nlevel of sensitivity and detail unobtainable by conventional IRMS.  CSIA yields data of the 24 \n 4\nisotopic composition of a single compound relative to an international standard that are usually 1 \nexpressed as δ values in units of parts per thousand (‰).  Because of this, CSIA is able to 2 \nquantify isotopic composition and provide an additional (and often unique) means to (i) allocate 3 \nand distinguish sources of organic compounds, and (ii) identify and quantify transformation 4 \nreactions (Schmidt et al., 2004).  CSIA is a continuous flow technique, which utilises the linking 5 \nof a separation method (until now solely gas chromatography) via an on-line 6 \ncombustion\/pyrolysis unit with a multicollector mass spectrometer.  A review of CSIA principles 7 \nand technical aspects has been published by Meier-Augenstein (1999). 8 \nCSIA has become a mainstay of petroleum geochemistry research, providing key 9 \ninformation on the factors that influence the composition of oil components (Bjorøy et al., 1991; 10 \nSofer et al., 1991; Lichtfouse, 2000) and the determination of the source terms of oils and other 11 \norganic matter (Mansuy et al., 1997; Rogers & Savard, 1999; Mazeas & Budzinski, 2002).  In 12 \nmany cases, the CSIA of n-alkane and isoprenoid biomarkers has also provided a valuable set of 13 \ncorrelation parameters for the identification of oil sources and depositional environments (Bowler 14 \net al., 1993) and the extent of biotransformation observed in crude oils (Killops & Killops, 1993).  15 \nChemical fingerprinting of the n-alkane fraction of crude oils and refined products in 16 \ncombination with isotopic characterisation of carbon in the individual homologues has been 17 \nsuccessfully used to allocate sources of sediment contamination and bird-feather oiling (Mansuy 18 \net al., 1997; Rogers & Savard, 1999; Mazeas & Budzinski, 2002). 19 \nIn this paper, application of CSIA for the characterisation of heavy oil contaminants in 20 \nsoil is investigated.  Source correlation index reliability was assessed according to the constancy 21 \nof the δ13C value during oil weathering.  Indices that remain constant are useful as they allow the 22 \nsource of an oil to be determined (providing a sample of the fresh oil is available).  Oil-amended 23 \nsoil microcosms were established and incubated at conditions optimum for oil biotransformation. 24 \n 5\nAn isotopic fingerprint of five n-alkanes and norpristane (phytane could not be sufficiently 1 \nresolved in all samples) in oils at successive stages of microbial transformation was obtained. 2 \nThe aim of the study was to establish the utility of CSIA to determine source correlation 3 \nparameters by assessing temporal variations in the isotopic fingerprint. 4 \n 5 \n 6 \nMATERIALS AND METHODS 7 \n 8 \nSoil microcosms 9 \nSoil microcosms amended with one of three oils (Nigerian crude oil, ballast oil and No. 6 10 \nfuel oil) were established in close accordance with British Standard 7755 (British Standards 11 \nInstitute, 1995).  Microcosms were prepared in wide-necked, acid-washed 500 ml Erlenmeyer 12 \nflasks.  A total of 124 individual flasks were prepared: three oils sampled at nine different points 13 \nin a time series, nine sterilised control flasks (one for each sampling point) and a total of 16 blank 14 \nmicrocosm flasks.  A sandy-loam (non-carbonaceous gley) soil (Table 1) which had not been 15 \nused for agriculture for eight years was sieved (<2.0 mm). 200 g soil and 4.0 g of oil 16 \n(homogenised) were added to 108 flasks.  Control microcosms were autoclaved (121 °C; 103.4 17 \nPa) for 15 minutes and treated with a 1 % w\/w solution of mercuric chloride, HgCl2, to suppress 18 \nmicrobial activity (Chaineau et al., 1995).  Blank microcosms containing no oil were prepared to 19 \nassess contributions from soil organic matter (SOM).  All microcosms were amended with a 20 \nnutrient solution providing an equivalent molar C:N:P ratio of 100:8.75:1.75, believed optimum 21 \nfor oil biotransformation in soil (Huesemann, 1995; Chaineau et al., 1995). 22 \nMicrocosms were arranged in a randomised block design and incubated at 30 °C for 256 23 \ndays.  Water content (weight) of microcosms was maintained to within ± 5 % with distilled de-24 \n 6\nionised water.  Control flask weight was maintained with HgCl2 solution. Soil pH was monitored 1 \nthroughout the study.  Sacrificial soil samples were taken at 0, 2, 4, 8, 16, 32, 64, 128 and 256 2 \ndays.  All samples were air dried under forced-draught in a fume cupboard prior to solvent 3 \nextraction and analysis. 4 \nSolvent-extractable matter (SEM) was Soxhlet-extracted from soil subsamples (ca. 30 g) 5 \nfor 16 h using 150 ml HPLC-grade dichloromethane (DCM). DCM extracts were reduced 6 \novernight at ambient temperatures in a forced draught fume cupboard.  Full experimental details 7 \nof the column fractionation have been reported previously (Whittaker & Pollard, 1994).  8 \nComponent class fractionation was achieved using an adaptation of a classical chromatographic 9 \ncleanup procedure (EPA Method 3611A, 1990).  A Quick-Sep™ lateral reservoir flash 10 \nchromatography apparatus was used to provide more rapid separation.  The column (90 mm x 30 11 \nmm) was packed with neutral Aldrich STD grade alumina (80 mm, ca. 150 mesh, activated for 12 \n12 h at 130 °C), followed by anhydrous Na2SO4 (ca. 10 mm, dehydrated by heating at 400 °C for 13 \n4 hours).  The column was prepared by pouring equilibrated slurry of alumina stationary phase 14 \nand n-pentane solvent down a glass rod into the chromatography apparatus.  A piston air pump 15 \n(Fisons, 50 W) was connected to the top of the column and the air pressure adjusted to produce a 16 \ndown-flow elution rate of ca. 20 ml min-1 (2 % pump capacity).  Component classes were 17 \nobtained using an elution scheme reported by Pollard et al. (1992): 150 ml n-pentane (elution of 18 \nsaturates), 150 ml toluene (mono-, di- and polyaromatics), and 150 ml 50\/50 19 \ndichloromethane\/methanol mixture (polar compounds, highly polar aromatics, benzothiophenes 20 \nand carbazoles).  Further cleanup of the pentane fraction was performed using a method 21 \ndescribed by Rawluk (1991).  Fractions were collected in pre-weighed acid-washed borosilicate 22 \nflasks and reduced further under forced draught (ambient temperature). 23 \n 24 \n 7\nGas Chromatography-Isotope Ratio Mass Spectrometry (GC-IRMS) 1 \nSolvent extracts were analysed in DCM solution at a concentration of ca. 10 mg ml-1 2 \nusing a VG ISOCHROM II GC-IRMS system. Individual compounds were isolated using an 3 \nHP5890A gas chromatograph, equipped with a standard 30 m x 0.00032 m i.d. neutral DB5 4 \ncolumn (diphenyl:disiloxane (5 %:95 %) stationary phase) and a dedicated carbon isotope ratio 5 \nmass spectrometer.  Aliquots (2 μl) were injected in splitless mode.  A linear temperature 6 \ngradient was employed, the column temperature being held at 40 °C for 2 minutes following 7 \ninjection, ramped at 10 °C min-1 to 320 °C, then held at this temperature for a further 4 minutes.  8 \nInjector and detector temperatures were set to 350 °C.  Helium was used as a carrier gas at a flow 9 \nrate of 7.5 ml min-1. n-alkane peaks were identified by comparing sample GC retention data with 10 \nthat obtained for a standard solution of five n-alkanes containing C15, C20, C25, C30 and C40.  11 \nConversion of oil class fraction subsamples to CO2 for isotopic analysis was accomplished by dry 12 \ncombustion (850 °C; 6 h) in sealed, evacuated quartz tubes containing excess fired cupric oxide 13 \nas an oxygen source.  Isotope ratio data were obtained on a SIRA 10 isotope ratio mass 14 \nspectrometer (VG Micromass 602D) and are reported relative to the international standard 15 \n‘Vienna Pee Dee Belemnite’ (VPDB; 13C:12C = 0.01118 (Werner & Brand, 2001)) with 16 \ncorrections made for 17O contributions.  Isotope ratios are expressed in terms of δ13C values (‰) 17 \ncalculated relative to the standard VPDB, according to the following relationship:  18 \n 19 \n 1000113 ⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛ −=\nR\nS\nR\nR\nCδ                                                                                                                     (1) 20 \n 21 \nwhere RS is the ratio of 13C to 12C in the sample, and RR is the ratio of 13C to 12C in the Vienna 22 \nPee Dee Belemnite standard (0.01118). The reproducibility of the individual isotopic 23 \n 8\nmeasurements, determined through repeated analysis of a laboratory standard graphite sample, 1 \nwere ±0.05 ‰ (1σ); for each sample, the isotopic composition was determined in triplicate, with 2 \nstandard deviations generally less than ±0.3 ‰. 3 \n 4 \nRESULTS  5 \nConfirmation of oil biotransformation 6 \nA pre-requisite to investigating the performance of source correlation parameters was to 7 \nverify that subject oils had undergone significant biotransformation over the 256-day microcosm 8 \nstudy.  This was verified by monitoring the bulk oil loadings and the changes in oil composition 9 \nwith time.  It was confirmed that, for both ballast and crude oils, biotransformation reduced the 10 \namounts of oil in the microcosms by ~60 % w\/w (overall microbial degradation rate of 0.05 g kg-11 \n1 d-1).  Full details and results of these experiments have been reported elsewhere (Pollard et al., 12 \n1999). 13 \n 14 \nVariation in Solvent Extractable Material (SEM) 15 \nSolvent Extractable Material (SEM, mg g-1 of air-dried soil) recovered from the treated and 16 \ncontrol soils was corrected for natural organic matter.  Average recovery for the ballast oil-treated 17 \nsoils decreased most dramatically (P<0.05), from a maximum of 14.54 ± 0.25 mg m-1 at t=0 to 18 \n2.96 ± 0.54 mg g-1 after 256 days. Recoveries from the ballast oil control microcosms decreased 19 \nmuch less sharply, from an initial 14.75 mg g-1 to 11.93 mg g-1 after 256 days. Average crude oil 20 \nrecoveries also decreased significantly (P<0.05) over the course of the study, from 17.70 ± 0.44 21 \nmg g-1 to 6.47 ± 1.47 mg g-1. Recoveries from the corresponding control microcosms were again 22 \nmuch higher, decreasing from 17.96 mg g-1 to 16.94 mg g-1. For the No.6 fuel oil microcosms, 23 \n 9\nthere was very little decrease in SEM over time (20.71 ± 0.90 mg g-1 to 19.85 ± 0.84 mg g-1 in the 1 \ntreated soils; 20.03 mg g-1 to 19.71 mg g-1 in the controls). 2 \n Using this information, the percentage loss of each oil due to abiotic and biotic processes 3 \nat each sampling point was determined (Figure 1). In the case of the ballast oil microcosms, 4 \nabiotic weathering processes are significant in the early stages of the experiment, but this 5 \ninfluence decreases over time. For the crude and No.6 fuel oil, abiotic weathering plays little role 6 \nin the overall weathering process, apart from day 64 for the crude oil microcosms. Here, the role 7 \nof abiotic weathering is highly significant (P<0.01). 8 \n 9 \nGC-IRMS analysis 10 \nCompound specific isotope analysis of microcosm extracts provided the δ13C of the n-11 \nalkanes C14 (for ballast oil and crude oil only), C16 (for No.6 Fuel Oil only), C17, C18, C24 and C26, 12 \nand the isoprenoid alkane norpristane (iC18) over the 256-day microcosm study.  Mean isotope 13 \nratios, associated standard deviations and corresponding results from control microcosms for 14 \neach compound at each sampling point for the ballast oil-, crude oil- and No.6 fuel oil-treated 15 \nsoils are provided in Tables 2, 3 and 4, respectively. 16 \nFor ballast oil (Table 2), the δ13C values for the n-alkanes did not, in general, vary 17 \naccording to any readily identifiable trend.  The only obvious shift in isotopic composition was 18 \nfor C14, which had a δ13C of -30.8±1.5 ‰ after 2 days and -28.4 (n = 1) ‰ after 128 days (the 19 \ncompound was not detected at 256 days).  Isotope ratios for C17, C18, C24, C26 and norpristane did 20 \nnot vary by any significant amount from their initial values.  The fluctuations in δ13C for the 21 \ncompounds are shown in Figure 2a.  Similar results were obtained for the ballast oil control 22 \nflasks with no significant variations in isotopic composition detected (Table 2). 23 \n 10\nFor the crude oil extracts (Table 3), the isotopic composition of the five n-alkanes (C14, 1 \nC17, C18, C24, C26) and norpristane appeared to shift slightly in favour of the heavier C13 isotope 2 \nand become less negative with increased oil weathering.  However a shift to more negative δ13C 3 \nvalues was observed at 64 days for all compounds (Figure 2b).  Overall, the shift was greatest for 4 \nthe C14, C17, C18, C24 alkanes, which experienced statistically significant (P<0.05) increases in 5 \nδ13C of between 1.5 ‰ and 2 ‰ over the 256 days.  The isotope ratios of C26 and norpristane also 6 \nincreased with increased oil weathering, but the magnitude of the shift was not significant. 7 \nFurther, the δ13C of these compounds could not be determined at 256 days, when the greatest 8 \nisotopic shifts would have been expected. 9 \nFor the No.6 fuel oil, the individual compounds within the extracts exhibited no 10 \nsignificant shifts in δ13C over the course of the study.  All isotope ratios were found to lie 11 \nbetween -27.0 ‰ and -28.2 ‰.  A plot of compound δ13C variation with time (Figure 2c) 12 \nindicates that the isotope ratios of the n-alkanes oscillated within the specified range over the 13 \ncourse of the study.  The isoprenoid δ13C did not appear to undergo these fluctuations. The No.6 14 \nfuel oil microcosms, the isotope ratios of the n-alkanes and isoprenoid did not alter significantly 15 \nover the course of the study. 16 \n 17 \nDISCUSSION 18 \nWe sought to see whether significant changes in δ13C occur during the weathering of 19 \nheavy oil wastes.  A previous study looking at the biotransformation of the same heavy oil wastes 20 \nhas reported significant losses in solvent extractable matter over time (Pollard et al., 1999).  21 \nSignificant changes in class fraction distribution were also reported. These changes demonstrated 22 \nthat significant biotransformation of the heavy oily wastes had occurred during the 256-day 23 \nmicrocosm experiment.  From an environmental forensics viewpoint, it is often necessary to 24 \n 11\nallocate a contamination to a particular source in order to implement suitable risk reduction 1 \nmeasures or to identify responsible parties in litigation (Morrison, 2000). 2 \nResults of the GC-IRMS analysis of ballast oil, crude oil and No.6 fuel oil extracts at 3 \nsuccessive stages of biotransformation (Tables 2 – 4) suggest that norpristane (the isoprenoid 4 \nalkane biomarker) is isotopically heavier than in the n-alkanes in the fresh samples.  This is in 5 \ncontrast to the results for pristane, which had previously been found to be isotopically lighter than 6 \nn-alkanes in the same oils (Whittaker et al., 1996).  A plausible explanation is the documented 7 \nunpredictability of the nature of isotopic variations between these two compounds (Bjorøy et al., 8 \n1990; 1991; Sofer et al., 1991; Bowler et al., 1993). 9 \nFor each oil, plots of the mean δ13C variations of the five n-alkanes and norpristane over 10 \ntime (Figure 2a, b, c) indicate that microbial degradation induces fluctuations in isotopic 11 \ncomposition of these compounds, but generally the overall shifts in compound δ13C over the 256 12 \ndays were not substantial. For the ballast oil (Figure 2a): 13 \n(i) The isotope ratios of the ballast oil n-alkanes and norpristane at 0 days of 14 \nbiotransformation were effectively the same (within ca. 0.5 ‰, the established 15 \nreproducibility of the technique) as the values after 256 days of weathering, although 16 \nfor the n-alkanes some marked fluctuations in isotopic composition were observed. 17 \n(ii) The δ13C of norpristane did not vary substantially during the study, experiencing less 18 \nsizeable fluctuations in isotope ratio than the n-alkanes, and is therefore proposed as a 19 \npossible oil diagnostic parameter. 20 \n(iii) All ballast oil compounds detected experienced a sharp decrease in δ13C (1.0 – 1.5 ‰) 21 \nover the first four days of the study.  This may be due to preferential loss of 13C to 22 \nabiotic weathering processes, which were shown to be most influential over the initial 23 \nstages of the study (figure 1). Following this, the C14, C24 and C26 δ13C gradually 24 \n 12\nincreased over the course of the study to return to their original values. The δ13C of 1 \nC17 and C18 varied to a much lesser degree. 2 \n(iv) This latter variation, although small, may be the result of microbial action on the C14, 3 \nC24 and C26 alkanes, causing the heavier isotope to gradually accumulate in these 4 \ncompounds. Previous studies document that a shift in the order of 1 – 2 ‰ might be 5 \nexpected to result from microbial activity (e.g. Bowler et al., 1993).  The reason that 6 \nthis effect is diminished in C17 and C18 is because of co-elution of pristane and 7 \nphytane with these compounds. 8 \nFor the crude oil samples (Fig 2b): 9 \n(i) Isotope ratios in the crude oil samples appeared to shift in favour of the heavier 10 \nisotope over the course of the study, typically by 1.5 – 2.0 ‰. This suggests that 11 \nbiotransformation of this oil may be monitored through the detection of compound 12 \nisotope ratios, which increase as biotransformation proceeds and the lighter isotope is 13 \npreferentially removed during microbial catabolism. 14 \n(ii) The trend observed in (i) is reversed by a decrease in all isotope ratios by day 64. This 15 \nmay be due to a sudden shift in the rate of oil biotransformation, causing a marked 16 \nrearrangement in compound isotopic fractionation. This is corroborated by the 17 \nevidence presented in Figure 1, which shows a highly significant increase (P<0.01) in 18 \nthe proportion of weathering due to abiotic processes. 19 \n(iii) There is no clear difference between the isotopic variations of the n-alkanes and those 20 \nof norpristane. Thus in this case, the use of isoprenoid δ13C would not be a reliable 21 \nsource diagnostic parameter. 22 \nFor the No.6 fuel oil (Fig 2c): 23 \n 13\n(i) no overall shift in isotope ratio was observed for any of the compounds over 1 \nthe course of the study.  2 \n(ii) Individual values did appear to fluctuate in value between 0 and 256 days, but 3 \nby less than ± 0.5 ‰.  This is within the reproducibility of the technique and 4 \ncannot be interpreted as a genuine manifestation of microbial activity. 5 \n 6 \nThe influence of microbial activity on oil isotopic composition has been studied by 7 \nseveral authors (Schmidt et al., 2004; Griebler et al., 2004). Stahl (1980) examined the nutrient-8 \nenhanced degradation of crude oil over 42 days by determining compositional and stable carbon 9 \nisotope variations within different class fractions.  Although the aromatic and polar fraction δ13C 10 \nvalues remained constant (-27.6 ‰ and -27.1 ‰, respectively), the saturate fraction became 11 \nisotopically heavier by 0.7 ‰ and the asphaltene fraction isotopically lighter by 1.1 ‰. Other, 12 \ncompound-specific, studies using GC-IRMS have found no change in the isotopic composition of 13 \nindividual n-alkanes of a variety of crude oils with biotransformation (Sofer et al., 1991; Mazeas 14 \net al., 2002). 15 \nThe results presented here for ballast and crude oil reveal shifts in n-alkane δ13C values of 16 \nup to 2.5 times those observed by Stahl (1980).  Although no studies were carried out on the 17 \neffect of microbial activity on the whole oil isotope ratio, it would seem logical that an oil 18 \nconsisting predominantly of saturate class fraction components would also undergo shifts in 19 \nisotope ratio.  The use of oil δ13C as source correlation parameters would, in such cases, be 20 \nundermined.  However, the results presented in this paper do suggest that the isoprenoid δ13C is a 21 \nmore reliable source correlation index.  22 \n 14\n 1 \nCONCLUSIONS 2 \nThe whole oil isotope ratio of oils containing significant saturate class fraction content 3 \nmay become more positive following extensive microbial transformation. Previous work (Stahl, 4 \n1980; Killops & Killops, 1983) has shown that extensive biotransformation caused the 13C\/12C 5 \nratio to shift by a small but possibly significant amount in favour of 13C in some n-alkanes.  This 6 \nmay undermine the use of whole oil δ13C values as source correlation parameters in some cases 7 \n(e.g. for heavily mineralised oils).  However this work has shown that the compound-specific 8 \nisotope ratio may indeed be a useful source term parameter.  The isotopic shift of specific 9 \ncompounds has a very low sensitivity to biotransformation and hence is very resistant to 10 \nweathering.  Although preliminary, this study has shown that isoprenoid isotope ratios appear to 11 \nbe less affected by microbial degredation than n-alkanes, and may be of use as source correlation 12 \nparameters. However, abiotic degradation may still cause significant variation in isoprenoid 13 \nisotope ratios. The factors affecting abiotic degradation within the oil-weathering process need to 14 \nbe understood further if δ13C values are to be implemented as source correlation parameters. 15 \n 16 \nACKNOWLEDGEMENTS 17 \nThis research was partially funded by the Royal Society, to whom the authors are grateful.  We 18 \nwish to acknowledge BP Grangemouth for supplying the reference oils and technical staff at 19 \nSURRC for additional analytical support.  MW was supported as a University of Edinburgh 20 \nResearch Assistant and RLH is supported by a Bioremediation LINK programme grant.  SURRC 21 \nis supported by NERC and the consortium of Scottish Universities. 22 \n 23 \nGLOSSARY OF TERMS 24 \n 15\nEquation 1 1 \nRS = ratio of 13C to 12C in the sample 2 \nRR = ratio of 13C to 12C in the Vienna Pee Dee Belemnite standard (0.01118) 3 \n 4 \nREFERENCES  5 \n 6 \nBarrie, A., Bricout, J., Koziet, J. (1984) Gas chromatography – stable isotope ratio analysis at 7 \nnatural abundance levels. Biomed. Mass Spectrom. 11, 583-588. 8 \nBjorøy, M., Hall, K., Jumeau, J. (1990) Stable carbon isotope ratio analysis on single components 9 \nin crude oils by direct gas chromatography-isotope analysis. Trends in Anal. Chem. 9, 331-10 \n337. 11 \nBjorøy, M., Hall, K., Gillyon, P., Jumeau, J. (1991) Carbon isotope variations in n-alkanes and 12 \nisoprenoids of whole oils. Chem. Geol. 93, 13-20. 13 \nBowler, B., Jones, D. M., Li, M., Larter, S. R., Eakin, P. A., Fallick, A. E. (1993) Source 14 \ndepositional environment and maturity controls on stable carbon isotope signatures of 15 \nindividual compounds in crude oils. EAOG Conference, Stavanger, Norway, 1993. 16 \nBritish Standards Institute (1995) Guidance on laboratory testing for biodegradation of organic 17 \nchemicals un soil under aerobic conditions, BS 7755, Part 4, Subsection 4.1.1 18 \nChaineau, C. H., Morel, J. L., Oudot, J. (1995) Microbial degradation in soil microcosms of fuel 19 \noil hydrocarbons from drilling cuttings. Environ. Sci. Technol. 29, 1615-1621. 20 \nDouglas, G. S. & Uhler, A. D. (1993) Optimising EPA methods for petroleum-contaminated site 21 \nassessments. Environmental Testing and Analysis, May\/June 1993. 22 \n 16\nDouglas, G. S., McCarthy, K. J., Dahlen, D. T., Seavey, J. A., Steinhauer, W. G., Prince, R. C., 1 \nElmendorf, D. L. (1992) The use of hydrocarbon analysis for environmental assessment and 2 \nremediation. J. Soil Contam. 1, 197-216. 3 \nEakin, P.A., Fallick, A. E., Gerc, J. (1992) Some instrumental effects in the determination of 4 \nstable carbon isotope ratios by gas chromatography-isotope mass spectrometry. Chem. Geol. 5 \n101, 71-79. 6 \nGriebler, C., Safinowski, M., Vieth, A., Richnow, H. H., Meckenstock, R. U. (2004) Combined 7 \napplication of stable carbon isotope analysis and specific metabolites determination for 8 \nassessing in situ degradation of aromatic hydrocarbons in a tar oil-contaminated aquifer. 9 \nEnviron. Sci. Technol. 38, 617-631. 10 \nHeusemann, M. N. (1995) Predictive model for estimating the extent of petroleum hydrocarbon 11 \nbiodegradation in contaminated soils. Environ. Sci. Technol. 29, 7-18. 12 \nKillops, S. D. & Killops, V. J. (1993) An introduction to organic geochemistry, Longman, 13 \nLondon\/John Wiley and Sons, New York. 14 \nLichtfouse, E. (2000) Compound-specific isotope analysis. Application to archaelogy, biomedical 15 \nsciences, biosynthesis, environment, extraterrestrial chemistry, food science, forensic 16 \nscience, humic substances, microbiology, organic geochemistry, soil science and sport. 17 \nRapid Commun. Mass Spectrom. 14, 1337-1344. 18 \nMansuy, L., Philip, R. P., Allen, J. (1997) Source identification of oil spills based on the isotopic 19 \ncomposition of individual components in weathered oil samples. Environ. Sci. Technol. 31, 20 \n3417-3425. 21 \nMazeas, L. & Budzinski, H. (2002) Molecular and stable carbon isotopic source identification of 22 \noil residues and oiled bird feathers sampled along the Atlantic coast of France after the Erika 23 \noil spill. Environ. Sci. Technol. 36, 130-137. 24 \n 17\nMazeas, L., Budzinski, H., Raymond, N. (2002) Absence of stable carbon isotope fractionation of 1 \nsaturated and polycyclic aromatic hydrocarbons during aerobic bacterial biodegradation. 2 \nOrg. Geochem. 33, 1259-1272. 3 \nMeier-Augenstein, W. (1999) Applied gas chromatography coupled to isotope ratio mass 4 \nspectrometry. J. Chromatogr. A 842, 351-371. 5 \nMerritt, D. A., Brand, W. A., Hayes, J. M. (1994) Isotope-ratio-monitoring gas chromatography-6 \nmass spectrometry: methods for isotopic calibration. Org. Geochem. 21, 573-583. 7 \nMorrison, R. D. (2000) Environmental forensics: principles and applications. CRC Press, Boca 8 \nRaton. 9 \nPollard, S. J. T., Hrudey, S. E., Fuhr, B. J., Alex, R. F., Holloway, L. R., Tosto, F. (1992) 10 \nHydrocarbon wastes at petroleum and creosote-contaminated sites: rapid characterisation of 11 \nclass components by thin layer chromatography with flame ionization detection. Environ. 12 \nSci. Technol. 2, 2528-2534. 13 \nPollard, S. J. T., Kenefick, S. L., Hrudey, S. E., Fuhr, B. J., Holloway, L. R., Rawluk, M. (1994) 14 \nA tiered analytical protocol for the characterisation of heavy oil residues at petroleum-15 \ncontaminated hazardous waste sites. In: Analysis of soil contaminated with petroleum 16 \nconstituents (T. A. O’Shay, K. B. Hoddinott, eds.), American Society for Testing and 17 \nMaterials, Philadelphia, PA, USA, pp. 38-52. 18 \nPollard, S. J. T., Whittaker, M., Risden, G. C. (1999) The fate of heavy oil wastes in soil 19 \nmicrocosms I: a performance assessment of biotransformation indices. Sci. Tot. Env. 226, 1-20 \n22. 21 \nPollard, S. J. T., Hrudey, S. E.,  Rawluck, M., Fuhr, B. J. (2004) Characterisation of Weathered 22 \nHydrocarbon Wastes at Contaminated Sites by GC-Simulated Distillation and Nitrous Oxide 23 \nChemical Ionisation GC-MS, With Implications for Bioremediation. J Environ. Monitor. 6, 24 \n 18\n713-718. 1 \nPotter, T. L. & Simmons, K. E. (1998) Total Petroleum Hydrocarbon Criteria Working Group 2 \nSeries Volume 2: Composition of Petroleum Mixtures, Amherst Scientific, Amherst, 3 \nMassachusettes. 4 \nRawluk, M. (1991) Report of the characterisation of pentachlorophenol contaminated soils, 5 \nAlberta Research Council Report, 1991. 6 \nReiley, G., Collier, R. J., Jones, D. M., Eglington, G., Eakin, P. A., Fallick, A. E. (1991) Sources 7 \nof sedimentary lipids deduced from stable carbon-isotope analysis of individual compounds. 8 \nNature 353, 425-427. 9 \nRogers, K. M. & Savard, M. M. (1999) Detection of petroleum contamination in river sediments 10 \nfrom Quebec City region using GC-IRMS. Org. Geochem. 30, 1559-1569. 11 \nSchmidt, T. C., Zwank, L., Elsner, M., Berg, M., Meckenstock, R. U., Haderlein, S. B. (2004) 12 \nCompound-specific stable isotope analysis of organic contaminants in natural environments: 13 \na critical review of the state of the art, prospects, and future challenges. Anal. Bioanal. 14 \nChem. 378, 283-300. 15 \nSessions, A. L., Burgoyne, T. W., Hayes, J. M. (2001) Correction of H-3(+) contributions in 16 \nhydrocarbon isotope ratio monitoring. Anal. Chem. 73, 192-199. 17 \nSofer, Z., Bjorøy, M., Hustad, E. (1991) Isotope composition of individual n-alkanes in oils. In: 18 \nOrganic geochemistry. Advances and applications in energy and the natural environment 19 \n(D. Manning, ed.), Manchester University Press, Manchester, UK, 207-211. 20 \nStahl, W. J. (1980) Compositional changes and 13C\/12C fractionations during the degredation of 21 \nhydrocarbons by bacteria. Geochim. Et Cosmochim. Acta 44, 1903-1907. 22 \n 19\nWang, Z., Fingas, M. Sergy, G. (1994) Study of 22 year old Arrow oil samples using biomarker 1 \ncompounds by GC\/MS. Environ. Sci. Technol. 28, 1733-1746. 2 \nWerner, R. A. & Brand, W. A. (2001) Referencing strategies and techniques in stable isotope 3 \nratio analysis. Rapid Commun. Mass Spectrom. 15, 501-519. 4 \nWhittaker, M. (1996) Characterisation and biotransformation of heavy oils in the contaminated 5 \nsoil environment. Ph.D. Thesis, University of Edinburgh, UK. 6 \nWhittaker, M. & Pollard, S. J. T. (1994) Characterisation of refractory wastes at hydrocarbon-7 \ncontaminated sites – I. Rapid column fractionation and thin-layer chromatography of 8 \nreference oils. J. Planar Chromatogr., 7, 354-361. 9 \nWhittaker, M., Pollard, S. J. T., Fallick, A. E., Preston, T. (1996) Characterisation of refactory 10 \nwastes at hydrocarbon-contaminated sites – II. Screening of reference oils by stable carbon 11 \nisotope fingerprinting. Environ. Pollut. 94, 195-203. 12 \nWhittaker, M., Pollard, S.J.T., Risden, G. (1999) The fate of oil wastes in soil microcosms II: a 13 \nperformance assessment of source correlation indices. Sci. Tot. Env. 226, 23-34. 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 20\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \nTable 1. Chemical and physical properties of soil used in biotransformation study. 7 \n 8 \nTable 2. Variation in isotopic composition of individual compounds in ballast oil-treated and 9 \ncontrol soils (‰). 10 \n 11 \nTable 3. Variation in isotopic composition of individual compounds in crude oil-treated and 12 \ncontrol soils (‰). 13 \n 14 \nTable 4. Variation in isotopic composition of individual compounds in No.6 Fuel Oil-treated and 15 \ncontrol soils (‰). 16 \n 17 \nFig. 1. Ratios of abiotic (control) to biotic (treated – control) % contributions toSEM variations 18 \nfor (a) ballast oil microcosms, (b) crude oil microcosms, (c) No.6 fuel oil microcosms. 19 \n 20 \nFig. 2. Variation in n-alkane and norpristane isotope ratios (δ13C) for (a) ballast oil microcosms, 21 \n(b) crude oil microcosms, (c) No.6 fuel oil microcosms; where ◊ represents C14 (or C16 in the 22 \ncase of No6 fuel oil); \u0013 represents C17; U represents C18; \u0084 represents C24; { represents C26; 23 \nand z represents norpristane. 24 \n 21\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \nTable 1 7 \n 8 \nSoil sampling details \n \n \nParticle size analysis \n(% w\/w) \nSoil analysis \n \nSoil texture  Sandy clay loam \nClay \n(<0.002 mm) \n \n21.5 \npH (H20) \n \n6.0 \n \nSampling date 17th June 1995 Silt (0.002 – 0.063 mm) \n21.2 \n \nAvailable P \n(μg g-1) \n10.0 \n \nLand use Conservation beds in arboretum \nTotal sand \n(0.063 – 2.000 mm) 57.2 \nAvailable K \n(μg g-1) 60.0 \nSampling depth 0 – 26 cm Very fine sand (0.063 – 0.250 mm) 16.0 CEC 13.1 \nSoil type Non-calcareous gley \nFine sand \n(0.125 – 0.500 mm) 23.6 \nN \n(mg g-1) 4.0 \nPrevious \nagricultural use None for 8 years \nMedium sand \n(0.250 – 0.500) 12.3 \nField capacity moisture \ncontent (%) 38.7 \n  Coarse sand (0.500 – 1.000 mm) 4.7 \nOrganic Matter \n(%) 5.9 \n  Very coarse sand (1.000 – 2.000 mm) 0.7   \n 9 \n 10 \n 11 \n 12 \n 13 \n 22\n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 23\n C14   C17 \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -29.16   -29.16    0 -29.23 -29.21 -29.84 -29.43 0.36  \n2 -29.14 -32.05 -31.26 -30.82 1.50 -28.75  2 -29.84 -29.47 -30.27 -29.86 0.40 -29.65 \n4 -29.09  -28.83 -28.96 0.18 -28.98  4  -29.69 -29.83 -29.76 0.10 -29.69 \n8 -27.35   -27.35  -29.55  8  -29.46 -29.96 -29.71 0.35 -29.74 \n16 -29.26 -28.77  -29.02 0.35   16 -29.68 -29.59 -30.21 -29.83 0.34  \n32 \n \n  -28.37 -28.45 -28.41 0.06   32 -29.76 -29.32 -29.21 -29.43 0.29  \n64        64      -30.04 \n128   -28.44 -28.44    128  -29.30 -30.01 -29.66 0.50 -30.15 \n256      -29.14  256 -30.14 -29.83 -29.30 -29.76 0.42 -29.14 \n               \n               \n C18   C24 \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -29.02 -28.95 -29.23 -29.07 0.15   0 -29.13 -28.76 -29.49 -29.13 0.37  \n2 -29.84 -29.59 -29.51 -29.65 0.17 -29.55  2 -29.98 -30.30 -29.97 -30.08 0.19 -28.82 \n4 -31.26 -29.69 -29.72 -30.22 0.90 -29.82  4 -32.49 -29.40 -29.30 -30.40 1.81 -29.21 \n8  -29.64 -29.99 -29.82 0.25 -29.72  8 -29.22  -29.37 -29.30 0.11 -29.42 \n16 -29.65 -29.54 -30.07 -29.75 0.28   16 -29.25 -28.86 -29.79 -29.30 0.47  \n32 -29.74 -29.17 -29.17 -29.36 0.33   32 -29.51 -28.88 -28.64 -29.01 0.45  \n64  -27.73  -27.73  -29.78  64   -28.87 -28.87  -29.11 \n128 -29.01 -29.98  -29.50 0.69 -29.96  128 -28.07 -29.43 -28.98 -28.83 0.69 -29.07 \n256 -29.92 -29.61 -29.08 -29.54 0.42 -29.28  256 -29.24 -29.35  -29.30 0.08 -28.7 \n               \n               \n C26   Norpristane \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -29.37 -28.86 -29.17 -29.13 0.26   0 -29.01 -28.57  -28.79 0.31  \n2 -30.00 -30.58 -30.51 -30.36 0.32 -28.92  2 -28.92 -28.65 -28.90 -28.82 0.15 -28.73 \n4 -30.60 -29.51 -29.49 -29.87 0.64 -28.96  4 -28.57 -28.68  -28.63 0.08 -28.96 \n8 -29.32   -29.32    8 -28.42 -28.39 -28.87 -28.56 0.27 -28.81 \n16 -29.52   -29.52    16 -28.57 -28.48 -29.10 -28.72 0.34  \n32        32 -28.45 -27.89  -28.17 0.40  \n64   -28.89 -28.89  -28.76  64   -28.44 -28.44   \n128 -28.19 -29.35 -29.06 -28.87 0.60 -29.10  128  -28.48 -28.48 -28.48 0.00 -28.72 \n256 -28.97 -29.21  -29.09 0.17 -28.95  256 -29.21 -28.92  -29.07 0.21 -28.22 \n \nTable 2 \n \n \n 24\nC14   C17 \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -28.32 -28.57  -28.45 0.18   0 -28.35 -28.60  -28.48 0.18  \n2 -27.96 -28.88  -28.42 0.65 -27.39  2 -28.29   -28.29  -27.35 \n4 -28.27 -28.58 -28.63 -28.49 0.20 -27.11  4 -27.94 -28.36 -28.36 -28.22 0.24 -27.44 \n8 -27.05 -27.56 -27.63 -27.41 0.32 -26.87  8  -27.18 -27.33 -27.26 0.11 -27.12 \n16 -27.21 -27.40 -27.79 -27.47 0.30   16 -27.26 -27.40 -27.45 -27.37 0.10  \n32 -27.71 -28.20 -29.34 -28.42 0.84   32 -27.22 -28.04 -28.53 -27.93 0.66  \n64 -29.72 -30.34 -31.04 -30.37 0.66   64 -29.92 -29.99 -30.58 -31.16 0.36  \n128 -28.75 \n \n-29.07 -26.36 -28.06 1.48   128 -28.55 -29.10 -27.32 -28.32 0.91  \n256  -27.27 -26.72 -27.00 0.39 -26.91  256 -27.05 -26.84 -26.48 -26.79 0.29 -27.08 \n               \n               \n C18   C24 \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -28.46 -28.43  -28.45 0.02   0 -28.68 -28.25  -28.47 0.30  \n2 -27.47 -28.27  -27.87 0.57 -27.08  2 -28.67 -28.88  -28.78 0.15 -27.32 \n4 -27.88 -28.08 -28.43 -28.13 0.28 -27.28  4 -28.15 -28.50 -29.33 -28.66 0.61 -27.57 \n8 -26.15 -27.12 -27.06 -26.78 0.54 -26.87  8 -27.11 -27.65 -27.41 -27.39 0.27 -26.96 \n16 -26.98 -27.55 -27.56 -27.36 0.33   16 -27.32 -27.73 -27.68 -27.58 0.22  \n32 -27.05 -27.78 -28.38 -27.74 0.67   32 -27.73 -28.07 -28.90 -28.23 0.60  \n64 -28.97 -29.93 -30.52 -29.81 0.78   64 -29.04 -29.90 -30.77 -29.90 0.87  \n128 -28.11 -28.93 -27.03 -28.02 0.95   128 -28.45 -28.97 -26.85 -28.09 1.10  \n256 -26.90 -26.54 -26.27 -26.57 0.32 -27.11  256  -26.78 -26.29 -26.54 0.35 -27.21 \n               \n               \n C26   Norpristane \nTime n1 n2 n3  Mean δ13C SD Control  Time n1 n2 n3  Mean δ13C SD Control \n0 -28.65 -28.74  -28.70 0.06   0 -27.80 -27.90  -27.85 0.07  \n2 -29.53 -29.54  -29.54 0.01 -27.59  2 -28.13 -28.94  -28.54 0.57 -27.04 \n4 -28.62 -28.52 -30.02 -29.05 0.84 -27.65  4 -28.42 -28.63 -28.80 -28.62 0.19 -27.09 \n8 -27.82 -28.11 -27.83 -27.92 0.16 -27.49  8 -27.09 -27.73 -27.61 -27.48 0.34 -26.61 \n16 -27.69 -28.21 -28.00 -27.97 0.26   16 -27.41 -27.41 -27.92 -27.58 0.29  \n32 -28.34 -28.41 -29.11 -28.62 0.43   32 -27.72 -28.21 -29.02 -28.32 0.66  \n64 -29.29 -29.81 -30.19 -29.76 0.45   64 -29.92 -30.39 -31.27 -30.53 0.69  \n128 -28.69 -29.06 -27.08 -28.28 1.05   128 -28.61  -26.46 -27.54 1.52  \n256      -27.44  256      -27.24 \nTable 3 1 \n 25\n C16   C17 \nTime n1 n2 n3  Mean d13C SD Control  Time n1 n2 n3  Mean d13C SD Control \n0 -27.15 -27.25 -26.60 -27.00 0.35   0 -27.46 -26.30  -26.88 0.82  \n2 -28.25  -27.29 -27.77 0.68   2 -28.17 -26.97 -27.51 -27.55 0.60 -28.37 \n4  -27.48  -27.48 0.00   4 -27.88 -27.67  -27.78 0.15 -27.68 \n8 -26.97 -27.14  -27.06 0.12 -27.39  8 -27.27 -27.45  -27.36 0.13 -27.59 \n16 -27.91 -27.92  -27.92 0.01   16  -27.99 -28.17 -28.08 0.13  \n32 -26.89 -28.26  -27.58 0.97   32 -27.57 -27.89  -27.73 0.23  \n64 -27.80 -28.47  -28.14 0.47   64 -28.07 -28.28  -28.18 0.15  \n128 -27.04 -27.25 \n \n-27.13 -27.14 0.11   128 -27.32 -27.49 -27.54 -27.45 0.12  \n256   -27.16 -27.16  -26.91  256  -28.31 -27.52 -27.92 0.56 -27.64 \n               \n C18   C24 \nTime n1 n2 n3  Mean d13C SD Control  Time n1 n2 n3  Mean d13C SD Control \n0 -28.61 -27.33 -27.79 -27.91 0.50   0 -27.75 -27.38  -27.57 0.26  \n2 -27.89 -26.89 -27.32 -27.37 0.50 -27.80  2  -27.24 -27.90 -27.57 0.47  \n4 -27.07 -27.40  -27.24 0.23 -27.48  4 -28.19 -27.97  -28.08 0.16  \n8 -27.05 -27.44  -27.25 0.28 -27.44  8  -27.61 -27.51 -27.56 0.07 -27.82 \n16 -27.97 -28.06  -28.02 0.06   16 -28.06 -28.13  -28.10 0.05  \n32 -27.24 -27.84 -27.33 -27.47 0.32   32 -27.41 -27.85 -27.35 -27.54 0.27  \n64 -28.06 -28.12  -28.09 0.04   64 -27.72 -27.85  -27.79 0.09  \n128 -27.32 -27.93 -27.56 -27.60 0.31   128 -27.48 -27.75 -27.82 -27.68 0.18  \n256  -28.31 -27.43 -27.87 0.62 -27.60  256   -27.60 -27.60  -27.37 \n               \n C26   Norpristane \nTime n1 n2 n3  Mean d13C SD Control  Time n1 n2 n3  Mean d13C SD Control \n0 -27.74 -27.54  -27.64 0.14   0 -28.01 -27.35 -27.53 -27.63 0.34  \n2  -27.28 -27.63 -27.46 0.25   2 -28.00 -26.97 -27.31 -27.43 0.52  \n4  -27.83  -27.83    4 -27.41 -27.52  -27.47 0.08  \n8 -27.51 -27.27  -27.39 0.17 -27.71  8 -27.06 -27.15  -27.11 0.06 -27.20 \n16 -28.24 -26.69  -27.47 1.10   16 -27.41 -27.65  -27.53 0.17  \n32 -27.34 -28.11 -27.58 -27.68 0.39   32 -27.17 -27.53 -27.71 -27.47 0.27  \n64 -27.76 -27.93  -27.85 0.12   64 -27.56 -27.38  -27.47 0.13  \n128 -27.24 -27.65 -27.60 -27.50 0.22   128 -27.24 -27.26 -27.19 -27.23 0.04  \n256   -27.73 -27.73  -27.53  256 -26.87  -27.12 -27.00 0.18 -26.96 \n 1 \nTable 4 2 \n 26\n 1 \n(a) ballast oil\n0\n0.5\n1\n1.5\n2\n0 2 4 8 16 32 64 128 256\nTime (days)\nR\nat\nio\n o\nf %\n w\n\/w\n lo\nss\n o\nf \nSE\nM\n (A\nbi\not\nic\n:B\nio\ntic\n)\n 2 \n 3 \n(b) crude oil\n-10\n-5\n0\n5\n10\n15\n20\n25\n0 2 4 8 16 32 64 128 256\nTime (days)\nR\nat\nio\n o\nf %\n w\n\/w\n lo\nss\n o\nf \nSE\nM\n (A\nbi\not\nic\n:B\nio\ntic\n)\n 4 \n(c) No.6 fuel oil\n-0.5\n0\n0.5\n0 2 4 8 16 32 64 128 256\nTime (days)\nR\nat\nio\n o\nf %\n w\n\/w\n lo\nss\n o\nf \nSE\nM\n (A\nbi\not\nic\n:B\nio\ntic\n)\n 5 \nFigure 1 6 \n 7 \n 8 \n 9 \n 27\n(a) ballast oil\n-33\n-32\n-31\n-30\n-29\n-28\n-27\n-26\n0 2 4 8 16 32 64 128 256\nTime (days)\nIs\not\nop\ne \nra\ntio\n (%\n)\n1 \n(b) crude oil\n-33\n-32\n-31\n-30\n-29\n-28\n-27\n-26\n0 2 4 8 16 32 64 128 256\nTime (days)\nIs\not\nop\ne \nra\ntio\n (%\n)\n2 \n(c) No.6 fuel oil\n-33\n-32\n-31\n-30\n-29\n-28\n-27\n-26\n0 2 4 8 16 32 64 128 256\nTime (days)\nIs\not\nop\ne \nra\ntio\n (%\n)\nFigure 2 3 \n"}