{"doi":"10.5194\/angeo-23-135-2005","coreId":"71147","oai":"oai:eprints.lancs.ac.uk:6653","identifiers":["oai:eprints.lancs.ac.uk:6653","10.5194\/angeo-23-135-2005"],"title":"Comparison of the characteristic energy of precipitating electrons derived from ground-based and DMSP satellite data","authors":["Ashrafi, M.","Kosch, M. J.","Honary, F."],"enrichments":{"references":[{"id":16377853,"title":"A new digital all-sky imager for optical auroral studies in conjunction with the Scandinavian twin auroral radar experiment,","authors":[],"date":"1998","doi":"10.1063\/1.1148697","raw":"Kosch, M. J., Hagfors, T., and Nielsen, E.: A new digital all-sky imager for optical auroral studies in conjunction with the Scandinavian twin auroral radar experiment, Rev. Sci. Instrum., 69, 578–584, 1998a.","cites":null},{"id":16377845,"title":"A statistical model of auroral electron precipitation,","authors":[],"date":"1985","doi":"10.1029\/ja090ia05p04229","raw":"Hardy, D. A., Gussenhoven, M. S., and Holeman, E.: A statistical model of auroral electron precipitation, J. Geophys. Res., 90, 4229–4248, 1985.","cites":null},{"id":16377831,"title":"A.: The aurorally associated absorption of cosmic noise at college,","authors":[],"date":"1964","doi":"10.1029\/jz069i021p04493","raw":"Ansari, Z. A.: The aurorally associated absorption of cosmic noise at college, Alaska, J. Geophys. Res., 69, 4493–4513, 1964.","cites":null},{"id":16377835,"title":"An imaging riometer for ionospheric studies,","authors":[],"date":"1995","doi":"10.1049\/ecej:19950505","raw":"Browne, S., Hargreaves, J. K., and Honary, B.: An imaging riometer for ionospheric studies, Electron. Commun., 7(5), 209–217, 1995.","cites":null},{"id":16377846,"title":"Auroral absorption of HF radio waves in the ionosphere: A review of results from the ﬁrst decade of riometry,","authors":[],"date":"1969","doi":"10.1109\/proc.1969.7275","raw":"Hargreaves, J. K.: Auroral absorption of HF radio waves in the ionosphere: A review of results from the ﬁrst decade of riometry, Proceedings of the IEEE, 57, 1348–1373, 1969.","cites":null},{"id":16377866,"title":"Auroral electron energy derived from ratio of spectroscopic emissions, 1. Model computations,","authors":[],"date":"1974","doi":"10.1029\/ja079i034p05181","raw":"Rees, M. H. and Luckey, D.: Auroral electron energy derived from ratio of spectroscopic emissions, 1. Model computations, J. Geophys. Res., 79, 5181–5186, 1974.","cites":null},{"id":16377861,"title":"Auroral electron energy spectra,","authors":[],"date":"1968","doi":"10.1029\/ja073i007p02325","raw":"Ogilvie, K. W.: Auroral electron energy spectra, J. Geophys. Res., 73, 2325–2332, 1968.","cites":null},{"id":16377863,"title":"Auroral ionisation and excitation by incident energetic electrons,","authors":[],"date":"1963","doi":"10.1016\/0032-0633(63)90252-6","raw":"Rees, M. H.: Auroral ionisation and excitation by incident energetic electrons, Planet. Space Sci., 11, 1209–1218, 1963.","cites":null},{"id":16377834,"title":"Auroral ionospheric conductances during disturbed conditions,","authors":[],"date":"1989","doi":"10.1016\/0273-1177(89)90336-0","raw":"Brekke, A., Hall, C., and Hansen, T. L.: Auroral ionospheric conductances during disturbed conditions, Ann. Geophys., 7, 269– 280, 1989.","cites":null},{"id":16377848,"title":"Auroral luminosity and absorption of cosmic radio noise,","authors":[],"date":"1962","doi":"10.1016\/0021-9169(62)90210-6","raw":"Holt, O. and Omholt, A.: Auroral luminosity and absorption of cosmic radio noise, J. Atmos. Terr. Phys., 24, 467–474, 1962.","cites":null},{"id":16377837,"title":"Auroral radio absorption as an indicator of magnetospheric electrons and of conditions in the disturbed auroral D-region,","authors":[],"date":"1984","doi":"10.1016\/0021-9169(84)90041-2","raw":"Collis, P. N., Hargreaves, J. K., and Korth, A.: Auroral radio absorption as an indicator of magnetospheric electrons and of conditions in the disturbed auroral D-region, J. Atmos. Terr. Phys., 46, 21–38, 1984.","cites":null},{"id":16377883,"title":"Auroral spectroscopy and thermosphere, in: Auroral Physics, edited by:","authors":[],"date":"1991","doi":null,"raw":"Vallance-Jones, A. V.: Auroral spectroscopy and thermosphere, in: Auroral Physics, edited by: Meng, C. I., Rycroft, M. J., and Frank, L. A., Cambridge University Press, 15, 1991. Vickery, J. F., Vondrak, R. R., and Matthews, S. J.: The diurnal latitudinal variations of auroral zone ionospheric conductivity, J.","cites":null},{"id":16377880,"title":"C.: The Polar Aurora,","authors":[],"date":"1955","doi":null,"raw":"St¨ ormer, C.: The Polar Aurora, Oxford University Press, 1955.","cites":null},{"id":16377885,"title":"Comparison of incoherent scatter radar and photometric measurements of the energy distribution of auroral electrons,","authors":[],"date":"1978","doi":"10.1029\/ja083ia04p01665","raw":"Vondrak, R. R. and Sears, R. D.: Comparison of incoherent scatter radar and photometric measurements of the energy distribution of auroral electrons, J. Geophys. Res., 83, 1665–1667, 1978.","cites":null},{"id":16377832,"title":"Coordinated measurements of auroral absorption and luminosity using the narrow beam technique,","authors":[],"date":"1968","doi":"10.1029\/ja073i001p00319","raw":"Berkey, F. T.: Coordinated measurements of auroral absorption and luminosity using the narrow beam technique, J. Geophys. Res., 73, 319–337, 1968.","cites":null},{"id":16377879,"title":"Cosmic radio noise absorption related to structures in auroral luminosity,","authors":[],"date":"1997","doi":"10.1029\/96ja03493","raw":"Stoker, P. H., Mathews, M. J., and Scourﬁeld, M. W. J.: Cosmic radio noise absorption related to structures in auroral luminosity, J. Geophys. Res., 102, 7439–7447, 1997.","cites":null},{"id":16377882,"title":"Deducing composition and incident electron spectra from ground-based auroral optical measurements: Theory and model results,","authors":[],"date":"1989","doi":"10.1029\/ja094ia10p13527","raw":"Strickland, D. J., Meier, R. R., Hecht, J. H., and Christensen, A. B.: Deducing composition and incident electron spectra from ground-based auroral optical measurements: Theory and model results, J. Geophys. Res., 94, 13527–13539, 1989.","cites":null},{"id":16377877,"title":"Electron auroral excitation efﬁciencies and intensity ratios,","authors":[],"date":"1990","doi":"10.1029\/ja095ia07p10321","raw":"Steele, D. P. and McEwen, D. J.: Electron auroral excitation efﬁciencies and intensity ratios, J. Geophys. Res., 95, 10321– 10336, 1990.","cites":null},{"id":16377871,"title":"Energetic particle precipitation into high-latitude ionosphere and the auroral electrojets, 3. Characteristics of electron precipitation into the morning sector auroral oval,","authors":[],"date":"1985","doi":"10.1029\/ja090ia08p07495","raw":"Rostoker, G., Kamide, Y., and Winningham, J. D.: Energetic particle precipitation into high-latitude ionosphere and the auroral electrojets, 3. Characteristics of electron precipitation into the morning sector auroral oval, J. Geophys. Res., 90, 7495–7504, 1985.","cites":null},{"id":16377855,"title":"Extrapolating EISCAT Pedersen conductances to other parts of the sky using groundbased TV auroral images,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-0583-y","raw":"Kosch, M. J., Hagfors, T., and Schlegel, K.: Extrapolating EISCAT Pedersen conductances to other parts of the sky using groundbased TV auroral images, Ann. Geophys., 16, 583–588, 1998, SRef-ID: 1432-0576\/ag\/1998-16-583.","cites":null},{"id":16377841,"title":"Height-integrated Pedersen and Hall conductivity patterns inferred from the TIROS-NOAA satellite data,","authors":[],"date":"1987","doi":"10.1029\/ja092ia07p07606","raw":"Fuller-Rowell, T. J. and Evans, D. S.: Height-integrated Pedersen and Hall conductivity patterns inferred from the TIROS-NOAA satellite data, J. Geophys. Res., 92, 7606–7618, 1987.","cites":null},{"id":16377857,"title":"High-resolution maps of the characteristic energy of precipitating auroral particles,","authors":[],"date":null,"doi":"10.1029\/2001ja900107","raw":"Kosch, M. J., Honary, F., del Pozo, C. F., Marple, S. R., and Hagfors, T.: High-resolution maps of the characteristic energy of precipitating auroral particles, J. Geophys. Res., 106, 28925– 28937, 2001a.","cites":null},{"id":16377874,"title":"Identiﬁcation of clouds and aurorae in optical data images,","authors":[],"date":"2003","doi":"10.1088\/1367-2630\/5\/1\/306","raw":"Seviour, R., Kosch, M., and Honary, F.: Identiﬁcation of clouds and aurorae in optical data images, New Journal of Physics, 5, 6.1–6.7, 2003.","cites":null},{"id":16377833,"title":"Incoherent scatter measurements of E-region conductivities and currents in the auroral zone,","authors":[],"date":"1974","doi":"10.1029\/ja079i025p03773","raw":"Brekke, A., Doupnik, J., and Banks, P.: Incoherent scatter measurements of E-region conductivities and currents in the auroral zone, J. Geophys. Res., 79, 3773–3790, 1974.","cites":null},{"id":16377842,"title":"Introduction to special section: Proton precipitation into the atmosphere,","authors":[],"date":"2001","doi":"10.1029\/2000ja002015","raw":"Galand, M.: Introduction to special section: Proton precipitation into the atmosphere, J. Geophys. Res., 106, 1–6, 2001.","cites":null},{"id":16377875,"title":"Investigations of ionospheric radio wave absorption processusingimagingriometertechniques,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00072-0","raw":"Stauning, P.: Investigations of ionospheric radio wave absorption processusingimagingriometertechniques, J.Atmos.Terr.Phys., 58, 753–764, 1996.","cites":null},{"id":16377838,"title":"Ion composition and effective ion recombination rate in the night-time auroral lower ionosphere,","authors":[],"date":"1919","doi":"10.1016\/s1364-6826(97)00033-3","raw":"del Pozo, C. F., Hargreaves, J. K., and Aylward, A. D.: Ion composition and effective ion recombination rate in the night-time auroral lower ionosphere, J. Atmos. Sol. Terr. Phys., 59, 1919– 1943, 1997.M. Ashraﬁ et al.: Electrons derived from ground-based and DMSP satellite data 145 del Pozo, C. F., Kosch, M. J., and Honary, F.: Estimation of the characteristic energy of electron precipitation, Ann. Geophys., 20, 1349–1359, 2002, SRef-ID: 1432-0576\/ag\/2002-20-1349.","cites":null},{"id":16377836,"title":"Ionospheric absorption at times of auroral and magnetic pulsations,","authors":[],"date":"1961","doi":"10.1029\/jz066i001p00025","raw":"Campbell, W. H. and Leinbach, H.: Ionospheric absorption at times of auroral and magnetic pulsations, J. Geophys. Res., 66, 25–34, 1961.","cites":null},{"id":16377840,"title":"Observations of charged particle precipitation in the auroral zone,","authors":[],"date":"1971","doi":"10.1029\/ja076i016p03612","raw":"Frank, L. A. and Ackerson, K. L.: Observations of charged particle precipitation in the auroral zone, J. Geophys. Res., 76, 3612– 3643, 1971.","cites":null},{"id":16377869,"title":"On calculating ionospheric conductances from the ﬂux and energy of precipitating electrons,","authors":[],"date":"1987","doi":"10.1029\/ja092ia03p02565","raw":"Robinson, R. M., Vondrak, R. R., Miller, K., Babbs, T., and Hardy, D.: On calculating ionospheric conductances from the ﬂux and energy of precipitating electrons, J. Geophys. Res., 92, 2565– 2569, 1987.","cites":null},{"id":16377865,"title":"Physics and Chemistry of the Upper Atmosphere,","authors":[],"date":"1989","doi":"10.1017\/cbo9780511573118.010","raw":"Rees, M. H.: Physics and Chemistry of the Upper Atmosphere, Cambridge University Press, 1989.","cites":null},{"id":16377844,"title":"Precipitating electron and ion detectors (SSJ\/4) for the block 5D\/ﬂights 6–10 DMSP satellites: Calibration and data presentation,","authors":[],"date":"1984","doi":null,"raw":"Hardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall, F. J., Yeh, H. C., Schumaker, T. L., Hube, A., and Pantazis, J.: Precipitating electron and ion detectors (SSJ\/4) for the block 5D\/ﬂights 6–10 DMSP satellites: Calibration and data presentation, Tech. Rep. AFGL-TR-84-0317, Air Force Geophysics Laboratory, Hanscom Airforce Base, MA, 1984.","cites":null},{"id":16377839,"title":"Precipitating electron ﬂuxes formed by a magnetic ﬁeld-aligned potential difference,","authors":[],"date":"1974","doi":"10.1029\/ja079i019p02853","raw":"Evans, D. S.: Precipitating electron ﬂuxes formed by a magnetic ﬁeld-aligned potential difference, J. Geophys. Res., 79, 2853– 2858, 1974.","cites":null},{"id":16377872,"title":"Simultaneous multispectral imaging of the discrete aurora,","authors":[],"date":"2001","doi":"10.1016\/s1364-6826(01)00074-8","raw":"Semeter, J., Lummerzheim, D., and Haerendel, G.: Simultaneous multispectral imaging of the discrete aurora, J. Atmos. Sol. Terr. Phys., 63, 1981–1992, 2001.","cites":null},{"id":16377843,"title":"Spatial and temporal relations between auroral emission and cosmic noise absorption,","authors":[],"date":"1969","doi":"10.1016\/0032-0633(69)90134-2","raw":"Gustafsson, G.: Spatial and temporal relations between auroral emission and cosmic noise absorption, Planet. Space Sci., 17, 1961–1975, 1969.","cites":null},{"id":16377859,"title":"The importance of conductivity gradients in ground-based ﬁeld-aligned current studies,","authors":[],"date":"2001","doi":"10.1016\/s0273-1177(01)00203-4","raw":"Kosch, M. J., Scourﬁeld, M. W. J., and Amm, O.: The importance of conductivity gradients in ground-based ﬁeld-aligned current studies, Adv. Space Res., 27, 1277–1282, 2001b. Newell, P. T.: Reconsidering the inverted-V particle signature: The relative frequency of large-scale electron acceleration events, J.","cites":null},{"id":16377851,"title":"The Skibotn CCD All-Sky Imager (SCASI) and real time networking onto the World Wide Web,","authors":[],"date":"1999","doi":null,"raw":"Kosch, M. J.: The Skibotn CCD All-Sky Imager (SCASI) and real time networking onto the World Wide Web, Tech. Rep. MPAET-010-99-12, Max-Planck-Institut f¨ ur Aeronomie, Lindau, Germany, 1999.","cites":null},{"id":16377847,"title":"The Solar-Terrestrial Environment,","authors":[],"date":"1995","doi":"10.1063\/1.2807625","raw":"Hargreaves, J. K.: The Solar-Terrestrial Environment, Cambridge University Press, 1995. Heppner, J. P., Byrne, E. C., and Belon, A. E.: The association of absorption and Es ionisation with aurora at high latitudes, J.","cites":null},{"id":16377850,"title":"The statistical dependence of auroral absorption on geomagnetic and solar wind parameters,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-877-2004","raw":"Kavanagh, A. J., Kosch, M. J., Honary, F., Senior, A., Marple, S. R., Woodﬁeld, E. E., and McCrea, I. W.: The statistical dependence of auroral absorption on geomagnetic and solar wind parameters, Ann. Geophys., 22, 877–887, 2004, SRef-ID: 1432-0576\/ag\/2004-22-877.","cites":null},{"id":16377868,"title":"Validation of techniques for space based remote sensing of auroral precipitation and its ionospheric effects,","authors":[],"date":"1994","doi":"10.1007\/bf02101699","raw":"Robinson, R. M. and Vondrak, R.: Validation of techniques for space based remote sensing of auroral precipitation and its ionospheric effects, Space Sci. Rev., 69, 331–407, 1994.","cites":null},{"id":16377849,"title":"Variations in energy spectrum of auroral electrons detected by simultaneous observation with photometer and riometer,","authors":[],"date":"1965","doi":"10.1016\/0032-0633(65)90072-3","raw":"Johansen, O. E.: Variations in energy spectrum of auroral electrons detected by simultaneous observation with photometer and riometer, Planet. Space Sci., 13, 225–235, 1965.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71147.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6653\/1\/art_639.pdf","pdfHashValue":"8c1e9960cb50daf4dfa1bc200376864b5b43282b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6653<\/identifier><datestamp>\n      2018-01-24T03:15:21Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Comparison of the characteristic energy of precipitating electrons derived from ground-based and DMSP satellite data<\/dc:title><dc:creator>\n        Ashrafi, M.<\/dc:creator><dc:creator>\n        Kosch, M. J.<\/dc:creator><dc:creator>\n        Honary, F.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2005-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6653\/1\/art_639.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-23-135-2005<\/dc:relation><dc:identifier>\n        Ashrafi, M. and Kosch, M. J. and Honary, F. (2005) Comparison of the characteristic energy of precipitating electrons derived from ground-based and DMSP satellite data. Annales Geophysicae, 23 (1). pp. 135-145. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6653\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-23-135-2005","http:\/\/eprints.lancs.ac.uk\/6653\/"],"year":2005,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2005) 23: 135–145\nSRef-ID: 1432-0576\/ag\/2005-23-135\n© European Geosciences Union 2005\nAnnales\nGeophysicae\nComparison of the characteristic energy of precipitating electrons\nderived from ground-based and DMSP satellite data\nM. Ashrafi, M. J. Kosch, and F. Honary\nDepartment of Communications Systems, Lancaster University, Lancaster, LA1 4WA, UK\nReceived: 15 December 2003 – Revised: 16 April 2004 – Accepted: 5 May 2004 – Published: 31 January 2005\nPart of Special Issue “Eleventh International EISCAT Workshop”\nAbstract. Energy maps are important for ionosphere-\nmagnetosphere coupling studies, because quantitative de-\ntermination of field-aligned currents requires knowledge of\nthe conductances and their spatial gradients. By combin-\ning imaging riometer absorption and all-sky auroral optical\ndata it is possible to produce high temporal and spatial reso-\nlution maps of the Maxwellian characteristic energy of pre-\ncipitating electrons within a 240×240 km2 common field of\nview. These data have been calibrated by inverting EIS-\nCAT electron density profiles into equivalent energy spec-\ntra. In this paper energy maps produced by ground-based\ninstruments (optical and riometer) are compared with DMSP\nsatellite data during geomagnetic conjunctions. For the pe-\nriod 1995–2002, twelve satellite passes over the ground-\nbased instruments’ field of view for the cloud-free condi-\ntions have been considered. Four of the satellite conjunctions\noccurred during moderate geomagnetic, steady-state condi-\ntions and without any ion precipitation. In these cases with\nMaxwellian satellite spectra, there is ∼71% agreement be-\ntween the characteristic energies derived from the satellite\nand the ground-based energy map method.\nKey words. Ionosphere (particle precipitation; ionosphere-\nmagnetosphere interaction; auroral ionosphere)\n1 Introduction\nPrecipitating auroral particles with different energies are de-\nposited at different altitudes where they excite atoms and\nmolecules which cause auroral optical emissions. Precipi-\ntating particles are also responsible for ionospheric radio ab-\nsorption.\nCorrelation between auroral luminosity and ionospheric\nradio absorption has been well known for many years\nCorrespondence to: M. Ashrafi\n(m.ashrafi@lancaster.ac.uk)\n(Heppner et al., 1952; Campbell and Leinbach, 1961). Holt\nand Omholt (1962) and Gustafsson (1969) found a good cor-\nrelation between the absorption and the intensity fluctuation\nof the auroral green line (557.7 nm). Ansari (1964) argued\nthat there is a peak-to-peak correspondence between absorp-\ntion fluctuations and intensity fluctuation of 557.7 nm in the\npre-midnight hours while a significant increase in the ratio\nof absorption to optical intensity in the post-midnight hours\nis an indication of a hardening of the primary precipitating\nelectron energy spectrum. Other studies include inferring\nthe energy spectrum of the auroral electrons using simul-\ntaneous measurements with photometers and riometers (Jo-\nhansen, 1965; Berkey, 1968). These observations, in con-\njunction with measurements from satellite and rocket exper-\niments, have shown auroral emissions and absorption relate\nto the flux and energy characteristics of auroral precipitating\nelectrons. This relationship has been examined both experi-\nmentally (Vondrak and Sears, 1978; Collis et al., 1984; Steele\nand McEwen, 1990; Robinson and Vondrak, 1994) and by\ncomputational modelling (Rees and Luckey, 1974). How-\never, all these studies were done with narrow fields of view.\nUsing imaging riometer and optical imager data, high-\nresolution maps of the characteristic energy of auroral par-\nticles were produced (Kosch et al., 2001a). This approach\nallows for the study of small-scale spatial and temporal mor-\nphology of the auroral particle energies over a wide field of\nview. The technique is important because it offers a new and\nquantitative way of viewing particle precipitation which in-\ncludes energy information.\nAssuming the same source population for hard and soft\nelectron precipitation, Kosch et al. (2001a) showed that the\ncharacteristic Maxwellian energy of precipitating electrons\nis a function of D-layer auroral absorption (riometer data)\ndivided by the square root of E-layer auroral optical in-\ntensity (557.7 nm data). Electron density height profiles\nfrom incoherent scatter radar data can be used with an at-\nmospheric model to estimate the spectrum of precipitating\n136 M. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data\nelectrons (del Pozo et al., 1997). EISCAT has been used\nto calibrate the characteristic energy of the precipitating\nelectrons derived from optical and absorption data for an\nassumed Maxwellian energy spectrum.\nIn this paper DMSP satellite data have been used to eval-\nuate the energy map method. On-board sensors of these\nsatellites provide a complete energy spectrum of the low\nenergy auroral particles. The data set consists of electron\nfluxes between 30 eV and 30 keV recorded every second. A\nMaxwellian distribution has been found to represent many\nobserved primary auroral spectra (Rees, 1989). By fitting this\ndistribution to satellite data the characteristic energy of auro-\nral electrons along the satellite track can be estimated every\nsecond. Similar statistical models have been generated from\nearly DMSP satellites to obtain global maps of the energy\nflux of auroral electron precipitation (Hardy et al., 1985). By\nmapping down the satellite geomagnetic coordinates into the\ncommon field of view of the imaging riometer and all-sky\nimager we compare the characteristic energy estimate from\nthe satellite data with that derived from the ground-based en-\nergy maps.\nTo understand magnetospheric-ionospheric coupling, tem-\nporal and spatial mapping of the ionospheric conductances is\nrequired. Ionospheric conductances and electric fields are\nneeded to derive the field-aligned current systems responsi-\nble for energy transfer between the magnetosphere and the\nionosphere. Therefore, considerable effort has been devoted\nto the estimation of the ionospheric conductances from mea-\nsurable geophysical parameters.\nKosch et al. (1998b) showed that, by using a TV auroral\nimager at 557.7 nm, one can obtain large spatial scale images\nwith high temporal and spatial resolution for estimating the\ndistribution of nocturnal ionospheric Pedersen conductance.\nThe method works because Pedersen conductance and the\n557.7-nm optical emission both maximise in the E-region.\nThe measurement was calibrated using EISCAT data at one\npoint and then applied to the camera’s entire field of view.\nHowever, measuring the Hall conductance is more difficult\nsince the Hall current occurs at lower altitudes and is there-\nfore much more dependent on the energy of the precipitating\nparticles (Kosch et al., 1998b). Having a precise map of the\nprecipitating electrons’ characteristic energy, it is possible to\ncalculate Hall conductance from the Pedersen conductance,\nknowing that the ratio of Hall to Pedersen conductance is an\nindication of the average energy (Vickery et al., 1981). In\naddition, it is well understood that computing field-aligned\ncurrents relies on electric field distributions, as well as Ped-\nersen and Hall conductances’ distribution and their spatial\ngradients. Kosch et al. (2001b) has shown that assuming\nspatially uniform conductances and ignoring the gradients\nleads to gross errors. Both ionospheric Hall and Pedersen\nconductances, as well as their gradients, can be calculated\nwith high temporal and spatial resolution using the ground-\nbased method as explained in greater detail in the following\nsections.\n2 Instrumentation\n2.1 DMSP\nThe DMSP (Defence Meteorological Satellite Program) sun-\nsynchronous satellites, with 101 min of near-polar orbits at a\nnominal altitude of 830 km, provide global monitoring of the\nsolar terrestrial environment. These satellites cover the entire\npolar region at least twice, and the equatorial region once a\nday. The SSJ\/4 sensor, which has been used in this study, is a\nprecipitating Electron and Ion Spectrometer, consists of four\ncurved plate electrostatic analysers which measure the flux of\ncharged particles with energies between 30 eV and 30 keV as\nthey flow past the spacecraft toward the Earth. The resulting\ncounts are converted into differential number flux. The satel-\nlites are three axis stabilised with particle detectors point-\ning toward local zenith, allowing precipitating electrons and\nions to enter through an aperture of 8◦ field of view (Hardy\net al., 1984). Each pair of high and low energy detectors\nconsist of 10 logarithmically-based energy channels which\ndwell on each channel for 0.09 s from high energy to low en-\nergies, such that once a second a complete spectrum over the\nentire energy range is produced (Hardy et al., 1985). The\nloss cone for polar orbiting satellites at DMSP altitudes is\n∼50◦ and the SSJ\/4 provide measurements within pitch an-\ngles<16◦, which means that, at the latitudes of the interest to\nthe present research, only particles well within the loss cone\nare observed. The measured spectra are the average of the\nreal spectra within the loss cone at the DMSP altitude.\n2.2 IRIS\nData from Imaging Riometer for Ionospheric Studies (IRIS)\nat 69.05◦ N, 28.79◦ E, northern Finland, have been used for\nproducing energy maps. IRIS records ionospheric absorp-\ntion of cosmic noise at 38.2 MHz measured by its 49 beams\nevery second. Primary auroral particles with energies be-\ntween a few tens keV and a few hundred keV cause iono-\nspheric radio wave absorption at the D-region, with a peak\nof absorption around 90 km (Hargreaves, 1995). The pro-\njection of IRIS beams at this height spans an area of\n67.8◦–70.2◦ N and 17.75◦–23.75◦ E, which covers approxi-\nmately 240×240 km2. IRIS is capable of producing absorp-\ntion images with 1-s temporal resolution continuously with\na sensitivity of ∼0.01 dB. A detailed description of imaging\nriometer techniques and IRIS characteristics can be found in\nStauning (1996) and Browne et al. (1995), respectively.\n2.3 DASI\nThe Digital All-Sky Imager (DASI) (Kosch et al., 1998a) lo-\ncated at 69.35◦ N and 20.36◦ E, northern Norway, is an au-\ntomatic low-light-level television camera system coupled to\na telecentric all-sky lens producing integrated optical images\nevery 10 s. DASI operates only during the winter and for\nall dark and moon-free periods. Most of the auroral lumi-\nnosity is due to the green-light emission at 557.7 nm from\nthe 1S state of atomic oxygen (Vallance-Jones, 1991), with a\nM. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data 137\nmaximum intensity at around 100–110 km altitude (Sto¨rmer,\n1955). DASI uses a narrow band (2.5 nm) interference filter\nat 557.7 nm and is calibrated in Rayleighs. The circular all-\nsky projection at 100 km altitude is transformed to an area of\n67.6◦–72.6◦ N and 13.5◦–26.0◦ E, which covers a square of\n520×520 km2 with a spatial resolution of 10×10 km2.\n2.4 SCASI\nTo ensure that DASI measures the real optical intensity, the\nSkibotn CCD All-Sky Imager, SCASI (Kosch, 1999) has\nbeen used for cloud cover detection. SCASI is a slow-scan\nCCD imager with an all-sky dual mirror system which takes\na full spatial resolution image in white light with a 30 s expo-\nsure every 3 min. Computer algorithms automatically assess\nSCASI image data and determine cloud free periods (Seviour\net al., 2003).\n3 Background theory\nAccording to Ohm’s law the height integrated ionospheric\ncurrent (J) can be written as:\nJ = 6PE +6H (Bˆ ×E) , (1)\nwhere E is the electric field vector and Bˆ is the magnetic\nfield vector in the direction of the Earth’s magnetic field.\n6P and 6H are the Pedersen and Hall conductances, re-\nspectively, height integrated between 90 and 170 km (Brekke\net al., 1974). Assuming a vertical magnetic field we compute\nfield-aligned currents (J‖) as follows:\nJ‖ = divJ = div(6PE)+ div(6H (zˆ×E)) . (2)\nRearranging and assuming that E is a curl-free electric field,\ngives:\nJ‖ = 6P divE +56P .E +56H .(zˆ×E) . (3)\nThe important consequence of this equation is that J‖ is de-\ntermined by ionospheric conductances and electric fields.\nOne straight-forward description is that auroral precipitat-\ning particles are responsible for producing auroral emissions\nas well as enhanced ionisation in the upper atmosphere and\ntherefore ionospheric conductivity. In addition, particle pre-\ncipitation results in conductivity gradients, which can be\nhighly variable in time and occur in small-scale structures\n(e.g. 1–20 km). The electric fields in the immediate vicinity\nof auroral precipitation are strongly modified by these con-\nductance variations. Measurements of electric fields, cur-\nrents and conductivities covering a large area in the iono-\nsphere with high spatial resolution are not easily possible.\nUsing energetic electron fluxes measured by instruments\ncarried by polar orbiting satellites, Robinson et al. (1987) and\nFuller-Rowell and Evans (1987) derived height-integrated\nHall and Pedersen conductivities. Auroral zone conduc-\ntances can be estimated from the energy flux and average en-\nergy of precipitating electrons (Robinson et al., 1987). Em-\npirical equations relating the Hall and Pedersen conductances\nto the average energy (E¯) and energy flux (φE in ergs\/cm2s)\nare as follows:\n6P = 40E¯16+ E¯2φE\n1\/2 (4)\n6H\n6P\n= 0.45(E¯)0.85 . (5)\nHowever, satellite methods cannot provide sufficient spatial\ncoverage on demand to study the highly dynamic auroral\nstructures. The method of characteristic energy maps, de-\nscribed below in more detail, solves this problem. Equa-\ntion (5) reinforces the notion, introduced before, that esti-\nmating the precipitating particle energy will yield the Hall\nconductance, provided the Pedersen conductance is known,\nwhich is possible according to the earlier work described by\nKosch et al. (1998b).\nPrimary auroral electrons can have a wide range of en-\nergy distributions. The energy spectra can be complex due to\nthe nature of various particle acceleration mechanisms in the\nmagnetosphere. However, many remote sensing techniques\nhave suggested that it is sufficient to approximate the spectra\nby:\nF(E) = Eγ exp(−E\/E0) (6)\nin which E0 is known as characteristic energy (Rees, 1989).\nFor γ=0, Eq. (6) gives a exponential function, whereas γ=1\ndescribes a Maxwellian and γ≥2 is a modified power-law.\nAn isotropic pitch angle Maxwellian velocity distribution\nproduces a Maxwellian energy distribution while an uni-\ndirectional Maxwellian velocity distribution with a very nar-\nrow pitch angle dispersion produces the exponential energy\nspectrum (del Pozo et al., 2002). The so-called modified\npower law is caused by an electron population in the tail of\nthe Maxwellian energy distribution which has been acceler-\nated along the field lines after the particle pitch angle was\nalready in the loss cone (Rostoker et al., 1985). Ignoring\nthe low energy part of the spectrum (typically <1 keV) for\nthe Maxwellian leads to an exponential spectrum. The elec-\ntron fluxes less than 100 eV consist of secondary electrons\nwhose spectra are more likely to be described by a power-law\n(Ogilvie, 1968; Frank and Ackerson, 1971). In this paper we\nhave assumed a Maxwellian spectrum for the DMSP satellite\nelectron flux data in order to be consistent with the assump-\ntion made in producing the ground-based energy maps by\nKosch et al. (2001a), which has been described in detail by\nthese authors.\nIn producing energy maps with the data from IRIS and\nDASI, the electron continuity equation in the E-region is:\ndNe\ndt\n= Qp +Qs − αN2e − div(Ne.v¯) , (7)\n(Brekke et al., 1989), where Ne is the electron density, Qp is\nthe ion production rate due to auroral precipitation, Qs is the\nion production rate due to solar radiation, v¯ is the electron\nbulk velocity and α is the effective ion recombination coef-\nficient. For nighttime (Qs=0) under steady-state conditions\n138 M. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data\nTable 1. DMSP satellite conjunctions.\n(1) (2) (3) (4) (5) (6 ) (7) (8)\nTime(UT)- Ion Aurora No. of satellite Satellite-ground-\nDate Duration DMSP Kp precipitation steady state spectra below based disagreement\nthreshold (0.5)\n18 Feb. 1995 18:26:13–31 s F12 3 Y N 90% 236%\n16 Oct. 1996 18:29:21–29 s F12 2 Y Y 93% 35%\n7 Jan. 1997 18:36:07–29 s F12 2+ Y N 52% 304%\n9 Feb. 1997 18:40:46–30 s F12 5+ N N 26% 27%\n6 Nov. 1997 17:35:32–31 s F14 4 N N 16% 164%\n22 Nov. 1997 17:39:59–30 s F14 4+ N N 47% 186%\n19 Feb. 1998 18:25:40–30 s F12 2+ Y Y 53% 428%\n6 Dec. 1999 17:59:27–27 s F12 3 N Y 30% 31%\n6 Jan. 2000 18:20:18–31 s F15 3 N Y 61% 21%\n28 Nov. 2000 15:19:46–32 s F13 4+ Y Y 50% 104%\n1 Dec. 2000 18:42:28–31 s F15 1− Y N 52% 107%\n23 Jan. 2001 17:11:08–31 s F12 3+ N Y 97% 49%\n( dNe\ndt\n=0) and negligible transport (Ne.v¯=0), Qp relates to the\nsquare of the electron density:\nQp = αN2e . (8)\nSince auroral optical luminosity (I ) is proportional to Qp:\nNe ∝\n√\nI . (9)\nHeight integrated ionospheric absorption (A) depends on D-\nregion electron density, as well as electron collision fre-\nquency (Hargreaves, 1969). To first order D-region auroral\nabsorption is proportional to electron density:\nA(dB) ∝ Ne . (10)\nElectrons with energies EA>25 keV deposit in the D-region\n(below∼95 km), and electrons with energiesEI<15 keV de-\nposit in the E-region (above∼100 km). Knowing that the ion\nproduction rate (Qp) is proportional to the flux of precipi-\ntating particles (F ) (Rees, 1963) and assuming that the same\nsource population for both electron precipitation causes the\nauroral absorption and auroral luminosity, the ratio of ab-\nsorption over square root of the optical intensity is an energy\nindicator for the precipitating electrons (Kosch et al., 2001a):\nA√\nI\n∝ Ne(H < 96 km)\nNe(H > 101 km)\n∝\n√\nF(E > 25 keV)√\nF(E < 15 keV)\n. (11)\nSubstituting Eq. (6)\n(\nA√\nI\n=\n√\nF(E)A√\nF(E)I\n=\n√\nkAEAe\n−EA\/E0√\nkIEI e\n−EI \/E0\n)\nand ap-\nplying the logarithm to the Eq. (11):\nln(\nA√\nI\n) = 1\n2\nln(\nkA\nkI\n)+ 1\n2\nln(\nEA\nEI\n)+ EI − EA\n2\n1\nE0\n, (12)\nwhich is a linear equation (Y=C+MX) where X= 1\nE0\n. The\nfactor 12 on the right-hand side of Eq. (12) corrects an er-\nror in Eq. (13) of Kosch et al. (2001a). Within the IRIS and\nDASI common field of view, using absorption images from\nthe IRIS riometer and optical images from the DASI imager,\nterm Y has been calculated. E0 can be estimated from EIS-\nCAT by inverting its electron density profile into equivalent\nenergy spectra at one point in the sky, thereby giving X.\nKnowing X and Y from Eq. (12) and using a least-squares\nfitting to a scatter plot of ln\n(\nA√\nI\n)\nvs. 1\nE0\n, the unknown terms\nC and M have been determined. By applying these two pa-\nrameters to Eq. (12) in the common field of view of DASI\nand IRIS, high-resolution ground-based maps of characteris-\ntic energy have been obtained.\n4 Data description and analysis\nThe data discussed in this study were selected from all the\npossible DMSP geomagnetic conjunctions within the IRIS\nand DASI common field of view for all cloud-free peri-\nods during 1995–2002 (Table 1). Geomagnetic conjunction\noccurs when the satellite ephemeris in corrected geomag-\nnetic coordinates for the magnetic field line passing through\nthe satellite is within the ground-based instruments’ field of\nview in corrected geomagnetic coordinates. The IGRF-2000\nmodel has been employed for calculating geomagnetic coor-\ndinates. DASI, with its 520×520 km2 field of view includes\nthe IRIS field of view of 240×240 km2 (Fig. 1); therefore,\nthe energy maps have been produced within the IRIS and\nDASI common field of view with 10×10 km2 and 10-s reso-\nlution. The satellite spatial and temporal resolution is about\n0.06◦ of orbit, corresponding to 7.5 km in the ionosphere,\nand 1 s, respectively. The data presented here is either from\nthe F12 or F15 DMSP satellites. F12 is oriented roughly\nin 09:30–21:30 LT, and F15 in the 10:30–22:30 LT merid-\nian. Data from 12 different conjunctions investigated in this\nstudy are shown in Table 1. Columns 1–4 give the date, time,\nM. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data 139\nFig. 1. A geographic map of northern Scandinavia showing the field of view of the Digital All-Sky Imager (DASI) processed data (large\ntrapezium), the field of view of the Imaging Riometer for Ionospheric Studies (IRIS) processed data (small trapezium), the IRIS beam pattern\nprojected up to 90 km altitude (ellipses), and the EISCAT radar’s position projected up the magnetic field line to 100 km altitude.\nduration of the pass, DMSP satellite number and Kp value\nduring the conjunction, respectively. Column 5 gives an in-\ndication whether significant proton flux was present in the\nDMSP data (i.e. proton flux with 1–2 orders of the magni-\ntude of the electron flux). Column 6 gives a subjective esti-\nmate as to whether the aurora within the DASI field of view\nwere steady state or not. This relates to the validity of the\nsteady-state assumption of Eq. (7).\nIn order to evaluate the goodness of fit to the satellite spec-\ntra, we have calculated the mean fractional difference be-\ntween the satellite flux data and its Maxwellian fit for each\nsecond of the satellite spectra. Assuming FOi is the satellite\nobserved flux in the ith energy bin and FEi is the expected\nflux derived from the Maxwellian fit to the satellite data in\neach energy channel, the fractional difference between the\nsatellite flux and the fitted flux, integrated over the whole\nspectra is given by:∑\ni\n|FOi − FEi |\nFEi\n. (13)\nEquation (13) is averaged over the number of the energy bins\nused in order to calculate the mean fractional difference for\neach second of the satellite data. We define the threshold\ncondition for accepting the fit such that the mean fractional\ndifference between the satellite flux data and the expected\nvalue derived from the Maxwellian fit is <0.5. This thresh-\nold of 0.5 will reject the satellite data that deviate by more\nthan 50% from the Maxwellian fit, on average. Column 7 of\nTable 1 gives the percentage of fitted satellite spectra, whose\nMaxwellian function meets the threshold condition in each\nof the satellite conjunctions. Therefore, the higher the value\nin column 7, the bigger the proportion of satellite data that\nmeets the threshold criteria. This process is necessary for\ncomparison to the ground-based data, which was only cali-\nbrated for Maxwellian spectra.\nThe purpose of this paper is to compare the derived charac-\nteristic energy from the satellite data with that of the ground-\nbased instruments (IRIS and DASI). Comparisons have been\nconsidered only for those satellite flux spectra which have a\ngood Maxwellian fit (<0.5 mean fractional difference). Col-\numn 8 gives the average discrepancy between the character-\nistic Maxwellian energy computed from the ground-based\nenergy map method and satellite data for the specific satel-\nlite flux spectra which have met the threshold condition de-\nscribed above, and is given by:\n|E0S − E0Gb|\nE0S\n× 100 , (14)\nwhere E0S and E0Gb are the Maxwellian characteristic en-\nergy derived from the satellite flux data and ground-based\ndata, respectively. We now present three case studies, two of\nwhich were during steady-state conditions and therefore sat-\nisfy the assumptions made by the energy map technique. In\nthe third example, this condition is not satisfied and we dis-\ncuss the discrepancies between the ground-based and satel-\nlite measurements.\nFigures 2 and 3 present data from 6 January 2000 and\n6 December 1999, respectively. Panels (A, B and C)\nin each figure are absorption, optical data and the corre-\nsponding ground-based energy map, for the 40 s covering\n140 M. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data\nA\nB\nC\nD\nE\n18:20:10\nIR\nIS\nD\nAS\nI\nEn\ner\ngy\n m\nap\n18:20:20 18:20:30 18:20:40\nAb\nso\nrp\n.(d\nB)\n0.1\n0.2\n0.3\n0.4\n55\n7.\n7n\nm\n(R\n)\n2000\n4000\n6000\nE 0\n(ke\nV)\n2\n3\n4\n2\n3\n4\nLO\nG\n E\nNE\nRG\nY \n(eV\n)\nUT\nMLAT\nGLAT\nGLONG\n18:20:20 18:20:25 18:20:30 18:20:35 18:20:40 18:20:45\n63.6 64.2 64.7 65.2 65.8 65.8\n66.9 67.5 68 68.6 69.1 69.6\n22.4 21.7 21 20.3 19.6 18.9\n0.5keV\n1keV\n2keV\n5keV\n10keV\n20keV\nLO\nG\n F\nlu\nx(k\neV\n.cm\n2 .\nsr\n.s\n)−1\n6\n7\n8\n9\n0\n1\n2\n3\n4\n5\n6\nE 0\n(ke\nV)\nGround based\nSatellite data\n0\n0.5\n1\n1.5\n2\nM\nea\nn \nfra\nct\nio\nna\nl\n \ndi\nffe\nre\nnc\ne \no\nf f\nit \nto\n \nsa\nte\nllit\ne \nda\nta\nFig. 2. Data from 6 January 2000, DMSP (F15) conjunction over northern Scandinavia (Kp=3). Panels (A), (B) and (C) are absorption,\noptical intensity and energy map images, respectively, corresponding to the area covered by the IRIS and DASI common field of view\n(67.8–70.2◦ N and 17.75–23.75◦ E) with north and east oriented up and right, respectively. Panel (D) is the satellite electron energy spectro-\ngram. Panel (E) shows the characteristic energies derived from satellite (blue) and energy map images (red). The green curve is an indication\nof how non-Maxwellian the satellite spectra are.\nthe satellite conjunction, shown in geographic coordinates\n(67.8◦–70.2◦ N and 17.75◦–23.75◦ E). The path of the satel-\nlite over the energy map is shown in red while the black lines\nindicate the part of the spacecraft path for each of the 10-s\nintegrated images. The satellite conjunction with the ground-\nbased instruments’ field of view has been considered in geo-\nmagnetic coordinates but plotted in geographic coordinates,\nhence the red line start and end points are not necessarily\nat the image boundaries in geographic coordinates. White\nspaces inside the energy map images correspond to gaps in\nthe data where an imaging riometer beam is not considered\ndue to being affected by scintillation. Ionospheric scintilla-\ntion occurs due to illumination of ionospheric irregularities\nby a strong point source, such as a radio star. Small-scale\nstructures in the ionospheric electron density can cause large\nvariations in the received signal power, which may result in\nunrealistic, negative absorption values in the riometer data.\nThe effect of the scintillation sources has been eliminated by\nignoring the affected beam data.\nPanel (D) shows the electron energy spectrogram with\nflux and energy in logarithmic scales. The white line is the\nlower energy threshold, which has been used for estimating\nM. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data 141\nA\nB\nC\nD\nE\n17:59:20\nIR\nIS\nDA\nSI\nEn\ner\ngy\n m\nap\n17:59:30 17:59:40 17:59:50\nAb\nso\nrp\n.(d\nB)\n0.2\n0.4\n0.6\n55\n7.\n7n\nm\n(R\n)\n1000\n2000\n3000\n4000\nE 0\n(ke\nV)\n2\n4\n6\n8\n2\n3\n4\nLO\nG \nEN\nER\nGY\n (e\nV)\nUT\nMLAT\nGLAT\nGLONG\n17:59:30 17:59:35 17:59:40 17:59:45 17:59:50\n65.3 65.6 65.9 66.1 66.5\n66.8 67.1 67.4 67.6 67.9\n19.4 19.1 18.7 18.4 17.8\n0.5keV\n1keV\n2keV\n5keV\n10keV\n20keV\nLO\nG \nFl\nux\n(ke\nV.c\nm2\n.\nsr\n.s\n)−1\n6\n7\n8\n0\n1\n2\n3\n4\n5\n6\n7\n8\nE 0\n(ke\nV)\nGround based\n Satellite data\n0\n0.5\n1\n1.5\n2\nM\nea\nn \nfra\nct\nio\nna\nl \ndi\nffe\nre\nnc\ne \nof\n fi\nt t\no \nsa\nte\nllit\ne \nda\nta\nFig. 3. Same as Fig. 2 but for 6 December 1999, DMSP (F12) and Kp=3.\nthe characteristic energy. This is because the energies\nless than 500 eV have an insignificant contribution to the\n557.7-nm optical signal and no effect on the riometer ab-\nsorption data, and consequently, they do not contribute to\nthe energy map results. Hence, only the 12 most energetic\nof the satellite flux spectra bins are used. A flux threshold\nof 106 (keV. cm2.sr.s)−1 has also been applied to eliminate\nthose bins which contribute mainly noise to the spectra. In\naddition, a three-point running median filter has been applied\nto reduce noise in the satellite flux data.\nPanel (E) shows the comparison between the character-\nistic energy derived from the ground-based energy map\nmethod (red curve) and the estimated characteristic energy\nfrom the satellite electron precipitation data (blue curve).\nThe Maxwellian characteristic energy of the satellite elec-\ntron spectra data is obtained using a least-squares fitting.\nThe characteristic energy derived from ground-based data\n(red curve) is interpolated from the energy map data for each\npoint of the spacecraft footprint in the energy map image, as\nshown in Figs. 2 and 3. This is necessary since the DASI\ndata limits the temporal resolution to 10 s, whereas the satel-\nlite data is 1s.\nThe mean fractional difference between the fitted\nMaxwellian spectra and the real satellite data (green line)\nis used for characterising the Maxwellian fit to the satellite\ndata, which is given by Eq. (13). Hence, the green line is an\nindication of how poor the Maxwellian fit is for each point of\nthe satellite flux spectra. A null value means that the data is a\nperfect Maxwellian. The black line in Panel (E) is the thresh-\nold (0.5), below which the Maxwellian fit to the satellite data\nis deemed acceptable.\nFigure 2 shows the data set from the DMSP F15 spacecraft\nconjunction for 6 January 2000 (Kp=3). Precipitation effects\ncan be seen in the equatorward part of both the optical and\n142 M. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data\nabsorption images. The Maxwellian fit to the satellite flux\ndata is acceptable for 61% of the data points. For these satel-\nlite data points (with mean fractional difference <0.5), the\ndeviation from the ground-based energy estimate is 21%, on\naverage. At 18:20:28 UT there are highly non-Maxwellian\nspectra in the satellite data for about 7 s. As a result the fit\nis relatively poor (green curve). From about 18:20:36 UT,\nalthough the fit is better than before, the satellite and ground-\nbased fits do not agree very well. This difference occurs\nwhen the spacecraft pass through a region where some of\nthe riometer data points are contaminated by a scintillation\nsource in the neighboring pixels of the image. Therefore, the\nground-based method is probably in error.\nFigure 3 shows the data from the DMSP F12 satellite pass\nfor 6 December 1999 (Kp=3). Again, precipitation effects\nare clearly seen in both the optical and absorption images.\nFor the first half of the satellite pass, data agreement between\nthe characteristic energy derived from the two methods is\nmostly good. For 30% of the data points the Maxwellian fit to\nthe satellite flux data is relatively good (mean fractional dif-\nference <0.5). For these satellite data points with acceptable\nMaxwellian fit, the deviation from the ground-based energy\nestimate is 31%, on average. Starting from 17:59:36 UT the\nsatellite data become non-Maxwellian and consequently the\nfit becomes relatively poor.\nSatellite observations show that auroral particles can have\nquasi-monoenergetic energy spectra, as illustrated in Figs. 2\nand 3. Evans (1974) has suggested these peaks are produced\nby electron acceleration due to electric fields parallel to the\nmagnetic field. The Maxwellian distribution seems to be well\nsuited for modelling auroras having broad incident electron\nspectra, such as diffuse aurora (Strickland et al., 1989). Sharp\nelectron energy flux enhancements in the DMSP data, known\nas Large-Scale Electron Acceleration events (LSEAs), result\nfrom electromagnetic or electrostatic acceleration (i.e. either\nwave-particle interaction or potential drop), or both (Newell,\n2000). “Large scale” is a relative term because at the DMSP\naltitudes the spacecraft’s speed is ∼7.5 km\/s; therefore, any\nfeature observed by the satellite can be thought of as a large-\nscale feature. The non-Maxwellian spectra in the satellite\ndata may be examples of such events.\nA strong auroral arc structure can be seen in the opti-\ncal data and equatorward of the arc there is a region of ab-\nsorption. Cosmic radio waves appear to be absorbed more\nstrongly in regions adjacent to discrete auroral arcs than\nthrough the arc regions themselves (Stoker et al., 1997). The\ncomparison between the energies shows that the agreement\nis good in the stronger absorption area where the satellite\ndata also possesses a Maxwellian distribution. When the dis-\ntribution fails to be Maxwellian the agreement between the\ncharacteristic energies is poor. It is also probable that the\nmeasurement uncertainty for absorption, which is <0.1 dB\n(Kosch et al., 2001a), causes the energy map technique to\nfail after 17:59:40, thereby contributing to the disagreement\nwith the satellite fit. This leads to deviations between the\nground-based (red curve) and satellite (blue curve) estimates\nof the characteristic energy.\nFigure 4 shows the satellite conjunction for 1 December\n2000 (Kp=1−). Panels (D and E) represent satellite electron\nand ion precipitation data between 0.3 and 30 keV, respec-\ntively. Although there is ionospheric absorption in the IRIS\ndata, there is relatively weak optical aurora in the DASI im-\nage. Likewise, the satellite electron flux data are relatively\nweak. However, a significant energy flux of precipitating\nprotons can be seen in the ion spectra. It is obvious that\nagreement between the satellite data and the ground-based\nenergy map method is poor much of the time. For 52% of\nthe data points the Maxwellian fit to the satellite flux data\nhas a mean fractional difference less than 0.5. However, for\nthese satellite flux spectra with acceptable fit, the deviation\nfrom the ground-based energy estimate is more than 100%,\non average. Protons with energies more than 100 keV can\nreach down to the 90-km altitude causing absorption in the\nIRIS data. Using the ion spectra in order to determine their\neffect on ground-based characteristic energy is not possible\nhere as the available DMSP ion precipitation data does not\nextend out to>30 keV. However, it seems likely that the IRIS\nabsorption data was contaminated by ion precipitation.\nTypically, electron precipitation causes auroral absorp-\ntion in the ionosphere, which takes place in the range of\n60–100 km. Enhanced ionisation in the atmosphere by pre-\ncipitating high energy protons also causes absorption, which\ntypically occurs at altitudes of 50–90 km. Therefore, riome-\nter absorption measurements may be either from electron or\nproton precipitation. In the data sets, which have been stud-\nied in this paper, the possibility of ion precipitation has been\ninvestigated using DMSP, ACE and GOES satellite data. The\nACE satellite, orbiting at the L1 point, provides measure-\nments of the solar wind particles whilst the GOES satellite\ndetects the proton fluxes in geostationary orbit. There is no\nsignificant ion precipitation in the satellite data for the data\nsets shown in Figs. 2 and 3. This means the riometer data\nis due to absorption from the precipitating electrons only in\nthese cases. This is summarised in column 5 of Table 1.\nProton precipitation is deemed to be significant if its flux is\nwithin 1–2 orders of magnitude of the electron flux.\nTable 1 gives a summary overview of the satellite passes\nstudied. The best comparison between satellite and ground-\nbased estimates (column 8) for the Maxwellian characteristic\nenergy of the precipitating particles depends on several fac-\ntors, primarily that steady-state conditions should exist and\nthat ion precipitation should be negligible compared to elec-\ntron precipitation. The former relates directly to the basic\nassumption made in Eq. (7), whilst the latter adds to the to-\ntal ionisation of the ionosphere, which was not taken into\naccount when the energy map method was calibrated using\nEISCAT radar data. In principle, proton precipitation could\nbe accounted for with H emission optical data (Galand, 2001)\nbut, unfortunately, such measurements are not available for\nthe present study. For the ground-based method, the riome-\nter data is the weakest link. Scintillations cause unrealis-\ntic absorption values. The absorption is often quite small\n(<0.5 dB), increasing the uncertainty of the measurement\n(<0.1 dB). In addition, the riometer is affected by proton\nM. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data 143\nA\nB\nC\nD\nE\nF\n18:42:20\nIR\nIS\nD\nAS\nI\nEn\ner\ngy\n m\nap\n18:42:30 18:42:40 18:42:50\nAb\nso\nrp\n.(d\nB)\n0.1\n0.2\n0.3\n0.4\n0.5\n55\n7.\n7n\nm\n(R\n)\n400\n600\n800\n1000\nE 0\n(ke\nV)\n2\n4\n6\n8\n10\n12\n2\n3\n4\nLO\nG\n E\nNE\nRG\nY \n(eV\n)\nEl\nec\ntro\nns\nUT\nMLAT\nGLAT\nGLONG\n18:42:30 18:42:35 18:42:40 18:42:45 18:42:50 18:43:55\n64 64.6 65.1 65.7 66.2 66.8\n65.6 66.2 66.7 67.3 67.8 68.4\n21 20.4 19.8 19.2 18.5 17.8\n0.5keV\n1keV\n2keV\n5keV\n10keV\n20keV\nLO\nG\n F\nlu\nx(k\neV\n.cm\n2 .\nsr\n.s\n)−1\n6\n7\n8\n2\n3\n4\nLO\nG\n E\nNE\nRG\nY \n(eV\n)\nIo\nns\n0.5keV\n1keV\n2keV\n5keV\n10keV\n20keV\n4.5\n5\n5.5\n6\n0\n5\n10\nE 0\n(ke\nV)\nGround based\n Satellite data\n0\n0.5\n1\n1.5\n2\nM\nea\nn \nfra\nct\nio\nna\nl\ndi\nffe\nre\nnc\ne\no\nf f\nit \nto\nsa\nte\nllit\ne \nda\nta\nFig. 4. Panels (A–D) are the same as Fig. 2 but for 1 December 2000, DMSP (F15) and Kp=1−. Panel (E) is the satellite proton energy\nspectrogram. Panel (F) is the same as panel (E) in Fig. 2.\nprecipitation, which can only be identified optically if such\nan imager is available.\nFive of the satellite passes (18 February 1995, 7 Jan-\nuary 1997, 6 November 1997, 22 November 1997, 1 De-\ncember 2000) occurred during non-steady-state conditions,\nresulting in the average discrepancy being >100% in all\ncases. Two passes (19 February 1998, 28 November 2000)\noccurred during steady-state conditions, but the ion precipi-\ntation caused the ground-based technique to fail, also result-\ning in the average discrepancy being >100% in both cases.\nThe data related to 9 February 1997 occurred during non-\nsteady-state conditions and the discrepancy between satellite\nand ground-based methods is low (27%), but only for a small\nnumber of data points (26%). The data from 16 October 1996\n144 M. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data\nappears to be an anomaly since, despite ion precipitation, the\nnumber of satellite spectra under the threshold is very high\n(93%) and the disagreement with ground-based energy esti-\nmates is small (35%). However, since DMSP only has ion\nprecipitation data for <30 keV, it is not proven that the ions\nin this event did cause additional absorption.\nThe remaining satellite passes (6 December 1999, 6 Jan-\nuary 2000, 23 January 2001) all occur during steady-state\nauroral conditions and relatively insignificant ion precipita-\ntion, and give a satisfactory agreement between satellite and\nground-based energy estimates for a reasonable fraction of\nthe data points. It is also worth noting for these data sets Kp\nwas moderate (3–3+).\n5 Conclusions\nWe have reconsidered the ground-based energy map method\nof estimating the Maxwellian characteristic energy of the\nprecipitating electrons and compared this to DMSP satellite\nobservations. The results show that for moderate geomag-\nnetic conditions with Kp values around 3, without any sig-\nnificant ion precipitation present, steady-state conditions and\nfor Maxwellian satellite spectra, there is ∼71% agreement\nbetween the characteristic energies derived from satellite\ndata and the ground-based energy map method. Where the\ngeomagnetic conditions are very quiet or disturbed there is\nno satisfactory agreement between the satellite electron pre-\ncipitation data and the ground-based instruments’ character-\nistic energy (Table 1). In the case of Kp\u001d3 the steady-state\nassumption generally fails, whereas for Kp <3 IRIS mea-\nsurement uncertainties dominate. Statistical analysis shows\nthat the average absorption decreases with decreasing Kp\n(Kavanagh et al., 2004), therefore with low Kp the possi-\nbility of small absorption resulting in greater measurement\nuncertainties is higher. The ground-based method works best\nfor absorption \u001d0.1 dB.\nOne of the assumptions made in estimating the character-\nistic energy of precipitating particles is that of a Maxwellian\nflux spectrum, which is not always true. For field-aligned\npotential drops and particle acceleration mechanisms in the\nlower magnetosphere, the precipitating electron spectra can\nbe highly non-Maxwellian (Evans, 1974). The advantage\nof using multi-spectral optical measurements is in estimat-\ning a characteristic energy from ground-based data, which is\nmore general. The present study was undertaken using the\natomic oxygen green line emission only, as no other optical\ndata were available. However, future multi-wavelength op-\ntical measurements are planned. Having data from several\noptical wavelengths means that there is no need to assume\nany specific spectral distribution function.\nThe DASI camera is capable of recording the precipitating\nparticles with energies >1 keV which is dominated by the\noxygen green line at 557.7 nm. Hence, the optical images do\nnot include the energies <1 keV corresponding to F-region\ndeposition altitudes. This energy range excites the second\nbrightest auroral emission at 630 nm. The long radiative\nlifetime of this oxygen emission results in strong quenching\nby collisions below 250 km altitude, and only electrons inter-\nacting above ∼250 km produce this emission line (Rees and\nLuckey, 1974). However, the 110-s radiative lifetime limits\nits use in studying dynamic aurora. The N+2 prompt emis-\nsion at 427.8 nm is another candidate which has been used\nin previous auroral studies (Rees and Luckey, 1974; Strick-\nland et al., 1989; Semeter et al., 2001). This emission is a\nproxy for energy flux (see Eq. 4) and can be used for study-\ning high-energy (>10 keV) electron precipitation in auroral\nforms (Semeter et al., 2001).\nApplying these improvements to the energy map method\nprovides the possibility of expanding the application regime\nof the energy map method of Kosch et al. (2001a) by re-\nducing the number of constraining assumptions. In addition,\nimaging the proton auroral emission will remove the proton\nvs. electron precipitation ambiguity in the absorption data.\nAcknowledgements. We thank D. Hardy, F. Rich, and P. Newell as\nwell as JHU\/APL for use of the DMSP data. IRIS is operated by\nthe Department of Communications Systems at Lancaster Univer-\nsity (UK) and is funded by the Particle Physics and Astronomy Re-\nsearch Council (PPARC) in collaboration with Sodankyla¨ Geophys-\nical Observatory (Finland). DASI was operated by Max-Planck-\nInstitut fu¨r Aeronomie (Germany) in collaboration with the Auroral\nObservatory in Tromsø (Norway). EISCAT is an international sci-\nentific association supported by the research councils of Finland,\nFrance, Germany, Japan, Norway, Sweden and the United King-\ndom.\nTopical Editor M. Lester thanks P. H. Stoker and another referee\nfor their help in evaluating this paper.\nReferences\nAnsari, Z. A.: The aurorally associated absorption of cosmic noise\nat college, Alaska, J. Geophys. Res., 69, 4493–4513, 1964.\nBerkey, F. T.: Coordinated measurements of auroral absorption and\nluminosity using the narrow beam technique, J. Geophys. Res.,\n73, 319–337, 1968.\nBrekke, A., Doupnik, J., and Banks, P.: Incoherent scatter measure-\nments of E-region conductivities and currents in the auroral zone,\nJ. Geophys. Res., 79, 3773–3790, 1974.\nBrekke, A., Hall, C., and Hansen, T. L.: Auroral ionospheric con-\nductances during disturbed conditions, Ann. Geophys., 7, 269–\n280, 1989.\nBrowne, S., Hargreaves, J. K., and Honary, B.: An imaging riome-\nter for ionospheric studies, Electron. Commun., 7(5), 209–217,\n1995.\nCampbell, W. H. and Leinbach, H.: Ionospheric absorption at times\nof auroral and magnetic pulsations, J. Geophys. Res., 66, 25–34,\n1961.\nCollis, P. N., Hargreaves, J. K., and Korth, A.: Auroral radio ab-\nsorption as an indicator of magnetospheric electrons and of con-\nditions in the disturbed auroral D-region, J. Atmos. Terr. Phys.,\n46, 21–38, 1984.\ndel Pozo, C. F., Hargreaves, J. K., and Aylward, A. D.: Ion com-\nposition and effective ion recombination rate in the night-time\nauroral lower ionosphere, J. Atmos. Sol. Terr. Phys., 59, 1919–\n1943, 1997.\nM. Ashrafi et al.: Electrons derived from ground-based and DMSP satellite data 145\ndel Pozo, C. F., Kosch, M. J., and Honary, F.: Estimation of the\ncharacteristic energy of electron precipitation, Ann. Geophys.,\n20, 1349–1359, 2002,\nSRef-ID: 1432-0576\/ag\/2002-20-1349.\nEvans, D. S.: Precipitating electron fluxes formed by a magnetic\nfield-aligned potential difference, J. Geophys. Res., 79, 2853–\n2858, 1974.\nFrank, L. A. and Ackerson, K. L.: Observations of charged particle\nprecipitation in the auroral zone, J. Geophys. Res., 76, 3612–\n3643, 1971.\nFuller-Rowell, T. J. and Evans, D. S.: Height-integrated Pedersen\nand Hall conductivity patterns inferred from the TIROS-NOAA\nsatellite data, J. Geophys. Res., 92, 7606–7618, 1987.\nGaland, M.: Introduction to special section: Proton precipitation\ninto the atmosphere, J. Geophys. Res., 106, 1–6, 2001.\nGustafsson, G.: Spatial and temporal relations between auroral\nemission and cosmic noise absorption, Planet. Space Sci., 17,\n1961–1975, 1969.\nHardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall,\nF. J., Yeh, H. C., Schumaker, T. L., Hube, A., and Pantazis,\nJ.: Precipitating electron and ion detectors (SSJ\/4) for the block\n5D\/flights 6–10 DMSP satellites: Calibration and data presenta-\ntion, Tech. Rep. AFGL-TR-84-0317, Air Force Geophysics Lab-\noratory, Hanscom Airforce Base, MA, 1984.\nHardy, D. A., Gussenhoven, M. S., and Holeman, E.: A statisti-\ncal model of auroral electron precipitation, J. Geophys. Res., 90,\n4229–4248, 1985.\nHargreaves, J. K.: Auroral absorption of HF radio waves in the\nionosphere: A review of results from the first decade of riom-\netry, Proceedings of the IEEE, 57, 1348–1373, 1969.\nHargreaves, J. K.: The Solar-Terrestrial Environment, Cambridge\nUniversity Press, 1995.\nHeppner, J. P., Byrne, E. C., and Belon, A. E.: The association\nof absorption and Es ionisation with aurora at high latitudes, J.\nGeophys. Res., 57, 121–134, 1952.\nHolt, O. and Omholt, A.: Auroral luminosity and absorption of cos-\nmic radio noise, J. Atmos. Terr. Phys., 24, 467–474, 1962.\nJohansen, O. E.: Variations in energy spectrum of auroral electrons\ndetected by simultaneous observation with photometer and ri-\nometer, Planet. Space Sci., 13, 225–235, 1965.\nKavanagh, A. J., Kosch, M. J., Honary, F., Senior, A., Marple, S. R.,\nWoodfield, E. E., and McCrea, I. W.: The statistical dependence\nof auroral absorption on geomagnetic and solar wind parameters,\nAnn. Geophys., 22, 877–887, 2004,\nSRef-ID: 1432-0576\/ag\/2004-22-877.\nKosch, M. J.: The Skibotn CCD All-Sky Imager (SCASI) and real\ntime networking onto the World Wide Web, Tech. Rep. MPAE-\nT-010-99-12, Max-Planck-Institut fu¨r Aeronomie, Lindau, Ger-\nmany, 1999.\nKosch, M. J., Hagfors, T., and Nielsen, E.: A new digital all-sky\nimager for optical auroral studies in conjunction with the Scan-\ndinavian twin auroral radar experiment, Rev. Sci. Instrum., 69,\n578–584, 1998a.\nKosch, M. J., Hagfors, T., and Schlegel, K.: Extrapolating EISCAT\nPedersen conductances to other parts of the sky using ground-\nbased TV auroral images, Ann. Geophys., 16, 583–588, 1998,\nSRef-ID: 1432-0576\/ag\/1998-16-583.\nKosch, M. J., Honary, F., del Pozo, C. F., Marple, S. R., and Hag-\nfors, T.: High-resolution maps of the characteristic energy of\nprecipitating auroral particles, J. Geophys. Res., 106, 28 925–\n28 937, 2001a.\nKosch, M. J., Scourfield, M. W. J., and Amm, O.: The importance\nof conductivity gradients in ground-based field-aligned current\nstudies, Adv. Space Res., 27, 1277–1282, 2001b.\nNewell, P. T.: Reconsidering the inverted-V particle signature: The\nrelative frequency of large-scale electron acceleration events, J.\nGeophys. Res., 105, 15 779–15 794, 2000.\nOgilvie, K. W.: Auroral electron energy spectra, J. Geophys. Res.,\n73, 2325–2332, 1968.\nRees, M. H.: Auroral ionisation and excitation by incident energetic\nelectrons, Planet. Space Sci., 11, 1209–1218, 1963.\nRees, M. H.: Physics and Chemistry of the Upper Atmosphere,\nCambridge University Press, 1989.\nRees, M. H. and Luckey, D.: Auroral electron energy derived from\nratio of spectroscopic emissions, 1. Model computations, J. Geo-\nphys. Res., 79, 5181–5186, 1974.\nRobinson, R. M. and Vondrak, R.: Validation of techniques for\nspace based remote sensing of auroral precipitation and its iono-\nspheric effects, Space Sci. Rev., 69, 331–407, 1994.\nRobinson, R. M., Vondrak, R. R., Miller, K., Babbs, T., and Hardy,\nD.: On calculating ionospheric conductances from the flux and\nenergy of precipitating electrons, J. Geophys. Res., 92, 2565–\n2569, 1987.\nRostoker, G., Kamide, Y., and Winningham, J. D.: Energetic par-\nticle precipitation into high-latitude ionosphere and the auroral\nelectrojets, 3. Characteristics of electron precipitation into the\nmorning sector auroral oval, J. Geophys. Res., 90, 7495–7504,\n1985.\nSemeter, J., Lummerzheim, D., and Haerendel, G.: Simultaneous\nmultispectral imaging of the discrete aurora, J. Atmos. Sol. Terr.\nPhys., 63, 1981–1992, 2001.\nSeviour, R., Kosch, M., and Honary, F.: Identification of clouds\nand aurorae in optical data images, New Journal of Physics, 5,\n6.1–6.7, 2003.\nStauning, P.: Investigations of ionospheric radio wave absorption\nprocess using imaging riometer techniques, J. Atmos. Terr. Phys.,\n58, 753–764, 1996.\nSteele, D. P. and McEwen, D. J.: Electron auroral excitation ef-\nficiencies and intensity ratios, J. Geophys. Res., 95, 10 321–\n10 336, 1990.\nStoker, P. H., Mathews, M. J., and Scourfield, M. W. J.: Cosmic\nradio noise absorption related to structures in auroral luminosity,\nJ. Geophys. Res., 102, 7439–7447, 1997.\nSto¨rmer, C.: The Polar Aurora, Oxford University Press, 1955.\nStrickland, D. J., Meier, R. R., Hecht, J. H., and Christensen,\nA. B.: Deducing composition and incident electron spectra from\nground-based auroral optical measurements: Theory and model\nresults, J. Geophys. Res., 94, 13 527–13 539, 1989.\nVallance-Jones, A. V.: Auroral spectroscopy and thermosphere, in:\nAuroral Physics, edited by: Meng, C. I., Rycroft, M. J., and\nFrank, L. A., Cambridge University Press, 15, 1991.\nVickery, J. F., Vondrak, R. R., and Matthews, S. J.: The diurnal\nlatitudinal variations of auroral zone ionospheric conductivity, J.\nGeophys. Res., 86, 65–75, 1981.\nVondrak, R. R. and Sears, R. D.: Comparison of incoherent scatter\nradar and photometric measurements of the energy distribution\nof auroral electrons, J. Geophys. Res., 83, 1665–1667, 1978.\n"}