{"doi":"10.1186\/1471-2407-10-172","coreId":"196613","oai":"oai:lra.le.ac.uk:2381\/8803","identifiers":["oai:lra.le.ac.uk:2381\/8803","10.1186\/1471-2407-10-172"],"title":"Chemokine receptor expression in tumour islets and stroma in non-small cell lung cancer","authors":["Ohri, Chandra M.","Shikotra, Aarti","Green, Ruth H.","Waller, David A.","Bradding, Peter"],"enrichments":{"references":[{"id":43659325,"title":"Bradding P: Differential expression of CCR3 and CXCR3 by human lung and bone marrow-derived mast cells: implications for tissue mast cell migration.","authors":[],"date":"2005","doi":"10.1189\/jlb.0904511","raw":"Brightling CE, Kaur D, Berger P, Morgan AJ, Wardlaw AJ, Bradding P: Differential expression of CCR3 and CXCR3 by human lung and bone marrow-derived mast cells: implications for tissue mast cell migration. J Leukoc Biol 2005, 77(5):759-766.","cites":null},{"id":43659303,"title":"Bradding P: Macrophages within NSCLC tumour islets are predominantly of a cytotoxic M1 phenotype associated with extended survival. Eur Respir J","authors":[],"date":"2009","doi":"10.1183\/09031936.00065708","raw":"Ohri CM, Shikotra A, Green RH, Waller DA, Bradding P: Macrophages within NSCLC tumour islets are predominantly of a cytotoxic M1 phenotype associated with extended survival. Eur Respir J 2009, 33(1):118-126.","cites":null},{"id":43659310,"title":"Cancer and the chemokine network. Nat Rev Cancer","authors":[],"date":"2004","doi":"10.1038\/nrc1388","raw":"Balkwill F: Cancer and the chemokine network. Nat Rev Cancer 2004, 4(7):540-550.","cites":null},{"id":43659324,"title":"Cerwenka A: Natural Killer Cell Accumulation","authors":[],"date":"2008","doi":"10.1158\/0008-5472.can-08-1440","raw":"Wendel M, Galani IE, Suri-Payer E, Cerwenka A: Natural Killer Cell Accumulation in Tumors Is Dependent on IFN-{gamma} and CXCR3 Ligands. Cancer Res 2008, 68(20):8437-8445.","cites":null},{"id":43659322,"title":"Depletion of CXCR2 inhibits tumor growth and angiogenesis in a murine model of lung cancer.","authors":[],"date":"2004","doi":"10.4049\/jimmunol.172.5.2853","raw":"Keane MP, Belperio JA, Xue YY, Burdick MD, Strieter RM: Depletion of CXCR2 inhibits tumor growth and angiogenesis in a murine model of lung cancer. J Immunol 2004, 172(5):2853-2860.","cites":null},{"id":43659317,"title":"et al.: Inhibition of interleukin 8 attenuates angiogenesis in bronchogenic carcinoma.","authors":[],"date":"1994","doi":null,"raw":"Smith DR, Polverini PJ, Kunkel SL, Orringer MB, Whyte RI, Burdick MD, et al.: Inhibition of interleukin 8 attenuates angiogenesis in bronchogenic carcinoma. J Exp Med 1994, 179(5):1409-1415.","cites":null},{"id":43659331,"title":"et al.: Prognostic significance of tumor infiltrating natural killer cells subset CD57 in patients with squamous cell lung cancer. Lung Cancer","authors":[],"date":"2002","doi":"10.1016\/s0169-5002(01)00292-6","raw":"Villegas FR, Coca S, Villarrubia VG, Jimenez R, Chillon MJ, Jareno J, et al.: Prognostic significance of tumor infiltrating natural killer cells subset CD57 in patients with squamous cell lung cancer. Lung Cancer 2002, 35(1):23-28.","cites":null},{"id":43659301,"title":"Funding for this study was provided by the James Maxwell Grant Prophit Fellowship awarded to Dr Chandra Ohri by the Royal College of Physicians, London, United Kingdom. Author Details 1Department of Infection,","authors":[],"date":null,"doi":null,"raw":"Funding for this study was provided by the James Maxwell Grant Prophit Fellowship awarded to Dr Chandra Ohri by the Royal College of Physicians, London, United Kingdom. Author Details 1Department of Infection, Immunity and Inflammation, University of Leicester, Leicester, UK, 2Institute for Lung Health, Department of Respiratory Medicine, Glenfield Hospital, Leicester, UK and 3Department of Thoracic Surgery, Glenfield Hospital, Leicester, UK","cites":null},{"id":43659338,"title":"H: Th1\/Th2 cytokines reciprocally regulate in vitro pulmonary angiogenesis via CXC chemokine synthesis.","authors":[],"date":"2008","doi":"10.1165\/rcmb.2007-0162oc","raw":"Matsuda A, Fukuda S, Matsumoto K, Saito H: Th1\/Th2 cytokines reciprocally regulate in vitro pulmonary angiogenesis via CXC chemokine synthesis. Am J Respir Cell Mol Biol 2008, 38(2):168-175.","cites":null},{"id":43659332,"title":"Interferon-gamma-inducible protein 10 (IP-10) is an angiostatic factor that inhibits human non-small cell lung cancer (NSCLC) tumorigenesis and spontaneous metastases.","authors":[],"date":"1996","doi":"10.1084\/jem.184.3.981","raw":"Arenberg DA, Kunkel SL, Polverini PJ, Morris SB, Burdick MD, Glass MC, et al.: Interferon-gamma-inducible protein 10 (IP-10) is an angiostatic factor that inhibits human non-small cell lung cancer (NSCLC) tumorigenesis and spontaneous metastases. J Exp Med 1996, 184(3):981-992.","cites":null},{"id":43659319,"title":"Interleukin-8 Messenger Ribonucleic Acid Expression Correlates with Tumor Progression, Tumor Angiogenesis, Patient Survival, and Timing of Relapse in Non-Small-Cell Lung Cancer. Am J Respir Crit Care Med","authors":[],"date":"2000","doi":"10.1164\/ajrccm.162.5.2002108","raw":"Yuang ANG, Yang PC, Yu CJ, Chen WJ, Lin FY, Kuo SH, et al.: Interleukin-8 Messenger Ribonucleic Acid Expression Correlates with Tumor Progression, Tumor Angiogenesis, Patient Survival, and Timing of Relapse in Non-Small-Cell Lung Cancer. Am J Respir Crit Care Med 2000, 162(5):1957-1963.","cites":null},{"id":43659327,"title":"JA: T cell extravasation: demonstration of synergy between activation of CXCR3 and the T cell receptor. Mol Immunol","authors":[],"date":"2009","doi":"10.1016\/j.molimm.2009.08.021","raw":"Newton P, O'Boyle G, Jenkins Y, Ali S, Kirby JA: T cell extravasation: demonstration of synergy between activation of CXCR3 and the T cell receptor. Mol Immunol 2009, 47(2-3):485-492.","cites":null},{"id":43659302,"title":"Macrophage and mast-cell invasion of tumor cell islets confers a marked survival advantage in non-small-cell lung cancer.","authors":[],"date":"2005","doi":"10.1016\/s0169-5002(05)80430-1","raw":"Welsh TJ, Green RH, Richardson D, Waller DA, O'Byrne KJ, Bradding P: Macrophage and mast-cell invasion of tumor cell islets confers a marked survival advantage in non-small-cell lung cancer. J Clin Oncol 2005, 23(35):8959-8967.","cites":null},{"id":43659337,"title":"Macrophage infiltration in human non-small-cell lung cancer: the role of CC chemokines. Cancer Immunol Immunother","authors":[],"date":"2000","doi":"10.1007\/s002620050603","raw":"Arenberg DA, Keane MP, DiGiovine B, Kunkel SL, Strom SR, Burdick MD, et al.: Macrophage infiltration in human non-small-cell lung cancer: the role of CC chemokines. Cancer Immunol Immunother 2000, 49(2):63-70.","cites":null},{"id":43659308,"title":"Mantovani A: Pathways connecting inflammation and cancer. Curr Opin Genet Dev","authors":[],"date":"2008","doi":"10.1016\/j.gde.2008.01.003","raw":"Allavena P, Garlanda C, Borrello MG, Sica A, Mantovani A: Pathways connecting inflammation and cancer. Curr Opin Genet Dev 2008, 18(1):3-10.","cites":null},{"id":43659316,"title":"PJ: Interleukin-8\/CXCL8 is a growth factor for human lung cancer cells.","authors":[],"date":"2004","doi":"10.1038\/sj.bjc.6602227","raw":"Zhu YM, Webster SJ, Flower D, Woll PJ: Interleukin-8\/CXCL8 is a growth factor for human lung cancer cells. Br J Cancer 2004, 91(11):1970-1976.","cites":null},{"id":43659314,"title":"RANTES Expression Is a Predictor of Survival in Stage I Lung Adenocarcinoma. Clin Cancer Res","authors":[],"date":"2002","doi":null,"raw":"Moran CJ, Arenberg DA, Huang CC, Giordano TJ, Thomas DG, Misek DE, et al.: RANTES Expression Is a Predictor of Survival in Stage I Lung Adenocarcinoma. Clin Cancer Res 2002, 8(12):3803-3812.","cites":null},{"id":43659339,"title":"RM: CXCR4 expression on circulating pan-cytokeratin positive cells is associated with survival in patients with advanced non-small cell lung cancer.","authors":[],"date":"2009","doi":"10.1186\/1471-2407-9-213","raw":"Reckamp KL, Figlin RA, Burdick MD, Dubinett SM, Elashoff RM, Strieter RM: CXCR4 expression on circulating pan-cytokeratin positive cells is associated with survival in patients with advanced non-small cell lung cancer. BMC Cancer 2009, 9:213.","cites":null},{"id":43659307,"title":"The chemokine system in diverse forms of macrophage activation and polarization. Trends Immunol","authors":[],"date":"2004","doi":"10.1016\/j.it.2004.09.015","raw":"Mantovani A, Sica A, Sozzani S, Allavena P, Vecchi A, Locati M: The chemokine system in diverse forms of macrophage activation and polarization. Trends Immunol 2004, 25(12):677-686.","cites":null},{"id":43659334,"title":"The CXC chemokine, monokine induced by interferon-gamma, inhibits non-small cell lung carcinoma tumor growth and metastasis. Hum Gene Ther","authors":[],"date":"2000","doi":"10.1089\/10430340050015996","raw":"Addison CL, Arenberg DA, Morris SB, Xue YY, Burdick MD, Mulligan MS, et al.: The CXC chemokine, monokine induced by interferon-gamma, inhibits non-small cell lung carcinoma tumor growth and metastasis. Hum Gene Ther 2000, 11(2):247-261.","cites":null},{"id":43659320,"title":"The intratumoral expression of vascular endothelial growth factor and interleukin-8 associated with angiogenesis in nonsmall cell lung carcinoma patients. Cancer","authors":[],"date":"2001","doi":"10.1002\/1097-0142(20011115)92:10<2628::aid-cncr1616>3.0.co;2-f","raw":"Masuya D, Huang C, Liu D, Kameyama K, Hayashi E, Yamauchi A, et al.: The intratumoral expression of vascular endothelial growth factor and interleukin-8 associated with angiogenesis in nonsmall cell lung carcinoma patients. Cancer 2001, 92(10):2628-2638.","cites":null},{"id":43659329,"title":"The prognostic value of natural killer cell infiltration in resected pulmonary adenocarcinoma. J Thorac Cardiovasc Surg","authors":[],"date":"2001","doi":"10.1067\/mtc.2001.113026","raw":"Takanami I, Takeuchi K, Giga M: The prognostic value of natural killer cell infiltration in resected pulmonary adenocarcinoma. J Thorac Cardiovasc Surg 2001, 121(6):1058-1063.","cites":null},{"id":43659311,"title":"The stromal derived factor-1\/CXCL12-CXC chemokine receptor 4 biological axis in non-small cell lung cancer metastases. Am J Respir Crit Care Med","authors":[],"date":"2003","doi":"10.1164\/rccm.200301-071oc","raw":"Phillips RJ, Burdick MD, Lutz M, Belperio JA, Keane MP, Strieter RM: The stromal derived factor-1\/CXCL12-CXC chemokine receptor 4 biological axis in non-small cell lung cancer metastases. Am J Respir Crit Care Med 2003, 167(12):1676-1686.","cites":null},{"id":43659305,"title":"Zlotnik A: The Biology of Chemokines and their Receptors. Annual Review of Immunology","authors":[],"date":"2000","doi":"10.1146\/annurev.immunol.18.1.217","raw":"Rossi D, Zlotnik A: The Biology of Chemokines and their Receptors. Annual Review of Immunology 2000, 18(1):217-242.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04-29","abstract":"Background: We have previously demonstrated that tumour islet infiltration by macrophages is associated with extended survival (ES) in NSCLC. We therefore hypothesised that patients with improved survival would have high tumour islet expression of chemokine receptors known to be associated with favourable prognosis in cancer. This study investigated chemokine receptor expression in the tumour islets and stroma in NSCLC.\\ud\nMethods: We used immunohistochemistry to identify cells expressing CXCR1, CXCR2, CXCR3, CXCR4, CXCR5 and CCR1 in the tumour islets and stroma in 20 patients with surgically resected NSCLC. Correlations were made with macrophage and mast cell expression.\\ud\nResults: There was increased expression of CXCR2, CXCR3, and CCR1 in the tumour islets of ES compared with poor survival (PS) patients (p = 0.007, 0.01, and 0.002, respectively). There was an association between 5 year survival and tumour islet CXCR2, CXCR3 and CCR1 density (p = 0.02, 0.003 and <0.001, respectively) as well as stromal CXCR3 density (p = 0.003). There was a positive correlation between macrophage density and CXCR3 expression (r[subscript s] = 0.520, p = 0.02) and between mast cell density and CXCR3 expression (r[subscript s] = 0.499, p = 0.03) in the tumour islets.\\ud\nConclusion: Above median expression of CXCR2, CXCR3 and CCR1 in the tumour islets is associated with increased survival in NSCLC, and expression of CXCR3 correlates with increased macrophage and mast cell infiltration in the tumour islets.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/creativecommons.org\/licenses\/by\/2.0),","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8803\/1\/1471-2407-10-172%5b1%5d.pdf","pdfHashValue":"2114a0cee997ca8d1c4bbd5db9fea863a0948292","publisher":"BioMed Central Ltd","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8803<\/identifier><datestamp>\n                2013-10-25T11:03:23Z<\/datestamp><setSpec>\n                com_2381_6<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_9<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nChemokine receptor expression in tumour islets and stroma in non-small cell lung cancer<\/dc:title><dc:creator>\nOhri, Chandra M.<\/dc:creator><dc:creator>\nShikotra, Aarti<\/dc:creator><dc:creator>\nGreen, Ruth H.<\/dc:creator><dc:creator>\nWaller, David A.<\/dc:creator><dc:creator>\nBradding, Peter<\/dc:creator><dc:description>\nBackground: We have previously demonstrated that tumour islet infiltration by macrophages is associated with extended survival (ES) in NSCLC. We therefore hypothesised that patients with improved survival would have high tumour islet expression of chemokine receptors known to be associated with favourable prognosis in cancer. This study investigated chemokine receptor expression in the tumour islets and stroma in NSCLC.\\ud\nMethods: We used immunohistochemistry to identify cells expressing CXCR1, CXCR2, CXCR3, CXCR4, CXCR5 and CCR1 in the tumour islets and stroma in 20 patients with surgically resected NSCLC. Correlations were made with macrophage and mast cell expression.\\ud\nResults: There was increased expression of CXCR2, CXCR3, and CCR1 in the tumour islets of ES compared with poor survival (PS) patients (p = 0.007, 0.01, and 0.002, respectively). There was an association between 5 year survival and tumour islet CXCR2, CXCR3 and CCR1 density (p = 0.02, 0.003 and <0.001, respectively) as well as stromal CXCR3 density (p = 0.003). There was a positive correlation between macrophage density and CXCR3 expression (r[subscript s] = 0.520, p = 0.02) and between mast cell density and CXCR3 expression (r[subscript s] = 0.499, p = 0.03) in the tumour islets.\\ud\nConclusion: Above median expression of CXCR2, CXCR3 and CCR1 in the tumour islets is associated with increased survival in NSCLC, and expression of CXCR3 correlates with increased macrophage and mast cell infiltration in the tumour islets.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2010-11-24T16:44:29Z<\/dc:date><dc:date>\n2010-11-24T16:44:29Z<\/dc:date><dc:date>\n2010-04-29<\/dc:date><dc:type>\nPublished Article<\/dc:type><dc:identifier>\nBMC Cancer, 2010, 10:172<\/dc:identifier><dc:identifier>\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8803<\/dc:identifier><dc:identifier>\n10.1186\/1471-2407-10-172<\/dc:identifier><dc:identifier>\n1471-2407<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2010 Ohri et al; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative Commons Attribution\\ud\nLicense (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in any\\ud\nmedium, provided the original work is properly cited.<\/dc:rights><dc:publisher>\nBioMed Central Ltd<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1471-2407","1471-2407"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Published Article"],"fullText":"Ohri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nOpen AccessR E S E A R C H  A R T I C L EResearch articleChemokine receptor expression in tumour islets \nand stroma in non-small cell lung cancer\nChandra M Ohri*1,2, Aarti Shikotra1,2, Ruth H Green2, David A Waller3 and Peter Bradding1,2\nAbstract\nBackground: We have previously demonstrated that tumour islet infiltration by macrophages is associated with \nextended survival (ES) in NSCLC. We therefore hypothesised that patients with improved survival would have high \ntumour islet expression of chemokine receptors known to be associated with favourable prognosis in cancer. This \nstudy investigated chemokine receptor expression in the tumour islets and stroma in NSCLC.\nMethods: We used immunohistochemistry to identify cells expressing CXCR1, CXCR2, CXCR3, CXCR4, CXCR5 and CCR1 \nin the tumour islets and stroma in 20 patients with surgically resected NSCLC. Correlations were made with \nmacrophage and mast cell expression.\nResults: There was increased expression of CXCR2, CXCR3, and CCR1 in the tumour islets of ES compared with poor \nsurvival (PS) patients (p = 0.007, 0.01, and 0.002, respectively). There was an association between 5 year survival and \ntumour islet CXCR2, CXCR3 and CCR1 density (p = 0.02, 0.003 and <0.001, respectively) as well as stromal CXCR3 density \n(p = 0.003). There was a positive correlation between macrophage density and CXCR3 expression (rs = 0.520, p = 0.02) \nand between mast cell density and CXCR3 expression (rs = 0.499, p = 0.03) in the tumour islets.\nConclusion: Above median expression of CXCR2, CXCR3 and CCR1 in the tumour islets is associated with increased \nsurvival in NSCLC, and expression of CXCR3 correlates with increased macrophage and mast cell infiltration in the \ntumour islets.\nBackground\nWe have demonstrated previously that the tissue micro-\nlocalisation of immune cells in surgically resected\nNSCLC is a key determinant of patient survival [1,2]. In\nparticular, when macrophages are located within tumour\nepithelial islets, a striking improvement in patient sur-\nvival is evident. This supports the view that these islet-\nassociated macrophages contribute to cytotoxic mecha-\nnisms which limit tumour dissemination. It is not known\nwhy some patients have high levels of potentially cyto-\ntoxic cells in their tumour islets and others do not, but\nthe expression of macrophage-recruiting chemokines\nwithin the tumour islets by either tumour cells them-\nselves or infiltrating immune cells is likely to be a key\nmechanism. Therefore an improved understanding of\nchemoattractant pathways that are active may lead to the\ndevelopment of novel chemotherapeutic agents.\nChemokines are cytokines that have chemotactic prop-\nerties influencing cell migration [3]. Chemokines them-\nselves are released in response to cell activation by\ndiverse cytokines and pathologic stimuli [3]. The\nchemokine superfamily consists of over 40 ligands and\napproximately 20 receptors [3]. They can be classified\ninto four groups: -CXC-, -CC-, -C- and -CX3C - accord-\ning to amino acid position at the N terminal. Several\nchemokines have been shown to be present in cancer tis-\nsue including CCL2, CCL3, CCL4, CCL5, CCL8, CCL17,\nCCL18, CCL20, CCL21, CCL22, CCL27, CCL28, CXCL1,\nCXCL2, CXCL8, CXCL9, CXCL10, CXCL12, and\nCXCL13 [4-6]. An important ligand\/receptor pair is\nCXCL12 and CXCR4 which may be involved in the regu-\nlation of metastasis in NSCLC [7]. CCL5 activates CCR1,\n-3 and -5, and CCL5 expression by tumour cells in\npatients with stage I lung adenocarcinoma has been asso-\nciated with improved survival [8]. CXCL8 (interleukin-8)\nhas two chemokine receptors, CXCR1 and CXCR2 [9].\nCXCL8 is a mediator of angiogenesis in lung cancer [10]\n* Correspondence: cohri@doctors.org.uk\n1 Department of Infection, Immunity and Inflammation, University of Leicester, \nLeicester, UK\nFull list of author information is available at the end of the articleBioMed Central\n© 2010 Ohri et al; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative Commons At-\ntribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in any\nmedium, provided the original work is properly cited.\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 2 of 10and correlates with angiogenesis, tumour progression\nand poor survival in NSCLC [11,12]. Zhu found that cell\nproliferation was significantly reduced by anti-CXCR1\nantibody but not by anti-CXCR2 antibody and concluded\nthat the mitogenic function of CXCL8 in lung cancer is\nmediated mainly by CXCR1 receptor [9]. However, it has\nalso been demonstrated in a murine model that depletion\nof CXCR2 inhibits tumour growth and angiogenesis in\nlung cancer [13]. With respect to immune cell infiltration\nin cancer, CXCR3, along with IFN-γ, may play an impor-\ntant role with respect to NK cell infiltration [14].\nThe precise localisation of chemokine receptor expres-\nsion in NSCLC with respect to tumour islets or stroma\nhas not been examined. Given that we have demonstrated\npreviously that the tissue microlocalisation of mac-\nrophages and mast cells in NSCLC is intimately related\nwith outcome, [1,2], we hypothesised that this principle\nwould also apply to the expression of chemokine recep-\ntors. If true, we would expect that patients with improved\nsurvival would have high tumour islet expression of\nchemokine receptors known to be associated with\nfavourable prognosis in cancer such as CXCR3 and\nCCR1.\nMethods\nStudy Population\nThe study was approved by the Leicestershire Research\nEthics Committee. The tissue specimens evaluated were\nfrom 20 patients with NSCLC who had undergone resec-\ntion with curative intent at the University Hospitals of\nLeicester National Health Service Trust (Leicester, United\nKingdom). These patients had resections during two\nperiods - one dating from 1991 to 1994 and the second\nfrom January to December 1999. This cohort of patients\nhas been described previously [1]. Of the 20 patients\nstudied, 14 were men and average age at surgery was 72.3\nyears (standard deviation, 6.53; range, 60.2 to 82.4 years).\nFull clinicopathologic information was gathered before\nand after surgery, including patient characteristics, treat-\nment, combined clinical and surgical staging results (pre-\noperative staging by computed tomography scan,\nselective mediastinoscopy, and systematic lymph node\nsampling at operation), histologic subtype, tumour grade,\nand survival data. Patients were divided into two groups,\nextended survival (ES) (mean ± SEM 90.8 ± 11.8 months)\nand poor survival (PS) (mean ± SEM 7.9 ± 0.8 months).\nPatient characteristics are shown in Table 1.\nImmunohistology\nSpecimens studied were formalin fixed and paraffin\nembedded. Only blocks containing the advancing edge of\nthe primary tumour were evaluated. Tissue sections of 4\nμm thickness were cut onto glass slides and then de-\nwaxed in xylene and rehydrated through graded alcohols.\nAntigen retrieval was carried out using Trilogy Antigen\nRetrieval solution (Cell Marque, Hot Springs, United\nStates of America) in a pressure cooker (heated to\n117.5°C for 1 min and then cooled to 100°C for 30 sec-\nonds). Mouse antihuman antibodies were used (all R & D\nSystems Europe, Abingdon, United Kingdom) as follows:\nCXCR1 (clone 42705), CXCR2 (clone 48311), CXCR3\n(clone 49801), CXCR4 (clone 44716), CXCR5 (clone\n51505) and CCR1 (clone 53504). Immunostaining was\nperformed and the chemokine receptors were developed\nwith peroxidase and 3,3'-diaminobenzidine tetrahydro-\nchloride (brown reaction product). Sections were then\ncounterstained with haematoxylin and mounted in an\naqueous mounting medium (BDH Chemicals Ltd, Poole,\nUnited Kingdom). Appropriate isotype controls were per-\nformed where the primary antibodies were replaced by\nirrelevant mouse mAb of the same isotype and at the\nsame concentration as the specific primary mAb.\nAnalysis and Validation of Immunostaining\nAnalysis was performed blind with respect to the clinical\noutcome. The ten most representative high-power fields\n(x400) per slide were manually selected using an Olym-\npus BX50 microscope (Olympus, Southall, United King-\ndom). The respective areas of stroma and of tumour-cell\nislets were then measured at ×400 magnification using\nAnalysis imaging software (Soft Imaging System GmbH).\nThe number of nucleated macrophages and cells with\npositive staining for the phenotype marker in each area\nwere then counted manually and expressed as cells\/mm2\nof stroma or tumour islets. Analysis was repeated for 5\npatients to assess repeatability and validity.\nStatistical Analysis\nStatistical analyses were carried out using the GraphPad\nPrism software package (v. 4.02; GraphPad Prism Soft-\nware Inc, San Diego, CA). For categoric analysis, the\nmedian value was used as a cut point to dichotomise the\nseries. The χ2 test was used to test for relationships\nbetween categoric variables, and the Mann-Whitney\nnonparametric test was used to compare categoric with\ncontinuous variables. Kaplan-Meier survival curves were\nused to look for correlations with survival and were com-\npared with the use of the log-rank statistic. For the above\ncomparisons, p < 0.05 was considered statistically signifi-\ncant.\nResults\nPatient Characteristics\nPatent characteristics are shown in Table 1. Of the 20\npatients studied, 15 had died at the time of analysis. Four-\nteen tumours were squamous, 3 adenocarcinoma, 2 large\ncell, and 1 other. Fourteen were stage I and 6 stage II. No\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 3 of 10patients had additional postoperative chemotherapy and\n2 had additional radiotherapy for later palliation.\nValidation of Analysis\nClear and distinguishable staining was evident for the\nchemokine receptors studied (Fig 1). Appropriate isotype\ncontrols were negative. In order to assess the validity of\nthe method, area measurements and cell counts were\nrepeated and intraclass correlation coefficients calcu-\nlated. Good correlations were found for both: 0.997 (95%\nCI, 0.996 to 0.998, p < 0.001) and 0.995 (95% CI, 0.993 to\n0.997, p < 0.001). This method of analysis has also been\nvalidated by our group previously [1,2].\nCellular Distribution\nThe majority of chemokine receptor immunostaining in\nthe tumour islets was present in inflammatory cells and\nrarely seen on tumour epithelial cells. Similarly in the\nstroma, immunostaining was also seen in inflammatory\ncells with no expression evident on vessels. There was\nsignificantly increased expression of CXCR2, CXCR3,\nand CCR1 in the tumour islets of ES compared with PS\nTable 1: Patient characteristics\nCharacteristic Extended Survival Poor Survival\nNo. of patients 10 10\nAge - years 72.0 ± 2.5 72.6 ± 1.6\nMale sex - no. (%) 8 (80) 6 (60)\nYear of surgery - no. (%)\n1992 1 (10) 0 (0)\n1994 0 (0) 1 (10)\n1999 9 (90) 9 (90)\nTumour stage - no. (%)\n1 7 (70) 7 (70)\n2 3 (30) 3 (30)\nHistology - no. (%)\nSquamous 8 (80) 6 (60)\nAdenocarcinoma 2 (20) 1 (10)\nLarge cell 0 (0) 1 (10)\nOther 0 (0) 2 (20)\nTumour Grade - no. (%)\nModerate 4 (40) 0 (0)\nPoor 6 (60) 10 (100)\nAdjuvant Chemotherapy (%) 0 (0) 0 (0)\nRadiotherapy (%) 1 (10) 1 (10)\nPalliative Radiotherapy (%) 1 (10) 1 (10)\nSurvival - months 90.8 ± 11.8 7.9 ± 0.8\nPlus-minus values are means ± SEM\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 4 of 10patients [median 6.5 versus 2.6, (p = 0.007), 12.7 versus\n3.2, (p = 0.01), and 24.3 versus 2.4 cells\/mm2, (p = 0.002),\nrespectively]. There were no significant differences for\nCXCR1, CXCR4, or CXCR5 in either the tumour islets or\nstroma (Figs 2A and 2B). There was significantly\nincreased expression of CXCR2, CXCR3 and CXCR4 in\nthe stroma of ES compared with PS patients (8.9 versus\n1.6, (p = 0.04), 51.4 versus 5.9, (p < 0.001), 24.9 versus 3.1,\n(p = 0.004) (Figs 2C and 2D).\nKaplan-Meier Survival Analysis\nFor further analysis, the data were divided into two\ngroups above and below the median cell count values.\nKaplan-Meier survival curves were plotted to investigate\nfurther the association of cell densities with survival. The\nlogrank statistic was used to compare survival rates.\nThere was a positive association between survival and\ntumour islet CXCR2 (p = 0.02), CXCR3 (p = 0.003) and\nCCR1 (p < 0.001) density, but no significant associations\nbetween survival and tumor islet CXCR1, CXCR4 and\nCXCR5 density (Fig 3A-F). After dichotomisation at the\nmedian cell density for cells expressing each marker, 5-\nyear survival was 50.3% above the median compared with\n19.8% below the median for CXCR2, 60.2% versus 9.9%\nfor CXCR3 and 59.8% versus 9.9% for CCR1. There was a\npositive association between survival and stromal\nCXCR3 (p = 0.003) density, but no significant associa-\ntions between survival and stromal CXCR1, CXCR2,\nCXCR4, CXCR5 and CCR1 density (Fig 4A-F).\nCorrelation with macrophage and mast cell counts\nChemokine receptor expressing cell counts were corre-\nlated against islet and stromal macrophage counts which\nhad been generated previously [1]. It was noted that there\nwere positive correlations for CXCR3 (rs = 0.520, p =\n0.02) and CCR1 (rs = 0.432, p = 0.06) in the islets (Fig 5A\nand 5B). With respect to stromal counts there were nega-\ntive correlations for CXCR2 (rs = -0.455, p = 0.04),\nCXCR3 (rs = -0.844, p < 0.001) and CXCR4 (rs = -0.606, p\n= 0.005)(Fig 5C-E).\nChemokine receptor expressing cell counts were corre-\nlated against islet and stromal mast cell counts which had\nbeen generated previously [1]. There was a positive corre-\nlation for CXCR3 (rs = 0.499, p = 0.03) in the islets (Fig\n5F).\nFigure 1 Immunohistology demonstrating positive chemokines receptor expression (brown) for CXCR1 (A), CXCR2 (B), CXCR3 (C), CXCR4 \n(D), CXCR5 (E) and CCR1 (F). Magnification ×400.\nF\nCA B\nD E\n50 μm\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 5 of 10Discussion & Conclusions\nThe purpose of this study was to investigate the expres-\nsion of chemokine receptors and their microlocalisation\nin surgically resected NSCLC. The results demonstrate\nthat patients with extended survival have significantly\nincreased expression of CXCR2, CXCR3 and CCR1 in\ntheir tumour islets compared to patients with poor sur-\nvival, and significantly increased expression of CXCR2,\nCXCR3 and CXCR4 in their tumour stroma. In addition,\nwe observed that patients with above median expression\nof CXCR2, CXCR3 and CCR1 in their tumour islets and\npatients with above median expression of CXCR3 in their\nstroma had significantly improved 5-year survival. Inter-\nestingly, when chemokine receptor expression was com-\npared with macrophage density in the tumour islets (Fig\n5), it was noted that there was a positive correlation with\nincreasing islet macrophage count and expression of\nCXCR3 and CCR1 and also, between islet mast cell num-\nbers and CXCR3.\nWe have demonstrated previously the importance of\ncellular microlocalisation in terms of potential sites for\nimmune cytotoxicity against NSCLC tumours [1,2]. In\nparticular, NSCLC tumour islets are the likely site of host\ncytotoxic responses against tumour development and\nprogression. Not only does increasing macrophage infil-\ntration of NSCLC tumour islets correlate strongly with\nsurvival, but these macrophages are predominantly of the\nM1 cytotoxic phenotype [2]. Our current results suggest\nFigure 2 Chemokine receptor densities in the tumour islets for extended survival (ES) patients (A) and poor survival (PS) patients (B) and \nin the stroma for ES patients (C) and PS patients (D).\nCXCR1 CXCR2 CXCR3 CXCR4 CXCR5 CCR1\n0\n20\n40\n60\n* * *A\nES ISLETS\nD\nE\nN\nS\nIT\nY\n I\nN\n I\nS\nL\nE\nT\nS\n(C\nE\nL\nL\nS\n\/M\nM\n2 )\nCXCR1 CXCR2 CXCR3 CXCR4 CXCR5 CCR1\n0\n20\n40\n60\nB\nPS ISLETS\nD\nE\nN\nS\nIT\nY\n I\nN\n I\nS\nL\nE\nT\nS\n(C\nE\nL\nL\nS\n\/M\nM\n2 )\nCXCR1 CXCR2 CXCR3 CXCR4 CXCR5 CCR1\n0\n20\n40\n60D\nPS STROMA\nD\nE\nN\nS\nIT\nY\n I\nN\n S\nT\nR\nO\nM\nA\n(C\nE\nL\nL\nS\n\/M\nM\n2 )\nCXCR1 CXCR2 CXCR3 CXCR4 CXCR5 CCR1\n0\n20\n40\n60\n140\n200 ***C\nES STROMA\nD\nE\nN\nS\nIT\nY\n I\nN\n S\nT\nR\nO\nM\nA\n(C\nE\nL\nL\nS\n\/M\nM\n2 )\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 6 of 10\nFigure 3 Kaplan-Meier five year survival curve for chemokines receptor densities in the tumour islets for CXCR1(A), CXCR2 (B), CXCR3 (C), \nCXCR4 (D), CXCR5 (E) and CCR1 (F).\n       \n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.003\nISLETS CXCR3C\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.43\nISLETS CXCR4D\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.39\nISLETS CXCR5E\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np < 0.001\nISLETS CCR1F\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 7 of 10\nFigure 4 Kaplan-Meier five year survival curve for chemokines receptor densities in the tumour stroma for CXCR1(A), CXCR2 (B), CXCR3 (C), \nCXCR4 (D), CXCR5 (E) and CCR1 (F).\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.46\nSTROMA CXCR1A\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.40\nSTROMA CXCR2B\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.003\nSTROMA CXCR3C\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.05\nSTROMA CXCR4D\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.77\nSTROMA CXCR5E\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\n0 250 500 750 1000 1250 1500 1750 2000\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n> Median\n< Median\np = 0.06\nSTROMA CCR1F\nDays\nP\ner\nce\nn\nt \nsu\nrv\niv\nal\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 8 of 10\nFigure 5 Correlations between chemokine receptor and macrophage cell counts in the tumour islets for CXCR3 (A) and CCR1 (B), in the tu-\nmour stroma for CXCR2 (C), CXCR3 (D), and CXCR4 (E), and between mast cells and CXCR3 (F) in the tumour islets.\n0 10 20 30 40 50\n0\n250\n500\n750\n1000\np = 0.02\nSpearman r = 0.520\nA\nCXCR3 count (cells\/mm2)\nIslets\nM\nac\nro\nph\nag\ne \nco\nun\nt \n (\nce\nlls\n\/m\nm\n2 )\nIs\nle\nts\n0 10 20 30 40 50\n0\n250\n500\n750\n1000\np = 0.06\nSpearman r = 0.432\nB\nCCR1 count (cells\/mm2)\nIslets\nM\nac\nro\np\nh\nag\ne \nco\nu\nn\nt \n (\nce\nll\ns\/\nm\nm\n2 )\nIs\nle\nts\n0 10 20 30 40 50\n0\n500\n1000\n1500\n2000\np = 0.04\nSpearman r = -0.455\nC\nCXCR2 count (cells\/mm2)\nStroma\nM\nac\nro\np\nh\nag\ne \nco\nu\nn\nt \n (\nce\nll\ns\/\nm\nm\n2 )\nS\ntr\no\nm\na\n0 10 20 30 40 50\n0\n500\n1000\n1500\n2000\np < 0.001\nSpearman r = -0.844\nD\nCXCR3 count (cells\/mm2)\nStroma\nM\nac\nro\nph\nag\ne \nco\nun\nt \n (\nce\nlls\n\/m\nm\n2 )\nS\ntr\nom\na\n0 10 20 30 40 50 60\n0\n500\n1000\n1500\n2000\np = 0.005\nSpearman r = -0.606\nE\nCXCR4 count (cells\/mm2)\nStroma\nM\nac\nro\nph\nag\ne \nco\nun\nt \n (\nce\nlls\n\/m\nm\n2 )\nS\ntr\nom\na\n0 10 20 30 40 50 60 70\n0\n10\n20\n30\n40\n50\np = 0.03\nSpearman r = 0.499\nF\nCXCR3 count (cells\/mm2)\nIslets\nM\nas\nt \nce\nll\n c\no\nu\nn\nt \n (\nce\nll\ns\/\nm\nm\n2 )\nIs\nle\nts\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 9 of 10that the chemokine receptor CCR1 which is expressed by\nmacrophages, may be involved in the chemotactic path-\nway which recruits M1 macrophages into the tumour\nislets. Of particular relevance to this, a CCR1 ligand\nCCL5, is over-expressed in NSCLC tumours character-\nized by T lymphocyte infiltration [8]. Of further rele-\nvance, one of the ligands for CCR1 is CCL3 which is\nthought to stimulate the production and release of TNFα,\na cytokine that is expressed and which has cytotoxic\npotential in the tumour islets [2].\nCXCR3 has not been described on macrophages, but is\nexpressed on cytotoxic NK cells [14], human lung mast\ncells [15] and T lymphocytes [16]. These cell types are\nassociated with improved survival in NSCLC [1,17,18],\nand are likely to interact with macrophages in mediating\ntumour killing. CXCR3 expression was markedly\nincreased in both the tumour islets and stroma in NSCLC\npatients with extended survival compared to those with\npoor survival. Tumours enriched for cells expressing\nCXCR3 are likely to be producing excess quantities of one\nor all of the CXCR3 ligands, CXCL9, -10 and -11.\nCXCL10 has been shown to be expressed by tumour epi-\nthelial cells in squamous NSCLC [19]. CXCR3 agonists\nprotect against tumour dissemination in mouse models\n[19-21], observations supported by the improved out-\ncome associated with increased CXCR3 expression in\nthis study. In mouse models, CXCR3 ligands are thought\nto work predominantly through inhibition of angiogene-\nsis, but our findings of CXCR3 expression on numerous\ninflammatory cells, suggests an important role in the host\nanti-tumour immune response. The CXCR3 ligands can\nbe produced by a number of inflammatory and structural\ncells, and are typically thought of as markers of a Th1\nimmunological response as they are induced predomi-\nnantly by IFNγ and TNFα [22]. Overall, the increased\nexpression of CXCR3 on inflammatory cells within the\nNSCLC tumour stroma and islets in patients with\nextended survival, supports the view that cytotoxic cell-\nmediated immunity contributes to protection of the host\nagainst NSCLC progression, and suggests that augment-\ning this arm of the immunological response may be bene-\nficial clinically.\nExamining the expression and cellular provenance of\nthe ligands for CXCR3 and CCR1 will be important in\nfuture studies of NSCLC. CCR1 ligands can also be pro-\nduced by a variety of immune and structural cells, and\nCCL5 is produced by NSCLC tumour epithelial cells [8].\nIt is attractive to speculate therefore that the key factor\ndetermining the nature, intensity and microlocalisation\nof the immune response in NSCLC is the pattern and\nintensity of chemokine production by the tumour itself.\nOur finding of distinct chemokine receptor patterns in\nthe tumour and stroma which associate with survival\nsupports this view.\nThe chemokine receptor CXCR4 is implicated in the\nregulation of cancer growth, metastasis, relapse and\nresponse to treatment. In patients with NSCLC, CXCR4\nexpression has been found on circulating cytokeratin+\ncells, with increased expression correlating with\nimproved survival [23]. Our results suggest that increased\nexpression of CXCR4 in the NSCLC stroma relates to\nimproved survival. From our previous investigations\n[1,2], however, the tumour islets appears to be the critical\nmicro-compartment for host immune responses against\nNSCLC. Further work will therefore be required to\nunderstand the biological role of stromal CXCR4 expres-\nsion.\nThe chemokine receptor CXCR2 exerts multiple func-\ntions depending on the cell type it is expressed on. In\nNSCLC it is generally considered to promote tumorigen-\nesis and metastasis through the induction of angiogenesis\n[9,13]. However, it is also implicated in the senescence of\npre-neoplastic cells and may inhibit neoplastic transfor-\nmation [24]. In our NSCLC tissue samples, CXCR2 in the\ntumour islets was not seen on tumour epithelial cells but\nwas present on inflammatory cells. Interestingly, its\nexpression was increased in the tumour islets of patients\nwith extended survival compared to those with poor sur-\nvival. This is compatible with the suggestion that loss of\nCXCR2 on tumour epithelial cells promotes neoplastic\ntransformation in NSCLC [24], but also suggests that\nCXCR2 may serve to limit tumour growth through its\nexpression on inflammatory cells recruited to the tumour.\nThus CXCR2 may have dual roles in NSCLC, promoting\ntumour progression through the induction of angiogene-\nsis in the stroma, but limiting tumour growth through the\nrecruitment of inflammatory cells to the tumour islets.\nTargeting CXCR2 in NSCLC may therefore prove to have\nunpredictable effects depending on the relative balance\nbetween these two opposing activities.\nIn summary, above median expression of the\nchemokine receptors CXCR2, CXCR3 and CCR1 in the\ntumour islets is associated with increased 5-year survival.\nIncreased expression of CXCR3 and CCR1 correlates\nwith increased macrophage expression in the tumour\nislets and therefore these receptors may be involved in\nthe pathway that attracts cytotoxic M1 macrophages,\nmast cell, B cells, T cells and NK cells into the tumour\nislets. Therefore, if a therapeutic agent could increase the\nproduction of the ligands for CXCR3 and CCR1 by the\ntumour epithelial cell, this might lead to an improved\nimmune response to NSCLC and thus better survival.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthors' contributions\nCO carried out the immunohistochemical staining, slide analysis, statistical\nanalysis and prepared the manuscript. AS assisted with microtomy and the\nimmunohistochemical staining. RG carried out the statistical analysis. DW pro-\nOhri et al. BMC Cancer 2010, 10:172\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\nPage 10 of 10vided the samples for analysis and prepared the manuscript. PB conceived the\nstudy, participated in its design and coordination, and prepared the manu-\nscript. All authors have read and approved the final manuscript.\nAcknowledgements\nFunding for this study was provided by the James Maxwell Grant Prophit Fel-\nlowship awarded to Dr Chandra Ohri by the Royal College of Physicians, Lon-\ndon, United Kingdom.\nAuthor Details\n1Department of Infection, Immunity and Inflammation, University of Leicester, \nLeicester, UK, 2Institute for Lung Health, Department of Respiratory Medicine, \nGlenfield Hospital, Leicester, UK and 3Department of Thoracic Surgery, \nGlenfield Hospital, Leicester, UK\nReferences\n1. Welsh TJ, Green RH, Richardson D, Waller DA, O'Byrne KJ, Bradding P: \nMacrophage and mast-cell invasion of tumor cell islets confers a \nmarked survival advantage in non-small-cell lung cancer.  J Clin Oncol \n2005, 23(35):8959-8967.\n2. Ohri CM, Shikotra A, Green RH, Waller DA, Bradding P: Macrophages \nwithin NSCLC tumour islets are predominantly of a cytotoxic M1 \nphenotype associated with extended survival.  Eur Respir J 2009, \n33(1):118-126.\n3. Rossi D, Zlotnik A: The Biology of Chemokines and their Receptors.  \nAnnual Review of Immunology 2000, 18(1):217-242.\n4. Mantovani A, Sica A, Sozzani S, Allavena P, Vecchi A, Locati M: The \nchemokine system in diverse forms of macrophage activation and \npolarization.  Trends Immunol 2004, 25(12):677-686.\n5. Allavena P, Garlanda C, Borrello MG, Sica A, Mantovani A: Pathways \nconnecting inflammation and cancer.  Curr Opin Genet Dev 2008, \n18(1):3-10.\n6. Balkwill F: Cancer and the chemokine network.  Nat Rev Cancer 2004, \n4(7):540-550.\n7. Phillips RJ, Burdick MD, Lutz M, Belperio JA, Keane MP, Strieter RM: The \nstromal derived factor-1\/CXCL12-CXC chemokine receptor 4 biological \naxis in non-small cell lung cancer metastases.  Am J Respir Crit Care Med \n2003, 167(12):1676-1686.\n8. Moran CJ, Arenberg DA, Huang CC, Giordano TJ, Thomas DG, Misek DE, et \nal.: RANTES Expression Is a Predictor of Survival in Stage I Lung \nAdenocarcinoma.  Clin Cancer Res 2002, 8(12):3803-3812.\n9. Zhu YM, Webster SJ, Flower D, Woll PJ: Interleukin-8\/CXCL8 is a growth \nfactor for human lung cancer cells.  Br J Cancer 2004, 91(11):1970-1976.\n10. Smith DR, Polverini PJ, Kunkel SL, Orringer MB, Whyte RI, Burdick MD, et al.: \nInhibition of interleukin 8 attenuates angiogenesis in bronchogenic \ncarcinoma.  J Exp Med 1994, 179(5):1409-1415.\n11. Yuang ANG, Yang PC, Yu CJ, Chen WJ, Lin FY, Kuo SH, et al.: Interleukin-8 \nMessenger Ribonucleic Acid Expression Correlates with Tumor \nProgression, Tumor Angiogenesis, Patient Survival, and Timing of \nRelapse in Non-Small-Cell Lung Cancer.  Am J Respir Crit Care Med 2000, \n162(5):1957-1963.\n12. Masuya D, Huang C, Liu D, Kameyama K, Hayashi E, Yamauchi A, et al.: The \nintratumoral expression of vascular endothelial growth factor and \ninterleukin-8 associated with angiogenesis in nonsmall cell lung \ncarcinoma patients.  Cancer 2001, 92(10):2628-2638.\n13. Keane MP, Belperio JA, Xue YY, Burdick MD, Strieter RM: Depletion of \nCXCR2 inhibits tumor growth and angiogenesis in a murine model of \nlung cancer.  J Immunol 2004, 172(5):2853-2860.\n14. Wendel M, Galani IE, Suri-Payer E, Cerwenka A: Natural Killer Cell \nAccumulation in Tumors Is Dependent on IFN-{gamma} and CXCR3 \nLigands.  Cancer Res 2008, 68(20):8437-8445.\n15. Brightling CE, Kaur D, Berger P, Morgan AJ, Wardlaw AJ, Bradding P: \nDifferential expression of CCR3 and CXCR3 by human lung and bone \nmarrow-derived mast cells: implications for tissue mast cell migration.  \nJ Leukoc Biol 2005, 77(5):759-766.\n16. Newton P, O'Boyle G, Jenkins Y, Ali S, Kirby JA: T cell extravasation: \ndemonstration of synergy between activation of CXCR3 and the T cell \nreceptor.  Mol Immunol 2009, 47(2-3):485-492.\n17. Takanami I, Takeuchi K, Giga M: The prognostic value of natural killer cell \ninfiltration in resected pulmonary adenocarcinoma.  J Thorac \nCardiovasc Surg 2001, 121(6):1058-1063.\n18. Villegas FR, Coca S, Villarrubia VG, Jimenez R, Chillon MJ, Jareno J, et al.: \nPrognostic significance of tumor infiltrating natural killer cells subset \nCD57 in patients with squamous cell lung cancer.  Lung Cancer 2002, \n35(1):23-28.\n19. Arenberg DA, Kunkel SL, Polverini PJ, Morris SB, Burdick MD, Glass MC, et \nal.: Interferon-gamma-inducible protein 10 (IP-10) is an angiostatic \nfactor that inhibits human non-small cell lung cancer (NSCLC) \ntumorigenesis and spontaneous metastases.  J Exp Med 1996, \n184(3):981-992.\n20. Addison CL, Arenberg DA, Morris SB, Xue YY, Burdick MD, Mulligan MS, et \nal.: The CXC chemokine, monokine induced by interferon-gamma, \ninhibits non-small cell lung carcinoma tumor growth and metastasis.  \nHum Gene Ther 2000, 11(2):247-261.\n21. Arenberg DA, Keane MP, DiGiovine B, Kunkel SL, Strom SR, Burdick MD, et \nal.: Macrophage infiltration in human non-small-cell lung cancer: the \nrole of CC chemokines.  Cancer Immunol Immunother 2000, 49(2):63-70.\n22. Matsuda A, Fukuda S, Matsumoto K, Saito H: Th1\/Th2 cytokines \nreciprocally regulate in vitro pulmonary angiogenesis via CXC \nchemokine synthesis.  Am J Respir Cell Mol Biol 2008, 38(2):168-175.\n23. Reckamp KL, Figlin RA, Burdick MD, Dubinett SM, Elashoff RM, Strieter RM: \nCXCR4 expression on circulating pan-cytokeratin positive cells is \nassociated with survival in patients with advanced non-small cell lung \ncancer.  BMC Cancer 2009, 9:213.\n24. Yanagawa J, Walser TC, Zhu LX, Hong L, Fishbein MC, Mah V, et al.: Snail \nPromotes CXCR2 Ligand-Dependent Tumor Progression in Non-Small \nCell Lung Carcinoma.  Clin Cancer Res 2009, 15(22):6820-9.\nPre-publication history\nThe pre-publication history for this paper can be accessed here:\nhttp:\/\/www.biomedcentral.com\/1471-2407\/10\/172\/prepub\ndoi: 10.1186\/1471-2407-10-172\nCite this article as: Ohri et al., Chemokine receptor expression in tumour \nislets and stroma in non-small cell lung cancer BMC Cancer 2010, 10:172\nReceived: 8 December 2009 Accepted: 29 April 2010 \nPublished: 29 April 2010\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2407\/10\/172© 2010 Ohr  et al; licensee BioMed Central Ltd. is an Op n Access article distributed under th  terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.BMC C c r 2010, 10:172\n"}