{"doi":"10.1016\/j.csr.2010.07.002","coreId":"56891","oai":"oai:nora.nerc.ac.uk:10388","identifiers":["oai:nora.nerc.ac.uk:10388","10.1016\/j.csr.2010.07.002"],"title":"A survey of recent changes in the main components of the ocean tide","authors":["Woodworth, P. L."],"enrichments":{"references":[],"documentType":{"type":0.4444444444}},"contributors":[],"datePublished":"2010","abstract":"Changes in the ocean tide during the 20th century have been reported for several parts of the world by different authors. However, it has not always been clear whether the observed changes have been local or regional in scale. This paper reports on a survey of tidal changes in recent decades using a quasi-global data set of tide gauge information. Little evidence has been found in Europe or the Far East (including Australasia and Asia) for the extensive regional changes to the main tidal constituents reported recently for N America. However, evidence for change in smaller regions can be identified wherever the density of tide gauge information allows. Therefore, it seems that tidal changes may be commonplace around the world, although not necessarily with large spatial scales. All of the reported changes have been difficult to explain. However, it is hoped that quasi-global surveys such as the present one may eventually provide further insight","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/56891.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10388\/1\/gtide_nora_26july2010_ds.pdf","pdfHashValue":"6cf76a44b16f90156de3beb97882c8eecad4bd4c","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10388<\/identifier><datestamp>\n      2012-11-22T12:11:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10388\/<\/dc:relation><dc:title>\n        A survey of recent changes in the main components of the ocean tide<\/dc:title><dc:creator>\n        Woodworth, P. L.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        Changes in the ocean tide during the 20th century have been reported for several parts of the world by different authors. However, it has not always been clear whether the observed changes have been local or regional in scale. This paper reports on a survey of tidal changes in recent decades using a quasi-global data set of tide gauge information. Little evidence has been found in Europe or the Far East (including Australasia and Asia) for the extensive regional changes to the main tidal constituents reported recently for N America. However, evidence for change in smaller regions can be identified wherever the density of tide gauge information allows. Therefore, it seems that tidal changes may be commonplace around the world, although not necessarily with large spatial scales. All of the reported changes have been difficult to explain. However, it is hoped that quasi-global surveys such as the present one may eventually provide further insights<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10388\/1\/gtide_nora_26july2010_ds.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Woodworth, P. L..  2010  A survey of recent changes in the main components of the ocean tide.   Continental Shelf Research, 30 (15). 1680-1691.  https:\/\/doi.org\/10.1016\/j.csr.2010.07.002 <https:\/\/doi.org\/10.1016\/j.csr.2010.07.002>     \n <\/dc:identifier><dc:relation>\n        10.1016\/j.csr.2010.07.002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10388\/","10.1016\/j.csr.2010.07.002"],"year":2010,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\n26 July 2010  \n \nA Survey of Recent Changes in the Main Components of the Ocean Tide \n \nP.L. Woodworth \nNational Oceanography Centre, Joseph Proudman Building, \n6 Brownlow Street, Liverpool L3 5DA, United Kingdom \n \nAbstract \n \nChanges in the ocean tide during the 20th century have been reported for several parts of the world \nby different authors. However, it has not always been clear whether the observed changes have \nbeen local or regional in scale. This paper reports on a survey of tidal changes in recent decades \nusing a quasi-global data set of tide gauge information. Little evidence has been found in Europe or \nthe Far East (including Australasia and Asia) for the extensive regional changes to the main tidal \nconstituents reported recently for N America. However, evidence for change in smaller regions can \nbe identified wherever the density of tide gauge information allows. Therefore, it seems that tidal \nchanges may be commonplace around the world, although not necessarily with large spatial scales. \nAll of the reported changes have been difficult to explain. However, it is hoped that quasi-global \nsurveys such as the present one may eventually provide further insights. \n  \n \nKeywords: Ocean Tides; Sea Level Variations; Decadal Ocean Variability \n 2\n \n \n1. Introduction \n \nChanges in mean sea level have been the subject of much recent research owing to their association \nwith climate change (Bindoff et al., 2007). Changes in extreme sea levels, and the consequent \nchanges in flood risk, have also been investigated in some detail (Lowe et al., 2010). In most of \nthese studies, the ocean tide is regarded as having undergone little change and, it is assumed, will \nnot change significantly over the next few decades. \n \nHowever, it seems that there were indeed measurable changes in the ocean tide during the 20th and \nearly 21st centuries, that at some locations were comparable to those in the mean level. The \nobserved changes have not been confined to particular stations, or localised estuaries or bays, but \nhave occurred over large sections of the world coastline. In most cases, the changes are not \nunderstood and require further investigation. Amongst recent papers, Ray (2006, 2009) has pointed \nto increases in the amplitude of the M2 tide in the near-resonant Gulf of Maine and along most of \nthe NE American coast, and also to considerably larger (in percentage terms) decreases in S2 \namplitude. At certain American Atlantic stations the S2 amplitude has exhibited a negative trend \nexceeding 10% per century (0.1% per year). Jay (2009) described changes along the Pacific coasts \nof N and S America with increases in amplitude of order 2% per century (0.02% per year) in both \nsemi-diurnal and diurnal bands for stations north of 18° N. These recent regional studies have \npresented a more comprehensive overview of tidal change than most made previously which tended \nto concentrate on records from individual countries or locations (e.g. Woodworth et al., 1991 for \n 3\nthe UK, and references therein relating to neighbouring European countries; Flick et al., 2003 for \nthe USA; Hollebrandse, 2005 for the Netherlands). \n \nThe purpose of the present paper is to present a survey of the extent of recent tidal changes by \nmaking use of a quasi-global sea level data set, with the aim of the tidal community deriving further \ninsights from them. The GESLA (Global Extreme Sea Level Analysis) data set was compiled \nthrough a collaborative activity of the Antarctic Climate and Ecosystems Cooperative Research \nCentre (ACE CRC), Australia and the National Oceanography Centre (NOC), Liverpool, UK in \norder to study variations in extreme sea levels (e.g. Menéndez and Woodworth, 2010). However, it \nalso provides what is probably at the present time the best source of information on regional and \nlarge-scale tidal changes. \n \nThe GESLA data set consists of 675 separate sea level records, with many duplicates, obtained \nfrom the archives of the University of Hawaii Sea Level Center (UHSLC, uhslc.soest.hawaii.edu), \nthe Global Sea Level Observing System (GLOSS) Delayed Mode centre (www.gloss-sealevel.org), \nand a number of national data centres. Its focus is on providing information on extreme sea levels \nin recent decades. As a consequence, while it has useful spatial coverage for the 1970s onwards, it \ncontains only a small number of records that span most of the 20th century. It is our intention that \nfuture versions of the data set will contain a larger number of long records. However, in the \nmeantime, the analysis presented below demonstrates how the shorter records may be used to \nprovide insight into century-timescale tidal changes, on at least a data set-average, if not an \nindividual station, basis. \n \n 4\n2. Methods  \n \nIn this study, we concentrate on the 2 main semi-diurnal (M2 and S2) and diurnal (K1 and O1) \ncomponents of the ocean tide. S2 differs from the other constituents in being ‘radiational’ as well as \ngravitational in origin (Cartwright, 1977; Pugh, 1987). The amplitudes and phase lags of each \nconstituent were obtained from analysis of separate calendar years of data using the NOC Tidal \nAnalysis Software Kit (TASK, Bell et al., 1996), selecting only those years of data for which tidal \nmeasurements were at least 75% complete. For a one-year analysis, TASK assumes equilibrium \ntide relationships between a tidal harmonic and its nodal (18.61 year) sidebands. That is to say, it \nassumes an approximately 3.7, 0.0, 12 and 19% variation in amplitude (this is usually referred to as \nthe nodal factor ‘f’), and approximately 2.1, 0.0, 9 and 11 degrees variation in phase lag (nodal \nfactor ‘u’), over 18.61 years for M2, S2, K1 and O1 respectively (Doodson and Warburg, 1941). \nConsequently, any real non-equilibrium relationship will result in an apparent 18.61 years variation \nin harmonic ‘constants’ (amplitudes and phase lags) due to the imperfect nodal parameterization, \nand that apparent variation (which we denote as ‘residual variation’ below) could be misinterpreted \nin a short record as a secular trend in the tidal constants. \n \nEach time series of amplitude or phase lag derived from the annual analyses of each tide gauge \nrecord was parameterized in terms of an 18.61 year sinusoidal cycle plus a secular trend, the former \nto account for any residual (non-equilibrium) nodal component. Four parameters were obtained \nfrom these linear regressions: \n \n 5\n1. The rate of change of the amplitude of the constituent expressed as a percentage change per \nyear (RPA). \n2. The rate of change of the phase lag of the constituent expressed in degrees per year (RPL). \n3. The amplitude of the residual nodal variation expressed as a percentage of the mean \namplitude (PNOD). \n4. An integer (NSIGN) which flags whether the residual nodal variation peaks closer to N (the \nmean longitude of the lunar ascending node) equal to 0° rather than to N equal to 180° (i.e. \nwhether any residual nodal variation peaks closer to 1950.62 ± n 18.61 rather than in \nbetween); NSIGN is defined as -1 and +1 respectively.  \n \nAs a check on the method, parameterizations were made to time series for stations reported by \nWoodworth et al. (1991), Araújo and Pugh (2008), Ray (2006, 2009) and Jay (2009) using the same \nspans of data employed by those authors. In each case, almost identical findings were obtained for \ntrends in tidal constants and, in the case of Ray (2006), for the amplitude of nodal variations.  \n \n(A reviewer has pointed out correctly that an alternative approach would be to conduct first a tidal \nanalysis of all the data in each record, thereby determining empirical average nodal ‘f’ and ‘u’ \nfactors which can be applied subsequently to each separate annual tidal analysis cf. Foreman and \nNeufeld (1991). Such an approach should lead to similar conclusions on trends in amplitudes and \nphase lags.) \n \nIn order to obtain an optimum spatial coverage of observations of tidal change from the GESLA \ndata set, it was necessary to make use of many of the records which span only the last few decades. \n 6\nFindings based on these shorter records were validated with the use of the long records in the data \nset, by performing one analysis over the entire record length and a second analysis over a shorter \nperiod. In this way, notwithstanding the undoubtedly valid observations of Ray (2009) that trends \nin tidal constants can themselves have a temporal dependence, the suitability of the shorter records \nto provide information relevant to century timescale trends can be tested. In addition, the ability of \nthe shorter records to determine reliable nodal (18.61 year) parameters from as little as 30 years of \ndata can be determined. \n \nConsequently, subset A of the data set was defined, consisting of 83 long records with at least 50 \nyears of information and with any start and end date of the record allowed (the earliest start date \nbeing 1846 and the latest 1955). Then, subset B was defined, consisting of 220 records with at least \n30 years of information starting in 1950 or later. Subset A is dominated by the long N American \nrecords discussed by Ray (2006, 2009) and Jay (2009), with relatively few from outside the \nAmericas. Nevertheless, the origin of the records should not be a critical factor in a test of methods. \n \nValues of RPA, RPL and PNOD were selected for a constituent from each subset only if they were \nconsidered to be meaningful, which meant that: (i) the time series of amplitudes or phase lags \ncontained no large outliers (defined as more than 30% and 20 degrees respectively) and (ii) the \naverage amplitude of the constituent was larger than a certain threshold (5 cm for M2 and 2.5 cm \nfor the other constituents). The second test was applied as, in low tidal amplitude areas, the records \nwill contain relatively larger amounts of non-tidal variability and conclusions on tidal change may \nbe more difficult to arrive at. The result of applying these requirements to the time series of each \n 7\nconstituent is that a slightly different number of subset-pairs were selected for each constituent and \nparameter. \n \nFigure 1 presents the measured trends in percentage amplitude (RPA) from stations in subset A, \nusing all their data or only that part of their records which would be included in subset B. Although \nsome stations yield very different trends with the two selection criteria, most demonstrate similar \nvalues, with correlation coefficients between RPA values from the two subsets given in Table 1. \nOne observes that the highest correlation is obtained for S2, although it is difficult to assign a \nreason for that. A similar correspondence is obtained for trend in phase lag (RPL, Figure 2, Table \n1) and percentage nodal amplitude (PNOD, Figure 3, Table 1). There is good agreement for the \nlatter for both small and large residual nodal variations. The similarity of findings shown by these \nfigures demonstrates that the shorter subset B criteria are capable, in most if not all cases, of \nproviding information on secular tidal change on timescales comparable to those records in subset \nA (i.e. century timescales). \n \nTable 2 shows the number of occasions on which the same or different value of NSIGN was \nobtained from the subset-pairs. The number with the same sign can be seen to be considerably in \nexcess of those with different sign. Table 2 also shows, for pairs with the same NSIGN, how many \nhave values of +1 or -1. In the case of S2, it is interesting that most have NSIGN=-1, indicating \nmaximum S2 amplitude at N=0 when M2 amplitude is minimum. \n \nGiven that the above tests provide confidence in the use of the shorter records, one can progress to \nmake use of all subset B records to study spatial variations in each tidal parameter. However, prior \n 8\nto that investigation, it was necessary to remove duplicate information which originated from a \nnumber of records in the GESLA data set having been obtained for the same stations but from \ndifferent sources. The duplicate removal criteria rejected a record if it was shorter than another \nfrom the same station (after application of the selection criteria A or B), or, if record lengths were \nthe same, the record with the larger standard error on the fitted trend was rejected. For a small \nnumber of stations, the data set contains 3 or more records, and the duplicate removal criteria were \napplied iteratively such that only one record survived for each station. After duplicate removal, 67 \nrecords remained in subset A with average length 77.4 years, while 176 records remained in subset \nB with average length 43.3 years. \n \n3. Results \n \nIn this section, we concentrate on findings from three regions (N America, Europe and the ‘Far \nEast’ which includes Australasia and Asia) as they contain the majority of records in the data set. \n(Additional figures and tables of parameters may be found in the Author Archive of the Permanent \nService for Mean Sea Level, www.psmsl.org\/products\/author_archive\/).  We present first the \nvalues of the four parameters obtained from the regression fits for the stations in each region, and \nthen discuss the significance of the findings. \n \nFigures 4-6 (a,b) shows subset B findings for RPA and RPL for the four constituents for stations in \nN America, Europe and the Far East respectively. Positive and negative trends from records which \nsatisfy the requirements (i-ii) given above are shown in red and blue respectively. Stations shown \n 9\nby a small black do not satisfy one or both of the requirements. Most of these are in the low tidal \namplitude areas which fail requirement (ii).  \n \nFigure 4(a) reproduces the strong negative trends in S2 amplitudes on the Atlantic coast discussed \nby Ray (2009), with the use of longer records in his case. Such changes are considerably in excess \n(in percentage terms) of those reported for M2 which tend to be of opposite sign. In addition, the \nlargely positive values for all constituents on the Pacific coast obtained by Jay (2009) can be clearly \nseen. In this region also, S2 percentage changes are considerably larger than those for M2. Positive \ntrends for the diurnals can be observed on the Atlantic coast south of Cape Hatteras and in the Gulf \nof Mexico: further north a more mixed picture is obtained but the local sign of RPA tends to be \nsupported by more than one record, which provides confidence in the quality of the data set and in \nthe representativeness of the derived trends for the area. Occasionally, individual stations present \nvalues which do not conform to what appears to be the regional behaviour. For example, Ray \n(2009) discussed the consequences of tide gauge relocation at Bermuda, and the fact that the \nWilmington record represents river rather than ocean tides, in his discussion of Atlantic S2 change. \nBoth of these examples can be seen as anomalies in Figure 4(a). Reasons for individual stations to \ndepart from regional norms are discussed below. However, it can be seen that, if not too many \nstations have such problems, then it is still possible to arrive at regional conclusions. \n \nRPL values (Figure 4b) are mostly negative for M2, K1 and O1 (rather less so for S2) for the Pacific \ncoast with the exception of the area around and to the north of Vancouver. Positive and negative \ntrends tend to exist in clusters on the east coast, especially so for the diurnals. Figure 4(c) presents \nvalues of PNOD obtained from the regression fits. On the Pacific coast, values are of the order of \n 10\n0.5% or less at most locations, indicating that the equilibrium assumption employed in TASK was a \ngood approximation for the real ocean. Non-equilibrium values exceed 1% at many locations on the \nAtlantic coast, especially so for the diurnals. However, given that the equilibrium nodal variations \nfor diurnals are relatively large, a residual signal of only 1% still represents a fair representation of \nan equilibrium response. The non-zero percentage nodal values for S2 on the Atlantic coast are a \nparticularly interesting finding, given that S2 is a solar constituent.  NSIGN parameter values of -1 \nfor almost all stations in this area indicate that maximum S2 amplitude occurs when M2 amplitude \nis minimum, consistent with non-linear shallow water interactions between the two main semi-\ndiurnal constituents. \n \nA more mixed picture is obtained in Europe than in N America. Figure 5(a) shows positive RPA for \nM2, S2 and O1 in the eastern North Sea while the three constituents demonstrate both signs around \nthe UK. K1 trends are positive at most locations around the UK and in the region in general. Spatial \nconsistency in RPL is harder to identify (Figure 5b). In the southern North Sea, many of the \nstations with positive RPA for M2 tend to have negative RPL. S2 RPL values are positive at most \nlocations. RPL values for O1 are positive on the east coast of the UK and on the adjacent European \nNorth Sea coast, but are negative on the west coast. A largely opposite pattern is seen for K1. These \nfindings can be considered in combination with those obtained by Shaw and Tsimplis (2009), who \nused records for more stations in the central and eastern Mediterranean than are in GESLA (most of \ntheir records had comparable length to those in subset B); negative trends in phase lag were \nobtained for most constituents. \n \n 11\nFindings from the present analysis for the PNOD parameter (Figure 5c) show low values for M2 in \nScotland and of the order of 1% or less elsewhere around the UK, consistent with previous research \n(Woodworth et al., 1991). Larger values can be seen in the eastern North Sea and smaller ones on \nthe Atlantic coasts of Norway and Iberia. For the majority of stations in this area NSIGN=-1. \nLarger values of PNOD for S2 are obtained than for M2 around the UK, and especially in the \neastern North Sea, again with NSIGN=-1 and consistent with previous research (Amin, 1983, \n1985). PNOD values for the diurnals are approximately 1% at most locations, suggesting a \nreasonable approximation of equilibrium expectations given the larger nodal variations for diurnals \nthan for semi-diurnals. \n \nFor the Far East, Figure 6(a) shows most values for RPA for each constituent to be positive around \nAustralia, with the main exception of several stations in South Australia for the semi-diurnals. \nStations in Japan show mostly negative RPA values in the north and positive ones in the south. \nPositive values are obtained for the semi-diurnals at most tropical Pacific islands. RPL values are \nlargely negative for all constituents around Australia and Japan (Figure 6b), although there is \nevidence for local clusters of opposite sign. Values of PNOD for the semi-diurnal constituents \nindicate greater spatial variability than for N America and Europe (Figure 6c). Exceptionally large \nvalues (~2%) are obtained for S2 in SE Australia. PNOD values for K1 and O1 in Australia are \nlarger in the east (~1%) than the west (~0.5%) while values of order 1% can be seen in Japan and at \ntropical islands. \n \nAside from the three regions discussed above, subset B contains only a small number of stations in \nS America and one station in Africa. The main conclusions from these regions are that RPA values \n 12\nfor M2 on the Pacific coast of S America are negative near to the Equator and positive further south \n(cf. Jay, 2009), while S2 values are mostly positive. The diurnals show little spatial consistency. \nValues of RPL for M2 are negative for most stations on the Pacific coast and positive in southern \nBrazil. \n \nWe now turn to the question of whether the trends in Figures 4-6 (a,b) (and similar figures with 5 \ntimes the colour scale range available in the PSMSL Author Archive) are significantly different \nfrom zero. This question can be addressed in several ways. First, the regression fits provide formal \nstandard errors on the trends at each station, and findings at particular locations and for each \nconstituent may be inspected in tables in the Author Archive.  Second, a median standard error was \ncalculated for each set of constituents derived from subset B stations. These values were 0.012, \n0.017, 0.019 and 0.024 % per year and 0.012, 0.016, 0.013 and 0.015 degrees per year for M2, S2, \nK1 and O1 respectively with little evidence for a dependence of median error on record length \n(these values may be compared to standard errors of order 0.01 and 0.02 % per year obtained by \nRay (2009) for M2 and S2 respectively using records of 70 years, see his Table 1). Third, the scatter \nof points in Figures 1 and 2 was inspected, giving standard deviations between subset A and B \nvalues of approximately 0.022 % per year and 0.030 degrees per year respectively, with similar \nvalues obtained for each constituent once outliers had been removed. These particular values could \nbe said to represent overestimates of typical subset B errors as they will have been combined with \nuncertainties in the subset A trends. On the other hand, the median values could be claimed to be \nunderestimates, as they are based on an ordinary least squares procedure which tends to \nunderestimate formal standard errors. \n \n 13\nAltogether, these calculations suggest that values of RPA greater than approximately 0.015 % per \nyear in magnitude in Figures 4(a), 5(a) and 6(a) can be considered significantly different from zero, \nwith perhaps a slightly higher threshold for the diurnal tides. In addition, a threshold of \napproximately 0.02 degrees per year would imply that only the RPL values for stations in Figures \n4(b), 5(b) and 6(b) with saturated colour would be considered significant (additional figures with \ndifferent colour scales are available in the Author Archive). In both cases, confidence in non-zero \ntrends is increased where supporting evidence is available from nearby stations, a test which in \ngeneral tends to support significant conclusions on changes in RPA rather than RPL. \n \n4. Discussion and Conclusions \n \nThe real ocean tide can change for one or more reasons including: \n \n1. Long term changes in the tidal potential (Cartwright and Tayler, 1971; Cartwright and \nEdden, 1973). Such changes are small on century timescales and can be disregarded for \npresent purposes  \n2. Interactions between the tide and the continuum of non-tidal sea level variations (Munk and \nCartwright, 1966). Such interactions manifest themselves as changes in tidal constants from \nyear to year, and they could result in a long term trend in tidal parameters if a corresponding \ncomponent exists in the non-tidal forcing. \n3. Changes in water depth, due to sea level rise or geological processes such as Glacial \nIsostatic Adjustment, resulting in modifications in tidal wavelengths. However, large \n 14\nchanges in water depth are usually required to change tidal constituents significantly (e.g. \nFlather et al., 2001). \n4. Morphological changes in coastal waters, harbours or estuaries, either natural (e.g. Araújo et \nal., 2008) or anthropogenic (e.g. dredging) in origin, resulting in modifications of local \ntides. \n5. Changes in the internal tide with corresponding small changes in its surface expression (e.g. \nRay and Mitchum, 1997; Mitchum and Chiswell, 2000; Colosi and Munk, 2006). Such \nchanges can occur even though the barotropic tide is invariant. \n \nIn addition, the tide can appear to have changed for a number of technical reasons. Examples \ninclude: \n  \n6. Undocumented change of tide gauge location within a large estuary or harbour. \n7. Change in tide gauge technology. Many tide gauge authorities have changed technology in \nrecent years from conventional float and stilling well gauges to either pressure, acoustic or \nradar-based systems (IOC, 2006). \n8. Timing or calibration errors or other data irregularities. \n \nWithin any regional tidal survey, it should be possible to detect those changes which result from \nfactors 4, 6 and 8, as they will be anomalous in either a spatial distribution of tidal parameters \n(factor 4) or as outliers in time series of tidal constants (factors 6,8). Factor 5 will also not be \ncoherent over large regions but should not result in trends without large changes in ocean density \nprofiles. \n 15\n \nSystematic changes in tidal information due to factor 7 are potentially a very important \nconsideration, as most tide gauge authorities have changed their recording technology during the \nlast few decades and few agencies have undertaken as rigorous a comparison of data acquired \nduring periods of technology transition as one would like. Technology biases are more likely in \nRPA than in the other parameters, but could also occur in RPL, especially when float gauges are \nreplaced by other techniques, due to the removal of the lags inherent in stilling wells. RPA changes \nwill result from calibration errors in one or more of the technologies. These could include \nuncompensated temperature-dependent biases which tend to be diurnal and seasonal in nature, \nalthough effects in other harmonics cannot be excluded. Errors in RPA obtained from pressure-\nbased tide gauges can result from imprecise density correction; at many locations an average \ndensity will have been employed, while the real water density may have been both tidally and \nseasonally dependent. \n \nSystematic changes due to factor 7 might be identifiable by comparison of data from different \nauthorities in the same country, as each authority is unlikely to have changed technology at the \nsame time, and by comparison of information between neighbouring countries. It can be seen that \nregional consistency is again the most important criterion at our disposal for detecting errors in \nindividual records. \n \nAlthough it is important to always keep concerns about data quality in mind (factors 6-8), the tidal \nsurvey presented above has shown that is possible to make use of the currently available data set to \ninvestigate the extent to which ocean tide parameters are changing on a regional basis. It can be \n 16\nseen that, where more than one record is available from a region (even one as small as the southern \nNorth Sea), then one tends to obtain spatial consistency in findings. Therefore, it seems that records \nof length 30 years or more can be used to infer century-timescale change in regional tidal \namplitudes and phase lags. In addition, they can provide interesting information on the nodal \ndependence of the tide, consistent with that obtained from longer records. Our insight into such \nchanges will grow as the GESLA data set is extended to include records from other countries. Our \nmain findings so far indicate that there is little evidence in Europe or the Far East for the extensive \nchanges to the main tidal constituents observed previously in N America. Nevertheless, evidence \nfor regional and local changes can be clearly seen where the density of information allows, and \noutliers can usually be spotted. It seems, therefore, that tidal changes may be commonplace around \nthe world, although not necessarily the same in character between regions. \n \nAn important additional finding relates to the extent to which the temporal variation of each \nconstituent departs from equilibrium expectations in different parts of the world. In particular, \nsizeable ‘nodal’ signals are obtained for S2 at many locations, suggestive of interaction between \nconstituents (and much larger than a negligibly small nodal variation of 0.22% of the S2 amplitude \ndue to a luni-solar interaction component in the astronomical tidal potential, Cartwright and Tayler, \n1971). In our experience, such a possible nodal dependence of S2 is seldom included in tidal \nanalysis and prediction software packages (and probably should not be until its origin is better \nunderstood). \n \nThe study of the ocean tide has a long history (Cartwright, 1999). Its main components are now \nknown to centimetre accuracy (e.g. Shum et al., 1997). However, there are still many aspects of \n 17\ntides which remain to be studied and their temporal variability represents one important area. For \nexample, the fact that tidal constants vary seasonally has been known for many years but the \nreasons for such variations, which occur especially in shallow waters (e.g. Pugh and Vassie, 1992; \nKang et al., 2002) and at high latitudes (e.g. Prinsenberg, 1988; Kagan and Sofina, 2009), remain \npoorly understood. In addition, there are interannual changes due to interactions with \nmeteorologically-forced sea level variations (e.g. Munk et al., 1965; Bernier and Thompson, 2007) \nand conceivably with interannual and decadal changes in ocean circulation and stratification near \ntopography (e.g. Jay, 2009) which require further study. Consequently, the long term tidal changes \ndiscussed in the present paper can be seen to occupy the low-frequency end of research into tidal \nvariability. Long term changes in the tide at particular locations have been noted a number of times \nbefore (e.g. Cartwright 1971, 1972; Godin, 1995; Pouvreau, 2008). However, it has not been until \nrecently that more comprehensive regional studies have been undertaken, with quite intriguing \nfindings. One important example has been the identification of the variation in S2 in NE America. \nAs discussed by Ray (2009), these observed changes are undoubtedly real, but they are much larger \nthan can be explained in terms of changes in the astronomical tidal potential (factor (1) above), and \nan explanation in terms of a proportionately larger change in S2’s radiational component is not as \nyet conclusive. \n \nIn the course of constructing the present paper, I learned of a similar global tidal study by Müller et \nal. (2010). That work concentrates on 50 long (typically more than 60 years) records obtained from \nthe same UHSLC and GLOSS data banks as the present work, and performs a set of sensitivity \nstudies in order to understand why tides may have changed. There are many similarities in the \nfindings of the two studies, in spite of the Müller et al. focus on longer records and the present \n 18\nwork’s attempts to use more of the shorter ones. There are also some differences that are probably \nrelated to record length. While each study has its own emphasis, they together demonstrate the \nwidespread character of tidal change during the 20th and early 21st centuries.  \n \nThese tidal changes demand further investigation by continued analysis of historical data sets and \nby numerical modelling. Some of them, especially the larger-scale ones, may prove to be of major \ngeophysical significance and are, therefore, worthy of study in their own right. However, even the \nregional and local ones need to be understood as far as possible, if the insights obtained are to be \nincorporated into the tidal prediction schemes and tidal models needed for many practical purposes. \nTidal predictions are used routinely for flood warning and navigation and by many users of coastal \nwaters, and in some applications the highest accuracy of prediction is not required. However, there \nare many other applications where the most accurate tidal information is a necessity, such as in the \ncomputation of extreme levels for coastal engineering. Another application which has recently \nbecome apparent is in the optimal exploitation of satellite radar altimetry in shelf seas (Cippolini et \nal., 2009; Ray et al., 2010). Tidal prediction schemes and tidal models that can represent the long \nterm tidal variability discussed above are certain to find application in the coastal and \noceanographic communities. \n \nAcknowledgements \n \nI am grateful to John Hunter of the ACE CRC for initiating the GESLA activity and to Melisa \nMenéndez for providing a first assessment of data quality as part of her study of sea level extremes. \nIt has been a pleasure to have had many discussions on changes in ocean tides with Richard Ray of \n 19\nthe Goddard Space Flight Center, John Page of the UK Hydrographic Office, and David Blackman \nand David Pugh of NOC. David Cartwright, David Jay, Malte Müller, Brian Arbic and an \nanonymous reviewer are thanked for their comments on a first draft of this paper. This work was \nfunded by the UK Natural Environment Research Council. Some of the figures in this paper were \ngenerated using the Generic Mapping Tools (Wessel and Smith 1998).  \n \n \n \n \n \n \nAncillary Material \n \nThe PSMSL Author Archive (www.psmsl.org\/products\/author_archive) contains additional maps \nand ancillary material. A readme file describes the contents of each directory. \n 20\nReferences \n \nAmin, M. (1983), On perturbations of harmonic constants in the Thames Estuary, Geophysical \nJournal of the Royal Astronomical Society, 73, 587-603. \n \nAmin, M. (1985), Temporal variations of tides on the west coast of Great Britain, Geophysical \nJournal of the Royal Astronomical Society, 82, 279-299. \n \nBell, C., J.M. Vassie, and P.L. Woodworth (1996), The Tidal Analysis Software Kit (TASK \nPackage). TASK-2000 version dated December 1998. Available from www.psmsl.org.  \n \nBernier, N.B. and K.R. Thompson (2007), Tide - surge interaction off the east coast of Canada and \nnortheastern United States, Journal of Geophysical Research, 112, C06008, \ndoi:10.1029\/2006JC003793. \n \nBindoff, N., J. Willebrand, V. Artale, A. Cazenave, J. Gregory, S. Gulev, K.  Hanawa, C. Le Quéré, \nS. Levitus, Y. Nojiri, C. Shum, L. Talley, and A. Unnikrishnan (2007), Observations: oceanic \nclimate change and sea level, in Climate Change 2007: The Physical Science Basis. Contribution of \nWorking Group 1 to the Fourth Assessment Report of the Intergovernmental Panel on Climate \nChange, edited by S. Solomon, D. Qin, and M. Manning, Cambridge University Press, Cambridge, \nUnited Kingdom. \n \nAraújo, I.B., and D.T. Pugh (2008), Sea levels at Newlyn 1915-2005: analysis of trends for future \nflooding risks, Journal of Coastal Research, 24, 203-212. \n 21\n \nAraújo, I.B., J.M. Dias, and D.T. Pugh (2008), Model simulations of tidal changes in a coastal \nlagoon, the Ria Aveiro (Portugal), Continental Shelf Research, 28, 1010-1025. \n \nCartwright, D.E., and R.J. Tayler (1971), New computations of the tide-generating potential, \nGeophysical Journal of the Royal Astronomical Society, 23, 45-74. \n \nCartwright, D.E. (1971), Tides and waves in the vicinity of Saint Helena, Philosophical \nTransactions of the Royal Society of London, A, 270, 603-649. \n \nCartwright, D.E. (1972), Secular changes in the oceanic tides at Brest, 1711-1936, Geophysical \nJournal of the Royal Astronomical Society, 30, 433-449. \n \nCartwright, D.E., and A.C. Edden (1973), Corrected tables of tidal harmonics, Geophysical Journal \nof the Royal Astronomical Society, 33, 253-264. \n \nCartwright, D.E. (1977), Ocean tides, Reports on Progress in Physics, 40, 665-708. \n \nCartwright, D.E. (1999), Tides: a scientific history, Cambridge University Press: Cambridge. \n \nCipollini P,  J. Benveniste, J. Bouffard et al. (2009), The role of altimetry in coastal observing \nsystems.  Community White Paper contributed to the OceanObs’09 conference, 21-25 September \n2009, Venice, Italy. Available from http:\/\/www.oceanobs09.net. \n 22\n \nColosi, J.A., and W. Munk (2006), Tales of the venerable Honolulu tide gauge, Journal of Physical \nOceanography, 36, 967-996, doi: 10.1175\/jpo2876.1. \n \nDoodson, A.T, and H.D. Warburg (1941), Admiralty Manual of Tides, His Majesty’s Stationery \nOffice,  270pp. \n \nFlather, R.A, T.F. Baker, P.L. Woodworth, I.M. Vassie, and D.L. Blackman (2001), Integrated \neffects of climate change on coastal extreme sea levels. Proudman Oceanographic Laboratory \nInternal Document No.140. 20pp. Available from http:\/\/www.pol.ac.uk\/ntslf\/reports.html.  \n \nFlick, R.E., J.F. Murray, and L.C. Ewing (2003), Trends in United States tidal datum statistics and \ntide range, Journal of Waterway, Port, Coastal and Ocean Engineering, 129, 155-164, \ndoi:10.1061\/(ASCE)0733-950X(2003)129:4(155). \n \nForeman, M.G.G., and E.T. Neufeld (1991), Harmonic tidal analyses of long time series, \nInternational Hydrographic Review, 68, 85-108. \n \nGodin, G. (1995), Rapid evolution of the tide in the Bay of Fundy, Continental Shelf Research, 15, \n369-372. \n \nHollebrandse, F.A.P. (2005), Temporal development of the tidal range in the southern North Sea. \nMaster’s thesis, Faculty of Civil Engineering and Geosciences, Delft University of Technology. \n 23\n \nIOC (2006), Manual on sea-level measurement and interpretation. Volume 4 - An update to 2006. \nEdited by T. Aarup, M. Merrifield, B. Perez, I. Vassie and P. Woodworth,  Intergovernmental \nOceanographic Commission Manuals and Guides No. 14, IOC, Paris, 80pp. Available from \nhttp:\/\/www.psmsl.org\/train_and_info\/training\/manuals\/.  \n \nJay, D.A. (2009), Evolution of tidal amplitudes in the eastern Pacific Ocean, Geophysical Research \nLetters, 36, L04603, doi:10.1029\/2008GL036185. \n \nKagan, B.A., and E.V. Sofina (2009), Ice-induced seasonal variability of tidal constants in the \nArctic Ocean, Continental Shelf Research, 30, 643-647, doi:10.1016\/j.csr.2009.05.010. \n \nKang, S.K., M.G.G. Foreman, H.-J. Lie, J.-H. Lee, J. Cherniawsky, and K.-D. Yum (2002), Two-\nlayer tidal modeling of the Yellow and East China Seas with application to seasonal variability of \nthe M2 tide, Journal of Geophysical Research, 107, C3, doi:10.1029\/2001JC000838. \n \nLowe, J.A., P.L. Woodworth, T. Knutson, R.E. McDonald, K. McInnes, K. Woth, H. Von Storch, J. \nWolf, V. Swail, N. Bernier, S. Gulev, K. Horsburgh, A.S. Unnikrishnan, J. Hunter, and R. Weisse \n(2010), Past and future changes in extreme sea levels and waves. Chapter to be published in, \nUnderstanding sea-level rise and variability (eds. J.A. Church, P.L. Woodworth, T. Aarup and W.S. \nWilson) by Wiley-Blackwell (London). \n \n 24\nMenéndez, M., and P.L. Woodworth (2010), Changes in extreme high water levels based on a \nquasi-global tide-gauge dataset, Journal of Geophysical Research (in press). \n \nMitchum, G.T., and S.M. Chiswell (2000), Coherence of internal tide modulations along the \nHawaiian ridge, Journal of Geophysical Research, 105(C12), 28653-28661, \ndoi:10.1029\/2000JC900140. \n \nMüller, M., B.K. Arbic, and J.X. Mitrovica (2010), Secular trends in ocean tides: observations and \nmodel results, Journal of Geophysical Research (submitted). \n \nMunk, W.H., B. Zetler, and G.W. Groves (1965), Tidal cusps, Geophysical Journal of the Royal \nAstronomical Society, 10, 211-219. \n \nMunk W.H., and D.E. Cartwright (1966), Tidal spectroscopy and prediction, Philosophical \nTransactions of the Royal Society of London Series A, 259, 533-581. \n \nPouvreau, N. (2008), Trois cents ans de mesures marégraphiques en France: outils, méthodes et \ntendances des composantes du niveau de la mer au port de Brest, PhD thesis, University of La \nRochelle. \n \nPugh, D.T. (1987), Tides, Surges and Mean Sea-Level: a Handbook for Engineers and Scientists, \n472pp., Wiley, Chichester. \n \n 25\nPugh, D.T., and J.M. Vassie (1992), Seasonal modulations of the principal semi-diurnal lunar tide. \npp. 247-267 in, Mixing and transport in the environment. A memorial volume for Catherine \nM.Allen (1954-1991). K.Beven, P.Chatwin and J.Millbank (eds.) John Wiley & Sons: Chichester. \n458pp.  \n \nPrinsenberg, S.J. (1988), Damping and phase advance of the tide in western Hudson Bay by the \nannual ice cover, Journal of Physical Oceanography, 18, 1744-1751, doi:10.1175\/1520-0485. \n \nRay, R.D., and G. Mitchum (1997), Surface manifestation of internal tides in the deep ocean: \nobservations from altimetry and island gauges, Progress In Oceanography, 40 (1-4), 135-162. \n \nRay, R. D. (2006), Secular changes of the M2 tide in the Gulf of Maine, Continental Shelf \nResearch, 26, 422-427, doi:10.1016\/j.csr.2005.12.005.     \n \nRay, R. D. (2009), Secular changes in the solar semidiurnal tide of the western North Atlantic \nOcean, Geophysical Research Letters, 36, L19601, doi:10.1029\/2009GL040217. \n \nRay, R.D., G.D. Egbert, and S.Y. Erofeeva (2010), Tide predictions in shelf and coastal waters: \nstatus and prospects. In, Coastal Altimetry (Editors: S. Vignudelli, A. Kostianoy, P. Cipollini and J. \nBenveniste). Spinger Publishing \n \n 26\nShaw, A.G.P., and M.N. Tsimplis (2009), The 18.6 yr nodal modulation in the tides of southern \nEuropean coasts, Continental Shelf Research (available online 17 October 2009),\ndoi:10.1016\/j.csr.2009.10.006. \n \nShum, C.K., P.L. Woodworth, O.B. Andersen, G. Egbert, O. Francis, C. King, S. Klosko, C. Le \nProvost, X. Li, J-M. Molines, M. Parke, R. Ray, M. Schlax, D. Stammer, C. Tierney, P. Vincent,  \nand C. Wunsch (1997), Accuracy assessment of recent ocean tide models,  Journal of Geophysical \nResearch, 102(C11), 25173-25194. \n \nWessel, P., and W.H.F. Smith (1998), New, improved version of Generic Mapping Tools released, \nEOS, Transactions of the American Geophysical Union, 79, 579. \n \nWoodworth, P.L., S.M. Shaw, and D.B. Blackman (1991), Secular trends in mean tidal range \naround the British Isles and along the adjacent European coastline, Geophysical Journal \nInternational, 104, 593-610. \n 27\nTable 1 \n \nCorrelations between values for each tidal parameter using either subset A or subset B data \nselection criteria for those station records long enough to be selected in subset A. Numbers in \nbrackets indicate the number of subset-pairs in each case. \n \n \n RPA RPL PNOD \nM2 0.823 (52) 0.756 (51) 0.920 (52) \nS2 0.948 (48) 0.780 (46) 0.821 (48) \nK1 0.838 (54) 0.740 (53) 0.958 (54) \nO1 0.832 (53) 0.751 (51) 0.919 (53) \n \n \n \nTable 2 \n \nNumber of occasions on which the same or different value of NSIGN was obtained using the two \ndata selection criteria as in Table 1 and, for those stations with the same value of NSIGN, whether \nthat value was +1 or -1. \n \n \n Same NSIGN Different NSIGN NSIGN = +1 NSIGN = -1 \nM2 46 6 17 29 \nS2 42 6 6 36 \nK1 46 8 18 28 \nO1 48 5 24 24 \n \n \n \n \n \n \n \n \n \n \n \n 28\nFigure Captions \n \n1. Values of RPA obtained using subset A (abscissa) and subset B (ordinate) selection criteria for \nM2, S2, K1 and O1. The dotted line corresponds to equal values. \n \n2. Values of RPL obtained from subset A (abscissa) and subset B (ordinate) selection criteria. The \ndotted line corresponds to equal values. \n \n3. Values of PNOD obtained from subset A (abscissa) and subset B (ordinate) selection criteria. \nThe dotted line corresponds to equal values. \n \n4. (a-c) Values of RPA, RPL and PNOD respectively for M2, S2, K1 and O1 for stations in subset B \nin North America. Stations marked by a small black dot do not satisfy one or both of the \nrequirements described in the text. \n \n5. (a-c) As Figure 4 for stations in Europe. \n \n6. (a-c) As Figure 4 for stations in the Far East. \n 29\nM2\n-0.2 0.0 0.2 0.4 0.6\nRPA (% per Year)\n-0.2\n0.0\n0.2\n0.4\n0.6\nR\nP\nA\n(%\np\ne\nr\nY\ne\na\nr)\nS2\n-0.4 -0.2 0.0 0.2 0.4 0.6\nRPA (% per Year)\n-0.4\n-0.2\n0.0\n0.2\n0.4\n0.6\nR\nP\nA\n(%\np\ne\nr\nY\ne\na\nr)\nK1\n-0.2 0.0 0.2 0.4\nRPA (% per Year)\n-0.2\n0.0\n0.2\n0.4\nR\nP\nA\n(%\np\ne\nr\nY\ne\na\nr)\nO1\n0.0 0.2\nRPA (% per Year)\n0.0\n0.2\nR\nP\nA\n(%\np\ne\nr\nY\ne\na\nr)\n \n \n \nFigure 1 \n 30\nM2\n-0.3 -0.2 -0.1 0.0 0.1 0.2\nRPL (Deg. per Year)\n-0.3\n-0.2\n-0.1\n0.0\n0.1\n0.2\nR\nP\nL\n(D\ne\ng\n.\np\ne\nr\nY\ne\na\nr)\nS2\n-0.3 -0.2 -0.1 0.0 0.1 0.2\nRPL (Deg. per Year)\n-0.3\n-0.2\n-0.1\n0.0\n0.1\n0.2\nR\nP\nL\n(D\ne\ng\n.\np\ne\nr\nY\ne\na\nr)\nK1\n-0.3 -0.2 -0.1 0.0 0.1\nRPL (Deg. per Year)\n-0.3\n-0.2\n-0.1\n0.0\n0.1\nR\nP\nL\n(D\ne\ng\n.\np\ne\nr\nY\ne\na\nr)\nO1\n-0.2 -0.1 0.0 0.1 0.2\nRPL (Deg. per Year)\n-0.2\n-0.1\n0.0\n0.1\n0.2\nR\nP\nL\n(D\ne\ng\n.\np\ne\nr\nY\ne\na\nr)\n \n \n \n \nFigure 2 \n 31\nM2\n0 2\nPNOD (%)\n0\n2\nP\nN\nO\nD\n(%\n)\nS2\n0 1 2 3 4\nPNOD (%)\n0\n1\n2\n3\n4\nP\nN\nO\nD\n(%\n)\nK1\n0 1 2 3 4\nPNOD (%)\n0\n1\n2\n3\n4\nP\nN\nO\nD\n(%\n)\nO1\n0 2\nPNOD (%)\n0\n2\nP\nN\nO\nD\n(%\n)\n \n \n \n \nFigure 3 \n 32\nFigure 4 a,b,c follows \n 33\nM\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n-0\n.0\n4\n-0\n.0\n3\n-0\n.0\n2\n-0\n.0\n1\n0\n.0\n0\n0\n.0\n1\n0\n.0\n2\n0\n.0\n3\n0\n.0\n4\n%\np\ne\nr\ny\ne\na\nr\n \n 34\nM\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n-0\n.0\n2\n0\n-0\n.0\n1\n5\n-0\n.0\n1\n0\n-0\n.0\n0\n5\n0\n.0\n0\n0\n0\n.0\n0\n5\n0\n.0\n1\n0\n0\n.0\n1\n5\n0\n.0\n2\n0d\ne\ng\np\ne\nr\ny\ne\na\nr\n \n 35\nM\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n1\n8\n0\n˚\n1\n6\n5\n˚\n1\n5\n0\n˚\n1\n3\n5\n˚\n1\n2\n0\n˚\n1\n0\n5\n˚\n9\n0\n˚\n7\n5\n˚\n6\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n0\n.0\n0\n0\n.2\n5\n0\n.5\n0\n0\n.7\n5\n1\n.0\n0\n1\n.2\n5\n1\n.5\n0\n1\n.7\n5\n2\n.0\n0\n2\n.5\n0\n3\n.0\n0\n%\n \n 36\nFigure 5a,b,c follows \n 37\nM\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n-0\n.0\n4\n-0\n.0\n3\n-0\n.0\n2\n-0\n.0\n1\n0\n.0\n0\n0\n.0\n1\n0\n.0\n2\n0\n.0\n3\n0\n.0\n4\n%\np\ne\nr\ny\ne\na\nr\n \n 38\nM\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n-0\n.0\n2\n0\n-0\n.0\n1\n5\n-0\n.0\n1\n0\n-0\n.0\n0\n5\n0\n.0\n0\n0\n0\n.0\n0\n5\n0\n.0\n1\n0\n0\n.0\n1\n5\n0\n.0\n2\n0d\ne\ng\np\ne\nr\ny\ne\na\nr\n \n 39\nM\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nS\n2\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nK\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\nO\n1\n4\n5\n˚\n3\n0\n˚\n1\n5\n˚\n0\n˚\n1\n5\n˚\n3\n0\n˚\n4\n5\n˚\n3\n0\n˚\n4\n5\n˚\n6\n0\n˚\n7\n5\n˚\n0\n.0\n0\n0\n.2\n5\n0\n.5\n0\n0\n.7\n5\n1\n.0\n0\n1\n.2\n5\n1\n.5\n0\n1\n.7\n5\n2\n.0\n0\n2\n.5\n0\n3\n.0\n0\n%\n \n 40\nFigure 6a,b,c follows \n 41\nM\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nS\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nK\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\nO\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\n-0\n.0\n4\n-0\n.0\n3\n-0\n.0\n2\n-0\n.0\n1\n0\n.0\n0\n0\n.0\n1\n0\n.0\n2\n0\n.0\n3\n0\n.0\n4\n%\np\ne\nr\ny\ne\na\nr\n \n 42\nM\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nS\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nK\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\nO\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\n-0\n.0\n2\n0\n-0\n.0\n1\n5\n-0\n.0\n1\n0\n-0\n.0\n0\n5\n0\n.0\n0\n0\n0\n.0\n0\n5\n0\n.0\n1\n0\n0\n.0\n1\n5\n0\n.0\n2\n0d\ne\ng\np\ne\nr\ny\ne\na\nr\n \n 43\nM\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nS\n2\n4\n5\n˚\n0\n˚\n4\n5\n˚\nK\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\nO\n1\n4\n5\n˚\n9\n0\n˚\n1\n3\n5\n˚\n1\n8\n0\n˚\n1\n3\n5\n˚\n4\n5\n˚\n0\n˚\n4\n5\n˚\n0\n.0\n0\n0\n.2\n5\n0\n.5\n0\n0\n.7\n5\n1\n.0\n0\n1\n.2\n5\n1\n.5\n0\n1\n.7\n5\n2\n.0\n0\n2\n.5\n0\n3\n.0\n0\n%\n \n"}