{"doi":"10.1016\/j.physletb.2004.03.066","coreId":"100824","oai":"oai:epubs.surrey.ac.uk:222","identifiers":["oai:epubs.surrey.ac.uk:222","10.1016\/j.physletb.2004.03.066"],"title":"Nuclear structure of <sup>178<\/sup>Hf related to the spin-16, 31-year isomer","authors":["Sun, Y.","Zhou, X.-R.","Long, G. - L.","Zhao, En.-G.","Walker, P. M."],"enrichments":{"references":[{"id":778316,"title":"The Nuclear Many Body Problem (Springer-Verlag,","authors":[],"date":"1980","doi":"10.1063\/1.2915762","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-06-10","abstract":"<p>The projected shell model is used to study the multi-quasiparticle and collective excitations of <sup>178<\/sup>Hf. With an axially symmetric basis, the spin-16 isomer at 2.4 MeV appears to be well separated in energy\/spin space from other configurations. However, projected energy surface calculations suggest that <sup>178<\/sup>Hf has significant softness to axially asymmetric shapes, which can strongly modify the level distribution. The implications for photodeexcitation of the isomer are discussed.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:222<\/identifier><datestamp>\n      2017-10-31T13:57:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/222\/<\/dc:relation><dc:title>\n        Nuclear structure of <sup>178<\/sup>Hf related to the spin-16, 31-year isomer<\/dc:title><dc:creator>\n        Sun, Y.<\/dc:creator><dc:creator>\n        Zhou, X.-R.<\/dc:creator><dc:creator>\n        Long, G. - L.<\/dc:creator><dc:creator>\n        Zhao, En.-G.<\/dc:creator><dc:creator>\n        Walker, P. M.<\/dc:creator><dc:description>\n        <p>The projected shell model is used to study the multi-quasiparticle and collective excitations of <sup>178<\/sup>Hf. With an axially symmetric basis, the spin-16 isomer at 2.4 MeV appears to be well separated in energy\/spin space from other configurations. However, projected energy surface calculations suggest that <sup>178<\/sup>Hf has significant softness to axially asymmetric shapes, which can strongly modify the level distribution. The implications for photodeexcitation of the isomer are discussed.<\/p><\/dc:description><dc:date>\n        2004-06-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/222\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sun, Y., Zhou, X.-R., Long, G. - L., Zhao, En.-G. and Walker, P. M.  (2004) Nuclear structure of 178Hf related to the spin-16, 31-year isomer   Physics Letters B, 589 (3-4).  pp. 83-88.      <\/dc:identifier><dc:relation>\n        10.1016\/j.physletb.2004.03.066<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/222\/","10.1016\/j.physletb.2004.03.066"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1Nuclear structure of 178Hf related to the spin-16, 31-year isomer\nYang Sun,a b Xian-Rong Zhou c, Gui-Lu Long,c En-Guang Zhao,d Philip M. Walker1e\naDepartment of Physics, University of Notre Dame, Notre Dame, Indiana 46556, U.S.A.\nbDepartment of Physics, Xuzhou Normal University, Xuzhou, Jiangsu 221009, P.R.\nChina\ncDepartment of Physics, Tsinghua University, Beijing 100084, P.R. China\ndInstitute of Theoretical Physics, Chinese Academy of Sciences, PO Box 2735, Beijing\n100080, P.R. China\neDepartment of Physics, University of Surrey, Guildford GU2 7XH, United Kingdom\n1 Corersponding author: E-mail: p.walker@surrey.ac.uk;\nphone: +44-1483-686807; fax: +44-1483-686781.\nABSTRACT: The projected shell model is used to study the multi-quasiparticle and\ncollective excitations of 178Hf. With an axially symmetric basis, the spin-16 isomer at\n2.4 MeV appears to be well separated in energy\/spin space from other configurations.\nHowever, projected energy surface calculations suggest that 178Hf has significant softness\nto axially asymmetric shapes, which can strongly modify the level distribution. The\nimplications for photodeexitation of the isomer are discussed.\nPACS: 21.60.Cs, 23.20.Lv, 23.90.+w, 27.70.+q\nKeywords: nuclear structure, isomers, projected shell model.\nLong-lived isomers – excited nuclear states with inhibited electromagnetic decay – may\nbe considered to offer a form of energy storage [1,2]. The possibility to trigger the decay\nby the application of external electromagnetic radiation has attracted much interest and\npotentially could lead to the controlled release of nuclear energy. First reports of the trig-\ngering of the spin-16, 2.4 MeV isomer in 178Hf with low-energy (< 100 keV) photons [3,4,5]\nhave, however, been refuted [6,7]. Meanwhile, the threshold photon energy for trigger-\ning the isomer remains unknown. This situation contrasts with the recent determination\nof a threshold triggering energy of 1.01 MeV for the spin-9, 75 keV isomer in 180Ta [8],\nand subsequently the discrete intermediate states involved in the excitation\/deexcitation\npathway have been identified [9]. The significantly higher energy of the 178Hf isomer leads\nto the expectation of a lower triggering threshold, on account of the higher level den-\nsity, even allowing for the pairing difference between the even-even and odd-odd nucleon\nnumbers in 178Hf and 180Ta, respectively. The higher isomer energy in 178Hf also leads to\ngreater potential with regard to the utility of triggered energy release.\n2g.s.\nisomer\ngateway states\nFigure 1. Schematic diagram illustrating the process of triggered gamma-ray emis-\nsion from a nuclear isomer.\nThe two-step process of triggered gamma-ray emission is depicted schematically in Fig.\n1. A nucleus in an isomeric state is first excited to an intermediate state by absorption\nof an incident photon. An intermediate state may serve as a “gateway” that connects\nthe isomer to the ground state (g.s.). If the selection rules for transitions between the\ngateway and the g.s. are fulfilled, then enhanced gamma-decay, usually a multi-step\ngamma-cascade, is expected to occur. In determining the favourable conditions for trig-\ngering gamma-ray emission from the isomer, it is necessary to have information on the\nstructure of possible gateway states, as well as possible paths of electromagnetic tran-\nsitions to and from these states. Experimentally, only a few states close to the 178Hf\nisomer have been observed and documented in the literature [10,11]. The purpose of the\npresent letter is twofold: to demonstrate that the projected shell model (PSM) [12] is an\nappropriate theory for studying high-spin isomers and associated excitations, including\npotential gateway states; and to show that in the 178Hf case, in order to trigger emission\nfrom the 16+ isomer with low-energy photons, a series of external excitations via gateway\nstates may be necessary. In addition, the gateway states should be sufficiently mixed with\nlow-K components.\nThe long half-life (31 years) of the 2.4 MeV isomer in 178Hf is to a large extent dependent\non the approximate conservation of the K quantum number, where K is the projection\nof the angular momentum on the body-fixed symmetry axis. The isomer has Kpi = 16+.\nSpontaneous electromagnetic transitions from a high-K state to a lower-energy, low-K\nstate are strongly hindered by the K selection rule [13], |∆K| ≤ λ, with λ being the\ntransition multipolarity. The spontaneous decay of the 178Hf isomer involves inhibition\nfactors of close to 100 per degree of K forbiddenness, ν = ∆K − λ, with total inhibition\n≈ 100ν [14]. This strong inhibition supports the view that 178Hf has an axially symmetric\nintrinsic shape.\nIn a deformed, axially symmetric nucleus, a high-K state is made by summing the\ncontributions from several unpaired quasiparticles. An n-quasiparticle (n-qp) config-\nuration gives rise to a multiplet of 2n−1 states, with the total K expressed by K =\n|K1 ±K2 ± · · · ±Kn|, where Ki is for an individual neutron or proton. Among the 2\nn−1\nstates, the state with the highest K value, K =\n∑\ni |Ki|, is usually energetically favoured\n3and the most likely to form an yrast state (lowest energy state for a given angular momen-\ntum). Deformed nuclei with A ≈ 180 have several high-K single-particle (both neutron\nand proton) orbitals close to the Fermi surface, and several multi-qp high-K states in this\nmass region are found to be yrast [15,16].\nThe physics of multi-qp states is well incorporated in the PSM framework. The PSM\nfollows closely the shell-model philosophy, and in fact is a shell model constructed in a\ndeformed multi-qp basis. More precisely, the basis is first built in the qp basis with respect\nto the deformed-BCS vacuum; then rotational symmetry, violated in the deformed basis,\nis restored by angular-momentum projection [17] to form a rotational-invariant basis in\nthe laboratory frame; finally a two-body Hamiltonian is diagonalised in the projected\nbasis. In contrast to mean-field methods [18] employed in the study of multi-qp states,\nthe PSM can produce fully correlated shell-model states, and can generate well-defined\nwave functions, allowing us to compute, without further approximations, the quantities\nsuch as transition probabilities.\nStarting from the deformed Nilsson scheme [19] plus a subsequent BCS calculation, one\nbuilds the shell model space (for even-even systems) through multi-qp states:\n|φκ〉 =\n{\n|0〉 , α†niα\n†\nnj\n|0〉 , α†pkα\n†\npl\n|0〉 , α†niα\n†\nnj\nα†pkα\n†\npl\n|0〉 , · · ·\n}\n, (1)\nwhere α† is the creation operator for a qp and the index n (p) denotes neutron (proton)\nNilsson quantum numbers which run over the low-lying orbitals. The qp states are defined\nin a space with three major shells (N = 4, 5, 6 for neutrons and N = 3, 4, 5 for protons).\nThe corresponding qp vacuum is |0〉. The indices n and p in (1) are general; for example,\na 2-qp state can be of positive (or negative) parity if both quasiparticles i and j are from\nthe same (or two neighbouring) major shell(s). Positive and negative parity states span\nthe entire configuration space with the corresponding matrix in a block-diagonal form\nclassified by parity. Although in the present work we truncate the model space beyond 4-\nqp’s, the bases (1) can be easily enlarged by including higher-order multi-qp states. If the\nconfigurations denoted by “· · ·” are completely included, one recovers the full shell-model\nspace written in the representation of qp excitations.\nIn the case that the nuclear potential is axially symmetric, the basis states in (1) are\nlabelled by K. Thus, the projected multi-qp K-states are the building blocks in our shell-\nmodel wave function\n∣∣∣ΨIσM\n〉\n=\n∑\nκ\nf Iσκ Pˆ\nI\nMKκ\n|φκ〉 . (2)\nIn Eq. (2), κ labels the basis states and σ the states with the same angular momen-\ntum. Pˆ IMK is the angular momentum projector [17]. The coefficients f\nIσ\nκ in Eq. (2)\nare determined by diagonalisation of the Hamiltonian. Diagonalisation is the process\nof configuration mixing (here, K-mixing). Thus, the required physics, i.e. construct-\ning multi-qp states (with good angular momentum and parity) and mixing these states\nthrough residual interactions, is properly incorporated in the model. Electromagnetic\ntransition probabilities can be directly computed by using the resulting wave functions.\nThe Hamiltonian employed in the PSM [12] is\nHˆ = Hˆ0 −\n1\n2\nχ\n∑\nµ\nQˆ†µQˆµ −GM Pˆ\n†Pˆ −GQ\n∑\nµ\nPˆ †µPˆµ, (3)\n4where Hˆ0 is the spherical single-particle Hamiltonian, which contains a proper spin–orbit\nforce [19]. The other terms in Eq. (3) are quadrupole-quadrupole, and monopole- and\nquadrupole-pairing interactions, respectively. The strength of the quadrupole-quadrupole\nforce χ is determined in such a way that it has a self-consistent relation with the quadrupole\ndeformation ε2. The monopole-pairing force constants GM are\nGM =\n[\n20.12∓ 13.13N−Z\nA\n]\nA−1, (4)\nwith “−” for neutrons and “+” for protons, which reproduces the observed odd–even\nmass differences in the mass region. Finally, the strength parameter GQ for quadrupole\npairing was simply assumed to be proportional to GM , with a proportionality constant\n0.16, as commonly used in PSM calculations [12].\nHf178\nE\nx\nc\nit\na\nti\no\nn\n E\nn\ne\nrg\ny\n (\nM\ne\nV\n)\nFigure 2. Comparison of calculated energy levels in 178Hf with known data [10].\nFor 178Hf, the model basis is built with the deformation parameters ε2 = 0.251 and ε4 =\n0.056. These values are taken from the literature [20]. Fig. 2 shows the calculated energy\nlevels in 178Hf, compared with the known data [10]. Satisfactory agreement is achieved for\nmost of the states, except that for the bandhead of the first 8− band and the 14− band, the\ntheoretical values are too low. The dominant structure of each band can be read from the\nwave functions. We found that the 6+ band has a 2-qp structure {ν[512]5\n2\n−\n⊕ ν[514]7\n2\n−\n},\n5the 16+ band has a 4-qp structure {ν[514]7\n2\n−\n⊕ ν[624]9\n2\n+\n⊕ pi[404]7\n2\n+\n⊕ pi[514]9\n2\n−\n}, the\nfirst (lower) 8− band has a 2-qp structure {ν[514]7\n2\n−\n⊕ ν[624]9\n2\n+\n}, the second (higher) 8−\nband has a 2-qp structure {pi[404]7\n2\n+\n⊕ pi[514]9\n2\n−\n}, and the 14− band has a 4-qp structure\n{ν[512]5\n2\n−\n⊕ ν[514]7\n2\n−\n⊕ pi[404]7\n2\n+\n⊕ pi[514]9\n2\n−\n}. These states, together with many other\nstates (not shown in Fig. 2) obtained from the same diagonalisation process, form a\ncomplete spectrum including the high-K isomeric states and candidate gateway states.\nIn order to study the possible gateway states through which triggered isomeric emissions\nmight occur, in Fig. 3 we plot the high-K bands lying close in energy to the 16+ isomer.\nWe plot also the calculated lower 8− band via which the gamma-cascade could reach the\ng.s. The 16+ isomeric band is found to be yrast, above which there are many other 4-qp\nhigh-K bands with either positive or negative parity. It can be seen from Fig. 3 that the\n16+ isomeric band is well separated from the other bands, leaving an energy gap of nearly\n500 keV. However, the bandhead energies of the other high-K bands are not much higher\nthan the 16+ isomer, and an external energy of <100 keV may be able to excite the 16+\nisomer.\nA close look at Fig. 3 suggests, however, that in order to excite the 16+ isomer to the\nstates of the 8− band, a series of external excitations may be necessary, otherwise the\ndeexcitation would return to the original isomer. The excitation may proceed stepwise\namong the gateway states, until it arrives in a low-K state (a possible state is a member\nof the 8− band) from which spontaneous decay to the g.s. is possible. Of course, if\nsuch a multi-step excitation is required, then the probability would be very low. In\naddition, in order to link to the 8− band, the gateway states should contain sufficient\nK ≈ 8 components. The latter requirement is usually difficult to fulfill in an axially\nsymmetric nucleus; however, the discussion below may open a possibility, through non-\naxial distortions.\nThe picture shown in Fig. 3 has been obtained by assuming an axial basis, and it could\nbe modified if the nucleus exhibits significant deviation from the axial shape. The amount\nof triaxial deformation is given by an additional deformation parameter, γ. To see if the γ\ndegree of freedom plays a role in 178Hf, we have newly extended the capability of the PSM\nto study energy surfaces as a function of the two quadrupole deformation parameters, ε2\nand γ, based on exact projection calculations in three-dimensional Euler space [21,22].\nHere, we calculate the angular-momentum-projected energies having the form\nEI(ε2, γ) =\n〈φ(ε2, γ)| HˆPˆ\nI |φ(ε2, γ)〉\n〈φ(ε2, γ)| Pˆ I |φ(ε2, γ)〉\n. (5)\nFor comparison, the unprojected energy surfaces are also calculated. The unprojected\nenergy contains a mixture of states with good angular momenta.\nEnergy surfaces for states with angular momentum I = 0, 2, · · · , 10 are plotted in Fig.\n4. The left part of Fig. 4 shows the energies as a function of ε2 with γ = 0. A minimum\nat ε2 = 0.25 is seen, which is consistent with the use of ε2 = 0.251 in the calculations\nof Figs. 2 and 3. The unprojected energy surface has a similar form, but the minimum\nhas a slightly smaller ε2 value. In the right part of Fig. 4, energies are calculated as\na function of γ, with the minimum value of ε2 = 0.25. It is interesting to observe that\nthe unprojected surface has a minimum at γ = 0, suggesting that this nucleus is axially\n612 14 16 18 20 22\nSpin I\n-1\n0\n1\n2\n3\n4\n5\nEn\ner\ngy\n (M\neV\n)\n4-qp 16   isomer\n4-qp pos. parity\n4-qp neg. parity\n2-qp 8   band\nHf178\n+\n-\nFigure 3. Calculated high-K bands in 178Hf. The bands are plotted relative to the\nbandhead energy of the 16+ isomer.\nsymmetric. However, the projected surfaces exhibit a qualitatively different pattern: For\nall the spin states with I = 0, 2, · · · , 10, the energies with small γ are almost constant, and\nthey start to rise only for γ > 15◦. This suggests a softness to axially asymmetric shapes.\nNote that such qualitative differences between projected and unprojected calculations\nhave been discussed before in another context [23].\nNuclei having flat energy surfaces in the γ direction have recently been suggested [24]\nto be critical point nuclei sitting in the transitional region between the axially deformed\nand triaxially deformed phases. The energy surfaces in Fig. 4 indicate that 178Hf has a\ncharacter close to that of critical point nuclei with considerable γ softness. Therefore, the\nγ degree of freedom may play a significant role in this nucleus. Xu et al. [25] studied\nthe importance of γ deformation for high-K bandheads in 178W and 182Os, and for some\nhafnium isotopes [26]. While axial symmetry was predicted for the hafnium cases, the\ncalculations for multi-qp states were restricted to bandhead shapes and energies, and not\nthe associated rotational excitations. Our calculations now suggest that 178Hf exhibits a\nsignificant γ softness already near its ground state. The γ softness may strongly enhance\nexcitation of the gateway states. However, an extension of the PSM for the description\nof multi-qp states, with the γ degree of freedom explicitly included, does not yet exist.\nTo summarise, in the PSM the multi-qp states with good angular momentum serve as\nthe building blocks, and mixing of these states is incorporated through two-body residual\ninteractions. Our calculations for 178Hf show that the 16+ isomer lies well separated in\nenergy from other states, suggesting that a series of external excitations may be necessary\nto trigger isomeric emission. However, axially asymmetric energy-surface calculations\nshow that in 178Hf there is considerable γ softness. This fact, in the context of recent\ndiscussions of critical point nuclei [24], indicates that not only this particular example,\n70 20 40 60\nγ\nHf178\nε = 0.25γ = 0\n0 0.1 0.2 0.3 0.4\nε\n-10\n-8\n-6\n-4\n-2\n0\nEn\ner\ngy\n (M\neV\n)\nFigure 4. Energy surfaces for states with angular momentum I = 0, 2, · · · , 10. The\nenergies are calculated as function of (a) quadrupole deformation ε2 with γ = 0,\nand (b) γ deformation with ε2 = 0.25. Full (dashed) curves correspond to projected\n(unprojected) calculations.\nbut also other nuclei in this mass region, may be significantly influenced by the γ degree of\nfreedom. The γ-softness may strongly enhance excitation of the gateway states, in favour\nof triggering isomer decay. To describe multi-qp states properly, and to further guide\nexperiments in finding candidate nuclei for triggered gamma-ray emission, an advanced\ntheory following the projected shell model concept, with the γ degree of freedom included,\nis very much desired. Work along these lines is in progress.\nY.S. thanks Professor D.-H. Feng for communications. Research at University of Notre\nDame is supported by the NSF under contract number PHY-0140324.\nREFERENCES\n1. G.C. Baldwin and J.C. Solem, Rev. Mod. Phys. 69 (1997) 1085.\n2. P.M. Walker and G.D. Dracoulis, Nature 399 (1999) 35.\n3. C.B. Collins et al., Phys. Rev. Lett. 82 (1999) 695.\n4. C.B. Collins et al., Phys. Rev. C 61 (2000) 054305.\n5. C.B. Collins et al., Europhys. Lett. 57 (2002) 677.\n6. I. Ahmad et al., Phys. Rev. Lett. 87 (2001) 072503.\n7. I. Ahmad et al., Phys. Rev. C 67 (2003) 041305.\n8. D. Belic et al., Phys. Rev. Lett. 83 (1999) 5242.\n9. P.M. Walker, G.D. Dracoulis and J.J. Carroll, Phys. Rev. C 64 (2001) 061302(R).\n10. S.M. Mullins et al., Phys. Lett. B 393 (1997) 279;\nPhys. Lett. B 400 (1997) 401.\n811. A.B. Hayes et al., Phys. Rev. Lett. 89 (2002) 242501.\n12. K. Hara and Y. Sun, Int. J. Mod. Phys. E 4 (1995) 637.\n13. A. Bohr and B.R. Mottelson, Nuclear Structure, Vol. II (W.A. Benjamin, Inc., New\nYork, 1975).\n14. M.B. Smith et al., Phys. Rev. C 68 (2003) 031302(R).\n15. M.J.A. de Voigt, J. Dudek and Z. Szymanski, Rev. Mod. Phys. 55 (1983) 949.\n16. P.M. Walker and G.D. Dracoulis, Hyperfine Interactions 135 (2001) 83.\n17. P. Ring and P. Schuck, The Nuclear Many Body Problem (Springer-Verlag, New York,\n1980).\n18. S. Frauendorf, Rev. Mod. Phys. 73 (2001) 463.\n19. S.G. Nilsson et al., Nucl. Phys. A 131 (1969) 1.\n20. R. Bengtsson, S. Frauendorf and F.-R. May, Atom. Data and Nucl. Data Tables 35\n(1986) 15.\n21. J.A. Sheikh and K. Hara, Phys. Rev. Lett. 82 (1999) 3968.\n22. Y. Sun et al., Phys. Rev. C 61 (2000) 064323.\n23. A. Hayashi, K. Hara and P. Ring, Phys. Rev. Lett. 53 (1984) 337.\n24. F. Iachello, Phys. Rev. Lett. 91 (2003) 132502.\n25. F.R. Xu, P.M. Walker, J.A. Sheikh and R. Wyss, Phys. Lett. B 435 (1998) 257.\n26. F.R. Xu, P.M. Walker and R. Wyss, Phys. Rev. C 62 (2000) 014301.\n"}