{"doi":"10.5194\/angeo-26-167-2008","coreId":"195732","oai":"oai:lra.le.ac.uk:2381\/7843","identifiers":["oai:lra.le.ac.uk:2381\/7843","10.5194\/angeo-26-167-2008"],"title":"Observed tail current systems associated with bursty bulk flows and auroral streamers during a period of multiple substorms","authors":["Forsyth, Colin","Lester, M.","Cowley, S. W. H.","Dandouras, I.","Fazakerley, A. N.","Fear, R. C.","Frey, H. U.","Grocott, Adrian","Kadokura, A.","Lucek, E.","Rème, H.","Milan, Steve E.","Watermann, J. F."],"enrichments":{"references":[{"id":44716634,"title":"184 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers Earthward flow bursts, auroral streamers, and small expansions,","authors":[],"date":"2008","doi":"10.1029\/2000ja000306","raw":"Nakamura, R., Baumjohann, W., Scho¨del, R., Brittnacher, M., Sergeev, V. A., Kubyshkina, M., Mukai, T., and Liou, K.: www.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008 184 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers Earthward flow bursts, auroral streamers, and small expansions, J. Geophys. Res., 106, 10 791–10 802, doi:10.1029\/ 2000JA000306, 2001b. Nakamura, R., Baumjohann, W., Mouikis, C., Kistler, L. M., Runov, A., Volwerk, M., Asano, Y., Vo¨ro¨s, Z., Zhang, T. L., Klecker, B., Re`me, H., and Balogh, A.: Spatial scale of highspeed flows in the plasma sheet observed by Cluster, Geophys.","cites":null},{"id":44716529,"title":"A new magnetic coordinate system for conjugate studies at high latitudes,","authors":[],"date":"1989","doi":"10.1029\/ja094ia07p09139","raw":"Baker, K. B. and Wing, S.: A new magnetic coordinate system for conjugate studies at high latitudes, J. Geophys. Res., 94, 9139– 9143, 1989.","cites":null},{"id":44716648,"title":"A.: A magnetospheric magnetic field model with a warped tail current sheet,","authors":[],"date":"1989","doi":"10.1016\/0032-0633(89)90066-4","raw":"Tsyganenko, N. A.: A magnetospheric magnetic field model with a warped tail current sheet, Planet. Space Sci., 37, 5–20, doi: 10.1016\/0032-0633(89)90066-4, 1989. Tsyganenko, N. A. and Stern, D. P.: Modeling the global magnetic field of the large-scale Birkeland current systems, J. Geophys.","cites":null},{"id":44716602,"title":"Analysis of multipoint magnetometer data,","authors":[],"date":"1988","doi":"10.1016\/0273-1177(88)90141-x","raw":"Dunlop, M. W., Southwood, D. J., Glassmeier, K.-H., and Neubauer, F. M.: Analysis of multipoint magnetometer data, Adv. Space Res., 8, 273–277, doi:10.1016\/0273-1177(88) 90141-X, 1988.","cites":null},{"id":44716613,"title":"Are northsouth aligned auroral structures an ionospheric manifestation of bursty bulk flows?,","authors":[],"date":"1998","doi":"10.1029\/98gl02692","raw":"Henderson, M. G., Reeves, G. D., and Murphree, J. S.: Are northsouth aligned auroral structures an ionospheric manifestation of bursty bulk flows?, Geophys. Res. Lett., 25, 3737–3740, doi:10. 1029\/98GL02692, 1998.","cites":null},{"id":44716640,"title":"Auroral streamers: characteristics of associated precipitation,convection and field-aligned currents,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-537-2004","raw":"Sergeev, V., Liou, K., Newell, P., Ohtani, S., Hairston, M., and Rich, F.: Auroral streamers: characteristics of associated precipitation,convection and field-aligned currents, Ann. Geophys., 22, 537–548, 2004, http:\/\/www.ann-geophys.net\/22\/537\/2004\/.","cites":null},{"id":44716520,"title":"Bursty bulk flows in the inner central plasma sheet,","authors":[],"date":"1992","doi":"10.1029\/91ja02701","raw":"Angelopoulos, V., Baumjohann, W., Kennel, C. F., Coronti, F. V., Kivelson, M. G., Pellat, R., Walker, R. J., Luehr, H., and Paschmann, G.: Bursty bulk flows in the inner central plasma sheet, J. Geophys. Res., 97, 4027–4039, 1992.","cites":null},{"id":44716644,"title":"Cluster observations of travelling compression regions in the near-tail,","authors":[],"date":"2005","doi":"10.1029\/2003gl018438","raw":"Slavin, J. A., Tanskanen, E. I., Hesse, M., Owen, C. J., Dunlop, M. W., Imber, S., Lucek, E. A., Balogh, A., and Glassmeier, K.-H.: Cluster observations of travelling compression regions in the near-tail, J. Geophys. Res., 110, A06 207, doi: 10.1029\/2004JA010878, 2005.","cites":null},{"id":44716533,"title":"Details of current disruption and diversion in simulations of magnetotail dynamics,","authors":[],"date":"1996","doi":"10.1029\/96ja00887","raw":"Birn, J. and Hesse, M.: Details of current disruption and diversion in simulations of magnetotail dynamics, J. Geophys. Res., 101, 15 345–15 358, doi:10.1029\/96JA00887, 1996. Birn, J., Hesse, M., Haerendel, G., Baumjohann, W., and Shiokawa, K.: Flow braking and the substorm current wedge, J. Geophys.","cites":null},{"id":44716641,"title":"Detection of localized, plasma-depleted flux tubes or bubbles in the midtail plasma sheet,","authors":[],"date":"1996","doi":"10.1029\/96ja00460","raw":"Sergeev, V. A., Angelopoulos, V., Gosling, J. T., Cattell, C. A., and Russell, C. T.: Detection of localized, plasma-depleted flux tubes or bubbles in the midtail plasma sheet, J. Geophys. Res., 101, 10 817–10 826, doi:10.1029\/96JA00460, 1996.","cites":null},{"id":44716511,"title":"Direct determination of the local ionospheric Hall conductance distribution from two-dimensional electric and magnetic field data: Application of the method using models of typical ionospheric electrodynamic situations,","authors":[],"date":"1995","doi":"10.1029\/95ja02213","raw":"Amm, O.: Direct determination of the local ionospheric Hall conductance distribution from two-dimensional electric and magnetic field data: Application of the method using models of typical ionospheric electrodynamic situations, J. Geophys. Res., 100, 21 473–21 488, doi:10.1029\/95JA02213, 1995.","cites":null},{"id":44716622,"title":"Energy-dispersed ions in the plasma sheet boundary layer and associated phenomena: Ion heating, electron acceleration, Alfve´n waves, broadband waves, perpendicular electric field spikes, and auroral emissions,","authors":[],"date":"2000","doi":"10.5194\/angeo-24-2685-2006","raw":"Res., 105, 10 677–10 690, doi:10.1029\/1999JA900487, 2000. Keiling, A., Parks, G. K., Re`me, H., Dandouras, I., Wilber, M., Kistler, L., Owen, C., Fazakerley, A. N., Lucek, E., Maksimovic, M., and Cornilleau-Wehrlin, N.: Energy-dispersed ions in the plasma sheet boundary layer and associated phenomena: Ion heating, electron acceleration, Alfve´n waves, broadband waves, perpendicular electric field spikes, and auroral emissions, Ann.","cites":null},{"id":44716632,"title":"Far ultraviolet imaging from the IMAGE spacecraft. 2. Wideband FUV imaging, Space Sci.","authors":[],"date":null,"doi":"10.1007\/978-94-011-4233-5_9","raw":"Mende, S. B., Heetderks, H., Frey, H. U., Lampton, M., Geller, S. P., Abiad, R., Siegmund, O. H. W., Tremsin, A. S., Spann, J., Dougani, H., Fuselier, S. A., Magoncelli, A. L., Bumala, M. B., Murphree, S., and Trondsen, T.: Far ultraviolet imaging from the IMAGE spacecraft. 2. Wideband FUV imaging, Space Sci. Rev., 91, 271–285, 2000a. Mende, S. B., Heetderks, H., Frey, H. U., Stock, J. M., Lampton, M., Geller, S. P., Abiad, R., Siegmund, O. H. W., Habraken, S., Renotte, E., Jamar, C., Rochus, P., Gerard, J.-C., Sigler, R., and Lauche, H.: Far ultraviolet imaging from the IMAGE spacecraft. 3. Spectral imaging of Lyman-α and OI 135.6 nm, Space Sci.","cites":null},{"id":44716638,"title":"First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster Ion Spectrometry (CIS) experiment,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1303-2001","raw":"Re`me, H., Aoustin, C., Bosqued, J. M., Dandouras, I., Lavraud, B., Sauvaud, J. A., Barthe, A., Bouyssou, J., Camus, T., Coeur-Joly, O., Cros, A., Cuvilo, J., Ducay, F., Garbarowitz, Y., Medale, J. L., Penou, E., Perrier, H., Romefort, D., Rouzaud, J., Vallat, C., Alcayde´, D., Jacquey, C., Mazelle, C., D’Uston, C., Mo¨bius, E., Kistler, L. M., Crocker, K., Granoff, M., Mouikis, C., Popecki, M., Vosbury, M., Klecker, B., Hovestadt, D., Kucharek, H., Kuenneth, E., Paschmann, G., Scholer, M., Sckopke, N., Seidenschwang, E., Carlson, C. W., Curtis, D. W., Ingraham, C., Lin, R. P., McFadden, J. P., Parks, G. K., Phan, T., Formisano, V., Amata, E., Bavassano-Cattaneo, M. B., Baldetti, P., Bruno, R., Chionchio, G., di Lellis, A., Marcucci, M. F., Pallocchia, G., Korth, A., Daly, P. W., Graeve, B., Rosenbauer, H., Vasyliunas, V., McCarthy, M., Wilber, M., Eliasson, L., Lundin, R., Olsen, S., Shelley, E. G., Fuselier, S., Ghielmetti, A. G., Lennartsson, W., Escoubet, C. P., Balsiger, H., Friedel, R., Cao, J.-B., Kovrazhkin, R. A., Papamastorakis, I., Pellat, R., Scudder, J., and Sonnerup, B.: First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster Ion Spectrometry (CIS) experiment, Ann. Geophys., 19, 1303–1354, 2001, http:\/\/www.ann-geophys.net\/19\/1303\/2001\/. Robert, P., Dunlop, M. W., Roux, A., and Chanteur, G.: Accuracy of Current Density Determination, in: Analysis Methods for MultiSpacecraft Data, edited by: Paschmann, G. and Daly, P. W., pp.","cites":null},{"id":44716609,"title":"First results of electric field and density observations by Cluster EFW based on initial months of operation,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1219-2001","raw":"Gustafsson, G., Andre´, M., Carozzi, T., Eriksson, I. A., Fa¨lthammar, C.-G., Grard, R., Holmgren, G., Holtet, J. A., Ivchenko, N., Karlsson, T., Khotyaintsev, Y., Klimov, S., Laakso, H., Lindqvist, P.-A., Lybekk, B., Marklund, G., Mozer, F., Mursula, K., Pedersen, A., Popielawska, B., Savin, S., Stasiewicz, K., Tanskanen, P., Vaivads, A., and Wahlund, J.-E.: First results of electric field and density observations by Cluster EFW based on initial months of operation, Ann. Geophys., 19, 1219–1240, 2001, http:\/\/www.ann-geophys.net\/19\/1219\/2001\/.","cites":null},{"id":44716633,"title":"Flow bursts and auroral activations: Onset timing and foot point location,","authors":[],"date":null,"doi":"10.1029\/2000ja000249","raw":"Rev., 91, 287–318, 2000b. Nakamura, R., Baumjohann, W., Brittnacher, M., Sergeev, V. A., Kubyshkina, M., Mukai, T., and Liou, K.: Flow bursts and auroral activations: Onset timing and foot point location, J. Geophys.","cites":null},{"id":44716625,"title":"Hybrid Input Algorithm: An event-oriented magnetospheric model,","authors":[],"date":"1999","doi":"10.1029\/1999ja900222","raw":"Kubyshkina, M. V., Sergeev, V. A., and Pulkkinen, T. I.: Hybrid Input Algorithm: An event-oriented magnetospheric model, J. Geophys. Res., 104, 24 977–24 994, doi:10.1029\/ 1999JA900222, 1999.","cites":null},{"id":44716600,"title":"Interplanetary magnetic field and the auroral zones,","authors":[],"date":"1961","doi":"10.1103\/physrevlett.6.47","raw":"Dungey, J. W.: Interplanetary magnetic field and the auroral zones, Phys. Rev. Lett., 6, 47–48, doi:10.1103\/PhysRevLett.6.47, 1961.","cites":null},{"id":44716636,"title":"Interplanetary magnetic field control of the location of substorm onset and auroral features in the conjugate hemispheres,","authors":[],"date":"2004","doi":"10.1029\/2003ja010370","raw":"Østgaard, N., Mende, S. B., Frey, H. U., Immel, T. J., Frank, L. A., Sigwarth, J. B., and Stubbs, T. J.: Interplanetary magnetic field control of the location of substorm onset and auroral features in the conjugate hemispheres, J. Geophys. Res., 109, 7204–7215, doi:10.1029\/2003JA010370, 2004.","cites":null},{"id":44716516,"title":"Ionospheric disturbance magnetic field continuation from the ground to the ionosphere using spherical elementary current systems,","authors":[],"date":"1999","doi":"10.1186\/bf03352247","raw":"Amm, O. and Viljanen, A.: Ionospheric disturbance magnetic field continuation from the ground to the ionosphere using spherical elementary current systems, Earth, Planets, and Space, 51, 431– 440, 1999.","cites":null},{"id":44716514,"title":"Ionospheric signatures of bursty bulk flows,","authors":[],"date":"2002","doi":"10.1029\/2008ja013908","raw":"Amm, O. and Kauristie, K.: Ionospheric signatures of bursty bulk flows, Surv. Geophy., 23, 1–32, 2002.","cites":null},{"id":44716537,"title":"Joint observations by Cluster satellites of bursty bulk flows in the magnetotail,","authors":[],"date":"2006","doi":"10.1029\/2005ja011322","raw":"Cao, J. B., Ma, Y. D., Parks, G., Reme, H., Dandouras, I., Nakamura, R., Zhang, T. L., Zong, Q., Lucek, E., Carr, C. M., Liu, Z. X., and Zhou, G. C.: Joint observations by Cluster satellites of bursty bulk flows in the magnetotail, J. Geophys. Res., 111, A04 206, doi:10.1029\/2005JA011322, 2006.","cites":null},{"id":44716635,"title":"Localized fast flow disturbance observed in the plasma sheet and in the ionosphere,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-553-2005","raw":"Nakamura, R., Amm, O., Laakso, H., Draper, N. C., Lester, M., Grocott, A., Klecker, B., McCrea, I. W., Balogh, A., Re`me, H., and Andre´, M.: Localized fast flow disturbance observed in the plasma sheet and in the ionosphere, Ann. Geophys., 23, 553– 566, 2005, http:\/\/www.ann-geophys.net\/23\/553\/2005\/.","cites":null},{"id":44716598,"title":"Magneto-Hydrodynamic Shocks,","authors":[],"date":"1950","doi":"10.1103\/physrev.80.692","raw":"de Hoffmann, F. and Teller, E.: Magneto-Hydrodynamic Shocks, Physical Review, 80, 692–703, doi:10.1103\/PhysRev.80.692, 1950.","cites":null},{"id":44716645,"title":"Magnetopause structure and attitude from Explorer 12 observations,","authors":[],"date":"1967","doi":"10.1029\/jz072i001p00171","raw":"Sonnerup, B. U. O. and Cahill Jr., L. J.: Magnetopause structure and attitude from Explorer 12 observations, J. Geophys. Res., 72, 171–183, 1967.","cites":null},{"id":44716525,"title":"Magnetotail flow bursts: association to global magnetospheric circulation, relationship to ionospheric activity and direct evidence for localization,","authors":[],"date":"1997","doi":"10.1029\/97gl02355","raw":"Angelopoulos, V., Phan, T. D., Larson, D. E., Mozer, F. S., Lin, R. P., Tsuruda, K., Hayakawa, H., Mukai, T., Kokubun, S., Yamamoto, T., Williams, D. J., McEntire, R. W., Lepping, R. P., Parks, G. K., Brittnacher, M., Germany, G., Spann, J., Singer, H. J., and Yumoto, K.: Magnetotail flow bursts: association to global magnetospheric circulation, relationship to ionospheric activity and direct evidence for localization, Geophys. Res. Lett., 24, 2271–2274, doi:10.1029\/97GL02355, 1997.","cites":null},{"id":44716512,"title":"Method of characteristics in spherical geometry applied to a Harang-discontinuity situation,","authors":[],"date":"1998","doi":"10.1007\/s005850050612","raw":"Amm, O.: Method of characteristics in spherical geometry applied to a Harang-discontinuity situation, Ann. Geophys., 16, 413– 424, 1998, http:\/\/www.ann-geophys.net\/16\/413\/1998\/.","cites":null},{"id":44716646,"title":"Minimum and Maximum Variance Analysis, in: Analysis Methods for Multi-Spacecraft Data, edited by:","authors":[],"date":"1998","doi":null,"raw":"Sonnerup, B. U. O. and Scheible, M.: Minimum and Maximum Variance Analysis, in: Analysis Methods for Multi-Spacecraft Data, edited by: Paschmann, G. and Daly, P. W., pp. 185–220, ISSI, 1998.","cites":null},{"id":44716604,"title":"Multi-instrument observations of the ionospheric counterpart of a bursty bulk flow in the near-Earth plasma sheet,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1061-2004","raw":"Grocott, A., Yeoman, T., Nakamura, R., Cowley, S., Frey, H., Re`me, H., and Klecker, B.: Multi-instrument observations of the ionospheric counterpart of a bursty bulk flow in the near-Earth plasma sheet, Ann. Geophys., 22, 1061–1075, 2004, http:\/\/www.ann-geophys.net\/22\/1061\/2004\/.","cites":null},{"id":44716606,"title":"Multi-scale observations of magnetotail flux transport during IMF-northward non-substorm intervals,","authors":[],"date":"2007","doi":"10.5194\/angeo-25-1709-2007","raw":"Grocott, A., Yeoman, T. K., Milan, S. E., Amm, O., Frey, H. U., Juusola, L., Nakamura, R., Owen, C. J., Re`me, H., and Takada, T.: Multi-scale observations of magnetotail flux transport during IMF-northward non-substorm intervals, Ann. Geophys., 25, 1709–1720, 2007, http:\/\/www.ann-geophys.net\/25\/1709\/2007\/.","cites":null},{"id":44716639,"title":"Multiple spacecraft observations of interplanetary shocks Four spacecraft determination of shock normals,","authors":[],"date":"1983","doi":"10.1029\/ja088ia06p04739","raw":"Russell, C. T., Mellott, M. M., Smith, E. J., and King, J. H.: Multiple spacecraft observations of interplanetary shocks Four spacecraft determination of shock normals, J. Geophys. Res., 88, 4739–4748, 1983.","cites":null},{"id":44716642,"title":"Multiple-spacecraft observation of a narrow transient plasma jet in the Earth’s plasma sheet,","authors":[],"date":"2000","doi":"10.1029\/1999gl010729","raw":"Sergeev, V. A., Sauvaud, J.-A., Popescu, D., Kovrazhkin, R. A., Liou, K., Newell, P. T., Brittnacher, M., Parks, G., Nakamura, R., Mukai, T., and Reeves, G. D.: Multiple-spacecraft observation of a narrow transient plasma jet in the Earth’s plasma sheet, Geophys. Res. Lett., 27, 851–854, 2000.","cites":null},{"id":44716527,"title":"Neutral line model of substorms: Past results and present view,","authors":[],"date":"1996","doi":"10.1029\/95ja03753","raw":"Baker, D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W., and McPherron, R. L.: Neutral line model of substorms: Past results and present view, J. Geophys. Res., 101, 12 975–13 010, doi:10.1029\/95JA03753, 1996.","cites":null},{"id":44716623,"title":"Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data,","authors":[],"date":"2006","doi":"10.1007\/s00585-999-1306-8","raw":"Geophys., 24, 2685–2707, 2006, http:\/\/www.ann-geophys.net\/24\/2685\/2006\/. Khan, H. and Cowley, S. W. H.: Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data, Ann.","cites":null},{"id":44716643,"title":"On the formation of a plasma bubble,","authors":[],"date":"2005","doi":"10.1029\/2007gl029693","raw":"Sitnov, M. I., Guzdar, P. N., and Swisdak, M.: On the formation of a plasma bubble, Geophys. Res. Lett., 32, 16 103, doi:10.1029\/ 2005GL023585, 2005.","cites":null},{"id":44716535,"title":"On the propagation of bubbles in the geomagnetic tail,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1773-2004","raw":"Birn, J., Raeder, J., Wang, Y., Wolf, R., and Hesse, M.: On the propagation of bubbles in the geomagnetic tail, Ann. Geophys., 22, 1773–1786, 2004, http:\/\/www.ann-geophys.net\/22\/1773\/2004\/.","cites":null},{"id":44716624,"title":"Parallel electric fields,","authors":[],"date":"1973","doi":"10.1016\/0032-0633(73)90093-7","raw":"Knight, S.: Parallel electric fields, Planet. Space Sci., 21, 741–750, doi:10.1016\/0032-0633(73)90093-7, 1973.","cites":null},{"id":44716621,"title":"PEACE: a Plasma Electron And Current Experiment,","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5666-0_13","raw":"Johnstone, A. D., Alsop, C., Burge, S., Carter, P. J., Coates, A. J., Coker, A. J., Fazakerley, A. N., Grande, M., Gowen, R. A., Gurgiolo, C., Hancock, B. K., Narheim, B., Preece, A., Sheather, P. H., Winningham, J. D., and Woodliffe, R. D.: PEACE: a Plasma Electron And Current Experiment, Space Sci Rev., 79, 351–398, 1997. Kauristie, K., Sergeev, V. A., Kubyshkina, M., Pulkkinen, T. I., Angelopoulos, V., Phan, T., Lin, R. P., and Slavin, J. A.: Ionospheric current signatures of transient plasma sheet flows, J. Geophys.","cites":null},{"id":44716615,"title":"Plasma sheet behavior during substorms, Washington D.C. American Geophysical Union Geophysical Monograph Series,","authors":[],"date":"1984","doi":"10.1029\/gm030p0178","raw":"Hones Jr., E. W.: Plasma sheet behavior during substorms, Washington D.C. American Geophysical Union Geophysical Monograph Series, pp. 178–184, 1984. Inhester, B., Untiedt, J., Segatz, M., and Kuerschner, M.: Direct determination of the local ionospheric hall conductance distribution from two-dimensional electric and magnetic field data, J.","cites":null},{"id":44716631,"title":"Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_20","raw":"McComas, D. J., Bame, S. J., Barker, P., Feldman, W. C., Phillips, J. L., Riley, P., and Griffee, J. W.: Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci. Rev., 86, 563–612, doi:10.1023\/A: 1005040232597, 1998.","cites":null},{"id":44716630,"title":"Some characteristics of the parallel electric field acceleration of electrons over discrete auroral arcs as observed from two rocket flights,","authors":[],"date":"1978","doi":null,"raw":"Lundin, R. and Sandahl, I.: Some characteristics of the parallel electric field acceleration of electrons over discrete auroral arcs as observed from two rocket flights, Tech. rep., ESA, 1978. Lyons, L. R., Nagai, T., Blanchard, G. T., Samson, J. C., Yamamoto, T., Mukai, T., Nishida, A., and Kokobun, S.: Association between Geotail plasma flows and auroral poleward boundary intensifications observed by CANOPUS photometers, J. Geophys.","cites":null},{"id":44716518,"title":"Spatial distribution of conductances and currents associated with a north-south auroral form during a multiple-substorm period,","authors":[],"date":"1999","doi":"10.1007\/s005850050864","raw":"Amm, O., Pajunpa¨a¨, A., and Brandstro¨m, U.: Spatial distribution of conductances and currents associated with a north-south auroral form during a multiple-substorm period, Ann. Geophys., 17, 1385–1396, 1999, http:\/\/www.ann-geophys.net\/17\/1385\/1999\/.","cites":null},{"id":44716611,"title":"Spatial gradients and the volumetric tensor, in: Analysis Methods for Multi-Spacecraft Data, edited by:","authors":[],"date":"1998","doi":null,"raw":"Harvey, C. C.: Spatial gradients and the volumetric tensor, in: Analysis Methods for Multi-Spacecraft Data, edited by: Paschmann, G. and Daly, P. W., pp. 307–348, ISSI, 1998.","cites":null},{"id":44716523,"title":"Statistical characteristics of bursty bulk flow events,","authors":[],"date":"1994","doi":"10.1029\/94ja01263","raw":"Angelopoulos, V., Kennel, C. F., Coroniti, F. V., Pellat, R., Kivelson, M. G., Walker, R. J., Russell, C. T., Baumjohann, W., Feldman, W. C., and Gosling, J. T.: Statistical characteristics of bursty bulk flow events, J. Geophys. Res., 99, 21 257–21 280, 1994.","cites":null},{"id":44716629,"title":"Stereo CUTLASS – A new capability for the SuperDARN HF radars,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-459-2004","raw":"Lester, M., Chapman, P., Cowley, S., Crooks, S., Davies, J., Hamadyk, P., McWilliams, K., Milan, S., Parsons, M., Payne, D., Thomas, E., Thornhill, J., Wade, N., Yeoman, T., and Barnes, R.: Stereo CUTLASS – A new capability for the SuperDARN HF radars, Ann. Geophys., 22, 459–473, 2004, http:\/\/www.ann-geophys.net\/22\/459\/2004\/.","cites":null},{"id":44716647,"title":"The Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_1","raw":"Stone, E. C., Frandsen, A. M., Mewaldt, R. A., Christian, E. R., Margolies, D., Ormes, J. F., and Snow, F.: The Advanced Composition Explorer, Space Sci. Rev., 86, 1–22, doi:10.1023\/A: 1005082526237, 1998.","cites":null},{"id":44716531,"title":"The Cluster Magnetic Field Investigation: Overview of in-flight performance and initial results,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1207-2001","raw":"Balogh, A., Carr, C. M., Acun˜a, M. H., Dunlop, M. W., Beek, T. J., Brown, P., Fornac¸on, K.-H., Georgescu, E., Glassmeier, K.-H., Harris, J., Musmann, G., Oddy, T., and Schwingenschuh, K.: The Cluster Magnetic Field Investigation: Overview of in-flight performance and initial results, Ann. Geophys., 19, 1207–1217, 2001, http:\/\/www.ann-geophys.net\/19\/1207\/2001\/.","cites":null},{"id":44716596,"title":"The Distant Geomagnetic Tail in Theory and Observation, in: Magnetic Reconnection in Space and Laboratory Plasmas, edited by:","authors":[],"date":"1984","doi":"10.1029\/gm030p0228","raw":"Cowley, S. W. H.: The Distant Geomagnetic Tail in Theory and Observation, in: Magnetic Reconnection in Space and Laboratory Plasmas, edited by: Hones Jr., E. W., pp. 228–239, 1984. Cowley, S. W. H. and Bunce, E. J.: Origin of the main auroral oval in Jupiter’s coupled magnetosphere-ionosphere system, Planet.","cites":null},{"id":44716637,"title":"Wind survey of high-speed bulk flows and field-aligned beams in the nearEarth plasma sheet,","authors":[],"date":"2001","doi":"10.1029\/2001ja007547","raw":"Raj, A., Phan, T., Lin, R. P., and Angelopoulos, V.: Wind survey of high-speed bulk flows and field-aligned beams in the nearEarth plasma sheet, J. Geophys. Res., 107, 3–1, doi:10.1029\/ 2001JA007547, 2002.","cites":null},{"id":44716540,"title":"www.ann-geophys.net\/26\/167\/2008\/ C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 183","authors":[],"date":"2008","doi":"10.5194\/angeo-26-167-2008","raw":"Ann. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/ C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 183 Chen, C. X. and Wolf, R. A.: Interpretation of high-speed flows in the plasma sheet, J. Geophys. Res., 98, 21 409–21 419, 1993.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-02-04","abstract":"This paper was published as Annales Geophysicae, 2008, 26 (1), pp. 167-184.  It is also available from http:\/\/www.ann-geophys.net\/26\/167\/2008\/angeo-26-167-2008.htmlWe present a multi-instrument study of a substorm bursty bulk flow (BBF) and auroral streamer. During a substorm on 25 August 2003, which was one of a series of substorms that occurred between 00:00 and 05:00 UT, the Cluster spacecraft encountered a BBF event travelling Earthwards and duskwards with a velocity of ~500 km s−1 some nine minutes after the onset of the substorm. Coincident with this event the IMAGE spacecraft detected an auroral streamer in the substorm auroral bulge in the Southern Hemisphere near the footpoints of the Cluster spacecraft. Using FluxGate Magnetometer (FGM) data from the four Cluster spacecraft, we determine the field-aligned currents in the BBF, using the curlometer technique, to have been ~5 mA km−2. When projected into the ionosphere, these currents give ionospheric field-aligned currents of ~18 A km−2, which is comparable with previously observed ionospheric field-aligned currents associated with BBFs and auroral streamers. The observations of the BBF are consistent with the plasma \"bubble\" model of Chen and Wolf (1993). Furthermore, we show that the observations of the BBF are consistent with the creation of the BBF by the reconnection of open field lines Earthward of a substorm associated near-Earth neutral line","downloadUrl":"http:\/\/hdl.handle.net\/2381\/7843","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7843\/3\/Observed%20tail%20current%20systems%20associated%20....pdf","pdfHashValue":"2100417762217677a38e1dd8b468097b7eaa2b2f","publisher":"Copernicus Publications on behalf of the European Geosciences Union","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7843<\/identifier><datestamp>\n                2015-11-04T12:50:47Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nObserved tail current systems associated with bursty bulk flows and auroral streamers during a period of multiple substorms<\/dc:title><dc:creator>\nForsyth, Colin<\/dc:creator><dc:creator>\nLester, M.<\/dc:creator><dc:creator>\nCowley, S. W. H.<\/dc:creator><dc:creator>\nDandouras, I.<\/dc:creator><dc:creator>\nFazakerley, A. N.<\/dc:creator><dc:creator>\nFear, R. C.<\/dc:creator><dc:creator>\nFrey, H. U.<\/dc:creator><dc:creator>\nGrocott, Adrian<\/dc:creator><dc:creator>\nKadokura, A.<\/dc:creator><dc:creator>\nLucek, E.<\/dc:creator><dc:creator>\nRème, H.<\/dc:creator><dc:creator>\nMilan, Steve E.<\/dc:creator><dc:creator>\nWatermann, J. F.<\/dc:creator><dc:description>\nThis paper was published as Annales Geophysicae, 2008, 26 (1), pp. 167-184.  It is also available from http:\/\/www.ann-geophys.net\/26\/167\/2008\/angeo-26-167-2008.html<\/dc:description><dc:description>\nWe present a multi-instrument study of a substorm bursty bulk flow (BBF) and auroral streamer. During a substorm on 25 August 2003, which was one of a series of substorms that occurred between 00:00 and 05:00 UT, the Cluster spacecraft encountered a BBF event travelling Earthwards and duskwards with a velocity of ~500 km s−1 some nine minutes after the onset of the substorm. Coincident with this event the IMAGE spacecraft detected an auroral streamer in the substorm auroral bulge in the Southern Hemisphere near the footpoints of the Cluster spacecraft. Using FluxGate Magnetometer (FGM) data from the four Cluster spacecraft, we determine the field-aligned currents in the BBF, using the curlometer technique, to have been ~5 mA km−2. When projected into the ionosphere, these currents give ionospheric field-aligned currents of ~18 A km−2, which is comparable with previously observed ionospheric field-aligned currents associated with BBFs and auroral streamers. The observations of the BBF are consistent with the plasma \"bubble\" model of Chen and Wolf (1993). Furthermore, we show that the observations of the BBF are consistent with the creation of the BBF by the reconnection of open field lines Earthward of a substorm associated near-Earth neutral line.<\/dc:description><dc:date>\n2010-04-27T15:42:07Z<\/dc:date><dc:date>\n2010-04-27T15:42:07Z<\/dc:date><dc:date>\n2008-02-04<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAnnales Geophysicae, 2008, 26 (1), pp. 167-184.<\/dc:identifier><dc:identifier>\n0992-7689<\/dc:identifier><dc:identifier>\nhttp:\/\/www.ann-geophys.net\/26\/167\/2008\/angeo-26-167-2008.html<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7843<\/dc:identifier><dc:identifier>\n10.5194\/angeo-26-167-2008<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:publisher>\nCopernicus Publications on behalf of the European Geosciences Union<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0992-7689","issn:0992-7689"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2008,"topics":[],"subject":["Article"],"fullText":"Ann. Geophys., 26, 167–184, 2008\nwww.ann-geophys.net\/26\/167\/2008\/\n© European Geosciences Union 2008\nAnnales\nGeophysicae\nObserved tail current systems associated with bursty bulk flows and\nauroral streamers during a period of multiple substorms\nC. Forsyth1, M. Lester1, S. W. H. Cowley1, I. Dandouras2, A. N. Fazakerley3, R. C. Fear1, H. U. Frey4, A. Grocott1,\nA. Kadokura5, E. Lucek6, H. Re`me2, S. E. Milan1, and J. Watermann7\n1Dept. Physics and Astronomy, University of Leicester, Leicester, LE1 7RH, UK\n2CESR\/CNRS, 9 Avenue du Colonel Roche, B.P. 4346, 31028, Toulouse Cedex 4, France\n3Mullard Space Science Laboratory, University College London, Holmbury St. Mary, Dorking, Surrey, RH5 6NT, UK\n4Space Sciences Laboratory, University of California, Berkeley, CA 94720, USA\n5National Institute of Polar Research, 9-10-1 Kaga, Itabashi, Tokyo 173-8515, Japan\n6Blackett Laboratory, Imperial College, London, SW7 2BZ, UK\n7Atmosphere Space Research Division, Danish Meteorological Institute, Copenhagen, Denmark\nReceived: 26 March 2007 – Revised: 14 December 2007 – Accepted: 18 December 2007 – Published: 4 February 2008\nAbstract. We present a multi-instrument study of a sub-\nstorm bursty bulk flow (BBF) and auroral streamer. During\na substorm on 25 August 2003, which was one of a series\nof substorms that occurred between 00:00 and 05:00 UT, the\nCluster spacecraft encountered a BBF event travelling Earth-\nwards and duskwards with a velocity of ∼500 km s−1 some\nnine minutes after the onset of the substorm. Coincident with\nthis event the IMAGE spacecraft detected an auroral streamer\nin the substorm auroral bulge in the Southern Hemisphere\nnear the footpoints of the Cluster spacecraft. Using FluxGate\nMagnetometer (FGM) data from the four Cluster spacecraft,\nwe determine the field-aligned currents in the BBF, using the\ncurlometer technique, to have been∼5 mA km−2. When pro-\njected into the ionosphere, these currents give ionospheric\nfield-aligned currents of ∼18 A km−2, which is comparable\nwith previously observed ionospheric field-aligned currents\nassociated with BBFs and auroral streamers. The observa-\ntions of the BBF are consistent with the plasma “bubble”\nmodel of Chen and Wolf (1993). Furthermore, we show that\nthe observations of the BBF are consistent with the creation\nof the BBF by the reconnection of open field lines Earthward\nof a substorm associated near-Earth neutral line.\nKeywords. Magnetosphere (Auroral phenomena; Current\nsystems; Storms and substorms)\nCorrespondence to: C. Forsyth\n(cf50@ion.le.ac.uk)\n1 Introduction\nThe current circuits of the magnetosphere-ionosphere system\nare a fundamental constituent of the near-Earth space envi-\nronment. Whereas large scale current systems, such as the\nsubstorm current wedge, can excite auroral activity covering\nmany hours of magnetic local time (MLT), localised current\nsystems can excite localised auroral forms. Ground-based\nmagnetometers and radars and low Earth orbiting spacecraft\nhave previously been used to study the ionospheric current\nsystems, but the launch of the Cluster mission in 2001 pro-\nvides a unique opportunity to study current systems out in\nthe magnetosphere.\nPrevious studies have shown that the flow diversions and\nmagnetic shears observed along the edges of bursts of high\nspeed plasma convection in the plasma sheet, termed bursty\nbulk flows (BBFs), are consistent with the concept of field-\naligned currents flowing in BBFs, forming a localised cur-\nrent wedge (Sergeev et al., 1996; Birn and Hesse, 1996;\nBirn et al., 1999, 2004). These are also consistent with a\nmodel of these flows as “bubbles” of under-populated flux\ntubes propagating through the plasma sheet (Chen and Wolf,\n1993). In particular Sergeev et al. (1996) showed that the\nmodel of Chen and Wolf (1993) predicted that BBFs would\nhave currents into the ionosphere on their dawnward edge\nand out of the ionosphere on their duskward edge. They also\nshowed that the model predicted a magnetic shear at the sur-\nface of the flow and that the side of the flow that the space-\ncraft passed through (duskward or dawnward) could be de-\ntermined by analysing the plane of the surface of the flow.\nFrom this they determined that if the sign of the product of\nPublished by Copernicus Publications on behalf of the European Geosciences Union.\n168 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\nBX and the change in BY was negative (positive), the space-\ncraft passed through the duskward (dawnward) edge of the\nflow (Sergeev et al., 1996, Fig. 2) and vice versa beneath\nthe plasma sheet. It should be noted that most definitions of\nBBFs (see e.g. Cao et al., 2006) consider multiple bursts of\nhigh speed plasma flow within a limited period (commonly\n10 min) to be a single BBF. As such, we can apply the re-\nsults of Chen and Wolf (1993) and Sergeev et al. (1996) to\nindividual flow bursts within a BBF.\nIn recent years, there have been a number of studies re-\nlating BBFs to auroral streamers either explicitly, with di-\nrect observation of both features (e.g. Lyons et al., 1999;\nNakamura et al., 2001a,b), or implicitly, with ionospheric\nmeasurements being compared to the predicted form of the\nionospheric manifestations of BBFs from the model of Chen\nand Wolf (1993) (e.g. Henderson et al., 1998; Amm et al.,\n1999; Sergeev et al., 2004). In particular, Nakamura et al.\n(2001a) dealt with the footprint location of the Geotail satel-\nlite and the comparison of Geotail observations of BBFs and\nthe passage of the streamers near the spacecraft’s footprint.\nThey found good spatial and temporal correlation between\nflow bursts in the tail and auroral activity. They also found\nthat auroral enhancements that break up within the vicinity\nof the spacecraft footprint, calculated using the Hybrid In-\nput Algorithm (HIA) (Kubyshkina et al., 1999) to modify the\nmagnetic field model of Tsyganenko (1989), appeared within\n±1 min of the flow onset in the tail. It should be noted that\nin the study by Nakamura et al. (2001a), the variations in the\nfootpoint location from the different models tended to be in\nthe north-south direction as opposed to a change in the MLT.\nStudies of ionospheric current systems near the footpoints\nof BBFs and associated with auroral streamers have shown\nthat they are also consistent with the Chen and Wolf (1993)\nmodel (Amm et al., 1999; Sergeev et al., 2004; Nakamura\net al., 2005). Combined ground and space-based studies\nof the ionosphere during the passage of auroral streamers\nhave shown that the bright westward edge of the streamer\nis associated with a large, upward field-aligned current den-\nsity whereas diffuse aurora to the east is associated with a\nlower, Earthward current density (Amm et al., 1999; Sergeev\net al., 2004), although a lack of tail observations meant that\nthese streamers could not be directly associated with bursty\nbulk flows. Amm et al. (1999) inferred field-aligned currents\nin streamers of ∼25 A km−2 by using the method of char-\nacteristics (Inhester et al., 1992; Amm, 1995, 1998) to in-\nvert ground magnetic field data and ionospheric electric field\ndata. This forward technique solves a 2-D partial differential\nequation along its characteristics for the Hall conductance,\nallowing other electrodynamic parameters to be inferred with\nthe inclusion of the measurements. Grocott et al. (2004) es-\ntimated an ionospheric field-aligned current of ∼0.2 A km−2\nnear the footpoint of the Cluster spacecraft as the spacecraft\ndetected the passage of a BBF during a “quiet” period, by\nmeasuring the curl of the ionospheric flows detected by the\nCUTLASS radars (Lester et al., 2004) and assuming a non-\nsubstorm Pedersen conductivity of a few Siemens. They\nshowed that this current system was associated with auro-\nral activity with a maximum brightness of ∼1 kR, although\nthey did not discuss the current system in terms of the Chen\nand Wolf (1993) model. Nakamura et al. (2005) inferred the\ncurl of the ionospheric equivalent currents near the footpoint\nof the Cluster spacecraft at the time of a BBF using the 2-\nD spherical elementary current technique of Amm and Vil-\njanen (1999) to invert IMAGE magnetometer data. In the\ncase of uniform conductances within the region of the Clus-\nter footpoint, this gave field-aligned currents of the order of\n3 A km−2. However, no auroral data were presented such\nthat the passage of an auroral streamer could not be con-\nfirmed. Also, EISCAT radar data indicated that there were\nlocalised conductance enhancements, although the localised\nfeature was considered not to affect the overall current pat-\ntern. The currents observed in these studies vary by two or-\nders of magnitude, although the three values were obtained\nduring differing periods of auroral, magnetic and substorm\nactivity, indicating that the substorm phase during which the\nBBF is detected has a strong influence on the associated cur-\nrents. A review of the ionospheric signatures of BBFs is\ngiven by Amm and Kauristie (2002).\nOn 25 August 2003, the Cluster spacecraft observed a\nBBF consisting of two flow bursts during a period of mul-\ntiple substorms. Simultaneously, the IMAGE spacecraft ob-\nserved an auroral streamer in the Southern Hemisphere auro-\nral oval. We show that the field-aligned currents detected by\nthe Cluster spacecraft, calculated using the curlometer tech-\nnique (Dunlop et al., 1988; Robert et al., 1998, and references\ntherein), are consistent with previous ground-based studies of\nionospheric currents detected in association with an auroral\nstreamer by Amm et al. (1999). The pitch angle distribu-\ntion, energy spectra of particles, ion density and magnetic\nflux within the flow are shown to be consistent with the re-\nconnection of open field lines close to the spacecraft.\n2 Instrumentation\nFigure 1 presents the locations of the Cluster and IMAGE\nspacecraft in X-Y, X-Z and Y-Z planes in GSM coordinates\n(spacecraft data will be given in GSM coordinates unless oth-\nerwise stated) at 00:00, 01:00 and 02:00 UT on 25 August\n2003. The Cluster spacecraft separation has been magni-\nfied by a factor of 200 and Cluster 1 (Rumba, blue) is plot-\nted at the correct location. The dashed lines represent the\nmagnetic field lines of the model of Tsyganenko and Stern\n(1996) (hereafter referred to as the T96 model) which pass\nthrough the location of Cluster 1 at these times. All the\nCluster spacecraft were south of, and moving away from,\nthe centre of the plasma sheet in the post-midnight sector,\nwith Cluster 4 (Tango, red) furthest south and Cluster 1–3\n(Rumba, blue, Salsa, green and Samba, yellow) at approxi-\nmately the same Z location. Cluster 1 (blue) was closest to\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 169\ndawn and Cluster 2 (green) was closest to dusk. Cluster 3\n(yellow) was furthest down tail. At 01:00 UT Cluster 1 was\nlocated at [−18.62,−3.58,−0.96]RE and the average separa-\ntion of the spacecraft was 120 km. Cluster data are presented\nhere from the FluxGate Magnetometer (FGM; Balogh et al.,\n2001), the Cluster Ion Spectrometer CODIF sensor (CIS;\nRe`me et al., 2001), and the Plasma Electron And Current\nExperiment High Energy Electron Analyser (PEACE HEEA;\nJohnstone et al., 1997). The FGM data presented is based\non the full resolution (22 Hz) data from the Cluster Active\nArchive. These data have been calibrated such that they are\nbetter suited to the multi-spacecraft analysis presented within\nthis study. Plots of the data from the PEACE HEEA sensor\nalso include a trace of the spacecraft potential, as measured\nby the Electric Fields and Waves instrument (EFW; Gustafs-\nson et al., 2001).\nThe IMAGE spacecraft passed through perigee at around\n23:30 on 24 August 2003 and was travelling sunward and\nduskward during the interval, passing over the southern mag-\nnetic pole shortly after midnight. Data is presented from\nthe Far-UltraViolet Wideband Imaging Camera (FUV-WIC;\nMende et al., 2000a,b) on board IMAGE.\nInterplanetary magnetic field and solar wind data were\nobtained by the Advanced Composition Explorer spacecraft\n(ACE; Stone et al., 1998) located in the solar wind upstream\nof the Earth at [227,−26,15]RE GSM. Data are employed\nfrom the magnetometer (MAG; Smith et al., 1998) and So-\nlar Wind Electron Proton Alpha Monitor (SWEPAM; McCo-\nmas et al., 1998) instruments. The data have been lagged by\n44 min to the magnetopause using the method of Khan and\nCowley (1999), with an uncertainty of ±3 min.\nGround-based magnetometer data are presented from the\nwest coast magnetometer stations of the Greenland mag-\nnetometer chain operated by the Danish Meteorological\nInstitute (DMI) (for instrument details, see http:\/\/www.\ndmi.dk\/projects\/chain\/greenland.html) and from the Antarc-\ntic low power magnetometer (LPM) chains operated by\nthe British Antarctic Survey (BAS) and the Japanese Na-\ntional Institute for Polar Research (NIPR) (for instru-\nment details, see http:\/\/www.antarctica.ac.uk\/bas research\/\ninstruments\/lpm.php). Figure 2 indicates the locations of\nthese magnetometer stations in MLT-invariant latitude mag-\nnetic coordinates at 01:16 UT on 25 August 2003 from alti-\ntude adjusted corrected geomagnetic coordinates (AACGM)\n(Baker and Wing, 1989). The magnetic footpoint of the Clus-\nter spacecraft, calculated using the T96 model, is shown as a\nred star in each panel.\n3 Observations\n3.1 Cluster observations\nData from the Cluster FGM and CIS instruments from Clus-\nter 4 between 01:00 and 02:00 UT, encompassing the sub-\nFigures\n5 0 -5 -10 -15 -20 -25\nXGSM\n15\n10\n5\n0\n-5\n-10\n-15\nY\nG\nS\nM\n5 0 -5 -10 -15 -20 -25\nXGSM\n-15\n-10\n-5\n0\n5\n10\n15\nZ\nG\nS\nM\n-15 -10 -5 0 5 10 15\nYGSM\n-15\n-10\n-5\n0\n5\n10\n15\nZ\nG\nS\nM\nCluster 1 (Rumba)\nCluster 2 (Salsa)\nCluster 3 (Samba)\nCluster 4 (Tango)\n 00:00 UT \n01:00UT \n 02:00 U\nT \n     00\n:00 U\nT \n     01\n:00 \nT \n     02\n:00 \n0:00U\n \nT\n 0\n1\n:0\n0\n U\nT\n \n 0\n2\n:0\n0\n U\nT\n \n     0\n0:00\n UT\n     0\n1:00\n UT\n \n     0\n2:00\n UT\n 0\n0:\n00\n U\nT\n 0\n1:\n00\n U\nT \n02\n:0\n0 \nUT\nU\nU\n(a)\n(c)\n(b)\nT \nFig. 1. Plots of the Cluster and IMAGE orbital positions between 00:00, 01:00 and 02:00 UT in the\n(a) X-Y, (b) Y-Z and (c) X-Z in GSM coordinates. The Cluster tetrahedron is magnified by a factor\nof 200. Cluster 1 (Rumba, blue) is plotted at the correct location. The dotted lines represent the\nmagnetic field lines passing through Cluster 1 at 00:00, 01:00 and 02:00 UT as determined by the\nTsyganenko T96 model (Tsyganenko and Stern, 1996).\n34\nFig. 1. Plots of the Cluster and IMAGE orbital positions between\n00: , 01:00 and 02:00 UT in the (a) X-Y, (b) Y-Z and (c) X-Z in\nGSM oordinate . T e Clust tetrahedron is magnifie by a factor\nof 200. Cluster 1 (Rumb , blue) is plotted at the correct location.\nThe dotted lines represent the magnetic field lines passing through\nCluster 1 at 00:00, 01:00 and 02:00 UT as determined by the Tsy-\nganenko T96 model (Tsyganenko and Stern, 1996).\nstorm, are presented in Fig. 3. CIS data were unavailable\nfrom Cluster 1 and 2 and data from Cluster 3 were noisy and\nwill not be discussed here. Discussion of ion moments from\nthe CIS instrument on board Cluster 4 will refer to the proton\nmoments derived from the CODIF sensor, since the proton\ndensities detected by the CIS instrument were much larger\nthan the densities of other ions. Differences in the FGM data\nfrom the four spacecraft are unnoticeable on the timescales\npresented here and as such, overall magnetic field conditions\nare taken to be those at Cluster 4. The FGM data have been\nsmoothed using a 4 s Box Car filter. Figure 3a shows the\nion density moments from the CIS instrument. Figure 3b–e\nshows the magnetic field components in the X, Y and Z GSM\ndirections and the total magnetic field strength, respectively,\nfrom the FGM instrument. The red dashed line in Fig. 3b–e\nrepresents the T96 model magnetic field values at the loca-\ntion of the spacecraft. The vertical dashed line at 01:15 UT\nindicates the time at which Cluster first detected evidence\nof the substorm expansion phase, evidenced as a decrease in\nthe total magnetic field of∼30 nT over the following 12 min,\ndominated by a decrease in the BX component indicating a\ndipolarisation of the magnetic field. The shaded area indi-\ncates the time at which Cluster encountered the BBF.\nAt 01:13 UT, the ion density (Fig. 3a) began to increase\nfrom 0.01 cm−3 to 0.3 cm−3, indicating that the plasma sheet\nboundary layer (PSBL) encompassed the spacecraft. Be-\ntween 01:15 and 01:27 UT, the total magnetic field strength\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n170 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\n(a)\nTHL\nSVS\nKUV\nUPN\nUMQ\nGDH\nATU\nSTFSKT\nGHB\nNRD\nDMH\nDNB\nSCO\nM78-337\nM79-336\nM81-338 M82-003\nM83-348M84-336\nM85-002\nM85-096\nM87-028\nM87-068\nM88-316\nM68-041\nM69-041\nM70-039\nM70-044\nM74-043\nM77-040\nFHB\nNAQ\nAMK\nFig. 2. Maps indicating (a) the locations of the Greenland magnetometer chain run by the Danish\nMeteorological Institute and (b) the Antarctic low power magnetometer chains run by the British\nAntarctic Survey and the Japanese National Institute for Polar Research in MLT - invariant latitude\ncoordinates calculated at 01:16 UT on 25 August 2003 from altitude adjusted corrected geomagnetic\ncoordinates (12:00 MLT is at the top and 18:00 MLT to the left). The Cluster footpoint at this time\nis indicated by the red star. The radial dotted lines indicate hours of MLT, while the dotted concentric\ncircles are shown for every 10° of magnetic latitude.\n35\n(b)\nTHL\nSVS\nKUV\nUPN\nUMQ\nGDH\nATU\nSTFSKT\nGHB\nNRD\nDMH\nDNB\nSCO\nM78-337\nM79-336\nM81-338 M82-003\nM83-348M84-336\nM85-002\nM85-096\nM87-028\nM87-068\nM88-316\nM68-041\nM69-041\nM70-039\nM70-044\nM74-043\nM77-040\nFHB\nNAQ\nAMK\nFig. 2. Maps indicating (a) the locations of the Greenland magnetometer chain run by the Danish\nMeteorological Institute and (b) the Antarctic low power magnetometer chains run by the British\nAntarctic Survey and the Japanese National Institute for Polar Research in MLT - invariant latitude\ncoordinates calculated at 01:16 UT on 25 August 2003 from altitude adjusted corrected geomagnetic\ncoordinates (12:00 MLT is at the top and 18:00 MLT to the left). The Cluster footpoint at this time\nis indicated by the red star. The radial dotted lines indicate hours of MLT, while the dotted concentric\ncircles are shown for every 10° of magnetic latitude.\n35\nFig. 2. Maps indicating (a) the locations of the Greenland mag-\nnetometer chain run by the Danish Meteorological Institute and (b)\nthe Antarctic low power magnetometer chains run by the British\nAntarctic Survey and the Japanese National Institute for Polar Re-\nsearch in MLT-invariant latitude coordinates calculated at 01:16 UT\non 25 August 2003 from altitude adjusted corrected geomagnetic\ncoordinates (12:00 MLT is at the top and 18:00 MLT to the left).\nThe Cluster footpoint at this time is indicated by the red star. The\nradial dotted lines indicate hours of MLT, while the dotted concen-\ntric circles ar shown for every 10◦ o magnetic latitude.\n(Fig. 3e) dropped by ∼30 nT, dominated by a decline in the\nBX component (Fig. 3b). The BZ component (Fig. 3d) was\nelevated above that of the model field throughout most of the\n(a)\n(b)\n(c)\n(d)\n(e)\nFig. 3. Stacked plots of the ion and magnetic field data from Cluster 4, showing (a) the ion density,\n(b)-(d) the X, Y, and Z components of the magnetic field in GSM coordinates, and (e) the total\nmagnetic field value. The dotted lines represent the zero value in panels (b)-(e), while the red dashed\nline represents the T96 model field value. The vertical dashed line indicates the time at which\nCluster 4 detected the substorm expansion phase. The shaded area indicates Cluster’s encounter\nwith the BBF.\n36\nFig. 3. Stacked plots of the ion a d magnetic fiel data from Clus-\nter 4, showing (a) th io d n ity, (b–d) the X, Y, and Z compon ts\nof the magnetic fiel in GSM coordinates, and ( ) the total agnetic\nfield value. The dashed lines represent the zero value in panels (b–\ne), while the red dashed line represents the T96 model field value.\nThe vertical dashed line indicates the time at which Cluster 4 de-\ntected the substorm expansion phase. The shaded area indicates\nCluster’s encounter with the BBF.\ninterval, which, coupled with the decrease in the BX compo-\nnent, indicates that the field became more dipole-like at this\ntime. This is taken to be an indication that the Cluster space-\ncraft detected a substorm expansion phase onset at 01:15 UT.\nSince Cluster was initially in the southern lobe and moving\naway from the central plasma sheet, the plasma sheet config-\nuration changed so as to engulf the spacecraft.\nPrevious studies have used various criteria to define BBFs.\nCao et al. (2006) summarise several of these in their statis-\ntical investigation of BBFs detected by the Cluster space-\ncraft. Angelopoulos et al. (1994) defined a BBF as segments\nof continuous total ion flow velocity >100 km s−1, with a\npeak in the velocity of >400 km s−1 whilst the observing\nspacecraft was in the inner plasma sheet (β>0.5). Raj et al.\n(2002) replaced the peak velocity and β conditions with the\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 171\nconditions that the peak flow velocity perpendicular to the\nmagnetic field, Vperp, >250 km s−1 and that βXY>2 (based\non the X and Y components of the magnetic field). We adapt\nthe above to emphasise the convective element of the model\nsuch that Vperp>300 km s−1 for the flow enhancement to be\nconsidered a BBF. Based on the prediction of the model of\nChen and Wolf (1993) that the under-populated flux tubes\nthat make up a BBF are convecting magnetic structures in\nwhich the magnetic field magnitude is enhanced, we distin-\nguish between flow bursts within the BBF based on the mag-\nnetic field magnitude. We also compare the magnetic field\ndata and ion density to distinguish between separate flow\nbursts. This differs from the definition given by Angelopou-\nlos et al. (1992), who used the plasma flow data to define\nflow bursts.\nAt 01:24 UT, approximately 9 min after Cluster detected\nthe substorm expansion phase, the spacecraft encountered a\nbursty bulk flow consisting of two flow bursts (indicated by\nthe shaded region in Fig. 3) followed by a low magnetic field\nevent in which the total magnetic field strength at Cluster\ndropped to ∼1 nT . We now consider data from the Cluster\nspacecraft which illustrate the passage of the BBF and the\nsubsequent low field event.\nPresented in Fig. 4 are data from the FGM and CIS instru-\nments between 01:18 and 01:30 UT. Figure 4a shows the ion\ndensity. Figure 4b shows the ion velocity perpendicular to\nthe magnetic field (black), defined as b×(V×b) where b is\nthe unit magnetic field vector and V is the ion velocity vec-\ntor, the ion velocity parallel to the magnetic field (blue), and\nthe total ion velocity(red). Figure 4c shows plasma beta (β,\nblack) and the plasma beta calculated using only the BX and\nBY GSM components (βXY , blue). Figure 4d–g shows the X,\nY and Z GSM components of the magnetic field and the total\nmagnetic field strength, respectively. The green shaded area\nindicates the time at which the BBF engulfed Cluster. The\nhorizontal dashed line in Fig. 4b–f indicates the zero value.\nThe horizontal dotted line in Fig. 4b indicates 300 km s−1.\nThe red dashed line in Fig. 4d–g represents the T96 model\nfield value. The dotted vertical lines represent the start of\neach of the two flow bursts. The dashed vertical lines en-\nclose the low field event.\nBetween 01:24:15 and 01:26:15 UT, the ion velocity per-\npendicular to the magnetic field at Cluster (Fig. 4b) increased\nto >300 km s−1 with a peak value of ∼720 km s−1 and a\nmean value of ∼500 km s−1. Simultaneously, the magnetic\nfield strength increased in all components by ∼5 nT indicat-\ning that Cluster encountered a BBF. The ion density detected\nby Cluster at this time halved (Fig. 4a). There was a brief\ndrop in the magnetic field magnitude between ∼01:25:30\nand∼01:25:50 UT coincident with a recovery in the ion den-\nsity, indicating that the BBF consisted of two flow bursts or\nplasma “bubbles” as described by Chen and Wolf (1993).\nFollowing the encounter with the BBF, the magnetic field\nstrength dropped to ∼5 nT at 01:26:20 UT and continued\nto drop until ∼1:27:20 UT, with the BX (Fig. 4d) and BZ\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\nFig. 4. Stacked plots of the ion and magnetic field data from Cluster 4, showing (a) the ion density,\n(b) the ion velocity, (c) the plasma beta, (d)-(f) the X, Y, and Z components of the magnetic field in\nGSM coordinates, and (g) the total magnetic field value. The red line shows the total ion velocity, the\nblue line shows the field parallel velocity and the black line shows the field perpendicular velocity in\npanel (b); the dotted line represents 300 km s−1. The black dashed lines represent the zero value in\npanels (b) and (d)-(f); the red dashed lines in panels (d)-(g) represents the T96 model field value. The\ngreen shaded area indicates the time at which Cluster 4 encountered the BBF and the blue shaded\narea indicates the low field event. The arrows indicate the magnetic features used in the MVAB and\nfour-spacecraft timing analysis. The dotted vertical lines represent the start of each of the two flow\nbursts. The dashed vertical lines enclose the low field event.\n37Fig. 4. Stacked plot of the ion and m gnetic fi ld data from C us-\nter 4, showing (a) e ion density, (b) the ion vel ci y, (c) the plasma\nbeta, (d–f) the X, Y, and Z components of the magnetic field in\nGSM coordinates, and (g) the total magnetic field value. The red\nline shows the total ion velocity, the blue line shows the field paral-\nlel velocity and the black line shows the field perpendicular veloc-\nity in panel (b); the dotted line represents 300 km s−1. The black\ndashed lines represent the zero value in panels (b) and (d–f); the red\ndashed lines in panels (d–g) represents the T96 model field value.\nThe green shaded area indicates the time at which Cluster 4 en-\ncountered the BBF and the blue shaded area indicates the low field\nevent. The arrows indicate the magnetic features used in the MVAB\nand four-spacecraft timing analysis. The dotted vertical lines rep-\nresent the start of each of the two flow bursts. The dashed vertical\nlines enclose the low field event.\n(Fig. 4f) components reversing just before the field strength\nreached its minimum value. During the recovery of the BX\nand BZ components, the BY (Fig. 4e) component also briefly\nreversed. We note that the plasma β and βXY were similar\nthroughout. At the time of the BBF, both were ∼2, whereas\nduring the PSBL crossings both were <1.\nPrevious studies have shown the scale size of BBFs in\nthe Y direction to be between 1 and 5RE and in the X\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n172 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\nTable 1. The means of the outputs of the minimum variance analysis (MVAB) across the Cluster spacecraft and the outputs of the four-\nspacecraft timing analysis (4SC) at various universal times. The universal times indicate the start of a 5 s period of data analysed by each\nmethod. The vectors are the normals to the boundaries of the flow bursts.\nUT MVAB X MVAB Y MVAB Z λ2\/λ3 4SC X 4SC Y 4SC Z Vel.\n01:24:25 0.406 0.147 0.897 31.6 0.297 0.239 0.924 160 km s−1\n01:25:32 0.286 −0.911 0.289 16.6 0.691 −0.223 0.688 165 km s−1\n01:25:47 0.214 0.573 0.780 7.6 0.446 0.073 0.892 190 km s−1\n01:26:15 0.605 0.332 0.722 36.6 0.444 0.333 0.871 170 km s−1\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n1.0\n0.0\n-1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n1.0\n0.0\n-1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n1.0\n0.0\n-1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.5 1.0 0.5 0. -0.5 -1.0 -1.5\n-1.0\n0.0\n1.0\n1.0 0.0 -1.0\n1.0\n0.0\n-1.0\n1.0 0.0 -1.0\n-1.0\n0.0\n1.0\n1.0 0.0 -1.0\n-1.0\n0.0\n1.0\nXY XZ YZ\n(a)\n(b)\n(c)\n(d)\nFig. 5. Plots of the boundaries of the BBF flow bursts as determined by MVAB (blue) and four-\nspacecraft timing analysis (black) at the four times given in table 1 (lines (a)-(d) respectively) in the\nXY, XZ and YZ GSM planes. The horizontal axes are in the XGSM , XGSM and YGSM directions\nrespectively. The lines represent the boundary of the BBF flow bursts and the arrows represent the\nnormals to the boundary. The green arrows indicate the perpendicular ion velocity at the given times.\n38\nFig. 5. Plots of the boundaries of the BBF flow bursts as determined\nby MVAB (blue) and four-spacecraft timing analysis (black) at the\nfour times giv n in Tabl 1 (lines a–d, respectively) in the XY, XZ\nand YZ GSM planes. The horizontal ax s are in the XGSM, XGSM\nand YGSM directions, respectively. The lines represent the bound-\nary of the BBF flow bursts and the arrows represent the normals\nto the boundary. The green arrows indicate the perpendicular ion\nvelocity at the given times.\ndirection to be >10RE (Sergeev et al., 1996; Angelopoulos\net al., 1997; Kauristie et al., 2000; Nakamura et al., 2001b,\n2004; Amm and Kauristie, 2002). We therefore assume that\nthe separation of the Cluster spacecraft during the interval\nin question (∼120 km) was significantly less than the scale\nsize of the BBF. Considering the two flow bursts as localised\nmagnetic field structures, we can determine the orientation\nof the boundaries of these structures, and the directions of\nthe normals to the boundaries, by considering the boundary\nlocally as a planar surface and applying minimum variance\nanalysis (MVAB) (Sonnerup and Cahill, 1967; Sonnerup and\nScheible, 1998) and four-spacecraft timing analysis (Russell\net al., 1983; Harvey, 1998) techniques to the magnetic field\ndata. The arrows in Fig. 4g indicate the variations in the to-\ntal magnetic field used in the four-spacecraft timing analysis.\nThe results of these two analysis techniques are given in Ta-\nble 1. The X, Y, and Z columns show the components of the\nvector normal to the boundary determined by each method.\nThe universal times indicate the start of a 5 s period of data\nanalysed by each method. The ratio of the intermediate to\nminimum eigenvalues (λ2 and λ3, respectively) for the vari-\nance directions are given as an indicator of the quality of the\nMVAB results, with larger ratios indicating a more reliable\nresult. The velocity is the velocity of the boundary along the\nvector as determined by the four-spacecraft timing analysis.\nThe mean results from MVAB from all four Cluster space-\ncraft are given for 01:24:25 and 01:26:15 UT. The mean\nresults from MVAB from Cluster 2, 3 and 4 are given for\n01:25:32 UT and from Cluster 1, 2 and 3 for 01:25:47 UT. At\nthese times, the vectors from the remaining spacecraft were\nsignificantly different from those presented. Also, the ratios\nof the intermediate to minimum eigenvalues, were low (of the\norder of 1), indicating that the MVAB results were poor com-\npared with the results from the other spacecraft. We note that\nthe ratios of the intermediate to minimum eigenvalues given\nare, in most cases, greater than those obtained by Nakamura\net al. (2001b), who used this method to find the normal to the\ndiscontinuity in the magnetic field at the surface of a number\nof BBFs. Comparison of the full resolution FGM data from\neach spacecraft (not shown) for the field reversals shows that\nthe field reversals were “nested” such that the last spacecraft\nto detect the negative change in BZ was the first to detect the\npositive change in BZ . This signature is consistent with the\nlow field strength event moving across the Cluster tetrahe-\ndron and then moving back. However, the time lags between\nthe spacecraft were small and the variability in the magnetic\nfield components across the four Cluster spacecraft increased\nduring the low field event, such that further analysis of the\nstructure and the determination of the motion and orientation\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 173\nof the structure using either four-spacecraft timing or MVAB\nis badly defined, although a visual inspection of the data sug-\ngests motion predominantly in the ZGSM direction.\nFigure 5 shows the MVAB (blue) and four-spacecraft tim-\ning analysis (black) vectors normal to the flow boundaries as\narrows, and the flow boundaries themselves as lines in the\nX-Y, X-Z and Y-Z planes at 01:24:25, 01:25:32, 01:25:47,\nand 01:26:15 UT (rows a–d, respectively). The green arrows\nrepresent the unit vectors of ion velocity perpendicular to\nthe field at those times. The sense of the MVAB and four-\nspacecraft timing vectors are similar, such that, in each case,\nthe vectors are pointing through the same quadrant. Rows (a)\nand (d) show a particularly good correspondence between\nthe two analysis techniques, whereas in rows (b) and (c),\nin which the MVAB vectors had a lower eigenvalue ratio,\nthe correspondence is less good between the two techniques.\nThe vectors in the X-Z plane show that the normals to the\nboundaries and the motion of the field lines were predom-\ninantly in the Z direction, although this is expected, given\nthat the plasma sheet field lines are highly distended and\ncontracting. The orientation of the boundary changes in the\ndusk-dawn direction between rows (a) and (b), representing\nthe boundaries of the first flow burst. This change is not seen\nbetween rows (c) and (d), representing the boundaries of the\nsecond flow burst, such that both boundaries are orientated\ntowards dusk. We note that at each boundary the ion veloc-\nity perpendicular to the field, i.e. the field line motion, was\ndirected more towards dusk than the boundaries in each case.\nComparison of the instantaneous magnetic field vector be-\ntween the four Cluster spacecraft enables the curl and di-\nvergence of the magnetic field within the tetrahedron to be\nestimated by the curlometer technique and the net current\nthrough the spacecraft tetrahedron to be calculated (Dunlop\net al., 1988; Robert et al., 1998, and references therein). We\nnote that the divergence of the magnetic field is zero, from\nGauss’ Law, and as such, any measured divergence high-\nlights the limitations of this analysis technique. We there-\nfore use the measured divergence as a numerical check by\ncomparing this with the measured curl of the magnetic field.\nFigure 6 shows the results of the curlometer analysis. Fig-\nure 6a–d shows the currents in the X, Y, Z and field parallel\n(i.e. field-aligned currents) directions deduced from the curl\nof the magnetic field. Positive field-aligned currents indicate\na tailward directed current. The ratio of the divergence of the\nmagnetic field and modulus of the curl of the magnetic field\n(Fig. 6e) acts as an indication of the quality of the result from\nthe curlometer technique, with lower ratios indicating more\nreliable results. The analysis output has been smoothed using\na 10 s Box Car filter in order to reduce the variability in the\ndata and highlight the large scale structure. The blue line in\nFig. 6e is the ratio of the divergence and curl of the magnetic\nfield smoothed with a 60 s Box Car filter to further highlight\nthe lower ratio at the time of the BBF. We note that the un-\nsmoothed currents (not shown) are highly variable, with the\npolarity of the current changing rapidly. However, such small\n(a)\n(b)\n(c)\n(d)\n(e)\nFig. 6. Stacked plots of the results of the curlometer analysis of the FGM data from the Cluster\nspacecraft, showing (a)-(d) the X, Y, Z and field-aligned components of curl vector of the magnetic\nfield and (e) the ratio of the moduli of the divergence and curl of the magnetic field. The data have\nbeen smoothed with a 10 s Box Car filter. The dotted lines represent the zero value in panels (a)-(d).\nThe blue line (panel (e)) shows the ratio of the moduli of the divergence and curl of the magnetic\nfield smoothed with a 60 s Box Car filter. The green shaded area indicates the time at which Cluster\nencountered the BBF and the blue shaded area indicates the low field event. Positive field-aligned\ncurrents represent tailward flow, given that Cluster was beneath the current sheet. The dotted vertical\nlines represent the start of each of the two flow bursts. The dashed vertical lines indicate enclose the\nlow field event.\n39\nFig. 6. Stacked plots of the r sults of the curlometer analysis of\nthe FGM da a from the Cluste spacecraft, showing (a–d) the X,\nY, Z and field-aligned components of curl vector of the magnetic\nfield and (e) the ratio of the moduli of the divergence and curl of\nthe magnetic field. The data have been smoothed with a 10 s Box\nCar filter. The dashed lines represent the zero value in panels (a–\nd). The blue line (panel e) shows the ratio of the moduli of the\ndivergence and curl of the magnetic field smoothed with a 60 s Box\nCar filter. The green shaded area indicates the time at which Cluster\nencountered the BBF and the blue shaded area indicates the low\nfield event. Positive field-aligned currents represent tailward flow,\ngiven that Cluster was beneath the current sheet. The dotted vertical\nlines represent the start of each of the two flow bursts. The dashed\nvertical lines indicate enclose the low field event.\nscale current systems are beyond the scope of this paper, in\nwhich we consider the variations in the current on the scale\nof the flow bursts themselves.\nBetween 01:24 and 01:28 UT the field-aligned currents are\nenhanced (Fig. 6d). During the passage of each flow burst\n(between 01:24 and 01:27 UT) the field-aligned currents are\ninitially tailwards and then turn Earthwards. The currents\nin both Earthward and tailward directions have peak mag-\nnitudes of ∼5 mA km−2. These values of the field-aligned\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n174 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\n2x10\n5\n1x10\n5\n0\n2x10\n5\n1x10\n5\n0\n2x10\n5\n1x10\n5\n0\n2x10\n5\n1x10\n5\n0\n2x10\n5\n1x10\n5\n0\n(a)\n(b)\n(c)\n(d)\n(e)\nFig. 7. The pitch angle distribution of the ion differential num-\nber flux for ions with energy >1 keV at (a) 01:15:13, (b) 01:17:04,\n(c) 01:21:10, (d) 01:24:57, (e) 01:28:55 UT. A pitch angle of 180◦\nrepresents Earthward flowing ions.\ncurrents in the plasma sheet can be scaled up, although some-\nwhat crudely, using the T96 model magnetic field to give an\nestimate of the ionospheric field-aligned currents associated\nwith the detected flow of ∼18 A km−2. During the low field\nevent (indicated by the blue shading) that follows the BBF,\nbetween 01:26:15 and 01:27:45 UT, the field-aligned cur-\nrents become larger, with peaks >10 mA km−2. The means\nof the magnitudes of the X, Y and Z components of the mag-\nnetic field and current data show that during this period the\nZ component of the magnetic field and Y component of the\ncurrent had the largest components, suggesting that Cluster\nentered the current sheet. The ratio of the moduli of the di-\nvergence and curl of the field (Fig. 6e) drops during the pas-\nsage of the BBF and the low field event, indicating that the\nresults of the curlometer are due to currents flowing through\nthe spacecraft tetrahedron.\nFigure 7 shows the pitch angle distribution of ions with\nenergy >1 keV from the CIS instrument on board Cluster 4\nat (a) 01:15:13, (b) 01:17:04, (c) 01:21:10, (d) 01:24:57, (e)\n01:28:55 UT. These times are indicative of Cluster first en-\ntering the PSBL, Cluster approaching the inner edge of the\nPSBL, Cluster located in the plasma sheet before the BBF,\nCluster’s encounter with the BBF and Cluster re-entering the\nplasma sheet, respectively. A pitch angle of 180◦ represents\nEarthward flowing ions. Presented in Fig. 8 is the omni-\ndirectional ion differential number flux in the energy range\n10 eV to 30 keV between 01:10 and 01:30 UT from the CIS\ninstrument on board Cluster 4. Panel (a) presents the data\ni   ii\n(a)\n(b) 01:17:04\n01:24:57\n(a)   (b)       (c)           (d)            (e)\nFig. 8. (a) Colour spectrogram of the ion differential number flux for energies in the range 10 eV-\n30 keV across all pitch angles from the CIS CODIF sensor (b) the ion differential number flux\nagainst energy at (black) 01:17:04 and (yellow) 01:24:57 UT. The labels on the bottom axis of\npanel (a) represent the times of the traces in Fig. 7. Arrows i and ii indicate the times at which\nCluster encountered the PSBL and BBF respectively. The colour scale is shown on the right hand\nside.\n41\nFig. 8. (a) Colour spectrogram of the ion differential number flux\nfor energies in the range 10 eV–30 keV across all pitch angles from\nthe CIS CODIF sensor (b) the ion differential number flux against\nenergy at (black) 01:17:04 and (yellow) 01:24:57 UT. The labels\non the bottom axis of panel (a) represent the times of the traces in\nFig. 7. Arrows i and ii indicate the times at which Cluster encoun-\ntered the PSBL and BBF, respectively. The colour scale is shown\non the right hand side.\nas a spectrogram, whereas panel (b) shows the differential\nnumber flux against ion energy at 01:17:04 UT (black) and\n01:24:57 UT (yellow). At the bottom of Fig. 8a are letters (a)\nto (e) representing the times of the pitch angle distributions\npresented in Fig. 7. From Fig. 8, it can be seen that through-\nout the interval of interest, the majority of the ion population\nhad energies >1 keV.\nBetween 01:15 and 01:18 UT Fig. 8a shows distinct dis-\npersed energy signatures. The ion pitch angle distributions at\nthis time (Fig. 7a and b) show that the ions consisted mainly\nof bidirectional field-aligned beams. After 01:18 UT, the\npitch angle distribution became fairly isotropic (Fig. 7c) in-\ndicating that Cluster was within the plasma sheet. Figure 7d\nindicates that when Cluster encountered the BBF the ions\nagain consisted of bidirectional beams, although the differ-\nential number flux in the Earthward beam was higher than in\nthe tailward beam. At this time, the non-field aligned compo-\nnent of the pitch angle distribution dropped below the plasma\nsheet level (Fig. 7c), indicating that the beam was not super-\nimposed on the plasma sheet but was a separate plasma pop-\nulation. Comparing the differential ion fluxes between the\ninner edge of the PSBL and the BBF (Fig. 8b, black and yel-\nlow lines, respectively) indicates that the ion population at\nthe inner edge of the PSBL was similar to the ion population\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 175\n(a)\n(b)\n(c)\ni   ii\nFig. 9. The differential energy flux of electrons in the energy range 37-2.2×104 eV (a) parallel,\n(b) perpendicular and (c) antiparallel to the magnetic field from the PEACE HEEA sensor on board\nCluster 4 between 01:10-01:30 UT shown in colour spectrogram format. The colour scale is shown\non the right hand side. The black trace in each panel represents the spacecraft potential in volts.\nArrows i and ii indicate the times at which Cluster encountered the PSBL and BBF respectively. The\ncolour scale is shown on the right hand side\n42Fig. 9. The differe ti l nergy flux of electrons in the en rgy range\n37–2.2×104 eV (a) parallel, (b) pe pendicular and (c) antip rallel to\nthe ma netic fi ld from the PEACE HEEA sensor on board Cluster\n4 between 01:10–01:30 UT shown in colour spectrogram format.\nThe colour scale is shown on the right hand side. The black trace\nin each panel represents the spacecraft potential in volts. Arrows i\nand ii indicate the times at which Cluster encountered the PSBL and\nBBF, respectively. The colour scale is shown on the right hand side.\ndetected during the BBF encounter. After Cluster encoun-\ntered the BBF, the spacecraft re-entered the plasma sheet,\nas seen by the isotropic pitch angle distribution (Fig. 7e)\nand the similarity between the ion differential number fluxes\n(Fig. 8a).\nPresented in Fig. 9 are the differential energy fluxes of\nelectrons moving parallel, perpendicular and antiparallel to\nthe magnetic field (Fig. 9a–c, respectively) from the PEACE\nHEEA sensor on board Cluster 4 for the interval 01:10–\n01:30 UT. The spacecraft potential in volts from the EFW\ninstrument is shown as a black trace at the bottom of each\npanel. Between 01:10 and 01:18 UT, there is a high flux of\nlow energy (<60 eV) electrons, although comparison with\nthe spacecraft potential shows that these are photo-electrons\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(a) 01:15:45\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(b) 01:17:48\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(c) 01:19:52\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(d) 01:21:56\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(e) 01:23:59\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(f) 01:26:03\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(g) 01:28:06\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(h) 01:30:10\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(i) 01:32:13\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(j) 01:34:17\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(k) 01:36:21\n-10 -5 0 5 10 15 203\n-25\n-20\n-15\n-10\n-5\n0\n(L) 01:15:45\n<3000\n3250\n3500\n3750\n4000\n4250\n4500\n4750\n5000\n5250\n5500\n5750\nR\na\nyle\nig\nh\ns\nBAS\/NIPR\nDMI\nFig. 10. Eleven consecutive auroral images from the FUV-WIC instrument on board the IMAGE\nspacecraft, taken from 01:15 to 01:37 UT mapped into the AACGM coordinate system and plotted\nin MLT-invariant latitude coordinates. The top of each panel represents the 06:00-18:00 MLTmerid-\nian. The vertical dotted line in each panel represents the 00:00 MLT meridian. The colour scale of\nthe images is shown on the right hand side. Panel (l) shows the locations of the (green dots) BAS and\nNIPR LPM magnetometer chain in the southern hemisphere and the (blue dots) DMI magnetometer\nchain in the northern hemisphere in AACGM coordinates and plotted in MLT-invariant latitude co-\nordinates at 01:15:45 UT. The footprint of the Cluster spacecraft in the southern hemisphere at that\ntime is shown as a red star in panel (l).\n43\nFig. 10. Eleven consecutive auroral images fr m he FUV-WIC\ni strument on board th IMAGE spac craft, taken from 01:15 to\n01:37 UT mapped into the AACGM coordinate system and plotted\nin MLT-invariant latitude coordinates. The top of each panel rep-\nresents the 06:00–18:00 MLT meridian. The vertical dotted line in\neach panel represents the 00:00 MLT meridian. The colour scale of\nthe images is shown on the right hand side. Panel (L) shows the\nlocations of the (green dots) BAS and NIPR LPM magnetometer\nchain in the Southern Hemisphere and the (blue dots) DMI magne-\ntometer chain in the Northern Hemisphere in AACGM coordinates\nand plotted in MLT-invariant latitude coordinates at 01:15:45 UT.\nThe footprint of the Cluster spacecraft in the Southern Hemisphere\nat that time is shown as a red star in panel (L).\nand not part of the natural plasma population. Between 01:24\nand 01:26 UT (Fig. 9 arrow ii) the perpendicular electron flux\ndecreased and the electron flux increased in the parallel and\nantiparallel directions, indicating that Cluster encountered\nfield-aligned beams of electrons, which we interpret as the\nsignature of newly reconnected field-lines (e.g. Keiling et al.,\n2006), complementing the ion data. We note, however, that\nthe differential energy flux and energy of the electrons was\nlower during the PSBL crossing compared with the BBF en-\ncounter.\n3.2 IMAGE FUV-WIC observations\nFigure 10 shows a series of consecutive images of the South-\nern Hemisphere auroral region taken by the FUV-WIC in-\nstrument on board the IMAGE spacecraft between 01:15 and\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n176 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\n22:00 23:00 00:00 01:00 02:00\nMagnetic Local Time\n-12\n-4\n-2\n0\n2\n-4\n-2\n0\n2\nN\no\nrm\na\nlis\ne\nd\n l\nu\nm\nin\no\ns\nit\ny\n1:19:52\n1:21:56\n1:23:59\n1:26:03\nU\nT\nFig. 11. Time series of normalised auroral luminosity above 3 kR between 01:19 and 01:27 UT.\nEach trace has been normalised to the maximum luminosity along the trace. The traces plot these\nvalues between magnetic latitudes of -67° and -68° in the range 22:00-02:00 MLT. Each successive\ntrace is offset by -1. The arrows indicate the signature of the auroral streamer.\n44\nFig. 11. Time series of normalised auroral luminosity above 3 kR\nbetween 01:19 and 01:27 UT. Each trace has been normalised to the\nmaximum luminosity along the trace. The traces plot these values\nbetween magnetic latitudes of −67◦ and −68◦ in the range 22:00–\n02:00 MLT. Each successive trace is offset by −1. The arrows in-\ndicate the signature of the auroral streamer.\n01:37 UT. The images have been mapped into AACGM co-\nordinates and plotted in MLT-invariant latitude coordinates\nbased on spacecraft pointing data. The dotted rings repre-\nsent −80◦, −70◦, and −60◦ of invariant latitude from the\ntop of the image outwards. The radial dotted lines represent\nhours of MLT. The top of each panel represents the 06:00–\n18:00 MLT meridian and the vertical dotted lines represent\nthe 00:00 MLT meridian. The T96 model, applied using data\nfrom the ACE spacecraft lagged by 44 min, with an error of\n±3 min, using the technique of Khan and Cowley (1999),\nputs the mapped footpoint of Cluster 4 at ∼01:00 MLT\nthroughout the interval. Figure 10L shows the location of\nthe BAS and NIPR LPM magnetometer chains in the South-\nern Hemisphere (green dots) and the DMI magnetometers in\nthe Northern Hemisphere (blue dots) in MLT-invariant lati-\ntude coordinates from AACGM coordinates at 01:15:45 UT.\nThe Cluster footpoint in the Southern Hemisphere is shown\nas a red star. We note that mapping field lines between hemi-\nspheres is non-trivial and that equivalent MLT-invariant lat-\nitude coordinates may not indicate true magnetic conjugacy\n(see e.g. Østgaard et al., 2004). The FUV-WIC data have\nbeen calibrated such that the flat-field and dayglow have been\nremoved. Comparing Fig. 10a and Fig. 10b shows that there\nwas a brightening of the auroral bulge between the images\nat 01:15:45 and 01:17:48 UT centred at ∼01:00 MLT which\nextended over 2 h of MLT towards dusk and dawn. This indi-\ncates the start of an auroral substorm expansion phase, which\noccurred ∼1–3 min after Cluster detected the substorm ex-\npansion phase in the tail. Figure 10c–k shows that the au-\nroral bulge expanded polewards, as expected for an auroral\nsubstorm, to cover ∼15◦ of magnetic latitude at its widest\npoint at 01:36 UT. Figure 10 panels (c–k) also show that the\nauroral breakup was predominantly in the post-midnight sec-\ntor. Although the breakup was over the NIPR LPM magne-\ntometers (around 01:00 MLT, Fig. 10a), the breakup did not\nexpand duskwards to encompass the BAS LPM magnetome-\nters until 01:26:03 UT (Fig. 10f). An auroral streamer was\nevident dawnward of the Cluster 4 footpoint in the images\nbetween 01:21–01:27 UT (Fig. 10d–f), highlighted by white\ncircle), giving it a lifetime of 6-10 min, based on the cadence\nof the FUV-WIC instrument.\nPresented in Fig. 11 is a time series of auroral luminos-\nity above 3 kR from FUV-WIC taken between magnetic lati-\ntudes of −67◦ and −68◦ and between 22:00 and 02:00 MLT\nfrom 01:19 to 01:27 UT. The luminosity in each image has\nbeen normalised to the maximum luminosity along the trace,\nsuch that the maximum data value is 1. The auroral streamer\nthat was detected at 01:21 UT is evident as a peak in the\n00:00–01:00 MLT range between 01:21 and 01:26 UT, indi-\ncated by the arrows on Fig. 11. Successive traces show that\nthis peak moves westwards with a velocity of ∼3 km s−1.\nAmm et al. (1999) and Sergeev et al. (2004) showed that\nthe bright, duskward edge of an auroral streamer is associ-\nated with a large, upward current whereas the trailing diffuse\naurora is associated with a smaller downward current. Al-\nthough the peak of the streamer is evident in Fig. 11, the\nedge of the diffuse aurora is not well defined. As such, we\ncannot estimate the width of the streamer, and therefore the\nwidth of the BBF, solely from the auroral data.\n3.3 Ground-based magnetometer observations\nFigure 12 shows stacked plots of the northward mag-\nnetic field component, averaged over 20 s, detected by the\nDMI west coast magnetometer chain between 00:00 and\n03:00 UT. A substorm expansion phase onset, indicated\nby a sharp negative bay, was seen at 01:15 UT at Narsar-\nsuaq (NAQ), propagating up to 14◦ northwards to (UPN) by\n01:30 UT. This substorm expansion phase onset was pre-\nceded by an earlier onset at 00:40 UT that was seen at NAQ\nand FHB. Filtering the NAQ data using a 4 min high pass\nfilter (Fig. 12 lower panel) shows that the negative bay in-\ndicating the substorm expansion phase onset was accompa-\nnied by a significant increase in Pi2 band noise. Similarly,\nFig. 13 shows stacked plots of the northward magnetic field\ncomponent detected by the BAS LPM chain, which is ap-\nproximately magnetically conjugate to the Greenland mag-\nnetometer chain, between 00:00 and 03:00 UT. The substorm\nexpansion phase onset was indicated by the negative bay at\n01:25 UT, 10 min after the onset detected in the Greenland\nmagnetometers but in conjunction with the movement of the\nauroral breakup over the magnetometers (Fig. 10f). This neg-\native bay was first observed, although comparatively weakly,\nat M81-388, and propagated up to 7◦ polewards, reaching\nM87-028 at 01:35 UT. It should be noted that the BAS LPM\ndata is subject to timing uncertainties of between 58 (at M81-\n338) and 2170 s (at M79-336), with an average uncertainty\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 177\n20 nT\n-20 nT\nFig. 12. Stacked plots of the northward (H) component of the magnetic field from the west coast\nmagnetometer chain of the DMI Greenland magnetometer network. The dotted horizontal lines\nrepresent the baseline (0 nT) for each station. The stations are plotted in descending latitudinal\norder and the stations corrected geomagnetic latitudes are shown on the right hand side of the plot.\nEach plot baseline is separated by 250 nT.The vertical dotted lines indicate hours. The lower panel\nshows the northward (H) component of the magnetic field from NAQ filtered using a 4 min high\npass filter.\n45\nFig. 12. Stacked plots of the orthward (H) component of the mag-\nn tic field from the west coast magnetom ter chain of the DMI\nGreenland magnetometer network. The d tted orizontal lines rep-\nresent the baseline (0 nT) for each station. The stations are plotted\nin descending latitudinal order and the stations corrected geomag-\nnetic latitudes are shown on the right hand side of the plot. Each\nplot baseline is separated by 250 nT. The vertical dotted lines indi-\ncate hours. The lower panel shows the northward (H) component of\nthe magnetic field from NAQ filtered using a 4 min high pass filter.\n(discounting M79-336) of∼180 s, caused by instrumental ef-\nfects.\nFigure 14 shows stacked plots of the (a) eastward, and (b)\nvertically downward magnetic field components detected by\nthe NIPR LPM chain between 01:15 UT and 01:35 UT. The\nvertical dashed line represents the time at which FUV-WIC\nobserved the auroral streamer over the NIPR LPM chain. The\neastward component (Fig. 14a) shows a “sawtooth-like” sig-\nnature accompanied by a minimum in the vertically down-\nward (Fig. 14b) component, considered to be a characteristic\nsignature of the streamer (Amm et al., 1999), at the time of\nthe passage of the streamer. This indicates the passage of a\nweaker east-west current system, in which the current direc-\ntion changed in the vertical direction during the passage of\nthe structure. However, it should be noted that although the\nsignature is observed at the three stations, timing uncertain-\nties in the data of the order of 100 s for both M70-039 and\nM68-041 mean that the data cannot be used to determine the\nmotion, if any, of the magnetic structure. The timing uncer-\ntainties in the data from M69-041 were <1 s.\n00\n00\n00\n30\n01\n00\n01\n30\n02\n00\n02\n30\n03\n00\nCGM\n  lat.\n-77.64\n-75.45\n-73.31\n-72.09\n-71.12\n-69.14\n-68.61\n-68.51\n-66.32\n-65.20\n-63.49\n  Station\n   code\nM85-096\nM87-068\nM87-028\nM88-316\nM85-002\nM84-336\nM82-003\nM83-348\nM81-338\nM79-336\nM78-337\n5\n0\n0\n n\nT\n b\ne\ntw\ne\ne\nn\n b\na\ns\ne\n l\nin\ne\ns\nLPM Stackplot, H\nFig. 13. Stacked plots of the northward (H) component of the magnetic field detected by the BAS\nLPM chain. The data has been filtered using a 4 min high pass filter. The dotted horizontal lines\nrepresent the baseline (0 nT) for each station. The stations are plotted in ascending latitudinal order\nand the stations corrected geomagnetic latitudes are shown on the right hand side of the plot. Each\nplot baseline is separated by 500 nT. The vertical dotted lines indicate hours.\n46\nFig. 13. Stacked plots of the northward (H) component of the mag-\nnetic field detected by the BAS LPM chain. The dotted horizontal\nlines represent the baseline (0 nT) for each station. Th stations are\nlotted in ascen ing latitudinal or er and the stations corrected ge-\nomagnetic latitudes are shown on the right hand side of the plot.\nEach plot baseline is separated by 500 nT. The vertical dotted lines\nindicate hours.\n4 Discussion\nPrevious studies of the ionospheric current systems associ-\nated with the passage of auroral streamers or BBFs have in-\nvestigated the currents during various phases of substorm\nactivity. Amm et al. (1999) investigated the current sys-\ntems associated with an auroral streamer detected 14 min af-\nter an auroral breakup and found currents of ∼25 A km−2.\nGrocott et al. (2004), Sergeev et al. (2004), and Naka-\nmura et al. (2005) investigated the current systems associ-\nated with BBFs during fairly quiet periods (potentially sub-\nstorm growth phases) and found currents ranging from 0.2 to\n7 A km−2. The range of these current values (two orders of\nmagnitude) suggests that substorm phase is important to the\ncurrents associated with a BBF.\nIn this study, the substorm expansion phase onset pre-\nceded the BBF observations. Southern Hemisphere auro-\nral data (Fig. 10), Northern Hemisphere magnetometer data\n(Fig. 12), and Cluster FGM data (Fig. 3) show that the\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n178 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\n0115 0120 0125 0130 0135\n015 012 0125 013 0135\n01\n15\n01\n25\n01\n35\nM70-039\nM69-041\nM68-041\n2\n0\n0\n n\nT\n b\net\nw\nee\nn\n b\na\nse\n l\nin\nes\nD\n c\nom\np\non\nen\nt\nZ\n c\nom\np\non\nen\nt\nM70-039\nM69-041\nM68-041\n-69.67\n-69.29\n-68.57\n-69.67\n-69.29\n-68.57\nCGM\n  lat.\nStation\n  Code\n(a)\n(b)\nFig. 14. Stacked plots of the (a) eastward (D) and (b) vertically downward (Z) components of the\nmagnetic field detected by the NIPR LPM chain. The dotted horizontal lines represent the baseline\n(0 nT) for each station. The stations are plotted in ascending latitudinal order and the stations\ncorrected geomagnetic latitudes are shown on the right hand side of the plot. Each plot baseline is\nseparated by 200 nT. The vertical dashed line indicates when the auroral streamer was above the\nmagnetometer stations, as determined by the FUV-WIC data.\n47\nFig. 14. Stacked plots of the (a) eastward (D) and (b) vertically\ndownward (Z) components of the magnetic field detected by the\nNIPR LPM chain. The dotted horizontal lines represent the base-\nline (0 nT) for each station. The st ions ar plotted in ascending\nlatitudinal order and th stations corrected geomagnetic latitudes\nare shown on the right hand side of the plot. Each plot baseline is\nseparated by 200 nT. The vertical dashed line indicates when the au-\nroral streamer was above the magnetometer stations, as determined\nby the FUV-WIC data.\nsubstorm expansion phase onset occurred around 01:15 UT,\nindicated by an auroral breakup, the formation of an east-\nwest current system accompanied by Pi2 band noise, and\na large drop in the tail magnetic field. However, Southern\nHemisphere magnetometer data from the BAS LPM chain\nindicates that an electrojet didn’t form in the Southern Hemi-\nsphere until 01:25 UT. The timing discrepancy between the\nGreenland and BAS magnetometers is explained by estimat-\ning the position of the auroral breakup region in the North-\nern Hemisphere. Østgaard et al. (2004) empirically showed\nthat the offset in location of auroral activity between hemi-\nspheres is related to the solar wind conditions. Using their\nresults, we estimate that the Greenland magnetometers were\nnear the centre of the breakup region, whereas Fig. 10f shows\nthe auroral breakup region was not over the BAS chain un-\ntil 01:26 UT. We note that the timing discrepancy between\nthe formation of the electrojets in the northern and southern\nhemispheres (∼600 s) is much larger than the timing error in\nthe BAS LPM data (∼180 s).\nAs discussed previously, the magnetic field magnitude\ndata from Cluster indicates that the BBF encountered con-\nsisted of two flow bursts or “bubbles” as described in the\nmodel of Chen and Wolf (1993). During the BBF encounter,\nthe BX component of the magnetic field remained negative,\nalthough the gradient of the BY component of the field varied\nfrom negative to positive twice during the encounter. From\nSergeev et al. (1996), this indicates that the spacecraft twice\nX\nY\nJFAC\nEarth\nFig. 15. Diagram illustrating the relative motion of the Cluster\nspacecraft across the BBF, looking down on the BBF in the X-\nY (GSM coordinates) plane from the current sheet (i.e. into the\nsouthern magnetosphere). The BBF consists of two flow bursts.\nField-aligned currents associated with the BBF are shown as yellow\n(Earthward) and grey (tailward) arrows. In both flow burst encoun-\nters, the Cluster spacecraft entered the flow burst on the duskward\nside, close to the nose of the flow, then traversed through to the\ndawnwards side of the flow burst. The graph indicates the field-\naligned currents detected by the spacecraft during their encounter\nwith the each flow burst.\nencountered the duskward then dawnward edge of an under-\npopulated flux tube bundle. This is confirmed by both the\nMVAB analysis and four-spacecraft timing for the first flux\ntube bundle, showing that the orientation of the boundaries\nof the flux tube bundle was towards dusk and then dawn\n(Fig. 5). MVAB and four-spacecraft timing analysis indi-\ncates that as the Cluster spacecraft exited from the second\nflux tube through a boundary that was orientated towards\ndusk as opposed to dawn; however, the boundary motion was\nstill Earthwards. We consider that in this case, the space-\ncraft exited the flow tailwards of the widest point, such that\nthe boundary of the flow was tapering back towards the flow\ncentre (see Chen and Wolf, 1993, Fig. 5). The motion of the\nfield lines, as indicated by the ion velocity perpendicular to\nthe field, was duskwards of the orientation of the boundary.\nSince the currents and magnetic field shear both suggest that\nCluster passed through the flow bursts from the dusk side\nto the dawn side, this would indicate that the direction of\ntravel of the BBF is not along its length. Figure 15 illus-\ntrates the relative motion of the Cluster spacecraft across the\nBBF in the X-Y plane south of the centre of the plasma sheet.\nThe yellow arrow represents Earthward field-aligned currents\nwhereas the grey arrow represents tailward field-aligned cur-\nrents. Beneath the illustration is the expected form of the\nfield-aligned currents detected by Cluster during its passage\nthrough the BBF, with positive field-aligned currents indicat-\ning tailward currents. This is consistent with the lateral cur-\nrent variation in the field aligned currents expected from the\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 179\nmodel of Chen and Wolf (1993) as shown by Sergeev et al.\n(1996). We note that the various analysis methods used show\nthat the flow bursts had significant velocity in the Z direction\nand that the orientation of the normals to flow boundaries\nwere consistently towards the middle of the plasma sheet.\nThis is consistent with highly stretched magnetic flux tubes\nconvecting and contracting through the plasma sheet.\nData from the NIPR LPM chain showed magnetic signa-\ntures of auroral streamers, similar to, but weaker than, those\nreported by Amm et al. (1999). The observations of these\nsignatures were centred at 01:24 UT and with a duration of\n∼6–8 min. The magnetic field detected by these magnetome-\nters before and during the substorm was highly variable, al-\nthough by comparing the magnetometer and auroral data the\nmagnetic signatures seen around 01:24 UT can be attributed\nto the BBF. Using the Tsyganenko T96 model and the veloc-\nity of the streamer determined from the auroral data this gives\nthe BBF a width of ∼3–4RE . This agrees with the expected\ndawn-dusk spatial size of a BBF of 3–5RE (Angelopoulos\net al., 1997; Kauristie et al., 2000; Nakamura et al., 2001b).\nIntegrating the ion velocity perpendicular to the field from\nCluster 4 during the BBF encounter, and considering that\nCluster is essentially stationary during that period (veloc-\nity of the order of 1 km s−1 since the spacecraft were near\napogee), gives the size of the BBF as 2.3RE .\nThe event studied by Amm et al. (1999) had background\nconditions most similar to the event presented here (multiple\nsubstorms and streamer detected after an auroral breakup)\nand, correspondingly, showed very similar field-aligned\nionospheric currents (25 A km−2 compared with 18 A km−2\ndetected in our event). The ground magnetic field data pre-\nsented by Amm et al. (1999) shows a far stronger eastward\ncomponent signature associated with the passage of the au-\nroral streamer for a comparatively small change in current.\nThe event studied by Grocott et al. (2004) occurred\nduring a relatively quiet time, with no apparent substorm\nactivity and was associated with ionospheric currents of\n∼0.2 A km−2. The authors compared their ionospheric data\nwith data from FUV-WIC and found that their current sys-\ntem coincided with an auroral enhancement which had a\nbrightness approximately an order of magnitude lower than\nthe brightness of the streamer presented here. Cowley and\nBunce (2001) showed that, based on the theory of Knight\n(1973) and Lundin and Sandahl (1978), the energy flux into\nthe ionosphere due to field-aligned currents driven by a field-\nparallel voltage, such as those that cause the aurora, is related\nto the square of the field-aligned current. Assuming that, at\nthe energies involved in the currents under discussion, the\nauroral luminosity is directly related to the energy flux of the\nelectrons, we therefore find that the results of Grocott et al.\n(2004) are qualitatively consistent with the results presented\nhere.\nThe field reversals in the BX and BZ directions suggests\nthat after the passage of the BBF, Cluster crossed a current\nsheet. This is in agreement with the currents determined\nby the curlometer method (Fig. 6), which shows strong cur-\nrents detected in the X-Y plane. Comparison of the mag-\nnetic fields across the four Cluster spacecraft shows that the\nmagnetic signature was “nested” such that the current sheet\nmoved across the spacecraft then returned, or that the space-\ncraft encountered a convecting feature into which they pen-\netrated to differing depths. The magnetic field components\nduring the encounter with this current sheet were not suffi-\nciently ordered to allow for meaningful determination of the\ndirection of the motion of the current sheet. Sergeev et al.\n(1996) showed that the model of Chen and Wolf (1993) pre-\ndicted that flux tubes in front of a plasma bubble would be\ndisplaced by its passage. Sergeev et al. (1996) considered\nthe case of a bubble where the normal to the edge of the bub-\nble was in the X-Y plane to demonstrate that there would\nbe a front-side shear. It is, therefore, conceivable that if the\nbubble was tilted about the X-axis, such that the normal to\nits edge on the duskward and dawnward flanks had some Z\ncomponent, that plasma would be displaced in the Z direc-\ntion also. After the bubble’s passage, the displaced plasma\nwould recoil back towards its original position since the bub-\nble causes no persistent dipolarisation of the field, as shown\nby Lyons et al. (1999). If the current sheet is displaced by\nthis travelling feature and recoils after its passage, the current\nsheet may overshoot its former position. This could explain\nwhy Cluster briefly detects the current sheet.\nThe origins of BBFs are not yet understood, although they\nhave often been associated with reconnection processes (e.g.\nChen and Wolf, 1993; Birn et al., 1999; Sitnov et al., 2005).\nBased on the simple model of plasma sheet acceleration, as\ndiscussed in Cowley (1984), we consider methods of BBF\ncreation by reconnection. We assume the magnetosphere is\nunder-going Dungey Cycle convection (Dungey, 1961) such\nthat there is a reconnection X-line in the far tail. We also as-\nsume that substorm expansion phase conditions are created\nby the reconnection of open magnetic flux in the tail by a\nnear-Earth neutral line (NENL) reconnection X-line (Baker\net al., 1996, and references therein). In this simple model,\nthe rate of reconnection (EY ), the BZ component of the mag-\nnetic field across the current sheet and the velocity of the re-\nconnected field lines (de Hoffmann-Teller velocity, VHT , de\nHoffmann and Teller (1950)) are related by\nEY = BZ.VHT (1)\nwhere, for stress balance, VHT is equal to the Alfve´n speed of\nthe lobe plasma at the reconnection site less the speed of the\nlobe plasma at the reconnection site. Plasma flows into the\nreconnection site at theE×B velocity from both the northern\nand southern lobes and flows out at the velocity of the Earth-\nward (VBE) and tailward (VBT ) beams, found by coordinate\ntransformation to be\nVBE = 2VA − VL ≡ VHT + VA (2)\nwhere VA is the Alfve´n speed of the lobe plasma and VL is\nthe lobe plasma speed. If we consider that a BBF shows an\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n180 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\nn\nL`\nX\nGSM\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nD\nDS\nS\nSB\nB\n(g)\nB\nFig. 16. A series of diagrams depicting the generation of a BBF by open field line reconnection.\nThe colours represent field lines with different ion densities. Tailward pointing arrows indicate the\nmotion of the X-lines and Earthward pointing arrows indicate the motion of the reconnected field\nlines. Panel (a) shows a simple variation the variation of the plasma density in the lobes based\non Cowley (1984). Initially the plasma sheet is thin and being populated by the Dungey cycle\nreconnection X-line (panel (a)), with Cluster (represented by the triangle) in the lobe. A substorm\nX-line forms Earthwards of the Dungey cycle X-line and reconnects through the closed field lines,\nforming a plasmoid between itself and the Dungey cycle X-line. When the substorm X-line begins\nto reconnect lobe field lines, the plasmoid is disconnected from the Earth and the plasmoid and\nsubstorm X-line retreat tailward. The plasma sheet then expands and the Cluster spacecraft are\nengulfed by the PSBL populated by the substorm X-line (panel (c)). As the substorm X-line retreats\nfurther downtail and the plasma sheet continues to expand, the Cluster spacecraft are engulfed by\nthe central plasma sheet (panel (d)). A new X-line, localised in the Y direction) forms Earthward\nof the substorm X-line. This reconnects through the closed field lines, creating a plasmoid between\nitself and the substorm X-line, and begins to reconnect lobe field lines. This injects lower density\nlobe plasma into the plasma sheet and creates a BBF (yellow) (panel (e)). The injected plasma then\nconvects through the plasma sheet as a BBF (panels (f) and (g))\n49\nFig. 16. A series of diagrams depicting the generation of a BBF by\nopen field line reconnection. The colours represent field lines with\ndifferent io densities. Tailward poi ting arrows indicate the motio\nof the X-lines and Earthward poin ng arrows indicate the motion of\nthe reco nect d field li es. Panel (a) shows a simple variation of the\nplasma de si y in the lobes based on Cowley (1984). Initially the\nplasma sheet is thin and being populated by the Du gey cycle rec n-\nnection X-line (panel b), with Cluster (represented by the triangle)\nin the lobe. A substorm X-line forms Earthwards of the Dungey\ncycle X-line and reconnects through the closed field lines, forming\na plasmoid between itself and the Dungey cycle X-line. When the\nsubstorm X-line begins to reconnect lobe field lines, the plasmoid\nis disconnected from the Earth and the plasmoid and substorm X-\nline retreat tailward. The plasma sheet then expands and the Clus-\nter spacecraft are engulfed by the PSBL populated by the substorm\nX-line (panel c). As the substorm X-line retreats further downtail\nand the plasma sheet continues to expand, the Cluster spacecraft are\nengulfed by the central plasma sheet (panel d). A new X-line, lo-\ncalised in the Y direction, forms Earthward of the substorm X-line.\nThis reconnects through the closed field lines, creating a plasmoid\nbetween itself and the substorm X-line, and begins to reconnect lobe\nfield lines. This injects lower density lobe plasma into the plasma\nsheet and creates a BBF (yellow) (panel e). The injected plasma\nthen convects through the plasma sheet as a BBF (panels f and g).\nincreased ion velocity and BZ component then it is appar-\nent, from Eqs. (1) and (2), that the creation of BBFs requires\nan increased rate of reconnection (assuming VA is fixed for\na given location in the lobe under the timescales being con-\nsidered). BBFs can show a decreased plasma density (e.g.\nLyons et al., 1999; Nakamura et al., 2005), as in the case\npresented here. From the model of Cowley (1984), it can\nbe shown that plasma density on the newly reconnected field\nlines is equal to the density in the lobe source region. As\nsuch, in order to create a low density fast flow, the den-\nsity of the lobe plasma at the source of the flow must be\nlower than that of the surrounding compressed central plasma\nsheet. One possibility is that density perturbations within the\nlobe plasma are coupled with an increased rate of reconnec-\ntion at the tail X-line, although the mechanisms for creating\nthe density perturbations in the lobes that would necessarily\nalso cause an increase in the reconnection rate upon the field-\nline reaching the plasma sheet are unclear. Another possibil-\nity is that a burst of reconnection occurs closer to the Earth\nthan the global X-line or alternatively, a part of the X-line,\nlocalised in the Y direction, moves Earthward. Since lobe\nplasma density increases with increasing tailward distance,\nthe site of the bursty reconnection would create a low den-\nsity injection into the plasma sheet if the X-line reconnects\nthrough to the open field-lines of the lobe. The reconnected\nfield-lines associated with the low density injection, i.e. the\nBBF, will necessarily have a higher de Hoffmann-Teller ve-\nlocity than those reconnected at the substorm X-line since,\nas noted above, the de Hoffmann-Teller velocity is equal to\nthe Alfve´n speed of the lobe plasma being reconnected and\nAlfve´n velocity is inversely proportional to the plasma den-\nsity. As such, the BBF will convect through the plasma sheet.\nWhat is unclear, from the data presented, is the evolution of\nthe BBF X-line. CIS instrument data shows that the ion den-\nsity and velocity returns to pre-BBF values over ∼1.5 min\nafter the velocity in the X direction reaches its maximum.\nHowever, analysis of the flow boundaries indicates that Clus-\nter does not pass along the whole length of the flow, rather it\nexits through the side, such that Cluster does not observe the\nfull evolution of the flow.\nFigure 16 shows a series of diagrams depicting the pro-\nposed evolution of the plasma sheet during this event. For\nreference, Fig. 16a shows a model of the variation of the lobe\ndensity with distance downtail based on Cowley (1984). Ini-\ntially, the plasma sheet is thin and being populated by the\nDungey cycle X-line (Fig. 16b). Cluster is in lobe plasma in\nthe Southern Hemisphere. At some (undetermined) time, a\nnew X-line formed Earthwards of the Dungey cycle X-line.\nThis X-line reconnects the closed field lines of the plasma\nsheet and then begins to reconnect the open field lines of the\nlobe. This is the substorm expansion phase onset, leading to\nthe expansion phase signatures noted above. After this onset,\nthe plasma sheet expands so as to engulf Cluster (Fig. 16c).\nAt some time (also undetermined), a third X-line forms in the\ncentral plasma sheet, Earthward of the substorm X-line. The\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 181\nrate of reconnection at this new X-line is higher than that of\nthe substorm X-line, such that the X-line reconnects through\nthe closed field lines and eventually reconnects the open field\nlines of the lobes. This X-line injects plasma from the lobes\nEarthwards of the substorm line (Fig. 16e), such that the ion\ndensity on these field lines is lower than the surrounding field\nlines. Since the Alfve´n speed of the plasma is inversely re-\nlated to the plasma density, the speed of the field lines away\nfrom the reconnection site is higher, hence the field lines con-\nvect through the plasma sheet as a BBF. As noted above, the\ndata presented are insufficient to determine the full evolution\nof the new X-line. For illustrative purposes, we show the\nBBF as a convecting bundle of flux that is no longer being\nfed by the X-line that created it (Fig. 16f and g), with the X-\nline retreating downtail in a manner similar to the substorm\nrecovery phase (e.g. Hones, 1984).\nThe above model considers the origins of a BBF to be re-\nconnection of open field lines. This agrees with the work of\nLyons et al. (1999) and Grocott et al. (2004) who associated\nBBFs with pseudo-breakups, which are often considered to\nbe the localised closure of open flux. If we consider sub-\nstorm reconnection to take place at a single X-line, as in the\nNENL and current disruption models, and the creation of a\nBBF to occur Earthwards of that line then such a burst of\nreconnection would create a flux rope Earthwards of the sub-\nstorm reconnection site as shown in Fig. 16e. The substorm\nX-line creates a flux rope between itself and the downtail\n(Dungey cycle) X-line, hence there would be two flux ropes\nin the tail. It has been suggested that the passage of multi-\nple flux ropes is a signature of multiple X-line reconnection\n(e.g. Slavin et al., 2005), hence the detection of BBFs during\nsubstorms could also be considered to be a signature of mul-\ntiple X-lines. Alternatively, the generation of a BBF could\nbe considered to show that substorm reconnection does not\noccur on one “global” X-line, but on a series of X-lines sep-\narated in the Y direction, such as has been suggested for flux\ntransfer events at the dayside magnetopause. A BBF could\nbe generated by an X-line markedly Earthwards of the av-\nerage position of the substorm X-lines. The model is also\napplicable to “quiet” time observations of BBFs. It is gen-\nerally accepted that Dungey Cycle reconnection in the tail\nis ongoing. As such, any reconnection Earthwards of the\nDungey Cycle X-line would inject low density plasma into\nthe plasma sheet. A recent study by Grocott et al. (2007) has\nprovided evidence of localised tail reconnection during quiet\ntimes, termed by the authors as tail reconnection during IMF\nnorthward non-substorm intervals, or TRINNI, and the de-\ntection of an associated BBF, hence reconnection is a viable\nmethod by which to inject BBFs into the plasma sheet dur-\ning both quiet and disturbed times. It should be noted that\nthis model does not consider the evolution of the motion of\nthe BBF through the substorm populated plasma sheet and is\ncomplementary to the model of Chen and Wolf (1993), who\nonly considered the time evolution of a plasma bubble after\nits generation and not the generation mechanism itself.\nParticle data from the CIS and PEACE instruments dur-\ning the BBF are consistent with the above reconnection\nmodel. During reconnection, both ions and electrons are en-\nergised in the field-aligned direction. The velocity of the\nelectrons away from the reconnection is greater than that\nof the ions, hence electrons will mirror in the inner mag-\nnetosphere and return along the field lines before the ions\nsuch that bidirectional electron beams form before bidirec-\ntional ion beams. During this event, bidirectional ion and\nelectron beams are observed by Cluster when it passes into\nthe PSBL at 01:15 UT (Fig. 7a and b and Fig. 9). During\nthe encounter with the BBF at 01:24 UT, Cluster observed a\nbidirectional electron and ion beams, although the Earthward\nion beam had a greater differential number flux than the tail-\nward beam (Figs. 7c and 9), suggesting that the spacecraft\nwere sufficiently close to the reconnection site that the ma-\njority of the ion population had insufficient time to mirror\nin the inner magnetosphere and return to the spacecraft po-\nsition, such that the BBF consisted of recently reconnected\nfield lines. Cluster detected a dispersed ion energy signature\nwhen the spacecraft crossed the PSBL (Fig. 8a), indicating\nthat the PSBL was the result of reconnection. During the\nBBF encounter, the ions were energised to a level similar to\nthat in the PSBL, although there was no apparent energy dis-\npersion. Given that estimates of the width of the BBF from\nground-based data and from integrating the ion velocity per-\npendicular to the magnetic field during the BBF encounter\nare ∼3RE and BBFs are considered to be long and narrow\n(Sergeev et al., 2000; Amm and Kauristie, 2002), and that\nthe spacecraft crossed the width of the BBF, it is conceiv-\nable that the spacecraft did not travel far enough along the\nBBF to detect any energy dispersion. The similarity between\nthe ion density during the passage of the BBF and the earlier\nPSBL crossing (Fig. 3a) suggests that the BBF reconnection\nsite was close to the location of the substorm X-line location\nwhen Cluster was engulfed by the PSBL.\n5 Conclusions\nOn 25 August 2003, the Cluster spacecraft detected a sub-\nstorm expansion phase at 01:15 UT, indicated by a drop in\nthe total magnetic field. At 01:24 UT, during the substorm\nexpansion phase, the Cluster spacecraft encountered a bursty\nbulk flow consisting of two under-populated flux tube bun-\ndles travelling Earthward and duskward at ∼500 km s−1.\nAt the same time, an auroral streamer was seen in FUV-\nWIC data of the Southern Hemisphere close to the foot-\npoint of the Cluster spacecraft. Field-aligned currents of\n∼5×10−3 A km−2 flowing in the BBF were measured us-\ning the curlometer technique. These currents were initially\nEarthward and then became tailward for each flux tube bun-\ndle. Four-spacecraft timing analysis and MVAB, combined\nwith the magnetic field shears, at the flux tube bundle bound-\naries showed that Cluster entered the flux tube bundles on\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n182 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\nthe duskward and exited on the dawnward side. The pro-\njected ionospheric field-aligned currents were found to be\n∼18 A km−2, comparable to the measured ionospheric cur-\nrents associated with an auroral streamer as reported by\nAmm et al. (1999), who also obtained their readings during\na period of multiple substorms and after an auroral breakup.\nThe detection of currents that, when projected into the iono-\nsphere, are comparable with the currents detected in associ-\nation with auroral streamers lends support to the argument\nthat auroral streamers can be considered the auroral manifes-\ntation of BBFs.\nThe results presented are consistent with a model of the re-\nconnection of open field-lines Earthward of the substorm re-\nconnection region for BBF generation based upon the plasma\nsheet acceleration model of Cowley (1984). The pitch an-\ngle distribution of the ions from the CIS instrument on Clus-\nter 4 showed that during the passage of the BBF the ions\nwere approximately field-aligned in an Earthwards direction,\nwhereas the electrons showed bi-directional beams, indicat-\ning that Cluster encountered recently reconnected field lines.\nThe elevated BZ component indicates that the reconnection\nevent that generated the BBF had a greater rate of reconnec-\ntion than the source of the plasma sheet detected around the\nflow. Since the lobe plasma density increases with distance\nfrom the Earth, reconnection of open (lobe) field lines closer\nto the Earth than the substorm X-line would inject lower den-\nsity plasma into the plasma sheet. This is also consistent\nwith the notion that pseudo-breakups are BBFs outside of\nsubstorm times.\nAcknowledgements. The authors wish to thank CDAWeb for pro-\nviding the IMAGE FUV-WIC data; ESA Cluster Active Archive for\nproviding the full resolution FGM data; M. P. Freeman, M. Rose\nand others at the British Antarctic Survey for providing the low\npower magnetometer data. Thanks go to the operations teams of\nthe various instruments used in this study. Analysis of the Cluster\nFGM data and CIS moments was done with the QSAS science anal-\nysis system provided by the United Kingdom Cluster Science Cen-\ntre (Imperial College London and Queen Mary, University of Lon-\ndon) supported by PPARC. M. Lester, R. C. Fear, A. Grocott, and\nS. E. Milan were supported by PPARC grant PPA\/G\/O\/2003\/00013\nand STFC grant PP\/E000983. During this study C. Forsyth\nwas supported by STFC studentship PPA\/S\/S\/2005\/04156, while\nS. W. H. Cowley was supported by a Royal Society Leverhulme\nTrust Senior Research Fellowship.\nTopical Editor I. A. Daglis thanks O. Amm and another anony-\nmous referee for their help in evaluating this paper.\nReferences\nAmm, O.: Direct determination of the local ionospheric Hall con-\nductance distribution from two-dimensional electric and mag-\nnetic field data: Application of the method using models of typi-\ncal ionospheric electrodynamic situations, J. Geophys. Res., 100,\n21 473–21 488, doi:10.1029\/95JA02213, 1995.\nAmm, O.: Method of characteristics in spherical geometry applied\nto a Harang-discontinuity situation, Ann. Geophys., 16, 413–\n424, 1998,\nhttp:\/\/www.ann-geophys.net\/16\/413\/1998\/.\nAmm, O. and Kauristie, K.: Ionospheric signatures of bursty bulk\nflows, Surv. Geophy., 23, 1–32, 2002.\nAmm, O. and Viljanen, A.: Ionospheric disturbance magnetic field\ncontinuation from the ground to the ionosphere using spherical\nelementary current systems, Earth, Planets, and Space, 51, 431–\n440, 1999.\nAmm, O., Pajunpa¨a¨, A., and Brandstro¨m, U.: Spatial distribution\nof conductances and currents associated with a north-south auro-\nral form during a multiple-substorm period, Ann. Geophys., 17,\n1385–1396, 1999,\nhttp:\/\/www.ann-geophys.net\/17\/1385\/1999\/.\nAngelopoulos, V., Baumjohann, W., Kennel, C. F., Coronti, F. V.,\nKivelson, M. G., Pellat, R., Walker, R. J., Luehr, H., and\nPaschmann, G.: Bursty bulk flows in the inner central plasma\nsheet, J. Geophys. Res., 97, 4027–4039, 1992.\nAngelopoulos, V., Kennel, C. F., Coroniti, F. V., Pellat, R., Kivel-\nson, M. G., Walker, R. J., Russell, C. T., Baumjohann, W., Feld-\nman, W. C., and Gosling, J. T.: Statistical characteristics of\nbursty bulk flow events, J. Geophys. Res., 99, 21 257–21 280,\n1994.\nAngelopoulos, V., Phan, T. D., Larson, D. E., Mozer, F. S., Lin,\nR. P., Tsuruda, K., Hayakawa, H., Mukai, T., Kokubun, S., Ya-\nmamoto, T., Williams, D. J., McEntire, R. W., Lepping, R. P.,\nParks, G. K., Brittnacher, M., Germany, G., Spann, J., Singer,\nH. J., and Yumoto, K.: Magnetotail flow bursts: association to\nglobal magnetospheric circulation, relationship to ionospheric\nactivity and direct evidence for localization, Geophys. Res. Lett.,\n24, 2271–2274, doi:10.1029\/97GL02355, 1997.\nBaker, D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W.,\nand McPherron, R. L.: Neutral line model of substorms: Past\nresults and present view, J. Geophys. Res., 101, 12 975–13 010,\ndoi:10.1029\/95JA03753, 1996.\nBaker, K. B. and Wing, S.: A new magnetic coordinate system for\nconjugate studies at high latitudes, J. Geophys. Res., 94, 9139–\n9143, 1989.\nBalogh, A., Carr, C. M., Acun˜a, M. H., Dunlop, M. W., Beek, T. J.,\nBrown, P., Fornac¸on, K.-H., Georgescu, E., Glassmeier, K.-H.,\nHarris, J., Musmann, G., Oddy, T., and Schwingenschuh, K.:\nThe Cluster Magnetic Field Investigation: Overview of in-flight\nperformance and initial results, Ann. Geophys., 19, 1207–1217,\n2001,\nhttp:\/\/www.ann-geophys.net\/19\/1207\/2001\/.\nBirn, J. and Hesse, M.: Details of current disruption and diversion\nin simulations of magnetotail dynamics, J. Geophys. Res., 101,\n15 345–15 358, doi:10.1029\/96JA00887, 1996.\nBirn, J., Hesse, M., Haerendel, G., Baumjohann, W., and Shiokawa,\nK.: Flow braking and the substorm current wedge, J. Geophys.\nRes., 104, 19 895–19 904, doi:10.1029\/1999JA900173, 1999.\nBirn, J., Raeder, J., Wang, Y., Wolf, R., and Hesse, M.: On the\npropagation of bubbles in the geomagnetic tail, Ann. Geophys.,\n22, 1773–1786, 2004,\nhttp:\/\/www.ann-geophys.net\/22\/1773\/2004\/.\nCao, J. B., Ma, Y. D., Parks, G., Reme, H., Dandouras, I., Naka-\nmura, R., Zhang, T. L., Zong, Q., Lucek, E., Carr, C. M., Liu,\nZ. X., and Zhou, G. C.: Joint observations by Cluster satellites\nof bursty bulk flows in the magnetotail, J. Geophys. Res., 111,\nA04 206, doi:10.1029\/2005JA011322, 2006.\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\nC. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers 183\nChen, C. X. and Wolf, R. A.: Interpretation of high-speed flows in\nthe plasma sheet, J. Geophys. Res., 98, 21 409–21 419, 1993.\nCowley, S. W. H.: The Distant Geomagnetic Tail in Theory and\nObservation, in: Magnetic Reconnection in Space and Labora-\ntory Plasmas, edited by: Hones Jr., E. W., pp. 228–239, 1984.\nCowley, S. W. H. and Bunce, E. J.: Origin of the main auroral oval\nin Jupiter’s coupled magnetosphere-ionosphere system, Planet.\nSpace Sci., 49, 1067–1088, 2001.\nde Hoffmann, F. and Teller, E.: Magneto-Hydrodynamic Shocks,\nPhysical Review, 80, 692–703, doi:10.1103\/PhysRev.80.692,\n1950.\nDungey, J. W.: Interplanetary magnetic field and the auroral zones,\nPhys. Rev. Lett., 6, 47–48, doi:10.1103\/PhysRevLett.6.47, 1961.\nDunlop, M. W., Southwood, D. J., Glassmeier, K.-H., and\nNeubauer, F. M.: Analysis of multipoint magnetometer data,\nAdv. Space Res., 8, 273–277, doi:10.1016\/0273-1177(88)\n90141-X, 1988.\nGrocott, A., Yeoman, T., Nakamura, R., Cowley, S., Frey, H.,\nRe`me, H., and Klecker, B.: Multi-instrument observations of the\nionospheric counterpart of a bursty bulk flow in the near-Earth\nplasma sheet, Ann. Geophys., 22, 1061–1075, 2004,\nhttp:\/\/www.ann-geophys.net\/22\/1061\/2004\/.\nGrocott, A., Yeoman, T. K., Milan, S. E., Amm, O., Frey, H. U.,\nJuusola, L., Nakamura, R., Owen, C. J., Re`me, H., and Takada,\nT.: Multi-scale observations of magnetotail flux transport dur-\ning IMF-northward non-substorm intervals, Ann. Geophys., 25,\n1709–1720, 2007,\nhttp:\/\/www.ann-geophys.net\/25\/1709\/2007\/.\nGustafsson, G., Andre´, M., Carozzi, T., Eriksson, I. A., Fa¨lthammar,\nC.-G., Grard, R., Holmgren, G., Holtet, J. A., Ivchenko,\nN., Karlsson, T., Khotyaintsev, Y., Klimov, S., Laakso, H.,\nLindqvist, P.-A., Lybekk, B., Marklund, G., Mozer, F., Mur-\nsula, K., Pedersen, A., Popielawska, B., Savin, S., Stasiewicz,\nK., Tanskanen, P., Vaivads, A., and Wahlund, J.-E.: First results\nof electric field and density observations by Cluster EFW based\non initial months of operation, Ann. Geophys., 19, 1219–1240,\n2001,\nhttp:\/\/www.ann-geophys.net\/19\/1219\/2001\/.\nHarvey, C. C.: Spatial gradients and the volumetric tensor, in: Anal-\nysis Methods for Multi-Spacecraft Data, edited by: Paschmann,\nG. and Daly, P. W., pp. 307–348, ISSI, 1998.\nHenderson, M. G., Reeves, G. D., and Murphree, J. S.: Are north-\nsouth aligned auroral structures an ionospheric manifestation of\nbursty bulk flows?, Geophys. Res. Lett., 25, 3737–3740, doi:10.\n1029\/98GL02692, 1998.\nHones Jr., E. W.: Plasma sheet behavior during substorms, Wash-\nington D.C. American Geophysical Union Geophysical Mono-\ngraph Series, pp. 178–184, 1984.\nInhester, B., Untiedt, J., Segatz, M., and Kuerschner, M.: Direct\ndetermination of the local ionospheric hall conductance distri-\nbution from two-dimensional electric and magnetic field data, J.\nGeophys. Res., 97, 4073–4083, 1992.\nJohnstone, A. D., Alsop, C., Burge, S., Carter, P. J., Coates, A. J.,\nCoker, A. J., Fazakerley, A. N., Grande, M., Gowen, R. A., Gur-\ngiolo, C., Hancock, B. K., Narheim, B., Preece, A., Sheather,\nP. H., Winningham, J. D., and Woodliffe, R. D.: PEACE: a\nPlasma Electron And Current Experiment, Space Sci Rev., 79,\n351–398, 1997.\nKauristie, K., Sergeev, V. A., Kubyshkina, M., Pulkkinen, T. I., An-\ngelopoulos, V., Phan, T., Lin, R. P., and Slavin, J. A.: Ionospheric\ncurrent signatures of transient plasma sheet flows, J. Geophys.\nRes., 105, 10 677–10 690, doi:10.1029\/1999JA900487, 2000.\nKeiling, A., Parks, G. K., Re`me, H., Dandouras, I., Wilber, M.,\nKistler, L., Owen, C., Fazakerley, A. N., Lucek, E., Maksimovic,\nM., and Cornilleau-Wehrlin, N.: Energy-dispersed ions in the\nplasma sheet boundary layer and associated phenomena: Ion\nheating, electron acceleration, Alfve´n waves, broadband waves,\nperpendicular electric field spikes, and auroral emissions, Ann.\nGeophys., 24, 2685–2707, 2006,\nhttp:\/\/www.ann-geophys.net\/24\/2685\/2006\/.\nKhan, H. and Cowley, S. W. H.: Observations of the response time\nof high-latitude ionospheric convection to variations in the in-\nterplanetary magnetic field using EISCAT and IMP-8 data, Ann.\nGeophys., 17, 1306–1335, 1999,\nhttp:\/\/www.ann-geophys.net\/17\/1306\/1999\/.\nKnight, S.: Parallel electric fields, Planet. Space Sci., 21, 741–750,\ndoi:10.1016\/0032-0633(73)90093-7, 1973.\nKubyshkina, M. V., Sergeev, V. A., and Pulkkinen, T. I.:\nHybrid Input Algorithm: An event-oriented magnetospheric\nmodel, J. Geophys. Res., 104, 24 977–24 994, doi:10.1029\/\n1999JA900222, 1999.\nLester, M., Chapman, P., Cowley, S., Crooks, S., Davies, J.,\nHamadyk, P., McWilliams, K., Milan, S., Parsons, M., Payne,\nD., Thomas, E., Thornhill, J., Wade, N., Yeoman, T., and Barnes,\nR.: Stereo CUTLASS – A new capability for the SuperDARN\nHF radars, Ann. Geophys., 22, 459–473, 2004,\nhttp:\/\/www.ann-geophys.net\/22\/459\/2004\/.\nLundin, R. and Sandahl, I.: Some characteristics of the parallel elec-\ntric field acceleration of electrons over discrete auroral arcs as\nobserved from two rocket flights, Tech. rep., ESA, 1978.\nLyons, L. R., Nagai, T., Blanchard, G. T., Samson, J. C., Yamamoto,\nT., Mukai, T., Nishida, A., and Kokobun, S.: Association be-\ntween Geotail plasma flows and auroral poleward boundary in-\ntensifications observed by CANOPUS photometers, J. Geophys.\nRes., 104, 4485–4500, doi:10.1029\/1998JA900140, 1999.\nMcComas, D. J., Bame, S. J., Barker, P., Feldman, W. C., Phillips,\nJ. L., Riley, P., and Griffee, J. W.: Solar Wind Electron Pro-\nton Alpha Monitor (SWEPAM) for the Advanced Composi-\ntion Explorer, Space Sci. Rev., 86, 563–612, doi:10.1023\/A:\n1005040232597, 1998.\nMende, S. B., Heetderks, H., Frey, H. U., Lampton, M., Geller,\nS. P., Abiad, R., Siegmund, O. H. W., Tremsin, A. S., Spann, J.,\nDougani, H., Fuselier, S. A., Magoncelli, A. L., Bumala, M. B.,\nMurphree, S., and Trondsen, T.: Far ultraviolet imaging from the\nIMAGE spacecraft. 2. Wideband FUV imaging, Space Sci. Rev.,\n91, 271–285, 2000a.\nMende, S. B., Heetderks, H., Frey, H. U., Stock, J. M., Lampton,\nM., Geller, S. P., Abiad, R., Siegmund, O. H. W., Habraken, S.,\nRenotte, E., Jamar, C., Rochus, P., Gerard, J.-C., Sigler, R., and\nLauche, H.: Far ultraviolet imaging from the IMAGE spacecraft.\n3. Spectral imaging of Lyman-α and OI 135.6 nm, Space Sci.\nRev., 91, 287–318, 2000b.\nNakamura, R., Baumjohann, W., Brittnacher, M., Sergeev, V. A.,\nKubyshkina, M., Mukai, T., and Liou, K.: Flow bursts and auro-\nral activations: Onset timing and foot point location, J. Geophys.\nRes., 106, 10 777–10 790, doi:10.1029\/2000JA000249, 2001a.\nNakamura, R., Baumjohann, W., Scho¨del, R., Brittnacher, M.,\nSergeev, V. A., Kubyshkina, M., Mukai, T., and Liou, K.:\nwww.ann-geophys.net\/26\/167\/2008\/ Ann. Geophys., 26, 167–184, 2008\n184 C. Forsyth et al.: Current systems of bursty bulk flows and auroral streamers\nEarthward flow bursts, auroral streamers, and small expan-\nsions, J. Geophys. Res., 106, 10 791–10 802, doi:10.1029\/\n2000JA000306, 2001b.\nNakamura, R., Baumjohann, W., Mouikis, C., Kistler, L. M.,\nRunov, A., Volwerk, M., Asano, Y., Vo¨ro¨s, Z., Zhang, T. L.,\nKlecker, B., Re`me, H., and Balogh, A.: Spatial scale of high-\nspeed flows in the plasma sheet observed by Cluster, Geophys.\nRes. Lett., 31, L09 804, doi:10.1029\/2004GL019558, 2004.\nNakamura, R., Amm, O., Laakso, H., Draper, N. C., Lester, M.,\nGrocott, A., Klecker, B., McCrea, I. W., Balogh, A., Re`me, H.,\nand Andre´, M.: Localized fast flow disturbance observed in the\nplasma sheet and in the ionosphere, Ann. Geophys., 23, 553–\n566, 2005,\nhttp:\/\/www.ann-geophys.net\/23\/553\/2005\/.\nØstgaard, N., Mende, S. B., Frey, H. U., Immel, T. J., Frank, L. A.,\nSigwarth, J. B., and Stubbs, T. J.: Interplanetary magnetic field\ncontrol of the location of substorm onset and auroral features in\nthe conjugate hemispheres, J. Geophys. Res., 109, 7204–7215,\ndoi:10.1029\/2003JA010370, 2004.\nRaj, A., Phan, T., Lin, R. P., and Angelopoulos, V.: Wind survey\nof high-speed bulk flows and field-aligned beams in the near-\nEarth plasma sheet, J. Geophys. Res., 107, 3–1, doi:10.1029\/\n2001JA007547, 2002.\nRe`me, H., Aoustin, C., Bosqued, J. M., Dandouras, I., Lavraud, B.,\nSauvaud, J. A., Barthe, A., Bouyssou, J., Camus, T., Coeur-Joly,\nO., Cros, A., Cuvilo, J., Ducay, F., Garbarowitz, Y., Medale,\nJ. L., Penou, E., Perrier, H., Romefort, D., Rouzaud, J., Vallat, C.,\nAlcayde´, D., Jacquey, C., Mazelle, C., D’Uston, C., Mo¨bius, E.,\nKistler, L. M., Crocker, K., Granoff, M., Mouikis, C., Popecki,\nM., Vosbury, M., Klecker, B., Hovestadt, D., Kucharek, H.,\nKuenneth, E., Paschmann, G., Scholer, M., Sckopke, N., Sei-\ndenschwang, E., Carlson, C. W., Curtis, D. W., Ingraham, C.,\nLin, R. P., McFadden, J. P., Parks, G. K., Phan, T., Formisano,\nV., Amata, E., Bavassano-Cattaneo, M. B., Baldetti, P., Bruno,\nR., Chionchio, G., di Lellis, A., Marcucci, M. F., Pallocchia,\nG., Korth, A., Daly, P. W., Graeve, B., Rosenbauer, H., Va-\nsyliunas, V., McCarthy, M., Wilber, M., Eliasson, L., Lundin,\nR., Olsen, S., Shelley, E. G., Fuselier, S., Ghielmetti, A. G.,\nLennartsson, W., Escoubet, C. P., Balsiger, H., Friedel, R., Cao,\nJ.-B., Kovrazhkin, R. A., Papamastorakis, I., Pellat, R., Scudder,\nJ., and Sonnerup, B.: First multispacecraft ion measurements in\nand near the Earth’s magnetosphere with the identical Cluster Ion\nSpectrometry (CIS) experiment, Ann. Geophys., 19, 1303–1354,\n2001,\nhttp:\/\/www.ann-geophys.net\/19\/1303\/2001\/.\nRobert, P., Dunlop, M. W., Roux, A., and Chanteur, G.: Accuracy of\nCurrent Density Determination, in: Analysis Methods for Multi-\nSpacecraft Data, edited by: Paschmann, G. and Daly, P. W., pp.\n395–418, ISSI, 1998.\nRussell, C. T., Mellott, M. M., Smith, E. J., and King, J. H.:\nMultiple spacecraft observations of interplanetary shocks Four\nspacecraft determination of shock normals, J. Geophys. Res., 88,\n4739–4748, 1983.\nSergeev, V., Liou, K., Newell, P., Ohtani, S., Hairston, M., and\nRich, F.: Auroral streamers: characteristics of associated pre-\ncipitation,convection and field-aligned currents, Ann. Geophys.,\n22, 537–548, 2004,\nhttp:\/\/www.ann-geophys.net\/22\/537\/2004\/.\nSergeev, V. A., Angelopoulos, V., Gosling, J. T., Cattell, C. A., and\nRussell, C. T.: Detection of localized, plasma-depleted flux tubes\nor bubbles in the midtail plasma sheet, J. Geophys. Res., 101,\n10 817–10 826, doi:10.1029\/96JA00460, 1996.\nSergeev, V. A., Sauvaud, J.-A., Popescu, D., Kovrazhkin, R. A.,\nLiou, K., Newell, P. T., Brittnacher, M., Parks, G., Nakamura,\nR., Mukai, T., and Reeves, G. D.: Multiple-spacecraft observa-\ntion of a narrow transient plasma jet in the Earth’s plasma sheet,\nGeophys. Res. Lett., 27, 851–854, 2000.\nSitnov, M. I., Guzdar, P. N., and Swisdak, M.: On the formation of\na plasma bubble, Geophys. Res. Lett., 32, 16 103, doi:10.1029\/\n2005GL023585, 2005.\nSlavin, J. A., Tanskanen, E. I., Hesse, M., Owen, C. J., Dun-\nlop, M. W., Imber, S., Lucek, E. A., Balogh, A., and Glass-\nmeier, K.-H.: Cluster observations of travelling compression\nregions in the near-tail, J. Geophys. Res., 110, A06 207, doi:\n10.1029\/2004JA010878, 2005.\nSmith, C. W., L’Heureux, J., Ness, N. F., Acun˜a, M. H., Burlaga,\nL. F., and Scheifele, J.: The ACE Magnetic Fields Experiment,\nSpace Sci. Rev., 86, 613–632, doi:10.1023\/A:1005092216668,\n1998.\nSonnerup, B. U. O. and Cahill Jr., L. J.: Magnetopause structure\nand attitude from Explorer 12 observations, J. Geophys. Res.,\n72, 171–183, 1967.\nSonnerup, B. U. O. and Scheible, M.: Minimum and Maximum\nVariance Analysis, in: Analysis Methods for Multi-Spacecraft\nData, edited by: Paschmann, G. and Daly, P. W., pp. 185–220,\nISSI, 1998.\nStone, E. C., Frandsen, A. M., Mewaldt, R. A., Christian, E. R.,\nMargolies, D., Ormes, J. F., and Snow, F.: The Advanced Com-\nposition Explorer, Space Sci. Rev., 86, 1–22, doi:10.1023\/A:\n1005082526237, 1998.\nTsyganenko, N. A.: A magnetospheric magnetic field model with\na warped tail current sheet, Planet. Space Sci., 37, 5–20, doi:\n10.1016\/0032-0633(89)90066-4, 1989.\nTsyganenko, N. A. and Stern, D. P.: Modeling the global magnetic\nfield of the large-scale Birkeland current systems, J. Geophys.\nRes., 101, 27 187–27 198, doi:10.1029\/96JA02735, 1996.\nAnn. Geophys., 26, 167–184, 2008 www.ann-geophys.net\/26\/167\/2008\/\n"}