{"doi":"10.1529\/biophysj.104.053926","coreId":"70954","oai":"oai:eprints.lancs.ac.uk:9182","identifiers":["oai:eprints.lancs.ac.uk:9182","10.1529\/biophysj.104.053926"],"title":"Monitoring cell cycle distributions in MCF-7 cells using near-field photothermal microspectroscopy.","authors":["Hammiche, Azzadine","German, Matthew J.","Hewitt, Rebecca","Pollock, Hubert M.","Martin, Francis L."],"enrichments":{"references":[{"id":16373345,"title":"A Fourier-transform infrared spectroscopic study of the phosphoserine residues in hen egg phosvitin and ovalbumin.","authors":[],"date":"1988","doi":"10.1021\/bi00409a033","raw":"Sanchez-Ruiz, J. M., and M. Martinez-Carrion. 1988. A Fourier-transform infrared spectroscopic study of the phosphoserine residues in hen egg phosvitin and ovalbumin. Biochemistry. 27:3338–3342.","cites":null},{"id":16373343,"title":"A parafﬁn embedding technique for studies employing immunoﬂuorescence.","authors":[],"date":"1962","doi":"10.1177\/10.3.250","raw":"Sainte-Marie, G. 1962. A parafﬁn embedding technique for studies employing immunoﬂuorescence. J. Histochem. Cytochem. 10:250–256.","cites":null},{"id":16373334,"title":"Biomedical infrared spectroscopy. In Infrared Spectroscopy of Biomolecules.","authors":[],"date":"1996","doi":"10.1002\/0470027320.s8101","raw":"Jackson, M., and H. H. Mantsch. 1996. Biomedical infrared spectroscopy. In Infrared Spectroscopy of Biomolecules. H. H. Mantsch and D. Chapman, editors. Wiley-Liss, New York. 311–340.","cites":null},{"id":16373338,"title":"Cancer-related changes in prostate DNA as men age and early identiﬁcation of metastasis in primary prostate tumors.","authors":[],"date":"2003","doi":"10.1073\/pnas.0931396100","raw":"Malins, D. C., P. M. Johnson, E. A. Barker, N. L. Polissar, T. M. Wheeler, and K. M. Anderson. 2003. Cancer-related changes in prostate DNA as men age and early identiﬁcation of metastasis in primary prostate tumors. Proc. Natl. Acad. Sci. USA. 100:5401–5406.","cites":null},{"id":16373367,"title":"Chromatin: Structure and Function.","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5550-2_4","raw":"Wolffe, A. P. 1997. Chromatin: Structure and Function. Academic Press, New York.","cites":null},{"id":16373323,"title":"Cytologically normal cells from neoplastic cervical samples display extensive structural abnormalities on IR spectroscopy: implications for tumor biology.","authors":[],"date":"1998","doi":"10.1073\/pnas.95.26.15327","raw":"Cohenford, M. A., and B. Rigas. 1998. Cytologically normal cells from neoplastic cervical samples display extensive structural abnormalities on IR spectroscopy: implications for tumor biology. Proc. Natl. Acad. Sci. USA. 95:15327–15332.","cites":null},{"id":16373316,"title":"Diagnostic potential of Fourier-transform Cell Cycle Monitoring by","authors":[],"date":"2002","doi":"10.1117\/1.1463051","raw":"Argov, S., J. Ramesh, A. Salman, I. Sinelnikov, J. Goldstein, H. Guterman, and S. Mordechai. 2002. Diagnostic potential of Fourier-transform Cell Cycle Monitoring by PTMS 3705 Biophysical Journal 88(5) 3699–3706infrared microspectroscopy and advanced computational methods in colon cancer patients. J. Biomed. Opt. 7:248–254.","cites":null},{"id":16373341,"title":"Epigenetics and cancer: implications for drug discovery and safety assessment.","authors":[],"date":"2004","doi":"10.1016\/j.taap.2004.01.009","raw":"Moggs, J. G., J. I. Goodman, J. E. Trosko, and R. A. Roberts. 2004. Epigenetics and cancer: implications for drug discovery and safety assessment. Toxicol. Appl. Pharmacol. 196:422–430.","cites":null},{"id":16373329,"title":"Evaluation of non-formalin tissue ﬁxation for molecular proﬁling studies.","authors":[],"date":"2002","doi":"10.1016\/s0002-9440(10)64864-x","raw":"Gillespie, J. W., C. J. Best, V. E. Bichsel, K. A. Cole, S. F. Greenhut, S. M. Hewitt, M. Ahram, Y. B. Gathright, M. J. Merino, R. L. Strausberg, J. I. Epstein, S. R. Hamilton, G. Gannot, G. V. Baibakova, V. S. Calvert, M. J. Flaig, R. F. Chuaqui, J. C. Herring, J. Pfeifer, E. F. Petricoin, W. M. Linehan, P. H. Duray, G. S. Bova, and M. R. Emmert-Buck. 2002. Evaluation of non-formalin tissue ﬁxation for molecular proﬁling studies. Am. J. Pathol. 160:449–457.","cites":null},{"id":16373344,"title":"FTIR microspectroscopy of malignant ﬁbroblasts transformed by mouse sarcoma virus.","authors":[],"date":"2003","doi":"10.1016\/s0165-022x(02)00182-3","raw":"Salman, A., J. Ramesh, V. Erukhimovitch, M. Talyshinsky, S. Mordechai, and M. Huleihel. 2003. FTIR microspectroscopy of malignant ﬁbroblasts transformed by mouse sarcoma virus. J. Biochem. Biophys. Methods. 55:141–153.","cites":null},{"id":16373372,"title":"Genotoxic effects of oestrogens in breast cells as detected by the micronucleus assay and the Comet assay.","authors":[],"date":"2002","doi":"10.1093\/mutage\/17.4.345","raw":"Yared, E., T. J. McMillan, and F. L. Martin. 2002. Genotoxic effects of oestrogens in breast cells as detected by the micronucleus assay and the Comet assay. Mutagenesis. 17:345–352. 3706 Hammiche et al. Biophysical Journal 88(5) 3699–3706","cites":null},{"id":16373356,"title":"Infrared microscopy of epithelial cancer cells in whole tissues and in tissue culture, using synchrotron radiation. Faraday Discuss.","authors":[],"date":"2004","doi":"10.1039\/b306689d","raw":"Tobin, M. J., M. A. Chesters, J. M. Chalmers, F. J. M. Rutten, S. E. Fisher, I. M. Symonds, A. Hitchcock, R. Allibone, and S. Dias-Gunasekara. 2004. Infrared microscopy of epithelial cancer cells in whole tissues and in tissue culture, using synchrotron radiation. Faraday Discuss. 126: 27–39.","cites":null},{"id":16373339,"title":"Infrared spectral models demonstrate that exposure to environmental chemicals leads to new forms of DNA.","authors":[],"date":"1997","doi":"10.1073\/pnas.94.8.3611","raw":"Malins, D. C., N. L. Polissar, and S. J. Gunselman. 1997. Infrared spectral models demonstrate that exposure to environmental chemicals leads to new forms of DNA. Proc. Natl. Acad. Sci. USA. 94:3611–3615.","cites":null},{"id":16373327,"title":"Infrared spectroscopy of cells and tissues: shining light onto a novel subject.","authors":[],"date":"1999","doi":"10.1366\/0003702991946712","raw":"Diem, M., S. Boydston-White, and L. Chiriboga. 1999. Infrared spectroscopy of cells and tissues: shining light onto a novel subject. Appl. Spectrosc. 53:148A–161A.","cites":null},{"id":16373318,"title":"Infrared spectroscopy of human tissue. V. Infrared spectroscopic studies of myeloid leukemia (ML-1) cells at different phases of the cell cycle.","authors":[],"date":"1999","doi":"10.1002\/(sici)1520-6343(1999)5:4<219::aid-bspy2>3.3.co;2-f","raw":"Boydston-White, S., T. Gopen, S. Houser, J. Bargonetti, and M. Diem. 1999. Infrared spectroscopy of human tissue. V. Infrared spectroscopic studies of myeloid leukemia (ML-1) cells at different phases of the cell cycle. Biospectroscopy. 5:219–227.","cites":null},{"id":16373364,"title":"Introduction to chromosome dynamics in mitosis.","authors":[],"date":"2003","doi":"10.1016\/j.biolcel.2003.08.003","raw":"Watrin, E., and V. Legagneux. 2003. Introduction to chromosome dynamics in mitosis. Biol. Cell. 95:507–513.","cites":null},{"id":16373333,"title":"IR spectroscopic characteristics of cell cycle and cell death probed by synchrotron radiation based Fourier transform IR spectromicroscopy.","authors":[],"date":"2000","doi":"10.1002\/1097-0282(2000)57:6<329::aid-bip20>3.0.co;2-2","raw":"Holman, H. Y, M. C. Martin, E. A. Blakely, K. Bjornstad, and W. R. McKinney. 2000. IR spectroscopic characteristics of cell cycle and cell death probed by synchrotron radiation based Fourier transform IR spectromicroscopy. Biopolymers. 57:329–335.","cites":null},{"id":16373330,"title":"Learning to Use Statistical Tests in Psychology.","authors":[],"date":"1989","doi":null,"raw":"Greene, J. and M. D’Oliveira. 1989 Learning to Use Statistical Tests in Psychology. Open University Press, Milton Keynes, UK.","cites":null},{"id":16373320,"title":"Localized photothermal infrared spectroscopy using a proximal probe.","authors":[],"date":"2001","doi":"10.1063\/1.1403671","raw":"Bozec, L., A. Hammiche, H. M. Pollock, M. Conroy, J. M. Chalmers, N. J. Everall, and L. Turin. 2001. Localized photothermal infrared spectroscopy using a proximal probe. J. Appl. Phys. 90:5159–5165.","cites":null},{"id":16373335,"title":"Low-dose induction of micronuclei by lindane.","authors":[],"date":"2004","doi":null,"raw":"Kalantzi, O. I., R. Hewitt, K. J. Ford, L. Cooper, R. E. Alcock, G. O. Thomas, J. A. Morris, T. J. McMillan, K. C. Jones, and F. L. Martin. 2004. Low-dose induction of micronuclei by lindane. Carcinogenesis. 25:613–622.","cites":null},{"id":16373342,"title":"Micro-thermal analysis: techniques and applications.","authors":[],"date":"2001","doi":"10.1088\/0022-3727\/34\/9\/201","raw":"Pollock, H. M., and A. Hammiche. 2001. Micro-thermal analysis: techniques and applications. J. Phys. D Appl. Phys. 34:R23–R53.","cites":null},{"id":16373331,"title":"Mid-infrared microspectroscopy of difﬁcult samples using near-ﬁeld photothermal microspectroscopy.","authors":[],"date":"2004","doi":"10.1111\/j.1365-2818.2004.01292.x","raw":"Hammiche, A., L. Bozec, M. J. German, J. M. Chalmers, N. J. Everall, G. Poulter, M. Reading, M. Reading, D. B. Grandy, F. L. Martin, and H. M. Pollock. 2004a. Mid-infrared microspectroscopy of difﬁcult samples using near-ﬁeld photothermal microspectroscopy. Spectroscopy. 19:20–42.","cites":null},{"id":16373321,"title":"New opportunities in micro- and macro-attenuated total reﬂection infrared spectroscopic imaging: spatial resolution and sampling versatility.","authors":[],"date":"2003","doi":"10.1366\/00037020360625907","raw":"Chan, K. L., and S. G. Kazarian. 2003. New opportunities in micro- and macro-attenuated total reﬂection infrared spectroscopic imaging: spatial resolution and sampling versatility. Appl. Spectrosc. 57:381–389.","cites":null},{"id":16373325,"title":"Oestrogens induce G1 arrest in benzo[a]pyrene-treated MCF-7 breast cells whilst enhancing genotoxicity and clonogenic survival.","authors":[],"date":"2002","doi":"10.1093\/mutage\/17.5.431","raw":"Davis, C., S. Bhana, A. J. Shorrocks, and F. L. Martin. 2002. Oestrogens induce G1 arrest in benzo[a]pyrene-treated MCF-7 breast cells whilst enhancing genotoxicity and clonogenic survival. Mutagenesis. 17: 431–438.","cites":null},{"id":16373332,"title":"Progress in near-ﬁeld photothermal infra-red microspectroscopy.","authors":[],"date":"2004","doi":"10.1111\/j.1365-2818.2004.01292.x","raw":"Hammiche, A., L. Bozec, H. M. Pollock, M. German, and M. Reading. 2004b. Progress in near-ﬁeld photothermal infra-red microspectroscopy. J. Microsc. 213:129–134.","cites":null},{"id":16373340,"title":"Regulation of chromosome condensation and segregation.","authors":[],"date":"2003","doi":"10.1016\/s0959-437x(03)00027-3","raw":"McHugh, B., and M. M. S. Heck. 2003. Regulation of chromosome condensation and segregation. Curr. Opin. Genet. Dev. 13:185–190.","cites":null},{"id":16373337,"title":"Spatially resolved IR microspectroscopy of single cells.","authors":[],"date":"2002","doi":"10.1002\/bip.10095","raw":"Lasch, P., A. Paciﬁco, and M. Diem. 2002. Spatially resolved IR microspectroscopy of single cells. Biopolymers. 67:335–338.","cites":null},{"id":16373328,"title":"the combined application of FTIR microspectroscopy and ToF-SIMS imaging in the study of prostate cancer. Faraday Discuss.","authors":[],"date":"2004","doi":"10.1039\/b304883g","raw":"Gazi, E., J. Dwyer, N. Lockyer, P. Gardner, J. C. Vickerman, J. Miyan, C. A. Hart, M. Brown, J. H. Shanks, and N. Clarke. 2004. the combined application of FTIR microspectroscopy and ToF-SIMS imaging in the study of prostate cancer. Faraday Discuss. 126:41–59.","cites":null},{"id":16373346,"title":"The effect of solvent polarity on photo-acoustic spectra of alkyl-cyanobiphenyl derivatives.","authors":[],"date":"2001","doi":"10.1088\/1464-4258\/3\/4\/362","raw":"Sikorska, A., B. J. Linde, and J. I. Kukielski. 2001. The effect of solvent polarity on photo-acoustic spectra of alkyl-cyanobiphenyl derivatives. J. Opt. A: Pure Appl. Op. 3:S71–S76.","cites":null},{"id":16373336,"title":"The nucleosome: from genomic organization to genomic regulation.","authors":[],"date":"2004","doi":"10.1016\/s0092-8674(04)00044-3","raw":"Khorasanizadeh, S. 2004. The nucleosome: from genomic organization to genomic regulation. Cell. 116:259–272.","cites":null},{"id":16373359,"title":"Ultrasound-mediated biophotonic imaging: A review of acousto-optical tomography and photo-acoustic tomography.","authors":[],"date":"2003","doi":"10.1155\/2004\/478079","raw":"Wang, L. H. V. 2003. Ultrasound-mediated biophotonic imaging: A review of acousto-optical tomography and photo-acoustic tomography. Dis. Markers. 19:123–138.","cites":null},{"id":16373302,"title":"Virologic versus cytologic triage of women with equivocal Pap smears: a meta-analysis of the accuracy to detect highgrade intraepithelial neoplasia.","authors":[],"date":"2004","doi":"10.1093\/jnci\/djh037","raw":"Arbyn, M., F. Buntinx, M. Van Ranst, E. Paraskevaidis, P. Martin-Hirsch, and J. Dillner. 2004. Virologic versus cytologic triage of women with equivocal Pap smears: a meta-analysis of the accuracy to detect highgrade intraepithelial neoplasia. J. Natl. Cancer Inst. 96:280–293.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-05","abstract":"Microspectroscopic techniques such as Fourier transform infrared (FTIR) have played an important role in \"fingerprinting\" the biochemical composition of cellular components. Based on structure and function, complex biomolecules absorb energy in the mid-infrared ( = 2–20 µm) yielding characteristic vibrational infrared (IR) spectra. However, optical detection FTIR microspectroscopy may not be suitable for IR-absorbing sample materials. Photothermal microspectroscopy (PTMS) permits the direct measurement of heat generated as a result of sample material absorbing radiation. This approach generates true absorption spectra and is implemented by interfacing a scanning probe microscope and an FTIR spectrometer. Detection is performed using a near-field ultra-miniaturized temperature sensor. Employing PTMS, IR spectra of MCF-7 cells were examined in spectral regions (900–2000 cm–1) corresponding to proteins, DNA, RNA, glycoproteins, carbohydrates, lipids, and levels of protein phosphorylation. As a cell passes through the cell cycle, its nuclear material decondenses and condenses and this has led to ambiguity as to whether the intensity of such spectral regions may be associated with the G1-, S- or G2-phases of the cell cycle. Cultured cells were tracked over a time course known to correspond to marked alterations in cell-cycle distributions, as determined using flow cytometry. Experiments were carried out in the absence or presence of lindane, a pesticide known to induce G1-arrest in MCF-7 cells. Significant (P < 0.05) elevations in spectral intensities were associated with exponentially growing cell populations, predominantly in S-phase or G2-phase, compared to more quiescent populations predominantly in G1-phase. Increases in the absorption band at 970 cm–1, associated with elevated protein phosphorylation, were observed in vibrational spectra of exponentially growing cell populations compared to those exhibiting a slowing in their growth kinetics. These results seem to suggest that intracellular bulk changes, associated with transit through the cell cycle, can be tracked using PTMS","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70954.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9182\/1\/PIIS0006349505734184.pdf","pdfHashValue":"4b840361f0add6110b3a7c84604772d323e72cf5","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9182<\/identifier><datestamp>\n      2018-01-24T03:20:38Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5148:5148333031<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Monitoring cell cycle distributions in MCF-7 cells using near-field photothermal microspectroscopy.<\/dc:title><dc:creator>\n        Hammiche, Azzadine<\/dc:creator><dc:creator>\n        German, Matthew J.<\/dc:creator><dc:creator>\n        Hewitt, Rebecca<\/dc:creator><dc:creator>\n        Pollock, Hubert M.<\/dc:creator><dc:creator>\n        Martin, Francis L.<\/dc:creator><dc:subject>\n        QH301 Biology<\/dc:subject><dc:description>\n        Microspectroscopic techniques such as Fourier transform infrared (FTIR) have played an important role in \"fingerprinting\" the biochemical composition of cellular components. Based on structure and function, complex biomolecules absorb energy in the mid-infrared ( = 2–20 µm) yielding characteristic vibrational infrared (IR) spectra. However, optical detection FTIR microspectroscopy may not be suitable for IR-absorbing sample materials. Photothermal microspectroscopy (PTMS) permits the direct measurement of heat generated as a result of sample material absorbing radiation. This approach generates true absorption spectra and is implemented by interfacing a scanning probe microscope and an FTIR spectrometer. Detection is performed using a near-field ultra-miniaturized temperature sensor. Employing PTMS, IR spectra of MCF-7 cells were examined in spectral regions (900–2000 cm–1) corresponding to proteins, DNA, RNA, glycoproteins, carbohydrates, lipids, and levels of protein phosphorylation. As a cell passes through the cell cycle, its nuclear material decondenses and condenses and this has led to ambiguity as to whether the intensity of such spectral regions may be associated with the G1-, S- or G2-phases of the cell cycle. Cultured cells were tracked over a time course known to correspond to marked alterations in cell-cycle distributions, as determined using flow cytometry. Experiments were carried out in the absence or presence of lindane, a pesticide known to induce G1-arrest in MCF-7 cells. Significant (P < 0.05) elevations in spectral intensities were associated with exponentially growing cell populations, predominantly in S-phase or G2-phase, compared to more quiescent populations predominantly in G1-phase. Increases in the absorption band at 970 cm–1, associated with elevated protein phosphorylation, were observed in vibrational spectra of exponentially growing cell populations compared to those exhibiting a slowing in their growth kinetics. These results seem to suggest that intracellular bulk changes, associated with transit through the cell cycle, can be tracked using PTMS.<\/dc:description><dc:date>\n        2005-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9182\/1\/PIIS0006349505734184.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1529\/biophysj.104.053926<\/dc:relation><dc:identifier>\n        Hammiche, Azzadine and German, Matthew J. and Hewitt, Rebecca and Pollock, Hubert M. and Martin, Francis L. (2005) Monitoring cell cycle distributions in MCF-7 cells using near-field photothermal microspectroscopy. Biophysical Journal, 88 (5). pp. 3699-3706. ISSN 0006-3495<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9182\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1529\/biophysj.104.053926","http:\/\/eprints.lancs.ac.uk\/9182\/"],"year":2005,"topics":["QH301 Biology"],"subject":["Journal Article","PeerReviewed"],"fullText":"Monitoring Cell Cycle Distributions in MCF-7 Cells Using Near-Field\nPhotothermal Microspectroscopy\nAzzedine Hammiche,* Matthew J. German,* Rebecca Hewitt,y Hubert M. Pollock,* and Francis L. Martiny\n*Department of Physics and yDepartment of Biological Sciences, Institute of Environmental and Natural Sciences, Lancaster University,\nLancaster, United Kingdom\nABSTRACT Microspectroscopic techniques such as Fourier transform infrared (FTIR) have played an important role in\n‘‘fingerprinting’’ the biochemical composition of cellular components. Based on structure and function, complex biomolecules\nabsorb energy in the mid-infrared (l ¼ 2–20 mm) yielding characteristic vibrational infrared (IR) spectra. However, optical\ndetection FTIR microspectroscopy may not be suitable for IR-absorbing sample materials. Photothermal microspectroscopy\n(PTMS) permits the direct measurement of heat generated as a result of sample material absorbing radiation. This approach\ngenerates true absorption spectra and is implemented by interfacing a scanning probe microscope and an FTIR spectrometer.\nDetection is performed using a near-field ultra-miniaturized temperature sensor. Employing PTMS, IR spectra of MCF-7 cells\nwere examined in spectral regions (900–2000 cm\u00021) corresponding to proteins, DNA, RNA, glycoproteins, carbohydrates,\nlipids, and levels of protein phosphorylation. As a cell passes through the cell cycle, its nuclear material decondenses and\ncondenses and this has led to ambiguity as to whether the intensity of such spectral regions may be associated with the G1-, S- or\nG2-phases of the cell cycle. Cultured cells were tracked over a time course known to correspond to marked alterations in cell-\ncycle distributions, as determined using flow cytometry. Experiments were carried out in the absence or presence of lindane,\na pesticide known to induce G1-arrest in MCF-7 cells. Significant (P , 0.05) elevations in spectral intensities were associated\nwith exponentially growing cell populations, predominantly in S-phase or G2-phase, compared to more quiescent populations\npredominantly in G1-phase. Increases in the absorption band at 970 cm\n\u00021, associated with elevated protein phosphorylation,\nwere observed in vibrational spectra of exponentially growing cell populations compared to those exhibiting a slowing in their\ngrowth kinetics. These results seem to suggest that intracellular bulk changes, associated with transit through the cell cycle, can\nbe tracked using PTMS.\nINTRODUCTION\nNear-field photothermal microspectroscopy (PTMS) is based\non the absorption of electromagnetic radiation and detection\nof associated heat release. At its heart is an ultra miniaturized\ntemperature sensor in the form of a thermal probe integrated\nin a cantilevered structure, as used in scanning force micros-\ncopy (Hammiche et al., 2004a). This sensor consists of a\n5-mm diameter, 90% platinum-10% rhodium looped fila-\nment of Wollaston wire, ;200 mm in length (Bozec et al.,\n2001).\nUsing this technique, absorption spectra that are a charac-\nteristic fingerprint of the sample analyzed are routinely\nobtained with minimum or no sample preparation. Due to the\ndamped nature of thermal waves, PTMS potentially allows\nhigher-than-the-diffraction-limit resolution of molecular\nspecies on the surfaces of materials or living structures\n(Hammiche et al., 2004b).\nOrganized and compacted within the nucleus, the approx-\nimate length of DNA in the genome of a human somatic cell\nis 3 m. Within a nucleoprotein complex (chromatin) that\nconsists of basic repeating units known as nucleosomes, this\nDNA is associated with histone proteins. The degree of this\nfirst-level compaction regulates the accessibility of factors\nthat modulate the transcriptional activity of genes and en-\nsures proper epigenetic inheritance (Wolffe, 1997; Moggs\net al., 2004). As proliferating cells pass through the different\ngrowth and synthesis (e.g., DNA replication) stages of the\ncell cycle from interphase (G1-phase, S-phase and G2-phase)\nthrough to the mitotic (M)-phase before mitotic cell division,\na significant degree of chromosomal condensation is re-\nquired to reduce the volume of replicated genomes (Watrin\nand Legagneux, 2003). After a cell duplicates its DNA\n(during S-phase), loosely packed chromatin fibers condense\ninto discrete mitotic chromosomes in M-phase; this is re-\nquired to facilitate the proper segregation of genetic material\nbetween daughter cells (McHugh and Heck, 2003).\nThe stage of the cell cycle may contribute to the variability\nof IR spectra of cells within apparently similar tissues (Tobin\net al., 2004). Twofold increases in the DNA\/RNA infrared\n(IR) spectral region, obtained using synchrotron radiation\nbased Fourier transform infrared (FTIR) microspectroscopy,\nhave been reported in cells undergoing DNA replication in\nS-phase compared to cells in G1-phase (Holman et al., 2000).\nThis would suggest that IR spectra might be an alternative\ntool to monitor intracellular bulk changes as a cell progresses\nthrough the cell cycle. Alternatively, chromatin condensation\nmight render the cell genome too dense for IR absorption and\nSubmitted October 4, 2004, and accepted for publication February 8, 2005.\nAddress reprint requests to Francis L. Martin, Dept. of Biological Sciences,\nInstitute of Environmental and Natural Sciences, Lancaster University,\nLancaster LA1 4YQ, UK. Tel.: 144-1524-594505; Fax: 144-1524-\n843854; E-mail: f.martin@lancaster.ac.uk.\n\u0002 2005 by the Biophysical Society\n0006-3495\/05\/05\/3699\/08 $2.00 doi: 10.1529\/biophysj.104.053926\nBiophysical Journal Volume 88 May 2005 3699–3706 3699\ntherefore unobservable in IR spectra (Boydston-White et al.,\n1999; Diem et al., 1999). As PTMS relies on the detection of\nheat released after the absorption of radiation, such varying\nopacity within the sample material will not influence re-\nsultant spectra.\nIn this study, we used PTMS to investigate the spectral\nchanges that occur in proliferating MCF-7 cells. As distinct\nfrom conventional FTIR microspectroscopy, PTMS meas-\nures heat generated after absorption of electromagnetic\nradiation. Thus it allows for measurements to be made with\nopaque materials such as a cell nucleus. An added advantage\nis that it requires minimum sample preparation. Experiments\nwere carried out in the absence or presence of 10\u00024 M\nlindane (g-hexachlorocyclohexane, g-HCH), an agent known\nto induce a profound G1-phase arrest at this concentration\n(Kalantzi et al., 2004). Cell cycle distributions were deter-\nmined in parallel experiments using flow cytometry. The aim\nof this approach was to ascertain whether intracellular bulk\nchanges are spectrally observable.\nMATERIALS AND METHODS\nChemicals\nChemicals were obtained from Sigma Chemical Co. (Poole, UK) unless\notherwise stated. Cell culture consumables were obtained from Invitrogen\nLife Technologies (Paisley, UK) unless otherwise stated.\nCell culture and treatment\nThe human mammary carcinoma MCF-7 cell line was grown in Dulbecco’s\nmodified essential medium supplemented with 10% heat-inactivated foetal\ncalf serum, penicillin (100 U\/ml) and streptomycin (100mg\/ml) (Yared et al.,\n2002). Cells were grown in 5% CO2 in air at 37\u0003C in a humidified atmo-\nsphere and disaggregated using a trypsin (0.05%)\/EDTA (0.02%) solution,\nto form single cell suspensions before subculture or incorporation in ex-\nperiments. Lindane (10\u00024 M) was added as a solution in dimethyl\nsulphoxide (DMSO) and DMSO was used as a vehicle control: DMSO\nconcentrations did not exceed 1% (v\/v).\nTo facilitate PTMS analysis, routinely cultured cells were disaggregated\nand resuspended in complete medium before seeding aliquots (5 ml, \u0003105\ncells) into 60-mm petri dishes containing 5-mm glass coverslips. Cells were\ncultured undisturbed for 24 h, 48 h, or 96 h before removal of medium and\nfixation with 70% ethanol (EtOH). In parallel cultures, cells were initially\ncultured for the first 24 h in the absence of lindane; medium was then\nreplaced with medium containing lindane for a subsequent 24-h period\ngiving a ‘‘48 h plus lindane’’ time point. To obtain a ‘‘96 h plus lindane’’\ntime point, medium from these aforementioned lindane-treated cultures was\nthen replaced with fresh lindane-free medium for the remaining incubation\nperiod before fixation.\nFlow cytometry\nCells were resuspended in aliquots of complete medium (5 ml, \u0003105 cells)\nand seeded into 60-mm petri dishes (Davis et al., 2002). At the time points\nindicated (24 h, 48 h, and 96 h), cells were disaggregated and, aliquots were\nwashed twice with phosphate-buffered saline (PBS) before fixation with ice-\ncold EtOH (70%, aqueous) and storage overnight at \u000220\u0003C. Cell aliquots\nwere then washed twice with PBS before incubation with RNase A (10 mg\/\nml) and propidium iodide (50 mg\/ml) for 60 min at 37\u0003C. DNA content of\n10,000 events (cells)\/treatment was analyzed using a Becton Dickinson\n(Franklin Lakes, NJ) FACSCaliber flow cytometer and the CELLQuest\nsoftware version provided by the manufacturer. Cell cycle analysis was\ncarried out using ModFitLT for Mac v2.0.\nPTMS analysis of fixed cells\nThe sample material consisted of 70% EtOH-fixed cells adhered to glass\ncoverslips. After fixation, coverslip-containing petri dishes were placed\nunder vacuum overnight to facilitate dehydration of samples. Subsequently,\ndishes were individually sealed tight with adhesive tape. PTMS is im-\nplemented by integrating, using a dedicated optical interface (Specac,\nOrpington, UK), a scanning probe microscope (Explorer model from Veeco\nInstruments, Santa Barbara, CA) equipped with a Wollaston wire thermal\nprobe (Veeco Instruments) and a FTIR spectrometer (Vector 22 model from\nBruker Optics limited, Coventry, UK) (Hammiche et al., 2004b). IR spectra\nwere acquired by placing the glass coverslips, coated with sample material,\nin the chamber compartment of the spectrometer. With the probe tip at the\nIR-focal point to maximize the signal, the tip picked up cellular material and\nabsorption spectra were recorded. This nanosampling method was employed\nto enhance signal\/noise ratio (SNR) by eliminating temperature reduction\ndue to substrate heat-sinking effects. Material was acquired in an unbiased\nfashion from across the coverslip and variations in the quantity of sample\npicked up were of the order of a few tens of cells, judging from visual\nobservation using an optical microscope. Additionally, coherent averaging\n(1000 scans\/measurement resulting in a 20-min acquisition time) was used\nto further improve SNR. For each cell culture analyzed, a maximum of 10\nabsorption spectra from 10 different samples of cellular material were\nrecorded per coverslip. Spectra, taken with a 16-cm\u00021 spectral resolution,\nwere obtained from two measurements: one performed with cellular material\nattached to the probe tip, the second was a measurement of a background\nspectrum obtained with the probe free of any material. A first normalization\nwas performed, by dividing the former by the later. Baseline subtraction was\nthen applied considering zero energy absorption at 2000 cm\u00021: the value of\nthe recorded signal at that wavenumber was subtracted across the entire\nrange. Finally all spectra were normalized to the amide II peak (\u00031540\ncm\u00021). Between sample analyses, the probe was cleaned, by Joule heating to\n.600\u0003C; previous investigations from our laboratory have shown that this\nresults in pyrolysis of attached organic contaminant(s) (Pollock and\nHammiche, 2001).\nBy sensing changes in the probe’s electrical resistance, the physical\nparameter measured is temperature. Spectra were constructed from the\nmeasured amplitude of the temperature fluctuation at each wavelength\nacross the entire spectrum. Factors that affect the strength of this measured\nsignal include quantity of material analyzed and contact of the material with\nthe probe filament. This renders quantification of absorption in terms of\nabsolute units very difficult. Hence, the amplitude axis (y axis) of spectra\npresented is labeled in arbitrary units (au).\nStatistical analysis\nData obtained from flow cytometry measurements were compared using\neither one-way ANOVA (on the effects of incubation time in untreated\ncultures), or two-way ANOVA (on the effects of incubation time and the\naddition of lindane). A probability value ,5% (P , 0.05) was selected as\nbeing statistically significant (Greene and D’Oliveira, 1989).\nThe Mann-Whitney U test was employed to compare absorption spectra\nat each wavenumber for each cell culture (Greene and D’Oliveira, 1989).\nThis is a nonparametric test that does not assume normal distribution of the\nnumerical data. Probability diagrams were constructed for each pair of\nabsorption spectra to be compared; thus graphically illustrating which\nwavenumbers exhibited the largest differences between cell cultures.\nRegions of spectra with a P , 0.05 are likely to represent real structural\ndifferences (Malins et al., 2003).\n3700 Hammiche et al.\nBiophysical Journal 88(5) 3699–3706\nMultivariate (principal component) analysis was also conducted on the\nspectra using the Pirouette software package (Infometrix, Woodinville,\nWA). In multivariate data analysis, each spectrum becomes a single point in\na ‘‘hyperspace,’’ where the number of dimensions depends on the chosen\nspectral resolution. The information obtained may be plotted in the form of\na two-dimensional plot known as a dendrogram of similarity index.\nNearness in row space, or multivariate distance, implies pattern recognition\nand the separation of sample clusters in the plots signifies structurally\ndissimilar groups.\nRESULTS\nTable 1 shows the changes that occur in cell-cycle dis-\ntributions, measured using flow cytometry, over a 96-h\nperiod after seeding \u0003105 MCF-7 cells\/5-ml culture medium\ninto 60-mm petri dishes. After disaggregation, 60.7% 6\n3.5% of MCF-7 cells are in G1-phase. By 24 h, as seeded\ncells adhered to the base of a culture dish or coverslip and\nentered an exponential-growth phase, one-way ANOVA\nrevealed that a significant (P , 0.001 compared to dis-\naggregated cell populations) reduction in the percentage of\ncells in G1-phase occurred. However, at subsequent time\npoints increases in the percentage of cells in G1-phase were\nobserved both at 48 h (45%6 3.5%, P, 0.003 compared to\nthe 24-h time point) and 96 h; by this time point the\npercentage of cells in G1-phase (66.0% 6 4.3%) was ap-\nproximately equal and not significantly different to that\nobserved immediately after disaggregation. Corresponding\ntime-related fluctuations in the percentages of cells in\nS-phase or G2-phase also exhibited a similar pattern of\nsignificant (P , 0.05) changes. Again, by 96-h incubation\nthese percentages were comparable to levels observed im-\nmediately postdisaggregation (Table 1). Two-way ANOVA\nindicated that both incubation time and lindane treatment\nexerted a significant (P , 0.05) effect on each cell pop-\nulation. Furthermore, for cells in G1-phase or S-phase, the\ninteraction of these two factors was observed to be highly\nsignificant (P , 0.001). This interaction effect is probably\nbecause lindane, an organochlorine pesticide, produces a\nprofound G1-arrest in MCF-7 cells (Kalantzi et al., 2004).\nAfter lindane removal, treated cells escape G1-arrest and\nwould probably re-enter an exponential growth phase. Sim-\nilarly significant fluctuations in the percentages of cells in\nG2-phase are not observed (Table 1).\nFig. 1 shows a typical absorption spectrum of a sample of\nMCF-7 cells after 24-h culture. Vibrational bands, associated\nwith spectral regions, where significant differences of\ninterest might occur include the amide I (\u00031650 cm\u00021),\namide II (\u00031540 cm\u00021), glycoproteins and acyl chain of\nlipids (ds CH3, \u00031380 cm\u00021), amide III (\u00031260 cm\u00021),\ncarbohydrates (ds C-O, \u00031155 cm\u00021), RNA (\u00031120 cm\u00021),\nphosphodiester of nucleic acids (ns PO2\n\u0002, \u00031080 cm\u00021), ns\nCO-O-C (\u00031050 cm\u00021), and glycogen (ns C-O, \u00031030\ncm\u00021) (Jackson and Mantsch, 1996; Gazi et al., 2004). Also\nof reported interest is the absorption peak at 970 cm\u00021; this\nmay be indicative of the level of intracellular protein phos-\nphorylation (Tobin et al., 2004).\nFig. 2, a–c, shows the median IR spectra (2000–900 cm\u00021)\nof a maximum of 10 spectra recorded per cell culture sample.\nMarked variations in the DNA\/RNA spectral region (\u00031490–\n1000 cm\u00021) that correlate with alterations in cell-cycle distri-\nbutions are apparent. A time-related reduction in spectral in-\ntensity was observed in this region suggesting that, as cells\ntransit from the exponential-growth phase (S- and G2\/\nM-phase) into the more quiescent G1-phase (Table 1), bulk\nchanges in intracellular biomolecules are spectrally observable\n(Fig. 2 a). Further reductions in intensity in the presence of\nlindane after 48 h and 96 h incubation compared to median\nspectra obtained in the absence of this test agent at the same\nTABLE 1 Cell cycle distributions in the absence or presence\nof lindane\nIncubation treatment (h) G1-phase (%) S-phase (%) G2-phase (%)\nDisaggregated cell\npopulation\n60.7 6 3.5 30.3 6 1.0 9.1 6 2.6\n24 h 32.3 6 2.2 47.7 6 3.9 20.1 6 3.3\n48 h 45.3 6 3.5 39.9 6 3.5 14.8 6 2.2\n24 h 1 24 h lindane\n(48 h plus lindane)\n63.3 6 3.6 24.0 6 3.1 12.7 6 4.7\n96 h 66.0 6 4.3 26.4 6 3.5 7.9 6 1.7\n24 h, 24 h lindane 1 48 h\n(96 h plus lindane)\n68.5 6 3.3 27.3 6 2.9 4.2 6 0.8\nA time course of the cell-cycle distributions of MCF-7 cells post seeding.\nCells were seeded and incubated, in the presence or absence of lindane, as\ndescribed in Materials and Methods. DNA content of 10,000 events per\nincubation treatment was analyzed using a Becton Dickinson FACSCaliber\nflow cytometer, as described in Materials and Methods. Results are the\nmean 6 SD of triplicate measurements from three separate experiments.\nEach experiment concerned triplicate measurements for each incubation\ntreatment; these were combined to give a mean that contributed to the\noverall mean.\nFIGURE 1 Spectral regions of interest, annotated in a typical absorption\nspectrum (2000–900 cm\u00021) of MCF-7 cells after 24-h incubation. Cells were\nseeded into 60-mm petri dishes containing glass coverslips and fixed before\nanalysis, as described in the Materials and Methods.\nCell Cycle Monitoring by PTMS 3701\nBiophysical Journal 88(5) 3699–3706\ntime points were observed (Fig. 2, b and c); again, primarily in\nthe DNA\/RNA spectral region (\u00031490–1000 cm\u00021).\nIntrasample spectral variations are shown in Fig. 3, a–e. In\nexponentially growing cell populations (Fig. 3 a) marked\nvariations in spectral intensities were observed at 24 h, which\nare most apparent in the intensity of the amide I band (\u00031650\ncm\u00021) and the centroid position of the amide II band (\u00031540\ncm\u00021). Such intrasample variations in IR signatures diminish\nin a time-related fashion with incubation (48 h and 96 h).\nReductions in spectral intensity and variation across the\n1490–1000 cm\u00021 band appear to be accelerated at 48 h after\n24-h treatment with 10\u00024 M lindane (Fig. 3, b and c).\nAlthough lindane-treated 96-h cultures exhibit the greatest\noverall reductions in spectral intensity, an increase in spectral\nvariation was observed compared to untreated 96-h cultures\n(Fig. 3, d and e). Again, this is primarily in the DNA\/RNA\nspectral region (\u00031490–1000 cm\u00021) and may be the result of\nlonger-term lindane-induced cytotoxic effects.\nThe band intensity at 970 cm\u00021 becomes less pronounced\nas cells transit from the exponential-growth phase (S- and\nG2\/M-phase) into the more quiescent G1-phase (Fig. 3, a–e).\nA peak at this band has been associated with protein\nphosphorylation (Sanchez-Ruiz and Martinez-Carrion, 1988;\nTobin et al., 2004); as such it could be expected to be ele-\nvated in actively dividing compared to resting cells.\nBy comparing absorption spectra using the Mann-\nWhitney U test to generate probability diagrams, significant\ndifferences (P , 0.05) in different regions of the spectra\nwere observed after the analysis of different incubation\ntreatments (Fig. 4, a–c). Fig. 4 a suggests that, although\nabsorption spectra from exponentially growing cells after\n24-h and 48-h incubation are mostly similar, significant\ndifferences are observed throughout the spectrum as cell\ngrowth slows down. Such significant differences point to\ntrue structural alterations within exponentially growing cells\nwhen compared to quiescent populations. Further significant\ndifferences were observed after incubation in the presence of\nlindane at 48 h, primarily in the DNA\/RNA spectral region\n(\u00031490–1000 cm\u00021), and 96 h (\u00032000–900 cm\u00021) com-\npared to corresponding untreated cultures (Fig. 3, b and c).\nHierarchical cluster analysis revealed marked separation\nof various spectrum groups (Fig. 5, a–d). This was especially\nevident in Fig. 5, b and c, 48 h vs. 96 h and 48 h vs. ‘‘48 h\nplus lindane’’ incubation treatments, respectively: except for\na single spectrum, perfect separation was observed between\nthese treatment groups. Although some clustering was also\nseen when comparing 24 h vs. 48 h and 96 h vs. ‘‘96 h plus\nlindane’’ incubation treatments, separation appeared to be\nless evident (Fig. 5, a and d).\nDISCUSSION\nMid-IR spectroscopy, commonly achieved using FTIR\nspectrometers, is an established analytical method for the\nidentification and characterization of molecular species in\nbiological systems (Jackson and Mantsch, 1996). Conven-\ntionally, the IR beam is detected optically in the far-field\nafter it has interacted with the sample (Lasch et al., 2002).\nAnalytical results are associated with a database of char-\nacteristic electromagnetic radiation energies or absorption\nwavelengths (Malins et al., 1997; Cohenford and Rigas,\n1998; Argov et al., 2002). This information is inferred in-\ndirectly across the entire electromagnetic spectrum by com-\nparing detected energies (transmitted through, scattered by or\nFIGURE 2 (a) Median IR spectra (2000–900 cm\u00021) of a maximum of 10\nrecorded per cell culture sample over a time course of 24 h, 48 h, and 96 h, as\nindicated. Cells were seeded into 60-mm petri dishes containing glass\ncoverslips and fixed before analysis, as described in the Materials and\nMethods. (b) Median IR spectra after 48-h incubation in the absence or\npresence of 24-h treatment with 10\u00024 M lindane. Cells were treated after an\ninitial 24-h incubation in lindane-free medium; whereupon they were\nimmediately fixed before analysis. (c) Median IR spectra after 96-h\nincubation in the absence or presence of 24-h treatment with 10\u00024 M\nlindane. After an initial 24-h incubation in lindane-free medium, cells were\ntreated with the agent for 24 h after which they were incubated in fresh\nmedium for a further 48 h. At the end of this 96-h incubation, they were\nimmediately fixed before analysis.\n3702 Hammiche et al.\nBiophysical Journal 88(5) 3699–3706\nreflected from the sample) with the range of energies con-\ntained in the incident beam. Usually, samples require some\npreparation before measurements.\nThe requirements for sample preparation are far less strict\nin photothermal, as compared to conventional, methods. The\nunderlying principle of photothermal methods is that\nabsorption of electromagnetic radiation results in heat\ngeneration, which can be measured by sensing the resulting\nsurface temperature increase. This approach has been mainly\nlimited to the photoacoustic technique (Wang, 2003). As the\nradiation is amplitude modulated, thermal waves are gener-\nated internally in the sample being examined. On reaching\nthe surface, these thermal waves generate acoustic waves,\nwhich propagate inside a photoacoustic cell to reach a mi-\ncrophone, in the far-field, where they are detected (Sikorska\net al., 2001). Our method permits a more direct measurement\nof temperature. Furthermore, because detection is in the\nnear-field, it allows, potentially, for a spatial resolution that is\nbetter than the diffraction limit. Even in applications where\nspatial discrimination is not required; our method has other\nadvantages over the various optical detection methods. For\nexample, samples that are opaque to IR radiation may be\ndifficult to analyze in transmission mode. For instance, cell\nnuclei may be strongly IR-absorbing (Tobin et al., 2004).\nReflection\/absorption methodologies require that samples be\ndeposited on special slides (Cohenford and Rigas, 1998;\nArgov et al., 2002, Tobin et al., 2004). Although another\nspectroscopic method, attenuated total reflection (ATR)\nFTIR, allows for spectrum collection regardless of sample\nthickness, it requires that the sample be sufficiently smooth\nor soft, so that the surface of the measuring crystal can be\nbrought within range of the evanescent wave (Chan and\nKazarian, 2003).\nMicrospectroscopy has the potential to objectively iden-\ntify abnormalities associated with particular disease states;\ndeviations from characteristic biochemical fingerprints\n(vibrational spectra) of particular tissues would point to the\npresence of abnormality (Hammiche et al., 2004a). If applied\nto large cell numbers such objective analysis could, hy-\npothetically, eliminate the potential for human error that\nsometimes occurs during diagnostic screening. The delivery\nof such an approach could have profound consequences in\nterms of screening for diseases such as cervical cancer\n(Cohenford and Rigas, 1998; Arbyn et al., 2004) and the\nelimination of false negatives, i.e., where disease is un-\nrecognized and subsequently becomes clinically invasive.\nFIGURE 3 (a) Intrasample spectral varia-\ntions obtained after 24-h incubation of MCF-\n7 cells seeded at a density of 105\/5 ml into\n60-mm petri dishes, as described in the\nMaterials and Methods. Cellular material was\nfixed before recording absorption spectra\nwith a Wollaston wire probe tip. (b) Intra-\nsample spectral variations obtained after 48-h\nincubation. (c) Intrasample spectral variations\nobtained after 48-h incubation in the presence\nof a 24-h treatment with lindane. (d) Intra-\nsample spectral variations obtained after 96-h\nincubation. (e) Intrasample spectral variations\nobtained after 96-h incubation in the presence\nof a 24-h treatment with lindane.\nCell Cycle Monitoring by PTMS 3703\nBiophysical Journal 88(5) 3699–3706\nMany disease states require close monitoring over time and\nan archived tissue resource would be useful for intra-\nexperimental comparative purposes. The first priority for\nsuch a diagnostic tool is preparation to prevent self-\ndestruction or autolysis of tissue; required to preserve tissue\nintegrity, it should not be confused with sample preparation\nfor analysis. Fixation of samples before analysis, itself an\nartifact, is necessary to archive tissues before transport to\ndiagnostic laboratories. Previously published studies have\nadopted elaborate methodologies, such as tissues from\nparaffin-embedded blocks that were sectioned and mounted\non ZnSe or BaF2 windows before dewaxing (Argov et al.,\n2002; Gazi et al., 2004), tissues frozen on resection and\ncryomicrotomed onto such windows before air-drying\n(Tobin et al., 2004), exfoliative cytology in preservative\nbefore application to windows (Cohenford and Rigas, 1998),\nor even the biomonitoring of viable cells (Holman et al.,\n2000) or cells air-dried (Salman et al., 2003) on ZnSe\nwindows. In contrast, we have simply used 70% EtOH to fix\nFIGURE 4 (a) Plot depicting the statistical significance, as calculated by\nthe Mann-Whitney U test, of differences at each wavenumber in the spectra\nfor 24 h vs. 48 h and 48 h vs. 96 h incubation time, as indicated. (b) Plot\ndepicting the statistical significance in the spectra for 48 h vs. 48 h plus\nlindane. (c) Plot depicting the statistical significance in the spectra for 96 h\nvs. 96 h plus lindane. A P , 0.05 was selected as indicating significance.\nFIGURE 5 (a) Dendrogram showing hierarchical cluster analysis (HCA),\nbased on a Euclidean distance metric to nearest neighbor, of absorption\nspectra derived from analysis of cellular material after 24-h incubation (A-1 to\nA-6, in black) compared to 48-h incubation (B-1 to B-10, shaded). Individual\nspectra are numbered on the ordinate axis. (b) Dendrogram showing HCA of\ncellular material after 48-h incubation (B-1 to B-10, in black) compared to\n96-h incubation (D-1 to D-8, shaded). (c) Dendrogram showing HCA of\ncellular material after 48-h incubation (B-1 to B-10, in black) compared to 48-\nh incubation in the presence of a 24-h treatment with lindane (C-1 to C-8,\nshaded). (d) Dendrogram showing HCA of cellular material after 96-h\nincubation (D-1 toD-8, in black) compared to 96-h incubation in the presence\nof a 24-h treatment with lindane (E-1 to E-8, shaded).\n3704 Hammiche et al.\nBiophysical Journal 88(5) 3699–3706\ncells in situ. Based on staining quality and preservation of\ntissue architecture, EtOH- and formalin-fixed tissues have\nbeen noted to retain their architectural features in a superior\nfashion to frozen tissues (Gillespie et al., 2002). More\nimportantly for this study, Gillespie et al. (2002) noted that\nEtOH-fixation, when compared to formalin-fixation, consis-\ntently allowed for better visual identification, using micros-\ncopy, of prostate-epithelial-cell nuclear detail; this permitted\nmore accurate grading of hyperplastic, premalignant, and\ntumor cell nuclei. EtOH fixation through reversible pre-\ncipitation appears not to induce denaturing effects (Sainte-\nMarie, 1962) and will rapidly dehydrate and preserve the\nintegrity of cellular material. In our hands, analysis of cellular\nmaterial using PTMS suggested that our samples were stable\nover long periods of time (;6 months, data not shown).\nThe use of photothermal probes potentially allows higher-\nthan-the-diffraction-limit nanospatial resolution of molecular\nspecies (Hammiche et al., 2004b). The first objective of our\nstudy was to determine whether clear vibrational IR spectra\ncould be obtained after the analysis of cellular material using\nPTMS. Figs. 2 and 3 clearly show this to be the case and\nappear to be the first report of its kind in the literature. The\norigin of apparent spectral changes associated with cell-cycle\nkinetics remains ambiguous (Holman et al., 2000; Tobin\net al., 2004) and to resolve this issue breast carcinoma MCF-\n7 cells were examined using PTMS over a time course pass-\ning from an exponential-growth phase to a quiescent state\n(Figs. 2 and 3). Clear elevations in the intensity of DNA\/\nRNA spectral regions and a pronounced peak at 970 cm\u00021\nwere associated with cell populations predominantly in S- or\nG2\/M-phase in comparison to less-proliferative G1 cells. The\nfurther reductions in spectral intensity seen after examination\nof cells treated with 10\u00024 M lindane is further proof that cell-\ncycle effects may be successfully monitored using PTMS.\nResistance thermometry is based on the temperature de-\npendence of the resistance of a suitable sensing element. The\nplatinum-rhodium wire is characterized by the following\nprobe resistance versus temperature function:\nRp ¼ R0ððT \u0002 T0Þa1 1Þ;\nwhere a ¼ 0.00165 9V\/V-\u0003C is the temperature coefficient\nof 90% platinum-10% rhodium material, T0 is room tem-\nperature, R0 is resistance of the element at room temperature\nand Rp the measured resistance. The element resistance is\ndetermined by passing a current through it and measuring the\nvoltage induced across it. Each \u0003C increase results in an\nincrease in resistance of 0.00165 3 R0. The corresponding\nvoltage is 0.00165 3 R0 3 I. Therefore sensitivity is:\n0.00165\u0003C\/V (probe resistance) per milliamp (bias current).\nSensitivity can therefore be improved by increasing the\nlength of the filament and\/or by increasing bias current. If\nspatial resolution is not of importance, the size of the\nfilament can be increased (although Johnson noise has to be\ntaken into account). Bias current can be increased up to the\npoint where Joule heating does not affect the sample\nmaterial. It should also be noted that heating increases with\npower dissipated, therefore with both resistance (hence size\nof the element) and current. As an illustration, the sensitivity\nof the probe used here (2.5 V resistance) is 4 mV per \u0003C per\nmilliamp bias current. The overall sensitivity of a probe\nmade of the same material is 1.6 mV per \u0003C per ohm (probe\nresistance) per milliamp (bias current).\nAlthough these results were derived from a relatively\nsmall number of measurements, our experiment was set up\nusing a relatively insensitive probe (individual spectra of\nsome tens of cells with a maximum of 10 spectra per cell\nculture contributing to each median spectra). The highly\nsignificant differences in spectral regions (Fig. 4) and the\ndiscrimination between clusters (Fig. 5) strongly suggest that\nsignificant structural changes within exponentially growing\ncells compared to quiescent cells are observable using\nPTMS. Future plans for the development of a methodology\nfor high resolution IR analysis (subcellular) will require the\nuse of probes with a much smaller sensing element than that\nused in this initial study, i.e., of the order of a few tens of\nnanometers. Micromachined probes with a sensing element\n150 nm in size have been used but small probe size is not\nsufficient. Spatial resolution also depends on thermal\ndiffusion length, therefore on IR beam modulation fre-\nquency. For instance, an organic material such as a typical\npolymer is characterized by a thermal diffusion length of\n;700 nm at 100 kHz modulation frequency and;200 nm at\n1 MHz. However, the higher the modulation frequency the\nsmaller the amplitude of the temperature to be measured.\nHence the need to use a bright source to achieve acceptable\nSNR at these operating frequencies. To achieve subcellular\nspatial resolution, PTMS is being further developed by using\na micromachined sensor probe, adding an extra high\nfrequency modulation and adapted to accommodate a much\nbrighter IR light source from a synchrotron ring.\nThe characterization of conformational changes associated\nwith transcription and replication is of great importance\n(Khorasanizadeh, 2004). Our findings provide the first\nevidence that PTMS may be used to examine cell cycle-\nassociated intracellular structural changes. Such findings\nwould constitute a novel approach in the use of microspec-\ntroscopy.\nWe thank Dr. Nigel F. Fullwood for helpful discussions.\nThis study was primarily supported by the Engineering and Physical\nSciences Research Council, UK. Funding from the North West Cancer\nResearch Fund, UK (R.H.) is also acknowledged.\nREFERENCES\nArbyn, M., F. Buntinx, M. Van Ranst, E. Paraskevaidis, P. Martin-Hirsch,\nand J. Dillner. 2004. Virologic versus cytologic triage of women with\nequivocal Pap smears: a meta-analysis of the accuracy to detect high-\ngrade intraepithelial neoplasia. J. Natl. Cancer Inst. 96:280–293.\nArgov, S., J. Ramesh, A. Salman, I. Sinelnikov, J. Goldstein, H. Guterman,\nand S. Mordechai. 2002. Diagnostic potential of Fourier-transform\nCell Cycle Monitoring by PTMS 3705\nBiophysical Journal 88(5) 3699–3706\ninfrared microspectroscopy and advanced computational methods in\ncolon cancer patients. J. Biomed. Opt. 7:248–254.\nBoydston-White, S., T. Gopen, S. Houser, J. Bargonetti, and M. Diem.\n1999. Infrared spectroscopy of human tissue. V. Infrared spectroscopic\nstudies of myeloid leukemia (ML-1) cells at different phases of the cell\ncycle. Biospectroscopy. 5:219–227.\nBozec, L., A. Hammiche, H. M. Pollock, M. Conroy, J. M. Chalmers, N. J.\nEverall, and L. Turin. 2001. Localized photothermal infrared spectros-\ncopy using a proximal probe. J. Appl. Phys. 90:5159–5165.\nChan, K. L., and S. G. Kazarian. 2003. New opportunities in micro- and\nmacro-attenuated total reflection infrared spectroscopic imaging: spatial\nresolution and sampling versatility. Appl. Spectrosc. 57:381–389.\nCohenford, M. A., and B. Rigas. 1998. Cytologically normal cells from\nneoplastic cervical samples display extensive structural abnormalities on\nIR spectroscopy: implications for tumor biology. Proc. Natl. Acad. Sci.\nUSA. 95:15327–15332.\nDavis, C., S. Bhana, A. J. Shorrocks, and F. L. Martin. 2002. Oestrogens\ninduce G1 arrest in benzo[a]pyrene-treated MCF-7 breast cells whilst\nenhancing genotoxicity and clonogenic survival. Mutagenesis. 17:\n431–438.\nDiem, M., S. Boydston-White, and L. Chiriboga. 1999. Infrared\nspectroscopy of cells and tissues: shining light onto a novel subject.\nAppl. Spectrosc. 53:148A–161A.\nGazi, E., J. Dwyer, N. Lockyer, P. Gardner, J. C. Vickerman, J. Miyan, C.\nA. Hart, M. Brown, J. H. Shanks, and N. Clarke. 2004. the combined\napplication of FTIR microspectroscopy and ToF-SIMS imaging in the\nstudy of prostate cancer. Faraday Discuss. 126:41–59.\nGillespie, J. W., C. J. Best, V. E. Bichsel, K. A. Cole, S. F. Greenhut, S. M.\nHewitt, M. Ahram, Y. B. Gathright, M. J. Merino, R. L. Strausberg, J. I.\nEpstein, S. R. Hamilton, G. Gannot, G. V. Baibakova, V. S. Calvert,\nM. J. Flaig, R. F. Chuaqui, J. C. Herring, J. Pfeifer, E. F. Petricoin, W.\nM. Linehan, P. H. Duray, G. S. Bova, and M. R. Emmert-Buck. 2002.\nEvaluation of non-formalin tissue fixation for molecular profiling studies.\nAm. J. Pathol. 160:449–457.\nGreene, J. and M. D’Oliveira. 1989 Learning to Use Statistical Tests in\nPsychology. Open University Press, Milton Keynes, UK.\nHammiche, A., L. Bozec, M. J. German, J. M. Chalmers, N. J. Everall, G.\nPoulter, M. Reading, M. Reading, D. B. Grandy, F. L. Martin, and\nH. M. Pollock. 2004a. Mid-infrared microspectroscopy of difficult\nsamples using near-field photothermal microspectroscopy. Spectroscopy.\n19:20–42.\nHammiche, A., L. Bozec, H. M. Pollock, M. German, and M. Reading.\n2004b. Progress in near-field photothermal infra-red microspectroscopy.\nJ. Microsc. 213:129–134.\nHolman, H. Y, M. C. Martin, E. A. Blakely, K. Bjornstad, and W. R.\nMcKinney. 2000. IR spectroscopic characteristics of cell cycle and cell\ndeath probed by synchrotron radiation based Fourier transform IR\nspectromicroscopy. Biopolymers. 57:329–335.\nJackson, M., and H. H. Mantsch. 1996. Biomedical infrared spectroscopy.\nIn Infrared Spectroscopy of Biomolecules. H. H. Mantsch and D.\nChapman, editors. Wiley-Liss, New York. 311–340.\nKalantzi, O. I., R. Hewitt, K. J. Ford, L. Cooper, R. E. Alcock, G. O.\nThomas, J. A. Morris, T. J. McMillan, K. C. Jones, and F. L. Martin.\n2004. Low-dose induction of micronuclei by lindane. Carcinogenesis.\n25:613–622.\nKhorasanizadeh, S. 2004. The nucleosome: from genomic organization to\ngenomic regulation. Cell. 116:259–272.\nLasch, P., A. Pacifico, and M. Diem. 2002. Spatially resolved IR micro-\nspectroscopy of single cells. Biopolymers. 67:335–338.\nMalins, D. C., P. M. Johnson, E. A. Barker, N. L. Polissar, T. M. Wheeler,\nand K. M. Anderson. 2003. Cancer-related changes in prostate DNA as\nmen age and early identification of metastasis in primary prostate tumors.\nProc. Natl. Acad. Sci. USA. 100:5401–5406.\nMalins, D. C., N. L. Polissar, and S. J. Gunselman. 1997. Infrared spectral\nmodels demonstrate that exposure to environmental chemicals leads to\nnew forms of DNA. Proc. Natl. Acad. Sci. USA. 94:3611–3615.\nMcHugh, B., and M. M. S. Heck. 2003. Regulation of chromosome\ncondensation and segregation. Curr. Opin. Genet. Dev. 13:185–190.\nMoggs, J. G., J. I. Goodman, J. E. Trosko, and R. A. Roberts. 2004.\nEpigenetics and cancer: implications for drug discovery and safety\nassessment. Toxicol. Appl. Pharmacol. 196:422–430.\nPollock, H. M., and A. Hammiche. 2001. Micro-thermal analysis:\ntechniques and applications. J. Phys. D Appl. Phys. 34:R23–R53.\nSainte-Marie, G. 1962. A paraffin embedding technique for studies\nemploying immunofluorescence. J. Histochem. Cytochem. 10:250–256.\nSalman, A., J. Ramesh, V. Erukhimovitch, M. Talyshinsky, S. Mordechai,\nand M. Huleihel. 2003. FTIR microspectroscopy of malignant fibroblasts\ntransformed by mouse sarcoma virus. J. Biochem. Biophys. Methods.\n55:141–153.\nSanchez-Ruiz, J. M., and M. Martinez-Carrion. 1988. A Fourier-transform\ninfrared spectroscopic study of the phosphoserine residues in hen egg\nphosvitin and ovalbumin. Biochemistry. 27:3338–3342.\nSikorska, A., B. J. Linde, and J. I. Kukielski. 2001. The effect of solvent\npolarity on photo-acoustic spectra of alkyl-cyanobiphenyl derivatives.\nJ. Opt. A: Pure Appl. Op. 3:S71–S76.\nTobin, M. J., M. A. Chesters, J. M. Chalmers, F. J. M. Rutten, S. E. Fisher,\nI. M. Symonds, A. Hitchcock, R. Allibone, and S. Dias-Gunasekara.\n2004. Infrared microscopy of epithelial cancer cells in whole tissues and\nin tissue culture, using synchrotron radiation. Faraday Discuss. 126:\n27–39.\nWang, L. H. V. 2003. Ultrasound-mediated biophotonic imaging: A review\nof acousto-optical tomography and photo-acoustic tomography. Dis.\nMarkers. 19:123–138.\nWatrin, E., and V. Legagneux. 2003. Introduction to chromosome\ndynamics in mitosis. Biol. Cell. 95:507–513.\nWolffe, A. P. 1997. Chromatin: Structure and Function. Academic Press,\nNew York.\nYared, E., T. J. McMillan, and F. L. Martin. 2002. Genotoxic effects of\noestrogens in breast cells as detected by the micronucleus assay and the\nComet assay. Mutagenesis. 17:345–352.\n3706 Hammiche et al.\nBiophysical Journal 88(5) 3699–3706\n"}