{"doi":"10.1080\/09500690802226062","coreId":"65195","oai":"oai:dro.dur.ac.uk.OAI2:6635","identifiers":["oai:dro.dur.ac.uk.OAI2:6635","10.1080\/09500690802226062"],"title":"A conflict in your head : an exploration of trainee science teachers' subject matter knowledge development and its impact on teacher self-confidence.","authors":["Kind,  V."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-07-01","abstract":"Teachers' subject matter knowledge (SMK) is one factor contributing to teaching 'successfully', as this provides a basis from which pedagogical content knowledge develops. UK-based trainee science teachers teach all sciences to age 14 and often up to age 16. Trainees have specialist science knowledge in chemistry, physics, or biology from their degrees. Other sciences may not have been studied since school. Thus, trainee science teachers often teach 'outside specialism'. The extent to which teaching within and outside specialism influences successful teaching, ensuring learning objectives are achieved, was investigated. The sources seventy-one trainees use for preparing within and outside specialism science lessons for 11-14-year-olds and 14-16-year-olds and effects on teacher self-confidence of working in these two domains were probed by questionnaire and interview. All trainees responded to open and closed questions, and Likert-scale statements exploring preferences for teaching, self-confidence, handling subject-related questions within and outside specialism, and attitudes towards learning new SMK. A subgroup of 12 trainees participated in individual semi-structured interviews. The results are counter-intuitive: trainees teach more successful lessons outside their specialism, particularly in the early stages. This relates to using a richer range of SMK sources, including, crucially, advice from experienced colleagues. Within specialism, trainees report an inability to select appropriate knowledge and\/or strategies and a sense of conflict in teaching inaccurate information. Some 'anxious' trainees rely heavily on extant materials for outside specialism teaching. 'Super-confident' trainees able to teach any science focus on selection of appropriate instructional strategies and realise early on the need to transform SMK","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65195.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6635\/1\/6635.pdf","pdfHashValue":"82104537ed0f1971df821eafc5cf45f00fdc1da9","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6635<\/identifier><datestamp>\n      2011-12-14T09:31:24Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A conflict in your head : an exploration of trainee science teachers' subject matter knowledge development and its impact on teacher self-confidence.<\/dc:title><dc:creator>\n        Kind,  V.<\/dc:creator><dc:description>\n        Teachers' subject matter knowledge (SMK) is one factor contributing to teaching 'successfully', as this provides a basis from which pedagogical content knowledge develops. UK-based trainee science teachers teach all sciences to age 14 and often up to age 16. Trainees have specialist science knowledge in chemistry, physics, or biology from their degrees. Other sciences may not have been studied since school. Thus, trainee science teachers often teach 'outside specialism'. The extent to which teaching within and outside specialism influences successful teaching, ensuring learning objectives are achieved, was investigated. The sources seventy-one trainees use for preparing within and outside specialism science lessons for 11-14-year-olds and 14-16-year-olds and effects on teacher self-confidence of working in these two domains were probed by questionnaire and interview. All trainees responded to open and closed questions, and Likert-scale statements exploring preferences for teaching, self-confidence, handling subject-related questions within and outside specialism, and attitudes towards learning new SMK. A subgroup of 12 trainees participated in individual semi-structured interviews. The results are counter-intuitive: trainees teach more successful lessons outside their specialism, particularly in the early stages. This relates to using a richer range of SMK sources, including, crucially, advice from experienced colleagues. Within specialism, trainees report an inability to select appropriate knowledge and\/or strategies and a sense of conflict in teaching inaccurate information. Some 'anxious' trainees rely heavily on extant materials for outside specialism teaching. 'Super-confident' trainees able to teach any science focus on selection of appropriate instructional strategies and realise early on the need to transform SMK. <\/dc:description><dc:publisher>\n        Taylor & Francis<\/dc:publisher><dc:source>\n        International journal of science education, 2009, Vol.31(11), pp.1529-1562 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6635<\/dc:identifier><dc:identifier>\n        issn:0950-0693<\/dc:identifier><dc:identifier>\n        issn: 1464-5289<\/dc:identifier><dc:identifier>\n        doi:10.1080\/09500690802226062<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6635\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/09500690802226062<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6635\/1\/6635.pdf<\/dc:identifier><dc:rights>\n        This is an electronic version of an article published in Kind, V. (2009) 'A conflict in your head : an exploration of trainee science teachers' subject matter knowledge development and its impact on teacher self-confidence.', International journal of science education., 31 (11). pp. 1529-1562. International journal of science education is available online at: http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/09500690802226062\\ud\n\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0950-0693","0950-0693"," 1464-5289","issn: 1464-5289"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n16 April 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKind, V. (2009) ’A conflict in your head : an exploration of trainee science teachers’ subject matter knowledge\ndevelopment and its impact on teacher self-confidence.’, International journal of science education., 31 (11).\npp. 1529-1562.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/09500690802226062\nPublisher’s copyright statement:\nThis is an electronic version of an article published in Kind, V. (2009) ’A conflict in your head : an exploration of\ntrainee science teachers’ subject matter knowledge development and its impact on teacher self-confidence.’,\nInternational journal of science education., 31 (11). pp. 1529-1562. International journal of science education is\navailable online at: http:\/\/www.informaworld.com\/smpp\/content db=all?content=10.1080\/09500690802226062\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \n \n 2 \nIntroduction  \n  \nBackground and context  \n \nThe means by which teacher education systems ensure that secondary science teachers are \nwell-prepared and appropriately trained for their work in science classrooms is a significant topic \nof international debate (Abell, 2000, 2007). One issue is how best to equip trainee science \nteachers with the scientific SMK required for teaching, given evidence that possession of “good” \nSMK influences teacher effectiveness positively (Abell, 2007, Geddis, et al, 1993; Lederman et \nal, 1994). This paper contributes to the discussion by offering perspectives from pre-service \nscience teachers‟ (“trainees”) experiences of training on an intensive, full-time course taking \nplace over an extended academic year. Specifically, this paper explores the extent to which \ntrainees‟ subject matter knowledge (SMK) in science influences their self-confidence for \nteaching: trainees are graduates in specific science disciplines, such as biology, chemistry, \nphysics, astronomy, geology and others, but are required to teach all sciences to 11-14s while \ntraining and, often, while working in UK state-funded secondary schools. An investigation of \nsources employed by trainee science teachers to develop their SMK for teaching is reported, \ntogether with the potential impact SMK may have on confidence in relation to their classroom \npractice. The study thus contributes to discussion of the role SMK plays in teacher development.  \n \nThe work also contributes to the ongoing debate as to whether science should be split into its \ninternal disciplines for teaching purposes. By way of illustration, discussion is ongoing in the UK, \nfor example, as to whether or not physics should be taught by specialist physicists, chemistry by \nchemists and biology by biologists. For example, a lobbying group, the Campaign for Science \nand Engineering in the UK (CaSE) argues: \n \n“Children need to be taught by specialist [science] teachers. Teachers‟ qualifications predict \nteaching quality and are the second greatest predictor of performance in physics after pupil \nability” (CaSE Opinion Forum, May 2007)  \n \nSimilarly, the Royal Society of Chemistry (RSC), a professional organisation representing \nchemists internationally, states:  \n \n“The best teachers are those who have specialist subject knowledge and a real passion and \nenthusiasm for the subject they teach…. The RSC believes that young people deserve to be \ntaught the sciences by subject specialists” (Royal Society of Chemistry, 2004)  \n \nThese views are set against a factual background showing considerable imbalance in the \nproportions of science teachers with physics, chemistry and biology degrees. A 2006 UK \nGovernment report showed that 25% of UK science teachers (in a sample of 2756) hold degrees \nin biology or biology-related subjects, compared to 16% with chemistry degrees and 10% with \nphysics degrees. Of the remainder, 47% hold degrees in other science subjects or possess \nteaching qualifications in general science, while 2% have no science degree (Moor, Jones, \nJohnson, Martin, Cowell and Bojke, 2006). Social status also plays a part: in schools with higher \nthan average examination results and lower than average numbers of children receiving free \n 3 \nschool meals (a standard indicator of high social need) more science teachers held specialist \ndegrees in physics, chemistry and biology (Moor et al, 2006).  \n \nHence, establishing factors shaping how trainee science teachers teach within and outside their \nspecialist subjects would contribute to enhancing science teacher education.  \n \nThe study is situated in the Shulman paradigm in which subject matter knowledge (SMK) is \nperceived as separate from but essential to teachers‟ pedagogical content knowledge (PCK). \nShulman (1986a, b) proposed that teachers “transform” SMK for their students using PCK, a \npowerful model that has been re-interpreted widely (for example, Marks, 1990; Magnusson et al, \n1999; Carlsen, 1999).  \n \nThis paper takes the view that in describing a lesson as “successful”, the teacher‟s ability to \ntransform SMK is significant. Evidence presented below shows that trainee science teachers‟ \nperceptions of their teaching as “successful” varies: some appear to consider a lesson as a \n“success” when they transmit knowledge, expressing confidence in the sense of personal \nsurvival when they understand the SMK for a specific lesson and can answer subject-related \nquestions. Others take a “transforming” approach, perceiving “success” as finding good activities \nthat help children learn, placing personal mastery of SMK as a secondary concern. Trainees‟ \ndevelopment of SMK for personal “survival” or “transformation” may vary according to whether \nteaching takes place within and outside subject specialism. Given the accepted wisdom that \nscience teachers teach their specialisms most successfully, a reasonable hypothesis is that \nwithin specialism lessons would generate fewer trainees relying on “survival” and more \n“transformation”. Data are presented that contradict this, suggesting that in the initial stages at \nleast, some trainees were more confident and taught more successful lessons when teaching \noutside their specialist subjects.  \n \n \nThe English and Welsh initial teacher education context \n \nThe study took place in a University in northern England, using trainees attending an initial \nteacher education (ITE) course, the “Postgraduate Certificate in Education” (PGCE). Obtaining a \nPGCE constitutes the major route into secondary school teaching. The PGCE is an intensive \nprogramme requiring nine months of full-time study from September – June. The course \ncombines school-based practice (24 weeks) and Higher Education Institution (HEI)-based work \n(12 weeks). All participants are graduates with a Bachelor‟s degree in a subject linked closely to \na National Curriculum (DfES, 2004) subject. In science, trainees‟ degree subjects dictate their \nteaching subject specialisms of chemistry, physics, or biology. A majority of trainees have \nbackgrounds in biology or biology-related subjects, and little or no post-16 education in either \nphysics and\/or chemistry. Trainees‟ minimum age is 21, so at least five years and for many, ten \nyears have passed since these sciences were studied.  \n \nThe National Curriculum for science stipulates the content of 11-16 science courses taught in \nstate-funded secondary schools. Pupils‟ learning is measured by tests taken at age 14 and 16. \nHence, teaching divides into topics for 11-14s (Key Stage 3) and 14-16s (Key Stage 4). To \ndeliver the curriculum, school science teachers write “Schemes of Work” (SoWs), giving precise \n 4 \ndetails of lessons, often based on published materials and textbooks. Teachers are expected to \nteach all aspects of science to 11-14s and, frequently, 14-16s regardless of their subject \n“specialism”; hence, this is also expected of trainees. During the school-based practice, trainees \nteach 11-16s and, exceptionally, 16-18s in two different schools located within 50 miles (80 km) \nof the university. Trainees are often expected to follow schools‟ defined schemes of work, but \nmay have freedom to develop their own lessons or parts of lessons.  Trainees participated in \nforty-five hours of HEI-based sessions to develop their SMK for teaching specific science topics \nat Key Stage 3 and Key Stage 4. Topics included electricity, forces, chemical reactions, energy, \nwaves, ecosystems, the genome, Earth and space, substances and investigations. Materials for \nuse when teaching were provided with details of experiments and potential misconceptions. \nTrainees were introduced to science education research through these sessions and also by \npreparing a written assignment.  \n \nLiterature review \n \nThe role of SMK  \n \nThe notion that possession of good SMK is an essential component of effective teaching has \nbeen demonstrated in a number of research studies, including those by Shulman (1986b, 1987) \nand those reviewed by Abell (2007) and Gess-Newsome (1999). A useful summary of the \nposition and value ascribed to SMK in teaching is provided by Carré (1998):-  \n \n“The more you know about science, the more you will be able to provide a framework to help \nchildren think in scientific ways; in so doing you will also represent the subject with integrity” (p \n103)  \n \nHashweh‟s (1987) work with six experienced science teachers offers evidence for this. He found \nthat “knowledgeable” teachers had more detailed knowledge of the topic being taught, \ndemonstrated wider knowledge of the same subject, and were more readily able to relate a topic \nto other aspects of the subject. More specifically, Hashweh reported that possessing good SMK \npositively affected a range of aspects considered essential to good science teaching. These \nincluded teachers‟ abilities to transform material for delivery in lessons by planning novel \nactivities and their responses to critical incidents in the classroom. Knowledgeable teachers \nposed higher cognitive level questions while “unknowledgeable” teachers asked for recall and \nrelied heavily on textbook information. Sanders, Borko and Lockard (1993) followed the teaching \nof three experienced secondary science teachers working within and outside specialism. \nAlthough general pedagogical practices were similar in both domains, when teaching within \nspecialism teachers talked less, involved students more and selected “riskier” activities.  \n \nAn exploration of research relating to the precise role played by SMK in teacher development \nyields a varied picture. De Jong (2000) and van Driel et al (2002) provide evidence that good \nSMK helps trainees be more readily aware of students‟ difficulties, a key aspect of Shulman‟s \nmodel for PCK. In a highly specialised but extremely thorough study, Davis (2003) indicates that \ngood SMK helps trainees select appropriate instructional strategies, also a feature of Shulman‟s \nPCK model. Thirdly, Markic et al (2006) indicate that SMK contributes to teachers‟ orientations \ntowards teaching and beliefs about science. All these factors are likely to vary according to \n 5 \nwhether trainees are working within and outside their subject specialisms – for example, a \nphysics specialist teaching biology topics may find it more difficult to select appropriate \ninstructional strategies and be less aware of students‟ difficulties than a biologist teaching the \nsame topic. As an indication of the possible effects of outside specialism teaching, Carlsen‟s \n(1993)  study of four trainee biology teachers found that when teaching an unfamiliar topic, \nparticipants tended to talk more often, for longer periods of time, asked questions frequently and \nrelied heavily on low cognitive level questions.  \n \nMisconceptions about science concepts are a significant concern for science education \nresearchers. In terms of educating science teachers, learning outcomes related to \nmisconceptions achieved by trainees may differ, depending on whether a lesson is being taught \nwithin or outside specialism. A biology lesson taught by a physicist may be less satisfactory than \nthe same lesson taught by a biology specialist, as the physics trainee may have similar \nmisconceptions to the children being taught. Sanders (1993) explored the views of South African \nbiology teachers about respiration, finding that many seemed to hold misconceptions about \nbasic principles within this topic. However, the study did not distinguish between specialist and \nnon-specialist biology teachers.  \n \nBesides these specifically SMK related issues, other research evidence indicates that \nspecialised support helps trainee science teachers develop positively (Luft et al, 2003). In the \npresent system, each trainee teacher is provided with an experienced science teacher as a \n“mentor” to assist them on teaching practice, as well as a university tutor. Mentors help trainees \ngain access to additional support within school science departments and hold regular (usually \nweekly) one-to-one meetings with trainees. Despite mentors‟ and tutors‟ good intentions, Youens \nand McCarthy (2007) found that trainees tend not to use mentors and university tutors as \nsources for SMK development, due to awareness of their roles in assessing progress. Trainees \nthink that asking for help may imply they are failing. This perception may impact on trainees‟ \npreparation for and subsequent success in within and outside specialism teaching.  \n \nScience teachers’ perceptions of success, self- confidence and self-efficacy  \n \nThe influence of specialized support on teachers‟ confidence or “efficacy” has been investigated \nby Hoy and Spero (2005), who showed that positive effects are seen where this is effective. \nHowever, Youens and McCarthy‟s (2007) work shows that these may be negated in situations \nwhere a dual role is perceived –mentors and university tutors are involved in reporting on \ntrainees‟ progress, controlling whether they “pass” or “fail”,  as well as providing support. As \nmentioned above, the assessment role appears to dominate, as trainees forgo asking for \nsupport, in case this indicates weakness on their part. In which case, it would be valuable to \nknow what sources of SMK are used by trainee teachers and why these are selected, given that \nobvious collegial support is, at least by some, cast aside.  Further, any differences between SMK \nsources for within and outside specialism teaching may exist and these may impinge on \ntrainees‟ success in teaching and perceptions of success.  \n \nThe role of support and teacher self-confidence emerged as factors influencing success in \nteaching science among nine novice primary school teachers studied by Appleton and Kindt \n(1999). This study makes an interesting and significant connection between weak subject matter \n 6 \nknowledge and self-confidence, reporting that teachers lacked confidence to teach science and \nthat this seemed to be associated with limited background knowledge (p 160). Teachers‟ self-\nconfidence was negatively affected by believing that they had to be competent to answer \nchildren‟s subject-related questions.  In contrast to Youens and McCarthy‟s (2007) findings, once \nbeyond the bounds of a training experience, the teachers in this study found collegial support \nvaluable, providing, for example, the confidence to try new activities and teaching strategies and \nsupport for planning science teaching.   \n \nBorko, Lalik and Tomchin (1987) examined trainees‟ conceptions of “successful” teaching, \ncomparing journal writings of “stronger” and “weaker” novice teachers. They found that although \ntrainees generally agreed about what constitutes “successful” teaching, differences were \nobserved regarding “unsuccessful” teaching. By “successful”, trainees indicated they meant \nusing creative and novel activities, generating a variety of experiences for their students. \nPreparation of lessons with these characteristics involved going beyond the prescribed \ncurriculum and associated tasks. Trainees emphasized trying out new ideas, maintaining pace \nand handling behaviour issues effectively. When describing “unsuccessful” lessons, weaker \ntrainees focused more on behaviour issues and planning, while stronger trainees focused on a \nlack of creativity on their part.  \n  \nTeachers‟ beliefs about the potential influence of specific environmental factors on their science \nteaching were investigated by Lumpe, Haney and Czerniak (2000). These authors developed a \n“Context Beliefs About Teaching Science” (CBATS) instrument designed to assess the extent to \nwhich teachers beliefs about aspects of their work were positive or negative. They report that \nmore positive beliefs emerge among more experienced teachers, describing a majority as \nholding “robust, modest and tenacious” belief patterns (p 285). These sustain teachers when \nworking in frustrating circumstances, providing a structure that helps them function effectively in \nthe classroom. A minority were found to be “vulnerable, fragile and self-doubting”. The authors \ncomment that teaching may select against such weak profiles, and teachers possessing these \nbelief systems may leave the profession at an early stage.   \n \nGiven these previous studies, the possibility exists that trainees experience different levels of \nconfidence for teaching within and outside specialism, as well as using different sources to \ndevelop their SMK.  \n \nHypothesis and research questions  \n \nHence, this study investigates:  \n \n• What sources do trainee science teachers use for developing their subject matter \nknowledge for within and outside specialism teaching while on a ten month postgraduate \nteacher education course?  \n \n• To what extent is the confidence of trainee science teachers influenced by teaching within \nand outside their specialist subjects?   \n \n \n 7 \nMethodology  \n \nThe design of the study follows the tradition of interpretative and descriptive qualitative work \n(Merriam, 2002), although data were collected using both interviews and questionnaires. These \nmethods gave the best overview of trainees‟ experiences, providing an insight into the widest \npossible range of opinions and views within this context. The interviews were designed to \nvalidate questionnaire responses.  \n \nData were analysed to characterise trainees‟ attitudes and confidence relating to SMK for within \nand outside specialism teaching. Categories emerged from the data – a combination of \nresponses to open questions and Likert scale statements together with interview responses \nrevealed specific characteristics. These are discussed in detail below.  \n \nThe questionnaire  \nThe questionnaire, devised for this study (Appendix 1) comprised three probe types:-  \n \n Open questions (numbers 2 and 3) probed trainees‟ sources of SMK for preparing \nscience topics for teaching within and outside their specialist subjects  \n \n A closed question (number 4) invited trainees to rank preferred sources of subject \nknowledge from a pre-prepared list  \n \n Four sets of paired statements explored trainees‟ thinking about SMK and teacher \nconfidence using a five-point Likert scale. The pairs were named “Attitude” (A), \n“Preference” (P), “Confidence”(C) and “Handling questions” (H). For reference purposes, \nthese letters are shown against the statements in the questionnaire (Appendix 1).   \n \nThe components of the questionnaire were validated by discussion with colleagues.  \n \nIn addition, background information such as trainees‟ education, age and gender were collected.  \n \nThe interviews   \nIndividual interviews of approximately 30 minutes each were conducted using a semi-structured \nprotocol. The interviews collected data relating to the topics trainees had taught; sources used to \ndevelop SMK needed for teaching within and outside specialism; trainees‟ awareness of the \nimpact of their preparation on achievement of intended learning outcomes; and the extent to \nwhich their modes of subject matter knowledge acquisition and lesson preparation changed \nduring the PGCE course. \n \nQuestionnaires were administered in April 2006 and April 2007 after completion of all HEI-based \nsessions and towards the end of the main teaching placement. Interviews were conducted in \nJune 2006 and June 2007 when all parts of the course had been completed.   \n \nThe sample  \n \n 8 \nA total of 71 trainees completed the questionnaire. These comprised twenty-eight respondents \nfrom the 2005 – 2006 cohort and forty-three from 2006 – 2007. Maxima of forty (2005- 2006) \nand fifty-two (2006-2007) were possible – absences and fall-out from the course on the day of \ndata collection account for discrepancies. For reporting purposes, all respondents are treated as \none group – this is reasonable given that both cohorts had as identical experiences as possible. \n \nTwelve trainees were interviewed, divided 5:7 between the 2005- 2006 and 2006 – 2007 \ncohorts. The trainees were volunteers, but care was taken to ensure participants were as far as \npossible representative of all respondents in terms of subject specialism, age and gender.  \n \nData analysis  \n \nEach questionnaire was given a code number. The same codes were used to identify \ninterviewees to check for triangulation of responses between interview and questionnaire data.  \n \nBackground information  \n \nTrainees‟ background information was counted and used to generate the data in Table 1.  \n \nQuestionnaire  \n \nQuestionnaire responses were edited to establish the extent of completion and examined for any \ninaccuracies. All 71 trainees responded to the open questions, the closed question and paired \nstatements. Ten trainees mis-interpreted the ranking for the closed question (number 4 in \nAppendix 1) so their responses were excluded from the data (see Table 2, Total)  \n \nOpen question responses (questions 2 and 3) were coded by the researcher. A coding frame \nwas used to establish the range of responses offered. The same frame was applied to questions \n2 and 3 (see Appendix 1). Responses were grouped by:-  \n \n Trainees‟ subject specialism (drawn from background information)  \n Trainees‟ chosen topic  \n Trainees‟ stated preparation strategy\/ies \n Other information provided by the trainee  \n \nResponses from two trainees who gave only general comments relating to their school \ncircumstances and no information about preparation strategies were excluded. Thus, Table 3 \npresents data from 69 trainees.  \n \nThe preparation strategies described were grouped into the categories shown in Table 3. Other \ninformation, most often about teaching, included phrases such as “tried to break down the \ninformation into key sentences”.  \n \nFor example, Question 2 required trainees to name topic they had taught within specialism and \ndescribe SMK preparation. Three biology specialists named “Microbes and Disease” as their \ntopic. Two trainees cited “knowledge from degree” and one “knowledge from own University \n 9 \nresearch”.  These three responses appear in Table 3 as “Prior knowledge from University \ndegree or job”.  \n \nQuestion 3 required trainees to name a topic they had taught outside specialism and describe \nSMK preparation. Two biology specialists and one physics specialist named “Chemical \nreactions”. Their SMK strategies, with Table 3 “SMK source” in parentheses were: two cited \nteacher involvement (School colleague or other trainee teacher), two used the internet (Internet), \ntwo used school textbooks (Textbooks, school resource packs, teacher materials), one looked at \nan examination paper for the year group (Formal documentation), and two tried out experiments \nprior to the lessons (Other source).  \n \nResponses to the closed question, number 4 were counted and recorded against the suggested \nstrategies. These data are presented in Table 2.   \n \nThe paired statement analysis was done by counting systematically through all the responses, \nnoting the code numbers and background information for each respondent for each pair. Scores \n1 and 2 were summarised as “Agree” while 4 and 5 became “Disagree”. This generated a series \nof sub-groups for each response pair (see p 15 – 18). The background characteristics were \nexamined and compared with the data for the whole cohort (Table 1). Where marked differences \nwere observed, these were noted in the results.  \n \nFor example, in response to the “Preferences” pair, 8 trainees responded “agree” (Likert score 2 \non the questionnaire) or “strongly agree” (1) to “I prefer to teach topics in my specialism” and \nwere “neutral” (3) or disagreed (4, 5) with “I am pleased to teach topics in all areas of science”. \nAnalysis of the background information for this group showed that these respondents divided \nequally into male and female, had an average age of 29 and all except one held degrees at the \nstandard of 2:2 or better. This sub-group expressed “specialist” views, but revealed no \ncharacteristics that were markedly different from the whole group. Hence, the existence of the \ngroup was noted (see p 14) but no further comments could be made.  \n \nAnalysis of the “Confidence” pair showed a sub-group of 14 trainees who disagreed with “I am \nless confident when I teach outside my specialism” (Likert score 4 or 5) and agreed with “I do not \nneed to teach my specialism to feel confident as a teacher” (1 or 2). These trainees had two \nbackground characteristics that differed from those of the whole group. Six were aged 31 or \nover, comprising a significant proportion of the 16 trainees in this age group shown in Table 1. \nTwo others were aged 28 and 29. Four trainees (28%) were aged 21 -25 compared to 58% of \nthe whole cohort. Thus, the overall age profile of this sub-group is higher than that of the whole \ncohort. Ten of the fourteen, 71% were female (61% for the whole cohort). Seven held degrees in \nthe two highest classifications “1st” and “2:1”, a figure similar to that for the whole cohort. \nConsequently, comments to this effect are made in the results section (p 15).  \n \nInterviews  \n \nInterviewees were volunteers who knew the researcher as a PGCE course tutor. To ensure \ncomparability of responses, a standardised set of questions (LeCompte and Preissle, 1993) was \nprepared (Appendix 2). This was sent in advance to participants by email. No potential \n 10 \ninterviewee refused to attend having seen the questions. Interviewees were invited to bring \ndocumentation such as lesson plans and lesson evaluations for discussion. These were \nconsidered once responses to the standard questions were concluded.  \n \n Five questions triangulated responses to questionnaire questions (Q) and\/or paired statements \n(P, followed by reference letter) as follows:-  \n \nInterview  Q1 supports  questionnaire  Q1  \n  Q2     Q4 \n  Q3      Q2, 3  PA, PC   \n  Q4      Q2, 3   PP, PH \n  Q5      PP, PH \n \nThe purpose of question 6 was to illustrate the extent to which trainees‟ practice had altered \nduring the PGCE course and to serve as a means of validation: two months had elapsed \nbetween collection of questionnaire and interview data. Indicative responses to this question are \nprovided on p 23. Ten trainees referred only to their planning and preparation “speeding up” as \nthe course proceeded, noting no other changes. Two trainees (see p 23) specifically said no \nchanges had occurred.  \n \nInterviews lasted about 30 minutes each. Follow-up questions were posed in addition to the \nstandard ones where necessary to illuminate or clarify answers or to draw out more information \nwhen a trainee seemed shy or reluctant. Hence the format could in practice be described as \n“semi-structured”, as these varied according to the interviewee.  \n \nThe recorded interviews were transferred to ATLAS for analysis. Pseudonyms were devised for \neach trainee at this stage. A transcript was prepared from each interview. After transcription \ntrainees were matched against their questionnaires. Consistently excellent correspondence \ncould be ascertained between interview and questionnaire responses. To illustrate this, two \nquestionnaire response profiles are provided:-  \n \n \nMatthew, aged 38, Male, Physicist, 1st class degree   \n \nQuestionnaire Q2 response:- Light – I used subject revision guides to establish what the content \nshould be. My subject knowledge was already adequate  \n \nQuestionnaire Q3 response:- Cells – I read revision guides and subject books.  \n \nQuestionnaire Q4 response:- My strategies were the same apart from I researched in more \ndepth the cells topic  \n \nPaired statement responses:-  \n \nAttitudes:  Agree with “I enjoy learning…”  Disagree with “I find it difficult…”  \nPreference:   Agree with “I prefer to teach…”  Disagree with “I am pleased to teach…”  \n 11 \nConfidence:  Agree with  “I am less confident ..” Disagree with “I do not need to teach…”  \nHandling questions: Agree with “I can handle..”  Disagree with “I am nervous…”  \n \nMatthew‟s responses indicate he may be anxious about teaching outside specialism (see p 17). \nHis views about outside specialism teaching expressed at interview are stated on p 18.  \n \n \n \nSimon, aged 28, Male, Chemistry, 2:2 degree with PhD  \n \nQuestionnaire Q2 response: Particles – Looked at textbook, school‟s scheme of work, resources \nfrom HEI-based session, internet \n \nQuestionnaire Q3 response: classification – Same as above (ie as Q2)  \n \nQuestionnaire Q4 response:  I used [the] same strategies because [I] drew on large area of \nresources and ideas. [I] prepared in the same way for topics I know about and topics I don‟t.  \n \nPaired statement responses:-  \n \nAttitudes:  Agree with “I enjoy learning…”         Disagree with “I find it difficult…”  \nPreference:   Disagree with “I prefer to teach…”       Agree with “I am pleased to teach…”  \nConfidence:   Disagree with  “I am less confident ..” Agree with “I do not need to teach…”  \nHandling questions: Agree with “I can handle..”        Disagree with “I am nervous…”  \n  \nSimon‟s responses indicate he is confident teaching all aspects of science (see p 17). His views \nabout teaching outside specialism are on p 20.  \n \n \nResults  \n \nTrainees’ backgrounds  \n \n[Insert Table 1 about here] \n \nTable 1 provides information about the gender distribution, degree class1, age and science \nsubject specialism of the respondents.  \n \nThe samples were representative of the full cohorts, being skewed approximately 60:40 towards \nfemales. Most trainees were born in North East England and Scotland. Four trainees born \n                                            \n1\n Degree class is divided into four categories of “Honours”: the highest achieving students, usually around 10% of a \ncohort, are awarded “First” (1\nst\n) class degrees. These students normally score around 70 – 75% in their final \nexaminations. About 40% are placed in the next category, “Upper Second” (2:1) class. About 30% gain “Lower \nSecond” (2:2) class degrees.  About 20% are awarded “Third” class honours. Those whose work is deemed not of \nHonours standard may be awarded “Ordinary” or “Pass” degrees.  \n 12 \noutside the UK were classified formally as “ethnic minority” trainees. Eight participants who \ncompleted the questionnaire did not complete the successfully for different reasons.  \n \nDegree subject is the key indicator used to decide trainees‟ science specialism as physics, \nchemistry or biology. Trainees‟ degree subjects are broad-ranging: data indicate that about 65% \nof respondents were “biology specialists”, holding degrees in biology (16%) or “biology-related” \nsubjects (49%). The latter included graduates in genetics, ecology, biomedical sciences, aquatic \n\/ marine bioscience and physiology. Nine (12%) trainees held degrees in chemistry, while a \nfurther eight (11%) were classified as “chemistry-related”; this group included biochemists, \ngeologists, environmental chemists and pharmacologists.  Eight trainees held degrees physics \nor physics-related subjects, such as astronomy, mechanical engineering and optometry.  \n \nDegree class is widely respected as an indicator of the quality of trainees‟ science specialist \nknowledge. These trainees are regarded as “academically well-qualified”: Table 1 shows that \nabout 54% held Upper Second (2:1) or First Class (1st) honours degrees, these being the two \nhighest degree classifications possible, while a further twenty-one held Lower Second (2:2) class \ndegrees. Thus, overall around 83% of respondents held “good” degrees. Nineteen also held \nMasters or Doctorate qualifications in science. One held a Masters degree in Law. Possession of \na “good” degree means that a trainee would respond correctly to GCSE (General Certificate of \nSecondary Education: the Key Stage 4 examination taken at age 16) questions in their \nspecialism.  \n \nTrainees‟ average age was 27. Around 58% were aged 21 – 25. For this sub-group, teaching is \ntheir first career choice. The remainder comprise those changing career, such as post-doctoral \nscientists, science graduates who have worked in non-science fields and parents returning to \nwork.  \n \nPreferred sources of SMK for teaching  \n \n[Insert Table 2 about here] \n \nIn responding to the questionnaire, trainees ranked a pre-prepared list of possible SMK sources \nfrom 1(most preferred) to 10 (least preferred). These data indicate strong preference for school-\nbased or school-oriented material, reliance on note-taking and reading. HEI-based teaching \nsessions, misconceptions and science education research literature received low rankings. Ten \ntrainees did not provide sufficient information to be included.  \n \nSMK sources for teaching within and outside specialism  \n \nOpen questions prompted trainees to choose one topic each from within and outside their \nspecialisms that they had taught and describe sources used to prepare the SMK required. Table \n3  summarises the SMK sources trainees cited in their responses. The figures represent the \nnumbers of trainees citing each source. Most trainees cited more than one.  \n \n[INSERT TABLE  3  ABOUT HERE] \n \n 13 \nWithin specialism teaching SMK preparation  \nTable 3 indicates four main sources of SMK - the internet, textbooks, prior knowledge and formal \ndocumentation – were used for within specialism teaching preparation.  Comments emphasised \ntrainees‟ sense of “already knowing” the topic, implying little work was needed, for example:-   \n \n“I knew it and only had to skip through the Key Stage 3 revision book, ie. 5 mins” \n(Chemist)  \n \n“Forces – looked at QCA2, school and exploring science SoWs and tests to come up \nwith learning objectives and teaching scheme… otherwise did not need to think about \nown subject knowledge” (Physicist)  \n \nThree trainees explicitly stated they consulted no additional SMK sources, relying entirely on \nprior knowledge.  \n \nThe 19 trainees citing “textbooks” regarded these as low level material, of whom six described \nthis choice as “background reading”, or “refreshing knowledge”, for example:-  \n \n“Cells. Background reading which brought back what I already knew … I already felt \nquite confident with the topic” (Biologist)  \n \nFive used revision guides (classified as “other) to check the level of knowledge required by their \nstudents, for example:-  \n \n“Light – I used subject revision guides to establish what the content should be. My \nsubject knowledge was already adequate” (Physicist)  \n \nFive trainees believed they had the necessary subject knowledge, but wanted to find good \nresources or explanations to use in teaching, for example:-  \n \n“Acids and alkalis – [I] looked at how to describe ideas using simple vocabulary”  \n(Chemist)  \n \n“Variation – I.. researched for novel activities….” (Biologist)  \n \nThese trainees seem aware of transforming SMK to pedagogical content knowledge (PCK).  \n \nTable 3 indicates that few trainees prepared for within specialism teaching by seeking \ncolleagues‟ advice, consulting misconceptions or science education research literature or testing \nout practical experiments prior to lessons.  \n \nOutside specialism SMK preparation  \nTable 3 shows that a more intense pattern of SMK sources emerges for outside specialism \npreparation. School colleagues and textbooks were consulted by about half of respondents. The \n                                            \n2\n The QCA is the Qualifications and Curriculum Authority, the organisation responsible for setting examination \nstandards. The QCA has produced a scheme of work for teaching KS3 used by some schools. www.qca.org.uk  \n 14 \ninternet and formal documentation were also popular. The range of sources reflects trainees‟ \nawareness of SMK weaknesses and perceived need for more detailed preparation, for example:-  \n \n“Electromagnetic spectrum – [I] read around the subject and to a higher level than I \nwas required to teach. [I] prepared an extensive lesson plan with difficult concepts \nfully written out” (Biologist)  \n \nThe role of school colleagues in helping trainees prepare for outside specialism teaching is \napparent, for example:-  \n \n“Environments – had long conversations with other teachers…” (Physicist)  \n \n“Radiation – [I] spoke to the physics teacher (he knows everything)” (Biologist)  \n \n“Gravity and Space - ….Teachers at school and technicians were very helpful” (Chemist)  \n \nTrainees using textbooks did so to learn the information necessary, rather than to check the \nlevel of understanding required, for example:-  \n \n“Paints and pigments – [I] read over student textbook then looked in A level book to \nimprove higher knowledge then researched on internet” (Biologist)  \n \nThe increase in “Other” sources for outside specialism SMK arises from trainees stating that \nthey practiced experiments before lessons, or asked for help in setting up equipment.  \n \nComparing SMK sources for within and outside specialism teaching  \nTable 3 shows that about 50% of trainees actively seek colleagues‟ advice in preparing outside \nspecialism lessons. SMK preparation for within specialism teaching is characterised by trainees \nrelying heavily on prior knowledge and not seeking advice or testing experiments prior to \nteaching.  \n \nAbout two-thirds of trainees expressed clear differences in their approaches to within and \noutside lesson preparation, for example:- \n \n“My biology topics are fairly clear in my mind and so I do not need to look at basic \nknowledge … with Chemistry I am not sure of my basic knowledge and must look \nat the topic as though I am teaching myself.” (Biologist)  \n \n“I needed to make sure I was prepared for any additional questions students may \nask” (Biologist)  \n \nAbout ten trainees indicated that outside specialist subject lessons were sometimes “easier”, for \nexample:-  \n \n“Non-specialism takes longer [to prepare] but is sometimes easier to teach as \nyou don‟t have the same extent of knowledge” (Biologist)  \n 15 \n \nThis response, found also at interview (see below, p 16) suggests that possession of too \nmuch subject matter knowledge could be problematic. Outside specialism teaching meant \nthat trainees taught what they learned, resulting in more clearly focused lessons than those \ntaught within specialism.  \n \nOther emerging issues relating to outside specialism teaching included one trainee who \nsought to avoid misconceptions:-  \n \n[Outside specialism] – emphasis on accuracy and avoidance of misconception \nperpetration” (Biologist) \n \nand this trainee who explicitly stated she prepared to enhance her confidence:-  \n \n“[I did] far more preparation for the physics topic to feel more secure and confident” \n(Biologist)  \n \nTwo trainees stated specifically they used the same preparation method throughout, for \nexample:-  \n \n“I used similar strategies as I find them most effective to refresh my knowledge and \nensure my understanding” (Biologist).  \n \nThe extent to which trainees’ confidence for teaching relies on subject matter knowledge  \n \n[Insert Table 4 about here]  \n \nTrainees‟ responses to eight statements scored using a five-point Likert scale are summarised in \ntable 4. The statements were paired to permit exploration for consistencies in response patterns: \none pair each investigates trainees‟ preference for teaching within and outside specialism; their \nconfidence for teaching; the extent to which trainees believe they can handle students‟ \nquestions; and trainees‟ attitudes towards SMK.  \n \nDetailed data relating to combinations of responses are presented below. For this purpose, the \nscale has been summarised to three points by adding “strongly agree”  to “agree” and “strongly \ndisagree” to  “disagree”, with neutral in the centre.  The words “agree” and “disagree” are used \nto express extremes. All 71 trainees responded to all statements.  \n \nPreferences for within and outside specialism teaching  \nTwo statements, “I prefer to teach topics in my specialism” (abbreviated to “prefer specialism”) \nand “I am pleased to teach topics in all areas of science” (abbreviated to “all science”) assessed \ntrainees‟ preferences. A trainee preferring in-specialism teaching may respond positively \n(strongly agree\/ agree) to the first statement and negatively (disagree\/ strongly disagree) to the \nsecond; vice versa for a trainee preferring to teach all sciences.  \n \n 16 \nTable 4 shows that around 56% (total of “strongly agree” and “agree”) of respondents prefer to \nteach their specialism, while over 80% (total of “strongly agree”  and “agree”) say they do not \nmind teaching all aspects of science. However, these data mask underlying response patterns. \nThese are analysed next. Four clear patterns emerge:-  \n \n32 (45%)    Trainees agreed with both statements                           \n15 (21%)   Trainees disagreed with “prefer specialism” and agreed with “all science”  \n12 (17%)   Trainees were neutral to “prefer specialism” and agreed with “all science”   \n8 (11%) Trainees agreed with “prefer specialism”  and disagreed or were neutral to “all \nscience”                                                                                                    \n \nFour trainees‟ responses did not fit these categories.  \n \nTrainees agreeing with both statements are not necessarily inconsistent – they may be saying \nthat although they prefer to teach within specialism, they are also pleased to teach all topics. \nThey can work on SMK and may enjoy this. Around 21% claim preference for teaching all \nscience topics. This group could be described as “generalist” in outlook. The twelve trainees \nneutral to the “I prefer to teach…” statement could also be “generalist”, although they express \ntheir preference less strongly. Finally, a small sub-group of “specialists” exists; these trainees \nexpress strong preference for within specialism teaching.  \n \n \n \nConfidence for teaching  \nThe statement pair exploring trainees‟ confidence for teaching was “I am less confident teaching \noutside my specialism” (“less confident outside”) and “I do not need to teach my specialism to \nfeel confident as a teacher” (“don‟t need specialism”). A trainee with good self-confidence may \nrespond negatively to the first statement (strongly disagree or disagree) and positively to the \nsecond. A more anxious trainee may state the reverse.  \n \nTable 4 shows that 53% respond “strongly agree\/ agree” to “less confident outside”, while twelve \ndisagree. This significant minority express confidence in their ability to teach outside specialism. \nHowever, in a seemingly contradictory fashion, about two-thirds agree or strongly agree with \n“Don‟t need specialism”, implying that they can teach anything.  Closer inspection of underlying \nresponse combinations reveals these pairings:-  \n \n14 (21%)Trainees disagreed with “less confident outside” and agreed with or were neutral \nto “don‟t need specialism”    \n    \n9 (12%) Trainees were neutral to “less confident outside” and agreed with “don‟t need \nspecialism”       \n      \n25 (35%)Trainees agreed with both statements  \n     \n5  (7%)Trainees agreed with “less confident outside” and disagreed with “don‟t need \nspecialism”                              \n 17 \n                                                              \n7  (10%)Trainees agreed with “less confident outside” and were neutral to “don‟t need \nspecialism”                                                                                           \n         \nEleven trainees‟ responses did not fit into these categories.  \n \nThe disagree \/ agree sub-group (14, 21%) could be labelled “super-confident”, as they state that \noutside specialism teaching does not affect their confidence. Examining these trainees‟ \nbackgrounds shows that seven have degrees in the highest two classes (1st or 2:1) or hold a \nhigher degree, while ten are female. The average age is 31: six are aged 31 or over. Tentatively, \n“super-confident” trainees could be academically well-qualified females older than the average \nage of the cohort.  \n \nThose agreeing with both statements (25, 35%) seem to offer contradictory statements. Without \ngoing back to every trainee, it is difficult to comment as to why this is the case. However, \ninterview data suggests that despite feeling less confident or apprehensive about teaching \noutside their specialism, this can be handled by working on their SMK (see p 16, Views about \nteaching within specialism). Hence,  trainees could respond positively to “I do not need to teach \nmy specialism…”, while at the same time feeling less confident. This sub-group are tentatively \nlabelled “working-confident”.  \n \nTwelve trainees agreeing with “less confident outside” could be described as “anxious”. These \nsplit 50:50 by gender and degree class, with six possessing 1st or 2:1 degrees. The average age \nis 25, below that of the whole group, although four trainees were aged 30 or over. Reasons for \ntrainees‟ lack of confidence are unclear, but collectively their backgrounds differ from “super-\nconfident” and “working-confident” trainees.  \n \nHandling SMK-related questions  \nStatements investigating trainees‟ attitudes towards handling SMK-related questions were: “I can \nhandle the situation if I am asked difficult questions outside my specialist area” ( “I can handle”) \nand “I am nervous that I will be asked a question I cannot answer” (“I am nervous”). Anecdotally, \nhandling subject-related questions causes anxiety among many science trainees, particularly in \nthe early stages. A trainee able to cope with these may respond positively (strongly agree \/ \nagree) to the first statement and negatively (strongly disagree\/ disagree) to the second. A more \nnervous trainee may respond oppositely.  \n \nTable 4 shows thirty-two trainees felt nervous about being asked a question they could not \nanswer (strongly agree \/agree), while fifty agreed or strongly agreed with “I can handle”. Overall, \na majority of respondents appear confident about difficult questions, perhaps accepting that \nnerves are to be expected. These underlying response combinations were found:-  \n \n34  (48%)Trainees agreed with “I can handle” and disagreed or were neutral to “I am \nnervous”                                    \n17  (24%)Trainees agreed with both statements        \n15  (22%)Trainees agreed with “I am nervous” and disagreed or were neutral to “I can \nhandle”                                         \n 18 \n \nFive trainees disagreed with “I am nervous”.  \n \nThese figures suggest that about 48% express confidence in their ability to handle questions \noutside their specialist area and feel little or no nerves about being asked questions they cannot \nanswer. About one-quarter (24%) seem to regard nerves as “part of the game”, responding \npositively to both statements. About 22% seem to have a more “anxious” disposition, admitting \nto feeling nervous and not being able to handle difficult questions. Background information \nshows sixteen of the thirty-four trainees (47%) feeling most confident at handling questions are \nmale, skewing this sub-group away from the cohort‟s 60:40 split. Twelve of the fifteen trainees \n(75%) feeling least confident were female, a skew in the opposite direction.  \n \nAttitudes to SMK  \nThe statements exploring trainees‟ attitudes to SMK were “I find it difficult to develop my subject \nknowledge outside my specialist area” (“I find it difficult”) and “I enjoy learning new subject \nknowledge outside my specialist area” (“I enjoy learning”). A trainee with a positive attitude \ntowards outside specialism teaching may respond negatively (strongly disagree \/ disagree) to \nthe first statement and positively (strongly agree \/ agree) to the second. A trainee feeling \nuncomfortable learning new SMK may respond oppositely.  \n \nTable 4 shows highly polarised responses to these statements.  About 79% strongly disagree \/ \ndisagree with the first and 83% strongly agree \/ agree with the second. Although this is a strong \nindication that the majority of respondents have positive attitudes towards acquiring new SMK, \nexamination of underlying response patterns shows that small sub-groups showing slight \nvariations exist:-  \n \n50 (70%) Trainees agreed with “I enjoy learning” and disagreed with “I find it difficult”   \n \n10 (14%)   Trainees were neutral to “I enjoy learning” and were neutral to or disagreed with “I \nfind it difficult”               \n   3             Trainees agreed with both statements        \n   2             Trainees were neutral to “I enjoy learning” and agreed with “I find it difficult“  \n \nSix trainees‟ responses did not fit into these categories.  \n \nPerhaps most interesting to note is the small number of trainees (3 + 2, last two categories) \nwhose responses suggest they find learning new SMK is difficult: three were females aged over \n30 and three held 2:2 degrees, while the remaining two held 2:1s. This sub-group are noticeable \namongst the overwhelmingly positive responses.  \n \nSemi-structured interview data  \n \nThe twelve interviews indicated the impact perceived by trainees of SMK on their teaching, as \nwell as validating responses found in the questionnaires. The interviewees were slightly more \nskewed towards males (6\/12, 50%) and chemists \/ physicists (5\/12, 42%) than the whole cohort. \nInterviews explored how trainees perceived their SMK and confidence as a teacher impacted on \n 19 \nstudents‟ learning. Trainees‟ voices are reported verbatim, although colloquial and dialectical \nexpressions have been modified to ease comprehension. Names used are pseudonyms. All \ninterviewees completed the PGCE course successfully but with differing teaching abilities. In \nreporting their viewpoints, reference is made to interviewees‟ Likert scale responses, hence \nreferences to “super-confident”, “working-confident” and “anxious”.  \n \nViews about teaching outside specialism  \nThree main viewpoints corresponding to questionnaire categories (p 12) were apparent.  \nMatthew, an “anxious” trainee according to his confidence responses, said this about teaching \noutside specialism :-  \n \n“In physics when I felt the [children] weren‟t grasping it [the topic] I could tackle it \nfrom a different angle by thinking myself, „How‟s the best way to put this across?‟ \nand going down a different route. That was very limited for me with biology ….I \nwouldn‟t have had the knowledge to do that. If it had happened, I would have had \nto extend into a different lesson, and gone away, thought about it and brought it \nback in another lesson.” (Matthew, physicist)  \n \nDaniel and Mary reported differences in the ease with which they prepared for teaching in the \ntwo domains. Their confidence responses corresponded to the “working confident” category:-  \n \n“I felt I could prepare resources for my specialism much easier, and I was a lot less \nconfident at trying new things, so for chemistry I stuck exactly to what the Scheme of \nWork gave me … with biology [when I thought] ” I don‟t agree with that”, it was much \neasier to change things.” (Mary, biologist) \n \n”I was a lot less creative with biology and physics – that went down to confidence in \nthe material… I went down traditional lines… I didn‟t tend to [experiment] unlike my \nchemistry where I liked to [be] more creative.”   \n (“Daniel”, chemist)  \n \nThese trainees connect their lack of confidence in their subject matter knowledge for an outside \nspecialism topic to their ability to develop their own ideas for lessons. “Sticking to the scheme” \nenabled them to feel safe and secure.  \n \nAnother approach to teaching outside specialism was expressed by George, a “working-\nconfident” physicist:-  \n \n“I think I just don‟t do enough for biology…you‟re always looking at your notes \nchecking you‟ve spelt [words] right, whereas in physics you can go off at a tangent \nbecause you know you haven‟t got a problem explaining something…” (George, \nphysicist)  \n \nIn contrast, Simon, a “super-confident”, expressed confidence in his ability to teach outside \nspecialism:-  \n \n 20 \n“…as long as I‟d prepared I felt confident teaching the subject, I was quite \ncomfortable, if you said I was teaching physics top set [most able children], I would \ngo away… do my research and then I‟d be pretty comfortable, you might always get \na question where someone might pull you up, but then you just say to them I‟ll have \nto go and look at that.” (Simon, chemist)  \n \nThus, trainees perceived differences in confidence for within and outside specialism teaching, \nand articulated reasons for these that corresponded with their questionnaire responses.  \n \nViews about teaching within specialism  \nEight interviewees thought that learning objectives were achieved more easily when teaching \noutside specialism. This is counter-intuitive to expectations, supporting questionnaire data \nreported above (p 10).  Three trainees said that initially they knew “too much” and failed to select \ninformation effectively. Mary, for example, found a much lower knowledge level than expected \nwas required:-  \n \n”…at the start, [with my KS4 biology class] I didn‟t think [the learning objectives] \nwere all met. They were a “Gifted and Talented” [high ability] class….I was going \nquite quickly … and I really enjoyed it. I don‟t think they were keeping up with me \nas well as I thought they would do….Towards the end things were better and I \nwould say yes, the learning objectives were being met. In chemistry I would say \nyes, they were met, because I was sticking so closely to the Scheme [of Work]” \n(Mary, biologist)   \n \nMatthew commented:-  \n \n”I feel that teaching outside specialism is better because to a certain extent I „m \nlearning as the children are, so I can see [the topic] from their angle, and there is no \nconfusion about what they need to know… With physics it's different … there were \ntimes that I knew I was thinking [about] quite high level stuff and then dumbing it \ndown to something they would understand, and that sometimes made my job a bit \nharder …[I didn‟t have] enough experience teaching low level things” (Matthew, \nphysicist)  \n \nThe feeling of having to condense specialist subject matter knowledge was expressed by John, \nwhose comment contributes to this paper‟s title:-  \n \n“[In chemistry and physics lessons] I could explain things at the level [they] \nshould be explained at. For a biology concept you‟ve got all this [knowledge] in \nyour mind overriding what you‟re telling them. [You know what you say is] \nalmost a white lie, it should be in much more depth, or there are things that you \nknow need to be accompanied with it [that are] not part of the curriculum, its not \npart of what they need to know. There is a conflict in your head” (John, \nbiologist)   \n \n 21 \nNone of the interviewees whose early teaching was more successful outside specialism \nconnected variation in success explicitly to strategies for preparation, although three noted \ndifferences in their strategies. John, for example, relied on his prior learning in school as \npreparation for within specialism teaching, whereas he more actively prepared for physics and \nchemistry lessons:-  \n \nI: How did you prepare the subject knowledge you needed?  \n \nJ: For biology I already had an idea of what I‟d already done in school myself… \nI did think about what I‟d learned and I did find it easier to remember the biology \nrelated lessons … so planning biology lessons, I think I‟d already thought about \nit before coming on the course…  \n \nWith regard to chemistry and physics …there was a lot more preparation, \nrelearning things …[for example] I haven‟t touched on any physics … since \nGCSE. …[so] there was a lot more preparation, I used colleagues in school, \nspeaking to other physics teachers, and other people on the course, getting \ntheir advice…   \n \nI: So when you were preparing you were more aware of spending time on \noutside specialism?  \n \nJ: Yes definitely… I took the [school] textbook … home and look[ed] at that, but \nI tried to go above that, because children have questions, they want extra bits \nof information… If you only understand [a topic] to the level they need to learn \nit, you‟re never going to be able to teach it, so you need to learn it a couple of \nsteps ahead so you can deal with those unexpected questions and understand \nit further than is expected for them” \n \nIn contrast, Simon, who reported no differences in lesson success, consciously used the same \nstrategies to prepare lessons in both domains, explaining that achieving outcomes depended on \nfinding good activities:- \n \n“…In terms of the learning objectives they were all roughly similar… in terms of \nactivities I would go out of my way to look in biology to find something a little bit \nbetter [than the school‟s Scheme of Work] so I‟d go on the internet and find \ninteractive games. In classification, I did find a few, so some of my lessons \nwere better than in chemistry…. it just came down to the activities.” (Simon, \nchemist) \n \nSimon makes explicit that selection of appropriate instructional strategies is one factor that aids \nsuccessful lessons. Trainees relying on prior knowledge alone experienced more difficulty in \nachieving successful lessons within specialism in the early stages of their teaching.  \n \n 22 \nThe need to select appropriate instructional strategies and over-reliance on inappropriate ones is \nillustrated by Jane, a chemist, who copied the style of chemistry teaching she experienced at \nschool:-  \n \n”A lot of the chemistry I learned at school was just copying off the board… you try \nhard to avoid this, but there‟s parts where it comes back that that‟s what you do..” \n(Jane, chemist)  \n \nJane‟s school experiences exerted a powerful influence on her intuitive approach to teaching \nchemistry; as she had found the subject relatively straight-forward, her instincts led her to want \nto teach as she herself was taught, on the assumption that the learning outcomes would be the \nsame:-  \n \n“…you‟ve had all that background knowledge and spent all that time learning it … \nyou can‟t then understand why other people don‟t get it…” (Jane, chemist)  \n \nJane realized she could not make these assumptions, and subsequently changed her practice. \n \nFinally, Val, a biologist, illustrates that some trainees are closed to the impact of their teaching \non children, until faced with difficult information:-  \n \n”..with respiration I thought I had gone through the topic really thoroughly… a lot of \nthem didn‟t do well in the end of topic test.. Being a biologist didn‟t seem to work..” \n(Val, biologist)   \n \nVal is expressing her realization that possession of good SMK on her part is not the only factor \ndetermining learning outcomes.  \n \nA “continuum” of experience from Simon, through John and Jane to Val can be seen here. \nSimon grasped early on the need to transform his SMK into activities, using the same strategies \nfor preparation both within and outside specialism.  John and Jane relied on prior experiences to \nhelp them survive, rather than transforming SMK. Both realized the flaws with this approach. \nFinally, Val taught first, then reflected from the students‟ test results on her performance. \nInterestingly, Simon and Val both fell into the “super-confident” category (see p 11) – in Val‟s \ncase this proved to be over-confidence. These data suggest the importance of aiding trainees to \ndevelop reflective practices early on.  \n \nHandling subject knowledge-related questions  \nTrainees‟ initial apprehension at being asked questions they could not answer was apparent. For \nexample, Jane, a highly qualified trainee with a doctorate degree, was one of the fifteen most \nanxious, according to her questionnaire responses (see p 12):-  \n \n“At the beginning one of your biggest fears is that they are going to ask you things \nthat you don‟t know and you are thinking, „What am I going to say?‟ … but as you \nget into the job you realize …you don‟t have to know everything and they won‟t \nreally ask you the questions you‟re thinking because [the students are] not that \n 23 \nadvanced …– its like a fear of the unknown. They don‟t ask you things that you \nthink they‟re going to.” (Jane, chemist)  \n \nOther trainees noted their strategies for handling questions were better in their specialist \nsubjects. Mark who expressed confidence in his ability to handle questions, said:-  \n \n“…the only thing with physics was that I needed to know what they needed to \nknow, but if there was something outside that, then bringing it into the lesson \nwasn‟t a problem, and if there was something where I was asked a question and I \nwasn‟t sure about it I made a point of telling them I would find it out.” (Mark, \nphysicist)  \n \nJohn, a “working confident”, learned his material “a couple of steps ahead” of the children so that \nhe could handle questions. He was asked if he was conscious of being able to handle questions \nbetter in biology than physics and chemistry:-  \n \n“In a way, but I was never scared of children asking questions, if I didn‟t know the answer \nI would say so, at first, I thought it would be the end of the world, how stupid would I look \n… but yes, if a child asked me a biology question I would be much more confident \nanswering it than in physics or chemistry, but if someone asked me a question in physics \nand I didn‟t know I would find out and answer it the next lesson.”  \n \nThus, the ability to handle questions seems to rely mainly on trainees‟ self-confidence. Trainees \ntake a pragmatic approach, finding effective strategies for handling questions to which they don‟t \nknow the answer and that children are less demanding than they expected.  \n \nChanges in SMK sources and preparation during the PGCE course  \nTen interviewees stated their preparation time had reduced significantly during the PGCE year. \nAndrew, for example, said that recalling SMK became easier as training progressed:-  \n \n“My subject knowledge in science has been sleeping. And its all come out again, in \nthis year…[now] subject knowledge takes a back seat to creativity” (Andrew, \nbiologist)  \n \nHis use of the word “creativity” suggests he has moved from “survival” and transmission of \nknowledge to “transformation” of SMK.  \n \nThe notion of “speeding up” may reflect trainees‟ increasing confidence in handling classroom \nsituations, reducing the time needed to get their SMK to a level they felt brought confidence.  \n \nHarriet was one trainee who used unchanged approaches throughout the course:-  \n \n“In the diagnostic [first, short teaching placement], I taught only KS3, and again \nI read the textbook, the knowledge required was so much simpler…. I don‟t \nthink my strategies did change, I was reading and talking to teachers, \n 24 \nsometimes I used the internet…. So I don‟t think they did change.” (Harriet, \nbiologist)  \n \nAgain, pragmatism plays a role -trainees know what is expected of them and devise coping \nstrategies. They become more skilled at applying these as the course continues. \n \n \nDiscussion  \n \nTrainee science teachers’ SMK sources for within and outside specialism teaching  \nEvidence (Tables 2 and 3) indicates that these science trainees use more SMK sources for \npreparing lessons outside specialism than within specialism. Trainees rely on experienced \ncolleagues and school materials more frequently when preparing outside specialism lessons. \nTrainees also practice unfamiliar experiments before lessons and consult technicians more often \nfor lessons in this domain. The questionnaire and interview data together suggest that intense \nSMK preparation helps transformation to PCK, as trainees believed their efforts enhanced their \nability to deliver outside specialism lessons with appropriate activities that met learning \nobjectives for their students, as well as giving confidence in their teaching skills.  \n \nSMK preparation for within specialism teaching was more casual. Trainees relied on finding out \nstudents‟ knowledge levels. Three trainees used no SMK preparation strategies at all, relying \nonly on prior knowledge. Fewer experiments were tested in advance of within specialism \nlessons. Perhaps most significant is that trainees consulted experienced teaching colleagues for \nwithin specialism preparation much less frequently. In terms of achieving learning objectives, \neight interviewees indicated their within specialism lessons were in some respects poorer than \noutside specialism lessons. Although none explicitly connected this to poor preparation, a link \nbetween the paucity of SMK sources used and achievement of learning outcomes seems \ndistinctly possible.  \n \nThree interviewees indicated that their difficulties teaching within specialism arose from an \ninability to select appropriate information from their knowledge base, allied to a lack of \nexperience at teaching “low level” material. The description as a “conflict” is powerful – \nawareness of a wide range of interlinking concepts and partial truths may hinder selection of the \nbest approach to take or strategy to use. This may be a contributing factor to trainees‟ inability to \ntransform within specialism SMK to PCK. A lack of SMK for outside specialism teaching seems \nto lead automatically to more successful transformation to PCK, most likely because trainees \ninvolve experienced colleagues and are academically able enough to take in new (or revise old) \ninformation rapidly. For teaching within specialism, interviews revealed that trainees work out \nwhat to do for themselves over different time periods.  \n \nOf course, these comments do not apply to all trainees: there is evidence that 20 – 30% of the \ncohort were equally successful at teaching in both domains. Interview data suggest these \ntrainees are those who perceived at the earliest possible stage that successful teaching depends \n(at least to some extent) on good, appropriate activities – that is, somehow, they hit on the \nimportance of transforming SMK to PCK very early in their practice. Their own personal SMK \n 25 \nappeared secondary to ensuring that appropriate activities were found and prepared in a \nsuitable format for teaching.  \n \nA second finding is the contrast in importance that trainees place on SMK sources from teaching \npractice schools and HEI-based sessions. Despite attending sessions that, at the time, were \nrated (verbally and anecdotally) positively, few trainees used any HEI-based materials or ideas \nregularly, using almost entirely SMK sources from their teaching practice schools. We can only \nspeculate as to possible reasons: for example, HEI sessions may be too generic to be useful to \nspecific school situations, despite efforts to make them relevant; trainees may feel forced to \nabide by schools‟ strict Schemes of Work; the time lag between an HEI session and teaching a \ntopic may be too long, so the session is forgotten; or sessions were simply too radical and \ncontrasting to what really goes on in school. Science education research is probably perceived \nas too esoteric and difficult to access, as well as being difficult to use directly (one trainee \ncommented to this effect in her questionnaire). Misconceptions may be already embedded in \nschools‟ Schemes of Work, or are no longer fashionable in the movement in England and Wales \ntowards general scientific literacy. \n \nTrainee science teachers’ confidence for within and outside specialism teaching  \nA mixed picture is observed in data relating to trainee science teachers‟ confidence. About 20% \nof trainees showed no difference in confidence levels for teaching in either domain. This “super-\nconfident” sub-group seemed to have prepared themselves mentally for the task of teaching all \naspects of science. This group aside, it is probably fair to say that most trainees inevitably \nshowed some anxiety for outside specialism teaching, at least in the early stages of their \nteaching practice experiences. A sub-group of about twelve demonstrate particularly “anxious” \nqualities. They feel nervous about deviating from prescribed Schemes of Work and express \nconcern about answering subject-related questions. However, observations made outside the \nconfines of this study indicated that a majority of these trainees developed good coping \nstrategies and worked hard to overcome both their nerves and any initial apprehension.  \n \nThe trainees in this study are aware that they are well-qualified academically. Over-confidence \nfor within specialism teaching among some is therefore to be expected, at least in the early \nstages. Trainees vary in their ability to recognise this - interview data point to a possible \ncontinuum in the extent to which trainees can reflect meaningfully on their practice.  \n \nTrainees‟ strong academic backgrounds probably also contributed to their SMK development for \noutside specialism teaching. Around half express preference for teaching their specialism, but \nalso imply they are content to learn new material. The confidence statement responses show \nthat about one-third feel less confident teaching outside specialism, but also don‟t mind doing \nthis. Evidence indicates that trainees know how to develop their SMK, and are resourceful and \nresilient in using a range of sources. The average age of 27 suggests that a good proportion of \ntrainees come into teaching from previous jobs, bringing skills that confer maturity in handling \nnovel situations.  \n \nThe “super-confident” trainees are older than average and particularly well-qualified.  Age and \nwork experience may contribute additional maturity at handling unfamiliar situations, greater \nflexibility in thinking and the ability to take in and act on new knowledge under pressure. Parents \n 26 \nof school-aged children familiar with school environments and used to juggling a variety of \nsituations simultaneously tend to fall into this category.  \n \nConclusions, limitations and practical relevance  \n \nConclusions \nThese data, albeit of a preliminary nature, add to evidence that SMK clearly exerts an influence \non teachers‟ practices. This study, set in a training environment, supports Davis‟s (2003) \nfindings, indicating that good SMK helps trainee teachers select appropriate instructional \nstrategies. However, we may need to adjust our definition of “good”, as these data suggest that \n75% of interviewed trainees, who possessed “good” SMK from their degree backgrounds, did \nnot teach successful within specialism lessons, at least in the early stages of their teaching \npractices. Counter-intuitively, transforming SMK and, hence, selection of appropriate \ninstructional strategies, seemed to occur more consistently when teaching outside specialism \ntopics. This position may change as trainees become more experienced. Hashweh‟s (1987) \nfindings, for example, contradict these data. Appleton and Kindt‟s (1999) work, also with \nexperienced teachers, supports the connection made here: when teaching outside specialism \ntrainees express a lack of confidence in their SMK and work hard to remedy this. However, the \nrole of colleagues is clearly different – Appleton and Kindt show collegial support is valued \namong teachers post-training, whereas this study shows trainees only ask for this when \npreparing for outside specialism teaching. Youens and McCarthy‟s (2007) work suggests that \ntrainees may think seeking colleagues help for outside specialism teaching is regarded as “safe”, \nwhile asking for help for within specialism teaching, that is, for a topic they are supposed to \n“know”, may signal weakness.   \n \nThe effectiveness of specialised, collegial support on outside specialism teaching supports the \nfindings of Luft et al (2003) and Hoy and Spero (2005). These data also confirm the work of \nYouens and McCarthy (2007) in showing that school-based materials are used much more \nfrequently than HEI-based sources for developing SMK (discussed below). Teacher educators \nand school mentors should strongly encourage trainees to seek (or insist that they take) advice \nfrom experienced colleagues for teaching in both domains, as well as consider the role that HEI-\nbased sessions could play.  \n \nThese data do not provide clear support for de Jong (2000) and van Driel et al (2002) in \nasserting that good SMK helps trainees be more aware of students‟ difficulties, although, of \ncourse, these studies presented other factors as also being involved. In this case, trainees \nbecame aware of students‟ difficulties when learning SMK themselves for outside specialism \nlessons. No awareness of difficulties was encountered for within specialism lessons – rather, \ntrainees tended to over-estimate students‟ abilities, at least initially.  \n \nThe value placed on HEI-based SMK sessions is questioned. Much time is invested in making \nthese as valuable as possible by including latest research findings, information about up-to-date \nissues in science education and practical experiments, as well as using experienced teacher \ncolleagues and up-to-date published school materials to help make sessions relevant to \npractice. Nevertheless, trainees make little use of these sessions as an SMK source, focusing \ninstead on materials available in school. A second outcome is the need to ensure mentors are \n 27 \naware of the content and potential value of HEI-based sessions, and for teacher educators to be \nyet more explicit as to how to utilise HEI materials, misconceptions and research in lesson \npreparation.  \n \nLimitations  \nNaturally, the study is limited – firstly by the fact that data are collected from one institution and \nat present constitute a relatively small set. Timing of data collection may mean that trainees‟ \nviews have changed during the year - data were collected late in the PGCE course. Different \nviews may have been expressed earlier, although interview and questionnaire data together \ncollected over a three month period, suggest that responses are reliable. The questionnaire was \ndesigned for this study and has not been validated through use elsewhere, other than by \ndiscussion. However, responses from the two cohorts showed no significant differences, and \ninterviewees responded in very similar ways over the two years of the study to date. Further, the \ninterviews did support the questionnaire data – trainees were invited to talk openly about their \nexperiences, without direct reference to the questionnaire, and did so in ways that supported the \nviewpoints they expressed in their questionnaire responses. This suggests that questionnaire \nresponses were internally reliable.  \n \nAn additional limitation is that what we read is trainees‟ viewpoints – they were self-reflecting. No \ninformation was gained from other sources, such as mentors or tutors to support these \nobservations, so the statements about “success” or “failure” of specific lessons are entirely \nbased on the trainees‟ perceptions. Hence, of course, findings must be regarded as tentative.   \n \nPractical relevance  \nDespite the limitations, the information gathered illuminates the issue of SMK for science teacher \ndevelopment in a training setting in a novel way. Trainees‟ efforts to remediate weak SMK, \nincluding consulting experienced colleagues for advice, leads to outside specialism lessons \nbeing successful in the early stages of teacher development. Possession of “good” SMK as prior \nknowledge is insufficient to enable all trainees to prepare and deliver successful lessons within \nspecialism, as they lack experience to transform SMK to PCK effectively. Further, the role of \ngood support in aiding teacher development is confirmed.  \n \nThe issue of how best to prepare trainees for teaching remains open. This study draws attention \nto the possibility of identifying sub-groups of trainees with different characteristics.  Further work \nmay help identify “super-confident”, “working confident” and “anxious” groups more rigorously, \nwith a view to offering different specialised support. Differentiation of support may help enhance \nthe skills of the “super-confident”, and encourage more trainees to develop these characteristics.  \n \nThe connection between “super-confident” and the ability to transform SMK to PCK was \napparent. Trainees with these characteristics challenge the assumption that science specialist \nsubjects are best taught by those possessing specialist degrees. High academic performance in \na specialist subject is not an automatic precursor to good teaching. Trainees with good \nacademic backgrounds tend more often to work from the “survival” perspective and regard \nteaching as knowledge “transmission”.  Interviews in this study show the limitations of this \napproach. We anticipate that most trainees make the transition from “survival” and simple \ntransmission of knowledge to transformation of SMK at some stage during the training \n 28 \nprogramme. The role of colleagues in providing support is identified as a factor aiding success: \nwhere help is asked for, evidence presented here shows this was always regarded positively. \n \nIn terms of the specialist – generalist debate, this paper indicates that the “subject specialists are \nbest” assumption (Introduction) is not proven. Evidence here is more supportive of the notion \nthat possession of genuine “teacher skills”, that is, the ability to transform SMK to  PCK, is a \nmore significant factor influencing success as a trainee science teacher than simply possession \nof a good degree in a specific subject. The trainee whose comment inspires this paper‟s title is \nan academic biologist talking about teaching biology. His conflict was not about how he should \nteach physics. Of course, following trainees‟ development long term may yield changes – over \ntime, perceptions of confidence and abilities may change with experience, suggesting that a \nlongitudinal study is worthwhile.  \n \nThis study points towards the unique, raw nature of teachers‟ starting positions. In the early \nstages, heavy reliance on teaching practice schools is perhaps not unexpected, given the wide \nrange of intense experiences that these naive beginners face. Research with experienced \nteachers post-training shows that skill development continues.  A greater reliance on HEI-based \nsources may occur when the basic range of teaching abilities are in place.  Accordingly, we may \nneed to review the nature and content of HEI-sessions on teacher education courses to ensure \nmaximum impact during training. However, over the early years of a teacher‟s career, full \nsupport from HEI- and school-based colleagues is effective in aiding their development. Overall, \nthen, the practical relevance of this study lies in the notion that assessing trainees‟ personal \ncharacteristics and offering appropriate, realistic, professional support from both HEIs and \nschools in accordance with these may help science teachers develop in the best possible ways.  \n \n \n \n \n \n  \n 29 \nReferences  \n \nAbell, S.K. (2000) Science Teacher Education Dodrecht: Kluwer Academic Publishers  \n \nAbell, S.K. (2007) Research on Science Teacher Knowledge  In: Handbook of Research on \nScience Education, Eds Abell, S.K. and Lederman, N.G  New Jersey, USA: Lawrence Erlbaum \nAssociates  \n \nAppleton, K. and Kindt, I. (1999) Why teach primary science? Influences on beginning teachers‟ \npractices International Journal of Science Education 21 (2) 155 - 168  \n \nBorko, H., Lalik, R. and Tomchin, E. (1987) Student teachers‟ understandings of successful and \nunsuccessful teaching Teaching and Teacher Education 3(2): 77 – 90  \n \nCarlsen, W. S. (1993) Teacher knowledge and discourse control: Quantitative evidence from \nnovice biology teachers‟ classrooms Journal of Research in Science Teaching 30 (5): 471 - 481 \n \nCarlsen, W.S. (1999) Domains of teacher knowledge  In: Examining Pedagogical Content \nKnowledge Eds: J. Gess-Newsome and N. Lederman, Dordrecht: Kluwer Academic Publishers \n \nCarré, C. (1998) Invitations to think in primary science lessons, in Birden, R. and Williams, M. \n(Eds) Thinking through the curriculum (London: Routledge)  \n \nDavis, E.A. (2003) Knowledge integration in science teaching: Analysing Teachers‟ Knowledge \nDevelopment  Research in Science Education 34: 21 -53  \n \nDe Jong, O. (2000) The Teacher Trainer as Researcher: exploring the initial pedagogical content \nconcerns of prospective science teachers European Journal of Teacher Education 23 (2): 127 – \n137  \n \nDfES (2004) Science: The National Curriculum   London: The Stationery Office  \n \nGeddis, A.N., Onslow, B., Beynon, C. and Oesch, J. (1993) Transforming content knowledge: \nLearning to Teach about isotopes  Science Education 77 (6): 575 – 591  \n \nGess-Newsome, J. (1999) Secondary teachers‟ knowledge and beliefs about subject matter and \ntheir impact on instruction    In: Pedagogical Content Knowledge: The Construct and Its \nImplications for Science Education, Gess-Newsome, J. and Lederman, N. G. (Eds) Dordrecht: \nKluwer  \n \nHashweh, M. Z. (1987) Effects of subject-matter knowledge in the teaching of biology and \nphysics  Teaching and Teacher Education 3 (2): 109 – 120  \n \nHoy, A.W. and Spero, R.B. (2005) Changes in teacher efficacy during the early years of \nteaching: A comparison of four measures  Teaching and Teacher Education: An International \nJournal of Research and Studies 21(4): 343-356  \n 30 \n \nLeCompte, M. and Preissle, J. Ethnography and Qualitative Design in Educational Research (2nd \nEdition  London: Academic Press  \n \nLederman, N.G., Gess-Newsom, J. and Latz, M.S. (1994) The nature and development of \npreservice science teachers‟ conceptions of subject matter and pedagogy Journal of Research \nin Science Teaching 31 (2): 129 – 146  \n \nLuft, J., Roehrig, G. and Patterson, N.C. (2003) Contrasting landscapes: A comparison of the \nimpact of different induction programmes in beginning secondary science teachers‟ practices \nbeliefs and experiences  Journal of Research in Science Teaching 40 (1): 77-97  \n \nLumpe, A.T., Haney, J.J. and Czerniak, C.M. (2000) Assessing teachers‟ beliefs about their \nscience teaching context Journal of Research in Science Teaching 37 (3) :275 – 292  \n \nMagnusson, S., Krajcik, J. and  Borko, H. (1999) Secondary teachers‟ knowledge and beliefs \nabout subject matter and their impact on instruction   In: Gess-Newsome, J. and Lederman, N.G. \nEds (1999) Examining Pedagogical Content Knowledge Dordrecht: Kluwer Academic Publishers   \np 95 – 132   \n \nMarkic, S., Valanides, N. and Eilks, I. (2006) Freshman science student teachers‟ beliefs on \nscience teaching and learning – a mixed methods study   In: Towards research-based science \nteacher education p 29 – 40, edited by I. Eilks and B. Ralle,    Shaker, Aachen Germany  \n \nMarks, R. (1990) Pedagogical content knowledge: From a mathematical case to a modified \nconception  Journal of Teacher Education 41 (3): 3-11  \n \nMeriam, S.B. and Associates (2002) Qualitative Research in Practice  San Francisco: Wiley  \n \nMoor, H, Jones, M., Johnson, F., Martin, K., Cowell, E. and Bojke, C. (2006) Mathematics and \nScience in Secondary Schools  The Deployment of Teachers and Support Staff to Deliver the \nCurriculum Department for Education and Skills Research Report No 708   Slough: National \nFoundation for Education Research  and \nhttp:\/\/www.dfes.gov.uk\/research\/data\/uploadfiles\/RR708.pdf (Accessed April 2008)  \n \nRoyal Society of Chemistry (2004) Who teaches our children chemistry?  Policy Bulletin Issue 3 \nLondon: Royal Society of Chemstry  available at \nhttp:\/\/www.rsc.org\/ScienceAndTechnology\/Policy\/Bulletins\/Issue3\/TeachingChildren.asp \n(accessed April 2008) \n \nSanders, L.R., Borko, H. and Lockard, J.D. (1993) Secondary science teachers‟ knowledge base \nwhen teaching science courses in and out of their area of certification Journal of Research in \nScience Teaching, 30: 723 – 736  \n \nSanders, M. (1993) Erroneous ideas about respiration: The Teacher Factor  Journal of Research \nin Science Teaching 30 (8): 919 – 934  \n 31 \n \n \nShulman, L. (1986a) Those who understand: A Conception of Teacher Knowledge American \nEducator 10(1): 9-15, 43-44 \n \nShulman, L. (1986b) Those who understand: Knowledge growth in teaching  Educational \nResearcher 15(2): 4-14  \n \nShulman, L. (1987) Knowledge and teaching: foundations of the new reform Harvard \nEducational Review 57 (1): 1 – 22  \n \nVan Driel, J., De Jong, O. and Verloop, N. (2002) The development of pre-service chemistry \nteachers‟ pedagogical content knowledge Science Education 86: 572 – 590  \n \nYouens, B. and McCarthy, S. (2007) Subject knowledge development by science student \nteachers: the role of university tutors and school-based subject mentors Research in Science \nand Technological Education 25 (3): 293 – 306  \n \n  \n 32 \nSubject specialism  Biology  Chemistry  Physics Totals \nNo. of trainees  39  (55) 24 (34)  8 (11) 71 (100%) \nGender  Male    Female \n   12         27 \n \nMale    Female  \n     10          14 \nMale     Female \n    6            2 \nMale      Female \n 28 (39)  43 (61) \nAge  \n21-25 \n26-30 \n31-35 \n36+ \n \n   8            21 \n   2              2 \n   1              2 \n   1              2 \n \n \n     3              4 \n     4              5 \n     2              3 \n     1              2 \n      \n    4             1 \n    1             0 \n    0             0 \n    1             1 \n \n   41 (58) \n   14 (20) \n      8  (11) \n      8  (11) \nDegree class  \n1st  \n2:1  \n2:2  \n3rd  \nNot stated \/other \n \n3                 2 \n5               14 \n3                 8 \n0                 0 \n 1                3 \n \n     1              4 \n     1              4 \n     4              4 \n     2              0 \n     2              2 \n \n     2            0 \n2           0 \n1           1 \n0           0 \n1           1 \n \n12 (17) \n26 (37) \n21 (29) \n  2    (3) \n    10 (14) \nHigher degrees  5                 4      4              6      0            1     20 (28) \n \n(Figures in parentheses are percentages throughout) \n \nTable 1: Science trainees’ backgrounds: gender, age and degree classification against subject specialism  \n  \n  \n 33 \n \n Ranked 1 or 2 \n \n3 or 4 5 or 6 7 or 8 9 or 10 Total  \nMaking notes  29 (41%) 13 (18) 7 6 6 61 \nSchool colleagues  24 (34) 19 (27)  13 (18)  3 2 61 \nOther trainees  9 (14)  20 (27)  14 (20)  9 9 61 \nInternet  16 (23)  23 (32)  10 (14)  9 3 61 \nScience Education \nResearch  \n1 1 5 15 (21)  39 (55)  61 \nMisconceptions  \nMaterials  \n1 6 14 (20)  18 (25)  22 (31)  61 \nTextbooks  30 (42)  16 (23)  9 5 1 61 \nExam papers, etc  4 12 (17) 18 (25)  16 (23) 11 61 \nHEI sessions  5 7 20 (17)  23 (32)  6 61 \nUniversity notes  3 5 13 (18)  17 23 (32)  61 \n \nFigures in parentheses are percentages  \n \nTable 2: Science trainees’ ranking of ten subject matter knowledge sources from a pre-prepared list \n \n  \n 34 \n \nSMK source  Within specialism teaching Outside specialism teaching \nSchool colleague or other trainee \nteacher \n7 33 \nTextbooks, school resource packs, \nteacher materials  \n19 38 \nInternet  19 18 \nFormal documentation such as  \nExam papers, National Curriculum \ndocument, School Schemes of Work  \n10 12 \nPrior knowledge from University degree \nor job \n14 0 \nInformation from an HEI-based session  2 2 \nOther source, e.g. revision guide, safety \nguide, practising experiments, prior \nknowledge check, note-making  \n8 15 \nMisconceptions information  4 5 \nTrainees stating “no sources used”  3 0 \n \nTable 3: Summary of trainee science teachers’ subject matter knowledge sources for within and \noutside specialism teaching  \n \n \n  \n 35 \n \nStatement \nPair \nLikert scale response  \n \nStatement \nStrongly \nagree \n \nSlightly \nagree \n \nNeutral Slightly \ndisagree \nDisagree \n\/strongly \ndisagree \nNR Total \n \n \nPreference \nI prefer to teach topics \nin my specialism  22 (31%) 18 (25) 15 (21) 5 11 \n \n0 \n \n71 \nI am pleased to teach \ntopics in all areas of \nscience  \n \n41 (58)  \n \n18 (25)  \n \n9 \n \n3 \n \n0 \n \n0 \n \n71 \n \n \nConfidence \nI don‟t need to teach \nmy specialism to feel \nconfident  \n34 (48)  13 (18)  15 (21) 1 7 1 71 \nI am less confident \nteaching outside my \nspecialism  \n15 (21)  23 (32) 16 (23) 12 (17) 5  0 71 \n \n \nQuestions \nI am nervous of being \nasked a question I \ncan‟t answer  \n17 (24)  15 (21)  9 14 (20) 16 (23) 0 71 \nI can handle difficult \nquestions in non-\nspecialist areas  \n25 (35)  25 (35) 13 (18)  14 (20) 4 0 71 \n \n \n \nSMK \nattitudes \nI find it difficult to \ndevelop my subject \nknowledge outside my \nspecialist area  \n2 3 10 15 (21) 41 (58) 0 71 \nI enjoy learning new \nsubject knowledge \noutside my specialist \narea  \n46 (65)  13 (18) 11  1 0 0 71 \n \nNR = No response  \n \nTable 4: Trainees’ responses to Likert scale statements about preferences, confidence, handling \nquestions and attitudes towards learning new SMK  \n 36 \nAppendix 1: Questionnaire  \n \nDeveloping trainee science teachers’ subject knowledge \n \n \nBackground information \n \nName  _______________________________  Gender  ________  Age __________ \n \n1st degree subject and class ________________________  \n \n Higher degrees ____________________    Subject specialism on PGCE ________ \n \n \n1. Please complete the table showing science topics you have taught so far.  \n \nIn your specialist area Key stage In areas outside your \nspecialism \nKey stage \n \n[Space provided for lists] \n   \n \n2. From the specialist list, choose one topic you found especially “easy”  to teach (i.e. you felt \nconfident you could teach it well). Describe what you did to prepare the subject knowledge \nrequired.  \n \n3. From the non-specialist list, choose the topic you found hardest to teach (i.e. you felt the most \nunconfident you could teach it well). Describe what you did to prepare the subject knowledge \nrequired.  \n \n \n4. Here is a list of strategies that trainee science teachers may use for developing subject \nknowledge. Rank the items in order from 1(Highest)  – 10 (lowest) according to how useful you \nthink these are. Please number each item separately; don’t rank two with the same number.  \n \nStrategy Ranking from 1-10 \nMaking notes from textbooks   \nAsking colleagues at school   \nAsking other trainees   \nSearching the internet   \nReading science education research   \nReading misconceptions literature   \nReading textbooks   \nTrying exam papers \/ questions   \nUsing information from University sessions  \nUsing university notes from your degree course  \n \n \n 37 \n5. Here are some statements about subject knowledge and teacher confidence. Select the \nalternative in each case that corresponds most closely to your opinion as it stands based on your \nteaching experience so far.  \n \n 1- strongly agree      5 strongly disagree  \nI prefer to teach topics in my specialist area.  \nP \n \n \n1             2             3           4            5          \nI enjoy learning new subject knowledge outside my \nspecialist area.  \nA \n \n1             2             3           4            5          \nI am nervous that I will be asked a question I cannot \nanswer.  \nH  \n \n1             2             3           4            5          \nI am less confident when I teach outside my \nspecialist area.  \nC \n \n1             2             3           4            5          \nI can handle the situation if I am asked difficult \nquestions outside my specialist area.  \nH \n \n1             2             3           4            5          \nI am pleased to teach topics in all areas of science.  \nP \n \n \n1             2             3           4            5          \nI find it difficult to develop my subject knowledge \noutside my specialist area.  \nA \n \n \n1             2             3           4            5          \nI do not need to teach my specialism to feel \nconfident as a teacher.  \nC \n \n \n1             2             3           4            5          \n \n \nPlease indicate here if you would be prepared to take part in a (short)  recorded discussion about \nthe issues being explored in this study.    o \n \nThank you very much indeed for your help.  \n 38 \nAppendix 2: Interview questions  \n \n1. Please confirm the topics you taught at KS3 and KS4 on both your teaching practices.  \n \n2. How did you prepare the subject knowledge you needed for teaching?  \n \n3. Did you use the same strategies for preparing subject knowledge for teaching topics \nwithin and outside specialism? Please explain.  \n \n4. Were you aware of differences in learning outcomes for the children when you taught \nwithin and outside specialism topics? Please explain  \n \n5. How did the quality of your lesson preparation affect the achievement of learning \nobjectives?  \n \n6. Have your strategies for preparation changed during the PGCE course? Please \nexplain.  \n \n \nTrainees were also asked to bring lesson plans, teaching materials and evaluations of \ntheir teaching for within and outside specialism lessons that they felt best represented \ntheir work. Discussion about these followed the interview questions.  \n \n \n"}