{"doi":"10.1007\/s002570050101","coreId":"71548","oai":"oai:eprints.lancs.ac.uk:715","identifiers":["oai:eprints.lancs.ac.uk:715","10.1007\/s002570050101"],"title":"Semiclassics of rotation and torsion.","authors":["Braun, Petr A.","Gerwinski, Peter","Haake, Fritz","Schomerus, Henning"],"enrichments":{"references":[{"id":16346521,"title":"Handbook of mathematical functions,","authors":[],"date":"1965","doi":"10.2307\/2004114","raw":"M. Abramowitz, I. A. Stegun: Handbook of mathematical functions, Dover Publications, inc., New York, 1965","cites":null},{"id":16346512,"title":"in Spectroscopic and Group Theoretical Methods in Physics, edited by","authors":[],"date":null,"doi":null,"raw":"P. Ponzano, T. Regge, in Spectroscopic and Group Theoretical Methods in Physics, edited by F. Bloch, S. G. Cohen, A. De-Schalit, S. Sambursky, I. Talmi (Wiley, New York), p.53","cites":null},{"id":16346510,"title":"in:","authors":[],"date":"1978","doi":"10.1103\/physrevlett.40.1695","raw":"R. Balian, G. Parisi, A. Voros, Phys. Rev. Lett. 41, 1141 (1978); R. Balian, in: Discourses in Mathematics and its Applications, No. 1, Eds. S. A. Fulling, F. J. Narcovich, Dept of Mathematics, Texas A&M University, College Station, Texas (1991)","cites":null},{"id":16346509,"title":"Quantum Signatures of Chaos,","authors":[],"date":"1991","doi":"10.1007\/978-1-4899-3698-1_38","raw":"F. Haake, Quantum Signatures of Chaos, Springer, Berlin (1991)","cites":null},{"id":16346515,"title":"The Racah-Wigner Algebra in Quantum Theory (Encyclopedia of Mathematics and Its Applications, Volume 9, Addison-Wesley,","authors":[],"date":"1981","doi":"10.1017\/cbo9781107340695.001","raw":"L. C. Biedenharn, J. D. Louck, The Racah-Wigner Algebra in Quantum Theory (Encyclopedia of Mathematics and Its Applications, Volume 9, Addison-Wesley, 1981)","cites":null},{"id":16346518,"title":"Varˆ saloviˆ c, Kvantovaja teorija uglovogo momenta, Singapore, World Scientiﬁc","authors":[],"date":"1988","doi":null,"raw":"D. A. Varˆ saloviˆ c, Kvantovaja teorija uglovogo momenta, Singapore, World Scientiﬁc (1988)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996-03","abstract":"We discuss semiclassical approximations of the spectrum of the periodically kicked top, both by diagonalizing the semiclassically approximated Floquet matrix F and by employing periodic-orbit theory. In the regular case when F accounts only for a linear rotation periodic-orbit theory yields the exact spectrum. In the chaotic case the first method yields the quasienergies with an accuracy of better than 3% of the mean spacing. By working in the representation where the torsional part of the Floquet matrix is diagonal our semiclassical work is mostly an application of the asymptotics of the rotation matrix, i.\\,e.~of Wigner's so-calledd -functions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71548.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/715\/1\/61000115.pdf","pdfHashValue":"b23eaa0fae8c93c0c2cedea442a238bfc6bbf57b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:715<\/identifier><datestamp>\n      2018-01-24T03:16:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Semiclassics of rotation and torsion.<\/dc:title><dc:creator>\n        Braun, Petr A.<\/dc:creator><dc:creator>\n        Gerwinski, Peter<\/dc:creator><dc:creator>\n        Haake, Fritz<\/dc:creator><dc:creator>\n        Schomerus, Henning<\/dc:creator><dc:description>\n        We discuss semiclassical approximations of the spectrum of the periodically kicked top, both by diagonalizing the semiclassically approximated Floquet matrix F and by employing periodic-orbit theory. In the regular case when F accounts only for a linear rotation periodic-orbit theory yields the exact spectrum. In the chaotic case the first method yields the quasienergies with an accuracy of better than 3% of the mean spacing. By working in the representation where the torsional part of the Floquet matrix is diagonal our semiclassical work is mostly an application of the asymptotics of the rotation matrix, i.\\,e.~of Wigner's so-calledd -functions.<\/dc:description><dc:date>\n        1996-03<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/715\/1\/61000115.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s002570050101<\/dc:relation><dc:identifier>\n        Braun, Petr A. and Gerwinski, Peter and Haake, Fritz and Schomerus, Henning (1996) Semiclassics of rotation and torsion. Zeitschrift für Physik B Condensed Matter, 100 (1). pp. 115-127. ISSN 1431-584X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/715\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s002570050101","http:\/\/eprints.lancs.ac.uk\/715\/"],"year":1996,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Z. Phys. B 100, 115–127 (1996) ZEITSCHRIFT\nFU¨R PHYSIK B\nc© Springer-Verlag 1996\nSemiclassics of rotation and torsion\nPetr A. Braun1, Peter Gerwinski2, Fritz Haake2, Henning Schomerus2\n1Department of Theoretical Physics, Institute of Physics, Saint-Petersburg University, Saint-Petersburg 198904, Russia\n2Fachbereich Physik, Universita¨t-Gesamthochschule Essen, D-45117 Essen, Germany\nReceived: 12 May 1995\nAbstract. We discuss semiclassical approximations of the\nspectrum of the periodically kicked top, both by diagonaliz-\ning the semiclassically approximated Floquet matrix F and\nby employing periodic-orbit theory. In the regular case when\nF accounts only for a linear rotation periodic-orbit theory\nyields the exact spectrum. In the chaotic case the first method\nyields the quasienergies with an accuracy of better than 3%\nof the mean spacing. By working in the representation where\nthe torsional part of the Floquet matrix is diagonal our semi-\nclassical work is mostly an application of the asymptotics of\nthe rotation matrix, i. e. of Wigner’s so-called d-functions.\n1. Introduction\nWe present a semiclassical study of periodically kicked tops.\nOur aim are approximations for the quasienergy spectrum\nvalid irrespective of whether the classical limit yields regu-\nlar, chaotic, or mixed dynamics.\nKicked tops [1–4] are worthy of ambitious endeavors\nfor various reasons: (i) The finite dimension of their Hilbert\nspace precludes the appearance of infinities in periodic-orbit\nexpansions a` la Gutzwiller. (ii) The Hilbert space dimen-\nsion is a measure of (the inverse of) Planck’s constant and\ntherefore yields a convenient handle for implementing the\nsemiclassical limit. (iii) The accuracy of semiclassical ap-\nproximations is easily checked since, again due to the fi-\nnite dimension of the Hilbert space, the exact quasienergy\nspectrum is readily obtained numerically. (iv) Under condi-\ntions of chaos the fluctuations in the quasienergy spectrum\nare particularly faithful to the predictions of random-matrix\ntheory; such tops may thus said to display generic quan-\ntum chaos. (v) A good semiclassical understanding of the\ntop might eventually give clues to a semiclassical theory of\nlocalization inasmuch as the prototypical system with quan-\ntum localization, the kicked rotator, is but a special case of\nthe top. (vi) Another special case is linear rotation and here\nthe unitary Floquet operator has Wigner’s well-known d-\nfunctions as matrix representatives. Interestingly, semiclas-\nsical theory gives approximate eigenfunctions but the exact\nFloquet spectrum in this regular case, reminding one of what\nhappens to the harmonic oscillator or the hydrogen atom in\nsemiclassical treaments.\nThe dynamical variables of our tops are the components\nof an angular momentum J which obey the commutation\nrelations [Jx, Jy] = iJz etc. The squared angular momentum\nis thus a conserved quantity, J2 = j(j + 1) with j integer\nor half integer. The quantum number j also determines the\ndimension of the Hilbert space as 2j + 1. The particular\ntop to be studied here has its stroboscopic period-to-period\ndynamics described by the Floquet operator [2]\nF = e−i\nk\n2j+1J\n2\nze−iβJy . (1.1)\nOne confronts a rotation by the angle β about the y-axis\nfollowed by a torsion of strength k about the z-axis; the\ntorsion may obviously be interpreted as a rotation by an an-\ngle proportional to Jz . Since for vanishing torsion strength,\nk = 0, we deal with the classically regular case of pure rota-\ntion it is the element of nonlinearity present in the generator\nJ2z of the torsion which, together with the factorization of F\ninto a rotational and a torsional term, makes possible chaotic\nbehavior of the classical version of the top. We would like\nto emphasize that with respect to earlier papers we have\nhere changed the torsion generator by replacing the quan-\ntum number j with the semiclassical magnitude j + 1\/2 of\nthe angular momentum, writing k\/(2j + 1) instead of k\/2j.\nThis slight change yields an important simplification of the\nsemiclassical matrix elements and trace of F .\nTwo semiclassical paths towards the Floquet spectrum\nhave been explored. The traditional one proceeds through\nsemiclassical approximations for the traces of powers of the\nFloquet operator, trFn, with the integer exponent ranging\nfrom n = 1 to n = j for integer j and to n = j+ 12 for halfinte-\nger j. This is the variant of Gutzwiller’s periodic-orbit theory\npertinent to periodically driven systems since the n-th such\ntrace can be expressed semiclassically in terms of properties\nof period-n orbits of the classical stroboscopic dynamics.\nSince large values of j are required for the semiclassical ap-\nproximation to become reliable one runs into the problem,\nin the case of classical chaos, of the exponential prolifera-\ntion of periodic orbits with increasing length. Leaving the\nchaotic case for a future investigation we shall here employ\nthe periodic-orbit strategy to the regular case of pure rota-\n116\ntion. As we shall see, for generic values of the rotation angle\nβ there is only a pair of trivial fixed points of the classical\nstroboscopic map which also makes up, upon n-fold repeti-\ntion, the only period-n orbits and the ensuing semiclassical\ntraces trFn yield the exact spectrum of the rotation matrix.\nA second scheme of securing semiclassical spectra has\nbeen suggested recently [5]. It consists of approximating, in\na suitable representation, all elements of the Floquet matrix\nwhich latter is then diagonalized numerically. Employing a\nbasis formed of angular-momentum coherent states we had\npreviously found the quasienergies for values of j ranging\nfrom about unity up to 200 in this way. The accuracy reached\nwas surprisingly good, the typical error not exceeding 3%\nof the mean spacing under conditions of global chaos and\neven slightly better for torsion strengths sufficiently small to\nsecure dominantly regular classical behavior.\nWe here take up the method of diagonalizing the semi-\nclassically approximated Floquet matrix but work, instead of\nwith coherent states, in the (J2, Jz)-basis. Some interesting\nthoughts are tied with that change of basis. Coherent states\nhave the intuitive appeal that their “support” in the classical\nphase space shrinks to a point in the classical limit j !1.\nIncidentally, the phase space is the sphere limj!1 J2\/j2 = 1\nand a coherent state roughly covers an area 4pi\/(2j + 1) on\nthat sphere. The (2j + 1) dimensional Hilbert space of the\ntop is of course vastly overpopulated by the coherent states:\nTheir set is as dense as the set of points on the sphere. As a\nconsequence, the coherent states are non-orthogonal among\none another. To form a complete set one must choose some\ngrid of 2j + 1 points on the sphere and the states located on\nthem. A matrix element between two coherent states cannot\nbe associated, in the classical limit, with a real solution of\nthe classical stroboscopic map unless the location of the fi-\nnal state happens to be the classical image of the location of\nthe initial state; indeed, specification of both the initial and\nfinal phase space point in general amounts to an overdeter-\nmination of the classical motion. Still, the semiclassical ap-\nproximation for each matrix element of F leads to a certain\nstationary-phase condition which is identical in appearance\nwith the classical stroboscopic map; inasmuch as a solution\nof that map determines the value of the matrix element and\ninasmuch as that solution is overdetermined from a classical\npoint of view, one confronts so-called ghost orbits which run\nthrough a complexified version of the classical phase space\n[6, 7]. Unfortunately, the number of ghost solutions of the\nboundary-value problem is in general infinite and, even more\ndeplorably, at least for not too large values of j several or\neven many such ghosts may make sizable contributions to\na given matrix element. The coherent-state based semiclas-\nsical determination of the quasienergy spectrum of the top\nwas therefore somewhat of a tour de force and certainly\nmore demanding of numerical means and even mathemat-\nical finesse than the straightforward diagonalization of the\nunapproximated Floquet matrix. Nevertheless, the success\neventually reached was enjoyable since it showed that clas-\nsical chaos does not preclude validity of some semiclassical\napproximation; a bit of consolation for the immense amount\nof work could be seen in the fact that for values of j as large\nas, say, 100 one can hardly imagine an implementation of a\nperiodic-orbit expansion under conditions of global chaos.\nWe shall here rejoice in a considerable gain of efficiency\nbrought about by employing the familiar (2j +1) eigenstates\njj,mi of Jz for fixed eigenvalue j(j +1) of J2 as a basis set.\nThe eigenvalue m of Jz is related to a convenient classical\nphase space variable, the polar angle θ defined with respect\nto the z-axis as m =\np\nj(j + 1) cos θ; we shall take cos θ as\nthe classical momentum and the azimuth φ as the canoni-\ncally conjugate coordinate. The basis state jj,mi can thus be\nvisualized as the circular section of the spherical phase space\nwith the plane of constant cos θ which leaves the azimuth\nφ free to range in 0 \u0014 φ \u0014 2pi. Clearly then, the matrix\nelement of the Floquet operator can be associated with a\nsolution of the classical stroboscopic map with fixed initial\nand final values of the momentum, the coordinate φ remain-\ning unspecified; no overdetermination of the classical orbit\nis incurred. Upon inspection of the boundary-value problem\nin question we find that roughly the fraction (pi sinβ)\/4 of\nall matrix elements is related to a pair of real classical orbits\nwhile the remainder do not correspond to classically allowed\npairs of initial and final momenta and can therefore at best\nbe associated with complex ghost orbits; in both cases the\nsemiclassical matrix element takes the familiar WKB form\ncorresponding to classically allowed or classically forbid-\nden boundary data. Since even in the latter case we did not\nencounter cases where more than one ghost matters we en-\ncounter closed-form expressions for all semiclassical matrix\nelements which are as easy to evaluate as their exact quan-\ntum partners. Upon diagonalizing the semiclassical matrix\nwe again encounter the fine accuracy previously met with\nwhen working with coherent states, i. e. a mean error of less\nthan 3% of the mean spacing 2pi\/(2j + 1) of quasienergies.\nIncidentally, since the torsion part of the Floquet oper-\nator (1.1) is diagonal in the (J2, Jz)-representation all the\nwork in determining the semiclassical Floquet matrix goes\ninto the matrix elements of the rotation operator, often called\nWigner’s d-functions djmf ,mi =\n〈\nj,mf\n\f\fe−iβJy \f\f j,mi\u000b. For-\ntunately, the semiclassical d-functions are well known [8, 9].\n2. Quantum rotation matrix and classical map\nLet us consider an initial quantum state jj,mii and imagine\na rotation by the angle β about the y-axis which turns our\ninitial state into e−iβJy jj,mii. The probability amplitude to\nfind some “final” valuemf of Jz in the rotated state is given\nby the matrix element\ndjmf ,mi (β) = hj,mf j e−iβJy jj,mii . (2.1)\nA semiclassical image of the final state jj,mf i is the\ncone of possible directions of the angular-momentum vector\nof lengthp\nj(j + 1) \u0019 j + 1\/2 \u0011 J (2.2)\nand projection mf on the z-axis (see Fig. 1). This cone\nhas the z-axis as its symmetry axis; its semiangle at the\ntop is θf = arccos(mf\/J). On the other hand, the rotated\nstate e−iβJy jj,mii is depicted by a cone whose axis z0 lies\nin the x-z-plane and includes the angle β with the z-axis;\nits semiangle at the top is θi = arccos(mi\/J). The event\nwhose probability amplitude equals Wigner’s d-function cor-\nresponds semiclassically to the crossings of these two cones.\n117\n6z\n-\nz′\n(a)\nθf\nθi\ndjmf ,mi\n(\npi\n2\n\u0001\n=\n0BBBBBBBBBBBB@\nrc\nrb\nr a\n1CCCCCCCCCCCCA\n6z\n-\nz′\n(b)\nθf\nθi\n6z\n-\nz′\n(c)\nθf\nθi\nFig. 1. Cones of the angular-momentum vector for the rotated initial state exp(−iβJy)jmii and reference state jmf i, for β = pi\/2. Their lines of intersection\nare the semiclassical image of the event characterized by Wigner’s d-function; they also indicate the two final directions of the angular momentum possible\nfor the given initial and final polar angles θi, θf . The three images belong to three different matrix elements: a within the classically allowed region, b on\nthe elliptic border J2 sin2 β −m2i −m2f + 2mimf cosβ = 0 which actually is a circle in the case β = pi\/2 (see Sect. 3), and c in the classically forbidden\nregion with no intersection between the cones. The symbolic equation depicts the location of the matrix elements pertaining to the cones a, b, c\nThere are two, one, or no lines of crossing if the sum of the\npolar angles θf +θi is larger than, equal to, or smaller than β.\nIf there is no crossing, the d-function becomes exponentially\nsmall.\nWe now proceed to the classical map describing the ro-\ntation of the vector J by the angle β about the y-axis. The\nspherical angles θi, φi of the initial vector are mapped into\nθf , φf as\ncos θf = cos θi cosβ − sin θi cosφi sinβ\nsin θf cosφf = cos θi sinβ + sin θi cosφi cosβ\nsin θf sinφf = sin θi sinφi. (2.3)\nWe can speak of a trajectory drawn out between the ini-\ntial pair θi, φi and the final pair θf , φf as the rotation angle\ngrows from zero to β. Suppose now that we do not fix the\ninitial angles but instead the polar angles (θi, θf ) of both\nthe initial and final angular momentum. To identify the tra-\njectories connecting these boundary data we must seek the\nazimuthal angles φi, φf . To that end we may again resort\nto Fig. 1; the intersection(s) of the two cones specify the\nfinal direction(s) of the angular momentum compatible with\nclassically specified initial and final polar angles, θi, θf . The\ncorresponding final azimuths are zero, one, or two in number\nand read, in the latter two cases,\nφ\u0006f = \u0006 arccos\nmi −mf cosβ\nsinβ\nq\nJ2 −m2f\n, (2.4)\nwith mi,f = J cos θi,f . The initial directions of the angu-\nlar momentum can be obtained from the final ones by the\ninverse rotation (by the angle −β about the y-axis, after\ninterchanging mi and mf ). Their azimuths are thus\nφ\u0006i = \u0006 arccos\nmi cosβ −mf\nsinβ\np\nJ2 −m2i\n. (2.5)\nHere and throughout the paper we assume that the inverse\ntrigonometric functions are given by their principal values\nand that the azimuths are limited to the interval [−pi, pi].\nObviously, the two final points as well as the two initial\npoints are reflections of one another in the x-z-plane.\nIt is worth emphasizing the important difference between\nthe initial-value problem (θi, φi given) and the boundary-\nvalue problem (θi, θf given): while the former has a unique\nsolution (θf , φf ), the boundary-value problem has, in gen-\neral, two different solutions (φ+i , φ+f ) and (φ−i , φ−f ). Of course,\n118\nthe continuous trajectories leading from the initial points to\nthe final ones as the rotation angle is increased from zero to\nβ are also two in number and run symmetrically with respect\nto the x-z-plane.\nThe classical rotation (2.3) can be looked upon as a\ncanonical transformation for the pair of variables m =\nJ cos θ, φ with the generating function\nS0(mf ,mi) = mi\nJ\narccos\nmi cosβ −mf\nsinβ\np\nJ2 −m2i\n− mf\nJ\narccos\nmi −mf cosβ\nsinβ\nq\nJ2 −m2f\n+ arccos\nmfmi − J2 cosβq\n(J2 −m2f )(J2 −m2i )\n. (2.6)\nThat function also has the meaning of the action of the trajec-\ntory connecting the initial and final points. The derivatives of\nS0 with respect to mi,mf yield, as the “coordinates” canon-\nically conjugate to the “momenta” mf ,mi, the azimuths φ+i\nand −φ+f ,\nJ∂S0\/∂mi = arccos\nmi cosβ −mf\nsinβ\np\nJ2 −m2i\n= φ+i\nJ∂S0\/∂mf = − arccos mi −mf cosβ\nsinβ\nq\nJ2 −m2f\n= −φ+f . (2.7)\nReplacing S0 by −S0 we obtain the other trajectory connect-\ning the initial and final momenta, the azimuths of which are\nφ−i = −φ+i , φ−f = −φ+f . We shall in the following account\nfor the two trajectories by introducing a factor σ = \u00061 and\nwriting σS0 for the action.\n3. WKB approximation for rotation matrix elements\nIn the limit of large total angular momentum, j \u001d 1,\nWigner’s d-functions can be approximated semiclassically.\nDeferring a sketch of the derivation of the well-known WKB\nform [8, 10, 11] to Appendix A we here simply quote the\nresult obtained for rotation angles β in the interval [0, pi],\ndjmf ,mi (β) = (−1)j\ns\n2J\npi\n\f\f\f\f ∂2S0∂mi∂mf\n\f\f\f\f cos(JS0 − pi\/4) , (3.1)\nwhere S0 is the classical action given in (2.6) and, again,\nJ = j + 12 . Curiously, the connection of this well-known\nasymptotic form of the d-function with the classical rotation\nmap (i. e. the appearance of the generating function of the\nclassical map in the semiclassical phase of djmf ,mi ) seems\nnot to have been paid much attention before (see, however,\nRef. [12]).\nThe prefactor of the cosine in the semiclassical d-function\n(3.1) involves the second mixed derivative\n∂2S0\n∂mi∂mf\n=\n1\nJ\n∂φi\n∂mf\n=\n1\nJ\nq\nJ2 sin2 β −m2i −m2f + 2mimf cosβ\n. (3.2)\n0\n0\nmf\nmi\nFig. 2. Elliptic boundary of classically allowed transitions in the mi-mf -\nplane. The gray shade indicates, for j = 50 and β = 1, the squared modulus\nof the matrix element: One sees rapid oscillations inside the classically\nallowed region and exponential decay outside\nThe semiclassical approximation (3.1) is valid when the tran-\nsition mi ! mf is classically allowed, i. e. when the cones\nin Fig. 1 intersect. According to the geometrical interpre-\ntation given above the classically accessible range of the\nquantum numbers mf , mi can be characterized by the in-\nequality θf + θi \u0015 β which implies\nR(mf ,mi)\n\u0011 J2 sin2 β −m2i −m2f + 2mimf cosβ > 0. (3.3)\nThis inequality determines the area inside an ellipse in the\nmi-mf -plane inscribed into the square −J \u0014 mi,mf \u0014 J .\nIt is easy to see that the axes of the ellipse coincide\nwith the diagonals of the square and that its semiaxes\nare\np\n2J cos(β\/2) and p2J sin(β\/2). The ellipse touches\nthe boundary of the square in the four points (mi,mf ) =\n(\u0006J,\u0006J cosβ), (\u0006J cosβ,\u0006J). In the special case of a ro-\ntation by β = pi\/2 the ellipse turns into a circle. Each integer\npoint (mi,mf ) within the elliptic region (3.3) corresponds to\na pair of classical trajectories. The points outside of the re-\ngion (3.3) determine trajectories with complex initial and fi-\nnal azimuths and are consequently of the “ghost” type [6, 7].\nForbidden pairs have complex actions S0 and thus exponen-\ntially small values of the d-function.\nAt the boundary of the classically allowed domain,\nR(mf ,mi) = 0, the second mixed derivative of the action S0\n(3.2) and thus the naive WKB approximation (3.1) diverge.\nThis well-known breakdown is overcome by the so-called\nuniform WKB approximation [13] the derivation of which\nwe also briefly comment on in Appendix A. It suffices to\nwrite down the uniformly approximated d-function under the\nrestriction\n0 < β < pi\/2, mi > 0, jmf j < mi, (3.4)\nsince the symmetry properties\ndjmf ,mi (β) = (−1)mf−midjmi,mf (β)\n= dj−mi,−mf (β) = (−1)mf−midjmf ,mi (−β)\n= (−1)j−midj−mf ,mi (pi − β) (3.5)\n119\nyield the d-functions outside these limitations. The uniformly\napproximated matrix element then takes two slightly differ-\nent forms depending on the sign of mf − mi cosβ. First\nconsider\nmf < mi cosβ. (3.6)\nThen the Airy function Ai (λ) appears as\ndjmfmi (β) =\n\u0014 −4λ\nR(mf ,mi)\n\u00151\/4\nAi (λ). (3.7)\nFor classically allowed index pairs (R(mf ,mi) > 0) the\nargument λ of the Airy function is expressed in terms of the\nclassical action as\nλ = −\n\u001a\n3\n2\nJ\n\u0002\npi − S0(mf ,mi)\n\u0003\u001b2\/3\n, (3.8)\nwhile in the classically forbidden region pi−S0 is imaginary\nand we have\nλ =\n\u001a\n3\n2\nJIm\n\u0002−S0(mf ,mi)\u0003\u001b2\/3 (3.9)\nwith\nIm\n\u0002−S0(mf ,mi)\u0003 = −mf\nJ\narcosh mi −mf cosβ\nsinβ\nq\nJ2 −m2f\n+\nmi\nJ\narcosh jmi cosβ −mf j\nsinβ\np\nJ2 −m2i\n−arcosh jmfmi − J\n2 cosβjq\n(J2 −m2f )(J2 −m2i )\n. (3.10)\nRecalling that we have just specified the uniform WKB\napproximation assuming mf < mi cosβ, we now turn to\nthe opposite case, mf \u0015 mi cosβ. The following modifica-\ntions must be made in the expressions given: (i) The factor\n(−1)j−mi should be introduced in the r. h. s. of (3.7); (ii)\nin (3.8) pi − S0 should be replaced by S0 − (mi\/J)pi; (iii)\nthe sign of the first term in the r. h. s. of (3.10) should be\nchanged.\nIt is worth noting that, formf ,mi considered continuous,\nthe two definitions (3.8,3.9) of the argument λ of the Airy\nfunction join smoothly at the elliptic border R(mf ,mi) = 0\nof the classically allowed and forbidden regions in the mf -\nmi-plane. In fact, λ vanishes identically on that line; this\nis most easily seen when approaching the border from the\nclassically forbidden region; according to R(mf ,mi) = 0,\nthe arguments of all three inverse hyperbolic functions in\n(3.10) are equal to unity such that indeed ImS0 = 0 and thus\nλ = 0 on the elliptic border line. Reasoning similarly when\napproaching the ellipse from within its classically allowed\ninside, one finds S0 = pi and thus again λ = 0.\nIt is well known that the WKB approximation loses its\naccuracy for the wave function of the ground state of an\nautonomous quantum system, due to the close approach of\ntwo turning points of the classical motion. For the same rea-\nson, semiclassical approximations for Wigner’s d-functions\n(including the uniform approximation (3.7)) become inaccu-\nrate when a pair (mf ,mi) approaches any one of the four\npoints of tangency between the ellipse limiting the classi-\ncally allowed region and the lines mf ,mi = \u0006J . Near these\npoints improved asymptotics can be obtained through the\nso-called harmonic-oscillator approximation [9]. As we in-\ndicate in Appendix A, the d-function with mi fixed then\nobeys a second-order differential equation with the indepen-\ndent variable mf . That differential equation turns out as the\nSchro¨dinger equation for the harmonic oscillator with ~ = 1,\nmass m = (J sin2 β)−1, and frequency ω = 1. Denoting its\neigenfunctions by ψn(x) we obtain, near the tangency point\nmi = J \u0019 j, mf = J cosβ,\ndjmf ,mi (β) \u0019 ψj−mi (J cosβ −mf ). (3.11)\nThe behavior near the other three points of tangency can be\nobtained through the symmetry relations (3.5).\n4. Semiclassical trace of the Floquet operator\nAt this point we generalize our discussion to the kicked top\nwith the Floquet operator (1.1). Of course, the case of pure\nlinear rotation is recovered by setting the torsion strength k\nequal to zero. We are interested in the semiclassical limit\nof the spectrum of the Floquet operator F which can be\nobtained if we know the characteristic polynomial of F .\nCoefficients of the latter are simply connected with the traces\nof the powers of the operator F , i. e. trF , trF 2, . . . , trF j\n[14]. We shall show that trFn can be expressed through the\nactions of the period-n solutions of the map corresponding\nto the operator F in the classical limit. This map describes\na rotation about the y-axis by β (see (2.5)) followed by a\nnonlinear torsion about the z-axis. The latter leads to an\nincrement of the azimuth φf proportional to mf so that the\ncomposite transformation reads\nθi = arccos(mi\/J), φ\u0006i = \u0006 arccos\nmi cosβ −mf\nsinβ\np\nJ2 −m2i\nθf = arccos(mf\/J),\nφ\u0006f = \u0006 arccos\nmi −mf cosβ\nsinβ\nq\nJ2 −m2f\n+ (k\/J)mf . (4.1)\nThe angle φf in the equations (2.3) should likewise be in-\ncreased by (k\/J)mf .\nLet us begin by calculating the semiclassical value of the\ntrace of the first power of F . With the help of the jjmi-basis\nwe may write\ntrF =\nX\nm\ne−ikm\n2\/(2J)djm,m(β). (4.2)\nWe here replace the Wigner functions by their WKB asymp-\ntotics and thus obtain a sum of terms which may be con-\nsidered as continuous functions of the quantum number m.\nWe then invoke Poisson’s formula to replace the summation\nover m by a sum of integrals over m,\njX\nm=−j\nf (m) =\n1X\nn=−1\nZ j+1\/2\n−j−1\/2\ndmf (m)e−i2pinm. (4.3)\nWe shall use the simple semiclassical asymptotics (3.1)\nfor the d-functions. Employing, instead of m, the “classical”\nintegration variable ξ = m\/J , we introduce the total classi-\ncal action S(ξf , ξi, σ) which includes the rotational part S0\ndefined in the previous section and the torsional part kξ2f\/2,\n120\nS(ξf , ξi, σ) = σS0(Jξf , Jξi)−\nkξ2f\n2\n=\n= σ\n24ξi arccos ξi cosβ − ξf\nsinβ\np\n1− ξ2i\n− ξf arccos ξi − ξf cosβ\nsinβ\nq\n1− ξ2f\n+ arccos\nξfξi − cosβq\n(1− ξ2f )(1− ξ2i )\n35− kξ2f\n2\n. (4.4)\nWe recall that the discrete variable σ = \u00061 serves to dis-\ntinguish the two symmetric classical trajectories arising for\nfixed initial and final polar angles. Obviously, the torsional\npart of the action yields the correct shift kmf\/J = kξf of\nthe final azimuth through φf = −∂S\/∂ξf . Our trace (4.2)\nnow takes the semiclassical form\ntrF = (−1)j\nX\nσ=\u00061\nX\nn\nZ\ndξ\n\u0002\ns\nJ\n2pi\n\f\f\f\f ∂2S∂ξf∂ξi\n\f\f\f\f\nξf=ξi=ξ\neiJ[S(ξ,ξ,σ)−2pinξ]−iσpi\/4. (4.5)\nSince the second mixed derivative of the torsional part\nof S vanishes identically we could express the normalizing\nfactor of the d-function in terms of S rather than the rota-\ntional action S0. Thus, the derivative in the radicand of (4.5)\nhas the explicit form\n∂2S(ξf , ξi, σ)\n∂ξf∂ξi\n\f\f\f\f\nξf=ξi=ξ\n=\nσp\nsin2 β − 2ξ2(1− cosβ)\n. (4.6)\nTo fully implement the semiclassical approximation we\ntreat each integral in the sum (4.5) by the stationary-phase\nmethod. The points of stationary phase are determined by\n(d\/dξ) [S(ξ, ξ, σ)− 2piξn] = 0 or, more explicitly, by\nkξ\n2\n+ pin = σ arcsin ξ(1− cosβ)\nsinβ\np\n1− ξ2 . (4.7)\nA solution of that equation (4.7) yields a fixed point of\nthe classical map (4.1). In fact, calculating the trace we set\nmi = mf = m which means equality of the initial and final\npolar angles. On the other hand, from\nd\ndξ\n[S(ξ, ξ, σ)− 2pinξ]\n= σ\n\u0002\nφσi (m,m)− φσf (m,m)\n\u0003\nm=Jξ\n− 2pin\n=\n\u0002\nφσi (m,m)− φσf (m,m)\n\u0003\nm=Jξ\n− 2pin (4.8)\nwe see that the stationary-phase condition (4.7) implies\nequality modulo 2pi of the initial and final azimuths.\nTo determine a fixed point θa, φa from (4.7) for given\nvalues of k, β, σ it is convenient to take the tangent of both\nsides of that equation, thus eliminating the multiple of pi.\nOf course, σ = σa equals the sign of φa. Once a fixed\npoint θa, φa is found one may return to the stationary-phase\nequation in the original form (4.7) and determine the integer\nn = na from our convention for the inverse trigonomet-\nric functions, i. e. such that kξ\/2 + pinα lies in the interval\n[−pi\/2, pi\/2]. It is with that and only that value na of n that\nthe fixed point in question makes a non-negligible contribu-\ntion to the sum over n in the semiclassical trace (4.5).\nWe are now all set to employ the stationary-phase ap-\nproximation for the integrals in the trace (4.5). For smooth\nfunctions f (ξ) and g(ξ) and with ξa denoting the roots of\nf 0(ξa) = 0, a = 0, 1, 2, . . . , the asympotic approximation\nin question yields, in the limit of large J ,Z\ndξg(ξ)eiJf (ξ) \u0019\nX\na\ns\n2pi\nJ jf 00(ξa)jg(ξa)e\niJf (ξa)\u0006ipi\/4, (4.9)\nwhere the sign before ipi\/4 should be the same as that\nof f 00(ξa). Applying this to the trace (4.5) we obtain the\nGutzwiller type result\ntrF\n= (−1)j\nX\na\n\u0002\ns\f\f\f\f 1S00a ∂\n2S\n∂ξf∂ξi\n\f\f\f\f\nξf=ξi=ξa\nei[J(Sa−2pinaξa)−αapi\/2]. (4.10)\nHere we denote by Sa the value of the action S(ξ, ξ, σ) and\nby S00a the value of the second total derivative d2S(ξ, ξ, σ)\/dξ2\nat the point ξa, σa. The integer Maslov index αa can take on\nthe values 0,\u00061 and reads αa = (σa − µa) \/2 with µa = \u00061\nthe sign of S00a [15]. The sum is taken over all fixed points\nof the map.\nThe radicand in (4.10) can be expressed in terms of the\ntrace of the so-called monodromy matrix,\ntrM =\n\u0012\n∂φf\n∂φi\n\u0013\nξi\n+\n\u0012\n∂ξf\n∂ξi\n\u0013\nφi\n. (4.11)\nTo that end we once more employ the action in its role as\na generating function, ∂S\/∂ξi = φi, ∂S\/∂ξf = −φf , and\ninfer, with a bit of calculus, the desired identity\n1\nS00a\n∂2S(ξf , ξi, σ)\n∂ξf∂ξi\n\f\f\f\f\nξf=ξi=ξ\n=\n2642 +\n\u0010\n∂φi\n∂ξi\n\u0011\nξf\n−\n\u0010\n∂φf\n∂ξf\n\u0011\nξi\u0010\n∂φi\n∂ξf\n\u0011\nξi\n375\n−1\n= (2− trM )−1 . (4.12)\nSubstituting the expression for Sa and again invoking the\nstationary-phase condition (4.7), we arrive at the fully ex-\nplicit form of our semiclassical trace,\ntrF = (−1)j\n\u0002\nX\na\n\f\f\f\f2(1− cosβ)1− ξ2a − σak\nq\nsin2 β − 2ξ2a(1− cosβ)\n\f\f\f\f−1\/2\n\u0002 exp\n\u0014\niJ\n\u0012\nkξ2a\/2 + σ arccos\nξ2a − cosβ\n1− ξ2a\n\u0013\n+i(µa − σa)pi\/4\n\u0015\n. (4.13)\nAccording to (4.6), the index µa = \u00061 is equal to σa, times\nthe sign of 2 − trM (the expression in the modulus brack-\nets). The reader should wonder about the disappearance of\nthe phase −2pinaξa on the way from (4.10) to (4.13) but\nwill check easily that when invoking the stationary-phase\n121\n−10\n−5\n0\n5\n10\n0 2 4 6 8 10 12 14 16\nRe trF\nk\nquantum\nWKB\n0.0001\n0.001\n0.01\n0.1\n1\n10\n100\n0 2 4 6 8 10 12 14 16\nj∆trF j\nk\nFig. 3. Real part of the exact and the semiclassical trace and modulus of the error, j(trF )s. c. − trF j, versus the torsion constant k for β = pi\/2, j = 250.\nThe error is negligible except for the neighborhoods of the bifurcations at k = 2 and k = 12.73\nequation (4.7) we had to stick to our convention that all in-\nverse trigonometric functions are meant with their principal\nvalues.\nIn general, fixed points of the map have to be found by\nnumerically solving (4.7). Exceptions are represented by the\ntwo trivial points θ = pi\/2, φ = \u0006pi\/2, or ξ = 0, σ = \u00061,\nwhich exist regardless of k. If k < 2 tan β2 , these are the only\nfixed points, and the Gutzwiller development (4.13) acquires\na particularly simple form,\ntrF \u0019 1\ni\n\u0014\neiJβp\n2(1− cosβ) + k sinβ\n− e\n−iJβ\np\n2(1− cosβ)− k sinβ\n\u0015\n. (4.14)\nIn the case of pure rotation (k = 0) this formula gives the\nexact value of the trace of the rotation matrix. We shall come\nback to that special case in a separate section below.\nAs an example we have evaluated trF for the case β =\npi\/2, j = 250 as a function of the torsion constant k. As Fig. 3\nshows, the results provided by the Gutzwiller development\n(4.13) and by the “exact” numerical calculation agree well,\nexcept in the vicinity of the zeros of trM (k)− 2 where the\nsemiclassical expression diverges. Such zeros correspond to\nclassical bifurcations at which new fixed points are born.\nIt is interesting to follow, in Fig. 3, the behavior of the\ntrace trF (k) through the sequence of bifurcations. In the\nrange 0 < k < 2 there exist only the two trivial periodic\npoints already mentioned; the trace, given by (4.14), then\nvaries with k only via the prefactor, i.e. slowly and mono-\ntonically. In the subsequent range 2 < k < 12.73, two new\nfixed points (which differ only in the sign of ξ) contribute\na single oscillating summand in (4.13). With the advent of\nfurther fixed points at k = 12.73 more oscillating terms arise\nwhereupon the k dependence of trF becomes more erratic.\n5. Two-step propagator\nIn order to prepare for the semiclassical evaluation of traces\nof arbitrary powers of the Floquet operator F we here con-\nsider the trace of F 2 which is connected to the once iterated\nclassical map. The matrix element of F 2 is given by\nhm3jF 2 jm1i =\nX\nm2\ndjm3,m2d\nj\nm2,m1e\n−ik(m23+m22)\/2J . (5.1)\nWe now proceed in analogy to the foregoing treatment of\ntrF : First, we employ the semiclassical versions (3.1,2.6)\nof the Wigner functions djm,m′ . With the help of Poisson’s\nidentity we then convert the sum over m2 into an integral\nover a continuous variable and introduce the rescaled quan-\ntities ξi = mi\/J , thus obtaining\nhm3jF 2 jm1i =\nX\nn2\nX\nfσi=\u00061g\n(2pi)−1\nZ\ndξ2\n\u0002\ns\f\f\f\f∂2S(ξ3, ξ2, σ2)∂ξ3∂ξ2 ∂2S(ξ2, ξ1, σ1)∂ξ2∂ξ1\n\f\f\f\f\n122\n\u0002 exp\nn\niJ\n(\nS(ξ3, ξ2;σ2)\n+S(ξ2, ξ1;σ1)− 2pin2ξ2\n\u0001− ipi\n4\n(σ1 + σ2)\no\n. (5.2)\nWe shall eventually evaluate the ξ2 integral in the stationary-\nphase approximation. As a preparation to this step and simi-\nlar ones to be taken later we adopt the notation S2(ξ3, ξ2) \u0011\nS(ξ3, ξ2;σ2) and S1(ξ2, ξ1) \u0011 S(ξ2, ξ1;σ1) and do not even\nassume, momentarily, any special form of S1 and S2. Station-\nary-phase values of ξ2 are determined by\n∂S2(ξ3, ξ2)\n∂ξ2\n+\n∂S1(ξ2, ξ1)\n∂ξ2\n− 2pin2 = 0 . (5.3)\nThis implies that the initial point of the transformation gener-\nated by S2 is the final point of the transformation generated\nby S1; indeed, the two polar angles θi, θf in question are\nboth equal to arccos ξ2 while the foregoing stationary-phase\ncondition equates the two azimuths φi, φf , up to an integer\nmultiple of 2pi.\nThrough a reasoning similar to the one given in the\nprevious section the stationary-phase equation yields ξ2 =\nξ2(ξ3, ξ1) and the integer n2 as functions of ξ3 and ξ1. (There\nmay be several solutions ξ2, n2.) With this in mind we can\nbring the matrix element of F 2 into a form analogous to the\none of F itself. To proceed towards this goal, we differen-\ntiate (5.3) with respect to ξ3 and multiply by ∂ξ2\/∂ξ1, thus\nobtaining\n∂ξ2\n∂ξ1\n∂ξ2\n∂ξ3\n\u0012\n∂2S2(ξ3, ξ2)\n∂ξ22\n+\n∂2S1(ξ2, ξ1)\n∂ξ22\n\u0013\n= −∂\n2S2(ξ3, ξ2)\n∂ξ2∂ξ3\n∂ξ2\n∂ξ1\n\u0011 A . (5.4)\nIn the same manner, by taking the derivative with re-\nspect to ξ1 and multiplying with ∂ξ2\/∂ξ3 we get A =(−∂2S1(ξ2, ξ1)\/∂ξ2∂ξ1\u0001 (∂ξ2\/∂ξ3\u0001. A third equation for the\nauxiliary quantity A is obtained with the help of the action\nof the composite map,\nS(2)(ξ3, ξ1) = S2(ξ3, ξ2(ξ3, ξ1))\n+ S1(ξ2(ξ3, ξ1), ξ1)− 2pin2ξ2(ξ3, ξ1) , (5.5)\nby taking the mixed second derivative to yield\nA = −(∂2S(2)(ξ3, ξ1)\/∂ξ3∂ξ1\u0001.\nThe stationary-phase approximation to the ξ2 integral in\nthe matrix element (5.2) brings the second derivative with\nrespect to ξ2 of the phase S2(ξ3, ξ2) + S1(ξ2, ξ1) into the\nsquare-root factor in front of the exponential; the sign of\nthis derivative will later be denoted by µ3,1. The resulting\ncombined radicand can be transformed using the three fore-\ngoing identities for the auxiliary quantity A to yield\n∂2S2(ξ3, ξ2)\n∂ξ3∂ξ2\n∂2S1(ξ2, ξ1)\n∂ξ2∂ξ1\n∂2S2(ξ3, ξ2)\n∂ξ22\n+\n∂2S1(ξ2, ξ1)\n∂ξ22\n= −∂\n2S(2)(ξ3, ξ1)\n∂ξ3∂ξ1\n. (5.6)\nWe thus arrive at the semiclassical matrix element of F 2,\nhm3jF 2 jm1i =\nX\nσ1,σ2\n(2piJ)−1\/2\nX\nsaddle\npoints\n\f\f\f\f∂2S(2)(ξ3, ξ1)∂ξ3∂ξ1\n\f\f\f\f1\/2\n\u0002 exp\nn\niJS(2)(ξ3, ξ1) + ipi4 (−σ1 − σ2 + µ3,1)\no\n. (5.7)\nThis semiclassical expression for the composite map resem-\nbles the WKB formula (3.1) for the simple matrix element\nhm2jF jm1i.\nFor the calculation of the trace\nP\nm hmjF 2 jmi we once\nmore invoke Poisson’s identity and the stationary-phase ap-\nproximation. In analogy to the first trace we encounter an\namplitude factor j2− trM (2)j−1\/2 involving the trace\ntrM (2) =\n\u0012\n∂φ3\n∂φ1\n\u0013\nm1\n+\n\u0012\n∂m3\n∂m1\n\u0013\nφ1\n(5.8)\nof the monodromy matrix M (2) of the once iterated map.\nThe final result takes the form of a sum over all periodic\npoints of period 2 of the classical map,\ntrF 2 =\nX\npoints\n\f\f2− trM (2)\f\f−1\/2 expniJS(2) − iαpi\n2\no\n. (5.9)\nHere α denotes the integer Maslov index of the fixed point of\nthe iterated map, α =\n(\nσ1 + σ2 − µ1,3 − µ(2)\n\u0001\n\/2, and µ(2) =\n\u00061 is the sign of the second total derivative of the action\nS(2)(ξ1, ξ1) of the composite map with equal arguments. The\nsum is to be taken over all periodic points of period 2, each\nof which is an orbit θ1, φ1 ! θ2, φ2 ! θ1, φ1, with σ1, σ2\nequal to the signs of the azimuths φ1, φ2. Of course, fixed\npoints are to be included as special cases of period-2 points\nas well.\nWith the help of the intervening stationary-phase equa-\ntions we simplify the action S(2) of the composite map as\nS(2)(ξ3, ξ1; fσ1, σ2g)\n\f\f\nξ3=ξ1\n= (σ1 + σ2) arccos ξ1ξ2 − cosβp(1− ξ21)(1− ξ22) + k2 (ξ21 + ξ22) . (5.10)\nJust like for the matrix element, we meet with a semiclassi-\ncal expression for trF 2 resembling the one obtained in the\nprevious section for trF . We are now prepared to estab-\nlish semiclassical approximations of this type for the matrix\nelements and the trace of the multiply iterated map Fn.\n6. Traces of higher powers of the Floquet operator\nSince in the discussion of the stationary-phase condition\n(5.3) we did not specify the actions S1 and S2, we can sim-\nply adapt these considerations to the traces of higher powers\nof the F . We start from the matrix element\nhmn+1jFn jm1i =\nX\nfm2...mng\nnY\nj=1\ndjmj+1,mje\n−ikm2j+1\/2J . (6.1)\nIn the same spirit as above we express the Wigner functions\nby their WKB asymptotics for large J and use Poisson’s\nidentity to transform sums into integrals. After introducing\nthe scaled variables ξi = mi\/J the integrations can be per-\nformed step by step using the stationary-phase approxima-\ntion. At the i-th integration we incur the action S(i) of the\ni−1 times iterated map which is related to the action S(i−1)\nby\nS(i)(ξi+1, ξ1) = Si(ξi+1, ξi(ξi+1, ξ1))\n+S(i−1)(ξi(ξi+1, ξ1), ξ1)− 2piniξi(ξi+1, ξ1). (6.2)\n123\nMoreover, each semiclassical integration brings in a Maslov\nindex µi+1,1 = \u00061, determined by the sign of the second\npartial derivative with respect to ξi of the sum Si(ξi+1, ξi) +\nS(i−1)(ξi, ξ1).\nHaving performed all integrations in the matrix element\n(6.1) we arrive at its semiclassical version\nhm1jFn jmn+1i\n= (−1)jn\nX\nfσi=\u00061g\nexp\n \n−ipi\n4\nnX\ni=1\nσi\n!\u0012\nJ\n2pi\n\u00131\/2\n\u0002\ns\f\f\f\f∂2S(n)(ξn+1, ξ1)∂ξ1∂ξn+1\n\f\f\f\f\n\u0002 exp\n(\niJS(n)(ξn+1, ξ1) + ipi4\nnX\ni=2\nµi+1,1\n)\n. (6.3)\nHere S(n) denotes the action of the n − 1 times iterated\nclassical map,\nS(n)(ξn+1, ξ1)\n=\nnX\ni=1\nS(ξi+1(ξn+1, ξ1), ξi(ξn+1, ξ1);σi)\n−2pi\nnX\ni=2\nniξi(ξn+1, ξ1) , (6.4)\nwhere all intermediate ξi are determined as functions of ξ1\nand ξn+1 by successively using the stationary-phase equation.\nObviously, the matrix element maintains its WKB form pre-\nviously established for n = 1, 2; the same must hold true for\nthe trace\nP\nm hmjFn jmi, which thus takes the form\ntrFn = (−1)jn\nX\npoints\nj2− trM (n)j−1\/2\n\u0002 exp\nn\niJS(n) − ipi\n2\nα\no\n. (6.5)\nHere we have to sum over all periodic points of period n\nwith ξ1 = ξn+1 as they are determined by the stationary-\nphase equations. The points in question include those on\norbits with primitive period n as well as those on sequences\nof orbits whose periods add up to n. The action S(n) is a\nsimple generalization of S(2) given in (5.10),\nS(n) =\nnX\ni=1\nσi arccos\nξiξi+1 − cosβp\n(1− ξ2i )(1− ξ2i+1)\n+\nk\n2\nnX\ni=1\nξ2i . (6.6)\nThe integer Maslov index of a period-n point reads α =\n1\n2\n(Pn\ni=1 σi −\nPn\ni=2 µi+1,1 − µ(n)\n\u0001\nwhere µ(n) = \u00061 is the\nsign of the second total derivative of the total action d2S(n)\n(ξ1, ξ1)\/dξ21 calculated at the point in consideration. The in-\ndex σi (i = 1, . . . , n) indicates the sign of the azimuth of the\ni-th intermediate point whose polar angle is θi = arccos ξi.\nThe prefactor now contains the trace\ntrM (n) =\n\u0012\n∂φn+1\n∂φ1\n\u0013\nm1\n+\n\u0012\n∂mn+1\n∂m1\n\u0013\nφ1\n(6.7)\nof the monodromy matrix M (n) of the n − 1 times iterated\nmap. It can be shown that the trace formula (6.5) is repre-\nsentation independent. In particular, following the strategy\nof [14] it can also be derived in the coherent-state basis [16].\n7. Semiclassical spectrum of pure rotation\nWe now return to the case of the pure rotation, i. e. k = 0,\nfor which both the exact form and the semiclassical approx-\nimation of trFn can be evaluated analytically. The exact\nquantum-mechanical result reads\ntrFn(β) =\njX\nm=−j\ne−imnβ =\nsinn(j + 1\/2)β\nsinnβ\/2\n= trF (nβ). (7.1)\nMuch to our surprise we found the semiclassical approxi-\nmation (6.5) to completely recover this exact result. Loosely\nspeaking we may say that the semiclassical errors incurred\nin the matrix elements and the trace operation cancel one\nanother in the traces. This also entails full agreement of the\nsemiclassical spectrum of the Floquet operator with the ex-\nact one. To appreciate this somewhat peculiar situation it is\nwell to realize a close analogy to other classically regular\ndynamics like the Hydrogen atom and the harmonic oscilla-\ntor: There as well, the WKB approximation yields the right\nspectrum but fails to give the correct wave functions.\nFor a generic rotation, i.e. for any value of β which is not\na rational multiple of 2pi there are two classical fixed points,\neach with ξi = ξf = 0. These correspond to the intersection\nof the sphere of constant J2 and the y-axis and thus have σ =\n\u00061. All longer periodic orbits are composed of these trivial\nones. As a first step towards establishing the equality of the\nsemiclassical and quantum traces we have checked that the\nidentity trFn(β) = trF (nβ) is not fouled up semiclassically.\nWe shall not bother to write out the corresponding technical\ngame which mostly amounts to struggling with the Maslov\nindices. Suffice it to say that we must start from a slightly\ngeneralized version of the semiclassical trace (4.13) which\nno longer requires the rotation angle to lie in the interval\n[0, pi],(\ntrF (nβ)\u0001s.c. = (−1)j X\npoints\nj2− trM j−1\/2\n\u0002 exp\nn\niJsgn (n sinβ)σ\n\u0002 arccos ξ\n2 − cosnβ\n1− ξ2 + i(µ− sgn (sinnβ)σ)\no\n. (7.2)\nObviously, the factors sgn (sinnβ) are the prize to pay for\nremoving all restrictions on nβ. The prefactor involving the\nmonodromy matrix can be calculated from the classical map\nas\nj2− trM (1)(nβ)j−1\/2\n= (2− 2 cos(nβ))−1\/2 = 1\n2j sinnβ\/2j . (7.3)\nFinally, the Maslov index arises within the final stationary-\nphase approximation as\nµ = σsgn\n\u0012\nd2S0(ξ, ξ)\ndξ2\n\u0013\n= σsgn (sinnβ). (7.4)\nWith these ingredients one easily checks the semiclassical\ntraces to equal the exact quantum-mechanical ones (7.1).\nLesser fortune is incurred when nβ is a multiple of 2pi\nwhich means Fn = 1 and dm,m′ = δm,m′ . In this case the\ntrace formula (7.1) has to be regularized to yield the value\n124\n2J . Alas, the naive WKB approximation leads to a divergent\nd-function since the border between the classical allowed\nand forbidden region degenerates to the diagonal of the ma-\ntrix in this case. It is thus only for generic angles of rotation\nthat the naive WKB approximation gives the exact Floquet\nspectrum.\n8. Semiclassical spectrum of the kicked top\nThe Floquet spectrum of the periodically kicked top was\nrecently calculated by diagonalizing the semiclassically ap-\nproximated Floquet matrix, in a matrix representation based\non coherent states [5]. The semiclassical limit for all matrix\nelements was implemented as a stationary-phase approxima-\ntion in a suitable integral representation for the torsional part\nof F ; the linear-rotation part contributes a simple rigorously\ncalculable factor to the matrix element in the coherent-state\nrepresentation. (Note, incidentally, the interesting “comple-\nmentarity” to the (J2, Jz)-representation employed in the\npresent paper: Here it is the torsional part that enjoys a sim-\nple rigorous form of its matrix element while the rotational\npart requires a semiclassical approximation.) The accuracy\nfor the 2j + 1 eigenvalues of F was found to be about 3%\nof the mean spacing 2pi\/(2j + 1) of the eigenphases.\nFrom a classical point of view the coherent states em-\nployed in Ref. [5] have the intuitive appeal that their span\nin the phase space shrinks to a point in the classical limit.\nHowever, this nice property actually makes for a drawback\nfor the semiclassical behavior of matrix elements between\ntwo coherent states: No classical trajectory can in general be\nassociated with such a matrix element simply because speci-\nfying both the initial and final phase-space points amounts to\nan overdetermination of the classical trajectory. As a conse-\nquence, the semiclassical Floquet matrix is built from contri-\nbutions of “ghost trajectories”, i. e. complex solutions of the\nreal equations of motion, which are entities rather removed\nfrom classical reality [6, 7]. Nevertheless the excellent accu-\nracy obtained for the spectrum in the limit of small 1\/j \/ ~\ngives support to the expectation that chaotic as well as regu-\nlar dynamical systems do allow for systematic semiclassical\napproximations for their spectra.\nWe here employ the 2j+1 angular-momentum eigenstates\njj,mi with fixed j as a basis and semiclassically approxi-\nmate the matrix elements hj,mjF jj,m0i. As was explained\nin the foregoing sections the fraction (pi\/4) sinβ of the total\nnumber (2j + 1)2 of these matrix elements corresponds to\nclassical trajectories. No overdetermination is incurred since\nby fixing the initial and final quantum numbers mi,mf we\nspecify initial and final momenta for the classical trajectory.\nOnly for pairs mi,mf outside the ellipse of Fig. 2 there are\nno classically permissible trajectories. Since these classically\nforbidden pairs amount only to the fraction 1 − (pi\/4) sinβ\nof all pairs one might expect that by working with the ba-\nsis formed by the angular momentum eigenstates jj,mi one\nmakes better use of classical reality than is possible with the\ncoherent-state basis. Indeed, for all matrix elements corre-\nsponding to classically allowed trajectories these and only\nthese solutions of the stationary-phase equations are needed\nto determine the semiclassical approximation; that approxi-\nmation is then at least as easily implementable as the calcu-\nlation of the quantum mechanically exact value of the matrix\nelement. On the other hand, a lot more and harder work was\nnecessary in the coherent-state basis, since the stationary-\nphase equation arising there for every matrix element has an\ninfinity of ghost trajectories as solutions many of which may\nmake quantitatively important contributions to the matrix el-\nement, while others must be discarded since they cannot be\nreached by allowable paths of integration. It is thus fair to\nsay that diagonalizing the Floquet matrix after semiclassi-\ncally approximating its elements in the (J2, Jz) basis is an\nefficient strategy to establish the semiclassical quasienergy\nspectrum.\nIn order to ascertain the accuracy of the semiclassical\nspectrum we must compare it with the exact one. To that\nend we have also diagonalized the exact Floquet matrix\nhj,mf jF jj,mii = e−ikm2f\/2Jdmf ,mi (β) after numerically\nevaluating the matrix elements dmf ,mi (β). An efficient way\nto do that for large j employs the well known recurrence\nrelation [17]\ndm1\u00061,m2 (β) =\n1\nf (\u0007m1)\n\u0002\n\u0012\nm2 −m1 cosβ\nsinβ\ndm1,m2 − f (\u0006m1)dm1\u00071,m2\n\u0013\n(8.1)\nwhere f (m) = 12\np(j +m)(j −m + 1). To minimize accu-\nmulation of numerical errors we had to use both starting\npoints dj,j(β) =\n\u0010\ncos β2\n\u00112j\n, d−j,j(β) =\n\u0010\nsin β2\n\u00112j\n, and the\nsymmetry properties (3.5).\nLet us finally turn to our numerical results. The exact\neigenvalues of F all lie on the unit circle in the plane of\ncomplex numbers, due to the unitarity of F . The semiclas-\nsical approximation slightly violates unitarity and thus gives\nrise to radial as well as phase errors, both of the order 1\/j\nfor large j. Errors of that order threaten, of course, to ren-\nder useless calculations of lowest order in ~ \/ 1\/j since the\nmean spacing between neighboring eigenphases, 2pi\/(2j+1),\nis of that very same order. It was in fact the principal result\nof Ref. [5] that the error is such a small fraction of the mean\nspacing that each approximate eigenvalue can be uniquely\nassociated with its exact partner. We here recover such fine\naccuracy.\nAs quantitative measures of the errors incurred we em-\nploy the root mean squares of the deviations of (i) the moduli\nrsci of the semiclassical eigenvalues from unity and (ii) the\nsemiclassical quasienergies alias eigenphases φsci from their\nexact counterparts φi,\n∆r =\nvuut 1\n2j + 1\n2j+1X\ni=1\n(rsci − 1)2,\n∆φ =\nvuut 1\n2j + 1\n2j+1X\ni=1\n(φsci − φi)2, (8.2)\nwith the means taken over all 2j + 1 eigenvalues of a spec-\ntrum. We display these errors as functions of the quantum\nnumber j in Fig. 4. The first of them (Fig. 4a) pertains to\nvanishing torsion strength, k = 0, i. e. the case of a pure rota-\ntion by the angle β = 1 about the y-axis. Both the radial and\n125\n10 100\n0.01\n0.1\n1\n∆r\n2\u0019=(2j + 1)\n\f = 1, k = 0 \u0006\n\u0006\n\u0006\n\u0006 \u0006\n\u0006 \u0006\n\u0006 \u0006\n\u0006 \u0006 \u0006\n\u0006\u0006 \u0006\n\u0006\n∆φ\n2\u0019=(2j + 1)\n10 100\n0.01\n0.1\n1\n(a)\n\f = 1, k = 0 \u0006\n\u0006\n\u0006 \u0006 \u0006 \u0006 \u0006\u0006 \u0006 \u0006 \u0006 \u0006 \u0006\u0006 \u0006 \u0006\n0.01\n0.1\n1\n\f = \u00192 , k = 1 \u0006\n\u0006 \u0006\n\u0006 \u0006 \u0006 \u0006\u0006 \u0006\n\u0006 \u0006\n\u0006\n\u0006\u0006\n\u0006\n\u0006\nwith oscillator approximation +\n+ + + +\n+ + + +\n+ + +\n+ +\n+\n+\nwith coherent states \u0003\n\u0003\n\u0003\n\u0003\n\u0003 \u0003 \u0003\u0003 \u0003 \u0003\n\u0003 \u0003\n0.01\n0.1\n1\n(b)\n\f = \u00192 , k = 1 \u0006\n\u0006 \u0006\n\u0006 \u0006 \u0006\n\u0006\u0006 \u0006\n\u0006 \u0006\n\u0006\n\u0006\u0006\n\u0006\n\u0006\nwith oscillator approximation +\n+ + + +\n+ + +\n+ +\n+ +\n+ +\n+\nwith coherent states \u0003\n\u0003\n\u0003\n\u0003\n\u0003\n\u0003 \u0003\u0003 \u0003 \u0003\n\u0003 \u0003\n0.01\n0.1\n1\n10 100\nj\n\f = \u00192 , k = 8 \u0006\n\u0006 \u0006 \u0006 \u0006\n\u0006 \u0006\u0006 \u0006 \u0006\n\u0006 \u0006 \u0006\u0006 \u0006 \u0006\nwith oscillator approximation +\n+ + + +\n+\n+\n+ + +\n+ + + + + +\nwith coherent states \u0003\n\u0003\n\u0003\n\u0003\n\u0003\n\u0003\n\u0003\u0003\n\u0003\n\u0003\u0003 \u0003 \u0003\n\u0003\n0.01\n0.1\n1\n10 100\nj\n(c)\n\f = \u00192 , k = 8 \u0006\n\u0006\n\u0006\n\u0006\n\u0006 \u0006\n\u0006\u0006\n\u0006 \u0006 \u0006 \u0006 \u0006\u0006\n\u0006 \u0006\nwith oscillator approximation +\n+\n+\n+\n+ +\n+\n+\n+ + + + + + + +\nwith coherent states \u0003\n\u0003 \u0003\n\u0003\n\u0003 \u0003\n\u0003\u0003\n\u0003\n\u0003\u0003 \u0003 \u0003\u0003\nFig. 4. Relative error of eigenphases (right column) and radii (left column) of the semiclassical eigenvalues for a β = 1, k = 0, b β = pi\/2, k = 1, and c\nβ = pi\/2, k = 8\nthe phase error turn out as roughly 1% of the mean spacing.\nNeedless to say that in this fully integrable case the exact\neigenphases are known explicitly as the eigenvalues of Jy\ntaken modulo 2pi. Next, Fig. 4b gives the errors for the case\nβ = pi\/2, k = 1 which is classically characterized by a mixed\nphase space with small chaotic islands and regular motion\neverywhere else. Again, the errors never exceed a few per-\ncent of the mean spacing in the range of j investigated; the\nslight growth with j might be a purely numerical artefact.\nInterestingly, the error incurred with the uniform WKB ap-\nproximation for the linear rotation can be reduced by roughly\na factor 2 by resorting to the harmonic-oscillator approxima-\ntion (3.11) for the matrix elements with mi \u0019 \u0006j, mf \u0019 0\nor mf \u0019 \u0006j, mi \u0019 0. It is also interesting to see that for\nthis near integrable case the results previously obtained with\nthe coherent-state basis are slightly superior to the ones ad-\nvocated here; this is quite intuitive since the semiclassical\ntreatment of linear rotation in the coherent-state basis is in\nfact rigorous [14] and since a torsion of strength k = 1 is\nbut a small perturbation of the linear rotation. As soon as\nwe crank up the torsion strength k to secure predominance\nof chaos in the classical phase space we obtain better accu-\nracy with the (J2, Jz) basis, as is revealed in Fig. 4c for the\ncase k = 8, β = pi\/2: With the refinement provided by the\nharmonic-oscillator approximation mentioned above we get\nthe quasienergies to within 1% of the mean spacing and the\nmoduli even slightly better.\nWe gratefully acknowledge support by the Sonderforschungsbereich “Un-\nordnung und große Fluktuationen” of the Deutsche Forschungsgemein-\nschaft, the International Science Foundation (Grant R21000), and the Rus-\nsian Fundamental Research Fund (Grant No. 94-02-06022-a). We thank\nMarek Kus´, Bruno Eckhardt, and Eugene Bogomolny for helpful discus-\nsions.\n126\nAppendix A: Derivation of WKB asymptotics\nThe asymptotics of Wigner’s d-functions in the limit of large\nangular momenta was originally obtained by solving their\ndifferential equation in the WKB approximation [10, 11].\nWe shall here sketch the less known but somewhat more\neconomical WKB treatment of the recursion relations (8.1).\nFor a more detailed presentation we refer to [8].\nMomentarily simplifying the notation as djmf ,mi ! dmf\nwe write (8.1) in the form of a Hermitian three-step recur-\nrence relation\npmdm−1 + (wm − E)dm + pm+1dm+1 = 0, (A1)\nwhere the eigenvalue E plays the role of the second in-\ndex mi; the coefficients pm, wm may be read off from\nthe original relation (8.1) as wm = m cosβ and pm =\n1\n2 sinβ[(j + m)(j − m + 1)]\n1\n2\n. We again extend the inde-\npendent variable m from integer to continuous. To construct\nthe asymptotic solution we assume the coefficients to depend\nbut weakly on m and make the ansatz\ndm = A(m) eiS(m) (A2)\nwith slowly varying amplitude A and “action” S. In view\nof pm = O(j), ∂pm\/∂m = O(1) it is consistent to assume\nthat the derivatives of the action and the amplitude have the\nweights A(n) = O(j−n), S(n) = O(j1−n). By expanding these\nfunctions as S(m \u0006 1) = S(m) \u0006 S0(m) + 12S00(m) etc. we\neasily find, to lowest order in 1\/j and up to a normalization\nfactor,\ndm \u0019 dWKBm \/\n1h\n2pm+ 12 sinφ\ni1\/2 cos \u0014Z m\nm0\nφ(n)dn + θ0\n\u0015\n(A3)\nwith the function\nφ(m) = arccos E − wm\n2pm+ 12\n(A4)\ndeterminig both the action, S0 = φ, and the prefactor; θ0 is\na constant to be determined below. As long as the function\nφ(m) is real, the solution (A3) oscillates. This is the case\nwhen the argument of the arccosine lies between −1 and\n1 and characterizes the “classically allowed region” of the\nvariable m; beyond that region one of the two fundamental\nsolutions of the recursion relation grows exponentially while\nthe other one decays. One can also speak about “turning\npoints” of m separating classically allowed and forbidden\nregions. These are the values of m (not necessarily integer)\nwhich satisfy the equations φ(m) = 0 and φ(m) = pi and are\ncommonly called the “usual” and “unusual” turning points,\nrespectively.\nConsider a usual turning pointmt and suppose that φ(m)\nis real to the right of mt. It can be shown that within\nthe allowed region the physically acceptable solution which\nmatches to a decaying exponential for m < mt is ob-\ntained if we take m0 = mt in (A3) and choose the phase\nas θ0 = −pi\/4. (For an unusual turning point the matching\nphase would read θ0 = mtpi + pi\/4.)\nSuppose now that the classically allowed region of m is\nbounded on both sides by two turning points. The asymptotic\nsolution which decays both to the left and to the right of the\nallowed region exists only for discrete values of E which\nare the (asymptotic) eigenvalues of the recursion relation.\nThe corresponding eigenvector fdmg can be normalized asP\nm d\n2\nm = 1.\nThere is a simple connection between the WKB solu-\ntions of recurrence relations and differential equations [18].\nIndeed, the function g(m) = (S0(m))− 12 eiS(m) obeys the dif-\nferential equation\ng00(m) + (S0(m))2g(m) = 0, (A5)\nprovided one drops, with appeal to the slow variation in\nm and in the spirit of the WKB approximation, correction\nterms involving second and higher derivatives of S(m). We\nidentify again S0(m) = φ(m). Then if mt is a usual turn-\ning point of the recursion relation (A1) with the function\nφ(m) positive for m > mt and imaginary for m < mt,\nthe differential equation (A5) has that same turning point,\nwith classically allowed and forbidden regions situated at\nm > mt and m < mt, respectively. Within the classically\nallowed region (A5) has the WKB solution matched with\nthe solution decreasing outside,\ngWKB(m) \/ 1[φ(m)]1\/2 cos\n\u0012Z m\nmt\nφ(n0)dn0 − pi\/4\n\u0013\n. (A6)\nComparing (A6) and (A3) we see that the semiclassical\nasymptotics of the recurrence relation and the differential\nequation are related by\ndWKBm =\ns\nφ(m)\nsinφ(m)g\nWKB(m). (A7)\nThe connection just established allows to construct an\nimproved WKB solution of the recurrence relation which\ndoes not diverge at the turning point. We simply have to in-\nvoke the well known uniform WKB solution of the differen-\ntial equation (A5) which remains valid in the vicinity of the\nturning point and provides a smooth interpolation between\nthe semiclassical approximations in the classically allowed\nand forbidden regions (cf. [19, 10.4.111-116]),\ngunif(m) =\n\u0014\nξ(m)\nφ2(m)\n\u00151\/4\nAi (λ(m)). (A8)\nHere Ai (λ) is the Airy function. Its argument,\nλ(m) = −\n\u0012\n3\n2\nZ m\nmt\nφdn\n\u00132\/3\n, m > mt,\nλ(m) =\n\u0012\n3\n2\nZ mt\nm\njφjdn\n\u00132\/3\n, m < mt, (A9)\nis a smooth monotonically growing function of m pass-\ning through zero in the turning point. By replacing in\nthe r. h. s. of (A7) the primitive WKB solution gWKB of\nthe differential equation (A5) by its more sophisticated\nversion gunif, we obtain the desired improvement of the\nsemiclassical solution of the recurrence relation. Actually,\nthis is true only if mt is a usual turning point since for\nφ(mt) = pi the transformation (A7) becomes singular. The\ncase of an unusual turning point is treated by substituting\n127\ndm ! (−1)mdm in the recurrence relation (A1) whereupon\nmt becomes a usual turning point.\nUp to here our reasoning has not made use of the spe-\ncial form of the coefficients pm, wm pertaining to Wigner’s\nd-function. Invoking these forms we recover the result exten-\nsively used in the main body of the paper, i. e. (3.1,3.2) for\nthe d-function and the turning points in accord with the pre-\nviously encountered classically allowed elliptic region (3.3).\nIn a similar way, the above connection (A7) with gWKB\ntaken as the uniform asymptotic solution of the differential\nequation (A5) leads to the uniform asymptotics (3.7) of the\nd-function.\nThe foregoing asymptotic analysis rests on the formal\nassignment of orders in ~ \/ 1\/j as pm = O(j), p0m = O(1)\nand therefore breaks down when m approaches the values\n\u0006j; in that range the coefficient pm ceases to vary slowly\nwith m and the WKB approximation looses its validity. A\nsimilar failure is observed if it is mi which tends to its ex-\ntremal values \u0006j whereupon the turning points move close\nto one another. This is analogous to the well-known inappli-\ncability of the WKB method to the ground states of quantum\nsystems.\nWe must worry about the inadaequacy of the WKB ap-\nproximation just mentioned when the point in the mf -mi-\nplane defined by the subscripts mf ,mi of the d-function\nis close to one of the tangency points between the el-\nlipse bounding the classically allowed region and the square\njmf j = J, jmij = J (Fig. 2). There are four such points;\nhowever due to the symmetry conditions (3.5) it is sufficient\nto consider, say, the one corresponding to mf = J cosβ,\nmi = J . In its vicinity the d-functions change slowly with\neach step of the recursion relation (8.1). This can be inferred\nfrom the fact that the function φ(mf ) determining the incre-\nment of the phase of the WKB solution (A3) is almost zero\nin this area. Therefore we can replace the finite differences\nin (8.1) by Taylor expansions as\ndjmf\u00061,mi \u0019\n \n1\u0006 ∂\n∂mf\n+\n1\n2\n∂2\n∂m2f\n!\ndjmf ,mi . (A10)\nWe similarly expand the off-diagonal coefficients in (8.1) in\npowers of mf − J cosβ and employ\nsinβ\nq\nJ2 −m2f \u0019 J sin2 β − cosβ\n\u0002(mf − J cosβ)− (mf − J cosβ)\n2\n2J sin2 β\n(A11)\nfor the coefficient of djmf ,mi while leaving only the zeroth-\norder term in the coefficient of the derivatives of the d-\nfunction (An estimate of errors introduced by this type of\napproximation and the higher-order corrections can be found\nin [9]). By finally changing notations as\nn = j −mi, x = mf − J cosβp\nJ sin2 β\n,\nψn(x) = 4\nq\nJ sin2 β djmf ,j−n (A12)\nwe turn the recursion relation for djmf ,mi into Schro¨dinger’s\nequation for the harmonic oscillator,\n−1\n2\nd2ψn\ndx2\n+\nx2\n2\nψn(x) =\n\u0012\nn +\n1\n2\n\u0013\nψn(x). (A13)\nBy normalizing that state to unity we recover the desired\nharmonic-oscillator approximation for the properly normal-\nized d-functions with mi close to j.\nReferences\n1. F. Haake, M. Kus´, R. Scharf: In F. Haake, L. M. Narducci, D. F.\nWalls (eds.): Coherence, Cooperation, and Fluctuations, Cambridge\nUniversity Press, Cambridge (1986)\n2. F. Haake, M. Kus´, R. Scharf, Z. Phys. B 65, 381 (1987)\n3. H. Frahm, H. J. Mikeska: Z. Phys. B 60, 117 (1985)\n4. F. Haake, Quantum Signatures of Chaos, Springer, Berlin (1991)\n5. P. Gerwinski, F. Haake, M. Kus´, H. Wiedemann, K. ˙Zyczkowski, Phys.\nRev. Lett. 74, 1562 (1995)\n6. M. Kus´, F. Haake, D. Delande, Phys. Rev. Lett. 71, 2167 (1993)\n7. R. Balian, G. Parisi, A. Voros, Phys. Rev. Lett. 41, 1141 (1978); R.\nBalian, in: Discourses in Mathematics and its Applications, No. 1,\nEds. S. A. Fulling, F. J. Narcovich, Dept of Mathematics, Texas A&M\nUniversity, College Station, Texas (1991)\n8. P. A. Braun, Rev. Mod. Phys. 65, 115 (1993).\n9. P. A. Braun, Opt. Spectrosc. (USSR) 66, 32 (1989)\n10. P. Brussard, H. Tolhoek, Physica 23, 955 (1957).\n11. P. Ponzano, T. Regge, in Spectroscopic and Group Theoretical Meth-\nods in Physics, edited by F. Bloch, S. G. Cohen, A. De-Schalit, S.\nSambursky, I. Talmi (Wiley, New York), p.53\n12. W. M. Miller, Adv. Chem. Phys. 25, 69 (1974)\n13. L. C. Biedenharn, J. D. Louck, The Racah-Wigner Algebra in Quantum\nTheory (Encyclopedia of Mathematics and Its Applications, Volume 9,\nAddison-Wesley, 1981)\n14. M. Kus´, F. Haake, B. Eckhardt, Z. Phys. B 92, 221 (1993)\n15. G. Junker, H. Leschke, Physica D 56, 135 (1992)\n16. Actually, the trace formula of [14] contains a phase factor for which\nno semiclassical explanation could be given. That phase factor does\nnot arise for the new definition of the Floquet operator F given in\n(1.1), due to the semiclassically more appropriate scaling of the torsion\ngenerator.\n17. D. A. Varsˆalovicˆ, Kvantovaja teorija uglovogo momenta, Singapore,\nWorld Scientific (1988)\n18. K. Schulten, R. G. Gordon, J. Math. Phys. 16, 1971 (1975)\n19. M. Abramowitz, I. A. Stegun: Handbook of mathematical functions,\nDover Publications, inc., New York, 1965\n"}