{"doi":"10.1109\/INM.2007.374716","coreId":"102756","oai":"oai:epubs.surrey.ac.uk:2278","identifiers":["oai:epubs.surrey.ac.uk:2278","10.1109\/INM.2007.374716"],"title":"A framework for lightweight QoS provisioning: Network planes and parallel Internets","authors":["Wang, N","Griffin, D","Spencer, J","Griem, J","Sanchez, JR","Boucadair, M","Mykoniati, E","Quoitin, B","Howarth, MP","Pavlou, G"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2278<\/identifier><datestamp>\n      2017-10-31T14:04:54Z<\/datestamp><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2278\/<\/dc:relation><dc:title>\n        A framework for lightweight QoS provisioning: Network planes and parallel Internets<\/dc:title><dc:creator>\n        Wang, N<\/dc:creator><dc:creator>\n        Griffin, D<\/dc:creator><dc:creator>\n        Spencer, J<\/dc:creator><dc:creator>\n        Griem, J<\/dc:creator><dc:creator>\n        Sanchez, JR<\/dc:creator><dc:creator>\n        Boucadair, M<\/dc:creator><dc:creator>\n        Mykoniati, E<\/dc:creator><dc:creator>\n        Quoitin, B<\/dc:creator><dc:creator>\n        Howarth, MP<\/dc:creator><dc:creator>\n        Pavlou, G<\/dc:creator><dc:date>\n        2007<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2278\/1\/SRF002064.pdf<\/dc:identifier><dc:identifier>\n          Wang, N, Griffin, D, Spencer, J, Griem, J, Sanchez, JR, Boucadair, M, Mykoniati, E, Quoitin, B, Howarth, MP and Pavlou, G  (2007) A framework for lightweight QoS provisioning: Network planes and parallel Internets  In: 10th IFIP\/IEEE International Symposium on Integrated Network Management, 2007-05-21 - 2007-05-25, Munich, GERMANY.     <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4258607&tag=1<\/dc:relation><dc:relation>\n        10.1109\/INM.2007.374716<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2278\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4258607&tag=1","10.1109\/INM.2007.374716"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"A Framework for Lightweight QoS Provisioning:\nNetwork Planes and Parallel Internets\nN. Wang', D. Griffin2, J. Spencer2, J. Griem2, J. Rodriguez Sa6nchez3, M. Boucadair4, E. Mykoniati5, B. Quoitin6,\nM. Howarth', G. Pavloul, A. J. Elizondo3, M. L. Garcia Osma3 and P. Georgatsos5\n'University of Surrey, United Kingdom\n2University College London, United Kingdom\n3Telef6nica Investigacion y Desarrollo, Spain\n4France Telecom R&D, France\n5Algonet S. A. Greece\n6Universite catholique de Louvain, Belgium\nAbstract- In this paper we introduce the concepts of Network Planes\nand Parallel Internets, with the objective of designing and\nimplementing a lightweight solution for viable end-to-end QoS\nprovisioning. The proposed solution can be deployed with very small\nincremental additions to the existing best-effort Internet. Through\nNetwork Plane engineering and interconnection, mainly by means of\nintra- and inter-domain routing differentiation, end-to-end service\ndifferentiation across the Internet can be achieved.\nI. INTRODUCTION\nThe Internet is evolving to become a multi-service platform that\nis able to support diverse multimedia applications. In order to\nbetter support emerging services such as video streaming, IP\nTelephony, Virtual Private Networks (VPNs) etc., Quality of\nService (QoS) awareness has become an essential requirement for\nguaranteeing end-to-end performance. Differentiated Services\n(DiffServ) [1] has been regarded as a promising attempt based on\ndifferentiated forwarding mechanisms that can be used to build a\nsmall number of QoS classes. Although DiffServ can serve as a\npractical control\/data plane forwarding mechanism that supports\nQoS differentiation, a comprehensive solution for QoS\nprovisioning is still missing due to the lack of other supporting\ntechniques such as QoS-aware routing, resource management and\nalso appropriate cooperation between individual administrative\ndomains for enabling end-to-end QoS across the Internet.\nThe recent emergence of new players, such as Skype and\nYahoo! indicates the separation of service and network plane\nadministrations, leading to a distinction between the Service\nProvider (SP) and IP Network Provider (INP) business roles. By\ndecoupling these roles, the market for added-value IP-based\nservices will open up and new multimedia services will become\nwidely available, in addition to the plain Internet access services\noffered today. A key aspect in this multi-provider environment is\nthe vertical cooperation of SPs with INPs and the horizontal\ncooperation between INPs and between SPs for inter-provider\nservice delivery. Although added-value services can be provided\nin a single administrative domain with appropriate network and\ntraffic engineering techniques (e.g., through MPLS), lightweight\napproaches are still desired for more scalable QoS provisioning\nsolutions. Moreover, interconnection agreements and cooperative\nnetwork engineering are needed in addition for end-to-end service\nprovisioning across multiple administrative domains, which has\nnot yet been fully investigated till now.\nThe EU IST AGAVE project [3] aims to design and implement\na lightweight approach for achieving end-to-end QoS across the\nInternet. In this paper, we describe the AGAVE QoS provisioning\napproach, which assumes the decoupling of SP and INP business\nroles. Specifically, the SP offers IP-based services to end\ncustomers relying on INPs for fulfilling the IP connectivity\naspects of the offered services, while the INP provides IP\nconnectivity to SPs and not directly to end customers. We propose\nthe concept of Parallel Internets (PIs) as an innovative way to\nenable end-to-end service differentiation at the IP level in terms of\nnot only traditional QoS such as delay and loss, but also resilience\nand availability. Specifically, Parallel Internets are coexisting\nparallel networks composed of interconnected per-domain planes.\nWe call the distinct planes within each domain Network Planes\n(NPs). Network Planes are setup to transport traffic flows from\nservices with common connectivity requirements. The traffic\ndelivered within each Network Plane has particular treatment in\nboth forwarding and routing so that service differentiation across\nNPs is enabled in terms of edge-to-edge QoS, availability and\nresilience.\nII. A LIGHTWEIGHT FRAMEWORK FOR QOS PROVISIONING\nWe introduce the concept of Network Planes to denote and to\ndifferentiate the IP transfer treatment experienced by IP flows\nwhen crossing an IP realm managed by a single INP. NPs are\ninternal to INPs and they can be created proactively or to support\nthe specific requirements imposed by a particular SP. An NP can\nbe used to convey traffic from one or several services managed by\nthe same or different SPs. The INP and the SP agree on the\nclassification, invocation and access rules for the traffic associated\nwith the service managed by the SP but the association between\n1-4244-0799-0\/07\/$25.00 t2007 IEEE 797\nservice requirements and NP is an internal INP matter, not visible\nto SPs.\nA Network Plane is defined as the combined tuning of several\nprocesses, across one or more of the dimensions listed below:\n(1) The Routing dimension. The treatment of the IP packets can\nbe differentiated on the basis of routing policies and\nconfiguration. Differentiated routing can be implemented at\nseveral levels:\n* Dedicated topology: Dedicated topology can be physical or\nlogical topology. Therefore, several routing adjacencies can be\nmaintained. These adjacencies are, for instance, the result of\nincluding or excluding certain nodes or links;\n* Dedicated routing selection process: Several route selection\nprocesses can be configured, each of them being dedicated to\none or multiple NPs. These multiple route selection processes\ncan operate either on the same topology or on dedicated\ntopologies. The behaviour of each route selection process is\ndifferent;\n* Diferent fast reroute procedures: This is specifically for\nresilience purposes. The routing process corresponding to a\ntopology can be enhanced to support fast rerouting when\nfailures occur at the given topology;\n* Diferent policies and metrics: An alternative to implement\ndifferentiated routing is to have a dedicated metric value for\neach NP. Therefore, the selected path will not be the same\ntowards the same destination for the traffic of different NPs.\n(2) Forwarding dimension. At the forwarding level, an INP can\nengineer its IP forwarding mechanisms so as to have distinct\nforwarding behaviours by configuring different strict priority or\nfair-queuing classes over a common scheduler, assigning\ndedicated scheduling resources, differentiating dropping policies,\ndifferentiating failure detection means, etc. A typical example\nwould be the DiffServ paradigm.\n(3) Resource Management dimension. The treatment experienced\nby IP packets can be differentiated by (a) having different shaping\nand policing rules, and (b) the amount of admitted traffic given\nthe capacity, also denoted as overprovisioning factor.\nThe concept of Parallel Internets is introduced as an innovative\nway to enable end-to-end service differentiation in terms of\nnetwork QoS, resilience and availability. Specifically, Parallel\nInternets are coexisting parallel networks composed of\ninterconnected Per-Domain Network Planes. Parallel Internets are\nconstructed from the perspectives of each INP, by configuring for\neach Network Plane different inter-domain routes to certain\ndestinations, based on local criteria. For each Network Plane,\ntraffic may exit the INP domain through a different AS Border\nRouter (ASBR), or through different portions of the same inter-\ndomain link (e.g. based on forwarding differentiation). Moreover,\ndifferent Network Planes may use different intra-domain routes.\nAs a result, traffic classified at ingress nodes to different Network\nPlanes may be delivered through dedicated intra- and inter-\ndomain routes. This way, INPs would be able to support different\nlevels of availability, resilience and QoS to remote destinations by\ndifferent inter-domain routes appropriate to the requirements of\nthe particular NP and the service traffic carried over it.\nIII. NETWORK PLANE IMPLEMENTATION\nA. Network Plane Engineering\nThe engineering of Network Planes is achieved through tuning\none or multiple dimensions mentioned above. In this section, we\nprovide a set of techniques, specifically in the routing dimension,\nthat may be used alone or combined with other ones (like\nDiffServ-based forwarding). It is worth mentioning that, these\nrouting techniques have different capabilities in providing QoS,\navailability and resilience guarantees, and INPs may select the\nmost appropriate routing mechanism(s) to implement a specific\nNetwork Plane according to service requirements.\n1) Multi-topology based Traffic Engineering\nMulti-Topology routing in OSPF (MT-OSPF) [4] allows a router\nto belong to multiple topologies, identified by a Multi-Topology\nIdentifier (MT-ID). Each link is assigned a dedicated link weight\nfor each topology it belongs to, and, therefore, traffic assigned to\ndifferent topologies can be routed independently over the same\nphysical INP infrastructure. MT-OSPF is an ideal mechanism to\nimplement multiple routing planes and the differentiated routing\naspect of NPs. When combined with differentiated forwarding it\nis possible for different topologies to deliver different QoS levels\nat the same time as optimising the network through load balancing\nor meeting other goals ofNPs such as providing multiple levels of\nresilience to failures.\nWhile MT-OSPF identifies the mechanisms for deploying NPs\nin the routers, NPs need to be designed by an off-line traffic\nengineering and resource management process that can ensure the\nnetwork is optimised to meet the traffic demands. As part of this\nprocess routers and links need to be allocated to NPs and a\ndedicated set of MT-OSPF link weights needs to be assigned for\neach routing plane.\nApart from the offline NP engineering paradigms, online routing\nfor dynamic load balancing and fast rerouting in case of link\ncongestions or failures can be also achieved through multi-\ntopology routing within one NP or even vertically across multiple\nNPs. A typical example is to maintain dedicated MT-OSPF\nrouting topologies within one specific NP in order to enable edge-\nto-edge path diversity. Once the NP is invoked, traffic assigned to\nthis NP can be dynamically tuned across compatible MT-OSPF\nrouting topologies according to the monitored QoS\/TE\nperformance of this Network Plane.\n2) Multi-path Routing with Dynamic Variance (MRD V)\nMultipath Routing with Dynamic Variance (MRDV) [5, 6]\nintroduces multipath dynamic routing to current distributed IGP\nrouting processes. This algorithm uses a variable number of\nalternative routes towards a destination, where the number of\npaths increases with measured load. Thus, traffic will be\ndistributed among several paths, reducing congestion and leading\nto a better use of network resources. Alternative paths are\nconsidered to be suitable when their metric is sufficiently similar\nto the shortest path as defined by:\nM <Mmin V\nwhere M is the metric of the path, M is the metric of the\noptimal path, and Vis the variance parameter.\n798\nMRDV adjusts the variance parameter dynamically, according\nto the average load that the router detects in the next hop of the\noptimal path towards the destination. As the variance parameter\nvalue increases new paths are introduced and load is distributed\namong the suitable paths in inverse proportion to the path cost:\nthe less cost a path has, the more traffic it receives.\nIn order to implement NPs to cater for traffic with different QoS\nrequirements, a separate variance parameter is maintained for\neach traffic class. When a router calculates a variance parameter\nvalue for a particular traffic class, it considers the load generated\nby that traffic class and that offered by all the higher priority\ntraffic classes. Therefore, the traffic of lower priority classes will\nbe distributed over more paths and higher priority classes will\nhave more traffic on paths with lower cost. The overall amount of\ntraffic class differentiation introduced is configured by adjusting\nthe corresponding parameters this algorithm introduces [5, 6].\nThis mechanism is decentralized with routers directly measuring\nthe load on their links. This facilitates deployment by retaining\ncompatibility with current intra-domain routing protocols,\ntherefore allowing a scalable and gradual deployment. However,\ndistributed multi-path techniques, where different paths with\ndifferent costs are considered, potentially introduce routing loops.\nTherefore, a protocol to delete loops has been included in MRDV:\nthe LAP (Loop Avoidance Protocol) is studied thoroughly in [5].\nB. Creating Parallel Internets\nSince earlier stages of IP networking, several proposals have\naimed to capture service requirements on routing, especially inter-\ndomain routing, and to specify solutions meeting these\nrequirements. In 1996, the Nimrud initiative was launched within\nthe IETF with the ambition to provide service-specific routing in\nthe presence of multiple constraints imposed by service providers\nand users. RFC1992 [10], one of the key documents produced by\nthe Nimrud working group, states that inter-network connectivity\nand services should be represented in the form ofmaps at multiple\nlevel of abstraction. Unfortunately, we didn't see complete\nproposals to implement this mandate on operational networks.\nOur solution introduces the concept of Network Planes which are\none step forward to implement service differentiation within the\ndomain of a single INP. However, in order to expand the service\nbeyond the boundaries of a single INP, additional means should\nbe adopted so as to ensure coherence and consistency of treatment\nwhen crossing several INP domains such as meta-QoS-classes\n[1 1] and QoS-enhanced BGP [8]. The use of QoS-enhanced BGP,\noptionally with the concept of meta-QoS-classes is able to offer\neither statistical or loose end-to-end QoS guarantees across\nmultiple INPs. In addition, we also introduce inter-domain IP\ntunnelling mechanisms for providing better-than-best-effort\nservices (i.e. enhanced traffic performance without any\nguarantees).\n1) Meta QoS Classes\nThe philosophy behind the meta-QoS-class concept relies on a\nuniversal and common understanding of QoS-sensitive\napplications' requirements. Wherever end-users are connected,\nthey experience the same QoS difficulties and are likely to\nexpress very similar QoS requirements to their respective\nproviders. Globally confronted with the same customers'\nrequirements, providers are likely to design and operate similar\nNetwork Planes, each of them being particularly designed to\nsupport services with the same constraints, especially QoS\nconstraints, resilience and traffic protection means.\nINPs use the meta-QoS-class concept to map and bind their NPs\nto external ones. An INP goes through several steps to expand its\ninternal NPs. First, it classifies its own NPs based on meta-QoS-\nclasses. Then, it learns about available meta-QoS-classes\nadvertised by its neighbours. Third, it establishes an agreement\nwith its neighbour to be able to send traffic that will be handled\naccording to the agreed meta-QoS-classes. An NP can be bound\nonly with a neighbour NP that is classified as belonging to the\nsame meta-QoS-class.\nA hierarchy ofmeta-QoS-classes can be defined for a given type\nof service (e.g. IP Telephony with different quality levels). A\ngiven NP can be suitable for several meta-QoS-classes. In this\ncase, several code points (e.g., DSCPs in DiffServ') are likely to\nbe associated with the same NP in order to differentiate between\ntraffic classes. Several NPs in a given INP domain can be\nclassified as belonging to the same meta-QoS-class.\n2) QoS-enhancedBGP\nQoS-enhanced BGP is an enriched version of the BGP protocol.\nIt has been proposed to support QoS requirements for the\ndeployment of QoS-based services across several domains\nmanaged by distinct INPs. QoS-Enhanced BGP is used to convey\nrouting and QoS information between the domains of directly\ninterconnected INPs. Two modes of activation of QoS-enhanced\nBGP are valid so as to extend the Network Planes beyond the\nboundaries of a single provider. The first alternative consists of\nconfiguring several QoS-enhanced BGP sessions, each dedicated\nto a given Network Plane. And the second alternative which\nconsists in activating a single QoS-enhanced BGP session which\nwill multiplex reachability information of all involved Network\nPlanes.\nIn order to exchange QoS performance characteristics, QoS-\nenhanced BGP uses the following messages as defined in [8]:\n1. QoS service capabilities: since peering entities need to know\nabout each other's QoS service capabilities, QoS-enhanced\nBGP allows to negotiate the capabilities that a peer domain\nprovides, and indicates what information can potentially be\ncarried by the QoS-enhanced BGP messages;\n2. QoS Class identifier: this is used to distinguish the Network\nPlanes that have been bought by\/from service peers.\n3. QoS performance characteristics: these are a set of QoS\ncharacteristics values, such as one-way packet loss and delay\nand inter-packet delay variation. QoS-enhanced BGP supports\na set of QoS performance characteristics to be sent in one\nsingle QoS-enhanced BGP UPDATE message.\n3) IP tunnelling\nA common method used by ASes to engineer the flow of their\ninter-domain traffic is to establish peerings with other ASes [12].\nFor common practice, those peerings are established either\n1 It should be noted that DSCPs are only used for identifying traffic classes but\nthe traditional DiffServ forwarding mechanisms are not necessarily compulsory.\n799\nthrough direct private links between the two ASes or over an\ninterconnection point. An eBGP session is used over the peering\nlink to advertise the prefixes that are reachable via each AS. In\naddition to this, BGP peerings are established manually by\nchanging the routers configurations on both ends by hand.\nHowever, manual operations are error-prone and slow. In\naddition, the time of establishment of a new peering is often on\nthe order ofmagnitude of several days or weeks.\nIn our framework, we consider the extension of such peering\nmechanisms to non-adjacent ASes, through the utilization of\nVirtual Peerings [7]. A Virtual Peering is a peering built on\ndynamically established uni-directional IP tunnels between two\ncooperating, but non-adjacent, ASes. These IP tunnels are used\nby the source AS to send packets to the destination AS via chosen\ningress routers in the destination AS. The only requirement to be\nable to deploy such IP tunnels is that the remote ingress routers IP\naddresses be routable separately. Today, an increasing number of\nASes already establish peerings with non-adjacent ASes by\nrelying on L2VPNs (see [13], for instance). Emulating such point-\nto-point links using tunnels is currently investigated by the IETF\nin the PWE3 working group [14].\nIn AGAVE, we investigate the utilization of Virtual Peerings as\na means to better engineer the inter-domain traffic of ASes. We\nenvision several applications of Virtual Peerings. A first example\nwould be to use Virtual Peerings to balance the load of traffic\nreceived by an AS over its access links. Another example would\nbe to forward traffic towards a remote destination along a path\nwhich has a better quality than the default BGP-learned routes. A\ntypical use case would be to engineer a lower latency path\nbetween two SIP proxies. Using Virtual Peerings in this way\nwould allow the provision of better than best-effort services\nwithout the need for end-to-end signalling and reservation as\nproposed with MPLS\/RSVP-TE solutions.\nThe advantage of using IP tunnels for inter-domain traffic\nengineering is twofold. First, IP tunnels allow to leverage the\nInternet path diversity. With BGP, only a small subset of the\navailable paths is learned by the ASes, due to the routing policies\nenforced by the intermediate ASes but also to the path-vector\nnature of BGP. Indeed, BGP routers currently only allow a single\nbest route to be propagated to their neighbours for each\ndestination. Second, the cooperation of intermediate ASes is not\nrequired to deploy IP tunnels. The forwarding decisions are taken\nby the cooperating ASes at the endpoints of the tunnel only. For\nthis reason, IP tunnels can readily be deployed without the need\nfor the whole Internet infrastructure to be updated.\nIP traffic engineering and Multi-path Routing with Dynamic\nVariance (MRDV). In addition, approaches for horizontally\nbinding individual Network Planes across multiple autonomous\ndomains for creating QoS aware Parallel Internets have also been\ndescribed for enabling end-to-end QoS differentiation.\nSpecifically, the concept of meta-QoS class and the QoS-\nenhanced BGP protocol are described for inter-domain QoS\nprovisioning. The IP tunnelling approach is also introduced for\nproviding better-than-best-effort services through virtual peering\nbetween remote INPs.\nREFERENCES\n[1] S. Blake et al, \"An Architecture for Differentiated Services\", RFC\n2475\n[2] Y. Rekhter and T. Li, \"A Border Gateway Protocol 4 (BGP-4)\", ETF\nRFC 1771, March 1995.\n[3] M. Boucadair et al, \"Parallel Internets Framework\", AGAVE\nDeliverable DI. 1, September 2006\n[4] P. Psenak, A. Roy, L. Nguyen, P. Pillay-Asnault, \"MT-OSPF: Multi\nTopology (MT) Routing in OSPF\", Internet draft, draft-ietf-ospf-mt-\n06.txt, February 2006\n[5] Ram6n-Salguero, F.J., J. Enriquez-Gabeiras, J. Andres-Colds, A.\nMolins-Jimenez: \"Multipath Routing with Dynamic Variance\",\nCOST 279 Technical Report TD02043 (2002).\n[6] Callejo-Rodriguez, M.A., J. Andres-Colds, G. Garcia-de-Blas, F.J.\nRam6n-Salguero, J. Enriquez-Gabeiras: \"A Decentralized Traffic\nManagement Approach for Ambient Networks Environments\", 16th\nIFIP\/EEE International Workshop on Distributed Systems:\nOperations and Management (DSOM) 2005, 145-156. Springer.\n[7] B. Quoitin and 0. Bonaventure, \"A cooperative approach to inter-\ndomain traffic engineering\", Proc. 1st Conference on Next Generation\nInternet Networks Traffic Engineering (NGI) 2005\n[8] M. Boucadair, \"QoS-Enhanced Border Gateway Protocol\", Internet-\nDraft, draft-boucadair-qos-bgp-spec-01.txt, July 2005\n[9] Fortz, B., and M. Thorup, \"Internet Traffic Engineering by\nOptimizing OSPF Weights\", Proc. EEE INFOCOM 2000\n[10] I. Castineyra, N. Chiappa, and M. Steenstrup, \"The Nimrod Routing\nArchitecture\", Internet Engineering Task Force, RFC1992, 1996\n[11] P. Levis and M. Boucadair, \"The Meta-QoS-Class concept\", Internet-\nDraft, draft-levis-meta-qos-class-OO.txt, June 2005\n[12] Bartholomew S., \"The Art ofPeering\", 2000\n[13] LINX, \"Pseudowire Layer-2 Connect\",\nhttps:\/\/www.linx.net\/wwwpublic\/our services\/layer2_connect\/?sear\nchterm=martini, 2006\n[14] Bryant S. and Pate P., \"Pseudo Wire Emulation Edeg-to-Edge\n(PWE3) Architecture\", RFC3985, 2005\nIV. SUMMARY\nIn this paper, we have introduced the concepts of Network\nPlanes and Parallel Internets for the purposes of lightweight QoS\nprovisioning across the current best-effort Internet. The proposed\nframework assumes the decoupling of Service Providers (SPs),\nwho offer IP-based services, from IP Network Providers (INPs)\nwho own the actual IP network resources. From the viewpoint of\nthe INPs, in order to satisfy heterogeneous QoS requirements\ndemanded by SPs, a set of Network Plane Engineering solutions\nare designed and implemented, namely QoS aware multi-topology\n800\n"}