{"doi":"10.5194\/angeo-21-559-2003","coreId":"71179","oai":"oai:eprints.lancs.ac.uk:6619","identifiers":["oai:eprints.lancs.ac.uk:6619","10.5194\/angeo-21-559-2003"],"title":"High-latitude observations of impulse-driven ULF pulsations in the ionosphere and on the ground","authors":["Menk, F. W.","Yeoman, T. K.","Wright, D. M.","Lester, M.","Honary, F."],"enrichments":{"references":[{"id":16360101,"title":"A comparison of EISCAT and Dynasonde measurements of the auroral ionosphere,","authors":[],"date":"1996","doi":"10.1007\/s00585-996-1403-x","raw":"Sedgemore, K. J. F., Williams, P. J. S., Jones, G. O. L. , and Wright, J. W.: A comparison of EISCAT and Dynasonde measurements of the auroral ionosphere, Ann. Geophysicae, 14, 1403–1412, 1996.","cites":null},{"id":16360124,"title":"A comparison of EISCAT and HF Doppler observations of a ULF wave event,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-1190-7","raw":"Wright, D. M., Yeoman, T. K., and Davies, J. A.: A comparison of EISCAT and HF Doppler observations of a ULF wave event, Ann. Geophysicae, 16, 1190–1199, 1998.","cites":null},{"id":16360070,"title":"A ﬂux transfer event observed at the magnetopause by the Equator-S spacecraft and in the ionosphere by the CUTLASS HF radar,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0707-z","raw":"Neudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G., Haerendel, G., Baumjohann, W., Auster, U., Fornacon, K.-H., Georgescu, E., and Owen, C. J.: A ﬂux transfer event observed at the magnetopause by the Equator-S spacecraft and in the ionosphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707– 711, 1999. Newell, P. T. and Meng, C.-I.: The cusp and cleft\/boundary layer: Low-altitude identiﬁcations and statistical local time variation, J.","cites":null},{"id":16359934,"title":"A phased-array radiowave imager for studies of cosmic noise absorption,","authors":[],"date":"1990","doi":"10.1029\/rs025i004p00325","raw":"Dettrick, D. L. and Rosenberg, T. J.: A phased-array radiowave imager for studies of cosmic noise absorption, Radio Sci., 25, 325–338, 1990. Farrugia, C. J., Freeman, M. P., Cowley, S. W. H., Southwood, D. J., Lockwood, M., and Etemadi, A.: Pressure-driven magnetopause motions and attendant response on the ground, Planet.","cites":null},{"id":16360111,"title":"A Safari-Eiscat comparison between the velocity of F region small-scale irregularities and the ion drift,","authors":[],"date":"1985","doi":"10.1029\/ja090ia09p08433","raw":"Villain, J. P., Caudal, G., and Hanuise, C.: A Safari-Eiscat comparison between the velocity of F region small-scale irregularities and the ion drift, J. Geophys. Res., 90, 8433–8443, 1985.","cites":null},{"id":16360053,"title":"A statistical survey of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0445-8","raw":"McWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical survey of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.","cites":null},{"id":16360103,"title":"Amodelforthetransientmagnetosphericresponseto sudden solar wind dynamic pressure perturbations,","authors":[],"date":"1990","doi":"10.1029\/ja095ia04p03755","raw":"Sibeck, D.G.: Amodelforthetransientmagnetosphericresponseto sudden solar wind dynamic pressure perturbations, J. Geophys. Res., 95, 3755–3771, 1990.","cites":null},{"id":16359936,"title":"An HF phased-array radar for studying small-scale structure in the high-latitude ionosphere,","authors":[],"date":"1985","doi":"10.1029\/rs020i001p00063","raw":"Greenwald, R. A., Baker, K. B., Hutchins, R. A., and Hanuise, C.: An HF phased-array radar for studying small-scale structure in the high-latitude ionosphere, Radio Sci., 20, 63, 1985.","cites":null},{"id":16360083,"title":"An ionospheric signature ofpossibleenhancedmagneticﬁeldmergingonthedaysidemagnetopause,","authors":[],"date":"1991","doi":"10.1016\/0021-9169(91)90104-f","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Greenwald, R. A., Baker, K. B., and Ruohoniemi, J. M.: An ionospheric signature ofpossibleenhancedmagneticﬁeldmergingonthedaysidemagnetopause, J. Atmos. Terr. Phys., 53, 201–212, 1991.","cites":null},{"id":16359903,"title":"Animagingriometer for ionospheric studies,","authors":[],"date":"1995","doi":null,"raw":"Browne, S., Hargreaves, J.K., andHonary, B.: Animagingriometer for ionospheric studies, J. Elec. Comms. Eng., 7, 209–217, 1995.","cites":null},{"id":16360078,"title":"Auroral and geomagnetic events at cusp\/mantle latitudes in the prenoon sector during positive IMF By conditions: Signatures of pulsed magnetopause reconnection,","authors":[],"date":"1997","doi":"10.1029\/96ja03716","raw":"Øieroset, M., Sandholt, P. E., Luhr, H., Denig, W. F., and Moretto, T.: Auroral and geomagnetic events at cusp\/mantle latitudes in the prenoon sector during positive IMF By conditions: Signatures of pulsed magnetopause reconnection, J. Geophys. Res., 102, 7191–7205, 1997.","cites":null},{"id":16359905,"title":"Auroral and rocket double-probe observations of the electric ﬁeld across the Harang discontinuity,","authors":[],"date":"1978","doi":"10.1029\/gl005i008p00687","raw":"Cahill, L., Greenwald, R. A., and Nielsen, E.: Auroral and rocket double-probe observations of the electric ﬁeld across the Harang discontinuity, Geophys. Res. Lett., 5, 687–690, 1978.","cites":null},{"id":16360125,"title":"Characteristics of MHD waves associated with storm sudden commencements observed by SABRE and ground magnetometers,","authors":[],"date":"1990","doi":"10.1016\/0032-0633(90)90066-y","raw":"Yeoman, T. K. and Lester, M. E.: Characteristics of MHD waves associated with storm sudden commencements observed by SABRE and ground magnetometers, Planet. Space Sci., 38, 603– 616, 1990.","cites":null},{"id":16359860,"title":"Complex demodulation applied to Pi2 geomagnetic pulsations,","authors":[],"date":"1995","doi":"10.1111\/j.1365-246x.1979.tb01035.x","raw":"Geophys. Res., 100, 7671–7695, 1995. Beamish, D., Hanson, H. W., and Webb, D. C.: Complex demodulation applied to Pi2 geomagnetic pulsations, Geophys. J. R.","cites":null},{"id":16360050,"title":"Conjugate cusp-region ULF pulsation responses to the solar wind event of","authors":[],"date":"1989","doi":"10.1029\/95ja03470","raw":"Matthews, D. L., Ruohoniemi, J. M., Dudeney, J. R., Farrugia, C. F., Lanzerotti, L. J., and Friis-Christensen, E.: Conjugate cusp-region ULF pulsation responses to the solar wind event of May 23, 1989, J. Geophys. Res., 101, 7829–7841, 1996.","cites":null},{"id":16360060,"title":"Coordinated observations of forced and resonant ﬁeld line observations at high-latitudes,","authors":[],"date":"2001","doi":null,"raw":"Menk, F. W., Yeoman, T. K., Wright, D., and Lester, M.: Coordinated observations of forced and resonant ﬁeld line observations at high-latitudes, ANARE Res. Rpts., 146, 383–404, 2001.","cites":null},{"id":16360094,"title":"CUTLASS Finland radar observations of the ionospheric signatures of ﬂux transfer events and the resulting plasma ﬂows,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-1411-0","raw":"Provan, G., Yeoman, T. K., and Milan, S. E.: CUTLASS Finland radar observations of the ionospheric signatures of ﬂux transfer events and the resulting plasma ﬂows, Ann. Geophysicae, 16, 1411–1422, 1998.","cites":null},{"id":16359942,"title":"Dayside auroral activities and their implications for impulsive entry processes in the dayside magnetosphere,","authors":[],"date":"1991","doi":"10.1016\/0021-9169(91)90106-h","raw":"Liu, A.T.Y. and Sibeck, D. G.: Dayside auroral activities and their implications for impulsive entry processes in the dayside magnetosphere, J. Atmos. Terr. Phys., 53, 219–229, 1991.","cites":null},{"id":16360047,"title":"Discrete ﬁeld line resonances and the Alfv´ en continuum in the outer magnetosphere,","authors":[],"date":"1999","doi":"10.1029\/1999gl900104","raw":"Mathie, R. A., Menk, F. W., Mann, I. R., and Orr, D.: Discrete ﬁeld line resonances and the Alfv´ en continuum in the outer magnetosphere, Geophys. Res. Lett., 26, 659–662, 1999b.","cites":null},{"id":16360120,"title":"First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1491-2001","raw":"Wild, J. A., Cowley, S.W.H., Davies, J. A., Kahn, H., Lester, M., Milan, S. E.,Provan, G. , Yeoman, T. K., Balogh, A., Dunlop, M. W., Fornac ¸on, K.-H., and Georgescu, E.: First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, 19, 1491–1508, 2001.","cites":null},{"id":16360100,"title":"Flux transfer events: scale size and interior structure,","authors":[],"date":"1984","doi":"10.1029\/gl011i002p00131","raw":"Saunders, M. A., Russell, C. T. , and Sckopke, N.: Flux transfer events: scale size and interior structure, Geophys. Res. Lett., 11, 131–134, 1984.","cites":null},{"id":16359858,"title":"Geomagnetic response to sudden expansions of the magnetosphere,","authors":[],"date":"1988","doi":"10.1029\/ja093ia05p03983","raw":"Araki, T. and Nagano, H.: Geomagnetic response to sudden expansions of the magnetosphere, J. Geophys. Res., 93, 3983–3988, 1988. Baker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M., Newell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HF radar signatures of the cusp and low-latitude boundary layer, J.","cites":null},{"id":16359861,"title":"Geophysical phenomena during an ionospheric modiﬁcation experiment at","authors":[],"date":"1998","doi":"10.1007\/s00585-998-1212-5","raw":"Blagoveshchenskaya, N. F., Kornienko, V. A., Petlenko, A. V., Brekke, A., and Rietveld, M. T.: Geophysical phenomena during an ionospheric modiﬁcation experiment at Tromsø, Norway, Ann. Geophysicae, 16, 1212–1225, 1998.","cites":null},{"id":16359907,"title":"Ground signatures of convecting reconnecting ﬂux tubes,","authors":[],"date":"1993","doi":"10.1029\/93ja00739","raw":"Chaston, C. C., Hansen, H. J., Menk, F. W., Fraser, B. J., and Hu, Y. D.: Ground signatures of convecting reconnecting ﬂux tubes, J. Geophys. Res., 98, 19151–19161, 1993.","cites":null},{"id":16359944,"title":"H.: The IMAGE magnetometer network,","authors":[],"date":"1994","doi":null,"raw":"L¨ uhr, H.: The IMAGE magnetometer network, STEP Int. Newsl., 4, 4–6, 1994.","cites":null},{"id":16359938,"title":"Hanscom Air Force Base,","authors":[],"date":"1985","doi":"10.1109\/csac.1996.569692","raw":"AFGL-TR-84-0317, Air Force Geophys. Lab., Hanscom Air Force Base, Mass., 1985. Hasegawa, A., Tsui, K. H., and Assis, A. S.: A theory of long period magnetic pulsations, 3, Local ﬁeld line oscillations, Geophys.","cites":null},{"id":16360117,"title":"HF Doppler oscillations due to mixed ULF wave modes,","authors":[],"date":"2001","doi":null,"raw":"Waters, C. L., Sciffer, M., Dunlop, I. S., and Menk, F. W.: HF Doppler oscillations due to mixed ULF wave modes, ANARE Res. Rpts., 146, 369–382, 2001.","cites":null},{"id":16360128,"title":"High spatial and temporal resolution observations of an impulse-driven ﬁeld line resonance in radar backscatter data artiﬁcially generated with the Tromsø heater,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0634-9","raw":"Yeoman, T. K., Wright, D. M., Robinson, T. R., Davies, J. A., and Rietveld, M.: High spatial and temporal resolution observations of an impulse-driven ﬁeld line resonance in radar backscatter data artiﬁcially generated with the Tromsø heater, Ann. Geophysicae, 16, 634–644, 1997.","cites":null},{"id":16360089,"title":"High spatial and temporal resolution observations of the ionospheric cusps,","authors":[],"date":"1995","doi":"10.1007\/s00585-995-0919-9","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker, K.: High spatial and temporal resolution observations of the ionospheric cusps, Ann. Geophysicae, 13, 919–925, 1995.","cites":null},{"id":16360109,"title":"High-latitude F-region irregularities: a review and synthesis,","authors":[],"date":"1988","doi":"10.1029\/rg026i004p00719","raw":"Tsunoda, R. T.: High-latitude F-region irregularities: a review and synthesis, Rev. Geophys., 26, 719–760, 1988.","cites":null},{"id":16360122,"title":"High-latitude HFDopplerobservationsofULFwaves.1.Waveswithlargespatial scale sizes,","authors":[],"date":"1997","doi":null,"raw":"Wright, D. M., Yeoman, T. K., and Chapman, P. J.: High-latitude HFDopplerobservationsofULFwaves.1.Waveswithlargespatial scale sizes, Ann. Geophysicae, 15, 1548–1556, 1997.","cites":null},{"id":16359939,"title":"Hydromagnetic waves and the ionosphere,","authors":[],"date":"1988","doi":"10.1029\/gl015i011p01271","raw":"Kivelson, M. G. and Southwood, D. J.: Hydromagnetic waves and the ionosphere, Geophys. Res. Lett., 15, 1271–1274, 1988.","cites":null},{"id":16359909,"title":"I.R.: APc5ULFwavewithlargeazimuthal wavenumber observed within the morning sector plasmasphere by SAMNET,","authors":[],"date":"1999","doi":"10.1029\/1999ja900147","raw":"Chisham, G.andMann, I.R.: APc5ULFwavewithlargeazimuthal wavenumber observed within the morning sector plasmasphere by SAMNET, J. Geophys. Res., 104, 14717–14727, 1999.","cites":null},{"id":16359940,"title":"Impulsive penetration of ﬁlamentary plasma elements into the magnetosphere of the Earth and","authors":[],"date":"1977","doi":"10.1016\/0032-0633(77)90042-3","raw":"Lemaire, J.: Impulsive penetration of ﬁlamentary plasma elements into the magnetosphere of the Earth and Jupiter, Planet. Space Sci., 25, 887–890, 1977.","cites":null},{"id":16360064,"title":"Initial backscatter occurrence statistics from the CUTLASS HF radars,","authors":[],"date":"1997","doi":"10.1007\/s005850050486","raw":"Milan, S. E., Yeoman, T. K., and Lester, M.: Initial backscatter occurrence statistics from the CUTLASS HF radars, Ann. Geophysicae, 15, 703–718, 1997b.","cites":null},{"id":16360063,"title":"Interferometric evidence for the observation of ground backscatter originating behind the CUTLASS coherent HF radars,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0029-y","raw":"Milan, S. E., Jones, T. B., Robinson, T. R., Thomas, E. C., and Yeoman, T. K.: Interferometric evidence for the observation of ground backscatter originating behind the CUTLASS coherent HF radars, Ann. Geophysicae, 15, 29–39, 1997a.","cites":null},{"id":16359943,"title":"Interplanetary magnetic ﬁeld control of dayside auroral activity and the transfer of momentum across the dayside magnetopause,","authors":[],"date":"1989","doi":"10.1016\/0032-0633(89)90106-2","raw":"Lockwood, M., Sandholt, P. E., Cowley, S. W. H., and Oguti, T.: Interplanetary magnetic ﬁeld control of dayside auroral activity and the transfer of momentum across the dayside magnetopause, Planet. Space Sci., 37, 1347–1365, 1989.","cites":null},{"id":16360127,"title":"Ionospheric boundary conditions of hydromagnetic waves: the dependence on azimuthal wave number and a case study,","authors":[],"date":"1990","doi":"10.1016\/0032-0633(90)90134-c","raw":"Yeoman, T. K., Lester, M., Orr, D., and L¨ uhr, H.: Ionospheric boundary conditions of hydromagnetic waves: the dependence on azimuthal wave number and a case study, Planet. Space Sci., 38, 1315–1325, 1990b.","cites":null},{"id":16360106,"title":"Ionospheric Doppler and electron velocities in the presence of ULF waves,","authors":[],"date":"1989","doi":"10.1029\/ja094ia10p13505","raw":"Sutcliffe, P. R. and Poole, A.W.V.: Ionospheric Doppler and electron velocities in the presence of ULF waves, J. Geophys. Res., 94, 13505–13514, 1989.","cites":null},{"id":16359935,"title":"Ionospheric irregularities,","authors":[],"date":"1980","doi":"10.1029\/rg018i002p00401","raw":"Fejer, B. G. and Kelley, M. C.: Ionospheric irregularities, Rev. Geophys., 18, 401–454, 1980.","cites":null},{"id":16360099,"title":"ISEE observations of ﬂux transfer events at the dayside magnetopause,","authors":[],"date":"1979","doi":"10.1029\/gl006i001p00033","raw":"Russell, C. T. and Elphic, R. C.: ISEE observations of ﬂux transfer events at the dayside magnetopause, Geophys. Res. Lett., 6, 33– 36, 1979.","cites":null},{"id":16360096,"title":"Kelvin-Helmholtz instability at the magnetopause: solutions for compressible plasmas,","authors":[],"date":"1983","doi":"10.1029\/ja088ia02p00853","raw":"Pu, Z.-Y. and Kivelson, M. G.: Kelvin-Helmholtz instability at the magnetopause: solutions for compressible plasmas, J. Geophys. Res., 88, 841–852, 1983.","cites":null},{"id":16360081,"title":"Long-period goemagnetic pulsations caused by the solar wind negative pressure impulse on 22","authors":[],"date":"1979","doi":"10.1007\/s00585-998-0134-6","raw":"Parkhomov, V. A., Mishin, V. V., and Borovik, L. V.: Long-period goemagnetic pulsations caused by the solar wind negative pressure impulse on 22 March 1979 (CDAW-6), Ann. Geophysicae, 16, 134–139, 1998.","cites":null},{"id":16360108,"title":"Magnetospheric ULF waves observed during the major magnetospheric compression of","authors":[],"date":"1984","doi":"10.1029\/ja093ia12p14369","raw":"Takahashi, K., Kistler, L. M., Potemra, T. A., McEntire, R. W., and Zanetti, L. J.: Magnetospheric ULF waves observed during the major magnetospheric compression of November 1, 1984, J.","cites":null},{"id":16360077,"title":"Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics,","authors":[],"date":"1992","doi":"10.1029\/92gl00404","raw":"Newell, P. T. and Meng, C.-I.: Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics, Geophys. Res. Lett., 19, 609–612, 1992.","cites":null},{"id":16359937,"title":"Menk at al.: High-latitude observations of impulse-driven ULF pulsations 575 ishi, H.: DARN\/SuperDARN: a global view of the dynamics of high-altitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones, T. B., Thomas, E. C., Villain, J.-P., Cerisier, J.-C., Senior, C., Hanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen, E., Pellinan, R., Walker, A.D.M., Sato, N., and Yamag-F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 575 ishi, H.: DARN\/SuperDARN: a global view of the dynamics of high-altitude convection, Space Sci. Rev., 71, 761–796, 1995. Hardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall, F. J., Yeh, H. C., Schumaker, T. L., Hube, A., and Pantazis, J.: Precipitating electron and ion detectors (SSJ\/4) for the block 5D\/ﬂights 6–10 DMSP satellites: Calibration and data presentation, Rep.","cites":null},{"id":16359853,"title":"Monitoring cusp\/cleft topology using Pc5 ULF waves,","authors":[],"date":"1998","doi":"10.1029\/98gl00848","raw":"Ables, S. T., Fraser, B. J. Waters, C. L., and Neudegg, D. A.: Monitoring cusp\/cleft topology using Pc5 ULF waves, Geophys. Res. Lett., 25, 1507–1510, 1998.","cites":null},{"id":16360057,"title":"Monitoring spatial and temporal variations in the dayside plasmasphere using geomagnetic ﬁeld line resonances,","authors":[],"date":"1995","doi":"10.1029\/1999ja900205","raw":"Menk, F. W., Orr, D., Clilverd, M. A., Smith, A. J., Waters, C. L., and Fraser, B. J.: Monitoring spatial and temporal variations in the dayside plasmasphere using geomagnetic ﬁeld line resonances, J. Geophys. Res., 104, 19955–19970, 1999.","cites":null},{"id":16360091,"title":"Multisatellite and ground-based observations of transient ULF waves,","authors":[],"date":"1989","doi":"10.1029\/ja094ia03p02543","raw":"Potemra, T. A., L¨ uhr, H., Zanetti, L. J., Takahashi, K., Erlandson, R. E., Marklund, G. T., Block, L. P., Blomberg, L. G., and Lepping, R. P.: Multisatellite and ground-based observations of transient ULF waves, J. Geophys. Res., 94, 2543–2554, 1989.","cites":null},{"id":16360114,"title":"Observational features of ﬁeld line resonances excited by solar wind pressure variations on 4","authors":[],"date":"1984","doi":"10.1016\/0032-0633(90)90157-l","raw":"Warnecke, J., L¨ uhr, H., and Takahashi, K.: Observational features of ﬁeld line resonances excited by solar wind pressure variations on 4 September 1984, Planet. Space Sci., 38, 1517–1531, 1990.","cites":null},{"id":16360088,"title":"Observations of an enhanced convection channel in the cusp ionosphere,","authors":[],"date":"1993","doi":"10.1029\/92ja01382","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Baker, K. B., Newell, P. T., Greenwald, R. A., and Greenspan, M. E.: Observations of an enhanced convection channel in the cusp ionosphere, J. Geophys. Res., 98, 3767–3776, 1993.","cites":null},{"id":16360044,"title":"Pc5 ULF pulsations associated with waveguide modes observed with the IMAGE magnetometer array,","authors":[],"date":"1999","doi":"10.1029\/1998ja900150","raw":"Mathie, R. A., Mann, I. R., Menk, F. W., and Orr, D.: Pc5 ULF pulsations associated with waveguide modes observed with the IMAGE magnetometer array, J. Geophys. Res., 104, 7025–7036, 1999a.","cites":null},{"id":16360097,"title":"Relationship between simultaneous geomagnetic and ionospheric oscillations,","authors":[],"date":"1964","doi":"10.6028\/jres.068d.051","raw":"Risbeth, H. and Garriott, O. K.: Relationship between simultaneous geomagnetic and ionospheric oscillations, Radio Sci., 68D, 339– 343, 1964.","cites":null},{"id":16360093,"title":"Solar-wind-driven pulsed magnetic reconnection at the dayside magnetopause, Pc5 compressional oscillations, and ﬁeld line resonances,","authors":[],"date":"1998","doi":"10.1029\/97ja03595","raw":"Prikryl, P., Greenwald, R. A., Sofko, G. J., Villain, J. P., Ziesolleck, C.W.S., and Friis-Christensen, E.: Solar-wind-driven pulsed magnetic reconnection at the dayside magnetopause, Pc5 compressional oscillations, and ﬁeld line resonances, J. Geophys. Res., 103, 17307–17322, 1998.","cites":null},{"id":16360072,"title":"Some low altitude cusp dependencies on the interplanetary magnetic ﬁeld,","authors":[],"date":"1989","doi":"10.1029\/ja094ia07p08921","raw":"Newell, P. T., Meng, C.-I., Sibeck, D. G., and Lepping, R.: Some low altitude cusp dependencies on the interplanetary magnetic ﬁeld, J. Geophys. Res., 94, 8921–8927, 1989.","cites":null},{"id":16360112,"title":"STARE auroral radar observations of Pc5 geomagnetic pulsations,","authors":[],"date":"1979","doi":"10.1029\/ja084ia07p03373","raw":"Walker, A.D.M., Greenwald, R. A., Stuart, W. F., and Green, C. A.: STARE auroral radar observations of Pc5 geomagnetic pulsations, J. Geophys. Res., 84, 3373–3388, 1979.","cites":null},{"id":16360095,"title":"Statistical observations of the MLT, latitude and size of pulsed ionospheric ﬂows with the CUTLASS Finland radar,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0855-1","raw":"Provan, G. and Yeoman, T. K.: Statistical observations of the MLT, latitude and size of pulsed ionospheric ﬂows with the CUTLASS Finland radar, Ann. Geophysicae, 17, 855–867, 1999.","cites":null},{"id":16360080,"title":"SWE, a comprehensiveplasmainstrumentfortheWindspacecraft,","authors":[],"date":"1995","doi":"10.1007\/bf00751326","raw":"Ogilvie, K. W., Chorney, D. J., Fitzenreiter, R. J., Hunsaker, F., Keller, J., Lobell, J., Miller, G., Scudder, J. D., Sittler Jr., E. C., Torbert, R. B., Bodet, D., Needell, G., Lazarus, A. J., Steinberg, J. T., Tappan, J. H., Mavretic, A., and Gergin, E.: SWE, a comprehensiveplasmainstrumentfortheWindspacecraft, SpaceSci. Rev, 71, 55–77, 1995.","cites":null},{"id":16360074,"title":"The auroral oval position, structure, and intensity of precipitation from","authors":[],"date":"1984","doi":"10.1029\/90ja02450","raw":"Newell, P. T., Wing, S., Meng, C.-I., and Sigilleto, V.: The auroral oval position, structure, and intensity of precipitation from 1984 onwards: An automated online data base, J. Geophys. Res., 96, 5877–5882, 1991.","cites":null},{"id":16360067,"title":"The dayside auroral zone as a hard target for coherent HF radars,","authors":[],"date":"1998","doi":"10.1029\/98gl02781","raw":"Milan, S. E., Yeoman, T. K., and Lester, M.: The dayside auroral zone as a hard target for coherent HF radars, Geophys. Res.Lett., 25, 3717–3720, 1998.","cites":null},{"id":16360104,"title":"The ionospheric signature of ﬂux transfer events,","authors":[],"date":"1987","doi":"10.1029\/ja092ia04p03207","raw":"Southwood, D. J.: The ionospheric signature of ﬂux transfer events, J. Geophys. Res., 92, 3207–3213, 1987.","cites":null},{"id":16360090,"title":"The relationship between ULF geomagnetic pulsations and ionospheric Doppler oscillations: derivation of a model,","authors":[],"date":"1988","doi":"10.1029\/ja093ia12p14656","raw":"Poole, A.W.V., Sutcliffe, P. R., and Walker, A.D.M.: The relationship between ULF geomagnetic pulsations and ionospheric Doppler oscillations: derivation of a model, J. Geophys. Res., 93, 14656–14664, 1988.","cites":null},{"id":16360116,"title":"The temporal variation of the frequency of high-latitude ﬁeld line resonances,","authors":[],"date":"1995","doi":"10.1029\/94ja02712","raw":"Waters, C. L., Samson, J. C., and Donovan, E. F.: The temporal variation of the frequency of high-latitude ﬁeld line resonances, J. Geophys. Res., 100, 7987–7996, 1995.","cites":null},{"id":16359941,"title":"The WIND Magnetic Field Investigation, Space Sci.","authors":[],"date":"1995","doi":"10.1007\/bf00751330","raw":"Lepping, R. P., Acuna, M., Burlaga, L., Farrell, W., Slavin, J., Schatten, K., Mariani, F., Ness, N., Neubauer, F., Whang, Y. C., Byrnes, J., Kennon, R., Panetta, P., Scheifele, J., and Worley, E.: The WIND Magnetic Field Investigation, Space Sci. Rev., 71, 207–229, 1995.","cites":null},{"id":16360098,"title":"Theionosphericresponsetoﬂuxtransfer events: the ﬁrst few minutes,","authors":[],"date":"1997","doi":null,"raw":"Rodger, A.andPinnock, M.: Theionosphericresponsetoﬂuxtransfer events: the ﬁrst few minutes, Ann. Geophysicae, 15, 685– 691, 1997.","cites":null},{"id":16360092,"title":"Transient ULF pulsation decay rates576 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations observed by ground based magnetometers: the contribution of spatial integration,","authors":[],"date":"1985","doi":"10.1016\/0032-0633(85)90046-7","raw":"Poulter, E. M. and Allan, W.: Transient ULF pulsation decay rates576 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations observed by ground based magnetometers: the contribution of spatial integration, Planet. Space Sci., 33, 607–616, 1985.","cites":null},{"id":16360056,"title":"Twodimensional electric ﬁeld measurements in the ionospheric signature of a ﬂux transfer event,","authors":[],"date":"2001","doi":"10.1007\/s005850000295","raw":"McWilliams, K. A., Yeoman, T. K., and Cowley, S.W.H.: Twodimensional electric ﬁeld measurements in the ionospheric signature of a ﬂux transfer event, Ann. Geophysicae, 18, 1584– 1598, 2001.","cites":null},{"id":16359945,"title":"Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments,","authors":[],"date":"1998","doi":"10.1007\/s005850050613","raw":"L¨ uhr, H., Aylward, A., Bucher, S. C., Pajunp¨ a¨ a, A., Pajunp¨ a¨ a, K., Holmbee, T., and Zalewski, S. M.: Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments, Ann. Geophysicae, 16, 425–440, 1998.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71179.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6619\/1\/art_406.pdf","pdfHashValue":"e24ac4463de43f594805462bb4925a26b729de46","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6619<\/identifier><datestamp>\n      2018-01-24T03:14:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        High-latitude observations of impulse-driven ULF pulsations in the ionosphere and on the ground<\/dc:title><dc:creator>\n        Menk, F. W.<\/dc:creator><dc:creator>\n        Yeoman, T. K.<\/dc:creator><dc:creator>\n        Wright, D. M.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        Honary, F.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2003<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6619\/1\/art_406.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-21-559-2003<\/dc:relation><dc:identifier>\n        Menk, F. W. and Yeoman, T. K. and Wright, D. M. and Lester, M. and Honary, F. (2003) High-latitude observations of impulse-driven ULF pulsations in the ionosphere and on the ground. Annales Geophysicae, 21 (2). pp. 559-576. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6619\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-21-559-2003","http:\/\/eprints.lancs.ac.uk\/6619\/"],"year":2003,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2003) 21: 559–576 c© European Geosciences Union 2003\nAnnales\nGeophysicae\nHigh-latitude observations of impulse-driven ULF pulsations in the\nionosphere and on the ground\nF. W. Menk1,3, T. K. Yeoman2, D. M. Wright2, M. Lester2, and F. Honary4\n1School of Mathematical and Physical Science, the University of Newcastle, Callaghan, NSW 2308, Australia\n2Department of Physics and Astronomy, University of Leicester, University Road, Leicester, LE1 7RH, UK\n3Also at: Cooperative Research Centre for Satellite Systems, Canberra, ACT, Australia\n4Department of Communications Systems, Lancaster University, Lancaster, LA1 4YR, UK\nReceived: 27 September 2001 – Revised: 3 July 2002 – Accepted: 11 July 2002\nAbstract. We report the simultaneous observation of 1.6–\n1.7 mHz pulsations in the ionospheric F-region with the\nCUTLASS bistatic HF radar and an HF Doppler sounder,\non the ground with the IMAGE and SAMNET magnetome-\nter arrays, and in the upstream solar wind. CUTLASS was\nat the time being operated in a special mode optimized for\nhigh resolution studies of ULF waves. A novel use is made\nof the ground returns to detect the ionospheric signature of\nULF waves. The pulsations were initiated by a strong, sharp\ndecrease in solar wind dynamic pressure near 09:28 UT on\n23 February 1996, and persisted for some hours. They were\nobserved with the magnetometers over 20◦ in latitude, cou-\npling to a field line resonance near 72◦ magnetic latitude. The\nmagnetic pulsations had azimuthal m numbers ∼−2, consis-\ntent with propagation away from the noon sector. The radars\nshow transient high velocity flows in the cusp and auroral\nzones, poleward of the field line resonance, and small ampli-\ntude 1.6–1.7 mHz F-region oscillations across widely spaced\nregions at lower latitudes. The latter were detected in the\nradar ground scatter returns and also with the vertical inci-\ndence Doppler sounder. Their amplitude is of the order of\n±10 m s−1. A similar perturbation frequency was present in\nthe solar wind pressure recorded by the WIND spacecraft.\nThe initial solar wind pressure decrease was also associated\nwith a decrease in cosmic noise absorption on an imaging ri-\nometer near 66◦ magnetic latitude. The observations suggest\nthat perturbations in the solar wind pressure or IMF result in\nfast compressional mode waves that propagate through the\nmagnetosphere and drive forced and resonant oscillations of\ngeomagnetic field lines. The compressional wave field may\nalso stimulate ionospheric perturbations. The observations\ndemonstrate that HF radar ground scatter may contain im-\nportant information on small-amplitude features, extending\nthe scope and capability of these radars to track features in\nthe ionosphere.\nKey words. Ionosphere (Ionosphere-magnetosphere inter-\nCorrespondence to: F. W. Menk (fred.menk@physics.org\nor Fred.Menk@newcastle.edu.au)\nactions; ionospheric disturbances) – Magnetospheric physics\n(MHD waves and instabilities)\n1 Introduction\nThis paper reports new observations of the ionospheric and\nmagnetic signatures of solar wind pressure perturbations. In\nparticular, we describe the novel use of HF radar ground scat-\nter to detect ionospheric pulsations.\nGeomagnetic activity is driven by energy and mass trans-\nfer from the solar wind, and the outermost sunward field lines\nmap most directly to the particle and wave entry regions. The\ninjected particles may give rise to features of dayside auroras\n(Lui and Sibeck, 1991), while the waves may propagate large\ndistances through the magnetosphere and couple to field line\nresonances (e.g. Warnecke et al., 1990).\nTransient features are often observed in high-latitude mag-\nnetometer and ionospheric data, although their interpretation\nmay be controversial. Possible generation mechanisms in-\nclude radial displacements of the magnetopause due to per-\nturbations in the solar wind dynamic pressure (Farrugia et al.,\n1989; Sibeck, 1990) or impulsive magnetic reconnection and\nplasma transfer events at the magnetopause (Lemaire, 1977;\nRussell and Elphic, 1979; Saunders et al., 1984). Kelvin-\nHelmholtz surface waves driven by the velocity shear at the\nmagnetopause may also produce similar signatures in ground\nmagnetometer records (Pu and Kivelson, 1983). It is neces-\nsary to carefully study specific events in order to distinguish\nthe causative mechanism. An important aspect of this is the\nintercalibration of signatures from different instruments.\nThis paper presents observations of ULF pulsations\nrecorded in the high-latitude ionosphere with the CUTLASS\nbistatic HF radar and a Doppler sounder, and on the ground\nwith the IMAGE and SAMNET magnetometer arrays, on\n23 February 1996. The pulsations were stimulated by solar\nwind perturbations and were recorded across a wide region\non the ground with the same frequency as in the solar wind\npressure and IMF. The ionospheric pulsations were observed\n560 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nin the CUTLASS ground scatter return. This raises the pos-\nsibility of using ground scatter data to extend the capability\nand resolution of HF radars. Sibeck (1990) presented a de-\ntailed description of the magnetospheric response to a solar\nwind pressure pulse, and our observations support and extend\nthose predictions.\n2 Instrumentation\n2.1 Ionospheric observations\nIn this study we examined the ionospheric F-region near\nTromsø, Norway, using a number of techniques, the main one\nbeing the CUTLASS bistatic HF coherent radar. CUTLASS\ncomprises stations at Pykkvibaer in Iceland and Hankasalmi\nin Finland, and is a component of the international Super-\nDARN HF radar network (Greenwald et al., 1995). In stan-\ndard operating mode these radars sweep over a 52◦ azimuth\nsector using 16 evenly spaced beams. This is represented by\nthe fan-shaped regions in Fig. 1. Each beam is gated into up\nto 75 range bins with spatial resolution of typically 45 km by\n100 km at midrange, giving a total field of view of the order\nof 3×106 km2. In standard mode, the integration time for\neach beam position is 7 s, and the cycle time is 2.0 min.\nThe operation of HF radars was described by Green-\nwald et al. (1985). In normal operation these radars detect\nechoes that are coherently backscattered from ∼10-m scale\nfield-aligned ionospheric plasma density irregularities, when\nthe radar beam direction is close to orthogonal to the B\nfield. These irregularities are produced in the high-latitude\nF-region by plasma drifts and density gradients (e.g. Fejer\nand Kelley, 1980; Tsunoda, 1988) and drift with the ambient\nplasma motion (Villain et al., 1985). In each beam the radars\nmeasure the line-of-sight Doppler velocity, the backscattered\npower, and the spectral width of the echo from these struc-\ntures.\nThe CUTLASS Iceland East radar looks across the mag-\nnetic meridian and thus is well suited to identifying features\nmoving azimuthally. The Finland radar looks toward the\nmagnetic pole and accordingly is better suited for examining\nequatorward or poleward moving features. Further details on\nCUTLASS are available at http:\/\/ion.le.ac.uk\/cutlass\/cutlass.\nhtml.\nThe observations reported here were obtained when CUT-\nLASS was operating in a non-standard scan mode, optimised\nfor high resolution studies of a specific target region. In\nthis mode three adjacent beams are scanned, with the cen-\ntral beamed scanned again between each set. The Finland\nradar thus scanned beams 6, 7, 6, 5, 6, 7, 6, ..., and simi-\nlarly the Iceland East radar scans were centered on beam 14.\nThese beams were sampled each 7 s and the first range gate\nwas set at a distance of 180 km. The radio frequency was in\nthe range 9900–10 000 MHz, appropriate for F-region reflec-\ntions. These central beams are represented in Fig. 1 by bro-\nken lines, and intersect in the F-region just east of Tromsø.\nAn important feature of radars such as CUTLASS is the\nmeasurement of the elevation angle of the backscatter re-\nturns. This is achieved using an interferometric technique\nand can assist in discriminating the direction of ground scat-\nter and the altitude of irregularity structures (Milan et al.,\n1997a, b).\nWe will also present results from a near-vertical incidence\nionospheric Doppler sounder experiment that was located\nnear Tromsø. Called DOPE (DOppler Pulsation Experi-\nment), this monitored the amplitude and Doppler shift of the\nordinary (O-mode) and extraordinary (X-mode) reflections\nfrom the F-region at a frequency of 4.45 MHz with a time\nresolution of 12.8 s. The experiment was described in detail\nby Wright et al. (1997), where typical results were also pre-\nsented. Whereas the two CUTLASS radars can measure the\nhorizontal convection velocity components, DOPE provides\na measurement of vertical motions in more or less the same\npart of the F-region.\nGeneral information on the ionosphere in this region is\navailable from the Tromsø dynasonde operated by EISCAT.\nThe dynasonde is a digital frequency-agile HF sounder that\ncan operate in a number of modes. During the interval of in-\nterest here, digital ionograms resolving the O- and X-modes\nwere available from the dynasonde every 3 min. Further de-\ntails on the EISCAT dynasonde can be found in Sedgemore\net al. (1996) and at http:\/\/www.eiscat.uit.no\/dynasond.html.\nFinally, information on the magnitude and structure of D-\nregion absorption can be obtained from the IRIS (Imaging\nRiometer for Ionospheric Studies) experiment operated at\nKilpisja¨rvi (KIL), Finland, by the University of Lancaster.\nIRIS examines ionospheric absorption of incoming galac-\ntic radio noise at a frequency of 38.2 MHz with 49 beams\nand a sampling time of 1 s. Resolution of the riometer is\n0.05 dB. The experiment was described in detail by Detrick\nand Rosenberg (1990) and Browne et al. (1995); further de-\ntails appear at http:\/\/www.dcs.lancs.ac.uk\/iono\/iris\/. Figure 1\nshows that KIL is also very near the region where the CUT-\nLASS beams intersect.\n2.2 Ground magnetometer arrays\nMagnetometer data were obtained from the IMAGE and\nSAMNET arrays that span Scandinavia and Svalbard. Sta-\ntion locations are represented by triangles and squares, re-\nspectively, in Fig. 1. The IMAGE (International Monitor\nfor Auroral Geomagnetic Effects) array was described by\nLu¨hr (1994) and Lu¨hr et al. (1998) and comprises fluxgate\nmagnetometers sampling the geographic X, Y and Z com-\nponents of the geomagnetic field each 10 s with a resolu-\ntion of 0.1–1 nT. Data were rotated into the geomagnetic\nH , D and Z reference frame for use here. Further details\nof IMAGE, including station coordinates, are available at\nhttp:\/\/www.geo.fmi.fi\/image\/. SAMNET (UK Sub-Auroral\nMagnetometer NETwork) consists of fluxgate magnetome-\nters that, during the interval considered here, sampled the\ngeomagnetic H , D and Z components each 5 s with a res-\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 561\na\nBJN\nOUL\nNOR\nNUR\nKVI\nGML\nΓ\n20˚0˚\nGEOGRAPHIC\n60˚\n80˚\nHankasalmi\nMagnetometer      Arrays\nYOR\nTRO\nJAN\nLYR\nNAL\nHOP\nOUJ\nIMAGE\nSAMNET\nHOR\nSOR\nKEV\nMAS\nSOD\nHAN\nFAR\nPykkvibær\nΓ\nC U T L A S S  viewing  areas\nPEL\nKIL\nMUO\nFig. 1. Map in geographic coordinates\nshowing CUTLASS beams and ranges\nof interest, and IMAGE and SAM-\nNET magnetometer locations. Shaded\nboxes depict ionospheric reflection re-\ngions for ground scatter recorded by\nbeam 6 of the Finland radar and beam\n14 of the Iceland East radar. The DOPE\nDoppler sounder was located just east\nof Tromsø, and the IRIS imaging ri-\nometer at KIL.\nolution of 0.25 nT. Further details appear in Yeoman et al.\n(1990a) and at http:\/\/samsun.york.ac.uk\/samnet home.html.\n2.3 Solar wind and DMSP data\nSolar wind data presented in this paper are from the WIND\nspacecraft, which at the time of interest was located up-\nstream near GSE(x, y, z) = (172.5, −5.6, 11.23)RE . We\nused solar wind and magnetic field data from the SWE (So-\nlar Wind Experiment) and MFI (Magnetic Fields Investiga-\ntion) instruments, respectively. Further information on these\nexperiments is given in Ogilvie et al. (1995) and Lepping\net al. (1995), and at http:\/\/www-istp.gsfc.nasa.gov\/istp\/wind\/\nwind.html.\nGeneral information on magnetospheric topology was ob-\ntained by reference to ion and electron flux data from the\nDMSP F12 spacecraft. This is one of a series of space-\ncraft in an approximately 830 km altitude Sun-synchronous,\n101-min period polar orbit. Spectra of low energy ion and\nelectron fluxes at high-latitudes are produced by the SSJ\/4\nelectrostatic analyzer instruments, described by Hardy et al.\n(1985). Further details on DMSP may be obtained from\nhttp:\/\/sd-www.jhuapl.edu\/Aurora\/. The use of DMSP par-\nticle spectra to infer the locations of the magnetospheric\nboundaries has been discussed by Newell and Meng (1988,\n1992) and Newell et al. (1989, 1991).\n3 Observations\n3.1 Solar wind\nThe observations to be discussed are from 23 February 1996,\nwhen Pc5 magnetic pulsations were recorded for several\nhours across the IMAGE and SAMNET magnetometer ar-\nrays, with corresponding Doppler shift oscillations occurring\nin the CUTLASS and DOPE records. Kp during this time\n562 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nFig. 2. (a, left) WIND solar wind plasma and magnetic field data, 07:00–13:00 UT, 23 February 1996. Top three panels show the solar wind\nspeed, then ion density, dynamic pressure, and magnetic field, all in GSM coordinates. For the bottom panel the thin solid line represents\nthe Bx component, the dotted line the By component, and the thick solid line the Bz component. Vertical dotted lines denote times when\nBz turns negative (labelled “A”), when solar wind pressure begins to drop (“B”) and reaches minimum (“C”), and the interval of oscillations\nconsidered in detail (“D” to “E”).\n(b, right) Power spectrum of three components of the IMF and solar wind dynamic pressure, 09:33–11:33 UT (spacecraft time; 10:20–\n12:20 UT on the ground), 23 February 1996. Resolution is approximately 0.14 mHz and time series are unfiltered. Vertical dotted line\nindicates frequency of 1.6 mHz seen in ionospheric and ground magnetometer data.\nwas in the range 2+ to 3+, but had been low over the previous\nfew days (6Kp = 8.7, 14 and 18 on 21, 22 and 23 February,\nrespectively).\nWIND observations of the solar wind plasma and mag-\nnetic field conditions from 07:00 UT to 13:00 UT on\n23 February are presented in Fig. 2a. The top panel shows\nsolar wind velocity, with density and pressure in the next\npanels. The bottom panel presents the corresponding WIND\nIMF data in GSM coordinates, where the thick solid line rep-\nresents the Bz component, the dotted line represents the By\ncomponent, and the thin solid line represents the Bx compo-\nnent.\nThe solar wind speed was generally in the range V = 405–\n430 km s−1 throughout the interval shown. This includes a\nsharp increase from ∼410 to ∼430 km s−1 around 08:50 UT\nand a subsequent decrease at ∼09:22 UT.\nThere are several features of interest in the solar wind den-\nsity, pressure and IMF plots. These are identified by vertical\ndotted lines labelled “A” to “E”. First, there is a small south-\nward turning of Bz at 08:32 UT, labelled “A”, after which\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 563\nthe Bx and Bz components are strongly negative. This is fol-\nlowed by a sharp decrease in ion density, from n∼20 cm−3 at\n08:41 UT (“B”) to 6 cm−3 at 08:57 UT (“C”). This caused a\ndecrease in solar wind pressure, nV 2, by a factor of about\n3 between these times. The pressure decrease commenc-\ning at 08:41 UT (“B”) also initiates a strong positive tran-\nsition of By , which later goes briefly negative again between\n09:59 UT and 10:12 UT.\nWe have calculated the propagation lag from WIND to\nthe magnetopause and ionosphere using the formula given\nby Lockwood et al. (1989) and assuming an Alfve´n wave\ntransit time through the magnetosphere to the ionosphere of\n2 min. The time lag from WIND to the ionosphere varies\nfrom nearly 50 min at “A” and “B” to 47 min for the later\nevents. For simplicity, we henceforth assume a fixed 47-min\nlag from the satellite to the ionosphere. This will not affect\nthe discussion of the sequence of observations.\nAccordingly, the negative pressure pulse at 08:41 UT (“B”\nin Fig. 2a) should reach the ionosphere at ∼09:28 UT, and\nthe maximum depth of the pressure pulse (“C”) occurs at the\nionosphere at 09:44 UT. The solar wind pressure commences\nrecovery to near its original value at ∼09:20 UT (at WIND).\nPeriodic solar wind pressure fluctuations with amplitude\nup to 25% of the total amplitude occurred for some hours\nafter the pressure decrease. These commenced around\n09:33 UT at WIND and 10:20 UT at the ionosphere (“D”),\nand ended at WIND around 11:33 UT (“E”) and 12:20 UT at\nthe ionosphere. Figure 2b shows power spectra of the three\ncomponents of the IMF and the solar wind dynamic pres-\nsure measured by WIND between 09:33 UT and 11:33 UT\n(∼10:20–12:20 UT at the ionosphere). The spectra were\ncomputed using a single FFT, weighted by a Hanning win-\ndow and with no detrending or filtering. Frequency resolu-\ntion of the spectra is approximately 0.14 mHz. The spec-\ntra show a peak in solar wind pressure variations with a fre-\nquency near 1.5–1.7 mHz (period 10–11 min), which is dou-\nble the power of the adjacent peaks. The IMF By component\nshows peaks near 1.6 and 2.1 mHz, the Bz component has a\npeak near 2.1 mHz only, and no clear peak is present in the\nBx spectrum. Note that there do not appear to be any step-\nlike transients in the solar wind pressure or in the Bx and\nBz components during this interval (see Fig. 2a). However,\nthere is a significant transient variation in By , as mentioned\nearlier.\nAccording to a formula given by Farrugia et al. (1989),\nthe negative solar wind pressure pulse would have resulted\nin sunward motion of the magnetopause of ∼1.9RE , and the\nsubsequent fluctuations would have caused motions of the\norder of 0.2–0.4RE .\n3.2 Cutlass radar\nHF radar data are typically presented in the form of whole-\nday range-time parameter plots for a particular beam. Pa-\nrameters of interest are the power, the line-of-sight velocity,\nthe elevation angle, and the spectral width (in m s−1) of the\nreturned signal. Backscatter regions of small velocity and\nspectral width are normally considered to indicate ground\nscatter and their plotting is usually suppressed. In the fol-\nlowing plots we have not suppressed this low velocity, low\nspectral width information.\nFigure 3 presents combined range-time-velocity plots for\nbeam 6 from the Finland radar and beam 14 from the Ice-\nland East radar, from 09:00 to 13:00 UT on 23 February.\nPanels (a) and (c) present Doppler velocity data that has\nbeen identified as coming from ionospheric scatter, while\npanels (b) and (d) present Doppler velocity data that has\nbeen identified as coming from ground scatter. Milan et al.\n(1997a) have discussed the distinction between ionospheric\nand ground scatter in HF radar returns. Figure 3 shows many\ncomplicated features. Milan et al. (1998) presented plots of\nthe Finland beam 5 power, velocity and elevation angle for\nthis day, and provided a detailed discussion of the features\nobserved.\nWe consider first the Finland velocity plot shown in\nFig. 3a. There is a prominent zone of periodic high veloc-\nity poleward moving features (negative velocity = away from\nradar = red), commencing near 09:20 UT between 76–80◦\nmagnetic latitude (range gates 45–50) and moving to 72–\n76◦ latitude (gates 40–45) by 13:00 UT. The corresponding\npower level plot (not presented here but see Milan et al.,\n1998) shows that this zone is associated with high backscat-\ntered power. In radar data the cusp footprint is associated\nwith a complex Doppler spectrum and broad spectral width\n(Baker et al., 1995). The spectral width plot (not given)\nshows irregular and high spectral widths (450 m s−1) from\n76–80◦ latitude at 09:30 UT. Finland beam 6 points 18◦ west\nof geographic north and the high velocity, high spectral width\nzone lies magnetically poleward and somewhat west of Sval-\nbard. We interpret this zone as the signature of the dayside\nauroral oval, and henceforth refer to radar returns from this\nregion as ionospheric scatter. The negative, pulsed veloc-\nity structures throughout the interval represent antisunward\nflow, and are characterised by broad radar spectral widths.\nAs such, they are typical of the radar cusp scatter under IMF\nBz south conditions (Pinnock et al., 1993, 1995; Provan et\nal., 1998; Neudegg et al., 1999).\nThe DMSP F13 spacecraft passed over the arctic region\nnorthwest of Svalbard around 08:47 UT on this day. The ob-\nserved particle energies and fluxes indicate that the cusp and\nopen\/closed field line boundary were located ∼75◦ magnetic\nlatitude. This lends confidence to our identification of the\nhigh velocity region as cusp\/dayside auroral oval and agrees\nwith the magnetometer observations presented later.\nThe solar wind pressure decrease arriving at the iono-\nsphere around 09:30 UT appeared to initiate or enhance pe-\nriodic antisunward flow bursts in the cusp ionosphere that\nlasted about two hours. The period of the features here is\nof the order of 10 min. The equatorward movement of the\nlow-latitude boundary of this flow zone at ∼10:45 UT is in-\ndicative of an expanding polar cap resulting from dayside\nreconnection under IMF Bz south conditions.\nWe now examine the low velocity region in the Finland\nradar data, shown in Fig. 3b. This extends from 66◦ to > 70◦\n564 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nSUPERDARN PARAMETER PLOT\nFinland and Iceland East: vel\n23 Feb 1996\n \n70\n75\n80\nM\na\ng\nn\ne\nti\nc \nLa\nti\ntu\nd\ne\nM\na\ng\nn\ne\nti\nc \nLa\nti\ntu\nd\ne\n-800\n-600\n-400\n-200\n0\n200\n400\n600\n800\nV\ne\nlo\ncity\n (m\ns -1)\nIonospheric\nscat only\n \n70\n75\n80\nM\na\ng\nn\ne\nti\nc \nLa\nti\ntu\nd\ne\nM\na\ng\nn\ne\nti\nc \nLa\nti\ntu\nd\ne\n-24\n-18\n-12\n-6\n0\n6\n12\n18\n24\nV\ne\nlo\ncity\n (m\ns -1)\nGround\nscat only\n \n100\n110\n120\n130\nM\na\ng\nn\ne\nti\nc \nLo\nn\ng\nit\nu\nd\ne\nM\na\ng\nn\ne\nti\nc \nLo\nn\ng\nit\nu\nd\ne\n-800\n-600\n-400\n-200\n0\n200\n400\n600\n800\nV\ne\nlo\ncity\n (m\ns -1)\nIonospheric\nscat only\n09 09 10 10 11 11 12 12 13\nUT\n90\n100\n110\n120\n130\nM\na\ng\nn\ne\nti\nc \nLo\nn\ng\nit\nu\nd\ne\n:00 :30 :00 :30 :00 :30 :00 :30 :00\nM\na\ng\nn\ne\nti\nc \nLo\nn\ng\nit\nu\nd\ne\n-24\n-18\n-12\n-6\n0\n6\n12\n18\n24\nV\ne\nlo\ncity\n (m\ns -1)\nGround\nscat only\nA B C D E\nIceland beam 14, ground scatter\nIceland beam 14, ionospheric scatter\nFinland beam 6, ground scatter\nFinland beam 6, ionospheric scatter(a)\n(b)\n(c)\n(d)\nFig. 3. Range-time-velocity plot for Finland beam 6 ionospheric scatter (top panel, (a) and ground scatter (b), and Iceland East beam 14\nionospheric scatter (c) and ground scatter (d), over 09:00–13:00 UT on 23 February 1996. Vertical dotted lines indicate approximate arrival\ntimes at the ionosphere of events labelled “A” to “E” in Fig. 2. Finland ground scatter in (b) before 10:24 UT, indicated by the vertical dashed\nline, is from behind the radar.\nin magnetic latitude (range ∼1000–1500 km). Figure 1 of\nMilan et al. (1998) shows that this region is characterised\nby high backscattered power (40 dB) and high elevation an-\ngles. Spectral widths are low (< 100 m s−1). We denote this\nas ground scatter. Milan et al. (1998) have provided a de-\ntailed discussion on the interpretation of the elevation angle\ndata and the location of ground scatter regions in front of and\nbehind the radar on this day.\nImmediately obvious in the Finland ground scatter in\nFig. 3b are patches of alternating velocity features extend-\ning up to 10◦ in latitude, commencing with two prominent\nbands at∼09:30 UT and 0936 UT. These follow the main so-\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 565\n \n0\n500\n1000\n1500\nVe\nlo\nci\nty\n (m\ns-1 )\n(b)\nFinland: ionospheric scatter, ranges 40 and 44\n \n0\n20\n40\n60\nVe\nlo\nci\nty\n (m\ns-1 )\n(c)\nFinland: ground scatter, ranges 24 and 25\n09:00 09:30 10:00 10:30 11:00 11:30 12:00 12:30 13:00\nUT\n0\n2\n4\n6\nD\nop\npl\ner\n S\nhi\nft \n(H\nz)\n(d)\nDOPE: O-mode at 4.45 MHz\n \n50\n100\n150\nVe\nlo\nci\nty\n (m\ns-1 )\n(a)\nIceland East: ground scatter, ranges 32, 34 and 35\nSUPERDARN PARAMETER PLOT\nCUTLASS Finland and Iceland East (vel) and DOPE\n23 Feb 1996 (54)\nnormal (cw) scan mode (127)\nFig. 4. Stacked velocity-time plot of CUTLASS and DOPE Doppler oscillations, 09:00–13:00 UT, 23 February 1996. The same CUTLASS\nbeams are shown as in Fig. 3. The panels show, from top to bottom, Iceland East ground scatter, Finland ionospheric scatter, Finland ground\nscatter, and HF Doppler O-mode.\nlar wind pressure decrease labelled “B” in Figs. 2a and 3.\nAlternating features due to velocity oscillations of amplitude\n±20 m s−1 or less, with period of ∼10 min, are present for at\nleast 3 h, and have a very similar shape over 4–8 range gates,\ni.e. over 180–360 km in latitude. We emphasise that these are\nground backscatter features, not returns from field-aligned ir-\nregularity structures in the usual sense.\nNow consider the Iceland East range-time-velocity plots,\nshown in Figs. 3c and d. The transition at 10:00 UT cor-\nresponds to the radar switching into the special high reso-\nlution mode. Of interest is the zone of low velocity bands\nin the bottom panel (d), commencing around 09:30 UT and\nvisible during the entire plot interval. The bands extend over\nabout 10 range gates (∼450 km) and are associated with high\npower levels, very low spectral widths, high elevation angles\n(25–30◦), and line-of-sight velocities of the order of ±10–\n20 m s−1. Detailed plots appear in Menk et al. (2001). The\nbands are due to velocity oscillations that were essentially si-\nmultaneous across the field of view and exhibited a 10-min\nperiodicity. The zone of velocity structures gradually moved\nwestward, toward the radar. As for the Finland radar, we\ninterpret this entire zone of velocity oscillations as ground\nscatter.\nThe most likely explanation of the low velocity bands seen\nby both radars is that the ground scatter signal is experienc-\ning a Doppler shift during each traversal through the iono-\nsphere, for example, in response to motion of the ionospheric\nplasma. The Doppler shifts are periodic and commence at the\nsame time as the negative solar wind pressure pulse would\nreach the ionosphere. To investigate this further, we next\nconsider results from the vertical incidence Doppler sounder\nexperiment, DOPE.\n3.3 HF Doppler sounder and digisonde\nDOPE recorded ionospheric Doppler oscillations on this day\nat the same time as the Doppler oscillations measured by\nCUTLASS. This is apparent in Fig. 4, which displays stacked\nvelocity-time plots for selected Iceland East and Finland\nrange gates, and Doppler shift-time plots for the O-mode\nfrom DOPE. The DOPE X-mode record is similar to the O-\nmode and therefore not shown. Note the different ordinate\naxis scales for each panel. The two large oscillations com-\nmencing near 09:30 UT are particularly prominent, and fur-\nther oscillations occur later in all traces. The two Finland\nionospheric scatter plots in the second panel show auroral\noval features at 75.2◦ and 77.0◦ magnetic latitude, whereas\nthe plots in the third panel are for the Finland ground scatter\nnear 69.2◦ and 69.5◦ magnetic latitude.\n566 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\n \n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n(a)Finland: beam 6\nrange: 44\nrange: 25\nrange: 24\n \n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\nN\nor\nm\nal\nis\ned\n S\npe\nct\nra\nl P\now\ner (b)Iceland East: beam 14\nrange: 35\nrange: 34\nrange: 32\n0 2 4 6 8 10\nFrequency (mHz)\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n(c)DOPE: 4.45 MHz, O-mode\nFig. 5. Stacked power spectra (0.3 mHz resolution), over 10:20–\n11:20 UT, for (a) Finland beam 6 radar velocities (b) Iceland beam\n14 radar velocities, and (c) DOPE vertical incidence Doppler shifts.\nIonograms from the Tromsø dynasonde show that for ver-\ntical incidence, the 4.45 MHz O-mode group height was\n∼260–265 km over this interval, with foF2 ∼5.4 MHz. The\nionosphere did not appear to be particularly disturbed before\n13:00 UT, and the DOPE oscillations were observed from\njust below the peak of the F2-region.\nPower spectra of the Finland, Iceland East and DOPE\nDoppler oscillations over the interval 10:20–11:20 UT (i.e.\nfrom the end of pressure pulse – labelled “D” in Figs. 2b\nand 3, and covering the first half of the pressure oscillations)\nare compared in Fig. 5, for most of the range bins presented\nin Fig. 4. The DOPE data were low pass filtered at 11 mHz\nand the spectra were computed with a single FFT then nor-\nmalized to facilitate comparison. Resolution of all the spec-\ntra is about 0.3 mHz. The Iceland East ground scatter spectra\n(Fig. 5b) show a clear peak ∼1.7 mHz at ranges correspond-\ning to the low velocity backscatter pulsations. The Finland\nplots (panel a) is more complicated, with extra spectral fea-\ntures present. This is not surprising for the auroral oval iono-\nspheric scatter (range gate 44). Finland beam 6, ranges 24\nand 25 and DOPE (panel (c)) are essentially looking at the\nsame part of the ionosphere and show prominent spectral\npeaks near 1.1 mHz. Finland beam 6, range gate 24 also\nshows a secondary peak at 1.7 mHz. Note also the small\npeaks around 6–8 mHz present in the Finland ground scat-\nFig. 6a. Magnetometer H -component data from the IMAGE and\nSAMNET arrays, 23 February 1996. Time series records for 09:00–\n13:00 UT. Vertical dotted lines indicate approximate arrival times at\nthe ionosphere of events labelled “A” to “E” in Figs. 2 and 3.\nter and DOPE spectra.\n3.4 Ground magnetometer data\nFigure 6a presents stacked H -component time series plots\nfrom representative IMAGE and SAMNET magnetometer\nstations for 09:00–13:00 UT (covering the IMF Bz south-\nward turning, the solar wind pressure pulse, and the arrival\nof oscillations at the ionosphere), band-pass filtered between\n1 and 10 mHz. Vertical dotted lines, labelled “A” to “E”,\nindicate arrival times at the ionosphere of the features iden-\ntified in Figs. 2a and 3. Figure 6b is a higher resolution\nplot showing the H - and D-components (solid and dotted\nlines, respectively) over 09:10–10:10 UT (covering the IMF\nBz southward turning and the solar wind pressure pulse ar-\nrival at the ionosphere) for the same stations.\nAll stations recorded a large bipolar event starting around\n09:30 UT, coincident with the presumed arrival at the iono-\nsphere of the solar wind pressure pulse (recall that because\nwe assumed a uniform propagation time, the solar wind pres-\nsure decrease labelled “B” actually reaches the ionosphere\naround 09:30 UT). This was followed for some hours by Pc5\npulsation activity that was remarkably similar at all stations\n< 74◦ latitude. The amplitude of these pulsations appears to\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 567\nFig. 6b. Expanded time series records for 09:10–10:30 UT, where\nH -component is the solid line and D-component is the dotted line.\nVertical dashed lines indicate events identified earlier.\npeak, and the phase seems to change, between SOR (67.2◦)\nand BJN (71.3◦) latitude. The magnetometer time series\nalso show two transient, pulse-like events starting around\n09:20 UT at ∼74◦ magnetic latitude (HOR), coincident with\nthe southward turning of Bz reaching the ionosphere. The\npulses are clearest in theH -component and appear somewhat\nlater at other latitudes. At this time shorter period (frequency\n6–8 mHz) pulsations commenced at lower latitudes. These\nwere most prominent ∼66–67◦ latitude.\nStacked power spectra for the same magnetometer H -\ncomponents are presented in Fig. 6c. This is the same\ntime interval shown in Fig. 5, although similar features were\npresent for some hours in the magnetometer spectra. The\nspectra in Fig. 6c were weighted by f 1.0, to better display\nhigher frequency features, and normalized to facilitate com-\nparison. Spectral resolution is∼0.3 mHz. The spectra show a\nclear peak around 1.6–1.7 mHz at all stations < 75◦ latitude.\nSmaller peaks ∼6–8 mHz are also present at many stations.\nSignals at the highest latitude stations (HOR, LYR and\nNAL, 74–76◦ magnetic latitude) have more high frequency\nactivity and are somewhat different in appearance to the\nlower latitude signals. This suggests they are probably as-\nsociated with the dayside auroral oval and open\/closed field\nline boundary, in agreement with the CUTLASS and DMSP\nobservations discussed earlier.\nWe now consider the 1.6–1.7 mHz magnetic pulsations in\nmore detail. The variation in amplitude, phase, ellipticity\nand azimuth with geomagnetic latitude for this frequency is\nFig. 6c. Power spectra for 10:20–11:20 UT (resolution is 0.3 mHz).\nSpectra were weighted by f 1.0 and normalized.\nshown in Fig. 7. These measurements were obtained using\ncomplex demodulation (Beamish et al., 1979; Chisham and\nMann, 1999) over a bandwidth of 1.5–2.3 mHz, yielding a\ndemodulate value each 12 min. The points plotted in Fig. 7\nare for the time interval centred on 10:36 UT, but other times\ngive similar results. The plots show a peak in amplitude, a re-\nversal in phase, and linear generally north-south polarization,\nall consistent with a field line resonance (FLR) around 72–\n73◦ geomagnetic latitude. The dotted vertical line near 73◦\nindicates the latitude of the amplitude peak. The full width\nat half power (FWHP) of the amplitude-latitude profile indi-\ncates a resonance scale size at the ground of the order of 4◦\nin latitude, i.e. ∼400 km.\nAzimuthal wave numbers m were determined using D-\ncomponent data for stations near 66.1◦ and also near 63.6◦\ngeomagnetic latitude. These wave numbers are of the order\nof −5 to −8 at 09:48 UT, reducing to 0 to +1 at 10:36 UT,\nand −2 at 11:00 UT. Negative m numbers denote westward\npropagation. The azimuth angles equatorward of the reso-\nnance are generally directed north-east earlier in the day and\nrotate to northwest after noon.\n568 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nFig. 7. Variation in amplitude (top\npanel), phase, ellipticity and azimuth\nangle (bottom) for 1.6 mHz geo-\nmagnetic pulsations at 10:36 UT on\n23 February 1996. In the upper two\npanels squares denote H -component\nvalues and triangles D-component.\nUsing IMAGE data, Mathie et al. (1999b) showed that dis-\ncrete FLRs occur at the eigenfrequency of the continuum\ndetermined from the cross-phase between pairs of adjacent\nmagnetometer stations (Waters et al., 1995). We measured\nthe field line eigenfrequency in this way (Menk et al., 2001)\nand during the morning of 23 February, it varied smoothly\nfrom 1.6±0.3 mHz at 71.4◦ latitude, to 8.0±0.3 mHz at 66◦,\nand 15±1 mHz at 62◦. Complex demodulation plots in the\nsame format as Fig. 7 but for a frequency of 8.0 mHz show a\nsmall peak in power, a reversal in phase and changes in ellip-\nticity and azimuth characteristic of a FLR, near 66◦ latitude.\nCross-phase measurements can be used to estimate the\nwidth, Q and damping of the resonance (Menk et al., 1999).\nFor the 1.6–1.7 mHz signal the resonance width in the iono-\nsphere is thus estimated at 90–150 km, the Q is 1.5 to > 3,\nand the damping factor ∼0.3. We could not obtain a cross-\nphase resonance signature at ≥ 75◦ latitude. This is indica-\ntive of open field lines at these latitudes (Ables et al., 1998).\n3.5 Imaging riometer observations\nData from the Kilpisja¨rvi imaging riometer were inspected\nin the form of power-time and absorption-time plots, and\ncolour absorption maps. The latter represent the projection\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 569\nFig. 8. Cosmic noise absorption over 07:00–13:00 UT for the wideband KIL riometer. Resolution is 0.05 dB. Vertical dotted lines indicate\napproximate arrival times at the ionosphere of events labelled “A” to “E” in Figs. 2 and 3.\nto 90 km altitude of cosmic noise absorption over a square\n240×240 km area, measured each 15 or 120 s. The IRIS\nfacility also includes a widebeam riometer, with a −3 dB\nbeamwidth of∼94◦. Figure 8 shows the variation in received\npower over 07:00–13:00 UT, measured with the widebeam\nriometer. For brevity other beams and absorption maps are\nnot shown here, but they indicate the same general features.\nThe dotted vertical lines in the figure denote the arrival times\nat the ionosphere of the events discussed earlier, including\nthe southward Bz turning at 09:19 UT (“A”) and the initial\nsolar wind pressure decrease near 09:28 UT (“B”). A sud-\nden increase in absorption (i.e. decrease in received signal\npower), commencing at 09:19 UT, was followed at 09:28 UT\nby a decrease in absorption, lasting ∼20 min. Enhanced ab-\nsorption between ∼09:50–10:35 UT coincides with the solar\nwind pressure minimum in Fig. 2a.\n4 Discussion\n4.1 Effects of solar wind variations\nIn this paper we are principally concerned with the responses\nof the ionospheric sounders and magnetometers to the sudden\ndecrease in solar wind pressure arriving at 09:30 UT. This\nwas preceded by a southward turning of Bz at 09:19 UT, al-\nthough Bz had been negative for about 45 min just before\nthen and IMF conditions conducive to dayside reconnection\noccurred throughout the interval under consideration.\nInspection of Fig. 3 and high resolution velocity-time plots\nnot given here show that two narrow poleward moving flow\nbursts were recorded by the Finland radar between 09:20–\n09:30 UT. These started near 76◦ latitude and extended to 79◦\nlatitude at a rate of ∼1.5–2 km s−1, while the flow velocity\nwithin the flow channels was ∼1.0 km s−1. The high reso-\nlution magnetometer time series in Fig. 6b shows that near\nthe same time, a pair of pulses was observed at HOR (74.0◦\ngeomagnetic latitude), appearing somewhat later at other lat-\nitudes. Taking into account the longitudinal spread of the sta-\ntions (HOR is westward of HOP), the data suggest the pulses\nwere travelling mostly eastward at 1.5–3 km s−1. This was\nfollowed at lower latitudes by 6–8 mHz pulsations. A sud-\nden increase in cosmic noise absorption was recorded by the\nriometer at 65.8◦ latitude between 09:20–09:30 UT.\nThese observations are consistent with the ionospheric sig-\nnatures of reconnection at the magnetopause (e.g. Pinnock\net al., 1993; Øieroset et al., 1997). In particular, south-\nward Bz turnings are connected with flux transfer events\n(FTEs). SuperDARN radar observations of the cusp have\nshown that the ionospheric footprint of FTEs is characterised\nby pulsed poleward moving flow bursts, known as pulsed\nionospheric flows (PIFs) or flow channel events (FCEs), near\nthe polar cap boundary (Pinnock et al., 1995; Provan et al.,\n1998; Provan and Yeoman, 1999; Neudegg et al., 1999;\nMcWilliams et al., 2000). The relationship between PIFs,\nFCEs and FTEs is discussed more thoroughly in Wild et al.\n(2001). A detailed discussion of the mapping of FTEs to the\nionosphere in PIFs appears in McWilliams et al. (2001).\nThe poleward flow bursts in the Finland velocity plot are\nsimilar in appearance to reported PIFs and commenced when\nBz turned southward at 09:19 UT, about 10 min before the\nsolar wind pressure pulse. The equatorward boundary of the\nhigh velocity region is ∼76◦ and near the likely ionospheric\nfootprint of the open\/closed field line boundary (Rodger and\nPinnock, 1997; Milan et al., 1998). This agrees with the radar\nspectral width, DMSP and magnetometer observations. Sim-\nilarly, the magnetometer observations are consistent with the\npredicted appearance and motion of the ground signature of\nFTEs under By negative conditions in the Northern Hemi-\n570 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nB\n10000\nRange (km)\nrayA\nrayB\n2000\nvivd\nB\n10000\nRange (km)\nrayC\n2000\nvivd\n(b)  10:24-13:00 UT\n(a)  09:00-10:24 UT\n-1000\n-1000\nFig. 9. Likely ray paths for the Finland\nradar. (a) 09:00–10:24 UT. Ray A rep-\nresents ground scatter reflected from the\nF-region behind the radar, and experi-\nencing ionospheric Doppler oscillations\nvd . Ray B represents ionospheric scat-\nter from the cusp F-region, with line-of-\nsight Doppler velocity vi .\n(b) 10:24–13:00 UT. Ray C represents\nsimultaneous F-region reflected ground\nscatter and 1.5 hop mode ionospheric\nscatter from the auroral F-region.\nsphere (Southwood, 1987; Chaston et al., 1993; Provan et\nal., 1998).\nThe sudden decrease in solar wind pressure commencing\nat 09:30 UT then appeared to enhance the flow bursts, trig-\ngered F-region Doppler oscillations, initiated 1.6–1.7 mHz\nmagnetic pulsations with a large bipolar event, and caused\na reduction in riometer absorption. The flow bursts, Doppler\nshifts and magnetic pulsations occurred over a wide region,\nlasted for some hours, and exhibited the same period as so-\nlar wind pressure fluctuations. The IMF Bz component was\nsouthward throughout the pressure decrease, and shows some\nfluctuations but at a higher frequency than observed on the\nground (Fig. 2b). Thus, while conditions were favourable\nfor reconnection, and the radar cusp region flow channels\nappear to be reconnection related, it is the changes in solar\nwind pressure that seem to be driving the ionospheric and\nmagnetic perturbations.\n4.2 Properties of the ionospheric oscillations\nHere we discuss the spatial variation in phase and the loca-\ntion, scale size and direction of motion of the ionospheric\noscillations. We first consider phase motion of the oscilla-\ntory features in the Finland Doppler velocity record. For this\npurpose we determined the phase delays at several times after\n10:30 UT, using stacked velocity-time plots and phase spec-\ntra (not shown here) for several range gates in beam 6.\nFor the ground scatter velocity oscillations the phase\ndelays suggest the oscillations (which are being observed\nmostly equatorward of the FLR) are moving poleward at 1–\n5 km s−1. This sense of motion is consistent with the change\nin phase of magnetic pulsations associated with resonance\n(Walker et al., 1979). Milan et al. (1997a) pointed out that the\nCUTLASS radars can observe ground scatter from both in\nfront of the radar and from behind the radar, in a rear lobe of\nthe antenna pattern. Accordingly, Milan et al. (1998) argued,\nfrom an analysis of radar elevation angles, that ground scatter\nobserved at Finland before 10:24 UT on this day is from be-\nhind the Finland radar. This time is identified by the dashed\nline on Fig. 3b. Returns are obtained from behind the radar\ndue to the low F-region electron density in the high-latitude\nwinter ionosphere compared to lower latitudes. However,\nbetween 10:24 UT and 14:00 UT, the high-latitude F-region\nelectron density increased sufficiently so that ground scat-\nter from in front of the radar is of higher backscatter power\nand hence dominates. A similar analysis of elevation angles\ndemonstrates that the ground scatter from Iceland (Fig. 3d)\nis from in front of the radar.\nMotion of the ionospheric backscatter flow bursts (associ-\nated with the auroral oval) over the times of interest are also\ngenerally poleward, at 2–3 km s−1. Prikryl et al. (1998) ob-\nserved similar properties for flow channel events associated\nwith solar wind pressure fluctuations. They found similar\ndiscrete frequencies in power spectra of ULF waves on the\nground, magnetic field variations recorded by GOES, GEO-\nTAIL and WIND, and ionospheric velocity oscillations in HF\nradars. This led them to argue that the convection velocity\noscillations were controlled by the oscillating solar wind-\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 571\nmagnetosheath magnetic and electric fields at the dayside\nmagnetopause, while FLRs were excited on magnetic shells\nadjacent to the noon magnetopause.\nFor the Iceland East radar the Doppler velocity ground\nscatter oscillations (Fig. 3d) appear to move westward be-\nfore about 11:00 UT, and eastward, or have no net east-west\nmotion afterward. The speed is variable, corresponding to\nan azimuthal wave number of the order of −2 to −5 be-\nfore 11:00 UT. This agrees well with the magnetometer mea-\nsurements. Inspection of Fig. 4 and higher resolution plots\nnot given here shows that the ionospheric oscillations are in\nphase, or nearly in phase, in the Finland, Iceland East and\nDOPE echoes.\nNow we consider the location where the radar oscillations\nare observed. Figure 9a shows the likely ray-path geometry\nfor the CUTLASS Finland beam between about 09:00 UT\nand 10:24 UT (including the southward turning – “A” in\nFig. 2a – and the solar wind pressure pulse reaching the iono-\nsphere). Information on identifying the ray paths comes from\nthe different properties of ionospheric and ground scatter, as\ndescribed earlier, and from interferometer measurements of\nelevation angle (Milan et al., 1997a, b, 1998). Following the\nearlier discussion on the location of the ground scatter, ray\nA represents the ground scatter return reflected from the F-\nregion behind the radar, and ray B represents the F-region\nionospheric scatter. Motions in the cusp ionosphere are indi-\ncated by the orthogonal velocities vi . Since the calculation of\nrange is based on time of flight, the ionospheric Doppler os-\ncillations vd in ray A will occur at approximately half the dis-\ntance indicated on the range-time plots. The same will apply\nto the Iceland East ground scatter observations. These iono-\nspheric target regions are represented by the shaded boxes in\nFig. 1, and span 64–68◦ N geographic for the Finland radar,\nand 16 to 1◦ geographic longitude for Iceland East.\nAfter ∼10:24 UT high elevation angles in the Finland re-\nturns for larger ranges (see Milan et al., 1998) suggest the\nray path shown in Fig. 9b. This mode, ray C, provides simul-\ntaneous F-region reflected ground scatter and 1.5 hop iono-\nspheric scatter from the auroral F-region. High velocity Pc5\nfeatures have been reported previously in HF radar data at\nslightly lower latitudes (Yeoman et al., 1990b, 1997) and in\nthe cusp (Matthews et al., 1996), although not in the context\nof 1.5 hop returns as discussed here.\nThe ground scatter Doppler shift regions for the two radars\nare separated by several hundred km and indicate that the\nionospheric oscillations span at least 25◦ in longitude. In\naddition, the observation of ground scatter from behind the\nFinland radar before 10:24 UT indicates that the oscilla-\ntions extend over at least 16◦ in latitude. The magne-\ntometer observations also showed that the pulsations ex-\ntend over at least 20◦ (2200 km) in latitude. The magne-\ntometer observations in Fig. 7 and the cross-phase analysis\nshow that the 1.6–1.7 mHz resonance region is around 72–\n73◦ magnetic latitude (HOP, HOR, BJN). The 1.6–1.7 mHz\nionospheric Doppler oscillations were observed 6–7◦ (660–\n770 km) equatorward of this region. Wright et al. (1998) had\npreviously reported the appearance of Pc5 pulsations in the\nionosphere, up to 8◦ equatorward of a broad FLR identified\nusing the IMAGE magnetometer array.\nFinally, we consider the ionospheric velocity vectors for\nthe ground scatter, vd for ray A before 10:24 UT and ray C\nafter 10:24 UT. We assume that (a) the Finland and Iceland\nEast radars and DOPE are examining the same altitude in the\nionosphere, and (b) the radar and DOPE Doppler shifts are\ndue solely to vertical motions of the reflection point. Further-\nmore, note that rays A and C in Fig. 9 traverse the Doppler\nshift region twice, so the resultant velocity should be halved.\nUnder these assumptions, the largest amplitude Doppler\nvelocity oscillations observed by the CUTLASS radars each\ncorrespond to peak velocity components of about±10 m s−1,\nand the DOPE Doppler oscillations to ±30 m s−1 vertically,\nwith equivalent motions of the reflection point of a few km.\nAlthough assumption (b) ignores the effects of redistribution\nof plasma or changing magnetic field, it is instructive to es-\ntimate the Doppler shifts that would result from particle mo-\ntions driven by downgoing transverse Alfve´n waves. If the\nvelocity and magnetic field perturbations are linearly related,\nthen (Rishbeth and Garriott, 1964)\n1V ≈ 1B√\nµ0ρ\n√\nω\nvin\n, (1)\nwhere ρ is the mass density of the F2-region plasma (com-\nprising mostly O+ ions at a concentration of∼3×1011 m−3),\nω is the angular frequency of the pulsation, and vin is the ion-\nneutral collision frequency in the F-region, ∼1 s−1. Hence,\nfor 1B∼10 nT (assuming no attenuation between the be-\ntween the ionosphere and the ground) and ω∼0.01 rad s−1,\nwe have V ∼ 10 m s−1, comparable to the magnitude of the\nobserved Doppler oscillations.\nThese observations highlight the ability of ground scat-\nter measurements to extend the scope and capability of HF\nradars for monitoring perturbation features in the ionosphere.\nWe note in this regard that auroral backscatter radars (such as\nSTARE) are limited by the threshold for the formation of ir-\nregularities, which is of the order of 15–20 mV m−1 (Cahill\net al., 1978). Importantly, downgoing fast (compressional)\nmode waves are characterised by small ionospheric electric\nfields (Kivelson and Southwood, 1988; Yeoman and Lester,\n1990), and are, therefore, more readily detected using ground\nscatter measurements.\nPoole et al. (1988) showed that three separate mechanisms\ncontribute to pulsation-driven ionospheric Doppler oscilla-\ntions, while Sutcliffe and Poole (1989) gave a detailed dis-\ncussion of the validity of the E × B mechanism (their V2\nmechanism). Sutcliffe and Poole’s (1989) predicted Doppler\nvelocities vary strongly with height near the E- and F-region\npeaks; this is the reason for assumption (a). However, the\nPoole et al. (1988) modelling assumes purely transverse\nshear Alfve´n mode downgoing waves. This may not be the\ncase some distance away from the resonance latitude, such as\nin our situation here, where the downgoing waves are likely\nto be a mix of shear Alfve´n and fast modes. Modelling of\nULF wave effects in the ionosphere at low-latitudes (Waters\net al., 2001) indicates that the HF Doppler oscillations due\n572 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nto downgoing fast mode waves are smaller than for shear\nAlfve´n mode waves. Therefore, it is difficult to anticipate\nthe ionospheric velocities we would expect to see here, but\nthe inferred velocity components probably represent an up-\nper bound on the real case.\n4.3 Pulsation source mechanism\nThe magnetometer and radar observations show 1.6–1.7 mHz\npulsations with similar appearance over at least 20◦ in lati-\ntude and 25◦ in longitude. These were triggered initially by\nthe solar wind pressure pulse, and continued for some hours.\nThe solar wind dynamic pressure was variable during that\ntime, with a spectral peak ∼1.6 mHz (Fig. 2b). The IMF was\nalso variable, with spectral peaks around 1.6 mHz in By and\n2.1 mHz in all three components. Since transient fluctuations\nare often present in the solar wind pressure and IMF, caution\nis needed when interpreting such spectra. However, signif-\nicant transients do not seem to be present during the inter-\nval considered, except in By . The extended interval of 1.6–\n1.7 mHz ionospheric and magnetic oscillations is, therefore,\nmost likely due to (a) periodic solar wind pressure variations,\n(b) periodicity in the reconnection rate, or (c) some combi-\nnation of these mechanisms. The most likely explanation of\nthe spatial extent of the observations is that one or both of\nthese mechanisms launched fast mode waves into the mag-\nnetosphere, driving resonances where the field line eigenfre-\nquency and incoming wave frequency match, and forced field\nline oscillations elsewhere (Hasegawa et al., 1983). Complex\ndemodulation (Fig. 7) and cross-phase analysis demonstrates\nthat the pulsations coupled to FLRs around 72–73◦ geomag-\nnetic latitude, equatorward of the predominantly reconnec-\ntion driven flows at 74–80◦.\nSolar wind impulse-driven pulsations can have similar sig-\nnatures to localized field line reconnection events (Farrugia\net al., 1989; Sibeck, 1990). In our data, a reasonably local-\nized pulse occurred at 09:19 UT (the southward Bz event) at\nlatitudes near 74◦, where the Finland radar observed recon-\nnection related flows. This propagated relatively slowly to\nother latitudes. In contrast, the pressure decrease at 09:30 UT\nproduced a bipolar response at more widely spaced locations\nthan the reconnection events, and was followed by sustained\nPc5 signals driven at the same frequency as the solar wind\npressure oscillations.\nYeoman et al. (1997) presented high resolution mea-\nsurements of 7–8 mHz magnetic pulsations recorded with\nIMAGE magnetometers, and simultaneous CUTLASS Fin-\nland backscatter velocity oscillations of magnitude 100–\n300 m s−1. The pulsations were most probably due to an\nimpulse-driven cavity\/waveguide resonance, which coupled\nto FLRs whose width in the ionosphere over Tromsø was\nof the order of 60 km. Such a small scale-size means that\nthe FLR is highly attenuated in the ground magnetometer\ndata. Our signals have considerably larger scale size, al-\nthough the cross-phase measurements, which are based on\nthe difference between signals at adjacent stations, yielded\na smaller scale size (70–90 km) than the FWHM measure-\nments (∼400 km). This may reflect the effects of spatial\nintegration on the magnetometer signal (Poulter and Allan,\n1985). The estimated damping factor of 0.3 points to the ex-\nistence of damping mechanisms other than Joule dissipation\n(Yeoman et al., 1997).\nSolar wind pressure pulses of the magnitude observed here\nare believed to be fairly common (Sibeck, 1990). Ground-\nbased observations associate them with ringing type mag-\nnetic pulsations with periods of a few minutes (Takahashi et\nal., 1988; Farrugia et al., 1989; Sibeck, 1990), including field\nline resonances (Potemra et al., 1989; Warnecke et al., 1990;\nParkhomov et al., 1998; Prikryl et al., 1998).\nExamining a large magnetospheric compression event,\nTakahashi et al. (1988) found\n(i) 1.1–1.7 mHz compressional waves which could have\nbeen due to a global fast-mode cavity resonance,\n(ii) standing 3–6 mHz Alfve´n waves (i.e. FLRs), and\n(iii) 3–8 mHz irregular disturbances near the magnetopause.\nThe magnetopause and bow shock also seemed to execute\n1.1–1.7 mHz motions. Potemra et al. (1989) also found that\nquasi-periodic variations in the solar wind density may drive\ntransient magnetospheric ULF waves at the same frequency.\nThese may excite local FLRs. Takahashi et al. (1988) be-\nlieved the frequency of the 1.1–1.7 mHz compressional wave\nwas too low to couple to standing Alfve´n waves. How-\never, Mathie et al. (1999 a, b) demonstrated the existence of\n1.7 mHz field line resonances at high-latitudes, and discussed\ntheir origin in terms of magnetospheric waveguide modes.\nFarrugia et al. (1989) have shown that magnetic oscilla-\ntions may be observed over a wide range of latitudes and\nlongitudes with the same frequency as magnetopause mo-\ntions. The meridional motion of the signals across the ground\ncorresponds to tailward propagation in the magnetosphere,\nat ∼11 km s−1. Sibeck (1990) presented a detailed descrip-\ntion of this process. Significantly, large amplitude solar wind\ndynamic pressure impulses, recurring on time scales of 5–\n15 min, are a fairly common feature just upstream of the bow\nshock. The ground signatures of these pressure pulses in-\nclude bipolar north-south flows and magnetic perturbations\nat high-latitude stations. This is very similar to what we have\nseen for the event studied here. For example, a prominent\nfeature of Fig. 3 is the two velocity features in the Finland\nradar, associated with north-south flows in the cusp and F-\nregion Doppler oscillations at lower latitudes, triggered by\nthe solar wind pressure pulses at 09:30 UT. Similarly, the\npresence of bipolar magnetometer pulses evident in Fig. 6b\nagrees with the response to sudden expansions predicted by\nAraki and Nagano (1988).\nSibeck (1990) predicted the appearance of increased cos-\nmic noise absorption and ELF\/VLF activity accompanying\nsudden sharp increases in solar wind dynamic pressure. The\nKilpisja¨rvi riometer data showed a sudden increase in ab-\nsorption near 09:20 UT (“A” in Fig. 8), consistent with the\nprecipitation of a particle burst associated with an FTE. This\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 573\nwas followed by a decrease in absorption while the solar\nwind pressure was decreasing. This is also reasonable, since\nthe resultant sudden magnetospheric expansion (rather than\na compression, as discussed by Sibeck) would distribute\nthe population of energetic electrons over a larger volume,\nthereby decreasing the flux at the ground. The reason for\nthe observed enhancement in absorption while the solar wind\npressure was at its minimum is not clear.\nParkhomov et al. (1998) examined geomagnetic pulsations\nassociated with a negative solar wind pressure pulse (by a\nfactor of ∼3) and found this initiated 2.3 mHz oscillations\nacross a wide range of latitudes, lasting for about 25 min.\nThese appeared to couple to a 3 mHz FLR, which they argued\nwas the minimum resonance frequency available to incom-\ning 2.3 mHz fast mode waves. They interpreted the 2.3 mHz\npulsations in terms of relaxation oscillations of the magne-\ntopause in response to the negative pressure impulse. Their\nwork paralleled an earlier study by Warnecke et al. (1990),\nwho examined large, long-lived Pc5 FLRs associated with\na sudden reduction and subsequent variations in solar wind\ndynamic pressure. The pulsations were most likely driven\nby antisunward propagating fast mode hydromagnetic waves,\nwhich they concluded were due to both magnetopause sur-\nface waves and ∼1.7 mHz cavity resonances.\nIn many respects our own observations agree with the re-\nsults of those previous studies. A striking feature of our re-\nsults is the similarity of the pulsations across a wide range of\nlatitudes. Power spectra for several intervals during the day\nshow similar characteristics, with the dominant frequency in\nthe same range as the fluctuations in solar wind pressure and\nIMF. Therefore it seems likely that solar wind perturbations\ndrive fast mode waves into the magnetosphere, which mode\nconvert to transverse Alfve´n resonances where the frequen-\ncies match, and propagate direct to the ionosphere elsewhere.\nThere the waves drive electron motions causing Doppler shift\noscillations, resulting in the appearance of perturbations in\nHF radar ground scatter records and HF Doppler experi-\nments.\nOur results should also be compared with the study by\nMatthews et al. (1996) of the response to a strong, sharp in-\ncrease in dynamic solar wind pressure observed with the Hal-\nley HF radar and magnetometer arrays. The pulse initiated\n3.3 mHz pulsations seen over ∼10◦ in latitude and with the\ncharacteristics of a FLR near 75◦ latitude, in the cusp. Their\nradar measurements yielded an m number of ∼10, toward\nthe nightside. The pulsations lasted for a few hours, being\nstimulated by further pressure transients. The pressure pulse\ncaused a sudden equatorward movement of the Halley radar\nbackscatter pattern, followed by strong, quasi-periodic pole-\nward moving features anticorrelated with the magnetometer\nD component pulsations. Matthews et al. (1996) discussed\ntheir observations in terms of magnetopause surface waves\ntriggered by the solar wind impulses. Part of the reason they\nfavoured this mechanism is because the 3.3 mHz pulsations\nhad the largest response at the magnetopause, the m num-\nber was reasonably high (m ∼10), and the resonance prop-\nerties were weak. In our case the m numbers are lower, the\nresonance is fairly clear and occurs at least 2◦ in latitude,\ninward of the magnetopause, equatorward of the reconnec-\ntion related flows observed by the Finland radar. The solar\nwind pressure in our case is∼2 nPa after the pressure change,\nwhile for Matthews et al. (1996) it was ∼16–23 nPa. There-\nfore, we do not believe our pulsation observations are due to\nmagnetopause surface modes.\nYeoman et al. (1990b) discussed the radar signature of\nfast mode waves compared to Alfve´nic waves incident on\nthe ionosphere. The fast mode waves, having no parallel\ncurrent, are associated with only small ionospheric electric\nfields and hence low Doppler velocities. This is consistent\nwith our observations. Yeoman et al. (1990b) also found that\nthe more “compressive” the wave, the higher the m number\n(e.g. ∼12 compared to m ∼2 for Alfve´nic waves). In our\ncase, the azimuthal wave numbers measured using the IM-\nAGE array 8–10◦ equatorward of the resonance ranged from\n−8 to +1, changing with local time. The radar observations\nare also several degrees equatorward of the resonance and re-\nlate to wave numbers of the order of −2 to −5. These values\nare intermediate and do not rule against the fast mode wave\nmechanism.\n5 Summary and conclusions\nThe results of this study may be summarized as follows:\n1. Small Doppler velocity oscillations with frequency\naround 1.6–1.7 mHz were observed in F-region ground\nscatter returns on the Finland and Iceland East Super-\nDARN radars on 23 February 1996. These observa-\ntions demonstrate the use of ground scatter to extend\nthe capability and resolution of HF radars. While HF\nradar ground scatter is characterised by narrow spectral\nwidth and small Doppler velocity, the ULF wave elec-\ntric field in the ionosphere modulates the HF ray reflec-\ntion height, and this modulation results in a small mea-\nsurable Doppler velocity being imposed on the ground\nscatter. This provides new, additional information on\nthe ULF wave field.\n2. The observed oscillations were initiated by a negative\nsolar wind pressure pulse and persisted for some hours,\nbeing observed over ∼25◦ in longitude. The solar wind\npressure exhibited fluctuations with a similar frequency\nduring this time.\n3. At longer ranges, above 74◦, the Finland radar detected\nperiodic high velocity poleward flow bursts. These were\ninitiated by Bz turning negative, about 10 min before the\nsolar wind pulse, and possibly sustained throughout the\nobservation period by IMF conditions conducive to re-\nconnection. The flow bursts lasted for some hours and\nhave the appearance of PIFs that are the ionospheric sig-\nnature of FTEs.\n4. The spatial variation in phase of the low velocity\nDoppler oscillations is consistent with magnetic pulsa-\n574 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\ntions of azimuthal wave number m = −2 to −5 ob-\nserved equatorward of a field line resonance.\n5. An HF Doppler sounder beneath the radar beams simul-\ntaneously recorded Doppler shift oscillations just below\nthe F2-layer peak with similar frequency and phase to\nthose observed with the radars.\n6. Velocity vectors for the Doppler oscillations suggest up-\nper limits of ±10 m s−1 horizontally, and ±30 m s−1\nvertically, corresponding to equivalent motions of the\nreflection point of a few km.\n7. Magnetic pulsations with frequency 1.6–1.7 mHz were\nrecorded across the IMAGE and SAMNET arrays. They\nwere initiated by the solar wind pressure decrease and\nwere coupled to field line resonances ∼72–73◦ mag-\nnetic latitude. Scale size of the resonance was esti-\nmated at 70–90 km in the ionosphere and ∼400 km at\nthe ground. Azimuthal wave number, well equatorward\nof the resonance, ranged from −8 before local noon\nto around 0 at noon. The pulsations lasted for a few\nhours, had the same waveform across at least 20◦ in lat-\nitude, and a similar frequency to perturbations in the\nsolar wind pressure and IMF Bx and By components.\n8. A southward Bz turning caused a magnetometer pulse\n∼74◦ latitude, that propagated to lower and higher lat-\nitudes at ∼1.5 km s−1. This was followed by 8 mHz\nFLRs ∼66◦ latitude.\n9. The decreasing solar wind pressure was associated with\na reduction in cosmic noise absorption at the Kilpisja¨rvi\nriometer. This is most likely a consequence of the mag-\nnetospheric expansion.\n10. We conclude that a negative impulse in the solar wind\ndynamic pressure launched fast-mode compressional\nwaves into the magnetosphere. Ground signatures in-\ncluded a bipolar magnetometer pulse, low velocity per-\nturbations of the ionospheric plasma (observed in radar\nground scatter), and Pc5 magnetic pulsations over a\nwide spatial extent. The fast mode waves coupled to\nfield line resonances near 72◦ magnetic latitude. The\nground scatter and magnetic oscillations persisted for\nsome hours and were probably stimulated by further\nsmaller amplitude perturbations in the solar wind pres-\nsure or IMF. A negative turning of the north-south com-\nponent of the IMF about 10 min before the pressure\npulse probably triggered magnetic reconnection and\nFTEs. The latter may be presumed to have continued\nthroughout the data interval as the IMF was conducive\nto dayside reconnection, resulting in large velocity pole-\nward flows in the auroral ionosphere.\nAcknowledgements. CUTLASS is supported by the Particle\nPhysics and Astronomy Research Council (PPARC), UK, the\nSwedish Institute for Space Physics, Uppsala, and the Finnish Me-\nteorological Institute (FMI), Helsinki. We thank D. K. Milling and\nI. R. Mann for providing the SAMNET data. SAMNET is a PPARC\nfacility deployed and operated by the University of York. We also\nthank Lasse Hakkinen at FMI for the supply of IMAGE data, and all\nthose who help maintain the array. WIND data were made available\nto the CDAWeb site by K. Ogilvie (SWE) and R. Lepping (MFI)\nat NASA\/GSFC. IRIS is operated by the Department of Communi-\ncations Systems at Lancaster University (UK), funded by PPARC\nin collaboration with the Sodankyla¨ Geophysical Observatory. We\nare grateful to A. Rodger and M. Pinnock for helpful discussions.\nFWM received support from a PPARC Visiting Fellowship during\nthis study.\nTopical Editor G. Chanteur thanks two referees for their help in\nevalutating this paper.\nReferences\nAbles, S. T., Fraser, B. J. Waters, C. L., and Neudegg, D. A.: Moni-\ntoring cusp\/cleft topology using Pc5 ULF waves, Geophys. Res.\nLett., 25, 1507–1510, 1998.\nAraki, T. and Nagano, H.: Geomagnetic response to sudden expan-\nsions of the magnetosphere, J. Geophys. Res., 93, 3983–3988,\n1988.\nBaker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M.,\nNewell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HF\nradar signatures of the cusp and low-latitude boundary layer, J.\nGeophys. Res., 100, 7671–7695, 1995.\nBeamish, D., Hanson, H. W., and Webb, D. C.: Complex demod-\nulation applied to Pi2 geomagnetic pulsations, Geophys. J. R.\nAstron. Soc., 58, 471–493, 1979.\nBlagoveshchenskaya, N. F., Kornienko, V. A., Petlenko, A. V.,\nBrekke, A., and Rietveld, M. T.: Geophysical phenomena dur-\ning an ionospheric modification experiment at Tromsø, Norway,\nAnn. Geophysicae, 16, 1212–1225, 1998.\nBrowne, S., Hargreaves, J. K., and Honary, B.: An imaging riometer\nfor ionospheric studies, J. Elec. Comms. Eng., 7, 209–217, 1995.\nCahill, L., Greenwald, R. A., and Nielsen, E.: Auroral and rocket\ndouble-probe observations of the electric field across the Harang\ndiscontinuity, Geophys. Res. Lett., 5, 687–690, 1978.\nChaston, C. C., Hansen, H. J., Menk, F. W., Fraser, B. J., and Hu,\nY. D.: Ground signatures of convecting reconnecting flux tubes,\nJ. Geophys. Res., 98, 19 151–19 161, 1993.\nChisham, G. and Mann, I. R.: A Pc5 ULF wave with large azimuthal\nwavenumber observed within the morning sector plasmasphere\nby SAMNET, J. Geophys. Res., 104, 14 717–14 727, 1999.\nDettrick, D. L. and Rosenberg, T. J.: A phased-array radiowave\nimager for studies of cosmic noise absorption, Radio Sci., 25,\n325–338, 1990.\nFarrugia, C. J., Freeman, M. P., Cowley, S. W. H., Southwood,\nD. J., Lockwood, M., and Etemadi, A.: Pressure-driven mag-\nnetopause motions and attendant response on the ground, Planet.\nSpace Sci., 37, 589–607, 1989.\nFejer, B. G. and Kelley, M. C.: Ionospheric irregularities, Rev. Geo-\nphys., 18, 401–454, 1980.\nGreenwald, R. A., Baker, K. B., Hutchins, R. A., and Hanuise, C.:\nAn HF phased-array radar for studying small-scale structure in\nthe high-latitude ionosphere, Radio Sci., 20, 63, 1985.\nGreenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M.,\nJones, T. B., Thomas, E. C., Villain, J.-P., Cerisier, J.-C., Se-\nnior, C., Hanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J.,\nNielsen, E., Pellinan, R., Walker, A. D. M., Sato, N., and Yamag-\nF. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations 575\nishi, H.: DARN\/SuperDARN: a global view of the dynamics of\nhigh-altitude convection, Space Sci. Rev., 71, 761–796, 1995.\nHardy, D. A., Schmitt, L. K., Gussenhoven, M. S., Marshall, F. J.,\nYeh, H. C., Schumaker, T. L., Hube, A., and Pantazis, J.: Precip-\nitating electron and ion detectors (SSJ\/4) for the block 5D\/flights\n6–10 DMSP satellites: Calibration and data presentation, Rep.\nAFGL-TR-84-0317, Air Force Geophys. Lab., Hanscom Air\nForce Base, Mass., 1985.\nHasegawa, A., Tsui, K. H., and Assis, A. S.: A theory of long period\nmagnetic pulsations, 3, Local field line oscillations, Geophys.\nRes. Lett., 10, 765–768, 1983.\nKivelson, M. G. and Southwood, D. J.: Hydromagnetic waves and\nthe ionosphere, Geophys. Res. Lett., 15, 1271–1274, 1988.\nLemaire, J.: Impulsive penetration of filamentary plasma elements\ninto the magnetosphere of the Earth and Jupiter, Planet. Space\nSci., 25, 887–890, 1977.\nLepping, R. P., Acuna, M., Burlaga, L., Farrell, W., Slavin, J.,\nSchatten, K., Mariani, F., Ness, N., Neubauer, F., Whang, Y. C.,\nByrnes, J., Kennon, R., Panetta, P., Scheifele, J., and Worley, E.:\nThe WIND Magnetic Field Investigation, Space Sci. Rev., 71,\n207–229, 1995.\nLiu, A. T. Y. and Sibeck, D. G.: Dayside auroral activities and their\nimplications for impulsive entry processes in the dayside magne-\ntosphere, J. Atmos. Terr. Phys., 53, 219–229, 1991.\nLockwood, M., Sandholt, P. E., Cowley, S. W. H., and Oguti, T.:\nInterplanetary magnetic field control of dayside auroral activity\nand the transfer of momentum across the dayside magnetopause,\nPlanet. Space Sci., 37, 1347–1365, 1989.\nLu¨hr, H.: The IMAGE magnetometer network, STEP Int. Newsl.,\n4, 4–6, 1994.\nLu¨hr, H., Aylward, A., Bucher, S. C., Pajunpa¨a¨, A., Pajunpa¨a¨, K.,\nHolmbee, T., and Zalewski, S. M.: Westward moving dynamic\nsubstorm features observed with the IMAGE magnetometer net-\nwork and other ground-based instruments, Ann. Geophysicae,\n16, 425–440, 1998.\nMathie, R. A., Mann, I. R., Menk, F. W., and Orr, D.: Pc5 ULF\npulsations associated with waveguide modes observed with the\nIMAGE magnetometer array, J. Geophys. Res., 104, 7025–7036,\n1999a.\nMathie, R. A., Menk, F. W., Mann, I. R., and Orr, D.: Discrete field\nline resonances and the Alfve´n continuum in the outer magneto-\nsphere, Geophys. Res. Lett., 26, 659–662, 1999b.\nMatthews, D. L., Ruohoniemi, J. M., Dudeney, J. R., Farrugia,\nC. F., Lanzerotti, L. J., and Friis-Christensen, E.: Conjugate\ncusp-region ULF pulsation responses to the solar wind event of\nMay 23, 1989, J. Geophys. Res., 101, 7829–7841, 1996.\nMcWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical\nsurvey of dayside pulsed ionospheric flows as seen by the CUT-\nLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.\nMcWilliams, K. A., Yeoman, T. K., and Cowley, S. W. H.: Two-\ndimensional electric field measurements in the ionospheric sig-\nnature of a flux transfer event, Ann. Geophysicae, 18, 1584–\n1598, 2001.\nMenk, F. W., Orr, D., Clilverd, M. A., Smith, A. J., Waters, C. L.,\nand Fraser, B. J.: Monitoring spatial and temporal variations\nin the dayside plasmasphere using geomagnetic field line reso-\nnances, J. Geophys. Res., 104, 19 955–19 970, 1999.\nMenk, F. W., Yeoman, T. K., Wright, D., and Lester, M.: Coordi-\nnated observations of forced and resonant field line observations\nat high-latitudes, ANARE Res. Rpts., 146, 383–404, 2001.\nMilan, S. E., Jones, T. B., Robinson, T. R., Thomas, E. C., and\nYeoman, T. K.: Interferometric evidence for the observation of\nground backscatter originating behind the CUTLASS coherent\nHF radars, Ann. Geophysicae, 15, 29–39, 1997a.\nMilan, S. E., Yeoman, T. K., and Lester, M.: Initial backscatter\noccurrence statistics from the CUTLASS HF radars, Ann. Geo-\nphysicae, 15, 703–718, 1997b.\nMilan, S. E., Yeoman, T. K., and Lester, M.: The dayside auroral\nzone as a hard target for coherent HF radars, Geophys. Res.Lett.,\n25, 3717–3720, 1998.\nNeudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G.,\nHaerendel, G., Baumjohann, W., Auster, U., Fornacon, K.-H.,\nGeorgescu, E., and Owen, C. J.: A flux transfer event observed\nat the magnetopause by the Equator-S spacecraft and in the iono-\nsphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707–\n711, 1999.\nNewell, P. T. and Meng, C.-I.: The cusp and cleft\/boundary layer:\nLow-altitude identifications and statistical local time variation, J.\nGeophys. Res., 93, 14 549–14 556, 1988.\nNewell, P. T., Meng, C.-I., Sibeck, D. G., and Lepping, R.: Some\nlow altitude cusp dependencies on the interplanetary magnetic\nfield, J. Geophys. Res., 94, 8921–8927, 1989.\nNewell, P. T., Wing, S., Meng, C.-I., and Sigilleto, V.: The auroral\noval position, structure, and intensity of precipitation from 1984\nonwards: An automated online data base, J. Geophys. Res., 96,\n5877–5882, 1991.\nNewell, P. T. and Meng, C.-I.: Mapping the dayside ionosphere to\nthe magnetosphere according to particle precipitation character-\nistics, Geophys. Res. Lett., 19, 609–612, 1992.\nØieroset, M., Sandholt, P. E., Luhr, H., Denig, W. F., and Moretto,\nT.: Auroral and geomagnetic events at cusp\/mantle latitudes in\nthe prenoon sector during positive IMF By conditions: Signa-\ntures of pulsed magnetopause reconnection, J. Geophys. Res.,\n102, 7191–7205, 1997.\nOgilvie, K. W., Chorney, D. J., Fitzenreiter, R. J., Hunsaker, F.,\nKeller, J., Lobell, J., Miller, G., Scudder, J. D., Sittler Jr., E. C.,\nTorbert, R. B., Bodet, D., Needell, G., Lazarus, A. J., Steinberg,\nJ. T., Tappan, J. H., Mavretic, A., and Gergin, E.: SWE, a com-\nprehensive plasma instrument for the Wind spacecraft, Space Sci.\nRev, 71, 55–77, 1995.\nParkhomov, V. A., Mishin, V. V., and Borovik, L. V.: Long-period\ngoemagnetic pulsations caused by the solar wind negative pres-\nsure impulse on 22 March 1979 (CDAW-6), Ann. Geophysicae,\n16, 134–139, 1998.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Greenwald, R. A.,\nBaker, K. B., and Ruohoniemi, J. M.: An ionospheric signature\nof possible enhanced magnetic field merging on the dayside mag-\nnetopause, J. Atmos. Terr. Phys., 53, 201–212, 1991.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Baker, K. B., Newell,\nP. T., Greenwald, R. A., and Greenspan, M. E.: Observations of\nan enhanced convection channel in the cusp ionosphere, J. Geo-\nphys. Res., 98, 3767–3776, 1993.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker, K.:\nHigh spatial and temporal resolution observations of the iono-\nspheric cusps, Ann. Geophysicae, 13, 919–925, 1995.\nPoole, A. W. V., Sutcliffe, P. R., and Walker, A. D. M.: The rela-\ntionship between ULF geomagnetic pulsations and ionospheric\nDoppler oscillations: derivation of a model, J. Geophys. Res.,\n93, 14 656–14 664, 1988.\nPotemra, T. A., Lu¨hr, H., Zanetti, L. J., Takahashi, K., Erlandson,\nR. E., Marklund, G. T., Block, L. P., Blomberg, L. G., and Lep-\nping, R. P.: Multisatellite and ground-based observations of tran-\nsient ULF waves, J. Geophys. Res., 94, 2543–2554, 1989.\nPoulter, E. M. and Allan, W.: Transient ULF pulsation decay rates\n576 F. W. Menk at al.: High-latitude observations of impulse-driven ULF pulsations\nobserved by ground based magnetometers: the contribution of\nspatial integration, Planet. Space Sci., 33, 607–616, 1985.\nPrikryl, P., Greenwald, R. A., Sofko, G. J., Villain, J. P., Ziesolleck,\nC. W. S., and Friis-Christensen, E.: Solar-wind-driven pulsed\nmagnetic reconnection at the dayside magnetopause, Pc5 com-\npressional oscillations, and field line resonances, J. Geophys.\nRes., 103, 17 307–17 322, 1998.\nProvan, G., Yeoman, T. K., and Milan, S. E.: CUTLASS Finland\nradar observations of the ionospheric signatures of flux transfer\nevents and the resulting plasma flows, Ann. Geophysicae, 16,\n1411–1422, 1998.\nProvan, G. and Yeoman, T. K.: Statistical observations of the MLT,\nlatitude and size of pulsed ionospheric flows with the CUTLASS\nFinland radar, Ann. Geophysicae, 17, 855–867, 1999.\nPu, Z.-Y. and Kivelson, M. G.: Kelvin-Helmholtz instability at the\nmagnetopause: solutions for compressible plasmas, J. Geophys.\nRes., 88, 841–852, 1983.\nRisbeth, H. and Garriott, O. K.: Relationship between simultaneous\ngeomagnetic and ionospheric oscillations, Radio Sci., 68D, 339–\n343, 1964.\nRodger, A. and Pinnock, M.: The ionospheric response to flux trans-\nfer events: the first few minutes, Ann. Geophysicae, 15, 685–\n691, 1997.\nRussell, C. T. and Elphic, R. C.: ISEE observations of flux transfer\nevents at the dayside magnetopause, Geophys. Res. Lett., 6, 33–\n36, 1979.\nSaunders, M. A., Russell, C. T. , and Sckopke, N.: Flux transfer\nevents: scale size and interior structure, Geophys. Res. Lett., 11,\n131–134, 1984.\nSedgemore, K. J. F., Williams, P. J. S., Jones, G. O. L. , and Wright,\nJ. W.: A comparison of EISCAT and Dynasonde measurements\nof the auroral ionosphere, Ann. Geophysicae, 14, 1403–1412,\n1996.\nSibeck, D. G.: A model for the transient magnetospheric response to\nsudden solar wind dynamic pressure perturbations, J. Geophys.\nRes., 95, 3755–3771, 1990.\nSouthwood, D. J.: The ionospheric signature of flux transfer events,\nJ. Geophys. Res., 92, 3207–3213, 1987.\nSutcliffe, P. R. and Poole, A. W. V.: Ionospheric Doppler and elec-\ntron velocities in the presence of ULF waves, J. Geophys. Res.,\n94, 13 505–13 514, 1989.\nTakahashi, K., Kistler, L. M., Potemra, T. A., McEntire, R. W.,\nand Zanetti, L. J.: Magnetospheric ULF waves observed during\nthe major magnetospheric compression of November 1, 1984, J.\nGeophys. Res., 93, 14 369–14 382, 1988.\nTsunoda, R. T.: High-latitude F-region irregularities: a review and\nsynthesis, Rev. Geophys., 26, 719–760, 1988.\nVillain, J. P., Caudal, G., and Hanuise, C.: A Safari-Eiscat compar-\nison between the velocity of F region small-scale irregularities\nand the ion drift, J. Geophys. Res., 90, 8433–8443, 1985.\nWalker, A. D. M., Greenwald, R. A., Stuart, W. F., and Green, C. A.:\nSTARE auroral radar observations of Pc5 geomagnetic pulsa-\ntions, J. Geophys. Res., 84, 3373–3388, 1979.\nWarnecke, J., Lu¨hr, H., and Takahashi, K.: Observational features\nof field line resonances excited by solar wind pressure variations\non 4 September 1984, Planet. Space Sci., 38, 1517–1531, 1990.\nWaters, C. L., Samson, J. C., and Donovan, E. F.: The temporal\nvariation of the frequency of high-latitude field line resonances,\nJ. Geophys. Res., 100, 7987–7996, 1995.\nWaters, C. L., Sciffer, M., Dunlop, I. S., and Menk, F. W.: HF\nDoppler oscillations due to mixed ULF wave modes, ANARE\nRes. Rpts., 146, 369–382, 2001.\nWild, J. A., Cowley, S. W. H., Davies, J. A., Kahn, H., Lester, M.,\nMilan, S. E.,Provan, G. , Yeoman, T. K., Balogh, A., Dunlop,\nM. W., Fornac¸on, K.-H., and Georgescu, E.: First simultaneous\nobservations of flux transfer events at the high-latitude magne-\ntopause by the Cluster spacecraft and pulsed radar signatures in\nthe conjugate ionosphere by the CUTLASS and EISCAT radars,\nAnn. Geophysicae, 19, 1491–1508, 2001.\nWright, D. M., Yeoman, T. K., and Chapman, P. J.: High-latitude\nHF Doppler observations of ULF waves. 1. Waves with large spa-\ntial scale sizes, Ann. Geophysicae, 15, 1548–1556, 1997.\nWright, D. M., Yeoman, T. K., and Davies, J. A.: A comparison\nof EISCAT and HF Doppler observations of a ULF wave event,\nAnn. Geophysicae, 16, 1190–1199, 1998.\nYeoman, T. K. and Lester, M. E.: Characteristics of MHD waves\nassociated with storm sudden commencements observed by\nSABRE and ground magnetometers, Planet. Space Sci., 38, 603–\n616, 1990.\nYeoman, T. K., Milling, D. K., and Orr, D.: Pi2 polarization patterns\non the U.K. Sub-Auroral Magnetometer Network (SAMNET),\nPlanet. Space Sci., 38, 589–602, 1990a.\nYeoman, T. K., Lester, M., Orr, D., and Lu¨hr, H.: Ionospheric\nboundary conditions of hydromagnetic waves: the dependence\non azimuthal wave number and a case study, Planet. Space Sci.,\n38, 1315–1325, 1990b.\nYeoman, T. K., Wright, D. M., Robinson, T. R., Davies, J. A., and\nRietveld, M.: High spatial and temporal resolution observations\nof an impulse-driven field line resonance in radar backscatter\ndata artificially generated with the Tromsø heater, Ann. Geo-\nphysicae, 16, 634–644, 1997.\n"}