{"doi":"10.1093\/biomet","coreId":"71480","oai":"oai:eprints.lancs.ac.uk:865","identifiers":["oai:eprints.lancs.ac.uk:865","10.1093\/biomet"],"title":"On the alignment of multiple time series fragments.","authors":["Mukherjee, Kanchan","Shumway, Robert","Verosub, Kenneth"],"enrichments":{"references":[{"id":16350162,"title":"An approach to time series smoothing and forecasting using the EM algorithm.","authors":[],"date":"1982","doi":"10.1111\/j.1467-9892.1982.tb00349.x","raw":"Shumway, R. H. & Sto®er, D. S. (1982). An approach to time series smoothing and forecasting using the EM algorithm. J. Time Ser. Anal. 3, 253-64.","cites":null},{"id":16350158,"title":"Martingale Limit Theory and its Application.","authors":[],"date":"1980","doi":"10.2307\/2287147","raw":"Hall P. & Heyde, C. C. (1980). Martingale Limit Theory and its Application. New York: Academic Press.","cites":null},{"id":16350170,"title":"Paleomagnetism of varved sediments from western New England: Secular variation.","authors":[],"date":"1979","doi":"10.1029\/gl006i004p00245","raw":"Verosub, K. L. (1979b). Paleomagnetism of varved sediments from western New England: Secular variation. Geophys. Res. Lett. 6, 244-8. 160 100 200 300 400 500 600 700 800 900 1000 Conn. Mass1 Mass2 Broadbrook year l o g t h i c k n e s s 440 460 480 500 520 540 560 580 600 620 640 Conn. Mass1","cites":null},{"id":16350167,"title":"Paleomagnetism of varved sediments from western New England: Variability of the paleomagnetic recorder.","authors":[],"date":"1979","doi":"10.1029\/gl006i004p00241","raw":"Verosub, K. L. (1979a). Paleomagnetism of varved sediments from western New England: Variability of the paleomagnetic recorder. Geophys. Res. Lett. 6, 241-4.","cites":null},{"id":16350160,"title":"Re-evaluation of Antev's New England varve chronology and new radiocarbon dates of sediments from glacial Lake Hitchcock.","authors":[],"date":"1990","doi":"10.1130\/0016-7606(1990)102<0889:reoane>2.3.co;2","raw":"Ridge, J. C. & Larson, F. D. (1990). Re-evaluation of Antev's New England varve chronology and new radiocarbon dates of sediments from glacial Lake Hitchcock. Bull. Geol. Soc. Am. 102, 889-99.","cites":null},{"id":16350154,"title":"The recession of the last ice sheet in New England.","authors":[],"date":"1928","doi":"10.5962\/bhl.title.61917","raw":"Antevs, E. (1928). The recession of the last ice sheet in New England. Am. Geog. Soc. Res. Ser. 17, 297pp.","cites":null},{"id":16350164,"title":"Time Series Analysis and Its Applications.","authors":[],"date":"2000","doi":"10.1007\/978-1-4757-3261-0","raw":"Shumway, R. H. & Sto®er, D. S. (2000). Time Series Analysis and Its Applications. New York: Springer-Verlag.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-23","abstract":"We consider a local least-squares criterion for aligning multiple time series fragments differing by locations and show the consistency of the time-lag estimator and the asymptotic normality of the location estimator. We apply the criterion to the problem of aligning 50 glacial varve fragments and construct a 3000-year surrogate for global temperature","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71480.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/865\/2\/FinalRevbiometrika.pdf","pdfHashValue":"ed6e96f46088b230ebd78fef7ead7d379ba03d4e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:865<\/identifier><datestamp>\n      2018-01-24T03:17:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On the alignment of multiple time series fragments.<\/dc:title><dc:creator>\n        Mukherjee, Kanchan<\/dc:creator><dc:creator>\n        Shumway, Robert<\/dc:creator><dc:creator>\n        Verosub, Kenneth<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        We consider a local least-squares criterion for aligning multiple time series fragments differing by locations and show the consistency of the time-lag estimator and the asymptotic normality of the location estimator. We apply the criterion to the problem of aligning 50 glacial varve fragments and construct a 3000-year surrogate for global temperature.<\/dc:description><dc:date>\n        2007-05-23<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/865\/2\/FinalRevbiometrika.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1093\/biomet\/asm023<\/dc:relation><dc:identifier>\n        Mukherjee, Kanchan and Shumway, Robert and Verosub, Kenneth (2007) On the alignment of multiple time series fragments. Biometrika, 94 (2). pp. 347-358. ISSN 1464-3510<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/865\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1093\/biomet\/asm023","http:\/\/eprints.lancs.ac.uk\/865\/"],"year":2007,"topics":["QA Mathematics"],"subject":["Journal Article","PeerReviewed"],"fullText":"August 21, 2006\nOn the alignment of multiple time series fragments\nBY KANCHAN MUKHERJEE\nDepartment of Mathematical Sciences, The University of Liverpool,\nLiverpool L69 7ZL, U.K.\nk.mukherjee@liverpool.ac.uk\nROBERT H. SHUMWAY\nDepartment of Statistics, University of California, Davis, California 95616 U.S.A.\nrhshumway@ucdavis.edu\nAND KENNETH L. VEROSUB\nDepartment of Geology, University of California, Davis, California 95616 U.S.A.\nklverosub@ucdavis.edu\nSUMMARY\nWe consider a local least-squares criterion for aligning multiple time series fragments differing\nby locations and show the consistency of the time-lag estimator and the asymptotic normality\nof the location estimator. We apply the criterion to the problem of aligning 50 glacial varve\nfragments and construct a 3000-year surrogate for global temperature.\nSome key words: Aligning time series; Asymptotics; Global warming; Lag estimator;\nLocal least-squares; Varve chronology.\n1\n1. INTRODUCTION\nThe current debate over the possible human induced contributions to rising global temper-\nature values has underscored the need to understand historical climatic variability. Con-\nsequently, there have been attempts to obtain surrogates for temperature that extend over\nlonger intervals of time than current global temperature records that generally go back about\n150 years. These temperatures have risen steeply over the last 25 years and there is a sub-\nstantial rise of about one degree Centigrade over the past 100 years.\nIn order to obtain longer records from a wider array of phenomena with a broader geo-\ngraphic distribution, it is necessary to turn to biological recorders, such as tree-rings and coral\ngrowth bands, and geological recorders, such as glacial varves. Glacial varves are laminated\nsediments that record annual depositional cycles in certain lakes that are fed by glaciers. The\nthickness of each layer represents the amount of silt and sand deposited by a melting glacier\nover a period of one year. In this sense, changes in varve thickness are an indication of yearly\ntemperature changes. Therefore, reconstruction of a record of such thickness changes, known\nas a varve chronology, can be useful as a potential long-term proxy for paleoclimate.\nAs a result of the vagaries of geological depositional and erosional processes, an entire\nglacial varve sequence is seldom found at any particular site and the complete varve chronol-\nogy must be pieced together from different outcrops or drill cores. Figure 1 shows some of the\nlog-transformed varve thickness series collected from sites in Connecticut and Massachussets\nby Antevs (1922, 1928) and Verosub (1979a, 1979b). The Connecticut series, labeled Conn.\nin Fig. 1(a), is a master series of length 871 years, that started at 15,600 years before present\n(BP), as determined by carbon dating, according to Ridge & Larson (1990). The notation\n15,600 years BP means approximately that many years before 1990. The Broadbrook series\nis an individual site and represents those collected by Verosub. There are a total of 50 series\nin the database, 12 from the Antevs paper tapes collected from Connecticut, Massachussets,\n2\nNew Hampshire, New York and Vermont and 28 series collected from the same states by\nVerosub. The series lengths ranged from short series with only 25 years to the 871-year\nmaster Connecticut series. The total time span represented by all series, taken as a whole,\nis 3000 years, and this is the length of the signal that we would like to construct by aligning\nthese 50 time series fragments.\nINSERT Fig. 1 HERE\n2. LAG ESTIMATION FOR TIME SERIES FRAGMENTS\nSuppose {Xt, Yt}t≥1 is a stationary ergodic time series. Consider the following model where\none observes {Yt; 1 ≤ t ≤ n} and {Xt; 1 ≤ t ≤ nX}, nX ≥ n, satisfying\nYt = β +Xt+J + ²t, 1 ≤ t ≤ n, (1)\nwhere β is the unknown location parameter and J , with 0 ≤ J <∞, is the unknown lag. It\nis assumed that J ≤ nX − n. We wish to estimate β and J . We assume that {²t; 1 ≤ t ≤ n}\nare independent and identically distributed with zero mean and finite variance σ2 and that\n{²t; 1 ≤ t ≤ n} are independent of {Xt; 1 ≤ t ≤ nX}. Typically, {Xt; 1 ≤ t ≤ nX} are taken\nas the observations of the master series whereas {Yt; 1 ≤ t ≤ n} is the series to be aligned.\nThe simplified linear model in (1) is motivated by Fig. 1, which shows that the logarithms\nof the series are dominated by fixed differences, with no apparent scale changes. Although\ngeneral correlation methods based on the usual linear regression model and various nonlinear\nmetrics can improve upon the above model in certain cases, as shown in a University of Bergen\ntechnical report by B. Auestad, D. Tjostheim, R. Shumway and K. Verosub, we concentrate\non the simple model here in the development of asymptotics. Note that, for stationarity, we\nwill generally be dealing with increments log Vt− log Vt−1 = log(Vt\/Vt−1) of the original varve\nseries Vt.\n3\nAlignment problems occur because the sequences may only match near the beginning or\nend of the master series or because varve sequences will sometimes have extra or missing\nvalues, called insertions and deletions. This difficulty is compounded by the need to consider\na large number of fragments with unknown time delays. R. H. Shumway and K. L. Verosub,\nin a paper at the Clay Varve Chronology Workshop at Trosa, Sweden, in 1993, considered\nminimisation of a local least-squares measure of distance between a target series Xt and a\npotential matching fragment Yt, where the series can be assumed to differ by a constant (Fig.\n1). They proposed the criterion\ns2(j, k) = minβ\n{\n1\nn\nn∑\nt=1\n(Yt+k −Xt+j − β)2\n}\n, k ≥ 0,\nwith the shift relative to a start point 1 + k on the matching fragment estimated by\njˆ(k) = argminj{s2(j, k)} − k.\nINSERT Fig. 2 HERE\nFigure 2 shows the local least-squares matching for just four of the 50 segments based on\nthe local least-squares criterion with window-width n = 30. Consistent local matches will\nappear as horizontal straight lines in the (k, jˆ(k)) diagram in Fig. 2, where k is the point\non the fragment and jˆ(k) is the value on the master series. In Fig. 2(a), there is a strong\nmatch between the first Massachussets series and the Connecticut series at jˆ(k) = 450 on the\nConnecticut series. This extends the record beyond the n = 871 years covered by the master\nConnecticut series. In Fig. 2(b), the match is good only for the first segment of the second\nMassachussets series and the estimated start point is jˆ(k) = 767 on the Connecticut series.\nIn Fig. 2(c), we see that the first Verosub record, called the Broadbrook series, matches at\nseveral different lags in the diagram, corresponding to possible extra varves; the middle value\njˆ(k) = 153 was assigned for the series since it was difficult to tell exactly where the changes\noccurred. The final match between the 14th Verosub series, called the Will Mansett series,\n4\nshows matches with the second Massachussets series at jˆ(k) = 309; 308 indicates a missing\nvarve somewhere between k = 40 and k = 60.\nIn general, many ‘two-at-a-time’ comparisons were made between the 50 varve sequences\nin order to align them all with the master or target sequences. For example, two other\nMassachussets varve sequences can serve as the target series for points beyond the Con-\nnecticut series and the first Massachussets sequence. In general, many checks need to be\nmade, alternating the specification of the master or target series to check for the possibility\nof negative lags.\nFor the local least-squares criterion, we will show consistency for the estimator jˆ(k) and\nasymptotic normality for βˆ under the assumption that Xt and Yt are stationary ergodic series\ndiffering by white noise.\n3. ON THE ASYMPTOTICS OF LAG ESTIMATION\nIn (1), regressing {Yt; 1 ≤ t ≤ n} on {Xt+j; 1 ≤ t ≤ n}, first we obtain the jth least-\nsquares estimator of β, for 0 ≤ j ≤ nX − n, as\nβˆj = argmin {\nn∑\nt=1\n(Yt −Xt+j − u)2;u ∈ IR} = Y¯ − X¯j, (2)\nwhere Y¯ =\n∑n\nt=1 Yt\/n and X¯j =\n∑n\nt=1Xt+j\/n. Next we estimate the lag J by minimising the\nresidual sum of squares. Therefore, Jˆ is defined as\nJˆ = argmin [\nn∑\nt=1\n{Yt −Xt+j − (Y¯ − X¯j)}2; 0 ≤ j ≤ nX − n]. (3)\nFinally, we use βˆJˆ = Y¯ − X¯Jˆ to estimate β.\nWe make the following assumptions about the covariance structure of the increment of\nthe stationary process {Xt; 1 ≤ t ≤ n}. Define dt,j = Xt+J − Xt+j, Dt,j = (Xt+J − Xt+j)2\nand Xt,j = Xt+J −Xt+j − (X¯J − X¯j), 0 ≤ t ≤ n, 0 ≤ j ≤ nX − n.\n5\nCondition 1. For some δ1 and δ2 such that δ1 > δ2 > 0, E(XJ −Xj)2 ≥ δ1 for all j 6= J\nand |E(ds,jdt,j)| ≤ δ2 for all s 6= t.\nCondition 2a. We assume that n−1\n∑nX−n\nj=0,6=J E(XJ −Xj)2 = o(1).\nCondition 2b. We assume that n−1\n∑nX−n\nj=0,6=J E(XJ −Xj)4 = o(1).\nCondition 3. We assume that\n∑nX−n\nj=0,6=J gnj = o(n\n2), where gnj =\n∑\n1≤s<t≤n cov(Dsj, Dtj).\nCondition 4. We assume that nX − n = o(n).\nConditions 2a, 2b and 3 are the moment conditions in the overlapping zone of the two\nseries. Condition 4 states that the ratio of the numbers of observations in the master series\nand the matching series should be close to one. Note that, in Conditions 2a, 2b and 3, the\nsum can also include j = J since the corresponding summands are zero. However, to keep\nconformity with Condition 1, we prefer to exclude j = J in writing the sum.\nRemark 1. Conditions 1-3 are satisfied when, for example, {Xt; 1 ≤ t ≤ nX} are independent\nand identically distributed with zero mean and finite fourth moment. Also, under a finite\nfourth moment assumption on X1, Condition 4 implies Conditions 2a and 2b.\nRemark 2. Conditions 1-3 are satisfied when {Xt; t ≥ 1} is a stationary linear process\nrepresented by\nXt =\n∞∑\ni=−∞\nψiZt−i,\nwhere {Zt; t ∈ Z} is a white noise process with finite fourth moment and the sum with respect\nto i is over the set of integers Z with ∑i |ψi| <∞. We assume that E(Zt) = 0, var(Zt) = σ2Z\nand E(Z4t ) = ησ\n4\nZ with 0 < η < ∞. Thus, in particular, our results are applicable to stable\nautoregressive moving average processes. We verify this remark in the Appendix.\nThe first theorem states the consistency of the lag estimator.\nTHEOREM 1. Consider model (1) and suppose that Conditions 1-4 hold. Then, for all ² > 0,\nlim\nn→∞ pr(|Jˆ − J | ≤ ²) = 1.\n6\nThe next result gives the asymptotic normality of βˆJˆ .\nTHEOREM 2. Consider model (1) and suppose that Conditions 1-4 hold. Then\nn1\/2(βˆJˆ − β)→ N(0, σ2),\nin distribution, as n→∞.\n4. SMALL SAMPLE PERFORMANCE\nIn this section we report some simulations that indicate that Theorem 1 may be true even for\nmore general combinations of master series and fragment lengths, nX and n, than would be\nimplied by Condition 4. The varve-matching application involves series lengths that depart\nsubstantially from this assumption and so such simulations give more insight into this matter.\nTo examine the performance of the matching procedure for other combinations, we fitted a\nfirst-order moving average to the first differences of the logarithms of several of the varve\nseries,\nxt − xt−1 = wt − θwt−1\nsay, where the wt were taken as independent and identically distributed normal random\nvariables with variance σ2w. In general, we obtained θ = 0.8 and we used this to generate a\nseries for Xt for use in model (1). Note that the first-order moving average model results from\ntaking the first difference ytj − yt−1,j in our final merging model. In simulating the values of\n{Yt} in (1), we took σ2 = 0.25 and β = 4. The variance of the first-order moving average\nwas taken as 0.25 so that the equivalent signal-to-noise ratio in the data generated from the\nmodel (1) was unity. Table 1 shows the results from 500 repetitions for each combination\nof nX and n. For convenience in the simulations, the true match between the fragment and\nthe master series used a value of J such that the midpoint n\/2 of the fragment matched the\nmidpoint of the master series nX\/2; alternative placements did not change the results.\n7\nINSERT TABLE 1 HERE\nThe results show that, with the window-width n = 30 in the applications, Jˆ is expected to\nperform very well for most values of nX that are in the range of the master series used in this\nstudy. The simulations also show a gradual reduction of the success probability pr(Jˆ = J)\nas the length of the master series increases. One can object to the optimistic nature of the\nassumptions, which take the signal as a first-order moving average and draw the noise values\nfrom a normal distribution, but these are sensible for the problem under consideration.\n5. DISCUSSION\nThe primary purpose of aligning the fragments is to reconstruct a long varve record in order\nto obtain a potential surrogate for paleoclimatic temperature. A sensible model that results\nfrom the above matching exercise might be\nYjt = βj +Xt + ²jt,\nwhere Yjt denotes the logarithm of the varve thickness of the jth fragment and the merged\nlogarithm of the varve signal Xt is a random walk. The observed series Yjt is assumed to start\nat the correct time delay. Estimation of the scale factors and unknown variances σ2j = var ²jt,\nas well as the additional variance of the random walk, can be done using the EM algorithm,\nas developed for the missing data case by Shumway & Stoffer (1982). This leads to the\nmerged varve signal in Fig. 3 based on 50 varve fragment series. In the present case, over\n90% of the varve observations are missing.\nINSERT Fig. 3 HERE\nHere we remark that maximising the likelihood of the above model with respect to the\ntime delays as well as the variance parameters and the scale factors would be an alternative\noption to the sequential two-by-two least-squares approach considered in this paper. The\n8\nnumber of additional parameters, 500 times the number of possible delays in this case, made\nthe ‘two-by-two’ procedure an easier route. It is also probable that the likelihood function\nwill not be identifiable in this highly parameterised approach.\nACKNOWLEDGEMENT\nR.H. Shumway and K.L. Verosub were supported, in part, by a grant from the U.S. National\nScience Foundation. The authors would like to thank the editor and three referees for their\ncareful reading and many valuable suggestions that led to significant improvement of the\npaper.\nAPPENDIX\nTechnical details\nThis section contains sketches of proofs of the theoretical results; for detail proofs, see a\nUniversity of Liverpool technical report by K. Mukherjee and R. H. Shumway.\nVerification of Remark 2. In this section, we verify that Conditions 1-3 are satisfied when\n{Xt; t ≥ 1} is a stationary linear process represented by\nXt =\n∞∑\ni=−∞\nψiZt−i,\nwhere {Zt; t ∈ Z} is a white noise process with finite fourth moment and the sum with respect\nto i is over the set of integers Z with ∑i |ψi| <∞. We assume that E(Zt) = 0, var(Zt) = σ2\nand E(Z4t ) = ησ\n4. Under these conditions, it can be shown that, with γ(k) = E(X0Xk),\nE(XuXu+pXvXv+q)\n= γ(p)γ(q) + γ(v − u)γ(v − u+ q − p) + γ(v − u+ q)γ(v − u− p)\n+(η − 3)σ4∑\ni\nψiψi+pψi+v−uψi+v−u+q; (A1)\n9\nsee for example Shumway & Stoffer (2000, Eq. 1.142). Clearly, for every k ≥ 0, α(k) :=∑\nj |ψjψj+k| <∞. However, we also need to assume that\n∑\nk α(k) <∞. This is satisfied for\nARMA(p, q) processes.\nTo verify Condition 3, we use the stationarity of {Xt} in the second and third equality\nand (A1) with p = 0, p = 0 = q and u = v at the fourth equality below to obtain that, for\ns ≤ t,\ncov(Ds,j, Dt,j) = E(Ds,jDt,j)− {E(XJ −Xj)2}2\n= E(Ds,jDt,j)− [2{γ(0)− γ(|J − j|)}]2\n= E(X2sX\n2\nt ) + E(X\n2\ntX\n2\ns ) + E(X\n2\ns+JX\n2\nt+j) + E(X\n2\ns+jX\n2\nt+J)\n−2\n{\nE(X2s+JXt+JXt+j) + E(X\n2\ns+jXt+JXt+j) + E(X\n2\nt+JXs+JXs+j) + E(X\n2\nt+JXs+JXs+j)\n}\n+4E(Xs+jXs+JXt+jXt+J)−\n{\n4γ2(0) + 4γ2(|J − j|)− 8γ(0)γ(|J − j|)\n}\n= 2γ2(0) + 4γ2(t− s) + 2(η − 3)σ4∑\ni\nψ2iψ\n2\ni+t−s\n+γ2(0) + 2γ2(|t− s+ j − J |) + (η − 3)σ4∑\ni\nψ2iψ\n2\ni+|t−s+j−J |\n+γ2(0) + 2γ2(|t− s+ J − j|) + (η − 3)σ4∑\ni\nψ2iψ\n2\ni+|t−s+J−j|\n−2{γ(0)γ(|J − j|) + T1) + γ(0)γ(|J − j|) + T2)\n+γ(0)γ(|J − j|) + T3) + γ(0)γ(|J − j|) + T4)}\n+4{γ2(|j − J |) + γ2(t− s) + γ(|t− s+ J − j|)γ(|t− s+ j − J |)\n+(η − 3)σ4∑\ni\nψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J |}\n−4γ2(0)− 4γ2(|J − j|) + 8γ(0)γ(|J − j|),\nwhere, for example, T1 is defined by\nγ(0)γ(|J − j|) + T1 = E(X2s+JXt+JXt+j)\n= γ(0)γ(|J − j|) + 2γ(t− s)γ(|t− s+ J − j|) + (η − 3)σ4∑\ni\nψ2iψi+t−sψi+|t−s+j−J |.\n10\nHence, cancelling the terms involving γ2(0) and γ2(|J − j|) and γ(0)γ(|J − j|), we obtain\ncov(Ds,j, Dt,j)\n= 4γ2(t− s) + 2(η − 3)σ4∑\ni\nψ2iψ\n2\ni+t−s\n+2γ2(|t− s+ j − J |) + (η − 3)σ4∑\ni\nψ2iψ\n2\ni+|t−s+j−J |\n+2γ2(|t− s+ J − j|) + (η − 3)σ4∑\ni\nψ2iψ\n2\ni+|t−s+J−j|\n−2(T1 + T2 + T3 + T4)\n+4{γ2(t− s) + γ(|t− s+ J − j|)γ(|t− s+ j − J |)\n+(η − 3)σ4∑\nj\nψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J |}.\nThe above involves terms of the form γ2(t− s), γ2(|t− s + j − J |), γ(|t− s + J − j|)γ(|t−\ns+ j − J |), γ(t− s)γ(|t− s+ J − j|), ∑i ψ2iψ2i+t−s, ∑i ψ2iψ2i+|t−s+j−J | ∑i ψ2iψi+t−sψi+|t−s+j−J |\nand\n∑\ni ψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J |. We next show that sum of the above terms over\n0 ≤ j ≤ nX − n, 1 ≤ s ≤ t ≤ n is o(n2). As representative proofs, we only show that\nnX−n∑\nj=0\n∑\n1≤s≤t≤n\nγ2(t− s) = o(n2), (A2)\nnX−n∑\nj=0\n∑\n1≤s≤t≤n\n∑\ni\nψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J | = o(n2). (A3)\nEquation (A2) follows if we note that |γ(k)| ≤ C1, so that\n∑\n1≤s≤t≤n\nγ2(t− s) ≤ C1\n∑\nk\n|γ(k)| <∞.\nSimilarly (A3) follows if we note that\n∑\ni |ψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J || ≤ Cα(t−s). Hence\n|\nnX−n∑\nj=0\n∑\n1≤s≤t≤n\n∑\ni\nψiψi+|t−s+J−j|ψi+t−sψi+|t−s+j−J ||\n≤ C\nnX−n∑\nj=0\n∑\n1≤s≤t≤n\nα(t− s) ≤∑\nk\nα(k)(nX − n) = o(n2).\nNote that Conditions 2a and 2b are satisfied by the finiteness of the fourth moment. Also,\nsince {Xt; 1 ≤ t ≤ n} is stationary with autocorrelation function {γ(k)}, Condition 1 implies\n11\nthat, for all s 6= t, j 6= J ,\n2γ(|t− s|)− γ(|t− s+ j − J |)− γ(|t− s+ J − j|) ≤ δ2 < δ1 ≤ 2{γ(0)− γ(|j − J |)}.\nThis is equivalent to saying that, for all u, v 6= 0,\n2γ(|v|)− γ(|v + u|)− γ(|v − u|) ≤ δ2 < δ1 ≤ 2{γ(0)− γ(|u|)}.\nFor proving Theorem 1, we first summarise several implications of Conditions 1-4 in the\nform of the following Lemma. For its proof, see the technical report by K. Mukherjee and R.\nH. Shumway.\nLEMMA A1. In the model (1) suppose that Conditions 1-4 hold. Then,\nfor all j 6= J, E{n−1\nn∑\nt=1\nX2t,j} ≥ (1− 1\/n)(δ1 − δ2) = δ3n say, (A4)\nnX−n∑\nj=0,j 6=J\nE{n−2\nn∑\nt=1\nX2t,j} = o(1), (A5)\nnX−n∑\nj=0,j 6=J\nE(X¯J − X¯j)2 = o(1), (A6)\nnX−n∑\nj=0,j 6=J\nvar(D¯j) = o(1), where D¯j = n\n−1\nn∑\nt=1\nDt,j. (A7)\nNote that, in (A5)-(A7), the sum can also include j = J since the corresponding summands\nare zero. However, to keep conformity with (A4), we exclude j = J from writing the sum.\nProof of Theorem 1. Since Jˆ and J are integer-valued random variables, it is equivalent\nto proving that\nlimpr(Jˆ = J) = 1. (A8)\nNote that\npr(Jˆ = J) = pr[\nnX−n⋂\nj=0,j 6=J\n{\nn∑\nt=1\n(Yt −Xt+j − Y¯ + X¯j)2 ≥\nn∑\nt=1\n(Yt −Xt+J − Y¯ + X¯J)2}]. (A9)\nFrom (1) and (2), Y¯ − X¯J = β+ ²¯, where ²¯ = ∑nt=1 ²t\/n. Hence Yt−Xt+J − Y¯ + X¯J = ²t− ²¯.\nAlso, Yt − Xt+j − Y¯ + X¯j = ²t − ²¯ + Xt,j. Therefore, using ∑nt=1Xt,j = 0, we obtain from\n12\n(A9) that pr(Jˆ = J) = 1− pr[⋃nX−nj=0,j 6=J{∑nt=1X2t,j + 2∑nt=1 ²tXt,j < 0}] and so, for (A8), it is\nenough to show that\nlim\nnX−n∑\nj=0,6=J\npr(n−1\nn∑\nt=1\nX2t,j + 2n\n−1\nn∑\nt=1\n²tXt,j < 0) = 0. (A10)\nChoose c such that (δ1 − δ2)\/2 > c > 0. Fix any j 6= J . Then, with δ3n = (1− 1\/n)(δ1 − δ2)\nas defined in (A4),\npr(n−1\nn∑\nt=1\nX2t,j + 2n\n−1\nn∑\nt=1\n²tXt,j < 0)\n≤ pr(|n−1\nn∑\nt=1\n²tXt,j| > c\/2) + pr(n−1\nn∑\nt=1\n{X2t,j − EX2t,j} < c− δ3n). (A11)\nThis follows because (A11) can be written, with the obvious identifications, as\npr(X + 2Y < 0) ≤ pr(Y < −c\/2) + pr(X < c)\n≤ pr(|Y | > c\/2) + pr{X − E(X) < c− E(X)}\n≤ pr(|Y | > c\/2) + pr(X − E(X) < c− δ3n),\nand δ3n < E(X) from (A4).\nWe bound the first probability in (A11) by applying Rosenthal’s inequality to the tail\nprobability of the sum of martingale differences; see Corollary 2.1 and Theorem 2.12 of\nHall & Heyde (1980). Rosenthal’s inequality states that, if {Dt; 1 ≤ t ≤ n} is a sequence of\nmartingale differences with respect to an increasing filtration {Dt; 1 ≤ t ≤ n},Mk := ∑kt=1Dt\nand p ≥ 2, then there exists a constant C = C(p), such that, for any ² > 0,\npr(|Mn| > ²) ≤ pr\n(\nmax\n1≤k≤n\n|Mk| > ²\n)\n≤ C²−p\n n∑\nt=1\nE|Dt|p + E\n{\nn∑\nt=1\nE(D2t |Dt−1)\n}p\/2 .\nFix j 6= J throughout. Note that, by independence between the X’s and the ²’s, Dt :=\nn−1²tXt,j, 1 ≤ t ≤ n, is a sequence of martingale differences with respect to the sigma-field\n13\nDt := σ{Xl,j, ²k; 1 ≤ l ≤ t, 1 ≤ k ≤ t−1}, 1 ≤ t ≤ n. Therefore, using Rosenthal’s inequality\nwith p = 2, we obtain\npr(|n−1\nn∑\nt=1\n²tXt,j| ≥ c\/2) ≤ C1(c)n−2{\nn∑\nt=1\n(E²2tEX\n2\nt,j) + E(σ\n2\nn∑\nt=1\nX2t,j)}. (A12)\nTo bound the second probability in (A11), note that\nn−1\nn∑\nt=1\n(X2t,j − EX2t,j)\n= n−1\nn∑\nt=1\n[{(Xt+J −Xt+j)2 − E(X¯J − X¯j)2}]− {(X¯J − X¯j)2 − E(X¯J − X¯j)2}\n= n−1\nn∑\nt=1\n(Dt,j − EDt,j)− {(X¯J − X¯j)2 − E(X¯J − X¯j)2}.\nHence,\npr{n−1\nn∑\nt=1\n(X2t,j − EX2t,j) < c− δ3n}\n≤ pr{n−1\nn∑\nt=1\n(Dt,j − EDt,j) < (c− δ3n)\/2}+ pr{(X¯J − X¯j)2 − E(X¯J − X¯j)2 < (c− δ3n)\/2}.\nNote that, for all large n, there are some c1 and c2, such that 0 < c1 < δ3n − c < c2. Hence\nthe above probabilities are eventually bounded by\npr{|n−1\nn∑\nt=1\n(Dt,j − EDt,j)| > (δ3n − c)\/2}+ pr{|(X¯J − X¯j)2 − E(X¯J − X¯j)2| > (δ3n − c)\/2}.\nIf now we apply Chebychev’s inequality and Markov’s inequality respectively, the sum of the\nabove two probabilities is bounded above by\nC2var(D¯j) + C3E(X¯J − X¯j)2, (A13)\nfor some constants C2 and C3. Combining (A12) and (A13), we obtain that (A11) is bounded\nby a constant times\nn−2\nn∑\nt=1\nE(X2t,j) + var(D¯j) + E(X¯J − X¯j)2.\nIf we sum this over j 6= J , (A10) now follows from (A5), (A6) and (A7).\n14\nProof of Theorem 2. For any x ∈ R,\npr{n1\/2(βˆJˆ − β) ≤ x} ≤ pr(Jˆ 6= J) + pr{n1\/2(βˆJ − β) ≤ x, Jˆ = J}.\nBy Theorem 1, the first probability is o(1). Using (1) and (2), we can easily see that n1\/2(βˆJ−\nβ) = n1\/2²¯ and so, by the ordinary central limit theorem, pr{n1\/2(βˆJ − β) ≤ x} → Φ(x\/σ).\n15\n9. REFERENCES\nAntevs, E. (1922). The recession of the last ice sheet in New England. Am. Geog. Soc. Res.\nSer. 11, 120pp.\nAntevs, E. (1928). The recession of the last ice sheet in New England. Am. Geog. Soc. Res.\nSer. 17, 297pp.\nHall P. & Heyde, C. C. (1980). Martingale Limit Theory and its Application. New York:\nAcademic Press.\nRidge, J. C. & Larson, F. D. (1990). Re-evaluation of Antev’s New England varve chronology\nand new radiocarbon dates of sediments from glacial Lake Hitchcock. Bull. Geol. Soc.\nAm. 102, 889-99.\nShumway, R. H. & Stoffer, D. S. (1982). An approach to time series smoothing and forecasting\nusing the EM algorithm. J. Time Ser. Anal. 3, 253-64.\nShumway, R. H. & Stoffer, D. S. (2000). Time Series Analysis and Its Applications. New\nYork: Springer-Verlag.\nVerosub, K. L. (1979a). Paleomagnetism of varved sediments from western New England:\nVariability of the paleomagnetic recorder. Geophys. Res. Lett. 6, 241-4.\nVerosub, K. L. (1979b). Paleomagnetism of varved sediments from western New England:\nSecular variation. Geophys. Res. Lett. 6, 244-8.\n16\n0 100 200 300 400 500 600 700 800 900 1000\n0\n1\n2\n3\n4\n5\n6\n7\nConn.\nMass1 Mass2\nBroadbrook\nyear\nlo\ng \nth\nic\nkn\nes\ns\n440 460 480 500 520 540 560 580 600 620 640\n0\n1\n2\n3\n4\n5\nConn.\nMass1\nFigure 1: (a) Logarithms of yearly varve thicknesses series from several locations, beginning\nat 15,600 years before present. Series have been aligned by minimising squared error over pos-\nsible lags. (b) The best alignment of the Massachussets fragment and the master Connecticut\nsequence with a starting point beginning at 450 points into the Connecticut series.\n17\n20 40 60 80 100 120 140\n448\n449\n450\n451\n452\nC\non\nn1\n S\nta\nrt\nMass1 Start\n450\n(a)\n100 200 300 400 500 600\n−600\n−400\n−200\n0\n200\n400\n600\n800\nC\non\nn1\n S\nta\nrt\nMass2 Start\n767\n(b)\n50 100 150 200 250\n−200\n0\n200\n400\n600\n800\nC\non\nn1\n S\nta\nrt\nVS1 Start\n152\n153\n154\n(c)\n20 40 60\n0\n100\n200\n300\n400\n500\n600\nM\nas\ns2\n S\nta\nrt\nVS14 Start\n309\n308\n(d)\nFigure 2: Local least-squares matching of varve segments to the master Connecticut seg-\nment with window-width n = 30. Best match jˆ(k) is on the ordinate. (a) Connecticut-\nMassachussets1 plot shows uniform agreement with a starting point at 450. (b) Connecticut-\nMassachussets2 plot shows matching at the end only, year 767, of the Connecticut series. (c)\nConnecticut-Broadbrook plot shows varying start points ranging from 152-154, indicating\nmissing and extra varves. (d) Connecticut-Will Mansett plot shows matches at points 309\nand 308 with a missing varve.\n18\n0 5 10 15 20 25 30 35 40 45 50\n1\n2\n3\n4\n5\n6\n7\nVarve Fragment\nM\nea\nn \nlo\ng \nth\nick\nne\nss\n−− Initial Means\n− Final Means\n0 500 1000 1500 2000 2500 3000\n−2\n−1.5\n−1\n−0.5\n0\n0.5\n1\n1.5\nLo\ng \nth\nick\nne\nss\nyear\n− Merged Climate Signal\n−− Upper and Lower 95% Limits\nFigure 3: Reconstructed 3000-year varve signal beginning 15,600 years before present. (a)\nInitial and final means based on 50 estimated varve fragment series. (b) Merged signal along\nwith 95% probability limits.\n19\nTable 1: Estimation of J based on simulated observations with various master series of\nlengths nX and fragment lengths n. Values shown are pr(Jˆ = J) based on 500 repetitions at\na signal-to-noise ratio of unity, with a first-order moving average used for the signal.\nMaster series length\nFragment nX = 50 nX = 100 nX = 500\nn = 10 0.802 0.712 0.394\nn = 20 0.992 0.974 0.886\nn = 30 1.000 0.994 0.988\nn = 40 1.000 1.000 1.000\nn = 50 1.000 1.000 1.000\n20\n"}