{"doi":"10.1016\/j.watres.2006.10.020","coreId":"138479","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2878","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2878","10.1016\/j.watres.2006.10.020"],"title":"Biomass effects on oxygen transfer in membrane bioreactors.","authors":["Germain, Eve","Nelles, F.","Drews, A.","Pearce, P.","Kraume, M.","Reid, E.","Judd, Simon J.","Stephenson, Tom"],"enrichments":{"references":[{"id":38068498,"title":"Aeration-A wastewater treatment process.&quot; Water Environment Federation,","authors":[],"date":"2001","doi":"10.2175\/1-57278-177-7","raw":"WEF, and ASCE. (2001). &quot;Aeration-A wastewater treatment process.&quot; Water Environment Federation, New York, USA.","cites":null},{"id":38068491,"title":"Aeration: principles and practice.&quot;","authors":[],"date":"2002","doi":null,"raw":"Mueller, J. A., Boyle, W. C., and Popel, H. J. (2002). &quot;Aeration: principles and practice.&quot; CRC Press, Boca Raton, USA.","cites":null},{"id":38068492,"title":"Aerobic Domestic Waste-Water Treatment in a Pilot-Plant With Complete Sludge Retention by Cross-Flow Filtration.","authors":[],"date":null,"doi":"10.1016\/0043-1354(94)00267-b","raw":"Aerobic Domestic Waste-Water Treatment in a Pilot-Plant With Complete Sludge Retention by Cross-Flow Filtration. Water Research 29, 1179-1189.","cites":null},{"id":38068477,"title":"Biomass characteristics and membrane aeration: Toward a better understanding of membrane fouling in submerged membrane bioreactors (MBRs).","authors":[],"date":"2005","doi":"10.1002\/bit.20411","raw":"Germain, E., Stephenson, T. and Pearce, P. (2005) Biomass characteristics and membrane aeration: Toward a better understanding of membrane fouling in submerged membrane bioreactors (MBRs). Biotechnology and Bioengineering 90(3), 316-322.","cites":null},{"id":38068478,"title":"Biomass characteristics, aeration and oxygen transfer in membrane bioreactors: their interrelations explained by a review of aerobic biological processes. Re\/views in Environmental Science and Bio\/Technology,","authors":[],"date":"2005","doi":"10.1007\/s11157-005-2097-3","raw":"Germain, E. and Stephenson, T. (2005) Biomass characteristics, aeration and oxygen transfer in membrane bioreactors: their interrelations explained by a review of aerobic biological processes. Re\/views in Environmental Science and Bio\/Technology, in press.","cites":null},{"id":38068483,"title":"Characterization and improvement of oxygen transfer in pilot plant external air-lift bioreactor for mycelial biomass production.","authors":[],"date":"2001","doi":null,"raw":"Jin, B., Yu, Q., Yan, X. Q., and van Leeuwen, J. H. (2001). Characterization and improvement of oxygen transfer in pilot plant external air-lift bioreactor for mycelial biomass production. World Journal of Microbiology & Biotechnology 17, 265-272.19 Ju, L.-K., and Sundararajan, A. (1994). The effects of cells on oxygen transfer in bioreactors: physical presence of cells as solid particles. The Chemical Engineering Journal and the Biochemical Engineering Journal 56, B15-B21.","cites":null},{"id":38068494,"title":"Charakterisierung von belebtem Schlamm in Membranbelebungsreaktoren zur Abwasserreinigung,","authors":[],"date":"2003","doi":null,"raw":"Rosenberger, S. (2003). Charakterisierung von belebtem Schlamm in Membranbelebungsreaktoren zur Abwasserreinigung, Dissertation, TU Berlin, Fortschr.-Ber. VDI Reihe 3 Nr. 769, VDI-Verlag, Düsseldorf.20 Stephenson, T., Judd, S. J., Jefferson, B., and Brindle, K. (2000). &quot;Membrane Bioreactors for Wastewater Treatment.&quot; IWA Publishing, London, UK.","cites":null},{"id":38068473,"title":"Colorimetric method for determination of sugars and related substances.","authors":[],"date":"1956","doi":"10.1021\/ac60111a017","raw":"Dubois, M., Gilles, K. A., Hamilton, J. K., Rebers, P. A., and Smith, F. (1956). Colorimetric method for determination of sugars and related substances. Analytical Chemistry 28, 350-356.","cites":null},{"id":38068500,"title":"Comparison of extraction methods in quantifying extracellular polymers in biofilms.","authors":[],"date":"1999","doi":"10.1016\/s0273-1223(99)00170-5","raw":"Zhang, X., Bishop, P. L., and Kinkle, B. K. (1999). Comparison of extraction methods in quantifying extracellular polymers in biofilms. Water Science & Technology 39, 211-218.21","cites":null},{"id":38068481,"title":"Fouling control in activated sludge submerged hollow fiber membrane bioreactors.","authors":[],"date":"2002","doi":"10.1016\/s0011-9164(02)00260-6","raw":"Hong, S., Bae, T., Tak, T., Hong, S., and Randall, A. (2002). Fouling control in activated sludge submerged hollow fiber membrane bioreactors. Desalination 143, 219-228.","cites":null},{"id":38068484,"title":"Gas holdup and volumetric liquid-phase mass transfer coefficient in a gel-particle suspended bubble column with draught tube.","authors":[],"date":"1992","doi":"10.1252\/jcej.25.11","raw":"Koide, K., Shibata, K., Ito, H., Kim, S. Y., and Ohtaguchi, K. (1992). Gas holdup and volumetric liquid-phase mass transfer coefficient in a gel-particle suspended bubble column with draught tube. Journal of Chemical Engineering of Japan 25, 11-16.","cites":null},{"id":38068475,"title":"Gas-liquid oxygen transfer characteristics in an aerobic submerged biofilter for the wastewater treatment.","authors":[],"date":"1992","doi":"10.1016\/0009-2509(92)85093-q","raw":"Fujie, K., Hu, H.-Y., Ikeda, Y., and Urano, K. (1992). Gas-liquid oxygen transfer characteristics in an aerobic submerged biofilter for the wastewater treatment.","cites":null},{"id":38068497,"title":"Hydrodynamics, axial dispersion and gas-liquid oxygen transfer in an airlift-loop bioreactor with three-phase flow.","authors":[],"date":"1987","doi":null,"raw":"Verlaan, P., and Tramper, J. (1987). Hydrodynamics, axial dispersion and gas-liquid oxygen transfer in an airlift-loop bioreactor with three-phase flow. In &quot;International Conference on Bioreactors and Biotransfomations&quot;, pp. 363-373, Elsevier, London UK.","cites":null},{"id":38068499,"title":"Introduction - What are bacterial extracellular polymeric substances? In: Wingender,","authors":[],"date":"1999","doi":"10.1007\/978-3-642-60147-7_1","raw":"Wingender, J., Flemming, H.-C., Neu, T. R. (1999) Introduction - What are bacterial extracellular polymeric substances? In: Wingender, J., Neu, T. R., Flemming, H.-C. (eds) Microbial extracellular polymeric substances. Springer Verlag, Berlin, pp 1-19.","cites":null},{"id":38068472,"title":"Investigation of oxygen transfer rates in full scale membrane bioreactors.","authors":[],"date":"2003","doi":null,"raw":"Cornel, P., Wagner, M., and Krause, S. (2003). Investigation of oxygen transfer rates in full scale membrane bioreactors. Water Science and Technology 47, 313-319.","cites":null},{"id":38068471,"title":"Membrane filtration characteristics in membranecoupled activated sludge system - the effect of physiological states of activated sludge on membrane fouling.","authors":[],"date":"1998","doi":"10.1016\/s0011-9164(98)00220-3","raw":"Chang, I. S., and Lee, C. H. (1998). Membrane filtration characteristics in membranecoupled activated sludge system - the effect of physiological states of activated sludge on membrane fouling. Desalination 120, 221-233.","cites":null},{"id":38068480,"title":"Multivariate data analysis.&quot; Prentice-Hall International Inc., Upper Saddle River,","authors":[],"date":"1998","doi":null,"raw":"Hair, J. F., Anderson, R. E., Tatham, R. L., and Black, W. C. (1998). &quot;Multivariate data analysis.&quot; Prentice-Hall International Inc., Upper Saddle River, NJ, USA.","cites":null},{"id":38068489,"title":"Nutrients removal in MBRs for municipal wastewater treatment.","authors":[],"date":"2005","doi":"10.1016\/j.desal.2007.11.042","raw":"Kraume, M., Bracklow, U., Vocks, M., and Drews, A. (2005). Nutrients removal in MBRs for municipal wastewater treatment. Water Science & Technology 51, 391-402.","cites":null},{"id":38068482,"title":"Off-line particle size analysis of digested sludge.","authors":[],"date":"2002","doi":"10.1016\/s0043-1354(02)00157-4","raw":"Houghton, J. I., Burgess, J. E. and Stephenson, T. (2002) Off-line particle size analysis of digested sludge. Water Research 36 (18), 4643-4647.","cites":null},{"id":38068466,"title":"Optimal operation for timely adaptation of activated sludge plants to changes in surfactant composition of wastewater,","authors":[],"date":"2002","doi":null,"raw":"Carvalho, G., Novais, J. M, Vanrolleghem, P. A., Pinheiro, H. M. (2002), Optimal operation for timely adaptation of activated sludge plants to changes in surfactant composition of wastewater, Wat. Sci. Tech. 45 (4-5), 345-353.","cites":null},{"id":38068474,"title":"Oxygen mass transfer in a high solids loading three-phase internal-loop airlift reactor.","authors":[],"date":"2001","doi":"10.1016\/s1385-8947(00)00274-6","raw":"Freitas, C., and Teixeira, J. A. (2001). Oxygen mass transfer in a high solids loading three-phase internal-loop airlift reactor. Chemical Engineering Journal 84, 57-61.","cites":null},{"id":38068476,"title":"Oxygen transfer and uptake rates during xanthan gum production.","authors":[],"date":"2000","doi":"10.1016\/s0141-0229(00)00272-6","raw":"Chemical Engineering Science 47, 3745-3752.18 Garcia-Ochoa, F., Castro, E. G., and Santos, V. E. (2000). Oxygen transfer and uptake rates during xanthan gum production. Enzyme and Microbial Technology 27, 680-690.","cites":null},{"id":38068485,"title":"Oxygen transfer into activated sludge with high MLSS concentrations.","authors":[],"date":"2003","doi":null,"raw":"Krampe, J., and Krauth, K. (2003). Oxygen transfer into activated sludge with high MLSS concentrations. Water Science and Technology 47, 297-303.","cites":null},{"id":38068490,"title":"Sludge characteristics and their contribution to microfiltration in submerged membrane bioreactors.","authors":[],"date":"2003","doi":"10.1016\/s0376-7388(03)00073-5","raw":"Lee, W., Kang, S., and Shin, H. (2003). Sludge characteristics and their contribution to microfiltration in submerged membrane bioreactors. Journal of Membrane Science 216, 217-227.","cites":null},{"id":38068464,"title":"Standards methods for the examination of water and wastewater.&quot; American Public Health Association, American Water Works Association and Water Environment Federation,","authors":[],"date":"1998","doi":null,"raw":"APHA, AWWA, and WEF. (1998). &quot;Standards methods for the examination of water and wastewater.&quot; American Public Health Association, American Water Works Association and Water Environment Federation, Washington DC, USA.","cites":null},{"id":38068495,"title":"The Dutch contribution to the MBR development in perspective.","authors":[],"date":"2001","doi":null,"raw":"van der Roest, H., Leenen, J., Hofstra, M., Boeve, J., and van der Vlist, J. (2001). The Dutch contribution to the MBR development in perspective. H20, 7-10.","cites":null},{"id":38068479,"title":"The Membrane Coupled-Activated Sludge Process in Municipal Wastewater Treatment.&quot;","authors":[],"date":"2001","doi":"10.1016\/s0304-3894(01)00203-5","raw":"Günder, B. (2001). &quot;The Membrane Coupled-Activated Sludge Process in Municipal Wastewater Treatment.&quot; Technomic Publishing Company Inc., Lancaster, USA.","cites":null},{"id":38068493,"title":"The studies on the oxygen mass transfer coefficient in a bioreactor.","authors":[],"date":"2001","doi":"10.1016\/s0032-9592(00)00272-7","raw":"Ozbek, B., and Gayik, S. (2001). The studies on the oxygen mass transfer coefficient in a bioreactor. Process Biochemistry 36, 729-741.","cites":null},{"id":38068496,"title":"Transfer of O2 from air to mineral slurries in a rushton turbine agitated tank.","authors":[],"date":"1995","doi":"10.1016\/0892-6875(95)00076-3","raw":"Van Weert, G., Van Der Werff, D., and Derksen, J. J. (1995). Transfer of O2 from air to mineral slurries in a rushton turbine agitated tank. Minerals Engineering 8, 1109-1124.","cites":null},{"id":38068465,"title":"Volumetric oxygen transfer coefficients (kLa) in batch cultivations involving non-Newtonian broths.","authors":[],"date":"2001","doi":"10.1016\/s1369-703x(01)00092-4","raw":"Badino, J., A. C., Facciotti, M. C. R., and Schmidell, W. (2001). Volumetric oxygen transfer coefficients (kLa) in batch cultivations involving non-Newtonian broths. Biochemical Engineering Journal 8, 111-119.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-03","abstract":"Ten biomass samples from both municipal and industrial pilot and full scale submerged membrane bioreactors (MBRs) with mixed liquor suspended solids concentrations (MLSS) ranging from 7.2 to 30.2 g L−1 were studied at six air-flow rates (0.7, 1.3, 2.3, 3, 4.4 and 6 m3 m−3 h−1). Statistical analyses were applied to identify the relative impacts of the various bulk biomass characteristics on oxygen transfer. Of the biomass characteristics studied, only solids concentration (correlated with viscosity), the carbohydrate fraction of the EPS (EPSc) and the chemical oxygen demand (COD) concentration of the SMP (SMPCOD) were found to affect the oxygen transfer parameters kLa20 (the oxygen transfer coefficient) and α-factor. The relative influence on kLa20 was MLSS>aeration>EPSc>SMPCOD and on α-factor was MLSS>SMPCOD>EPSc>aeration. Both kLa20 and α-factor increased with increasing aeration and EPSc and decreased with increasing MLSS and SMPCOD. MLSS was found to be the main parameter controlling the oxygen transfer","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138479.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.watres.2006.10.020","pdfHashValue":"eb0b4da3bd9bec48c75069329f5da81bc325c85a","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2878<\/identifier><datestamp>2010-01-06T14:04:13Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Biomass effects on oxygen transfer in membrane bioreactors.<\/dc:title><dc:creator>Germain, Eve<\/dc:creator><dc:creator>Nelles, F.<\/dc:creator><dc:creator>Drews, A.<\/dc:creator><dc:creator>Pearce, P.<\/dc:creator><dc:creator>Kraume, M.<\/dc:creator><dc:creator>Reid, E.<\/dc:creator><dc:creator>Judd, Simon J.<\/dc:creator><dc:creator>Stephenson, Tom<\/dc:creator><dc:subject>Oxygen transfer<\/dc:subject><dc:subject>MBR<\/dc:subject><dc:subject>Biomass<\/dc:subject><dc:subject>Aeration<\/dc:subject><dc:description>Ten biomass samples from both municipal and industrial pilot and full scale submerged membrane bioreactors (MBRs) with mixed liquor suspended solids concentrations (MLSS) ranging from 7.2 to 30.2 g L−1 were studied at six air-flow rates (0.7, 1.3, 2.3, 3, 4.4 and 6 m3 m−3 h−1). Statistical analyses were applied to identify the relative impacts of the various bulk biomass characteristics on oxygen transfer. Of the biomass characteristics studied, only solids concentration (correlated with viscosity), the carbohydrate fraction of the EPS (EPSc) and the chemical oxygen demand (COD) concentration of the SMP (SMPCOD) were found to affect the oxygen transfer parameters kLa20 (the oxygen transfer coefficient) and α-factor. The relative influence on kLa20 was MLSS>aeration>EPSc>SMPCOD and on α-factor was MLSS>SMPCOD>EPSc>aeration. Both kLa20 and α-factor increased with increasing aeration and EPSc and decreased with increasing MLSS and SMPCOD. MLSS was found to be the main parameter controlling the oxygen transfer.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2008-08-07T15:48:04Z<\/dc:date><dc:date>2008-08-07T15:48:04Z<\/dc:date><dc:date>2007-03<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>E. Germain, F. Nelles, A. Drews, P. Pearce, M. Kraume, E. Reid, S.J. Judd, T. Stephenson, Biomass effects on oxygen transfer in membrane bioreactors, Water Research, Volume 41, Issue 5, March 2007, Pages 1038-1044.<\/dc:identifier><dc:identifier>0043-1354)<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.watres.2006.10.020<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/2878<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Oxygen transfer","MBR","Biomass","Aeration"],"subject":["Postprint"],"fullText":"1Water research vol. 41. no 5. pp1038-104,4 March 2007\nBiomass effects on oxygen transfer in membrane bioreactors\nE. Germain a b, F. Nelles c, A. Drews c, P. Pearce d, M. Kraume c, E. Reid a, S. J. Judd\na, T. Stephenson a*\na School of Water Sciences, Cranfield University, MK43 0AL, UK\nb current address: Thames Water Utilities Ltd., Manor Farm Road, Reading, RG2 0JN,\nUK\nc Institut für Verfahrenstechnik, TU Berlin, Sekr. MA 5-7, Straße des 17. Juni 135, D-\n10623 Berlin, Germany\nd Thames Water Utilities Ltd., Manor Farm Road, Reading, RG2 0JN, UK\n*corresponding author. Fax: +44 1234 754035; E-mail address:\nt.stephenson@cranfield.ac.uk\nAbstract\nFine bubble aeration and biomass characteristics were studied for their impact on\noxygen transfer in membrane bioreactors (MBRs). Ten biomass samples from both\nmunicipal and industrial pilot and full scale submerged MBRs with mixed liquor\nsuspended solids concentrations (MLSS) ranging from 7.2 to 30.2 g.L-1 were studied\nat six air flow rates (0.7, 1.3, 2.3, 3, 4.4 and 6 m3.m-3.h-1). Graphical and statistical\nanalyses were applied to the results to identify the relative impacts of the various bulk\nbiomass characteristics on oxygen transfer, the former being solids concentration,\n2viscosity, particle size distribution, concentrations of COD, protein and carbohydrate\nin the soluble microbial product, SMP, and in the extracellular polymeric substances,\nEPS. Of the biomass characteristics studied, only solids concentration (correlated with\nviscosity), the carbohydrate fraction of the EPS (EPSc) and the COD concentration of\nthe SMP (SMPCOD) were found to affect the oxygen transfer parameters kLa20 (the\noxygen transfer coefficient) and -factor. The relative influence on kLa20 was MLSS >\naeration > EPSc > SMPCOD and on -factor was MLSS > SMPCOD > EPSc > aeration.\nBoth kLa20 and -factor increased with increasing aeration and EPSc and decreased\nwith increasing MLSS and SMPCOD. MLSS was found to be the main parameter\ncontrolling the oxygen transfer.\nKey words\nOxygen transfer, MBR, biomass, aeration.\n3Introduction\nCombining membrane technology with biological treatment, the membrane bioreactor\n(MBR) is an alternative to the conventional activated sludge (CAS) process\n(Stephenson et al., 2000). The sedimentation stage of the CAS process is replaced by\na membrane filtration stage, reducing the footprint significantly and improving\neffluent quality due to the removal of the suspended and colloidal material (van der\nRoest et al., 2001). However, high running costs, arising partly from operating\nmembranes at high solids concentrations, restrict the use of MBRs (Hong et al.,\n2002). The MBR main power requirement comes from aeration, which is used for\nsupply of dissolved oxygen and to maintain solids in suspension. The biological\naeration requirements are higher than in conventional activated sludge process due to\nthe lower oxygen transfer rate initiated by highly concentrated biomass (Cornel et al.,\n2003; Rosenberger, 2003). Additionally, membrane cleaning, in submerged MBRs, is\nprovided by air scouring, and agitation of fibres in the case of hollow fibre\nmembranes (Germain et al., 2005).\nAs in all aerobic biological systems, biomass contained in the MBR requires oxygen\nto perform diverse chemical reactions (Germain and Stephenson, 2005). The amount\nof oxygen diffusing in the mixed liquor is characterised by the oxygen mass transfer\ncoefficient. The main parameter used to characterise the oxygen transfer in aeration\nprocesses is the overall mass transfer coefficient, kLa; where kL represents the mass\ntransfer coefficient based on the liquid film resistance and a, the specific interfacial\narea. Another parameter commonly used to describe the oxygen transfer in biological\naerated systems is the -factor (WEF and ASCE, 2001). This correction factor is\ndefined as the ratio between kLa in the process solution and kLa in clean water. It\n4accounts for the effect of process water characteristics on the oxygen transfer\ncoefficient.\nIn MBRs, as in all aerobic wastewater processes, both the biomass characteristics and\nthe design of the aeration system affect the oxygen transfer (Mueller et al., 2002).\nBiomass is a heterogeneous mixture of particles, microorganisms, colloids, organic\npolymers and cations, of widely varying shapes, sizes and densities. All these\nparameters impact on oxygen transfer (Germain and Stephenson, 2005). Mass transfer\nis also linked with contact area size between gas and liquid phases, i.e. bubble shape\nand solids concentration (Garcia-Ochoa et al., 2000). Bubble characteristics differ\ndepending on the kind of aerator used and the bubble coalescence effect created by\nthe biomass characteristics (Germain and Stephenson, 2005). The aeration in MBRs is\ngenerally provided by fine bubble aerators, used to keep the content of the aerobic\ntank well mixed and provide oxygen to the biomass. In addition, in submerged MBRs,\ncoarse bubble aerators situated under the membrane modules are used to scour and\/or\ngently agitate the membranes in order to control membrane fouling (Stephenson et al.,\n2000).\nFor a better understanding of the phenomena occuring in aerated MBR biomass,\ncloser investigations of each of its characteristics are needed to improve the aeration\nefficiency and so reduce the operating costs. Until now, such investigations have been\ngenerally limited to impacts of solids concentration and viscosity. Other biomass\ncharacteristics worth considering include soluble microbial products (SMP) and\nextracellular polymer substances (EPS); both mainly of microbial origin (Wingeder et\nal., 1999). The SMP is ostensibly soluble and is part of the liquid phase, whereas EPS\n5is bounded to the cells and thus is part of the solid phase. A comprehensive study of\nthe effects of MBR sludge characteristics on oxygen transfer has been carried out on\nsludges from several full and pilot scale municipal and industrial MBRs using a\nbubble column. The use of the same experimental set-up to perform oxygen transfer\ntests on biomass taken from different MBRs has allowed a direct comparison of the\neffect of the biomass characteristics and airflow rates on the oxygen transfer without\nthe added effects of the different plant designs such as tank geometry and\nhydrodynamics.\nMaterial and methods\nOxygen transfer coefficient, kLa, and -factor determinations\nThe non steady-state batch test under endogenous respiration conditions and with no\nrecycle flow described by WEF and ASCE (2001) was used to determine the kLa of\nthe biomass samples. Oxygen transfer tests were performed in a 0.02 m3 working\nvolume bubble column of 2.5m in height and 10 cm in diameter. The fine bubble\ndiffuser was a single Sanitaire ceramic disc with a 6 cm diameter. The column was\nfilled with biomass and the airflow was turned off until the DO concentration reached\n0.8 mg.L-1 or below and then adjusted to a specific airflow rate. The air came from the\nair compressed line of Cranfield University pilot hall. The airflow rate was corrected\nfor the impact of the liquid head pressure and was normalised at atmospheric pressure.\nThe dissolved oxygen (DO) concentration was monitored using a DO probe\n(OxyGuard) connected to a combined meter and data logger (OxyLog). The DO probe\nwas located 1 m above the diffuser at a 45o angle in order to have a steady current on\n6the probe membrane. DO concentration and temperature were recorded until the DO\nconcentration reached its saturation value. The software (OxyLog) was used to\ndownload the data on a computer (Partech Instruments, St Austell, UK).\nTen biomass samples of 25 L were collected from seven different submerged MBRs\n(Table 1). The two pilot-scale and the five full-scale plants all treated municipal\nwastewater except for Plant B, which treated both municipal and dairy wastewater.\nThe plants were operated with either Zenon hollow fibres membranes or Kubota flat\nsheet membranes. The samples were transported in containers to Cranfield University\nSewage Treatment Works Pilot Hall, transport times being less than 24h at all times.\nA homogeneous biomass sample of approximately 300 mL was taken from each\ncontainer before carrying out the oxygen transfer experiments. The biomass\ncharacteristics of the sample were then determined in the laboratory.\nThe non-linear regression method was used to determine kLa and the steady state\ndissolved oxygen saturation concentration, C*f. (SPSS 11.0, SPSS UK Ltd., UK).\nThe oxygen transfer coefficient values, kLaf, were standardised at a temperature of\n20oC and are referred as kLa20 in this paper. The -factor was calculated as the ratio of\nkLa20 in the biomass to kLa20 in clean water.\nAnalytical methods\nParticle size distributions were determined by laser diffraction using a Malvern\nMastersizer 2000 (Malvern Instruments Ltd., Malvern, UK) and reported as the mass\nmedian diameter (MMD) (Houghton and Stephenson, 2000). Viscosity was analysed\nat shear rates from 0.4 s-1 to 22 s-1 in a DV-E Brookfield digital viscometer (Brookfield\n7Viscometers Ltd, Harlow, UK). Viscosity in this paper is quoted at a shear rate of\n12.24 s-1. The SMP were extracted by centrifuging the biomass for 5 min at 5000 rpm\n(Rotanta 96R, Hettich-Zentrifugen, Tuttlingen, Germany) and the supernatant was\nfiltered through 0.2 m glass fibre filters (GF 52, Schleicher & Schuell, London, UK).\nThe EPS were extracted following the heating procedure of Zhang et al. (1999).\nProtein and carbohydrate concentrations were determined by UV absorbance on a\nUV\/visible spectrophotometer (Model 6505 S, Jenway, Dunmow, UK) with reference\nto bovine serum albumin (Sigma, Poole, UK) and glucose standards (Sigma, Poole,\nUK) respectively. The carbohydrate concentration was determined following the\nmethod of Dubois et al. (1956). Chemical oxygen demand (COD) was measured\nusing a photometric method (Merck, VWR International Ltd, Poole, UK). Suspended\nsolids were measured according to standard methods (APHA, 1998).\nStatistical analysis\nStatistical analysis was performed to determine the influence of the biomass\ncharacteristics and the airflow rate on the oxygen transfer. The multiple regression\nanalysis was chosen to analyse the relationship between the independent variables\n(biomass characteristics and aeration) and the dependent variable (oxygen transfer\ncoefficient). Modified or standardised regression coefficients, called Beta coefficients,\nwere used to interpret the regression model. They have a common unit of\nmeasurement and so allow direct comparison of the impact of each independent\nvariable (Hair et al., 1998). Prior to the multiple regression analysis, the relationships\nbetween the biomass characteristics were examined by computing a Pearson product-\nmoment correlation matrix. In case of multicollinearity, the process of determining the\ncontribution of each independent variable would be made more difficult because the\n8effects of the independent variables would be mixed or confounded. If variables are\nhighly correlated to each other, only one of them should be kept to represent this\ngroup of variables in the multiple regression analysis. Correlation coefficients, r,\nequal to +1 or –1 represent a perfect positive or negative correlation respectively. A\ncorrelation coefficient value of 0 represents a lack of correlation. The data was\nanalysed using Statistica (StatSoft Inc., 2000).\nResults\nBiomass with MLSS concentrations ranging from 7.2 to 30.2 g.L-1 were examined\n(Table 1). The oxygen transfer characteristics (kLa20 and -factor) were compared\nwith the volumetric airflow rates and MLSS concentrations.\nAn increase in volumetric airflow rate led to an increase in kLa20 (Figure 1), whereas\nan increase in MLSS concentration resulted in an exponential decrease in kLa20\n(Figure 2). The kLa20 decreased sharply for biomass conditions at MLSS\nconcentrations ranging between 7.2 and 17.9 g.L-1. With biomass conditions at MLSS\nconcentrations ≥ 17.9 g.L-1, kLa20 values were very low; further increases in MLSS\nconcentration did not lead to a significant decrease in kLa20. At very high MLSS\nconcentrations (above 17.9 g.L-1) the impact of volumetric airflow rate became\ninsignificant. The biomass conditions with the lowest MLSS concentrations and the\nhighest volumetric airflow rates led to the highest kLa20 values, whereas the biomass\nconditions with the highest MLSS concentrations and the lowest volumetric airflow\nrates led to the lowest kLa20 values, which were sometimes below the limit of\ndetection (Figure 1). Both the biomass characteristics and the volumetric airflow rate\nwere found to have an impact on kLa20.\n90\n5\n10\n15\n20\n25\n30\n35\n40\n0 1 2 3 4 5 6 7\nVolumetric airflow rate (m3.m-3.h-1)\nk L\na 2\n0\n(h\n-1\n)\n7.2 9.3 12.0\n13.7 13.9 16.8\n17.3 17.9 28.9\n30.2 Clean water\nMLSS (g.L-1)\nFigure 1. kLa20 vs. volumetric airflow rate for the 10 MLSS concentrations studied.\n0\n5\n10\n15\n20\n25\n30\n35\n0 5 10 15 20 25 30 35\nMLSS (g.L-1)\nk L\na 2\n0\n(h\n-1\n)\nFigure 2. kLa20 averaged for all volumetric airflow rates vs. MLSS concentration\n(mean values and ranges).\n10\nPrior to the multiple regression analysis, the biomass characteristics (Table 1) were\nassessed for linear multicollinearity. The three variables found to be consistently\nhighly correlated to each other (p-level > 0.01 and r ≥ 0.86) were the MLSS and\nMLVSS concentrations and the viscosity (Table 2). The variable MLSS was chosen to\nrepresent this group of variables in the multiple regression analysis. Due to high\ncorrelations between these three variables, their separate effect on the oxygen transfer\ncould not be determined. Any reference to MLSS therefore also applies to MLVSS\nand viscosity.\nThe independent variables included in the regression model were the MLSS, EPSc,\nEPSp, EPSCOD, SMPc, SMPp, SMPCOD, MMD and volumetric airflow rate (aeration);\nthe units of the biomass variables were the same as in Table 1 and the aeration\nvariable was in m3.m-3.h-1. The dependent variable was kLa20 in h-1. The variables\nfound to have an impact on kLa20 were MLSS, EPSc, SMPCOD and aeration (Table 3).\nAccording to the Beta coefficients, their degrees of influence were, from the greatest\nto the lowest effect: MLSS > aeration > EPSc > SMPCOD. The MLSS and the SMPCOD\nhad a statistically negative influence on kLa20, i.e. an increase in these variables led to\na decrease in kLa20, whereas the aeration and the EPSc had a statistically positive\ninfluence on kLa20: an increase in these variables led to an increase in kLa20. However,\nEPSp, EPSCOD, SMPc, SMPp, and MMD were found to have no impact on kLa20.\nNo particular relationship was observed between the volumetric airflow rate and -\nfactor (Figure 3), whereas an increase in MLSS concentration led to an exponential\ndecrease in -factor (Figure 4). The -factor decreased sharply for biomass\n11\nconditions with MLSS concentrations up to 17.9 g.L-1. No significant decrease in -\nfactor was observed for further increases in MLSS concentration.\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n0 1 2 3 4 5 6 7\nVolumetric airflow rate (m3.m-3.h-1)\n -\nfa\nct\nor\n7.2 9.3 12.0 13.7 13.9 16.8 17.3 17.9 28.9 30.2\nMLSS (g.L-1)\nFigure 3. -factor vs. volumetric airflow rate for the 10 MLSS concentrations studied.\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n0 5 10 15 20 25 30 35\nMLSS (g.L-1)\n -\nfa\nct\nor\nFigure 4. -factor averaged for all volumetric airflow rates vs. MLSS concentration\n(mean values and ranges).\n12\nThe same independent variables as for the kLa20 study were entered in the regression\nmodels, with -factor as the dependent variable. The variables found to have an\ninfluence on -factor were, from the greatest to the lowest effect and according to the\nBeta coefficients: MLSS > SMPCOD > EPSc > aeration (Table 4). MLSS and SMPCOD\nhad a statistically negative influence on -factor, i.e. an increase in these variables led\nto a decrease in -factor. In contrast, EPSc and aeration had a statistically positive\ninfluence on -factor: an increase in these variables led to an increase in -factor.\nAccording to the Beta coefficients (Table 4) MLSS noticeably had the greatest effect\non -factor. SMPCOD and EPSc exerted almost the same degree of influence with Beta\ncoefficients of –0.40 and 0.38 respectively. The impact of aeration on -factor was\nsignificantly lower. The EPSp, EPSCOD, SMPc, SMPp, and MMD were not detected as\nvariables having a significant influence on -factor.\nTherefore the same parameters were found to affect kLa20 and -factor: the volumetric\nairflow rate, the MLSS concentration (and its correlated parameters: MLVSS and\nviscosity), the SMPCOD and the EPSc. However the EPSp, EPSCOD, SMPc, SMPp, and\nMMD were not detected as parameters having an impact on the oxygen transfer. In\nsummary, both kLa20 and -factor respectively increased with increasing aeration and\nEPSc and decreased with increasing in MLSS and SMPCOD. Hence, the degrees of\ninfluence of the four parameters found to affect the oxygen transfer were not ranked\nin the same order for kLa20 and -factor. The order of their degrees of influence were\nfor kLa20: MLSS > aeration > EPSc > SMPCOD and for -factor: MLSS > SMPCOD >\nEPSc > aeration.\n13\nDiscussion\nSeveral other studies have also reported an exponential correlation between -factor\nand MLSS concentration: Muller et al. (1995), Günder (2001), Rosenberger (2003)\nand Krampe and Krauth (2003). However, the shapes of the exponential curves were\nslightly different (Figure 5). The different studies were undertaken in tanks of\ndifferent geometries using dissimilar aeration devices leading to different energy\ndissipation rates and shear stresses. For the present study, high variations were\nobserved around the mean values (Figure 5), and these variations were related to\nchanges in the volumetric airflow rate. The MLSS concentration was the parameter\nchosen to represent the biomass characteristics. However, other biomass\ncharacteristics, such as EPS and viscosity, affect the oxygen transfer (Krampe and\nKrauth, 2003); for a defined value of MLSS concentration, some of the other\nparameters characterising the biomass could have highly different values.\n0\n0.2\n0.4\n0.6\n0.8\n1\n0 5 10 15 20 25 30 35 40\nMLSS (g.L-1)\n -\nfa\nct\nor\n=e-0.083 MLSS\n(Gunder, 2001)\n=e-0.08788 MLSS\n(Krampe and Krauth,\n2003)\npresent study=1.5074e-0.0446 MLSS\n(Muller et al. , 1995)\n=e-0.049 MLSS\n(Rosenberger, 2003)\nFigure 5. Comparison of the correlations obtained between -factor and MLSS\nconcentration for several studies (means and ranges showed for the present).\n14\nThe particle size (represented by the MMD) was expected to be one of the parameters\ninfluencing the oxygen transfer, as a change in particle size has been reported to affect\nthe bubble coalescence and therefore the oxygen transfer (Fujie et al., 1992, Ozbek\nand Gayik, 2001). The method used for particle size measurement (which implied\ndiluting the biomass in water) might have led to results unrepresentative of actual\nbiomass particle size. Moreover, MMD corresponds to the size at which 50% of the\nsample was smaller and 50% larger, and therefore does not describe the whole range\nof particle size found in the biomass sample.\nMLSS was found to be the main parameter controlling both kLa20 and -factor,\ncorroborating several studies which have established the negative effects of solids\nconcentration on oxygen transfer (Muller et al., 1995; Günder, 2001; Krampe and\nKrauth, 2003; Van Weert et al., 1995; Ju and Sundararajan, 1994; Freitas and\nTeixeira, 2001; Verlaan and Tramper, 1987; Ozbek and Gayik, 2001; Rosenberger,\n2003). Moreover, the MLSS concentration also accounted for the effects of the\nviscosity, which has been shown to have a noticeable effect on oxygen transfer (Koide\net al., 1992; Özbek and Gayik, 2001; García-Ochoa et al., 2000; Badino et al., 2001;\nJin et al., 2001; Rosenberger, 2003). MLSS concentration can easily be controlled in\nMBRs by adjusting the amount of sludge wasted (Stephenson et al., 2000). Therefore\nthe oxygen transfer can be improved by applying specific operating conditions to keep\nthe MLSS concentration low (below 10-15 g.L-1). This relates to diffusivity: in order\nto be able to reach the active sites of the bacterial cell membrane, the oxygen\ncontained in the air bubbles needs to penetrate the liquid film surrounding the flocs\n(SMP) and then diffuse through the floc matrix (EPS) (Mueller et al., 2002). The\n15\nCOD fraction of the SMP was found to have an influence on the oxygen transfer\nparameters studied but not its carbohydrate and protein fractions. The COD mainly\npertains to the organic material in wastewater, which includes proteins and\ncarbohydrates among other compounds. Some of the compounds of the wastewater\nliquid phase found to have a major impact on the oxygen transfer are surfactants\n(WEF and ASCE, 2001; Mueller et al., 2002). As surfactants are organic molecules,\nthe COD measurement can be expected to partly account for the surfactants present in\nthe biomass. Surfactants affect the two terms making up kLa, by reducing the liquid\nfilm mass transfer coefficient, kL, and by increasing the surface area, a (Mueller et\nal., 2002). In the present study, an increase in SMPCOD led to a decrease in both kLa20\nand -factor, suggesting that the liquid film coefficient was more affected by the\nSMPCOD (part of it corresponding to the surfactants fraction of the liquid phase) than\nthe surface area. The impact of the SMPCOD on the oxygen transfer parameters could\nbe explained by the presence of surfactants in the biomass. However, other\ncompounds detected by the COD test and present in the liquid phase of the biomass\nmight have also had an impact on the oxygen transfer. Only the carbohydrate fraction\nof the EPS was found to have an impact on oxygen transfer. The EPSc contributes to\nthe fundamental structure of the EPS matrix, facilitating the aggregation of cells and\nthe formation of large flocs (Wingeder et al., 1999). Large flocs possess higher\nporosities than small ones, corresponding to higher diffusivities (Mueller et al., 2002).\nThe carbohydrate fraction of the EPS was the main EPS fraction influencing oxygen\ntransfer, suggesting that, in the present study, the carbohydrate of the EPS increased\nfloc diffusivity.\n16\nConclusions\n An increase in solids concentration led to an exponential decrease in both\nkLa20 and -factor.\n kLa20 and -factor were affected by the same parameters: the volumetric\nairflow rate, the MLSS concentration (and its correlated parameters: MLVSS\nand viscosity), the SMPCOD and the EPSc.\n MLSS was the main parameter controlling kLa20 and -factor. MLSS should\nbe kept below 10-15 g.L-1 to improve the oxygen transfer efficiency.\n The presence of SMPCOD had a negative effect on the oxygen transfer, which\ncould be explained by the presence of surfactants.\n EPSc, by facilitating the formation of large flocs, increased the porosity of the\nflocs and therefore their diffusivity, which was beneficial to the oxygen\ntransfer.\nAcknowledgements\nThe authors would like to acknowledge Thames Water for their financial support and\nCopa MBR for providing sludge samples. Felix Nelles was supported by an EC\nErasmus grant.\nThe views expressed in this paper are those of the authors and do not necessarily\nrepresent those of their respective organisations.\n17\nReferences\nAPHA, AWWA, and WEF. (1998). \"Standards methods for the examination of water\nand wastewater.\" American Public Health Association, American Water Works\nAssociation and Water Environment Federation, Washington DC, USA.\nBadino, J., A. C., Facciotti, M. C. R., and Schmidell, W. (2001). Volumetric oxygen\ntransfer coefficients (kLa) in batch cultivations involving non-Newtonian broths.\nBiochemical Engineering Journal 8, 111-119.\nCarvalho, G., Novais, J. M, Vanrolleghem, P. A., Pinheiro, H. M. (2002), Optimal\noperation for timely adaptation of activated sludge plants to changes in surfactant\ncomposition of wastewater, Wat. Sci. Tech. 45 (4-5), 345-353.\nChang, I. S., and Lee, C. H. (1998). Membrane filtration characteristics in membrane-\ncoupled activated sludge system - the effect of physiological states of activated sludge\non membrane fouling. Desalination 120, 221-233.\nCornel, P., Wagner, M., and Krause, S. (2003). Investigation of oxygen transfer rates\nin full scale membrane bioreactors. Water Science and Technology 47, 313-319.\nDubois, M., Gilles, K. A., Hamilton, J. K., Rebers, P. A., and Smith, F. (1956).\nColorimetric method for determination of sugars and related substances. Analytical\nChemistry 28, 350-356.\nFreitas, C., and Teixeira, J. A. (2001). Oxygen mass transfer in a high solids loading\nthree-phase internal-loop airlift reactor. Chemical Engineering Journal 84, 57-61.\nFujie, K., Hu, H.-Y., Ikeda, Y., and Urano, K. (1992). Gas-liquid oxygen transfer\ncharacteristics in an aerobic submerged biofilter for the wastewater treatment.\nChemical Engineering Science 47, 3745-3752.\n18\nGarcia-Ochoa, F., Castro, E. G., and Santos, V. E. (2000). Oxygen transfer and uptake\nrates during xanthan gum production. Enzyme and Microbial Technology 27, 680-\n690.\nGermain, E., Stephenson, T. and Pearce, P. (2005) Biomass characteristics and\nmembrane aeration: Toward a better understanding of membrane fouling in\nsubmerged membrane bioreactors (MBRs). Biotechnology and Bioengineering 90(3),\n316-322.\nGermain, E. and Stephenson, T. (2005) Biomass characteristics, aeration and oxygen\ntransfer in membrane bioreactors: their interrelations explained by a review of aerobic\nbiological processes. Re\/views in Environmental Science and Bio\/Technology, in\npress.\nGünder, B. (2001). \"The Membrane Coupled-Activated Sludge Process in Municipal\nWastewater Treatment.\" Technomic Publishing Company Inc., Lancaster, USA.\nHair, J. F., Anderson, R. E., Tatham, R. L., and Black, W. C. (1998). \"Multivariate\ndata analysis.\" Prentice-Hall International Inc., Upper Saddle River, NJ, USA.\nHong, S., Bae, T., Tak, T., Hong, S., and Randall, A. (2002). Fouling control in\nactivated sludge submerged hollow fiber membrane bioreactors. Desalination 143,\n219-228.\nHoughton, J. I., Burgess, J. E. and Stephenson, T. (2002) Off-line particle size\nanalysis of digested sludge. Water Research 36 (18), 4643-4647.\nJin, B., Yu, Q., Yan, X. Q., and van Leeuwen, J. H. (2001). Characterization and\nimprovement of oxygen transfer in pilot plant external air-lift bioreactor for mycelial\nbiomass production. World Journal of Microbiology & Biotechnology 17, 265-272.\n19\nJu, L.-K., and Sundararajan, A. (1994). The effects of cells on oxygen transfer in\nbioreactors: physical presence of cells as solid particles. The Chemical Engineering\nJournal and the Biochemical Engineering Journal 56, B15-B21.\nKoide, K., Shibata, K., Ito, H., Kim, S. Y., and Ohtaguchi, K. (1992). Gas holdup and\nvolumetric liquid-phase mass transfer coefficient in a gel-particle suspended bubble\ncolumn with draught tube. Journal of Chemical Engineering of Japan 25, 11-16.\nKrampe, J., and Krauth, K. (2003). Oxygen transfer into activated sludge with high\nMLSS concentrations. Water Science and Technology 47, 297-303.\nKraume, M., Bracklow, U., Vocks, M., and Drews, A. (2005). Nutrients removal in\nMBRs for municipal wastewater treatment. Water Science & Technology 51, 391-\n402.\nLee, W., Kang, S., and Shin, H. (2003). Sludge characteristics and their contribution\nto microfiltration in submerged membrane bioreactors. Journal of Membrane Science\n216, 217-227.\nMueller, J. A., Boyle, W. C., and Popel, H. J. (2002). \"Aeration: principles and\npractice.\" CRC Press, Boca Raton, USA.\nMuller, E. B., Stouthamer, A. H., Vanverseveld, H. W., and Eikelboom, D. H. (1995).\nAerobic Domestic Waste-Water Treatment in a Pilot-Plant With Complete Sludge\nRetention by Cross-Flow Filtration. Water Research 29, 1179-1189.\nOzbek, B., and Gayik, S. (2001). The studies on the oxygen mass transfer coefficient\nin a bioreactor. Process Biochemistry 36, 729-741.\nRosenberger, S. (2003). Charakterisierung von belebtem Schlamm in\nMembranbelebungsreaktoren zur Abwasserreinigung, Dissertation, TU Berlin,\nFortschr.-Ber. VDI Reihe 3 Nr. 769, VDI-Verlag, Düsseldorf.\n20\nStephenson, T., Judd, S. J., Jefferson, B., and Brindle, K. (2000). \"Membrane\nBioreactors for Wastewater Treatment.\" IWA Publishing, London, UK.\nvan der Roest, H., Leenen, J., Hofstra, M., Boeve, J., and van der Vlist, J. (2001). The\nDutch contribution to the MBR development in perspective. H20, 7-10.\nVan Weert, G., Van Der Werff, D., and Derksen, J. J. (1995). Transfer of O2 from air\nto mineral slurries in a rushton turbine agitated tank. Minerals Engineering 8, 1109-\n1124.\nVerlaan, P., and Tramper, J. (1987). Hydrodynamics, axial dispersion and gas-liquid\noxygen transfer in an airlift-loop bioreactor with three-phase flow. In \"International\nConference on Bioreactors and Biotransfomations\", pp. 363-373, Elsevier, London\nUK.\nWEF, and ASCE. (2001). \"Aeration-A wastewater treatment process.\" Water\nEnvironment Federation, New York, USA.\nWingender, J., Flemming, H.-C., Neu, T. R. (1999) Introduction - What are bacterial\nextracellular polymeric substances? In: Wingender, J., Neu, T. R., Flemming, H.-C.\n(eds) Microbial extracellular polymeric substances. Springer Verlag, Berlin, pp 1-19.\nZhang, X., Bishop, P. L., and Kinkle, B. K. (1999). Comparison of extraction methods\nin quantifying extracellular polymers in biofilms. Water Science & Technology 39,\n211-218.\n21\nTable 1. Biomass and plant characteristics of the submerged MBR sludges studied.\nPlant A A B C D E F D G G\nMLSS (g.L-1) 7.2 9.3 12.0 13.7 13.9 16.8 17.3 17.9 28.9 30.2\nMLVSS (g.L-1) 5.3 6.9 8.7 10.8 10.4 13.4 13.9 13.2 19.5 19.3\nEPSc (mg.L-1) 111.4 265.5 167.0 184.1 175.3 226.2 201.8 130.1 252.2 154.1\nEPSp (mg.L-1) 711.0 919.7 873.0 874.0 734.5 924.5 1216.0 1222.0 865.0 828.0\nEPSCOD (mg.L-1) 1442 1873 1802 1788 1570 1736 1846 1814 1536 1798\nSMPc (mg.L-1) 4.63 7.00 3.44 15.25 9.94 7.75 9.38 9.75 20.75 8.56\nSMPp (mg.L-1) 4.50 10.00 27.50 25.50 9.50 41.50 61.00 63.00 57.00 22.0\nSMPCOD (mg.L-1) 72 54 72 180 108 198 180 136 106 90\nViscosity @ 12.24 s-1\n(mPa.s)\n13.3 39.8 10.8 75.8 44.6 55.9 99.3 87.6 122.3 213.0\nMMD (m) 88.9 68.0 85.4 62.1 60.9 42.5 80.4 70.2 38.5 43.1\nPlant scale PP PP FS PP FS FS FS FS FS FS\nType of membrane Zenon Zenon Kubota Kubota Kubota Kubota Kubota Kubota Kubota Kubota\nMembrane area (m2) 122 122 7680 5.6 1600 2880 320 1600 60 60\nPP: pilot plant scale; FS: full scale;\nc\n: carbohydrate;\np\n: protein.\n22\nTable 2. Pearson-r correlation matrix of the characteristics of the biomass studied for\ntheir impact on oxygen transfer.\nMLVSS SMPCOD EPSCOD SMPp EPSp SMPc EPSc MMD Viscosity\nMLSS 0.98 0.36 -0.11 0.78 0.31 0.80 0.41 -0.70 0.86\nMLVSS 0.51 -0.02 0.83 0.40 0.78 0.41 -0.70 0.89\nSMPCOD 0.28 0.55 0.46 0.32 0.06 -0.38 0.53\nEPSCOD 0.31 0.69 -0.19 0.28 0.13 0.11\nSMPp 0.80 0.44 0.14 -0.30 0.80\nEPSp 0.05 0.03 0.09 0.55\nSMPc 0.41 -0.70 0.84\nEPSc -0.63 0.37\nMMD -0.55\n23\nTable 3. Beta coefficients and statistical significance parameters obtained by\nregression analysis for kLa20.\nMLSS -0.66\naeration 0.56\nEPSc 0.33\nCODSMP -0.31\nR2 80%\nF F(4,39)=38.9\np-level <0.001\n24\nTable 4. Beta coefficients and statistical significance parameters obtained by\nregression analysis for -factor.\nMLSS -0.75\nCODSMP -0.40\nEPSc 0.38\naeration 0.21\nR2 89%\nF F(4,39)=91.2\np-level <0.001\n"}