{"doi":"10.1017\/S1755691007000035","coreId":"65988","oai":"oai:dro.dur.ac.uk.OAI2:3784","identifiers":["oai:dro.dur.ac.uk.OAI2:3784","10.1017\/S1755691007000035"],"title":"Peat initiation in the Faroe Islands : climate or people ?","authors":["Lawson,  I. T.","Church,  M. J.","Edwards,  K. J.","Cook,  G. T","Dugmore,  A. J"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03-01","abstract":"As an isolated island group lying off the NW European mainland which was uninhabited until the mid-first millennium AD, the Faroes offer a unique opportunity to study natural processes of Holocene ecosystem development in a region where anthropogenic activity is usually a complicating factor. In this paper new radiocarbon dates and pollen-analytical data from the island of Sandoy, in the centre of the Faroes archipelago, are presented. Together with existing pollen and plant macrofossil records, these data allow a reconstruction of patterns of Holocene vegetational and edaphic change. Basal peat dates indicate that large areas of blanket mire were established long before the first human settlement, demonstrating conclusively that human impact is not necessary for the development of such ecosystems. The timing of the initiation of the blanket peats varies markedly, both across the Faroes as a whole and at a landscape scale, with dates distributed evenly over 9000 years. This suggests that, in the Faroes at least, pedogenesis was more important than climatic change in determining the timing of the spread of blanket peat systems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65988.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3784\/1\/3784.pdf","pdfHashValue":"5dad2da2ddf9b50b48ca92e62f11d76afcd79384","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3784<\/identifier><datestamp>\n      2011-08-31T08:30:53Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Peat initiation in the Faroe Islands : climate or people ?<\/dc:title><dc:creator>\n        Lawson,  I. T.<\/dc:creator><dc:creator>\n        Church,  M. J.<\/dc:creator><dc:creator>\n        Edwards,  K. J.<\/dc:creator><dc:creator>\n        Cook,  G. T<\/dc:creator><dc:creator>\n        Dugmore,  A. J<\/dc:creator><dc:description>\n        As an isolated island group lying off the NW European mainland which was uninhabited until the mid-first millennium AD, the Faroes offer a unique opportunity to study natural processes of Holocene ecosystem development in a region where anthropogenic activity is usually a complicating factor. In this paper new radiocarbon dates and pollen-analytical data from the island of Sandoy, in the centre of the Faroes archipelago, are presented. Together with existing pollen and plant macrofossil records, these data allow a reconstruction of patterns of Holocene vegetational and edaphic change. Basal peat dates indicate that large areas of blanket mire were established long before the first human settlement, demonstrating conclusively that human impact is not necessary for the development of such ecosystems. The timing of the initiation of the blanket peats varies markedly, both across the Faroes as a whole and at a landscape scale, with dates distributed evenly over 9000 years. This suggests that, in the Faroes at least, pedogenesis was more important than climatic change in determining the timing of the spread of blanket peat systems.<\/dc:description><dc:subject>\n        Blanket peat<\/dc:subject><dc:subject>\n         Holocene<\/dc:subject><dc:subject>\n         Norse<\/dc:subject><dc:subject>\n         Pollen<\/dc:subject><dc:subject>\n         Radiocarbon.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Earth and environmental science transactions : Royal Society of Edinburgh, 2007, Vol.98(1), pp.15-28 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3784<\/dc:identifier><dc:identifier>\n        issn:0263-5933<\/dc:identifier><dc:identifier>\n        issn: 1473-7116<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S1755691007000035<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3784\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S1755691007000035<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3784\/1\/3784.pdf<\/dc:identifier><dc:rights>\n        This paper has been published by Cambridge University Press in \"Earth and environmental science transactions : Royal Society of Edinburgh.\" (98: 1 (2007) 15-28)  http:\/\/journals.cambridge.org\/action\/displayJournal?jid=TRE#. © 2007 Cambridge University Press\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1473-7116","0263-5933"," 1473-7116","issn:0263-5933"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Blanket peat","Holocene","Norse","Pollen","Radiocarbon."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 December 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLawson, I. T. and Church, M. J. and Edwards, K. J. and Cook, G. T and Dugmore, A. J (2007) ’Peat\ninitiation in the Faroe Islands : climate or people ?’, Earth and environmental science transactions : Royal\nSociety of Edinburgh., 98 (1). pp. 15-28.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S1755691007000035\nPublisher’s copyright statement:\nThis paper has been published by Cambridge University Press in ”Earth and environmental science transactions :\nRoyal Society of Edinburgh.” (98: 1 (2007) 15-28) http:\/\/journals.cambridge.org\/action\/displayJournal?jid=TRE.\n2007 Cambridge University Press\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n01 December 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLawson, I. T. and Church, M. J. and Edwards, K. J. and Cook, G. T and Dugmore, A. J (2007) 'Peat initiation\nin the Faroe Islands : climate or people ?', Earth and environmental science transactions : Royal Society of\nEdinburgh., 98 (1), pp.\u000015-28.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1017\/S1755691007000035\nPublishers copyright statement:\nThis paper has been published by Cambridge University Press in \"Earth and environmental science transactions\n: Royal Society of Edinburgh.\" (98: 1 (2007) 15-28)  http:\/\/journals.cambridge.org\/action\/displayJournal?jid=TRE#.\n© 2007 Cambridge University Press\u0000\u0000\nPeat initiation in the Faroe Islands: climate\nchange, pedogenesis or human impact?\nIan T. Lawson1, Mike J. Church2, Kevin J. Edwards3, Gordon T. Cook4\nand Andrew J. Dugmore5\n1 Earth and Biosphere Institute, School of Geography, University of Leeds, Leeds, LS2 9JT, UK.\n2 Department of Archaeology, Durham University, South Road, Durham, DH1 3LE, UK.\n3 Departments of Geography & Environment and Archaeology, University of Aberdeen,\nElphinstone Road, Aberdeen, AB24 3UF, UK.\n4 Scottish Universities Environmental Research Centre, Radiocarbon Dating Laboratory,\nScottish Enterprise Technology Park, East Kilbride, G75 0QF, UK.\n5 Institute of Geography, School of GeoSciences, University of Edinburgh, Drummond Street,\nEdinburgh, EH8 9XP, UK.\nABSTRACT: As an isolated island group lying off the NW European mainland which was\nuninhabited until the mid-first millennium AD, the Faroes offer a unique opportunity to study\nnatural processes of Holocene ecosystem development in a region where anthropogenic activity is\nusually a complicating factor. In this paper new radiocarbon dates and pollen-analytical data from\nthe island of Sandoy, in the centre of the Faroes archipelago, are presented. Together with existing\npollen and plant macrofossil records, these data allow a reconstruction of patterns of Holocene\nvegetational and edaphic change. Basal peat dates indicate that large areas of blanket mire were\nestablished long before the first human settlement, demonstrating conclusively that human impact is\nnot necessary for the development of such ecosystems. The timing of the initiation of the blanket\npeats varies markedly, both across the Faroes as a whole and at a landscape scale, with dates\ndistributed evenly over 9000 years. This suggests that, in the Faroes at least, pedogenesis was more\nimportant than climatic change in determining the timing of the spread of blanket peat systems.\nKEY WORDS: blanket peat, Holocene, Norse, pollen, radiocarbon.\nThe Faroe Islands represent an unusual opportunity to study\nnatural vegetation change over Holocene timescales. As an\nisolated archipelago in the North Atlantic, the vegetation\ncommunities of the Faroes are broadly analogous to other\noceanic communities in NW Europe, albeit that the flora is a\nsmall sub-set of the European one. Wet grassland and mire\ncommunities prevail, and there are no remaining native tree\npopulations (Fosaa 2001). The archaeological consensus is\nthat the islands are unlikely to have been inhabited until the\nmid-first millennium AD (Arge 1991, 1993; Debes 1993; Arge\net al. 2005). There have been no firm indications of human\npresence from earlier periods, either in the archaeological or\npalaeoecological records (cf. the situation in the Northern\nand Western Isles of Scotland: Bennett et al. 1992; Edwards\n1996; Hannon et al. 2005). Although there is mention of a\nprior presence of small numbers of Christian hermits in De\nmensura orbis terrae, written in 825 AD by the Irish monk\nDicuil, supported by a growing body of palaeoenvironmental\nevidence (e.g. Hannon & Bradshaw 2000; Edwards et al.\n2005; but see Thorsteinsson 2005), the oldest unequivocal\narchaeological traces are those of the Norse who probably\narrived in the first half of the ninth century (Vickers et al.\n2005; Church et al. 2005). Jo´hansen’s (1986–87) claim that\nthe pollen grains of the weed Plantago lanceolata (ribwort\nplantain) indicate a prehistoric human presence as long ago\nas 2300 BC are now considered to be untenable (Edwards\n2005). Faroese ecosystems may therefore be presumed to\nhave developed free from anthropogenic influence for most\nof the Holocene.\nThese circumstances make the Faroes a useful laboratory in\nwhich to improve our understanding of a long-standing palae-\noecological problem, that of when and how blanket peat forms\n(Moore 1973, 1993; Edwards & Hirons 1982). Blanket peat\nlandscapes consist of a complex of different mire types (Char-\nman 2002), including terrestrialised basins (filled with ‘primary\npeat’, in the terminology of Moore & Bellamy (1973), and\nsometimes capped and surrounded by ‘secondary peat’ affected\nby the raised groundwater associated with primary peat for-\nmation), as well as peat growing more widely on flat and\nsloping land surfaces above the influence of groundwater\n(‘tertiary peat’). In oceanic or mountainous areas, high rainfall\nover centuries or millennia may lead to progressive leaching,\nacidification and waterlogging (paludification) of soils, inhib-\niting the decay of organic matter and encouraging the spread\nof blanket peat (Moore 1973; Charman 2002). It has been\nsuggested that discrete episodes of blanket peat expansion may\nrelate to climatic events, or to step-like transitions, involving\nincreased precipitation and\/or lower temperatures (e.g.\nConway 1954; Tallis 1991; Ellis & Tallis 2000). On the other\nhand, numerous palaeoecological studies, from the British Isles\nand Norway in particular, have found indications that blanket\npeat initiation is often related to human impact. For example,\ncharcoal from burning is thought to block soil pores and\nimpede drainage (e.g. Mallik et al. 1984; Smith & Cloutman\n1988; Charman 1992). Deforestation can likewise alter the\nhydrological balance of soils (e.g. Moore 1973), although this\nis not relevant in the Faroes, where there has never been any\nextensive woodland (Jo´hansen 1985). The three primary\nEarth and Environmental Science Transactions of the Royal Society of Edinburgh, 98, 15–28, 2007\n\u0001 2007 The Royal Society of Edinburgh. doi:10.1017\/S1755691007000035\ndrivers of peat initiation, gradual pedogenesis, climate change,\nand human impact, are difficult to separate without indepen-\ndent evidence, hence the value of studying peatland develop-\nment in a situation such as the Faroes where one of these\nfactors can be ruled out for most of the Holocene.\n1. Study area\nThe Faroe Islands (Fig. 1) consist of 18 sizeable islands\n(Streymoy, the largest, has maximum dimensions of 48 by\n12 km) formed of near-horizontally bedded Tertiary flood\nbasalts and intercalated tuffs, which gives a very characteristic,\nstepped, mountainous terrain. The climate is extremely\noceanic, with mean July\/August temperatures of 11(C and\nmean February temperatures of 4(C; precipitation, concen-\ntrated in the winter, is around 1400 mm y\u00021 close to sea level\nat To´rshavn (Jo´hansen 1985, p. 13). Glacial drift deposits left\nby extensive Weichselian (approximately, Marine Isotope\nStages 2 to 5d) ice sheets occur throughout the islands\n(Humlum & Christiansen 1998a). Pollen data indicate that\nearly Holocene soils supported, successively, fell-field then tall\nherb\/grasslands, and probably had a high base-status (e.g.\nJo´hansen 1975, 1982, 1985; Hannon et al. 2003).\nToday, soil characteristics vary considerably according to\naltitude and slope angle. Wet mires occur in valleys and basins,\noften capping the deposits of former lakes. Peats also occur\non gentle slopes, grading into more inorganic ‘peaty soils’\n(Jo´hansen 1985) on steeper slopes. At higher altitudes and on\nvery steep slopes, where erosional processes are active and\ngrowth rates lower, soils are more minerogenic (Jo´hansen\n1985; Humlum & Christiansen 1998b; Fosaa 2001). This\ngradation requires care in the identification of soil materials as\npeat. Here, we define peats as having an organic content of\n65% (dry weight) or more, following Charman (2002, p. 4).\nImplicit to this definition is the understanding that such\norganic soils are likely to be very wet, acidic and nutrient poor,\nand will tend to accumulate upwards in the absence of physical\nerosion. Most of the peat sequences studied here achieve much\nhigher organic contents, but some appear to have had some\ninput of inorganic material through slopewash and\/or aeolian\ntransport.\nThis study has two principal aims. The first is to test the\n(null) hypothesis that the spread of blanket peat across parts of\nSandoy occurred as a result of human activity, e.g. by burning,\ndeforestation or shrub clearance, or trampling by introduced\nanimals. A key, testable prediction of this hypothesis is that at\nleast some peat sequences should be younger than c. AD 800.\nThe alternative hypothesis is that blanket peat initiation\noccurred through natural processes alone. The second aim is\nto provide a more generalised account of the spatio-temporal\npattern of peat development, and associated environmental\nchange, in the Faroe Islands, particularly in relation to the\nrelative contributions of gradual pedogenesis and climatic\nchange to the spread of blanket peat.\nTo address these aims, a study area of approximately 2 km2\nwas selected on the island of Sandoy (Figs 1 and 2) where a\nlarge area of blanket peat extends across a wide valley, glacial\nin origin, around Sto´ravatn and Lı´tlavatn (literally ‘large lake’\nand ‘small lake’). The valley floor runs from about 25 m above\nsea level (asl) at its western end, where it terminates in cliffs at\nthe coast, to about 75 m asl at the watershed with the next\nvalley to the east. The valley is surrounded by steep, stepped\nslopes, with surrounding peaks between c. 400 and 480 m asl;\nsoils on the steep slopes are thinner and more minerogenic\nthan the thick peats on the floor of the valley, which range up\nto more than a metre in thickness. At one location at least\n(Millum Vatna, literally ‘between the lakes’) the peats are\nunderlain by limnic sediments rather than the more usual\nregolith. Numerous streams and rivers carry water and sedi-\nment down from the surrounding hills; the primary drainage\nsystem runs through the two lakes and terminates in a water-\nfall at the coastal cliffs. The vegetation on the peats consists of\na mosaic of communities, with Carex, Sphagnum and Eriopho-\nrum angustifolium dominating in the wettest areas, and Calluna\nvulgaris, Potentilla erecta, Nardus stricta, Festuca vivipara\nand other grasses on drier peats. Grass moorland vegetation\ndominates on more minerogenic soils (Fosaa 2001). There is\nevidence of peat cutting in the past, but today the valley and\nsurrounding hills are primarily used for rough grazing. Known\narchaeological remains are limited to a number of ruined walls\nor field banks and several structures that may have been\nshielings or for stock control (Lawson et al. 2005).\nInvestigation of the palaeoecology of the Faroes was pio-\nneered by Jo´hansen (1971, 1975, 1982, 1985), who produced\npollen diagrams from a number of lake and mire sites, as well\nas radiocarbon dates of several basal (oldest) peat samples.\nFurther work has since been published by other authors\n(Edwards & Craigie 1998; Edwards et al. 1998, 2005; Hannon\net al. 1998, 2001, 2003, 2005; Hannon & Bradshaw 2000;\nLawson et al. 2005; Vickers et al. 2005). The present study\ndiffers in being the first study focused on reconstructing the\nhistory of peat expansion at a landscape scale, and in present-\ning the first data pertaining to this issue from the island of\nSandoy. This study also approximately doubles the number of\navailable estimates of peat initiation dates in the Faroes.\n2. Methods\nTen sections through the peat to the underlying mineral\nregolith were taken, either using monolith tins or a\nFigure 1 Location map showing the Faroes, with the island of\nSandoy and sites mentioned in the text.\n16 IAN T. LAWSON ET AL.\nRussian-type corer (Jowsey 1966), with sections labelled\n(discontinuously) Lı´t-2 to Lı´t-16 (additional sections described\nin the field were not subjected to laboratory analysis and\ndating). Only the section in each sequence spanning the\ntransition between regolith and peat was analysed in detail.\nSites were chosen along two rough transects running along and\nacross the study area, making use of natural sections wherever\npossible and avoiding topographic depressions where the basal\norganic deposits might not be blanket peats. Lı´t-2 is excep-\ntional in representing a sequence of alluvial fan deposits with\ninterbedded peats. Following laboratory description, contigu-\nous 1 cm3 samples were analysed for loss-on-ignition (LOI) at\n450(C to constant weight (Dean 1974; Heiri et al. 2001).\nHorizons for radiocarbon dating were selected using the LOI\ndata as a guide, identifying the level at which values first\nreached sustained high values (always >65% and usually\nc. 90%). A case could be made for taking the dates from\nslightly lower horizons in some cases – for example, at the\npoint where Charman’s (2002) threshold of 65% was first\nachieved – but, under the present criteria, horizons for dating\nwere selected conservatively in the sense that any inaccuracy\nwould tend to underestimate the age of peat initiation (reduc-\ning the likelihood of falsely rejecting the null hypothesis). Peat\nor sediment samples of 1 cm3 were taken for radiocarbon\ndating, from which the humic acid fraction was extracted and\nAMS-dated at SUERC in East Kilbride, UK. Calibrations\nwere performed using OxCal version 3.10 (Bronk Ramsey\n1995, 2001) with the IntCal98 calibration data set (Stuiver\net al. 1998); calibrated age ranges are quoted using 2\u0001\nconfidence intervals.\nSamples were analysed for pollen across the regolith-peat\nboundary in nine of the sequences in order to assess the\nrelationship between peat initiation and vegetation change,\nand spatial variability in vegetation histories across the catch-\nment. Samples were 1 cm3 in volume and contiguous across the\nregolith-peat boundary. In some cases the regolith material\nproved to be palynologically sterile.\nPeats and soils generally have small effective pollen source\nareas, with much of their explanatory power restricted to\nwithin a few metres of the sampling site (Bunting 2003),\nwhereas lakes recruit pollen from wider areas (Jacobson &\nBradshaw 1981). Two lake sites were accordingly selected in\norder to determine the landscape-scale pattern of Holocene\nenvironmental change. Cores were taken from open water\nusing Russian corers from Lı´tlavatn (core designated\nLı´t-20) and from Gro´thu´svatn, a lake situated 5 km WNW of\nLı´tlavatn. Amongst other analyses (Lawson et al. 2005), LOI\nand pollen data were generated for both sequences, supported\nby radiocarbon dating.\nPollen preparations followed a standard technique as out-\nlined by Bennett & Willis (2002, omitting steps 2, 4, 5, 6, and\n9) using Lycopodium tablets as a source of exotic markers and\nsilicone oil as a mounting medium. Samples were counted to a\ntotal exceeding 300 (Lı´tlavatn Lı´t-20 lake sequence and short\npeat sequences) or 500 (Gro´thu´svatn) terrestrial pollen grains,\nexcluding spores, aquatics, and alien taxa. Pollen nomencla-\nture follows Bennett et al. (1994), except where the limited\nflora of the Faroes allows an increase in taxonomic precision\n(Fosaa 2000). Most non-native taxa, including all trees except\nBetula pubescens, were excluded from the total land pollen\nFigure 2 Map showing the spatial distribution of basal peat dates from the area around Lı´tlavatn. Dates are in\n14C yr BP with 1\u0001 confidence intervals; the area of each circle is proportional to its 14C age, with the exact\nlocation of the date indicated by a dot in the centre of each circle. The location of the lake core Lı´t-20 is also\nshown. Inset shows the study area in the context of the island of Sandoy; Gro´thu´svatn is also marked.\nPEAT INITIATION IN THE FAROE ISLANDS 17\n(TLP) sum. A small number of occasional pollen and spore\ntaxa which might reasonably be expected to have occurred in\nthe past, but which are not listed in Fosaa (2000), were\nincluded in the calculations. Those taxa are: Chrysosplenium,\nDrosera intermedia, Erica tetralix, Limonium vulgare, Myrrhis\nodorata, Nymphaea alba, and Pteridium aquilinum.\n3. Results and initial interpretations\n3.1. Short peat\/regolith sections and basal peat dates\nFigure 2 shows the spatial variation in the age of the basal\nblanket peats sampled at the ten sites around Lı´tlavatn, and\ndetails of the dates are given in Table 1. The dates range\nfrom 5585\u000340 to 1270\u000335 14C BP (6450–6290 and 1290–\n1080 cal BP, respectively). There is no clear spatial pattern in\nthe ages. The youngest date falls just within the period of\nNorse occupation, and it is possible that older peat has been\nmined from this site, although care was taken to avoid\nsampling in areas that showed signs of disturbance. Even\ntaking a very conservative view by rejecting the two youngest\ndates, and accepting the younger of the two dates from Lı´t-7 as\nthe age of true peat initiation at this site, the period of peat\ninitiation can be seen to have spanned almost 2000 years. With\na sample size as small as ten, it is entirely possible that older\nand younger basal peats have escaped sampling, and the true\nspan of the period of peat initiation could be larger.\nFigure 3 shows LOI data together with pollen percentage\ncurves for Calluna vulgaris and Empetrum nigrum, two species\nwhich are abundant on blanket peats today (Fosaa 2001). The\nstratigraphic locations of the radiocarbon dates are also\nshown. The Lı´t-2 sequence, which includes several distinct\nbands of alluvial material, was not analysed for pollen owing\nto the strong possibility of reworking. LOI curves in general\nshow a rapid transition over 2–3 cm from low (5–20%) to high\n(c. 90%) values. In some cases the transitions as defined in the\nloss-on-ignition data did not correspond exactly with visual\ndescriptions of the sections; samples with around 50% LOI\nwere difficult to distinguish visually from more organic peats,\nwhich underlines the importance of using LOI data to identify\nbasal peats. In three cases (Lı´t-2, Lı´t-7 and Lı´t-11) there are\nreversals in the LOI curves, perhaps due to slopewash, and in\nthree further cases (Lı´t-13, Lı´t-14 and Lı´t-15) the LOI values of\nthe peats fluctuate markedly.\nVegetational responses to peat initiation vary substantially\nfrom site to site. This is less clear in some sequences than in\nothers, partly due to a lack of data in some instances owing to\nthe absence of pollen in the regolith. In most cases, however,\nan increase in Calluna and\/or Empetrum can be seen to\naccompany peat initiation. The relative importance of these\ntwo taxa varies considerably; for instance, in the uppermost\nsamples in Lı´t-3, Calluna contributes about 30% TLP and\nEmpetrum around 10%; in Lı´t-16 the proportions are 10–15%\nand 25%, respectively. In the better-developed datasets, the\nrelative timing of LOI and pollen changes can be seen to vary:\nin Lı´t-3, the expansion of Calluna is preceded by the rise in\nLOI values; in Lı´t-6 and Lı´t-7, the two are more or less\nsynchronous; the limited data from Lı´t-12 appear to show that\nCalluna values are high 2 cm below the rise in LOI values.\nPollen diagrams showing a wider range of taxa from three of\nthe sites (Fig. 4) reinforce the impression that, on a small scale,\nthe landscape consisted of a mosaic of vegetation types, both\nbefore and after peat initiation. For example, Lı´t-3 contains\nvery high values of Nymphaea alba pollen in the regolith\nmaterial towards the base of the studied section, indicating\nthat the site was close to open water; Salix, Poaceae and\nCyperaceae were also locally important. The peat overlying the\nregolith in Lı´t-3 remains rich in Poaceae and Cyperaceae\nTable 1 AMS radiocarbon dates from Sandoy sequences. Dates from peats were carried out on the humic fraction;\nthose from lake sediments were based on the bulk sample following an acid wash. All samples were based on 1 cm3 of\nmaterial. Dates from the lake sequences are reported in Lawson et al. (2005). c.i.=confidence interval\nCode Site and sample \u000213C 14C yr BP (and 1\u0001 c.i.) Cal yr BP (2\u0001 c.i.)\nSUERC-757 Lı´t-2 16–17 cm \u000230·7 360\u000340 510–310\nSUERC-759 Lı´t-2 36–37 cm \u000228·6 1380\u000340 1370–1180\nSUERC-2363 Lı´t-2 86–87 cm \u000228·0 3225\u000335 3560–3370\nSUERC-2364 Lı´t-2 119–120 cm \u000227·8 4955\u000350 5890–5590\nSUERC-166 Lı´t-3 39–40 cm \u000228·2 4330\u000340 5040–4830\nSUERC-167 Lı´t-6 41–42 cm \u000227·7 4425\u000335 5280–4870\nSUERC-168 Lı´t-7 97–98 cm \u000227·7 4555\u000335 5440–5050\nSUERC-169 Lı´t-7 104–105 cm \u000227·7 5585\u000340 6450–6290\nSUERC-170 Lı´t-11 36–37 cm \u000227·9 3580\u000340 3990–3720\nSUERC-171 Lı´t-12 36–37 cm \u000227·9 4990\u000340 5890–5600\nSUERC-178 Lı´t-13 42–43 cm \u000228·0 1805\u000335 1830–1610\nSUERC-179 Lı´t-14 35–36 cm \u000228·3 3135\u000340 3450–3260\nSUERC-180 Lı´t-14 40–41 cm \u000228·4 3265\u000340 3580–3390\nSUERC-181 Lı´t-15 42–43 cm \u000228·4 4045\u000340 4800–4410\nSUERC-182 Lı´t-16 20–21 cm \u000227·7 1270\u000335 1290–1080\nSUERC-1821 Lı´t-20 126–127 cm \u000227·5 2980\u000335 3330–3030\nSUERC-1826 Lı´t-20 157–158 cm \u000226·8 2125\u000340 2310–1990\nSUERC-1827 Lı´t-20 200–201 cm \u000225·0 4200\u000335 4850–4610\nSUERC-9013 Lı´t-20 233–234 cm \u000225·0 4755\u000335 5590–5330\nSUERC-1828 Lı´t-20 300–301 cm \u000222·1 7430\u000345 8360–8170\nSUERC-1829 Gro´t 248–249 cm \u000227·2 2955\u000340 3260–2970\nSUERC-1830 Gro´t 271–272 cm \u000227·3 3050\u000340 3370–3150\nSUERC-11079 Gro´t 325–326 cm \u000227·7 2525\u000335 2750–2470\nSUERC-11080 Gro´t 372·5–373·5 cm \u000227·6 2750\u000335 2950–2770\nSUERC-11514 Gro´t 452·5–453·5 cm \u000227·2 3595\u000335 3990–3730\n18 IAN T. LAWSON ET AL.\nF\nig\nur\ne\n3\nD\nat\na\nfr\nom\nth\ne\nni\nne\nsh\nor\nt\npe\nat\nco\nre\ns\nfr\nom\nth\ne\nL\nı´t\nla\nva\ntn\nst\nud\ny\nar\nea\n,s\nho\nw\nin\ng\nlo\nss\n-o\nn-\nig\nni\nti\non\nda\nta\n,p\nol\nle\nn\npe\nrc\nen\nta\nge\nda\nta\nfo\nr\nC\nal\nlu\nna\nvu\nlg\nar\nis\nan\nd\nE\nm\npe\ntr\num\nni\ngr\num\n,a\nnd\nth\ne\nst\nra\nti\ngr\nap\nhi\nc\nlo\nca\nti\non\nof\nth\ne\nra\ndi\noc\nar\nbo\nn-\nda\nte\nd\nsa\nm\npl\nes\n.\nL\nos\ns-\non\n-i\ngn\nit\nio\nn\nda\nta\nan\nd\nra\ndi\noc\nar\nbo\nn\nda\nte\ns\nar\ne\nal\nso\nsh\now\nn\nfo\nr\nL\nı´t\n-2\n.\nPEAT INITIATION IN THE FAROE ISLANDS 19\npollen, but with large amounts of Calluna and lesser amounts\nof Juniperus, Empetrum and Potentilla. Nymphaea and Poten-\ntilla are both absent in the regolith material from Lı´t-6, but the\npollen assemblages from the peat are similar to those of Lı´t-3.\nLı´t-16, on the other hand, has much higher values of Em-\npetrum and Potentilla pollen in the peat. Assuming that peat\naccumulation was steady and that there has been no vertical\nmovement in the pollen (cf. Clymo & Mackay 1987; Moore\net al. 1991), these highly localised pollen assemblages appear to\nhave persisted at individual sites for several centuries, implying\nconsiderable inertia in the vegetation patches.\nApart from the selected pollen data shown here, there are a\nnumber of additional notable finds worthy of comment. One\nsample from Lı´t-14 contained large amounts of Betula pubes-\ncens pollen (14·7% at 106–107 cm in Lı´t-7; B. pubescens was\ndifferentiated from B. nana by size measurements (cf. Ma¨kela¨\n1996; Caseldine 2001)), presumably indicating local presence,\nas has been attested by macrofossil finds of tree birch elsewhere\nin the Faroes (cf. Malmros 1990, 1994), though not previously\non Sandoy. The fact that only one of the 66 samples analysed\nhere gave such high values (the next highest value was 3·8% at\n41–42 cm in Lı´t-12, and the mean value across all samples\nFigure 4 Selected taxa pollen percentage diagrams for three of the short peat cores, showing trends in the\ndominant taxa. In the diagram for Lı´t-3, Nymphaea alba percentages are calculated relative to a main sum\nincluding TLP and aquatic taxa.\n20 IAN T. LAWSON ET AL.\n1·5%) suggests that tree birch was not abundant in the\nlandscape. Other taxa which are occasionally, but not usually,\nabundant include Betula nana (maximum 6·2% at 47–48 cm in\nLı´t-6, mean across all samples 1·1%), Plantago major (4·5% at\n100–101 cm in Lı´t-7\/mean 0·5%), Potentilla (37·6% at 35–\n36 cm in Lı´t-11\/mean 3·1%), and Sedum (32·9% at 106–107 cm\nin Lı´t-7\/mean 1·3%), together reinforcing the notion that there\nwas considerable spatial heterogeneity among the vegetation\ncommunities. Today Sphagnum is locally dominant in the\nwettest areas of the mire, but Sphagnum spores are rare in all of\nthe pollen samples studied from the short cores (maximum\n1·1% at 43–44 cm in Lı´t-13), which perhaps indicates that the\necosystems on the thin early peats were not truly ombrotrophic\nbut received some nutrients from the regolith. Occasional finds\nof charcoal were made in only five samples, at low values\n(maximum 0·9% at 35–36 cm in Lı´t-12, mean 0·04%), which\ncan probably be attributed to long-distance transport rather\nthan local burning, although natural fires ignited by lightning\nstrikes cannot be ruled out.\n3.2. Lake sequences\nSelected-taxa pollen diagrams are shown from Lı´tlavatn (lake\nsequence, Lı´t-20) and Gro´thu´svatn (Fig. 5; cf. Lawson et al.\n2005). Relatively poor pollen preservation suggests that much\nof the pollen entering these lakes does so via the streams that\nfeed them, or via slopewash, and therefore their pollen assem-\nblages should reflect, to some degree, the vegetation across\ntheir hydrological catchments. Although similar in area (both\nc. 500 ha), the catchments vary in character. That of Lı´tlavatn\nincludes large areas above 200 m asl and one flank of the\nisland’s highest peak (479 m), so its pollen record should\nrepresent to a large degree changes on the high ground above\nthe blanket peat-filled valley in which the lake itself is situated.\nSteep slopes and alluvial fans are common, and the main river\nfeeding Lı´tlavatn is sizeable and fast-flowing, suggesting con-\nsiderable capacity for sediment transport. The Gro´thu´svatn\ncatchment is generally lower (Gro´thu´svatn itself is approxi-\nmately at sea level) and less rugged, and the main inflow to the\nlake is much smaller and slower.\nThe Lı´tlavatn sequence is supported by five radiocarbon\ndates, the uppermost of which is out of chronostratigraphic\nsequence, presumably reflecting the inclusion of reworked\ncarbon from the catchment (cf. Edwards & Whittington 2001).\nIn view of this, the remaining four dates should be treated as\nmaximum age estimates. The curve showing the number of\ndegraded TLP grains indicates the proportion of pollen grains\nshowing signs of physical and chemical degradation. Changes\nin the proportion of degraded pollen in a sequence are usually\ntaken to indicate changes in the input of reworked catchment\nsoils together with the pollen they contain (e.g. Cushing 1964,\n1967; Havinga 1967; Wilmshurst & McGlone 2005). Compari-\nson between the lake samples in zones Lı´t-20-2 and Lı´t-20-4,\nwhere pollen preservation is particularly poor, and the samples\nfrom the mineral soils at the base of the short peat sequences\npresented above, supports this interpretation: there is a strong\nsimilarity in the degraded appearance of the grains, and a\ndominance of Poaceae pollen in both sets of samples. Zones\nLı´t-20-2 and Lı´t-20-4 are therefore probably strongly affected\nby reworking of soils and are unrepresentative of catchment\nvegetation. The remaining zones show better preservation,\nbut some contribution from reworking cannot be ruled out\nanywhere in the sequence.\nUnderlying the reworking signal, however, are coherent\nchanges in the pollen assemblages which we interpret as\nreflecting changes in catchment vegetation. In zone Lı´t-20-1\n(approximately 9000–5000 cal BP, based on linear interpola-\ntion between the dates) there is very little Calluna vulgaris\npollen, suggesting that it was not as abundant in the catchment\nat this time as later (during zone Lı´t-20-3, where it peaks at\n24%). Similar patterns apply to Cyperaceae, Potentilla and\nSphagnum, suggesting that the Calluna cover is a reasonable\nproxy for the extent of blanket mire communities. On this\nbasis, there appears to have been little blanket peat in the\nLı´tlavatn catchment before c. 5000 cal BP at the earliest. Em-\npetrum nigrum, on the other hand, shows a different pattern,\nbeing moderately abundant throughout the record (apart from\nthe reworking phase in Lı´t-20-2). Jo´hansen (1982) found a\nsimilar pattern of abundant E. nigrum in the first half of the\nHolocene in his Hoydalar sequence and interpreted this as\nindicating that the species was growing, not on blanket peats,\nbut on mineral soils. Grasses, together with a wide range of\nherbs, were also relatively more abundant during the earlier\npart of the Holocene. The expansion of blanket peat is\nprobably obscured by the reworking in zone Lı´t-20-2, but we\ncan constrain the date of that expansion to some time after\nc. 5000 cal BP, and to before c. 2200 cal BP.\nThere is no basal radiocarbon date available for the\nGro´thu´svatn sequence, but the lowermost three pollen samples\nhave a characteristic composition dominated by Sedum and\nHuperzia selago. Similar assemblages frequently occur in other\nsequences from the Faroes and have not been dated to younger\nthan 9000 cal BP (Jo´hansen 1982, 1985). The lowermost radio-\ncarbon date, 3990–3730 cal BP at 453 cm, suggests the pres-\nence of a substantial hiatus in deposition at the Gro´t-1\/2\nboundary. Two more radiocarbon dates in stratigraphic\nsequence occur at 373 cm and 325·5 cm. The two remaining\ndates, at 271·5 cm and 248·5 cm, are out of sequence, suggest-\ning that they contain old, reworked carbon from the catchment\npeats and soils.\nThe Gro´thu´svatn data show low values of Calluna vulgaris\nin the earliest zone, Gro´t-1, contrasting with higher values in\nGro´t-2. Calluna shows a sharp expansion at the boundary\nbetween Gro´t-2 and Gro´t-3, coinciding with step-changes in\nother taxa, notably Cyperaceae. The absence of any overlap\nbetween the confidence intervals for the Calluna curve (Fig. 5)\nat this boundary suggests that the pattern is not the result of\nstochastic noise in the data set. Cyperaceae, Potentilla and\nSphagnum increase alongside Calluna, at the expense of\nPoaceae and a variety of herbs, as in Lı´t-20. At the very top\nof the sequence, above 210 cm, five samples show a sustained\ndip in Calluna values and an expansion of Poaceae and\nCyperaceae.\n4. Discussion\n4.1. Timing of peat initiation on Sandoy\nThe basal peat dates from the short sequences around\nLı´tlavatn clearly show that blanket peat began to accumulate\nas early as 5890–5600 cal BP, and leave open the possibility\nthat peat initiation began earlier at sites in the valley that have\nescaped sampling. Peat initiation appears to have continued\nuntil at least 1290–1080 cal BP, i.e. potentially as late as\nAD 870, a few decades after the Norse colonisation (again,\nthere is the possibility that younger peats exist but have not\nbeen sampled). The other dates are quite evenly spread be-\ntween these two limits. Potentially, the very late date could\nbe explained as representing re-growth after peat cutting, but\nthe spread of the dates as a whole suggests that the process of\npeat initiation was genuinely a long drawn-out, discontinuous\nprocess, which is perhaps still continuing.\nThe Lı´t-20 record demonstrates that blanket peats were\nrelatively insignificant in its pollen catchment, which is prob-\nably biased towards the slopes and high ground above the lake\nPEAT INITIATION IN THE FAROE ISLANDS 21\nFigure 5 Selected taxa pollen percentage diagrams for the sequences from Lı´tlavatn (Lı´t-20) and Gro´thu´svatn.\nUnshaded curves show the pollen data for rare taxa with \u000410 exaggeration. Depths are measured below the\nwater surface. Confidence intervals at the 2\u0001 level are shown for the Gro´thu´svatn Calluna vulgaris curve,\nfollowing Maher (1972).\n22 IAN T. LAWSON ET AL.\nitself, before c. 5000 cal BP. The Gro´thu´svatn pollen record\nsuggests that Calluna and accessory taxa representing mire\ncommunities were rare in the early Holocene, but was moder-\nately abundant between c. 3800 cal BP (when sedimentation\nresumed following the hiatus in deposition) and c. 2800 cal BP,\nat which point it expanded sharply. The long-term expansion\nof Calluna is echoed by other mire taxa such as Potentilla and\nSphagnum, but their lower abundance makes it more difficult\nto identify step-changes in their abundance. The timing of\nCalluna expansion is poorly constrained here, but could have\nbegun several thousand years earlier than at Lı´tlavatn, poten-\ntially as early as 9000 cal BP.\nTaken together, these lines of evidence allow us to reject the\nnull hypothesis, that blanket peat spread on Sandoy was\nrelated to human activity; there is only one instance where a\ndate could be interpreted as indicating post-settlement peat\ninitiation. Any human role in aiding the spread of blanket\npeats across the Sandoy landscape is clearly minor.\n4.2. Variation of peat histories across the Faroes\nFigure 6 collates published data on peat initiation from across\nthe Faroes and plots estimates of peat age against time,\nfollowing the approach of Tallis (1991) who undertook a\nsimilar exercise for Wales and northern England. There are a\nnumber of problems with this strategy, reflecting the funda-\nmental difficulty of defining ‘peat initiation’ and identifying\nand dating it in the geological record (cf. Edwards & Hirons\n1982). Firstly, not all of the dates necessarily pertain to blanket\npeat; those marked with a T in Figure 6 are dates resulting\nfrom terrestrialisation of lake basins, with peat accumulating\non top of limnic sediments (‘secondary’ peat, sensu Moore &\nBellamy 1973). In one such case (Hovsdalur) the lowermost\npeat is described in the original publication as ‘fen peat’.\nToday, ‘tertiary’, blanket peats have often encroached on these\nsites, but the mechanisms underlying the change from limnic\nsediments to peat are likely to be substantially different from\nthose underlying the paludification of mineral soils and the\nonset of blanket peat accumulation across whole landscapes.\nSecondly, in some cases, it is not clear that what is referred to\nas ‘peat’ in published work meets Charman’s (2002) definition\nof peat as yielding loss-on-ignition values in excess of 65%. For\nexample, Jo´hansen (1985) described the sequence at the site\n‘East of Uldalı´ð’ as peat, but the published sediment log shows\nthat the material included bands of gravel and clay; and at\nTjørnuvı´k, Hannon & Bradshaw (2000) analysed a lithological\nunit referred to as peat by Jo´hansen (1971) and found LOI\nvalues of only 20–30%. Thirdly, there are the usual uncertain-\nties over the accuracy of radiocarbon dates. Fourthly, in some\ncases (points grouped under ‘pollen evidence’ in Fig. 6) the\nevidence for blanket peat initiation comes principally from the\nbeginning of a rise in Calluna pollen percentages, an indirect\nestimate of blanket peat extent at best, and the beginning of\nthe expansion is sometimes difficult to define and rarely dated\nwith precision. Finally, a number of the estimates for peat\ninitiation are only minimum ages (indicated with dashed lines\nin Fig. 6), where sequences or dates did not extend to the very\nFigure 6 Available estimates for the expansion of blanket peat in the Faroes. Estimates which represent\nminimum ages for peat expansion are shown with a dashed line of arbitrary length to indicate that the uncertainty\nexists. ‘T’ indicates a telmatic situation (see text). References for sources: Argisbrekka: Jo´hansen (1989); East of\nUldalið, Lambi, Havnardalur, Hovi-A, Hoydalar, Hvalba, Saksunardalur (J 1985), Sandur (J 1985): Jo´hansen\n(1985); Heimavatn: Hannon et al. (2005); Korkadalur: Hannon et al. (2001); Saksunardalur (E&C 1998):\nEdwards & Craigie (1998); Sandur (L. et al. 2005): Lawson et al. (2005); Tjørnuvı´k: Jo´hansen (1985) and Hannon\n& Bradshaw (2000); Toftanes: Edwards et al. (1998); Lı´tlavatn and Gro´thu´svatn: this paper.\nPEAT INITIATION IN THE FAROE ISLANDS 23\ndeepest peats, but where we can at least demonstrate that peat\nwas present by a certain time. In short, the new basal peat\ndates presented here make a substantial contribution to a small\nand imperfect data set of peat initiation age estimates, and we\nremain far from having as complete a picture of the pattern of\npeat initiation in space and time across the Faroes as a whole\nas we now have from central Sandoy.\nThere are a number of points, however, which can be made\nfrom Figure 6. The estimates of peat age span more than 9000\nyears, practically the entirety of the Holocene, and the oldest\ndate (from Saksunardalur) is replicated and secure: Edwards &\nCraigie (1998) found peat at Saksunardalur underlying the\nso-called Saksunsarvatn tephra, dated at several sites in the\nFaroes and elsewhere to c. 10 000 cal BP (Wastega˚rd 2002).\nThere is no obvious spatial pattern in the data, although\nif there is any determinism underlying peat initiation, it is\nlikely to operate through small-scale (1–1000 m) variations in\nhydrology or substrate chemistry, given the absence of strong\nclimatic or geological gradients across the Faroes (the dates all\ncome from relatively low-altitude sites, so the effect of altitude\non peat initiation cannot be assessed).\nTallis (1991) undertook his survey of English and Welsh\nbasal peat dates in order to look for evidence of clustering of\npeat initiation events in time. His argument was that if such\nclustering exists, it would suggest that blanket peat initiation is\ndriven by one or more regional events affecting the whole of\nthe study area more or less synchronously, the most likely\ncandidate being a change in climate. (This should be dis-\ntinguished from the positive feedback that might cause rapid\npeat initiation across all or part of a hydrological catchment;\nsee below). Tallis’ (1991) dataset shows little clustering of\ndates, suggesting that local conditions and human activity were\nmore important in determining the timing of peat initiation.\nThe distribution of dates on basal peats from the Faroes in\nFigure 6 shows a concentration of dates between c. 4000 and\n6000 cal BP, which could be taken to imply a climatic forcing\n(cf. Tallis 1991). As the sample size is small, the significance of\nthis clustering was tested by numerical simulation using a\nbootstrapping procedure. With each iteration of the simula-\ntion, 17 ‘dates’ were randomly selected from within the age\nrange of the 19 actual dates, using the two remaining dates\n(Lı´t-16, 1185 cal BP, and Saksunardalur, 9825 cal BP) to de-\nfine the extremities of the sampling space. Minimum ages and\nestimates based on pollen evidence alone were not included in\nthe analysis. The linear nearest neighbour statistic (Young\n1982), which is a measure of clustering of objects or events\nalong a one-dimensional axis (in this case, time), was calcu-\nlated for the simulated set of dates. A total of 73·3% of 105\niterations of this simulation produced more clustered samples\n(a smaller nearest neighbour statistic) than the actual dates\nshown in Figure 6, suggesting that the observed distribution\nof basal peat dates could have been produced by random\nsampling of peats whose initiation had also been random, and\nat a uniform rate.\nHence there is, at present, no strong evidence to suggest that\nclimatic changes have played a role in the timing of peat\ninitiation in the Faroes. It seems more likely that peat initia-\ntion (by paludification) occurs at any given site once enough\ntime has passed for water, weathering and vegetation to have\ncreated the right conditions for accumulation of organic\nmaterial to outpace its removal. The fact that the time required\nfor this to happen varies by 9000 years may perhaps be a\nfunction of spatial variability in microclimate, hydrology and\nsubstrate chemistry. If climatic change does play a role in\nforcing peat initiation – for example, a hypothetical change to\nwetter and cooler conditions around 6000 cal BP encouraging\na spurt of peat initiation – then it apparently only encourages\nblanket peat expansion at a small number of sites, presumably\nthose where conditions are already almost suitable for peat\naccumulation to begin.\nWe conclude from this analysis that there is no evidence to\nsupport the contention that discrete climatic changes have\ncaused a landscape-wide acceleration of peat initiation during\nthe Holocene. Several workers have argued in the other\ndirection, using data on peat accumulation at one, or a small\nnumber of Faroese sites to draw conclusions about climatic\nhistory (Jo´hansen 1985, pp. 53–54; Wastega˚rd 2002; Hannon\net al. 2005, p. 645). The present authors’ interpretation of the\navailable data, including the new data presented here, is that\nsuch an approach is unsound, given the variability in peat\nhistories on a range of spatial scales across the Faroes. If peat\naccumulation histories can tell anything about Holocene\nclimatic change, a much larger data set will be needed before\nreliable conclusions can be drawn.\n4.3. Step change at the catchment scale\nTheories of peat initiation (e.g. Moore 1993; Charman 2002)\npredict that it should involve an autogenic positive feedback:\nonce organic matter starts to accumulate under waterlogged\nconditions, the moisture retention capacity of the soil increases\nand the local water table rises, so there is a mechanism for\naccelerating the process of peat initiation at adjacent locations.\nA rapid lateral expansion of peat consistent with this has\nbeen observed in a number of situations, particularly raised\nombrotrophic mires (e.g. Foster & Wright 1990; Ma¨kila¨ 1997),\nbut also with blanket peats (Solem 1986) and blanket peats\nspreading from terrestrialised lakes (Anderson et al. 2003).\nCatchment-scale pollen records from lakes would be expected\nto reflect a rapid expansion of peat as an abrupt increase in\npollen percentages of indicator taxa such as Calluna vulgaris.\nThe basal peat dates from the valley around Lı´tlavatn are\ndistributed over approximately 5000 years, which would seem\nto suggest that feedback of this kind was not particularly\nstrong here. On the other hand, the pollen record from\nGro´thu´svatn appears to show the spread of Calluna as a\nstep-like process with an abrupt increase in abundance at the\nGro´t-2\/3 boundary, which could indicate autogenic feedback\nat work. Such step-like changes are not visible in the Calluna\nrecord from other sites in the Faroes. (Fig. 7; an exception is\nHoydalar (Jo´hansen 1985), where one of the changes in the\nCalluna curve, estimated here as occurring at c. 8000 cal BP,\ncoincides with sedimentological evidence for a local change\nfrom a limnic to a terrestrial depositional environment.) Feed-\nback is more likely to occur in an area of subdued topography,\nwhere factors such as drainage are similar across the area, and\nGro´thu´svatn certainly has a relatively homogenous catchment\ncompared to many lakes in the Faroes.\n4.4. Implications of blanket mire expansion for other\naspects of the ecosystem\nThe spread of blanket peat may have had indirect effects on\nother parts of the Faroese landscape system. Limnological\nindicators from Gro´thu´svatn, including the alga Pediastrum\n(Lawson et al. 2005), indicate that relatively productive con-\nditions in pollen zone Gro´t-1 gave way, after a hiatus, to less\nproductive conditions, until the settlement period when the\nnutrient status of the lake apparently increased again. A likely\nexplanation is that acidification of catchment soils caused a\ndecline in the pH of runoff and hence a decline in the pH of the\nlake itself, and a reduction in the solubility of nutrients (cf.\nPennington 1981; Wetzel 2001). Similarly, the sedimentation\nregime of the lake changed substantially following the resump-\ntion of sedimentation during zone Gro´t-2, with much more silt\n24 IAN T. LAWSON ET AL.\nin the lower unit, and more organic sediments above, perhaps\nrepresenting the stabilisation of the catchment regolith beneath\nthe peat cover. Conversely, geomorphological studies on\nSandoy and elsewhere in the Faroes suggest that erosion rates\nhave increased at many localities through the course of the\nsecond half of the Holocene, and the suggestion has been made\nthat gullying within the peat could have focused the erosive\npower of runoff, leading to higher overall rates of sediment\ntransport (cf. Solem 1986; Humlum & Christiansen 1998a,\n1998b; Bragg & Tallis 2001; Edwards et al. 2005).\n4.5. Human impact and peat initiation\nThe principal motivation for this study was to determine\nwhether landscape-scale accumulation of blanket peat on\nSandoy had been precipitated by human activity, as suggested\nfor many other sites in Atlantic Europe. The conclusion is\nemphatically that they were not: all but one of the basal peat\ndates presented here are older than the first settlement of the\nFaroes, and our survey of dates from other islands in the\narchipelago suggests that the same conclusion holds elsewhere\ntoo. In fact, there is evidence that the opposite situation\npertains, namely that people were responsible for a net reduc-\ntion in peat cover. For the Faroese, living in a treeless\nenvironment, peat has long been an important source of\nfuel; archaeobotanical evidence from the sites of Undir\nJunkarinsfløtti at Sandur on Sandoy and Toftanes on Eysturoy\nshows that this was the case as long ago as the Norse period\n(Church et al. 2005; Lawson et al. 2005; Vickers et al. 2005).\nPeat mining must therefore have had some impact on the area\nand\/or volume of peat. Drainage and cultivation of fields for\nagriculture and to improve grazing, a process which is still\noccurring today, must also have had a more localised impact\non any peat that existed closer to settlements (cf. Borthwick\net al. 2005). Perhaps some combination of these two factors is\nresponsible for the decline in Calluna pollen percentages seen\nin the uppermost five samples from Gro´thu´svatn, which is\ntoday surrounded by a narrow belt of cultivated fields.\nThese conclusions have implications for our understanding\nof peat initiation and development in areas outside the Faroes.\nBlanket peat initiation has clearly occurred in the Faroes\nwithout human intervention, a result which is significant given\nthat many studies from outside the Faroes have implicated\nFigure 7 Pollen percentage curves for Calluna vulgaris from selected sites across the Faroes. Age models were\ncalculated by linear interpolation between calibrated radiocarbon dates, tephra layers, and the landna´m horizon,\nas detailed in the original publications for sites other than Lı´tlavatn and Gro´thu´svatn; in the case of Tjørnuvik\nthe assumption was made that 0 cm depth was equivalent to the present. Redrawn using data from Jo´hansen\n(1971, 1975, 1982). The age models for Lı´tlavatn and Gro´thu´svatn are based on linear interpolation between the\nfour and three lowermost radiocarbon dates from each sequence respectively, assigning \u000250 BP as the age of the\nsediment-water interface. The lowermost three pollen samples from the Gro´thu´vatn sequence are not included\nhere due to the likely presence of a depositional hiatus at the Gro´t-1\/2 boundary, as discussed in the text.\nPEAT INITIATION IN THE FAROE ISLANDS 25\nhuman activity (particularly burning and\/or deforestation) in\nthe spread of blanket peats (e.g. Solem 1986; Charman 1992;\nTallis 1991; Bennett et al. 1992, 1997; Fossitt 1996; Huang\n2002; Moe 2003) and other ombrotrophic mires (Smith &\nCloutman 1988). The conclusion supports those who would\nsuggest that natural processes may account for mire initiation\nand development in at least some instances (e.g. Clymo 1984;\nSolem 1989; Foster & Wright 1990; Ma¨kila¨ 1997; Ellis & Tallis\n2000; Anderson et al. 2003), particularly where the pre-peat\nenvironment was never substantially wooded; the question of\nwhether natural peat formation can occur in wooded environ-\nments remains open. Analysis of the limited data set of peat\ninitiation dates for the Faroes suggests that there is no reason\nto claim that peat initiation is strongly determined by climatic\nchanges; the spread of peat has been fairly steady throughout\nthe course of the Holocene, and local topographic, hydrologi-\ncal and pedological variations appear to have been more\nimportant controls on the timing of peat spread than climatic\nchange. At a landscape scale in the Sandoy study area, the peat\nappears to have spread from multiple starting locations (cf.\nEdwards & Hirons 1982); furthermore, according to the pollen\ndata from lake sites such as Gro´thu´svatn and Saksunarvatn,\npeat expansion followed quite different temporal patterns\nover time from one catchment to the next. The same may be\nexpected to hold true for areas outside the Faroes, with human\nactivity just one of a number of factors which interact to give\na complex spatio-temporal pattern of peat initiation (cf. Tallis\n1991; Prøsch-Danielsen & Simonsen 2000; Charman 2002).\n5. Conclusions\n1. The major benefit of studying peat histories in the Faroe\nIslands is that human impact can be ruled out as a\ncontributory factor before the first known settlement at\nc. AD 800. The isolation of this group of islands from\nthe anthropogenic activity that increasingly dominated\nHolocene environments in neighbouring locations allows\nthe investigation of natural processes of environmental\nchange in a simplified setting. The results have implications\nfor our understanding of landscape change in other areas\nwhere anthropogenic activity complicates interpretations.\n2. Basal peat dates from the Faroes are distributed evenly\nthroughout the last 9000 years. The timing of blanket peat\ninitiation thus cannot be tied to climatic changes during the\nHolocene. There is, however, some indication that peat\ninitiation was more active in the Faroes between 4000 and\n6000 cal BP than at other times, although this result is not\nstatistically significant.\n3. Basal peat dates vary markedly both across the Faroes as a\nwhole, and within our c. 2 km2 study area. At a landscape\nscale on Sandoy, blanket peat appears to have initiated in\nsmall patches which gradually coalesced. Current models\n(e.g. Moore 1993) would predict earliest peat growth in\nwaterlogged topographic hollows, which is partly supported\nby a tendency for early peat dates where shallow lakes have\ninfilled (e.g. at Hovsdalur and Hoydalar), although there\nare situations (e.g. Saksunardalur) where this is not the case\n(Buckland et al. 1998; Edwards & Craigie 1998).\n6. Acknowledgements\nThe Leverhulme Trust is thanked for funding this research\nthrough the project ‘Landscapes circum-Landna´m’. Comments\nfrom the reviewers, Peter Moore and Jeff Blackford, were\ngratefully received. Christopher Keylock and Katherine\nRoucoux are thanked for useful discussions and comments on\nthe text, and Maureen Lamb and Iona Grant for technical\nassistance.\n7. References\nAnderson, R. L., Foster, D. R. & Motzkin, G. 2003. Integrating lateral\nexpansion into models of peatland development in temperate New\nEngland. Journal of Ecology 91, 68–76.\nArge, S. V. 1991. The landna´m in the Faroes. Arctic Anthropology 28,\n101–20.\nArge, S. V. 1993. On the landna´m of the Faroe Islands. In Batey C. E.,\nJesch, J. & Morris, C. D. (eds) The Viking Age in Caithness,\nOrkney and the North Atlantic, 465–72. Edinburgh: Edinburgh\nUniversity Press.\nArge, S. V., Sveinbjarnardo´ttir, G., Edwards, K. J. & Buckland, P. C.\n2005. Viking and medieval settlement in the Faroes: people, place\nand environment. Human Ecology 33, 597–620.\nBennett, K. D., Boreham, S., Sharp, M. J. & Switsur, V. R. 1992.\nHolocene history of environment, vegetation and human settle-\nment on Catta Ness, Lunnasting, Shetland. Journal of Ecology 80,\n241–73.\nBennett, K. D., Whittington, G. & Edwards, K. J. 1994. Recent plant\nnomenclatural changes and pollen morphology in the British\nIsles. Quaternary Newsletter 73, 1–6.\nBennett, K. D., Bunting, M. J. & Fossit, J. A. 1997. Long-term\nvegetation change in the Western and Northern Isles, Scotland.\nBotanical Journal of Scotland 49, 127–40.\nBennett, K. D. & Willis, K. J. 2002. Pollen. In Smol, J. P., Birks,\nH. J. B. & Last, W. M. (eds) Tracking Environmental Change\nUsing Lake Sediments, Vol. 3: Terrestrial, Algal and Siliceous\nIndicators. Dordrecht: Kluwer.\nBorthwick, D. M., Edwards, K. J. & Cook, G. 2005. Shieling activity\nduring the Norse period in the Faroe Islands: a palynological\napproach. In Grønnow, B., Arneborg, J. & Gulløv, H. C. (eds)\nThe Dynamics of Northern Societies, 299–306. SILA\/NABO\n2004 Conference Proceedings, National Museum of Denmark,\nCopenhagen.\nBragg, O. M. & Tallis, J. H. 2001. The sensitivity of peat-covered\nlandscapes. Catena 42, 345–60.\nBronk Ramsey, C. 1995. Radiocarbon calibration and analysis of\nstratigraphy: the OxCal program. Radiocarbon 37, 425–30.\nBronk Ramsey, C. 2001. Development of the radiocarbon program\nOxCal. Radiocarbon 43, 355–63.\nBuckland, P. C., Edwards, K. J. & Sadler, J. P. 1998. Early Holocene\nFlora and Fauna from Saksunardalur, Streymoy and the origins\nof the Faroese biota. Fro´ðskaparrit 48, 259–66.\nBunting, M. J. 2003. Pollen-vegetation relationships in non-arboreal\nmoorland taxa. Review of Palaeobotany and Palynology 125,\n285–98.\nCaseldine, C. 2001. Changes in Betula in the Holocene record from\nIceland – a palaeoclimatic record or evidence for early Holocene\nhybridisation? Review of Palaeobotany and Palynology 117, 139–\n52.\nCharman, D. J. 1992. Blanket mire formation at the Cross Lochs,\nSutherland, northern Scotland. Boreas 21, 53–72.\nCharman, D. J. 2002. Peatlands and Environmental Change.\nChichester: Wiley.\nChurch, M. J., Arge, S. V., Brewington, S., McGovern, T. H.,\nWoollett, J., Perdikaris, S., Lawson, I. T., Cook, G. T.,\nAmundsen, C., Harrison R., Krivogorskaya, K. & Dunbar, E.\n2005. Puffins, Pigs, Cod, and Barley: Palaeoeconomy at Undir\nJunkarinsfløtti, Sandoy, Faroe Islands. Environmental Archae-\nology 10, 179–97.\nClymo, R. S. 1984. The limits to peat bog growth. Philosophical\nTransactions of the Royal Society of London B303, 605–54.\nClymo, R. S. & Mackay, D. 1987. Upwash and downwash of pollen\nand spores in the unsaturated surface layer of Sphagnum-\ndominated peat. New Phytologist 105, 175–83.\nConway, V. M. 1954. Stratigraphy and pollen analysis of southern\nPennine blanket peats. Journal of Ecology 42, 117–47.\nCushing, E. J. 1964. Redeposited pollen in late-Wisconsin pollen\nspectra from east-central Minnesota. American Journal of Science\n262, 1075–88.\nCushing, E. J. 1967. Evidence for differential pollen preservation in\nLate Quaternary sediments in Minnesota. Review of Palaeobotany\n& Palynology 4, 87–101.\nDean, W. E. 1974. Determination of carbonate and organic matter in\ncalcareous sediments and sedimentary rocks by loss-on-ignition:\ncomparison with other methods. Journal of Sedimentary Petrology\n44, 242–8.\n26 IAN T. LAWSON ET AL.\nDebes, H. J. 1993. Problems concerning the earliest settlement in the\nFaroe Islands. In Batey C. E., Jesch, J. & Morris, C. D. (eds) The\nViking Age in Caithness, Orkney and the North Atlantic, 454–64.\nEdinburgh: Edinburgh University Press.\nEdwards, K. J. 1996. A Mesolithic of the Western and Northern Isles\nof Scotland? Evidence from pollen and charcoal. In Pollard, T. &\nMorrison, A. (eds) The Early Prehistory of Scotland, 23–38.\nEdinburgh: Edinburgh University Press.\nEdwards, K. J. 2005. On the windy edge of nothing: a historical human\necology of the Faroes Islands. Human Ecology 33, 585–96.\nEdwards, K. J., Buckland, P. C., Craigie, R., Panagiotakopulu, E. &\nStummann Hansen, S. 1998. Landscapes at Landna´m: palynologi-\ncal and palaeoentomological evidence from Toftanes, Faroe\nIslands. Fro´ðskaparrit 46, 229–44.\nEdwards, K. J., Borthwick, D., Cook, G. T., Dugmore, A. J., Mairs,\nK.-A., Church, M. J., Simpson, I. A. & Adderley, P. A. 2005. A\nhypothesis-based approach to landscape change in Suðuroy,\nFaroe Islands. Human Ecology 33, 621–50.\nEdwards, K. J. & Craigie, R. 1998. Palynological and vegetational\nchanges associated with the deposition of Saksunarvatn Ash in\nthe Faroe Islands. Fro´ðskaparrit 46, 245–58.\nEdwards, K. J. & Hirons, K. R. 1982. Date of blanket peat initiation\nand rates of spread – a problem in research design. Quaternary\nNewsletter 36, 32–37.\nEdwards, K. J. & Whittington, G. 2001. Lake sediments, erosion and\nlandscape change during the Holocene in Britain and Ireland.\nCatena 42, 143–73.\nEllis, C. J. & Tallis, J. H. 2000. Climatic control of blanket mire\ndevelopment at Kentra Moss, north-west Scotland. Journal of\nEcology 88, 869–89.\nFosaa, A. M. 2000. Wildflowers in the Faroe Islands: Checklist.\nTo´rshavn: Føroya Nattu´rugripasavn.\nFosaa, A. M. 2001. A review of plant communities of the Faroe\nIslands. Fro´ðskaparrit 48, 41–54.\nFossitt, J. A. 1996. Late Quaternary vegetation history of the Western\nIsles of Scotland. New Phytologist 132, 181–96.\nFoster, D. R. & Wright, H. E. Jr 1990. Role of ecosystem development\nand climate change in bog formation in central Sweden. Ecology\n71, 450–63.\nHannon, G. E., Hermanns-Auðardo´ttir, M. & Wastega˚rd, S. 1998.\nHuman impact at Tjørnuvı´k on the Faroe Islands. Fro´ðskaparrit\n46, 215–28.\nHannon, G. E., Wastega˚rd, S., Bradshaw, E. & Bradshaw, R. H. W.\n2001. Human impact and landscape degradation on the Faroe\nIslands. Biology and Environment: Proceedings of the Royal Irish\nAcademy 101B, 129–39.\nHannon, G. E., Bradshaw, R. H. W. & Wastega˚rd, S. 2003. Rapid\nvegetation change during the early Holocene on the Faroe Islands\ndetected in terrestrial and aquatic ecosystems. Journal of Quatern-\nary Science 18, 615–19\nHannon, G. E., Bradshaw, R. H. W., Bradshaw, E. G., Snowball, I. &\nWastega˚rd, S. 2005. Climate change and human settlement\nas drivers of Late Holocene vegetational change in the Faroe\nIslands. The Holocene 15, 639–47.\nHannon, G. E. & Bradshaw, R. H. W. 2000. Impacts and timing of\nthe first human settlement on vegetation of the Faroe Islands.\nQuaternary Research 54, 404–13.\nHavinga, A. J. 1967. Palynology and pollen preservation. Review of\nPalaeobotany & Palynology 2, 81–98.\nHeiri, O., Lotter, A. F. & Lemcke, G. 2001. Loss on ignition as a\nmethod for estimating organic and carbonate content in sedi-\nments: reproducibility and comparability of results. Journal of\nPaleolimnology 25, 101–10.\nHuang, C. C. 2002. Holocene landscape development and human\nimpact in the Connemara uplands, western Ireland. Journal of\nBiogeography 29, 153–65.\nHumlum, O. & Christiansen, H. H. 1998a. Mountain climate and\nperiglacial phenomena in the Faeroe Islands. Permafrost and\nPeriglacial Processes 9, 189–211.\nHumlum, O. & Christiansen, H. H. 1998b. Late Holocene climate\nforcing of geomorphic activity in the Faroe Islands. Fro´ðskaparrit\n46, 169–89.\nJacobson, G. L. Jr & Bradshaw, R. H. W. 1981. The selection of sites\nfor paleovegetational studies. Quaternary Research 16, 80–96.\nJo´hansen, J. 1971. A palaeobotanical study indicating a pre-viking\nsettlement in Tjørnuvı´k, Faroe Islands. Fro´ðskaparrit 19, 147–57.\nJo´hansen, J. 1975. Pollen diagrams from the Shetland and Faroe\nIslands. New Phytologist 75, 369–87.\nJo´hansen, J. 1982. Vegetational development in the Faroes from\n10,000 BP to the present. Danmarks Geologiske Undersøgelse\nArrbog 1981, 111–36.\nJo´hansen, J. 1985. Studies in the Vegetational History of the Faroe and\nShetland Islands. Annales Societatis Scientiarum Faeroensis Sup-\nplementum XI, To´rshavn.\nJo´hansen, J. 1986–1987. Joansokugras (Plantago lanceolata) og for-\nsogulig buseting i Foroyum [Plantago lanceolata in the Faroe\nIslands and its significance as indicator of prehistoric settlement].\nFro´ðskaparrit 34–35, 68–75.\nJo´hansen, J. 1989. Survey of geology, climate and vegetational history.\nIn Højgaard, A., Jo´hansen, J. & Odum, S. (eds) A Century of\nTree-Planting in the Faroe Islands. To´rshavn: Føroya\nFro´ðskaparfelag.\nJowsey, P. C. 1966. An improved peat sampler. New Phytologist 65,\n245–8.\nLawson, I. T., Church, M. J., McGovern, T. H., Arge, S. V., Edwards,\nK. J., Gathorne-Hardy, F. J., Dugmore, A. J., Mairs, K.-A.,\nThomson, A. M., Woollett, J. & Sveinbjarnardo´ttir, G. 2005.\nHistorical ecology on Sandoy, Faroe Islands: palaeoenvironmen-\ntal and archaeological perspectives. Human Ecology 33, 651–85.\nMaher, L. J. Jr 1972. Nomograms for computing 0.95 confidence\nlimits of pollen data. Review of Palaeobotany & Palynology 13,\n85–93.\nMa¨kela¨, E. M. 1996. Size distinctions between Betula pollen types – a\nreview. Grana 35, 248–56.\nMa¨kila¨, M. 1997. Holocene lateral expansion, peat growth and carbon\naccumulation on Haukkasuo, a raised bog in south-eastern\nFinland. Boreas 26, 1–14.\nMallik, A. U., Gimingham, C. H. & Rahman, A. A. 1984. Ecological\neffects of heather burning: I. Water infiltration, moisture retention\nand porosity of surface soil. Journal of Ecology 72, 767–76.\nMalmros, C. 1990. Viking age wood resources at Argisbrekka, Faroe\nIslands. Norwegian Archaeological Review 23, 86–92.\nMalmros, C. 1994. Exploitation of local, drifted and imported wood\nby the Vikings on the Faroe Islands. Botanical Journal of Scotland\n46, 552–8.\nMoe, D. 2003. Landscape history and heathland development over the\nlast 4000 years in the Bodø area, northern Norway. Norsk\nGeografisk Tidsskrift 57, 194–204.\nMoore, P. D. 1973. The influence of prehistoric cultures upon the\ninitiation and spread of blanket bog in upland Wales. Nature 241,\n350–3.\nMoore, P. D. 1993. The origin of blanket mire, revisited. In Chambers,\nF. M. (ed.) Climate Change and Human Impact on the Landscape.\nLondon: Chapman & Hall.\nMoore, P. D., Webb, J. A. & Collinson, M. E. 1991. Pollen Analysis.\nOxford: Blackwell Scientific.\nMoore, P. D. & Bellamy, D. J. 1973. Peatlands. London: Elek Science.\nPennington, W. 1981 Records of a lake’s life in time: the sediments.\nHydrobiologia 79, 197–219.\nPrøsch-Danielsen, L. & Simonsen, A. 2000. Palaeoecological investi-\ngations towards the reconstruction of the history of forest clear-\nances and coastal heathlands in south-western Norway.\nVegetation History and Archaeobotany 9, 189–204.\nSmith, A. G. & Cloutman, E. W. 1988. Reconstruction of Holocene\nvegetation history in three dimensions at Waun-Fignen-Felen, an\nupland site in South Wales. Philosophical Transactions of the\nRoyal Society of London Series B 322, 159–219.\nSolem, T. 1986. Age, origin and development of blanket mires in\nSor-Trondelag, central Norway. Boreas 15, 101–15.\nSolem, T. 1989. Blanket mire formation at Haramsoy, Møre og\nRomsdal, western Norway. Boreas 18, 221–35.\nStuiver, M., Reimer, P. J., Bard, E., Beck, J. W., Burr, G. S., Hughen,\nK. A., Kromer, B., McCormac, G., van der Plicht, J. & Spurk, M.\n1998. INTCAL98 Radiocarbon Age Calibration, 24000–0 cal BP.\nRadiocarbon 40, 1041–83.\nTallis, J. H. 1991. Forest and moorland in the south Pennine uplands\nin the mid-Flandrian period. III. The spread of moorland – local,\nregional and national. Journal of Ecology 79, 401–15.\nThorsteinsson, A. (2005). There is another set of small islands. In\nMortensen, A. & Arge, S. V. (eds) Viking and Norse in the North\nAtlantic, 39–42. Annales Societatis Scientiarum Foeroensis Sup-\nplementum XLIV, To´rshavn.\nVickers, K., Bending, J., Buckland, P. C., Edwards, K. J. & Stummann\nHansen, S. 2005. Toftanes: the palaeoecology of a Faroese\nlandna´m farm. Human Ecology 33, 685–710.\nWastega˚rd, S. 2002. Early to middle Holocene silicic tephra horizons\nfrom the Katla volcanic system, Iceland: new results from the\nFaroe Islands. Journal of Quaternary Science 17, 723–30.\nWetzel, R. G. 2001. Limnology: Lake and River Ecosystems, third\nedition. San Diego: Academic Press.\nPEAT INITIATION IN THE FAROE ISLANDS 27\nWilmshurst, J. M. & McGlone, M. S. 2005. Corroded pollen and\nspores as indicators of changing lake sediment sources and\ncatchment disturbance. Journal of Paleolimnology 34, 503–17.\nYoung, D. L. 1982. The linear nearest neighbour statistic. Biometrika\n69, 477–80.\nMS received 4 January 2006. Accepted for publication 19 December 2006.\n28 IAN T. LAWSON ET AL.\n"}