{"doi":"10.1051\/0004-6361:20041453","coreId":"194845","oai":"oai:lra.le.ac.uk:2381\/816","identifiers":["oai:lra.le.ac.uk:2381\/816","10.1051\/0004-6361:20041453"],"title":"A simple test for periodic signals in red noise","authors":["Vaughan, Simon A."],"enrichments":{"references":[{"id":44682294,"title":"(Budapest: Akadémiai Kiado)","authors":[],"date":"2004","doi":null,"raw":"Abramowicz, M. A., Kluzniak, W., McClintock, J. E., & Remillard, R. A. 2004, ApJ, 609, L63 Abramowitz, M., & Stegun, I. A. 1964, Handbook of Mathematical Functions, Applied Mathematics Series, Vol. 55 (New York: Dover Publications) Akaike, H. 1973, in 2nd International Symposium on Information Theory, ed. B. N. Petrov, & F. Csáki (Budapest: Akadémiai Kiado) Anderson, E. R., Duvall, T. L., & Jefferies, S. M. 1990, ApJ, 364, 699 Benlloch, S., Wilms, J., Edelson, R., Yaqoob, T., & Staubert, R. 2001, ApJ, 562, L121 Bevington, P. R., & Robinson, D. K. 1992, Data Reduction and Error Analysis for the Physical Sciences (New York: McGraw-Hill) Bloomfield, P. 2000, Fourier Analysis of Time Series (New York: Wiley) Boller, Th., Keil, R., Trümper, J., et al. 2001, A&A, 365, L146 Cash, W. 1979, ApJ, 228, 939 Chatfield, C. 1989, The analysis of time series: theory and practice, 4th ed. (London: Chapman & Hall) Fisher, R. A. 1929, Proceedings of the Royal Society on London: Series A, 125, 54 Fougere, P. F. 1985, J. Geophys. Res., 90, 4355 Genzel, R., Schödel, R., Eckart, A., et al. 2003, Nature, 425, 934 Geweke, J., & Porter-Hudak, S. 1983, Journal of Time Series Analysis, 4, 221 Groth, E. J. 1975, ApJS, 29, 285 Halpern, J. P., Leighly, K. M., & Marshall, H. L. 2003, ApJ, 585, 665 Hayashida, N., Hirasawa, H., Ishikawa, F., et al. 1998, ApJ, 504, L71 Israel, G. L., & Stella, L. 1996, ApJ, 468, 369 Iwasawa, K., Fabian, A. C., Brandt, W. N., et al. 1998, MNRAS, 295, L20 Jenkins, G. M., & Watts, D. G. 1968, Spectral Analysis and its Applications (San Fancisco: Holden-Day) Koen, C. 1990, ApJ, 348, 700 Kranich, D., deJager, O. C., Kestel, M., et al. 1999, in Proc. of 26th International Cosmic Ray Conference (Salt Lake City), 3, 358 Lawrence, A., Watson, M. G., Pounds, K. A., & Elvis, M. 1987, Nature, 325, 694 Leahy, D. A., Darbro, W., Elsner, R. F., et al. 1983, ApJ, 266, 160 Lomb, N. R. 1976, Ap&SS, 39, 447 Markowitz, A., Edelson, R., Vaughan, S., et al. 2003, ApJ, 593, 96 McClintock, J. E., & Remillard, R. A. 2004, in Compact Stellar X-ray Sources, ed. W. H. G. Lewin, & M. van der Klis (Cambridge: Cambridge University Press), in press [arXiv:astro-ph\/0306213] Papadakis, I. E., & Lawrence, A. 1993a, MNRAS, 261, 612 Papadakis, I. E., & Lawrence, A. 1993b, Nature, 361, 233 Pilgram, B., & Kaplan, D. T. 1998, Physica D, 114, 108 Press, W. H. 1978, Comments Astrophys., 7, 103 Press, W. H., & Rybicki, G. B. 1989, ApJ, 338, 277 Press, W. H., Teukolsky, S. A., Vetterling, W. T., & Flannery, B. P. 1996, Numerical Recipes (Cambridge: Cambridge Univ. Press) Priestley, M. B. 1981, Spectral Analysis and Time Series (London: Academic Press) Protassov, R., van Dyk, D. A., Connors, A., Kashyap, V. L., & Siemiginowska, A. 2002, ApJ, 571, 545 Scargle, J. D. 1982, ApJ, 263, 835 Scargle, J. D. 2000, Journal of Scientific Exploration, 14, 91 [arXiv:physics\/9909033] Schuster, A. 1898, Terrestrial Magnetism, 3, 24 Stella, L., Arlandi, E., Tagliaferri, G., & Israel, G. L. 1997, in Applications of Time Series Analysis in Astronomy and Meteorology, ed. T. Subba Rao, M. B. Priestley, & O. Lessi (London: Chapman & Hall) [arXiv:astro-ph\/9411050] Tagliaferri, G., Bao, G., Israel, G. L., Stella, L., & Treves, A. 1996, ApJ, 465, 181 Timmer, J., & König, M. 1995, A&A, 300, 707 Uttley, P., McHardy, I. M., & Papadakis, I. 2002, MNRAS, 332, 231 van der Klis, M. 1989, in Timing Neutron Stars, ed. H. Ogelman, E. P. J. van den Heuvel (Dordrecht: Kluwer), NATO ASI Series C, 262, 27 van der Klis, M. 1995, in X-ray Binaries, ed. W. H. G. Lewin, J.","cites":null},{"id":44682295,"title":"den Heuvel (Cambridge: Cambridge Univ.","authors":[],"date":"2003","doi":"10.1063\/1.883059","raw":"van Paradijs, & E. P. J. van den Heuvel (Cambridge: Cambridge Univ. Press), 252 Wall, J. V., & Jenkins, C. R. 2003, Practical statistics for astronomers (Cambridge: Cambridge University Press) Zhou, W.-X., & Sornette, D. 2001, Int. J. Mod. Phys. C, 13, 137","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"We demonstrate a simple method for testing the significance of peaks in the periodogram of red noise data. The\\ud\nprocedure was designed to test for spurious periodicities in X-ray light curves of active galaxies, but can be used quite generally\\ud\nto test for periodic components against a background noise spectrum assumed to have a power law shape. The method provides\\ud\na simple and fast test of the significance of candidate periodic signals in short, well-sampled time series such as those obtained\\ud\nfrom XMM-Newton observations of Seyfert galaxies, without the need for Monte Carlo simulations. A full account is made of\\ud\nthe number of trials and the uncertainties inherent to the model fitting. Ignoring these subtle effects can lead to substantially\\ud\noverestimated significances. These difficulties motivate us to demand high standards of detection (minimum > 99.9 per cent\\ud\nconfidence) for periodicities in sources that normally show red noise spectra. The method also provides a simple means to estimate\\ud\nthe power spectral index, which may be an interesting parameter itself, regardless of the presence\/absence of periodicities.Peer-reviewedPublisher versio","downloadUrl":"http:\/\/www.aanda.org\/","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/816\/1\/aa1453.pdf","pdfHashValue":"2fa08774c110cb1d7fee06cae5b4f159c84b9b9b","publisher":"EDP Sciences","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/816<\/identifier><datestamp>\n                2012-07-24T15:03:36Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nA simple test for periodic signals in red noise<\/dc:title><dc:creator>\nVaughan, Simon A.<\/dc:creator><dc:subject>\nmethods: data analysis<\/dc:subject><dc:subject>\nmethods: statistical<\/dc:subject><dc:subject>\nX-rays: general<\/dc:subject><dc:subject>\nX-rays: galaxies<\/dc:subject><dc:description>\nWe demonstrate a simple method for testing the significance of peaks in the periodogram of red noise data. The\\ud\nprocedure was designed to test for spurious periodicities in X-ray light curves of active galaxies, but can be used quite generally\\ud\nto test for periodic components against a background noise spectrum assumed to have a power law shape. The method provides\\ud\na simple and fast test of the significance of candidate periodic signals in short, well-sampled time series such as those obtained\\ud\nfrom XMM-Newton observations of Seyfert galaxies, without the need for Monte Carlo simulations. A full account is made of\\ud\nthe number of trials and the uncertainties inherent to the model fitting. Ignoring these subtle effects can lead to substantially\\ud\noverestimated significances. These difficulties motivate us to demand high standards of detection (minimum > 99.9 per cent\\ud\nconfidence) for periodicities in sources that normally show red noise spectra. The method also provides a simple means to estimate\\ud\nthe power spectral index, which may be an interesting parameter itself, regardless of the presence\/absence of periodicities.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher version<\/dc:description><dc:date>\n2009-12-08T16:25:09Z<\/dc:date><dc:date>\n2009-12-08T16:25:09Z<\/dc:date><dc:date>\n2005<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAstronomy and Astrophysics, 2005, 431, pp.391-403.<\/dc:identifier><dc:identifier>\n0004-6361<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/816<\/dc:identifier><dc:identifier>\nhttp:\/\/www.aanda.org\/<\/dc:identifier><dc:identifier>\n10.1051\/0004-6361:20041453<\/dc:identifier><dc:identifier>\n1432-0746<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nX-ray and Observational Astronomy<\/dc:relation><dc:rights>\n© The European Southern Observatory (ESO) 2005. Deposited with permission of the publisher.<\/dc:rights><dc:publisher>\nEDP Sciences<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1432-0746","0004-6361","issn:0004-6361","issn:1432-0746"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","X-ray and Observational Astronomy"],"year":2005,"topics":["methods: data analysis","methods: statistical","X-rays: general","X-rays: galaxies"],"subject":["Article"],"fullText":"A&A 431, 391–403 (2005)\nDOI: 10.1051\/0004-6361:20041453\nc© ESO 2005\nAstronomy\n&Astrophysics\nA simple test for periodic signals in red noise\nS. Vaughan\nX-Ray and Observational Astronomy Group, University of Leicester, Leicester, LE1 7RH, UK\ne-mail: sav2@star.le.ac.uk\nReceived 11 June 2004 \/ Accepted 12 October 2004\nAbstract. We demonstrate a simple method for testing the significance of peaks in the periodogram of red noise data. The\nprocedure was designed to test for spurious periodicities in X-ray light curves of active galaxies, but can be used quite generally\nto test for periodic components against a background noise spectrum assumed to have a power law shape. The method provides\na simple and fast test of the significance of candidate periodic signals in short, well-sampled time series such as those obtained\nfrom XMM-Newton observations of Seyfert galaxies, without the need for Monte Carlo simulations. A full account is made of\nthe number of trials and the uncertainties inherent to the model fitting. Ignoring these subtle effects can lead to substantially\noverestimated significances. These difficulties motivate us to demand high standards of detection (minimum > 99.9 per cent\nconfidence) for periodicities in sources that normally show red noise spectra. The method also provides a simple means to esti-\nmate the power spectral index, which may be an interesting parameter itself, regardless of the presence\/absence of periodicities.\nKey words. methods: data analysis – methods: statistical – X-rays: general – X-rays: galaxies\n1. Introduction\nMany astrophysical sources show erratic, aperiodic brightness\nfluctuations with steep power spectra. This type of variabil-\nity is known as red noise. By “noise” we mean to say that\nthe intrinsic variations in the source brightness are random\n(this has nothing to do with measurement errors, also called\nnoise). Examples include the X-ray variability of X-ray bi-\nnaries (XRBs; e.g. van der Klis 1995) and Seyfert galaxies\n(e.g. Lawrence et al. 1987; Markowitz et al. 2003). The power\nspectrum of these variations, which describes the dependence\nof the variability amplitude on temporal frequency, is often\nreasonably approximated as a simple power law (over at least\na decade of frequency). This featureless continuum spectrum\ndoes not offer any characteristic frequencies that could be used\nas diagnostics.\nXRBs often show quasi-periodic oscillations (QPOs) that\nshow-up as peaks in the power spectrum over the continuum\nnoise spectrum. These can be thought of as half-way between\nstrictly periodic variations (all power concentrated at one fre-\nquency) and broad-band noise (power spread over a very broad\nrange of frequencies). A combination of periodic oscillations\nwith similar frequencies, or a single oscillation that is per-\nturbed in frequency, amplitude or phase can produce a QPO.\nQPOs are one of the most powerful diagnostics of XRB physics\n(see e.g. van der Klis 1995; McClintock & Remillard 2004).\nThe detection of periodic or quasi-periodic variations from\na Seyfert galaxy would a be a key observational discovery,\nand could lead to a breakthrough in our understanding if the\ncharacteristic (peak) frequency could be identified with some\nphysically meaningful frequency. For example, if we assume\na 1\/MBH scaling of frequencies we might expect to see ana-\nlogues of the high frequency QPOs of XRBs in the range\nfQPO ∼ 3 × 10−3(MBH\/106 M\u0003)−1 Hz (Abramowicz et al.\n2004).\nHowever, claims of periodic variations and QPOs in the\nX-ray emission of Seyfert galaxies have a chequered history,\nwith no single example withstanding the test of repeated anal-\nyses and observations (see discussion in Benlloch et al. 2001).\nThe confusion arises partly due to the lack of a standard tech-\nnique to assess the significance of a periodicity claim against\na background assumption of random, red noise variability.\nIndeed, as Press (1978) and others have remarked, there is a\ntendency for the eye to identify spurious, low frequency periods\nin random time series. Tests for the presence of periodic vari-\nations against a background of white (flat spectrum) noise are\nwell established, from Schuster (1898) and Fisher (1929), these\nare reviewed in Sect. 6.1.4 of Priestley (1981), and discussed in\nan astrophysical context by Leahy et al. (1983) and van der Klis\n(1989). But without modification these methods cannot be used\nto test against red noise variations. Timmer & König (1995)\nand Benlloch et al. (2001) have proposed Monte Carlo testing\nmethods applicable to red noise but the relatively high com-\nputational demands of these methods may be enough to deter\nsome potential users. Israel & Stella (1996) proposed a method\nthat does not require Monte Carlo simulations but is not opti-\nmised for short observations of power law continuum spectra.\nThis paper puts forward a simple test that can be used to\ntest the significance of candidate periodicities superposed on\na red noise spectrum which has an approximately power law\nshape. The price of simplicity, in this case, is that the test is\nArticle published by EDP Sciences and available at http:\/\/www.aanda.org or http:\/\/dx.doi.org\/10.1051\/0004-6361:20041453\n392 S. Vaughan: A simple test for periodic signals in red noise\nonly strictly valid when the underlying continuum spectrum is\na power law. The basic steps of the method are: (i) measure the\nperiodogram; (ii) estimate the red noise continuum spectrum;\nand (iii) estimate the significance of any peaks above the con-\ntinuum. The stages of the method are explained in detail in the\nfollowing sections. Section 2 gives a brief introduction to the\nstatistical properties of the periodogram. Section 3 discusses a\nsimple method for estimating the parameters of a power law-\nlike spectrum and Sect. 4 discusses how to estimate the sig-\nnificance of a peak above the continuum. Section 5 then\ndemonstrates the veracity of the method using Monte Carlo\nsimulations and Sect. 6 reviews some important caveats that\nmust be considered when using this (and other) period-\nsearching methods. Finally, Sect. 7 gives a brief review of the\nmethod in the context of observations of active galaxies. The\nappendix discusses a more generally applicable method of pe-\nriodogram fitting (that makes no assumption on the form of the\nunderlying spectrum).\n2. The periodogram\nGiven an evenly sampled time series xk of K points sampled at\nintervals ∆T we can measure its periodogram (Schuster 1898),\nwhich is simply the modulus-squared of the discrete Fourier\ntransform, X( f j), at each of the n = K\/2 Fourier frequencies:\nI( f j) = 2∆T〈x〉2N |X j|\n2. (1)\nThe normalisation is chosen such that the units of the peri-\nodogram are (rms\/mean)2 Hz−1 (where rms\/mean is dimension-\nless) and summing the periodogram over positive frequencies\ngives the sample variance in fractional units. The periodogram\nis evaluated at the Fourier frequencies f j = j\/K∆T with\nj = 1, 2, . . . ,K\/2. The original purpose of the periodogram\nwas as a tool for identifying “hidden periodicities” in time se-\nries. However, the periodogram of a noise process, if measured\nfrom a single time series, shows a great deal of scatter around\nthe underlying power spectrum. Specifically, the periodogram\nat a given frequency, I( f j), is scattered around the true power\nspectrum, P( f j), following a χ2 distribution with two degrees\nof freedom:\nI( f j) = P( f j)χ22\/2, (2)\nwhere χ22 is a random variable distributed as χ\n2 with\ntwo degrees of freedom, i.e. an exponential probability density\nwith a mean and variance of two and four, respectively:\npχ2 (x) = e−x\/2\/2. (3)\nThe periodogram is distributed in this way because the real\nand imaginary parts of the DFT are normally distributed for a\nstochastic process1, and the sum of two squared normally dis-\ntributed variables is a χ22-distributed variable (Jenkins & Watts\n1968; Priestley 1981; Chatfield 1989; Bloomfield 2000). See\n1 The DFT at the Nyquist frequency is always real when N is even\nso the periodogram at this frequency is distributed as χ21, i.e. with one\ndegree of freedom.\nFig. 1. Periodogram of a short (K = 256) time series containing\nred noise. The upper panel shows the periodogram using linear axes,\nthe lower panel shows the same data on logarithmic axes. The peri-\nodogram shows a red noise spectrum rising at lower frequencies. But\nthe periodogram also shows a peak at f = 4 × 10−2. Is this due to a\nreal harmonic (periodic) variation or an artifact of the fluctuating noise\nspectrum?\nalso Scargle (1982), Leahy et al. (1983), Wall & Jenkins (2003)\nand Groth (1975) for further discussion of this point.\nIf the spectrum is flat (“white noise”) and its power level\nknown a priori then we can simply make use of the known\nprobability distribution (Eqs. (2) and (3)) to estimate the like-\nlihood that a given periodogram ordinate exceeds some thresh-\nold. If the power level is not known there is an added un-\ncertainty, but nevertheless an exact test does exist (Fisher’s g\nstatistic: Fisher 1929; Sect. 6.1.4 of Priestley 1981) to esti-\nmate the likelihood that the highest peak in the periodogram\nwas caused by a random fluctuation in the noise spectrum (see\nalso Koen 1990).\nFor the more general case of non-white noise there is no\nsuch exact test. When examining the periodogram of red noise\ndata such as from Seyfert galaxies, we need to be careful not\nto identify spurious peaks. Even in the “null” case (i.e. no pe-\nriodic component) peaks may occur in the periodogram due to\nsampling fluctuations. In particular the eye may be drawn to\nlow frequency peaks because, in red noise data, there is much\nmore power and more scatter in the periodogram at low fre-\nquencies. Given a large amount of data we can average the pe-\nriodogram in one of the standard ways (see e.g. van der Klis\n1989; Papadakis & Lawrence 1993a), fit the continuum using\na standard χ2-minimisation tool (e.g. Bevington & Robinson\n1992; Press et al. 1996) and test of the presence of addition fea-\ntures. This is the standard procedure for analysing XRB data.\nIf we have a very limited amount of data, such that we cannot\nafford to average the periodogram, we are faced with a more\ndifficult situation. Figure 1 gives an example like this. The pe-\nriodogram of a short time series, containing red noise (gener-\nated using the method of Timmer & König 1995), shows a large\npeak at f = 4 × 10−2. Could this be due to a real periodic varia-\ntion present in the data or is it just a fluctuation in the red noise\nspectrum?\nS. Vaughan: A simple test for periodic signals in red noise 393\n3. Fitting the periodogram\n3.1. Least squares (LS) fit to log-periodogram\nIf the underlying power spectrum is suspected to be a power\nlaw then the parameters of interest are its slope, α, and nor-\nmalisation N. One of the simplest methods to estimate these\nparameters from the raw (unbinned) periodogram is to fit it\nwith a model of the form P( f ) = N f −α using the method\nof least squares (LS). The problem with this is that the pe-\nriodogram is distributed around the true underlying spectrum\nin a non-Gaussian fashion and, more seriously, the distribution\ndepends on the spectrum itself (Eq. (2)).\nTo simplify the problem we can fit the logarithm of\nthe periodogram, as discussed in some detail by Geweke &\nPorter-Hudak (1983; see also Papadakis & Lawrence 1993a).\nThe scatter in the periodogram scales with the spectrum itself;\nthe scatter is multiplicative in linear-space. This means the scat-\nter is additive in log-space:\nlog\n[\nI\n(\nf j\n)]\n= log\n[\nP\n(\nf j\n)]\n+ log\n[\nχ22\/2\n]\n(4)\nand therefore identical at each frequency (the data are ho-\nmoskedastic). Working with the logarithm of the periodogram\nhas two further advantages. The first is that if the power\nspectrum is a power law, the natural way to plot the data\nis in log space. The power law becomes a linear function:\nlog[P( f )] = log[N] − α log[ f ]. The second advantage is that\nthe distribution of periodogram ordinates becomes less skewed.\nThis reduces the effect of “outliers” on the fitting.\nWe must be careful fitting the logarithm. The expectation\nvalue of the logarithm of the periodogram is not the expectation\nvalue of the logarithm of the spectrum. However, the bias is a\nconstant (due to the shape of the χ22-distribution in log-space)\nthat can be removed trivially:\n〈\nlog\n[\nI\n(\nf j\n)]〉\n=\n〈\nlog\n[\nP\n(\nf j\n)]〉\n+\n〈\nlog\n[\nχ22\/2\n]〉\n. (5)\nUsing Eq. (26.4.36) of Abramowitz & Stegun (1964) we have\n〈log[χ22\/2]〉 = −0.57721466 . . .\/ ln[10]. (The number in the\nnumerator is Euler’s constant.) Therefore\n〈\nlog\n[\nP\n(\nf j\n)]〉\n=\n〈\nlog\n[\nI\n(\nf j\n)]〉\n+ 0.25068 . . . (6)\nThe logarithm of the periodogram ordinate, with the bias re-\nmoved (i.e. the 0.25068 added2), is thus an unbiased estima-\ntor of the logarithm of the spectrum, and is distributed inde-\npendently and identically (about the underlying spectrum) at\neach frequency. (The raw periodogram points are not identi-\ncally distributed in linear space since the scatter depends on\nthe spectrum, which is a function of frequency.) Thus we can\nuse a LS fitting procedure to get a reasonable estimate of the\npower spectral slope α and normalisation N by fitting a linear\nfunction y = mx+ c to the plot of log[I( f j)] versus log[ f j]. The\nslope of the linear fit gives αˆ = −m and the y-intercept gives\nlog( ˆN) = c + 0.25068. These give our estimate for the contin-\nuum: ˆP j = ˆN f −αˆj , or equivalently log[ ˆP j] = log[ ˆN]− αˆ log[ f j].\nIt is important to note that the datum at the Nyquist fre-\nquency ( j = n) should be ignored in the LS fitting. This is\n2 This is a more precise approximation to 〈log[χ22\/2]〉 than used by\nPapadakis & Lawrence (1993a).\nbecause, as mentioned previously, the distribution of the pe-\nriodogram ordinate at this frequency is not identical to that\nat other frequencies (it follows a χ21 distribution). This mi-\nnor detail means that the LS fit should be performed on the\nn′ = n−1 lowest frequencies that are identically distributed (in\nlog-space).\nA drawback of fitting the periodogram, rather than the\nbinned or averaged periodogram, is that it does not provide\na in-built goodness-of-fit test. By binning the periodogram\n(van der Klis 1989; Papadakis & Lawrence 1993a) we can ob-\ntain Gaussian errors on each ordinate to be used in a χ2-test.\nWe do not have Gaussian error bars for the unbinned log-\nperiodogram. But, since we know the expected distribution\nof the periodogram ordinates about the true spectrum we can\ncompare this to the distribution of residuals from the fitted\ndata using a Kolmogorov-Smirnov test (Press et al. 1996).\nSpecifically, we can compare the data\/model ratio (in linear\nspace) given by γˆ j = 2I j\/ ˆP j with the theoretical χ22 distribu-\ntion, if the model is reasonable γˆ j should be consistent with\nthe χ22 distribution. Furthermore, the KS test is most sensitive\naround the median value, and less sensitive at the tails of the\ndistribution, which means that even in the presence of a real pe-\nriodic signals (i.e. a few outlying powers) the test should give\na good idea of the overall quality of the continuum fit.\n3.2. Uncertainties on the parameters\nThe uncertainties on the slope and normalisation estimates\nfrom the LS method can be derived using the standard theory\nof linear regression (e.g. Bevington & Robinson 1992; Press\net al. 1996). The error on the slope (index) and intercept (log\nnormalisation) are:\nerr2 [αˆ] = n\n′σ2\n∆\n(7)\nand\nerr2\n[\nlog\n(\nˆN\n)]\n=\nσ2\n∑n′\nj=1 a\n2\nj\n∆\n(8)\nwhere a j = log[ f j] and\n∆ = n′\nn′∑\nj=1\na2j −\n\nn′∑\nj=1\na j\n\n2\n(9)\nand also σ2 = π2\/6(ln[10])2 is the variance of the log-\nperiodogram ordinates about the true spectrum (Geweke &\nPorter-Hudak 1983). The covariance of the two parameter esti-\nmates is given by:\ncov\n[\nαˆ, log\n(\nˆN\n)]\n=\nσ2\n∑n′\nj=1 a j\n∆\n· (10)\nHere n′ is the number of frequencies used in the fitting.\nNormally n′ = n − 1 since only the Nyquist frequency is ig-\nnored (because the periodogram at the Nyquist frequency does\nnot follow the same distribution as at the other frequencies).\nThe accuracy of these equations was tested using a Monte\nCarlo simulations. An ensemble of random time series, each\n394 S. Vaughan: A simple test for periodic signals in red noise\nFig. 2. Distribution of the slope and normalisation estimators derived\nfrom 105 Monte Carlo simulations of K = 256 point time series (his-\ntogram). The “true” spectral parameters were α = 2 and log[N] =\n0. The predictions of Gaussian uncertainties, with widths given by\nEqs. (7) and (8), are shown with the smooth curves.\nof length K, was generated (using the method of Timmer &\nKönig 1995). For each series the power spectral slope and\nnormalisation were estimated using the LS method discussed\nabove. Figure 2 shows the distribution of estimates for 105 re-\nalisations of time series generated by a process with an α =\n2,N = 1 spectrum. With only n = 127 periodogram points\n(i.e. K = 256) the distribution of the estimates is reasonably\nclose to Gaussian. (The distribution of ˆN is log-normal be-\ncause the estimated quantity log[ ˆN] is normally distributed in\nthe LS fitting.) These two parameters are covariant in the fit;\na low estimate of the slope tends to be correlated with a high\nestimate of the normalisation. Figure 3 illustrates the covari-\nance between the two estimated parameters. The shape of these\ndistributions is independent of the spectral slope, this was con-\nfirmed using Monte Carlo simulations of spectra with slopes in\nthe range α = 0 − 3.\nThe uncertainties on αˆ and log[ ˆN], and their covari-\nance, were estimated for different length series by the same\nMonte Carlo method as discussed above. These Monte Carlo\nFig. 3. Demonstration of the covariance in the estimates of slope\nand normalisation from from LS fitting to the logarithm of the pe-\nriodogram. The plot shows the results of fitting 5000 Monte Carlo\nsimulations of an α = 2, N = 1 spectrum.\nuncertainties compare well with the theoretically expected un-\ncertainties for the LS fitting method as discussed above (Fig. 4).\n3.3. Uncertainty on the model\nThe expected uncertainties and covariance of the two model\nparameters can be combined to give an estimate of the uncer-\ntainty of the logarithm of the model, log[ ˆP j], at a frequency f j,\nusing the standard error propagation formula.\nerr2\n[\nlog\n{\nˆP\n(\nf j\n)}]\n= err2 [αˆ] ×\n(\nlog[ f j]\n)2\n+ err2\n[\nlog\n(\nˆN\n)]\n−2cov\n[\nα, log\n(\nˆN\n)]\n×\n(\nlog\n[\nf j\n])\n. (11)\nThe first term in the sum accounts for the uncertainty on the\nslope (Eq. (7)), the second accounts for the uncertainty in the\nnormalisation (Eq. (8)) and the third accounts for their covari-\nance (Eq. (10)). The uncertainty is frequency dependent. Even\nin log-space the model is more uncertain at lower frequencies,\nthis simply reflects the fact that there are many more points\nat high log[ f ] than at low log[ f ]. But also note that the un-\ncertainty on the logarithm of the model is independent of the\nmodel itself (slope and normalisation).\nThe distribution of the power in the model (in log-space),\nlog[P j], is expected to be Gaussian with a width determined by\nthe formula above. In linear-space the uncertainty on the model\npower, P j, is log-normally distributed. The probability density\nfunction (PDF) for the model power is therefore\np\nˆP j (y) =\n1\nS jy\n√\n2π\nexp\n\n−\n(\nln[y] − M j\n)2\n2S 2j\n\n(12)\nwhere M j = ln[P j] is the expected value of the power\n(in log-space) and S j is the rms width of the distribution of\npowers (also in log-space) as given by Eq. (11). Both of these\nare frequency dependent. Note that the log-normal distribu-\ntion is conventionally defined in terms of the natural loga-\nrithm, whereas previously the results were given in terms of\nS. Vaughan: A simple test for periodic signals in red noise 395\nFig. 4. Demonstration of the uncertainties from LS fitting to the loga-\nrithm of the periodogram. For each value of K, 105 time series were\nsimulated (with an α = 2, N = 1 spectrum). The periodogram of\neach time series was fitted (in log space) with a linear model. From\nthe 105 estimates of the two parameters (slope and normalisation) their\nrms and covariance were measured (solid squares). The solid lines\nmark the predictions of Eqs. (7), (8) and (10).\nbase 10 logarithm. The uncertainty on the model log-powers\nfrom Eq. (11) needs to be corrected:\nS j = err\n[\nlog\n{\nˆP\n(\nf j\n)}]\n× ln[10]. (13)\nFigure 5 shows the distribution of model powers (at two dif-\nferent frequencies) for 105 Monte Carlo simulations of K =\n256 time series. Clearly the predicted log-normal distribution\n(with parameters M j and S j as given above) gives a good de-\nscription of the real uncertainty in the model.\n3.4. Bias in the parameters\nAlthough in general the LS method does not yield the max-\nimum likelihood solution for non-Gaussian data, for the spe-\ncific case of a power law spectrum the parameters obtained\nfrom the log-periodogram regression, namely αˆ and log[ ˆN],\nare unbiased. Figure 6 demonstrates this using Monte Carlo\nsimulations. However, it should be noted that because the pa-\nrameter log[ ˆN] is normally distributed the parameter ˆN will be\nlog-normally distributed. Thus the mean value of ˆN is not a\ngood estimator of the true value (it will be biased upwards due\nto the long tail of the log-normal distribution).\nFig. 5. Monte Carlo demonstration of the distribution of power in the\nmodel (power law) spectrum. Using an α = 2, N = 1 spectrum,\n105 random time series of length K = 256 were generated. For each\none the periodogram was fitted as discussed in the text. The histograms\nshow the distribution of the power in the resulting 105 models at the\nj = 10 and j = 100 Fourier frequencies ( f j = j\/K∆T ). The solid line\nshows the predicted log-normal distribution (Eq. (12)).\n3.5. Summary of LS fitting\nThe following summarises the LS fitting method:\n– Measure the periodogram of the time series.\n– Ignore the Nyquist frequency point.\n– Take the logarithm.\n– Fit a straight line using the standard LS method.\n– Test the goodness-of-fit using the KS test.\n– Estimate uncertainties on the parameters and the model.\nThe uncertainties and covariance of the parameters can be com-\nputed using Eqs. (7), (8) and (10). These can then be used to\ncalculate the uncertainty on the logarithm of model power S j\n(Eq. (13)).\n4. Confidence limits\n4.1. The ideal case\nIf we know the exact form of the spectrum we can divide this\nout of the periodogram. From Eq. (2) we can see that the ra-\ntio γ j ≡ 2I( f j)\/P( f j) will be distributed like χ22. We can use\nour estimates αˆ and ˆN to form the null hypothesis: the data\nwere generated by a process with a spectrum ˆP( f j) = ˆN f −αˆj\nand no periodic component. We can estimate the probability\nthat a large peak will occur in the periodogram, assuming the\nmodel spectrum, by comparing γˆ j to the χ22 PDF (Priestley\n1981; Scargle 1982).\nWe can define a (1 − \u0006)100 per cent confidence limit on γˆ,\ncall this γ\u0006 , as the level for which, at a given frequency, the\nprobability of obtaining a higher value by chance is Pr{γˆ >\nγ\u0006} = \u0006 on the assumption that the null hypothesis is true. The\nchosen value of \u0006 represents the “false alarm probability”.\n396 S. Vaughan: A simple test for periodic signals in red noise\nFig. 6. Demonstration of bias in LS fitting of the logarithm of the pe-\nriodogram. For each value of K, 105 time series were simulated (with\nan α = 2, N = 1 spectrum) and the periodogram of each time series\nwas fitted (in log space; see text) with a linear model. The parameters\nestimates were averaged over the 105 realisations. The estimators αˆ\nand log[ ˆN] are clearly unbiased.\nThe integral of the χ22 probability density gives the probabil-\nity of a single sample exceeding a value of γ\u0006 by chance:\nPr\n{\nχ2 > γ\u0006\n}\n=\n1\n2\n∫ ∞\nγ\u0006\ne−x\/2dx = e−γ\u0006\/2 = \u0006. (14)\nFor a given probability \u0006, we can rewrite this:\nγ\u0006 = −2 ln[\u0006]. (15)\nFor example, using \u0006 = 0.05 (i.e. a 95 per cent significance test)\nwe find γ0.05 = 5.99. This means that if the null hypothesis is\ntrue the probability of the ratio γˆ j being higher than 5.99 is only\n0.05. We can therefore define our 95 (and 99) per cent confi-\ndence limits on the log-periodogram as the model ˆP( f ) = ˆN f −αˆ\nmultiplied by the appropriate γ\u0006\/2. (In log-space we simply add\nthe appropriate log[γ\u0006\/2] to the model.)\nHowever, these confidence bounds correspond to a single\ntrial test, they give the probability that a periodogram point at\none particular frequency will exceed γ\u0006P j\/2. Usually there are\nn′ = n − 1 independent trials since only the Nyquist frequency\nis ignored (leaving n′ independently distributed periodogram\npoints to be examined). We must account for the number of\nindependent trials:\nγ\u0006 = −2 ln\n[\n1 − (1 − \u0006n′ )1\/n′\n]\n. (16)\nThis gives the value of γˆ that has a probability of being ex-\nceeded of \u0006n′ in n′ independent trials. In the limit of large n′\nand small \u0006 this can be approximated as γ\u0006 = −2 ln[\u0006n′\/n′]. Of\ncourse, if we knew which frequencies to test a priori then we\ncould perform <n′ independent tests and the significance levels\ncould be adjusted accordingly.\n4.2. Accounting for model uncertainty\nThe case outlined above is valid only when we know the true\npower spectrum exactly ( ˆP j = P j). In reality all we have is an\nestimated model ˆP j (which will differ from the true spectrum)\nand its uncertainty. This extra uncertainty alters the probability\ndistribution. The ratio γˆ j = 2I j\/ ˆP j is really the ratio of two ran-\ndom variables; the PDF of this would allow us to calculate the\nprobability of observing a given value of γˆ j taking full account\nof the uncertainty in the model fitting. As discussed above 2I j\nwill follow a rescaled χ22 distribution about the true spectrum.\np2I j (x) =\n1\n2P j e\n−x\/2P j . (17)\nIn the case of the LS fitting discussed in Sect. 3 the model ˆP j\nhas a log-normal distribution. The probability density of the\npower in the fitted model at frequency f j is therefore:\np\nˆP j (y) =\n1\nS jy\n√\n2π\nexp\n\n−\n(\nln[y] − M j\n)2\n2S 2j\n\n(18)\nwhere M j = ln[P j] and S j is the uncertainty on the loga-\nrithm of the model (Eq. (13)). The periodogram ordinate I j and\nthe power ˆP j in the best fitting model are only strictly inde-\npendent if the frequency of interest, f j, is excluded from the\nLS fit. Otherwise the fitted model, and hence the model power\nat this frequency, ˆP j, is influenced by I j. Although the effect\nis small (∼1\/n) it does have a substantial impact on the tail\nof the PDF. Thus, to obtain formally independent variables we\nmust calculate ˆP j (and its error) using the LS method after ig-\nnoring I j from the fit. In other words, we must ignore the can-\ndidate frequency when fitting the continuum model and then\ncompare the measured periodogram ordinate at this frequency\nwith the model derived from fitting all the other (independent)\nfrequencies.\nThe PDF of the ratio γˆ j can be obtained using the standard\nformula for the PDF of the ratio of two independent variables:\npγ j (z) =\n∫ +∞\n−∞\n|y|p2I j(zy)pP j (y)dy. (19)\nThe periodogram is always positive so we can integrate over\npositive values only.\npγ j (z)=\n1\n2S jP j\n√\n2π\n∫ +∞\n0\nexp\n−\n(ln[y] − M)2\n2S 2j\n− zy\n2P j\n dy. (20)\nThe dummy variable w = y\/P j (and dy = P jdw) can be used to\nsimplify the above equation:\npγ j (z) =\n1\nS j\n√\n8π\n∫ +∞\n0\nexp\n−\nln[w]2\n2S 2j\n− zw\n2\n dw. (21)\nS. Vaughan: A simple test for periodic signals in red noise 397\nIt is worth noting that this formula contains no dependence on\nthe actual value of P j (and hence M j). This should not be sur-\nprising because we are dealing with the distribution of the ratio\nof the data to the model, not the absolute value of the data, and\nso the absolute value of the model is not relevant. The impor-\ntant parameter is S j, describing the uncertainty on the model,\nand this can be calculated from the theory of linear regression\n(Sect. 3.2). Unlike the ideal case discussed above (Sect. 4.1)\nthe PDF is frequency-dependent, this is reflected in the changes\nof S j with frequency. As S j → 0 this formula reduces to the\nequivalent for the ideal case discussed above.\nFor a given frequency f j the integral in Eq. (21) can be\nevaluated numerically to give the PDF for γˆ j. Figure 7 com-\npares the prediction of Eq. (21) with a Monte Carlo distribution\nat two different frequencies. Also shown for comparison is the\nχ22 PDF which represents the distribution in the absence of un-\ncertainties on the model (i.e. S j → 0). At small γˆ (i.e. low sig-\nnificance peaks) the two distributions agree, whereas for large γˆ\n(i.e. high significance peaks) there is a substantial difference\nbetween the PDFs including and excluding the uncertainty on\nthe model. This means that, while the effect of including the un-\ncertainty on the model is negligible for low significance peaks,\nthe significance of high significance peaks may be substan-\ntially overestimated if this additional uncertainty is not taken\ninto account.\nThe probability of obtaining a value of γˆ j higher than γ\u0006\ncan be computed by integrating this PDF:\nPr\n{\nγˆ j > γ\u0006\n}\n=\n∫ ∞\nγ\u0006\npγ j (z)dz = \u00061. (22)\nThis can be evaluated numerically to find γ\u0006 for a given \u00061.\nEquivalently, we can find the value of γ\u0006 at the corresponding\n1 − \u00061 significance level:\nPr\n{\nγˆ j < γ\u0006\n}\n=\n∫ γ\u0006\n0\npγ j (z)dz = 1 − \u00061. (23)\nThe calculation of γ\u0006 depends only on pγ j (z), from Eq. (21),\nwhich in turn depends only on S j, from Eq. (13), and this is\ncalculated using the the abscissae (frequencies f j) with no de-\npendence on the ordinates (periodogram powers I j). The criti-\ncal value γ\u0006 can be evaluated using only the frequencies of the\nperiodogram.\nFinally, we need to correct for the number of frequencies\nexamined. The probability that a peak will be seen given that n′\nfrequencies were examined is \u0006n′ = 1 − (1 − \u00061)n′ . One can find\nthe global (1 − \u0006n′ )100 per cent confidence level by finding the\nvalue γ\u0006 that satisfies:\n∫ ∞\nγ\u0006\npγ j (z)dz = 1 − (1 − \u0006n′ )1\/n\n′ ≈ \u0006n′\/n′ (24)\nwhere n′ is again the number of frequencies examined.\nAs an illustration of the effect of the model uncertainty,\nconsider a peak in the j = 10 frequency bin of a n = 128 peri-\nodogram. Neglecting the effect of model uncertainty the nom-\ninal \u00061 = 10−4 threshold is γ\u0006 = 18.42 (using Eq. (15)). But,\nafter including the uncertainty in the model, the probability of\nthis level being exceeded is really 3.6 × 10−4 (using Eq. (22)).\nFig. 7. Monte Carlo demonstration of the PDF of the ratio γˆ j. The\nhistograms represent the distribution of the ratio γˆ j (measured at the\nj = 10 and j = 100 Fourier frequencies) from 106 Monte Carlo re-\nalisations of K = 256 time series (with an α = 2,N = 1 spectrum).\nFor each of the 106 simulated time series the periodogram was fit-\nted using the LS method, after ignoring frequency j, and the ratio\nγˆ j = 2I j\/ ˆP j was measured. The solid curve marks the predicted PDF\nusing Eq. (21) and the dotted line marks the PDF of a χ22 distribution\n(Eq. (3)). The difference between the two model PDFs is due to the\nuncertainty on the model fit. (Compare with Fig. 5 of Israel & Stella\n1996).\nFor n = 128 trials this corresponds to global significances of\n98.7 per cent confidence (ignoring the model uncertainty) and\n95.4 per cent confidence (including the model uncertainty). The\nfirst of these might be called a significant detection, but once\nthe model uncertainty is taken into account the detection is no\nlonger very significant. The difference is even more profound\nfor higher significances.\n5. Verification of the method\nThe procedures discussed above were tested using Monte Carlo\nsimulations. The simulations measured the type I error rate, or\nthe rate of “false positive” (spurious) detections of periodic sig-\nnals. For this experiment many artificial time series were gen-\nerated based on a power law spectrum (i.e. the null hypoth-\nesis). For each simulation the γ\u0006 threshold, corresponding to\na 1− \u0006 confidence level, was calculated and the number of peri-\nodogram ordinates that exceeded this value were recorded. The\nrate measured from the Monte Carlo simulations should be the\nsame as the false alarm probability \u0006, often called the “size of\nthe test”, which is the expected rate of type I errors. If the\n398 S. Vaughan: A simple test for periodic signals in red noise\nFig. 8. Monte Carlo study of the performance of tests for significant\nperiodogram peaks. For each panel 106 random time series of length\nK = 256 were generated (with an α = 2,N = 1 spectrum). For each\nof the 127 frequencies tested (=K\/2 − 1 since the Nyquist frequency\nwas ignored) the fraction of Monte Carlo simulations with a peak ex-\nceeding the nominal 99.9 and 99.99 per cent confidence levels was\nrecorded. The upper panel used the confidence levels from Eq. (15).\nThe lower panel used the confidence levels computed with Eq. (22)\nwhich accounts for the uncertainty in the model. The error bars were\ncomputed using\n√\np(1 − p)\/N where N is the number of simulations.\nobserved rate of false detections exceeds the nominal size of\nthe test then one should expect an excess of spurious detec-\ntions (detections may not be reliable). If the observed rate falls\nbelow the nominal test size then the test is conservative (it gives\neven fewer spurious detections than expected).\nThe Monte Carlo rate was derived from 106 random time\nseries of length K = 256 (generated with a α = 2,N = 1 spec-\ntrum). For each series the periodogram was computed and fitted\nusing the LS method. In the first run, the effects of the uncer-\ntainty on the model were ignored and the γ\u0006 thresholds were\ncomputed for \u00061 = 10−3 and 10−4 using Eq. (15). These corre-\nsponds to 99.9 and 99.99 per cent confidence levels in a single\ntrial test. For each frequency the fraction of simulations that\nshow peaks larger than the threshold was recorded. As shown\nin Fig. 8 (upper panel) the observed rate of type I errors in the\nFig. 9. Same periodogram as in Fig. 1. Plotted are the de-biased LS es-\ntimate of the power law spectral model (solid curve) and the 95 and\n99 per cent upper limits (dotted curves) on the expected power (global\nsignificance levels for n = 127 independent frequencies).\nsimulated data was far in excess of the nominal size of the test.\nThus the actual rate of spurious detections was higher than the\nnominal test size, and greatly so at low frequencies where the\nmodel is more uncertain. The situation is worse at high signif-\nicances (small test sizes) because the tail of the PDF diverges\nfrom the expectation (Fig. 7). This means that significances cal-\nculated by Eq. (15) will be overestimated.\nThe situation is much better when the γ\u0006 threshold was\ncomputed (again for \u00061 = 10−3, 10−4) using Eq. (22). Again\n106 random time series were generated with K = 256 using\nthe same spectrum. For each periodogram the model power ˆP j,\nand its error parameters S j, were computed by ignoring fre-\nquency f j and then fitting with the LS method. The ratio γˆ j was\ncompared to the critical threshold γ\u0006 (computed from Eq. (22))\nat each frequency. The fraction of Monte Carlo simulations that\nshowed “significant” peaks was very close to the expected level\n(the nominal size) and independent of frequency. The excep-\ntions are the≈5 lowest frequencies. Here the model is least con-\nstrained and the assumption implicit in Eq. (11), that the distri-\nbution of log[ ˆP j] is normal, becomes inaccurate. For j >∼ 5 the\nconfidence levels predicted by Eq. (22) gave the correct rate of\ntype I errors.\nFigure 9 shows a specific example, namely the same data\nas in Fig. 1, with the LS power law model. Also shown are the\n(“global”) n′-trial confidence limits computed as discussed in\nSect. 4.2. Clearly none of the peaks in the periodogram exceeds\nthe 95 per cent limit, as expected for red noise.\n6. Caveats and comparison with other methods\n6.1. Underlying assumptions\nIn order for the test to give reliable significance limits the un-\nderlying noise spectrum must be a power law. Clearly if the\nbroad-band noise spectrum does not resemble a power law the\nresults of the LS fitting will not be valid. The general solution\nto this problem is to replace the LS fitting procedure with the\nS. Vaughan: A simple test for periodic signals in red noise 399\nexact maximum likelihood (ML) procedure for fitting the χ22\ndistributed periodogram. The appendix describes this method.\nThe test was intended to be used for assessing the signif-\nicance of peaks in the periodograms of X-ray observations of\nSeyfert galaxies, which tend to be rather short K ∼ 103 and also\nshow significant variance due to measurement errors (Poisson\nnoise). These measurement uncertainties produce a flat com-\nponent that is added to the source power spectrum in the peri-\nodogram. The effect will cause the observed spectrum to flatten\nat high frequencies as the power in the red noise spectrum of\nthe source becomes comparable to the power in the flat Poisson\nnoise spectrum. Using the normalisation given in Eq. (1) the ex-\npected Poisson noise level is PN = 2(〈x〉 + B)\/〈x〉2 where 〈x〉\nis the mean count rate and B is the mean background rate3. It\nis also now known that at low frequencies the power spectra of\nSeyferts break from a single power law (e.g. Uttley et al. 2002;\nMarkowitz et al. 2003). These deviations from a single power\nlaw should be accounted for in modelling the spectrum. The\nsimplest solution is to divide the periodogram into frequency\nranges within which the power spectrum is approximately a\nsingle power law. The period detection test can then be used\nas described above. The crucial point is that as long as the\nperiodogram can be fitted reasonably well with a power law\nover a frequency range of interest (as judged using the KS test)\nthe test will be valid. Alternatively one may fit a model of a\npower law plus constant (to account for the flattening) using\nthe ML method discussed in the Appendix.\nFurthermore, the test, which is based on the discrete\nFourier transform, is most sensitive to sinusoidal periodici-\nties. Non-sinusoidal variations will have their power spread\nover several frequencies which will lessen the detection sig-\nnificance in any one given frequency. Other methods such as\nepoch folding (Leahy et al. 1983), whereby one bins the time\nseries into phase bins at a test period, can be more sensitive to\nsuch variations. At the correct period the periodic variations\nwill sum while any background noise will cancel out, thus\nrevealing the profile of the periodic pulsations. However, the\nbackground noise will only cancel out if it is temporally inde-\npendent, i.e. white noise. Again, the presence of any underlying\nred noise variations may produce unreliable results (Benlloch\net al. 2001) if not correctly accounted.\n6.2. Comparison with other methods\n6.2.1. Lomb-Scargle periodogram\nThe method described above is based around the standard\n(Fourier) periodogram and therefore requires uniformly sam-\npled time series. This ensures the asymptotic independence of\nthe periodogram ordinates. If the time series is non-uniformly\nsampled one may use other periodogram estimators such as the\nLomb-Scargle periodogram (Lomb 1976; Scargle 1982; Press\n& Rybicki 1989). However, the behaviour of these will not be\nidentical to that discussed above. The above procedure should\n3 For the case of Gaussian errors σk on each flux measurement the\nexpected Gaussian noise level is PN = 2∆T 〈σ2〉\/〈x〉2. This assumes\nthe time series comprises contiguous bins of length ∆T .\nnot be used on non-uniformly sampled time series (nor should\nthe method discussed in Sect. 13.8 of Press et al. 1996 be used\nin the presence of non-white noise). Zhou & Sornette (2001)\ndiscuss the results of Monte Carlo tests on the distribution of\npeaks in the Lomb-Scargle periodogram for various types of\nprocesses.\n6.2.2. Oversampled periodogram\nOversampling the periodogram, i.e. calculating periodogram\nordinates at frequencies between the normal Fourier frequen-\ncies, is sometimes done in order to increase the sensitivity to\nweak signals that lie at frequencies between two Fourier fre-\nquencies. A periodic variation with a frequency nearly equidis-\ntant between two adjacent Fourier frequencies, e.g. between f j\nand f j+1, will have its power spread (almost entirely) between\nthese two frequencies, thus reducing the significance in any\none frequency bin. The reduction in power per bin can be as\nmuch as ≈4\/π2 ≈ 0.41. In these situations oversampling the\nperiodogram by including additional frequencies between f j\nand f j+1 can increase sensitivity to the periodicity. However,\nit must also be noted that by oversampling the periodogram\none is testing more than K\/2 frequencies, allowing many more\nopportunities to find spurious peaks. The number of trials in-\ncreases above the usual n = K\/2 case if the periodogram is\noversampled, although the effective number of independent tri-\nals does not scale linearly with the oversampling factor because\nthere is a fixed number (n) of strictly independent frequencies\n(the Fourier frequencies).\nOversampling the periodogram and assuming ≈n trials will\ntend to overestimate the significance of peaks in the peri-\nodogram. This was demonstrated by Monte Carlo simulations\n(see Fig. 10). For this demonstration 104 white noise time series\n(spectrum: α = 0,N = 1) were generated with length K = 256\nand for each one the periodogram was calculated using both\nthe standard Fourier frequencies and also oversampling the fre-\nquency resolution by a factor 8. The peak power in the peri-\nodogram of each of the simulated time series was recorded.\nThe distribution of peak powers is shown in Fig. 10 for both the\nstandard and the oversampled periodograms. There is an obvi-\nous tendency for the oversampled periodogram to show slightly\nhigher peak values, as might be expected based on the above\narguments. These peak powers were translated to “global” sig-\nnificances (assuming n independent trials) and the distribution\nof significances is shown in the lower panel of Fig. 10. The\ndistribution is flat for the Fourier sampled periodogram: the\nsignificance of the peaks is exactly as expected. The distribu-\ntion derived from the oversampled periodogram clearly shows\na substantial excess of high significance peaks. This means that\nthe oversampled periodogram is likely to produce many more\nspurious peaks than expected if one assumes only n indepen-\ndent trials were made. A Monte Carlo estimate of the global\nsignificance would be required to calibrate the significance of\npeaks in oversampled periodogram (and find a more realistic\neffective number of trials).\nAn alternative to oversampling the periodogram is to\nperform a sliding two-bin search for periodogram peaks\n400 S. Vaughan: A simple test for periodic signals in red noise\nFig. 10. Comparison between periodograms sampled at the\nK\/2 Fourier frequencies and oversampled by a factor 8. The\nupper panel shows the distribution of peaks in the periodogram from\n104 random white noise time series of length K = 256 (using an\nα = 0,N = 1 spectrum). For each simulation the value of the peak of\nthe periodogram was recorded for the standard (solid histogram) and\noversampled (dotted histogram) case. The oversampled periodograms\nclearly show slightly larger peak values. The lower panel shows the\nsame data except the peak powers have been converted to “global”\nsignificances using Eq. (16).\nusing the standard Fourier frequencies only, as discussed by\nvan der Klis (1989; Sect. 6.4). This increases the sensitivity\nto periods whose frequencies fall between the Fourier frequen-\ncies. However, one will still need to perform Monte Carlo sim-\nulations to assess the global significance (by measuring the rate\nof type I errors in the simulations).\n6.2.3. Monte Carlo testing\nAn alternative test for periodic variations in red noise is\nto estimate the likelihood of observing a given peak using\nMonte Carlo simulations of red noise processes (Benlloch\net al. 2001; Halpern et al. 2003). However, the method of\nBenlloch et al. (2001) does not account for uncertainties in\nthe best-fitting model, which can seriously effect the apparent\nsignificances of strong peaks (Sect. 4.2). Monte Carlo simula-\ntions are only as good as the model they assume! One solution\nwould be to map the (multi-dimensional) distribution of the\nmodel parameters and for each simulation draw the model pa-\nrameters at random from this distribution. This would thereby\naccount for the uncertainty in the model parameters. (Protassov\net al. 2002 use a similar approach to calculate posterior predic-\ntive p-values.)\n7. Discussion\nA simple procedure is presented for assessing the significance\nof peaks in a periodogram when the underlying continuum\nnoise has a power law spectrum.\n7.1. Recipe\nThe following is one possible recipe for periodogram analysis.\n– Calculate the periodogram of the data I( f j) (Sect. 2) and\nconvert to log-space, i.e. log[ f j] and log[I( f j)].\n– Ignore the Nyquist frequency and frequencies above which\nPoisson noise is significant, leaving n′ frequencies.\n– Estimate the power law parameters by fitting a linear func-\ntion to the log-periodogram using the LS method (Sect. 3).\n– Test the goodness of the fit by comparing the distribution of\ndata\/model residuals with the χ22 expectation using a KS test\n(Sect. 3).\n– Calculate the “global” (n′-trial) threshold ratio for a (1 −\n\u0006) significance detection using γ\u0006 = −2 ln[1 − (1 − \u0006)1\/n′ ]\nwhere n′ is number of periodogram points used in the fit\nand \u0006 is the desired “false alarm probability” (Sect. 4.1).\n– Multiply the best-fitting continuum model by γ\u0006\/2 (or add\nits logarithm in log-space).\nThis will provide an estimate of the power spectral slope and\nnormalisation and a first indication of the presence of signif-\nicant periodicities. However, as discussed in Sect. 4.2 the un-\ncertainty inherent in the model fitting means that the signif-\nicances of strong peaks may be substantially overestimated.\nThis procedure should be quite accurate for low significance\npeaks however, meaning that the above procedure is valid for\nrejecting low significance peaks (\u00061 > 0.01). The inaccuracy\nof the method at high powers means that the procedure should\nonly be used to reject low significance peaks, not detect high\nsignificance peaks. In order to obtain a more rigorous estimate\nof the significance of stronger peaks one needs to account for\nthe additional uncertainty in the model.\nFor a given frequency of interest, f j, one must:\n– Ignore f j from the fit (in order that the data and model are\nindependent at f j).\n– Re-fit the periodogram using the LS method (Sect. 3).\n– Calculate the power in the model at this frequency, ˆP j.\n– Measure the ratio γˆ j = 2I j\/ ˆP j.\n– Compute the uncertainties on the model parameters\n(Sect. 3.2) and hence the uncertainty on the model contin-\nuum S j (Sect. 3.3).\nS. Vaughan: A simple test for periodic signals in red noise 401\n– Calculate the probability of observing a value of γˆ j this\nhigh by numerically integrating Eq. (22).\nThe above procedure is essentially the application of two\nstandard tools for time series analysis. The first is estimat-\ning the power law spectral properties by LS fitting of the\nlog-periodogram. This has been discussed by several authors\n(e.g. Geweke & Porter-Hudak 1983; Fougere 1985; Pilgram &\nKaplan 1998). The second tool is applying the known χ22 prop-\nerties of the periodogram to estimate confidence levels, as is\nstandard for white noise spectra (Priestley 1981; van der Klis\n1989). The additional calculation to include the uncertainty in\nthe model follows standard statistical procedures. The overall\napproach is similar to that discussed by Israel & Stella (1996)\nbut is tailored to power law spectra.\nIn order for the method to produce reliable results the un-\nderlying power spectrum has to be a power law. However, the\ntest will work well even for data that show deviations from a\npower law (such as intrinsic low frequency flattening or high\nfrequency flattening due to Poisson noise) provided the peri-\nodogram is divided into frequency intervals within which a sin-\ngle power law provides a good description of the data (deter-\nmined with a KS test). In this case the power spectrum over the\nrestricted frequency ranges is indistinguishable from a power\nlaw and, when applied to these limited frequency ranges, the\nmethod will function as expected.\n7.2. Application to real data\nAs a demonstration of the method we present a re-analysis\nof the X-ray observations of two Seyfert galaxies. The first\nis the long ASCA observation of IRAS 18325–5926 (Iwasawa\net al. 1998) and the second is the XMM-Newton GTO obser-\nvation of Mrk 766 (Boller et al. 2001). For IRAS 18325–5926\na background-subtracted 0.5−10 keV SIS0 light curve was ex-\ntracted in 100-s bins, using a 4 arcmin radius source region,\nand rebinned onto an evenly spaced grid at the spacecraft or-\nbital period (5760-s). For Mrk 766 a background-subtracted,\nexposure-corrected 0.2−2 keV light curve was extracted from\nthe EPIC pn using a 38 arcsec radius source region. The re-\nbinned IRAS 18325–5926 light curve contained 84 regularly\nspaced bins and the Mrk 766 light curve contained 330 con-\ntiguous 100-s bins.\nThe periodogram of each light curve was calculated and\nthe expected Poisson noise level determined. Only the lowest\nfrequency periodogram points were examined, to minimise the\neffect of the Poisson noise level. For IRAS 18325–5926 only\nthe 19 lowest frequency points were used, while for Mrk 766\nonly 97 points were used. These were fitted with a linear func-\ntion in log-space, giving slopes of α ≈ 0.9 and α ≈ 1.8\nfor IRAS 18325–5926 and Mrk 766, respectively. The 95 and\n99 per cent confidence limits on the periodogram were com-\nputed, accounting for the number of frequencies examined in\neach case (see Figs. 11 and 12). In neither object did a single\nperiodogram point exceed the 95 per cent limit, meaning that\nthere is no strong evidence to suggest a periodic component\nto their variability, contrary to the original claims of Iwasawa\net al. (1998; fP ≈ 1.7 × 10−5 Hz) and Boller et al. (2001;\nFig. 11. Periodogram of IRAS 18325–5926 from ASCA. Plotted are\nthe de-biased LS estimate of the power law spectral model (solid\ncurve) and the 95 and 99 per cent upper limits (dotted curves) on the\nexpected power (global significance levels for n = 19 independent\nfrequencies). Also shown is the expected level of the Poisson noise\npower.\nFig. 12. Periodogram of Mrk 766 from XMM-Newton.\nfP ≈ 2.4 × 10−4 Hz). Benlloch et al. (2001) drew similar\nconclusions based on Monte Carlo simulations.\n7.3. Conclusions\nThe simplicity of the proposed test means that it can be used as\na quick, first check against spurious periodogram peaks, with-\nout the need for extensive Monte Carlo simulations. Examples\nwhere this test might be useful include not only X-ray obser-\nvations of Seyferts but also testing for periodic components in\nmonitoring of blazars (e.g. Kranich et al. 1999; Hayashida et al.\n1998), the Galactic centre (Genzel et al. 2003) and other astro-\nphysical sources that show red noise variations.\nThe basic idea behind the method is to de-redden the pe-\nriodogram by dividing out the best-fitting power law and then\nusing the known distribution of the periodogram ordinates to\nestimate the likelihood of observing a given peak if the null\n402 S. Vaughan: A simple test for periodic signals in red noise\nhypothesis (power law spectrum with no periodicity) is true.\nHowever, this should not be treated as a “black box” solution to\nthe problem of detecting periodicities in red noise data. There\nis no substitute for a thorough understanding of the nuances of\npower spectral statistics, as illustrated by the PDFs discussed\nin Sect. 4.2. The tail of the PDF is very sensitive to the details\nof the method, and thus one needs to treat any periodogram\nanalysis with great care in order to avoid overestimating the\nsignificance of a peak.\nTo date the most significant candidate periodicities found\nin the X-ray variations active galaxies are those in long EUVE\nobservations of three nearby Seyferts by Halpern et al. (2003).\nHowever, their published global significances will be overesti-\nmates for two reasons: (i) no account was made of the uncer-\ntainty on the model and (ii) the periodograms were oversam-\npled. These two separate issues both act to artificially boost\nthe apparent significance of spurious signals, as discussed in\nSects. 4.2 and 6.2.2, respectively. Similarly the apparently sig-\nnificant candidate periodicity in NGC 5548 found by Papadakis\n& Lawrence (1993b) was shown to be substantially less sig-\nnificant when the uncertainty in the modelling was included\n(Tagliaferri et al. 1996). This leaves us in the interesting situa-\ntion of there being not one surviving, robustly determined and\nsignificant (>99 per cent) periodicity in the X-ray variability of\nan active galaxy.\nFinally we close with a plea. There exist many more\nAGN light curves and periodograms than have been published.\nThere is a natural publication bias: those that show the most\n“significant” features get published. This means the true num-\nber of trials is much larger than for any one given experiment.\nIn such situations one should treat with caution the significance\nof the subset of results that are published (e.g. Scargle 2000).\nThat is, until a result is published that is so significant that it\ncannot be accounted for by publication bias. The detection of\nperiodic or quasi-periodic variations in galactic nuclei would\nbe a major discovery and of great importance to the field. The\nimportance of the result should be argument enough for very\nhigh standards of discovery. We would therefore advocate se-\nrious further investigation of only those candidate periodicities\nwith high significances (such as a >99.9 per cent confidence,\nor a “3σ minimum,” criterion) after accounting for all likely\nsources of error.\nAcknowledgements. I acknowledge financial support from the\nPPARC, UK. I also thank Phil Uttley for many useful discussions and\nIossif Papadakis for a very thorough referee’s report that encouraged\nme to expand several sections of the paper.\nAppendix A: Maximum likelihood (ML) fitting\nIn this section we briefly elucidate the exact method of max-\nimum likelihood (ML) fitting periodograms. See Anderson,\nDuvall & Jefferies (1990) and Stella et al. (1997) for more\ndetails. The probability density function (PDF) of the peri-\nodogram ordinates at each frequency are given by:\np(I j) = 1P j e\n−I j\/P j (A.1)\nwhereP j is the true underlying spectrum (the expectation value\nof the periodogram) at frequency f j. This is valid for frequen-\ncies j = 1, 2, . . . , n − 1 since the periodogram ordinate at the\nj = n (Nyquist) frequency is distributed differently.\nAssuming a model ˆP j(ˆθk), determined by parameters ˆθk =\n{ˆθ1, ˆθ2, . . . , ˆθM}, we can write the joint probability density of\nobserving the n − 1 periodogram ordinates:\nL =\nn−1∏\nj=1\np(I j) =\nn−1∏\nj=1\n1\nˆP j\ne−I j\/ ˆP j . (A.2)\nIf the data I j have already been observed this represents the\nlikelihood function. Maximising the likelihood L is equivalent\nto minimising S ≡ −2 ln[L] and we can rewrite this as:\nS = 2\nn−1∑\nj=1\nln\n[\nˆP j\n]\n+\nI j\nˆP j\n · (A.3)\nFinding the model parameters ˆθk that minimise S will yield the\nmaximum likelihood parameter values.\nOne can then use standard tools of maximum likelihood\nanalysis, such as the likelihood ratio test (LRT) to test for addi-\ntional free parameters in the model:\nR = −2 ln [L1\/L2] = S 1 − S 2 (A.4)\nwhereL1 represents the likelihood for the simpler (more parsi-\nmonious) model andL2 represents the likelihood for the model\nwith the additional free parameters. The second, more complex\nmodel, always contains within it the simpler model as a sub-\nset (the models are nested) and therefore the likelihood for the\nmore complex model is always equal to or greater than that for\nthe simpler model. With certain restrictions (see Protassov et al.\n2002) R is distributed as a χ2ν variable where ν is the number\nof additional free parameters. This test could be used, for ex-\nample, to compare nested models such as broken and unbroken\npower laws.\nAlternatively one can compare different models using the\nAkaike Information Criterion (AIC; Akaike 1973):\nAICi = −2 ln [Li] + 2ki = S i + 2ki (A.5)\nwhere Li is the likelihood and ki is the number of free pa-\nrameters for model i. The second term in the sum is a penalty\nfor including more free parameters. The model that minimises\nthe AIC is considered to be the best (the models need not be\nnested).\nOne can also use ∆S = −2∆ ln[L] to place confidence\nlimits on the model parameters in a fashion exactly analo-\ngous to mapping confidence contours using ∆χ2 (Sect. 15.6\nof Press et al. 1996). Under fairly general conditions (see\nCash 1979), e.g. the ln[L]-surface is approximately shaped like\na multi-dimensional paraboloid,∆S is distributed as χ2ν where ν\nis the number of parameters of interest (e.g. ν = 1 for the\none-dimensional confidence region on an individual parame-\nter). One can use standard tables of χ2ν values to place confi-\ndence limits (e.g. ∆S = 2.71 corresponds to 90 per cent confi-\ndence limits on one parameter).\nS. Vaughan: A simple test for periodic signals in red noise 403\nFor the purposes of period searching one may fit a suitable\nM-parameter continuum model (representing the null hypothe-\nsis, i.e., no periodic signal) using the ML method and define the\nM-dimensional distribution of its parameters (using ∆S ). One\ncan then use this M-dimensional distribution of the model pa-\nrameters to randomly draw models for Monte Carlo simulation.\nThis procedure will thereby account for the likely distribution\nof model parameters (which gives rise to uncertainties in the\nestimated continuum level).\nReferences\nAbramowicz, M. A., Kluzniak, W., McClintock, J. E., & Remillard,\nR. A. 2004, ApJ, 609, L63\nAbramowitz, M., & Stegun, I. A. 1964, Handbook of Mathematical\nFunctions, Applied Mathematics Series, Vol. 55 (New York:\nDover Publications)\nAkaike, H. 1973, in 2nd International Symposium on Information\nTheory, ed. B. N. Petrov, & F. Csáki (Budapest: Akadémiai Kiado)\nAnderson, E. R., Duvall, T. L., & Jefferies, S. M. 1990, ApJ, 364, 699\nBenlloch, S., Wilms, J., Edelson, R., Yaqoob, T., & Staubert, R. 2001,\nApJ, 562, L121\nBevington, P. R., & Robinson, D. K. 1992, Data Reduction and Error\nAnalysis for the Physical Sciences (New York: McGraw-Hill)\nBloomfield, P. 2000, Fourier Analysis of Time Series (New York:\nWiley)\nBoller, Th., Keil, R., Trümper, J., et al. 2001, A&A, 365, L146\nCash, W. 1979, ApJ, 228, 939\nChatfield, C. 1989, The analysis of time series: theory and practice,\n4th ed. (London: Chapman & Hall)\nFisher, R. A. 1929, Proceedings of the Royal Society on London:\nSeries A, 125, 54\nFougere, P. F. 1985, J. Geophys. Res., 90, 4355\nGenzel, R., Schödel, R., Eckart, A., et al. 2003, Nature, 425, 934\nGeweke, J., & Porter-Hudak, S. 1983, Journal of Time Series\nAnalysis, 4, 221\nGroth, E. J. 1975, ApJS, 29, 285\nHalpern, J. P., Leighly, K. M., & Marshall, H. L. 2003, ApJ, 585, 665\nHayashida, N., Hirasawa, H., Ishikawa, F., et al. 1998, ApJ, 504, L71\nIsrael, G. L., & Stella, L. 1996, ApJ, 468, 369\nIwasawa, K., Fabian, A. C., Brandt, W. N., et al. 1998, MNRAS, 295,\nL20\nJenkins, G. M., & Watts, D. G. 1968, Spectral Analysis and its\nApplications (San Fancisco: Holden-Day)\nKoen, C. 1990, ApJ, 348, 700\nKranich, D., deJager, O. C., Kestel, M., et al. 1999, in Proc. of 26th\nInternational Cosmic Ray Conference (Salt Lake City), 3, 358\nLawrence, A., Watson, M. G., Pounds, K. A., & Elvis, M. 1987,\nNature, 325, 694\nLeahy, D. A., Darbro, W., Elsner, R. F., et al. 1983, ApJ, 266, 160\nLomb, N. R. 1976, Ap&SS, 39, 447\nMarkowitz, A., Edelson, R., Vaughan, S., et al. 2003, ApJ, 593, 96\nMcClintock, J. E., & Remillard, R. A. 2004, in Compact Stellar X-ray\nSources, ed. W. H. G. Lewin, & M. van der Klis (Cambridge:\nCambridge University Press), in press\n[arXiv:astro-ph\/0306213]\nPapadakis, I. E., & Lawrence, A. 1993a, MNRAS, 261, 612\nPapadakis, I. E., & Lawrence, A. 1993b, Nature, 361, 233\nPilgram, B., & Kaplan, D. T. 1998, Physica D, 114, 108\nPress, W. H. 1978, Comments Astrophys., 7, 103\nPress, W. H., & Rybicki, G. B. 1989, ApJ, 338, 277\nPress, W. H., Teukolsky, S. A., Vetterling, W. T., & Flannery, B. P.\n1996, Numerical Recipes (Cambridge: Cambridge Univ. Press)\nPriestley, M. B. 1981, Spectral Analysis and Time Series (London:\nAcademic Press)\nProtassov, R., van Dyk, D. A., Connors, A., Kashyap, V. L., &\nSiemiginowska, A. 2002, ApJ, 571, 545\nScargle, J. D. 1982, ApJ, 263, 835\nScargle, J. D. 2000, Journal of Scientific Exploration, 14, 91\n[arXiv:physics\/9909033]\nSchuster, A. 1898, Terrestrial Magnetism, 3, 24\nStella, L., Arlandi, E., Tagliaferri, G., & Israel, G. L. 1997,\nin Applications of Time Series Analysis in Astronomy and\nMeteorology, ed. T. Subba Rao, M. B. Priestley, & O. Lessi\n(London: Chapman & Hall) [arXiv:astro-ph\/9411050]\nTagliaferri, G., Bao, G., Israel, G. L., Stella, L., & Treves, A. 1996,\nApJ, 465, 181\nTimmer, J., & König, M. 1995, A&A, 300, 707\nUttley, P., McHardy, I. M., & Papadakis, I. 2002, MNRAS, 332, 231\nvan der Klis, M. 1989, in Timing Neutron Stars, ed. H. Ogelman,\nE. P. J. van den Heuvel (Dordrecht: Kluwer), NATO ASI Series C,\n262, 27\nvan der Klis, M. 1995, in X-ray Binaries, ed. W. H. G. Lewin, J.\nvan Paradijs, & E. P. J. van den Heuvel (Cambridge: Cambridge\nUniv. Press), 252\nWall, J. V., & Jenkins, C. R. 2003, Practical statistics for astronomers\n(Cambridge: Cambridge University Press)\nZhou, W.-X., & Sornette, D. 2001, Int. J. Mod. Phys. C, 13, 137\n"}