{"doi":"10.1063\/1.1380368","coreId":"68646","oai":"oai:eprints.lancs.ac.uk:31820","identifiers":["oai:eprints.lancs.ac.uk:31820","10.1063\/1.1380368"],"title":"Activated escape of periodically driven systems","authors":["Dykman, Mark","McCann, L. I.","Smelyanskiy, V. N.","Luchinsky, D. G.","Mannella, R.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-08-31","abstract":"We discuss activated escape from a metastable state of a system driven by a time-periodic force. We show that the escape probabilities can be changed very strongly even by a comparatively weak force. In a broad parameter range, the activation energy of escape depends linearly on the force amplitude. This dependence is described by the logarithmic susceptibility, which is analyzed theoretically and through analog and digital simulations. A closed-form explicit expression for the escape rate of an overdamped Brownian particle is presented and shown to be in quantitative agreement with the simulations. We also describe experiments on a Brownian particle optically trapped in a double-well potential. A suitable periodic modulation of the optical intensity breaks the spatio-temporal symmetry of an otherwise spatially symmetric system. This has allowed us to localize a particle in one of the symmetric wells","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68646.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31820\/1\/Chaos2001ActivatedEscape.pdf","pdfHashValue":"c4683b5a80f4c525680d2c96adee78c89c2258e0","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31820<\/identifier><datestamp>\n      2018-01-24T02:56:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Activated escape of periodically driven systems<\/dc:title><dc:creator>\n        Dykman, Mark<\/dc:creator><dc:creator>\n        McCann, L. I.<\/dc:creator><dc:creator>\n        Smelyanskiy, V. N.<\/dc:creator><dc:creator>\n        Luchinsky, D. G.<\/dc:creator><dc:creator>\n        Mannella, R.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We discuss activated escape from a metastable state of a system driven by a time-periodic force. We show that the escape probabilities can be changed very strongly even by a comparatively weak force. In a broad parameter range, the activation energy of escape depends linearly on the force amplitude. This dependence is described by the logarithmic susceptibility, which is analyzed theoretically and through analog and digital simulations. A closed-form explicit expression for the escape rate of an overdamped Brownian particle is presented and shown to be in quantitative agreement with the simulations. We also describe experiments on a Brownian particle optically trapped in a double-well potential. A suitable periodic modulation of the optical intensity breaks the spatio-temporal symmetry of an otherwise spatially symmetric system. This has allowed us to localize a particle in one of the symmetric wells.<\/dc:description><dc:date>\n        2001-08-31<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31820\/1\/Chaos2001ActivatedEscape.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1380368<\/dc:relation><dc:identifier>\n        Dykman, Mark and McCann, L. I. and Smelyanskiy, V. N. and Luchinsky, D. G. and Mannella, R. and McClintock, Peter V. E. (2001) Activated escape of periodically driven systems. Chaos, 11 (3). pp. 587-594. ISSN 1054-1500<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31820\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1063\/1.1380368","http:\/\/eprints.lancs.ac.uk\/31820\/"],"year":2001,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"CHAOS VOLUME 11, NUMBER 3 SEPTEMBER 2001Activated escape of periodically driven systems\nM. I. Dykmana) and B. Golding\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, Michigan 48824\nL. I. McCann\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, Michigan 48824\nand Department of Physics, University of Wisconsin-River Falls, River Falls, Wisconsin 54022\nV. N. Smelyanskiy\nDepartment of Physics and Astronomy, Michigan State University, East Lansing, Michigan 48824\nand NASA Ames Research Center, MS 269-2, Moffett Field, California 94035-1000\nD. G. Luchinsky\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom\nR. Mannella\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom\nand Dipartimento di Fisica, Universita` di Pisa and INFM UdR Pisa, Via F. Buonarroti 2, 56100 Pisa, Italy\nP. V. E. McClintock\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom\n~Received 20 December 2000; accepted 27 April 2001; published 31 August 2001!\nWe discuss activated escape from a metastable state of a system driven by a time-periodic force. We\nshow that the escape probabilities can be changed very strongly even by a comparatively weak\nforce. In a broad parameter range, the activation energy of escape depends linearly on the force\namplitude. This dependence is described by the logarithmic susceptibility, which is analyzed\ntheoretically and through analog and digital simulations. A closed-form explicit expression for the\nescape rate of an overdamped Brownian particle is presented and shown to be in quantitative\nagreement with the simulations. We also describe experiments on a Brownian particle optically\ntrapped in a double-well potential. A suitable periodic modulation of the optical intensity breaks the\nspatio-temporal symmetry of an otherwise spatially symmetric system. This has allowed us to\nlocalize a particle in one of the symmetric wells. © 2001 American Institute of Physics.\n@DOI: 10.1063\/1.1380368#Fluctuation-induced escape from a metastable state is at\nthe root of many physical phenomena, from diffusion in\ncrystals to protein folding, and is closely related to nucle-\nation in phase transitions and activated chemical reac-\ntions. In all these phenomena it would be advantageous to\ncontrol the escape probability by applying an external\nforce. The problem of escape of driven systems has there-\nfore attracted much attention in diverse contexts, a recent\napplication being stochastic resonance.1 We show that\nthis problem can be solved in a very general form for a\nbroad range of driving field frequencies, which goes far\nbeyond the adiabatic limit. The analytic theory is com-\npared with the results of analog and digital simulations.\nWe then discuss experiments on controlling escape in\nmodulated optical traps. An important application of the\nresults is the possibility of selective control of particle\ndiffusion in a periodic potential, including both the rate\nand direction of the diffusion.\nI. INTRODUCTION\nThe question of how a system responds to an external\nfield is one of the fundamental problems of physics. A strong\na!Author to whom correspondence should be addressed. Electronic mail:\ndykman@pa.msu.edu5871054-1500\/2001\/11(3)\/587\/8\/$18.00\nDownloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Anonlinear response is usually associated with a sharply reso-\nnant excitation of the system. However, the effect of external\ndriving may also be extremely large for an important and\nwide class of phenomena related to large fluctuations, includ-\ning escape from a metastable state and nucleation in phase\ntransitions.\nThe mechanism responsible is readily understood for\nadiabatically slow driving, where the driving frequency is\nsmall compared to the relaxation rate in the absence of fluc-\ntuations and the system remains in quasiequilibrium. For sys-\ntems in thermal equilibrium, the fluctuation probabilities are\ngiven by the activation law, W}exp(2R\/kBT). For large in-\nfrequent fluctuations, which are discussed in the present pa-\nper, the probabilities W are much less than all frequencies\nand relaxation rates. We will be specifically interested in ac-\ntivated escape, in which case R is the activation energy of\nescape. The driving force modulates the value of R quasi-\nstatically and, even where the modulation amplitude udRu is\nsmall compared to R , it may still substantially exceed kBT ,\nin which case W will be changed very strongly. We empha-\nsize that the change of the activation energy is linear in the\nfield amplitude, for udRu!R .\nFor higher field frequencies, where the driving becomes\nnonadiabatic, the expected major effect of the field would be\nto ‘‘heat up’’ the system by changing its effective tempera-\nture. Indeed, in the weak-field limit, the escape rate W is© 2001 American Institute of Physics\nIP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n588 Chaos, Vol. 11, No. 3, 2001 Dykman et al.known, theoretically2 and experimentally,3 to be incremented\nby a term proportional to the field intensity I rather than the\namplitude A}I1\/2.2 However, one may ask what happens if\nthe appropriately weighted field amplitude is not small com-\npared to the fluctuation intensity ~temperature!, and whether\nan exponentially strong change of the escape rate will occur.\nTheoretical analysis of nonadiabatically driven systems\nis complicated, since one may no longer assume that the\nsystem is in thermal equilibrium. Whereas for equilibrium\nsystems the exponent in the escape rate can be found, at least\nin principle, as the height of the free-energy barrier, for non-\nequilibrium systems there are no universal relations from\nwhich it can be obtained;4 the situation with the prefactor is\neven more complicated.5 Much effort has been put into solv-\ning the nonadiabatic response problem, in diverse contexts,\nand numerical results have been obtained for specific models\n~see, e.g., Refs. 6 and 7!.\nRecent theoretical results8,9 show that, counter-\nintuitively, for high-frequency driving the change of R is\nproportional to the field amplitude, i.e., ln W is linear in A ,\nover a broad range of A . The proportionality coefficient was\ncalled the logarithmic susceptibility ~LS!. Just like the con-\nventional linear susceptibility, the LS relates the response of\nthe system in the presence of external driving to its dynamics\nin thermal equilibrium in the absence of the driving field. We\nemphasize that the amplitude is a nonanalytic characteristic\nof the field, as it is obtained by taking the square root of the\nperiod-averaged squared field. We are therefore talking about\na nonanalytic field dependence of the escape rate, and we\nneed to determine a mechanism that would lead to such a\ndependence.\nIn Sec. II we provide a general formulation which allows\none to find, for a periodically driven system, the activation\nenergy of escape induced by Gaussian noise with an arbitrary\npower spectrum. In Sec. III we outline the theory and ana-\nlyze the frequency dispersion of the LS. We then discuss the\nresults on the prefactor in the escape rate of a driven\nsystem10 and analyze the full time-dependent as well as the\ntime-averaged escape rate, including both the exponent and\nprefactor. In Sec. IV we present the results of analog and\ndigital simulations of driven systems. These results provide a\nfull qualitative and quantitative confirmation of the theory,\nand also reveal the underlying physics explicitly. In Sec. V\nwe describe the experimental observations of the activated\nescape of particles in modulated optical traps. Section VI\ncontains conclusions and a discussion of unsolved problems\nin activated escape, including the problem of statistical re-\nconstruction of the dynamical model of a fluctuating system.\nII. GENERAL FORMULATION OF THE ESCAPE\nPROBLEM\nThe idea underlying the theory of the LS8,9 is that, al-\nthough the motion of the fluctuating system is random, in a\nlarge rare fluctuation from a metastable state to a remote\nstate, or in a fluctuation resulting in escape, the system is\nmost likely to move along a particular trajectory known as\nthe optimal path ~see Refs. 11–19 and references therein!.\nThe effect of the driving field accumulates as the systemDownloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Amoves along the corresponding optimal path, giving rise to a\nlinear-in-the-field correction to the activation energy of es-\ncape.\nA natural theoretical approach to the escape problem is\nbased on the path-integral technique. We will give a formu-\nlation which is based on this technique and allows one to find\nthe logarithm of the escape rate for a periodically driven\nsystem. We consider a general case where fluctuations in the\nsystem are caused by a stationary colored Gaussian noise\nf (t) with a power spectrum F(v) of arbitrary shape.18,20\nThe Langevin equation of motion is of the form\nq˙5K~q;t !1 f ~ t !, K~q;t1tF!5K~q;t !, ~1!\nwhere tF is the period of the driving field. The noise is fully\ncharacterized by its correlation function f(t)5^ f (t) f (0)& or\nby F(v), the Fourier transform of f(t). The characteristic\nnoise intensity is D5max F(v)\/2.\nIf the noise is weak then, over the noise correlation time\ntcorr and the characteristic relaxation time in the absence of\nnoise t rel , the system will approach the metastable periodic\nstate qa(t) and will then perform small fluctuations about\nit.21 To escape from the basin of attraction of this state, the\nsystem should be subjected to a sufficiently large pulse of the\nforce f (t). Various realizations of f (t) ~the pulse shapes! can\nresult in escape. Their probability densities are given by the\nfunctional22\nP@ f ~ t !#5expF2 12D E E dt dt8 f ~ t !Fˆ ~ t2t8! f ~ t8!G , ~2!\nwhere Fˆ (t) is a reciprocal of the noise correlation function\nf(t), *dt1 Fˆ (t2t1)f(t12t8)5Dd(t2t8). For white noise,\nFˆ (t)5f(t)\/4D5d(t)\/2.\nWe assume that the noise intensity D contains a small\nconstant, which is the small parameter of the theory. This\nparameter guarantees that the functional ~2! is exponentially\nsmall for all pulses f (t) which can give rise to escape. In\naddition, its values differ exponentially for different appro-\npriate f (t). Thus there exists a realization f (t)5 f opt(t)\nwhich is exponentially more probable than the others. This\noptimal realization provides the maximum to P subject to the\nconstraint that the system ~1! actually escapes. The path\nqopt(t) along which the system moves when driven by the\noptimal force f opt(t) is the optimal fluctuational path, qopt(t).\nFrom ~2!, the paths qopt , f opt provide the minimum to\nthe functional\nR@q~ t !, f ~ t !#5 12 E E2‘\n‘\ndt dt8 f ~ t !Fˆ ~ t2t8! f ~ t8!\n1E\n2‘\n‘\ndt l~ t !@ q˙2K~q;t !2 f ~ t !# . ~3!\nThey can be obtained from the corresponding variational\nequations of motion. The Lagrange multiplier l(t) relates\nf opt(t) and qopt(t) to each other.\nThe boundary conditions for the escape problem follow\nfrom the fact that the system starts from the periodic attractor\nqa(t)5qa(t1tF) in the distant past ~on the time scale\ntcorr , t rel!, with f 50 asymptotically, and that, as the forceIP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n589Chaos, Vol. 11, No. 3, 2001 Activated escape of systemsdecays after having driven the system away from the attrac-\ntor, the system should not be brought back to the initially\noccupied basin of attraction. The latter condition is only\nsatisfied18 if, for t→‘ , the system is approaching the un-\nstable periodic state qb(t)5qb(t1tF) on the boundary of\nthe basin of attraction to qa(t),\nf ~ t !→0, l~ t !→0 for t→6‘ ,\n~4!\nq~ t !→qa~ t ! for t→2‘ , q~ t !→qb~ t ! for t→‘ .\nThe time-averaged escape rate has the form\nW¯ 5C exp@2R\/D# , R5min R. ~5!\nThe exponent R can be obtained for an arbitrary noise spec-\ntrum and an arbitrary periodic driving by solving the varia-\ntional problem ~3! and ~4! numerically. In particular, in the\ncase of white noise, where Fˆ (t)5d(t)\/2, the Lagrange mul-\ntiplier and the force f (t) can be easily eliminated from the\nvariational equations, 2l(t)5 f (t)5 q˙2K , and the varia-\ntional functional R for the escape problem takes the form\n~cf. Ref. 9!\nR@q~ t !#5 14 E2‘\n‘\ndt @ q˙2K~q;t !#2. ~6!\nThe variational equations of motion for the problem ~3!\nare usually nonintegrable. In the case of a white-noise driven\nsystem this was pointed out by Graham and Te´l.14 Generi-\ncally there are several solutions which start from the attractor\nfor t→2‘ and arrive to a given state q f at a given time t f .\nThe physically meaningful observable solution qopt(t) pro-\nvides the absolute minimum to the functional R.23\nThe prefactor C in the escape rate ~5! and the relation of\nW to a directly observable quantity, the time-periodic current\nfrom the basin of attraction, are discussed below.\nIII. THE LOGARITHMIC SUSCEPTIBILITY\nWe now turn to the case where the driving force F(t) is\nadditive,\nK~q;t !52U8~q !1F~ t !, F~ t1tF!5F~ t !, ~7!\nand only weakly perturbs the system dynamics; in particular,\nit does not change the number of attractors or saddle states.\nEven in this case the effect of F(t) on the escape probability\nmay be exponentially strong,8–10 because it is determined by\nthe ratio of the field-induced increment dR of the escape\nactivation energy to small noise intensity D . We note that\nU(q) can be thought of as a metastable potential in which\nthe system moves in the absence of periodic driving.\nTo first order in F , the correction dR can be obtained\nfrom the variational functional ~3! by evaluating the term\n}F(t) along the zeroth-order path qopt(0)(t), f opt(0)(t), l (0)(t).\nHowever, special care has to be taken of the fact that the\noptimal escape path is an instanton.9 In particular, the func-\ntion l (0)(t) is other than zero within a time interval of width\n;tcorr , t rel and is exponentially small otherwise. At the same\ntime, the optimal fluctuation leading to escape may occur atDownloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Aany time tc , in the absence of periodic driving @one can think\nof tc as the ‘‘center’’ of the instanton where ul (0)(t)u reaches\nits maximum#.\nThe field F(t) lifts the time degeneracy of escape paths.\nIt synchronizes optimal escape trajectories, one per period, so\nas to minimize the activation energy of escape R . The field-\ninduced change of R should be evaluated along such a tra-\njectory, i.e.,\ndR5min\ntc\ndR~ tc!,\ndR~ tc!5E\n2‘\n‘\ndt x~ t2tc!F~ t !\n[(\nn\nx˜~nvF!Fn exp~ invFtc!, ~8!\nx~ t !52l (0)~ t !,\nwhere x˜(v)5*2‘‘ dt x(t)exp(ivt), and Fn is the nth Fourier\ncomponent of the field.20 A complete derivation for a white-\nnoise driven system is discussed in Ref. 9; for the general\ncase discussed here it will be given elsewhere. We note that\nEq. ~8! has a particularly simple form for sinusoidal driving,\nwhere F(t)5AcosvFt. In this case dR52ux˜ (vF)uA .\nThe change of the activation energy dR , and therefore\nthe logarithm of the escape rate W¯ , are linear in the field\nF(t). The coefficient x˜(v) is the logarithmic susceptibility\n~LS!.8,9 The function x is a characteristic of the system, as\nare, for example, the polarizability and other standard linear\nsusceptibilities. It can be calculated for a given model or\nmeasured experimentally.\nUnlike the standard linear susceptibility which, by cau-\nsality arguments, is given by a Fourier integral over time\nfrom 0 to ‘, x˜(v) is given by an integral from 2‘ to ‘. The\nanalytic properties of x˜(v) therefore differ from those of the\nstandard susceptibility and, in particular, their high-\nfrequency asymptotics are qualitatively different. The stan-\ndard susceptibility for a damped dynamical system decays as\na power law for large v @e.g., as 1\/@U9(qa)2iv# , for the\nmodel ~7!#. In contrast, from ~8! the LS decreases exponen-\ntially, x˜(v)5Me2uvutp, where tp5Im tp , and tp is the pole\nor the branching point of the function l (0)(t). The\nasymptotic behavior of x˜(v) is different, of course, if tp\n50, i.e., l (0)(t) has a singularity for real time. This happens,\nfor example, if the potential U(q) has singularities encoun-\ntered by the optimal path. Therefore it does not typically\noccur in dynamical systems.\nThe LS takes a particularly simple form for a white-\nnoise driven system. From ~6!, ~7!,\nx~ t !52l (0)~ t !52 q˙opt\n(0)~ t !, q˙opt\n(0)5U8~qopt\n(0)!. ~9!\nIn this case, the explicit form of tp and the prefactor M in\nx˜(v) are determined solely by the singularities of U8(q).\nThey were obtained in Ref. 24.\nA. Complete nonadiabatic escape theory\nThe notion of the LS makes it possible to find not only\nthe exponent, but also the prefactor in the escape rate, and\nthus to obtain a complete nonadiabatic solution of the escapeIP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n590 Chaos, Vol. 11, No. 3, 2001 Dykman et al.problem for dynamically weak driving. Since the celebrated\nKramers paper,25 the calculation of the prefactor has been\none of the central problems in escape rate theory. For a pe-\nriodically driven system, the escape rate W(t) is periodic in\ntime. It can be introduced as a current j away from the meta-\nstable state, which is measured well behind the boundary qb\nof the attraction basin @for the model ~7! with F50, qb is the\nposition of the local maximum of the potential U(q)#. In the\nrange uU8(q)u@F the current scales with q as\nj~q ,t !5W@ t2td~q !# , dtd \/dq521\/U8~q !. ~10!\nEquation ~10! provides a meaningful definition of both\ninstantaneous and time-averaged escape rates. For weak driv-\ning, the values of the escape rate at different points q suffi-\nciently far behind qb(t) differ only by a phase shift td(q),\nwhich makes it possible to make a sensible measurement of\nW(t)5W(t1tF). For a white-noise driven system, an ex-\nplicit expression for the time-dependent escape rate W(t)\nand for W¯ was obtained10 by combining the results on the LS\nwith the integral representation of the time-dependent prob-\nability density near qb . In particular, it was shown that\nW¯ \/W05~2p!21E\n0\n2p\ndf exp@2dR~f\/vF!\/D# , ~11!\nwhere W0 is Kramers’ escape rate in the absence of modula-\ntion for an overdamped system ~the type of systems which\nwe discuss in this paper!, and dR(tc) is given by Eq. ~8!.\nSince dR(tc) is a zero-mean periodic function, W¯ al-\nways exceeds W0 . For small F\/D , the correction to W0 is\nquadratic in F\/D ~cf. Ref. 2!. In the opposite limit of large\nF\/D , the escape rate is changed exponentially, with\nln@W¯ \/W0#’2D21 min dR(tc), which coincides with Eqs. ~5!\nand ~8!. The dependence of the escape rate on time and the\nparameters of the system for a simple metastable potential is\nillustrated in Fig. 1.\nThe time dependence of the escape rate W(t) and the\nchange of its form with varying parameters of the system, in\nFIG. 1. The logarithm of the average escape rate ~11! as a function of the\nscaled amplitude A\/D of a sinusoidal field for the potential U(q)5q2\/2\n2q3\/3 ~Ref. 10!. The curves a to d refer to the dimensionless frequency\nvF50.1,0.4,0.7,1.2. Inset: time dependence of the logarithm of the instan-\ntaneous escape rate for the same frequencies and A\/D510 (f5vFt), illus-\ntrating loss of synchronization of escape events with increasing vF .Downloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Aparticular with the frequency and amplitude of the driving\nforce, were analyzed in Refs. 10 and 26. The explicit form of\nthe probability distribution in the vicinity of the boundary\nqb(t) was obtained in these papers, too. One of the conclu-\nsions which follows from the results is that the prefactor in\nthe expression for the current j(t) calculated right on the\nboundary qb(t) has a totally different form from that in the\ncurrent well behind qb(t), which gives the observable rate\nW(t) ~10!. This is in contrast with what happens in the case\nof nondriven overdamped systems.25\nCalculating the current at the periodic boundary qb(t)\nwas the goal of the recent papers by Lehmann et al.27 As\nnoted before, the functional form of this current differs from\nthat of the coordinate-independent instantaneous escape rate.\nIn their analysis, Lehmann et al. adopted the idea,8,9 Fig. 2,\nof synchronization of optimal paths by a periodic field. The\nevaluation of the prefactor in Ref. 27 is based on an addi-\ntional specific conjecture. Most of the specific results refer to\na singular potential U(q) in Eq. ~7!: it consists of two\nopposite-sign parabolas matched between their extrema.\nHowever, the nonanalyticity of this potential should give rise\nto a deviation from the linear amplitude dependence of the\nactivation energy ~8! for comparatively small amplitudes of\nthe driving periodic force. The deviation will be strong\nwhere the amplitude of forced vibrations becomes compa-\nrable to the distance from the extrema of U(q) to the singu-\nlar point where the parabolas are connected, as was indeed\nobserved in Ref. 27. However, as we showed earlier by solv-\ning the variational problem ~5!, ~6! exactly9 ~cf. Fig. 2!, for\ngeneric analytic potentials the activation energy of escape is\nwell described by the LS in a broad range of field ampli-\ntudes. We demonstrate this below by analog and digital\nsimulations.\nIV. ANALOG AND DIGITAL SIMULATIONS\nA. Measuring the logarithmic susceptibility\nTo test the relevance of the LS and to investigate its\nproperties, we have built an analog electronic model28 of the\nsystem ~1! for the double-well Duffing potential\nFIG. 2. Optimal escape paths ~bold solid lines! of a periodically driven\nBrownian particle, h˙5h2h31A cos vt 1 f (t), for A50.1, v52 ~from\nRef. 9; h and v correspond to q and vF in the present paper, respectively!.\nThe paths @given by Eqs. ~4!–~6!# go from the stable to the unstable periodic\nstates shown by bold dashed lines ~by thin dashed lines, in the absence of\ndriving!. Thin solid lines show optimal paths in the absence of driving\nh (0)(t2tc)52$11exp@2(t2tc)#%21\/2, with different tc . The driving lifts the\ndegeneracy with respect to tc . The paths h (0)(t2tc) with the ‘‘right’’ tc @as\ngiven by ~8!# are the ones around which the exact paths are oscillating. The\nlinear nonadiabatic theory gives the decrement of the activation barrier to an\naccuracy 12%.IP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n591Chaos, Vol. 11, No. 3, 2001 Activated escape of systemsU~q !52 12 q21 14 q4. ~12!\nWe drive it with zero-mean quasiwhite Gaussian noise from\na shift-register noise generator, digitize the response q(t),\nand analyze it with a digital data processor. We have also\ncarried out a complementary digital simulation see Ref. 29\nfor details on the algorithm used and the noise generation.\nThe analog and digital measurements involved noise intensi-\nties in the ranges D50.021– 0.04 and D50.007– 0.030, re-\nspectively, in dimensionless units.\nFor escape from the state qa521 of the white-noise\ndriven Duffing oscillator, Eqs. ~9! and ~12! give the LS as\nx˜~v!5p21\/2G@~12iv!\/2#G@~21iv!\/2# , ~13!\nwhere G(x) is the gamma function. For sinusoidal driving,\nthe measured time-averaged escape rate is compared with the\nexpressions ~11! and ~13! in Fig. 3. We emphasize that the\ndata refer to a strongly nonadiabatic driving, vFt rel50.6 @for\nthe model ~12!, t rel51\/U9(qa)51\/2#, and cover the range\nfrom weak fields, A&D , to A\/D510. The corresponding\nchange of udRu\/D5ux˜ (vF)uA\/D was &4.2. The data and the\ntheory are in full agreement, without any adjustable param-\neters. It is seen from the data that, for ux˜ (vF)uA\/D.1 the\ndependence of ln W¯ on A becomes linear, as expected. We\nnote that a qualitatively similar dependence of ln W¯ on the\ndriving amplitude can be seen in the experimental data on\ndriven Josephson junctions.3\nIn Fig. 4 we show the data on the LS for several noise\nintensities. The activation energy R was obtained by measur-\ning the slope of ln W¯ vs 1\/D . From ~8!, the slope of R vs A\nyields the absolute value of the LS. The difference between\nthe measured and calculated R arises from the noise intensity\nbeing not too small ~D’0.020– 0.036 for the data points in\nFig. 4!, or in other words, comes from the field dependence\nof the prefactor in the expression for the escape rate W¯ . As\nseen from Fig. 3, when the latter is taken into account, there\nis full quantitative agreement between the theory and simu-\nFIG. 3. The average escape rate W¯ for a sinusoidally driven Duffing oscil-\nlator ~12! as a function of the field amplitude A , W0 is the escape rate for\nA50. The driving frequency is vF51.2, the white-noise intensity is D\n50.03. Solid line: the theoretical expression ~11!; filled and empty circles\nare the data from analog and digital simulations, respectively, with no ad-\njustable parameters.Downloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Alations. It is also seen from Fig. 3 that simulations with D as\nhigh as 0.03 still give the correct slope of dR vs A for large\nA , and thus the correct ux˜ u.\nThe frequency dependence of ux˜ (v)u, a fundamental\ncharacteristic of the original equilibrium system, is compared\nwith the theoretical prediction ~13! in the inset. As expected,\nthe LS falls off exponentially at high frequencies, whereas\nthe limit of x˜ (v) for v→0 corresponds to adiabatic driving\nand can be obtained from the Kramers theory. We note that,\ngenerally, the LS is not a monotonic function of frequency:\nfor underdamped systems, it displays resonant peaks.8\nB. Switching between optimal paths\nWe now turn to the investigation of a specific feature of\nthe escape rate that is related to the minimization over tc in\n~8!. It is expected to arise for a nonsinusoidal field, and in\nparticular for a biharmonic one.8 Here, the periodic function\ndR(tc) may have two minima per period. However, the ac-\ntivation energy will always correspond to the absolute mini-\nmum of dR(tc). For a certain relation between the param-\neters, the values of dR(tc) at the two minima are equal. The\nsituation is then similar to the first-order phase transition\nwhere two minima of the free energy are equally deep. On\nthe opposite sides of the phase transition line the system is in\ndifferent states. In the present case, if the parameters pass\nthrough critical values where the minima of dR(tc) are\nequally deep, switching will occur from one minimum to the\nother.\nFor biharmonic driving, a convenient control parameter\nis the phase difference f12 between the field components F1 ,\nF2 . In the simulations we used the Duffing oscillator ~12!\ndriven by the field F(t)50.1 cos(1.2t)10.3 cos(2.4t1f12).\nFor such a field, the function dR(tc) ~8! has two minima.\nTheir relative depths depend on f12 .\nFIG. 4. The dependence of the activation energy R on the amplitude A of\nthe sinusoidal driving force with vF51.2 for the Duffing oscillator as de-\ntermined by electronic ~open circles! and numerical ~filled circles! simula-\ntions and Eq. ~11! ~solid line! ~Ref. 24!. The data of analog and digital\nsimulations refer to the noise intensities 0.028,D,0.036 and 0.020,D\n,0.028, respectively. The inset shows the absolute value of the LS of the\nsystem ux˜(v)u measured ~open and filled squares for analog and numerical\nsimulations, respectively! and calculated from ~13! ~full curve! as a function\nof frequency v.IP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n592 Chaos, Vol. 11, No. 3, 2001 Dykman et al.The increment of the activation energy dR5min dR(tc)\nas a function of f12 obtained from analog experiments and\nnumerical simulations is compared to theoretical predictions\nin Fig. 5~a!. For the critical value f125fcr , dR has a cusp.\nOn the opposite sides of the cusp it is determined by differ-\nent minima of dR(tc). Relative numbers of escape events\nalong the paths corresponding to these minima are shown in\nFig. 5~b!. The data clearly show that the contribution from\none of the minima dominates everywhere except within a\nnarrow vicinity of fcr , where the contributions from both\nminima are of the same order of magnitude.\nIn Fig. 5~c! we compare observed and predicted escape\npaths for f125fcr ~in the calculations, account was taken of\nthe field-induced corrections!. The coexistence of the two\nescape paths per period is clearly seen, and agreement with\ntheory is excellent.\nV. DYNAMICAL SYMMETRY BREAKING IN A\nMODULATED BISTABLE OPTICAL TRAP\nA simple physical system which embodies fluctuation-\ninduced escape is a mesoscopic particle suspended in a liquid\nand confined within a metastable potential well. The particle\nmoves at random within the well until a large fluctuation\npropels it over an energy barrier. An optically transparent\ndielectric sphere can be readily trapped with a strongly fo-\ncused laser beam, creating an optical gradient trap, i.e., ‘‘op-\ntical tweezers.’’30 Techniques based on optical tweezers have\nfound broad applications in contactless manipulation of ob-\njects such as atoms, colloidal particles, and biological mate-\nrials. Fluctuation-induced escape can be studied using a dual\noptical trap generated by two closely spaced parallel light\nbeams, as illustrated in Fig. 6. Such trap was implemented\ninitially to study the synchronization of interwell transitions\nby low-frequency ~adiabatic! sinusoidal forcing.31\nFIG. 5. ~a! The activation energy R as a function of phase difference f12\nwith vF51.2 for the Duffing oscillator driven by the biharmonic force\nF(t)50.1 cos(vFt)10.3 cos(2vFt1f12). Calculations based on ~8! ~full\ncurve! are compared with data from electronic ~open circles! and numerical\n~filled circles! simulations. ~b! Relative numbers of escape trajectories fol-\nlowing each escape path in the electronic ~filled circles! and numerical ~open\ncircles! experiments compared to the calculated relative probabilities ~full\ncurve!. ~c! Measured escape trajectories for the electronic model ~thin\njagged lines! with the critical phase difference f125fcr’3.57, compared to\nthe calculated optimal paths ~circles and triangles!; solid lines are periodic\nstates of ~1!, ~7! in the absence of noise. The data were obtained with the\nnoise intensity D50.028.Downloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to AAn important experiment with a particle in a double-well\ntrap is a measurement of the transition rate in a stationary\npotential. Such an experiment can provide a rigorous test of\nthe multidimensional Kramers rate theory with no adjustable\nparameters. Quantitative measurements require that the con-\nfining potential be adequately characterized. This can be\ndone by measuring directly the full three-dimensional ~3D!\nstationary probability distribution r(r) of a trapped Brown-\nian particle.32\nA stable three-dimensional trap is produced by two fo-\ncussed laser beams as a result of the electric field gradient\nforces exerted on a transparent dielectric spherical silica par-\nticle of diameter 2R50.6 mm. Displaced typically by 0.25\nto 0.45 mm, the beams create a double-well potential, with\nthe stable positions of the particle centered at r1 and r2 . The\nstability perpendicular to the beam axis is due to the trans-\nverse beam profile gradient; in the beam direction the poten-\ntial gradient is derived from the strong focusing of the ob-\njective lens.30 Relatively infrequent thermally activated\nrandom transitions between the potential wells occur through\na saddle point at rs as depicted in Fig. 6. The experimental\nsetup and the measurement technique have been discussed\nelsewhere.32\nThe full double-well confining potential U(r) is deter-\nmined from the measured stationary distribution r(r) as\nU(r)52kBT ln r(r). From the depths and curvatures of the\npotential wells and the curvature of U(r) at the saddle point\nrs , it is straightforward to calculate the Kramers escape\nrates. These rates can also be measured directly by placing\nthe particle into one of the wells and measuring the average\ntime it takes to switch to the other well. The potential U(r),\nand the barrier height in particular, can be systematically\nvaried by changing the beam intensities. This results in an\nexponential change of the escape rate, thus making it pos-\nsible to compare theory and experiment over a wide range of\nthe escape rates. Extremely good agreement is obtained, as\nseen from Fig. 7.\nThe double-beam trap can also be used to investigate the\neffect of ac-modulation on transition rates. An interesting\napplication of this effect is to direct the diffusion of a particle\nin a spatially periodic potential.33 It follows from the results\nof Sec. II that, for a generic periodic potential, the ac-\nFIG. 6. ~Color online! Rendering of two focused laser beams, the equilib-\nrium positions of the particle ~rings!, and a transitional path between the\nbeams.IP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n593Chaos, Vol. 11, No. 3, 2001 Activated escape of systemsinduced change of the activation barrier differs depending on\nthe direction ~right or left, for example! in which the particle\nmoves in escape. This makes the probabilities of transitions\nto the right and to the left exponentially different and results\nin diffusion in the direction of more frequent transitions.\nAn effect closely related to directed diffusion, but more\namenable to testing using optical trapping, is ac-field induced\nlocalization in one of the wells of a symmetric double-well\npotential. We expect both these effects to occur if the applied\nfield breaks the spatio-temporal symmetry of the system.8,34\nThe ratio of the stationary populations w¯1 ,w¯2 of the wells is\ndetermined by the ratio of the period-averaged rates W¯ i j of\nthe interwell i→ j transitions,\nw¯1 \/w¯25W¯ 21 \/W¯ 12}exp~@dR12dR2#\/kBT !, ~14!\nwhere dR1,2 are field-induced corrections to the activation\nenergies of escape from wells 1,2 ~8!.\nThe experiment was conducted35 for equal static barrier\nheights in the two wells DU15DU2[DU , with DU0 set at\n’7.5kBT . The intensity of a laser beam was then modulated\nby an electro-optic device, giving rise to modulation of\nDU\/kBT with an amplitude ’2.5. The modulation fre-\nquency vF\/2p was varied between 1 and 100 Hz, which\ncovers the range from adiabatically slow to nonadiabatic\nmodulation ~the relaxation time is t rel;1022 s!. This may be\ncompared to the mean unmodulated transition rate W0\n;0.1 s21. Over this range, field-induced repopulation was\nobserved between the wells for a nonsinusoidal modulation\nwave form, so that w¯1Þw¯2 .\nThe results on the instantaneous escape rates W12(t) and\nW21(t) for an adiabatic modulation (vF\/2p51 Hz) are\nshown in Fig. 8. The barrier heights in the two wells were\nmodulated in counter phase. The form of the modulation was\ndDU(t)5const@sin(vFt)1(1\/2)sin(2vFt1f12)# . For this\nFIG. 7. ~Color online! Comparison of the measured transition rates Wmeas\nand the rates calculated from the three-dimensional Kramers theory, WK,\nusing the measured curvatures of the potential wells. The squares represent\nescapes from the well at r1 and the triangles represent escapes from the well\nat r2 in Fig. 6. The line of slope one indicates the result expected if the\nthree-dimensional Kramers theory correctly predicted the measured transi-\ntion rates ~Ref. 32!.Downloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to Awave form, there is only one optimal escape path per period,\nfor each well, and no switching between the paths occurred\nwith varying f12 .\nAs shown in the inset to Fig. 8, the difference between\nthe barrier heights in the two wells varies asymmetrically\nover the cycle. It depends on f12 and can be inverted if the\nphase angle is shifted by p. In other words, the modulated\npotential is not invariant under t→t1p\/vF , x→2x , y\n→2y ~with x , y measured from the symmetry planes paral-\nlel to the beam axes, see Fig. 6!. It is this breaking of the\nspatio-temporal symmetry that leads to the escape rate from\none of the wells being on average much bigger than from the\nother, as seen from Fig. 8. In turn, this leads to a higher\npopulation in one of the wells. Not only has the effect been\nobserved for slow modulation, as evidenced by Fig. 8, but a\npopulation difference of 20% has been observed deeply in\nthe nonadiabatic regime, with vF\/2p520 Hz, for the modu-\nlation amplitude used. This is sufficient to create significant\ndirectional diffusion, and demonstrates the onset of dynami-\ncal symmetry breaking. The dependence of w¯1 \/w¯2 on the\nphase shift f12 is in agreement with the theory of Sec. III.35\nVI. CONCLUSIONS AND OPEN QUESTIONS\nWe have shown theoretically, by analog and digital\nsimulations, and by optical trapping experiments that fluc-\ntuations in driven systems, and in particular escape from a\nmetastable state, can be effectively controlled by an external\nfield. The field gives rise to a change of the activation energy\nof escape, which can be much bigger than the characteristic\nnoise intensity ~temperature! even for comparatively weak\nfields. Over a broad range of field amplitudes, this change is\nlinear in the field even where the driving frequency exceeds\nthe reciprocal relaxation time of the system and substantially\nexceeds the escape rate. The effect is described by a physi-\ncally observable quantity, the logarithmic susceptibility. The\nLS relates the probability of large fluctuations in the pres-\nFIG. 8. ~Color online! The least-squares fits to the experimentally deter-\nmined instantaneous time-dependent switching probabilities for a particle in\nthe adiabatically modulated double-beam trap, over a cycle vFt of the\nmodulating wave form. The phase angle between the first and second har-\nmonics is f125p\/2. When the phase angle was incremented by p, the\nescape rates from the left and right wells interchanged, within experimental\nerror. Inset shows the instantaneous difference between the heights of the\npotential barriers in the two wells.IP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n594 Chaos, Vol. 11, No. 3, 2001 Dykman et al.ence of an external field to the dynamics in the absence of\ndriving. It displays a specific frequency dispersion, which\nmakes it possible to control, selectively, the escape rate of a\ntargeted system. The LS can be calculated, for a given model\nof the system, and can be measured experimentally.\nAn important application of the escape rate control is\ndirected diffusion in a spatially periodic potential. As we\nhave demonstrated, such control can be performed even for a\nsymmetric potential, in which case not only the rate, but also\nthe preferred direction of diffusion can be conveniently\nchanged by changing the driving field parameters.\nThe high efficiency of the escape rate modulation is\nlargely due to the synchronization of optimal escape paths by\nthe driving field. We have predicted and observed this syn-\nchronization. We have also observed the related effect of\nswitching between different branches of the activation en-\nergy as a function of the field parameters—a generic phase-\ntransition type effect related to coexistence of different es-\ncape paths in systems away from thermal equilibrium.\nThe results of this research are relevant to biological\nsystems, since activated escape lies at the root of many bio-\nlogical processes at the molecular level, and modulation of\nthe escape rate is often the way nature exercises control.\nHowever, detailed understanding of how this control is per-\nformed is missing in most cases. This is a fundamentally\nimportant and most challenging open scientific problem.\nAnother important open problem of broad interest is\nwhether large fluctuations can be used to learn about the\ndynamics of a fluctuating system away from stable or meta-\nstable states. The underlying idea here is that, in large fluc-\ntuations, the system explores remote areas of the space of its\ndynamical variables. An example where fluctuations have\nbeen used to find the global potential in which a system is\nmoving was discussed in Sec. V. The problem becomes more\ncomplicated if the system dynamics is unknown. However,\ngiven that the system is most likely to move along a certain\npath during a large fluctuation, the observation of such paths\ncan enable one to infer a dynamical model of the system. The\nprocess can then be iterated, as indicated by recent results.36\nThe results described here are of interest also from the\nviewpoint of practical applications. An important example is\nthe separation of colloidal particles and macromolecules.\nOur experiments show that selectively directed diffusion is a\npromising new approach to this problem. Another example is\ncontrol of crystal growth using an ac field. The relevant\nnucleation rate will be changed by the field in a way similar\nto the escape rate. Therefore it should be possible to strongly\nmodulate it both in time and space.\nACKNOWLEDGMENTS\nThe work was supported by the NSF through Grants\nNos. PHY-0071059 and DMR-9971537, and by the EPSRC\n~UK! under Grants Nos. GR\/L99562 and GR\/R03631.\n1 M. I. Dykman, D. G. Luchinsky, R. Mannella, P. V. E. McClintock, N. D.\nStein, and N. G. Stocks, Nuovo Cimento D 17, 661 ~1995!; L. Gammai-\ntoni, P. Ha¨nggi, P. Jung, and F. Marchesoni, Rev. Mod. Phys. 70, 223\n~1998!.\n2 A. I. Larkin and Yu. N. Ovchinnikov, J. Low Temp. Phys. 63, 317 ~1986!;Downloaded 05 Sep 2001 to 35.8.48.84. Redistribution subject to AB. I. Ivlev and V. I. Mel’nikov, Phys. Lett. A 116, 427 ~1986!; S. Linkwitz\nand H. Grabert, Phys. Rev. B 44, 11888 ~1991!; 44, 11901 ~1991!; R.\nMannella and P. Grigolini, ibid. 39, 4722 ~1989!.\n3 M. H. Devoret, D. Esteve, J. M. Martinis, A. Cleland, and J. Clarke, Phys.\nRev. B 36, 58 ~1987!; E. Turlot, S. Linkwitz, D. Esteve, C. Urbina, M. H.\nDevoret, and H. Grabert, Chem. Phys. 235, 47 ~1998!.\n4 R. Landauer, J. Stat. Phys. 13, 1 ~1975!; Phys. Lett. A 68, 15 ~1978!; J.\nStat. Phys. 53, 233 ~1988!.\n5 R. S. Maier and D. L. Stein, SIAM ~Soc. Ind. Appl. Math.! J. Appl. Math.\n57, 752 ~1997!.\n6 P. Jung, Phys. Rep. 234, 175 ~1993!.\n7 L. E. Reichl and S. Kim, Phys. Rev. E 53, 3088 ~1996!.\n8 M. I. Dykman, H. Rabitz, V. N. Smelyanskiy, and B. E. Vugmeister, Phys.\nRev. Lett. 79, 1178 ~1997!.\n9 V. N. Smelyanskiy, M. I. Dykman, H. Rabitz, and B. E. Vugmeister, Phys.\nRev. Lett. 79, 3113 ~1997!.\n10 V. N. Smelyanskiy, M. I. Dykman, and B. Golding, Phys. Rev. Lett. 82,\n3193 ~1999!.\n11 L. Onsager and S. Machlup, Phys. Rev. 91, 1505 ~1953!.\n12 M. I. Freidlin and A. D. Wentzel, Random Perturbations in Dynamical\nSystems ~Springer, New York, 1984!.\n13 M. I. Dykman and M. A. Krivoglaz, Sov. Phys. JETP 50, 30 ~1979!; in\nSoviet Physics Reviews, edited by I. M. Khalatnikov ~Harwood Academic,\nNew York, 1984!, Vol. 5, pp. 265–442.\n14 R. Graham and T. Te´l, Phys. Rev. Lett. 52, 9 ~1984!; Phys. Rev. A 31,\n1109 ~1985!; R. Graham, in Noise in Nonlinear Dynamical Systems, edited\nby F. Moss and P. V. E. McClintock ~Cambridge University Press, Cam-\nbridge, 1989!, Vol. 1, pp. 225–278.\n15 J. F. Luciani and A. D. Verga, Europhys. Lett. 4, 255 ~1987!.\n16 A. Fo¨rster and A. S. Mikhailov, Phys. Lett. A 126, 459 ~1988!.\n17 A. J. Bray and A. J. McKane, Phys. Rev. Lett. 62, 493 ~1989!; A. J.\nMcKane, Phys. Rev. A 40, 4050 ~1989!.\n18 M. I. Dykman, Phys. Rev. A 42, 2020 ~1990!.\n19 R. S. Maier and D. L. Stein, J. Stat. Phys. 83, 291 ~1996!.\n20 M. I. Dykman and B. Golding, in Stochastic Processes in Physics, Chem-\nistry, and Biology, LNP 557, edited by J. A. Freund and T. Po¨schel\n~Springer-Verlag, Berlin, 2000!, pp. 246–258.\n21 A different situation occurs if periodic driving is so strong that it makes a\nmetastable state dynamically unstable. An interesting effect of noise in\nthis case was analyzed by I. Dayan, M. Gitterman, and G. H. Weiss, Phys.\nRev. A 46, 757 ~1992!; see also J. M. Casado and M. Morillo, Phys. Rev.\nE 49, 1136 ~1994!; R. N. Mantegna and B. Spagnolo, Phys. Rev. Lett. 76,\n563 ~1996!.\n22 R. P. Feynman and A. R. Hibbs, Quantum Mechanics and Path Integrals\n~McGraw Hill, New York, 1965!.\n23 M. I. Dykman, M. M. Millonas, and V. N. Smelyanskiy, Phys. Lett. A 195,\n53 ~1994!; M. I. Dykman, D. G. Luchinsky, R. Mannella, P. V. E. McClin-\ntock, and V. N. Smelyanskiy, Phys. Rev. Lett. 77, 5229 ~1996!.\n24 D. G. Luchinsky, R. Mannella, P. V. E. McClintock, M. I. Dykman, and V.\nN. Smelyanskiy, J. Phys. A 32, L321 ~1999!.\n25 H. Kramers, Physica ~Amsterdam! 7, 284 ~1940!.\n26 V. N. Smelyanskiy, M. I. Dykman, H. Rabitz, B. E. Vugmeister, S. L.\nBernasek, and A. B. Bocarsly, J. Chem. Phys. 110, 11488 ~1999!.\n27 ~a! J. Lehman, P. Riemann, and P. Ha¨nggi, Phys. Rev. Lett. 84, 1639\n~2000!; ~b! J. Lehman, P. Riemann, and P. Ha¨nggi, Phys. Rev. E 62, 6282\n~2000!.\n28 D. G. Luchinsky, P. V. E. McClintock, and M. I. Dykman, Rep. Prog.\nPhys. 61, 889 ~1998!.\n29 R. Mannella, in Supercomputation in Nonlinear and Disordered Systems,\nedited by L. Va´zquez, F. Tirando, and I. Martin ~World Scientific, Sin-\ngapore, 1997!, pp. 100–130.\n30 A. Ashkin, J. M. Dziedzic, J. E. Bjorkholm, and S. Chu, Opt. Lett. 11, 288\n~1986!.\n31 A. Simon and A. Libchaber, Phys. Rev. Lett. 68, 3375 ~1992!.\n32 L. I. McCann, M. I. Dykman, and B. Golding, Nature ~London! 402, 785\n~1999!.\n33 M. O. Magnasco, Phys. Rev. Lett. 71, 1477 ~1993!.\n34 A. Ajdari, D. Mukame, L. Paliti, and J. Prost, J. Phys. I 4, 1551 ~1994!; M.\nC. Mahato and A. M. Jayannavar, Phys. Lett. A 209, 21 ~1994!; D. R.\nChialvo and M. M. Millonas, ibid. 209, 26 ~1995!.\n35 L. I. McCann and B. Golding ~unpublished!.\n36 V. N. Smelyanskiy ~in preparation!.IP license or copyright, see http:\/\/ojps.aip.org\/chaos\/chocr.jsp\n"}