{"doi":"10.1016\/j.csr.2006.09.008","coreId":"64239","oai":"oai:nora.nerc.ac.uk:625","identifiers":["oai:nora.nerc.ac.uk:625","10.1016\/j.csr.2006.09.008"],"title":"Internal tide modelling and the influence of wind effects.","authors":["Hall, P.","Davies, A. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-15","abstract":"Initially the development of shallow sea three-dimensional barotropic tidal models is briefly reviewed with a view to determining what were the key measurements that allowed progress in this field and rigorous model validation. Subsequently this is extended to a brief review of baroclinic tidal models to try to determine a “way forward” for baroclinic model development. The difficulty of high spatial variability, and wind influence are identified as possibly important issues that must be considered in validating baroclinic tidal models. These are examined using a three-dimensional unstructured grid model of the M2 internal tide on the shelf edge region off the west coast of Scotland. The model is used to investigate the spatial variability of the M2 internal tide, and associated turbulence energy and mixing in the region. Initial calculations are performed with tidal forcing only, with subsequent calculations briefly examining how the tidal distribution is modified by down-welling and up-welling favourable winds. Calculations with tidal forcing only, show that there is significant spatial variability in the internal tide and associated mixing in the region. In addition, these are influenced by wind effects which may have to be taken into account in any model validation exercise. The paper ends by discussing the comprehensive nature of data sets that need to be collected to validate internal tidal models to the same level currently attained with three dimensional barotropic tidal models","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64239.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/625\/1\/csr2007pdfa.pdf","pdfHashValue":"0f9fd16eaba5525cad88bdd7cdb695f9b761d810","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:625<\/identifier><datestamp>\n      2012-11-22T11:45:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/625\/<\/dc:relation><dc:title>\n        Internal tide modelling and the influence of wind effects.<\/dc:title><dc:creator>\n        Hall, P.<\/dc:creator><dc:creator>\n        Davies, A. M.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Initially the development of shallow sea three-dimensional barotropic tidal models is briefly reviewed with a view to determining what were the key measurements that allowed progress in this field and rigorous model validation. Subsequently this is extended to a brief review of baroclinic tidal models to try to determine a “way forward” for baroclinic model development. The difficulty of high spatial variability, and wind influence are identified as possibly important issues that must be considered in validating baroclinic tidal models. These are examined using a three-dimensional unstructured grid model of the M2 internal tide on the shelf edge region off the west coast of Scotland. The model is used to investigate the spatial variability of the M2 internal tide, and associated turbulence energy and mixing in the region. Initial calculations are performed with tidal forcing only, with subsequent calculations briefly examining how the tidal distribution is modified by down-welling and up-welling favourable winds. Calculations with tidal forcing only, show that there is significant spatial variability in the internal tide and associated mixing in the region. In addition, these are influenced by wind effects which may have to be taken into account in any model validation exercise. The paper ends by discussing the comprehensive nature of data sets that need to be collected to validate internal tidal models to the same level currently attained with three dimensional barotropic tidal models.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2007-05-15<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/625\/1\/csr2007pdfa.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hall, P.; Davies, A. M..  2007  Internal tide modelling and the influence of wind effects.   Continental Shelf Research, 27 (9). 1357-1377.  https:\/\/doi.org\/10.1016\/j.csr.2006.09.008 <https:\/\/doi.org\/10.1016\/j.csr.2006.09.008>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.csr.2006.09.008<\/dc:relation><dc:relation>\n        doi:10.1016\/j.csr.2006.09.008<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/625\/","http:\/\/dx.doi.org\/10.1016\/j.csr.2006.09.008","doi:10.1016\/j.csr.2006.09.008"],"year":2007,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Internal tide modelling and the influence of wind effects.\nP. Hall ∗, A.M. Davies\nProudman Oceanographic Laboratory, 6 Brownlow Street, Liverpool L3 5DA, UK.\nAbstract\nInitially the development of shallow sea three-dimensional barotropic tidal models is briefly reviewed with a view to determining\nwhat were the key measurements that allowed progress in this field and rigorous model validation. Subsequently this is extended to\na brief review of baroclinic tidal models to try to determine a way forward for baroclinic model development. The difficulty of high\nspatial variability, and wind influence are identified as possibly important issues that must be considered in validating baroclinic\ntidal models. These are examined using a three-dimensional unstructured grid model of the M2 internal tide on the shelf edge\nregion off the west coast of Scotland. The model is used to investigate the spatial variability of the M2 internal tide, and associated\nturbulence energy and mixing in the region. Initial calculations are performed with tidal forcing only, with subsequent calculations\nbriefly examining how the tidal distribution is modified by down-welling and up-welling favourable winds. Calculations with tidal\nforcing only, show that there is significant spatial variability in the internal tide and associated mixing in the region. In addition,\nthese are influenced by wind effects which may have to be taken into account in any model validation exercise. The paper ends\nby discussing the comprehensive nature of data sets that need to be collected to validate internal tidal models to the same level\ncurrently attained with three dimensional barotropic tidal models.\n1. INTRODUCTION\nIn the context of this volume concerned with reviewing\ndevelopments in hydrodynamic modelling, and presenting\nnew results that point to the way forward, we consider\nthe topic of accurately computing internal tides and how\nthey are modified by wind effects. In addition, the extent\nto which this influences model\/data comparison is consid-\nered. In this introduction we initially very briefly review\nthe major stages in the history of how finite difference and\nfinite element modelling of tides has developed in shallow\nsea regions. This development has now progressed to such\nan extent that in shallow sea regions, models can be used\nto give accurate real time predictions of currents for navi-\ngation purposes (e.g. Gjevik et al., 2006). The main aim of\nthis overview is to understand what has in the past limited\nprogress and how it was overcome. From this the present\nlimitations of models of the internal tide in shelf edge re-\ngions can be understood and suggestions for a way forward\ndeveloped. Based on this and the modelling presented here,\n∗ Corresponding author.\nEmail address: phh@pol.ac.uk (P. Hall).\nin the conclusions we try to suggest the extent and nature of\nnew measurements required to validate internal tide mod-\nelling and progress that field.\nInitially, research on tidal modelling was confined to shal-\nlow sea regions and the application of, by todays standards,\nrelatively coarse grids using finite difference methods. In\nparticular, the Arakawa C grid was used in these calcula-\ntions. The main emphasis in these models was the deter-\nmination of tidal elevation for the major component of the\ntide, namely the M2 constituent. Since elevations rather\nthan currents were the primary focus, the two-dimensional\nvertically integrated equations could be used, thereby re-\nducing computational effort. In Europe the main emphasis\nwas on the North Sea, although as computational resources\nincreased the north-west European Shelf became the pri-\nmary focus as it covered a range of water depths and tidal\nregions. In addition some areas, such as the Bristol Channel\nhad an enhanced tidal range due to resonance. An early ex-\nample of a successful simulation of the M2 tide over the Eu-\nropean shelf is given in Flather (1976). His shelf wide model\nhad an open boundary at the shelf edge which was specifi-\ncally designed to use measurements of Cartwright (1976) in\nthe shelf edge region. By this means an accurate tidal forc-\nPostprint of article published in Continental Shelf Research (2007) 27: 1357–1377 18 July 2007\ning was introduced along the open boundary of the model.\nThis was of course a key factor that progressed the mod-\nelling. Although the model grid was coarse, of order 30km,\nthe model could reproduce the propagation of the tide from\nthe shelf edge into the interior of the region. However, the\nlack of resolution meant that some regions such as the En-\nglish Channel were poorly resolved, and the generation of\nhigher harmonics in near coastal regions could not be re-\nproduced. In essence this model could reproduce the main\nfeatures (co-tidal chart) of the M2 tide in regions where a\n30 km resolution was adequate. However, close to the coast\nwhere the tide changed rapidly over short distances (of or-\nder 10 km) and higher harmonics were generated the mod-\nels accuracy rapidly degraded.\nIn order to examine the accuracy of this type of finite\ndifference or finite element model in nearshore regions lim-\nited area high resolution models were used (e.g. Walters\n(1987); Walters and Werner (1989); Werner (1995), also re-\nview in Walters (2005)). In such fine grid models in regions\nof large tidal amplitude, wetting and drying occurred dur-\ning the tidal cycle and finite difference and finite element\ncodes were modified to take account of this (e.g. Flather\nand Hubbert (1989); Fortunato et al. (1997, 1999); Heniche\net al. (2000); Ip et al. (1998)). This gave rise to a significant\nincrease in accuracy of both the fundamental and higher\nharmonics of the tide. Recently, inverse modelling meth-\nods (e.g. Thompson and Griffin (1998); Chen and Mellor\n(1999); Lynch andHannah (2001); Lynch et al. (2004)) have\nbeen developed whereby coastal data is assimilated into a\nlimited area model in order to improve the accuracy of the\ntidal solution. However, as shown by Lynch et al. (2004) in\norder to obtain an accurate solution over the whole region\nit is essential to accurately represent the nearshore region\nwhere observational data is assimilated. If this is not done\nthen an erroneous inverse is generated and an inaccurate\ntidal solution is produced. The paper by Lynch et al. (2004)\nclearly shows that it is essential to resolve the physics and\ntopography in the region of strong tidal signals, namely the\ncoastline in the case of a barotropic shelf tidal model.\nIn parallel with these developments in shallow sea mod-\nelling, basin wide tidal modelling with coarse grids was\nalso progressing. These models included the tide generating\nforces, and hence the tide was not forced as a co-oscillating\ntide through the open boundary as in a limited area coastal\nmodel. However, since the grid was coarse they could not\nresolve the shelf sea regions where dissipation occurred.\nConsequently, in these basin wide models energy was lost\nby radiating through the open boundary which was effec-\ntively at the shelf edge. Recently, the ability to improve res-\nolution in these regions and the use of altimetry with data\nassimilation has led to significant progress in the accuracy\nof barotropic ocean tidal models (e.g. Shum et al. (1997)).\nAnother recent example of inverse oceanic tidal modelling\nthat uses TOPEX\/Poseidon data with an efficient inverse\nmethod is given in Egbert and Erofeeva (2002). However,\nthe topic of data assimilation is beyond the scope of this\npaper, but references and discussion are given in a recent\npaper by Thompson et al. (2007).\nWith increasing computing power three-dimensional\nmodels have been developed, and more complex unstruc-\ntured grid methods have been established. The designing\nof optimal grids and associated issues relating to accu-\nrately computing the tide in a range of environments, from\nocean, across the shelf edge and into the nearshore region\nhas been a topic of significant research in recent years. It\nhas led to the development of a range of considerations\nthat should be borne in mind in the design of time inde-\npendent grids (e.g. Legrand et al. (2007); Greenberg et al.\n(2007)), and time evolving unstructured grids (e.g. the\nreview by Pain et al. (2005)).\nIn shallow sea regions where tidal mixing is strong and\nthe water column remains well mixed then stratification\neffects upon tidal turbulence are absent. Consequently, al-\nthough tidal currents over a region may have been collected\nat different times, the periodic nature of the tides means\nthat in essence a synoptic data set can be produced. This\ninvolves harmonic analysis, giving amplitude and phase\nwhich can be added to an existing database from earlier ob-\nservations thereby enhancing its accuracy and spatial cov-\nerage. However, in stratified regions, in particular those ad-\njacent to topography (e.g. Dogger Bank, Proctor and James\n(1996)) where stratification changes and internal tides are\ngenerated, the problem is more complex and a synoptic set\nof tidal and associated density fields is required.\nThe significant spatial change in topography and den-\nsity field in the shelf edge region (Pingree and New (1991)),\ngives rise to a high degree of spatial variability in the in-\nternal tide (e.g. Pingree and New (1989, 1995)), this to-\ngether with the influence of the wind upon stratification and\nhence the internal tide (Xing and Davies (1997b) (hereafter\nXD97))makes the collection of accurate and comprehensive\ndata sets in these regions particularly difficult. Hence, data\nsets for a rigorous skill assessment of internal tide models\nare very difficult to obtain. Despite these difficulties signif-\nicant progress has been made using numerical models to\nimprove our understanding of internal tide generation and\npropagation. Early models used primarily analytical ap-\nproaches (Craig (1987); Sherwin and Taylor (1989, 1990))\nand were of cross-sectional form. Although numerical mod-\nels (e.g. Holloway (1996); Xing and Davies (1996a,c), here-\nafter XD96a, b; Xing and Davies (1997a)) in cross-sectional\nform were also used. Subsequently three dimensional mod-\nels were developed (e.g. Cummins and Oey (1997); Niwa\nand Hibiya (2004); Merrifield and Holloway (2002); Sim-\nmons et al. (2004); Munroe and Lamb (2005)) and used to\nexamine the generation of the internal tide in a range of\ngeographical locations. These models were able to extend\nthe results from the cross sectional models, and showed the\nimportance of along shelf topography (which recent obser-\nvations (Sherwin et al. (2002)) have shown to have a sig-\nnificant effect on the tide), off shelf seamounts (Xing and\nDavies (1998b), hereafter XD98; Xing and Davies (1999)),\nand how the shape of shelf slopes, seamounts and ridges\ninfluenced internal tide propagation (Holloway and Mer-\n2\nrifield (1999); St. Laurent et al. (2003); Cummins et al.\n(2001); Hibiya (2004)). However, the hydrostatic nature of\nthese models meant that soliton generation and propaga-\ntion could not be included. To examine these, a range of\nmodels that solved the KdV equations was developed and\nproved very successful in determining the processes leading\nto soliton generation at the shelf edge (e.g. Gerkema and\nZimmerman (1995); Gerkema (2001, 2002)).\nWith enhanced computational resources the solution of\nthe non-hydrostatic equations (e.g. Adcroft et al. (1997);\nMarshall et al. (1997b,a); Berntsen and Furnes (2005);\nBerntsen et al. (2006)) in cross-sectional form was possi-\nble, giving rise to detailed studies of soliton development\nat the shelf edge (Lamb (1994, 2002)). In addition, this\nform of model was used to examine the generation of\nhigher harmonics of the tide in the proximity of seamounts\n(Lamb (2004)), and the extent to which energy is radiated\nas internal waves (Lamb (2007)).\nThe degree to which tidal barotropic energy at the shelf\nedge or in other regions of abrupt topography is parti-\ntioned between internal waves which can radiate energy\naway from the region, or local mixing is a topic of increas-\ning importance. To get the correct form of energy transfer\nfrom the barotropic tide to the baroclinic tide, higher\nharmonics (Khatiwala (2003)) and short waves that con-\ntribute to mixing it is essential to use a non-hydrostatic\nmodel (Xing and Davies (2006)). Also the problem of\ntidal mixing in shelf edge regions of rough topography has\nbeen investigated (e.g. New (1988)). This enhanced mix-\ning has been shown to have important consequences for\nthe computed circulation produced by large scale models\n(e.g. Samelson (1998); Spall (2001)). Recently (Saenko\nand Merrifield (2005); Saenko (2006)), this work has been\nextended, particularly in Saenko (2006) where a coupled\nocean-atmosphere model with various vertical diffusivity\ndistributions was used to determine the sensitivity of the\nsolution to these distributions. Calculations showed that\nclimate models gave different meridional oceanic circula-\ntions, heat transports, stratification and climate response\nto atmospheric CO2 increase depending upon whether ver-\ntical diffusivity was or was not related to spatial variations\nin internal tidal mixing.\nThis suggests that the accuracy of climate models will be\nsignificantly influenced by the ability of the oceanic model\nto accurately reproduce the intensity and spatial variability\nof mixing due to the internal tide. To examine this mixing\nin detail, and in particular the consequences of along slope\nrough topography, three dimensional non-hydrostatic cal-\nculations have been performed (Legg and Adcroft (2003);\nLegg (2004b,a)).\nTo date the majority of these calculations used uniform\nfinite difference models, or models with an across shelf grid\nrefinement. However, as clearly demonstrated by the shal-\nlow sea applications of finite element models, this approach\nis ideal in a shelf edge environment where both enhanced\nresolution is required at the shelf edge and at offshore lo-\ncations e.g. seamounts.\nThe advantages of using finite elements to compute the\nM2 component of the internal tide in a shelf edge region\nwith off shelf seamounts was examined by Hall and Davies\n(2005a), (hereafter referenced as HD05a). To make a com-\nparison with a fine resolution (2.4 km across shelf and 4.6km\nalong shelf) finite difference internal tide model, (XD98),\nHD05a used a range of finite element meshes to compute\nthe internal tide off the west coast of Scotland. The region\ncovered by themodel, namely theMalin-Hebrides shelf, was\nidentical to that used by XD98, as were the open boundary\nconditions and water depths. Also the same vertical strat-\nification was used. By this means a like with like compari-\nson was possible and the influence of finite element resolu-\ntion on the internal tide could be determined. A compari-\nson with limited measurements (although not all collected\nunder identical conditions) was also possible. Although the\nmain features of the internal tide computed with the fi-\nnite difference model and the coarse and fine finite element\nmodel were comparable, it was evident that the intensity\nof the M2 internal tide in its generation region and its sub-\nsequent propagation was improved by using the finer mesh\nfinite element grid. However, no appreciable improvement\nin comparison with observations was found, presumably\nbecause of slight differences in stratification between the\nmodel and those taken at the time of the measurements.\nIn addition, as shown by Xing and Davies (1997b) using a\ncross sectional model with idealized topography, meteoro-\nlogical effects can influence the distribution of the internal\ntide. As no measurements of meteorological forcing or its\neffect upon the stratification at the time the internal tide\nmeasurements were made it is not possible to quantify from\nthe measurements the extent to which the internal tide is\ninfluenced bymeteorological forcing. Consequently, it is not\npossible to state from existing observations to what extent\nsuch measurements are required in order to validate models\nof the internal tide. However, results from the cross section\nmodel of XD97 using idealized topography suggests meteo-\nrological effects have a major influence on the internal tide.\nIn this paper, the work presented in XD97 is extended\nto the case of a three dimensional model. A finite element\nrather than a finite difference approach is used. The region\nconsidered is the Malin-Hebrides shelf, and the model res-\nolution is identical to that used by HD05a. By comparing\ndifferences in the internal tide, produced under a range of\nwind conditions, some insight as to the role meteorology\ndoes or does not play in modifying the internal tidal sig-\nnal in different regions can be assessed. At locations where\nthe internal tide is particularly sensitive to wind direction,\nthen an assessment as to the value of internal tide measure-\nments in these regions without the associated meteorologi-\ncal forcing, in a model skill assessment can be determined.\nIn essence the aims of the paper are twofold. The first, to\nunderstand the role of wind direction in modifying the in-\nternal tide in a three-dimensional model. The second to ap-\npreciate the sensitivity of internal tide measurements in a\ngiven area to small scale variation with and without wind\nforcing and hence their reliability in any skill assessment\n3\nexercise.\nThe form of the paper is such that the model and region\nconsidered is detailed in the next section. Subsequent sec-\ntions describe the three dimensional variability of the M2\ninternal tide. Later the response to wind forcing and the\nresulting changes in tidal distribution are considered, with\na final section summarizing results and presenting a ”way\nforward”.\n2. The hydrodynamic model and region\nAlthough previous calculations (XD97) used a cross-\nsectional model, the full three-dimensional equations and\nthe turbulence closure model were presented there and\nelsewhere (Xing and Davies (2001c)). Consequently, they\nwill not be repeated here, where we will summarize their\nmain features. In addition, to be consistent with XD97, the\nhydrostatic approximation is used in these equations and\ndensity is derived from temperature using a simple equa-\ntion of state (XD98). The rigid lid approximation is not\nmade, and the model is forced by the barotropic tide. Con-\nsequently, the model is fully prognostic, with free surface\nelevation changing as the tide propagates on and off shelf.\nThis propagation produces up-welling and downwelling of\nthe temperature field in the shelf edge region and hence\nthe generation of an internal tide (XD98, HD05a). Vertical\nmixing of momentum and density are parameterized using\nvertical eddy viscosity and diffusivity coefficients com-\nputed using a turbulence energy closure, namely Mellor\nand Yamada sub-model. This sub-model contains predic-\ntive equations for length scale and turbulence energy. As\nthe form of the model is given elsewhere (Blumberg and\nMellor (1987), pp. 116; Luyten et al. (2002) ; XD98) it will\nnot be repeated here. The Smagorinsky (1963) form of hor-\nizontal eddy viscosity has been shown by Hall and Davies\n(2005c) (hereafter HD05b) to be particularly good at pre-\nventing the development of numerical instabilities when\nwind forced internal waves are generated on an irregular\ngrid. This form of viscosity is used here.\nSince the present calculation is concerned with the short\nterm modification of the internal tide due to wind forcing,\nrather than its seasonal variation, there is no applied sur-\nface heat flux. However, wind stress forcing from various\ndirections is used, and incorporated as a surface bound-\nary condition on momentum and turbulence as in XD97. A\nquadratic friction law as in XD98 was applied at the seabed.\nAlong the open boundary identical barotropic tidal forcing\nto that used in the finite difference model (XD98) and finite\nelement model (HD05a) was applied. A sigma coordinate\nwith 40 levels in the vertical was used in the calculations.\nThe spacing was such that there was enhanced resolution in\nthe near-bed and near surface region (as in XD98, HD05a)\nwhere the internal tide was largest. As in HD05a, the finite\nelement code (QUODDY, Lynch et al. (1996)) was used to\nsolve the discretized hydrodynamic equations.\nThe shelf and shelf edge region in the finite elementmodel\n(Fig. 1) is identical to that used by XD98 and HD05a. The\narea covers a range of water depths from the order of 10m\nclose to the coast to 3000m in the ocean. At the shelf edge\n(approximately the 200m contour) water depth changes\nrapidly, as it does along the edge of the Anton Dohrn\nSeamount and Hebrides Terrace Seamount. As shown in\nXD98 and HD05a, in these regions there is appreciable in-\nternal tide generation. Detailed studies using a range of\nunstructured grid approaches (HD05b, Hall and Davies\n(2005b)) showed that to accurately reproduce wind forced\ninternal waves generated in regions of topographic change\nit was necessary to have a fine grid adjacent to the topog-\nraphy. Similarly, HD05a, found that to reproduce the in-\nternal tide in the region shown in Fig. 1, to a greater ac-\ncuracy than that found in XD98, it was necessary to refine\nthe grid in the regions of rapidly changing topography. To\naccomplish this the same finite element grid (Fig. 2) used\nby HD05a, in their tidal calculations is applied here. Ide-\nally a more gradual transition in element size as the shelf\nedge is approached may be preferable to that shown in Fig.\n2. However, this would increase the computational effort,\nand as shown in HD05a, by comparing various mesh reso-\nlutions, and from more idealized calculations (HD05b, Hall\nand Davies (2005b)), the mesh given in Fig. 2 yields an\naccurate solution. In addition, by using the same mesh in\nthe present calculations a direct comparison with HD05a is\npossible, enabling the effect of the wind upon the tide to be\ndetermined. As in all calculations that use a sigma coordi-\nnate representation in the vertical, there are problems with\ncomputing the internal pressure gradient and other terms\n(e.g. Haney (1991); Mellor et al. (1998)) with such an ap-\nproach. In regions of steep topography errors in the internal\npressure gradient can give rise to a spurious along shelf flow.\nHowever, this effect can be minimized by ensuring that as\nwater depth changes so does the horizontal grid resolution,\nso as to maintain the Haney condition (Haney (1991)). In\na region of varying density gradient, water depth and shelf\nslope, where the finite element grid is often chosen to ensure\nan accurate representation of the slope region (see Legrand\net al. (2007)) the Haney criterion is of necessity violated in\na number of regions and hence a small erroneous along shelf\nflow is generated. In the present calculation the mesh was\nrefined to resolve as accurately as possible the shelf slope\ntopography, but not to such an extent that the departure\nfrom the Haney criterion was excessive. In essence the hor-\nizontal resolution in the shelf slope region was consistent\nwith that used in the vertical. In addition, the residual flow\ndetermined from the harmonic analysis used to derive the\nM2 component of the tide did not show a large spurious\nshelf edge flow (HD05a).\nIn all calculations the model started from a state of rest\nwith zero elevation and current, with the same tempera-\nture profile as used by XD97, applied everywhere. By this\nmeans the temperature surfaces were initially horizontal.\nThe M2 barotropic tidal forcing was applied along the open\nboundary and as found in HD05a, after 6 tidal cycles a\nperiodic barotropic tide and quasi-periodic baroclinic tide\n4\nFig. 1. Model domain and bottom topography (water depths in m) used in the calculations. The lines marked C2, D1n, D1c and D1s denote\nthe latitude of cross sections where the influence of the wind upon the tide is examined in detail. Also shown are geographical locations of\nregions named in the text.\nwere established, which was harmonically analysed to give\nthe tidal distributions shown here. Although the western\nside of the Anton Dohrn seamount is in close proximity to\nthe open boundary this did not pose a major problem as\nthe internal tide was mainly confined to the region of the\nseamount (see detailed analysis of energy fluxes in XD98).\nTo be consistent with XD98, only the M2 internal tide is\nexamined, although the S2 tide is also appreciable. In addi-\ntion, the barotropic diurnal tides K1 and O1 are intensified\nin this region due to shelf edge resonance (see Xing and\nDavies (1998a) for detail). However, as these components\nare subinertial they do not give rise to an internal tide, but\nhave significant barotropic currents in the region.\nIn subsequent calculations the effect of wind forcing pro-\nduced by a uniform steady wind, upon the M2 tide was ex-\namined. To be consistent with XD97, a wind stress of 0.2\nPa was applied. To avoid the generation of strong inertial\noscillations which would persist in the solution and mask\nthe steady wind induced response, the wind stress was in-\ncreased with a sine wave form corresponding to the first\nquarter of a sine curve (namely 0 to π\/2) for 12 h during\nthe spin up stage.\n3. Tidal calculations\nIn an initial calculation (Calc. 1, Table 1) as in HD05a\nthe model was forced by the barotropic tide. As discussed\nWind Wind Wind\nCalc duration magnitude towards\n1 Tide only\n2 Short 0.2Pa North\n3 Long 0.2Pa North\n4 Short 0.2Pa South\n5 Long 0.2Pa South\nTable 1\nSummary of various calculations.\nin HD05a, this produces a strong baroclinic tide that is sep-\narated from the total solution by subtracting a barotropic\ntide computed by running the model in a homogeneous\nform (see HD05a for detail). The resulting baroclinic tidal\ncycle is then analysed to yield the M2 component of the\nbaroclinic tide. A similar approach was applied in the wind\nforced case.\nAs shown by XD96a, b, XD97 and HD05a, the presence\nof the Anton Dohrn offshore seamount at about 57.5 ◦N\n(Fig. 1) influences the distribution of the M2 internal tide\nin this region. For this reason we will start by examining\nthe distribution of the M2 tide in this area, initially with-\nout and subsequently with wind forcing. By comparing so-\nlutions the influence of wind effects on the M2 internal tide\ncan be quantified. As shown in HD05a, there is significant\nspatial variability in the M2 internal tide in the region of\nthe Anton Dohrn seamount, due to local topographic vari-\nations. To examine this variability in the baroclinic tide,\ncross sections D1n, D1c and D1 s (Fig. 1) are initially con-\n5\nFig. 2. Finite element grid used in the calculations.\nsidered in detail to determine how local changes in topog-\nraphy influence the M2 tide in the absence of wind forcing.\nFrom Figs. 3a-c, it is evident that the large-scale features of\nthe u current amplitude of the internal tide found by XD96\nin their finite difference solution are present here. On the\nshelf a surface and bottom intensification of M2 baroclinic\ncurrent amplitude (Fig. 3a) which is indicative of a first\nmode internal wave is evident at all locations. In addition,\nthe bottom intensification of the internal tide at the shelf\nbreak, extending down the slope was also found by XD98.\nThe extent of this downslope region of intensified bottom\ncurrent does however vary from section to section (compare\nFigs. 3a-c).\nThe generation of an M2 internal tide along the edges of\nthe seamount, with a surface maximum was also found by\nXD98. However, it is clear from Figs. 3a-c that the inten-\nsity and distribution varies significantly in the seamount\narea. As shown by XD96a, XD98, in the Anton Dohrn re-\ngion both super-critical and sub-critical internal tides are\ngenerated along the shelf slope and on the seamount sides,\nproducing internal tides that propagate both onto the shelf\nand into the ocean. In both threedimensional calculations\nwith and without the seamount, and two dimensional cross\nsection calculations, XD98 showed that the exact location\nand topography of the seamount was responsible for the off-\nshelf distribution of the internal tide. At cross section C2,\nto the south of the seamount, where the slope is steeper,\nthe region of maximum M2 internal tide occurs down the\nslope in deeper water (Fig. 3d). A surface intensification is\npresent in the shelf break region, with a slight increase on\nthe shelf at depth. This suggests that there is little on shelf\npropagation of the internal tide at this cross section.\nTo determine to what extent tidal mixing, as the inter-\nnal tide upwells and downwells over the steep topography\ninfluences the temperature field, the tidally averaged (over\na tidal period) temperature field over cross section D1 was\nexamined (Fig. 4). Temperature contours on the shelf (Fig.\n4), show a well-mixed region in shallow coastal waters (to\nthe east of 9.5 ◦Wand not covered in Fig. 4) with a near ver-\ntical displacement relative to the topography of isotherms\nin regions of steep topography. Some of this is due to bound-\nary layer mixing. In addition, advection by residual flows\ngenerated by non-linear effects (Xing and Davies (2001b)),\nand density driven currents produced by differential mixing\nbetween lateral boundary layer flow and currents outside\nthe boundary layer also contribute to the displacement of\ntemperature surfaces from their initial positions. Although\nit is evident from Fig. 4, that the extent of this displace-\nment varies with depths below the surface, it is useful to\nexamine its spatial variability at a given depth. To this end\nthe model was run for a significantly longer period of time\n(namely 20 tidal cycles) to allow tidal mixing and tidally\nproduced turbulent kinetic energy (t.k.e.) to become estab-\nlished.\nA near uniform spatial distribution of temperature at\n600mwas found away from the Anton Dohrn Seamount and\n6\n(a)\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n2\n4\n2\n6\n2\n8\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0 (b)\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n2\n4\n2\n6\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\n(c)\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0 (d)\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W 8°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n1500\n1000\n500\n0\nFig. 3. Amplitude (cm s−1) of the M2 harmonic of the u-component of the baroclinic tide along various cross sections, namely (a) D1n, (b)\nD1c, (c) D1s and (d) C2 from a short tidal integration.\nthe shelf edge region. As this water depth is above the top\nof the seamount, the reduction in temperature is associated\nwith enhanced vertical mixing above the seamount. The\nnature of this mixing will be discussed later in the paper.\nSimilarly in the shelf edge region enhanced up-welling and\nvertical mixing leads to regions of colder water at a depth\nof 600m in the shelf edge region to the north of 57 ◦N (Fig.\n5). The lateral extent of the cold water region varies along\nthe shelf edge, tending to be largest in the region to the\nnorth-east of the Anton Dohrn seamount where there is an\nappreciable M2 tidal energy flux both along and across the\ndepth contours (see Fig. 3 in XD98). A comparable energy\nflux occurs over the Anton Dohrn Seamount (XD98). To\nthe south of 57 ◦N in the region of cross section C2 there\nappears to be a region of slightly warmer shelf edge water\nat 600m depth, compared to the oceanic temperature. In\nthis area, the orientation of the shelf edge relative to the\ntide is different than farther north (XD98). Also the shelf\nslope is different (compare shelf edge gradients in Figs. 3b\nand d) giving rise to a maximum internal tidal current at\nabout 1200m depth (Fig. 3d) rather than higher up the\nslope (of order 600 m) found farther north (Fig. 3b). These\ndifferences in location at depth of maximum internal tidal\ncurrent generation suggests that there will be differences\nin shelf slope boundary layer mixing with depth that will\ninfluence the temperature distribution, and hence internal\ntide generation and propagation. A detailed study of the\ndistributions of temperature, turbulent kinetic energy, eddy\nviscosity and mixing (not presented) showed that regions\nof maximum t.k.e. occur at locations of maximum internal\ntidal current amplitude. Consequently, in the shelf slope\nregion there will be considerable small-scale variation in the\nlocation of strong t.k.e. regions and associated mixing. This\ngives rise to significant spatial variability in the internal\ntide, suggesting that a detailed measurement programme\nis required for model validation in such areas.\n4. Wind influence upon the internal tide\n4.1. A down-welling favourable wind (wind towards the\nnorth)\nIn this series of calculations, in addition, to barotropic\ntidal forcing through the open boundary the model was\n7\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n3 4 5 6 7 8 9 1\n0\n1\n1\n1\n2\n1\n3\n1\n4\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 4. Temperature contours (◦C) at cross section D1n from a short tidal integration.\nforced by a down-welling favourable wind (wind towards\nthe north) of 0.2 Pa (Calc 2, Table 1). On the short time\nscale, time averaged (over an M2 tidal cycle) temperature\ncontours along cross section D1n (not presented) show some\nenhanced mixing and weakening of the thermocline in the\nsurface layer (top 100 m), with little or no change at depth.\nContours of the difference in u amplitude of the M2 internal\ntide show (Fig. 6) that the change in the M2 internal tide\nis mainly restricted to the surface layer where the density\nfield has been modified by the wind. The largest changes\noccur in the surface layer above the seamount and along the\nshelf edge where the current due to the internal tide was a\nmaximum (Fig. 3a). On average these changes were of the\norder of 5 cm s−1, (Fig. 6) compared with the M2 internal\ntidal current amplitude (Fig. 3a) of order above 20 cm s−1.\nAt other cross sections (not shown) the change in surface\ntemperature field and distribution of the M2 internal tidal\ncurrent was not appreciably different to that shown in Figs.\n4 and 6.\nIn this calculation the wind stress was only applied for a\nshort period of time. Consequently, the major change in the\ndensity field only occurred in the surface layer. As shown\nby XD97 in a cross section model, when a wind stress of\n0.2 Pa was applied for 30 tidal cycles there was appreciable\nupwelling along the shelf slope region which affected the\ngeneration and offshelf propagation and hence the M2 tide\nat depth. To examine this in more detail, particularly in\nthe seamount region the previous calculation was repeated\nwith the wind applied for 20 tidal cycles (Calc. 3).\nContours of the mean temperature at cross section D1n,\nreveal a significantly weaker surface thermocline (Fig. 7),\nwith appreciably more mixing in shallow water than found\nin the tide only calculation (Fig. 4). At depth, particularly\nin the regions adjacent to the sea bed, enhanced mixing has\nchanged the local density gradient. Part of this mixing is\ndue to the wind field, but a plot of temperature contours\nat the same time without wind showed that because of\nthe extended time integration period tidal mixing had also\ncontributed to the mixing at depth in slope regions.\nContours of the difference in baroclinic M2 u-current am-\nplitude (Fig. 8) between those computed with long period\nwind forcing and the equivalent tidal forcing only, show\nthat there is no substantial change on the shelf. However,\nin the surface layer above the shelf break and at the top\nof the shelf slope there has been an appreciable change in\nM2 baroclinic tidal current amplitude (Fig. 8) associated\nwith the change in stratification in this region. Similarly at\ndepth near the foot of the slope an appreciable M2 inter-\nnal tide is produced (Fig. 8) associated with the change in\nstratification in this region. A strong internal tide is also\nproduced along the western side of the seamount (Fig. 8).\nPreviously (Fig. 3a) there was no internal tidal signal in\nthis region. The reason for the appearance of the internal\ntide in this region is due to a local change in stratification\n8\nLongitude12°W 11°W 9°W 8°W\nLa\ntit\nud\ne\n55°N\n56°N\n58°N\n59°N\n6\n.7\n6\n.8\n6\n.9\n7\n.0\n7\n.1\n7\n.2\n7\n.3\n7\n.4\n7\n.5\n7\n.6\n7\n.7\n7\n.8\n7\n.9\n8\n.0\n8\n.1\n8\n.2\n8\n.3\n8\n.4\n8\n.5\n8\n.6\nFig. 5. Horizontal temperature distribution (◦C) at a depth of 600m below the surface from a long tidal integration.\ndue to prolonged tidal and wind induced mixing. A similar\nchange occurred at cross sections D1c and D1s (not shown)\ndue to comparable changes in the stratification at depth.\nTo determine to what extent the presence of a long (20\ntidal cycle) wind stress of 0.2 Pa towards the north has\nupon the turbulence energy distribution, and mixing a de-\ntailed study of the spatial distribution of turbulence and\ntemperature was performed (not presented). This shows\nthat the presence of the surface wind stress gives rise to an\nenhanced layer of surface and onshelf turbulence at cross\n9\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 1 2 3 4 5 6 7 8 9 1\n0\n1\n1\n1\n2\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 6. Contours of the difference in M2 baroclinic tidal amplitude (cm s−1) between the wind (0.2 Pa North) and tidal solution and a tide\nonly solution for short wind duration forcing (Calc. 2) at cross section D1n.\nsection D1n that was not present with only tidal forcing. In\naddition, the distribution of t.k.e. in the seamount and shelf\nslope region changes, associated with wind induced circu-\nlation and mixing, and corresponding changes to the den-\nsity field. Associated with this change in density field are\nchanges in the location and intensity of the internal tide.\nSimilar changes in t.k.e. distribution occur along the other\nseamount cross sections (not shown), although the spatial\nvariability of the mixing from one cross section to another\nappears to be enhanced by the presence of the wind.\nThis series of calculations clearly shows that a modest\nwind stress of 0.2 Pa can modify the distribution of the in-\nternal tide. On the short time scale this is confined primar-\nily to the surface layer. On the longer time scale it modifies\nthe stratification along shelf slopes, and in particular those\nassociated with off-shelf seamounts. The shelf slope modifi-\ncation is consistent with that found by XD97 using a cross\nsectional model. However, results from the present three-\ndimensional model show significant along slope variability,\nand the limitations of instrument deployments along a sin-\ngle cross section in terms of model validation.\n4.2. An up-welling favourable wind (wind towards the\nsouth)\nTo determine the extent to which the internal tide is\nmodified by an up-welling favourable wind stress, the pre-\nvious calculations were repeated with a 0.2 Pa wind stress\ntowards the south. Calculations were performed with both\na short duration (Calc. 4) and longer duration (Calc. 5)\nwind stress.\nWith the short duration wind forcing, temperature con-\ntours along cross section D1n (not presented) show en-\nhanced surface mixing, which was comparable to that found\npreviously with the downwelling favourable wind. Some\nslight differences in the region of topographic slopes were\nevident due to changes in mixing with a down-welling wind\ncompared to up-welling. The main features of the spatial\ndistribution of the change in M2 tidal current amplitude\ndue to the up-welling wind (Fig. 9) are comparable to those\nfound with the down-welling wind (Fig. 6). The most no-\ntable difference compared with the previous distribution\n(Fig. 6) is an increase in intensity and lateral extent in\nthe surface region of difference in u current amplitude at\nabout 10 ◦W. This is due to changes in shelf slope strati-\nfication which influences the generation region and subse-\nquent propagation of the M2 internal tide. At other cross\nsections (not shown) the change in the distribution of the\n10\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n3 4 5 6 7 8 9 1\n0\n1\n1\n1\n2\n1\n3\n1\n4\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 7. Temperature contours (◦C) at cross section D1n from a long tide and wind (0.2 Pa North) integration.\nM2 tidal current amplitude produced by wind forcing was\ncomparable to that shown in Fig. 9.\nFor the calculation involving a longer duration 0.2 Pa\nwind (Calc. 5), there is appreciably more mixing in the\nslope regions. This is discussed in more detail in XD97 and\nwill not be repeated here. Since this enhanced mixing oc-\ncurs in the slope region and diffuses out of this area into\nthe water column, it influences the regions where the inter-\nnal tide is generated and its subsequent propagation. The\nenhanced mixing with the longer duration wind explains\nthe increased differences in the pattern of change in the\nM2 internal tide produced with a down-welling compared\nto up-welling favourable wind (compare Figs. 8 and 10).\nHowever, the dominant large-scale features are similar sug-\ngesting these are mainly determined by the topography. As\npreviously this pattern of change is comparable at other\ncross sections in the region of the seamount, although qual-\nitatively different.\nThese comparisons show that on the longer time scale\nthere are appreciable differences in the change of the M2\ninternal tide under down-welling compared to up-welling\nwind forcing. These differences arise not only in the sur-\nface layer but at depth where the wind field has modified\nthe density field in the region of internal tide generation.\nThis shows that not only is the internal tide modified in\nits generation region, but its propagation and subsequent\nreflection at the surface are influenced by wind mixing.\n5. Concluding discussion\nIn this paper, a three dimensional finite element tidal\nmodel of the shelf edge region off the west coast of Scotland\n(HD05a) is extended to examine the influence of wind ef-\nfects upon the M2 internal tide in the area. The spatial vari-\nability of t.k.e. and associated mixing was also considered.\nPrevious calculations (XD97) used a simple cross sectional\nfinite difference model with idealized topography to study\nthe influence of the wind. Such a slice model could not ac-\ncount for the along-shelf variation of topography, or for the\npresence of seamounts. As shown in HD05a, b, the finite\nelement model with its ability to refine the grid in regions\nof rapid topographic change is an ideal tool to study topo-\ngraphic effects upon internal motions and hence extend the\nwork of XD97.\nIn initial calculations, the model was forced with the\nsame M2 tidal distribution of the barotropic tide as in\nHD05a. However, the main focus of the present calculations\nwas an examination of the spatial distribution of the in-\nternal tide. Theory, based upon idealized smooth topogra-\nphy and the absence of viscous effects, shows that internal\nwave energy propagates away from the generation site along\ncharacteristic surfaces, termed beams. However, the calcu-\nlations presented here showed that with realistic topogra-\nphy and viscous effects there was no well-defined point for\nthe M2 tide generation or well defined beams along which\n11\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n2\n4\n2\n6\n2\n8\n3\n0\n3\n2\n3\n4\n3\n6\n3\n8\n4\n0\n4\n2\n4\n4\n4\n6\n4\n8\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 8. As Fig. 6 but for a long integration (Calc. 3) with tide and wind (0.2 Pa North).\nit propagated. This was rather different than the isolated\nseamount results of Lamb (2004) who showed narrow well\ndefined beams for M2 propagation.\nThese differences between narrow beams found with ide-\nalized topography and the weaker broader beams found\nwith realistic topography with viscous effects included, in\npart reflects the additional complexity of the problem when\nrealistic topography is included. Also in a three dimensional\nmodel in which the grid is refined in regions of steep to-\npography, there may be a lack of resolution elsewhere. This\ncombined with diffusive effects could lead to a spreading\nof internal tidal beams. Consequently, besides choosing the\nmesh to reflect topography and density variation, although\nit will give a fine mesh in the generation region, it is also\nnecessary to preserve high resolution along the propaga-\ntion pathways. As these are difficult to determine, then the\nchoice of an optimum mesh, or an optimum measurement\nstrategy is prone to significant uncertainty.\nIn addition, to the spatial variability of the internal tide,\ndistributions of tidally induced t.k.e. were considered. The\nassociated mixing gave rise to changes in the temperature\nfield that were also examined. On the shelf strong tidal mix-\ning led to a homogeneous water column, while in regions\nof steep topography the vertical displacement of isotherms\ndue to tidal up-welling and down-welling gave regions of\nenhanced boundary layer mixing. The extent of this mix-\ning increased with time in particular in the region of the\nseamount, where a pool of cooler water occurred above the\nseamount associated with enhanced mixing in the region.\nIncreased tidally induced mixing above seamounts appears\ncommon and has been found elsewhere, e.g. the Fieberling\nSeamount (Kunze and Toole (1997)). A cold-water region\nalso occurred along the shelf edge in the northern part of the\nregion at a depth of 600m due to increased mixing in this\narea at this depth. The intensity and lateral extent of this\ncool water region could be related to variations in location\nand depth of internal tide generation with the associated\nt.k.e. production and elevated boundary layer mixing. Tur-\nbulent kinetic energy contours revealed significant spatial\nvariability in turbulence, with regions of strong near bed\nturbulence associated with areas of enhanced M2 internal\ntidal current.\nHaving determined the spatial distribution of the ampli-\ntude of the M2 internal tidal currents and associated mix-\ning in a subsequent series of calculations the influence of\nwind forcing upon them was examined. A wind stress of\n0.2 Pa either towards the north (down-welling favourable)\nor towards the south (up-welling favourable) was applied.\nInitially a short duration wind was used, although subse-\nquently a longer duration wind was applied.\nOn the short time scale the down-welling favourable wind\nonlymodified the near surface stratification, and the change\nto the M2 internal tidal current was restricted to the sur-\nface layer. Areas of maximum modification of internal tidal\n12\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 1 2 3 4 5 6 7 8 9 1\n0\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 9. Contours of the difference in baroclinic tidal current amplitude (cm s−1) between wind (0.2 Pa South) and tidal solution and a tide\nonly solution for short wind duration forcing (Calc. 4) at cross section D1n for the M2 period.\ncurrent occurred in the surface layer above the seamount\nand shelf break, where the tidal current was a maximum.\nOn the longer time scale both the tide and down-welling\nfavourable wind modified the temperature field at depth,\ngiving rise to a modification of the density field at depth\nand a change in the distribution of the internal tide. Asso-\nciated with these changes in tidal distribution were modi-\nfications to the t.k.e. field.\nChanges in theM2 internal tide producedwith up-welling\nfavourable winds on the short time scale were compara-\nble to those found with the downwelling favourable wind.\nThe reason for this is that on the short time scale it is\nthe mixing in the surface layer that has the greatest effect\nand this is not significantly influenced by wind direction.\nOn the longer time scale there were differences in mixing\nin the slope regions between down-welling and upwelling\nfavourable winds. These gave rise to an appreciable modifi-\ncation of the M2 internal tide together with boundary layer\nturbulence. Although in practice a persistent wind from a\ngiven direction is unlikely to occur, these calculations do\nshow that the internal tide is modified by density changes\nproduced by the wind. In addition, changes in density field\nin the shelf edge region are likely to occur due to large scale\nmodulation of the along shelf flow by oceanic effects. These\nwill also lead to changes in the internal tide and associated\nt.k.e. levels and mixing.\nThe extent to which an along shelf flow of oceanic origin\nor produced by wind forcing can penetrate on to the shelf\nis determined by bottom frictional effects (e.g. Hill (1995)).\nSince the tidal flow in the shelf edge region and on the shelf\ndetermines the level of friction, it is essential to include it\nwithin any model of the wind induced circulation of the\nshelf edge region (e.g. Davies and Xing (2005b); Xing and\nDavies (1996b, 2001a)).\nAs we have shown in this paper, the fact that the distri-\nbution of the M2 internal tide is particularly sensitive to\ntopographic variations and density field has major impli-\ncations for model validation and data collection. To enable\nthe modelling of internal tides to progress to the same ex-\ntent as that achieved for barotropic tides will require a way\nforward based on major observational and modelling pro-\ngrammes. In terms of topography a detailed measurement\nprogramme is required to produce high-resolution water\ndepths in shelf edge regions. As found in a comprehensive\nand detailed comparison of observed and modelled inter-\nnal tides in the region, using a range of grids (HD05a),\nalthough the model grid can be refined in the shelf edge\nregion thereby improving resolution, there is a lack of de-\ntailed depth data to ensure that the finer resolution grid\naccurately reproduces the local topographic gradient. As\nknown from theory the local topographic gradient is crucial\nfor internal tide generation.\n13\nLongitude\nD\nep\nth\n(m\n)\n11°W 10°W 9°W\n0 2 4 6 8 1\n0\n1\n2\n1\n4\n1\n6\n1\n8\n2\n0\n2\n2\n2\n4\n2200\n2000\n1800\n1600\n1400\n1200\n1000\n800\n600\n400\n200\n0\nFig. 10. As Fig. 9, but for a long duration wind (0.2 Pa South) (Calc. 5).\nSince topographic measurements do not have to be taken\nat the same time, a piece-meal approach to developing a\ncomprehensive topographic data set is possible. On the\nother hand a near synoptic data set of temperature and\nsalinity is required to provide an initial density field for\nan internal tidal model. Theory and detailed comparisons\nwith measurements (XD98, HD05a) have shown that inter-\nnal tide generation and propagation is particularly sensi-\ntive to the density distribution at the time measurements\nare made.\nAs shown here meteorological effects can significantly in-\nfluence density distributions and hence internal tide pro-\nduction and propagation in regions of abrupt topography.\nThis suggests that detailed meteorological data at the time\ninternal tide measurements are made is required in such\nareas. Away from topographic effects, and the surface ther-\nmocline where, as we have shown short term variations of\nmixing due to atmospheric forcing are likely to occur, the\nlarger scale density field is more persistent and probably\ndoes not require high resolution sampling. However, the ad-\nvection of oceanic water into a regional model would have to\nbe monitored, together with more detailed measurements\nof temperature, salinity and mixing in regions of steep to-\npography. These would be required to provide accurate ini-\ntial conditions for the model and to check that the model\nwas reproducing the correct density distribution in regions\nwhere the internal tide was generated. As shown here, the\nhigh degree of spatial variability of the internal tide from\none cross section to another in areas of steep topography\nsuggests that detailed measurements are required in these\nregions. In addition, the high degree of spatial variability\nfound in t.k.e. intensity in regions of steep topography sug-\ngests that detailed measurements of turbulence dissipation\nrate and mixing are required in such areas. However, the\npersistence of enhanced mixing above topographic features\nsuch as the Anton Dohrn Seamount, with corresponding\nregions found elsewhere in the location of seamounts (e.g.\nthe Fieberling Seamount (Kunze and Toole (1997))), sug-\ngests that these areas together with other regions of steep\ntopography could be the focus of detailed measurements\nto validate mixing intensities computed with internal tidal\nmodels. The ability of an unstructured mesh model to focus\nresolution in these areas suggests that it is an ideal tool to\nuse to complement the high-resolution measurements that\nwill be required in these regions. In addition, to changes in\ndensity field influencing the propagation of internal waves,\nregions of lateral horizontal shear associated with fronts\n(Davies and Xing (2005a); Xing and Davies (2005)) also\naffect internal wave propagation and can lead to local en-\nhanced mixing. Detailed measurements of lateral shear in\nsuch regions, and unstructured grid models with the ability\nto reproduce these shears is an essential feature of any long\nterm internal tide prediction system. However, in terms\nof short term predictions, data assimilation methods (Ku-\n14\nrapov et al. (2003)) can be used to enhance model accuracy\nprovided detailed measurements are available for assimila-\ntion.\nThe calculations described here were performed with a\nhydrostatic model. However, recent measurements (e.g. In-\nall et al. (2004, 2005)) and modelling (Xing and Davies\n(2006)) suggest that non-hydrostatic effects will be impor-\ntant in regions of steep topography. Such models are cur-\nrently being developed using topography following coordi-\nnates (e.g. Berntsen and Furnes (2005); Heggelund et al.\n(2004); Berntsen et al. (2006)) or with a z-coordinate (Ad-\ncroft et al. (1997); Marshall et al. (1997a,b); Pain et al.\n(2005)). They have recently been used in a z-coordinate\nform (Legg (2004a,b)) to investigate internal tide genera-\ntion at a shelf slope. Calculations show that the effect of\nincluding non-hydrostatic processes is to significantly en-\nhance small-scale variability in the internal tide generation\nregion. In addition, inclusion of non-hydrostatic effects per-\nmits soliton generation and propagation. A rigorous vali-\ndation of a models ability to generate and propagate these\nsmall-scale features would require a major measurements\nprogramme, not only in their generation region but in the\nfar field area into which they propagate.\nRecent calculations (Xing and Davies (2006)) with small\nscale topography and non-hydrostatic models demonstrate\nthat there is significant energy loss from the tide into small\nscale mixing processes in regions of rough topography\nsuch as the shelf slope. Basin scale calculations (Samelson\n(1998); Spall (2001); Saenko and Merrifield (2005); Saenko\n(2006)) have shown that the ocean circulation is influenced\nby these shelf edge mixing processes. The disparity in grid\nsize between basin scale models (of order kilometres) and\nthe small scale calculations of Xing and Davies (2006)\n(grid size of order meters) suggests that an important fu-\nture topic will be using high resolution models to develop\nmixing parameterizations suitable for large scale models.\nWith present advances in computing, it is clear that\nthree-dimensional models using unstructured grids and the\ninclusion of non-hydrostatic effects will replace the conven-\ntional uniform grid finite difference model in the near fu-\nture. To parallel these developments major comprehensive\nmeasurement programmes will be required particularly in\nshelf edge regions where there are rapid changes in topog-\nraphy and associated small-scale variability. Improvements\nin the ability of shelf edge models to predict internal tidal\ndistributions, and the associated small scale variations in\ncurrents, internal wave fields and mixing will have impor-\ntant consequences in sediment (e.g. Davies andXing (2002);\nXing and Davies (2002); Davies et al. (2002)) and biological\nmodelling. In these models accurate and detailed descrip-\ntions of flow fields, associated mixing, internal wave fields\nand bed stresses are essential to progress the modelling of\nsediment and biological processes.\nAcknowledgements\nThe authors are indebted to Mrs. L. Parry for typing the\npaper and Mr. R.A. Smith for help in figure production.\nAccess to bottom topography, open boundary forcing were\nprovided by Dr. J. Xing and are gratefully acknowledged.\nAccess to the QUODDY code via the web site is much\nappreciated.\nReferences\nAdcroft, A., Hill, C., Marshall, J., 1997. Representation of\ntopography by shaved cells in a height coordinate ocean\nmodel. Monthly Weather Review 125, 2293–2315.\nBerntsen, J., Furnes, G. K., 2005. Internal pressure er-\nrors in sigma-coordinate oceanmodels—sensitivity of the\ngrowth of the flow to the time stepping method and pos-\nsible nonhydrostatic effects. Continental Shelf Research\n25, 829–848.\nBerntsen, J., Xing, J., Alendal, G., 2006. Assessment of\nnon-hydrostatic ocean models using laboratory scale\nproblems. Continental Shelf Research 26, 1433–1447.\nBlumberg, A. F., Mellor, G. L., 1987. A description of a\nthree-dimensional coastal ocean circulation model. No. 4\nin Coastal and Estuarine Sciences. American Geophysi-\ncal Union, Washington, DC, p. 208pp.\nCartwright, D. E., 1976. Shelf edge tidal measurements be-\ntween ireland and norway. Memoires de la Societe Royale\ndes Sciences de Liege 10, 133–140.\nChen, P.,Mellor, G. L., 1999. Determination of tidal bound-\nary forcing using tide station data. No. 56 in Coastal and\nEstuarine Studies. American Geophysical Union, Wash-\nington, DC, pp. 329–351.\nCraig, P. D., 1987. Solutions for internal tide generation\nover coastal topography. Journal of Marine Research 45,\n83–105.\nCummins, P. F., Cherniawsky, J. Y., Foreman, M. G. G.,\n2001. North Pacific internal tides from the Aleutian\nRidge: altimeter observations and modeling. Journal of\nMarine Research 59, 167–191.\nCummins, P. F., Oey, L. Y., 1997. Simulation of barotropic\nand baroclinic tides off Northern British Columbia. Jour-\nnal of Physical Oceanography 27, 762–781.\nDavies, A. M., Xing, J., 2002. Processes influencing sus-\npended sediment movement on the Malin-Hebrides shelf.\nContinental Shelf Research 22 (15), 2081–2113.\nDavies, A. M., Xing, J., 2005a. The effect of a bottom\nshelf front upon the generation and propagation of near-\ninertial internal waves in the coastal ocean. Journal of\nPhysical Oceanography 35, 976–990.\nDavies, A. M., Xing, J., 2005b. Modelling processes influ-\nencing shelf edge exchange of water and suspended sed-\niment. Continental Shelf Research 25, 973–1001.\nDavies, A. M., Xing, J., Huthnance, J. M., Hall, P., Thom-\nsen, L., 2002. Models of near-bed dynamics and sediment\nmovement at the Iberian margin. Progress in Oceanog-\n15\nraphy 52 (2-4), 373–397.\nEgbert, G. D., Erofeeva, S. Y., 2002. Efficient inverse mod-\neling of barotropic ocean tides. Journal of Atmospheric\nand Oceanic Technology 19, 183–204.\nFlather, R. A., 1976. A tidal model of the north west Eu-\nropean continental shelf. Memoires de la Societe Royale\ndes Sciences de Liege 10, 141–164.\nFlather, R. A., Hubbert, K. P., 1989. Tide and surge mod-\nels for shallow water—Morecambe Bay revisited. Vol. 1.\nCRC Press, Boca Raton, FL, pp. 135–166.\nFortunato, A. B., Baptista, A. M., Luettich, R. A., 1997. A\nthree-dimensional model of tidal currents in the mouth of\nthe Tagus estuary. Continental Shelf Research 17, 1689–\n1714.\nFortunato, A. B., Oliviera, A., Baptista, A. M., 1999. On\nthe effect of tidal flats on the hydrodynamics of the Tagus\nestuary. Oceanologica Acta 22, 31–44.\nGerkema, T., 2001. Internal and interfacial tides: beam\nscattering and local generation of solitary waves. Journal\nof Marine Research 59, 227–251.\nGerkema, T., 2002. Application of an internal tide gener-\nation model to baroclinic spring-neap cycles. Journal of\nGeophysical Research 107(C9), 3124.\nGerkema, T., Zimmerman, J. T. F., 1995. Generation of\nnoni-linear internal tides and solitary waves. Journal of\nPhysical Oceanography 25, 1081–1094.\nGjevik, B., Hareide, D., Lynge, B. K., Ommundsen, A.,\nSkailand, J. H., Urheim, H. B., 2006. Implementation of\nhigh resolution tidal current fields in electric navigational\nchart systems. Marine Geodesy 29, 1–17.\nGreenberg, D. A., Dupont, F., Lyard, F. H., Lynch, D. R.,\nWerner, F. E., 2007. Resolution issues in numerical mod-\nels of oceanic and coastal circulation. Continental Shelf\nResearch 27, 1317–1343.\nHall, P., Davies, A. M., 2005a. Comparison of finite differ-\nence and element models of internal tides on the Malin-\nHebrides shelf. Ocean Dynamics 55, 272–293.\nHall, P., Davies, A. M., 2005b. Effect of coastal boundary\nresolution and mixing upon internal wave generation and\npropagation in coastal regions. Ocean Dynamics 55, 248–\n271.\nHall, P., Davies, A. M., 2005c. The influence of an irregular\ngrid upon internal wave propagation. Ocean Modelling\n10, 193–209.\nHaney, R. L., 1991. On the pressure gradient force over\nsteep topography in sigma coordinate ocean models.\nJournal of Physical Oceanography 21, 610–619.\nHeggelund, Y., Vikeb, F., Berntsen, J., Furnes, G. K., 2004.\nHydrostatic and non-hydrostatic studies of gravitational\nadjustment over a slope. Continental Shelf Research 24,\n2133–2148.\nHeniche, M., Secretin, Y., Boudreau, P., Leclerc, M., 2000.\nA two-dimensional finite element drying-wetting shallow\nwater model for rivers and estuaries. Advances in Water\nResources 23, 359–372.\nHibiya, T., 2004. Internal wave generation by tidal flow\nover a continental shelf slope. Journal of Oceanography\n60, 637–643.\nHill, A. E., 1995. Leakage of barotropic slope currents onto\nthe continental shelf. Journal of Physical Oceanography\n25, 1617–1621.\nHolloway, P. E., 1996. A numerical model of internal tides\nwith applications to the Australian North-West shelf.\nJournal of Physical Oceanography 26, 21–37.\nHolloway, P. E., Merrifield, M. A., 1999. Internal tide gener-\nation by seamounts, ridges, and islands. Journal of Geo-\nphysical Research 104(C11), 25,937–25,951.\nInall, M. E., Cottier, F. R., Griffiths, C., Rippeth, T. P.,\n2004. Sill dynamics and energy transformation in a jet\nfjord. Ocean Dynamics 54, 307–314.\nInall, M. E., Rippeth, T. P., Griffiths, C., Wiles, P., 2005.\nEvolution and distribution of T.K.E. production and dis-\nsipation within stratified flow over topography. Geophys-\nical Research Letters 32, L08607.\nIp, J. T. C., Lynch, D. R., Friedrichs, C. T., 1998. Simula-\ntion of estuarine flooding and dewatering with applica-\ntion to Great Bay, New Hampshire. Estuarine, Coastal\nand Shelf Science 47, 119–141.\nKhatiwala, S., 2003. Generation of internal tides in an ocean\nof finite depth: analytical and numerical calculations.\nDeep-Sea Research I 50, 3–21.\nKunze, E., Toole, J. M., 1997. Tidally driven vorticity, di-\nurnal shear, and turbulence atop Fieberling Seamount.\nJournal of Physical Oceanography 27, 2663–2693.\nKurapov, A. L., Egbert, G. D., Allen, J. S., Miller, R. N.,\nErofeeva, S. Y., Kosro, P. M., 2003. The m2 internal tide\noff Oregon: Inferences from data assimilation. Journal of\nPhysical Oceanography 33, 1733–1757.\nLamb, K. G., 1994. Numerical experiments of internal wave\ngeneration by strong tidal flow across a finite amplitude\nbank edge. Journal of Geophysical Research 99(C1), 843–\n864.\nLamb, K. G., 2002. A numerical investigation of solitary\ninternal waves with trapped cores formed via shoaling.\nJournal of Fluid Mechanics 451, 109–144.\nLamb, K. G., 2004. Non-linear interaction among internal\nwave beams generated by tidal flow over supercritical\ntopography. Geophysical Research Letters 31, L09313.\nLamb, K. G., 2007. Energy and pseudoenergy flux in the\ninternal wave field generated by tidal flow over topogra-\nphy. Continental Shelf Research 27, 1208–1232.\nLegg, S., 2004a. Internal tides generated on a corrugated\ncontinental slope. part ii. along-slope barotropic forcing.\nJournal of Physical Oceanography 34, 1824–1838.\nLegg, S., 2004b. Internal tides generated on a corrugated\nslope. part i: Cross-slope barotropic forcing. Journal of\nPhysical Oceanography 34, 156–173.\nLegg, S., Adcroft, A., 2003. Internal wave breaking at con-\ncave and convex continental slopes. Journal of Physical\nOceanography 33, 2224–2246.\nLegrand, S., Deleersnijder, E., Delhez, E., Legat, V.,\n2007. Unstructured, anisotropic mesh generation for the\nNorthwestern European continental shelf, the continen-\ntal slope and the neighbouring ocean. Continental Shelf\n16\nResearch 27, 1344–1356.\nLuyten, P. J., Carniel, S., Umgiesser, G., 2002. Validation of\nturbulence closure parameterizations for stably stratified\nflows using the PROVESS turbulence measurements in\nthe North Sea. Journal of Sea Research 47, 239–267.\nLynch, D., Hannah, C. G., 2001. Inverse model for limited-\narea hindcasts on the continental shelf. Journal of Atmo-\nspheric and Oceanic Technology 18, 962–981.\nLynch, D. R., Ip, J. T. C., Naimie, C. E., Werner, F. E.,\n1996. Comprehensive coastal circulation model with ap-\nplication to the Gulf of Maine. Continental Shelf Re-\nsearch 16, 875–906.\nLynch, D. R., Smith, K., Blanton, B., Luettich, R., Werner,\nF. E., 2004. Forecasting the coastal ocean: resolution,\ntide, and operational data in the South Atlantic Bight.\nJournal of Atmospheric and Oceanic Technology 21,\n1074–1085.\nMarshall, J., Hill, A. A. C., Perelman, L., Heisey, C., 1997a.\nA finite-volume incompressible Navier Stokes model for\nstudies of the ocean on parallel computers. Journal of\nGeophysical Research 102, 5753–5766.\nMarshall, J., Hill, C., Perelman, L., Adcroft, A., 1997b.\nHydrostatic, quasi-hydrostatic and nonhydrostatic ocean\nmodelling. Journal of Geophysical Research 102(C3),\n5733–5752.\nMellor, G. L., Oey, L. Y., Ezer, T., 1998. Sigma coordi-\nnate pressure gradient errors and the seamount prob-\nlem. Journal of Atmospheric and Oceanic Technology 15,\n1122–1131.\nMerrifield, M. A., Holloway, P. E., 2002. Model estimates\nof m2 internal tide energetics at the Hawaiian Ridge.\nJournal of Geophysical Research 107(C8), 3179.\nMunroe, J. R., Lamb, K. G., 2005. Topographic amplitude\ndependence of internal wave generation by tidal forcing\nover idealized three-dimensional topography. Journal of\nGeophysical Research 110, C02001.\nNew, A. L., 1988. Internal tidal mixing in the bay of biscay.\nDeep-Sea Research 35, 691–709.\nNiwa, Y., Hibiya, T., 2004. Three-dimensional numerical\nsimulation of m2 internal tides in the East China Sea.\nJournal of Geophysical Research 109, C04027.\nPain, C. C., Piggott, M. D., Goddard, A. J. H., Fang, F.,\nGorman, G. J., Marshall, D. P., Eaton, M. D., Power,\nP. W., de Oliveira, C. R. E., 2005. Three-dimensional\nunstructured mesh ocean modelling. Ocean Modelling\n10, 5–33.\nPingree, R. D., New, A. L., 1989. Downward propagation\nof internal tidal energy into the Bay of Biscay. Deep-Sea\nResearch 36, 735–758.\nPingree, R. D., New, A. L., 1991. Abyssal penetration and\nbottom reflection of internal tidal energy into the Bay of\nBiscay. Journal of Physical Oceanography 21, 28–39.\nPingree, R. D., New, A. L., 1995. Structure, seasonal de-\nvelopment and sunglint spatial coherence of the internal\ntide on the Celtic and Armorican shelves in the Bay of\nBiscay. Deep-Sea Research I 42, 245–284.\nProctor, R., James, I. D., 1996. A fine-resolution 3D model\nof the southern North Sea. Journal of Marine Systems 8,\n285–295.\nSaenko, O. A., 2006. The effect of localized mixing on the\nocean circulation and time-dependent climate change.\nJournal of Physical Oceanography 36, 140–160.\nSaenko, O. A., Merrifield, W. J., 2005. On the effect of to-\npographically enhanced mixing on the global ocean cir-\nculation. Journal of Physical Oceanography 35, 826–834.\nSamelson, R. M., 1998. Large scale circulation with locally\nenhanced vertical mixing. Journal of Physical Oceanog-\nraphy 28, 712–726.\nSherwin, T. J., Taylor, N. K., 1989. The application of\na finite difference model of internal tide generation\nto the NW European Shelf. Deutsche Hydrographische\nZeitschrift 42, 151–167.\nSherwin, T. J., Taylor, N. K., 1990. Numerical investiga-\ntions of linear internal tide generation in the Rockall\nTrough. Deep-Sea Research 37, 1595–1618.\nSherwin, T. J., Vlasenko, V. I., Stashchuk, N., Jeans, D.\nR. G., Jones, B., 2002. Along-slope generation as an ex-\nplanation for some unusually large internal tides. Deep-\nSea Research I 49, 1787–1799.\nShum, C. K., Woodworth, P. L., Andersen, O. B., Egbert,\nG. D., Francis, O., King, C., Klosko, S. M., le Provost,\nC., Li, X., Molines, J. M., Parke, M. E., Ray, R. D.,\nSchlax, M. G., Stammer, D., Tierney, C. C., Vincent, P.,\nWunsch, C. I., 1997. Accuracy assessment of recent ocean\ntide models. Journal of Geophysical Research 102(C11),\n25,173–25,194.\nSimmons, H. L., Hallberg, R. W., Arbic, B. K., 2004. In-\nternal wave generation in a global baroclinic tide model.\nDeep-Sea Research II 51, 3043–3068.\nSmagorinsky, J., 1963. General circulation experiments\nwith the primitive equations I. The basic experiment.\nMonthly Weather Review 91, 99–164.\nSpall, M. A., 2001. Large scale circulations forced by local-\nized mixing over a sloping bottom. Journal of Physical\nOceanography 31, 2369–2384.\nSt. Laurent, L., Stringer, S., Garrett, C., Perrault-Joncas,\nD., 2003. The generation of internal tides at abrupt to-\npography. Deep-Sea Research I 50, 987–1003.\nThompson, K. R., Griffin, D. A., 1998. A model of the cir-\nculation on the outer Scotian Shelf with open boundary\nconditions inferred by data assimilation. Journal of Geo-\nphysical Research 103(C13), 30,641–30,660.\nThompson, K. R., Ohashi, K., Sheng, J., Bobanovic, J., Ou,\nJ., 2007. Suppressing bias and drift of coastal circulation\nmodels through the assimilation of seasonal climatologies\nof temperature and salinity. Continental Shelf Research\n27, 1303–1316.\nWalters, R. A., 1987. A model for tides and currents in\nthe English Channel and North Sea. Advances in Water\nResources 10, 138–148.\nWalters, R. A., 2005. Coastal ocean models: two useful fi-\nnite element methods. Continental Shelf Research 25,\n775–794.\nWalters, R. A., Werner, F. E., 1989. A comparison of two\n17\nfinite element models of tidal hydrodynamics using a\nNorth Sea data set. Advances in Water Resources 12,\n184–193.\nWerner, F. E., 1995. A field test case for tidally forced flows:\na review of the tidal flow forum. American Geophysical\nUnion, Washington, DC, pp. 269–284.\nXing, J., Davies, A. M., 1996a. Application of turbulence\nenergy models to the computation of tidal currents and\nmixing intensities in shelf edge regions. Journal of Phys-\nical Oceanography 26, 417–447.\nXing, J., Davies, A. M., 1996b. A numerical model of the\nlong term flow along the Malin-Hebrides shelf. Journal\nof Marine Systems 8(304), 191–218.\nXing, J., Davies, A. M., 1996c. Processes influencing the\ninternal tide, its higher harmonics, and tidally induced\nmixing on theMalin-Hebrides shelf. Progress inOceanog-\nraphy 38, 155–204.\nXing, J., Davies, A. M., 1997a. Application of a range of\nturbulence energy models to the computation of the in-\nternal tide. International Journal of Numerical Methods\nin Fluids 26, 1055–1084.\nXing, J., Davies, A. M., 1997b. The influence of wind ef-\nfects upon internal tides in shelf edge regions. Journal of\nPhysical Oceanography 27, 205–262.\nXing, J., Davies, A. M., 1998a. Influence of stratification\nupon diurnal tidal currents in shelf edge regions. Journal\nof Physical Oceanography 28(9), 1803–1831.\nXing, J., Davies, A. M., 1998b. A three-dimensional model\nof internal tides on the Malin-Hebrides shelf and shelf\nedge. Journal of Geophysical Research 103(C) (12),\n27821–27847.\nXing, J., Davies, A. M., 1999. The influence of topographic\nfeatures and density variations upon the internal tides\nin shelf edge regions. International Journal of Numerical\nMethods in Fluids 31, 535–577.\nXing, J., Davies, A. M., 2001a. The influence of shelf edge\nflows and wind upon the circulation on the Malin Shelf\nand in the Irish Sea. Continental Shelf Research 21(1),\n21–45.\nXing, J., Davies, A. M., 2001b. Non-linear effects of internal\ntides on the generation of the tidal mean flow at the\nHebrides shelf edge. Geophysical Research Letters 28,\n3939–3942.\nXing, J., Davies, A. M., 2001c. A three-dimensional baro-\nclinic model of the Irish Sea: Formation of the thermal\nfronts and associated circulation. Journal of Physical\nOceanography 31, 94–114.\nXing, J., Davies, A. M., 2002. Influence of wind direc-\ntion, wind waves and density stratification upon sedi-\nment transport in shelf edge regions: Iberian Shelf. Jour-\nnal of Geophysical Research 107(C8), 16–1–16–24.\nXing, J., Davies, A. M., 2005. Influence of a cold water bot-\ntom dome on internal wave trapping. Geophysical Re-\nsearch Letters 32, L03601, doi:10.1029\/2004GLO21833.\nXing, J., Davies, A. M., 2006. Processes influencing tidal\nmixing in the region of sills. Geophysical Research Let-\nters 33, L04603.\n18\n"}