{"doi":"10.1016\/j.jhydrol.2009.07.015","coreId":"69440","oai":"oai:eprints.lancs.ac.uk:26792","identifiers":["oai:eprints.lancs.ac.uk:26792","10.1016\/j.jhydrol.2009.07.015"],"title":"Controls on the spatial and temporal variability of Rn-222 in riparian groundwater in a lowland Chalk catchment.","authors":["Mullinger, Neil J.","Pates, Jackie M.","Binley, Andrew M.","Crook, N. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-30","abstract":"Radon is a powerful tracer of stream-aquifer interactions. However, it is important to consider the source and behaviour of radon in groundwater when interpreting observations of river radon in relation to groundwater discharge. Here we characterise the variability in groundwater radon concentrations in the riparian zone of a Chalk catchment. Groundwater 222Rn (radon) concentrations were determined in riparian zone boreholes at two sites in the Lambourn catchment, Berkshire, UK, over a two year period. In addition, borehole core material was analysed for 226Ra (radium) and to determine radon emanation. Radon and radium concentrations and radon emanation were found to change with depth and temporal variations in groundwater radon concentrations were found at different scales. The abundance of radium and emanation of radon increased nearer the surface leading to greater groundwater radon concentrations. It is shown that seasonal changes in water table elevation can to lead to variable radon concentrations in groundwater as zones of radon production become hydraulically active. Groundwater radon concentrations in shallow piezometers were found to respond to both seasonal changes in the water table and individual rainfall events. Riparian sources of radon can be variable and are therefore potentially influential in the radon signals observed in rivers and should be properly characterised when interpreting river radon inputs","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69440.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26792\/1\/Rn_in_groundwater_final_revsion_inc_figs.pdf","pdfHashValue":"37ae47e114f89e5c018c026695e8697918d0011b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26792<\/identifier><datestamp>\n      2018-01-24T02:49:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Controls on the spatial and temporal variability of Rn-222 in riparian groundwater in a lowland Chalk catchment.<\/dc:title><dc:creator>\n        Mullinger, Neil J.<\/dc:creator><dc:creator>\n        Pates, Jackie M.<\/dc:creator><dc:creator>\n        Binley, Andrew M.<\/dc:creator><dc:creator>\n        Crook, N. P.<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Radon is a powerful tracer of stream-aquifer interactions. However, it is important to consider the source and behaviour of radon in groundwater when interpreting observations of river radon in relation to groundwater discharge. Here we characterise the variability in groundwater radon concentrations in the riparian zone of a Chalk catchment. Groundwater 222Rn (radon) concentrations were determined in riparian zone boreholes at two sites in the Lambourn catchment, Berkshire, UK, over a two year period. In addition, borehole core material was analysed for 226Ra (radium) and to determine radon emanation. Radon and radium concentrations and radon emanation were found to change with depth and temporal variations in groundwater radon concentrations were found at different scales. The abundance of radium and emanation of radon increased nearer the surface leading to greater groundwater radon concentrations. It is shown that seasonal changes in water table elevation can to lead to variable radon concentrations in groundwater as zones of radon production become hydraulically active. Groundwater radon concentrations in shallow piezometers were found to respond to both seasonal changes in the water table and individual rainfall events. Riparian sources of radon can be variable and are therefore potentially influential in the radon signals observed in rivers and should be properly characterised when interpreting river radon inputs.<\/dc:description><dc:date>\n        2009-09-30<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26792\/1\/Rn_in_groundwater_final_revsion_inc_figs.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jhydrol.2009.07.015<\/dc:relation><dc:identifier>\n        Mullinger, Neil J. and Pates, Jackie M. and Binley, Andrew M. and Crook, N. P. (2009) Controls on the spatial and temporal variability of Rn-222 in riparian groundwater in a lowland Chalk catchment. Journal of Hydrology, 376 (1-2). pp. 58-69.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26792\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jhydrol.2009.07.015","http:\/\/eprints.lancs.ac.uk\/26792\/"],"year":2009,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1\n 1 \nControls on the spatial and temporal variability of 2 \n222Rn in riparian groundwater in a lowland Chalk 3 \ncatchment 4 \n 5 \nN.J. Mullinger, J.M. Pates*, A.M. Binley and N.P. Crook1  6 \nLancaster Environment Centre, Lancaster University, Lancaster LA1 4YQ, UK 7 \n 8 \n 9 \n 10 \n 11 \n* Corresponding author. Tel.: +44 1524 593896; fax: +44 1524 593985. 12 \nE-mail address: J.Pates@lancaster.ac.uk (J.M. Pates). 13 \n1 Current address: Geophysics Department, Stanford University, Stanford 94305, 14 \nUSA 15 \n 2\nAbstract 1 \nRadon is a powerful tracer of stream-aquifer interactions. However, it is important 2 \nto consider the source and behaviour of radon in groundwater when interpreting 3 \nobservations of river radon in relation to groundwater discharge. Here we characterise 4 \nthe variability in groundwater radon concentrations in the riparian zone of a Chalk 5 \ncatchment. Groundwater 222Rn (radon) concentrations were determined in riparian 6 \nzone boreholes at two sites in the Lambourn catchment, Berkshire, UK, over a two 7 \nyear period. In addition, borehole core material was analysed for 226Ra (radium) and 8 \nto determine radon emanation. Radon and radium concentrations and radon emanation 9 \nwere found to change with depth and temporal variations in groundwater radon 10 \nconcentrations were found at different scales. The abundance of radium and 11 \nemanation of radon increased nearer the surface leading to greater groundwater radon 12 \nconcentrations. It is shown that seasonal changes in water table elevation can to lead 13 \nto variable radon concentrations in groundwater as zones of radon production become 14 \nhydraulically active. Groundwater radon concentrations in shallow piezometers were 15 \nfound to respond to both seasonal changes in the water table and individual rainfall 16 \nevents. Riparian sources of radon can be variable and are therefore potentially 17 \ninfluential in the radon signals observed in rivers and should be properly characterised 18 \nwhen interpreting river radon inputs. 19 \n 20 \n 3\n1. Introduction 1 \nGroundwater-river water interactions are of great importance in groundwater 2 \ndominated catchments such as those found in Chalk areas. The conditions under 3 \nwhich groundwater will maintain river flow and the interactions between these bodies 4 \nof water must be understood to allow effective catchment management. Groundwater 5 \nmakes up one third of public water supplies in England and Wales, with 6 \napproximately half of this coming from Chalk aquifers (Downing, 1993).  The 7 \nimportance of Chalk catchments for water supply, as well as their ecological and 8 \namenity value, means that competing pressures on groundwater abstraction and river 9 \nflows must be balanced.  10 \nTracers are an important tool in the study of interactions between ground and river 11 \nwaters and enable the understanding of transport and mixing processes between water 12 \nbodies. Tracers allow the identification and quantification of flow paths and 13 \nestimation of the mixing ratios of water bodies, if sufficiently different chemical 14 \nsignatures can be identified for each end member. 15 \nRadon is a radioactive noble gas produced by the decay of radium that has been 16 \nwidely used as a tracer in groundwater studies. There are three naturally occurring 17 \nisotopes of radon: 219Rn, 220Rn and 222Rn. Here we are concerned only with the 222Rn 18 \nisotope, as the others have short half lives (t½ < 1 minute) which preclude them from 19 \nthe methods of analysis used here. 222Rn (t½ = 3.82 days) is the daughter of 226Ra and 20 \nboth are members of the 238U decay series. From here on the term ‘radon’ refers solely 21 \nto the 222Rn isotope. The terms ‘parent’ and ‘daughter’ are used to describe the 22 \ndecaying and the resulting nuclides respectively.  23 \nUranium is present in different mineral phases of all rock types at varying 24 \nconcentrations (Ball et al., 1991). Differences in the abundance and distribution of 25 \n 4\nminerals, and therefore uranium and radium, lead to differences in radon production 1 \nand emanation between geological units. Emanation describes amount of radon 2 \nproduced by decay of radium released from a material, in this case that which escapes 3 \nthe rock matrix into solution in the saturated zone of an aquifer. Emanation may be 4 \nreferred to as a rate if measured as the activity of radon released from a material per 5 \nunit time or as a coefficient, which reflects the proportion of radon produced by 6 \nradium that is released from a material. Radon emanation and the processes involved 7 \nare discussed comprehensively in Osmond and Ivanovich (1992) and Porcelli and 8 \nSwarzenski (2003). Radon is chemically and biologically inert and so in the saturated 9 \nzone of an aquifer there are no sources other than the decay of 226Ra and no sinks 10 \nother than its own radioactive decay. The chemical and physical characteristics of 11 \nradon make it a potentially powerful tracer in the study of groundwater-river water 12 \ninteractions.  13 \nRadon has several advantages over other natural and anthropogenic tracers. As a 14 \ngas, radon is readily lost from river water to the atmosphere, where concentrations are 15 \nnegligible by comparison. The enrichment of radon in groundwater with respect to 16 \nsurface waters means that it is easily detectable in zones of groundwater discharge 17 \nand subsequent degassing to the atmosphere allows the detection of successive 18 \ngroundwater inputs to a river. Sample collection and analysis requires relatively 19 \nsimple field and laboratory techniques and analysis by liquid scintillation 20 \nspectrometry can be automated allowing for high sample throughput (Pates and 21 \nMullinger, 2007). 22 \nIn a closed system, 222Rn will reach radioactive equilibrium with its parent 226Ra. 23 \nRadioactive equilibrium occurs when the activity of the daughter nuclide is equal to 24 \nthat of its parent, which is reached after approximately five daughter half-lives. The 25 \n 5\n3.82 day half life of radon means that equilibrium with a radium source will be 1 \nachieved in approximately 20 days. Previous studies of radon in groundwaters have 2 \nshown that its presence in solution is usually in excess of any dissolved radium 3 \n(summarised in Osmond and Cowart, 1992). Therefore, the majority of dissolved 4 \nradon must have been produced by decay of solid-phase radium and then released into 5 \ngroundwater via emanation processes. Due to radon’s short half-life and the tendency 6 \nfor concentrations to evolve towards equilibrium with its parent, we can assume that 7 \nradon in groundwater is mostly derived from the recent flow path and not solution 8 \nphase radium from historic flow paths. Radon is, therefore, indicative of the 9 \nimmediate geological environment unlike other solutes which may be transported 10 \nover greater distances.  11 \nRadon has been applied to the tracing of groundwater inputs into rivers and oceans 12 \n(e.g. Burnett et al., 2006; Cook et al., 2003; Genereux et al., 1993; Hamada, 1999; Lee 13 \nand Kim, 2006; Swarzenski et al., 2007) and in investigations of groundwater-river 14 \nwater interactions (e.g. Bertin and Bourg, 1994; Hoehn and von Gunten, 1989; 15 \nMacheleidt et al., 2002; Schubert et al., 2004). These studies have usually sampled a 16 \nnumber of groundwater monitoring wells in a catchment or aquifer and utilised either 17 \nthe mean or most reasonable single values as representative of catchment waters, i.e. a 18 \nconstant source term to the river is assumed (Cook et al., 2003; Ellins et al., 1990; 19 \nGenereux and Hemond, 1990). Cook et al. (2006) took account of spatial variability 20 \nof radon production within a river reach due to changes in geology while Genereux 21 \nand Hemond (1990) distinguished between vadose zone water and saturated zone 22 \nwater from the soil and bedrock horizons.  23 \nRecent work (Mullinger et al., 2007) has shown that temporal as well as spatial 24 \nvariation of radon in groundwater inputs can occur. Mullinger et al. used radon to 25 \n 6\ndevelop an understanding of some of the controls on groundwater inputs to the Pang 1 \nand Lambourn Chalk catchments in South-East England. In the Pang catchment 2 \ntemporally variable radon concentrations in spring discharges exerted a strong 3 \ninfluence over river radon concentrations. In the Lambourn, the modelled radon 4 \nconcentration in groundwater entering the river varied over time and appeared to 5 \nreflect local flow accretion. Grapes et al. (2006) observed that river stage in the 6 \nLambourn was closely related to local groundwater levels and the Lambourn’s 7 \nalluvial aquifer. The water table immediately adjacent to the river was generally 0.2-8 \n0.4 m higher than the river stage, with no flow in the river when the water table falls 9 \nbelow the level of the river bed (Grapes et al., 2005). Changes in radon inputs are 10 \nthought to be indicative of connectivity with the alluvial aquifer located in the river 11 \nvalley.  Therefore, it is hypothesised that changes in the level of the local water table 12 \nhave an impact on the source of radon being supplied to the river in the Lambourn. 13 \nThis hypothesis is the focus of the present study. 14 \nGroundwater studies of radon in the Chalk of the UK have previously focused on 15 \ndeep groundwaters. Sampling has typically been from public supply boreholes for the 16 \npurpose of investigating bulk aquifer properties (e.g. Low, 1996; Younger and Elliot, 17 \n1995). Observations by Low at public supply boreholes in the Chalk of East Anglia, 18 \nUK showed temporal variations in groundwater radon concentrations of up to 3 Bq l-1 19 \nin individual boreholes and a range of 3.5 to 9 Bq l-1 across the different sites. A large 20 \nrecharge event was shown to significantly lower groundwater radon concentrations 21 \nacross several boreholes. Low suggests that lower radon concentrations occur during 22 \ntimes of recharge.  23 \nAnother example of temporal changes in groundwater radon concentrations is 24 \nfound in a study of spring water derived from the Mendip Hills near Bristol (Andrews 25 \n 7\nand Wood, 1972). Andrews and Wood (1972) observed generally higher radon 1 \nconcentrations during periods of higher rainfall in water from two springs discharging 2 \nfrom the Carboniferous Limestone of the Mendips. The studies by Low (1996) and 3 \nAndrews and Wood (1972) show that, despite differences in the systems being 4 \nobserved, temporal changes in groundwater radon can exist under different 5 \nhydrological conditions.   6 \nThe source and behaviour of radon in groundwater are important factors in 7 \ninterpreting observations of river radon in relation to stream-aquifer interactions. In 8 \nthis paper we concentrate on the spatial and temporal variations that exist in the 9 \ngroundwater system only. The aims of this work are to characterise spatial variability 10 \nin the sources of radon relevant to groundwater-river interactions, i.e. the groundwater 11 \nand aquifer immediately adjacent to the river, to understand temporal changes in 12 \ngroundwater radon in this zone and to add to the relatively sparse data that exits on 13 \nradon in Chalk catchments.  14 \n 15 \n2. Site description 16 \nThe Lambourn is a groundwater dominated Cretaceous Chalk catchment 17 \n(Bradford, 2002) located in West Berkshire, UK (Fig. 1). The outcropping solid 18 \ngeology is almost entirely Chalk with minor Palaeogene deposits overlying the lower 19 \ncatchment and significant drift deposits in the river valley (Allen et al., 1997).  20 \nGroundwater dominated catchments are often, but not exclusively, characterised 21 \nby stable flow conditions with a high base flow index as well as stable temperature 22 \nand chemistry signals (Sear et al., 1999). The base flow index in the Lambourn is 0.96 23 \n(Grapes et al., 2005) and Neal et al. (2004) observed stable Ca, Mg and Sr profiles 24 \nalong the length of the perennial river channel. Stable physical and chemical 25 \n 8\nparameters in catchments of this type mean that many natural tracers are of limited 1 \nuse due to the homogeneity of water in the aquifer and river. As well as its importance 2 \nas a water source, the River Lambourn is of high ecological value as recognised by its 3 \ndesignation as a Site of Special Scientific Interest. The Lambourn catchment itself has 4 \na topographical catchment area of 234 km2 (Griffiths et al., 2006) and is a tributary of 5 \nthe River Kennet, which in turn flows into the River Thames. 6 \nThis paper focuses on the results of investigations carried out at two borehole 7 \ninstallations in the Lambourn valley at Maidencourt Farm (MCT) and East Shefford 8 \n(ESF) (Fig. 1). The study sites are located approximately halfway down the length of 9 \nthe catchment, where boreholes with nested piezometer arrays have been drilled in the 10 \nriparian zone. Drilling took place in June 2004 and at each site five boreholes were 11 \ninstalled, each with two piezometers screened at different depths. Inset diagrams in 12 \nFig. 1 show the layout of each site with respect to the river channel. The nomenclature 13 \nof the boreholes is described by the site initials (MCT or ESF) followed by a number 14 \n(1-5), which relates to the individual boreholes shown in Fig. 1 and Fig. 2, and a 15 \nsecond number (1 or 2), which defines the piezometer, piezometer 1 being the deeper 16 \nand piezometer 2 the shallower. E.g. MCT4-2 describes the shallow piezometer in 17 \nborehole 4 at Maidencourt Farm. The piezometers at these sites range in depth from 18 \n1.6 to 12.5 m bgl, with screened sections 0.8 m in length. At each site, four of the 19 \nboreholes are located in the alluvial plain close to the river and an additional deeper 20 \nborehole at each site (MCT1 and ESF1) is located further from the river on an 21 \nadjacent hill slope with both piezometers in these boreholes being located in the 22 \nChalk rather than the alluvium (Fig. 2). A common lithology is found at these 23 \nborehole sites. From 0 to 0.5 m there is a layer of stony \/ gravely soil below which 24 \nalluvial material is found mixed with marl and flint gravels to approximately 4 m. 25 \n 9\nThis alluvial layer is very heterogeneous between boreholes, with some sandy and 1 \nclayey layers found amongst chalky soils, and tends to be 0.5-1 m thicker at East 2 \nShefford. From 4 to 10 m is predominantly weathered Chalk and below 10 m the 3 \nChalk becomes more consolidated. The hill slope boreholes (MCT1 and ESF1) have a 4 \nsoil layer (~ 0.5 m) overlying weathered Chalk.  5 \n 6 \n3. Methods 7 \nRoutine borehole sampling was carried out between January 2005 and May 2006. 8 \nThis involved collecting triplicate samples from each piezometer on an approximately 9 \nmonthly basis. Additional sampling was also carried out at the end of 2006 to monitor 10 \nthe response of groundwater radon concentrations to rainfall events.  11 \nGroundwater samples were taken from piezometers using a submersible pump 12 \nfitted with a suitable length of hose and the pump inlet positioned in the middle of the 13 \nscreened section. First the piezometer was purged of three times the volume of the 14 \nscreened section to remove any water that may have been residing there for some 15 \ntime. Then 5 litres water were carefully pumped to a bucket from which a standard 16 \n600 ml bottle was filled and sealed under the water surface to exclude any air. A 17 \nfurther three screened section volumes were removed between samples, with triplicate 18 \nsampling used to ensure that the radon concentrations measured were representative 19 \nand had stabilised after purging. 20 \nDissolved radon concentrations were determined by liquid scintillation 21 \nspectrometry (LSS) according to Pates and Mullinger (2007). Samples were extracted 22 \nusing 20 ml of toluene, with a 10 ml aliquot being combined with the scintillation 23 \ncocktail Ultima Gold LLT (PerkinElmer) in a low-potassium glass vial before 24 \ncounting for 60 minutes on a Packard Tri-Carb 3170 liquid scintillation counter. 25 \n 10\nBorehole radon concentrations are means of triplicate samples and errors are standard 1 \ndeviations of the triplicate results. This method is hereafter referred to as the 2 \n“Toluene” method.  3 \nTo verify the results of the Toluene analyses an additional method (ASTM, 1998) 4 \nwas used. Ten millilitre samples of borehole water were taken from an overflowing 5 \nfunnel attached to the pump outlet using a disposable syringe. These samples were 6 \ninjected into pre-weighed glass scintillation vials containing the water-immiscible 7 \nscintillation cocktail Ultima Gold F (PerkinElmer), which were then counted (as 8 \nabove) with no further processing. This method of analysis was the only one 9 \nemployed in event sampling due to the logistics of collecting and analysing samples 10 \nover the observation period. Results for these analyses are for single samples; the 11 \nerrors quoted are the result of propagated counting and analytical errors. In all cases 12 \nthe relative errors of radon analysis by both methods are less than 10 %. Field trials of 13 \nthese radon analysis methods found highly reproducible results between replicate 14 \nsample analyses. Relative standard deviations of 5.2 % (n = 25) and 2.3 % (n = 19) 15 \nwere obtained for the ASTM and Toluene methods respectively (see Pates and 16 \nMullinger (2007) for a detailed discussion on the analytical errors and reproducibility 17 \nof both radon analysis methods used). 18 \nCores retained from the borehole drilling were analysed for radium content. Sub-19 \nsamples of 200-500 g were taken from the borehole core material at approximately 20 \none metre intervals from two boreholes at each site to a depth of 5 m. MCT2, MCT5, 21 \nESF3 and ESF5 were selected as providing the most continuous profiles of recovered 22 \ncore material. Samples were dried in an oven at 60 °C to constant mass, ground and 23 \nhomogenised using a tungsten carbide Tema mill and then passed through a 250 µm 24 \nmesh sieve. Radium was analysed by gamma spectrometry; 20 grams of sample was 25 \n 11\npressed into a pellet and sealed in polycarbonate petri dishes using an epoxy resin. 1 \nThese were then left for at least 30 days to allow 214Pb to reach secular equilibrium 2 \nwith 226Ra before counting by gamma spectrometry. Radium concentrations (Bq kg-1 3 \nof dry sample) were calculated from the 214Pb 352 keV photopeak with errors derived 4 \nfrom counting statistics (Currie, 1968) and errors in sample size.  5 \nEstimates of radon emanation from borehole core material were made by slurrying 6 \napproximately 60 g of sample material, prepared as for radium analysis, in a 60 ml 7 \nglass bottle with deionised water. The bottle was then filled to the brim with deionised 8 \nwater and sealed to exclude any air by a plastic screw cap with a PTFE faced sealing 9 \ndisc. The mass of rock sample and volume of water added was measured by weighing 10 \nthe sample bottle at each step. At least 30 days were allowed for radon to reach 11 \nequilibrium concentrations in the water. Ten millilitres of water was then extracted 12 \nfrom the bottle and analysed for radon content via the ASTM (1998) method giving 13 \nresults as Bq l-1. This concentration was then used to calculate the radon emanation 14 \n(ERn) from each rock sample in Bq kg-1 using equation (1). 15 \nM\nVRn\nE wRn\n⋅= ][ , (1)\nwhere [Rn] is the concentration of dissolved radon in the sample bottle (Bq l-1), Vw is 16 \nthe volume of water (litres) and M is the mass of the rock sample (kg). Results of 17 \nemanation measurements are presented as Bq kg-1 of dry sample material and are 18 \nmeans of triplicate analyses, errors are standard deviation of triplicate analyses. 19 \nEmanation coefficients were then calculated using equation (2). 20 \n][Ra\nEE Rncoeff = , (2)\n 21 \n 12\nwhere Ecoeff is the emanation coefficient and [Ra] the concentration of radium in the 1 \nrock sample (Bq kg-1).  2 \nTo estimate the density and porosity at these borehole sites, retained complete 3 \ncore samples (10 cm in diameter) from each piezometer depth were sectioned into 5 4 \ncm sub-samples. These sections were then hydrated at 20 ºC under pressure (max. 4 5 \nbar) to ensure maximum saturation before weighing. The cores were then oven dried 6 \nat 60 ºC until constant mass was reached. The porosity was calculated by mass 7 \ndifference from the volume of water lost after drying and the density was calculated 8 \nfrom the dry sample mass and sample volume. Errors in porosity and density 9 \nestimates are calculated by the propagation of errors in the measurement of sample 10 \nsize and mass. 11 \nFrom the results of radon emanation, porosity and density measurements the 12 \nfollowing equation was used to calculate the theoretical radon concentration of 13 \ngroundwater ([Rn]gw in Bq l-1) that would be in equilibrium with the local rock. 14 \nρφRngw ERn =][ , (3)\nwhere ERn is the emanation of radon from a sample (Bq kg-1), ρ is density (kg dm-3) 15 \nand φ  is porosity.  16 \nSlug tests were carried out to measure the hydraulic conductivity of each 17 \npiezometer and a number of the deeper piezometers at each site were equipped with 18 \npressure sensors (PS2100, Greenspan; HOBO U-20-001-01 series, Onset Computer 19 \nCorp. and miniTROLL, In-Situ Inc.). These sensors were set to log at 15 minute 20 \nintervals in order to monitor the changes in local hydraulic head. At least three repeat 21 \nmeasurements were made of hydraulic conductivity and results presented are the 22 \nmean and standard deviation of these measurements. 23 \n 13\nRiver flow at each borehole site was measured using a handheld acoustic Doppler 1 \nflow meter (SonTek FlowTracker). Surveys were carried out following the guidance 2 \nof the relevant British Standard (ISO748:2000, 2000) and Environment Agency R&D 3 \nTechnical Report W4 (Ramsbottom et al., 1997) to provide discharge data with an 4 \naccuracy of ± 10 %. Rainfall was measured by means of a tipping bucket rain gauge 5 \nlocated at East Shefford. 6 \n 7 \n4. Results 8 \nThe results of groundwater radon sampling at Maidencourt Farm and East 9 \nShefford in Table 1 and Table 2 respectively. Mean radon concentrations and the 10 \nmaximum and minimum observed concentrations are given for each piezometer. The 11 \nresults of hydraulic conductivity measurements, as well as porosity and density 12 \nestimates made from borehole core material recovered from each screened section, are 13 \nalso given. Table 3 shows the results of radium and radon emanation measurements 14 \nfor borehole core material. 15 \n 16 \n4.1 Spatial variability 17 \nThe water table is usually deeper at Maidencourt Farm than at East Shefford 18 \nduring the study period (Fig. 3a). There is also greater variation observed in the water 19 \ntable at Maidencourt Farm compared to East Shefford. Over the monitoring period the 20 \nwater table varied by 0.8 m at Maidencourt Farm and by 0.2 m at East Shefford. 21 \nMaidencourt Farm is the perennial head of the River Lambourn during late summer, 22 \nlow flow conditions (Grapes et al., 2006). 23 \nAs a result of the deeper water table and its variation during the sampling period 24 \nsamples were not obtained from MCT2-2. It was also not possible to obtain samples 25 \n 14\nfrom MCT4-2 due to the low hydraulic conductivity (Table 1) at this piezometer 1 \npreventing purging and sampling on a reasonable time scale. The results from each 2 \nsampled borehole show consistently low radon concentrations in water samples from 3 \nthe deeper piezometers, located in weathered Chalk, with means of between 1.1 and 4 \n1.8 Bq l-1 and a maximum range of 0.6 Bq l-1 in MCT4-1 (Table 1).  5 \nThere are differences between the observed radon concentrations in the shallower 6 \npiezometers MCT3-2 and 5-2. MCT3-2 has elevated radon concentrations relative to 7 \nall other sampled piezometers at Maidencourt Farm including MCT5-2, which is at a 8 \nsimilar depth and located on the opposite river bank. Radon in MCT3-2 switches 9 \nbetween two relatively stable concentrations of approximately 5 and 7 Bq l-1 (Fig. 4a) 10 \nduring the sampling period while MCT5-2 remains stable at between 1.2 and 1.8 Bq 11 \nl-1 (Table 1). Geological logs indicate that the cores from these piezometers consisted 12 \nof sandy gravel material, which at MCT5-2 is mixed with some Chalk.  13 \nAt East Shefford a similar vertical distribution of groundwater radon 14 \nconcentrations (Table 2) is observed as at Maidencourt Farm. The piezometers deeper 15 \nthan 4 m bgl have low and stable mean groundwater radon concentrations from 1.1 to 16 \n2.2 Bq l-1 with ranges of 0.7 Bq l-1 in ESF3-1 and 5-1. ESF4-1 is the shallowest of the 17 \n‘deep’ piezometers (3.9 m bgl) and has a mean radon concentration of 3.3 Bq l-1. 18 \nESF3-2, 4-2 and 5-2 all have relatively high mean groundwater radon concentrations 19 \n(> 10 Bq l-1), comparable to MCT3-2 (Fig. 4). ESF2-2 has low groundwater radon 20 \nconcentrations compared with piezometers of similar depths and locations at ESF and 21 \nmay be considered analogous in this respect to MCT5-2. As with MCT5-2 it is the 22 \nonly piezometer in the flood plain on its respective side of the river (Fig. 1). Overall it 23 \nis found that the shallower piezometers at East Shefford have higher groundwater 24 \n 15\nradon concentrations than those found in the shallower piezometers at Maidencourt 1 \nFarm.  2 \nRadium concentrations in core samples retained from drilling at Maidencourt 3 \nFarm reflect the trend seen in groundwater radon concentrations, with greater values 4 \nbeing observed nearer the surface (Fig. 5a). Radium concentrations in borehole core 5 \nmaterial are generally within the range 4.4-14.1 Bq kg-1 with a notable exception in 6 \nthe upper most sample from MCT2 of 39.4 ± 1.3 Bq kg-1. Core material from MCT2-7 \n2 has a very high radium concentration, which is associated with a clayey region 8 \nidentified in the geological log of this borehole. There is a general increase in radium 9 \nconcentration with decreasing depth of sample. There is clear heterogeneity in radium 10 \nacross both sites in the top few meters of each alluvial aquifer borehole. The mixture 11 \nof clay, gravel, flint material mixed to varying degrees with Chalk leads to differences 12 \nin radium concentration between the borehole core samples.  13 \nEmanation coefficients from borehole core material ranges from 0.05-0.23 with a 14 \nsingle high value at 0.37 corresponding to the upper most sample from MCT2, where 15 \na high radium concentration was also found (Fig. 5b). There is a general increase in 16 \nemanation with decreasing depth, similar to that observed in the core radium and 17 \ngroundwater radon data. These emanation results broadly reflect the range found in 18 \nother emanation studies. The emanation from a wide range of rock and soil types has 19 \nbeen investigated by Baretto et al. (1972) with other studies looking at limited rock 20 \nand soil types (Andrews and Wood, 1972; Bonotto and Andrews, 1997; Misdaq and 21 \nAmghar, 2005; Przylibski, 2000; Rama, 1991). No studies have been found in the 22 \nliterature for Chalk and soils of the type investigated here. Soils and heavily 23 \nweathered material have high and variable emanation coefficients, typically between 24 \n 16\n0.1 and 0.6. Consolidated rocks usually have much lower emanation, between 0.01 1 \nand 0.2, with higher values for less consolidated materials.  2 \n  The mean porosity and density measured in recovered core sections from the two 3 \nborehole sites are 39 % (range 24-47 %, standard deviation 8 %) and 1.7 g cm-3 (range 4 \n1.5-2.2 g cm-3, standard deviation 0.2) respectively. From these data and the radon 5 \nemanation results, estimates of equilibrium groundwater radon concentrations were 6 \nmade as described in equation (3) (Fig. 5c, errors calculated from propagation of 7 \nerrors in emanation, porosity and density measurements). For comparison the mean 8 \nobserved radon concentrations in each piezometer to a depth of 6 m bgl are shown in 9 \nFig. 5d (error bars show standard deviation of observations from each piezometer). 10 \nThese results are comparable with the observed data, with the exception of the high 11 \nradon value obtained for the upper most sample of MCT2 associated with the high 12 \nradium and emanation values. No groundwater radon samples were available from 13 \nMCT2-2 for comparison with the high estimated value, due to the low water table at 14 \nthis site during the study period (Fig. 2a).  15 \nHydraulic conductivities of the measured piezometers at both sites range from 0.4 16 \nto 156.2 m d-1. The lowest hydraulic conductivity occurs at MCT4-2 where its low 17 \nconductivity and close proximity to the water table led to slow recovery from 18 \npumping and prevented radon sampling. There is no observed relationship between 19 \nthe depth and the hydraulic conductivity at each of the piezometers, although there are 20 \na limited number of samples to compare below seven metres.  21 \n 22 \n4.2 Temporal variability 23 \nDeep piezometers (below 4 m bgl) at both borehole sites exhibit relatively low 24 \nradon concentrations, which are stable over time (Table 1 and Table 2). There is some 25 \n 17\ntemporal variation in radon concentrations in the piezometers located in the alluvial 1 \nplain. The consistency in replicate samples and the common patterns of variation in 2 \nboreholes ESF3 to ESF5 indicates that this variation is not simply a result of sample 3 \nscatter (Fig. 4). MCT3-2 switches between approximately 5 and 7 Bq l-1, increasing 4 \nbetween 21 July 2005 and 29 September 2005 and decreasing between 16 March 5 \n2006 and 4 May 2006. During both periods when switching occurs the riparian zone 6 \nwater table is falling or rising between the limits of 0.8 and 1.1 m bgl, c.f. study 7 \nperiod range of 0.6-1.4 m bgl (Fig. 3a). The fall in the water table also results in the 8 \nsource of the Lambourn migrating downstream of Maidencourt Farm, which is why 9 \nno river flow is recorded at this site between August 2005 and June 2006 (Fig. 3b). 10 \nThe shaded areas in Fig. 3b and Fig. 4a show that the change in radon concentration 11 \nin MCT3-2 coincides with the no-flow period in the river at Maidencourt Farm. 12 \nAt East Shefford, piezometers ESF3-2, 4-2 and 5-2 show changes in radon 13 \nconcentrations (Fig. 4b-d), but without the distinct periods of stability observed in 14 \nMCT3-2. During this period there is little movement in the depth of the riparian zone 15 \nwater table at East Shefford, which varies between 0.6 and 0.8 m bgl, and the changes 16 \nin radon concentrations do not indicate a relationship with seasonal groundwater 17 \nmovements. Additional higher resolution sampling was undertaken to help understand 18 \nthe observed temporal variations in groundwater radon at East Shefford. 19 \nFrom higher resolution sampling of groundwater radon during rainfall events it 20 \ncan be seen that short term responses occur at East Shefford. Two sampling periods 21 \ntook place in October and November 2006, during which rainfall events were 22 \ncaptured (Fig. 6). The October event is early in the recharge period and the water 23 \ntable at ESF3 is 0.78 m bgl, while in November groundwater has recovered to 0.68 m 24 \nbgl.  25 \n 18\nA total of 17.2 mm of rain fell on 11 October (Fig. 6a) contributing to a 7 cm head 1 \nresponse in ESF3-1 between 07:00 and 18:00 (Fig. 6b), followed by a steady 2 \nrecession period. There is a subtle response in groundwater radon concentrations to 3 \nthis input of water with decreases of 1.5 Bq l-1 in ESF3-2 and 2 Bq l-1 in ESF4-2 (Fig. 4 \n6c). The radon concentration in the shallow piezometers then increases during the 5 \nrecession in groundwater level. The magnitude of variation in deeper piezometers 6 \nmakes the responses to rainfall more difficult to discern. 7 \nOn the morning of 28 November 16 mm of rain fell (Fig. 6d) and this event 8 \nresulted in a 10 cm head response in ESF3-1 (Fig. 6e). Here the radon concentrations, 9 \nmonitored only in ESF3 on this occasion, show a response of 2 Bq l-1. Less of the 10 \nrecession curve was captured by post event sampling and so it is not clear whether 11 \nradon concentrations in ESF3-2 recovered fully after this event. 12 \nAlthough only small differences in radon concentrations are found in the first 13 \nevent the simultaneous response of piezometers ESF3-2 and ESF4-2 indicates that the 14 \nobservations are a response to rainfall. This hypothesis is then further supported by 15 \nthe observations during the second event, which show significant differences in pre- 16 \nand post-event radon concentrations. The greater radon response in the November 17 \nevent is likely to be due to the shallower depth of the water table providing more rapid 18 \nconnection of the infiltrating water to the aquifer and also to the greater intensity of 19 \nrainfall, which can be seen in the hydraulic head response. 20 \n 21 \n5. Discussion 22 \n5.1 Spatial Variability 23 \nFrom the analysis of groundwater and borehole core samples it can be seen that 24 \ngroundwater radon concentrations are related to the abundance of radium and 25 \n 19\ndifferences in emanation with depth. The increased abundance of radium and 1 \nemanation of radon near the surface results in a distinctive vertical groundwater 2 \nprofile in the riparian zone. It is also shown that measurements of radium 3 \nconcentration and radon emanation can give good indicative estimates of the 4 \ndistribution of groundwater radon concentrations that may be found at a site. The 5 \nresults reflect the types of deposit found in the vertical profile and the degree of 6 \nweathering in the near surface. The alluvial gravels and sediments in the river valley 7 \nare materials remaining after the erosion of the overlying Palaeogene deposits and the 8 \ninsoluble fraction of sediments co-deposited when the Chalk was formed. These 9 \ninsoluble sediments, containing clays and other fine material, tend to be higher in 10 \nradium than the carbonate matrix of the Chalk due to their mineral composition and 11 \nalso their adsorption properties, which allows for accumulation of parent nuclides on 12 \nsurfaces (Bonotto and Andrews, 1993; Osmond and Cowart, 1992).  13 \nThe higher radon concentrations in groundwaters from the shallow riparian 14 \npiezometers at East Shefford compared with Maidencourt Farm may be due to the 15 \nthicker alluvial deposits found at East Shefford, providing a larger radon source, and 16 \nthe elevated water table allowing dissolution of radon from nearer the surface.  17 \nThe heterogeneity of groundwater radon concentrations found in the shallow 18 \npiezometers of riparian zone boreholes indicates that spatial variation can occur in 19 \nnear-surface groundwater inputs to surface waters. Therefore, contributions to stream 20 \nradon from this type of system may vary along the course of a river. In river reaches 21 \nwhere there is significant interaction of groundwater with alluvial deposits in the river 22 \ncorridor, such as in the Lambourn Valley, the variation in groundwater radon could be 23 \nused to identify contributions to stream flow from the near-surface and deeper 24 \ngroundwaters depending upon the concentration of radon in the input water. It is also 25 \n 20\nshown that measurements of radium concentration and radon emanation can give 1 \ngood indicative estimates of the distribution of groundwater radon concentrations that 2 \nmay be found at a site. 3 \n  4 \n5.2 Temporal Variability 5 \nAt Maidencourt Farm the temporal trend of radon in MCT3-2 is to switch between 6 \ntwo relatively stable concentrations (Fig. 4a), suggesting that the changes occurring at 7 \nthis site are due to the seasonal changes in the water table (Fig. 3). When flow in the 8 \nriver at Maidencourt Farm stops, the radon concentration in groundwater of MCT3-2 9 \nincreases. This shows that there is a dynamic equilibrium between the radium source 10 \nand groundwater radon in the vicinity of MCT3-2. The controls on this relationship 11 \nare not known but may come from changes in water table elevation activating 12 \ndifferent radon sources.  13 \nThere is relatively little variation in the water table at East Shefford compared to 14 \nMaidencourt Farm (Fig. 3a) and no seasonal changes in groundwater radon are 15 \nobserved in the shallower piezometers at East Shefford. However, shorter time scale 16 \nchanges in groundwater radon concentrations of the order of weeks were observed at 17 \nEast Shefford during the routine sampling period (January 2005 to May 2006, Fig. 4b- 18 \nd).  19 \nFrom greater temporal resolution event sampling (October and November 2006) it 20 \ncan be seen that rainfall events have a rapid impact on the concentration of radon in 21 \nthe shallowest groundwaters (Fig. 6). The precise time of response is not captured in 22 \nthe samples taken and so estimates of the groundwater radon concentrations between 23 \nsamples are indicated by the interpreted response lines. The effect of infiltration of 24 \nlow radon event water is observed as deep as 3 metres below ground level and 25 \n 21\napproximately 2.5 m below the water table, demonstrating relatively rapid subsurface 1 \nmixing. The effects of greater rainfall intensity and the shallower water table at East 2 \nShefford in November lead to a greater event response in the groundwater radon 3 \nconcentration than in October. 4 \nFollowing the October event, reductions in radon concentrations of 18 and 12 % 5 \nare observed in ESF3-2 and 4-2, respectively. In November, radon concentrations 6 \ndecrease by 19 % in ESF3-2 following rain. Assuming that infiltrating water has a 7 \nzero radon concentration, mixing of between 12 and 19 % event water with existing 8 \ngroundwater is implied at these sites for the events observed. These values could be 9 \nconsidered a minimum degree of mixing as it assumes that the event water contains 10 \nno radon when it reaches the saturated zone. In reality it is likely to have accumulated 11 \nsome dissolved radon as a result of dissolution of radon in soil gas during transit 12 \nthrough the unsaturated zone. The accumulation of radon by recharge water will 13 \ndepend partially upon the mechanism of recharge and water movement through the 14 \nunsaturated zone at these sites (e.g. direct recharge by new rain water via fracture 15 \nflow vs. displacement of existing unsaturated zone water via a piston flow 16 \nmechanism, see Ireson et al., 2006).  17 \nEstimates of the time it would take for groundwater radon to recover to pre-event 18 \nconcentrations were made. The recovery time was estimated as the time taken to reach 19 \n95 % of the pre-event radon concentration, assuming a quasi-steady state system, 20 \nwhere the pre-event groundwater is in equilibrium with its source and the 21 \naccumulation of radon post event is governed by radioactive ingrowth (Andrews and 22 \nWood, 1972; Hoehn et al., 1992). Ingrowth of radon is calculated by the equation,  23 \n)1(0\nt\nt eAA\nλ−−= , (4)\n 22\nwhere At is the groundwater radon concentration (Bq l-1) at time t, A0 is the pre-event 1 \ngroundwater radon concentration (Bq l-1) and λ is the radioactive decay constant (t-1). 2 \nRecovery of radon concentrations from these rainfall events is calculated to take 3 \nbetween 5 and 7 days, depending on the piezometer and event. This is a theoretical 4 \nmaximum time for recovery to occur. Rapid recovery of pre-event radon 5 \nconcentration is observed in the October event where groundwater radon regains pre-6 \nevent concentrations less than 30 hours from the time of first rainfall. If radon 7 \nrecovery continues at the rate seen during recession of the second rainfall event then 8 \nthe groundwater will return to pre-event radon concentration within 48 hours. 9 \nGroundwater radon concentrations recover more quickly than is predicted by 10 \nradioactive ingrowth, emphasising that this is not a closed system. Speculation on the 11 \ndriving mechanism for this rapid recovery is not possible from this data set. 12 \nUnlike at East Shefford short time scale variations in groundwater radon 13 \nconcentrations are not seen in the routine monitoring data from Maidencourt Farm. It 14 \nmay be that the greater depth of unsaturated zone at Maidencourt protects the 15 \ngroundwater from such rapid and significant responses to rainfall events.  16 \nMullinger et al. (2007) proposed that the variations in modelled radon inputs to the 17 \nLambourn could be caused by changes in the radon concentration of groundwater 18 \nfeeding the river. The data presented here shows that consistently higher radon 19 \nconcentrations are found in groundwater nearer the surface of the alluvial aquifer. It is 20 \nhypothesised that the fluctuations in the water table provide a changing source of 21 \nradon in groundwater that may be discharged to a river. To examine the impact of 22 \nchanging water table elevation on radon concentrations in groundwater discharges, a 23 \ntrendline was fitted to the observed groundwater radon data using a linear regression 24 \nmethod to provide a relationship with depth (equation (5)). 25 \n 23\n-1.234.19114][ dRn = , (5)\nwhere [Rn] is groundwater radon concentration (Bq l-1) and d is depth (m). Fig. 5d 1 \nshows the groundwater radon concentrations estimated by equation (5) against mean 2 \nobserved radon concentrations (R2 = 0.65). By integrating over a given depth range 3 \nthe net radon concentration of groundwater discharges can be estimated. This has 4 \nbeen done for three example depth ranges, assuming an aquifer base of 3, 5 and 10 m 5 \nbgl and an equal contribution of groundwater from each depth. One metre has been 6 \nused as the upper limit of integration in all cases, as extrapolation of the relationship 7 \nbeyond this to shallower depths could not be justified given the rate of increase in 8 \nradon concentration increase that would result from the derived relationship. Results 9 \nof this exercise are shown in Fig. 7a, which shows the estimated radon concentration 10 \nof discharging groundwater for a given water table depth. 11 \nBy combining the above approach with observed water table data from Fig. 3a, the 12 \nvariation in groundwater radon concentration over time has been estimated for an 13 \naquifer depth of 5m (Fig. 7b). Result ranges are 4-6 Bq l-1 for MCT3 and 5.3-6.2 Bq 14 \nl-1 for ESF3, the greater variation in water table at Maidencourt Farm being reflected 15 \nin the estimated radon concentration. These results could be viewed as a lower limit 16 \nfor variation in discharge radon concentrations due to the assumption of equal 17 \ncontribution from each depth. Exponential mixing of groundwaters in shallow 18 \nunconfined systems leads to shorter residence times of shallower groundwaters (Cook 19 \nand Böhlke, 2000). Therefore, groundwater discharges may be made up by a greater 20 \nproportion of shallower groundwater, which will increase the mean concentration of 21 \ndischarge water. The conceptual model in Fig. 7c illustrates how movement of the 22 \nwater table could result in changes in radon concentrations of groundwater entering a 23 \nriver. As the water table rises it interacts more with the near-surface zone where radon 24 \n 24\nproduction is highest, leading to a higher mean groundwater radon concentration. This 1 \nmay also result in greater contributions of shallower groundwater to the river at times 2 \nwhen the water table is elevated, which will be of higher radon concentration. 3 \n 4 \n6. Conclusions 5 \nConsistently higher groundwater radon and borehole core radium concentrations 6 \nare found near the surface (0-4 m bgl) at both East Shefford and Maidencourt Farm 7 \nborehole sites, with low and stable radon concentrations at greater depths in the 8 \nweathered Chalk. The groundwater radon concentrations are consistent with 9 \nobservations at other comparable sites in Pang and Lambourn catchments (Mullinger 10 \net al., 2007). 11 \nA combination of radium abundance and radon emanation control the 12 \nconcentration of radon in groundwater. The enrichment of radium and greater rates of 13 \nemanation in the near-surface alluvial materials influence the spatial variation of 14 \nradon at these sites. High spatial variability in the hydraulic conductivities found at 15 \nthese sites mean that local controls will influence groundwater movement and radon 16 \nconcentrations in the riparian zone. 17 \nVariations in radon concentrations in near-surface groundwater at East Shefford 18 \ncan be affected by short time scale hydrological events, whereas those at Maidencourt 19 \nFarm can be influenced by seasonal variations in water table elevation. Perturbations 20 \nto groundwater radon concentrations following rainfall events are relatively short-21 \nlived and of the order of a few days at most in areas where the water table is very 22 \nclose to the surface. 23 \nObservations of groundwater radon concentrations over time and the distribution 24 \nof radium at the Lambourn borehole sites show that there are variable sources of 25 \n 25\nradon for groundwater that is discharged to the river. Seasonal changes in the water 1 \ntable can lead to a greater source of river water from near the surface of the alluvial 2 \naquifer, which is higher in radon. This may account for the observations of changing 3 \nradon inputs to the river in Mullinger et al. (2007) and is illustrated by the conceptual 4 \nmodel in Fig. 7c. 5 \nThese results show that there can be significant spatial and temporal variability in 6 \ngroundwater radon in the riparian zone. The riparian zone, due to the proximity of the 7 \nriver channel, has a potentially important influence on groundwater radon 8 \nconcentrations before discharge occurs to rivers. Therefore, it is essential that this part 9 \nof the groundwater system is studied in order to properly characterise the sources of 10 \nradon being discharged to rivers. 11 \n 12 \nAcknowledgements 13 \nThis work was funded by a UK NERC grant under the LOCAR programme (Ref: 14 \nNER\/T\/S\/2001\/00948) and a NERC CASE studentship in association with the Centre 15 \nfor Ecology and Hydrology (CEH), Wallingford (Ref: NER\/S\/A\/2004\/12162). CASE 16 \nsupervisor: Dr Andrew Young. We gratefully acknowledge the support of Dr Jim 17 \nGriffiths and enthusiastic assistance of Daniel Käser. Thanks are also given to three 18 \nanonymous reviewers for their helpful and constructive comments in relation to this 19 \nwork. 20 \n 26\nReferences 1 \nAllen, D.J., Brewerton, L.J., Coleby, L.M., Gibbs, B.R., Lewis, M.A., MacDonald, 2 \nA.M., Wagstaff, S.J. and Williams, A.T., 1997. The physical properties of 3 \nmajor aquifers in England and Wales, BGS Technical Report WD\/97\/34, 4 \nEnvironment Agency R&D Publication 8. 5 \nAndrews, J.N. and Wood, D.F., 1972. Mechanism of radon release in rock matrices 6 \nand entry into groundwaters. Transactions of the Institute of Mining and 7 \nMetallurgy, Section B, 81: 198-209.  8 \nASTM, 1998. D 5072 - Standard test method for radon in drinking water. ASTM 9 \nInternational. 10 \nBall, T.K., Cameron, D.G., Colman, T.B. and Roberts, P.D., 1991. Behaviour of 11 \nradon in the geological environment - a review. Quarterly Journal of 12 \nEngineering Geology, 24 (2): 169-182.  13 \nBarretto, P.M.C., Clark, R.B. and Adams, J.A.S., 1972. Physical characteristics of 14 \nradon-222 emanation from rocks, soil and minerals: its relation to temperature 15 \nand alpha dose. In: J.A.S. Adams, W.M. Lowder and T.F. Gesell (Editors), 16 \nThe Natural Radiation Environment II, Symposium Proceedings, Houston, 17 \nTexas, pp. 731-740. 18 \nBertin, C. and Bourg, A.C.M., 1994. Rn-222 and chloride as natural tracers of the 19 \ninfiltration of river water into an alluvial aquifer in which there is significant 20 \nriver groundwater mixing. Environmental Science & Technology, 28 (5): 794-21 \n798.  22 \nBonotto, D.M. and Andrews, J.N., 1993. The mechanism of 234U\/238U activity ratio 23 \nenhancement in karstic limestone groundwater. Chemical Geology, 103 (1-4): 24 \n193-206.  25 \n 27\nBonotto, D.M. and Andrews, J.N., 1997. The implications of laboratory Rn-222 flux 1 \nmeasurements to the radioactivity in groundwaters: the case of a karstic 2 \nlimestone aquifer. Applied Geochemistry, 12 (6): 715-726.  3 \nBradford, R.B., 2002. Controls on the discharge of Chalk streams of the Berkshire 4 \nDowns, UK. Science of the Total Environment, 282: 65-80.  5 \nBurnett, W.C., Aggarwal, P.K., Aureli, A., Bokuniewicz, H., Cable, J.E., Charette, 6 \nM.A., Kontar, E., Krupa, S., Kulkarni, K.M., Loveless, A., Moore, W.S., 7 \nOberdorfer, J.A., Oliveira, J., Ozyurt, N., Povinec, P., Privitera, A.M.G., 8 \nRajar, R., Ramassur, R.T., Scholten, J., Stieglitz, T., Taniguchi, M. and 9 \nTurner, J.V., 2006. Quantifying submarine groundwater discharge in the 10 \ncoastal zone via multiple methods. Science of the Total Environment, 367 (2-11 \n3): 498-543.  12 \nCook, P.G. and Böhlke, J.-K., 2000. Determining timescales for groundwater flow 13 \nand transport. In: P.G. Cook and A.L. Herczeg (Editors), Environmental 14 \nTracers in Subsurface Hydrology. Kluwer Academic Publishers, Boston, MA, 15 \npp. 1-30. 16 \nCook, P.G., Favreau, G., Dighton, J.C. and Tickell, S., 2003. Determining natural 17 \ngroundwater influx to a tropical river using radon, chlorofluorocarbons and 18 \nionic environmental tracers. Journal of Hydrology, 277: 74-88.  19 \nCook, P.G., Lamontagne, S., Berhane, D. and Clark, J.F., 2006. Quantifying 20 \ngroundwater discharge to Cockburn River, southeastern Australia, using 21 \ndissolved gas tracers Rn-222 and SF6. Water Resources Research, 42 (10): 22 \nW10411.  23 \nCurrie, L.A., 1968. Limits for qualitative detection and quantitative determination, 24 \napplication to radiochemistry. Analytical Chemistry, 40 (3): 589-593.  25 \n 28\nDowning, R.A., 1993. Groundwater resources, their development and management in 1 \nthe UK - an historical-perspective. Quarterly Journal of Engineering Geology, 2 \n26 (4): 335-358.  3 \nEllins, K.K., Romanmas, A. and Lee, R., 1990. Using Rn-222 to examine 4 \ngroundwater surface discharge interaction in the Rio-Grande-de-Manati, 5 \nPuerto-Rico. Journal of Hydrology, 115: 319-341.  6 \nGenereux, D.P. and Hemond, H.F., 1990. Naturally-occurring Rn-222 as a tracer for 7 \nstreamflow generation - steady-state methodology and field example. Water 8 \nResources Research, 26 (12): 3065-3075.  9 \nGenereux, D.P., Hemond, H.F. and Mulholland, P.J., 1993. Use of Rn-222 and 10 \ncalcium as tracers in a 3-end-member mixing model for streamflow generation 11 \non the West fork of Walker Branch watershed. Journal of Hydrology, 142: 12 \n167-211.  13 \nGrapes, T.R., Bradley, C. and Petts, G.E., 2005. Dynamics of river-aquifer 14 \ninteractions along a chalk stream: the River Lambourn, UK. Hydrological 15 \nProcesses, 19 (10): 2035-2053.  16 \nGrapes, T.R., Bradley, C. and Petts, G.E., 2006. Hydrodynamics of floodplain 17 \nwetlands in a Chalk catchment: the River Lambourn, UK. Journal of 18 \nHydrology, 320: 324-341.  19 \nGriffiths, J., Binley, A., Crook, N., Nutter, J., Young, A. and Fletcher, S., 2006. 20 \nStreamflow generation in the Pang and Lambourn catchments, Berkshire, UK. 21 \nJournal of Hydrology, 330 (1-2): 71.  22 \nHamada, H., 1999. Analysis of the interaction between surface water and groundwater 23 \nusing 222Rn. Japan Agricultural Research Quarterly, 33 (4): 261-265.  24 \n 29\nHoehn, E. and von Gunten, H.R., 1989. Radon in groundwater - a tool to assess 1 \ninfiltration from surface waters to aquifers. Water Resources Research, 25 (8): 2 \n1795-1803.  3 \nHoehn, E., von Gunten, H.R., Stauffer, F. and Dracos, T., 1992. Rn-222 as a 4 \ngroundwater tracer - a laboratory study. Environmental Science & 5 \nTechnology, 26 (4): 734-738.  6 \nIreson, A.M., Wheater, H.S., Butler, A.P., Mathias, S.A., Finch, J. and Cooper, J.D., 7 \n2006. Hydrological processes in the Chalk unsaturated zone - insights from an 8 \nintensive field monitoring programme. Journal of Hydrology, 330 (1-2): 29.  9 \nISO748:2000, 2000. Measurement of liquid flow in open channels - velocity area 10 \nmethods. International Organisation for Standardisation, BS EN ISO 11 \n748:2000. 12 \nLee, J.M. and Kim, G., 2006. A simple and rapid method for analyzing radon in 13 \ncoastal and ground waters using a radon-in-air monitor. Journal of 14 \nEnvironmental Radioactivity, 89 (3): 219-228.  15 \nLow, R., 1996. Radon as a natural groundwater tracer in the Chalk aquifer, UK. 16 \nEnvironment International, 22: S333-S338.  17 \nMacheleidt, W., Nestler, W. and Grischek, T., 2002. Determination of hydraulic 18 \nboundary conditions for the interaction between surface water and 19 \ngroundwater. Special Publication - Geology Society of London, 193: 235-243.  20 \nMisdaq, M.A. and Amghar, A., 2005. Radon and thoron emanation from various 21 \nmarble materials: impact on the workers. Radiation Measurements, 39 (4): 22 \n421-430.  23 \n 30\nMullinger, N.J., Binley, A.M., Pates, J.M. and Crook, N.P., 2007. Radon in Chalk 1 \nstreams: spatial and temporal variation of groundwater sources in the Pang and 2 \nLambourn catchments, UK. Journal of Hydrology, 339 (3-4): 172-182.  3 \nNeal, C., Jarvie, H.P., Wade, A.J., Neal, M., Wyatt, R., Wickham, H., Hill, L. and 4 \nHewitt, N., 2004. The water quality of the LOCAR Pang and Lambourn 5 \ncatchments. Hydrology and Earth System Sciences, 8 (4): 614-635.  6 \nOsmond, J.K. and Cowart, J.B., 1992. Ground water. In: M. Ivanovich and R.S. 7 \nHarmon (Editors), Uranium-Series Disequilibrium: Applications to Earth, 8 \nMarine and Environmental Sciences. Clarendon Press, Oxford, pp. 290-333. 9 \nOsmond, J.K. and Ivanovich, M., 1992. Uranium-series mobilisation and surface 10 \nhydrology. In: M. Ivanovich and R.S. Harmon (Editors), Uranium-Series 11 \nDisequilibrium: Applications to Earth, Marine and Environmental Sciences. 12 \nClarendon Press, Oxford, pp. 259-290. 13 \nPates, J.M. and Mullinger, N.J., 2007. Determination of 222Rn in fresh water: 14 \ndevelopment of a robust method of analysis by alpha\/beta separation liquid 15 \nscintillation spectrometry. Applied Radiation and Isotopes (65): 92-103.  16 \nPorcelli, D. and Swarzenski, P.W., 2003. The behaviour of U- and Th-series nuclides 17 \nin groundwater. Reviews in Mineralogy and Geochemistry, 52: 317-361.  18 \nPrzylibski, T.A., 2000. Estimating the radon emanation coefficient from crystalline 19 \nrocks into groundwater. Applied Radiation and Isotopes, 53 (3): 473-479.  20 \nRama, 1991. Emanation of radon from rock minerals. Current Science, 61 (11): 751-21 \n755.  22 \nRamsbottom, D.M., Hollinrake, P.G. and Smailes, E.L., 1997. Current meter gauging 23 \nmethods. Environment Agency of England and Wales, R&D Technical Report 24 \nW4. 25 \n 31\nSchubert, M., Knoeller, K., Treutler, H.C., Weiss, H. and Dehnert, J., 2004. 222Rn as a 1 \ntracer for the estimation of surface waters into aquifers, International 2 \nConference on Isotopes in Environmental Studies. Elsevier, Monte Carlo, pp. 3 \n326-334. 4 \nSear, D.A., Armitage, P.D. and Dawson, F.H., 1999. Groundwater dominated rivers. 5 \nHydrological Processes, 13 (3): 255-276.  6 \nSwarzenski, P.W., Reich, C., Kroeger, K.D. and Baskaran, M., 2007. Ra and Rn 7 \nisotopes as natural tracers of submarine groundwater discharge in Tampa Bay, 8 \nFlorida. Marine Chemistry, 104 (1-2): 69-84.  9 \nYounger, P.L. and Elliot, T., 1995. Chalk fracture system characteristics - 10 \nimplications for flow and solute transport. Quarterly Journal of Engineering 11 \nGeology, 28: S39-S50.  12 \n 13 \n 14 \n 32\nFigure captions 1 \n 2 \nFig. 1  Location of the Lambourn catchment. Cross-sections locations (Fig. 2) and 3 \nlocal topography are indicated. Insets show layout of borehole sampling sites. 4 \n 5 \nFig. 2  Cross sections of (a) Maidencourt Farm and (b) East Shefford borehole sites, 6 \nshowing ground level, relative distance of boreholes from river, piezometer depths 7 \nand water table minima and maxima during the sampling period. Insets show the full 8 \nlength of cross sections in Fig. 1 and indicate the extent of the enlarged sections.  9 \n 10 \nFig. 3  (a) Water table in riparian boreholes in MCT3-1 and ESF3-1 (the gap in data 11 \nfrom ESF3 is due to logger failure). (b) River flow at East Shefford and Maidencourt 12 \nFarm. Shaded area indicates period of no flow at Maidencourt Farm. 13 \n 14 \nFig. 4  Temporal variability of groundwater radon in the most variable boreholes 15 \n(error bars show standard deviation of triplicate samples). Shaded area indicates 16 \nperiod of no flow at Maidencourt Farm. 17 \n 18 \nFig. 5  (a) Radium concentration of borehole core material (errors derived from 19 \ncounting statistics and errors in sample size). (b) Emanation coefficients from 20 \nborehole core material (error bars show standard deviation of triplicate samples). (c) 21 \nEstimated groundwater radon concentrations as calculated by equation (3) (errors 22 \ncalculated from propagation of errors in emanation, porosity and density 23 \nmeasurements). (d) Observed mean groundwater radon concentrations in piezometers 24 \nabove 6 m bgl and trendline (equation (5)) fitted by linear regression (error bars show 25 \nstandard deviation of all observations from each piezometer). Hollow symbols in (a-c) 26 \nrepresent samples associated with piezometer screened sections. Hollow symbols in 27 \n(d) represent piezometer screened sections from which core material was analysed for 28 \nradium and radon emanation. 29 \n 30 \nFig. 6  Borehole responses to rainfall events in October and November 2006. (a) & (d) 31 \nHourly precipitation. (b) & (e) ESF3-1 water table. (c) & (f) Groundwater radon 32 \nconcentrations (ASTM method, errors based on counting statistics and errors in 33 \nsample size). 34 \n 35 \nFig. 7  (a) Estimated discharge groundwater radon concentration for a given water 36 \ntable depth assuming equal contributions from each depth, calculated using equation 37 \n(5) with examples of contributions assuming different aquifer depths. (b) Estimated 38 \nimpact of water table fluctuation on groundwater radon concentration, calculated by 39 \nthe integration of radon over the saturated depth of aquifer down to 5 m bgl using 40 \nequation (5).  (c) Conceptual model of variations in radon input to streams from an 41 \nalluvial aquifer. A rise in the water table leads to groundwater occupying the zone of 42 \nhigher radon production in the near-surface of the riparian zone. This provides a 43 \ngreater source of high radon water feeding the river, resulting in seasonal changes in 44 \nthe input of radon to rivers.  45 \n 46 \n 33\nTables 1 \n 2 \nTable 1  Parameters observed for Maidencourt Farm boreholes. All boreholes are 3 \nscreened for 0.8 m, with the pump depth located at the centre of screened section. 4 \nErrors in porosity and density estimates are calculated by the propagation of errors in 5 \nthe measurement of sample size and mass. Hydraulic conductivity results are mean 6 \nand standard deviation of repeat measurements.  7 \n222Rn (Bq l-1) \nPiezometer Pump depth (m bgl) Mean Min Max \nPorosity \n(%) \nDensity \n(g cm-3) \nHydraulic \nconductivity \n(m d-1) \nMCT1-2 5.6 1.7 1.5 1.8 45 ± 2 1.7 ± 0.1 7.7 ± 0.5 \nMCT1-1 9.6 1.3 1.1 1.4 47 ± 2 1.6 ± 0.1 32.3 ± 2.6 \nMCT2-2 1.6 Not sampled 34 ± 2 1.8 ± 0.1 9.9 ± 0.6 \nMCT2-1 4.6 1.4 1.2 1.5 45 ± 2 1.5 ± 0.1 49.0 ± 3.3 \nMCT3-2 3.0 6.1 4.7 7.2 No sample 83.2 ± 20.2 \nMCT3-1 5.6 1.2 1.0 1.4 43 ± 2 1.6 ± 0.1 12.6 ± 1.4 \nMCT4-2 2.4 Not sampled 29 ± 2 2.0 ± 0.1 0.4 ± 0.1 \nMCT4-1 4.6 1.8 1.5 2.1 43 ± 2 1.6 ± 0.1 46.3 ± 3.8 \nMCT5-2 3.5 1.5 1.2 1.8 42 ± 2 1.6 ± 0.1 5.5 ± 2.1 \nMCT5-1 6.4 1.1 0.9 1.3 29 ± 2 1.9 ± 0.1 68.0 ± 4.0 \n 8 \nTable 2  Parameters observed for East Shefford boreholes. All boreholes are screened 9 \nfor 0.8 m, with the pump depth located at the centre of screened section. Errors in 10 \nporosity and density estimates are calculated by the propagation of errors in the 11 \nmeasurement of sample size and mass. Hydraulic conductivity results are mean and 12 \nstandard deviation of repeat measurements. 13 \n222Rn (Bq l-1) \nPiezometer Pump depth (m bgl) Mean Min Max \nPorosity \n(%) \nDensity \n(g cm-3) \nHydraulic \nconductivity \n(m d-1) \nESF1-2 9.6 1.6 1.4 2.1 45 ± 2 1.6 ± 0.1 No measurement\nESF1-1 12.5 1.2 1.1 1.2 43 ± 2 1.6 ± 0.1 No measurement\nESF2-2 2.6 3.1 2.3 3.6 No sample 156.2 ± 46.5 \nESF2-1 5.5 1.1 0.9 1.2 42 ± 2 1.6 ± 0.1 No measurement\nESF3-2 2.1 10.6 9.1 11.7 26 ± 2 1.8 ± 0.1 16.8 ± 1.9 \nESF3-1 4.6 2.2 1.7 2.4 44 ± 2 1.6 ± 0.1 13.2 ± 6.2 \nESF4-2 1.6 11.0 8.5 14.2 24 ± 2 2.2 ± 0.1 15.4 ± 0.4 \nESF4-1 3.9 3.3 2.6 4.6 43 ± 2 1.6 ± 0.1 5.3 ± 0.8 \nESF5-2 2.6 11.1 9.2 11.8 No sample 1.5 ± 0.4 \nESF5-1 4.5 1.5 1.2 1.9 39 ± 2 1.7 ± 0.1 32.1 ± 3.6 \n 14 \n 34\nTable 3  Results of borehole core radium and emanation measurements. * indicates 1 \nsamples which are located within 0.8 m deep piezometer screened sections. 2 \n 3 \nBorehole \nDepth \n(m) \nRa activity \n(Bq kg-1) \nRn \nemanation \n(Bq kg-1) \nEmanation \ncoefficient \nESF3 1.0 13.4 ± 0.5 2.8 ± 0.2 0.21 ± 0.02 \nESF3 2.3 7.9 ± 0.4 1.2 ± 0.2 0.15 ± 0.02 \nESF3 3.1 12.0 ± 0.6 1.2 ± 0.2 0.10 ± 0.01 \nESF3 4.4* 4.9 ± 0.5 0.4 ± 0.2 0.08 ± 0.01 \nESF3 5.0 5.8 ± 0.3 0.4 ± 0.2 0.06 ± 0.01 \nESF5 1.1 13.1 ± 0.5 3.0 ± 0.2 0.23 ± 0.02 \nESF5 2.4* 13.0 ± 0.5 1.6 ± 0.1 0.13 ± 0.01 \nESF5 3.0 10.4 ± 0.5 1.2 ± 0.1 0.12 ± 0.01 \nESF5 4.3* 6.4 ± 0.5 0.3 ± 0.1 0.05 ± 0.02 \nESF5 4.8 7.5 ± 0.4 0.5 ± 0.1 0.07 ± 0.01 \nMCT2 1.2* 39.4 ± 1.3 14.5 ± 1.2 0.37 ± 0.03 \nMCT2 2.1 14.1 ± 0.7 3.3 ± 0.1 0.23 ± 0.01 \nMCT2 2.8 6.1 ± 0.4 0.6 ± 0.1 0.10 ± 0.02 \nMCT2 4.2 4.9 ± 0.5 0.4 ± 0.1 0.07 ± 0.01 \nMCT2 4.9* 4.4 ± 0.4 0.6 ± 0.1 0.14 ± 0.01 \nMCT5 1.1 8.4 ± 0.3 1.0 ± 0.1 0.12 ± 0.01 \nMCT5 1.9 10.8 ± 0.6 1.3 ± 0.1 0.12 ± 0.01 \nMCT5 3.2* 11.2 ± 0.4 1.2 ± 0.1 0.11 ± 0.01 \nMCT5 4.0 6.4 ± 0.4 1.0 ± 0.1 0.16 ± 0.02 \nMCT5 5.4 7.4 ± 0.5 0.4 ± 0.1 0.05 ± 0.01 \n 4 \n 35\nFi\ng.\n 1\n  L\noc\nat\nio\nn \nof\n th\ne \nLa\nm\nbo\nur\nn \nca\ntc\nhm\nen\nt. \nC\nro\nss\n-s\nec\ntio\nns\n lo\nca\ntio\nns\n (F\nig\n. 2\n) a\nnd\n lo\nca\nl t\nop\nog\nra\nph\ny \nar\ne \nin\ndi\nca\nte\nd.\n In\nse\nts\n s\nho\nw\n la\nyo\nut\n o\nf b\nor\neh\nol\ne \nsa\nm\npl\nin\ng \nsi\nte\ns.\n \n1 \n 2 \n 36\n 1 \nFi\ng.\n 2\n  C\nro\nss\n s\nec\ntio\nns\n o\nf (\na)\n M\nai\nde\nnc\nou\nrt \nFa\nrm\n a\nnd\n (b\n) E\nas\nt S\nhe\nffo\nrd\n b\nor\neh\nol\ne \nsi\nte\ns,\n s\nho\nw\nin\ng \ngr\nou\nnd\n le\nve\nl, \nre\nla\ntiv\ne \ndi\nst\nan\nce\n o\nf b\nor\neh\nol\nes\n fr\nom\n ri\nve\nr, \npi\nez\nom\net\ner\n d\nep\nth\ns \nan\nd \nw\nat\ner\n ta\nbl\ne \nm\nin\nim\na \nan\nd \nm\nax\nim\na \ndu\nrin\ng \nth\ne \nsa\nm\npl\nin\ng \npe\nrio\nd.\n In\nse\nts\n s\nho\nw\n th\ne \nfu\nll \nle\nng\nth\n o\nf c\nro\nss\n s\nec\ntio\nns\n in\n F\nig\n. 1\n a\nnd\n in\ndi\nca\nte\n th\ne \nex\nte\nnt\n o\nf t\nhe\n e\nnl\nar\nge\nd \nse\nct\nio\nns\n. \nElevation (m AOD)\n10\n0\n10\n5\n11\n0\n11\n5\n12\n0 5\n50\n57\n5\n60\n0\n62\n5\n65\n0\n67\n5\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nPi\nez\nom\net\ner\n 1\nPi\nez\nom\net\ner\n 2\n(a\n)\nM\nC\nT1\nM\nC\nT4\nM\nC\nT2\nM\nC\nT3\nM\nC\nT5\nD\nis\nta\nnc\ne \n(m\n fr\nom\n N\nE \nto\n S\nW\n)\n9510\n0\n10\n5\n11\n0\n11\n5 5\n50\n60\n0\n65\n0\n70\n0\n75\n0\n80\n0\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\n(b\n) ES\nF1\nES\nF4\nES\nF5\nES\nF3\nES\nF2\n10\n0\n10\n5\n11\n0\n11\n5\n12\n0 5\n50\n57\n5\n60\n0\n62\n5\n65\n0\n67\n5\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nPi\nez\nom\net\ner\n 1\nPi\nez\nom\net\ner\n 2\n(a\n)\nM\nC\nT1\nM\nC\nT4\nM\nC\nT2\nM\nC\nT3\nM\nC\nT5\n10\n0\n10\n5\n11\n0\n11\n5\n12\n0 5\n50\n57\n5\n60\n0\n62\n5\n65\n0\n67\n5\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nPi\nez\nom\net\ner\n 1\nPi\nez\nom\net\ner\n 2\n(a\n)\n10\n0\n10\n5\n11\n0\n11\n5\n12\n0 5\n50\n57\n5\n60\n0\n62\n5\n65\n0\n67\n5\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nBo\nre\nho\nle\n a\nnd\n p\nie\nzo\nm\net\ner\n s\ncr\nee\nne\nd \nse\nct\nio\nn\nG\nro\nun\nd \nle\nve\nl\nW\nat\ner\n ta\nbl\ne \nm\nax\nim\num\nW\nat\ner\n ta\nbl\ne \nm\nin\nim\num\nPi\nez\nom\net\ner\n 1\nPi\nez\nom\net\ner\n 2\n(a\n)\nM\nC\nT1\nM\nC\nT4\nM\nC\nT2\nM\nC\nT3\nM\nC\nT5\nD\nis\nta\nnc\ne \n(m\n fr\nom\n N\nE \nto\n S\nW\n)\n9510\n0\n10\n5\n11\n0\n11\n5 5\n50\n60\n0\n65\n0\n70\n0\n75\n0\n80\n0\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\n(b\n) ES\nF1\nES\nF4\nES\nF5\nES\nF3\nES\nF2\n10\n0\n12\n0\n14\n0\n16\n0\n0\n50\n0\n10\n00\n15\n00\n(b\n) ES\nF1\nES\nF4\nES\nF5\nES\nF3\nES\nF2\n 2 \n 3 \n 37\n 1 \n01-Jan-05 01-Jul-05 01-Jan-06 01-Jul-06\n0\n0.2\n0.4\n0.6\n1.2\n0.8\n0.4\n0at\ner \nle\nv\nel \n(\n(a\n(blo\nw \n(\nm\n3\nDate \n \nESF flow\nMCT flow\n \nESF3\nMCT3\nFig. 3  (a) Water table in riparian boreholes in MCT3-1 and ESF3-1 \n(the gap in data from ESF3 is due to logger failure). (b) River flow at \nEast Shefford and Maidencourt Farm. Shaded area indicates period of \nno flow at Maidencourt Farm. \n 38\n 1 \n0\n5\n10\n0\n5\n10\n15\n0\n5\n10\n15\n01-Jan-05 01-Jul-05 01-Jan-06 01-Jul-06\n0\n5\n10\n15\nDate \n2\n22\nR\nn \n(a) MCT3 \n(b) ESF3 \n(c) ESF4 \n(d) ESF5 \n \nPiezometer 2 (shallow)\nPiezometer 1 (deep)\nFig. 4  Temporal variability of groundwater radon in the most variable \nboreholes (error bars show standard deviation of triplicate samples). \nShaded area indicates period of no flow at Maidencourt Farm. \n 39\n 40 1 \nFig. 5  (a) Radium concentration of borehole core material (errors derived from \ncounting statistics and errors in sample size). (b) Emanation coefficients from borehole \ncore material (error bars show standard deviation of triplicate samples). (c) Estimated \ngroundwater radon concentrations as calculated by equation (3) (errors calculated \nfrom propagation of errors in emanation, porosity and density measurements). (d) \nObserved mean groundwater radon concentrations in piezometers above 6 m bgl and \ntrendline (equation (5)) fitted by linear regression (error bars show standard deviation \nof all observations from each piezometer). Hollow symbols in (a-c) represent samples \nassociated with piezometer screened sections. Hollow symbols in (d) represent \npiezometer screened sections from which core material was analysed for radium and \nradon emanation.  \n0 5 10 150 5 10 15 60 80\n6\n5\n4\n3\n2\n1\n0\n0.0 0.1 0.2 0.3 0.40 5 10 15 30 40\n6\n5\n4\n3\n2\n1\n0\n \nMCT2\nMCT5\nESF3\nESF5\nD\nep\nth \n(m \n226Ra (Bq kg-1) Emanation \nEstimated 222Rn Observed 222Rn \n(\n(\n(\n(\n(a\n \nMCT\nESF\n 41\n 42\n 1 \nFi\ng.\n 6\n  B\nor\neh\nol\ne \nre\nsp\non\nse\ns \nto\n ra\nin\nfa\nll \nev\nen\nts\n in\n O\nct\nob\ner\n a\nnd\n N\nov\nem\nbe\nr 2\n00\n6.\n (a\n) &\n (d\n) H\nou\nrly\n \npr\nec\nip\nita\ntio\nn.\n (b\n) &\n (e\n) E\nS\nF3\n-1\n w\nat\ner\n ta\nbl\ne.\n (c\n) &\n (f\n) G\nro\nun\ndw\nat\ner\n ra\ndo\nn \nco\nnc\nen\ntra\ntio\nns\n (A\nS\nTM\n \nm\net\nho\nd,\n e\nrr\nor\ns \nba\nse\nd \non\n c\nou\nnt\nin\ng \nst\nat\nis\ntic\ns \nan\nd \ner\nro\nrs\n in\n s\nam\npl\ne\nsi\nze\n).\n26\n-N\nov\n-0\n6 \n0:\n00\n27\n-N\nov\n-0\n6 \n0:\n00\n28\n-N\nov\n-0\n6 \n0:\n00\n29\n-N\nov\n-0\n6 \n0:\n00\n30\n-N\nov\n-0\n6 \n0:\n00\n0123489101112\n0.\n70\n0.\n65\n0.\n60\n0.\n5586420\n4-\n2 \n(1\n.6\n m\n b\ngl\n)\n3-\n2 \n(2\n.1\n m\n b\ngl\n)\n4-\n1 \n(3\n.9\n m\n b\ngl\n)\n3-\n1 \n(4\n.6\n m\n b\ngl\n)\n09\n-O\nct\n-0\n6 \n0:\n00 1\n0-\nO\nct\n-0\n6 \n0:\n00 1\n1-\nO\nct\n-0\n6 \n0:\n00 1\n2-\nO\nct\n-0\n6 \n0:\n00 1\n3-\nO\nct\n-0\n6 \n0:\n00 1\n4-\nO\nct\n-0\n6 \n0:\n00\n0123489101112\n0.\n80\n0.\n75\n0.\n70\n0.\n6586420\nTi\nm\ne\n222\nRn (Bq l\n-1\n)\nHourly \nPrecipitation \n(mm)\nESF3-1 water \ntable (m bgl)\n(a\n)\n(b\n)\n(c\n)\n(d\n)\n(e\n) (f)\nIn\nte\nrp\nre\nte\nd \nre\nsp\non\nse\ns\n0123489101112\n0.\n70\n0.\n65\n0.\n60\n0.\n5586420\n4-\n2 \n(1\n.6\n m\n b\ngl\n)\n3-\n2 \n(2\n.1\n m\n b\ngl\n)\n4-\n1 \n(3\n.9\n m\n b\ngl\n)\n3-\n1 \n(4\n.6\n m\n b\ngl\n)\n0123489101112\n0.\n80\n0.\n75\n0.\n70\n0.\n6586420\nTi\nm\ne\n(a\n)\n(b\n)\n(c\n)\n(d\n)\n(e\n) (f)\nIn\nte\nrp\nre\nte\nd \nre\nsp\non\nse\ns\n 2 \n 43\n 1 \nFig. 7  (a) Estimated discharge groundwater radon concentration for a given water table depth \nassuming equal contributions from each depth, calculated using equation (5) with examples of \ncontributions assuming different aquifer depths. (b) Estimated impact of water table fluctuation on \ngroundwater radon concentration, calculated by the integration of radon over the saturated depth of \naquifer down to 5 m bgl using equation (5).  (c) Conceptual model of variations in radon input to \nstreams from an alluvial aquifer. A rise in the water table leads to groundwater occupying the zone \nof higher radon production in the near-surface of the riparian zone. This provides a greater source \nof high radon water feeding the river, resulting in seasonal changes in the input of radon to rivers. \n01-Jan-05 01-Jul-05 01-Jan-06 01-Jul-06\n3\n4\n5\n6\n0 2 4 6 8 10\n0\n2\n4\n6\n8\nAlluvium and gravels\nWeathered Chalk\nMovement of \nwater table\n222Rn Activity\nD\nep\nth\nWater table depth (m bgl)\nE\nst\nim\nat\ned\n d\nis\nch\nar\nge\n \n22\n2 R\nn \n(B\nq \nl-1\n) (a)\n(c)\n \nESF3\nMCT3\n22\n2 R\nn \n(B\nq \nl-1\n)\nDate\n(b)\n \n3 m\n5 m\n10 m\nAquifer depth\nD\nep\nth\nD\nep\nth\nE\nst\nim\nat\ned\n d\nis\nch\nar\nge\n \n22\n2 R\nn \n(B\nq \nl-1\n)\n22\n2 R\nn \n(B\nq \nl-1\n)\n"}