{"doi":"10.1002\/adem.200600028","coreId":"140497","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2450","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2450","10.1002\/adem.200600028"],"title":"A New Reactive Atom Plasma Technology (RAPT) for Precision Machining: the\nEtching of ULE® Surface","authors":["Fanara, C.","Shore, Paul","Nicholls, J. R.","Lyford, N.","Kelley, J.","Carr, J.","Sommer, P."],"enrichments":{"references":[{"id":37941530,"title":"in Plasma etching, an introduction (Eds: O.","authors":[],"date":"1989","doi":"10.1016\/b978-0-08-092446-5.50005-6","raw":"Manos, D.M., Flamm, D.L., in Plasma etching, an introduction (Eds: O. Auciello, Flamm, D.L.), Academic Press, Boston, 1989.","cites":null},{"id":37941531,"title":"Material safety sheet.","authors":[],"date":"2005","doi":null,"raw":"http:\/\/www.newportglass.com\/amscergl.htm, Material safety sheet. 2005, Newport Glass.","cites":null},{"id":37941532,"title":"Precision Science and Technology for Perfect Surfaces, Tokyo: The Japanese Society for Precision Engineering,","authors":[],"date":"1999","doi":null,"raw":"Schindler, A., T. Haensel, D. Flamm, A. Nickel, H. J. Thomas, F. Bigl. Precision Science and Technology for Perfect Surfaces, Tokyo: The Japanese Society for Precision Engineering,  1999.","cites":null},{"id":37941529,"title":"RAPT Industries Inc.,","authors":[],"date":"2002","doi":null,"raw":"Carr, J., RAPT Industries Inc., Patent PCT\/US02\/02507 International Publication number WO 02\/060828. 2002.","cites":null},{"id":37941533,"title":"Seibersdorf, Microstructure evolution of after ion beam bombardment. 2000, Centre Spatial de Liege - Universite de Liege.","authors":[],"date":null,"doi":null,"raw":"Gailly, P., AMTT Program, Seibersdorf, Microstructure evolution of after ion beam bombardment. 2000, Centre Spatial de Liege - Universite de Liege. p. 1-14.","cites":null},{"id":37941528,"title":"Ultra Precision Surfaces - a New Paradigm, Basic Technology -Case for Support,","authors":[],"date":"2003","doi":null,"raw":"Walker, D., Shore P., Ultra Precision Surfaces - a New Paradigm, Basic Technology -Case for Support, 2003.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-01T00:00:00Z","abstract":"Results on reactive atom plasma etching performed on ULE® (Corning Ultra Low\nExpansion) glass samples at atmospheric pressure are presented for the first\ntime. A reactive atomic plasma technology (RAPT®), has been developed by RAPT\nIndustries and employed for the finishing of optical surfaces. An atmospheric\npressure argon inductively coupled plasma (ICP) excites a reactive gas injected\nthrough its centre. The plume of hot neutral excited species reacts at the\nsubstrate yielding controlled and repeatable trenches. In the case of ULE a\nmaterial removal (up to 0.55 mm3\/s) is obtained without pre-heating the samples.\nAmong the factors influencing the results, an increase in gas concentration at\nthe same power does not change the sample temperature, indicating that thermo-\nchemical effects do not influence the removal rates. Due to the plasma\nconstructive constrains, increasing the gas concentration is more practical and\nof wider effect than increasing the power. The benefits of the process are\nillustrated and the extension of the technology to large optical surfaces\ndiscuss","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140497.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1002\/adem.200600028","pdfHashValue":"c7834ecbe933b5c6d131b3378455971f1a1a17e9","publisher":"John Wiley & Sons, Ltd","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2450<\/identifier><datestamp>2012-02-15T12:00:32Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A New Reactive Atom Plasma Technology (RAPT) for Precision Machining: the\nEtching of ULE® Surface<\/dc:title><dc:creator>Fanara, C.<\/dc:creator><dc:creator>Shore, Paul<\/dc:creator><dc:creator>Nicholls, J. R.<\/dc:creator><dc:creator>Lyford, N.<\/dc:creator><dc:creator>Kelley, J.<\/dc:creator><dc:creator>Carr, J.<\/dc:creator><dc:creator>Sommer, P.<\/dc:creator><dc:subject>Machining<\/dc:subject><dc:subject>Plasma technology<\/dc:subject><dc:subject>Surface engineering<\/dc:subject><dc:description>Results on reactive atom plasma etching performed on ULE® (Corning Ultra Low\nExpansion) glass samples at atmospheric pressure are presented for the first\ntime. A reactive atomic plasma technology (RAPT®), has been developed by RAPT\nIndustries and employed for the finishing of optical surfaces. An atmospheric\npressure argon inductively coupled plasma (ICP) excites a reactive gas injected\nthrough its centre. The plume of hot neutral excited species reacts at the\nsubstrate yielding controlled and repeatable trenches. In the case of ULE a\nmaterial removal (up to 0.55 mm3\/s) is obtained without pre-heating the samples.\nAmong the factors influencing the results, an increase in gas concentration at\nthe same power does not change the sample temperature, indicating that thermo-\nchemical effects do not influence the removal rates. Due to the plasma\nconstructive constrains, increasing the gas concentration is more practical and\nof wider effect than increasing the power. The benefits of the process are\nillustrated and the extension of the technology to large optical surfaces\ndiscusse<\/dc:description><dc:publisher>John Wiley & Sons, Ltd<\/dc:publisher><dc:date>2011-09-08T10:10:31Z<\/dc:date><dc:date>2011-09-08T10:10:31Z<\/dc:date><dc:date>2006-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>C. Fanara, P. Shore, J.R. Nicholls , N. Lyford , J. Kelley , J. Carr , P. Sommer; A New Reactive Atom Plasma Technology (RAPT) for Precision Machining: the Etching of ULE® Surfaces, Advanced Engineering Materials, 2006, Volume 8, Issue 10 , Pages 933-939<\/dc:identifier><dc:identifier>1438-1656<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1002\/adem.200600028<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2450<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1438-1656","1438-1656"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Machining","Plasma technology","Surface engineering"],"subject":["Article"],"fullText":"A new Reactive Atom Plasma Technology (RAPT) for \nprecision machining: the etching of ULE surfaces \n \nDr Carlo Fanara1,2,  Prof. Paul Shore2, Prof. John R Nicholls1, Mr. Nicholas Lyford3,   \nDr Jude Kelley3, Dr Jeff Carr3and Mr. Phil Sommer3 \n \n1National High Temperature Surface Engineering Centre, Building 57, Cranfield \nUniversity, MK430AL Cranfield, United Kingdom, c.fanara@cranfield.ac.uk \n2Manufacturing Systems Department, Cranfield University, MK43 0AL Cranfield, \nBedfordshire, United Kingdom \n3RAPT Industries, 6252 Preston Avenue, Livermore, CA 94551-0234, United States of \nAmerica \n \nAbstract   \n \nResults on reactive atom plasma etching performed on ULE® (Corning Ultra Low Expansion) \nglass samples at atmospheric pressure are presented for the first time. A reactive atomic plasma \ntechnology (RAPT®), has been developed by RAPT Industries and employed for the finishing of \noptical surfaces. An atmospheric pressure argon inductively coupled plasma (ICP) excites a \nreactive gas injected through its centre. The plume of hot neutral excited species reacts at the \nsubstrate yielding controlled and repeatable trenches. In the case of ULE a material removal (up \nto 0.55 mm3\/s) is obtained without pre-heating the samples. Among the factors influencing the \nresults, an increase in gas concentration at the same power does not change the sample \ntemperature, indicating that thermo-chemical effects do not influence the removal rates. Due to \nthe plasma constructive constrains, increasing the gas concentration is more practical and of \nwider effect than increasing the power. The benefits of the process are illustrated and the \nextension of the technology to large optical surfaces discussed. \n \nPACS: 52.77.Bn, 52.80.Pi, 42.70, 78.68, 81.20  \n \n1. Introduction \nAs part of the Basic Technology programme run jointly by UCL and Cranfield University [1], a \nreactive atomic plasma technology (RAPT®), which emerged from the US National Ignition \nFacility project at the Lawrence Livermore National Laboratory, has been developed by RAPT \nInc (US). This new technology was patented in 2002  and employed for the finishing of surfaces \nof various materials of optical interest[2]. \nIn agreement with existing work  atom etching at atmospheric pressure using fluorine rich gases \nmay achieve substantial removal rates provided the removed materials is released in volatile \nfluorinated form[3]. In the course of the last decades, several studies on plasma etching have been \nperformed but in these works the requirement of small size patterns indicated needs for lower \noperating pressure[3-5]. For example, from one would conclude that as NF3 present undercuts in \nargon mixture this specie would not be suitable for the etching of Si based compounds (table 2 in \n[3]). However, etching is considered only at low pressure, well below 1 Torr. The chemistry of \nNF3 etching at atmospheric pressure appears quite undeveloped. Moreover, from table 2 in the \n 2 \nsame work ([3]) it would appear that the chemical etching due to the fluorine species is isotropic \nwhereas we will show that the results on material removal obtained in this work clearly contradict \nthis hypothesis. The reaction path of the fluorine may be quite distinct not only because of the \npressure but also because of the originating mixture (NF3) and of the surface temperature which is \none of the major variables at play [3]. For example in the case of SiO2 there is experimental \nevidence of loss of selectivity of Si versus SiO2 induced by surface heating [3].  \nA large process parameter window is accessible to ULE optics  which is advantageous for large \nand curved optics[6]. Moreover, high etch selectivity may be required when etching coatings \nrelative to the substrate optics, which may be difficult in multiphase and multi-component \nmaterial like Zerodur (SiO2, 35 to 75%; Al2O3 ~20 to 50%, Ti, Zr, Li, Mg, P oxides[7]), which \ncould lead to surface roughening [8]. With respect to the roughness increase upon material \nremoval (coating) indications on small increase are reported, when the method used was RIE on \nmulti-layered systems[8]. So far however, we were not able to find published work on ICP \nchemical etching at atmospheric pressure on none of the typical materials of interest in optics, nor \nspecifically on ULE. \nOther processes may be employed for the manufacturing and figuring of optical surfaces for large \nmirrors, Ion Beam Figuring (IBF, also known as Ion-beam polishing or ion-etching [9]) is the most \npromising in terms of speed of process and quality of the finishes. With IBF one may achieve \ntypical ion beam sputter removal of 0.1–20 µm3\/s using commercial FIB systems, depending on \nthe material to be figured ([11][10] and references [27–29] therein,). For comparison, mechanical \nprocesses, like the polishing on the Zeeko IRP200 machine, may reach volumetric removal rates \nof 0.105 mm3\/minute [12]. The only other known plasma process at atmospheric pressure is owned \nby Nikon Corporation and even if the substrate composition is not indicated, volumetric removal \nrates of up to 0.019 mm3\/s are reported (~70 mm3\/hour[13]). Even if possible roughness increase \nof the bombarded material can be avoided [14], FIB requires large and expensive high vacuum \nchambers and high grade clean rooms. \nIn the RAPT® process the use of argon shielding makes the latter unnecessary. An atmospheric \npressure argon inductively coupled plasma (ICP) excites a reactive gas which is injected through \nits centre (see figure 1).  \nThe argon plasma acts as a thermal reservoir and excites the admitted species. These are \nconveyed by the plasma flow to the substrate where they react, yielding controlled and repeatable \ntrenches which show pseudo-gaussian profiles. Naturally, the choice of the active species and its \nconcentration depends on the material to be treated and on the desired removal rate. Under these \nconditions the mean free path for ions in argon are at the micrometer scale and in the system \ndescribed in this work, indications exist that charged particle densities are negligible a few mm \noutwards the plasma nozzle [2] so that among the mechanisms indicated in literature, the purely \nchemical mode dominates [3, 4]. \n \n 3 \n \n \nFigure 1 Principles of the RAPT process (see text). Right hand side: typical sample square \ngeometry with the arrows indicating the torch pass direction. Scale of the depicted pseudo-\ngaussian trench: the horizontal (trough FWHM) of the order of 20 millimeters; depth, from few \ntens of nanometers up to a few microns. The distances from the sample centre are also indicated.   \n \n \nThe initial choice of the reactive precursor has been CF4 (carbon tetra-fluoride). However, the \nlower energetic cost associated with the generation of F2 from NF3\n \n(283 kJ\/mol) looks more \nfavorable with respect to CF4\n \n(485 kJ\/mol). Therefore, higher etch rates on Si, SiO2, SiC and ULE \nare possible. Furthermore, the lower enthalpy of dissociation of NF3 implies a more efficient \nfluorine production per unit power ([F]\/W) making it possible to operate the process at reduced \nplasma power. The more complete NF3 breakdown generates byproducts that are readily \nscrubbed, lowering fluorinated emissions into the environment.  \nFor large optics (1 to 2 m2), it is difficult to set up and operate a pre-heating system capable to \nmaintain a uniform temperature field over the entire sample surface. In the frame of the ongoing \nproject [1], several materials are considered: SiC in various forms, Zerodur, and ULE and it is \nimportant to ascertain whether sample pre-heating can be avoided and under which \ncircumstances. \nThis paper describes the first results obtained using NF3 on ULE. In view of the application of the \nprocess to the manufacturing of large optical surfaces, several important questions need \nconsideration. This paper addresses the initial issues of etching ULE samples by keeping a good \nprofile over extended distances (1 m) matching and possibly exceeding the process speed of \ncompeting technologies without pre-heating the substrates. Other factors considered are the \ninfluence of process parameters (the active specie fraction and the plasma power) on the material \nremoval rate; the correlations between adjacent trenches upon subsequent plasma torch passes; \n 4 \nthe material removal rate upon multiple passes at the same location (e.g. trenches ‘one on top of \nthe other’). Additionally, some indications are given about the combined effects of gas specie \nconcentration and input power on the sample surface temperature.  \nSeveral other questions are relevant for the fine tuning of the process: for example it is important \nto establish how to adapt to edge effects and enable the treatment of materials different than ULE \nat competitive removal rates. Also, the effects of the process on sub-surface damage originated by \nprevious mechanical treatments (grinding) needs attention. A particularly important analysis is \nthe study of the surface roughness Modifications as a function of the process parameters which \nmay reveal re-deposition. All these aspects, and particularly the latter are the subject of the \nongoing work and we will report on these as we progress. \n2. Results and Discussion \nThe synopsis of the tests carried out is reported in the two tables in appendix A. The range of the \ntrench depth varies from about 2.7 µm, down to about 100 nm. The travel speed, the gas \nconcentration and the plasma torch power where varied with the aim of attaining significant \nremoval rates and therefore most of the following results are shown as a function of the travel \nspeed. These data are obtained from the quantitative analysis of interferometer files, which report \nthe differences between the surface prior and after the RAPT process (example in figure 2). \n \n \n(a) (b) \nFigure 2 ULE sample 1 (a) before the treatment (b) after two parallel passes under different \nconditions (trenches 1 and 2, cf table 1 in appendix A.  \n \nAn appreciation of the range of parameters can be gathered from figure 3, where the volumetric \nremoval rate (defined in Appendix B and discussed in section 3.4) is shown for the two different \nNF3 concentrations with travel speed (mm\/min) and plasma torch power (W) as parameters. \n \n 5 \n10 12 14 16 18 20\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n10 12 14 16 18 20\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n1800, 1500\n1800, 1,250 \n600, 1,250\n2400, 1,500\n600, 1,500\n600, 1,500\n1200, 1500\n1200, 1250\n1200, 1500\nVolume removal rate\nversus %NF3\ndV\n\/d\nt  \n(m\nm\n3 \/s\n)\n[NF3] %\n \nFigure 3 Volumetric removal rates as a function of gas concentration for different travel speed \nand plasma torch power (for clarity only the 20% data points are labelled with Travel speed \n(mm\/min) and power (W), in this order) \n \n2.1 Volumetric removal rates and trench depths \nThe volumetric removal rate [cf Appendix B for all results and Appendix C for the computation], \nis shown as a function of the travel speed for the two values of the power employed in figure 4(a) \nand 4(b) (1,250 W and 1,500 W respectively). \n \n \n600 1,200 1,800 2,400\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\n0.45\n0.50\n0.55\n0.60\n20% NF3\n10% NF3\nW=1,250 W\ndV\n\/d\nt  \n(m\nm\n3 \/s\n)\nTravel Speed (mm\/min)\n \n600 1,200 1,800 2,400\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\n0.45\n0.50\n0.55\n0.60\nrepeat\n3d trench (sup.)\n20% NF3\n10% NF3\nW=1,500 W\ndV\n\/d\nt  \n(m\nm\n3 \/s\n)\nTravel Speed (mm\/min)\n \n(a) (b) \n \nFigure 4 Volumetric removal rate as a function of travel speed at 10% and 20% NF3 concentration \n(a) 1,250 W (b) 1,500 W. \n \n \n 6 \nAs could have been expected, the rate decreases with the Travel Speed and an exponential decay \nseems appropriate. Similarly, one can show the dependency of the trench depths under the same \nconditions (figure 5).  \n \n \n600 1,200 1,800 2,400\n0\n400\n800\n1,200\n1,600\n2,000\n2,400\n2,800\n20% NF3\n10% NF3\nW=1,250 W\nTravel Speed (mm\/min)\nde\npt\nh \n(nm\n)\n \n600 1,200 1,800 2,400\n0\n400\n800\n1,200\n1,600\n2,000\n2,400\n2,800\n3d trench (sup.)\nW=1,500 W\n20% NF3\n10% NF3\nTravel Speed (mm\/min)\nde\npt\nh \n(nm\n)\n \n(a) (b) \nFigure 5 trench depth as a function of travel speed at 10% and 20% NF3 concentration (a) 1,250 \nW (b) 1,500 W. \n \n \nIn analogy with the volume rate, as expected, there is a decrease of the trench depth for increasing \nTravel Speed. The dependency seems exponential in both cases as shown in figure 5(a) and 5(b). \nThe increase of the trench depth versus TS due to the doubling of the gas concentration can be \ncompared with the one due to the power increase. To appreciate the relative variations, figure 6 \nreports the trench depth for the two powers and gas concentrations. \n600 1,200 1,800 2,400\n0\n400\n800\n1,200\n1,600\n2,000\n2,400\n2,800\n W=1,250 W 20%\n W=1,500 W 20%\n W=1,250 W 10%\n W=1,500 W 10%\nTravel Speed (mm\/min)\nde\npt\nh \n(nm\n)\n \nFigure 6 trench depth as a function of travel speed at 10% and 20% NF3 concentration at the \nplasma torch power, 1,250 W and 1,500 W. \n \n \n 7 \nClearly a doubling of the gas species is more effective than a mere 25% power increase. In fact, \nthe range over which the gas concentration may vary is wider than the range over which the \npower may vary (on the one hand due to the minimum requirements for a given torch geometry in \norder to obtain and maintain a stable plasma; on the other, to the maximum power the system may \nbe able to deliver for constructive and material limitations). For example, consider the point at \n600 mm\/min: assuming in figure 6 that the increase of depth with power is linear (for simplicity), \nin order to get the same effect of the doubling of the gas by changing the power, one needs to \nraise the latter over 1,750 W, which is beyond the capabilities of the plasma setup employed in \nthese tests. \n2.2 The sample temperatures \nOnce the torch enters the sample a progressively higher temperature of the latter is observed, \nwhich will depend on the travel speed, the plasma torch power and, in principle also on the gas \nconcentration. An example of temperature traces is shown in figure 7. \n \n0 100 200 300 400 500\n0\n50\n100\n150\n200\n250\n300\n1.200 \nmm\/min600 \nmm\/min\nW=1.5 kW\n10% NF3\nT \n(o C\n)\nt (s)\n \n0 100 200 300 400 500\n0\n50\n100\n150\n200\n250\n300\n1.200 \nmm\/min600 \nmm\/min\nW=1.5 kW\n20% NF3\nT \n(o C\n)\nt (s)\n \n(a) (b) \n \nFigure 7 sample temperature trace at the two travel speeds 600 and 1,200 mm\/min (a) at 10% \nand (b) 20% NF3 concentration. Power, 1,500 W. The curves in each diagram indicate the entry \nand the exit of the plasma tool on the sample surface and correspond to trenches performed at \ndifferent travel speed \n \n \nThe two pairs of traces do no differ significantly [The lower width of the peak on the right hand \nside is consequence of the higher travel speed]. One might think that a doubled gas concentration \ncould lead to differential heating (the other parameters being held constant). In figure 8 the \nmaximum sample temperature, taken when the plasma plume is slightly beyond the sample mid-\nplane (cross-section) is reported as a function of the travel speed for the two concentrations and \nplasma powers. The extreme of the maximum sample surface temperatures within the travel \nspeed range 600 to 2,400 mm\/min, are 120 ºC to 220 ºC (at 1,250 W) and 170ºC to 280ºC (at \n1,500 W). \n \n \n 8 \n400 800 1,200 1,600 2,000 2,400\n100\n120\n140\n160\n180\n200\n220\nT \nm\nax\n \n(o C\n)\n 20% NF3\n 10% NF3\nW=1,250 W\nTravel Speed (mm\/min) 400 800 1,200 1,600 2,000 2,400\n140\n160\n180\n200\n220\n240\n260\n280\n300\n 20% NF3\n 10% NF3\nW=1,500 W\nTravel Speed (mm\/min)\nT \nm\nax\n \n(o C\n)\n \n(a) (b) \n \nFigure 8 sample maximum temperature as a function of travel speed at 10% and 20% NF3 \nconcentration and two values of the plasma torch power (a) 1,250 W and (b) 1,500 W. \n \n \nClearly, there isn’t any correlation between the gas concentration and the maximum temperature \nof the sample surfaces. Note that in the case of 1,250 W, the two points plotted at 1,200 mm\/min \ncorrespond to two trenches performed in different sequence: the lowest of the two pertains to a \n'repeated’ trench, e.g. a trench superimposed to the previous case (whose temperature however is \nnot available), thus there is a justification for ‘some’ difference due to the different initial \nconditions: the repeated trench is performed on a pre-existing trench. A similar situation occurs at \n2,400 mm\/min where now the temperatures of trench 2 and the superimposed trench 3 are both \navailable: the latter is slightly higher. The opposite occurs at 1,500 W where the latter trench \nshows a lower temperature. Therefore, based on these few thermal data, it is not possible to \nconclude whether the superimposed trench leads to a higher or lower temperature and an \nameliorated temperature measurement system is under development. \nHowever, it is possible to conclude that within the limits of the instrumental sensitivity the effects \nof the gas concentration on the temperature is negligible and therefore the major actor in the \nsamples thermal state is the plasma power (and test to determine heat release of thermochemical \norigin may be excluded for the ULE samples). \nAlso, it is possible to note that at the highest speed (2,400 mm\/min) and the lower of the two \npowers (1,250 W) the process is still capable of removing layers of ~160 nm, with local \nmaximum temperature not exceeding of ~110 ºC. \n2.3. Adjacent and overlapped trenches \nWith the exception of one case, the tests were performed by keeping the distances between \ntrenches (50 mm) to values which are more than twice the typical FWHM or of the lateral ‘tool \nsize’ (~40 mm). The idea was to study trenches which are not interfering one with the other. \nHowever, as the tool is intended to etch extended surfaces, it is interesting to characterize \ntrenches which can superimpose, in order to be able to optimize the tool passes during the process \nof those. An example of adjacent trenches is reported in figure 9, where two trenches from sample \n5 were produced with a distance between trenches reduced from 50 to 20 mm. The first two \ncurves from above are the individual peaks; the third (bottom) is the resulting trench cross \nsection. Note that the dotted line in the overlapping region (c) was drawn to compare the trench \nfeatures with part (a) \n 9 \n2.4 Material removal rates \nThe values computed for all the samples are reported for two gas concentrations and two powers \nin the tables in Appendix B. Because of edge effects, where possible, an attempt has been made to \nselect the portions of the longitudinal trench where a ‘reasonably’ flat profile was found.  \nWithout considering superimposed trenches, the highest value of the steady state material \nremoval rate, 0.505(±0.024) mm3\/s, is attained at 600 mm\/min; the lowest, still a respectable \n0.107 mm3\/s, at 1,800 mm\/min.  \nClearly, when operating with more extended surfaces, the edge effects will need to be addressed \nwith appropriate algorithms for the control of the dwelling time in order to regulate the heat \ntransfer to the substrates.  \n \n2.5 Other correlations \n \nSo far the correlation between the power and the active gas flow on the width of the trenches has \nbeen neglected. With respect to the increase in gas flow, the width does not seem very much \ninfluenced by the doubling of the gas flow, although a more extended database would be \nnecessary to confirm this observation.  \nIt is not possible to ascertain whether the variations in the removal upon superimposed trenches \nare accompanied by variations on the FWHM: this would help predict whether in the same \nconditions, the RAPT tool becomes finer or coarser upon subsequent passes. In absence of further \ndata, we will consider the width as ‘practically unchanged’. Future estimation of this parameter \nwill be attempted as it will permit to determine the number of passes necessary to etch a given \nsurface uniformly. \n \n3. Conclusions and ongoing work \n \nThe RAPT, a new atom plasma etching process operating at atmospheric pressure, has been \nsuccessfully applied to ULE glass samples without the need to pre-heat the surfaces. The \nremoval rates appear very competitive with respect to other processes like IBF. The travel speeds \n(TS) employed in these tests are not necessarily the highest attainable with acceptable removal \nrates. In other words, tests to increase TS and attain nominally ‘zero removal’ have not been \nperformed yet and the attainment of trench depths of 110 nm or less at considerably higher TS \n(2,400 mm\/min) indicates that ‘finer tuning’ with smaller depths is attainable. In general, it is \npossible to match and exceed the process speed of competing technologies: in this work 0.55 \nmm3\/s, against the 0.019 mm3\/s reported for the only other atmospheric pressure plasma process \nknown (Nikon, even if the comparison should be based on common substrate compositions).  \nAn increase in the concentration of the active specie flow increases the material removal as does \nthe increase of the plasma torch power, but the first provides a broader range of variability for the \nremoval rates. \nAdjacent trenches kept at the nominal 50 mm distances do not seem to influence one another, in \nthat the visible portion of the trench profile maintains a Gaussian profile. Quantitative evaluation \nof the surface state (roughness) prior and post-process has not been performed yet and further \nsurface analysis is under way. In particular, an understanding of the possible degradation of the \nsurface roughness through the RAPT process is part of this work.  \nThe temperature records do not depend on the gas concentration, therefore, the in-principle \npossibility of crossed thermo-chemical effects is ruled out. The maximum sample temperatures \nnever exceeded the 220 ºC during the treatment with the longest dwelling time. Different \nmaterials will be tested against the possibility of etching without or limited sample pre-heating \nand further tests on SiC surface are scheduled. \n 10 \n \nFigure 9 adjacent trenches due to first and second pass. From above, trenches obtained (1) with \nTravel Speed 1200, at 10% NF3 and 1,250 W and (2) Travel speed 600, at 20% NF3 and 1,500 W \nBottom, partially overlapping trenches from first and second pass. For cross-check purposes, the \ndotted line in the overlapping region (c) was drawn to compare the trench features with (a) \n \n 11 \nAppendix A - Experimental set up \nThe plasma source consists of an ICP torch and matching network enclosed in a chamber within a \ndouble encasing, equipped with safety interlocks and gas exhaust controls and a gas scrubber. A \ntwo axis motion stage, capable of displacements of 320 mm in both X and Y directions, moves \nthe samples beneath the plasma torch, see figure 1. The ICP torch is made of three coaxial quartz \ntubes [1] and operated at a frequency f=27.12 MHz and power typically W=1.25 to 1.5 kW. The \nplasma gas, Ar, is immitted through the external tube (18 mm diameter) with a tangential inlet at a \nflow of 15,000 sccm. Tests have been performed using NF3 on ULE test samples (100x100x20 \nmm3). The ‘auxiliary’ gas, also Ar, is immitted through the intermediate tubing at a rate of 300 \nsccm, whereas the active specie NF3 is kept at a flow of 1,000 sccm (1 sccm=10-3 slm).  \nA pyrometer yields the spatial average of the sample surface temperature directly beneath the \ntorch, over a spot of diameter 20 mm. When the plasma plume is located at distances below 20 \nmm from the sample edge, the averages include points pertaining to the sample holder and thus \nyield un-calibrated readings. Nevertheless, comparative features can be extracted from the \ntemperature-time profiles taken from measurements performed in identical geometries when the \nspot falls entirely on the sample. In order to visualize the differences in surface profiles induced \nby the plasma, pre- and post –process analysis is performed with a range of techniques. \nInterferometry is used and results of measurements are shown here, taken with a Zygo \ninterferometer (‘GPI’) before and after the RAPT process. \nIn the case of ULE, the tests were made to determine an operational window based on the \nvariation of three quantities: travel speed, plasma torch power and active specie concentration. \nThe Travel speed was unknown but it had to be comparable and possibly beyond the limits of \ncompeting technologies. As shown below, when trench depth and volumetric removal rate are \nconsidered this has been the case. The tests geometry is displayed in figure 1and the typical \ninterferometric aspect of the sample surface after the process is shown in figure 2 where two \ntrenches of pseudo-gaussian cross section are visible [It should be noted that the three \ndimensional picture in figure 1b appears circular according to the input optics of the \ninterferometer, with diameter 100 mm].    \n \n 12 \nAppendix B - ULE Tests and trenches synopsis \nThe depths reported are taken at the sample mid section and are computed as differences between \nthe original profile and subsequent passes. \n \nTable 1. Tests series (I) \nULE \n \nP \n(*) \nW \n(W) \nNF3 \n% \nTS \n(mm\/\nmin) \n \na \nmm \nMax T \n(°C) \nDepth  d \n(nm) \nFWHM  (mm) \n \n\u0001V  (mm3\/s) \n1 \n \n1 \n2 \n3 r) \n1,250 \n1,250 \n10 \n10 \n600 \n1,200 \n- \n50 \n- \n- \n167.4 \n1367 \n567 \n+524 \n16.86 \n17.14 \n16.57 \n0.230(11) \n0.194(9) \n0.174(8) \n2 \n \n1 \n2 \n3 r) \n1,500 \n1,500 \n10 \n10 \n600 \n1,200 \n- \n50 \n276.0 \n216.3 \n213.6 \n1541 \n676 \n+616 \n18.29 \n18.29 \n17.71 \n0.282(14) \n0.247(12) \n0.218(10) \n3 \n \n1 \n2 \n3 r) \n1,500 \n1,500 \n20 \n20 \n600 \n1,200 \n- \n50 \n280.3 \n220.3 \n213.4 \n2761 \n1174 \n+1022 \n20.0 \n18.57 \n16.86 \n0.552(26) \n0.436(21) \n0.345(17) \n4 \n \n1 \n2 \n1,250 \n1,250 \n20 \n20 \n600 \n1,200 \n- \n50 \n218.5 \n179.4 \n1832 \n774 \n15.43 \n16.0 \n0.283(14) \n0.248(12) \n5 \n \n1 \n2 \n1s \n1,250 \n1,500 \n10 \n20 \n1,200 \n600 \n- \n20 \n175.2 \n284.2 \n539 \n2760 \n~500 \n17.14 \n18.29  \n14.29(1)  \n0.185(9) \n0.505(24) \n \n 13 \n \nTable 2. Tests series (II) \nULE \n \nP \n(*) \nW \n(W) \nNF3 \n% \nTS \n(mm\/\nmin) \n \na \nmm \nT Max \n(°C) \nDepth \n d nm \nFWHM mm \n \n\u0001V  \n \nmm3\/s \n5b \n \n1 \n2 \n3 r) \n1,250 \n1,250 \n10 \n10 \n1,800 \n2,400 \n50 121.3 \n112.7 \n+109  \n 234.8 \n163 \n165.6 \n15.14 \n17.43 \n15.71 \n0.107(5) \n0.114(5) \n0.104(5) \n2b \n \n1 \n2 \n3 r) \n1,500 \n1,500 \n10 \n10 \n1,800 \n2,400 \n50 174.4 \n163.6 \n+159.9 \n316.2 \n194.6 \n221.7 \n16.57 \n18 \n20.57 \n0.157(8) \n0.140(7) \n0.182(9) \n3b \n \n1 \n2 \n3 r) \n1,500 \n1,500 \n20 \n20 \n1,800 \n2,400 \n50 173.5 \n159.8 \n+161 \n530 \n387 \n419 \n17.43 \n18.29 \n19.43 \n0.139(7) \n0.283(14) \n0.326(16) \n4b \n \n1 \n2 \n1,250 \n1,250 \n20 \n20 \n1,800 \n2,400 \n50 123.2 \n116.5 \n451.6 \n303.2 \n16 \n17.43 \n0.217(10) \n0.211(10) \nLEGEND \na= Distance between trenches, mm; TS= Travel Speed (mm\/min), w width at base, FWHM= Full \nwidth at Half Maximum; L=length of the flat portion of trench. In parentheses is included a \n‘reasonably flat’ portion (see text); “+xxx” means incremental due to repeated pass. “r”= pass \nrepeated on top of preceding with same parameters; “s”= superposition between adjacent \ntrenches.   \n \nAppendix C - Material Removal \nBy taking the difference of profiles depths (nm) it is possible to estimate the material removal \nrate. Using the Gaussian approximation for the transverse profiles, multiplying the depth of the \ntrench d (in nm) (1) by half the width of the trench w (the FWHM of the Gaussian transverse \nprofile, in mm); and (2) by the longitudinal path distance L (in mm); dividing the result by the \ntime interval τ (s) to cover the distance L, τ \/ vL=  (where v is the travel speed TS), the \nvolumetric (mm3\/s) and mass removal rate (g\/s) may be estimated: \n \n3 3 3\n\/ 2 \/ 2\nv\/2\n\/ v\n( )\nρ 2.21 10 ( \/ ) ( \/ )\nLdw LdwV d w\nL\nw FWHM\nm V g mm V mm s\nτ\n−\n= = = ⋅ ⋅\n=\n= ⋅ = ⋅ ⋅\n\u0001\n\u0001 \u0001\u0001\n \n \nFor the latter, the uncertainty of the density of ULE (2.21⋅103 Kg m-3 ±0.5%) should be \nincorporated together with the uncertainties on all the linear quantities, assumed to be 3.88% for \nthe scatter on the depth of the profile; and 5.7% for the transversal trench. However, as the \n 14 \ndensity is estimated at ambient temperature, we prefer to quote the results in the main text as \nvolumetric removal rates. Note that the hypothesis used in the computation is that a triangular \nshape approximates the trench cross section, with base=FWHM and height taken as the trench \ndepth. \nReferences \n \n1. Walker, D., Shore P., Ultra Precision Surfaces - a New Paradigm, Basic Technology - \nCase for Support, 2003. \n2. Carr, J., RAPT Industries Inc., Patent PCT\/US02\/02507 International Publication \nnumber WO 02\/060828. 2002. \n3. Flamm, D.L., Pure and Applied Chemistry, 1990, 62,1710. \n4. Manos, D.M., Flamm, D.L., in Plasma etching, an introduction (Eds: O. Auciello, \nFlamm, D.L.), Academic Press, Boston, 1989. \n5. Suzuki, K., Itabashi, N, Pure and Applied Chemistry, 1996, 68, 1011. \n6. Mirkarimi, P.B., Baker, S L, Montcalm, C, Folta, J A, Applied Optics, 2001, 40, 62. \n7. http:\/\/www.newportglass.com\/amscergl.htm, Material safety sheet. 2005, Newport Glass. \n8. Mirkarimi, P.B., Baker, S L, Montcalm C,  Folta, J A, Applied Optics, 2001, 40, 62. \n9. Schindler, A., T. Haensel, D. Flamm, A. Nickel, H. J. Thomas, F. Bigl. Precision Science \nand Technology for Perfect Surfaces, Tokyo: The Japanese Society for Precision \nEngineering,  1999. \n10. Adams, D.P., Vasile,  M J, Krishnan, A S M, Precision Engineering, 2000, 24, 347. \n11. Mast, T.S., Nelson, J E,   Sommargren, G E, Segment Fab – SPIE 2000, 2000. \n12. Walker, D.D., Doel, A P,  Bingham, R G, Brooks, D,  King, A M, , Optical Science \nLaboratory, University College London (D D Walker, Study Co-ordinator), UK National \nPhysical Laboratory, QinetiQ Ltd, Zeeko Ltd. 2002, 1.  \n13. Nikon, 2005, \nhttp:\/\/www.nikon.co.jp\/main\/eng\/portfolio\/about\/technology\/nikon_technology\/plasma_c\nvm_e\/index.htm. \n14. Gailly, P., AMTT Program, Seibersdorf, Microstructure evolution of after ion beam \nbombardment. 2000, Centre Spatial de Liege - Universite de Liege. p. 1-14. \n \n"}