{"doi":"10.1159\/000161982","coreId":"196674","oai":"oai:lra.le.ac.uk:2381\/8871","identifiers":["oai:lra.le.ac.uk:2381\/8871","10.1159\/000161982"],"title":"The Molecular Interactions between Filtered Proteins and Proximal Tubular Cells in Proteinuria","authors":["Baines, Richard J.","Brunskill, Nigel J."],"enrichments":{"references":[{"id":43662466,"title":"Albumin activates ERK via EGF receptor in human renal epithelial cells.","authors":[],"date":"2005","doi":null,"raw":"Reich H, Tritchler D, Herzenberg AM, Kassiri Z, Zhou X, Gao W, Scholey JW. Albumin activates ERK via EGF receptor in human renal epithelial cells. J Am Soc Nephrol 2005; 16: 1266-1278.","cites":null},{"id":43662484,"title":"Atherogenic scavenger receptor modulation in the tubulointerstitium in response to chronic renal injury.","authors":[],"date":"2007","doi":"10.1152\/ajprenal.00063.2007","raw":"Okamura DM, Lopez-Guisa JM, Koelsch K, Collins K, Eddy AA. Atherogenic scavenger receptor modulation in the tubulointerstitium in response to chronic renal injury. Am J Physiol 2007; 293: F575-F585.","cites":null},{"id":43662473,"title":"EGF receptor transactivation mediated by the proteolytic production of EGF-like agonists.","authors":[],"date":"2000","doi":"10.1126\/stke.2000.15.pe1","raw":"Carpenter G. EGF receptor transactivation mediated by the proteolytic production of EGF-like agonists. Sci STKE 2000; 15: 1-2","cites":null},{"id":43662467,"title":"Expression of epidermal growth factor and its receptor in normal and diseased human kidney: An immunohistochemical and in situ hybridization study. Kidney Int","authors":[],"date":"1996","doi":"10.1038\/ki.1996.94","raw":"Gesualdo L, Di Paolo S, Calabro A, Milani S, Maiorano E, Ranieri E, Pannarale G, Schena FP. Expression of epidermal growth factor and its receptor in normal and diseased human kidney: An immunohistochemical and in situ hybridization study. Kidney Int 1996; 49: 656-665","cites":null},{"id":43662478,"title":"Perspective – FcRn transports albumin: relevance to immunology and medicine. Trends Immunol","authors":[],"date":"2006","doi":"10.1016\/j.it.2006.05.004","raw":"Anderson CL, Chaudhury C, Kim J, Bronson CL, Wani MA, Mohanty S. Perspective – FcRn transports albumin: relevance to immunology and medicine. Trends Immunol 2006; 27: 343-348.","cites":null},{"id":43662479,"title":"Podocytes use FcRn to clear IgG from the glomerular basement membrane.","authors":[],"date":"2008","doi":"10.1073\/pnas.0711515105","raw":"Akilesh S, Huber TB, Wu H, Wang G, Hartleben B, Kopp JB, Miner JH, Derry C. Roopenian DC, Unanue ER, Shaw AS. Podocytes use FcRn to clear IgG from the glomerular basement membrane. Proc Natl Acad Sci USA 105, 967-972, 2008.","cites":null},{"id":43662476,"title":"Statins but not thiazolidinediones attenuate albumin-mediated chemokine production by proximal tubular cells independently of endocytosis.","authors":[],"date":"2008","doi":"10.1159\/000137682","raw":"Chana RS, Sidaway JE, Brunskill NJ. Statins but not thiazolidinediones attenuate albumin-mediated chemokine production by proximal tubular cells independently of endocytosis. Am J Nephrol 2008 (in press).","cites":null},{"id":43662462,"title":"The C-terminus of megalin regulates gene expression in opossum kidney proximal tubule (OKP) cells.","authors":[],"date":"2008","doi":"10.1152\/ajpcell.00037.2008","raw":"Li Y, Cong R, Biemesderfer D. The C-terminus of megalin regulates gene expression in opossum kidney proximal tubule (OKP) cells. Am J Physiol Cell Physiol 2008 Articles in Press. (May 21, 2008). doi:10.1152\/ajpcell.00037.2008","cites":null},{"id":43662474,"title":"The role played by endocytosis in albumin-induced secretion of TGFβ-1 by proximal tubular epithelial cells.","authors":[],"date":"2007","doi":"10.1152\/ajprenal.00069.2006","raw":"Diwaker R, Pearson AC, Colville-Nash P, Brunskill NJ, Dockrell MEC. The role played by endocytosis in albumin-induced secretion of TGFβ-1 by proximal tubular epithelial cells. Am J Physiol 2007; 292: F1464-F1470.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11","abstract":"Proteinuria is associated with progressive chronic kidney disease and poor cardiovascular outcomes. Exposure of proximal tubular epithelial cells to excess proteins leads to the development of proteinuric nephropathy with tubular atrophy, interstitial inflammation and scarring. Numerous signalling pathways are activated in proximal tubular epithelial cells under proteinuric conditions resulting in gene transcription, altered growth and the secretion of inflammatory and profibrotic mediators. Megalin, the proximal tubular scavenger receptor for filtered macromolecules, has intrinsic signalling functions and may also link albumin to growth factor receptor signalling via regulated intramembrane proteolysis. It now seems that endocytosis is not always a prerequisite for albumin-evoked alterations in proximal tubular cell phenotype. Recent evidence shows the presence of other potential receptors for proteins, such as the neonatal Fc receptor and CD36, in the proximal tubular epithelium","downloadUrl":"http:\/\/content.karger.com\/ProdukteDB\/produkte.asp?doi=10.1159\/000161982.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8871\/3\/Nephron_review_article_-_revised.pdf","pdfHashValue":"5526b2e8f7cc16701da859eeabf4d422c771fa04","publisher":"Karger","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8871<\/identifier><datestamp>\n                2016-04-14T08:35:47Z<\/datestamp><setSpec>\n                com_2381_6<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_9<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe Molecular Interactions between Filtered Proteins and Proximal Tubular Cells in Proteinuria<\/dc:title><dc:creator>\nBaines, Richard J.<\/dc:creator><dc:creator>\nBrunskill, Nigel J.<\/dc:creator><dc:description>\nProteinuria is associated with progressive chronic kidney disease and poor cardiovascular outcomes. Exposure of proximal tubular epithelial cells to excess proteins leads to the development of proteinuric nephropathy with tubular atrophy, interstitial inflammation and scarring. Numerous signalling pathways are activated in proximal tubular epithelial cells under proteinuric conditions resulting in gene transcription, altered growth and the secretion of inflammatory and profibrotic mediators. Megalin, the proximal tubular scavenger receptor for filtered macromolecules, has intrinsic signalling functions and may also link albumin to growth factor receptor signalling via regulated intramembrane proteolysis. It now seems that endocytosis is not always a prerequisite for albumin-evoked alterations in proximal tubular cell phenotype. Recent evidence shows the presence of other potential receptors for proteins, such as the neonatal Fc receptor and CD36, in the proximal tubular epithelium.<\/dc:description><dc:date>\n2010-12-14T16:32:11Z<\/dc:date><dc:date>\n2010-12-14T16:32:11Z<\/dc:date><dc:date>\n2008-11<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nNephron Experimental Nephrology, 2008, 110 (2), pp. E67-E71.<\/dc:identifier><dc:identifier>\n1660-8151<\/dc:identifier><dc:identifier>\nhttp:\/\/www.karger.com\/Article\/FullText\/161982<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8871<\/dc:identifier><dc:identifier>\n10.1159\/000161982<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as Nephron Experimental Nephrology, 2008, 110 (2), pp. E67-E71.  The final version is available from http:\/\/content.karger.com\/ProdukteDB\/produkte.asp?doi=10.1159\/000161982.  © 2008 S. Karger AG, Basel.  Doi: 10.1159\/000161982<\/dc:rights><dc:publisher>\nKarger<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1660-8151","1660-8151"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":" 1 \nThe Molecular Interactions Between Filtered Proteins and Proximal Tubular \nCells in Proteinuria \n \nRichard J. Baines and Nigel J. Brunskill, Department of Infection, Immunity and \nInflammation, University of Leicester School of Medicine, Leicester, UK. \n \nCorrespondence to:  Professor Nigel J. Brunskill \n   Professor of Renal Medicine, \n   Department of Infection, Immunity and Inflammation, \n   Medical Sciences Building, \n   University of Leicester School of Medicine, \n   University Road, \n   Leicester. \n   LE1 9HN. \n \nTel:   +44 116 258 8043 \nFax:   +44 116 258 4764 \nEmail:   njb18@le.ac.uk \n \n 2 \nAbstract \n Proteinuria is associated with progressive chronic kidney disease and poor \ncardiovascular outcomes. Exposure of proximal tubular epithelial cells to excess \nproteins leads to the development of proteinuric nephropathy with tubular atrophy, \ninterstitial inflammation and scarring. Numerous signalling pathways are activated \nin proximal tubular epithelial cells under proteinuric conditions resulting in gene \ntranscription, altered growth and the secretion of inflammatory and pro-fibrotic \nmediators. Megalin, the proximal tubular scavenger receptor for filtered \nmacromolecules has intrinsic signalling functions and may also link albumin to \ngrowth factor receptor signalling via regulated intramembrane proteolysis. It now \nseems that endocytosis is not always a pre-requisite for albumin-evoked alterations \nin proximal tubular cell phenotype. Recent evidence shows the presence of other \npotential receptors for proteins, such as the neonatal Fc receptor and CD36, in the \nproximal tubular epithelium.  \n 3 \nIn renal diseases, proteinuria correlates closely the rate of progressive chronic \nkidney disease. Renal functional loss under these circumstances is accompanied by \nthe development of a common pattern with tubular atrophy, interstitial inflammation \nand fibrosis culminating in the end stage kidney. Many studies have demonstrated a \npositive correlation between the degree of proteinuria and disease progression, and \nconfirmed the significant renoprotection afforded by anti-proteinuric strategies. In the \nlast 15 years the importance of proteinuria as a marker and maker of kidney disease \nhas been extensively examined. \nActivation and Altered PTEC Phenotype in Proteinuria \nThe clinicopathological associations described above led to the hypothesis that \nbioactive macromolecules abnormally filtered into the proteinuric proximal tubule \n(PT) may be toxic, causing dysregulated signalling and disturbed phenotype in PT \nepithelial cells (PTEC).  \nThis hypothesis has been extensively tested using in-vitro approaches with \ncultured PTEC, and in-vivo with a variety of animal models. The bulk of these studies \nhave focussed on PTEC of exposure to albumin, the most prevalent protein in \nproteinuric glomerular filtrate, but other proteins such as immunoglobulin and \ntransferrin have also been tested in this way. The evidence clearly indicates that \nalbumin, albumin-bound molecules and other filtered proteins are able to dynamically \nregulate PTEC function with activation of multiple signalling enzymes and \ntranscription factors. As result numerous changes in cell phenotype and growth \ncharacteristics occur generating a pro-inflammatory environment in the renal \ntubulointerstitium that favours the development of fibrotic changes characteristic of \nthe failing kidney (1). A comprehensive list of pathways activated and mediators \nreleased by PTEC in proteinuria is provided in Table 1. Low concentrations of \n 4 \nalbumin favour PTEC survival and proliferation, whereas large amounts of albumin \nand albumin bound molecules such as fatty acids predispose PTEC to apoptosis. \nMegalin and Cubilin as Receptors for Albumin Endocytosis in PTEC \nThese findings have aroused intense interest in how filtered proteins, \nespecially albumin, are handled in the PT. It has been long recognised that filtered \nalbumin is retrieved from the proximal tubular lumen by endocytosis. Solute removal \nby non-specific, fluid-phase endocytosis in the PT is trivial. Specific binding sites for \nalbumin have been described in PTEC, and receptors responsible for albumin re-\nabsorption by receptor-mediated endocytosis have been identified.  \nMegalin is a giant glycoprotein member of the low-density lipoprotein \nreceptor (LDL-R) gene family. In the kidney it is highly expressed in microvilli and \ncoated pits of the PT brush border and in components of the PTEC sub-luminal \nendocytic apparatus. In extrarenal tissues megalin is also expressed in the luminal \nmembranes of other absorptive epithlelia. Structurally megalin is composed of a very \nlarge extracellular domain composed of four cysteine rich ligand binding areas, 17 \nEGF-type repeats and eight spacer regions possessing YWTD repeats. A short \ntransmembrane region links the extracellular domain to a short cytoplasmic tail of 209 \namino acids in humans. Cubilin is a 460 kDa giant extracellular protein anchored to \nthe cell surface but lacking either a transmembrane or intracellular domains. In \ncultured PTEC efficient receptor mediated endocytosis of albumin and a variety of \nother predominantly low-molecular weight proteins is dependent on normal \nexpression of both megalin and cubilin. In PTEC megalin functions in tandem with \ncubilin to form a low-affinity, high-capacity system for the re-absorption of a number \nof filtered proteins (2). In accordance with these observations megalin deficient mice, \n 5 \ncubilin deficient dogs, and humans with cubilin mutations in Imerslund-Gräsbeck \nsyndrome all show up to a 25-fold increase in albuminuria .  \nAn absorptive complex composed of several membrane and cytoplasmic \nproteins is required for the uptake of bound albumin into the cell (2). The NPXY \ndomain of the megalin cytoplasmic tail interacts with the clathrin coat of membrane \ninvaginations at the base of microvilli leading to ligand\/receptor internalisation and \nshuttling of the receptor between the plasma membrane and the endosomal \ncompartment (2). The binding affinity of megalin for its ligands is pH dependent and \nconstant around pH 7, equivalent to that in the PT. In the endosomal vesicles, pH falls \ndue to combined activity of the vacuole-type H\n+\n-ATPase, Na\n+\n\/H\n+\n exchanger-3, and \nthe ClC-5 chloride channel. Megalin ligands dissociate from the receptor at pH <6.5. \nUltimately the receptor is re-cycled to the plasma membrane and its protein ligand \ntransferred to the lysosome where it is degraded and constituent amino acids are re-\nabsorbed into the circulation (2). \nMegalin – More than an Endocytic Receptor? \nConventionally megalin has been regarded as a scavenger receptor, and its \nligands such as albumin simply as inert cargo destined for degradation. Several lines \nof evidence now suggest that megalin has signalling functions beyond its role in \nendocytosis. The megalin knockout mouse is barely viable, the few pups that survive \ndemonstrate lung and brain abnormalities, proteinuria and a markedly attenuated \nendocytic apparatus in the PT. The severity of this phenotype is difficult to explain by \njust the loss of megalin-mediated endocytosis and suggests more diverse functions for \nmegalin. The megalin cytoplasmic tail (meg-CT), longer than those of the other LDL-\nR, possesses sequence motifs potentially involved in signalling. There are multiple \nconsensus sequences for phosphorylation by protein kinases A and C (PKC), \n 6 \nglycogen synthase kinase-3 (GSK-3), and casein kinase II. Meg-CT is phosphorylated \non serine by GSK-3 and that this may impact on endocytic function by negatively \nregulating megalin recycling (3). Whether other kinases can also phosphorylate meg-\nCT, and how phosphorylation may be agonist regulated unresolved questions.  \nMeg-CT also has sequence regions that regulate protein-protein interactions. \nThese include Src-homology domains 2 and 3 that mediate interaction with the p85 \nregulatory subunit of phosphatidylinositide 3-kinase (PI 3 kinase), and proline rich \nregions (5). Identified meg-CT binding partners include the MAP kinase scaffold \nproteins disabled 1 and 2, JNK interacting proteins 1 and 2, post-synaptic density \nprotein-95-like membrane associated guanylate cyclase proteins, and other adaptor \ntype proteins such as ANKRA, SEMCAP-1 and megalin binding protein. Collectively \nthese associations implicate meg-CT in raf-1 kinase and phosphoinositide signalling, \nJNK scaffold assembly, G-protein activation and nuclear transcription (4).  \nMegalin also anchors protein kinase B (PKB) to the plasma membrane. This \nkinase is a key component of signal transduction pathways regulating cell survival \n(5). In vitro, albumin at the physiological concentrations found in the healthy PT  \nstimulates this megalin-associated PKB, allowing its dissociation from megalin to \nactivate PI 3 kinase and downstream cell survival pathways. Conversely higher \npathophysiological albumin concentrations downregulate megalin expression in \nPTEC, therefore plasma membrane PKB levels are reduced, cell survival pathways \nare not activated and the cells become sensitised to apoptosis (5). Therefore, by \ncoupling albumin binding to PKB activity megalin acts as an albumin sensor, under \nlow albumin concentrations promoting cell survival via PKB, but under higher \nalbumin concentrations predisposing to apoptosis. Consistent with this, in proteinuric \nkidney specific megalin knockout mice with a mosaic pattern of PTEC megalin \n 7 \ndeficiency, the apoptotic rate was significantly greater in megalin deficient cells (6). \nThese data explain why in PTEC low concentrations of albumin may be protective \nand high concentrations detrimental. \nRegulated Intramembrane Proteolysis of Megalin. \nRegulated intramembrane proteolysis (RIP) is a mechanism that links receptor \nfunction to transcriptional activity (7). It is characterised by ectodomain shedding of \ntransmembrane proteins regulated by PKC and performed by the ADAM family of \nmetalloproteases. The remaining membrane associated C-terminal fragment is then \ncleaved within the transmembrane region by γ-secretase and the released C-terminal \ndomain is trafficked to the nucleus where it acts as a transcription factor. \nMegalin has been shown to undergo RIP both constitutively and following \ninteraction with its ligand the vitamin D binding protein (7), although whether all \nmegalin ligands cause shedding is unknown. A role for megalin in PTEC regulation of \nPTEC gene transcription has recently been described (8). Overexpression of \nmembrane bound meg-CT diminishes expression of megalin itself and Na\n+\n\/H\n+\n \nexchanger-3 at both mRNA and protein levels in opossum kidney cells. This effect is \nattenuated by the inhibition of γ-secretase (8). Although meg-CT is predicted to target \nthe nucleus this has not yet been demonstrated due to its short half life in the cell. This \nability to regulate PTEC gene expression may further explain how megalin functions \nas a PT sensor of filtered protein, regulating multiple aspects of PTEC phenotype \naccording to the prevailing luminal microenvironment  \nOverall therefore, emerging new evidence suggests that, megalin signalling \nmay support homeostatic tubular balance in health when physiological levels of \nprotein are present in the tubular lumen, but if dysregulated in proteinuric disease the \nresult could be PTEC pathology typical of proteinuric nephropathy.  \n 8 \nInteraction between LDL-R and Growth Factor Receptors \nFunctional inactivation of the epidermal growth factor receptor (EGF-R) in \nrenal proximal tubular cells reduces tubulointerstitial damage after renal injury. \nHowever EGF itself may not be responsible for this effect. When PTEC are exposed \nto albumin at high concentrations, comparable to those found under proteinuric PT \nconditions, expression of EGF-R is increased, EGF-R activity is enhanced and ERK \nstimulated via an EGF-R dependent pathway (9). This effect is inhibited by the \nspecific EGF-R inhibitor AG-1478 which inhibits the intrinsic tyrosine kinase activity \nof the receptor (9). Therefore albumin per se appears able to activate EGF-R. The  \nlocalisation of the EGF-R within polarised cells will significantly govern its \npathophysiological role. In health around 10% of PTEC EGF-R is localised to the \napical membrane, but in diseased kidneys apical EGF-R expression is much increased \n(10). \nThe mechanism of albumin-evoked stimulation of EGF-R remains uncertain. \nSix EGF-like activators of EGF-R have been described: EGF, transforming growth \nfactor- , heparin binding EGF, amphiregulin, betacellulin and epiregulin. Each of \nthese mediators exists as a transmembrane precursor that must undergo ectodomain \ncleavage to release the soluble EGF-activating fragment. Thus the extracellular \nrelease of protein fragments with EGF-like sequences results in EGF-R activation \n(11). Crucially in this context, the extracellular domain of megalin has 17 EGF-type \nrepeats. It is therefore conceivable that if ectodomain shedding of megalin occurs \nfrom PTEC in the pathological setting of proteinuria then abnormal EGF activation \ncould occur with resulting tubulointerstitial injury. Alternatively, transactivation of \nthe EGF-R by G-protein coupled receptors can in part be regulated by PKC and c-Src, \nboth of which activate ERK and are stimulated by albumin in PTEC. From these \n 9 \nstudies it is difficult to ascertain whether this dependancy lies up- or downstream of \nthe EGF-R. In other cell types there is little indication that albumin is able to \ntransactivate the EGF-R and hence the mechanism may be more restricted to the \nPTEC.   \nIs Endocytosis a Pre-Requisite for Albumin Signalling? \nIt is generally assumed that albumin ‘overload’ of PTEC is an obligate \nrequirement before adverse responses are manifest. However the signalling capacities \nof megalin discussed above argue that endocytosis may not always be necessary. \nFurthermore Diwaker et al demonstrated that opossum kidney proximal tubular cells, \nwhich show avid albumin endocytosis, and HKC-8 proximal tubular cells, which \ndisplay negligible albumin endocytosis, released an equivalent amount of TGF  when \nexposed to albumin (12). We recently studied the release of MCP-1 by mouse primary \ncultures of PTEC. These cells exhibit substantial albumin endocytosis that can be \nsimilarly blocked by both statins and thiazolidinediones, but only statins had the \nability to block MCP-1 production (13). Therefore absent or inhibited endocytosis is \ninsufficient to protect PTEC from adverse effects of albumin exposure.  \nAre Other Receptors for Proteins Present in PTEC? \n In non-renal tissues other albumin binding proteins are described. The \nneonatal Fc receptor (FcRn) transfers passive humoral immunity from the mother to \nthe fetus, but also serves to conserve IgG by protecting it from degradation throughout \nlife. In addition to binding IgG the FcRn also binds albumin, diverting it from \ndegradative pathways and increasing its circulating half-life (14). In the kidney FcRn \nis located in podocytes and PTEC. Recent work has shown that podocyte FcRn \ninternalises and clears IgG from the glomerular basement membrane (15). The \n 10 \nfunction of FcRn expressed in the PT is undetermined, but clearly this would be well \nplaced to mediate re-absorption of filtered albumin and IgG.  \nOther scavenger receptors are present in the luminal membrane of PTEC. In \nparticular, altered PTEC expression of CD36 has been noted in several models of \nrenal disease (16). CD36 interacts with a variety of ligands including long chain fatty \nacids, modified LDL, and advanced glycation end products. Increased expression of \nCD36 appears to sensitise PTEC to apoptosis in diabetic nephropathy and may \nmediate inflammatory and albumin-induced pro-fibrotic responses in PTEC (16). \nAlbumin is a carrier of long chain fatty acids in the circulation. In proteinuria the \namounts of albumin bound fatty acid are greatly increased and these are carried with \nalbumin into the PT. Potentially therefore filtered albumin may interact with PTEC \nCD36 by virtue of its fatty acid load, although this remains to be demonstrated. \nSummary  \nThe study of albuminuria and proteinuric nephropathy has revealed key \ninformation about the mechanisms of chronic kidney disease and illuminated new \nfunctions for albumin. Unequivocal signalling events induced by filtered proteins \noccur in PTEC. Once controversial signalling effects of albumin are now explained \nand justified by new information about albumin receptors in PTEC. Several \ninteresting new players are emerging and deserve further investigation. Given the \nimportance of proteinuria as both a marker and maker of kidney and cardiovascular \ndisease, it seems likely that proteinuria\/receptor interactions will remain a vital area \nfor research the quest for new pharmacological targets in the fight against some of the \nmost important public health problems.  \n \n 11 \nREFERENCES \n1. Pollock C, Poronnik P. Albumin transport and processing by the proximal tubule: \nphysiology and pathophysiology. Curr Opin Nephrol Hypertens 2007; 16: 359-\n364. \n2. Geckle M. Renal tubule albumin transport. Ann Rev Physiol 2005; 67: 573-594.  \n3. Yuseff MI, Farfan P, Bu G, Marzolo MP. A cytoplasmic PPPSP motif determines \nmegalin’s phosphorylation and regulates receptors recycling and surface \nexpression. Traffic 2007; 8: 1215-1230 \n4. Gotthardt M, Trommsdorff M, Nevitt M, Shelton J, Richardson JA, Stockinger W, \nNimpf J, Herz J. Interactions of the low density lipoprotein receptor gene family \nwith cytosolic adaptor and scaffold proteins suggest diverse biological functions \nin cellular communication and signal transduction. J Biol Chem 2000: 275: \n25616-25624. \n5. Caruso-Neves C, Pinherio AAS, Cai H, Souza-Menezes J, Guggino WB. PKB and \nmegalin determine the survival or death of renal proximal tubule cells. Proc Natl \nAcad Sci USA. 2006; 103: 18810-18815. \n6. Theilig F, Kriz W, Jerichow T, Schrade P, Hähnel B, Willnow T, Le Hir M, \nBachmann S. Abrogation of Protein Uptake through Megalin-Deficient Proximal \nTubulules Does Not Safeguard against Tubulointerstitial Injury. JASN 2007; 18: \n1824-1834 \n7. Biemesderfer D. Regulated intramembrane proteolysis of megalin: Linking \nurinary protein and gene regulation in the proximal tubule?  Kidney Int 2005; 69: \n1717-1721 \n 12 \n8. Li Y, Cong R, Biemesderfer D. The C-terminus of megalin regulates gene \nexpression in opossum kidney proximal tubule (OKP) cells. Am J Physiol Cell \nPhysiol 2008 Articles in Press. (May 21, 2008). doi:10.1152\/ajpcell.00037.2008 \n9. Reich H, Tritchler D, Herzenberg AM, Kassiri Z, Zhou X, Gao W, Scholey JW. \nAlbumin activates ERK via EGF receptor in human renal epithelial cells. J Am \nSoc Nephrol 2005; 16: 1266-1278. \n10. Gesualdo L, Di Paolo S, Calabro A, Milani S, Maiorano E, Ranieri E, Pannarale \nG, Schena FP. Expression of epidermal growth factor and its receptor in normal \nand diseased human kidney: An immunohistochemical and in situ hybridization \nstudy. Kidney Int 1996; 49: 656-665 \n11. Carpenter G. EGF receptor transactivation mediated by the proteolytic production \nof EGF-like agonists. Sci STKE 2000; 15: 1-2 \n12. Diwaker R, Pearson AC, Colville-Nash P, Brunskill NJ, Dockrell MEC. The role \nplayed by endocytosis in albumin-induced secretion of TGFβ-1 by proximal tubular \nepithelial cells. Am J Physiol 2007; 292: F1464-F1470. \n13. Chana RS, Sidaway JE, Brunskill NJ. Statins but not thiazolidinediones attenuate \nalbumin-mediated chemokine production by proximal tubular cells independently of \nendocytosis. Am J Nephrol 2008 (in press).  \n14. Anderson CL, Chaudhury C, Kim J, Bronson CL, Wani MA, Mohanty S. \nPerspective – FcRn transports albumin: relevance to immunology and medicine. \nTrends Immunol 2006; 27: 343-348.  \n15. Akilesh S, Huber TB, Wu H, Wang G, Hartleben B, Kopp JB, Miner JH, Derry C. \nRoopenian DC, Unanue ER, Shaw AS. Podocytes use FcRn to clear IgG from the \nglomerular basement membrane. Proc Natl Acad Sci USA 105, 967-972, 2008. \n 13 \n16. Okamura DM, Lopez-Guisa JM, Koelsch K, Collins K, Eddy AA. Atherogenic \nscavenger receptor modulation in the tubulointerstitium in response to chronic renal \ninjury. Am J Physiol 2007; 293: F575-F585. \n \n 14 \nTable 1.  \nAlterations in PTEC signalling, transcription factor activity and secretory \nphenotype demonstrated under proteinuric conditions in-vitro and in-vivo (see \nreferences 1 and 2 and the further references therein). \nSignalling Mediators \nStimulated \nTranscription \nFactors Altered \nMediators \nReleased \nERK ½ \nMEK1 \np38 MAP kinase \nc-jun n-terminal kinase  \nRibosomal p70\nS6\n \nkinase \n \nProtein kinase C \nProtein kinase B \nPI 3-kinase \nNAD(P)H oxidase \nIntracellular [Ca\n2+\n] \n(increased) \n \nNF B \nAP-1 \nElk-1 \nSTAT \nHIF\/HRE (reduced) \nPPAR  (by albumin \nbound fatty acids) \n \nEndothelin-1 \nMCP-1 \nRANTES \nFractalkine \nInterleukin-8 \nOsteopontin \nTGF-\nTNF-\nConnective tissue \ngrowth  factor \n \nFibronectin \nCollagen \nComplement  \nReactive oxygen \nspecies \n \n \n  \n"}