{"doi":"10.1140\/epjc","coreId":"66395","oai":"oai:dro.dur.ac.uk.OAI2:1603","identifiers":["oai:dro.dur.ac.uk.OAI2:1603","10.1140\/epjc"],"title":"Towards high-precision predictions for the MSSM Higgs sector.","authors":["Weiglein, G.","Degrassi, G.","Heinemeyer, S.","Hollik, W.","Slavich, P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05","abstract":"The status of the evaluation of the MSSM Higgs sector is reviewed. The phenomenological impact of recently obtained corrections is discussed. In particular it is shown that the upper bound on mh within the MSSM is shifted upwards. Consequently, lower limits on tanb obtained by confronting the upper bound as function of tanb with the lower bound on mh from Higgs searches are significantly weakened. Furthermore, th e region in the MA-tanb-plane where the coupling of the lightest Higgs boson to down-type fermions is suppressed is modified. The presently not calculated higher-order corrections to the Higgs-boson mass matrix are estimated to shift the mass of the lightest Higgs boson by up to 3 GeV.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66395.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1603\/1\/1603.pdf","pdfHashValue":"d1bccc4ed7c463ed124ce06b5c6b37aed886023a","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1603<\/identifier><datestamp>\n      2011-08-09T10:52:48Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Towards high-precision predictions for the MSSM Higgs sector.<\/dc:title><dc:creator>\n        Weiglein, G.<\/dc:creator><dc:creator>\n        Degrassi, G.<\/dc:creator><dc:creator>\n        Heinemeyer, S.<\/dc:creator><dc:creator>\n        Hollik, W.<\/dc:creator><dc:creator>\n        Slavich, P.<\/dc:creator><dc:description>\n        The status of the evaluation of the MSSM Higgs sector is reviewed. The phenomenological impact of recently obtained corrections is discussed. In particular it is shown that the upper bound on mh within the MSSM is shifted upwards. Consequently, lower limits on tanb obtained by confronting the upper bound as function of tanb with the lower bound on mh from Higgs searches are significantly weakened. Furthermore, th e region in the MA-tanb-plane where the coupling of the lightest Higgs boson to down-type fermions is suppressed is modified. The presently not calculated higher-order corrections to the Higgs-boson mass matrix are estimated to shift the mass of the lightest Higgs boson by up to 3 GeV.\\ud\n<\/dc:description><dc:subject>\n        Feynman-diagrammatic approach<\/dc:subject><dc:subject>\n         Boson masses<\/dc:subject><dc:subject>\n         Radiative-corrections<\/dc:subject><dc:subject>\n         Fermilab tevatron<\/dc:subject><dc:subject>\n         Quark mass<\/dc:subject><dc:subject>\n         Supersymmetry<\/dc:subject><dc:subject>\n         Unification<\/dc:subject><dc:subject>\n         Phenomenology<\/dc:subject><dc:subject>\n         Couplings<\/dc:subject><dc:subject>\n         Spectrum.<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        European physical journal C, 2003, Vol.28(1), pp.133-143 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1603<\/dc:identifier><dc:identifier>\n        issn:1434-6044<\/dc:identifier><dc:identifier>\n        issn: 1434-6052<\/dc:identifier><dc:identifier>\n        doi:10.1140\/epjc\/s2003-01152-2<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1603\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1140\/epjc\/s2003-01152-2<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1603\/1\/1603.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1434-6044"," 1434-6052","issn:1434-6044","issn: 1434-6052"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Feynman-diagrammatic approach","Boson masses","Radiative-corrections","Fermilab tevatron","Quark mass","Supersymmetry","Unification","Phenomenology","Couplings","Spectrum."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n08 May 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWeiglein, G. and Degrassi, G. and Heinemeyer, S. and Hollik, W. and Slavich, P. (2003) ’Towards\nhigh-precision predictions for the MSSM Higgs sector.’, European physical journal C., 28 (1). pp. 133-143.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1140\/epjc\/s2003-01152-2\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nWeiglein, G. and Degrassi, G. and Heinemeyer, S. and Hollik, W. and Slavich, P. \n(2003) 'Towards high-precision predictions for the MSSM Higgs sector.' , European \nphysical journal C., 28 (1), pp. 133-143 \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1140\/epjc\/s2003-01152-2 \nar\nX\niv\n:h\nep\n-p\nh\/\n02\n12\n02\n0v\n2 \n 2\n1 \nFe\nb \n20\n03\nDCPT\/02\/126 IPPP\/02\/63\nLMU 11\/02 MPI-PhT\/2002-73\nRM3-TH\/02-19 LC-TH-2002-015\nhep-ph\/0212020\nTowards High-Precision Predictions\nfor the MSSM Higgs Sector\nG. Degrassi1∗, S. Heinemeyer2†, W. Hollik3‡, P. Slavich3,4§ and G. Weiglein5¶\n1 Dipartimento di Fisica, Universita` di Roma III and INFN, Sezione di Roma III,\nVia della Vasca Navale 84, I–00146 Rome, Italy\n2Institut fu¨r Theoretische Elementarteilchenphysik, LMU Mu¨nchen,\nTheresienstr. 37, D–80333 Munich, Germany\n3Max-Planck-Institut fu¨r Physik (Werner-Heisenberg-Institut),\nFo¨hringer Ring 6, D–80805 Munich, Germany\n4Institut fu¨r Theoretische Physik, Universita¨t Karlsruhe,\nKaiserstrasse 12, Physikhochhaus, D–76128 Karlsruhe, Germany\n5Institute for Particle Physics Phenomenology, University of Durham,\nDurham DH1 3LE, UK\nAbstract\nThe status of the evaluation of the MSSM Higgs sector is reviewed. The phe-\nnomenological impact of recently obtained corrections is discussed. In particular it\nis shown that the upper bound on mh within the MSSM is shifted upwards. Conse-\nquently, lower limits on tan β obtained by confronting the upper bound as function\nof tanβ with the lower bound on mh from Higgs searches are significantly weakened.\nFurthermore, the region in theMA–tan β-plane where the coupling of the lightest Higgs\nboson to down-type fermions is suppressed is modified. The presently not calculated\nhigher-order corrections to the Higgs-boson mass matrix are estimated to shift the\nmass of the lightest Higgs boson by up to 3 GeV.\n∗email: giuseppe.degrassi@roma3.infn.it\n†email: Sven.Heinemeyer@physik.uni-muenchen.de\n‡email: hollik@mppmu.mpg.de\n§email: slavich@mppmu.mpg.de\n¶email: Georg.Weiglein@durham.ac.uk\n1 Introduction\nA crucial prediction of the Minimal Supersymmetric Standard Model (MSSM) [1] is the\nexistence of at least one light Higgs boson. The search for this particle is one of the main\ngoals at the present and the next generation of colliders. Direct searches at LEP have already\nruled out a considerable fraction of the MSSM parameter space, and the forthcoming high-\nenergy experiments at the Tevatron, the LHC and a future Linear Collider (LC) will either\ndiscover a light Higgs boson or rule out the MSSM as a viable theory for physics at the weak\nscale. Furthermore, if one or more Higgs bosons are discovered, their masses and couplings\nwill be determined with high accuracy at a future LC. Thus, a precise knowledge of the\ndependence of the masses and mixing angles of the MSSM Higgs sector on the relevant\nsupersymmetric parameters is of utmost importance to reliably compare the predictions of\nthe MSSM with the (present and future) experimental results.\nWe recall that the Higgs sector of the MSSM [2] consists of two neutral CP-even Higgs\nbosons, h and H (mh < mH), the CP-odd A boson, and two charged Higgs bosons, H±. At\nthe tree-level, mh,tree and mH,tree can be calculated in terms of the Standard Model (SM)\ngauge couplings and two additional MSSM parameters, conventionally chosen as MA and\ntanβ, the ratio of the two vacuum expectation values (tanβ = v2\/v1). The two masses are\nobtained by rotating the neutral CP-even Higgs boson mass matrix with an angle α,\nM2,treeHiggs =\n(\nM2A sin\n2 β +M2Z cos\n2 β −(M2A +M2Z) sin β cosβ\n−(M2A +M2Z) sin β cosβ M2A cos2 β +M2Z sin2 β\n)\n, (1)\nwith α satisfying\ntan 2α = tan 2β\nM2A +M\n2\nZ\nM2A −M2Z\n, −pi\n2\n< α < 0. (2)\nIn the Feynman diagrammatic (FD) approach the higher-order corrected Higgs boson\nmasses are derived by finding the poles of the h,H-propagator matrix whose inverse is given\nby\n(∆Higgs)\n−1 = −i\n(\np2 −m2H,tree + ΣˆHH(p2) ΣˆhH(p2)\nΣˆhH(p\n2) p2 −m2h,tree + Σˆhh(p2)\n)\n, (3)\nwhere the Σˆ(p2) denote the renormalized Higgs-boson self-energies, p being the momen-\ntum flowing on the external legs. Determining the poles of the matrix ∆Higgs in eq. (3) is\nequivalent to solving the equation\n[\np2 −m2h,tree + Σˆhh(p2)\n] [\np2 −m2H,tree + ΣˆHH(p2)\n]\n−\n[\nΣˆhH(p\n2)\n]2\n= 0 . (4)\nThe status of the available results for the self-energy contributions to eq. (3) can be\nsummarized as follows. For the one-loop part, the complete result within the MSSM is\nknown [3,4,5,6]. The by far dominant one-loop contribution is the O(αt) term due to top and\nstop loops (αt ≡ h2t\/(4pi), ht being the superpotential top coupling). Concerning the two-loop\neffects, their computation is quite advanced and it has now reached a stage such that all the\npresumably dominant contributions are known. They include the strong corrections, usually\nindicated as O(αtαs), and Yukawa corrections, O(α2t ), to the dominant one-loop O(αt) term,\nas well as the strong corrections to the bottom\/sbottom one-loopO(αb) term (αb ≡ h2b\/(4pi)),\ni.e. the O(αbαs) contribution. The latter can be relevant for large values of tanβ . Presently,\n1\nthe O(αtαs) [7, 8, 9, 10, 11], O(α2t ) [7, 12, 13] and the O(αbαs) [14] contributions to the self-\nenergies are known for vanishing external momenta. In the (s)bottom corrections the all-\norder resummation of the tanβ -enhanced terms, O(αb(αs tan β)n), is also performed [15,16].\nIn this paper we are going to present, in view of the recent achievements obtained in\nthe knowledge of the two-loop corrections, updated results for various quantities of physical\ninterest. In our analysis we employ the latest version of the Fortran code FeynHiggs [17,18],\nnamely FeynHiggs1.3, that evaluates the MSSM neutral CP-even Higgs sector masses and\nthe mixing angle.\nThe paper is organized as follows: in Section 2 we give a brief summary of recent theoret-\nical improvements in the MSSM Higgs sector and describe the corresponding modifications\nin the code FeynHiggs in order to comprise all existing higher-order results. We compare\nthe results for mh obtained employing different approximations in the treatment of the two-\nloop corrections. In Section 3 we present the results for the phenomenological implications\nof our improved knowledge of the two-loop contributions to the Higgs boson self-energies.\nSection 4 contains a discussion of the presently unknown contributions in the prediction for\nthe CP-even Higgs-boson masses of the MSSM, and an estimate of their possible numerical\nimportance is given. Finally, in Section 5 we draw our conclusions.\n2 Recent improvements in the MSSM Higgs sector and\nimplementation in FeynHiggs\nIn order to discuss the impact of recent improvements in the MSSM Higgs sector we will\nmake use of the program FeynHiggs [17, 18], which is a Fortran code for the evaluation\nof the neutral CP-even Higgs sector of the MSSM including higher-order corrections to the\nrenormalized Higgs boson self-energies. The original release included the well known full one-\nloop corrections [3,4,5,6], the two-loop leading, momentum-independent, O(αtαs) correction\nin the top\/stop sector [8, 9, 11] as well as the two-loop leading logarithmic corrections at\nO(α2t ) [19,20]. By two-loop momentum-independent corrections here and hereafter we mean\nthe two-loop contributions to Higgs boson self-energies evaluated at zero external momenta.\nAt the one-loop level, the momentum-independent contributions are the dominant part of\nthe self-energy corrections, that, in principle, should be evaluated at external momenta equal\nto the poles of the h,H-propagator matrix, eq. (3).\nThe new version of FeynHiggs contains a modification in the one-loop part due to a\ndifferent renormalization prescription employed and includes also several new corrections to\nthe Higgs boson self-energies that have recently been calculated. These changes are described\nin the following subsections.\nWith the implementation of the latest results obtained in the MSSM Higgs sector, Feyn-\nHiggs comprises all available higher-order corrections and thus allows the presently most pre-\ncise prediction of the masses of the CP-even Higgs bosons and the corresponding mixing an-\ngle. The latest version of FeynHiggs, FeynHiggs1.3, can be obtained from www.feynhiggs.de.\n2.1 Hybrid renormalization scheme at the one-loop level\nFeynHiggs is based on the FD approach with on-shell renormalization conditions [9]. This\nmeans in particular that all the masses in the FD result are the physical ones, i.e. they\ncorrespond to physical observables. Since eq. (4) is solved iteratively, the result for mh\n2\nand mH contains a dependence on the field-renormalization constants of h and H , which\nis formally of higher order. Accordingly, there is some freedom in choosing appropriate\nrenormalization conditions for fixing the field-renormalization constants (this can also be\ninterpreted as affecting the renormalization of tanβ). Different renormalization conditions\nhave been considered in the literature, e.g. (Σˆ′ denotes the derivative with respect to the\nexternal momentum squared):\n1. on-shell renormalization for ΣˆZ , ΣˆA, Σˆ\n′\nA, ΣˆAZ , and δv1\/v1 = δv2\/v2 [6]\n2. on-shell renormalization for ΣˆZ , ΣˆA, ΣˆAZ , and δvi = δvi,div, i = 1, 2 [5, 21]\n3. on-shell renormalization for ΣˆZ , ΣˆA , DR renormalization (employing dimensional re-\nduction [22]) for δZh, δZH and tanβ [18].\nVersions of FeynHiggs previous than the 1.2 release were based on type-1 renormalization\nconditions, thus requiring the derivative of the A boson self-energy. The latest versions\nemploy instead the hybrid DR\/on-shell type 3 conditions [18]. The choice of a DR defini-\ntion1 for δZh, δZH and tanβ requires to specify a renormalization scale Q\n2 at which these\nparameters are defined. This scale is set to m2t in FeynHiggs, but can be changed by the\nuser. These new renormalization conditions lead to a more stable behavior around thresh-\nolds, e.g. MA = 2mt, and avoid unphysically large contributions in certain regions of the\nMSSM parameter space (a detailed discussion can be found in Ref. [23]; see also Ref. [24]).\n2.2 Two-loop O(α2t ) corrections\nIn the previous version of FeynHiggs the two-loop O(α2t ) corrections were implemented in\na simplified form, taken over from the result of [19, 20], obtained with the renormalization\ngroup (RG) method. The latter result included the two-loop leading logarithmic corrections,\nproportional to the square of t ≡ log (M2SUSY\/m2t ) (where MSUSY is a common scale for the\nsoft SUSY-breaking parameters), while the next-to-leading logarithmic terms, linear in t,\nwere not totally accounted for.\nRecently, the two-loop O(α2t ) corrections in the limit of zero external momentum became\navailable, first only for the lightest eigenvalue, mh, and in the limit MA ≫ MZ [12], then for\nall the entries of the Higgs propagator matrix for arbitrary values of MA [13]. They were\nobtained in the effective-potential approach, that allows to construct the Higgs boson self-\nenergies, at zero external momenta, by taking the relevant derivatives of the field-dependent\npotential. In this procedure it is important, in order to make contact with the physical\nMA, to compute the effective potential as a function of both CP-even and CP-odd fields,\nas emphasized in Ref. [11]. In the evaluation of the O(α2t ) corrections, the specification\nof a renormalization prescription for the Higgs mixing parameter µ is also required and\nit has been chosen as DR. In FeynHiggs1.3, which includes the complete two-loop O(α2t )\ncorrections, the corresponding renormalization scale is fixed to be the same as for δZh, δZH\nand tanβ.\nThe availability of the complete result for the momentum-independent part of the O(α2t )\ncorrections allows us to judge the quality of results that incorporate only the logarithmic\ncontributions. In Fig. 1 we plot the two-loop corrected mh as a function of the stop mixing\n1A minimal definition for tanβ and the field renormalization constants was already employed in Ref. [4],\nin the analysis of the one-loop (s)top–(s)bottom contribution to the Higgs boson self-energies.\n3\n-2000 -1000 0 1000 2000\nX\n t [GeV]\n80\n90\n100\n110\n120\n130\nm\nh \n[G\neV\n]\nO(αt αs)\nO(αt αs + αt\n2\n LL)\nO(αt αs + αt\n2\n NLL)\nO(αt αs + αt\n2\n full)\nFigure 1: Two-loop corrected mh as a function of Xt in various steps of approximation.\nThe relevant MSSM parameters are chosen as tanβ = 3 , mpolet = 174.3 GeV, Mt˜L = Mt˜R =\nMA = µ = 1 TeV and mg˜ = 800 GeV. The meaning of the different curves is explained in\nthe text.\nparameter, Xt ≡ At−µ\/ tanβ, where At denotes the trilinear soft SUSY breaking Higgs–stop\ncoupling. We use the following convention for the stop mass matrix,\nM2t˜ =\n(\nM2\nt˜L\n+m2t + cos 2β (\n1\n2\n− 2\n3\ns2W )M\n2\nZ mtXt\nmtXt M\n2\nt˜R\n+m2t +\n2\n3\ncos 2β s2WM\n2\nZ\n)\n. (5)\nFor simplicity, the soft SUSY breaking parameters in the diagonal entries of the stop mass\nmatrix, Mt˜L , Mt˜R , are chosen to be equal, Mt˜L = Mt˜R =MSUSY. For the numerical analysis\nMSUSY as well as MA and µ, are chosen to be all equal to 1 TeV, while the gluino mass\nis mg˜ = 800 GeV, and tanβ = 3. If not otherwise stated, in all plots below we choose\nthe trilinear couplings in the stop and sbottom sectors equal to each other, Ab = At, and\nset M2 = MSUSY, where M2 is the SU(2) gaugino mass parameter (the U(1) gaugino mass\nparameter is obtained via the GUT relation, M1 = 5\/3 s\n2\nW\/c\n2\nW M2).\nThe solid and dotted lines in Fig. 1 are computed with and without the inclusion of\nthe full O(α2t ) corrections, while the dashed and dot–dashed ones are obtained including\nonly the logarithmic contributions. In particular, the dashed curve corresponds to the result\nof [19], obtained with the one-loop renormalization group method. The dot–dashed curve,\n4\ninstead, corresponds to the leading and next-to-leading logarithmic terms that, within this\nsimplifying choice of the MSSM parameters, can be easily singled out from the complete\nO(α2t ) result. As mentioned above, the two approximate results agree with each other in\nthe terms proportional to t2, whereas they disagree in the terms linear in t, giving rise to\nthe difference between the dashed and dot–dashed curves. In fact, as long as one is only\nconcerned about the leading logarithmic terms, it is correct to use in the renormalization\ngroup equations (RGE) for the Higgs quartic couplings the one-loop β-function as is done\nin Ref. [19]. Moreover, the exact definition of the various parameters in the one-loop part\nis not important. Instead, when the next-to-leading logarithmic terms are examined the\ntwo-loop β-function has to be employed, giving rise to additional single logarithmic terms\nat the two-loop order. Furthermore, the results from [19] are valid under the assumption\nthat the one-loop part of the corrections is written in terms of running SM parameters in\nthe MS renormalization scheme, whereas the one-loop computation in FeynHiggs employs\non-shell parameters. As discussed in [20, 10, 25, 26], this amounts to a shift in the two-loop\ncorrections that also affects the next-to-leading logarithmic part of the O(α2t ) results.\nFrom Fig. 1 it can also be seen that, for small Xt, the full O(α2t ) result is very well\nreproduced by the logarithmic approximation, once the next-to-leading terms are correctly\ntaken into account. On the other hand, when Xt is large there are significant differences,\namounting to several GeV, between the logarithmic approximation and the full result. Such\ndifferences are due to non-logarithmic terms that scale like powers of Xt\/MSUSY. It should\nbe noted that for more general choices of the MSSM parameters the renormalization group\nmethod becomes rather involved (see e.g. [27], where the case of a large splitting between\nMt˜L and Mt˜R is discussed), and a suitable next-to-leading logarithmic approximation to the\nfull result is much more difficult to devise.\n2.3 Two-loop sbottom corrections\nDue to the smallness of the bottom mass, the O(αb) one-loop corrections to the Higgs boson\nself-energies can be numerically non-negligible only for tanβ ≫ 1 and sizable values of the\nµ parameter. In fact, at the classical level hb\/ht = (mb\/mt) tanβ, thus tanβ ≫ 1 is needed\nin order to have αb ∼ αt in spite of mb ≪ mt. In contrast to the O(αt) corrections where\nboth top and stop loops give sizable contributions, in the case of the O(αb) corrections the\nnumerically dominant contributions come from sbottom loops: those coming from bottom\nloops are always suppressed by the small value of the bottom mass. A sizable value of µ is\nthen required to have sizable sbottom–Higgs scalar interactions in the large-tanβ limit.\nThe relation between the bottom-quark mass and the Yukawa coupling hb, which controls\nalso the interaction between the Higgs fields and the sbottom squarks, reads at lowest order\nmb = hbv1\/\n√\n2. This relation is affected at one-loop order by large radiative corrections\n[15], proportional to hbv2, giving rise in general to tanβ-enhanced contributions. These\nterms proportional to v2, often indicated as threshold corrections to the bottom mass, are\ngenerated either by gluino–sbottom one-loop diagrams, resulting in O(αbαs) corrections to\nthe Higgs masses, or by chargino–stop ones, giving O(αbαt) corrections. Because the tanβ-\nenhanced contributions can be numerically relevant, an accurate determination of hb from\nthe experimental value of the bottom mass requires a resummation of such effects to all\norders in the perturbative expansion, as described in Ref. [16].\nConcerning the sbottom corrections to the renormalized Higgs boson self-energies, the\nversion 1.2.2 of FeynHiggs included the full one-loop contribution, improved by the resumma-\n5\n20 25 30 35 40 45 50\ntanβ\n80\n90\n100\n110\n120\nm\nh \n[G\neV\n]\nno O(α\ns\nαb)\nO(α\ns\nαb) resummed\nfull O(α\ns\nαb)\nFigure 2: The result for the lightest CP-even Higgs-boson mass in the MSSM, mh, as\nobtained with the program FeynHiggs is shown as a function of tan β for MA = 120 GeV,\nµ = −1 TeV, Mt˜L = Mt˜R = Mb˜R = mg˜ = 1 TeV, At = Ab = 2 TeV. The meaning of the\ndifferent curves is explained in the text.\ntion of the tanβ-enhanced effects in the relation between hb and mb according to the effective\nLagrangian formalism developed in Ref. [16]. This takes into account the O(αb(αs tanβ)n)\ncorrections to all orders in n. Numerically this is by far the dominant part of the contribu-\ntions from the sbottom sector.\nVery recently, the complete two-loop, momentum-independent, O(αbαs) corrections (which\nare not included in the O(αb(αs tan β)n) resummation) have been computed [14]. The result\nobtained makes use of an appropriate choice of renormalization conditions on the relevant\nparameters that allows to disentangle the genuine two-loop effects from the large thresh-\nold corrections to the bottom mass, and also ensures the decoupling of heavy gluinos. The\ncomplete momentum-independent O(αbαs) corrections have now also been implemented in\nFeynHiggs1.3.\nTo appreciate the importance of the various sbottom contributions, we plot in Fig. 2 the\nlight Higgs mass mh as a function of tan β. The SM running bottom mass computed at the\ntop mass scale, mb(mt) = 2.74 GeV, is used in order to account for the universal large QCD\ncorrections. The relevant MSSM parameters are chosen as MA = 120 GeV, µ = −1 TeV,\nMt˜L = Mt˜R = Mb˜R = mg˜ = 1 TeV, At = Ab = 2 TeV (where Mb˜R is a soft SUSY breaking\n6\nparameter in the sbottom sector). The dot–dashed curve in Fig. 2 includes the full one-loop\ncontribution as well as the two-loop O(αtαs+α2t ) corrections (the latter being approximately\ntanβ-independent when tanβ is large). The dashed curve includes also the resummation of\nthe tanβ-enhanced threshold effects in the relation between hb and mb. Finally, the solid\ncurve includes in addition the complete O(αbαs) two-loop corrections of [14]. In the last\ntwo curves, the steep dependence of mh on tan β when the latter is large is driven by the\nsbottom contributions. We see that, although the tanβ-enhanced threshold effects account\nfor the bulk of the sbottom contributions beyond one-loop, the genuine O(αbαs) two-loop\ncorrections can still shift mh by several GeV for large values of tanβ and µ.\n2\n3 Phenomenological implications\nThe improved knowledge of the two-loop contributions to the Higgs-boson self-energies re-\nsults in a very precise prediction for the Higgs-boson masses and mixing angle with interesting\nimplications for MSSM parameter space analyses. In this section we are going to discuss\npossible implications on the upper limit on mh within the MSSM and on the correspond-\ning limit on tanβ arising from confronting the upper bound on mh with the lower limit\nfrom Higgs searches. We furthermore investigate the modifications that are induced in the\ncouplings of the lightest Higgs boson to the down-type fermions.\n3.1 Limits on mh and tanβ\nThe theoretical upper bound on the lightest Higgs-boson mass as a function of tan β can be\ncombined with the results from direct searches at LEP to constrain tan β. The diagonaliza-\ntion of the tree-level mass matrix, eq. (1), yields a value for mh,tree that is maximal when\nMA ≫ MZ , in which case m2h,tree ≃ M2Z cos2 2β , which vanishes for tanβ = 1. Radiative\ncorrections significantly increase the light Higgs-boson mass compared to its tree-level value,\nbut still mh is minimized for values of tanβ around one. Thus, in principle, the region of low\ntanβ can be probed experimentally via the search for the lightest MSSM Higgs boson [28].\nIf the remaining MSSM parameters are tuned in such a way to obtain the maximal value of\nmh as a function of tanβ (for reasonable values of MSUSY and taking into account the ex-\nperimental uncertainties of mt and the other SM input parameters as well as the theoretical\nuncertainties from unknown higher-order corrections), the experimental lower bound on mh\ncan be used to obtain exclusion limits for tanβ. While in general a detailed investigation of\na variety of different possible production and decay modes is necessary in order to determine\nwhether a particular point of the MSSM parameter space can be excluded via the Higgs\nsearches or not, the situation simplifies considerably in the region of small tanβ values. In\nthis parameter region the lightest CP-even Higgs boson of the MSSM couples to the Z bo-\nson with SM-like strength, and its decay into a bb¯ pair is not significantly suppressed. Thus,\nwithin good approximation, constraints on tanβ can be obtained in this parameter region by\nconfronting the exclusion bound on the SM Higgs boson with the upper limit on mh within\nthe MSSM. We use this approach below in order to discuss the implications of the new mh\nevaluation on tan β exclusion bounds.\n2In the region of large tanβ the bottom Yukawa coupling receives large corrections, see eq. (8) below.\nFor the parameter range shown in Fig. 2 the quantity ∆b, defined in eq. (8), is negative but does not get\nclose to −1, |∆b| <∼ 0.6. Thus, the perturbative treatment in Fig. 2 seems to be justified.\n7\nConcerning the upper bound onmh within the MSSM, the one-loop corrections contribute\npositively to m2h. The two-loop effects of O(αtαs) and O(α2t ), on the other hand, enter\nwith competing signs, the former reducing m2h while the latter giving a (smaller) positive\ncontribution. The actual bound that can be derived depends sensitively on the precise value\nof the top-quark mass, because the dominant one-loop contribution to m2h, as well as the\ntwo-loop O(αtαs) term, scale as m4t . Furthermore, a large top mass amplifies the relative\nimportance of the two-loop O(α2t ) correction, because of the additional m2t factor.\nIn order to discuss restrictions on the MSSM parameter space it has become customary\nin the recent years to refer to so-called benchmark scenarios of MSSM parameters [29, 30].\nThe mmaxh benchmark scenario [29] has been designed such that for fixed values of mt and\nMSUSY the predicted value of the lightest CP-even Higgs-boson mass is maximized for each\nvalue of MA and tanβ. The value of the top-quark mass is fixed to its experimental central\nvalue, mt = 174.3 GeV, while the SUSY parameters are taken as (referring to their on-shell\nvalues according to the FD result as implemented in FeynHiggs):\nMSUSY = 1 TeV, µ = −200 GeV, M2 = 200 GeV,\nXFDt = 2MSUSY, Ab = At, mg˜ = 0.8MSUSY , (6)\nand we will investigate below the case MA = 1 TeV.\nIn Fig. 3 we plot mh as a function of tanβ in the m\nmax\nh scenario. The dashed and solid\ncurves correspond to the result obtained with the previous (used for the LEP evaluations\nso far [28]) and the latest (which will be used for the final LEP evaluations [31]) versions\nof FeynHiggs, respectively. The two versions, FeynHiggs1.0 and FeynHiggs1.3, differ by the\nrecent improvements obtained in the MSSM Higgs sector which are described in Sect. 2.\nFor comparison, also the result obtained with a renormalization-group improved effective\npotential method is indicated. The dotted curve in Fig. 3 corresponds to the code subh-\npoledm [19,26,16] in the mmaxh scenario, for a t˜ mixing parameter X\nMS\nt =\n√\n6MSUSY [19,26].\nIt deviates from the result of FeynHiggs1.0 by typically not more than 1 GeV for tanβ ≥ 1.\nThe LEP exclusion bound for the mass of a SM-like Higgs [32], MSMH ≥ 114.4 GeV, is shown\nin the figure as a vertical long–dashed line. As can be seen from the figure, the improvements\non the theoretical prediction described in Sect. 2, in particular the inclusion of the complete\nmomentum-independent O(α2t ) corrections into FeynHiggs, gives rise to a significant increase\nin the upper bound on mh as a function of tanβ. Comparison of this prediction with the\nexclusion bound on a SM-like Higgs shows that the lower limit on tanβ is considerably\nweakened.\nConcerning the interpretation of the results shown in Fig. 3, it should be kept in mind\nthat in the mmaxh benchmark scenario mt and MSUSY are kept fixed, and no theoretical\nuncertainties from unknown higher-order corrections are taken into account. In order to\narrive at a more general exclusion bound on tanβ that is not restricted to a particular\nbenchmark scenario, the impact of the parametric and higher-order uncertainties in the\nprediction for mh has to be considered [33]. In order to demonstrate in particular the\ndependence of the tan β exclusion bound on the chosen value of the top pole mass, the dot–\ndashed curve in Fig. 3 shows the result obtained with FeynHiggs1.3 where the top-quark\nmass has been increased by one standard deviation, σmt = 5.1 GeV, to mt = 179.4 GeV,\nand MSUSY has been changed from 1 TeV to 2 TeV. It can be seen that in this more general\nscenario no lower limit on tanβ from the LEP Higgs searches can be obtained.\nConstraints from the Higgs searches at LEP do of course play an important role in regions\nof the MSSM parameter space where the parameters are such that mh does not reach its\n8\n80 90 100 110 120 130 140 150\nmh [GeV]\n1\n10\nta\nnβ\nmh\nmax\n scen., RGiEP\nmh\nmax\n scen., FH1.0\nmh\nmax\n scen., FH1.3\nmt -> mt + σmt\nMSUSY = 1 TeV -> 2 TeV\nSM exclusion bound\nFigure 3: The result for the lightest CP-even Higgs-boson mass, mh, as a function of tan β\nin the mmaxh scenario. The dotted curve has been obtained with a renormalization-group\nimproved effective potential method, using the code subhpoledm. The dashed curve corre-\nsponds to the result obtained with FeynHiggs1.0, while the full curve shows the result of\nFeynHiggs1.3, where the improvements described in Sect. 2 are included. The dot-dashed\ncurve, also obtained with FeynHiggs1.3, employs mt = 179.4 GeV and MSUSY = 2 TeV. The\nvertical long-dashed line corresponds to the LEP exclusion bound for the SM Higgs boson\nof 114.4 GeV.\nmaximum value. Also in this case, however, the remaining theoretical uncertainties from\nunknown higher-order corrections (see Sect. 4 below) have to be taken into account in order\nto obtain conservative exclusion limits.\n3.2 Higgs couplings to fermions\nThe tree-level couplings of the lightest CP-even Higgs boson to the up-type and down-type\nSM fermions read, respectively:\nΓuh =\ni emu\n2 sW MW\n− cosα\nsin β\n, Γ dh =\ni emd\n2 sW MW\nsinα\ncosβ\n, (7)\nwhere the factors involving α and β reflect the changes in the MSSM compared to the SM\ncouplings. In the limit of MA ≫ MZ , α ∼ β − pi\/2 so that the SM limit is recovered.\n9\nFor the lightest CP-even Higgs boson the decay to two bottom quarks is usually the main\ndecay mode, while the decay to τ leptons has usually the second largest branching ratio.\nHowever, these channels are also most significantly affected by loop corrections, which can\nchange the situation described above quantitatively and even qualitatively. The two main\nsources (besides the SM QCD corrections) are the Higgs-boson propagator corrections and\nthe corrections modifying the relation between the bottom quark or τ lepton mass and the\ncorresponding Yukawa couplings.\nConcerning the former, it has been shown analytically [21, 34] that the momentum-\nindependent contributions coming from the Higgs-boson propagator corrections can be in-\ncorporated by replacing the tree-level angle α in eq. (7) with an effective angle αeff , which\ndiagonalizes the Higgs-boson mass matrix including the self-energy corrections evaluated\nat zero external momentum. Due to the effect of the higher-order corrections, αeff ≈ 0 is\npossible, i.e. the coupling of the lightest Higgs boson to the down-type SM fermions can\nvanish.\nThe other potentially large corrections to the Γ dh couplings come from the tan β-enhanced\nthreshold effects in the relation between the down-type fermion mass and the corresponding\nYukawa coupling [15], already mentioned in Sect. 2.3. A simple way to take into account\nthese effects is to employ the effective lagrangian formalism of Refs. [16, 35], where the cou-\npling of the lightest Higgs boson to down-type fermions (expressed through the fermion\nmass) is modified according to\n(\nΓ dh\n)\neff\n=\ni emd\n2 sW MW\nsinαeff\ncosβ\n[\n1− ∆d\n1 + ∆d\n(1 + cotαeff cotβ)\n]\n, (8)\nwhere ∆d contains the tan β-enhanced terms, and other subleading (i.e. non tanβ-enhanced)\ncorrections have been omitted. In the case of the coupling to the bottom quarks, the leading\ncontributions to ∆b are of O(αs) and O(αt), coming from diagrams with sbottom–gluino and\nstop–chargino loops, respectively. In the case of the τ leptons, the leading contributions are\nof O(ατ ), coming from sneutrino–chargino loops. The terms containing ∆d in eq. (8) may\nbe relevant for large tanβ and moderate values of MA. When MA is much bigger than MZ ,\nthe product cotαeff cotβ tends to −1, and the SM limit is again recovered.\nThe effects of the higher-order corrections to the couplings of the lightest Higgs boson\nto the down-type fermions appear very pronounced in the “small αeff” scenario [29], corre-\nsponding to the following choice of MSSM parameters:\nmt = 174.3 GeV, MSUSY = 800 GeV, X\nFD\nt = −1100 GeV\nµ = 2.5MSUSY, M2 = 500 GeV, Ab = At, mg˜ = 500 GeV . (9)\nIn the upper row of Fig. 4 we show the ratio sin2 αeff\/ cos\n2 β in the MA–tan β plane,\nevaluated in the “small αeff” scenario. As explained above, replacing α by αeff in the tree-level\ncouplings of eq. (7) gives rise to regions in the MA–tanβ plane where the effective coupling\nof the lightest Higgs boson to the down-type fermions is significantly suppressed with respect\nto the Standard Model. The region of significant suppression of sin2 αeff\/ cos\n2 β as evaluated\nwith FeynHiggs1.0, i.e. without the inclusion of the sbottom corrections beyond one-loop\norder, is shown in the upper left plot. The upper right plot shows the corresponding result\nas evaluated with FeynHiggs1.3, where the O(αbαs) and O(αb(αs tan β)n) corrections as well\nas the new O(α2t ) ones are included. The new corrections are seen to have a drastic impact on\nthe region where sin2 αeff\/ cos\n2 β is small. While without the new corrections a suppression\n10\n0 100 200 300 400 500\nMA [GeV]\n0\n10\n20\n30\n40\n50\nta\nnβ\nFH1.0: sin2α\neff\/cos\n2β\n0.3 - 0.2\n0.2 - 0.1\n0.1 - 0.0\n0 100 200 300 400 500\nMA [GeV]\n0\n10\n20\n30\n40\n50\nta\nnβ\nFH1.3: sin2α\neff\/cos\n2β\n0.3 - 0.2\n0.2 - 0.1\n0.1 - 0.0\n0 100 200 300 400 500\nMA [GeV]\n0\n10\n20\n30\n40\n50\nta\nnβ\nFH1.3: Γ(h -> bb): MSSM\/SM\n0.3 - 0.2\n0.2 - 0.1\n0.1 - 0.0\nFigure 4: Regions of significant suppression of the coupling of h to down-type fermions\nin the MA–tanβ-plane within the “small αeff” benchmark scenario. The upper left plot\nshows the ratio sin2 αeff\/ cos\n2 β as evaluated with FeynHiggs1.0 (i.e. without O(αbαs) and\nO(αb(αs tanβ)n) corrections), while the upper right plot shows the same quantity as evalu-\nated with FeynHiggs1.3 (i.e. including these corrections). The plot in the lower row shows\nthe ratio Γ(h → bb¯)MSSM \/Γ(h → bb¯)SM, i.e. the partial width for h → bb¯ normalized to its\nSM value, where the other term in eq. (8) and further genuine loop corrections are taken\ninto account (see text).\nof 70% or more occurs only in a small area of the MA–tanβ-plane for 20 <∼ tan β <∼ 40 and\n100 GeV <∼ MA <∼ 200 GeV, the region where sin2 αeff\/ cos2 β is very small becomes much\nlarger once these corrections are included. It now reaches from tanβ >∼ 15 to tan β > 50, and\nfrom MA >∼ 100 GeV to MA <∼ 350 GeV. The main reason for the change is that the one-\n11\nloop O(αb) corrections to the Higgs-boson mass matrix, which for large tanβ would prevent\nαeff from going to zero, are heavily suppressed by the resummation of the O(αb(αs tanβ)n)\ncorrections in the bottom Yukawa coupling. This kind of suppression depends strongly on\nthe chosen MSSM parameters, and especially on the sign of µ.\nIn order to interpret the physical impact of the effective coupling shown in the upper\nrow of Fig. 4, the ∆d terms in eq. (8) as well as further genuine loop corrections occuring in\nthe h → bb¯ process have to be taken into account. The effect of these contributions can be\nseen from the plot in the lower row of Fig. 4, where the ratio Γ(h→ bb¯)MSSM \/Γ(h→ bb¯)SM\nis shown, which has been evaluated by including all terms of eq. (8) as well as all further\ncorrections described in Ref. [34]. The region where the partial width Γ(h→ bb¯) within the\nMSSM is suppressed compared to its SM value is seen to be somewhat reduced and shifted\ntowards smaller values of MA as compared to the region where sin\n2 αeff\/ cos\n2 β is small.\n4 Estimate of the theoretical accuracy of the Higgs-\nboson mass determination\nThe prediction for mh in the MSSM is affected by two kinds of uncertainties, parametric\nuncertainties from the experimental errors of the input parameters and uncertainties from\nunknown higher-order corrections. While currently the parametric uncertainties dominate\nover those from unknown higher-order corrections, as the present experimental error of the\ntop-quark mass of about ±5 GeV induces an uncertainty of ∆mh ≈ ±5 GeV [33], at the next\ngeneration of colliders mt will be measured with a much higher precision, reaching the level\nof about 0.1 GeV at an e+e− LC [36]. Thus, a precise measurement of mh will provide a high\nsensitivity to SUSY loop effects and will in this way allow a stringent test of the MSSM,\nprovided that the uncertainties from unknown higher-order corrections are sufficiently well\nunder control.\nGiven our present knowledge of the two-loop contributions to the Higgs-boson self-\nenergies, the theoretical accuracy reached in the prediction for the CP-even Higgs-boson\nmasses is quite advanced. However, obtaining a complete two-loop result for the Higgs-\nboson masses and mixing angle requires additional contributions that are not yet available.\nIn this section we discuss the possible effect of the missing two-loop corrections, and we\nestimate the size of the higher-order (i.e. three-loop) contributions.\n4.1 Missing two-loop corrections\nIt is customary to separate the corrections to the Higgs boson self-energies into two parts:\ni) the momentum-independent part, namely the contributions to the self-energies evaluated\nat zero external momenta, which can also be computed in the effective potential approach;\nii) the momentum-dependent corrections, i.e. the effects induced by the dependence on the\nexternal momenta of the self-energies, that are required to determine the poles of the h,H-\npropagator matrix.\nAll the presently known two-loop contributions are computed at zero external momentum,\nand moreover they are obtained in the so-called gaugeless limit, namely by switching off the\nelectroweak gauge interactions. The two approximations are in fact related, since the leading\nYukawa corrections are obtained by neglecting both the momentum dependence and the\ngauge interactions. In order to systematically improve the result beyond the approximation\n12\nof the leading Yukawa terms, both effects from the gauge interactions and the momentum\ndependence should be taken into account.\nIn the limit where the momentum dependence and the gauge interactions are neglected,\nthe only missing contributions are the mixed two-loop Yukawa terms, O(αtαb), and the\nO(α2b) corrections (and analogous contributions proportional to the Yukawa couplings of\nthe other fermions and sfermions, which however are expected to give significantly smaller\ncontributions than the third generation quarks and scalar quarks). As in the case of the\nO(αbαs) corrections, they can be numerically relevant only for large values of tan β and of\nthe µ parameter. Concerning the O(αtαb) corrections, although their computation is not\nyet available, it is plausible to assume that the most relevant contributions are connected\nto the threshold effects in the bottom mass coming from chargino–stop loops [16], which\nare actually already implemented in FeynHiggs as an additional option. An estimate of the\nO(α2b) corrections for a simplified choice of the MSSM parameters is presented in Ref. [14].\nAccording to that discussion, their effect can be at most comparable to that of the genuine\nO(αbαs) corrections, the latter being exemplified in Fig. 2 by the difference between the\ndashed and solid curves.\nTo try to estimate, although in a very rough way, the importance of the various contri-\nbutions we look at their relative size in the one-loop part. There, in the effective potential\npart, the effect of the O(αt) corrections typically amounts to an increase in mh of 40–60\nGeV, depending on the choice of the MSSM parameters, whereas the corrections due to the\nelectroweak (D-term) Higgs–squark interactions usually decrease mh by less than 5 GeV [4].\nInstead, the purely electroweak gauge corrections to mh, namely those coming from Higgs,\ngauge boson and chargino or neutralino loops [6], are typically quite small at one-loop, and\ncan reach at most 5 GeV in specific regions of the parameter space (namely for large values\nof µ andM2). Concerning the effects induced by the dependence on the external momentum,\nas a general rule we expect them to be more relevant in the determination of the heaviest\neigenvalue mH of the Higgs-boson mass matrix, and when MA is larger than MZ . Indeed,\nonly in this case the self-energies are evaluated at external momenta comparable to or larger\nthan the masses circulating into the dominant loops. In addition, if MA is much larger than\nMZ , the relative importance of these corrections decreases, since the tree-level value of mH\ngrows with MA. In fact, the effect of the one-loop momentum-dependent corrections on mh\namounts generally to less than 2 GeV.\nAssuming that the relative size of the two-loop contributions follows a pattern similar\nto the one-loop part, we estimate that the two-loop diagrams involving D-term interactions\nshould induce a variation in mh of at most 1–2 GeV, while we expect those with pure gauge\nelectroweak interactions to contribute to mh not very significantly, probably of the order\nof 1 GeV or less. Given the smallness of the one-loop contribution it seems quite unlikely\nthat the effect of the momentum-dependent part of the O(αtαs) corrections to mh, which\nshould be the largest among this type of two-loop contributions, could be larger than 1 GeV.\nAs already said, the situation can, in principle, be different for the heavier Higgs-boson\nmass. However, the corrections to mH are relatively small in general and at one-loop level\nfor most parts of the MSSM parameter space the momentum-dependent corrections are not\nparticularly relevant. The momentum-dependent corrections turn out to be more relevant\nin processes where the H boson appears as an external particle, see Ref. [37].\nAnother way of estimating the uncertainties of the kind discussed above is to investigate\nthe renormalization scale dependence introduced via the DR definition of tanβ, µ, and the\nHiggs field renormalization constants. Varying the scale parameter between 0.5mt and 2mt\n13\ngives rise to a shift in mh of about ±1.5 GeV [23], in accordance with the estimates above.\n4.2 Estimate of the uncertainties from unknown three-loop cor-\nrections\nEven in the case that a complete two-loop computation of the MSSM Higgs masses is\nachieved, non-negligible uncertainties will remain, due to the effect of higher-order correc-\ntions. Although a three-loop computation of the Higgs masses is not available so far, it is\npossible to give at least a rough estimate for the size of these unknown contributions.\nA first estimate can be obtained by varying the renormalization scheme in which the\nparameters entering the two-loop part of the corrections are expressed. In fact, the resulting\ndifference in the numerical results amounts formally to a three-loop effect. Since theO(αtαs+\nα2t ) corrections are particularly sensitive to the value of the top mass, we compare the\npredictions for mh obtained using in the two-loop corrections either the top pole mass,\nmpolet = 174.3 GeV, or the SM running top mass mt, expressed in the MS renormalization\nscheme, i.e.\nmt ≡ mt(mt)MSSM ≃\nmpolet\n1 + 4αs(mt)\/3pi − αt(mt)\/2pi . (10)\nInserting appropriate values for the SM running couplings αs and αt we find mt =\n168.6 GeV. In Fig. 5 we show the effect of changing the renormalization scheme for mt\nin the two-loop part of the corrections. The relevant MSSM parameters are chosen as in\nFig. 1, i.e. tanβ = 3 , MSUSY =MA = µ = 1 TeV and mg˜ = 800 GeV. The dot–dashed and\ndotted curves show the O(αtαs) predictions for mh obtained using mpolet or mt, respectively,\nin the two-loop corrections. The solid and dashed curves, instead, show the corresponding\nO(αtαs+α2t ) predictions for mh. The difference in the two latter curves induced by the shift\nin mt, which should give an indication of the size of the unknown three-loop corrections, is\nof the order of 1–1.5 GeV. However, as can be seen from the figure, the effect of the shift in\nmt partially cancels between the O(αtαs) and O(α2t ) corrections and there is no guarantee\nthat such a compensating effect will appear again in the three-loop corrections.\nAn alternative way of estimating the typical size of the leading three-loop corrections\nmakes use of the renormalization group approach. If all the supersymmetric particles (in-\ncluding the CP-odd Higgs boson A) have mass MSUSY, and β = pi\/2, the effective theory\nat scales below MSUSY is just the SM, with the role of the Higgs doublet played by the\ndoublet that gives mass to the up-type quarks. In this simplified case, it is easy to apply\nthe techniques of Refs. [19, 20] in order to obtain the leading logarithmic corrections to mh\nup to three loops (see also Ref. [38]). Considering for further simplification the case of zero\nstop mixing, we find:\n(\n∆m2h\n)LL\n=\n3αtm\n2\nt\npi\nt\n[\n1 +\n(\n3\n8\nαt − 2αs\n)\nt\npi\n+\n(\n23\n6\nα2s −\n5\n4\nαsαt − 33\n64\nα2t\n)\nt2\npi2\n+ ...\n]\n,\n(11)\nwhere t = log (M2SUSY\/m\n2\nt ), mt is defined in eq. (10), αt and αs have to be interpreted as\nSM running quantities computed at the scale Q = mt, and the ellipses stand for higher\nloop contributions. It can be checked that, for MSUSY = 1 TeV, the effect of the three-loop\nleading logarithmic terms amounts to an increase in mh of the order of 1–1.5 GeV. If MSUSY\nis pushed to larger values, the relative importance of the higher-order logarithmic corrections\n14\n-2000 -1000 0 1000 2000\nX\n t [GeV]\n80\n90\n100\n110\n120\n130\nm\nh \n[G\neV\n]\nO(αt αs), mt\npole\nO(αt αs), mt\nrun\nO(αt αs + αt\n2), mt\npole\nO(αt αs + αt\n2), mt\nrun\nFigure 5: mh as a function of Xt, using either m\npole\nt or mt in the two-loop corrections.\nThe relevant MSSM parameters are chosen as tan β = 3 , MSUSY = MA = µ = 1 TeV and\nmg˜ = 800 GeV. For the different lines see text.\nobviously increases. In that case, it becomes necessary to resum the logarithmic corrections\nto all orders, by solving the appropriate renormalization group equations numerically. Since\nit is unlikely that a complete three-loop diagrammatic computation of the MSSM Higgs-\nboson masses will be available in the near future, it will probably be necessary to combine\ndifferent approaches (e.g. diagrammatic, effective potential and renormalization group), in\norder to improve the accuracy of the theoretical predictions up to the level required to\ncompare with the experimental results expected at the next generation of colliders.\nTo summarize this discussion, the uncertainty in the prediction for the lightest CP-even\nHiggs boson arising from not yet calculatated three-loop and even higher-order corrections\ncan conservatively be estimated to be 1–2 GeV. From the various missing two-loop corrections\nan uncertainty of less than 3 GeV is expected. However, it is extremely unlikely that all\nthese effects would coherently sum up, with no partial compensation among them. Therefore\nwe believe that a realistic estimate of the uncertainty from unknown higher-order corrections\nin the theoretical prediction for the lightest Higgs boson mass should not exceed 3 GeV.\n15\n5 Conclusions\nIn this paper we have discussed the phenomenological impact of recently obtained results\nin the MSSM Higgs sector. The new corrections have now been implemented in the code\nFeynHiggs, which in this way provides the currently most precise evaluation of the masses\nand mixing angles of the CP-even MSSM Higgs sector. We have analyzed the effects of these\nnew contributions by comparing the results obtained with FeynHiggs1.3, the newest version\nof the code that incorporates all these effects, with those derived with previous versions in\nwhich the two-loop O(α2t ) corrections were implemented via a renormalization group method\nand the sbottom corrections beyond one-loop were not taken into account.\nAs a result of these improvements the lower limits on tanβ that can be derived by com-\nbining the theoretical upper bound onmh with its experimental lower bound, are significantly\nweakened. We have also shown that, if the top-quark mass is increased by one standard de-\nviation, the constraint on tanβ completely disappears if the other MSSM parameters are\nsuch that mh takes its maximum value as a function of tanβ.\nConcerning the coupling of the lightest Higgs boson to the down-type fermions, that\nis related to the angle that diagonalizes the Higgs boson mass matrix including higher or-\nder corrections, we have shown that the area in the MA–tanβ-plane where its value gets\nsuppressed by 70% or more with respect to the SM one is significantly modified.\nFinally, we have given an estimate of the uncertainties related to the various kinds of\ntwo- and three-loop contributions to the Higgs boson masses that are still unknown. Since\nit is extremely unlikely that all these effects would coherently sum up, the uncertainty in\nthe theoretical prediction for the lightest MSSM Higgs boson mass from unknown two- and\nthree-loop corrections should not exceed 3 GeV.\nAcknowledgments\nG.D. and G.W. thank the Max-Planck-Institut fu¨r Physik in Munich for its kind hospitality\nduring part of this project. We furthermore thank M. Frank for helpful discussions. This\nwork was partially supported by the European Community’s Human Potential Programme\nunder contract HPRN-CT-2000-00149 (Collider Physics).\nNote added:\nWhile finalizing this paper, Ref. [39] appeared, containing the two-loop result formh obtained\nfrom the full two-loop effective potential of the MSSM [40]. The contributions included in\nRef. [39] that go beyond the ones discussed in this paper, namely momentum-independent\ncontributions for non-vanishing gauge interactions and D-term Higgs–squark interactions,\nturn out to yield a shift in mh of 1 GeV or less in the numerical results given in Ref. [39],\nthus confirming our estimate discussed in Sect. 4.1.\nReferences\n[1] H.P. Nilles, Phys. Rep. 110 (1984) 1;\nH.E. Haber and G.L. Kane, Phys. Rep. 117, (1985) 75;\nR. Barbieri, Riv. Nuovo Cim. 11, (1988) 1.\n16\n[2] J. Gunion, H. Haber, G. Kane and S. Dawson, The Higgs Hunter’s Guide, Addison-\nWesley, 1990.\n[3] J. Ellis, G. Ridolfi and F. Zwirner, Phys. Lett. B 257, 83 (1991);\nY. Okada, M. Yamaguchi and T. Yanagida, Prog. Theor. Phys. 85, 1 (1991);\nH. Haber and R. Hempfling, Phys. Rev. Lett. 66, 1815 (1991).\n[4] A. Brignole, Phys. Lett. B 281 (1992) 284.\n[5] P. Chankowski, S. Pokorski and J. Rosiek, Phys. Lett. B 286 (1992) 307; Nucl. Phys.\nB 423 (1994) 423, hep-ph\/9303309.\n[6] A. Dabelstein, Nucl. Phys. B 456 (1995) 25, hep-ph\/9503443; Z. Phys. C 67 (1995)\n495, hep-ph\/9409375.\n[7] R. Hempfling and A. Hoang, Phys. Lett. B 331 (1994) 99, hep-ph\/9401219.\n[8] S. Heinemeyer, W. Hollik and G. Weiglein, Phys. Rev. D 58 (1998) 091701,\nhep-ph\/9803277; Phys. Lett. B 440 (1998) 296, hep-ph\/9807423.\n[9] S. Heinemeyer, W. Hollik and G. Weiglein, Eur. Phys. Jour. C 9 (1999) 343,\nhep-ph\/9812472.\n[10] R. Zhang, Phys. Lett. B 447 (1999) 89, hep-ph\/9808299;\nJ. Espinosa and R. Zhang, JHEP 0003 (2000) 026, hep-ph\/9912236.\n[11] G. Degrassi, P. Slavich and F. Zwirner, Nucl. Phys. B 611 (2001) 403, hep-ph\/0105096.\n[12] J. Espinosa and R. Zhang, Nucl. Phys. B 586 (2000) 3, hep-ph\/0003246.\n[13] A. Brignole, G. Degrassi, P. Slavich and F. Zwirner, Nucl. Phys. B 631 (2002) 195,\nhep-ph\/0112177.\n[14] A. Brignole, G. Degrassi, P. Slavich and F. Zwirner, Nucl. Phys. B 643 (2002) 79,\nhep-ph\/0206101.\n[15] T. Banks, Nucl. Phys. B 303 (1988) 172;\nL. Hall, R. Rattazzi and U. Sarid, Phys. Rev. D 50 (1994) 7048, hep-ph\/9306309;\nR. Hempfling, Phys. Rev. D 49 (1994) 6168;\nM. Carena, M. Olechowski, S. Pokorski and C. Wagner, Nucl. Phys. B 426 (1994) 269,\nhep-ph\/9402253.\n[16] M. Carena, D. Garcia, U. Nierste and C. Wagner, Nucl. Phys. B 577 (2000) 577,\nhep-ph\/9912516.\n[17] S. Heinemeyer, W. Hollik and G. Weiglein, Comp. Phys. Comm. 124 2000 76,\nhep-ph\/9812320; hep-ph\/0002213.\nThe codes are accessible via www.feynhiggs.de .\n[18] M. Frank, S. Heinemeyer, W. Hollik and G. Weiglein, hep-ph\/0202166.\n17\n[19] M. Carena, J. Espinosa, M. Quiro´s and C. Wagner, Phys. Lett. B 355 (1995) 209,\nhep-ph\/9504316;\nM. Carena, M. Quiro´s and C. Wagner, Nucl. Phys. B 461 (1996) 407, hep-ph\/9508343.\n[20] H. Haber, R. Hempfling and A. Hoang, Z. Phys. C 75 (1997) 539, hep-ph\/9609331.\n[21] S. Heinemeyer, W. Hollik, J. Rosiek and G. Weiglein, Eur. Phys. Jour. C 19 (2001)\n535, hep-ph\/0102081.\n[22] W. Siegel, Phys. Lett. B 84 (1979) 193;\nD. Capper, D. Jones, P. van Nieuwenhuizen, Nucl. Phys. B 167 (1980) 479.\n[23] M. Frank, S. Heinemeyer, W. Hollik and G. Weiglein, in preparation.\n[24] A. Freitas and D. Sto¨ckinger, hep-ph\/0210372.\n[25] S. Heinemeyer, W. Hollik and G. Weiglein, hep-ph\/9910283.\n[26] M. Carena, H. Haber, S. Heinemeyer, W. Hollik, C. Wagner and G. Weiglein, Nucl.\nPhys. B 580 (2000) 29, hep-ph\/0001002.\n[27] J. Espinosa and I. Navarro, Nucl. Phys. B 615 (2001) 82, hep-ph\/0104047.\n[28] [LEP Higgs working group], hep-ex\/0107030.\n[29] M. Carena, S. Heinemeyer, C. Wagner and G. Weiglein, hep-ph\/9912223; to appear in\nEur. Phys. Jour. C, hep-ph\/0202167.\n[30] B. Allanach et al., Eur. Phys. Jour. C 25 (2002) 113, hep-ph\/0202233.\n[31] A. Quadt, private communication.\n[32] [LEP Higgs working group], LHWG Note\/2002-01,\nhttp:\/\/lephiggs.web.cern.ch\/LEPHIGGS\/papers\/.\n[33] S. Heinemeyer, W. Hollik and G. Weiglein, JHEP 0006 (2000) 009, hep-ph\/9909540.\n[34] S. Heinemeyer, W. Hollik and G. Weiglein, Eur. Phys. Jour. C 16 (2000) 139,\nhep-ph\/0003022.\n[35] M. Carena, S. Mrenna and C. Wagner, Phys. Rev. D 60 (1999) 075010, hep-ph\/9808312;\nPhys. Rev. D 62 (2000) 055008, hep-ph\/9907422;\nH. Eberl, K. Hidaka, S. Kraml, W. Majerotto and Y. Yamada, Phys. Rev. D 62 (2000)\n055006, hep-ph\/9912463.\n[36] TESLA TDR Part 3: Physics at an e+e− Linear Collider, eds. R.D. Heuer, D. Miller,\nF. Richard and P.M. Zerwas, hep-ph\/0106315,\n[37] T. Hahn, S. Heinemeyer and G. Weiglein, hep-ph\/0211204.\n[38] A. Hoang, Applications of Two-Loop Calculations in the Standard Model and its Minimal\nSupersymmetric Extension, PhD thesis, Universita¨t Karlsruhe, Shaker Verlag, Aachen\n1995.\n18\n[39] S. Martin, hep-ph\/0211366.\n[40] S. Martin, Phys. Rev. D 65 (2002) 116003, hep-ph\/0111209; Phys. Rev. D 66 (2002)\n096001, hep-ph\/0206136.\n19\n"}