{"doi":"10.1111\/j.1475-2743.2007.00130.x","coreId":"63438","oai":"oai:nora.nerc.ac.uk:2378","identifiers":["oai:nora.nerc.ac.uk:2378","10.1111\/j.1475-2743.2007.00130.x"],"title":"Dissolved organic carbon in soil solutions: a comparison of collection methods","authors":["Buckingham, S.","Tipping, E.","Hamilton-Taylor, J."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-03","abstract":"A field study was undertaken to compare the DOC concentrations in soil solutions obtained with three different sampling methods over a range of soil types.  The sampling devices were a tension-free collector, a tension Prenart collector and a tension Rhizon collector.  Samples were collected fortnightly for a year at seven sites in northern England, each collection being replicated three times.  The soil solution DOC ranged from 1.3 gm-3 in an acid ranker to 34.7 gm-3 in a peat.  The DOC concentrations obtained with the three methods were reasonably well correlated (r2 of 0.6 to 0.8) but with an indication of bias, as the best fit line differed from the 1:1 line.  The tension-free collector gave generally higher DOC concentrations except at very low concentrations (in the acid ranker soil).  The DOC concentrations measured with the tension-free collectors were significantly (p < 0.05) higher those obtained with Prenart and Rhizon collectors at four and six sites, out of seven, respectively.  Subsequent laboratory tests on tension-free collected samples showed no DOC loss on filtration through 0.1 and 0.22-m membranes, whereas a significant loss of DOC occurred when tension-free collected samples were subsequently passed through Prenart and Rhizon collectors, indicating a probable sampling artefact with the tension devices.  The difficulties of acquiring representative soil solution samples are discussed, together with the advantages and disadvantages of tension and tension-free methods","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63438.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/2378\/3\/BuckinghametalPP.pdf","pdfHashValue":"93891f3ca2c478dfc36e6ea0900227a14e7146ff","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:2378<\/identifier><datestamp>\n      2017-01-17T11:15:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2378\/<\/dc:relation><dc:title>\n        Dissolved organic carbon in soil solutions: a comparison of collection methods<\/dc:title><dc:creator>\n        Buckingham, S.<\/dc:creator><dc:creator>\n        Tipping, E.<\/dc:creator><dc:creator>\n        Hamilton-Taylor, J.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        A field study was undertaken to compare the DOC concentrations in soil solutions obtained with three different sampling methods over a range of soil types.  The sampling devices were a tension-free collector, a tension Prenart collector and a tension Rhizon collector.  Samples were collected fortnightly for a year at seven sites in northern England, each collection being replicated three times.  The soil solution DOC ranged from 1.3 gm-3 in an acid ranker to 34.7 gm-3 in a peat.  The DOC concentrations obtained with the three methods were reasonably well correlated (r2 of 0.6 to 0.8) but with an indication of bias, as the best fit line differed from the 1:1 line.  The tension-free collector gave generally higher DOC concentrations except at very low concentrations (in the acid ranker soil).  The DOC concentrations measured with the tension-free collectors were significantly (p < 0.05) higher those obtained with Prenart and Rhizon collectors at four and six sites, out of seven, respectively.  Subsequent laboratory tests on tension-free collected samples showed no DOC loss on filtration through 0.1 and 0.22-m membranes, whereas a significant loss of DOC occurred when tension-free collected samples were subsequently passed through Prenart and Rhizon collectors, indicating a probable sampling artefact with the tension devices.  The difficulties of acquiring representative soil solution samples are discussed, together with the advantages and disadvantages of tension and tension-free methods.<\/dc:description><dc:date>\n        2008-03<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2378\/6\/N002378PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Buckingham, S.; Tipping, E.; Hamilton-Taylor, J..  2008  Dissolved organic carbon in soil solutions: a comparison of collection methods.   Soil Use and Management, 24 (1). 29-36.  https:\/\/doi.org\/10.1111\/j.1475-2743.2007.00130.x <https:\/\/doi.org\/10.1111\/j.1475-2743.2007.00130.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1475-2743.2007.00130.x<\/dc:relation><dc:relation>\n        doi:10.1111\/j.1475-2743.2007.00130.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/2378\/","http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1475-2743.2007.00130.x","doi:10.1111\/j.1475-2743.2007.00130.x"],"year":2008,"topics":["Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nBuckingham, S.; Tipping, E.; Hamilton-Taylor, J.. 2008 Dissolved \norganic carbon in soil solutions: a comparison of collection \nmethods. Soil Use and Management, 24 (1). 29-36. \ndoi:10.1111\/j.1475-2743.2007.00130.x \n \n \n \n \n \nCopyright © 2007 The Authors.  \nJournal compilation © 2007 British Society of Soil Science  \n \nThis version available at http:\/\/nora.nerc.ac.uk\/2378\/  \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nhttp:\/\/www.blackwell-synergy.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n10\/04\/2008 Buckingham et al. \/ DOC collectors \n \n \n \n \nDissolved organic carbon in soil solutions:  5 \n10 \n15 \n20 \n25 \n30 \na comparison of collection methods \n \n \n \nS. Buckinghama,b, E. Tippinga, J. Hamilton-Taylorb \n \n \n \n \na Centre for Ecology and Hydrology, Lancaster Environment Centre, Library \nAvenue, Bailrigg, Lancaster, LA1 4AP, United Kingdom \n \nb Department of Environmental Science, Lancaster University, Lancaster,  \nLA1 4YQ, United Kingdom \n \n \n \n \nCorrespondence to:  Professor Edward Tipping \n    Centre for Ecology and Hydrology \n    Lancaster Environment Centre \n    Bailrigg \n    Lancaster \n    LA1 4AP \n \nE-mail  et@ceh.ac.uk \nTelephone ++44 (0) 1524 595866 \nBuckingham et al. \/ Comparison of soil solution collection methods \n \nABSTRACT \nA field study was undertaken to compare the DOC concentrations in soil \nsolutions obtained with three different sampling methods over a range of soil types.  \nThe sampling devices were a tension-free collector, a tension Prenart collector and a \ntension Rhizon collector.  Samples were collected fortnightly for a year at seven sites \nin northern England, each collection being replicated three times.  The soil solution \nDOC ranged from 1.3 gm-3 in an acid ranker to 34.7 gm-3 in a peat.  The DOC \nconcentrations obtained with the three methods were reasonably well correlated (r2 of \n0.6 to 0.8) but with an indication of bias, as the best fit line differed from the 1:1 line.  \nThe tension-free collector gave generally higher DOC concentrations except at very \nlow concentrations (in the acid ranker soil).  The DOC concentrations measured with \nthe tension-free collectors were significantly (p < 0.05) higher those obtained with \nPrenart and Rhizon collectors at four and six sites, out of seven, respectively.  \nSubsequent laboratory tests on tension-free collected samples showed no DOC loss on \nfiltration through 0.1 and 0.22-μm membranes, whereas a significant loss of DOC \noccurred when tension-free collected samples were subsequently passed through \nPrenart and Rhizon collectors, indicating a probable sampling artefact with the tension \ndevices.  The difficulties of acquiring representative soil solution samples are \ndiscussed, together with the advantages and disadvantages of tension and tension-free \nmethods. \n35 \n40 \n45 \n50 \n55 \n60 \n65 \n \n \n \n \n \n \n \n \n \n \n \n \n \n 2\nBuckingham et al. \/ Comparison of soil solution collection methods \n \n \nINTRODUCTION \nThe soil solution can be defined as the aqueous liquid phase of the soil and its \nsolutes (Tiensing et al 2001).  The extraction and analysis of soil water is often used \nto determine a range of factors within the soil. Monitoring soil solution is an \nintegrative step towards advancing our knowledge and understanding of soil systems.  \nThe methods commonly used to obtain soil solution are based on the principles of \npressure, vacuum, displacement and centrifugation (Tiensing et al. 2001).  The \nextraction of soil solution by displacement, centrifugation and the installation of \nlysimeters (with and without tension applied) are described by Hendershot and \nCourchesne (1991).  The sampling devices are variously referred to as samplers, \nlysimeters and collectors.  Each of the different sampling methods available has \nadvantages and disadvantages with regard to possible contamination, efficiency in \ndifferent soil types, cost, adsorptive losses of solutes and ease of use (Reynolds et al \n2004).  Successful water sampling devices should collect sufficient amounts of soil \nwater for the purposes of the study, with minimal change to chemical and biological \nproperties of the water (Krejsl et al 1994). \n70 \n75 \n80 \n85 \n90 \n95 \nPrevious comparisons of the sampling methods have shown diverse and \nsometimes conflicting results for inorganic constituents.  Reynolds et al. (2004) \ncompared tension and zero-tension lysimeters in peat, and found broad similarities \nbetween the solute concentrations measured by the two collector types.    In contrast \nHaines et al (1982) found that zero-tension collectors gave significantly lower Na+, \nK+ and Cl- concentrations at the litter-soil interface, compared to tension devices, \nwhereas at 30cm depth zero-tension collectors gave significantly higher \nconcentrations of NH4+ K+ NO3-, Cl-, SO42-, and significantly less silica than tension \ndevices.  Hendershot and Courchesne (1991) found no consistent differences when \ncomparing tension and tension-free collectors, except for significantly lower NO3- \nconcentrations with the tension-free devices. \nConflicting results have also been reported for collectors of the same type, \nespecially with tension collectors constructed from different materials. Some \nmaterials have been found to dissolve slowly or alter the soil solution, by either \nadsorption of compounds or the release of substances from the cup material \n(Andersen et al 2002).  Hansen and Harris (1975) used ceramic cups to collect soil \n 3\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nsolutions and found that nitrate and phosphate concentrations were not consistent, \ndisplaying substantial bias and variability due to leaching, diffusion, sorption and \nscreening by the ceramic cup walls.  Conversely, Levin and Jackson (1977) reported \nconsistent Ca, Mg and PO4-P concentrations sampled by ceramic cups, although they \ndid speculate about a possible partial uptake of NO3-.   Polysulfone Rhizon collectors \nmay retain colloidal iron as the fibres have relative low molecular-weight rejection \nlevel  (Reynolds et al 2004). \n100 \n105 \n110 \n115 \n120 \n125 \n130 \nSimilar variability appears to occur in the concentrations of dissolved organic \ncarbon (DOC) obtained using the various soil-solution collectors, although far fewer \nfield based comparisons have been undertaken.  DOC is a product of organic matter \ndecomposition in soils and is operationally defined as the organic carbon passing \nthrough a filter of 0.45μm pore size.  It consists of a wide range of molecules, ranging \nfrom simple acids and sugars to complex humic substances with large molecular \nweights (Moore 1998).  Understanding the dynamics of DOC in terrestrial \nenvironments is important as it is involved in many biogeochemical processes.  In a \nprevious field based comparison, Reynolds et al (2005) found a twofold difference in \nthe DOC concentrations between a zero-tension device (23.3 g m-3 DOC) and a \ntension PTFE collector (45 g m-3 DOC).  On reviewing the literature, Neff and Asner \n(2001) concluded that different sampling procedures may yield different DOC \nconcentrations in soil solutions. \nThus there is considerable uncertainty concerning the effectiveness and \nreliability of soil-solution collectors, especially for DOC. While previous field-based \ncomparisons have been made, the scope of such studies has been limited with respect \nto soil types, replication and numbers of samples. In addition to the inherent \ndifferences in the nature of the collectors, the reported differences in the field \nobservations may be linked to soil heterogeneity and the positioning of the collectors.  \nIt is necessary to be aware of the various problems and errors involved in sampling \nsoil solutions in order to obtain environmentally representative data.   \n This paper presents the results of a field-based programme where DOC \nconcentrations were monitored using replicated multiple collection methods in the \ntopsoil over a range of soil types.  The work is part of a wider project that is studying \nthe factors controlling DOC fluxes in topsoils.  The aims of this study were to \ndetermine: \n 4\nBuckingham et al. \/ Comparison of soil solution collection methods \n \n(a) the performance of different collector types in obtaining a sample for \nsubsequent DOC analysis. \n(b) the extent to which DOC concentrations can vary with the use of different \nsampling methods, both locally within a soil and across a variety of soils with \ndifferent DOC concentrations.   \n135 \n140 \n145 \n150 \n155 \n160 \nThree commonly used in-situ collectors were chosen for the study, namely a \ntension-free device and two contrasting tension collectors (Prenart and Rhizon).  \nThese are the same three collectors that were used by Reynolds et al (2004), allowing \ndirect comparisons to be made between the two field studies.   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 5\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nMETHODS \nSoil solution collectors were deployed for one year at seven sites, having a \nrange of soil and vegetation characteristics (Table 1).  Each of the three collector \ntypes was deployed in triplicate and samples collected on a fortnightly basis.  The \nnine collectors were randomly distributed at each site and the soil and organic horizon \ndepths determined.  To insert the collectors, small pits were excavated with care in the \ntopsoils.    \n165 \n170 \n175 \n180 \n185 \n190 \nThe tension-free collectors were constructed from PVC guttering and \nassembled using PVC conduit solvent cement.  They had dimensions of 7 × 10 × 5 cm \nand a spigot to which tubing could be connected for water collection.  The depth at \nwhich the collectors were positioned depended on the soil type (Table 1 and 2).  For \nthe ranker at Doe House Gill, they were placed near to the base of the fine soil, at a \nstandard depth of 15cm.  This was also the case for the mineral soils at Mask Hill, \nCowdale Slack and Meathop Wood 1, and at a slightly shallower depth at Meathop \nWood 2 because of the presence of large stones.  At Ravenstonedale Common they \nwere placed at the base of the organic layer, and in the peat at Moor House a depth of \n10cm was chosen to represent a typical acrotelm depth.  Each device was connected to \na 1-litre bottle, buried at a lower depth to allow soil water to move freely.  \nPrenart soil-solution collectors (Prenart Equipment Aps, Denmark)  are made \nof porous polytetrafluorethene (PTFE Teflon) and have a pore size of 2 μm.  The \nmanufacturers state that they are robust and chemically inert.  These collectors were \ninstalled horizontally at the midpoint between the soil surface and the depth of the \ntension-free collector (Table 2) and connected to a 1-litre collection bottle.  For \nPrenart and tension-free collectors the pits were carefully backfilled with soil, with the \nbottles buried and retrieval tubes protruding from the soil.  Tension was applied to the \nPrenart bottle by using a battery operated pump to 600mbar  \nThe Rhizon collectors (Van Walt Ltd, UK) comprise a 10 × 0.25 cm porous \npolymer tube, connected to a 10cm length of PVC tubing fitted to a luer-lock \nconnector.  The pore size of the porous polymer is 0.15 μm. Each Rhizon collector \nwas placed horizontally at the midpoint between the soil surface and the depth of the \ntension-free collector (Table 2) and connected to a 20 cm3 syringe, which was placed \nin a small buried plastic box that was readily accessible.  Tension for the Rhizon \ncollectors was achieved through drawing out the connected syringe and wedging it \nopen with wooden sticks. \n 6\nBuckingham et al. \/ Comparison of soil solution collection methods \n \n195 \n200 \n205 \n210 \n215 \n220 \n225 \nThe water samples in the Prenart and tension-free collector bottles were \nremoved in-situ by means of a battery operated pump, thus ensuring minimal \ndisturbance to the collector and soil.  The Prenarts were re-evacuated after sample \nremoval.  For the Rhizon collector, the syringe was disconnected, emptied into a clean \nbottle and replaced, with a vacuum being reapplied.   The samples from the first \ncollection were discarded to allow time for the collectors to adjust to the surrounding \nenvironment.  Following the manufacturer’s guidelines, the Rhizon collectors were \nreplaced after six months. \nSamples were stored in the laboratory at 5°C and filtered (Whatman GF\/F) \nwithin 48 hours.  The DOC concentration was determined, using a TOC-VCPH Total \nOrganic Carbon Analyzer, along with the absorbance (340nm) and conductivity \n(25°C) for each individual sample.  Extinction coefficients (m2 g-1) at 340 nm were \ndetermined from the ratio of absorbance to DOC concentration. \nLaboratory tests were undertaken, following the main field deployment, in \norder to investigate differences in DOC concentrations observed between tension and \ntension-free collectors. Raw samples from tension-free collectors were filtered \nthrough Whatman GF\/F membranes as in the standard procedure, and then separately \nthrough 0.22 μm and 0.1 μm membranes.  Additionally, Prenart collectors, recovered \nfrom the field sites, were cleaned with 0.1 M NaOH and thoroughly rinsed with \ndeionised water before being placed in unfiltered tension-free collected samples in the \nlaboratory, obtained from six of the field sites.  Tension was applied to the Prenart \ncollectors through a 20 cm3 syringe, attached via PVC tubing.  The syringes were \npulled back and wedged open to hold the vacuum until each syringe was filled with \nsoil solution.  The resulting tension samples were then filtered (Whatman GF\/F), as in \nthe standard procedure. The same experiment was also conducted with Rhizon \ncollectors but using new rather than cleaned devices.   The DOC concentrations were \ndetermined in all the final test solutions.  The finer filters used in the tests are carbon \nbased, and so the “bleed” concentrations (average 0.45 g m-3) were determined, and \nthe DOC concentrations corrected. \n \n \n \n \n 7\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nRESULTS \nThe main results of the study are summarized in Table 2.  To assess overall \ncollector reliability, the total possible number of samples and the actual number of \nsamples collected (classified as successes) were calculated.  The maximum possible \nnumber of samples was 504 from each method, resulting in a total of 1176 samples.  \nHowever the Rhizon samples were pooled due to the small volumes collected, \nresulting in a potential of 168 samples to be collected from 24 fortnightly visits. It can \nbe seen from Table 2 that, with the exception of the Meathop Wood 2 site, the \ntension-free and Rhizon collectors were consistently more reliable in providing a \nsample for analysis, with success rates of between 32-76% and 8-88%, respectively.  \nPrenart collectors performed relatively poorly, with success rates of 10 to 53%.  All \nthree collectors were generally less reliable in producing samples in Meathop Wood 2, \ncompared to the other sites. \n230 \n235 \n240 \n245 \n250 \n255 \n260 \n Mean annual averages from the three collectors were calculated using all \navailable data, irrespective of success rates (Table 2).  The average DOC \nconcentrations for each site showed large differences, ranging from 1.3 g m-3 at Doe \nHouse Gill (Prenart collector) to 34.7 g m-3 at Moor House (tension-free collector).  It \nis also clear from Table 2 that the average values differed between collector type.  \nOverall, the means showed a trend of consistently higher DOC concentration from the \ntension-free collectors in comparison to those with tension applied.  Some sites \nshowed a wider range in DOC concentrations between collector types in comparison \nto other sites, in particular Cowdale Slack and Meathop Wood 2.  Statistical \ncomparisons of the data using the t-test showed that the tension-free collector \nconcentrations were significantly (p<0.05) higher than the values from the Prenart and \nRhizon collectors at four and six sites, respectively (Table 2).  Only in two cases (Doe \nHouse Gill and Cowdale Slack) were there differences between the results from the \nPrenart and Rhizon collectors, and then in different directions. \nFig. 1 provides a more detailed comparison of the mean fortnightly DOC \nconcentrations obtained by the three collector types.  Here, the collectors were paired \nfor comparison, i.e. the data points refer to successful collections from pairs of  \ncollector types.  The measured concentrations were generally well correlated, with r2 \nvalues ranging from 0.6 to 0.8, but with an indication of bias as the best fit lines differ \nfrom the 1:1 line.  The tension-free collectors have consistently higher DOC \nconcentrations than the two tension-based collectors, except at very low values (Doe \n 8\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nHouse Gill site).  The two tension collectors gave similar concentrations, reflected in \nthe best-fit line lying closer to 1:1 (Fig. 1).  Considerable variability is apparent in the \nconcentrations measured at each site, which is also reflected in the annual standard \ndeviations given in Table 2.   265 \n270 \n275 \n280 \n285 \n290 \n295 \nConcentrations of DOC were normalised by dividing mean values for each \nsampling period by the overall mean, for each collector type (Fig. 2).  This revealed \nseasonal variations, with higher values in the summer and lower ones in the winter.  \nThe trend is clearest for the tension-free collector data.  These results probably reflect \neither the temperature dependence of DOC production and \/ or greater evaporative \nconcentration during the warmer period (Tipping et al., 2007).    \nThe extinction coefficient provides a simple measure of DOC quality.  The \nobserved coefficients, along with paired t-tests between collector types, show little \nevidence of any consistent variation, either between sites or between collector types \n(Table 3).  In only two cases were the extinction coefficients for tension-free \ncollectors significantly different to Prenart collectors, and once for tension-free \nagainst Rhizon collectors.  There was no significant difference between Prenart and \nRhizon collector samples.  The conductivity data also showed no evidence of \nsignificant differences between collector types, suggesting that the major ion contents \nof the soil solutions were not greatly dependent upon the sampling method.  \n The results of the laboratory tests to assess possible sampling artefacts are \nshown in Table 4 and Fig 3.   The tension-free collector solution that was \nsubsequently drawn through Rhizon and Prenart collectors produced the same trend as \nwas observed in the field (Table 4).  Compared to the initial tension-free collector \nsolution, the DOC concentration was lower in the solution from the Rhizon collector \nand lower still in the Prenart collector solution, indicating DOC removal or rejection \nby the tension devices.  However, the test involving additional filtration of tension-\nfree collector solution through fine membranes showed no notable difference in the \nDOC concentration (Fig. 3), indicating that the loss of DOC is due to a mechanism \nother than simple filtration.   \n \n \n \n \n \n 9\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nDISCUSSION \n \nThis study has shown that there were significant differences in DOC \nconcentrations from the use of the three different sampling methods.  Concentrations \nof DOC obtained with the tension-free collector were significantly higher than those \nwith the tension collectors at the majority of the sites monitored.   The differences \nbetween collector types were evident whether all available data were used, or just \npairs where there were missing data, showing that differences amongst collectors are \nnot simply due to the ability of tension-free and Rhizon collectors to sample water, \nwhen the Prenart collector does not.  In addition to the concentration differences and \nthe variable degree of seasonality obtained with the three sampling methods, there \nalso appeared to be a random scatter in the DOC concentrations at each site (Fig. 1).  \nThe most likely reasons are soil heterogeneity and variability in the performance of \neach collector type.  Clearly the diverse sources of variability in DOC pose some \nproblems in obtaining representative field concentrations.  Despite being able to \naccount for some of the observed variability, it is uncertain which factor has the most \ninfluence upon the results as soil heterogeneity and collector performance cannot be \nseparately quantified.  Neff and Asner (2001) similarly concluded that different \ncollection methods are likely to affect DOC concentrations and flux estimates, and \nthat it is difficult to assess these impacts separately from the underlying variation, \nresulting from soil and vegetation differences.  It is evident that a large quantity of \nfield data is required in order to identify trends and to average out the various types of \nvariability observed.   \n300 \n305 \n310 \n315 \n320 \nThe following factors might contribute to the higher DOC concentrations \nobtained with the tension-free collector. \n(1) The laboratory tests, run subsequently to the field deployments, showed that some \ndirect loss of DOC occurs with the tension collectors (Table 4). It seems unlikely that \nthis is due simply to filtration, because when solutions collected with tension-free \nlysimeters are passed through 0.1 or 0.22 µm pore size filters, no significant loss \noccurs (Fig. 3). The losses of DOC observed with the tension lysimeters may be due  325 \nto sorption effects (Grossmann and Udluft, 1991), for example linked to electric \ncharge or hydrophobicity.  In order to minimise interaction with the soil solution, \ntension devices are generally constructed from inert materials, such as nylon, \npolyethylene or polytetrafluorethene (PTFE).  An additional filtration effect on DOC \n 10\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nmay also occur under field conditions due to the compaction of soil surrounding the 330 \ntension collectors, resulting from the installation and\/or the applied vacuum.  \n(2) The DOC concentration naturally varies with soil depth due to variations in \npedological conditions, especially between the organic and mineral layers (Michalzik \net al 2003, Kalbitz and Park 2000) .  The vacuum applied to a tension collector \ninevitably creates a sphere of influence and consequently soil water can be drawn 335 \nfrom both above and below the collector.  It is possible that when placing tension \ncollectors close to or at the base of the organic layer (for non-peat sites) soil water is \nsampled from the underlying mineral material.  The tension-free collectors sample \nwater that has passed through the material above, providing more certainty concerning \nthe source of the soil water collected.  In the present study an effort was made to 340 \ncircumvent this issue, by placing the tension-free device at the base of the topsoil and \nthe tension devices at its midpoint.   \n(3) Water is held at different tensions in a soil, according mainly to its physical \ncharacteristics (e.g. pore sizes) and their spatial distribution, described by Warrick \n(2002).  The sampled water will therefore depend not only on the distribution of water 345 \nunder different tensions, but also on the tension applied to the collector, and on the \nvariation in the soil moisture content over the sampling period.  Liator (1988) \nsuggested that having a continuous vacuum applied can increase the variability of \nleachate volume, especially within soil horizons having different tensions and flow \npatterns.  Applying tension to a sampler will therefore extract water (and DOC) from 350 \ndifferent sized soil pores.  It is more likely that tension-free collectors sample larger \npores, which wet and dry more often with more oxygen and therefore microbial \nactivity and possibly DOC production.  Tension samplers can draw water from \nsmaller pores which remain water filled which may not contain as much DOC.  \nIncreasing the tension can lead to water being extracted from smaller soil pores 355 \ndescribed by Marshall and Holmes (1988).    Tension collectors therefore collect a \nmixture of soil water from small and large pores leading to a possible dilution effect \nfrom the small pore water and so less DOC.   In this study there was no evidence of \nthe collectors extracting significantly different dissolved organic matter, as judged by \nthe similar extinction coefficients (Table 3)  360 \n(4) The time period over which the applied vacuum is dissipated, and hence the \nsample collected, in the tension devices is unknown.  The Rhizon collectors are \nassumed to fill relatively quickly from observations in the field, possibly within 24 \n 11\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nhours, and hence the associated samples are probably closer to a point sample than a \nfortnightly average.  The Prenart collectors filled more slowly, seen in the laboratory 365 \nfiltration experiment, possibly collecting over the entire 2-week deployment in the \nfield.  The tension collectors may therefore sample over different hydrological events \nto each other, and to the tension-free device.  Although the timing of sampling is \nlikely to vary with collector type, it is more difficult to see how this would produce a \nsystematic difference in DOC concentration. 370 \nIn contrast to our findings, Reynolds et al (2004) found that Prenart collectors \ngave higher DOC concentration than tension-free devices in peat soil.  In both studies, \ntension-free collectors were placed at 10cm depth.  However Reynolds et al (2004) \nplaced the tension collectors at 10cm depth, whereas in the present study they were \ninstalled at the topsoil midpoint (5cm).  There may be larger stores of DOC in the \ndeeper, more humified material of the peat (and in other soils), causing higher DOC \nconcentrations to be sampled with the tension collectors deployed at greater depth, \nespecially due to their extended downward sphere of influence.   Another difference \nbetween the two studies is in the orientation of deployment.  Tension collectors in the \npresent study were installed horizontally, whereas Reynolds et al (2004) inserted the \ntension Prenart collectors vertically.  If the DOC concentration varies with depth, then \nthe vertical deployment may also have contributed to the higher DOC concentrations \nfound by Reynolds et al (2004) with the tension collectors.   Alternatively, the \ndifference in results found between the two studies may be due to site-specific or \ncollector-specific characteristics, which may preclude generalising about how \ncollector type influences the measured DOC concentration.  The study by Reynolds et \nal (2004) was based on a single peat site therefore how representative these results are \non a wider scale is questionable. \n375 \n380 \n385 \n390 \n395 \n  \n   \n \n \n \n \n \n \n \n 12\nBuckingham et al. \/ Comparison of soil solution collection methods \n \n \nCONCLUSIONS \n 400 \n405 \n410 \n415 \n420 \n425 \nThe study has shown that DOC concentrations in soil solutions were \nsignificantly higher with tension-free collectors than with tension devices at six out of \nseven sites.  The most likely explanation for the lower concentrations obtained with \nthe tension devices are artefacts, associated with sorptive removal of DOC by the \ncollector or with localised soil compaction induced by the applied vacuum, as well as \nthe influence of tension upon the source of soil water from different pores.  It is \nconcluded that tension-free collectors are more likely to be representative of free \nflowing water through the organic horizon, which is key to representing DOC fluxes \nthrough topsoils.  Other advantages of tension-free collectors are that they can be \ncustom-made to suit the project requirements, they can provide a larger volume of soil \nwater, and in this study were successful more frequently.  Our results raise several \nissues concerning the DOC concentrations obtained with different collectors over a \nbroad range of soil types.  In many studies only one collection method is used, \ntherefore hampering comparisons with the results of studies based on a different \nsampling method. \n \n \n \n \n \n \n \n \n \n \n \n \n 13\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nACKNOWLEDGEMENTS \nWe are grateful to D. Benham for constructing the tension-free collectors, to \nS.Thacker and C.Woods for help and advice on analysis, and to J.Quinton for helpful \ncomments on the manuscript.  This work was supported by a CEH Studentship funded \nby the UK Natural Environmental Research Council.   \n430 \n435 \n440 \n445 \n450 \n455 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 14\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nREFERENCES \nBarbee, G.C. & Brown, K.W 1986. Comparison between suction and free-drainage \nsoil solution samplers. Soil Science 141(2): 149-154. 460 \n465 \n470 \n475 \n480 \n485 \n490 \nFroberg, M. 2004. Processes controlling production and transport of dissolved organic \ncarbon in forest soils. Department of soil sciences. Uppsala, Swedish University \nof Agricultural Sciences: 39. \nGrossmann, J. & Udluft P. 1991. The extraction of soil water by the suction-cup \nmethod: A review. Journal of Soil Science 42: 83-93.   \nHaines, B.L., Waide, J.B et al. 1982. Soil solution nutrient concentrations sampled \nwith tension and zero-tension lysimeters: Report of discrepancies.\" Soil Science \nSociety of America Journal 46: 658-660. \nHansen, E.A. & Harris, A.R 1975. Validity of soil-water samples collected with \nporous ceramic cups. Soil Science Society of America Journal 39: 528 - 536. \nHendershot, W. & Courchesne, F 1991. Comparison of soil solution chemistry in zero \ntension and ceramic-cup tension lysimeters. Journal of Soil Science 42(4): 577 - \n584. \nKalbitz, K & Park H-J, et al. 2000. Controls on the dynamics of dissolved organic \nmatter in soils: A review. Soil Science 165: 277-303. \nKrejsl, J et al. 1994. Comparison of lysimeter types in collecting microbial \nconstituents from sewage effluent. Soil Science Society of America Journal 58: \n131 - 133. \nLevin, MJ. & Jackson, DR 1977. A comparison of in situ extractions for sampling soil \nwater. Soil Science Society of America Journal 41: 533 - 534.  \nLitaor, I. 1988. Review of soil solution samplers. Water Resources Research 24(5): \n727-733. \nMarshall, T.J & Holmes, J.W 1988 Soil Physics.  Cambridge University Press, \nCambridge UK. \nMichalzik, B et al. 2003. Modelling the production and transport of dissolved organic \ncarbon in forest soils. Biogeochemistry 66: 241-264. \nMoore, T.R. 1998. Dissolved organic carbon: Sources, sinks, and fluxes and role in \nthe soil carbon cycle. Soil processes and the carbon cycle. R. Lal, J. M. Kimble, \nR. F. Follett and B. A. Stewart, CRC Press LLC. \nNeff, J.C and Asner, G.P 2001 Dissolved organic carbon in terrestrial ecosystems: \nSynthesis and a model.  Ecosystems 4: 29-48 \n 15\nBuckingham et al. \/ Comparison of soil solution collection methods \n \nReynolds, B., Stevens P.A., Hughs, S., Brittain, S.A 2004. Comparison of field \ntechniques for sampling soil solution in an upland peatland. Soil Use and \nManagement  20: 454-456 \n495 \n500 \nSiemens, J. and Kaupenjohann, M 2003. Dissolved organic carbon is released from \nsealings and glues of pore-water samplers. Soil Science Society of America \nJournal 67: 795-797. \nTiensing, T. et al 2001. Soil solution extraction techniques for microbial ecotoxicity \ntesting: a comparative evaluation. Journal of Environmental Monitoring 3: 91-96. \nTipping, E, Smith, E.J., Bryant, C.L. and Adamson, J.K. 2007.  The organic carbon \ndynamics of a moorland catchment in N.W.England.  Biogeochemistry in press. \nWarrick, A.W (Ed) 2002 Soil Physics Companion.  CRC Press LLC.  Florida USA. \n \n 16\n10\/04\/2008 Buckingham et al. \/ DOC collectors \n505 \nTable 1.  General characteristics of the sampling sites. \n.  \nSite name Longitude \/ Latitude Altitude (m) Soil Type Vegetation Type \nDoe House Gill 54° 24 N   3° 9W 1172 acid ranker grassland \nMask Hill 54° 27N   2° 29W   987 cambic stagnohumic gley moorland \nCowdale Slack  54° 29N   2° 29W 1148 typical brown earth grassland \nMeathop Wood 1 54° 13N   2° 52W     42 brown earth deciduous woodland \nMeathop Wood 2 54° 13N  2° 52W     42 calcareous brown earth deciduous woodland \nRavenstonedale Common 54° 24N   2° 26W         1331 ferric stagnopodzol grassland \nMoor House 54° 41N  2° 23W 1893 peat moorland \n \n \n10\/04\/2008 Buckingham et al. \/ DOC collectors \nTable 2.  Summary of the sampling results.   \n \n[DOC] g m-3 \n  \n  \n \nCollector1 \n Sampling \ndepth, cm \nNo. of \nsamples \n Success \n% mean SD RSD % \nSig. \ndiffs.2 \nDoe House Gill TFC 20 54 75       2.0     1.1 54  \n PC 8 37 51       1.3     0.6 47 a,b,c \n RC 9 15 63       3.3     1.8 55  \nMask Hill TFC 15 52 72     11.7     4.0 34  \n PC 7.5 38 53       9.8   12.3 126 b \n RC 7.5 21 88       7.3     2.6 36  \nCowdale Slack TFC 15 50 69     13.4     7.2 54  \n PC 7.5 23 32       6.4     2.1 33 a,b,c \n RC 7.5 18 75       4.8     0.8 17  \nMeathop Wood 1 TFC 15 45 63     15.2     4.8 32  \n PC 7.5 23 32     13.6     6.3 46 b \n RC 7.5 7 29     11.6     3.1 27  \nMeathop Wood 2 TFC 12 23 32     21.1     9.4 45  \n PC 7.5 12 17       8.3     1.8 22 a \n RC 7.5 2 8     10.2     0.0 0  \nRavenstonedale Common TFC 15 55 76     25.1     6.8 27  \n PC 7 25 35     17.8     4.8 27 a,b \n RC 7.5 20 83     17.0     5.1 30  \nMoor House TFC 10 48 67     34.7   11.1 32  \n PC 5 7 10     30.7     8.5 28 b \n RC 5 16 67     25.7     5.6 22  \n  1 TFC tension-free collector, PC Prenart collector, RC Rhizon collector.   510 \n2 Differences between means (p < 0.05); a TFC ≠ PC,  b TFC ≠ RC,  c PC ≠ RC\n10\/04\/2008 Buckingham et al. \/ DOC collectors \n515 \nTable 3.  Mean extinction coefficients (m2 g-1) at 340 nm for each collector type, with \nstandard deviations in brackets.   The final column indicates where differences were \nsignificant at the 5% level; a TFC ≠ PC,  b TFC ≠ RC,  c PC ≠ RC \n \nSite TFC PC RC differences \nDoe House Gill     1.0  (0.5)     0.9 (0.6)     0.8 (0.4)  \nMask Hill     1.3  (0.7)     0.8 (0.4)     0.8 (0.3) a,b \nCowdale Slack     0.9  (0.4)     1.2 (2.1)     0.7 (0.6)  \nMeathop Wood 1     0.9  (0.4)     0.5 (0.2)     0.7 (0.5) a \nMeathop Wood 2     1.1  (0.6)     0.8 (0.7)     0.4 (0.1)  \nRavenstonedale Common     1.1  (0.5)     1.5 (1.1)     1.0 (0.4)  \nMoor House     1.3  (0.8)     1.8 (0.6)     1.5 (0.7)  \n \n \n \nBuckingham et al. \/ Comparison of soil solution collection methods \n \nTable 4. Laboratory collector test results.  Average DOC concentrations (g m-3) are shown \nfor solutions collected with tension-free collectors (TFC), and then subsequently drawn \nthrough Rhizon collectors (RC) or Prenart collectors (PC).  Values in brackets are \nstandard deviations of triplicate determinations. \n520 \n \nSite      TFC        RC       PC  \nMask Hill   12.7 (0.1)     11.0 (0.6)    9.1 (0.9) \nCowdale Slack   22.2 (0.1)     19.2 (0.6)  14.3 (2.2) \nMeathop Wood 1   21.1 (0.1)     20.3 (0.2)   16.6 (0.6) \nMeathop Wood 2   25.6 (0.1)     24.0 (0.9)  19.8 (1.1) \nRavenstonedale Common   22.9 (0.5)     16.0 (1.2)  13.7 (1.3) \nMoor House   30.1 (0.2)      19.5 (1.0)  20.7 (0.4) \n \n 525 \n \n 20\nBuckingham et al. \/ Comparison of soil solution collection methods \n \n \nLEGENDS TO FIGURES \n \n530 \n535 \n540 \n545 \nFigure 1. A comparison of the fortnightly mean DOC concentrations between \ncollectors, for occasions when at least one of the triplicated deployments was \nsuccessful for each collector. \n \nFigure 2. Seasonal variations in the ratio of fortnightly DOC concentration to the \noverall mean concentration, for all sites.  The dotted line provides a reference.  For \nkey to symbols, see Fig. 1. \n \nFigure 3. Comparison of DOC concentrations in samples that had been filtered with a  \nGF\/F filter only (x-axis) and then subsequently with a 0.22μm membrane.  The \nregression line with a forced intercept of zero is shown..     \n \n \n \n \n \n \n \n \n 21\nRC DOC gm-3\n0 10 20 30 40 50 60\nP\nC\n \nD\nO\nC\n \ng\nm\n-\n3\n0\n10\n20\n30\n40\n50\n60\nDoe House Gill\nMask Hill\nCowdale Slack\nMeathop Wood 1\nMeathop Wood 2\nRavenstonedale Common\nMoor House\n1:1\nZero intercept regression\nRegression\nRC DOC gm-3\n0 10 20 30 40 50 60\nT\nF\nC\n \nD\nO\nC\n \ng\nm\n-\n3\n0\n10\n20\n30\n40\n50\n60\ny=1.2x+3.3\ny=1.39x\nPC DOC gm-3\n0 10 20 30 40 50 60\nT\nF\nC\n \nD\nO\nC\n \ng\nm\n-\n3\n0\n10\n20\n30\n40\n50\n60\ny=1.27x\ny=1.01x+4.7\ny=1.05x\ny=0.95x+1.5\n \n10\/04\/2008 Buckingham et al. \/ DOC collectors \nFigure 1550 \nJulian day\n0 100 200 300 400\nC\non\nce\nnt\nra\ntio\nn \nr\nFigure 2 \n10\/04\/2008 Buckingham et al. \/ DOC collectors \nC\non\nce\nnt\nra\ntio\nn \nra\ntio\nat\nio\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\nJulian day\n0 100 200 300 400\nC\non\nce\nnt\nra\ntio\nn \nra\ntio\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n0.0\n0.5\n1.0\n1.5\n2.0\n0 100 200 300 400\nJulian day\nTFC\nRC\nPC\n \nBuckingham et al. \/ Comparison of soil solution collection methods \n \n \nGF\/F filtrate DOC gm-3\n0 10 20 30 40 50\n0.\n22\num\n fi\nltr\nat\ne \nD\nO\nC\n g\nm\n-3\n0\n10\n20\n30\n40\n50\ny=0.97x\nr2=0.99\n \n 555 \nigure 3 \n560 \n565 \nF\n \n \n \n \n \n \n \n \n \n \n \n \n 24\n"}