{"doi":"10.1186\/1471-2458-7-142","coreId":"9994","oai":"oai:www.era.lib.ed.ac.uk:1842\/2717","identifiers":["oai:www.era.lib.ed.ac.uk:1842\/2717","10.1186\/1471-2458-7-142"],"title":"Record linked retrospective cohort study of 4.6 million people exploring ethnic variations in disease: myocardial infarction in South Asians","authors":["Bhopal, Raj","Fischbacher, C M","Povey, C","Steiner, M","Chalmers, J","Mueller, G","Jamieson, J","Knowles, D"],"enrichments":{"references":[{"id":1034640,"title":"AC: Myocardial infarction and thrombolysis: a comparison of the Indian and European populations on a coronary care unit.","authors":[],"date":"1994","doi":null,"raw":"Lear JT, Lawrence IG, Pohl JE, Burden AC: Myocardial infarction and thrombolysis: a comparison of the Indian and European populations on a coronary care unit.  J R Coll Physicians Lond 1994, 28:143-147.","cites":null},{"id":616000,"title":"Anonymous linkage of New Zealand mortality and Census data.","authors":[],"date":"2000","doi":"10.1111\/j.1467-842x.2000.tb00732.x","raw":"Blakely T, Woodward A, Salmond C: Anonymous linkage of New Zealand mortality and Census data.  Aust N Z J Public Health 2000, 24:92-96. (fuller methodological details for this reference are at http:\/BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142 Page 10 of 10 (page number not for citation purposes) \/www.wnmeds.ac.nz\/academic\/dph\/research\/HIRP\/nzcms\/ nzcmsTechRptNo3SH.pdf Nd, accessed 29th of September 2006)","cites":null},{"id":1034668,"title":"Bangladeshi patients present with non-classic features of acute myocardial infarction and are treated less aggressively in east London,","authors":[],"date":"2003","doi":"10.1136\/heart.89.3.276","raw":"Barakat K, Wells Z, Ramdhany S, Mills PG, Timmis AD: Bangladeshi patients present with non-classic features of acute myocardial infarction and are treated less aggressively in east London, UK.  Heart 2003, 89:276-279.","cites":null},{"id":1034556,"title":"Bhopal RS: The epidemic of coronary heart disease in South Asian populations: causes and consequences. Birmingham, South Asian Health Foundation [http:\/\/www.sahf.org.uk\/ monograph_2004_march_26.pdf]. (accessed 22\/6\/07)","authors":[],"date":null,"doi":null,"raw":"Patel KC, Bhopal RS: The epidemic of coronary heart disease in South Asian populations: causes and consequences.  Birmingham, South Asian Health Foundation  [http:\/\/www.sahf.org.uk\/ monograph_2004_march_26.pdf]. (accessed 22\/6\/07)","cites":null},{"id":1034535,"title":"C: Quality of Scottish Morbidity Record (SMR) data. Health Bulletin (Edinburgh)","authors":[],"date":"1999","doi":null,"raw":"Harley K, Jones C: Quality of Scottish Morbidity Record (SMR) data.  Health Bulletin (Edinburgh) 1999, 54(5):410-417.","cites":null},{"id":669833,"title":"Capewell S: Relation between socioeconomic deprivation and death from a first myocardial infarction in Scotland: population based analysis. BMJ","authors":[],"date":"2001","doi":"10.1136\/bmj.322.7295.1152","raw":"Macintyre K, Stewart S, Chalmers J, Pell J, Finlayson A, Boyd J, Redpath A, McMurray J, Capewell S: Relation between socioeconomic deprivation and death from a first myocardial infarction in Scotland: population based analysis.  BMJ 2001, 322:1152-1153.","cites":null},{"id":1034516,"title":"Coronary heart attacks in East London. Lancet","authors":[],"date":"1975","doi":"10.1016\/S0140-6736(75)90233-0","raw":"Tunstall-Pedoe H, Clayton D, Morris J, Brigden W, McDonald L: Coronary heart attacks in East London.  Lancet 1975, 2:833-838.","cites":null},{"id":616025,"title":"Creeser R: Longitudinal Study 1971–1991 – History, organisation and quality of data.","authors":[],"date":"1995","doi":null,"raw":"Hattersley L, Creeser R: Longitudinal Study 1971–1991 – History, organisation and quality of data.  London, HMSO; 1995.","cites":null},{"id":1034571,"title":"Cruickshank JK: Age, sex, ethnic origin and hospital admission for heart attack and stroke. Postgrad Med J","authors":[],"date":"1981","doi":"10.1136\/pgmj.57.674.763","raw":"Beevers DG, Cruickshank JK: Age, sex, ethnic origin and hospital admission for heart attack and stroke.  Postgrad Med J 1981, 57:763-765.","cites":null},{"id":1034650,"title":"Declining case fatality rates for acute myocardial infarction in South Asian and white patients in the past 15 years. Heart","authors":[],"date":"2006","doi":"10.1136\/hrt.2005.078634","raw":"Liew R, Sulfi S, Ranjadayalan K, Cooper J, Timmis AD: Declining case fatality rates for acute myocardial infarction in South Asian and white patients in the past 15 years.  Heart 2006, 92:1030-1034.","cites":null},{"id":1034495,"title":"detection, and management of cardiovascular risk factors in different ethnic groups in south London. Heart","authors":[],"date":"1997","doi":null,"raw":"Cappuccio FP, Cook DG, Atkinson RW, Strazzullo P: Prevalence, detection, and management of cardiovascular risk factors in different ethnic groups in south London.  Heart 1997, 78:555-563.","cites":null},{"id":1034596,"title":"Differences in mortality of migrants.","authors":[],"date":null,"doi":null,"raw":"Harding S, Maxwell R: Differences in mortality of migrants.  In Health inequalities Edited by: Drever F, Whitehead M. London: HMSO; 1997:108-121.","cites":null},{"id":669835,"title":"Do Indo-Asians have smaller coronary arteries? Postgrad Med J","authors":[],"date":"1999","doi":null,"raw":"Lip GY, Rathore VS, Katira R, Watson RD, Singh S: Do Indo-Asians have smaller coronary arteries?  Postgrad Med J 1999, 75:463-6.","cites":null},{"id":19943726,"title":"Does access to cardiac investigation and treatment contribute to social and ethnicdifferences in coronary heart disease? Whitehall II prospective cohort study. BMJ","authors":[],"date":"2004","doi":"10.1136\/bmj.38156.690150.ae","raw":"Britton A, Shipley M, Marmot M, Hemingway H: Does access to cardiac investigation and treatment contribute to social and ethnicdifferences in coronary heart disease? Whitehall II prospective cohort study.  BMJ 2004, 329:318.","cites":null},{"id":669839,"title":"Does access to cardiac investigation and treatment contribute to social and ethpub","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":1034542,"title":"Dusserre L: Automatic record hash coding and linkage for epidemiological follow-up data confidentiality. Methods Inf Med","authors":[],"date":"1998","doi":"10.1016\/s1386-5056(98)00019-7","raw":"Quantin C, Bouzelat H, Allaert FA, Benhamiche AM, Faivre J, Dusserre L: Automatic record hash coding and linkage for epidemiological follow-up data confidentiality.  Methods Inf Med 1998, 37:271-277.","cites":null},{"id":1034547,"title":"Editorial: Striking the right balance between privacy and public good. Lancet","authors":[],"date":"2006","doi":"10.1016\/s0140-6736(06)68043-4","raw":"Editorial: Striking the right balance between privacy and public good.  Lancet 2006, 367(9507):275.","cites":null},{"id":1034519,"title":"Ethnicity and health in Scotland: can we fill the information gap? A demonstration project focusing on coronary heart disease and linkage of census and health records. [http:\/\/www.chs.med.ed.ac.uk\/phs\/research\/Retrocoding final report.pdf].","authors":[],"date":null,"doi":null,"raw":"Bhopal R, Fischbacher CM, Steiner M, Chalmers J, Povey C, Jamieson J, Knowles D: Ethnicity and health in Scotland: can we fill the information gap? A demonstration project focusing on coronary heart disease and linkage of census and health records. [http:\/\/www.chs.med.ed.ac.uk\/phs\/research\/Retrocoding final report.pdf]. (accessed 22\/6\/07)","cites":null},{"id":614189,"title":"Ethnicity, race, and health in multicultural societies; foundations for better epidemiology, public health, and health care.","authors":[],"date":null,"doi":"10.1136\/jech.2007.064733","raw":"Bhopal RS: Ethnicity, race, and health in multicultural societies; foundations for better epidemiology, public health, and health care.  Oxford: Oxford University Press; 2007:357.","cites":null},{"id":669837,"title":"Exclusion and Inclusion of Nonwhite Ethnic Minority Groups in 72 North American and European Cardiovascular Cohort Studies. PLoS Medicine","authors":[],"date":"2006","doi":"10.1371\/journal.pmed.0030044","raw":"Ranganathan M, Bhopal R: Exclusion and Inclusion of Nonwhite Ethnic Minority Groups in 72 North American and European Cardiovascular Cohort Studies.  PLoS Medicine 2006, 3:0001-0008.","cites":null},{"id":1034586,"title":"First myocardial infarctions in Asian and white men. BMJ","authors":[],"date":"1989","doi":"10.1136\/bmj.298.6684.1345","raw":"Hughes L, Raval U, Raftery E: First myocardial infarctions in Asian and white men.  BMJ 1989, 298:1345-1350.","cites":null},{"id":669834,"title":"H: Differences in risk factors, atherosclerosis, and cardiovascular disease between ethnic groups in Canada: the Study of Health Assessment and Risk in Ethnic Groups (SHARE). Lancet","authors":[],"date":"2000","doi":"10.1016\/S0140-6736(00)02502-2","raw":"Anand S, Yusuf S, Vuksan V, Devanesen S, Teo K, Montague P, Kelemen L, Yi C, Lonn E, Gerstein H: Differences in risk factors, atherosclerosis, and cardiovascular disease between ethnic groups in Canada: the Study of Health Assessment and Risk in Ethnic Groups (SHARE).  Lancet 2000, 356:279-284.","cites":null},{"id":1034674,"title":"H: Ethnic differences in invasive management of coronary disease: prospective cohort study of patients undergoing angiography. BMJ","authors":[],"date":"2002","doi":"10.1136\/bmj.324.7336.511","raw":"Feder G, Crook AM, Magee P, Banerjee S, Timmis AD, Hemingway H: Ethnic differences in invasive management of coronary disease: prospective cohort study of patients undergoing angiography.  BMJ 2002, 324:511-516.","cites":null},{"id":1034527,"title":"Handbook of record linkage: methods for health and statistical studies, administration and business.","authors":[],"date":"1988","doi":"10.1002\/gepi.1370060409","raw":"Newcombe H: Handbook of record linkage: methods for health and statistical studies, administration and business.  Oxford: Oxford University Press; 1988.","cites":null},{"id":616753,"title":"Health Care Needs Assessment: Black and Minority Ethnic Groups. Health Care Needs Assessment. The epidemiologically based needs assessment reviews. Third Series","authors":[],"date":"2007","doi":"10.1136\/bmj.309.6963.1241","raw":"Gill PS, Kai J, Bhopal RS, Wild S: Health Care Needs Assessment: Black and Minority Ethnic Groups.  Health Care Needs Assessment. The epidemiologically based needs assessment reviews. Third Series 2007 [http:\/\/hcna.radcliffe-oxford.com\/bemgframe.htm]. Abingdon: Radcliffe Medical Press Ltd","cites":null},{"id":1034564,"title":"Heart attack, stroke, diabetes, and hypertension in West Indians, Asians, and whites in","authors":[],"date":"1980","doi":"10.1136\/bmj.281.6248.1108","raw":"Cruickshank JK, Beevers DG, Osbourne VL, Haynes RA, Corlett JC, Selby S: Heart attack, stroke, diabetes, and hypertension in West Indians, Asians, and whites in Birmingham, England. BMJ 1980, 281:1108.","cites":null},{"id":616750,"title":"How to ensure data security of an epidemiological followup: quality assessment of an anonymous record linkage procedure.","authors":[],"date":"1998","doi":"10.1016\/s1386-5056(98)00019-7","raw":"Quantin C, Bouzelat H, Allaert FA, Benhamiche AM, Faivre J, Dusserre L: How to ensure data security of an epidemiological followup: quality assessment of an anonymous record linkage procedure.  Int J Med Inf 1998, 49(1):117-122.","cites":null},{"id":669836,"title":"JP: Coronary artery size and disease","authors":[],"date":"2006","doi":"10.1016\/S0140-6736(02)11383-3","raw":"Zindrou D, Taylor KM, Bagger JP: Coronary artery size and disease in UK South Asian and Caucasian men.  Eur J Cardiothorac Surg 2006, 29:492-495.","cites":null},{"id":1034664,"title":"Lay diagnosis and healthcare-seeking behaviour for chest pain in south Asians and Europeans. Lancet","authors":[],"date":"1997","doi":"10.1016\/s0140-6736(97)06243-0","raw":"Chaturvedi N, Rai H, Ben-Shlomo Y: Lay diagnosis and healthcare-seeking behaviour for chest pain in south Asians and Europeans.  Lancet 1997, 350:1578-1583.","cites":null},{"id":1034661,"title":"Littler WA: Acute myocardial infarction in Asians and whites in Birmingham. Br Med J","authors":[],"date":"1985","doi":"10.1136\/bmj.290.6480.1472","raw":"Lawrence RE, Littler WA: Acute myocardial infarction in Asians and whites in Birmingham.  Br Med J 1985, 290(6480):1472.","cites":null},{"id":1034611,"title":"Marmot MG: Relation of central obesity and insulin resistance with high diabetes prevalence and cardiovascular risk in South Asians. Lancet","authors":[],"date":"1991","doi":"10.1016\/0140-6736(91)91164-p","raw":"McKeigue PM, Shah B, Marmot MG: Relation of central obesity and insulin resistance with high diabetes prevalence and cardiovascular risk in South Asians.  Lancet 1991, 337:382-386.","cites":null},{"id":1034588,"title":"McKeigue P: Cross sectional analysis of mortality by country of birth in England and Wales,","authors":[],"date":"1970","doi":"10.1136\/bmj.314.7082.705","raw":"Wild S, McKeigue P: Cross sectional analysis of mortality by country of birth in England and Wales, 1970–92.  BMJ 1997, 314:705-710.","cites":null},{"id":1034603,"title":"Mortality from all causes and circulatory disease by country of birth in England and Wales 2001–2003. Journal of public health","authors":[],"date":"2007","doi":"10.1093\/pubmed\/fdm010","raw":"Wild SH, Fischbacher C, Brock A, Griffiths C, Bhopal R: Mortality from all causes and circulatory disease by country of birth in England and Wales 2001–2003.  Journal of public health 2007, 29:191-198.","cites":null},{"id":616024,"title":"O: Identification of Cases of Myocardial Infarction: Hospital Discharge Data and Mortality Data Compared to Myocardial Infarction Community Registers.","authors":[],"date":"1991","doi":"10.1093\/ije\/20.1.114","raw":"Hammar N, Nerbrand C, Ahlmark G, Tibblin G, Tsipogianni A, Johansson S, Wilhemsen L, Jacobsson S, Hansen O: Identification of Cases of Myocardial Infarction: Hospital Discharge Data and Mortality Data Compared to Myocardial Infarction Community Registers.  International Journal of Epidemiology 1991, 20:114-120.","cites":null},{"id":1034499,"title":"Obesity and coronary risk factors among south Asians. Lancet","authors":[],"date":"1991","doi":"10.1016\/0140-6736(91)91599-P","raw":"McKeigue P, Marmot M: Obesity and coronary risk factors among south Asians.  Lancet 1991, 337:972.","cites":null},{"id":1034504,"title":"of Health: Health Survey for England: the Health of Minority Ethnic Groups '99. London, The Stationary Office;","authors":[],"date":"2001","doi":"10.1046\/j.1467-3010.2001.00138.x","raw":"UK Department of Health: Health Survey for England: the Health of Minority Ethnic Groups '99.  London, The Stationary Office; 2001.","cites":null},{"id":19943678,"title":"Office for Scotland: [http:\/\/www.gro-scot land.gov.uk\/]. (accessed 29th of","authors":[],"date":"2006","doi":null,"raw":"General Register Office for Scotland:  [http:\/\/www.gro-scot land.gov.uk\/]. (accessed 29th of September 2006)","cites":null},{"id":615999,"title":"Office for Scotland: [http:\/\/www.gro-scot land.gov.uk\/]. (accessed 29th of September","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":1034572,"title":"Patterns of Asian and non-Asian morbidity in hospitals. BMJ","authors":[],"date":"1983","doi":"10.1136\/bmj.286.6369.949","raw":"Donaldson L, Taylor J: Patterns of Asian and non-Asian morbidity in hospitals.  BMJ 1983, 286:949-951.","cites":null},{"id":19943804,"title":"Pre-publication history The pre-publication history for this paper can be accessed here: http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\/pre pub","authors":[],"date":"2003","doi":null,"raw":"Chalmers J, Muir R: Patient privacy and confidentiality.  BMJ 2003, 326:725-726. Pre-publication history The pre-publication history for this paper can be accessed here: http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\/pre pub","cites":null},{"id":669838,"title":"Pre-publication history The pre-publication history for this paper can be accessed here: http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\/prePage 10 of 10 (page number not for citation purposes)","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":1034653,"title":"Risk factors, hospital management and outcomes after acute myocardial infarction in South Asian Canadians and matched control subjects. CMAJ","authors":[],"date":"2002","doi":null,"raw":"Gupta M, Doobay AV, Singh N, Anand SS, Raja F, Mawji F, Julian Kho J, Karavetian A, Qilong Y, Yusuf S: Risk factors, hospital management and outcomes after acute myocardial infarction in South Asian Canadians and matched control subjects.  CMAJ 2002, 166:717-722.","cites":null},{"id":616752,"title":"Samani N: Coronary heart disease in people of South Asian origin. Lancet","authors":[],"date":"2004","doi":"10.1016\/s0140-6736(04)17563-6","raw":"Khunti K, Samani N: Coronary heart disease in people of South Asian origin.  Lancet 2004, 364:2077-2078.","cites":null},{"id":1034613,"title":"SK: Ethnic differences in acute myocardial infarction in Singapore. Eur Heart J","authors":[],"date":"2003","doi":null,"raw":"Mak KH, Chia KS, Kark JD, Chua T, Tan C, Foong BH, Lim YL, Chew SK: Ethnic differences in acute myocardial infarction in Singapore.  Eur Heart J 2003, 24:151-160.","cites":null},{"id":616751,"title":"Some methods for blindfolded record linkage. BMC Medical Informatics and Decision Making","authors":[],"date":"2004","doi":null,"raw":"Churches T, Christen P: Some methods for blindfolded record linkage.  BMC Medical Informatics and Decision Making 2004, 4(1):9.","cites":null},{"id":1034622,"title":"Survival after acute myocardial infarction in Asian and white patients in Birmingham. Br Heart J","authors":[],"date":"1995","doi":"10.1136\/hrt.73.2.122","raw":"Mukhtar H, Littler W: Survival after acute myocardial infarction in Asian and white patients in Birmingham.  Br Heart J 1995, 73:122-124.","cites":null},{"id":616754,"title":"Tavridou A: Heterogeneity of coronary heart disease risk factors in Indian, Pakistani, Bangladeshi and European origin populations: cross sectional study. BMJ","authors":[],"date":"1999","doi":"10.1136\/bmj.319.7204.215","raw":"Bhopal R, Unwin N, White M, Yallop J, Walker L, Alberti K, Harland J, Patel S, Ahmad N, Turner C, Watson B, Kaur D, Kulkarni A, Laker M, Tavridou A: Heterogeneity of coronary heart disease risk factors in Indian, Pakistani, Bangladeshi and European origin populations: cross sectional study.  BMJ 1999, 319:215-220.","cites":null},{"id":1034632,"title":"The pattern and severity of coronary artery disease in Asians and white living in Birmingham. Postgrad Med J","authors":[],"date":"1983","doi":"10.1136\/pgmj.59.696.634","raw":"Lowry PJ, Mace PJE, Glover DR, Little WA: The pattern and severity of coronary artery disease in Asians and white living in Birmingham.  Postgrad Med J 1983, 59:634-635.","cites":null},{"id":1034579,"title":"Timmis AD: Comparison of case fatality in south Asian and white patients after acute myocardial infarction: Observational study. BMJ","authors":[],"date":"1996","doi":"10.1136\/bmj.312.7042.1330","raw":"Wilkinson P, Sayer J, Laji K, Grundy C, Marchant B, Kopelman P, Timmis AD: Comparison of case fatality in south Asian and white patients after acute myocardial infarction: Observational study.  BMJ 1996, 312:1330-1333.","cites":null},{"id":1034509,"title":"What is the risk of coronary heart disease in South Asians? A review of UK research.","authors":[],"date":"2000","doi":"10.1093\/pubmed\/22.3.375","raw":"Bhopal R: What is the risk of coronary heart disease in South Asians? A review of UK research.  J Public Health Med 2000, 22:375-385.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-07-01","abstract":"Background Law and policy in several countries require health services to demonstrate that they are promoting racial\/ethnic equality. However, suitable and accurate data are usually not available. We demonstrated, using acute myocardial infarction, that linkage techniques can be ethical and potentially useful for this purpose.\\ud\nMethods The linkage was based on probability matching. Encryption of a unique national health identifier (the Community Health Index (CHI)) ensured that information about health status and census-based ethnicity could not be ascribed to an identified individual. We linked information on individual ethnic group from the 2001 Census to Scottish hospital discharge and mortality data.\\ud\nResults Overall, 94% of the 4.9 million census records were matched to a CHI record with an estimated false positive rate of less than 0.1 %, with 84.9 – 87.6% of South Asians being successfully linked. Between April 2001 and December 2003 there were 126 first episodes of acute myocardial infarction (AMI) among South Asians and 30,978 among non-South Asians. The incidence rate ratio was 1.45 (95% CI 1.17, 1.78) for South Asian compared to non-South Asian men and 1.80 (95% CI 1.31, 2.48) for South Asian women. After adjustment for age, sex and any previous admission for diabetes the hazard ratio for death following AMI was 0.59 (95% CI 0.43, 0.81), reflecting better survival among South Asians.\\ud\nConclusion The technique met ethical, professional and legal concerns about the linkage of census and health data and is transferable internationally wherever the census (or population register) contains ethnic group or race data. The outcome is a retrospective cohort study. Our results point to increased incidence rather than increased case fatality in explaining high CHD mortality rate. The findings open up new methods for researchers and health planners","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/9994.pdf","fullTextIdentifier":"http:\/\/www.biomedcentral.com\/content\/pdf\/1471-2458-7-142.pdf","pdfHashValue":"7844c034e899fee4494fb47abd68e090c86582be","publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:www.era.lib.ed.ac.uk:1842\/2717<\/identifier><datestamp>\n                2016-05-24T15:33:57Z<\/datestamp><setSpec>\n                com_1842_15818<\/setSpec><setSpec>\n                col_1842_15820<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nRecord linked retrospective cohort study of 4.6 million people exploring ethnic variations in disease: myocardial infarction in South Asians<\/dc:title><dc:creator>\nBhopal, Raj<\/dc:creator><dc:creator>\nFischbacher, C M<\/dc:creator><dc:creator>\nPovey, C<\/dc:creator><dc:creator>\nSteiner, M<\/dc:creator><dc:creator>\nChalmers, J<\/dc:creator><dc:creator>\nMueller, G<\/dc:creator><dc:creator>\nJamieson, J<\/dc:creator><dc:creator>\nKnowles, D<\/dc:creator><dc:subject>\nethnicity<\/dc:subject><dc:description>\nBackground Law and policy in several countries require health services to demonstrate that they are promoting racial\/ethnic equality. However, suitable and accurate data are usually not available. We demonstrated, using acute myocardial infarction, that linkage techniques can be ethical and potentially useful for this purpose.\\ud\nMethods The linkage was based on probability matching. Encryption of a unique national health identifier (the Community Health Index (CHI)) ensured that information about health status and census-based ethnicity could not be ascribed to an identified individual. We linked information on individual ethnic group from the 2001 Census to Scottish hospital discharge and mortality data.\\ud\nResults Overall, 94% of the 4.9 million census records were matched to a CHI record with an estimated false positive rate of less than 0.1 %, with 84.9 – 87.6% of South Asians being successfully linked. Between April 2001 and December 2003 there were 126 first episodes of acute myocardial infarction (AMI) among South Asians and 30,978 among non-South Asians. The incidence rate ratio was 1.45 (95% CI 1.17, 1.78) for South Asian compared to non-South Asian men and 1.80 (95% CI 1.31, 2.48) for South Asian women. After adjustment for age, sex and any previous admission for diabetes the hazard ratio for death following AMI was 0.59 (95% CI 0.43, 0.81), reflecting better survival among South Asians.\\ud\nConclusion The technique met ethical, professional and legal concerns about the linkage of census and health data and is transferable internationally wherever the census (or population register) contains ethnic group or race data. The outcome is a retrospective cohort study. Our results point to increased incidence rather than increased case fatality in explaining high CHD mortality rate. The findings open up new methods for researchers and health planners.<\/dc:description><dc:date>\n2009-04-07T08:26:35Z<\/dc:date><dc:date>\n2009-04-07T08:26:35Z<\/dc:date><dc:date>\n2007-07-01<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nBhopal, R., Fischbacher, C.M., Povey, C., Steiner, M.. (2007-07-01) Record linked retrospective cohort study of 4.6 million people exploring ethnic variations in disease: myocardial infarction in South Asians, BMC Public Health 7(142) 1-10<\/dc:identifier><dc:identifier>\n1471-2458<\/dc:identifier><dc:identifier>\nhttp:\/\/www.biomedcentral.com\/content\/pdf\/1471-2458-7-142.pdf<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1186\/1471-2458-7-142<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/1842\/2717<\/dc:identifier><dc:language>\nen<\/dc:language><dc:format>\n392032 bytes<\/dc:format><dc:format>\napplication\/pdf<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1471-2458","1471-2458"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["ethnicity"],"subject":["Article"],"fullText":"BioMed  Central\nPage 1 of 10\n(page number not for citation purposes)\nBMC Public Health\nOpen Access Research article\nRecord linked retrospective cohort study of 4.6 million people \nexploring ethnic variations in disease: myocardial infarction in \nSouth Asians\nCM Fischbacher1,3, R Bhopal*3, C Povey1, M Steiner3, J Chalmers1, \nG Mueller2, J Jamieson1 and D Knowles1\nAddress: 1Information Services Division, NHS National Services Scotland, Gyle Square, 1 South Gyle Crescent, Edinburgh EH12 9EB, UK, 2General \nRegister Office for Scotland, Ladywell House, Ladywell Road, Edinburgh EH12 7TF, UK and 3Public Health Sciences, University of Edinburgh, \nTeviot Place, Edinburgh EH8 9AG, UK\nEmail: CM Fischbacher - Colin.Fischbacher@isd.csa.scot.nh; R Bhopal* - Raj.Bhopal@ed.ac.uk; C Povey - Chris.Povey@isd.csa.scot.nhs.uk; \nM Steiner - m.steiner@abdn.ac.uk; J Chalmers - jim.chalmers@isd.csa.scot.nhs.uk; G Mueller - Ganka.Mueller@gro-scotland.gsi.gov.uk; \nJ Jamieson - Joan.Jamieson@isd.csa.scot.nhs.uk; D Knowles - david.knowles@isd.csa.scot.nhs.uk\n* Corresponding author    \nAbstract\nBackground: Law and policy in several countries require health services to demonstrate that they\nare promoting racial\/ethnic equality. However, suitable and accurate data are usually not available.\nWe demonstrated, using acute myocardial infarction, that linkage techniques can be ethical and\npotentially useful for this purpose.\nMethods: The linkage was based on probability matching. Encryption of a unique national health\nidentifier (the Community Health Index (CHI)) ensured that information about health status and\ncensus-based ethnicity could not be ascribed to an identified individual. We linked information on\nindividual ethnic group from the 2001 Census to Scottish hospital discharge and mortality data.\nResults: Overall, 94% of the 4.9 million census records were matched to a CHI record with an\nestimated false positive rate of less than 0.1 %, with 84.9 – 87.6% of South Asians being successfully\nlinked. Between April 2001 and December 2003 there were 126 first episodes of acute myocardial\ninfarction (AMI) among South Asians and 30,978 among non-South Asians. The incidence rate ratio\nwas 1.45 (95% CI 1.17, 1.78) for South Asian compared to non-South Asian men and 1.80 (95% CI\n1.31, 2.48) for South Asian women. After adjustment for age, sex and any previous admission for\ndiabetes the hazard ratio for death following AMI was 0.59 (95% CI 0.43, 0.81), reflecting better\nsurvival among South Asians.\nConclusion: The technique met ethical, professional and legal concerns about the linkage of\ncensus and health data and is transferable internationally wherever the census (or population\nregister) contains ethnic group or race data. The outcome is a retrospective cohort study. Our\nresults point to increased incidence rather than increased case fatality in explaining high CHD\nmortality rate. The findings open up new methods for researchers and health planners.\nPublished: 5 July 2007\nBMC Public Health 2007, 7:142 doi:10.1186\/1471-2458-7-142\nReceived: 4 October 2006\nAccepted: 5 July 2007\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\n© 2007 Fischbacher et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 2 of 10\n(page number not for citation purposes)\nBackground\nSeveral countries require their services to show with accu-\nrate, quantitative data that they are meeting the needs of\nethnic and racial minority populations. Such require-\nments for data are often impossible to implement [1]. The\nRace Relations (Amendment) Act 2000 and NHS policy,\nfor example, require UK health services to demonstrate\nhow successful they are in promoting racial equality and\nhelping reduce ethnic inequalities. However, routine data\nsources in Scotland, as in most countries, rarely include a\npatient's ethnicity, and when this is available, it is not cer-\ntain whether it is based on self-classification (as recom-\nmended) or on the view of a health care provider.\nThe 2001 Scotland Census, as in many countries includ-\ning the USA, Canada, Australia and New Zealand [1], con-\ntains a question on ethnicity or race [2]. Although the\ncensus form may often be completed by one person on\nbehalf of the household, it is likely that the answer to the\ncensus question is a good proxy for a person's own view\nof their ethnicity. We foresaw that if we could link the cen-\nsus records of individuals to the routinely collected health\ndata on the same individuals, we could examine the rela-\ntionship between ethnicity and disease for the population\nof Scotland.\nThe Information Services Division (ISD) of NHS National\nServices Scotland maintains a dataset of hospital episode\ndata (derived from the Scottish Morbidity Record\n(SMR01)) which is linked internally to previous hospital-\nisations and death data (obtained from The General Reg-\nister Office for Scotland). Thus a record can be built up for\npeople that joins all their hospital admissions and\nincludes their death where applicable. We aimed to link\nthe census data to this SMR01-death linked dataset.\nWhile it was conceptually feasible to link census data with\nmorbidity and mortality records there were concerns\nabout the legality of this proposal. Linkage between cen-\nsus data and mortality data has been performed before,\nwith extensive experience in New Zealand [3]. There, Sta-\ntistics New Zealand collect information on deaths and the\ncensus, and the two datasets have been matched [3]. Sim-\nilarly, there is experience of such linkage in Scandinavia\nand other parts of Europe though, in the arena of ethnicity\nand health, it is less advanced [4]. Such work is usually\nbased on a population register with an identification\nnumber that is also used in health records. Country of\nbirth, but usually not ethnicity or race, is sometimes\nrecorded. Cancer registry and mortality records within the\nEngland and Wales Longitudinal Study, which contains\nethnicity from the census, have been linked prospectively\nto census data [5]. Within the Scottish Longitudinal Study\nthere are also plans for linkage with hospital data, but it is\nonly in 5% of the Scottish population, so may not be able\nto produce useful information by ethnic group [6].\nThis study advances the field by linking data from two\nagencies and four databases to explore ethnic variations in\ndisease using the entire population of Scotland (about 5\nmillion people). Under present legislation and guidance,\nincluding the data protection legislation, the Census Act\n1920 and the Census Confidentiality Act 1991, the retro-\nspective linkage described here would be acceptable if the\nconfidentiality of individual personal information was\nmaintained during the matching, handling and analysis\nof the matched dataset. To achieve this we used one-way\nencryption methods (otherwise known as \"hashing\") and\norganisational procedures. One-way encryption methods\nhave been used to allow record linkage of anonymised\ndata, but apparently not in the UK, and not for the pur-\npose used here [3,7,8].\nFor this demonstration project we studied heart disease,\nsince it is one of the most important conditions in Scot-\nland, is common in ethnic minority groups, and its man-\nifestations are likely to be recorded in hospital morbidity\nrecords. South Asians comprise the largest non-white\nminority ethnic group in Scotland [2]. Residents of Eng-\nland and Wales with ancestral origins in the Indian sub-\ncontinent (South Asians) have increased mortality from\ncoronary heart disease (CHD) compared to most other\nethnic minority groups, including people of European\nancestry (White) [1,9,10]. The prevalence of CHD is also\ncomparatively high, [11-14] but few data are available on\nincidence from population studies [15,16].\nUK mortality data are based on country of birth, but the\nincrease in the UK born ethnic minority population\nmakes this an inaccurate guide to ethnic group variations,\nparticularly in younger age groups [1,10]. Little informa-\ntion is available about CHD risk among South Asians liv-\ning in Scotland, where CHD incidence and prevalence are\nhigher than England and Wales. Our recent analysis of\nmortality by country of birth shows the expected excess in\ncomparison to England and Wales, and modest excesses\nin relation to the population of Scotland [17].\nFor acute myocardial infarction (AMI), hospital discharge\ndata combined with mortality data provide a good guide\nto incidence. However, in 2004\/05, only around 6% of\nhospital discharges in Scotland included information on\nethnic group. We created, using probability methods for\nrecord linkage, an anonymised dataset containing hospi-\ntal discharges and deaths with a diagnosis of CHD in Scot-\nland between 2001 and 2003 and ethnic group in the\n2001 Census [17]. We describe, as an example of the\npotential of the dataset, the incidence of AMI and subse-\nquent survival among South Asians in Scotland comparedBMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 3 of 10\n(page number not for citation purposes)\nto the remaining population of Scotland (henceforth,\nnon-South Asians). Appendix 1 summarises what was\nknown before and now.\nMethods\nProcedural issues\nThe procedural techniques took into account that the\nrequired data are held by two different bodies, with differ-\nent responsibilities. The community health index (CHI)\nand hospitalisation data are collected and maintained by\nISD, and the census and mortality data are collected and\nmaintained by the General Register Office for Scotland\n(GROS). GROS performed a risk-assessment of the data\nsecurity aspects of the proposed record linkage and pro-\nduced recommendations, including that all the linkage\nwork was performed on a stand-alone computer. Modifi-\ncations were made to the computer operating system to\nmonitor activity and an audit trail was implemented for\nall peripheral devices (floppy and CD-ROM drives, and\nexternal ports). The computer was in a locked room at\nGROS accessed with the agreement of both organisations.\nGROS maintained a register of visits. Neither organisation\ncould view the other organisation's primary datasets (the\ncensus data and the hospital discharge\/death linked data)\nin a form in which individuals were identifiable.\nUse of record linkage and one-way encryption\nThe linkage methods used were identical to those devel-\noped in Scotland for administrative matching of health\ndata. Date of birth, surname (using soundex codes to\nallow for variations in spelling), forename, address and\nfull postcode were used to link. For many records there\nwas an exact match. For the remaining records, a probabil-\nity matching process was performed using methods pio-\nneered by Newcombe [18]. Here, the rate of false positives\nis critical. Methods have been developed to identify how\nfalse positives occur and what kind of strategies a human\nchecker employs to decide whether a pair match is good.\nThese decision strategies were built into a partitioning\ncomputer algorithm, which groups (partitions) records\naccording to the likelihood of correct matching. These\npartitions then allow the allocation of human checking to\npartitions, rather than individual records, so maximising\nlinkage and minimising effort.\nPrior to the linkage the project's steering group judged and\nspecified that an effectiveness of 80% or more for all eth-\nnic groups would be adequate for the purposes of this\ndemonstration phase. This was a pragmatic decision that\nneeded to be made (in the absence of data or theoretical\nprecedent) to help assess the personnel time and resource\nto be directed to the matching process.\nAs both census and CHI datasets described essentially the\nsame population, for every person on the CHI, there was\na very high probability that the same individual was rep-\nresented on the census. Where all linking variables\nmatched, it was assumed that this represented the same\nindividual. The various types of mismatches were\naddressed by the use of the partitioning algorithm\ndescribed above. For example, all the instances of mis-\nmatch limited to one differing digit of year of birth were\nput into the same partition. A sample was then taken from\neach of the partitions, and the adequacy of each match\nwas assessed by considering how much less likely the next\nbest match was. This allowed quantification of the quality\nof the match for each partition.\nFigure 1 illustrates in concept how record linkage was\nbased on the use of subsets from three datasets: the\nSMR01-death linked dataset, extracted by coronary heart\ndisease diagnostic codes on any record, and including per-\nsonal identifiers and clinical information; the CHI dataset\nwhich contains personal identifiers and the CHI number;\nand the census file which contains personal identifiers\nand details of individuals' ethnicity.\nThe CHI dataset lists everyone registered with a General\nPractitioner or in receipt of screening services and forms a\nunique identifier for NHS use. More than 99% of the Scot-\ntish population is listed. A CHI number was attached to\nthe SMR01-death linked dataset. A one-way cryptographic\n(hashing) algorithm was then used to encrypt the CHI\nnumber into a code such that it is currently impossible to\nreverse the process. Personal identifiers were removed and\ndates of birth converted to ages to create a file suitable for\nanalysis.\nA census extract with personal identifiers and a unique\ncensus identification number was taken from GROS's cen-\nsus file. The census number was encrypted using an algo-\nrithm developed by GROS. The file was then linked to the\nencrypted CHI dataset using the probability methods\nAnonymised linkage of health databases to census databases:  conceptualising the procedure Figure 1\nAnonymised linkage of health databases to census databases: \nconceptualising the procedure.BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 4 of 10\n(page number not for citation purposes)\nalready described. The personal identifiers were then\nremoved, leaving a file with an encrypted CHI number\nand its corresponding encrypted census number.\nA new census extract containing ethnic code and an\nencrypted census number was joined to the above file by\nexact matching using the encrypted census number. The\nencrypted census numbers were now discarded leaving\nthe ethnicity code and the encrypted CHI number. The\nsubset of the SMR01-death linked file was exactly linked\nvia the encrypted CHI numbers; The encrypted CHI was\nreplaced with an unrelated serial number (to keep the\nhospital spells together), resulting in depersonalised clin-\nical health records carrying census ethnicity codes. To\nreduce the risk of disclosure some variables were further\naggregated and access to the analysis file was restricted to\nnamed researchers in the secure room described above.\nEvaluation of the effectiveness of linkage between census \ndata and CHI\nThe quality of the linkage depended on the adequacy of\nthe linkage between the census data and the CHI. We\ntested the probability matching methods using data sup-\nplied by Scottish hospitals where the CHI number was\npresent. We assessed whether the personal identifiers we\nused yielded the same CHI number.\nEthical approval, legal advice and public scrutiny\nAs no identified individual responses to the Census were\nlinked to health records, and vice versa, we were following\nthe principles of existing data protection legislation and\nguidance, including two National Statistics (NS) Proto-\ncols on Data Access and Confidentiality, and Data Match-\ning. Legal advice (obtained by GROS) confirmed that the\nproposed use of census data was compliant with the Cen-\nsus Act 1920 and the Data Protection Act 1998. We\nobtained approval from the Scottish Multi-centre\nResearch Ethics Committee and the Scottish Privacy Advi-\nsory Committee (PAC).\nThis work was supported by the Commission for Racial\nEquality, NHS Health Scotland (through The National\nResource Centre for Ethnic Minority Health), ISD, the\nScottish Executive Health Department and the Chief Med-\nical Officer. We disseminated information widely to\nencourage people to discuss the proposal and the early\nfindings.\nAnalysis of data on incidence of myocardial infarction and \nmortality\nA diagnosis of AMI was recorded by a clinician at hospital\ndischarge or recorded as the underlying cause of death on\na death certificate. There is national guidance promoting\nuniformity of approach. The approach to the diagnosis\nwould be similarly applied in different ethnic groups.\nIncreasing use of laboratory tests makes the diagnosis less\nopen to the subjective judgement of a clinician who might\nbe influenced by the ethnicity of patients. The Scottish\nMorbidity Record database (SMR01) records inpatient\nand day case discharges with a diagnostic accuracy of\naround 90% for CHD [19]. Data on discharges with CHD\ndiagnoses (ICD9 410–414 or ICD10 I20-I25 in any diag-\nnostic position) between 1981 and December 2003 were\nextracted (the data from 1981 – 2001 being used to check\nfor prior AMI). A first AMI was identified using ICD10\ncodes I21 and 122 and ICD9 code 410, but restricting to\nfirst admissions for AMI based on no hospital admission\nfor AMI in the preceding 10 years. Deprivation categories\nwere assigned using the postcode sector of residence in\n2001, which provides the Scottish Index of Multiple Dep-\nrivation (SIMD). The SIMD scorers were divided into\nquintiles for analysis.\nThe South Asian population comprised people who were\ndesignated by the head of household at the 2001 census\nas Pakistani (23, 660 people, 86.9% matching of census\nand community health index), Indian (11, 690, 87.6%\nmatch), Bangladeshi (1463, 84.9% match), and other\nSouth Asian (4526, 82.2 % match).\nThe incidence of AMI was calculated using the data\nbetween April 2001 and December 2003 inclusive. Pois-\nson regression modelling was used to calculate incidence\nrate ratios and 95% confidence intervals, by sex. Odds\nratios for survival following AMI at fixed intervals from 30\nto 720 days after admission were calculated using logistic\nregression. Kaplan-Meier plots were produced using an\nage adjusted survival function, setting age at 68 years.\nAdjusted hazard ratios were estimated using Cox regres-\nsion. We included age (in five groups), sex and previous\nadmission for diabetes in the Cox model. Graphical meth-\nods were used to confirm the proportional hazards\nassumption. Adjustment for area based social and eco-\nnomic deprivation based on the Scottish Index of Multi-\nple Deprivation was done.\nThe checks included review of procedures and analysis\nprograms created by M.S., first by C. F., and subsequently\nin consultation with an external adviser with experience of\nsimilar analyses, KMc (see acknowledgements).\nResults\nQuality of linkage of the subset of the SMR01-death file to \nCHI\n630,121 SMR01-death records came to ISD with a CHI\nnumber applied by the hospitals supplying the data.\n629,493 yielded the same CHI number on matching to\nthe CHI database using the fields in our linkage method-\nology. 628 records had differing CHI numbers, and are\ntherefore potential false linkages from our type of proba-BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 5 of 10\n(page number not for citation purposes)\nbility linkage. 125 of the 628 had CHI which do not\nappear in the CHI data set, so these must be errors on the\noriginal SMR01 record. 503 (628-125 entries) false posi-\ntives might have arisen in the probability linkage process.\nApplying the worst assumption that all the 503 CHIs\nderived from the linkage were incorrect and the CHIs as\napplied by the hospitals were correct, this implies an\nupper limit to the false positive linkage rate of 0.08 %.\nQuality of overall linkage of census and CHI records\nTable 1 shows that 94% of the 4.9 million census records\nwere matched to a CHI record (with an estimated false\npositive rate of less than 0.1 %, as above). The proportion\nof matches exceeded 80% for every ethnic group, meeting\nour prior standard.\nMyocardial infarction incidence and survival\nBetween the date of the Census (29th April 2001) and\n31st December 2003 there were 126 first episodes of AMI\namong South Asians, of which 105 were admissions with\nAMI in the principal diagnostic position and 21 were sud-\nden deaths in the community with an underlying cause of\ndeath of AMI. The corresponding figures for non-South\nAsians were 30,978 first episodes, 21,306 admissions and\n9,672 community deaths. Table 2 shows that in most age\ngroups the incidence of AMI was higher in South Asians\nthan non-South Asians. Similar results were obtained\nwhen the analysis included both first and subsequent\nadmissions for AMI; the directly standardised rate (95%\nCI) was 9.88 (7.63, 12.14) and 6.01 (5.92, 6.08) among\nSouth Asian and non-South Asian men respectively and\n5.07 (3.23, 6.91) and 2.99 (2.94, 3.03) among South\nAsian and non-South Asian women. The incidence rate\nratio was 1.45 (95% CI 1.17, 1.78) for South Asian com-\npared to non-South Asian men and 1.80 (95% CI 1.31,\n2.48) for South Asian women.\nBetween April 2001 and December 2003 there were\n17,115 deaths following a first AMI, 40 among South\nAsians and 17,075 among non-South Asians. Among\nSouth Asians 53% (21) of deaths occurred before hospital\nadmission, while among non-South Asians 57% (9,672)\nof deaths occurred before admission. Table 3 shows that\nat successive intervals up to 720 days after AMI admission,\nsubstantially larger proportions of South Asian men and\nwomen than non-South Asians were alive. Age-specific\nanalyses for AMI in the principal position showed that for\nSouth Asians the hazard ratios were comparatively low in\n35–44 yrs (0.87), 55–64 (0.61), 65–74 (0.62), 75–84\n(0.56) and 85+ (0.87) age groups. The only exception was\nthe 45–54 yrs age group (1.19, 4 deaths). For AMI in any\nposition the results were similar. The odds ratio (OR)\nbased on logistic regression for death by 30 days following\nAMI was 0.43 (95% CI 0.29, 0.63) for South Asians com-\npared with non-South Asians. These lower odds of death\nwere slightly altered by adjustment for age, sex and depri-\nvation quintile (OR 0.57, 95% CI 0.37, 0.86).\nAn age-adjusted Kaplan-Meier plot of survival by sex and\nethnic group is shown in figure 2. In a Cox regression\nmodel the hazard ratio among South Asians compared to\nnon-South Asians was 0.50 (95% CI 0.37, 0.68). After\nadjustment for age, sex and any previous admission for\ndiabetes the hazard ratio was 0.59 (95% CI 0.43, 0.81).\nWith those over 75 years of age excluded (associations\nbetween disease and social economic inequalities are least\nTable 1: Effectiveness of matching process by ethnic group\nUnmatched Matched Total % matched\nAny Mixed Background 1139 10429 11568 90.2%\nOther Ethnic group 1446 7115 8561 83.1%\nNon Resident Students 2887 33272 36159 92.0%\nNo Response 37768 180872 218640 82.7%\nScotland 293786 4605671 4899457 94.0%\nWhite Scottish 201306 3890972 4092278 95.1%\nOther White British 24976 321278 346254 92.8%\nWhite Irish 4332 41078 45410 90.5%\nOther White 9943 61279 71222 86.0%\nIndian 1651 11690 13341 87.6%\nPakistani 3580 23660 27240 86.9%\nBangladeshi 261 1463 1724 84.9%\nOther South Asian 980 4526 5506 82.2%\nChinese 2459 12161 14620 83.2%\nCaribbean 196 1400 1596 87.7%\nAfrican 723 3598 4321 83.3%\nBlack Scottish or Other Black 139 878 1017 86.3%BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 6 of 10\n(page number not for citation purposes)\nTable 2: Incidence rate and number of first admissions for acute MI* in Scotland between 1st May 2001 and 31st December 2003 by sex \nand ethnic group.\nNon South Asians South Asians\nRate (Admissions\/\n1000 population\/year)\nNumber \nof cases\nCensus \npopulation **\nRate (Admissions\/\n1000 population\/year)\nNumber \nof cases\nCensus \npopulation **\nFemale\n25 to 34 0.03 29 320,018 0.00 0 3,519\n35 to 44 0.20 199 366,337 0.28 2 2,647\n45 to 54 0.68 584 322,103 1.36 6 1,653\n55 to 64 2.00 1408 264,030 3.49 8 860\n65 to 74 5.05 3043 225,973 8.39 10 447\n75 to 84 11.33 4605 152,421 24.19 8 124\n85 and over 21.92 3406 58,266 42.86 4 35\nCrude rate, all ages 2.91 13276 1,709,148 1.53 38 9,285\nStandardised rate (95% CI), \nall ages\n2.56 (2.51, 2.60) 4.86 (3.05, 6.67)\nMale\n25 to 34 0.12 86 278,236 0.00 0 3,328\n35 to 44 0.69 609 332,767 1.58 11 2,612\n45 to 54 2.36 1948 308,996 2.56 12 1,756\n55 to 64 5.43 3525 243,602 6.36 20 1,179\n65 to 74 10.28 5091 185,773 15.29 27 662\n75 to 84 18.77 4726 94,429 42.55 16 141\n85 and over 31.05 1710 20,655 26.79 2 28\nCrude rate, all ages 4.53 17696 1,464,458 3.40 88 9,706\nStandardised rate (95% CI), \nall ages\n5.00 (4.93, 5.08) 7.71 (5.68, 9.75)\n* acute MI defined as ICD10 code I21 in the principal diagnostic position\n** restricted to those successfully linked to a Community Health Index record\nTable 3: Proportion alive at 30, 90, 180, 270, 360 and 720 days after AMI admission, by sex and ethnic group.\nNon South Asian South Asian\nfemale male female male\n30 days alive(%) 47.3 56.4 70.6 72.7\nTotal(N) 12,974 17,257 34 88\n90 days alive(%) 42.7 53.1 69.7 70.6\nTotal(N) 12,415 16,473 33 85\n180 days alive(%) 39.2 49.9 67.7 69.9\nTotal(N) 11,773 15,476 31 83\n270 days alive(%) 36.0 46.3 65.5 67.1\nTotal(N) 11,186 14,441 29 76\n360 days alive(%) 32.3 42.4 61.5 62.1\nTotal(N) 10,579 13,456 26 66\n720 days alive(%) 14.9 21.8 50.0 44.4\nTotal(N) 8,418 9,921 20 45BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 7 of 10\n(page number not for citation purposes)\nin the elderly) the hazard ratio was 0.68 (95% CI 0.46,\n1.01). These results were unaltered when subjected to\nchecking procedures.\nDiscussion\nEthics and methods\nWe surmounted formidable technical, ethical, administra-\ntive and legal challenges to link census, CHI, hospital and\nmortality data for analysis of the relationship between\nethnicity and disease. It is vital to demonstrate confiden-\ntiality, and in particular to address the public's concerns.\nThe encryption ensured records could be linked in an uni-\ndentifiable form, but our security procedures provided\nadditional safeguards. It is feasible for someone to try out\na large number of possible CHI numbers to look for the\ncorresponding encrypted code. This can be avoided by\nusing extra encryption [20].\nThere is an obligation to ensure that potential ethnic ine-\nqualities are highlighted so that they can be assessed and\naddressed [1,17]. We had to balance individuals' right to\ndata privacy (individual consent was impossible) and the\npotential benefits to society of producing information\nderived from potentially sensitive data [21]. We judge our\nmethods struck the balance. The proportion of records\nascribed an ethnicity code (94%) was slightly smaller than\nthat normally achieved within ISD (typically around\n98%). As the non-White ethnic minority population\n(about 2%) is comparatively small the false positive rate\nis critical. A rigorous matching methodology appropriate\nfor administrative matching was, therefore, used. Census\nforms are completed by the public and processed elec-\ntronically using optical recognition and keying from\nimages. The success of these processes depends on legibil-\nity. The detailed spelling of a name, particularly if it is\nassociated with a minority ethnic group, is more likely to\nbe prone to error when transcribed by a third party onto\nNHS records, than in the census where the census inform-\nant writes it. Such errors could lead to varying accuracy of\nlinkage by ethnic group. Nevertheless, we met our prior\nstated standard of 80% for every ethnic group. In future,\nwe hope to examine matching rates at each stage of the\nlinkage and by sex.\nAcute myocardial infarction-strengths and weaknesses of \nthe analysis\nThe major strength of this analysis is the population cov-\nerage with the inclusion of community and hospital\ndeaths as the SMR 01 database contains over 99% of hos-\npital admissions for AMI in Scotland (A Redpath, ISD,\npersonal communication, 2006). Possible, as opposed to\nprobable or definite, AMIs are coded as chest pain and are\nexcluded from our figures. The quality of data on AMI in\nthe database has been validated as reliable [19].\nThe diagnosis of AMI was based on criteria used by clini-\ncians to make the diagnosis, however, which would be\ninconsistent over time. This should not, however, affect\nethnic groups differently. If misclassification of diagnosis\nis non-differential then the differences would probably be\nunderestimated, but if they were differential differences\nwould be exaggerated. We do not have data to assess these\noptions, and the anonymised methods precluded validity\nstudies at this stage, but are a high priority for future work.\nLinkage rates were slightly lower for South Asians than\nnon-South Asians. If non-linkage occurred at random, as\nis likely, this would reduce the power of the study, but not\nbias the results. If those not matched were at different risk\nof AMI or death following AMI, from those who were\nmatched, this would bias the results. We intend to explore\nthis in future research. The limited information available\nto allow adjustment for co-morbidity did not explain dif-\nferences in survival, and in future analyses, assuming eth-\nical permission can be obtained, we would include more\nexplanatory variables from the Census.\nWe did not separate Indians and Pakistanis (the dominant\nSouth Asian populations in Scotland), as desirable [11],\nbecause of lack of numbers, but this is technically feasible,\nand is planned for the future as events accrue. The pattern\nof cardiovascular risk factors varies among different South\nAsian populations [11], but the excess mortality is shared\nby all [15].\nFindings on incidence of and survival from acute \nmyocardial infarction in relation to previous knowledge\nFew studies have reported the incidence of CHD among\nSouth Asians in the UK [15]. Our findings corroborate\nthose of Tunstall-Pedoe and colleagues  who reported a\n30% (not statistically significant) increased rate of first\nKaplan-Meier plot of survival following admission for AMI,  Scotland 2001–2003, by ethnic group and sex Figure 2\nKaplan-Meier plot of survival following admission for AMI, \nScotland 2001–2003, by ethnic group and sex.BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 8 of 10\n(page number not for citation purposes)\nand recurrent AMI among Asian (predominantly Bangla-\ndeshi) men in London [16]. The data accord with high\nCHD mortality in South Asian-born populations, com-\npared to White populations [15,22].\nStudies of hospital admission rates for AMI in the UK have\nreported a similar [15,23] or higher [24,25] risk for South\nAsians, but these did not include community deaths.\nWilkinson [26] reported a two-fold and Hughes a 4.9 fold\nincrease in the incidence of AMI [27] – the latter result\nbeing an outlier. Britton et al reported a doubling of the\nincidence of fatal CHD or MI in 560 South Asian civil serv-\nants compared to White ones in the Whitehall 2 cohort\nstudy [28]. Our findings are consistent with the relatively\nhigh CHD mortality in those born in the Indian subconti-\nnent around the 1971–2001 Censuses [1,10,29-31] and\nthe relatively high CHD prevalence [11,12,32].\nAs survival from AMI was comparatively good, our data\nindicate that the high rates of CHD mortality arise from\nhigher incidence rather than from higher case fatality. Pre-\nvious studies of fatality after AMI in South Asians were on\nhospital cases [33]. Muhktar found no significant differ-\nence in survival up to 4 years after discharge in 111 South\nAsians and matched non-South Asian controls [34]. Stud-\nies agreeing with this conclusion include those by Lowry\net al in Birmingham [35], Hughes et al in London [27],\nLear et al in Leicester [36], Liew et al in London [37],\nGupta et al in Toronto, Canada [38], and Mak et al in Sin-\ngapore [33]. Wilkinson et al's work is unusual in showing\na substantially poorer survival in South Asians [26]. Law-\nrence and Littler's data showed better survival in 124\nSouth Asians in Birmingham compared with matched\nWhite people [39]. Unpublished data from the UK\nnational audit (MINAP) show 'Asians' were substantially\nless likely to die from AMI than 'Caucasians' (Zaman, M.\nJ., lecture, London School of Hygiene and Tropical Medi-\ncine, 12\/1\/07).\nOur results of better survival are unlikely to be chance or\nanalytic errors. How might we explain them? Were South\nAsians diagnosed at an earlier stage of their disease than\nthe rest of the population? With the recent emphasis on\nheart disease in South Asians this is possible. South Asians\nmay have been quicker to seek medical attention as sug-\ngested by Chaturvedi [40]. Although South Asians may\npresent promptly to hospital they are more likely to\nencounter delays between arrival and treatment as shown\nin some (but not all) studies in the UK [41] and Canada\n[38]. South Asians may have quicker access to emergency\ntreatment in Scotland, particularly in Glasgow and Edin-\nburgh (where most of them live), because of the proximity\nof their inner-city residences to major hospitals. South\nAsians are less likely to get revascularisation as shown by\nFeder et al in London [42].\nAlternatively, non-South Asians, who are mainly White\nScottish people, may have particularly poor survival in\nScotland while South Asians in Scotland have average sur-\nvival. There is evidence for this. Our mortality patterns in\nSouth Asians are similar to those reported by Mak et al in\nSingapore [33] and compatible with the in-hospital mor-\ntality figures in studies by Mukhtar et al [34], Lowry et al\n[35], Lear et al [36], and Gupta et al [38]. Macintyre et al\n[43] have shown an association between social and eco-\nnomic deprivation and survival in Scotland, which might\naccount for Scotland's relatively high mortality. This still\nleaves the question of why this might not apply to South\nAsians. In our results, adjustment for deprivation\naccounted for some but not all of the difference in survival\nbetween South Asians and non-South Asians.\nThe greater risk of AMI among South Asians but better\nprognosis needs further research including on the possi-\nble occurrence of AMI at an early stage in the progression\nof atheroma [44]. Anatomical differences in the coronary\nartery vasculature in South Asians [45] disappear when\npopulations are matched closely, and are unlikely to\nexplain the high risk[46].\nConclusions: public health and clinical practice \nand research\nIt is worrying that South Asians in Scotland are at greater\nrisk of heart attack than a Scottish population internation-\nally notorious for its susceptibility to heart disease. The\nclinical and epidemiological challenges for prevention,\ncontrol and rehabilitation of CHD in South Asians are for-\nmidable. Fortunately, survival after AMI in South Asians\nseems to be comparatively good in Scotland, and similar\nto comparison populations elsewhere. Nonetheless, inci-\ndence and mortality needs to be driven even lower\nthrough better treatment and prevention.\nThis project has created a retrospective cohort of about 4.6\nmillion people living in Scotland at the time of the 2001\nCensus. Subject to ethical approval, future (now funded)\nwork will have the potential to examine health care proce-\ndures and adjust for other variables that are available in\nthe census. This new work will focus on cardiovascular\ndisease, cancers, mental health and maternal and child\nhealth. At its conclusion, scheduled for the end of 2009,\nwe will be able to provide more detailed guidance on fea-\nsibility and costs (currently estimated at £300,000).\nOur approach, potentially, has international applicability.\nIt demonstrates how the glaring absence of cohort studies\nreporting by ethnic group in Europe can be overcome\n[47]. There is considerable potential in linking databases\nthat have previously been considered too sensitive for\nrecord linkage or where linkage is restricted by data pro-\ntection legislation [48]. The methods described here andBMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 9 of 10\n(page number not for citation purposes)\nin more detail in our report [17] have the potential to fill\nthe information gap on data by ethnic group. This gap will\npersist until we have high quality prospective ethnic\ngroup coding systems in health-care databases and the\ninclusion of an ethnic code on birth and death registration\n– both formidable long-term challenges, hitherto unach-\nieved in either Europe or North America [1].\nCompeting interests\nThe author(s) declare that they have no competing inter-\nests.\nAuthors' contributions\nRB was the originator of the project and the principal\napplicant for the grant with JC and CF as co-applicants. RB\nand CF set up the project, with full involvement from JC,\nDK and JJ. CP had the idea of linking the census data to\nthe data held by ISD and he performed most of the link-\nage work including the development of the methods.\nJC had the original plan for the use of one-way encryption\nand led in drafting the methods components of this\npaper. GM was the main contributor from GROS, making\nboth practical and intellectual contributions. CF, RB, and\nMS led the analytic plan for analysis of myocardial infarc-\ntion and CF and MS did the analysis. RB, CP, GM and CF\nare guarantors for this paper. All authors contributed to\nthe design of the study, the writing, and read and\napproved the final version of the manuscript.\nAppendix 1\nWhat was known before\n• There are important ethnic\/racial variations in disease\nand health care\n• Prospective ethnic coding is required or recommended\nin several countries, but has been very difficult to imple-\nment\n• Record linkage techniques have potential in meeting the\nneed for data\n• South Asian populations have high CHD mortality rates,\nbut incidence and survival data are sparse, and not based\non population-based cohort analyses\nWhat is known now?\nEthical and legal obstacles to linking, retrospectively, eth-\nnic codes in the UK census to NHS health and mortality\ndatabases are surmountable\n• 94% of records can be linked, with more than 80% in\nevery census based ethnic group\n• The method creates a retrospective cohort study where\nethnic group and other social status data come from the\ncensus and health outcomes and procedures come from\nNHS databases\n• The incidence of acute myocardial infarction was sub-\nstantially higher in South Asians in Scotland than in the\nremainder of the population\n• Survival following acute myocardial infarction was bet-\nter in South Asians than in the remainder of the popula-\ntion\nThe method has international implications and mandates\nreview of current policies on prospective coding by ethnic\ngroup\nAcknowledgements\nWe thank the Scottish Executive for funding this study and the two organ-\nisations that assisted the Executive in managing the grant and the work – \nthe Public Health Institute for Scotland (now part of NHS Health Scotland), \nand the Information Services Division of NHS National Service Scotland. \nNumerous people offered their expertise, guidance and support (too many \nto list comprehensively).\nDavid Orr of GROS was intimately involved in the linkage study from an \nearly stage and served in the Steering Committee of the project until 2004 \nwhen his place was taken by Peter Scrimgeour and Ganka Mueller. Joe \nFuchs, Ian Maté and Susan Wallace of GROS made many contributions to \nthe linkage component, and Duncan Macniven of GROS gave helpful advice, \nparticularly on dissemination of the findings. Professor Phil Hanlon acted \nenthusiastically and promptly to help make this study possible when it was \nfirst mooted in 2002. Dr Rafik Gardee ensured the study received the full \nbacking of the National Resource Centre for Ethnic Minority Health. Mr \nHector Mackenzie of the Scottish Executive, Dr Mac Armstrong (CMO), \nand Chris Oswald (CRE) also played influential roles in maintaining the \ndirections and funding of the work.\nWe thank Graham McKenzie for helpful comments on a previous draft. \nKate Macintyre advised on analytic methods and interpretation of data, \nusing experience in the SLIDE project, under the direction of Simon \nCapewell. We acknowledge the important influence of the peer reviewers, \nSeeromanie Harding and Niklas Hammar, in shaping the final draft of the \npaper. Finally, we thank our employing organisations for their support of \nour work in this project.\nThe Corresponding Author has the right to grant an exclusive licence for \npublication.\nThis was funded under a special grant from the Scottish Executive. The \nresearchers acted independently of the funding body at all stages of the \nwork.\nReferences\n1. Bhopal RS: Ethnicity, race, and health in multicultural socie-\nties; foundations for better epidemiology, public health, and\nhealth care.  Oxford: Oxford University Press; 2007:357. \n2. General Register Office for Scotland:  [http:\/\/www.gro-scot\nland.gov.uk\/]. (accessed 29th of September 2006)\n3. Blakely T, Woodward A, Salmond C: Anonymous linkage of New\nZealand mortality and Census data.  Aust N Z J Public Health 2000,\n24:92-96. (fuller methodological details for this reference are at http:\/BMC Public Health 2007, 7:142 http:\/\/www.biomedcentral.com\/1471-2458\/7\/142\nPage 10 of 10\n(page number not for citation purposes)\n\/www.wnmeds.ac.nz\/academic\/dph\/research\/HIRP\/nzcms\/\nnzcmsTechRptNo3SH.pdf Nd, accessed 29th of September 2006)\n4. Hammar N, Nerbrand C, Ahlmark G, Tibblin G, Tsipogianni A, Johans-\nson S, Wilhemsen L, Jacobsson S, Hansen O: Identification of Cases\nof Myocardial Infarction: Hospital Discharge Data and Mor-\ntality Data Compared to Myocardial Infarction Community\nRegisters.  International Journal of Epidemiology 1991, 20:114-120.\n5. Hattersley L, Creeser R: Longitudinal Study 1971–1991 – His-\ntory, organisation and quality of data.  London, HMSO; 1995. \n6. Longitudinal studies Centre, Scotland:  [http:\/\/www.lscs.ac.uk\/sls\/].\n(Accessed 29th of September 2006)\n7. Quantin C, Bouzelat H, Allaert FA, Benhamiche AM, Faivre J, Dusserre\nL: How to ensure data security of an epidemiological follow-\nup: quality assessment of an anonymous record linkage pro-\ncedure.  Int J Med Inf 1998, 49(1):117-122.\n8. Churches T, Christen P: Some methods for blindfolded record\nlinkage.  BMC Medical Informatics and Decision Making 2004, 4(1):9.\n9. Khunti K, Samani N: Coronary heart disease in people of South\nAsian origin.  Lancet 2004, 364:2077-2078.\n10. Gill PS, Kai J, Bhopal RS, Wild S: Health Care Needs Assessment:\nBlack and Minority Ethnic Groups.  Health Care Needs Assessment.\nThe epidemiologically based needs assessment reviews. Third Series 2007\n[http:\/\/hcna.radcliffe-oxford.com\/bemgframe.htm]. Abingdon: Radcliffe\nMedical Press Ltd\n11. Bhopal R, Unwin N, White M, Yallop J, Walker L, Alberti K, Harland J,\nPatel S, Ahmad N, Turner C, Watson B, Kaur D, Kulkarni A, Laker M,\nTavridou A: Heterogeneity of coronary heart disease risk fac-\ntors in Indian, Pakistani, Bangladeshi and European origin\npopulations: cross sectional study.  BMJ 1999, 319:215-220.\n12. Cappuccio FP, Cook DG, Atkinson RW, Strazzullo P: Prevalence,\ndetection, and management of cardiovascular risk factors in\ndifferent ethnic groups in south London.  Heart 1997,\n78:555-563.\n13. McKeigue P, Marmot M: Obesity and coronary risk factors\namong south Asians.  Lancet 1991, 337:972.\n14. UK Department of Health: Health Survey for England: the\nHealth of Minority Ethnic Groups '99.  London, The Stationary\nOffice; 2001. \n15. Bhopal R: What is the risk of coronary heart disease in South\nAsians? A review of UK research.  J Public Health Med 2000,\n22:375-385.\n16. Tunstall-Pedoe H, Clayton D, Morris J, Brigden W, McDonald L: Cor-\nonary heart attacks in East London.  Lancet 1975, 2:833-838.\n17. Bhopal R, Fischbacher CM, Steiner M, Chalmers J, Povey C, Jamieson\nJ, Knowles D: Ethnicity and health in Scotland: can we fill the\ninformation gap? A demonstration project focusing on coro-\nnary heart disease and linkage of census and health records.\n[http:\/\/www.chs.med.ed.ac.uk\/phs\/research\/Retrocoding final\nreport.pdf]. (accessed 22\/6\/07)\n18. Newcombe H: Handbook of record linkage: methods for health\nand statistical studies, administration and business.  Oxford:\nOxford University Press; 1988. \n19. Harley K, Jones C: Quality of Scottish Morbidity Record (SMR)\ndata.  Health Bulletin (Edinburgh) 1999, 54(5):410-417.\n20. Quantin C, Bouzelat H, Allaert FA, Benhamiche AM, Faivre J, Dusserre\nL: Automatic record hash coding and linkage for epidemiolog-\nical follow-up data confidentiality.  Methods Inf Med 1998,\n37:271-277.\n21. Editorial: Striking the right balance between privacy and public\ngood.  Lancet 2006, 367(9507):275.\n22. Patel KC, Bhopal RS: The epidemic of coronary heart disease in\nSouth Asian populations: causes and consequences.  Birming-\nham, South Asian Health Foundation  [http:\/\/www.sahf.org.uk\/\nmonograph_2004_march_26.pdf]. (accessed 22\/6\/07)\n23. Cruickshank JK, Beevers DG, Osbourne VL, Haynes RA, Corlett JC,\nSelby S: Heart attack, stroke, diabetes, and hypertension in\nWest Indians, Asians, and whites in Birmingham, England.\nBMJ 1980, 281:1108.\n24. Beevers DG, Cruickshank JK: Age, sex, ethnic origin and hospital\nadmission for heart attack and stroke.  Postgrad Med J 1981,\n57:763-765.\n25. Donaldson L, Taylor J: Patterns of Asian and non-Asian morbid-\nity in hospitals.  BMJ 1983, 286:949-951.\n26. Wilkinson P, Sayer J, Laji K, Grundy C, Marchant B, Kopelman P, Tim-\nmis AD: Comparison of case fatality in south Asian and white\npatients after acute myocardial infarction: Observational\nstudy.  BMJ 1996, 312:1330-1333.\n27. Hughes L, Raval U, Raftery E: First myocardial infarctions in Asian\nand white men.  BMJ 1989, 298:1345-1350.\n28. Britton A, Shipley M, Marmot M, Hemingway H: Does access to car-\ndiac investigation and treatment contribute to social and eth-\nnicdifferences in coronary heart disease? Whitehall II\nprospective cohort study.  BMJ 2004, 329:318.\n29. Wild S, McKeigue P: Cross sectional analysis of mortality by\ncountry of birth in England and Wales, 1970–92.  BMJ 1997,\n314:705-710.\n30. Harding S, Maxwell R: Differences in mortality of migrants.  In\nHealth inequalities Edited by: Drever F, Whitehead M. London: HMSO;\n1997:108-121. \n31. Wild SH, Fischbacher C, Brock A, Griffiths C, Bhopal R: Mortality\nfrom all causes and circulatory disease by country of birth in\nEngland and Wales 2001–2003.  Journal of public health 2007,\n29:191-198.\n32. McKeigue PM, Shah B, Marmot MG: Relation of central obesity\nand insulin resistance with high diabetes prevalence and car-\ndiovascular risk in South Asians.  Lancet 1991, 337:382-386.\n33. Mak KH, Chia KS, Kark JD, Chua T, Tan C, Foong BH, Lim YL, Chew\nSK: Ethnic differences in acute myocardial infarction in Singa-\npore.  Eur Heart J 2003, 24:151-160.\n34. Mukhtar H, Littler W: Survival after acute myocardial infarction\nin Asian and white patients in Birmingham.  Br Heart J 1995,\n73:122-124.\n35. Lowry PJ, Mace PJE, Glover DR, Little WA: The pattern and sever-\nity of coronary artery disease in Asians and white living in Bir-\nmingham.  Postgrad Med J 1983, 59:634-635.\n36. Lear JT, Lawrence IG, Pohl JE, Burden AC: Myocardial infarction\nand thrombolysis: a comparison of the Indian and European\npopulations on a coronary care unit.  J R Coll Physicians Lond 1994,\n28:143-147.\n37. Liew R, Sulfi S, Ranjadayalan K, Cooper J, Timmis AD: Declining case\nfatality rates for acute myocardial infarction in South Asian\nand white patients in the past 15 years.  Heart 2006,\n92:1030-1034.\n38. Gupta M, Doobay AV, Singh N, Anand SS, Raja F, Mawji F, Julian Kho\nJ, Karavetian A, Qilong Y, Yusuf S: Risk factors, hospital manage-\nment and outcomes after acute myocardial infarction in\nSouth Asian Canadians and matched control subjects.  CMAJ\n2002, 166:717-722.\n39. Lawrence RE, Littler WA: Acute myocardial infarction in Asians\nand whites in Birmingham.  Br Med J 1985, 290(6480):1472.\n40. Chaturvedi N, Rai H, Ben-Shlomo Y: Lay diagnosis and health-\ncare-seeking behaviour for chest pain in south Asians and\nEuropeans.  Lancet 1997, 350:1578-1583.\n41. Barakat K, Wells Z, Ramdhany S, Mills PG, Timmis AD: Bangladeshi\npatients present with non-classic features of acute myocar-\ndial infarction and are treated less aggressively in east Lon-\ndon, UK.  Heart 2003, 89:276-279.\n42. Feder G, Crook AM, Magee P, Banerjee S, Timmis AD, Hemingway H:\nEthnic differences in invasive management of coronary dis-\nease: prospective cohort study of patients undergoing angiog-\nraphy.  BMJ 2002, 324:511-516.\n43. Macintyre K, Stewart S, Chalmers J, Pell J, Finlayson A, Boyd J, Redpath\nA, McMurray J, Capewell S: Relation between socioeconomic\ndeprivation and death from a first myocardial infarction in\nScotland: population based analysis.  BMJ 2001, 322:1152-1153.\n44. Anand S, Yusuf S, Vuksan V, Devanesen S, Teo K, Montague P, Kele-\nmen L, Yi C, Lonn E, Gerstein H: Differences in risk factors,\natherosclerosis, and cardiovascular disease between ethnic\ngroups in Canada: the Study of Health Assessment and Risk\nin Ethnic Groups (SHARE).  Lancet 2000, 356:279-284.\n45. Lip GY, Rathore VS, Katira R, Watson RD, Singh S: Do Indo-Asians\nhave smaller coronary arteries?  Postgrad Med J 1999, 75:463-6.\n46. Zindrou D, Taylor KM, Bagger JP: Coronary artery size and dis-\nease in UK South Asian and Caucasian men.  Eur J Cardiothorac\nSurg 2006, 29:492-495.\n47. Ranganathan M, Bhopal R: Exclusion and Inclusion of Nonwhite\nEthnic Minority Groups in 72 North American and European\nCardiovascular Cohort Studies.  PLoS Medicine 2006,\n3:0001-0008.\n48. Chalmers J, Muir R: Patient privacy and confidentiality.  BMJ\n2003, 326:725-726.\nPre-publication history\nThe pre-publication history for this paper can be accessed\nhere:\nhttp:\/\/www.biomedcentral.com\/1471-2458\/7\/142\/pre\npub"}