{"doi":"10.1175\/2009JTECHO684.1","coreId":"58843","oai":"oai:nora.nerc.ac.uk:8734","identifiers":["oai:nora.nerc.ac.uk:8734","10.1175\/2009JTECHO684.1"],"title":"A new statistical modeling approach to ocean front detection from SST satellite images","authors":["Hopkins, Jo","Challenor, Peter","Shaw, Andrew G.P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01","abstract":"Ocean fronts are narrow zones of intense dynamic activity that play an important role in global ocean–atmosphere interactions. Owing to their highly variable nature, both in space and time, they are notoriously difficult features to adequately sample using traditional in situ techniques. In this paper, the authors propose a new statistical modeling approach for detecting and monitoring ocean fronts from Advanced Very High Resolution Radiometer (AVHRR) SST satellite images that builds on a previous “front following” algorithm. Weighted local likelihood is used to provide a smooth, nonparametric description of spatial variations in the position, mean temperature, width, and temperature change of an individual front within an image. Weightings are provided by a Gaussian kernel function whose width is automatically determined by likelihood cross-validation. The statistical model fitting approach allows estimation of the uncertainty of each parameter to be quantified, a capability not possessed by other techniques. The algorithm is shown to be robust to noise and missing data in an image, problems that hamper many of the existing front-detection schemes. The approach is general and could be used with other remotely sensed datasets, model output, or data assimilation product","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/58843.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8734\/1\/11657-2.pdf","pdfHashValue":"c1d992cca0065b3740e05d4c8d97d68f71c0d231","publisher":"American Meteorological Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8734<\/identifier><datestamp>\n      2014-06-19T16:07:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8734\/<\/dc:relation><dc:title>\n        A new statistical modeling approach to ocean front detection from SST satellite images<\/dc:title><dc:creator>\n        Hopkins, Jo<\/dc:creator><dc:creator>\n        Challenor, Peter<\/dc:creator><dc:creator>\n        Shaw, Andrew G.P.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        Ocean fronts are narrow zones of intense dynamic activity that play an important role in global ocean–atmosphere interactions. Owing to their highly variable nature, both in space and time, they are notoriously difficult features to adequately sample using traditional in situ techniques. In this paper, the authors propose a new statistical modeling approach for detecting and monitoring ocean fronts from Advanced Very High Resolution Radiometer (AVHRR) SST satellite images that builds on a previous “front following” algorithm. Weighted local likelihood is used to provide a smooth, nonparametric description of spatial variations in the position, mean temperature, width, and temperature change of an individual front within an image. Weightings are provided by a Gaussian kernel function whose width is automatically determined by likelihood cross-validation. The statistical model fitting approach allows estimation of the uncertainty of each parameter to be quantified, a capability not possessed by other techniques. The algorithm is shown to be robust to noise and missing data in an image, problems that hamper many of the existing front-detection schemes. The approach is general and could be used with other remotely sensed datasets, model output, or data assimilation products<\/dc:description><dc:publisher>\n        American Meteorological Society<\/dc:publisher><dc:date>\n        2010-01<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8734\/1\/11657-2.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8734\/2\/HOPKINS_2010.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hopkins, Jo; Challenor, Peter; Shaw, Andrew G.P..  2010  A new statistical modeling approach to ocean front detection from SST satellite images.   Journal of Atmospheric and Oceanic Technology, 27 (1). 173-191.  https:\/\/doi.org\/10.1175\/2009JTECHO684.1 <https:\/\/doi.org\/10.1175\/2009JTECHO684.1>     \n <\/dc:identifier><dc:relation>\n        10.1175\/2009JTECHO684.1<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8734\/","10.1175\/2009JTECHO684.1"],"year":2010,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Generated using version 3.0 of the official AMS LATEX template\nA New Statistical Modelling Approach to Ocean Front Detection\nfrom SST Satellite Images\nJo Hopkins1 ∗ Peter Challenor2 and Andrew G.P. Shaw2\n1Proudman Oceanographic Laboratory, Liverpool, UK\n2National Oceanography Centre, Southampton, UK\nSubmitted December 2008\n∗Corresponding author address: Proudman Oceanographic Laboratory, Joseph Proudman Building, 6\nBrownlow Street, Liverpool, L3 5DA, UK.\nE-mail: jeh200@pol.ac.uk, Tel: +44(0)151 795 4859\n1\nABSTRACT\nOcean fronts are narrow zones of intense dynamic activity that play an important role in\nglobal ocean-atmosphere interactions. Owing to their highly variable nature, both in space\nand time, they are notoriously difficult features to adequately sample using traditional in-situ\ntechniques. In this paper we propose a new statistical modelling approach to detecting and\nmonitoring ocean fronts from AVHRR SST satellite images that builds on the ‘front following’\nalgorithm of Shaw and Vennell (2000). Weighted local likelihood is used to provide a smooth,\nnon-parametric description of spatial variations in the position, mean temperature, width\nand temperature change of an individual front within an image. Weightings are provided\nby a Gaussian kernel function whose width is automatically determined by likelihood cross-\nvalidation. The statistical model fitting approach allows estimation of the uncertainty of each\nparameter to be quantified, a capability not possessed by other techniques. The algorithm\nis shown to be robust to noise and missing data in an image, problems that hamper many of\nthe existing front detection schemes. The approach is general and could be used with other\nremotely sensed data sets, model output or data assimilation products.\n1\n1. Introduction\nThe advent of Earth observation satellites in the 1970’s has revolutionized the oceanog-\nrapher’s ability to study oceanic structures such as ocean fronts; the narrow regions marking\nthe transition between two different water masses. Fronts are characterized by intense hori-\nzontal gradients in sea surface temperature, salinity, biological and\/or chemical properties.\nThey are highly dynamic zones continually changing through both space and time as the\nadjacent water masses are modified by across frontal mixing, vertical transport and air-\nsea interaction. Ocean fronts are climatologically important regions and play a substantial\nrole in global ocean-atmosphere interactions. Of particular significance is the circumglobal\nfrontal system of the Southern Ocean where intermediate water masses are formed (Spall\n1995; Garabato et al. 2001), heat, salt, nutrients and momentum are redistributed, biological\nactivity is stimulated (Moore and Abbott 2000), and atmospheric carbon dioxide is absorbed\n(Murphy et al. 1991; Currie and Hunter 1998, 1999). Variability of the strength and location\nof sea surface temperature fronts is also important to the coupling of winds and upper-ocean\nprocesses (O’Neill et al. 2003; Chelton et al. 2004).\nThe availability of a large and rapidly expanding data set of remotely sensed sea surface\ntemperature (SST), altimetry and ocean colour has fueled a growing interest and demand\nfor objective and automatic techniques to detect and monitor fronts. Accurate knowledge\nof frontal zones and how they change both temporally and spatially is important to many\norganizations worldwide with such diverse tasks as climate variability and monitoring, oper-\national weather and ocean forcasting, validating ocean and atmospheric models, ecosystem\nassessment and fisheries research.\n2\nFronts exhibit nonlinear flows and processes on a range of different temporal and spatial\nscales. Successful detection and monitoring therefore is a nontrivial problem. Capturing\nfrontal features as they grow, merge, split, shrink and disappear is a considerable challenge.\nComplicating the task are the resolution limitations imposed by the instruments being used\nto image these phenomena. Noise and missing data owing to sensor inaccuracies, thermal\ncalibration, atmospheric correction and cloud further add to the challenge of accurate de-\ntection.\nFinding ocean fronts in remotely sensed imagery is a problem that has been approached\nin four different ways:\n1. derivative based edge detection,\n2. gradient magnitude thresholds,\n3. statistical\/probabilistic edge discrimination and classification, and,\n4. surface fitting.\nDerivative based edge detectors rely on locating gradient discontinuities in SST images\nthat mark a sharp transition from cold to warm water (or vice versa). Examples include\nthe Prewitt, Sobel, Kirsh, Roberts and LoG gradient operators (Simpson 1990). These\nmethods, based on image processing techniques, however are generally not well suited to\noceanographic remote sensing applications (Holyer and Peckinpaugh 1989); they struggle\nto discriminate between weak, small scale features and noise. Often a pre-filtering stage\nis required (e.g. Canny operator), but this smoothing blurs features and sharp gradients\nand makes subsequent edge detection more difficult. Setting an SST gradient magnitude\n3\nthreshold is a simple alternative way in which fronts may be mapped (Belkin and Gordon\n1996; Kostianoy et al. 2004; Moore et al. 1997, 1999; Dong et al. 2006).\nMore sophisticated techniques involve the classification of pixels or windows of data and\nsome form of statistical or probabilistic analysis to determine the presence of a front. Algo-\nrithms that fall into this category may be further subdivided: distribution diversity (entropy)\nbased methods (Vazquez et al. 1999; Shimada et al. 2005); histogram analysis (Cayula and\nCornillon 1992, 1995; Marcello et al. 2005); a clustering based approach (Holyer and Peckin-\npaugh 1989); and an examination of the moments combined with a-priori knowledge of the\nregion (Gerson et al. 1979; Coulter 1983). Other edge detectors tested in an oceanographic\nfrontal context include the wavelet based approach of Simhadri et al. (1998), mathematical\nmorphology algorithms (Lea and Lybanon 1993; Krishnamurthy et al. 1994) and the Or-\ndered Structural Edge Detector of Holland and Yan (1992). The histogram based Single\nImage Edge Detector (SIED) of Cayula and Cornillon (1992) has been used in many studies:\nUllman and Cornillon (2001), Hickox et al. (2000) and Mavor and Bisagni (2001) to name\nbut a few. Miller (2004) for example uses the SIED as the basis for constructing five day\ncomposite sediment, chlorophyll and thermal front maps which are then combined into a\nsingle multi-spectral image. This approach is ideal if a broad, perhaps exploratory study of\nthe variability and relationship between the surface physical and biological properties within\na region is required.\nShaw and Vennell (2000) use a surface fitting technique to ‘follow’ ocean fronts. An\nS-shaped function is fitted using least-squares to data extracted within a 20×30 km window\ncentered at the front and orientated along its approximate direction. The approach is unique\nin the sense that it provides estimates not only of the front’s location, but also of key frontal\n4\nparameters: the mean temperature at the front, its width, and the temperature difference\nbetween the water masses on either side. Calculation of the orientation allows the extraction\nwindow to be stepped 2 km further along the projected path of the front resulting in a\ntracking routine across the image. One of the disadvantages of this technique is the bias\nintroduced by user interaction. Since the algorithm is unable to track through cloud due to its\nfield-of-view being limited to the extraction window, it is often necessary to break the front up\ninto a series of segments, the processing of each requiring initialization parameters provided\nby the user. In an attempt to eliminate this bias Lou et al. (2005) apply a Prewitt gradient\noperator to automatically locate the front and initiate the ‘front following’ algorithm at each\nsegment. The fixed window size used by Shaw and Vennell (2000) is a further limitation\nof the technique since it restricts the smallest resolvable feature to 20 km in an along-front\ndirection. This is evident when the algorithm is compared to a 3×3 Prewitt edge detector.\nThe ‘front following’ technique fails to capture the smaller scale features resolved by the\ngradient operator. The fixed size may be optimal for one segment, providing a sufficient\namount of smoothing while not blurring oceanic features of interest, but be suboptimal for\nanother where the length scale of features or number of available observations has changed.\nIn this paper we introduce a new front detection algorithm, based on Shaw and Vennell\n(2000), that targets a specific frontal structure, is robust to noisy and missing data and\nrequires a minimum of user interaction. We extend the idea of statistical model fitting by\nusing a weighted local likelihood approach to provide a smooth, non-parametric description\nof spatial variations in the position and strength of ocean fronts from remotely sensed SST\nimages. A likelihood based approach allows us to quantify estimation uncertainty associated\nwith each parameter. As yet, no other front detection technique is able to do this.\n5\nWe illustrate the algorithm with data from the Southland Front, a localized section of\nthe global Subtropical Front off the south-east coast of South Island, New Zealand. The\nSouthland Front is a well defined boundary separating subantarctic and subtropical surface\nwaters (Jillett 1969; Heath 1985; Shaw and Vennell 2001).\nThis paper is divided into a further six sections. Section 2 describes the data we use\nto illustrate the algorithm. In Section 3 the idea of maximum likelihood is introduced in\nthe context of front detection and the mathematical function used to model the change in\nsurface temperature across a front is described. Section 4 extends the idea of likelihood\nto regression models as a means of estimating spatial trends in frontal characteristics i.e.\nestimating any increases or decreases in the strength or temperature of the front as it’s\nlocation changes. The performance and limitations of the algorithm are evaluated in Section\n5 and the results compared to the ‘front following’ algorithm (Shaw and Vennell 2000) in\nSection 6. Conclusions are presented in Section 7 together with a discussion of the algorithm’s\nadvantages, limitations and potential future developments.\n2. Data set\nTo illustrate the method we use a series of monthly composites of 4 km Pathfinder V5\nAVHRR infrared SST data from around South Island, New Zealand. These were downloaded\nthrough NASA’s Physical Oceanography Distributed Active Archive Center (PO.DAAC)\nPOET data server (http:\/\/poet.jpl.nasa.gov\/) in netcdf format. Observations are globally\ngridded into equiangle 0.044×0.044◦ pixels. Data were obtained for the period between\nJanuary 1985 though to December 2005 (inclusive), providing a twenty-one year time series\n6\nof 252 images that were used in the development of the algorithm. Only night-time overpasses\nwere used to avoid any surface skin created by diurnal warming masking the true surface\nfrontal structure.\n3. A model ocean front: maximum likelihood\nRemote thermal infrared and passive microwave sensors allow us to measure the rapid\nchange in SST across ocean fronts. It is this surface expression that we aim to model.\nSuppose that Z = {z(1), z(2) · · · , z(n)} is a vector of independently observed temperatures at\nright angles across an ocean front. The probability of these observations being drawn from a\ngiven model front may be expressed in terms of a likelihood function. This may be thought\nof as the formula for the joint probability distribution of the sample Z. If p(Z;θ) represents\nthe probability density function of Z with a vector of unknown parameters θ, then:\nLikelihood ≡ l(θ;Z) ≡ p(Z;θ) =\nn∏\ni=1\np(z(i);θ), (1)\nwhere n is the number of observations across the front. The aim of maximum likelihood esti-\nmation is to find the set of values of the unknown parameters θ, that given SST observations\nZ, make the likelihood l(·) a maximum.\nNow assume that each SST observation (z(i)) is drawn from a normal distribution, φ(·),\nwith mean E(z(i)) and variance V(z(i)) = σ2, assumed to remain constant for all i. A\nnormal distribution is chosen in the absence of any other information about the observations\nand could be changed when necessary, for example where, because of incorrect flagging\n7\nof scattered cloud, the distribution is skewed. If the expectation E is determined by the\nfunction m(Y;θ), where Y = {y(1), y(2) · · · , y(n)} is a vector of known distances across the\nfront corresponding to observations Z = {z(1), z(2) · · · , z(n)}, and the parametric model m(·)\nhas a vector of unknown parameters, θ = {θ1, θ2, . . . , θq}, we may express the likelihood of\nobserved temperatures Z by:\nl(θ, σ;Z) =\nn∏\ni=1\nφ\n(\nE(z(i)),V(z(i))\n)\n=\nn∏\ni=1\nφ\n(\nm(y(i);θ), σ2\n)\n=\nn∏\ni=1\n1√\n2piσ2\nexp\n[\n−(z\n(i) −m(y(i);θ))2\n2σ2\n]\nSigma, σ, may be thought of as the standard deviation of noise about the model function.\nThese concepts and assumptions are illustrated graphically in Figure 1a.\nIt is often more convenient to maximize the log of the likelihood. Letting L(·) denote the\nlog of the likelihood, ln(l(·)):\nL(θ, σ;Z) =\nn∑\ni=1\nln\n{\n1√\n2piσ2\nexp\n[\n−(z\n(i) −m(y(i);θ))2\n2σ2\n]}\n=\nn∑\ni=1\n[\nln(1)− (ln\n√\n2pi + lnσ)\n]\n−\nn∑\ni=1\n(z(i) −m(y(i);θ))2\n2σ2\n,\nSince ln(1) = 0, and ignoring − ln√2pi as an irrelevant constant,\nL(θ, σ;Z) = −n lnσ − 1\n2σ2\nn∑\ni=1\n(z(i) −m(y(i);θ))2. (2)\nThe maximum likelihood estimates θˆ and σˆ are attained when the rate of change of L(·),\nwith respect to the unknown parameters θ and σ, equals zero.\n8\nThe function m(·) used to model the change in surface temperature across a front is\nrequired to be a sigmoid (S-shaped) function that is able to emulate the steep thermal\ngradient at the interface between two water masses with disparate surface temperatures.\nPrevious work by Shaw and Vennell (2000) uses the hyperbolic tangent, and we adopt the\nsame function here to represent a cross section of sea surface temperature observations.\nZ = m(Y;θ) + \u000f = θ1 + θ2 tanh\n[\nY + θ4\nθ3\n]\n+ \u000f. (3)\nθ1 is the front’s mean temperature. 2θ2 and 2θ3 define the temperature difference and\nwidth respectively. θ4 is a translation parameter determining the position of the front within\nan equiangle arc degree grid. The noise, \u000f, is assumed to be normally distributed with zero\nmean and standard deviation σ. Figure 1b is a graphical representation of the how the model\nparameters may be interpreted in a more physical sense.\nUsing this model, and setting θ = {θ1, θ2, θ3, θ4, σ}, the log-likelihood may now be ex-\npressed in full as follows:\nL(θ;Z) = −n lnσ − 1\n2σ2\nn∑\ni=1\n(\nz(i) −\n(\nθ1 + θ2 tanh\n[\ny(i) + θ4\nθ3\n]))2\n. (4)\nThe advantage of using maximum likelihood over other parameter estimation techniques\nsuch as least-squares are its statistical properties that allow the construction of confidence\nintervals around θˆ = {θˆ1, θˆ2, θˆ3, θˆ4, σˆ}. Asymptotically (as n→∞), the maximum likelihood\nestimator is unbiased, has the smallest possible variance and is consistent. Thus as n→∞,\nit holds that E(θˆ) = θ, Var(θˆ) = −H−1(θˆ) and therefore θˆ ≈ φ(θ,Var(θˆ)), where H\nis a matrix of second order partial derivatives with respect to the unknown parameters.\n9\nThat is, the distribution of estimates is asymptotically normal with the true (but unknown)\nparameters θ as expectation. For small n this is an approximation (Davison 2003). The\nestimated variances of the maximum likelihood estimates are equal to the diagonal elements\nof, −H−1(θˆ) , the asymptotic variance-covariance matrix. The square root of the diagonal\nelements yields the standard errors. Given the asymptotically normal distribution of the\nmaximum likelihood estimates, confidence intervals for θˆ may be constructed:\nθˆ − tα,υ · Var(θˆ) 12 ; θˆ + tα,υ · Var(θˆ) 12 ,\nwhere tα,υ is the t-value for a t-distribution with υ degrees of freedom for a 100(1 − α)%\nconfidence interval. υ is defined as n− 5, the number of observations minus the number of\nunknowns being estimated.\nMaximum likelihood parameter estimates are made based on the assumption that each set\nof SST observations (Z) are taken at approximately right angles across the front and we may\nwant to orientate our data to make this assumption more reasonable. In our illustration, the\nSouthland Front approximately follows the 500 m isobath (Shaw and Vennell 2001), that runs\nsouth-west to north-east along the east coast of South Island, New Zealand. Observations\nfrom the original AVHRR SST image are therefore extracted within a rotated window and\nset within a new co-ordinate system before parameter estimates are made (Figure 2). In this\nway more accurate estimates of frontal characteristics are obtained. The limitations and\ncomplications of not specifically including an orientation parameter in the model function\nare discussed in Section 5.\nA Newton-Raphson optimization scheme is used to calculate the maximum likelihood\n10\nestimates θˆ. Initial values are needed for parameters in the model to start the optimization.\nIn our example we take the mean temperature (11.01◦C), width (8.36 km), and temperature\nrange (1.76◦C) of the Southland Front as estimated by Shaw and Vennell (2001) as start-\ning values for θ1, 2θ2 and 2θ3. The position (θ4) and standard deviation about the mean\nmodel (σ) are set initially to 0.5◦ and 0.15 respectively. To facilitate rapid and successful\nconvergence a linear transformation is applied to all unknown variables by imposing upper\nand lower bound constraints (Table 1). The limits are determined by the resolution and\naccuracy of the data set, the size of the image and reasonable geophysical values expected\nfor sea surface temperatures and frontal scales in the region.\nGiven that sea surface temperatures around New Zealand are unlikely to exceed 23◦C\nthroughout the year (Heath 1985; Chiswell 1994; Uddstrom and Oien 1999; Shaw and Vennell\n2001), the mean frontal temperature (θ1) is given an upper bound of 23\n◦C. As in Shaw and\nVennell (2000), a lower bound of 5◦C is set for θ1 so as to exclude any high level cloud that\nmay have been missed by the cloud clearing algorithms. Taking into account the range of the\nseasonal SST cycle around New Zealand (Heath 1985; Chiswell 1994; Uddstrom and Oien\n1999), an upper limit of 6◦C was set for the temperature difference (2θ2) across the front.\nAny greater difference seems unreasonable and likely to include cloud. The lower bound for\nthe temperature range was set at 0.1◦C, the approximate relative accuracy of the Pathfinder\ndata set (K.Casey, NOAA, personal communication). The maximum and minimum bounds\nfor the frontal width (2θ3) are determined by the size (1\n◦×2.8◦) and resolution (0.044◦) of the\nimages. Note that only one front is allowed to exist. Each image is 1◦ wide, approximately\n100 km (across-front scale), therefore an upper width range was set at 0.6◦(∼60 km). This\nallows for roughly 20 km of data from each plateau region on either side of the front. Having\n11\na sufficient amount of data to identify these regions was found to be important by Shaw and\nVennell (2000). The lower limit is set by the 0.044◦ (∼4 km) data resolution. The width and\ntherefore gradient of features smaller than this can not be accurately resolved. Estimates\nof the temperature, temperature difference and position to within a pixel however may still\nbe regarded as reliable, although the errors associated with them may not be. The frontal\nposition (θ4) is bounded by the limits of the extracted image.\nFigure 3 is an example of the model function fitted to five different sets of SST observa-\ntions taken across the Southland Front. 95% confidence intervals are given for each estimated\nparameter. Note how the estimated characteristics of the front vary between each profile.\n4. A non-parametric model for spatial trend\nThe position, strength and temperature of fronts change across ocean basins in response\nto localized oceanic and atmospheric conditions and interactions such as: stratification,\nwind stress and mixing, sea level pressure, bathymetry, vorticity constraints, regional eddy\nactivity, circulation dynamics and remote ocean-atmosphere forcing. To capture these spatial\nchanges local likelihood, an extension of weighted local fitting techniques to likelihood based\nregression models (Tibshirani and Hastie 1987), is used to create a smooth, non-parametric\ndescription of spatial variations in frontal characteristics.\nAssume that temperature observations Zj = {z(1)j , . . . , z(n)j } are available at fixed and\nknown positions xj along the front, where j = {1, . . . ,m}. Observations Zj are realizations\nfrom the parametric model of Eq.(3):\n12\nZj = m(xj,Yj; Φ(xj)) = θ1,j + θ2,j tanh\n[\nYj + θ4,j\nθ3,j\n]\n+ \u000fj,\nwhere \u000fj is normally distributed random noise with a mean of zero and unknown variance\nσj. Yj = {y(1)j , . . . , y(n)j } is a vector of known distances across the front indexed by the\nsuperscript i = {1, . . . , n}. We now assume that the unknown parameters θ are themselves\na smoothly varying function of x denoted by Φ(xj). θj = {θ1,j, θ2,j, θ3,j, θ4,j, σj} as before\nrepresent the front’s mean temperature, the across-front temperature change, the width,\nposition and standard deviation of noise about the model fit. We are interested in estimating\nthe smooth function of parameters θ as they vary along the front, i.e. the function Φ(x).\nA standard approach would be to assume a parametric model for the form of Φ(x),\nsuch as a linear regression where θj = α + βxj. The likelihood equation l(α,β) =∏m\nj=1m(xj,Yj; Φ(xj;α,β)) would then be solved to obtain parameter estimates αˆ and βˆ\nand a fitted across-front temperature profile Zˆj = m(xj,Yj; Φˆ(xj)). However, such a para-\nmetric approach is not justified in the case of frontal modelling; we can not presume to know\nhow a parameter may vary in such a complex system.\nIn contrast, the local likelihood method assumes only that θ is a smooth function of x and\nis an ideal alternative approach. We estimate the coefficients of the function Φ(x) locally\nat each discrete point xj. The most basic case is where Φ(xj) is assumed approximately\nconstant at points close to xj, i.e. no particular model for the behavior of the parameters\nnear xj. Denoting the log-likelihood associated with m(·) from the jth set of temperature\nobservations as:\n13\nL(θj;Zj) = −n lnσj − 1\n2σj2\nn∑\ni=1\n(\nz\n(i)\nj −\n(\nθ1,j + θ2,j tanh\n[\ny(i) + θ4,j\nθ3,j\n]))2\n, (5)\nthe local likelihood estimator for θj is of the form:\nθˆj = max\nθj\nm∑\nk=1\nK(xk − xj;h) · L(θj;Zk), (6)\nwhere K(xk − xj;h) is a normal smoothing function such that\n∑m\nk=1K(xk − xj;h) = 1,\nwith bandwidth h > 0. The bandwidth controls the spatial smoothness of θˆj. Note that\nj is fixed with k varying over the points k = {1, . . . ,m}. The estimator θˆj is the value\nof θj which maximizes the weighted sum of likelihood contributions w(xk, xj)L(θj;Zk) in\nwhich the weights w(xk, xj) = K(xk − xj;h) are dependent upon the separation of xk and\nxj. The symmetry of the normal function ensures that most weight is given to the point of\ninterest xj. By solving each of these weighted local likelihood problems at each position xj\nwe obtain a series of smooth parameter estimates (xj, θˆj), and a fitted set of temperature\nprofiles Zˆj = m(xj,Yj; θˆj). Estimation uncertainty is quantified as before by constructing\nthe variance-covariance matrix of estimates at each position xj.\nThis local likelihood approach is a significant improvement over the standard maximum\nlikelihood estimates (i.e. where h = 0◦). The local likelihood estimates are constructed\nfrom a much larger set of observations and therefore have reduced confidence intervals.\nIn addition, estimates in those regions with a sparsity or complete absence of temperature\nobservations are made possible by drawing on surrounding information. The quality flagging\nsystem described in the appendix provides a means of identifying estimates made in these\nareas. The algorithms ability to deal with missing data is illustrated in Section 5.\n14\na. Bandwidth selection: likelihood cross validation\nThe bandwidth h, which for the Gaussian kernel is the standard deviation, controls the\nwidth of the kernel and hence the smoothness of the fitted non-parametric regression. Larger\nvalues of h correspond to stronger levels of smoothing. Setting the bandwidth equal to zero,\nthe local likelihood estimator reduces to the standard maximum likelihood estimate in Eq.(4)\nand parameters θj are estimated using only data from points xj. Taking h→∞ on the other\nhand sets the parameters constant globally with distance. Somewhere in between there is\nan optimal value of h, which may be considered as a measure of model order or complexity.\nLikelihood cross-validation, an automatic method designed to determine the level of\nsmoothing best supported by the available data (Silverman 1986) is used to select an optimal\nbandwidth hop for each image. Figure 4 compares the fitted non-parametric trend for each\nmodel parameter using bandwidths h = 0◦, h = 0.025◦, hop = 0.11◦ and h = 0.3◦. When\nh is small (h = 0.025◦) too much of the high frequency variability introduced by the noise\nin the observations is modelled. When h is large (h = 0.3◦) much of the mesoscale spatial\nstructure is lost. The optimal bandwidth (hop = 0.11\n◦) captures mesoscale variability in the\nfront’s position, temperature and strength, while not over-smoothing and missing potentially\nimportant features.\nReturning to our example, out of 252 monthly 4 km resolution images of the Southland\nFront the median value of hop based on likelihood cross-validation is 0.095\n◦ (∼10.6 km).\nA kernel with this bandwidth assigns the highest 95% of weights to observations within\na 21.6 km window centred about the point of estimation. This distance is comparable to\nthe expected length scale of physical processes in the region; the Baroclinic Rossby Radius\n15\naround South Island, New Zealand is approximately 20 km (Chelton et al. 1998). We can\nbe confident therefore that likelihood cross-validation is selecting a physically appropriate\nlength scale for the smoothing parameter as well as one that balances the bias and variance\nof the estimates.\nb. Local likelihood optimization\nNewton-Raphson is used to find the local likelihood estimates θˆj. Since this optimization\ntechnique can be sensitive to the initialization parameters (Gill et al. 1995), the bandwidth is\ninitially set to zero and estimates from this simplified problem (i.e. no smoothing function)\nare then used as a starting point for the full local likelihood solution. Other more robust\noptimization routines such as the Simplex could be used where an initial guess close to the\ntrue parameter values is not possible. This may result however in a substantial increase in\ncomputing time. In an attempt to minimize the influence of areas where SST observations\nare: a. limited; b. unevenly distributed such that the frontal structure is not detectable; or\nc. where there is no discernible change in gradient, weightings additional to those supplied\nby the kernel function K(·) based upon the distance between xk and xj are introduced. In\nthis way the quality or reliability of each likelihood contribution is also considered. Full\ndetails of the criteria used to assign these extra weightings are given in Hopkins (2008) and\nAppendix A.\nFigure 5 shows the along-front trend in frontal characteristics for June 2004. This example\ndemonstrates the algorithms ability to make estimates in regions where SST observations\nare unavailable. The size of the confidence interval increases where there is a lack of data.\n16\n5. Performance evaluation\nTwo aspects of the algorithms performance were tested using a simulated data set: 1. its\nability to cope with noisy data; and 2. the implications of a meandering front. An artificial\nimage was constructed with the same size (1◦×2.8◦) and resolution (0.044◦) as the AVHRR\nSST images used in algorithm development. A straight front with constant parameters\nθ1 = 12\n◦C, 2θ1 = 2◦C, 2θ3 = 20 km, and θ4 = 0.5◦ was built centrally across this image.\nThe loss in accuracy and precision of estimates as the level of noise increases in an image\nis shown in Figure 6. Normally distributed random noise φ(0, σ2) with σ between 0.05 and\n0.55 was added to the base image and estimates with bandwidths h = 0◦ and h = 0.15◦\nwere made at each point xj. For σ = 0.05 the front is very well defined. When σ = 0.55\nno frontal structure can be distinguished through the noise. For a bandwidth of zero, the\nrange of estimates increases rapidly as the amount of noise becomes more significant. This\nis brought under control by increasing the smoothing parameter to h = 0.15◦. Note that\nfor h = 0◦, the standard deviation of noise is increasingly underestimated as the true value\nincreases (Figure 6a, panel E). This is improved by using a bandwidth of 0.15◦ (Figure 6b,\npanel E). If the relative accuracy of AVHRR measurements between pixels is of the order\n0.1◦C we conclude that the local likelihood estimates are not overly sensitive to noise and\nerrors in the AVHRR SST measurements.\nThe model function is fitted based on the assumption that the front is oriented east-\nwest across the image (i.e. each cross section of observations (Z) is at right angles to the\nfront). In reality fronts meander and the angle at which each cross section bisects the front\nmay change. The artificial front (with a width of 10 km) was rotated between 0◦ and 90◦\n17\nfrom the horizontal. A front with an angle of 0◦ is bisected at right angles by each cross\nsection. An angle of 90◦ represents a front orientated north-south across the image. Figure\n7 shows how each parameter estimate (for h = 0◦) deviates from its true value as the angle\nof rotation increases. Estimates of the mean temperature, temperature range and position\nremain unaffected by the orientation of the front. Estimates of the width and therefore\nthe gradient are more sensitive. The estimated width exponentially increases as the angle\nsteepens (Figure 7c). Beyond 25-30◦ the width is overestimated by >14% resulting in an\nunderestimate of the gradient. Additionally, the standard deviation of noise about the model\nfit (Figure 7f) is slightly underestimated by 0-5% of the true value between 0◦ and 40◦. This\nis consistent with results presented in Figure 6. At angles greater than 40◦ it is overestimated.\nThis experiment highlights that using this version of the algorithm estimates of the width\nand gradient must be treated with caution in regions where the front meanders at angles\ngreater than 25◦. Note that if the front is not perpendicular to the axis along which the\ncross sections are taken then the errors resulting from any rotation are not represented in\nthe algorithms error estimates.\nThe orientation of the front and hence the angle at which data Zk are extracted, like\nthe mean temperature and position etc. is an unknown variable, but not one that is easily\nincorporated into the optimization. Unlike the other parameters in vector θ its value would\nneed to be allowed to vary spatially between points k during the optimization such that it\nresulted in the smallest possible estimate of the width (or greatest gradient) at each position.\nThis would make the optimization more complex. Furthermore, continually adjusting the\nextraction angle for vectors Z at each iteration would result in SST observations being\nused more than once. The effect on the underlying statistics of the technique of repeatedly\n18\nusing the same data is difficult to quantify. Maximum likelihood requires samples to be\nindependent, if vectors Zk and Zk+1 contain some of the same measurements then this\nrequirement is clearly not met. Including a rotational parameter presents complications to\nboth the optimization, programming and statistical assumptions of the technique. Possible\nsolutions are discussed in Section 7.\nOne of the objectives in the development of a new front detection algorithm was to\nminimize the loss of information owing to regions occluded by persistent cloud cover. To\ntest the robustness of the technique to data loss, SST observations are removed from a\ncloud free composite image of the Southland Front (September 1997). Instead of trying\nto simulate the real spatial patterns of cloud cover and contaminated SST retrievals, the\npatterns of missing data from a selection of other months provides a means of removing\nobservations. Figure 8a shows along-front estimates of parameters for the cloud free image\nof September 1997. Note that the data missing in the top left hand corner is the Dunedin\nHeadland. In Figure 8b a small (16%) percentage of the observations have been removed,\nmostly over the front itself. In Figure 8c over 40% of measurements are missing. Estimates\nof the front’s position are most robust to a sparse data set, deviating very little from the\noriginal estimate made with a complete set of observations. Where observations have been\nremoved the width is underestimated, although the estimate made with a complete data set\nfalls, for the most part, within the 95% confidence interval. There are two peaks (>50km) in\nthe estimated width. These points correspond to increases in the angle of the front relative\nto the horizontal and subsequent overestimation of the width.\n19\n6. Comparison to other techniques\nThe local likelihood algorithm is directly compared to the ‘front following’ algorithm of\nShaw and Vennell (2000) as an independent means of validating its performance. In Figure 9\nthe location of the Southland Front on 28 March 1990 as estimated by both techniques from\na daily 1 km resolution AVHRR SST image is shown. Also plotted are the fronts identified\nby the Single Image Edge Detector (SIED) (Cayula and Cornillon 1992).\nThe local likelihood and ‘front following’ algorithms produce very similar estimates of\nthe front’s position and both agree with the western most structure picked out by the SIED.\nThe local likelihood estimates highlight more of the mesoscale variability than the ‘front\nfollowing’ algorithm. This is likely due to the limited resolvable along-front length scale\nimposed by the 20 km wide moving window used by Shaw and Vennell (2000). There are\ngaps around 44.5◦S and 45.8◦S in estimates made by the ‘front following’ algorithm where the\nroutine was unable to identify the front. There are no gaps in the local likelihood estimates\nalthough the location of the front over the Dunedin Headland is clearly incorrect. This\nhowever is identified by flagging those sets of estimates where one or more of the parameters\nin vector θˆj is on an upper or lower bound (see Table 1).\nThe SIED helps identify frontal structures further offshore and reveals a possible double\nstructure to the Southland Front. North of Dunedin both the ‘front following’ algorithm and\nlocal likelihood estimates most closely follow the more shoreward of the two SIED fronts.\nThis would suggest that the strongest of the two structures is found further west.\nTable 2 compares the mean parameter estimates made by the ‘front following’ and local\nlikelihood algorithms over three discrete sections A-C (shown in Figure 9). Identifying\n20\nlatitudinal sections over which both algorithms performed successfully is the best way to\nquantitatively compare the performance of the two techniques. Estimation of the standard\nerrors using the local likelihood algorithm allows weighted mean estimates for each section to\nbe calculated. Each estimate is weighted by the inverse of its own variance. No consideration\nof the reliability of estimates contributing to the mean is possible with the ‘front following’\ntechnique. In all three sections estimates of the temperature (θ1) and temperature range\n(2θ2) are comparable. Estimates of the width (2θ3) however are not in such close agreement.\nThe disparity is most pronounced in section A, south of Dunedin, where the local likelihood\nalgorithm estimates a tight meander in the position of the front (Figure 9). Using the ‘front\nfollowing’ algorithm the width of the Southland Front over this section is estimated to be 8.10\nkm. The local likelihood approach returns a much greater estimate of 16.09±0.6 km. This\nis likely the result of overestimation due to the front’s orientation. The moving extraction\nwindow used in the ‘front following’ algorithm is aligned normal to the front and therefore\nthis technique does not suffer the same problem.\n7. Discussion and conclusions\nIn this paper we have demonstrated how local likelihood may be used to help detect and\ncharacterize ocean fronts. The rapid change in SST between two different water masses on\neither side of a front is modelled using an S-shaped (tanh) function. The unknown parameters\nof this model are determined by maximizing a weighed sum of likelihood contributions from\nall available cross sections of SST observations in an image. A Gaussian smoothing function\nassigns weightings based on the distance of observations from the point of estimation. The\n21\nbandwidth of the kernel function determines the smoothness of the fitted nonparametric\nregression, with larger values corresponding to stronger levels of smoothing. Likelihood\ncross validation is used to determine the optimal level of smoothing best supported by the\navailable data. The weightings assigned by the kernel smoother are modified by an additional\nweighting based on an assessment of the quality of the likelihood contributions from each set\nof SST measurements. Estimation uncertainty is quantified by standard errors calculated\nfrom the variance-covariance matrix of each local likelihood solution.\na. Advantages and limitations\nThe local likelihood approach has both advantages and disadvantages over other front\ndetection techniques. It should therefore be considered as an additional tool in the suite of\nexisting SST front detection algorithms. In this section we discuss the merits, drawbacks\nand assumptions of the new technique.\nThe local likelihood algorithm is not overly sensitive to noise and regions with partially\nmissing data. This means that a pre-filtering routine often necessary with other techniques\n(e.g. Canny edge detection, SIED) is not required. In this way all frontal structures within\nthe original image are preserved. The technique targets a unique frontal structure rather\nthan locating all gradient discontinuities in an image. Key estimates of frontal strength and\ntemperature are obtained, important variables in terms of the structure and dynamics of\nthe front and how it interacts with other oceanic phenomena and the atmosphere above.\nCrucially, uncertainty estimates are made which may be taken into account when results\nare used in further quantitative studies. However, using an S-shaped model function that\n22\nallows for only one front is in some situations inappropriate. Fronts may bifurcate and then\nmerge back together, creating multiple frontal structures. Fronts may also be embedded in\na surrounding weak but non-zero gradient field for which the sigmoid function is not best\nsuited. In these situations other techniques better equipped for finding multiple fronts rather\nthan characterizing one particular feature may perform better. Similarly, the performance of\nthe local likelihood algorithm deteriorates in areas of high meandering intensity and where\nsmall high gradient eddies are common. This is a further example of where alternative\ntechniques need to be explored. Adding a second, third or fourth etc. function to the model\nwould in theory allow more than one front in an image to exist. Further investigation into\nhow such a model would perform in practice however is left for future research. Possible\nsolutions to the problems caused by the front’s orientation are addressed in Section 7b.\nCurrently, the new algorithm requires some initial knowledge of the approximate location\nand orientation of a front if it is to return good quality results. If little or no information\nabout the area and front to be studied is available then the automated front detection\ntechniques of Cayula and Cornillon (1992), Miller (2004) or Holyer and Peckinpaugh (1989)\nwould be a useful starting point in making a first estimate of location and variability. From\nthis, an appropriate range of values for the front’s mean temperature, temperature difference\nand width could be estimated and used to initialize the optimization.\nA normal distribution with standard deviation σ is assumed to model the noise about\nthe model function. Scattered cloud that has not been correctly flagged by cloud screening\nalgorithms will tend to skew this towards the colder side of the distribution. If there was a\nparticular problem with cloud flagging then a more complex skewed distribution could be\nused. Similarly, σ may not always remain invariant across a front. It is allowed to vary\n23\nalong the front to take into account changes in meteorological conditions that may lead to\nvariations in cloud contamination, but is not permitted to change across-front.\nApplications of the algorithm developed here are numerous. Climate variability and\nmonitoring studies, ocean forcasting, validating ocean models, ecosystem and fisheries re-\nsearch all require an accurate understanding of the spatio-temporal behavior of ocean frontal\nsystems. The detailed results from such a front detection scheme would compliment in-situ\ndata sets where variability of a front is difficult to resolve. It may also help put into a wider\ncontext findings from research cruises only able to sample a limited area.\nAlthough the algorithm has been used with AVHRR SST data and illustrated with the\nSouthland Front it is by no means limited to this type of data and location. It is adaptable\nto a wide variety of remotely sensed data sets (e.g. altimetry and ocean colour as well as\nSST), model output and ocean forecasts. Ocean colour and altimetry data may be used\nsimply by adopting a model function that describes the change in colour or height across a\nfront rather than the temperature. In some cases these data sets may be more reliable and\nappropriate indicators of frontal location.\nb. Future developments\nThere are a number of improvements that could be made in future versions of the algo-\nrithm. The bandwidth of the smoothing function used to process each image is determined\nautomatically using likelihood cross validation. An improvement on this scheme would be to\nintroduce a variable bandwidth within each image. This would allow the smoother to adjust\nto localized variations in the density, distribution and quality of SST observations. For well\n24\ndefined structures that are not obscured by small scale clouds a smaller bandwidth would\nbe favoured, minimizing bias in parameter estimates. Where the frontal structure is poorly\ndefined or masked by cloud then a larger bandwidth would increase the weightings assigned\nto data further afield and decrease variance in the parameter estimates. Also, the along-\nfront structure and variability of each parameter is different. Adopting different smoothing\nfunctions and bandwidths for each parameter may therefore be advantageous. The local\nlikelihood framework however does not naturally allow the degree of smoothing applied to\neach parameter to be controlled because smoothing takes place in likelihood rather than in\nparameter space. Further investigation is needed to assess the possibilities of incorporating\nsuch flexibility.\nThe local likelihood algorithm only uses spatial information to estimate the position\nand characteristics of fronts in regions occluded by cloud cover. Incorporating temporal\ninformation about the structure and local motion of the front from images taken before and\nafter the time of interest could improve estimates made in regions of very sparse data (Chin\nand Mariano 1997). If the position of a front is well defined at times t − 1 and t + 1, but\nobscured by clouds at time t, then estimates made at t − 1 and t + 1 could be used to\nconstrain optimization at time t. Accounting for temporal evolution would be most effective\nwhen using daily or weekly images. Natural meso-scale variability (meanders, eddies) and\nthe temporal smoothing inherent in monthly composite images means that the position and\nstructure of a front in one month will not necessarily bear any resemblance to the location\nof features in the previous or following months. The advection and deformation of features\nover daily and weekly time scales is likely to be significantly less which would allow specific\nstructures to be detected and matched between time frames.\n25\nUnder the current design, changes in the orientation of the front can lead to overesti-\nmation of the width and subsequent underestimation of the gradient. Incorporating some\nform of angular dependency into the algorithm will be a high priority during future devel-\nopments and will help to stabilize and correct estimates of the width. For angles less than\n80◦ we have shown that the location of the front can be successfully estimated regardless of\norientation. Knowing the relationship between orientation and the error in the estimated\nwidth, overestimation could be corrected for post-processing. A better solution would be\nto extract data Zk at variable angles along the front during optimization. A standard edge\ndetection technique could be used to locate the front and estimate its orientation providing\nthe information needed to do this. Alternatively, the standard maximum likelihood model\nfit (no smoothing kernel) at each position k could be optimized with respect to the angle\nat which SST observations Zk are extracted across the front to obtain the minimum pos-\nsible estimate of the width (or maximum gradient). This information could then be used\nto extract vectors Zk at optimal angles during the full local likelihood calculation. Both\nof these solutions would result in a certain number of SST observations being used more\nthan once and the maximum likelihood assumption of independence between vectors Zk vi-\nolated. Strictly speaking however SST measurements in close proximity are not completely\nuncorrelated and the assumption of independently observed temperatures within each cross\nsectional vector made in Section 3 may be considered weak. Composite daily, weekly and\nmonthly images are derived from mapping and averaging procedures applied to a number of\nindividual satellite overpasses. This will introduce some level of dependence between mea-\nsurements. In an attempt to take this into account the spatial decorrelation length scale, the\ndistance at which data are no longer correlated, might be useful to consider when choosing\n26\nthe smoothing bandwidth. Despite these concerns over independence, it may be more ap-\npropriate to sacrifice precise statistical correctness in order to gain more realistic estimates\nof the front’s strength.\nAcknowledgments.\nJ. Hopkins was funded by the National Environment Research Council and undertook\nthis work while studying for a doctorate at Southampton University. The authors would like\nto thank Dr Peter Miller for his helpful comments and application of the SIED in Figure 9.\nThanks also to Prof Meric Srokosz, Dr Peter Cornillon and an anonymous reviewer for their\nuseful suggestions and advise.\n27\nAPPENDIX\nQuality Flags and Weightings\nThe Gaussian kernel function K(·) distributes weightings to likelihood contributions L(·)\nat positions k based upon the distance between xk and xj. This is designed to ensure that\ndata closest to the point of estimation j have most influence on the local likelihood parameter\nestimates. This weighting however does not take into account the quality or reliability of each\nlikelihood contribution. There are a number of situations where downweighting of likelihood\ncontributions L(·), in addition to weightings of the kernel K(·) is desirable.\nIn regions where there are a limited number of across-front SST observations, the algo-\nrithms ability to make reliable estimates of frontal characteristics is reduced. The quality of\nthese estimates is somewhat dependent upon the amount of data missing and on how this\npercentage is distributed across the front. Consider the case where h = 0◦. If a set of SST\nobservations Z is reduced by 50%, where every other data point across the profile is absent,\nthen the overall horizontal temperature structure is maintained and reliable estimates of the\ntemperature and position etc. may be made. At the other extreme, if all the missing values\nare on one particular side of the front then vital information concerning one water masss is\nlost and estimates may not be a true reflection of the structure of the front at that point.\nOf course when there are no observations available then no estimate can be made. If when\nh > 0◦ the data Zk are located close to the point of estimation j and thus assigned a high\n28\nweighting by the kernel K(·), localized sparsity and uneven distribution of observations at\nk may heavily bias the final local likelihood estimate away from the more realistic values\nsupported by other neighbouring observations.\nThe second situation in which we might wish to downweight data is where there is no\ndiscernible change in gradient across the front, and the best fit to observations Zk would\nbe a straight line. This of course may be an accurate reflection of the state of the ocean;\na strong subsurface front can exist without a marked surface thermal signature. Strong\nwinds and mixing may break down the surface structure and increased solar insolation in\nthe summer stratifies the water column resulting in an isothermal top layer that may become\ndecoupled from and mask the sub-surface structure below (James et al. 2002). Alternatively\nit may be the case that gradient changes have been blurred through temporal smoothing\nin a composite image. This is particularly true of areas where the front has a high degree\nof spatial variability and an increased number of plumes, as is the case toward the north\nof South Island, New Zealand (Shaw 1998). A noisy set of observations may also make it\ndifficult to pick out any rapid change in temperature between the two water masses. In all of\nthese cases, the standard maximum likelihood estimate (h = 0◦) of the width has a tendency\nto reach the upper bound of 60km (Table 1). As part of a local likelihood estimate this data\nwould bias the width toward larger values.\nThirdly, we must be cautious where we estimate a very sharp decrease in temperature\nover spatial scales that we are unable to resolve. A lack of data directly over the front\nwhere SSTs are changing most rapidly often results in a very narrow estimate of the width.\nUnfortunately cloud cover over frontal regions is common and may not always be remedied\nby composite images.\n29\nBased on: 1. an evaluation of the optimizations convergence criteria, 2. the number of\nestimates free from their upper and lower bounds, 3. the value of the likelihood, 4. the\nresidual sum-of-squares (RSS) of the model fit to data Zj, and 5. the percentage of missing\ndata from Zj, a quality flag (QF) between 1 and 7 is assigned to each set of estimates\nθˆ\n[h=0]\nj . Flag 1 is the highest quality and Flag 7 the poorest. Figure 10 is the flow chart\nthat was used to assign each flag. The routines convergence criteria comprise an assessment\nof whether the function value and parameter estimates are converging on a solution, and\nwhether the gradient vector at the solution (g(θˆsol)) is zero (Numerical Algorithms Group\n2006). Each flag is associated with a weighting (QW) between 0 and 1. This is combined\nwith the weightings assigned by the kernel K(·) to produce a new weighting that takes into\naccount both the location and reliability of each likelihood contribution L(·). If the quality\nweightings for each Z in an image are combined into a 1 × m vector QW, the jth row of\nweightings of the final smoother matrix Sj is given by:\nSj =\nK(xk − xj;h) ·QW∑m\nk=1[K(xk − xj;h) ·QWk]\n. (A1)\nNormalization ensures that\n∑m\nk=1 Sj,k = 1. Using weightings from the matrix S when cal-\nculating the likelihood and optimal bandwidth helps ensure a smooth non-parametric trend\nin along-front estimates of temperature etc. less likely to be interrupted by outliers. The\ncriteria shown in Figure 10 may be adjusted as deemed necessary for different applications,\nor where a stricter or more leaniant weighting scheme is desired. Further discussion of the\nquality control criteria may be found in Hopkins (2008) and Numerical Algorithms Group\n(2006).\n30\nREFERENCES\nBelkin, I. M. and A. L. Gordon, 1996: Southern Ocean fronts from the Greenwich meridian\nto Tasmania. J. Geophys.Res-Oceans, 101 (C2), 3675–3696.\nCayula, J. F. and P. Cornillon, 1992: Edge-detection algorithm for SST images. J. Atmos.\nOceanic Technol., 9 (1), 67–80.\nCayula, J. F. and P. Cornillon, 1995: Multi-image edge-detection for SST images. J. Atmos.\nOceanic Technol., 12 (4), 821–829.\nChelton, D. B., R. A. De Szoeke, M. G. Schlax, K. El Naggar, and N. Siwertz, 1998:\nGeographical variability of the first baroclinic Rossby radius of deformation. J. Phys.\nOceanogr., 28 (3), 433–460.\nChelton, D. B., M. G. Schlax, M. H. Freilich, and R. F. Milliff, 2004: Satellite measurements\nreveal persistent small-scale features in ocean winds. Science, 303 (5660), 978–983.\nChin, T. M. and A. J. Mariano, 1997: Space-time interpolation of oceanic fronts. IEEE\nTrans. Geosci. Remote Sens., 35 (3), 734–746.\nChiswell, S. M., 1994: Variability in sea-surface temperature around New-Zealand from\nAVHRR images. N. Z. J. Mar. Freshwater Res., 28 (2), 179–192.\nCoulter, R., 1983: Application of the Bayes decision rule for automatic water mass classifi-\n31\ncation from satellite infrared images. Proc. 17th Int. Symp. Remote Sensing Environment,\n2, 589–597.\nCurrie, K. I. and K. A. Hunter, 1998: Surface water carbon dioxide in the waters asso-\nciated with the subtropical convergence, east of New Zealand. Deep-Sea Res. Part I-\nOceanographic Research Papers, 45 (10), 1765–1777.\nCurrie, K. I. and K. A. Hunter, 1999: Seasonal variation of surface water CO2 partial pressure\nin the Southland Current, east of New Zealand. Mar. Freshwater Res., 50 (5), 375–382.\nDavison, A., 2003: Statistical Models. 1st ed., Cambridge Series in Statistical and Proba-\nbilistic Mathematics, Cambridge University Press, Cambridge, 726 pp.\nDong, S., J. Sprintall, and S. T. Gille, 2006: Location of the Antarctic Polar Front from\nAMSR-E satellite surface temperature measurements. J. Phys. Oceanogr., 36, 2075–2089.\nGarabato, A. C. N., J. T. Allen, H. Leach, V. H. Strass, and R. T. Pollard, 2001:\nMesoscale subduction at the Antarctic Polar Front driven by baroclinic instability. J.\nPhys. Oceanogr., 31 (8), 2087–2107.\nGerson, D., E. Khedouri, and P. Gaborski, 1979: Location of oceanic fronts from digital satel-\nlite temperature data by automated pattern analysis. Intergovernmental Oceanographic\nCommission Workshop Report No.17, Supplement 143-163.\nGill, P., W. Murray, and M. Wright, 1995: Practical Optimiztaion. Academic Press, London,\n401 pp.\n32\nHeath, R. A., 1985: A review of the physical oceanography of the seas around New- Zealand\n- 1982. N. Z. J. Mar. Freshwater Res., 19 (1), 79–124.\nHickox, R., I. Belkin, P. Cornillon, and Z. Shan, 2000: Climatology and seasonal variability\nof ocean fronts in the east China, Yellow and Bohai Seas from satellite SST data. Geophys.\nRes. Lett., 27 (18), 2945–2948.\nHolland, J. A. and X. H. Yan, 1992: Ocean thermal feature recognition, discrimination,\nand tracking using infrared satellite imagery. IEEE Trans. Geosci. Remote Sens., 30 (5),\n1046–1053.\nHolyer, R. J. and S. H. Peckinpaugh, 1989: Edge-detection applied to satellite imagery of\nthe oceans. IEEE Trans. Geosci. Remote Sens., 27 (1), 46–56.\nHopkins, J., 2008: Statistical Modelling and Variability of the Subtropical Front, New\nZealand. Ph.D. thesis, Southampton University.\nJames, C., M. Tomczak, I. Helmond, and L. Pender, 2002: Summer and winter surveys of the\nSubtropical Front of the southeastern Indian Ocean 1997-1998. J. Mar. Syst., 37 (1-3),\n129–149.\nJillett, J., 1969: Seasonal hydrology of waters off the Otago Peninsula, south-eastern New\nZealand. N. Z. J. Mar. Freshwater Res., 3 (3), 349–375.\nKostianoy, A. G., A. I. Ginzburg, M. Frankignoulle, and B. Delille, 2004: Fronts in the\nSouthern Indian Ocean as inferred from satellite sea surface temperature data. J. Mar.\nSyst., 45 (1-2), 55–73.\n33\nKrishnamurthy, S., S. S. Iyengar, R. J. Holyer, and M. Lybanon, 1994: Histogram-based\nmorphological edge detector. IEEE Trans. Geosci. Remote Sens., 32 (4), 759–767.\nLea, S. M. and M. Lybanon, 1993: Automated boundary delineation in infrared ocean\nimages. IEEE Trans. Geosci. Remote Sens., 31 (6), 1256–1260.\nLou, X., W. Huang, A. Shi, and B. Fu, 2005: Satellite measurements of the Zhejiang-Fujian\ncoastal front in the East China Sea with an improved front-following algorithm. The\nInternational Society for Optical Engineering, D. Lu and G. Matvienko, Eds., Bellingham,\nWA, Vol. 5832- Optical Technologies for Atmospheric, Ocean and Environmental Studies.\nMarcello, J., F. Marques, and F. Eugenio, 2005: Automatic tool for the precise detection of\nupwelling and filaments in remote sensing imagery. IEEE Trans. Geosci. Remote Sens.,\n43 (7), 1605–1616.\nMavor, T. P. and J. J. Bisagni, 2001: Seasonal variability of sea-surface temperature fronts\non Georges Bank. Deep-Sea Res. Part II-Topical Studies in Oceanography, 48 (1-3), 215–\n243.\nMiller, P., 2004: Multi-spectral front maps for automatic detection of ocean colour features\nfrom SeaWiFS. Int. J. Remote Sen., 25 (7-8), 1437–1442.\nMoore, J. and M. Abbott, 2000: Phytoplankton chlorophyll distributions and primary pro-\nduction in the Southern Ocean. J. Geophys. Res -Oceans, 105, 28 709–28 722.\nMoore, J., M. Abbott, and J. Richman, 1997: Variability in the location of the Antarctic\nPolar Front (90-20◦ W) from satellite sea surface temperature data. J. Geophys. Res -\nOceans, 102, 27 825–27 833.\n34\nMoore, J. K., M. R. Abbott, and J. G. Richman, 1999: Location and dynamics of the\nAntarctic Polar Front from satellite sea surface temperature data. J. Geophys. Res -Oceans,\n104 (C2), 3059–3073.\nMurphy, P. P., R. A. Feely, R. H. Gammon, D. E. Harrison, K. C. Kelly, and L. S. Waterman,\n1991: Assessment of the air-sea exchange of CO2 in the South-Pacific during austral\nautumn. J. Geophys. Res -Oceans, 96 (C11), 20 455–20 465.\nNumerical Algorithms Group, 2006: NAG Libary Manual, Mark 21. E04- Minimiz-\ning or Maximizing a Function. Numerical Algorithms Group Ltd, Oxford, UK,\nhttp:\/\/www.nag.co.uk\/numeric\/fl\/manual\/html\/FLlibrarymanual.asp.\nO’Neill, L. W., D. B. Chelton, and S. K. Esbensen, 2003: Observations of SST-induced\nperturbations of the wind stress field over the Southern Ocean on seasonal timescales. J.\nClimate, 16 (14), 2340–2354.\nShaw, A. G. P., 1998: The temporal and spatial variability of the Southland Front, New\nZealand using AVHRR SST imagery. Ph.D, University of Otago, Dunedin, New Zealand.\nShaw, A. G. P. and R. Vennell, 2000: A front-following algorithm for AVHRR SST imagery.\nRemote Sens. Environ., 72 (3), 317–327.\nShaw, A. G. P. and R. Vennell, 2001: Measurements of an oceanic front using a front-\nfollowing algorithm for AVHRR SST imagery. Remote Sens. Environ., 75 (1), 47–62.\nShimada, T., F. Sakaida, H. Kawamura, and T. Okumura, 2005: Application of an edge\ndetection method to satellite images for distinguishing sea surface temperature fronts\nnear the Japanese coast. Remote Sens. Environ., 98 (1), 21–34.\n35\nSilverman, B., 1986: Density Estimation for Statistics and Data Analysis. Monographs on\nStatistics and Applied Probability, Chapman and Hall, London.\nSimhadri, K. K., S. S. Iyengar, R. J. Holyer, M. Lybanon, and J. M. Zachary, 1998: Wavelet-\nbased feature extraction from oceanographic images. IEEE Trans. Geosci. Remote Sens.,\n36 (3), 767–778.\nSimpson, J. J., 1990: On the accurate detection and enhancement of oceanic features ob-\nserved in satellite data. Remote Sens. Environ., 33 (1), 17–33.\nSpall, M. A., 1995: Frontogenesis, subduction, and cross-front exchange at upper ocean\nfronts. J. Geophys. Res -Oceans, 100 (C2), 2543–2557.\nTibshirani, R. and T. Hastie, 1987: Local Likelihood Estimation. J. Amer. Statistical. Assoc.,\n82 (398), 559–567.\nUddstrom, M. J. and N. A. Oien, 1999: On the use of high-resolution satellite data to describe\nthe spatial and temporal variability of sea surface temperatures in the New Zealand region.\nJ. Geophys. Res -Oceans, 104 (C9), 20 729–20 751.\nUllman, D. S. and P. C. Cornillon, 2001: Continental shelf surface thermal fronts in winter\noff the northeast US coast. Cont. Shelf Res., 21 (11-12), 1139–1156.\nVazquez, D. P., C. Atae-Allah, and P. L. L. Escamilla, 1999: Entropic approach to edge\ndetection for SST images. J. Atmos. Oceanic Technol., 16 (7), 970–979.\n36\nList of Tables\n1 Geophysical upper and lower bounds used to apply a linear transformation\nto unknown variables θ using a 1◦×2.8◦ window of data with a 0.044◦ pixel\nresolution. 38\n2 a. Mean parameter estimates made over sections A-C on 28 March 1990\n(as marked in Figure 9) made by the ‘front following’ algorithm (Shaw and\nVennell 2000). b. Weighted mean estimates (±2×standard error of the mean)\nover sections A-C using the local likelihood algorithm (Hopkins). 39\n37\nTable 1. Geophysical upper and lower bounds used to apply a linear transformation to\nunknown variables θ using a 1◦×2.8◦ window of data with a 0.044◦ pixel resolution.\nParameter Geophysical Geophysical\nLower Bound Upper Bound\nMean Temperature (θ1) 5◦C 23◦C\nTemperature Range (2θ2) 0.1◦C 6◦C\nWidth (2θ3) 0.044◦ (∼4 km) 0.6◦ (∼60 km)\nPosition (θ4) -1 0\ns.d (σ) 1e-06 6\n38\nTable 2. a. Mean parameter estimates made over sections A-C on 28 March 1990 (as\nmarked in Figure 9) made by the ‘front following’ algorithm (Shaw and Vennell 2000). b.\nWeighted mean estimates (±2×standard error of the mean) over sections A-C using the local\nlikelihood algorithm (Hopkins).\nLatitude Parameter a. Shaw and b. Hopkins\nSection Vennell (2000)\nA θ1 (◦C) 13.07 13.47±0.02\n46.16-45.96◦S 2θ2 (◦C) 1.95 2.53±0.02\n2θ3 (km) 8.10 16.09±0.60\nB θ1 (◦C) 13.26 13.41±0.01\n45.76-44.93◦S 2θ2(◦C) 3.24 3.00±0.01\n2θ3 (km) 12.85 9.30±0.21\nC θ1 (◦C) 13.09 13.39±0.03\n44.88-44.75◦S 2θ2 (◦C) 2.63 2.44±0.03\n2θ3) 14.81 9.43±0.80\n39\nList of Figures\n1 a. Schematic illustrating the assumption that each SST observation z(i) at\ndistance y(i) across the front is drawn from a normal distribution with mean\nE(z(i)) and standard deviation σ. The expectation E is determined by the\nmodel function m(y(i);θ). b. Physical interpretation of parameters in model\nm(Y;θ) + \u000f = θ1 + θ2 tanh\n[\nY+θ4\nθ3\n]\n+ \u000f. 44\n2 A 1◦ by 2.8◦ window of data aligned approximately along the Southland Front\noff the east coast of South Island, New Zealand is extracted from each AVHRR\nSST image. The 500 m isobath is marked. Cross sections of SST observations\nA-E to which the model function is fitted in Figure 3 are shown. 45\n3 Examples of the model function fitted to five different sets of SST observations\n(A-E) across a composite image of the Southland Front from June 2004. For\neach cross-section the observed temperatures are represented by black crosses\nand the fitted model (Eq.(3)) by a solid black line. ⊗ marks the estimated\nposition. Also shown are the specific parameter estimates ±95% confidence\nintervals. 46\n40\n4 Local likelihood parameter estimates along the Southland Front in June 2004\nfor bandwidths h = 0◦, h = 0.025◦, h = 0.3◦ and hop = 0.11◦. The middle\npanels represent the width and normalized weightings of each gaussian kernel\nfunction. Note the tendency for peaks and troughs to be smoothed out as h\nincreases. Weightings attached to observations Zk become increasingly simi-\nlar and the estimator approaches a fitted least-squares constant; its variance\ndecreases while its bias increases. As h decreases the variance of the estimator\nincreases, but its bias decreases and the non-parametric model is over-fitted. 47\n5 Local likelihood parameter estimates ±95% confidence intervals (dashed lines)\nfor the Southland Front in June 2004. hop=0.11\n◦. 48\n6 Distribution of estimated temperature (A), temperature range (B), width (C),\nposition (D) and standard deviation of noise (E) from a simulated data set\nwith smoothing parameters a. h = 0◦ (left), and b. h = 0.15◦ (right). True\nparameter values are shown by the dashed line. Each box has lines at the\nlower quartile, median, and upper quartile values. Whiskers extend to the\nmost extreme values within 1.5 times the interquartile range from the ends of\nthe box. Outliers are marked by grey circles. 49\n41\n7 Effect of frontal orientation on parameter estimates. Angle of rotation vs\na. mean temperature (θ1), b. temperature range (2θ2), c. width (2θ3), d.\ngradient (2θ2\n2θ3\n), e. position (θ4) and f. standard deviation of noise about\nmean (σ). The dashed line indicates the true parameter value. The circles\nrepresent the mean estimated value at points across the image within the range\n−0.1 > xj < 0.1. Error bars represent 2 × the mean of the standard errors\nof these estimates. The shaded gray box represents the angle past which the\nalgorithm ‘collapses’. Beyond 80◦ no useful output may be obtained. Eddies\nand meanders that loop back on themselves are not resolved. 50\n8 a. Parameter estimates for September 1997 ±95% confidence intervals, b.\nParameter estimates for September 1997 with 16% of observations removed\n(dashed line). Estimates made with the full data set (column a.) are marked\nwith a solid black line, c. As for b. but with 43% of observations removed.\nn.b. missing data in the top left hand corner is the Dunedin Headland and\naccounts for 5% of percentages quoted. 51\n42\n9 Location of the Southland Front on 28 March 1990 from Shaw and Vennell\n(2000) compared with the estimated position using the local likelihood algo-\nrithm where hop = 0.025\n◦ (Hopkins). Gaps in the estimates made by Shaw\nand Vennell (2000) are where the algorithm failed to converge within the set\nparameter bounds. Local likelihood estimates that fall outside the range of\nacceptable values identified in Table 1 are identified in green. Fronts identified\nusing the single image edge detection (SIED) of Cayula and Cornillon (1992)\nare also shown (minimum cross-front difference of 0.2◦C). Sections A, B and\nC refer to estimates in Table 2. 52\n10 Flowchart used to assign quality flags (QF) and weightings (QW) to each data\nset Zj when h = 0\n◦. P = Pass, F = Fail. The stringent accuracy demanded by\nthe NAG optimization routine may result in an otherwise acceptable solution\nbeing reported as a failure. Therefore, when not all conditions for a minimim\nhave been met the gradient vector g(θˆsol) and condition number (cond) of\nthe matrix of second order derivatives at θˆsol are assessed. A small condi-\ntion number indicates a high rate of convergence and an accurate estimate of\ng(θˆsol). \u000f is the machine precision and RSS the residual sum-of-squares of the\nmodel function fit. 53\n43\nDistance across-front\nSS\nT \nob\nse\nrv\nat\nio\nns\nModel function\nSST observations\nNormal distribution with \nmean           and variance \nSS\nT \nob\nse\nrv\nat\nio\nns\nDistance across-front\na.\nb.\nModel function\nSST observations\nFig. 1. a. Schematic illustrating the assumption that each SST observation z(i) at distance\ny(i) across the front is drawn from a normal distribution with mean E(z(i)) and standard\ndeviation σ. The expectation E is determined by the model function m(y(i);θ). b. Physical\ninterpretation of parameters in model m(Y;θ) + \u000f = θ1 + θ2 tanh\n[\nY+θ4\nθ3\n]\n+ \u000f.\n44\nFig. 2. A 1◦ by 2.8◦ window of data aligned approximately along the Southland Front off\nthe east coast of South Island, New Zealand is extracted from each AVHRR SST image.\nThe 500 m isobath is marked. Cross sections of SST observations A-E to which the model\nfunction is fitted in Figure 3 are shown.\n45\nFig. 3. Examples of the model function fitted to five different sets of SST observations (A-\nE) across a composite image of the Southland Front from June 2004. For each cross-section\nthe observed temperatures are represented by black crosses and the fitted model (Eq.(3)) by\na solid black line. ⊗ marks the estimated position. Also shown are the specific parameter\nestimates ±95% confidence intervals.\n46\nFig. 4. Local likelihood parameter estimates along the Southland Front in June 2004 for\nbandwidths h = 0◦, h = 0.025◦, h = 0.3◦ and hop = 0.11◦. The middle panels represent the\nwidth and normalized weightings of each gaussian kernel function. Note the tendency for\npeaks and troughs to be smoothed out as h increases. Weightings attached to observations\nZk become increasingly similar and the estimator approaches a fitted least-squares constant;\nits variance decreases while its bias increases. As h decreases the variance of the estimator\nincreases, but its bias decreases and the non-parametric model is over-fitted.\n47\n-47°\n-46°\n-45°\n-44°\n170° 171° 172° 173°\n8°C 9°C 10°C 11°C\na.\nOamaru\nTimaru\nSOUTHISLAND\nFig. 5. Local likelihood parameter estimates ±95% confidence intervals (dashed lines) for\nthe Southland Front in June 2004. hop=0.11\n◦.\n48\nA A\nB\nC\nD\nE\nB\nC\nD\nE\nFig. 6. Distribution of estimated temperature (A), temperature range (B), width (C),\nposition (D) and standard deviation of noise (E) from a simulated data set with smoothing\nparameters a. h = 0◦ (left), and b. h = 0.15◦ (right). True parameter values are shown by\nthe dashed line. Each box has lines at the lower quartile, median, and upper quartile values.\nWhiskers extend to the most extreme values within 1.5 times the interquartile range from\nthe ends of the box. Outliers are marked by grey circles.\n49\nFig. 7. Effect of frontal orientation on parameter estimates. Angle of rotation vs a. mean\ntemperature (θ1), b. temperature range (2θ2), c. width (2θ3), d. gradient (\n2θ2\n2θ3\n), e. position\n(θ4) and f. standard deviation of noise about mean (σ). The dashed line indicates the true\nparameter value. The circles represent the mean estimated value at points across the image\nwithin the range −0.1 > xj < 0.1. Error bars represent 2 × the mean of the standard errors\nof these estimates. The shaded gray box represents the angle past which the algorithm\n‘collapses’. Beyond 80◦ no useful output may be obtained. Eddies and meanders that loop\nback on themselves are not resolved.\n50\nFig. 8. a. Parameter estimates for September 1997 ±95% confidence intervals, b. Parameter\nestimates for September 1997 with 16% of observations removed (dashed line). Estimates\nmade with the full data set (column a.) are marked with a solid black line, c. As for b.\nbut with 43% of observations removed. n.b. missing data in the top left hand corner is the\nDunedin Headland and accounts for 5% of percentages quoted.\n51\nFig. 9. Location of the Southland Front on 28 March 1990 from Shaw and Vennell (2000)\ncompared with the estimated position using the local likelihood algorithm where hop = 0.025\n◦\n(Hopkins). Gaps in the estimates made by Shaw and Vennell (2000) are where the algorithm\nfailed to converge within the set parameter bounds. Local likelihood estimates that fall\noutside the range of acceptable values identified in Table 1 are identified in green. Fronts\nidentified using the single image edge detection (SIED) of Cayula and Cornillon (1992) are\nalso shown (minimum cross-front difference of 0.2◦C). Sections A, B and C refer to estimates\nin Table 2.\n52\nFig. 10. Flowchart used to assign quality flags (QF) and weightings (QW) to each data\nset Zj when h = 0\n◦. P = Pass, F = Fail. The stringent accuracy demanded by the NAG\noptimization routine may result in an otherwise acceptable solution being reported as a\nfailure. Therefore, when not all conditions for a minimim have been met the gradient vector\ng(θˆsol) and condition number (cond) of the matrix of second order derivatives at θˆsol are\nassessed. A small condition number indicates a high rate of convergence and an accurate\nestimate of g(θˆsol). \u000f is the machine precision and RSS the residual sum-of-squares of the\nmodel function fit.\n53\n"}