{"doi":"10.1080\/02646830701691376","coreId":"65676","oai":"oai:dro.dur.ac.uk.OAI2:5105","identifiers":["oai:dro.dur.ac.uk.OAI2:5105","10.1080\/02646830701691376"],"title":"Practices, advice and support regarding prolonged breastfeeding : a descriptive study from Sri Lanka.","authors":["van den Berg, M.","Ball, H. L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08-01","abstract":"Practice and duration of breastfeeding were examined in relation to traditional practices and modern recommendations on infant care in Sri Lanka. Semi-structured interviews were conducted among 60 Sri Lankan mothers whose youngest child was 0.5-4 years. The results show that all mothers had breastfed their infants. Most respondents introduced additional foods at 4 months, as recommended by local public health services. The median age at cessation of breastfeeding was 2.9 years, in line with public health advice. Doctors were reported to oppose breastfeeding during a subsequent pregnancy. Eighty-two percent of mothers practised habitual bed-sharing with their children. Nighttime breastfeeding frequency was 4.8 times per night for infants aged 0.5-1 year and declined gradually over the next 3 years. Maternal working status did not influence the overall duration of breastfeeding. Sri Lankan mothers and infants were confronted with several factors opposing their breastfeeding relationship, notably near full-time work and the early introduction of additional foods. Even though exclusive breastfeeding was ended prematurely, the majority of mothers and infants managed to sustain a prolonged breastfeeding relationship. Mother-child bed-sharing and associated nighttime breastfeeding is proposed as an important factor supporting continued breastfeeding","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65676.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5105\/1\/5105.pdf","pdfHashValue":"8e58f7011e052077a355876504896382ebfca568","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5105<\/identifier><datestamp>\n      2011-09-15T15:15:39Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Practices, advice and support regarding prolonged breastfeeding : a descriptive study from Sri Lanka.<\/dc:title><dc:creator>\n        van den Berg, M.<\/dc:creator><dc:creator>\n        Ball, H. L.<\/dc:creator><dc:description>\n        Practice and duration of breastfeeding were examined in relation to traditional practices and modern recommendations on infant care in Sri Lanka. Semi-structured interviews were conducted among 60 Sri Lankan mothers whose youngest child was 0.5-4 years. The results show that all mothers had breastfed their infants. Most respondents introduced additional foods at 4 months, as recommended by local public health services. The median age at cessation of breastfeeding was 2.9 years, in line with public health advice. Doctors were reported to oppose breastfeeding during a subsequent pregnancy. Eighty-two percent of mothers practised habitual bed-sharing with their children. Nighttime breastfeeding frequency was 4.8 times per night for infants aged 0.5-1 year and declined gradually over the next 3 years. Maternal working status did not influence the overall duration of breastfeeding. Sri Lankan mothers and infants were confronted with several factors opposing their breastfeeding relationship, notably near full-time work and the early introduction of additional foods. Even though exclusive breastfeeding was ended prematurely, the majority of mothers and infants managed to sustain a prolonged breastfeeding relationship. Mother-child bed-sharing and associated nighttime breastfeeding is proposed as an important factor supporting continued breastfeeding. <\/dc:description><dc:subject>\n        Breastfeeding<\/dc:subject><dc:subject>\n         Cross-cultural studies<\/dc:subject><dc:subject>\n         Interviews<\/dc:subject><dc:subject>\n         Social.<\/dc:subject><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Journal of reproductive and infant psychology, 2008, Vol.26(3), pp.229-243 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5105<\/dc:identifier><dc:identifier>\n        issn:0264-6838<\/dc:identifier><dc:identifier>\n        issn: 1469-672X<\/dc:identifier><dc:identifier>\n        doi:10.1080\/02646830701691376<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5105\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/02646830701691376<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5105\/1\/5105.pdf<\/dc:identifier><dc:rights>\n        This is an electronic version of an article published in van den Berg, M. and Ball, H. L. (2008) 'Practices, advice and support regarding prolonged breastfeeding : a descriptive study from Sri Lanka.', Journal of reproductive and infant psychology., 26 (3). pp. 229-243. Journal of reproductive and infant psychology is available online at: http:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/02646830701691376<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1469-672x","issn:0264-6838","0264-6838","issn: 1469-672X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Breastfeeding","Cross-cultural studies","Interviews","Social."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n08 March 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nvan den Berg, M. and Ball, H. L. (2008) ’Practices, advice and support regarding prolonged breastfeeding : a\ndescriptive study from Sri Lanka.’, Journal of reproductive and infant psychology., 26 (3). pp. 229-243.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/02646830701691376\nPublisher’s copyright statement:\nThis is an electronic version of an article published in van den Berg, M. and Ball, H. L. (2008) ’Practices, advice and\nsupport regarding prolonged breastfeeding : a descriptive study from Sri Lanka.’, Journal of reproductive and infant\npsychology., 26 (3). pp. 229-243. Journal of reproductive and infant psychology is available online at:\nhttp:\/\/www.informaworld.com\/smpp\/content db=all?content=10.1080\/02646830701691376\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n08 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nvan den Berg, M. and Ball, H. L. (2008) 'Practices, advice and support regarding prolonged \nbreastfeeding : a descriptive study from Sri Lanka.', Journal of reproductive and infant \npsychology., 26 (3). pp. 229-243. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1080\/02646830701691376 \n \nPublisher’s copyright statement: \nThis is an electronic version of an article published in van den Berg, M. and Ball, H. L. (2008) \n'Practices, advice and support regarding prolonged breastfeeding : a descriptive study from \nSri Lanka.', Journal of reproductive and infant psychology., 26 (3). pp. 229-243. Journal of \nreproductive and infant psychology is available online at: \nhttp:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/02646830701691376 \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n1 \nPrepared for: Journal of Reproductive and Infant Psychology \nArticle type: Research \nPractices, advice and support regarding prolonged breastfeeding: a \ndescriptive study from Sri Lanka \nMartina J van den Berg\n1\n*, Helen L Ball\n2 \n1\n F.D. Rooseveltstraat 29, 9728 RV Groningen, The Netherlands  \n2\n Department of Anthropology, University of Durham, Durham, UK  \n* Corresponding author \nEmail addresses: \nMJB: martina.vandenberg@wanadoo.nl   \nHLB: h.l.ball@durham.ac.uk  \n \n \n \n \n \n \nCorrespondence to: \nM.J. van den Berg \nF.D. Rooseveltstraat 29 \n9728 RV Groningen \nThe Netherlands \nTel: +31 50 5251855 \nEmail: martina.vandenberg@wanadoo.nl \n \n \n \n \n 2 \nAbstract \nPractice and duration of breastfeeding were examined in relation to traditional practices and \nmodern recommendations on infant care in Sri Lanka. Semi-structured interviews were \nconducted among 60 Sri Lankan mothers whose youngest child was 0.5-4 years. All mothers \nhad breastfed their infants. Most respondents introduced additional foods at 4 months, as \nrecommended by local public health services. The median age at cessation of breastfeeding \nwas 2.9 years, in line with public health advice. Doctors were reported to oppose \nbreastfeeding during a subsequent pregnancy. Eighty-two per cent of mothers practiced \nhabitual bed-sharing with their children. Night-time breastfeeding frequency was 4.8 times \nper night for infants aged 0.5-1 year and declined gradually over the next 3 years. Maternal \nworking status did not influence the overall duration of breastfeeding. Sri Lankan mothers \nand infants were confronted with several factors opposing their breastfeeding relationship, \nnotably near full-time work and the early introduction of additional foods. Even though \nexclusive breastfeeding was ended prematurely, the majority of mothers and infants managed \nto sustain a prolonged breastfeeding relationship. Mother-child bed-sharing and associated \nnight-time breastfeeding is proposed as an important factor supporting continued \nbreastfeeding.  \n 3 \nBackground \n \nAccording to the anthropological view, breastfeeding until the ages of 2.5 to 7 years is the \nbiological norm for humans when freed from cultural norms and beliefs (Dettwyler, 1995). \nThe benefits of exclusive and prolonged breastfeeding, i.e. beyond 6 months postpartum, \nhave been well documented (Léon-Cava et al., 2002), and breastfeeding durations of 1 or 2 \nyears have been officially recommended (American Academy of Pediatrics, 1997; World \nHealth Organization, 1998). Breastfeeding, especially the period of exclusive breastfeeding, \nprotects infants against a host of infective, respiratory and diarrheal diseases (Perera et al., \n1999) and plays a vital role in the maturation of the infantile immune system, a process which \ntakes several years to complete (Jaspan et al., 2006). Furthermore, prolonged breastfeeding \nhas been shown to increase intelligence (Mortensen et al., 2002; Der et al., 2006). Hence, \nwhat matters is not only whether breastfeeding is initiated but also the duration, exclusivity \nand intensity of breastfeeding (Cadwell, 2002).  \nProlonged breastfeeding is, however, not commonly practiced in Western societies. In \nGermany, for instance, 50% of infants are breastfeeding at 6 months and only 13% are still \nbreastfeeding at 12 months (Deutsche Gesellschaft für Ernährung e.V., 2000). In the United \nStates, only 13% of infants are exclusively breastfed until 6 months and 16% receive some \nbreast milk at 1 year (Li et al., 2005). Finally, in the UK, only 20% of infants receive any \nbreast milk at 6 months, and almost none are exclusively breastfed by this age (Hamlyn et al., \n2002).  \nVarious factors influence whether, and for how long, women will breastfeed, including \ncultural aspects, social support and provision of information. These factors determine \ncustoms linked to breastfeeding practice, notably sleeping arrangements, introduction of \nadditional foods, use of bottles and pacifiers and maternal employment. To better understand \nprolonged breastfeeding, we examined a society where prolonged breastfeeding is the norm \n(UNICEF, 2006). In Sri Lanka as in other Asian countries, traditional infant care practices are \nbeing influenced by the Western model of health- and infant care. Consequently, mothers \nmay be experiencing advice from public health care services which conflicts with their own \ncustoms.  \nSri Lankans are known to be intensely family oriented. Although the nuclear family forms the \nbasis for most households, close family ties are maintained with extended family members. \nThe country has widespread access to maternal health care due to the mix of health care \npersonnel with midwives supervised and supported by nurse-midwives and a smaller number \nof medical doctors. Hence, 97% of births are attended by clinically trained personnel \n(Padmanathan et al., 2003). Maternal mortality rates and infant mortality rates are low \ncompared to other South Asian countries or countries with similar gross national product \n(UNDP, 2006). The population consists of 74% Sinhalese, 7% Sri Lankan Moors, 5% Indian \nTamil, 4% Sri Lankan Tamil, and 10% unspecified. \n 4 \nThis descriptive study was designed to explore the breastfeeding experiences of women in a \nculture where long-term breastfeeding is the norm. The study was conducted by the first \nauthor whilst she was involved in breastfeeding support work in Sri Lanka. Her personal and \nprofessional relationships with breastfeeding Sri Lankan women, informed by her own \nbreastfeeding experience, allowed her to conduct interviews regarding factors that could \npromote or hinder breastfeeding in this particular setting. By talking with mothers and by \nobserving mothers with babies and small children in different contexts, she developed an \ninterest in exploring the effects of traditional beliefs and practices on the one hand, and \nmodern Western ideas and recommendations on the other hand on patterning and duration of \nbreastfeeding in Sri Lanka. Was the island, for instance, a „breastfeeding paradise‟ where \nlittle or no further information was needed or was there a wide field for breastfeeding \ninformation and support to be explored? And what could be learned from Sri Lanka for the \nsupport and management of breastfeeding in the West? The aim of this paper is to shed light \non the answers to these questions by exploring mothers‟ experiences of prolonged \nbreastfeeding in Sri Lanka.  \nMethods  \nSamples were taken from the districts of Kandy and Kegalle, located in the so-called mid-\nhills in the central part of the country and, to broaden representation in the study sample, \nfrom several districts beyond this immediate area. In locations pre-selected for sampling, \npotential respondents were visited at or in front of their homes along a predetermined \ngeographic route identified for the study.  \nThe eligibility criteria established for participation were that the mother was present in person \nand that she had at least one child in the age group from 6 months until the 5th birthday (0.5-\n4 years). Because of the study‟s focus on prolonged breastfeeding, i.e. beyond 6 months \npostpartum, infants younger than 6 months were not considered. All mothers with \nappropriately aged children were eligible for participation in the study regardless of their \nbreastfeeding status which was not ascertained at the time of recruitment.. When women \nwere approached, the nature of the study was described and, if consistent with the selection \ncriteria, they were asked for their willingness to participate in the survey. To avoid positive \nbias towards breastfeeding, it was explained to the respondents orally and on paper that the \nsurvey aimed to explore early childhood nutrition. In most cases, interviews were conducted \ndirectly, following verbal consent by the respondents, and took place between 10 a.m. and 6 \np.m. During each interview, responses to questions and notes about important observations \nwere directly recorded on paper, translated into English - where needed with the aid of a local \nlay translator. Interviews were conducted by three local women and the first author. To \nensure reliability and consistency among the 4 interviewers, regular meetings were arranged \nto discuss methods and interpret the outcomes of the interviews. In some cases, following \nface-to-face exchange with the other interviewers, contextual details of interviews were \nadded subsequently. \n 5 \nThe interviews were semi-structured and comprised questions and subquestions regarding the \nstate of early childhood nutrition and other factors influencing the practice and duration of \nbreastfeeding. The questions solicited both qualitative and quantitative types of information. \nAn overview of topics in the interview schedule is given in Annex 1. \n \nData from individual mothers were entered into a spreadsheet and analyzed in relation to the \ntype of questions asked during the interview (qualitative or quantitative). Thematic analysis \nwas employed for the analysis of qualitative responses (e.g. use of key words and phrases \nrelating to particular themes discussed by women in response to certain questions). Where \nresponses could be quantified frequencies and percentages were generated. Missing data were \nrecorded as missing, and for any given variable the number of respondents was adjusted \naccordingly. The results of a few questions were omitted from the analysis because, in \nretrospect, they seemed irrelevant to the overall picture of breastfeeding and related practices, \nor because information was too scarce or difficult to interpret. The omitted questions referred \nto daily activities of mother and child\/ren, estimated expenditures on medicines per child, \nduration of a „normal‟ breastfeeding session, mother‟s motivation for employment outside of \nthe house, and presence of paid domestic help.   \nOur study was not specifically designed to measure the completed breastfeeding duration, \nbecause this would have required retrospective questioning about children of a post-weaning \nage. Nevertheless, in our sample containing both breastfeeding and weaned children, we \nestimated the median completed breastfeeding duration from the available data. The \nrespondents were grouped into four age categories as in Table 1. For each category, we \ncalculated the percentage still breastfeeding and the average age of the child. This resulted in \nfour data points which were plotted into a graph and connected by smooth lines using the \nchart function in Microsoft Excel. The age at which breastfeeding was 50% was determined \nvisually from the graph. \n \nA post hoc stratification was made of maternal working status (working versus non-working \nmothers) to test the effect of working status on breastfeeding and sleeping behavior. Work \nwas defined as a paid job outside the house of at least 10 hours per week. Differences \nbetween independent sample means were analyzed using the t test; binary data were analyzed \nusing the non-parametric Mann-Whitney test, employing the statistical package SPSS (2005).  \nResults \nCharacteristics of the sample \nSixty face-to-face interviews were conducted among Sri Lankan mothers during February \nand April 2002. Three of the interviewers had children under the age of 4 at the time of the \nsurvey. One of the local interviewers was a participant of a LLL breastfeeding support group \nlead by the first author. Thirty-two of the 60 women interviewed resided in peri-urban and \nrural areas in the districts of Kandy and Kegalle. The second half of the interviews were \nconducted in the dry zone district of Anuradhapura (13 interviews), Colombo District (6 \n 6 \ninterviews), the southern district of Galle (6 interviews), and the highland district of Nuwara \nEliya (3 interviews).  \nMothers participating in interviews ranged from 23 to 45 years in age (median 30 years). \nParity was 1.6 children, or 1.2 children in the target age group of 0.5-4 years. Most \nrespondents were of the Sinhalese ethnic group (52\/60, 87%); some were Tamil (6\/60, 10%) \nor other (2\/60, 3%). While in most cases the father lived in the same house with the mother \nand child\/ren (56\/60, 93%), so did either the parents or one parent of the mother or father \n(31\/60, 52%). In a small number of cases (4\/60, 7%), the mother‟s or father‟s grandparents or \none grandparent were recorded as part of the household. Other family members such as \nbrother, sister, aunt or in-laws were recorded in almost one third of cases (17\/60, 28%). \nSometimes, „other non-family‟ lived in the same house with the nuclear family (2\/60, 3%). In \none case, 5 other families were reported from the same house.  \nForty-five per cent of families (26\/58) lived in houses smaller than 30 m²; a value obtained \nthrough a priori estimation of the average house size around Kandy town at the time of the \nsurvey. Socio-economic status was not recorded. \nTwenty mothers (20\/60, 33%) with children in the age group 0.5-4 years had resumed paid \nwork outside the house of at least 10 hours per week, and reported work in teaching (2), in a \nshop (5), in an office (5), as a nurse (3), or other work (5). Working mothers reported being \naway from their child\/ren for an average of 6.9 hours per day on weekdays. There was no \ndifference in age (t test, P=0.4, df=58), gender of the child (Mann-Whitney test, P=0.7) or \nhouse size (Mann-Whitney test, P=0.7) between working and non-working mothers. \nThe 60 respondents described their breastfeeding experience for their youngest child, which \nincluded two twin-pairs. \nPatterning and duration of breastfeeding \nAll 60 mothers reported having breastfed their infants. The majority of infants in the sample \nwere breastfed beyond the age of 1 year (Table 1). Seventy-eight per cent of mothers (47\/60) \nwith children of 0.5-4 years were breastfeeding at the time of the survey. However, children \nof 3-4 years were under-represented in the sample. The median completed breastfeeding age \nwas 2.9 years. The youngest child not breastfeeding at the time of the survey was 8 months; \nthe oldest breastfeeding child was 3.1 years. The highest reported weaning age was 3.5 years.  \n<Table 1 about here> \n  \nSixty-three per cent of breastfeeding infants at the age of 0.5-1 year were breastfed more than \n10 times per 24 hour period; for breastfed infants older than 1 year, this figure was 23%.  \nAverage night-time breastfeeding frequency was 4.8 times per night for infants of 0.5-1 year \nand declined gradually over the following years (Table 1). These figures include mothers who \nwere not breastfeeding anymore at the time of the survey. There was no difference in the \nnumber of breastfeeding episodes between working and non-working mothers (t test, P=0.9; \ndf=58). The median completed breastfeeding age for working mothers was 3.1 years.  \n 7 \nDemand-feeding during the first 6 months of life, as opposed to scheduled feeding, was \nreported by the majority of non-working mothers (33\/37, 89%), but was less prevalent in \nworking mothers (9\/18, 50%) (Mann-Whitney test, P<0.01). In addition, 16% of all mothers \nreported cluster-feeding at any time of the day, i.e. frequent, short feeding bouts within a \nrelatively short amount of time, followed by a longer stretch of sleep or non-feeding activity. \nOne mother recalled that a passage from a magazine about breast milk quantity and feeding \nfrequency had influenced the frequency with which she fed her child: “[…] we cannot say \nthat breast milk is not enough for the child, although we cannot see how much he\/she drinks. \nAnd, if you can feed the baby you better feed them whenever they want”. \nThe majority of breastfeeding mothers (34\/46, 74%) favored mother-initiated weaning of \ntheir child. The remainder favored child-initiated weaning. Mothers reported that public \nhealth personnel had regularly recommended breastfeeding for at least 2 years or until the \nchild “doesn’t accept the breast anymore” – suggesting that the concept of self-weaning is \nacceptable in Sri Lanka. Encouragement from their doctor or nurse to breastfeed for at least 2 \nyears featured prominently in what women considered to be the most appreciated advice they \nreceived on infant feeding, mentioned by 38% of mothers (19\/50). Typical responses were: \n“My doctor asked me to give breast milk to my child for 2 or 3 years”; “My midwife asked me \nto feed my child even 2 years”; “The midwife advised me to give breast milk for my baby ‘til \nthe day she does not accept the breast”. Similar advice from respondents‟ own mothers was \nalso highly valued: “My mother said that it is better to feed the baby for another 2 years, \nbecause boys need more milk”, as reported by a mother whose baby was around 2 years at the \ntime of the interview, or “My mother-in-law asked me to feed my children for 6 years, \nbecause they are boys”, as reported by a mother of a twin who had begun supplementing with \ninfant formula at 4 months on advice of her nurse. \nIn contrast, mothers did not appreciate advice that they felt undermined their breastfeeding \nefforts. Six mothers recalled advice from a neighbor, friend or cousin to introduce water early \non into their babies‟ diets, for example: “A friend of mine told me that I have to give warm \nwater for my baby when he was 3 months old, otherwise breast milk will not be enough for \nhim”. Five further mothers ill-appreciated advice to introduce rehydrated commercial cow‟s \nmilk powder, not intended for infants under 1 year, as reported in the following examples: \n“One of my friends advised me to give Anchor milk powder for the baby when he was 3 \nmonths, because I started working […]”, and “While I was feeding my child, when she was 4 \nmonths old, I didn’t have enough milk, so one of my friends advised me to give Anchor milk \npowder at that time”.  Moreover, some mothers were advised to restrict or stop breastfeeding: \n“My friend told me that we have to stop breastfeeding when the child is 6 months. After that, \nwe have to give them other food”, and “Some people say to stop feeding from 5 months, \nbecause I have twins”.  \nWhen mothers were asked about their breastfeeding relationship with their own mothers, the \naverage recalled weaning age, excluding cases of early postpartum death, was 2.8 years \n(n=43) which is comparable to the current weaning age, as discussed above. A fifth of the \nmothers, however, reported that they were weaned at the age of 4 years or beyond: “My \n 8 \nmother has given me breast milk for 5 years. After I was introduced to other food, I also had \nmy mother’s milk, because it’s very important”. Three women recalled receiving breast milk \nuntil the age of 6 or 7 years: “I have had my mother’s milk until I was 7 years old. Soon after \nschool, I come home and drink my mother’s milk. Other than that, I had a balanced meal”.  \nSuch long breastfeeding periods were not reported for contemporary children. \nVarious factors shaping the experience of breastfeeding in Sri Lanka are explored in the \nfollowing sections. \nBirth  \nSixty mothers reported on the birth of their youngest child in the target age group of 0.5-4 \nyears. Of the reported births only one was a homebirth. The majority of births were reported \nas vaginal (47\/60, 78%); in one case the mother received pain relieving medication and in 11 \ncases (18%) labor was induced with „cynto‟, i.e. synthetic oxytocin. Twenty-two per cent of \nbirths were by cesarean section (13\/60); three mothers reported having had consecutive \ncesarean sections. In one case, the birth was first induced with „cynto‟, and the baby was \nsubsequently delivered by forceps. Two pairs of twins were among the group of natural \nbirths, born full-term. Mothers and infants are normally discharged from hospital the next day \nfollowing vaginal deliveries.  \nReasons for cesarean sections in the target age group ranged from maternal choice, e.g. “I \nasked the doctor to ‘cesar’ the baby” to risk factors in the mother such as being overweight \nor maternal handicaps such as one slightly shorter leg. Where births were induced, labor was \nprecipitated promptly „on the exact due date‟ to one week after the due date.  \nRegardless of the birth experience, breastfeeding was initiated in all cases, and no mothers \nreported that their birth experience had a negative impact on breastfeeding experience or \nduration. Five mothers with cesarean birth experiences breastfed their children into their third \nyear. The number of daily breastfeeding episodes was not significantly different between \nmothers with vaginal births and those with cesarean births (t test, P=0.4, df=57); the \ncompleted median breastfeeding duration was 2.9 years in both groups. This indicates that \nthere was no clear effect of birth experience on the patterning and duration of breastfeeding.  \nSleeping arrangement \nOur limited observations suggest that bed-sharing of mother and healthy, full-term newborn \nduring their hospital stay is a common practice in Sri Lanka. Moreover, all mothers reported \nsleeping in the same room with their infants upon returning home (Table 2). At the time of \nthe interview, the vast majority of mothers slept together in the same bed with their children \non a daily basis, regardless of whether they were still breastfeeding. Some families slept „all \non the floor‟, and some had an arrangement where the mother and the breastfeeding child \nslept in one section of the house\/ room and the father or one grandparent slept with the other \nchild\/ren in another section. Only a few children in the target age group were reported as \nsleeping in the same room but in different beds, and none slept in a separate room from their \nmother. The data show no significant effect of the number of household members (t test, \n 9 \nP=0.1, df=58) or house size (Mann-Whitney test, P=0.7) on mother-child bed-sharing, \nsuggesting that there were reasons for co-sleeping beyond practical necessity due to limited \nspace.   \nAll children who had not been weaned were allowed breastfeeding at night, with one mother \nrecalling advice from a television program that she particularly appreciated concerning the \nimportance of night-feedings: “… a doctor said that it’s better if we can feed our babies \nduring the night, because when we are feeding at night, our body supplies more milk for the \nnext day”. There was no significant effect of bed-sharing as opposed to sleeping in the same \nroom but in different beds on current breastfeeding (Mann-Whitney test, P=0.9) or on the \nnumber of night-time breastfeeding episodes (t test, P=0.4, df=57). However, there were only \n7 mothers who reported that their child slept in the same room but not in the same bed, and \nthus further data are required on the relationship between co-sleeping and breastfeeding in the \nSri Lankan context. \n<Table 2 about here> \nIntroduction of additional foods \nThe majority of mothers (37\/60, 62%) introduced additional foods to their infants by the age \nof 4 months (Figure 1), which is in accordance with the national recommendation of \nexclusive breastfeeding for 4 months [Ministry of Finance and Planning, 2005] but at odds \nwith the WHO recommendation of exclusive breastfeeding for 6 months. Few mothers \nintroduced additional foods in the 6th or 7th month (2\/60, 3%). The average age at \nintroduction of additional foods did not depend on the employment status of the mother (t \ntest, P=0.2, df=58). The most common first foods and liquids were squeezed fruits such as \npapaya, lime or orange and, less commonly, banana, followed by vegetable soup, red rice \nporridge and red rice water. \n<Figure 1 about here> \nMothers were asked which factors supported or opposed the onset and speed of introduction \nof additional foods. The two highest ranking factors in support of additional foods were \n„doctor‟s recommendation‟ and „fear of malnutrition‟; these were followed by „return to \nwork‟, „tired of breastfeeding‟ and finally „pregnant again‟ (Table 3). Even in half of the \nworking mothers, the fear related to malnutrition in the child was reported as a more \nimportant reason for the introduction and steady progression of additional foods at 4 months \nthan the fact that they had to return to work. Main factors opposing a steady progression of \nadditional foods were that the baby „liked breast milk best‟ and that the mother herself „liked \nbreastfeeding‟; other factors were „doctor‟s support‟, „family‟s support‟ and the fact that the \nbaby „can‟t be pushed‟ to eat. \n<Table 3 about here> \n 10 \nBottles and pacifiers \nDaily bottle use for children in the target age group was reported by 62% (21\/34) of non-\nworking mothers and by 78% (14\/18) of working mothers. Thus, the bottle was rather \ncommon in this sample; we did not obtain data on the age at which mothers introduced \nbottles to their infants. Within the target age-group eleven per cent (6\/54) of all mothers \noffered a bottle sometimes and 22% (12\/54) never offered a bottle. Daily use of bottles did \nnot significantly affect night-time breastfeeding frequency (t test, P=0.5, df=50). Most \ncommon liquids offered from a bottle were rehydrated commercial cow‟s milk powder, \nfollowed by water and fruit juice (Table 4). More working mothers fed their infants \nrehydrated commercial cow‟s milk powder from a bottle compared to non-working mothers. \nWater from a bottle was given less frequently by working mothers than by non-working \nmothers.  \n<Table 4 about here> \nPacifier use was relatively uncommon in this sample (10\/47, 21%) and was most prevalent \namong working mothers. One mother from Kandy who worked as a maid for a foreign, \nWestern family used pacifiers for her children in the mornings and evenings as well as bottles \nwith rehydrated commercial cow‟s milk powder. She fed them „bread with butter‟ after work. \nApart from such obvious examples of Western influenced child raising styles, pacifier use is \nstill rare in Sri Lanka and often discouraged by public health personnel. One reason \nmentioned was the belief that pacifiers decrease the intelligence in the child.  \nBreastfeeding during pregnancy  \nOf 35 mothers with at least 2 children encountered in this survey, the average inter-birth \ninterval was 3.4 years. This corresponds with the recorded 1.2 children of 0.5-4 years per \nmother. Most mothers had terminated breastfeeding before pregnancy or during early \npregnancy. A mother of 2 reported: “When I was feeding my eldest daughter (she was 1 year \nat that time), I was expecting my second baby (son), so it was so difficult for me. When I was \n4 months pregnant, the doctor asked me to stop feeding otherwise it’s not good for my health. \nWhen I go to bed, my daughter comes and asks for milk”. Another mother reported: “When \nmy son was 2 years, I was expecting my daughter. At that time, I was feeding my son. It was \nso difficult to stop feeding him. The doctor asked me to stop and give Anchor milk powder”. \nSix mothers, however, breastfed into their next pregnancy, mostly against the advice of their \ndoctor. One mother tandem-nursed 12 months after the birth of her second child at the time of \ninterview; in this case the mother had received positive feedback from her doctor. Tandem \nnursing refers to breastfeeding a new baby while continuing to breastfeed an older child, \nusually a toddler.  \nMaternal reflections on their breastfeeding experiences \nThe majority of mothers singled out their inner motivation as the most important factor that \nfacilitated the process of breastfeeding in their respective situation. The second important \nfactor was the support from husband, family or friends. The most commonly cited factors \n 11 \ncounteracting breastfeeding were based on the perception that other food is as good as or \nbetter than breast milk for the child‟s health and development and that exclusive \nbreastfeeding beyond the first 4 months of life causes malnutrition in the child.  \nNine mothers reflected upon the emotional effects of breastfeeding, commenting \n“breastfeeding make very close mother and child”; [it is] “good to give milk with a peaceful \nmind”; and advising other mothers, “do not get emotional when breastfeeding gets tough”. A \nless positive emotion was attributed by a working mother from Colombo who felt obligated \nto breastfeed: “you have to do it no matter what the circumstances are”. \nDiscussion \nOur results from Sri Lanka support the anthropological view that prolonged breastfeeding is \nthe biological norm (Dettwyler, 1995). The median completed breastfeeding duration of 2.9 \nyears was substantially longer than in Western societies. The breastfeeding relationship \nbetween Sri Lankan mothers and their children showed remarkable resilience to \ncounteracting factors which have been offered as explanations for the early termination of \nbreastfeeding in Western societies. \nOne factor undermining the mother‟s confidence in breastfeeding was the general \nrecommendation by health care personnel to introduce additional foods at 4 months, and \nunsound advice of friends and neighbors on the superiority of water, commercial cow‟s milk \npowder or fruits and rice to the health and development of the growing infant. Moreover, the \npremature introduction of additional foods increases the risk of gastro-intestinal diseases and \ndiarrhea where clean drinking water is not readily available and where the tropical climate \nfurthers water-born diseases and bacterial contamination of food stuffs. Despite the early \nintroduction of additional foods, however, the majority of mothers in this sample persisted \nwith non-exclusive breastfeeding for 2 or more years.  \nThe use of bottles and, to a lesser extent, pacifiers was common in this sample. These devices \nare known to play a role as replacement methods for breastfeeding by increasing separation \nbetween mother and infant, although the causality in the case of the pacifier is still debated \n(Howard et al., 2003; Adair, 2003). Nevertheless, bottles and pacifiers did not prevent \nprolonged breastfeeding in the Sri Lankan context. Near full-time paid jobs away from home \nreduced contact between working mothers and their children during the daytime, and \ndemand-feeding was less common in working as compared to non-working mothers. Work \ndid not, however, affect night-time breastfeeding or overall duration of breastfeeding. This is \nat odds with Western societies where full-time work has been shown to negatively affect \ninfant breastfeeding (Fein & Roe, 1998). Breastfeeding during a pregnancy and consecutive \n'tandem nursing of 2 children was rare, and it was also opposed by health care personnel on \nthe assumption that breastfeeding puts too much strain on the maternal body. The effect of \nbreastfeeding being terminated upon a next pregnancy is aggravated by the limited period of \nexclusive breastfeeding, as a result of which women may be able to conceive sooner, thus \nreducing the overall duration of breastfeeding. Most mothers who reported that they were still \n 12 \nbreastfeeding at the onset of their next pregnancy had heartbreaking memories of the \ntermination of breastfeeding upon the advice of their doctor. However, breastfeeding during \npregnancy is generally considered to pose no health risks for mother and unborn child, if the \npregnancy is normal and the mother healthy. Moreover, continuing breastfeeding the older \nchild after delivery, called tandem nursing, helps to prevent abrupt change for the older child \nwhich could lead to psychological trauma (Academy of American Family Physicians, 2007; \nFlower, 2007). Birth interventions such as cesarean sections potentially affect breastfeeding, \nbut did not influence the patterning and prolonged duration of breastfeeding in this sample.  \nVarious factors in support of prolonged breastfeeding in Sri Lanka were evident in our study. \nSupport of breastfeeding by health care personnel began, intentionally or not, with routine \nrooming-in or, more accurately, bed-sharing at the time of birth in the hospital. This practice \nbenefits the mother-child relationship, the onset of milk production and the continuation of \nbreastfeeding after release from the hospital and beyond (Ball et al., 2006; Ball & Ward Platt, \n2007).  \nThe concept of prolonged breastfeeding is culturally acceptable in Sri Lanka. The doctor‟s or \nnurse‟s direct advice was to breastfeed for 2 years or “until the child does not accept the \nbreast anymore”. This advice was apparently consistent with the cultural norm and was \nreported as much appreciated by mothers. \nMother-child co-sleeping in the same bed or next to each other on the floor, even after \nweaning, was the norm in our study sample at least until the child was 4 years old, and was \npracticed by working and non-working mothers alike. A mutually reinforcing relationship \nbetween bed-sharing and prolonged breastfeeding is plausible as breastfeeding was common \nand frequent during the night. More work is needed to underpin this relationship. \nA common dismissal of lessons drawn from cross-country comparisons is that contextual \ndifferences between cultures prevent a meaningful extrapolation of certain practices from one \nculture to another. Our study, however, suggests that Sri Lankan mothers are confronted with \nsimilar factors counteracting breastfeeding as mothers in Western societies; these factors \ninclude near full-time work, introduction of additional foods from 3-4 months onwards, and \nthe use of bottles and pacifiers. Despite these challenges, the majority of mothers and \nchildren in our sample managed to sustain a prolonged breastfeeding relationship. The \nsupporting factors acted in two ways: through reinforcement of the notion among mothers \nthat prolonged breastfeeding is the norm and through the cultural practice of bed-sharing \nwhich fosters mother-child sleep contact and facilitates frequent night-time breastfeeding \nfrom birth and during the first years of life. Both the normative aspect and the practice of \nbed-sharing differ from Western societies where cultural norms prescribe independent infant \nsleep and where sleeping-through-the-night is generally considered an indicator of both infant \ndevelopment and parental competence (Ford, 2002; Rowe, 2003). We propose that bed-\nsharing and associated mother-child sleep contact and night-time breastfeeding in the Sri \nLankan context prevents premature weaning and thus protects the breastfeeding relationship \nin spite of challenging conditions faced during the daytime.  \n 13 \nSleep laboratory studies support the assumption that co-sleeping contributes to the practice \nand overall duration of breastfeeding, showing that “bed-sharing, instead of sleeping in \nseparate rooms, almost doubled the number of breastfeeding episodes and tripled the total \nnightly duration of breast-feeding” (McKenna et al., 1997). Co-sleeping mothers and infants \nhave demonstrated synchrony in their sleep patterns, facilitating simultaneous arousals and \nfrequent bouts of breastfeeding (McKenna et al., 1997; Mosko et al., 1997; Ball & Ward \nPlatt, 2007). By sharing sleep, the infant‟s basic need for physical closeness and frequent, \nshort feeding episodes is optimally met while the mother gets more rest. \nParental lifestyles and sleeping environments may introduce risks to bed-sharing infants and, \nhence, safety guidelines have been developed in various countries to promote safe infant \nsleep. These guidelines apply to both the risks of SIDS and accidental infant deaths. It has \nbeen shown that long, uninterrupted stretches of deep sleep are associated with key SIDS risk \nfactors such as prone sleep and exposure to maternal smoking (Horne et al., 2002, 2004). \nHowever, babies who nurse and share sleep with their mothers normally sleep in the supine \nposition and experience frequent brief arousals, reducing the risk of SIDS (Blair et al., 2006).  \nMoreover, bed-sharing mothers sleep facing their newborn and young baby with their body in \na protective position, frequently checking on the condition of their baby, thereby reducing the \nrisk of suffocation (Ball, 2006).  \nIn Sri Lankan society, an educational approach to breastfeeding rather than receiving \ninstructions about when to do what could help mothers and children enjoy more of their \nbreastfeeding relationship (La Leche League International, 2007). Hence, mothers learn to \nadjust their child rearing decisions to their individual child‟s cues in a changing environment \nwhere modern lifestyle and accompanying health care recommendations may conflict with \nestablished norms and customs.  \nIn addition, evidence-based recommendations by health services are needed on the \ncontinuation of breastfeeding during a subsequent pregnancy. It is important for mothers to \nknow that breastfeeding does not need to be supplemented or replaced before the age of 6 \nmonths, and that foods or liquids offered during the first year of life are an addition to \nbreastfeeding, not a substitute.  \nBreastfeeding promotion efforts in the West have concentrated on encouraging women to \ninitiate breastfeeding. In addition, however, women need to be educated about the benefits \nand determinants of prolonged breastfeeding. Our study highlights the potential value of bed-\nsharing for sustaining the breastfeeding relationship. The Western preoccupation with \nfostering long, uninterrupted and independent infant sleep from an early age and thus \nrestricting breastfeeding to a daytime activity has undermined breastfeeding duration to an \nextent that is, as yet, insufficiently recognized by the majority of breastfeeding promotion \nspecialists (Ball & Ward Platt, 2007).  \n 14 \nConclusions \nSri Lankan mothers in our sample were confronted with several factors opposing \nbreastfeeding, including near full-time work, the introduction of additional foods from as \nearly as 3-4 months onwards, and the use of bottles and pacifiers. These counteracting factors \nwere, however, not a death-knell for the breastfeeding relationship which lasted for a median \nof 2.9 years. Factors in support of prolonged breastfeeding were public health \nrecommendations and cultural acceptance. Moreover, the common practice of bed-sharing \nand associated night-time breastfeeding, by working and non-working mothers alike, ensured \nclose physical contact and enabled sustained lactation. The value of bed-sharing and \nassociated night-time breastfeeding deserves more attention within breastfeeding promotion \nefforts in the West where breastfeeding is chiefly seen as a daytime activity when it is most \nvulnerable to adverse external influences. Our study furthermore identified the need for \nextending the period of exclusive breastfeeding and reassessing advice on breastfeeding \nduring a subsequent pregnancy in Sri Lanka.  \nCompeting interests \nNone declared. \nAuthors' contributions \nMJB conceived of the study, coordinated the data collection and analysis, and drafted and \nrevised the manuscript. HLB helped to draft the manuscript and contributed to its revision. \nBoth authors read and approved the final manuscript. \nAcknowledgements \nDeeptha Shridaran, Dilhani Kudaganga and Julie White are thanked for their tireless work of \ntranslating and interviewing. We also thank all the busy Sri Lankan mothers who took the \ntime to complete the questionnaire. Martina wants thank Henk van den Berg for his technical \nsupport, his time and patience. She wants to thank her sons Nishan and Sashin who taught her \nabout the essence of human nature. Helen thanks Martina for the invitation to collaborate in \nthe writing of this paper. The study and its write-up were conducted without external funding. \nReferences \nAdair, S.M. (2003) Pacifier use in children: a review of recent literature. Pediatric Dentistry, \n25: 449-458. \nAmerican Academy of Pediatrics (1997) Work group in breastfeeding: breastfeeding and the \nuse of human milk. Pediatrics, 100: 1035-1039. \nAmerican Academy of Family Physicians (2007) Breastfeeding (Position Paper). \nhttp:\/\/www.aafp.org\/x6633.xml. Accessed 26 March 2007. \nBall, H.L., Ward Platt, M.P., Heslop, E., Leech, S.J. and Brown, K.A. (2006) Randomised \ntrial of mother-infant sleep proximity on the post-natal ward. Archives of Disease in \nChildhood, 91: 1005-1010.  \n 15 \nBall, H.L. (2006) Parent-infant bed-sharing behavior: effects of feeding type, and presence of \nfather. Human Nature, 17: 301-308. \nBall, H.L. and Ward Platt, M.P. (2007) Evolutionary intervention on the post-natal ward: a \ntest of mother-infant proximity. Evolutionary Anthropology (accepted). \nBlair, P.S., Sidebotham P., Berry, P.J., Evans, M and Fleming, P.J. (2006) Major \nepidemiological changes in sudden infant death syndrome: a 20-year population-\nbased study in the UK. Lancet, 367: 314-319. \nCadwell, C.M. (2002) Defining breastfeeding in research. In Cadwell, K. (ed), Reclaiming \nBreastfeeding for the United States: Protection, Promotion, and Support, pp. 81-89. \nJones & Bartlett, Sudbury, Massachusetts. \n((Der G., Batty, G.D. and Deary, I.J. (2006) Effect of breast feeding on intelligence in \nchildren: prospective study, sibling pairs analysis, and meta-analysis. British \nMedical Journal, 333: 945-948.)) \nDettwyler, K.A. (1995) A time to wean: the hominid blueprint for the natural age of weaning \nin modern human populations. In Stuart-Mcadam, P. & Dettwyler, K.M. (eds), \nBreastfeeding: Bio-cultural Perspectives, pp. 39-73. Aldine De Gruyter, New York. \nDeutsche Gesellschaft für Ernährung e.V. (2000) Ernährungsbericht 2000. Deutsche \nGesellschaft für Ernährung e.V., Frankfurt am Main. \nFein, S.B. and Roe, B. (1998) The effect of work status on initiation and duration of breast-\nfeeding. American Journal of Public Health, 88: 1042-1046. \nFlower, H. D. (2007) A New Look at the Safety of Breastfeeding during Pregnancy. \nhttp:\/\/www.pregnancy.org\/article.php?sid=3035. Accessed 26 March 2007. \nFord, G. (2002) The New Contented Little Baby Book: the Secret to Calm and Confident \nParenting. Mackays of Chatham, Chatham, UK. \nHamlyn, B., Brooker. S., Oleinikova, K. and Wands, S. (2002) Infant Feeding 2000. The \nStationary Office, Department of Health, London. \nHorne, R.S.C., Franco, P., Adamson, T.M., Groswasser, J. and Kahn, A. (2002) Effects of \nbody position on sleep and arousal characteristics in infants. Early Human \nDevelopment, 69: 25-33. \nHorne, R.S.C., Franco, P., Adamson, T.M., Groswasser, J. and Kahn, A. (2004) Influences of \nmaternal cigarette smoking on infant arousability. Early Human Development, 79: \n49-58.  \nHoward, C.R., Howard, F.M., Lanphear, B., Eberly, S., deBlieck, E.A., Oakes, D. and \nLawrence, R.A. (2003) Randomized clinical trial of pacifier use and bottle-feeding or \ncupfeeding and their effect on breastfeeding. Pediatrics, 111: 511-518. \nJaspan, H.B., Lawn, S.D., Safrit, J.T. and Bekker, L.G. (2006) The maturing immune system: \nimplications for development and testing HIV-1 vaccines for children and \nadolescents. AIDS, 20: 483-494. \nLa Leche League International (2007) La Leche League’s Mission. \nhttp:\/\/www.lalecheleague.org\/mission.html. Accessed 22 January 2007. \nLéon-Cava, N., Lutter, C., Ross, J. and Martin, L. (2002) Quantifying the Benefits of \nBreastfeeding: a Summary of the Evidence. PAHO Document HPN\/66\/2. Pan \nAmerican Health Organization, Washington DC.  \nLi, R., Darling, N., Maurice, E., Barker, L. and Grummer-Strawn, L.M. (2005) Breastfeeding \nrates in the United States by characteristics of the child, mother, or family: the 2002 \nnational immunization survey. Pediatrics, 115: e31-e37. \nMcKenna, J.J., Mosko, S.S. and Richard, C.A. (1997) Bedsharing promotes breast-feeding. \nPediatrics, 100: 214-219. \n 16 \nMinistry of Finance and Planning (2005) Sri Lanka, New Development Strategy. \nFramework for Economic Growth and Poverty Reduction. Ministry of Finance \nand Planning, Colombo. \nMortensen, E.L., Michaelsen, K.F., Sanders, S.A. and Reinisch, J.M. (2002) The association \nbetween duration of breastfeeding and adult intelligence. Journal of the American \nMedical Association, 287: 2365-2371. \nMosko, S., Richard C. and McKenna, J. (1997) Infant arousals during mother-infant bed \nsharing: implications for infant sleep and sudden infant death syndrome research. \nPediatrics, 100: 841-849. \nPadmanathan, I., Liljestrand, J., Martins, J.M., Rajapaksa, L.C., Lissner, C., Silva, A., \nSelvaraju, S. and Singh, P.J. (2003) Investing in Maternal Health: Learning from \nMalaysia and Sri Lanka. The World Bank, Washington DC.  \nPerera, B.J.C., Ganesan, S., Jayarasa, J. and Ranaweera, S. (1999) The impact of \nbreastfeeding practices on respiratory and diarrhoeal disease in infancy: a study from \nSri Lanka. Journal of Tropical Pediatrics, 45: 115-118. \nRowe, J. (2003) A room of their own: the social landscape of infant sleep. Nursing Inquiry, \n10: 184-192. \nSPSS (2005) SPSS 14.0 for Windows. SPSS Inc., Chicago, USA.  \nUNDP (2006) Asia-Pacific Human Development Report 2006. UNDP Regional Centre, \nColombo, Sri Lanka. \nUNICEF (2006) Statistics, Sri Lanka. \nhttp:\/\/www.unicef.org\/infobycountry\/sri_lanka_sri_lanka_statistics.html. Accessed 31 \nDecember 2006. \nWHO (1998)  Evidence for the Ten Steps to Successful Breastfeeding. World Health \nOrganization, Geneva. \n \n 17 \nTables \n \n \n \n \nTable 1: Breastfeeding and night-time nursing \nNumber and percentage of mothers reported breastfeeding their youngest child and average \nnight-time nursing frequency at the time of the survey, stratified by age. \n \n \nAge of child \n \nn \nNumber (%) \nbreastfeeding  \nNight-time nursing \nfrequency \n0.5-1 year 17 16 (94%) 4.8 \n1-2 year 20 17 (85%) 2.6 \n2-3 year 17 13 (76%) 2.4 \n3-4 year 6   1 (17%) 0.3 \n \n \n \n \n \n \n \nTable 2: Sleeping arrangement of youngest child in relation to the mother  \n \nSleeping arrangement Households \n(n=60) \nSame room  60 (100%) \nSame room and same bed 49   (82%) \nSame room but different beds 7   (12%) \n \n \n \n \n \n \n 18 \n \nTable 3: Factors supporting and opposing the onset and speed of introduction of \nadditional foods \nThe relative importance of supporting or opposing factors ranked by mothers as an average \nscore from 1 (‘not important’) to 5 (‘very important’). \n \n \n \nSupporting factors Score   Opposing factors Score   \nDoctor's recommendation 4.0  Baby likes breast milk \nbest \n3.8  \nFear of malnutrition 3.6  I like breastfeeding 3.2  \nReturn to work 1.9  Doctor's support 2.3  \nTired of breastfeeding 1.7  Family's support 2.0  \nPregnant again 1.0  Baby can't be pushed 1.8  \n \n \n \n \n \nTable 4: Use of bottles and pacifiers in non-working and working mothers \n \nVariable  Non-working n Working n P* \nBottle use:       \n    a. Anchor\/Nestle cow’s milk powder  39% 28 73% 15 P < 0.04 \n    b. Water  64% 28 13% 15 P < 0.01 \n    c. Fruit juice  46% 28 20% 15 n.s. \n    d. Lactogen\/SMA powdered infant formula   11% 28 20% 15 n.s. \nPacifier use  10% 31 50% 16 P < 0.01 \n \n* Mann-Whitney test  \n \n \n \n \n \n \n \n 19 \n \nFigure 1  \nBabies’ age at introduction of additional foods  \n \n \n 20 \nAnnex 1: Overview of topics in the interview schedule, in sequential order \n \n1 Household members \n2 Location of birth \n3 Type and conditions of birth \n4 Experience of birth \n5 Age at which other foods were offered on a daily basis; how many times per day? Kind of foods \n6 Breastfeeding ongoing or stopped \n7 Reasons why a steady progression of food other than breast milk  \nwas important (priority ranking 1-5)  \n8 Reasons why a steady progression of food other than breast milk  \nwas NOT important (priority ranking 1-5)  \n9 Picked up work outside the house; number of hours away from the child\/-ren;  \nkind of work; reasons for picking up work \n10 Type of food offered upon coming home \n11 Use of bottles; types of food \n12 Use of pacifier \n13 Breastfeeding pattern during first six months \n14 Sleeping arrangement \n15 Breastfeeding at night; frequency \n16 Monthly expenditure on medicines for the child \n17 Activities engaged in with child\/-ren (multiple-choice) \n18 Decision to nurse the child \n19 Experience with nursing during pregnancy and tandem nursing; received feedback  \n20 Nursing frequency in 24 hours (< 10 times, > 10 times) \n21 Description of breastfeeding episode; average duration \n22 Breast problems associated with breastfeeding; how problems were dealt with \n23 House size (< 30 m²; > 30 m²) \n24 Paid helpers in the house (no; few times a week; daily)  \n25 Plan for weaning or actual weaning of child\/-ren (mother- or child-initiated) \n26 Sources of breastfeeding information \n27 Factors supporting and opposing breastfeeding (multiple-choice) \n28 Most satisfying and most dissatisfying breastfeeding advice \n29 Breastfeeding of mother in her own childhood \n \n \n"}