{"doi":"10.1063\/1.370658","coreId":"15345","oai":"oai:dro.dur.ac.uk.OAI2:7623","identifiers":["oai:dro.dur.ac.uk.OAI2:7623","10.1063\/1.370658"],"title":"Characteristics of impact ionization rates in direct and indirect gap  semiconductors.","authors":["Harrison, D.","Abram, R.A.","Brand, S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-01-01","abstract":"Impact ionization rates for electrons and holes in three semiconductors with particular band structure characteristics are examined to determine underlying factors influencing their qualitative behavior. The applicability of the constant matrix element approximation is investigated, and found to be good for the indirect gap material studied, but overestimates threshold softness in the direct gap materials. The effect that final states in the Γ valley have in influencing characteristics of the rate in the direct gap materials is investigated, and it is found that they play a significantly greater role than the low density of Γ valley states would suggest. The role of threshold anisotropy in affecting threshold softness is examined, and it is concluded that it plays only a small part, and that softness is controlled mainly by the slow increase in available phase space as the threshold energy is exceeded","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15345.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7623\/1\/7623.pdf","pdfHashValue":"1882243e8feba33317fbb5b07ce72bcd826fc190","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7623<\/identifier><datestamp>\n      2010-12-07T12:31:22Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Characteristics of impact ionization rates in direct and indirect gap  semiconductors.<\/dc:title><dc:creator>\n        Harrison, D.<\/dc:creator><dc:creator>\n        Abram, R.A.<\/dc:creator><dc:creator>\n        Brand, S.<\/dc:creator><dc:description>\n        Impact ionization rates for electrons and holes in three semiconductors with particular band structure characteristics are examined to determine underlying factors influencing their qualitative behavior. The applicability of the constant matrix element approximation is investigated, and found to be good for the indirect gap material studied, but overestimates threshold softness in the direct gap materials. The effect that final states in the Γ valley have in influencing characteristics of the rate in the direct gap materials is investigated, and it is found that they play a significantly greater role than the low density of Γ valley states would suggest. The role of threshold anisotropy in affecting threshold softness is examined, and it is concluded that it plays only a small part, and that softness is controlled mainly by the slow increase in available phase space as the threshold energy is exceeded.<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of applied physics, 1999, Vol.85(12), pp.8186-8192 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        1999-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7623<\/dc:identifier><dc:identifier>\n        issn:0021-8979<\/dc:identifier><dc:identifier>\n        issn: 1089-7550<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.370658<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7623\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.370658<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7623\/1\/7623.pdf<\/dc:identifier><dc:rights>\n        Copyright (1999) American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Harrison, D. and Abram, R.A. and Brand, S. (1999) 'Characteristics of impact ionization rates in direct and indirect gap semiconductors.', Journal of applied physics., 85 (12). pp. 8186-8192 and may be found at http:\/\/dx.doi.org\/10.1063\/1.370658<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1089-7550","0021-8979","issn:0021-8979","issn: 1089-7550"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 December 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHarrison, D. and Abram, R.A. and Brand, S. (1999) ’Characteristics of impact ionization rates in direct and\nindirect gap semiconductors.’, Journal of applied physics., 85 (12). pp. 8186-8192.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.370658\nPublisher’s copyright statement:\nCopyright (1999) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. The following article appeared in\nHarrison, D. and Abram, R.A. and Brand, S. (1999) ’Characteristics of impact ionization rates in direct and indirect\ngap semiconductors.’, Journal of applied physics., 85 (12). pp. 8186-8192 and may be found at\nhttp:\/\/dx.doi.org\/10.1063\/1.370658\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nCharacteristics of impact ionization rates in direct and indirect gap\nsemiconductors\nD. Harrison, R. A. Abram,a) and S. Brand\nDepartment of Physics, University of Durham, South Road, Durham DH1 3LE, United Kingdom\n~Received 6 November 1998; accepted for publication 22 February 1999!\nImpact ionization rates for electrons and holes in three semiconductors with particular band\nstructure characteristics are examined to determine underlying factors influencing their qualitative\nbehavior. The applicability of the constant matrix element approximation is investigated, and found\nto be good for the indirect gap material studied, but overestimates threshold softness in the direct\ngap materials. The effect that final states in the G valley have in influencing characteristics of the\nrate in the direct gap materials is investigated, and it is found that they play a significantly greater\nrole than the low density of G valley states would suggest. The role of threshold anisotropy in\naffecting threshold softness is examined, and it is concluded that it plays only a small part, and that\nsoftness is controlled mainly by the slow increase in available phase space as the threshold energy\nis exceeded. © 1999 American Institute of Physics. @S0021-8979~99!06411-7#\nI. INTRODUCTION\nImpact ionization is an important process occurring in\ndevices in which significant numbers of high energy carriers\nare present. A carrier excited to high energy, typically by a\nhigh electric field, is able to excite a valence band electron\nacross the band gap, thus creating an electron–hole pair. The\nprocess is often detrimental to device performance, limiting\nthe bias at which devices such as field effect transistors can\nbe operated,1–3 whereas other devices such as IMPATT\ndiodes4 and avalanche photodiodes5,6 rely on the charge mul-\ntiplication it produces for their operation.\nMonte Carlo simulation is a frequently used tool for the-\noretical investigations into the role of impact ionization in\ndevices.7–14 The rate of charge multiplication occurring in\nthe simulation is affected by two factors: the process by\nwhich carriers are excited to high enough energies to initiate\nionization, and the rate at which carriers that have gained\nsufficient energy actually ionize. In both these aspects of the\ncalculation, the high energy nature of the process requires the\nuse of realistic band structure. The resulting numerical com-\nplexity places large demands on computational resources and\ndoes not promote a simple understanding of the process. This\npaper is concerned with the second factor affecting impact\nionization in devices—the rate of ionization initiated by car-\nriers above threshold. In an effort to find more intuitive\nshortcuts to understanding the qualitative behavior of the im-\npact ionization rate in different materials, rates in three semi-\nconductors are examined in this paper with the aim of high-\nlighting the underlying physical factors affecting their\nqualitative form.\nII. METHOD\nImpact ionization rates are calculated here in the semi-\nclassical Fermi’s Golden Rule approximation. The rate of\ntransition for two electrons initially in states at k1 ~the im-\npacting electron! and k2 ~the impacted electron! to final\nstates at k18 and k28 , given by Fermi’s Golden Rule is\n15\nRII~k1 ,k2 ,k18 ,k28!5\n2p\n\\\nuM i f u2d~E181E282E12E2!,\n~1!\nwhere E1 , E2 , E18 and E28 are the energies of the electrons\nat k1 , k2 , k18 and k28 respectively. The matrix element is\ngiven by15,16\nM i f5M d2M e , ~2!\nwhere the so called direct matrix element M d is given by\nM d5E c18* ~r1!c28* ~r2!Vc1~r1!c2~r2!d3r1 d3r2 , ~3!\nV~r1 ,r2!5\ne2\n~2p!3e0\nE eiq\u0096(r22r1)e~q,v!uqu2 d3q, ~4!\nq5k182k1 , \\v5E12E18 , ~5!\nand the so called exchange matrix element M e is obtained by\nexchanging the indices 18 and 28 in Eqs. ~3! and ~5!.\nMatrix elements are calculated using the pseudowave\nfunctions returned by the nonlocal pseudopotential method\nof Chelikowski and Cohen17 which includes the effect of the\nspin-orbit interaction. The pseudowave functions are ex-\npanded in terms of 65 plane waves ~130 expansion coeffi-\ncients in all when spin is included!. An isotropic q- and\nv-dependent expression is used to approximate the full q-\nand v-dependent dielectric function e~q,v! which appears in\nEq. ~4! and is calculated using the method of Walter and\nCohen.18\nTo obtain the total transition rate from a given impacting\nstate k1 , all possible transitions must be summed over\nRII~k1!5\nV2\n~2p!2 E 2p\\ uM i f u2d~DE !d3k18d3k28 , ~6!a!Electronic mail: R.A.Abram@durham.ac.uk\nJOURNAL OF APPLIED PHYSICS VOLUME 85, NUMBER 12 15 JUNE 1999\n81860021-8979\/99\/85(12)\/8186\/7\/$15.00 © 1999 American Institute of Physics\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nwhere\nDE5E~k18!1E~k28!2E~k1!2E~k181k282k1!. ~7!\nFor each final state phase space element dk18 dk28 , the im-\npacted vector k2 is chosen so as to ensure crystal momentum\nis conserved, and the Dirac delta function ensures energy is\nconserved in each transition. The six-dimensional integral is\nperformed by an algorithm described elsewhere,19 which is a\ndevelopment of the method of Kane.20\nIII. RESULTS\nThe rate integration algorithm has been applied to the\nbulk unstrained semiconductors GaAs, In0.53Ga0.47As and\nSi0.5Ge0.5 ~henceforth referred to as InGaAs and SiGe!, all at\n300 K. GaAs is an important semiconductor in the fabrica-\ntion of high-speed devices, and InGaAs and SiGe have ap-\nplications in the design of devices for optical communica-\ntions. Although InGaAs and SiGe have rather narrower gaps\nthan GaAs, they are all ‘‘wide band gap’’ in the sense that\nionization thresholds lie at energies above the applicability\nof simple analytic band approximations. The band structure\ncalculation for each material is performed using the nonlocal\npseudopotential method of Chelikowski and Cohen.17 Form\nfactors and nonlocal well parameters for each material are\ngiven in Table I.\nRates and distributions of generated carriers are calcu-\nlated and analyzed to determine factors affecting the behav-\nior of the different materials. The influence of three factors\non the behavior of the impact ionization rates in each mate-\nrial, particularly on the threshold softness, were examined:\nthe role of variation in the matrix elements, the significance\nof the G valley in providing final states in the direct gap\nmaterials, and the effect of threshold anisotropy. Each of\nthese is discussed below.\nA. Role of matrix elements\nThe magnitude of the impact ionization rate can be con-\nsidered to be determined by two factors: the area of the en-\nergy conserving surface in k18 ,k28 space, i.e., the volume of\navailable phase space, and the average squared magnitude of\nthe matrix elements throughout this phase space. This section\nexamines the relative importance of each of these contribu-\ntions. Impact ionization rates calculated using the algorithm\ndescribed in Ref. 19 were approximated by a fit formula of\nthe form\nR~E !5A~E2E0!P, ~8!\nwhere the parameters A , P and E0 were adjusted to give the\nbest straight line fit through log R vs log E. The P parameter\nobtained is of interest as a higher value of P corresponds to\na softer threshold.21,22 Expressions of the form of Eq. ~8!\nwere also fitted to the volume of phase space ~i.e., the rate\ncalculated by setting the matrix elements to 1! for each ma-\nterial. Table II lists the P values obtained from the fits. In the\ncase of the direct gap materials GaAs and InGaAs, the rate\nshows harder threshold behavior ~i.e., a lower P value! than\nthe corresponding volume of phase space for both electrons\nand holes. Conversely, electron and hole initiated rates in the\nindirect gap SiGe show quite similar ~in fact, slightly softer!\nbehavior than the corresponding phase space. Where the vol-\nume of phase space increases as a higher power of energy\nabove threshold than the rate ~i.e., as in the direct gap mate-\nrials!, it follows that the mean matrix element must be a\ndecreasing function of the energy of the impacting carrier.\nSimilarly, in SiGe the mean matrix element must be almost\nindependent of the impacting carrier energy, increasing very\nslightly with respect to it. The cause of the matrix elements’\ndependence on the impacting carrier energy can be under-\nstood in terms of the variation in the mean momentum trans-\nfer occurring during collisions as a function of the energy of\nthe initiating particle. Figure 1 plots the mean q transfer for\ntransitions initiated by electrons in the first conduction band\nof each material. In the case of GaAs and InGaAs, the mean\nq transfer is an increasing function of the initiating electron’s\nenergy, while in SiGe it is more-or-less independent of this\nenergy. The matrix element for a given transition depends on\nq roughly as\nuM i f u2}1\/q4. ~9!\nTABLE I. Material parameters for the pseudopotential band structure cal-\nculation ~see Ref. 17!. VS , VA are symmetric and antisymmetric form fac-\ntors in Ry; a0 , b0 specify s-well depth in same way as in Ref. 17; R0 is\ns-well radius in Å; A2 is d-well depth in Ry; R2 is d-well radius in Å;\nsuperscripts c and a denote cation and anion; a is ratio of spin splitting in\nfree atoms; m parametrizes strength of spin-orbit interaction in crystal and is\nadjusted to give spin split-off gaps of 0.35 eV in GaAs, 0.36 eV in InGaAs\nand 0.12 eV in SiGe.\nParameter GaAs InGaAs SiGe\nVS()) 20.214 20.2064 20.2255\nVS(A8) 0.014 0.0065 0.0268\nVS(A11) 0.067 0.0558 0.0641\nVA()) 0.055 0.0480 0.0000\nVA(A4) 0.038 0.0441 0.0000\nVA(A11) 0.001 0.0092 0.0000\na0\nc 0.000 0.0000 0.0036\nb0\nc 0.000 0.0005 0.2008\nA2\nc 0.125 0.5575 0.5262\nR0\nc 1.296 1.2696 1.0596\nR2\nc 1.219 1.2691 1.1982\na0\na 0.000 0.0000 0.0036\nb0\na 0.000 0.1287 0.2008\nA2\na 0.625 1.5583 0.5262\nR0\na 1.058 1.0580 1.0596\nR2\na 1.219 1.2691 1.1982\na 1.380 0.9927 1.0000\nm see caption see caption see caption\na0 5.648 5.8618 5.5344\nTABLE II. Fitted P-parameters for rates (Pr) and phase space (Pps). Fit\nformula is: R(E)5A(E2E0)P ~with R in units of s21 and E in eV!.\nMaterial\nGaAs InGaAs SiGe\nPr Pps Pr Pps Pr Pps\ne2 5.2 6.1 5.6 9.4 4.9 4.8\nh1 5.1 6.1 4.2 6.4 4.7 4.4\n8187J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nThus, as the mean q transfer increases with increasing im-\npacting carrier energy in the direct gap materials, so the\nmean matrix element falls, and hence the rate shows a harder\nenergy dependence than the corresponding volume of phase\nspace. Similarly, in SiGe the roughly constant mean q trans-\nfer leads to roughly constant mean matrix elements and\nhence the P parameters fitted to rate and phase space are\napproximately equal. This has implications for the use of the\nconstant matrix element ~CME! approximation which has oc-\ncasionally been used to calculate rates.23 Figure 2 compares\nrates calculated using the full expression for the matrix ele-\nment and using the CME approximation in InGaAs and SiGe.\nIn each case the magnitude of the constant approximating the\nmatrix elements has been chosen so as to give the same rate\nat high energy as that calculated using the full expression for\nM i f . In SiGe, the CME approximation is clearly excellent,\ngiving rates close to those obtained using the full expression\nfor the matrix element throughout the whole energy range\nplotted. In InGaAs however, the CME approximation badly\nunderestimates the rate at low impacting carrier energy by up\nto 2 orders of magnitude, predicting softer threshold behav-\nior. In GaAs, the CME approximation leads to a similar un-\nderestimation of the rate at low energy, though to less of an\nextent than in InGaAs. Although the analysis here has been\napplied to only three materials, it should generally be the\ncase that in direct gap materials the use of the CME approxi-\nmation will lead to overestimation of the threshold softness,\nparticularly when the G valley lies well below the satellite\nvalleys, and in indirect gap materials should provide more\naccurate results.\nB. Influence of G valley on rate\nThe principle difference between the band structures of\nthe indirect gap material SiGe and the direct gap materials\nGaAs and InGaAs is of course the existence in GaAs and\nInGaAs of a deep conduction band valley at G, which in\nSiGe is only very shallow. Having a light effective mass, the\nG valley does not provide a high density of states in com-\nparison to the heavy effective mass satellite valleys, and it\nmight therefore be expected that its influence on quantities\ninvolving integration over the Brillouin zone, such as the\nimpact ionization rate, would be small. In fact the qualitative\ndifferences between the direct and indirect gap materials\nstudied here, such as that described in Sec. III A, suggest that\nit is highly influential, and this is investigated here.\nThe solid circles plotted in Fig. 3 indicate what fraction\nof the total rate is accounted for by transitions in which one\nor both final states lie in the G valley. The open circles simi-\nlarly represent the G valley’s fractional contribution to the\nphase space. The dotted line is an estimate of the phase space\nprovided by the G valley based on its three-dimensional den-\nFIG. 1. Mean q transfer for transitions initiated by electrons in the first\nconduction band of each material. The horizontal line at q.0.75 indicates\nthe mean value of q obtained by chosing transitions randomly in the first\nBrillouin zone.\nFIG. 2. Comparison of rates calculated for InGaAs and SiGe using the full\nexpression for the matrix element and the CME approximation.\nFIG. 3. Contribution of transitions involving the G valley as a fraction of all\ntransitions to the rate and volume of phase space in InGaAs.\n8188 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nsity of states, and assuming the final state carrier energy E f is\nrelated to the impacting carrier energy Ei by\nE f5\n1\n3~Ei2Egap!, ~10!\nwhich is based on the simplifying assumption that the three\ngenerated carriers share equally the energy made available\nby the impacting carrier. The plot shows that the fractional\ncontribution of the G valley to the total volume of available\nphase space drops off rapidly once the heavier satellite val-\nleys become accessible, and is approximately equal to the\nsimple estimate for the value based on the three-dimensional\ndensity of states in this valley. However the fractional con-\ntribution to the rate remains much higher, accounting for the\nmajority of transitions for impacting carriers up to about 3.5\neV. The fact that the G valley has a greater significance in\ninfluencing the total rate than would be expected from its\ncontribution to the available phase space indicates that the\ncorresponding matrix elements are higher. This is due to the\nlow q transfer involved in transitions from the top of the\nvalence band to states in the conduction band near G.\nBy excluding transitions to the G valley from the rate\ncalculation, the behavior of the rate in each of the three ma-\nterials studied here becomes very similar. Figure 4 compares\nelectron initiated rates in InGaAs, calculated using the full\nexpression for the matrix element, and using the CME ap-\nproximation. In Fig. 4~a!, the rate is calculated as normal,\nincluding contributions from all possible transitions. @Note,\nFigs. 2 and 4~a! are equivalent plots, but to reduce the re-\nquired cpu time, Fig. 4 has been produced by including a\nreduced set of bands for the impacted and final states, hence\nthe lower but qualitatively similar rates.# The rates in Fig.\n4~b! have been calculated in a similar way, but excluding the\ncontribution of transitions in which one or both final states\nlie in the G valley. In Fig. 4~a! the use of the CME approxi-\nmation can be seen to lead to overestimation of the threshold\nsoftness, as discussed in Sec. III A. With final states provided\nby the G valley excluded, the accuracy of the CME approxi-\nmation is seen to be considerably improved, as in SiGe.\nTable III compares fits of the expression, Eq. ~8!, obtained\nfrom the rates calculated using the full matrix element ex-\npression with and without final states in the G valley in-\ncluded. With transitions to the G valley included, the fitted\nexpressions for the rates differ considerably. When final\nstates in the G valley are excluded, the fitted expressions for\neach material, particularly the P values, become similar, in-\ndicating that the origin of differences in the behavior of the\nrates in each of these materials, in particular the threshold\nsoftness, is influenced almost entirely by the G valley, with\nthe contribution of the rest of the band structure being simi-\nlar for each material. This is in agreement with predictions of\nBude and Hess10 who have noted that thresholds are ex-\npected to be softer in materials in which the G satellite valley\nseparation is larger and the band gap is smaller. Note that\nAllam24 has pointed out that the materials studied here are all\nsimilar in that, although they have widely ranging band gaps,\nthey each have a similar value of ^E ind&, defined as\n^E ind&5\n1\n8~EG13EX14EL!, ~11!\nwhere EV is the energy gap between the top of the valence\nband and the bottom of the conduction band valley at V .\nAllam notes that InP, for example, has a larger value of\n^E ind&, and so should the analysis performed here of rates\ncalculated with final states in the G valley excluded be ap-\nplied to this material, similarities of the form seen in Table\nIII might not be found.\nC. Influence of anisotropy on threshold softness\nSimple impact ionization models, such as that of\nKeldysh25 which is based on algebraically defined band\nstructure and has been used extensively in Monte Carlo\ntransport simulations,7,12 can be parametrized in terms of a\nsingle ionization threshold energy. A carrier in any state be-\nlow the threshold energy is unable to initiate ionization,\nwhile a carrier in any state above it is. In real band structure\nFIG. 4. Comparison of electron initiated rates in InGaAs, calculated using\nthe full expression for the matrix element, and using the CME approximation.\nIn ~a!, all transitions are included; in ~b!, those involving the G valley are\nexcluded.\nTABLE III. Fitting parameters for electron initiated rates calculated by in-\ncluding all possible transitions, and by excluding transitions in which one or\nboth final states lie in the G valley.\nG included G excluded\nA P E0 A P E0\nGaAs 3.131009 6.5 1.64 2.531010 4.8 2.14\nInGaAs 1.131008 7.0 0.17 3.631010 4.5 2.04\nSiGe 1.431010 4.4 0.87 1.431010 4.4 0.87\n8189J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\ncalculations, what is found instead is that the fraction of\nstates from which ionization can be initiated increases from 0\nto 1 over some finite energy range. The fraction f (Ei) of\nionizing states at Ei is given by\nf ~Ei!5\n* t~k!d@E~k!2Ei#d3k\n*d@E~k!2Ei#d3k\n, ~12!\nwhere t(k) is defined as a function which is 1 if impact\nionization can be initiated from state k and 0, otherwise. The\nrange over which 0, f (Ei),1 is found to vary between ma-\nterials and carrier types. A wider energy range corresponds\nto greater anisotropy, i.e., the threshold energy varies more\nwith direction in k space.\nThe impact ionization rate is found to be an explicit\nfunction of the k vector of the ionizing carrier, with carriers\nat the same energy but different k vectors generally having\nwidely varying rates. However, in a high field device carriers\nare likely to be spread throughout the Brillouin zone by pho-\nnon scattering,7,13 with different k states at the same energy\nhaving approximately equal probabilities of being filled. Un-\nder these conditions, the rate of ionization which is normally\nan explicit function of the k vector, R(k), can be character-\nized by a function of energy alone\nRav~Ei!5\n*R~k!d@E~k!2Ei#d3k\n*d@E~k!2Ei#d3k\n. ~13!\nThus Rav(Ei) is the average rate from all k states at energy\nEi . However, a fraction 12 f (Ei) of these states cannot ini-\ntiate impact ionization and hence these states lower the over-\nall average ionization rate at energy Ei . If only the states\nwhich can initiate ionization are included in the ionization\nrate average, then a new rate R ion is obtained such that\nRav~Ei!5 f ~Ei!3R ion~Ei!. ~14!\nSince f (Ei) is a function which generally increases as Ei\nincreases, it will have the effect of softening Rav(Ei) for a\ngiven R ion(Ei).\nSano et al.26 have investigated the behavior of f (Ei) in\nSi and GaAs, finding that in Si the threshold is highly aniso-\ntropic, i.e., the energy range over which f (Ei) rises from 0 to\n1 is large, while in GaAs it is relatively isotropic. In Si the\nrate shows soft threshold behavior while in GaAs it is hard.\nThis led Sano et al. to suggest that in each material R ion(Ei)\nis in fact hard, and the different behavior of the actual ion-\nization rate Rav(Ei) in each material is due mainly to varia-\ntion in f (Ei). They therefore propose a k vector dependent\nrate of the form\nR~k!5U@E2E0~k!# ~15!\nfor modeling impact ionization in Monte Carlo transport\nsimulations,8,9,11 where U(x) is the unit step function U(x)\n50 for x,0, U(x)51 for x>0 and E0(k) is a k-dependent\nthreshold energy.\nA similar analysis performed here for SiGe and GaAs\ndoes not strongly support the use of such a model. Figure 5\nplots f (Ei) calculated by Sano et al.26 for Si and GaAs and\ncalculated here for SiGe and GaAs. The plots for GaAs agree\nto within variations that are to be expected from differences\nin the band structure ~Sano et al. employ the local pseudo-\npotential method of Cohen and Bergstresser27!. Since the\nlines plotted for Si and SiGe are for different materials, they\nare not strictly comparable. However, these two materials\nhave similar band structures, both being indirect gap with the\nconduction band minimum near X , and each having either a\nvery shallow or no G valley. The large difference between\nthe behavior of f (Ei) in each case is therefore surprising.\nSano et al. have used the algorithm of Anderson and\nCrowell28 to obtain the thresholds, which is known10 to over-\nestimate the threshold anisotropy. The algorithm used here is\nthat of Beattie,29 as applied to real band structure,30 which\nhas not been shown to suffer from such inaccuracies. It\nseems unlikely that Beattie’s algorithm applied to Si would\nfind the thresholds so anisotropic, and we conclude therefore\nthat the results obtained here for the threshold anisotropy are\nto be preferred.\nFigure 6 compares Rav(Ei) and R ion(Ei) calculated for\nFIG. 5. Comparison of f (Ei) calculated by Sano et al. ~Ref. 26! for Si and\nGaAs ~open symbols!, and calculated here for SiGe and GaAs ~filled sym-\nbols!.\nFIG. 6. Comparison of Rav(Ei) and R ion(Ei) @calculated from Eqs. ~13! and\n~14!, respectively# for SiGe.\n8190 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nelectrons in SiGe. The energy range in which Rav is lower\nthan R ion corresponds to the energy range in which 0\n, f (Ei),1. The effect of variation in f (Ei) on the overall\nrate is not great. Table IV lists the parameters giving the best\nfit of Eq. ~8! to Rav and R ion for carriers in GaAs, InGaAs\nand SiGe. For the fit to R ion , A and P were adjusted while\nthe value of the threshold E0 was fixed to be equal to that\nfitted to Rav . From the values presented in the table it can be\nseen that when only those states able to initiate ionization are\nincluded, mean rates for both types of carriers show harder\nthreshold behavior, i.e., A increases and P decreases, as ex-\npected. However the changes in A and P are not particularly\ngreat ~in comparison to the differences in these values be-\ntween materials! confirming what can be seen in Fig. 6, i.e.,\nthat the effect of the anisotropy in the thresholds plays only\na small role in softening the rates. In the case of the electron\ninitiated rates it is interesting to note that the P parameter is\nthe same for each material. This may be coincidental as there\nis no such correspondence in the behavior of the volume of\nphase space or mean matrix elements for these materials, and\nnot too much significance should be read into this result. In\nany case, the softness of the threshold for R ion still varies\nconsiderably between materials in that the fitted A param-\neters vary ~with GaAs showing the hardest threshold behav-\nior, i.e., the highest A value!. Thus the effect of the anisot-\nropy of the thresholds is not found here to greatly influence\nthe softness of the threshold behavior of the rate in any of the\nmaterials, and the fact that the rates are soft, as opposed to\nthe very hard behavior implied by the step function of Eq.\n~15!, is due mainly to the dependence of the rate itself on\nimpacting carrier energy, rather than the dependence of the\nfraction of carriers at that energy which are above threshold.\nIt seems likely that Sano et al. have overestimated the an-\nisotropy of the thresholds due to the use of Anderson and\nCrowell’s threshold-finding algorithm.\nIV. CONCLUSIONS\nImpact ionization rates have been analyzed for the semi-\nconductors GaAs, In0.53Ga0.47As and Si0.5Ge0.5 . In each ma-\nterial the effectiveness of the CME approximation in calculat-\ning the rate was tested. In SiGe, it was found to be a good\napproximation, reproducing the rates calculated using the\nfull expression for the matrix element accurately at all ener-\ngies. In GaAs and InGaAs the approximation was found to\nfail, particularly in InGaAs, predicting softer rates than were\nobtained using the full expression. The cause of the different\nbehavior in the direct and indirect gap materials was found to\nbe the mean momentum transfer occurring in transitions. In\nthe indirect gap case, mean q transfer was found to be inde-\npendent of impacting carrier energy, leading to mean matrix\nelements that were also independent. In the direct gap mate-\nrials, mean q transfer was found to increase with increasing\nimpacting carrier energy, leading to a corresponding de-\ncrease in mean of the matrix elements and hence the failure\nof the CME approximation.\nThe role of the G valley in influencing the behavior of\nthe rate in the direct gap materials was examined and found\nto be greater than its small density of states would suggest.\nThis was due to enhancement of matrix elements corre-\nsponding to transitions involving the G valley due to the low\nq transfer involved. With final states in the G valley excluded\nfrom the rate calculation, the behavior of the rate in the direct\ngap materials was found to become similar to that in SiGe, in\nthat the CME approximation became accurate, and the degree\nof threshold softness was similar between the materials.\nFinally, the role of anisotropy of the thresholds in deter-\nmining the softness of the threshold behavior of the rate was\ninvestigated. While it was found that in all materials tested,\nthreshold anisotropy acted to soften the thresholds, the effect\nwas small, and the differing behavior of different materials is\ndue to variation in the rate of increase of availability of final\nstates as the impacting carrier energy increases above thresh-\nold. This is in contrast to the conclusions of Sano et al.26 that\nthresholds in GaAs and Si are basically hard, but that the\nhigh degree of anisotropy in Si acts to soften the effective\nthreshold.\nACKNOWLEDGMENTS\nThe authors would like to thank A. R. Beattie for several\nhelpful discussions. One of the authors ~D.H.! is grateful to\nthe EPSRC~U.K.! for funding this work.\n1 S. M. Sze, Semiconductor Devices, Physics and Technology ~Wiley, New\nYork, 1985!, Chap. 3.\n2 M. H. Somerville, J. A. del Alamo, and W. Hoke, IEEE Electron Device\nLett. 17, 473 ~1996!.\n3 H. Mizuno, M. Morifuji, K. Taniguchi and C. Hamaguchi, J. Appl. Phys.\n74, 1100 ~1993!.\n4 S. M. Sze, Physics of Semiconductor Devices, 2nd ed. ~Wiley, New York,\n1981!.\n5 G. E. Stillman and C. M. Wolf, Infrared Detectors II, Semiconductors and\nSemimetals, Vol. 12 ~Academic, New York, 1977!, Chap. 5.\n6 F. Capasso, Lightwave Communications Technology, Semiconductors and\nSemimetals, Vol. 22 ~Academic, New York, 1985!, Chap. 1.\n7 H. Shichijo and K. Hess, Phys. Rev. B 23, 4197 ~1981!.\n8 N. Sano, M. Tomizawa, and A. Yoshii, Appl. Phys. Lett. 56, 653 ~1990!.\n9 N. Sano, T. Aoki, M. Tomizawa, and A. Yoshii, Phys. Rev. B 41, 12122\n~1990!.\n10 J. Bude and K. Hess, J. Appl. Phys. 72, 3554 ~1992!.\n11 V. Chandramouli and C. M. Maziar, Solid-State Electron. 36, 285 ~1993!.\n12 J. Kolnı´k, Y. Wang, I. H. Og˘uzman, and K. F. Brennan, J. Appl. Phys. 76,\n3542 ~1994!.\n13 T. Kunikiyo, M. Takenaka, Y. Kamakura, M. Yamaji, H. Mizuno, M.\nMorifuji, and C. Hamaguchi, J. Appl. Phys. 75, 297 ~1994!.\n14 I. H. Og˘uzman, Y. Wang, J. Kolnı´k, and K. F. Brennan, J. Appl. Phys. 77,\n225 ~1995!.\n15 P. T. Landsberg, Recombination in Semiconductors ~Cambridge Univer-\nsity Press, Cambridge, 1991!.\n16 A. R. Beattie and P. T. Landsberg, Proc. R. Soc. London, Ser. A 249, 16\n~1959!.\nTABLE IV. Comparison of fits of Eq. ~8! to Rav(Ei) and R ion(Ei).\nFit to Rav(Ei) Fit to R ion(Ei)\nA P E0 A P\nGaAs 1.431011 5.2 1.89 2.031011 4.7\ne2 InGaAs 1.631010 5.6 0.75 4.231010 4.7\nSiGe 4.631010 4.9 0.84 6.131010 4.7\nGaAs 8.231010 5.1 1.43 9.031010 5.0\nh1 InGaAs 1.531011 4.2 0.73 1.631011 4.2\nSiGe 7.831010 4.7 1.23 1.131011 4.5\n8191J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\n17 J. R. Chelikowski and M. L. Cohen, Phys. Rev. B 14, 556 ~1976!.\n18 J. P. Walter and M. L. Cohen, Phys. Rev. B 5, 3101 ~1972!.\n19 D. Harrison, R. A. Abram, and S. Brand, J. Appl. Phys. 85, 8178 ~1999!,\npreceding paper.\n20 E. O. Kane, Phys. Rev. 159, 624 ~1967!.\n21 Y. Kamakura, H. Mizuno, M. Yamaji, M. Morifuji, K. Taniguchi, C.\nHamaguchi, T. Kunikiyo, and M. Takenaka, J. Appl. Phys. 75, 3500\n~1994!.\n22 T. Kunikiyo, M. Takenaka, M. Morifuji, K. Taniguchi, and C. Hamaguchi,\nJ. Appl. Phys. 79, 7718 ~1996!.\n23 N. Sano and A. Yoshii, J. Appl. Phys. 77, 2020 ~1995!.\n24 J. Allam, Jpn. J. Appl. Phys., Part 1 36, 1529 ~1997!.\n25 L. V. Keldysh, Sov. Phys. JETP 10, 509 ~1960!.\n26 N. Sano, T. Aoki, and A. Yoshii, Appl. Phys. Lett. 55, 1418 ~1989!.\n27 M. L. Cohen and T. K. Bergstresser, Phys. Rev. 141, 789 ~1966!.\n28 C. L. Anderson and C. R. Crowell, Phys. Rev. B 5, 2267 ~1972!.\n29 A. R. Beattie, Semicond. Sci. Technol. 7, 401 ~1992!.\n30 S. P. Wilson, S. Brand, A. R. Beattie, and R. A. Abram, Semicond. Sci.\nTechnol. 8, 1546 ~1993!.\n8192 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\n"}