{"doi":"10.1038\/nrneph.2009.165","coreId":"195352","oai":"oai:lra.le.ac.uk:2381\/7429","identifiers":["oai:lra.le.ac.uk:2381\/7429","10.1038\/nrneph.2009.165"],"title":"Glomerular disease: Sugars and immune complex formation in IgA nephropathy","authors":["Barratt, Jonathan","Eitner, Frank"],"enrichments":{"references":[{"id":44691287,"title":"Aberrant IgA1 glycosylation is inherited in familial and sporadic IgA nephropathy.","authors":[],"date":"2008","doi":"10.1681\/asn.2007091052","raw":"Gharavi, A. G. et al. Aberrant IgA1 glycosylation is inherited in familial and sporadic IgA nephropathy. J. Am. Soc. Nephrol. 19, 1008–1014 (2008).","cites":null},{"id":44691284,"title":"Aberrantly glycosylated IgA1 in IgA nephropathy patients is recognized by IgG antibodies with restricted heterogeneity.","authors":[],"date":"2009","doi":"10.1172\/jci38468","raw":"Suzuki, H. et al. Aberrantly glycosylated IgA1 in IgA nephropathy patients is recognized by IgG antibodies with restricted heterogeneity. J. Clin. Invest. 119, 1668–1677 (2009).","cites":null},{"id":44691283,"title":"IgA glycosylation and IgA immune complexes in the pathogenesis of IgA nephropathy.","authors":[],"date":"2008","doi":"10.1016\/j.semnephrol.2007.10.009","raw":"Novak. J., Julian, B. A., Tomana, M. & Mestecky, J. IgA glycosylation and IgA immune complexes in the pathogenesis of IgA nephropathy. Semin. Nephrol. 28, 78–87, (2008).","cites":null},{"id":44691290,"title":"IgA1-containing immune complexes in IgA nephropathy differentially affect proliferation of mesangial cells.","authors":[],"date":"2005","doi":"10.1111\/j.1523-1755.2005.67107.x","raw":"Novak, J. et al. IgA1-containing immune complexes in IgA nephropathy differentially affect proliferation of mesangial cells. Kidney Int. 67, 504–513 (2005).","cites":null},{"id":44691285,"title":"Implications of the near-planar solution structure of human myeloma dimeric IgA1 for mucosal immunity and IgA nephropathy.","authors":[],"date":"2008","doi":"10.4049\/jimmunol.180.2.1008","raw":"Bonner, A., Furtado, P. B., Almogren, A., Kerr, M. A. & Perkins, S. J. Implications of the near-planar solution structure of human myeloma dimeric IgA1 for mucosal immunity and IgA nephropathy. J. Immunol. 180, 1008– 1018 (2008).","cites":null},{"id":44691289,"title":"Increased dimeric IgA producing B cells in the bone marrow in IgA nephropathy determined by in situ hybridisation for J chain mRNA.","authors":[],"date":"1996","doi":"10.1136\/jcp.49.1.38","raw":"Harper, S. J., Allen, A. C., Pringle, J. H. & Feehally, J. Increased dimeric IgA producing B cells in the bone marrow in IgA nephropathy determined by in situ hybridisation for J chain mRNA. J. Clin. Pathol. 49, 38–42 (1996).","cites":null},{"id":44691286,"title":"Mesangial IgA1 in IgA nephropathy exhibits aberrant Oglycosylation: observations in three patients.","authors":[],"date":"2001","doi":"10.1046\/j.1523-1755.2001.060003969.x","raw":"Allen, A. C. et al. Mesangial IgA1 in IgA nephropathy exhibits aberrant Oglycosylation: observations in three patients. Kidney Int. 60, 969–973. (2001).","cites":null},{"id":44691288,"title":"O-glycosylation of serum IgA1 antibodies against mucosal and systemic antigens in IgA nephropathy.","authors":[],"date":"2006","doi":"10.1681\/asn.2006060658","raw":"Smith, A. C., Molyneux, K., Feehally, J. & Barratt, J. O-glycosylation of serum IgA1 antibodies against mucosal and systemic antigens in IgA nephropathy. J. Am. Soc. Nephrol. 17, 3520–3528 (2006). News & Views","cites":null},{"id":44691291,"title":"Patients with IgA nephropathy have increased serum galactose-deficient IgA1 levels.","authors":[],"date":"2007","doi":"10.1038\/sj.ki.5002185","raw":"Moldoveanu, Z. et al. Patients with IgA nephropathy have increased serum galactose-deficient IgA1 levels. Kidney Int. 71, 1148–1154 (2007).","cites":null}],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2009-11","abstract":"Mesangial deposition of IgA is the principal trigger for the development of glomerulonephritis in IgA nephropathy (IgAN). Recurrence of IgA deposition in the majority of recipients of renal allografts suggests that this IgA is derived from a circulating pool of pathogenic IgA molecules","downloadUrl":"http:\/\/www.nature.com\/nrneph\/journal\/v5\/n11\/full\/nrneph.2009.165.html.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7429\/3\/NRNeph_%5bBarratt_%26_Eitner%5d_v1_edited_BL_1251130455_98%5b1%5d%5b1%5d.pdf","pdfHashValue":"a3ec87382a9088400b0bc78bfdbe7429d555600d","publisher":"Nature Publishing Group","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7429<\/identifier><datestamp>\n                2015-12-18T15:30:54Z<\/datestamp><setSpec>\n                com_2381_6<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_9<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nGlomerular disease: Sugars and immune complex formation in IgA nephropathy<\/dc:title><dc:creator>\nBarratt, Jonathan<\/dc:creator><dc:creator>\nEitner, Frank<\/dc:creator><dc:description>\nMesangial deposition of IgA is the principal trigger for the development of glomerulonephritis in IgA nephropathy (IgAN). Recurrence of IgA deposition in the majority of recipients of renal allografts suggests that this IgA is derived from a circulating pool of pathogenic IgA molecules.<\/dc:description><dc:date>\n2010-01-25T16:48:03Z<\/dc:date><dc:date>\n2010-01-25T16:48:03Z<\/dc:date><dc:date>\n2009-11<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nNature Reviews Nephrology, 2009, 5 (11), pp. 612-614.<\/dc:identifier><dc:identifier>\n1759-5061<\/dc:identifier><dc:identifier>\nhttp:\/\/www.nature.com\/nrneph\/journal\/v5\/n11\/full\/nrneph.2009.165.html<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7429<\/dc:identifier><dc:identifier>\n10.1038\/nrneph.2009.165<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as Nature Reviews Nephrology, 2009, 5(11), pp. 612-614.  The final version is available from http:\/\/www.nature.com\/nrneph\/journal\/v5\/n11\/full\/nrneph.2009.165.html.  Doi: 10.1038\/nrneph.2009.165<\/dc:rights><dc:publisher>\nNature Publishing Group<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1759-5061","1759-5061"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"News & Views \n \nGlomerular disease \nSugars and immune complex formation in IgA \nnephropathy  \n \nJonathan Barratt and Frank Eitner \n \nIn vitro evidence suggests that immune complex formation in IgA nephropathy is \ndetermined by the sugar content of the IgA1 hinge region. The absence of \ngalactose residues at the IgA1 hinge seems to render the IgA molecule \nimmunogenic and results in the production of anti-IgA IgG autoantibodies. \n \nMesangial deposition of IgA is the principal trigger for the development of \nglomerulonephritis in IgA nephropathy (IgAN). Recurrence of IgA deposition in the \nmajority of recipients of renal allograft suggests that this IgA is derived from a \ncirculating pool of pathogenic IgA molecules. Serum levels of IgA do not correlate, \nhowever, with disease activity or severity, which gave rise to the belief that only a \nsmall percentage of serum IgA carries IgAN pathogenic potential.\n1\n Two of the \nprincipal factors thought to contribute to IgA pathogenic potential are the composition \nof O-linked sugars in the IgA1 hinge region and the variable propensity of IgA1 to \nform large immune complexes and.\n2\n Hitoshi Suzuki and colleagues present evidence \nthat the composition of IgA1 hinge region sugars directly influences immune complex \nformation by determining the immunogenicity of the IgA1 molecule and the \ngeneration of anti-IgA1 IgG autoantibodies.\n3\n  \n \nNews & Views \n \nIgA1 is one of the very few serum proteins to posses O-linked sugars. The fact that \nthese O-linked sugars are clustered within a relatively short segment of the IgA1 \nprotein backbone (the so-called hinge region) means they might have a considerable \neffect on IgA1 function.\n4\n Furthermore, the composition of O-glycans can vary widely \namong IgA1 molecules, which results in a variety of IgA1 O-glycoforms with \npotentially different biological characteristics. Suzuki et al.\n3\n have obtained in vitro \ndata showing that IgG produced by B cells isolated from patients with IgAN binds \npoorly galactosylated IgA1 and is capable of triggering the formation of IgA1-IgG \nimmune complexes. The researchers suggest that the anti-IgA1 IgG autoantibodies \nthey identified in the serum of patients with IgAN are the principal driver for IgA-\nimmune complex formation in IgAN.  \n \nAn increase in the proportion of serum IgA molecules that are poorly O-\ngalactosylated has been one of the most consistent findings in studies of IgAN over \nthe past decade.\n1,2\n Perhaps more importantly, mesangial IgA eluted directly from \nglomeruli comprises predominantly these poorly galactosylated IgA1 O-glycoforms, \nwhich strongly implicates the composition of glycans in IgA1 hinge region in the \nmechanism of mesangial IgA1 deposition.\n5\n Consistent with these observations, poorly \ngalactosylated IgA1 O-glycoforms are more likely to bind to mesangial matrix \nproteins and activate mesangial cells and complement than their heavily \ngalactosylated counterparts.\n2\n Evidence from Suzuki et al. suggests also that hinge \nregion O-glycans protect IgA1 from recognition by the immune system and that IgA1 \nO-glycoforms with low levels of galactose have increased immunogenic potential. \n \nNews & Views \n \nWhy patients with IgAN have excess amounts of poorly galactosylated IgA1 O-\nglycoforms in their serum remains unknown. A number of explanations have been put \nforward, including an enzymatic defect in IgA1 O-glycosylation that is at least in part \ninherited.\n6\n One alternative explanation is that poorly O-galactosylated IgA1 is in fact \n‘normal’ IgA that should have been secreted at mucosal surfaces but has mistakenly \nfound its way into the circulation. In fact, the pattern of O-glycosylation is different \nbetween mucosal and serum IgA1 in the same individual and IgA1 directed against \nmucosal pathogens is poorly O-galactosylated compared with IgA1 against systemic \nantigens.\n7\n These findings combined with reduced IgA1-secreting plasma cell numbers \nat mucosal sites and increased numbers in the bone marrow in patients with IgAN \nsuggests that in these patients there is a shift in IgA production from mucosal to \nsystemic sites.\n8\n The result of this shift is secretion into the circulation of high levels of \nmucosal-type (poorly galactosylated) IgA1 molecules with biological properties ill-\nsuited to the systemic circulation.    \n \nIrrespective of the reasons for the high circulating levels of poorly galactosylated \nIgA1 O-glycoforms, little data exist to explain why IgG autoantibodies should \ndevelop in IgAN. One intriguing possibility put forward by Suzuki and colleagues is \nthat anti-IgA1 IgG autoantibodies could in fact be antibodies specific for bacterial and \nviral surface glycoproteins and that recognition of poorly galactosylated IgA1 O-\nglycoforms by IgG is an unfortunate incident of ‘molecular mimicry’. Such a link \nbetween microbial infection and IgA immune complex formation might help explain \nthe association of mucosal infection with macroscopic hematuria in IgAN. During a \nnormal response to infection, serum levels of microbial-specific IgG rise, a proportion \nof this IgG will be specific for microbial cell surface sugars. In individuals with \nNews & Views \n \npersistently high serum levels of poorly galactosylated IgA1 O-glycoforms, a sudden \nrise in glycan-specific IgG might therefore precipitate IgA immune complex \nformation. A sudden increase in immune complex levels might then lead to rapid \nglomerular IgA deposition, mesangial cell and complement activation and glomerular \nhematuria. An increase in circulating IgA immune complex levels has been reported \nduring episodes of macroscopic hematuria.\n9\n \n \nWith the identification and characterization of anti-IgA1 IgG autoantibodies we have \na better appreciation of the interrelationship between IgA1 O-glycosylation and \nimmune complex formation in IgAN. However, to fully understand the implications \nof these data, the pathogenic importance of IgA1–IgG immune complexes in IgAN \nmust be clarified. The relative paucity of mesangial IgG staining in most biopsy series \nof IgAN does raise questions over the pathological role in vivo of such complexes. \nSuzuki et al. have already suggested that measurement of anti-IgA IgG autoantibodies \nmight in the future be the basis of a non-invasive diagnostic test for IgAN. They have \nalso published work supporting an ELISA-based method of measuring the proportion \nof serum IgA that is poorly galactosylated, and an assay combining both of these \nmeasurements could be a powerful diagnostic tool for IgAN.\n10\n However, studies need \nto confirm these findings in different patient cohorts and need to validate the \ndiagnostic specificities, sensitivities and predictive values of these assays. Finally, \nconvincing evidence that IgG-driven IgA immune complex formation has a \npathological role in vivo in IgAN needs to be presented.  \n \nDepartment of Infection, Immunity and Inflammation, University of Leicester, \nUK (J. Barratt) and Department of Nephrology and Clinical Immunology, \nRWTH University Hospital, Aachen, Germany (F. Eitner). \n \nNews & Views \n \nCorrespondence: J. Barratt, Johns Walls Renal Unit, Leicester General \nHospital, Leicester LE4 5PW, UK \njb81@le.ac.uk \n \ndoi:10.1038\/ \n \nCompeting interests \nThe authors declare no competing interests \n \n \n1. Barratt, J., Smith, A. C., Molyneux, K. & Feehally, J. Immunopathogenesis of \nIgAN. Semin. Immunopathol. 29,.427–443, (2007). \n2. Novak. J., Julian, B. A., Tomana, M. & Mestecky, J. IgA glycosylation and \nIgA immune complexes in the pathogenesis of IgA nephropathy. Semin. \nNephrol. 28, 78–87, (2008). \n3. Suzuki, H. et al. Aberrantly glycosylated IgA1 in IgA nephropathy patients is \nrecognized by IgG antibodies with restricted heterogeneity. J. Clin. Invest. \n119, 1668–1677 (2009). \n4. Bonner, A., Furtado, P. B., Almogren, A., Kerr, M. A. & Perkins, S. J. \nImplications of the near-planar solution structure of human myeloma dimeric \nIgA1 for mucosal immunity and IgA nephropathy. J. Immunol. 180, 1008–\n1018 (2008). \n5. Allen, A. C. et al. Mesangial IgA1 in IgA nephropathy exhibits aberrant O-\nglycosylation: observations in three patients. Kidney Int. 60, 969–973. (2001). \n6. Gharavi, A. G. et al. Aberrant IgA1 glycosylation is inherited in familial and \nsporadic IgA nephropathy. J. Am. Soc. Nephrol. 19, 1008–1014 (2008). \n7. Smith, A. C., Molyneux, K., Feehally, J. & Barratt, J. O-glycosylation of \nserum IgA1 antibodies against mucosal and systemic antigens in IgA \nnephropathy. J. Am. Soc. Nephrol. 17, 3520–3528 (2006). \nNews & Views \n \n8. Harper, S. J., Allen, A. C., Pringle, J. H. & Feehally, J. Increased dimeric IgA \nproducing B cells in the bone marrow in IgA nephropathy determined by in \nsitu hybridisation for J chain mRNA. J. Clin. Pathol. 49, 38–42 (1996). \n9. Novak, J. et al. IgA1-containing immune complexes in IgA nephropathy \ndifferentially affect proliferation of mesangial cells. Kidney Int. 67, 504–513 \n(2005). \n10. Moldoveanu, Z. et al. Patients with IgA nephropathy have increased serum \ngalactose-deficient IgA1 levels. Kidney Int. 71, 1148–1154 (2007). \n \n \n"}