{"doi":"10.1186\/1472-6963-8-5","coreId":"65551","oai":"oai:dro.dur.ac.uk.OAI2:5474","identifiers":["oai:dro.dur.ac.uk.OAI2:5474","10.1186\/1472-6963-8-5"],"title":"Professional centred shared decision making : patient decision aids in practice in primary care.\\ud","authors":["Burges Watson, D.","Thomson, R. G.","Murtagh, M. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01-01","abstract":"Patient decision aids are increasingly regarded as important components of clinical practice that enable shared decision making (SDM) and evidence based patient choice. Despite broad acceptance of their value, there remains little evidence of their successful implementation in primary care settings.\\ud\nMethods\\ud\nHealth care practitioners from five general practice surgeries in northern England participated in focus group sessions around the themes of patient decision aids, patient and practitioner preferences and SDM. Participants included general practitioners (n = 19), practice nurses (n = 5) and auxiliary staff (n = 3). Transcripts were analysed using a framework approach.\\ud\nResults\\ud\nWe report a) practitioners' discussion of the current impetus towards sharing decisions and their perspectives on barriers to SDM, and b) the implementation of patient decision aids in practice and impediments such as lack of an evidence base and time available in consultations.\\ud\nConclusion\\ud\nWe demonstrate two orientations to sharing decisions: practitioner-centred and patient-centred with the former predominating. We argue that it is necessary to rethink the changes required in practice for the implementation of SDM.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65551.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5474\/1\/5474.pdf","pdfHashValue":"b91281471f52a8cf5f9ca61415d428766d084919","publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5474<\/identifier><datestamp>\n      2011-11-03T12:27:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Professional centred shared decision making : patient decision aids in practice in primary care.\\ud\n<\/dc:title><dc:creator>\n        Burges Watson, D.<\/dc:creator><dc:creator>\n        Thomson, R. G.<\/dc:creator><dc:creator>\n        Murtagh, M. J.<\/dc:creator><dc:description>\n        Patient decision aids are increasingly regarded as important components of clinical practice that enable shared decision making (SDM) and evidence based patient choice. Despite broad acceptance of their value, there remains little evidence of their successful implementation in primary care settings.\\ud\nMethods\\ud\nHealth care practitioners from five general practice surgeries in northern England participated in focus group sessions around the themes of patient decision aids, patient and practitioner preferences and SDM. Participants included general practitioners (n = 19), practice nurses (n = 5) and auxiliary staff (n = 3). Transcripts were analysed using a framework approach.\\ud\nResults\\ud\nWe report a) practitioners' discussion of the current impetus towards sharing decisions and their perspectives on barriers to SDM, and b) the implementation of patient decision aids in practice and impediments such as lack of an evidence base and time available in consultations.\\ud\nConclusion\\ud\nWe demonstrate two orientations to sharing decisions: practitioner-centred and patient-centred with the former predominating. We argue that it is necessary to rethink the changes required in practice for the implementation of SDM.\\ud\n<\/dc:description><dc:publisher>\n        BioMed Central<\/dc:publisher><dc:source>\n        BMC health services research, 2008, Vol.8(5) [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5474<\/dc:identifier><dc:identifier>\n        issn:1472-6963<\/dc:identifier><dc:identifier>\n        doi:10.1186\/1472-6963-8-5<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5474\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1186\/1472-6963-8-5<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5474\/1\/5474.pdf<\/dc:identifier><dc:rights>\n        This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1472-6963","1472-6963"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" \n \n \nDurham Research Online \n \nDeposited in DRO: \n20 April 2009 \n \nVersion of attached file: \nPublished \n \nPeer-review status of attached file: \nPeer-reviewed \n \nCitation for published item: \nBurges Watson, D. and Thomson, R. G. and Murtagh, M. J. (2008) 'Professional centred \nshared decision making : patient decision aids in practice in primary care.', BMC health \nservices research., 8 (5). \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1186\/1472-6963-8-5 \n \nCopyright statement: \nThis is an Open Access article distributed under the terms of the Creative Commons \nAttribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted \nuse, distribution, and reproduction in any medium, provided the original work is properly \ncited. \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nBioMed CentralBMC Health Services Research\nssOpen AcceResearch article\nProfessional centred shared decision making: Patient decision aids \nin practice in primary care\nDuika Burges Watson*, Richard G Thomson and Madeleine J Murtagh\nAddress: Institute of Health and Society, Newcastle University, 21 Claremont Place, Newcastle upon Tyne NE2 4AA, UK\nEmail: Duika Burges Watson* - duika.burges-watson@ncl.ac.uk; Richard G Thomson - richard.thomson@ncl.ac.uk; \nMadeleine J Murtagh - m.j.murtagh@newcastle.ac.uk\n* Corresponding author    \nAbstract\nBackground: Patient decision aids are increasingly regarded as important components of clinical\npractice that enable shared decision making (SDM) and evidence based patient choice. Despite\nbroad acceptance of their value, there remains little evidence of their successful implementation in\nprimary care settings.\nMethods: Health care practitioners from five general practice surgeries in northern England\nparticipated in focus group sessions around the themes of patient decision aids, patient and\npractitioner preferences and SDM. Participants included general practitioners (n = 19), practice\nnurses (n = 5) and auxiliary staff (n = 3). Transcripts were analysed using a framework approach.\nResults: We report a) practitioners' discussion of the current impetus towards sharing decisions\nand their perspectives on barriers to SDM, and b) the implementation of patient decision aids in\npractice and impediments such as lack of an evidence base and time available in consultations.\nConclusion: We demonstrate two orientations to sharing decisions: practitioner-centred and\npatient-centred with the former predominating. We argue that it is necessary to rethink the\nchanges required in practice for the implementation of SDM.\nBackground\nEngaging patients in clinical decision making has become\na guiding ethical principle underpinning much contem-\nporary and routine clinical practice [1-5]. Development of\npatient decision aids has been proposed as one compo-\nnent of clinical practice to enable evidence-based patient\nchoice and shared decision making (SDM) [4]. Patient\ndecision aids are designed to assist in decision making\nabout healthcare by providing the best available evidence\nof the risks and benefits of particular therapeutic options\nin association with the elicitation and incorporation of\npatient values. When used in SDM it is anticipated that\npatients will be involved in the decision making process\nto the extent that they desire, and that decisions will be\nmade in a partnership between patient and practitioner\nthat acknowledges the rights and duties of all parties\ninvolved [6].\nDespite broad acceptance of the use of patient decision\naids in improving patient based outcomes and health, evi-\ndence for their successful implementation and use in\nextending SDM in routine practice remains scarce [7-10].\nSDM is commonly contrasted with the paternalistic\napproach to decision making which is characterised by the\nPublished: 11 January 2008\nBMC Health Services Research 2008, 8:5 doi:10.1186\/1472-6963-8-5\nReceived: 2 May 2007\nAccepted: 11 January 2008\nThis article is available from: http:\/\/www.biomedcentral.com\/1472-6963\/8\/5\n© 2008 Burges Watson et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Page 1 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5expression, 'doctor knows best'. The shift towards SDM\nmay then be seen to involve a philosophical reorientation\nthat considers patient\/practitioner relations differently,\nrequiring (or perhaps producing) a new 'way of viewing\nthe world' in which patients and practitioners share input\ninto treatment decisions, and where patient values are\ntaken into account [7]. Despite the wide-reaching implica-\ntions of SDM for decision making in healthcare, there is\nlittle background information that addresses how and if\npatient decision aids are effectively incorporated by prac-\ntitioners into their routine practice [8,11,12]. Others who\nhave examined the practice of SDM have considered gen-\neral practitioners[13], limiting their studies to practition-\ners who have an existing interest in and knowledge of\nSDM[10]. The current research project follows work\nwithin our research group developing and exploring\npatient and practitioner engagement and a computerised\npatient decision support tool for stroke prevention in\natrial fibrillation [14-17]. Our key study objective for this\nresearch was to explore health care practitioners' percep-\ntions and use of patient decision aids in routine clinical\npractice as a baseline study prior to an intervention\ninvolving the introduction of a suite of patient decision\naids including the atrial fibrillation tool.\nMethods\nFive general practice surgeries in northern England were\ninvited to participate in the study. The selection of prac-\ntices built on the recruitment in our earlier study. Within\neach of the participating practices information sheets were\ncirculated and participants invited to attend a presenta-\ntion. A one hour presentation was given by RGT to intro-\nduce the study, the concept of SDM and current\ndevelopments concerning patient decision aids. The pres-\nentation included a brief overview of different approaches\nto decision making and gave examples of different patient\ndecision aids and modes of implementation. It also intro-\nduced the work and resources of organisations involved in\nthe development and use of patient decision aids such as\nthe Ottawa Health Research Institute (OHRI) and Interna-\ntional Patient Decision Aids Standards Collaboration\n(IPDAS) [18]. Participants were asked to reflect on the\npresentation, to consider the potential for using patient\ndecision aids in their practice and to identify particular\nareas of clinical practice where a patient decision aid\nmight be of value. After a two week period for reflection\nparticipants who had attended the presentation were\ninvited to take part in focus groups to discuss further the\ntopic of SDM and patient decision aids. The study received\nethical approval from Sunderland LREC. All participants\n(Appendix 1) provided written consent to participate in\nthe audio-recorded focus group. Focus groups (FG1-FG5)\nwere conducted (by DBW) around the themes of SDM\nand patient decision aids in general practice, exploring\npotential for further development of SDM in the practice.\nA framework approach was used (by DBW and MJM) in\nthe analysis of transcripts [19]. The framework approach\nprovides a procedural structure for qualitative research\nthat enables a systematic approach to the data, whilst also\nallowing some flexibility in the interpretation. It has been\nidentified as a suitable method for analysing data where\nthe objectives of the research have been set in advance of\nthe analysis, for example where particular themes are\ndeduced as relevant to a research topic, or for policy-\nfocused research [20]. The main objective of the focus\ngroup was to consider issues of relevance to SDM and\npatient decision aids in routine settings from the perspec-\ntive of practitioners. A five stage process of analysis [19]\nwas adopted involving: familiarisation with the data\nthrough reading and rereading the transcripts for recur-\nrent themes; identification of a thematic framework based\non the objectives of the research (Additional File 1); a\nprocess of indexing in which transcripts were annotated\nwith codes derived from the thematic framework; summa-\nrising and synthesising this data into charts that use repre-\nsentative quotes to demonstrate themes (Tables 1, 2, 3, 4,\n5, 6, 7). Some themes overlap with others. The analysis\nand interpretation is recognised to be the least well\ndefined aspect of a framework approach. Taking a social\nconstructionist standpoint enabled us to more clearly\nidentify what was important to us in the transcripts: that\nis, the social construction of the objects of study (SDM\nand the use of decision aids in practice). During the ana-\nlytic phase DBW and MJM employed the concept of reflex-\nivity (cf. Griffin, 1995) which is described as a self-\nconscious awareness of the ways in which knowledge is\nproduced by social relations of power and social position;\nrace, class, gender amongst others. Moreover, we\nemployed a variety of tactics to address concerns about\nvalidity in the research involving presenting representa-\ntive quotes and undertaking a negative case analysis to\nlook for disconfirming cases. Analysis was designed to\ngenerate themes of importance to SDM in routine practice\nand to use these to inform the introduction of SDM tools\nin routine practice within a subsequent intervention\nstudy.\nResults\nSharing decisions\nDifferent practices adopted approaches variably consistent\nwith the principles of SDM. The transcripts from FG1\ndemonstrated the least familiarity with principles of SDM,\nand FG2 the most. In this section we demonstrate practi-\ntioner-centred (FG1 -Table 1) and patient-centred (FG2 -\nTable 2) approaches to sharing decisions. One GP in FG1\ndemonstrated a protective paternalistic approach to prac-\ntitioner\/patient relations in suggesting his role was to\n\"explain what I think is best\" to the patient and to hope\nthe patient would share the decision by agreeing \"that's\nfine.\" (Table 1:1). Discussing the topic of prescription ofPage 2 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5antibiotics for sore throat, the same GP argued that it was\nnot appropriate, and even undesirable, to share informa-\ntion for decision making with the patient about this topic\nbecause while there may be limited benefit for some indi-\nviduals, the adverse social consequences of using antibiot-\nics were too great (Table 1:2). Practitioners in FG1\nappeared concerned that patient decision aids might\nthreaten their current roles. Two GPs associated patient\ndecision aids with technological change and a declining\nrole for humans, invoking dystopian images of \"virtual\nGPs\" (Table 1:3). Moreover, participants in FG1 appeared\nto have difficulty distinguishing between information giv-\ning and SDM. Asked how SDM was enabled in the practice\none participant replied \"I do share with patients', infor-\nmation. And the main source of information is my brain\"\n(Table 1:4). Participants appeared reluctant to devolve\ndecision making arguing that patients may not under-\nstand, may act irrationally with information given or may\nnot act in the interests of public health (Table 1:5). The\nthree practice nurses present in FG1 contributed very little\nto the discussion and when directly asked for their opin-\nion on SDM by the researcher furnished short, single sen-\ntence answers. One, very recently employed, nurse\ndemonstrated a more patient centred approach by sug-\ngesting that SDM involved \"partnerships\" with patients\n(Table 1:6).\nIn contrast, FG2 appeared consistently to recognise and\nsupport a role for practitioners in facilitating patients'\ninvolvement in decision making (Table 2:1). In FG2 GPs\nstill dominated focus group responses, but also actively\nencouraged those present (including a practice and health\nvisitor) to participate in the discussion. Practitioners in\nFG2 were sympathetic and responsive to the importance\nof SDM in the consultation even though one GP described\npatient competencies negatively -suggesting that the basis\nof individual's decisions were \"probably...irrational\n(Table 2:2).\" Participants felt that their shared under-\nstanding and approach to SDM could be attributed in part\nto the adoption of a patient-centred culture in the practice,\nincluding regular involvement in training (Table 2:3).\nThey were able to refer to key literature\/authors on SDM\n(Table 2:4) and demonstrated they had applied the prin-\nciples in practice by recording shared decisions when they\noccurred (Table 2:5). In FG4 participants expressed sur-\nprise that SDM was considered as something new (Table\n2.6). When asked to reflect on SDM one GP suggested that\nmost people wish to engage at some level, and that some-\ntimes this engagement occurred outside the consultation\nas patients could (and sometimes did) reject what was\noffered as a treatment option (Table: 2.7). Despite recog-\nnising that decisions could be modified by patients\nbecause of the values they held, there was little mention\nof eliciting values as part of the consultation process itself,\nand not in any systematic way.\nEven those practices and participant practitioners sympa-\nthetic to SDM found the idea of sharing responsibility for\ndecision making difficult 'in practice' (Table 3:1). First,\nsome patients try to devolve responsibility for decisions to\npractitioners or expect them to take the decision (Table\n3:2). Second, practitioners recognised that SDM often\nTable 1: Representative quotes: practitioner centred practice (Focus Group 1)\n1:1 Well I explain what I think is best ... and with a bit of luck they'll say \"that's fine\" and do it. (GP1 – Male)\n1:2 There is one area where I don't particularly want decision aids or I don't want too much information [or] discussion, that's antibiotics because \nvery few patients consider the public health implications of resistance. (GP1 – Male)\n1:3 [If an interactive PDA introduced] you might lose doctors and clinicians altogether! Virtual GPs! (GP3 – Female)\n1:4 I do share with patients' information and the main source of information is my brain... Shall we do A or shall we do B? (GP2 – Male)\n1:5 Some patients are able to process the information that you give them very easily and other people might even be not able to read or the \ninformation that is given to them is very difficult to interpret. (GP2 – Male)\n1:6 [SDM means] partnership in your decision making and in the care between you and patient. (Nurse practitioner – Female)\nTable 2: Representative quotes: patient centred SDM practices (Focus groups 2 and 4)\n2:1 At one end you've got doctors making decisions not giving patients any information or choice and at the other end you've got consumerism, \nessentially you just give them the choice and the price and all the other bits and pieces and they choose and shared decision making is some sort of \nnegotiated pathway that involves both the doctors and the patients knowledge, opinions, experience. (GP2 – Male – FG2)\n2:2 Its about empowerment...definitely empowerment... decision making ultimately impacts upon them. (Health Visitor – Female – FG4)\n2:3 Information implies that decision making is relatively rationale where as of course most people make decisions probably on relatively irrational \nbasis so it's actually acknowledging that, understanding that. (GP1 – Male – FG2)\n2:4 We have communication skills regularly training with an outside trainer and its [SDM] one of the areas we've looked at. (GP2 – Female – FG2)\n2:5 I went to a presentation by Glyn Elwyn who has done a lot on shared decision making and he went through some of the more sophisticated \ncomputer based tools. (GP2 – Male – FG2)\n2:6 I've recorded it on the screen, you know. We came to a shared decision that it was appropriate not to have the medication. (GP2 – Female – \nFG2)\n2:7 It seems an odd idea that we weren't doing it before, like somehow it's a new thing that wasn't going on before. (GP2 – Female – FG4)\n2:8 ...you took the decision for them last time [but] they go away, they take a separate decision. (GP1 – Female – FG4)Page 3 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5involved areas of uncertainty where neither the practi-\ntioner nor patient had sufficient information upon which\nto base a decision (Table 3:3). Third, some patients were\nreported to be more indecisive than others (Table 3:4) and\npractitioners found their role difficult because it involved\nassessing patients' decision making desires and abilities.\nFourth, practitioners reported that it was difficult to\nremove themselves from the role of decision maker (Table\n3:5). One GP suggested it was hard not to \"push the deci-\nsion\", referring to the example of the older man who had\nshared a decision not to take preventive medication and\nwho had subsequently had a stroke. She suggested that \"a\nlittle bit of me thinks I should have been more forceful\"\n[in making him take the medication] (Table 3:6). In such\na situation the patient made a choice, but its legitimacy for\nthe practitioner came into question with the perception of\na 'wrong' outcome. Therefore, despite a recognition that\n\"this generation don't like telling people what to do\n(Table 3:7),\" there are powerful rhetorics at play in which\nresponsibility is still seen to ultimately rest with the prac-\ntitioner. While participants in FG2 considered it desirable\nto empower patients, \"real shared decision making\"\ninvolved a sometimes uncomfortable and difficult transi-\ntion in practitioner roles. The importance of this observa-\ntion is that some practitioners understood 'real' SDM as\ninvolving a fundamentally different power relationship\nbetween themselves and their patient, but one that chal-\nlenged the largely unwritten social, ethical and emotional\ncontract that has traditionally underscored patient\/practi-\ntioner relations (Table 3:5, 3:6, 3:7). Practitioners across\nall focus groups suggested patients also failed to enact\nshared roles in decision-making. One respondent in FG2\nsuggested SDM felt more like \"collusion\" (Table 3:9)- a\nsimulacrum of choice in which the role of the practitioner\nis to authorise the patient's decision through the rhetoric\nof SDM; and most often when it suited the practitioner: \"I\noften find it easier to be involved in real shared decision\nmaking where I don't feel strongly either way (Table 3:9).\"\nThus participants and practices varied in their awareness\nof the changed relationships inherent in the move\ntowards patient-centred SDM. Practitioners' roles and\nrelationships with patients were both institutionally\ndriven and individually mediated. Where practices dem-\nonstrated commitment to principles of SDM and patient-\ncentred practice, practitioners were more comfortable\nwith the use of SDM language and principles and were\nable to recognise that SDM involved the shift of power\nimplicit in the term. Despite facilitating SDM in practice,\nit was not clear that any practitioners in our focus groups\nfelt completely comfortable with SDM or absolved from\nadopting decision making responsibility for patients.\nRisk communication\nThe diversity of skills, methods and resources for sharing\ninformation with patients appeared to reflect individual as\nwell as practice based differences. In FG2 sharing informa-\ntion about risk was viewed by some practitioners as \"spu-\nrious\" (Table 4:1) and unhelpful, whilst for others risks\nwere useful \"to grapple with (Table 4:2).\" Participants in\nFG2 had also been involved in ongoing communication\nskills training. The expression of different opinions within\nthe focus group and inclusion of all participants in the dis-\ncussion demonstrated inclusiveness and openness to the\nTable 3: Representative quotes FG2: decision making complexities in patient-centred SDM\n3:1 It's difficult to achieve equality but real genuine shared decision making is trying to do it from a position of equal basis, not necessarily equal \nknowledge but equal weight from both sides into making the decision and I think it's a bit of a challenge but very important. (GP2 – Female)\n3:2 ...sometimes it is quite clear ... they want you to make the decision on their behalf... it's a very complicated part about decision making. (GP2 – \nFemale)\n3:3 You may be motivated to share the decision and either you don't have access to the information which would populate the decision boxes or \nthere is no information about relative risk, benefit and all the rest... [it's] shared guess work. (GP3 – Male)\n3:4 Its very tricky with indecisive people. (GP1 – Female)\n3:5 Its actually very difficult for us to move back from the role of being the person who's really got the agenda, knows what should, or we feel \nshould be done and not actually to sort of push the decision. (GP2 – Female)\n3:6 I just heard yesterday he's had a stroke...a little bit of me thinks I should have been more forceful...you know we came to a shared decision that \nit was appropriate not to have the medication. (GP2 – Female)\n3:7 I think our relationship has changed you know this generation we don't like to tell people what to do. (GP1 – Male)\n3:8 I think we do, can collude with patients quite a lot. (GP1 – Male)\n3:9 I often find it easier to be involved in real shared decision making where I don't feel strongly either way. (GP1 – Female)\nTable 4: Representative quotes: means of communication\n4:1 I very rarely get into detailed figures about risk and I think that to some extent they are, I mean part of that is philosophical, they are slightly \nspurious in the sense that they give this objectivity to it which just isn't there. (GP2 – Male – FG2)\n4:2 I much prefer to have a figure to grapple with. (GP3 – Male – FG2)\n4:3 We never discussed it [SDM] I don't think particularly. I would expect that everybody would be following the GMC guidelines: you know \ncommunication with patients. (GP1 – Male – FG1)\n4:4 I think the culture here has been around patient centredness, as you know, a theory and an ideal. (GP2 – Male – FG2)Page 4 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5views of others. In contrast, communication skills were\nnot emphasised in FG1 or FG4. Rather, expectations\nabout communication were based on common assump-\ntions that participants would adhere to guidelines (Table\n4:3). Different communication practices in the focus\ngroup may not reflect what happens in consultation.\nNonetheless it is an indicator of preference for particular\ncommunication styles and suggests differences in how\nskills in communication are viewed as either common\nsense or learned. Different practices had invested more or\nless time and resources in communication and in pursuit\nof the particular goal of SDM as a \"theory and an ideal\n(Table 4:4).\"\nUsing patient decision aids\nWhat was apparent across all focus groups was that prac-\ntitioners had limited experience of patient decision aids in\nhypothetical situations or in practice to draw upon to\ndescribe how patient decision aids might be incorporated\nsuccessfully. What was equally clear was that participants\nin those practices predisposed to a patient-centred\napproach and SDM were more likely to talk positively\nabout using patient decision aids even when acknowledg-\ning the difficulties. Participants from more practitioner-\ncentred practices were more likely to use the difficulties\nrhetorically to explain and justify their lack of use of\npatient decision aids and other SDM practices. When\nasked to reflect on the availability and use of patient deci-\nsion aids in their practice, none had routinely used them.\nIn FG3 two tools identified as patient decision aids used\n\"regularly\" were a risk\/benefit table for using HRT (Hor-\nmone Replacement Therapy) and a Framingham derived\ncomputerised risk assessment for cardiovascular risk (by\npractice nurses and GPs). In both situations practitioners\nrecognised that derivation of patient values were not\nincorporated in the use of the tools. Moreover, the presen-\ntation of risk was used to \"reinforce what you are saying\n(Table 5:1).\" What where considered patient decision\naids, in practitioner-centred approaches, were useful if\nthey produced decisions the practitioner was happy with\n(Table 5:2). The advantage of using a patient decision aid\nwas viewed in terms of surveillance of the patient's health\nbeyond the consultation. One GP suggested a blood pres-\nsure monitoring machine for home use \"really helps me\nto make a decision\" (Table 5:3) about whether or not to\nincrease medication.\nPatient decision aids in practice\nSome participants who had taken part in our earlier clini-\ncal trials of a computerised patient decision aid for atrial\nfibrillation [21-24] suggested the tools were \"useful\"\n(Table 6:1). In FG3 one participant suggested a Hormone\nReplacement Therapy decision tool had been particularly\nuseful for improving practitioner knowledge (rather than\nfacilitating SDM with the patient) (Table 6:2). Despite\nthis, there was a perception across the practices that\npatient decision aids were not designed with 'real life' con-\nsultation pressures in mind. As one participant suggested\nof a computerised patient decision aid, it had been\nunfathomable to imagine how it could be incorporated\ninto a 10 minute consultation (Table 6:3). Accessibility\nand lack of \"faff\" (fuss) appeared to be foremost in the\nminds of participants (Table 6:4). Nonetheless a number\nof difficulties in assessing how and when to use patient\ndecision aids were identified. People have different con-\nceptions of risk and risk communication may be confus-\ning for both patients and practitioners (Table 6:5). Some\npatients are viewed as more needy of decisions than oth-\ners and this neediness is difficult to assess (Table 6:6).\nSome patients may require different kinds of aids and sup-\nport (Table 6:7). In other words, practitioners found it dif-\nficult to envisage using patient decision aids given the\ncomplexity of decision making, constraints of the consul-\ntation(s), the \"faff,\" and the restrictions imposed by exter-\nnal priority setting (at both practice and policy levels). At\nthe same time there appeared to be different motivations\nunderlying the generally positive support and desire to\ndevelop SDM and use patient decision aids where possi-\nble. For one GP, patient decision aids were equated with\nsimplified systems for information giving such that an\n\"NHS bank of information and decision aids\" that would\nreduce the current deficiencies of information retrieval\nand hand-outs (Table 6:8). Other participant practitioners\nwere more reflexive of their desire to work towards \"real\nshared decision making\" and equality in the decision\nmaking process, but recognised they had limited skills or\nresources to do so (cf. Table 3:1). Whether in favour of\nusing patient decision aids or viewing them as too much\nof a \"faff,\" practitioners concerns predominantly centred\naround their own practice.\nTime\nTime was a identified as a key constraint identified across\nall practices and is recognised in other studies [10,13,25].\nOf all the potential barriers this best represents practi-\nTable 5: Representative quotes: practitioner-centred use of decision aids\n5:1 I use the coronary risk calculator and manipulated it by putting in a lower cholesterol value and showing people how their risk would come \nback... to reinforce what you are saying. (GP2 – Male – FG3)\n5:2 I think that when you're using a decision making aid I think you can only do it if you're completely happy with the decision the patient will make \nfrom that. (GP2 – Male – FG1)\n5:3 They come with a big list of all their blood pressures at different times and that really helps me to make a decision. (GP2 – Female – FG4)Page 5 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5tioner-centred thinking about PDAs and sharing decisions\nwith patients. Relations between practitioners and\npatients were considered to be constrained by the brevity\nof the consultation and pressures associated with practice\nbased targets. While it was observed that SDM may well\nhave long term benefits in health outcomes, participants\nin FG4 shared the view that \"selling\" SDM to their practice\nwould need to include some benefit that would, at the\nvery least, not increase time spent with patients. The per-\nception of SDM as time-consuming was used as a rhetori-\ncal device by a GP in FG1 to explain the lack of patient\ndecision aids in that practice (Table 7:1). Time was treated\nas a fixed constant of the patient\/practitioner interaction\nsuch that SDM could be cast, problematically, as an addi-\ntional element of the consultation (Table 7:2 &7:3). Yet time,\nhowever much a hindrance, was not necessarily viewed as\nan immutable barrier. While one GP suggested \"the big\nlimiting factor is time;\" he later observed that SDM might\nbe thought of as \"going on between consultations\" (Table\n7:4). The process of decision making was understood as\non-going and not necessarily a 'one off' event limited to a\none-off consultation: patient decision aids could have\nsome utility as between-consultation tools. Other practi-\ntioners suggested patient decision aids could help make\ndurable decisions that \"save time in the future\" (Table 7:3\n&7:5). Other participants reported that receptionists\ncould play a screening role identifying patients with par-\nticular health concerns, directing them to practitioners\n(including the practice nurse) with particular areas of clin-\nical expertise – thus reducing the possibility that two con-\nsultations would be necessary; but also potentially\ncreating a new space for SDM and patient decision aids\noutside the standard consultation.\nDiscussion\nOur developmental study has addressed practitioner per-\nspectives on SDM and patient decision aids in general\npractice settings in the UK through in depth analysis of\nfocus group interviews. Our findings suggest that at both\ninstitutional and individual levels practitioners had differ-\nent understandings and perceptions of their roles and\nrelations in respect to patients that ranged from an\nimplicit understanding and commitment to the principles\nof SDM that was patient-centred to a protective paternal-\nism that was more practitioner-centred. Although almost\none third of participants in focus groups were not GPs,\ndiscussions tended to be GP dominated or led. This there-\nfore shaped our selection of representative quotes.\nThe results presented here reflect the preparatory nature of\nthe study and our discussion and conclusions are limited\nby self-selected participation from within each practice. As\nwe did not direct how participants engaged within the\nfocus group, the representative quotes favour the views of\nthe most dominant participants. While this may be\nviewed as a limitation, it may also be seen to reflect the\norganisational context of the general practice surgeries in\nwhich shared practices concerning decision making tend\nTable 6: Representative quotes: decision aids needs\n6:1 We've actually got charts of smiley faces and I haven't used them, but when it was on IT [computer based] in the DARTS [Decision aids in \nRoutine Treatment Study] I did find it useful. (GP2 – Male – FG2)\n6:2 HRT risk errm, you know like how many people get breast cancer...that sort of thing and I use that regularly because it's quite easy to \nunderstand err, it helps me understand the figures! (GP2 – Female – FG3)\n6:3 [They] went through some of the more sophisticated computer based tools but [it] seemed unfathomable to get them into a 10 minute \nconsultation and actually he was in an internet site and using it in the consultation setting. (GP2 – Female – FG2)\n6:4 It needs the decision aids to be there, it needs them to be readily accessible without faff and it needs experiential training of us. (GP2 – Male – \nFG2)\n6:5 I get jumbled you know per 100,000 or 10,000 ...Your language is so subjective isn't it because it's how you interpret the risks. (GP2 – Female – \nFG2)\n6:6 Some patients are able to process the information that you give them very easily and other people might even be not able to read or the \ninformation that is given to them is very difficult to interpret. (GP2 – Male – FG1)\n6:7 [if it is a person] who can cope with the anxiety of not making a decision [in the consultation] it might be better to give him [sic] a decision \nmaking aid he could take away and work with. (GP2 – Female – FG2)\n6:8 An NHS bank of internet information and decision aids would be absolutely a good aid because the downside of leaflets on your desk is a) keep \nan eye on the fact and that there still in date and b) if you want to get a bit of information from leaflets on different topics you would have no desk \nspace left. (GP3 – Male – FG1)\nTable 7: Representative quotes: saving time\n7:1 You have to cut corners in everything and the amount of information you give and use of decision aids is one of the corners that you cut. (GP1 \n– Male – FG1)\n7:2 I think it can be more time consuming as well to have a consultation [employing SDM]. (GP1 – Male – FG3)\n7:3 I think probably long term it would save time but within your day to day practice you're very much working under a lot of pressure so it could \nbe difficult to try and fit things in. (GP2 – Female – FG4)\n7:4 Perhaps we should see SDM as a lot of that going on between consultations rather than during a consultation. (GP1 – Male – FG2)\n7:5 More time making the correct decision ... would save time in the future. (GP1 – Female – FG4)Page 6 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5to be GP initiated and led. Regardless of these limitations,\nthis study reveals important information on the present\nperspectives of general practice staff towards SDM and\ndecision aids and the findings are critical to understand-\ning how we might better address the challenges of sup-\nporting and implementing SDM in general practice, as\nwell as indicating further research needs.\nWe identify two broad orientations towards SDM: patient-\ncentred and practitioner-centred. In the first, practitioners\nrecognise a changed relationship between practitioners\nand patients in how decisions get made. Patients' values\nabout health are taken into consideration, and the\npatient\/practitioner relationship is understood differ-\nently. In the second, SDM exists along a continuum of\nmore and less paternalistic models: a philosophical reori-\nentation of patient\/practitioner roles is not evident in\neven the least paternalistic on this continuum. Rather,\ndecisions may be shared in relation to issues where there\nis either uncertainty about the risks and benefits of partic-\nular treatment options, or in particular relation to preven-\ntion focused interventions. For practitioners historically\ncharged with responsibility for a patient's welfare, the\nability to devolve power is more difficult than might be\nsuggested by the descriptions of SDM.\nRather than assuming that the traditional forms of evi-\ndence for patient decision aids and SDM are a sufficient\nbase upon which to introduce them, in this study we con-\nsidered a variety of health care practitioners' views about\nSDM and patient decision aids. In establishing a baseline\nof how practitioners themselves understand and see a role\nfor SDM and patient decision aids we are thus able to\nreflect on the different understandings of SDM, different\napproaches to it, and different needs across practices and\nindividuals. We propose that further research needs to\naddress our findings that: SDM involves more than a\nchange in practice and requires a new way of seeing the\nworld; some practitioners are more successful than others\nin recognising such a shift but still find practice difficult;\npractitioners' views about their own and patient roles in\ndecision making varied considerably across practices and\nindividuals; practitioners\/practices shared different\nunderstandings of where and when decision making gets\ndone; practitioners were not equally skilled or knowledge-\nable about SDM; information needs and SDM were con-\nflated; SDM terminology was sometimes used to describe\nrelations of care in which practitioners maintained a\nlargely traditional, paternalistic decision making role;\npatient decision aids were used as a means of surveillance\nof patients; SDM was sometimes perceived by practition-\ners as not 'real'; and practitioners had few examples on\nwhich to draw that demonstrate how patient decision aids\ncan work in practice.\nSeveral authors have recognised that SDM involves a phil-\nosophical reorientation away from earlier paternalistic\nmodels and new forms of thinking about patient-practi-\ntioner relations [7,26]. O'Flynn and Britten (2006) view\nsuch a reorientation in terms of the biomedical model,\nsuggesting that the ability of practitioners to share deci-\nsions and devolve power to patients is, in reality, circum-\nscribed because it is fundamentally in opposition to the\npractices through which they gain their professional iden-\ntity. From this perspective it is not surprising that there are\n\"low levels of SDM observed in practice\" [see also 8]\nbecause practitioners are 'socialised' to a particular way of\nviewing practitioner\/patient relations. O'Flynn and Brit-\nten (2006) surmise that practitioners need to do 'identity\nwork', a reflexive re-examination of their role, if they are\nto achieve the goals of 'real' SDM. Elwyn (2004) also\ndescribes a shift in practitioner\/patient relations. In his\nview however, the process of renegotiating patient\/practi-\ntioner roles is a challenge but is also inevitable, given the\ngrowing recognition of uncertainties associated with deci-\nsion making. In other words, for Elwyn (2004), new\nforms of patient\/practitioner engagement are produced as\nan effect of managing uncertainties. The focus group find-\nings we present here support the proposition that a transi-\ntion in patient\/practitioner relations is underway, but one\nthat is recognised and advanced by some practitioners\nmore than others. Reconfiguring health care practitioner\nroles in general suggests far broader changes in practice\nthan introducing SDM for particular clinical conditions\nwhere there is uncertainty around treatment options or for\nprevention-focused interventions. What is less apparent to\nus is how much support practitioners and patients have in\nrecognising and appreciating the difference between a\nnew form of practitioner\/patient relationship and the\nkinds of extended decision making roles that we have\nshown are sometimes described as SDM. Moreover, it is\nnot clear what support is required to facilitate a more gen-\neral shift towards patient-centred care.\nSeveral recent studies have sought to address the apparent\nlacuna in understanding health care practitioners views\non patient decision aids in clinical practice [9,12,13,27].\nFindings of these studies tend to be conceptualised\naround ideas of the 'barriers' and 'facilitators' to opera-\ntionalising SDM [13,25]. In these studies issues of time\nand lack of applicability for particular consultations are\nroutinely represented as roadblocks to the successful\nimplementation of SDM. Our approach differed in that\nwe included a broader spectrum of professional expertise\nin primary care, including those already skilled in SDM\nand those with little previous knowledge. Moreover, in\nour analysis we considered the patient\/practitioner inter-\naction as well as the social and organisational context of\ndecision making. We do not dispute the importance of\nothers observations in helping to explain many of the dif-Page 7 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5ficulties practitioners associate with introducing patient\ndecision aids into practice, or in helping develop solu-\ntions to some of the practical barriers and the identifica-\ntion of training needs of practitioners. However, the\nexpectation that SDM occurs only within the consultation\nsetting and between GPs and patients limits opportunities\nfor introducing SDM in practice based settings. Moreover,\nsuch accounts do not take into consideration variations\nbetween institutions and individuals in how SDM is expe-\nrienced or that the use of SDM terminology does not in\nitself guarantee that SDM is being adopted.\nConclusion\nRethinking the changes required in practice for the imple-\nmentation of SDM in primary care settings requires fur-\nther examination. Current recommendations largely do\nnot take account of the temporal, practical and other pres-\nsures in clinical practice. We support Elwyn's argument\nthat viewing the consultation as an 'episodic didactic\nencounter rather than a longitudinal complex relation-\nship' imposes limitations on how practitioners and\npatients can engage [7]. Across the focus groups different\nunderstandings of the consultation, and the role of SDM\nwithin that, produced different responses to the potential\nof SDM and patient decision aids. Where consultations\nwere viewed as one off events requiring a decision, the\npotential for patient decision aids was viewed as limited\nand their design as requiring a time-saving element.\nWhere the view of care was longer-term, involving more\nthan one consultation and\/or decision making as 'a\ndynamic process' in which patients were accorded a (new)\nrole in SDM(FG2-GP1F – Table 2), the realm of possible\nuses for patient decision aids was greatly expanded. There\nis here scope for a greater attention to the concept of 'dis-\ntributed decision making'; that is, understanding how\n'decisions are distributed across time, courses of actions,\npeople, situations and technologies' [24]. At the same\ntime, the limitations of practice based targets and particu-\nlar institutional organisations of referral that resulted in\ndifferent levels of opportunity for the introduction of\npatient decision aids across practices need to be acknowl-\nedged.\nPractice implications\nOur findings suggest that the implementation of patient\ndecision aids in clinical practice should involve a more\nexplicit recognition of the challenge of this approach and\nthe implicit reordering of power that it may involve, how-\never further research is required. First, evaluative frame-\nworks and modes of delivering SDM tools into practice\nmay need to address how different institutional settings\nand cultures modify the introduction of patient decision\naids. Second, patient decision aids could be incorporated\ninto routine practice beyond the confines of the consulta-\ntion. Third, health care practitioners may need more sup-\nportive frameworks to enable them to do 'real shared\ndecision making'; support that involves more than train-\ning in the methods of implementation and addresses the\nimplications for health care practitioners that make\ndevolving responsibility to patients immensely difficult.\nCompeting interests\nThe author(s) declare that they have no competing inter-\nests.\nAuthors' contributions\nRGT led the presentation to practitioners, DBW organised\nand conducted the focus groups and participated in the\ndata analysis sessions with MJM. All authors approved the\nfinal manuscript.\nAppendix 1\nFocus group participation\nFG1: GPs (3 male, 1 female); Nurse practitioners (3\nfemale)\nFG2: GPs (3 male, 2 female); Nurse practitioner (1\nfemale); Health visitor (2 female)\nFG3: GPs (3 female)\nFG4: GPs (2 male, 2 female); Nurse practitioner (1\nfemale); Health visitor (1 female)\nFG5: GPs (2 female, 1 male)\nAdditional material\nAcknowledgements\nThe authors would like to thank the health care practitioners who partici-\npated in the study for their generous insights, and for making this research \npossible. Thanks to Astrid McIntyre for transcribing the focus group audio-\nrecordings. We would also like to thank the reviewers for their construc-\ntive comments.\nI confirm all patient\/personal identifiers have been removed or disguised so \nthe patient\/person(s) described are not identifiable and cannot be identified \nthrough the details of the story.\nReferences\n1. Godolphin W: The role of risk communication in shared deci-\nsion making.  BMJ 2003, 327(7417):692-693.\nAdditional file 1\nA table of the thematic frameworks.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1472-\n6963-8-5-S1.doc]Page 8 of 9\n(page number not for citation purposes)\nBMC Health Services Research 2008, 8:5 http:\/\/www.biomedcentral.com\/1472-6963\/8\/5Publish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\n2. Protheroe J, Fahey T, Montgomery AA, Peters TJ, Smeeth L: The\nimpact of patients' preferences on the treatment of atrial\nfibrillation: observational study of patient based decision\nanalysis  Commentary: patients, preferences, and evidence.\nBMJ 2000, 320(7246):1380-1384.\n3. Say R, Thomson R: The importance of patient preferences in\ntreatment decisions--challenges for doctors.  BMJ 2003,\n327(7414):542-545.\n4. Elwyn G, Edwards A: Evidence based patient choice.  Oxford ,\nOxford university Press; 2001. \n5. Elwyn G, Edwards A, Britten N: 'Doing prescribing': how doctors\ncan be more effective.  BMJ 2003, 327(October):864-867.\n6. Elwyn G, Edwards A, Kinnersley P: Shared decision-making in\nprimary care: the neglected second half of the consultation.\nIn Br J Gen Pract Volume 49. Issue 443  Royal College of General Prac-\ntitioners; 1999:477-482. \n7. Elwyn G: Arriving at the postmodern medical consultation.\nEur J Gen Pract 2004, 10(3):93-97.\n8. Stevenson FA: General practitioners' views on shared decision\nmaking: a qualitative analysis.  Patient Educ Couns 2003,\n50(3):291-293.\n9. Edwards A, Elwyn G, Wood F, Atwell C, Prior L, Houston H: Shared\ndecision making and risk communication in practice: A qual-\nitative study of GPs' experiences.  Br J Gen Pract 2005,\n55(510):6-13.\n10. Edwards A, Elwyn G: Inside the black box of shared decision\nmaking: distinguishing between the process of involvement\nand who makes the decision.  Health Expect 2006, 9(4):307-320.\n11. Légaré F, O'Connor AM, Graham ID, Wells GA, Jacobsen MJ, Elmslie\nT, Drake ER: The effect of decision aids on the agreement\nbetween women’s and physicians’ decisional conflict about\nhormone replacement therapy.  Patient Educ Couns 2003,\n50(2):211-221.\n12. Graham ID, Logan J, O'Connor A, Weeks KE, Aaron S, Cranney A,\nDales R, Elmslie T, Hebert P, Jolly E: A qualitative study of physi-\ncians' perceptions of three decision aids.  Patient Educ Couns\n2003, 50(3):279-283.\n13. Légaré F, O'Connor AM, Graham ID, Saucier D, Côté L, Blais J, Cau-\nchon M, Paré L: Primary health care professionals' views on\nbarriers and facilitators to the implementation of the\nOttawa Decision Support Framework in practice.  Patient Educ\nCouns 2006, 63(3):380-390.\n14. Murtagh MJ, Thomson RG, May CR, Rapley T, Heaven BR, Graham\nRH, Kaner EF, Stobbart L, Eccles MP: Qualitative methods in a\nrandomised controlled trial: the role of an integrated quali-\ntative process evaluation in providing evidence to discon-\ntinue the intervention in one arm of a trial of a decision\nsupport tool.  Qual Saf Health Care 2007, 16(3):224-229.\n15. Burges Watson D, Murtagh MJ, Lally JE, Thomson RG, McPhail S:\nFlexible therapeutic landscapes of labour and the place of\npain relief.  Health & Place 2007, 13(4):865-876.\n16. Rapley T, May C, Heaven B, Murtagh M, Graham R, Kaner EFS, Thom-\nson R: Doctor-patient interaction in a randomised controlled\ntrial of decision-support tools.  Soc Sci Med 2006,\n62(9):2267-2278.\n17. Heaven B, Murtagh M, Rapley T, May C, Graham R, Kaner E, Thom-\nson R: Patients or research subjects? A qualitative study of\nparticipation in a randomised controlled trial of a complex\nintervention.  Patient Educ Couns 2006, 62(2):260-270.\n18. Elwyn G, O'Connor A, Stacey D, Volk R, Edwards A, Coulter A,\nThomson R, Barratt A, Barry M, Bernstein S, Butow P, Clarke A,\nEntwistle V, Feldman-Stewart D, Holmes-Rovner M, Llewellyn-Tho-\nmas H, Moumjid N, Mulley A, Ruland C, Sepucha K, Sykes A, Whelan\nT, The International Patient Decision Aids Standards (IPDAS) Collab-\noration: Developing a quality criteria framework for patient\ndecision aids: online international Delphi consensus process.\nBMJ 2006, 333(7565):417-424.\n19. Ritchie J, Spencer L: Qualitative data analysis for applied policy\nresearch.  In Analyzing qualitative data Edited by: Burgess RG, Bryman\nA. London; New York , Routledge; 1994:173-194. \n20. Pope C, Ziebland S, Mays N: Qualitative research in health care:\nAnalysing qualitative data.  BMJ 2000, 320(7227):114–116.\n21. Thomson R, Parkin D, Eccles M, Sudlow M, Robinson A: Decision\nanalysis and guidelines for anticoagulant therapy to prevent\nstroke in patients with atrial fibrillation.  Lancet 2000,\n355:956-962.\n22. Heaven B, Murtagh M, Rapley T, May C, Graham R, Kaner E, Thom-\nson R: Patients of research subjects? A qualitative study of\nparticipation in a randomised contolled trial of a complex\nintervention.  Patient Educ Couns 2006, 62(2):260-270.\n23. Murtagh M, Thomson R, May C, Rapley T, Heaven B, Graham R,\nKaner E, Stobbart L, Eccles M: Qualitative methods in a ran-\ndomised controlled  trial: the role of an integrated qualita-\ntive process evaluation in  providing evidence to discontinue\nthe intervention in one arm of a trial  of a decision support\ntool.  Qual Saf Health Care 16(3):224-229.\n24. Rapley T: From the autonomous patient to distributed deci-\nsion making: 2nd February; Lancaster University.  Sociol Health\nIlln 2008 [http:\/\/www.blackwell-synergy.com\/toc\/shil\/0\/0]. \n25. Gravel K, Legare F, Graham ID: Barrier and facilitators to imple-\nmenting shared decision-making in clinical practice: A sys-\ntematic review of health professionals' perceptions.\nImplement Sci 2006, 1(16):.\n26. O'Flynn N, Britten N: Does the achievement of medical iden-\ntity limit the ability of primary care practitioners to be\npatient-centred?:  A qualitative study.  Patient Educ Couns 2006,\n60(1):49-56.\n27. Edwards A, Elwyn G: Involving patients in decision making and\ncommunicating risk: a longitudinal evaluation of doctors'\nattitudes and confidence during a randomized trial.  J Eval Clin\nPract 2004, 10(3):431-437.\nPre-publication history\nThe pre-publication history for this paper can be accessed\nhere:\nhttp:\/\/www.biomedcentral.com\/1472-6963\/8\/5\/prepubPage 9 of 9\n(page number not for citation purposes)\n"}