{"doi":"10.1063\/1.1955516","coreId":"15342","oai":"oai:dro.dur.ac.uk.OAI2:7626","identifiers":["oai:dro.dur.ac.uk.OAI2:7626","10.1063\/1.1955516"],"title":"Ab initio dynamics study of poly-para-phenylene vinylene.","authors":["Zheng, Guang","Clark, S.J.","Tulip, P.R.","Brand, S.","Abram, R.A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-07-01","abstract":"We present an ab initio dynamics investigation within a density-functional perturbation theory framework of the properties of the conjugated polymer poly-para-phenylene vinylene (PPV) in both the isolated chain and crystalline states. The calculated results show that for an isolated chain, most of the vibrational modes correspond to experimentally observed modes in crystalline PPV. However, additional hitherto unidentified modes have been observed in experiment and our calculations on crystalline material have allowed us to assign these. We also present the results of calculations of the polarizability and permittivity tensors of the material, which are in reasonable agreement with the typical values for conjugated polymers. Dynamical Born effective charges [ S. Baroni, S. de Gironcoli, A. Dal Corso, and P. Giannozzi, Rev. Mod. Phys. 73, 515 (2001) ] are calculated and compared with atomic charges obtained from Mulliken population analysis [ M. D. Segall, C. J. Pickard, R. Shah, and M. C. Payne, Mol. Phys. 89, 571 (1996) ] and we conclude that effective charges are more appropriate for use in the study of the dynamics of the system. Notable differences are found in the infrared-absorption spectra obtained for the isolated chain and crystalline states, which can be attributed to the differences in the crystalline packing effects, which clearly play a key role in influencing the lattice dynamics of PPV.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15342.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7626\/1\/7626.pdf","pdfHashValue":"c4bbc30438f7042557984b46782b9369b9ab3faf","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7626<\/identifier><datestamp>\n      2010-12-07T14:12:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ab initio dynamics study of poly-para-phenylene vinylene.<\/dc:title><dc:creator>\n        Zheng, Guang <\/dc:creator><dc:creator>\n        Clark, S.J.<\/dc:creator><dc:creator>\n        Tulip, P.R.<\/dc:creator><dc:creator>\n        Brand, S.<\/dc:creator><dc:creator>\n        Abram, R.A.<\/dc:creator><dc:description>\n        We present an ab initio dynamics investigation within a density-functional perturbation theory framework of the properties of the conjugated polymer poly-para-phenylene vinylene (PPV) in both the isolated chain and crystalline states. The calculated results show that for an isolated chain, most of the vibrational modes correspond to experimentally observed modes in crystalline PPV. However, additional hitherto unidentified modes have been observed in experiment and our calculations on crystalline material have allowed us to assign these. We also present the results of calculations of the polarizability and permittivity tensors of the material, which are in reasonable agreement with the typical values for conjugated polymers. Dynamical Born effective charges [ S. Baroni, S. de Gironcoli, A. Dal Corso, and P. Giannozzi, Rev. Mod. Phys. 73, 515 (2001) ] are calculated and compared with atomic charges obtained from Mulliken population analysis [ M. D. Segall, C. J. Pickard, R. Shah, and M. C. Payne, Mol. Phys. 89, 571 (1996) ] and we conclude that effective charges are more appropriate for use in the study of the dynamics of the system. Notable differences are found in the infrared-absorption spectra obtained for the isolated chain and crystalline states, which can be attributed to the differences in the crystalline packing effects, which clearly play a key role in influencing the lattice dynamics of PPV.\\ud\n<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of chemical physics, 2005, Vol.123(2), pp.024904  [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7626<\/dc:identifier><dc:identifier>\n        issn:0021-9606<\/dc:identifier><dc:identifier>\n        issn: 1089-7690<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.1955516<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7626\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.1955516<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7626\/1\/7626.pdf<\/dc:identifier><dc:rights>\n        Copyright (2005) American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Zheng, Guang and Clark, S.J. and Tulip, P.R. and Brand, S. and Abram, R.A. (2005) 'Ab initio dynamics study of poly-para-phenylene vinylene.', Journal of chemical physics., 123 (2). 024904 and may be found at http:\/\/dx.doi.org\/10.1063\/1.1955516<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-9606"," 1089-7690","issn:0021-9606","issn: 1089-7690"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 December 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nZheng, Guang and Clark, S.J. and Tulip, P.R. and Brand, S. and Abram, R.A. (2005) ’Ab initio dynamics\nstudy of poly-para-phenylene vinylene.’, Journal of chemical physics., 123 (2). 024904 .\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.1955516\nPublisher’s copyright statement:\nCopyright (2005) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. The following article appeared in Zheng,\nGuang and Clark, S.J. and Tulip, P.R. and Brand, S. and Abram, R.A. (2005) ’Ab initio dynamics study of\npoly-para-phenylene vinylene.’, Journal of chemical physics., 123 (2). 024904 and may be found at\nhttp:\/\/dx.doi.org\/10.1063\/1.1955516\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nAb initio dynamics study of poly-para-phenylene vinylene\nGuang Zheng,a\u0002 S. J. Clark, P. R. Tulip, S. Brand, and R. A. Abram\nDepartment of Physics, University of Durham, DH1 3LE, United Kingdom\n\u0002Received 16 November 2004; accepted 24 May 2005; published online 21 July 2005\u0003\nWe present an ab initio dynamics investigation within a density-functional perturbation theory\nframework of the properties of the conjugated polymer poly-para-phenylene vinylene \u0002PPV\u0003 in both\nthe isolated chain and crystalline states. The calculated results show that for an isolated chain, most\nof the vibrational modes correspond to experimentally observed modes in crystalline PPV. However,\nadditional hitherto unidentified modes have been observed in experiment and our calculations on\ncrystalline material have allowed us to assign these. We also present the results of calculations of the\npolarizability and permittivity tensors of the material, which are in reasonable agreement with the\ntypical values for conjugated polymers. Dynamical Born effective charges \u0004S. Baroni, S. de\nGironcoli, A. Dal Corso, and P. Giannozzi, Rev. Mod. Phys. 73, 515 \u00022001\u0003\u0005 are calculated and\ncompared with atomic charges obtained from Mulliken population analysis \u0004M. D. Segall, C. J.\nPickard, R. Shah, and M. C. Payne, Mol. Phys. 89, 571 \u00021996\u0003\u0005 and we conclude that effective\ncharges are more appropriate for use in the study of the dynamics of the system. Notable differences\nare found in the infrared-absorption spectra obtained for the isolated chain and crystalline states,\nwhich can be attributed to the differences in the crystalline packing effects, which clearly play a key\nrole in influencing the lattice dynamics of PPV.\n© 2005 American Institute of Physics. \u0004DOI: 10.1063\/1.1955516\u0005\nI. INTRODUCTION\nA great deal of interest has been stimulated in conju-\ngated polymers in the last two decades due to their conduc-\ntive behavior after doping with electron donors or\nacceptors.1,2 Considerable attention has also been paid to\ntheir undoped state in which the materials demonstrate fas-\ncinating semiconducting properties with electronic band gaps\nranging from approximately 1 to several eV. As an example,\npoly-para-phenylene vinylene \u0002PPV, Fig. 1\u0003 is considered as\na typical material since it has a nondegenerate ground state\nwhich exhibits good stability and high conductivity after\ndoping. Moreover, it takes the form of quasi-one-\ndimensional molecules arranged in a three-dimensional crys-\ntal structure \u0002Fig. 2\u0003 and this arrangement is ideal for study-\ning the properties in different aggregate states. Furthermore,\nthe material is easy to process and there are quite a large\nnumber of possible substitutions which give the opportunity\nto tune the optoelectronic properties. Especially since the\ndiscovery of electroluminescence,3 considerable progress has\nbeen made in using the material in displays, light-emitting\ndiodes \u0002LEDs\u0003, and field-effect transistors \u0002FETs\u0003,4–6 but\nthere is still more to do to optimize the lifetime of devices.\nIt is well known that investigation of the dynamical\nproperties \u0002such as vibrational spectra, polarizability, and\nBorn effective charges\u0003 of conjugated polymers is one of the\nmost important tools for probing the structural and micro-\nscopic optoelectronic properties of the materials in various\nphases, and in both the pristine and doped states.7,8 The un-\nderstanding of the relevant properties requires a detailed\nknowledge of the dynamical properties. However, it is often\nthe case that information on the anisotropy of the dynamical\nproperties obtained by different methods has been quite\ninconsistent.9 Further, for a large system, the experimental\ndetermination of anisotropy is either extremely difficult or\nonly describes the conformational averages. This seriously\nlimits the understanding of the relationship between elec-\ntronic structure and material properties. Due to the fact that a\nrealistic theoretical description involves heavy computational\ncost, many calculations of the dynamical properties of poly-\nmers have been based either on simple models, such as an\nisolated, perfectly straight chain where the solid-state effects\nare not included, or only average axial static properties,\nwhile ignoring the anisotropy information. Nevertheless,\nsome recent progress has been made in understanding the\ndynamical properties for molecules or molecular crystals10–13\nand for conjugated polymers.14,15 However, uncertainties re-\nmain concerning the microscopic basis of chain-chain inter-\nactions in the crystalline state. For example, a recent study16\nof the vibrational properties of PPV shows that the calculated\nphonon modes of an isolated chain are in quite good agree-\nment with the experimental results for a polymer crystal,\nindicating that the isolated chain model in some circum-\nstances can be a good approximation. However, there are still\nsome experimental vibrational modes which have not been\nidentified in the one chain model, indicating as one would\nexpect that crystalline packing effects are also significant in\nsome cases. Very recently,17 a theoretical study of dielectric\nand vibrational properties was carried out, but only for some\nof the simpler amino acid molecules.\nIn this work we present an ab initio investigation of the\ndynamical properties of the conjugated polymer PPV. We\nfirst focus on the vibrational properties of an isolated PPVa\u0003Electronic mail: guang.zheng@durham.ac.uk and gzheng25@yahoo.com\nTHE JOURNAL OF CHEMICAL PHYSICS 123, 024904 \u00022005\u0003\n0021-9606\/2005\/123\u00032\u0002\/024904\/8\/$22.50 © 2005 American Institute of Physics123, 024904-1\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nchain. Then a crystalline state calculation is performed to\ninvestigate the unidentified phonon modes seen in experi-\nments on PPV samples. The paper is organized as follows:\nSec. II presents the theory and computational details, and\nthen in Sec. III we present the results and their discussion. A\nshort summary concludes the paper in Sec. IV.\nII. THEORY AND COMPUTATIONAL DETAILS\nAccording to perturbation theory, when an electric field\n\u0002 is applied, the change of the dipole moment d can be\nwritten as a power series,\ndi − d0i = \u0003ij\u0002 j + \u0004ijk\u0002 j\u0002k + ¯ , \u00021\u0003\nwhere i, j, and k run over the x ,y, and z axes of the system,\nd0 is the dipole moment at zero field, \u0003ij is the polarizability\ntensor, and \u0004ijk is the first-order hyperpolarizability.\nThe polarizability tensor \u0003ij may be defined as\n\u0003ij =\n\u00042E\n\u0004\u0002i \u0004 \u0002 j\n, \u00022\u0003\nwhere E is the total energy of the system. Thus the polariz-\nability tensor can be directly evaluated by finding the\nsecond-order derivatives of the total energy, which we obtain\nin this work by the use of linear response, or density-\nfunctional perturbation theory \u0002DFPT\u0003.18,19 In practice, we\nare only required to know the first-order changes in the\ncharge density and potential in order to evaluate the change\nin energy to the second order.\nWe also calculate the components of the polarizability\ntensor using the finite difference \u0002FD\u0003 method, where appro-\npriate. In this method, the change of dipole moment as a\nfunction of electric field is obtained and then the coefficients\n\u0003ij are derived from Eq. \u00021\u0003. However, since the computa-\ntional cost of the FD method is very considerable and it is\nnot possible to use the method for mixed perturbations, or\nthe response to electric field in crystalline systems, we em-\nploy only DFPT for the study of the vibrational properties\nand effective charges.\nDFPT is one of the most robust methods for the calcu-\nlation of lattice dynamics. It is possible to calculate a number\nof properties by considering different perturbations. For ex-\nample, a perturbation of the ionic positions can be used to\nobtain the dynamical matrix and information on the phonon\nmodes. The squares of the angular frequencies of the phonon\nmodes are the eigenvalues of the dynamical matrix which\ncan be obtained by using a linear-response determination of\nthe second-order change in the total energy induced by\natomic displacements,\nFRiRj =\n\u00042E\n\u0004Ri \u0004 Rj\n, \u00023\u0003\nwhere E is the vibrational potential energy, and Ri and Rj are\nthe ion coordinates.\nThe perturbation resulting from an applied electric field\nallows us to evaluate the dielectric response. The electronic\ndielectric permittivity tensor \u0005ij is the coefficient of propor-\ntionality between the macroscopic displacement field and the\nmacroscopic electric field, in the linear response regime,18\nFIG. 1. \u0002a\u0003 The repeat unit \u0002monomer\u0003 of an isolated PPV chain. The black\nand white circles denote carbon and hydrogen atoms, respectively. The ori-\nentation of the PPV with respect to the chosen frame of reference is shown.\n\u0002b\u0003 The numbering scheme for a unit cell of the PPV crystal. The filled and\nunfilled circles denote carbon and hydrogen atoms, respectively.\nFIG. 2. Herringbone crystal structure of PPV \u0002Ref. 26\u0003. Polarizabilities\nquoted are relative to the coordinate system shown in this figure. The mono-\nclinic unit cell has a=8.07 Å, b=6.05 Å, c=6.54 Å, and the angle \u0006=52°.\n\u0002a\u0003 Top view of the polymer; \u0002b\u0003 side view of PPV.\n024904-2 Zheng et al. J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n\u0005ij =\n\u0007Dmac,i\n\u0007\bmac,j\n= \u0007ij + 4\t\n\u0007Pmac,i\n\u0007\bmac,j\n, \u00024\u0003\nwhere Dmac is the displacement and Pmac the polarization. In\nthe limit of low frequencies of the applied field, the elec-\ntronic contribution to the dielectric permittivity tensor can be\nwritten as\n\u0005ij\n\n\n= \u0007ij +\n4\t\n\u000b0\n\u0003ij , \u00025\u0003\nwhere \u000b0 is the volume of the supercell and \u0003ij is the polar-\nizability tensor defined as in Eq. \u00022\u0003. The Born effective\ncharge tensor of the ith ion Zi,jk\n* is the partial derivative of the\nmacroscopic polarization with respect to a periodic displace-\nTABLE I. The calculated frequencies of the phonon modes \u0002in cm−1\u0003 of an isolated PPV chain \u00021D PPV\u0003 at the\n\f point obtained in this work. For comparison, other theoretical and experimental results are also listed in the\ntable. “ip” stands for in-plane vibrational modes and “op” indicates out of plane phonon modes. The four\nunidentified vibrational modes appear as \r1 ,\r2 ,\r3, and \r4 under the description heading.\nSymmetry Description This work Calc.a Calc.b Calc.c Expt.c Expt.b Expt.d\nBg op 121.7 147\nAu ip 220.9 220 328.1 311 327\nAg op 323.9 310\nBg op 324.6 327\nAu ip 406.2 390 431.2 425 428 429 430\nBu ip 432.6 430\nAu op 553.3 532 556\nAg ip 639.7 622 619.9 603 634\nAg ip 672.6 659 692.3 660 662\nBg op 720.9 696\nBg op 794.9 785\nBu ip 810.6 799 771.5 787 784 785 784\nAu op 841.2 818 838\nBg op 882.4 853\nAg ip 893.7 899 968.2 896 887 966 963\nAu op 957.2 911\nBg op 963.0 926\nAu op 968.2 930\nBu ip 1011.2 978 1012.6 1026 1013 1013 1014\nBu ip 1113.4 1076 1117 1107 1107\n\r1 1169.9 1178 1180\nAg ip 1151.3 1111 1174.3 1163 1170 1174 1172\nAg ip 1208.4 1185 1192 1197\nBu ip 1224.7 1187 1181 1179 1194\n\r2 1205 1210 1211 1211\nAg ip 1294.3 1262 1303.5 1295 1301 1304 1301\nBu ip 1296.9 1268 1269.3 1269 1271 1271 1271\nAg ip 1314.1 1274 1330.1 1330 1329 1327 1329\n\r3 1302 1302\nBu ip 1376.0 1367 1341.1 1333 1340 1339 1340\nBu ip 1442.2 1458 1416.7 1436 1424 1424 1424\nBu ip 1505.7 1485 1528.4 1516 1518 1518 1519\n\r4 1415\nAg ip 1523.7 1493 1549.6 1538 1546 1550 1547\nAg ip 1553.1 1546 1586.5 1587 1582 1586 1582\nAg ip 1637.4 1635 1629.2 1636 1625 1628 1626\nAg ip 3038.9 2951\nBu ip 3051.3 2975 3027.9\nAg ip 3074.1 3058\nBu ip 3078.3 3064 3065.9\nAg ip 3101.2 3116\nBu ip 3102.9 3125 3125.1\naReference 16.\nbReference 28.\ncReference 27.\ndReference 29.\n024904-3 Ab initio dynamics study of poly-para-phenylene vinylene J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nment of that ion at the limit of zero applied electric field, and\nin DFPT the tensor is equivalent to the linear relation be-\ntween the force upon an atom and the applied electric field,18\nZi,jk\n*\n=\u000b0\n\u0007Pmac,j\n\u0007\u000eik\n=\n\u0007Fik\n\u0007\b j\n, \u00026\u0003\nwhere \u000b0 is the volume of the supercell and \u000eik is the dis-\nplacement of the atom ion i in the direction k.\nThe Born effective charge is a very important quantity in\npolar semiconductors and insulators. The long-range behav-\nior of the Coulomb forces gives rise to macroscopic electric\nfields for longitudinal-optic \u0002LO\u0003 phonons at the \f point and\nthe coupling between longitudinal phonons and the electric\nfield give rise to LO-TO splitting at the \f point. This split-\nting is determined by the Born effective charge and by the\nstatic dielectric constant of the crystal.19\nAll calculations were performed with the plane-wave\npseudopotential implementation of density-functional theory\n\u0002DFT\u0003 using the CASTEP code.20,21 Plane-wave basis sets\nhave many benefits compared to conventionally used quan-\ntum chemistry basis sets; in particular, there exists a simple\nparameter, the cutoff energy, to determine the completeness\nof the basis. This gives us confidence that the wave function\ncan describe any properties without bias towards any other\nparticular result.13 In our calculations, the many-body ex-\nchange and correlation interactions are described using the\nlocal-density approximation \u0002LDA\u0003. Such calculations are\ncapable of giving accurate and reliable structural and elec-\ntronic information. Norm conserving Kleinman-Bylander22\npseudopotentials are used to describe the electron-ion inter-\nactions. A cutoff energy of 1000 eV is used which converged\nthe total energy of the system to 1.0 meV\/cell. The\nMonkhorst-Pack k-point sampling scheme23 was employed\nto perform the integrations in k space over the first Brillouin\nzone with the grids for each cell chosen to be dense enough\nto also converge the total energy to 1.0 meV\/cell. In this\nwork, a 1\u000f1\u000f8 mesh was used for an isolated PPV chain,\nand 30 k points are used for the crystalline state. The thresh-\nold value of the ionic forces is 0.05 eV\/Å3. The Kerker\ndensity-mixing scheme24 was used to achieve self-\nconsistency.\nThe use of a plane-wave basis set requires periodic\nboundary conditions in all three dimensions. To achieve this\nthe PPV chain was artificially repeated in the two dimensions\nnormal to the polymer axis with a sufficiently large unit cell\nto make neighboring interactions negligible. For an isolated\nPPV chain, the unit cell dimension is 15\u000f15\u000fd Å3, where\nd is the repeat distance along the polymer chain. In our cal-\nculations, the ground-state lattice constant d is found to be\n6.65 Å, and the torsion configuration of the polymer is\nplanar.25 For a detailed study of the geometrical properties,\nthe readers are referred to Ref. 25. In the solid state of PPV,\nwe calculate a herringbone crystal structure,26 with a\n=8.07 Å, b=6.05 Å, and c=6.54 Å, the monoclinic angle\nbetween b and c is 123°, the setting angle \u0006 is 52° \u0002Fig. 2\u0003,\nand the unit cell has P21\/a symmetry.\nTABLE II. The calculated and experimental wavelengths \u0002in cm−1\u0003 of the\nfour unidentified PPV phonon modes at the \f point.\nModes Expt. Expt. Theory This worka\n\r1 1178b 1176c 1169.9d 1170.6\n\r2 1211\nb 1210e,d 1205d 1207.9\n\r3 1302e 1302f 1297.3\n\r4 1415f 1408.9\naAb initio calculation for crystalline PPV in this work.\nbExperimental value from Ref. 28.\ncExperimental value from Ref. 31.\ndTheoretical data from effective conjugation coordinate \u0002ECC\u0003 in Ref. 28.\neExperimental value from Ref. 27.\nfExperimental value from Ref. 29.\nFIG. 3. Representation of the atomic displacements of PPV in a unit cell in\nthe crystalline state. At a particular time t, the vibration direction is shown\nby the arrows. Shown are the calculated phonon modes at \u0002a\u0003 1170.6 cm−1,\n\u0002b\u0003 1207.9 cm−1, \u0002c\u0003 1297.3 cm−1, and \u0002d\u0003 1408.9 cm−1.\n024904-4 Zheng et al. J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nIII. RESULTS AND DISCUSSION\nA. Vibrational properties\nThe vibrational properties of PPV have been previously\nstudied, both theoretically and experimentally, by a number\nof groups.16,27–29 In the present work we calculate vibrational\nnormal-mode frequencies and displacements by directly\nevaluating the matrix of force constants using DFPT. Table I\nshows our calculated vibrational frequencies at the \f point\nfor a PPV chain, along with previously published results. We\nadopt the symmetry labeling of Refs. 16 and 28 based on the\nC2h point group. Table I shows that the frequencies of the\nring C–C stretch modes are in the range of 1314.1–\n1553.1 cm−1, while the vinylene stretch frequency is at\n1637.4 cm−1, close to the experimental value.30 These results\nare in good agreement with other theoretical and experimen-\ntal data.16,28,29 The higher-frequency phonon modes \u0002from\n3038.9 to 3102.9 cm−1\u0003 are due to C–H stretch vibrations. It\nis found that most of the out-of-plane modes are softer than\nthe in-plane ones, since the former mainly involve bond-\nlength and bond-angle alternations.\nThe results of the isolated chain calculations are in very\ngood agreement with recent publications, and it is possible to\nassign most of the experimental vibrational frequencies.\nHowever, there are still four experimental modes denoted as\n\r1 ,\r2 ,\r3, and \r4 in Table I which are not assigned by the\nisolated chain model calculation.16 To see whether those\nmodes derive from the crystalline nature of the measured\nsamples, we have performed calculations for crystalline PPV\nand have found that the four experimental frequencies are\nsuccessfully reproduced in our calculation, as shown in Table\nII. The atomic displacements of PPV in a crystalline unit cell\nare illustrated in Fig. 3. The main feature of the vibrations is\nthat all of them involve neighboring chain-chain interactions.\nEspecially for some hydrogen atoms, direct hydrogen-\nhydrogen interactions seem to exist. A feature of the\n1170.6-cm−1 mode \u0004in Fig. 3\u0002a\u0003\u0005 is that all the atoms in the\ntwo neighboring chains vibrate in the same direction, and in\nthe central chain, all the atoms vibrate in the central plane. At\na particular time, the vibration direction of each individual\natom is shown in the corresponding figure. In the case of the\n1207.9-cm−1 mode \u0004Fig. 3\u0002b\u0003\u0005, the atoms in the central chain\nvibrate out of the central plane. The properties of the\n1297.3-cm−1 vibration are similar to that of the 1170.6-\ncm−1 mode; the atoms in the two neighboring chains movein\nthe same direction. In the central chain, there exist stretch\nvibrations with a larger amplitude between both phenyl and\nvinyl atoms. For the 1408.9-cm−1 mode, the stretching vibra-\ntions exist in the two chains in the unit cell. The correlated\nmotion of the modes seen only in crystalline material sug-\ngests that interchain interactions play a key role in determin-\ning their frequencies.\nB. Polarizability and permittivity\nWe have also carried out calculations of the polarizabil-\nity \u0003 and permittivity \u0005 tensors of PPV. Figure 1 shows the\ncoordinate system used to define the tensors relative to an\nisolated polymer chain. The z direction is shown in Fig. 1,\nand the x and y directions are, respectively, perpendicular\nand parallel to the plane of the phenyl ring. For the crystal-\nline state, the orientations of the polymer chains are shown in\nFig. 2. Two distinct methods have been employed for the\ncalculation of the polarizability of PPV: one is linear-\nresponse DFPT and the other is the FD-DFT approach,\nwhich has been shown13 to be capable of yielding values in\ngood agreement with experiment for molecules. The polariz-\nability and the permittivity tensor components calculated us-\ning DFPT are given in Table III. For comparison, we have\nalso calculated the FD-DFT polarizability for a styrene mol-\necule, which is realized by saturating the two dangling bonds\nwith hydrogen atoms in the PPV repeat unit shown in Fig. 1.\nThe calculated dipole moment as a function of applied field\nis shown in Fig. 4. An analysis of the individual components\nof the induced dipole moment as a function of electric field\ngives the relevant polarizability tensor components listed in\nTable III.\nAs the experimental determination of the full polariz-\nTABLE III. The calculated polarizabilities \u0003DFPT and \u0003FD \u0002in Å3\u0003 and permittivity \u0002\u0005\u0003 tensor components for a PPV isolated chain \u00021D PPV\u0003 and the\ncrystalline state. \u0005 is calculated using Eq. \u00025\u0003. \u0003avFD is calculated using the FD method for a styrene molecule, which is formed by saturating the two dangling\nbonds with hydrogen atoms in the PPV monomer shown in Fig. 1. \u0003av and \u0005av are Tr\u0002\u0003\u0003 \/3 and Tr\u0002\u0005\u0003 \/3, respectively.\n\u0003DFPT \u0003av\nDFPT \u0003FD \u0003av\nFD\n1D PPV 7.54 −0.05 0.09 Styrene 18.9 −1.72 0.02\n−0.05 14.49 −1.64 −1.72 34.1 −0.09\n0.09 −1.64 160.56 60.8 0.02 −0.09 45.3 32.8\nCrystal 37.65 −0.06 −3.39\n−0.06 31.94 0.005\n−3.39 0.005 110.81 60.1\n\u0005 \u0005av Polythiophenea \u0005 \u0005av\n1D PPV 1.14 −0.009 0.002\n−0.009 1.27 −0.031\n0.002 −0.031 4.03 2.15\nCrystal 2.76 −0.003 −0.159 PT crystala 2.6\n−0.003 2.49 0.00 3.3\n−0.159 0.00 6.19 3.8 10.8 5.6\naAb initio calculation for crystalline polythiophene \u0002PT\u0003 \u0002Ref. 33\u0003.\n024904-5 Ab initio dynamics study of poly-para-phenylene vinylene J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nability tensor information is rather difficult, it is instructive\nto compare the DFPT results with the corresponding finite\ndifference results of styrene. It is found that \u0003DFPT for the\npolymer is much more anisotropic than for styrene. The re-\nsults show that there is a major difference between relevant\nvalues in the polymer and styrene. For the molecular case,\nthe diagonal components of \u0003 are much less anisotropic than\nfor one-dimensional \u00021D\u0003 PPV. For an isolated PPV chain, as\ncan be seen in Table III, the major contribution to the aver-\nage of polarizability \u0003av\nDFPT\n=Tr\u0002\u0003DFPT\u0003 \/3 is the component\n\u0003zz in the z direction. Our value of \u0003av\nDFPT is reasonable when\ncompared with typical data for the axial polarizability for\nconjugated polymers.14,15 However, there is currently no\nother similar work on the anisotropy of polarizability which\nwe can use for comparison. It is apparent that \u0003zz\u0010\u0003yy and\n\u0003yy\u0006\u0003xx for both the isolated chain and crystalline states.\nAlthough the three principal components differ from those of\nan isolated chain, \u0003av\nDFPT is very similar for the crystalline\nstate.\nThe diagonal elements of the electronic permittivity of\nPPV also show quite strong anisotropy with \u0005zz\u0010\u0005yy and\n\u0005xx\u0007\u0005yy. The predicted value of the average of PPV permit-\ntivity \u0005av is in good agreement with the typical permittivity\nvalue of approximately 3.32 A similar permittivity anisotropy\ncan be found for crystalline polythiophene \u0002PT\u0003.33 In both\nPPV and PT, the permittivity principal component value \u0005zz\nis much larger than those in the other directions.\nThe linear response of the electronic charge density to\nthe applied electric field can be visualized by making a plot\nof the first-order perturbation of the charge density, which is\nthe linear \u0002i.e., first order\u0003 variation in the electronic charge\ndensity resulting from the perturbing potential. The simple\nway to regard it for an electric field is to consider how the\ncharge density would vary under application of the field, i.e.,\nwhere the electrons would flow from and where they would\nflow to. The first-order density obtained by the DFPT treat-\nment is plotted in Fig. 5 and it is found that the density\ncorresponding to the perturbations in the x axis are highly\npolarized. A more quantitative analysis of this response can\nbe gained by examination of the effective charges on the\nconstitute atoms.\nC. Born effective charge\nIn Table IV, the principal components of the Born effec-\ntive charge tensors for an isolated chain and crystalline states\nof PPV, together with atomic charges obtained by Mulliken\npopulation34 analyses, are presented. Note that we show the\ncharges for symmetry-related atoms in the table. In the cal-\nculations we do not enforce symmetry so as to investigate if\nany symmetries are broken \u0002we find that none are\u0003. The\nslight differences in charges on symmetry-related atoms in-\ndicate the computational accuracy of the data presented \u0002ap-\nproximately two decimal places\u0003. It is found that all the Mul-\nliken population atomic charges, except for certain carbon\natoms, possess roughly the same value for each atom type \u0002H\nor C\u0003 in both the isolated chain and the crystal. This suggests\nthat the electronic structure of each atom is similar regardless\nof the two different packing states. However, discrepancies\nexist between the Mulliken atomic charges and the average\nFIG. 4. The magnitude of the induced molecular dipole moment for styrene\nas a function of an external electronic field applied in the z direction. In the\ninset are the responses to the x and y components of dipole with respect to\nx and y fields, respectively. The individual components of the dipole mo-\nment are used to determine elements of the polarizability tensor.\nFIG. 5. The first-order electronic charge densities \u0002i.e., the first-order varia-\ntion in the charge densities resulting from the perturbing potential\u0003 for an\nisolated PPV chain. \u0002a\u0003, \u0002b\u0003, and \u0002c\u0003 correspond to perturbations in the x, y,\nand z directions, respectively. The dark represents positive charge displace-\nment, and light negative.\n024904-6 Zheng et al. J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ndynamical Born effective charges. For hydrogen atoms in the\ncrystal, there are marked differences between the average\nBorn effective charges and the atomic population charges.\nFor an isolated chain the discrepancies are even more\nmarked, with the effective charges being only about one-\ntenth of the Mulliken charges. For the carbon atoms, there\nare clear disagreements; there are different charge signs for\natoms C1, C4, C7, and C8 in the isolated chain and for C1, C4,\nC7, C8, C1\u0002, C4\u0002, C7\u0002, and C8\u0002 in the crystalline state. It is noted\nthat the alpha carbons C1 and C4 for an isolated PPV chain;\nC1, C4, C1\u0002, and C4\u0002 for PPV crystal\u0003 have almost no Zat\ncharge and quite some positive Zav\n* charges. The polar distri-\nbution of charges for alpha carbons may be responsible for\nthe differences of Zav\n* for the equivalent atoms C7 and C8 for\nthe 1D PPV. It would be gratifying to confirm this from\ndirect experiments.\nThe discrepancies between the effective charges and\npopulation atomic charges highlight their different origins.\nThe Mulliken population charges are based on the partition\nof the Kohn-Sham orbitals and provide information on the\nstatic electronic structures, whereas the Born effective\ncharges are based upon the dynamics of the system, and\nprovide information concerning dynamical properties. There-\nfore when a dynamical property is involved, effective\ncharges are normally more appropriate for use in the study of\nthe physics of the system.\nThe infrared \u0002IR\u0003 absorption coefficient can be expressed\nas\n17\nIm \u0011\b\n\u0003\n\t\b\n\u0012,\u0005\nZ\u0012,\u0003\u0005\n* em\u0002\u0012\u0005\u0003\t2, \u00027\u0003\nwhere m is the mode of vibration, Z\u0012,\u0003\u0005\n* is the effective\ncharge, and em is the phonon eigenvector. For complex sys-\ntems such as conjugated polymers, the IR spectrum can be\nhelpful and very useful in interpreting the vibrational prop-\nerties. The calculated IR spectrum of an isolated chain is\nplotted in Fig. 6, and for a crystal in Fig. 7. Due to there\nbeing two chains per unit cell there are more peaks in Fig. 7.\nThe peaks in the IR spectrum for crystalline state are shifted\nand broadened when compared with that of Fig. 6, especially\nin the region in which the four unidentified modes lie \u0002that is\nfrom 1170.6 to 1408.9 cm−1\u0003; there is a big relative increase\nfor the IR absorption in that region. These differences can be\nattributed to interchain interactions in the crystalline state. In\naddition, in the crystalline calculation there is an absorption\npeak at 2078.3 cm−1 which originated from asymmetric vi-\nbrations among the atoms shown in the inset of Fig. 7, which\nhas not been reported in experiments.\nIV. CONCLUSION\nWe have presented an ab initio dynamics investigation\nof the properties of the conjugated polymer poly-para-\nphenylene vinylene in both the isolated chain and crystalline\nstates. We have calculated the vibrational properties of PPV\nby directly evaluating the dynamical matrix of force con-\nstants using a DFPT determination of the second-order\nTABLE IV. The trace of the Born effective charge tensor Z\u0003\u0005\n* for both an isolated PPV chain \u00021D PPV\u0003 and the\ncrystalline state, together with the Mulliken atomic population charges. Zav\n* is the trace\/3 of the effective charge\nprincipal components. Zat is the atomic charge from Mulliken population analysis. All the values are in units\nof e.\n1D PPV Crystal\nAtom Zav\n* Zat Atom Zav\n* Zat Atom Zav\n* Zat\nH2 0.046 0.30 H2 0.131 0.28 H2\u0002 0.134 0.27\nH3 0.038 0.31 H3 0.100 0.27 H3\u0002 0.097 0.27\nH5 0.046 0.30 H5 0.157 0.26 H5\u0002 0.159 0.26\nH6 0.037 0.31 H6 0.084 0.26 H6\u0002 0.082 0.27\nH7 0.062 0.27 H7 0.084 0.27 H7\u0002 0.085 0.27\nH8 0.041 0.27 H8 0.067 0.26 H8\u0002 0.065 0.25\nC1 0.154 −0.02 C1 0.201 −0.03 C1\u0002 0.198 −0.03\nC2 −0.113 −0.29 C2 −0.155 −0.24 C2\u0002 −0.158 −0.24\nC3 −0.209 −0.29 C3 −0.145 −0.28 C3\u0002 −0.147 −0.28\nC4 0.188 −0.02 C4 0.173 −0.03 C4\u0002 0.176 −0.02\nC5 −0.113 −0.29 C5 −0.120 −0.22 C5\u0002 −0.122 −0.22\nC6 −0.193 −0.29 C6 −0.114 −0.27 C6\u0002 −0.117 −0.27\nC7 0.005 −0.28 C7 0.095 −0.25 C7\u0002 0.095 −0.26\nC8 0.043 −0.28 C8 0.034 −0.28 C8\u0002 0.033 −0.28\nFIG. 6. IR absorption spectrum for an isolated PPV polymer chain. The\nabsorption spectrum has been Gaussian broadened at T=300 K.\n024904-7 Ab initio dynamics study of poly-para-phenylene vinylene J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nchange in the total energy induced by atomic displacements.\nWe found that most of the vibrational frequencies in an iso-\nlated PPV chain can be associated with specific modes seen\nin experimental studies of crystalline PPV. The higher-\nfrequency phonon modes are due to the C–H stretch, while\nthe vinyl C–C stretch mode has a higher frequency than the\nphenyl ring C–C stretch modes. Calculations for the crystal-\nline state allow us to assign several previously unidentified\nexperimentally observed modes which are not seen in the\nisolated chain calculation. Information has also been ob-\ntained on the polarizability and permittivity tensors of the\nPPV. The results are in reasonable agreement with typical\nvalues of the axial polarizability and permittivity of conju-\ngated polymers. Analyses of the first-order electronic charge\ndensities give insight into the behavior of the electronic po-\nlarizability. Dynamical Born effective charges have been cal-\nculated and compared with the Mulliken population atomic\ncharges. Although there are differences, it is argued that ef-\nfective charges are more appropriate for use in the study of\nthe dynamics of the system. Notable differences are found in\nthe predicted IR absorption spectra obtained for an isolated\nchain and PPV in the crystalline state. The results demon-\nstrate that the chain-chain interactions in the crystal play a\nkey role in determining the dynamical properties.\nACKNOWLEDGMENTS\nFinancial support from EPSRC grant \u0002Contract No. GR\/\nR56716\/01\u0003 is gratefully acknowledged and we are also\ngrateful for the allocation of computing time on the HPCx\ncomputer at Daresbury Laboratories through the UKCP con-\nsortium. The use of the computational resources at the Uni-\nversity of Durham High Performance Computing Facility is\nalso acknowledged. One of the authors \u0002G.Z.\u0003 is grateful to\nA. P. Monkman for helpful discussions.\n1C. K. Chiang, M. A. Druy, S. C. Gau, A. J. Heeger, E. J. Louis, A. G.\nMacDiarmid, Y. W. Park, and H. Shirakawa, J. Am. Chem. Soc. 100,\n1013 \u00021978\u0003.\n2C. K. Chiang, C. R. Fincher, Y. W. Park, A. J. Heeger, H. Shirakawa, E.\nJ. Louis, S. C. Gau, and A. G. MacDiarmid, Phys. Rev. Lett. 39, 1098\n\u00021977\u0003.\n3 J. H. Burroughes, D. D. C. Bradley, A. R. Brown, R. N. Marks, K.\nMackay, R. H. Friend, P. L. Burns, and A. B. Holmes, Nature \u0002London\u0003\n347, 539 \u00021990\u0003.\n4G. H. Gelinck, T. C. T. Geuns, and D. M. de Leeuw, Appl. Phys. Lett.\n77, 1487 \u00022000\u0003.\n5C. J. Drury, C. M. J. Mutsaers, C. M. Hart, M. Matters, and D. M. de\nLeeuw, Appl. Phys. Lett. 73, 108 \u00021998\u0003.\n6F. Hide, M. A. Diaz-Garcia, B. J. Schwartz, M. R. Andersson, Q. Pei, and\nA. J. Heeger, Science 273, 1833 \u00021996\u0003.\n7S. Califano, Vibrational States \u0002Wiley, New York, 1976\u0003.\n8G. Zerbi, in Advances in Infrared and Raman Spectroscopy, edited by R.\nJ. H. Clark and R. E. Hester \u0002Wiley-Heyden, New York, 1984\u0003.\n9The Optics of Thermotropic Liquid Crystals, edited by S. Elston and R.\nSambles \u0002Taylor & Francis, London, 1998\u0003.\n10C. J. Adam, S. J. Clark, G. J. Ackland, and J. Crain, Phys. Rev. E 55,\n5641 \u00021997\u0003.\n11S. J. Clark, C. J. Adam, G. J. Ackland, J. White, and J. Crain, Liq. Cryst.\n22, 469 \u00021997\u0003.\n12S. J. Clark, C. J. Adam, D. J. Cleaver, G. J. Ackland, and J. Crain, Liq.\nCryst. 22, 477 \u00021997\u0003.\n13S. J. Clark, G. J. Ackland, and J. Grain, Europhys. Lett. 44, 578 \u00021998\u0003.\n14M. van Faassen, P. L. de Boeij, R. van Leeuwen, J. A. Berger, and J. G.\nSnijders, Phys. Rev. Lett. 88, 186401 \u00022002\u0003.\n15P. Mori-Sánchez, Q. Wu, and W. Yang, J. Chem. Phys. 119, 11001\n\u00022003\u0003.\n16R. B. Capaz and M. J. Caldas, Phys. Rev. B 67, 205205 \u00022003\u0003.\n17P. R. Tulip and S. J. Clark, J. Chem. Phys. 121, 5201 \u00022004\u0003.\n18X. Gonze, Phys. Rev. B 55, 10337 \u00021996\u0003; X. Gonze and C. Lee, Phys.\nRev. B 55, 10355 \u00021996\u0003.\n19S. Baroni, S. de Gironcoli, A. Dal Corso, and P. Giannozzi, Rev. Mod.\nPhys. 73, 515 \u00022001\u0003.\n20M. C. Payne, M. P. Teter, D. C. Allan, T. A. Arias, and J. D. Joannopo-\nulos, Rev. Mod. Phys. 64, 1045 \u00021992\u0003.\n21M. D. Segall, P. J. D. Lindan, M. J. Probert, C. J. Pickard, P. J. Hasnip, S.\nJ. Clark, and M. C. Payne, J. Phys.: Condens. Matter 14, 2717 \u00022002\u0003.\n22L. Kleinman and D. M. Bylander, Phys. Rev. Lett. 48, 1425 \u00021982\u0003.\n23H. J. Monkhorst and J. D. Pack, Phys. Rev. B 13, 5188 \u00021976\u0003.\n24Kerker mixing recognizes the fact that small-G components of the charge\ndensity should be mixed with smaller weighting in order to prevent\ncharge “sloshing” during SCF optimization.\n25G. Zheng, S. J. Clark, S. Brand, and R. A. Abram, J. Phys.: Condens.\nMatter 16, 8609 \u00022004\u0003.\n26D. Chen, M. J. Winokur, M. A. Masse, and F. E. Karasz, Phys. Rev. B\n41, 6759 \u00021990\u0003.\n27 J. Orion, J. P. Buisson, and S. Lefrant, Phys. Rev. B 57, 7050 \u00021998\u0003.\n28B. Tian, G. Zerbi, and K. Müllen, J. Chem. Phys. 95, 3198 \u00021991\u0003.\n29A. Sakamoto, Y. Furukawa, and M. Tatsumi, J. Phys. Chem. 96, 1490\n\u00021992\u0003.\n30S. J. Martin, D. D. C. Bradley, P. A. Lane, H. Mellor, and P. L. Burn,\nPhys. Rev. B 59, 15133 \u00021999\u0003.\n31D. D. C. Bradley, J. Phys. D 20, 1389 \u00021987\u0003.\n32 J. W. van der Horst, P. A. Robert, M. A. J. Michaels, and H. Bässler, J.\nChem. Phys. 114, 6950 \u00022001\u0003.\n33 J. W. van der Horst, P. A. Robert, P. H. L. de Jong, M. A. J. Michaels, G.\nBrocks, and P. J. Kelly, Phys. Rev. B 61, 15817 \u00022000\u0003.\n34M. D. Segall, C. J. Pickard, R. Shah, and M. C. Payne, Mol. Phys. 89,\n571 \u00021996\u0003; M. D. Segall, R. Shah, C. J. Pickard, and M. C. Payne, Phys.\nRev. B 54, 16317 \u00021996\u0003.\nFIG. 7. IR spectrum for crystalline PPV state. Gaussian broadening at T\n=300 K has been used on the absorption spectrum. The inset is a snapshot\nof the calculated 2078.3-cm−1 frequency mode which is due to asymmetric\nvibrations of the atoms shown.\n024904-8 Zheng et al. J. Chem. Phys. 123, 024904 \u00032005\u0002\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n"}