{"doi":"10.1364\/OE.17.020211","coreId":"69211","oai":"oai:eprints.lancs.ac.uk:27952","identifiers":["oai:eprints.lancs.ac.uk:27952","10.1364\/OE.17.020211"],"title":"The absolute sensitivity of digital colour cameras","authors":["Sigernes, Fred","Dyrland, Margit","Peters, Nial","Lorentzen, Dag Arne","Svenøe, Trond","Heia, Karsten","Chernouss, Sergey","Deehr, Charles Sterling","Kosch, Mike"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10-21","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69211.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27952\/1\/art_966.pdf","pdfHashValue":"98136647ece2b362be6eea4a66ae3bc54e1cfe5c","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27952<\/identifier><datestamp>\n      2018-01-24T02:51:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The absolute sensitivity of digital colour cameras<\/dc:title><dc:creator>\n        Sigernes, Fred<\/dc:creator><dc:creator>\n        Dyrland, Margit<\/dc:creator><dc:creator>\n        Peters, Nial<\/dc:creator><dc:creator>\n        Lorentzen, Dag Arne<\/dc:creator><dc:creator>\n        Svenøe, Trond<\/dc:creator><dc:creator>\n        Heia, Karsten<\/dc:creator><dc:creator>\n        Chernouss, Sergey<\/dc:creator><dc:creator>\n        Deehr, Charles Sterling<\/dc:creator><dc:creator>\n        Kosch, Mike<\/dc:creator><dc:date>\n        2009-10-21<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27952\/1\/art_966.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1364\/OE.17.020211<\/dc:relation><dc:identifier>\n        Sigernes, Fred and Dyrland, Margit and Peters, Nial and Lorentzen, Dag Arne and Svenøe, Trond and Heia, Karsten and Chernouss, Sergey and Deehr, Charles Sterling and Kosch, Mike (2009) The absolute sensitivity of digital colour cameras. Optics Express, 17 (22). pp. 20211-20220. ISSN 1094-4087<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27952\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1364\/OE.17.020211","http:\/\/eprints.lancs.ac.uk\/27952\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"The absolute sensitivity of digital colour cameras \nFred Sigernes 1,*, Margit Dyrland 1, Nial Peters 1, Dag Arne Lorentzen 1, Trond Svenøe 2, \nKarsten Heia 3, Sergey Chernouss 4, Charles Sterling Deehr 5 and Mike Kosch 6 \n1\n The University Centre in Svalbard (UNIS), N-9171 Longyearbyen, Norway \n2\n Energy Campus Nord, Hammerfest, Norway \n3The Norwegian Institute of Food, Fisheries and Aquaculture Research, Tromsø, Norway \n4\n Polar Geophysical Institute, Murmansk Region, Apatity, Russia \n5\n Geophysical Institute, University of Alaska, Fairbanks, USA \n6\n Communication Systems, Lancaster University, Lancaster LA1 4WA, UK \n* fred@unis.no \nAbstract: A new and improved method to obtain the average spectral pixel \nresponsivity and the quantum efficiency of Digital Single Lens Reflex \n(DSLR) cameras is outlined. Two semi-professional cameras, the Nikon \nD300 and the Canon 40D, are evaluated. The cameras red, green and blue \npixel responsivities and quantum efficiency are retrieved by illuminating an \nintegrating sphere with a wavelength tunable monochromator. 31 intensity \ncalibrated monochromatic spectral lines from 4000 to 7000 Å, with a \nbandpass of ~12 Å, were used as a library to solve the main equations of \nobservation for the cameras. Both cameras have peak sensitivity in the blue \nand minimum sensitivity in the red. The Canon 40D has blue and green \nchannel sensitivity close to the Nikon D300. The Canon red channel has \nhalf the sensitivity of the Nikon camera. \n©2009 Optical Society of America \nOCIS codes: (120.4800) Optical Standards and testing; (300.6550) Spectroscopy, visible; \n(150.1488) Calibration; (350.0350); Astronomical optics; (350.6090) Space optics. \nReferences and links \n1. F. Sigernes, J. M. Holmes, M. Dyrland, D. A. Lorentzen, T. Svenøe, K. Heia, T. Aso, S. Chernouss, and C. S. \nDeehr, “Sensitivity calibration of digital colour cameras for auroral imaging,” Opt. Express 16(20), 15623–15632 \n(2008). \n2. D. Baker, and G. Romick, “The Rayleigh: interpretation of the unit in terms of column emission rate or apparent \nradiance expressed in SI units,” Appl. Opt. 15(8), 1966–1968 (1976). \n3. F. Sigernes, J. M. Holmes, M. Dyrland, D. A. Lorentzen, S. Chernous, T. Svenøe, J. Moen, and C. S. Deehr, \n“Absolute calibration of optical devices with a small field of view,” J. Opt. Technol. 74, 669–674 (2007). \n4. R. Berry, and J. Burnell, “Measuring CCD performance” in Handbook of Astronomical Image Processing, \n(Willmann-Bell, Inc., 2006), pp. 227–248. \n1. Short background \nThe main motivation for this work is to develop a method to obtain the spectral responsivity \nor the quantum efficiency of each pixel in a Digital Single Lens Reflex (DSLR) camera. \nThese cameras have become valuable tools for studies of the night sky including phenomena \nsuch as aurora and airglow. It is therefore essential to establish a method to quantify the light \nthroughput of the cameras. Even though our focus is on the aurora, the results should be of \ninterest to other fields of science such as astronomy, remote sensing and industrial processing \nas well. \nThe method presented here is an improvement of work already published in this journal \n[1], where a low intensity light source tunable in wavelength was described using a \nLambertian screen as the target surface for the DSLR cameras. As promised, we have now \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20211\n Fig. 1. Experimental setup: (1) fiber bundle from lamp located in neighboring room, (2) mount \n\/ stand for integrating sphere, (3) order sorting filter wheel in front of entrance slit, (4) Jobin \nYvon HR320 monochromator, (5) table, (6) exit slit plane, (7) Edmund Scientific integrating \nsphere, (8) laboratory lift table, (9) fiber bundle holder, (10) camera table, (11) fiber bundle \nused as input to spectrograph, (12) Oriel FICS 7743 spectrograph, (13) optical mount rail, and \n(14) DSLR camera with normal 50 mm f\/1.4 objective. \nimproved the experimental setup by replacing the screen with an integrating sphere to obtain a \nmore uniform illumination source as a function of wavelength. It is now possible to calculate \nthe average pixel sensitivity instead of the total sensitivity of the cameras. \nResults from two semi-professional DSLR cameras, the Nikon D300 and the Canon 40D, \nare presented and evaluated. Both cameras were announced in August 2007 and cost \napproximately the same. Note that there is no negative or positive bias towards any \nmanufacturer of DSLR cameras; we simply choose what is available based on price and \navailability. \n2. The experimental setup \nFigures 1 and 2 show the updated experimental setup and the optical diagram of the system, \nrespectively. Each optical part is identical and described in detail in [1], except the integrating \nsphere that replaces the flat Lambertian surface. The main components are a fiber illuminator \n(Leica 150W) that is connected to the entrance slit of a monochromator (Jobin Yvon HR320). \nThe diffracted light at the exit slit of the monochromator is then fed into the integrating \nsphere. The output of the sphere is the target for both the DSLR cameras and the intensity \ncalibrated FICS spectrograph (Fixed Compact Spectrograph from Oriel SN 7743). \nThe sphere, from Edmund Optics, is designed to integrate radiant light fluxes. The sphere \nis 6 inches in diameter. Its interior walls are coated with Spectralon that has a diffuse \nreflectance factor of 0.98 throughout the visible part of the spectrum. The monochromatic \nlight that enters the 1 inch diameter input port of the sphere is scattered multiple times before \nit exits the 2.5 inch diameter output port. \nIn addition, a transmitting diffuser is used at the output port of the integrating sphere to \ndiffuse the light even more (see Fig. 2). The diffuser is 0.5 mm thick and made of Teflon \n(opal). This was found necessary due to the fact that the first region of illumination in the \nsphere, caused by reflected light directly from the exit slit of the monochromator, is easily \nseen from the output port. This illuminated region is rather large compared to the diameter of \nthe sphere. The effect was clearly seen even at relatively small off-axis view angles to the \noutput port. \nFinally, the net result is a uniform illuminated surface that is comparable to the \nLambertian surface that is used for calibrating narrow field of view instruments such as our \nspectrograph [3]. The field of view of the spectrograph is fully illuminated by an area that is \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20212\n Fig. 2. Optical diagram. [A] Leica 150W fiber illuminator: (1) mirror, (2) Tungsten filament, \n(3) heat filter, (4) blocking wall, and (5) fiber bundle. [B] Jobin Yvon HR320 Monochromator: \n(6) f-matching lens, (7) order sorting filter, (8) entrance slit, (9) collimator mirror, (10) plane \nreflective grating, (11) focusing mirror, (12) flat surface folding mirror, and (13) exit slit. [C] \nEdmund Scientific General purpose 6 inch diameter integrating sphere: (14) sphere, and (15) \ntransmitting diffuser (Teflon). [D] DSLR camera: (16) 50 mm normal f\/1.4 objective, and (17) \nCMOS \/ CCD detector. [E] Oriel FICS 7743 spectrograph: (18) order sorting filter, (19) fiber \nbundle, (20) entrance slit, (21) folding mirror, (22) concave grating, and (23) CCD detector. \nuniform in intensity, and equal to the corresponding area that fills the field of view of each \nselected pixel of the cameras. As long as the field of view of the pixels and the spectrograph \nare filled neither the look angle nor the distance to the diffuser matters. The changing sizes of \nthe pixel fields of view at the diffuser surface compensates exactly for both the changing \ndistances and angles. \nBoth the Nikon D300 and the Canon 40D cameras are operated in manual mode with \nsensitivity set at ISO 1600. The Nikon D300 uses a Nikon 50mm f\/1.4 AF-D lens, while the \nCanon 40D uses the Canon EF 50mm f\/1.4 USM lens. The lenses are operated at maximum \naperture (f-value set to 1.4). Exposure times between 3 and 4 seconds were chosen to avoid \noverexposures. \n3. The spectral pixel responsivity \nThe assembled wavelength tunable system is designed for the visible part of the spectrum \n(4000-7000 Å), producing monochromatic lines with a bandpass of ~12 Å. The calibrated \nFICS spectrograph measures the intensity of the integrating sphere output in units of R\/Å [2]. \nThe bandpass of the spectrograph is 100λ∆ ≈ Å. As result, the spectral responsivity for each \ncamera is calculated using all 31 spectra and images [1]. The equation of observations is \n \n( ) ( )\nˆ\nˆ ,\nk k\nu C S λ= ⋅ ⋅∆  [CTS \/ s]  (1) \nwhere the subscript [ ], ,k R G B∈  labels the Red, Green and Blue channels of the transparent \nColour Filter Mosaic filter (CFM) in front of each pixel of the sensor, respectively. The vector \n( )\nˆ\nku  contains 31 numbers of averaged pixel raw counts per second for each colour channel, k. \nThe matrix C is given as \n [ ]1 2 3 31 TC C C C C= ⋅⋅⋅ . [R\/Å]  (2) \nEach vector Ci, [ ]1...31i∈  contains the spectrum as measured by the FICS spectrograph. \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20213\n Fig. 3. Sphere source functions. Ci(λ) is the set of observations that consists of 31 spectra from \nthe monochromator (HR320) illuminating the 6 inch diameter integrating sphere from Edmund \nOptics. \nThe dimension of the spectra is reduced to 31 by re-sampling at each center wavelength \nsetting of the monochromator. The spectral responsivity ( )ˆ kS is now found by solving Eq. (1) \nby Singular Value Decomposition (SVD). \n4. The quantum efficiency \nAnother way to characterize the spectral sensitivity of a camera is to calculate the Quantum \nEfficiency (QE). It is defined as the fraction of photons that will generate electrons detectable \nby the photo-reactive sensors. In our case with monochromatic source functions in units of \nR\/Å, the QE may be expressed as \n \n( )\n( )\n6\n4 100\n10\nk\nk i\ni\ni\nu t gQE\nC A\nπ\nλ\n ⋅ ⋅∆ ⋅\n≈ × ⋅∆ ⋅∆ \n, [%]  (3) \nwhere A∆ is the pixel area in units of cm2, t∆ is the exposure time in seconds and g  is the \ngain of the detector defined as the conversion factor between the number of electrons and raw \ncounts per pixel. A simple procedure of how to measure the gain is given by [4]. At ISO 1600 \nthe gain is 0.775 and 0.675 electrons per 12-bit data count for the 40D and the D300, \nrespectively. \n5. Calibration results \nOur new library of calibrated spectra is shown in Fig. 3. The intensity of the output port of the \nintegrating sphere rises from ~500 R\/Å at 4000 Å to a maximum of ~3300 R\/Å at 5800 Å, \nreducing to ~1500 R\/Å at 7000 Å. The dips at 4600 Å and 6700 Å are due to drops in the \ngrating efficiency of the monochromator. Note that the intensity is equal in shape and twice as \nbright as the Lambertian screen setup described in [1]. This is expected, since we apply the \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20214\nsame monochromator as the input source and the sphere is more effective than the screen to \nintegrate the incoming radiation. \n \nFig. 4. Raw counts from the Nikon D300. Exposure time is 3 seconds at ISO 1600 with a 50 \nmm normal objective fixed at f\/1.4. The shaded surface represents the green channel 12-bits \nraw counts per second. The source is a monochromatic illuminated sphere at center wavelength \n5569 Å. The center y-axis slice of the surface is shown together with the calculated height of \nthe plateau (solid horizontal line) and the 2σ standard deviation (dotted lines). \nFigure 4 shows the Nikon D300 green channel raw counts per second when the sphere is \nilluminated with light at 5569 Å center wavelength. Note that dark frame subtraction is carried \nout to reduce the background level. The resulting image is shaped like a steep mountain cliff \nwith a sharp leveled circular plateau. The height of the plateau is used as the average pixel \nraw count response. The plateau height is calculated by selecting raw count values within a \n200x200 pixel square area in the center of the image. Using the notation in Section 3, the \nplateau height is ( ) 964Gu = CTS\/s. The corresponding standard deviation is 2 30σ = ±  CTS\/s, \nwhich in percentage terms is close to 3% variation across the plateau. The 2σ deviation is \ncompatible with Poisson statistics where noise is defined as the square root of the counts. The \ncalculated values are visualized in Fig. 4 by plotting the center y-axis slice of the mountain \ncliff. The result looks like a square pulse with ripple noise on the top that is within the \ncalculated deviation. The output of the sphere is, in other words, sufficiently uniform to \nassume that the above 200x200 pixel average is the same for all pixels. \nThe next step is to repeat the procedure to obtain the average raw counts per second as a \nfunction of wavelength for each color channel of the cameras. The first thing we noticed when \nhandling the raw data from the Canon 40D is that the counts are fixed at 14-bits resolution. \nThe range is, in other words, from 0 to 16383 counts. The Nikon D300 has a 12-bit range (0 – \n4095 counts). As a consequence, the 40D counts are scaled down by a factor of (1\/4) in order \nto be comparable to the D300. The D300 was first operated at 3 seconds exposures with no \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20215\noverexposures occurring as we changed the wavelength of the monochromator. At 4 seconds \nthe green channel became overexposed. On the other hand, the Canon 40D did not overexpose \n \nFig. 5. Camera raw data. Solid lines are the raw counts per second from the Nikon D300 \ncamera for each color channel (Red, Green and Blue). The dotted lines are the corresponding \ndata from the Canon 40D camera. Each curve is labeled with exposure time settings of the \ncameras. Both cameras were operated with identical settings using normal objective lenses \n(50mm f\/1.4) at ISO 1600. The error bars represent the 2σ standard deviation of the count rates. \nat 4 seconds exposure time. It also turned out that we could not set the exposure time of the \n40D to 3 seconds. Only 2.5, 3.2 and 4 second intervals were possible. The procedure was \ntherefore repeated to make sure that we obtain the same counts per second for all intervals. \nFigure 5 shows the resulting raw counts per second obtained with variable exposure \nintervals for both cameras. It is hard to see any difference between the curves as a function of \nexposure time for each camera alone, especially for the 40D. The only difference appears \nwhen the D300 green channel is overexposed at 4 seconds. The effect is seen comparing the 3 \nand 4 second exposures. The peak of the 4 second exposure looks like it has been cut off \ncompared to the 3 second one in the 5200 to 5500 Å wavelength region. Also notice that the \nerror bars become zero in this region. This is expected since the error bars are defined as the \n2σ standard deviation of the count rates. The D300 blue and red channel count rates are \nalmost identical, with deviations that are well within the error bars. It is therefore reasonable \nto assume that the raw count rates are constant as a function of exposure time in the interval \n~(3-4) seconds for both cameras. \nThe count rate profiles of the cameras shown in Fig. 5 are quite similar in shape, \nespecially the blue and red channels. However, the 40D green channel profile is slightly more \nsymmetric than the corresponding D300 profile. This is due to the fact that the 40D green \ncounts are little bit higher than the D300 green counts in the 4800 to 5100 Å wavelength \nregion. The same is seen in the 5400 to 5800 Å wavelength region when comparing the red \nchannels. \nBoth cameras have peak count rates in the green channels. However, the D40 has a higher \nblue than red peak count rate, while this is vice versa for the D300. What this means, in terms \nof difference in color balance between the cameras, depends on the spectral responsivity or \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20216\nthe quantum efficiency. The raw count rate profiles alone are not sufficient in order to \nconclude on this issue. \n \nFig. 6. Processed camera data. Panel (A): Solid lines are the spectral responsivity of the Nikon \nD300 camera for each color channel (Red, Green and Blue). The dotted lines are for the Canon \n40D camera. Panel (B) shows the corresponding calculated quantum efficiency. Both cameras \nwere operated with identical settings using normal objective lenses (50mm f\/1.4) at ISO 1600. \nIf we define the width of the profile for each color channel to be the wavelength region \nwhere it has equal to, or greater than, half of its maximum count rate, then it is clear that the \nD40 has wider profiles than the D300 for all color channels. The D40 profile is ~250 Å wider \nthan the D300 in the green channel. The corresponding blue and red differences in widths are \n70 and 160 Å, respectively. \nThe main difference between the cameras becomes evident in the level of the count rates. \nThe Nikon D300 count rates are generally higher when compared to the Canon 40D, except \nfor the wavelength regions mentioned above. By integration we find that the D300’s blue, \ngreen and red channels have ~16, 8 and 50% higher count rates compared to the D40, \nrespectively \nThe spectral responsivity and the quantum efficiency may now be solved according to \nEqs. (1) and (3), respectively. Based on the above findings, the 3 second exposure by the \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20217\nD300 and the 4 second exposure by the 40D camera are chosen to represent the raw count \nrates in the calculations. The net result is shown in Fig. 6 for both cameras. \n \nFig. 7. Normal objective spectral lens transmissions for the Nikon 50mm f\/1.4 AF-D (red solid \nline) and the Canon EF 50mm f\/1.4 USM (blue solid line). The dotted black line is the \ndifference in transmission between the Nikon and Canon lens, respectively. \nThe calculated spectral responsivities and the quantum efficiency curves are compatible in \nshape and amplitude. Note that the quantum efficiency calculation is a more direct and robust \nmethod since it does not depend on the Singular Value Decomposition. It is now clear that \nboth cameras have their peak sensitivity in the blue and minima in the red channels. The color \nbalance between the channels is, in other words, the same for both cameras. However, as \nexpected from the level of the count rate profiles, the Nikon D300 is the most sensitive \ncamera. The D300 has a peak quantum efficiency of 50% and spectral responsivity of \n4.3x10−3counts s−1 R−1 in the blue channel at 4600 Å. The green channel quantum efficiency \npeaks at 48% with 3.9x10−3 counts s−1 R−1 in spectral responsivity at 5300 Å, while the red \nchannel peak is lowest at 35% and 2.8x10−3 counts s−1 R−1 at 5900 Å. Again, by integration \nwe find that the D300’s blue, green and red channels have ~17, 9 and 54% higher spectral \nresponsivity compared to the D40, respectively. The corresponding difference in quantum \nefficiency is 11, 3 and 47%. \nThe above is a surprising result. We double checked our experimental setup to make sure \nthat we actually used the same settings on both cameras. Also note that, the total difference \nbetween the two sets of source functions used to obtain the spectral responsivity and quantum \nefficiency only varied by 17± R\/Å. The difference is so small that it is hard to see it if we \noverlay the curves of the 40D source functions in Fig. 3. \nOne factor that could explain the discrepancy, especially in the red, could be the difference \nin the spectral transmission of the lenses. The Nikon 50mm f\/1.4 AF-D and the Canon EF \n50mm f\/1.4 USM lenses are almost identical with the same number of optical elements in the \nlens construction. Figure 7 shows the spectral transmission profiles using the FICS \nspectrograph as the detector and a flat Lambertian surface as the target reference. The surface \nwas illuminated by a Tungsten lamp. The lenses were mounted in front of the spectrograph’s \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20218\nentrance fiber bundle. The setup is identical to our narrow field of view intensity calibration \nprocedure [3]. The shape of the transmission profiles is more or less equal for both lenses. \nThere is a gradually increase from ~80% at 4000 Å up to a more stable region above ~90% \nfrom 4500 to 6500 Å. In the deep red part of the spectrum (λ > 6500 Å), the transmission \nfactors start to decrease more rapidly to a level below ~50 to 60% at 10 000 Å. The Nikon \nlens is overall more effective than the Canon lens throughout the visible region (4000 – 7000 \nÅ) and the near infra-red (7000 - 10000 Å) by a factor of ~5 and 15%, respectively. \nIf we take into account the transmission of the lenses, the difference between the cameras \nin spectral responsivity and quantum efficiency is only changed by a few percent. The D300’s \nblue, green and red channels now have ~12, 5 and 50% higher spectral responsivity compared \nto the D40, respectively. The updated differences in quantum efficiency become ~7% for the \nblue, 0% for the green and 45% for the red channels. \nThe above result indicates that the main difference between these two cameras is in their \ndetectors. Both cameras use a CMOS (Complementary Metal Oxide Semiconductor) \nsensor and a Color Filter Mosaic (CFM) to separate the colors. The main difference in spectral \nresponsivity is found to be in the red channels, and could well be related to the transmission of \nthe red elements in the CFM, the infra-red filter or in the semiconductors used. This is an \ninteresting topic, but it is beyond the scope of this paper. \nA digital camera image could contain more information than just relative scaled intensities \nor color coded pixel values that have little physical meaning in terms of brightness on a \nquantitative scale. The recent improvements in both sensitivity and dynamic range enable the \nDSLR camera to be used as an intensity tool as well. But the lesson learned from this exercise \nis that there seems to be a lack of a common standard for camera sensitivity given by the \nmanufacturers. As shown above for Nikon and Canon, the ISO (International Organization for \nStandardization) values, originally defined as the speed of photographic film, may not be the \noptimum parameter representing the sensitivity of a digital sensor. The spectral responsivity \nor the quantum efficiency is the parameter that should be used in the future to characterize the \nsensitivity of a camera. We hope that the manufacturers can provide this information in future. \nIt would increase the usage and potential of these fantastic devices. \n6. Concluding remarks \nThe principal results obtained by this study can be summarized as follows. \n(1) A fiber optical lamp is connected to the input of a monochromator which is tunable in \nwavelength in the visible part of the electromagnetic spectrum (4000 – 7000 Å). The \noutput of the monochromator illuminates an integrating sphere with a bandpass of \n~12Å. \n(2) The brightness of the sphere is monitored by an intensity calibrated spectrograph. A \nlibrary of source functions consisting of 31 monochromatic lines is obtained in the \nvisible part of the electromagnetic spectrum. The intensities range from ~500 to 3300 \nR\/Å. \n(3) The intensity of the sphere is sufficiently uniform to obtain the average pixel response \nfor each colour channel of a digital colour camera. As a result, it is possible to \nretrieve the spectral responsivity and the quantum efficiency of each pixel as a \nfunction of wavelength. \n(4) Two semi-professional DSLR cameras, the Nikon D300 and Canon 40D, have been \ncalibrated. The sensitivities based on calculations of spectral responsivity and \nquantum efficiency, are found to be higher in the blue compared to the green and red \nchannels. The Nikon D300 has a peak quantum efficiency of 50% at 4600 Å, 48% at \n5300Å and 35% at 5900 Å. The corresponding spectral responsivity is found to be \n4.3x10−3, 3.9x10−3 and 2.8x10−3 in units of counts s−1 R−1. The D300 is slightly more \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20219\nsensitive than the 40D in the blue and green channels. The main difference is found \nin the red channel. The 40D is up to 50% less red sensitive than the D300. \n(5) The ability of a DSLR camera to measure intensity of light in terms of absolute \nphysical units opens up new possibilities. A standard measure such as the quantum \nefficiency or spectral responsivity could be part of a certificate provided by the \nmanufacturer in the future. \nAcknowledgement \nThis work was financially supported by The Research Council of Norway through the project \nnamed: Norwegian and Russian Upper Atmosphere Co-operation On Svalbard #178911\/S30 \n(NORUSCA). \n#116267 - $15.00 USD Received 26 Aug 2009; accepted 6 Oct 2009; published 21 Oct 2009\n(C) 2009 OSA 26 October 2009 \/ Vol. 17,  No. 22 \/ OPTICS EXPRESS  20220\n"}