{"doi":"10.1063\/1.3140527","coreId":"68764","oai":"oai:eprints.lancs.ac.uk:31244","identifiers":["oai:eprints.lancs.ac.uk:31244","10.1063\/1.3140527"],"title":"Applications of dynamical inference to the analysis of noisy biological time series with hidden dynamical variables.","authors":["Duggento, A.","Luchinsky, D. G.","Smelyanskiy, V. N.","Millonas, M.","McClintock, P. V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Macucci, M.","Basso, G."],"datePublished":"2009-04-23","abstract":"We present a Bayesian framework for parameter inference in noisy, non-stationary, nonlinear, dynamical systems. The technique is implemented in two distinct ways: (i) Lightweight implementation: to be used for on-line analysis, allowing multiple parameter estimation, optimal compensation for dynamical noise, and reconstruction by integration of the hidden dynamical variables, but with some limitations on how the noise appears in the dynamics; (ii) Full scale implementation: of the technique with extensive numerical simulations (MCMC), allowing for more sophisticated reconstruction of hidden dynamical trajectories and dealing better with sources of noise external to the dynamics (measurements noise)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68764.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31244\/1\/AIPtemporary2009ApplicationsOfDynamical.pdf","pdfHashValue":"8c006fc560971eed115d5a0f8bbd3a7aec7cb14f","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31244<\/identifier><datestamp>\n      2018-01-24T01:58:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Applications of dynamical inference to the analysis of noisy biological time series with hidden dynamical variables.<\/dc:title><dc:creator>\n        Duggento, A.<\/dc:creator><dc:creator>\n        Luchinsky, D. G.<\/dc:creator><dc:creator>\n        Smelyanskiy, V. N.<\/dc:creator><dc:creator>\n        Millonas, M.<\/dc:creator><dc:creator>\n        McClintock, P. V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We present a Bayesian framework for parameter inference in noisy, non-stationary, nonlinear, dynamical systems. The technique is implemented in two distinct ways: (i) Lightweight implementation: to be used for on-line analysis, allowing multiple parameter estimation, optimal compensation for dynamical noise, and reconstruction by integration of the hidden dynamical variables, but with some limitations on how the noise appears in the dynamics; (ii) Full scale implementation: of the technique with extensive numerical simulations (MCMC), allowing for more sophisticated reconstruction of hidden dynamical trajectories and dealing better with sources of noise external to the dynamics (measurements noise).<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:contributor>\n        Macucci, M.<\/dc:contributor><dc:contributor>\n        Basso, G.<\/dc:contributor><dc:date>\n        2009-04-23<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31244\/1\/AIPtemporary2009ApplicationsOfDynamical.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.3140527<\/dc:relation><dc:identifier>\n        Duggento, A. and Luchinsky, D. G. and Smelyanskiy, V. N. and Millonas, M. and McClintock, P. V. E. (2009) Applications of dynamical inference to the analysis of noisy biological time series with hidden dynamical variables. In: Noise and fluctuations : 20th International Conference on Noise and Fluctuations (ICNF-2009). AIP Conference Proceedings, 1129 . American Institute of Physics, Melville, N. Y., pp. 531-534.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31244\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.3140527","http:\/\/eprints.lancs.ac.uk\/31244\/"],"year":2009,"topics":["QC Physics"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"Applications of dynamical inference to the\nanalysis of noisy biological time series with\nhidden dynamical variables\nA. Duggento∗, D. G. Luchinsky∗,†, V. N. Smelyanskiy†, M. Millonas∗∗ and\nP. V. E. McClintock∗\n∗Department of Physics, Lancaster University, Lancaster LA1 4YB, UK\n†NASA Ames Research Center, Mail Stop 269-2, Moffett Field, CA 94035, USA\n∗∗Mission Critical Technologies Inc., 2041 Rosecrans Ave. Suite 225 El Segundo, CA 90245, USA\nAbstract. We present a Bayesian framework for parameter inference in noisy, non-stationary, non-\nlinear, dynamical systems. The technique is implemented in two distinct ways:\n(i) Lightweight implementation: to be used for on-line analysis, allowing multiple parameter esti-\nmation, optimal compensation for dynamical noise, and reconstruction by integration of the hidden\ndynamical variables, but with some limitations on how the noise appears in the dynamics ;\n(ii) Full scale implementation: of the technique with extensive numerical simulations (MCMC),\nallowing for more sophisticated reconstruction of hidden dynamical trajectories and dealing better\nwith sources of noise external to the dynamics (measurements noise).\nKeywords: <Enter Keywords here>\nPACS: <Replace this text with PACS numbers; choose from this list: http:\/\/www.aip..org\/pacs\/index.html>\nDeveloping earlier works [1, 2], we consider the following an M-dimensional time-\nseries Y = {yn ≡ y(tn)} (tn = nh), representing N observations of the system\nx˙(t) = f(x|c)+\n√\nDξ (t), y(t) = g(x|b)+√Mη(t). (1)\nThe first eq.s(1) defines the L-dimensional underlying stochastic dynamics (with\nwhite uncorrelated noise source) and the second one defines the observed variable\nY (with an extra observational noise source). Our task is to infer the unknown\nmodel parameters, their time variations, the noise intensities and X -trajectory:\nM = {c(t),b(t),D,M,{xn}}.\nThe form of the likelihood depends on the approximations of the theory. For an Euler\napproximation of the dinamics xn+1 = xn +hf(x∗n|c)+\n√\nhDξ n, with x∗n = (xn+1 +xn)\/2,\nthe minus log-likelihood function S = − lnℓ(Y |M ) can be written as: (see [3, 1])\nS = N\n2\nln |D|+ h\n2\nN−1\n∑\nn=0\n{∂ (f(xn)|c)k\n∂xk\n.+[x˙n − f(x∗n|c)]T D−1 [x˙n − f(x∗n|c)]\n}\n+\nN\n2\nln |M|+ 1\n2\nN\n∑\nn=1\n[yn −g(xn|b)]T M−1 [yn −g(yn,xn|b)]+(L+M)N ln(2pih),\n(2)\nwhere x˙n = xn+1−xnh and summation over k is implicit in the term\n∂ (f(xn)|c)k\n∂xk .\nLet us assume for a moment that X is given. In this case, by the parameterising the\nvector field f(x∗n|c) = U(x∗n)c ≡ Unc, linearly in respect of its parameters, and assuming\na multivariate normal prior PDF for c, the posterior is also normal, and its mean is given\nby [3]:\ncpost =\n(\nh\nN−1\n∑\nn=0\nUTn D−1Un\n)−1(\nh\nN−1\n∑\nn=0\n[\nUTn D−1 x˙n −\n1\n2\nL\n∑\nl=1\n∂Ulm(x)\n∂xl\n])\n,\n〈D〉 = h\nN\nN−1\n∑\nn=0\n[x˙n −Un c] [x˙n −Un c]T .\n(3)\nThe obtained result holds uniquely in presence of additive noise (D constant). If this was\nnot the case, then an extra parameterisation of the noise should have been employed, and\nheavy approximation and assumptions made in order to make the problem algebraically\ntreatable.\nWhen X is not observable, a global optimization technique should, in general, be\nemployed. In the next two following sections two example will be discussed. In the first\none, a ‘lightweight’ implementation will be used and the use of global optimization will\nbe avoided. In the second example the most probable state for the dynamical space will\nbe obtained thanks to an MCMC techinique.\nLIGHTWEIGHT IMPLEMENTATION\nIn our first example, we decode the parameters of a system of neurons modelled by an\nL-dimensional system of FitzHugh-Nagumo (FHN) oscillators [5]:\nv˙ j = −v j\n(\nv j −α j\n)(\nv j −1\n)−q j +η j +√Di j ξ j, (4)\nq˙ j = −β q j + γ j v j ; 〈ξ j(t)ξi(t ′)〉 = δi jδ (t − t ′), (5)\nyi = Xi j v j . i, j = 1, . . . ,L. (6)\nwhere v j models the membrane potentials and q j are slow recovery variables. Parame-\nters ηi control the potential threshold for the self-excited dynamics, controlling the firing\nrate, and they will be considered as time-varying parameters. We assume that neither v j\nnor q j are read directly (i.e. ‘hidden’ variables), but that the measurements are made\nthrough an unknown measurement matrix X in eq.(6). Our tasks are to: (i) reconstruct\ncoefficients appearing in Eq.(4-5); (ii) reconstruct the mixing matrix X ; (iii) reconstruct\nthe hidden variables q j; (iv) perform tasks (i)-(iii) taking into account that some param-\neters might have explicit time dependence. We assume no measurement noise in eq.(6):\nindeed in such systems the measurement noise is often negligible and in this way we can\navoid global optimization and better estimate the performance of the Bayesian inference\nitself. Following [2], a convenient way to treat this problem is by integration of the slow\nrecovery variable qi and to substitute it into the top equation in eq.(4), and consequently\nin eq.(6) we obtain the explicit form for the dynamics of the readout variable:\ny˙i = η˜i + α˜i jy j + ˜bik1k2 yk1yk2 + c˜ik1k2 yk1y2k2\n+e−β t q˜i −\n∫ t\n0 e\nβ (t−τ)γi j y jdτ +\n√\n˜Di jξ j(t), (7)\nwhere parameters of the gtransformed dynamics in eq.(7) are function of the original\nparameters and the matrix X . This explicit dependence is given in [2]. Although the\nnumber of base functions Nφ for the mixed dynamic is much larger than the number\nof polynomial terms in eq.s(4-5) the inferencial algorithm exibits good performances\nand high speed in inferring parameters even when few of them are explicetelly time\ndependent. Some results are presentented on Fig. 1.\n 0.1\n 0.2\n 0.3\n 0.4\n 0.5\n 0  1  2  3  4\nη 1\nt (s)\n(a)\n 0.1\n 0.2\n 0.3\n 0.4\n 0.5\n 0.6\n 0  1  2\nq 1\nt (s)\n(c)\n 0.2\n 0.4\n 0.6\n 0.8\n 1\n 0  0.5  1\nη 1\nt (s)\n(c)\n10-5\n100\n105\n 0  0.5  1  1.5\n<\n λ\n \n>\nt (s)\nFIGURE 1. Inference of η1 and η2 from eq.(4) for a 2-FHN system, while smoothly varying in the\npresence of noise. No prior knowledge of the model parameters is assumed. (a) The inferred values of\nη1 (dashed red lines) are compared with their true values (full blue lines); here the ability in detecting\ncontinuous evolution of the control parameters in the adiabatic limit is demonstrated. (b) The recontructed\ntime-trace of the hidden coordinate q1(t). (c) Typical convergence of the control parameters η j as\nfunctions of the measurement time t; qualitative behaviour of the biggest eigenvalues of the covariance\nmatrix is given in the box. In [2] a detailed discussion is presented.\nMCMC IN AN ECOLOGICAL SYSTEMS\nIn ecological problems the emphases are on the off-line recovery of hidden population\ndynamics. We therefore consider a general MCMC approach. We consider an example\nof predator-prey dynamics, also considered in [6, 7, 8], where the cycling dynamics of\nthe vole population in Finnish Lapland can be modelled by the following equations for\nthe fluctuating densities of rodents N and their predators P (weasels, foxes, owls, and\nothers). Dynamical inference method cannot be applied “as is” to the model of autors\nof [6, 7, 8] because: (i) the noise terms are multiplicative; (ii) the predator trajectory\nis hidden; and (iii) the prey dynamics is measured together with some measurement\nnoise. If the first problem can be overcome by making an ad hoc change of variables,\nthe second and third problem are more complex and can be solved in different ways\naccordingly to the approximations that one can introduce. In this respect, some ways\nhas been investigated in [4]. Here, the aim is to show how an MCMC techinique can\nbe employed for the reconstruction of the hidden dynamical sample. In particular it is\nvery useful to analyse what happen in a one-dimensional approximation. For a detailed\ndiscussion of how to reduce to this system and what are the approximations involved see\n[4, 8, 7]. The resulting one-dimesional systems considered has the form:\nx˙1 = r (1− e1 sin(2pit +ψ0))− r˜ex1 − ge\nx1\ne2x1 +h2 −\naz−1\nex +d + rσnξn(t), (8)\nz = e−s1t−\ns2\n2pi cos(2pit)\n(\nc0 + s3\n∫ t\nt0\ndτ\nn(τ)\nes1τ+\ns2\n2pi cos(2piτ)\n)\n, (9)\ny(t) = x1(t)+σobsη(t). (10)\nwhere the only observable is y(t). For the sake of simplicity we assume the noise\nintensities to be fixed and introduce an abbreviated vector of the unknown parame-\nters ˜M = {c,{xk}}. The MCMC algorithm can be briefly summarized as follows:\n(i) Take an initial guess for ˜M (0) = {c(0),{x(0)k }}; (ii) Sample a trajectory from\np(xk|xk−1,xk+1, ˜M ,D,σobs,yt) for k = 0, ...,K using Gibbs sampler with Metropolis-\nHastings (M-H) steps; (iii) Sample model parameters from p( ˜M |{xt},D,σobs,{yt})\nusing M-H algorithm; (iv) Repeat steps (ii)-(iv) until convergence is achieved.\nA graphical results is summarised on Fig.2.\nFIGURE 2. Inference parameters from eq.(8); (a) Typical evolution of the solution of the optimization\nproblem starting from some initial values and descending the hyperplane of the cost function defined by\nthe posterior minus-log-likelihood; (b) Results of the MCMC calculations: convergence of the unknown\npredator trajectories from an initial guess (solid black line at the bottom of the figure) to the actual\ntrajectory (solid blue line at the top of the figure) is shown by dashed red lines. The arrow indicates\nthe direction of convergence as a function of number of iterations.\nCONCLUSIONS\nWe have considered the problem of dynamical inference in presence of noise and pro-\nvided different approaches for a fast implementation (on-line applications), investigating\nthe boundaries of the resolution for slowly varying parameters; and for more computa-\ntionally demanding problem of global reconstruction with the heavy use of MCMC for\ndiscovering the latent state variables for the extreme case of missing data.\nREFERENCES\n1. D. G. Luchinsky, V. N. Smelyanskiy, A. Duggento, and P. V. E. McClintock, Phys. Rev. E 77, 061105\n(2008).\n2. A. Duggento, D. G. Luchinsky, V. N. Smelyanskiy, I. Khovanov and P. V. E. McClintock, Phys. Rev.\nE 77, 061106 (2008).\n3. V. N. Smelyanskiy, D. G. Luchinsky, D. A. Timucin, and A. Bandrivskyy, Phys. Rev. E 72, 026202\n(2005).\n4. D. G. Luchinsky, V. N. Smelyanskiy, M. Millonas, P. V. E. McClintock, Europ. Phys. J. B 65 pp.\n369–377 (2008)\n5. J. Nagumo, S. Animoto, and S. Yoshizawa, Proc. Inst. Radio Engineers 50, 2061 (1962).\n6. I. Hanski, H. Henttonen, E. Korpimaäki, L. Oksanen, P. Turchin, Ecology 82(6), 1505 (2001)\n7. O. Gilg, I. Hanski, B. Sittler, Science 302, 866 (2003)\n8. P. Turchin, S.P. Ellner, Ecology 81(11), 3099 (2000)\n"}