{"doi":"10.1016\/j.jeurceramsoc.2004.10.007","coreId":"138011","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1101","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1101","10.1016\/j.jeurceramsoc.2004.10.007"],"title":"Preparation of sub-micron PZT particles with the sol-gel technique.","authors":["Linardos, S.","Zhang, Qi","Alcock, Jeffrey R."],"enrichments":{"references":[{"id":38113119,"title":"A novel chemical route for the preparation of nanocrystalline PZT powder,","authors":[],"date":null,"doi":"10.1016\/s0167-577x(00)00132-4","raw":"R.  N.  Das,  R.  K.  Pati,  P.  Pramanik,  A  novel  chemical  route  for  the preparation of nanocrystalline PZT powder, Mater. Lett., 45, p. 350-355,","cites":null},{"id":38113130,"title":"An improvement on sol-gel method for preparing ultrafine and crystallized titania powder,","authors":[],"date":null,"doi":"10.1016\/s0921-5093(00)00901-1","raw":"Xiaoheng Liu, An improvement on sol-gel method for preparing ultrafine and  crystallized  titania  powder,  Mat.  Sci.  and  Engin.A,  289,  p.241-245,","cites":null},{"id":38113147,"title":"Atsushi Higuchi, Single-layer submicron-thick BaTiO3 coatings from PVP-containing sols: Gel-to-ceramic film conversion, densification, and dielectric properties,","authors":[],"date":null,"doi":"10.1557\/jmr.2001.0430","raw":"Hiromitsu Kozuka, Atsushi Higuchi, Single-layer submicron-thick BaTiO3 coatings  from  PVP-containing  sols:  Gel-to-ceramic  film  conversion, densification, and dielectric properties, J. Mater. Res., 16, p. 3116-3123,","cites":null},{"id":38113157,"title":"Atsushi Higuchi, Single–layer submicron–thick BaTiO3 coatings from poly(vinylpyrrolidone)–containing sols: Gel–to–ceramic film conversion, densification, and dielectric properties,","authors":[],"date":"2001","doi":"10.1557\/jmr.2001.0430","raw":"Hiromitsu Kozuka, Atsushi Higuchi, Single–layer submicron–thick BaTiO3 coatings from poly(vinylpyrrolidone)–containing sols: Gel–to–ceramic film conversion, densification, and dielectric properties, J. Mater. Res., 16, p. 3116-3123, 2001","cites":null},{"id":38113109,"title":"Ceramic processing and sintering,","authors":[],"date":"1995","doi":"10.1016\/b978-0-08-037298-3.50012-8","raw":"M. N. Rahaman, Ceramic processing and sintering, New York, 1995","cites":null},{"id":38113117,"title":"Chemical synthesis of nanocrystalline lead zirconate-titanate powders using tartarate precursor,","authors":[],"date":"1999","doi":"10.1016\/s0167-577x(99)00084-1","raw":"R.  N.  Das,  P.  Pramanik,  Chemical  synthesis  of  nanocrystalline  lead zirconate-titanate powders using tartarate precursor, Mater. Lett., 40, p. 251-254, 1999","cites":null},{"id":38113141,"title":"Effect of acetylacetone on the preparation of PZT materials in sol–gel processing,","authors":[],"date":"2002","doi":"10.1016\/s0921-5107(02)00384-7","raw":"L. Weng, X. Bao, K. Sagoe-Crentsil, Effect of acetylacetone on the preparation of PZT materials in sol–gel processing, Mat. Sci. And Engin.B, 96, p. 307-312, 2002","cites":null},{"id":38113134,"title":"Hirohisa Kaneko, Nobuyasu Mizutani, Preparation of monodispersed lead zirconate-titanate fine particles,","authors":[],"date":"1988","doi":"10.1007\/bf00723789","raw":"Takashi  Ogihara,  Hirohisa  Kaneko,  Nobuyasu  Mizutani,  Preparation  of monodispersed  lead  zirconate-titanate  fine  particles,  J.  of  Mater.  Scin. Let., 7 , p. 867-869, 1988","cites":null},{"id":38113128,"title":"Hydrothermal synthesis of acicular lead zirconate titanate (PZT),","authors":[],"date":"2001","doi":"10.1016\/s0022-0248(01)00857-0","raw":"Seung-Beom Cho, M. Oledzka, R. E. Riman, Hydrothermal synthesis of acicular lead zirconate titanate (PZT), J. of Cryst. Growth., 226, p. 313-326, 2001","cites":null},{"id":38113127,"title":"Hydrothermal synthesis of lead zirconium titanate (PZT) powders and their characteristics,","authors":[],"date":"1999","doi":"10.1016\/s0955-2219(98)00367-7","raw":"M. Traianidis, C. Courtois, A. Leriche, B. Thierry, Hydrothermal synthesis of lead zirconium titanate (PZT) powders and their characteristics, J. of The Europ. Ceram. Societ., 19, p. 1023-1026, 1999   12","cites":null},{"id":38113145,"title":"Influence of hydrolysis conditions of the acetate sol–gel process on the stoichiometry of PZT powders,","authors":[],"date":"2004","doi":"10.1016\/s0272-8842(03)00131-7","raw":"H. Brunckova, L. Medvecky, J. Briancin, K. Saksi, Influence of hydrolysis conditions of the acetate sol–gel process on the stoichiometry of PZT powders, Ceramics. International., 30, p 453-460, 2004","cites":null},{"id":38113149,"title":"Kiyoshi Kanamura, Minori Fujisaki, Jun-ichi Hamagami, Sei-ichi Suda, Takao Umegaki, Preparation of Li4Ti5O12 and LiCoO2 thin film electrodes from precursors obtained by sol–gel method,","authors":[],"date":"2002","doi":"10.4028\/www.scientific.net\/kem.216.123","raw":"Young Ho Rho, Kiyoshi Kanamura, Minori Fujisaki, Jun-ichi Hamagami, Sei-ichi Suda, Takao Umegaki, Preparation of Li4Ti5O12 and LiCoO2 thin film electrodes from precursors obtained by sol–gel method, Solid State Ionics, 151, p.151-157, 2002   14","cites":null},{"id":38113114,"title":"Lead zirconate titanate ceramics achieved by reaction sintering of PbO and high-energy ball milled (ZrTi)O2 nanosized powders,","authors":[],"date":"2002","doi":"10.1016\/s0167-577x(02)00395-6","raw":"L. B. Kong, J. Ma, R.F. Zhang, W. Zhu, O. K. Tan, Lead zirconate titanate ceramics  achieved  by  reaction  sintering  of  PbO  and  high-energy  ball milled (ZrTi)O2 nanosized powders, Mater. Let., 55, p. 370-377, 2002","cites":null},{"id":38113160,"title":"Lead Zirconate Titanate Prepared From Different Zirconium and Titanium Precursors by sol-gel,","authors":[],"date":null,"doi":"10.1111\/j.1151-2916.1998.tb02671.x","raw":"Aiying  Wu,  Isabel  M.  Miranda  Salvado,  Paula  M.  Vilarinho,  João  L. Baptista, Lead Zirconate Titanate Prepared From Different Zirconium and Titanium  Precursors  by  sol-gel,  J.  Am.  Ceram.  Soc,  81,  p.  2640-2644,","cites":null},{"id":38113122,"title":"Low temperature synthesis of lead zirconate titanate powder by hydroxide co-precipitation,","authors":[],"date":"2003","doi":"10.1016\/s0167-9317(02)00967-x","raw":"Gang Xu, W. Weng, J. Yao, P. Du, G. Han, Low temperature synthesis of lead  zirconate  titanate  powder  by  hydroxide  co-precipitation,  Microelec. Engin., 66, p. 568-573, 2003","cites":null},{"id":38113124,"title":"Low temperature synthesis of stoichiometric and homogeneous lead zirconate titanate powder by oxalate and hydroxide coprecipitation,","authors":[],"date":"1998","doi":"10.1016\/s0025-5408(98)00189-5","raw":"B. Guiffard, M. Troccaz, Low temperature synthesis of stoichiometric and homogeneous  lead  zirconate  titanate  powder  by  oxalate  and  hydroxide coprecipitation, Mat. Resear. Bull., 33, p. 1759-1768, 1998","cites":null},{"id":38113126,"title":"Mechanism of PZT crystallisation under hydrothermal conditionsDevelopment of a new synthesis route,","authors":[],"date":"2000","doi":"10.1016\/s0955-2219(00)00222-3","raw":"M. Traianidis, C. Courtois, A. Leriche. Mechanism of PZT crystallisation under hydrothermal conditionsDevelopment of a new synthesis route, J. of the Europ. Ceram, Societ., 20, p. 2713-2720, 2000","cites":null},{"id":38113116,"title":"Mechanochemical synthesis of PZT powders,","authors":[],"date":"2003","doi":"10.1016\/s0921-5093(02)00475-6","raw":"Z.  Brankovic,  G.  Brankovic,  C.  Jovalekic,  Y.  Maniette,  M.  Cilense, Mechanochemical synthesis of PZT powders,  Mater. Sci. and Engin.A, 345, p. 243-248, 2003   11","cites":null},{"id":38113135,"title":"Nanocrystalline powder and fibres of lead zirconate titanate prepared by the sol-gel process,","authors":[],"date":"1997","doi":"10.1016\/s0924-0136(96)02636-2","raw":"Q. F. Zhou, Nanocrystalline powder and fibres of lead zirconate titanate prepared by the sol-gel process, J. of Mater. Proc. Tech., 63, p. 281-285, 1997   13","cites":null},{"id":38113112,"title":"Preparation and characterization of Pb(Zr0.52Ti0.48)O3 ceramics from high-energy ball milling powders,","authors":[],"date":"2000","doi":"10.1016\/s0167-577x(99)00190-1","raw":"L.  B.  Kong,  W.  Zhu,  O.  K.  Tan,  Preparation  and  characterization  of Pb(Zr0.52Ti0.48)O3 ceramics from high-energy ball milling powders, Mater. Let., 42, p.232-239, 2000","cites":null},{"id":38113137,"title":"Processing effects in the sol-gel preparation of PZT dried gels, powders, and ferroelectric thin-layers,","authors":[],"date":"1992","doi":"10.1111\/j.1151-2916.1992.tb04392.x","raw":"C.D.E. Lakeman, D. A. Payne, Processing effects in the sol-gel preparation of PZT dried gels, powders, and ferroelectric thin-layers, J. Am. Ceram. Soc, 75, p. 3091-3096, 1992","cites":null},{"id":38113125,"title":"Processing of Pb(Zr0.52Ti0.48)O3 (PZT) ceramics from microwave and conventional hydrothermal powders,","authors":[],"date":"1999","doi":"10.1016\/s0025-5408(99)00143-9","raw":"I.  R.  Abothu,  Shi-Fang  Liu,  S.  Komarneni,  Q.  H.  Li,  Processing  of Pb(Zr0.52Ti0.48)O3  (PZT)  ceramics  from  microwave  and  conventional hydrothermal powders, Mat. Resear. Bull., 34, p. 1411-1419, 1999","cites":null},{"id":38113132,"title":"Production of ultrafine ZrO2 and Y-doped ZrO2 powders by solvent extraction from solutions of perchloric and nitric acid with tri-nbutyl phosphate in kerosene,","authors":[],"date":"1996","doi":"10.1016\/s0032-5910(96)03176-2","raw":"Yang Chuanfang, Production of ultrafine ZrO2 and Y-doped ZrO2 powders by solvent extraction from solutions of perchloric and nitric acid with tri-nbutyl phosphate in kerosene, Powder Technology, 89, p. 149-155, 1996","cites":null},{"id":38113139,"title":"PZT\/PLZT ceramics prepared by hydrolysis and condensation of acetate precursors,","authors":[],"date":"2001","doi":"10.1016\/s0272-8842(00)00091-2","raw":"W. D. Yang., PZT\/PLZT ceramics prepared by hydrolysis and condensation of acetate precursors, Ceram. Intern., 27, p.373-384, 2001","cites":null},{"id":38113162,"title":"Seeding in sol-gel process for Pb(Zr0.52Ti0.48)O3 powder fabrication,","authors":[],"date":"2002","doi":"10.1016\/s0254-0584(02)00061-5","raw":"Y.Z. Chen, J. MA, L. B. Kong, R.F. Zhang, Seeding in sol-gel process for Pb(Zr0.52Ti0.48)O3  powder fabrication, Mat. Chem. and Phys., 75, p. 225-228, 2002","cites":null},{"id":38113155,"title":"Single – Step Dip Coating of Crack– ree BaTiO3 Films > 1 µm Thick:","authors":[],"date":"2000","doi":"10.1111\/j.1151-2916.2000.tb01330.x","raw":"H. Kozuka, M. Kajimura, Single – Step Dip Coating of Crack– ree BaTiO3 Films > 1 µm Thick: Effect of Poly(vinylpyrrolidone) on Critical Thickness, J. Am. Ceram. Soc., 83, p. 1056-62, 2000","cites":null},{"id":38113164,"title":"Sol – Gel Preparation of Lead Zirconate Titanate Powders and 15 Ceramics: Effect of Alkoxide Stabilizers and Lead Precursors,","authors":[],"date":"2000","doi":"10.1111\/j.1151-2916.2000.tb01397.x","raw":"Aiying  Wu,  Paula  M.  Vilarinho,  Isabel  M.  Miranda  Salvado,  João  L. Baptista, Sol – Gel Preparation of Lead Zirconate Titanate Powders and   15 Ceramics:  Effect  of  Alkoxide  Stabilizers  and  Lead  Precursors,  J.  Am. Ceram. Soc., 83, p. 1379-1385, 2000","cites":null},{"id":38113129,"title":"Synthesis and characterisation of monosized doped","authors":[],"date":"1984","doi":"10.1557\/proc-32-187","raw":"B. Fegley, E. A. Barringer, Synthesis and characterisation of monosized doped TiO2 powders, J. Am. Ceram. Soc., 67, p. 113-116, 1984","cites":null},{"id":38113153,"title":"Synthesis and characterization of monodisperse zinc and zinc oxide nanoparticles from the organometallic precursor","authors":[],"date":"2002","doi":"10.1016\/s0022-328x(01)01378-x","raw":"Franck  Rataboul,  Ce´line  Nayral,  Marie-Jose´  Casanove,  Andre´ Maisonnat,  Bruno  Chaudret,  Synthesis  and  characterization  of monodisperse zinc and zinc oxide nanoparticles from the organometallic precursor [Zn(C6H11)2], J. Organ. Chem., 643–644, p. 307-312, 2002","cites":null},{"id":38113110,"title":"Synthesis of lead zirconate titanate from an amorphous precursor by mechanical activation,","authors":[],"date":"2000","doi":"10.1016\/s0925-8388(00)00917-8","raw":"Xue Junmin, John Wang and Toh Weiseng, Synthesis of lead zirconate titanate from an amorphous precursor by mechanical activation, J. of All. And Comp., 308, p. 139-146, 2000","cites":null},{"id":38113133,"title":"Synthesis of MgO–SiO2 and CaO–SiO2 amorphous powder by sol–gel process and ion exchange,","authors":[],"date":null,"doi":"10.1016\/s0022-3093(99)00370-1","raw":"Sei-ichi Suba, Synthesis of MgO–SiO2 and CaO–SiO2 amorphous powder by sol–gel process and ion exchange, J. Non-Cryst. Sol., 255, p. 178-184,","cites":null},{"id":38113131,"title":"The Preparation, Characterization, and their Photocatalytic Activities of Rare-Earth-Doped TiO2","authors":[],"date":"2002","doi":"10.1006\/jcat.2002.3539","raw":"An-Wu  Xu,  The  Preparation,  Characterization,  and  their  Photocatalytic Activities of Rare-Earth-Doped TiO2 Nanoparticles, J. Of Catalysis, 207, p. 151-157, 2002","cites":null},{"id":38113121,"title":"Xian-Lin Dong, Synthesis of zirconium-rich PZT ceramics by hydroxide coprecipitation under hot-press,","authors":[],"date":"2002","doi":"10.1016\/s0167-577x(02)00626-2","raw":"Li Guo, A. Lyashchenko, Xian-Lin Dong, Synthesis of zirconium-rich PZT ceramics by hydroxide coprecipitation under hot-press, Mater. Lett., 56, p. 849-855, 2002","cites":null},{"id":38113143,"title":"Yan-Ju Yu, Zhao-Hua Jiang, Lian-Cheng Zhao, Synthesis of Pb1-xEux(Zr0.52Ti0.48)O3 nanopowders by a modified sol–gel process using zirconium oxynitrate source,","authors":[],"date":null,"doi":"10.1016\/s0254-0584(01)00586-7","raw":"Fu-Ping Wang, Yan-Ju Yu, Zhao-Hua Jiang, Lian-Cheng Zhao, Synthesis of Pb1-xEux(Zr0.52Ti0.48)O3 nanopowders by a modified sol–gel process using zirconium oxynitrate source, Mater. Chem. And Phys., 77, p. 10-13,","cites":null},{"id":38113151,"title":"Yan-ping Jin, Hong-hua Wang, Pin-fang Zu, Ping Tao, Ji-bao He, Effects of PVP on structure of TiO2 prepared by the sol-gel process,","authors":[],"date":"2001","doi":"10.1016\/s0921-5107(01)00743-7","raw":"Mao-ping Zheng, Ming-yuan Gu, Yan-ping Jin, Hong-hua Wang, Pin-fang Zu, Ping Tao, Ji-bao He, Effects of PVP on structure of TiO2 prepared by the sol-gel process, Mat. Sci. and Engin B. 87, p. 197-201, 2001","cites":null}],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2006","abstract":"This paper describes the production of Pb1.0Zr0.9Ti0.1 ceramic powder, by using metal organic precursors as starting materials. In this study polyvinylpyrrolidone, PVP, was used to create a PZT–PVP sol and then also added as a secondary stage to control the particle size of the powder.\n\nTwo different sol–gel routes were used to create PZT powder. Both routes gave similar primary particle sizes in the range, 30–70 nm, but different agglomerate formations. Perovskite PZT powder was created with both routes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138011.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1101","pdfHashValue":"778384e35c0b0868d5ae9164e83185df79e2a00e","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1101<\/identifier><datestamp>2008-02-26T20:03:55Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Preparation of sub-micron PZT particles with the sol-gel technique.<\/dc:title><dc:creator>Linardos, S.<\/dc:creator><dc:creator>Zhang, Qi<\/dc:creator><dc:creator>Alcock, Jeffrey R.<\/dc:creator><dc:description>This paper describes the production of Pb1.0Zr0.9Ti0.1 ceramic powder, by using metal organic precursors as starting materials. In this study polyvinylpyrrolidone, PVP, was used to create a PZT–PVP sol and then also added as a secondary stage to control the particle size of the powder.\n\nTwo different sol–gel routes were used to create PZT powder. Both routes gave similar primary particle sizes in the range, 30–70 nm, but different agglomerate formations. Perovskite PZT powder was created with both routes.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2006-05-27T11:11:14Z<\/dc:date><dc:date>2006-05-27T11:11:14Z<\/dc:date><dc:date>2006<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>1356708 bytes<\/dc:format><dc:format>53173 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>S. Linardos, Q. Zhang and J.R. Alcock, Preparation of sub-micron PZT particles with the sol-gel technique, Journal of the European Ceramic Society, Volume 26, Issues 1-2, 2006, Pages 117-123.<\/dc:identifier><dc:identifier>0955-2219<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1101<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.jeurceramsoc.2004.10.007<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0955-2219","issn:0955-2219"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Postprint"],"fullText":" 1 \nPreparation Of Sub-Micron PZT Particles With The Sol-Gel Technique. \n \nS. Linardos*, Q. Zhang and J. R. Alcock \n \nAdvanced Materials Department, School of Industrial and Manufacturing \nScience, Cranfield University, Bedfordshire MK43 0AL, UK \n \n \nAbstract \n \nThis paper describes the production of Pb1.0Zr0.9Ti0.1 ceramic powder, \nby using metal organic precursors as starting materials. In this study \npolyvinylpyrrolidone, PVP, was used to create a PZT-PVP sol and then also \nadded as a secondary stage to control the particle size of the powder. \nTwo different sol-gel routes were used to create PZT powder. Both \nroutes gave similar primary particle sizes in the range, 30 - 70 nm, but \ndifferent agglomerate formations. Perovskite PZT powder was created with \nboth routes. \n  \nKeywords : A. Powders-chemical preparation, A. Sol-gel processes, D. PZT \n \n \n                                                 \n*\n Corresponding author. Fax: +44 (0) 1234 752473 \n  E-mail addresses: s.linardos.2001@cranfield.ac.uk (S. Linardos) \n        j.r.alcock@cranfield.ac.uk (J. R. Alcock) \n \n 2 \nIntroduction  \n \nIn advanced ceramics the size, size distribution, shape and state of \nagglomeration of the starting powder strongly affect the microstructure of the \nsintering body, and the temperature at which it densifies  [1] \n Lead Zirconate Titanate (PZT) is an important ferroelectric material, \nwidely used for its piezoelectric and pyroelectric properties. There are a \nvariety of methods for the preparation of PZT powder. Mechanochemical \nsynthesis [2]-[5], chemical synthesis [6]-[10] or hydrothermal synthesis [11]-\n[14] has each been successfully used. \nProcessing routes for the production of monodispersed fine powders \nare becoming increasingly common. TiO2, ZrO2 and SiO2 were some of the \nfirst powders to have been successfully created [15]-[19] with the sol-gel \ntechnique. The synthetic methods used to prepare these materials involve \nfairly simple solution chemistry, however they give a high degree of control \nand reproducibility. \nHowever, it is more difficult to create monodispersed particles with two \nor more metallic elements because of the tendency of one of the metal \nalkoxides to precipitate out of the solution more quickly than the other. This is \nowing to differences in hydrolysis rates of the alkoxides. \nA sol-gel technique has previously been used by several authors [20]-\n[26] to create a PZT powder. \nIn this paper a new sol-gel route for PZT, incorporating \npolyvinylpyrrolidone, PVP, is presented. PVP has previously been used with \nsuccess for the creation of crack free thick, and thin films [27]-[28] and in \n 3 \nsome cases to improve the properties of the final powders [29]-[30]. In this \nstudy PVP, was used both to create a PZT-PVP sol and also as a secondary \nstage to control the particle size of the powder produced.  \n The advantage of this new sol-gel route is the capability of producing \ncontrolled nano-scale ceramic powder with specific crystalline phase. \n \n \nExperimental \n \nThe preparation route of the Pb1.0Zr0.9Ti0.1-PVP gel (i) is shown in \nFigure 1.  \nTo produce 160 ml of sol, the following route was used. 12.14 g of \nlead(II) acetate trihydrate was left under vacuum at 100 oC for 24 hours to \nremove the water. 12.21 g of zirconium(IV) propoxide, 76.33% by weight in n-\npropanol, and 0.9 g of titanium(IV) isopropoxide were dissolved in 120 ml \nisopropanol. This mixture was heated to 80 oC under stirring. After three hours \nthe lead(II) acetate was added. The mixture was stirred for another three \nhours under the same conditions. Extra isopropanol was added until the final \nvolume of the solution reached the 160 ml. A light-transparent PZT sol was \nobtained. To transform this into a PZT-PVP sol, 5.5 g of PVP with average \nmolecular weight of 1 300 000 were added and the stirring was continued until \nit became clear yellow in colour.  \nThe resulting PZT-PVP sol had a concentration of 0.2 M of lead. The \nPb(OAc)2 : PVP weight ratio of the sol was 1 : 0.5. In order to hydrolyse this to \nproduce a gel, water was slowly added up to the maximum of [H2O]\/[Pb] = \n0.66. A PZT-PVP gel, gel (i), was obtained.  \n 4 \nSubsequent to these common processing steps, two processing \nroutes, here called A and B were followed. \nPowder preparation route A is shown in Figure 2a. The PZT-PVP gel (i) \nwas left to dry at 60 oC for 144 h and then burnt out at 500 oC for 1h. An \norange coloured powder was created.  \nPowder preparation route B is shown in Figure 2b. The PZT-PVP gel (i) \nwas stirred for 10 min at 1200 rpm, and then 0.2 g of PVP with average \nmolecular weight 55 000 was added per millilitre of sol. The new PZT-PVP \ngel, gel (ii), was dried at 60 oC for 144 h and then heat treated at two different \nprofiles, one at 500 oC for 1 hour and the second at 550 oC for 24 hours. \n A Philips XL series Scanning Electron Microscope and a Siemens \nD5005 X-Ray Diffractometer were used for sample analysis. \n Size measurements of the powder were performed using a Zeta-Sizer \n3000 (Malvern Instruments). Each powder before the measurements was \ndiluted in water and left in an ultrasound bath for 40 min. \nDifferential scanning calorimetry of the gels was performed using a \nmodulated DSC (TA Instruments) model 2920. A constant heating rate of 10 \noC min-1 from 20 to 450 oC was used, with an isothermal dwell at 450 oC for \n60 min. All the measurements took place under a constant nitrogen flow. \nHermetic aluminium pans were used to encapsulate the samples. \n \n \n \n \n \n 5 \nResults \n \nFigures 3a - 3b are SEM micrographs of typical PZT powder that was \nproduced using route A. In Figure 3a non-spherical particulates of the order of \n10 µm in size can be observed. Figure 3b shows a higher magnification \nmicrograph of the surface of a particulate. It indicates that the 10 µm sized \nagglomerates are composed of primary particles of particle size 30-70nm. \nFigure 3c is a volume percent against particle diameter histogram of \nPZT powder that was produced with route A. The diagram show that almost \n90 % in volume of the powder consisted of particles with diameter above 5 µm \nand only 10 % in volume of the powder consists from sub-micron particles. \nFigures 4a - 4b are SEM micrographs of examples of PZT powder that \nwas produced using route B and subsequently heat treated at 500 oC for 1h. \nIn Figure 4a, particle agglomerates of up to 3µm in size with an approximately \nequiaxed shape can be observed. Figure 4b shows a higher magnification \nmicrograph of free standing agglomerates with diameter 50 - 200 nm and \nprimary particle size 30 - 50nm. \nFigure 4c is a particle diameter histogram of PZT powder that was \nproduced using route B and subsequently heat treated at 500 oC for 1h. The \ndiagram shows that only sub-micron particle formations were detectable in the \nsuspension. The average diameter of particles formations in water is around \n250 nm. \n  Figures 5a - 5b are SEM micrographs of examples of PZT powder that \nwas produced using route B and heat treated at 550 oC for 24h. Figure 5a \nshows agglomerates up to 2µm in diameter with approximately equiaxed \n 6 \nshape. The higher magnification micrograph, Figure 5b, shows agglomerated \nprimary particles with a primary particle size similar to the 500 oC heat treated \npowder. \n Figure 5c is a particle diameter histogram of PZT powder that was \nproduced using route B and heat treated at 550 oC for 24h. The diagram \nshows that around 95 % of the total volume of the powder consist from sub-\nmicron formations with mean diameter around 350 nm. About 5 % of the \npowder volume consists from particles with size 2-3 µm.  \nFigures 6a – 6c are XRD diagrams of PZT powders that were produced \nwith routes A and B. In Figure 6a a XRD diagram of PZT powder produced \nwith route A and heat treated at 500 oC for 1h is presented. Comparison with \nthe peaks for pyrochlore and perovskite shows that this route powder is a \nmixture of pyrochlore and perovskite phases. Figure 6b is a XRD diagram of \nPZT powder produced with route B and heat treated at 500 oC for 1h. This is \nmainly pyrochlore with very little perovskite phase present.  In Figure 6c, a \nXRD diagram of PZT powder produced with route B and heat treated at 550 \noC for 24h is presented. The XRD peaks show that this heat treatment gave a \npowder with perovskite phase only. \nFigures 7a shows heat flow against time curves for the PZT sol and the \n1 300 000 MW PVP respectively. The PZT-sol exhibits a shallow endothermic \npeak between 50–140 oC followed by two broad exothermic peaks, one at \n310–350 oC and the second at 420–450 oC. The 1 300 000 MW PVP, exhibits \ntwo endothermic peaks one at 50-100 oC and the second at 420-440 oC. \nFigure 7b shows heat flow diagrams for Gel (i) and Gel (ii). Gel (i) exhibits two \nexothermic peaks one at 320–370 oC and the second at 410–450 oC. Gel (ii) \n 7 \nalso exhibits two endothermic peaks, one at 40-150 oC, and the second at \n410–450 oC, as well as two exothermic peaks, the first at 320–370 oC and the \nsecond at 420-450 oC.  \n \n \nDiscussion \n \nFrom the SEM micrographs it can be observed that all three powders \nhave the same size range of primary particles diameter 30-50 nm. It can be \nconcluded that the extra polymer that was added in the secondary process \nstage did not significantly affect the size of the primary particles. However, a \ncomparison of figures 3a, 3c and 4a, 4c indicates that the second addition of \npolymer significantly reduces the agglomerate size.  \nComparing the results, it can be hypothesised that by adding extra \npolymer, as a secondary stage, the PZT particles in the gel were immobilized. \nAs a consequence of this immobilization, the particles were hindered from \nreacting and creating agglomerated formations of larger particles during the \ndrying and burn out steps. C=O groups of PVP are known to be strongly \nbonded with OH groups of the metalloxane polymers via hydrogen bonding \n[31][32]. Such C=O groups can be regarded as the “capping agent” for the OH \ngroups of the metalloxane polymers, obstructing the condensation reaction. \nA comparison between XRD figures 6a and 6b shows that similar \nconditions in the burn out stage resulted in powders with different crystalline \nphases. The PZT powder that was produced with route A gave a mixture of \npyrochlore and perovskite phases. The powder that was produced with route \n 8 \nB did not produce a detectable perovskite phase. These results indicate that \nan extra amount of PVP can delay the formation of the perovskite phase.  \nA similar comparison between XRD figures 6b and 6c shows that for \nthe route B powder an increase in the burn out temperature and time \nproduced a completely perovskite phase in the PZT. A comparison of the \nprimary particles morphology in Figures 4b and 5b indicates that the \nproduction of the perovskite phase was not at the expense of significant initial \nsintering of the powder. Figures 4c and 5c show that the increase in the burn \nout temperature also effects the particle population. The average diameter of \nthe sub-micron particles was increased. Particle formations with diameter \nabove 1 µm were created. This behaviour can be explained by taking in \nconsideration the local sintering that is noticeable in figure 5b. Figure 5b \nshows that the particles with smother surfaces have also created bridges with \ntheir neighbour particles. These hard agglomerates would be correlated with \nthe new population of micron-scale particles. \nThe role of the PVP in the sol-gel process was investigated using DSC. \nThe common endothermic peak, in Figures 7a and 7b, at 30–150 oC \ncorresponds to the evaporation of the solvent and the water. The exothermic \npeak, at 310–370 oC, is common to all the PZT containing samples and is \nlikely to correspond to the decomposition of the organic species. The \nexothermic peak exhibited by the PZT sol [Figure 7a] between 420-450 oC is \nlikely to be caused by the formation of a metastable pyrochlore phase \naccompanied by the remaining combustion of the organics [33]-[35].  \nThe endothermic peak at 420-450 oC exhibited by the PVP in Figure 7a \ncorresponds to the melting point of the polymer. Gel (i) also has an \n 9 \nexothermic peak in the temperature range 420–450 oC but the total released \nenergy was much greater than for the PZT sol sample. This indicates the \npresence of a different mechanism. The breaking of the hydrogen bonds \nbetween the C=O groups of PVP and the OH groups of the metalloxane \npolymers is likely to provided the extra energy. Gel (ii) exhibits the same \nbehaviour as Gel (i), except for an endothermic peak at 410–450 oC. The \nextra amount of polymer, added in the secondary stage, for Gel (ii) is likely to \naccount for this. \n The DSC results indicate that the first stage polymer created bonds \nwith the alkoxides and controlled the speed of the condensation reaction. \nHowever, the SEM pictures show that the first stage polymer was not able to \nprevent agglomeration during the drying process. The second stage polymer \nwas necessary to complete the encapsulation of the first stage PZT particles \nand prevent them from further reaction during the drying and burn out stage. \n \n \nConclusions \n \n Two sol-gel routes were used to create PZT powder. Both gave similar \nprimary particles sizes and morphologies but different agglomerate \nformations. The extra amount of polymer that was added as a secondary \nstage prevented the formation of large agglomerates and created a powder \nwith sub-micron primary particles. The amount of polymer in the PZT-PVP gel \nappears to be able to affect the final crystal phase of powder without affecting \nsignificantly the size of the freestanding particles.  \n \n 10 \n \nAcknowledgements \n \n This work would not have been possible without the financial support \nfrom EPSRC [grant No: GR\/R43303]. The authors would like to thank \nProfessor Roger Whatmore for his helpful discussion of the research results. \n \n \nReferences  \n \n1. M. N. Rahaman, Ceramic processing and sintering, New York, 1995 \n2. Xue Junmin, John Wang and Toh Weiseng, Synthesis of lead zirconate \ntitanate from an amorphous precursor by mechanical activation, J. of All. \nAnd Comp., 308, p. 139-146, 2000 \n3. L. B. Kong, W. Zhu, O. K. Tan, Preparation and characterization of \nPb(Zr0.52Ti0.48)O3 ceramics from high-energy ball milling powders, Mater. \nLet., 42, p.232-239, 2000 \n4. L. B. Kong, J. Ma, R.F. Zhang, W. Zhu, O. K. Tan, Lead zirconate titanate \nceramics achieved by reaction sintering of PbO and high-energy ball \nmilled (ZrTi)O2 nanosized powders, Mater. Let., 55, p. 370-377, 2002 \n5. Z. Brankovic, G. Brankovic, C. Jovalekic, Y. Maniette, M. Cilense, \nMechanochemical synthesis of PZT powders,  Mater. Sci. and Engin.A, \n345, p. 243-248, 2003 \n 11 \n6. R. N. Das, P. Pramanik, Chemical synthesis of nanocrystalline lead \nzirconate-titanate powders using tartarate precursor, Mater. Lett., 40, p. \n251-254, 1999 \n7. R. N. Das, R. K. Pati, P. Pramanik, A novel chemical route for the \npreparation of nanocrystalline PZT powder, Mater. Lett., 45, p. 350-355, \n2000 \n8. Li Guo, A. Lyashchenko, Xian-Lin Dong, Synthesis of zirconium-rich PZT \nceramics by hydroxide coprecipitation under hot-press, Mater. Lett., 56, p. \n849-855, 2002 \n9. Gang Xu, W. Weng, J. Yao, P. Du, G. Han, Low temperature synthesis of \nlead zirconate titanate powder by hydroxide co-precipitation, Microelec. \nEngin., 66, p. 568-573, 2003 \n10. B. Guiffard, M. Troccaz, Low temperature synthesis of stoichiometric and \nhomogeneous lead zirconate titanate powder by oxalate and hydroxide \ncoprecipitation, Mat. Resear. Bull., 33, p. 1759-1768, 1998 \n11. I. R. Abothu, Shi-Fang Liu, S. Komarneni, Q. H. Li, Processing of \nPb(Zr0.52Ti0.48)O3 (PZT) ceramics from microwave and conventional \nhydrothermal powders, Mat. Resear. Bull., 34, p. 1411-1419, 1999 \n12. M. Traianidis, C. Courtois, A. Leriche. Mechanism of PZT crystallisation \nunder hydrothermal conditionsDevelopment of a new synthesis route, J. of \nthe Europ. Ceram, Societ., 20, p. 2713-2720, 2000 \n13. M. Traianidis, C. Courtois, A. Leriche, B. Thierry, Hydrothermal synthesis \nof lead zirconium titanate (PZT) powders and their characteristics, J. of \nThe Europ. Ceram. Societ., 19, p. 1023-1026, 1999 \n 12 \n14. Seung-Beom Cho, M. Oledzka, R. E. Riman, Hydrothermal synthesis of \nacicular lead zirconate titanate (PZT), J. of Cryst. Growth., 226, p. 313-\n326, 2001 \n15. B. Fegley, E. A. Barringer, Synthesis and characterisation of monosized \ndoped TiO2 powders, J. Am. Ceram. Soc., 67, p. 113-116, 1984  \n16. Xiaoheng Liu, An improvement on sol-gel method for preparing ultrafine \nand crystallized titania powder, Mat. Sci. and Engin.A, 289, p.241-245, \n2000 \n17. An-Wu Xu, The Preparation, Characterization, and their Photocatalytic \nActivities of Rare-Earth-Doped TiO2 Nanoparticles, J. Of Catalysis, 207, p. \n151-157, 2002 \n18. Yang Chuanfang, Production of ultrafine ZrO2 and Y-doped ZrO2 powders \nby solvent extraction from solutions of perchloric and nitric acid with tri-n-\nbutyl phosphate in kerosene, Powder Technology, 89, p. 149-155, 1996 \n19. Sei-ichi Suba, Synthesis of MgO–SiO2 and CaO–SiO2 amorphous powder \nby sol–gel process and ion exchange, J. Non-Cryst. Sol., 255, p. 178-184, \n1999 \n20. Takashi Ogihara, Hirohisa Kaneko, Nobuyasu Mizutani, Preparation of \nmonodispersed lead zirconate-titanate fine particles, J. of Mater. Scin. \nLet., 7 , p. 867-869, 1988 \n21. Q. F. Zhou, Nanocrystalline powder and fibres of lead zirconate titanate \nprepared by the sol-gel process, J. of Mater. Proc. Tech., 63, p. 281-285, \n1997 \n 13 \n22. C.D.E. Lakeman, D. A. Payne, Processing effects in the sol-gel \npreparation of PZT dried gels, powders, and ferroelectric thin-layers, J. \nAm. Ceram. Soc, 75, p. 3091-3096, 1992 \n23. W. D. Yang., PZT\/PLZT ceramics prepared by hydrolysis and \ncondensation of acetate precursors, Ceram. Intern., 27, p.373-384, 2001 \n24. L. Weng, X. Bao, K. Sagoe-Crentsil, Effect of acetylacetone on the \npreparation of PZT materials in sol–gel processing, Mat. Sci. And Engin.B, \n96, p. 307-312, 2002 \n25. Fu-Ping Wang, Yan-Ju Yu, Zhao-Hua Jiang, Lian-Cheng Zhao, Synthesis \nof Pb1-xEux(Zr0.52Ti0.48)O3 nanopowders by a modified sol–gel process \nusing zirconium oxynitrate source, Mater. Chem. And Phys., 77, p. 10-13, \n2002 \n26. H. Brunckova, L. Medvecky, J. Briancin, K. Saksi, Influence of hydrolysis \nconditions of the acetate sol–gel process on the stoichiometry of PZT \npowders, Ceramics. International., 30, p 453-460, 2004 \n27. Hiromitsu Kozuka, Atsushi Higuchi, Single-layer submicron-thick BaTiO3 \ncoatings from PVP-containing sols: Gel-to-ceramic film conversion, \ndensification, and dielectric properties, J. Mater. Res., 16, p. 3116-3123, \n2001 \n28. Young Ho Rho, Kiyoshi Kanamura, Minori Fujisaki, Jun-ichi Hamagami, \nSei-ichi Suda, Takao Umegaki, Preparation of Li4Ti5O12 and LiCoO2 thin \nfilm electrodes from precursors obtained by sol–gel method, Solid State \nIonics, 151, p.151-157, 2002 \n 14 \n29. Mao-ping Zheng, Ming-yuan Gu, Yan-ping Jin, Hong-hua Wang, Pin-fang \nZu, Ping Tao, Ji-bao He, Effects of PVP on structure of TiO2 prepared by \nthe sol-gel process, Mat. Sci. and Engin B. 87, p. 197-201, 2001 \n30. Franck Rataboul, Ce´line Nayral, Marie-Jose´ Casanove, Andre´ \nMaisonnat, Bruno Chaudret, Synthesis and characterization of \nmonodisperse zinc and zinc oxide nanoparticles from the organometallic \nprecursor [Zn(C6H11)2], J. Organ. Chem., 643–644, p. 307-312, 2002 \n31. H. Kozuka, M. Kajimura, Single – Step Dip Coating of Crack– ree BaTiO3 \nFilms > 1 µm Thick: Effect of Poly(vinylpyrrolidone) on Critical Thickness, \nJ. Am. Ceram. Soc., 83, p. 1056-62, 2000 \n32. Hiromitsu Kozuka, Atsushi Higuchi, Single–layer submicron–thick BaTiO3 \ncoatings from poly(vinylpyrrolidone)–containing sols: Gel–to–ceramic film \nconversion, densification, and dielectric properties, J. Mater. Res., 16, p. \n3116-3123, 2001 \n33. Aiying Wu, Isabel M. Miranda Salvado, Paula M. Vilarinho, João L. \nBaptista, Lead Zirconate Titanate Prepared From Different Zirconium and \nTitanium Precursors by sol-gel, J. Am. Ceram. Soc, 81, p. 2640-2644, \n1998 \n34. Y.Z. Chen, J. MA, L. B. Kong, R.F. Zhang, Seeding in sol-gel process for \nPb(Zr0.52Ti0.48)O3  powder fabrication, Mat. Chem. and Phys., 75, p. 225-\n228, 2002 \n35. Aiying Wu, Paula M. Vilarinho, Isabel M. Miranda Salvado, João L. \nBaptista, Sol – Gel Preparation of Lead Zirconate Titanate Powders and \n 15 \nCeramics: Effect of Alkoxide Stabilizers and Lead Precursors, J. Am. \nCeram. Soc., 83, p. 1379-1385, 2000 \nFigures captions. \n \nFigure 1. Preparation route of PZT-PVP gel.  \nFigure 2a. Preparation route A for PZT powder. No PVP was added as a \nsecondary stage. \nFigure 2b. Preparation route B for PZT powder. PVP was added as a \nsecondary stage. \nFigure 3a. SEM micrograph of PZT powder. No PVP was added as secondary \nstage. Burn out at 500 oC for 1h.  \nFigure 3b. SEM micrograph of PZT powder. No PVP was added as secondary \nstage. Burn out at 500 oC for 1h.  \nFigure 3c. Size distribution in volume of PZT powder. No PVP was added as \nsecondary stage. Burn out at 500 oC for 1h.  \nFigure 4a. SEM micrograph of PZT powder. PVP added as secondary stage. \nBurn out at 500 oC for 1h.  \nFigure 4b. SEM micrograph of PZT powder. PVP added as secondary stage. \nBurn out at 500 oC for 1h.  \nFigure 4c. Size distribution in volume of PZT powder. PVP added as \nsecondary stage. Burn out at 500 oC for 1h.  \nFigure 5a. SEM micrograph of PZT powder. PVP added as secondary stage. \nBurn out at 550 oC for 24h.  \nFigure 5b. SEM micrograph of PZT powder. PVP added as secondary stage. \nBurn out at 550 oC for 24h.  \n 16 \nFigure 5c. Size distribution in volume of PZT powder. PVP added as \nsecondary stage. Burn out at 550 oC for 24h.  \nFigure 6a. XRD diagram of PZT powder. No PVP was added as secondary \nstage. Burn out at 500 oC for 1h. \nFigure 6b. XRD diagram of PZT powder. PVP added as secondary stage. \nBurn out at 500 oC for 1h. \nFigure 6c. XRD diagram of PZT powder. PVP added as secondary stage. \nBurn out at 550 oC for 24h. \nFigure 7a. DSC diagrams of PZT sol and PVP polymer with average \nmolecular weight 1 300 000 \nFigure 7b. DSC diagrams of PZT-PVP gel (i) and PZT-PVP gel (II).  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 17 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 1. \n \n \n \n \n \n \n \n \n \nWater \nPZT- PVP Gel (i) \nZr(OCH2CH2CH3)4 Ti(OCH(CH3)2)4 \n \nHeating and  \nStirring for 3h \nVacuum Oven \n100 oC for 24 h \nPb(OOCCH3)2•3H2O \nPb(OOCCH3)2 \nZr,Ti sol \nHeating and \nStirring for 3h \nPZT Sol PVP \nStirring  \nPZT-PVP Sol \n 18 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n       Figure 2a. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n            Figure 2b. \n \n \n \n \n \n \n \n \n \nDry and Burn \n Out Stage \nPZT Powder \nPVP \nPZT- PVP Gel (i) \nPZT- PVP Gel (i) \nDry and Burn \n Out Stage \nPZT- PVP Gel (ii) \nPZT Powder \n 19 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3a. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3b. \n \n \n \n \n \n \n \n 20 \n \n \n Size distribution(s) \n50 100 500 1000 5000 10000\nDiameter (nm) \n10 \n20 \n30 \n40 \n50 \n%\n \nin\n \nv\no\nlu\nm\ne \n \n \nFigure 3c \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 21 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4a. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4b \n \n \n \n \n \n \n \n \n \n \n \n 22 \n \n \n \n50 100 500 1000 \n%\n \nin\n \nv\no\nlu\nm\ne \n50 \n40 \n30 \n20 \n10 \nSize distribution(s) \nDiameter (nm) \n \n \nFigure 4c \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 23 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 5a. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 5b \n \n \n \n \n \n \n \n 24 \n \n \n Size distribution(s) \n50 \n%\n \nin\n \nv\no\nlu\nm\ne \n40 \n30 \n20 \n10 \n50 100 500 1000 \nDiameter (nm) \n \n \nFigure 5c \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 25 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 6a \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 6b \n \n \n \n \n \n \n• Perovskite \no Pyrochlore \n2-theta \n 20 30 40 50 60 \n• Perovskite \no Pyrochlore \n2-theta \n20 30  40  50 60 \n 26 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 6c \n \n \n \n-15\n-5\n5\n0 25 50 75 100\nTime in min\nH\nea\nt F\nlo\nw\n \nin\n \nm\nW\n\/g\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\nTe\nm\npe\nra\ntu\nre\n \nin\n \nC\nPZT sol\nPVP 1 300 000\nTemperature\n \n \nFigure 7a \n \n• Perovskite \no Pyrochlore \n2-theta \n 20  30  40  50   60 \n 27 \n \n \n-15\n-5\n5\n15\n25\n35\n0 25 50 75 100\nTime in min\nHe\nat\n \nFl\no\nw\n \nin\n \nm\nW\n\/g\n0\n50\n100\n150\n200\n250\n300\n350\n400\n450\n500\nTe\nm\npe\nra\ntu\nre\n \nin\n \nC\nPZT-PVP gel(i) \nPZT-PVP gel (ii)\nTemperature\n \n \nFigure 7b \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"}