{"doi":"10.1080\/17496530802481722","coreId":"65203","oai":"oai:dro.dur.ac.uk.OAI2:6530","identifiers":["oai:dro.dur.ac.uk.OAI2:6530","10.1080\/17496530802481722"],"title":"Global ethics for social work : problems and possibilities - papers from the Ethics & Social Welfare Symposium, Durban, July 2008.","authors":["Banks, Sarah","Hugman, Richard","Healy, Lynne","Bozalek, Vivienne","Orme, Joan"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11-01","abstract":"This piece comprises short presentations given by contributors to a symposium organized by the journal Ethics & Social Welfare on the theme of global ethics for social work. The contributors offer their reflections on the extent to which universally accepted international statements of ethical principles in social work are possible or useful, engaging with debates about cultural diversity, relativism and the relevance of human rights in non-Western countries","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65203.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6530\/1\/6530.pdf","pdfHashValue":"635a7b2c1a6905360f8344b8a15db4d8ceb1016b","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6530<\/identifier><datestamp>\n      2010-08-05T09:26:49Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Global ethics for social work : problems and possibilities - papers from the Ethics & Social Welfare Symposium, Durban, July 2008.<\/dc:title><dc:creator>\n        Banks, Sarah<\/dc:creator><dc:creator>\n        Hugman, Richard<\/dc:creator><dc:creator>\n        Healy, Lynne<\/dc:creator><dc:creator>\n        Bozalek, Vivienne<\/dc:creator><dc:creator>\n        Orme, Joan<\/dc:creator><dc:description>\n        This piece comprises short presentations given by contributors to a symposium organized by the journal Ethics & Social Welfare on the theme of global ethics for social work. The contributors offer their reflections on the extent to which universally accepted international statements of ethical principles in social work are possible or useful, engaging with debates about cultural diversity, relativism and the relevance of human rights in non-Western countries.<\/dc:description><dc:subject>\n        Global ethics<\/dc:subject><dc:subject>\n         Social work ethics<\/dc:subject><dc:subject>\n         Universalism<\/dc:subject><dc:subject>\n         Human rights<\/dc:subject><dc:subject>\n         Cultural relativism.<\/dc:subject><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Ethics and social welfare, 2008, Vol.2(3), pp.276-290 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6530<\/dc:identifier><dc:identifier>\n        issn:1749-6535<\/dc:identifier><dc:identifier>\n        issn: 1749-6543<\/dc:identifier><dc:identifier>\n        doi:10.1080\/17496530802481722 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6530\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/17496530802481722 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6530\/1\/6530.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1749-6535","issn: 1749-6543"," 1749-6543","1749-6535"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Global ethics","Social work ethics","Universalism","Human rights","Cultural relativism."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n05 August 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBanks, Sarah and Hugman, Richard and Healy, Lynne and Bozalek, Vivienne and Orme, Joan (2008) ’Global\nethics for social work : problems and possibilities - papers from the Ethics Social Welfare Symposium,\nDurban, July 2008.’, Ethics and social welfare., 2 (3). pp. 276-290.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/17496530802481722\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nGlobal Ethics for Social Work: Problems and \nPossibilities \n \nPapers from the Ethics and Social Welfare Symposium, \nDurban, July 2008  \n \n \nSarah Banks, Richard Hugman, Lynne Healy, Vivienne Bozalek and Joan \nOrme \n \n \n \n \nRevised version, 4.09.08 \n \n \n \n \n \nCorresponding author: \n \nSarah Banks, School of Applied Social Sciences, Durham \nUniversity, New Elvet, Durham, DH1 3JT, UK. E-mail: \ns.j.banks@durham.ac.uk  \n 2 \nGlobal Ethics for Social Work: Problems and Possibilities \n \nPapers from the Ethics and Social Welfare Symposium, Durban, \nJuly 2008  \n \n \nSarah Banks1, Richard Hugman2, Lynne Healy3, Vivienne Bozalek4 and Joan \nOrme5 \n \n \nThis piece comprises short presentations given by contributors to a \nsymposium organised by the journal Ethics and Social Welfare on the \ntheme of global ethics for social work. The contributors offer their \nreflections on the extent to which universally accepted international \nstatements of ethical principles in social work are possible or useful, \nengaging with debates about cultural diversity, relativism and the \nrelevance of human rights in non-western countries. \n \nKey words: global ethics, social work ethics, universalism, human rights, \ncultural relativism \n \n \nIntroduction \n \nSarah Banks \n \nThe journal sponsored a symposium at the 34th Biennial Congress of the \nInternational Association of Schools of Social Work held in Durban, South Africa \nfrom 20th to 24th July 2008. The theme of the congress was Transcending Global-\nLocal Divides. We decided to organize the symposium to give particular \nconsideration to the role of international statements on ethics in social work. \nSeveral members of the editorial and advisory boards of the journal had been \ninvolved in drafting the joint statement of ethical principles agreed by the \nInternational Federation of Social Workers (IFSW) and International Association \nof Schools of Social Work (IASSW) in 2004. This statement is due to be reviewed \n                                                 \n1 Sarah Banks is Professor in the School of Applied Social Sciences, Durham University, UK and \nco-editor of the journal Ethics and Social Welfare. E-mail: s.j.banks@durham.ac.uk  \n2\n Richard Hugman is Professor of Social Work, School of Social Sciences and International \nStudies, University of New South Wales, Sydney, Australia.  E-mail: r.hugman@unsw.edu.au.  \n3\n Lynne M. Healy is Professor, University of Connecticut School of Social Work, USA. E-mail: \nLynne.healy@uconn.edu \n4\n Vivienne Bozalek is Professor in Social Work at the University of Western Cape, South Africa. \nE-mail: vbozalek@uwc.ac.za \n5\n Joan Orme is Professor Emerita of Social Work, University of Glasgow, UK. E-mail: \nj.orme@socsci.gla.ac.uk \n \n 3 \nduring the next two years leading to a revised version in 2010. We are very \naware that all such international statements have their critics and their \nadvocates. This statement is relatively brief and remains at the level of general \nprinciples, clustered around two overarching principles of respecting and \npromoting human rights and social justice We know from previous consultations \nin 2004 that there are some who feel the IFSW\/IASSW statement is too ‘western’ \nin its language and approach (particularly the language of universal principles, \nindividual rights and self-determination). Indeed, the question has been raised as \nto whether such an international statement with universal relevance is either \npossible or desirable. On the other hand, equally cogent arguments have been \nmade that the language of universal human rights is very important, especially in \ncontexts where inhumane treatment, such as torture, imprisonment without trial \nor denial of benefits to asylum seekers, is taking place, and in which social \nworkers may be implicated or involved. \n      \nThe aim of the symposium was to engage four key speakers and our audience in \ncritical dialogue and debate about the possibilities and problems of international \nstatements on ethics in social work. Four questions were identified in advance \naround which to focus our discussion as follows:   \n \n1. What role, if any, can international statements on ethics in social work play in \npromoting social justice? \n2. Does 'rights' talk get in the way or is it essential for an international \nstatement?  \n3. Must recognition of cultural diversity lead to ethical relativism or is it \ncompatible with a modified form of universalism in ethics? \n4. What are the implications of these debates for the framing of international \nstatements on ethics, such as the current IASSW\/IFSW document?  \n \nIn this account of the symposium, we include accounts of the short presentations \nmade by our four speakers (Richard Hugman, Lynne Healy, Vivienne Bozalek \nand Joan Orme), a summary of some of the key points from the discussion and \nconcluding comments by the chair of the symposium (Sarah Banks). We hope \nthis will contribute to the debate on these issues and, in particular, to the process \nof revising the international statement on ethics in social work.    \n \n \n1. Ethics in a World of Difference \n \nRichard Hugman \n \nIn an article that I published recently in this journal (Hugman, 2008) I began by \ncommenting that international statements about social work ethics have been \ncriticized as imposing western values in non-western contexts.  I identified two \nforms of this criticism in recent literature, one ‘strong’ in that it calls for each \ncultural context to generate its own relevant values, exemplified in a recent article \n 4 \nby Yip (2004), the other ‘qualified’ in that while it seeks basic common values it \ncalls for these to be interpreted with cultural sensitivity, exemplified in a recent \narticle by Healy (2007). Such arguments raise a particular problem with the \nnotion of human rights as a foundation for social work ethics.  In response, I \nsuggested in the article that the idea of a plurality of values is more fruitful and \nthe concept of ‘human capabilities’ (Nussbaum, 2000) could be regarded as a \nbasis for dialogue about values that cross cultural differences.   \nAt the symposium I developed further some of the arguments articulated in the \narticle, suggesting that international statements have a role to play in the form of \nguidance that has to be understood and responded to in context. I argued that \n‘rights talk’ is useful if it is understood as a means to assisting people to live a \n'fully human life' (Nussbaum, 2000). It creates argument in so far as it either \nexposes vested interests in maintaining relationships that are to the benefit of \nsome at the detriment of others (which it correctly challenges) or when it imposes \none view of the good life inappropriately on another culture or world-view (when it \nmust be reconsidered).  It is the reconsideration in such a way as not to \nundermine the idea of rights as the expectation of a fully human life that is \ndifficult.  \n \nIn response to the question about whether recognition of cultural diversity \nnecessarily leads to ethical relativism, or whether it is compatible with a modified \nform of universalism in ethics, I made the following point: cultural diversity is \nseparate from ethical relativism - the latter is neither necessary nor helpful, while \nthe former is both.  Ideas of ethical pluralism may help us, but these are complex \nand we have only just started to think them through in social work. \n \nI then commented on the implications of these debates for the framing of \ninternational statements on ethics, such as the current IFSW\/IASSW (2004) \ndocument. I argued that it means that we must find better ways to maintain and \ndevelop dialogue in which different voices can be heard, which seek to find new \nways to approach the core values that the profession shares across cultural \ndifferences. \n \n \n2) Global Ethical Principles: Universalism and Complexities of Meaning \n \nLynne Healy \n \nIn the 2007 article referred to by Richard Hugman, I presented a brief case \nvignette in order to explore the complexities of ethical decision making in the \ncontext of the universalism-relativism debate (Healy, 2007). The follow up \ndiscussion of the case in the article by Richard Hugman (2008) and the additional \nquestions he raised, continued the dialogue about universality and underscored \nthe core point that complexities face social work practitioners as they wrestle with \nethical dilemmas. The extent to which social work ethical principles are \nuniversally applicable is also being examined as prelude to reconsideration of the \n 5 \n2004 document, Ethics in Social Work, Statement of Principles by IFSW and \nIASSW. In this brief commentary, I raise two additional issues for consideration \nregarding universality. These are prioritizing values when they are in conflict, and \ndiscerning the meaning attached to the principles by service users in diverse \ncontexts. Thus, even if the profession agrees on a set of universal values or \nethical principles, there may be culturally based disagreements over the meaning \nof these principles and how they should be prioritized. \n \nPractitioners are bombarded with legal mandates, agency regulations and \nprocedures, and the often competing values expressed in the profession’s ethical \ndocuments. Even the relatively brief joint IFSW\/IASSW document identifies a \nnumber of core ethical principles. Challenges arise when all principles cannot be \noptimized. One approach to competing values is to rank order them in a \nhierarchy of principles that can be used in situations when multiple principles \nconflict (Harrington and Dolgoff, 2008).  The hierarchy of principles proposed by \nDolgoff, Loewenberg and Harrington (2005) identifies and rank orders seven \nethical principles: preservation of life; equality; autonomy and freedom; least \nharm; quality of life; privacy\/confidentiality; and truthfulness and full disclosure. A \nsingle case may involve some or even all seven principles (as in the case \ndiscussed in Healy, 2007). Recent informal research indicates ‘very little \nconsensus on the ordering of the ethical principles’ but general support for the \nuse of value hierarchies (Harrington and Dolgoff, 2008, p. 190). It is likely that \nculture and context influence rank ordering of ethical principles even when there \nis agreement on the importance of the principles themselves. Thus national \nprofessional associations may wish to consider more particularized value \nscreens or hierarchies, ‘prioritizing the universal values in a more culturally \nrelevant hierarchy’ (Healy, 2007, p. 24). \n \nAdditionally, social workers and service users\/clients may attach different \nmeanings to some of the ethical principles, adding a further layer of complexity in \nconsidering whether principles can be universally applied. In utilizing global \nethical statements, it is important to ask whether the important ethical principles \nin fact mean the same in all contexts. Or, is the challenge to determine their \nmeaning to the service users, whether individuals or communities? The ethical \npractitioner should be encouraged to search with the service user or client for the \nmeaning attached to the principles or rights involved. The principle of avoiding \ndoing harm is particularly interesting. Indeed, Harrington and Dolgoff’s (2008) \ninformal research identified least harm as the highest ranked ethical principle \nwhen rank orderings were averaged. Yet least harm and quality of life are \nprinciples that are particularly difficult to apply universally. Drawing on the \nexample of social work in situations of domestic violence, it is possible that the \nsame professional practice or actions cause different levels of harm to the \nservice user, depending on the meaning she attaches to independence, agency, \nand affiliation. These meanings in part derive from cultural context. \n \n 6 \nSocial work ethics have been linked to human rights concepts and the \ndiscussions over universalism\/relativism are therefore tied to similar debates \nwithin the human rights arena. Hugman (2008) explores the work of Nussbaum \n(2000) on the capabilities approach as an alternative to human rights. While \ninteresting, I do not find that the capabilities approach resolves the dilemma of \nconflicting and competing values or the issue of assigning meaning to core \nconcepts in diverse cultures. In practice in domestic abuse situations, for \nexample, capabilities for a life with bodily integrity and for a life with affiliations \nraise the same tensions as are embedded in applying a human rights \nperspective.  \n \nAs we move forward with a review and possible revision of the international \nstatement of ethical principles for social work, the perspective of culturally aware \nuniversalism may best suit the profession. I hope views on wording and meaning \nfrom cultures that are more communalist in their outlook will be assertively \nsolicited to ensure expression of principles in a way that captures ideas about \ncaring, reciprocity, community-building and cooperation for incorporation into \nsocial work ethical principles. This is not an endorsement of relativism nor is it \nadvocating retreat from social work’s important emphasis on human rights; rather \nit is an appreciation that defining and applying ethical principles within and \nespecially across cultures is complex. \n \nFor the practitioner, it is particularly important to be as aware as possible of the \nimpact of her or his own culture on interpretation of principles and strive to be \nopen to alternative interpretations, especially those of the service user\/client. As \na feminist from the most highly individualistic culture in the world (Hofstede, \n1980), I have moved from a position of assertive universalism to a slightly more \nmoderated stance. In practice, this would mean promoting universal rights or \nperhaps, capabilities, while recognizing culture as one of those rights and \nacknowledging that my definition and valuation of harm and quality of life may \ndiffer from those of others. As the revised ‘golden rule’ states, we should treat \nothers not as we wish to be treated but as they wish to be treated. \n \n \n3) The Role of International Statements on Ethics in Social Work in \nPromoting Social Justice \n \nVivienne Bozalek \n \nI agree with Richard Hugman that international statements are important in \npromoting social justice for social work. Such statements can provide a form of \naccountability for social workers towards service users and for the profession as \na whole. These statements also set minimum standards that are helpful for social \nworkers, particularly, for example, in countries where there are abuses of human \nrights.  In these contexts international statements can be called upon in order to \nadvocate for better arrangements and conditions for both service users and \n 7 \nproviders.  For example, historically, social work in South Africa was developed \nto alleviate the poor white problem in the 1930s by the architect of apartheid, \nHendrik Verwoed, well known for his racist and anti-Semitic ideas. Social work in \nSouth Africa was thus a racially exclusive system associated with Afrikaner \nnationalism. International statements of ethics based on notions of social justice \nin social work could have been used to legally challenge such abuses of human \nrights which excluded groups of citizens, which in the South African case was the \nmajority of the population.  \n \nInternational statements are also useful in that they can be used to strengthen \nsocial workers’ positions in locations where they may be co-opted by corrupt \nstates.  In apartheid South Africa, social workers were complicit in removing \nbabies from mothers who were anti-apartheid activists detained for their political \nbeliefs and activities as a form of punishment for these mothers. Those in \ndetention were not able to challenge these abuses of their rights, as they did not \nhave access to international statements on ethics to defend and promote their \nrights.  Similarly, international human rights documents were developed in \nresponse to complicit behaviour by medical practitioners in concentration camps \nin Nazi Germany (Sevenhuijsen, 2003a) and in prisons under the apartheid \nregime.(see Baldwin-Ragaven et al, 1999 for more details on this) \n \nWhile acknowledging the positive contribution that international ethical \nstatements can play there are, however, critiques of relying solely on these \nstatements for ethical practice in social work.  I will outline some of the issues \nthat have been raised as problematic with international ethical statements and \ndiscuss how the political ethics of care as developed by Tronto (1993) and \nSevenhuisen (1998) could be used as an alternative frame of reference to \naddress these problematic areas. \n \nInternational ethics statements as legalistic \nInternational ethics statements can be regarded as legalistic, adversarial and \nmechanistic (Code, 1995; Sevenhuijsen, 2003a). This might entail having to fight \nfor one’s rights against a legal system or against someone else – and in some \ncases the outcomes may not be adequately followed through (O’ Neill, 1988). \nCodes of ethics do not always guarantee ethical behaviour. I wonder how many \nof us have sat through tedious ethics committee meetings at higher education \ninstitutions and wondered whether the ethical practice is in fact ever properly \nfollowed through after all the assurances have been given?   \n \nSelf reliance and independence as goals  \nA further problem that has been identified with international ethics statements is \nthe focus on ‘self reliance’ or having independence as the ultimate goal, with \nnon-interference rather than active intervention seen as a positive attribute \n(Sevenhuijsen, 2003a). Both Eva Kittay (2002) and Joan Tronto (2002) point out \nthat theories of justice, such as that of John Rawls (1971), upon which \ninternational ethical statements are based, fail to take dependency and care into \n 8 \naccount. The idea of ‘rational economic man’ who is disembodied, autonomous, \nindependent and equal is the normative ideal of a citizen that Rawls had in mind. \nThis man is furthermore able to enter voluntarily into exchanges of goods and \nsocial cooperation with other citizens for his own benefit. From this perspective, \nrights are regarded as a means to ensuring fairness.  \n \nAn assumption of sameness for equality \nAnother criticism of international ethical statements is that they have a limited \nability to deal with difference, otherness and plurality. A political ethic of care \nallows a vision of otherness and takes into account inequality, vulnerability, \nfiniteness and difference in human interrelationships, which a rights-based or \njustice perspective elides in its concentration on equality and sameness for all. A \nrights-based approach which assumes sameness does not provide enough \nnuances to deal adequately with the particularity of peoples’ needs. Incorporating \nhuman dependency into an idea of citizenship foregrounds the notion of \ninterdependence and relationality in that all human beings need assistance and \nare socially dependent on each other to provide the resources and means with \nwhich to meet our needs. If it is acknowledged that we are all dependent and \nneed care at various points in our lives and that caregivers as citizens should be \nprovided with the means to carry out care to the best of their ability, it follows that \nan ethically just society should provide the arrangements to make this possible.  \nThe political ethics of care proposes a relational self, continually in the process of \nchanging, which is in contrast to the universalist rights-based atomistic view of \nhumans with predetermined identities (Sevenhuijsen, 1998). \n \nThe politics of needs interpretation \nTronto (2002) raises some important questions, which arise from the political \nethic of care in relation to the distribution of resources. For example, in order to \ndecide how to distribute resources in a just way, we must first establish what \nneeds exist. However, how needs are defined and who defines the needs in a \nparticular context are contested as Nancy Fraser (1989) has pointed out in her \npolitics of needs interpretation. Tronto (2002) also alerts us to the dimensions of \npower and privilege that exist in caring relationships.  She reminds us that those \nwho are more powerfully positioned in society assume the position of demanders \nof care, whilst at the same time underplaying their dependency on others. She \nsuggests this is crucial to their ability to carry out responsibilities in the public \nsphere.  In terms of the care perspective, the public private is a false dichotomy \nas care impacts on one’s life in both the public and private spheres and the \nresponsibility for care provision and arrangements need to be considered from a \nsocietal and personal viewpoint. \n \nAgency versus abstract principles \nThe political ethics of care is based on the practice of care rather than a set of \nabstract principles that can be followed and takes into account responsibilities \nand relationships. It takes as its starting point the needs of the other in examining \n 9 \nwhat should be done. Rights-based approaches, in contrast, examine the \npotentialities of citizens rather than their agency in the present (Cockburn, 2005). \n \nParticularity versus universality \nWhat is regarded as adequate care will differ from one context to another.  The \npolitical ethic of care allows decisions to be made in specific situations rather \nthan applying universal principles. Both the political ethics of care and the human \ncapabilities approach as articulated by economist Amartya Sen (1999) and \nphilosopher Martha Nussbaum (2000) provide the perspective which allows one \nto ask the question: ‘what are actually concrete human beings able to do and to \nbe and what is necessary for human flourishing?’ This concrete other is \nperceived in particular circumstances and within relationships, in contrast with \nRawls’s (1971) ‘generalised other’ about whose circumstances and preferences \nnothing is known (Benhabib,1992). Nussbaum (2000) has identified ten basic \nhuman capabilities, without which she maintains that one would not be able to \nachieve a fully human life. These are: life; bodily health; bodily integrity; senses, \nimagination and thought; emotions; practical reason; affiliation; other species; \nplay; and control over one’s environment.     \n \nDialogue and voice versus the impartial view \nThe care ethic as developed by Tronto (1993) incorporates attentiveness, \nresponsibility to act on caring needs, competence and responsiveness.  \nSevenhuijsen (1998; 2003b) has added trust, which has to do with conditions of \nvulnerability. Good caring practice requires negotiation and dialogue between \nthose giving and receiving care, rather than an abstract, impartial view as \nrequired by rights-based approaches. Service users can discuss the sorts of \nresources and assistance that they would need.  The political care ethic draws \nattention to the voice of both the caregivers and the care receivers and \nforegrounds the narrative process of needs deliberation. Attentiveness requires \nlistening to what people are saying in words and what they are not saying, as \nwell as paying attention to the particularity of their unique needs (Barnes and \nBrannelly, 2008, p.387). The ethics of care also involves reflexivity in that the \npractitioner has to reflect on the caring process, which is a dialogical one. \n  \n \n4) Global Ethics for Social Work: Problems and Possibilities \n \nJoan Orme \n \nMy aim is to problematise the notion of a global statement of principles, not to \nstifle debate but to provide a context for the discussion provided by others. In \nproducing the statement of principles IFSW and IASSW asserted that the \nintention was not to produce a code of ethics for social work. However there is a \ndanger that once principles are ‘agreed’ and committed to paper they become \npowerful. This is particularly the case when the document includes imperatives \nsuch as ‘social workers should…’ and calls upon members of IFSW and IASSW \n 10 \nto ‘regularly update their own codes of ethics or ethical guidelines to be \nconsistent…’ (IFSW and IASSW, 2004). \n \nThe global context of social work emphasizes the wealth of traditions that require \nto be addressed in all teaching, research and scholarship. The very notion of \nprinciples and codification has its origins in western philosophy and practice.  \nRather than concentrate on ‘consistent’ principles or guidelines an international \nassociation needs facilitate dialogue between individuals, groups and nations. If \ndocuments are to be created they should have the status of a ‘temporarily \nnegotiated agreement’ to recognize that ethics themselves are constructed in, \nand contingent upon, social, geographical and historical contexts. This can be \nproblematic when students in particular and practitioners in general have a need \nfor guidance akin to codification. This need is clearly articulated in the case \ndescribed by Lynn Healy (2007). It is precisely because of what is driving that \nneed that caution is required. As social work educators we should be facilitating \nwhat Husband calls ‘morally active practitioners’ (Husband, 1995) encouraging \nthe ‘moral impulse’ (Bauman, 1993), the personal capacity to act morally, which \narises out of responsibility to the other, and not to an employer, or a regulatory \nbody.  \n \nHowever, current trends indicate that practitioners are under pressure to act \nconsistently and predictably, as has been highlighted by recent work on \nregistration of social workers (Orme and Rennie, 2006).  In fact, the \nIASSW\/IFSW statement on Global Standards for Education and Training of the \nSocial Work Profession (adopted 2004, published 2005) suggested that the \nformulation of a code of ethics was a necessary adjunct to registration. However \nin a comparison of two countries it was identified that codes of conduct or codes \nof practice rather than codes of ethics accompanied the introduction of \nregistration. This was seen as a defensive process; part of a managerialist \napproach associated with the technicalisation of the social work profession \n(Orme and Rennie, 2006). This means that practitioners have little \nencouragement to reflect on the distinction between what Hugman (2003, p. \n1030) has called ‘acting well and acting correctly’.  \n \nTo facilitate and enable practitioners to do this, as educators we have to go \nbeyond teaching moral theories (Gray, 1995), or ‘introducing’ students to an \nalready formulated set of ethical principles. The complexity of this task has been \nhighlighted by feminist critiques of the concept of care. The ethics of care \narticulated by Tronto, Sevenhuijsen and others and discussed by Vivienne \nBozalek above is a case in point. Students and practitioners often interpret their \nresponsibility to others as an assertion that it is their ‘duty’ to care for others, \nwithout recognizing the nuances of caring that can be incorporated into \nunderstandings of ‘care’ discussed within feminist literature (Orme, 2002). \n \nThere is therefore a need to ensure that the nuances and complexities of moral \ntheory and philosophy highlighted in the forum and recorded here become an \n 11 \nintegral part of the social work curriculum.6 Because many subjects compete for \nspace, and learning and education also takes place in practice settings it is \nimperative that students, and their educators (university teachers and \npractitioners), recognize that all situations in which social workers intervene are \nmorally contentious and ambiguous and require considered reflection of the \ntheoretical complexities behind the statement rather than a formulaic application \nof the principles identified.  \n \n \n5) Notes from the discussion  \n \nCompiled by Joan Orme \n \nQuestions and comments from the floor included the following: \n \n1. The importance of language was noted, with a comment made that the \ndiscussion centred around certain dualities, including: care versus service; \nprinciples versus codes; morality versus ethical consciousness. It was \nsuggested that we need to beware of setting up false dualities. \n \n \n2. When discussing human rights we need to acknowledge who gets afforded \nthe status of a human being, in particular, who gets afforded status to make \ndecisions as a human being. Ethical principles should expand beyond human \nbeings to be meaningful in other cultures that have an affinity with the natural \nworld. \n \n3. The discussion tended to frame human rights as an individual issue, but \nstructures also have an impact. Are ethical dilemmas too often individualized, \nthat is, privatized, to individual practices with service users? We need to \npoliticise ethics. \n \n4. A comment was made about the fact that social workers who practised under \nthe apartheid regime had a code of ethics. There were also social workers \nwho were part of the liberationist struggle. The question was raised: what part \ndoes history play in how we arrive at ethical principles? \n \n5. It was suggested that ‘ethics’ as a topic is larger than human rights. There is a \nneed for focus on particular aspects such as the distinction between negative \nand positive rights and implications for ‘the political’. \n \n                                                 \n6 In the UK for example the social work qualification became a degree level qualification in \n2003.In a recent review (Department of Health, 2008) there is little evidence that moral \nphilosophy is a core part of the curriculum. \n 12 \n6. We also need more discussion about the links between social work ethics for \nand in practice and ethics in social work research. This should address \nmethodological as well as process issues. \n \n7. We were reminded that in the African context and in other countries people \nare deprived of human rights through imprisonment and being held hostage. \nThis creates dilemmas for social workers.  \n \n8. Social work is increasingly involved in rationing resources. This raises the \nquestion of how we deal with this as a profession in terms of ethical principles \ngenerally and human rights in particular. \n \nIn summing up, the presenters made brief comments as follows: \n \nLynne Healy acknowledged the breadth of the topic of human rights and drew \nattention to Jim Ife’s (2001) work. She mentioned modelling ethical principles \nthrough practice including teaching. She also commented that in the USA codes \nof ethics have helped protect social workers from being asked to be involved in \nactivities that are ethically unacceptable. \n \nVivienne Bozalek commented that the discussion of human rights issues took her \nto the work of Nancy Fraser (1989, 1997) with its attention to identity issues and \nnotions of participatory parity. In terms of history, she acknowledged that we \nneed to take cognisance of the South African experience under apartheid. \n \nRichard Hugman agreed that an historical perspective is vital, acknowledging the \nwork of Bauman (1993) and his use of history, including the experience of the \nholocaust. In considering the question: ‘Why human rights?’, he replied that the \nstress on human is because the social work profession is one which attends to \npeople. Social work starts from its concerns for the well being of the human \nworld. No human being is excluded, but ethics is about being human. Non-\nhuman animals do not have ethics. \n \nJoan Orme acknowledged the potential for the setting up of false dualities, \nhighlighting that feminist theorists drawing on Foucault had addressed this. \nIssues of power in communication are important. She also drew attention to the \nUK code of ethics for social work research, currently incorporated as part of the \nBritish Association of Social Workers’ code (BASW, 2002). \n \n \n6) Concluding Comments  \n \nSarah Banks \n \nThe process of putting together these varied and illuminating accounts of the \npresentations and responses given at the symposium has offered time for further \n 13 \nreflection on the problems and possibilities of global ethics for social work and \nthe challenges facing those of us involved in drafting and redrafting international \nethical statements. \n \nThe debates about the language and validity of the international statement on \nethics in social work clearly mirror those about the United Nations international \ndeclarations and covenants on human rights upon which the IFSW\/IASSW \nstatement is based. In striving to be internationally relevant, such statements are \ninevitably abstract and general. They are deliberately designed to be self-\nstanding, outside any particular ethical, cultural or religious tradition. In this sense \nthey are often described as ‘thin’ (Kymlicka, 2007; Walzer, 1994). They need to \nbe interpreted and implemented in specific contexts, within political regimes and \nin the light of particular ethical, cultural and religious values. Such contexts may \nbe described as ‘thick’, referring to the local identities, beliefs, values and \npractices that create, colour and condition people’s everyday lives. There is \nalways the problem of transfer and translation from the abstract principles to the \nparticular context. The universal principles need to be ‘thin’ to be acceptable to \nall. Yet their very ‘thinness’ means they are open to wide interpretation. \nFurthermore, despite the fact that these principles are designed to be framed in a \n‘thin’ universal language, acceptable to all, many critics object that the language \nand concepts used to frame these international statements are, in fact, based in \nwestern liberalism, Christianity or secularism. The emphasis on individual rights \nand freedoms is expressive of a worldview rooted in western liberal democracies, \nand thus can be regarded as a continuation of the colonial imposition of the ideas \nand ways of life of one part of the world on other parts that do not necessarily \nshare these values. \n \nDespite these debates and critiques, the idea of universal declarations and \ncovenants and the language of international human rights have persisted since \nthe Universal Declaration of Human Rights in 1948. Later declarations and \ncovenants (for example, on civil and political rights, on social, economic and \ncultural rights, and on the rights of the child) have involved greater representation \nof different countries of the world in their formulation. Whilst they are imperfect \ndocuments, and adherence to their principles (however interpreted) is patchy, \nthey clearly play a role in attempts to create a ‘world community’ and an arena in \nwhich debates about minimum standards of right, wrong, good and bad can take \nplace.  Interestingly, in recent years, there has been a number of statements on \nhuman rights produced that contextualise human rights in particular regions of \nthe world or in particular religions (see, for example, the Universal Islamic \nDeclaration of Human Rights (1980) and the Asian Human Rights Charter \n(1998), reproduced in Sullivan and Kymlicka, 2007). These documents are \nframed in terms of human rights and in the most part embody very similar \nprinciples to those of the various United Nations declarations, but have more \nemphasis on cultural and religious identities. In the case of the Islamic \ndeclaration, many of the rights are grounded in Islamic teaching and law. This \nsuggests that the language of human rights has become broadly accepted and is \n 14 \nregarded as useful, provided we recognise that it is a specially constructed \nlanguage designed to promote international dialogue on balancing the needs, \ninterests and capabilities of individuals, families, groups and states. The concept \nof ‘international human rights’ should not be equated with that of ‘individual rights’ \nin western liberal theory.  \n \nKymlicka (2007, p. 4) suggests we should regard global ethics as a two-level \nphenomenon. On one level it comprises a self-standing international discourse \n(such as that of human rights) defining a set of minimum standards agreeable to \nall. At the second level there is a range of ethical traditions each of which has its \nown account of what is needed over and above human rights. He argues that any \ncoming together at the second level will be the outcome of a slow process of \nlearning and mutual exchange. This suggests the importance of a process of \nconstructive dialogue, and ties with the aims of the 2004 IFSW\/IASSW \nstatement, which include promoting ethical reflection and debate and developing \nethical awareness.  It may seem strange, if the aim is to promote dialogue, that \nthe statement takes the form of a set of principles offering prescriptions for \naction. However, just as we recognize that there is a special human rights \ndiscourse that provides the content of the dialogue, we also need to accept that \nthe form of international ethics documents that has evolved is that of a \nprescriptive declaration or statement. Neither the content nor the form can be \ntaken literally. Just like the more familiar national codes of professional ethics, \nthe purposes of international ethics statements are not quite what they seem \n(Banks 2003). In addition to prescribing and guiding action, such documents are \nalso rhetorical, aspirational, educational, dialogue-promoting, provocative, self-\ncontradictory and, above all, constantly evolving.  \n \nIn the context of this discussion, social work can also be viewed on two levels.  \nOn one level, it is a professional practice necessarily rooted in particular nation-\nstates, cultures, legal and policy frameworks. At another level it is also an \ninternational social movement, concerned to work for social justice worldwide. \nThe international statement on ethics embodies both these senses of social work \nand contributes to dialogue about values, practices and ideals across \nboundaries. Hopefully the next iteration of the international statement on ethics \nfor social work will reflect more clearly the ‘culturally aware universalism’ referred \nto earlier by Lynne Healy, or, to use Appiah’s (2007) phrase, the ‘rooted \ncosmopolitanism’ that is reflective of the current work of IFSW and IASSW.  \n \n \nReferences \n \nAppiah, K.A. (2007) Cosmopolitanism: Ethics in a World of Strangers, Penguin, \nLondon.  \nBanks, S. (2003) 'From oaths to rulebooks: a critical examination of codes of \nethics for the social professions', European Journal of Social Work, Vol. 6, \nno. 2, pp. 133-44. \n 15 \nBarnes, M. and Brannelly, T. (2008) ‘Achieving Care and Social Justice for \nPeople with Dementia’, Nursing Ethics, Vol.15, no. 3, pp.384-395. \nBauman, Z. (1993) Postmodern Ethics, Blackwell, Oxford UK and Cambridge, \nMA. \nBenhabib, S.(1992) Situating the Self: Gender, Community and Postmodernism \nin Contemporary Ethics, Polity Press, Cambridge. \nBritish Association of Social Workers (2002) The Code of Ethics for Social Work, \nBirmingham, BASW.  \nCockburn, T. (2005) ‘Children and the Feminist Ethic of Care’, Childhood, Vol. \n12, no. 1, pp.71-89. \nCode, L. (1995) Rhetorical Spaces, Gendered Locations, Routledge, London. \nDahlberg, G. and Moss, P. (2005) Ethics and Politics in Early Childhood \nEducation, RoutledgeFalmer, London. \nDepartment of Health (2008) Evaluation of the new Social Work Degree in \nEngland,  Department of Health, London. \nDolgoff, R., Loewenberg, F.M. and Harrington, D. (2005) Ethical Decisions for \nSocial Work Practice,  Brooks\/Cole, Belmont, CA. \nFraser, N. (1989) Unruly Practices: Power, Discourse and Gender in \nContemporary Social Theory, Polity Press, Oxford. \nFraser, N. (1997) Justice Interruptus: Critical Reflections on the “Postsocialist” \nCondition, Routledge, London. \nFraser, N. (2000) ‘Rethinking Recognition’, New Left Review, Vol.3, pp. 107-120. \nGray, M. (1995) ‘The Ethical Implications of Current Theoretical Developments in \nSocial Work’ British Journal of Social Work, Vol.  25, no. 1, pp. 55-70. \nHarrington, D. and Dolgoff, R. (2008) ‘Hierarchies of ethical principles for ethical \ndecision-making in social work’, Ethics and Social Welfare, Vol. 2, no. 2, pp. \n183-196. \nHealy, L.M. (2007) ‘Universalism and relativism in social work ethics’, \nInternational Social Work, Vol. 50, no. 1, pp. 11-26. \nHofstede, G. (1980) ‘Motivation, leadership, and organization:  Do American \ntheories apply abroad?’ Organizational dynamics, Vol. 9, no. 1, pp. 42-63. \nHugman, R. (2003) ‘Professional Values and Ethics in Social Work: \nReconsidering Postmodernism’ British Journal of Social Work, Vol. 33, no.8, \npp.1025-42. \nHugman, R. (2008) ‘Ethics in a world of difference’, Ethics & Social Welfare, Vol. \n2, no. 2, pp. 118-132. \nHusband, C. (1995) ‘The Morally Active Practitioner’ in R. Hugman and  D. Smith \n(eds) Ethical Issues in Social Work, Routledge, London. \nIfe, J. (2001) Human Rights and Social Work: Towards Rights-based Practice, \nCambridge University Press, Cambridge.  \nInternational Association of Schools of Social Work (IASSW) and International \nFederation of Social Workers (IFSW) (2005) Global Standards for the \nEducation and Training of the Social Work Profession, accessed from \nwww.ifsw.org, July 2008. \n 16 \nInternational Federation of Social Workers (IFSW) and International Association \nof Schools of Social Work (IASSW) (2004) Ethics in Social Work: Statement \nof Principles, accessed from www.ifsw.org, July 2008. \nKittay, E. F. (2002) ‘From Welfare to a Public Ethic of Care’, in M. Friedman (ed.) \nWomen and Citizenship, Rutgers University Press, New Jersey. \nKymlicka, W. (2007) 'Introduction: The Globalisation of Ethics', in W. Sullivan and \nW. Kymlicka (eds), The Globalisation of Ethics, Cambridge University \nPress, Cambridge, pp. 1-16.  \nNussbaum, M.(2000) Women and Human Development: The Capabilities \nApproach, Cambridge University Press, Cambridge. \nO’Neill, O.(1996) Towards Justice and Virtue. A Constructive Account of Practical \nReasoning, Cambridge University Press, Cambridge. \nOrme, J. (2002) ‘Social Work: Gender, Care and Justice’, British Journal of \nSocial Work, Vol. 32, no. 6, pp. 799-814. \nOrme, J. & G. Rennie (2006) ‘The role of registration in ensuring ethical practice’ \nInternational Social Work, Vol. 49, no. 3, pp. 333-344. \nPlumwood, V. (1993) Feminism and the Mastery of Nature, Routledge, London \nand New York. \nRawls, J. (1971) A Theory of Justice, Belknap Press,  Cambridge MA. \nSen, A. K. (1984) Resources Values and Development, Blackwell, Oxford. \nSen, A. K. (1995) ‘Gender Inequality and Theories of Justice’. In Martha \nNussbaum and Jonathon Glover (eds.) Women, Culture and Development. \nA study of human capabilities, Clarendon Press, Oxford. \nSen, A. K. (2001) Development as Freedom, Oxford University Press, \nOxford\/New York. \nSevenhuijsen, S. (1998) Citizenship and the Ethics of Care. Feminist \nConsiderations on Justice, Morality and Politics, Routledge, London and \nNew York. \nSevenhuijsen S. (2003a) ‘Principle ethics and the ethic of care: can they go \ntogether?’, Social Work\/Maatskaplike Werk, Vol. 39, pp.393–399. \nSevenhuijsen, S. (2003b) ‘The place of care: The relevance of the feminist ethic \nof care for social policy’, Feminist Theory Vol.4, pp 179-197. \nSevenhuijsen, S., Bozalek, V., Gouws, A. and Minnaar-McDonald, M. (2003) \n‘South African Social Welfare Policy: An Analysis of the Ethic of Care’, \nCritical Social Policy, Vol. 23, no. 3, pp 299-321. \nSevenhuijsen, S.and Svab, A. (eds.) (2003) Labyrinths of Care: The Relevance \nof the Ethics of Care Perspective for Social Policy, Peace Institute, \nLjubljana. \nSullivan, W. and Kymlicka, W. (eds) (2007) The Globalisation of Ethics, \nCambridge University Press, Cambridge.  \nTronto, J. (1993) Moral Boundaries: A Political Argument for an Ethic of Care, \nRoutledge, New York and London. \nTronto, J. (2002) ‘Who Cares? Public and Private Caring and the Rethinking of \nCitizenship’, in M.Friedman (ed.) Women and Citizenship, Rutgers \nUniversity Press, New Jersey. \n 17 \nWalzer, M. (1994) Thick and Thin: Moral Argument at Home and Abroad, Notre \nDame University Press, Notre Dame.  \nYip, K.-S. (2004) 'A Chinese cultural critique of the global qualifying standards for \nsocial work education', Social Work Education, Vol. 23, no. 5, pp. 597-612. \n \n \n \n \n \n"}