{"doi":"10.1063\/1.2149177","coreId":"100971","oai":"oai:epubs.surrey.ac.uk:372","identifiers":["oai:epubs.surrey.ac.uk:372","10.1063\/1.2149177"],"title":"Optimization of tapered semiconductor optical amplifiers for picosecond pulse amplification","authors":["Gehrig, E","Hess, O"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-12-19","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:372<\/identifier><datestamp>\n      2017-10-31T13:57:58Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/372\/<\/dc:relation><dc:title>\n        Optimization of tapered semiconductor optical amplifiers for picosecond pulse amplification<\/dc:title><dc:creator>\n        Gehrig, E<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2005-12-19<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/372\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gehrig, E and Hess, O  (2005) Optimization of tapered semiconductor optical amplifiers for picosecond pulse amplification   APPLIED PHYSICS LETTERS, 87 (25), ARTN 2.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2149177<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/372\/","10.1063\/1.2149177"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 87, 251106 \u00012005\u0002Optimization of tapered semiconductor optical amplifiers for picosecond\npulse amplification\nE. Gehriga\u0001 and O. Hess\nAdvanced Technology Institute, School of Electronics and Physical Sciences, University of Surrey,\nGuildford, Surrey GU2 7XH, United Kingdom\n\u0001Received 4 May 2005; accepted 24 October 2005; published online 15 December 2005\u0002\nWe present results of a fundamental device simulation study aimed at an optimization of high-power\ntapered semiconductor optical amplifiers for picosecond pulse amplification. Thereby, the\nmicroscopic light-matter coupling is described on the basis of a spatially resolved Maxwell–Bloch–\nLangevin description that takes into account many-body-carrier interactions, energy transfer\nbetween the carrier and phonon systems and, in particular, the spatiotemporal interplay of stimulated\nand amplified spontaneous emission and the noise caused by spontaneous emission. Extensive\nsimulation runs reveal the microscopic physical processes which are responsible for the beam\nquality of the amplified picosecond pulses and allow us to give concrete suggestions for the\noptimization of the amplifier structure and geometry. We discuss the influence of a curved\nwaveguide or spatially patterned current contact, and identify the length of the unpumped area as the\nmost critical parameter to be carefully optimized. © 2005 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2149177\u0004The need for high output power and good spatial and\nspectral purity, often required by applications in, e.g., ul-\ntrafast nonlinear optics or communication systems, has lead\nin recent years to device designs for high-power high-\nbrightness semicondcutor laser sources1,2 and to the realiza-\ntion of new laser amplifiers with improved beam quality.3–7\nThe laser amplifier system consisting of a a laser pulse\nsource and a semiconductor amplifier is a very commonly\nused configuration since it allows the separate optimization\nof device properties responsible for pulse properties and out-\nput power. The spatial and spectral properties of a pulsed\nsignal that has been amplified in a high-power semiconduc-\ntor laser thereby strongly depend on both the geometry of the\nlaser \u0001in particular the waveguide geometry\u0002 and the specific\nrealization of the current injection via an electronic contact.\nMore recent investigations8 on tapered laser amplifiers have\nrevealed the influence of the tapered angle and the length of\nthe waveguide section on the beam quality and power of the\namplified signal. It could be shown that a tapered angle that\nhas been adjusted to the diffraction angle of the injected\nGaussian beam and a waveguide length of a few 100 \u0001m\nprovide good beam quality and high small signal gain with\nonly small contributions of amplified spontaneous emission\n\u0001ASE\u0002 in the emitted radiation.\nWhile previous studies have mainly addressed the am-\nplification of continuous-wave \u0001cw\u0002 optical signals, in this\nletter, we focus on an investigation of the design of the\nwaveguide section and the electronic contact of tapered laser\namplifiers \u0001InGaAs, 2–3 mm length\u0002 that should be opti-\nmized for picosecond pulse amplification. In particular, we\nwill analyze the influence of these design parameters with\nrespect to the spatiotemporal light field dynamics and quality\nof the picosecond pulses. Table I summarizes the fundamen-\ntal material and device parameters used in the modeling.\nMore details on the background and on their significance can\nbe found in Ref. 9. In our simulations, the microscopic light-\na\u0002Electronic mail: e.gehrig@surrey.ac.uk\n0003-6951\/2005\/87\u000225\u0001\/251106\/3\/$22.50 87, 25110\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject tomatter coupling is described on the basis of a spatially re-\nsolved Maxwell–Bloch–Langevin description9 taking into\naccount many-body-carrier interactions, energy transfer be-\ntween the carrier and phonon systems and, in particular, the\nspatiotemporal interplay of stimulated and ASE and the noise\ncaused by spontaneous emission. The scattering rates are mi-\ncroscopically derived and calculated in dependence on car-\nrier density and wavenumber.9 Figure 1 shows a lateral cut of\nthe intensity distributions at the output facet \u0003Figs. 1\u0001a\u0002 and\n1\u0001b\u0002\u0004 and in the entrance region \u0003Figs. 1\u0001c\u0002 and 1\u0001d\u0002\u0004 of the\ntaper \u0001approximately 20 \u0001m behind the waveguide\u0002. The\nlength of the waveguide is 770 \u0001m, the total length of the\namplifier is 2770 \u0001m\u0002. Figures 1\u0001a\u0002 and 1\u0001c\u0002 show simula-\ntion results for a tapered amplifier with a linear waveguide,\nFigs. 1\u0001b\u0002 and 1\u0001d\u0002 refer to a device with a curved waveguide\nsection. Please note that the full spatiotemporal carrier and\nTABLE I. Fundamental material and device parameters of the InGaAs ta-\npered lasers.\nMaterial Parameter\nCavity length 2770 \u0001m\nLength of the waveguide 770 \u0001m\nWidth at the entrance facet 5 \u0001m\nWidth at the output facet 200 \u0001m\nThickness of active layer 0.15 \u0001m\nRefractive index of active layer 3.35\nLaser wavelength 925 nm\nFront facet mirror reflectivity 10−2\nBack facet mirror reflectivity 10−2\nNonrad. recomb. time 5 ns\nRelaxation times of electrons and holes 50–200 fs\nDipole dephasing time 50–200 fs\nEffective electron mass 0.065–0.068m0\nEffective hole mass 0.24–0.38m0\nm0 9.1093879\u000210−31 kg\nEnergy gap \u0001at T=0 K\u0002 1.35–1.529 eV\nInjection efficiency 0.5© 2005 American Institute of Physics6-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n251106-2 E. Gehrig and O. Hess Appl. Phys. Lett. 87, 251106 \u00022005\u0001light field dynamics have been taken into account in the cal-\nculation. Indeed, it is the dynamic spatially dependent inter-\nplay of carrier diffusion, light diffraction, and microscopic\ncarrier excitation and relaxation that affect the spatial and\nspectral properties of the light pulse during its propagation.\nIn the calculations, the injection current was chosen such that\nthe carrier inversion within the amplifier is signficantly\nabove the threshold value \u0001N\u00053Nthr\u0002, and the input power is\n1.1Pin\nsat\n—where Pin\nsat denotes the input power required to re-\nduce the inversion to transparency when reaching the output\nfacet. The material reflectivity of the facets has been set to a\nvalue of 10−2. In the linear geometry \u0003Figs. 1\u0001a\u0002 and 1\u0001c\u0002\u0004,\nthe dynamic interaction of counterpropagating waves leads\nto characteristic transverse modulations in the entrance re-\ngion of the taper \u0003Fig. 1\u0001a\u0002\u0004 that are via the dynamic light\nfield propagation transferred to respective filament structures\nin the near field \u0003Fig. 1\u0001b\u0002\u0004. The nonlinear waveguide geom-\netry reduces and suppresses counterpropagation effects lead-\ning to a homogeneous light field distribution near the\nwaveguide-amplifier connection \u0003Fig. 1\u0001b\u0002\u0004 and an almost\nGaussian-shaped near field \u0003Fig. 1\u0001d\u0002\u0004. Generally, the inter-\naction of counterpropagating waves strongly depends on the\nquality of the antireflexion coating. For cw beams, it has\nbeen shown10 that the facet reflectivity of tapered amplifiers\nwith linear geometry should be less than 10−4. However, as\ncan be seen in Fig. 1, a laser-amplifier design with curved\nwaveguide section modifies these requirements: The nonlin-\near waveguide section leads to an efficient coupling of the\ninjected light field into the amplifying region and to a sig-\nnificant reduction of counterpropagation effects. In a tapered\namplifier with a curved waveguide section, the “effective\nreflectivity” defined by both the reflectivity of the facets \u0001in-\ncluding coating\u0002 and the phase front of the counterpropagat-\ning light wave is thus reduced by approximately two orders\nof magnitude.\nA further increase in quality and power of the optical\nsignal \u0001cw beam or pulse alike\u0002 can be obtained with an\nappropriate design of the electronic contact. As expected, the\ncarrier injection via the contact leads to a characteristic car-\nrier distribution within the active area of the laser amplifier.\nHowever, the geometric design of the contact plays a signifi-\ncant role for the resulting spatiotemporally varying light field\ndistribution and filament formation. A typical method to con-\nFIG. 1. Intensity distributions \u0001temporally averaged\u0002 at the output facet\n\u0001upper row\u0002 as well as in the entrance region of the taper \u0001bottom row\u0002 with\nlinear \u0001left\u0002 and curved \u0001right\u0002 waveguide.trol the carrier-light field dynamics is to use a spatially\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject tomodulated contact. The suitable choice of, e.g., the length\nand periodicity of the modulated section, however, often re-\nmains an open question. A systematic variation of the shape\nand periodicity of the current contacts should then allow us\nto determine the influence of a spatially varying carrier in-\njection. Specifically, we consider a laser amplifier in which\nthe electronic contact in the entrance region of the taper is\nperiodically modulated in propagation direction. Variable pa-\nrameters are the length of the modulated section \u0001Lmod\u0002, the\nlength of a single contact region \u0001Lj1\u0002, as well as the length\nof the umpumped regions \u0001Lj0\u0002. One might immediately\nwonder, if and how the structuring of the contact may influ-\nence the spatiotemporal dynamics and thus keep filament\nformation at a low level. In order to answer this question, we\nhave systematically varied the characteristic lengths Lmod,\nLj1, and Lj0. Figure 2 shows calculated intensity snapshots\npertaining to a tapered amplifier \u0001N\u00053Nthr, length of the\nmodulated section Lmod=600 \u0001m\u0002 during the propagation of\na picosecond pulse. In this particular example, the length of\nthe umpumped area is Lj0=2.5 \u0001m \u0001left\u0002 and Lj0=10 \u0001m\n\u0001right\u0002, respectively, and the input power is 0.8Pin\nsat\n. In prin-\nciple, the inhomogeneous contact design keeps the injection\ncurrent density in the entrance region at a low level and thus\nreduces lateral structuring and filament formation. The spa-\ntiotemporal dynamics near the waveguide-taper transition via\npropagation and the dynamic coupling of transverse with\nlongitudinal degrees of freedom is also transferred to the\npropagation direction leading to good pulse-signal properties\nnear the output facet. However, it is important to note that\nthe laser-internal light-matter interaction and the respective\ncharacteristic interaction length \u0001e.g., carrier diffusion, light\ndiffraction\u0002 give upper and lower limits to the contact design,\nrespectively. This is of particular importance for the length of\nthe umpumped area: If this length significantly exceeds the\nlaser-internal interaction length \u0001which typically lies in the\n\u0001m regime\u0002, a detoriation instead of an improvement of the\nbeam quality will arise. Our simulations demonstrate that\nlarge umpumped regions lead to an inhomogeneous amplifi-\ncation within the pulse shape \u0003see Fig. 2\u0001c\u0002\u0004. This results in a\nloss of phase information and coherence. The pulse breaks\nup and is significantly deformed \u0003Fig. 2\u0001d\u0002\u0004. In addition, a\nsignificant detoriation of the gain can be ovserved: Fig. 3\u0001a\u0002\nshows \u0001for the same current and input power\u0002 the spatiotem-\nporally integrated values of the gain as calculated within the\nFIG. 2. Propagation of a picosecond pulse in a tapered amplifier with a\nlength of the unpumped area of Lj0=2.5 \u0001m \u0001a,b\u0002 and Lj0=10 \u0001m \u0001c,d\u0002.frame of the complete set of spatiotemporally resolved\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n251106-3 E. Gehrig and O. Hess Appl. Phys. Lett. 87, 251106 \u00022005\u0001Maxwell–Bloch equations. If the length of the unpumped\nregion is significantly larger than approximately 5 \u0001m, the\ninduced phase changes lead to a reduction of the over-all\ngain. This effect is even more pronounced if the input power\nis very low \u0001i.e., in the low signal regime\u0002: In this case, the\npulse amplitude is not sufficiently high to sustain internal\ncoherence during the passage of the umpumped regions so\nthat the shape and duration of the injected pulse is not main-\ntained. The laser-internal interaction lengths given by diffu-\nsion, diffraction, and scattering \u0001typically in the \u0001m regime\u0002\nconsequently represent and define the maximum length of\nthe umpumped region.\nTo gain further insight in the influence of the contact\nmodulation on the amplification, Fig. 3\u0001b\u0002 displays the de-\npendence of the integrated total gain on the length of the\nmodulated section in the taper. In structures with a long\nmodulated section, our simulations reveal a noticable influ-\nence of the curvature of the phase front defined by the propa-\ngation of the injected Gaussian beam \u0001i.e., beam waist and\nFIG. 3. Dependence of the overall gain on the length of the unpumped\nregion \u0001a\u0002 and on the total length of the modulated area \u0001b\u0002 in an amplifier\nwith a total length of 2770 \u0001m.wavelength-dependent diffraction\u0002: With increasing propaga-\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject totion length, the curvature of the phase front of the light field\ndeviates to a stronger degree from an even phase front. As a\nconsequence, discontinuities arise where the propagating\nlight fields encounter the perpendicularly arranged sequence\nof pumped and unpumped regions. If the length of the modu-\nlated area extends too far in the taper \u0001more than, e.g., 1 mm\u0002\nthis “mismatch” between phase curvature and contact sec-\ntions leads to a strong reduction in the overall amplification\n\u0003see Fig. 3\u0001b\u0002\u0004.\nThe results of our parameter variation can be summa-\nrized as follows. A curved waveguide significantly reduces\ncounterpropagation effects. A spatially structured contact\nsection allows, for suitable design, filament supression and\nconsequently improves the quality of an amplified picosec-\nond pulse. However, to prevent a transverse deterioation of\nthe signal associated with the curved phase front of the\npropagating Gaussian beam, the modulated contact should\nnot cover the whole taper but be restricted to an area imme-\ndiately behind the waveguide. Finally, the most critical pa-\nrameter is represented by the length of the unpumped area.\nFor low input powers, the value of this parameter should not\nsignificantly exceed the \u0001m regime in order to sustain the\ncoherence properties of the light field during propagation.\n1D. Masanotti, F. Causo, and J. Sarma, Proc. Inst. Elect. Eng. Optoelec-\ntronics 151, 123 \u00012004\u0002.\n2M. Mikulla, A. Schmitt, M. Walther, R. Kiefer, W. Pletschen, J.\nBraunstein, and G. Weimann, IEEE Photonics Technol. Lett. 11, 412\n\u00011999\u0002.\n3J. Bossert and J. G. McInerney, IEEE J. Quantum Electron. 29, 166\n\u00011998\u0002.\n4L. Goldberg, D. Mehuys, M. Surette, and D. Hall, IEEE J. Quantum\nElectron. 29, 2028 \u00011993\u0002.\n5S. O’Brien, R. Lang, R. Parker, D. F. Welch, and D. Mehuys, IEEE Pho-\ntonics Technol. Lett. 9, 440 \u00011997\u0002.\n6T. Mukai, Y. Yamamoto, and T. Kimura, Lighwave Communications Tech-\nnologies, Semiconductors and Semimetals, Part E, edited by W. T. Tsang\n\u0001Academic, New York, 1985\u0002.\n7M. Sagawa, K. Hiramoto, T. Toyonaka, T. Kikiawa, S. Fujisan, and K.\nUomi, Electron. Lett. 32, 2277 \u00011996\u0002.\n8E. Gehrig and O. Hess, IEEE J. Quantum Electron. 37, 1345 \u00012001\u0002.\n9E. Gehrig and O. Hess Spatio-Temporal Dynamics and Quantum Fluctua-\ntions in Semiconductor Lasers \u0001Springer, Heidelberg, 2003\u0002.\n10E. Gehrig and O. Hess, High-Power Diode Lasers \u0001Springer, Berlin,\n2000\u0002.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}