{"doi":"10.1023\/B:FOCH.0000035061.02831.45","coreId":"66885","oai":"oai:dro.dur.ac.uk.OAI2:53","identifiers":["oai:dro.dur.ac.uk.OAI2:53","10.1023\/B:FOCH.0000035061.02831.45"],"title":"Elements, principles and the narrative of affinity. Mi Gyung Kim : affinity that illusive dream : a genealogy of the chemical revolution.","authors":["Eddy, M. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"In the 18th century, the concept of ‘affinity’, ‘principle’ and ‘element’ dominated chemical discourse, both inside and outside the laboratory.  Although much work has been done on these terms and the methodological commitments which guided their usage, most studies over the past two centuries have concentrated on their application as relevant to Lavoisier’s oxygen theory and the new nomenclature. Kim’s affinity challenges this historiographical trajectory by looking at several French chemists in the light of their private thoughts, public disputations and communal networks. In doing so, she tells a complex story which points to the methodological and practical importance of industrial and medical chemistry. The following review highlights the advantages and snares of such an approach and makes a few historiographical points along the way","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66885.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/53\/1\/53.pdf","pdfHashValue":"aeff24a6fe2f43f965a473b63df368ac7490f614","publisher":"Kluwer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:53<\/identifier><datestamp>\n      2011-04-19T08:36:41Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Elements, principles and the narrative of affinity. Mi Gyung Kim : affinity that illusive dream : a genealogy of the chemical revolution.<\/dc:title><dc:creator>\n        Eddy, M. D.<\/dc:creator><dc:description>\n        In the 18th century, the concept of ‘affinity’, ‘principle’ and ‘element’ dominated chemical discourse, both inside and outside the laboratory.  Although much work has been done on these terms and the methodological commitments which guided their usage, most studies over the past two centuries have concentrated on their application as relevant to Lavoisier’s oxygen theory and the new nomenclature. Kim’s affinity challenges this historiographical trajectory by looking at several French chemists in the light of their private thoughts, public disputations and communal networks. In doing so, she tells a complex story which points to the methodological and practical importance of industrial and medical chemistry. The following review highlights the advantages and snares of such an approach and makes a few historiographical points along the way.<\/dc:description><dc:subject>\n        Chemistry<\/dc:subject><dc:subject>\n         Element<\/dc:subject><dc:subject>\n         Principle<\/dc:subject><dc:subject>\n         Affinity.<\/dc:subject><dc:publisher>\n        Kluwer<\/dc:publisher><dc:source>\n        Foundations of chemistry, 2004, Vol.6(2), pp.161-175 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:53<\/dc:identifier><dc:identifier>\n        issn:1386-4238<\/dc:identifier><dc:identifier>\n        issn: 1572-8463<\/dc:identifier><dc:identifier>\n        doi:10.1023\/B:FOCH.0000035061.02831.45<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/53\/<\/dc:identifier><dc:identifier>\n        http:\/\/www.springerlink.com\/link.asp?id=l62467861789g845<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/53\/1\/53.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1572-8463","issn:1386-4238","issn: 1572-8463","1386-4238"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Chemistry","Element","Principle","Affinity."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n25 June 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nEddy, M. D. (2004) ’Elements, principles and the narrative of affinity. Mi Gyung Kim : affinity that illusive\ndream : a genealogy of the chemical revolution.’, Foundations of chemistry., 6 (2). pp. 161-175.\nFurther information on publisher’s website:\nhttp:\/\/www.springerlink.com\/link.asp?id=l62467861789g845\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nM. D. EDDY \n \n \n \nESSAY REVIEW:  \nELEMENTS, PRINCIPLES AND THE NARRATIVE OF AFFINITY \n \n \nMi Gyung Kim. Affinity that Illusive Dream: A Genealogy of the Chemical Revolution \n(Cambridge, Mass.: MIT Press, 2003). \n \nABSTRACT. In the eighteenth century, the concept of ‘affinity’, ‘principle’ and ‘element’ \ndominated chemical discourse, both inside and outside of the laboratory.  Although much work \nhas been done on these terms and the methodological commitments which guided their usage, \nmost studies over the past two centuries have concentrated on their application as relevant to \nLavoisier’s oxygen theory and the new nomenclature. Kim’s Affinity challenges this \nhistoriographical trajectory by looking at several French chemists in light of their private \nthoughts, public disputations and communal networks.  In doing so, she tells a complex story \nwhich points to the methodological and practical importance of industrial and medical chemistry.  \nThe following review highlights the advantages and snares of such an approach and makes a few \nhistoriographical points along the way. \n \n \n \n1. HISTORIOGRAPHICAL OVERVIEW \n \nFor many of today’s historians of science, reading a book about early modern chemistry \nwould most probably induce a heinous case of intellectual dyspepsia.  Perhaps this can be \nattributed to the gastronomic overtones of funny sounding words like ‘butter of arsenic’, \n‘milk of lime’ and ‘tartar of wine’.  Or, perhaps ‘Plessy’s green’ and ‘Plimmer’s Salt’ \nmake for a bad side salad in classes where the main course is really Newton, Darwin or \nsocial discourse.  These esoteric names serve to make the subject unpalatable to scholars \nunversed in the seemingly anarchical and archaic vocabulary of ‘chymistry’ as it existed \nin the centuries between the scientific and chemical revolutions.  One way many \nhistorians have reacted to this situation is by framing their work in relation to its \nrelevance to concepts which are at least familiar to the modern reader.  Since the \nnineteenth century, this approach has produced a number of elegantly written books in \nwhich the time between the careers of Robert Boyle and Antoine Lavoisier is \nretrospectively filtered through the so called ‘Chemical Revolution’.  Though helpful in \ntranslating the work of Enlightenment ‘chymistry’ into the language of modern science, \nthese studies ignore the vast experimental culture of chemistry as practiced in medicine, \nindustry and provincial societies.  Thus, when an intrepid researcher seeks to step outside \nthe chemical revolution historiography, there are relatively few sources available which \noffer guidance on how to untangle the research programs, nomenclature and ontologies \nwhich guided pre-Lavoisierian chemistry. \nNevertheless, over the past few decades a rising number of studies have addressed the \nlaboratory practices and epistemological commitments of early modern chemists.  \nBuilding on the studies of Hélène Metzger, Reijer Hooykaas and Maurice Crosland,1 the \n1970s and 1980s witnessed the work of Frederic Lawrence Holmes, Allen Debus, Arthur \nL. Donovan, Karl Hufbauer, Norma E. Emerton and David R. Oldroyd.2  Holmes \ncontinued to write on the subject throughout his career, producing two of the most helpful \ntexts on early modern France: Eighteenth-Century as an Investigative Enterprise (1991) \nand Antoine-Lavoisier—The Next Crucial Year (1999).  The foundation laid by these \nauthors has paved the way for more nuanced studies which have investigated issues more \nrelevant to the actual practice of early modern chemistry.  A role call of these studies \nwould include: Marco Beretta’s excavation of the history of chemical classification and \nnomenclature;3 Bernadette Bensaude-Vincent and Jan Golinski’s work on chemical \ncommunities;4 William R. Newman and Lawrence M. Principe’s explication of the \ninfluential role played by alchemical methods and imagery in the Scientific Revolution;5 \nand, finally, Andreas-Holger Maehle and Brian Nance’s emphasis on the central role \nplayed by therapeutics and experimental pharmacology.6  Key to many of these studies, \nespecially those that focus on the eighteenth century, is the concept of chemical affinity.  \nIn particular, Alistair Duncan’s work addressed the subject from a pan-European \nperspective and Ursula Klein focused in on Etienne-François Geoffroy’s affinity table \nand workshop traditions.7  \nMi Gyung Kim’s Affinity that Illusive Dream follows in the wake of these studies.  \nLike the work of Maehle, Donovan and Bensaude-Vincent – as well as other eighteenth-\ncentury intellectual historians like Anders Lundgren, Roy Porter and Mikulás Teich8 – \nKim concentrates on a specific linguistic and national context.  Instead of analytically \npresenting an argument, she gives a Foulcaultian narrative with characters drawn \n                                                 \n1 Hélène Metzger, Les doctrines chimiques en France: du début du XVIIe à la fin du XVIIIe Siècle (Paris: Les Presses Universitaires \nde France, 1923) and Newton, Stahl, Boerhaave et la doctrine chimique (Paris: F. Alcan, 1930).  Reijer Hooykaas, ‘The concepts of \n“individual” and “species” in chemistry’, Centaurus, 5 (1958), 307-322; ‘The discrimination between “natural” and “artificial” \nsubstances and the development of corpuscular theory’, Archives internationales d’histoire de sciences, 4 (1948), 640-651.  Maurice \nP. Crosland Historical studies in the language of chemistry (London: Heinemann, 1962).  \n2 Frederic L. Holmes, ‘Analysis by fire and solvent extractions: The metamorphosis of a tradition’, Isis, 62 (1971), 129-148. Allen \nDebus, The Chemical Philosophy: Paracelsian Science and Medicine in the Sixteenth and Seventeenth Centuries, vols. I & II (New \nYork: Science History Publications, 1977). Arthur L. Donovan, Philosophical chemistry in the Scottish Enlightenment : the doctrines \nand discoveries of William Cullen and Joseph Black (Edinburgh : Edinburgh University Press, 1975). Karl Hufbauer, The formation of \nthe German chemical community 1720-1795 (Berkeley: University of California Press, 1982). Norma E. Emerton, The scientific \nreinterpretation of form (Ithaca: Cornell University Press, 1984). David R. Oldroyd’s articles from this time are now collected in \nSciences of the earth : studies in the history of mineralogy and geology (Aldershot : Ashgate, 1998). \n3 Marco Beretta, The Enlightenment of Matter: The definition of chemistry from Agricola to Lavoisier (Canton: Science History \nPublications, 1993). \n4 Bensaude-Vincent, Bernadette and Ferdinando Abbri (eds). Lavoisier in European context: Negotiating a new language for \nchemistry (Canton, Mass.: Science History Publications, 1995).  Jan Golinski, Science as public culture: Chemistry and Enlightenment \nin Britain, 1760-1820 (Cambridge: Cambridge University Press: 1992). \n5 William R. Newman, Gehennical fire: the lives of George Starkey, an American alchemist in the scientific revolution (Cambridge, \nMass.: Harvard University Press, 1994).  William R. Newman and Lawrence M. Principe, Alchemy tried in the fire: Starkey, Boyle, \nand the fate of Helmontian chemistry (Chicago: University of Chicago Press, 2002). Lawrence M. Principe, The aspiring adept: \nRobert Boyle and his alchemical quest (Princeton, NJ : Princeton University Press, 1998). \n6 Andreas-Holger Maehle, Drugs on trial: experimental pharmacology and therapeutic innovation in the eighteenth century \n(Amsterdam: Rodopi, 1999). Brian Nance, Turquet de Mayerne as baroque physician: the art of medical portraiture (Amsterdam: \nRodopi, 2001). \n7 Alistair Duncan, Laws and order in eighteenth-century chemistry (Oxford: Clarendon Press, 1996). Ursula Klein, Verbindung und \nAffinität: die Grundlegung der neuzeitlichen Chemie an der Wende vom 17. zum 18. Jahrhundert (Basel: Birkhäuser, 1994), ‘E.F. \nGeoffroy's table of different 'rapports' observed between different chemical substances: a reinterpretation’, Ambix 42 (1995), 79-100’; \n‘The chemical workshop tradition and the experimental practice: Discontinuities within continuities\", Science in Context 9 (1996), \n251-287.  Klein has also just recently investigated the crucial link between material culture and pharmacological experimentation in \n‘Experimental History and Herman Boerhaave’s chemistry of plants’, Studies in the History and Philosophy of Biological and \nBiomedical Sciences, 34 (2003), 533-567. \n8 Anders Lundgren, The new chemistry in Sweden: the debate that wasn't, Osiris, 4 (1988), 146-168; Roy Porter and Mikulás Teich, \nThe enlightenment in national context (Cambridge: Cambridge University Press, 1981). \n 2\nprimarily from the Jardin du roi (f. 1635) and the Académie royale des Sciences (f. \n1666).  The stage is mainly Paris, with a few scenes set in provincial societies.  Spanning \nthe period between the seventeenth and the nineteenth centuries, the plot is the complex \nhistory of chemical affinity.  In telling this story, two terms continually emerge as part of \nthe intellectual scenery: ‘element’ and ‘principle’.  She defines these two in a manner \nfollowed by many historians of early modern chemistry.  The word principle was used by \nthe Paracelsian tradition to represent the three basic forms of matter (the tria prima): Salt, \nSulphur and Mercury.  Some of the chemists of this school held that these principles were \nreally secondary manifestations of a hitherto unidentified universal form of matter.  The \nword element was taken from the four material divisions offered by Aristotle: Air, Fire, \nWater and Earth.  By the seventeenth century, these elements had been redefined in \nresponse to laboratory experimentation.  Overall, in the face of the innumerable \nvocabularies used by early modern chemists, pure manifestations of these two ontologies \nwere nearly impossible to find.  But as a historiographical tool (and a piece of the scenery \nof course), Kim has followed the lead of past historians in agreeing that ‘Paracelsian \nPrinciples’ and ‘Aristotelian Elements’ are the most helpful typologies available at \npresent.  \n \n \n \n2. THE LEMERYS, HOMBERG AND GEOFFROY \n \nRather than concentrate on one single person, Chapter 1 is dominated by a ‘troop’ \nwhose work would later be relevant to the affinity tables proposed by Etienne-François \nGeoffroy in 1718.  From the start, Kim emphasizes that each of these chemists conflated \n(either synonymically or metonymically) the use of ‘principle’ and ‘element’ when \nseeking to talk about matter in its most reducible form.  As shown throughout the rest of \nthe book, this was also the case for most chemists who lived before 1800.  Paying close \nattention to the different definitions of ‘principle’ and element’ associated with the \nvariegated analytic methods and chemical communities of the Jardin and the Académie, \nKim concentrates on Samuel Cottereau Du Clos (1598-1685), Claude Bourdelin (1621-\n1699) and Nicholas Lemery (1645-1715).  Building on the careers of these chemists, the \nmain character that she treats in Chapter 2 is Wilhelm Homberg (1652-1715).  For the \nmost part, the setting is the Académie after it was restructured in 1699.  Homberg held \nthat the Fire of the sun (which he also called the ‘matter of light’) was a universal solvent \nthat could reduce the principles into their ‘ultimate corpuscles’ (the former term being \ninspired by Descartes, not Newton).  Based on this theory, Homberg used a burning glass \nto see whether principles could be reduced to even more basic forms of matter.  In the \nend, he concluded that such a reduction was not possible and that, practically speaking, \nthere were five principles of matter: sulphur, salt, mercury, water and earth.  \nAdditionally, drawing from his experiments on acids (which he held to be a type of salt), \nhe suggested that mixts formed from principles were held together by a ‘force’ that \nseemed to be stronger in some substances and weaker in others. \nThe protagonists of Chapter 3 are Louis Lemery (1677-1743) and Etienne-François \nGeoffroy (1672-1731). Son of the Académie chemist Nicolas Lemery, Louis, like many \nin the early modern chemists, held that fire was an aerial fluid. Assisted by his belief in \n 3\ncorpuscularism and Homburg’s burning glass, he suggested that fire was a universal \nsolvent that gained its potency from ‘matter of light’ particles  which used mechanical \nforce (in a Cartesian sense) to break down substances.  As a fluid, he argued that fire \nsuperceded distillation and solution-based techniques because it was such a powerful \nsolvent. Likewise, he criticized the ontological status given to principles and called for \nexperiments  which sought to break them down into even more basic corpuscles.  Yet this \nphilosophically appealing program was riddled with practical problems, the most \npressing being the sheer impossibility of empirically quantifying the corpuscles that \nformed the base of his theory.  Kim shows that it was exactly this issue which led \nGeoffroy, Lemery’s older contemporary, to present a chemical Table des Rapports (Table \nof Affinities) in 1718.  Rather than being interested in unquantifiable corpuscles, \nGeoffroy was content to take the principles of fire, water, earth, salt and metal at face \nvalue.  In opposition to the emphasis that Lemery placed on fire (a fluid), Geoffrey \nadvocated humid analysis, that is, experiments which used solvents made out of aqueous \nsolutions.  This attracted criticism on several fronts, especially by those interested in \n‘phlogiston’, the ‘sulphur’ principle and\/or ‘matter of light’. Geoffroy responded to these \nchallenges by arguing that all of these were manifestations of inflammability – an act \nwhich allowed future generations of French chemists to regard phlogiston, sulphur and \nmatter of light as different representations of an overarching inflammable principle. \n \n \n \n3. ROULLE AND MACQUER \n \nThe influence Lemery and Geoffroy remained strong during the 1720s and 1730s. \nHowever, their ideas were both challenged and augmented by the next generation of \nchemists.  Kim explores the role of principles and affinity from the 1740s to the 1760s by \ncasting Guillaume-François Rouelle (1703-1770) and Pierre-Joseph Macquer (1718-\n1784) as her main characters.  Although some of the more theoretical parts of Rouelle’s \nwritings suggest that he associated ‘elements’ with the basic molecules of matter and \n‘principles’ with primary combinations of elements, in the end he took an instrumental \n(Kim prefers to use the word ‘operational’) approach in the laboratory and treated the \nprinciples of fire, earth, water, and air as basic units of composition.  In doing this, his \napproach to fire built on Georg Ernst Stahl’s concept of phlogiston (which had started to \ncirculate in France during 1720s) and Geoffroy’s affinity table. The predominant methods \nRouelle used to isolate these principles were fermentation and putrefaction. Interestingly, \nthese methods were eschewed by Macquer, who was Rouelle’s younger contemporary. \nMacquer’s work harkened back to Homberg and Lemery’s belief that fire was the most \npowerful chemical solvent. Yet, despite this difference, Macquer continued Rouelle’s \nprinciple\/element conflation and gave an operational priority to air, fire, earth and water \nin the laboratory. Macquer accepted these distinctions more readily because he was more \nconcerned with developing a classification system for the affinities which were enshrined \nin Geoffroy’s table.  To this goal, he initially proposed two forms of affinity during the \n1750s: simple and complicated.  It was this move that led him and others in France (like \nAntoine Baumé, 1728-1804) and abroad (Torbern Bergman, 1735-1784) to later suggest \nseveral different classes of affinity: compound, intermediate, decompositional, reciprocal, \n 4\nelective and double.  Based on her previous work on Victorian chemistry, Kim suggests \n(quite plausibly) that it was these affinity schemes which would later form an intellectual \nbridge between the tables of eighteenth-century ‘principles’ and the ontology of \nnineteenth century ‘elements’ and compounds. \nThe central character of Chapter 5 is Guyton de Morveau (1737-1816).  Kim pays \nparticular attention to the chemical ideas developed during his Dijon years (1760s and \n1770s), that is, before his conversion to the new nomenclature in 1787.   Although he \nwould later be known as one of France’s preeminent chemists, he began his career in the \nprovince as a lawyer.  During these earlier years, he held that phlogiston was a universal \nsolvent, thereby continuing the strand of French chemistry  which placed emphasis upon \nmethods that used igneous analysis.  He did not warm to the dual usage of ‘principle’ and \n‘element’ and this led him to favor the latter when discussing what he held to be the four \nmost basic material particles: earth, fire, air and water.  From the start, Morveau’s logical \nmindset made him quite interested in chemical reform.  In 1769 this inspired him to \npropose a new arrangement of Geoffroy’s table.  Whilst pursuing this arrangement, his \ninterest in affinity (and also phlogiston) continued to grow—especially as he became \nmore immersed in laboratory experimentation. In fact, at one point he even entertained \nBuffon’s premise that Newton’s inverse square law could be used to quantify affinity \nrelationships between different types of particles.  Though this idea was difficult to \npursue, it did lead to a striking conclusion. Combining Rouelle and Macquer’s affinity \nclassifications with Newton’s mathematical approach to gravitation, the articles that he \nwrote for Diderot’s Encyclopédie in 1773 averred that affinity was a substance which \ncould be quantitatively measured. Furthermore, even though Morveau often has been \nassociated with nomenclature reform, Kim points out that this recalibration of affinity \nwould also go on to play an important role in the ensuing decades. \n \n \n \n4. THE ‘ARSENAL’ GROUP \n \nChapter 6 visits an old hero of chemical historiography: Antoine Laurent Lavoisier \n(1743-1794).  Kim’s plot treats his 1770s chemical career and gives special emphasis to \nthe way his knowledge of acidity contributed to the development of his oxygen theory of \ncombustion.  Since Lavoisier used Geoffrey’s affinity table during this time, he followed \nin the footsteps of many mid-century chemists who employed both ‘principle’ and \n‘element’ to describe material particles of earth, water, air and fire.  This might perhaps \nsound quite normal until one realizes that he also used both ‘principle’ and ‘element’ to \ndescribe oxygen from the 1770s through the 1780s.  Additionally, although Lavoisier’s \n1764 notes from M. de la Planche’s lectures indicate that affinity was one of the ‘most \ndifficult’ concepts to understand,  he used it to describe the tendency of oxygen (his name \nfor the respirable ‘common air’ and Priestley’s dephlogisticated air) to unite with certain \nbodies and not with others.  Drawing from the previous century’s interest in universal \nsolvents (usually in their inflammable or aqueous form), Lavoisier proposed that oxygen \nwas the real ‘universal’ agent of solvency.  This move, though foreign to modern readers, \nwas conceptually possible for him because many early modern chemists (including those \ninterested in investigating the ‘airs’ of pneumatic chemistry) held that fire, water and air \n 5\nwere liquids.  More importantly, this context allowed him to reconfigure the mediums \ntraditionally associated with chemical reactions.  Instead of ‘bathing’ a compound with \nfire (combustion) or solutions (water and acids), Lavoisier turned to air.  Once this had \nbeen done, oxygen and the isolation of airs became focus of his campaign to eliminate the \nhold that principles and elements held over chemical nomenclature.  But, as Kim points \nout, even though he did not agree with Geoffroy’s conception of rapport nor his table, the \nidea of affinity as a potentially quantifiable entity played a notable role in his 1770s \nwork. \nAs is well known in the history of science, French chemistry was profoundly \nreshaped by Lavoisier’s oxygen theory during the 1780s.  What is generally not \nemphasized is that he did not emphatically reject the early modern definition of the four \nelements until 1789 when he published Traité élémentaire de chimie.  This \npronouncement was inspired by his own experiments and the ‘conversion’ of Guyton, \nAntoine François Fourcroy (1755-1809) and Claude-Louise Berthollet (1748-1822) \nduring the mid part of the decade.  Kim collectively refers to these four chemists as the \n‘Arsenal Group’ and Chapter 7 shows how this fellowship used the concept of affinity in \ntheir work.  Following his adolescent distaste for affinity, Lavoisier set out to criticize \ncontemporary affinity tables in 1783.  However, this ironically led him to suggest an \nadditional column for oxygen.  More importantly, like Mourveau’s work of the previous \ndecade, he became even more interested in finding a way to quantify affinities—a goal \nwhich mirrored his concurrent efforts to quantify heat (which had by then been renamed \n‘caloric’).  Kim holds that it is this 1780s research which led Lavoisier to reverse his base \nopinion of affinity: ‘Having mocked chemists’ affinities and analogies in his youth, he \nhad ironically come to appreciate the importance of chemical affinity.  He sought to \ndetail the affinity relations of oxygen as the basis of his new chemical system, \nsupplemented by a quantitative measurement of affinities’ (349).  This appreciation for \naffinity also held for the work his Arsenal colleagues were conducting at the time.  For \nexample, before his oxygen conversion in 1786, Fourcroy’s 1782 Leçons élémentaires \nd’histoire naturelle et de chimie offered several different classes of affinity.  Moreover, \nthe research he made while writing this text brought him one step closer to Lavoisier’s \nprogram.  He became convinced that elements and\/or principles, as they were then \ndefined, were empirically suspect and that chemists needed to focus on quantifying the \naffinities which guided chemical reactions.  Like Fourcroy, Guyton’s work during this \ntime reflected a similar mindset. \nThe hero of Affinity’s final chapter is Berthollet, the youngest member of the Arsenal \nGroup.  After the French Revolution, both he and Guyton went on to become two of the \nleading authorities on chemistry in France.  Unlike Lavoisier, Berthollet had shown a \nnotable interest in affinities during the earlier part of his career.  With the oxygen theory \nand the new nomenclature firmly set in motion, his 1795 lectures indicate that he sought \nto bring chemistry more in line with physics by pursuing experiments which concentrated \non how attraction and repulsion occurred between what he then held to be elements: \noxygen, hydrogen, carbon, azote, sulphur, alkali and earth.  As this classification \nindicates, 1790s chemical nomenclature was a fusion between the names developed in \nconjunction with the oxygen theory and those of the older elements and principles.  Kim \nalso shows that a close look at Berthollet’s post 1800 work indicates that he maintained a \nstrong interest in affinity up to the end of his career.  Additionally, like Guyton, he sought \n 6\nto find a way to reclassify and quantify affinities (an interest which mirrored his desire to \ndo the same for caloric).  This led him to criticize previous conceptions of affinity and to \noffer a new system.  Based on his belief that liquids (aerial and aqueous) were the ideal \nmedium, he argued that affinity was the sum total of the attraction or repulsion exerted by \nsolvents, cohesion, elasticity, efflorescence and gravitation.  Once these forces were \nsorted out, he also held that the insolubility, elasticity and, possibly, caloric of an element \nor compound might also effect the outcome of a chemical reaction.  Though visionary, \nthese issues were generally too impractical for early nineteenth-century chemists—\nespecially for those who wanted to apply their knowledge to medicine, industry or war.  \nHowever, as Kim points out, the importance of the questions engendered by Berthollet’s \ninterest in chemical affinity lies in the fact that he ‘offered an important starting point for \nthe later formulation of chemical dynamics in the 1860s’ (425). \n \n \n \n5. DEFINITIONS AND TERMINOLOGY \n \nAs my above comments indicate, this book covers many aspects of chemical affinity.  \nEven though parts of it do fill a much needed gap in the history of chemical elements, \nprinciples and affinities, there are several qualities which detract from its clarity.  One \nnotable distraction is the arrangement of each chapter.  It is here where Kim’s \nFoucaultian narrative makes many sections seem as if they have no focus.  More \nspecifically, like many a Dickensian novel, they are far too long (sometimes sixty pages!) \nand most lack a noticeable introduction and\/or conclusion.  This lack of organization is \nunfortunate because it makes the relevance of minor characters and plot twists less than \nobvious.  This combined with the book’s lack of a glossary, especially for chemical \nterms, means that it will be a difficult read for someone who cannot readily spout off the \nearly modern definition of ‘volatile’, ‘fixed’, ‘lixivial’, ‘sublimate’ or ‘rarified’.  \nAdditionally, though Chapters 1 and 2 address the history of key points that surface later \nin the book, much of their content is more deftly presented in Holmes’ Eighteenth-\nCentury Chemistry.  In fact, despite foreshadowing ghosts (volatile spirits, if you will) of \nchemical Christmases yet to come, these two chapters are the weakest in the book and in \nthe cost efficient tradition of Ebenezer Scrooge I recommend skipping them altogether if \nyou are already vaguely familiar with early modern chemistry.  In truth, these could have \nbeen easily reduced into one chapter meant to serve as a conceptual introduction to \nChapter 3’s focus on Geoffroy. Relatedly, the presence of several nebulously defined \nhistoriographical terms and movements succeed in distracting the reader away from the \nplot.  Let me elaborate. \nChapter 2 introduces the concept of domain theory (presumably a concept kidnapped \nfrom a branch of mathematical theory used in denotational semantics).  Aside from \ngiving no explicit indication in the main text of what this term actually means, it seems \nthat Kim envisions ‘domain’ to be an intellectual community’s predisposition towards a \ngiven topic.  This being the case, she proceeds to offer three different ‘domain’ classes, \neach with its own representational calculus: domain of nature (N), nature in its pristine \nform, e.g., unaffected by human analysis; domain of accomplished analysis (A), the data \ncreated in the chemical laboratory, that is, artificial reductions of nature; domain of \n 7\nprojected analysis (A’), ‘the world of true principles’ (or perhaps material particles) that \nreally existed below the philosophically inelegant principles.  Thankfully, these three \nterms only receive concentrated use in Chapter 2, after which they fade away in light of \nvocabulary taken directly from the authors under discussion.  The ‘domain’ concept does \nsurface a few more times, but the tripartite distinctions listed above are not used again.  It \nseems that these terms are remains of an earlier article which should have been ironed out \nin the editorial process.  This being the case, I could have simply passed them over  \nwithout issue.  But I have chosen to highlight them because they serve as a good example \nof a difficulty evinced to a minor degree throughout the book.   \nKim’s use of ‘domain’ points to a different and more implicit ambiguity in her \npresentation of the plot.  A close look at her footnotes reveals that her earlier work was \nconsiderably guided by a wide variety of socially inclined historians influenced by the \nwork of Jürgen Habermas and Andrew Pickering.  In principle, this practice is not \nproblematic—provided that the historiographical methods and\/or terminology of these \napproaches do not overshadow the texts under analysis.  However, the above ‘domain’ \nexample from Chapter 2 suggests that this is exactly what has happened.  During the \nearly modern period, most chemists, especially those practicing in the laboratory, realized \nthat there was a difference in the types of data that they were using.  This point is not a \nnew one.  Indeed, it was made several times in the studies on early modern chemistry \nmentioned at the beginning of this essay.  Most of these attempt to use the terminology \nemployed by the chemists that they were studying.  From a purely pragmatic perspective, \ninstead of complicating her narrative with terms which take a good deal of space to \nunpack and defend, it would seem that she could have made her task much easier by \nusing early modern distinctions like ‘natural’, ‘artificial’ and ‘essential’ in lieu of her \n‘domain’ terminology.  The use of these terms has a long and fruitful history, both during \nthe time of the early Académie and in later literature on the subject.  Moreover, similar \nforms of unidentified and undefined ideological baggage surreptitiously appear \nthroughout the work.  Some examples are ‘cognitive authority’, ‘cognitive status’, \n‘boundary behaviour’, ‘encoded’ and ‘contact zone’. Like her domain terminology, these \ndetract from her narrative because she hardly offers any explanation of the underlying \ntheoretical (both social and historiographical) assumptions that lie embedded in their \ndefinitions. \n \n \n6. THEORY AND GENEALOGY \n \nAside from addressing the history of eighteenth-century chemistry in relation to \naffinity, a significant theme that runs throughout the narrative is the methodological \npredestination which affected most of the characters.  Put more plainly, two different \napproaches to laboratory methodology appeared throughout the work.  One focused on \ntheoretical synthesis and the other on practical application.  Theoretical approaches to \nchemistry saw laboratory experimentation as a venue for confirming ideas born out of \nrational reflection.  Those of this ilk were fond of using Cartesian (and later Newtonian) \nmechanical language and imagery to discuss matter on a microscopic scale.  \nAlternatively, practical chemistry, also called analytic chemistry, was more concerned \nwith how the laboratory could be used in solving everyday problems.  For chemists of \n 8\n 9\n                                                \nthis vein, the roster of their experiments was set in relation to practically orientated \nquestions born out of problems arising in medical or industrial contexts.  Naturally, these \ndistinctions, like the idealized backdrop provided by Paracelsian principles and \nAristotelian elements mentioned at the start of this review, only function as helpful guide.  \nThey are more like typological poles, between which each chemist can roughly be placed \nfor the sake of expediting a clearer picture of early modern chemistry.  This being the \ncase, many studies which address this time form a cast of characters around a plot guided \nby theoretical chemistry.  In many respects, this is probably the easiest way to approach a \ntopic notorious for its linguistic inconstancies and ambiguities.  However, this does not \nget us very close to seeing the type of chemistry that was practiced outside the academy.  \nAside from the new insight Kim gives regarding affinities, a great strength of this book is \nthat it attempts to grapple with how practically orientated chemical questions were \nrelevant to the academy.  This is not an easy task and this explains why Kim sometimes \nchases some seemingly inane conceptual rabbits.   \nIronically, this book uses actors in the academy to underscore the importance of \nchemists who lived in the province (and this is in spite of Kim’s claim that Guyton was a \nprovincial chemist). In many ways this method only reconfirms the Chemical Revolution \nhistoriography that Kim wants to challenge. Readers of this work might find it a bit \nperplexing that her ‘genealogy’ skips over the numerous apothecaries, physicians, monks, \ndye makers, metallurgists, bleachers, merchants, etc., whose research was being filtered \ninto the Parisian chemical community during the early modern period.  Those interested \nin this topic will have to seek out more obscure studies based on manuscripts and texts \nthat shed light on the practical nature of chemical experimentation.9  To be sure, Kim \ndoes recognize the value of medicine and industry, but she offers little explication of non-\nacademy institutions, like monasteries or guilds, that fostered chemical research.  In \nfairness, these sources lie largely undisturbed in ecclesiastical and state collections across \nEurope—and France’s archives are not as efficiently organized, networked or catalogued \nas those in Britain or Germany.10  Yet the fact that Kim gestures toward the chemists \ncontained in these collections is commendable and this predisposition hopefully points to \na future project which explores how a topic like affinity was being applied in the French \n‘field’.  Kim’s book would no doubt provide a firm platform from which to launch such a \nstudy.  But until then, we will still know little about the genealogy of the relatively \nnameless chemists, the silent majority, who practiced chemistry outside the academy.   \nM. D. Eddy \nDibner Institute \nMIT E56-100 \n38 Memorial Drive \nCambridge, MA  02139 \nEmail: mdeddy@durham.ac.uk \n \n9 Two ‘obscure’ sources in this category which I have found rather informative are Rainer Schnabel’s Pharmazie in Wissenschaft und \nPraxis, dargestellt an der Geschichte der Klosterapotheken Altbayerns vom Jahre 800 bis 1800 (München : H. Moos, 1965) and the \narchival possibilities mentioned in the works included in the bibliography of  Wolfgang Hagen Hein’s Die deutsche Apotheke: Bilder \naus ihrer Geschichte (Stuttgart: Apotheker-Verlag, 1967).  Also, see Robert P. Multhauf, The History of Chemical Technology: An \nAnnotated Bibliography (Garland: New York 1984). \n10 For archives relevant to the chemical  practices used in British pharmacology, see Lesley Richmond, Julie Stevenson and Alison \nTurner (eds), The Pharmaceutical Industry: A Guide to the Historical Records (Aldershot: Ashgate, 2003).  For Germany, see \nChristoph Schuemann, Der Anteil deutscher Apotheker and der Entwicklung der technischen Chemie zwischen 1750 und 1850 \n(Frankfurt: Peter Lang 1997). \n"}