{"doi":"10.1093\/cercor","coreId":"65667","oai":"oai:dro.dur.ac.uk.OAI2:5138","identifiers":["oai:dro.dur.ac.uk.OAI2:5138","10.1093\/cercor"],"title":"Visually guided reaching depends on motion area MT+.","authors":["Whitney,  D.","Ellison,  A.","Rice,  N. J.","Arnold,  D.","Goodale,  M.","Walsh,  V.","Milner,  A. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11-01","abstract":"Visual information is crucial for goal-directed reaching. A number of studies have recently shown that motion in particular is an important source of information for the visuomotor system. For example, when reaching a stationary object, movement of the background can influence the trajectory of the hand, even when the background motion is irrelevant to the object and task. This manual following response may be a compensatory response to changes in body position, but the underlying mechanism remains unclear. Here we tested whether visual motion area MT+ is necessary to generate the manual following response. We found that stimulation of MT+ with transcranial magnetic stimulation significantly reduced a strong manual following response. MT+ is therefore necessary for generating the manual following response, indicating that it plays a crucial role in guiding goal-directed reaching movements by taking into account background motion in scenes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65667.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5138\/1\/5138.pdf","pdfHashValue":"dc3c70629feb7942397aeb2e8ef4b99e2389ab45","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5138<\/identifier><datestamp>\n      2017-03-07T14:34:53Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Visually guided reaching depends on motion area MT+.<\/dc:title><dc:creator>\n        Whitney,  D.<\/dc:creator><dc:creator>\n        Ellison,  A.<\/dc:creator><dc:creator>\n        Rice,  N. J.<\/dc:creator><dc:creator>\n        Arnold,  D.<\/dc:creator><dc:creator>\n        Goodale,  M.<\/dc:creator><dc:creator>\n        Walsh,  V.<\/dc:creator><dc:creator>\n        Milner,  A. D.<\/dc:creator><dc:description>\n        Visual information is crucial for goal-directed reaching. A number of studies have recently shown that motion in particular is an important source of information for the visuomotor system. For example, when reaching a stationary object, movement of the background can influence the trajectory of the hand, even when the background motion is irrelevant to the object and task. This manual following response may be a compensatory response to changes in body position, but the underlying mechanism remains unclear. Here we tested whether visual motion area MT+ is necessary to generate the manual following response. We found that stimulation of MT+ with transcranial magnetic stimulation significantly reduced a strong manual following response. MT+ is therefore necessary for generating the manual following response, indicating that it plays a crucial role in guiding goal-directed reaching movements by taking into account background motion in scenes. <\/dc:description><dc:subject>\n        Action<\/dc:subject><dc:subject>\n         Localization<\/dc:subject><dc:subject>\n         Manual following response<\/dc:subject><dc:subject>\n         Perception<\/dc:subject><dc:subject>\n         Pointing<\/dc:subject><dc:subject>\n         TMS<\/dc:subject><dc:subject>\n         Visuomotor.<\/dc:subject><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        Cerebral cortex, 2007, Vol.17(11), pp.2644-2649 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5138<\/dc:identifier><dc:identifier>\n        issn:1047-3211<\/dc:identifier><dc:identifier>\n        issn: 1460-2199<\/dc:identifier><dc:identifier>\n        doi:10.1093\/cercor\/bhl172<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5138\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1093\/cercor\/bhl172<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5138\/1\/5138.pdf<\/dc:identifier><dc:rights>\n        This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http:\/\/creativecommons.org\/licenses\/by-nc\/2.0\/uk\/) which\\ud\npermits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1460-2199","issn: 1460-2199","1047-3211","issn:1047-3211"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Action","Localization","Manual following response","Perception","Pointing","TMS","Visuomotor."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n13 May 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWhitney, D. and Ellison, A. and Rice, N. J. and Arnold, D. and Goodale, M. and Walsh, V. and Milner, A. D.\n(2007) ’Visually guided reaching depends on motion area MT+.’, Cerebral cortex., 17 (11). pp. 2644-2649.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/cercor\/bhl172\nPublisher’s copyright statement:\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial\nLicense (http:\/\/creativecommons.org\/licenses\/by-nc\/2.0\/uk\/) which permits unrestricted non-commercial use,\ndistribution, and reproduction in any medium, provided the original work is properly cited.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \n \nDurham Research Online \n \nDeposited in DRO: \n13 May 2009 \n \nPeer-review status of attached file: \nPeer-reviewed \n \nPublication status of attached file: \nAdvance access \n \nCitation for published item: \nWhitney, D. and Ellison, A. and Rice, N. J. and Arnold, D. and Goodale, M. and Walsh, V. \nand Milner, A. D. (2007) 'Visually guided reaching depends on motion area MT+.', Cerebral \ncortex., 17 (11). pp. 2644-2649. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1093\/cercor\/bhl172 \n \nCopyright statement: \nThis is an Open Access article distributed under the terms of the Creative Commons \nAttribution Non-Commercial License (http:\/\/creativecommons.org\/licenses\/by-nc\/2.0\/uk\/) \nwhich permits unrestricted non-commercial use, distribution, and reproduction in any \nmedium, provided the original work is properly cited. \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nVisually Guided Reaching Depends on\nMotion Area MT1\nDavid Whitney1,2, Amanda Ellison3, Nichola J. Rice4, Derek\nArnold5, Melvyn Goodale6, Vincent Walsh7 and David Milner3\n1The Center for Mind and Brain and 2The Department of\nPsychology, The University of California, Davis, CA, USA,\n3Wolfson Research, University of Durham, Durham, UK,\n4Volen Center for Complex Systems, Brandeis University, MA,\nUSA, 5The School of Psychology, The University of\nQueensland, Australia, 6The University of Western Ontario,\nLondon, Ontario, Canada and 7The Institute of Cognitive\nNeuroscience, University College London, London, UK\nVisual information is crucial for goal-directed reaching. A number of\nstudies have recently shown that motion in particular is an impor-\ntant source of information for the visuomotor system. For example,\nwhen reaching a stationary object, movement of the background\ncan influence the trajectory of the hand, even when the background\nmotion is irrelevant to the object and task. This manual following\nresponse may be a compensatory response to changes in body\nposition, but the underlying mechanism remains unclear. Here we\ntested whether visual motion area MT1 is necessary to generate\nthe manual following response. We found that stimulation of MT1\nwith transcranial magnetic stimulation significantly reduced a\nstrong manual following response. MT1 is therefore necessary\nfor generating the manual following response, indicating that it\nplays a crucial role in guiding goal-directed reaching movements by\ntaking into account background motion in scenes.\nKeywords: action, localization, manual following response, perception,\npointing, TMS, visuomotor\nIntroduction\nVisual motion is constantly produced as we move our eyes and\nhead and as objects in the world move around us. The\nvisuomotor system therefore faces a serious challenge in that\nit must register target as well as background motion and then\nsegment these different sources of motion when directing ac-\ntions to objects. Over the last 3 decades, a broad and expanding\nliterature has examined how the visuomotor system processes\nand uses visual motion in goal-directed behavior.\nSeveral different forms of visual motion are used by the\nvisuomotor system, including motion of objects themselves and\nmotion of the background. Goal-directed behavior clearly de-\npends on the accuracy and efficiency with which the visual sys-\ntem codes object motion and position. Background motion, on\nthe other hand, has a less understood role in visually guided\naction. Although there is a clear influence of background optic\nflow on posture, heading, and locomotion in general (Lee and\nAronson 1974; Warren et al. 1988, 2001; Royden et al. 1992;\nBritten and van Wezel 1998), more recent studies have shown,\nsurprisingly, that background motion also influences goal-\ndirected reaching (Mohrmann-Lendla and Fleischer 1991;\nBrenner and Smeets 1997; Whitney et al. 2003; Saijo et al.\n2005). The reason that background retinal motion influences\nreaching is debated; it is possible that the hand is dragged\nalong with background motion in a manual following response\n(Saijo et al. 2005), akin to the well-known ocular following\nresponse (Miles et al. 1986). Alternatively, or in addition, the\nvisual or visuomotor system might use background retinal\nmotion to update (shift) the coded locations of targets, which\ncauses subsequent deviations in the hand’s trajectory (Whitney\net al. 2003). The functional role of both mechanisms could be to\nhelp compensate for movements of the eye, head, or body\n(Whitney et al. forthcoming), and the end result of both\nhypotheses is a drift in the trajectory of reaching movements\ndue to background retinalmotion (amanual following response).\nUnfortunately, theneural locus of this process remains unknown.\nAccumulating psychophysical evidence on the manual follow-\ning response is consistent with the physiological responses of\nneurons in the MT complex (MT+, including MT and MST; Zeki\n1974; Albright 1984; Newsome et al. 1986; Tanaka and Saito 1989;\nOrban 1998; Rees et al. 2000; Culham et al. 2001; Huk and Heeger\n2002). For example, the manual following response is contrast-\ndependent and spatiotemporally tuned tohigher velocities (Gomi\net al. 2006), visual motion that covers larger portions of the visual\nfield produces a stronger influence on reaching (Saijo et al. 2005),\nand visual motion in one region of the visual field causes a manual\nfollowing response to targets in remote regions (Whitney et al.\n2003; Whitney and Goodale 2005). All these factors are more\nconsistent with the properties and tuning of neurons within the\nMT+ complex thanwith neurons in other visual areas (Tanaka and\nSaito 1989; Orban 1998). In addition, the manual following\nresponse correlates with the coherence of global motion (Saijo\net al. 2005), similar to MT+ (Newsome et al. 1986; Rees et al.\n2000). Finally, the manual following response occurs with a very\nshort latency (under 150 ms; Brenner and Smeets 1997; Whitney\net al. 2003; Saijo et al. 2005; Gomi et al. 2006), consistent with the\nbrief neuronal latencies of MT+ responses (Ffytche et al. 1995;\nSchmolesky et al. 1998; Pascual-Leone and Walsh 2001). To-\ngether, the psychophysical evidence suggests that cortical\nmotion areaswithinMT+mayplay an important role incontrolling\nreaching in the presence of background visual motion.\nTodirectly testwhetherMT+processingofbackgroundmotion\nis used to control visually guided reaching, wemeasured reaching\nmovements to stationary targets following visual motion adapta-\ntionwhile transcranialmagnetic stimulation (TMS)was applied to\nMT+. The results showed that there was a manual following\nresponse after motion adaptation in a direction consistent with\nthe motion aftereffect (MAE). Disruption of MT+, however,\nabolished this manual following response, demonstrating that\nMT+ processing influences visuomotor behavior. Sham and\ncontrol conditions confirmed that MT+ stimulation selectively\nmitigated themanual following response.Weconducted a second\nexperiment to confirm that our stimulation of MT+ effectively\ndisrupted a motion-induced perceptual illusion. Together, the\nexperiments suggest thatMT+ processesmotion information that\ndirectly influences bothmanual localization (goal-directed reach-\ning) and perceptual localization (perceived position).\nCerebral Cortex November 2007;17:2644--2649\ndoi:10.1093\/cercor\/bhl172\nAdvance Access publication February 8, 2007\n\u0001 2007 The Authors\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http:\/\/creativecommons.org\/licenses\/by-nc\/2.0\/uk\/) which\npermits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited.\nMaterials and Methods\nSeven subjects participated in the visually guided reaching experiment,\n3 of whom were naive as to the purpose of the study. Each subject had\nnormal or corrected-to-normal visual acuity. The subject’s head was\nplaced in a chin rest 40 cm from a cathode ray tube (CRT; 800 3 600,\n100 Hz), driven by a Macintosh G4 Powerbook. The adaptation stimulus\nconsisted of a small drifting square-wave grating (8.49 3 4.25 deg, 0.12\ncycles\/deg, 4.1 Hz), presented within a stationary rectangular aperture\nin the right visual field (the precise location was determined separately\nfor each subject; see below). Following adaptation, a small (0.43 3 0.85\ndeg) target was presented during the test phase for 20 ms vertically\ncentered within the adapted region. The target could be presented in\nany one of 3 horizontal locations (within a range of ±1.7 deg around the\ncenter of the adapted region), determined randomly on each trial. To\nprevent subjects from memorizing the relative location of the target to\nthe fixation point, the horizontal position of the fixation point was\nrandomly jittered within a 1.7 deg window. Figure 1 shows a diagram of\nthe stimulus. Following an initial adaptation period of 30 s, interleaved\n3000 ± 100--ms adaptation and 20-ms test phases were presented (see\nFig. 1 for event sequence). A 300-ms interstimulus interval separated\neach adaptation and test period. During each test phase, subjects were\ninstructed to point as quickly as possible at the stationary target with\ntheir index finger (hitting the CRT with their finger). No feedback was\nprovided about pointing accuracy. In separate sessions, subjects adapted\nto either rightward or leftward motion. Leftward and rightward motion\nwas not interleaved because this prevents the buildup of motion\nadaptation. Within each session, there were 3 target positions and 10\nrepeated trials at each of these positions. Each session was repeated\ntwice for each direction of motion for a total of 120 trials.\nAn infrared marker was attached to the subject’s index finger, and an\nOptotrak 3020 (NDI, Waterloo, Ontario, Canada) was used to track the\nsubject’s finger throughout the trial. The Optotrak collected the finger\nposition at 250 Hz, with a spatial resolution of ~0.1 mm3. The trajectory\nof each reaching movement was recorded, as was the end point (landing\nposition of the finger on the CRT). The measure of primary interest was\nthe constant error (the distance between the end point reach position\nand actual target location), which was measured on each trial. The\naverage constant error following leftward and rightward motion adap-\ntation was compared using both within- and between-subjects non-\nparametric statistics.\nOn each trial, 100 ms before the target was presented, a trigger was\nsent from the Macintosh G4 to a Magstim\u0002 SuperRapid magnetic\nstimulator (Whitland, SouthWest Wales, UK), which generated the TMS.\nRepetitive TMS (rTMS) was delivered at 12 Hz for 500 ms and therefore\ncovered the entire period of time during which the target was visible.\nThe TMS was not delivered during motion adaptation. TMS was\ndelivered in 3 separate conditions: the experimental site, MT+; a sham\ncondition in which the TMS coil was placed adjacent to the subject, so\nthe subject could hear the audible effect of stimulation but did not\nreceive magnetic stimulation to the brain; and a control site that we do\nnot believe mediates the manual following response (the vertex). In the\nsham and control conditions, we expected no influence of TMS on the\nresulting reaching movement. To be sure that we were, in fact,\nstimulating MT+, moving phosphenes were functionally localized in\neach subject, as these are known to be generated selectively in motion\narea MT+ and are a standard method of reliably localizing the motion-\nselective region (Walsh et al. 1998; Stewart et al. 1999; Pascual-Leone\nand Walsh 2001; Battelli et al. 2002; Theoret et al. 2002; McGraw et al.\n2004; O’Shea et al. 2004; Silvanto et al. 2005). Data was collected in\nseparate runs for each of the 3 stimulation conditions (120 trials per\ncondition, as described above, for a grand total of 360 trials).\nTo localize moving phosphenes, we began by stimulating the subject’s\ninions (primary visual areas) at 50--70% intensity using a 70-mmfigure-of-\neight coil while they viewed a blank CRT screen or closed their eyes.\nEach subject reported that they perceived small static phosphenes with\nstimulation at the inion. Bymoving laterally in incremental steps, subjects\nbegan to perceive moving phosphenes. Once subjects reported perceiv-\ning consistent moving phosphenes, they were instructed to indicate the\nlocation in the visual field in which the moving phosphenes were\nperceived. All subjects reportedmovingphosphenes that covered at least\npart of one quadrant of the visual field. The stimulation site was only\nconsidered valid if, after removing and repositioning the coil, the same\nphosphene location could be generated. We only stimulated the left\nhemisphere with the TMS coil placed tangential to the skull with\nthe handle pointed backward, parallel to the horizontal and midsagittal\nplane. In each case, the TMS coil was held in place by the experimenter,\nand should any head movements take place, the coil was repositioned\nmanually. Subjects perceived moving phosphenes exclusively in their\nright visual field. In one subject, we compared functional and structural\nmagnetic resonance imaging to the stimulated location and confirmed\nthat our stimulation site was centered on the MT+ region using Brain-\nSight\u0002 frameless stereotaxic software (Rogue Research, Montreal,\nCanada). The average location of the TMS-localized MT+ regions was\n3.6 cm dorsal and 4.14 cm lateral to the inion (standard deviation ±0.92\ncm lateral and ±1.1 cm dorsal). The identified location of MT+ in 2 of the\nsubjects was consistent with that previously found for these subjects\n(Walsh et al. 1998).\nOnce MT+ was localized, the adaptation and test stimuli (described\nabove, Fig. 1) were placed within the region of the visual field covered\nby the localized moving phosphene. This ensured that the motion-\nadapted region (dashed rectangle in Fig. 1) fell within a region of the\nvisual field covered by TMS. During the experimental sessions, stimu-\nlation was 65% maximum stimulator intensity (1.3 T). Subjects reported\nthat the moving phosphenes were not visible during the experimental\nsession because they were attending to the task, and the high contrast\ntest stimulus (above) was easily visible. Because the moving phosphenes\nwere not visible and because the manual following response is strongly\ndependent on luminance contrast (Gomi et al. 2006), the phosphenes\nwould not interact with or generate a manual following response.\nIn a second experiment, the methods above were used, with the\nexception that 3 subjects judged the relative position of the static\nflashed target, rather than reaching to it. Following adaptation to the\nstimulus above, 2 vertically aligned flashes were presented; one flash was\nthe same target as in the reaching experiment and a second was\na vernier comparison flash. The comparison flash was in all respects\nidentical to the target except that it was presented below and outside\nthe motion-adapted region. The comparison flash could be at one of 6\nhorizontally displaced locations relative to the original target (either to\nthe left or right of the target). In a 2-alternative forced choice (binary\nchoice) task, subjects reported whether the target (located in the\nmotion-adapted region) appeared to the left or right of the vernier\ncomparison flash. There were 15 trials for each of the 6 vernier offsets,\nfor a total of 90 trials per session with an intertrial interval of 1 s. Each\nsubject participated in 2 sessions, one with TMS stimulation of MT+ on\neach trial and the other with sham and control TMS stimulation (de-\nscribed above). The responses of each subject were fit with the logistic\nfunction f ðxÞ=½1=ð1 + exp½aðx–bÞ\u0001Þ\u0001, where (b) estimates the physical\nmisalignment between the flashes that creates an apparent alignment\n(the point of subjective equality, [PSE]; Finney 1971; McKee et al. 1985)\nand (a) indicates the slope of the function.\nResults\nThe manual following response—a deviation in the trajectory of\nreaching movements in the presence of backgroundmotion—has\nTestAdaptation\nAdapt (30 s)\nTop-up (3 s)\nTest (20 ms)\nFigure 1. Stimulus and procedure in the first experiment. A drifting luminance-defined\nsquare-wave grating was presented within a stationary rectangular aperture during the\nadaptation periods. The direction of motion was leftward or rightward in separate\nconditions. Subjects always fixated at the bull’s eye. During the test period, a flashed\ntarget was presented in a randomly determined position within the motion-adapted\nregion (the dashed rectangle indicates the motion-adapted region and was not visible\nduring the experiment). The stimuli are not drawn to scale.\nCerebral Cortex November 2007, V 17 N 11 2645\nbeen reported several times (Fleischer 1991; Brenner and\nSmeets 1997; Yamagishi et al. 2001; Whitney et al. 2003;\nMohrmann-Lendla and Saijo et al. 2005; Gomi et al. 2006) but\nhas not been reported following exposure to motion (motion\nadaptation). Figure 2 shows that following adaptation to visual\nmotion, there was a shift in the end point of reaching move-\nments in a direction opposite that of the previously visible\nmotion. Six of the 7 subjects displayed a consistent and sig-\nnificant deviation in their reaching movements (the least\nsignificant within-subject effect was for subject SF, Wilcoxon\nsigned ranks test, Z = 2.5, P < 0.05). The average manual fol-\nlowing response across all 7 subjects was 2.9 mm in a direction\nopposite that of the prior motion (Fig. 2; Z = 2.1, P < 0.05).\nPrevious studies have found that visual motion present during\na reach produces a manual following response (Mohrmann-\nLendla and Fleischer 1991; Brenner and Smeets 1997; Yamagishi\net al. 2001; Whitney et al. 2003; Saijo et al. 2005), and the pres-\nent results extend this finding by showing that prior motion\nexposure (motion adaptation) can influence visuomotor control\nas well.\nOur goal in the experiment was to measure whether the\ndeviation in reaching movements (the manual following re-\nsponse) is due to processing in MT+. Figure 3A shows that in the\nsham and control conditions, when TMS was applied to the\nvertex or away from the subject’s head, there was a significant\nshift in the average end point of the reaching movements. In the\nsham condition, in which TMS was delivered away from the\nhead, the average deviation was 3.3 mm (Wilcoxon signed ranks\ntest, Z = 2.05, P < 0.05); in the control condition, in which TMS\nwas delivered to the vertex, the reach end point deviation was\n2.5 mm (Z = 1.9, P < 0.05). There was not a significant difference\nin the manual following response between the sham and control\nconditions (Z = 0.85, P > 0.05). When rTMS was delivered to\nMT+, the end point deviation in the reaching movement was\nreduced to 0.45 mm (a significant reduction, Z = 2.08, P < 0.05)\nand was not significantly different from zero (Z = 0.17, P > 0.05).\nAll 6 of the 7 subjects who showed a manual following response\nin Figure 2 showed a reduction in the error with TMS stimu-\nlation of MT+. Figure 3B confirms that the end points of each\nsubject’s reaching movements correlated with the 3 physical\ntarget locations; this indicates that subjects did not reach to\nrandom locations but were able to discriminate the 3 target\npositions (the least significant effect of target location was for\nsubject SE, F2,357 = 644.9, P < 0.05).\nFigure 4 shows the results of the second experiment, which\nmeasured the perceived shift in the positions of the targets due\nto motion adaptation with and without stimulation of MT+ with\nrTMS. Without MT+ stimulation, subjects perceived a strong\nshift in the position of the target flashed within the motion-\nadapted region (weakest perceived shift was for subject SF, v21 =\n34.9, P < 0.01). This is consistent with the results of several\nauthors who have found that motion adaptation influences\nsubsequent position judgments (Snowden 1998; Nishida and\nJohnston 1999; Whitaker et al. 1999; McGraw et al. 2002;\nWhitney and Cavanagh 2003). When MT+ was stimulated, how-\never, the perceived shift was significantly reduced (the least\nsignificant reduction in the perceived shift was for subject SE;\nv21 = 12.1, P < 0.01). This confirms previous reports that TMS\nstimulation of MT+ reduces motion-induced position displace-\nments (McGraw et al. 2004) and demonstrates that MT+ is\ninvolved in the assignment of a moving object’s location (or\na static object’s location following previously exposed visual\nmotion), perhaps via reentrant or feedback connections (Shipp\nand Zeki 1989; Pascual-Leone and Walsh 2001).\nDiscussion\nThe results of the first experiment demonstrated that visual\nmotion processed in MT+ influences goal-directed reaching.\nSeveral previous reports that background visual motion influ-\nences reaching (Mohrmann-Lendla and Fleischer 1991; Brenner\nand Smeets 1997; Whitney et al. 2003; Saijo et al. 2005; Whitney\nand Goodale 2005) are therefore likely to be mediated by\na necessary contribution of MT+. This is consistent with the\n***\n-2\n0\n2\n4\n6\nSA SB SC SD SE SF SG Avg\n*** ** *** *** ***\n***P < 0.001 **P < 0.01 * P < 0.05\nR\nea\nch\n e\nrr\nor\n (m\nm\n)\nFigure 2. The manual following response of reaching movements to a stationary\nobject after visual motion adaptation in the sham and control TMS conditions. Positive\nvalues on the ordinate indicate a deviation in the end point of the reaching movement\nopposite the direction of motion adaptation. There was a significant average deviation\n(Z5 2.1, P\\0.05). Individually, 6 of the 7 subjects showed a significant positive error\n(consistent with the MAE, although no motion was perceived during the test period).\nOf the 6 subjects who showed a manual following response, the least significance was\nfor subject SF (Wilcoxon signed ranks test, Z5 2.5, P\\ 0.05). These results indicate\nthat prior exposure to motion influences goal-directed reaching. Error bars, 95%\nconfidence intervals.\n3\n0\n1\n2\nSham MT+\n* *\nn.s.\nR\nea\nch\n e\nrro\nr (\nmm\n)\n4\n-12 0 12\n-8\n-4\n0\n4\n8\nPhysical target\nlocation (mm)\nR\nea\nch\n e\nnd\npo\nin\nt (m\nm)\nBA\nCntrl\nFigure 3. The effect of MTþ disruption on the manual following response. (A) In\nsham and control conditions, rTMS was delivered away from, or to the vertex of, each\nsubject’s head. There remained a significant manual following response in both\nconditions (Z 5 2.05 and 1.9, respectively, P\\ 0.05, indicated by the asterisks). In\nthe experimental condition, rTMS was directed to each subject’s motion-sensitive\ncortical region MTþ\/V5 during the test period (but not during motion adaptation). In\nthis condition, the manual following response was not significantly different from zero\n(Z 5 0.17, P[ 0.05). The results indicate that disruption of MTþ eliminates the\nmanual following response and suggest that MTþ processes motion information for\nreaching movements to static objects. (B) Results for 3 representative subjects\nshowing that reaching movements to the 3 targets were differentiable (subjects did\nnot point to random locations). All 7 subjects showed a significant difference in end\npoint reach position as a function of the physical target location (the least significant\neffect of physical target position was for subject SB, F2,357 5 644.9, P\\ 0.05). Error\nbars ± standard error of mean.\n2646 Manual Following Response Depends on MT+ d Whitney et al.\nfinding that lesions to area MT+ in the human or monkey not\nonly impair motion perception (Zihl et al. 1983; Newsome et al.\n1985; Newsome and Pare 1988; Zeki 1991; Stoner and Albright\n1992; Marcar et al. 1997; Vaina 1998) but also limit these\nsubjects’ abilities to interact with moving objects (Schenk et al.\n2000). Similarly, stimulating MT+ with TMS impairs reaching to\nmoving objects (Schenk et al. 2005). The results of the present\nexperiment show that MT+ is not only crucial for acting on\nmoving objects but also plays an important role in reaching to\nstationary objects following exposure to background motion.\nThe fact that prior exposure to motion (i.e., motion adapta-\ntion) produced a manual following response, or deviation in the\ntrajectory of the hand, suggests that the output of motion op-\nponent mechanisms may be used by the visuomotor system. The\nsame mechanisms of motion opponency that allow the percep-\ntual system to maintain equilibrium or calibrate (e.g., as revealed\nby motion adaptation and aftereffects) may afford the visuomo-\ntor system a similar benefit. For example, by adapting to the\nstate of motion in the environment, the visuomotor system—\nlike the perceptual system—may enhance its sensitivity to\nchanges in visual motion; this, in turn, may provide a better or\nmore precise measure of ego motion. This sort of similar op-\nponent motion processing for perception and visuomotor be-\nhavior could help bridge studies that have found an influence of\nvisual (and illusory) motion on reaching (Mohrmann-Lendla and\nFleischer 1991; Brenner and Smeets 1997; Brouwer et al. 2002;\nWhitney et al. 2003; Saijo et al. 2005; Whitney and Goodale\n2005; Gomi et al. 2006) with studies that suggest that MT+ is the\nneural locus of the MAE (Tootell et al. 1995; He et al. 1998;\nCulham et al. 1999; Theoret et al. 2002).\nPrevious research on the manual following response has used\ncontinuously visible motion during the reaching movement\n(Mohrmann-Lendla and Fleischer 1991; Brenner and Smeets\n1997; Whitney et al. 2003; Saijo et al. 2005; Gomi et al. 2006).\nSome studies have varied motion onset (Brenner and Smeets\n1997; Saijo et al. 2005; Gomi et al. 2006), duration (Whitney et al.\n2003; Saijo et al. 2005), or the timing of motion reversals\n(Whitney et al. 2003). In the present study, however, we wanted\nto avoid having a strongly visible motion signal during the\nreaching phase of the trial and we wanted to avoid having any\nother visible stimulus when the target was presented. The result\nwas that subjects perceived visual motion neither during the\ntarget presentation (Whitney and Cavanagh 2003) nor during\nthe reaching phase of the trial. We can therefore safely con-\nclude that it was the internal state of motion adaptation that\ncaused the manual following response and that MT+ mediated\nthis response.\nIt has been suggested that background visual (i.e., retinal)\nmotion is used by the visuomotor system as a source of feedback\nfor gauging and compensating for body movements (Whitney\net al. 2003). Several facts lend credence to this hypothesis,\nincluding the fact that visual motion is rapidly processed (both\nneural and psychophysically measured latencies are extremely\nbrief; Tynan and Sekuler 1982; Allik and Dzhafarov 1984;\nSchmolesky et al. 1998; Jancke et al. 2004) and visual motion\ninfluences posture (Lee and Aronson 1974; Lee 1980), heading\nand locomotion (Britten and van Wezel 1998; Warren et al.\n2001; Srinivasan and Zhang 2004), and eye movements (Yee\net al. 1983; Collewijn and Tamminga 1984; Keller and Khan\n1986; Miles et al. 1986; Howard and Marton 1992; Masson et al.\n***\n***\n***\n0\n2\n6\n4\n8\n10\nSE SF SG Avg\nP\ner\nce\niv\ned\n m\nis\nal\nig\nn-\nm\nen\nt (\nm\nm\n)\nC\n0\n0.3\n0.9\n0.6\n1.2\n1.5\nP\ner\nce\niv\ned\n m\nis\nal\nig\nn-\nm\nen\nt (\nde\ng)\n0 1.5 4.5\n0\n0.2\n0.4\n0.6\n0.8\n1\nPhysical misalignment (mm)\nSF\nP\nro\npo\nrti\non\n re\nsp\non\nse\ns\nop\npo\nsi\nte\n d\nire\nct\nio\nn\npr\nio\nr m\not\nio\nn\nB\n3 6\nPerceptTestAdaptation\nA\nFigure 4. Stimuli and results of the second experiment. (A) The stimulus in the second experiment was identical to that in the first experiment, with the exception that an additional\nreference target was flashed below the motion-adapted region. In the test period, subjects made a vernier alignment judgment. Following motion adaptation, subjects perceived\nphysically aligned targets to appear misaligned, consistent with previous reports (Whitney and Cavanagh 2003). (B) Psychometric functions for subject SF revealing the perceived\nmisalignment between the flashed test stimuli with sham TMS (squares) and with TMS of MTþ (circles). The ordinate shows the proportion of flashed targets in the motion-\nadapted region that appeared shifted opposite the direction of previously viewed motion. The abscissa shows the relative misalignment between the 2 flashed targets; positive\nvalues indicate that the target in the motion-adapted region was physically shifted in the direction of prior motion. The PSE on the psychometric function (PSE, indicated by 50%\npoint on the psychometric function) is the physical misalignment between the flashes that created an apparent alignment between them (i.e., the point at which the illusion in A was\nnulled). For the psychometric functions in (B), the perceived misalignment in the sham condition was 3 mm and the perceived misalignment with stimulation of MTþ was 0.9 mm,\na significant reduction (maximum likelihood ratio test, v21 5 23.5, P\\ 0.001). (C) rTMS of MTþ significantly reduced the perceived misalignment between the flashed targets for\nall 3 subjects. The white bars indicate TMS of MTþ; the black and gray bars indicate sham and control TMS, respectively. The least significant reduction occurred in the control\nversus MTþ stimulation conditions for subject SE (v21 5 12.1, P\\0.01). Within each subject, all pairwise comparisons (MTþ vs. control or sham stimulation) were significant at\nthe 0.01 level (X2 test, Bonferroni corrected for multiple comparisons), indicated by the asterisks. Error bars ± standard error of the logistic curve fit.\nCerebral Cortex November 2007, V 17 N 11 2647\n1995; Mohrmann and Thier 1995; Niemann and Hoffmann 1997;\nSchwarz and Ilg 1999). The results here suggest that if visual\nmotion serves a functional role—helping to compensate for\nbody movements during reaching (Whitney et al. 2003)—then\nMT+ plays an integral part in this process. Further, the results\nhere raise the intriguing possibility that without area MT+, we\nmight not only be impaired at intercepting moving objects\n(Schenk et al. 2005), but also have deficits interacting with\nstatic objects as we move around the world.\nNotes\nThanks to Dr Daniel Wolpert for providing testing space and the use of\nan Optotrak, to Dr Rob McIntosh for providing analysis software, and to\nDr Juha Silvanto for help collecting pilot data. Thanks also to Dr Hiroaki\nGomi, Dr Alan Johnston, and Dr Ikuya Murakami for helpful discussions.\nThis work was supported by grants from the National Institutes of\nHealth (DW), the Leverhulme Trust (DM), and Canadian Institutes of\nHealth Research (MG). Conflict of Interest: None declared.\nFunding to pay the Open Access publication charges for this article\nwas provided by the University of California, Davis.\nAddress correspondence to email: dwhitney@ucdavis.edu.\nReferences\nAlbright TD. 1984. Direction and orientation selectivity of neurons in\nvisual area MT of the macaque. J Neurophysiol. 52:1106--1130.\nAllik J, Dzhafarov EN. 1984. Reaction time to motion onset: local\ndispersion model analysis. Vision Res. 24:99--101.\nBattelli L, Black KR, Wray SH. 2002. Transcranial magnetic stimulation of\nvisual area V5 in migraine. Neurology. 58:1066--1069.\nBrenner E, Smeets JB. 1997. Fast responses of the human hand to\nchanges in target position. J Mot Behav. 29:297--310.\nBritten KH, van Wezel RJ. 1998. Electrical microstimulation of cortical\narea MST biases heading perception in monkeys. Nat Neurosci.\n1:59--63.\nBrouwer AM, Brenner E, Smeets JB. 2002. Hitting moving objects:\nis target speed used in guiding the hand? Exp Brain Res. 143:\n198--211.\nCollewijn H, Tamminga EP. 1984. Human smooth and saccadic eye\nmovements during voluntary pursuit of different target motions on\ndifferent backgrounds. J Physiol. 351:217--250.\nCulham J, He S, Dukelow S, Verstraten FA. 2001. Visual motion and the\nhuman brain: what has neuroimaging told us? Acta Psychol.\n107:69--94.\nCulham JC, Dukelow SP, Vilis T, Hassard FA, Gati JS, Menon RS, Goodale\nMA. 1999. Recovery of fMRI activation in motion area MT following\nstorage of the motion aftereffect. J Neurophysiol. 81:388--393.\nFfytche DH, Guy CN, Zeki S. 1995. The parallel visual motion inputs\ninto areas V1 and V5 of human cerebral cortex. Brain. 118:\n1375--1394.\nFinney DJ. 1971. Probit analysis. Cambridge (UK): University Press.\nGomi H, Abekawa N, Nishida S. 2006. Spatiotemporal tuning of rapid\ninteractions between visual-motion analysis and reaching move-\nment. J Neurosci. 26:5301--5308.\nHe S, Cohen ER, Hu X. 1998. Close correlation between activity in brain\narea MT\/V5 and the perception of a visual motion aftereffect. Curr\nBiol. 8:1215--1218.\nHoward IP, Marton C. 1992. Visual pursuit over textured backgrounds in\ndifferent depth planes. Exp Brain Res. 90:625--629.\nHuk AC, Heeger DJ. 2002. Pattern-motion responses in human visual\ncortex. Nat Neurosci. 5:72--75.\nJancke D, Erlhagen W, Schoner G, Dinse HR. 2004. Shorter latencies for\nmotion trajectories than for flashes in population responses of cat\nprimary visual cortex. J Physiol. 556:971--982.\nKeller EL, Khan NS. 1986. Smooth-pursuit initiation in the presence of\na textured background in monkey. Vision Res. 26:943--955.\nLee DN. 1980. The optic flow field: the foundation of vision. Philos Trans\nR Soc Lond B Biol Sci. 290:169--179.\nLee DN, Aronson E. 1974. Visual proprioceptive control of standing in\nhuman infants. Percept Psychophys. 15:529--532.\nMarcar VL, Zihl J, Cowey A. 1997. Comparing the visual deficits of\na motion blind patient with the visual deficits of monkeys with area\nMT removed. Neuropsychologia. 35:1459--1465.\nMasson GS, Proteau L, Mestre DR. 1995. Effects of stationary and moving\ntextured backgrounds on the visuo--oculo-manual tracking in\nhumans. Vision Res. 35:837--852.\nMcGraw PV, Walsh V, Barrett BT. 2004. Motion-sensitive neurones in\nV5\/MT modulate perceived spatial position. Curr Biol. 14:\n1090--1093.\nMcGraw PV, Whitaker D, Skillen J, Chung ST. 2002. Motion adaptation\ndistorts perceived visual position. Curr Biol. 12:2042--2047.\nMcKee SP, Klein SA, Teller DY. 1985. Statistical properties of forced-\nchoice psychometric functions: implications of probit analysis.\nPercept Psychophys. 37:286--298.\nMiles FA, Kawano K, Optican LM. 1986. Short-latency ocular following\nresponses of monkey. I. Dependence on temporospatial properties\nof visual input. J Neurophysiol. 56:1321--1354.\nMohrmann H, Thier P. 1995. The influence of structured visual\nbackgrounds on smooth-pursuit initiation, steady-state pursuit and\nsmooth-pursuit termination. Biol Cybern. 73:83--93.\nMohrmann-Lendla H, Fleischer AG. 1991. The effect of a moving back-\nground on aimed hand movements. Ergonomics. 34:353--364.\nNewsomeWT, Mikami A, Wurtz RH. 1986. Motion selectivity in macaque\nvisual cortex. III. Psychophysics and physiology of apparent motion.\nJ Neurophysiol. 55:1340--1351.\nNewsome WT, Pare EB. 1988. A selective impairment of motion\nperception following lesions of the middle temporal visual area\n(MT). J Neurosci. 8:2201--2211.\nNewsome WT, Wurtz RH, Dursteler MR, Mikami A. 1985. Deficits in\nvisual motion processing following ibotenic acid lesions of the\nmiddle temporal visual area of the macaque monkey. J Neurosci.\n5:825--840.\nNiemann T, Hoffmann KP. 1997. The influence of stationary and moving\ntextured backgrounds on smooth-pursuit initiation and steady state\npursuit in humans. Exp Brain Res. 115:531--540.\nNishida S, Johnston A. 1999. Influence of motion signals on the\nperceived position of spatial pattern. Nature. 397:610--612.\nOrban GA. 1998. Visual processing in macaque area MT\/V5 and\nits satellites (MSTd and MSTv). In: Rockland KS, Kaas JH, Peters A,\nGross CG, Schiller PH, Rose MG, Bullier J, Roe AW, editors. Cerebral\ncortex: extrastriate cortex in primates. Boston: Plenum Publishing.\np. 359--434.\nO’Shea J, Muggleton NG, Cowey A, Walsh V. 2004. Timing of target\ndiscrimination in human frontal eye fields. J Cogn Neurosci.\n16:1060--1067.\nPascual-Leone A, Walsh V. 2001. Fast backprojections from the motion\nto the primary visual area necessary for visual awareness. Science.\n292:510--512.\nRees G, Friston K, Koch C. 2000. A direct quantitative relationship\nbetween the functional properties of human and macaque V5. Nat\nNeurosci. 3:716--723.\nRoyden CS, Banks MS, Crowell JA. 1992. The perception of heading\nduring eye movements. Nature. 360:583--585.\nSaijo N, Murakami I, Nishida S, Gomi H. 2005. Large-field visual motion\ndirectly induces an involuntary rapid manual following response.\nJ Neurosci. 25:4941--4951.\nSchenk T, Ellison A, Rice N, Milner AD. 2005. The role of V5\/MT+ in the\ncontrol of catching movements: an rTMS study. Neuropsychologia.\n43:189--198.\nSchenk T, Mai N, Ditterich J, Zihl J. 2000. Can a motion-blind patient\nreach for moving objects? Eur J Neurosci. 12:3351--3360.\nSchmolesky MT, Wang Y, Hanes DP, Thompson KG, Leutgeb S, Schall JD,\nLeventhal AG. 1998. Signal timing across the macaque visual system.\nJ Neurophysiol. 79:3272--3278.\nSchwarz U, Ilg UJ. 1999. Asymmetry in visual motion processing.\nNeuroreport. 10:2477--2480.\nShipp S, Zeki S. 1989. The organization of connections between areas\nV5 and V1 in macaque monkey visual cortex. Eur J Neurosci. 1:\n309--332.\n2648 Manual Following Response Depends on MT+ d Whitney et al.\nSilvanto J, Lavie N, Walsh V. 2005. Double dissociation of V1 and V5\/MT\nactivity in visual awareness. Cereb Cortex. 9:9.\nSnowden RJ. 1998. Shifts in perceived position following adaptation to\nvisual motion. Curr Biol. 8:1343--1345.\nSrinivasan MV, Zhang S. 2004. Visual motor computations in insects.\nAnnu Rev Neurosci. 27:679--696.\nStewart L, Battelli L, Walsh V, Cowey A. 1999. Motion perception and\nperceptual learning studied by magnetic stimulation. Electroence-\nphalogr Clin Neurophysiol. 51(Suppl):334--350.\nStoner GR, Albright TD. 1992. Neural correlates of perceptual motion\ncoherence. Nature. 358:412--414.\nTanaka K, Saito H. 1989. Analysis of motion of the visual field by\ndirection, expansion\/contraction, and rotation cells clustered in the\ndorsal part of the medial superior temporal area of the macaque\nmonkey. J Neurophysiol. 62:626--641.\nTheoret H, Kobayashi M, Ganis G, Di Capua P, Pascual-Leone A. 2002.\nRepetitive transcranial magnetic stimulation of human area MT\/V5\ndisrupts perception and storage of the motion aftereffect. Neuro-\npsychologia. 40:2280--2287.\nTootell R, Reppas J, Dale A, Look R, Sereno M, Malach R, Brady T,\nRosen B. 1995. Visual motion aftereffect in human cortical area MT\nrevealed by functional magnetic resonance imaging. Nature. 375:\n139--141.\nTynan PD, Sekuler R. 1982. Motion processing in peripheral vision:\nreaction time and perceived velocity. Vision Res. 22:61--68.\nVaina LM. 1998. Complex motion perception and its deficits. Curr Opin\nNeurobiol. 8:494--502.\nWalsh V, Ellison A, Battelli L, Cowey A. 1998. Task-specific impairments\nand enhancements induced by magnetic stimulation of human visual\narea V5. Proc Biol Sci. 265:537--543.\nWarren WH Jr, Kay BA, Zosh WD, Duchon AP, Sahuc S. 2001. Optic flow\nis used to control human walking. Nat Neurosci. 4:213--216.\nWarren WH Jr, Morris MW, Kalish M. 1988. Perception of translational\nheading from optical flow. J Exp Psychol Hum Percept Perform.\n14:646--660.\nWhitaker D, McGraw PV, Pearson S. 1999. Non-veridical size percep-\ntion of expanding and contracting objects. Vision Res. 39:2999--3009.\nWhitney D, Cavanagh P. 2003. Motion adaptation shifts apparent\nposition without the motion aftereffect. Percept Psychophys. 65:\n1011--1018.\nWhitney D, Goodale MA. 2005. Visual motion due to eye movements\nhelps guide the hand. Exp Brain Res. 162:394--400.\nWhitney D, Murakami I, Gomi H. Forthcoming. The utility of visual\nmotion for goal directed reaching. In: Nijhawan R, editor. Problems\nof Space and Time in Perception and Action. Cambridge (UK):\nCambridge University Press.\nWhitney D, Westwood DA, Goodale MA. 2003. The influence of visual\nmotion on fast reaching movements to a stationary object. Nature.\n423:869--873.\nYamagishi N, Anderson SJ, Ashida H. 2001. Evidence for dissociation\nbetween the perceptual and visuomotor systems in humans. Proc R\nSoc Lond B Biol Sci. 268:973--977.\nYee RD, Daniels SA, Jones OW, Baloh RW, Honrubia V. 1983. Effects of an\noptokinetic background on pursuit eye movements. Invest Oph-\nthalmol Vis Sci. 24:1115--1122.\nZeki S. 1991. Cerebral akinetopsia (visual motion blindness). A review.\nBrain. 114(Pt 2):811--824.\nZeki SM. 1974. Functional organization of a visual area in the posterior\nbank of the superior temporal sulcus of the rhesus monkey. J Physiol.\n236:549--573.\nZihl J, von Cramon D, Mai N. 1983. Selective disturbance of movement\nvision after bilateral brain damage. Brain. 106:313--340.\nCerebral Cortex November 2007, V 17 N 11 2649\n"}