{"doi":"10.1371\/journal.pone.0027076","coreId":"177363","oai":"oai:aura.abdn.ac.uk:2164\/2168","identifiers":["oai:aura.abdn.ac.uk:2164\/2168","10.1371\/journal.pone.0027076"],"title":"A comprehensive evaluation of colonic mucosal isolates of Sutterella wadsworthensis from inflammatory bowel disease","authors":["Mukhopadhya, Indrani","Hansen, Richard","Nicholl, Charlotte E","Alhaidan, Yazeid A","Thomson, John M","Berry, Susan H","Pattinson, Craig","Stead, David A","Russell, Richard K","El-Omar, Emad M","Hold, Georgina L"],"enrichments":{"references":[{"id":188815,"title":"Bacterial flora in inflammatory bowel disease.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":429495,"title":"Campylobacter enteritis: a ‘‘new’’ disease.","authors":[],"date":"1977","doi":"10.1136\/bmj.2.6078.9","raw":null,"cites":null},{"id":429496,"title":"Controlled evaluation of an improved selective medium for isolation of Campylobacter jejuni from human feces [abstract] 83rd Annu Meet Am Soc Microbiol: C274:","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":429498,"title":"Detection and isolation of Campylobacter species other than C. jejuni from children with Crohn’s disease.","authors":[],"date":"2009","doi":"10.1128\/JCM.01949-08","raw":null,"cites":null},{"id":188817,"title":"Enterohepatic helicobacter in ulcerative colitis: potential pathogenic entities? PLoS","authors":[],"date":"2011","doi":null,"raw":null,"cites":null},{"id":188814,"title":"Genetics and pathogenesis of inflammatory bowel disease.","authors":[],"date":"2011","doi":null,"raw":null,"cites":null},{"id":429497,"title":"Hepatic Helicobacter species identified in bile and gallbladder tissue from Chileans with chronic cholecystitis.","authors":[],"date":"1998","doi":"10.1016\/S0016-5085(98)70589-X","raw":null,"cites":null},{"id":429512,"title":"MEGA3: Integrated software for Molecular Evolutionary Genetics Analysis and sequence alignment.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":188818,"title":"Molecular inventory of faecal microflora in patients with Crohn’s disease.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":429511,"title":"Primer3 on the WWW for general users and for biologist programmers.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":188820,"title":"Sources and antimicrobial susceptibilities of Campylobacter gracilis and Sutterella wadsworthensis. Clin Infect Dis 25(Suppl 2):","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":429513,"title":"Species-specific identification and differentiation of Arcobacter, Helicobacter and Campylobacter by full-spectral matrix-associated laser desorption\/ionization time of flight mass spectrometry analysis.","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":188816,"title":"Specificities of the fecal microbiota in inflammatory bowel disease.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":188821,"title":"Sutterella parvirubra sp. nov. and Megamonas funiformis sp. nov., isolated from human faeces.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":188822,"title":"Sutterella stercoricanis sp. nov., isolated from canine faeces.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":188819,"title":"Sutterella wadsworthensis gen. nov., sp. nov., bile-resistant microaerophilic Campylobacter gracilis-like clinical isolates.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":188813,"title":"The role of infection in the aetiology of inflammatory bowel disease.","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":429509,"title":"The role of microaerophilic colonic mucosal bacteria in de novo paediatric inflammatory bowel disease.","authors":[],"date":"2011","doi":null,"raw":null,"cites":null},{"id":429510,"title":"Toward an integrated clinical, molecular and serological classification of inflammatory bowel disease: Report of a Working Party of the 2005 Montreal World Congress of Gastroenterology.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Medical Education","University of Aberdeen, Medicine, Medical Sciences & Nutrition, RINH","University of Aberdeen, Medicine, Medical Sciences & Nutrition","University of Aberdeen, Medicine, Medical Sciences & Nutrition, Division Applied Medicine","University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Medical Sciences","University of Aberdeen, Institute of Medical Sciences"],"datePublished":"2011-10-31","abstract":"Peer reviewedPublisher PD","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2168<\/identifier><datestamp>\n                2018-01-02T00:05:56Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_634<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_644<\/setSpec><setSpec>\n                com_2164_365<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_645<\/setSpec><setSpec>\n                col_2164_635<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nA comprehensive evaluation of colonic mucosal isolates of Sutterella wadsworthensis from inflammatory bowel disease<\/dc:title><dc:creator>\nMukhopadhya, Indrani<\/dc:creator><dc:creator>\nHansen, Richard<\/dc:creator><dc:creator>\nNicholl, Charlotte E<\/dc:creator><dc:creator>\nAlhaidan, Yazeid A<\/dc:creator><dc:creator>\nThomson, John M<\/dc:creator><dc:creator>\nBerry, Susan H<\/dc:creator><dc:creator>\nPattinson, Craig<\/dc:creator><dc:creator>\nStead, David A<\/dc:creator><dc:creator>\nRussell, Richard K<\/dc:creator><dc:creator>\nEl-Omar, Emad M<\/dc:creator><dc:creator>\nHold, Georgina L<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Medical Education<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, RINH<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Division Applied Medicine<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Medical Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Institute of Medical Sciences<\/dc:contributor><dc:subject>\nQR Microbiology<\/dc:subject><dc:subject>\nChief Scientist Office (CSO)<\/dc:subject><dc:subject>\nCSO--CAF\/08\/01<\/dc:subject><dc:subject>\nQR<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher PDF<\/dc:description><dc:date>\n2011-11-01T15:07:01Z<\/dc:date><dc:date>\n2011-11-01T15:07:01Z<\/dc:date><dc:date>\n2011-10-31<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nMukhopadhya , I , Hansen , R , Nicholl , C E , Alhaidan , Y A , Thomson , J M , Berry , S H , Pattinson , C , Stead , D A , Russell , R K , El-Omar , E M & Hold , G L 2011 , ' A comprehensive evaluation of colonic mucosal isolates of Sutterella wadsworthensis from inflammatory bowel disease ' PLoS ONE , vol 6 , no. 10 , e27076 . DOI: 10.1371\/journal.pone.0027076<\/dc:identifier><dc:identifier>\n1932-6203<\/dc:identifier><dc:identifier>\nPURE: 8704095<\/dc:identifier><dc:identifier>\nPURE UUID: 419df422-27e6-405c-9f55-7b470b8dd73e<\/dc:identifier><dc:identifier>\nPubMed: 22073125<\/dc:identifier><dc:identifier>\nScopus: 80055112335<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2168<\/dc:identifier><dc:identifier>\nhttp:\/\/www.plosone.org\/article\/info%3Adoi%2F10.1371%2Fjournal.pone.0027076<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1371\/journal.pone.0027076<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nPLoS ONE<\/dc:relation><dc:format>\n10<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1932-6203","1932-6203"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["PLoS ONE"],"year":2011,"topics":["QR Microbiology","Chief Scientist Office (CSO)","CSO--CAF\/08\/01","QR"],"subject":["Journal article"],"fullText":"A Comprehensive Evaluation of Colonic Mucosal Isolates\nof Sutterella wadsworthensis from Inflammatory Bowel\nDisease\nIndrani Mukhopadhya1., Richard Hansen1,2., Charlotte E. Nicholl1, Yazeid A. Alhaidan1, John M.\nThomson1, Susan H. Berry1, Craig Pattinson3, David A. Stead3, Richard K. Russell4, Emad M. El-Omar1,\nGeorgina L. Hold1*\n1Gastrointestinal Research Group, Division of Applied Medicine, University of Aberdeen, Foresterhill, Aberdeen, United Kingdom, 2Child Health, University of Aberdeen,\nRoyal Aberdeen Children’s Hospital, Foresterhill, Aberdeen, United Kingdom, 3Aberdeen Proteomics Group, Institute of Medical Sciences, University of Aberdeen,\nForesterhill, Aberdeen, United Kingdom, 4Department of Paediatric Gastroenterology, Royal Hospital for Sick Children, Glasgow, United Kingdom\nAbstract\nInflammatory bowel disease (IBD) arises in genetically susceptible individuals as a result of an unidentified environmental\ntrigger, possibly a hitherto unknown bacterial pathogen. Twenty-six clinical isolates of Sutterella wadsworthensis were\nobtained from 134 adults and 61 pediatric patients undergoing colonoscopy, of whom 69 and 29 respectively had IBD. S.\nwadsworthensis was initially more frequently isolated from IBD subjects, hence this comprehensive study was undertaken to\nelucidate its role in IBD. Utilizing these samples, a newly designed PCR was developed, to study the prevalence of this\nbacterium in adult patients with ulcerative colitis (UC). Sutterella wadsworthensis was detected in 83.8% of adult patients with\nUC as opposed to 86.1% of control subjects (p= 0.64). Selected strains from IBD cases and controls were studied to elicit\nmorphological, proteomic, genotypic and pathogenic differences. This study reports Scanning Electron Microscopy (SEM)\nappearances and characteristic MALDI-TOF MS protein profiles of S. wadsworthensis for the very first time. SEM showed that\nthe bacterium is pleomorphic, existing in predominantly two morphological forms, long rods and coccobacilli. No differences\nwere noted in the MALDI-TOFmass spectrometry proteomic analysis. There was no distinct clustering of strains identified from\ncases and controls on sequence analysis. Cytokine response after monocyte challenge with strains from patients with IBD and\ncontrols did not yield any significant differences. Our studies indicate that S. wadsworthensis is unlikely to play a role in the\npathogenesis of IBD. Strains from cases of IBD could not be distinguished from those identified from controls.\nCitation: Mukhopadhya I, Hansen R, Nicholl CE, Alhaidan YA, Thomson JM, et al. (2011) A Comprehensive Evaluation of Colonic Mucosal Isolates of Sutterella\nwadsworthensis from Inflammatory Bowel Disease. PLoS ONE 6(10): e27076. doi:10.1371\/journal.pone.0027076\nEditor: Stefan Bereswill, Charite´-University Medicine Berlin, Germany\nReceived September 29, 2011; Accepted October 9, 2011; Published October 31, 2011\nCopyright: \u0002 2011 Mukhopadhya et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This work was funded by a Clinical Academic Training Fellowship from the Chief Scientist Office in Scotland (CAF\/08\/01), which also funded the salary\nof RH and the Broad Medical Research Program (Grant number IBD-0178). JMT was supported by grants from the GI Research Unit, Aberdeen Royal Infirmary. The\nRoyal Hospital for Sick Children, Glasgow IBD team is generously supported by the Catherine McEwan Foundation. RKR has received support from a Medical\nResearch Council patient research cohorts initiative grant (G0800675) for Paediatric Inflammatory Bowel Disease Cohort and Treatment Study (PICTS). The funders\nhad no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\n* E-mail: g.l.hold@abdn.ac.uk.\n. These authors contributed equally to this work.\nIntroduction\nInflammatory bowel disease (IBD) is an idiopathic inflammatory\ndisorder that is comprised of two major phenotypes, Crohn’s\ndisease (CD) and ulcerative colitis (UC). The understanding of its\naetiopathogenesis has taken rapid strides in the last decade, with\ncurrent investigations focusing heavily on aberrations in host-\nmicrobe interactions at the luminal intestinal surface. Genetic\ndefects in pathogen recognition and primary handling of microbes\nby the innate immune system compounded with distinct changes\nin the luminal microbiome or dysbiosis form the current backbone\nof this pathogenic hypothesis [1,2]. Despite this, researchers in the\nfield have been striving to identify and delineate a solitary micro-\norganism that can explain the initiation and perpetuation of this\nchronic inflammatory process.\nIn this regard, anaerobic and microaerophilic bacteria residing\nin the intestinal lumen have often been the neglected species,\nprimarily on account of the intrinsic difficulty in culturing and\nisolating these organisms by using traditional microbiological\ntechniques. Molecular studies have demonstrated that a substan-\ntial proportion of bacterial species (up to 30–40% of dominant\nspecies) in patients with active IBD belong to phylogenetic groups\nthat are unusual when compared to healthy subjects [3,4]. With\nthis premise in mind, our laboratory has focused on enhanced and\nimproved bacteriological conditions for the optimum growth of\nmicroaerophilic bacteria from colonic biopsy samples [5,6]. In our\npilot studies we noted the unusual preponderance of the rare\nmicroaerophilic Gram negative bacterium Sutterella wadsworthensis\nfrom cultures of biopsy samples from patients with IBD. This\nunusual organism has been encountered before by Mangin et al.\nwho used 16S rRNA gene sequencing to create molecular\ninventories of the dominant fecal bacteria in four CD patients\nand four controls. They found that bacterial species which were\nnot commonly dominant in healthy individuals were over-\nPLoS ONE | www.plosone.org 1 October 2011 | Volume 6 | Issue 10 | e27076\nrepresented in CD. One of these species included S. wadsworthensis,\nwhich belonged to the dominant microbiota of one of the four CD\npatients [7].\nThese bacteria were first reported when performing biochem-\nical characterization and susceptibility testing of Campylobacter\ngracilis clinical isolates from patients with diverse infections of the\nGI tract [8]. These organisms could be differentiated from C.\ngracilis mainly by their bile resistance and cell wall fatty acid\npatterns. 16S rRNA gene sequencing confirmed that these\nunusual organisms were not related phylogenetically to any of\nthe Campylobacters, including C. gracilis, with the closest taxa\nbelonging to unrelated aerobes. This was ratified by a subsequent\nreport which demonstrated that the majority of S. wadsworthensis\nstrains were isolated from GI infections, only occasionally being\nisolated from non-abdominal specimens, and were more likely to\nbe involved in serious infections than C. gracilis [9]. The\nsupposition was that S. wadsworthensis was a putative human\npathogen. Three other species, Sutterella stercoricanis, Sutterella\nmorbirenis and Sutterella parvirubra belonging to the same genera\nhave subsequently been identified from canine and human feces\n[10,11].\nThe role of this group of bacteria has not been clearly elucidated\nin the aetiopathogenesis of IBD. This study has for the first time\noutlined the role of S. wadsworthensis in patients with IBD and\nperformed a comprehensive phenotypic, genotypic, proteomic and\npathogenetic characterization of this bacterial species, which will\nserve as a useful benchmark for future studies.\nMethods\nStudy subjects, specimen collection and processing\nAdult patients were recruited from the Department of\nGastroenterology at the Aberdeen Royal Infirmary. These\nsubjects were recruited for a previous study looking at the role\nof enterohepatic Helicobacter in UC [5]. A total of sixty-nine\npatients with a diagnosis of UC made on the basis of histology of\ncolonoscopic biopsies were recruited and assessed. Sixty-five\nhealthy controls were contacted prior to their index colonoscopy\nas part of the bowel cancer screening programme and recruited\nfor the study if they had documented absence of both\nmacroscopic and microscopic inflammation. Children were\nrecruited from the Departments of Paediatric Gastroenterology,\nHepatology and Nutrition at the Royal Aberdeen Children’s\nHospital and the Royal Hospital for Sick Children (Yorkhill),\nGlasgow as part of an ongoing study to investigate the role of\nmicroaerophilic colonic microbiota in de-novo paediatric IBD\n(Bacteria in Inflammatory bowel disease in Scottish Children\nUndergoing Investigation before Treatment: BISCUIT study).\nTwenty-nine paediatric patients with newly-presenting, treat-\nment naı¨ve IBD and thirty-two paediatric controls undergoing\nroutine colonoscopy were included in this present study [12].\nThe extent and severity of disease was assigned using the\nMontreal criteria [13]. Subjects were excluded if they received\nantibiotics within three months prior to recruitment. Mucosal\ncolonic biopsies were obtained during the colonoscopy proce-\ndures. One to two biopsies were used for culture work and the\nrest were then transferred to a 280uC freezer for storage\npending DNA extraction and analysis.\nEthics\nEthical approval for the study was granted by the North of\nScotland Research Ethics Service, UK (reference numbers 04\/\nS0802\/8 and 09\/S0802\/24). Written informed consent was\nobtained from all adult subjects and from the parents of all\npaediatric subjects in the study. Informed assent was also obtained\nfrom older children who were deemed capable of understanding\nthe nature of the study.\nBacterial strains\nSutterella wadsworthensis strains. A total of twenty-seven\nS. wadsworthensis strains were used in this study. The type strain,\nDSM 14016 ( = ATCC 51579) was obtained from the German\nCollection of Microorganisms and Cell Cultures (DSMZ). Another\ntwenty-six S. wadsworthensis strains obtained during the course of\nthis study were also examined.\nOther bacterial strains. Twenty-eight other bacterial\nstrains were used in this study, obtained from international\nculture collections as well as from clinical and environmental\nsources: Campylobacter jejuni (NCTC 11351), Campylobacter upsaliensis\n(NCTC 11540), Campylobacter fetus (NCTC 10842), Campylobacter lari\n(NCTC 11352), Campylobacter coli (clinical isolate), Campylobacter\nconcisus (clinical isolate), Helicobacter pylori (ATCC 700392),\nHelicobacter hepaticus (ATCC 51449), Helicobacter cholecystitis (ATCC\n700242), Helicobacter canis (ATCC 51402), Helicobacter canadensis\n(ATCC 700968), Escherichia coli (NCIMB 12201), Pseudomonas\nfluorescences (clinical isolate), Pseudomonas aeruginosa (ATCC 27853),\nShigella sonnei (25931 clinical isolate), Proteus mirabilis (NCTC 3177),\nProteus vulgaris (NCTC 4157), Salmonella enteritidis (NCTC 12694),\nSalmonella typhimurium (NCIMB 13284), Staphylococus aureus (NCIMB\n12702), Bacillus cereus (ATCC 10876), Enterococcus faecalis (NCIMB\n13280), Enterobacter aerogenes (NCIMB 10102), Listeria monocytogenes\n(clinical isolate), Fusobacterium nucleotum (clinical isolate), Klebsiella\npneumonia (NCIMB 13281), Acinetobacter calcoaceticus (clinical isolate),\nYersinia fredericksenii (NCIMB 2124), and Aeromonas caviae (clinical\nisolate).\nSutterella wadsworthensis growth conditions\nS. wadsworthensis isolates were obtained by culturing 1–2 mucosal\nbiopsy samples on five selective plates, the details of which are\nlisted in Table 1. Biopsies were first ground in brucella broth\nbefore the resultant suspension was added to the plates. 50 ml was\nadded to each plate with the exception of the filtered blood plate\nwhere 200 ml was first passed through a 0.45 mm filter. Cultures\nwere incubated in a micro-aerophilic atmosphere, comprising of\n5.9% oxygen, 7.2% carbon dioxide, 3.6% hydrogen and 83.3%\nnitrogen at 37uC. This atmosphere was generated using\nAnoxomatH Atmosphere Generating System, from MartH Micro-\nbiology b.v. (9200 JB Drachten, Netherlands). Plates were\nreviewed twice weekly for up to one month. Any bacterial isolate\ndeemed Gram-negative and oxygen sensitive (by virtue of failed\nsubculture in room air) was identified by sequencing of the 16S\nrRNA gene and sequence search on NCBI BLAST (http:\/\/blast.\nncbi.nlm.nih.gov\/Blast.cgi).\nGenotypic Characterization\nDNA Extraction. Genomic DNA was extracted from the\ncolonic mucosal biopsies using the QIAamp DNA Mini Kit\n(Qiagen, Crawley, UK) according to an established modification\nof the manufacturer’s instructions, optimised in-house for colonic\nbiopsy tissue as described previously [5].\nS. wadsworthensis specific primer design. For the design\nof a new S. wadsworthensis -specific primer, 16S rRNA gene\nsequences of all the S. wadsworthensis strains and other related\nbacterial strains were obtained from the NCBI database (http:\/\/\nwww.ncbi.nlm.nih.gov) for multiple alignment. Nearly full length\n16S rRNA sequences of S. wadsworthensis strains isolated from\nclinical specimens in this study were also used for the alignment\nanalysis. Several primer sequences were initially designed by using\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 2 October 2011 | Volume 6 | Issue 10 | e27076\nthe Primer 3 software [14] and then the most suitable one was\nidentified manually using the BioEdit software package (version\n7.0.5.3) (http:\/\/www.mbio.ncsu.edu\/BioEdit\/bioedit.html). The\ndownloaded S. wadsworthensis specific sequences were aligned with\nthe newly designed primer sequences and the ones that matched to\nthe highly conserved 16S rRNA gene sequences of the target\nspecies but were variable among the other bacterial species, were\nselected. The 20 base pair S. wadsworthensis specific primer\nsequences designed (SWF and SWR) are outlined in Table 2.\nThe primer sequences were then subjected to BLAST analysis\nagainst all the other sequences within the BLAST database to\nensure that at least one of the primers did not share any identical\nsequence with any microorganisms other than S. wadsworthensis.\nOptimization of S. wadsworthensis PCR assay. The\nspecificity of the newly developed S. wadsworthensis primer pair\nwas tested against a wide panel of bacterial species as listed earlier\nin the methods section. The PCR assay was tested using 40 ng of\nbacterial DNA in a 50 ml reaction mixture consisting of 10 pmol of\neach primer (SWF and SWR [Sigma-Aldrich, UK]), 1X PCR\nbuffer (Roche, UK), 250 nM of each deoxy-nucleotide-\ntriphosphate (Bioline, UK), 2 mM MgCl2 (Roche, UK) and 1 U\nof Taq polymerase (Roche,UK). The sensitivity of the PCR assay\nwas determined by serially diluting a known quantity of target\nDNA (50 ng\/ml to 0.005 pg\/ ml) to detect the minimum\nconcentration that would yield a visible amplicon after gel\nelectrophoresis.\nRestriction fragment length polymorphism (RFLP) analysis was\nalso done using the 555 bp S. wadsworthensis-specific PCR products\nusing EcoR I and Hha I enymes to confirm that the PCR products\nwere from a single bacterial species.\nSequence Analysis. Sequencing was done on an Applied\nBiosystems model 3730 automated capillary DNA sequencer using\nthe S. wadsworthensis - specific primers SWF and SWR or 16S rRNA\nspecific universal bacterial primers for the whole gene amplification\nof the S. wadsworthensis strains. The sequences obtained were\ncompared to those of the National Center for Biotechnology\nInformation GenBank database using the basic local alignment\nsearch tool (BLAST) search program. Multiple alignments and\nphylogenetic analysis were performed using Bioedit (http:\/\/www.\nmbio.ncsu.edu\/BioEdit\/bioedit.html) (version 7.0.5.3) and a\ndendogram was constructed using MEGA version 4 software [15].\nThe evolutionary distances were calculated according to Kimura’s\ntwo-parameter model. A phylogenetic tree was inferred using the\nneighbor-joining algorithm, and the tree topology was statistically\nevaluated by 1,000 bootstrap resamplings.\nGenBank Sequence Submission. All 16S rRNA gene\nsequences derived from the sequencing of S. wadsworthensis-\nspecific PCR products were submitted to GenBank with the\naccession numbers from JN664092-JN664117.\nPhenotypic Characterization\nBasic biochemical tests including Gram staining, catalase,\nurease and oxidase tests were conducted using conventional\nmanual methods to characterize the isolates. The strains were\nfurther characterized using the API Campy commercial biochem-\nical kit according to the manufacturer’s instructions (BioMerieux,\nLa Balme Les Grottes, France). The purpose of using the API kits\nin this study was not to identify or name the bacteria, but to use\nthe biochemical tests to further characterize the S. wadsworthensis\nstrains. By comparing the resultant biochemical profiles, any\npotential differences between the strains might be elicited. Of all\nthe API kits available it was assumed that API Campy would yield\nthe best results, as S. wadsworthensis is phenotypically similar to\nCampylobacter species.\nScanning Electron Microscopy (SEM)\nS. wadsworthensis strains were harvested for SEM. Bacterial cells\nwere suspended in 2% Glutaraldehyde in 0.1 M sodium\nCacodylate buffer (pH 7.2) for 3 hours to be fixed. The fixed\ncell suspensions were then applied to glass coverslips coated with\npoly-L-lysine and allowed to adhere for five minutes. Coverslips\nwere then rinsed with water and post-fixed with 1% Osmium\ntetroxide (OsO4) for 30 minutes. They were next rinsed with water\nand dehydrated through a graded ethanol series (60%, 80%, and\n90%) for 10 minutes each. The sample was then left for 30 minutes\nin absolute ethanol with ethanol changes every 10 minutes. The\ncoverslips were kept in Hexamethyldisilazane (HMDS) SigmaH for\n10 minutes, and left to dry overnight. Next day, the specimen was\ncoated with gold using automated sputter coater EMITECH\nK550 (Emitech limited, Ashford, Kent) and samples were\ntransferred to view S. wadsworthensis using SEM.\nProteomic Characterization\nTo complement the phenotypic and genotypic methods, matrix-\nassociated laser desorption\/ionisation - time of flight mass\nTable 1. Culture media used in the study.\nMedia Name Base Additives\nVolume of biopsy\nsuspension added Reference\nBlood agar Blood Agar Nil 50mmol -\nBlood Agar Blood Agar Nil 200mmol through 0.45mm filter -\nSkirrow Blood Agar Polymyxin B, Trimethoprim, Vancomycin 50mmol [27]\nCVA Blood Agar Amphotericin, Cefoperazone, Vancomycin 50mmol [28]\nHelicobacter Blood Agar Amphotericin, Bacitracin, Nalidixic acid,\nPolymyxin B, Vancomycin\n50mmol [29]\nCampylobacte Blood Agar Trimethoprim, Vancomycin 50mmol [30]\ndoi:10.1371\/journal.pone.0027076.t001\nTable 2. Sequences of PCR primers designed in this study.\nPrimer name Sequence Reference\nSWF 59- GAC GAA AAG GGA TGC GAT AA - 39 This study\nSWR 59- CTG GCA TGT CAA GGC TAG GT- 39 This study\ndoi:10.1371\/journal.pone.0027076.t002\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 3 October 2011 | Volume 6 | Issue 10 | e27076\nspectrometry (MALDI-TOF MS) was performed to further\ncharacterize selected S. wadsworthensis strains.\nSample preparation. A total of 11 bacterial strains were\nanalyzed by MALDI-TOF MS: eight S. wadsworthensis isolates (4\nstrains obtained from healthy controls and 4 strains from IBD\npatients), the S. wadsworthensis type strain DSM 14016, C. jejuni and\nC. concisus strains. Approximately 5-10 mg (half a plastic loop) of\nbacterial cells were harvested from fresh blood agar plates and\nproteins were extracted as described by Alispahic et al. (2010) [16].\nThe protein extract (supernatant) was diluted, with 30%\nacetonitrile in 0.1% trifluoracetic acid (Applied Biosystems, UK)\nin water. Subsequently, 1 ml of diluted supernatant was mixed\nwith 1 ml of matrix solution (10 mg HCCA (a-cyano-4-\nhydroxycinnamic acid) matrix (Bruker Daltonics, Germany) to\n1 ml of a solution comprising: 500 ml acetonitrile, 475 ml UHQ\nwater and 25 ml trifluoroacetic acid). 1 ml of the sample-matrix\nmixture was pipetted onto a MALDI ground steel target plate\n(Bruker Daltonics) and left to dry on air.\nMALDI-TOF MS. Mass spectra were acquired using an\nultrafleXtremeTM series MALDI-TOF MS (Bruker Daltonics),\nequipped with a 1 kHz smartbeam-IITM nitrogen laser\n(l= 337 nm). Spectra were recorded using the linear positive\nmode for masses in the range of 2 kDa to 20 kDa. The parameter\nsettings were as follows: ion source 1, 25 kV; ion source 2,\n23.85 kV; lens, 6.5 kV; pulse ion extraction time, 160 ns. A low-\nmass gate of 800 Da was used. Insulin, ubiquitin, cytochrome C\nand myoglobin were used as external calibrants, enabling a mass\naccuracy of 60.5 parts per 1000. Laser power and the number of\nlaser shots per sample were varied by the operator for optimal\nperformance.\nData analysis. Mass spectra were processed prior to visual\ninspection using FlexAnalysis 3.3 software (Bruker Daltonics). This\nincluded smoothing, baseline subtraction and intensity\nnormalisation. MALDI BioTyper software 2.0 (Bruker Daltonics)\nwas used to generate pseudo gel view representations of each\nspectrum. The mass spectra and corresponding pseudo gel images\nfor each bacterial strain were then visually inspected and\ncompared.\nPreparation of monocytes and S. wadsworthensis (whole\ncell) stimulation studies\nWhole venous blood was collected from six adult healthy\nindividuals who were not on any medications. The blood was\ndiluted 1:1 in RPMI 1640 (Sigma-Aldrich), layered onto\nHistopaque-1077 (Sigma-Aldrich), and centrifuged at 8006g for\n30 min. Peripheral blood mononuclear cells were removed from\nthe interface and monocytes were prepared as published earlier\n[17]. The effect of S. wadsworthensis whole cell preparations was\nassessed by stimulating the monocytes for up to 24 hours. Seven S.\nwadsworthensis strains (4 strains obtained from healthy controls and\n3 strains from IBD patients) were used in this study along with an\nE. coli (S1041) as a positive control. Unstimulated monocytes were\nused as a negative control.\nCytometric bead array\nIn order to assess whether the whole cell preparations induced\nan inflammatory response, levels of TNF-a in culture supernatant\nwere measured at the different time points using a human\ninflammatory cytokine cytometric bead array (CBA;BD Biosci-\nences). Samples were analyzed on a multifluorescence BD\nFACSCaliburTM flow cytometer using BD CellQuestTMsoftware\nand BDTM cytometric bead array software. Standard curves were\ngenerated using FCAP Array SoftwareTM. Sample results were\nthen calculated by comparing sample CBA results to the respective\nstandard curve. All CBA work was performed in duplicate and\ncytokine levels induced by stimulation were calculated by\nsubtracting unstimulated cytokine levels from each stimulated\nvalue and expressing TNF-a levels as a fold-change relative to\nTNF-a levels derived from E. coli stimulations.\nStatistical Analysis\nStatistical analysis was performed using the Pearson Chi\nSquared, 2-tailed test or the Fisher’s exact test wherever\nappropriate, utilizing Graph Pad software (San Diego, CA).\nResults\nAssessment of S. wadsworthensis prevalence in mucosal\ncolonic biopsies\nClinical information of the study population. The mean\nage of the sixty-nine patients with UC was 45.6627.8 years and\n46.4% were male as opposed to the sixty-five control patients\nwhose mean age was 64.265.6 years and 59.3% of these subjects\nwere male. There was a statistically significant difference in age\nbetween the UC cohort and the control group (p,0.0001). At the\ntime of colonoscopy the adult patients were classified as extensive\n(24.6%), left sided (63.8%) and proctitis (11.6%) according to the\nMontreal criteria. During recruitment 10.1% of patients were in\nclinical remission (S0), 23.2% had mild UC (S1), 46.4% had\nmoderate UC (S2) and the remaining 20.3% had severe UC (S3).\nA total of 115 biopsy sites were analyzed from UC patients.\nTwenty-four (34.8%) subjects had a single site analyzed and forty-\nfive (65.2%) had more than one biopsy site assessed. A single\nbiopsy site was analyzed from each control subject. The adult\npatients served as clinical sources for the isolation of S.\nwadsworthensis. The newly developed PCR was utilized to detect\nthe presence of S. wadsworthensis from mucosal biopsies from these\npatients.\nThe paediatric IBD patients (n = 29, male 62.1%) had a median\nage of 12.2 years (interquartile range, IQR, 9.8, 14.1 years) at the\ntime of recruitment out of which fifteen had CD, nine UC and five\nIBD-unclassified. The paediatric control patients (n = 32, male\n78.1%) had a mean age of 10.8 years (IQR, 8.3, 12.7 years) at the\ntime of index colonoscopy. The paediatric cohort was primarily\nutilized as a source for isolation of S. wadsworthensis, which was then\nutilized to develop and standardize the detection PCR.\nA total of twenty-six S. wadsworthensis strains were isolated from\nthe mucosal colonic biopsy samples of the above mentioned study\npopulations. The majority of the clinical strains were obtained\nfrom paediatric patients, ten from control and seven from IBD\npatients. Six strains were obtained from adult IBD patients and\nthree from adult control patients.\nEvaluation of the sensitivity and specificity of the newly\ndeveloped S. wadsworthensis -specific PCR assay. Twenty-\nseven strains of S. wadsworthensis and twenty-eight other bacterial\nstrains representing a broad spectrum of bacterial species were\nscreened to test for the specificity of the newly designed species-\nspecific primers. The primer pair produced an intense band of\n<555 bp from all the S. wadsworthensis strains (Figure 1). No\namplicon was observed from any of the other bacterial strains\ntested. For detection of S. wadsworthensis DNA from mucosal biopsy\nsamples a nested PCR approach was taken where the first round\nPCR was done using universal bacterial primers (27F and 1492R)\n[18] followed by a second round of PCR using the S.\nwadsworthensis–specific SWF and SWR primers. The optimal\nthermal cycling conditions required to obtain specificity for the\nS. wadsworthensis-specific PCR were: 94uC for 5 minutes, 30 cycles\nof 94uC for 30 seconds, 58uC for 30 seconds, and 72uC for 2\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 4 October 2011 | Volume 6 | Issue 10 | e27076\nminutes, followed by 72uC for 15 minutes. The optimized PCR\nwas able to detect 0.5 pg\/ml of S. wadsworthensis DNA (Figure 2).\nThe RFLP analysis of all the S. wadsworthensis–specific PCR\nproducts also showed the expected banding pattern of 327 bp and\n228 bp for EcoR 1 digestion and 420 bp and 135 bp for Hha I\ndigestion respectively.\nPrevalence of S. wadsworthensis in adults with UC using\nspecies-specific PCR. All the adult mucosal biopsy samples\nwere screened using the newly developed and optimized S.\nwadsworthensis-specific PCR. S. wadsworthensis was detected in fifty-\nseven of the sixty-nine subjects with ulcerative colitis and fifty-six\nof the sixty-five controls. The prevalence of S. wadsworthensis in the\nUC population was 83.8% which was similar to that in the\ncontrols, 86.1% (p = 0.64). There was no statistically-significant\ndifference in the prevalence of S. wadsworthensis in male subjects as\nopposed to female patients. Furthermore, no age related\ndifferences could be demonstrated. Looking specifically at\npatients with UC, no statistically-significant differences were\nnoted in the prevalence of S. wadsworthensis with respect to extent\nor severity of UC according to the Montreal classification.\nPhylogenetic Analysis. A phylogenetic tree was constructed\nbased on nearly full-length (,1400 bp) 16S rRNA gene sequences\nof the S. wadsworthensis strains isolated from this study and\nsequences of S. wadsworthensis strains and other Sutterella species\navailable in GenBank (Figure 3). All the S. wadsworthensis sequences\nderived from this study clustered closely with the other S.\nwadsworthensis sequences from GenBank and presented the\nhighest (99–100%) sequence identity to the S. wadsworthensis type\nstrain ATCC 51579. The S. wadsworthensis strains from different\ngeographical locations (strain ATCC 51579, strain WAL 7877 and\nstrain WAL 9054 originating from USA and the strains from this\nstudy being from the UK) did not cluster into different lineages.\nAlso, S. wadsworthensis sequences analyzed from the UC and the\nhealthy controls did not cluster into separate groups in the\ndendrogram. The GenBank derived sequences from the S.\nparvirubra, S. stercoricanis and S. morbirenis strains each grouped into\ndifferent clusters in the dendrogram confirming different species.\nCharacterization of S. wadsworthensis isolates to detect\nstrain difference\nAs the PCR results revealed almost universal prevalence of S.\nwadsworthensis in both IBD cases and controls, we hypothesised that\nthere may be differences between the strains isolated from the two\ngroups and so went on to study their phenotypic, morphological,\nproteomic and pathogenic profiles.\nPhenotypic Characterization. S. wadsworthensis was found to\nbe a Gram-negative pleomorphic rod shaped organism with\nFigure 1. Amplification of S. wadsworthensis DNA from reference and clinical strains using the SW-F and SW-R primers. The assay\namplified a product of <555 bp in size. Lane 1:100 bp marker, Lane 2: negative control (no DNA), Lane 3: S. wadsworthensis DSM 14016, Lane 4 –\nLane 25: S. wadsworthensis isolate SW1, SW2, SW4, SW5, SW6, SW7, SW8, SW9, SW10, SW11, SW12, SW13, SW14, SW15, SW16, SW17, SW18, SW19,\nSW20, SW21, SW22, SW23, Lane 26:100 bp marker.\ndoi:10.1371\/journal.pone.0027076.g001\nFigure 2. Limit of detection for the newly developed S.\nwadsworthensis-specific nested PCR assay. The PCR assay was\nable to detect 0.5 pg of S. wadsworthensis DNA. Lane 1: 100 bp marker,\nLane 2: negative control (no DNA), Lane 3: S. wadsworthensis DNA\n50 ng\/ml, Lane 4: S. wadsworthensis DNA 5 ng\/ml, Lane 5: S.\nwadsworthensis DNA 0.5 ng\/ml, Lane 6: S. wadsworthensis DNA 50 pg\/\nml, Lane 7:S. wadsworthensis DNA 5 pg\/ml, Lane 8: S. wadsworthensis\nDNA 0.5 pg\/ml, Lane 9: S. wadsworthensis DNA 0.05 pg\/ml, Lane 10: S.\nwadsworthensis DNA 0.005 pg\/ml.\ndoi:10.1371\/journal.pone.0027076.g002\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 5 October 2011 | Volume 6 | Issue 10 | e27076\nFigure 3. Phylogenetic tree constructed using nearly full-length (,1400 bp) sequences of the 16S rRNA gene of S. wadsworthensis\nstrains from UC and controls alongside other Sutterella sequences available in GenBank. The evolutionary history was inferred using the\nNeighbor-Joining method. The percentage of replicate trees in which the associated taxa clustered together in the bootstrap test (1000 replicates) are\nshown next to the branches. The tree is drawn to scale, with branch lengths in the same units as those of the evolutionary distances used to infer the\nphylogenetic tree. The S. wadsworthenis isolates from IBD cases are marked in red and those from controls are marked in blue.\ndoi:10.1371\/journal.pone.0027076.g003\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 6 October 2011 | Volume 6 | Issue 10 | e27076\ndifferent morphological structures seen on Gram stain, even\nthough the S. wadsworthensis cultures were pure. All S. wadsworthensis\nstrains tested negative for catalase, urease and oxidase tests. The\nAPI Campy kit results showed that all the S. wadsworthensis strains\ntested (9 clinical isolates and the type strain) were positive for the\nEST, ArgA and AspA tests, indicating they possess the enzymes\nesterase, L-arginine arylamidase and L-aspartate arylamidase\nrespectively. The only discrepant result between the S.\nwadsworthensis strains was for the HIP test; four strains, including\nthe type strain, tested positive and six strains were found to be\nnegative. This tested the ability of the bacteria to hydrolyse sodium\nhippurate. A positive result indicated the presence of the enzyme\nhippurate hydrolase. All the assimilation tests on the second half of\nthe strips were negative for all S. wadsworthensis strains.\nSEM. Under conventional light microscopy, there were\nclearly two different morphologies for S. wadsworthensis. For this\nreason, an intensive literature search for S. wadsworthensis electron\nmicrographs was done. However, there were no published electron\nmicrograph images available to answer the morphology question.\nDue to this, two S. wadsworthensis strains (SW9 from control and\nSW13 from IBD) were selected for SEM. The SEM images clearly\nindicated lattice formation (Figure 4A) and two distinct\nmorphologies of this bacterium: a long rod (nearly 4mm) and a\nshort cocco-bacillus (nearly 1mm) (Figure 4B). Interestingly, there\nwere also cells with filamentous shape (Figure 4C) and a helical\nform was also observed (Figure 4D).\nMALDI-TOF MS. Matrix-associated laser desorption\/\nionization – time of flight mass spectrometry (MALDI-TOF MS)\nis a well-established technique in proteomics for the analysis of\nproteins and peptides. Profiling of proteins by MALDI-TOF MS\nhas been developed as a rapid and sensitive technique for\nmicroorganism identification [16]. In the MALDI Biotyper\nsystem developed by Bruker Daltonics, MALDI-TOF mass\nspectra of small proteins (range 2–20 kDa) acquired directly\nfrom smears of cells or their extracts are compared with reference\nspectra in the MALDI Biotyper database. The most recent\nMALDI Biotyper 2.0 database available (version 3.1.2, dated 28\nJanuary 2011, containing reference spectra for 3740\nmicroorganisms) did not contain any information on S.\nwadsworthensis. The purpose of MALDI-TOF MS in this study,\nas with the API testing kit, was not to identify the bacterial strains\nbut to further characterize them and elicit any differences between\nthem.\nOut of the eleven strains tested, triplicate samples of the first six\nbacterial strains analyzed by MALDI-TOF MS were analyzed to\nassess how reproducible the method was. All three replicates for\nthese six strains produced almost identical results, so it was decided\nthat obtaining a single mass spectrum for each of the remaining\nfive strains would be sufficient. The remaining five strains were\nanalyzed and the mass spectra for all 11 strains were obtained. It\nwas immediately apparent that there was a characteristic S.\nwadsworthensis pattern that all of the strains conformed to\n(Figure 5A). Notably there was a dominant peak at approximately\n9400Da which was common to all S. wadsworthensis strains\n(Figure 5B). The Campylobacter strains on the other hand, produced\ndifferent patterns of peaks, with C. jejuni producing a dominant\ndouble peak at approximately 9500Da and 10300Da (data not\nshown).\nMonocyte challenge. A human monocyte challenge system\nwas used to assess the immunogenicity of different S. wadsworthensis\nstrains. A survival test was performed to examine the ability of S.\nwadsworthensis strains to survive when exposed to the oxygen\npresent in the monocyte stimulation experimental setup. This\nshowed that .50% of S. wadsworthensis cells survived for four\nhours. Seven S. wadsworthensis strains and an E. coli strain were\ninoculated onto monocytes that were obtained from six healthy\nFigure 4. Scanning electron microscopy (SEM) images of S. wadsworthensis showing different morphologies for this organism. Small\nand large, filamentous and helical bacteria forms were observed. A) S. wadsworthensis cells formed as a lattice B) Different Sutterella cell morphologies\nC) Filamentous bacterial form D) Helical bacterial form.\ndoi:10.1371\/journal.pone.0027076.g004\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 7 October 2011 | Volume 6 | Issue 10 | e27076\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 8 October 2011 | Volume 6 | Issue 10 | e27076\nvolunteers. Levels of TNF-a were measured at 4 hours of\nstimulation. All S. wadsworthensis strains induced TNF-a cytokine\nproduction from the human monocytes. Compared to the E. coli\nstrain used S. wadsworthensis strains induced higher levels of TNF-a\nproduction over the first 4 hours although subsequent\nmeasurements at 24 hours indicated that TNF-a levels remained\ndetectable in E. coli stimulated monocytes but that TNF-a was not\ndetectable in S. wadsworthensis stimulated wells, most likely because\nof the death of S. wadsworthensis organisms (Table 3).\nDiscussion\nThe role of S. wadsworthensis in human gastrointestinal diseases\nhas been documented in the past but its specific involvement in\ninflammatory bowel disease has never been firmly established\n[8,9]. The fortuitous isolation of this unusual bacterial strain from\nmucosal biopsies of patients with IBD prompted a series of\nexperiments that have been outlined in this paper and has\nculminated in detailed characterization of this putative pathogen.\nDespite this detailed microbial analysis no specific differences have\nbeen identified between cases and controls. However, this negative\nresult does not preclude the importance of successful isolation of\nthis fastidious organism from colonic biopsy samples by adhering\nto a strict microaerophilic culture environment and stringent\ngrowth conditions. Our study provides an important proof of\nconcept that will enable future studies to satisfy Koch’s postulates\nto tie in other luminal microaerophilic bacteria as causative factors\nin IBD.\nThis is the first report of the appearances of this bacterial species\nunder scanning electron microscopy (SEM). As opposed to\nprevious descriptions, the bacteria are pleomorphic, with strains\nexisting in predominantly two morphological forms, long rods and\ncoccobacilli. Filamentous and helical forms were also documented.\nThe bacteria appeared in clusters on Gram stain and this was\nfurther corroborated with the appearance of a lattice type network\non SEM. The functional role of this lattice formation is unclear,\nbut given the high prevalence of this organism that we have\ndemonstrated in the human colonic mucosa, further investigation\nof the interaction of S. wadsworthensis in the complex luminal\nmicrobiota may be of interest. This lattice structural network may\nparadoxically harbour either commensal bacteria or pathogenic\nbacterial strains in close juxtaposition to the epithelial surface with\ndiametrically opposite consequences.\nAll S. wadsworthensis strains were negative for urease, catalase\nand oxidase, consistent with the initial description by Wexler et al\n[8]. The authors had described S. wadsworthensis as asaccharolytic,\nand certainly none of the sugar assimilation tests from the API kit\nwere found to be positive [8]. As S. wadsworthensis is phenotypically\nclosely related to the Campylobacter genus, the API Campy kit,\nspecifically for the identification of Campylobacter species was\ntrialed. This yielded more promising results. All of the S.\nwadsworthensis strains tested were positive for the EST, ArgA and\nAspA tests, meaning they possessed the enzymes esterase, L-\narginine arylamidase and L-aspartate arylamidase respectively.\nEsterases are often required to breakdown dietary residue and are\nmostly derived from the intestinal microbiota, with E. coli,\nBifidobacterium and Lactobacillus species all known to be sources\n[19]. Colonic esterases have been shown to release powerful\nantioxidants, present in cereal bran, from complex ester-linked\nstructures which could otherwise not be absorbed [20]. It is\npossible that the esterases produced by S. wadsworthensis have a\nsimilar role.\nThis study utilized a newly developed PCR to detect the\npresence of S. wadsworthensis in a subset of adult patients with UC\nand adult control patients. The rates of detection was similar in\nboth these groups (83.8% vs. 86.1%, p = 0.64), suggesting that this\nbacterial strain is probably a commensal. The only other study\nthat has looked at the prevalence of this pathogen in patients with\ngastrointestinal disease was by Engberg et al. who used PCR and\nDNA sequencing of the 16S rRNA gene to characterize bacterial\npopulations in fecal samples [21]. They detected S. wadsworthensis\nin only 7 out of 1483 (0.47%) patients with GI disorders, and only\n1 out of 107 (0.93%) healthy individuals. This wide disparity in\nprevalence between this study and our cohort of patients and\ncontrols suggests that S. wadsworthensis is closely adherent to the\nmucosal lining and is more likely to be identified from biopsy\nsamples as opposed to feces. Additionally, this newly designed\nPCR for this bacterial strain was validated using the type strain of\nS. wadsworthensis as well as several related bacterial strains and will\nform a useful tool in future studies.\nDespite similar rates of detection of S. wadsworthensis from\npatients with IBD and controls, our clinical isolates gave us an\nexcellent opportunity to further characterize this organism.\nSeveral bacterial species have been noted to have distinctly\ndifferent phenotypic and genotypic profiles when isolated from\npatients with clinical disease as opposed to controls. This has been\nrecently documented in Campylobacter concisus and mucosa associ-\nated E. coli wherein distinct genomospecies have been documented\nwith varying pathogenic potential [22,23]. Sequence analysis of\nstrains identified during the study from cases and controls did not\ncluster in distinct groups confirming that this phenomenon does\nnot extend to S. wadsworthensis.\nProteomic analysis of S. wadsworthensis strains utilizing MALDI-\nTOF MS is being reported for the first time in this paper. MALDI-\nTOF MS has recently emerged as an alternative to phenotypic\nand genotypic methods for the fast and reliable identification of\nFigure 5. Mass spectra obtained for S. wadsworthensis strains. (A) Spectra obtained for 6 S. wadsworthensis strains: S. wadsworthensis type\nstrain, SW1, SW4, SW5, SW6 and SW7. All of the S. wadsworthensis strains conform to a common pattern. a.u. arbitary unit; m\/z, mass-to-charge ratio;\nDa, Daltons; (B) Overlaid spectra of five S. wadsworthensis strains overlaid. This is a close-up of the mass spectra from 8,700 Da to 10,500 Da. It shows\nhow closely each S. wadsworthensis mass spectrum, aside from intensity, matches the others. a.u., arbitary unit; m\/z, mass-to-charge ratio; Da, daltons.\ndoi:10.1371\/journal.pone.0027076.g005\nTable 3. TNF-a levels (depicted as percentage) derived from\nhuman monocytes (N= 6) exposed to whole cell preparations\nof various S. wadsworthensis strains.\nSW1 SW2 SW3 SW7 SW8 SW9 SW13\nVolunteer A 3 407 62 43 64 92 128\nVolunteer B 0 651 184 108 200 178 NT\nVolunteer C 17 120 908 125 120 120 NT\nVolunteer D 747 924 197 360 350 541 NT\nVolunteer E 163 625 117 237 237 429 NT\nVolunteer F NT NT NT NT NT NT 139\nTNF-a production in the supernatant was determined after 4 hours of\nstimulation. The cytokine amounts shown are expressed as a percentage of the\ncytokine induction by whole cell E. coli preparations. NT =not tested.\ndoi:10.1371\/journal.pone.0027076.t003\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 9 October 2011 | Volume 6 | Issue 10 | e27076\nmicroorganisms down to the species level [16,24,25,26]. It can be\nused to classify closely related bacteria, which may be indistin-\nguishable by conventional methods [24]. It was therefore\nemployed to investigate the diversity of the S. wadsworthensis\nprotein profiles. A characteristic pattern was clearly demonstrated\non the analysis of S. wadsworthensis strains, with a dominant peak at\napproximately 9400Da. Although no major differences were\ndetected between the strains, MALDI-TOF MS proved to be a\nhighly sensitive and reproducible method for the characterization\nof the bacterial mass spectra. Very small mass of sample were\nrequired, which was ideal for analyzing the slow and modest\ngrowing S. wadsworthensis. This finding will provide a useful\nreference for future studies and an alternative to genotypic\nmethods like 16S rRNA gene sequencing.\nThe in-vitro cytokine analysis after monocyte challenge failed to\nshow any distinct differences between strains isolated from patients\nwith IBD and controls. This last finding essentially closes the loop\nin the series of studies looking at the possible role of S.\nwadsworthensis in IBD. Our experiments have conclusively shown\nthat the prevalence of this bacterium is similar in IBD patients and\ncontrols and that there is no phenotypic, genotypic, proteomic or\npathogenic characteristic to distinguish bacteria isolated from\nthese two groups of patients. It is quite likely that S. wadsworthensis is\na commensal and a harmless bystander amidst the inflammatory\ncascade that is typical of inflammatory bowel disease.\nAcknowledgments\nWe would like to thank all adult gastroenterologists (Aberdeen Royal\nInfirmary) and paediatric gastroenterologists (Royal Aberdeen Children’s\nHospital and Royal Hospital for Sick Children, Glasgow) for their\nassistance in recruiting patients to this study. We would also like to thank\nthe patients, children and families who gave their time and consent to\nparticipate in this research.\nWe gratefully acknowledge the technical assistance of Mr Ian Davidson\nfor help with MALDI-TOF MS and Mr Kevin MacKenzie for expertise in\nSEM. We also thank Bruker Daltonics for providing the MALDI BioTyper\nsoftware.\nAuthor Contributions\nConceived and designed the experiments: IM RH EME-O GLH.\nPerformed the experiments: IM RH CEN YAA SHB CP DAS. Analyzed\nthe data: IM RH JMT RKR GLH. Contributed reagents\/materials\/\nanalysis tools: JMT RKR EME-O. Wrote the paper: IM RH GLH.\nReferences\n1. Hansen R, Thomson JM, El-Omar EM, Hold GL (2010) The role of infection in\nthe aetiology of inflammatory bowel disease. J Gastroenterol 45: 266–276.\n2. Khor B, Gardet A, Xavier RJ (2011) Genetics and pathogenesis of inflammatory\nbowel disease. Nature 474: 307–317.\n3. Marteau P (2009) Bacterial flora in inflammatory bowel disease. Dig Dis\n27(Suppl 1): 99–103.\n4. Sokol H, Seksik P, Rigottier-Gois L, Lay C, Lepage P, et al. (2006) Specificities\nof the fecal microbiota in inflammatory bowel disease. Inflamm Bowel Dis 12:\n106–111.\n5. Thomson JM, Hansen R, Berry SH, Hope ME, Murray GI, et al. (2011)\nEnterohepatic helicobacter in ulcerative colitis: potential pathogenic entities?\nPLoS One 6: e17184.\n6. Mukhopadhya I, Thomson JM, Hansen R, Berry SH, El-Omar EM, et al. (2011)\nDetection of Campylobacter concisus and Other Campylobacter Species in\nColonic Biopsies from Adults with Ulcerative Colitis. PLoS One 6: e21490.\n7. Mangin I, Bonnet R, Seksik P, Rigottier-Gois L, Sutren M, et al. (2004)\nMolecular inventory of faecal microflora in patients with Crohn’s disease. FEMS\nMicrobiol Ecol 50: 25–36.\n8. Wexler HM, Reeves D, Summanen PH, Molitoris E, McTeague M, et al. (1996)\nSutterella wadsworthensis gen. nov., sp. nov., bile-resistant microaerophilic\nCampylobacter gracilis-like clinical isolates. Int J Syst Bacteriol 46: 252–258.\n9. Molitoris E, Wexler HM, Finegold SM (1997) Sources and antimicrobial\nsusceptibilities of Campylobacter gracilis and Sutterella wadsworthensis. Clin\nInfect Dis 25(Suppl 2): S264–265.\n10. Sakon H, Nagai F, Morotomi M, Tanaka R (2008) Sutterella parvirubra sp. nov.\nand Megamonas funiformis sp. nov., isolated from human faeces. Int J Syst Evol\nMicrobiol 58: 970–975.\n11. Greetham HL, Collins MD, Gibson GR, Giffard C, Falsen E, et al. (2004)\nSutterella stercoricanis sp. nov., isolated from canine faeces. Int J Syst Evol\nMicrobiol 54: 1581–1584.\n12. Hansen R, Mukhopadhya I, Russell RK, Bisset WM, Berry SH, Thomson JM,\nEl-Omar EM, Hold LG (2011) The role of microaerophilic colonic mucosal\nbacteria in de novo paediatric inflammatory bowel disease. Gut 60(Suppl 1):\nA147.\n13. Silverberg MS, Satsangi J, Ahmad T, Arnott ID, Bernstein CN, et al. (2005)\nToward an integrated clinical, molecular and serological classification of\ninflammatory bowel disease: Report of a Working Party of the 2005 Montreal\nWorld Congress of Gastroenterology. Can J Gastroenterol 19(Suppl A): 5–36.\n14. Rozen S, Skaletsky H (2000) Primer3 on the WWW for general users and for\nbiologist programmers. Methods Mol Biol 132: 365–386.\n15. Kumar S, Tamura K, Nei M (2004) MEGA3: Integrated software for Molecular\nEvolutionary Genetics Analysis and sequence alignment. Brief Bioinform 5:\n150–163.\n16. Alispahic M, Hummel K, Jandreski-Cvetkovic D, Nobauer K, Razzazi-Fazeli E,\net al. (2010) Species-specific identification and differentiation of Arcobacter,\nHelicobacter and Campylobacter by full-spectral matrix-associated laser\ndesorption\/ionization time of flight mass spectrometry analysis. J Med Microbiol\n59: 295–301.\n17. Haag AF, Wehmeier S, Muszynski A, Kerscher B, Fletcher V, et al. (2011)\nBiochemical characterization of Sinorhizobium meliloti mutants reveals gene\nproducts involved in the biosynthesis of the unusual lipid A very long-chain fatty\nacid. J Biol Chem 286: 17455–17466.\n18. Hold GL, Pryde SE, Russell VJ, Furrie E, Flint HJ (2002) Assessment of\nmicrobial diversity in human colonic samples by 16S rDNA sequence analysis.\nFEMS Microbiol Ecol 39: 33–39.\n19. Selma MV, Espin JC, Tomas-Barberan FA (2009) Interaction between phenolics\nand gut microbiota: role in human health. J Agric Food Chem 57: 6485–6501.\n20. Andreasen MF, Kroon PA, Williamson G, Garcia-Conesa MT (2001) Esterase\nactivity able to hydrolyze dietary antioxidant hydroxycinnamates is distributed\nalong the intestine of mammals. J Agric Food Chem 49: 5679–5684.\n21. Engberg J, On SL, Harrington CS, Gerner-Smidt P (2000) Prevalence of\nCampylobacter, Arcobacter, Helicobacter, and Sutterella spp. in human fecal\nsamples as estimated by a reevaluation of isolation methods for Campylobacters.\nJ Clin Microbiol 38: 286–291.\n22. Kalischuk LD, Inglis GD (2011) Comparative genotypic and pathogenic\nexamination of Campylobacter concisus isolates from diarrheic and non-\ndiarrheic humans. BMC Microbiol 11: 53.\n23. Schippa S, Conte MP, Borrelli O, Iebba V, Aleandri M, et al. (2009) Dominant\ngenotypes in mucosa-associated Escherichia coli strains from pediatric patients\nwith inflammatory bowel disease. Inflamm Bowel Dis 15: 661–672.\n24. Ilina EN, Borovskaya AD, Malakhova MM, Vereshchagin VA, Kubanova AA,\net al. (2009) Direct bacterial profiling by matrix-assisted laser desorption-\nionization time-of-flight mass spectrometry for identification of pathogenic\nNeisseria. J Mol Diagn 11: 75–86.\n25. Lasch P, Beyer W, Nattermann H, Stammler M, Siegbrecht E, et al. (2009)\nIdentification of Bacillus anthracis by using matrix-assisted laser desorption\nionization-time of flight mass spectrometry and artificial neural networks. Appl\nEnviron Microbiol 75: 7229–7242.\n26. Kolinska R, Drevinek M, Jakubu V, Zemlickova H (2008) Species identification\nof Campylobacter jejuni ssp. jejuni and C. coli by matrix-assisted laser\ndesorption\/ionization time-of-flight mass spectrometry and PCR. Folia Micro-\nbiol (Praha) 53: 403–409.\n27. Skirrow MB (1977) Campylobacter enteritis: a ‘‘new’’ disease. Br Med J 2: 9–11.\n28. Reller LB, Merritt S, Reimer LG (1983) Controlled evaluation of an improved\nselective medium for isolation of Campylobacter jejuni from human feces\n[abstract] 83rd Annu Meet Am Soc Microbiol: C274: 357.\n29. Fox JG, Dewhirst FE, Shen Z, Feng Y, Taylor NS, et al. (1998) Hepatic\nHelicobacter species identified in bile and gallbladder tissue from Chileans with\nchronic cholecystitis. Gastroenterology 114: 755–763.\n30. Zhang L, Man SM, Day AS, Leach ST, Lemberg DA, et al. (2009) Detection\nand isolation of Campylobacter species other than C. jejuni from children with\nCrohn’s disease. J Clin Microbiol 47: 453–455.\nRole of Sutterella wadsworthensis in IBD\nPLoS ONE | www.plosone.org 10 October 2011 | Volume 6 | Issue 10 | e27076\n"}