{"doi":"10.1021\/es051602r","coreId":"135587","oai":"oai:bradscholars.brad.ac.uk:10454\/3161","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3161","10.1021\/es051602r"],"title":"Modulation of the cytotoxicity and geno-toxicity of the drinking water disinfection by-product iodoacetic acid by  suppression  of  oxidative stress ","authors":["Anderson, Diana","Cemeli, Eduardo","Richardson, S.D.","Wagner, E.D.","Plewa, M.J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2006","abstract":"NoDrinking water disinfection byproducts (DBPs) are generated by the chemical disinfection of water and may pose a hazard to the public health. Previously we demonstrated that iodoacetic acid was the most cytotoxic and genotoxic DBP analyzed in a mammalian cell system. Little is known of the mechanisms of its genotoxicity. The involvement of oxidative stress in the toxicity of iodoacetic acid was analyzed with the antioxidants catalase and butylated hydroxyanisole (BHA). Iodoacetic acid toxicity was quantitatively measured with and without antioxidants in Salmonella typhimurium strain TA100 and with Chinese hamster ovary (CHO) cells. The endpoints included cytotoxicity in S. typhimurium or in CHO cells, mutagenicity in S. typhimurium, and genotoxicity in CHO cells. Neither catalase nor BHA reduced the level of iodoacetic acid induced cytotoxicity in S. typhimurium. In CHO cells neither antioxidant caused a significant reduction in iodoacetic acid induced cytotoxicity. However, in S. typhimurium, BHA or catalase reduced the mutagenicity of iodoacetic acid by 33.5 and 26.8%, respectively. Likewise, BHA or catalase reduced iodoacetic acid induced genomic DNA damage by 86.5 and 42%, respectively. These results support the hypothesis that oxidative stress is involved in the induction of genotoxicity and mutagenicity by iodoacetic acid","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3161<\/identifier><datestamp>\n                2016-08-18T17:08:54Z<\/datestamp><setSpec>\n                com_10454_152<\/setSpec><setSpec>\n                col_10454_6342<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nModulation of the cytotoxicity and geno-toxicity of the drinking water disinfection by-product iodoacetic acid by  suppression  of  oxidative stress <\/dc:title><dc:creator>\nAnderson, Diana<\/dc:creator><dc:creator>\nCemeli, Eduardo<\/dc:creator><dc:creator>\nRichardson, S.D.<\/dc:creator><dc:creator>\nWagner, E.D.<\/dc:creator><dc:creator>\nPlewa, M.J.<\/dc:creator><dc:subject>\nCytooxicity<\/dc:subject><dc:subject>\nGeno-toxicity<\/dc:subject><dc:subject>\nDrinking water<\/dc:subject><dc:subject>\nDisinfection<\/dc:subject><dc:subject>\nIodoacetic acid<\/dc:subject><dc:subject>\nOxidative stress<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nDrinking water disinfection byproducts (DBPs) are generated by the chemical disinfection of water and may pose a hazard to the public health. Previously we demonstrated that iodoacetic acid was the most cytotoxic and genotoxic DBP analyzed in a mammalian cell system. Little is known of the mechanisms of its genotoxicity. The involvement of oxidative stress in the toxicity of iodoacetic acid was analyzed with the antioxidants catalase and butylated hydroxyanisole (BHA). Iodoacetic acid toxicity was quantitatively measured with and without antioxidants in Salmonella typhimurium strain TA100 and with Chinese hamster ovary (CHO) cells. The endpoints included cytotoxicity in S. typhimurium or in CHO cells, mutagenicity in S. typhimurium, and genotoxicity in CHO cells. Neither catalase nor BHA reduced the level of iodoacetic acid induced cytotoxicity in S. typhimurium. In CHO cells neither antioxidant caused a significant reduction in iodoacetic acid induced cytotoxicity. However, in S. typhimurium, BHA or catalase reduced the mutagenicity of iodoacetic acid by 33.5 and 26.8%, respectively. Likewise, BHA or catalase reduced iodoacetic acid induced genomic DNA damage by 86.5 and 42%, respectively. These results support the hypothesis that oxidative stress is involved in the induction of genotoxicity and mutagenicity by iodoacetic acid.<\/dc:description><dc:date>\n2009-07-28T07:40:28Z<\/dc:date><dc:date>\n2009-07-28T07:40:28Z<\/dc:date><dc:date>\n2006<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nCemeli, E., Wagner, E.D., Anderson, D., Richardson, S.D. and  Plewa, M.J. (2006). Modulation of the cytotoxicity and geno-toxicity of the drinking water disinfection by-product iodoacetic acid by  suppression  of  oxidative stress. Environmental Science & Technology. Vol. 40, No. 6, pp. 1878-1883.<\/dc:identifier><dc:identifier>\n90012229<\/dc:identifier><dc:identifier>\n90011469<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3161<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1021\/es051602r<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1021\/es051602r"],"year":2006,"topics":["Cytooxicity","Geno-toxicity","Drinking water","Disinfection","Iodoacetic acid","Oxidative stress"],"subject":["Article","No full-text available in the repository"],"fullText":null}