{"doi":"10.1243\/09544070JAUTO439","coreId":"55138","oai":"oai:eprints.lincoln.ac.uk:2227","identifiers":["oai:eprints.lincoln.ac.uk:2227","10.1243\/09544070JAUTO439"],"title":"Multiobjective analysis for the design and control of an electromagnetic valve actuator","authors":["Stewart, Paul","Gladwin, Dan","Fleming, P. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The electromagnetic valve actuator can deliver much improved fuel efficiency and reduced emissions in spark ignition (SI) engines owing to the potential for variable valve timing when compared with cam-operated, or conventional, variable valve strategies. The possibility exists to reduce pumping losses by throttle-free operation, along with closed-valve engine braking. However, further development is required to make the technology suitable for accept- ance into the mass production market. This paper investigates the application of multiobjective optimization techniques to the conflicting objective functions inherent in the operation of such a device. The techniques are utilized to derive the optimal force–displacement characteristic for the solenoid actuator, along with its controllability and dynamic\/steady state performance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55138.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2227\/1\/IMechE_Elvas.pdf","pdfHashValue":"43a59405e06fa4f099b9af41d316a87f0677bd29","publisher":"IMechE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2227<\/identifier><datestamp>\n      2013-03-13T08:35:17Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F47:6A6163735F47373030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48333330<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48333630<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2227\/<\/dc:relation><dc:title>\n        Multiobjective analysis for the design and control of an electromagnetic valve actuator<\/dc:title><dc:creator>\n        Stewart, Paul<\/dc:creator><dc:creator>\n        Gladwin, Dan<\/dc:creator><dc:creator>\n        Fleming, P. J.<\/dc:creator><dc:subject>\n        G700 Artificial Intelligence<\/dc:subject><dc:subject>\n        H330 Automotive Engineering<\/dc:subject><dc:subject>\n        H360 Electromechanical Engineering<\/dc:subject><dc:description>\n        The electromagnetic valve actuator can deliver much improved fuel efficiency and reduced emissions in spark ignition (SI) engines owing to the potential for variable valve timing when compared with cam-operated, or conventional, variable valve strategies. The possibility exists to reduce pumping losses by throttle-free operation, along with closed-valve engine braking. However, further development is required to make the technology suitable for accept- ance into the mass production market. This paper investigates the application of multiobjective optimization techniques to the conflicting objective functions inherent in the operation of such a device. The techniques are utilized to derive the optimal force–displacement characteristic for the solenoid actuator, along with its controllability and dynamic\/steady state performance.<\/dc:description><dc:publisher>\n        IMechE<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2227\/1\/IMechE_Elvas.pdf<\/dc:identifier><dc:identifier>\n          Stewart, Paul and Gladwin, Dan and Fleming, P. J.  (2007) Multiobjective analysis for the design and control of an electromagnetic valve actuator.  Proceedings of the IMechE, Part D: Automobile Engineering, 221  (5).   pp. 567-577.  ISSN 0954-4070  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1243\/09544070JAUTO439<\/dc:relation><dc:relation>\n        10.1243\/09544070JAUTO439<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2227\/","http:\/\/dx.doi.org\/10.1243\/09544070JAUTO439","10.1243\/09544070JAUTO439"],"year":2007,"topics":["G700 Artificial Intelligence","H330 Automotive Engineering","H360 Electromechanical Engineering"],"subject":["Article","PeerReviewed"],"fullText":"567\nMultiobjective analysis for the design and control of an\nelectromagnetic valve actuator\nP Stewart1*, D Gladwin1, and P J Fleming2\n1Department of Electronic and Electrical Engineering, University of Sheffield, Sheffield, UK\n2Department of Automatic Control and Systems Engineering, University of Sheffield, Sheffield, UK\nThe manuscript was received on 4 September 2006 and was accepted after revision for publication on 24 January 2007.\nDOI: 10.1243\/09544070JAUTO439\nAbstract: The electromagnetic valve actuator can deliver much improved fuel efficiency and\nreduced emissions in spark ignition (SI) engines owing to the potential for variable valve timing\nwhen compared with cam-operated, or conventional, variable valve strategies. The possibility\nexists to reduce pumping losses by throttle-free operation, along with closed-valve engine\nbraking. However, further development is required to make the technology suitable for accept-\nance into the mass production market. This paper investigates the application of multiobjective\noptimization techniques to the conflicting objective functions inherent in the operation of such\na device. The techniques are utilized to derive the optimal force–displacement characteristic\nfor the solenoid actuator, along with its controllability and dynamic\/steady state performance.\nKeywords: solenoid, multiobjective design, optimization, controllability, automotive,\nelectromagnetic valve actuator\n1 INTRODUCTION this paper is to select the actuator in such a way that\nthe control engineer implements the algorithms on\na platform that can achieve the dynamic perform-Actuator controllability is often considered relatively\nance required by the design specifications whilelate in the process of project development. The total\nstaying within other design implementation boundsmobile mass of the valve, collets, and spring is often\nsuch as current and voltage limits. The approach is aspredefined, along with the spring rate and preload.\nfollows. First, a suitable candidate force–displacementThe most commonly used valve for this application\nprofile that would allow the mechanical system tois the poppet valve which has the most desirable\ncomply with the performance criteria will be foundcharacteristic combination of gas flow properties,\nusing multiobjective evolutionary search techniques.closed sealing, ease of lubrication, and heat transfer.\nThis makes available to the electromagnetic designSubsequent selection of actuator hardware to achieve\nengineer a far more detailed force profile thanthe defined performance criteria is then often made\nsimply providing a maximum force requirement.in terms of static force characteristics, after which\nThis approach does not consider or include thetime the control developer must design algorithms\ndynamic limitations imposed by the behaviour ofto achieve the desired real-time dynamic perform-\ncurrent, flux, and force in the actuator. A candidateance. In this paper a structured approach to actuator\nelectromechanical actuator will thus be examinedselection and control system design is presented,\nby a similar multiobjective approach, this time tofocusing on the control of normal-force solenoid\nconfirm its controllability in the context of theactuators in the context of strict performance criteria,\nproject dynamic performance criteria. Finally, aalthough it will be shown that the technique can\ngain-scheduled position–velocity controller will beform the basis of a more generic approach. The aim\ndesigned, again using multiobjective techniques. Itof the multiobjective design approach presented in\nwill be shown that the application of multiobjective\ntechniques can contribute to the design of con-\n* Corresponding author: Department of Electronic and Electrical trol systems that are controllable in the sense of\nEngineering, University of Sheffield, Mappin Street, Sheffield extremely complex and in some cases conflicting\ndesign criteria.S1 3JD, UK. email: p.stewart@shef.ac.uk\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n568 P Stewart, D Gladwin, and P J Fleming\n2 PROBLEM DEFINITION 4. To minimize acoustic noise, landing velocity to\nthe fully open position must be less than 0.05 m\/s.\n5. At a supply voltage of 42 V, the maximum catchingSince it is freed from a fixed geometric relationship\nwith the crankshaft owing to its independent control, current must typically be 40 A.\n6. At a supply voltage of 42 V, the maximum holdingthe EMV offers great potential improvements in\nengine performance [1]. The standard configuration current must typically be 7.5 A.\nfor an electromagnetic valve actuator (EMV) consists\nThe performance definition given above is the\nof a spring and two electromagnets held within\nbase formulation of an objective function for\na rigid casing which acts directly on the stem of a\nthe mechanical system which will be extended to\nstandard poppet valve (Fig. 1).\ninclude a subobjective function for the electrical\nThe EMV configuration has balanced opposing\noperation of the electrical system. The designed con-\nsprings (to minimize the reactive power driven\ntrol algorithm must be able dynamically to open and\nthrough the power electronics) of equal rate, a full\nclose the valve subject to these operational con-\nstroke of 8 mm, in equilibrium position at 4 mm, and\nstraints. It can be seen that a set of position–velocity\nopposing solenoids to effect control over the move-\ntrajectories exist to satisfy these requirements, but\nment of the armature which bears on the valve stem.\nthe choice of actuator to achieve this performance\nThe two springs exchange potential energy during\nis an extremely complex one, compounded by the\nthe motion of the valve between the two operating\ninherently non-linear force capabilities of solenoid\npoints (fully open and fully closed). The actuators\nactuators. Although controllability analysis has been\ncompensate for the energy losses during motion, and\napplied to non-linear systems [3–5], a point is\nalso fulfil the requirement to hold the valve at the\nreached where the performance requirements of the\noperating points. The controllability of the system is\nsystem, in conjunction with all the other lumped-\nevaluated in the context of the project performance\nsystem non-linearities and discontinuities, become\nrequirements [2].\ntoo difficult a task for standardmathematical analysis.\nEvolutionary algorithms have been applied to a1. The transition time from fully open to fully closed\nmust be less than 3 ms. variety of control system design problems [6, 7].\nMore specifically, genetic algorithms have been used2. Tominimize acoustic noise, landing velocity to the\nfully closed position must be less than 0.05 m\/s. [8] to optimize the two-dimensional finite element\nelectromagnetic design of normal-force solenoid3. To minimize acoustic noise, the closing of the\nvalve clearance (the clearance between the actuators. This was, however, a single-objective\napproach to optimize the force–displacement profilearmature and the valve stem to ensure positive\nclosing, otherwise known as lash) from the fully over a range of air gaps. In the approach under con-\nsideration here, the design will proceed as follows.open position must be less than 0.05 m\/s.\nThe dynamic force–displacement characteristic\nrequired of the mechanical system will be analysed,\nan actuator topology will be selected, and finally the\nactuator controllability will be confirmed. An experi-\nmentally verified mechanical model in Simulink is\nused for performance verification, and also as the\nplatform for the multiobjective searches.\n3 FORCE–DISPLACEMENT OPTIMIZATION\nThe EMV system described in this paper was\ndeveloped as part of the EU Framework V project\nELVAS (Electronic Valve Actuation Systems) which\ndefined the physical parameters of the mechanical\nsystem as follows:\n(a) total mobile mass 90 g;Fig. 1 Electronically controlled engine valve actuator:\n(b) spring rate 75 N\/mm;A, upper solenoid; B, lower solenoid; C, fully\n(c) friction constant 13 N\/m s;closed; D, equilibrium position; E, fully open;\nF, upper spring; G, lower spring (d) spring preload 150 N.\nJAUTO439 © IMechE 2007Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n569Design and control of an electromagnetic valve actuator\nThe mechanical valve system can be modelled Objective 6. On release, the maximum armature\nvelocity closing the valve gap must be less than(Fig. 2) as [2]\n0.05 m\/s, where y˙\nvg\nis the contact velocity of the\narmature on the valve stem.y¨=\nF1−F2−By˙−2Ky\nm\n(1)\nObjective 7. Minimize the integral of force derivative\nwith respect to time.where y is the position of the armature relative to the\nequilibrium position, F\n1\nand F\n2\nare the lower and Objectives 1, 5, and 6 relate directly to stated design\nupper actuator forces respectively, B is the friction criteria, but the other objectives require some\nconstant, K is the effective spring rate of the pair of clarification. Objective 2 seeks to minimize the over-\nsprings, and m is the effective total mobile mass. For all power consumption of the actuators, since the\nthe purposes of analysis, the transition from valve force developed by the actuators will be related\nfully open to valve fully closed will be considered, to current, with related i2r copper losses in the\nand an objective function to be assessed by the windings. Objective 3 reflects the typical solenoid\nmultiobjective genetic algorithm (MOGA) will be force–displacement characteristic [9] which can be\nformulated. The objective function is defined as fol- approximated as\nlows\nF=\nKf(i )2\ne2\n(3)\nf (y, y˙)=minGtlr+AP l\nr\nF tb dtB (Fx2)tb\nwhere K\nf\nis the solenoid force constant, i is the\ncurrent, and e is the air gap. Consequently, solutions+[F(max)]tb( y˙l)(lim∏0.05 ms−1)\nthat require force at large air gaps are heavily\npenalized. Objective 4 seeks to minimize the overall+( y˙vg)(lim∏0.05 ms−1)+CdFdt (max)tbDH maximum value of the applied force, again to reduce\nthe effects of losses. Finally, objective 7 seeks to find(2)\nthe smoothest force profile in order to maximize the\nwhere the objectives are articulated as follows. potential for controllability of the actuators, since,\nowing to high reluctance, force derivatives at smallObjective 1. Minimization of the transition time from\nair gaps are a severe limiting factor to the dynamicrelease to landing, tl\nr\n.\nperformance of solenoid actuators. The geneticObjective 2. Minimization of the integral of force with\nalgorithms toolbox for Matlab with the multi-respect to time from release to landing with respect\nobjective extension tools (MOGA) developed at theto the bottom and top actuators, F t\nb\n.\nUniversity of Sheffield was utilized to perform theObjective 3. Minimize the applied force at large air\nsimulation routines.gaps, where x is the distance from the active\nactuator.\n3.1 MOGA overview\nObjective 4. Minimize the maximum applied force\nvalue. Formally, and without loss of generality [10], multi-\nobjective optimization can be expressed as: mini-Objective 5. The landing speed must be less than\n0.05 m\/s, where y˙\nl\nis the landing velocity. mize f(x), where f(x)=[ f\n1\n(x) … f\nn\n(x)] is a vector of\nFig. 2 Mechanical model\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n570 P Stewart, D Gladwin, and P J Fleming\nobjective functions, n is the number of objectives or\ncriteria to be considered, x=(x\n1\n… x\np\n) is a vector of\ndecision variables, and p is the number of decision\nvariables that comprise the complete solution. In\nthe absence of preference information, solutions\nto multiobjective problems are compared using the\nnotion of Pareto dominance. A particular solution x,\nwith associated performance vector u, is said to\ndominate another solution y with performance\nvector v(x,y) if the former performs at least as\nwell as the latter across all objectives, and exhibits\nsuperior performance in at least one objective. A\nsolution is said to be Pareto optimal if it is not\ndominated by any other possible solution. The Pareto\nfront is the set of points in criterion space that\ncorrespond to the Pareto optimal solutions. Without\na priori or progressive preference articulation, a\nmultiobjective search engine will generally aim to\ndiscover a family of solutions that provide a good\nrepresentation of the Pareto front (Figs 3 and 4). Fig. 4 Pareto optimality\nThe first Pareto-based multiobjective evolutionary\nalgorithm (MOEA) to be published was the multi-\nobjective genetic algorithm (MOGA) [11]. Genetic specifications. A general schematic of the MOGA is\nshown in Fig. 5. The MOGA framework can be seenalgorithms are suitable search engines for multi-\nobjective problems primarily because of their to incorporate all the elements of the standard,\nsingle-objective, genetic algorithm. A populationpopulation-based approach. An MOEA is capable\nof supporting diverse, simultaneous solutions in the of potential solutions is instantiated, then assessed\nand manipulated over a number of iterations insearch environment. A carefully designed GA is\nrobust in the face of ill-behaved cost landscapes order to obtain a good solution or set of solutions.\nPerformance assessment, selection, genetic operatorsfeaturing attributes such as multimodality and dis-\ncontinuity. Furthermore, the GA methodology offers (such as crossover and mutation), and reinsertion\nphases are functionally, in a general sense, the samea flexible choice of decision variables and objective\nfor the MOGA as for the standard GA. Population\ndistribution analysis, in which a measure of the\ndensity of the population is made, has also been\napplied in the single-objective case to cater for multi-\nmodal cost landscapes. The results of this analysis\nare used in niching and mating restriction schemes.\nMultiobjective ranking, which impacts primarily on\nfitness assignment, is the key difference between\nthe MOGA and a standard GA. Interaction with a\ndecision-maker (DM), or group of decision-makers,\nis made explicit in Fig. 5. The DM may choose to\nintroduce a priori information into the initial popu-\nlation (at the very least, this would include appro-\npriate limits on decision variables), as is sometimes\nthe case in standard GA applications. With the\nMOGA, the DM can also seek to influence the search\nwhile it is in progress by expressing preference for\nparticular solutions or, more generally, the likely\nattributes of a good solution. The essential difference\nbetween a MOGA and a single-objective GA is the\nmethod by which fitness is assigned to potential\nFig. 3 Non-dominated solution solutions. Each solution will have a vector describing\nJAUTO439 © IMechE 2007Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n571Design and control of an electromagnetic valve actuator\nFig. 5 MOGA schematic\nits performance across the set of criteria. This vector priorities for each of the objectives. These can be\nrefined as the search progresses. This informationmust be transformed into a scalar fitness value for\nthe purposes of the GA. This process is achieved by feeds into the preferability operator, which is used to\nrank solutions in a similar fashion to the standardranking the population of solutions relative to each\nother, and then assigning fitness based on rank. Pareto-based approach. Each potential solution is\ngiven a rank based on how many other solutionsIndividual solutions are compared in terms of Pareto\ndominance. This notion was introduced into the field are preferred to it. The preferability operator can\nbe seen as a unification of several popular prefer-of genetic algorithms by Goldberg [12]. MOGA uses\na variation of Goldberg’s proposition in order to ence articulation schemes adopted in the wider\noperational research community. Pareto optimality,determine ranks. Each individual is assigned a rank\nbased on the number of individuals by which it is the lexicographic method, goal programming, con-\nstraint satisfaction, and constrained optimization candominated (Fig. 6). In the absence of preference\ninformation, Pareto dominance is used to dis- all be described by special cases of the preferability\noperator.criminate between two competing solutions. How-\never, by involving a DM in the search, other factors\n3.2 Moga applicationcan be used to determine superiority. Fonseca\nand Fleming [7] introduced a preferability operator, MOGAs [11] have routinely been applied to control\nwhich discriminates between solutions on the basis optimization problems such as gain scheduling or\nof which is preferred by the DM. In the Fonseca and controller parameter optimization [13, 14]. However,\nFleming scheme, the DM can set goal levels and in the present case an attempt is being made to\nidentify the optimal dynamic force–displacement\ncharacteristic to operate within the bounds set by\nthe design criteria. The decision variables are in this\ncase assigned to a quantized map of the position of\nthe armature, with variables clustered more closely\nat small air gaps, since the bulk of the control action\nis anticipated to occur at air gaps less than 1 mm,\nalong with the soft valve gap closure after 0.3 mm.\nA 27-variable objective function was implemented,\nrepresenting 1 mm steps from release to landing,\nwith 0.1 mm steps within 1 mm of each actuator. The\nparameters associated with the MOGA set-up are\nFig. 6 Multiobjective ranking given in the Appendix. Applying the multiobjective\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n572 P Stewart, D Gladwin, and P J Fleming\nsearch algorithm to the mechanical system results in\na velocity-position profile that satisfies the project\ndesign requirements (Figs 7 and 8).\nThe motion of the armature under the candidate\nforce–displacement profile (Fig. 9) satisfies all the soft\nrelease, soft landing, and transition time criteria from\nthe project definition. It also inherently possesses a\nrelatively smooth force trajectory, which should also\nrepresent one of the lowest power consumptions\nwhen followed by a pair of actuators. This analysis\nconsiderably increases the detail of the design\nrequirements that can be supplied to the electro-\nmagnetic design engineer. However, a limiting factor\nin the operation of solenoids at relatively small air\ngaps is due to the current and flux dynamics. An\nFig. 9 Candidate force–displacement profileactuator candidate will now be considered to assess\nits performance suitability to achieve the required\ndynamics, using information derived from finite\nelement analysis. 4 ACTUATOR MULTIOBJECTIVE\nCONTROLLABILITY ANALYSIS\nAssuming a given valve pitch for the particular\ncylinder head under consideration (33mm), a solenoid\nactuator can be designed and simulated using finite\nelement methods [15, 16] based around a core size\nbounded by the valve pitch size, current and voltage\nlimitations, and other dimensional limitations of\nthe cylinder head. By way of example, applying a\nmagnetostatic approach (force analysis at fixed air\ngaps), a force–current–displacement map for a parti-\ncular design can be derived (Fig. 10). Comparison\nwith the optimized force–displacement requirement\n(Fig. 9) confirms the suitability of the candidate\nactuator in steady state terms (Figs 11 and 12),\nbut the controllability of the actuator in dynamic,\nFig. 7 Optimised position–velocity profile\nFig. 10 Solenoid actuator static force–current–displace-\nFig. 8 Optimised position–time profile ment characteristic\nJAUTO439 © IMechE 2007Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n573Design and control of an electromagnetic valve actuator\nFig. 13 Actuator force–current–displacement map from\nfinite element analysisFig. 11 Comparison of the solenoid actuator static\nforce–current–displacement characteristic with\noptimal force trajectory (lower)\nFig. 14 Actuator flux–current–displacement map from\nfinite element analysis\nFig. 12 Comparison of the solenoid actuator static\nforce characteristic with optimal force trajectory\n(lower) constraints?’ The system is controllable in this sense\nif an applied current trajectory exists that, when\napplied to the actuators, causes the armature tooperational terms cannot be confirmed. An electro-\nmagnetic dynamic model approximation is developed move in a position–velocity path that satisfies the\nmechanical constraints of the application (soft land-to allow multiobjective analysis again to be applied.\nThis time the analysis will seek to confirm the con- ing, etc.). The current trajectory must also comply\nwith the maximum current constraint, and voltagetrollability of the actuator, that is, whether a control\naction trajectory exists that satisfies all the dynamic must be limited to the application d.c. link voltage.\nTo achieve this end, a multiobjective analysis isrequirements and constraints. In an iterative environ-\nment, further design steps take place if the design constructed with the same quantization of decision\nvariables as before. In this case, the decision vari-cannot satisfy the project requirements. The relation-\nships between flux, current, and force ascertained by ables provide a position–current demand vector to\nbe tracked by the electromechanical model (Fig. 15).finite element analysis were studied (Figs 13 and 14)\nand were implemented as a Simulink model (Fig. 15). Tracking is achieved by a PID current controller, with\nthe multiobjective evolutionary algorithm set to theThe electromagnetic model is coupled to the mech-\nanical model and provides a platform on which to same operational parameters and objective function\nas before (with ‘force’ replaced by ‘current’). Also, thepostulate the question ‘is this system controllable in\nthe sense of performance requirements and design number of objectives was reduced to 6 by omitting\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n574 P Stewart, D Gladwin, and P J Fleming\nFig. 15 Electromagnetic model for controllability analysis\nthe overall maximum current objective to reduce the revealing the salient operating principles of the con-\nstrained system. The following examples can be given.computation time, since it had been found that\nthe force–distance penalties performed the same\n1. The actuator transition time (1) can be reduced\nfunction.\nby relaxing the constraints on currents applied at\nlarge air gaps (2), but this incurs a cost in terms\nof the soft landing (3).\n5 RESULTS\n2. Soft landing (3) and soft release (5) incur a cost\nin terms of the current derivatives (4).\nFigure 16 is the non-dominated trade-off output\n3. Close examination of the trade-off graph reveals\nfrom the multiobjective analysis. The objectives to\na particularly concerning trade-off, that is, there\nbe minimized are numbered as follows.\nare only a small number of candidate solutions in\nwhich both soft release and soft landing are1. Actuator transition time.\n2. Bottom actuator distance2×current. achieved.\n3. Soft landing velocity.\nThe single successful solution selected does comply\n4. Current derivative.\nwith all the required dynamic project requirements\n5. Soft release (valve gap closing) velocity.\nin terms of soft landing, soft departure, and trans-\n6. Top actuator distance2×current.\nition time (Figs 17 to 19). The constraint of 40 A\nmaximum current was, however, found in all casesIt is immediately apparent that the controllability of\nthe system is dependent on conflicting objectives, impossible to comply with to achieve the required\ndynamic performance. Although the 42 V supply\nFig. 16 Non-dominated trade-off graph for the\nFig. 17 Successful time–position trajectoryactuator controllability analysis\nJAUTO439 © IMechE 2007Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n575Design and control of an electromagnetic valve actuator\nvoltage was strictly adhered to, it was found that the\nmaximum current constraint needed to be relaxed in\norder to achieve the performance requirements. With\na current limit of 45 A, a current trajectory does exist,\nwhich when tracked by standard PID current control\nloops produces a position–velocity trajectory for the\narmature that complies with the required dynamic\nperformance. A revised current limit has also been\nidentified that allows these objectives to be achieved.\nThe approach has identified a means of confirming\nthe controllability of complex non-linear systems.\n6 CONCLUSIONS\nFig. 18 Reference\/tracking performance of successful\ncontroller An application example has been presented in order\nto illustrate a technique for answering the question\nas to the controllability of the system. Although the\nexample investigates an existing actuator candidate,\nit is envisaged that the technique will exist as part of\na greater multiobjective design process that includes\nactuator redesign (Figs 20 and 21). It has been shown\nthat, in the example, the actuator as designed does\nsatisfy the static force requirements and thus should\nbe capable of effecting adequate operation of the\narmature. However, in practice the control design to\nachieve all the project performance objectives was\nproving difficult to achieve. In general the multi-\nobjective controllability analysis would have been\nperformed before the manufacture of experimental\nactuators, and an iterative process performed with\nfinite element analysis to achieve a controllable\nsystem. In the case presented here, it is possible to\nanalyse the existing design and enter an iterative\nFig. 19 Upper and lower actuator current waveforms\ndesign phase to produce an improved actuator. It can\nFig. 20 Stage 1 analysis and design\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n576 P Stewart, D Gladwin, and P J Fleming\nFig. 21 Stage 2 analysis and design\nalso be seen that the technique has potential benefits limiting factors at small air gaps, and thus the system\nwould benefit in both controllability and robustnessto a wide range of applications where controllability\nanalysis proves difficult or impossible by conven- from further iterative design steps in terms of the\nactuator design. This process is currently in progress.tional methods.\nIt has been shown that the analysis has identified The process has successfully identified limitations\nand potential solutions to achieving controllabilitythe requirement to increase the operational current\nlimits in order to achieve controllability. It has also of a non-linear constrained multiobjective system.\nAlthough controllability has been confirmed, thebeen shown that the group of successful candidate\ncurrent vector solutions is extremely small. This is method has also confirmed experimental experience\nregarding the difficulty of implementing successfulan area of the technique deserving further research.\nIt would certainly verify the experimental problems control design. Although the technique is relatively\nnew, its potential benefits are apparent for develop-that have been experienced implementing successful\ncontrol design on the system. A conclusion that ing new systems, as is the potential for identifying\ncontrollability issues with existing systems.appears to be valid would be that the multivariable\ncontrollability analysis of the system also reveals\na subset of potential robustness in any designed\nACKNOWLEDGEMENTScontrol systems. The small number of candidate\nsolutions shows that the family of current vectors\nThe authors would like to thank Dr Richard Clark ofthat can achieve controllability is small, and indeed\nthe Electrical Machines and Drives group at Sheffieldnarrow. This is confirmed by experimental experi-\nUniversity, UK, for providing the finite elementence which suggests that the system is extremely\nanalysis of the electromagnetic actuator.susceptible to physical parameter variations.\nThe findings would suggest that the system is\nindeed controllable, but further iterations of the\nREFERENCESdesign procedure are necessary. This conclusion\nstems from the narrow band of successful solu- 1 Park, S.-H., Lee, J., Yoo, J., Kim, D., and Park, K.\ntions, suggesting an extremely sensitive system, and, Effects of design and operating parameters on the\ncoupled to this, the relationship between the current static and dynamic performance of an electro-\ndemand derivatives and soft release\/landing. It was magnetic valve actuator. Proc. Instn Mech. Engrs,\nPart D: J. Automobile Engineering, 2003, 217, 193–201.found in the search for successful candidate solu-\n2 Wang, Y., Stefanopoulou, A., Haghgooie, M.,tions that the restrictions on the current demand\nKolmanovsky, I., and Hammoud, M. Modelling ofvector derivatives needed to be relaxed to achieve\nan electromechanical valve actuator for a camlesscontrollability, suggesting a significant limitation\nengine. 5th International Conference on Advanced\nto controllability. After a narrow successful band, Vehicle Control, University of Michigan, USA.\nfurther relaxation produces no further successful 3 Hermann, R. and Krener, A. J. Nonlinear con-\ncandidates. This suggests that the time constants of trollability and observability. IEEE Trans. Autom.\nControl, 1977, (22), 728–740.current and flux (and hence force production) are\nJAUTO439 © IMechE 2007Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n577Design and control of an electromagnetic valve actuator\n4 Nijmeijer, H. Controllability distributions for non- 15 Simkin, J. and Trowbridge, C. W. Optimization\nlinear systems. Syst. Control Lett., 1982, (2), 122–129. problems in electromagnetics. IEEE Trans. Magnetics,\n5 Van der Schaft, A. J. Observability and con- 1991, 27, 4016–4019.\ntrollability for smooth nonlinear systems. SIAM 16 Ratnajeevan, S. and Hoole, H. Computer aided\nJ. Control Optimisation, 1982, 20, 338. analysis and design of electromagnetic devices, 1989\n6 Chipperfield, A. and Fleming, P. J. Multiobjective (Elsevier, New York).\ngas turbine engine controller design using genetic 17 Zitzler, E. and Thiele, L. Multiobjective evolutionary\nalgorithms. IEEE Trans. Ind. Electronics, 1996, 43(5), algorithms: a comparative case study and the\n1–5. strength Pareto approach. IEEE Trans. Evolutionary\n7 Fonseca, C. M. and Fleming, P. J. Multiobjective Comput., 1999, 3(4), 257–271.\noptimisation and multiple constraint handling with\nevolutionary algorithms. Part 1: a unified formu-\nlation; Part 2: application example. IEEE Trans. Syst., APPENDIX\nMan and Cybernetics, Part A: Syst. and Humans,\n1998, 28(1), 26–37, 38–47. MOGA parameters\n8 Zaoui, F. and Marchand, C. Using genetic algorithm\nPopulation size: 100.for the optimization of electromagnetic devices.\nNumber of decision variables: 27.COMPEL – Int. J. for Comput. and Math. in Elect.\nNumber of objectives: 7.and Electronic Engng, 1998, 17(1–3), 181–185.\n9 Sadiku, M. N. O. Elements of electromagnetics, Number of immigrants per generation: 6.\n2nd edition, 1989, pp. 382–383 (Oxford University Coding: grey, 20 bits per decision variable, except\nPress, Oxford). where varied [17].\n10 Purshouse, R. C. and Fleming, P. J. The multi-\nSelection: stochastic universal sampling.objective genetic algorithm applied to benchmark\nRecombination: single-point binary crossover, prob-problems – an analysis. Research report 796,\nability 0.7.Department of Automatic Control and Systems\nEngineering, University of Sheffield, UK, August Mutation: element-wise bit flipping, expectation of\n2001. 1 bit per chromosome.\n11 Fonseca, C. M. and Fleming, P. J. Genetic algorithms Generational gap: zero.\nfor multiobjective optimisation: formulation, dis- Random injection: two random chromosomes per\ncussion and generalisation. In Genetic algorithms:\ngeneration.proceedings of the fifth international conference,\nElitism: none.1993, pp. 416–423 (Morgan Kaufmann, San Mateo,\nFitness assignment: Fonseca and Fleming [11]California).\n12 Goldberg, D. E. Genetic algorithms in search, multiobjective ranking. Transformation from rank\noptimisation and machine learning, 1989 (Addison- to fitness using linear fitness assignment with\nWesley, Boston). rank-wise averaging.\n13 Schroder, P., Green, B., Grum, N., and Fleming, P. J.\nExternal population: off-line storage of non-On-line evolution of robust control systems: an\ndominated solutions.industrial active magnetic bearing application. IFAC\nFitness sharing: (parameter-less) Epanechnikov fit-J. Control Engng Pract., 2001, 9(1), 37–49.\nness sharing [7] implemented in criterion space.14 Griffin, I. A., Schroder, P., Chipperfield, A. J., and\nFleming P. J. Multiobjective optimisation approach Mating restriction implemented: distance set to the\nto the ALSTOM gasifier problem. Proc. Instn Mech. niche size parameter found by the Epanechnikov\nEngrs, Part I: J. Systems and Control Engineering, sharing algorithm.\n2000, 214, 453–468.\nJAUTO439 © IMechE 2007 Proc. IMechE Vol. 221 Part D: J. Automobile Engineering\n"}