{"doi":"10.1017\/S0036930605001407","coreId":"66181","oai":"oai:dro.dur.ac.uk.OAI2:2660","identifiers":["oai:dro.dur.ac.uk.OAI2:2660","10.1017\/S0036930605001407"],"title":"Rehabilitating John Cassian : an evaluation of Prosper of Aquitaine's polemic against the 'Semipelagians'.","authors":["Casiday,  A. M .C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-08","abstract":"Great strides have been made in the study of John Cassian over the last half-century, and yet persistent concerns are still expressed in regard to his theological competence. Invariably, the standard against which Cassian is found wanting is Augustinian orthodoxy. And there is nothing new in this: these concerns were first expressed by Cassian's contemporary, Prosper of Aquitaine, especially in his polemic Contra collatorem. Prosper is the harbinger of medieval Augustinianism and this makes his claims seem almost inevitable in retrospect – but as this analysis will demonstrate, his evaluation and denunciation of Cassian is systematically flawed. Close attention to Prosper's work reveals not only that his criticism of Cassian was ill-considered; it also shows that Prosper's own theological insight is less penetrating than one might have hoped to find in the ‘first Augustinian’. The consequences for the study of Cassian, I suggest, are that Prosper's threadbare accusations no longer need to be entertained. But there is further significance in this finding: it is Prosper's polemic against Cassian that provides the categories that have regularly been used to evaluate the early reception of Augustinianism. If, as is shown in this paper, Prosper was an opportunistic controversialist who can be seen to have distorted, embellished and in some cases even fabricated his opponent's arguments, then we should be extremely reserved in using his polemic as the point of departure, not just for studying Cassian, but for studying the development of Augustinianism as a whole","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66181.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2660\/1\/2660.pdf","pdfHashValue":"c79df7d0006c7d57c784bb02608ec8a7b6e537a2","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2660<\/identifier><datestamp>\n      2011-08-19T15:42:16Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Rehabilitating John Cassian : an evaluation of Prosper of Aquitaine's polemic against the 'Semipelagians'.<\/dc:title><dc:creator>\n        Casiday,  A. M .C.<\/dc:creator><dc:description>\n        Great strides have been made in the study of John Cassian over the last half-century, and yet persistent concerns are still expressed in regard to his theological competence. Invariably, the standard against which Cassian is found wanting is Augustinian orthodoxy. And there is nothing new in this: these concerns were first expressed by Cassian's contemporary, Prosper of Aquitaine, especially in his polemic Contra collatorem. Prosper is the harbinger of medieval Augustinianism and this makes his claims seem almost inevitable in retrospect – but as this analysis will demonstrate, his evaluation and denunciation of Cassian is systematically flawed. Close attention to Prosper's work reveals not only that his criticism of Cassian was ill-considered; it also shows that Prosper's own theological insight is less penetrating than one might have hoped to find in the ‘first Augustinian’. The consequences for the study of Cassian, I suggest, are that Prosper's threadbare accusations no longer need to be entertained. But there is further significance in this finding: it is Prosper's polemic against Cassian that provides the categories that have regularly been used to evaluate the early reception of Augustinianism. If, as is shown in this paper, Prosper was an opportunistic controversialist who can be seen to have distorted, embellished and in some cases even fabricated his opponent's arguments, then we should be extremely reserved in using his polemic as the point of departure, not just for studying Cassian, but for studying the development of Augustinianism as a whole.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Scottish journal of theology, 2005, Vol.58(3), pp.270-284 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2660<\/dc:identifier><dc:identifier>\n        issn:0036-9306<\/dc:identifier><dc:identifier>\n        issn: 1475-3065<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0036930605001407<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2660\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0036930605001407<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2660\/1\/2660.pdf<\/dc:identifier><dc:rights>\n        Copyright Scottish Journal of Theology Ltd 2005<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1475-3065"," 1475-3065","issn:0036-9306","0036-9306"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n18 June 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCasiday, A. M .C. (2005) ’Rehabilitating John Cassian : an evaluation of Prosper of Aquitaine’s polemic\nagainst the ’Semipelagians’.’, Scottish journal of theology., 58 (3). pp. 270-284.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0036930605001407\nPublisher’s copyright statement:\nCopyright Scottish Journal of Theology Ltd 2005\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n18 June 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCasiday, A. M .C. (2005) 'Rehabilitating John Cassian : an evaluation of Prosper of\nAquitaine's polemic against the 'Semipelagians'.', Scottish journal of theology., 58 (3),\npp. 270-284.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0036930605001407\nPublisher’s copyright statement:\nCopyright Scottish Journal of Theology Ltd 2005\nSJT 58(3): 270–284 (2005) Printed in the United Kingdom C© 2005 Scottish Journal of Theology Ltd\ndoi:10.1017\/S0036930605001407\nRehabilitating John Cassian: an evaluation of\nProsper of Aquitaine’s polemic against the\n‘Semipelagians’\nAugustine Casiday\nDepartment of Theology, Abbey House, Palace Green, Durham DH1 2RS a.m.c.casiday@durham.ac.uk\nAbstract\nGreat strides have been made in the study of John Cassian over the last half-\ncentury, and yet persistent concerns are still expressed in regard to his theological\ncompetence. Invariably, the standard against which Cassian is found wanting is\nAugustinian orthodoxy. And there is nothing new in this: these concerns were\nfirst expressed by Cassian’s contemporary, Prosper of Aquitaine, especially in his\npolemic Contra collatorem. Prosper is the harbinger of medieval Augustinianism\nand this makes his claims seem almost inevitable in retrospect – but as this analysis\nwill demonstrate, his evaluation and denunciation of Cassian is systematically\nflawed. Close attention to Prosper’s work reveals not only that his criticism of\nCassian was ill-considered; it also shows that Prosper’s own theological insight is\nless penetrating than one might have hoped to find in the ‘first Augustinian’. The\nconsequences for the study of Cassian, I suggest, are that Prosper’s threadbare\naccusations no longer need to be entertained. But there is further significance in\nthis finding: it is Prosper’s polemic against Cassian that provides the categories\nthat have regularly been used to evaluate the early reception of Augustinianism.\nIf, as is shown in this paper, Prosper was an opportunistic controversialist who\ncan be seen to have distorted, embellished and in some cases even fabricated\nhis opponent’s arguments, then we should be extremely reserved in using his\npolemic as the point of departure, not just for studying Cassian, but for studying\nthe development of Augustinianism as a whole.\nIntroduction\nIn this paper, I will argue that the received account of how various parties\nin southern Gaul, in around the fifth to sixth centuries, responded to the\nworks of Augustine is badly in need of revision; my point of departure for\nthis argument will be a partial reassessment of the allegation that John\nCassian was a ‘Semipelagian’. Some progress has already been made in\nthe re-evaluation of the theological ambient of Christian Gaul during the\nperiod under examination, but it has not been radical enough: the heady\nwine of controversy has left modern scholars with a hangover and even\nvery sympathetic authors exhibit a strange compulsion in their research to\n270\nRehabilitating John Cassian\nconform to a conceptual category that they explicitly disown.1 My case for\na more thorough-going re-evaluation of ‘Semipelagianism’ is based on a\ncritique of a figure whose part in forming the received account has been\ntoo often ignored – Prosper of Aquitaine. Briefly, I will argue that Prosper’s\npolemical version of Gallic opposition to Augustine’s writings is based on\na false theological dichotomy. In two letters and in a long treatise, Prosper\nmakes the case that one must support either the heretic Pelagius or the\ncatholic Augustine, and by implication that any criticism of Augustine is\ntantamount to an endorsement of Pelagius.\nThe reason for devoting so much attention to Cassian is quite simply that\nCassian is the only author whose putative Antiaugustinianism is attacked\nby Prosper and whose purportedly Antiaugustinian treatise is extant, in the\ncontext of a much larger corpus. For this reason, in the case of Cassian we\nare able to assess Prosper’s claims with reference to the original document –\nsomething that is impossible in his polemics against Vincent of Le´rins\nand his anonymous Genoese and Gallic opponents. Furthermore, the Contra\ncollatorem is a valuable witness to Prosper’s case for Augustine since it provides\ndescriptions of and commentary on the sort of events that Prosper describes\nonly very vaguely in his letters. It is also particularly useful for our purpose\nbecause it is the longest and most detailed of his pro-Augustinian polemics.\nSo, if it can be demonstrated that the Contra collatorem is unreliable due\nto programmatic distortion, we will have a strong case against accepting\nProsper’s other claims in the absence of corroboration.\nProsper’s history of ‘Semipelagianism’\nIt is convenient to begin with E´. Amann’s eminently Prosperian definition of\n‘Semipelagianism’:\nFor us, Semipelagianism is essentially an exaggerated Antiaugustinianism\nwhich, rightly or wrongly fearing certain affirmations by the Doctor of\nHippo about the divine ordering of human wills, about the distribution\nof heavenly assistance, [and] about the working of grace, tried to add to\nthe work of salvation a part – more or less appreciable, even more or less\nexclusive – for human effort.2\n1 Two excellent studies, Columba Stewart, Cassian the Monk (New York: Oxford University\nPress, 1998), and Rebecca Harden Weaver, Divine Grace and Human Agency: A Study of the Semi-\nPelagian Controversy (Macon, GA: Mercer University Press, 1996), exhibit this tendency;\nby contrast, Thomas A. Smith, De gratia: Faustus of Riez’s Treatise on Grace and Its Place in the\nHistory of Theology (Notre Dame: University of Notre Dame Press, 1990) is notably free\nof deference to traditional misgivings.\n2 E´. Amann, ‘Semipe´lagianisme’, in Dictionnaire de Spiritualite´ 14[ii]. 1796–7.\n271\nscottish journal of theology\nThese Antiaugustinians owe their name to the fact that, like Pelagians,\nthey took exception to ‘certain affirmations by the Doctor of Hippo’;\nfor this reason, even if they did not endorse the full complement of\nPelagian teachings, they were objectionably ‘Semipelagian’.3 The eponymous\ncontroversy began c.428, when Prosper wrote a letter to a certain Rufinus,\ndescribing Gallic reactions to Augustine’s writings; and ended in 529 with\nthe Second Council of Orange. Our attention will be directed at the opening\nstages of this controversy, the most detailed sources for which were written\nby Prosper.\nThese sources are his letters to Rufinus and to Augustine; his Answers to the\nExtracts of the Genoese; his treatise On God’s grace, Against the Author of the Conferences;\nhis Answers to the Gallic Objections; his Answers to the Vincentian Articles; and his poem\nDe ingratiis (‘On the thankless ones’, or ‘On the graceless ones’, or – better\nyet – both). The letters contain the best orientation towards the controversy;\nthe poem reiterates Prosper’s version of what was happening; and the other\nworks are righteously indignant responses to perceived attacks against the\nwritings of Augustine. Prosper’s analysis of these events does not develop\nsignificantly, so it is possible to gain an accurate sense of his broad views\nfrom the letters. To these we now turn.\nProsper begins a letter to Rufinus by announcing that he intends to set\nRufinus’s mind at rest, ‘lest malicious rumours, which cannot fail to reach\nyour ears, should cause you fear and anxiety’.4 To this end, Prosper says\nhe will explain everything – since Rufinus ‘could not hear all the rumours\n3 It should be noted that the term ‘Semipelagiana’ is an early modern coinage. The\nterm first appears in the debates between the Jesuit Molina (in his Concordia (1589))\nand the Dominican Ban˜ez, and then in the Congregationes de auxiliis (held in Rome\nfrom 1590 to 1607). Other notable figures who weighed in on the discussion or\notherwise propagated the term were Robert Bellarmine, SJ (De scriptoribus ecclesiasticis\n(1613)); Francisco Suarez, OP (Operis de divina gratia tripartiti (Lyons 1620)); Cornelius\nJansen (Augustinus: De haeresi Pelagaiana I.79–81; and cf. Innocent X’s condemnation of\nfive of Jansen’s errors: Denzinger-Banwart, Enchiridion symbolorum, nn. 1092–1096);\nJacques Sirmond, SJ (Historia praedestinatiana (PL 53)); H. Noris, OSA (Historia Pelagiana\n(Petavius 1708)); and Le Nain de Tillemont (Me´moires pour servir a` l’histoire eccle´siastique\ndes six premiers sie`cles 14.157–88, 739–42 (Venice 1732)). By contrast, Prosper himself\nonly once explicitly says of his opponents that they are propagating ‘reliquae prauitatis\nPelagianae’ (Ad Aug. 7 (PL 51.72)), and never uses the term ‘semipelagianus’. It is\nnevertheless clear that Prosper’s polemic adumbrates the later debates to a remarkable\nextent, and even if the word ‘Semipelagian’ is lacking, the message is practically\nidentical all the same.\n4 Prosper, Ad Ruf. prol. 1 (PL 51.77): ‘ne quid maligni rumores, in quantum se auribus\ntuis subtrahere nequeunt, formidinis tibi aut anxietatis inferrent’.\n272\nRehabilitating John Cassian\nmy adversaries are spreading’.5 Prosper explains that the context of these\ntroubles is the Catholic struggle against Pelagianism. He depicts himself as\nvaliantly engaged in ‘execrating’ wrong opinions and the authors thereof,6\nand notes that he has been becoming increasingly unpopular owing to his\nadmiration for Augustine’s works.7 No doubt, Prosper’s abrasive style and\nclarity of vision contributed to his lack of popularity.\nFor instance, Prosper reduces Pelagianism to a single proposition, which\nhe calls the ‘subtlest and most nefarious seed of the other’ blasphemies –\nnamely, ‘The grace of God is given according to human merit.’8 He warns\nthat Pelagians are capable of ‘disingenuously retaining [this proposition]\nin their bosom as they profess that the grace of God is necessary for\nman in beginning, advancing and persevering in the good’.9 The practical\nimplication of Prosper’s warning is that he can identify Pelagian taint in\nerstwhile Catholics – as indeed he does, with gusto, in his later polemics.\nSuch behaviour was no doubt galling for his peers, and this may go a long way\ntowards accounting for the acrimonious, if not always personally vindictive,\ntone of Prosper’s campaign on Augustine’s behalf.\nIn any case, Prosper reassures Rufinus that the wiles of the heretics are no\nmatch for God’s champions; he alludes to the condemnations of Pelagianism\nby the sixteenth Council of Carthage (418) and by Pope Zosimus (418),\nand to Pelagius’s evidently mendacious testimony at the Synod of Diospolis\n(c.415). But pride of place goes to Augustine.10 Unfortunately, Augustine’s\nwritings inspired backbiting amongst some known to Prosper: ‘some of\nours – it is to their great shame! – speak against him with hidden, but not\nunheard, whispers’.11 These whispers sound strikingly like a potted modern\nintroduction to the later writings of Augustine: ‘And if they happen to find\n5 Prosper, Ad Ruf. prol. 1 (PL 51.77): ‘quia non potuisti in totum quae ab adversantibus\ndisseminantur audire’.\n6 Prosper, Ad Ruf. 18.19 (PL 51.88): ‘nec nos perturbant, qui tales opiniones cum suis\nauctoribus exsecramur’.\n7 Prosper, Ad Ruf, prol. 1 (PL 51.77).\n8 Prosper, Ad Ruf. 1.2 (PL 51.77): ‘Ex his tamen una est blasphemia, nequissimum et\nsubtilissimum germen aliarum, qua dicunt “Gratiam Dei secundum merita hominum\ndari.”’\n9 Prosper, Ad Ruf. 1.2 (PL 51.78): ‘hoc apud se ingenio servaverunt, ut ad incipiendum,\net ad proficiendum, et ad perseverandum in bono necessariam homini Dei gratiam\nprofiterentur’.\n10 Prosper, Ad Ruf. 3.4 (PL 51.78–9): ‘beatissimus quoque Augustinus, praecipua utique\nin hoc tempore portio Domini sacerdotum, copiose et pulchre, in multis voluminum\ndisputationibus destruxit’.\n11 Prosper, Ad Ruf. 3.4 (PL 51.79): ‘quidam nostrorum (quod de ipsis multum dolendum\nest) occultis, sed non incognitis susurrationibus obloquuntur’.\n273\nscottish journal of theology\nears hateful and ready, they malign the writings of his by which the Pelagians’\nerror was fought, claiming he totally displaced free will and preached a fatal\nnecessity under the guise of grace. They even add that he wants us to believe\nthere are two substances in the human race, and two natures. Thus the\nunholiness of pagans and Manichees is ascribed to a man of such holiness!’12\nProsper invites Augustine’s accusers to corroborate their accusations, but\nsays that they are totally unwilling to do this because of the multitudes of\nAugustine’s authoritative writings. So they go on ‘bellyaching in private and\ndeliberately keeping quiet in public’, as he bluntly puts it.13 He then gives a\ndetailed list of the scriptures that Augustine’s opponents wrongly interpret\nand spends the rest of the letter offering correct interpretations.\nIn this letter, Prosper lays down a set of principles from which he\nnever diverts and which become fixed points for scholarship for the next\nmillennium and a half. The first is his assertion that his enemies are\nsurreptitiously attacking Augustine. Even in his later writings, he repeatedly\navers to whispering campaigns against Augustine. With Prosper’s claims,\nthese whispers pass over into documented history. Thus Prosper creates a\nsuspicion of opposition to Augustine that characterises scholarly writings\nabout Late Antique Gaul down to the modern period. Indeed, Prosper’s\nversion has that enviable feature of all good conspiracy theories: it is\npredicated on the assumption that the conspirators are clever enough not\nto leave any evidence; it flourishes on suspicion, rather than proof. Second,\nhe claims that Pelagians are capable of dissembling by adopting other beliefs,\nbut that by definition Pelagians believe that God’s grace is given according\nto human merit. The corollary is that if a person can be shown to believe\nthat God’s grace is given according to human merit, that person is Pelagian\nregardless of whatever else he might (or might not) believe. Third, Prosper is\nwell aware that a multilateral movement denounced Pelagius’s teaching and\nits proponents, but he invariably attributes the Catholic success to Augustine.\n12 Prosper, Ad Ruf. 3.4 (PL 51.79): ‘et prout sibi obnoxias aliquorum aures opportunasque\nrepererint, scripta ejus, quibus error Pelagianorum impugnatur, infamant; dicentes\neum liberum arbitrium penitus submovere, et sub gratiae nomine necessitatem\npraedicare fatalem. Adjicientes etiam, duas illum humani generis massas, et duas credi\nvelle naturas: ut scilicet tantae pietatis viro paganorum et Manichaeorum ascribatur\nimpietas.’\n13 Prosper, Ad Ruf. 4.5 (PL 51.79–80): ‘Sed quis nescit cur ista privatim de stomacho\ngarriant, et publice de consilio conticescant? Volentes enim in sua justitia magis\nquam in Dei gratia gloriari, moleste ferunt quod his quae adversum excellentissimae\nauctoritatis virum, inter multas collationes asseruere, resistimus. Nec dubitant,\nsi quam hinc moverint quaestionem, in qualibet frequentia sacerdotum, in\nqualibet congregatione populorum, centenis sibi beatissimi Augustini voluminibus\nobviandum.’\n274\nRehabilitating John Cassian\nThis is the first indication of the programmatic shift that characterises\nProsper’s version of the events. By the time he sets out to write against Cassian,\nhe presents a starkly monochromatic picture – Augustine versus Pelagius.\nFourth, a powerful emphasis on Augustine as the framer and defender of\northodoxy entails automatic hostility towards any perceived slight against\nAugustine – and this is precisely what we find with Prosper. As the controversy\nfires up, Prosper collapses any argument against predestination into an\nargument against Augustine, which he takes in turn as an argument for\nPelagius. Conversely, any affirmation of human merit serves as grist for\nProsper’s mill – merit is Antiaugustinian, and therefore pro-Pelagian. The\nbeauty of Prosper’s analysis is its simplicity.\nProsper’s letter to Augustine is basically similar to his letter to Rufinus,\nalthough he does add some important details. Prosper sets out to warn the\nAfrican bishop that ‘a number of the servants of Christ who live at Marseilles\nare of the opinion that what Your Holiness wrote, in your tracts against the\nPelagian heresies about the call of the elect according to God’s decree, is\nagainst the teaching of the Fathers and the faith of the Church’.14 He notes\nthat these monks had assumed that the misunderstanding was theirs, and\nhad even intended to submit their questions to Augustine personally (he will\nlater mention Hilary of Arles by name as being one of them),15 but that\nwhen he himself had produced a copy of Augustine’s De correptione et gratia, the\ncommunity was divided. Those ‘who already before followed the holy and\napostolic doctrine which you teach’ were won over, but those ‘whose minds\nwere held by the cloud of their own opinion’ were intransigent. Prosper’s\nconcern in writing to Augustine is not least that the intransigent party have\na dangerous influence over ‘the simple faithful who revere those persons\nhighly for their virtue, and who believe it is perfectly safe for them to admit\nwhat they hear from those whose lead they follow unquestioningly’.16\nProsper then summarises the beliefs of Augustine’s opponents. They\nacknowledge the necessity of grace and insist that Christ’s reconciliation\nis open to all. However, God has predestined for salvation those whom\nHe foreknew would be worthy of their election. Thus, predestination\ndepends upon foreknown merit. Even though they agree that predestination\n14 Prosper, Ad Aug. 2 (PL 51.67–8): ‘Multi ergo servorum Christi qui in Massiliensi urbe\nconsistunt, in sanctitatis tuae scriptis quae adversus Pelagianos haereticos condidisti,\ncontrarium putant Patrum opinioni et ecclesiastico sensui quidquid in eis de vocatione\nelectorum secundum Dei propositum disputasti.’\n15 Prosper, Ad Aug. 9 (PL 51.74).\n16 Prosper, Ad Aug. 2 (PL 51.69): ‘deinde ne simpliciores quique, apud quos horum\nmagna est de probitatis contemplatione reverentia, hoc tutissimum sibi aestiment,\nquod audiunt eos quorum auctoritatem sine judicio sequuntur asserere’.\n275\nscottish journal of theology\nis chronologically prior to merit, they nevertheless maintain that merit is\nlogically prior to predestination. They further insist that if it is taught that\nGod’s decree anticipates human will, the result will be that many people\nwill cease to be diligent. They express concern that such a teaching ‘sets\nup a fatal necessity’ and advances the dangerous belief ‘that the Lord has\nmade men of different natures’. They are unswayed by Prosper’s appeals to\nAugustine’s arguments from scripture; they are unswayed by Prosper’s own\nnovel arguments that he has constructed ‘after the example of [Augustine’s]\ntracts’. They are, in a word, obstinate.17\nSome of them actually fall into Pelagian errors, by affirming that\ngrace means creation, that predestination operates on the basis of divinely\nforeknown merit and, in short, that ‘the soul is able to move itself to virtue or\nto vice with equal facility’.18 Prosper describes the measures he has personally\ntaken to counteract these beliefs, but acknowledges that his success has been\nlimited because Augustine’s opponents include men of personal sanctity\nand even some recently consecrated bishops.19 All the same, Prosper baldly\naccuses them of propagating ‘small remainders of the Pelagian heresy’.20\nHis own impotence to stop the spread of these beliefs motivates him to\npetition Augustine to write a tract for the benefit of all parties concerned.21\nAugustine was obliging and sent a double tract in answer to Prosper’s request\n(De praedestinatione sanctorum and De dono perseuerantiae). The tract only succeeded\nin generating further trouble.\nIn Prosper’s second letter, we read that the monastic establishment of\nMarseilles has been divided by the Antipelagian works of Augustine. He\nabstains from identifying the opponents, saying of Hilary merely that he\nis not certain whose side he will ultimately take. He does, however, offer\na detailed account of the opponents’ beliefs and he does not mince words\nin reaching his conclusion about said beliefs – they are heretically Pelagian.\nQuite apart from the obligatory gestures of respect he makes at the mention of\nAugustine’s opponents, Prosper’s trenchant identification of their teaching as\n17 Prosper, Ad Aug. 3 (PL 51.69–70): ‘Removeri itaque omnem industriam, tollique\nvirtutes, si Dei constitutio humanas praeveniat voluntates: et sub hoc praedestinationis\nnomine, fatalem quamdam induci necessitatem; aut diversarum naturarum dici Dominum\nconditorem, si nemo aliud possit esse quam factus est [ . . . ] Et cum contra eos\nscripta beatitudinis tuae validissimis et innumeris testimoniis divinarum Scripturarum\ninstructa proferimus, ac, secundum formam disputationum tuarum, aliquid etiam ipsi quo\nconcludantur astruimus.’\n18 Prosper, Ad Aug. 4 (PL 51.70): ‘parique momento animum se vel ad vitia vel ad virtutes\nmovere’.\n19 Prosper, Ad Aug. 7 (PL 51.72).\n20 Prosper, Ad Aug. 7 (PL 51.72).\n21 Prosper, Ad Aug. 8–9 (PL 51.73–4).\n276\nRehabilitating John Cassian\nPelagian heresy is a clear line in the sand. If ever he made a peaceful overture\nin hopes of reconciliation, it has been lost. All his surviving writings are\nbellicose. In fact, his treatise against Cassian is little short of slanderous. That\nverdict on Prosper’s treatise is based on the five observations about the way\nhe makes his case against Cassian.\nProsper’s case against Cassian\nThe reasons Prosper’s polemic against Cassian is unsatisfactory, and quite\nfrankly often scurrilous, are as follows: (1) he bases his attack on the\npresumption that one must wholly support either Pelagius or Augustine, with\nno serious regard to the fact that the Pelagian controversy was multilateral;\n(2) he shows himself willing to suppress or distort clauses that would tend\nto complicate (if not invalidate) his portrayal of Cassian’s thought as vitiated\nby concessions to Pelagianism; (3) he makes much of a highly dubious\nclaim that Cassian introduces a distinction into mankind between those\nwhose nature is unimpaired by the fall and those whose nature is thus\nimpaired; (4) his assessment of Cassian is seriously compromised by its\nnarrow focus on Conference 13 to the exclusion of Cassian’s previous writings,\nparticularly in regard to Cassian’s long-standing refutation of Pelagianism.\nThe fifth characteristic is distasteful, but not obviously as significant as\nthe others, although it deserves mention as well: Prosper assumes a self-\naggrandising posture with respect to Cassian, veiled by protestations of\npersonal insignificance and acclamations of Cassian’s sanctity and learning. A\ndesultory reading of the modern secondary literature suffices to demonstrate\nhow common that hateful posture has become. The ability to sniff out\ninconsistencies in Cassian’s writings is valued even amongst scholars well\ndisposed towards him, despite that fact that it is rather like a talent for\npointing out the nakedness of one’s father.\nIt is now necessary to substantiate the aforementioned chief defects of the\nContra collatorem. The first is that Prosper bases his attack on the presumption\nthat one must wholly support either Pelagius or Augustine, with no regard\nat all to the fact that the Pelagian controversy was multilateral. In the second\nhalf of this paper, we will see that this claim can only be maintained\nagainst Cassian if one completely ignores his teaching about human will,\nwhich is regularly couched in aggressively Antipelagian terms. But another\npreliminary consideration points up the inaccuracy of Prosper’s view: in his\nmonograph Pelagius: Inquiries and Reappraisals, Robert F. Evans has convincingly\nshown that Pelagius’s earliest squabbles were with Jerome22 – who happily\n22 R. F. Evans, Pelagius: Inquiries and Reappraisals (London: Adam and Charles Black, 1968),\n24–5.\n277\nscottish journal of theology\nreciprocated by attacking Pelagius. And we have already noted that Prosper\nhimself knew perfectly well that at least one pope and one African council\nhad condemned Pelagianism. Whether or not Prosper chalked all this up to\nAugustine, we should not be so foolish as to do so. Clearly, resistance to\nPelagianism was widespread.\nAnd yet Prosper states explicitly that he understands the Pelagian contro-\nversy to be a stark question of choosing between Pelagius and Augustine\nand then accuses Cassian of introducing a hybrid into the discussion,\nwith the result that Cassian is unwelcome by both the orthodox and the\nheretics.23 Prosper soon enough abandons the idea that Cassian’s position is\na tertium quid. As intriguing as it is to suggest that Cassian would be equally\nunwelcome with Catholics or Pelagians, it is more to Prosper’s purpose to\ninsist that Cassian is a crypto-Pelagian. His preferred technique for making\nCassian out to be a crypto-Pelagian is the basis for our second charge against\nProsper.\nSecond, Prosper shows himself willing to suppress or distort clauses that\nwould tend to complicate (if not invalidate) his portrayal of Cassian’s thought\nas vitiated by concessions to Pelagianism. One of the major ways Prosper\ndistorts quotations from Cassian is by inserting into them the technical term\ngrace. By this strategy, he has succeeded in persuading generations that the\ncrucial standard against which Cassian’s relationship to Pelagianism must be\nmeasured is Cassian’s teaching of grace. We will see shortly that this is simply\nfatuous, for Cassian himself offers substantial evidence that the major threat\nposed by the Pelagians is bound up with their view of the human will. But\nfor the moment, it is worth stressing that Prosper cannot justifiably insert\nthe word ‘grace’ into Cassian’s teaching and use that word as the pivot for\nhis criticism of Cassian. A clarion example is found when Prosper berates\nCassian for a supposed inconsistency in his teaching. Prosper cites Conference\n13.3.5: ‘The beginning not only of good works but also of good thoughts\ncomes from God, who starts in us what is good and carries it out and brings\nit to its completion.’ Then he glosses that passage as follows: ‘You were right\n[at 13.3.5] in declaring that our salvation originates in grace, but now [at 13.9.5]\nyou assert that it comes from the gifts of nature and from free will.’24 The\ncomparison is otiose, because Prosper has substituted a highly specific term\nfor Cassian’s far more ambiguous claim. In other cases, Prosper tinkers with\npassages from Cassian by offering an invidious paraphrase of his own that\npurportedly captures Cassian’s meaning.25\n23 Prosper, C coll 3.1 (PL 51.221–2).\n24 Prosper, C coll4.2 (PL 51.224–5).\n25 See Prosper, C coll 5.3, 7.2 (PL 51.226–8, 230–1).\n278\nRehabilitating John Cassian\nProsper’s habit of suppressing Cassian’s words deserves further\nconsideration. It is especially evident in Prosper’s treatment of Conference\n13.9.5. As was just mentioned, Prosper says that in that passage Cassian\n‘asserts that [our salvation] comes from the gifts of nature and from free will’.\nWhat Cassian in fact wrote in that passage is this: ‘In order to see more clearly\nthat at times the beginning of good will arises from the gifts of nature bestowed by the\nliberality of the Creator – a beginning however that cannot reach the perfection\nof virtue without the guidance of God’s grace – we should listen to St Paul,\nwho says, “For to will is present with me, but to accomplish that which is\ngood, I find not” (Rom 7.18).’ Prosper has elided Cassian’s reference to ‘the\nliberality of the Creator’ – and he will do so again.26 Had he not done so,\nhe would have been obliged to offer a detailed argument for thinking that\nCassian simply meant to refer to unaided nature. (‘Unaided’ is yet another\nterm that Prosper delights in supplying to clarify Cassian’s meaning.)27\nIn these instances, the effect of Prosper’s looseness with Cassian’s words\nis quite simply to deepen superficial similarities between Cassian’s teaching\nand Pelagianism. We can be utterly certain that Prosper aimed at assimilating\nCassian to Pelagianism, because in one breathtaking case he actually glosses\na phrase of Cassian’s with two tenets of Pelagianism that had been formally\ncondemned. In reference to Conference 13.12.5, where Cassian warns against\n‘referring all merits of the saints to God in such a manner as to ascribe to\nhuman nature nothing but what is evil and disorderly’, Prosper attributes\nto Cassian the belief that ‘the reason why we must be helped by God for\nsome good works is that grace should make easier what we were already able to do\nby nature’.28 This is a paraphrase of a sentiment that Augustine attributes to\nPelagius and that was condemned by the Council of Carthage.29 It is also a\npiece of sheer bravado. Prosper equates Cassian’s warning against ascribing\n‘to human nature nothing but what is evil and disorderly’ to the Pelagian\ntenets that ‘grace is given in answer to our merits’ and ‘grace is not given to\n26 Cf. Prosper, C coll 5.3 (PL 51.226–8).\n27 See Prosper, C coll 10.3, 11.1, 14.1, 15.1 (PL 51.241–2, 252–3, 255–6).\n28 Prosper, C coll11.2 (PL 51.243).\n29 Pelagius, De lib arbap. Augustine, De grat Chr 29.30 (PL 44.375): ‘Item in eodem\nlibro alio loco: «Ut quod per liberum,» inquit, «homines facere jubentur arbitrium,\nfacilius possint implere per gratiam.» Tolle «facilius,» et non solum plenus, verum\netiam sanus est sensus, si ita dicatur, «Ut quod per liberum homines facere jubentur\narbitrium, possint implere per gratiam.» Cum autem «facilius» additur, adimpletio\nboni operis etiam sine Dei gratia posse fieri, tacita significatione suggeritur. Quem\nsensum redarguit qui dicit, Sine me nihil potestis facere.’ See also Council of Carthage,\ncanon 9 (ed. Denzinger-Bannwart, Enchiridion symbolorum (Freiburg: Herder, 1955),\nn. 105).\n279\nscottish journal of theology\nus for every individual good act’.30 This is tendentious and unwarranted by\nany evidence.\nThe third point leads us to the only theologically clever observation\nProsper makes as he plods through Cassian’s Conference. Prosper makes much\nof a highly dubious claim that Cassian introduces a distinction into mankind\nbetween those whose nature is unimpaired by the fall and those whose\nnature is thus impaired. He introduces this claim in his efforts to wrangle\nwith Conference 13.9.1:\nTherefore, it is not easy for human reason to see in what manner the Lord\ngives to those who ask, is found by those who seek, opens to those who\nknock; and again is found by those who do not seek Him, shows Himself\nopenly to those who did not look for Him; how ‘All the day long He\nspreads His hands to a people who do not believe and who gainsay’; how\nHe calls people who resist and are far from Him, how He draws them to\nsalvation unwilling.\nProsper’s gloss on that last passage is instructive: ‘Many there are who\ncome to grace without the help of grace and who have the desire of asking\nand seeking and knocking because of the alertness of their own free wills;\nyet, the same free wills in other people are said to be so blinded in their\naversion from God that no sermon can call them back unless they are drawn\nand guided by the power of God.’31 Thus, Prosper is attributing to Cassian\nthe belief that, for the former, no intervening measures are required; whereas\nfor the latter, operative grace in the robust Augustinian sense is needed.\nHe further argues that Cassian’s putative scheme of the differentiated\neffects of the fall results in a fragmented ecclesiology. His point of departure is\nCassian’s statement that ‘in our prayers we call the Lord not only our protector\nand saviour, but also our help and refuge’.32 With his wonted insensitivity\nto Cassian’s precise words, Prosper stumbles through Cassian’s writings by\nclaiming that\naccording to this distinction of yours, there will be, you say, a new\ndiscrimination within the One Church: our Lord Jesus Christ (of whom\nHoly Scripture says, ‘And you shall call His name Jesus, for He shall save\nHis people from their sins’, and also, ‘For there is no other name under\n30 Prosper, C coll 11.2 (PL 51.243); see also Augustine, De praed sanct 2.3 (PL 44.961–2)\nand De gest Pel 14.30 (PL 44.338: ‘gratiam Dei et adiutorium non ad singulos actus\ndari’).\n31 Prosper, C coll 2.4 (PL 51.220).\n32 Cassian, conl 13.17.2 (CSEL 13.393): ‘Inde est quod orantes non solum protectorem\nac saluatorem, sed etiam adiutorem ac susceptorem dominum proclamamus.’\n280\nRehabilitating John Cassian\nHeaven given to men whereby we must be saved’) is not the Saviour of all\nChristians but of some only, and of others He is only the refuge.33\nProsper makes his point by substituting a disjunction for Cassian’s\nconjunction. So it is all the more churlish for Prosper to berate Cassian\nby writing, ‘Nor may it be said, according to your novel division of the\nmembers of the Church, that Christ is the saviour of some and the helper of\nothers – He is both saviour and helper of all the faithful all the world over!’34\nProsper then returns to his own theological ruminations by dwelling a bit\non how it is not illegitimate to praise those who have been blessed by God.\nNext he restates his conviction that ‘divine grace helps by strengthening the\nhuman will’. These points would perhaps be relevant for a study of Prosper’s\ntheology for its own sake, but for our purposes what is significant is how\nrelentlessly Prosper misrepresents Cassian.\nThe fourth and final point is that Prosper’s assessment of Cassian is\nseriously compromised by its narrow focus on Conference 13 to the exclusion\nof Cassian’s previous writings, particularly in regard to Cassian’s long-\nstanding refutation of Pelagianism. Although in his summary of Cassian’s\nteaching Prosper refers to ‘what he writes and spreads in published tracts’,35\nand perhaps alludes to Cassian’s writings in warning Rufinus against ‘the\nassertions they [sc., the Antiaugustinians] make in many a conference’, Prosper\ngives no indication whatever that he knew anything other than Conference 13.\nBut this is not surprising. Prosper’s account is in essence reducible to a\nfew propositions, and he would have had to have sacrificed that elegant\nsimplicity if he had been thorough. However, taking on board more of\nCassian’s writings would have carried Prosper beyond well the modest\nknowledge of one’s opponent required for polemic and no doubt would\nhave been good for him. His own heated remarks against the unknown\npublishers of extracts from Augustine’s writings show that he is sensitive\nto the danger of misrepresentation that is inherent in extracting. What is\nsauce for Augustine is surely sauce for Cassian. It can only be regarded as a\nfailure of his principles that Prosper was content to offer decontextualised\ngobbets of Cassian while denouncing Augustine’s opponents for taking his\nwords out of context. And yet it is clear that Prosper’s treatise against\n33 Prosper, C coll 18.2 (PL 51.263–4).\n34 Prosper, C coll 18.3 (PL 51.264–5).\n35 We may wonder about the plural. Does Prosper mean to refer to other writings of\nCassian as well as Conference 13? If so, he opens himself up to a barrage of criticism\nalong the lines advanced in this chapter. Briefly, the distortion of Cassian’s thought\nadvanced here by Prosper contradicts in many particulars the teaching advanced by\nCassian in other parts of his writings.\n281\nscottish journal of theology\nCassian is replete with extracts and offers no attempt at appreciating the\ncontext from which they are taken (one almost wants to write, ‘from which\nthey are ripped’). To borrow a phrase from a perceptive essay by Umberto\nEco, Prosper’s technique deprives Cassian’s writings of ‘the internal textual\ncoherence’ that ‘controls the otherwise uncontrollable drives of the reader’.36\nProsper was completely insensitive to the internal textual coherence of\nConference 13 and to the intertextual coherence of Cassian’s writings as a\nwhole. This is clearly seen from the fact that Prosper glibly accuses Cassian\nof propagating Pelagianism, while Cassian was demonstrably an outspoken\ncritic of Pelagianism. We will take up that point momentarily. Some final\nwords about the Contra collatorem are in order.\nProsper draws his treatise to a close per recapitulationem sententiae, offering\ntwelve propositions excerpted from Conference 13. He is unreserved in his\nscathing introduction: they are ‘dirty rivers [flowing] into a filthy gorge,\nwhich exhale an unwholesome fog’.37 He then writes three more chapters\nto draw his polemic to a conclusion. The first contains a synthetic overview of\nCassian’s purported teaching. It is a seamless, interpretive account, and owing\nto its brevity it is suitable for full quotation here.38 Here is Contra collatorem 20;\nfor ease in evaluation, I supply inverted commas for direct quotations and\nitalicise Prosper’s interpolations:\nThis, then, is what our author teaches in these propositions, this is what he\nwrites and spreads in published tracts:39 when Adam sinned, his soul suffered\nno harm, and his free will by which he sinned remained unimpaired. The knowledge\nof what is good which he had been given he did not lose, nor could his\ndescendants lose what he himself had not lost. ‘Every soul possesses by\nits nature the seeds of the virtues planted there by a favour of the Creator.’\nWith them any man is able, if he wishes, to anticipate the grace of God by\nthe right use of his natural reason40 and so to merit His help in order more\neasily to attain perfection. For one who has only the gifts he was given,\n36 U. Eco et al., Interpretation and Overinterpretation (Cambridge: Cambridge University Press,\n1992), 65.\n37 Prosper, C coll 19.1 (PL 51.266): ‘ad quae praecipitia pervematur his callibus, et in\nistam lutulentorum rivorum coenosam uliginem, cujus voraginis humor exsudet’.\n38 It should be noted that Prosper directly quotes two passages of Cassian, here without\nalteration, that he has regularly distorted elsewhere. This shows that he was certainly\ncapable of making his case without recourse to manipulating the evidence, and\ntherefore strengthens the supposition that he manipulated the evidence deliberately to\nfurther his case.\n39 Again we may wonder about the plural.\n40 This clause clarifies Prosper’s critique. It does not correspond to anything I have been\nable to find in Cassian, relying as it does on a tacit opposition between God and nature.\n282\nRehabilitating John Cassian\nand none of his own, is undeserving of any praise or merit. ‘We must also\nbeware lest we refer all the merits of the saints to God in such a manner\nas to seem to say that human nature cannot of itself do any good.’ Its\nnatural powers are so uninjured and healthy that it is able, without the help of God, to fight\nagainst the devil and to endure his every cruelty and even the most extreme torments.41 All\nmen possess this by nature, but not all are willing to make use of their\ncongenital virtues.42 But the goodness of the Creator towards all men is\nso great that He welcomes with praise those who come to Him of their\nown accord and draws others against their will when they resist; thus He\nis the helper of those who are willing and the Saviour of those who are\nunwilling. And since in the Church one section of the faithful are made just by grace,\nanother by their own free will, those whom nature thus raises have more glory than they\nhave whom grace liberated.43 Free will in the descendants of Adam is able to do\nevery good work as it was in Adam before he sinned.\nLet us note that every passage of Cassian’s that suggested to Prosper a\nhint of Pelagianism was taken as firm evidence for Cassian’s heterodoxy. In\nnumerous instances, Prosper shamelessly reworded excerpts from Cassian to\nmake minimal resemblances into sturdy parallels. This is the foundation upon\nwhich he has built his interpretation of Cassian. It is a very doubtful way of\nproceeding. But his interpretation has provided the cues and categories that\nhave been used to interpret Cassian ever since. One index of the influence\nProsper has had is the fact that people still express doubts about whether\nCassian’s rebuttals of Pelagius were made in good faith.44 But a fair reading of\nthose rebuttals serves to corroborate this paper’s specific finding that Prosper\nis an untrustworthy guide to Cassian’s thought and its general conclusion\nLike much of C coll, this claim is more valuable as a statement of Prosper’s perception\n(or misperception!) of Cassian than as a presentation of Cassian.\n41 This is a provocative overstatement of Cassian’s position, since Cassian specified\nthat God disbarred Satan from depriving Job of his reason and sense. The obvious\nimplication is that Satan, if he wanted, could have done so. It is therefore completely\ninaccurate to attribute to Cassian the belief that people are naturally able ‘to endure\nSatan’s every cruelty’.\n42 Once more, Prosper blurs Cassian’s language. The relevant phrase used by Cassian –\nand correctly cited by Prosper above – is not ‘congenital virtue’ but ‘the seeds of the\nvirtues’.\n43 The introduction of ecclesiology into Conference 13 is a device entirely of Prosper’s own\nmaking. While it is legitimate to wonder, or even to conjecture, what role the church\nplays in Cassian’s thought, there is no reason at all to endorse Prosper’s hypothesis –\nparticularly since it is aimed at damaging Cassian’s prestige rather than clarifying\nCassian’s beliefs.\n44 Stewart, Cassian the Monk (1998), pp. 22–3.\n283\nscottish journal of theology\nthat Prosper’s wilful distortion of evidence in furtherance of his bias should\nmake us think twice before accepting his version of contemporary events.\nIt is important to be clear on the reasons why Prosper’s depiction of Cassian\ninspires no confidence. Prosper repeatedly takes liberties with Conference 13\nin order to make it say precisely what he insists it should not say. In doing\nso, Prosper shows himself to be a maladroit critic and his interpretation\nto be fundamentally objectionable. The depiction of Conference 13 offered in\nContra collatorem is a tissue of fabrications, misrepresentations, insertions and\nomissions. We have therefore found Prosper’s account of Cassian to be deeply\nand systematically flawed. It is unreliable with respect to its historical value,\nmisapplied in its episodes of theological insight and tendentious to the point\nof misrepresentation with respect to its interpretive value. A thorough re-\nevaluation of John Cassian that is not indebted to Prosper or his categories,\neither in part or in whole, is much needed.\n284\n"}