{"doi":"10.1063\/1.1617980","coreId":"66061","oai":"oai:dro.dur.ac.uk.OAI2:3395","identifiers":["oai:dro.dur.ac.uk.OAI2:3395","10.1063\/1.1617980"],"title":"Predictions of molecular chirality and helical twisting powers : a theoretical study.","authors":["Earl, D. J.","Wilson, M. R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-11-01","abstract":"A theoretical study of a number of chiral molecules has been undertaken using a molecular Monte Carlo simulation approach coupled with calculations of molecular chirality based on a chirality order parameter. Results for a variety of TADDOL (alpha,alpha,alpha',alpha'-tetraaryl-1,3-dioxolan-4,5-dimethanol) derivatives show good agreement with experimental findings for the sign, magnitude, and the temperature dependence of the helical twisting power (HTP). For a photochromic chiral dopant with variable HTP we are able to model the reduction in the HTP when photoisomerization occurs. Our studies on a liquid crystalline material with a single chiral center have reproduced a temperature dependent twist inversion in the material. We discuss the temperature and solvent dependence of the helical twisting power and argue that in all the systems studied here, preferential selection of certain molecular conformations at different temperatures and in different solvents are able to explain the observed experimental behavior of the HTP","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66061.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3395\/1\/3395.pdf","pdfHashValue":"ca9f1d339228179c8ebfbd2e60aa718533ce8b88","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3395<\/identifier><datestamp>\n      2011-04-26T15:28:49Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Predictions of molecular chirality and helical twisting powers : a theoretical study.<\/dc:title><dc:creator>\n        Earl, D. J.<\/dc:creator><dc:creator>\n        Wilson, M. R.<\/dc:creator><dc:description>\n        A theoretical study of a number of chiral molecules has been undertaken using a molecular Monte Carlo simulation approach coupled with calculations of molecular chirality based on a chirality order parameter. Results for a variety of TADDOL (alpha,alpha,alpha',alpha'-tetraaryl-1,3-dioxolan-4,5-dimethanol) derivatives show good agreement with experimental findings for the sign, magnitude, and the temperature dependence of the helical twisting power (HTP). For a photochromic chiral dopant with variable HTP we are able to model the reduction in the HTP when photoisomerization occurs. Our studies on a liquid crystalline material with a single chiral center have reproduced a temperature dependent twist inversion in the material. We discuss the temperature and solvent dependence of the helical twisting power and argue that in all the systems studied here, preferential selection of certain molecular conformations at different temperatures and in different solvents are able to explain the observed experimental behavior of the HTP. <\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of chemical physics, 2003, Vol.119(19), pp.10280-10288 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3395<\/dc:identifier><dc:identifier>\n        issn:0021-9606<\/dc:identifier><dc:identifier>\n        issn: 1089-7690<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.1617980<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3395\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.1617980<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3395\/1\/3395.pdf<\/dc:identifier><dc:rights>\n        Copyright (2003) American Institute of Physics. \\ud\nThis article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. \\ud\n\\ud\nEarl, D. J. and Wilson, M. R. (2003) 'Predictions of molecular chirality and helical twisting powers : a theoretical study.', Journal of chemical physics., 119 (19). pp. 10280-10288.\\ud\n\\ud\nand may be found at http:\/\/dx.doi.org\/10.1063\/1.1617980\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-9606"," 1089-7690","issn:0021-9606","issn: 1089-7690"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 April 2011\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nEarl, D. J. and Wilson, M. R. (2003) ’Predictions of molecular chirality and helical twisting powers : a\ntheoretical study.’, Journal of chemical physics., 119 (19). pp. 10280-10288.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.1617980\nPublisher’s copyright statement:\nCopyright (2003) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. Earl, D. J. and Wilson, M. R. (2003)\n’Predictions of molecular chirality and helical twisting powers : a theoretical study.’, Journal of chemical physics., 119\n(19). pp. 10280-10288. and may be found at http:\/\/dx.doi.org\/10.1063\/1.1617980\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nPredictions of molecular chirality and helical twisting powers:\nA theoretical study\nDavid J. Earl and Mark R. Wilsona)\nDepartment of Chemistry, University of Durham, South Road, Durham, DH1 3LE, United Kingdom\n~Received 12 June 2003; accepted 19 August 2003!\nA theoretical study of a number of chiral molecules has been undertaken using a molecular Monte\nCarlo simulation approach coupled with calculations of molecular chirality based on a chirality\norder parameter. Results for a variety of TADDOL (a ,a ,a8,a8-tetraaryl-1,3-dioxolan-4,5-\ndimethanol! derivatives show good agreement with experimental findings for the sign, magnitude,\nand the temperature dependence of the helical twisting power ~HTP!. For a photochromic chiral\ndopant with variable HTP we are able to model the reduction in the HTP when photoisomerization\noccurs. Our studies on a liquid crystalline material with a single chiral center have reproduced a\ntemperature dependent twist inversion in the material. We discuss the temperature and solvent\ndependence of the helical twisting power and argue that in all the systems studied here, preferential\nselection of certain molecular conformations at different temperatures and in different solvents are\nable to explain the observed experimental behavior of the HTP. © 2003 American Institute of\nPhysics. @DOI: 10.1063\/1.1617980#\nI. INTRODUCTION\nWhen chiral molecules are added to an achiral liquid\ncrystal mesophase, they can transmit their chirality to the\nwhole system over distances many times their molecular\nlength, giving the liquid crystal a right-handed or left-handed\n~depending on the enantiomer added! helical twist. More-\nover, different chiral molecules can induce different levels of\ntwist. The helical twisting power ~HTP!, bM , of a chiral\ndopant is defined as\nbM5~Pcwr !21, ~1!\nwhere P is the helical pitch of the resultant phase (P\n52p\/k), cw is the weight concentration of chiral dopant and\nr is the enantiomeric purity of the dopant. Chiral molecules\nwith very high HTPs (.100 mm21) are of great industrial\nimportance. They can be used in liquid crystal displays and\nin chiral polymer films to improve viewing angles in display\napplications.1–3 In each case it is essential that a high degree\nof twist is imparted from just a small amount of chiral dop-\nant, so as not to perturb other material properties, and, in\nsome cases, because the dopant is sparingly soluble in the\nliquid crystal host. The production of new chiral dopant mol-\necules can be a long and costly process, and the HTP of the\nmolecule is unknown until it can be determined by experi-\nment after it has been synthesized and purified. Clearly the-\noretical tools for predicting HTPs would be useful in deter-\nmining future synthetic target molecules, and would greatly\naid in the understanding of how chirality is transferred from\nthe molecular level to the mesoscopic level.\nA chiral molecule is defined as having no mirror sym-\nmetry, i.e., the mirror image of the molecule is nonsuperim-\nposable upon the original. An actual quantitative measure of\nthe magnitude of chirality for a given molecular conforma-\ntion and a link to pseudoscalar properties such as the HTP or\ncircular dichroism, has been more difficult to obtain. How-\never, recent success has been found through calculations of\nthe difference in chemical potential for enantiomers in a\ntwisted nematic host,4,5 in calculations of a scaled chiral\nindex,6,7 using a mean field approximation that takes into\naccount chiral dispersive interactions8 and with the chirality\norder parameter approach of Nordio, Ferrarini, and\nco-workers.9–16 In order to determine a relationship between\nthe molecular shape and a pseudoscalar property such as the\nHTP, these studies have, by necessity, been limited to rela-\ntively rigid chiral dopants where the molecular conformation\nis unlikely to vary significantly from the minimum energy\nstructure that can be found from x-ray diffraction experiment\nand by theoretical techniques such as molecular mechanics\nand density functional theory. However, many important\nchiral dopants have a much higher degree of molecular\nflexibility.\nIn this paper we have combined the chirality order pa-\nrameter approach of Nordio et al.9–16 with Monte Carlo\nsimulations to study a range of systems. The simulation ap-\nproach used is described in Sec. II, and results are presented\nin Secs. III and IV for a series of binaphthol and helicene\nchiral dopant compounds, TADDOL derivatives, a chiral\nphotochromic dopant with variable HTP, a liquid crystalline\nmaterial that undergoes a temperature induced twist inver-\nsion in the cholesteric phase, and a series of achiral banana\nmolecules that have been found to act as chiral dopants when\nadded to a cholesteric liquid crystal. Finally, in Sec. V we\ndraw some conclusions as to the strengths and weaknesses of\nthe method, and discuss possible extensions to the work pre-\nsented here.\na!Author to whom correspondence should be addressed.\nTel: 144 191 334 2144; Fax: 144 191 386 1127;\nelectronic mail: mark.wilson@durham.ac.uk\nJOURNAL OF CHEMICAL PHYSICS VOLUME 119, NUMBER 19 15 NOVEMBER 2003\n102800021-9606\/2003\/119(19)\/10280\/9\/$20.00 © 2003 American Institute of Physics\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nII. COMPUTATIONAL METHOD\nIn the surface chirality model developed by Nordio, Fer-\nrarini, and co-workers9–16 the helical twisting power, bM , at\na temperature T , is obtained from\nbM5\nRT«x\n2pK22nm\n, ~2!\nwhere «, nm , and K22 are, respectively, the strength of the\norienting potential, the molar volume of the nematic solu-\ntion, and the twist elastic constant of the solvent. The quan-\ntity x is defined as the chirality order parameter and de-\nscribes the coupling between the chiral surface of the\nmolecule and its orientational ordering. Positive values of x\nlead to a right-handed twisted nematic being induced in the\nliquid crystal host. The theory is based upon the assumption\nthat the alignment of a solute molecule in a locally nematic\nenvironment can be determined purely from the molecular\nshape of the solute, and that the chiral shape of a molecule is\nable to exert a torque on the local nematic director over\ndistances many times its molecular length due to the elastic\nproperties of the nematic phase.\nx can be obtained for any molecule from a calculation of\n3 tensors, the surface tensor, T, the helicity tensor, Q, and the\nordering matrix, S. The theory has been described in detail\nelsewhere10,15,16 so we include only a brief summary of the\ntechnique as applied to the molecules studied here. We define\ninitially a molecular surface using the Simple Invariant Mo-\nlecular Surface ~SIMS! method of Vorobjev and Hermans,17\nwhich generates a surface from a rolling sphere algorithm.\nHere we employ a point density of 10 Å22 and a probe ra-\ndius of 2.5 Å for the rolling sphere. In tests, the latter was\nfound to give the best agreement with calculated values of\nbM for a series of rigid molecules with known HTPs ~see\nSec. III!. Numerical integration over surface points ~typically\n.2000 points per molecule! yielded the surface tensor\nTi j5\n23*Ssis jdS1Sd i j\nA6\n, ~3!\nwhere d i j is the Kronecker delta and s is a unit vector along\nthe outer normal of the molecular surface element dS . Di-\nagonalization of T yielded the components (Txx , Tyy , Tzz)\nthat define the tendency of the molecular principal axes to\nalign parallel (Tzz) and perpendicular (Txx , Tyy) to the nem-\natic director. Numerical integration over the molecular sur-\nface also yields the helicity tensor\nQi j52S 38 D\n1\/2\n(\nk ,l\nE\nS\n@rksl~« ikls j1« jkls i!#dS , ~4!\nwhere « i jk is the Levi–Civita symbol and r is a vector from\nthe origin of the molecular axis to a surface element dS . The\nhelicity center, rH, was calculated from Q ~see Ref. 10!, and\nthe helicity tensor recalculated using rH as the origin in Eq.\n~4!. Finally, Q was obtained in the principal axis system of\nthe T tensor and the diagonal components (Qxx , Qyy , Qzz)\nwere used in the calculation of x.\nThe orientational behavior of the solute molecule within\nthe liquid crystal phase was calculated by defining an orient-\ning potential\nU~V!\nkBT\n5«E\nS\nP2~n\"s!dS , ~5!\nwhere U(V) is the orienting potential at the molecular ori-\nentation V, P2 is the second Legendre polynomial, and n is\nthe nematic director ~taken along the Z-axis!. Equation ~5! is\nanalogous to the surface anchoring potential which has been\nused to determine the orientations of liquid crystal molecules\nin bulk nematics.18–21 The Cartesian components of the or-\ndering matrix S can be obtained by calculating\nSi j5E ~3lZilZ j2d i j!2 P~V!dV , ~6!\nwhere lZi is the cosine of the angle between the Z laboratory\naxis and the i molecular axis and P(V) is the orientational\ndistribution function defined by\nP~V!5\nexp@2U~V!\/kBT#\n* exp@2U~V!\/kBT#dV\n. ~7!\nTo evaluate P(V) @Eq. ~7!#, and hence S, we performed a\ndouble integration over the b and g Euler angles using 1000\npoints for each angle.22 Finally, the chirality order parameter\nwas obtained as\nx52S 23 D\n1\/2\n~QxxSxx1QyySyy1QzzSzz!, ~8!\nwhere the components Sii are obtained by expressing S in the\nprincipal axis system of the surface tensor T.\nEquations ~2!–~8! are given for a single conformation.\nHowever, Eq. ~2! is equally valid for an average x obtained\nfrom a statistically significant and independent number of\nconformations of a molecule. To take into account the con-\nformational dependence of x we used an internal coordinate\nMonte Carlo ~MC! technique, where molecules were repre-\nsented by a Z-matrix. We used an augmented form of the\nMM2 ~Ref. 23! force field, taken from an initial energy mini-\nmization using the CACHE program.24 Full details of our MC\ntechnique are described in Ref. 25. Sampling of x was car-\nried out at intervals of 200 MC steps with a new molecular\nsurface generated for each sample. For each molecule and\neach temperature studied, runs in excess of 23106 MC steps\nwere carried out. Checks for convergence of the mean steric\nenergy, x values, and of dihedral angle distributions were\ncarried out in each case. In most cases convergence of aver-\nages occurred within 53105 MC steps.\nIII. RIGID CHIRAL MOLECULES\nTo verify that x from Sec. II was applicable to complex\nchiral molecules, we studied a series of rigid molecules:\nbridged biaryl26 and helicene derivatives12,27 ~Fig. 1!. These\nare molecules where one particular molecular conformation\ndominates and their experimental helical twisting powers\nshow little temperature dependence. For these reasons, they\nare an excellent choice to test the theoretical methods used\nhere and will provide a good comparison with experimental\nresults.\n10281J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 Predictions of molecular chirality and helical twisting powers\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nFor each of the molecules in Fig. 1, the optimized ge-\nometry was determined using an augmented MM3\nforce-field.28 The chirality order parameter was then calcu-\nlated for each of these molecular structures using the method\ndescribed in Sec. II and the results are shown in Table I.\nTo calculate predicted values of bM in Fig. 2 a scaling\nfactor was used. In our model T , «, and K22 are unchanged\nfor all dopants and at low dopant concentrations nm tends\ntowards the molar volume of the solvent, so we determine a\npredicted bM as\nbM5Dx , ~9!\nwhere D is a constant found from a best fit to the experimen-\ntal data.26,27 Here we use a value of D52.351 Å23 mm21.\nThe results in Fig. 2 show good agreement with experi-\nmental findings. The sign of bM is correctly predicted in\neach case, and the magnitude of bM is predicted with an\naverage error of 622 mm21. Coupled with the rapid calcu-\nlation time for x this makes the chirality order parameter a\nuseful tool for the study of more complex flexible molecules,\nwhere a large number of molecular conformations are likely\nto contribute to the overall HTP observed in experiments.\nFerrarini et al.12 have also studied helicene molecules M1\n→M4. Our results differ slightly from those in the previous\nwork due to the size of the probe radius used to generate the\nmolecular surface. We note that when we consider the mol-\necules as an assembly of van der Waals spheres ~probe radius\nof 0 Å! we obtain results that are very similar to those in the\nFerraini et al. study.\nFIG. 1. Structures of the bridged biaryl ~1–8! and helicene derivatives\n~M1–M4! studied.\nTABLE I. Diagonal components of the helicity tensor Q, and the ordering matrix S, chirality order parameter\nx, and the experimental helical twisting powers bM , taken from Refs. 26, 27 for the bridged biaryl and helicene\nmolecules in Fig. 1. Values of x from Ref. 12 using a probe radius of 0 Å are included in brackets for\ncomparison for molecules M1–M4.\nMolecule Qxx Qyy Qzz Sxx Syy Szz x\/Å3 bM \/mm21\n1 2103 79 24 0.05 20.37 0.31 121.9 169\n2 90 267 223 0.06 20.38 0.31 219.2 265\n3 24 285 62 0.03 20.33 0.31 239.1 271\n4 125 2101 25 20.02 20.32 0.35 217.1 255\n5 92 263 229 0.12 20.38 0.26 222.4 221\n6 2116 92 25 0.02 20.35 0.33 121.6 185\n7 2137 93 45 0.06 20.31 0.26 121.0 180\n8 2124 67 57 0.14 20.33 0.19 123.4 179\nM1 69 268 21 0.04 20.39 0.36 223.6 (236) 255\nM2 61 244 217 20.04 20.37 0.40 25.8 (212) 29\nM3 37 255 18 0.05 20.39 0.34 223.8 (243) 220\nM4 41 250 9 20.01 20.39 0.40 218.2 (225) 213\nFIG. 2. The predicted HTP for the bridged biaryl and helicene derivative\nmolecules use the chirality order parameter ~squares!, x @as defined in Eq.\n~8!#, and the scaled chiral index ~triangles!, 2G0S @as defined in Eq. ~10!#,\ncompared to the experimental HTP.\n10282 J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 D. J. Earl and M. R. Wilson\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nAs a comparison in Fig. 2 we show also predicted values\nof bM determined using the scaled chiral index6,7,29 that is\ncalculated from\nG0S5\n1\n3\n4!\nN4 F (i , j ,k ,l51\nN\nv iv jvkv l\n3\n@~ri j3rkl!\u0095ril#~ri j\u0095rjk!~rjk\u0095rkl!\n~ri jr jkrkl!\nnril\nm G , ~10!\nwhere the sum includes the contribution of all permutations\nof four points ~atoms!, ri is the position of atom i , ri j5ri\n2rj , N is the number of atoms and the weighting factors\nv i , j ,k ,l can be a physical quantity associated with the point\/\natom. We will consider the case where n52 and m51, cor-\nresponding to a dimensionless index and we set v i , j ,k ,l51,\nalthough alternatively it could be set to any representative\nphysical quantity to give extra weight to certain points. In\nFig. 2 we determine a predicted bM for G0S as\nbM52JG0S , ~11!\nwhere J is a constant found from a best fit to experimental\ndata. Here we use a value of J50.523 mm21. As reported\nrecently,30 we find a similar level of agreement between the\nG0S and x methods ~average error for G0S617 mm21).\nHowever, the chirality order parameter is an order of magni-\ntude less expensive to calculate for the systems studied and\nincreases with the approximate square of the number of at-\noms, N , as opposed to N4 for G0S . The former is therefore\nbetter suited for the thousands of individual calculations re-\nquired in a full Monte Carlo study of a flexible molecule.\nIV. FLEXIBLE CHIRAL MOLECULES\nA. TADDOL derivatives\nThe TADDOL family of molecules are based on the\nstructural core shown in Fig. 3~a!. TADDOL derivatives have\na wide variety of HTPs ranging from around 20 mm21 to an\nextraordinarily large 300 mm21 and are relatively soluble in\npolar solvents making them good candidates for use as chiral\ndopants.31 They exhibit a high degree of flexibility around\ntorsional angles f128 @shown in Fig. 3~a!# giving them con-\nsiderable conformational freedom. Three TADDOL deriva-\ntives were studied with widely different HTPs @Fig. 3~b!#.\nThe simulations were carried out at three temperatures be-\ntween 300 K and 350 K for each of the molecules using the\nMC approach described in Sec. II. In addition we carried out\nan initial test calculation of an achiral molecule, hexane,\nwhich yielded ^x&5(20.0001760.00619) Å3.\nFollowing Ferrarini et al.32 we approximate the ordering\nstrength parameter, «, to vary as 1\/kBT and we set «\n50.05 Å22 at T5300 K. Results are presented in Fig. 4\nwith the simulation value of bM determined as in Sec. III\nusing D52.351 Å23 mm21. For comparison we also\npresent results for the case where «50.05 Å22 at all tem-\nperatures. The magnitude of the HTP in Fig. 4 is predicted to\na good accuracy and the trend of decreasing HTP with in-\ncreasing temperature is also observed, although the effect is\nnot as pronounced in the simulation. For TADDOLs A and B,\nthe drop in HTP can partly be attributed to the decrease in «\nwith temperature, but another effect comes from conforma-\ntional changes ~see below!.\nIt is important to realize that the technique we use\nsamples molecular conformations in the gas phase, and not\nin the liquid crystal phase where solute–solvent interactions\nare likely to influence the relative weight of different\nconformations.33,34 However, we can use the model to deter-\nmine what conformations give rise to particularly high\nchirality order parameters ~and hence HTPs! and also exam-\nine how a change in temperature influences the selection of\nthese conformations. Figure 5~a! shows how the chirality or-\nder parameter varies with the dihedral angle f8 for structure\nB at 350 K. ~Noting that the behavior of f8 is identical to\nthat of f4 .) For f8 ~and f4) the chirality order parameter\nvaries as a cosine wave with a period of p. We observe\nFIG. 3. ~a! Basic TADDOL structure showing the flexibility around dihedral\nangles f1→f8 . ~b! TADDOL derivatives A, B, C, where the structures\nshown are the Aryl substituents in ~a!.\n10283J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 Predictions of molecular chirality and helical twisting powers\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nconformations with high chirality at ;0° ~a conformations,\n315°→45°) and ;180° ~g conformations, 135°→225°) and\nlow chirality at ;90° ~b conformations, 45°→135°) and\n;270° ~d conformations, 225°→315°). If conformations a\nand g are preferentially selected at lower temperatures com-\npared to b and d, then this would explain the temperature\ndependence observed in the simulation and potentially in the\nexperimental system. Table II shows the relative populations\nof a, b, g, and d conformations for structure B between 300\nK and 350 K. Table II clearly shows a trend of decreasing\npopulations of high chirality conformations and increasing\npopulations of low chirality conformations as the tempera-\nture decreases. As the temperature increases eventually all\nconformations will become equivalent. However, it is of in-\nterest that high chirality conformations in these TADDOL\nderivatives dominate in the temperature regime of typical\nnematic liquid crystalline materials.\nDihedral angles f1 and f5 are also of interest. The\nvariation of the chirality order parameter with rotation about\nf5 for structure B at 350 K can be seen in Fig. 5~b!. For\nconformations with f5 and f1’180° intramolecular hydro-\ngen bonding will occur. For other conformations (;60° and\n;300°) intramolecular hydrogen bonding is not possible.\nFigure 5~b! demonstrates that structures with intramolecular\nhydrogen bonding generally have greater values of x than\nnonhydrogen bonding conformations. For the nonhydrogen\nbonding conformations of structure B, ^x&’6 Å3, whereas\nfor hydrogen bonding conformations ^x&’55 Å3. In our\nsimulations we also see a trend of increasing nonhydrogen\nbonding conformations as the temperature increases. For ex-\nample, for structure B at 300 K 95.9% of structures are in-\ntramolecular hydrogen bonding conformations, compared to\n93.4% at 325 K and 90.4% at 350 K. In experimental sys-\ntems the preference of selection of hydrogen bonding con-\nformations in different solvents ~for example, the preferential\nselection of these conformations in organic nonpolar sol-\nvents! is expected to have a large impact on the observed\nHTPs of these systems.\nIn the experimental system it is likely that the decrease\nin molecular order of the solvent with temperature will also\nlead to a decrease in «, as « is predicted to be proportional to\nthe order parameter.32 Together with the solvent effect on\nconformation, this is likely to contribute most to the differ-\nence between experimental and predicted values.\nB. Chiral photochromic molecule with variable helical\ntwisting power\nIn a recent experimental paper by Bobrovsky et al.35 de-\ntailed work was conducted on a photosensitive chiral dopant\n~Fig. 6!. The synthesized dopant molecule was found to have\nan experimental HTP of bM’45 mm21. However, upon ex-\nposure to ultraviolet ~UV! light the HTP of the dopant was\nfound to decrease significantly. Here photoisomerization will\noccur around a CvC bond forming the Z–E isomer, which\ncan further photoisomerize around the other CvC bond to\ngive the Z–Z isomer ~see Fig. 6!. The experimental paper\nFIG. 4. Predicted HTPs from simulation results with a constant ordering\nstrength ~1! ~circles! and with an ordering strength with a 1\/kBT dependence\n~2! ~triangles! as a function of temperature compared to experimental find-\nings ~squares! from Ref. 31 for TADDOL derivatives A ~solid line!, B\n~dashed line!, and C ~dotted line!.\nFIG. 5. Variation of chirality order parameter for structure B at 350 K with\n~a! dihedral angle f8 and ~b! dihedral angle f5 .\nTABLE II. Relative populations of low and high chirality conformations for\nstructure B.\nT\/K\nf8 dihedral angle population\/%\na b g d a1g b1d\n300 43.5 4.5 44.8 7.2 88.2 11.8\n325 34.5 9.0 45.6 10.9 80.1 19.9\n350 33.8 10.9 43.5 11.8 77.3 22.7\n10284 J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 D. J. Earl and M. R. Wilson\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ndoes not quote the percentages of each isomer present, but an\naccurate theoretical study should be able to predict a drop in\nthe HTP as the E–E isomer is photoisomerized.\nGas phase, flexible molecular Monte Carlo simulations\nwere performed on the E–E, the Z–E, and the Z–Z isomers\nat 400 K. The relatively high temperature ensures excellent\nconformational sampling, and we note that the calculated\nvalue of ^x& does not vary significantly with temperature for\nthese structures. An orienting strength parameter «\n50.05 Å22 was used to determine the expected HTPs of\neach of these structures using 10 000 conformations from the\nsimulations to calculate an average chirality order parameter,\nx, for each of the structures. For the E–E isomer ^x&\n549.761.6 Å3. Upon photoisomerization the chirality\ndrops significantly; for the Z–E photoisomer ^x&58.0\n60.9 Å3, and for the Z–Z photisomer ^x&513.860.9 Å3.\nThe results demonstrate that the E–E isomer is theoretically\npredicted to have a much higher chirality order parameter,\nand hence HTP, than the Z–E and the Z–Z isomers and\ntherefore explains the drop in HTP upon exposure to UV\nlight.\nC. Temperature dependent twist inversion molecule\nIn 1992, Goodby et al.36 published experimental findings\non the liquid crystalline material S-2-chloropropyl 48-\n(49-n-nonyloxyphenylpropioloyloxy!biphenyl-4-carboxylate\nwhich contains a single chiral center and whose structure is\nshown in Fig. 7. Their results were surprising and demon-\nstrated that the material underwent an inversion of the helical\ntwist sense in the chiral nematic phase from a left-handed\ntwist at lower temperatures to a right-handed twist at higher\ntemperatures. They suggested that the helix inverts due to\nchanges in the populations of conformational isomers at dif-\nferent temperatures. However, they were unable to determine\nthe twist senses of individual conformations to confirm their\ntheory for the origin of the twist mechanism.37 Here we ap-\nply our Monte Carlo technique to the material and attempt to\nrecreate the temperature dependence of the twist-sense and to\nexplain why it occurs.\nAn initial investigation into the O–C–C–Cl dihedral\nangle, around the chiral center of the molecule, was required\nas it is known that the MM2 force field does not model\ndihedral angles of this type correctly. The dihedral angle en-\nergy was calculated using density functional theory ~DFT! at\nthe B3LYP\/6-31G* level for the fragment molecule shown\nin Fig. 7 and the results are depicted in Fig. 8. The torsional\nangle was studied at intervals of 15° and geometry optimi-\nzation was carried out at all points. A further geometry opti-\nmization was conducted in each of the three potential wells\nto ensure the energies of the minima were calculated cor-\nrectly. The conformation with the Cl atom trans to the core\nof the molecule (T) was found to be the most stable, fol-\nFIG. 6. Photoisomerization of an isosorbide chiral dopant when exposed to UV light. ~Top! Structures of isomers. ~Bottom! Snapshots from simulation.\nFIG. 7. Structure of S-2-chloropropyl 48-(49-n-nonyloxyphenyl-\npropioloyloxy!biphenyl-4-carboxylate showing the single chiral center of\nthe molecule. The boxed structure indicates the fragment molecule used in\nthe ab initio calculations of Sec. IV C ~a single hydrogen atom was added to\nthe phenyl ring of this structure to complete valence!.\nFIG. 8. Calculated torsional energies for the O–C–C–Cl dihedral angle\nfrom DFT calculations.\n10285J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 Predictions of molecular chirality and helical twisting powers\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nlowed by the Me group trans to the core (G2), with the H\natom trans to the core (G1) being the minimum with the\nhighest energy conformations and thus the least favored of\nthe three potential minima. Our calculations differ signifi-\ncantly from those of Goodby et al.37 who found that the H\ntrans conformation was more stable than the Me trans con-\nformation. However, the latter was carried out using the\ncruder force field representation within the program\nCHARMM.38,39\nUsing the DFT data the MM2 force field was augmented\nto reproduce the dihedral angle energy for the O–C–C–Cl\ndihedral. To do this we followed the dihedral fitting proce-\ndure of Cheung et al.,40 to fit to the torsional terms in the\nforce field. Gas phase, flexible molecular Monte Carlo simu-\nlations were then carried out on the molecule at a number of\ntemperatures, and the average chirality order parameter was\ncalculated, along with its standard error, from 10 000 confor-\nmations from the simulation. In these simulations we kept\nthe orienting strength, «, constant and set its value to\n0.05 Å22 so that changes in the chirality order parameter\nwith temperature could be studied purely as a function of\nchanges in conformational sampling. The results are pre-\nsented in Fig. 9, and show a twist inversion for the choles-\nteric liquid crystalline material. The simulations predict the\ntwist inversion to occur at ;530 K, whereas in the experi-\nmental system the twist inversion occurs at ;414 K. The\nlikely discrepancy here is caused by ignoring the influence of\nchanges in the liquid crystalline environment on conforma-\ntions and on «. Despite this, prediction of a sign change in x\nis impressive and suggests that the twist inversion can be\nexplained by conformational changes.\nWe now turn our attention to the origin of chirality in\nthis molecule and attempt to explain why the twist inversion\noccurs. A statistical analysis of data for the O–C–C–Cl di-\nhedral at selected temperature points is shown in Table III.\nThe relative populations of the trans, and two gauche states\nabout the O–C–C–Cl dihedral angle are presented along\nwith the average chirality order parameter, x, for each of the\nthree main states.\nFrom these data it is possible to determine the origin of\nthe twist inversion. At low temperatures, conformations with\nthe O–C–C–Cl dihedral angle in the T position tend to\ndominate. As these conformations have a net negative chiral-\nity associated with them then the overall twist sense of the\nsystem is negative. At higher temperatures the population of\nthe T position decreases and those of the G2 and G1 po-\nsitions increase, as expected from the DFT results. The net\nchirality of the G2 position conformations is strongly posi-\ntive and of greater magnitude than the negative contributions\nto chirality of the T and G1 conformations. Thus, as the\ntemperature increases, the negative contribution to chirality\nfrom the T conformations decreases, the negative contribu-\ntion from the G1 conformations increases slightly and the\npositive contributions from the G2 conformations increases\nstrongly. Eventually this leads to a helical twist inversion\nfrom a left hand ~negative x! twist at lower temperatures to a\nright-hand ~positive x! twist at higher temperatures. Another\ntrend is also apparent in Table III. The magnitude of the\naverage chirality arising from the G2 , T , and G1 confor-\nmations decreases as the temperature increases. This effect\ncan be explained by a reduction in the order of the molecule\nat higher temperatures.\nIt is apparent from this study that the helix twist inver-\nsion can be explained by the different weighting of certain\nmolecular formations, with their associated chiralities, at dif-\nferent temperatures. Emelyanenko41 and Osipov et al.42 have\ndeveloped molecular theories of the helical sense inversion\nbased upon the competition between dispersion and steric\ninteractions in these systems and the biaxiality of molecules.\nWe note that while the model we use here does not explicitly\ntake into account any of these effects it is still able to account\nfor the helical twist inversion purely on the basis of confor-\nmational change.\nD. Achiral banana-shaped molecules\nIn a recent experimental study, Watanabe et al.43 found\nthat a series of achiral banana-shaped molecules with dode-\ncyl tail groups ~Fig. 10!, when added to a cholesteric liquid\ncrystal, enhanced the twisting power of the chiral nematic\nphase. In effect the achiral banana-shaped molecules were\nacting as chiral dopants. The experimental paper proposes\nthat in a chiral nematic liquid crystal the banana-shaped mol-\necules preferentially select chiral conformations with the\nsame handed twist as the chiral phase, and thus enhance the\ntwist of the cholesteric phase in the same way that a normal\nchiral dopant would. Here, we simulate the three molecules\nin Fig. 10. For these larger systems 4 million Monte Carlo\nFIG. 9. The chirality order parameter, x, as a function of temperature\nfor S-2-chloropropyl 48-(49-n-nonyloxyphenylpropioloyloxy!biphenyl-4-\ncarboxylate.\nTABLE III. Relative populations and chirality order parameters for the three\nmain conformations of the O–C–C–Cl dihedral angle in S-2-chloropropyl\n48-(49-n-nonyloxyphenylpropioloyloxy)biphenyl-4-carboxylate ~O–C–\nC–Cl dihedral angles 0°,G2.120°, 120°,T.240°, 240°,G1\n.360°).\nT\/K\nPopulation\/% ^x&\/Å3\nG2 T G1 G2 T G1\n200 18.0 75.4 6.6 7.3 25.9 23.9\n400 27.3 59.2 13.5 6.5 24.1 24.9\n550 30.6 53.6 15.8 6.6 23.4 22.4\n600 31.9 49.5 18.6 5.4 22.3 21.4\n10286 J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 D. J. Earl and M. R. Wilson\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nsteps were required and the calculations were carried out at\n400 K with an orienting strength parameter «50.05 Å22.\n20 000 conformations were used to determine an average\nchirality order parameter.\nAs expected, each of the molecules was found to be\nachiral within the statistical error of our results (^x&50.05\n66.58 Å3 for S–12–O–PIMB, ^x&50.2563.93 Å3 for\nP–12–O–PIMB and ^x&521.99611.49 Å3 for N–12–O–\nPIMB!. However, during our simulations the molecules\nadopted a number of conformations with extremely high\nmagnitudes of chirality associated with them. For example,\n;20% of the conformations adopted had uxu>500 Å3 and\n;2% of the conformations had uxu>1000 Å3. It should be\nnoted that x is not a function of molecular size and that a\nconformation with x’500 Å3 corresponds to bM\n’1000 mm21, which is much higher than any helical twist-\ning power that has been measured experimentally for chiral\nsystems. Even a small increase in the proportion of left-\nhanded or right-handed chiral conformations sampled by\nthese banana-shaped molecules in the twisted nematic liquid\ncrystal phase would have a relatively large effect on the twist\nof the system due to the extremely high HTPs of the chiral\nconformations. Thus, it seems likely in the experiments that\nthe chiral nematic phase is preferentially selecting chiral con-\nformations that twist in the same direction.\nV. CONCLUSIONS\nA flexible molecular Monte Carlo simulation approach,\ncoupled with calculations of a chirality order parameter has\nbeen used to study a range of chiral molecules. The method\nhas been successful in predicting helical twisting powers for\nflexible chiral dopants, in predicting the temperature depen-\ndence of HTPs, and has demonstrated a temperature induced\nhelical twist inversion. We have also shown extraordinarily\nhigh HTP values for some conformations exhibited by\nachiral banana molecules.\nIn this work we have restricted our studies to simulations\nof molecules in the gas phase due to the computational\ncheapness of this approach and the excellent conformational\nsampling that can be achieved. It is important to note that\nwe would expect a liquid crystalline solvent to affect\nthe relative weighting of conformations sampled by the\nmolecule, and thus influence the chirality of the system.\nIndeed, these solute–solvent effects may account for the\nexaggerated temperature dependence of the HTP in the\nexperimental system compared to our simulations for the\nTADDOL derivatives and may also explain differences in\nthe predicted and experimental temperatures for helical\ntwist inversion for S-2-chloropropyl 48-(49-n-nonyloxy-\nphenylpropioloyloxy!biphenyl-4-carboxylate. Our method\ncould easily be adapted to more complicated systems where\na liquid crystalline solvent ~either coarse-grained44,45 or fully\natomistic! could be included in the simulations. In these\ncases, we expect different conformations ~with different\nchiralities! to be preferentially selected in different solvents,\nthus accounting for solvent dependent HTPs. By including a\nfully atomistic liquid crystal solvent it would then be pos-\nsible to study the role of electrostatic and induction interac-\ntions on the helical twisting power of chiral dopants.\nACKNOWLEDGMENTS\nThe authors wish to thank Professor Maureen Neal and\nProfessor John Goodby for valuable discussions. D.J.E.\nwishes to thank EPSRC for a studentship and Merck NB-C\nfor an industrial CASE award.\n1 M. C. W. van Boxtel, R. H. C. Janssen, C. W. M. Bastiaansen, and D. J.\nBroer, J. Appl. Phys. 89, 838 ~2001!.\n2 M. Schadt, H. Seiberle, and A. Schuster, Nature ~London! 381, 6579\n~1996!.\n3 P. van de Witte, E. E. Neuteboom, M. Brehmer, and J. Lub, J. Appl. Phys.\n85, 7517 ~1999!.\n4 M. J. Cook and M. R. Wilson, J. Chem. Phys. 112, 1560 ~2000!.\n5 M. R. Wilson and D. J. Earl, J. Mater. Chem. 11, 2672 ~2001!.\n6 M. Solymosi, R. J. Low, M. Grayson, M. P. Neal, M. R. Wilson, and D. J.\nEarl, Ferroelectrics 277, 169 ~2002!.\n7 M. P. Neal, M. Solymosi, M. R. Wilson, and D. J. Earl, J. Chem. Phys.\n119, 3567 ~2003!.\n8 M. A. Osipov and H. G. Kuball, Eur. Phys. J. E 5, 589 ~2001!.\n9 A. Ferrarini, G. J. Moro, and P. L. Nordio, Liq. Cryst. 19, 397 ~1995!.\n10 L. Feltre, A. Ferrarini, F. Pacchiele, and P. L. Nordio, Mol. Cryst. Liq.\nCryst. Sci. Technol., Sect. A 290, 109 ~1996!.\n11 A. di Matteo, S. M. Todd, G. Gottarelli, G. Solladie, V. E. Williams, R. P.\nLemieux, A. Ferrarini, and G. P. Spada, J. Am. Chem. Soc. 123, 7842\n~2001!.\n12 A. Ferrarini, G. Gottarelli, P. L. Nordio, and G. P. Spada, J. Chem. Soc.,\nPerkin Trans. 1 2, 411 ~1999!.\n13 A. Ferrarini and P. L. Nordio, J. Chem. Soc., Perkin Trans. 1 2, 455\n~1998!.\n14 A. Ferrarini, P. L. Nordio, P. V. Shibaev, and V. P. Shibaev, Liq. Cryst. 24,\n219 ~1998!.\n15 A. Ferrarini, G. J. Moro, and P. L. Nordio, Mol. Phys. 87, 485 ~1996!.\n16 A. Ferrarini, G. J. Moro, and P. L. Nordio, Phys. Rev. E 53, 681 ~1996!.\n17 Y. Vorobjev and J. Hermans, Biophys. J. 73, 722 ~1997!.\n18 A. Rapini and M. Papoular, J. Phys. Colloq. 30 C4, 54 ~1969!.\nFIG. 10. Chemical structures of the three achiral banana molecules studied.\n10287J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 Predictions of molecular chirality and helical twisting powers\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n19 P. G. de Gennes, The Physics of Liquid Crystals ~Oxford University Press,\nOxford, 1974!, Chap. 3.\n20 F. Brochard and P. G. de Gennes, J. Phys. ~Paris! 31, 691 ~1970!.\n21 S. V. Burylov and Y. L. Raikher, Phys. Lett. A 149, 279 ~1990!.\n22 A. Ferrarini ~personal communication, 2002!.\n23 N. L. Allinger, J. Am. Chem. Soc. 99, 8127 ~1977!.\n24 CACHE Satellite: A Chemists Guide to CACHE for Windows ~Oxford Mo-\nlecular Group Inc., 1995!.\n25 M. R. Wilson, Liq. Cryst. 21, 437 ~1996!.\n26 G. Gottarelli, M. Hibert, B. Samori, G. Solladie, G. P. Spada, and R.\nZimmermann, J. Am. Chem. Soc. 105, 7318 ~1983!.\n27 G. Gottarelli, G. Proni, G. P. Spada, D. Fabbri, S. Gladiali, and C. Rosini,\nJ. Org. Chem. 61, 2013 ~1996!.\n28 N. L. Allinger, Y. H. Yuh, and J. Lii, J. Am. Chem. Soc. 111, 8551 ~1989!.\n29 M. Solymosi, R. J. Low, M. Grayson, and M. P. Neal, J. Chem. Phys. 116,\n9875 ~2002!.\n30 H. Kamberaj, M. A. Osipov, R. J. Low, and M. P. Neal ~unpublished!.\n31 H. G. Kuball, B. Weiss, A. K. Beck, and D. Seebach, Helv. Chim. Acta 80,\n2507 ~1997!.\n32 A. Ferrarini, G. R. Luckhurst, P. L. Nordio, and S. J. Roskilly, Liq. Cryst.\n21, 373 ~1996!.\n33 C. McBride, M. R. Wilson, and J. A. K. Howard, Mol. Phys. 93, 955\n~1998!.\n34 M. R. Wilson and M. P. Allen, Mol. Cryst. Liq. Cryst. 198, 465 ~1991!.\n35 A. Y. Bobrovsky, N. I. Boiko, and V. P. Shibaev, Mol. Cryst. Liq. Cryst.\n363, 35 ~2001!.\n36 A. J. Slaney, I. Nishiyama, P. Styring, and J. W. Goodby, J. Mater. Chem.\n2, 805 ~1992!.\n37 M. J. Watson, M. K. Horsburgh, J. W. Goodby, K. Takatoh, A. J. Slaney, J.\nS. Patel, and P. Styring, J. Mater. Chem. 8, 1963 ~1998!.\n38 M. K. B. R. Gelin, Biochemistry 18, 1256 ~1979!.\n39 B. R. Brooks, R. E. Bruccoleri, B. D. Olafson, D. J. States, S. Swami-\nnathan, and M. Karplus, J. Comput. Chem. 4, 187 ~1983!.\n40 D. L. Cheung, S. J. Clark, and M. R. Wilson, Phys. Rev. E 65, 051709\n~2002!.\n41 A. V. Emelyanenko, Phys. Rev. E 67, 031704 ~2003!.\n42 A. V. Emelyanenko, M. A. Osipov, and D. A. Dunmur, Phys. Rev. E 62,\n2340 ~2000!.\n43 J. Thisayukta, H. Niwano, H. Takezoe, and J. Watanabe, J. Am. Chem.\nSoc. 124, 3354 ~2002!.\n44 J. G. Gay and B. J. Berne, J. Chem. Phys. 74, 3316 ~1981!.\n45 D. J. Earl, J. Ilnytskyi, and M. R. Wilson, Mol. Phys. 99, 1719 ~2001!.\n10288 J. Chem. Phys., Vol. 119, No. 19, 15 November 2003 D. J. Earl and M. R. Wilson\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n"}