{"doi":"10.1103\/PhysRevLett.93.201805","coreId":"66498","oai":"oai:dro.dur.ac.uk.OAI2:1357","identifiers":["oai:dro.dur.ac.uk.OAI2:1357","10.1103\/PhysRevLett.93.201805"],"title":"Complete two-loop electroweak fermionic corrections to the effective leptonic weak mixing angle sin(2θlepteff and indirect determination of the Higgs boson mass.","authors":["Awramik,  M.","Czakon,  M.","Freitas,  A.","Weiglein,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-11","abstract":"We present a complete calculation of the contributions to the effective leptonic weak mixing angle, sin2, generated by closed fermion loops at the two-loop level of the electroweak interactions. This quantity is the source of the most stringent bound on the mass MH of the standard model Higgs boson. The size of the corrections with respect to known partial results varies between –4×10–5 and –8×10–5 for a realistic range of MH from 100 to 300 GeV. This translates into a shift of the predicted (from sin2 alone) central value of MH by +19 GeV, to be compared with the shift induced by a recent change in the measured top quark mass which amounts to +36 GeV","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66498.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1357\/1\/1357.pdf","pdfHashValue":"34cea1d127b675807118ccb2b3b4cd2d8f45830f","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1357<\/identifier><datestamp>\n      2010-10-19T09:57:43Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Complete two-loop electroweak fermionic corrections to the effective leptonic weak mixing angle sin(2θlepteff and indirect determination of the Higgs boson mass.<\/dc:title><dc:creator>\n        Awramik,  M.<\/dc:creator><dc:creator>\n        Czakon,  M.<\/dc:creator><dc:creator>\n        Freitas,  A.<\/dc:creator><dc:creator>\n        Weiglein,  G.<\/dc:creator><dc:description>\n        We present a complete calculation of the contributions to the effective leptonic weak mixing angle, sin2, generated by closed fermion loops at the two-loop level of the electroweak interactions. This quantity is the source of the most stringent bound on the mass MH of the standard model Higgs boson. The size of the corrections with respect to known partial results varies between –4×10–5 and –8×10–5 for a realistic range of MH from 100 to 300 GeV. This translates into a shift of the predicted (from sin2 alone) central value of MH by +19 GeV, to be compared with the shift induced by a recent change in the measured top quark mass which amounts to +36 GeV.<\/dc:description><dc:subject>\n        Quark mass<\/dc:subject><dc:subject>\n         Unified field theories<\/dc:subject><dc:subject>\n         Higgs bosons<\/dc:subject><dc:subject>\n         Intermediate boson mass<\/dc:subject><dc:subject>\n         Standard model.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review letters, 2004, Vol.93(20), pp.201805-1 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1357<\/dc:identifier><dc:identifier>\n        issn:0031-9007<\/dc:identifier><dc:identifier>\n        issn: 1079-7114<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevLett.93.201805<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1357\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.93.201805<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1357\/1\/1357.pdf<\/dc:identifier><dc:rights>\n        © 2010 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0031-9007"," 1079-7114","issn:0031-9007","issn: 1079-7114"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Quark mass","Unified field theories","Higgs bosons","Intermediate boson mass","Standard model."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAwramik, M. and Czakon, M. and Freitas, A. and Weiglein, G. (2004) ’Complete two-loop electroweak\nfermionic corrections to the effective leptonic weak mixing angle sin(2lepteff and indirect determination of the\nHiggs boson mass.’, Physical review letters., 93 (20). pp. 201805-1.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.93.201805\nPublisher’s copyright statement:\n2010 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nComplete Two-Loop Electroweak Fermionic Corrections to the Effective Leptonic Weak\nMixing Angle sin2\u0001lepteff and Indirect Determination of the Higgs Boson Mass\nM. Awramik,1,2 M. Czakon,1,3 A. Freitas,4 and G. Weiglein5\n1DESY, Platanenallee 6, D-15738 Zeuthen, Germany\n2Institute of Nuclear Physics PAS, Radzikowskiego 152, PL-31342 Cracow, Poland\n3Institute of Physics, University of Silesia, Uniwersytecka 4, PL-40007 Katowice, Poland\n4Theoretical Physics Division, Fermilab, P.O. Box 500, Batavia, Illinois 60510, USA\n5Institute for Particle Physics Phenomenology, University of Durham, Durham DH1 3LE, United Kingdom\n(Received 28 July 2004; published 11 November 2004)\nWe present a complete calculation of the contributions to the effective leptonic weak mixing angle,\nsin2\u0001lepteff , generated by closed fermion loops at the two-loop level of the electroweak interactions. This\nquantity is the source of the most stringent bound on the mass MH of the standard model Higgs boson.\nThe size of the corrections with respect to known partial results varies between \u00014\u0002 10\u00015 and \u00018\u0002\n10\u00015 for a realistic range of MH from 100 to 300 GeV. This translates into a shift of the predicted (from\nsin2\u0001lepteff alone) central value of MH by \u000319 GeV, to be compared with the shift induced by a recent\nchange in the measured top quark mass which amounts to \u000336 GeV.\nDOI: 10.1103\/PhysRevLett.93.201805 PACS numbers: 12.15.Lk, 13.38.Dg, 14.80.Bn\nThe search for the standard model (SM) Higgs boson\nlies among the most important objectives of present ele-\nmentary particle physics. The experimental discovery\nwill be possible at the CERN Large Hadron Collider\nwithin a mass range reaching up to 1 TeV. On the other\nhand, it is more than desirable to have as stringent indi-\nrect bounds on MH as possible with the help of precision\nmeasurements. Should the Higgs boson be discovered,\nthese bounds will serve as a strong test of the model.\nIn this Letter we study the quantity that has the highest\nweight in the combined fit to electroweak data as far as\nMH prediction is concerned, which is the effective lep-\ntonic weak mixing angle, sin2\u0001lepteff . It can be defined\nthrough the form factors at the Z boson pole of the vertex\ncoupling the Z to leptons (l). If this vertex is written as\nil\u0007\b\u0004gV \u0001 gA\u00075\u0005lZ\b, then\nsin 2\u0001lepteff \u0006 1=4\u00071\u0001 Re\u0004gV=gA\u0005\b: (1)\nAt the tree level this amounts to the sine of the weak\nmixing angle sin2\u0001W \u0006 1\u0001M2W=M2Z in the on-shell\nscheme. In practice, sin2\u0001lepteff is derived from various\nasymmetries measured around the Z boson peak at\ne\u0003e\u0001 colliders after subtraction of QED effects. The\ncurrent experimental value is 0:231 50\t 0:000 16 [1].\nThe high precision quoted and the expected size of the\nradiative corrections make the result indispensable for a\nprecise prediction of MH. A lot of effort has been put into\nthe theoretical calculation of sin2\u0001lepteff . Besides the one-\nloop contributions also higher-order QCD corrections\n[2,3] are known. However, for the electroweak two-loop\ncorrections, only the leading term in the large MH ex-\npansion [4] and the leading [5] and subleading [6] terms\nin the large top quark mass expansion are available up to\nnow. The goal of the present work is the calculation of the\ncomplete two-loop electroweak contributions with one or\ntwo closed fermion loops.\nThe prediction Eq. (1) does not use MW as the input\nparameter, but the results are given by using the very\nprecise measurement of the Fermi constant, G\b, from the\nmuon decay lifetime to derive MW . Consequently, the\ncalculation of sin2\u0001lepteff as a function of G\b involves also\nthe computation of the radiative corrections to the rela-\ntion between G\b and MW . For the electroweak two-loop\ncorrections with closed fermion loops considered here,\nthis has been carried out in Ref. [7]. We, therefore, also\nuse the quantity \u0016\u0011,\nsin 2\u0001lepteff \u0006 \u00041\u0001M2W=M2Z\u0005\u00041\u0003 \u0016\u0011\u0005; (2)\nwhich is only weakly sensitive to MW , but encompasses\nthe loop corrections to the Z form factors.\nWe focus in this Letter on the discussion of our main\nresults. A detailed description of the calculation will be\ngiven in a forthcoming publication. Here, we note only\nthat the contributions to the form factors can be divided\ninto two major parts. The first one comprises the terms\nfrom renormalization. We use the on-shell renormaliza-\ntion scheme, similarly to the previous calculation of MW\n[7]. The second one consists of the bare two-loop vertex\ndiagrams, the total number of which approaches 500.\nUpon restriction to those containing a closed fermion\nloop we count only a few tens, which can be cast into\nfour topologies as shown in Fig. 1. There is no dependence\non the Higgs boson mass in the pure two-loop vertex\ndiagrams, since CP conservation makes Fig. 1(d) vanish.\nIt is convenient to subdivide the remaining diagrams into\nthose containing a top quark line and those containing\nonly light fermion lines. The former can be evaluated\nwith the large top quark mass expansion, using the small-\nness of the ratio M2Z=m2t \n 1=4. We have convinced our-\nVOLUME 93, NUMBER 20 P H Y S I C A L R E V I E W L E T T E R S\nweek ending\n12 NOVEMBER 2004\n201805-1 0031-9007=04=93(20)=201805(4)$22.50  2004 The American Physical Society 201805-1\nselves that an expansion up to \u0004M2Z=m2t \u00055 is sufficient to\nobtain an intrinsic precision of the order of 10\u00017. The\ndiagrams with only light fermion lines introduce also an\nimportant simplification: they have just two scales at\nmost, MW and MZ, since at the level we are considering,\nlight fermion masses can be safely neglected. The prob-\nlem thus contains only one variable and lends itself natu-\nrally to the approach of differential equations [8]. A\nprerequisite for this method is the complete reduction of\nthe integrals to a small set of independent masters. This\nhas been achieved with the C\u0003\u0003 library DIAGEN\/\nIDSOLVER [9] and has been checked for a number of\ndiagrams by an independent calculation. At the end we\nobtained analytic expressions for all of the integrals but\none. The latter, corresponding to Fig. 1(b), has been\nevaluated by a one-dimensional integral representation.\nAll integrals have been checked by different expansions\nin physical and unphysical regimes and by numerical\nintegrations based on dispersion relations [10] and\nFeynman parametrizations [11].\nAn interesting problem connected to two-loop vertex\ndiagrams is the treatment of the \u00075 matrix in triangle\nfermion loops. We used the naive dimensional regulari-\nzation with a four-dimensional treatment of resulting\nepsilon tensors as already explained in [7]. We observed,\nhowever, that the contributions are divergent due to the\nsoft-collinear behavior of the diagrams with external on-\nshell massless fermions. This would undermine the cor-\nrectness of the approach if the dimension of space-time\nwere the only regulator. We decided to use a finite photon\nmass as the regulator at the expense of a subsequent\ndifficult expansion corresponding to a mixed Sudakov-\nthreshold regime. The difference between the full result\nand the result which would be obtained if all traces\ncontaining a single \u00075 were set to zero is denoted in\nwhat follows with a tr\u00075 subscript.\nWe now discuss the numerical effect of the new two-\nloop result for the effective weak mixing angle. We focus\non the contributions to \u0016\u0011, Eq. (2), taking the current\nexperimental value for MW as input. The associated error\nis not relevant for the analysis, since the final prediction\nuses G\b as input, combining the radiative corrections to\nMW and \u0016\u0011. We use the parameter values given in Table I.\nNote that the experimentally determined W and Z boson\nmasses correspond to a Breit-Wigner parametrization\nwith a running width and have to be translated to the\npole mass scheme used in our calculation [7], resulting in\na downward shift [12]. For MW and MZ, this shift\namounts to about 27 and 34 MeV, respectively.\nTable II contains the values of the one- and two-loop\nelectroweak corrections in comparison with different\ncomponents with a single fermion loop for different val-\nues of the Higgs boson mass. The full two-loop result in\nthe third column corresponds to the sum of the fourth,\nfifth and sixth columns plus the contributions with two\nfermion loops as well as the effect induced by the run-\nning, \u0016\u0017, of the fine structure constant. In the one-loop\nresult we have kept a finite b quark mass, which has an\nimpact of the order of \u00014:5\u0002 10\u00015. The perturbative\nexpansion is performed in the fine structure constant,\n\u0017, and not inG\b, since we want to avoid any uncontrolled\n‘‘resummed’’ terms. The first observation is that the third\nquark family contributions are very large, which is ex-\npected, since they include the leading top-bottom mass\nsplitting effects in the \u0019 parameter, \u0016\u0019 [13]. We have\nconvinced ourselves that the result has the correct behav-\nior for large mt [5]. It is interesting that even though the\nlight fermion contributions in Table II do not contain the\nrunning, \u0016\u0017, of the fine structure constant, they are\nsizable. The last column gives the values of the tr\u00075\ncontribution. It has to vanish for vanishing mass split-\ntings in the fermion families and can be at most logarith-\nmic for large top quark masses, which explains its\nsmallness. For small MH, the total two-loop result is\nrather small, but we note that this is due to a fragile\ncancellation strongly dependent on mt. With the older\nvalue mt \u0006 174:3 GeV, the result would be of the order\nof 5\u0002 10\u00014 for all values of MH.\nIn order to provide the most precise prediction for\nsin2\u0001lepteff in the SM we must use the muon decay constant,\nG\b, as the input parameter. The procedure to derive MW\nfrom G\b is described in detail in [14]. In analogy to that\nwork, we do not want to perform any ‘‘resummations.’’\nInstead, we include both in \u0016r and sin2\u0001lepteff all known\neffects in expanded form. Besides the electroweak two-\nloop terms presented above, these effects encompass\nTABLE I. Input parameters with errors where relevant for the present analysis.\nInput Value Input Value\nMW 80.426 GeV mb 4.85 GeV\nMZ 91:1876\t 0:0021 GeV \u0016\u0017\u0004M2Z\u0005 0:059 07\t 0:000 36\n\u001aZ 2.4952 GeV \u0017s\u0004MZ\u0005 0:117\t 0:002\nmt 178:0\t 4:3 GeV G\b 1:16637\u0002 10\u00015 GeV\u00012\nFIG. 1. Two-loop vertex diagrams entering the calculation.\nVOLUME 93, NUMBER 20 P H Y S I C A L R E V I E W L E T T E R S\nweek ending\n12 NOVEMBER 2004\n201805-2 201805-2\nQCD corrections to the one-loop prediction at the two-\n[2] and three-loop levels [3] and also the recently ob-\ntained O\u0004\u00172\u0017sm4t \u0005 and O\u0004\u00173m6t \u0005 corrections to \u0016\u0019 [15].\nWe kept again a finite b quark mass in the O\u0004\u0017\u0017s\u0005\ncorrection, which has an impact of 4:5\u0002 10\u00015, almost\ncompletely canceling the similar effect in the O\u0004\u0017\u0005 pre-\ndiction. Consistency requires that we also take leading\nreducible effects at O\u0004\u00172\u0017s\u0005 and O\u0004\u00173\u0005 into account. It\nturns out that separate terms as, e.g., c2W=s2W\u0016\u0019\u0016\u00172 are\nquite sizable, but when summed cancel each other as seen\nin Table III.We stress once more at this point that the same\neffects have been included in \u0016r and in sin2\u0001lepteff . This\nmeans, in particular, that, contrary to [14], we do not take\nthe bosonic corrections [16] to \u0016r into account. Such\nprecautions are enforced by the sensitivity of sin2\u0001lepteff to\nMW , since a 1 MeV shift in the latter causes a shift of\nabout \u00012\u0002 10\u00015 in the former.\nOur complete result is summarized by the following\nfitting formula, which reproduces the exact calculation\nwith maximal and average deviations of 4:5\u0002 10\u00016 and\n1:2\u0002 10\u00016, respectively, as long as the input parameters\nstay within their 2\u001d ranges and the Higgs boson mass in\nthe range 10 GeV \u000b MH \u000b 1 TeV:\nsin2\u0001lepteff \u0006 s0 \u0003 d1LH \u0003 d2L2H \u0003 d3L4H \u0003 d4\u0004\u00162H \u0001 1\u0005 \u0003 d5\u0016\u0017 \u0003 d6\u0016t \u0003 d7\u00162t \u0003 d8\u0016t\u0004\u0016H \u0001 1\u0005 \u0003 d9\u0016\u0017s \u0003 d10\u0016Z;\nLH \u0006 log\n\u0001\nMH\n100 GeV\n\u0002\n; \u0016H \u0006 MH100 GeV ; \u0016\u0017 \u0006\n\u0016\u0017\n0:059 07\n\u0001 1; \u0016t \u0006\n\u0001\nmt\n178:0 GeV\n\u0002\n2 \u0001 1;\n\u0016\u0017s \u0006\n\u0017s\u0004MZ\u0005\n0:117\n\u0001 1; \u0016Z \u0006 MZ91:1876 GeV\u0001 1;\n(3)\nwith\ns0\u00060:2312527; d1\u0006 4:729\u000210\u00014; d2\u0006 2:07\u000210\u00015; d3\u00063:85\u000210\u00016; d4\u0006\u00011:85\u000210\u00016; d5\u0006 0:0207;\nd6\u0006\u00010:002851; d7\u0006 1:82\u000210\u00014; d8\u0006\u00019:74\u000210\u00016; d9\u0006 3:98\u000210\u00014; d10\u0006\u00010:655: (4)\nThe impact of this result is shown in Table IV, where we\ncompare our prediction with the previous result as given\nin the fitting formula in [17] and implemented in ZFITTER\n[18]. The difference varies from roughly \u00014\u0002 10\u00015 to\n\u00018\u0002 10\u00015 for the MH range from 100 to 300 GeV, which\nis the preferred mass region inferred from precision elec-\ntroweak data. These values reach half of the experimental\nerror and induce an important shift in the central value of\nMH derived from sin2\u0001\nlept\neff alone. With the most recent\nvalue of the top quark mass given in Table I the result\nshifts the central value from 149 to 168 GeV, to be com-\npared with the shift induced by the new mt measurement\nwhich gives a jump from 132 to 168 GeV. The formula\nEq. (3) has been implemented in the most recent version\nof ZFITTER, version 6.40 [19].\nBesides providing an up-to-date fitting formula, it is\nnecessary to discuss the error on the theoretical predic-\ntion connected with the unknown higher-order contribu-\ntions. Here one has to incorporate the treatment of the\nerror of the MW prediction, since the final prediction for\nsin2\u0001lepteff takes G\b as input. In particular, there are some\ncancellations between the radiative corrections to MW\nand the Z decay form factors that go into sin2\u0001lepteff . We\ntake the point of view that these cancellations are natural\nTABLE III. Various QCD corrections to \u0016\u0011 and the only known pure three-loop electroweak irreducible contribution, stemming\nfrom \u0016\u0019, in comparison with three-loop reducible effects. The input parameter is MW .\nMH (GeV) O\u0004\u0017\u0017s\u0005 \u0002 10\u00014 O\u0004\u0017\u00172s\u0005 \u0002 10\u00014 O\u0004\u00172\u0017sm4t \u0005 \u0002 10\u00014 O\u0004\u00173m6t \u0005 \u0002 10\u00014 Reducible \u000210\u00014\n100 \u000136:83 \u00017:32 1.25 0.17 0.92\n200 \u000136:83 \u00017:32 2.08 0.09 0.94\n600 \u000136:83 \u00017:32 4.07 0.07 0.97\n1000 \u000136:83 \u00017:32 5.01 0.99 0.98\nTABLE II. One-loop and fermionic two-loop electroweak contributions to \u0016\u0011 with MW as input parameter. The subscripts ‘‘tb,’’\n‘‘lf,’’ and ‘‘tr\u00075’’ correspond to the contributions of single loops of the third quark family, of the light fermions (without the\nrunning of the fine structure constant), and of the tr\u00075 effects in the triangle fermion subloops, respectively (see the text).\nMH (GeV) O\u0004\u0017\u0005 \u0002 10\u00014 O\u0004\u00172\u0005ferm \u0002 10\u00014 O\u0004\u00172\u0005tb \u0002 10\u00014 O\u0004\u00172\u0005lf \u0002 10\u00014 O\u0004\u00172\u0005tr\u00075 \u0002 10\u00014\n100 438.94 \u00010:63 \u000116:96 \u00012:84 0.27\n200 419.60 \u00012:16 \u000117:10 \u00013:08 0.27\n600 379.56 \u00015:01 \u000116:89 \u00013:77 0.27\n1000 358.62 \u00014:73 \u000114:90 \u00014:25 0.27\nVOLUME 93, NUMBER 20 P H Y S I C A L R E V I E W L E T T E R S\nweek ending\n12 NOVEMBER 2004\n201805-3 201805-3\nand discuss both quantities in conjunction. To this end, we\nuse geometric progression from lower orders to estimate\nthe missing higher-order contributions and add them\nquadratically at the end. In units of 10\u00015 we assign the\nfollowing errors: corrections of O\u0004\u00172\u0017s\u0005 beyond m4t vary\nbetween 2.3 and 2.0 for MH between 10 GeV and 1 TeV,\ncorrections of O\u0004\u00173\u0005 between 1.8 and 2.5, O\u0004\u0017\u00173s\u0005 be-\ntween 1.1 and 1.0, O\u0004\u00172\u00172s\u0005 between 1.7 and 2.4, and\nfinally the bosonic corrections at O\u0004\u00172\u0005 are expected to\nbe of the order of 1.2. This gives an error varying between\n3.3 and 3.5, and we take as our estimate the latter, largest,\nvalue. To account for possible deviations from the geo-\nmetric progression of the perturbation series, we included\nan additional overall factor of\n\u0003\u0003\u0003\n2\np\n, giving a final error of\n4:9\u0002 10\u00015.\nIf we take into account all of the input parameter\nerrors, our prediction can be compared with the experi-\nmental value as shown in Fig. 2.\nIn conclusion, we have calculated the complete fermi-\nonic corrections to sin2\u0001lepteff at the two-loop level and\nobtained a sizable contribution when compared to the\npreviously known leading and subleading terms in the\ntop quark mass expansion. Together with our result for\nthe W boson mass and recently obtained three-loop\nterms, we are able to give the most up-to-date prediction\nto be used in the global fit to electroweak data.\nFurthermore, we implemented the result in the program\nZFITTER, widely used for this purpose.\nThe authors thank P. Gambino, F. Jegerlehner, and\nA. Sirlin for useful comments. This work was supported\nin part by TMR, European Community Human Potential\nProgramme under Contracts No. HPRN-CT-2002-00311\n(EURIDICE) and No. HPRN-CT-2000-00149 (Physics at\nColliders), by Deutsche Forschungsgemeinschaft under\nContract No. SFB\/TR 9–03, and by the Polish State\nCommittee for Scientific Research (KBN) under\nContract No. 2P03B01025.\n[1] The LEP EWWG and LEP Collaborations, D. Abbaneo\net al., hep-ex\/0312023.\n[2] A. Djouadi and C. Verzegnassi, Phys. Lett. B 195, 265\n(1987); A. Djouadi, Nuovo Cimento Soc. Ital. Fis. 100A,\n357 (1988); B. A. Kniehl, Nucl. Phys. B347, 86 (1990);\nF. Halzen and B. A. Kniehl, Nucl. Phys. B353, 567\n(1991); B. A. Kniehl and A. Sirlin, Nucl. Phys. B371,\n141 (1992); Phys. Rev. D 47, 883 (1993); A. Djouadi and\nP. Gambino, Phys. Rev. D 49, 3499 (1994); 53, 4111(E)\n(1996).\n[3] K. G. Chetyrkin, J. H. Ku¨hn, and M. Steinhauser, Phys.\nRev. Lett. 75, 3394 (1995); Nucl. Phys. B482, 213 (1996).\n[4] J. van der Bij and M. J. G. Veltman, Nucl. Phys. B231, 205\n(1984).\n[5] R. Barbieri, M. Beccaria, P. Ciafaloni, G. Curci, and\nA. Vicere, Phys. Lett. B 288, 95 (1992); 312, 511(E)\n(1993); Nucl. Phys. B409, 105 (1993); J. Fleischer, O.V.\nTarasov, and F. Jegerlehner, Phys. Lett. B 319, 249\n(1993); Phys. Rev. D 51, 3820 (1995).\n[6] G. Degrassi, P. Gambino, and A. Sirlin, Phys. Lett. B\n394, 188 (1997).\n[7] A. Freitas, W. Hollik, W. Walter, and G. Weiglein, Phys.\nLett. B 495, 338 (2000); 570, 260(E) (2003); Nucl. Phys.\nB632, 189 (2002); B666, 305(E) (2003); M. Awramik\nand M. Czakon, Phys. Lett. B 568, 48 (2003).\n[8] A.V. Kotikov, Phys. Lett. B 259, 314 (1991); E. Remiddi,\nNuovo Cimento Soc. Ital. Fis. 110A, 1435 (1997).\n[9] M. Czakon, DIAGEN\/IDSOLVER (unpublished).\n[10] S. Bauberger, F. A. Berends, M. Bo¨hm, and M. Buza,\nNucl. Phys. B434, 383 (1995).\n[11] A. Ghinculov and J. J. van der Bij, Nucl. Phys. B436, 30\n(1995).\n[12] D.Y. Bardin, A. Leike, T. Riemann, and M. Sachwitz,\nPhys. Lett. B 206, 539 (1988).\n[13] M. J. G. Veltman, Nucl. Phys. B123, 89 (1977).\n[14] M. Awramik, M. Czakon, A. Freitas and G. Weiglein,\nPhys. Rev. D 69, 053006 (2004).\n[15] M. Faisst, J. H. Ku¨hn, T. Seidensticker, and O. Veretin,\nNucl. Phys. B665, 649 (2003).\n[16] M. Awramik and M. Czakon, Phys. Rev. Lett. 89, 241801\n(2002); A. Onishchenko and O.Veretin, Phys. Lett. B 551,\n111 (2003); M. Awramik, M. Czakon, A. Onishchenko,\nand O. Veretin, Phys. Rev. D 68, 053004 (2003).\n[17] G. Degrassi, P. Gambino, M. Passera, and A. Sirlin, Phys.\nLett. B 418, 209 (1998).\n[18] D.Y. Bardin, P. Christova, M. Jack, L. Kalinovskaya,\nA. Olchevski, S. Riemann, and T. Riemann, Comput.\nPhys. Commun. 133, 229 (2001).\n[19] \/afs\/cern.ch\/user\/b\/bardindy\/public\/ZF6_40.\n100 300 500 700 900\nMH [GeV]\n0.231\n0.2315\n0.232\n0.2325\nsi\nn2\nθ e\nff\nexp. lower bound MH = 114.4 GeV\nexp. value 0.23150 +\/− 0.00016\npredic\ntion\nFIG. 2. The sin2\u0001lepteff prediction against the current experi-\nmental value, with 1\u001d bands from the experimental input.\nTABLE IV. Difference between the result Eq. (3) and the\nprevious result including terms of O\u0004\u00172m2t \u0005 from [6], obtained\nfrom the ZFITTER implementation (left column) or from the\nfitting formula from [17].\nMH (GeV) \u0004\u0016sin2\u0001lepteff \u0005ZFITTER \u0002 10\u00014 \u0004\u0016sin2\u0001lepteff \u0005 \u0002 10\u00014 [17]\n100 \u00010:45 \u00010:40\n200 \u00010:69 \u00010:72\n300 \u00010:85 \u00010:83\n600 \u00011:17 \u00010:94\n1000 \u00011:60 \u00011:28\nVOLUME 93, NUMBER 20 P H Y S I C A L R E V I E W L E T T E R S\nweek ending\n12 NOVEMBER 2004\n201805-4 201805-4\n"}