{"doi":"10.1017\/S0305004107000278","coreId":"71325","oai":"oai:eprints.lancs.ac.uk:2401","identifiers":["oai:eprints.lancs.ac.uk:2401","10.1017\/S0305004107000278"],"title":"Completely positive quantum stochastic convolution cocycles and their dilations.","authors":["Skalski, Adam G."],"enrichments":{"references":[{"id":16368461,"title":"A .A .K ALYUZHNYI and YU.A .C HAPOVSKY. A factorization of conditional expectations on Kac algebras and quantum double coset hypergroups.","authors":[],"date":"2003","doi":"10.1023\/b:ukma.0000031661.31923.7e","raw":"A .A .K ALYUZHNYI and YU.A .C HAPOVSKY. A factorization of conditional expectations on Kac algebras and quantum double coset hypergroups. Ukra¨ ı n .M a t .Z h .55 (2003), no. 12, 1669–1677; translation in Ukrainian Math. J. 55 (2003), no. 12, 1994–2005.","cites":null},{"id":16368458,"title":"A .A .K ALYUZHNYI. Conditional expectations on compact quantum groups and new examples of quantum hypergroups.","authors":[],"date":"2001","doi":null,"raw":"A .A .K ALYUZHNYI. Conditional expectations on compact quantum groups and new examples of quantum hypergroups. Methods Funct. Anal. Topology 7 (2001), no. 4, 49–68.Completely positive QS convolution cocycles 219","cites":null},{"id":16368441,"title":"A CCARDI. On the quantum Feynman–Kac formula.","authors":[],"date":"1978","doi":"10.1007\/bf02925568","raw":"L . A CCARDI. On the quantum Feynman–Kac formula. Rend. Sem. Mat. Fis. Milano 48 (1978), 135– 180.","cites":null},{"id":16368449,"title":"Compact quantum hypergroups.","authors":[],"date":"1999","doi":null,"raw":"Y U.C HAPOVSKY and L. VAINERMAN. Compact quantum hypergroups. J. Operator Theory 41 (1999), no.2, 261–289.","cites":null},{"id":16368481,"title":"Existence of Feller cocycles on a C∗-algebra.","authors":[],"date":"2001","doi":"10.1112\/s0024609301008128","raw":"J .M .L INDSAY and S. J. WILLS. Existence of Feller cocycles on a C∗-algebra. Bull. London Math. Soc. 33 (2001), no. 5, 613–621.","cites":null},{"id":16368479,"title":"Existence, positivity and contractivity for quantum stochastic ﬂows with inﬁnite dimensional noise. Probab. Theory Related Fields 116","authors":[],"date":"2000","doi":"10.1007\/s004400050261","raw":"J .M .L INDSAY and S. J. WILLS. Existence, positivity and contractivity for quantum stochastic ﬂows with inﬁnite dimensional noise. Probab. Theory Related Fields 116 (2000), 505–543.","cites":null},{"id":16368452,"title":"F RANZ.L ´ evy processes on quantum groups and dual groups.","authors":[],"date":"2005","doi":null,"raw":"U . F RANZ.L ´ evy processes on quantum groups and dual groups. In Quantum Independent Increment Processes, Vol. II: Structure of Quantum L´ evy Processes, Classical Probability and Physics,e d s .U . Franz and M. Sch¨ urmann. Lecture Notes in Math. 1866 (Springer-Verlag, 2005).","cites":null},{"id":16368482,"title":"Homomorphic Feller cocycles on a C∗-algebra.","authors":[],"date":"2003","doi":"10.1112\/s0024610703004174","raw":"J .M .L INDSAY and S. J. WILLS. Homomorphic Feller cocycles on a C∗-algebra. J. London Math. Soc. (2) 68 (2003), no. 1, 255–272.","cites":null},{"id":16368476,"title":"L INDSAY a n dA .G .S KALSKI. Quantum stochastic convolution cocycles II,","authors":[],"date":null,"doi":null,"raw":"J . M . L INDSAY a n dA .G .S KALSKI. Quantum stochastic convolution cocycles II, preprint.","cites":null},{"id":16368480,"title":"Markovian cocycles on operator algebras, adapted to a Fock ﬁltration.","authors":[],"date":"2000","doi":"10.1006\/jfan.2000.3658","raw":"J . M . L INDSAY and S. J. WILLS. Markovian cocycles on operator algebras, adapted to a Fock ﬁltration. J. Funct. Anal. 178 (2000), no. 2, 269–305.","cites":null},{"id":16368474,"title":"On quantum stochastic differential equations.","authors":[],"date":"2007","doi":null,"raw":"J .M .L INDSAY and A. G. SKALSKI. On quantum stochastic differential equations. J. Math. Anal. Appl. 330 (2007), no. 2, 1093–1114.","cites":null},{"id":16368468,"title":"On the generators of quantum stochastic ﬂows.","authors":[],"date":"1998","doi":"10.1006\/jfan.1997.3194","raw":"J .M .L INDSAY and K. R. PARTHASARATHY. On the generators of quantum stochastic ﬂows. J. Funct. Anal. 158 (1998), 521–549.","cites":null},{"id":16368447,"title":"Operator Spaces","authors":[],"date":"2000","doi":null,"raw":"E .G .E FFROS and Z. J. RUAN. Operator Spaces (Oxford University Press, 2000).","cites":null},{"id":16368455,"title":"processes on quantum hypergroups.","authors":[],"date":"2000","doi":"10.1090\/conm\/261\/04135","raw":"U .F RANZ and M. SCH¨ URMANN.L ´ evy processes on quantum hypergroups. In Inﬁnite Dimensional Harmonic Analysis, eds. H. Heyer, T. Hirai and N. Obata (Gr¨ abner, 2000), pp. 93–114.","cites":null},{"id":16368465,"title":"Quantum stochastic analysis – an introduction.","authors":[],"date":"2005","doi":null,"raw":"J .M .L INDSAY. Quantum stochastic analysis – an introduction. In Quantum Independent Increment Processes, Vol. I: From Classical Probability to Quantum Stochastics,e d s .U .F r a n za n dM . Sch¨ urmann. Lecture Notes in Math. 1865 (Springer-Verlag, 2005).","cites":null},{"id":16368470,"title":"Quantum stochastic convolution cocycles I.","authors":[],"date":"2005","doi":"10.4064\/bc73-0-24","raw":"J .M .L INDSAY and A. G. SKALSKI. Quantum stochastic convolution cocycles I. Ann. Inst. H. Poincar´ e Probab. Statist. 41 (2005), no. 3 (En hommage ` a Paul–Andr´ e Meyer), 581–604.","cites":null},{"id":16368472,"title":"Quantum stochastic convolution cocycles—algebraic and C∗-algebraic. Banach Center Publ.","authors":[],"date":"2006","doi":"10.4064\/bc73-0-24","raw":"J .M .L INDSAY and A. G. SKALSKI. Quantum stochastic convolution cocycles—algebraic and C∗-algebraic. Banach Center Publ. 73 (2006), 313–324.","cites":null},{"id":16368444,"title":"Quantum stochastic positive evolutions: characterization, construction, dilation.","authors":[],"date":"1997","doi":"10.1007\/s002200050072","raw":"V .P .B ELAVKIN. Quantum stochastic positive evolutions: characterization, construction, dilation. Comm. Math. Phys. 184 (1997), no. 3, 533–566.","cites":null},{"id":16368483,"title":"White Noise on Bialgebras.","authors":[],"date":"1993","doi":"10.1007\/bfb0089237","raw":"M . S CH¨ URMANN. White Noise on Bialgebras. Lecture Notes in Math. 1544 (Springer, 1993).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-07-01","abstract":"Stochastic generators of completely positive and contractive quantum stochastic convolution cocycles on a C*-hyperbialgebra are characterised. The characterisation is used to obtain dilations and stochastic forms of Stinespring decomposition for completely positive convolution cocycles on a C*-bialgebra","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71325.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/2401\/1\/1.pdf","pdfHashValue":"705ae2b77f53d1caf4edaf67ac9b45cadb5c37db","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:2401<\/identifier><datestamp>\n      2018-01-24T02:45:02Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Completely positive quantum stochastic convolution cocycles and their dilations.<\/dc:title><dc:creator>\n        Skalski, Adam G.<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        Stochastic generators of completely positive and contractive quantum stochastic convolution cocycles on a C*-hyperbialgebra are characterised. The characterisation is used to obtain dilations and stochastic forms of Stinespring decomposition for completely positive convolution cocycles on a C*-bialgebra.<\/dc:description><dc:date>\n        2007-07-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/2401\/1\/1.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0305004107000278<\/dc:relation><dc:identifier>\n        Skalski, Adam G. (2007) Completely positive quantum stochastic convolution cocycles and their dilations. Mathematical Proceedings of the Cambridge Philosophical Society, 143 (1). pp. 201-219. ISSN 1469-8064<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/2401\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0305004107000278","http:\/\/eprints.lancs.ac.uk\/2401\/"],"year":2007,"topics":["QA Mathematics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Math. Proc. Camb. Phil. Soc. (2007), 143, 201 c© 2007 Cambridge Philosophical Society\ndoi:10.1017\/S0305004107000278 Printed in the United Kingdom\n201\nCompletely positive quantum stochastic convolution cocycles\nand their dilations\nBY ADAM G. SKALSKI†\nDepartment of Mathematics and Statistics, Lancaster University, Lancaster, LA1 4YF.\ne-mail: a.skalski@lancaster.ac.uk\n(Received 04 April 2006; revised 25 August 2006)\nAbstract\nStochastic generators of completely positive and contractive quantum stochastic convo-\nlution cocycles on a C∗-hyperbialgebra are characterised. The characterisation is used to\nobtain dilations and stochastic forms of Stinespring decomposition for completely positive\nconvolution cocycles on a C∗-bialgebra.\nStochastic (or Markovian) cocycles on operator algebras are basic objects of interest in\nquantum probability ([1]) and have been extensively investigated using quantum stochastic\nanalysis (see [12]). There is also a well-developed theory of quantum Le´vy processes, that is\nstationary, independent-increment, *-homomorphic processes on a *-bialgebra (see [6, 22]\nand references therein). Close examination of these two directions has naturally led to the\nnotion of quantum stochastic convolution cocycle on a quantum group (or, more generally,\non a coalgebra), as introduced and investigated in [14] in an algebraic context, and in [17]\nin the analytic context of compact quantum groups. The main results have been summarised\nin [15]. Recent years have also seen an increased interest in the noncommutative gener-\nalisation of classical hypergroups ([3]), initiated by Chapovsky and Vainerman ([5]) and\ncontinued, for example, in the papers [10] and [11]. Compact quantum hypergroups differ\nfrom compact quantum groups in that their coproduct need not be multiplicative. How-\never, it remains completely positive, which makes compact quantum hypergroups, or more\ngenerally C∗-hyperbialgebras, an appropriate category for the consideration of completely\npositive quantum stochastic convolution cocycles in a topological context (for the purely\nalgebraic case see [7]). These cocycles may be viewed as natural counterparts of station-\nary, independent-increment processes on hypergroups. In [17] it is shown that, under certain\nregularity conditions, they satisfy coalgebraic quantum stochastic differential equations.\nThe aim of this paper is to prove dilation theorems for quantum stochastic convolution\ncocycles on a C∗-bialgebra. To this end it is first necessary to establish the detailed structure\nof the stochastic generators of completely positive and contractive convolution cocycles. We\ngive a direct derivation of this exploiting ideas used in the analysis of standard quantum\nstochastic cocycles with finite-dimensional noise space ([13]). Once the structure of gen-\nerators is known, one may consider question of dilating completely positive convolution\n† Permanent address: Department of Mathematics, University of Ło´dz´, ul. Banacha 22, 90-238 Ło´dz´,\nPoland.\n202 ADAM G. SKALSKI\ncocycles to ∗-homomorphic ones. In the context of standard quantum stochastic cocycles\nthis problem was treated in [8] and [9] (see also [2]). In the first of these papers it was shown\nthat every Markov-regular completely positive and contractive cocycle arises as the image of\na ∗-homomorphic cocycle under a vacuum conditional expectation which averages out some\ndimensions of the quantum noise. In the second every Markov-regular completely positive\nand contractive cocycle was shown to be realisable as a composition of a ∗-homomorphic\ncocycle with conjugation by a contraction operator process. This may be seen as a stochastic\nStinespring decomposition. In this paper using the techniques of Goswami, Lindsay, Sinha\nand Wills we obtain analogous results for convolution cocycles on C∗-bialgebras. Mul-\ntiplicativity of the coproduct is necessary here for obtaining dilations to ∗-homomorphic\ncocycles.\nAn alternative approach to the one presented in this paper would be to exploit more dir-\nectly theorems known for standard quantum stochastic convolution cocycles and properties\nof the R-map introduced in [17]. In that paper the general form of the stochastic generat-\nors of completely positive and contractive convolution cocycles was determined by using\na particular representation of the C∗-bialgebra in question and appealing directly to the\nresults of [13], [18] and [20]; similar methods may be further used to obtain the dilation\nresults presented here. One drawback of such an approach is that it involves using the deep\nChristensen-Evans theorem on quasi-innerness of derivations on represented C∗-algebras.\nAnother is the necessity to reformulate the results of [8] and [9] in coordinate-free quantum\nstochastic calculus. This is also necessary for overcoming separability assumptions on the\nnoise dimension spaces. Finally the von Neumann algebraic framework used in [8] would\nrequire nontrivial modifications. In sum, the method presented here has the advantage of\nbeing more elementary.\nThe paper is structured as follows. The first section contains the notation and elements\nof quantum stochastic analysis and operator space theory needed. In the second section\nC∗-hyperbialgebras are defined and the well-known technique of obtaining them from C∗-\nbialgebras via a noncommutative conditional expectation is recalled. Basic facts concerning\nquantum stochastic convolution cocycles and the structure of their stochastic generators in\nthe completely positive and ∗-homomorphic cases are also included here. In the third sec-\ntion a more detailed description of the stochastic generators of Markov-regular, completely\npositive, contractive convolution cocycles, in terms of a certain tuple of objects, is derived.\nDilations of such convolution cocycles on a C∗-bialgebra to *-homomorphic convolution\ncocycles are given in the fourth section, and the fifth section contains a stochastic Stine-\nspring decomposition.\n1. Preliminaries\nIn this section we introduce our notations and review results from quantum stochastic\nanalysis relevant to the rest of the paper. We shall usually abbreviate quantum stochastic to\nQS, completely positive to CP and completely positive, contractive to CPC.\nNotation\nAll vector spaces in this paper are complex and inner products are linear in their second\nargument. Algebraic tensor products are denoted by \u0003.\nLet h be a Hilbert space. Ampliations are denoted\nιh: B(H) −→ B(H ⊗ h), T \u0006−→ T ⊗ Ih,\nCompletely positive QS convolution cocycles 203\nand each vector ξ ∈ h defines operators\nEξ : H −→ H ⊗ h, v \u0006−→ v ⊗ ξ and E ξ = (Eξ )∗,\ngeneralising Dirac’s bra-ket notation:\nEξ = IH ⊗ |ξ〉 and E ξ = IH ⊗ 〈ξ |.\nThe particular Hilbert space H will always be clear from the context. For a subspace E of h,\nO(E) will denote the vector space of linear operators in h with domain E .\nFinally, for a function f :R+ → h and subinterval I of R+, f I denotes the function\nR+ → h which agrees with f on I and is zero outside I (cf. standard indicator-function\nnotation). This convention also applies to vectors, by viewing them as constant functions—\nfor example\nξ[s,t[, for ξ ∈ h and 0 \u0001 s < t.\nMatrix spaces\nFor an introduction to the theory of operator spaces we refer to [4]. For this paper it\nis sufficient to work with concrete operator spaces, that is closed subspaces of the space\nB(h; h′) of all bounded linear operators acting between Hilbert spaces h and h′. The spa-\ntial\/minimal tensor product of operator spaces is denoted by ⊗, and when V, W are operator\nspaces C B(V; W) denotes the space of all completely bounded maps from V to W.\nWe need the concept of matrix spaces introduced by Lindsay and Wills in [20]. Let V ⊂\nB(K) be an operator space and let h be a supplementary Hilbert space. The operator space:\nMh(V) = {T ∈ B(K ⊗ h) : E ξ ′ T Eξ ∈ V for all ξ, ξ ′ ∈ h}\nis called the h-matrix space over V. It is easy to see that Mh(V) contains the spatial tensor\nproduct V ⊗ B(h). Whenever W ⊂ B(H) is another operator space, and φ ∈ C B(V; W),\nthe map φ ⊗ idB(h) extends uniquely to a completely bounded map φ(h): Mh(V) → Mh(W)\nsatisfying\nE ξ\n′(\nφ(h)(T )\n)\nEξ = φ(E ξ ′ T Eξ ),\nfor all T ∈ Mh(V), ξ, ξ ′ ∈ h. The map φ(h) is called the h-lifting of φ.\nFock space notations and QS processes\nLet k be a Hilbert space, called the noise dimension space. ThenFk denotes the symmetric\nFock space over L2(R+; k). Exponential vectors in Fk are written ε( f ), f ∈ L2(R+; k). The\nCCR flow of index k, defined in terms of the second quantised shift on L2(R+; k), is denoted\nσ = (σt)t\u00010. Define\nSk\u0001Lin\n{\nd[0,s[ : d ∈ k, s ∈ R+\n}\nand a corresponding subspace of Fk:\nEk\u0001Lin{ε( f ) : f ∈ Sk}.\nWhen the space k is clear from the context we will simply write F, S and E. Elements of\nE will play the role of test functions. For a subspace E of k the following notation will be\nemployed:\nÊ\u0001Lin{̂c : c ∈ E}, where ĉ\u0001\n(\n1\nc\n)\n∈ ĥ\u0001C ⊕ h.\n204 ADAM G. SKALSKI\nTwo further useful notations are\ne0 =\n(\n1\n0\n)\n∈ k̂ and \u0006QS =\n[\n0\nIk\n]\n∈ B(̂k). (1·1)\nLet h be an additional Hilbert space. By an h-operator process we understand a family\nX = (Xt)t\u00010 of operators on h ⊗ F, each having the (dense) domain h \u0003 E, being weak-\noperator measurable in t and adapted to the natural Fock-space operator filtration. Thus\nX :R+ → O(h \u0003 E), t \u0006→ Xtξ is weakly measurable for all ξ ∈ h \u0003 E and, for each t \u0002 0,\nζ ∈ h, Xt(ζ⊗ε( f ))= X (t)(ζ⊗ε( f |[0,t[))⊗ε( f |[t,∞[) for some operator X (t)∈O(h\u0003E[0,t[),\nwhere E[0,t[ is defined as E is, except that R+ is replaced by [0, t[. The linear space of all h-\noperator processes is denoted P(h \u0003 E), or P(E) if h = C, with subscripts on the E when\nnecessary for avoiding ambiguity. A process X ∈ P(h \u0003 E) is called weakly regular if for\neach ξ, ξ ′ ∈ h \u0003 E, the scalar-valued function\nt \u0006−→ 〈ξ ′, Xtξ〉, t ∈ R+,\nis locally bounded. It is called bounded if Xt is a bounded operator for each t \u0002 0 (in such\na case Xt is usually identified with its continuous extension to the whole of h ⊗ F).\nNow let V and W be operator spaces with W ⊂ B(h). A linear map k from V to P(h \u0003 E)\nis called a process on V with values in W if, for each v ∈ V, k(v) is an h-operator process\nand, for each f, g ∈ S, t \u0002 0 and v ∈ V, the operator Eε( f )kt(v)Eε(g) belongs to W. Here W\nwill usually be either V or C.\nThe vector space of all processes on V with values in W is written P(V; W, E) (this cor-\nresponds to the notation P(V → W : h \u0003 E) used in [17]); when W = C we simply write\nP(V; E). We say that k ∈ P(V; W, E) is pointwise weakly regular if each k(v) (v ∈ V) is\nweakly regular. It is completely bounded if, for each v ∈ V, the process k(v) is bounded and,\nfor each t \u0002 0, the map kt : V → B(h ⊗ F) is completely bounded.\nQS differential equations and standard QS cocycles\nLet V, W be operator spaces with W ⊂ B(h) for some Hilbert space h. For maps θ ∈\nC B(V; W) and φ ∈ C B(V; Mk̂(V)) consider the quantum stochastic differential equation\ndkt = k̂t ◦ φ d\tt , k0 = ιF ◦ θ. (1·2)\nBy a weak solution of this equation we understand a process k ∈ P(V; W, E) such that\n〈ξ ⊗ ε( f ), (kt(v) − θ(v)1F)η ⊗ ε(g)〉 =\n∫ t\n0\n〈\nξ ⊗ ε( f ), ks\n(\nE f̂ (s)φ(v)Egˆ(s)\n)\nη ⊗ ε(g)〉ds\nfor all t \u0002 0, v ∈ V, ξ, η ∈ h and f, g ∈ S. If there is a quantum stochastically integrable\nh ⊗ k̂-process K on V (see [12]), with domain h ⊗ k̂ \u0003 E, satisfying\nE ζ\n′\nKt(v)Eζ = kt(E ζ ′φ(v)Eζ )\nfor all t \u0002 0, ζ, ζ ′ ∈ k̂ and v ∈ V, then k is called a strong solution. The equation (1·2) has a\nunique weakly regular weak solution, which is also a strong solution ([16], [18]). We denote\nit by kθ,φ , or simply kφ if V = W and θ = idW.\nA completely bounded process k ∈ P(V; V, E) is called a standard QS cocycle on V if,\nfor s, t \u0002 0,\nkt+s = kˆt ◦ σ˜t ◦ ks and k0 = ιF ◦ idV\nwhere kˆt denotes an F[t,∞[-lifting of kt and σ˜s = idh⊗σs . It is said to be Markov-regular if\nCompletely positive QS convolution cocycles 205\nits Markov semigroup P:R+ → B(V), defined by\nPt(v) = Eε(0)kt(v)Eε(0), t \u0002 0, v ∈ V,\nis norm-continuous. Whenever φ ∈ C B(V; Mk̂(V)), the process kφ is a Markov-regular weak\nstandard QS cocycle (see [12, 19]; note however that what is here called a weak standard\nQS cocycle, there is simply called a quantum stochastic cocycle).\n2. C∗-hyperbialgebras and QS convolution cocycles\nIn this section we describe the standard construction of C∗-hyperbialgebras via noncom-\nmutative conditional expectation, and give the definition and some properties of quantum\nstochastic convolution cocycles. We then relate quantum stochastic convolution cocycles on\nthe respective C∗-hyperbialgebras.\nC∗-hyperbialgebras and the conditional expectation construction\nDefinition 2·1. A unital C∗-algebra A is called a C∗-hyperbialgebra if it is equipped with a\nunital completely positive map \u0006: A → A⊗A (called a coproduct) and a character \u000b: A →C\n(called a counit) satisfying the following conditions:\n(\u0006 ⊗ idA) ◦ \u0006 = (idA ⊗ \u0006) ◦ \u0006,\n(\u000b ⊗ idA) ◦ \u0006 = (idA ⊗ \u000b) ◦ \u0006 = idA.\nIf additionally \u0006 is multiplicative then A is called a C∗-bialgebra (and may be thought of as\na compact quantum semigroup with a neutral element).\nThe following construction, of new C∗-hyperbialgebras from old, was described explicitly\n(in the context of compact quantum hypergroups) in the papers [10] and [11], but its origins\ngo back much further (see [5] and references therein). All known examples of noncommut-\native C∗-hyperbialgebras arise in this way from C∗-bialgebras.\nPROPOSITION 2·2. Let (A,\u0006, \u000b) be a C∗-hyperbialgebra. Assume that A˜ is a unital C∗-\nsubalgebra of A and that there exists a conditional expectation, that is a norm-one projec-\ntion, P from A onto A˜ satisfying the following identities:\n(P ⊗ idA) ◦ \u0006 ◦ P = (P ⊗ P) ◦ \u0006 = (idA ⊗ P) ◦ \u0006.\nThen (A˜, \u0006˜, \u000b˜) is a C∗-hyperbialgebra, where\n\u0006˜ = (P ⊗ P) ◦ \u0006|A˜ and \u000b˜ = \u000b|A˜.\nTwo particular cases of this construction are double coset bialgebras and Delsarte C∗-\nhyperbialgebras; they are described below.\nLet (A1,\u00061, \u000b1) and (A2,\u00062, \u000b2) be C∗-bialgebras and assume that the latter is a\nquantum subsemigroup of the former. This means that there exists a unital *-homomorphism\nπ : A1 → A2 which is surjective and intertwines the coalgebraic structures:\n(π ⊗ π) ◦ \u00061 = \u00062 ◦ π, \u000b2 ◦ π = \u000b1.\nAssume additionally that A2 admits a Haar state; this means that there exists a state µ ∈ A∗2\nsuch that for all a ∈ A2\n(µ ⊗ idA2)(\u00062(a)) = µ(a)1A2 .\n206 ADAM G. SKALSKI\nDefine the following C∗-subalgebras of A1:\nA1\/A2\u0001\n{\na ∈ A1 :\n(\nidA1 ⊗ π\n) ◦ \u00061(a) = a ⊗ 1},\nA2\\A1\u0001\n{\na ∈ A1 :\n(\nπ ⊗ idA1\n) ◦ \u00061(a) = 1 ⊗ a},\nA2\\A1\/A2\u0001A1\/A2 \u0001 A2\\A1,\ncalled respectively the algebras of right and left cosets of A2 and the double coset bialgebra.\nIt can be checked that the map P: A1 → A˜\u0001A2\\A1\/A2 defined by\nP(a) = ((µ ◦ π) ⊗ idA1 ⊗ (µ ◦ π)) (\u00061 ⊗ idA1)\u00061(a), a ∈ A1,\nsatisfies the conditions given in Proposition 2·2. Its action may be understood as averaging\n(twice) over the quantum subsemigroup; this construction is common in the theory of clas-\nsical hypergroups ([3]).\nLet now (A,\u0006, \u000b) be a C∗-bialgebra and assume that a compact group \r acts (continu-\nously with respect to the topology of pointwise convergence) on A by C∗-algebra auto-\nmorphisms satisfying\n(γ ⊗ γ ) ◦ \u0006 = \u0006 ◦ γ, \u000b ◦ γ = \u000b, γ ∈ \r.\nLet A˜ be the fixed point subalgebra, A˜\u0001 {a ∈ A : ∀γ∈\rγ (a) = a}. It is easily checked that\nthe map P: A → A˜ given by\nP(a) =\n∫\n\r\nγ (a)dγ, a ∈ A,\nwhere dγ denotes the normalised Haar measure on \r, satisfies the assumptions of Proposi-\ntion 2·2. The resulting C∗-hyperbialgebra is called a Delsarte C∗-hyperbialgebra.\nGiven a C∗-hyperbialgebra A, each operator space V determines a map\nRV: C B(A; V) −→ C B(A; A ⊗ V), ϕ \u0006−→ (idA ⊗ ϕ) ◦ \u0006. (2·1)\nWhen V =C we write R instead of RC.\nQS convolution cocycles\nThe following definition originates in [14] and is inspired by the theory of quantum Le´vy\nprocesses. Let A be a C∗-hyperbialgebra.\nDefinition 2·3. A QS convolution cocycle on A, with noise dimension space k, is a com-\npletely bounded process l ∈ P(A; E) such that, for s, t \u0002 0,\nls+t = (ls ⊗ (σs ◦ lt)) ◦ \u0006 and l0 = ιF ◦ \u000b.\nThe first of these conditions is referred to as the convolution increment property.\nA QS convolution cocycle l is said to be Markov-regular if its Markov convolution semig-\nroup of functionals λ:R+ → A∗, defined by\nλt(a) = 〈ε(0), lt(a)ε(0)〉, t \u0002 0, a ∈ A,\nis norm-continuous.\nFor ϕ ∈ C B(A; B(̂k)) we consider coalgebraic QS differential equations of the form\ndlt = lt \u0011 d\tϕ(t) = (lt \u0011π ϕ)d\tt , l0 = ιF ◦ \u000b, (2·2)\nwhere π indicates a tensor flip exchanging the order of k̂ and F. In fact the above equation\nmay also be written as an equation of the type (1·2), with φ = RB(̂k)ϕ and θ = \u000b. The unique\nCompletely positive QS convolution cocycles 207\nsolution of (2·2) will be denoted by lϕ . The process lϕ ∈ P(A; E) is a Markov-regular weak\nQS convolution cocycle. For full discussion of the precise meaning of (2·2), weak QS con-\nvolution cocycles and relations between the equation (2·2) and equations of the type (1·2)\nwe refer to [16] and [17]. The next two propositions are proved in [17] by applying the\nsemigroup decompositions of cocycles and convolution cocycles.\nPROPOSITION 2·4. Let l = lϕ and k = kφ where ϕ ∈ C B(A; B(̂k)) and φ = RB(̂k)ϕ.\nThen the process l is completely bounded (respectively, completely positive and contractive)\nif and only if k is, and if l and k are completely bounded then\nkt = RB(F)lt , t ∈ R+. (2·3)\nPROPOSITION 2·5. Let k = RB(F)l where l is a completely bounded process in P(A; E).\nThen l is a QS convolution cocycle if and only if k is a standard QS cocycle on A, and in this\ncase l is Markov-regular if and only if k is.\nApplication of these results to the characterisation of the generators of Markov-regular\nCPC QS cocycles, and *-homomorphic QS cocycles, given in [20] and [21] respectively,\nleads to the following results.\nTHEOREM 2·6 ([17]). Let A be a C∗-hyperbialgebra and l ∈ P(A; Ek). Then the follow-\ning are equivalent:\n(i) l is a Markov-regular, completely positive and contractive QS convolution cocycle;\n(ii) l = lϕ where ϕ ∈ C B(A; B(̂k)) satisfies ϕ(1) \u0001 0 and may be decomposed as\nfollows:\nϕ(a) = ψ(a) − \u000b(a)(\u0006QS + |e0〉〈χ | + |χ〉〈e0|), a ∈ A, (2·4)\nfor some completely positive map ψ : A → B(̂k) and vector χ ∈ k̂.\nTHEOREM 2·7 ([17]). Let A be a C∗-bialgebra and let l = lϕ where ϕ ∈ C B(A; B(̂k)).\nThen the following are equivalent:\n(i) l is *-homomorphic;\n(ii) ϕ satisfies\nϕ(a∗b) = \u000b(a)∗ϕ(b) + \u000b(b)ϕ(a)∗ + ϕ(a)∗\u0006QSϕ(b), a, b ∈ A. (2·5)\nQS convolution cocycles and the conditional expectation construction\nWe end this section by describing the connection between QS convolution cocycles on\nC∗-hyperbialgebras related by the construction given in Proposition 2·2.\nPROPOSITION 2·8. Let (A˜, \u0006˜, \u000b˜) be the C∗-hyperbialgebra arising from a C∗-\nhyperbialgebra (A,\u0006, \u000b) via the construction presented in Proposition 2·2, with associated\nconditional expectation P. Then there is a 1-1 correspondence between QS convolution\ncocycles on A˜ and P-invariant processes on A satisfying the convolution increment property\nand having initial condition given by the functional \u000b ◦ P.\nProof. Assume first that l˜ ∈ P(A˜; E) is a QS convolution cocycle and define l ∈ P(A; E)\nby\nlt = l˜t ◦ P, t \u0002 0.\nThen clearly l0(a)= \u000b(P(a)) for all a ∈ A, and l is P-invariant. It remains to check it is a\n208 ADAM G. SKALSKI\nconvolution increment process. Choose t, s \u0002 0 and compute:\nls+t = l˜s+t ◦ P = (˜ls ⊗ (σs ◦ l˜t)) ◦ \u0006˜ ◦ P\n= (˜ls ⊗ (σs ◦ l˜t)) ◦ (P ⊗ P) ◦ \u0006P\n= (˜ls ⊗ (σs ◦ l˜t)) ◦ (P ⊗ P) ◦ \u0006 = (ls ⊗ (σs ◦ lt)) ◦ \u0006.\nConversely, let l ∈ P(A; E) be a P-invariant convolution increment process, with initial\ncondition given by \u000b ◦ P . Then the process l˜ ∈ P(A˜; E), defined simply by the restriction of\nl, is a QS convolution cocycle on A˜ — again the only thing to be checked is the convolution\nincrement property: for all s, t \u0002 0, a ∈ A˜,\nl˜s+t(a) = ls+t(a)\n= (ls ⊗ (σs ◦ lt))(\u0006(a))\n= (ls ⊗ (σs ◦ lt))(\u0006(Pa))\n= (ls ⊗ (σs ◦ lt))((P ⊗ P) ◦ \u0006 ◦ P)(a) = (˜ls ⊗ (σs ◦ l˜t))(\u0006˜(a)).\nMarkov-regularity is clearly preserved in the above correspondence.\nIf \u000b = \u000b ◦ P (as is the case for Delsarte C∗-hyperbialgebras, but usually not for double\ncoset bialgebras), then the processes l arising in the proof of the above theorem are ob-\nviously QS convolution cocycles. Assuming this is the case, it is easily checked that if\nϕ ∈ C B(A˜; B(̂k)) then l˜\u0001 lϕ ∈ P(A˜; E) corresponds to the process lϕ◦P ∈P(A; E). There is\nan analogous correspondence on the level of weak QS convolution cocycles.\nIn [17] a variety of examples of C∗-bialgebras is presented, and ∗-homomorphic QS con-\nvolution cocycles on them are given alternative interpretations.\n3. Generator of CPC QS convolution cocycle\nIn this section we consider the detailed structure of the stochastic generators of CPC QS\nconvolution cocycles. Our approach is direct, following ideas used in the study of CPC\nstandard QS cocycles. The crucial analysis was carried out in [13], with extension to infinite\ndimensional noise done in [18] and [20] (see also [2]).\nAdapting arguments used in [13] requires some care, and the R-map introduced in (2·1)\nis an indispensable tool. A straightforward approach to complete positivity for QS convo-\nlution cocycles leads to nontrivial considerations of the proper convolution-counterpart of\nconditional complete positivity, and here the R-map does not appear to be helpful. However,\nnonnegative-definite kernels taking values in a C∗-algebra do behave well under the R-map,\nas will be seen in the proof of the next proposition.\nFor the rest of this section A denotes a fixed C∗-hyperbialgebra. For any τ ∈ B(A) define\n∂τ : A × A → A by\n∂τ(a1, a2) = τ(a∗1 a2) − a∗1τ(a2) − τ(a∗1)a2 + a∗1τ(1)a2, a1, a2 ∈ A.\nBy analogy, for any f ∈ A∗ define ∂\u000b f : A × A → C by\n∂\u000b f (a1, a2) = f (a∗1a2) − \u000b(a∗1) f (a2) − f (a∗1)\u000b(a2) + \u000b(a∗1) f (1)\u000b(a2), a1, a2 ∈ A.\nIf (ρ, K) is a representation of A, a map δ: A → B(C; K) is called a (ρ, \u000b)-derivation if for\nall a1, a2 ∈ A\nδ(a1a2) = ρ(a1)δ(a2) + δ(a1)\u000b(a2).\nCompletely positive QS convolution cocycles 209\nObserve that if ϕ ∈ C B(A; B(̂k) and lϕ is completely positive then it is easily verified that\nit is contractive too if and only if\nϕ(1) \u0001 0. (3·1)\nWe need to start with the finite-dimensional situation. The key fact is the following result,\ncorresponding to [13, theorem 4·1].\nLEMMA 3·1. Assume that k is finite dimensional. Let ϕ ∈ C B(A; B(̂k)) and suppose\nthat the (weak) QS convolution cocycle l\u0001 lϕ ∈ P(A; Ek) is CPC. Then there exist a unital\n*-representation (ρ, K) of A, a (ρ, \u000b)-derivation δ : A → B(C; K), an operator D ∈ B(k; K)\nand a vector d ∈ k such that\nϕ(a) =\n[\nλ(a) \u000b(a)〈d| + δ†(a)D\n\u000b(a)|d〉 + D∗δ(a) D∗ρ(a)D − \u000b(a)Ik\n]\n, a ∈ A, (3·2)\nwhere the functional λ is real,\n∂\u000bλ(a1, a2) = δ(a1)∗δ(a2), a1, a2 ∈ A,\nand the following minimality condition holds:\nK = Lin{δ(a)1 + ρ(a)Dc : a ∈ A, c ∈ k}. (3·3)\nIf (K′, ρ ′, δ′, D′) is another quadruple satisfying the above conditions (except possibly the\nminimality condition), then there exists a unique isometry V : K → K′ such that\nδ′(a) = V δ(a), ρ ′(a)V = Vρ(a), D′ = V D, a ∈ A.\nProof. The proof is a modification of the argument used in the proof of lemma 4·5 in [13],\nwhere k is taken to be Cd . Write ϕ in block matrix form:[\nλ η˜\nη σ − \u000b(·)Ik\n]\n.\nBy Propositions 2·4 and 2·5, k = RB(Fk)l is a CPC standard QS cocycle and φ = RB(̂k)ϕ is\nreal. Therefore ϕ is real too, in particular η˜ = η†, and φ has block matrix form[\nτ α†\nα ν − ι\n]\n,\nwhere τ = Rλ, α = RB(C;k)η and ν = RB(k)σ . Now lemma 4·4 in [13] implies that the map\n\u001a from A × A to A ⊗ B(̂k), there identified with Md+1(A), defined by\n\u001a(a1, a2) =\n[\n∂τ(a1, a2) α\n†(a∗1a2) − a∗1α†(a2)\nα(a∗1a2) − α(a∗1)a2 ν(a∗1a2)\n]\n, a1, a2 ∈ A,\nis nonnegative-definite. Observe that if ψ : A × A → B(̂k) is defined by the formula\nψ(a1, a2) =\n[\n∂\u000bλ(a1, a2) η\n†(a∗1a2) − \u000b(a∗1)η†(a2)\nη(a∗1a2) − η(a∗1)\u000b(a2) σ (a∗1a2)\n]\n, a1, a2 ∈ A,\nthen ψ = (\u000b⊗idB(̂k))◦\u001a. This in turn implies that ψ is a nonnegative-definite kernel. Indeed,\nfor any n ∈ N, a1, . . . , an ∈ A and T1, . . . , Tn ∈ B(̂k)\nn∑\ni, j=1\nT ∗i ψ(ai , a j )Tj =\n(\n\u000b ⊗ idB(̂k)\n)⎛⎝ n∑\ni, j=1\n(1A ⊗ T ∗i )\u001a(ai , a j )(1A ⊗ Tj )\n⎞⎠\u0002 0,\nas (1A ⊗ Ti )∗ = (1A ⊗ T ∗i ) ∈ A ⊗ B(̂k), \u000b is CP, and \u001a is nonnegative-definite.\n210 ADAM G. SKALSKI\nNow let (K, χ) be the minimal Kolmogorov pair associated with ψ . This means that χ is\na map A → B(̂k; K) satisfying\nχ(a1)\n∗χ(a2) = ψ(a1, a2), a1, a2 ∈ A,\nK = Lin{χ(a)ζ : a ∈ A, ζ ∈ k̂}.\nProperties of ψ imply that χ is linear and bounded. Write χ=[δ γ ], where\nδ∈B(A; B(C; K)) and γ ∈ B(A; B(k; K)). Then, for any a, b ∈ A,\nδ(a)∗δ(b) = ∂\u000bλ(a, b) and γ (a)∗δ(b) = η(a∗b) − η(a∗)\u000b(b).\nSetting a = b = 1 shows that δ(1) = 0. Now for u ∈ A unitary, define\nδu(a) = δ(ua) − δ(u)\u000b(a), γu(a) = γ (ua) and χu = [δu γu], for a ∈ A.\nA straightforward computation yields\nχu(a1)\n∗χu(a2) = χ(a1)∗χ(a2).\nThe uniqueness of minimal Kolmogorov pairs implies the existence of a unique isometry\nρ(u) : K → K given by the formula\nρ(u)(δ(a)1 + γ (a)c) = δ(ua)1 − δ(u)\u000b(a) + γ (ua)c, a ∈ A, c ∈ k.\nIt follows, by standard arguments, that\nρ(a)(δ(b)1 + γ (b)c) = δ(ab)1 − δ(a)\u000b(b) + γ (ab)c, a, b ∈ A, c ∈ k,\ndefines a bounded operator ρ(a) on K. Moreover, it is easily checked that the resulting\nmap ρ : A → B(K) is indeed a *-representation of A. It immediately follows that δ is a\n(ρ, \u000b)-derivation and also, from minimality and the identity δ(1)= 0, that ρ is unital. Put\nD = γ (1)∈ B(k; K). Then γ (a) = ρ(a)D, and furthermore σ(a) = D∗ρ(a)D and η(a) =\n\u000b(a)η(1) + D∗δ(a)1. This yields (3·2) with d = η(1)1.\nThe second part of the lemma follows once more from uniqueness of the Kolmogorov\nconstruction.\nThe step from finite-dimensional to arbitrary noise dimension space follows in exactly the\nsame way as for standard cocycles.\nLEMMA 3·2. Assume that k is an arbitrary Hilbert space. Let ϕ ∈ C B(A; B(̂k)) and sup-\npose that the (weak) QS convolution cocycle lϕ ∈ P(A; Ek) is CPC. Then the conclusions of\nLemma 3·1 hold.\nProof. Let {kι : ι ∈ I} be an indexing of the set of all finite-dimensional subspaces of k,\nwhich is partially ordered by inclusion. As in [18] we consider finite-dimensional cut-offs\nof both lϕ and ϕ itself. For each ι ∈ I denote by ϕι the map A → B(k̂ι) given by the formula\nϕι(a) = Pιϕ(a)Pι, a ∈ A,\nwhere Pι ∈ B(̂k) is the orthogonal projection onto k̂ι. Setting l(ι) = lϕι , Fι = Fkι , Eι = Ekι\nand letting Eι denote the vacuum conditional expectation map from B(Fk) to B(Fι), it is\neasy to see that l(ι) ∈ P(A; Eι) is a CPC QS convolution cocycle and that it satisfies\nl(ι)t (a) = Eι\n[\nlϕt (a)\n]\n, a ∈ A, t ∈ R+.\nCompletely positive QS convolution cocycles 211\nLemma 3·1 yields quadruples (Kι, ρι, δι, Dι), unique up to isometric isomorphism, such\nthat for all a ∈ A\nϕι(a) =\n[\nλ(a) \u000b(a)〈dι| + δ†ι (a)Dι\n\u000b(a)|dι〉 + D∗ι δι(a) D∗ι ρι(a)Dι − \u000b(a)Iι\n]\n,\nwhere Iι denotes the identity operator on kι.\nExploiting uniqueness one can construct an inductive limit K of the Hilbert spaces Kι.\nDenote by Uι the respective isometry Kι → K. Then there is a unital *-representation ρ of A\non K and a (ρ, \u000b)-derivation δ : A → B(C; K)\nρ(a)Uι = Uιρι(a), δ(a) = Uιδι(a)\nfor all ι ∈ I, a ∈ A. Similarly, for each c ∈ k there exists a vector cD ∈ K such that\ncD = UιDιc,\nfor all ι ∈ I such that c ∈ kι. The map c \u0006→ cD is linear; it remains to show that it is bounded.\nTo this end observe that, for any ι ∈ I such that c ∈ kι,〈(\n0\nc\n)\n, ϕ(1)\n(\n0\nc\n)〉\n=\n〈(\n0\nc\n)\n, ϕι(1)\n(\n0\nc\n)〉\n= 〈c, (D∗ι Dι − \u000b(1)Iι)c〉 = ‖Dιc‖2 − ‖c‖2 = ‖cD‖2 − ‖c‖2,\nand inequality (3·1), being a consequence of the contractivity of lϕ , implies that ‖cD‖\u0001 ‖c‖.\nThe operator D ∈ B(k; K) given by Dc = cD completes the tuple whose existence we wished\nto establish. Minimality holds by construction.\nAutomatic innerness of (ρ, \u000b)-derivations leads to the following theorem.\nTHEOREM 3·3. Let ϕ ∈ C B(A; B(̂k)), for a C*-hyperbialgebra A, and suppose that\nthe weak QS convolution cocycle lϕ ∈P(A; Ek) is completely positive and contractive. Then\nthere exists a tuple (K, ρ, D, ξ, d, e, t) constisting of a unital *-representation (ρ, K) of A,\na contraction D ∈ B(k; K), vectors ξ ∈ K and d, e ∈ k, and a real number t, such that\nϕ(a) =\n[\nλ(a) \u000b(a)〈d| + δ†(a)D\n\u000b(a)|d〉 + D∗δ(a) D∗ρ(a)D − \u000b(a)Ik\n]\n, (3·4)\nt = λ(1) \u0001 0, d = (Ik − D∗D)1\/2e, ‖e‖2\u0001−t and, for all a ∈ A,\nδ(a) = (ρ(a) − \u000b(a))|ξ〉, λ(a) = \u000b(a)(t − ‖ξ‖2) + 〈ξ, ρ(a)ξ〉. (3·5)\nProof. Lemma 3·2 gives the form (3·4) for some ρ, K, δ and D. As all (ρ, \u000b)-derivations\nare inner (see [17, appendix]), there exists ξ ∈ K such that\nδ(a) = ρ(a)|ξ〉 − \u000b(a)|ξ〉.\nIt remains to note that\nϕ(1) =\n[\nt 〈d|\n|d〉 D∗D − Ik\n]\n, (3·6)\nand the condition ϕ(1)\u0001 0 implies contractivity of D, negativity of t and the existence of a\nvector e ∈ k satisfying all the conditions above (see the characterisation of positive ‘block’\nmatrices given in lemma 2·1 of [9]).\n212 ADAM G. SKALSKI\nRemarks. The converse is also true — if a map ϕ ∈ C B(A; B(k)) has the above form\nthen lϕ is CPC. This follows easily from Propositions 2·4 and 2·5 and theorem 2·4 of [20].\nIf lϕ is also unital, then ϕ(1) = 0 and (3·4) takes the form\nϕ(a) =\n[\nλ(a) δ†(a)D\nD∗δ(a) D∗ρ(a)D − \u000b(a)Ik\n]\n,\nwith D being an isometry. This corresponds exactly to the characterisation obtained in the\npurely algebraic case by Franz and Schu¨rmann ([7]).\nThe characterisation in Theorem 3·3 yields, as announced in the beginning of this section,\nan alternative proof of the existence of the decomposition (2·4) of Theorem 2·6. Indeed, for\nϕ : A → B(̂k) of the form (3·4), define S: k̂ → K by S =[|ξ〉, D]. Then\nϕ(a) = S∗ρ(a)S +\n[\nλ0(a) \u000b(a)〈d − D∗c|\n\u000b(a)|d − D∗c〉 −\u000b(a)Ik\n]\n, a ∈ A,\nwhere λ0(a)= λ(a)−〈ξ, ρ(a)ξ〉. Note that as ∂\u000bλ0(a1, a2)= 0 for any a1, a2 ∈ A, λ0 =\nλ0(1)\u000b - one can check that (λ0 − λ0(1)\u000b ) is an (\u000b, \u000b)-derivation and so is zero. The map\nψ : A → B(̂k) defined by\nψ(a) = S∗ρ(a)S, a ∈ A,\nis completely positive. Setting χ = ( 12 λ0(1)d−D∗c) yields the required decomposition.\n4. Dilations to *-homomorphic QS convolution cocycles\nThis section addresses the question of dilating a completely positive, contractive QS con-\nvolution cocycle on a C∗-bialgebra to a *-homomorphic QS convolution cocycle. It is closely\npatterned on [9]. From now on we assume that A is a C∗-bialgebra. Recall that this means\nthat A is a C∗-hyperbialgebra whose coproduct is multiplicative. Let k0 be a closed subspace\nof a noise dimension space k. The vacuum conditional expectation from B(Fk) to B(Fk0)\nwill be denoted by E0.\nDefinition 4·1. A (weak) QS convolution cocycle j ∈ P(A; Ek) is said to be a stochastic\ndilation of a (weak) QS convolution cocycle l ∈ P(A; Ek0) if\nlt = E0 ◦ jt , t \u0002 0.\nThe following result follows in exactly the same way as its counterpart for standard\ncocycles ([9, lemma 1·2]).\nPROPOSITION 4·2. Let ϕ ∈ C B(A; B(̂k)) and ψ ∈ C B(A; B(̂k0)), and let j = lϕ ∈\nP(A; Ek) and l = lψ ∈P(A; Ek0) be the respective QS convolution cocycles. Then j is a\nstochastic dilation of l if and only if ψ(·) = P0ϕ(·)P0, where P0 ∈ B(̂k) denotes the or-\nthogonal projection onto k̂0.\nGenerators of *-homomorphic cocycles may be described in the following way.\nPROPOSITION 4·3. Let (K, ρ, D, ξ, d, t) be a tuple as in Theorem 3·3 and let ϕ be the\nmap in C B(A; B(̂k)) given by the formulas (3·4) and (3·5). Then the (weak) QS convolution\ncocycle lϕ ∈ P(A; Ek) is *-homomorphic if and only if the following conditions hold:\n(i) D is a partial isometry;\n(ii) Dd = 0;\n(iii) DD∗ ∈ ρ(A)′;\nCompletely positive QS convolution cocycles 213\n(iv) t = −‖d‖2;\n(v) DD∗δ = δ;\nwhere δ is the (ρ, \u000b)-derivation a \u0006→ (ρ(a) − \u000b(a)Ik)|ξ〉.\nProof. In the language of Theorem 3·3, the structure relations (2·5) translate into the\nfollowing identities:\nD∗ρ(a)DD∗ρ(b)D = D∗ρ(ab)D,\nD∗δ(ab) + \u000b(ab)|d〉 = D∗ρ(a)D(D∗δ(b) + \u000b(b)|d〉) + D∗δ(a)\u000b(b) + \u000b(a)\u000b(b)|d〉,\nλ(a∗b) = 〈D∗δ(a)1 + \u000b(a)d, D∗δ(b)1 + \u000b(b)d〉 + λ(a∗)\u000b(b) + \u000b(a∗)λ(b),\nfor all a, b ∈ A. As in proposition 3·3 of [9], this in turn may be shown to be equivalent to\nthe conditions (i)–(v).\nRemarks. Observe that the above characterisation excludes the possibility of obtain-\ning exchange free dilations—it can be seen directly from (2·5) that if a Markov-regular\n*-homomorphic QS convolution cocycle is generated by a map having the form[∗ ∗\n∗ 0\n]\nthen it is identically 0. This uses the fact that (\u000b, \u000b)-derivations are trivial. As to cre-\nation\/annihilation free dilations, they are possible only for those CPC QS convolution\ncocycles, whose generators have the form[\n0 0\n0 ∗\n]\n.\nMoreover, j is unital, as well as being *-homomorphic, if and only if (iii) and (v) are\nsatisfied, D is an isometry, d = 0 and t = 0.\nAs a consequence of Theorem 3·3 and Proposition 4·3, we obtain the existence of\nstochastic dilations.\nTHEOREM 4·4. Every Markov-regular CPC QS convolution cocycle on a C∗-bialgebra\nA admits a Markov-regular *-homomorphic stochastic dilation.\nProof. Let l ∈ P(A; Ek0) be a Markov-regular CPC QS convolution cocycle. Then l =\nlϕ for some ϕ ∈ C B(A; B(̂k0)) and we can assume that ϕ has matrix form (3·4) for a\ntuple (K, ρ, D, ξ, d, e, t) with the properties described in Theorem 3·3. Let k1, k2 be Hilbert\nspaces, suppose that d1 ∈ k1, d2 ∈ k2, D1 ∈ B(k1; K) (all as yet unspecified) and consider\nthe map ψ : A → B(̂k), where k\u0001 k0 ⊕ k1 ⊕ k2, given by\nψ(a)=\n⎡⎢⎢⎢⎣\nλ(a) \u000b(a)〈d| + δ†(a)D \u000b(a)〈d1| + δ†(a)D1 \u000b(a)〈d2|\n\u000b(a)|d〉 + D∗δ(a) D∗ρ(a)D − \u000b(a)I0 D∗ρ(a)D1 0\n\u000b(a)|d1〉 + D∗1δ(a) D∗1ρ(a)D D∗1ρ(a)D1 − \u000b(a)I1 0\n\u000b(a)|d2〉 0 0 −\u000b(a)I2\n⎤⎥⎥⎥⎦ (4·1)\n(a ∈ A), with Ii denoting Iki , i = 0, 1, 2. Now observe that ψ can also be written in the form\nψ(a) =\n[\nλ(a) \u000b(a)〈d˜| + δ†(a)D˜\n\u000b(a)|d˜〉 + D˜∗δ(a) D˜∗ρ(a)D˜ − \u000b(a)Ik\n]\n, (4·2)\n214 ADAM G. SKALSKI\nwhere\nd˜ =\n⎛⎝ dd1\nd2\n⎞⎠ ∈ k and D˜ = [D D1 0] ∈ B(k; K).\nAs ψ is clearly completely bounded, it generates a weak QS convolution cocycle lψ ∈\nP(A; Ek). It follows from Proposition 4·2 that lψ is a stochastic dilation of lϕ; it remains to\nshow that we can choose the parameters k1, k2, d1, d2 and D1 so that lψ is *-homomorphic.\nTo this end, it suffices to put k1 = K, k2 = C,\nD1 = (I1 − DD∗) 12 , d1 = −De, d2 =\n√\n−(t + ‖e‖2).\nThe above definitions make sense as ‖e‖ \u0001 −t and D is a contraction. It remains then to\ncheck properties (i)–(v) of Proposition 4·3. First note that\nD˜ D˜∗ = DD∗ + I1 − DD∗ = I1,\nwhich implies that conditions (i), (iii) and (v) are satisfied (one can easily check that D˜∗ D˜\nis a selfadjoint projection). Further we obtain (ii):\nD˜d˜ = D(I0 − D∗ D) 12 e − (I1 − DD∗) 12 De = 0.\nFinally (iv) follows since\n‖d˜‖2 = ‖(I0 − D∗ D)1\/2e‖2 + ‖De‖2 − (t + ‖e‖2) = −t.\nThis completes the proof.\nIf l is unital and the Hilbert space dimensions of K and Ran(IK − DD∗) coincide, then j\nmay be chosen to be unital, with k1 = K and k2 = {0} in the above.\n5. Stinespring theorem for QS convolution cocycles\nAs the previous section was a variation on the theme of [9], this one addresses the con-\nvolution counterpart of the problem considered in [8] for standard QS cocycles. We shall\nshow (in Theorem 5·3) that each Markov-regular, completely positive, contractive QS con-\nvolution cocycle has a Stinespring-like decomposition in terms of a *-homomorphic cocycle\nperturbed by a contractive process.\nFirst we need some remarks on QS differential equations of the type:\ndWt = Ft( Îk ⊗ Wt) d\tt , W0 = IF, (5·1)\nwhere F ∈ P(̂k \u0003 E) is a bounded process. We say that W is a weak solution of the above\nequation if for all f, g ∈ S and t \u0002 0\n〈ε( f ), (Wt − IF)ε(g)〉 =\n∫ t\n0\n〈 fˆ (s) ⊗ ε( f ), Fs( Îk ⊗ Ws)(gˆ(s) ⊗ ε(g))〉ds.\nThe solution of the above equation is given by the iteration procedure:\nX 0t = IF, X 1t =\n∫ t\n0\nFs\n(\nÎk ⊗ X 0s\n)\nd\ts, . . . , Xn+1t =\n∫ t\n0\nFs\n(\nÎk ⊗ Xns\n)\nd\ts, . . .\nWtε( f )\u0001\n∞∑\nn=0\nXnt ε( f ).\nCompletely positive QS convolution cocycles 215\nSufficient conditions for the above heuristics to be justified are that F is strongly measurable\nand has locally uniform bounds; this is also sufficient for the uniqueness of strongly regular\nstrong solutions of the equation ([8, proposition 3·1]). These conditions are clearly satisfied\nwhen\nFs =\n(\nidB(̂k) ⊗ ls\n)\n(T ), s \u0002 0,\nwhere l is a Markov-regular, CPC QS convolution cocycle and T ∈ B(̂k) ⊗ A.\nNow let j be a *-homomorphic QS convolution cocycle of the form lϕ , where ϕ ∈\nC B(A; B(̂k)), and let T ∈ B(̂k) ⊗ A. Assume that W ∈ P(E) is a bounded solution to\nthe equation\ndWt =\n(\nidB(̂k) ⊗ jt\n)\n(T )( Îk ⊗ Wt) d\tt , W0 = IF. (5·2)\nWe shall identify sufficient conditions for W to be a contractive process later. The next\nquestion to be addressed is: when can we expect a process k ∈ P(A; E) defined by\nkt(a) = jt(a)Wt , a ∈ A, t \u0002 0,\nto be a Markov-regular QS convolution cocycle?\nThe quantum Itoˆ formula yields\n〈ε( f ), kt(a)ε(g)〉 = 〈 jt(a∗)ε( f ), Wtε(g)〉\n= \u000b(a)〈ε( f ), ε(g)〉\n+\n∫ t\n0\nds(〈 j˜s( Îk ⊗ a∗)( fˆ (s) ⊗ ε( f )), j˜s(T )W˜s(gˆ(s) ⊗ ε(g))〉\n+ 〈 j˜s(φ(a∗))( fˆ (s) ⊗ ε( f )), W˜s(gˆ(s) ⊗ ε(g))〉\n+ 〈 j˜s(φ(a∗))( fˆ (s) ⊗ ε( f )), (\u0006QS ⊗ IF) j˜s(T )W˜s(gˆ(s) ⊗ ε(g))〉)\n( f, g ∈S, t \u0002 0), where φ = RB(̂k)ϕ, j˜s = (idB(̂k)⊗ js) and W˜s = Îk⊗Ws . Defining analogously\nk˜s = (idB(̂k) ⊗ ks) we see that the above equation may be written as\n〈ε( f ), kt(a)ε(g)〉 = \u000b(a)〈ε( f ), ε(g)〉\n+\n∫ t\n0\nds(〈 fˆ (s) ⊗ ε( f ), k˜s(( Îk ⊗ a)T + φ(a) + φ(a)(\u0006QS ⊗ 1A)T )(gˆ(s) ⊗ ε(g))〉).\nThe process k is equal to lψ for some ψ ∈ C B(A; B(̂k)) if and only if ψ˜\u0001 (ψ ⊗ idA) ◦\u0006\nis given by\na \u0006−→ ( Îk ⊗ a)T + φ(a) + φ(a)(\u0006QS ⊗ 1A)T . (5·3)\nNote that we need to work with the left version of the map R introduced in (2·1) because\nof the tensor flip in the definition of the coalgebraic QS differential equation (2·2). Let\nτ = (idB(̂k) ⊗ \u000b)(T ) ∈ B(̂k). Then (5·3) implies that\nψ(a) = \u000b(a)τ + ϕ(a)(1 + \u0006QSτ) (5·4)\nand so\nψ˜(a) = τ ⊗ a + φ(a) + φ(a)(\u0006QSτ ⊗ 1A). (5·5)\nComparing (5·3) with (5·5) yields\n( Îk ⊗ a)T + φ(a)(\u0006QS ⊗ 1A)T = τ ⊗ a + φ(a)(\u0006QSτ ⊗ 1A). (5·6)\n216 ADAM G. SKALSKI\nIf T = τ ⊗ 1A then this condition is automatically satisfied. If j is unital, then T = τ ⊗ 1A\nis also necessary for (5·6) to hold: put a = 1A and use φ(1A) = 0.\nObserve that when T = τ ⊗ 1A the equation (5·2) takes the simple form\ndWt = (τ ⊗ Ut Wt)d\tt , W0 = IF, (5·7)\nwith Ut = jt(1). In this case the condition on τ assuring contractivity of W is also particu-\nlarly simple.\nTHEOREM 5·1. Let j = lϕ where ϕ ∈ C B(A; B(̂k)) and A is a C∗-bialgebra. Suppose\nthat j is *-homomorphic and τ ∈ B(̂k) satisfies the condition\nτ + τ ∗ + τ ∗\u0006QSτ \u0001 0. (5·8)\nThen the equation (5·7), with Ut\u0001 jt(1), has a unique contractive strong solution W ∈ P(E)\n(contractive means that each Wt is a contraction). Moreover the process W ∗t jt(·)Wt is equal\nto lθ , where\nθ(a) = \u000b(a)(τ ∗ + τ + τ ∗\u0006QSτ) + ( Îk + τ ∗\u0006QS)ϕ(a)( Îk + \u0006QSτ), a ∈ A.\nProof. The discussion before the theorem shows that the equation (5·7) has a unique\nstrongly regular strong solution W ∈ P(E). The Itoˆ formula yields, for u = ∑ki=1 λiε( fi ),\nk ∈ N, λ1, . . . , λk ∈ C, f1, . . . , fk ∈ S,\n〈Wt u, Wt u〉 − 〈u, u〉 =\nk∑\ni, j=1\nλiλ j\n∫ t\n0\nds(〈 fˆi(s) ⊗ Wsε( fi), τ fˆ j (s) ⊗ Us Wsε( f j )〉\n+ 〈τ fˆi (s) ⊗ Us Wsε( fi), fˆ j (s) ⊗ Wsε( f j )〉\n+ 〈τ fˆi (s) ⊗ Us Wsε( fi),\u0006QSτ fˆ j (s) ⊗ Us Wsε( f j )〉).\nAs Us = js(1) and j is *-homomorphic, each Us is a projection. Therefore putting x(s) =∑k\ni=1 λi fˆi (s) ⊗ Us Wsε( fi), s ∈ [0, t], yields\n〈Wt u, Wt u〉 − 〈u, u〉 =\n∫ t\n0\nds〈x(s), ((τ + τ ∗ + τ ∗\u0006QSτ) ⊗ IF)x(s)〉 \u0001 0.\nIt follows that W is contractive.\nThe proof of the second part of the theorem is a combination of the considerations before\nits formulation and one more application of the Itoˆ formula. Again let f, g ∈ S, t \u0002 0, a ∈ A\nand T = τ ⊗ 1A, let j˜ , k˜, W˜ and ψ be defined as in the discussion before the theorem and\nset ψ˜ = (ψ ⊗ idA) ◦ \u0006. Then\n〈ε( f ), W ∗t jt(a)Wtε(g)〉 = 〈Wtε( f ), jt(a)Wtε(g)〉\n= \u000b(a)〈ε( f ), ε(g)〉\n+\n∫ t\n0\nds(〈W˜s( fˆ (s) ⊗ ε( f )), k˜s(ψ˜(a))(gˆ(s) ⊗ ε(g))〉\n+ 〈 j˜s(T )W˜s( fˆ (s) ⊗ ε( f )), j˜s( Îk ⊗ a)W˜s(gˆ(s) ⊗ ε(g))〉\n+ 〈 j˜s(T )W˜s( fˆ (s)⊗ ε( f )), (\u0006QS ⊗ IF)k˜s(ψ˜(a))(gˆ(s)⊗ ε(g))〉).\nFinally, (5·4) yields\n〈ε( f ), W ∗t jt(a)Wtε(g)〉 = \u000b(a)〈ε( f ), ε(g)〉\n+\n∫ t\n0\nds〈 fˆ (s) ⊗ ε( f ), W˜ ∗s j˜s(θ˜(a))W˜s(gˆ(s) ⊗ ε(g))〉.\nwhere θ˜ = (θ ⊗ idA) ◦ \u0006. This completes the proof.\nCompletely positive QS convolution cocycles 217\nFor each t \u0002 0 denote the orthogonal projection fromF ontoF[t,∞[ by Pk,[t,∞[. The follow-\ning result may be proved by differentiation, as with its predecessor for standard QS cocycles,\n[8, lemma 4·2].\nPROPOSITION 5·2. Let k be an orthogonal direct sum of Hilbert spaces: k0 ⊕ k1, let ϕ ∈\nC B(A; B(̂k0)) and ψ ∈ C B(A; B(̂k)) and let k0 = lϕ ∈ P(A; Ek0) and k = lψ ∈ P(A; Ek)\nbe the respective weak QS convolution cocycles. Then\nkt(a) = k0t (a) \u0003 Pk1,[t,∞[, a ∈ A, t \u0002 0,\nif and only if\nψ(a) =\n[\nϕ(a) 0\n0 −\u000b(a)I1\n]\n, a ∈ A,\nwhere I1 = Ik1 .\nWe are ready for the main theorem of this section.\nTHEOREM 5·3. Let k ∈P(A; Ek0) be a Markov-regular CPC QS convolution cocycle\non a C∗-bialgebra A. Then there exists another Hilbert space k1, a Markov-regular,\n*-homomorphic QS convolution cocycle j ∈ P(A; Ek), where k\u0001 k0 ⊕k1, and a contractive\nprocess W ∈ P(Ek), such that\nk˜t(a) = W ∗t jt(a)Wt , t \u0002 0, a ∈ A,\nwhere k˜t(a) \u0001 kt(a) ⊗ Pk1,[t,∞[. The process W may be chosen so that it satisfies the QS\ndifferential equation\ndWt = (τ ⊗ Ut Wt)d\tt , W0 = IFk (5·9)\nfor some τ ∈ B(kˆ) in which U ∈ P(Ek) is the projection-valued process given by Ut = jt(1),\nt \u0002 0.\nProof. Let ϕ ∈ C B(A; B(̂k)) be the stochastic generator of k (so that k = lϕ) and let\n(K, ρ, D, ξ, d, e, t) be an associated tuple, as in Theorem 3·3. Set k1 = K and define\nθ : A → B(̂k) by\nθ(a) =\n⎡⎣λ(a) − t\u000b(a) 0 δ†(a)0 −\u000b(a)I0 0\nδ(a) 0 ρ(a) − \u000b(a)I1\n⎤⎦ , a ∈ A,\nwhere Ii denotes Iki , i = 0, 1 and δ is the (ρ, \u000b)-derivation a \u0006→ (ρ(a) − \u000b(a)Ik)|ξ〉. The\nmap θ is completely bounded and as such generates a Markov-regular weak QS convolu-\ntion cocycle j = lθ ∈P(A; Ek). It is easily checked that θ satisfies the structure relations of\nTheorem 2·7, so j is *-homomorphic. Now choose any contraction B ∈ B(k1; k0) and define\nτ =\n⎡⎢⎣\n1\n2 t 〈ξ | 0\n0 −I0 B\n0 D −I1\n⎤⎥⎦ ∈ B(̂k).\nThen\nτ ∗ + τ + τ ∗\u0006QSτ =\n⎡⎢⎣ t 〈ξ | 0|ξ〉 D∗D − I0 0\n0 0 B∗ B − I1\n⎤⎥⎦ \u0001 0,\nas B is a contraction, and ϕ(1) \u0001 0 (see (3·6)).\n218 ADAM G. SKALSKI\nTheorem 5·1 yields the existence of a contractive process W ∈ P(Ek) satisfying the QS\ndifferential equation (5·9) and shows that the process l ∈ P(A; Ek) given by\nlt(a) = W ∗t jt(a)Wt , t \u0002 0, a ∈ A,\nis equal to lψ where ψ : A → B(kˆ) is defined by:\nψ(a) = \u000b(a)(τ ∗ + τ + τ ∗\u0006QSτ) + (1 + τ ∗\u0006QS)θ(a)(1 + \u0006QSτ)\n= \u000b(a)\n⎡⎣ t 〈ξ | 0|ξ〉 D∗ D − I0 0\n0 0 B∗ B − I1\n⎤⎦\n+\n⎡⎣1 0 00 0 D∗\n0 B∗ 0\n⎤⎦ ·\n⎡⎣λ(a) − t\u000b(a) 0 δ†(a)0 −\u000b(a)I0 0\nδ(a) 0 ρ(a) − \u000b(a)I1\n⎤⎦ ·\n⎡⎣1 0 00 0 B\n0 D 0\n⎤⎦\n= \u000b(a)\n⎡⎣ t 〈ξ | 0|ξ〉 D∗ D − I0 0\n0 0 B∗ B − I1\n⎤⎦\n+\n⎡⎣λ(a) − t\u000b(a) δ†(a)D 0D∗δ(a) D∗ρ(a)D − \u000b(a)D∗D 0\n0 0 −\u000b(a)B∗B\n⎤⎦\n=\n⎡⎣ λ(a) δ†(a)D + \u000b(a)〈ξ | 0D∗δ(a) + \u000b(a)|ξ〉 D∗ρ(a)D − \u000b(a)I0 0\n0 0 −\u000b(a)I1\n⎤⎦ = [ϕ(a) 00 −\u000b(a)I1\n]\n.\nApplication of Proposition 5·2 now completes the proof.\nAcknowledgements. The author would like to express his gratitude to Martin Lindsay\nfor suggesting the problem considered in this paper and for generous comments improving\nits final form. The work was partially supported by the Polish KBN Research Grant 2P03A\n03024.\nREFERENCES\n[1] L. ACCARDI. On the quantum Feynman–Kac formula. Rend. Sem. Mat. Fis. Milano 48 (1978), 135–\n180.\n[2] V. P. BELAVKIN. Quantum stochastic positive evolutions: characterization, construction, dilation.\nComm. Math. Phys. 184 (1997), no. 3, 533–566.\n[3] W. R. BLOOM and H. HEYER. Harmonic Analysis of Probability Measures on Hypergroups. de\nGruyter Studies in Mathematics, 20 (Walter de Gruyter & Co., 1995).\n[4] E. G. EFFROS and Z. J. RUAN. Operator Spaces (Oxford University Press, 2000).\n[5] YU. CHAPOVSKY and L. VAINERMAN. Compact quantum hypergroups. J. Operator Theory 41\n(1999), no. 2, 261–289.\n[6] U. FRANZ. Le´vy processes on quantum groups and dual groups. In Quantum Independent Increment\nProcesses, Vol. II: Structure of Quantum Le´vy Processes, Classical Probability and Physics, eds. U.\nFranz and M. Schu¨rmann. Lecture Notes in Math. 1866 (Springer-Verlag, 2005).\n[7] U. FRANZ and M. SCHU¨RMANN. Le´vy processes on quantum hypergroups. In Infinite Dimensional\nHarmonic Analysis, eds. H. Heyer, T. Hirai and N. Obata (Gra¨bner, 2000), pp. 93–114.\n[8] D. GOSWAMI, J. M. LINDSAY and S. J. WILLS. A stochastic Stinespring theorem, Math. Ann. 319\n(2001), no. 4, 647–673.\n[9] D. GOSWAMI, J. M. LINDSAY, K. B. SINHA and S. J. WILLS. Dilation of Markovian cocycles on a\nvon Neumann algebra. Pacific J. Math. 211 (2003), 221–247.\n[10] A. A. KALYUZHNYI. Conditional expectations on compact quantum groups and new examples of\nquantum hypergroups. Methods Funct. Anal. Topology 7 (2001), no. 4, 49–68.\nCompletely positive QS convolution cocycles 219\n[11] A. A. KALYUZHNYI and YU. A. CHAPOVSKY. A factorization of conditional expectations on Kac\nalgebras and quantum double coset hypergroups. Ukraı¨n. Mat. Zh. 55 (2003), no. 12, 1669–1677;\ntranslation in Ukrainian Math. J. 55 (2003), no. 12, 1994–2005.\n[12] J. M. LINDSAY. Quantum stochastic analysis – an introduction. In Quantum Independent Incre-\nment Processes, Vol. I: From Classical Probability to Quantum Stochastics, eds. U. Franz and M.\nSchu¨rmann. Lecture Notes in Math. 1865 (Springer-Verlag, 2005).\n[13] J. M. LINDSAY and K. R. PARTHASARATHY. On the generators of quantum stochastic flows.\nJ. Funct. Anal. 158 (1998), 521–549.\n[14] J. M. LINDSAY and A. G. SKALSKI. Quantum stochastic convolution cocycles I. Ann. Inst. H. Poin-\ncare´ Probab. Statist. 41 (2005), no. 3 (En hommage a` Paul–Andre´ Meyer), 581–604.\n[15] J. M. LINDSAY and A. G. SKALSKI. Quantum stochastic convolution cocycles—algebraic and C∗-\nalgebraic. Banach Center Publ. 73 (2006), 313–324.\n[16] J. M. LINDSAY and A. G. SKALSKI. On quantum stochastic differential equations. J. Math. Anal.\nAppl. 330 (2007), no. 2, 1093–1114.\n[17] J. M. LINDSAY and A. G. SKALSKI. Quantum stochastic convolution cocycles II, preprint.\n[18] J. M. LINDSAY and S. J. WILLS. Existence, positivity and contractivity for quantum stochastic flows\nwith infinite dimensional noise. Probab. Theory Related Fields 116 (2000), 505–543.\n[19] J. M. LINDSAY and S. J. WILLS. Markovian cocycles on operator algebras, adapted to a Fock filtra-\ntion. J. Funct. Anal. 178 (2000), no. 2, 269–305.\n[20] J. M. LINDSAY and S. J. WILLS. Existence of Feller cocycles on a C∗-algebra. Bull. London Math.\nSoc. 33 (2001), no. 5, 613–621.\n[21] J. M. LINDSAY and S. J. WILLS. Homomorphic Feller cocycles on a C∗-algebra. J. London Math.\nSoc. (2) 68 (2003), no. 1, 255–272.\n[22] M. SCHU¨RMANN. White Noise on Bialgebras. Lecture Notes in Math. 1544 (Springer, 1993).\n"}