{"doi":"10.1109\/JQE.2006.871556","coreId":"100685","oai":"oai:epubs.surrey.ac.uk:80","identifiers":["oai:epubs.surrey.ac.uk:80","10.1109\/JQE.2006.871556"],"title":"Spatially resolved femtosecond pump-probe spectroscopy in broad-area semiconductor lasers","authors":["Kaiser, J","Fischer, I","Elsasser, W","Gehrig, E","Hess, O"],"enrichments":{"references":[{"id":666657,"title":"Authorized licensed use limited to: University of Surrey. Downloaded on","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":652795,"title":"Dispersion-induced ultrafast pulse reshaping in 1.55-m InGaAs-InGaAsP optical amplifiers,”","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":666425,"title":"Elsäßer is a Member of the German Physical Society (DPG). He was awarded the Otto-Hahn-Medal","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":663841,"title":"Fischer received the Research Prize of the Adolf-Messer Foundation","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":659771,"title":"Gain dynamics in quantum well lasers and optical amplifiers: an experimental comparison,”","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":663224,"title":"he joined the Institute of Applied Physics,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":665133,"title":"He received the diploma degree in physics from the Technical University of Karlsruhe,","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":658695,"title":"Highly efficient phase conjugation using spatially nondegenerate four-wave mixing in a broad-area laser diode,”","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":655139,"title":"Hot-carrier thermalization induced self-phase modulation in semiconductor traveling wave amplifiers,”","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":662660,"title":"Ingo Fischer was born in Marburg,","authors":[],"date":"1966","doi":null,"raw":null,"cites":null},{"id":657325,"title":"Intraband gain dynamics in bulk semiconductor optical amplifiers: measurements and simulations,”","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":661796,"title":"Mode-locking in broad-area semiconductor lasers enhanced by picosecond-pulse injection,”","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":654099,"title":"Observations of subpicosecond dynamics in GaAlAs laser diodes,”","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":668511,"title":"Ortwin Hess studied physics at the University of Erlangen and the Technical University of Berlin, Germany. He obtained the diploma and Dr.rer.nat degrees from the Technical","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":659125,"title":"Phase-conjugation broad area twin-contact semiconductor laser,”","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":651298,"title":"Probing ultrafast carrier and phonon dynamics in semiconductors,”","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":661152,"title":"Pulse trapping and nonequilibrium spatiospectral wave mixing in broad-area semiconductor lasers,”","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":667789,"title":"She was a Senior Research Associate in the Theoretical Quantum Electronics Group, Deutsches Zentrum für Luft- und Raumfahrt (DLR)","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":667306,"title":"SPATIALLY RESOLVED FEMTOSECOND PUMP-PROBE-SPECTROSCOPY IN BROAD-AREA SEMICONDUCTOR LASERS 371 Edeltraud Gehrig obtained the diploma and Dr.rer.nat degrees in physics at the","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":660416,"title":"Spatio-Temporal Dynamics and Quantum Fluctuations in Semiconductor Lasers.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":657966,"title":"Spatiotemporal dynamics of broad area semiconductor lasers and its characterization,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":656406,"title":"Studies of carrier heating in InGaAs\/AlGaAs strained-layer quantum well diode lasers using a multiple wavelength pump probe technique,”","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":650799,"title":"Subpicosecond gain and index nonlinearities in InGaAsP diode lasers,”","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":655808,"title":"Subpicosecond gain dynamics in InGaAsP optical amplifiers: experiment and theory,”","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":652182,"title":"Subpicosecond pulse amplification in semiconductor laser amplifiers: theory and experiment,”","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":653404,"title":"The dynamics of semiconductor optical amplifiers, modeling and applications,”","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":651544,"title":"Theory of short-pulse gain saturation in semiconductor amplifiers,”","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":665851,"title":"to 1985, he was with the Max-Planck-Institute for Solid State Research,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":668637,"title":"to 1992, he was a Research Associate at Heriot-Watt University, Edinburgh, U.K., and the University of Tucson, Tuscon, AZ, and has a postdoctoral position at the University of Marburg,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":657046,"title":"Ultrafast characteristics of InGaP-InGaAlP laser amplifiers,”","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":654798,"title":"Ultrafast gain dynamics in 1.5 m multiple quantum well amplifiers,”","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":662446,"title":"was born in Stuttgart, Germany, in 1974. He received the diploma degree in 2000 and the Ph.D. degree in 2004 from","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":664457,"title":"Wolfgang Elsäßer (M’94–SM’97) was born in","authors":[],"date":"1954","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-03-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:80<\/identifier><datestamp>\n      2017-10-31T13:56:38Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/80\/<\/dc:relation><dc:title>\n        Spatially resolved femtosecond pump-probe spectroscopy in broad-area semiconductor lasers<\/dc:title><dc:creator>\n        Kaiser, J<\/dc:creator><dc:creator>\n        Fischer, I<\/dc:creator><dc:creator>\n        Elsasser, W<\/dc:creator><dc:creator>\n        Gehrig, E<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:publisher>\n        IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC<\/dc:publisher><dc:date>\n        2006-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/80\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Kaiser, J, Fischer, I, Elsasser, W, Gehrig, E and Hess, O  (2006) Spatially resolved femtosecond pump-probe spectroscopy in broad-area semiconductor lasers   IEEE JOURNAL OF QUANTUM ELECTRONICS, 42 (3-4).  pp. 363-371.      <\/dc:identifier><dc:relation>\n        10.1109\/JQE.2006.871556<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/80\/","10.1109\/JQE.2006.871556"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE JOURNAL OF QUANTUM ELECTRONICS, VOL. 42, NO. 4, APRIL 2006 363\nSpatially Resolved Femtosecond Pump–Probe\nSpectroscopy in Broad-Area Semiconductor Lasers\nJoachim Kaiser, Ingo Fischer, Wolfgang Elsäßer, Senior Member, IEEE, Edeltraud Gehrig, and Ortwin Hess\nAbstract—We investigate the ultrafast gain dynamics in\nbroad-area semiconductor lasers with particular emphasis on\nspatial and spatiotemporal effects. We present a spatially resolved\nfemtosecond pump–probe experiment which allows us to measure\nthe compression and recovery of the gain with 250-fs temporal\nand 15 m spatial resolution. We find a significant spatial varia-\ntion of the gain recovery time across the lateral laser coordinate\nindicating an influence of the extended laser structure on the\nultrafast carrier relaxation. Moreover, we are able to follow the\nspatiotemporal relaxation of the ultrafast spatiospectral gain\nsaturation within the extended semiconductor active area. We\nfind diffusion-like broadening of the locally suppressed gain on\ntwo distinct ultrafast timescales, within several picoseconds and\nseveral tens of picoseconds, resulting from an interplay between\nintraband relaxation, spatial holeburning, and light propagation.\nSupported by microscopic modeling, our results provide insight\ninto the different mechanisms and timescales associated with the\nspatiotemporal carrier dynamics. These findings are essential for\nthe design of laterally extended semiconductor active devices for\nultrafast optical signal processing applications.\nIndex Terms—Broad-area lasers (BALs), carrier dynamics, fem-\ntosecond spectroscopy, gain saturation, pulse propagation, semi-\nconductor lasers, ultrafast optics.\nI. INTRODUCTION\nI N SEMICONDUCTOR lasers and amplifiers, the ultrafastoptical properties are strongly determined by intraband car-\nrier dynamics. This takes place on timescales ranging from sev-\neral picoseconds to femtoseconds and is responsible for signif-\nicant gain and index nonlinearities [1], [2]. Investigating these\nfast or even ultrafast timescales is thus essential for getting a mi-\ncroscopic understanding of the relevant mechanisms that deter-\nmine the interaction between the carrier system and the optical\nfield. In addition, these processes are regarded of high practical\nrelevance for future applications in optical communication and\noptical signal processing with semiconductor optoelectronic de-\nvices. On the one hand, they can generate complicated temporal\nand spectral distortions in propagating ultrafast optical pulses\n[3]–[8]. On the other hand, however, they can also enable the\nrealization of devices for subpicosecond all-optical signal pro-\nManuscript received November 4, 2005; revised January 19, 2006.\nJ. Kaiser and W. Elsäßer are with the Institute of Applied Physics,\nDarmstadt University of Technology, 64289 Darmstadt, Germany (e-mail:\njoachim.kaiser@physik.tu-darmstadt.de; elsaesser@physik.tu-darmstadt.de).\nI. Fischer was with the Institute of Applied Physics, Darmstadt University of\nTechnology, 64289 Darmstadt, Germany. He is now with Department of Ap-\nplied Physics and Photonics, Vrije Universiteit Brussels, 1050 Brussels, Bel-\ngium (e-mail: ingo.fischer@physik.tu-darmstadt.de).\nE. Gehrig and O. Hess are with the Advanced Technology Institute, School\nof Electronics and Physical Sciences, University of Surrey, Guildford, Surrey\nGU2 7XH, U.K. (e-mail: e.gehrig@surrey.ac.uk; o.hess@surrey.ac.uk).\nDigital Object Identifier 10.1109\/JQE.2006.871556\ncessing such as wavelength converters, switches, or demulti-\nplexers which are based on ultrafast cross gain modulation or\nfour-wave mixing [9].\nIn the past, the carrier dynamics has been extensively inves-\ntigated by femtosecond pump–probe methods in semiconductor\namplifiers. Spectral holeburning and carrier heating have been\nidentified as main contributions to the ultrafast nonlinear gain.\nThe associated relaxation of the nonequilibrium carrier distribu-\ntions via carrier–carrier and carrier–phonon scattering has been\nmeasured; the obtained time constants are typically in the range\nof 100–300 fs and 0.4–1 ps for thermalization and temperature\nrelaxation of the carrier systems within the bands, respectively\n[10]–[16].\nHere, we expand the investigations of the ultrafast gain dy-\nnamics on spatially extended devices, investigating broad-area\nsemiconductor lasers (BALs). These are specific edge-emitting\nsemiconductor lasers, in which the lateral extension is widened\nup to typically 100 m to obtain high power output. Previous\ninvestigations of the emission dynamics of these lasers have\nshown, that the spatial extension leads to a complex spatiotem-\nporal dynamics on pico- and nanosecond timescales caused by\nlocal effects and nonlinear interaction between the carriers and\nthe light field [17]. These effects deteriorate the output signif-\nicantly, but the combination of the spatial extension with the\nnonlinear interaction can also be used for novel photonic de-\nvices. Utilization of BALs as, e.g., phase conjugate mirrors by\nspatially extended, nondegenerate four-wave mixing in the gi-\ngahertz range has already been demonstrated [18], [19]. In this\npaper, we experimentally investigate whether the specific laser\nstructure of BALs also has an influence on processes on ultrafast\ntimescales—indications that laser action can influence the intra-\nband relaxation rates have already been found in a comparison\nbetween lasers and amplifiers [20]—and whether, in particular,\nspatial dependencies and spatiotemporal dynamics can be found\nin the pico- and subpicosecond regime.\nSpatially resolved microscopic modeling of broad-area semi-\nconductor devices has shown that combined spatiospectral non-\nlinearities exist and that they play an important role in ultrafast\npulse propagation [21]. They lead to complex spatiotemporal\npulse-shaping and can be used for soliton generation and ul-\ntrafast phase conjugation [22], [23]. Knowledge of spatial de-\npendencies and spatiotemporal effects on ultrafast timescales\nobtained from experimental measurements is thus necessary to\nallow comparison with the results predicted by theoretical mod-\neling. Moreover, it is also essential for the design of future opto-\nelectronic devices for optical signal processing that make use of\nthe ultrafast spatiospectral nonlinearities in spatially extended\nsemiconductor active areas.\n0018-9197\/$20.00 © 2006 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\n364 IEEE JOURNAL OF QUANTUM ELECTRONICS, VOL. 42, NO. 4, APRIL 2006\nThe paper is organized as follows. In Section II, we present\na spatially resolved femtosecond pump–probe setup, which\nallows investigations of the gain dynamics in BALs with\n250-fs temporal and 15- m spatial resolution. In Section III,\nwe present the experimental results, which have been ob-\ntained using two different 100- m BALs. We first examine\nthe ultrafast response of the gain in a conventional collinear\npump–probe measurement and identify the relevant contribu-\ntions to gain saturation and their relaxation rates. Second, we\nmeasure the lateral dependence of the picosecond temperature\nrelaxation of the carrier system, which indeed exhibits a signif-\nicant variation across the laser lateral extension. Third, we use\nspatially separated pump and probe pulses to map the ultrafast\nspatiotemporal relaxation of a locally induced spatiospectral\ngain saturation and the relaxation of the subsequent spatial\nhole. These experimental investigations are complemented by\nmicroscopic modeling of the spatially resolved gain following\na femtosecond pulse excitation, which substantiates the ex-\nperimentally observed interplay between intraband relaxation,\nspatial holeburning and light propagation occurring on different\ntimescales in the picosecond regime and all together being\nrelevant for the spatiotemporal carrier dynamics.\nII. DEVICES AND EXPERIMENTAL SETUP\nThe measurements are performed on two commercial BALs\nfrom Coherent and Spectra Diode Labs (called types “A” and\n“B”). They have an InGaAsP and an AlGaAs quantum-well ac-\ntive area with a gain maximum around 800 nm, laser A emitting\nTM, and laser B TE-polarized light. The stripe width is 100 m\nwith index guiding in both laser types, the lengths of the lasers\nare 1 and 0.75 mm, with threshold currents of 365 and 380 mA,\nrespectively.\nThe experimental setup is based on a conventional two-pulse,\ncross-polarized pump–probe scheme, which is depicted in\nFig. 1. Optical pulses from a Ti:sapphire laser (pulsewidth\n150 fs, repetition rate 75 MHz, wavelength tunable) are\nseparated into pairs of pump and probe pulses at the first\nbeamsplitter. At the second beamsplitter pump and probe beam\nare recombined. They are injected through the low-reflectivity\n(about 5%) front facet and propagate through the laser, which is\noperated close to threshold. The laser is mounted on a heat sink\nthat is actively stabilized to room temperature. The half-wave\nplate in the pump beam rotates the polarization direction of\nthe pump by 90 with respect to the probe beam so that, after\nhaving propagated through the laser, it can be blocked from\nthe probe pulse by the polarizer. The polarization of the pump\npulse is chosen to correspond to the polarization of the laser\nemission. The intensity of the transmitted probe signal, which\nis in addition modulated at 1 kHz by the optical chopper in\nthe probe beam, is detected by a p-i-n photodiode, whose\nsignal is measured by a lock-in amplifier. A translation of the\nretroreflector in the pump beam allows to vary the delay\nbetween pump and probe pulses. Recording the intensity of the\ntransmitted probe signal as function of the delay is a direct\nmeasure of the transient gain response after the excitation of the\ncarrier system with the pump pulse. The pulse energies of the\npump and the probe pulses are 100 and 2 pJ, respectively. The\nFig. 1. Schematic of the experimental pump–probe setup. OSA=optical\nspectrum analyzer, AC=autocorrelator, BS1\/2=beamsplitter, ND=neutral\ndensity attenuator, \u0015=2 =halfwaveplate, pol=polarizer, PIN=photodiode.\nFig. 2. Detailed view of the spatially resolved measurement.\noverall temporal resolution of the setup, considering dispersive\nbroadening and pulse walkoff due to birefringence during\npropagation in the laser, can be estimated to 250 fs.\nThe realization of the spatial resolution is depicted in Fig. 2,\nwhich shows the pulse injection and beam propagation within\nthe laser in more detail. In order to obtain parallel propagating\nbeams, each having a focus inside the BAL, the combination of\nthe beams by the beamsplitter cube is done after focussing of\neach beam. The beam waists of the pump and the probe beam are\nplaced inside the laser at the same -position ( propagation\ndirection). The lateral positioning of the pump beam can be\nperformed by a lateral movement of the laser, the lateral\npositioning of the probe beam with respect to the pump beam\nis achieved by a combined translation of the mirror and\nthe focussing lens in the probe beam, which transforms to\na parallel displacement of the probe beam in -direction by\n. After propagation through the laser, both beams\nare imaged by an imaging lens onto a screen observed by a\nvideocamera, which allows to adjust and control the spatial\npositioning of the beam waists inside the laser. For detection,\nthe screen is removed and the probe beam falls onto the p-i-n\nphotodiode while the pump beam is blocked as described\nabove.\nThe spatial resolution is determined by the beam diameters\ninside the laser and requires a compromise between a small\nbeam waist and a large Rayleigh length. In our case, using\nlenses with 11-mm focal length the beam waist amounts to 10\nm with a Rayleigh length of 250 m. Considering the whole\npassage through the laser, the spatial resolution can, therefore,\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: SPATIALLY RESOLVED FEMTOSECOND PUMP-PROBE-SPECTROSCOPY IN BROAD-AREA SEMICONDUCTOR LASERS 365\nFig. 3. Normalized probe transmission as function of pump–probe delay \u001c for\n788 and 797 nm center wavelength of the pump and probe pulses.\nbe estimated to roughly 15 m, which should, however, be\nmodified due to amplification\/absorption and self-focussing\neffects during propagation in the laser. To experimentally\nmeasure the spatial resolution, we use zero delay pump and\nprobe pulses. Under zero delay, there is a strong reduction of\nthe transmitted probe intensity due to two-photon-absorption\nfrom the probe and the pump pulse [1], [13]. Measuring this\ntwo-photon-absorption contribution as function of the lateral\nseparation of the beams, therefore, maps the spatial overlap\nof the two beams. Doing so, we obtain a Gaussian shaped\nprobe signal reduction as function of with a full-width\nat half-maximum (FWHM) of 24 m, corresponding to a\nconvolution of two beams with an effective FWHM diameter\nof 17 m.\nIII. RESULTS AND DISCUSSION\nA. Ultrafast Gain Compression and Relaxation\nIn this section, we first analyze and discuss the ultrafast\ntransient evolution of the gain following the excitation with\nthe pump pulse without special attention on spatial effects.\nBoth pulses coincide spatially and are injected centrally into\nthe laser. Fig. 3 shows the obtained transmission of the probe\npulse as function of the pump–probe delay in laser A during\nthe first few picoseconds after the excitation. The transmis-\nsion is normalized to the value for , i.e., transmission\nwithout additional excitation. The BAL is biased to 95% of its\nthreshold value. The center wavelengths of the pump and the\nprobe pulses are 788 nm [Fig. 3(a)] and 797 nm [Fig. 3(b)],\nthus corresponding to absorption and amplification within the\nsemiconductor gain spectrum, respectively.\nBoth curves show the typical qualitative time evolution of the\ngain, which is commonly found in semiconductors and which\nwe shall briefly discuss. At there is a strong instanta-\nneous reduction of transmission which is always observed in\npump–probe measurements and is mainly due to two-photon-\nabsorption, when one photon from the pump and one photon\nfrom the probe pulse are absorbed simultaneously. It thus re-\nquires temporal overlap of both pulses and has been used to\ndetermine the zero-delay position. Following the evolution, the\ntransmission signal remains below its undisturbed value, indi-\ncating ultrafast gain compression, which relaxes to a constant\nvalue after several picoseconds. This value results from a net\nchange of the carrier density and is thus positive compared to\nin the absorption regime [Fig. 3(a)], where the pump\npulse generates additional carriers. Correspondingly, in the gain\nregime the net carrier change is negative [Fig. 3(b)]. This change\nin the net carrier density relaxes on a much slower nanosecond\ntimescale, which is not investigated here. Yet it happens faster\nthan the repetition period of the injected pulses of about 13 ns\nso that no carrier accumulation occurs over successive pulses.\nTherefore, for negative delay , we indeed observe the trans-\nmission through the undisturbed gain.\nThe most interesting part of the transmission curves is the gain\ncompression and relaxation during the first few picoseconds\nas it contains the contributions of nonlinearities resulting from\nchanges in the spectral gain distributions such as spectral\nholeburning and carrier heating and their intraband relaxation.\nFor a quantitative analysis of the relaxation a fit with a sum of\ntwo exponential decays has been used, which in contrast to a\nsingle exponential decay is able to fit the data very accurately\nand has been used to fit experimental transmission curves before\n[1]. By several tests, we carefully chose the starting times of the\nfit to avoid an influence of the two-photon-absorption around\nzero delay. The analysis has been performed for a range of\npump–probe wavelengths from 785 to 800 nm. As a result, we\nfind two relaxation times amounting to ps and\nfs. They are independent of the pump–probe\nwavelength, which indicates that the fit works properly and we do\nnothaveasystematicerror,e.g.,due to the two-photon-absorption\ncontribution. The amplitude of the slow exponential decay term\nis negative for each pump–probe wavelength, whereas that of\nthe fast exponential decay term changes sign from positive\nto negative with increasing wavelength. We can conclude that\nthe negative contribution to the gain which relaxes with a time\nconstant of 1.2 ps results from carrier heating. Heating occurs in\nthe absorption as well as in the gain regime by absorption of high\nenergy carriers or by selective removal of low energy carriers,\nrespectively. In contrast, the fast subpicosecond relaxation is\nan indication of spectral holeburning and its thermalization,\nwhich increases the gain at its spectral position in the absorption\nregime and reduces it in the gain regime.\nA corresponding analysis of the experimental data in laser B\nyields a carrier heating relaxation time of ps.\nA fast component indicating spectral holeburning could not be\nextracted with sufficient certainty for this laser. A comparison\nof the obtained values for of 1.2 and 1.4 ps with previous\nexaminations of semiconductor amplifiers shows that the gain\nrelaxation is slightly slower than what was typically found\n(being in the range of 0.6–1 ps) [1], [10], [13], [15]. This\nseems to be in agreement with [20], where an increase of the\ngain relaxation time from 0.7 to 0.9 ps has been found when\nconverting a special quantum well device from an amplifier to\na laser. As a reason for the slowing down of the gain relaxation,\nit has been suggested that additional heating of the carrier\nsystem occurs due to carrier capture from the barrier regions as\na consequence of the enhanced stimulated emission. However,\nas we are dealing with BALs here, other contributions may\noccur. For a further analysis and interpretation of the relevance\nof the spatial extension we investigate the gain relaxation within\nthe BALs with spatial resolution in the following.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\n366 IEEE JOURNAL OF QUANTUM ELECTRONICS, VOL. 42, NO. 4, APRIL 2006\nFig. 4. Carrier heating relaxation time T as function of the lateral position\nx in laser A.\nB. Spatial Dependence of the Intraband Relaxation\nTo measure the lateral dependence of the ultrafast gain\nrelaxation, pump and probe pulses are sent through the laser\ncollinearly as in conventional pump–probe measurements.\nHowever, the lateral extension of each of the beams is confined\nto a small width within the laser during propagation. This\ncommon position of the pump and the probe beam can be\nvaried in lateral direction as described in Section II. As a result,\nwe obtain a set of transmission curves, like those shown in\nthe previous subsection, for different lateral positions within\nthe laser stripe. From these curves, we again determine the\ngain relaxation times. In the following, we concentrate on the\nslower relaxation time , as the uncertainties of are\ntoo large to allow significant statements concerning their spatial\ndependence.\nFig. 4 depicts the slow gain relaxation time evaluated\nfrom the transmission curves as a function of the lateral co-\nordinate across the 100- m broad laser stripe of laser A at\n. For each position, three independent measurements\nhave been performed and averaged to improve the significance\nof the data. We find that there is indeed a measurable spatial vari-\nation of the gain relaxation time. The relaxation is slowest at the\ncenter of the laser and drops from 1.3 to 1.0 ps approaching the\nleft and right side of the active stripe. The continuous line is a\nguide to the eye obtained from a quadratic fit of the data, which\nhas been arbitrarily chosen.\nThese results seem to affirm the effect of an increase of the\ngain relaxation under stimulated emission. Under operation\nclosely below threshold, the BAL exhibits a spatial intensity\nprofile of the light which has a maximum at the center of the\nstripe and decreases to both sides. The measured gain recovery\ntime apparently corresponds to the spatial distribution of the\nlight intensity.\nWe note that other parameters vary across the active area as\nwell. In particular, we expect a laterally varying temperature\ndistribution across the laser stripe. This temperature distribu-\ntion most likely affects the picosecond gain relaxation that is\nassociated with carrier temperature relaxation due to phonon\nscattering. In Fig. 5, it is clearly shown that the spatial varia-\ntion of the relaxation time does not necessarily behave\nas displayed in Fig. 4. Fig. 5 depicts the relaxation time\nFig. 5. Carrier heating relaxation time T as function of the lateral position\nx in laser B.\nas a function of the lateral coordinate , however, for laser B,\nwhich is driven closely below threshold. Here, each data point is\nbased on two independent measurements taken for 794 and\n797 nm. We find a distribution that exhibits the contrary depen-\ndence compared to that in laser A. The relaxation time is fastest\nat the center of the laser and increases by 0.2 ps approaching the\nboundaries at both sides.\nWe would like to note, that as we use several independent\nmeasurements for the data presented in Figs. 4 and 5, the actual\nerror bars are less than 0.2 ps. We find that deviations from the\nfitted curves are remarkably low and in particular much less than\n0.2 ps. So from the experimental data we can conclude that there\nis indeed a spatial dependence of the carrier relaxation within\nthe active stripe. Moreover, considering the different results ob-\ntained in the two lasers, obviously different effects with opposite\nsign influence the carrier temperature relaxation. Depending on\nthe relative strength the resulting combined effect can, there-\nfore, have opposite sign, too. At this point, we cannot clarify,\nwhich effects actually influence the picosecond gain relaxation\nto which amount. We suggest that stimulated emission as well\nas the lattice temperature can play an important role. For the\nlatter mechanism, in particular, we have to consider the different\ntypes of strain in the quantum-well layers in lasers A and B,\nas becomes apparent in the different polarization of the emitted\nlight. Laser A is a tensile-strained InGaAsP device compared\nto the AlGaAs material of laser B. So, an increase of the local\ntemperature could have an opposite effect on the total amount\nof strain, which might explain the observed contrary behavior of\nthe relaxation time in both lasers. To complement the presented\nexperiments, we have also performed measurements of the de-\npendence of the carrier relaxation time on pump current. Here,\nwe also find that at least two opposite contributions seem to be\ninvolved. We find over the whole range of pump current a ten-\ndency of a decrease of the carrier relaxation time. In addition at\npump currents close to but below threshold we find a (then domi-\nnating) increase of the relaxation time. This could be interpreted\nas an indication that heating of the device tends to decrease the\nrelaxation time and another effect (amount of stimulated emis-\nsion or carrier density, which increases most with pump current\nclosely below threshold) has an increasing effect.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: SPATIALLY RESOLVED FEMTOSECOND PUMP-PROBE-SPECTROSCOPY IN BROAD-AREA SEMICONDUCTOR LASERS 367\nFig. 6. Normalized probe transmission as function of delay \u001c and lateral\npump–probe separation \u0001x in laser A.\nYet, we cannot definitely separate the different effects, so fur-\nther experimental and theoretical investigations will be neces-\nsary, in particular of the carrier–phonon interaction in these de-\nvices, which is mainly responsible for relaxation. Never-\ntheless, the results show that the ultrafast gain recovery due to\nintraband carrier relaxation is actually not alone a material prop-\nerty but is significantly influenced by the device operation. The\nresults reveal that a spatial dependence of the picosecond gain\nrelaxation indeed occurs. This will affect ultrafast spatiotem-\nporal pulse propagation or four-wave mixing in spatially ex-\ntended semiconductor active areas and has to be taken into ac-\ncount in modeling and design of devices for ultrafast optical\nsignal processing. As mechanisms of opposite effect are in-\nvolved, experimental measurements of the relaxation behavior\nare indispensable and can serve as input for modeling of the spa-\ntially extended devices.\nC. Spatiotemporal Gain Dynamics\nAs a last step of the investigations of the ultrafast nonlinear\ngain, we spatially separate the pump and the probe beam. By\nvariation of the lateral position of the probe beam we can mea-\nsure the spatiotemporal relaxation of the excitation by the pump\npulse that is done at a fixed position. For the pump pulse we\nhave chosen the center of the active area as reference position.\nFig. 6 shows, in a three-dimensional (3-D) plot, the normalized\ngain as function of pump–probe delay and lateral distance be-\ntween pump and probe beam at nm, thus being in\nthe gain regime. The zero delay has been defined from the cen-\ntral curve . For the other curves the same zero delay\npoint has been used corrected by due to the change of the\nlength in the probe beam path (see Fig. 2). We find an ultrafast\nlocal compression and relaxation of the gain following the ex-\ncitation, which for exhibits the features discussed in\nSection III-A indicating the occurrence of spectral holeburning\nand carrier heating. In addition, in this plot we clearly see the\nFig. 7. Evolution of the spatial width of the probe signal reduction as function\nof delay \u001c obtained from the experimental data shown in Fig. 6.\nlocal character of the spectral nonlinearities. We thus directly\nmap simultaneous spatiospectral holeburning and spatiospec-\ntral carrier heating. Due to the different timescales for spec-\ntral (intraband) and spatial relaxation, the spatiospectrally re-\nduced gain relaxes into a purely spatial hole. The spatial profile\nafter 5 ps shows the spectral hole created by carrier depletion\ndue to the injected pulse. In contrast to the spectral relaxation,\nthe subsequent relaxation of the spatial hole by carrier diffusion\nand intraband relaxation is expected to happen on much slower\ntimescales, which will be discussed below.\nFig. 7 depicts the width of the dip in the normalized spa-\ntial gain depending on . By this analysis of the spatial pro-\nfile we find that the width of the dip at is 24 m. In-\nterestingly, the width increases continuously during the ultra-\nfast relaxation within the first few picoseconds and amounts to\n33 m for the spatial hole after 5 ps. Thus, we actually find,\nin addition to the temporal relaxation, a spatial relaxation of\nthe gain compression on the timescale of a few picoseconds,\nwhich of course cannot be explained by the much slower car-\nrier diffusion occurring in the nanosecond regime. Obviously,\nthe intraband spectral relaxation of the created spatiospectral\nhole and the subsequent spatiospectral carrier heating occurs\non the fastest timescale at the center of the excitation, where\nthe deviation from the quasi-equilibrium distribution is highest,\nand increasingly slower toward the sides. Another influence on\nthe observed ultrafast spatial broadening should result from the\ntwo-photon contribution in combination with the saturated ex-\ncitation by the pump pulse. For , the spatial profile of the\ndip is, as mentioned before, a convolution of the pump and the\nprobe spatial profiles. In contrast, the width of the measured spa-\ntial hole after ps is a convolution of the probe beam profile\nwith the actual spatial hole which is, however, broadened com-\npared to the pump beam profile because of the saturated gain\nthat flattens the Gaussian profile. During the ultrafast spectral\nrelaxation, this spatial widening due to the nonlinear excitation\nbecomes more and more important, which in effect leads to an\nultrafast broadening of the locally reduced gain. In summary,\nthe ultrafast nonlinear gain exhibits a spatiotemporal relaxation\nthat effectively resembles an ultrafast diffusion-like broadening\nmechanism, but actually results from the interplay between the\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\n368 IEEE JOURNAL OF QUANTUM ELECTRONICS, VOL. 42, NO. 4, APRIL 2006\nFig. 8. Evolution of the spatial width of the gain reduction as function of delay\n\u001c obtained from theoretical modeling.\ntwo-photon contribution at zero-delay, the saturated gain, and\nthe intraband relaxation of the spatiospectral hole into the spa-\ntial hole.\nWe compare the experimental results with results of mi-\ncroscopic modeling. The theoretical description is based on\nspatially resolved Maxwell–Bloch equations that describe the\nspatiotemporal light field and carrier dynamics in spatially\nextended semiconductor lasers [21]. The theory includes in\nparticular counterpropagating light waves, light diffraction, the\nfull polarization dynamics (including dynamic gain saturation\nand induced index dynamics), dynamic self-focusing, carrier\ndiffusion, and scattering. The equations of motion are inte-\ngrated in the lateral and longitudinal direction thereby taking\ninto account the spatially and temporally varying light-matter\ncoupling. The vertical direction enters the equation via effective\nparameters. These are, in particular, the optical confinement\nfactor and the material gain resulting from the vertical epitaxial\nstructure of the device. The latter enters the Bloch equations\nas an effective material gain parameter. A thorough adjustment\nof the material gain to a given experimental device has to be\nrealized by a systematic comparison of theoretical and ex-\nperimental dependencies of output power on injection current\ndensity. This is necessary since the physical properties of a\nsemiconductor laser depend on (often unknown, as in our case)\ndetails of the material and epitaxial structure or may even vary\nfrom device to device.\nIn the simulations, the injection of the pulse is realized via\nthe boundary conditions of the light fields. Similar to the experi-\nments, a 15- m-broad 150-fs-long pulse has been used, injected\ninto a 100- m broad and 1-mm-long BAL. Differently to the ex-\nperiments, no additional probe pulse was simulated, instead the\nspatially resolved gain at the spectral position of the excitation\npulse for different times after the excitation is directly evalu-\nated. This provides the same information as in the experiments,\nwhere the probe pulse is used to measure the instantaneous gain,\nhowever, artifacts resulting from a direct interaction between the\ntwo pulses are missing in the simulation.\nFig. 8 depicts the temporal evolution of the locally suppressed\ngain by a pump pulse analogous to Fig. 7, in this case obtained\nfrom the modeling. A significant broadening of the dip created\nFig. 9. Normalized probe transmission as function of delay \u001c for different\nlateral pump–probe separations\u0001x = 0, 10, 20, 30 \u0016m (a–d) in laser A.\nby the pump pulse in the gain can be found. Within the first 5 ps\nafter the excitation the gain broadens from 17 to 24 m. Though\nthe exact behavior of the spatiotemporal gain relaxation depends\non the injected pulse energy and the pump current, this is an in-\ncrease roughly by the same amount as in the experimental mea-\nsurement of Fig. 7. (Note, that the convolution with the spatially\nextended probe beam is not included here.) From the fact, that\nthe zero-delay dip due to two-photon-absorption is not included\nin the theoretical results, we can conclude that this pump–probe\nspecific artifact is at least not solely responsible for the observed\nultrafast broadening. Even though this effect alone would be\nworth being considered, as in real-world experiments the direct\ninteraction of the two coincident pulses is unavoidable.\nWhat remains after ps can be regarded as a purely spa-\ntial hole in the carrier density. In order to investigate the tem-\nporal evolution of this spatial hole, which is expected to take\nplace on significantly slower timescales, we expand our spa-\ntially resolved pump–probe measurements to longer time win-\ndows and record the probe transmission for a pump–probe delay\nof up to ps. Fig. 9 shows experimentally obtained\nprobe transmission curves as function of the pump–probe delay\nstarting from ps, thus now neglecting the ultrafast evolu-\ntion during the first few picoseconds at nm. To investi-\ngate spatiotemporal effects, four traces have been recorded for\ndifferent lateral pump–probe separations from 0 to 30 m\n[Fig. 9(a)–(d)]. For zero separation, we find a steady increase\nof the probe transmission signal corresponding to a decrease of\nthe spatial hole at its center. At m, the signal in con-\ntrast drops until reaching a minimum value at about ps\nand then increases again. This means that the local carrier den-\nsity first decreases and then starts to build up again. The curve at\n20- m separation shows a similar behavior, but less pronounced\nand with the minimum appearing even later than before. At\nm almost no effect is visible.\nTo get a better understanding of the presented behavior, we\nagain performed numerical simulations of the spatiotemporal\nevolution of the gain after pulse excitation within 70 ps. The\nresults of the simulations are depicted in Fig. 10. They show, as\ncompared to Fig. 9, the relative change of gain in arbitrary units\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: SPATIALLY RESOLVED FEMTOSECOND PUMP-PROBE-SPECTROSCOPY IN BROAD-AREA SEMICONDUCTOR LASERS 369\nFig. 10. Relative change of probe gain as function of delay \u001c for different\nlateral pump–probe separations \u0001x = 0, 10, 20, 30 \u0016m (a–d) obtained from\ntheoretical modeling.\nas function of the time after pulse excitation with a 15- m\nbroad pulse at the center of the BAL. The gain has been eval-\nuated by longitudinal averaging of the spatially dependent gain\nfor each lateral position. Again four curves are plotted for dif-\nferent lateral separations between the position of excitation and\ndetection. The calculated curves qualitatively show a strikingly\nsimilar behavior to the measured curves of Fig. 9. Because of\nthe much better signal-to-noise ratio, the main features are much\nbetter observable than in the experiments. The results show clear\nevidence of a diffusion-like behavior: while at the center of the\ndip the signal steadily increases, it runs through a minimum for\npositions away from the center. The farther away the position\nfrom the center, the later the minimum arrives and the weaker\nit is pronounced. In conclusion, we obviously observe a diffu-\nsion-like relaxation behavior of the spatial hole created by the\npump excitation which happens on a timescale of several ten\npicoseconds. Note, that this is an intermediate timescale slower\nthan the ultrafast intraband relaxation, however much faster than\nthe nanosecond interband relaxation or carrier diffusion. If we\nevaluate the effective diffusion constant from our experimental\nor modeling results, we obtain a value which is by a factor of\nabout 1000, which is too high compared to typical carrier diffu-\nsion constants in semiconductors. This intermediate timescale\nrather corresponds to the typical timescales of light propagation\nwithin the laser. So we conclude that it is in fact the presence of\nthe light propagating internally in the laser in conjunction with\nthe spectral and spatial carrier relaxation, that is responsible\nfor the specific picosecond spatiotemporal carrier relaxation in\nthe BAL. From the simulations, this conclusion is further sup-\nported by the fact that only a model that explicitly takes into ac-\ncount propagation effects can describe the observed behavior,\nwhereas an application of a corresponding longitudinally aver-\naging model, i.e., a meanfield approach of the Maxwell–Bloch\nequations, leads to a spatial hole burning that relaxes on much\nlonger time scales in the nanosecond regime.\nThe interplay of the different timescales in these devices and\nthe occurrence of the picosecond relaxation can be summarized\nas follows. Generally, the dynamics of semiconductor lasers\nis strongly determined by the complex interplay of spatiotem-\nporal interactions occurring on time scales ranging from the\nfemtosecond up to the nanosecond regime. The carrier distri-\nbutions within the bands of the active material as well as the\ninterband polarization describing the dipole coupling between\nevery electron and hole lead to ultrafast carrier scattering and\ndephasing processes. These local interactions are then—via the\ndynamic coupling (i.e., induced emission and absorption pro-\ncesses) to the light fields—transferred to the spatial degree of\nfreedom. During propagation the light pulse induces a dynamic\nspatiospectral hole burning in the charge carrier distributions.\nWhile the relaxation within the bands via carrier–carrier and\ncarrier–phonon processes is very fast (a few hundred femtosec-\nonds), the reestablishment of the spatial carrier distribution due\nto the pump current and spatial carrier transfer occurs in the\nnanosecond regime. The dynamics of the light fields counter-\npropagating in the cavity typically occurs on picosecond time\nscales. The large regime of relevant time scales in combination\nwith the mutual coupling of the physical processes then leads\nto a complex spatiotemporal beam and gain dynamics. In a first\nstep, the spatial hole burnt by the pulse in the spatial carrier dis-\ntribution leads to an intensity-dependent carrier reduction. This\nspatial carrier distribution together with the intensity distribu-\ntion then shapes the spatiotemporal gain available in the next\ntime step. In particular, the laser-internal light experiences the\nhigher carrier densities in the lateral edges. As a consequence,\nthe diffracting light fields may laterally drift to the sides leading\nto a lateral broadening. Together with the reduction of the carrier\ndensity in the next time step this leads to a corresponding lat-\neral broadening of the spatiotemporal gain. As a consequence,\nmediated by the laser-internal light, these changes in the spatial\ncarrier distributions occur on a picosecond time scale.\nWe conclude that the presented picosecond timescale associ-\nated with the fast spatial carrier relaxation has a strong influence\nin particular on the emission properties of BALs. We believe that\nit plays an important role, e.g., for the self-mode-locking phe-\nnomena resulting in a distinct spatiotemporal picosecond emis-\nsion dynamics, which is especially observed in these laterally\nextended devices and is associated with dynamically changing,\ninhomogeneous carrier distributions [17], [24].\nIV. CONCLUSION AND OUTLOOK\nWe have investigated the ultrafast gain dynamics of laterally\nextended (broad-area) semiconductor lasers. We find an ultrafast\ntransient gain reduction and relaxation within a few picoseconds\ndue to intraband carrier dynamics as it is common for semi-\nconductors. The gain response after the excitation shows typ-\nical features of spectral holeburning and carrier heating. In par-\nticular, we find the slower and dominating gain relaxation due\nto thermal carrier relaxation lying in the range of 1.2–1.4 ps,\nwhich is slightly slower than the relaxation typically observed\nin semiconductor amplifiers. Local pump–probe measurements\nreveal in addition a lateral variation of the gain relaxation time,\nwhich can be associated to the lateral intensity and temperature\ndistribution. Moreover, fully spatially resolved measurements\nshow the relaxation of the combined spatiospectrally saturated\ngain into a spatial hole. This relaxation is connected with an ef-\nfective broadening of the spatial profile of the compressed gain\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\n370 IEEE JOURNAL OF QUANTUM ELECTRONICS, VOL. 42, NO. 4, APRIL 2006\nwithin only few picoseconds. We also find a diffusion-like spa-\ntiotemporal relaxation of the spatial hole on a timescale of sev-\neral tens of picoseconds, which results from the coupling of the\ncarrier systems to the propagating light field. Altogether, our\nresults demonstrate that spatial and spatiotemporal effects actu-\nally occur within the ultrafast gain dynamics of these spatially\nextended devices. We expect that the presented first spatially re-\nsolved experiments in combination with microscopic modeling\nwill stimulate further investigations and enhance insight into the\ncomplex spatiospectral carrier dynamics of active semiconduc-\ntors, also with respect to the behavior of future ultrafast photonic\ndevices based on spatially extended active areas.\nREFERENCES\n[1] K. L. Hall, G. Lenz, A. M. Darwish, and E. P. Ippen, “Subpicosecond\ngain and index nonlinearities in InGaAsP diode lasers,” Opt. Commun.,\nvol. 111, pp. 589–612, 1994.\n[2] A. Othonos, “Probing ultrafast carrier and phonon dynamics in semicon-\nductors,” J. Appl. Phys., vol. 83, pp. 1789–1830, 1998.\n[3] G. P. Agrawal and N. A. Olsson, “Self-phase modulation and spectral\nbroadening of optical pulses in semiconductor laser amplifiers,” IEEE J.\nQuantum Electron., vol. 25, no. 11, pp. 2297–2306, Nov. 1989.\n[4] A. Uskov, J. Mørk, and J. Mark, “Theory of short-pulse gain saturation\nin semiconductor amplifiers,” IEEE Photon. Technol. Lett., vol. 4, no. 5,\npp. 443–446, May 1992.\n[5] M. Y. Hong, Y. H. Chang, A. Dienes, J. P. Heritage, and P. J. Delfyett,\n“Subpicosecond pulse amplification in semiconductor laser amplifiers:\ntheory and experiment,” IEEE J. Quantum Electron., vol. 30, no. 4, pp.\n1122–1131, Apr. 1994.\n[6] R. A. Indik, R. Binder, M. Mlejnek, J. V. Moloney, S. Hughes, A. Knorr,\nand S. W. Koch, “Role of plasma cooling, heating, and memory effects\nin subpicosecond pulse propagation in semiconductor amplifiers,” Phys.\nRev. A, vol. 53, pp. 3614–3620, 1996.\n[7] J.-Z. Zhang, J. M. Vazquez, M. Mazilu, A. Miller, and I. Galbraith,\n“Dispersion-induced ultrafast pulse reshaping in 1.55-\u0016m InGaAs-In-\nGaAsP optical amplifiers,” IEEE J. Quantum Electron., vol. 39, no. 11,\npp. 1388–1393, Nov. 2003.\n[8] E. Gehrig, O. Hess, A. Volland, G. Jennemann, I. Fischer, and W.\nElsäßer, “Femtosecond dynamics of active semiconductor waveguides:\nmicroscopic analysis and experimental investigations,” J. Opt. Soc.\nAmer. B, vol. 21, pp. 1638–1646, 2004.\n[9] J. Mørk, M. L. Nielsen, and T. W. Berg, “The dynamics of semiconductor\noptical amplifiers, modeling and applications,” Opt. Photon. News, pp.\n42–48, Jul. 2003.\n[10] M. S. Stix, M. P. Kesler, and E. P. Ippen, “Observations of subpi-\ncosecond dynamics in GaAlAs laser diodes,” Appl. Phys. Lett., vol. 48,\npp. 1722–1724, 1986.\n[11] G. Eisenstein, J. M. Wiesenfeld, M. Wegener, G. Sucha, D. S. Chemla,\nS. Weiss, G. Raybon, and U. Koren, “Ultrafast gain dynamics in 1.5\n\u0016m multiple quantum well amplifiers,” Appl. Phys. Lett., vol. 58, pp.\n158–160, 1991.\n[12] P. J. Delfyett, Y. Silberberg, and G. A. Alphonse, “Hot-carrier thermal-\nization induced self-phase modulation in semiconductor traveling wave\namplifiers,” Appl. Phys. Lett., vol. 59, pp. 10–12, 1991.\n[13] J. Mark and J. Mørk, “Subpicosecond gain dynamics in InGaAsP op-\ntical amplifiers: experiment and theory,” Appl. Phys. Lett., vol. 60, pp.\n2281–2283, 1992.\n[14] C.-K. Sun, H. K. Choi, C. A. Wang, and J. G. Fujimoto, “Studies of\ncarrier heating in InGaAs\/AlGaAs strained-layer quantum well diode\nlasers using a multiple wavelength pump probe technique,” Appl. Phys.\nLett., vol. 62, pp. 747–749, 1993.\n[15] J. A. Tatum, D. L. MacFarlaine, R. C. Bowen, G. Klimeck, and W. R.\nFrensley, “Ultrafast characteristics of InGaP-InGaAlP laser amplifiers,”\nIEEE J. Quantum Electron., vol. 32, no. 4, pp. 664–669, Apr. 1996.\n[16] L. Occhi, Y. Ito, H. Kawaguchi, L. Schares, J. Eckner, and G. Guekos,\n“Intraband gain dynamics in bulk semiconductor optical amplifiers:\nmeasurements and simulations,” IEEE J. Quantum Electron., vol. 38,\nno. 1, pp. 54–60, Jan. 2002.\n[17] T. Burkhard, M. O. Ziegler, I. Fischer, and W. Elsäßer, “Spatiotemporal\ndynamics of broad area semiconductor lasers and its characterization,”\nChaos Soliton Fract., vol. 10, pp. 845–850, 1999.\n[18] P. Kürz, R. Nager, and T. Mukai, “Highly efficient phase conjugation\nusing spatially nondegenerate four-wave mixing in a broad-area laser\ndiode,” Appl. Phys. Lett., vol. 68, pp. 1180–1182, 1996.\n[19] P. P. Vasil’ev and I. H. White, “Phase-conjugation broad area twin-con-\ntact semiconductor laser,” Appl. Phys. Lett., vol. 71, pp. 40–42, 1997.\n[20] N. Tessler, J. Mark, G. Eisenstein, J. Mørk, U. Koren, and C. A. Burrus,\n“Gain dynamics in quantum well lasers and optical amplifiers: an exper-\nimental comparison,” Appl. Phys. Lett., vol. 64, pp. 2050–2052, 1994.\n[21] E. Gehrig and O. Hess, Spatio-Temporal Dynamics and Quantum Fluc-\ntuations in Semiconductor Lasers. Berlin, Germany: Springer-Verlag,\n2003.\n[22] E. Gehrig and O. Hess, “Pulse trapping and nonequilibrium spatiospec-\ntral wave mixing in broad-area semiconductor lasers,” J. Opt. Soc. Amer.\nB, vol. 15, pp. 2861–2867, 1998.\n[23] , “Ultrafast active phase conjugation in broad-area semiconductor\nlaser amplifiers,” J. Opt. Soc. Amer. B, vol. 18, pp. 1036–1040, 2001.\n[24] J. Kaiser, I. Fischer, W. Elsäßer, E. Gehrig, and O. Hess, “Mode-locking\nin broad-area semiconductor lasers enhanced by picosecond-pulse in-\njection,” J. Sel. Topics Quantum Electron., vol. 10, no. 5, pp. 968–973,\nSep.\/Oct. 2004.\nJoachim Kaiser was born in Stuttgart, Germany, in\n1974. He received the diploma degree in 2000 and the\nPh.D. degree in 2004 from Darmstadt University of\nTechnology, Darmstadt, Germany.\nHis main research interests include spatiotemporal\nemission properties and femtosecond spectroscopy of\nbroad-area semiconductor lasers and intensity noise\nproperties of VCSELs and LEDs.\nIngo Fischer was born in Marburg, Germany, in\n1966. He received the diploma and Ph.D. degrees\nin physics from the Philipps University, Marburg,\nGermany, in 1992 and 1995, respectively.\nIn 1995, he joined the Institute of Applied Physics,\nDarmstadt University of Technology, Darmstadt,\nGermany, where his research activities were centered\naround spatial, spectral, and dynamical emission\nproperties of semiconductor lasers. His studies\nconcentrate on nonlinear dynamics, synchronization\nof coupled lasers, VCSEL emission, high-power\nlaser emission, femtosecond spectroscopy and THz generation. He has had\nresearch stays with Air Force Research Laboratories, Albuquerque, NM, in\n1999, with ATR, Kyoto, Japan, in 1999 and 2000, and with UIB, Palma de\nMallorca, Spain, in 2004. Since 2005, he has been with the Vrije Universiteit\nBrussels, Brussels, Belgium.\nDr. Fischer received the Research Prize of the Adolf-Messer Foundation in\n2000 and the first Hassian Cooperation Prize of the Technology Transfer Net-\nwork in 2004.\nWolfgang Elsäßer (M’94–SM’97) was born in Pforzheim, Germany, in 1954.\nHe received the diploma degree in physics from the Technical University of\nKarlsruhe, Karlsruhe, Germany, in 1980, the Ph.D. degree in physics from the\nUniversity Stuttgart, Stuttgart, Germany, in 1984, and the Habilitation degree\nin experimental physics from the Philipps-University Marburg, Marburg, Ger-\nmany, in 1991.\nFrom 1981 to 1985, he was with the Max-Planck-Institute for Solid State Re-\nsearch, Stuttgart, Germany. From 1985 to 1995, he was with Philipps-University\nMarburg. Since 1995, he has been a Full Professor in the Institute for Applied\nPhysics, Darmstadt University of Technology, Darmstadt, Germany. He was on\nsabbatical leave in 1992 with the Ecole Nationale Superieure des Telecommuni-\ncations, Paris, France. His research stays have included Trinity College, Dublin,\nIreland, in 1990, 1996, 1999, and 2000.\nDr. Elsäßer is a Member of the German Physical Society (DPG). He was\nawarded the Otto-Hahn-Medal (1985), the Werner-von-Siemens-Medal (1985),\nthe Rudolf-Kaiser Prize (1991), and the Institute of Electrical Engineers (IEE)\nJ. J. Thomson Premium (1995).\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: SPATIALLY RESOLVED FEMTOSECOND PUMP-PROBE-SPECTROSCOPY IN BROAD-AREA SEMICONDUCTOR LASERS 371\nEdeltraud Gehrig obtained the diploma and\nDr.rer.nat degrees in physics at the University of\nKaiserslautern, Kaiserslautern, Germany, in 1995\nand 1999, respectively.\nShe was a Senior Research Associate in the\nTheoretical Quantum Electronics Group, Deutsches\nZentrum für Luft- und Raumfahrt (DLR) Stuttgart\n(2000–2003), Stuttgart, Germany. Since April 2003,\nshe has been a Senior Research Associate at the\nUniversity of Surrey, Surrey, U.K. Her research\ninterests lie on biophotonic systems, molecular\nmotors, ultrafast nonlinear dynamics, dynamics and control of high power\nsemiconductor lasers and amplifiers, luminescence and quantum-dot lasers.\nOrtwin Hess studied physics at the University of Er-\nlangen and the Technical University of Berlin, Ger-\nmany. He obtained the diploma and Dr.rer.nat degrees\nfrom the Technical University of Berlin, Berlin, Ger-\nmany, in 1990 and 1993, respectively. He recevied the\nHabilitation degree in theoretical physics at the Uni-\nversity of Stuttgart, Stuttgart, Germany, in 1997.\nFrom 1990 to 1992, he was a Research Associate\nat Heriot-Watt University, Edinburgh, U.K., and\nthe University of Tucson, Tuscon, AZ, and has a\npostdoctoral position at the University of Marburg,\nMarburg, Germany (1993–1994). From 1994 to 2003, he was Head of the\nTheoretical Quantum Electronics Group, Institute of Technical Physics of\nDLR, Stuttgart, Germany. He became Adjunct Professor at the University of\nStuttgart in 1998. In 2001, he was an Honorary Professor at Tampere University\nof Technology , Tampere, Finland. He was Visiting Professor at Stanford\nUniversity, Stanford, CA, (1997–1998) and the University of Munich, Munich,\nGermany (2000–2001). Since March 2003, he has held the Chair of Com-\nputational Quantum Electronics, Advanced Technology Institute, University\nof Surrey, Surrey, U.K. His research interests are focussed on the theory and\nmathematical modeling of the ultrafast optics and complex laser dynamics\n(quantum-dot lasers, control of spatiotemporal laser dynamics, ultrafast effects\nin active semiconductor media), nanophotonic materials (quantum dots, pho-\ntonic crystals, synthetic opals, liquid crystals, biomolecules), and biomodeling,\nas well as nanothermodynamics and nanorheology. Together with his research\ngroup, he strives to computationally explore the terahertz-world and nanospace\nof novel advanced technologies in photonics as well as nano- and biomedical\nelectronics.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 06:55 from IEEE Xplore.  Restrictions apply.\n"}