{"doi":"10.1007\/s10584-008-9455-4","coreId":"138579","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3062","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3062","10.1007\/s10584-008-9455-4"],"title":"Preliminary evaluation of the benefits of a participatory regional integrated\nassessment software.","authors":["Holman, Ian P.","Harman, J."],"enrichments":{"references":[{"id":38066071,"title":"Audsley E (2005a) A regional, multi-sectoral and integrated assessment of the impacts of climate and socioeconomic change in the UK: I Methodology. Climatic Change 71: 9-41","authors":[],"date":"2002","doi":"10.1007\/s10584-005-5927-y","raw":"Holman IP, Rounsevell MDA, Shackley S, Harrison PA, Nicholls RJ, Berry PM, Audsley E (2005a) A regional, multi-sectoral and integrated assessment of the impacts of climate and socioeconomic change in the UK: I Methodology. Climatic Change 71: 9-41 Holman IP, Nicholls RJ, Berry PM, Harrison PA, Audsley E, Shackley S, Rounsevell MDA (2005b) A regional, multi-sectoral and integrated assessment of the impacts of climate and socioeconomic change in the UK: II Results. Climatic Change 71: 43-73 Hulme M, Jenkins GJ, Lu X, Turnpenny JR, Mitchell TD, Jones RG, Lowe J, Murphy JM, Hassell D, Boorman P, McDonald R, Hill S (2002) Climate Change Scenarios for the United Kingdom:25 The UKCIP02 Scientific Report. Tyndall Centre for Climate Change Research, School of Environmental Sciences, University of East Anglia, Norwich, UK, 120 pp IPCC (2007) Climate Change 2007: The Physical Scientific Basis. Contribution of Working Group I to the Fourth Assessment Report of the Intergovernment Panel on Climate Change. Cambridge University Press, New York, pp. 996 IPCC (2001) Technical Summary. Climate change 2001: Impacts, Adaptation, and Vulnerability. A Report of Working Group II of Intergovernmental Panel on Climate Change Cambridge University Press, New York, p. 1000 Kasemir B, Schibli D, Stoll S, Jaeger CC (2000) Involving citizens in climate and energy assessments. Environment 42(3): 32-42 Lempert RJ, Schlesinger ME (2000) Robust strategies for abating climate change. Climatic Change 45: 387-401 Lempert RJ, Schlesinger ME (2001) Climate change strategy needs to be robust. Nature 412: 543-545 Merton R (1957) Manifest and Latent Functions in Social Theory and Social Structure. Free Press, Glencoe, Illinois Metroeconomica (2004) Costing the impacts of climate change in the UK: overview of guidelines.","cites":null},{"id":38066076,"title":"Earth (B) 26(7-8): 535-539 Yearley S","authors":[],"date":"1999","doi":null,"raw":"Phys. Chem. Earth (B) 26(7-8): 535-539 Yearley S (1999). Computer models and the public’s understand of science: a case study analysis. Soc Studies Sci 29(6): 845-866 Willows RI, Connell RK (eds.) (2003) Climate adaptation: risk, uncertainty and decisionmaking. UKCIP Technical Report, UKCIP, Oxford28","cites":null},{"id":38066072,"title":"Regional impact assessment of flooding under future climate and socio-economic scenarios for East Anglia and North West England. Climatic Change 90(1-2), 31-55 Nakicenovic","authors":[],"date":"2008","doi":"10.1007\/s10584-008-9449-2","raw":"UKCIP Technical Report. UKCIP, Oxford Mokrech M, Nicholls RJ, Richards JA, Henriques C, Holman IP, Shackley S (2008) Regional impact assessment of flooding under future climate and socio-economic scenarios for East Anglia and North West England. Climatic Change 90(1-2), 31-55 Nakicenovic N, Swart R (eds.) (2000) Special Report on Emissions Scenarios. A Special report of Working Group III of the Intergovernmental Panel on Climate Change. Intergovernmental Panel on Climate Change, Cambridge University Press Cambridge, p. 599 Olsson JA, Andersson L (2007) Possibilities and problems with the use of models as a communication tool in water resource management. Water Resources Management 21(1): 97-11026 Pahl C (2004). Adaptive development and maintenance of user-centric software systems. Information and Software Technology 46: 973-986 Pearson RG, Dawson TP, Berry PM, Harrison PA (2002) SPECIES: A spatial valuation of climate impact on the envelope of species. Ecological Modelling 154(3): 289-300.","cites":null},{"id":38066073,"title":"Software engineering: a practitioner's","authors":[],"date":"2005","doi":null,"raw":"Pressman RS (2005) Software engineering: a practitioner's approach. McGraw-Hill, Boston Richards JA, Mokrech M, Berry PM, Nicholls RJ (2008) Regional assessment of climate change impacts on coastal and fluvial ecosystems and the scope for adaptation. Climatic Change 90(1-2), 141-167 Rounsevell MDA, Annetts JE, Audsley E, Mayr T, Reginster I (2003) Modelling the spatial distribution of agricultural land use at the regional scale. Agriculture, Ecosystems and Environment 95(2-3): 465-479 Science and Policy Associates Inc and ESYS (1996) Proposal for a UK Integrated Climate Change Impacts Assessment. Report prepared for the Department of the Environment and the Environment Agency. Department of the Environment, London, p. 28 Schneider SH (1997) Integrated assessment modelling of global climate change: transparent rationale tool for policy making or opaque screen hiding value-laden assumptions? Environmental Modelling and Assessment 2: 229-248 Shackley S (1998) Introduction to Special Section on the Use of Models in Appraisal and PolicyMaking. Impact Assessment and Project Appraisal 16(2): 81-89.","cites":null},{"id":38066074,"title":"Stakeholder perceptions of climate change impacts at the regional scale: Implications for the effectiveness of regional and local responses.","authors":[],"date":"2002","doi":"10.1080\/09640560220133414","raw":"Shackley S, Deanwood R (2002) Stakeholder perceptions of climate change impacts at the regional scale: Implications for the effectiveness of regional and local responses. Journal of Environmental Planning and Management 45(3): 381-402 Shackley S, Deanwood R (2003) Constructing social futures for climate-change impacts and response studies: building qualitative and quantitative scenarios with the participation of stakeholders.","cites":null},{"id":38066070,"title":"Successful adaptation to climate change across scales.","authors":[],"date":"2005","doi":"10.1016\/j.gloenvcha.2004.12.005","raw":"Adger WN, Arnell NW, Tompkins EL (2005) Successful adaptation to climate change across scales. Global Environmental Change 15: 77-86 Audsley E, Pearn KR, Harrison PA, Berry PM (2008) The impact of future socio-economic and climate changes on agricultural land use and the wider environment in East Anglia and North West England using a metamodel system. Climatic Change 90(1-2), 57-88 Carmichael J, Tansey J, Robinson J (2004) An integrated assessment modelling tool. Global Environmental Change 14: 171-183 Demeritt D, Langdon D (2004) The UK Climate Change Programme and communication with local authorities. Global Environmental Change 14: 325-336 Dempsey R, Fisher A (2005) Consortium for Atlantic Regional Assessment: Information Tools for community adaptation to changes in climate and land use. Risk Analysis 25(6): 1495-1509 Dessai S, Hulme M (2004) Does climate adaptation policy need probabilities. Climate Policy 4: 107-128 DETR (Department for Environment, Transport and the Regions) (2000) Climate change : the UK Programme. HMSO, London, 210pp Dittrich Y, Lindeberg L (2004) How use-oriented development can take place. Information and Software Technology 46: 603-61724 Hanson CE, Palutikof JP, Dlugolecki A, Giannakopoulos C (2006) Bridging the gap between science and the stakeholder: the case of climate change research. Climate Research 31(1): 121-133 Harrison PA, Berry PM, Henriques C, Holman IP (2008) Impacts of socio-economic and climate change scenarios on wetlands: linking water resource and biodiversity meta-models. Climatic Change 90(1-2), 113-139 Henriques C, Holman IP, Audsley E, Pearn K (2008) An interactive multi-scale integrated assessment of future regional water availability for agricultural irrigation in East Anglia and North West England. Climatic Change 90(1-2), 89-111 Holman IP, Rounsevell MDA, Cojacaru G, Shackley S, McLachlan C, Audsley E, Berry PM, Fontaine C, Harrison PA, Henriques C, Mokrech M, Nicholls RJ, Pearn KR, Richards JA (2008) The concepts and development of a participatory regional integrated assessment tool. Climatic Change 90(1-2), 5-30 Holman I.P, de Vries TT (eds.) (2005) Development of a metamodel tool for regional integrated climate change management (RegIS2). Final Report for Project No. CC0362, Department for Environment, Food and Rural Affairs, London.","cites":null},{"id":38066075,"title":"The Use of Integrated Assessment: An Institutional Analysis Perspective. Tyndall Centre for Climate Change Research Working Paper 14. Tyndall Centre,","authors":[],"date":"2002","doi":null,"raw":"Climate Research 24(1): 71-9027 Shackley S, Gough C (2002) The Use of Integrated Assessment: An Institutional Analysis Perspective. Tyndall Centre for Climate Change Research Working Paper 14. Tyndall Centre, Norwich.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-09-01T00:00:00Z","abstract":"This paper provides a preliminary evaluation of the Regional Impact Simulator—a\nuser-friendly, PC-based tool designed with stakeholders for stakeholders wishing\nto assess the effects of climate and\/or socio-economic change on the important\nsectors and resources in the UK at a regional scale, in particular, impacts to\ncoastal and river flooding, agriculture, water resources and biodiversity. While\nintegrated assessments are relatively new, simulators that help stakeholders\nvisualize and think about potential changes in the environment or society at a\nregional scale are very new. An earlier project, RegIS1, was the first local\/\nregional integrated assessment conducted in the UK. It developed a method for\nengaging stakeholders in a “stakeholder-led” integrated assessment process. The\nRegIS2 project developed a simulation tool and followed the same “stakeholder-\nled” principle in designing and testing the tool. The role of stakeholders in\ninforming the design of the simulator is discussed here, as is a stakeholder\nevaluation survey on its success in meeting its objectives. We also reflect on\nthe need and desire of stakeholders to have such a tool. And because the\nSteering Committee – made up of stakeholders – was so invaluable in ensuring the\nusefulness of research outputs, a series of Steering Committee ‘rules’ is\nproposed intending to maximise the benefits of this valuable resource. Finally,\nwe outline how our experience with the ‘Regional Impact Simulator’ serves as a\ntest-bed for further studies of stakeholder-led, regional","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138579.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s10584-008-9455-4","pdfHashValue":"b1902c5f3bd4210e38850c9a7babd389a5aadeeb","publisher":"Springer Science   Business Media","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3062<\/identifier><datestamp>2014-02-10T11:32:14Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Preliminary evaluation of the benefits of a participatory regional integrated\nassessment software.<\/dc:title><dc:creator>Holman, Ian P.<\/dc:creator><dc:creator>Harman, J.<\/dc:creator><dc:description>This paper provides a preliminary evaluation of the Regional Impact Simulator—a\nuser-friendly, PC-based tool designed with stakeholders for stakeholders wishing\nto assess the effects of climate and\/or socio-economic change on the important\nsectors and resources in the UK at a regional scale, in particular, impacts to\ncoastal and river flooding, agriculture, water resources and biodiversity. While\nintegrated assessments are relatively new, simulators that help stakeholders\nvisualize and think about potential changes in the environment or society at a\nregional scale are very new. An earlier project, RegIS1, was the first local\/\nregional integrated assessment conducted in the UK. It developed a method for\nengaging stakeholders in a “stakeholder-led” integrated assessment process. The\nRegIS2 project developed a simulation tool and followed the same “stakeholder-\nled” principle in designing and testing the tool. The role of stakeholders in\ninforming the design of the simulator is discussed here, as is a stakeholder\nevaluation survey on its success in meeting its objectives. We also reflect on\nthe need and desire of stakeholders to have such a tool. And because the\nSteering Committee – made up of stakeholders – was so invaluable in ensuring the\nusefulness of research outputs, a series of Steering Committee ‘rules’ is\nproposed intending to maximise the benefits of this valuable resource. Finally,\nwe outline how our experience with the ‘Regional Impact Simulator’ serves as a\ntest-bed for further studies of stakeholder-led, regional,<\/dc:description><dc:publisher>Springer Science   Business Media<\/dc:publisher><dc:date>2012-05-31T23:08:23Z<\/dc:date><dc:date>2012-05-31T23:08:23Z<\/dc:date><dc:date>2008-09-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>I. P. Holman and J. Harman, Preliminary evaluation of the benefits of a\nparticipatory regional integrated assessment software. Climatic Change, Volume\n90, Numbers 1-2, pp 169-187, September 2008.<\/dc:identifier><dc:identifier>0165-0009<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s10584-008-9455-4<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3062<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0165-0009","issn:0165-0009"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"1Climatic Change, Volume 90, Numbers 1-2, pp 169-187, September 2008.\nPreliminary evaluation of the benefits of a participatory regional integrated\nassessment software\nI.P. Holman1, J. Harman2\n1 Natural Resources Department, School of Applied Sciences, Cranfield University, UK\n2 United Kingdom Climate Impacts Programme (UKCIP), Oxford, UK\nCorresponding author: I.P. Holman\nNatural Resources Department\nCranfield University\nCranfield\nBedford MK43 0ALT\nUnited Kingdom\nTel: +44 (0) 1234 750111\nFax: +44 (0)1234 752970\nEmail: i.holman@cranfield.ac.uk\nAbstract\nThis paper provides a preliminary evaluation of the Regional Impact Simulator - a user-friendly, PC-\nbased tool designed with stakeholders for stakeholders wishing to assess the effects of climate and\/or\nsocio-economic change on the important sectors and resources in the UK at a regional scale, in\nparticular, impacts to coastal and river flooding, agriculture, water resources and biodiversity. While\n2integrated assessments are relatively new, simulators that help stakeholders visualize and think about\npotential changes in the environment or society at a regional scale are very new. An earlier project,\nRegIS1, was the first local\/regional integrated assessment conducted in the UK. It developed a method\nfor engaging stakeholders in a “stakeholder-led” integrated assessment process. The RegIS2 project\ndeveloped a simulation tool and followed the same “stakeholder-led” principle in designing and\ntesting the tool. The role of stakeholders in informing the design of the simulator is discussed here, as\nis a stakeholder evaluation survey on its success in meeting its objectives. We also reflect on the need\nand desire of stakeholders to have such a tool. And because the Steering Committee - made up of\nstakeholders - was so invaluable in ensuring the usefulness of research outputs, a series of Steering\nCommittee ‘rules’ is proposed intending to maximise the benefits of this valuable resource. Finally,\nwe outline how our experience with the ‘Regional Impact Simulator’ serves as a test-bed for further\nstudies of stakeholder-led, regional, integrated assessment.\n1. Introduction\nExpected changes in climate (e.g. Hulme et al., 2002) due to anthropogenic greenhouse gases\nemissions (IPCC 2007) is likely to affect all sectors of society at all scales, ranging from the global to\nthe local. However, these impacts will be in addition to, or concurrent with, continuing socio-\neconomic and political changes (IPCC, 2007; Nakicenovic and Swart, 2000). Climate change impacts\non our changing future therefore need to be evaluated holistically, from multiple perspectives.\n“Integrated assessment” (IA) has been defined by the Intergovernmental Panel on Climate Change as\n“an interdisciplinary process that combines, interprets, and communicates knowledge from diverse\nscientific disciplines from the natural and social sciences to investigate and understand causal\nrelationships within and between complicated systems” (IPCC, 2001).\nThere are two main principles to integrated assessment if it is to enable decision making: (1) integrate\nover a range of relevant disciplines and sectors, and (2) provide new information about how complex\n3real-world systems might behave. As many stakeholders have the responsibility for decisions\nimplementing climate change adaptation policy at the local or regional (sub-national) level, (Shackley\nand Deanwood 2002), DETR (2000, p 138), it is the capacity to synthesize a broad range of\ninformation suited for understanding climate impacts at the regional scale that is greatly needed, a\nview supported by Dessai and Hulme (2004), Turnpenny et al. (2004) and Dempsey and Fisher (2005).\nIt follows therefore that there is a real need for tools that support decision making and policy\ndevelopment at this scale.\nThe UK Climate Impacts Programme (UKCIP) was established by the UK Government in 1997, with\nthe aim of providing a research framework for the integrated assessment of climate change impacts in\nthe UK. UKCIP works with stakeholders to co-ordinate research on how climate change might impact\nat regional and national scales and how stakeholders might adapt to these impacts. To manage\nexpectations, set achievable and acceptable goals and ensure that needs are met, we are seeing that\ndecision making processes on the whole and integrated assessments in particular are broadening the\nscope of multiple perspectives to include the perspectives of stakeholders. UKCIP, for example,\ndirectly involves stakeholders in the research. It is the stakeholders or their partners who commission\nthe research and determine the research agenda. UKCIP provides support and guidance throughout the\nprocess; it provides a bridge between stakeholders, researchers and decision-makers in government\norganisations and business.\nUKCIP supports a range of stakeholder-led and funded studies and partnerships on climate change\nimpacts and adaptation. Studies examining local-scale vulnerability to climate change have been\nundertaken in all regions of England, as well as the Devolved Administrations of Scotland and Wales,\nto encourage organisations within these areas to take notice of the need for climate change adaptation.\nAdditional sectoral studies have been conducted that address climate change impacts and adaptation at\na national level.\n4The structure and mission of UKCIP were developed through a scoping exercise (SPA and ESYS,\n1996). This scoping exercise also suggested that pilot climate impact assessments should include both\nnatural system integrated assessments of climate-induced water changes and their impacts on other\nsectors, as well as a regional integrated assessment on upland land use. These ideas led to the\n‘Regional Climate Change Impact and Response Studies in East Anglia and North West England,’ or\nRegIS1, (Holman et al., 2005 a & b) which was conducted under the umbrella of UKCIP from 1999-\n2001. It assessed local and regional climate change impacts and adaptation options, and cross-sectoral\ninteractions between four major sectors driving landscape change (agriculture, biodiversity, coasts and\nfloodplains, and water resources). RegIS1 was the first regional integrated assessment (IA) in the UK\nand piloted a stakeholder-led approach.\nIn a supporting facilitative role, UKCIP has developed a ‘standardised’ framework for climate impact\nand adaptation research and provides tools to support decision making and policy development at a\nnational-level. Tools include climate scenarios (Hulme et al., 2002), national socio-economic\nscenarios (UKCIP, 2001a), a decision-making framework for adaptation (Willows and Connell, 2003)\nand a costing methodology (Metroeconomica 2004).\nHowever, ‘what-if’ tools, tools that help us think into the future and think about the later consequences\nof our choices today were lacking. RegIS1 did not have a ‘what if’ tool, but demonstrated the need for\nstakeholders to be able to ‘see’ potential cross-sectoral impacts and synthesize information from\ndiverse sources. It highlighted that the complexity of information and the complexity of the models we\nuse to organize it hindered the broad participation of the stakeholder community. The subsequent\nRegIS2 project (Holman and de Vries, 2005) is a response to this. Its aim was - adhering to the\nstakeholder-led approach of RegIS1 - to deliver a heuristic tool (Figure 1) that stakeholders could\ninstall on their own PC’s and use unsupported, as and when required. The resulting Regional Impact\nSimulator (Holman et al., 2008) is the first simulation tool developed for stakeholders by stakeholders\nprovided on the UKCIP website (www.ukcip.org.uk).\n5RegIS1 = Regional Climate Change Impact and Response Studies in East Anglia and North\nWest England\nRegIS2 = Follow-on project to RegIS1, which developed the Regional Impact Simulator\nBeing only the second integrated assessment of the UK at the regional level, this paper considers how\nthe stakeholder-led RegIS2 project has moved IA forward and provides a preliminary evaluation of the\ntool’s success from the perspective of the user community. Scientific insights gained from the tool are\nthe focus of the paper by Mokrech et al. (2008), Audsley et al. (2008), Henriques et al. (2008),\nHarrison et al. (2008) and Richards et al. (2008).\n2. The ending of RegIS1 and beginning of RegIS2\nUpon completion of RegIS1 (Holman et al., 2005 a & b) in June 2001, UKCIP hosted an end-of-\nproject workshop to reflect on the project, and discuss its results and how to further improve integrated\nassessments within UKCIP. The workshop was attended by around forty participants, including\nrepresentatives from the RegIS1 steering committee and research teams, as well as researchers,\nstakeholders and funders from around the UK. Participants were asked specifically to reflect on:\n the use\/ usefulness of the assessment results to stakeholders;\n issues concerning uncertainty\n the user-friendliness of the results;\n outstanding questions that require further research; and\n recommendations for improving future integrated assessments\nFrom a conceptual point of view the stakeholder-led approach within RegIS1 made sense, but did it\nproduce better outcomes? This end-of-project workshop enabled stakeholders to reflect on scientific\ninsights gained about climate change impacts and adaptations at a regional scale, as well as on the\nstakeholder-led approach. Inevitably for RegIS1 - the first such project of its kind - the workshop\nproduced a large number of recommendations (UKCIP, 2001b) for improving future assessments,\n6including requests for modelling techniques that simplify the complexity, so called ‘metamodels’ or\n‘reduced form models’ (Carmichael et al.. 2004). So the RegIS2 project set out to develop these\nmodelling approaches within the simulation tool, as well as further the stakeholder-led approach to\nintegrated assessment. The proceeding discussion of the RegIS2 project focuses on the simulation tool\nwithin the context of the views expressed by stakeholder and funder at the post-RegIS1 workshop\noutlined in UKCIP (2001b). In particular this paper seeks to assess:\n1. the success of the Regional Impact Simulator in meeting its objectives and in addressing the\nneeds of stakeholders;\n2. the potential contribution of the Regional Impact Simulator to stakeholder decision-making\nand learning;\n3. the management of the researcher \/ stakeholder interface within stakeholder-led projects;\n4. the lessons learnt about participatory integrated assessment;\n5. the developments needed for regional integrated assessments in the UK.\n3. Stakeholder evaluation of the Regional Impact Simulator\nThe design and development of the Regional Impact Simulator is described fully in Holman et al.,\n(2008). Of paramount importance, however, was to ensure that the simulator could be used by non-\nscience experts (Kasemir et al., 2000; Hanson et al., 2006). Therefore, an interface that was as intuitive\nas possible was built around the user and usability requirements (Pahl, 2004), not the science. The\nparticipatory design approach (Dittrich and Lindeberg, 2004) provided necessary input from\nstakeholders for interface development on their expectations and requirements (Welp, 2001; Hanson et\nal., 2006) and established (with the Steering Committee) mutually agreed-upon guiding concepts. The\nliterature as well as experiences, from researchers, UKCIP and participating stakeholders alike,\ncontributed to the guiding concepts described below:\nDesign – make it ‘intuitive’ to use and the outputs easy to understand\no The physical layout of the tool (where components are placed relative to others and\nhow the operations are presented) should closely mirror the conceptual model used to\n7think through the operations, i.e.; the Driver-Pressure-State-Impact-Response (or\nDPSIR) components (Holman et al., 2008);\no The slider bars, used to vary input parameters, should be numerically labelled and\nconvey assumptions of the model\/scenario (Schneider, 1997);\no ‘Realistic’ and plausible ranges of values for a given parameter should be used to\ngive guidance on the uncertainty associated with a scenario (Turnpenny et al.. 2004);\no Allow the user to concurrently view and compare graphical output from more than\none model or scenario (Olsson and Andersson, 2007);\no Appeal to a broad range of users, users with different priorities or values, by enabling\nprogressively detailed exploration of the topics (Dempsey and Fisher, 2005);\nSpeed - prevent users from ‘switching off’\no Avoid extensive or prolonged model set-up;\no Provide outputs rapidly;\nScale –provide focus and prevent the use for detailed site analysis\/ policy analysis. While users\nshould be encouraged to study the detailed maps, this output is not suitable for detailed site\nanalysis, nor should it be confused with the policies that would accomplish those outcomes.\no Present principal outputs at a regional scale (aggregated).\no Allow the user to vary input parameters to ’see’ the potential regional changes\n(Response)\nWith these initial guiding concepts and a rough implementation sketch (see Holman et al., 2008,\nand the pre-study stage of Dittrich and Lindeberg, 2004) a series of prototypes were developed to\nplot the evolution of user requirements and functionalities. The interface evolved to three screens,\neach with a different purpose and increasing levels of interaction with the model variables, which\nare described fully in Holman et al. (2008). The screens now provide an ordered hierarchy of user\ninteraction and, importantly, the DPSIR approach to thinking about change:\no The Predefined Scenario Futures screen allows the user to rapidly become familiar\nwith indicators and their sensitivity to the different climate and socio-economic\n8scenarios. The default set of input parameter values for each scenario allows a rapid\nmodel set-up.\no The Exploratory Analysis screen allows the user to explore a scenario in greater\ndetail, by changing the input parameter values used in the models. This enables the\nuser to explore the effects of the widely acknowledged uncertainty in any scenario,\nwhich cannot be defined by a single set of unique values.\no The Influencing the Impacts screen allows the user to test regional adaptation\nresponses to the impacts identified with the Exploratory Analysis screen. The screen\nshows the regional scale outcomes of changes (Response) rather than the policies that\nwould accomplish those outcomes, because the tool is not intended for intervention in\nspecific policy analysis.\n3.1 How successful was Regional Impact Simulator in meeting its objectives and in delivering\nthe needs of stakeholders?\nThe question of what is meant by the utility of a model for stakeholders is extensively debated in the\nliterature (e.g. Shackley. 1998). Merton (1957) first made the distinction between the ‘manifest’ and\n‘latent’ function of models, where the manifest function (does the model provide robust answers?) is\nthe one that appears to be the legitimate explanation of the model’s utility in decision-making.\nHowever, not infrequently there is also a latent function (Does the model provide consensus and\nagreement on the legitimacy of a course of action?) which lies ‘beneath the surface’ (Shackley and\nGough, 2002). However, Olsson and Andersson (2007) state that important conditions for the\nsuccessful use of models as communication tools with stakeholders are credible results, user\nrelevance, user friendliness and transparency.\nFrom a scientific perspective, RegIS2 was successful in developing computationally simpler\nmodelling techniques for integrated assessments, which produce credible results and have provided\nnew understandings (Mokrech et al., 2008; Henriques et al., 2008; Audsley et al., 2008; Harrison et al.,\n92008; Richards et al., 2008). The question asked here, however, is whether the user-friendly interface\nwas successful. Whether the stakeholder community will use the Regional Impact Simulator and the\nRegIS methodology is of paramount interest but this question cannot be answered yet. Simply\nproviding credible, quality information and tools are not enough to ensure that decision makers and\nstakeholders will used them (Dempsey and Fisher 2005). We will only be able to address this latter\nquestion now that the Regional Impact Simulator is freely available to the wider stakeholder\ncommunity through the UK Climate Impacts Programme website (www.ukcip.org.uk) and time to use\nit has elapsed.\nTo provide a preliminary assessment of interface usability, a prototype of the Regional Impact\nSimulator was made available to a group of approximately 60 volunteer stakeholders for external\nevaluation. These stakeholders were affiliated with national Government (8), regional Government (5),\nlocal Government (6), NGO’s (18, ranging from National Park authorities and environmental\nregulators to sustainability fora), charities (5), commercial organizations (11, ranging from water and\npower utilities to consultancies) and academic\/research institutions (6). They came from within the\ntwo study regions, from elsewhere in the UK and from outside the UK.\nThe evaluation process was intended to provide preliminary independent feedback on the design and\nfunctionality of the Regional Impact Simulator, rather than on the numerical values of the output itself.\nAlthough users were obviously expected to install and run the tool on their won PC’s, they were\nspecifically not being asked to say if, for example, the value of the river flow exceeded 95% of the\ntime in catchment X was correct or not- the technical evaluation of the models is described elsewhere\nin the Special Issue, in earlier papers (e.g. Holman et al., 2005b; Rounsevell et al., 2003; Pearson et\nal., 2002) and technical reports (Holman and Loveland, 2001, Holman and de Vries, 2005). Questions\naddressed the design and operation of the interface, the usefulness of the model outputs and potential\nfuture developments (see Appendix). Users were asked to score their answers between 1 (low) and 5\n(high) or to identify strengths and weaknesses. Eleven individuals returned evaluation forms. Their\nfeedback provided a useful provisional metric for determining whether the Regional Impact Simulator\n10\nachieved its aims. Non-responders were also followed up, of which 17 provided explanations – 9 were\ntoo busy to carry out the evaluation within the given time period, 2 felt that the software wasn’t\nrelevant, and 8 had IT difficulties. The latter mostly related to getting the software certified as safe\nand installed on centrally-controlled networked systems, suggesting that such problems may represent\na considerable constraint on both stakeholder participation in similar studies and stakeholder uptake of\ntools. Although not included in the quantitative evaluation exercise, positive verbal feedback has been\nreceived following demonstrations of the tool at seven stakeholder meetings and conferences within\nthe UK.\nThe key metrics of success for the interface of the simulator were:\n1. Was it deemed easy to use and intuitive by users?\n2. Were runtimes considered acceptable by users?\n3. Were the outputs useful to the users (therefore, were the indicators appropriate)?\n3.1.1 Ease of use and intuitiveness of the Interface\nAll bar one of the respondents rated the ease of use\/intuitiveness of the Interface as adequate or better\nthan adequate, although none rated it ‘very easy’ (with an average score from all respondents of 3.5).\nThere was an approximately even distribution of responses to how long it took to understand how to\nuse the Regional Impact Simulator. There was no relationship found between how long it took them to\nfigure out how to use the simulator and whether they felt the design was intuitive. About half used the\nhelp tutorial and half did not (5 used the tutorial while 6 did not). All those who required more than an\nhour to understand the interface used the help tutorial, as did some who required half an hour or less.\nIt is not possible to meet the diverse needs of all stakeholders with one design. Nevertheless, all\nrespondents did report satisfaction with the simulator, encouragement and at least partial affirmation\nfor the hierarchical three-screen layout and design.\n3.1.2 Satisfaction with the model run-time\n11\nDuring the initial design of the Regional Impact Simulator, a target run-time of 1 second was set. The\nfinal run time of 10-20 seconds is longer than this. This was due in part to the finer spatial resolution\nadopted by the flooding metamodel (1 km2 grid) and partly to the reading and writing of files between\nthe many metamodels. The runtime has also been shown (in Holman et al. 2008) to be computer-\ndependent. Nevertheless, all but 2 of the respondents rated the runtime as adequate or better than\nadequate (average score of 3.2). The least satisfied respondent replied that the ‘maximum admissible’\nruntime was 5 seconds. Although a ‘typical’ new PC results in a runtime of less than 20 seconds ( in\nHolman et al. 2008), it can be reduced to around 10 seconds when the biodiversity models are\nexcluded - the last in the cascade of metamodels.\n3.1.3 Appropriateness of the results\nThe hands-off nature of the evaluation exercise, with stakeholders installing and running the software\non their own PC’s, meant that they were free to reflect on the ‘usefulness’ of the tool and its indicators\nwithin the context and remit of their own responsibilities without any possibility of implicit coercion\non the part of the research team or funder, which might arise during a mediated session. While aiming\nto appeal to a broad range of moderately technically-minded users, the Regional Impact Simulator\ncannot produce outputs suitable for all purposes. All users were interested in different specifications,\nspatial boundaries and, in some case, already employed their own standard methodologies. A generic\ntool such as the Regional Impact Simulator cannot hope to meet all expectations and needs.\nNevertheless, the evaluation of the usefulness of the Indicators and results were generally positive,\nwith all respondents rating both the usefulness of the indicators (average score of 3.8) and model\nresults (average score of 3.5) as adequate or better than adequate. Despite the differing spatial\nboundaries of the participating organizations, the value of the outputs could be seen. However, in\nreality it is likely that providing a tool which does not correspond to the boundaries of an\norganization’s remit will limit its usefulness, which is partly reflected in the stakeholder feedback on\nfurther developments (Section 7).\n12\nA simulator able to meet all requirements would require customized versions linked to rather specific\nplans, policies or strategies (Demeritt and Langdon 2004) and the ability to incorporate local\nknowledge useful for interpreting and relating the results ’on the ground’. The extensive range of\nstakeholder needs would preclude customized versions for everyone. Yet for some the case could be\nargued that the investment of time and testing with practitioner stakeholders is well worth trying.\nOverall, comments received following the evaluation suggest that users recognise the potential for the\noutputs of the Regional Impact Simulator to support a range of their activities:\n“We believe that [the Regional Impacts Simulator] has a huge potential to raise awareness of\nthe implications of policy decisions, and therefore guide policy and decision makers down\na more sustainable track”\n“Overall we believe it is a useful tool to demonstrate the linkages and impacts”\n“It's very encouraging to see the potential solutions for many items that are put into the 'too\ndifficult' box.”\n“tool provides a valuable (essential) advocative medium to embed need for adaptation and\nunderpin cross sectoral policy development\/decision making”\n“I fully support the concept behind RegIS [the Regional Impacts Simulator]”.\n4. The potential contribution of the Regional Impact Simulator to stakeholder decision-making\nand learning\nThe Regional Impact Simulator was intended to contribute to stakeholder decision-making and\nlearning by, in the first place, allowing users to visualise the impacts of climate and socio-economic\nchange. It is anticipated that the Regional Impact Simulator helps improve stakeholders’\nunderstanding of climate and socio-economic impacts through visual illustrations on maps and with\ngraphs of how climate and socio-economic scenarios might affect different sectors. Secondly, it\nallows users to explore the drivers of change and their potential impacts to the landscape and to four\nareas of human activity (and decision making) and thereby give a better sense of plausible adaptation\noptions and potential consequential effects. Finally, because there are multiple interactions between\n13\nthe sectors driving landscape change, a tool to help stakeholders understand cross-sectoral issues and\nexplore different perspectives of the same issue is expected to be useful to them in exploring uncertain\nfutures and consequently the implications of their possible decisions in the broader context – a\nregional context.\nThe uncertainties that are associated with a climate change impact assessment are difficult to work\nwith. However, the Regional Impact Simulator makes this task a bit easier by giving reasonable\nboundaries to uncertainty. “Slider bars” (Figure 2) define the range of ‘reasonable’ uncertainty for a\ngiven indicator. (The ‘reasonable range’ is based on expert advice.) The user can then experiment with\nthe slider bar to examine the sensitivities of the system within a reasonable range of uncertainty. A\ntraffic light-based system of colour coding the slider bars was used to differentiate between “credible”\nuncertainty (green, for ‘go’) and more “extreme” uncertainty (yellow, for ‘caution’), possible, but\nsomewhat outside conventional wisdom. For obvious reasons, a user is not permitted to enter the ‘red’\nzone, beyond the range of plausibility. The ability to explore uncertainty with the Simulator is\nexpected to be very useful to decision-makers, especially when considering which adaptation options\nare most viable.\nUKCIP encourages stakeholders and decision-makers to use a range of its tools to identify how they\nmight be impacted by climate change and what they can do to adapt. The Regional Impact Simulator\nis a tool to create and assess management alternatives, and it integrates two tools provided by UKCIP\nalready, the UKCIP02 climate change scenarios (Hulme et al., 2002) and the socio-economic scenarios\n(UKCIP, 2001a; Shackley and Deanwood, 2003), thus maximizing on the affect of familiarity with the\nsubject matter and, therefore, the effort invested on behalf of the user. In fact prior to the Simulator,\nstakeholders had difficulty understanding and using the socio-economic scenarios. Within the\nSimulator, however, it appears that much of the difficulty of understanding how to use socio-economic\nscenarios disappears. It is anticipated the simulator should result in greater use of socio-economic\nscenarios in decision-making and planning.\n14\nAdditionally, the different levels of analysis allowed by the Regional Impact Simulator (Figure 2-4) fit\nwell with other climate impact assessment tools provided by UKCIP. The Risk, Uncertainty and\nDecision-Making Framework (Willows and Connell, 2003) allows for analyses to be undertaken at\nvarying levels of detail. The Simulator can be used within the Risk, Uncertainty and Decision-Making\nFramework to either quickly determine major impacts they should consider, or perform a very detailed\nsensitivity analysis of the uncertainties and adaptation options.\nThe Simulator was developed to enable both ‘top-down’ and ‘bottom-up’ approaches to assessment.\nThe first two screens (see Figure 3: Pre-defined Scenario Futures and Figure 2: Exploratory Analysis)\nfulfil a prediction-oriented ‘top-down’ approach - from global scenarios to impact models. Whereas\nthe ‘bottom-up’ approach which focuses on stakeholder expertise in interpreting the adaptation options\nis delivered with the third screen (see Figure 4: Influencing the Impacts).\nIn considering the use of the Regional Impact Simulator within adaptation frameworks, a broad\ndistinction can be made between its use in informing the implementation of adaptation decisions and\nin building adaptive capacity. Implementing adaptation decisions focuses on avoiding or reducing the\ncumulative impacts of climate change, ensuring that distributional impacts of adaptation are\nminimised and ensuring that adaptive measures taken by one organization or sector do not adversely\nimpact upon others (Adger et al., 2005). While the Regional Impact Simulator can inform many\ndecisions, through spatially displaying the impacts and consequences of regional adaptation responses,\ntwo key areas stand to benefit significantly from this tool. They are in:\n1. informing the integration of adaptation actions and policies across sectors, ensuring that\nadaptation resulting from actions in one sector does not reduce the effectiveness of purposeful\nadaptation in another sector. According to Adger et al., (2005), this remains a key challenge\nin achieving successful adaptation;\n2. searching for robust adaptation strategies (Lempert and Schlesinger, 2001) that are scenario-\nindependent (Dessai and Hulme, 2004) or no-regret, low-regret or win-win strategies\n(Willows and Connell, 2003) i.e.; adaptation responses which will be beneficial (or at worst\n15\nnot detrimental) for all possible future socio-economic development pathways (Lempert and\nSchlesinger, 2000).\nBuilding adaptive capacity increases the ability of individuals, groups or organizations to adapt (Adger\net a,., 2005) and includes communicating climate change information and building awareness of\npotential impacts at an appropriate regional level. Decision support tools, such as the Regional Impact\nSimulator, are tools for analysis and vehicles for communication, training, forecasting and\nexperimentation (Welp, 2001). The Regional Impact Simulator will therefore contribute to the UK\nGovernments objective of a well adapted UK by building the capacity of UK decision-makers to\nunderstand the climate and socio-economic impacts and how these might be reduced by various\nadaptation options. The Regional Impact Simulator will hopefully result in regional scale decision-\nmaking and policy formulation which takes due account of the impacts of climate change.\n5 Lessons learnt on managing stakeholder-led projects\nAn axiomatic principle of stakeholder-led research is that the research results should be useful to\nstakeholders. However, to achieve this desired outcome there are a number of challenging or\nconflicting priorities which have to be managed during the course of any such project. Who are the\nstakeholders? What do they actually want? What can realistically be delivered (within the limits of\nfunding, time and knowledge)? In climate impacts research, the cross-cutting nature of many issues\nmeans that these are potentially of interest to a range of stakeholder groups, such that their breadth of\ninterests and priorities are potentially overwhelming, if not conflicting.\nFundamental to addressing these questions and helping deliver the appropriate outputs of stakeholder-\nled research is a Steering Committee that includes stakeholder representatives. It will depend on\nindividual project (and funder) circumstances as to who is responsible for setting up the Steering\nCommittee – the research group or the funding organization(s). Individual project circumstances will\nalso determine of the range of stakeholders represented - from national to local scale organizations,\n16\ntrade bodies to conservation NGO’s, government departments to agencies, etc. The 10-person Steering\nCommittee of RegIS2 was set up by the research team to have broad representation (note: an\norganization or its representatives may represent more than one category). Represented were:\nNational and regional government-\n national: Department for Environment, Food and Rural Affairs- Defra\n regional: Government Office for the East of England- GO-East\nNational and regional responsibility-\n national: Defra, UKCIP, UK Water Industry Research- UKWIR, English Nature\n regional: GO-East, Environment Agency- Thames and North West region\nrepresentatives)\nSectors-\n agriculture: Defra\n water resources: Environment Agency and UKWIR\n water supply: UK Water Industry Research\n flood management: Environment Agency\n conservation: Defra, English Nature and Environment Agency\nCommercial interests- UK Water Industry Research\nStatutory organizations- English Nature (the government agency which champions the\nconservation of wildlife, geology and wild places in England) and the Environment\nAgency (the Competent Authority under the European Water Framework Directive)\nExternal to the region: Environment Agency- Thames region representative, South East Climate\nChange Partnership and UKCIP\nPolicy focussed: Defra and Government Office for the East Of England\nTechnically focussed: all others\n17\nBased upon the experiences gained through RegIS2 and other stakeholder-led research projects, it is\nalso important to highlight several key guidelines for a Steering Committee within the research\nprocess:\n Members act as filters between the researchers and the stakeholder communities, translating\ndiverse stakeholder desires into clear and consistent guidance as to the needs and priorities\nwhich the research team should aim towards;\n Members contribute advice and suggestions to the debate in order to increase the likelihood\nthat research outputs are “useful” to stakeholders. There are no silent members in a Steering\nCommittee. To avoid retrospective disagreements “silence is taken to mean agreement”.\n Members contribute the experience and knowledge of their organizations to the deliberations,\nwhether this be to the science, policy frameworks, adaptation responses etc. There is a danger\nthat non-technical or non-climate change specialist stakeholders will view themselves as\nhaving nothing to contribute to a research project. ALL member have different, yet important,\ncontributions.\n Priorities will vary across researchers and stakeholders and may need balancing, in particular,\nthe needs of researchers to do cutting edge, publishable, research and the needs of\nstakeholders’ to have pragmatic questions answered which may not require cutting edge\nresearch. Although less problematic in projects funded by stakeholder organizations (as in\nRegIS2), this problem can be particularly acute when research is jointly funded by stakeholder\norganizations and Research Councils, as research quality is the main criterion used by the\nlatter to judge proposals, whereas utility is the main criterion of the former;\n Members will share (e.g., project models, outputs, methodologies etc) with their own\norganisations and networks to road-test and validate approaches.\n Representatives from organizations will be those who can inform model or methodological\ndevelopment, will use a project’s outputs and can promote their use.\nThere is a final responsibility on both sides (Steering Committee and research team members) to be\nopen to, listen to and understand each other’s perspectives. With all of these conditions in place, the\n18\nSteering Committee provides a win-win contribution – the Research Team is given a consistent and\nclear steer as to the direction and needs of the research, the Steering Committee members gain useful\nknowledge for their organization or sector, and the funders can demonstrate useful outputs at the end\nof the project.\n6 Lessons learnt for future participatory IA software development\nSoftware engineering texts (e.g. Pressman, 2005) describe software development as analogous to a\nwaterfall having distinct consecutive phases of problem analysis, specification, design,\nimplementation, testing and release. In the Regional Impact Simulator, not one but multiple models\nwere being developed. So, the object-oriented approach was valuable in allowing software modularity,\nand therefore the ability for different research groups to iteratively develop their models\nautonomously, yet at the same time. However it must be said that the apparent initial success of the\nRegional Impact Simulator is in no small way due to the participatory approach. The interface\ndevelopment benefited greatly from the iterative prototyping process which was informed through the\nearly identification of user needs and progressive researcher-stakeholder feedback, producing a final\ndesign that is both visually appealing and provides easy access to the necessary outputs (Dempsey and\nFisher, 2005).\nOne premise underlying the development of the Regional Impact Simulator was that such a tool\nshould be beneficial to a broad range of stakeholders. One major design issue was therefore how to\naccommodate a broad audience of end users with different needs. The solution was to provide two\nalternative interface screens, predefined scenarios and exploratory analysis, to accommodate users of\ndifferent ability to interact effectively with the modelling framework. The predefined scenarios screen\nallows users with less knowledge of the nuances of scenario construction to still run the model (for a\nlimited set of outcomes). The more advance user is able, through the exploratory analyses screen, to\nvary parameter values through on-screen sliders. Using this part of the system assumes some prior\nknowledge of how the individual sectors operate and interact, as well as some understanding of the\nlimits and credibility of alternative scenarios.\n19\nClearly this tool may be used inappropriately, either inadvertently or deliberately to demonstrate a\nbiased viewpoint, which was a significant concern of some Steering Committee members.\nInappropriate use could manifest itself in two main ways:\n by setting variables unrealistically, which bear no resemblance to the underlying storyline\nbehind a scenario;\n by combining, but not acknowledging, futures (scenarios) that are inconsistent with each\nother e.g. a high emissions climate scenario combined with a ‘sustainability’ socio-economic\nscenario – which erroneously suggests that the high economic activity behind the climate\nscenario is not so detrimental for the environment.\nIt is not possible to prevent inappropriate use without severely restricting the flexibility of the user to\nexplore uncertain futures, which would rather defeat the object. So the interface was designed to\nhighlight ‘credible’ ranges when setting the pressure variable of each model. In addition, when a\nsetting is changed from the default setting, the title “User Defined” appears on the maps and graphs to\nindicate that the settings in use may not be consistent with the scenario selected. Alternatively, the\ntransparency of the tool (Yearley, 1999) allows potentially biased viewpoints to be challenged,\ndissuading the inappropriate use of the tool. By making the tool available in the public domain and by\nrevealing parameter settings and scenario combinations, each can then be independently verified.\n7 Future Developments\nAlthough RegIS2 was only the second regional IA project in the UK, it should not be automatically\nassumed that further research, model development etc is needed. The project evaluation (section 3.1)\ntherefore asked whether or not stakeholders felt it would be useful to develop the Regional Impact\nSimulator further. All respondents supported further development (average score of 4.3) with most\nbeing highly positive (scoring 4 or 5 out of 5). To understand the desired direction of possible future\ndevelopments, the evaluation then asked whether further development should be based on expanding\n20\nor changing the range of sectors simulated within the tool; expanding or changing the regions\nmodelled or extending the tool to provide national coverage. Although a small number of respondents\nfelt that the scope of any further development should be determined by a further consultation exercise\nand therefore did not express a preference, most respondents selected different or additional regions (5\nrespondents) and national coverage (9 respondents). For example:\n“..it is imperative that further support is given to this project, to help develop the product to be\ntruly region, or nation, wide.”\nTwo issues became evident from this element of the evaluation. Firstly, there is a demand for regional\nintegrated assessment. Many of the respondents were in regional or national organizations and could\nsee the benefits of such a tool for their own area. Secondly, despite a perception in favour of regional\nscale outputs, respondents felt that national coverage was also required for decision making with\nregard to climate change impacts and adaptation. This may reflect the small size of the UK and the\nimportance of national institutions such as the regulatory organizations (e.g. Environment Agency,\nEnglish Nature).\n8. Conclusions\nThis article evaluates the participatory design approach to the development of a regional integrated\nassessment tool, the Regional Impact Simulator. The Regional Impact Simulator was designed to\nallow stakeholders to explore for themselves the potential consequences of future climate and socio-\neconomic change in two regions of England. As the first such tool designed for interactive - rather\nthan assisted - stakeholder use in the UK, and perhaps Europe, both model and interface development\nwere developed iteratively – and with on-going involvement and input from the people and\norganizations intended to use it.\n21\nThe two most significant applications of the Regional Impact Simulator are likely to be 1) to inform\nthe integration of adaptation actions and policies across sectors, such that unintentional adaptation\nresulting from actions in one sector does not reduce the effectiveness of purposeful adaptation in\nanother sector, and 2) to explore robust adaptation strategies which are scenario-independent or no-\nregret strategies (i.e.; adaptation responses which will be beneficial for all future scenarios).\nA preliminary independent stakeholder evaluation of the Regional Impact Simulator, prior to releasing\nthe software to the public, indicates that users find that the software is sufficiently easy and intuitive to\nuse, the runtimes are acceptable, the outputs are useful and the Simulator merits further development.\nThe advice and guidance of the project Steering Committee have provided an invaluable contribution\nto the development of the Regional Impact Simulator, and therefore a series of Steering Committee\n‘rules’ are proposed to help future projects gain maximum value from this valuable resource. In\nparticular, a Steering Committee is a filter between the researchers and the many diverse needs of\nstakeholder communities, in order to give clear and consistent guidance to the research team. Its\nmembers contribute the diverse experiences and knowledge of their organizations and ensure that\nresearch outputs are “useful”. It has added value in that it involves people who will take such tools as\nthe Simulator into organizations to use as well as promote their use.\n9. Acknowledgements\nThe Regional Impact Simulator was developed as part of the RegIS2 project (project CC0362), which\nwas funded by the Department for Environment, Food and Rural Affairs, with support from UK Water\nIndustry Research (UKWIR). The advice and guidance of the Steering Committee members from the\nUK Climate Impacts Programme, UKWIR, English Nature, Environment Agency, Government Office\nfor the East Of England, South East Climate Change Partnership, and Defra has provided invaluable\nassistance. The views expressed in this paper are those of the authors and do not necessarily represent\nthe opinion of UKCIP.\n22\nAppendix- Evaluation questionnaire\nEvaluation questions relating to the Regional Impact Simulator\n How intuitive \/ easy to use did you find the Regional Impact Simulator? [1-5; 1= Not very; 3\n= Adequate; 5 = Very easy]\n How long did it take to understand how to use the Regional Impact Simulator? [1 hour+\/ ½\nhour \/ ¼ hour]\n Did you need to use the help tutorial or the worked example? [Yes \/ No]\n Were you happy with the length of time it took to run the models? [1-5; 1= Not very; 3=\nAdequate; 5 = Very happy\n If you thought the models took too long to run, how long should they take?\n What features did you like about the Regional Impact Simulator?\n Are there any ways in which we could make it easier to use?\n What, if anything, did you dislike about the Regional Impact Simulator?\n What other features or functions would you like to have in the Regional Impact Simulator?\nEvaluation questions relating to the modelling\n Which sectors were of interest to you? You may select more than one.[Flooding, Agriculture,\nWater, Biodiversity]\n How useful were the chosen indicators? [1-5; 1= Not very; 3= Adequate; 5 = Very useful]\n How useful were the results of the model? [1-5; 1= Not very; 3= Adequate; 5 = Very useful]\n What other indicators would you like to see?\nEvaluation questions relating to further development\n Do you think it would be useful to develop the Regional Impact Simulator further? [1-5; 1=\nNot very; 3= Perhaps; 5 = Very useful]\n23\n If you think further development would be useful would you like to see (You may tick more\nthan one):\no [More Sectors \/ Different sectors\/ If so, which sectors?]\no [More regions \/ Different regions \/ If so, which regions?]\no [National Coverage]\n Please expand on what you would like to be further developed. Or any other comments\nReferences\nAdger WN, Arnell NW, Tompkins EL (2005) Successful adaptation to climate change across scales.\nGlobal Environmental Change 15: 77-86\nAudsley E , Pearn KR, Harrison PA, Berry PM (2008) The impact of future socio-economic and\nclimate changes on agricultural land use and the wider environment in East Anglia and North\nWest England using a metamodel system. Climatic Change 90(1-2), 57-88\nCarmichael J, Tansey J, Robinson J (2004) An integrated assessment modelling tool. Global\nEnvironmental Change 14: 171-183\nDemeritt D, Langdon D (2004) The UK Climate Change Programme and communication with local\nauthorities. Global Environmental Change 14: 325-336\nDempsey R, Fisher A (2005) Consortium for Atlantic Regional Assessment: Information Tools for\ncommunity adaptation to changes in climate and land use. Risk Analysis 25(6): 1495-1509\nDessai S, Hulme M (2004) Does climate adaptation policy need probabilities. Climate Policy 4: 107-\n128\nDETR (Department for Environment, Transport and the Regions) (2000) Climate change : the UK\nProgramme. HMSO, London, 210pp\nDittrich Y, Lindeberg L (2004) How use-oriented development can take place. Information and\nSoftware Technology 46: 603-617\n24\nHanson CE, Palutikof JP, Dlugolecki A, Giannakopoulos C (2006) Bridging the gap between science\nand the stakeholder: the case of climate change research. Climate Research 31(1): 121-133\nHarrison PA, Berry PM, Henriques C, Holman IP (2008) Impacts of socio-economic and climate\nchange scenarios on wetlands: linking water resource and biodiversity meta-models. Climatic\nChange 90(1-2), 113-139\nHenriques C, Holman IP, Audsley E, Pearn K (2008) An interactive multi-scale integrated assessment\nof future regional water availability for agricultural irrigation in East Anglia and North West\nEngland. Climatic Change 90(1-2), 89-111\nHolman IP, Rounsevell MDA, Cojacaru G, Shackley S, McLachlan C, Audsley E, Berry PM, Fontaine\nC, Harrison PA, Henriques C, Mokrech M, Nicholls RJ, Pearn KR, Richards JA (2008) The\nconcepts and development of a participatory regional integrated assessment tool. Climatic\nChange 90(1-2), 5-30\nHolman I.P, de Vries TT (eds.) (2005) Development of a metamodel tool for regional integrated\nclimate change management (RegIS2). Final Report for Project No. CC0362, Department for\nEnvironment, Food and Rural Affairs, London.\nHolman IP, Loveland PJ (eds.) 2001 Regional Climate Change Impacts in East Anglia and the North\nWest (the RegIS project). Final report of Project No. CC0337, Ministry for Agriculture,\nFisheries and Food, London. (available from www.ukcip.org.uk).\nHolman IP, Rounsevell MDA, Shackley S, Harrison PA, Nicholls RJ, Berry PM, Audsley E (2005a)\nA regional, multi-sectoral and integrated assessment of the impacts of climate and socio-\neconomic change in the UK: I Methodology. Climatic Change 71: 9-41\nHolman IP, Nicholls RJ, Berry PM, Harrison PA, Audsley E, Shackley S, Rounsevell MDA (2005b)\nA regional, multi-sectoral and integrated assessment of the impacts of climate and socio-\neconomic change in the UK: II Results. Climatic Change 71: 43-73\nHulme M, Jenkins GJ, Lu X, Turnpenny JR, Mitchell TD, Jones RG, Lowe J, Murphy JM, Hassell D,\nBoorman P, McDonald R, Hill S (2002) Climate Change Scenarios for the United Kingdom:\n25\nThe UKCIP02 Scientific Report. Tyndall Centre for Climate Change Research, School of\nEnvironmental Sciences, University of East Anglia, Norwich, UK, 120 pp\nIPCC (2007) Climate Change 2007: The Physical Scientific Basis. Contribution of Working Group I\nto the Fourth Assessment Report of the Intergovernment Panel on Climate Change. Cambridge\nUniversity Press, New York, pp. 996\nIPCC (2001) Technical Summary. Climate change 2001: Impacts, Adaptation, and Vulnerability. A\nReport of Working Group II of Intergovernmental Panel on Climate Change Cambridge\nUniversity Press, New York, p. 1000\nKasemir B, Schibli D, Stoll S, Jaeger CC (2000) Involving citizens in climate and energy assessments.\nEnvironment 42(3): 32-42\nLempert RJ, Schlesinger ME (2000) Robust strategies for abating climate change. Climatic Change\n45: 387-401\nLempert RJ, Schlesinger ME (2001) Climate change strategy needs to be robust. Nature 412: 543-545\nMerton R (1957) Manifest and Latent Functions in Social Theory and Social Structure. Free Press,\nGlencoe, Illinois\nMetroeconomica (2004) Costing the impacts of climate change in the UK: overview of guidelines.\nUKCIP Technical Report. UKCIP, Oxford\nMokrech M, Nicholls RJ, Richards JA, Henriques C, Holman IP, Shackley S (2008) Regional impact\nassessment of flooding under future climate and socio-economic scenarios for East Anglia and\nNorth West England. Climatic Change 90(1-2), 31-55\nNakicenovic N, Swart R (eds.) (2000) Special Report on Emissions Scenarios. A Special report of\nWorking Group III of the Intergovernmental Panel on Climate Change. Intergovernmental Panel\non Climate Change, Cambridge University Press Cambridge, p. 599\nOlsson JA, Andersson L (2007) Possibilities and problems with the use of models as a\ncommunication tool in water resource management. Water Resources Management 21(1): 97-\n110\n26\nPahl C (2004). Adaptive development and maintenance of user-centric software systems. Information\nand Software Technology 46: 973-986\nPearson RG, Dawson TP, Berry PM, Harrison PA (2002) SPECIES: A spatial valuation of climate\nimpact on the envelope of species. Ecological Modelling 154(3): 289-300.\nPressman RS (2005) Software engineering: a practitioner's approach. McGraw-Hill, Boston\nRichards JA, Mokrech M, Berry PM, Nicholls RJ (2008) Regional assessment of climate change\nimpacts on coastal and fluvial ecosystems and the scope for adaptation. Climatic Change 90(1-\n2), 141-167\nRounsevell MDA, Annetts JE, Audsley E, Mayr T, Reginster I (2003) Modelling the spatial\ndistribution of agricultural land use at the regional scale. Agriculture, Ecosystems and\nEnvironment 95(2-3): 465-479\nScience and Policy Associates Inc and ESYS (1996) Proposal for a UK Integrated Climate Change\nImpacts Assessment. Report prepared for the Department of the Environment and the\nEnvironment Agency. Department of the Environment, London, p. 28\nSchneider SH (1997) Integrated assessment modelling of global climate change: transparent rationale\ntool for policy making or opaque screen hiding value-laden assumptions? Environmental\nModelling and Assessment 2: 229-248\nShackley S (1998) Introduction to Special Section on the Use of Models in Appraisal and Policy-\nMaking. Impact Assessment and Project Appraisal 16(2): 81-89.\nShackley S, Deanwood R (2002) Stakeholder perceptions of climate change impacts at the regional\nscale: Implications for the effectiveness of regional and local responses. Journal of\nEnvironmental Planning and Management 45(3): 381-402\nShackley S, Deanwood R (2003) Constructing social futures for climate-change impacts and response\nstudies: building qualitative and quantitative scenarios with the participation of stakeholders.\nClimate Research 24(1): 71-90\n27\nShackley S, Gough C (2002) The Use of Integrated Assessment: An Institutional Analysis\nPerspective. Tyndall Centre for Climate Change Research Working Paper 14. Tyndall Centre,\nNorwich.\nTurnpenny J, Haxeltine A, O’Riordan T (2004) A scoping study of user needs for Integrated\nAssessment of climate change in the UK context: Part 1 of the development of an Interactive\nIntegrated Assessment Process. Integrated Assessment 4(4): 283-300\nUKCIP [UK Climate Impacts Programme] (2001a) Socio-economic scenarios for climate change\nimpact assessment: a guide to their use in the UK Climate Impacts Programme. UKCIP,\nOxford, p.123\nUKCIP (2001b) Draft report of the RegIS Technical Workshop held at DEFRA, Nobel House, London\non 26 June 2001. Unpublished UKCIP Report, Oxford, UK\nWelp M (2001). The use of Decision Support Tools in participatory river basin management.\nPhys. Chem. Earth (B) 26(7-8): 535-539\nYearley S (1999). Computer models and the public’s understand of science: a case study\nanalysis. Soc Studies Sci 29(6): 845-866\nWillows RI, Connell RK (eds.) (2003) Climate adaptation: risk, uncertainty and decision-\nmaking. UKCIP Technical Report, UKCIP, Oxford\n28\nFigure captions\nFigure 1 Schematic diagram of the structure and functioning of the Regional Impact Simulator\nFigure 2 The second ‘Exploratory Analysis’ screen with slider bars, containing colour-coded\nuncertainty ”bands”, for changing input parameter values\nFigure 3 The first ‘Predefined scenario’ screen for rapid visualization of impacts\nFigure 4 The final ‘Influencing the Impacts’ screen for testing regional adaptation responses to\nidentified impacts\n29\nFigure 1 Schematic diagram of the structure and functioning of the Regional Impact Simulator\n30\nFigure 2 The second ‘Exploratory Analysis’ screen with slider bars, containing colour-coded\nuncertainty ”bands”, for changing input parameter values\n31\nFigure 3 The first ‘Predefined scenario’ screen for rapid visualization of impacts\nFigure 4 The final ‘Influencing the Impacts’ screen for testing regional adaptation responses to\nidentified impacts\n"}