{"doi":"10.1182\/blood-2009-08-237834","coreId":"19178","oai":"oai:eprints.bham.ac.uk:338","identifiers":["oai:eprints.bham.ac.uk:338","10.1182\/blood-2009-08-237834"],"title":"CLEC-2 activates Syk through dimerization","authors":["Hughes, C. E.","Pollitt, A. Y.","Mori, J.","Eble, J. A.","Tomlinson, Michael G.","Hartwig, J. H.","O'Callaghan, C. A.","Futterer, K.","Watson, Steve P"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The C-type lectin receptor CLEC-2 activates platelets through Src and Syk tyrosine kinases, leading to tyrosine phosphorylation of downstream adapter proteins and effector enzymes, including phospholipase-C 2. Signaling is initiated through phosphorylation of a single conserved tyrosine located in a YxxL sequence in the CLEC-2 cytosolic tail. The signaling pathway used by CLEC-2 shares many similarities with that used by receptors that have 1 or more copies of an immunoreceptor tyrosine-based activation motif, defined by the sequence Yxx(L\/I)x6-12Yxx(L\/I), in their cytosolic tails or associated receptor chains. Phosphorylation of the conserved immunoreceptor tyrosine-based activation motif tyrosines promotes Syk binding and activation through binding of the Syk tandem SH2 domains. In this report, we present evidence using peptide pull-down studies, surface plasmon resonance, quantitative Western blotting, tryptophan fluorescence measurements, and competition experiments that Syk activation by CLEC-2 is mediated by the cross-linking through the tandem SH2 domains with a stoichiometry of 2:1. In support of this model, cross-linking and electron microscopy demonstrate that CLEC-2 is present as a dimer in resting platelets and converted to larger complexes on activation. This is a unique mode of activation of Syk by a single YxxL-containing recepto","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:338<\/identifier><datestamp>\n      2011-12-20T10:58:08Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        CLEC-2 activates Syk through dimerization<\/dc:title><dc:creator>\n        Hughes, C. E.<\/dc:creator><dc:creator>\n        Pollitt, A. Y.<\/dc:creator><dc:creator>\n        Mori, J.<\/dc:creator><dc:creator>\n        Eble, J. A.<\/dc:creator><dc:creator>\n        Tomlinson, Michael G.<\/dc:creator><dc:creator>\n        Hartwig, J. H.<\/dc:creator><dc:creator>\n        O'Callaghan, C. A.<\/dc:creator><dc:creator>\n        Futterer, K.<\/dc:creator><dc:creator>\n        Watson, Steve P<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        The C-type lectin receptor CLEC-2 activates platelets through Src and Syk tyrosine kinases, leading to tyrosine phosphorylation of downstream adapter proteins and effector enzymes, including phospholipase-C 2. Signaling is initiated through phosphorylation of a single conserved tyrosine located in a YxxL sequence in the CLEC-2 cytosolic tail. The signaling pathway used by CLEC-2 shares many similarities with that used by receptors that have 1 or more copies of an immunoreceptor tyrosine-based activation motif, defined by the sequence Yxx(L\/I)x6-12Yxx(L\/I), in their cytosolic tails or associated receptor chains. Phosphorylation of the conserved immunoreceptor tyrosine-based activation motif tyrosines promotes Syk binding and activation through binding of the Syk tandem SH2 domains. In this report, we present evidence using peptide pull-down studies, surface plasmon resonance, quantitative Western blotting, tryptophan fluorescence measurements, and competition experiments that Syk activation by CLEC-2 is mediated by the cross-linking through the tandem SH2 domains with a stoichiometry of 2:1. In support of this model, cross-linking and electron microscopy demonstrate that CLEC-2 is present as a dimer in resting platelets and converted to larger complexes on activation. This is a unique mode of activation of Syk by a single YxxL-containing receptor<\/dc:description><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/338\/1\/Hughes_blood.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/338\/1.hassmallThumbnailVersion\/Hughes_blood.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1182\/blood-2009-08-237834<\/dc:relation><dc:identifier>\n        Hughes, C. E. and Pollitt, A. Y. and Mori, J. and Eble, J. A. and Tomlinson, Michael G. and Hartwig, J. H. and O'Callaghan, C. A. and Futterer, K. and Watson, Steve P (2010) CLEC-2 activates Syk through dimerization. Blood, 115 (14). p. 2947. ISSN 0006-4971<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/338\/<\/dc:relation><dc:language>\n        English<\/dc:language><dc:contributor.sponsor>\n        Wellcome<\/dc:contributor.sponsor><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/338\/1.hassmallThumbnailVersion\/Hughes_blood.pdf","http:\/\/dx.doi.org\/10.1182\/blood-2009-08-237834","http:\/\/eprints.bham.ac.uk\/338\/"],"year":2010,"topics":["R Medicine (General)"],"subject":["Article","PeerReviewed"],"fullText":"PLATELETS AND THROMBOPOIESIS\nCLEC-2 activates Syk through dimerization\nCraig E. Hughes,1 Alice Y. Pollitt,1 Jun Mori,1 Johannes A. Eble,2 Michael G. Tomlinson,3 John H. Hartwig,4\nChristopher A. O’Callaghan,5 Klaus Fu¨tterer,3 and Steve P. Watson1\n1Centre for Cardiovascular Sciences, Institute for Biomedical Research, College of Medical and Dental Sciences, University of Birmingham, Birmingham, United\nKingdom; 2Centre for Molecular Medicine, Excellence Cluster Cardio-Pulmonary System, Frankfurt University Hospital, Frankfurt am Main, Germany; 3Division\nof Hematology, Brigham and Women’s Hospital, Department of Medicine, Harvard Medical School, Boston, MA; 4School of Biosciences, College of Life and\nEnvironmental Sciences, University of Birmingham, Birmingham, United Kingdom; and 5Nuffield Department of Clinical Medicine, University of Oxford, Oxford,\nUnited Kingdom\nThe C-type lectin receptor CLEC-2 acti-\nvates platelets through Src and Syk ty-\nrosine kinases, leading to tyrosine phos-\nphorylation of downstream adapter\nproteins and effector enzymes, including\nphospholipase-C \u00012. Signaling is initi-\nated through phosphorylation of a single\nconserved tyrosine located in a YxxL\nsequence in the CLEC-2 cytosolic tail.\nThe signaling pathway used by CLEC-2\nshares many similarities with that used\nby receptors that have 1 or more copies\nof an immunoreceptor tyrosine-based ac-\ntivation motif, defined by the sequence\nYxx(L\/I)x6-12Yxx(L\/I), in their cytosolic tails\nor associated receptor chains. Phosphor-\nylation of the conserved immunoreceptor\ntyrosine-based activation motif tyrosines\npromotes Syk binding and activation\nthrough binding of the Syk tandem SH2\ndomains. In this report, we present evi-\ndence using peptide pull-down studies,\nsurface plasmon resonance, quantitative\nWestern blotting, tryptophan fluores-\ncence measurements, and competition\nexperiments that Syk activation by\nCLEC-2 is mediated by the cross-linking\nthrough the tandem SH2 domains with a\nstoichiometry of 2:1. In support of this\nmodel, cross-linking and electron micros-\ncopy demonstrate that CLEC-2 is present\nas a dimer in resting platelets and con-\nverted to larger complexes on activation.\nThis is a unique mode of activation of Syk\nby a single YxxL-containing receptor.\n(Blood. 2010;115(14):2947-2955)\nIntroduction\nThe C-type lectin receptor CLEC-2 is expressed on platelets and on\na subpopulation of other hematopoietic cells, including mouse\nneutrophils and dendritic cells.1-3 CLEC-2 is a receptor for the\nsnake venom toxin rhodocytin4 and the transmembrane protein\npodoplanin,5,6 which is expressed on the leading edge of tumor\ncells and on kidney podocytes, lung type 1 alveolar cells, and\nlymphatic endothelium. In addition, recent evidence suggests that\nactivated platelets express or release a ligand for CLEC-2 that\nsupports platelet aggregation at arteriolar rates of flow.7 Mice\npretreated with a specific antibody to CLEC-2 exhibit a selective\nloss of the C-type lectin receptor and impaired platelet activation\non collagen at high shear in vitro or in vivo.7\nCross-linking of CLEC-2 by rhodocytin, podoplanin, or specific\nantibodies elicits powerful platelet aggregation and secretion.4,6\nCLEC-2 signals through Src- and Syk-dependent tyrosine kinases,\nleading to phosphorylation of a series of adapter and effector\nproteins that culminate in activation of phospholipase-C \u00012 (PLC\u00012)\nand platelet activation.4 This mechanism of platelet activation\nresembles that used by the immunoglobulin collagen receptor,\nglycoprotein VI (GPVI), which is constitutively associated with the\nFcR\u0001 chain at the platelet surface. Cross-linking of GPVI by\ncollagen or specific agonists, such as the snake venom toxin\nconvulxin or antibodies, leads to Src kinase-dependent phosphory-\nlation of 2 conserved tyrosines in the FcR\u0001-chain immunoreceptor\ntyrosine-based activation motif (ITAM).8,9 ITAMs are present in a\nvariety of hematopoietic receptors, including T- and B-cell antigen\nreceptors and the Fc receptors, Fc\u0002RI, Fc\u0001RIa, and Fc\u0001RIIa, and\nare defined by the sequence Yxx(L\/I)6-12Yxx(L\/I).10 Phosphoryla-\ntion of the 2 conserved tyrosines on receptor activation provides\ndocking sites for the tandem SH2 domains in the only 2 known\nmembers of the Syk family of tyrosine kinases, Syk and Zap-70,\nleading to their activation and initiation of downstream signaling.\nAlthough CLEC-2 signals through a pathway similar to that of\nGPVI, it contains only a single YxxL sequence in its cytoplasmic\ntail, which, by mutation of the tyrosine to a phenylalanine, has been\nshown to be essential for activation of Syk.11 Two other C-type\nlectin receptor family members, Dectin-1 and CLEC9A, have also\nbeen shown to activate Syk through a single YxxL sequence\nlocated in their cytosolic tails.12-14 Thus, it seems probable that\nthese 3 C-type lectin-like receptors may use a common mechanism\nto regulate Syk via a single YxxL sequence.\nActivation of Syk by CLEC-2 is ablated by point mutations in\neither of the Syk SH2 domains that disrupt their ability to bind to\nphosphotyrosines.11 This suggests a model in which activation of\nSyk is mediated through cross-linking of 2 phosphorylated CLEC-2\nreceptors on the cell surface. This model is further supported by the\nobservation that a CLEC-2 specific F(ab\u0003)2 fragment but not a Fab\nfragment mediates activation of mouse platelets.7 Further, the\nrelated receptor, CLEC9A, is expressed as a covalent dimer on\ndendritic cells, consistent with the cross-linking model.14 On the\nother hand, these observations could be explained by the presence\nof a second binding site on the cytosolic tail of CLEC-2, which\nbinds directly or via an intermediate protein to one of the Syk SH2\nSubmitted August 17, 2009; accepted January 15, 2010. Prepublished online\nas Blood First Edition paper, February 12, 2010; DOI 10.1182\/blood-2009-08-\n237834.\nThe online version of this article contains a data supplement.\nThe publication costs of this article were defrayed in part by page charge\npayment. Therefore, and solely to indicate this fact, this article is hereby\nmarked ‘‘advertisement’’ in accordance with 18 USC section 1734.\n© 2010 by The American Society of Hematology\n2947BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\ndomains. The present study was undertaken to investigate these\n2 hypotheses to establish the mode of Syk activation by CLEC-2.\nMethods\nReagents\nRhodocytin was purified from Calloselasma rhodostoma venom as previ-\nously described.15 A rabbit \u0004-Syk polyclonal antibody (pAb) was used as\npreviously reported.16 The goat \u0004-human CLEC-2 pAb was purchased from\nR&D Systems. The \u0004-Myc monoclonal antibody was from Cell Signaling\nTechnology. The \u0004-mouse CLEC-2 pAb was kindly donated by Drs Katsue\nSuzuki-Inoue and Yukio Ozaki (University of Yamanashi, Yamanashi,\nJapan). The antibody to rhodocytin has been previously described.4 The\npolyclonal \u0004-Src antibody was from Invitrogen. The polyclonal \u0004-Fc\u0001RIIA\ntail antibody was used as previously reported.17 Horseradish peroxidase\n(HRP)–conjugated \u0004-rabbit and \u0004-goat secondary antibody and enhanced\nchemiluminescence reagents were purchased from GE Healthcare. GST\nfusion proteins corresponding to single or tandem SH2 domains of Syk\nwere prepared as described previously.18,19 Biotinylated peptides were\nsynthesized by Alta Bioscience and Severn Biotech. The Sulfo-EGS\ncross-linking compound was from Pierce (Thermo Fisher Scientific). All\nother reagents were purchased from Sigma-Aldrich or from previously\ndescribed sources.20\nPlatelet preparation\nVenous blood from healthy drug-free volunteers was taken into 10%\nsodium citrate. Washed platelets were obtained by centrifugation using\nprostacyclin to prevent activation during the isolation procedure.21 Platelets\nwere resuspended in modified-Tyrode buffer (134mM NaCl, 0.34mM\nNa2HPO4, 2.9mM KCl, 12mM NaHCO3, 20mM N-2-hydroxyethylpipera-\nzine-N\u0003-2-ethanesulfonic acid, 5mM glucose, 1mM MgCl2; pH 7.3) as\npreviously described.21 Platelets were used at a cell density of 5 \u0005 108\/mL\nunless stated.\nImmunoprecipitation, pull-downs, and Western blotting\nWashed platelets were pretreated with 9\u0006M Integrilin to inhibit platelet\nactivation and aggregation through integrin \u0004IIb\u00073. Platelets were stimu-\nlated with agonists at 37°C with stirring at 1200g in a Born lumi-\naggregometer. Reactions were terminated by addition of 2 times ice-cold\nNP-40 lysis buffer. Platelet lysates were precleared, and detergent-insoluble\ndebris was discarded.21 An aliquot was dissolved with sodium dodecyl\nsulfate (SDS) sample buffer for detection of total tyrosine phosphorylation.\nLysates were incubated with either the indicated antibodies and protein\nG-Sepharose, or biotinylated CLEC-2 peptides and streptavidin-agarose.\nPrecipitated proteins or whole-cell lysates were separated by reducing\nSDS-polyacrylamide gel electrophoresis (PAGE), electrotransferred, and\nWestern blotted. For in vitro pull-down studies, Syk GST-SH2 domain\nproteins were incubated with a 50-fold excess of biotinylated CLEC-2\npeptide, and the resulting complexes were precipitated with glutathione-\nagarose. Samples were dot-blotted onto nitrocellulose membrane and\nprobed with HRP-conjugated streptavidin. Densitometry was performed to\nquantitate the amount of peptide pulled out.\nPlatelet surface protein cross-linking\nAfter platelet stimulation, Sulfo-EGS (0.15mM or 1.5mM final concentra-\ntion) was added and allowed to incubate at room temperature for\n30 minutes. The reaction was then quenched with the addition of Tris-HCl\n(pH 7.5; 25mM final concentration), and allowed to incubate for a further\n20 minutes at room temperature. The platelets were then lysed with the\naddition of an equal volume of 2 times ice-cold NP-40 lysis buffer.\nConstructs\nWild-type and Y7F CLEC-2 and wild-type FcR\u0001-chain cloned into pEF6\nhave been described previously.11,22 Further mutations were generated by a\n2-step polymerase chain reaction method. The mutating primers CLEC-2\n\b21-28-FWD (5\u0003-TAA-AAC-TCG-GAA-ACC-AGC-TCT-CAT-CTG-\nGTG-GCG-TGT-GAT-GGC-TTT-GAT-TC-3\u0003), CLEC-2 \b21-28-REV (5\u0003-\nGAA-TCA-AAG-CCA-TCA-CAC-GCC-ACC-AGA-TGA-GAG-CTG-\nGTT-TCC-GAG-TTT-TA-3\u0003), CLEC-2 S21\/27A-FWD (5\u0003-GAA-ACC-\nAGC-TCT-CAT-CGC-CGT-TGG-CTC-TGC-ATC-CGC-CTC-CTG-GTG-\nGC-3\u0003), CLEC-2 S21\/27A-REV (5\u0003-GCC-ACC-AGG-AGG-CGG-ATG-\nCAG-AGC-CAA-CGG-CGA-TGA-GAG-CTG-GTT-TC-3\u0003), CLEC-2 T9A-\nFWD (5\u0003-CAT-GCA-GGA-TGA-AGA-TGG-ATA-CAT-CGC-CTT-AAA-\nTAT-TAA-AAC-TCG-3\u0003), CLEC-2 T9A-REV (5\u0003-CGA-GTT-TTA-ATA-\nTTT-AAG-GCG-ATG-TAT-CCA-TCT-TCA-TCC-TGC-ATG-3\u0003), FcR\u0001-\nchain Y66F-FWD (5\u0003-CAG-ATG-GTG-TTT-TCA-CGG-GCC-TGA-G-\n3\u0003), FcR\u0001-chain Y66F-REV (5\u0003-CTC-AGG-CCC-GTG-AAA-ACA-CCA-\nTCT-G-3\u0003), FcR\u0001-chain Y77F-FWD (5\u0003-GGA-ACC-AGG-AGA-CTT-TCG-\nAGA-CTC-TGA-AGC-3\u0003), and FcR\u0001-chain Y77-REV (5\u0003-GCT-TCA-GAG-\nTCT-CGA-AAG-TCT-CCT-GGT-TCC-3\u0003) were used along with vector\nspecific primers 5147 and 4150. The nuclear factor of activated T cells\n(NFAT) luciferase reporter contains 3 copies of the distal NFAT site from\nthe IL-2 promoter23 and was provided by Prof A. Weiss (University of\nCalifornia San Francisco). The pEF6-lacZ expression construct was from\nInvitrogen.\nCell culture and transfection\nDT40 chicken B cells were grown in RPMI supplemented with 10% fetal\nbovine serum, 1% chicken serum, 100 U\/mL penicillin, 100 \u0006g\/mL\nstreptomycin, 50\u0006M \u0007-mercaptoethanol, and 20mM GlutaMAX. Cells\nwere transfected in 400 \u0006L of cytomix by electroporation using a\nGenePulser II (Bio-Rad) set at 350 V and 500 \u0006F.\nLuciferase assay\nCells were transfected as described in “Cell culture and transfection” with\n10 \u0006g of the indicated Myc-tagged or FLAG-tagged-CLEC-2 construct or 2\n\u0006g\/mL each of GPVI and the indicated Myc-tagged-FcR\u0001 construct, 20 \u0006g\nof the luciferase reporter construct, and 2 \u0006g of pEF6-lacZ to control for\ntransfection efficiency.11,22 Twenty hours after transfection, live cells were\ncounted by trypan blue exclusion and samples divided for luciferase assay,\n\u0007-galactosidase assay, and flow cytometry. Luciferase assays were carried\nout as described previously.24 Luciferase activity was measured with a\nCentro LB 960 microplate luminometer (Berthold Technologies). Data\nwere normalized to \u0007-galactosidase activity and expressed as percentage of\nthe wild-type response. All luciferase data were averaged from triplicate\nreadings. \u0007-Galactosidase assays were performed with half of a million\ncells using the Galacto-Light chemiluminescent reporter assay, according to\nthe manufacturer’s instructions (Applied Biosystems). \u0007-Galactosidase\nactivity was measured in triplicate using a microplate luminometer.\nImmunogold labeling and electron microscopy\nWashed mouse platelets were prepared as previously described.25 Nonstimu-\nlated or rhodocytin (100nM for 2 minutes)–stimulated mouse platelets were\nused for immunogold labeling and electron microscopy performed as\npreviously described.26 In nonstimulated platelets, CLEC-2 receptors were\nlabeled with CLEC-2 specific monoclonal IgG and 10-nm colloidal gold\nparticles coated with goat \u0004-mouse IgG. This approach could not be used to\nlabel CLEC-2 in rhodocytin-stimulated platelets as the snake toxin either\nmasks the antibody epitope or induces a conformational change, which does\nnot allow the CLEC-2 specific antibody to bind. A rabbit polyclonal\nantibody to rhodocytin and 10-nm colloidal gold particles coated with goat\nanti–rabbit IgG was used instead.\nFlow cytometry\nSurface expression of Myc-tagged-CLEC-2 and the Myc-tagged-FcR\u0001\nmutants was measured by flow cytometry. Cells (5 \u0005 105) were stained in a\n25-\u0006L volume for 20 minutes on ice with 10 \u0006g\/mL \u0004-Myc antibody. Cells\nwere then washed and incubated for 20 minutes on ice with 15 \u0006g\/mL\nfluorescein isothiocyanate–conjugated \u0004-mouse IgG secondary antibody.\n2948 HUGHES et al BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\nStained cells were analyzed using a FACSCalibur (BD Biosciences). Data\nwere collected and analyzed using CellQuest software (BD Biosciences).\nSurface plasmon resonance\nSurface plasmon resonance experiments were performed using a Biacore\nT100 machine (Biacore, GE Healthcare). Biotin tagged CLEC-2 and FcR\u0001\npeptides were attached to carboxymethylated dextran-coated CM5 research\ngrade sensor chips (Biacore) after attachment of streptavidin to the chip\nsurface using amine coupling. All experiments were performed at 25°C in\n10mM N-2-hydroxyethylpiperazine-N\u0003-2-ethanesulfonic acid, pH 7.4,\n150mM NaCl, 1mM MgCl2, 0.005% Surfactant P-20. A range of concentra-\ntions (0-80\u0006M) of N-SH2, C-SH2, and tandem SH2 domains were injected\nover all peptide surfaces to determine equilibrium dissociation constants\n(KD). Specific binding was identified by subtraction of signal from an\nappropriate reference flow cell. Equilibrium dissociation constants (KD\nvalues) were derived from global fitting to the predicted function using the\nLevenberg-Marquardt algorithm as implemented in the program Origin\n(OriginLab).\nTryptophan fluorescence titration\nFluorescence measurements were performed in a PTI spectrofluorimeter\n(Photon Technology International). Both Syk SH2 domains and CLEC-2\npeptides were extensively dialyzed into experimental buffer (50mM\nN-2-hydroxyethylpiperazine-N\u0003-2-ethanesulfonic acid, 150mM NaCl,\n150mM glycine, 1mM ethylenediaminetetraacetic acid, and 5mM \u0007-mercap-\ntoethanol; pH 7.5) before experimentation. Protein and peptide concentra-\ntions were determined by spectrophotometry using a ND-1000 spectropho-\ntometer (Nanodrop; Thermo Scientific). The Syk SH2 domains (3 mL of\n250nM) were loaded into a quartz cuvette and placed into the cell turret\nwith constant stirring. The CLEC-2 peptide (2mM) was titrated in and\nallowed to mix for 2 minutes before scanning. An excitation wavelength of\n295 nm was used, and emission spectra were collected over the range of\n300 to 420 nm in 2.5-nm steps. Slit widths of 0.75 mm were used for both\nexcitation and emission. The peak fluorescence of 340 nm was monitored to\ncalculate the equilibrium dissociation constant, KD.\nStatistical analysis\nNFAT-luciferase data are expressed as geometric mean plus or minus SE.\nStatistical analysis was carried out using the unpaired Student t test.\nSignificance was taken P less than .05.\nResults\nStructure-function relationship of the CLEC-2 cytoplasmic tail\nand Syk tandem SH2 domains\nSequence alignment of the CLEC-2 cytosolic tail both between\nspecies and with the 2 other family members, Dectin-1 and\nCLEC9A, was performed to highlight conserved regions that might\nprovide a second binding site for one of the SH2 domains of Syk or\nfor an intermediate adapter protein. Sequence alignment of 9 spe-\ncies of CLEC-2 using ClustalW (www.ebi.ac.uk\/clustalw) high-\nlighted conservation of the N-terminal MQDEDGYxTL sequence,\na threonine at position \t2 in the YxxL motif and of 2 serine\nresidues located at positions 21 and 27 in human CLEC-2 (Figure\n1A). Several positively charged amino acids and a tryptophan-\narginine (WR) sequence at the juxtamembrane position were also\nconserved. Sequence alignment of 9 species of Dectin-1 also\nhighlighted conservation of the DEDGYxxL sequence and of 2\nserine residues (Figure 1B) but not the other amino acids that were\nconserved in CLEC-2 apart from the membrane WR sequence.\nIntriguingly, a conserved threonine residue was found at the \t1\nposition in the Dectin-1 YxxL motif. The same relationship did not\nhold for CLEC9A, with the conserved DEDG sequence being\nreplaced by the similarly charged EEEI sequence and just one of\nthe serines and the threonine at position Y\t1 being conserved. The\npresence of the conserved serine and threonine residues is of\ninterest given their potential for phosphorylation. Further, the\npresence of a threonine group at position Y \t 1 or Y \t 2 is of also\nof interest given previous observations in mast cells and mouse\nplatelets that phosphorylation of a conserved threonine at position\nY \t 1 in 1 of the 2 YxxL sequences of the FcR\u0001-chain by a novel\nisoform of protein kinase C (\n or \u0002) is required for maximal binding\nand activation of Syk.27-29\nBased on these alignments, experiments were designed to\ninvestigate the role of the YxxL, and the conserved serine and\nthreonine residues in the cytoplasmic tail of CLEC-2 through a\ncombination of peptide pull-down studies using human CLEC-2\nFigure 1. Sequence alignment of CLEC-2 family proteins. (A)\nTen species of CLEC-2 were aligned using ClustalW web-based\nsoftware, highlighting conservation of the DEDGYxTL motif and\nserines at positions 21 and 27. (B) Nine species of Dectin-1 were\naligned, highlighting conservation of the DEDGYTxL motif and\nserines at positions 32 and 40. (C) The intracellular tails of\nCLEC-2, Dectin-1, and CLEC9Awere aligned, highlighting conser-\nvation of the YxxL motif and partial conservation of a serine-rich\nregion.\nCLEC-2 ACTIVATES Syk AS A DIMER 2949BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\ncytosolic peptides and human mutant CLEC-2 transfected into\nchicken DT40 B cells. The latter is a hematopoietic cell line that we\nhave used extensively to investigate signaling by both CLEC-2 and\nGPVI using a sensitive NFAT reporter assay.22,30\nIn confirmation of our previous finding,11 the snake toxin\nrhodocytin stimulates powerful activation of NFAT activity in\nCLEC-2 but not in mock-transfected DT40 cells, with the response\nablated after mutation of the conserved tyrosine at position 7 to\nphenylalanine as shown later in Figure 3. In line with this, a\nphosphorylated peptide based on the first 13 amino acids of the\nCLEC-2 tail, which includes the conserved MQDEDGYxxL\nsequence, was able to effectively precipitate Syk from a platelet\nlysate, whereas the corresponding nonphosphorylated 13-amino\nacid peptide was ineffective (Figure 2Ai). Significantly, there was\nno increase in the amount of precipitated Syk when a tyrosine-\nphosphorylated peptide based on the full 31-amino acid cytoplas-\nmic tail of CLEC-2 was used, although again the nonphosphory-\nlated peptide was ineffective (Figure 2Ai). This demonstrates that a\nsingle phosphorylated YxxL sequence is sufficient to mediate\nbinding to Syk and that a similar level of binding is seen with the\n13 and the full-length 31-amino acid peptides based on the CLEC-2\ntail in the pull-down assay. It is unclear, however, whether the\ninteraction with Syk in this design is mediated through binding of\n2 separate phosphorylated peptides to the tandem SH2 domains in\nthe kinase, bearing in mind that multiple phosphorylated peptides\nare attached to the beads. These observations therefore do not rule\nout a possible direct or indirect interaction between the Syk tandem\nSH2 domains and a second site in the CLEC-2 cytosolic tail, which\nmay support the association of Syk with a CLEC-2 monomer in an\nintact cell.\nThe contribution of the 2 conserved serine residues in the\nCLEC-2 tail to the interaction with Syk and to intracellular\nsignaling was investigated using the same approach as for the YxxL\nmotif. Mutation of the 2 serine residues to alanine, or deletion of\nthe serine-rich region (21-28) had no significant effect on surface\nexpression or the ability of the mutant CLEC-2 receptor to activate\nNFAT in the DT40 cell line relative to the wild-type receptor\n(Figure 2Bi; supplemental Figure 1, available on the Blood\nwebsite; see the Supplemental Materials link at the top of the online\narticle). Further, a 31-amino acid tyrosine-phosphorylated peptide\ncontaining alanine residues rather than serine groups at positions\n21 and 27 associated with a similar level of Syk as the tyrosine-\nphosphorylated wild-type peptide (Figure 2Aii). These results\ndemonstrate that neither of the conserved serine residues plays a\nsignificant role in supporting Syk association or in signaling to\nPLC\u00012 and NFAT activation.\nUsing the same approach, we were also unable to find evidence\nfor a functional role for the threonine at position 9 in signaling by\nCLEC-2. Transfection of DT40 cells with the T9A mutant of\nCLEC-2 had no significant effect on surface expression or on NFAT\nactivation induced by rhodocytin relative to the wild-type receptor\n(Figure 2Bii; supplemental Figure 2). Further, a tyrosine-\nphosphorylated 31 amino acid peptide containing a phosphorylated\nthreonine residue precipitated similar levels of Syk as the wild-type\nphosphorylated peptide (Figure 2Aiii).\nThese results confirm a critical role for the phosphorylated\nYxxL sequence in both the interaction with Syk and in mediating\nNFAT signaling by CLEC-2 in transfected DT40 cells but also\ndemonstrate that the 2 conserved serines at positions 21 and 27 and\nthe partially conserved threonine at position 9 are dispensable for\nthese events. The functional role of these 3 residues therefore\nremains to be determined. The present results indirectly favor a\nmodel in which Syk cross-links 2 molecules of CLEC-2 via its\n2 SH2 domains, both of which are known to be essential for\nCLEC-2 signaling.11\nInhibitory action of Y7F CLEC-2 on signaling by wild-type\nCLEC-2\nTo further investigate whether cross-linking of 2 CLEC-2 receptors\nis required for activation of Syk, we coexpressed wild-type\nCLEC-2 with various levels of the Y7F mutant of CLEC-2, which\nis unable to bind to Syk (Figure 2Ai) and does not support NFAT\nactivation (Figure 3).11 The rationale for this experiment is that the\nY7F mutant should have an inhibitory effect if the cross-linking\nmodel is correct by forming an “inactive heterodimer” with the WT\nreceptor. On the other hand, it should have no effect if Syk is\nactivated by a monomeric CLEC-2 receptor as the Y7F mutant is\nunable to support binding to Syk and activation.\nSurface expression of wild-type CLEC-2 was unaffected by\nexpression of the Y7F mutant in DT40 cells (supplemental Figure\n3), whereas NFAT activation was dramatically inhibited when the\nmutant receptor was expressed at a similar or greater level than the\nwild-type receptor (Figure 3). Reducing the level of expression of\nthe Y7F mutant caused a corresponding reduction in the inhibitory\neffect. In contrast, the weak constitutive (agonist-independent)\nFigure 2. YxxL is essential for Syk association and\nsignaling through CLEC-2. (A) Washed platelets\n(5 \u0005 108\/mL) were lysed with 2 times NP40 lysis buffer,\nprecleared, and interacting proteins precipitated with the\naddition of 10 \u0006g of the relevant biotinylated CLEC-2\npeptide. Precipitated proteins were separated by SDS-\nPAGE and Western blotted for the presence of Syk.\n(B) DT40 cells were transfected with 10 \u0006g\/mL of the\nstated CLEC-2 construct and an NFAT-luciferase re-\nporter plasmid. Transfected cells were stimulated with\n50nM rhodocytin for 6 hours at 37°C, and then the\nluciferase activity was measured as an index of signaling.\nResults were normalized for transfection efficiency and\nplotted as a percentage of the wild-type response. Error\nbars represent the geometric mean \u000b SE of 3 to 6\nseparate experiments.\n2950 HUGHES et al BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\nsignal induced by expression of CLEC-2, which we have previ-\nously described,22 was not inhibited in the presence of the Y7F\nmutant, suggesting that it may be mediated by a CLEC-2 monomer\n(Figure 3). These data provide evidence that ligand-activated\nCLEC-2 signals as a dimer\/oligomer and that expression of the\nY7F inactive mutant has a “dominant negative” effect by inducing\na portion of the native receptors into a mixed (wild-type and Y7F)\ndimeric or higher-order structure that is unable to signal.\nCLEC-2 is present in higher-order structures on the platelet\nsurface\nThe results shown in Figures 2 and 3 provide evidence that\ndimerization of CLEC-2 is essential for Syk activation. To investi-\ngate whether CLEC-2 is present as a dimer or higher-order\nstructure on platelets, we used Sulfo-EGS, a cross-linking reagent\nthat cross-links proteins that fall within a distance of 1.6 nm (16Å)\nof each other. Dimerization and oligomerization of CLEC-2 were\ninvestigated by immunoprecipitation and Western blotting.\nIn nonstimulated or rhodocytin-stimulated platelets, CLEC-2\nmigrates on reducing SDS-PAGE gel electrophoresis as a character-\nistic doublet because of differential glycosylation (Figure 4A lanes\n1 and 4).4 The molecular weights of the 2 differentially glycosy-\nlated forms of CLEC-2, 30 and 40 kDa, are consistent with both\nforms being a monomer, which is further supported by the fact that\nthey are reduced to a single band of just less than 30 kDa on\ndeglycosylation.4 After addition of a low or a high concentration of\ncross-linker, the presence of higher molecular weight bands of\nCLEC-2 can be seen together with a corresponding reduction in\nintensity of the 30- and 40-kDa bands. In nonstimulated platelets, a\nnew broad band is observed at between 60 and 80 kDa, which\ncorresponds approximately to a doubling of the molecular weight\nof monomeric CLEC-2 (Figure 4A, lanes 2 and 3). With the higher\nconcentration of cross-linker, there is also the suggestion of the\npresence of higher-order structures in nonstimulated platelets,\nwhich corresponds to a further reduction in the monomeric form\nand to a reduction in the dimeric form relative to the lower\nconcentration of Sulfo-EGS. In the presence of rhodocytin, Sulfo-\nEGS induces the formation of both the predicted CLEC-2 dimer\nand higher-order structures, most notably at the upper concentra-\ntion where there is almost no detectable monomeric CLEC-2\n(Figure 4A lanes 5 and 6).\nThe corresponding changes in the levels of monomeric, dimeric,\nand oligomeric forms of CLEC-2 are consistent with the intercon-\nversion of one form to another, although there is also the suggestion\nof loss of protein with the higher concentration of cross-linker, a\nconclusion supported by densitometric analysis (not shown). The\nloss of protein may reflect the formation of higher-order structures\nthat are resistant to solubilization. The broad nature and smearing\nof bands seen in these studies are probably the consequence of\noligomerization of the differentially glycosylated forms of CLEC-2\nas well as possible cross-linking to other proteins, although\ninterestingly, Western blotting studies failed to detect the presence\nof rhodocytin in the higher-order structures, suggesting that\ncross-linking to the toxin had not occurred (not shown).\nA similar overall pattern of change in CLEC-2 dimerization\/\noligomerization was seen in whole-cell lysates prepared from basal\n(not shown) and rhodocytin-activated platelets, as demonstrated by\nWestern blotting for CLEC-2 (Figure 4B). In marked contrast, there\nwas no apparent dimerization\/oligomerization of the low-affinity\nimmune receptor, Fc\u0001RIIA, or the membrane-associated protein\nSrc in the presence of the intermediate and high concentration of\nSulfo-EGS in basal (not shown) or rhodocytin-activated platelets\n(Figure 4B) as shown by the similar levels of the monomeric forms\nof both proteins as revealed by Western blotting (Figure 4B). These\nresults demonstrate that the oligomerization of CLEC-2 is not\nsimply the result of a nonspecific effect of cross-linking of platelet\nsurface proteins.\nWe also investigated possible dimerization\/oligomerization of\nCLEC-2 by immunogold labeling and electron microscopy on\nFigure 3. The Y7F CLEC-2 mutant inhibits signaling by the wild-type receptor.\nDT40 cells were transfected with 10 \u0006g\/mL of wild-type CLEC-2 and\/or various\namounts of Y7F CLEC-2 and an NFAT-luciferase reporter gene. Transfected cells\nwere stimulated with 50nM rhodocytin for 6 hours at 37°C, after which time the\namount of luciferase activity was measured as a readout of signaling. Results were\nnormalized for transfection efficiency and plotted as a percentage of the wild-type\nresponse. Error bars represent the geometric mean \u000b SE of 3 to 8 separate\nexperiments.\nFigure 4. CLEC-2 oligomers are present on the plate-\nlet surface. Washed platelets (5 \u0005 108\/mL) under basal\nor rhodocytin-stimulated (100nM) conditions had their\nsurface proteins cross-linked with the addition of 0.15mM\nor 1.5mM Sulfo-EGS cross-linking reagent, with a linker\nlength of 1.6 nm (16 Å). The cross-linking reaction was\nsubsequently blocked, and then the platelets were lysed\nwith 2\u0005 NP40 lysis buffer. (A) Lysates were precleared\nwith protein G-Sepharose and then immunoprecipitated\nwith \u0004-CLEC-2 antibody and protein G-Sepharose. Pre-\ncipitated proteins were separated by reducing SDS-\nPAGE and Western blotted for CLEC-2. (B) Lysates were\nseparated by reducing SDS-PAGE and Western blotted\nfor CLEC-2, Fc\u0001RIIA, and Src. The results are represen-\ntative of 3 experiments.\nCLEC-2 ACTIVATES Syk AS A DIMER 2951BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\nnonstimulated and rhodocytin-stimulated mouse platelets using a\nspecific antibody to the C-type lectin receptor (Figure 5). Under\nnonstimulated conditions, approximately 35% and 50% of gold\nparticles were found alone or in pairs, respectively, with the latter\nseparated by a mean distance of 14 nm. These results further\nsuggest that, under basal conditions, CLEC-2 is present as a\nmonomer and dimer on the platelet surface. Furthermore, after\nrhodocytin stimulation, more than 55% of gold particles are present\nin clusters of 4 or more gold particles demonstrating the formation\nof oligomers.\nThese 2 distinct approaches demonstrate that a significant\nproportion of CLEC-2 is present as dimer on the surface of a\nnonstimulated platelet and that the receptor is converted to higher\noligomeric structures on activation. Furthermore, the CLEC-2\ndimer is not the consequence of disulphide cross-linking as the\nC-type lectin receptor runs solely as a monomer under both\nreducing (Figure 4) and nonreducing conditions (supplemental\nFigure 4).\nSurface plasmon resonance and tryptophan fluorescence\nmeasurements\nThe result in Figure 4 further supports a model in which the tandem\nSH2 domains in Syk bind to the phosphorylated YxxL sequence in\nseparate CLEC-2 receptors, which are preformed into dimers. This\nis consistent with our previous report that point mutants that disrupt\nbinding of the individual SH2 domains to phosphotyrosine abro-\ngate signaling by CLEC-2.11 One prediction of this model is that\nboth of the SH2 domains in Syk must be able to bind to the\nphosphorylated YxxL peptide. This was investigated using surface\nplasmon resonance to measure the equilibrium dissociation con-\nstants (KD) of binding of the N-terminal, C-terminal, and tandem\nSH2 domains of Syk. To achieve this, each protein was flowed over\ndifferent surfaces coated with the nonphosphorylated or phosphor-\nylated 13-amino acid N-terminal CLEC-2 peptide. No detectable\nbinding was observed for any of the SH2 domain-containing\nproteins when flowed over the nonphosphorylated CLEC-2 pep-\ntide, confirming the requirement for tyrosine phosphorylation of\nthe YxxL. When flowed over the tyrosine-phosphorylated peptide,\na KD of 10.5\u0006M was calculated for the Syk N-SH2 domain and\n2.4\u0006M for the Syk C-SH2 domain, demonstrating that both SH2\ndomains are able to bind to the phosphorylated CLEC-2 cytoplas-\nmic tail. Moreover, when the tSH2 domain protein was flowed over\ntyrosine-phosphorylated CLEC-2 peptide, a KD of 256nM was\ncalculated, thereby demonstrating cooperativity between the 2 SH2\ndomains. This is consistent with each SH2 domain binding to\nseparate molecules of the phosphorylated CLEC-2 peptides on the\nsurface of the chip. As a comparison, the individual and tandem\nSyk SH2 domains were also flowed over a dually phosphorylated\npeptide based on the human FcR\u0001-chain ITAM. A similar cooperat-\nivity was observed when the tandem SH2 domains were flowed\nover the peptide with a calculated KD of 20nM compared with the\nindividual KD values of the N- and C-terminal SH2 domains of 19.7\nand 1.7\u0006M, respectively (Figure 6A). These data demonstrate that\nthe Syk tandem SH2 domain protein binds with higher affinity than\nthe single Syk SH2 domains to a surface containing multiple copies\nof a phosphorylated YxxL-containing peptide. This has important\nimplications for the binding of Syk to a dually phosphorylated\nITAM protein or to the phosphorylated CLEC-2 tail when pre-\nsented as a dimer. Consistent with these data, quantitative Western\nblotting was used to show that twice the amount of a CLEC-2\npeptide was able to associate with the tandem-SH2 domains of Syk\ncompared with the single SH2 domains alone, confirming a 2:1\nstoichiometry of CLEC-2 to Syk (Figure 6B).\nTryptophan fluorescence titration was used to derive a second\nestimate of the affinity of the tandem Syk SH2 domains for the\nphosphorylated CLEC-2 peptide.19,31 This technique is based on the\nFigure 5. Electron microscopy and immunogold staining of\nCLEC-2 on resting and rhodocytin-stimulated mouse plate-\nlets. (Ai,Bi) Electron micrograph showing \u0004-CLEC2 immunostain-\ning. The majority of CLEC-2 immunogold labeling can be found\nwithin a pair (solid arrows) or alone (open arrowheads) under\nbasal conditions (A) or as larger clusters after rhodocytin stimula-\ntion and rhodocytin immunogold labeling (B). Scale bar repre-\nsents 50 nm. (Aii,Bii) Quantification of the CLEC-2 immunogold\nlabeling distribution under basal (A) or rhodocytin-stimulated (B)\nconditions. The distribution of CLEC-2 immunogold labeling is\ndepicted as a histogram. Data represent the mean plus or minus\nSD (n \f 5). (Aiii) Quantification of the distance between CLEC-2\nimmunogold-labeled pairs. The intercenter distance between the\ngold particles within pairs was measured using ImageJ (n \f 100)\nand presented as a box-and-whisker plot. Solid horizontal line\nshows the median for the data, the top of the box the 25th\npercentile, the bottom the 75th percentile, and the additional lines\nthe range of the data.\n2952 HUGHES et al BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\nprinciple that binding to the peptide causes a change in fluores-\ncence of 1 or more tryptophan groups in the tandem Syk SH2\ndomain. The N-terminal 13-amino acid CLEC-2 peptide was used\nfor these studies as this supports a similar level of binding of Syk to\nthat of the 31-amino acid phosphorylated peptide and does not\ncontain a tryptophan residue. Addition of the peptide resulted in a\nsaturatable decrease in peak tryptophan fluorescence of the tandem\nSyk SH2 domain at 340 nm, indicative of ligand binding (Figure 7).\nThe resulting dissociation constant (KD) of 5.7\u0006M for the Syk-\ntandem SH2\/CLEC-2 interaction was of a similar order as the KD\nderived by surface plasmon resonance of CLEC-2 peptide binding\nto either the N- or C-terminal SH2 domain of Syk. In contrast, the\nfluorescence data recorded a 20-fold weaker binding to the tSH2\nthan was observed by surface plasmon resonance. This discrepancy\nmay reflect the influence of avidity in the binding between the Syk\ntandem SH2 domains and a surface-immobilized peptide, whereas\nthe tryptophan fluorescence measurements were made in solution.\nIn contrast, we were unable to detect binding of the CLEC-2\npeptide to the single C-terminal SH2 domain of Syk over the same\nconcentration range. The equivalent experiment is not valid for the\nN-terminal SH2 domain as this does not contain a tryptophan\nresidue. This increased affinity of the tSH2 domain for a CLEC-2\npeptide compared with the single C-terminal SH2 domain mirrors\nthe result seen using surface plasmon resonance. It should be noted,\nhowever, that there is also 1 tryptophan residue in the linker region\nthat is present only in the tSH2 domain. It is therefore possible that\nligand binding is causing only the linker region tryptophan to\nchange its fluorescence and this too would explain the lack of\nbinding to the C-terminal SH2 domain.\nGPVI requires both FcR\u0001-chain YxxL sequences to signal\nThe results in Figures 2 to 7 support a dimerization model of\nCLEC-2 signaling. This raises the question as to whether ITAM\nreceptors, which contain a tandem YxxL sequence, are able to\nactivate Syk through intermolecular binding between adjacent\nphosphorylated YxxL sequences or whether intramolecular binding\nto the doubly phosphorylated YxxLs of a single ITAM is essential\nfor activation. This question was addressed through the generation\nof single point mutations (Y-F) of the conserved ITAM tyrosines in\nthe FcR\u0001-chain, which associates with GPVI. An N-terminal\nMyc-tagged version of the FcR\u0001-chain, which supports a similar\nlevel of signaling to that of the wild-type protein,22 was used in\nthese studies to enable measurement of the level of surface\nexpression. As shown in Figure 8, mutation of the C-terminal\nITAM tyrosine abolished NFAT activation by collagen in DT40\ncells transfected with GPVI and the mutant FcR\u0001-chain, whereas\nmutation of the N-terminal ITAM tyrosine suppressed the response\nby more than 95%, despite similar expression levels of both GPVI\nand FcR\u0001-chain as measured by flow cytometry (supplemental\nFigure 5). Thus, these results demonstrate that both ITAM tyrosines\nare required for robust signaling by the GPVI-FcR \u0001-chain\ncomplex and that the FcR\u0001-chain is unable to function efficiently\nwith phosphorylation of only a single YxxL.\nDiscussion\nThe results presented in the previous section support a model in\nwhich CLEC-2 regulates Syk through dimerization with each of the\nFigure 6. Surface plasmon resonance measurements and quantitative Western blotting of the CLEC-2-Syk SH2 interaction. (A) Biotinylated CLEC-2 and FcR\u0001 chain\npeptides were bound to streptavidin-coated biosensor chip surfaces. The N-SH2, C-SH2, or the tandem SH2 domains of Syk were purified and flowed over the chip at a range\nof concentrations. Nonlinear regression was used to analyze the data and calculate KD values. The results are representative of 3 experiments. (B) GST-tagged Syk SH2\ndomain proteins were incubated with a 50-fold excess of biotinylated phospho-CLEC-2 peptide and precipitated with glutathione-agarose beads. The precipitated proteins\nwere dot-blotted, and the amount of associated CLEC-2 was measured using HRP-streptavidin and densitometric analysis. The result is representative of 4 experiments.\nFigure 7. Tryptophan fluorescence titration measurements of the CLEC-2-Syk\nSH2 interaction. The purified tandem SH2 domains of Syk were placed into a quartz\ncuvette in a Photon Technology International spectrofluorimeter. After excitation at\n295 nm, emission at 340 nm was plotted during titration of a CLEC-2 peptide.\nNonlinear regression was used to analyze the data and calculate KD values. The\ngraph is representative of 3 experiments.\nFigure 8. GPVI signaling requires both ITAM tyrosines. DT40 cells were\ntransfected with 2 \u0006g\/mL stated FcR\u0001-chain construct, 2 \u0006g\/mL GPVI, along with an\nNFAT-luciferase reporter gene. Transfected cells were then stimulated with 10 \u0006g\/mL\ncollagen for 6 hours at 37°C, after which time the amount of luciferase activity was\nmeasured as a readout of signaling. Results were normalized for transfection\nefficiency and plotted as a percentage of the wild-type response. Error bars represent\nthe geometric mean\u000b SE of 3 separate experiments.\nCLEC-2 ACTIVATES Syk AS A DIMER 2953BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\n2 Syk SH2 domains binding to a phosphorylated YxxL sequence in\nthe individual cytosolic tails of CLEC-2, which itself is present as a\ndimer on the platelet surface. The evidence in support of this model\nis as follows: (1) it has previously been reported that both SH2\ndomains of Syk are essential for activation by CLEC-211; (2) the\nCLEC-2 cytosolic tail contains a single YxxL sequence that, when\nphosphorylated, is essential for activation of NFAT; (3) a signifi-\ncant proportion of CLEC-2 is present as a dimer in nonstimulated\nplatelets and converted to higher-order structures on stimulation;\n(4) coexpression of FxxL mutant CLEC-2 inhibits signaling by the\nwild-type receptor; (5) there is no evidence for a second (direct or\nindirect) binding site for Syk in the CLEC-2 cytoplasmic tail; (6)\nsurface plasmon resonance has shown that both SH2 domains of\nSyk have micromolar affinity for the tyrosine-phosphorylated\nCLEC-2 and that they interact in a cooperative manner to facilitate\nbinding; and (7) quantitative Western blotting confirms a stoichiom-\netry of 2:1 for the interaction between CLEC-2 and Syk. The other\nC-type lectin receptors, which have been shown to regulate Syk\nthrough a single YxxL sequence, Dectin-1, and CLEC9A, may also\nfunction as dimers. An alignment of the cytoplasmic tails of all 3\nreceptors emphasizes their overall similarity in organization but\nfails to identify a conserved or recognized sequence that probably\nconfers binding, either directly or indirectly, to the second SH2\ndomain of Syk. Further, CLEC9A is expressed as a covalently\nlinked dimer, adding weight to the proposed dimerization model.14\nThese data therefore suggest that the minimum signaling unit for\nCLEC-2 and the 2 related C-type lectin receptors is a phosphory-\nlated dimer, enabling recruitment of a single molecule of Syk. An\nalternative model in which Syk cross-links 2 CLEC-2 dimers is\nalso possible.\nThe cross-linking experiments in stimulated platelets also\nindicate the presence of oligomeric forms of CLEC-2, and it is\npossible that these contribute to the proposed model for activation\nof Syk by creating a critical density of phosphorylated YxxLs.\nAlternatively, the apparent formation of CLEC-2 oligomers may be\nthe result of binding to rhodocytin, which is a tetramer and so could\ntherefore cross-link multiple receptors,32 although the presence of\nthe snake toxin itself in these higher-order structures was not\ndetected. It is also possible that the higher molecular structures\ncould represent binding to other membrane proteins, although no\nspecific binding partners of CLEC-2 have been reported.\nOligomerization of CLEC-2 on the platelet surface is also\nsupported by electron microscopy, which clearly demonstrates\ncouplets of CLEC-2 on the surface of resting platelets with a\nseparation of only 14 nm. In the crystal structure of monomeric\nCLEC-2, the shortest axis of the monomer is approximately 20 nm\nand the longest axis is approximately 40 nm.33 Therefore, the\nepitope that is bound by the antibody used in these studies must lie\non a region of the surface of each CLEC-2 monomer that is near the\nequivalent region on the paired monomer. This is probably near the\ndimer interface. Although the crystal structure of CLEC-2 fails to\npredict a dimerization motif, C-type lectin-like molecules can form\ndimers with a reasonably large interface without a precise dimeriza-\ntion motif. In the related C-type lectin-like molecule NKG2D, for\nexample, large patches of surface on the monomers interact to\nproduce the dimer, and the interface includes 19 hydrogen bonds\nand 72 van der Waals contacts.34 The surface buried within the\ndimer interface of NKG2D accounts for approximately 15% of the\ntotal monomer surface. The size of the CLEC-2 dimer interface is\nunclear, but the interface is sufficiently strong to hold the 2 mono-\nmers together in the absence of disulfide bond formation. It will be\nparticularly interesting to establish whether or not the distance\nbetween the labeled antibodies is altered in the presence of ligand,\nwhich could in principle introduce a conformational change in the\ndimer configuration. If this occurs, then the interface itself may\nundergo a significant change on ligand binding, which might be of\nsignificance with respect to CLEC-2 phosphorylation and intracel-\nlular signaling.\nThe dimerization model represents a unique mode of regulation\nof Syk and contrasts with that used by ITAM receptors, which\nrequire phosphorylation of the 2 conserved tyrosines in the ITAM\nfor optimal signaling. Given the dimerization model, it is of interest\nto consider why the FcR\u0001-chain does not function in this way as\nshown by the dramatic inhibition of NFAT activation after mutation\nof the individual FcR\u0001-chain YxxL sequences. One possible\nexplanation is that the FcR\u0001-chain, which is a covalent dimer, is\nexpressed in a conformation that does not favor cross-linking of\nYxxL groups on separate chains, possibly to minimize constitutive\nsignaling in the absence of agonist binding. On the other hand, the\npresence of 2 YxxL groups on the same chain facilitates binding to\nproteins with tandem SH2 domains without a need for receptor\ndimerization\/oligomerization. This is illustrated by comparison of\nthe KDs derived for binding of single and tandem SH2 domains of\nSyk to immobilized tyrosine-phosphorylated peptides in the\nsurface plasmon resonance experiments described in Figures 6\nand 7. Dual YxxL groups that form an ITAM are found in\nseparate exons (http:\/\/www.ensembl.org), suggesting that ITAM-\nlike receptors may have preceded ITAM receptors. The greater\nnumber of ITAM receptors over ITAM-like receptors may\nreflect an evolutionary advantage in having 2 YxxL groups on\nthe same protein, although this may also reflect the fact that the\nmajority of ITAM receptors are composed of multiple chains\nand therefore unable to undergo dimerization\/oligomerization.\nIndeed, it is noteworthy that the low-affinity immune receptor,\nFc\u0001RIIA, which contains 2 YxxL groups in a classic ITAM\nsequence, does not appear to be present as a dimer in resting\nplatelets as shown in the cross-linking studies.\nIn conclusion, the present observations support a novel dimer-\nization model of activation of Syk by the C-type lectin receptor\nCLEC-2 in which the tyrosine kinase cross-links 2 CLEC-2\nreceptors through binding of its tandem SH2 domains to the\nconserved YxxL motif in each receptor. Confirmation of this model\nin an intact cell will require the application of specialist fluorescence-\nbased imaging techniques, such as Fo¨rster resonance energy\ntransfer. Such studies are ongoing in the laboratory.\nAcknowledgments\nThe authors thank Drs Katsue Suzuki-Inoue and Yukio Ozaki for\nthe antibody to mouse CLEC-2.\nThis work was supported by The Wellcome Trust (073107 and\n088410), the British Heart Foundation (BHF; PG\/07\/116 and\nPG\/05\/134), the Medical Research Council, and the Deutsche\nForschungsgemeinschaft (grant SFB\/TR23 project A8; J.A.E.).\nC.E.H. is a PhD student at the University of Birmingham.\nM.G.T. is a BHF Senior Research Fellow (FS\/08\/062). C.A.O. is a\nMedical Research Council Senior Clinical Research Fellow (G116\/\n165). S.P.W. holds a BHF Chair (CH\/03\/003).\n2954 HUGHES et al BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\nAuthorship\nContribution: C.E.H. designed and performed research, collected,\nanalyzed, and interpreted data, made the figures, and wrote the\nmanuscript; A.Y.P., J.M., and J.H.H. designed and performed\nresearch and collected, analyzed, and interpreted data; J.A.E.\ncontributed vital reagents; M.G.T. designed research and inter-\npreted data; C.A.O. and K.F. designed research and analyzed and\ninterpreted data; and S.P.W. designed research, interpreted data,\nand wrote the paper.\nConflict-of-interest disclosure: The authors declare no compet-\ning financial interests.\nCorrespondence: Craig E. Hughes, Centre for Cardiovascular\nSciences, Institute for Biomedical Research, College of Medical\nand Dental Sciences, University of Birmingham, Edgbaston,\nBirmingham, B15 2TT, United Kingdom; e-mail: c.e.hughes@\nbham.ac.uk.\nReferences\n1. Colonna M, Samaridis J, Angman L. Molecular\ncharacterization of two novel C-type lectin-like\nreceptors, one of which is selectively expressed\nin human dendritic cells. Eur J Immunol. 2000;\n30(2):697-704.\n2. Kerrigan AM, Dennehy KM, Mourao-Sa D, et al.\nCLEC-2 is a phagocytic activation receptor ex-\npressed on murine peripheral blood neutrophils.\nJ Immunol. 2009;182(7):4150-4157.\n3. Sobanov Y, Bernreiter A, Derdak S, et al. A novel\ncluster of lectin-like receptor genes expressed in\nmonocytic, dendritic and endothelial cells maps\nclose to the NK receptor genes in the human NK\ngene complex. Eur J Immunol. 2001;31(12):\n3493-3503.\n4. Suzuki-Inoue K, Fuller GL, Garcia A, et al. A novel\nSyk-dependent mechanism of platelet activation\nby the C-type lectin receptor CLEC-2. Blood.\n2006;107(2):542-549.\n5. Suzuki-Inoue K, Kato Y, Inoue O, et al. Involve-\nment of the snake toxin receptor CLEC-2, in po-\ndoplanin-mediated platelet activation, by cancer\ncells. J Biol Chem. 2007;282(36):25993-26001.\n6. Christou CM, Pearce AC, Watson AA, et al. Renal\ncells activate the platelet receptor CLEC-2\nthrough podoplanin. Biochem J. 2008;411(1):133-\n140.\n7. May F, Hagedorn I, Pleines I, et al. CLEC-2 is an\nessential platelet activating receptor in hemosta-\nsis and thrombosis. Blood. 2009;114(16):3464-\n3472.\n8. Gibbins J, Asselin J, Farndale R, Barnes M,\nLaw CL, Watson SP. Tyrosine phosphorylation of\nthe Fc receptor gamma-chain in collagen-stimu-\nlated platelets. J Biol Chem. 1996;271(30):\n18095-18099.\n9. Gibbins JM, Okuma M, Farndale R, Barnes M,\nWatson SP. Glycoprotein VI is the collagen recep-\ntor in platelets which underlies tyrosine phosphor-\nylation of the Fc receptor gamma-chain. FEBS\nLett. 1997;413(2):255-259.\n10. Underhill DM, Goodridge HS. The many faces of\nITAMs. Trends Immunol. 2007;28(2):66-73.\n11. Fuller GL, Williams JA, Tomlinson MG, et al. The\nC-type lectin receptors CLEC-2 and Dectin-1, but\nnot DC-SIGN, signal via a novel YXXL-dependent\nsignaling cascade. J Biol Chem. 2007;282(17):\n12397-12409.\n12. Rogers NC, Slack EC, Edwards AD, et al. Syk-\ndependent cytokine induction by Dectin-1 reveals\na novel pattern recognition pathway for C type\nlectins. Immunity. 2005;22(4):507-517.\n13. Xu S, Huo J, Lee KG, Kurosaki T, Lam KP. Phos-\npholipase Cgamma2 is critical for Dectin-1-\nmediated Ca2\t flux and cytokine production in\ndendritic cells. J Biol Chem. 2009;284(11):7038-\n7046.\n14. Huysamen C, Willment JA, Dennehy KM,\nBrown GD. CLEC9A is a novel activation C-type\nlectin-like receptor expressed on BDCA3\t den-\ndritic cells and a subset of monocytes. J Biol\nChem. 2008;283(24):16693-16701.\n15. Eble JA, Beermann B, Hinz HJ, Schmidt-Hederich A.\nalpha 2beta 1 integrin is not recognized by rhodocy-\ntin but is the specific, high affinity target of rhodoce-\ntin, an RGD-independent disintegrin and potent in-\nhibitor of cell adhesion to collagen. J Biol Chem.\n2001;276(15):12274-12284.\n16. Burkhardt AL, Stealey B, Rowley RB, et al. Tem-\nporal regulation of non-transmembrane protein\ntyrosine kinase enzyme activity following T cell\nantigen receptor engagement. J Biol Chem.\n1994;269(38):23642-23647.\n17. Gardiner EE, Karunakaran D, Arthur JF, et al.\nDual ITAM-mediated proteolytic pathways for irre-\nversible inactivation of platelet receptors: de-\nITAM-izing FcgammaRIIa. Blood. 2008;111(1):\n165-174.\n18. Qi R, Ozaki Y, Asazuma N, et al. FcgammaRII\ntyrosine phosphorylation differs between Fcgam-\nmaRII cross-linking and platelet-activating anti-\nplatelet monoclonal antibodies. Biochim Biophys\nActa. 1999;1451(2-3):353-363.\n19. Grucza RA, Futterer K, Chan AC, Waksman G.\nThermodynamic study of the binding of the tan-\ndem-SH2 domain of the Syk kinase to a dually\nphosphorylated ITAM peptide: evidence for two\nconformers. Biochemistry. 1999;38(16):5024-\n5033.\n20. McCarty OJ, Zhao Y, Andrew N, et al. Evaluation\nof the role of platelet integrins in fibronectin-\ndependent spreading and adhesion. J Thromb\nHaemost. 2004;2(10):1823-1833.\n21. Suzuki-Inoue K, Inoue O, Frampton J, Watson SP.\nMurine GPVI stimulates weak integrin activation in\nPLCgamma2\r\/\r platelets: involvement of PL-\nCgamma1 and PI3-kinase. Blood. 2003;102(4):\n1367-1373.\n22. Mori J, Pearce AC, Spalton JC, et al. G6b-B in-\nhibits constitutive and agonist-induced signaling\nby glycoprotein VI and CLEC-2. J Biol Chem.\n2008;283(51):35419-35427.\n23. Shapiro VS, Mollenauer MN, Greene WC,\nWeiss A. c-rel regulation of IL-2 gene expression\nmay be mediated through activation of AP-1. J\nExp Med. 1996;184(5):1663-1669.\n24. Tomlinson MG, Kane LP, Su J, Kadlecek TA,\nMollenauer MN, Weiss A. Expression and func-\ntion of Tec, Itk, and Btk in lymphocytes: evidence\nfor a unique role for Tec. Mol Cell Biol. 2004;\n24(6):2455-2466.\n25. Hoffmeister KM, Felbinger TW, Falet H, et al. The\nclearance mechanism of chilled blood platelets.\nCell. 2003;112(1):87-97.\n26. Frenette PS, Denis CV, Weiss L, et al. P-Selectin\nglycoprotein ligand 1 (PSGL-1) is expressed on\nplatelets and can mediate platelet-endothelial\ninteractions in vivo. J Exp Med. 2000;191(8):\n1413-1422.\n27. Germano P, Gomez J, Kazanietz MG, Blumberg PM,\nRivera J. Phosphorylation of the gamma chain of the\nhigh affinity receptor for immunoglobulin E by recep-\ntor-associated protein kinase C-delta. J Biol Chem.\n1994;269(37):23102-23107.\n28. Swann PG, Odom S, Zhou YJ, et al. Requirement\nfor a negative charge at threonine 60 of the FcR-\ngamma for complete activation of Syk. J Biol\nChem. 1999;274(33):23068-23077.\n29. Pears CJ, Thornber K, Auger JM, et al. Differen-\ntial roles of the PKC novel isoforms, PKCdelta\nand PKCepsilon, in mouse and human platelets.\nPLoS One. 2008;3:e3793.\n30. Tomlinson MG, Calaminus SD, Berlanga O, et al.\nCollagen promotes sustained glycoprotein VI sig-\nnaling in platelets and cell lines. J Thromb Hae-\nmost. 2007;5(11):2274-2283.\n31. Kim AS, Kakalis LT, Abdul-Manan N, Liu GA,\nRosen MK. Autoinhibition and activation mecha-\nnisms of the Wiskott-Aldrich syndrome protein.\nNature. 2000;404(6774):151-158.\n32. Watson AA, Eble JA, O’Callaghan CA. Crystal\nstructure of rhodocytin, a ligand for the platelet-\nactivating receptor CLEC-2. Protein Sci. 2008;\n17(9):1611-1616.\n33. Watson AA, Brown J, Harlos K, Eble JA, Walter TS,\nO’Callaghan CA. The crystal structure and muta-\ntional binding analysis of the extracellular domain of\nthe platelet-activating receptor CLEC-2. J Biol Chem.\n2007;282(5):3165-3172.\n34. Wolan DW, Teyton L, Rudolph MG, et al. Crystal\nstructure of the murine NK cell-activating receptor\nNKG2D at 1.95 A. Nat Immunol. 2001;2(3):248-\n254.\nCLEC-2 ACTIVATES Syk AS A DIMER 2955BLOOD, 8 APRIL 2010 \u0001 VOLUME 115, NUMBER 14\n"}