{"doi":"10.1163\/157181210X527091","coreId":"103161","oai":"oai:epubs.surrey.ac.uk:2971","identifiers":["oai:epubs.surrey.ac.uk:2971","10.1163\/157181210X527091"],"title":"Negotiated history: The historical record in international criminal law and plea bargaining","authors":["Rauxloh, RE"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2010","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2971<\/identifier><datestamp>\n      2017-10-31T14:07:19Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:6C617770756273<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2971\/<\/dc:relation><dc:title>\n        Negotiated history: The historical record in international criminal law and plea bargaining<\/dc:title><dc:creator>\n        Rauxloh, RE<\/dc:creator><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2971\/2\/Negotiated%20History%20-%20Rauxloh%20unedited.doc<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2971\/4\/licence.txt<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2971\/6\/licence.txt<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2971\/7\/Negotiated_History_-_Rauxloh_unedited.pdf<\/dc:identifier><dc:identifier>\n          Rauxloh, RE  (2010) Negotiated history: The historical record in international criminal law and plea bargaining   International Criminal Law Review, 10 (5).  pp. 739-770.      <\/dc:identifier><dc:relation>\n        http:\/\/www.brill.nl\/international-criminal-law-review-0<\/dc:relation><dc:relation>\n        10.1163\/157181210X527091<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2971\/","http:\/\/www.brill.nl\/international-criminal-law-review-0","10.1163\/157181210X527091"],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Negotiated History\nThe Historical Record in International Criminal Law and Plea Bargaining\nRegina E Rauxloh, University of Surrey, UK\n“However, there is no peace without justice; there is no justice without  truth,  meaning  the  entire\ntruth and nothing but the truth.”[1]\nAbstract\nOne of the most important functions of the international criminal trial is to create an accurate and\naccessible historical record. This paper analyses to what  extent  plea  bargaining  can  hinder  or\nfacilitate the establishment of the historical record. Drawing on the experience  of  the  ICTY  and\nthe ICTR the author makes a number of proposals as to what how and  to  extent  plea  bargaining\nshould be used at the ICC to advance rather than to obstruct the historical record.\nKeywords: International Criminal Law, Plea Bargaining, Historical Record\nThe Importance of the Historical Record\n“[I]t is only the truth that can cleanse the ethnic and religious hatreds and begin the healing\nprocess”[2]\nThe most important function of international criminal justice is the  restoration  of  peace.  Indeed,\nwhen the United Nations Security Council decided to set  up  international  criminal  tribunals  for\nthe conflicts in Yugoslavia[3] and Rwanda[4] they could do  so  only  within  the  mandate  of  the\nSecurity Council under Chapter VII of the United Nations  Charter  under  the  assumption  that  a\ncriminal trial is able to further international peace and security.[5] It is understood that  no  lasting\npeace can be achieved without justice  for  at  least  some  of  the  violence  committed  during  the\nconflict. However, justice is not served only by prosecuting and  sentencing  individual  offenders.\nWhat is of equal importance is that the roots, background and development, in short, the history of\nthe conflict is exposed. The extent of the victims’ suffering, the hierarchy of  the  power  structure,\nthe planning policies and any contributing factors need  to  be  revealed.  Only  when  the  truth  is\nestablished  can  reconciliation  begin.[6]  This  is  particularly  true  with  respect  to  the  role   of\npropaganda in widespread human rights violations. When violence is committed  on  such  a  large\nscale, turning so many civilians not only into victims but also into perpetrators it has  to  be  based\non  policies  which  could  have  been  implemented  only  by  the  extensive  use  of   propaganda.\nPropaganda is at the centre of inciting  ordinary  citizens  to  exercise  unbelievable  violence.  The\nvictim group needs to be portrayed both as sub-human as well as threatening in order  to  convince\n5\n5a large section of the population to commit or at least allow atrocities against their neighbours and\nfellow citizens. By establishing a historical record it is hoped to „pierce  the  distortions  generated\nby  official  propaganda“[7]  “before  the  guilty  could  reinvent  the  truth”.[8]  In  addition  it   is\nimportant to put names to the central faces behind  the  atrocities  so  that  individuals  rather  than\ngroups are blamed. One generally expects “that such a historical record would prevent  a  cycle  of\nrevenge killings and future acts of aggression“.[9] Besides its value for healing and reconciliation,\ntruth telling is also essential at the political level to foster the  difficult  transition  from  repressive\nregimes to democracy.[10] A detailed historical record will  help  the  new  leadership  to  make  a\nclear break with the violent history and build a social and political system  in  which  repetition  of\nthe conflict will  be  prevented.  Consequently,  to  establish  as  accurate  as  possible  a  historical\nrecord of the roots  and  the  development  of  the  violence  is  one  of  the  main  functions  of  all\ninternational criminal courts.\nThe  term  plea  bargaining  is  used  here  as  a  generic  expression   for   different   forms   of\nagreements  between  the  Defence  and  the  Prosecution  (and  sometimes  even  the  court).   The\ncommon denominator is that the defendant admits all or some of  the  charges  in  exchange  for  a\nlower sentence. Very often there are additional parts to the deal, such as  a  promise  to  waive  the\nright to appeal, to provide evidence against other  defendants,  or  to  help  locating  assets  etc.  In\nexchange the Prosecution offers to drop some of the charges or to  replace  them  with  charges  of\nlesser crimes[11] (charge bargaining) or to recommend a particular sentence  or  sentencing  range\nto the court (sentence bargaining). Other offers to defendants include dropping  charges  against  a\nspouse,  or  special  prison  conditions,  for  example  the  location  of  imprisonment  in  a  certain\ncountry. In the ICTR for example,  many  defendants  would  prefer  a  European  prison  not  only\nbecause often the families of defendants  of  high  rank  have  relocated  in  Europe  but  moreover\nbecause European criminal justice systems mostly offer early release after  half  or  a  third  of  the\nsentence has been served.[12] In Rutaganira, for example, the Prosecution agreed  to  recommend\nthat the sentence should be served in Europe or Swaziland (rather than in Mali where  most  ICTR\nconvicts serve).[13]\nOnce the defendant has admitted his  or  her  guilt  no  trial  is  needed[14]  and  the  procedure\nmoves on to the sentencing stage. Plea bargaining in some form or other[15] has developed in  the\nUnited States in the  19th  Century[16]  and  then  rapidly  spread  to  many  other  criminal  justice\nsystems including civil law countries such as  Germany,  France  and  Italy.[17]  It  has  now  been\nused even in international criminal law.[18] In domestic criminal  law  it  is  often  claimed  that  a\nmodern criminal justice system would collapse if it were not for the fact that the majority of  trials\nare replaced by informal negotiations.[19] However, while supporters praise the efficiency of  this\npractice that frees up so  many  resources,  opponents  warn  that  defendants  lose  the  procedural\nsafeguards of a trial (most of all the presumption of innocence), that victims are not heard, that the\npublic is excluded and that convicted criminals receive too lenient sentences.\nThis paper discusses whether the practice of plea bargaining might threaten the  courts’  ability\nto establish an accurate and accessible historical record and thus might undermine one of  its  most\nimportant functions. It will focus on the two international tribunals, the ICTY and the  ICTR.  The\nICTY has been chosen as a case study of how plea bargaining has been introduced to international\nlaw and has developed over  the  years.  The  ICTR  on  the  other  hand,  is  one  of  the  very  few\nexamples  where  the  Tribunal  and  the  Prosecution  have  not  succeeded  in   establishing   plea\nbargaining as wide used practice. After having examined  the  development  and  problems  at  the\ntwo ad hoc tribunals this paper concludes by making a number of  proposals  for  the  use  of  plea\nbargaining in the International Criminal Court (ICC).\nThe Trial as Fact Finding Tool\n“We must establish incredible events by credible evidence.”[20]\nThe close link between historical truth, reconciliation and  peace  mentioned  above  is  the  reason\nwhy so many transitional societies have established Truth  and  Reconciliation  Commissions.[21]\nInternational criminal trials, too, play  a  decisive  role  in  establishing  an  accurate  and  publicly\naccessible historical record. Yet one has to examine closely what contribution a criminal  trial  can\nmake. Neither judges  nor  prosecutors  nor  defence  counsels  are  normally  trained  in  historical\nresearch and only rarely are historians invited to  give  expert  testimony.[22]  In  addition  to  this\nthere are three aspects of a criminal trial which potentially hinder the courts’ capacity  to  create  a\nuseful historical record.\nFirst  of  all,   most   ad   hoc   tribunals   have   only   a   limited   temporal   and\/or   territorial\njurisdiction[23]  which  often  does  not  cover  the  whole  conflict.  For  example,  the  ICTR  has\njurisdiction only over the events of the year 1994[24] not including the crimes before or  after  this\ntime. Further, like municipal courts, international courts have to work with very limited  resources\nand have to confine themselves to a minority of many  possible  cases.  Accordingly  they  usually\nconcentrate on those most responsible for the most serious  crimes,  such  as  political  or  military\nleaders, while a great number of perpetrators are not even investigated.[25] And  even  in  the  few\nremaining cases the Prosecution very often does not charge all  possible  offences  but  focuses  on\ncertain events at a certain location (maybe one concentration camp) or  of  a  certain  date  (maybe\nthe date of one massacre).[26] Consequently, in total only a small minority  of  crimes  committed\nin a  conflict  will  be  brought  to  justice  and  made  part  of  the  historical  record  of  the  court.\nNevertheless, concentrating on the most responsible offenders and  uncovering  their  contribution\nand responsibility will add valuable information to the history of the whole conflict.\nSecondly, only individuals are put on trial[27] and all evidence has to be related to the relevant\ncharges against this individual defendant rather than the general historic background. Many  argue\ntherefore that truth commissions are in a better position to paint  a  comprehensive  picture  of  the\nbroader context  of  the  violence.[28]  Having  said  this  one  must  not  forget  that  many  of  the\noffences require the Prosecution to prove elements which comprise the  general  background  such\nas  the  presence  of  an  international  or  non-international  armed  conflict[29]  a  widespread   or\n5\n5systematic attack directed  against  any  civilian  population  [30]  or  intent  to  destroy  part  of  a\ngroup.[31] Thus the fact finding of an individual case  might  very  well  include  evidence  of  the\nlarger context of the  conflict  including  the  operation  of  the  regime  and  general  policies,  co-\noperation between different agencies, the role of the media, the involvement  of  army  and  police\netc.\nFinally, fact finding in court is  limited  by  very  strict  evidential  rules  which  might  declare\nevidence inadmissible even if it is of vital value for the historical record.[32]  However,  the  rules\nof evidence are generally much freer than in most  adversarial  systems.  For  example,  the  Rome\nStatute  does  not  exclude  hearsay  evidence[33]  which  is  often  inadmissible  in  common  law\ncountries. The prime example of successful  building  of  a  historical  record  are  the  Nuremberg\ntrials which in less than eleven months in only twenty-two cases  exposed  the  Holocaust  and  the\nworkings of the Nazi regime.[34] Today Germany under Nazi rule is  one  of  the  best  researched\ntimes  in  history.  The  Prosecution  in  spite  of   being   dependent   on   state   co-operation   has\ninvestigative powers which  far  exceed  the  possibilities  of  a  historian,  such  as  access  to  eye\nwitnesses, expert witnesses and documents.  Beyond  and  above  establishing  a  historical  record\nthrough trial  does  not  only  help  to  find  out  what  happened  but  moreover  it  provides  for  a\nmechanism  to  validate  these  findings.  The  limits  of  evidential  and  procedural   rules   confer\nlegitimacy and credibility to the outcome. An independent court establishes facts through a  public\ntrial where each element needs to be  proven  beyond  reasonable  doubt.  Thus  not  only  will  the\ncriminal investigation uncover the truth but the test of a  criminal  trial  will  also  validate  it.  The\nthorough investigation of high profile offenders, the strict rules of  evidence  and  the  rule  of  law\nwhich allows both sides to be heard make the international criminal trial a most appropriate forum\nfor building an accurate historical record of the atrocities.\nDoes Plea Bargaining Hinder Building of a Historical Record?\n“The Trial Chamber finds that, on balance, guilty pleas pursuant to  plea  agreements,  may\nfurther the work – and the mandate – of the Tribunal.”[35]\nHaving established the  importance  of  the  historical  record  and  the  important  contribution  an\ninternational criminal trial can make it will now be examined to what extent  the  practice  of  plea\nbargaining supports or undermines  this  aim.  After  reviewing  briefly  the  development  of  plea\nbargaining at the ICTY this section will examine the effects of plea bargaining on the  building  of\na historical record, i.e. the avoidance of the full trial, the dropping of charges and  the  question  of\nhow to validate whether a guilty plea is genuine.\n1 Development in ICTY\nDuring the process of drafting the ICTY  Statute[36]  and  its  Rules  of  Evidence  and  Procedure\n(ICTY-RPE)   the   United   States   proposed   to   incorporate    plea    bargaining[37]    but    was\nunsuccessful.[38] When the question was raised again later, the tribunal made it quite clear that an\ninternational criminal tribunal was no place for plea bargaining.[39] Acknowledging some  of  the\nbenefits of plea bargaining the then President Antonio Cassese declared that the crimes before this\ntribunal were too abhorrent to be part of a negotiation with the defendant.[40]\nThe situation changed dramatically, however,  when  the  international  community  employed\nfinancial incentives to encourage the Balkan authorities to transfer indictees  to  the  Tribunal  and\nNATO agreed to arrest indictees.[41] Both developments meant that the caseload of the court  was\ngrowing rapidly and that to hold  full  blown  trials  for  each  defendant  became  more  and  more\ndifficult. The pressure increased further  when  the  United  Nations  Security  Council  outlined  a\ncompletion strategy in 2003 requiring bringing to a conclusion all trial  activities  at  first  instance\nby the end of 2008.[42] Aside from a few procedural amendments[43] one of the major  strategies\nto cope with the case load was to begin to allow plea bargaining. A contributing factor was  surely\na change in ICTY presidency when Antonio Cassese was succeeded by Gabrielle Kirk  McDonald\nfrom  the  United  States,  where  the  majority  of  criminal  cases  are  dealt   with   through   plea\nbargaining.[44]\nAnalysing the cases which the ICTY dealt with through plea agreements  one  can  distinguish\nthree  phases.[45]  In  the  first  ten  years  only  eight  cases  were   disposed   of   involving   plea\nagreements   in   the   ICTY[46]   and   only    two    defendants    received    significant    sentence\nconcessions.[47]  The  first  defendant  at  the  ICTY  to  enter  into  a  plea   agreement   with   the\nProsecution was Stevan Todorovi?.[48] One has to note however, that the agreement  came  about\nbecause of very special circumstances. Todorovi? claimed that he was unlawfully  kidnapped  and\nhanded over to NATO forces  in  Bosnia-Herzegovina  (SFOR).  When  he  filed  an  interlocutory\nappeal challenging the legality  of  his  arrest  the  ICTY  Trial  Chamber  ordered  SFOR  and  the\nparticipating  states  to  provide   Todorovi?   with   wide-ranging   and   potentially   embarrassing\ninformation  about  the  incident.  Not  surprisingly  NATO,  the  United  States  and  other   states\nprotested vehemently.[49]  In  November  2000,  Defence  and  Prosecution  filed  a  joint  motion\nreflecting a plea agreement whereby Stevan Todorovi?  would  plead  guilty  to  count  one  of  the\nindictment.[50] Further, he would withdraw the interlocutory appeal and  the  allegations  that  his\narrest was unlawful. He also agreed to co-operate with the Prosecution and to testify against  other\nsuspects. In exchange the Prosecution would formally  request  the  withdrawal  of  counts  two  to\ntwenty-seven of the indictment. In addition they  agreed  to  recommend  to  the  Trial  Chamber  a\nsentence range of between five years and twelve years[51] although the Prosecution expressed the\nbelief that if found guilty at trial Todorovi? would have been  sentenced  to  at  least  15-25  years’\nimprisonment.[52] On 31 July 2001, he was sentenced to ten  years’  imprisonment  which  in  the\nview of the Trial Chamber was a very significant  sentence  concession.[53]  Although  it  is  quite\n5\n5obvious that the core of the deal was the withdrawal of the potentially  embarrassing  interlocutory\nappeal the trial Chamber pointed out that “a guilty plea  is  always  important  for  the  purpose  of\nestablishing the truth in relation to a crime.”[54] Notwithstanding  the  exceptional  circumstances\nof this case Todorovi? paved the way for future sentencing bargains. The Trial  Chamber  declared\nfor the first time that a guilty plea “should, in principle, give rise  to  a  reduction  in  the  sentence\nthat  the  accused  would  otherwise  have  received”.[55]  Five  months  after  this   first   case   of\nsentencing  bargaining  the  ICTY  adopted  Rule  62ter  which  provides   for   the   procedure   of\napproving plea agreements.[56]\nA case  which  illustrates  the  court’s  growing  preoccupation  with  how  to  deal  with  cases\nefficiently  is  Sikirica.[57]  The  three  defendants  (Du?ko  Sikirica,  Damir  Dosen  and   Dragan\nKolund?ija) were accused of not taking reasonable steps while they were in charge of the Keratem\nCamp  to  prevent  the  atrocities  in  the  camp  and  even  of  having  participated.[58]  All   three\ndefendants were granted quite a low sentence although they entered their guilty plea long after the\ntrial had started and the Prosecution had already closed their case and despite the fact that they did\nnot agree to testify against other accused or to co-operate in any other way.[59]  In  its  sentencing\njudgement the Court once again emphasised the mitigating effect of plea bargaining. Surprisingly,\nthe decision to enter a guilty plea seems to have been  given  more  value  than  the  expression  of\nremorse. “The Trial Chamber considers that the primary factor to be  considered  in  mitigation  of\nDu?ko Sikirica’s sentence is his decision to enter  a  guilty  plea,  although  it  will  also  take  into\naccount his expression of remorse.”[60]\nEven more interesting is that the contribution to truth finding of  a  guilty  plea  appears  to  be\nsecondary to saving time and effort for the Tribunal:\nA guilty plea facilitates the work of the International Tribunal in two ways. Firstly, by entering a plea of guilt\nbefore the commencement of his trial, an accused will save the International Tribunal the time and effort of a\nlengthy investigation and trial. Secondly, notwithstanding the timing of the guilty plea,  a  benefit  accrues  to\nthe Trial Chamber, because a guilty plea contributes directly  to  one  of  the  fundamental  objectives  of  the\nInternational Tribunal: namely, its truth-finding function.[61]\nIn the second phase, during the years 2002 and  2003,  one  can  observe  a  strong  rise  in  the\nnumbers of guilty pleas and generous sentence recommendations. However, at the  same  time  the\ndiscomfort of the judiciary seems to be growing  and  increasingly  the  Trial  Chambers  refuse  to\nfollow the negotiated sentence recommendations. In the case of Dragan  Nikoli?  for  example  the\njudges disregarded the Prosecution’s sentencing recommendation of  fifteen  years  and  sentenced\nthe defendant to twenty-three years instead.[62] The Court declared that “the brutality, the number\nof crimes  committed  and  the  underlying  intention  to  humiliate  and  degrade  would  render  a\nsentence such as [the Prosecution] recommended unjust.”[63] But the Court  emphasised  that  the\ndefendant still received some concession for his guilty plea without which he would have received\na life sentence.[64]  Reading  this  case  closely  it  seems  that  the  Court  wanted  to  convey  the\nimpression that  the  fault  for  the  disappointed  expectation  lay  with  the  Prosecution  who  had\noffered an unrealistically high discount which the Chamber could not follow. At the same time the\nChamber was anxious not to discourage future plea  agreements  and  stressed  that  the  defendant\nhad still benefited considerably.[65] However, the number of cases where the Trial Chamber went\nbeyond  the  Prosecution’s  recommendation   increased.   In   the   case   of   Momir   Nikoli?   the\nProsecution offered to recommend a sentence of fifteen  to  twenty  years’  imprisonment.  Instead\nthe Trial Chamber sentenced him to twenty-seven years[66] explaining “the  testimony  of  Momir\nNikoli? was evasive and […] an indication that his  willingness  to  co-operate  does  not  translate\ninto being fully forthcoming in relation to all the events, given his  position  and  knowledge”.[67]\nEven in cases  where  the  Court  sentenced  according  to  the  agreement  judges  expressed  their\ndiscomfort. In Deronji?[68] the  presiding  judge  Wolfgang  Schomburg  dissented  wholehearted\nwith the sentence reduction based on an agreement and declared that justice would  have  required\ndouble of his ten years’ prison sentence.[69] Reading Deronji?’s witness  statement  in  the  Krsti?\nAppeal hearing  it  becomes  clear  that  the  ICTY  had  information  about  more  involvement  of\nDeronjic than is reflected in his charges and sentence.\nAfter 2003 a third phase began, in which the number of guilty  pleas  decreased[70]  according\nto Combs for three reasons. First, victims’ groups and legal commentators  increasingly  criticised\nthe in their view much too lenient sentences and the avoidance of public trial.[71] Second Michael\nJohnson,  the  Chief  of  Prosecution  who  was  a  strong  advocate  of  plea  bargaining  and  who\npromoted many agreements left The Hague in 2003.[72] The third  and  probably  most  important\nreason for the drop in plea agreements however was that subsequent to the  repeated  rejections  of\nthe agreed sentence recommendation by the Court defendants lost the trust that the bargains would\nstand.[73]\nLooking at the development of plea bargaining at the ICTY it becomes clear that  initially  this\npractice had been developed as a response to the growing case pressure. Although the ICTY noted\nin 2003[74]  that  plea  bargaining  has  other  justifications  alongside  efficiency  initially  it  was\nclearly introduced as a measure to cope with an increasing caseload and insufficient resources.  As\nPetrig observes: “The timing of its introduction, after the docket had grown  considerably  and  the\nefficiency  and  completion  discussion   was   launched   supports   this   conclusion”.[75]   Scharf\nestimates that if “the ad hoc Tribunals had been given an additional  five  years  to  complete  their\nmandate, then the need for plea-bargaining could have been avoided.”[76] In the remainder of this\nsection it will be discussed whether  this  mechanism  of  efficiency  can  be  used  to  enhance  the\nhistorical record building function of international criminal procedures.\n2 Encouraging Guilty Pleas\nPlea bargaining offers one of the strongest incentives for defendants  to  enter  a  guilty  plea.  The\n5\n5fact  that  defendants  (especially  leading  figures)  admit   their   guilt   without   challenging   the\nallegations  at  trial  can  have  an  important  effect  on  the  credibility  of  the   historical   record.\nMoreover, not challenging the allegations but admitting responsibility can  also  make  a  valuable\ncontribution to reconciliation. In Nikoli? the Court underlined that the “recognition  of  the  crimes\ncommitted against the Bosnian Muslim population in 1995 […] by a  participant  in  those  crimes\ncontributes to establishing a historical record.”[77] The guilty plea of Plav?i? was  praised  by  the\nProsecution as “an unprecedented contribution to the establishment of truth and a significant effort\ntoward the advancement of reconciliation”.[78] Biljana Plav?i?, known as the ‘Serbian Iron Lady’\nserved under the Bosnian Serb leader Radovan Karadzic as deputy and later  became  President  of\nthe Republika Srpska. Even though she did not directly participate in  the  atrocities  she  provided\nimportant assistance by publicly promoting displacement and encouraging  Serbian  paramilitaries\nto participate in the ‘ethnic cleansing’.[79] Although she repeatedly refused to testify against other\nsuspects, Plav?i? acknowledged that the Bosnian  Serb  leadership  had  been  responsible  for  the\nwide  spread  ‘ethnic  cleansing’[80]  and  that   the   Bosnian   forces   with   support   of   Serbian\nparamilitary units and even Yugoslavia’s army, implemented the  “objective  of  ethnic  separation\nby force”.[81] No less than Madeleine Albright, then U.S. Secretary  of  State  during  the  Clinton\nadministration,  and  Dr  Alex  Boraine,  Deputy  Chairperson  of  the  South  African   Truth   and\nReconciliation  and  founding  President  of  the   International   Centre   for   Transitional   Justice\nemphasised the contribution towards reconciliation in Bosnia Plav?i? made  with  her  guilty  plea.\nDr Boraine praised “the acknowledgement and acceptance of responsibility for grave  crimes,  and\nthe impact this can  have  on  the  process  of  reconciliation.”[82]  He  gave  four  reasons  for  the\nsignificance of Plav?i?’s plea of guilty:\nfirstly, as the plea of guilty was offered by  a  Serb  nationalist  and  former  political  leader,  Mrs.  Plav?i?’s\nconfession sends out a crucial message about the true  criminal  nature  of  the  enterprise  in  which  she  was\ninvolved; secondly, by surrendering and pleading guilty, Mrs. Plav?i?  is  also  sending  a  powerful  message\nabout the legitimacy of the International Tribunal and its functions; thirdly,  Mrs.  Plav?i?’s  apology  for  her\nactions and her call on other leaders to examine their own conduct is of particular  importance;  and  fourthly,\nthe confession of guilt and acceptance of responsibility by Mrs. Plav?i? may  demonstrate  to  the  victims  of\nthe persecutory campaign that someone has acknowledged their personal suffering.[83]\nUnlike Todorovi?, Plav?i? refused repeatedly to co-operate with the  court  beyond  her  guilty\nplea, in particular to testify against Slobodan Milosevi?. Nevertheless the Trial Chamber held  that\nthe mitigation effect of the guilty plea outweighed the gravity of the crime,  because  she  admitted\nresponsibility for the deaths of tens of thousands  of  civilians.  Plav?i?  was  sentenced  to  eleven\nyears imprisonment with the possibility of early  release  for  good  behaviour[84]  on  grounds  of\nfour  mitigating  circumstances:  her  voluntary  surrender,  her   age,   her   post-conflict   conduct\n(actively  supporting  and  being  instrumental   in   the   implementation   of   the   Dayton   Peace\nAgreement by taking political and personal risks) and her guilty plea.[85]\nIt is hoped that if the leaders admit their guilt their followers  will  accept  the  truth  about  the\natrocities and accept  the  injustice  done  to  the  victims.  Confessions  of  important  leaders  will\ndiminish  the  risk  that  former  crimes  are  denied  or  justified.  Thus   an   admission   of   guilt,\nencouraged by plea bargaining might contribute more to  reconciliation  than  the  conviction  of  a\ndefendant who is claiming his innocence or tries to justify the atrocities committed.  On  the  other\nhand an admission which is submitted alone for tactical reasons will have the  opposite  effect.  As\nsoon as Plav?i? received early release after having served two thirds of  her  11-year  sentence  she\nretracted her confession and declared “I sacrificed myself. I have done nothing  wrong.  I  pleaded\nguilty to crimes against humanity so I could bargain for  the  other  charges.  If  I  hadn’t,  the  trial\nwould have lasted three, three and-a-half years. Considering my age that wasn’t an option.”[86]\nThis proof of lack of genuine remorse is confirmed by the fact that with  the  exception  of  her\ntestimony against Momcilo Kraji?nik, Plav?i? has consistently refused  any  cooperation  with  the\nTribunal. Her case proves that although plea bargaining can encourage admissions of guilt,  which\nserve the historical record and reconciliation, it can also undermine both aims  if  the  incentive  of\nthe bargain is so strong that it triggers non insincere  admissions.  In  addition  to  this  there  are  a\nnumber of aspects, which mean that plea bargaining can  undermine  the  building  of  a  historical\nrecord.\n3 Loss of Trial\nThe first problem is that plea bargaining bypasses the fact finding trial which has the  potential  of\nmaking a very significant contribution to the historical record as  was  shown  above.  Rather  than\nhaving a huge volume of evidence examined and being able to paint a detailed picture of what has\nhappened, the defendant agrees simply to  the  Prosecution’s  summary  of  facts.  Biljana  Plav?i?\nwhen pleading guilty did not reveal any new  facts[87]  but  merely  confirmed  the  statement  the\nProsecutor has submitted in a short five-page document.[88] In  comparison,  a  judgement  of  the\nICTY tends to  comprise  several  hundreds  of  pages,[89]  and  trial  transcripts  run  into  tens  of\nthousands of pages in addition to witness statements, official documents and other evidence.[90]\nFurthermore, in case of a guilty plea the facts stated by the  Prosecution  and  admitted  by  the\nDefence are not tested in trial under strict evidentiary rules and thus might not have credibility  for\nthe public. Taking again the example of Plav?i?, rather  than  accepting  the  new  truth  about  the\nSerbian leadership, many Serbs disregarded the admission of guilt as treachery of Plav?i?  who  in\ntheir eyes only agreed to these facts for her own personal benefits.[91]\nMoreover the acceptance of a guilty plea bears the risk that important legal  questions  are  not\ncontested and discussed at trial. In the case of Erdemovi?, for example, the guilty  plea  avoided  a\nfull discussion of the question of duress at trial. In the  sentencing  judgement  the  Trial  Chamber\ncame to the conclusion that on“the  basis  of  the  case-by-case  approach  and  in  light  of  all  the\nelements before it, the Trial Chamber is of the view that proof of the specific circumstances which\nwould fully exonerate the accused of his responsibility has not been provided.”[92]  This  question\nshould have been discussed in court where Erdemovi? would have had the opportunity  to  present\nsuch evidence or even challenge the burden of proof in the first place.[93]\n5\n54 Charge Bargaining\nThe main problem regarding the aim of painting a comprehensive  historical  picture,  however,  is\nthe practice of charge bargaining, in which the prosecution withdraws charges  in  exchange  for  a\nguilty plea to the remaining charges. Not  only  does  the  defendant  not  need  to  admit  or  reject\nresponsibility for the withdrawn crimes but moreover the facts  underlying  these  charges  are  not\nread into the court records at all.  All  evidence  collected  for  these  charges  by  the  Prosecution,\nincluding reliable eye witness statements, are lost for the  general  historical  record.  Even  worse,\nwhen charges are dropped it is not recorded whether this is  part  of  an  agreement  or  because  of\nlack of sufficient evidence on the part of the  Prosecution.[94]  This  means  that  the  dropping  of\ncharges can be interpreted as if those crimes have not happened at all.[95]\nIn Plav?i? of the two  counts  of  committing  genocide  and  complicity  in  genocide  and  six\ncounts  of  committing  crimes  against  humanity  all  except  one   charge   of   persecution   were\ndropped.[96] Another case where the plea agreement  resulted  in  avoiding  a  trial  which  should\nhave taken place is Simi?,[97] which demonstrates very clearly how much importance is  given  to\nefficiency considerations. Blagoje Simi? surrendered  voluntarily  to  the  ICTY  and  pleaded  not\nguilty to all counts. Eight months after the trial began, on 15 May 2002, he pleaded  guilty  to  two\ncounts of torture as a crime against humanity in exchange for a low sentence recommendation (not\nmore than five years’ imprisonment) and the dropping of all other counts. A  bargain  was  offered\nto the defendant although the Prosecution felt that they had good evidence and thus  good  chances\nof a conviction  because  they  considered  that  the  ill  health  of  the  defendant  would  probably\nprolong  the  trial  considerably.[98]  Considering  the  seriousness  of  all  the  charges  that   were\ndropped notwithstanding a good chance of finding Simi? guilty of each of them the  low  sentence\ncannot be justified by the savings in resources made.  In  Nikoli?  the  ICTY  pointed  out  that  the\nsentence must mirror the responsibility of the defendant and “reflect the actual conduct and  crime\ncommitted and must not simply reflect the agreement of the parties as to what would be a  suitable\nsettlement of the matter.”[99]\nOne of the most serious problems with  charge  bargaining  is  the  distortion  of  the  historical\nrecord when too many charges of the  same  offence  are  dropped.  The  repeated  withdrawing  of\ngenocide  charges  in  favour  of  crimes  against  humanity  could  mean  that  it  might  never   be\nestablished that genocide has actually taken place.[100] For groups who  deny  the  true  nature  of\nthe atrocities it will be very easy to declare that the  Prosecution  never  has  proven  genocide  has\nhappened  in  a  particular  conflict  whereas  in  reality  the   Prosecution   had   never   taken   the\nopportunity to do  so.  Another  example  is  sexual  violence  which  forms  part  of  every  armed\nconflict. A prosecutor of the ICTY explained[101] that many  defendants  refuse  to  admit  sexual\noffences even where they are willing to admit other acts of violence. This means that  many  deals\nare made which result in withdrawing charges of sexual violence. As a  result  a  huge  number  of\nsexual offences are not made part of the historical record established by the courts. The ICTR  has\nbeen proven to be very progressive in developing jurisdiction  in  sexual  crimes  and  making  this\nhorrible but typical side of armed conflicts visible. But charge bargaining could lead to  the  result\nthat the systematic victimisation of women and use of sexual violence as a weapon is disappearing\nagain from the public record. In addition, this experience could influence prosecution policies  and\npractices in the long run, as it might be decided that thorough investigation in sexual crimes is  not\nthe best use of resources if these crimes are very likely to be bargained away later.\nHowever if the historical facts of a certain situation have been already established in an earlier\ncase and the present case would not offer much new information the value of an additional trial  in\nthis respect is questionable. In such a case a brief admission of  guilt  to  facts  already  established\ndoes not hinder the historical record effect of the court procedures in total.\n5 Is the Guilty Plea Genuine?\nPlea bargaining can only support the establishment of a historical record if it produces guilty pleas\nwhich are genuine. A plea which is based on threats or an uninformed  decision  not  only  fails  to\nestablish an accurate historical record in this particular case but also it undermines  the  legitimacy\nof the whole truth-finding process of the  court.  Unfortunately  the  experience  of  the  ICTY  has\nshown that judges are not very diligent in investigating the validity of a guilty plea. An analysis of\nthe problems in this tribunal will lead on to proposals for future use of  the  practice,  especially  at\nthe ICC.\n1 Development of Procedural Safeguard for Guilty Pleas\nThe first case in which the question of the validity of the guilty plea  was  raised  was  Erdemovi?.\nDra?en Erdemovi? was accused of having participated in  the  massacre  of  hundreds  of  Bosnian\nMuslims civilians near Pilica.[102] He was indicted on one count of a crime against humanity and\nan alternative count of a violation of the laws or customs of war.[103] The tribunal  dismissed  the\ncharge of violation of laws or customs of war and accepted the guilty plea for the count on  crimes\nagainst  humanity.[104]  Handing  down  its  very  first  sentence  decision  the   ICTY   sentenced\nErdemovi? to ten years’ imprisonment.[105] This case was not the result of a  plea  agreement  but\nis essential for the question of the necessary requirements of accepting  a  guilty  plea.[106]  When\nErdemovi?  appealed  against  his  sentence  arguing  that  his  defence  of  duress   had   not   been\nconsidered sufficiently, the Appeal Chamber took the opportunity to question  the  validity  of  the\nappellant’s guilty plea as well.[107] Being the first international criminal tribunal  that  introduced\nthe common law procedure  of  guilty  plea[108]  the  Appeal  Chamber  was  eager  to  clarify  its\nprocedure.  It  noted  the  benefits  of  accepting  a  guilty  plea  and  thus  avoiding   a   full-blown\ntrial.[109]\nThis common law institution of the guilty plea should, in our  view,  find  a  ready  place  in  an  international\ncriminal forum such as the International Tribunal confronted by cases  which,  by  their  inherent  nature,  are\nvery complex and necessarily require lengthy hearings if they go to trial under stringent financial  constraints\narising from allocations made by the United Nations itself dependent upon the contributions of States.[110]\n5\n5However, it made it clear that the defendant’s waiver of his or her right to  trial  with  its  wide\ncatalogue of defendants’ rights[111] can only be allowed if  the  procedure  of  accepting  the  plea\noffers some safeguards itself. [112] Leaning on the  experience  of  common  law  systems  and  in\nparticular Rule 11 of the Federal Rules of Criminal Procedure, the  Appeal  Chamber  set  out  and\ndefined three requirements for  accepting  a  guilty  plea.  The  plea  must  be  entered  voluntarily,\nknowingly, and unequivocally.  ‘Voluntary’  means  not  only  that  the  defendant  pleaded  guilty\nwithout  threats,  inducements  or   promises[113]   but   also   that   they   would   understand   the\nconsequences of the plea.[114] A plea is ‘knowing’ if the  defendant  knows  and  understands  the\ncharges against them  and  all  the  elements  that  the  Prosecution  need  to  prove.  Moreover  the\ndefendant needs to comprehend the rights which are given up by waiving the  right  to  a  fair  trial\nand the penal consequences. Thirdly, the plea must not be ambiguous or equivocal.[115]\nThe Trial Chamber’s acceptance of the guilty plea  in  Erdemovi?  was  problematic  for  three\nreasons. Firstly, the Appeal Chamber was not convinced that the defendant had been aware of  the\nrights and safeguards he  was  giving  up  by  waiving  his  right  to  a  fair  trial,  in  particular  the\npresumption of innocence.[116] Secondly,  it  seems  that  the  defendant  did  not  understand  the\ncharges he was pleading guilty to. At  his  initial  appearance  he  had  been  confronted  with  two\nalternative  charges  and  been  asked  simply  whether  to  plead   guilty   or   not   guilty   without\ndistinguishing between the two crimes.[117] He did not receive an explanation and very  probably\ndid not understand  the  differences  between  the  two  alternative  charges.[118]  He  first  simply\npleaded guilty without specifying to which count[119] and then  to  the  more  serious  crime[120]\nwhich suggests that he did not grasp  the  differences  between  the  two  offences.  Thirdly,  while\npleading  guilty  he  kept  emphasising  that  he  had   acted   under   the   threat   of   being   killed\nhimself.[121] This suggests that he admitted parts of the offence but did not hold himself guilty as\nhe believed he had a legal defence.[122] A plea which indicates that on the one  hand  the  charges\nare admitted but at the same time deny responsibility is  inherently  contradictory  and  ambiguous\nand must not be  accepted.[123]Although  his  counsel  was  present  at  the  time  of  the  plea  the\ndefendant  understood  neither  the  nature  of  the  offences  he  was  charged  with   nor   possible\ndefences. The Appeal Chamber ordered that Erdemovi? be given  the  opportunity  to  plead  again\nand he pleaded guilty before the  Trial  Chamber  IIter  to  murder  as  a  violation  of  the  laws  or\ncustoms of war and was sentenced to five years.[124]\nOnly a month after the appeal  decision  the  judges  of  the  ICTY  adopted  at  the  Fourteenth\nPlenary Session on 12 November 1997 Rule 62bis of the Rules of  Procedure  and  Evidence.[125]\nFollowing the Appeal Chamber, Rule 62bis requires  that  the  guilty  plea  is  entered  knowingly,\nvoluntarily, and unequivocally, and that there  is  a  factual  basis  to  support  the  plea.  However,\nsurprisingly the new  rule  does  not  incorporate  the  detailed  requirements  of  Rule  11  nor  the\ndetailed ruling of the Appeal Chamber. Neither does  it  offer  definitions  of  these  principles  nor\ndoes it give any guidelines on how the Trial Chamber is expected to find that  the  plea  meets  the\nrequirements.\n2 Implementation of Procedural Safeguard for Guilty Pleas\nAccording to Cook this vagueness of the new procedure led to a “hodgepodge judicial approach to\nRule 62bis”.[126] A look at the transcripts of the Trial Chamber hearings when accepting a  guilty\nplea reveals that even the rudimentary requirements of Rule 62bis were fulfilled only formally  by\nthe court.\nTHE ACCUSED PLAV?I?: [Interpretation] I plead guilty.\nJUDGE MAY: You plead guilty. The Rules of the Tribunal require that the Trial  Chamber\nis satisfied that a plea of guilty  has  been  made  voluntarily,  that  it  is  informed  and  not\nequivocal, and that there is a sufficient factual basis for the crime and  the  participation  of\nthe accused in it. Mrs. Plav?i?, in the plea agreement which we have read, you have signed a declaration\nthat you entered into the agreement freely and voluntarily, understanding its terms, and having  been  advised\nby your lawyers. You have also signed a statement to  the  same  effect  in  which  is  added  that  the  plea  is\ninformed and unequivocal. Do you confirm that those declarations are correct?\nTHE ACCUSED PLAV?I?: [Interpretation] I do.[127]\nAlthough Judge May checked formally whether the requirements of Rule 62bis were  satisfied\nhe did not ask about any of the elements. If Rule 62bis is to be taken  seriously  it  is  necessary  to\nexamine carefully whether each of the requirements is  met,  for  example  whether  the  defendant\nunderstands each element of the offence that the Prosecution need to  prove  or  the  extent  of  the\nrights the defendant is going to lose when giving up the right to trial. The Chamber did nothing  to\nconvince itself that the defendant understood either the rights she gave up or the  consequences  of\nher decision. The Court obviously treated this part of the procedure  as  a  mere  formality  trusting\nthat the lawyers had done their job of informing the defendant adequately.  However,  the  duty  to\nprotect the defendant against abuse of procedure lies according to Rule 62bis  with  the  court  and\ncannot be delegated to the defence counsel.\nAnother example is the case of Ranko ?e?i? who  pleaded  guilty  to  all  of  the  six  counts  of\ncrimes against humanity and six violations of the laws or customs of war[128] and was  sentenced\nto  eighteen  years  imprisonment.[129]  When  accepting  the  guilty  plea  the   judge   asked   the\ndefendant  only  whether  he  understood  that   the   court   was   not   bound   by   the   sentencing\nrecommendations of the Prosecution and whether he  entered  the  agreement  voluntarily  and  not\ndue to threats or undue force. There was no reference to the other requirements of Rule 62bis[130]\nand neither the fact that he was giving up the presumption of innocence, nor  the  elements  of  the\noffences that the Prosecution need to prove nor the maximum possible  sentence  were  mentioned\nto the defendant.[131] The court declared that the requirements were fulfilled  but  ?e?i?  was  not\nasked about them.[132] Except for  changing  his  plea  from  not  guilty  to  guilty[133]  and  then\npleading guilty to each of the counts the accused only spoke three times at the hearing himself:  he\nconfirmed that it was his signature on the agreement[134], he confirmed  that  he  understood  that\n5\n5the Trial Chamber is not bound by recommendation,[135] and he confirmed  that  he  had  entered\nthe agreement voluntarily.[136] Defence counsel declared that the accused understood  all  aspects\nof  the  plea  agreement[137]  but  the  Chamber  did  not  endeavour  to  convince  itself  that   the\ndefendant himself had the necessary understanding.\nBoth cases show that the judges are aware of the  safeguards  of  the  procedural  rules  against\nabuse of plea bargaining but do not really implement them. Rule 62bis  is  mentioned,  or  at  least\nsome of the requirements are referred to, but none of the elements are examined  in  any  detail.  If\nthe guilty plea is based on one of  the  situations  which  Rule  62bis  is  designed  to  prevent  (for\nexample the defendant was threatened) the  defendant  will  give  all  the  answers  they  think  are\nexpected from them. A formalaic approach to Rule 62bis will  thus  not  be  able  to  identify  such\nsituations.\nA related problem is that some Chambers use a shortcut to Rule 62bis by asking the defendant\nto confirm the fulfilment of all elements in one single compound question. An example is the case\nof Mr?a.[138] The defendant was charged with two counts of  crimes  against  humanity  and  one\ncount of violations of the  laws  or  customs  of  war.  After  entering  a  plea  agreement  with  the\nProsecution Mr?a changed his plea of not guilty at his initial appearance to a guilty plea to  counts\ntwo and three.[139] After the  Court  summarised  the  plea  agreement  in  total  the  accused  was\nsimply asked whether he understood the documents. [140]  With  his  brief  reply  “Your  Honour,\neverything is clear to me” the Court seems to have satisfied  itself  that  all  requirements  of  Rule\n62bis had been fulfilled. The judge mentioned some of the rights he would  give  up[141]  but  the\nlist is far from complete and the presumption of innocence and the  prosecutor’s  burden  of  proof\nwere  missing.  In  the  case  of  Babi?[142]  the  court  considered  each  of  the  factors  of  Rules\n62bis and read the entire plea agreement into the record.[143] When after  the  reading  the  whole\ndocument  of  fifteen  pages,  the  court  asked  the  defendant   whether   he   was   aware   of   the\nconsequences of entering a guilty plea, Babi? answered simply: “Your Honour, I am aware”.[144]\nThis  general  information  was  deemed  to  be  sufficient  that  the  defendant  was   appropriately\nsafeguarded. Although this case is an improvement because it at least listed all the criteria of  Rule\n62bis the fact that the defendant was asked to confirm all elements  together  is  questionable.  The\ncourt should  convince  itself  that  each  of  the  elements  are  understood  and  confirmed  by  the\ndefendant.\nSince  the  Court  is  not  bound  by  the  agreement  between  Prosecution   and   Defence   the\ndefendant cannot risk  to  do  anything  that  would  cast  a  doubt  on  their  genuine  remorse  and\nprovoke the court to disregard the sentence recommendation of the Prosecution. Cook makes clear\nthat under these circumstances the defendant has hardly a chance to take advantage of Rule  62bis.\n“With a defendant fully inclined to appear cooperative  and  deferential,  and  fully  disinclined  to\nappear inquisitorial or confrontational, the court’s cursory examination of Babic hardly suffices as\na legitimate barometer of the defendant’s acumen regarding the plea decision.”[145]\nBy taking  together  all  questions  of  Rule  62bis  into  one  compound  question  the  court  is\nsupporting this assumption rather than really attempting to find out whether all  the  conditions  of\nRule  62bis  are  met  and  the  defendant  really  entered  the  plea  voluntarily  and   informed.   A\ncompound  question  considering  more  than  one  element  of  Rule  62bis  should   therefore   be\nprohibited.\nDeveloping a Strategy\n“The prospect of spending the rest of his life behind bars was, his counsel believes, of  less\nconcern to his defendant than was his opportunity to  create  through  his  trial  a  historical\nrecord that might, even many years from now, vindicate his view of the conflict.”[146]\nAn interesting turn in the question of the relationship between plea  bargaining  and  the  historical\nrecord is the experience of the ICTR. Combs found  in  her  empirical  research  that  the  sentence\ndiscount seems to be the major incentive for defendants at the ICTY but does not  seem  to  play  a\nmajor role in the ICTR[147] and indeed the number of plea agreements is here much lower.[148]\nThe national criminal justice system of Rwanda is based on the French  and  Belgium  systems\nwhich are civil law countries with inquisitorial  systems  and  like  Yugoslavia  and  the  successor\nstates, Rwanda does not engage in plea bargaining. Nevertheless,  like  the  ICTY  the  ICTR  also\namended its Rules of Procedure and Evidence  (ICTR-RPE)[149]  to  provide  for  the  guilty  plea\nprocedure.[150] What is most striking when looking at the guilty pleas of the ICTR  is  that  while\nplea bargaining seems to spread over the whole world this court does  not  manage  to  establish  a\nculture of guilty pleas. This is true despite the fact that the court itself spent some efforts to do so.\nThe arguably most important case of the ICTR is the case against  the  former  Prime  Minister\nJean-Paul Kambanda. At his initial appearance on 1 May 1998 he  pleaded  guilty  to  all  charges,\ni.e. one count of genocide, one count of conspiracy to commit genocide, one  count  of  direct  and\npublic incitement to commit genocide, one count  of  complicity  in  genocide,  and  one  count  of\ncrimes    against    humanity    (murder),    and    one    count     of     crimes     against     humanity\n(extermination).[151] In  addition  he  offered  right  from  the  beginning  to  co-operate  with  the\nProsecution and promised to testify for the Prosecution in  those  trials.[152]  He  provided  ninety\nhours of recorded evidence which was “invaluable information” [153] that was later  used  against\nother leaders. This co-operation was based on a written plea  agreement  between  Kambanda  and\nthe Prosecution which explicitly “records that no  agreements,  understandings  or  promises  have\nbeen made between the  parties  with  respect  to  sentence  which,  it  is  acknowledged,  is  at  the\ndiscretion of the Trial Chamber.”[154] Nevertheless for his early plea and  extensive  co-operation\nKambanda had expected a huge sentence discount, an expectation which  must  have  been  shared\nby his counsel who argued for only two years’ imprisonment.[155] In spite of his  confession  and\nfull co-operation the Court refused however to give any  sentence  concession,  and  following  the\nProsecution’s recommendation it  sentenced  Kambanda  to  life  imprisonment.[156]  Although  it\n5\n5acknowledged the advantages of a guilty plea  the  Court  made  it  clear  that  the  plea  could  not\noutweigh the aggravating circumstances.[157] The denial  of  a  sentence  reduction  is  surprising:\nKambanda had pleaded guilty before any other trial at  the  ICTR  was  completed.[158]  Thus  the\nTribunal had here the opportunity to send a  powerful  message  to  other  accused  and  encourage\nthem to plead guilty. Secondly,  given  the  early  plea  and  the  extent  of  co-operation  the  Trial\nChamber could easily have justified a more lenient sentence.[159] Further, one of the  aggravating\nfactors,  Kambanda’s  political  position  could  actually  have  been  counted  as  mitigation.[160]\nAlthough the Trial Chamber in Plav?i? agreed  with  the  Prosecution[161]  that  Biljana  Plav?i?’s\nformer position as President of the Republika Srpska was an aggravating factor it pointed out  that\nan admission of guilt of a political leader has  special  value  for  reconciliation.[162]  Hearing  his\nsentence  Kambanda  immediately  stopped  co-operation   with   the   Prosecution   and   filed   an\nappeal[163] claiming among other things that the  Trial  Chamber  had  not  considered  his  guilty\nplea as a  mitigating  factor  to  discount  his  sentence.[164]  The  Appeal  Chamber  unanimously\nrejected the appeal and confirmed the sentence.[165]\nIn this case the defendant had already provided a huge amount of invaluable information to the\nProsecution, which not only helped other prosecutions and convictions but also contributed to  the\nhistorical  record.  In  this  regard  the  Prosecution  did  not  need   to   offer   a   lenient   sentence\nrecommendation.  However,  the  disappointment  of  the  defendant   who   felt   betrayed   in   his\nagreement had a long term effect on other defendants and contributed to the general  reluctance  to\nenter into plea agreements.[166] This case shows that if a court decides to develop the  practice  of\nplea agreement it has to establish some long-term  strategy.  Plea  bargaining  is  a  practice  which\ncannot be used only in isolated cases.\nThe ICTR seemed to try to undo the damage in Serushago.[167] Omar Serushago  surrendered\nto the ICTR in April 1997 although he was not indicted by the court,[168]  and  pleaded  guilty  at\nhis initial appearance on 14 December 1998.[169] He provided full co-operation before  and  after\nhis trial and submitted information against many other high-level defendants.  Serushago  was  the\nfirst  case  in  which  the  Prosecution  recommended  a  sentence  below  life  imprisonment.[170]\nEmphasising  the  defendant’s  extensive  co-operation  they  recommended  a  twenty-five  years’\nprison sentence. [171] The Trial Chamber acknowledged the mitigating  effect  of  the  guilty  plea\nand other mitigating circumstances such as his co-operation  with  the  Prosecution,  his  character,\nhis regret and remorse, and his assistance to victims.[172] Surprisingly,  the  Trial  Chamber  went\neven below the  Prosecution’s  recommendation  and  sentenced  him  to  only  fifteen  years.[173]\nHowever, neither the low sentence in Serushago nor the explicit promises by both  the  Court  and\nthe Prosecution of significant sentence concessions for guilty pleas achieved a considerable rise in\nguilty pleas as the ICTY experienced in 2002 and 2003. Indeed the ICTR had to wait for over four\nyears for the next guilty plea.\nVincent Rutaganira who was the fourth guilty plea at the  ICTR  pleaded  guilty  in  December\n2004.[174] Six years after the Prosecution had issued an indictment against Rutaganira in 1996 he\nsurrendered voluntarily in February 2002.  After  he  pleaded  guilty  to  one  count  of  aiding  and\nabetting exterminations as a crime against humanity the Prosecution  not  only  dropped  the  other\nfive counts but even asked the Trial Chamber to acquit him  on  these  counts  because  of  lack  of\nsufficient evidence.[175] Further the Prosecution recommended a very  low  sentence  of  between\nsix and eight years and that this sentence should be served in  Europe  or  Swaziland.[176]  It  was\nalso explicitly stated in the plea agreement that there would not be any  further  co-operation  with\nthe Prosecution.[177] The Trial Chamber sentenced him to six years and  acquitted  him  from  the\nother charges.[178] Rutaganira was the first case before the ICTR of explicit sentence  bargaining\nas for the first time the Prosecution committed itself to a specific sentence recommendation range.\nIt  is  also  the  first  case  of  charge  bargaining.[179]  Combs  argues  that   the   reason   for   the\nProsecution to give so many concessions for so little admissions by the  defendant  was  a  lack  of\nsufficient evidence for the charges Rutaganira did not plead guilty to.[180] However in my view it\nis fair to conclude that since Serushago did not have the hoped effect of  encouraging  guilty  pleas\nthe Prosecution started to make better offers to defendants. Most of all  the  Prosecution  began  to\noffer  the   security   of,   if   not   a   binding   sentence   promise,   at   least   a   binding   sentence\nrecommendation.\nIn Ruggiu the ICTR tried to stimulate guilty  pleas  by  using  the  opportunity  to  praising  the\nguilty plea because it  “facilitates  the  administration  of  justice  by  expediting  proceedings  and\nsaving resources ( ... ) [saving] the Tribunal a  lengthy  investigation  and  trial,  thus  economising\ntime, effort and resources.”[181] Citing Erdemovi?  the  court  pointed  out  that  rewarding  guilty\npleas with sentence concessions encourages other suspects to come forward.[182] Indeed the Trial\nChamber   explicitly   targeted   other   suspects   and   perpetrators   promising   some    form    of\nconcession.[183] When  the  Prosecution  was  criticised  for  the  low  sentence  by  the  Rwandan\ngovernment Chief of Prosecutions Mohamed Othman explained that  it  was  “a  good  gesture  for\nother accused who would wish to plead guilty and accept responsibility for their crimes.”[184]\nAlthough the Court and the Prosecution  tried  now  to  engage  in  plea  negotiations  in  many\ncases[185] one still finds  surprisingly  few  guilty  pleas  at  the  ICTR.  The  findings  of  Comb’s\nresearch came to the surprising conclusion  that  the  reasons  why  most  defendants  at  the  ICTR\nrefuse to plead guilty is that they truly believe they are not guilty of the  crimes  they  are  charged\nwith.[186] They argue that it was an armed conflict  between  the  Rwandan  government  and  the\nRPF (Rwandan Patriotic Front) and criticise that no member  of  the  RPF  was  prosecuted.  More\nimportantly, most defendants  reject  the  notion  that  the  atrocities  of  1994  in  Rwanda  can  be\nclassified as genocide.[187] While they agree that the conflict resulted in excessive  violence  they\ninsist there was no genocidal intent against the Tutsi. [188] However, the reasons are different  for\nhigh-level and low-level offenders:\nHigh-level ICTR defendants, for instance, are so convinced of their innocence, so ideologically committed to\ntheir characterization of the Rwandan conflict, and so concerned about their place in  the  history  books  that\nvirtually no sentence inducement will persuade them to plead guilty to  genocide.  Low-level  Special  Panels\ndefendants, by contrast, are  so  ignorant  about  their  legal  rights  and  so  culturally  disposed  to  admitting\nwrongdoing and seeking reconciliation that, absent the constraining hand of counsel, no sentence inducement\n5\n5is needed to persuade them to plead guilty.[189]\nCombs  argue  that  one  reason  for  the  reluctance  of  guilty  pleas  at  the  ICTR  is  that  the\ndefendants are mostly “senior politicians, military leaders, or influential business people” and thus\nare  highly  concerned  with  the  characterisation   of   the   conflict   and   their   own   “historical\nlegacy”.[190] The label of the offence as well as the historical picture  painted  by  the  tribunal  is\nessential for these defendants. Combs argues that defendants are willing to admit the violence they\nare responsible for but ”cannot admit to taking  part  in  a  genocide  because  doing  so  would  be\nfundamentally  at  odds  with  the   defendant   community’s   long-held   characterisation   of   the\nviolence.”[191]\nThese findings support my argument that plea bargaining can distort the historical record even\nthough in the case of the ICTR it is the defendants who reject the idea of a bargain  which  distorts\nhistory as it has happened in their view.\n5. Conclusions\n“This  ‘historical’  dimension  of  international  criminal  trials,  which  has   some   merits,\ncomplicates matters even further and often leads the proceedings far beyond  their  purpose\nof being instrumental to the ascertainment of specific individual responsibilities.”[192]\nIt has been shown  that  the  establishment  of  a  historical  record  is  a  fundamental  function  of\ninternational criminal trials. Plea bargaining is an ambiguous tool that can both further and  hinder\nthis aim. Charge bargaining can distort the historical  record  while  inauthentic  pleas  destroy  the\nlegitimacy  of  the  court.  One  the  other  hand  plea  bargaining  is  the  strongest   incentive   for\nperpetrators to admit their guilt and reveal the  truth  and  thus  support  peace  and  reconciliation.\nReferring to the ICTY it was claimed that “confessions required for a deal are  finally  helping  the\ntribunal to fulfil one of its central missions: persuading Balkan nations accustomed to  considering\nthemselves victims that their forces committed terrible crimes.”[193]\nThe question of how to use plea bargaining in a  way  that  advances  rather  than  obstruct  the\nhistorical record is essential because plea bargaining is expected to be used in all international and\nhybrid courts.[194] In particular the ICC has to take advantage of being able to  draw  conclusions\nfrom the experience of other international courts and to design procedures to reap  the  benefits  of\nplea  bargaining  while  avoiding  the  disadvantages  of  this  practice.  As  was  shown   above   a\nregulation of plea agreements  in  the  Rules  of  Procedures  alone  does  not  guarantee  that  plea\nbargaining is used only in appropriate situations. Rather Court and Prosecution need  to  be  aware\nof the far reaching consequences of a plea agreement and develop an adequate practice  taking  the\ndifferent interests into consideration. The ICC[195] must not wait until an overwhelming caseload\nforces  the  courtroom  actors  to  develop  informally  a  practice  of  plea   bargaining   based   on\nconsiderations of efficiency. Instead the Court should reflect now on the  advantages  and  dangers\nof plea bargaining and design a  procedure  that  safeguards  not  only  the  interest  of  defendants,\nvictims  and  the  international  community  but  also  the  legitimacy  of   the   Court   itself.   Plea\nbargaining must not be regarded  as  a  convenient  informal  shortcut  to  avoid  trials  but  can  be\nutilised as a mechanism to build the historical record.\nThree aspects emerged from the analysis of ICTY cases that are crucial: first,  the  disposal  of\nfull trials should be used only rarely because a criminal trial is one of the  most  effective  ways  to\nestablish an accurate historical record. Only when facts are already established in earlier cases can\nit be justified to replace the trial with an agreement.\nSecondly, the question of whether to facilitate plea negotiations with an accused should not be\nseen in isolation of the individual case but in the context of the whole situation. It must be kept  in\nmind that the result of extensive plea bargaining might lead to a distorted  picture  painted  by  the\nCourt. The Prosecution has to make sure that plea bargaining does not lead to a particular  kind  of\ncrime, for example  sexual  violence,  disappearing  from  the  public  record.  Especially  in  cases\nwhere  the  outcome  of  a  legal  evaluation  is  uncertain[196]  the  Prosecution  must   avoid   the\ntemptation of turning away  from  the  challenge  of  the  trial.  Instead  the  Court  must  have  the\nopportunity  to  clarify  this  question  in  public  with  all  sides  presenting  their  arguments   and\nevidence. The question of which cases are appropriate for plea bargaining needs to  be  made  part\nof the Prosecutional strategy and policies including explicit selection criteria.\nThirdly, it has to be remembered that the historical record of  a  criminal  trial  can  only  claim\nlegitimacy if it is established by the strict rules of procedure. Only if the guilty plea is genuine can\nthe Court afford to neglect its  mandate  and  dispose  of  the  case  without  full  trial.  In  order  to\nmaintain legitimacy and credibility, the Court has to take  the  safeguards  seriously  and  examine\neach guilty plea, especially when based on a  plea  agreement.  The  rules  set  out  by  the  Appeal\nChamber  in  Erdemovi?  offer  appropriate  protection  and  even  in  its  curtailed  form  of   Rule\n62bis provide for valuable safeguards for the defendant. Article 65(1) Rome Statute[197] is  based\non Rule 62bis. However, the experience of the ICTY  has  shown  that  the  central  question  is  to\nwhat extent the Court is really examining each of the elements seriously. Of course the  Court  has\nonly limited possibilities to ascertain the understanding of a  defendant  or  inspect  whether  there\nhas been any undue pressure if the defendant claims there has not been  any.  However,  the  Court\ncould ask why the  defendant  changed  their  non  guilty  plea  to  a  guilty  plea  and  enquire  the\nconditions under which the plea agreement was made.[198] Moreover, the Court can take the time\nto explain the different charges, the consequences of entering a guilty plea, most of  all  the  rights\nwhich the  defendant  is  giving  up  by  waiving  their  right  to  trial.  Germany  for  example  has\nintroduced a new  provision  in  its  Criminal  Procedure  Code  that  requires  the  Court  (and  not\ncounsel) to inform the defendant about the requirements and the consequences of an admission  of\nguilt based on an agreement.[199] I propose that this duty of information  should  also  be  laid  on\nthe ICC. Based on the experience of  Erdemovi?  the  Court  could  also  enquire  if  the  defendant\n5\n5claims any form of defence. [200]\nTo summarise I argue that international  criminal  courts  and  tribunals[201]  should  use  plea\nbargaining to establish not only the guilt of offenders but also to further the historical record if the\nfollowing three conditions are met:\n1) Fact finding through trial\nThe broader picture of a certain situation, be it the legal  classification  of  an  atrocity  (for\nexample as genocide) or the fact of a certain crime (for example a certain massacre) or  the\npattern of certain crimes (for example use of sexual violence as  a  systematic  weapon)  or\nthe  wider  context  (for  example  widespread  attack  on  civilian  population)   is   already\nestablished through other cases so  that  a  trial  of  the  present  defendant  would  not  add\nsignificantly to these findings.\n2) No distortion of history\nCharge bargaining is only used in the context of the broader picture of all cases and as part\nof the prosecutorial strategy that ensures that no aspect  of  the  conflict  such  as  a  certain\ntype of crime disappears from the historical record.\n3) Validity of the Plea\nThe court examines carefully whether the plea is genuine, i.e. whether it has  been  entered\nvoluntarily, informed and unequivocally and is based on established facts.\nThese three conditions mean that the Court needs  to  keep  the  broader  picture  of  the  whole\nsituation and not just the individual case in mind. Also they need to spend more time and effort on\nexamining the validity of the plea. Of course this means the admission of  guilt  hearing[202]  will\ntake  longer.  However,  considering  the  resources  saved  through  avoiding  a  whole   trial   and\nconsidering the importance of the guilty plea this investment in examining the validity of the  plea\nis worth the extra effort. Applying the safeguards listed above plea bargaining can be used without\nlosing legitimacy of the procedure and without compromising the Court’s  function  of  building  a\nhistorical  record.  As  Hans-Peter  Marsch  reminds  us:  “the  procedure  gives  legitimacy  to  the\nresult”.[203] \n------------------------------------\n[1] Prosecutor v. Deronji |[pic] (Case No. IT-02-61-S) Dissenting Opinion of Judge Schomburg\n(30 March 2004) para. 6.\n[2] U.S. Representative Mrs Albrigh Deronji? (Case No. IT-02-61-S) Dissenting Opinion of Judge\nSchomburg (30 March 2004) para. 6.\n[3] U.S. Representative Mrs Albright statement 25 May 1993 UN SCOR, 48th session, 3217th meeting UN\nDoc. S\/PV3217.\n[4] International Tribunal for the Prosecution of Persons Responsible for Serious Violations of\nInternational Humanitarian Law Committed in the Territory of the Former Yugoslavia since 1991,\nshort International Criminal Tribunal for the former Yugoslavia (ICTY) established by UN SC\nRes 827, 25 May 1993.\n[5] The International Criminal Tribunal for Rwanda (ICTR) established through UN SC Res 955,\n8 November 1994.\n[6] Michael P. Scharf ‘The Politics of Establishing an International Criminal Court’ 6 Duke\nJournal of Comparative and International Law (1995) 167, p. 168.\n[7] Nancy Armoury Combs ‘Prosecutor v. Plav?i?, Case No. IT-00-39&40\/ 1-S. Sentencing\nJudgment’ 97 American Journal for International Law (2003) 929, p. 931.\n[8] Michael P. Scharf ‘Trading Justice for Efficiency’ 2 Journal of International Criminal\nJustice (2004) 1070, p. 1079.\n[9] George William Mugwanya ‘Expunging The Ghost of Impunity for Severe and Gross\nViolations of Human Rights and the Commission of Delicti Jus Gentium: A Case for the\nDomestication of International Criminal Law and the Establishment of a Strong Permanent\nInternational Criminal Court’ 8 Michigan State University-DCL Journal of International\nLaw (1999) 701, p. 765.\n[10] Prosecutor v. Momir Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December\n2003) para. 60.\n[11] Combs supra note 6, p. 933.\n[12] For example a charge of rape could be downgraded to a charge of sexual assault, or murder to\nmanslaughter.\n[13] Nancy Armoury Combs ‘Procuring Guilty Pleas for International Crimes: The Limited\nInfluence of Sentence Discounts’ (59\/1) Vanderbilt Law Review (2006) 69, p. 114.\n[14] Prosecutor v. Rutaganira (Case No. ICTR-95-1C-T) Minutes of Proceedings (17 January\n2005) para. 1(c).\n[15] Or as the case is in most civil law countries the trial is very much shortened.\n[16] Since many civil law countries do not have the procedure of pleading it is strictly speaking\nincorrect to speak of plea bargaining but this general term has now been established in the\nliterature to include informal agreements based on an admission of guilt.\n[17] George Fisher, Plea Bargaining’s Triumph – A History if Plea Bargaining in\nAmerica (Stanford University Press, Stanford California, 2003); Mike McConville and Chester L.\nMirsky, Jury Trials and Plea Bargaining – A True History (Hart Publishing, Oxford 2005).\n[18] Yue Ma ‘A Comparative View of Judicial Supervision of Prosecutorial Discretion’ 44\/1\nCriminal Law Bulletin (2008) p. 2.\n[19] Both the Special Court for Sierra Leone and the East Timor Special Panels have rules that\nprovide for guilty pleas. For details see Combs supra note 12, pp. 124-146.\n[20] Douglas J C Thomson ‘Discount of Sentencing Following a Guilty Plea’ Scots Law\nTimes (2004) 1, p. 2.\n[21] U.S. Chief Prosecutor Robert Jackson, 7 June 1945, in the Report to the president printed in\n5\n5Robert Jackson, The Nürnberg Case (Cooper Square Publishers, New York, 1971) p. 10.\n[22] Priscilla B. Hayner ‘Truth Commissions: A Schematic Overview’ 88\/862 International\nReview of the Red Cross (2006) p. 295.\n[23] Richard J. Evans ‘History, Memory, and the Law: The Historian as Expert Witness’ 41\/3\nHistory and Theory (2002) pp. 326-345.\n[24] Although the ICC has much broader jurisdiction (although limited to crimes committed after\nJuly 1 2002) or because of this it will have to make very careful decisions on which situations,\nwhich defendants and which crimes to focus.\n[25] Article 7 ICTR Statute.\n[26] However, the ICTY tried also a number of low-level offenders especially in the beginning\nwhen only few arrests were made.\n[27] Judge Schomburg for example dissents in Deronji? because of the selection of crimes: “First, already the series\nof indictments, including the Second Amended Indictment, arbitrarily present facts, selected from the context of a\nlarger criminal plan and, for unknown reasons, limited to one day and to the village of Glogova only.” Prosecutor\nv. Deronji? (Case No. IT-02-61-S) Dissenting Opinion of Judge Schomburg (Mar. 30, 2004) para. 4.\n[28] An exception is Nuremberg Charter which had also jurisdiction to declare organisations\ncriminal (Article 9(1) Charter for the International Military Tribunal). For the debate on criminal\nresponsibility of legal persons see Rauxloh ‘A Call for the End of Impunity for Multinational\nCorporations’ 14 Texas Wesleyan Law Review (2008) pp. 297-315.\n[29] Matiangai Sirleaf ‘Regional Approach to Transitional Justice? Examining the Special Court\nfor Sierra Leone and the Truth & Reconciliation Commission for Liberia’ 21 Florida Journal of\nInternational Law (2009) 209, p. 213.\n[30] Article 8 (II) Rome Statute of the International Criminal Court (U.N. Doc.A\/CONF.183\/9)\n1998 [hereinafter Rome Statute].\n[31] Article 7(I) Rome Statute.\n[32] Article 6 Rome Statute.\n[33] See Michela Miraglia ‘Admissibility of Evidence, Standard of Proof, and Nature of the\nDecision in the ICC Confirmation of Charges in Lubanga’ 6 Journal of International Criminal\nJustice (2008) 489.\n[34] William Schabas, International Criminal Court (Cambridge University Press, Cambridge,\n2007) 3rd ed., p. 294.\n[35] For example the prosecution had screened 100,000 captured documents of which about 4,000\nwere used as evidence. Jackson supra note 20, p. vi. Moreover, after the unconditional surrender\nthe victorious allies had access to any evidence they considered relevant.\n[36] Prosecutor v. Momir Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December\n2003) para. 73.\n[37] Statute of the International Criminal Tribunal for Former Yugoslavia, Report of the Secretary-\nGeneral pursuant to para. 2 of Security Council Resolution 808, Annex, U.N. Doc. S\/25704\n(1993)) [hereinafter ICTY Statute].\n[38] Theresa Marie Clark ‘Transplant Justice?: The Efficacy of a Purely Common Law Concept in\nthe International Criminal Forum’ 9 Buffalo Human Rights Law Review (2003) p. 75, footnote 108\nciting ‘Suggestions made by the Government of the United States of America, Rules of Procedure\nand Evidence for the International Criminal Tribunal for the Prosecution of Persons Responsible\nfor Serious Violations of International Humanitarian Law Committed in the Former Yugoslavia’.\n[39] Terry Coonan ‘Prosecuting And Defending Violations Of Genocide And Humanitarian Law:\nThe International Tribunal For The Former Yugoslavia’ American Society of International Law\nProceedings (1994) 239, p. 248.\n[40] Statement by the President [of the ICTY] made at a Briefing to Members of Diplomatic\nMissions, IT\/29, 11 February 1994, reprinted in V Morris and M.P. Scharf, An Insider’s Guide to\nthe International Criminal Tribunal for the former Yugoslavia, Vol. 2 (Transnational Publishers\nInc, Irvington-on-Hudson, New York, 1995) 649, p. 652.\n[41] “The question of the grant of immunity from Prosecution to a potential witness has also\ngenerated considerable debate. Those in favour contend that it will be difficult enough for us to\nobtain evidence against a suspect and so we should do everything possible to encourage direct\ntestimony. They argue that this is especially true if the testimony serves to establish criminal\nresponsibility of those higher up the chain of command. Consequently, arrangements such as plea-\nbargaining could also be considered in an attempt to secure other convictions. However, we\nalways have to keep in mind that this Tribunal is not a municipal criminal court but one that is\ncharged with the task of trying persons accused of the gravest possible of all crimes. The persons\nappearing before us will be charged with genocide, torture, murder, sexual assault, wanton\ndestruction, persecution and other inhumane acts. After due reflection, we have decided that no\none should be immune from Prosecution for crimes such as these, no matter how useful their\ntestimony may otherwise be.” Statement by the President [of the ICTY] made at a Briefing to\nMembers of Diplomatic Missions, IT\/29, 11 February 1994, reprinted in V Morris and M.P.\nScharf, supra note 39, p. 652.\n[42] Paul R Williams and Karina M. Waller ‘Coercive Appeasement: The Flawed International\nResponse to the Serbian Rogue Regime’ 36 New England Law Review (2002) 825, p. 888.\n[43] UN Security Council Resolution 1503 UN Doc. S\/RES\/1503 (2003) para. 7.\n[44] The Tribunal reacted in several ways to cope with the pressure, including the withdrawal of\nindictments against a number of low-level defendants and the addition of twenty seven ad\nlitem judges and some amendments to the RPE. (See Hafida Lahiouel ‘The Right of the Accused\nto an Expeditious Trial’, in Essays on ICTY Procedure and Evidence in Honour of Gabrielle Kirk\nMcDonald (Kluwer Law International, The Hague, 2000) pp. 208 et seq.\n[45] Scharf supra note 7, p. 1074.\n[46] Combs supra note 12, p. 92.\n[47] Julian A. Cook ‘Plea Bargaining at The Hague’ 30 Yale Journal for International Law (2005)\n473, p. 474.\n[48] Namely Todorovi? and Simi?. However, in these cases it is very likely that the special\ncircumstances, i.e. the conditions of the arrest in Todorovi? and the delaying effect of the poor\nhealth of Simi? (see below) explain these differences. Combs supra note 12, p. 92.\n[49] He persecuted non-Serb civlian in his position as Police Chief and a member of the Serb\nCrisis Staff in Bosanski ?amac, including participating and ordering the beating and torturing of\n5\n5detainees. Initially he was charged with ten counts of crimes against humanity (persecutions on\npolitical, racial or religious grounds, expulsions, murder, inhumane acts, rape and acts of torture),\n- eight counts of violations of the laws or customs of war (murder, cruel treatment and humiliating\nand degrading treatment) and nine counts of serious violations of the Geneva Conventions of 1949\n(expulsions or illegal transfers, intentional homicide, intentionally inflicting intense suffering and\nacts of torture or inhumane treatment). Prosecution v. Todorovi? et al. (Case No. IT-95-9-PT)\nSecond Amended Indictment (19 November 1998).\n[50] Combs supra note 12, p. 88.\n[51] Crime against humanity as persecution on political, racial and religious grounds as crimes\nagainst humanity.\n[52] Combs supra note 12, pp. 88-89.\n[53] Prosecutor v. Todorovi? (Case No. IT-95-9\/1) Transcript (4 May 2001) p. 55.\n[54] Prosecutor v. Todorovi? (Case No. IT-95-9\/1) Sentencing Judgment (July 4, 2001) para. 114.\n[55] Prosecutor v. Todorovi? (Case No. IT-95-9\/1) Sentencing Judgment (July 31, 2001) para. 81.\n[56] Ibid., para. 80. My italics.\n[57] Scharf supra note 5, p. footnote 14.\n[58] Prosecutor v. Sikirica (Case No. IT-95-8-S) Sentencing Judgment (13 November 2001).\n[59] For more facts see Clark supra note 37, p. 76.\n[60] Prosecutor v. Sikirica (Case No. IT-95-8-S) Sentencing Judgment (13 November 2001).\n[61] Ibid., para. 148.\n[62] Ibid., para. 149. My italics.\n[63] Prosecutor v. Dragan Nikolic (Case No. IT-94-2) Sentencing Judgment (18 December 2003)\nparas. 275, 279-282.\n[64] Ibid., para. 281.\n[65] Ibid., para. 214.\n[66] Ibid., paras. 232, 280.\n[67] Prosecutor v. Momir Nikolic (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December\n2003) para. 19, 183.\n[68] Ibid., para. 156.\n[69] Miroslav Deronji? was president of the Bratunac Crisis Staff and assisted in the displacement\nof the Muslim civilians in the Bratunac Municipality. \n[70] Prosecutor v. Deronji? (Case No. IT-02-61-S) Dissenting Opinion of Judge Schomburg (30\nMarch 2004) para. 2.\n[71] Combs supra note 12, p. 98.\n[72] Ibid. See also footnote 137 for references in press of victims’ outrage.\n[73] Combs supra note 12, p. 99.\n[74] Ibid.\n[75] Prosecutor v. Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December 2003)\npara. 67.\n[76] Anna Petrig ‘Negotiated Justice and the Goals of International Criminal Tribunals- With a\nFocus on the Plea-Bargaining Practice of the ICTY and the Legal Framework of the ICC’ 8\nChicago-Kent Journal of International and Comparative Law 1 (2008) p. 28.\n[77] Scharf supra note 5, p. 1078.\n[78] Prosecutor v. Nikolic (Case No. IT-02-60\/1-S) Sentencing Judgement (2 December 2003)\npara. 145.\n[79] Prosecutor v. Biljana Plav?i? (Case No. IT-00-39&40\/1) Sentencing Judgement (27\nFebruary 2003) para. 67.\n[80] For factual basis see Prosecution v. Kraji?nik & Plav?i? (Case No. IT-00-39&40-PT) Factual Basis for Plea of\nGuilt (30 September 2002) para. 16.\n[81] Combs supra note 6, p. 930.\n[82] Prosecutor v. Plav?i? (Case No. IT-00-39&40\/ 1-S) Sentencing Judgment (27 February\n2003) para. 15. This campaign resulted in the displacement of hundreds of thousands of Bosnian\nMuslim and Croats, mass killings, mass rapes, torture, concentration camps where people held\nunder sub-human conditions, and the destruction of property and religious buildings.\n[83] Prosecutor v. Biljana Plav?i? (Case No. IT-00-39&40\/1-S) Sentencing Judgement (27 February 2003) para. 75.\n[84] Ibid., para. 76.\n[85] Ibid., para. 123. Her two requests for pardon to the Swedish government on April 2006 and\nJune 2008 due to her old age and poor health were both rejected. On September 15, the ICTY\ngranted early release after having served tow-thirds of her sentence.\n[86] Prosecutor v. Biljana Plav?i? (Case No. IT-00-39&40\/1) Sentencing Judgement (27\nFebruary 2003) paras. 61 et seq., 110.\n[87] Daniel Uggelberg Goldberg Plav?i? retracts war-crimes confession, 04 February 2009\n<www.bosnia.org.uk\/news\/news_body.cfm?newsid=2544>, 1 June 2010), Swedish interview with\nMargaretha Nordgren <www.vi-tidningen.se\/templates\/ArticlePage.aspx?id=10784>, 1 June\n2010.\n[88] Combs supra note 6, p. 933.\n[89] Prosecution v. Kraji?nik & Plav?i? (Case No. IT-00-39&40-PT) Factual Basis for Plea of Guilt (30 September\n2002) para. 16.\n[90] Petrig supra note 75, p. 16.\n[91] Scharf supra note 5, p. 1080.\n[92] Ibid.\n[93] Prosecutor v. Erdemovi? (Case No. IT-96-22-T) Sentencing Judgment (29 November 1996)\npara. 20.\n[94] Sienho Yee ‘The Erdemovic Sentencing Judgement: A Questionable Milestone for the\nInternational Criminal Tribunal for the Former Yugoslavia ‘Georgia Journal of International and\nComparative Law (1997) p. 283.\n[95] For example in Deronjic the presiding judge speculates why the charges are limited to a\nhandful offences while there was prima facie evidence of much more crime. Prosecutor\nv. Deronji? (Case No. IT-02-61-S) Dissenting Opinion of Judge Schomburg (30 March 2004)\npara. 9.\n[96] Prosecutor v. Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December 2003)\n5\n5para. 63.\n[97] Prosecutor v. Plav?i?s (Case No. IT-00-39&40-PT) Amended Consolidated Indictment (7\nMarch 2002); Decision granting Prosecution’s motion to dismiss counts 1, 2, 4, 5, 6, 7 and 8 of\nthe amended consolidated indictment (20 December 2002).\n[98] Blagoje Simi?, Simo Zari?, Miroslav Tadi?, Slobodan Miljkovi? and Stevan Todorovi?. Prosecution v Blagoje\nSimic et al. (Case No. IT-95-9) Second Amended Indictment (11 December 1998). Milan Simi? was initially indicted\nwith Todorovi? and four other co-defendants. He was a member of the Bosnian Serb crisis staff and president of the\nmunicipal assembly of Bosanski ?amac. For his actions from September 1991 to February 1993 he was charged with\none count of persecution as crimes against humanity, two counts of torture as crimes against humanity, two counts of\ninhumane acts as crimes against humanity and two counts of cruel treatment as violations of the laws or customs of\nwar. Prosecution v. Blagoje Simic et al., (Case No. IT-95-9) Fourth Amended Indictment (11 December 1998).\n[99] Combs supra note 12, p. 91.\n[100] Prosecutor v. Momir Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgement (2 December\n2003) para. 65.\n[101] An example for a case where of charge bargaining resulted in withdrawal of the genocide\ncharge is Prosecutor v. Obrenovi? (Case No. IT-02-60\/2-2) Sentencing Judgment (10 December\n2003) para. 11.\n[102] Interview February 2009 with the author.\n[103] He was a soldier in the 10th Sabotage Detachment of the Bosnian Serb Army (VRS) and part\nof the firing squad that was ordered to shoot and kill hundreds of unarmed Bosnian Muslim men\nwho had been transported from Srebrenica. When Erdemovi? refused to participate in the killing\nof unarmed Muslim civilians he was threatened with instant death. He claimed that he had seen\nafterwards a superior ordering the killing of a soldier for disobedience. Following the orders\nErdemovi? killed about seventy Muslims. When he later refused to participate in another mass\nkilling he was shot at and wounded, Prosecutor v. Erdemovi? (Case No. IT-96-22-T) Sentencing\nJudgement (29 November 1996) paras. 78-81. For details on the background of the case see Yee\nsupra note 93, p. 264.\n[104] Prosecutor v. Erdemovi? (Case No. IT-96-22) Indictment (29 May 1996) para. 16.\n[105] Prosecutor v. Erdemovi? (Case No. IT-96-22-T) Sentencing Judgment (29 November 1996)\npara. 5.\n[106] Ibid.\n[107] While in common law systems the guilty plea ends the proceedings in civil law countries an admission of guilt\nis simply part of the evidence to be considered and evaluated by the court and has no procedural effect as such.\n[108] “The Appeals Chamber finds nothing in the Statute or the Rules, nor in practices of international institutions or\nnational judicial systems, which would confine its consideration of the appeal to the issues raised formally by the\nparties. The preliminary issues revolve around the question of the validity of the plea of guilty entered by the\nAppellant.” Prosecutor v. Erdemovi? (Case No. IT-96-22-A) Appeals Chamber Judgment (7 October 1997) para. 16.\n[109] Yee supra note 93, p. 268.\n[110] Prosecutor v. Erdemovi? (Case No. IT-96-22-A) Joint Separate Opinion of Judge\nMcDonald and Judge Vohrah (7 October 1997) para. 2.\n[111] Ibid., para. 2.\n[112] Article 21 (4) of the Statute for the ICTY lists the minimum due rights of defendants:\n(a) to be informed promptly and in detail in a language which he understands of the nature and\ncause\nof the charge against him;\n(b) to have adequate time and facilities for the preparation of his defence and to communicate\nwith\ncounsel of his own choosing;\n(c) to be tried without undue delay;\n(d) to be tried in his presence, and to defend himself in person or through legal assistance of\nhis own\nchoosing; to be informed, if he does not have legal assistance, of this right; and to have legal\nassistance assigned to him, in any case where the interests of justice so require, and without\npayment by him in any such case if he does not have sufficient means to pay for it;\n(e) to examine, or have examined, the witnesses against him and to obtain the attendance and\nexamination of witnesses on his behalf under the same conditions as witnesses against him;\n(f) to have the free assistance of an interpreter if he cannot understand or speak the language\nused in\nthe International Tribunal;\n(g) not to be compelled to testify against himself or to confess guilt.\n[113] Prosecutor v. Erdemovic (Case No. IT-96-22-A) Separate and Dissenting Opinion of Judge\nCassese (7 October 1997) para. 9.\n[114] Ibid., para. 10.\n[115] Prosecutor v. Erdemovi? (Case No. IT-96-22-A) Joint Separate Opinion of Judge\nMcDonald and Judge Vohrah (19 November 1997) paras. 8, 10.\n[116] Prosecutor v Erdemovi? (Case No. IT-96-22-A ) Joint Separate Opinion of Judge\nMcDonald and Judge Vohrah (19 November 1997) para. 10.\n[117] Ibid., para. 15.\n[118] Prosecutor v. Erdemovi? (Case No. IT-96-22-T) Transcript of Initial Appearance (31 May\n1996) para. 20. Rule [62ii] explicitly requires that the Chamber call upon the accused to make a\nplea as to each count, but it does regulate the situation where alternative charges have been made.\n[119] Prosecutor v. Erdemovi? (Case No. IT-96-22-A) Joint Separate Opinion of Judge\nMcDonald and Judge Vohrah (19 November 1997) para. 18.\n[120] Prosecutor v. Erdemovi? (Case No. IT-96-22-T) Transcript of Initial Appearance (31 May\n1996) para. 25.\n[121] Ibid., p. 26.\n[122]Prosecutor v. Erdemovi? (Case No. IT-96-22-Tbis) Sentencing Judgement (5 March 1998)\npara. 14.\n[123] For a detail comment on the question of defences in this case see Yee supra note 93, p. 286.\n[124] Prosecutor v. Erdemovic (Case No. IT-96-22-A) Separate and Dissenting Opinion of Judge\nCassese (7 October 1997) para. 10. \n[125] Prosecutor v. Erdemovi? (Case No. IT-96-22-Tbis) Sentencing Judgement (5 March 1998) para. 25.\n[126] Rule 62bis ICTY Rules of Procedure and Evidence reads: “If an accused pleads guilty in accordance with Rule\n62 (vi), or requests to change his or her plea to guilty and the Trial Chamber is satisfied that: (i) the guilty plea has\nbeen made voluntarily; (ii) the guilty plea is informed; (iii) the guilty plea is not equivocal; and (iv) there is a\n5\n5sufficient factual basis for the crime and the accused’s participation in it, either on the basis of independent indicia or\non lack of any material disagreement between the parties about the facts of the case, the Trial Chamber may enter a\nfinding of guilt and instruct the Registrar to set a date for the sentencing hearing.”\n[127] Cook supra note 46, p. 482.\n[128] Prosecutor v Plav?i? (Case No. IT-00-39 & 40-PT) Plea Transcript (2 October 2002) p.\n338.\n[129] Prosecutor v. ?e?i? (Case No. IT-95-10\/1-PT) Plea Agreement (8 October 2003) para. 3.\n[130] Prosecutor v. ?e?i? (Case No. IT-95-10\/1-5) Sentencing Judgment (11 March 2004) para.\n111.\n[131] Prosecutor v. ?e?i? (Case No. IT-95-10\/1-PT) Plea Transcript (8 October 2003).\n[132] Cook supra note 46, p. 485.\n[133] Judge Orie “Mr. Cesic, the Trial Chamber now has to satisfy itself that your guilty plea on all 12 counts has\nbeen made voluntarily, that no threats or no coercion was exercised upon you, and that you were informed about the\ncontent of your plea. We already discussed it at some length in the previous stages of this hearing. The Trial Chamber\nhas also to satisfy itself that the guilty plea is not equivocal. And finally, the Trial Chamber has to satisfy itself that\nthe guilty plea finds a sufficient factual basis for the crime and the accused’s participation therein. So your\nparticipation therein. We have dealt with you being -- the plea being informed. We have dealt with the free will on\nwhich you based your guilty pleas. I think by explaining and trying to find out what your understanding of the plea is\nand whether this is the same understanding as the understanding of the Prosecution of the charges brought against\nyou, that whether the plea is or is not equivocal has been dealt with also.” Prosecutor v. ?e?i? (Case No. IT-95-10\/1-\nPT) Plea Transcript (8 October 2003) pp. 91-92.\n[134] Ibid., p. 86.\n[135] Ibid., p. 63.\n[136] Ibid., p. 70.\n[137] “JUDGE ORIE: Yes. As far as the entering into this agreement from your own to this plea\nagreement? Voluntarily, not being forced or threatened or in whatever way? THE ACCUSED:\n[Interpretation] Yes, Your Honour.” Prosecutor v. ?e?i? (Case No. IT-95-10\/1-PT) Plea\nTranscript (8 October 2003) pp. 71-72.\n[138] Ibid., p. 71.\n[139] Prosecutor v. Mr?a (Case No. IT-02-59) Amended Indictment (4 August 2003) paras. 1-15.\nAs a member of the special Bosnian Serb police unit “Intervention Squad” Darko Mr?a was\naccused of personally and directly participating in the unloading, guarding, escorting, shooting\nand killing of more than 200 unarmed men at Kori?anske Stijene.\n[140] Prosecutor v. Mr?a (Case No. IT-02-59) Sentencing Judgment (31 March 2004), paras. 3-4.\nFollowing the Prosecution’s sentence recommendation of between fifteen to twenty years he was\nsentenced in March 2004 to seventeen years imprisonment. Ibid para. 129.\n[141] “Mr. Mrdja, I went through the plea agreement on the main lines. Is there anything that is not clear to you in\nrespect of this agreement? Is there anything you would like to say adding to this agreement between you and the\nOffice of the Prosecution? THE ACCUSED: [Interpretation] Your Honour, everything is clear to me.”\nProsecutor v Mr?a (Case No. IT-02-59) Plea Transcript (24 July 2003) p. 86.\n[142] “For example, that you would defend yourself, that you would call witnesses, that you\nwould examine witnesses, that you would prepare for such a defence, that the right to remain\nsilent, which is often invoked by those who stand trial, that by entering a different plea, of course,\nyou give up that right.” Prosecutor v. Mr?a (Case No. IT-02-59) Plea Transcript (24 July 2003)\npp. 85-86.\n[143] Milan Babi? acted first as leader of the government of the self-declared Serbian\nAutonomous Region (SAO) Krajina and then as President of the Republic of Serbian Krajina\n(RSK) in north-eastern Croatia. For his active support of the ‘ethnic cleansing’ campaign he was\ncharged with crimes against humanity. For details of the facts see Prosecutor v. Babi? (Case No.\nIT-03-72-I) Factual Statement, Tab 1 (22 January 2004).\n[144]Prosecutor v. Babi? (Case No. IT-03-72-I) Plea Transcript (27 January 2004) paras. 30-45.\n[145]Ibid., para. 45.\n[146] Cook supra note 46, p. 492.\n[147] Combs supra note 12, p. 120. Another reason suggested is that some defence lawyers\ncoming from developing countries have no incentive preventing a trial that would be very\nlucrative for them.\n[148] Combs supra note 12, p. 73.\n[149] Ibid., p. 72.\n[150] ICTR Rules of Procedure and Evidence, U.N. Doc. ITR\/3\/Rev.1 (1995).\n[151] Modelled on Rule 62 bis of the ICTY-RPE Rule 62 B ICTR-RPE provides that 2 the Trial\nChamber shall satisfy itself that the guilty plea: (i) is made freely and voluntarily; (ii) is an\ninformed plea; (iii) is unequivocal; and (iv) is based on sufficient facts for the crime and accused’s\nparticipation in it, either on the basis of objective indicia or of lack of any material disagreement\nbetween the parties about the facts of the case.\n[152] Prosecutor v. Kambanda (Case No. ICTR-97-23-S) Judgment and Sentence (4 September\n1998) para. 3.\n[153] Prosecutor  v. Rutaganira (Case No. ICTR-95-1C-I) Minutes of Proceedings (8 December\n2004) para. 42.\n[154] Prosecutor v. Kambanda (Case No. ICTR-97-23-S) Judgment and Sentence (4 September\n1998) para. 47.\n[155] Ibid., para. 48.\n[156] Prosecutor v. Kambanda (Case No. ICTR-97-23-I) Transcript (3 September 1998) p. 33.\n[157] Prosecutor v. Kambanda (Case No. ICTR 97-23-S) Judgment and Sentence (4 September\n1998) para. 62.\n[158] Ibid., para. 61(B) (v)-(vii). These factors are i.e. that (i) the crimes for which Jean\nKambanda is responsible carry an intrinsic gravity, and their widespread, p.rocious and systematic\ncharacter is particularly shocking to the human conscience; (ii) Jean Kambanda committed the\ncrimes knowingly and with premeditation; (iii) and, moreover, Jean Kambanda, as Prime Minister\nof Rwanda was entrusted with the duty and authority to protect the population and he abused this\ntrust.\n[159] Combs supra note 12, p. 104.\n[160] Even if not as low as the two years the defence had suggested.\n[161] Combs supra note 12, p. 103.\n[162] Prosecutor v. Plav?i? (Case No. IT-00-39&40\/ 1-S) Sentencing Judgment (27 February\n5\n52003) para. 53.\n[163] Ibid., para. 80.\n[164] Prosecutor v. Kambanda (Case No. ICTR-97-23-A) Appeal Judgment (19 October 2000)\npara. 3.\n[165] Ibid., para. 10.\n[166] Prosecutor v. Kambanda (Case No. ICTR-97-23-A) Judgment (19 Oct. 2000) para. 126.\n[167] Combs supra note 12, p. 122. Defendants also doubt the impartiality of the Court as no\nmember of the RPF has been charged.\n[168] Prosecutor v. Serushago (Case No. ICTR-98-39-S) Sentence (5 February 1999). Omar\nSerushago was the leader of a small group of militia who controlled a roadblock where Tutsis\nwere detained and killed. He himself admitted having killed four people.\n[169] Prosecutor v. Serushago (Case No. ICTR-98-39-S) Sentence (5 February 1999) para. 34.\n[170] Ibid., para. 4.\n[171] Prosecutor v. Kambanda ( Case No. ICTR-97-23-S) Judgment and Sentence (Sept. 4, 1998) para. 60;\nProsecutor v. Akayesu (Case No. ICTR-96-4-T) Sentence (2 October 1998); Prosecutor v. Kayishema &\nRuzindana (Case No. ICTR 95-1-T) Judgment, Sentence (21 May 1999) para. 25.\n[172] Prosecutor v. Serushago (Case No. ICTR-98-39) Transcript, paras. 10-12, 15.\n[173] Prosecutor v. Serushago (Case No. ICTR-98-39-S) Sentence (5 February 1999) paras. 31-\n40.\n[174] Ibid., para. 42. Nonetheless, Serushago appealed against the sentencing decision arguing that the sentence was\nexcessive and that the Trial Chamber should have given more weight to the mitigating circumstances. The appeal was\nhowever dismissed. Prosecutor v. Serushago (Case No. ICTR-98-39-A) Reasons for Judgment (6 April 2000) para. 6.\n[175] Prosecutor v. Rutaganira (Case No. ICTR-95-1C-I) Minutes of Proceedings (8 December\n2004).\n[176] Prosecutor v. Rutaganira (Case No. ICTR-95-1C-T) Transcript (17 January 2005) pp. 2-3.\n[177] Ibid., p. 8.\n[178] Ibid., p. 29.\n[179] Prosecutor v. Rutaganira (Case No. ICTR-95-1C-T) Judgment and Sentence (14 March\n2005).\n[180] Combs supra note 12, p. 112.\n[181] Combs supra note 12, p. 113. See also Prosecutor v. Rutaganira (Case No. ICTR-95-1C-T)\nTranscript (17 January 2005) p. 8.\n[182] Prosecutor v. Ruggiu (Case No. ICTR-97-32-I) Judgment and Sentence, para. 53.\n[183] Ibid., para. 55.\n[184] Ibid. “It is important to encourage all those involved in crimes committed in  Rwanda  in  1994  to  confess  and\nadmit their guilt.”\n[185] Rwanda Unhappy with Ruggiu Sentence, Hirondelle News Agency, June 1, 2000\n<www.hirondelle.org\/hirondelle.nsf\/caefd9edd48f5826c12564cf004f793d\/c319ac23033fce1ac1256\n721007ae237> 1 June 2009.\n[186] Also the prospect of having the case transferred to the Rwandan national courts which has\nthe death penalty (and defendants fear transfer to Rwanda out of fear of violence). See Combs\nsupra note 12, p. 117.\n[187] Combs supra note 12, p. 118. Combs research found also other explanation for the reluctance to plead  guilty  at\nthe ICTR. One is that many defendants are infected HIV so that a sentence reduction might  still  in  fact  mean  a  life\nimprisonment for them. Further while the trial is going on defendants are  detained  at  the  United  Nations  Detention\nFacility  (UNDF)  which  is  more  comfortable  and  provides  medical  treatment  whereas  after  trial  on  conviction\ndefendants are often sent to African prisons of lower comfort and less high standard of medical treatment.  Since  time\nserved waiting for trial will be discounted from the sentence after is wise to spend as much time at the  UNDF  with  a\nchance of acquittal. See Combs supra note 12, p. 121.\n[188] Ibid., p. 119.\n[189] Ibid., p. 118.\n[190] Ibid., p. 148.\n[191] Ibid., p. 119.\n[192] Ibid.\n[193] Salvatore Zappalà ‘Symposium: How to Ameliorate International Criminal Proceedings:\nSome Constructive Suggestions- Forward’ 5 Journal of International Criminal Justice  (2007) p.\n346.\n[194] Faster Justice for the Balkans, N.Y. TIMES, 28 November 2003, p. A30.\n[195] Scharf supra note 7, p. 1071.\n[196] And other international or hybrid courts.\n[197] For example whether a certain atrocity is to be classified as genocide or to what extent the\ndefence of duress is recognised.\n[198] Article 65 (1) (Proceedings on an admission of guilt) reads: “Where the accused makes an admission of guilt\npursuant to article 64, paragraph 8 (a), the Trial Chamber shall determine whether:\na) The accused understands the nature and consequences of the admission of guilt;\nb) The admission is voluntarily made by the accused after sufficient consultation with\ndefence counsel; and\nc) The admission of guilt is supported by the facts of the case that are contained in:\ni) The charges brought by the Prosecutor and admitted by the accused;\nii) Any materials presented by the Prosecutor which supplement the charges and\nwhich the accused accepts; and\niii) Any other evidence, such as the testimony of witnesses, presented by the\nProsecutor or the accused.\n[199] Prosecutor v. Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December 2003)\npara. 52.\n[200] § 257c German Criminal Procedure Code.\n (1) The Court can communicate in appropriate cases with the parties in accordance with the\nfollowing paragraphs about the process and outcome of the proceedings. § 244, paragraph 2 shall\nremain unaffected.\n(2) Subject of this agreement may only be those legal consequences that may be content of the\njudgement, corresponding court decisions and other procedural measures of the adjacent case and\nthe process behaviour of the parties. Part of any agreement is to be a confession. The guilty\nverdict and measures of reform and safeguarding may not be the subject of an agreement.\n(3) The Court announces the content that an understanding might have. Under the free assessment of\n5\n5all circumstances of the case and the general sentencing considerations the Court might also\nspecify an upper and lower limit of sentence. The parties have the opportunity to make a\nrepresentation. The agreement comes into force when defendant and prosecutor agree to the\nproposal of the court.\n(4) The binding of the Court in an agreement does not apply if legally or factually significant\ncircumstances have been overlooked or have developed since and the Court concludes therefore\nthat the prospective punishment is no more appropriate. The same applies if the consequent\nprocess behaviour of the accused does not conform to the behaviour on which the Court’s\nprognosis was based. In these cases the confession of the accused may not be used. The court\nmust inform any deviation immediately.\n(5) The accused shall be informed of the requirements and consequences of a deviation from the Court’s\ncontemplated of the result under paragraph 4. (Translation of the author).\n[201] Prosecutor v. Nikoli? (Case No. IT-02-60\/1-S) Sentencing Judgment (2 December 2003)\npara. 52.\n[202] Regarding hybrid courts it would be necessary to examine in how far the procedure of plea\nbargaining is in congruence with the national systems.\n[203] Article 65 Rome Statute.\n[204] Hans-Peter Marsch ‘Grundregeln bei Absprachen im Strafverfahren’ Zeitschrift für\nRechtspolitik (2007) p. 220.\n"}