{"doi":"10.1109\/NANOEL.2006.1609724","coreId":"101800","oai":"oai:epubs.surrey.ac.uk:1232","identifiers":["oai:epubs.surrey.ac.uk:1232","10.1109\/NANOEL.2006.1609724"],"title":"Novel approach to low substrate temperature synthesis of carbon nanotubes","authors":["Chen, GY","Poa, CHP","Stolojan, Vlad","Silva, S"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-01","abstract":"<p>We present a novel approach, which will potentially allow for low-temperature-substrate synthesis of carbon nanotubes using direct-current plasma-enhanced chemical vapour deposition. The approach utilizes top-down plasma heating rather than conventional heating from a conventional substrate heater under the electrode. In this work, a relatively thick titanium layer is used as a thermal barrier to create a temperature gradient between the Ni catalyst surface and the substrate. We describe the growth properties as a function of the bias voltage and the hydrocarbon concentrations. The heating during growth is provided solely by the plasma, which is dependent only on the process conditions, which dictate the power density and the cooling of the substrate, plus now the thermal properties of the \"barrier layer\". This novel approach of using plasma heating and thermal barrier allows for the synthesis of carbon nanotubes at low substrate temperature conditions to be attained with suitable cooling schemes.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1232<\/identifier><datestamp>\n      2017-10-31T14:01:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1232\/<\/dc:relation><dc:title>\n        Novel approach to low substrate temperature synthesis of carbon nanotubes<\/dc:title><dc:creator>\n        Chen, GY<\/dc:creator><dc:creator>\n        Poa, CHP<\/dc:creator><dc:creator>\n        Stolojan, Vlad<\/dc:creator><dc:creator>\n        Silva, S<\/dc:creator><dc:description>\n        <p>We present a novel approach, which will potentially allow for low-temperature-substrate synthesis of carbon nanotubes using direct-current plasma-enhanced chemical vapour deposition. The approach utilizes top-down plasma heating rather than conventional heating from a conventional substrate heater under the electrode. In this work, a relatively thick titanium layer is used as a thermal barrier to create a temperature gradient between the Ni catalyst surface and the substrate. We describe the growth properties as a function of the bias voltage and the hydrocarbon concentrations. The heating during growth is provided solely by the plasma, which is dependent only on the process conditions, which dictate the power density and the cooling of the substrate, plus now the thermal properties of the \"barrier layer\". This novel approach of using plasma heating and thermal barrier allows for the synthesis of carbon nanotubes at low substrate temperature conditions to be attained with suitable cooling schemes.<\/p><\/dc:description><dc:date>\n        2006-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1232\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Chen, GY, Poa, CHP, Stolojan, Vlad and Silva, S  (2006) Novel approach to low substrate temperature synthesis of carbon nanotubes  In: IEEE Conference on Emerging Technologies - Nanoelectronics, 2006-01-10 - 2006-01-13, Singapore, SINGAPORE.     <\/dc:identifier><dc:relation>\n        10.1109\/NANOEL.2006.1609724<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1232\/","10.1109\/NANOEL.2006.1609724"],"year":2006,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"Novel approach to low substrate temperature \nsynthesis of carbon nanotubes\nG.Y. Chen, C.H.P. POA, V. STOLOJAN AND S.R.P. SILVA \nNano-Electronic Centre, Advanced Technology Institute, University of Surrey, Guildford, Surrey, GU2 7XH, United Kingdom \nAbstract - We present a novel approach, which will potentially \nallow for low-temperature-substrate synthesis of carbon \nnanotubes using direct-current plasma-enhanced chemical \nvapour deposition. The approach utilizes top-down plasma \nheating rather than conventional heating from a conventional \nsubstrate heater under the electrode. In this work, a relatively \nthick titanium layer is used as a thermal barrier to create a \ntemperature gradient between the Ni catalyst surface and the \nsubstrate. We describe the growth properties as a function of the \nbias voltage and the hydrocarbon concentrations. The heating \nduring growth is provided solely by the plasma, which is \ndependent only on the process conditions, which dictate the \npower density and the cooling of the substrate, plus now the \nthermal properties of the “barrier layer”. This novel approach of \nusing plasma heating and thermal barrier allows for the synthesis \nof carbon nanotubes at low substrate temperature conditions to \nbe attained with suitable cooling schemes. \nI. INTRODUCTION \nOver the past few years, the growth of carbon nanotubes has \nbeen a topic of tremendous interest and activity. This is largely \ndue to their physical characteristics such as high aspect ratios, \nlarge surface areas and ballistic electronic transport. The \nunique properties of nanotubes make them attractive for \napplications including field emission displays, interconnects \nfor integrated circuits, high speed ballistic transistors, fuel cell \nelectrodes and supercapacitors [[1]-[4]].  \nDespite the numerous techniques available for the synthesis \nof carbon nanotubes, only chemical vapour deposition (CVD) \noffers the ability to selectively deposit carbon directly onto the \nsubstrate at reduced process temperatures [[5],[6]]. The \nadvantages of CVD make it a technique that is highly suitable \nfor the fabrication of electronic sensors, devices, interconnects, \netc [[7]-[9]]. Although the CVD technique allows lower \nprocessing temperatures, these have typically been restricted \nto above 500°C. As Melechko et. al. concludes in his review \non vertically aligned growth of carbon nanofibres, that \nalthough the literature indicates that the growth of carbon \nnanotubes and nanofibres requires a catalyst particle \ntemperature to be high enough to provide high carbon \ndiffusion rates, there is no such requirement for the substrate\n[[10]].  \nThis suggests that, if the high temperatures required for \ncarbon nanotube growth can be contained to the surface or \nnear the surface region, the growth can still proceed even if \nthe substrate is maintained at lower temperatures. One method \nof achieving this is to use a thermal barrier to contain the heat \nclose to the surface, while concurrently cooling the substrate. \nIf this approach is to be used, the heat must therefore be \nprovided from the top (or on the surface side). At present, \nmost research is focused on heating the substrate using a \nheater located below the substrate.  \nRecently, there have been reports of low-temperature-\nsynthesis of carbon nanotubes [[11]-[14]]. However, low \ntemperature synthesis has, so far, typically resulted in \namorphous or herring-bone like structures, rather than well \ngraphitised nanotubes. These techniques however use plasma \nbased systems which provide a situation suitable to the \napproach of top down heating. The combination of plasma \nprocessing and a thermal barrier would offer the possibility of \nlow-substrate-temperature growth.  \nIn this work, we investigate the use of a titanium layer as the \nthermal barrier. Titanium is selected due to its low thermal \nconductivity among metals, and also the restriction of using \ninsulating materials in DC generated plasmas. The use of the \ntitanium layer limits the transfer of heat generated by the \nplasma, thus maintaining a temperature difference between the \nsurface and the substrate. The effective use of the plasma to \nachieve the lowest possible surface temperature for carbon \nnanotube growth would allow for the greater flexibility in \nusing this approach. Besides showing that growth is possible \nusing this novel method, the influences of the process \nparameters are also investigated.\nII. EXPERIMENTAL \nThe PECVD system used for the growth has a parallel plate \nelectrode configuration, driven by a direct current power \nsource. The electrode is a 2.5” diameter graphite plate. Using \nacetylene as the carbon feedstock and nitrogen\/hydrogen as \nthe carrier\/dilution gases respectively, carbon nanostructures \nare synthesised without the application of an external heat \nsource (other than heating from the plasma). The system base \npressure was 10-3 Torr and the graphite substrate table \ntemperature was monitored using an embedded thermocouple. \nThe temperature reading for each run was taken as the highest\ntemperature reached during the deposition. The concentration \nof hydrocarbon was simply taken as the gas flow ratio of \n0-7803-9358-9\/06\/$20.00  © 2006 IEEE 254\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 17,2010 at 04:54:33 EST from IEEE Xplore.  Restrictions apply. \nacetylene to a nitrogen\/hydrogen mixture. An electrode \nseparation of 1 cm was used on all depositions. A 500 nm-\nthick layer of titanium was first sputter-deposited onto a Si \n(100) substrate, followed by the sputter-deposition of a 30nm-\nthick nickel layer. The sample was not pre-treated in any form \nbefore the deposition. A typical nanotube growth run would \nstart with the backfilling of the evacuated chamber to the \ndesired operating pressure, followed by the ignition of the \nplasma using the nitrogen\/hydrogen mixture, and the \nsubsequent introduction of acetylene. The sample was then \ncooled in an inert nitrogen ambient, before removal for \nsubsequent characterisation. The morphology and \nmicrostructure of the nanotubes were characterised using a \nHitachi S-4000 Field Emission (FE) Scanning Electron \nmicroscope (SEM) and a Philips CM200 transmission electron \nmicroscope (TEM) (200 kV accelerating voltage, LaB6\nfilament, line resolution of 0.14nm).  \nIII. RESULTS AND DISCUSSION \nThe synthesis of the carbon nanotubes was carried out at 10 \nTorr for 45 min, with 500V of applied bias. Figure 1 shows \nthe changes in carbon nanostructures, synthesized for \nhydrocarbon concentrations of 1, 3 and 6%. \nFigure 1: SEM images of the effect of different concentration of hydrocarbon \nconcentration; (a) 1%, (b) 3%, (c) 6% and (d) high magnification image of fig \n1a. Reducing the hydrocarbon concentration is essential for carbon nanotube \nat low substrate temperatures. \nAlthough carbon nanotubes were observed for all \nhydrocarbon concentrations, as the hydrocarbon content is \nincreased, the quantity of amorphous carbon increased, \ncorrespondingly. The SEM images clearly show that the \ncontrol of the carbon in the system is crucial to nanotube \nsynthesis. At the lowest hydrocarbon concentration of 1%, the \ncarbon nanotubes are formed in discrete bundles. Above 6% \nhydrocarbon content, the deposit begins to resemble an \namorphous carbon thin film formation [Figure 1c]. The \nimportance of balancing the hydrocarbon concentration has \nalways been critical, even for high-temperature growth, or \nwith an etching gas like ammonia [[5],[16]].  \nFigure 2 shows the effect of changing the applied \nbias on the synthesis. The plasma was ignited at 10 Torr, with \n3.0% hydrocarbon concentration, for 45mins.  \nFigure 2: SEM images of the effect of different applied bias; (a) 450V, (b) \n475V, (c) 500V and (d) 550V. \n It can be seen that, at the lowest voltage, the energy of the \nplasma was only sufficient in forming small carbon \nnanostructures. As the applied voltage increases, the structures \nchange from pillars of sizes of around 100nm to nanotube \nbundles. At 500V, nanotubes were observed, though most of \nthe structures consisted of predominately amorphous carbon. \nAt the highest voltage of 550V, the nanotubes were formed in \na similar manner as in figure 1a. In all the plasma processes, \nthe maximum recorded substrate temperature was between \n350 and 417°C. Figure 3 shows a graph of the substrate \ntemperature monitored against the plasma bias. \nFigure 3: The relationship between the measured maximum substrate \ntemperature and the applied plasma bias based on a 2.5” cathode diameter. \n255\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 17,2010 at 04:54:33 EST from IEEE Xplore.  Restrictions apply. \nThe substrate temperature increases with the applied plasma \nvoltage. This is as expected, as more energy is delivered to the \nsystem. It can be noted that the substrate temperature is \nrelatively lower than the typical synthesis temperature \nreported. \nNanotubes synthesised at 550V were scratched off \nthe substrate and ultrasonically dispersed in methanol. A drop \nof the solution was deposited on a holey carbon grid and the \ninternal morphology of the nanotubes analysed. Figure 4 \nshows the TEM image of a bundle of nanotubes.  \nFigure 4: (a) Bright field image of a bundle of carbon nanotubes. (b) HRTEM \nof low temperature synthesised multi-walled carbon nanotube, showing \ngraphitic planes aligned to nanotube axis. \nMost of the nanotubes appear to be following a base-growth \nmodel [[14],[17],[18]], with the nanotube growing out of the \ncatalyst particle and terminating with a closed end. The \nHRTEM image shows the graphene walls of the nanotubes, \nwhich are aligned to the nanotube axis. The graphene walls \ncontain numerous defects, which are probably due to the low \nsynthesis temperature.  \nThis shows that nanotubes can be formed at low \ntemperatures, using the combined effects of the plasma and a \nreduced hydrocarbon concentration. In plasma-assisted growth, \nthe surface heating from the plasma is often ignored, or \nassumed to be similar to the set substrate temperature, as \nhighlighted by Teo et al [[20]]. In our case, the temperature \nfrom plasma heating is monitored, without any intentional \ncooling of the substrate. This means that the heating is solely \nfrom the plasma. The results show that, despite the lower \nprocess temperature used, as compared to the usual \ntemperatures reported, the synthesis of nanotubes is still \npossible. However, to achieve the growth of nanotubes \nwithout the lower defect levels typical for low temperature \nsynthesis [[11]-[14]], a titanium layer is used here to allow an \nincrease in the plasma heating of the surface, without also \nheating the substrate. In this work, the substrate temperature \nmeasured is a steady-state value. This can be seen from the \nSEM images, showing the effect of the applied bias, where the \nincreasing applied bias reaches a state such that sufficient \nheating is attained for nanotube growth (Figure 2). With \nsuitable thermal barrier material and a water cooled electrode \nas used in ref. [[11],[12]], the substrate temperature could be \nlowered further. \nUsing a 1D reactor model, Teo and co-workers [[20]]\nproclaim in their paper that a simple parallel plate DC-PECVD \nreactor heats to approximately 700°C due to plasma heating, \nignoring the reactor geometry and the resulting power flux on \nthe electrode. This makes the comparison of different \napparatus incorrect. Reactor geometry and coupled plasma \npower are the key parameters when considering substrate \nheating by the plasma; e.g. the DP800 system used in ref [11] \nhas an exposed cathode area in excess of 500cm2, translating \nto less than 0.5W\/cm2 (i.e. ~50°C [[20]]). The power flux used \nby Teo and co-workers [[20]] was 20W\/cm2 (i.e. ~700°C) \nwhilst in this work, the power flux was ~5W\/cm2 (i.e. ~350°C \n[[20]], similar to the highest temperatures we have measured \nduring our growth). It is clear that low substrate temperatures \nand the growth of carbon nanotubes at relatively low substrate \ntemperatures are possible. \nThe second factor contributing to the low-\ntemperature-growth is the reduced hydrocarbon concentration \nin the system. The lower synthesis temperature means that the \narrival rate of the carbon at the surface has to be balanced with \nthe diffusion process of the nucleation and growth. The \nimportance of this balance was also reported by Minea and co-\nworkers, where they adopted another approach by using an \nalternating nitrogen and acetylene plasma [[14]]. Obviously, if \nthe surface or overall temperature is increased, more carbon \ncan be introduced into the system due to the faster \nthermodynamically driven diffusion rate, as suggested by the \nuse of 3.0% hydrocarbon at 550V (Figure 3d).  \nThe nanotubes synthesised using the plasma and the \ntitanium layer predominately follow a base-growth mechanism, \nwhere the catalyst particle remains on the surface, as \nsuggested by the TEM analysis. This is due to the strong \ninteraction between the titanium buffer layer and the nickel \ncatalyst. The entire growth process is thought to start with the \nbreaking up and the fusing of the nickel particle with the \ntitanium layer, thus forming a strong base support. At the \ninitial stages of the growth, the carbon diffuses into\/around the \nnickel catalyst. This continues until a super-saturation state is \nformed, following which, the carbon precipitates out of the \nnickel and the nanotube structure starts growing.  \nIV. CONCLUSION \nIn conclusion, we show that it is possible to \nsynthesise carbon nanotubes at low substrate temperatures, \nusing a combination of plasma heating\/dissociation and a \ntitanium thermal buffer layer. The synthesised nanotubes have \na lower level of defects than their typical low-temperature-\ngrown counterparts, which tends to produce carbon nanofibres. \nWith a suitable substrate-cooling setup and a thermal barrier, \nit would be possible to achieve high growth rates for carbon \nnanotubes at room substrate temperatures, as well as low \ndefect levels. \n256\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 17,2010 at 04:54:33 EST from IEEE Xplore.  Restrictions apply. \nACKNOWLEDGMENT \nThe authors acknowledge the financial support from EPSRC \nin the form of a Carbon Based Electronics grant and the \nPortfolio Partnership Award. \nV. REFERENCES \n[1] Niu C., Sichel E.K., Hoch R., Moy D., Tennet H., Appl. Phys. Lett. 70, \n1480 (1997) \n[2] Tzeng Y., Chen Y., Liu C., Diamond Relat. Mater., 12, 774 (2003) \n[3] Frackowiak E., Meternier K., Bertagna V., Beguin F., Appl. Phys. Lett. \n77, 1480 (2000) \n[4] Liu T., Sreekumar T.V., Kumar S., Hauge R.H., Smalley R.E., Carbon \n41, 2440 (2003) \n[5] Teo K.B.K., Chhowalla M., Armaratunga G.A.J., Milne W.I., Hasko \nD.G., Pirio G., et al., Appl. Phys. Lett. 79, 1534 (2001) \n[6] Wang Y., Rybczynsji J., Wang D.Z., Kempa K., Ren Z.F., Li W.Z., \nKimball B., Appl. Phys. Lett. 85, 4741 (2004) \n[7] Li J., Papadopoulos C., Xu J.M., Moskovits M., Appl. Phys. Lett. 75, \n367 (1999) \n[8] Franklin N.R., Wang Q., Tombler T.W., Javey A., Shim M., Dai H., \nAppl. Phys. Lett. 81, 913 (2002)  \n[9] Li J., Ye Q., Cassell A., Ng H.T., Stevens R., Han J., Meyyappan M., \nAppl. Phy. Lett. 82, 2491 (2003)  \n[10] Melechko A.V., Merkulov V.I., McKnight T.E., Guillorn M.A., Klein \nK.L., Lowndes D.H., Simpson M.L., Appl. Phys. Lett. 97, 041301 (2005) \n[11] Boskovic B.O., Stolojan V., Khan R.U.A., Haq S., Silva S.R.P., Nat. \nMater. 1, 165 (2002) \n[12] Boskovic B.O., Stolojan V., Zeze D.A., Forrest R.D., Silva S.R.P., Haq \nS.J.. J. Appl. Phys. 96, 3443 (2004) \n[13] Hofmann S., Kleinsorge B., Ducati C., Robertson J., New J. Phys. 5, \n153.1 (2003) \n[14] Minea T.M., Point S., Granier A., Touzeau M., Appl. Phys. Lett. 85, \n1244 (2004) \n[15] Englander O., Christensen D., Lin L., Appl. Phys. Lett. 82, 4797 (2003) \n[16] Chhowalla M., Teo K.B.K., Ducati C., Rupesinghe N.L., Amaratunga \nG.A.J., Ferrari A.C., et al., J. Appl. Phys. 90, 5308 (2001) \n[17] Tibbetts G.G., Devour M.G., Rodda E.J., Carbon 25, 367 (1987) \n[18] Tibbetts G.G., J. Cryst. Growth 66, 632 (1984) \n[19] Baker R.T.K., Carbon 27, 315 (1989) \n[20] Teo K.B.K., Hash D.B., Lacerda R.G., Rupesinghe N.L., Bell M.S., \nDalal S.H., Bose D., et al., Nano Lett. Vol 4, 921 (2004) \n257\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 17,2010 at 04:54:33 EST from IEEE Xplore.  Restrictions apply. \n"}