{"doi":"10.1109\/TCAD.2005.852279","coreId":"71317","oai":"oai:eprints.lancs.ac.uk:2679","identifiers":["oai:eprints.lancs.ac.uk:2679","10.1109\/TCAD.2005.852279"],"title":"Modelling delay and noise in arbitrarily coupled RC trees.","authors":["Pamunuwa, Dinesh B."],"enrichments":{"references":[{"id":16368305,"title":"An explicit RC-circuit delay approximation based on the ﬁrst three moments of the impulse response,” in","authors":[],"date":"1996","doi":"10.1109\/dac.1996.545648","raw":"B. Tutuianu, F. Dartu, and L. T. Pillage, “An explicit RC-circuit delay approximation based on the ﬁrst three moments of the impulse response,” in Proc. Design Automation Conf. (DAC), Las Vegas, NV, 1996, pp. 611–616.","cites":null},{"id":16368282,"title":"Analysis of on-chip inductance effects using a novel performance optimization methodology for distributed RLC interconnects,” in","authors":[],"date":"2001","doi":"10.1145\/378239.379069","raw":"K. Banerjee and A. Mehrotra, “Analysis of on-chip inductance effects using a novel performance optimization methodology for distributed RLC interconnects,” in Proc. Design Automation Conf. (DAC), Las Vegas, NV, 2001, pp. 798–803.","cites":null},{"id":16368302,"title":"analytic delay model for RLC interconnects,”","authors":[],"date":"1997","doi":"10.1109\/43.664231","raw":"——, “An analytic delay model for RLC interconnects,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. 16, no. 12, pp. 1507–1514, Dec. 1997.","cites":null},{"id":16368276,"title":"Analytic modeling of interconnects for deep sub-micron circuits,” in","authors":[],"date":"2003","doi":null,"raw":"——, “Analytic modeling of interconnects for deep sub-micron circuits,” in Proc. Int. Conf. Computer-Aided Design (ICCAD), San Jose, CA, Nov. 2003, pp. 835–842.","cites":null},{"id":16368289,"title":"Asymptotic waveform evaluation for timing analysis,”","authors":[],"date":"1990","doi":"10.1109\/43.45867","raw":"L. T. Pillage and R. A. Rohrer, “Asymptotic waveform evaluation for timing analysis,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. 9, no. 4, pp. 352–366, Apr. 1990.","cites":null},{"id":16368288,"title":"Charge-sharing models for switch level simulation,”","authors":[],"date":"1987","doi":"10.1109\/tcad.1987.1270346","raw":"C. Y. Chu and M. A. Horowitz, “Charge-sharing models for switch level simulation,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. CAD-6, no. 6, pp. 1053–1061, Nov. 1987.","cites":null},{"id":16368339,"title":"Crosstalk noise estimation for generic RC trees,” in","authors":[],"date":"2001","doi":"10.1109\/iccd.2001.955012","raw":"M. Takahashi, M. Hashimoto, and H. Onodera, “Crosstalk noise estimation for generic RC trees,” in Proc. Int. Conf. Computer Design (ICCD), Austin, TX, 2001, pp. 110–116.","cites":null},{"id":16368326,"title":"Delay and noise formulas for capacitively coupled distributed RC lines,” in","authors":[],"date":"1998","doi":"10.1109\/aspdac.1998.669394","raw":"H. Kawaguchi and T. Sakurai, “Delay and noise formulas for capacitively coupled distributed RC lines,” in Proc. Asian and South Paciﬁc Design Automation Conf., Yokohama, Japan, Jun. 1998, pp. 35–43.","cites":null},{"id":16368314,"title":"Effects of inductance on the propagation delay and repeater insertion in VLSI circuits,”","authors":[],"date":"2000","doi":"10.1109\/dac.1999.782051","raw":"Y. I. Ismail and E. G. Friedman, “Effects of inductance on the propagation delay and repeater insertion in VLSI circuits,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 8, no. 2, pp. 195–206, Apr. 2000.","cites":null},{"id":16368335,"title":"Efﬁcient coupled noise estimation for on-chip interconnects,” in","authors":[],"date":"1997","doi":"10.1109\/iccad.1997.643399","raw":"A. Devgan, “Efﬁcient coupled noise estimation for on-chip interconnects,” in Proc. Int. Conf. Computer-Aided Design (ICCAD), San Jose, CA, 1997, pp. 147–153.","cites":null},{"id":16368342,"title":"Efﬁcient delay calculation in presence of crosstalk,” in","authors":[],"date":"2000","doi":"10.1109\/isqed.2000.838932","raw":"X. Tong and M. Marek-Sadowska, “Efﬁcient delay calculation in presence of crosstalk,” in Proc. Int. Symp. Quality Electronic Design (ISQED), San Jose, CA, 2000, pp. 491–497.","cites":null},{"id":16368293,"title":"Efﬁcient reduced-order modeling of frequency-dependent coupling inductances associated with Authorized licensed use limited to:","authors":[],"date":"2009","doi":"10.1109\/edtc.1995.470349","raw":"L. M. Silveira, M. Kamon, and J. White, “Efﬁcient reduced-order modeling of frequency-dependent coupling inductances associated with Authorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. PAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1739 3-D interconnect structures,” in Proc. Design Automation Conf. (DAC), San Francisco, CA, 1995, pp. 376–380.","cites":null},{"id":16368281,"title":"Figures of merit to characterize the importance of on-chip inductance,”","authors":[],"date":"1999","doi":"10.1109\/dac.1998.724534","raw":"I. Ismail, E. G. Friedman, and J. L. Neves, “Figures of merit to characterize the importance of on-chip inductance,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 7, no. 4, pp. 442–449, Dec. 1999.","cites":null},{"id":16368320,"title":"h-gamma: An RC delay metric based on a gamma distribution approximation to the homogeneous response,” in","authors":[],"date":"1998","doi":"10.1145\/288548.288555","raw":"T. Lin, E. Acar, and L. T. Pillage, “h-gamma: An RC delay metric based on a gamma distribution approximation to the homogeneous response,” in Proc. Int. Conf. Computer-Aided Design (ICCAD), San Jose, CA, 1998, pp. 19–25.","cites":null},{"id":16368352,"title":"IC Interconnect Analysis.","authors":[],"date":"2002","doi":"10.1007\/b101921","raw":"M. Celik, L. Pileggi, and A. Odabasioglu, IC Interconnect Analysis. Boston, MA: Kluwer, May 2002. Dinesh Pamunuwa (M’04) received the B.Sc. degree in engineering with honors from the University of Peradeniya, Peradeniya, Sri Lanka, in 1997, and thePh.D.degreeinelectronicsystemdesignfromthe Royal Institute of Technology (KTH), Stockholm, Sweden, in 2003. He is currently a faculty member of the Department of Engineering at Lancaster University, Lancaster, U.K. In 2002, he was also at Cadence Berkeley Laboratories in Berkeley, CA. He has worked extensively on interconnect design and signal integrity issues and methodologies for electronic system design. He is the author and coauthor of many papers in this area. Dinesh is also the cofounder of PsiTech, an electronics and software consultancy company based in Sweden and Sri Lanka. His currentresearch interests include nanoelectronic devices and circuits and tera-scale integration in the nanometer regime. Shauki Elassaad received the B.S. and M.S. degrees in computer engineering from North Carolina State University, Raleigh, in 1988 and 1991, respectively. He is involved in research and development related to all aspects of Signal Integrity at Rio Design Automation. From 1999 to 2004, he worked at Cadence Berkeley Laboratories, Berkeley, CA, where his research included various aspects of design planning timing, signal integrity, interconnect design, and hierarchical ﬂoorplanning. From 1997 to 1999, he architected and designed timing algorithms for hierarchical ﬂoorplanning methodologies. During his tenure at High-Level Design Systems from 1993 to 1997, he was involved in various products related to physical design—clock design, delay calculation, and global routing. From 1991 to 1993, he worked at Intel Corporation where he designed algorithms for extraction and delay analysis for high-end microprocessors. His research interests include design planning, signal and power integrity, and digital design. Hannu Tenhunen received the Diploma Engineer degree in electrical engineering and computer sciences from Helsinki University of Technology, Helsinki, Finland, in 1982, and the Ph.D. degree in microelectronics from Cornell University, Ithaca, NY, in 1986. During 1978–1982, he was with Electron Physics Laboratory, Helsinki University of Technology, and from 1983 to 1985 at Cornell University as a Fullbright scholar. Since September 1985, he has been withtheSignalProcessingLaboratory,TampereUniversity of Technology, Tampere, Finland, as an Associate Professor. He was also a coordinator of the National Microelectronics Programme of Finland during 1987–1991. Since January 1992, he has been with the Royal Institute of Technology (KTH), Stockholm, Sweden, where he is a Professor of electronic system design. His current research interests are in very large scale integration (VLSI) circuits and systems for wireless and broadband communication, and related design methodologies and prototyping techniques. He has made over 400 presentations and publications on IC technologies and VLSI systems worldwide, and has over 16 patents pending or granted. Authorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply.","cites":null},{"id":16368278,"title":"Interconnect and substrate modelling and analysis: An overview,”","authors":[],"date":"1998","doi":"10.1109\/4.711346","raw":"E. Chiprout, “Interconnect and substrate modelling and analysis: An overview,” IEEE J. Solid-State Circuits, vol. 33, no. 9, pp. 1445–1452, Sep. 1998.","cites":null},{"id":16368279,"title":"Maximizing throughput over parallel wire structures in the deep submicrometer regime,”","authors":[],"date":"2003","doi":"10.1109\/tvlsi.2003.810800","raw":"D. Pamunuwa, L. R. Zheng, and H. Tenhunen, “Maximizing throughput over parallel wire structures in the deep submicrometer regime,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 11, no. 2, pp. 224–243, Apr. 2003.","cites":null},{"id":16368275,"title":"Modelling noise and delay in VLSI circuits,”","authors":[],"date":"2003","doi":"10.1049\/el:20030208","raw":"D. Pamunuwa, S. Elassaad, and H. Tenhunen, “Modelling noise and delay in VLSI circuits,” Electron. Lett., vol. 39, no. 3, pp. 269–271, Feb. 2003.","cites":null},{"id":16368329,"title":"Noise and delay uncertainty studies for coupled RC interconnects,” in Proc. Application Speciﬁc Integrated Circuit\/System-on-Chip (ASIC\/SOC),","authors":[],"date":"1999","doi":"10.1109\/asic.1999.806462","raw":"A. B. Kahng, S. Muddu, and D. Vidhani, “Noise and delay uncertainty studies for coupled RC interconnects,” in Proc. Application Speciﬁc Integrated Circuit\/System-on-Chip (ASIC\/SOC), Washington, DC, 1999, pp. 3–8.","cites":null},{"id":16368332,"title":"Noise model for multiple segmented coupled RC interconnects,” in","authors":[],"date":"2001","doi":"10.1109\/isqed.2001.915219","raw":"A. B. Kahng, S. Muddu, N. Pol, and D. Vidhani, “Noise model for multiple segmented coupled RC interconnects,” in Proc. Int. Symp. Quality Electronic Design (ISQED), San Jose, CA, 2001, pp. 145–150.","cites":null},{"id":16368323,"title":"On switch factor based analysis of coupled RC interconnects,” in","authors":[],"date":"2000","doi":"10.1145\/337292.337318","raw":"A. B. Kahng, S. Muddu, and E. Sarto, “On switch factor based analysis of coupled RC interconnects,” in Proc. Design Automation Conf. (DAC), Los Angeles, CA, Jun. 2000, pp. 79–84.","cites":null},{"id":16368346,"title":"On the determination of the transfer function of electronic circuits,”","authors":[],"date":"1973","doi":"10.1109\/tct.1973.1083615","raw":"B. L. Cochrun and A. Grabel, “On the determination of the transfer function of electronic circuits,” IEEE Trans. Circuit Theory, vol. CT-20, no. 1, pp. 16–20, Jan. 1973.","cites":null},{"id":16368296,"title":"PRIMA: Passive reducedorder interconnect macromodeling algorithm,”","authors":[],"date":"1998","doi":"10.1007\/978-1-4615-0292-0_34","raw":"A. Odabasioglu, M. Celik, and L. T. Pileggi, “PRIMA: Passive reducedorder interconnect macromodeling algorithm,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. 17, no. 8, pp. 645–654, Aug. 1998.","cites":null},{"id":16368317,"title":"PRIMO: Probability interpretation of moments for delay calculation,” in","authors":[],"date":"1998","doi":"10.1109\/dac.1998.724516","raw":"R. Kay and L. T. Pillage, “PRIMO: Probability interpretation of moments for delay calculation,” in Proc. Design Automation Conf. (DAC), San Francisco, CA, 1998, pp. 463–468.","cites":null},{"id":16368291,"title":"Rapid interconnect circuit evaluator,” in","authors":[],"date":"1991","doi":"10.1145\/127601.127732","raw":"C. L. Ratzlaff, N. Gopal, and L. T. Pillage, “RICE: Rapid interconnect circuit evaluator,” in Proc. Design Automation Conf. (DAC),S a n Francisco, CA, 1991, pp. 555–560.","cites":null},{"id":16368311,"title":"RC Delay metrics for performance optimization,”","authors":[],"date":"2001","doi":"10.1109\/43.920682","raw":"C. J. Alpert, A. Devgan, and C. V. Kashyap, “RC Delay metrics for performance optimization,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. 20, no. 5, pp. 571–582, May 2001.","cites":null},{"id":16368308,"title":"S2P: A stable 2 pole RC delay and coupling noise metric,” in","authors":[],"date":"1999","doi":"10.1109\/glsv.1999.757377","raw":"E. Acar, A. Odabasioglu, M. Celik, and L. T. Pillage, “S2P: A stable 2 pole RC delay and coupling noise metric,” in Proc. Great Lakes Symp. (GLS) VLSI, Ypsilanti, MI, 1999, pp. 60–63.","cites":null},{"id":16368286,"title":"Signal delay in RC tree networks,”","authors":[],"date":"1983","doi":"10.1109\/dac.1981.1585417","raw":"J. Rubinstein, P. Penﬁeld, and M. Horowitz, “Signal delay in RC tree networks,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. CAD-2, no. 3, pp. 202–211, Jul. 1983.","cites":null},{"id":16368284,"title":"The transient response of linear damped circuits,”","authors":[],"date":"1948","doi":"10.1063\/1.1697872","raw":"W. C. Elmore, “The transient response of linear damped circuits,” J. Appl. Phys., vol. 19, no. 1, pp. 55–63, Jan. 1948.","cites":null},{"id":16368277,"title":"Timing models for MOS circuits,” Ph.D. dissertation,","authors":[],"date":"1984","doi":null,"raw":"M. A. Horowitz, “Timing models for MOS circuits,” Ph.D. dissertation, Stanford Electr. Lab., Stanford Univ., Stanford, CA, Jan. 1984.","cites":null},{"id":16368299,"title":"Two-pole analysis of interconnection trees,” in","authors":[],"date":"1995","doi":"10.1109\/mcmc.1995.512012","raw":"A. B. Kahng and S. Muddu, “Two-pole analysis of interconnection trees,” in Proc. Multi-Chip Module Conf. (MCMC), Santa Cruz, CA, 1995, pp. 105–110.","cites":null},{"id":16368280,"title":"When are transmission lines important for on-chip interconnects,”","authors":[],"date":"1997","doi":null,"raw":"A. Deutsch et al., “When are transmission lines important for on-chip interconnects,” IEEE Trans. Microw. Theory Tech., vol. 45, no. 10, pp. 1836–1846, Oct. 1997.","cites":null}],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2005-11","abstract":"Closed-form equations for second-order transfer functions of general arbitrarily coupled resistance-capacitance (RC) trees with multiple drivers are reported. The models allow precise delay and noise calculations for systems of coupled interconnects with guaranteed stability and represent the minimum complexity associated with this class of circuits. Their accuracy is extensively compared against other relevant models and is found to be better or comparable to more expensive models. All results are derived from a theoretical approach, and their physical basis is examined. The simplicity, accuracy, and generality of the models make them suitable for use in early signal integrity analyses of complex systems and incremental physical optimization","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71317.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/2679\/1\/jn3_TCAD05.pdf","pdfHashValue":"7add30157fedaeeed7574ab963e67d6f4bc41ab1","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:2679<\/identifier><datestamp>\n      2018-01-24T02:49:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Modelling delay and noise in arbitrarily coupled RC trees.<\/dc:title><dc:creator>\n        Pamunuwa, Dinesh B.<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        Closed-form equations for second-order transfer functions of general arbitrarily coupled resistance-capacitance (RC) trees with multiple drivers are reported. The models allow precise delay and noise calculations for systems of coupled interconnects with guaranteed stability and represent the minimum complexity associated with this class of circuits. Their accuracy is extensively compared against other relevant models and is found to be better or comparable to more expensive models. All results are derived from a theoretical approach, and their physical basis is examined. The simplicity, accuracy, and generality of the models make them suitable for use in early signal integrity analyses of complex systems and incremental physical optimization.<\/dc:description><dc:date>\n        2005-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/2679\/1\/jn3_TCAD05.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TCAD.2005.852279<\/dc:relation><dc:identifier>\n        Pamunuwa, Dinesh B. (2005) Modelling delay and noise in arbitrarily coupled RC trees. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 24 (11). pp. 1725-1739. ISSN 0278-0070<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/2679\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/TCAD.2005.852279","http:\/\/eprints.lancs.ac.uk\/2679\/"],"year":2005,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005 1725\nModeling Delay and Noise in Arbitrarily\nCoupled RC Trees\nDinesh Pamunuwa, Member, IEEE, Shauki Elassaad, and Hannu Tenhunen\nAbstract—Closed-form equations for second-order transfer\nfunctions of general arbitrarily coupled resistance–capacitance\n(RC) trees with multiple drivers are reported. The models allow\nprecise delay and noise calculations for systems of coupled inter-\nconnects with guaranteed stability and represent the minimum\ncomplexity associated with this class of circuits. Their accuracy is\nextensively compared against other relevant models and is found\nto be better or comparable to more expensive models. All results\nare derived from a theoretical approach, and their physical basis\nis examined. The simplicity, accuracy, and generality of the mod-\nels make them suitable for use in early signal integrity analyses of\ncomplex systems and incremental physical optimization.\nIndex Terms—Crosstalk, delay and noise modeling in VLSI\ncircuits, interconnect modeling, timing analysis, transfer function.\nI. INTRODUCTION\nIMPROVEMENTS in lithography have seen continuouslyshrinking line widths and increasing die sizes, resulting in\nunprecedented opportunities to implement entire systems on a\nsingle chip. This trend of decreasing feature sizes can be ex-\npected to continue for the next 8–10 years [1]. With decreasing\ngate delays and increasing wiring density, noise modeling and\nits impact on performance and functionality has become very\nimportant. The majority of signal wires are typically lossy, and\nhigher aspect ratios to control the resistance result in increased\ncapacitive coupling. This, together with smaller signal rise\ntimes, results in heavy crosstalk, which couples a noise voltage\nonto the victim net. A distinction is usually made between the\ncoupled noise amplitude and the effect of noise on delay. The\nformer can cause functional failures by causing the voltage\nto swing above or below the logic threshold, while the latter\nhas an impact on the cycle time.\nThe ability to put billions of transistors on a single die has\nalso imposed severe restrictions on the computational com-\nplexity of noise and delay models used in an iterative design\nflow. While more accurate modeling is necessary, the sheer\nManuscript received December 6, 2003; revised May 21, 2004 and October\n14, 2004. This work was funded partly by Cadence Design Systems, and partly\nby the Swedish governmental funding agencies Sida, Vinnova, and Exsite. The\nbulk of this work was carried out when D. Pamunuwa was a graduate intern\nat Cadence Berkeley Laboratories, Cadence Design Systems, Berkeley, CA\n94704 USA. This paper was recommended by Associate Editor D. Blaauw.\nD. Pamunuwa is with the Centre for Microsystems Engineering, Depart-\nment of Engineering, Faculty of Applied Sciences, University of Lancaster,\nLancaster LA14YW, U.K.\nS. Elassaad is with the Rio Design Automation, Santa Clara, CA 95054-\n1137 USA.\nH. Tenhunen is with the Laboratory of Electronics and Computer Systems,\nDepartment of Microelectronics and Information Technology, Royal Institute\nof Technology (KTH), Stockholm, SE 16440, Sweden.\nDigital Object Identifier 10.1109\/TCAD.2005.852279\nsize of the systems prohibits expensive dynamic simulation.\nConsequently, the subject of delay and noise modeling for\nvery large scale integration (VLSI) circuits has received a vast\namount of attention in the literature. The three attributes of\naccuracy, computational simplicity, and generality are, how-\never, difficult to encompass in a single integrated model. Most\nreported models that consider the effect of crosstalk on noise\nand delay either use heuristics that are tailored for specific\ntopologies or use multiple moments that make them expensive.\nIn particular, there is a huge need for an efficient model that\ncan be used in the inner loop of place-and-route algorithms\nfor global signal planning and incremental physical optimiza-\ntion in circuits with heavy coupling. In addition to minimal\ncomputational complexity, some other specific characteristics\nare necessary in such a model; it should allow a one-to-one\ncorrespondence between the physical structure being modeled,\nand the electrical circuit being analyzed, so that changes can be\nquickly and efficiently incorporated, and it should also exhibit\nfidelity. In incremental physical optimization, the absolute ac-\ncuracy of the delay at any given node predicted by the metric\nis of secondary importance to the generation of a solution that\nis the same, or as close as possible, to the solution that would\nbe generated by using a much more accurate delay metric.\nThe Elmore delay [10] possesses this attribute of fidelity,\nwhich, coupled with its peerless efficiency, is why it has been\nand still is very popular in place-and-route algorithms. How-\never, in the face of heavy coupling, its usefulness diminishes,\nfundamentally because it can only address grounded capacitors.\nThe contribution of this paper is as follows. Closed-form\nmodels for generating second-order transfer functions from\neach driver to the receiver in arbitrarily coupled resistance–\ncapacitance (RC) trees (such as that shown in Fig. 1) repre-\nsenting the minimum complexity for this class of circuits were\nrecently reported [2], [3]. The summation of all waveforms\nresults in the complete response to all switching events at the\nnode of interest, with no restriction on arrival times, and allows\nboth delay and noise estimations. These models are intended for\nglobal signal planning, and incremental physical optimization\nin CAD algorithms. In this paper, the model and constituent\nexpressions are derived from first principles, and formal proofs\nprovided; also, statistical data of extensive comparisons against\nother relevant models are included. It is also clearly shown\nhow this model saves at least two full tree traversals over the\nsecond-order model that bears the closest resemblance to it,\nwhile providing comparable accuracy.\nThis manuscript is organized as follows. The next section\npresents a detailed overview of the current work that puts\nthe contribution of the reported model in context. Section III\n0278-0070\/$20.00 © 2005 IEEE\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1726 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nFig. 1. Example of coupled RC tree.\nFig. 2. Example of simple RC tree.\nexplains the proposed modeling in detail, which is based on\nthe moments of the circuit, and follows a strict theoretical ap-\nproach. The proposal for guaranteeing stability and its physical\nramifications, and the computational complexity of the models\nare discussed. Next, the results of running the proposed models\non numerous test circuits are presented. The paper ends with a\ndiscussion.\nII. BACKGROUND\nAn accurate analysis of signal propagation in interconnects\nrequires solving Maxwell’s equations in three dimensions,\nwhich is prohibitively expensive in terms of computation time.\nHowever, it is possible to use simplified models in most\ncases to capture the important effects in the regime of interest\n[5], [6]. A particular concern with falling rise times is how\nimportant inductive effects are, and when and how they should\nbe modeled. A growing body of literature that addresses this\nissue now exists [7]–[9]. They propose metrics that relate the\nphysical dimensions of the wire to the signal rise time by\nassuming transverse-electromagnetic (TEM) propagation to de-\ntermine when neglecting inductive effects results in significant\nerrors. The general consensus now is that modeling inductance\nis necessary for special nets such as clock and power lines,\nand that the majority of signal lines can be accurately modeled\nby networks of resistors and capacitors, even with very small\nrise times. It is important, however, to consider the effect of\ncapacitive crosstalk, which is exacerbated by sharper slew rates.\nIn this paper, interconnects that can be modeled by coupled RC\nlines are considered.\nA. Delay Modeling\nTiming analysis in VLSI circuits has long been carried out\nusing the simplified model of an RC tree where all capacitors\nare connected to ground, whose circuit model is called a simple\ntree (Fig. 2). There is a large body of literature that deals with\ndelay modeling in simple trees. One of the most important and\nwidely used metrics, the first moment of the impulse response,\nwas proposed back in 1948 as an upper bound for the delay in\nvalve circuits [10] and is known as the Elmore delay. Its attrac-\ntion is that it uses minimum information and has unmatched\nalgorithmic simplicity and elegance, explicitly matches the\ncircuit elements to the delay, and yet exhibits good fidelity,\ngiving results as good as more expensive models when used in\ninterconnect optimization algorithms. However, as mentioned,\nit becomes less accurate as heavy coupling comes into play,\nand noise waveforms cannot be modeled, as a minimum of two\ntime constants are required to model a voltage spike. Bounds\nand metrics that give an indication of when the Elmore delay is\na poor approximation were developed in [11].\nA stable approximation to the second-order transfer function\nfor simple trees based on the first and second moment of\nthe impulse response, and the sum of the open-circuit time\nconstants, was proposed in [4] and expanded in [12] to en-\ncompass charge sharing networks. Later, generic moment-\nbased techniques applicable to any circuit comprising linear\nelements that allowed the calculation of an arbitrary number of\npoles were developed in [13]. An implementation that is opti-\nmized for the tree-like structures of interconnects was proposed\nin [14]. These techniques depend on the Padé approximation,\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1727\nwhich typically requires 2q moments for a qth-order approx-\nimation, and though very efficient, are too expensive for in-\ncremental physical optimization. Other estimators based on the\nArnoldi algorithm [15] match a lesser number of moments to\na qth-order approximation. An example is [16], which gives\nreduced order models for linear systems. However, at least\none LU decomposition of the admittance matrix (which has\na cubic complexity) is necessary, in addition to qN backward\nand forward substitutions for q block moments (for a qth-order\napproximation) of an N -port linear circuit. For a second-order\napproximation, the complexity is much more than the model\nproposed here, as shall be shown in Section III-D.\nHence, numerous models that occupy some position in the\nspectrum defined by the accurate though expensive solution\noffered by generic moment matching techniques such as AWE\n[13] (and similar methods) at one end, and the simplicity of-\nfered by the Elmore delay at the other, have been proposed.\nFor simple trees, the models of [4] represent the minimum\ncomputational complexity for a second-order model. Alternate\nsecond-order models for the transfer function include those\nreported in [17] and [18], which involve generating equivalent\ncircuits and are more suited for highly inductive lines, that\nreported in [19], which yields a stable model from the first\nthree moments, and also the one reported in [20]. The latter\ntwo models will be revisited as they are relevant in discussing\nthe performance of the proposed model.\nNow, a two (or higher)-pole model cannot be solved ex-\nplicitly for the delay at a given threshold. Hence, there are\nquite a few works that attempt to garner more information\nthan the first moment (Elmore delay) from the circuit, and\nmatch it explicitly to the delay via some heuristic, such as in\n[17]–[20]. Alpert et al. [21] also present two heuristic delay\nmetrics, one based on the first two moments, and another based\non an effective capacitance model, which seeks to overcome\nthe effect of resistive shielding that makes the Elmore delay in-\naccurate at near-end nodes. Explicit delay models for inductive\nlines were proposed in [22]. Different approaches were sug-\ngested in [23] and [24], where the moments of the circuit are\nmatched to parameters of probability density functions to yield\nthe delay, but are less accurate than moment matching of a sim-\nilar order. The issue of explicit expressions for calculating the\ndelay from a two-pole waveform is not addressed here, as the\nactivity that dominates runtime for any reasonably sized circuit\nis the generation of the moments. Processing a two-pole wave-\nform for the input of choice (whether step, ramp, or exponen-\ntial) is independent of the circuit, and the complexity is hence\ntrivial in comparison to traversing the circuit and generating\nthe moments.\nIn today’s circuits, as mentioned, considering the effect of\nnoise is important. Finding the response of such systems in-\nvolves solving circuits with multiple drivers and coupling ca-\npacitors, consisting of simple trees coupled to each other via\nseries capacitors, whose circuit model is called a coupled tree\n(Fig. 1). General moment-matching techniques can of course be\napplied to solve coupled trees, but, again, simplified techniques\nare necessary for use early in the design flow. Timing analyzers\noften use the concept of worst, average, and best case delay,\nusing a switch factor that takes the value of 2, 1, or 0 to modify\nthe Elmore delay. The capacitance for a line is modeled as the\nsum of two components, one of which represents the capaci-\ntance to ground, and the other the capacitance to adjacent nets.\nThis second component is multiplied by a factor depending on\nwhether the coupled net is expected to be quiet or not, and if\nnot, on the direction of switching. This method of modeling\nis not accurate except in certain very simple situations, such as\nuniform structures or simultaneously switching nets, and indeed\nit was recently shown to not even represent an upper bound on\nthe delay [25]. A lot of research has focused on certain sim-\nplified configurations of interest. In [26], the authors use the\nfirst moment of the impulse response to generate single-pole\nresponses for uniformly coupled RC lines, while [27] presents\na two-pole response for a single section of a coupled π circuit\nwith arbitrary ramp inputs. They extend it to accommodate mul-\ntiple segmented aggressors in [28], but the allowed topology is\nstill very limited.\nB. Noise Modeling\nNow, as mentioned, it is often necessary to know the cou-\npled noise amplitude explicitly in order to check for spurious\nerrors caused by switching nets disturbing the logic state of\na quiescent net. A single-pole noise metric for coupled trees\nwas proposed in [29]. Although computationally efficient, some\nsimplifying assumptions in the formulation of the metric cause\nthe results to be mostly very pessimistic. Some of the works\nmentioned above, which present models for estimating the ef-\nfect of noise on delay, also report noise metrics [20], [26], [28].\nIn [30], the authors use circuit transformations to simplify a\ngeneral tree to a two-π model when analytic formulas can be\nused, but intermediate steps require the calculation of admit-\ntances at each branch point and the estimation of equivalent ca-\npacitances, which increase runtime and impact on the accuracy,\nrespectively.\nWhen dealing with multiple-driver systems such as the one\ndepicted in Fig. 1, the concept of superposition is very useful,\nas the coupled RC network is still a linear system. The effect\nof multiple aggressors switching at different times can be\nestimated by considering one input at a time with all other in-\nputs grounded, and then adding up the individual waveforms as\nis done in all moment-based methodologies. Tong and Marek-\nSadowska [31] also adopt superposition, where transfer func-\ntions are generated from each driver to the receiver. However,\nthe only concession to different switching events (and hence\ndifferent charging paths) is calculating a unique zero; the poles\nof the transfer function for all switching events are the same,\nand they are the two lowest frequency poles of the system.\nThese poles are estimated from the methodology proposed in\n[32], which gives closed-form expressions for the poles of\nsystems with storage elements, and is a technique that has\nlong been used in analog design to estimate the bandwidth of\namplifiers. However, using the same two lowest frequency poles\nin all of the transfer functions can result in large errors, as the\nsignificant poles, which determine the response for different\nswitching events, can be far apart on the frequency axis. The\nreason is that though these poles are part of the natural response\nof the system, and hence do appear in the transfer function\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1728 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nfrom each driver to the receiver, there will always be partial\npole-zero cancellation in systems that have signal paths with\nwidely differing time constants. Since the transfer function is\nlimited to two poles, it is important that for each path, the two-\npole–one-zero model that best fits that particular charging path\nis calculated. If the same poles are used, the results will be\nskewed by the highest parasitics in the coupled tree, regardless\nof their influence on the particular switching event. For this\nsame reason, [20], which uses the driving point moment to\ncalculate the poles and uses the same poles for all the responses,\nis less accurate than [19].\nThe model that best merits comparison with the proposed\nmodel for both delay and noise estimation is [19], being able to\nhandle coupled RC trees and being the closest in computational\ncomplexity when the moments are generated by the algorithms\nof [14], though still more expensive by virtue of the fact that it\nuses one extra moment. An accuracy comparison against this\nmodel (and others) are carried out in Section IV, while the\ncomplexity is discussed in detail in Section III-D.\nIII. MODELING THE TRANSFER FUNCTION\nConsider Fig. 1, which shows an arbitrary network compris-\ning a victim net and several aggressors coupled to the victim\nnet through banks of series capacitances. Such a network can be\nrepresented by an m-input–one-output system as shown. Ee(t)\nis defined as the voltage waveform at the node of interest e on\nthe victim. The total waveform at e can always be represented\nby the nth-order linear differential (1), where n is the order of\nthe system and ui the inputs\nan\ndn\ndtn\nEe(t) + an−1\ndn−1\ndtn−1\nEe(t) + · · ·+ a1 ddtEe(t) + Ee(t)\n= b1u1(t) + b2u2(t) + · · ·+ bmum(t). (1)\nSetting the right-hand side to zero results in the homogeneous\nequation, the solution to which gives the natural or transient\nresponse of the circuit. For a second-order approximation, the\ncomplementary equation becomes\nλ2s\n2 + λ1s + 1 = 0.\nAssuming that the roots (which are always real and negative\nfor an RC tree) are s = −1\/τ1 and s = −1\/τ2, the complete\nresponse of the circuit is given by the following two time con-\nstant model, where f(t) is the particular solution corresponding\nto the forcing functions\nEe(t) = Ae\n−t\nτ1 + Be\n−t\nτ2 + f(t).\nFor the purpose of analysis, it is possible to assume that f(t)\nor the steady-state value is always zero or one (for normalized\nsupply rails). The coefficients A and B will depend on the\ninputs. In the proposed methodology, linear superposition is\nused where the response for each input is considered with all\nother inputs grounded, and all those responses are summed\nup to generate the complete solution (as in all moment-based\napproaches).\nA coupled RC tree is characterized by a resistive path from\nthe output node e to the forcing (victim—denoted by v) driver,\nand series capacitive elements to other (aggressor—denoted by\na) drivers. Hence, the output for the victim driver switching will\nalways change rails, while it will start and end at the same rail\nfor an aggressor switching. Consequently, the transfer function\ncharacterizing the response in the former case will have a zero\non the negative part of the real axis\nHv(s) =\n1 + sτvz\n(1 + sτv1 ) (1 + sτ\nv\n2 )\n(2)\nwhile that for the latter will have a zero at the origin\nHai(s) =\nsτ aiz\n(1 + sτ ai1 ) (1 + sτ\nai\n2 )\n. (3)\nA. Calculation of Moments\nFig. 1 can be referred to in the following descriptions. First,\nthe notation used is described in some detail below.\nCSpk Capacitance to ground at node k on pth tree.\nCCpqkj Capacitance between node k on pth tree and node j\non qth tree where first sub(super)script refers to ref-\nerence tree.\nEpk Voltage at kth node on pth tree.\nEpqkj Voltage between node k on pth tree and node j on\nqth tree.\nEpqk Voltage between node k on pth tree and correspond-\ning coupled node on qth tree; i.e., second subscript\nis omitted as it is a more convenient notation when\npermissible.\nRpko Shared resistance from source to nodes o and k on\npth tree.\nΥnk nth moment of the impulse response at the kth node.\nIt should be noted that superscripts always refer to trees,\nwhile subscripts always refer to nodes, except in the definition\nfor moments, where the superscript refers to the order of\nthe moment, and in the time constants, where the subscripts\nrefer to an identifier. This distinction is always obvious in\nthe context. Additionally, rail voltages are normalized to zero\nand one, and the expressions are always derived for a positive\nstep without loss of generality. For negative transitions, the\nwaveforms are simply mirrored. The usage of the notation is\nillustrated in Fig. 3. Where it is possible to do so without\nintroducing ambiguity, the second subscript will be dropped\nfor convenience. For example, if tree 1 is the reference tree in\nFig. 3, CdE12k \/dt refers to i(t), and node j is implicit in the\nexpression.\nFinally, the following quantity is defined\nτ trtiDe =\n∑\nk∈tr\nRtrkeC\ntrti\nk . (4)\nThis is the summation over the reference tree tr, of resistance-\ncapacitance products at each node k, where Rke is the shared\nresistance between node k and sink e, on the path from source\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1729\nFig. 3. Illustration of usage of notation.\nto sink. The capacitance term Ctrtik is the capacitance between\ntrees tr and ti at node k on tr. For example with reference\nto Fig. 1, Cvb1 is CC1. If the second tree ti is omitted,\nthe capacitance refers to the total capacitance at node k; for\nexample, Cv1 is (CS1 + CC1 + CC2). In that case, the second\ntree would also be omitted in the name, i.e., Ctrk would be\nwith respect to τ trDe. This notation is used because it makes\nfor a compact description, and also to make it consistent with\nthat adopted in the famous Penfield–Rubinstein metrics [11],\nand in [4], which describes second-order models for simple\ntrees. The lowercase subscript in τDe , which is e in this case,\nalways refers to the output. If the output node is omitted, the\nonly quantity, which is with respect to the output Rke, be-\ncomes Rkk.\nThe derivation of the following expressions is given in\nAppendix I. The first moment of the impulse response at the\noutput node e for the victim driver switching, while all other\ninputs are grounded, is given by the following expression,\nwhere a1, a2, . . . are the aggressors\nΥ1e,v =\n∑\nk∈v\nRvke [CS\nv\nk + CC\nva1\nk + CC\nva2\nk + · · ·] = τvDe say.\n(5)\nThe second moment is given by\nΥ2e,v\n= 2\n∑\nk∈v\nRvke\n{\nCSvkτ\nv\nDk\n+ CCva1k\n[\nτvDk +\n∑\nK∈a1\nRa1KjCC\na1v\nK\n]\n+ CCva2k\n[\nτvDk +\n∑\nK∈a2\nRa2KjCC\na2v\nK\n]\n+ · · ·\n}\n= 2\n(\nτvGe\n)2\nsay. (6)\nThe first moment of the impulse response at node e on the\nvictim tree for aggressor ai switching can be shown to be\nΥ1e,ai = −\n∑\nk∈v\nRvkeCC\nvai\nk = −τaiDe say. (7)\nThe second moment is\nΥ2e,ai\n= −2\n∑\nk∈v\nRvke\n×\n{\n(CSvk + CC\nva1\nk + CC\nva2\nk + · · ·) τaiDk + CCvaik\n×\n[∑\nK∈ai\nRaiKj\n(\nCSaiK + CC\naiv\nK + CC\naib1\nK + · · ·\n)]}\n= −2 (τaiGe)2 say. (8)\nThe expressions in (5)–(8) form the basis of the proposed\nmodels, along with the sum of the open-circuit time constants,\nintroduced later in (21).\nB. Matching Moments to the Characteristic\nTime Constants in the Circuit\nNow, generating the best two-pole–one-zero transfer func-\ntion for the response at the output node for any given switch-\ning event is of interest here. The moments can be matched\nto the characteristic time constants in the circuit by consid-\nering the power series expansion of ex in the definition of\nthe Laplace transform. The Laplace transform of the impulse\nresponse is\nH(s) =\n∞∫\n0\nh(t)e−stdt\n=\n∞∫\n0\nh(t)\n[\n1− st + s\n2\n2!\nt2 − · · ·\n]\ndt\n=\n∞∫\n0\nh(t)dt− s\n∞∫\n0\nth(t)dt +\ns2\n2\n∞∫\n0\nt2h(t)dt− · · · .\nFrom this equality, the following identity can be observed\nΥn = (−1)n d\nn\ndsn\nH(s)\n∣∣∣∣\ns=0\n. (9)\nThis equation can be used to match the moments to the poles\nand zeroes of the circuit directly. Using (2), (5), (6), and (9), it\ncan be seen that\nτv1 + τ\nv\n2 − τvz = τvDe (10)\n(τv1 + τ\nv\n2 − τvz ) (τv1 + τv2 )− τv1 τv2 =\n(\nτvGe\n)2\n. (11)\nNow, additional information is necessary to solve for the\nthree unknowns in (10) and (11). If a third equation is assumed\nfor the reciprocal pole sum\nτv1 + τ\nv\n2 = τsum. (12)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1730 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nThese three equations can be combined to form the following\nquadratic, which yields two time constants\nτ2 − τsumτ + τvDeτsum −\n(\nτvGe\n)2 = 0. (13)\nOther than τsum, the other metrics in (13), the first and second\nmoment, are with reference to the victim. At this point, it is\nhelpful to look at the physical interpretation of the first and\nsecond moments of the impulse response. The first moment\nalways considers resistances of the switching line, and either\nall capacitances connected to the switching line (in the case of\nthe victim driver switching) or capacitances connecting it to a\nparticular line (for the switching of an aggressor driver). The\nsecond moment propagates outwards another level and consid-\ners the resistances and capacitances of immediately adjacent\nlines as well. This intuition is valuable in generating a solution\nwith minimum computational complexity; namely, (13) can be\nused to generate the pole time constants for all switching events\nby using the appropriate reciprocal pole sum.\nNow, since (13) can in general yield complex poles or a posi-\ntive pole, some care is necessary to ensure stability. Potential\ninstability can take one of two forms: If the sign under the\nradical in the solution for the roots of (13) is negative, complex\npoles can result; if the magnitude of the square root is greater\nthan the reciprocal pole sum, a negative time constant results.\nUsing these as limiting conditions, a methodology that always\nyields stable and accurate results can be formulated. The time\nconstants are\nτ1,2 = τsum ±\n√\nτ2sum − 4\n[\nτsumτvDe −\n(\nτvGe\n)2]\n. (14)\nOne limiting condition is that the sign under the radical should\nbe positive. This leads to\nτ2sum + 4\n[(\nτvGe\n)2 − τsumτvDe] > 0. (15)\nThis inequality is satisfied if\n(\nτvGe\n)2\n> τsumτ\nv\nDe\n. (16)\nHowever, this would violate the second condition, which is that\nthe magnitude of the square root should be greater than the\nreciprocal pole sum\nτsum >\n√\nτsum − 4\n[\nτsumτvDe −\n(\nτvGe\n)2]\n. (17)\nIf (16) is true, (17) will never be true. Hence, the stability\ncondition has to be more stringent. It can be guaranteed that\n(17) is true if the following holds\n(\nτvGe\n)2\n< τsumτ\nv\nDe\nor\nτsum >\n(\nτvGe\n)2\nτvDe\n. (A)\nFig. 4. Variation of quadratic which determines stability with τsum.\nThat is to say, the reciprocal pole sum must be large enough.\nHowever, when (A) is fulfilled, the second term in (15) is neg-\native. Rewriting the left-hand side of it gives\nLHS = τ2sum − 4τvDeτsum + 4\n(\nτvGe\n)2\n. (18)\nThe function designated LHS is called the stability function,\nand is a quadratic in τsum. By considering the first and second\nderivatives, this parabola can be shown to have a minimum at\n2τvDe . The zero-crossing points are given by\nτsum = 2\n[\nτvDe ±\n√(\nτvDe\n)2 − (τvGe)2\n]\n. (19)\nObviously, both of these points are on the right-hand side of\nthe vertical axis, hence the shape of the parabola (Fig. 4). Now,\nif the sign under the radical in (19) is negative, its roots are\ncomplex, or in other words LHS will never become negative\nand (15) is always true. Hence, for potential instability to occur,\nthe following must always be true(\nτvDe\n)2\n>\n(\nτvGe\n)2\n. (20)\nAs proven in Appendix II, the line corresponding to the equality\nof (A) should appear to the left of the first zero-crossing as\nshown. Then for stability, τsum has to appear in the lightly\nhatched area, or to the right of the second zero-crossing point.\nIf τsum is too small, the sign under the radical is positive, but\na negative time constant results. If τsum is situated between\nthe zero-crossing points, complex poles are derived. Finally,\nif τsum is to the right of the second zero-crossing point, rep-\nresented by the darkly hatched area, again, a stable solution\nresults. Hence, from the zero-crossing points, the next condition\nis derived\nτsum < 2\n[\nτvDe −\n√(\nτvDe\n)2 − (τvGe)2\n]\nor\nτsum > 2\n[\nτvDe +\n√(\nτvDe\n)2 − (τvGe)2\n]\n. (B)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1731\nNow, the stability conditions have been identified, the values\nfor τsum that give the best response for different switching\nevents can be derived. Firstly, for the case of the victim driver\nswitching, since all aggressors are grounded, the metric that\ngives the best solution is the sum of the open circuit time\nconstants with reference to the victim driver, which is called τ ∗p .\nThis is simply the summation of the products of all capacitors\nconnected to the victim line with the driving point resistance to\neach of those capacitors\nτ ∗p = −\n∑\nk∈v\n[\nRvkkCS\nv\nk +\n(\nRvkk + R\na1\njj\n)\nCCva1k\n+\n(\nRvkk + R\na2\njj\n)\nCCva2k + · · ·\n]\n. (21)\nThis is a good approximation for the sum of the pole time\nconstants [32], giving\nτv1 + τ\nv\n2 = τ\n∗\np . (22)\nSubstituting (22) for τsum in (10) and (13) results in the zero\ntime constant and pole time constants respectively, for the\nvictim switching. Now, an inspection of (5) and (21) shows that\nτ ∗p > τ\nv\nDe\n. Since (20) has to be true for instability to occur, this\nmeans that\nτ ∗p >\n(\nτvGe\n)2\nτvDe\n. (23)\nTherefore, (A) is always true, and the only possible stability\nviolation in this case is (B); i.e., very occasionally, using τ ∗p can\nresult in complex poles. The physical interpretation of such an\noccurrence is that the sum of the open circuit time constants\nunderestimates the reciprocal pole sum, which has been unusu-\nally escalated by an aggressor or aggressors with exception-\nally high parasitics. Because both exponential waveforms are\neither additive or subtractive unlike when an aggressor switches\n(where one is additive and the other is subtractive), the higher\nfrequency pole does not have a significant impact. In fact,\nthis form of instability is usually an indication of a very-low-\nfrequency pole, which makes the prediction of the waveform\nstraightforward. The simplest remedy therefore is to consider\na single pole response, with the pole time constant being\ngiven by τvDe. This results in good accuracy as shall be shown\nin the Section IV.\nSecondly, to solve for the poles and zeros associated with\nan aggressor switching, (3), (7), (8), and (9) are combined\nto give\nτ aiDe = τ\nai\nz (24)(\nτ aiGe\n)2 = τ aiz (τ ai1 + τ ai2 ) . (25)\nNow, the zero time constant is available immediately from\n(24), and dividing (25) by (24) results in the reciprocal\npole sum\n(\nτaiGe\n)2\nτaiDe\n= τai1 + τ\nai\n2 . (26)\nThe pole time constants can be obtained by substituting (26) as\nτsum in (13). It can be seen from an inspection of the relevant\nexpressions that potentially either of (A) or (B) can be violated.\nThe solution without generating extra information about the\ncircuit is to accept the next best approximation. That is to say,\nif τsum is so small that it violates inequality (A), the simplest\nand most logical remedy is to increase τsum so that it is in the\nlightly hatched area. When inequality (B) is violated, if τsum\nis less than the minima, it should be decreased so that it falls\ninto the lightly hatched region; if it is greater than the minima,\nit should be increased so that it falls into the darkly hatched\nregion. Since the equality will generate coincident poles that\nare not acceptable, the exact value should be chosen so that\nit is slightly greater than or less than the equality, which can\nbe achieved with a percentage factor. From empirical evidence\nover a range of testbeds, it was seen that 1% provides the best\naccuracy. This is the only constant that cannot be predicted by\nthe theory, and is unfortunately unavoidable, as any approach\nto preserve stability without resorting to higher order moments\nhas to be approximate in nature.\nUsing this approach, the values that τsum should take in the\ndifferent cases are summarized in Table I. Of the two, (A)\nbeing violated is by far the more common form of instability.\nThis occurs when the dominant poles for the victim and the\nparticular aggressor are very far apart on the frequency axis.\nPhysically, this translates to a situation where the receiver node\nis charged extremely rapidly by a very strong aggressor (i.e.,\nthrough a relatively very small time constant), and decays with\na very long tail, dictated by the much larger time constant of\nthe victim. Such behavior is common for far end coupling. The\ninstability in the solution predicted by (13) occurs because the\npole sum given by (26) accurately reflects the high-frequency\nnature of the poles in the aggressor’s charging path, but τvDe and\n(τvGe)\n2 reflect the much lower frequency content of the victim’s\ndominant poles, and the gap is too much to bridge. The remedy\nproposed to this situation is to increase the reciprocal pole\nsum just beyond the threshold of the equality. Now, this yields\naccurate results, because the intention is to generate the best\ntwo-pole–one-zero model; in other words, the poles and zeros\nneed not equate to the actual poles and zeros of the system, and\nindeed should differ for a second-order approximation. Using\nthe factor of 1% beyond the threshold, which yields coincident\npoles, ensures that both the high- and low-frequency behavior is\nmatched. It must be emphasized that conditions (A) and (B) are\nviolated infrequently, and when they do, the values proposed\nabove result in a simple yet accurate solution, which requires\nno extra information. The expressions for the reciprocal pole\nsum in body rows three to five of Table I represent the best\napproximations that guarantee stability when the first-choice\napproximations in rows one and two prove to be incompatible\nwith the quadratic (13).\nC. Physical Basis of the Model\nComputing the first and second moments of the impulse\nresponse of the circuit, and using them to generate a transfer\nfunction with two poles and one zero, results in the matching of\nthe boundary conditions at time zero and infinity, and geometric\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1732 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nTABLE I\nVALUES THAT τsum SHOULD TAKE\nproperties—namely the area and first moment—of the actual\nwaveform (step response) with the estimated waveform. The\nboundary conditions are already considered in the particular\nformulation of the transfer function (i.e., that the waveform\nstarts and ends on a specific rail). Hence, matching the first\nand second moment of the impulse response does not define\na unique solution, as a two-pole–one-zero transfer function\nhas three unknowns. The necessary third equation is obtained\nby matching circuit components to the reciprocal pole sum.\nFor the switching of the victim driver with the other inputs\ngrounded, the sum of the open circuit time constants provides a\ngood approximation to the reciprocal pole sum, and combin-\ning it with the moments of the circuit for the victim driver\nswitching has a straightforward intuitive motivation. For the\nswitching of an aggressor driver, the geometric properties of\nthe actual waveform (via the first and second moments of the\nimpulse response for an aggressor driver switching) are used\nto obtain the precise reciprocal pole sum. Since the quadratic\n(13) obtained from the moments of the impulse response for\nthe victim driver switching contains relevant information about\nthe victim net, combining it with the reciprocal pole sum for\nan aggressor switching gives a good approximation to the best\ntwo-pole–one-zero model. This is a procedure that works for\nthe vast majority of circuits; however, some adjustments are\nnecessary to the reciprocal pole sum for certain pathological\ncases, which was analyzed in a systematic manner, resulting\nin Table I.\nD. Computational Complexity\n1) Background—Incremental Computation of the Elmore\nDelay: The Elmore delay, as mentioned before, has been and\nis used extensively as a delay metric in VLSI interconnection\ncircuits modeled by a tree where all capacitors are grounded,\nwhich is termed a simple tree. Simple trees are characterized\nby nodes that may have multiple children but only one parent.\nThe Elmore delay is defined as\nτDe =\n∑\nk∈ tree\nRkeCk.\nConsider the simple tree given in Fig. 2, where the output\nnode is designated as e. According to the definition, the Elmore\ndelay is\nτDe = R1C1 + (R1 + R2)C2 + (R1 + R2 + R3)C3\n+(R1 + R2)C4 + (R1 + R2)C5. (27)\nThis can be rearranged so that the expression is in terms of the\nproduct of the downstream capacitance and resistance at each\nnode on the path from the source to the sink\nτDe = R1(C1 + C2 + C3 + C4 + C5)\n+R2(C2 + C3 + C4 + C5) + R3(C3). (28)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1733\nAll downstream capacitances can be stored at each node\nby traversing the tree once. Hence, after one traversal of the\ncomplete tree, the computation of the Elmore delay at any\nnode requires only that the path from source to sink for that\nparticular instance be traversed, with the product of the resis-\ntance and downstream capacitance at each node being summed\nup. Because of this property, any changes to the capacitance\nvalues at any node in the tree require only that those changes\nbe propagated upstream of those nodes where the changes took\nplace. This is known as incremental computation, as only those\ncached values that are stale need to be updated. Any change\nto a resistance need only be considered when the metric with\nrespect to a particular node is required, and the path from the\nroot to that node is traversed. Incremental computation bestows\nconsiderable savings, and it is one of the principal reasons for\nthe popularity of the Elmore delay.\n2) Computational Complexity of Proposed Metrics: Alto-\ngether, five metrics that depend on the circuit topology are\nrequired for the proposed models. The first-order metrics are\n(5), (7), and (21), and the second-order metrics are (6) and (8).\nFirst-order metrics: An inspection of the first-order met-\nrics (5) and (7) clearly shows their similarity to the Elmore\ndelay. These can be rearranged so that the expressions are\nformulated as the sum of the products of resistance and down-\nstream capacitance at each node on the path from source to sink.\nBecause of the extra complexity introduced by the coupling\ncapacitances, it is necessary to keep track of individual coupling\ncapacitances at each node. This can be achieved by caching\nthe sum of the downstream self (or total) capacitances, and\nthe sum of the individual downstream coupling capacitances\nwith associated root information at each node. Hence, similar\nto the Elmore delay, all downstream capacitances are cached\nfrom a full tree traversal, and then the output with respect to a\nparticular node e only requires a traversal from the source to e.\nAlso similar to the Elmore delay, any changes to the tree require\nonly that the capacitance changes be propagated to the upstream\nnodes, resulting in incremental computation being possible.\nThe final first-order metric (21), the sum of the open circuit\ntime constants, requires that at each node in the summation, that\nnode should be treated as the output. Since the output node is\ntherefore always defined for a given victim net (unlike in the\nprevious metrics where the output can be any node in the tree),\nthe incremental components of the summation in τ ∗p can be\ncached along with the downstream capacitance. For example, in\nFig. 1, node 4 should have CS5 as downstream self capacitance,\nand R5 · CS5 as downstream τ ∗p information. Therefore, this\nmetric requires no extra traversals at all, but instead, it can\nbe computed along with the downstream capacitances. Again,\nchanges to the tree require only that the changes be propagated\nto upstream nodes.\nSecond-order metrics: The second-order metrics require\nthe capacitances at each node be weighted individually by a\nfirst-order time constant, which is basically expression (4) (in\none of the three forms used) for the path defined from the root\nof the relevant simple tree to the current node, or its coupled\ncounterpart. There are now three issues related to complexity:\n1) How much work is needed to calculate the weights for the\noriginal tree?\n2) When the weights are known, how much work needs to\nbe done to calculate the second-order metrics with respect\nto a particular node?\n3) Finally, how much work needs to be done to recalculate\nall the weights once a change or changes have been made\nto the tree?\nCalculation of the weights is demonstrated on the victim net\nof Fig. 1. The weights required are different for the two ex-\npressions, and also for the types of capacitances (i.e., coupling\ncapacitance between two trees, or the total capacitance, at a\nparticular node), but are always characterized in a generic sense\nby the expression (4). Hence, any technique that works for\none will always work for all the weights. For the sake of\nexplanation, assume that the weight consists of τvDk , where only\nself capacitances are considered, and that the weights at nodes\n1 and 2 are τ1 and τ2, etc. Then\nτ1 = R1(CS1 + CS2 + CS3 + CS4 + CS5) (29)\nand\nτ2 = R1(CS1 + CS2 + CS3 + CS4 + CS5)\n+R2(CS2 + CS3 + CS4 + CS5). (30)\nThe rest of the metrics are calculated in a similar manner.\nNow, since the weight is always with respect to the root, it\nis necessary to visit all the nodes once after the downstream\ncapacitance information has been stored on the initial pass. (It\nis useful also to store the upstream resistance at each node on\nthis pass, so that in future visits to the node, the τ information\ncan be updated instantly, as will be shown later.) All weights\ncan be calculated in one pass by using the property that\nτvDn = τ\nv\nDm\n+ τvDm→n (31)\nwhere node m is situated on the path between the root and node\nn. At branch points, a depth first traversal of all child branches\npreserves the linearity of the traversal. Hence, the weights for\nall nodes can be calculated by one full tree traversal once the\ndownstream capacitance information has been stored.\nThe answer to the second question is straightforward; an\ninspection of (6) and (8) shows that the form that the outer\n(second order) summation takes is exactly similar to the inner\n(first order) summation, which is characterized in a generic\nway by the expression (4). Therefore, it is possible to cache\nthe downstream τ · C information (just as the downstream C\ninformation was cached for the first-order metrics) and obtain\nthe metrics from the root to a particular node by visiting only\nthe nodes along the path from the root to that node.\nSo far, two complete traversals have been necessary, one\nbottom-up pass to store the downstream capacitance informa-\ntion, and one top-down pass, beginning at the root to store the\nτ information (and the upstream resistance information, which\nis necessary, later, to minimize computation when changes are\nmade). Now, to calculate the second-order metric to any node,\nrearranging the terms in the summation exactly as in the first-\norder calculation allows the downstream τ · C to be cached in\none full traversal. Subsequently, the second-order metric to any\nnode can be calculated simply by visiting all the nodes on the\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1734 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\npath from the root to that node. Again, if an imaginary second-\norder metric is defined to consist only of the self capacitances\nfor simplicity of explanation, the value that would be cached at\nnode 5 on the third (bottom-up) traversal would be T5 = T5 ·\nCS5, that at node 4 would be T4 = T5 + τ4 · CS4, and so on.\nHence, three full traversals are necessary, one bottom-up\ntraversal to store the downstream capacitance information, one\ntop-down traversal to store the weights, and a final bottom-up\ntraversal to store the downstream τ · C information. None of\nthese passes can be combined as the necessary order is bottom-\nup, top-down, and bottom-up.\nThe only remaining question is also the most important;\nif it is necessary to traverse the entire tree three times each\ntime a change is made, the incremental computation property\nis lost. However, after a modification to a component, since\nonly the resulting changes in the stored values need to be\naccounted for, the calculations that required three traversals for\nthe original tree can be accomplished in one traversal. Consider,\nfor example, that the component value CS2 is changed to CS ′2.\nThis immediately causes:\n1) the downstream capacitance values cached at node 2 and\nall nodes upstream of node 2 to be stale;\n2) the cached weight (τ) information at all nodes to be stale;\n3) the cached downstream τ · C information at all nodes to\nbe stale.\nIn node 5, for example, the stored downstream capacitance\nis current (since the changed capacitor is upstream of it), but\nthe weight and downstream τ · C information is stale. The old\nweight is\nτ5 =R1(CS1 + CS2 + CS3 + CS4 + CS5)\n+ R2(CS2 + CS3 + CS4 + CS5)\n+ R4(CS4 + CS5) + R5(CS5). (32)\nThe new weight is\nτ ′5 =R1 (CS1 + CS\n′\n2 + CS3 + CS4 + CS5)\n+ R2 (CS ′2 + CS3 + CS4 + CS5)\n+ R4(CS4 + CS5) + R5(CS5). (33)\nThe change is\nτ ′5 − τ5 = (R1 + R2) (CS ′2 − CS2) . (34)\nTherefore\nτ ′5 = τ5 + (R1 + R2) (CS\n′\n2 − CS2) . (35)\nThis is simply the change in the capacitance multiplied by\nthe resistance that is upstream of the changed capacitance.\nThis is true of all nodes downstream of node 2. At the nodes\nupstream of node 2, the capacitance change is multiplied by the\nupstream resistance from that node. Similarly, the downstream\nτ · C information can also be calculated and stored. Hence, all\nstale information can be updated by doing a single bottom-\nup traversal by considering the difference introduced by the\nchange to the component. First, the changed component is\nlocated, and its upstream resistance (R1 + R2), which has\nbeen stored earlier, is noted. Now, starting from a leaf node,\nsay node 5, for example, a bottom-up traversal is initiated,\nwhere both the weight information and the downstream τ · C\ninformation are updated at once. From node 2 upwards, the\ndownstream capacitance also needs to be updated. Hence, the\noriginal requirement of three passes for the unprocessed tree\nhas been reduced to a single pass. This principal also applies\nfor resistor changes, and also multiple component changes.\nThat is, the effect of multiple changes can be considered\nin one pass.\nSummary: It was shown that all the metrics have a very\nsimple and small core, which exactly resembles the Elmore de-\nlay. The second-order expressions can be described as a weight-\ned Elmore delay; each term in the summation is weighted by\neither (5) or (7) for that particular node. These are similar to\nthe second moment of the impulse response proposed for sim-\nple trees in [4]. Just as the models of [4] represent the minimum\ncomputational complexity for second-order models for the class\nof circuits that were called simple trees, these models represent\nthe minimum complexity for coupled trees. In fact, if the cou-\npling capacitance terms are put to zero (the entire capacitance\nis lumped into a ground component), the model for the victim\ntree reverts to the model proposed in [4].\nOne of the major attractions of the Elmore delay is its in-\ncremental computational property. This is a very useful feature,\nand is the mainstay of several interconnect optimization algo-\nrithms. It should be noted that this is independent of the output\nnode. Whatever node is chosen as e in the tree, this hierarchical\nproperty holds true. Now, since the constituent summations in\nthe proposed metrics have exactly the same form as the Elmore\ndelay, whose format is basically that of (4), incremental com-\nputation is possible for the proposed metrics.\n3) Comparison With Other Metrics: As shown in Section II,\nthere are an enormous number of models both of a general\nnature that are not restricted to second-order estimations, and\nones that are explicitly second-order. In this section, it is shown\nthat the proposed model has the least complexity of all two-\npole–one-zero models in both categories. It is useful to start the\ndiscussion with a look at the general techniques AWE [13] and\nRICE [14].\nThe latter is basically an efficient implementation of the\nformer, and both require 2q moments to generate a qth-order\napproximation. The computation of the moments in [14] is\nnot less efficient than the computation outlined above. The so-\ncalled path-tracing algorithm (with recursive solutions of a dc\ncircuit) presented there can be used to compute the first and\nsecond moment with exactly the same efficiency, including\ncaching of values at nodes, though not explicitly articulated\nin the same manner. The point is, [14] requires four moments\nto generate a second-order response, and each higher order\nmoment requires a computation that involves a backward and\nforward substitution of the system matrix, which is equivalent\nto two tree traversals. Hence, the proposed model saves at\nleast four tree traversals in the processing of the initial tree,\nby not requiring the third and fourth moment of the impulse\nresponse. Each time the circuit is changed, as would be done\ninnumerable times in incremental physical optimization, the\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1735\ncomputation of the higher order moments that require four\nextra traversals is avoided. For component value changes, the\ngeneral property of incremental computation would hold, but\nit would necessarily be more expensive for four moments. The\nfirst moment (Elmore delay) requires component values to be\npropagated upstream only; the second moment requires one full\ntree traversal as has been shown; similarly, the third and fourth\nmoments would require two and three traversals. Therefore, the\nproposed model saves two full tree traversals for component\nvalue modifications.\nAs mentioned earlier, the model that best merits comparison\nwith the proposed model is [19], the other second-order models\neither being restricted in topology (such as [4]—simple trees;\n[17], [18], and [22]—inductive trees with no series capacitors;\n[26], [27]—parallel lines), restricted in accuracy (such as\n[20] and [31], which use the same poles for all responses), or\nlacking a clear physical basis (such as [23] and [24]), which do\nnot translate to a two-pole–one-zero model, and hence cannot\nbe used to generated the responses for aggressors switching,\nand are less accurate than direct moment matching for the vic-\ntim switching. When the moments are computed with the algo-\nrithms of [14], the explicit two-pole–one-zero model of [19] is\nthe least expensive second-order model that can handle arbi-\ntrarily coupled RC trees reported in the literature. Because the\nproposed model does not require the third moment of the\nimpulse response, it is cheaper than this model by the equivalent\nof at least two full tree traversals for the unprocessed tree, and\nat least one full tree traversal for component value changes. Be-\ncause incremental physical optimization requires many changes\nto the interconnection tree, the proposed model will often save\ntwo complete tree traversals, a huge saving for any reasonably\nsized circuit. The comparison carried out in Section IV shows\nthat this saving is not at the expense of loss in accuracy.\nFinally, it is worth looking at the complexity of circuit\ncollapsing techniques such as passive PRIMA [16], as they\nonly require q moments to generate a qth-order response. In\nPRIMA, the most critical steps in terms of runtime are an\nLU decomposition and qN backward and forward substitu-\ntions for an N -port circuit, which corresponds to a qth-order\nresponse, both of which must be performed on the modified\nnodal analysis (MNA) matrix of the original network. The\nLU factorization already makes the complexity at least as\nmuch as the three complete traversals required for the un-\nprocessed tree in the proposed methodology. The most ef-\nficient manner in which the second can be accomplished is\nby recursively solving an equivalent DC circuit as in [13].\nHence, the computation of each block moment requires at\nthe minimum one backward and forward substitution, which\nis equivalent to two tree traversals. Furthermore, there is an\noverhead introduced by the orthogonalization and orthonormal-\nization procedures, which makes the complexity of a block\nmoment computation more than the equivalent of two tree\ntraversals. This is neglecting the overhead of setting up the\nMNA matrix, which has to follow the setting up of the spanning\ntree (unless the netlist is already appropriately ordered, which\nis not the general case). Hence, the complexity of a second-\norder Krylov space projection-based approximation does not\nreally bear comparison to the proposed methodology. Such\nnetwork collapsing methods are suitable for macromodeling\nlinear blocks by higher order approximations, not for incremen-\ntal physical optimization.\nE. Peak Noise and Delay to Peak Noise\nIn this paper, the generation of the transfer function, which is\nthe most important aspect of the modeling, is the main concern.\nChoice of input waveform, driver modeling, and subsequent\nprocessing of the waveform depend on the application, and are\nnot covered for the most part. Knowing the transfer function\nallows the output to be generated for the appropriate input by\na number of approaches, including table look-up and heuristic\nexpressions. Explicit expressions are, however, derived for step\ninputs, which are sufficiently accurate for quite a number of\napplications. First, the step response at node e when the victim\ndriver switches is given by\nEve (t) = 1−\nτv1 − τvz\nτv1 − τv2\ne\n− t\nτv\n1 − τ\nv\nz − τv2\nτv1 − τv2\ne\n− t\nτv\n2 . (36)\nThe step response when an aggressor driver switches is\nEaie (t) =\nτaiz\nτai1 − τai2\n(\ne\n− t\nτ\nai\n1 − e−\nt\nτ\nai\n2\n)\n. (37)\nIt is not possible to solve a two-pole (or higher order) wave-\nform explicitly for the delay at a given threshold. Closed-form\nheuristics for a two-pole waveform can be derived—such as in\n[19]—but since the complete response for an m driver system\nwill consist of 2m exponential waveforms, some iterative pro-\ncedure needs to be adopted in the general case.\nHowever, (37) can be solved explicitly for the peak noise, and\nthe time at which it occurs. Equating the first time derivative to\nzero and doing some trivial algebra results in\ntpk =\nτai1 τ\nai\n2\n(τai1 − τai2 )\nln\nτai1\nτai2\n. (38)\nSubstituting (38) for t in (37) results in the peak noise from the\nswitching of the driver of aggressor ai. Knowing the times at\nwhich the individual peaks occur is extremely useful in algo-\nrithms to process the waveform for delays at a given threshold,\nwhen multiple drivers switch at different times. A temporal\nwindow can be defined, which is bounded by the first peak and\nlast peak; these peak values can be used as initial guesses for\nfast and true convergence with the Newton–Raphson algorithm,\neven for multiple-time constant waveforms.\nIV. RESULTS\nThe proposed metrics were implement in a tool called\nDeANo (for Delay And Noise Modeler), and tested on many\ntest beds that cover a wide range of topologies, by comparing\nthe step response against a circuit simulator, Spice, and other\nmoment-based models. Some plots for instructive testbeds\nare shown in [3] including networks consisting of primary\nand secondary aggressors where inequalities (A) and (B) are\nviolated. Comparisons are carried out against moment-based\ntechniques such as the two-pole–one-zero model from three\nmoments described in [19], the gamma and hgamma probability\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1736 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nTABLE II\nAVERAGE PERCENTAGE ERRORS IN DELAYS AT DIFFERENT\nTHRESHOLDS FOR VICTIM SWITCHING\ndistribution models from three moments described in [33] and\n[24], and the gamma probability distribution model from two\nmoments, also described in [33]. It should be noted that the\nprobability distribution models are valid only for the victim\nswitching. Here, the model is extensively tested against the\nElmore delay, the closest less expensive model, and the two-\npole–one-zero model from three moments, the closest more\nexpensive model, in thousands of comparisons with the re-\nsponse from a Spice3 simulation serving as the yardstick of\nthe actual waveform. Since the actual and predicted delay\nat a single threshold can agree very well, and still result in\nsignificant deviations along the full waveform, the accuracy\nwas tested at three points along the waveform. For the victim\nswitching, the thresholds are 10%, 50%, and 90%, while for the\naggressors they are 25%, 100%, and 25% of the peak amplitude.\nThis is to ensure that three points, with two being on either\nside of the peak, are tested. The average results are shown in\nTables II and III. The numbers shown in each case is the error\ncalculated as a percentage against the actual value as given by\nSpice; a negative number means that the predicted value was\ngreater than the actual and vice versa. Hence, the smaller the\nmagnitude of the number, the better; a value of zero means\nzero error. These numbers do not have much significance as\nindicators of absolute error, but are very useful for comparisons\nbetween models.\nDifferent kinds of circuits were grouped into the four cluster\ncategories. The test nodes comprise all nodes in each circuit\nin each case, covering all possible circumstances such as near-\nend and far-end coupling and stiff nodes. It can be seen that the\nproposed model performs very well against the more expensive\nmodel computed from three moments, and is in fact often better\nin the delay predictions. The only area in which it is consistently\noutperformed by the three moment model is in peak noise\nTABLE III\nAVERAGE PERCENTAGE ERRORS IN DELAYS AT DIFFERENT THRESHOLDS\nAND AVERAGE ERROR IN PEAK NOISE FOR AGGRESSOR SWITCHING\nprediction, to varying degrees. However, as the point of the\nproposed model is to use as a metric of comparison between\ndifferent topologies, this need not be any kind of limitation in\nits intended applications of incremental physical optimization\nand global signal planning.\nV. SUMMARY AND CONCLUSION\nClosed-form expressions for the first two moments of the\nimpulse response for general arbitrarily coupled RC trees with\nmultiple drivers were presented and used to generate stable and\naccurate second-order approximations to the transfer function\nfor any switching event. For the victim driver switching, the\nsum of the open-circuit time constants with regard to the victim\nnet is used to avoid using higher order moments. For the case\nof an aggressor driver switching, the moments for the victim\nand aggressor switching are combined, which can be described\nas an averaging of the dominant poles along the victim and\nthat aggressor. This procedure provides the best opportunity\nto match the waveform along the charging and discharging\npaths while saving on higher order moments. The summation\nof all waveforms result in the complete response at the node\nof interest. This model represents the minimum complexity for\na general second-order model for this class of circuits, and is\nhence proposed as being useful for initial estimates of delay\nand noise in complex systems early in the design flow, and\nparticularly for incremental physical optimization.\nThe point of doing early signal integrity analyses is that\nwhere problems are identified, some change in the circuit graph\nis required. As has been shown in Section III-D-3, the model\nproposed here saves at a minimum, the equivalent of two com-\nplete traversals for the unprocessed (i.e., structurally changed)\ntree, and one full traversal at the minimum for component value\nchanges in the tree. Since tree changes will occur very often\nin physical optimization, this is a big saving in computational\ncomplexity over other published models. By running extensive\ntests, it was shown that this saving in computational com-\nplexity was achieved without compromising on accuracy, the\nproposed model having comparable or better accuracy than\nmore expensive models.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1737\nAPPENDIX I\nCOMPUTATION OF MOMENTS\nWhen the victim driver switches while all other inputs are\ngrounded, the first moment of the impulse response at the\noutput node e is given by\nΥ1e =\n∞∫\n0\nthve(t)dt. (39)\nNow, the following expression describes the voltage drop\nfrom the source to e where Eve (t) is the step response at e,\nand a1, a2, . . . are the aggressors. This is obtained by sum-\nming up the capacitor currents and adding the drops across\neach resistor, or in other words, using Kirchoff’s voltage and\ncurrent laws\n1− Eve (t) =\n∑\nk∈v\nRvke\n[\nCSvk\ndEvk\ndt\n+ CCva1k\ndEva1k\ndt\n+CCva2k\ndEva2k\ndt\n+ · · ·\n]\n. (40)\nThe impulse response hve(t) is the first time derivative of the\nstep response. Hence, (39) can be integrated by parts, and (40)\nsubstituted in it to yield the following expression\nΥ1e =\n∑\nk∈v\nRvke [CS\nv\nk + CC\nva1\nk + CC\nva2\nk + · · ·] = τvDe say.\n(41)\nThe second moment of the impulse response at the output\nnode e is given by\nΥ2e =\n∞∫\n0\nt2hve(t)dt.\nIntegrating by parts, it can be shown that this is equivalent to\nΥ2e = 2\n∞∫\n0\nt (1− Eve (t)) dt.\nUsing the above expression for the step response and again\nintegrating by parts, this can be shown to be\nΥ2e = 2\n∑\nk∈v\nRvke\n\nCSvk\n1∫\n0\ntdEvk + CC\nva1\nk\n1∫\n0\ntdEva1k\n+CCva2k\n1∫\n0\ntdEva2k + · · ·\n\n. (42)\nThe constituent integrals can be evaluated by integrating\nby parts and using Kirchoff’s laws to obtain expressions for\nthe voltages. The first integral is basically the first moment at\nnode k, for which an expression can be obtained by simply\nsubstituting k for e in (41). The other integrals are of the form\nIai =\n1∫\n0\ntdEvaik .\nIntegrating by parts, this simplifies to\nIai =\n∞∫\n0\n[1− Evaik (t)] dt.\nThe voltage can be decomposed into two components thus\nEvaik = E\nv\nk − Eaij .\nNow, circuit laws can be used to obtain expressions for the\nindividual voltages. This first is\n1− Evk(t) =\n∑\nK∈v\nRvKk\n[\nCSvK\ndEvK\ndt\n+ CCva1K\ndEva1K\ndt\n+CCva2K\ndEva2K\ndt\n+ · · ·\n]\nand the second\nEaij =\n∑\nK∈ai\nRaiKj\n[\nCSaiK\ndEaiK\ndt\n+ CCaivK\ndEaivK\ndt\n+CCaib1K\ndEaib1K\ndt\n+ CCaib2K\ndEaib2K\ndt\n+ · · ·\n]\n.\nThe superscripts aib1, aib2 . . . in the CC terms indicate the\ncoupling capacitances to tree ai’s own aggressors. Considering\nthe fact that all nodes not on the victim tree start and end at the\nsame voltage, this simplifies to\nΥ2e =2\n∑\nk∈v\nRvke\n×\n{\nCSvk\n∑\nK∈ vic\nRvKk (CS\nv\nK + CC\nva1\nK + CC\nva2\nK + · · ·)\n+ CCva1k\n[ ∑\nK∈a1\nRa1KjCC\na1v\nK +\n∑\nK∈v\nRvKk\n× (CSvK + CCva1K + CCva2K + · · ·)\n]\n+ CCva2k\n[ ∑\nK∈a2\nRa2KjCC\na2v\nK +\n∑\nK∈v\nRvKk\n× (CSvK + CCva1K\n+ CCva2K + · · ·)\n]\n+ · · ·\n}\n.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n1738 IEEE TRANSACTIONS ON COMPUTER-AIDED DESIGN OF INTEGRATED CIRCUITS AND SYSTEMS, VOL. 24, NO. 11, NOVEMBER 2005\nThis can be expressed in more succinct form by using the first\nmoment of the impulse response\nΥ2e\n= 2\n∑\nk∈v\nRvke\n{\nCSvkτ\nv\nDk\n+ CCva1k\n[\nτvDk +\n∑\nK∈a1\nRa1KjCC\na1v\nK\n]\n+ CCva2k\n[\nτvDk +\n∑\nK∈a2\nRa2KjCC\na2v\nK\n]\n+ · · ·\n}\n= 2\n(\nτvGe\n)2\nsay.\nFollowing an approach identical to that in the former case,\nthe first moment of the impulse response at node e on the victim\ntree for aggressor ai switching can be shown to be\nΥ1e = −\n∑\nk∈v\nRvkeCC\nvai\nk = −τaiDe say.\nThe second moment can also be calculated from an approach\nsimilar to the former case, resulting in\nΥ2e\n= −2\n∑\nk∈v\nRvke\n×\n{\n(CSvk + CC\nva1\nk + CC\nva2\nk + · · ·) τaiDk + CCvaik\n×\n[∑\nK∈ai\nRaiKj\n(\nCSaiK + CC\naiv\nK + CC\naib1\nK + · · ·\n)]}\n= −2 (τaiGe)2 say.\nAPPENDIX II\nBEHAVIOR OF STABILITY FUNCTION\nIn this section, it is proven that the equality of (A) is always\nto the left of the first zero-crossing point of LHS, which is\nimportant in analyzing the physical basis of potential instability.\nSince the following is true [where the last condition is necessary\nfor potential instability to occur—see the explanation for (20)\nin the main text]\nτvDe > 0\n(\nτvGe\n)2\n> 0\n(\nτvDe\n)2\n>\n(\nτvGe\n)2\nthe following holds true\n4\n((\nτvDe\n)2 − (τvGe)2)+\n(\nτvGe\n)4(\nτvDe\n)2 > 4((τvDe)2 − (τvGe)2)\ni.e.,\n((\n2τvDe\n)2 −\n(\nτvGe\n)2\nτvDe\n)2\n>\n(\n2\n√(\nτvDe\n)2 − (τvGe)2\n)2\nwhen\n2τvDe −\n(\nτvGe\n)2\nτvDe\n> 2\n√(\nτvDe\n)2 − (τvGe)2.\nRearranging the terms results in\n(\nτvGe\n)2\nτvDe\n< 2\n[\nτvDe −\n√(\nτvDe\n)2 − (τvGe)2\n]\n.\nHence, the equality of (A) is always to the left of the first\nzero-crossing point of LHS.\nACKNOWLEDGMENT\nVery productive discussions with Dr. L.-R. Zheng of the\nLaboratory of Electronics and Computer Systems, Department\nof Microelectronics and Information Technology, Royal Insti-\ntute of Technology, Sweden, are gratefully acknowledged.\nREFERENCES\n[1] SEMATECH. (2003). International Technology Roadmap for Semicon-\nductors (ITRS). [Online]. Available: http:\/\/public.itrs.net\/Files\/2003ITRS\/\nHome2003.htm\n[2] D. Pamunuwa, S. Elassaad, and H. Tenhunen, “Modelling noise and delay\nin VLSI circuits,” Electron. Lett., vol. 39, no. 3, pp. 269–271, Feb. 2003.\n[3] ——, “Analytic modeling of interconnects for deep sub-micron circuits,”\nin Proc. Int. Conf. Computer-Aided Design (ICCAD), San Jose, CA,\nNov. 2003, pp. 835–842.\n[4] M. A. Horowitz, “Timing models for MOS circuits,” Ph.D. dissertation,\nStanford Electr. Lab., Stanford Univ., Stanford, CA, Jan. 1984.\n[5] E. Chiprout, “Interconnect and substrate modelling and analysis: An over-\nview,” IEEE J. Solid-State Circuits, vol. 33, no. 9, pp. 1445–1452,\nSep. 1998.\n[6] D. Pamunuwa, L. R. Zheng, and H. Tenhunen, “Maximizing throughput\nover parallel wire structures in the deep submicrometer regime,” IEEE\nTrans. Very Large Scale Integr. (VLSI) Syst., vol. 11, no. 2, pp. 224–243,\nApr. 2003.\n[7] A. Deutsch et al., “When are transmission lines important for on-chip\ninterconnects,” IEEE Trans. Microw. Theory Tech., vol. 45, no. 10,\npp. 1836–1846, Oct. 1997.\n[8] I. Ismail, E. G. Friedman, and J. L. Neves, “Figures of merit to character-\nize the importance of on-chip inductance,” IEEE Trans. Very Large Scale\nIntegr. (VLSI) Syst., vol. 7, no. 4, pp. 442–449, Dec. 1999.\n[9] K. Banerjee and A. Mehrotra, “Analysis of on-chip inductance effects\nusing a novel performance optimization methodology for distributed RLC\ninterconnects,” in Proc. Design Automation Conf. (DAC), Las Vegas, NV,\n2001, pp. 798–803.\n[10] W. C. Elmore, “The transient response of linear damped circuits,” J. Appl.\nPhys., vol. 19, no. 1, pp. 55–63, Jan. 1948.\n[11] J. Rubinstein, P. Penfield, and M. Horowitz, “Signal delay in RC tree\nnetworks,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst.,\nvol. CAD-2, no. 3, pp. 202–211, Jul. 1983.\n[12] C. Y. Chu and M. A. Horowitz, “Charge-sharing models for switch\nlevel simulation,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst.,\nvol. CAD-6, no. 6, pp. 1053–1061, Nov. 1987.\n[13] L. T. Pillage and R. A. Rohrer, “Asymptotic waveform evaluation for\ntiming analysis,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst.,\nvol. 9, no. 4, pp. 352–366, Apr. 1990.\n[14] C. L. Ratzlaff, N. Gopal, and L. T. Pillage, “RICE: Rapid intercon-\nnect circuit evaluator,” in Proc. Design Automation Conf. (DAC), San\nFrancisco, CA, 1991, pp. 555–560.\n[15] L. M. Silveira, M. Kamon, and J. White, “Efficient reduced-order\nmodeling of frequency-dependent coupling inductances associated with\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \nPAMUNUWA et al.: MODELING DELAY AND NOISE IN ARBITRARILY COUPLED RC TREES 1739\n3-D interconnect structures,” in Proc. Design Automation Conf. (DAC),\nSan Francisco, CA, 1995, pp. 376–380.\n[16] A. Odabasioglu, M. Celik, and L. T. Pileggi, “PRIMA: Passive reduced-\norder interconnect macromodeling algorithm,” IEEE Trans. Comput.-\nAided Des. Integr. Circuits Syst., vol. 17, no. 8, pp. 645–654, Aug. 1998.\n[17] A. B. Kahng and S. Muddu, “Two-pole analysis of interconnection trees,”\nin Proc. Multi-Chip Module Conf. (MCMC), Santa Cruz, CA, 1995,\npp. 105–110.\n[18] ——, “An analytic delay model for RLC interconnects,” IEEE Trans.\nComput.-Aided Des. Integr. Circuits Syst., vol. 16, no. 12, pp. 1507–1514,\nDec. 1997.\n[19] B. Tutuianu, F. Dartu, and L. T. Pillage, “An explicit RC-circuit\ndelay approximation based on the first three moments of the impulse\nresponse,” in Proc. Design Automation Conf. (DAC), Las Vegas, NV,\n1996, pp. 611–616.\n[20] E. Acar, A. Odabasioglu, M. Celik, and L. T. Pillage, “S2P: A stable 2\npole RC delay and coupling noise metric,” in Proc. Great Lakes Symp.\n(GLS) VLSI, Ypsilanti, MI, 1999, pp. 60–63.\n[21] C. J. Alpert, A. Devgan, and C. V. Kashyap, “RC Delay metrics for per-\nformance optimization,” IEEE Trans. Comput.-Aided Des. Integr. Circuits\nSyst., vol. 20, no. 5, pp. 571–582, May 2001.\n[22] Y. I. Ismail and E. G. Friedman, “Effects of inductance on the propagation\ndelay and repeater insertion in VLSI circuits,” IEEE Trans. Very Large\nScale Integr. (VLSI) Syst., vol. 8, no. 2, pp. 195–206, Apr. 2000.\n[23] R. Kay and L. T. Pillage, “PRIMO: Probability interpretation of mo-\nments for delay calculation,” in Proc. Design Automation Conf. (DAC),\nSan Francisco, CA, 1998, pp. 463–468.\n[24] T. Lin, E. Acar, and L. T. Pillage, “h-gamma: An RC delay metric based\non a gamma distribution approximation to the homogeneous response,” in\nProc. Int. Conf. Computer-Aided Design (ICCAD), San Jose, CA, 1998,\npp. 19–25.\n[25] A. B. Kahng, S. Muddu, and E. Sarto, “On switch factor based analysis\nof coupled RC interconnects,” in Proc. Design Automation Conf. (DAC),\nLos Angeles, CA, Jun. 2000, pp. 79–84.\n[26] H. Kawaguchi and T. Sakurai, “Delay and noise formulas for capacitively\ncoupled distributed RC lines,” in Proc. Asian and South Pacific Design\nAutomation Conf., Yokohama, Japan, Jun. 1998, pp. 35–43.\n[27] A. B. Kahng, S. Muddu, and D. Vidhani, “Noise and delay uncertainty\nstudies for coupled RC interconnects,” in Proc. Application Specific\nIntegrated Circuit\/System-on-Chip (ASIC\/SOC), Washington, DC, 1999,\npp. 3–8.\n[28] A. B. Kahng, S. Muddu, N. Pol, and D. Vidhani, “Noise model for mul-\ntiple segmented coupled RC interconnects,” in Proc. Int. Symp. Quality\nElectronic Design (ISQED), San Jose, CA, 2001, pp. 145–150.\n[29] A. Devgan, “Efficient coupled noise estimation for on-chip intercon-\nnects,” in Proc. Int. Conf. Computer-Aided Design (ICCAD), San Jose,\nCA, 1997, pp. 147–153.\n[30] M. Takahashi, M. Hashimoto, and H. Onodera, “Crosstalk noise estima-\ntion for generic RC trees,” in Proc. Int. Conf. Computer Design (ICCD),\nAustin, TX, 2001, pp. 110–116.\n[31] X. Tong and M. Marek-Sadowska, “Efficient delay calculation in presence\nof crosstalk,” in Proc. Int. Symp. Quality Electronic Design (ISQED),\nSan Jose, CA, 2000, pp. 491–497.\n[32] B. L. Cochrun and A. Grabel, “On the determination of the transfer\nfunction of electronic circuits,” IEEE Trans. Circuit Theory, vol. CT-20,\nno. 1, pp. 16–20, Jan. 1973.\n[33] M. Celik, L. Pileggi, and A. Odabasioglu, IC Interconnect Analysis.\nBoston, MA: Kluwer, May 2002.\nDinesh Pamunuwa (M’04) received the B.Sc. de-\ngree in engineering with honors from the University\nof Peradeniya, Peradeniya, Sri Lanka, in 1997, and\nthe Ph.D. degree in electronic system design from the\nRoyal Institute of Technology (KTH), Stockholm,\nSweden, in 2003.\nHe is currently a faculty member of the De-\npartment of Engineering at Lancaster University,\nLancaster, U.K. In 2002, he was also at Cadence\nBerkeley Laboratories in Berkeley, CA. He has\nworked extensively on interconnect design and sig-\nnal integrity issues and methodologies for electronic system design. He is the\nauthor and coauthor of many papers in this area. Dinesh is also the cofounder\nof PsiTech, an electronics and software consultancy company based in Sweden\nand Sri Lanka. His current research interests include nanoelectronic devices and\ncircuits and tera-scale integration in the nanometer regime.\nShauki Elassaad received the B.S. and M.S. degrees\nin computer engineering from North Carolina State\nUniversity, Raleigh, in 1988 and 1991, respectively.\nHe is involved in research and development re-\nlated to all aspects of Signal Integrity at Rio Design\nAutomation. From 1999 to 2004, he worked at Ca-\ndence Berkeley Laboratories, Berkeley, CA, where\nhis research included various aspects of design plan-\nning timing, signal integrity, interconnect design,\nand hierarchical floorplanning. From 1997 to 1999,\nhe architected and designed timing algorithms for\nhierarchical floorplanning methodologies. During his tenure at High-Level\nDesign Systems from 1993 to 1997, he was involved in various products related\nto physical design—clock design, delay calculation, and global routing. From\n1991 to 1993, he worked at Intel Corporation where he designed algorithms\nfor extraction and delay analysis for high-end microprocessors. His research\ninterests include design planning, signal and power integrity, and digital design.\nHannu Tenhunen received the Diploma Engi-\nneer degree in electrical engineering and computer\nsciences from Helsinki University of Technology,\nHelsinki, Finland, in 1982, and the Ph.D. degree\nin microelectronics from Cornell University, Ithaca,\nNY, in 1986.\nDuring 1978–1982, he was with Electron Physics\nLaboratory, Helsinki University of Technology, and\nfrom 1983 to 1985 at Cornell University as a Full-\nbright scholar. Since September 1985, he has been\nwith the Signal Processing Laboratory, Tampere Uni-\nversity of Technology, Tampere, Finland, as an Associate Professor. He was\nalso a coordinator of the National Microelectronics Programme of Finland\nduring 1987–1991. Since January 1992, he has been with the Royal Institute of\nTechnology (KTH), Stockholm, Sweden, where he is a Professor of electronic\nsystem design. His current research interests are in very large scale integration\n(VLSI) circuits and systems for wireless and broadband communication, and\nrelated design methodologies and prototyping techniques. He has made over\n400 presentations and publications on IC technologies and VLSI systems\nworldwide, and has over 16 patents pending or granted.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:17 from IEEE Xplore.  Restrictions apply. \n"}