{"doi":"10.1080\/13533310802396160","coreId":"212146","oai":"oai:eprints.lse.ac.uk:24240","identifiers":["oai:eprints.lse.ac.uk:24240","10.1080\/13533310802396160"],"title":"Legitimacy and international administration: the Ahtisaari settlement for Kosovo from a human security perspective","authors":["Kostovicova, Denisa"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2008-11","abstract":"Legitimacy is recognized as critical to the success of international administrations in their efforts to build and promote peace, stability and welfare in post-conflict territories. Nonetheless, scholarship on statebuilding is dominated by the 'managerial' approach, which offers a top-down analysis of policies by international actors and their impact on local constituencies. With its focus on the grass roots, the individual and a multiplicity of concerns, a human security perspective on international administration can identify and address their legitimacy gap, resulting in strategies for more effective conflict resolution. The argument is illustrated by analysis of the Ahtisaari process and plan for Kosovo's final status","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/212146.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/24240\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Kostovicova%2C%20D_Legitimacy%20and%20International%20Administration_Kostovicova_Legitimacy_and_International_Administration.pdf","pdfHashValue":"7ce9d7e3d1390e1eb8a4be5476088af1e647ddae","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:24240<\/identifier><datestamp>\n      2016-04-29T09:07:34Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3138<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/24240\/<\/dc:relation><dc:title>\n        Legitimacy and international administration: the Ahtisaari settlement for Kosovo from a human security perspective<\/dc:title><dc:creator>\n        Kostovicova, Denisa<\/dc:creator><dc:subject>\n        HV Social pathology. Social and public welfare. Criminology<\/dc:subject><dc:subject>\n        DR Balkan Peninsula<\/dc:subject><dc:description>\n        Legitimacy is recognized as critical to the success of international administrations in their efforts to build and promote peace, stability and welfare in post-conflict territories. Nonetheless, scholarship on statebuilding is dominated by the 'managerial' approach, which offers a top-down analysis of policies by international actors and their impact on local constituencies. With its focus on the grass roots, the individual and a multiplicity of concerns, a human security perspective on international administration can identify and address their legitimacy gap, resulting in strategies for more effective conflict resolution. The argument is illustrated by analysis of the Ahtisaari process and plan for Kosovo's final status.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2008-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/24240\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Kostovicova%2C%20D_Legitimacy%20and%20International%20Administration_Kostovicova_Legitimacy_and_International_Administration.pdf<\/dc:identifier><dc:identifier>\n          Kostovicova, Denisa  (2008) Legitimacy and international administration: the Ahtisaari settlement for Kosovo from a human security perspective.  International Peacekeeping, 15 (5).  pp. 631-647.  ISSN 1353-3312     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/titles\/13533312.asp<\/dc:relation><dc:relation>\n        10.1080\/13533310802396160<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/24240\/","http:\/\/www.tandf.co.uk\/journals\/titles\/13533312.asp","10.1080\/13533310802396160"],"year":2008,"topics":["HV Social pathology. Social and public welfare. Criminology","DR Balkan Peninsula"],"subject":["Article","PeerReviewed"],"fullText":"  \nDenisa Kostovicova \nLegitimacy and international \nadministration: the Ahtisaari settlement \nfor Kosovo from a human security \nperspective \n \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: \nKostovicova, Denisa (2008) Legitimacy and international administration: the Ahtisaari settlement \nfor Kosovo from a human security perspective. International Peacekeeping, 15 (5). pp. 631-647. \nISSN 1353-3312  \nDOI: 10.1080\/13533310802396160 \n \n© 2008 Taylor & Francis \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/24240\/ \nAvailable in LSE Research Online: April 2016 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1 \nLegitimacy and International Administration: The Ahtisaari Settlement \nfor Kosovo from a Human Security Perspective  \n \nIn: International Peacekeeping, 15 (5). pp. 631-647 \n \nDENISA KOSTOVICOVA  \n \nKey words: human security, legitimacy, international administration, conflict-\nresolution, Kosovo, Ahtisaari, UNMIK \n[8,068] \n \n____________________________________________ \nLegitimacy is recognized as critical to the success of international \nadministrations in their efforts to build and promote peace, stability and \nwelfare in post-conflict territories. Nonetheless, scholarship on state-building \nis dominated by the ‘managerial’ approach, which offers a top-down analysis \nof policies by international actors and their impact on local constituencies. \nWith its focus on the grassroots, the individual and multiplicity of concerns, a \nhuman security perspective on international administration can identify and \naddress their legitimacy gap, resulting in strategies for more effective conflict-\nresolution. The argument is illustrated by analysis of the Ahtisaari process and \nplan for Kosovo’s final status.   \n___________________________________________ \n  \nLegitimacy is critical to the success of international administrations. Their \neffectiveness in post-conflict territories is judged on the impact of their policies \nin building and promoting peace, stability and welfare. Nonetheless, this \nimpact is not necessarily a measure of success; legitimacy is. Specifically, a \nmore accurate yardstick for the success of an international administration’s \nmandate, mission and policies in a war-torn territory is its degree of \nacceptance by the people it governs. The importance of legitimacy for \ninternational efforts has been recognized in state-building scholarship. \nHowever, legitimacy has been studied mainly in terms of the mandates of \n 2 \noutside interveners and the implications of their policies rather than in terms of \ntheir acceptance.  \n \nThis article reverses the perspective by adopting a human security \napproach. With its focus on individuals, it challenges the concept of \ncommunity and territory as the cornerstones of analysis. ‘People-\ncenteredness’, favoured by human security, informs a bottom-up perspective. \nThe consequence is the expansion of security concerns to include issues of \nwelfare. When applied to international administrations as a form of conflict \nresolution, the human security perspective furthers an understanding of the \nlegitimacy gap. This argument is backed up by analysis here of the Ahtisaari \nprocess and plan for Kosovo’s final status. Based on fieldwork conducted in \nKosovo and analysis of the Albanian, Serbian and Kosovo Serb press, as well \nas relevant documents, the article demonstrates the legitimacy deficits of the \nprocess and proposed solution. It highlights future points of contention that \nmay ultimately decide the legitimacy of international involvement in \nindependent Kosovo. \n  \n \nHuman Security and Conflict Resolution \n \nHuman security is a paradigm-shifting concept. At its core is a change of \nfocus from a state-centred understanding of security, that is, top-down and \nterritorial, to an individual-based and therefore bottom-up and de-territorialized \nmodel. It is informed by questions: security for whom; of what values; from \nwhat threats; and by what means?1 However, the quest for an agreed \ndefinition is still on since the publication in 1994 of a seminal UN Development \nProgramme (UNDP) report that set the terms of the human security debate. \nThe concept encompasses a range of perspectives, from minimalist to \nmaximalist, from a narrow ‘freedom from fear’ approach to a broader ‘freedom \nfrom want’ emphasis. The fear-based approach stresses the issue of life; the \nwant-based emphasises subsistence and, ultimately, dignity. Key actors, \nproponents and documents advancing the human security agenda are \npositioned on this scale.  \n 3 \nAccording to Sabina Alkire, the diversity of definitions of human \nsecurity reflects differences in perceived advantage to the implementing \ninstitution or country, resulting in emphases on different elements, dimensions \nand thresholds.2 The practice of human security has resulted in narrow \ninstitutional appropriations of the concept, sidelining the principle of bottom-up \nsecurity provision and working through the state instead. Kanti Bajpai argues \nthat ‘state security is for individual security,’ as the state’s security cannot be \nthe end of security but a means to it.3 This has led some scholars, such as \nNeil Cooper, emphasise a bottom-up approach by introducing subjective \nsecurity understood in terms of engagement with ‘the poor, the voiceless and \nthe marginalised’.4  \nThe critique of human security has grown in parallel with efforts to \nconceptualize it. Shahrbanou Tadjbakhsh and Anuradha Chenoy have \nidentified five types: conceptual (deriving from the definitional issue); \nanalytical (questioning its appropriateness within existing academic \ndisciplines, primarily international relations); political implications (related to \nthe implications for state sovereignty); moral implications (tied to perpetuation \nof global divisions); and implementation (in terms of bridging rhetoric and \npolicy).5 Responding to criticism that the concept of human security is too \ncomprehensive and therefore of limited policy value,6 scholars have \naddressed the issue of actors, capabilities and the global infrastructure \nrequired for the delivery of human security.7 The interest in policy prescription \nis particularly relevant in the area of conflict resolution and state-building.  \nHuman security has been defined as more than an absence of conflict. \nYet, surprisingly, the human security agenda has more to say about pre-\nconflict and post-conflict stages than it does on the approach to conflict itself. \nThe emphasis on non-traditional threats, such as poverty, inequality, human \nrights abuses and disease as potential triggers of conflict underpins the \nhuman security preventive agenda. By contrast, the stress on comprehensive \npeacebuilding, incorporating development as well as human rights, has \ndefined a human security post-conflict approach. But what about the conflict \nitself; and, more particularly, conflict resolution?  \nAccording to Sakiko Fukuda-Parr, a narrow conflict resolution \napproach, that is, a political approach, itself creates security gaps. Therefore, \n 4 \nwith its comprehensive approach, which includes human rights and \ndevelopment as well as political processes, human security is a value-adding \nconcept.8 While the human security approach has allowed for the bridging of \nthe political, developmental and human rights agendas for pre- and post-\nconflict situations, the bottom-up political agenda itself has not received \nsufficient critical scrutiny. Similarly, in the context of conflict resolution, the \ndefinition of the ‘political’ has by and large been reserved for the state level, \nas embodied by the political elite, or the sub-state level, reflecting a group’s \npolitical aspiration. In sum, conflict resolution has been defined by a collective, \nrather than an individual, approach. Therefore, the importance of the bottom-\nup processes and the necessity of multi-track conflict resolution have been \nhighlighted.9  \nSascha Werthes and Tobias Debiel point out that human security \n‘offers a normative reference point for evaluating and orientating policies and \npolitical instruments: the security and protection of the individual’.10 In other \nwords, human security allows for unpacking the bottom-up political dimension \nas well as recognizing the multiplicity of security concerns.11 Such approach \nto international administration can identify and address the legitimacy gap, \nresulting in strategies for more effective conflict resolution. \n \n \nInternational Administrations: The Bottom-up Approach to the \nLegitimacy Gap \n \n \nThe legitimacy gap has been recognized as an Achilles’ heel of international \nadministrations (IAs).12 Also known as interim or civil administrations, \ninternational protectorates or neotrusteeships, IAs represent external \ninterventions of a comprehensive nature in the aftermath of conflict and state \nfailure, with the aim of facilitating the creation of inclusive, functional and \nsustainable states.13 State-building thus facilitated is envisaged as an ultimate \nanswer to conflict in the age of global (in)security.14  \nFrom Bosnia and Herzegovina to Timor–Leste, Kosovo and \nAfghanistan, the comprehensive nature of these interventions, including \n 5 \ndemocratic institution building, civil society assistance, economic \ndevelopment, human rights promotion, reckoning with war crimes and so on, \ncorresponds closely to key human security concerns. At the same time, the \npractice of IAs violates one of the key tenets of human security: the bottom-up \nperspective. There is an inherent contradiction in external state-building \nefforts, as they are premised on the appropriation of local ownership for the \nsake of crafting local democracy and building local capacity.15 Critics have \naddressed this contradiction in terms of a legitimacy gap.  \nLegitimacy derives from the nation-state framework, with a \nstraightforward juxtaposition of the ruler and the ruled. The increasingly \ntransnational and multilateral quality of post-cold war politics has triggered a \ndebate on normative, empirical and procedural aspects of legitimacy above a \nnation state. 16 IAs embody the complexity of global politics. They involve \nmultiple stakeholders: international organisations, nation states with distinct \npreferences held by their governments and publics, as well as local \npopulations with their own political and ethnic diversity. Therefore, viewed \nthrough the prism of the nation state, international administrations provide an \ninnately anomalous context for the generation of legitimacy. The \nundemocratic exercise of authority is supplanted by rational assent and \nconviction to norms and principles elicited by effective communication.17 The \nadaptation of the ‘input-oriented’ legitimacy (based on a sense of identity and \ncommunity), to rational reasoning, enhances the significance of the ‘output-\noriented’ legitimacy, based on the capacity to solve problems.18   \nThe discussion of legitimacy in the state-building literature reflects a \nwider theoretical challenge – conceptualizing legitimacy in a transnational \ncontext. Scholars have addressed the issue of sites where legitimacy is \ngenerated, grounds on which it is founded, and the process by which it is \nproduced and contested. William Bain rejects the legitimacy of contemporary \ntrusteeships as a form of paternalism, because human dignity and equality, as \nvalues that define international society, are at odds with the idea of \ntrusteeship.19 David Chandler modifies Michael Ignatieff’s ‘neo-imperial’ \nargument20 into an ‘empire in denial’ proposition. State-building – including by \nIAs – is, according to Chandler, an intrusive and contradictory form of \ninternational control. It simultaneously assumes the denial of power and \n 6 \nevasion of the responsibility of power.21 Sally Morphet contends that the \npolitical legitimacy of civil administrations, like the effective execution of their \nmandates, correlates with their compliance with the international legal \nstandards and norms on which they are based.22 Similarly, Dominik Zaum \nconceptualises sovereignty as responsibility, assessing its impact on the \npolicies and authority of state builders.23 \nInsofar as it addresses the legitimacy gap in terms of ambiguous \ninternational mandates, ineffective capacity-building, creation of political, \neconomic and cultural dependence and inadequate conflict resolution, the \nstate-building literature has been dominated by the ‘managerial’ approach. It \nprovides a top-down view of policies undertaken by international actors, and \ntherefore of their impact. Consequently, it denies agency and voice to the \nlocal constituency, which is hardly ever brought into the analysis in the \nexisting scholarship.24 Yet at the core of legitimacy is a notion of acceptance \nof, and belief in, the political decisions and the political order.25 Distinguishing \nbetween ‘international’ and ‘domestic’ legitimacy, Benrhard Knoll highlights \nthe significance of local consent for the discursive and governance aspects of \ndomestic legitimation of international administrators.26  \nThis is a welcome change of perspective – from legitimacy as the \nanalysis of the rationales, mandates and policies of international \nadministrators, to legitimacy constructed through the views of those on whose \nbehalf they govern. Only in Timor–Leste, unlike in the Balkan involvements, \nwas the mission obliged in its mandate to consult with local actors. \nChesterman points out the key role of local consultations in the day-to-day \ngovernance of the territory,27 while Zaum emphasizes the importance of local \nknowledge for effective governance.28 The High Representative in Bosnia and \nHerzegovina, Miroslav Lajcak, has introduced a personal blog as a \nmechanism for direct consultation with the local population.  \nThe acknowledgement of local consultations and their beneficial impact \nfor the legitimacy of IAs, however, stops short of addressing the nature of the \nlocal constituency and the grounds on which legitimacy can be built. With \nhidden agendas, competing interests and cross-border links, these are critical \nbut not self-evident, particularly in a post-conflict context. Béatrice Pouligny \nwarns against seeing ‘local societies as a shapeless, homogenous, static \n 7 \nwhole’.29 During and after the conflict, she argues, political, economic and \nmilitary entrepreneurs as well as indigenous civil societies, including formal \nsocial organizations and religious and community networks, are involved in \nfluid, cross-cutting and interconnected networks whose politics, interests and \nperspectives are not necessarily deducible from their position in the local \npolitical order.30 Such disconnection has unexpected local consequences, \nsuch as elected representatives not being recognized as the best guardians \nand representatives of people’s interests.  \nThe article first details the Ahtisaari process and its background. It \ngoes on to discuss the legacies of the UN Mission in Kosovo’s (UNMIK’s) rule, \nwhich shape the perception of the Ahtisaari package. Finally, it provides a \nhuman security perspective on the settlement.  \n \nThe Path to Kosovo’s Final Status  \n \nThe NATO intervention in 1999 ended Serbian repression in Kosovo, but not \nthe Serbian–Albanian long-standing contest over status. UN Security Council \nResolution 1244 authorized the UN civilian administration to operate in the \nterritory, alongside NATO’s security presence, for an unspecified interim \nperiod pending the final settlement. The international community was \noverwhelmed by the challenges posed by a combination of post-conflict \nreconstruction and post-Communist transition. The outbreak of violence in \nMarch 2004, rather than the substantial headway made in preparing the \nprovince for self-rule, precipitated steps towards finalizing the status of \nKosovo. As the Albanian majority turned on the minorities, 19 people were \nkilled and thousands displaced, while private property and cultural heritage \nsites, including a number of Orthodox churches and shrines, were destroyed. \nThe prospect of further instability caused by pent-up frustration over the \nunresolved status galvanized the international community.  \nThe final status talks, chaired by the UN envoy and former Finnish \nPresident, Martti Ahtisaari, began in Vienna in February 2006. The Albanians \nentered the process insisting on independence, the Serbs on unspecified \nsubstantial autonomy for Kosovo. Due to such diametrically opposed views \nthe talks focused on non-status issues: decentralization, cultural heritage, \n 8 \ncommunity rights and economic matters. The futility of 17 rounds of talks over \n14 months led to a change of strategy in March 2007. Ahtisaari stated \nunequivocally that the potential for negotiations was ‘exhausted’.31 Later that \nmonth came a move signalling the imposition of a solution, when Ahtisaari \nsubmitted his settlement proposal to the Security Council. A detailed outline of \nthe internal governance architecture of the future independent Kosovo and of \ninternational supervision in the form of civilian and military presence was \naccompanied with a report that said: ‘The only viable option for Kosovo is \nindependence, to be supervised for an initial period by the international \ncommunity.’32  \nThe plan itself has two key characteristics. The first is its \ncommunitarian and territorial approach, and the second is the nature of \nsupervision. In order to address the Serbian question in Kosovo, the \ncommunity rights approach is expressed through institutional and territorial \narrangements for the Serbs vis-à-vis the Albanian majority. The territorial \naspect envisages the creation of Serb-majority municipalities. The plan \nsanctions cooperation between the Serb-majority municipalities, as well as \ntheir cooperation with the institutions in Serbia. 33 It also includes the creation \nof Protective Zones around Serbian Orthodox heritage.34 In sum, the plan \nrelied on the weight of group rights and new municipal borders to address \nSerb insecurities and co-opt the Serbs into accepting an independent Kosovo.  \nThe second feature is the nature of supervision of Kosovo’s \nindependence, which is embodied in the authority vested in the International \nCivilian Office (ICO) in Kosovo. One of the responsibilities of the International \nCivilian Representative, as a part of overseeing the implementation of the \nsettlement, was to be ‘the final authority regarding the interpretation of the \ncivilian aspects’, annulling legislation by the Kosovo authorities and even \nsanctioning or removing from office any public official.35 In effect, the ICO was \nmodelled after the Office of the High Representative in Bosnia and \nHerzegovina, whose powers to override the local legislative decisions and rule \nby decree have, since 1995, illustrated the pitfalls of building democracy by \nundemocratic means.36 \nThe adoption of the Ahtisaari package by the UN Security Council in \nthe spring of 2007 was blocked by Russia’s opposition to a non-negotiated \n 9 \nand imposed solution; which ultimately led to another 120 days of negotiations \nunder the auspices of the Contact Group in the autumn as a concession to the \nnegotiated approach. Its failure paved the way for the alternative, backed by \nthe United States and the majority of the EU, of a ‘coordinated’ declaration of \nindependence by Kosovo Albanians,37 which came on 17 February 2008. The \nDeclaration of Independence of Kosovo, adopted by the Kosovo Parliament, \nspecifically refers to the Ahtisaari plan, and spells out Kosovo Albanians’ full \nacceptance of the obligations for Kosovo envisaged by the plan and its \nproposed framework for the future administration of Kosovo.38 The Ahtisaari \nplan was ‘embedded’ in the constitution when it came into force on 15 June \n2008.39 \nBefore unpacking the bottom-up perspective, the article addresses two \nlegacies of the intervention in Kosovo in order to contextualize grassroots \nviews and their complexity. The record of UNMIK’s rule and Kosovo’s \n‘enclavization’ is critical for understanding the response to key features of the \nAhtisaari settlement.  \n \n \nThe Shadow of UNMIK \n \nThree areas of its activity define the record of UNMIK’s rule in Kosovo: \ngovernance, political will and conflict resolution. These also affect the degree \nof acceptance of the future international administration. Kosovo’s president \nhas already announced that the EU mission in Kosovo will not last as long as \nUNMIK’s.40  \nThe UNMIK administration, set up by the UN Security Council \nResolution 1244, was a de facto international government for Kosovo. The \ntransfer of powers took place gradually – though not satisfactorily, for the \nAlbanian constituency. Albanians considered the transfer of power, which \nbegan in May 2001, inadequate and too slow. The international administration \nreserved specified responsibilities in areas of monetary policy, external \nrelations, customs and so on. This led not only to a sense of disempowerment \nof Kosovars, but also to a ‘war’ between the Kosovo Parliament and the \ninternational administrators over issues such as the border with Macedonia. \n 10 \nUNMIK’s reserved powers were a consequence of Kosovo’s unresolved final \nstatus. Nonetheless, they caused resentment, thus eroding UNMIK’s \nlegitimacy.  \nThe Serbs also had their complaints about UNMIK and the international \ncommunity in general. They have criticized a lack of progress in fulfilling the \nstandards elaborated in the ‘Standards before Status’ policy. This approach, \ninitiated in 2002, involved eight standards: functioning democratic institutions; \nthe rule of law; freedom of movement; returns and reintegration; economic \nprogress; property rights; dialogue with Belgrade and the Kosovo Protection \nCorps, with minority presentation. Despite its weaknesses,41 the policy had \nsome impact as it was a condition for the resolution of Kosovo’s status.42 After \nthe 2004 unrest and the launch of the UN process, the policy evolved into \n‘Standards with Status’. By that time, however, it had all but lost its \ncredibility.43  \nUNMIK was also criticized for ineffective economic governance, \nresulting in economic malaise and distorted development. Its credibility was \nchallenged by its reluctance to confront the clandestine criminal structures. \nOriginating before the conflict, they were further entrenched during it.44 \nAlbanians and Serbs have expected UNMIK, as an empowered and an \nimpartial governor, to come to grips with them. But UNMIK’s failure to do so \nreinforced ‘the logic of the warlords’.45 Iain King and Whit Mason attribute this \nto UNMIK’s own lack of capacities, such as the inability to penetrate the \ncriminal structures.46 By contrast, UNMIK’s strategy for the people of Kosovo \nwas not the question of ability but of political will: UNMIK bought political \nstability by tolerating local criminal structures. The unhindered existence of \nshadow intelligence operations controlled by Albanian political parties and \nshadow security structures set up by Belgrade in Kosovo Serb communities \nillustrates this.  \nLast, the UNMIK era in Kosovo has also been associated with the \nfailure to resolve ethnic conflict. The conflict resolution strategy of \nguaranteeing minority rights to Kosovo Serbs, alongside other minority \ncommunities in Kosovo, proved largely ineffective. With the final status \nquestion pending, the Albanians’ case for independence was boosted by \nattempts, such as the setting of the multi-ethnic Parliament, to create a \n 11 \nfunctioning multi-ethnic society.47 Consequently, to Kosovo Serbs, and to \nBelgrade in particular, their participation in the Kosovo’s institutions was a \nstep towards the fulfilment of the Albanians’ goal. The result, despite dissent \namong Kosovo Serbs, was to boycott Kosovo’s institutions and political life. \nMeanwhile, sporadic instances of inter-ethnic violence created a sense of \nenduring conflict.  \n \n \nThe Ethnic ‘Enclavization’ of Kosovo \n \n \nEnclavization has been the main feature of Kosovo’s ethnic landscape in the \npost-NATO intervention period. The withdrawal of Serbian security forces \nresulted in what has been described as a reverse ‘ethnic cleansing’.48 \nAlbanian revenge attacks against the remaining Serbs and their property \ncreated an atmosphere of insecurity, to which enclaves offered a solution. \nEnclavization heralded the ruralization of the Serbian community. In the post-\nsecond world war period, the Serbs became a minority in all urban areas in \nKosovo.49 After NATO’s intervention, Mitrovica, in the north of Kosovo, \nremained the only city with a significant number of Serbs. In Kosovo’s capital, \nPrishtina, the pre-war population of some 40,000 was reduced to the \ninhabitants of a single apartment block.  \nThere are six larger enclaves, and several dozen pockets, some of \nwhich comprise no more than 80 people.50 While Mitrovica is the largest \nsingle enclave, more Serbs live scattered in the enclaves south of the Ibar \nRiver, which divides Mitrovica into the Serbian north and Albanian south.51 \nThe Serb enclave in Mitrovica, is adjacent to Serbia, and is the only area in \nKosovo where the Serb population grew after 1999, owing to the arrival of \ndisplaced persons from other areas in Kosovo. Enclavization has aggravated \nSerbian–Albanian relations in post-intervention Kosovo, especially in \nMitrovica. Albanians saw enclaves as a blueprint for the unacceptable \npartition of Kosovo.  \nAlthough enclaves are associated with mono-ethnicity, they are not \nislands of ethnic homogeneity. Even in Mitrovica, there are areas with an \n 12 \nAlbanian population, such as the so-called Bosniak Mahala, several \napartment blocks on a strip of land on the Serb side inhabited both by \nAlbanians and Serbs. There is also a small multi-ethnic settlement to the north \nof Mitrovica. The Albanian inhabitants of villages on the border with Serbia are \ndetermined to remain there, even after the post-independence unrest in the \narea in February 2008.52  \nThe existence of geographically concentrated areas of Serbs in Kosovo \nhas facilitated Serbia’s continued political presence in Kosovo. The Belgrade \ngovernment has organized and funded parallel education, healthcare and civil \nservices, as well as clandestine security structures in Kosovo.53 Further, \nSerbia’s political influence in Kosovo is extended through party politics. Nearly \nall the Serb political parties of Kosovo are branches of Serbian political \nparties, and their agendas are therefore set in Belgrade rather than in Kosovo. \nStill, the Belgrade government has failed to impose total control on Kosovo \nSerbs.  \nThe Serbian National Council (SNC), an unelected body gathering \nSerb political and religious leaders in Kosovo, is itself divided. The SNC’s \nGračanica faction accepted the Serbs’ position within the ‘new Kosovo’; the \nSNC’s Mitrovica faction challenged it.54 These conflicting views translated into \nthe former’s collaboration with UNMIK, and the latter’s defiance of it.55 The \ntensions and resulting contradictions in policy recommendations concerning, \nfor example, participation in Kosovo elections, continued throughout the \nperiod of UNMIK rule, coming to a head after the declaration of independence \nin February 2008. The founding of indigenous Kosovo Serb parties, such as \nthe Independent Liberal Party, reflects frustration with Belgrade policies often \ndetrimental to Kosovo Serb interests.  \nTo sum up, both the UNMIK era in Kosovo and the ethnic-cum-\nterritorial distribution of Kosovo Serbs represent legacies that informed the \ncritical assessment of key elements of the Ahtisaari plan at the grassroots \nlevel.  \n \n \nThe Ahtisaari Process and Plan from a Human Security Perspective  \n \n 13 \n \nWhat Serbs and Albanians in Kosovo have in common is that grassroots \nopinion was at odds with their own political elites in appraising the Ahtisaari \nplan. Discordant assessments reflected the fact that the Ahtisaari process \nwas largely an elite process: both negotiating teams overlooked the concerns \nof ordinary people while prioritizing the issue of the statehood of Kosovo, that \nis, its borders and territory.  \n \nThe Albanians  \n \nThe Unity Team of the Albanian negotiators, representing cross-party \ninterests, entered the process with one crucial objective: securing \nindependence for Kosovo. Consequently, the team compromized on other \naspects of the plan. On entering the process, Albanians were not given any \nexplicit promises of independence. Nonetheless, independence for Kosovo \nwas an assumed outcome.56 Key concessions concerned the \ninstitutionalization and territorialization of Serb rights on ethnic principle, even \nagainst their own better judgement. A member of the Unity Team feared that \nthis would lead to the creation of ‘two separate political communities’.57 \nHowever, this was seen as an acceptable price for Kosovo’s independence. \nDue to obstacles within the UN, the Ahtisaari plan was not accompanied by \nindependence. Consequently, popular dissatisfaction surfaced over  \ncompromises made in the process.58 Key objections concerned ethnic \ndecentralization, special zones for religious monuments and the nature of the \ninternational rule.   \nThe Albanians criticised the decentralization prescribed by the \nAhtisaari plan on ethnic and functional grounds. With the legacy of Kosovo’s \npost-intervention enclavization in mind, ethnic decentralization was seen as a \nstep towards further entrenchment of ethnic divisions. Of particular concern \nhas been the division of Mitrovica into two ethnically-defined municipalities, \nalbeit with a joint board. This provision is seen as a validation of the ethnic \nsegregation in Mitrovica that has been maintained by paramilitary formations \nsuch as the infamous ‘Bridge Watchers’.59 The declaration of Kosovo’s \nindependence has failed to assuage Albanian fears of Kosovo’s partition. The \n 14 \ninstitutionalization of the ethnic border in Mitrovica, in accordance with the \nAhtisaari plan, is perceived as the introduction of an internal division of \nKosovo and a challenge to the sovereignty of Kosovo on the entirety of its \nterritory.60  \nFurthermore, the opposition to new Serbian majority municipalities has \nbeen reinforced on practical grounds. As a result of the gerrymandering \nnecessary to introduce Ahtisaari’s ethnic municipal borders, some citizens \nfaced being cut off from their nearest municipal offices. The opinion of an \nAlbanian from the village of Suhadoll\/Suvi Do, previously a part of \nLypjan\/Lipljan municipality and about to become part of the Serb-majority \nGraçanica\/Gračanica according to the Ahtisaari plan, is telling:  \n \nIt does not make sense that in the name of bringing government closer \nto the citizens, we are pushed to join a municipality 30km away from \nour village, while the municipality of Lypjan is on our doorstep, just 2km \naway. How can we live as part of a municipality that will be controlled \ndirectly by Belgrade? I don’t know if the politicians are aware that any \nproject they attempt to realize without a ‘yes’ from the people is \ndestined to fail.61 \n \nSome improvement in inter-ethnic relations in Kosovo has been attributed to \nthe Standards before Status process.62 By contrast, the separation of Serbs in \ntheir own municipalities under the Ahtisaari plan appears to contradict the \nprevious policy. Local Albanian officials who worked on the integration of \nSerbs feel let down. Reaching out across the ethnic divide after the bloodshed \nof 1998–99 was a genuine challenge. Furthermore, in the traditional Albanian \nsetting, implementation of the policy was a question of honour. One municipal \nleader said: ‘I staked my honour on engaging the Serbs, and now it is all \nbeing undone.’63  \nOpposition to ethnic decentralization, that was clear during the \nnegotiations, cuts across Albanian civil society. 64 In the post-independence \nperiod, the opposition has turned into resistance to the implementation of this \npart of the plan. Thus, the mayor of Gjilan\/Gnjilane says it will be difficult to \nimplement decentralization because it is unacceptable. Similarly, the division \n 15 \nof Mitrovica into two municipalities is turning into a test for the new \ninternational administrators.65 Like Serb-majority municipalities, Albanians \nhave criticized the creation of Protective Zones for the Serb Orthodox heritage \nfor demonstrating a lack of trust in the Albanians, and for, effectively, isolating \nthese sites from the local communities.66 These objections also reflect \nAlbanians’ sensitivity to the issue of space: the introduction of these zones is \nseen as an underhand way of removing territory from their control.67  \nLast, both ordinary Albanians and their political leaders concur in their \nassessment of the nature of the international presence. The International \nCivilian Office represents a critical part of the Ahtisaari plan – defining the \nnature of the international supervision of Kosovo’s status. Nonetheless, \naccording to a member of the Albanian negotiating team, the role and \nauthority of the ICO was not even discussed with them. Reading the section \nof the plan referring to the ICO therefore came as a ‘complete shock’.68 The \nfeelings in Albanian civil society are not dissimilar and are attributed to the \nlack of trust in the Albanians.69 Such views are reinforced by the culture of \nmistrust that is UNMIK’s legacy in Kosovo. \nElements of the Ahtisaari plan have been contested because of a lack \nof consultation with the local elites, and the marginalization by local elites of \ngrassroots concerns. According to one commentator, ‘this was a plan of the \ninternational community and not of Albanians. So, this plan was imposed on \nKosovars – they had no other way but to accept it.’70 This is likely to adversely \naffect the plan’s implementation and the exercise of influence by the EU \nadministrators in Kosovo.  \n \nThe Serbs \n \nAdopting a classic geopolitical approach that puts territory first and people \nsecond, the Belgrade leadership rejecting the Ahtisaari plan. Its failure was \ndeclared ‘the first and foremost state and national interest of Serbia’.71 Unlike \nthem, Kosovo Serbs had an ambiguous stance towards the plan.  \nDifferent opinions of the plan coincided with a political divide within the \nSerbian National Council. Kosovo Serbs have been inclined to reserve their \ndissenting opinions for themselves. This is because of the pressure they have \n 16 \nfaced from clandestine Serbian structures in Kosovo, in case they fall out of \nline with Belgrade.72 Nonetheless, especially south of the Ibar River, ‘people \nsay that the Ahtisaari plan is basically acceptable, short of the first line’.73 ‘The \nfirst line’ is a reference to independence. Guarantees of group rights, \ncombined with territorial reorganization of Kosovo along ethnic lines in the \nplan, were deemed credible. In fact, institutionalization and territorialization of \nethnicity would allow each Serb enclave in Kosovo to become a ‘little \nSerbia’.74  \nThe official Serb rejection of the Ahtisaari plan has marginalized the \ndissenting opinion in the Kosovo Serb community. This is not unexpected, as \nBelgrade had dictated the agenda during the Vienna negotiations. A proposal \nby a Kosovo Serb moderate that Kosovo Serbs should represent the third \ndelegation at the talks alongside Belgrade and Prishtina was dismissed.75 A \ntoken presence of Kosovo Serbs was allowed insofar as they endorsed \nBelgrade’s view. But the particular circumstances and interests of the Serbs \nsouth of the Ibar were not considered.76 According to Radmila Trajković, of \nthe central Kosovo branch of the SNC, the Serbs in the enclaves ‘accepted \nthe reality of being surrounded by Albanians as a dominant community. In \norder to survive they have been making a series of compromises, which in \nessence means a chance for life and for the future.’77 After the declaration of \nindependence, they defied Belgrade’s orders to abandon any Kosovo \ninstitutions.78 The refusal of Kosovo Serb policemen in some areas, such as \nShtërpci\/Štrpci and Peja\/Peć, to leave the Kosovo Police Service illustrates \nthis.79 Establishment of the Serb Parliament in Kosovo has failed to elicit \nunanimous support locally.80 By contrast, support that local leaders in \nMitrovica have received from Belgrade has resulted in a hardline position.81 \nStaging post-independence riots, they rejected collaboration with UNMIK and \nthe EU.  \nWhile Kosovo Serbs did not support Kosovo’s independence, the \nabsence of a mass ‘exodus’ and the refusal by some to toe Belgrade’s line \nafter independence, indicate that many would find a way to live with it.82 When \nasked about their top priorities, Kosovo Serbs put Kosovo’s final status fourth, \nafter regular electricity supply, public and personal security, and the return of \nthe displaced and refugees.83 Tacit endorsement of certain aspects of the \n 17 \nAhtisaari plan helps to this end, and indicates policy space for more \nintegrative solutions.84 ‘Enclavization’ pushes Kosovo Serbs to look to \nBelgrade rather than Prishtina, and it does not address the issue of livelihood. \nAccording to one observer, Kosovo Serbs should have demanded a certain \nnumber of places at all levels of education, to signal commitment to future \nmulti-ethnic Kosovo but also as a guarantee of jobs for Kosovo Serbs.85  \n \nThe Albanians and the Serbs \n \nAlbanians and Serbs have been divided by issues concerning territory and \nidentity, which were addressed in the Ahtisaari plan. They have been equally \nunited by concerns for their wellbeing that were not included by the plan. The \nfinalization of their status, which the Ahtisaari process was expected to bring, \nwas implicitly linked to the improvement of the economic situation in Kosovo. \nThe access to international financial institutions this would allow is one \nexample. Nonetheless, the Ahtisaari plan has failed to live up to the \nexpectations of ordinary Albanians and Serbs because it did not explicitly \naddress their concerns about poverty, unemployment and Kosovo’s \ndevelopment in general. A member of an Albanian NGO wondered, ‘Why isn’t \nthere a line in Ahtisaari which says here you build a factory and employ \npeople?’86 Similarly, Kosovo Serbs have been preoccupied with their \neconomic survival. They feel this concern has been inadequately addressed \nin the status process. The high Kosovo average unemployment rate is even \nhigher among Kosovo Serbs.87 This has particularly affected the younger \npopulation. In many instances, bleak economic prospects, rather than \ninterethnic tensions, have prompted Serbs to sell up and leave, as is the case \nin the multi-ethnic village of Bresje, near Kosovo Polje.88 In addition, the \nSerbs’ dependence on handouts has made them vulnerable to political \npressure from Belgrade. For example, the medical centre in Mitrovica is a key \nemployer of Kosovo Serbs. Jobs at this hospital have provided material \nsecurity for the employees, but also ensured political loyalty to Belgrade.  \n   \nConclusion \n \n 18 \nBesides confusion over the authorization of the EU’s mission and the role of \nthe UN in Kosovo, the Ahtisaari plan for Kosovo raises serious questions \nabout its legitimacy, understood in terms of acceptance. The plan’s human \nsecurity analysis challenges the commonly accepted homogeneity in \nethnically-defined Serb and Albanian positions. This article does not suggest \nthat the Ahtisaari process could have produced a hitherto elusive Serb-\nAlbanian rapprochement on Kosovo’s final status. It does, however, contend \nthat consideration of a plurality of views in each community and a multiplicity \nof their concerns in the process would have ensured a more auspicious start \nfor Kosovo’s new international administrators. The process ought to have \nincorporated rather than sidelined the diversity of Kosovo Serb concerns, and \nrecognized Belgrade’s role as a cause of insecurity for Kosovo Serbs. \nLikewise, it ought to have attempted to overcome the legacy of conflict, such \nas the ethnic border in Mitrovica, which while dividing Albanians and Serbs \nallows illegal interethnic collaboration to flourish. Lastly, the ICO could have \nbuilt in a local monitoring\/advising mechanism to legitimise its executive \npowers.  \nInsofar as the state-building literature recognizes the necessity of \nbuilding legitimacy from below in territories governed by international \nadministrators, discussion of policy implications stops short with calls for local \nconsultation and local ownership. These have been criticized for leading to \nthe artificial creation of civil society and abrogation of responsibility; but they \nalso fail to address defining features of post-conflict environments. A human \nsecurity approach allows for reframing of the bottom-up aspect by engaging \nwith the complexity of local constituencies and a range of concerns in the \naftermath of conflict.  \nThis implies tackling actors and structures created during the conflict \nthat obstruct a transition to peace. Neither is obvious when viewed from the \ntop-down state perspective, but, nonetheless, they undermine the rule of law, \ndistort economic development and hinder conflict resolution. Beneficiaries of \nconflict, that cause pervasive insecurity, are likely to be found among one’s \nown ethnic kin. While appearing as advocates of statehood, their actual \ninterest is in delaying state-building. Ultimately, they are set to gain from the \nlegitimacy gaps in IAs.    \n 19 \nWithout a democratic mandate, governance is at the forefront of \nlegitimation of international administrators, attempting to compensate for the \nlack of ‘input’ legitimacy. Governance is more than the technocratic exercise \nof public administration and economic resource management. It is a \n‘relationship’ between the governors and the governed.89 As such, it relies on \nthe governed having a stake in the process by having a ‘say’ in it. In the \ncontext of IAs, a transfer of powers from external to local authorities is only \none part of the process, which is determined by effective provision of a range \nof entitlements, including human rights, employment opportunities, transitional \njustice and so on. Resonance with the diverse needs of ordinary persons will \nenhance their sense of security, and, in turn, confer belief critical for \nlegitimation to the providers of these public goods whether external or local.  \nThe success of international administrators ultimately depends on \nmaking their presence redundant. They will be most legitimate when no longer \nneeded. This entails the creation of a democratic, inclusive and self-\nsustainable state. The human security perspective addresses the questions: \nwho should be empowered and on what terms, and answers them from the \nbottom-up vantage point. It thus points the way towards the eventual creation \nof a legitimate state following the exit of international governors. In this sense, \nthe individual perspective works for state building, rather than in opposition to \nit. It does not imply an exclusion of the state, but is its ‘healthy corrective’.90  \nThe human security perspective moves the debate forward by \nindicating how and on what terms to engage the grassroots, particularly in a \nmurky post-conflict environment, in creating security for all through state \nbuilding. Prioritizing the bottom-up perspective marks a return to the \nparadigm-shifting quality of human security as a concept and policy. In view of \nthe challenges posed by global governance, the stronger the claim to \nlegitimacy – understood in terms of acceptance by local constituencies, \ngenerated by reaching beyond nascent state structures, and mindful of \nconflict dynamics and its legacies – the greater the opportunity for \ninternational administrations to be a more potent instrument of state building, \nand, ultimately, conflict resolution.   \n \n 20 \nAcknowledgments \n \nThis article draws on the author’s research for the Human Security Study \nGroup convened by Professor Mary Kaldor and the ongoing project ‘Human \nSecurity in Kosovo’ at the Centre for the Study of Global Governance, London \nSchool of Economics and Political Science. The author thanks anonymous \nreviewers for their useful comments.  \n \nNOTES \n \n1 See Table I in Kanti Bajpai, ‘Human Security: Concept and Management’, \nworking paper, Joan B. Kroc Institute for International Studies (at: \nwww.ciaonet.org\/wps\/baj01). \n2 Sabina Alkire, ‘Concepts of Human Security’, in Lincoln Chen et al., (eds) \nHuman Insecurity in a Global World, Cambridge, MA: Harvard University \nPress, 2003, pp.15–39. \n3 Bajpai (see n.1 above).  \n4 Neil Cooper, ‘Review Article: On the Crisis of the Liberal Peace’, Conflict, \nSecurity & Development, Vol.7, No.4, pp.605-616, at p.615. \n5 Shahrbanou Tadjbakhsh and Anuradha M. Chenoy, Human Security: \nConcepts and Implications, London: Routledge, 2007, pp.57–68. \n6 Roland Paris, 'Human Security: Paradigm Shift or Hot Air', International \nSecurity, Vol.26, No.2, 2001, pp.87–102. \n7 Marlies Glasius, ‘Human Security: From Paradigm Shift to \nOperationalization: Job Description for a Human Security Worker’, Security \nDialogue, Vol.39, No.1, 2008, pp.31–54; Sandra J. MacLean et al., (eds), A \n 21 \n \nDecade of Human Security: Global Governance and New Multilateralisms, \nAldershot: Ashgate, 2006. \n8 Sakiko Fukuda-Parr, ‘New Threats to Human Security in the Era of \nGlobalization’, in Chen (see n.2 above), pp.1–13; cf. Peter Uvin, ‘A Field of \nOverlaps and Interactions’, Security Dialogue, Vol.35, No.5, 2004, pp.352–3. \n9 Hugh Miall et al., Contemporary Conflict Resolution, Cambridge: Polity, \n1999, p.18. \n10 Sascha Werthes and Tobias Debiel, ‘Human Security on Foreign Policy \nAgendas: Introduction to Changes, Concepts and Cases’ pp.8–20, at p.18, \n(at: www.ciaonet.org\/wps\/idp\/0001302\/0001302.pdf). \n11 Mary Kaldor, Human Security: Reflections on Globalization and \nIntervention, Cambridge: Polity, 2007. \n12 Edward Mortimer, ‘International Administration of War-Torn Societies’, \nGlobal Governance, Vol.10, No.1, 2004, pp.7–14, at p.12. \n13 Richard Caplan, International Governance of War-Torn Territories: Rule \nand Reconstruction, Oxford: Oxford University Press, 2005. \n14 James D. Fearon and David D. Laitin, ‘Neotrusteeship and the Problem of \nWeak States’, International Security, Vol.28, No.4, 2004, pp.5–43. \n15 Simon Chesterman, You, the People: the United Nations, Transitional \nAdministration, and State-building, Oxford and New York: Oxford University \nPress, 2004, pp.143–5; David Harland, ‘Legitimacy and Effectiveness in \nInternational Administrations’, Global Governance, Vol.10, No.1, 2004, pp.15–\n19, at p.19. \n 22 \n \n16 Michael Zürn, ‘Global Governance and Legitimacy Problems’, in David Held \nand Mathias Koenig-Archibugi (eds) Global Governance and Public \nAccountability, Oxford: Blackwell, 2005, pp.136–63; Achim Hurrelmann et al., \n(eds) Legitimacy in an Age of Global Politics, Basingstoke: Palgrave \nMacmillan, 2007.  \n17 Jens Steffek, ‘The Legitimation of International Governance: A Discourse \nApproach’, European Journal of International Relations, Vol.9, No.2, 2003, \npp.249–75. \n18 Fritz Scharpf, Governing in Europe: Effective and Democratic, Oxford: \nOxford University Press, 1999, p.6. \n19 William Bain, Between Anarchy and Society: Trusteeship and the \nObligations of Power, Oxford: Oxford University Press, p.191. \n20 Michael Ignatieff, Empire Lite: Nation-building in Bosnia, Kosovo, \nAfghanistan, London: Vintage, 2003. \n21 David Chandler, Empire in Denial: The Politics of State-building, London: \nPluto, 2006, p.190. \n22 Sally Morphet, ‘Current International Civil Administration: The Need for \nPolitical Legitimacy’, International Peacekeeping, Vol.9, No.2, 2002, pp.140–\n62. \n23 Dominik Zaum, The Sovereignty Paradox: The Norms and Politics of \nInternational Statebuilding, Oxford: Oxford University Press, 2007. \n24 E.g., analyses by Caplan (see n.13 above), Chandler (see n. 21 above) and \nZaum (see n. 23 above) are overwhelmingly based on interviews with \ninternational employees of IAs. \n 23 \n \n25 Rodney Barker, Political Legitimacy and the State, Oxford: Clarendon, \n1990, p.27. \n26 Bernhard Knoll, ‘Legitimacy and UN-Administration of Territory’, German \nLaw Journal, Vol.8, No.1, 2007, pp.39–56. \n27 Chesterman (see n.15 above), p.129. \n28 Zaum (see n.23 above), pp.238–9; Paddy Ashdown, Swords And \nPloughshares: Bringing Peace to the 21st Century, London: Weidenfeld & \nNicolson, 2007, Appendix B, pp.234–5. \n29 Béatrice Pouligny, Peace Operations Seen from Below: U.N. Missions And \nLocal People, Bloomfield, CT: Kumarian Press, 2006, p.86. \n30 Ibid,.pp.42–95. \n31 Press conference by the UN Special Envoy Martti Ahtisaari Following the \nHigh Level meeting held in Vienna, 10 Mar. 2007 (at: www.unosek.org). \n32 ‘Letter dated 26 March 2007 from the Secretary-General addressed to the \nPresident of the Security Council’, UN doc., S\/2007\/168, 26 Mar. 2007, \n‘Report of the Special Envoy of the Secretary General on Kosovo’s future \nstatus’, p.2. \n33 Ibid. ‘Addendum: Comprehensive Proposal for the Kosovo Status \nSettlement’, Annex II: The Rights of Communities and their Members and \nAnnex III: Decentralization. pp.18–21,22–31. \n34 Ibid. Annex V: Religious and Cultural Heritage, 38–43. \n35 Ibid. Annex IX: International Civilian Representative, Art.2, p.52. \n 24 \n \n36 Susan Woodward, ‘Compromised Sovereignty to Create Sovereignty: Is \nDayton a Futile Exercise or an Emerging Model’, in Stephen D. Krasner (ed.) \nProblematic Sovereignty: Contested Rules and Problematic Possibilities. New \nYork: Columbia University Press, 2001, pp.252–300. \n37 Renata Goldirova, ‘Kosovo to Aim for ‘Coordinated’ Declaration of \nIndependence’, Euobserver, 7 Dec. 2007 (at: www.euobserver.com).  \n38 Deklarata e Pavarësisë së Kosovës [Declaration of Kosovo’s \nIndependence], 17 Mar. 2008, p.2 (at: www.assembly-kosova.org). \n39 A lifeline for isolated Serbs, Financial Times (London), 13 June 2008 (at: \nwww.ft.com).   \n40 ‘Sejdiu: EU mission shorter than UNMIK’, Koha Ditore (Prishtina), OSCE \nMonitor Final Edition, 25 Apr. 2008. \n41 Enver Hoxhaj, ‘The Politics of Ethnic Conflict Regulation in Kosovo’, The \nCentre for the Study of Global Governance, Discussion Paper 39 (at: \nwww.lse.ac.uk\/Depts\/global\/Publications\/DiscussionPapers\/DP39.pdf). \n42 Author’s interview with an Albanian civil society representative dealing with \ngovernance, 7 Sept. 2007. \n43 Author’s interview with an UNMIK official, Prishtina, 7 Sept. 2007. \n44 Francesco Strazzari, ‘The Decade Horriblis: Organized Violence and \nOrganized Crime along the Balkan Peripheries, 1991–2001’, Mediterranean \nPolitics, Vol.2, No.2, 2007, pp.185–209; Michael Pugh, ‘Crime and capitalism \nin Kosovo’s transformation’, in Tonny Brems Knudsen and Carsten Bagge \nLaustsen, Kosovo between War and Peace, London: Routledge, 2006, \n 25 \n \npp.116–34; Cf. Prvoslav Karanovć, ‘Istrazivanje – Trgovina Srbija-Kosovo: Po \nsumama i gorama’ [Investigation – Kosovo-Serbia trade: Over forests and \nhills], Vreme (Belgrade), No.860, 28 June 2007 (at: www.vreme.com). \n45 Author’s interview with a representative of an Albanian ‘think-tank’, 6 Sept. \n2007. \n46 Iain King and Whit Mason, Peace at any Price: How the World Failed \nKosovo, Ithaca, NY: Cornell University Press, 2006, p.251. \n47 Cf. Andrew Taylor, ‘“We are not asking you to hug each other, but we ask \nyou to co-exist”: The Kosovo Assembly and the Politics of Co-existence’, The \nJournal of Legislative Studies, Vol.11, No.1, 2005, pp.105–37. \n48 Dana H. Allin, ‘Unintended Consequences-Managing Kosovo \nIndependence’, in What Status for Kosovo?, Chaillot Paper 50, European \nInstitute for Security Studies, Paris, Oct. 2001, pp.7–17, at p.9. \n49 Branislav Krstić, Kosovo izmedju istorijskog i etnickog prava [Kosovo \nbetween the historic and ethnic right], Beograd: Kuca vid, 1994.  \n50 Nenad Lj. Stefanović, and Davor Konjikušić, ‘Izbori na Kosovu: Izadji i bori \nse’ [Kosovo elections: Participate and fight], Vreme, No.567, 15 Nov. 2001 (at: \nwww.vreme.com). \n51 European Stability Initiative, ‘The Lausanne Principle: Multi-ethnicity, \nTerritory and the Future of Kosovo’s Serbs’, Berlin\/Pristina, 7 June 2004 (at: \nwww.esiweb.org). \n52 Dafina Myrtaj, ‘Nuk kanë frike’ [They don’t fear], Express (Prishtina), 24 \nFeb. 2008, pp.8–9. \n 26 \n \n53 ‘Parallel Structures in Kosovo’, OSCE Mission in Kosovo and UNMIK, Oct. \n2003 (at: www.osce.org\/documents\/mik\/2003\/10\/698_en.pdf). \n54 Jelena Aleksić and Tanja Matić, ‘Kosovo Serb Political Divisions Grow’, \nBalkan Insight, 25 Sept. 2006 (at: www.balkaninsight.com). \n55 Ljubiša Popović, ‘Srbijo, ne pomaži više!’, [Serbia, don’t help any more!] \nNIN (Belgrade), 4 Nov. 1999 (at: www.nin.co.yu). \n56 Author’s interview with a civil society member and political commentator, \nPrishtina, 7 Sept. 2007. \n57 Author’s interview with a member of the Unity Team, Prishtina, 6 Sept. \n2007. \n58 Gazmend Syla, ‘Public Perceptions of Decentralization’, in ‘Roundtable on \nDecentralization: Proceedings Report’, OSCE Monitor Final Edition, Prishtina, \n20 June 2007, p.19.   \n59 Anna Matveeva and Wolf-Christian Paes, ‘The Kosovo Serbs: An Ethnic \nMinority Between Collaboration and Defiance’, Bonn International Centre for \nConversion, Friedrich Naumann Foundation and Safeworld, June 2003, \npp.29–30. \n60 Mufail Limani, ‘A po copëtohet Kosova?’ [Is Kosovo being partitioned?], \nExpress, 27 Feb. 2008, at p.2. \n61 ‘Organizing against ethnic decentralization’, Vetëvendosje! Newsletter 91 \n(Prishtina), 21 Apr. 2008. \n62 Refki Alija, ‘Odlično se slažemo’ [We get along well], Gradjanski glasnik \n(Prishtina), 20 Apr.-3 May 2007, p.6. \n 27 \n \n63 Author’s interview with OSCE official, Prishtina, 7 Sept. 2007. \n64 The grassroots views were captured by ‘Kosovo Future Status Process: \nKnowledge–Attitudes–Practices (KAP) Survey’, Strategic Marketing \nResearch, Belgrade, and Kosovo Institute for Policy Research and \nDevelopment, Prishtina, 19 July 2006 (at: www.smmri.co.yu).  \n65 ‘Problematic initiative of Pieter Feith’, Zëri (Prishtina), in OSCE Monitor \nFinal Edition, 23 June 2008.   \n66 ‘Public Information on Ahtisaari’s Settlement Document: Analyses and \nrecommendations on Community Roundtables and Public Town Hall \nMeetings’, Advocacy Training & Resource Centre, Prishtina, 6 July 2007. \n67 Key Serbian Orthodox churches have been under NATO protection since \n1999, but did not have a special status as such.  \n68 Interview (see n.57 above). According to the International Crisis Group the \nabsence of Albanians’ input was due to their omission to provide a detailed \nproposal to Ahtisaari and his team. ‘Kosovo: No Good Alternatives to the \nAhtisaari Plan’, International Crisis Group, Report 182, 14 May 2007, p.18 \n69 Interview (see n.45 above). \n70 ‘Kosovo does not Win Everything with Ahtisaari’s Plan’, Koha Ditore, \nOSCE Monitor Final Edition, 13 Aug. 2007.  \n71 ‘Propast plana – državni interes’ [Failure of the plan – the state interest], \nRadio B92 (Belgrade), 28 Mar. 2007 (at: www.b92.net). \n72 Humanitarian aid from Serbia was suddenly withdrawn from dissenting \nindividuals and their families.   \n 28 \n \n73 Author’s interview with Serb journalist in Kosovo, Prishtina, 7 Sept. 2007. \n74 Ibid. \n75‘ Kosovo: Kada će se Srbi dogovoriti’ [Kosovo: When will the Serbs agree], \nRadio B92, 17 Oct. 2005 (at: www.b92.net). . \n76 Anamari Repić, ‘Kosovski Srbi propustili ulogu u statusnom procesu’ \n[Kosovo Serbs without a role in the status process], Gradjanski glasnik \n(Prishtina), 1–14 Jun. 2007, p.8. \n77 ‘Kula Balkana’, Emisija Peščanik, [‘Balkan Tower’, Programme Peščanik] \nRadio B92, 23 Ap. 2008 (at:  www.b92.net).  \n78 ‘Politički lideri kosovskih Srba ne podržavaju Samardžićev predlog \nsporazuma sa Unmikom’, [Kosovo Serb political leaders don’t support \nSamardžić’s draft agreement with UNMIK], Danas (Belgrade) 24 Mar. 2008 \n(at: www.danas.co.yu); Refki Alija, ‘Prizren: Prhivatanje i odbijanje’ [Prizren: \nAccepting and rejecting], Gradjanski glasnik, 9–22 Feb. 2007, p.11. \n79 ‘Serbët e Pejës nuk kundërshtojnë’ [Peja Serbs don’t oppose], Express, 2 \nMar. 2008, p.8. \n80 ‘Serbs divided regarding parallel assembly and cooperation with EULEX’, \nKoha Ditore, OSCE Monitor Final Edition, 23 June 2008.  \n81 ‘Kosovo: No Good Alternatives to the Ahtisaari Plan’ (see n.68 above), \npp.29–36. \n82 ‘Kosovo Human Security Brainstorming’, Minutes, Advocacy Training & \nResource Centre, Prishtina, and LSE Enterprise, London, Batllava, 4–5 Mar. \n2008. \n 29 \n \n83 ‘Coming to Terms with the Problem of Kosovo: The People’s Views from \nKosovo and Serbia’, opinion poll by Colin Irwin for Kosovalajv, Prishtina, \nCentre for Democracy and Reconciliation in Southeastern Europe, \nThessaloniki, and Medijski Centar Beta, Belgrade, 2006 (at: \nwww.cdsee.org\/pdf\/kosovo_serbia_short_report.pdf). \n84 Cf. ‘Kosovo Serbs after the Declaration of Independence: The Right \nMomentum for Confidence Building Measures’, Kosovar Institute for Policy \nResearch and Development, Prishtina, Policy Brief No.8, July 2008. \n85 Author’s interview with a Serb newspaper editor, Prishtina, 5 Sept. 2007. \n86 Author’s interview with a representative of a Klinë\/Klina-based NGO, \nPrishtina, 5 Sept. 2007.  \n87 Sonja Ristić and Zoran Ćulafić, ‘Delegacija Saveta bezbednosti na Kosovu’ \n[UNSC delegation in Kosovo], TV Danas i sutra, UNMIK production, 27 Apr. \n2007.  \n88 Igor Milic, ‘Village for sale’, Balkan Insight, 25 Sept. 2006 (at: \nwww.balkaninsight.com). \n89 Derick W. Brinkerhoff, ‘Introduction – Governance Challenges in Fragile \nStates’, in Brinkerhoff (ed.), Governance in Post-Conflict Societies: Rebuilding \nFragile States, London and New York: Routledge, 2007, pp.1–21, at p.18. \n90 S. Neil MacFarlane and Yuen Foong Khong, Human Security and the UN: A \nCritical History, Indianopolis, IN: Indiana University Press, 2006, p.246. \n \n"}