{"doi":"10.1186\/1745-6215-7-9","coreId":"103720","oai":"oai:eprints.brighton.ac.uk:3396","identifiers":["oai:eprints.brighton.ac.uk:3396","10.1186\/1745-6215-7-9"],"title":"What influences recruitment to randomised controlled trials? A review of trials funded by two UK funding agencies","authors":["McDonald, Alison M.","Knight, Rosemary C.","Campbell, Marion K.","Entwistle, Vikki A.","Grant, Adrian M.","Cook, Jonathan A.","Elbourne, Diana R.","Francis, David","Garcia, Jo","Roberts, Ian","Snowdon, Claire"],"enrichments":{"references":[{"id":1000227,"title":"A: Recruitment to randomised trials: Strategies for Trial Enrolment and Participation Study (STEPS). Methodology Series","authors":[],"date":null,"doi":"10.3310\/hta11480","raw":"Campbell MK, Snowdon C, Francis D, Elbourne D, McDonald A, Knight R, Entwistle V, Garcia J, Roberts I, Grant A: Recruitment to randomised trials: Strategies for Trial Enrolment and Participation Study (STEPS). Methodology Series in press.","cites":null},{"id":1000932,"title":"AJ: Ethical issues in the design and conduct of cluster randomised trials. BMJ","authors":[],"date":"1999","doi":"10.1136\/bmj.318.7195.1407","raw":"Edwards SJL, Braunholtz DA, Lilford R, Stevens AJ: Ethical issues in the design and conduct of cluster randomised trials. BMJ 1999, 318:1407-9.","cites":null},{"id":997163,"title":"Clinical trials: a practical approach Chichester:","authors":[],"date":"1983","doi":"10.1002\/bimj.4710270604","raw":"Pocock S: Clinical trials: a practical approach Chichester: Wiley; 1983.","cites":null},{"id":998665,"title":"Descriptive survey of non-commercial randomised controlled trials in the United Kingdom. BMJ","authors":[],"date":"2003","doi":"10.1136\/bmj.327.7422.1017","raw":"Chalmers I, Rounding C, Lock K: Descriptive survey of non-commercial randomised controlled trials in the United Kingdom. BMJ 2003, 327:1017-20.","cites":null},{"id":1002375,"title":"eds: The Principles and Practices of Clinical Trials Edinburgh: E&S","authors":[],"date":"1970","doi":null,"raw":"Harris EL, Fitzgerald JD, eds: The Principles and Practices of Clinical Trials Edinburgh: E&S Livingstone; 1970.","cites":null},{"id":1003059,"title":"Elbourne D: Making Sense of Randomization; responses of parents of crucially ill babies to random allocation of treatment in a clinical trial. Soc Sci Med","authors":[],"date":"1997","doi":"10.1016\/s0277-9536(97)00063-4","raw":"Snowdon C, Garcia J, Elbourne D: Making Sense of Randomization; responses of parents of crucially ill babies to random allocation of treatment in a clinical trial. Soc Sci Med 1997, 45:1337-55.","cites":null},{"id":999374,"title":"Factors that limit the number, quality and progress of randomised controlled trials. Health Technol Assess","authors":[],"date":"1999","doi":"10.4135\/9781848608344.n3","raw":"Prescott RJ, Counsell CE, Gillespie WJ, Grant AM, Russell IT, Kiauka S, et al.: Factors that limit the number, quality and progress of randomised controlled trials. Health Technol Assess 1999, 3(20):.","cites":null},{"id":1003133,"title":"Hamdy FC: Perceptions of equipoise are crucial to trial participation: a qualitative study of men in the ProtecT study. Controlled Clinical Trials","authors":[],"date":"2003","doi":"10.1016\/s0197-2456(03)00020-5","raw":"Mills N, Donovan JL, Smith M, Jacoby A, Neal DE, Hamdy FC: Perceptions of equipoise are crucial to trial participation: a qualitative study of men in the ProtecT study. Controlled Clinical Trials 2003, 24:272-82.","cites":null},{"id":1001641,"title":"Medical Research Council: Clinical Trials for Tomorrow London:","authors":[],"date":null,"doi":null,"raw":"Medical Research Council: Clinical Trials for Tomorrow London: MRC;","cites":null},{"id":1003789,"title":"MK: Factors impacting on patient participation to a randomised controlled trial [abstract].","authors":[],"date":"2005","doi":null,"raw":"McLeer SK, Entwistle VA, Campbell MK: Factors impacting on patient participation to a randomised controlled trial [abstract]. Journal of Epidemiology and Community Health 2005, 59(Suppl 1):A8.","cites":null},{"id":1004424,"title":"Practical statistics for medical research London:","authors":[],"date":"1999","doi":"10.1177\/096228029200100107","raw":"Altman DG: Practical statistics for medical research London: Chapman & Hall; 1999.","cites":null},{"id":997907,"title":"Research methods in health: investigating health and health services 2nd edition.","authors":[],"date":null,"doi":"10.7748\/ns.29.14.32.s36","raw":"Bowling A: Research methods in health: investigating health and health services 2nd edition. Buckingham, Philadelphia: Open University Press;","cites":null},{"id":1005194,"title":"Three years experience of national coordination and support for cancer trials and the impact on accrual rates: the National Cancer Research Network in England. Clin Trials","authors":[],"date":"2005","doi":null,"raw":"Stead M, Lester N: Three years experience of national coordination and support for cancer trials and the impact on accrual rates: the National Cancer Research Network in England. Clin Trials 2005, 2:S24.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"A commonly reported problem with the conduct of multicentre randomised controlled trials (RCTs) is that recruitment is often slower or more difficult than expected, with many trials failing to reach their planned sample size within the timescale and funding originally envisaged. The aim of this study was to explore factors that may have been associated with good and poor recruitment in a cohort of multicentre trials funded by two public bodies: the UK Medical Research Council (MRC) and the Health Technology Assessment (HTA) Programme.\\ud\nThe cohort of trials was identified from the administrative databases held by the two funding bodies. 114 trials that recruited participants between 1994 and 2002 met the inclusion criteria. The full scientific applications and subsequent trial reports submitted by the trial teams to the funders provided the principal data sources. Associations between trial characteristics and recruitment success were tested using the Chi-squared test, or Fisher's exact test where appropriate.\\ud\nLess than a third (31%) of the trials achieved their original recruitment target and half (53%) were awarded an extension. The proportion achieving targets did not appear to improve over time. The overall start to recruitment was delayed in 47 (41%) trials and early recruitment problems were identified in 77 (63%) trials. The inter-relationship between trial features and recruitment success was complex. A variety of strategies were employed to try to increase recruitment, but their success could not be assessed.\\ud\nRecruitment problems are complex and challenging. Many of the trials in the cohort experienced recruitment difficulties. Trials often required extended recruitment periods (sometimes supported by additional funds). While this is of continuing concern, success in addressing the trial question may be more important than recruitment alone","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:3396<\/identifier><datestamp>\n      2014-10-22T10:47:09Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4E303030:4E323030:4E323130:4E323135<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/3396\/<\/dc:relation><dc:title>\n        What influences recruitment to randomised controlled trials? A review of trials funded by two UK funding agencies<\/dc:title><dc:creator>\n        McDonald, Alison M.<\/dc:creator><dc:creator>\n        Knight, Rosemary C.<\/dc:creator><dc:creator>\n        Campbell, Marion K.<\/dc:creator><dc:creator>\n        Entwistle, Vikki A.<\/dc:creator><dc:creator>\n        Grant, Adrian M.<\/dc:creator><dc:creator>\n        Cook, Jonathan A.<\/dc:creator><dc:creator>\n        Elbourne, Diana R.<\/dc:creator><dc:creator>\n        Francis, David<\/dc:creator><dc:creator>\n        Garcia, Jo<\/dc:creator><dc:creator>\n        Roberts, Ian<\/dc:creator><dc:creator>\n        Snowdon, Claire<\/dc:creator><dc:subject>\n        N215 Change and Innovation<\/dc:subject><dc:description>\n        A commonly reported problem with the conduct of multicentre randomised controlled trials (RCTs) is that recruitment is often slower or more difficult than expected, with many trials failing to reach their planned sample size within the timescale and funding originally envisaged. The aim of this study was to explore factors that may have been associated with good and poor recruitment in a cohort of multicentre trials funded by two public bodies: the UK Medical Research Council (MRC) and the Health Technology Assessment (HTA) Programme.\\ud\nThe cohort of trials was identified from the administrative databases held by the two funding bodies. 114 trials that recruited participants between 1994 and 2002 met the inclusion criteria. The full scientific applications and subsequent trial reports submitted by the trial teams to the funders provided the principal data sources. Associations between trial characteristics and recruitment success were tested using the Chi-squared test, or Fisher's exact test where appropriate.\\ud\nLess than a third (31%) of the trials achieved their original recruitment target and half (53%) were awarded an extension. The proportion achieving targets did not appear to improve over time. The overall start to recruitment was delayed in 47 (41%) trials and early recruitment problems were identified in 77 (63%) trials. The inter-relationship between trial features and recruitment success was complex. A variety of strategies were employed to try to increase recruitment, but their success could not be assessed.\\ud\nRecruitment problems are complex and challenging. Many of the trials in the cohort experienced recruitment difficulties. Trials often required extended recruitment periods (sometimes supported by additional funds). While this is of continuing concern, success in addressing the trial question may be more important than recruitment alone.<\/dc:description><dc:publisher>\n        BioMed Central<\/dc:publisher><dc:date>\n        2006<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/3396\/1\/What_Influences_Recruitment_to_Randomised_Controlled_Trials%3F.pdf<\/dc:identifier><dc:identifier>\n          McDonald, Alison M., Knight, Rosemary C., Campbell, Marion K., Entwistle, Vikki A., Grant, Adrian M., Cook, Jonathan A., Elbourne, Diana R., Francis, David, Garcia, Jo, Roberts, Ian and Snowdon, Claire  (2006) What influences recruitment to randomised controlled trials? A review of trials funded by two UK funding agencies  Trials, 7 (9).   ISSN 1745-6215     <\/dc:identifier><dc:relation>\n        10.1186\/1745-6215-7-9<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/3396\/","10.1186\/1745-6215-7-9"],"year":2006,"topics":["N215 Change and Innovation"],"subject":["Journal article","PeerReviewed"],"fullText":"BioMed Central\nPage 1 of 8\n(page number not for citation purposes)\nTrials\nOpen AccessResearch\nWhat influences recruitment to randomised controlled trials? A \nreview of trials funded by two UK funding agencies\nAlison M McDonald*1, Rosemary C Knight2, Marion K Campbell1, \nVikki A Entwistle1, Adrian M Grant1, Jonathan A Cook1, Diana R Elbourne2, \nDavid Francis3, Jo Garcia2, Ian Roberts2 and Claire Snowdon2\nAddress: 1Health Services Research Unit, University of Aberdeen, Polwarth Building, Foresterhill, Aberdeen, UK, 2Medical Statistics Unit, London \nSchool of Hygiene and Tropical Medicine, Keppel Street, London, UK and 3Centre for Research and Innovation Management, Brighton\nEmail: Alison M McDonald* - a.mcdonald@abdn.ac.uk; Rosemary C Knight - Rosemary.Knight@lshtm.ac.uk; \nMarion K Campbell - m.k.campbell@abdn.ac.uk; Vikki A Entwistle - V.A.Entwistle@dundee.ac.uk; Adrian M Grant - a.grant@abdn.ac.uk; \nJonathan A Cook - j.a.cook@abdn.ac.uk; Diana R Elbourne - diana.elbourne@lshtm.ac.uk; David Francis - d.l.francis@brighton.ac.uk; \nJo Garcia - j.garcia@ioe.ac.uk; Ian Roberts - Ian.Roberts@lshtm.ac.uk; Claire Snowdon - cms1000@cam.ac.uk\n* Corresponding author    \nAbstract\nBackground: A commonly reported problem with the conduct of multicentre randomised\ncontrolled trials (RCTs) is that recruitment is often slower or more difficult than expected, with\nmany trials failing to reach their planned sample size within the timescale and funding originally\nenvisaged. The aim of this study was to explore factors that may have been associated with good\nand poor recruitment in a cohort of multicentre trials funded by two public bodies: the UK Medical\nResearch Council (MRC) and the Health Technology Assessment (HTA) Programme.\nMethods: The cohort of trials was identified from the administrative databases held by the two\nfunding bodies. 114 trials that recruited participants between 1994 and 2002 met the inclusion\ncriteria. The full scientific applications and subsequent trial reports submitted by the trial teams to\nthe funders provided the principal data sources. Associations between trial characteristics and\nrecruitment success were tested using the Chi-squared test, or Fisher's exact test where\nappropriate.\nResults: Less than a third (31%) of the trials achieved their original recruitment target and half\n(53%) were awarded an extension. The proportion achieving targets did not appear to improve\nover time. The overall start to recruitment was delayed in 47 (41%) trials and early recruitment\nproblems were identified in 77 (63%) trials. The inter-relationship between trial features and\nrecruitment success was complex. A variety of strategies were employed to try to increase\nrecruitment, but their success could not be assessed.\nConclusion: Recruitment problems are complex and challenging. Many of the trials in the cohort\nexperienced recruitment difficulties. Trials often required extended recruitment periods\n(sometimes supported by additional funds). While this is of continuing concern, success in\naddressing the trial question may be more important than recruitment alone.\nPublished: 07 April 2006\nTrials 2006, 7:9 doi:10.1186\/1745-6215-7-9\nReceived: 20 December 2005\nAccepted: 07 April 2006\nThis article is available from: http:\/\/www.trialsjournal.com\/content\/7\/1\/9\n© 2006 McDonald et al; licensee BioMed Central Ltd.\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 2 of 8\n(page number not for citation purposes)\nBackground\nRandomised controlled trials (RCTs) are widely accepted\nas the gold standard for evaluating healthcare interven-\ntions [1,2] and decision makers are increasingly looking\nto the results of RCTs to guide practice. RCTs are a major,\nincreasing component of both NHS-supported and non-\ncommercially funded research[3]. Recruitment is often\nslower or more difficult than expected, with many trials\nfailing to reach their planned sample size within the\ntimescale and funding originally envisaged. If the target\nsample size is not achieved, results will usually be less reli-\nable. If recruitment has to be extended to reach the\nrequired sample size, this usually costs more and the use\nof the results in clinical practice will be delayed.\nThe reasons why certain trials recruit well while others do\nnot remain unclear[4]. To investigate this the UK NHS\nR&D National Methodology Programme and the UK\nMedical Research Council (MRC) funded a project – Strat-\negies for Trials Enrolment and Participation Study\n(STEPS) considering three aspects of recruitment: a review\nof a cohort of trials funded by both organisations; case\nstudies of trials which appeared to have particularly inter-\nesting lessons for recruitment (exemplars); and an in-\ndepth case study of one large multicentre trial to examine\nthe feasibility of applying a business-orientated analytical\nframework. This paper describes the review of the cohort\nof trials, which explored factors that may have influenced\nrecruitment and concentrated on issues relating to the\nresearchers and clinicians conducting the trials. Full\ndetails of the project are published elsewhere[5].\nThe objectives of the review were to:\n• characterise the trials in terms of the settings, interven-\ntions and outcomes studied;\n• characterise the factors thought likely to affect success of\nrecruitment including level of funding, complexity of trial\ndesign, involvement of a trials support unit etc;\n• describe patterns of recruitment (such as to original plan\nor better, slower start than anticipated, recruitment with\nidentifiable change-points etc); and\n• note trialists' reports of factors perceived to be associated\nwith good or poor recruitment (eg delays in obtaining\nfunding or research ethics approval) and strategies\nattempted to improve recruitment.\nMethods\nTrial identification\nTrials were identified from the administrative databases\nheld by the two funding bodies. Trials were eligible for\ninclusion if:\n• they involved more than one clinical centre;\n• recruitment started on or after 1 January 1994 (this cut-\noff was chosen as the HTA Programme was established\nduring 1993); and\n• recruitment was originally planned to close on or before\n31 December 2002. Trials that were awarded an extension\nto the recruitment phase beyond 31 December 2002 were\nincluded if they had closed to recruitment at the time of\ndata extraction.\nCluster trials were excluded as recruitment issues are often\ndifferent compared with individually randomised tri-\nals[6].\nDevelopment of hypotheses\nA priori hypotheses were developed about factors that\nmight affect recruitment, related to issues in previous lit-\nerature reviews [4] and insights gained from the MRC clin-\nical trials enquiry[7].\nData extraction\nApplication forms and progress reports were examined at\nthe central offices of the two funders following notifica-\ntion to the appropriate principal investigators (PIs).\nAccess was subject to confidentiality safeguards.\nA data extraction form was developed to facilitate system-\natic collection of information under six main topic head-\nings: 1) trial identifying details; 2) trial administrative\ndetails (eg dates of commencement, start of recruitment);\n3) trial features (eg if there was a formal pilot phase, if\nthere was a dedicated trial manager); 4) finance; 5)\nrecruitment summary (eg original target, any revisions,\nfinal recruitment numbers); and 6) description of delay or\nfailure to reach recruitment targets (eg any delays to\nrecruitment, strategies used to improve recruitment). The\ndata extraction form and procedures were piloted on eight\ntrials. Minor modifications were made before proceeding.\nWhere information was not recorded or unclear, reports\nof the specific trials held on the Current Controlled Trials\nmeta-register of randomised trials http:\/\/www.controlled-\ntrials.com and the NCCHTA website http:\/\/\nwww.ncchta.org were searched to augment the dataset.\nSome PIs and trial managers were also asked to provide\nadditional information.\nResults\nOne hundred and fourteen trials fulfilled the inclusion\ncriteria. Forty-one (36%) trials were funded by the HTA\nProgramme and 73 (64%) by the MRC. Five of these,\nalthough presented under single project banners, were\nfound to represent a number of sub-trials, each with their\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 3 of 8\n(page number not for citation purposes)\nown individual sample size targets and individual recruit-\nment issues. For the purposes of describing the trial fea-\ntures, the denominator is based on the number of\nrecorded 'projects', ie 114, to reflect the fact that trial\nteams were common across sub-trials. For the analysis of\nrecruitment issues, however, we treated the sub-trials sep-\narately, using the denominator of 122 trials.\nOverall trial features\nTable 1 describes features of the trials. Sixty trials (53%)\nhad conducted a formal pilot study. Of these, 32 indicated\nthe pilot study had led to a change in recruitment strategy\nfor the main trial. The most common changes noted were\nthat: written trial materials were modified (8 trials); the\ntrial design was changed (6 trials); changes were made to\nthe inclusion criteria (4 trials); the recruitment target was\nchanged (4 trials); and, the number of sites was increased\n(4 trials). Most trials (78%) were conducted from a trials\nunit and 92% involved multidisciplinary teams. No trial\nhad a consumer as a grant applicant although 9 trials had\nsome form of consumer involvement during the trial.\nFunding ranged from £16 per planned participant to\n£4522 with a median of £641. The trials in our cohort\nstarted recruitment during the period 1994–2002. During\nthis time, most trials only included research costs. How-\never for some early trials treatment\/support costs were not\ndistinguishable from research costs due to the costing\nstructure used for grants at that time. Twenty-four (24\/89,\n29%) trials were awarded a 'good' level of funding\n(defined as more than £1000 per planned participant, def-\ninition generated through consensus with the project\nmanagement group members).\nIndividual trial features\nTable 2 summarises the characteristics of the 122 trials,\nincluding design features, clinical area, setting and inter-\nventions. The majority of the trials were simple parallel\ngroup trials (113, 93%). Most were two-arm (94, 77%)\ntrials, mainly representing cancer (25, 20%), mental\nhealth (21, 17%) and orthopaedics\/rheumatology (21,\n17%). Approximately half (64, 53%) of the trials were in\na hospital setting.\nRecruitment\nRecruitment targets varied from 60 to 66,000 participants.\nTable 3 summarises actual recruitment in relation to these\ntargets. Thirty-eight (31%) trials 'successfully' recruited (!\n100% of their original target). A further 29 (24%) trials\nachieved a recruitment rate of greater than 80% but less\nthan 100% of their original target.\nIn 42 (34%) trials the recruitment target was revised dur-\ning the trial. The target was revised in a downward direc-\ntion in 36 (86%) of the 42. Only 19 (19\/42, 45%) trials\nwhose targets were revised were known to have success-\nfully recruited to their new target.\nEnrolment was halted before the formal end of the recruit-\nment period in 14 (14\/122, 11%) trials. In 11 this deci-\nsion related to poor recruitment. In the three others, early\ntermination followed a recommendation from a data\nTable 1: Descriptive features of trials and disciplines represented amongst trial investigators\nTrial feature Valid N Yes\n n (%)\nNo\n n (%)\nNot known\n n (%)\nTrial had pilot study 114 60 (53) 41 (36) 13 (11)\n•Was pilot funded? 60 35 (58) 4 (7) 21 (35)\n•Was there a change in \nrecruitment strategy because \nof pilot study?\n60 32 (53) 5 (8) 23 (39)\nTrial co-ordinated from \ntrials unit\n114 89 (78) 25 (22)\nTrial had dedicated trial \nmanager\n114 86 (75) 14 (12) 14 (12)\nTrial had paid local staff \navailable\n114 61 (54) 31 (27) 22 (19)\nDisciplines 113*\nMultidisciplinary 104 (92) 9 (8)\nConsumer - 113 (100)\nEconomics 66 (58) 47 (42)\nHSR 35 (31) 78 (69)\nMedical\/Dentist 109 (96) 4 (3)\nNursing 22 (19) 91 (80)\nStatistics 83 (73) 30 (26)\nOther 17 (15) 96 (85)\n* Data was missing for one trial\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 4 of 8\n(page number not for citation purposes)\nmonitoring committee that there were clear differences\nbetween the trial groups. However, in two of these, the\nrecruitment period had already been extended beyond\nthat originally specified.\nSixty-six (54%) trials requested an extension to the trial\ngrant to complete the original trial and, in all but one,\neither a time plus grant extension (42, 64%), a time-only\nextension (15, 23%) or a supplementary grant only (8,\n12%) was awarded. Thirteen trials recruited their original\ntarget after a time extension.\nFigure 1 describes recruitment success by year of trial com-\nmencement. Six of the fifteen trials (40%) that com-\nmenced recruitment in 1994 recruited to, or above, 100%\nof their original recruitment target. Lower proportions of\ntrials achieved their targets amongst those started in the\nlate 1990s.\nDelays to recruitment\nThe start of recruitment was delayed in 47 (41%) of trials\n(data not shown). Main reasons cited were: delays related\nto central trial staff (11 trials); local research staff (11 tri-\nals); and local clinical arrangements (seven trials). Other\nreasons identified included: delays with ethics; supply of\nstudy drugs\/placebo; development of clinical guidelines\nimpacting on the trial; PI moving; adverse publicity about\nresearch; and publication of conflicting research.\nEighty six (75%) trialists indicated at the application stage\nthat they had pre-identified trial centres. In 17 cases some\npre-identified centres did not participate as planned.\nThere was no common reason for this, although the issue\nof problems with \"treatment\" and \"service support\" costs\nwere raised in three cases. Thirty-seven (32%) trialists\nindicated that they encountered delay in bringing in some\nof the pre-identified centres. Reported reasons included:\nproblems with costs\/funding (13 trials); delays in the\nrecruitment of staff (12 trials); and changes with the Mul-\nticentre Research Ethics Committee (MREC) system (6 tri-\nTable 3: Recruitment in trials\nN n (%)\nRecruited successfully 122\nYes 38 (31.1)\nNo 84 (68.9)\nWas recruitment target revised 122\nYes 42 (34.4)\nNo 76 (62.3)\nMissing 4 (3.3)\nFinal recruitment figure\nOriginal target: 122\n! 100% 38 (31.1)\n! 80% but < 100% 29 (23.8)\n< 80% 55 (45.1)\nRevised target: 42\n! 100% 19 (45.2)\n! 80% but < 100% 15 (35.7)\n< 80% 8 (19.1)\nTable 2: Characteristics of the trials\nCharacteristic N n (%)\nDesign: 122\nParallel 113 (93)\nFactorial 6 (5)\nPartially randomised patient preference 3 (2)\nNumber of arms: 122\nTwo 94 (77)\nThree 18 (15)\nMore than three 10 (8)\nClinical areas: 122\nCancer 25 (20)\nMental health (including neurosciences\/\npsychiatry\/psychology)\n21 (17)\nOrthopaedics\/rheumatology (including back pain) 21 (17)\nObstetrics & Gynaecology 9 (7)\nPrimary care 8 (7)\nCardiology 5 (4)\nGastroenterology 5 (4)\nIncontinence\/urology 5 (4)\nHIV\/AIDS 5 (4)\nOther 18 (15)\nSetting: 122\nHospital 64 (53)\nGeneral practice 26 (21)\nMixed 16 (13)\nCommunity 7 (6)\nMissing 9 (7)\nGeographical spread: 122\nMultiple regions 63 (52)\nRegional 51 (42)\nMissing 8 (7)\nAny recruiting centres outside UK: 114\nNo 88 (77)\nYes 25 (22)\nMissing 1 (1)\nInterventions: 122\nMedical (drugs, injections) excluding \nchemotherapy\n37 (30)\nBehavioural therapies (eg CBT with or without \nconventional drugs)\n12 (10)\nDifferent types of surgical intervention (including \nlaparoscopic)\n12 (10)\nChemotherapy 10 (8)\nNew services\/treatment policy\/information \nprovision (eg support programmes)\n9 (7)\nRadiology (including ultrasound) 8 (7)\nMedical instruments (eg metal stents, \npacemakers, bandage types)\n7 (6)\nSurgery v alternative (eg conservative \nmanagement, radiotherapy)\n4 (3)\nAlternative therapies (including complementary \nmedicine, water-based therapies)\n4 (3)\nOther 19 (16)\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 5 of 8\n(page number not for citation purposes)\nals). Fifty-two (45%) trials recruited new centres to ensure\nthe delivery of the trial.\nOnce centres were enrolled, early recruitment (within the\nfirst 25% of scheduled recruiting time) was reported to be\nslower than anticipated in 77 (63%) trials. Common rea-\nsons for this were: fewer eligible patients than expected\n(19 trials); internal problems eg with staff (18 trials); and\na smaller percentage of patients agreeing to participate\nthan was expected (16 trials). Other problems included:\neligible patients missed (10 trials); external problems eg\npublicity (8 trials); funding issues (5 trials) and issues\nwith procedures\/interventions eg randomisation or pla-\ncebo (5 trials).\nDelays to later recruitment (within the last approximate\n75% of recruiting time) were reported in 46 (38%) trials.\nThe most common reasons noted in this phase were:\ninternal problems eg staff (10 trials); fewer patients agree-\ning to participate than expected (9 trials); fewer eligible\npatients than anticipated (7 trials); and external prob-\nlems, particularly with publicity (7 trials). Numerous\nRecruitment success related to year trial commencedFigure 1\nRecruitment success related to year trial commenced.\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 6 of 8\n(page number not for citation purposes)\nother problems included: funding difficulties (5 trials);\nconflicts with other trials (5 trials); and long waiting lists\n(3 trials).\nRelationships between trial features and successful \nrecruitment\nTrial features that were pre-specified as likely to enhance\nthe chances of successful recruitment are presented in\nTable 4. An association suggesting that the factor\nincreased successful recruitment is indicated by an odds\nratio (OR) of greater than unity. Only trials for which the\ninformation was known were included. Confidence inter-\nvals (CIs) around the OR estimates were wide, reflecting\nthe maximum sample size (122). Some of the comparison\ncells had very few data (eg number with a complex design\nand number with consumer input). There were marginally\nstatistically significant associations with MRC funding,\nbeing a cancer trial, and with not having paid local trial\ncoordinators.\nReported strategies for improving recruitment\nSeventy-three trials reported using a variety of strategies to\nimprove recruitment (Table 5). The most common was\nthe use of newsletters and mail shots, both to clinical staff\nand patients. Ten per cent of the trials reported that inclu-\nsion criteria were changed or the protocol amended to\nimprove recruitment.\nDiscussion\nData from two historical cohorts of trials has shown that\nfailure to achieve projected targets for recruitment has\nbeen common amongst multicentre trials supported by\nthe main funders of trials in the UK.\nFewer than one third recruited to 100% of their original\ntarget, and 45% failed to recruit to within 80% of target.\nFactors associated with successful recruitment were that\none or more intervention was only available inside the\ntrial, having a dedicated trial manager, and being a cancer\nor a drug trial. These findings should be interpreted cau-\ntiously; CIs were wide, associations were only marginally\nstatistically significant for some variables, and the trend\nfor some factors was towards a negative association. Com-\nmonly reported strategies to improve recruitment were\nnewsletters and mail shots, but it was not possible to\nassess whether they were causally linked to changes in\nrecruitment.\nThe anticipated recruitment period was extended for\naround half of trials, usually supported by a supplemen-\ntary grant. Delays were experienced at all stages of recruit-\nment. The most commonly reported problem with early\nrecruitment was that fewer than expected eligible patients\nwere being observed. This phenomenon, known as \"Lasa-\ngna's Law\" – where researchers and clinicians invariably\noverestimate the number of patients available for study\nparticipation – has been observed by a number of com-\nmentators[8]. Factors thought to be potentially associated\nwith successful recruitment were relatively uninformative.\nThe CIs around the estimated ORs were all wide and too\nimprecise to allow judgement about possible causal rela-\ntionships.\nA major strength of this study was that it included a sys-\ntematically identified, complete cohort of trials funded by\nthe two major UK public funding bodies in the field of\nhealth care and drew on previously confidential routine\nprogress reports submitted over the course of a trial by the\ninvestigators. The trials represented a wide spectrum of\nTable 4: Associations between features and recruitment success\nFeature Valid N Trials with feature\nthat recruited\nsuccessfully* n (%)\nTrials that didn't\nhave feature that\nrecruited\nsuccessfully* n (%)\nOdds Ratio 95%CI p-value\nLocal recruitment coordinators 100 15\/69 (22) 14\/31 (45) 0.34 0.14, 0.84 0.017\nSimple design 122 35\/116 (30) 3\/6 (50) 0.43 0.06, 3.41 0.374\nSupport from a trials unit 122 27\/94 (29) 11\/28 (39) 0.62 0.26, 1.50 0.289\nMultidisciplinary input 113 34\/104 (33) 3\/9 (33) 0.97 0.19, 6.36 0.615\nPilot phase 109 18\/66 (27) 11\/43 (26) 1.09 0.46, 2.61 0.845\nGood level of funding 89 7\/24 (29) 17\/65 (26) 1.16 0.41, 3.29 0.776\nDrug trial 122 19\/53 (36) 19\/69 (28) 1.47 0.68, 3.18 0.326\nInterventions only available inside the trial 112 7\/18 (39) 26\/94 (28) 1.66 0.58, 4.76 0.338\nConsumer input 107 4\/9 (44) 26\/91 (29) 2.00 0.36, 10.05 0.446\nFunded by the MRC 122 28\/74 (38) 10\/48 (21) 2.31 1.00, 5.36 0.048\nCancer trial 122 12\/24 (50) 26\/98 (27) 2.77 1.11, 6.93 0.026\nDedicated trial manager 107 32\/91 (35) 2\/16 (13) 3.80 0.79, 36.14 0.087\n* ! 100% of original target\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 7 of 8\n(page number not for citation purposes)\nclinical areas, clinical settings and geographical centres.\nHowever, participants' perceptions of what makes a trial\nattractive to join could not be elicited. The results of our\nstudy complement the more in-depth qualitative investi-\ngations which have tried to specifically address partici-\npants' perceptions[9-11].\nRecruitment can be viewed as a surrogate measure of\nother, less easily quantifiable, but arguably more signifi-\ncant measures of trial success, such as 'impact on clinical\npractice', or the extent to which the trial question has been\naddressed. Other parameters should also be taken into\naccount, such as rates of participant retention and treat-\nment compliance.\nWe hoped to identify factors associated with successful\nrecruitment to provide a means of predicting or enhanc-\ning the chances of success. However, comparative analyses\nyielded few insights, because of the choice of outcome\nand exposure variables, and because of imprecision\naround the estimates of association. Some factors (such as\nthe intervention only being available inside the trial, hav-\ning a dedicated trial manager, and being a cancer trial or a\ndrug trial) may be associated with successful recruitment,\nthese results were also (with the possible exception of can-\ncer trials) compatible with there being no association.\nOther analyses showed that some features expected to\nenhance recruitment were less commonly observed in\n'successful' trials than in unsuccessful trials. This applied\nin particular to 'local paid recruitment coordinators', but\nan alternative explanation for this negative association is\nthat the relationship comparison is confounded by other\nfactors such as the complexity of the trial and the years\nwhen it was undertaken. As many of the variables are\npotentially correlated a multivariable analysis would have\nbeen desirable. We did not have sufficient power to\nundertake this analysis – experts suggest that there should\nbe at least ten observations in the dataset for each poten-\ntial explanatory variable to be included in the model[12].\nAs indicated above, there was evidence that cancer trials\nwere associated with better rates of successful recruitment\ncompared with non-cancer trials. The National Cancer\nResearch Network (NCRN) was established by the Depart-\nment of Health in April 2001 to improve the infrastruc-\nture within the NHS for clinical research in cancer in\nEngland (most of the trials included in our study had\ncompleted recruitment before this initiative had been\nestablished). There has been a doubling of the recruit-\nment rate to cancer trials since the inception of the\nNCRN[13]. Building on this success, the recently formed\nUK Clinical Research Network http:\/\/www.ukcrn.org.uk\nwill continue the aim of improving the speed, quality and\nintegration of research, initially within the existing NHS\nnetworks in cancer and mental health and new ones in the\npriority areas of medicines for children, stroke, diabetes\nand Alzheimer's disease.\nConclusion\nThis study highlights the challenges of recruiting to RCTs\nand provides a valuable overview of trialists' attempts to\novercome them. Despite the growing literature summaris-\ning barriers and facilitators to recruitment published in\nthe 1990s (exemplified by the HTA review by Prescott [4])\nonly 55% of the trials recruited to within 80% of the orig-\ninal target and the situation does not seem to have\nimproved over time. It is clear that recruitment to trials is\na complex problem. The two other components of STEPS\nconsidering lessons from exemplar trials and from a busi-\nness perspective will be reported elsewhere.\nCompeting interests\nMC, DE, IR, JG, AG and AM all hold research grants for\nmulticentre trials from the MRC and, or, the HTA Pro-\ngramme. AM and RK have received salary support from\nMRC trial grants in the past.\nAuthors' contributions\nAll STEPS Group members contributed to the project – the\nidea for the study was jointly conceived by the Principal\nInvestigator, Marion Campbell (MKC) (guarantor), with\nAdrian Grant (AMG), Vikki Entwistle (VAE), Diana\nElbourne (DE), Jo Garcia (JG), Claire Snowdon (CS), Ian\nTable 5: Most commonly reported strategies to improve \nrecruitment (N = 122)\nSTRATEGY No. trials\nNewsletters\/mail shots\/flyers (to clinical staff and\/or \npatients)\n26\nRegular visits\/phone calls to wards\/sites\/practices 15\nPosters\/information leaflets in clinics\/wards\/notes 13\nInclusion criteria changed\/protocol amended 12\nPresentations to appropriate groups eg at consultant \nmeetings\/community based physiotherapists etc\n10\nResource manual for site staff\/trained staff in disease \narea\/procedures being investigated\/role play exercises\/\nstudy day\/workshops for recruiters\n10\nAdvertisement\/articles in newspapers\/journals; radio \ninterviews\n8\nPresentations at national\/international meetings 6\nEmployed extra staff 6\nInvestigators'\/recruiting staff meetings 5\nTraining\/information videos 4\nIncentives for recruiters eg prize draw, chocolates etc 4\nTrial material revised\/simplified\/customised for specific \nsites\n4\nVisits to centres by PIs\/senior members of study group 3\nRepeated contact by phone\/letter to individuals\/sites 3\nIncreased\/changed time points when information \nprovided to potential participants\n3\nSupportive statements from opinion leaders 3\nNote Only those reported by 3 or more trials are listed\nPublish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\nTrials 2006, 7:9 http:\/\/www.trialsjournal.com\/content\/7\/1\/9\nPage 8 of 8\n(page number not for citation purposes)\nRoberts (IR) and David Francis (DF). Alison McDonald\n(AMM) and Rosemary Knight (RCK), together with the\nother STEPS members, helped to design the study and did\nthe data extraction. Jonathan Cook (JAC) undertook the\nanalysis and, together with all group members, interpreta-\ntion of data. All authors contributed to the final manu-\nscript.\nAcknowledgements\nWe would like to thank the National Coordinating Centre for Research \nMethodology for commissioning this research; the MRC and DH for pro-\nviding funding; the MRC and HTA Programme for providing documentary \nmaterial and facilitating access to the PIs of trials. The Health Services \nResearch Unit in Aberdeen is core funded by the Chief Scientist Office of \nthe Scottish Executive Health Department. The views expressed are those \nof the authors.\nReferences\n1. Pocock S: Clinical trials: a practical approach Chichester: Wiley; 1983. \n2. Bowling A: Research methods in health: investigating health and health\nservices 2nd edition. Buckingham, Philadelphia: Open University Press;\n2002. \n3. Chalmers I, Rounding C, Lock K: Descriptive survey of non-com-\nmercial randomised controlled trials in the United Kingdom.\nBMJ 2003, 327:1017-20.\n4. Prescott RJ, Counsell CE, Gillespie WJ, Grant AM, Russell IT, Kiauka\nS, et al.: Factors that limit the number, quality and progress of\nrandomised controlled trials.  Health Technol Assess 1999, 3(20):.\n5. Campbell MK, Snowdon C, Francis D, Elbourne D, McDonald A,\nKnight R, Entwistle V, Garcia J, Roberts I, Grant A: Recruitment to\nrandomised trials: Strategies for Trial Enrolment and Partic-\nipation Study (STEPS).  Methodology Series  in press.\n6. Edwards SJL, Braunholtz DA, Lilford R, Stevens AJ: Ethical issues in\nthe design and conduct of cluster randomised trials.  BMJ\n1999, 318:1407-9.\n7. Medical Research Council: Clinical Trials for Tomorrow London: MRC;\n2003. \n8. Harris EL, Fitzgerald JD, eds: The Principles and Practices of Clinical Trials\nEdinburgh: E&S Livingstone; 1970. \n9. Snowdon C, Garcia J, Elbourne D: Making Sense of Randomiza-\ntion; responses of parents of crucially ill babies to random\nallocation of treatment in a clinical trial.  Soc Sci Med 1997,\n45:1337-55.\n10. Mills N, Donovan JL, Smith M, Jacoby A, Neal DE, Hamdy FC: Per-\nceptions of equipoise are crucial to trial participation: a qual-\nitative study of men in the ProtecT study.  Controlled Clinical\nTrials 2003, 24:272-82.\n11. McLeer SK, Entwistle VA, Campbell MK: Factors impacting on\npatient participation to a randomised controlled trial\n[abstract].  Journal of Epidemiology and Community Health 2005,\n59(Suppl 1):A8.\n12. Altman DG: Practical statistics for medical research London: Chapman &\nHall; 1999. \n13. Stead M, Lester N: Three years experience of national coordi-\nnation and support for cancer trials and the impact on\naccrual rates: the National Cancer Research Network in\nEngland.  Clin Trials 2005, 2:S24.\n"}