{"doi":"10.1111\/j.1745-3933.2005.00067.x","coreId":"65896","oai":"oai:dro.dur.ac.uk.OAI2:4219","identifiers":["oai:dro.dur.ac.uk.OAI2:4219","10.1111\/j.1745-3933.2005.00067.x"],"title":"Constraints on the dark energy equation of state from the imprint of baryons on the power spectrum of  clusters.","authors":["Angulo,  R.","Baugh,  C. M.","Frenk,  C. S.","Bower,  R. G.","Jenkins,  A. R.","Morris,  S. L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-01","abstract":"Acoustic oscillations in the baryon–photon fluid leave a signature in the matter power spectrum. The overall shape of the spectrum and the wavelength of the oscillations depend upon the sound horizon scale at recombination. Using the Λ cold dark matter Hubble Volume simulation, we show that the imprint of baryons is visible in the power spectrum of cluster-mass dark matter haloes, in spite of significant differences between the halo power spectrum and the prediction of linear perturbation theory. A measurement of the sound horizon scale can constrain the dark energy equation of state. We show that a survey of clusters at intermediate redshift (z 1), like the Sunyaev–Zel'dovich survey proposed by the South Pole Telescope or a red sequence photometric survey with VISTA or the Dark Energy Survey, could potentially constrain the sound horizon scale to an accuracy of 2 per cent, in turn fixing the ratio of the pressure of the dark energy to its density (w) to better than 10 per cent. Our approach does not require knowledge of the cluster mass, unlike those that depend upon the abundance of clusters","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65896.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4219\/1\/4219.pdf","pdfHashValue":"66e56262582c18291a90a452212acd10bdb4e9e3","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4219<\/identifier><datestamp>\n      2014-07-28T19:34:49Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Constraints on the dark energy equation of state from the imprint of baryons on the power spectrum of  clusters.<\/dc:title><dc:creator>\n        Angulo,  R.<\/dc:creator><dc:creator>\n        Baugh,  C. M.<\/dc:creator><dc:creator>\n        Frenk,  C. S.<\/dc:creator><dc:creator>\n        Bower,  R. G.<\/dc:creator><dc:creator>\n        Jenkins,  A. R.<\/dc:creator><dc:creator>\n        Morris,  S. L.<\/dc:creator><dc:description>\n        Acoustic oscillations in the baryon–photon fluid leave a signature in the matter power spectrum. The overall shape of the spectrum and the wavelength of the oscillations depend upon the sound horizon scale at recombination. Using the Λ cold dark matter Hubble Volume simulation, we show that the imprint of baryons is visible in the power spectrum of cluster-mass dark matter haloes, in spite of significant differences between the halo power spectrum and the prediction of linear perturbation theory. A measurement of the sound horizon scale can constrain the dark energy equation of state. We show that a survey of clusters at intermediate redshift (z 1), like the Sunyaev–Zel'dovich survey proposed by the South Pole Telescope or a red sequence photometric survey with VISTA or the Dark Energy Survey, could potentially constrain the sound horizon scale to an accuracy of 2 per cent, in turn fixing the ratio of the pressure of the dark energy to its density (w) to better than 10 per cent. Our approach does not require knowledge of the cluster mass, unlike those that depend upon the abundance of clusters.<\/dc:description><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Monthly notices of the Royal Astronomical Society, 2005, Vol.362(1), pp.L25-L29 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4219<\/dc:identifier><dc:identifier>\n        issn:0035-8711<\/dc:identifier><dc:identifier>\n        issn: 1365-2966<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1745-3933.2005.00067.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4219\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1745-3933.2005.00067.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4219\/1\/4219.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1365-2966"," 1365-2966","0035-8711","issn:0035-8711"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n29 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAngulo, R. and Baugh, C. M. and Frenk, C. S. and Bower, R. G. and Jenkins, A. R. and Morris, S. L. (2005)\n’Constraints on the dark energy equation of state from the imprint of baryons on the power spectrum of\nclusters.’, Monthly notices of the Royal Astronomical Society., 362 (1). L25-L29.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1745-3933.2005.00067.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nAngulo, R. and Baugh, C. M. and Frenk, C. S. and Bower, R. G. and Jenkins, A. R. \nand Morris, S. L. (2005) 'Constraints on the dark energy equation of state from the \nimprint of baryons on the power spectrum of clusters.' , Monthly notices of the Royal \nAstronomical Society., 362 (1), L25-L29. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1111\/j.1745-3933.2005.00067.x \n \nar\nX\niv\n:a\nstr\no-\nph\n\/0\n50\n44\n56\nv2\n  1\n3 \nJu\nn \n20\n05\nMon. Not. R. Astron. Soc. 000, 000–000 (0000) Printed 2 February 2008 (MN LATEX style file v2.2)\nConstraints on the dark energy equation of state from the\nimprint of baryons on the power spectrum of clusters.\nR. Angulo1,2, C. M. Baugh2, C. S. Frenk2, R. G. Bower2, A. Jenkins2, S. L. Morris2.\n1Departamento de Astronomı´a y Astrof´ısica, Pontificia Universidad Cato´lica de Chile, V. Mackenna 4860, Santiago 22, Chile.\n2Institute for Computational Cosmology, Department of Physics, University of Durham, South Road, Durham, DH1 3LE, UK.\n2 February 2008\nABSTRACT\nAcoustic oscillations in the baryon-photon fluid leave a signature in the matter power\nspectrum. The overall shape of the spectrum and the wavelength of the oscillations\ndepend upon the sound horizon scale at recombination. Using the Λ cold dark matter\nHubble Volume simulation, we show that the imprint of baryons is visible in the\npower spectrum of cluster-mass dark matter haloes, in spite of significant differences\nbetween the halo power spectrum and the prediction of linear perturbation theory.\nA measurement of the sound horizon scale can constrain the dark energy equation\nof state. We show that a survey of clusters at intermediate redshift (z ∼ 1), like the\nSunyaev-Zeldovich survey proposed by the South Pole Telescope or a red sequence\nphotometric survey with VISTA, could potentially constrain the sound horizon scale\nto an accuracy of ∼ 2%, in turn fixing the ratio of the pressure of the dark energy to\nits density (w) to better than ∼ 10%. Our approach does not require knowledge of the\ncluster mass, unlike those that depend upon the abundance of clusters.\n1 INTRODUCTION\nEstimates of cosmological parameters have improved dra-\nmatically with the advent of accurate measurements of tem-\nperature anisotropies in the microwave background radia-\ntion and the clustering of local galaxies (Efstathiou et al.\n2002; Percival et al. 2002; Spergel et al. 2003; Abazajian et\nal. 2004; Tegmark et al. 2004). A consistent picture is emerg-\ning, the ΛCDM model, in which the geometry of the Uni-\nverse is flat (or very nearly so), with matter accounting for\nless than 30% of the required critical density (de Bernardis\net al. 2000; Peacock et al. 2001; Cole et al. 2005). Several\nlines of evidence indicate that the shortfall in energy density\nis made up by “dark energy” (Riess et al. 1998; Perlmutter\net al. 1999; Efstathiou et al. 2002; Spergel et al 2003).\nThe dark energy exerts a negative pressure and is re-\nsponsible for the current acceleration of the expansion of\nthe Universe. The equation of state of the dark energy, the\nratio of its pressure to density, is specified by a parameter\nw ≡ P\/ρ. For a vacuum energy or cosmological constant,\nw = −1 at all times; in quintessence models, the equation of\nstate can vary with time, i.e. w is a function of redshift (Lin-\nder 2003). Theoretically, dark energy is poorly understood\nand progress will require the design and implementation of\nnew cosmological tests to constrain its properties.\nThere has been much speculation about using the wave-\nlength of acoustic oscillations imprinted on the galaxy power\nspectrum to constrain the dark energy equation of state\n(Blake & Glazebrook 2003, hereafter BG03; Linder 2003;\nSeo & Eisenstein 2003). This scale depends on the size of\nthe sound horizon at recombination and is the maximum\ndistance that a ripple in the baryon-photon fluid can travel\nbefore the sound speed drops precipitously after recombina-\ntion, stifling any further propagation. The acoustic horizon\nis a standard ruler that depends only on physical parameters\n(e.g. the physical densities in matter, Ωmh\n2, and baryons,\nΩbh\n2, in units of the critical density; h is the Hubble parame-\nter) and is determined from the acoustic peaks in the cosmic\nmicrowave background (Spergel et al. 2003). The observed\nwavelength of oscillation depends upon the geometry of the\nUniverse and thus on the dark energy equation of state.\nUsing the “Millennium” N-body simulation of a ΛCDM\nuniverse, Springel et al. (2005) demonstrated that acous-\ntic oscillations are visible in the matter power spectrum at\nthe present day, albeit in a modified form. The maximum\nrelative amplitude of the oscillatory features in the matter\nspectrum is around 10%, much smaller than the acoustic\npeaks in the power spectrum of the microwave background\n(Meiskin, White & Peacock 1999). The detection of these\nfeatures therefore demands precision measurements of large-\nscale clustering, which is only possible with a survey covering\na large volume. The imprint of baryons in the galaxy distri-\nbution was detected in the power spectrum of the 2-degree\nfield galaxy redshift survey (Percival et al. 2001; Cole et al.\n2005) and the correlation function of luminous red galaxies\n(Eisenstein et al. 2005). These detections lack the accuracy\nneeded for a competitive estimate of w.\nGalaxy clusters are an attractive alternative to galaxies\nfor mapping the large-scale structure of the Universe. Rich\nclusters are easier to detect at large distances than indi-\nvidual galaxies and their mean separation is much greater.\nThus, it is easier to sample large volumes homogeneously\nwith clusters than with galaxies. The low space density of\n2 Angulo et al.\nclusters might appear at first sight to make the power spec-\ntrum difficult to measure. However, clusters have a stronger\ncorrelation amplitude than the overall mass distribution and\nthis offsets their sparsity (Kaiser 1984; for an illustration of\nhow clustering depends on group size see Padilla et al. 2004).\nIn this letter, we first show that the imprint of baryons\non the matter power spectrum is indeed visible in the power\nspectrum of galaxy clusters (Section 2). We do this using\nthe “Hubble Volume” N-body simulation of a ΛCDM uni-\nverse, modelling a range of phenomena that alter the ap-\npearance of the oscillatory features in the power spectrum as\nclustering develops. The power spectrum of clusters is very\ndifferent from the prediction of linear perturbation theory\nso our approach represents an improvement over previous\nstudies (e.g. Hu & Haiman 2003; Wang et al. 2004). In Sec-\ntion 3, we assess the accuracy with which the sound horizon\nscale can potentially be recovered for samples of dark mat-\nter haloes that are relevant for forthcoming cluster surveys.\nThe prospects for constraining the dark energy equation of\nstate are discussed in Section 4.\n2 THE POWER SPECTRUM OF CLUSTERS\nThe power spectrum of density fluctuations in the linear\nregime is a well specified prediction of the cold dark mat-\nter model (Bardeen et al. 1986). While fluctuations around\nthe mean density remain small, the evolution of the spec-\ntrum can be accurately calculated using linear perturbation\ntheory. In this case, the shape of the spectrum is preserved\nbut its amplitude changes. As the perturbations grow, vari-\nous processes cause the power spectrum of galaxies or clus-\nters to differ from the linear theory expectation: (i) Non-\nlinear evolution. Mode coupling due to gravitational insta-\nbility influences fluctuation growth and alters the shape of\nthe power spectrum. (ii) Biasing between the spatial distri-\nbution of mass and its tracers. In general, the distribution of\ngalaxies or clusters does not constitute a random sampling\nof the mass and the two could be related in a complicated\nway (e.g. Bower et al. 1993). In the simplest model, the dif-\nference between the clustering amplitudes of the mass and\nthe tracers is described by a bias parameter, which can vary\nwith scale and redshift (e.g. Cole et al. 1998; Narayanan,\nBerlind & Weinberg 2000). (iii) Peculiar motions and red-\nshift errors. The effect of peculiar velocities on measured\nredshifts is to introduce a redshift-space distortion. On large\nscales, this takes the form of coherent flows towards massive\nstructures that boost the apparent amplitude of the power\nspectrum (Kaiser 1987). On small scales, random motions\ninside virialized objects smear out structures, damping the\npower spectrum. Errors in the redshift determination also\ndamp the spectrum at intermediate and large wavenumbers\nbut do not boost the spectrum at low wavenumbers.\nThese effects are best modelled with a N-body simula-\ntion of hierarchical clustering. We use the z = 1 output of\nthe Virgo Consortium’s “Hubble Volume” simulation of a\nΛCDM universe (Jenkins et al. 2001; Evrard et al. 2002).\nThis had a volume of 27h−3Gpc3 and a particle mass of\n2.2 × 1012h−1M⊙, making it ideally suited to studying the\nclustering of massive haloes (Colberg et al. 2000; Padilla &\nBaugh 2002). Dark matter haloes are identified using the\nfriends-of-friends algorithm (Davis et al. 1985).\nFigure 1. The real-space power spectrum of the dark matter\n(open circles) and various samples of dark matter haloes (filled\nsymbols). The halo samples are defined by the minimum mass\nthreshold given in the legend. The spectra have all been divided\nby a reference cold dark matter power spectrum without baryons.\nThe solid lines show the linear perturbation theory prediction,\ndivided by the same reference. For the halo samples, the lines\nhave been multiplied by the square of an effective bias parameter.\nThe error bars are computed using Eq. 1.\nFig. 1 shows the impact on the power spectrum of pro-\ncesses (i) and (ii) above: nonlinear evolution and bias. The\nopen points show the power spectrum of the dark matter at\nz = 1. To expand the dynamic range, the spectrum has been\ndivided by a cold dark matter power spectrum that does not\ncontain any contribution from baryons. The solid line shows\nthe linear perturbation theory spectrum for the simulation\nparameters, divided by the same reference. The amplitude\nof spectrum of the dark matter is systematically higher than\nthe linear theory prediction for k > 0.15hMpc−1, a discrep-\nancy that becomes more pronounced at higher wavenum-\nbers. The other symbols show the spectra measured for sam-\nples of dark matter haloes defined by different minimum\nmass thresholds; the amplitude of the points increases with\nthe mass cut. These spectra have been corrected for shot\nnoise by subtracting 1\/n¯, where n¯ is the number density\nof haloes. This correction is important as the mean sepa-\nration of the haloes is close to the scale of the feature we\nare trying to measure. The solid lines show the linear the-\nory spectrum multiplied by the square of an effective bias\ncomputed for each sample (see Padilla & Baugh 2002). This\nmodel for the halo spectrum gives a good match to the simu-\nlation for k∼<0.07hMpc\n−1, but underestimates the power at\nhigher wavenumbers. Although nonlinear evolution erases\nthe acoustic oscillations at high k, the first few oscillations\nare still clearly visible in the cluster power spectrum.\nThe impact of peculiar motions and redshift errors is\nillustrated in Fig. 2. The symbols show the real-space power\nspectra of two halo samples. The dotted and dashed lines\nshow fits to the halo power spectrum measured in redshift-\nspace, with and without redshift errors respectively. (The fit-\nting process is discussed in §3.) Redshift-space positions are\nMeasuring the acoustic horizon with the power spectrum of clusters 3\nFigure 2. Fits to the power spectra of haloes. The points show\nthe measured real-space spectrum and the lines show the best fits\nfor three cases: real-space positions, redshift-space positions and\nredshift-space plus redshift measurement errors, as indicated by\nthe legend. The panels correspond to different mass limits.\ncalculated in the distant observer approximation by adding\nthe scaled x component of the peculiar motion of the centre\nof mass to the x coordinate of each halo. For illustration,\nwe show the impact of an error in the cluster redshift given\nby a Gaussian with variance 300 km s−1. At low k we find\na shift in the amplitude of the spectrum in redshift-space\nrelative to real-space. The size of this shift is smaller for the\nlarger mass sample, due to its larger effective bias.\nFor dark matter or galaxies, redshift-space distortions\ngenerally cause a shift in the spectrum on large scales and\ndamping on smaller scales relative to the real-space spec-\ntrum (e.g. Benson et al. 2000). However, for clusters, the\noverall distortion in the power spectrum is more compli-\ncated, as noted by Padilla & Baugh (2002). Cluster-size\nhaloes are in a rather different clustering regime from the\ndark matter or galaxies for three reasons. Firstly, the mean\nhalo separation exceeds the correlation length by a factor\nof 2-4, depending upon mass. Secondly, haloes correspond\nto high peaks in the density field. Finally, haloes are not\nlocated in virialized structures; otherwise the group finder\nwould have simply identified the supercluster as a dark mat-\nter halo of larger mass. Redshift errors depress the power\nspectrum at high k because they smear out structures on\nscales comparable to the size of the equivalent spatial error.\nThis effect partially compensates for the redshift-space dis-\ntortion, bringing the result closer to the real-space estimate.\nThe discrepancies between the spectrum that we recover for\nmassive haloes in redshift-space and the naive expectations\nbased on extrapolations of linear theory or results for galax-\nies are a good illustration of the need to use a full N-body\ncalculation in order to model the power spectrum correctly.\nFigure 3. The percentage error in the recovered sound horizon\nas a function of survey volume. The lines correspond to samples\nwith different minimum mass thresholds, as given in the legend.\nFigure 4. The correlation function, ξ(r), of haloes with M >\n1.8 × 1014h−1M⊙ (squares) compared with linear perturbation\ntheory (solid line), which includes the effective bias of the haloes\nand redshift-space distortions. We plot r2ξ(r) to expand the dy-\nnamic range. The correlation function of luminous red galaxies is\nalso plotted for comparison (crosses; Eisenstein et al. 2005).\n3 MEASURING THE SOUND HORIZON\nWe take a somewhat different approach to determine the\nsound horizon scale to that of BG03, who fitted a paramet-\nric form to the ratio of the measured power spectrum to a\nreference spectrum without oscillatory features. Instead, we\nfit to the power spectrum directly, using the analytic matter\n4 Angulo et al.\npower spectrum presented by Eisenstein & Hu (1999), which\ndescribes the linear theory fluctuations in the cold dark mat-\nter and baryons. We model the effects of nonlinear evolution\nusing a simple approximation, which effectively linearizes\nthe power spectrum by removing the nonlinear distortion.\nWe first divide both the measured spectrum and the cor-\nresponding linear theory spectrum by a smooth reference.\nThe ratios obtained for the measured spectrum and the lin-\near theory spectrum differ beyond a particular wavenumber,\nknl ( Fig. 1). We fit a linear relation to the measured power\nspectrum ratio beyond knl, P\/Pref = A+Bk. We then divide\nthe measured ratio by A+Bk and multiply the result by the\nreference spectrum to get a linearized power spectrum. The\nfree parameters in the linearization step are knl, A and B.\nWe then fit the linearized spectrum to the Eisenstein & Hu\nformula. The free parameters are the sound horizon scale,\nΩm, Ωb, h and the amplitude of the spectrum. The values\nof Ωm, Ωb and h are set to those used in the simulation.\nOur approach has a number of clear advantages over\nthat of BG03. Firstly, BG03 fit to the measured spectrum\ndivided by a reference spectrum. There is no statistical gain\nto be derived from this; we present our results as a ratio\nin Figs. 1 and 2 simply to improve the contrast of the os-\ncillations. As a matter of fact, the choice of reference can\ncompromise the fit as different choices for the smooth spec-\ntrum can alter the visibility of the first peak, leading to pos-\nsible systematic errors in the derived sound horizon scale.\nSecondly, the form advocated by BG03 is an approximation\nbased on a Taylor expansion of the combined transfer func-\ntions for cold dark matter and baryons. The parameter that\nBG03 equate to the sound horizon is actually only equivalent\nto this scale under certain conditions. Thirdly, BG03’s para-\nmetric form is only applicable when fluctuations are in the\nlinear regime. In hierarchical models, nonlinearities lead to\ndeviations from the linear theory spectrum on surprisingly\nlarge scales (see Fig. 1 and Figure 4 of Baugh & Efstathiou\n1994). Finally, by fitting to the power spectrum rather than\na ratio, we are using information about the overall shape of\nthe power spectrum, including the break, which is also sen-\nsitive to the sound horizon scale. We find that we recover a\nmore accurate estimate of the sound horizon scale when we\nfit to the power spectrum directly instead of to a ratio.\nThe error on the spectrum depends upon the volume\nand the amplitude of the spectrum relative to the shot noise\ndue to the discreteness of the tracers of the mass distribu-\ntion, and is given by (Feldman, Kaiser & Peacock 1994):\nσ\nP\n= 2pi\n√\n1\nV k2∆k\n(\n1 + n¯P\nn¯P\n)\n, (1)\nwhere V is the survey volume, ∆k is the width of the bins\nused to average the spectrum and n¯ is the mean number\ndensity of clusters. All quantities are comoving. The product\nn¯P is the signal-to-noise ratio of the measured power and\ndepends upon k. We have tested Eq. 1 against the dispersion\nbetween the spectra measured on subdividing the Hubble\nVolume simulation.\nThe fits to the power spectra measured for two sam-\nples of haloes in the full simulation are shown in Fig. 2.\nAs explained above, we show the results after dividing by\na smooth reference simply to expand the range on the y-\naxis. We show the best fit in three cases: the cluster power\nspectrum measured in real-space, in redshift-space and in\nTable 1. The accuracy with which the sound horizon can be\nmeasured. Column (1): The lower mass limit of the sample. (2)\nThe number of haloes above this mass in the ΛCDM Hubble Vol-\nume output at z = 1. (3) The accuracy (%) with which the sound\nhorizon is measured from the halo power spectrum. (4) The cor-\nresponding accuracy with which w is constrained.\nhalo mass (h−1M⊙) number of haloes ∆s (%) ∆w (%)\n> 1.8× 1014 45 000 2.1 9\n> 6.8× 1013 380 000 0.7 3\n> 2.6× 1013 2000 000 0.4 1.5\nredshift-space with a redshift error of σV = 300kms\n−1. Even\nthough the shapes of the spectra are quite different, our\nmethod recovers the theoretical value of the sound horizon\nscale accurately. Results for three samples of haloes drawn\nfrom the full Hubble Volume simulation output at z = 1 are\ngiven in Table 1. The accuracy with which we predict that\nthe sound horizon scale can be extracted from the halo power\nspectrum for different cubical volumes is given in Fig. 3.\nThe sound horizon can also be measured from the cor-\nrelation function. In this case, the signature is a spike at a\ncomoving pair separation approximately equal to the sound\nhorizon scale. Fig. 4 shows the correlation function of haloes\nwith a minimum mass of 1.8× 1014h−1M⊙. There is a clear\npeak at ∼ 105h−1Mpc. Significant differences remain be-\ntween the simulations results and linear perturbation theory,\neven after the effective bias of the halo sample and redshift-\nspace distortions (Kaiser 1987) are taken into account. Fig.4\nalso shows the correlation function of luminous red galaxies\nat z ∼ 0.35 (Eisenstein et al. 2005). The correlation ampli-\ntude and errors are comparable to those of our sample of\nclusters at z = 1, which is purely a coincidence. The peak\nis better defined in the cluster sample, further illustrating\nthe ability of this method to yield information on the dark\nenergy equation of state at different redshifts.\n4 DISCUSSION AND CONCLUSIONS\nThe dark energy equation of state can be constrained by\ncomparing measurements of the acoustic horizon derived\nfrom the power spectrum of galaxy clusters and from tem-\nperature anisotropies in the microwave background. WMAP\ndata constrain the sound horizon scale to an accuracy of\n∼ 3% (Spergel et al. 2003); this will undoubtedly improve\nin the future. In principle, w can be estimated from both\nthe radial and transverse parts of the power spectrum. The\nacoustic horizon is a comoving standard ruler whereas clus-\nter surveys measure redshifts and angular positions. Trans-\nforming redshifts to comoving distances requires the Hub-\nble parameter,H(z), while transforming angular separations\ninvolves the angular-diameter distance, DA(z). Both H(z)\nand DA(z) depend on w as well as other cosmological pa-\nrameters. Thus, the radial and tangential components of the\nspectrum provide independent routes to w. In practice, it is\nunlikely that realistic surveys will have sufficient spectral\nmodes for such a decomposition, so one may have to resort\nto the spherically averaged power spectrum used here.\nThe cluster power spectrum gives a purely geometri-\ncal test for w based on absolute distances. By contrast, the\nMeasuring the acoustic horizon with the power spectrum of clusters 5\ntest based on distant supernovae (also geometrical) relies\non relative distance measurements, while the test based on\ncounting clusters as a function of redshift depends on a com-\nbination of geometry and the fluctuation growth rate. These\ntests are therefore complementary and, in principle, mea-\nsure different things. The utility of the counts is limited by\nthe accuracy with which an observation, e.g. the Sunyaev-\nZeldovich (SZ) decrement, can be translated into an esti-\nmate of halo mass which is required to link with theory\n(Majumdar & Mohr 2003; Wang et al. 2004). Whilst the\nsensitivity to cluster mass can be reduced by combining the\nnumber counts with a measurement of the amplitude of the\ncluster power spectrum, this “self-calibration” is still model\ndependent (Majumdar & Mohr 2004). Our method does not\nrequire a detailed knowledge of cluster masses as these affect\nthe amplitude but not the shape of the power spectrum.\nAll methods measure a weighted integral of w over red-\nshift (Deep Saini, Padmanabhan & Bridle 2003). Recent es-\ntimates at low redshift already constrain w to ≈ 20% in the\nsimplest, w = −1, model (e.g. Riess et al. 2004). Measure-\nments at z∼>1 are therefore of great interest. With acoustic\noscillations, there is the added incentive that the measure-\nment becomes easier at higher redshift because fewer high\nk oscillations have been erased by nonlinear gravitational\nevolution. This gain is partly offset by the greater difficulty\nin finding clusters at high redshift (though the SZ effect is\nindependent of redshift). For baryon oscillations, z ∼ 1 is\na particularly interesting epoch because the dependence of\nthe method on the parameter Ωmh\n2 cancels out to first order\nfor w ≃ −1 (e.g. BG03); hence the focus on z ∼ 1. We have\nshown that the impact of baryons on the form of the power\nspectrum of cluster-mass haloes at z ∼ 1 is clearly visible.\nFor the idealised case of a cubical volume, it is possible, with\na big enough survey, to measure the acoustic horizon to an\naccuracy of ≈ 2%. In practice, several effects such as uncer-\ntainties in the cosmological parameters and the impact of\nthe survey geometry on the measurement of the power spec-\ntrum will need to be taken into account. Our method allows\na competitive constraint, ∆w ≈ 10%, on the dark energy\nequation of state at z ∼ 1 (Angulo et al, in prep).\nSuitable samples of clusters at z ∼ 1 could be obtained\nin a variety of ways. First, a catalogue of clusters on the sky\nis required. This could be constructed from optical and near\ninfrared photometry, using the red sequence of early type\ngalaxies (Gladders & Yee 2005). The photometry could also\nbe exploited to estimate the cluster redshift (e.g. Kodama,\nBell & Bower 1999). Gladders & Yee (2005) report an accu-\nracy of σz ≈ 0.02 − 0.03 using two bands that straddle the\n4000A˚ break at z ∼ 1. Large area photometric surveys are\ncurrently being proposed. For example, equipped with an\noptical camera, VISTA (http:\/\/www.vista.ac.uk) would be\nable to survey 10,000 square degrees in UVRI to B ≈ 25 in\n200 photometric nights and the Dark Energy Survey (DES,\nhttp:\/\/cosmology.astro.uiuc.edu\/DES\/) plans to cover 4,000\nsquare degrees to a similar depth. Alternatively, the SZ ef-\nfect could be used to identify clusters on the sky (Carlstrom,\nHolder & Reese 2002). The South Pole Telescope (SPT) aims\nto detect 40,000 SZ clusters over 4,000 square degrees at\nz ∼ 0.5 − 1 (Ruhl et al. 2004). Photometric redshifts for\nthese could be obtained with the DES which plans to cover\nthe same area. The objects in our most massive halo sample\nare comparable to those that the SPT will detect at z ∼ 1.\nOur test requires cluster redshifts. Obtaining spec-\ntroscopy for thousands of clusters is not trivial. With AAΩ,\nthe new multi-object spectrograph at the Anglo Australian\nObservatory, a redshift for a bright early type galaxy at\nz ∼ 1 can be obtained in 100-200 minutes. There are typ-\nically 30 clusters per field of view, so a survey of 40,000\nclusters would need ≈ 200 clear nights; an equivalent spec-\ntrograph on an 8m telescope would reduce this to 50 nights.\nPhotometric redshifts are an alternative but the reduced\naccuracy leads to a serious loss of information (Blake & Bri-\ndle 2005). The error in the cluster redshift causes a damp-\ning of the power at kx > 1\/σx, where σx is the scaled\nerror in the comoving cluster position. For the photomet-\nric redshift accuracy reported by Gladders & Yee (2005),\nσx ≈ 140h\n−1Mpc at z = 1. The damping of the spectrum\ncan be circumvented if modes with kx > 1\/σx are discarded,\nthus effectively using the full spectrum at kx < 1\/σx and the\ntransverse spectrum for kx > 1\/σ. The associated reduction\nin the number of k-modes (by a factor of ∼ 20; see Blake &\nBridle 2005) could be compensated for in several ways: (i)\nIncreasing the solid angle covered. (ii) Improving the pho-\ntometric redshift estimate by using more filters and deeper\nphotometry. (iii) Using a lower mass to define the halo sam-\nple. Although further exploration of this idea using a mock\ncatalogue of a specific survey is needed, our idealized calcu-\nlation suggests that this is a powerful method for obtaining\ninteresting constraints on the properties of the dark energy.\nACKNOWLEDGEMENTS\nThis work was supported by the EC’s ALFA scheme via fund-\ning the Latin American European Network for Astrophysics and\nCosmology and by PPARC; CMB is supported by the Royal Soci-\nety. We acknowledge discussions with Chris Blake, Sarah Bridle,\nFrancisco Castander, Enrique Gaztan˜aga and Mike Gladders.\nREFERENCES\nAbazajian K., et al. 2004, AJ, 128, 502\nBardeen J., Bond J. R., Kaiser N., Szalay A., 1986, ApJ, 304, 15\nBaugh C. M., Efstathiou G., 1994, MNRAS, 270, 183\nBenson A. J., et al., 2000, MNRAS, 316, 107\nBower R.G., Coles P., et al., 1993, ApJ, 405, 403\nBlake C., Glazebrook K., 2003, ApJ, 594, 665. (BG03)\nBlake C., Bridle S., 2005, (astro-ph\/0411713)\nCarlstrom J. E., Holder G., Reese E. D., 2002, ARAA, 40, 643\nColberg J. M., et al., 2000, MNRAS, 319, 209\nCole S., Hatton S., et al., 1998, MNRAS, 300, 945\nCole S., et al., 2005, MNRAS, submitted. (astro-ph\/0501174)\nde Bernardis P., et al. 2000, Nature, 404, 955\nDeep Saini, T., et al., 2003, MNRAS 343, 533\nDavis M., Efstathiou G., et al., 1985, ApJ, 292, 371\nEfstathiou G., et al., 2002, MNRAS, 330, L29\nEisenstein D. J., Hu W. 1999, ApJ, 511, 5\nEisenstein D. J., Hu W., Tegmark M., 1998, ApJ, 504, 57\nEisenstein D. J., et al., 2005, ApJ, submitted. (astro-ph\/0501171)\nEvrard A. E., et al., 2002, ApJ, 573, 7\nFeldman H. A., Kaiser N., Peacock J. A. 1994, ApJ, 426, 23\nGladders M. D., Yee H. K. C., 2005, ApJS, 157, 1\nHu W., Haiman Z., 2003, Phys. Rev. D., 68, 3004\nJenkins A., et al., 2001, MNRAS, 321, 372\nKaiser N., 1984, ApJ, 284, L9\nKaiser N., 1987, MNRAS, 227, 1\nKodama T., Bell E. F., Bower R. G., 1999, MNRAS, 302, 152\nLinder E. V., 2003, PhRvD, 68, 3503\nMajumdar S., Mohr J. J., 2003, ApJ, 585, 603\n6 Angulo et al.\nMajumdar S., Mohr J. J., 2004, ApJ, 613, 41\nMeiskin A., White M., Peacock J. A. 1999, MNRAS, 304, 851\nNarayanan V.K., Berlind A., Weinberg D., 2000, ApJ, 528, 1\nPadilla N. D., Baugh C. M., 2002, MNRAS, 329, 431\nPadilla N. D., et al., 2004, MNRAS, 352, 211\nPeacock J. A., et al., 2001, Nature, 410, 169\nPercival W. J., et al., 2001, MNRAS, 327, 1297\nPercival W. J., et al., 2002, MNRAS, 337, 1068\nPerlmutter S. et al., 1999, ApJ, 517, 565\nRiess A. G., et al., 1998, AJ, 116, 1009\nRiess A. G., et al., 2004, ApJ, 607, 665\nRuhl J., et al., 2004, SPIE, 5498, 11\nSeo H., Eisenstein D. J., 2003, ApJ, 598, 720\nSpergel D. N., et al., 2003, ApJS, 148, 175\nSpringel V., et al., 2005, Nature, 435, 439\nTegmark M., et al. 2004, PhRvD, 69, 103501\nWang S., et al., 2004, PhyRvD, 70, 123008\n"}