{"doi":"10.1002\/rcm.3328","coreId":"191878","oai":"oai:lra.le.ac.uk:2381\/3653","identifiers":["oai:lra.le.ac.uk:2381\/3653","10.1002\/rcm.3328"],"title":"Simultaneous detection of five different 2-hydroxyethyl-DNA adducts formed by ethylene oxide exposure, using a high-performance liquid chromatography\/electrospray ionisation tandem mass spectrometry assay","authors":["Tompkins, Elaine M.","Jones, Donald J. L.","Lamb, John H.","Marsden, Debbie A.","Farmer, Peter B.","Brown, Karen"],"enrichments":{"references":[{"id":44631539,"title":"Analytical Chemistry","authors":[],"date":"1997","doi":"10.1021\/ac9607673","raw":"Leclercq, L.; Laurent, C.; De Pauw, E. Analytical Chemistry 1997; 69; 1952.","cites":null},{"id":44631521,"title":"Biochemical Pharmacology","authors":[],"date":"1990","doi":"10.1016\/0006-2952(90)90011-9","raw":"Kessler, W.; Remmer, H. Biochemical Pharmacology 1990; 39; 1347.","cites":null},{"id":44631519,"title":"Chemico Biological Interactions","authors":[],"date":"1988","doi":"10.1016\/0009-2797(88)90064-6","raw":"Solomon, J.J.; Mukai, F.; Fedyk, J.; Segal, A. Chemico Biological Interactions 1988; 67; 275.","cites":null},{"id":44631525,"title":"Environmental Health Perspectives","authors":[],"date":"1989","doi":"10.2307\/3430798","raw":"Solomon, J.J.; Segal, A. Environmental Health Perspectives 1989; 81; 19.","cites":null},{"id":44631520,"title":"Mutation Research","authors":[],"date":"1999","doi":"10.1016\/s0027-5107(99)00013-5","raw":"Zhao, C.; Tyndyk, M.; Eide, I.; Hemminki, K. Mutation Research 1999; 424; 117.","cites":null},{"id":44631538,"title":"Mutation Research: Fundamental Molecular Mechanisms in Mutagenesis","authors":[],"date":"2000","doi":"10.1016\/s0027-5107(99)00221-3","raw":"Tretyakova, N.Y.; Burney, S.; Pamir, B.; Wishnok, J.S.; Dedon, P.C.; Wogan, G.N.; Tannenbaum S.R. Mutation Research: Fundamental Molecular Mechanisms in Mutagenesis 2000; 447; 287.","cites":null},{"id":44631523,"title":"Occupational and Environmental Medicine","authors":[],"date":"2004","doi":"10.1136\/oem.2005.024265","raw":"Coggon, D.; Harris, E. C.; Poole, J.; Palmer K. T. Occupational and Environmental Medicine 2004; 61; 358.","cites":null},{"id":44631522,"title":"Risk Analysis","authors":[],"date":"1999","doi":"10.1023\/a:1007086728854","raw":"Teta. M.J.; Sielken. R.L.; Valdez-Flores. C. Risk Analysis 1999; 19; 1135.","cites":null},{"id":44631518,"title":"Some Industrial Chemicals.","authors":[],"date":"1994","doi":"10.1038\/bjc.1976.92","raw":"IARC Monographs. Some Industrial Chemicals. 1994; 60,;73.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11-28","abstract":"This is the author's final draft of the version published as Rapid Communications in Mass Spectrometry, 2008, 22 (1),pp.19-28. The definitive version is available at www3.interscience.wiley.com, Doi: 10.1002\/rcm.3328.A method has been developed for the simultaneous detection and quantitation of five different (2-hydroxyethyl)-DNA adducts (HE-DNA adducts) that could be formed as a result of exposure to ethylene oxide (EO). In addition to the major N7-HE-guanine (N7-HEG) adducts this assay can also measure the less prevalent but potentially more biologically significant N1-HE-2’-deoxyadenosine (N1-HEdA), O6-HE-2’-deoxyguanosine (O6-HEdG), N6-HE-2’-deoxyadenosine (N6-HEdA) and N3-HE-2’-deoxyuridine adducts (N3-HEdU). The method involves the isolation of HE-adducts from the unmodified nucleosides by either neutral thermal hydrolysis or enzymatic digestion, followed by HPLC purification, before detection and quantification by liquid-chromatography tandem mass spectrometry (LC-MS\/MS) using selective reaction monitoring (SRM). The limits of detection were in the range 0.5 – 25 fmoles for each individual adduct, making this one of the most sensitive assays available for the detection of N7-HEG. To illustrate the possible applications of the assay, it has been employed in the measurement of endogenous\/background and EO-induced HE-adducts in a variety of DNA samples","downloadUrl":"http:\/\/hdl.handle.net\/2381\/3653","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/3653\/3\/9854%5b1%5d.pdf","pdfHashValue":"dd4d5f466233bc0a4de92e793a63bf142684574d","publisher":"John Wiley & Sons","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/3653<\/identifier><datestamp>\n                2015-12-04T11:17:09Z<\/datestamp><setSpec>\n                com_2381_162<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                com_2381_69<\/setSpec><setSpec>\n                col_2381_163<\/setSpec><setSpec>\n                col_2381_70<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSimultaneous detection of five different 2-hydroxyethyl-DNA adducts formed by ethylene oxide exposure, using a high-performance liquid chromatography\/electrospray ionisation tandem mass spectrometry assay<\/dc:title><dc:creator>\nTompkins, Elaine M.<\/dc:creator><dc:creator>\nJones, Donald J. L.<\/dc:creator><dc:creator>\nLamb, John H.<\/dc:creator><dc:creator>\nMarsden, Debbie A.<\/dc:creator><dc:creator>\nFarmer, Peter B.<\/dc:creator><dc:creator>\nBrown, Karen<\/dc:creator><dc:subject>\nLC-MS\/MS<\/dc:subject><dc:subject>\nSRM<\/dc:subject><dc:subject>\n2-hydroxyethyl<\/dc:subject><dc:subject>\nethylene oxide<\/dc:subject><dc:subject>\nDNA adducts<\/dc:subject><dc:description>\nThis is the author's final draft of the version published as Rapid Communications in Mass Spectrometry, 2008, 22 (1),pp.19-28. The definitive version is available at www3.interscience.wiley.com, Doi: 10.1002\/rcm.3328.<\/dc:description><dc:description>\nA method has been developed for the simultaneous detection and quantitation of five different (2-hydroxyethyl)-DNA adducts (HE-DNA adducts) that could be formed as a result of exposure to ethylene oxide (EO). In addition to the major N7-HE-guanine (N7-HEG) adducts this assay can also measure the less prevalent but potentially more biologically significant N1-HE-2’-deoxyadenosine (N1-HEdA), O6-HE-2’-deoxyguanosine (O6-HEdG), N6-HE-2’-deoxyadenosine (N6-HEdA) and N3-HE-2’-deoxyuridine adducts (N3-HEdU). The method involves the isolation of HE-adducts from the unmodified nucleosides by either neutral thermal hydrolysis or enzymatic digestion, followed by HPLC purification, before detection and quantification by liquid-chromatography tandem mass spectrometry (LC-MS\/MS) using selective reaction monitoring (SRM). The limits of detection were in the range 0.5 – 25 fmoles for each individual adduct, making this one of the most sensitive assays available for the detection of N7-HEG. To illustrate the possible applications of the assay, it has been employed in the measurement of endogenous\/background and EO-induced HE-adducts in a variety of DNA samples.<\/dc:description><dc:date>\n2008-02-25T12:56:28Z<\/dc:date><dc:date>\n2008-02-25T12:56:28Z<\/dc:date><dc:date>\n2007-11-28<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nRapid Communications in Mass Spectrometry, 2008, 22 (1), pp.19-28<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/3653<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1002\/rcm.3328\/abstract<\/dc:identifier><dc:identifier>\n10.1002\/rcm.3328<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nJohn Wiley & Sons<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["LC-MS\/MS","SRM","2-hydroxyethyl","ethylene oxide","DNA adducts"],"subject":["Article"],"fullText":" Simultaneous detection of five different 2-hydroxyethyl DNA \nadducts formed by ethylene oxide exposure, using a high-\nperformance liquid chromatography\/electrospray ionisation \ntandem mass spectrometry assay. \n \n \nElaine M. Tompkins, Donald J.L. Jones, John H. Lamb,  \nDebbie A. Marsden, Peter B. Farmer  \nand Karen Brown.* \n \n \nCancer Biomarkers and Prevention Group, Department of Cancer Studies and \nMolecular Medicine, The Biocentre, University of Leicester, University Road, \nLeicester LE1 7RH, UK. \n \n*Corresponding Author. Fax: 0116 2231840 \nE-mail: kb20@le.ac.uk \n \n 1\nABSTRACT \nA method has been developed for the simultaneous detection and quantitation of five \ndifferent (2-hydroxyethyl)-DNA adducts (HE-DNA adducts) that could be formed as \na result of exposure to ethylene oxide (EO). In addition to the major N7-HE-guanine \n(N7-HEG) adducts this assay can also measure the less prevalent but potentially more \nbiologically significant N1-HE-2’-deoxyadenosine (N1-HEdA), O6-HE-2’-\ndeoxyguanosine (O6-HEdG), N6-HE-2’-deoxyadenosine (N6-HEdA) and N3-HE-2’-\ndeoxyuridine adducts (N3-HEdU). The method involves the isolation of HE-adducts \nfrom the unmodified nucleosides by either neutral thermal hydrolysis or enzymatic \ndigestion, followed by HPLC purification, before detection and quantification by \nliquid-chromatography tandem mass spectrometry (LC-MS\/MS) using selective \nreaction monitoring (SRM). The limits of detection were in the range 0.5 – 25 fmoles \nfor each individual adduct, making this one of the most sensitive assays available for \nthe detection of N7-HEG. To illustrate the possible applications of the assay, it has \nbeen employed in the measurement of endogenous\/background and EO-induced HE-\nadducts in a variety of DNA samples. \n \nKEYWORDS: LC-MS\/MS, SRM, 2-hydroxyethyl, ethylene oxide, DNA adducts. \n 2\nINTRODUCTION \nEthylene oxide (EO) is a widely used chemical intermediate and gaseous sterilant1, \nwhich is also formed endogenously through the metabolism of ethylene2,3 by \ncytochrome P450-dependant monooxygenases in vivo4,5. Possible endogenous sources \nof ethylene include lipid peroxidation6 and intestinal bacteria metabolism7, together \nwith the oxidation of free methionine6,8 and haemoglobin products9. In contrast to \nethylene, which has been designated as “not classifiable as to its carcinogenicity to \nhumans”, EO is categorised as “carcinogenic to humans” by the International Agency \nfor Research on Cancer (IARC), based largely on findings from animal studies and \nsufficient evidence to support a relevant mechanism of carcinogenicity in humans1.  \nFor example, EO reacts directly with cellular macromolecules to form covalent 2-\nhydroxyethyl (HE) adducts with both proteins and DNA2, without the need for prior \nmetabolic activation and studies in various in vitro systems and animal models have \nshown that EO is capable of inducing mutations5,10,11, sister chromatid exchanges and \nchromosomal aberrations12. However, the current data is conflicting or inconclusive \nregarding whether exposure to EO actually increases the incidence of human \ncancers13-16. Consequently, there is much interest in elucidating the mechanisms \nthrough which EO causes these effects and identifying appropriate mechanism-based \nbiomarkers that can be monitored for human risk assessment purposes.   \n \nAlkyl epoxides react predominantly with strong nucleophilic endocyclic ring \nnitrogens of DNA bases, via an SN2 mechanism4. For EO, the principal site of 2’-\nhydroxyethylation is the N7-position of guanine, forming N7-hydroxyethylguanine \n(N7-HEG)17, which is illustrated in Figure 1 alongside the other possible DNA \nadducts formed by EO18. Alkylation of the N7 position of guanine produces a \n 3\nquaternary ammonium ion, leading to cleavage of the N-glycosydic bond19, which if \nnot repaired can result in an apurinic (AP) site. N7-HEG adducts are not considered to \nbe promutagenic themselves, although presence of AP sites during DNA replication \ncould result in miscoding20,21. Being the predominant EO alkylation product however, \nmeasures of N7-HEG can provide a valuable biomarker of exposure. Very little is \nknown about the properties of the other 2-hydroxyethyl DNA adducts, which together \naccount for less than 5% of the reaction products when EO is incubated with DNA in \nvitro2. It seems likely that if formed, they may contribute to the biological effects of \nEO, given that O6-alkylguanine adducts have been widely demonstrated to be \nmutagenic22. In addition, N3-HE-2’-deoxycytidine undergoes spontaneous hydrolytic \ndeamination to form N3-HEdU23,24, which has been suggested as a potentially \nmutagenic adduct25 and adduction at the N1-position of adenine is proposed to be a \nmiscoding lesion26,27.  \n \nA variety of methods for the detection and quantitation of EO-derived DNA adducts \nhave been reported, however, virtually all published assays have focused solely on \nmeasurement of the major N7-HEG adduct, excluding the lesser formed adducts28,29. \n32P-Postlabelling30-34 approaches can detect N7-HEG in control rat liver at levels of 1 \nadduct per 107 nucleotides33 and similar amounts have been detected in the \nlymphocytes of unexposed humans34. However, the assay procedure can be rather \nlengthy, it provides no structural information and the analysis is highly inefficient due \nto spontaneous depurination of the N7-HEG adduct, which must remain in the \nnucleotide form in order to be detectable. In a comparison of different immunoassay \nmethods for N7-HEG detection35 an immunoslot blot assay was found to be the most \nsensitive, although the limit of detection (LOD) was in the region of 0.3 adducts per \n 4\n106, considerably higher than other methods. Furthermore, immunoassays require \nantibodies specific to the adduct in question and these are not currently available for \nany other HE-adducts, limiting detection to the major N7-HEG lesion. HPLC with \nfluorescence detection has been used to measure the dosimetry of N7-HEG in rodents \nand could also detect O6-HEGuanine and N3-HEAdenine adducts in rats exposed to \nhigh doses (300 ppm) of EO, but the technique lacked the necessary sensitivity to \ndetect O6-HEG and N3-HEA in unexposed animals36. Mass spectrometry based \nmethods afford greater specificity and the sensitivity of these systems is continually \nimproving37-39. As very little is known about the frequency and biological effects of \nthe lesser formed HE adducts, we have developed and validated a novel, highly \nsensitive, and specific LC-MS\/MS method for the simultaneous detection and \nquantitation of five adducts that can potentially be derived from ethylene oxide \nexposure. This is useful to the study of HE-DNA adducts as previous assays could \nonly detect the N7-HEG adduct. We also demonstrate various applications of the \nassay; for the detection of levels of endogenous\/ background HE adducts as well as \nadducts induced by EO treatment in samples including DNA extracted from the liver \nof control and treated rats. \n \nEXPERIMENTAL \nCaution: \nEO is classified as a human carcinogen and should be handled with the appropriate \nprecaution. \n \nChemicals \n 5\nEthylene oxide gas (99.8 % purity), nucleosides and DNA bases for the synthesis of \nadduct standards and the enzymes snake venom phosphodiesterase and DNase I were \npurchased from Sigma (Poole, Dorset, UK). The O6-HEdG adduct standard was \nkindly provided by Dr Didier Gasparutto (Laboratoire des Lésions des Acides \nNucléiques, CEA Grenoble, France). [15N5]-Labelled 2’-deoxynucleosides were from \nSpectra Stable Isotopes (Columbia, MD, USA) and HPLC solvents from Fisher \nScientific (Loughborough, UK). Shrimp alkaline phosphatase was obtained from \nRoche (East Sussex, UK).  \n \nSynthesis of DNA adduct standards \nHydroxyethyl (HE)-nucleoside and base adducts were required as authentic \nstandards for the LC-MS assay. It was envisaged that nucleoside adducts which \nreadily depurinate, such as the N7-HEdG, would be more accurately and reliably \nquantified in the free base form, liberated by hydrolysis of adducted DNA, whilst for \nthe more chemically stable adducts it would be more appropriate to quantify the \nnucleoside lesion, which could be isolated after DNA digestion. Therefore, a method \nwas established which permitted simultaneous detection of specific ethylene oxide \nderived adducts in either the base (N7-HEG) or nucleoside (N1-HEdA, N6-HEdA, O6-\nHEdG, N3-HEdU) form and these adducts were synthesised, along with two 15N-\nlabelled internal standards ([15N5]-N7-HEG and [15N5]-N1-HEdA), for use in the \ndevelopment and validation of the assay.  \n \nFor the production of nucleoside adducts dA, dU, and [15N5]-dA, 2 mmoles of each \nwere dissolved in H2O (20 mL) and reacted with 2.3 mM EO for 18h at 37ºC, then \nconcentrated by freeze-drying. EO was condensed on ice and the required volume \n 6\nadded directly to the dissolved nucleosides to obtain the correct concentration. To \ngenerate the N7-HEG base standards, guanosine (Gua or [15N5]-Gua (1mmole)) was \ndissolved in 20 mL glacial acetic acid\/H2O (1:1) and reacted with 2.3 mM EO for 18h \nat 37ºC, then freeze-dried. The residue was redissolved in 1M HCl (10 mL) and \nheated at 100ºC for 1h, then concentrated to dryness under vacuum. The sample was \nthen dissolved in 1M HCl (4 mL) and the pH adjusted to 4.0, using 5 M NaOH and \nH2O, in a final volume of 30 mL. \n \nThe products of each EO reaction (base and nucleosides) were separated by \npreparative HPLC, using a water:methanol gradient: 5-80 % MeOH over 25 min at a \nflow rate of 10 mL\/ min, using a Hypersil BDS C18 column (250 x 21.2 mm, 5 µ, \nPhenomenex, Macclesfield, UK). Authentic standards were used to identify unreacted \nstarting material and all other significant peaks were collected and evaporated to \ndryness for structural analysis, to identify those fractions containing 2-HE adducts. In \nsome cases it was necessary to perform a second HPLC purification on the collected \nfractions and this was carried out using identical conditions.  \n \n \nStructural Characterisation of HE-DNA adducts \nThe UV spectrum was obtained for each potential adduct containing fraction \n(nucleoside and base) using a Hitachi U-3010 spectrophotometer (Hitachi, \nWokingham, Berkshire) and compared to available published data for ethylene oxide \nDNA adducts18. Samples with UV spectra consistent with the addition of a \nhydroxyethyl group were subject to MS analysis. \n \n 7\nHPLC fractions were analysed by mass spectrometry using a Micromass Quattro \nBioQ, equipped with a pneumatically assisted electrospray source (Waters, \nHertfordshire, UK). The mass spectrometer was tuned using a thymidine standard in \nMeOH (5 pmoles\/µL). Each HPLC peak residue was redissolved in methanol and \nanalysed by continuous infusion. Analysis was carried out in the positive ion mode, \nand the molecular mass of the components of each peak was determined using a total \nion scan (Figure 2). The structure of each potential HE-DNA adduct standard was \nfurther confirmed by MS\/MS, and compared to the spectra for the fully characterized \nadducts published by Li et al.18 UV spectrophotometry was then used to determine the \nconcentration of each of the standards, using published wavelengths and extinction \ncoefficients18. \n \nThe reaction of EO with dA produced two different 2-hydroxyethyl adducts and \nMS\/MS analysis of both fractions produced identical spectra, each containing the \npredicted [M+H]+ ion at m\/z 296. However, the fractions varied significantly in their \nchromatographic properties; the first eluted at 13.5 min and the second, at 18.2 min on \nthe HPLC separation system, indicating different sites of hydroxyethylation. In order \nto identify the individual adducts isolated, a small aliquot of each HPLC fraction was \nremoved and NaOH (1 M) was added to increase the pH of the solution to 12. After \nincubation at 37ºC for 18 h the samples were neutralised with HCl (1 M) and the \nresulting products analysed by HPLC. The retention time of peak A remained at 13.5 \nmin, however peak B appeared to have structurally rearranged into peak A, suggesting \nthat peak B was N1-HEdA and peak A was N6-HEdA40. \n \n   \n 8\nIsolation and LC-MS\/MS analysis of HE-DNA adducts. \nTypically, 1 pmole of a base adduct internal standard, [15N5]-N7-HEG, was added to \neach DNA sample (50-100 µg), which was then depurinated by heating to 100ºC for \n30 min. Preferentially released adducted purines were separated from the DNA by \ncentrifugation through Microcon filters (3,000 MW, YM-3, Millipore, Watford, UK) \nfor 30 min at 13,000 rpm (28,000g); N7-HEG passes through in the filtrate whilst \nintact DNA is retained and can be recovered from the filter, by inversion, for \nsubsequent digestion. A second internal standard [15N5]-N1-HEdA (1 pmole) was then \nadded to the recovered DNA, which was dried down under vacuum, redissolved in 40 \nmM tris-HCl, 10 mM MgCl2, pH 8.5 and digested with snake venom \nphosphodiesterase (0.05 U), DNase I (10 U) and shrimp alkaline phosphatase (2 U) \nfor 2 h at 37ºC. Enzymes were removed by centrifugation (30 min, 13,000 rpm, \n28,000g) through Microcon YM-3 filters (Millipore), the samples were then \nconcentrated to dryness prior to HPLC purification.  \n \nHE-DNA nucleoside adducts contained in the DNA digests were separated from the \nunmodified nucleosides by HPLC on a Phenomenex Luna C18 column (5µ, 250 x 2.1 \nmm, Phenomenex, Macclesfield, UK), using a linear 0.1% acetic acid:methanol \ngradient (increasing from 0 - 35% MeOH over 25 min, 35 - 75% MeOH by 32.5 min, \nand finally 0% MeOH by 43 min, at a flow rate of 0.2 mL\/min). Nucleoside adducts \nelute in the following fractions: 14-16 min (N6-HEdA), 21-23 min (N3-HEdU) and \n25-32 min ([15N5]-N1-HEdA, N1-HEdA and O6-HEdG). All adducts are well resolved \nfrom the normal, unadducted nucleosides which elute around ~20-23 min, except for \nN3-HEdU which co-elutes with dT. This system was also used to isolate the N7-HEG \n(and [15N5]-N7-HEG) from other types of adducted purines which may be present in \n 9\nthe collected filtrate. This base adduct elutes between 5-8 min. A different HPLC \nsolvent gradient was used to further separate N3-HEdU from the unmodified dT, \nconsisting of a linear 0.1% acetic acid:methanol gradient (increasing from 0 - 25% \nMeOH over 50 min, at a flow rate of 0.2 mL\/min). Using this system, dT elutes at 26 \nmin and N3-HEdU at 27.5 min, allowing the hydroxyethylated dU to be collected \nseparately. For each original DNA sample, all fractions containing the desired base \nand nucleoside HE-adduct fractions were then combined and evaporated to dryness \nprior to LC-MS\/MS analysis. To ascertain whether stability of the nucleoside HE-\nadducts was affected by the depurination procedure employed to isolate the N7-HEG \nbase lesions, untreated plasmid DNA (100μg) was spiked with 500 fmoles of each of \nnucleoside adduct standard. Each sample (n = 3) was divided in half and one aliquot \nwas heated to 100ºC for 30 min. Both samples were then digested, the adducts \nisolated by HPLC and then quantified by LC-MS\/MS analysis as described below. \n \nSamples were analysed for the presence of the five hydroxyethyl adducts (N7-HEG, \nN3-HEdU, N6-HEdA, N1-HEdA and O6-HEdG) in a single LC-MS\/MS run, using a \nsystem consisting of a Waters Alliance 2695 separations module interfaced to a \nWaters Quattro Ultima Pt (Waters, Manchester, UK), operated in the positive ion \nmode. Samples were injected via a 100µL loop onto a Supelcosil C18, 250 x 2.1mm, \n5µ column (Sigma, Poole, UK) and separated using an isocratic system of 40 % \nMeOH in 0.5% acetic acid, at a flow rate of 0.12 mL\/min. The eluate from the HPLC \nwas introduced directly into the mass spectrometer. The source temperature was \nmaintained at 120ºC and the desolvation temperature at 350ºC, nitrogen was used as \nthe desolvating gas at a flow rate of 550 L\/hr. The cone voltage was 98 V and the \ncollision energy was 17 eV for all transitions measured. Each sample was dissolved in \n 10\n40% MeOH in 0.5% acetic acid (40 µL) and duplicate injections of 15 µL were \nperformed for each individual sample analysed. The mass spectrometer was operated \nin the selected reaction monitoring (SRM) mode and measured the following \ntransitions simultaneously: m\/z 312 to m\/z 196 for O6-HEdG, m\/z 301 to m\/z 185 for \n[15N5]-HEdA, m\/z 296 to m\/z 180 for both N1-HEdA and N6-HEdA, which all \ncorrespond to the loss of a 2-deoxyribose from positively ionised 2’-\ndeoxyribonucleoside adducts i.e., [M+H]+ ? [M+H-116]+ and m\/z 295 to m\/z 179 for \nN3-HEdU, corresponding to the loss of 2’-deoxyribose from the sodiated adduct \n[M+Na]+ ? [M+Na-116]+. The measurement of m\/z 201 to m\/z 157 for [15N5]-N7-\nHEG and m\/z 196 to m\/z 152 for N7-HEG, corresponds to the measurement of the \n[adducted base +H]+ to [unadducted base +H]+.  \n \nThe levels of nucleoside HE-DNA adducts in each sample were determined by \nmeasuring the ratio of the peak area of each individual HE-DNA adduct to that of the \n[15N5]-N1-HEdA internal standard, whilst N7-HEG was measured relative to [15N5]-\nN7-HEG41, then the values were converted to adducts\/ 108 nucleotides. Figure 3 gives \nan overview of the assay procedure for the isolation and quantitation of HE-adducts. \n \nValidation Parameters \nLinearity of calibration was determined by measuring the ratio of peak areas of the \nfour different HE-adduct standards to the [15N5]-N1-HEdA internal standard and the \nHE-base standard to the [15N5]-N7-HEG internal standard. For validation of the assay, \ndouble the amount was prepared and half was injected onto the column. Calibration \nstandards ranging from 0.5 - 500 fmoles were run three times each day over a three \nday period. The daily mean peak ratio of HE-adduct standard to internal standard was \n 11\nused to construct a calibration line. A correlation coefficient was calculated to \nconfirm linearity for each of the five different HE-adducts. \n \nIntra-day precision was evaluated by analysis of calibration standards for the three \ninjections of each concentration for each of the five HE-adducts. This was calculated \nin the same way over a three day period and determined by the relative standard \ndeviation (R.S.D = S.D.\/mean concentration) x 100. The limit of quantitation (LOQ) \nwas defined as a signal to noise baseline ratio of 7:1.  \n \nMeasurement of HE-DNA adducts in DNA. \nA variety of samples were analysed for the presence of HE-DNA adducts to \ndemonstrate potential applications of the LC-MS\/MS assay. Background levels of \nadducts were measured in commercially available control calf thymus (CT) DNA, and \nliver DNA from an untreated (control) male F-344 rat, provided from another study as \ndescribed by Marsden, et al.42 In addition, adducts were measured in a pSP189 \nplasmid DNA isolated from E.coli bacteria43 that had been exposed to EO in vitro, by \nreacting with 10mM EO for 24h at 37ºC in water. HE-DNA adducts were isolated \nfrom the three types of DNA, purified by HPLC and quantitated by LC-MS\/MS as \ndetailed above.  \n \nRESULTS AND DISCUSSION \nWe have developed a sensitive and specific method allowing the simultaneous \ndetection and quantitation of multiple HE-DNA adducts formed as a result of EO \nexposure. The standards were synthesised by reaction of nucleosides with EO and \npurification of the reaction products by HPLC. The reaction between dU and EO \n 12\nresulted in one major product, in addition to unreacted dU, as detected by HPLC-UV \n(Figure 2A) and MS analysis indicated that this peak had the predicted m\/z of 273, \nconsistent with N3-HEdU. This structure was further confirmed by MS\/MS analysis, \ncontaining fragment ions equivalent to N3-HEU and the 2’-deoxyribose. EO is known \nto react with both the N1- and N6- position of dA, as well as the N3-position, although \nthis adduct is labile and can readily depurinate. On reaction of EO with dA, 2 \ndifferent adduct peaks were evident by HPLC-UV analysis, which both resulted in \nmolecules with m\/z of 296 and produced the same dissociation spectra, when analysed \nby MS\/MS (Figure 2B). Both are consistent with a hydroxyethylated dA adduct. \nIncubation of each adduct fraction with NaOH caused the later eluting peak B to \nconvert into peak A. This confirmed that peak B was N1-HEdA and peak A was N6-\nHEdA, as in the presence of a strong base, a group at the N1- position can rearrange \nonto the N6- position, in a reaction known as the Dimroth rearrangement44. [15N5]-N1-\nHEdA was produced from an analogous reaction with [15N5]-labelled dA by isolating \nthe HPLC fraction with a similar retention time to that of N1-HEdA and the identity \nwas confirmed by MS\/MS. N7-HEG and [15N5]-N7-HEG base adducts were \nsynthesised by the reaction of guanosine with EO, then removal of the ribose group \nby acid hydrolysis. HPLC analyses of the reaction products revealed one major \nproduct peak in each reaction with similar retention times, which was then collected \nand the structures confirmed by ESI-MS, revealing the expected protonated molecules \nat m\/z 196 and m\/z 201 for the N7-HEG and [15N5]-labelled standards, respectively. \nThe structures of these two adducts were further confirmed by LC-MS\/MS analysis, \nsince the spectra produced by the dissociation of N7-HEG (m\/z = 196) is comparable \nto that reported by Liao et al.45 (Figure 2C).  \n \n 13\nEven though the assay utilised SRM as the analysis method, which allows the \nselective monitoring of a number of specific transitions, in any DNA sample HE-\nadducts would be present at extremely low levels relative to the normal, unmodified \nnucleosides. Therefore, enrichment procedures were necessary to minimise \ninterference with adduct quantitation and obtain the maximum sensitivity. The labile \nnature of the N7-HEG adduct was exploited in the selective isolation of this adduct \nfrom the intact DNA by thermal depurination and filtration. In addition to the desired \nadduct, the filtrate from this procedure would be expected to contain other \ndepurinating lesions present endogenously or produced by EO exposure, such as N3-\nHEA. Although other published assays analyse N7-HEG levels directly after \nhydrolysis and filtration43,45,48, this approach resulted in inconsistent measures of the \nnucleoside adducts, probably due to the presence of other base lesions or \ncontaminants in the filtrate causing interference or signal suppression during LC-\nMS\/MS analysis. Therefore, in order to enable the accurate quantitation of multiple \nHE-adducts simultaneously, it was necessary to purify the N7-HEG and [15N5]-\nlabelled internal standard by HPLC prior to analysis.  \n \nThe remaining HE-adducts were isolated by enzymatic digestion of the DNA \nrecovered from the microcon filter, which is then separated by HPLC using a system \ncapable of resolving the HE-adducts of interest from unmodified nucleosides (Figure \n4), with the exception of N3-HEdU, which co-elutes with dT and is isolated by a \nfurther HPLC purification step. The addition of a nucleoside adduct internal standard \n[15N5]-N1-HEdA prior to digestion accounts for losses due to subsequent sample \nhandling of the unlabeled analogue, particularly during the HPLC separation step. \nLC-MS\/MS analysis of nucleoside HE-adduct standards subjected to thermal \n 14\nhydrolysis prior to going through the assay procedure, confirmed the depurination \nstep did not cause loss of these adducts due to degradation. This was evidenced by the \nfact adduct levels for control and hydrolysed samples varied by no more than ± 5%. \n \nThe collected fractions from the preparative HPLC runs are then combined and \nanalysed for the presence of the 5 different HE-adducts simultaneously by LC-\nMS\/MS, by measuring a specific transition for each adduct. For nucleoside adducts, \nthe optimum transition was found to be dissociation of the adducted nucleoside (or \nequivalent sodiated species for N3-HEdU) into adducted base through loss of the \nsugar moiety, whilst for base adducts, dissociation to the base as a consequence of \nloss of the 2-hydroxyethyl group was most suitable. The best possible separation \nconditions and solvent system were established using the synthetic standards, and a \nSupelcosil C18, 250 x 2.1mm, 5µ column, eluted with an isocratic mobile phase of \n40% MeOH in 0.5% acetic acid, was found capable of providing the maximum \noverall sensitivity with optimum peak shape and retention time (Figure 5A). N3-HEA, \nN3-HEdT and N3-HEdC were not incorporated into this assay but could however be \nintroduced if required.  \n \nAssay Validation \nIn order to validate this assay, the following criteria were determined: linearity, \nprecision, repeatability, inter-day variability, intra-day variability and the LOQ. \nLinearity, inter-day variability, repeatability and the LOQ were determined by the \nconstruction of a series of calibration lines (Figure 5B). The calibration curves \nproduced from data obtained over the 3 day period were linear in the range 0.5-500 \nfmoles with a correlation coefficient R2 ≥ 0.99 for each individual adduct. Calculation \n 15\nof the R.S.D. for each concentration of individual HE-adducts was used to determine \nthe inter-day precision of the developed assay, which was found to be ≤ 20%. The \nlimits of quantitation were determined as 0.5 fmoles injected onto the column for N7-\nHEG and N1-HEdA, 5 fmoles for O6-HEdG and N6-HEdA and 25 fmoles for N3-\nHEdU. Measurement of N3-HEdU will always be an approximate value as an internal \nstandard is ideally required to compensate for losses due to the additional HPLC step. \n \nQuantitation of HE-DNA adduct levels in DNA. \nVery little is known about the formation or biological consequences of HE-DNA \nadducts apart from the major N7-HEG lesion. Although, based on evidence from in \nvitro binding studies, the other potential HE-adducts account for a small proportion of \ntotal adduct formation by EO, and it is possible that under some circumstances they \nmay be present at significant levels in vivo. The development of this assay provides, \nfor the first time, a method that could potentially detect these adducts in DNA \nsamples from exposed animals, humans or cultured cells, to determine whether they \nare formed and at what levels, using just a single DNA sample. The assay can also be \napplied to mechanistic studies, for example in combination with the supF forward \nmutation assay, which would allow mutagenic potency to be related to HE-DNA \nadduct profiles. \n \nIn order to demonstrate the possible applications of this assay, we have analysed \nlevels of endogenous\/background and EO-induced HE-adducts in various types of \nDNA as shown in Table 1 and Figure 6. The additional peaks present in the channels \nfor N1-HEdA and O6-HEdG are artefactual. MS\/MS analysis suggests that they are \nrelated to the adducts and it is possible that they could be corresponding residual \n 16\nnucleoside N3-HEA and N7-HEG adducts. N7-HEG was detected in liver DNA from \ncontrol rats at levels of ~8 adducts\/108 nucleotides, which is comparable with that \nfound by Wu et al., who reported endogenous adduct levels in the range of 5-8 \nadducts\/108 nucleotides46 and similar to the 1-3.5 adducts\/108 nucleotides described in \nthe Marsden study43. The DNA from the livers of rats treated with 1.5 mg\/kg was also \nanalysed (data not shown) but N7-HEG was still the only HE-adduct detected, \nsuggesting that this dose is not high enough to induce the formation of N1-HEdA and \nO6-HEdG, or that they are formed but at a limit that is below the LOD of this assay. In \nuntreated CT DNA, N7-HEG was the only HE-adduct detected, at background levels \nof ~10 adduct\/108 nucleotides. For there to be endogenous\/background adducts \npresent in commercially available DNA is not unexpected, for example C8-(1-\nhydroxyethyl)-guanine adducts have previously been reported in CT DNA47. O6-\nHEdG has previously been detected and measured in different rat tissues by \nfluorescence-HPLC at approximate levels of 3 adducts\/107 nucleotides but only after \n2 weeks of exposure to 300 ppm EO11. In this study, O6-HEdG was not detected in \nany of the control DNA samples but exposure of pSP189 plasmid to a high \nconcentration of EO (10mM) over a 24h period, induced measurable levels of O6-\nHEG (~575\/108 nucleotides), as shown in Figure 6, whilst also increasing the total \nN7-HEG and N1-HEdA to ~415166 and 24216 adducts\/108 nucleotides, respectively. \nN1-HEdA has only previously been observed in DNA treated with 14C-EO in vitro17, \nand only quantitated after a large-scale 50 mM reaction of EO with CT DNA18. \n \nMore recently, the method of choice for the detection of N7-HEG adducts has been \nLC-MS. Leclerq et al., described an assay using LC-MS with single ion monitoring \nwhich achieved an LOD of 1 pmole injected onto the column, and measured 3 N7-\n 17\nHEG adducts\/108 nucleotides in DNA from blood exposed to EO in vitro48. A similar \nmethod was published by Liao et al., with an LOD of 128 fmoles and the authors also \ndemonstrated that using LC-MS\/MS with SRM detection improved the sensitivity, \ndecreasing the LOD further to 16 fmoles45.  In comparison, the highest LOD of the \nfive HE-adducts analysed in this study is 25 fmoles injected onto the column. The \nmost sensitive published method to date for the detection of N7-HEG appears to be \nthe Gas Chromatography-Electron Capture-Mass Spectrometry method described by \nWu et al., which had an LOD of 600 amoles46. The assay described here is slightly \nmore sensitive, for both N7-HEG and N1-HEdA, with an LOD of 500 amoles, and has \nthe advantage that it does not require the production of a pentafluorobenzyl-N7-HEG \nderivative as part of the sample preparation step.  \n \nIn developing an LC-MS\/MS method for the simultaneous measurement of a \nnumber of different DNA adducts there is inevitably a compromise in sensitivity in \norder to achieve detection of all five HE-adducts. However, the LOD for the N7-HEG \nadduct is still more sensitive than any previous published method and with advances \nin technology, for example nanospray or ultra high pressure HPLC (UPLC), the \nsensitivity may be further improved in the future. In addition, if one wished to study \nany single HE-adduct specifically then the current assay could be tailored in favour of \nthat particular adduct by slight alteration of the MS conditions to maximise the \nsensitivity for the adduct of interest. Multi-adduct analysis is becoming a more \ncommon approach for the study of the effects of chemical carcinogens; recently, \nBrink et al., have described a method for the determination of three promutagenic \nadducts formed as a result of exposure to dimethylnitrosamine,49 and an assay for the \nquantification of four structurally different adducts caused by oxidative stress has \n 18\nbeen reported by Churchwell et al.50 Since most chemical carcinogens form a variety \nof lesions, it is more informative to quantitatively determine the adduct profile rather \nthan focus on a single adduct and these methods make this approach possible in a \nrapid and sensitive manner. \n \nConclusion \nIn summary, a sensitive and selective LC-MS\/MS assay has been developed and \nvalidated for the simultaneous detection and quantitation of five different HE-DNA \nadducts that can be formed as a result of EO exposure. This allows a more \ncomprehensive study of HE-adduct formation which has not previously been possible. \nTo demonstrate its utility, this assay has so far been employed in the measurement of \nendogenous\/background levels of DNA adducts in unexposed calf thymus and rat \nliver DNA, as well as EO-induced lesions in pSP189 plasmid DNA, and has the \npotential to be applied to the measurement of HE-DNA adducts from a wide variety \nof in vivo and in vitro studies to further our understanding of the significance of \nendogenous\/background and exogenous HE-DNA adducts. \n \nACKNOWLEDGMENT  \nThis work was funded by the Lower Olefins Sector Group and the Ethylene Oxide \nand Derivatives Sector Group of the European Chemical Industry Council (Cefic) and \nthe Olefins Panel of the American Chemistry Council. \n \n \nFIGURE CAPTIONS  \n 19\nFigure 1: The different possible HE-adducts that can be produced as a result of \nethylene oxide reaction with DNA. Adducts are shown in their base form. \n \nFigure 2: Characterisation of synthesised HE-DNA adducts. HPLC purification of the \nreaction products are shown, with the corresponding ESI-MS\/MS spectra for the \nproduct peak inserted. The separation of N3-HEdU from unmodified nucleoside is \nshown in (A). (B) shows a typical ESI-MS\/MS spectra for N6-HEdA, which is \nidentical to that produced by N1-HEdA (not shown), (C) shows the purification and \ncharacterisation of N7-HEG.  \n \nFigure 3: Scheme depicting the sample preparation steps prior to LC-MS\/MS \nanalysis. \n \nFigure 4: HPLC chromatogram demonstrating the separation of HE-nucleoside \nadducts from unmodified nucleosides, using the conditions employed for the isolation \nof nucleoside HE-adducts. Synthetic adduct standards have been used to produce this \ntrace for illustrative purposes; in a typical digested DNA sample HE-adducts would \nnot usually be present at detectable levels and fractions would be collected on the \nbasis of retention time. \n \nFigure 5: Panel A shows a typical LC-MS\/MS chromatogram resulting from the \nsimultaneous measurement of 500 fmoles of each individual adduct standard. Panel B \nillustrates calibration lines for each of the five HE-DNA adduct standards that were \nused to validate the LC-MS\/MS assay. \n \n 20\nFigure 6: Representative LC-MS\/MS chromatograms from the analysis of liver DNA \nfrom a control F-344 rat (A) and pSP189 plasmid DNA reacted with 10 mM EO in \nvitro (B).  \n \n 21\n N N\nN N\nNH2\nOH\nN\nH N\nN N\nNH\nOH\nN\nH N\nN N\nNH\nOH\nN N\nNH\nO\nNH2\nOH\nN\nN\nH N\nN N\nO\nNH2\nOH\nN\nH\nN\nO\nO\nCH3 OH\nN\nH\nN\nO\nO\nOH\nNH2\nN\nN\nO\nOH\nDeamination\nN7-HEG\nO6-HEG\nN3-HET\nN3-HEA\nN1-HEA\nN6-HEA\nN3-HEC N3-HEU\n \nFigure 1 \n \n \n 22\n5 10 15 20 25 30 35\n1.00\n0.75\n0.50\n0.25\n0\n1.25\nV\nol\nts\n5 10 15 20 25 30 35 Minutes\n5 10 15 20 25 30 35Minutes\n1.00\n0.75\n0.50\n0.25\n0\n1.25\nV\nol\nts\n25\n20\n15\n10\n5\n0\nm\nVo\nlts\nMinutes\nN3-HEdUUnmodified dU\nN6-HEdA\nN1-HEdA\n0\n%\n110\n135\n152 196100\nm\/z\nN7-HEG\nA\nC\n100\n%\n0\n117\n139\n157\n273\nm\/z\n150 250200\n100 200150\nB\n296\n180\n117\n%\n0\n100 200 300\n100\nm\/z\n \nFigure 2 \n \n 23\n DNA (50 – 100µg) Thermal Hydrolysis\nHPLC isolation of\nN7-HEG\nCombine fractions\nDigest to nucleosides\nHPLC isolation of \nHE-nucleoside adducts\nLC-MS\/MS Quantitation\nfiltrate\nRecovered\nDNA\n[15N5]-N7-HEG [15N5]-N1-HEdA\n Figure 3:  \n \n 24\n250\n200\n150\n100\n50\n0\n10 20 30 40\ndC\ndG\/dA\ndT\/N3-HEdU\nN1-HEdA\nO6-HEdG\nAb\nso\nrb\nan\nce\n (V\nol\nts\n)\nMinutes\nN6-HEdA\n \nFigure 4: \n \n 25\nBO6-HEdG\n[15N5]-N1-HEdA\nN1-HEdA N6-HEdA\nN3-HEdU\nN7-HEG\nA\nAmount of HE-DNA adduct (fmoles)\nN7-HEG\nN1-HEdA\nO6-HEdG\nN6-HEdA\nN3-HEdU\n[15N5]-N7-HEG\nR2 = 0.9998\nR2 = 0.9988\nR2 = 1\nR2 = 0.9971\nR2 = 0.9915\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n0 100 200 300 400 500 600R\nat\nio\n to\n [1\n5 N\n5]-\nN\n1-\nH\nEd\nA\n a\nnd\n [1\n5 N\n5]\n-N\n7-\nH\nE\nG\n100\n%\n0\n100\n%\n0\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n  \n \nFigure 5: \n \n 26\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00\n2.00 4.00 6.00 8.00 10.00 12.00 14.00 16.00 18.00 20.00 Time\n100\n100\n100\n100\n100\n100\n100\n0\n0\n0\n0\n0\n0\n0\n201 > 157\n196 > 152\n296 > 180\n301 > 185\n312 > 196\n201 > 157\n196 > 152\n11.45\n11.33\n9.86\n11.71\n11.77\n7.54\n8.74\n9.07\n9.07\nO6-HEdG\n15N5-N1-HEdA\nN1-HEdA\nN7-HEG\n15N5-N7-HEG\nN7-HEG\n15N5-N7-HEG\nA\nB\n \n \nFigure 6:  \n 27\n Table I. Representative adduct levels per 108 nucleotides present in calf thymus, \npSP189 plasmid and rat liver DNA, as measured by the LC-MS\/MS assay. Results \npresented are from the duplicate analysis of a single sample for each type of DNA, \nand are reported as the mean value. \nDNA sample Adducts\/108 nucleotides \n N7-HEG N1-HEdA O6-HEdG \nControl rat liver 8 ± 1.5 < LOD* <LOD \nCalf thymus DNA 59 ± 1 <LOD <LOD \nEO exposed plasmid (10mM)** 415166 ± 19470 24216 ±5967 575 ± 21 \n \n*Less than the limit of detection, this is approximately 1 adduct\/109 for N1-\nHEdA and 1 adduct\/108 for O6-HEdG. N6-HEdA and N3-HEdU adducts were \nnot detectable in any samples analysed. **Treatment with higher \nconcentrations of EO resulted in a dose dependent increase in these adducts \n(data not shown). \n \n 28\nREFERENCES  \n1. IARC Monographs. Some Industrial Chemicals. 1994; 60,;73.  \n \n2. Segerbäck, D. Chemico Biological Interactions 1983; 45(2); 139. \n \n3. Filser, J.G.; Denk, B.; Tornqvist, M.; Kessler, W.; Ehrenberg, L. Archives in \nToxicology 1992; 66(3); 157. \n \n4. Elfarra, A.A.; Duescher, R.J.; Pasch, C.M. Archives in Biophysical Biochemistry \n1991; 286; 244. \n \n5. Ehrenberg, L.; Hussein, S. Mutation Research 1977; 46(3); 196. \n \n6. Leibermann, M.; Mapson, L.W. Nature. 1964; 204; 343.  \n \n7. Tornqvist, M.; Gustafsson, B.; Kautiainen, A.; Harms-Ringdahl, M.; Granath, F.; \nEhrenberg, L. Carcinogenesis. 1989; 10; 39. \n \n8. Kessler, W.; Remmer, H. Biochemical Pharmacology 1990; 39; 1347. \n \n9. Clemens, M.R.; Einsele, H.; Frank, H.; Remmer, H.; Waller, H.D. Biochemical \nPharmacology 1983; 32; 3877. \n \n10. Nivard, M.J.M.; Czene, K.; Segerbäck, D.; Vogel, E.W. Mutation Research 2003; \n529; 95. \n 29\n 11. Walker, V.E.; Fennell, T.R.; Boucheron, J.A.; Fedtke, N.; Ciroussel, F.; \nSwenberg, J.A. Mutation Research 1990; 233; 151. \n \n12. Kelsey, K.T.; Wiencke, J.K.; Eisen, E.A.; Lynch, D.W.; Lewis, T.R.; Little, J.B. \nCancer Research 1988; 48(17); 5045. \n \n13. Hogstedt, C.; Malmqvist, N.; Wadman, B. Journal of the American Medical \nAssociation 1979; 241; 1132. \n \n14. Hogstedt C.; Aringer, L.; Gustavsson, A. Journal of the American Medical \nAssociation 1986; 255(12); 1575.  \n \n15. Teta. M.J.; Sielken. R.L.; Valdez-Flores. C. Risk Analysis 1999; 19; 1135. \n \n16. Coggon, D.; Harris, E. C.; Poole, J.; Palmer K. T. Occupational and Environmental \nMedicine 2004; 61; 358. \n \n17. Segerbäck, D. Carcinogenesis, 1990; 11(2); 307. \n \n18. Li, F.; Segal, A.; Solomon, J.J. Chemico Biological Interactions 1992; 83; 35. \n \n19. Lawley, P.D.; Brookes, P. Biochemical Journal 1963; 89; 127. \n \n20. Takeshita, M.; Chang, C-H.; Johnson, F.; Will, S.; Grollman, A.P. Journal of \nBiological Chemistry 1987; 262(21); 10171. \n \n21. Loeb, L.A.; Preston, B.D. Annual Reviews in Genetics 1986; 20; 201. \n 30\n 22. Lawley, P.D. British Medical Bulletin 1980; 36(1); 19. \n \n23. Solomon, J.J.; Mukai, F.; Fedyk, J.; Segal, A. Chemico Biological Interactions \n1988; 67; 275. \n \n24. Solomon, J.J.; Segal, A. Environmental Health Perspectives 1989; 81; 19. \n \n25. Bhanot, O.S.; Singh, U.S.; Soloman, J.J. Journal of Biological Chemistry 1994; \n269(47); 30056. \n \n26. Barlow, T.; Takeshita, J.; Dipple, D. Chemical Research in Toxicology 1998; 11; \n838. \n \n27. Gamboa da Costa, G.; Churchwell, M.I.; Hamilton, L.P.; Von Tungeln, L.S.; \nBeland, F.A.; Marques, M.M.; Doerge, D.R. Chemical Research in Toxicology 2003; \n16; 1328. \n \n28. Rusyn I.; Asakura, S.; Li, Y.; Kosyk, O.; Koc, H.; Nakamura, J.; Upton, P.B.; \nSwenberg, J.A. DNA Repair 2005; 4; 1099. \n \n29. Loeppky, R. N.; Ye, Q.; Goelzer, P.; Chen, Y. Chemical Research in Toxicology \n2002; 15; 470. \n \n 31\n30. Eide, I.; Zhao, C.; Kumar, R.; Hemminki, K.; Wu, K-Y.; Swenberg, J.A. \nChemical Research in Toxicology 1999; 12; 979. \n \n31. Koivisto, P; Hemminki, K. Carcinogenesis 1990; 11(8); 1389. \n \n32. Kumar, R.; Staffas, J.; Forsti, A.; Hemminki, K. Carcinogenesis 1995; 16(3); 483. \n \n33. Kumar, R.; Hemminki. K. Carcinogenesis 1996; 17(3); 485. \n \n34. Zhao, C.; Tyndyk, M.; Eide, I.; Hemminki, K. Mutation Research 1999; 424; 117. \n \n35. van Delft, J.H.M.; van Winden, M.J.M.; Luiten-Scuite, A.; Ribiero, L.R.; Baan, \nR.A. Carcinogenesis 1994; 15(9); 1867. \n \n36. Walker, V.E.; Fennell, T.R.; Upton, P.B.; Skopek, T.R.; Prevost, V.; Shuker, \nD.E.G.; Swenberg, J.A. Cancer Research 1992; 52; 4328. \n \n37. Saha, M.; Abushamaa, A.; Giese, R.W. Journal of Chromatography A 1995; 712; \n345. \n \n38. Singh, R.; Farmer, P.B. Carcinogenesis, 2006; 27(2) 178. \n \n39. Kao, C.-Y.; Geise, R.W. Chemical Research in Toxicology 2005; 18; 70. \n \n 32\n40. Plna, K.; Nilsson, R.; Koskinen, M.; Segerbäck, D. Carcinogenesis 1999; 20(10); \n2025. \n \n41. Tretyakova, N.Y.; Burney, S.; Pamir, B.; Wishnok, J.S.; Dedon, P.C.; Wogan, \nG.N.; Tannenbaum S.R. Mutation Research: Fundamental Molecular Mechanisms in \nMutagenesis 2000; 447; 287.  \n \n42. Marsden, D.A.; Jones, D.J.L.; Lamb, J.H. Tompkins, E.M.; Farmer, P.B.; Brown, \nK. Chemical Research in Toxicology 2007, 20; 290. \n \n43. McLuckie, K.I.E.; Crookston R.J.R.; Gaskell, M.; Farmer, P.B.; Routledge, M.N.; \nMartin E.A.; Brown, K. Biochemistry 2005; 44; 8198. \n \n44. Brookes, P.; Lawley, P.D. Journal of the Chemistry Society 1960; 539. \n \n45. Liao, P.-C.; Li, C-M.; Hung, C-W.; Chen, S-H. Journal of  Mass Spectrometry \n2001; 36; 336. \n \n46. Wu, K.-Y.; Scheller, N.; Ranasinghe, A.; Yen, T-Y.; Sangaiah, R.; Giese, R.; \nSwenberg, J.A. Chemical Research in Toxicology 1999; 12; 722. \n \n47. Nakao, L.S.; Fonseca, E.; Augusto, O. Chemical Research in Toxicology 2002; \n15; 1248. \n \n48. Leclercq, L.; Laurent, C.; De Pauw, E. Analytical Chemistry 1997; 69; 1952. \n \n 33\n49. Brink, A.; Lutz, Y.; Volkel, W.; Lutz, W.K. Journal of Chromatography B  2006; \n830; 255. \n \n50. Churchwell, M.I.; Beland, F.A.; Doerge, D.R. Chemical Research in Toxicology \n2002; 15; 1295. \n \n 34\n"}