{"doi":"10.1051\/0004-6361:20021325","coreId":"66433","oai":"oai:dro.dur.ac.uk.OAI2:1504","identifiers":["oai:dro.dur.ac.uk.OAI2:1504","10.1051\/0004-6361:20021325"],"title":"VLT spectroscopy of NGC 3115 globular clusters.","authors":["Kuntschner, H.","Ziegler, B.L.","Sharples, R.M.","Worthey, G.","Fricke, K.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-12-01","abstract":"We present results derived from VLT-FORS2 spectra of 24 different globular clusters associated with the lenticular galaxy NGC 3115. A subsample of 17 globular clusters have sufficiently high signal-to-noise to allow precision measurements of absorption line-strengths. Comparing these indices to new stellar population models by Thomas et al. we determine ages, metallicities and element abundance ratios. For the first time these stellar population models explicitly take abundance ratio biases in the Lick\/IDS stellar library into account. Our data are also compared with the Lick\/IDS observations of Milky Way and M 31 globular clusters. Unpublished higher order Balmer lines (HgammaA ,F and HdeltaA ,F) from the Lick\/IDS observations are given in the Appendix. Our best age estimates show that the observed clusters which sample the bimodal colour distribution of NGC 3115 are coeval within our observational errors (2-3 Gyr). Our best calibrated age\/metallicity diagnostic diagram (Hbeta \/ vs. [MgFe]) indicates an absolute age of 11-12 Gyr consistent with the luminosity weighted age for the central part of NGC 3115. We confirm with our accurate line-strength measurements that the (V-I) colour is a good metallicity indicator within the probed metallicity range (-1.5 < [Fe\/H] < 0.0). The abundance ratios for globular clusters in NGC 3115 give an inhomogeneous picture. We find a range from solar to super-solar ratios for both blue and red clusters. This is similar to the data for M 31 while the Milky Way seems to harbour clusters which are mainly consistent with [alpha \/ Fe] =~ 0.3. From our accurate recession velocities we detect, independent of metallicity, clear rotation in the sample of globular clusters. In order to explain the metallicity and abundance ratio pattern, particularly the range in abundance ratios for the metal rich globular clusters in NGC 3115, we favour a formation picture with more than two distinct formation episodes. Based on observations collected at the European Southern Observatory, Cerro Paranal, Chile (ESO No. 66.B-0131)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66433.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1504\/1\/1504.pdf","pdfHashValue":"4a0fed51d620cd4addf1e6692fd80941d1efc587","publisher":"EDP Sciences","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1504<\/identifier><datestamp>\n      2017-03-09T16:31:55Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        VLT spectroscopy of NGC 3115 globular clusters.<\/dc:title><dc:creator>\n        Kuntschner, H.<\/dc:creator><dc:creator>\n        Ziegler, B.L.<\/dc:creator><dc:creator>\n        Sharples, R.M.<\/dc:creator><dc:creator>\n        Worthey, G.<\/dc:creator><dc:creator>\n        Fricke, K.J.<\/dc:creator><dc:description>\n        We present results derived from VLT-FORS2 spectra of 24 different globular clusters associated with the lenticular galaxy NGC 3115. A subsample of 17 globular clusters have sufficiently high signal-to-noise to allow precision measurements of absorption line-strengths. Comparing these indices to new stellar population models by Thomas et al. we determine ages, metallicities and element abundance ratios. For the first time these stellar population models explicitly take abundance ratio biases in the Lick\/IDS stellar library into account. Our data are also compared with the Lick\/IDS observations of Milky Way and M 31 globular clusters. Unpublished higher order Balmer lines (HgammaA ,F and HdeltaA ,F) from the Lick\/IDS observations are given in the Appendix. Our best age estimates show that the observed clusters which sample the bimodal colour distribution of NGC 3115 are coeval within our observational errors (2-3 Gyr). Our best calibrated age\/metallicity diagnostic diagram (Hbeta \/ vs. [MgFe]) indicates an absolute age of 11-12 Gyr consistent with the luminosity weighted age for the central part of NGC 3115. We confirm with our accurate line-strength measurements that the (V-I) colour is a good metallicity indicator within the probed metallicity range (-1.5 < [Fe\/H] < 0.0). The abundance ratios for globular clusters in NGC 3115 give an inhomogeneous picture. We find a range from solar to super-solar ratios for both blue and red clusters. This is similar to the data for M 31 while the Milky Way seems to harbour clusters which are mainly consistent with [alpha \/ Fe] =~ 0.3. From our accurate recession velocities we detect, independent of metallicity, clear rotation in the sample of globular clusters. In order to explain the metallicity and abundance ratio pattern, particularly the range in abundance ratios for the metal rich globular clusters in NGC 3115, we favour a formation picture with more than two distinct formation episodes. Based on observations collected at the European Southern Observatory, Cerro Paranal, Chile (ESO No. 66.B-0131). <\/dc:description><dc:subject>\n        Galaxies<\/dc:subject><dc:subject>\n         Abundances<\/dc:subject><dc:subject>\n         Star clusters<\/dc:subject><dc:subject>\n         Stellar content<\/dc:subject><dc:subject>\n         Global clusters.<\/dc:subject><dc:publisher>\n        EDP Sciences<\/dc:publisher><dc:source>\n        Astronomy & astrophysics, 2002, Vol.395(3), pp.761-777 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1504<\/dc:identifier><dc:identifier>\n        issn:0004-6361<\/dc:identifier><dc:identifier>\n        issn: 1432-0746<\/dc:identifier><dc:identifier>\n        doi:10.1051\/0004-6361:20021325<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1504\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1051\/0004-6361:20021325<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1504\/1\/1504.pdf<\/dc:identifier><dc:rights>\n        Reproduced with permission from Astronomy & Astrophysics, © ESO<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1432-0746","0004-6361","issn:0004-6361","issn: 1432-0746"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Galaxies","Abundances","Star clusters","Stellar content","Global clusters."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n29 May 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKuntschner, H. and Ziegler, B. L. and Sharples, R. M. and Worthey, G. and Fricke, K. J. (2002) ’VLT\nspectroscopy of NGC 3115 globular clusters.’, Astronomy astrophysics., 395 (3). pp. 761-777.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1051\/0004-6361:20021325\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nDeposited in DRO: \n29 May 2008. \n \nVersion of attached file: \nPublished. \n \nPeer-review status of attached file: \nPeer-reviewed. \n \nCitation for published item: \nKuntschner, H. and Ziegler, B. L. and Sharples, R. M. and Worthey, G. and Fricke, K. \nJ. (2002) 'VLT spectroscopy of NGC 3115 globular clusters.' , Astronomy & \nastrophysics., 395 (3), pp. 761-777. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1051\/0004-6361:20021325\n \nA&A 395, 761–777 (2002)\nDOI: 10.1051\/0004-6361:20021325\nc© ESO 2002\nAstronomy\n&\nAstrophysics\nVLT spectroscopy of NGC3115 globular clusters?\nH. Kuntschner1;4, B. L. Ziegler2;3, R. M. Sharples4, G. Worthey5, and K. J. Fricke3\n1 European Southern Observatory, Karl-Schwarzschild-Str. 2, 85748 Garching bei Mu¨nchen, Germany\n2 Academy of Sciences, Theaterstr. 7, 37073 Go¨ttingen, Germany\n3 Universita¨tssternwarte, Geismarlandstrasse 11, 37083 Go¨ttingen, Germany\n4 Department of Physics, University of Durham, Durham DH1 3LE, UK\n5 Department of Physics, Washington State University, 1245 Webster Hall, Pullman, WA 99164-2814, USA\nReceived 17 July 2002 \/ Accepted 9 September 2002\nAbstract. We present results derived from VLT–FORS2 spectra of 24 different globular clusters associated with the lenticular\ngalaxy NGC 3115. A subsample of 17 globular clusters have sufficiently high signal–to–noise to allow precision measurements\nof absorption line-strengths. Comparing these indices to new stellar population models by Thomas et al. we determine ages,\nmetallicities and element abundance ratios. For the first time these stellar population models explicitly take abundance ratio\nbiases in the Lick\/IDS stellar library into account. Our data are also compared with the Lick\/IDS observations of Milky Way\nand M 31 globular clusters. Unpublished higher order Balmer lines (HγA;F and H\u000eA;F) from the Lick\/IDS observations are given\nin the Appendix.\nOur best age estimates show that the observed clusters which sample the bimodal colour distribution of NGC 3115 are coeval\nwithin our observational errors (2–3 Gyr). Our best calibrated age\/metallicity diagnostic diagram (H\f vs. [MgFe]) indicates an\nabsolute age of 11–12 Gyr consistent with the luminosity weighted age for the central part of NGC 3115. We confirm with our\naccurate line-strength measurements that the (V − I) colour is a good metallicity indicator within the probed metallicity range\n(−1:5 < [Fe=H] < 0:0). The abundance ratios for globular clusters in NGC 3115 give an inhomogeneous picture. We find a\nrange from solar to super-solar ratios for both blue and red clusters. This is similar to the data for M 31 while the Milky Way\nseems to harbour clusters which are mainly consistent with [\u000b=Fe] ’ 0:3. From our accurate recession velocities we detect,\nindependent of metallicity, clear rotation in the sample of globular clusters.\nIn order to explain the metallicity and abundance ratio pattern, particularly the range in abundance ratios for the metal rich\nglobular clusters in NGC 3115, we favour a formation picture with more than two distinct formation episodes.\nKey words. galaxies: abundances – galaxies: individual: NGC 3115 – galaxies: star clusters – galaxies: stellar content –\nglobular clusters: general\n1. Introduction\nThe analysis of globular cluster systems in external galaxies is\nstarting to fulfil its long-held promise as a probe of the forma-\ntion of galaxies. Globular clusters (hereafter GCs) are a fossil\nrecord of this formation process, and provide one of the best\ntools with which to investigate the chemical enrichment and\nstar formation history in the initial stages of galaxy formation\n(e.g., Ashman & Zepf 1998). Much recent interest has focused\non the globular cluster systems of luminous elliptical galaxies\nwhere the combination of metallicities and kinematics can be\nused to distinguish between variants of the popular monolithic\ncollapse and merger models for galaxy formation (e.g., Forbes\net al. 1997; Sharples et al. 1998).\nSend offprint requests to: H. Kuntschner,\ne-mail: hkuntsch@eso.org\n? Based on observations collected at the European Southern\nObservatory, Cerro Paranal, Chile (ESO No. 66.B-0131).\nLenticular galaxies hold a key position in the Hubble\nsequence of morphological types, intermediate between\npure spheroidal systems like luminous ellipticals and disk-\ndominated spiral galaxies. Their formation mechanism is still\nthe subject of considerable debate with evidence both for\n(Dressler et al. 1997) and against (Dressler 1980) their evo-\nlution from star-forming spirals via processes of gas stripping\nand exhaustion. A key question is when and how did such pro-\ncesses occur for S0 galaxies in a wide range of environments\nfrom rich clusters to the field. The globular cluster systems\nof S0 galaxies can provide independent constraints on when\nthe major star formation episodes occurred both in the disk\nand halo. However, thus far they have been little studied with\nonly NGC 1380 (Kissler-Patig et al. 1997) and NGC 4594 (the\nSombrero galaxy, Bridges et al. 1997) having received any de-\ntailed attention and only with photometric methods.\n762 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nNGC 3115 is one of the nearest S0 galaxies (9:7\u0006 0:4 Mpc,\nMB = −20:1; Tonry et al. 2001) and is located in the sparse\nlow-density environment of the Leo Spur. As such it pro-\nvides an ideal test case for studying the formation mechanism\nof field S0’s. A significant globular cluster system contain-\ning \u0018500 clusters was first detected by Hanes & Harris (1986)\nusing photographic plates. The nature of the cluster system and\nits origin were recently thrown into question with the discov-\nery by Elson (1997) that the red-giant stars in the NGC 3115\nhalo \u001840 kpc from the centre showed a bimodal colour dis-\ntribution. The inferred presence of two distinct halo popula-\ntions of roughly equal size at metallicities of [Fe=H] ’ −0:7\nand [Fe=H] ’ −1:3 suggests at least two distinct epochs of\nformation.\nThe (V − I) colour distribution of the NGC 3115 glob-\nular cluster system has been the target of two recent in-\ndependent studies using HST (Kundu & Whitmore 1998)\nand CFHT (Kavelaars 1998) data. Both studies find bimodal-\nity in the colour distributions of the GCs, with mean metal-\nlicities at [Fe=H] ’ −0:37 and [Fe=H] ’ −1:36 suggesting\nthat the cluster and halo star systems may have formed co-\nevally. This suggestion has gained further support from an in-\nvestigation by Puzia et al. (2002b) who employed optical–IR\ncolours to probe the globular cluster population close to the\ncentre of NGC 3115. They also find two peaks in metallic-\nity and an average age around \u001910 Gyr. However, their age\ndiscrimination power is very limited for metallicities lower\nthan [Fe=H] = −0:4.\nOne scenario in which the above observations could be\nunderstood is if the metal-poor component corresponds to a pri-\nmordial ’13 Gyr old population, whilst the metal-rich compo-\nnent formed a few Gyr later from enriched gas, possibly as the\nresult of a minor merger (e.g., Bekki 1998). With only broad-\nband colours available, however, the well-known degeneracy\nbetween metallicity and age (Worthey 1994) makes such con-\nclusions very uncertain.\nFor that reason, we have started a campaign to spectro-\nscopically study the globular cluster system in NGC 3115. Our\nprecision measurements of absorption line-strengths can be\nused to derive age and metallicity estimates directly from the\ncomparison with new stellar population models. Unlike pho-\ntometric methods, with spectroscopy we are also able to ex-\nplore element abundance ratios for the GCs. We compare our\nresults with other very recently obtained spectroscopic sam-\nples of GCs in early-type galaxies: in the giant Fornax ellip-\ntical NGC 1399 (Forbes et al. 2001), the Sa\/Sb galaxy M 81\n(Schroder et al. 2002), the SB0 galaxy NGC 1023 (Larsen\n& Brodie 2002) and the Sombrero galaxy NGC 4594 (Larsen\net al. 2002).\nThe paper is organized as follows. In Sect. 2, the obser-\nvations and their reduction are discussed. Section 3 presents\nthe colour distribution of our sample while in Sect. 4 the treat-\nment of abundance ratios and new stellar population mod-\nels are investigated. Our results on abundance ratios, age and\nmetallicity distributions for GCs in NGC 3115, the Milky Way\n(hereafter MW) and M 31 are presented in Sect. 5 with a gen-\neral discussion in Sect. 6. We present our conclusions in Sect. 7.\n2. Observations and data reduction\nThe candidate GCs were selected from the HST\/WFPC2 inves-\ntigation of Kundu & Whitmore (1998) who detected 144 glob-\nular cluster candidates in the central region of NGC 3115. In\norder to keep integration times reasonably short only clus-\nters with V < 22 (the peak of the GC luminosity function is\nat V = 22:37 \u0006 0:05; Kundu & Whitmore 1998) were selected\nwhile keeping a balance between red ((V − I) < 1:06) and blue\n((V − I) \u0015 1:06) clusters. In order to utilize the full field-of-\nview of our multi-object spectrograph we supplemented this\nlist with GC candidates from a low resolution spectroscopy sur-\nvey reported in Kavelaars (1998) and also placed some slits on\npromising objects without prior information (see Table 1). In\ntotal two masks with each 26 slitlets covering more than 50 dif-\nferent GC candidates were manufactured.\nThe observations were carried out 26\/27 Feb. 2001 with\nFORS2 on VLT using the blue 600 l\/mm grism and 100 wide\nslitlets giving a resolution of \u00184.8 Å (FWHM) sampled\nat 1.2 Å pixel−1. The seeing was generally FWHM \u0014 1:000. The\ntotal exposure time for the first mask was 12 440 s split up in six\nindividual exposures of varying length. Due to bad weather the\nsecond mask was only exposed for 2700 s which was not long\nenough to be of use for this study. The flux standard GD 71 was\nobserved through a long-slit (2:005 width) to enable us to correct\nthe continuum shape of the spectra.\nThe standard data reduction procedures (bias subtraction,\nflat-fielding, wavelength calibration, sky-subtraction and con-\ntinuum correction to a relative flux scale) were performed\nwith a combination of MIDAS and IRAF tasks. For each slit a\n2-dimensional subsection of the CCD was extracted and then\ntreated as a long-slit observation. The extraction region was de-\nfined by tracing the globular cluster spectrum along the wave-\nlength direction and extracting the corresponding sections for\nthe flat-field and arc-lamp observations. The cosmic rays were\nremoved with the routine lacos spec (van Dokkum 2001).\nThe wavelength calibration was accurate to <0.2 Å. After sky-\nsubtraction GCs were extracted from the individual exposures\nto achieve an optimal S=N (Horne 1986). Finally, the spectra of\nthe individual exposures were combined.\nWe used the spectroscopic flux standard GD 71 to correct\nthe continuum shape of our spectra to a relative flux scale and\napplied a reddening correction of E(B − V) = 0:146 (Schlegel\net al. 1998). In order to transform our observations onto the\nLick\/IDS system we convolved our spectra with a wavelength-\ndependent Gaussian kernel (taking into account small varia-\ntions of the instrumental resolution with position on the chip)\nthereby reproducing the Lick\/IDS spectral resolution (Worthey\n& Ottaviani 1997).\nAs a first analysis step we measured the recession velocity\n(with fxcor in IRAF) and S=N of the GC candidates. The first\nslit (Slitlet ID: 1) did not show any object which we ascribe to\na field distortion towards the edges of the field-of-view. Basic\ninformation for the remaining 28 globular cluster candidates is\nlisted in Table 1. The first column in this table is an object iden-\ntifier, the second column indicates from which source the object\nwas selected from. The following columns list the J2000.0 co-\nordinates and V , I photometry of Kundu & Whitmore (1998).\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 763\nTable 1. List of observed globular cluster candidates.\nSlitlet ID Originb RA J2000.0 Dec V (HST) (V − I) (HST) (V − I) (spec)c cz S=N member\n1 - No object in slit.\n2 - 10h05m06:005 −7\u000e45m0100 - - 1:183 408 \u0006 37 9 p\n3 - 10h05m06:001 −7\u000e44m3000 - - 1:142 439 \u0006 17 23 p\n4 - 10h05m09:009 −7\u000e45m0100 - - 0:883 0 \u0006 11 72 -\n5 WHT09 10h05m11:004 −7\u000e45m0100 - - 0:980 379 \u0006 21 32 p\n6 - 10h05m09:002 −7\u000e43m5200 - - - z = 0:39a - -\n7 HST08 10h05m12:006 −7\u000e44m2800 20:282 \u0006 0:006 1:178 \u0006 0:008 1:148 291 \u0006 16 28 p\n8 HST03 10h05m12:006 −7\u000e44m0900 19:794 \u0006 0:006 1:051 \u0006 0:009 1:029 393 \u0006 13 61 p\n9 HST02 10h05m13:001 −7\u000e43m5900 19:742 \u0006 0:005 1:077 \u0006 0:007 1:068 494 \u0006 16 38 p\n10 HST21 10h05m13:000 −7\u000e43m4100 21:072 \u0006 0:012 0:979 \u0006 0:018 1:050 456 \u0006 37 8 p\n11 HST39 10h05m14:007 −7\u000e43m5600 21:539 \u0006 0:014 1:199 \u0006 0:018 1:218 702 \u0006 31 8 p\n12 HST13 10h05m14:004 −7\u000e43m3500 20:544 \u0006 0:008 0:979 \u0006 0:011 0:982 582 \u0006 35 19 p\n13 HST18 10h05m15:002 −7\u000e43m3400 20:970 \u0006 0:010 0:989 \u0006 0:013 1:015 546 \u0006 28 12 p\n14a HST27 10h05m16:006 −7\u000e43m2900 21:266 \u0006 0:011 1:105 \u0006 0:015 1:117 321 \u0006 25 11 p\n14b HST12 10h05m17:002 −7\u000e43m2000 20:522 \u0006 0:007 1:159 \u0006 0:009 1:138 696 \u0006 15 23 p\n15 HST17 10h05m16:008 −7\u000e43m0900 20:946 \u0006 0:010 0:978 \u0006 0:013 1:021 739 \u0006 23 16 p\n16 HST32 10h05m18:000 −7\u000e43m1500 21:467 \u0006 0:012 0:913 \u0006 0:016 0:878 599 \u0006 54 12 p\n17 HST09 10h05m17:002 −7\u000e42m4900 20:393 \u0006 0:007 1:147 \u0006 0:010 1:167 813 \u0006 17 23 p\n18 HST31 10h05m18:004 −7\u000e42m4500 21:392 \u0006 0:012 1:190 \u0006 0:016 1:236 210 \u0006 23 9 p\n19 HST57 10h05m17:003 −7\u000e42m0800 21:921 \u0006 0:018 0:891 \u0006 0:028 0:983 736 \u0006 111 5 p\n20 HST46 10h05m17:006 −7\u000e41m5700 21:802 \u0006 0:015 0:919 \u0006 0:023 0:946 661 \u0006 55 7 p\n21 - 10h05m20:001 −7\u000e42m1600 - - 0:971 846 \u0006 42 12 p\n22 - 10h05m19:000 −7\u000e41m4700 - - 0:957 670 \u0006 41 7 p\n23 WHT15 10h05m20:002 −7\u000e41m4500 - - 1:140 682 \u0006 15 34 p\n24 WHT16 10h05m21:002 −7\u000e41m3800 - - 0:992 1008 \u0006 18 42 p\n25a - 10h05m23:004 −7\u000e41m5900 - - 0:832 202 \u0006 42 19 p\n25b - 10h05m23:007 −7\u000e41m5500 - - 0:890 721 \u0006 30 46 p\n26a - 10h05m22:007 −7\u000e41m1300 - - 1:068 803 \u0006 24 10 p\n26b WHT17 10h05m22:009 −7\u000e41m0700 - - 0:934 769 \u0006 25 19 p\na Background galaxy where [O] emission is visible.\nb HSTxx denotes globular clusters selected from the HST study of Kundu & Whitmore (1998), WHTxx are objects from the investigation of\nKavelaars (1998) while “-” indicates objects selected from our own VLT-FORS2 image in order to fill the mask.\nc Pseudo (V − I) colour derived from the globular cluster spectra. The mean error is 0.037 mag. See Sect. 3 for details.\nThe seventh column shows pseudo (V− I) colours derived from\nour spectroscopy (see Sect. 3 for details). Columns eight and\nnine list the radial velocity and the mean S=N per pixel respec-\ntively. Finally, column ten indicates whether the GC candidate\nis a spectroscopically confirmed member of the NGC 3115 sys-\ntem (see next paragraph).\nThe radial velocity of NGC 3115 is listed as 720\u0006 5 km s−1\nby Smith et al. (2000). Kavelaars (1998) find a mean velocity\nof 620 km s−1 and a velocity dispersion of \u001b = 177 km s−1\nfrom low resolution spectroscopic observations of 22 glob-\nular clusters. We consider all objects with radial velocities\nbetween 200 km s−1 and 1300 km s−1 as members of the\nNGC 3115 system. Object 6 is a background galaxy with a red-\nshift of z = 0:39, while object 4 is likely to be a galactic star. In\ntotal 26 out of 28 GC candidates (93%) turned out to be objects\nwhich are dynamically associated with NGC 3115. This low\ncontamination fraction is to be expected for a sample of can-\ndidates predominantly selected by morphological criteria from\nHST data.\nIn order to allow a proper line-strength analysis we restrict\nour sample to GCs with a mean S=N \u0015 12 per pixel1 yielding\na final sample of 17 GCs in NGC 3115. Below this signal-to-\nnoise cut the line-strength errors are too large to allow a proper\nage-metallicity analysis. The mean S=N of our final sample\nis 27 per pixel (ranging from 12 to 61). The GCs have a mean\n1 The S=N is determined as an average over the observed wave-\nlength range. The minimum S=N per resolution element is \u001925.\n764 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nFig. 1. Rest-frame spectra of globular clusters corrected to the Lick\/IDS resolution and sorted by increasing strength of our mean metallicity\nindicator [MgFe] (from top to bottom, see also Sect. 4). Note the change in overall continuum shape (metal poorer globular clusters are bluer)\nand also the change in absorption strength of the Balmer lines (H\u000e at 4101 Å, Hγ at 4340 Å and H\f at 4861 Å). The slitlet ID for each spectrum\nis indicated at the right hand side of the plot (see also Table 1).\nvelocity of 600 km s−1 (1\u001b scatter: 215 km s−1). The spectra of\nthese 17 GCs broadened to the Lick\/IDS resolution are shown\nin Fig. 1.\nWe note that the globular cluster 14a (HST27, S=N = 11)\nshows clear [OIII]\u00155007 emission which is however redshifted\nby \u0019190 km s−1 with respect to the recession velocity of the\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 765\nglobular cluster itself. Therefore the emission cannot be associ-\nated with the globular cluster itself, although the spatial extent\nof the emission is consistent with the size of the GC on the sky.\nLick indices (for index definitions see Worthey & Ottaviani\n1997; Trager et al. 1998) were measured from the resolution\nand continuum corrected spectra covering a common observed\nwavelength range of 3670–5500 Å. Uncertainties in the indices\nwere derived by Monte-Carlo simulations which take into ac-\ncount the photon noise, read-out noise of the CCD and the er-\nrors in the velocity determination. The Lick system is based\non non-flux calibrated spectra, so one expects small offsets\n(e.g., Kuntschner 2000) in the zero-point of the line indices.\nSince no stars in common with the Lick stellar library were\nobserved during our observing run we use the offsets estab-\nlished by Vazdekis (1999) for a large flux-calibrated sample\nof stars (“Jones library”) to transform our index measurements\nonto the Lick system. Since typical metallicities for GCs are\nbetween −2:0 < [Fe\/H] < 0:0, we calculated the offset by aver-\naging the values for [Fe=H] = −0:7 and −0:4 given by Vazdekis\n(1999 see his Table 2). Note, that some indices (e.g., Mg2) show\nstrong evidence for a metallicity dependent offset, which can\nintroduce systematic offsets as a function of line-strength. Here\nin this paper we use mainly indices where the former problem\nis only a second order effect. The measured index values and\ntheir associated errors are listed in Tables A.1 and A.2 in the\nAppendix.\nThe positions of the GCs with respect to the parent galaxy\nare shown in Fig. 2. Due to the optimisation of the target ef-\nficiency and the observational constraints of the FORS2 in-\nstrument the GCs lie in a narrow band \u00182500 eastwards of the\ngalaxy centre parallel to the major axis of NGC 3115. Both\nthe red and blue sub-samples were evenly distributed across\nthe CCD.\nIn Fig. 3 we assess the kinematics of all globular clusters\nwhich have recession velocities consistent with being members\nof the NGC 3115 system. There is a strong signature of GC ro-\ntation along the major axis of the galaxy. We confirm here the\nweak signal of rotation for the red cluster population detected\nby Kavelaars (1998). In our sample there is no clear difference\nbetween red and blue clusters, both show an equally strong sig-\nnal of rotation.\nSince our sample of GCs is dominated by clusters close\nto the location of the major axis (see Fig. 2) we note that the\nsample is probably biased to globular clusters associated with\nthe disk-formation of NGC 3115.\n3. Colour distribution\n9 out of 17 GCs for which we have good quality spectra\nand are kinematically associated with NGC 3115 are within\nthe HST\/WFPC2 image. In order to assign colours to the\nremaining 8 GCs we derived an empirical relationship between\na “pseudo-colour” measured from our flux-calibrated spectra\nand the HST (V − I) colours. Of course our limited wavelength\nrange does not allow us to measure a real (V − I) colour but\none can get a rough idea on the overall spectral shape. On the\nspectra we measured the mean counts in two regions (3900–\n4600 Å and 4800–5500 Å) and plotted the difference versus\nFig. 2. Positions of spectroscopically confirmed globular clusters with\nrespect to the centre of NGC 3115 (triangles represent blue clus-\nters and circles red clusters, see Sect. 3). Approaching and receding\nglobular clusters are indicated by open symbols and filled symbols\nrespectively, while the symbol size indicates the extent of the veloc-\nity difference with respect to the mean velocity of the whole sample.\nThe ellipse encloses half of the integrated light and indicates the po-\nsition and orientation of the main galaxy itself (data from Michard &\nMarchal 1994). North is up and east to the left.\nthe HST (V − I) colour (see Fig. 4). This procedure yields a\nlinear relationship with a mean scatter of 0.037 mag in derived\n(V − I) colour. Note that here we have used all available spec-\ntra of GC candidates with measured HST colours (see Table 1),\nspecifically including the ones with an S=N < 12 per pixel. The\nderived (V − I) colours are listed in Table 1 in column seven\nwhere we have assigned a mean error of 0.037 mag.\nThe colour distribution of our sample of 17 GCs is shown\nin Fig. 5 together with the full HST sample by Kundu &\nWhitmore (1998). The HST sample shows a clear bimodal\nstructure with peaks at (V − I) = 0:96 and (V − I) = 1:17.\nTaking the mean colour of the HST sample ((V − I) = 1:06) as\nthe dividing line between the red and blue clusters, our spec-\ntroscopic sample features eleven blue clusters and six red ones\nwhile spanning the range (V − I) = 0:87−1:18.\n4. Treatment of abundance ratios\nTheory of chemical enrichment predicts that stellar popula-\ntions created in a short burst of star formation show elevated\nmagnesium-to-iron abundance ratios while extended periods\nof star formation lead to roughly solar abundance ratios (e.g.,\nTinsley 1979; Worthey et al. 1992; Worthey 1998; Thomas\net al. 1999). This is generally explained by either a delay in\nthe production of Fe–peak elements with respect to \u000b–elements\ndue to the different timescales of SN Ia and SN II, or by a star-\nburst with an initial mass function skewed to massive stars.\n766 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nFig. 3. Assessment of rotation for NGC 3115 globular clusters. The tri-\nangles and circles represent blue and red clusters, respectively. Filled\nsymbols indicate the high S=N sample of 17 globular clusters for\nwhich we present a line-strength analysis in this paper. Panel a): The\nvertical axis shows the radial velocity of the globular clusters relative\nto the mean velocity of the sample. The horizontal axis is the position\nangle between a globular cluster and the galaxy centre, where a PA\nof 0 degrees represents north and positive is east of north. The sinu-\nsoid is a simple least-squares fit to the full sample with one iteration to\nreject outliers. Panel b): radial velocity is plotted against the projected\nmajor axis radius. Positive numbers are towards north-east. The small\ndots represent the stellar rotation curve of NGC 3115 along the major\naxis (Capaccioli et al. 1993).\nFig. 4. The pseudo colour derived from the spectra versus\n(V − I)HST. The linear fit corresponds to (V − I)HST = −1:08(\u00060:04) \u0002\n(spec colour) + 0:95(\u00060:01). For details see Sect. 3.\nFor example, many observations of bright elliptical galaxies in\nclusters show indeed elevated magnesium-to-iron ratios indi-\ncating a rapid star formation (e.g., Peletier 1989; Worthey et al.\n1992; Davies et al. 1993; Kuntschner 2000).\nFig. 5. Histogram of (V − I) colours of the cluster candidates from\nKundu & Whitmore (1998). Overplotted as a filled histogram is our\nspectroscopic sample of 17 confirmed globular clusters in NGC 3115.\nThe vertical dashed line indicates the dividing line between red and\nblue clusters at (V − I) = 1:06.\nGCs represent simple stellar populations (hereafter SSP,\ni.e., a unique age and chemical composition) since all the stars\nof one GC are thought to be created in a single star forma-\ntion event. But it is not known a priori whether the stars of a\ngiven GC are formed out of Fe-deficient gas clouds, which have\nbeen only enriched by SN II producing little Fe, or out of an al-\nready well mixed interstellar medium harbouring the products\nfrom both SN Ia (main producer of Fe) and SN II. For GC sys-\ntems with a bimodal colour distribution like in NGC 3115, all\nscenarios that have been proposed to explain the origin of the\nred metal-rich GCs start from the principle that the red popula-\ntion is formed in a separate star formation event (e.g., Ashman\n& Zepf 1992; Forbes et al. 1997). In a naive star-formation sce-\nnario, where the red clusters form from the well-mixed inter-\nstellar medium they should show solar abundance ratios.\nMost of the currently available stellar population models\nwhich can be used to investigate the abundance ratios of ex-\ntragalactic objects are based on stellar libraries from our own\nGalaxy. This has the disadvantage that, particularly at sub-\nsolar metallicities, galactic disk stars show super-solar abun-\ndance ratios for many \u000b-elements (Edvardsson et al. 1993;\nMcWilliam 1997). Therefore, without correction, the model\npredictions will be biased towards super-solar abundance ra-\ntios (e.g., Borges et al. 1995; Kuntschner 2000; Thomas et al.\n2002a).\nThomas et al. (2002a) (see also Thomas et al. 2002b) pro-\nvide new models which take the stellar library biases into ac-\ncount and can predict line-strengths for solar abundance as well\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 767\nFig. 6. Dependence of Mg b, [MgFe], hFei and H\f on [Fe\/H] and age for models with different [Mg\/Fe] as predicted by Thomas et al. (2002a).\nThe thick lines and open diamonds stand for [Mg=Fe] = +0:3 whereas the thin lines and plus symbols represent [Mg=Fe] = 0:0. The respective\nline-style and average measurement error for the different indices is given on the left hand side of panels a) and c). For the [MgFe] index the two\nmodel lines (for [Mg=Fe] = 0:0 and 0.3) overlap almost completely and therefore the index is almost independent of the Mg to Fe abundance\nratios.\nas non-solar abundance ratios over a large metallicity range\n(−2:25 \u0014 [Fe=H] \u0014 0:35). Since our paper is among the first\nthat make use of these new models for studying GC spectra,\nwe first explore systematically how the three parameters age,\nmetallicity and abundance ratio ([Mg\/Fe]) affect the absorption\nline-strengths of SSPs. For this purpose we plot in Fig. 6 the\nmodel predictions for the line-strengths of the often used metal-\nlicity indicators Mg b, hFei2 and [MgFe]3 and the age sensitive\nBalmer line H\f as a function of metallicity, age and [Mg\/Fe].\n2 hFei = (Fe5270 + Fe5335)=2 (Gonza´lez 1993).\n3 [MgFe] =\n√\nMg b \u0002 (Fe5270 + Fe5335)=2 (Gonza´lez 1993).\nThe effects of non-solar abundance ratios (thick lines) with\nrespect to solar ratio model predictions (thin lines) can be\nclearly seen for the metallicity sensitive indices Mg b and hFei.\nAt a given age and all metallicities (Fig. 6a), the Mgb index is\npredicted to be stronger for super-solar [Mg\/Fe]. The difference\nbetween solar ratio and non-solar ratio models increases with\nincreasing metallicity. This behaviour is reversed for the hFei\nindex (see also Trager et al. 2000). A similar effect can be ob-\nserved when we fix [Fe\/H] but vary age (Fig. 6b). Remarkably,\nthe [MgFe] index, the geometric mean of the Mg b and hFei in-\ndices, does not show any significant dependence on abundance\nratios, at least not within the current framework of the models.\n768 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nFig. 7. Probing the [Mg\/Fe] ratios of globular clusters in a Mg b vs. hFei diagram. Panel a): Our sample of globular clusters in NGC 3115 is\nshown as open triangles (blue clusters) and open circles (red clusters). The large filled square represents the centre of NGC 3115 taken from\nTrager et al. (1998) and the small filled squares represent the data of Fisher et al. (1996) which cover radii up to 4000 along the major axis.\nPanel b): Milky Way globular clusters observed with the Lick\/IDS instrumentation. Overplotted as stars are early-type galaxies in the Fornax\ncluster with central velocity dispersion \u001b \u0015 75 km s−1 (Kuntschner 2000). Panel c): Globular clusters in M 31 observed with the Lick\/IDS\ninstrumentation. The filled triangle represents the centre of M 31 taken from Trager et al. (1998). Overplotted in all panels are models by\nThomas et al. (2002a) with abundance ratios of [Mg=Fe] = 0:0:, 0.3, 0.5 as indicated in the left panel. The models span a range in age\n(3–12 Gyr) and metallicity ([Fe=H] = −2:35 to + 0:3).\nThis has the unique advantage that [MgFe] can be used as\nan empirical mean metallicity indicator with negligible depen-\ndence on the abundance ratios (see also Kuntschner et al. 2001).\nSimilarly, H\f is hardly affected by [Mg\/Fe] with a small in-\ncrease in line-strength for larger [Mg\/Fe] ratios (Figs. 6c and d).\nHowever, the H\f index shows a noteworthy complication\nat low metallicities ([Fe=H] \u0014 −1:35) and ages >8 Gyrs. Here\nthe models predict a non-monotonic decrease of the H\f index\nwith increasing age (see Fig. 6d, models for [Fe=H] = −2:25\nand −1:35). Therefore, in this age and metallicity range a given\nmeasurement of H\f and [MgFe] indices does not correspond\nto one unique age but can in fact be consistent with a range of\nages. The ambiguity arises between a genuine measurement of\nthe turn-off temperature by H\f and the appearance of blue hori-\nzontal branch stars in old, metal poor stellar systems which will\nstart to increase the H\f index, mimicking a younger age (Lee\net al. 2000; Maraston & Thomas 2000; Beasley et al. 2002b).\nThe overall result is a “crossing” of iso-age lines at ages larger\nthan 8 Gyr and low metallicities. In Sect. 5.2 where we will\ndetermine our best age estimates, the above effect will be taken\ninto account.\n5. Results\nWe first present our results on the abundance ratios of Mg to Fe\nof GCs in NGC 3115 and compare these with the Lick\/IDS ob-\nservations (Trager et al. 1998) of GCs in our own galaxy\nand M 31. In Sect. 5.2 we present our best estimates of the ages\nand metallicities of NGC 3115 GCs, while we compare photo-\nmetric and spectroscopic metallicity estimates in Sect. 5.3.\n5.1. Abundance ratios\nIn Fig. 7, we show a diagram of Mg b vs. hFei index. We plot\nour sample of GCs separated by (V − I) colour (see Fig. 5)\nwhere red and blue clusters are shown as open circles and open\ntriangles respectively. Overplotted are the model predictions\nby Thomas et al. (2002a) for [Mg=Fe] = 0:0; 0:3; 0:5, age =\n3; 5; 8; 12 Gyr and [Fe=H] = −2:25;−1:35;−0:33; 0:0;+0:35.\nIn this diagram the effects of age and metallicity are almost\ncompletely degenerate and the sensitivity towards abundance\nratios is maximised. The models predict a significant change\nin line-strength for varying abundance ratios at large metallic-\nities\/ages (i.e. large Mg b & hFei line-strength) while at low\nmetallicities the dependence is smaller. Therefore, at a given\nerror in line-strength, abundance ratios are determined more\naccurately at larger metallicities\/ages.\nWe find that for GCs in NGC 3115 the abundance ratios\nvary from roughly solar to about [Mg=Fe] ’ +0:3 (with a max-\nimum of [Mg=Fe] ’ +0:5, see Fig. 7a). In our small sample\nthere is no evidence for a trend with colour. In particular, there\nare GCs with solar and super-solar abundance ratios in both\nthe blue and red GC populations. There is even some weak ev-\nidence for a bimodal abundance ratio distribution with peaks at\n[Mg=Fe] \u0019 0:0 and \u00190.3 (see Fig. 8). This tentative evidence\nneeds to be confirmed with a larger sample of GCs.\nThe measurements for the centre of NGC 3115 itself (large\nfilled square, data from Trager et al. 1998) and the radial\ngradient (small filled squares, data from Fisher et al. 1996)\nalong the major axis up to 4000 is compatible with a model of\n[Mg=Fe] \u0019 0:0 at high metallicity\/age. In Figs. 7b and c we plot\nthe Lick\/IDS observations of GCs in the Milky Way and M 31\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 769\nFig. 8. Histogram of abundance ratios [Mg\/Fe] for NGC 3115 globular\nclusters. The abundance ratios were determined from Fig. 7a.\nrespectively (data from Trager et al. 1998). While virtually all\nMW GCs are consistent with [Mg=Fe] ’ +0:3, similar to large\nelliptical galaxies, we find a range in [Mg\/Fe] for the GCs\nin M 31. The overall distribution of the [Mg\/Fe] ratios for GCs\nin M 31 is similar to the one we find in NGC 3115. The average\nvalue of [Mg=Fe] = +0:3 we find for the MW GCs compares\nwell with high resolution studies of individual stars in MW GCs\n(e.g., Lee & Carney 2002).\nGCs with super-solar [Mg\/Fe] ratios were previously found\nin other nearby galaxies but without our quantitative accuracy.\nFor example, Forbes et al. (2001) attribute super-solar abun-\ndance ratios to 4 out of 10 GCs in NGC 1399. Using Mg and\nTiO features, Larsen et al. (2002) find a mean [\u000b\/Fe] of+0:4 for\nboth metal-poor and metal-rich GCs in the Sombrero galaxy.\n5.2. Age and metallicity\nIn the previous section we were able to determine the abun-\ndance ratios of GCs without knowing the age and metallicity\nsince the latter parameters are almost completely degenerate in\na Mg b vs. hFei diagnostic diagram. However, our earlier dis-\ncussion of the model systematics shows that we need to take\nthe abundance ratios into account in order to estimate the age\nand metallicity of the GCs (see also e.g., Trager et al. 2000;\nKuntschner et al. 2001).\nPrinciple age sensitive lines within our observed wave-\nlength range are the Balmer lines H\f, Hγ, and H\u000e. For Hγ and\nH\u000e, the dependence on \u000b–element to Fe ratio is yet unknown.\nH\f is only marginally sensitive to abundance ratio variations,\nat least in comparison to our average observational error. To\nfurther minimise the influence of abundance ratios, we employ\nas metallicity indicator [MgFe], that also shows no significant\n[Mg\/Fe] dependence (see Fig. 6). Within the accuracy of our\ndata sample, an H\f vs. [MgFe] diagram can therefore be used\nto estimate the ages and metallicities of our NGC 3115 GCs\nwithout being significantly affected by abundance ratios.\nIn Fig. 9 we show diagrams of [MgFe] versus the three\nBalmer lines for our sample of NGC 3115 GCs (left panels) and\nthe respective data for GCs in the Milky Way and M 31 from the\nLick\/IDS observations (middle and right panels; the index val-\nues for H\f, Mg b and hFeiwere taken from Trager et al. (1998);\nthe higher order Balmer lines of the Lick\/IDS observations are\npresented in Tables A.3 and A.4 in the Appendix). Overplotted\nin Fig. 9 are solar–abundance ratio models by Thomas et al.\n(2002a) and Maraston (2002, in preparation) for metallicities\n[Fe=H] = −2:25;−1:35;−0:33; 0:00; 0:35 (dashed lines, left to\nright) and ages 3, 5, 8 and 12 Gyr (solid lines, top to bottom).\nWe first caution that a direct comparison between mod-\nels and our data to derive absolute ages and metallicities can\nbe dangerous due to possible systematic calibration errors.\nHowever, we estimate that systematic observational errors are\nsmaller than 0.1 Å for the indices shown here and emphasize\nthat relative comparisons within one sample will be significant.\nThe observed H\f values for NGC 3115 GCs show a large\nspread with respect to the model predictions. However, the\ndata points which are well below the model predictions are\nthe ones with the largest errors. Most of the well determined\ndata points are close to the region of a 12 Gyr SSP model. Our\n[MgFe] measurements show that there is a clear distinction in\nmetallicity between blue (open triangles) and red clusters (open\ncircles), with the red clusters being more metal rich (a more\ndetailed analysis of the metallicity distribution is presented in\nSect. 5.3).\nSince only about half of our data points have small enough\nerror bars to be useful for an individual age\/metallicity eval-\nuation we also calculate the error weighted mean of the blue\nand red clusters, respectively. These average values (filled sym-\nbols in Fig. 9, left panels) give for the metal poor (blue) pop-\nulation an age of 12.0(+1:5−2:0) Gyr and [Fe=H] = −1:05(\u00060:09),\nwhile the metal rich (red) population has an estimated age\nof 10.8(+1:7−1:8) Gyr and [Fe=H] = −0:26(\u00060:05). The errors on\nthe age and metallicity are quoted as 1\u001b errors on the mean\nvalues.\nWe note in Sect. 4 that for metallicities [Fe=H] \u0014 −1:35\nand an age larger than 8 Gyr the strength of the H\f and [MgFe]\nindices is not uniquely connected to one age anymore. In fact\nthere is a “crossing” of iso-age curves. For clarity we do not\nplot iso-age lines for ages greater than 12 Gyr in Fig. 9, but this\neffect has been taken into account when deriving the errors on\nour best age and metallicity estimates.\nFrom the H\f vs. [MgFe] diagram we conclude that\nwithin our observational errors the two populations of GCs in\nNGC 3115 have the same age of 11–12 Gyr (assuming the cal-\nibration of models and data is accurate). The observed indices\nfor the integrated light in the centre of NGC 3115 (taken from\nand shown as filled square in Fig. 9 Trager et al. 1998) are con-\nsistent with a luminosity weighted age of \u001912 Gyr.\nThe Lick\/IDS observations of MW GCs also show a signif-\nicant number of objects below the model predictions. We note\n770 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nFig. 9. Age and metallicity diagnostic diagrams using as metallicity indicator [MgFe] and as age indicator H\f, HγF, and H\u000eF. H\f and [MgFe]\nare not significantly influenced by abundance ratios, for HγF, and H\u000eF the behaviour is unknown. Our sample of globular clusters in NGC 3115\nis shown in the left panels as open triangles (blue clusters) and open circles (red clusters). The error weighted means of the blue and red clusters\nare shown as filled symbols. The filled square in the left panels represents the centre of NGC 3115 Trager et al. (1998). The middle and right\npanels show the Lick\/IDS data for Milky Way MW and M 31 globular clusters, respectively. Note, that for the MW globular cluster NGC 2158\nthere are no HγF and H\u000eF index measurements available. Overplotted are solar–abundance SSP models by Thomas et al. (2002a) and Maraston\n(2002, in preparation) for metallicities [Fe=H] = −2:25;−1:35;−0:33; 0:00; 0:35 (dashed lines, left to right) and ages 3, 5, 8, and 12 Gyr (solid\nlines, top to bottom).\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 771\nthat there are no systematic observational offsets to be expected\nsince the data was taken with the original Lick\/IDS system.\nWe speculate that observations of these GCs may be contam-\ninated by fore\/back-ground stars. New spectroscopic observa-\ntions of MW GCs (Puzia et al. 2002a) support this hypothesis\nsince the new observations do not show such low H\f values.\nConsistent with recent age estimates from the resolved stellar\npopulations of MW GCs (e.g., Rosenberg et al. 1999; Salaris\n& Weiss 2002) we do not find evidence for clusters younger\nthan \u00198 Gyr.\nThe Lick\/IDS observations for M 31 GCs show a relatively\nsmall scatter close to a 12 Gyr model prediction, with only\nthree, metal-rich clusters showing evidence of a younger age.\nWe note however, that for metallicities [Fe=H] < −1:35 the\nmodels seem to systematically over-estimate the H\f absorption\nstrength (or alternatively over-estimate the [MgFe] absorption\nstrength).\nIn the next paragraphs we will present our measurements\nof the higher order Balmer lines HγF and H\u000eF. We emphasize\nhere that while these indices can be measured with a higher\nprecision than H\f, it is currently unknown how these indices\ndepend on abundance ratios. Furthermore the absolute calibra-\ntion of these indices has not yet been investigated in as much\ndetail as the H\f index.\nThe distributions of HγF and H\u000eF vs [MgFe] are narrower\ncompared to H\f vs. [MgFe] and mostly encompassed by the\nmodel grid. The error weighted means for NGC 3115 GCs in-\ndicate an age of \u00197 and \u00195 Gyr for the blue and red clusters,\nrespectively. These average ages are substantially lower than\nwhat we inferred from the H\f vs. [MgFe] diagram. We note\nthat our observations of HγF and H\u000eF for GCs in NGC 3115\nagree well with the Lick\/IDS observations of M 31 and there-\nfore we conclude that the calibration of the models is not con-\nsistent between H\f and the higher order Balmer lines. Despite\nthis absolute calibration problem we find a good agreement in\na relative sense between H\f, HγF and H\u000eF. Therefore, at least\nto first order, we can say that the higher Balmer indices are\nnot significantly affected by abundance ratios in the metallicity\nrange probed by our data.\nComparing the distributions for MW and M 31 GCs, we\nfind that the MW one is broader and offset towards smaller HγF\nand H\u000eF absorption consistent with the H\f measurements. We\nascribe this to contaminated observations for MW GCs (see\nabove). The Lick\/IDS data (particularly the H\f vs. [MgFe] di-\nagram), suggest that perhaps \u00183 metal rich M 31 GCs have\nyounger ages (3–5 Gyr). Alternatively, one could account for\nthe strong H\f absorption in these metal rich clusters if the\nH\f index is significantly influenced by an extended blue hori-\nzontal branch in an otherwise old, metal rich stellar population.\nMaraston & Thomas (2000) show that this effect can play a\nrole in metal poor stellar populations, however, to date there is\nscarce observational evidence for the existence of a populous\nextended blue horizontal branch in metal rich clusters. Rich\net al. (1997) detected a blue horizontal branch in two metal rich\nMW GCs and Ferraro et al. (2001) detected UV-excess stars in\nthe core of 47 Tuc (see also Moehler et al. 2000).\nFew spectroscopic observations of GCs in early-type galax-\nies with sufficient S=N to investigate these effects have been\npublished. Forbes et al. (2001) find that most of their 10 GCs\nin the giant elliptical NGC 1399 are old and compatible with\na model age of 11 Gyr (using models by Maraston 2002, in\npreparation). Only two GCs display such large H\f values that\nthese have either a very young age of \u00182 Gyr or are “contami-\nnated” by a significant blue horizontal branch population which\ncauses large H\f absorption. The authors prefer the first inter-\npretation. Larsen et al. (2002) present spectra of 14 GCs in the\nSombrero Galaxy (NGC 4594). Their analysis of the co-added\nspectra of metal-poor and metal-rich GCs leads to age estimates\nbetween 10–15 Gyr. The majority (11 out of 14 GCs) of the\nspectroscopic sample of Schroder et al. (2002) of M 81 GCs\nis compatible with old ages (using models by Worthey 1994).\nThere is only one outlier with a very high H\f line strength.\nIn summary we conclude from our best calibrated diagram\nof H\f vs. [MgFe] that the majority of our sample of GCs in\nNGC 3115, regardless of their metallicity, are consistent with\nan age of \u001912 Gyr. Only one, metal rich cluster (Slitlet ID: 7)\nshows a combination of H\f and [MgFe] absorption strength\nwhich indicates an age lower than 8 Gyr. The higher order\nBalmer lines indicate a narrow distribution in age, with a hint of\nthe metal rich clusters being younger by \u00192 Gyr. The unknown\ndependence of the higher order Balmer lines on abundance ra-\ntios makes this age difference highly speculative. The absolute\nages indicated by the higher order Balmer lines are lower com-\npared to the H\f index. We ascribe this age difference to an in-\naccurate calibration of the higher order Balmer lines in the cur-\nrent stellar population models. The Lick\/IDS samples of MW\nand M 31 GCs also show old stellar populations; only \u00183 GCs\nin M 31 show tentative evidence of younger stars.\n5.3. Photometric versus spectroscopic metallicity\nestimates\nIn this section we compare our spectroscopic metallicity esti-\nmates with photometric methods and also investigate the gen-\neral distribution of metallicities. For this purpose we assume\nan average age of the GCs in NGC 3115 of 12 Gyr which is\nconsistent with our findings in the previous section.\nFigure 10a shows the purely empirical relation between\n(V − I) colour and our mean metallicity indicator [MgFe].\nThere is a tight relation over the observed parameter space.\nOverplotted as solid line are model predictions by Maraston\n(2002, in preparation) and Thomas et al. (2002a) for a constant\nage of 12 Gyr, which is in excellent agreement with our data.\nWe note that the model predictions for colours do not include\nthe effects of non-solar abundance ratios.\nIn order to convert the colours into metallicity esti-\nmates several authors have derived linear conversion formulae\nbased on observations for MW GCs. For example, Kundu &\nWhitmore (1998) conclude that [Fe=H] = −5:89+4:72(V−I) is\na good linear approximation. One can also use the predictions\nof stellar population models (Maraston 2002, in preparation)\nto predict the relation between (V − I) colour and metal-\nlicity [Fe\/H]. A comparison of the empirical and synthetic\ncalibration (12 Gyr model) is shown in Fig. 10b.\n772 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nOverall, the agreement is acceptable, although there are sig-\nnificant differences. Specifically at the low metalicity end the\nmodels predict a shallower trend than the empirical relation. In\norder to stay consistent with the Kundu & Whitmore (1998)\npaper we use their relation to convert (V − I) colour to metal-\nlicity (see also Table 1). Furthermore we determine metallicity\nestimates from our spectra by using the [MgFe] index in con-\njunction with the model predictions by Thomas et al. (2002a)\nand assuming a constant age of 12 Gyr. The comparison be-\ntween photometric and spectroscopic metallicity estimates is\nshown in Fig. 10c.\nWe find a good linear relation between both methods. The\nbest fitting linear relation including the observational errors is\n[Fe=H]phot = −0:26(\u00060:05) + 0:95(\u00060:08) \u0002 [Fe=H]spec with a\n\u001f2 probability of 0.30. The systematic offset of approximately\n[Fe=H] = −0:26 in the sense that the spectroscopic metallic-\nity measurements are larger is consistent with the difference\nbetween model predictions and empirical calibration of the\nconversion formulae between colour and [Fe\/H] as shown in\nFig. 10b. The predicted non-linearity of (V − I) colour as func-\ntion of metallicity below [Fe=H] = −1:5 cannot be tested since\nour data do not really cover this range.\nIn summary we confirm with our accurate spectroscopic\nobservations that the bimodal colour distribution seen in\nNGC 3115 GCs is dominated by a metallicity effect rather than\nby an age difference. Furthermore, both (V − I) colour peaks\ndo show a substantial spread in metallicity. We conclude that\nin the metallicity range −1:5 \u0014 [Fe=H] \u0014 0:0 and in absence\nof young GCs, the (V − I) colour is indeed a good indicator for\nmetallicity. We note that for metallicities below [Fe=H] = −1:5\nthis may not be the case anymore.\n6. Discussion\nBefore we discuss the implications of our results it needs to be\nnoted that our sample of GCs in NGC 3115 is dominated by\nthe bright end of the luminosity function. Our faintest object\n(Slitlet ID: 17) which we could use for the line-strength analy-\nsis is 0.9 mag brighter than the peak of the GC luminosity func-\ntion. Furthermore, since this project was only a pilot study we\nobserved only a small number of clusters over a limited region\nacross NGC 3115. Although our data can give clear insights\ninto the globular cluster system of NGC 3115 it is not necessar-\nily a representative sample. The comparison with the Lick\/IDS\nobservations of MW and M 31 GCs needs to be viewed with\ncaution since these samples cover a larger range in absolute\nGC magnitude.\nUsing their HST V , I photometry Kundu & Whitmore\n(1998) develop the following formation scenario for\nNGC 3115. The blue, metal poor clusters are formed with\nthe halo\/bulge component of the galaxy very early on. Then\nabout 4 \u0006 3 Gyr later an unequal mass, gas-rich merger event\nforms the disk component and the associated red, metal rich\nclusters. The authors point out that the spatial distribution of\nthe blue and red clusters are consistent with the halo\/bulge and\ndisk components respectively. Furthermore, there is evidence\nfrom optical imaging (Silva et al. 1989), that the disk is bluer\nand therefore perhaps younger than the halo\/bulge component,\nconsistent with the above outlined scenario.\nIn our spectroscopic study of the GCs in NGC 3115 we find\nthat the clusters are consistent with being coeval at about 11–\n12 Gyr. There is perhaps a weak hint of the red clusters being\nyounger, but by no more than \u00182 Gyr. This on its own would\nnot rule out the scenario by Kundu & Whitmore (1998), how-\never our estimates of the abundance ratios show that at least the\npopulation of red, metal rich clusters is not homogeneous. For\nthese objects we find a range in abundance ratios from solar to\nabout [Mg=Fe] ’ 0:5. In our small sample of limited spatial\nextend we do not find any clear trends of the chemical com-\nposition of GCs with the kinematics (see Fig. 3). The relative\nvelocities of most of the clusters in our sample are consistent\nwith rotation. A larger sample of more complete spatial cover-\nage is needed to establish possible trends between abundance\nratios and e.g., age, metallicity, spatial position and kinematics.\nWhat we can however say is that the metal-rich clusters\nwith solar abundance ratios must have been made out of well\nmixed material which incorporates the products of both SN II\n(the main producer of alpha elements) and SN Ia (the main pro-\nducer of Fe-peak elements). Since SN Ia are somewhat delayed\ncompared to SN II the solar abundance ratio clusters must have\nformed after the initial star burst in NGC 3115. There are many\npossible scenarios to explain the observed abundance ratio dis-\ntribution, but it is hard to fit them into a simple picture of only\ntwo distinct formation events which create the red and blue\nglobular cluster sub-populations (see Beasley et al. 2002a).\nOne scenario which we would like to put forward for\nfurther discussion is the following. The metal poor (blue),\nnon-solar abundance ratio clusters are associated with the halo\nformation, and the metal-rich (red), non-solar abundance ratio\nclusters are formed together with the bulge as was similarly\nproposed for the Milky Way by Carney et al. (1990) and Wyse\n& Gilmore (1992). The metal rich, solar ratio clusters are then\nformed with the disk of this lenticular galaxy \u00181–2 Gyr af-\nter the initial star-burst perhaps in connection with a merger.\nThis scenario would then require the disk to have also close\nto solar abundance ratios, which can be tested by observations\nof the integrated light. Furthermore, if this scenario is correct\nthe spatial distribution and kinematics of disk GCs will be dis-\ntinct from the population of halo and bulge GCs in NGC 3115.\nFuture, larger samples of NGC 3115 GCs will be very valuable\nto explore the connection between disk formation and metal\nrich globular cluster formation.\nMore spectroscopic observations of GCs in nearby galaxies\nof various types will be very valuable to improve our stellar\npopulation models and learn more about the early star-\nformation epochs in early-type galaxies. However, the mis-\nmatch of the models and some observed indices demonstrates\nthat we are also in urgent need for a new, high-quality flux-\ncalibrated spectral library in order to exclude simple observa-\ntional offsets. Only then can we make good progress with im-\nprovements on the input physics of stellar population models\nand their application to extragalactic objects.\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 773\nFig. 10. Comparison of photometric and spectroscopic metallicity estimates. In the left panel the [MgFe] index is plotted against (V − I) colours\n(including the pseudo (V − I) colours derived from the spectra). Overplotted as solid line is the prediction for a 12 Gyr stellar population model\nby Maraston (2002, in preparation) and Thomas et al. (2002a). In the middle panel we show a comparison between an empirical calibration\nof (V − I) colour against metallicity (dashed line; Kundu & Whitmore 1998) and predictions from stellar population models (solid line, 12 Gyr;\nMaraston 2002, in preparation). In the right panel, photometric metallicities are calculated according to Kundu & Whitmore (1998), while\nspectroscopic metallicities are derived from the [MgFe] index in comparison to models of Thomas et al. (2002a) assuming a constant age\nof 12 Gyr. The data point at [Fe\/H]spec [MgFe] = −2:25 represents a globular cluster with line-strength weaker than the currently available model\npredictions and is therefore only an upper limit. The lines at the right hand side of the plot show the peak positions of the bimodal distributions\nof GCs observed by Kundu & Whitmore (1998, solid lines) and RGB stars observed by Elson (1997, dotted lines).\n7. Conclusions\nWe present new, accurate measurements of absorption line-\nstrength indices of 17 globular clusters (hereafter GCs) in the\nnearby S0 galaxy NGC 3115. Our objects span a range in\ncolour so that the bimodal (V − I) colour distribution is well\nsampled.\nA critical comparison with Lick\/IDS data (Trager et al.\n1998) of GCs in M 31 and the Milky Way (hereafter MW) is\npresented. The Lick\/IDS measurements of the HγA;F and H\u000eA;F\nindices for MW and M 31 GCs are presented for the first time\nin this paper. The data are analysed with new stellar population\nmodels (Thomas et al. 2002a) which are able to predict line-\nstrength not only as a function of age and metallicity but also\nas a function of abundance ratio. Specifically, abundance ratio\nbiases in the stellar library, which is an essential ingredient to\nthe model predictions, have been taken into account for the first\ntime.\nOur main results are listed in the following:\n– The GCs in NGC 3115 show a range of abundance ratios as\nestimated by the strength of Mg and Fe lines. Specifically\nwe find for both red and blue clusters solar as well as super-\nsolar values (up to [Mg=Fe] ’ +0:5). Lick\/IDS data of M 31\nGCs show a similar distribution while MW GCs are consis-\ntent with a constant value of [Mg=Fe] ’ 0:3. The latter is in\nagreement with recent studies of the resolved stellar popu-\nlations in MW GCs.\n– Our analysis of H\f, HγF and H\u000eF vs. [MgFe]\nage\/metallicity diagnostic diagrams shows that the\nred and blue GC populations are coeval within \u00192 Gyr.\nOur best calibrated diagram (H\f, [MgFe]) indicates a\nmean age of 11−12 Gyr. However, the higher order Balmer\nlines, although confirming the similar ages of blue and\nred clusters, indicate younger absolute ages (\u00196 Gyr). We\nascribe these younger age estimates to inaccurate model\ncalibrations of the higher order Balmer lines. Evidence\nfor the existence of young (<5 Gyr) GCs in the studied\ngalaxies is scarce. Only one cluster in NGC 3115 and\nperhaps \u00183 clusters in M 31 show a combination of Balmer\nand metal absorption strength which is consistent with such\nyoung ages. The strong H\f absorption can be alternatively\nexplained if these clusters have old stellar populations with\na populous extended horizontal branch.\n– We present a comparison of photometric and spectroscopic\nmetallicity determinations and find a good linear relation in\nthe metallicity range probed by our sample of NGC 3115\nclusters (−1:5 < [Fe=H] < 0:0). The photometric estimates\nare systematically lower (’−0:26) in comparison with our\nspectroscopic measurements. We note that our observations\nclearly show that each colour peak has a significant spread\nin metallicity rather than being consistent with a narrow\ndistribution.\n– The existence of solar as well as elevated Mg-to-Fe ratios\nat a given metallicity for GCs in NGC 3115 indicates that\na simple scenario of two distinct star-formation episodes\nis not sufficient to explain the formation of this galaxy.\nProbably a realistic model needs to incorporate more than\ntwo distinct star-formation events.\n– We detect a clear signal of rotation in our sample of GCs in-\ndependent of their metallicities.\nLarger samples of high signal-to-noise spectra of GCs in\nnearby galaxies are required to increase our knowledge of how\nthese galaxies formed. Particularly the measurement of abun-\ndance ratios in extragalactic GCs is now possible and will\n774 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nTable A.1. Line-strength measurements for NGC 3115 globular clusters.\nSlitlet ID H\u000eA H\u000eF CN1 CN2 Ca4227 G4300 HγA HγF Fe4383 Ca4455\n[Å] [Å] [mag] [mag] [Å] [Å] [Å] [Å] [Å] [Å]\n3 −1:41 0.32 0.049 0.076 0.95 4.64 −4:76 −0:92 3.74 1.05\n0.54 0.37 0.015 0.018 0.26 0.43 0.51 0.31 0.59 0.29\n5 1.44 1.81 −0:014 0.022 0.54 2.84 −0:92 1.04 2.03 0.40\n0.34 0.23 0.010 0.012 0.18 0.30 0.32 0.18 0.44 0.21\n7 −1:00 0.29 0.078 0.120 1.41 4.45 −4:60 −0:53 3.81 0.67\n0.46 0.32 0.013 0.015 0.21 0.35 0.38 0.23 0.49 0.22\n8 0.49 1.38 0.006 0.038 0.83 3.29 −1:92 0.54 2.36 0.56\n0.18 0.12 0.005 0.006 0.09 0.15 0.16 0.10 0.22 0.11\n9 0.68 1.27 0.015 0.054 0.79 3.91 −3:15 −0:17 3.09 0.73\n0.28 0.20 0.008 0.009 0.14 0.23 0.27 0.17 0.35 0.17\n12 2.42 2.87 0.010 0.067 0.60 2.38 −0:39 1.24 2.53 0.77\n0.52 0.34 0.016 0.019 0.27 0.49 0.51 0.30 0.71 0.35\n13 2.02 1.95 −0:011 0.043 0.94 2.64 −1:78 1.20 2.62 0.04\n0.81 0.57 0.023 0.028 0.42 0.72 0.81 0.49 1.08 0.53\n14b 0.75 1.23 0.012 0.035 1.01 3.93 −4:56 −0:58 3.89 1.26\n0.50 0.36 0.015 0.018 0.25 0.40 0.46 0.28 0.60 0.28\n15 2.54 1.96 −0:015 0.020 1.16 3.29 −1:72 0.81 3.00 0.12\n0.64 0.45 0.019 0.023 0.34 0.56 0.64 0.38 0.82 0.42\n16 3.50 2.95 −0:063 −0:058 −0:21 0.55 0.96 2.24 2.07 0.60\n0.84 0.55 0.025 0.030 0.45 0.83 0.78 0.50 1.11 0.54\n17 −0:27 0.14 0.056 0.080 1.07 5.02 −4:59 −1:11 3.53 0.47\n0.54 0.37 0.014 0.018 0.24 0.40 0.48 0.29 0.57 0.28\n21 2.01 2.63 −0:048 −0:034 0.70 3.34 −0:17 2.03 1.85 0.17\n0.85 0.59 0.024 0.029 0.43 0.79 0.79 0.48 1.11 0.54\n23 −1:79 0.40 0.069 0.099 0.90 4.38 −3:97 −0:21 4.77 1.13\n0.37 0.24 0.010 0.012 0.16 0.28 0.31 0.19 0.37 0.20\n24 1.99 2.06 −0:008 0.012 0.83 2.87 −1:23 0.93 2.45 0.32\n0.24 0.17 0.008 0.009 0.12 0.22 0.24 0.14 0.32 0.15\n25a 1.41 1.53 −0:049 −0:041 0.32 2.66 −0:31 0.77 0.46 0.38\n0.54 0.36 0.015 0.019 0.28 0.49 0.51 0.32 0.71 0.33\n25b 2.33 2.48 −0:059 −0:034 0.49 2.33 0.30 1.79 1.27 0.31\n0.22 0.15 0.006 0.008 0.11 0.19 0.21 0.13 0.31 0.15\n26b 2.46 2.07 −0:064 −0:047 0.54 1.99 1.35 2.19 1.33 0.03\n0.53 0.35 0.016 0.019 0.28 0.49 0.49 0.30 0.71 0.34\nNotes: Listed are line-strength measurements in the wavelength range 4000–4500 Å for globular clusters in NGC 3115 (see also Table 1). The\nfirst line for each object shows the measured index values whereas the second line lists the associated errors. The unit for each index is given at\nthe top in square brackets.\ndeliver important new constraints for galaxy formation models\nwhich are not accessible with broad-band colours alone.\nAcknowledgements. Part of this work was supported by the\nVolkswagen Foundation (I\/76 520). We thank Dr. J. Heidt\n(Heidelberg) and the ESO Paranal staff for the efficient obser-\nvations, the resulting data of which were the basis for this Paper. We\nare also very grateful to D. Thomas, C. Maraston and R. Bender who\nprovided their models prior to publication. We thank the referee B. W.\nCarney for a quick and helpful referee report.\nAppendix A: Tables of line-strength\nmeasurements\nA.1. Line-strength measurements for globular clusters\nin NGC 3115\nTables A.1 and A.2 present the line-strength measurements for\nglobular clusters in NGC 3115. The spectra have been broad-\nened to the Lick\/IDS resolution prior to index measurements.\nSmall offsets have been made to match the Lick system as\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 775\nTable A.2. Lick\/IDS line-strength measurements for NGC 3115 globular clusters.\nSlitlet ID Fe4531 C24668 H\f Fe5015 Mg1 Mg2 Mg b Fe5270 Fe5335 Fe5406\n[Å] [Å] [Å] [Å] [mag] [mag] [Å] [Å] [Å] [Å]\n3 2.94 3.88 1.59 5.24 0.068 0.216 3.59 2.30 1.90 1.46\n0.44 0.65 0.25 0.56 0.006 0.007 0.28 0.28 0.31 0.23\n5 1.87 1.45 2.12 3.51 0.038 0.105 1.86 1.49 1.05 0.68\n0.34 0.49 0.19 0.41 0.005 0.005 0.20 0.22 0.25 0.19\n7 3.20 4.07 2.12 5.90 0.064 0.196 3.84 2.03 2.57 1.74\n0.35 0.53 0.20 0.43 0.005 0.006 0.22 0.24 0.25 0.20\n8 2.20 1.87 2.18 3.20 0.025 0.110 2.04 1.83 1.73 0.89\n0.17 0.25 0.10 0.23 0.002 0.003 0.10 0.12 0.13 0.11\n9 2.58 2.89 1.71 4.13 0.050 0.160 3.32 1.97 1.51 0.83\n0.26 0.39 0.16 0.34 0.004 0.004 0.16 0.18 0.20 0.16\n12 0.70 −0:29 2.33 3.53 0.025 0.118 2.42 1.88 1.21 1.21\n0.61 0.86 0.32 0.69 0.008 0.010 0.35 0.37 0.43 0.34\n13 1.99 1.99 1.38 2.59 0.014 0.107 2.12 2.73 0.90 0.46\n0.87 1.30 0.49 1.05 0.011 0.013 0.52 0.54 0.63 0.52\n14b 3.26 1.87 1.38 3.75 0.052 0.174 2.90 2.45 2.69 1.22\n0.43 0.67 0.26 0.57 0.006 0.007 0.27 0.28 0.31 0.26\n15 1.68 −0:36 1.31 3.85 0.035 0.125 2.25 1.36 1.87 0.47\n0.66 1.00 0.37 0.80 0.009 0.010 0.39 0.41 0.48 0.41\n16 1.64 −1:13 2.65 1.62 0.015 0.028 0.56 0.36 0.30a −0:28\n0.92 1.48 0.56 1.18 0.013 0.015 0.57 0.65 1.12 0.57\n17 3.18 3.47 1.72 4.80 0.055 0.199 3.79 2.24 2.59 1.19\n0.43 0.66 0.26 0.52 0.006 0.007 0.26 0.28 0.30 0.25\n21 0.66 0.26 1.39 1.48 0.009 0.070 1.07 0.99 1.13 1.11\n0.92 1.37 0.53 1.11 0.012 0.013 0.53 0.58 0.63 0.53\n23 3.21 2.36 1.78 4.31 0.036 0.166 2.82 2.68 2.19 1.65\n0.30 0.45 0.18 0.36 0.004 0.005 0.18 0.18 0.21 0.16\n24 2.01 0.46 1.96 3.04 0.023 0.103 1.71 1.51 1.31 1.06\n0.25 0.39 0.15 0.32 0.003 0.004 0.16 0.17 0.19 0.15\n25a 0.12 −0:86 2.57 0.97 −0:004 0.037 1.44 1.29 0.78 −0:33\n0.58 0.87 0.32 0.81 0.008 0.009 0.33 0.38 0.46 0.36\n25b 1.60 0.61 2.23 2.66 0.016 0.063 1.15 1.06 1.23 0.50\n0.23 0.33 0.13 0.30 0.003 0.004 0.14 0.17 0.18 0.14\n26b 3.07 0.05 2.15 3.41 0.027 0.088 0.99 1.52 1.18 0.76\n0.54 0.80 0.32 0.66 0.007 0.009 0.35 0.37 0.39 0.32\nNotes: Listed are line-strength measurements in the wavelength range 4500–5450 Å for globular clusters in NGC 3115 (see also Table 1). The\nfirst line for each object shows the measured index values whereas the second line lists the associated errors. The unit for each index is given at\nthe top in square brackets.\na For this globular cluster we measured a Fe5335 index of −1:24(\u00060:75) Å. This negative number is caused by a noisy section in the spectrum.\nBy comparing this index with other Fe indices we established that a realistic value of the Fe5335 index for this globular cluster should be +0:3.\nTo reflect the unertainty in this procedure we increased the error by a factor of 1.5.\nclosely as possible (see Sect. 2 for details). For a summary of\nthe definition of Lick\/IDS indices see Trager et al. (1998).\nA.2. Lick\/IDS observations of HγA;F and H\u000eA;F indices\nfor Milky Way and M31 globular clusters\nSince the higher order Balmer indices of Milky Way and M 31\nglobular clusters as measured in the Lick\/IDS system have\nnot yet been published, we list the measurements of HγA;F\nand H\u000eA;F in Tables A.3 and A.4. The Lick observations are\ndescribed in Burstein et al. (1984), names are explained there\n(see also Trager et al. 1998). M 31 globular clusters were\nobserved with the standard aperture of the Lick\/IDS system\n(1:004 \u0002 4:000). The MW globular clusters were observed with a\nlong-slit of standard width that was raster-scanned on the sky to\ncreate a square aperture of size 6600 \u0002 6600 (only for NGC 6624\nthe aperture is 4500 \u0002 6000). Raster scans have the same spectral\nresolution as standard slit width scans. For the definition of the\nhigher order Balmer indices see Worthey & Ottaviani (1997).\n776 H. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters\nTable A.3. Lick\/IDS line-strength measurements for Milky Way\nglobular clusters.\nName H\u000eA H\u000eF HγA HγF\n[Å] [Å] [Å] [Å]\nNGC 5024 4.56 3.01 ... 2.34\n1.20 0.75 0.62\nNGC 5272 2.88 2.30 ... 1.77\n0.88 0.55 0.45\nNGC 5904 3.57 2.67 1.34 2.09\n1.22 0.76 0.92 0.63\nNGC 6171 2.18 1.73 ... −0:60\n1.95 1.22 1.00\nNGC 6205 2.68 2.38 1.04 1.79\n0.54 0.34 0.41 0.28\nNGC 6218 3.83 3.17 ... 1.96\n1.41 0.88 0.73\nNGC 6229 3.57 2.35 0.79 1.14\n1.72 1.07 1.29 0.88\nNGC 6341 3.65 2.87 1.72 2.33\n0.69 0.43 0.52 0.36\nNGC 6356 ... 0.01 ... −1:16\n0.66 0.55\nNGC 6624 −1:26 0.73 −4:70 −0:24\n1.02 0.64 0.76 0.52\nNGC 6637 −1:37 −0:17 −4:23 −1:70\n0.90 0.56 0.68 0.47\nNGC 6712 3.18 2.42 0.64 0.25\n1.87 1.17 1.40 0.96\nNGC 6838 0.66 0.69 −1:39 0.35\n1.32 0.83 0.99 0.68\nNGC 6981 3.24 2.55 ... 1.45\n1.84 1.15 0.95\nNGC 7006 3.45 4.37 ... 1.64\n1.57 0.98 0.81\nNGC 7078 3.37 2.69 1.85 2.28\n0.75 0.47 0.56 0.39\nNGC 7089 2.71 2.03 1.19 2.24\n0.92 0.57 0.69 0.47\nNotes: We list here the Lick\/IDS measurements of the indices H\u000eA,\nH\u000eF, HγA and HγF for MW globular clusters. The Lick\/IDS system\nis described in detail in Trager et al. (1998). For the definition of the\nhigher order Balmer indices see Worthey & Ottaviani (1997). The first\nline for each object shows the measured index values whereas the sec-\nond line lists the associated errors. The unit for each index is given at\nthe top in square brackets. Three dots indicate where no index mea-\nsurement is available.\nTable A.4. Line-strength measurements for globular clusters in M 31.\nName1 Name2 H\u000eA H\u000eF HγA HγF\n[Å] [Å] [Å] [Å]\nMII K1 1.29 1.99 −1:55 0.84\n0.54 0.34 0.40 0.28\nMIV K219 3.36 2.30 2.72 2.72\n0.60 0.38 0.45 0.31\nV4 K33 3.86 2.82 0.68 1.46\n1.47 0.92 1.10 0.76\nV12 K76 1.81 1.55 0.12 1.53\n1.00 0.63 0.75 0.52\nV23 K119 2.38 2.68 −0:08 1.45\n1.06 0.66 0.79 0.54\nV42 K78 −0:19 1.24 ... −0:30\n0.65 0.41 0.34\nV64 K213 ... 1.88 ... 0.74\n0.65 0.54\nV76 K263 2.55 3.13 0.83 1.92\n1.24 0.77 0.93 0.64\nV87 K222 −2:58 −0:83 −3:95 −1:12\n1.29 0.80 0.96 0.66\nV95 K229 3.39 2.71 0.93 1.97\n0.77 0.48 0.58 0.40\nV99 K286 3.44 2.33 0.64 2.01\n0.95 0.60 0.72 0.49\nV100 K217 −2:39 0.34 −5:56 −1:12\n0.86 0.54 0.65 0.45\nV116 K244 −3:69 0.03 − 0.20\n1.29 0.81 − 0.67\nV196 K302 2.26 2.43 0.79 2.07\n0.83 0.52 0.62 0.43\nV282 K280 −1:36 0.09 −4:75 −0:22\n0.57 0.36 0.43 0.29\nV301 K64 3.14 2.74 ... 1.99\n1.23 0.77 0.63\nV101 K272 ... 1.75 ... 0.76\n0.63 0.52\nNotes: We list here the Lick\/IDS measurements of the indices H\u000eA,\nH\u000eF, HγA and HγF for globular clusters in M 31. The Lick\/IDS sys-\ntem is described in detail in Trager et al. (1998). For the definition of\nthe higher order Balmer indices see Worthey & Ottaviani (1997). The\nfirst line for each object shows the measured index values whereas\nthe second line lists the associated errors. The unit for each index is\ngiven at the top in square brackets. Three dots indicate where no index\nmeasurement is available.\nReferences\nAshman, K. M., & Zepf, S. E. 1992, ApJ, 384, 50\nAshman, K. M., & Zepf, S. E. 1998, Globular cluster systems\n(Cambridge University Press)\nBeasley, M. A., Baugh, C. M., Forbes, D. A., Sharples, R. M., &\nFrenk, C. S. 2002a, MNRAS, 333, 383\nBeasley, M. A., Hoyle, F., & Sharples, R. M. 2002b, MNRAS,\n336, 168\nBekki, K. 1998, ApJ, 502, L133\nBorges, A. C., Idiart, T. P., de Freitas Pacheco, J. A., & Thevenin, F.\n1995, AJ, 110, 2408\nBridges, T. J., Ashman, K. M., Zepf, S. E., et al. 1997, MNRAS, 284,\n376\nBurstein, D., Faber, S. M., Gaskell, C. M., & Krumm, N. 1984, ApJ,\n287, 586\nCapaccioli, M., Cappellaro, E., Held, E. V., & Vietri, M. 1993, A&A,\n274, 69\nCarney, B. W., Latham, D. W., & Laird, J. B. 1990, AJ, 99, 572\nDavies, R. L., Sadler, E. M., & Peletier, R. F. 1993, MNRAS, 262, 650\nDressler, A. 1980, ApJ, 236, 351\nDressler, A., Oemler, A. J., Couch, W. J., et al. 1997, ApJ, 490, 577\nEdvardsson, B., Andersen, J., Gustafsson, B., et al. 1993, A&A, 275,\n101\nElson, R. A. W. 1997, MNRAS, 286, 771\nFerraro, F. R., D’Amico, N., Possenti, A., Mignani, R. P., & Paltrinieri,\nB. 2001, ApJ, 561, 337\nH. Kuntschner et al.: VLT spectroscopy of NGC 3115 globular clusters 777\nFisher, D., Franx, M., & Illingworth, G. 1996, ApJ, 459, 110\nForbes, D. A., Beasley, M. A., Brodie, J. P., & Kissler-Patig, M. 2001,\nApJ, 563, L143\nForbes, D. A., Brodie, J. P., & Grillmair, C. J. 1997, AJ, 113, 1652\nGonza´lez, J. J. 1993, Ph.D. Thesis\nHanes, D. A., & Harris, W. E. 1986, ApJ, 304, 599\nHorne, K. 1986, PASP, 98, 609\nKavelaars, J. J. 1998, PASP, 110, 758\nKissler-Patig, M., Richtler, T., Storm, J., & della Valle, M. 1997,\nA&A, 327, 503\nKundu, A., & Whitmore, B. C. 1998, AJ, 116, 2841\nKuntschner, H. 2000, MNRAS, 315, 184\nKuntschner, H., Lucey, J. R., Smith, R. J., Hudson, M. J., & Davies,\nR. L. 2001, MNRAS, 323, 615\nLarsen, S. S., & Brodie, J. P. 2002, AJ, 123, 1488\nLarsen, S. S., Brodie, J. P., Beasley, M. A., & Forbes, D. A. 2002, AJ,\n124, 828\nLee, H., Yoon, S., & Lee, Y. 2000, AJ, 120, 998\nLee, J., & Carney, B. W. 2002, AJ, 124, 1511\nMaraston, C., & Thomas, D. 2000, ApJ, 541, 126\nMcWilliam, A. 1997, ARA&A, 35, 503\nMichard, R., & Marchal, J. 1994, A&AS, 105, 481\nMoehler, S., Landsman, W. B., & Dorman, B. 2000, A&A, 361, 937\nPeletier, R. F. 1989, Ph.D. Thesis\nPuzia, T. H., Saglia, R. P., Kissler-Patig, M., et al. 2002a, A&A, 395,\n45\nPuzia, T. H., Zepf, S. E., Kissler-Patig, M., et al. 2002b, A&A, 391,\n453\nRich, R. M., Sosin, C., Djorgovski, S. G., et al. 1997, ApJ, 484, L25\nRosenberg, A., Saviane, I., Piotto, G., & Aparicio, A. 1999, AJ, 118,\n2306\nSalaris, M., & Weiss, A. 2002, A&A, 388, 492\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525\nSchroder, L. L., Brodie, J. P., Kissler-Patig, M., Huchra, J. P., &\nPhillips, A. C. 2002, AJ, 123, 2473\nSharples, R. M., Zepf, S. E., Bridges, T. J., et al. 1998, AJ, 115, 2337\nSilva, D. R., Boroson, T. A., Thompson, I. B., & Jedrzejewski, R. I.\n1989, AJ, 98, 131\nSmith, R. J., Lucey, J. R., Hudson, M. J., Schlegel, D. J., & Davies,\nR. L. 2000, MNRAS, 313, 469\nThomas, D., Greggio, L., & Bender, R. 1999, MNRAS, 302, 537\nThomas, D., Maraston, C., & Bender, R. 2002a, MNRAS, submitted\nThomas, D., Maraston, C., & Bender, R. 2002b, in Reviews in Modern\nAstronomy No. 15, Astronomische Gesellschaft\n[astro-ph\/0202166]\nTinsley, B. M. 1979, ApJ, 229, 1046\nTonry, J. L., Dressler, A., Blakeslee, J. P., et al. 2001, ApJ, 546, 681\nTrager, S. C., Faber, S. M., Worthey, G., & Gonza´lez, J. J. 2000, AJ,\n119, 1645\nTrager, S. C., Worthey, G., Faber, S. M., Burstein, D., & Gonzalez,\nJ. J. 1998, ApJS, 116, 1\nvan Dokkum, P. G. 2001, PASP, 113, 1420\nVazdekis, A. 1999, ApJ, 513, 224\nWorthey, G. 1994, ApJS, 95, 107\nWorthey, G. 1998, PASP, 110, 888\nWorthey, G., Faber, S. M., & Gonzalez, J. J. 1992, ApJ, 398, 69\nWorthey, G., & Ottaviani, D. L. 1997, ApJS, 111, 377\nWyse, R. F. G., & Gilmore, G. 1992, AJ, 104, 144\n"}