{"doi":"10.1091\/mbc.E02-10-0653","coreId":"193364","oai":"oai:lra.le.ac.uk:2381\/1553","identifiers":["oai:lra.le.ac.uk:2381\/1553","10.1091\/mbc.E02-10-0653"],"title":"p38 mitogen-activated protein kinase mediates cell death and p21-activated kinase mediates cell survival during Chemotherapeutic Drug-induced mitotic arrest","authors":["Deacon, Karl","Mistry, Pratibha","Chernoff, Jonathan","Blank, Jonathan L.","Patel, Rajnikant"],"enrichments":{"references":[{"id":44673027,"title":"A member of the Ste20\/PAK family of protein kinases is involved in both arrest in Xenopus oocytes and G2\/prophase of the first meiotic cell cycle and prevention of apoptosis.","authors":[],"date":"1997","doi":"10.1093\/emboj\/16.18.5550","raw":"Faure, S., Vigneron, S., Doree, M., and Morin, N. (1997). A member of the Ste20\/PAK family of protein kinases is involved in both arrest in Xenopus oocytes and G2\/prophase of the first meiotic cell cycle and prevention of apoptosis. EMBO J. 16, 5550–5561.","cites":null},{"id":44673045,"title":"A protein kinase involved in the regulation of inflammatory cytokine biosynthesis.","authors":[],"date":"1994","doi":"10.1038\/372739a0","raw":"Lee, J.C., et al. (1994). A protein kinase involved in the regulation of inflammatory cytokine biosynthesis. Nature 372, 739–746.","cites":null},{"id":44673029,"title":"Anaphase-promoting complex\/cyclosome-dependent proteolysis of human cyclin A starts at the beginning of mitosis and is not subject to the spindle assembly checkpoint.","authors":[],"date":"2001","doi":"10.1083\/jcb.153.1.137","raw":"Geley, S., Kramer, E., Gieffers, C., Gannon, J., Peters, J.M., and Hunt, T. (2001). Anaphase-promoting complex\/cyclosome-dependent proteolysis of human cyclin A starts at the beginning of mitosis and is not subject to the spindle assembly checkpoint. J. Cell Biol. 153, 137–148.","cites":null},{"id":44673040,"title":"Apoptosis induced by withdrawal of trophic factors is mediated by p38 mitogen-activated protein kinase.","authors":[],"date":"1997","doi":"10.1074\/jbc.272.33.20490","raw":"Kummer, J.L., Rao, P.K., and Heidenreich, K.A. (1997). Apoptosis induced by withdrawal of trophic factors is mediated by p38 mitogen-activated protein kinase. J. Biol. Chem. 272, 20490–20494.","cites":null},{"id":44673072,"title":"BAD Ser-155 phosphorylation regulates BAD\/Bcl-XL interaction and cell survival.","authors":[],"date":"2000","doi":"10.1074\/jbc.m004199200","raw":"Tan, Y., Demeter, M.R., Ruan, H., and Comb, M.J. (2000). BAD Ser-155 phosphorylation regulates BAD\/Bcl-XL interaction and cell survival. J. Biol. Chem. 275, 25865–25869.","cites":null},{"id":44673038,"title":"Bax directly induces release of cytochrome c from isolated mitochondria.","authors":[],"date":"1998","doi":"10.1073\/pnas.95.9.4997","raw":"Jurgensmeier, J.M., Xie, Z., Devereaux, Q., Ellerby, L., Bredesen, D., and Reed, J.C. (1998). Bax directly induces release of cytochrome c from isolated mitochondria. Proc. Natl. Acad. Sci. USA 95, 4997– 5002.","cites":null},{"id":44673028,"title":"Bax-induced caspase activation and apoptosis via cytochrome c release from mitochondria is inhibitable by Bcl-xL.","authors":[],"date":"1999","doi":"10.1074\/jbc.274.4.2225","raw":"Finucane, D.M., Bossy-Wetzel, E., Waterhouse, N.J., Cotter, T.G., and Green, D.R. (1999). Bax-induced caspase activation and apoptosis via cytochrome c release from mitochondria is inhibitable by Bcl-xL. J. Biol. Chem. 274, 2225–2233.","cites":null},{"id":44673080,"title":"BAX-induced cell death may not require interleukin IL-converting enzyme-like proteases.","authors":[],"date":"1996","doi":"10.1073\/pnas.93.25.14559","raw":"Xiang, J.G., Chao, D.T., and Korsmeyer, S.J. (1996). BAX-induced cell death may not require interleukin IL-converting enzyme-like proteases. Proc. Natl. Acad. Sci. USA 93, 14559–14563.","cites":null},{"id":44673025,"title":"Baxinduced cytochrome c release from mitochondria is independent of the permeability transition pore but highly dependent on Mg2 ions.","authors":[],"date":"1998","doi":"10.1083\/jcb.143.1.217","raw":"Eskes, R., Antonsson, B., Osen-Sand, A., Montessuit, S., Richter, C., Sadoul, R., Mazzei, G., Nichols, A., and Martinou, J.C. (1998). Baxinduced cytochrome c release from mitochondria is independent of the permeability transition pore but highly dependent on Mg2 ions. J. Cell Biol. 143, 217–224.","cites":null},{"id":44673018,"title":"Bid-induced conformational change of Bax is responsible for mitochondrail cytochrome c release during apoptosis.","authors":[],"date":"1999","doi":"10.1083\/jcb.144.5.891","raw":"Desagher, S., Osen-Sand, A., Nichols, A., Eskes, R., Montessuit, S., Lauper, S., Maundrell, K., Antonsson, B., and Martinou, J.C. (1999). Bid-induced conformational change of Bax is responsible for mitochondrail cytochrome c release during apoptosis. J. Cell Biol. 144, 891–901.","cites":null},{"id":44673051,"title":"Calcium\/calmodulin-dependent phosphorylation and activation of human cdc25-C at the G2\/M phase transition in HeLa cells.","authors":[],"date":"1999","doi":"10.1074\/jbc.274.12.7958","raw":"Patel, R., Holt, M., Philipova, R., Moss, S., Schulman, H., Hidaka, H., and Whitaker, M. (1999). Calcium\/calmodulin-dependent phosphorylation and activation of human cdc25-C at the G2\/M phase transition in HeLa cells. J. Biol. Chem. 274, 7958–7968.","cites":null},{"id":44673013,"title":"Cdc42 and PAK-mediated signaling leads to Jun kinase and p38 mitogen-activated protein kinase activation.","authors":[],"date":"1995","doi":"10.1074\/jbc.270.47.27995","raw":"Bagrodia, S., Derijard, B., Davis, R.J., and Cerione, R.A. (1995). Cdc42 and PAK-mediated signaling leads to Jun kinase and p38 mitogen-activated protein kinase activation. J. Biol. Chem. 270, 27995–27998.","cites":null},{"id":44673036,"title":"Characterization of the structure and function of the fourth member of p38 group mitogen-activated protein kinases,","authors":[],"date":"1997","doi":"10.1074\/jbc.272.48.30122","raw":"Jiang, Y., Gram, H., Zhao, M., New, L., Gu, J., Feng, L., DiPadova, F., Ulevitch, R.J., and Han, J. (1997). Characterization of the structure and function of the fourth member of p38 group mitogen-activated protein kinases, p38. J. Biol. Chem. 272, 30122–30128.","cites":null},{"id":44673015,"title":"Complexity in the spindle checkpoint.","authors":[],"date":"2000","doi":"10.1016\/s0959-437x(99)00040-4","raw":"Burke, D. (2000). Complexity in the spindle checkpoint. Curr. Opin. Gen. Dev. 10, 26–31.","cites":null},{"id":44673048,"title":"Conformation of the Bax C-terminus regulates subcellular location and cell death.","authors":[],"date":"1999","doi":"10.1093\/emboj\/18.9.2330","raw":"Nechustan, A., Smith, C.L., Hsu, Y.T., and Youle, R.J. (1999). Conformation of the Bax C-terminus regulates subcellular location and cell death. EMBO J. 273, 16415–16420.","cites":null},{"id":44673026,"title":"Control of mitotic transitions by the anaphase-promoting complex.","authors":[],"date":"2003","doi":null,"raw":"p38 MAPK, PAK, and Mitotic Arrest Vol. 14, May 2003 2085 Fang, G., Yu, H., and Kirschner, M.W. (1999). Control of mitotic transitions by the anaphase-promoting complex. Phil. Trans. R. Soc.","cites":null},{"id":44673068,"title":"Coupling cell division and cell death to microtubule dynamics.","authors":[],"date":"1997","doi":"10.1016\/s0955-0674(97)80081-6","raw":"Sorger, P.K., Dobles, M., Tournebize, R., and Hyman, A.A. (1997). Coupling cell division and cell death to microtubule dynamics. Curr. Opin. Cell Biol. 9, 807–814.","cites":null},{"id":44673034,"title":"Cytosol-to-membrane redistribution of Bax and Bcl-X(L) during apoptosis.","authors":[],"date":"1997","doi":"10.1073\/pnas.94.8.3668","raw":"Hsu, Y.T., Wolter, K.G., and Youle, R.J. (1997). Cytosol-to-membrane redistribution of Bax and Bcl-X(L) during apoptosis. Proc. Natl. Acad. Sci. USA 94, 3668–3672.","cites":null},{"id":44673067,"title":"Differential regulation of mitogen-activated protein kinases by microtubule-binding agents in human breast cancer cells.","authors":[],"date":"1999","doi":"10.1038\/sj.onc.1202305","raw":"Shtil, A.A., Mandlekar, S., Yu, R., Walter, R.J., Hagen, K., Tan, T.H., Roninson, I.B., and Kong, A.N. (1999). Differential regulation of mitogen-activated protein kinases by microtubule-binding agents in human breast cancer cells. Oncogene 18, 377–384.","cites":null},{"id":44673023,"title":"How BAD phosphorylation is good for survival.","authors":[],"date":"1999","doi":null,"raw":"Downward, J. (1999). How BAD phosphorylation is good for survival. Nat. Cell Biol. 1, E33–E35.","cites":null},{"id":44673046,"title":"Identification of a human mitotic checkpoint gene: hsMAD2.","authors":[],"date":"1996","doi":"10.1126\/science.274.5285.246","raw":"Li, Y., and Benezra, R. (1996). Identification of a human mitotic checkpoint gene: hsMAD2. Science 274, 246–248.","cites":null},{"id":44673044,"title":"Immunocytochemical detection and mapping of a cytokeratin 18 neo-epitope exposed during early apoptosis.","authors":[],"date":"1999","doi":"10.1002\/(sici)1096-9896(199904)187:5<567::aid-path288>3.0.co;2-j","raw":"Leers, M.P.G., et al. (1999). Immunocytochemical detection and mapping of a cytokeratin 18 neo-epitope exposed during early apoptosis. J. Pathol. 187, 567–572.","cites":null},{"id":44673017,"title":"Independent human MAP-kinase signal transduction pathways defined by MEK and MKK isoforms.","authors":[],"date":"1995","doi":"10.1126\/science.7839144","raw":"Derijard, B., Raingeaud, J., Barrett, T., Wu, I.H., Han, J., Ulevitch, R.J., and Davis, R.J. (1995). Independent human MAP-kinase signal transduction pathways defined by MEK and MKK isoforms. Science 270, 7420–7426.","cites":null},{"id":44673069,"title":"Inhibition of extracellular signal-regulated kinase (ERK) mediates cell cycle phase independent apoptosis in vinblastine-treated ML-1 cells.","authors":[],"date":"2001","doi":null,"raw":"Stadheim, T.A., Xiao, H., and Eastman, A. (2001). Inhibition of extracellular signal-regulated kinase (ERK) mediates cell cycle phase independent apoptosis in vinblastine-treated ML-1 cells. Cancer Res. 61, 1533–1540.","cites":null},{"id":44673042,"title":"Inhibition of HER2\/Neu (erbB-2) and mitogen-activated protein kinases enhance tamoxifen action against HER2-overexpressing, tamoxifen-resistant breast cancer cells.","authors":[],"date":"2000","doi":null,"raw":"Kurokawa, H., Lenferink, A.E., Simpson, J.F., Pisacane, P.I., Sliwkowski, M.X., Forbes, J.T., and Arteaga, C.L. (2000). Inhibition of HER2\/Neu (erbB-2) and mitogen-activated protein kinases enhance tamoxifen action against HER2-overexpressing, tamoxifen-resistant breast cancer cells. Cancer Res. 60, 5887–5894.","cites":null},{"id":44673053,"title":"Insulin-like growth factor-1 protects colon cancer cells from death factor-induced apoptosis by potentiating tumor necrosis factor -induced mitogen-activated protein kinase and nuclear factor B signaling pathways.","authors":[],"date":"2000","doi":"10.1016\/s0002-9440(10)62049-4","raw":"Remacle-Bonnet, M.M., Garrouste, F.L., Heller, S., Andre, F., Marvaldi, J.L., and Pommier, G.J. (2000). Insulin-like growth factor-1 protects colon cancer cells from death factor-induced apoptosis by potentiating tumor necrosis factor -induced mitogen-activated protein kinase and nuclear factor B signaling pathways. Cancer Res. 60, 2007–2017.","cites":null},{"id":44673021,"title":"Involvement of p38 in apoptosis-associated membrane blebbing and nuclear condensation.","authors":[],"date":"2001","doi":"10.1091\/mbc.12.6.1569","raw":"Deschesnes, R.G., Huot, J., Valerie, K., and Landry, J. (2001). Involvement of p38 in apoptosis-associated membrane blebbing and nuclear condensation. Mol. Biol. Cell 12, 1569–1582.","cites":null},{"id":44673039,"title":"Mammalian mitogen-activated protein kinase signal transduction pathways activated by stress and inflammation.","authors":[],"date":"2001","doi":"10.1152\/physrev.00028.2011","raw":"Kyriakis, J.M., and Avruch, J. (2001). Mammalian mitogen-activated protein kinase signal transduction pathways activated by stress and inflammation. Physiol. Rev. 81, 807–869.","cites":null},{"id":44673081,"title":"MEK kinase 1 (MEKK1) transduces c-Jun NH2-terminal kinase activation in response to changes in the microtubule cytoskeleton.","authors":[],"date":"1999","doi":"10.1074\/jbc.274.18.12605","raw":"Yujiri, T., Fanger, G.R., Garrington, T.P., Schlesinger, T.K., Gibson, S., and Johnson, G.L. (1999). MEK kinase 1 (MEKK1) transduces c-Jun NH2-terminal kinase activation in response to changes in the microtubule cytoskeleton. J. Biol. Chem. 272, 12605–12610.","cites":null},{"id":44673019,"title":"MEK kinase 3 directly activates MKK6 and MKK7, specific activators of the p38 and c-Jun NH2-terminal kinases.","authors":[],"date":"1999","doi":"10.1074\/jbc.274.23.16604","raw":"Deacon, K., and Blank, J.L. (1999). MEK kinase 3 directly activates MKK6 and MKK7, specific activators of the p38 and c-Jun NH2-terminal kinases. J. Biol. Chem. 274, 16604–16610.","cites":null},{"id":44673055,"title":"Membrane and morphological changes in apoptotic cells regulated by caspase-mediated activation of PAK2.","authors":[],"date":"1997","doi":"10.1126\/science.276.5318.1571","raw":"Rudel, T., and Bokoch, G.M. (1997). Membrane and morphological changes in apoptotic cells regulated by caspase-mediated activation of PAK2. Science 276, 1571–1574.","cites":null},{"id":44673076,"title":"Microtubule dynamics: taking aim at a moving target.","authors":[],"date":"1995","doi":"10.1016\/1074-5521(95)90119-1","raw":"Wilson, L., and Jordan, M.A. (1995). Microtubule dynamics: taking aim at a moving target. Chem. Biol. 2, 569–573.","cites":null},{"id":44673074,"title":"Microtubule-interfering agents activate c-Jun N-terminal kinase\/stress-activated protein kinase through both ras and apoptosis signal-regulating kinase pathways.","authors":[],"date":"1998","doi":"10.1074\/jbc.273.9.4928","raw":"Wang, T.H., Wang, H.S., Ichijo, H., Giannakakou, P., Foster, J.S., Fojo, T., and Wimalasena, J. (1998). Microtubule-interfering agents activate c-Jun N-terminal kinase\/stress-activated protein kinase through both ras and apoptosis signal-regulating kinase pathways. J. Biol. Chem. 273, 4928–4936.","cites":null},{"id":44673070,"title":"Microtubule-interfering agents stimulate the transcription of cyclo-oxygenase-2. Evidence for involvement of ERK1\/2 and p38 mitogen-activated protein kinase pathways.","authors":[],"date":"2000","doi":"10.1074\/jbc.275.20.14838","raw":"Subbaramaiah, K., Hart, J.C., Norton, L., and Dannenberg, A.J. (2000). Microtubule-interfering agents stimulate the transcription of cyclo-oxygenase-2. Evidence for involvement of ERK1\/2 and p38 mitogen-activated protein kinase pathways. J. Biol. Chem. 275, 14838–14845. K. Deacon et al.","cites":null},{"id":44673037,"title":"Mitotic block induced in HeLa cells by low concentrations of paclitaxel (Taxol) results in abnormal mitotic exit and apoptotic cell death.","authors":[],"date":"1996","doi":null,"raw":"Jordan, M.A., Wendell, K., Gardiner, S., Derry, W.B., Copp, H., and Wilson, L. (1996). Mitotic block induced in HeLa cells by low concentrations of paclitaxel (Taxol) results in abnormal mitotic exit and apoptotic cell death. Cancer Res. 56, 816–825.","cites":null},{"id":44673077,"title":"Movement of bax from the cytosol to mitochondria during apoptosis.","authors":[],"date":"1997","doi":"10.1083\/jcb.139.5.1281","raw":"Wolter, K.G., Hsu, Y-T., Smith, C.L., Nechustan, A., Xi, X.G., and Youle, R.J. (1997). Movement of bax from the cytosol to mitochondria during apoptosis. J. Cell Biol. 139, 1281–1292.","cites":null},{"id":44673079,"title":"Opposing effects of ERK and JNK-p38 MAPKs on apoptosis.","authors":[],"date":"1995","doi":"10.1126\/science.270.5240.1326","raw":"Xia, Z., Dickens, M., Raingeaud, J., Davis, R.J., and Greenberg, M.E. (1995). Opposing effects of ERK and JNK-p38 MAPKs on apoptosis.","cites":null},{"id":44673056,"title":"P21-activated kinase 1 phosphorylares the death agonist Bad and protects cells from apoptosis.","authors":[],"date":"2000","doi":"10.1128\/mcb.20.2.453-461.2000","raw":"Schurmann, A., Mooney, A.F., Sanders, L.C., Sells, M.A., Wang, H.G., Reed, J.C., and Bokoch, G.M. (2000). P21-activated kinase 1 phosphorylares the death agonist Bad and protects cells from apoptosis. Mol. Cell. Biol. 20, 453–461.","cites":null},{"id":44673035,"title":"p21-activated protein kinase -PAK suppresses programmed cell death of BALB3T3 fibroblasts.","authors":[],"date":"2001","doi":"10.1074\/jbc.m007753200","raw":"Jakobi, R., Moertl, E., and Koeppel, M.A. (2001). p21-activated protein kinase -PAK suppresses programmed cell death of BALB3T3 fibroblasts. J. Biol. Chem. 276, 16624–16634.","cites":null},{"id":44673050,"title":"p21WAF1 is dynamically associated with JNK in human T-lymphocytes during cell cycle progression.","authors":[],"date":"1998","doi":null,"raw":"Patel, R., Bartosch, B., and Blank, J.L. (1998). p21WAF1 is dynamically associated with JNK in human T-lymphocytes during cell cycle progression. J. Cell Sci. 111, 2247–2255.","cites":null},{"id":44673031,"title":"p38 MAPK mediates Bax translocation in nitric oxide-induced apoptosis in neurons.","authors":[],"date":"2000","doi":"10.1083\/jcb.150.2.335","raw":"Ghatan, S., Larner, S., Kinoshita, Y., Hetman, M., Patel, L., Xia, Z., Youle, R.J., and Morrison, R.S. (2000). p38 MAPK mediates Bax translocation in nitric oxide-induced apoptosis in neurons. J. Cell Biol. 150, 335–347.","cites":null},{"id":44673016,"title":"p38 Mitogenactivated protein kinase pathway protects adult rat ventricular myocytes against -adrenergic receptor-stimulated apoptosis. Evidence for Gi-dependent activation.","authors":[],"date":"2000","doi":"10.1074\/jbc.m910471199","raw":"Communal, C., Colucci, W.S., and Singh, K. (2000). p38 Mitogenactivated protein kinase pathway protects adult rat ventricular myocytes against -adrenergic receptor-stimulated apoptosis. Evidence for Gi-dependent activation. J. Biol. Chem. 275, 19395–19400.","cites":null},{"id":44673049,"title":"Paclitaxel induces prolonged activation of the Ras\/MEK\/ERK pathway independently of activating the programmed cell death machinery.","authors":[],"date":"2001","doi":"10.1016\/s0016-5085(08)83290-8","raw":"Okano, J.-I., and Rustgi, A.K. (2001). Paclitaxel induces prolonged activation of the Ras\/MEK\/ERK pathway independently of activating the programmed cell death machinery. J. Biol. Chem. 276, 19555–19564.","cites":null},{"id":44673075,"title":"Paclitaxel-induced cell death: where the cell cycle and apoptosis come together.","authors":[],"date":"2000","doi":"10.1002\/1097-0142(20000601)88:11<2619::aid-cncr26>3.0.co;2-j","raw":"Wang, T.H., Wang, H.S., and Soong, Y.K. (2000). Paclitaxel-induced cell death: where the cell cycle and apoptosis come together. Cancer 88, 2619–2628.","cites":null},{"id":44673012,"title":"PAK to the future.","authors":[],"date":"1999","doi":"10.1016\/s0962-8924(99)01618-9","raw":"Bagrodia, S., and Cerione, R.A. (1999). PAK to the future. Trends Cell Biol. 9, 350–355.","cites":null},{"id":44673073,"title":"Requirement for ceramide-initiated SAPK\/ JNK signaling in stress-induced apoptosis.","authors":[],"date":"1996","doi":"10.1038\/380075a0","raw":"Verheij, M., et al. (1996). Requirement for ceramide-initiated SAPK\/ JNK signaling in stress-induced apoptosis. Nature 380, 75–79.","cites":null},{"id":44673011,"title":"Role of p38-mitogen-activated protein kinase in spontaneous apoptosis of human neutrophils.","authors":[],"date":"1999","doi":null,"raw":"Aoshiba, K., Yasui, S., Hayashi, M., Tamaoki, J., and Nagai, A. (1999). Role of p38-mitogen-activated protein kinase in spontaneous apoptosis of human neutrophils. J. Immunol. 162, 1692–1700.","cites":null},{"id":44673047,"title":"Selective potentiation of paclitaxel (taxol)-induced cell death by mitogen-activated protein kinase kinase inhibition in human cell lines.","authors":[],"date":"2001","doi":null,"raw":"McDaid, H.M., and Horwitz, S.B. (2001). Selective potentiation of paclitaxel (taxol)-induced cell death by mitogen-activated protein kinase kinase inhibition in human cell lines. Mol. Pharmacol. 60, 290–301.","cites":null},{"id":44673078,"title":"Taxol-induced mitotic block triggers rapid onset of a p53-independent apoptotic pathway.","authors":[],"date":"1995","doi":null,"raw":"Woods, C.M., Zhu, J., McQuenet, P.A., Bollag, D., and Lazarides, E. (1995). Taxol-induced mitotic block triggers rapid onset of a p53-independent apoptotic pathway. Mol. Med. 1, 506–526.","cites":null},{"id":44673071,"title":"The Akt proto-oncogene links Ras to Pak and cell survival signals.","authors":[],"date":"2000","doi":"10.1074\/jbc.275.13.9106","raw":"Molecular Biology of the Cell2086 Tang, Y., Zhou, S., Chen, A., Pittman, R.N., and Field, J. (2000). The Akt proto-oncogene links Ras to Pak and cell survival signals. J. Biol. Chem. 275, 9106–9109.","cites":null},{"id":44673054,"title":"The clinical pharmacology and use of antimicrotubule agents in cancer chemotherapy.","authors":[],"date":"1991","doi":"10.1016\/0163-7258(91)90086-2","raw":"Rowinsky, E.K., and Donehower, R.C. (1991). The clinical pharmacology and use of antimicrotubule agents in cancer chemotherapy. Pharmacol. Ther. 52, 35–84.","cites":null},{"id":44673052,"title":"The Jun kinase\/stress-activated protein kinase pathway functions to regulate DNA repair and inhibition of the pathway sensitizes tumor cells to cisplatin.","authors":[],"date":"1997","doi":"10.1074\/jbc.272.22.14041","raw":"Potapova, O., Haghighi, A., Bost, F., Liu, C., Birrer, M.J., Gjerset, R., and Mercola, D. (1997). The Jun kinase\/stress-activated protein kinase pathway functions to regulate DNA repair and inhibition of the pathway sensitizes tumor cells to cisplatin. J. Biol. Chem. 272, 14041–14044.","cites":null},{"id":44673014,"title":"The MEK1-ERK1\/2 signaling pathway promotes compensated cardiac hypertrophy in transgenic mice.","authors":[],"date":"2000","doi":"10.1093\/emboj\/19.23.6341","raw":"Bueno, O.F., et al. (2000). The MEK1-ERK1\/2 signaling pathway promotes compensated cardiac hypertrophy in transgenic mice. Cancer Res. 60, 5887–5894.","cites":null},{"id":44673057,"title":"The role of erk1\/2 and p38 MAP-kinase pathways in taxolinduced apoptosis in human ovarian carcinoma cells.","authors":[],"date":"2001","doi":"10.1006\/excr.2001.5262","raw":"Seidman, R., Gitelman, I., Sagi, O., Horwitz, S.B., and Wolfson, M. (2001). The role of erk1\/2 and p38 MAP-kinase pathways in taxolinduced apoptosis in human ovarian carcinoma cells. Exp. Cell Res. 268, 84–92.","cites":null},{"id":44673032,"title":"The serine\/threonine kinase PAK4 prevents caspase activation and protects cells from apoptosis.","authors":[],"date":"2001","doi":"10.1128\/mcb.23.21.7838-7848.2003","raw":"Gnesutta, N., Qu, J., and Minden, A. (2001). The serine\/threonine kinase PAK4 prevents caspase activation and protects cells from apoptosis. J. Biol. Chem. 276, 14414–14419.","cites":null},{"id":44673033,"title":"The ups and downs of MEK kinase interactions.","authors":[],"date":"2001","doi":"10.1016\/s0898-6568(01)00220-0","raw":"Hagemann, C., and Blank, J.L. (2001). The ups and downs of MEK kinase interactions. Cell Signal. 13, 863–875.","cites":null},{"id":44673066,"title":"Waiting for anaphase: Mad2 and the spindle assembly checkpoint.","authors":[],"date":"2000","doi":null,"raw":"Shah, J.V., and Cleveland, D.W. (2000). Waiting for anaphase: Mad2 and the spindle assembly checkpoint. Cell 103, 997–1000.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-01-26","abstract":"Activation of the mitotic checkpoint by chemotherapeutic drugs such as taxol causes mammalian cells to arrest in mitosis and then undergo apoptosis. However, the biochemical basis of chemotherapeutic drug-induced cell death is unclear. Herein, we provide new evidence that both cell survival and cell death-signaling pathways are concomitantly activated during mitotic arrest by microtubule-interfering drugs. Treatment of HeLa cells with chemotherapeutic drugs activated both p38 mitogen-activated protein kinase (MAPK) and p21-activated kinase (PAK). p38 MAPK was necessary for chemotherapeutic drug-induced cell death because the p38 MAPK inhibitors SB203580 or SB202190 suppressed cell death. Dominant-active MKK6, a direct activator of p38 MAPK, also induced cell death by stimulating translocation of Bax from the cytosol to the mitochondria in a p38 MAPK-dependent manner. Dominant active PAK suppressed this MKK6-induced cell death. PAK seems to mediate cell survival by phosphorylating Bad, and inhibition of PAK in mitotically arrested cells reduced Bad phosphorylation and increased apoptosis. Our results suggest that therapeutic strategies that suppress PAK-mediated survival signals may improve the efficacy of current cancer chemotherapies by enhancing p38 MAPK-mediated cell death.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/creativecommons.org\/licenses\/by-sa\/3.0\/).","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/1553\/1\/10.1091_mbc.E02-10-0653.pdf","pdfHashValue":"5779b59864c5e2d3b1370c1045ed3b2982d44507","publisher":"American Society for Cell Biology","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/1553<\/identifier><datestamp>\n                2014-02-15T02:01:15Z<\/datestamp><setSpec>\n                com_2381_69<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_70<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \np38 mitogen-activated protein kinase mediates cell death and p21-activated kinase mediates cell survival during Chemotherapeutic Drug-induced mitotic arrest<\/dc:title><dc:creator>\nDeacon, Karl<\/dc:creator><dc:creator>\nMistry, Pratibha<\/dc:creator><dc:creator>\nChernoff, Jonathan<\/dc:creator><dc:creator>\nBlank, Jonathan L.<\/dc:creator><dc:creator>\nPatel, Rajnikant<\/dc:creator><dc:description>\nActivation of the mitotic checkpoint by chemotherapeutic drugs such as taxol causes mammalian cells to arrest in mitosis and then undergo apoptosis. However, the biochemical basis of chemotherapeutic drug-induced cell death is unclear. Herein, we provide new evidence that both cell survival and cell death-signaling pathways are concomitantly activated during mitotic arrest by microtubule-interfering drugs. Treatment of HeLa cells with chemotherapeutic drugs activated both p38 mitogen-activated protein kinase (MAPK) and p21-activated kinase (PAK). p38 MAPK was necessary for chemotherapeutic drug-induced cell death because the p38 MAPK inhibitors SB203580 or SB202190 suppressed cell death. Dominant-active MKK6, a direct activator of p38 MAPK, also induced cell death by stimulating translocation of Bax from the cytosol to the mitochondria in a p38 MAPK-dependent manner. Dominant active PAK suppressed this MKK6-induced cell death. PAK seems to mediate cell survival by phosphorylating Bad, and inhibition of PAK in mitotically arrested cells reduced Bad phosphorylation and increased apoptosis. Our results suggest that therapeutic strategies that suppress PAK-mediated survival signals may improve the efficacy of current cancer chemotherapies by enhancing p38 MAPK-mediated cell death.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:10:33Z<\/dc:date><dc:date>\n2009-12-08T16:10:33Z<\/dc:date><dc:date>\n2003-01-26<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nMolecular biology of the cell, 2003, 14 (5), pp.2071-2087<\/dc:identifier><dc:identifier>\n1059-1524<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/1553<\/dc:identifier><dc:identifier>\nhttp:\/\/www.molbiolcell.org\/content\/14\/5\/2071<\/dc:identifier><dc:identifier>\n10.1091\/mbc.E02-10-0653<\/dc:identifier><dc:identifier>\n1939-4586<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © the authors, 2003. This is an open-access article distributed under the terms of the Creative Commons Attribution-ShareAlike Licence (http:\/\/creativecommons.org\/licenses\/by-sa\/3.0\/).<\/dc:rights><dc:publisher>\nAmerican Society for Cell Biology<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1059-1524","1059-1524","issn:1939-4586","1939-4586"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2003,"topics":[],"subject":["Article"],"fullText":"Molecular Biology of the Cell\nVol. 14, 2071–2087, May 2003\np38 Mitogen-Activated Protein Kinase Mediates Cell\nDeath and p21-Activated Kinase Mediates Cell\nSurvival during Chemotherapeutic Drug-induced\nMitotic Arrest\nKarl Deacon,*† Pratibha Mistry,‡ Jonathan Chernoff,§ Jonathan L. Blank,*\nand Rajnikant Patel‡\u0001\n*Departments of Cell Physiology and Pharmacology, and ‡Biochemistry, University of Leicester,\nLeicester LE1 7RH, United Kingdom; and §The Fox Chase Cancer Center, Philadelphia, Pennsylvania\n19111\nSubmitted October 14, 2002; Revised November 22, 2002; Accepted December 27, 2002\nMonitoring Editor: Marc Mumby\nActivation of the mitotic checkpoint by chemotherapeutic drugs such as taxol causes mammalian\ncells to arrest in mitosis and then undergo apoptosis. However, the biochemical basis of chemo-\ntherapeutic drug-induced cell death is unclear. Herein, we provide new evidence that both cell\nsurvival and cell death-signaling pathways are concomitantly activated during mitotic arrest by\nmicrotubule-interfering drugs. Treatment of HeLa cells with chemotherapeutic drugs activated\nboth p38 mitogen-activated protein kinase (MAPK) and p21-activated kinase (PAK). p38 MAPK\nwas necessary for chemotherapeutic drug-induced cell death because the p38 MAPK inhibitors\nSB203580 or SB202190 suppressed cell death. Dominant-active MKK6, a direct activator of p38\nMAPK, also induced cell death by stimulating translocation of Bax from the cytosol to the\nmitochondria in a p38 MAPK-dependent manner. Dominant active PAK suppressed this MKK6-\ninduced cell death. PAK seems to mediate cell survival by phosphorylating Bad, and inhibition of\nPAK in mitotically arrested cells reduced Bad phosphorylation and increased apoptosis. Our\nresults suggest that therapeutic strategies that suppress PAK-mediated survival signals may\nimprove the efficacy of current cancer chemotherapies by enhancing p38 MAPK-mediated cell\ndeath.\nINTRODUCTION\nDuring mitosis, a feedback mechanism called the spindle or\nmitotic checkpoint ensures that replicated chromosomes are\nsegregated equally between the two daughter cells before\ndivision (reviewed in Shah and Cleveland, 2000). The mi-\ntotic checkpoint pathway is regulated by a group of evolu-\ntionarily conserved genes that include MAD1, MAD2,\nMAD3 (or BUBR1), BUB1, BUB3, and MPS1 (Burke, 2000).\nThese proteins preferentially bind to the kinetochores of\nunattached chromosomes where they are thought to gener-\nate the signal that suppresses anaphase onset (Burke, 2000;\nShah and Cleveland, 2000). Currently, there are two ways in\nwhich the mitotic checkpoint can be activated experimen-\ntally. First, cells can be treated with chemicals that perturb\nmicrotubule dynamics such as nocodazole, taxol, vincristine,\nand vinblastine (Li and Benezra, 1996; Sorger et al., 1997). By\neither depolymerizing (nocodazole, vincristine, and vinblas-\ntine) or stabilizing (taxol) microtubules, these agents activate\nthe mitotic checkpoint and induce a mitotic cell cycle arrest\n(Sorger et al., 1997). Second, overexpression of the MAD\n(mitotic arrest deficient) checkpoint proteins has been re-\nported to activate the spindle checkpoint and cause mitotic\narrest (Fang et al., 1999; Geley et al., 2001). Regardless of the\nmethod of activation, a common feature of the checkpoint-\narrested cells is a tendency to undergo apoptotic cell death.\nFor example, many agents used to activate the mitotic check-\npoint experimentally are also used clinically in the treatment\nof cancer (Rowinsky and Donehower, 1991; Wilson and\nJordan, 1995) and induce apoptosis in the mitotically ar-\nrested cells (Woods et al., 1995; Jordan et al., 1996). Therefore,\nthe available evidence links activation of the mitotic check-\npoint with apoptosis, although the biochemical mechanisms\nArticle published online ahead of print. Mol. Biol. Cell 10.1091\/\nmbc.E02–10–0653. Article and publication date are at www.molbi-\nolcell.org\/cgi\/doi\/10.1091\/mbc.E02–10–0653.\n† Present address: AstraZeneca R&D Charnwood, Bakewell Road,\nLoughborough, Leicester, LE11 5RH, United Kingdom.\n\u0002 Corresponding author. E-mail address: rp31@le.ac.uk.\n© 2003 by The American Society for Cell Biology 2071\nand signaling pathways that underlie the toxicity of chemo-\ntherapeutic drugs are not clearly understood.\nStudies in mammalian cells suggest that members of the\nmitogen-activated protein kinase (MAPK) family and the\np21-activated kinase (PAK) family are involved in the reg-\nulation of cell survival and cell death (Xia et al., 1995; Verheij\net al., 1996; Kummer et al., 1997; Potapova et al., 1997;\nAoshiba et al., 1999; Bueno et al., 2000; Communal et al., 2000;\nKurokawa et al., 2000; Remacle-Bonnet et al., 2000; Schur-\nmann et al., 2000; Tang et al., 2000; Deschesnes et al., 2001;\nGnesutta et al., 2001; Jakobi et al., 2001). MAPKs comprise a\nfamily of serine\/threonine protein kinases that function as\ncritical mediators of signal transduction (Kyriakis and\nAvruch, 2001) and include the extracellular signal-regulated\nkinases (ERKs), the c-Jun NH2-terminal kinases (JNKs), and\nthe p38 MAPKs. The ERKs are activated in response to\nmitogen or growth factor stimulation, whereas the JNKs and\np38 MAPKs are activated by proinflammatory cytokines and\na variety of cellular stresses, including UV light, hyperos-\nmolarity, heat shock, and microtubule disrupting drugs\n(Wang et al., 1998, 2000; Yujiri et al., 1999; Kyriakis and\nAvruch, 2001; Okano and Rustgi, 2001; McDaid and Hor-\nwitz, 2001; Stadheim et al., 2001). The PAKs are a group of\nserine\/threonine protein kinases that are directly activated\nby the GTPases Rac and Cdc42. Together with Ras, these\nGTPases also activate mitogen-activated protein (MAP) ki-\nnase pathways and regulate diverse cellular processes such\nas cell morphology, motility, transformation, and apoptosis\n(Bagrodia and Cerione, 1999).\nIn the current study, we have examined the function of\np38 MAPK in mitotically arrested HeLa cells. We show that\nantimicrotubule drugs cause concomitant activation of a p38\nMAPK-mediated proapoptotic signaling pathway and a\nPAK-mediated prosurvival signaling pathway in the mitot-\nically arrested cells. p38 MAPK stimulates apoptosis in mi-\ntotically arrested cells by inducing translocation of the pro-\napoptotic protein Bax from the cytoplasm to the\nmitochondria, whereas PAK opposes p38 MAPK-induced\ncell death by phosphorylating the proapoptotic protein Bad.\nMATERIALS AND METHODS\nCell Culture and Preparation of Cell Extracts\nHuman cervical carcinoma cells (HeLa) were cultured as described\npreviously (Patel et al., 1999). To obtain mitotically arrested cells, an\nasynchronous population of HeLa cells was treated with either\nnocodazole (3 \u0001M), taxol (1 \u0001M), vincristine (1 \u0001M), or vinblastine\n(1 \u0001M) for various times (0–30 h). Mitotic cells were collected by\nmechanical shake-off, washed in Dulbecco’s phosphate-buffered sa-\nline (DPBS), and lysed in the appropriate buffer, depending on the\nprotein kinase being assayed as described previously (Patel et al.,\n1998). Radioimmunoprecipitation (RIPA) assay buffer was used to\nprepare cell lysates for immunoblotting with the poly ADP-ribose\npolymerase (PARP) antibody. Cells remaining attached to the plates\nafter shake-off were washed three times with DPBS (containing\neither nocodazole [3 \u0001M], taxol [1 \u0001M], vincristine [1 \u0001M], or\nvinblastine [1 \u0001M]) and lysed by scraping into the appropriate\nbuffer. Cell lysates were centrifuged at 14,000 \u0001 g for 10 min at 4°C,\nand the protein content of the supernatant was determined using\nthe Coomassie protein assay reagent (Pierce Chemical, Rockford, IL)\nbefore normalization and solubilization in two times SDS-PAGE\nsample buffer. Cell lysates for Western blotting with the Bad anti-\nbody or the phospho-specific Bad antibodies were solubilized in\nSDS-PAGE sample buffer before sonication for 10–15 s.\nAntibodies\np38\u0002, Erk1, Erk2, cdk1, anti-hemagglutinin epitope tag (HA), and\nPAK\u0002 were purchased from Santa Cruz Biotechnology (Santa Cruz,\nCA). Anti-FLAG (M2), Cy3-conjugated anti-FLAG (M2), anti-\u0003-tu-\nbulin, anti-\u0004-actin, horseradish peroxidase (HRP)-conjugated goat\nanti-mouse, HRP-conjugated goat anti-rabbit, and HRP-conjugated\nmouse anti-goat were from Sigma-Aldrich (St. Louis, MO). Anti-\nJNK1 (BD Biosciences PharMingen, San Diego, CA) anti-M30, which\ndetects caspase cleavage, and cytokeratin 18 (Leers et al., 1999) was\nfrom Roche Diagnostics (Indianapolis, IN), along with anti-PARP\n(Roche Diagnostics). Alexa Fluor 488 goat anti-mouse IgG, Alexa\nFluor 488 goat anti-rabbit IgG, and Alexa Fluor 594 rabbit anti-\nmouse IgG were from Molecular Probes (Eugene, OR). Phosphospe-\ncific anti-Bad and total anti-Bad were from New England Biolabs\n(Beverly, MA).\nPlasmids and Mutagenesis\nThe expression vectors (FLAG epitope-tagged in pCDNA3) for p38\u0002\n(murine), p38\u0004 (human), p38\u0003 (human), and p38\u0005 (human) were\nprovided by J. Han (Scripps Research Institute, La Jolla, CA). The\nfollowing expression vectors (all FLAG epitope-tagged in pCDNA3)\nwere provided by R. Davis (University of Massachusetts Medical\nCenter, Amherst, MA): dominant active (DA) MKK6 (S207D,\nT211D), kinase dead (KD) MKK6, glutathione S-transferase (GST)-\np38\u0002 wild-type (WT), and GST-MKK6 (WT). The following expres-\nsion constructs (all HA-epitope-tagged in the pXJ vector) were\nprovided by E. Manser (Glaxo-Singapore, Singapore): PAK\u0002 (WT),\nDAPAK\u0002 (L106F), and KDPAK\u0002 (K298A). The expression vector for\ngreen fluorescent protein (GFP)-human bax was provided by R.\nYoule (National Institutes of Health, Bethesda, MD). The constructs\nfor generating recombinant GST-fusion proteins of murine wild-\ntype Bad (mBad) were provided by G. Bokoch (Scripps Research\nInstitute). The mammalian expression vector for GST-mBad (pEB-\nGmBad) was purchased from New England Biolabs. The pEBG\nempty vector was provided by D. Alessi (University of Dundee,\nDundee, United Kingdom). In vitro mutagenesis of mBAD was\ncarried out using the QuickChange site-directed mutagenesis kit\n(Stratagene, La Jolla, CA) according to the manufacturer’s protocol.\nHuman MAD2 was cloned from a HeLa cell cDNA library (Strat-\nagene) by polymerase chain reaction and subcloned into a mamma-\nlian expression vector (pCMV5) containing an N-terminal HA tag.\nImmunoprecipitation and Western Blot Analysis\nImmunoprecipitations were performed as described previously (Pa-\ntel et al., 1998). The immunoprecipitated proteins and the cell ex-\ntracts were resolved by SDS-PAGE and electroblotted onto Hy-\nbond-C nitrocellulose membrane by using a Hoeffer semidry\nblotting apparatus (Amersham Biosciences, Piscataway, NJ). Immu-\nnoreactive proteins were visualized using enhanced chemilumines-\ncence (Amersham Biosciences). For immunoblotting with the phos-\nphospecific Bad antibodies, the procedure recommended by the\nmanufacturer was strictly followed.\nProtein Kinase Assays\nImmunecomplex kinase assays for JNK1, p38 MAPK, Erk1, Erk2,\nand cdk1 were performed as described previously (Patel et al., 1998)\nusing GST-c-Jun, GST-activating transcription factor-2 (ATF-2), my-\nelin basic protein (MBP), and histone H1 as substrates, respectively.\nThe activity of the immunoprecipiated PAK\u0002 was assayed as de-\nscribed above for JNK1 (Patel et al., 1998) by using a GST-fusion\ncontaining the N-terminal 290 amino acids of mitogen-activated\nprotein kinase kinase kinase (MEKK)2 as substrate (Deacon and\nBlank, 1999; Hagemann and Blank, 2001). Incorporated radioactivity\nwas quantified by liquid scintillation counting of bands excised\nfrom SDS-PAGE gels.\nK. Deacon et al.\nMolecular Biology of the Cell2072\nFlow Cytometry\nAnalysis of the DNA content was performed by flow cytometry\n(FACScan; BD Biosciences, San Jose, CA) as described previously\n(Patel et al., 1998).\nTransfection of HeLa Cells\nHeLa cells were plated at a density of \u00025 \u0001 105 cells\/well in a\nsix-well plate or at 1 \u0001 105 cells\/well for coverslips in an eight-well\nplate. Eighteen to 24 h later, the cells were transfected with 1–4 \u0001g\nof DNA by using FuGENE 6 according to the manufacturer’s in-\nstructions (Roche Diagnostics). At 18–24 h after transfection, the\ncells on the coverslips were either fixed in cold (\u000320°C) methanol or\nincubated with MitoTracker red CMXRos (500 nM; Molecular\nProbes) for 15 min at 37°C, washed two times with DPBS, and fixed\nfor 10 min in 4% (vol\/vol) formaldehyde in DPBS. The cells were\nthen processed for immunofluorescence microscopy as described\nbelow. The cells in the six-well plates were either washed two times\nwith DPBS and lysed in the appropriate buffer to make cell extracts\nor collected (floating and attached cells) either for flow cytometry or\nfor the determination of apoptosis as described above.\nImmunofluorescence and Confocal Microscopy\nHeLa cells were grown either on coverslips or in eight-well cham-\nbered slides (Nalge Nunc, Naperville, IL) and where indicated the\ncells were transfected as described above. The cells were washed\nthree times in DPBS and fixed either in cold (\u000320°C) methanol for 30\nmin at \u000320°C or in 4% (vol\/vol) formaldehyde in DPBS for 30 min\nat room temperature (for MitoTracker). Cells were rinsed five times\nwith phosphate-buffered saline and the aldehyde-fixed cells perme-\nabilized in 0.1% (vol\/vol) Triton X-100 in phosphate-buffered saline\nfor 10 min at room temperature. Cells were then blocked with 1%\n(wt\/vol) bovine serum albumin (BSA) (in DPBS) for 45–60 min at\nroom temperature. The following primary antibodies, diluted in 1%\n(wt\/vol) BSA in DPBS, were used for immunocytochemistry:\n\u0002-FLAG (M2), \u0002-FLAG (M2) Cy3-conjugate, or \u0002-HA. After incuba-\ntion at room temperature for 60 min, the cells were washed five\ntimes with DPBS before incubation with the secondary antibody for\na further 60 min at room temperature. The following secondary\nantibodies, diluted in 1% (wt\/vol) BSA in DPBS, were used: sheep\nanti-mouse IgG, Texas Red conjugated sheep anti-mouse IgG, fluo-\nrescein isothiocyanate-conjugated and donkey anti-rabbit IgG, flu-\norescein isothiocyanate-conjugated. The cells were washed five\ntimes with DPBS and the nuclei labeled by staining with Hoechst\n33258 (1 \u0001g\/ml in DPBS) for 5 min at room temperature. Cells were\nviewed on an inverted fluorescence microscope (TE3000; Nikon,\nTokyo, Japan), and images were captured through a 100\u0001 objective\n(numerical aperture 1.4) by using an Orca ER charge-coupled device\ncamera (Hamamatsu Photonics, Bridgewater, NJ). For deconvolu-\ntion the images were captured in the z-plane at 1-\u0001m intervals by\nusing a 100\u0001 piezo-driven objective (numerical aperture 1.4). The\nimages were volume deconvolved and merged using Openlab soft-\nware (Improvision, Coventry, United Kingdom). The Openlab im-\nages were subsequently compiled in Photoshop (Adobe Systems,\nMountain View, CA). Confocal scanning microscopy was per-\nformed on a Leitz DM IRB\/E TCS4D (Leica, Wezlar, Germany). A\nkrypton\/argon laser was used for fluorescence excitation of GFP\n(488 nm), MitoTracker red (568 nm), Hoechst 33342 (364 nm), and\nCy5 (647 nm). Images were processed and maximum projections\nmade using Scanware (Leica). Tiff files for all four fluorochromes\nwere merged using OpenLab software.\nPreparation of Recombinant GST Fusion Proteins\nRecombinant GST-c-Jun, GST-ATF-2, GST-MEKK2 (N terminus),\nGST-MKK6 (wt), and GST-p38\u0002 were prepared as described previ-\nously (Deacon and Blank, 1999).\nReagents\nSB203580 and SB202190 (Calbiochem, San Diego, CA). Nocodazole,\ntaxol, vincristine, vinblastine, cytochalasin D, phorbol 12-myristate\n13-acetate (PMA), anisomycin, and histone H1 (type IIIs; Sigma-\nAldrich). MBP (Invitrogen, Carlsbad, CA). All other reagents were\nof analytical grade and obtained from Sigma-Aldrich.\nRESULTS\np38 MAPK Is Activated Preferentially in\nMitotically Blocked HeLa Cells\nTreatment of HeLa cells with nocodazole (3 \u0001M) resulted in\nMAD2 localization to condensed chromatin in the mitoti-\ncally arrested cells, confirming that the checkpoint was ac-\ntivated (Figure 1A). Analysis of the nocodazole-treated cells\nby flow cytometry (Figure 1B) indicated the presence of two\npopulations: a mitotic population with high cdk1 activity\n(Figure 2, A and B) and an attached, nonmitotic population\nwith low cdk1 activity (Figure 2, B and C).\nWe evaluated the activity of the MAPKs in the nocoda-\nzole-treated cells by using immunocomplex kinase assays.\np38 MAPK was activated primarily in the mitotically ar-\nrested population (Figure 2A). Immunoblot analysis of p38\u0002\nimmunoprecipitates indicated that the activation of p38\nMAPK was not due to variations in the level of immuno-\nprecipitated p38 protein. In contrast to p38 MAPK, both JNK\nand Erk MAP kinases were activated primarily in the at-\ntached cells (Figure 2, A and B). The activation of MAP\nkinase family members was evaluated further using alterna-\ntive drugs that perturb microtubule dynamics and cause\nmitotic arrest. As observed with nocodazole, treatment of\nHeLa cells with either taxol (1 \u0001M), vincristine (1 \u0001M), or\nvinblastine (1 \u0001M) caused mitotic arrest (as shown by high\ncdk1 activity; Figure 2C) and activated p38 MAPK selec-\ntively in the mitotically arrested population. With the excep-\ntion of taxol, which activated JNK equally in both the mitotic\nand the attached cells, vincristine, vinblastine, and nocoda-\nzole activated JNK preferentially in the attached cells (Figure\n2C). All four drugs also activated the Erk MAP kinases\npreferentially in the attached cell population (Figure 2C).\nImportantly, treatment of HeLa cells with cytochalasin D (5\n\u0001M) or EDTA (0.5 mM) to induce cell rounding or detach-\nment did not activate p38 but did stimulate JNK activity (our\nunpublished data). Furthermore, p38 MAPK was selectively\nactivated in mitotic mouse NIH3T3 cells arrested with either\nnocodazole, taxol, vincristine, and vinblastine (our unpub-\nlished data). These results indicate that p38 MAPK is spe-\ncifically activated in mammalian cells mitotically arrested by\nmicrotubule-interfering drugs.\nWe also evaluated whether p38 MAPK was activated in a\nsynchronized population of mitotic HeLa cells. In normal\nmitotic cells (Mit), containing high cdk1 activity, p38 MAPK\nactivity was not detected compared with cells arrested in\nmitosis with nocodazole (Noc; Figure 2D). To further con-\nfirm that p38 MAPK activation was not necessary for normal\nmitosis, we used the p38 MAPK inhibitors SB203580 and\nSB202190 (Lee et al., 1994). Addition of either SB203580 (20\n\u0001M) or SB202190 (10 \u0001M) to HeLa cells 3 h after release from\nan aphidicolin-thymidine double block had no effect on\neither entry into or exit from mitosis compared with vehicle-\ntreated control cells (our unpublished data). These results\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2073\nsuggest that p38 MAPK is unlikely to be activated during\nnormal mitosis.\nBecause p38 MAPK is activated only in the mitotically\narrested cells, we performed a time-course analysis of p38\nactivation at intervals after the addition of nocodazole (3\n\u0001M) to asynchronous HeLa cells. JNK activity was also\nassayed in parallel. At 6 h after nocodazole addition, when\nthe majority of the cells was still attached (\u000490%), p38\nMAPK activity was low, whereas JNK activity was maximal\n(Figure 3, A and B). From 12 h onward, we were able to\ncollect purely mitotic cells by shake-off as assessed by high\ncdk1 activity. The activation of p38 MAPK correlated closely\nwith that of cdk1, whereas JNK activity had returned to near\nbasal levels 12 h after nocodazole addition (Figure 3, A and\nB). Furthermore, removal of nocodazole from the mitotically\narrested cells resulted in exit from mitosis, as shown by the\ninactivation of cdk1. This inactivation of cdk1 correlated\nwith the inactivation of p38 (Figure 3, C and D), providing\nfurther evidence that p38 MAPK activation is specifically\nassociated with mitotic arrest.\nPAK Is Also Activated Preferentially in Mitotically\nArrested Cells\nWe examined the activation of the PAK\u0002 in mitotically\narrested HeLa cells. PAK\u0002 and p38 MAPK activity was\nanalyzed at intervals after the addition of nocodazole (3 \u0001M)\nto exponentially growing cells. PAK\u0002 activation paralleled\np38 MAPK activation, both occurring selectively in the mi-\ntotic population at 12 h and remaining elevated for up to\n30 h. Neither PAK\u0002 nor p38 MAPK activation was observed\nin the attached population over the same time period (Figure\n4A). Similar results were obtained after treatment of HeLa\ncells with taxol (our unpublished data). HeLa cells treated\nwith taxol (1 \u0001M), vincristine (1 \u0001M), or vinblastine (1 \u0001M)\nalso selectively activated both p38 MAPK and PAK in the\nmitotically arrested cells (Figure 4B). Treatment of HeLa\ncells with either cytochalasin D (5 \u0001M) or EDTA (0.5 mM)\ndid not activate PAK (our unpublished data). Furthermore,\nremoval of the mitotic block in nocodazole-arrested cells\nresulted in inactivation of PAK as cells exited mitosis, as\nassessed by inactivation of cdk1 (Figure 4C). However, PAK\ninactivation seemed to be delayed relative to that of p38\nMAPK. Collectively, these results suggest that activation of\nboth PAK and p38 MAPK is specifically associated with\nmitotic arrest.\nTo determine whether PAK is an upstream activator of\np38 MAPK in HeLa cells we cotransfected either wild-type\n(WT) or dominant active (DA) PAK (L106F) with WT p38\u0002.\nDAPAK, in comparison with WT PAK, was highly active as\nassessed by its ability to phosphorylate GST-Mekk2 but was\nunable to activate cotransfected p38\u0002, as measured GST-\nATF2 phosphorylation (Figure 4D). The transfected p38\u0002\nwas, however, activated by anisomycin as assessed by phos-\nphorylation of GST-ATF2. These data suggest that DAPAK\nis not coupled to p38 MAPK activation in HeLa cells.\np38 MAPK Activation Stimulates Apoptotic Cell\nDeath, whereas PAK Activation Promotes Cell\nSurvival\nThe effect of nocodazole on cell death was assessed in both\nthe attached and the mitotically arrested populations by\nFigure 1. Nocodazole activates the mitotic checkpoint and causes\nmitotic cell cycle arrest. (A) HeLa cells were transfected with HA-\nMAD2 as described in MATERIALS AND METHODS. After 24 h,\nthe cell were treated with nocodazole (3 \u0001M) for 12 h and the mitotic\ncells collected by “shake-off.” The mitotic cells were attached to\npoly-d-lysine–coated coverslips and the cells processed for immu-\nnofluorescence microscopy as described in MATERIALS AND\nMETHODS. HA-MAD2 (green) localized to the condensed chromo-\nsomes (blue) in the nocodazole-arrested mitotic cells. Bar, 10 \u0001m. (B)\nFlow cytometry DNA profiles of exponentially growing HeLa cells\n(top), nocodazole-arrested mitotic cells (middle), and nocodazole-\ntreated attached cells (bottom).\nK. Deacon et al.\nMolecular Biology of the Cell2074\nFigure 2. Activation of p38\nMAPK, but not JNK or Erk, oc-\ncurs during mitotic arrest but not\nduring normal mitosis. (A) Expo-\nnentially growing HeLa cells\nwere treated with either dimethyl\nsulfoxide alone (asynchronous\npopulation [Asyn]) or with no-\ncodazole (3 \u0001M) for 12 h, and the\ncells separated into a mitotic\n(Mit) and an attached (Att) pop-\nulation. Specific antibodies were\nused to immunoprecipitate (IP)\np38 MAPK, JNK, and cdk1 from\nthe cell lysates for immunocom-\nplex kinase assays and Western\nblotting (WB) with anti-p38\nMAPK, anti-JNK, and anti-cdk1.\nA sample of the mitotic cell lysate\nwas also incubated with protein\nA-Sepharose beads alone (C).\nProtein extracts prepared from\nHeLa cells treated with anisomy-\ncin (100 ng\/ml for 0.5 h) were\nalso analyzed in parallel as a pos-\nitive control for the activation of\nboth p38 MAPK and JNK. (B) Ac-\ntivation of Erk1, Erk2, and cdk1\nin nocodazole-arrested mitotic\ncells was determined as de-\nscribed above. Protein extracts\nfrom phorbol 12-myristate 13-ac-\netate–treated (100 nM for 0.5 h)\nHeLa cells were also analyzed in\nparallel as a positive control for\nthe activation of both Erk1 and\nErk2. (C) Activation of p38\nMAPK, JNK, Erk1, Erk2, and\ncdk1 after treatment of exponen-\ntially growing HeLa cells with ei-\nther nocodazole (3 \u0001M), taxol,\nvincristine, or vinblastine (all 1\n\u0001M) for 12 h. (D) HeLa cells were\nsynchronized using the aphidico-\nlin-thymidine double block\nmethod as described in MATERI-\nALS AND METHODS. Eight to\n10 h after release from the cell\ncycle block, mitotic cells were col-\nlected by shake-off and the acti-\nvation of p38 MAPK, JNK, and\ncdk1 in this mitotic cell popula-\ntion (Mit) determined as de-\nscribed in A. Protein extracts\nfrom nocodazole-treated (3 \u0001M\nfor 12 h) HeLa cells were also\nanalyzed in parallel as a positive\ncontrol for the activation of p38\nMAPK.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2075\neither immunoblotting with an anti-PARP antibody or im-\nmunostaining with the M30 antibody. Nocodazole-induced\npoly (ADP-ribose) polymerase (PARP) cleavage was appar-\nent in the mitotic cells at 12 h after drug addition and\ncontinued to increase over the time course examined (Figure\n5A). Treatment of HeLa cells with either taxol (1 \u0001M), vin-\ncristine (1 \u0001M), or vinblastine (1 \u0001M) also caused PARP\ncleavage, preferentially in the mitotic population (Figure\n5B). Nocodazole also induced cleavage of cytokeratin 18 and\ncaused a time-dependent increase in the number of apopto-\ntic cells specifically in the mitotic cell population (Figure 5C,\nright).\nTo determine whether p38 MAPK was involved in this\napoptotic response, p38 MAPK inhibitors were used.\nSB203580 (20 \u0001M) or SB202190 (10 \u0001M) reduced the number\nof apoptotic cells in the mitotic population by 46 and 42%,\nrespectively, as assessed by cytokeratin 18 cleavage (Figure\n5D). The relationship between p38 MAPK activity and apo-\nptosis was examined further by transfecting HeLa cells with\ndominant active (DA) MAP kinase kinase, MKK6 (S207D,\nT211D). Consistent with previous reports (Derijard et al.,\n1995; Jiang et al., 1997) DAMKK6 activated all coexpressed\np38 MAPK isoforms (Figure 6A). Transient expression of\ndaMKK6 in HeLa cells caused apoptosis, as assessed by\ncytokeratin 18 cleavage and chromatin fragmentation (Fig-\nure 6B). The DAMKK6-induced apoptosis is likely to be\nmediated through activation of endogenous p38 MAPK,\nbecause treatment of the transfected cells with either\nSB303580 (20 \u0001M) or SB202190 (20 \u0001M) inhibited apoptosis\nby \u000267% (Figure 6C).\nTo address the function of PAK in mitotically arrested\ncells, DAPAK\u0002 (L106F) was transfected into HeLa cells,\neither separately or together with DAMKK6 (Figure 6D),\nand their effect on survival assayed using the M30 antibody.\nIn the absence of any treatment, 2% of the cells were found\nto be apoptotic (Figure 6E). Transfection with the empty\nvector alone increased the number of apoptotic cells to 12%.\nIn contrast, 54% of DAMKK6-transfected cells were found to\nbe apoptotic as assessed by the presence of both cleaved\ncytokeratin 18 and fragmented chromatin, whereas a signal-\ning inactive mutant of MKK6 (S207A, T211A) did not induce\napoptosis (14%). Coexpression of DAPAK with DAMKK6\nsuppressed DAMKK6-induced apoptosis to near basal levels\n(18%), whereas KDPAK did not affect the level of MKK6-\ninduced apoptosis. We also determined whether PAK aids\ncell survival of nocodazole-arrested mitotic cells. Treatment\nof DAPAK-transfected HeLa cells with nocodazole (3 \u0001M for\n24 h) reduced the number of apoptotic cells in the mitotic\npopulation by 56% (nocodazole: percentage of M30 positive\ncells \u0005 SEM; 34.2 \u0005 3.4, n \u0006 3; nocodazole \u0007 DAPAK: 15 \u0005\n2.2, n \u0006 3). These results suggest that nocodazole activates\ntwo signaling pathways in mitotically arrested cells that\nhave opposing effects on cell survival. Activation of p38\nMAPK either by nocodazole or MKK6 stimulates cell death,\nwhereas activation of PAK stimulates cell survival.\nDAMKK6 Induces Bax Translocation from the\nCytoplasm to the Mitochondria and PAK\nPhosphorylates Bad\nTo examine the mechanism by which p38 MAPK and PAK\nexert their effect on cell survival, we examined whether\nthese enzymes regulate the activity of the bcl-2 family mem-\nbers Bad and Bax. The effect of p38 MAPK on the intracel-\nFigure 3. p38 MAPK activation\nand inactivation correlates with\ncdk1 activation and inactivation\nrespectively. (A) Exponentially\ngrowing HeLa cells were treated\nwith nocodazole (3 \u0001M) and cell\nextracts prepared at the indicated\ntime points after nocodazole ad-\ndition. The activation of p38\nMAPK, JNK, and cdk1 was as-\nsessed using immunocomplex ki-\nnase assays as described in MA-\nTERIALS AND METHODS. (B)\nQuantitation of the data shown in\nA. (C) Exponentially growing\nHeLa cells were treated with no-\ncodazole (3 \u0001M) for 12 h and the\nmitotic cells collected by shake-\noff. After the removal of nocoda-\nzole cell extracts were prepared\nat the indicated time points to as-\nsess the activation of both p38\nMAPK and cdk1 using immuno-\ncomplex kinase assays as de-\nscribed in MATERIALS AND\nMETHODS. (D) Quantitation of\nthe data shown in C.\nK. Deacon et al.\nMolecular Biology of the Cell2076\nlular distribution of Bax was investigated by cotransfecting\nHeLa cells with DAMKK6 and a GFP-Bax fusion construct.\nBoth GFP-Bax (Figure 7A) and MKK6 (Figure 7B) were\ndistributed homogeneously throughout the cytoplasm of\nexponentially growing cells when expressed alone. Cotrans-\nfection of GFP-Bax with DAMKK6 resulted in a dramatic\nchange in the distribution of Bax from a homogeneous dis-\ntribution to a more punctate, perinuclear distribution (Fig-\nure 7C). Early morphological changes (16 h after transfec-\ntion) included cell rounding and membrane blebbing\n(Figure 7C). At later times (36 h after transfection), chroma-\ntin condensation and fragmentation was accompanied by\ncell shrinkage (Figure 7D). In control experiments where\nKDMKK6 was cotransfected with GFP-Bax, Bax remained\nhomogeneously distributed throughout the cytoplasm (Fig-\nure 7E). In addition, cotransfection of DAMKK6 with a\nplasmid expressing GFP alone caused no redistribution of\nGFP (Figure 7F). To determine whether the DAMKK6-in-\nduced redistribution of Bax was mediated through activa-\ntion of p38 MAPK, cells cotransfected with GFP-Bax and\nDAMKK6 were treated with either SB203580 or SB202190. In\ncells transfected with GFP-Bax alone, Bax showed a punc-\ntate, perinuclear distribution in 14% of the cells. However, in\ncells coexpressing both GFP-Bax and DAMKK6, 55% of the\ncells displayed a punctate, perinuclear distribution of Bax. In\nthe presence of either SB203580 (20 \u0001M) or SB202190 (10 \u0001M)\nthe translocation of Bax to the perinuclear region was re-\nduced to near basal levels (16%) (Figure 7G).\nWe determined whether DAMKK6 was inducing redistri-\nbution of GFP-Bax to the mitochondria. In cells cotransfected\nwith GFP-Bax and DAMKK6 (Figure 8, A–E), the punctate\ndistribution of GFP-Bax (Figure 8A) coincided with mito-\nchondrial staining by MitoTracker red (Figure 8B). These\nresults demonstrate that the DAMKK6-induced activation of\np38 MAPK is sufficient to stimulate Bax translocation from\nthe cytosol to the mitochondria. Next, we determined\nwhether Bax also translocates to the mitochondria in no-\ncodazole-arrested mitotic cells. HeLa cells transfected with\nFigure 4. PAK activation correlates with the activation of p38 MAPK in mitotically arrested HeLa cells but PAK does not activate p38\nMAPK. (A) Exponentially growing HeLa cells were treated with nocodazole (3 \u0001M) and cell extracts prepared, after separation of the attached\n(Att) and the mitotic cell populations (Mit), at the indicated time points. Activation of p38 MAPK and PAK was assessed using immuno-\ncomplex kinase assays as described in MATERIALS AND METHODS. The cell extracts were also immunoblotted (WB) with specific\nantibodies for p38\u0002 and PAK\u0002. (B) Activation of p38 MAPK and PAK after treatment of exponentially growing HeLa cells were treated with\nnocodazole (3 \u0001M), taxol, vincristine, or vinblastine (all 1 \u0001M) for 12 h. The cell extracts were also immunoblotted (WB) with anti-p38\u0002 and\nPAK\u0002. (C) Activation of p38 MAPK and PAK\u0002 at the indicated times after treatment of exponentially growing HeLa cells were treated with\nnocodazole (3 \u0001M) for 12 h. (D) HeLa cells were transfected with FLAG epitope-tagged p38\u0002 alone or together with either HA epitope-tagged\nwild-type (wt) PAK\u0002 or dominant active (L107F) HA-PAK\u0002. Twenty-four hours after transfection, cells transfected with p38\u0002 alone were\ntreated with anisomycin (100 ng\/ml for 0.5h) or an equivalent volume of dimethyl sulfoxide. The activation of PAK\u0002 and p38 MAPK was\ndetermined using immunocomplex kinase assays and cell extracts immunoblotted with either an anti-HA or anti-FLAG antibody to verify\ntransfection efficiency.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2077\nFigure 5. Nocodazole-mediated\ninduction of apoptosis in HeLa\ncells requires p38 MAPK activity.\n(A) Immunoblot analysis (WB) of\nnocodazole-induced apoptosis,\nassessed by PARP cleavage, after\ntreatment of exponentially grow-\ning HeLa cells with nocodazole (3\n\u0001M) for the indicated times. At\nthe 6-h time point a mitotic\nshake-off was not performed as\nfew mitotic cells were present\n(\b10%). Protein extracts pre-\npared from HeLa cells treated\nwith staurosporine (1 \u0001M for 6 h)\nwere analyzed in parallel as a\npositive control for PARP cleav-\nage. Arrowheads indicate the po-\nsition of the immunoreactive\nbands corresponding to intact\nPARP (113 kDa) and the caspase-\ncleaved PARP (89 kDa). (B) Im-\nmunoblot analysis of PARP\ncleavage after treatment of expo-\nnentially growing HeLa cells\nwith nocodazole (3 \u0001M), taxol,\nvincristine, or vinblastine (all 1\n\u0001M) for 12 h. (C) HeLa cells were\nplated onto sterile glass cover-\nslips. Twenty-four hours later,\nthe cells were treated with no-\ncodazole (3 \u0001M) for the indicated\ntimes. The mitotic cells were re-\ncovered by shake-off, and the\ncells were reattached to poly-d-\nlysine–coated glass coverslips.\nBoth the mitotic and attached\ncells were fixed and stained with\nthe M30 antibody as described IN\nMATERIALS AND METHODS.\nLeft, indirect immunofluores-\ncence staining of nocodazole-ar-\nrested mitotic cells (24h treat-\nment) with the M30 antibody\n(green) and the DNA stain\nHoechst 33342 (blue). The cell on\nthe right does not show M30 im-\nmunoreactivity and is not apo-\nptotic. Bar, 10 \u0001m. Right, quanti-\ntation of the number of M30\nimmunoreactive cells in the mi-\ntotic and attached cell popula-\ntions, at the indicated time points,\nafter treatment with nocodazole.\nAt least 100 cells were counted in\nrandomly selected fields for each\ntime point, and the data shown\nrepresents the mean \u0005 SEM of\nthree independent experiments.\n(D) Effect of SB203580 (20 \u0001M)\nand SB202190 (10 \u0001M) on no-\ncodazole (3 \u0001M for 24 h)-induced\napoptosis. Control cells were\ntreated with an equivalent vol-ume of dimethyl sulfoxide. After 24 h, the mitotic cells were collected by shake-off and reattached to\npoly-l-lysine–coated coverslips. The cells were fixed and immunostained with the M30 antibody as described in MATERIALS AND\nMETHODS. At least 100 cells were counted in randomly selected fields for each condition and the bars represent the mean \u0005 SEM of three\nindependent experiments.\nK. Deacon et al.\nMolecular Biology of the Cell2078\nFigure 6. DAMKK6 induces apoptosis in HeLa cells by activating p38 MAPK, whereas DAPAK inhibits daMKK6-induced apoptosis. (A)\nHeLa cells were transfected with either the FLAG epitope-tagged p38 isotypes or FLAG-DAMKK6 (S207D, T211D) alone or in combination\nwith each other. Twenty-four hours after transfection, the activation of p38 MAPK isotypes was determined using an immunocomplex kinase\nassay as described in MATERIALS AND METHODS. The cell extracts were also immunoblotted with either an anti-FLAG antibody or an\nanti-\u0003-tubulin antibody. The arrowhead indicates the position of FLAG-MKK6. (B) Exponentially growing HeLa cells were transfected with\nFLAG-DAMKK6. Twenty-four hours after transfection, the cells were fixed and immunostained sequentially with the M30 antibody and an\nanti-FLAG antibody as described in MATERIALS AND METHODS. Indirect immunofluorescence of an MKK6 transfected cell (top left)\nshowing cleaved cytokeratin 18 (top right) and DNA fragmentation (bottom left). The merged image is also shown (bottom right). Bar, 10 \u0001m.\n(C) HeLa cells were transfected with either FLAG-DAMKK6, empty vector alone (control) or left untransfected. Eight hours after transfection\nthe cells were treated with either SB203580 (10–20 \u0001M), SB202190 (10–20 \u0001M), or with an equivalent volume of dimethyl sulfoxide alone.\nTwenty-four hours after transfection, the cells were fixed and immunostained with the M30 antibody as described in MATERIALS AND\nMETHODS. At least 100 transfected cells were counted in randomly selected fields for each condition, and the bars represent the mean\u0005 SEM\nof three independent experiments. (D) Exponentially growing HeLa cells were transfected with either FLAG-DAMKK6, FLAG-kinase dead\n(KD)MKK6, HA-DAPAK, HA-KDPAK, empty vector alone (control), or cotransfected with FLAG-DAMKK6 and HA-DAPAK or FLAG-\nDAMKK6 and HA-KDPAK. Twenty-four hours after transfection cell extracts were prepared and immunoblotted with either with a mixture\nof anti-FLAG and anti-HA antibodies or with an anti-\u0003-tubulin antibody. (E) Exponentially growing HeLa cells were transfected with the\nindicated constructs. Twenty-four hours after transfection, the cells were fixed and immunostained with an anti-FLAG antibody to identify\nthe transfected cells and with the M30 antibody to identify the apoptotic cells as described in MATERIALS AND METHODS. At least 100\nMKK6-transfected cells were counted in randomly selected fields for each condition and the bars represent the mean \u0005 SEM of three\nindependent experiments.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2079\nGFP-Bax were treated with nocodazole (3 \u0001M) for 24 h and\nsubsequently stained with an antibody to cytochrome c to\ndetect the mitochondria (Figure 8, F–I). After 24 h of expo-\nsure to nocodazole between 20 and 30% of the transfected,\nmitotic cells displayed a punctate, perinuclear distribution\nof Bax (Figure 8F), which overlapped with a mitochondrial-\nrich region of the cell (Figure 8G). These cells were under-\ngoing apoptosis as assessed by the presence of fragmented\nchromatin (Figure 8H). In nocodazole-arrested, nonapop-\ntotic cells GFP-Bax was distributed homogeneously\nthroughout the cytoplasm and did not colocalize with the\nmitochondria, which were distributed concentrically around\nthe condensed chromatin (our unpublished data). Control\nnocodazole-arrested mitotic cells expressing GFP alone (Fig-\nFigure 7. DAMKK6 induces p38\nMAPK-dependent redistribution of the\nproapoptotic protein Bax in HeLa cells.\nHeLa cells were transfected with either\nGFP-Bax or FLAG-DAMKK6 alone or\ncotransfected with either GFP-Bax and\nFLAG-DAMKK6, GFP-Bax, and\nFLAG-KDMKK6 or EGFP and FLAG-\nDAMKK6. Sixteen hours (A–C, E, and\nF) or 36 h after transfection (D), the\ncells were fixed and immunostained\nwith an anti-FLAG antibody to detect\nthe MKK6 (red) and the DNA was\nstained with Hoechst 33342 (blue) as\ndescribed in MATERIALS AND\nMETHODS. Indirect immunofluores-\ncence showing the intracellular distri-\nbution at 16 h after transfection of GFP-\nBax (A), FLAG-DAMKK6 (B), GFP-Bax\nin a cell overexpressing DAMKK6 (C),\nGFP-bax distribution in a cell overex-\npressing DAMKK6 at 36 h after trans-\nfection (D), GFP-Bax intracellular local-\nization in the presence of KDMKK6\n(E), and the intracellular distribution of\nGFP in the presence of DAMKK6 (F).\nBar, 10 \u0001m A–C, E and F); 5 \u0001m (D).\n(G) Exponentially growing HeLa cells\nwere transfected with either GFP-Bax\nalone or cotransfected with GFP-Bax\nand FLAG-DAMKK6. Six hours after\ntransfection the cells cotransfected\nwith GFP-Bax and FLAG-DAMKK6\nwere treated with either SB203580 (20\n\u0001M) or SB202190 (10 \u0001M). Twenty-four\nhours after transfection, the cells were\nfixed and immunostained with an anti-\nFLAG antibody to detect the MKK6 as\ndescribed in MATERIALS AND\nMETHODS. At least 100 MKK6-trans-\nfected cells were counted in randomly\nselected fields for each condition and\nthe bars represent the mean \u0005 SEM of\nthree independent experiments.\nK. Deacon et al.\nMolecular Biology of the Cell2080\nure 8, J–M) also did not show a punctate, perinuclear pattern\nof Bax fluorescence despite being clearly apoptotic, based on\nmembrane blebbing (Figure 8J) and DNA fragmentation\n(Figure 8L). These experiments indicated that Bax translo-\ncates from the cytoplasm to the mitochondria in nocodazole-\narrested mitotic cells as they undergo apoptosis.\nConsistent with previous data regarding Bad phosphory-\nlation by PAK (Schurmann et al., 2000), our studies have\nindicated that recombinant PAK\u0002 and native PAK\u0002, immu-\nnoprecipitated from nocodazole-arrested mitotic cells, both\nefficiently phosphorylated recombinant GST-mBad (our un-\npublished data). Because our current data have shown that\nPAK\u0002 is activated in mitotically arrested cells, we evaluated\nwhether Bad is also phosphorylated in this cell population.\nWestern blots of native Bad indicated that the mobility of the\nBad protein was retarded preferentially in the mitotically\narrested cells, suggesting that Bad undergoes posttransla-\ntional modification in this population (Figure 9A). To assess\nthe phosphorylation state of Bad in the mitotically arrested\ncells HeLa cells were transfected with a mammalian expres-\nsion vector encoding GST-Bad and then treated with either\nnocodazole, taxol, vincristine, or vinblastine. The phosphor-\nylation state of Bad in the mitotic and attached cell popula-\ntions was assessed by immunoblotting with phospo-specific\nBad antibodies, which specifically detect Bad phosphoryla-\ntion on serine 112 (S112), serine 136 (S136), or serine 155\n(S155). All four drug treatments induced an increase in the\nlevel of Bad phosphorylation on residues S116, S136, and\nS155 in the mitotically arrested cells in comparison with\neither the asynchronous or attached populations, although\nwe did not detect a mobility shift with GST-Bad (Figure 9B).\nTo determine whether one or more of the serine residues\nwas a specific target for PAK, we coexpressed GST-mBAD\nwith either DAPAK (L107F) or KDPAK (K298A) and then\nassessed the phosphorylation state of GST-mBad by immu-\nnoblotting. DAPAK did not seem to affect the phosphoryla-\ntion state of Bad on either S112 or S136. However, DAPAK\nincreased phosphorylation of Bad at S155 compared with\nbasal Bad phosphorylation at this site or when coexpressed\nwith KDPAK (Figure 9C). Furthermore, this phosphoryla-\ntion was abolished when S155 was replaced with alanine by\nsite-directed mutagenesis, confirming that PAK phosphory-\nlates mBad at this site. However, basal phosphorylation of\nBad (S155A) at S112 and S136 was still observed although its\nlevel was slightly reduced compared with wild-type Bad. To\nsuppress PAK activation we used GST-PAK (amino acids\n83–149 of PAK1) an inhibitor of PAK1, PAK2, and PAK3\n(our unpublished data). Coexpression of GST-PAK (83–149)\nwith GST-Bad reduced phosphorylation of Bad at S112,\nS136, and S155 (Figure 9D) in nocodazole-arrested mitotic\ncells. Expression of GST-PAK (83–149) also sensitized no-\ncodazole-arrested mitotic cells to cell death over the time\ncourse examined compared with cells transfected with vec-\ntor alone (Figure 9E). Together, these results suggest that\nPAK phosphorylation of Bad may be a mechanism by which\nPAK contributes to cell survival in mitotically arrested cells.\nDISCUSSION\nWe have identified the signaling events associated with\nactivation of the spindle checkpoint by drugs that perturb\nmicrotubule dynamics. The results of this study demon-\nstrate that 1) chemotherapeutic drugs cause activation of\nboth p38 MAPK and PAK preferentially in the mitotically\narrested cells; 2) chemotherapeutic drug-induced cell death\nis mediated through p38 MAPK, whereas chemotherapeutic\ndrug-induced cell survival is mediated through PAK; 3) p38\nMAPK activity induces the translocation of the cell death\nactivator Bax, from the cytosol to the mitochondria; and 4)\nPAK phosphorylates Bad, thereby providing a mechanism\nto inhibit its proapoptotic function.\nOur data indicate that the mitotic checkpoint is activated\nin nocodazole-arrested cells as assessed by the presence of\nthe checkpoint protein MAD2 on the condensed chromatin.\nIn these mitotic checkpoint-arrested cells, we demonstrate\nfor the first time the concomitant activation of both p38\nMAPK and PAK. Activation of either p38 MAPK or PAK\nwas not observed in the attached cell population where both\nJNK and the Erk MAP kinases were found to be activated.\nThe function of either JNK or Erk in the attached population\nis currently unknown. However, our studies indicate that\nErk may suppress JNK-mediated cell death in this cell pop-\nulation (our unpublished data). Previous studies that have\nexamined chemotherapeutic drug-activated signaling path-\nways have reported activation of JNK, p38 MAPK and Erk\nMAP kinases either alone or in combination (Wang et al.,\n1998; Shtil et al., 1999; Subbaramaiah et al., 2000; McDaid and\nHorwitz, 2001; Okano and Rustgi, 2001; Seidman et al., 2001;\nStadheim et al., 2001). Discrepancies between the signaling\npathways that are activated by chemotherapeutic agents\nmay relate to the fact that these earlier studies did not\nseparate the mitotic and the nonmitotic cell populations. The\ndata presented in this study suggest that there is a remark-\nable divergence in the signaling pathways activated by an-\ntimicrotubule drugs in these two cell populations.\nThe upstream signaling events that lead to the activation\nof p38 MAPK and PAK during mitotic arrest remain to be\nidentified. Although it has been reported that PAKs can\nactivate p38 MAPK (Bagrodia et al., 1995), our data indicate\nthat p38 MAPK and PAK activation are likely to be inde-\npendent events. First, cotransfection of a DAPAK with p38\u0002\nFigure 7 (cont).\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2081\nFigure 8. Both DAMKK6 and\nnocodazole induce Bax transloca-\ntion to the mitochondria. Expo-\nnentially growing HeLa cells\nwere cotransfected with GFP-Bax\nand FLAG-DAMKK6 (A–E) or\nwith either GFP-Bax (F–I) or\nEGFP (J–M) alone. Sixteen hours\nafter transfection, the cells co-\ntransfected with GFP-Bax and\nFLAG-DAMKK6 were stained\nwith MitoTracker red to detect the mitochondria (red), fixed, and immunostained with anti-FLAG\nantibody to detect the MKK6 (pseudocolored magenta) as described in MATERIALS AND METHODS.\nThe DNA was stained with Hoechst 33342 (blue). Sixteen hours after transfection, the cells transfected\nwith either EGFP or GFP-Bax alone were treated with nocodazole (3 \u0001M) for 12 h and then stained with\nMitoTracker red for 0.5 h at 37°C. The mitotic cells were collected by shake-off and reattached to\npoly-d-lysine–coated glass coverslips, fixed, and the DNA stained with Hoechst 33342 as described in\nMATERIALS AND METHODS. Indirect immunofluorescence showing the intracellular localization of\nGFP-Bax (A), MitoTracker red (B), Hoechst (C), DAMKK6 (D), and a merged image indicating overlap\nof the GFP-Bax and MitoTracker red fluorescence signals (E). Indirect immunofluorescence of nocoda-\nzole-arrested mitotic cells showing the intracellular distribution of GFP-Bax (F), MitoTracker red (G),\nHoechst (H), and a merged image (I) indicating the localization of Bax to a mitochondrial-rich region of\nthe cell. Indirect immunofluorescence of a nocodazole-arrested mitotic cell showing the intracellular\ndistribution of EGFP (J), MitoTracker red (K), Hoechst (L), and a merged image (M). Bar, 10 \u0001m.\nK. Deacon et al.\nMolecular Biology of the Cell2082\nFigure 9.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2083\ndid not activate the p38 MAPK. Second, p38 MAPK was\ninactivated before PAK, after release of cells from a mitotic\nblock, suggesting that PAK does not regulate the activation\nof p38 MAPK in mitotically arrested cells. We are currently\nexamining the upstream components of the p38 MAPK and\nPAK signaling pathways in mitotically arrested cells.\nThe downstream target(s) of p38 MAPK that cause cell\ndeath in the mitotically arrested cells are largely unknown.\nA recent observation (Ghatan et al., 2000) that p38 MAPK\ninduces apoptosis in neuronal cells by regulating the trans-\nlocation of Bax from the cytoplasm to the mitochondria led\nus to examine the effect of p38 MAPK on Bax in the mitot-\nically arrested cells. The translocation of Bax from the cyto-\nplasm to the mitochondria is both necessary and sufficient to\ninduce apoptotic cell death (Hsu et al., 1997; Wolter et al.,\n1997; Nechustan et al., 1999). Bax reduces mitochondrial\nmembrane potential, causes the release of cytochrome c from\nthe mitochondria and activates caspases (Xiang et al., 1996;\nEskes et al., 1998; Jurgensmeier et al., 1998; Desagher et al.,\n1999; Finucane et al., 1999). In this study we demonstrate,\nfirst, that DAMKK6 causes the translocation of Bax to mito-\nchondria, an effect that is reversed by the p38 MAPK inhib-\nitors. Second, we show that Bax also translocates to mito-\nchondria in the mitotically arrested cells and that the p38\nMAPK inhibitors are able to suppress nocodazole-induced\napoptosis. Therefore, our data support the conclusion that\nBax translocation to the mitochondria, and subsequent cell\ndeath, are regulated by p38 MAPK in the mitotically blocked\ncells. The mechanism by which p38 MAPK may affect the\ncellular distribution of Bax is currently under investigation.\nThe activation of PAK\u0002 by chemotherapeutic drugs in a\nmitotically arrested cell population has not been described\npreviously. We have shown in this study that DAPAK\u0002\nsuppresses MKK6-induced apoptosis, suggesting that one\nFigure 9 (cont). PAK phosphorylates\nthe proapoptotic protein Bad. (A) Immu-\nnoblot analysis of native Bad after treat-\nment of HeLa cells with nocodazole\n(Noc, 3 \u0001M), taxol (Tax), vincristine\n(Vinc), or vinblastine (Vinb) (all 1 \u0001M)\nfor 12 h. The cell extracts were also im-\nmunoblotted with an anti-\u0003-tubulin an-\ntibody. The upper and lower arrow-\nheads indicate the positions of the\nslower and faster migrating form of\nBad, respectively. Asynchronous, un-\ntreated cells (Asynch), mitotic (Mit), and\nattached (Att). (B) Immunoblot analysis\nof GST-mBad phosphorylation after\ntreatment of HeLa cells with the indi-\ncated drugs as described in (A). HeLa\ncells were transfected with pEBGmBAD\nand 24 h later treated with the indicated\ndrugs. Cell extracts were immuno-\nblotted with the indicated phospho-spe-\ncific Bad antibodies and an anti-Bad an-\ntibody. (C) HeLa cells were transfected\nwith pEBGmBAD wild-type, pEBGm-\nBAD (S155A), HA-DAPAK (L107F), or\nHA-KDPAK (K298A) alone or in the in-\ndicated combinations. Twenty-four\nhours after transfection cell extracts\nwere prepared and immunoblotted\nwith either anti-HA, anti-Bad antibody,\nphospho-specific Bad antibodies, or an\nanti-\u0004-actin antibody. The arrowheads\nindicate the positions of the Bad and\nPAK proteins. (D) HeLa cells were\ntransfected with pEBGmBAD wild-type\nalone or in combination with pEBG-\nPAK (83–149). Twenty-four hours after\ntransfection, cells were treated with no-\ncodazole (3 \u0001M) for 12 h. Cell extracts of\nthe mitotic and attached populations\nwere immunoblotted with either phos-\npho-specific Bad antibodies or a GST\nantibody. The arrowheads indicate the\npositions of the Bad and PAK proteins.\n(E) HeLa cells were transfected with pEBG-PAK (83–149) or vector alone (pEBG). Twenty-four hours after transfection the cell were treated\nwith nocodazole (3 \u0001M) for 12 h. The mitotic cells were fixed and immunostained with an anti-GST antibody to identify the transfected cells\nand with the M30 antibody to identify the apoptotic cells as described in MATERIALS AND METHODS. At least 100 GST-positive cells were\ncounted in randomly selected fields and the bars represent the mean \u0005 SEM of three independent experiments.\nK. Deacon et al.\nMolecular Biology of the Cell2084\nfunction of native PAK\u0002 may be to suppress cell death in the\nmitotically blocked cells. Indeed, our data have shown that\nexpression of DAPAK\u0002 confers a survival advantage during\nnocodazole-induced mitotic arrest, whereas inhibition of\nPAK activation enhances nocodazole-induced cell death. In\nmammalian cells PAK isoforms have been shown to play\ndistinct roles in apoptosis. Both PAK1 (PAK\u0002) and PAK4\nhave been shown to protect cells from apoptosis induced by\nserum withdrawal, UV irradiation, or tumor necrosis fac-\ntor-\u0002 in fibroblasts, or by growth factor withdrawal in lym-\nphoid cells (Schurmann et al., 2000; Tang et al., 2000; Gne-\nsutta et al., 2001), whereas a Xenopus PAK (X-PAK1) is\nrequired to suppress apoptosis during prophase arrest in\nfrog oocytes (Faure et al., 1997). However, \u0003PAK (PAK2)\nseems to have both an antiapoptotic and a proapoptotic\nfunction (Jakobi et al., 2001). The proapoptotic function of\n\u0003PAK has been attributed to the generation of constitutively\nactive fragment after caspase-mediated cleavage of \u0003PAK\n(Rudel and Bokoch, 1997). Although the activation of both\n\u0003PAK and PAK4 in mitotically arrested cells awaits investi-\ngation the results from the present study are consistent with\nreports demonstrating that PAK\u0002 mediates cell survival in\nresponse to diverse apoptotic stimuli.\nThe target(s) of PAK\u0002 that regulate cell survival in mitot-\nically blocked cells are also unknown. One mechanism\nthrough which PAK may protect lymphoid progenitor cells\nfrom apoptosis, after growth factor withdrawal, is by phos-\nphorylation of the BH3-only proapoptotic protein Bad\n(Schurmann et al., 2000). PAK is reported to phosphorylate\nBad on serine residues 112 and 136, thereby facilitating\nbinding to 14-3-3\u0006 and its sequestration in the cytoplasm.\nHowever, other prosurvival signals are also reported to\nphosphorylated Bad (Downward, 1999). For example, pro-\ntein kinase B phosphorylates Bad on serine residue 136,\nwhereas protein kinase A is reported to phosphorylate Bad\nat serine 112. Both serine residues 112 and 136 occur within\na protein kinase A phosphorylation motif (RRXS) in the BH3\ndomain of Bad that mediates its death-promoting activity\nthrough heterodimerization to the Bcl-XL family members\n(Tan et al., 2000). In this study, we report that Bad is phos-\nphorylated on serine residue 155 in addition to serine resi-\ndues 112 and 136 in the mitotically arrested cells. Serine\nresidue 155 also lies within the BH3 domain of Bad and is\nfound in the sequence motif RRXS (Tan et al., 2000) that is\nused by PAK to phosphorylate both serine residues 112 and\n136. In overexpression experiments, we have shown that\nDAPAK primarily phosphorylates S155 of Bad. Phosphory-\nlation of Bad at S155 is reported to induce cell survival by\npreventing the BH3-dependent dimerization of Bad with\nBcl-XL rather than promoting binding to 14-3-3 (Tan et al.,\n2000). Therefore, one mechanism by which cell death is\ninhibited in the mitotically arrested cells may be through\nphosphorylation of Bad by PAK at S155, thereby suppress-\ning the proapoptotic Bad-Bcl-XL dimerization. We have\nshown that inhibition of PAK in mitotically arrested cells\nsuppresses phosphorylation of Bad not only at S155 but also\nat S112 and S136 implying that native PAK is able to phos-\nphorylate all three sites in vivo.\nIn summary, the present study provides evidence that\nboth cell survival and cell death pathways are activated in\nmitotically arrested cells. A p38 MAPK-activated and Bax-\ndependent pathway contributes to cell death, whereas a\nPAK-activated and Bad-dependent pathway contributes to\ncell survival. The results of our study have implications for\nthe design of future chemotherapeutic drug therapies that\ntarget the mitotic checkpoint. In particular, the identification\nof other survival pathways that are activated in response to\nthe chemotherapeutic agents, and a search for agents that\nsuppress them may considerably increase the effectiveness\nof the current anticancer therapies.\nACKNOWLEDGMENTS\nWe thank Ed Manser, Roger Davis, Jiahuai Han, Gary Bokoch, and\nRichard Youle for generously providing various expression plas-\nmids. Roger Snowden for assistance with flow cytometry and Kul-\nvinder Sikand for assistance with confocal microscopy. This work\nwas supported by grants from the Wellcome Trust and the Biotech-\nnology and Biological Sciences Research Council (to R.P. and J.L.B.).\nREFERENCES\nAoshiba, K., Yasui, S., Hayashi, M., Tamaoki, J., and Nagai, A.\n(1999). Role of p38-mitogen-activated protein kinase in spontaneous\napoptosis of human neutrophils. J. Immunol. 162, 1692–1700.\nBagrodia, S., and Cerione, R.A. (1999). PAK to the future. Trends\nCell Biol. 9, 350–355.\nBagrodia, S., Derijard, B., Davis, R.J., and Cerione, R.A. (1995).\nCdc42 and PAK-mediated signaling leads to Jun kinase and p38\nmitogen-activated protein kinase activation. J. Biol. Chem. 270,\n27995–27998.\nBueno, O.F., et al. (2000). The MEK1-ERK1\/2 signaling pathway\npromotes compensated cardiac hypertrophy in transgenic mice.\nCancer Res. 60, 5887–5894.\nBurke, D. (2000). Complexity in the spindle checkpoint. Curr. Opin.\nGen. Dev. 10, 26–31.\nCommunal, C., Colucci, W.S., and Singh, K. (2000). p38 Mitogen-\nactivated protein kinase pathway protects adult rat ventricular\nmyocytes against \u0004-adrenergic receptor-stimulated apoptosis. Evi-\ndence for Gi-dependent activation. J. Biol. Chem. 275, 19395–19400.\nDerijard, B., Raingeaud, J., Barrett, T., Wu, I.H., Han, J., Ulevitch,\nR.J., and Davis, R.J. (1995). Independent human MAP-kinase signal\ntransduction pathways defined by MEK and MKK isoforms. Science\n270, 7420–7426.\nDesagher, S., Osen-Sand, A., Nichols, A., Eskes, R., Montessuit, S.,\nLauper, S., Maundrell, K., Antonsson, B., and Martinou, J.C. (1999).\nBid-induced conformational change of Bax is responsible for mito-\nchondrail cytochrome c release during apoptosis. J. Cell Biol. 144,\n891–901.\nDeacon, K., and Blank, J.L. (1999). MEK kinase 3 directly activates\nMKK6 and MKK7, specific activators of the p38 and c-Jun NH2-\nterminal kinases. J. Biol. Chem. 274, 16604–16610.\nDeschesnes, R.G., Huot, J., Valerie, K., and Landry, J. (2001). In-\nvolvement of p38 in apoptosis-associated membrane blebbing and\nnuclear condensation. Mol. Biol. Cell 12, 1569–1582.\nDownward, J. (1999). How BAD phosphorylation is good for sur-\nvival. Nat. Cell Biol. 1, E33–E35.\nEskes, R., Antonsson, B., Osen-Sand, A., Montessuit, S., Richter, C.,\nSadoul, R., Mazzei, G., Nichols, A., and Martinou, J.C. (1998). Bax-\ninduced cytochrome c release from mitochondria is independent of\nthe permeability transition pore but highly dependent on Mg2\u0007\nions. J. Cell Biol. 143, 217–224.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2085\nFang, G., Yu, H., and Kirschner, M.W. (1999). Control of mitotic\ntransitions by the anaphase-promoting complex. Phil. Trans. R. Soc.\nLond. B. Biol. Sci. 354, 1583–1590.\nFaure, S., Vigneron, S., Doree, M., and Morin, N. (1997). A member\nof the Ste20\/PAK family of protein kinases is involved in both arrest\nin Xenopus oocytes and G2\/prophase of the first meiotic cell cycle\nand prevention of apoptosis. EMBO J. 16, 5550–5561.\nFinucane, D.M., Bossy-Wetzel, E., Waterhouse, N.J., Cotter, T.G.,\nand Green, D.R. (1999). Bax-induced caspase activation and apopto-\nsis via cytochrome c release from mitochondria is inhibitable by\nBcl-xL. J. Biol. Chem. 274, 2225–2233.\nGeley, S., Kramer, E., Gieffers, C., Gannon, J., Peters, J.M., and Hunt,\nT. (2001). Anaphase-promoting complex\/cyclosome-dependent\nproteolysis of human cyclin A starts at the beginning of mitosis and\nis not subject to the spindle assembly checkpoint. J. Cell Biol. 153,\n137–148.\nGhatan, S., Larner, S., Kinoshita, Y., Hetman, M., Patel, L., Xia, Z.,\nYoule, R.J., and Morrison, R.S. (2000). p38 MAPK mediates Bax\ntranslocation in nitric oxide-induced apoptosis in neurons. J. Cell\nBiol. 150, 335–347.\nGnesutta, N., Qu, J., and Minden, A. (2001). The serine\/threonine\nkinase PAK4 prevents caspase activation and protects cells from\napoptosis. J. Biol. Chem. 276, 14414–14419.\nHagemann, C., and Blank, J.L. (2001). The ups and downs of MEK\nkinase interactions. Cell Signal. 13, 863–875.\nHsu, Y.T., Wolter, K.G., and Youle, R.J. (1997). Cytosol-to-mem-\nbrane redistribution of Bax and Bcl-X(L) during apoptosis. Proc.\nNatl. Acad. Sci. USA 94, 3668–3672.\nJakobi, R., Moertl, E., and Koeppel, M.A. (2001). p21-activated pro-\ntein kinase \u0003-PAK suppresses programmed cell death of BALB3T3\nfibroblasts. J. Biol. Chem. 276, 16624–16634.\nJiang, Y., Gram, H., Zhao, M., New, L., Gu, J., Feng, L., DiPadova, F.,\nUlevitch, R.J., and Han, J. (1997). Characterization of the structure\nand function of the fourth member of p38 group mitogen-activated\nprotein kinases, p38\u0005. J. Biol. Chem. 272, 30122–30128.\nJordan, M.A., Wendell, K., Gardiner, S., Derry, W.B., Copp, H., and\nWilson, L. (1996). Mitotic block induced in HeLa cells by low con-\ncentrations of paclitaxel (Taxol) results in abnormal mitotic exit and\napoptotic cell death. Cancer Res. 56, 816–825.\nJurgensmeier, J.M., Xie, Z., Devereaux, Q., Ellerby, L., Bredesen, D.,\nand Reed, J.C. (1998). Bax directly induces release of cytochrome c\nfrom isolated mitochondria. Proc. Natl. Acad. Sci. USA 95, 4997–\n5002.\nKyriakis, J.M., and Avruch, J. (2001). Mammalian mitogen-activated\nprotein kinase signal transduction pathways activated by stress and\ninflammation. Physiol. Rev. 81, 807–869.\nKummer, J.L., Rao, P.K., and Heidenreich, K.A. (1997). Apoptosis\ninduced by withdrawal of trophic factors is mediated by p38 mito-\ngen-activated protein kinase. J. Biol. Chem. 272, 20490–20494.\nKurokawa, H., Lenferink, A.E., Simpson, J.F., Pisacane, P.I., Sli-\nwkowski, M.X., Forbes, J.T., and Arteaga, C.L. (2000). Inhibition of\nHER2\/Neu (erbB-2) and mitogen-activated protein kinases enhance\ntamoxifen action against HER2-overexpressing, tamoxifen-resistant\nbreast cancer cells. Cancer Res. 60, 5887–5894.\nLeers, M.P.G., et al. (1999). Immunocytochemical detection and\nmapping of a cytokeratin 18 neo-epitope exposed during early\napoptosis. J. Pathol. 187, 567–572.\nLee, J.C., et al. (1994). A protein kinase involved in the regulation of\ninflammatory cytokine biosynthesis. Nature 372, 739–746.\nLi, Y., and Benezra, R. (1996). Identification of a human mitotic\ncheckpoint gene: hsMAD2. Science 274, 246–248.\nMcDaid, H.M., and Horwitz, S.B. (2001). Selective potentiation of\npaclitaxel (taxol)-induced cell death by mitogen-activated protein\nkinase kinase inhibition in human cell lines. Mol. Pharmacol. 60,\n290–301.\nNechustan, A., Smith, C.L., Hsu, Y.T., and Youle, R.J. (1999). Con-\nformation of the Bax C-terminus regulates subcellular location and\ncell death. EMBO J. 273, 16415–16420.\nOkano, J.-I., and Rustgi, A.K. (2001). Paclitaxel induces prolonged\nactivation of the Ras\/MEK\/ERK pathway independently of activat-\ning the programmed cell death machinery. J. Biol. Chem. 276,\n19555–19564.\nPatel, R., Bartosch, B., and Blank, J.L. (1998). p21WAF1 is dynamically\nassociated with JNK in human T-lymphocytes during cell cycle\nprogression. J. Cell Sci. 111, 2247–2255.\nPatel, R., Holt, M., Philipova, R., Moss, S., Schulman, H., Hidaka, H.,\nand Whitaker, M. (1999). Calcium\/calmodulin-dependent phos-\nphorylation and activation of human cdc25-C at the G2\/M phase\ntransition in HeLa cells. J. Biol. Chem. 274, 7958–7968.\nPotapova, O., Haghighi, A., Bost, F., Liu, C., Birrer, M.J., Gjerset, R.,\nand Mercola, D. (1997). The Jun kinase\/stress-activated protein\nkinase pathway functions to regulate DNA repair and inhibition of\nthe pathway sensitizes tumor cells to cisplatin. J. Biol. Chem. 272,\n14041–14044.\nRemacle-Bonnet, M.M., Garrouste, F.L., Heller, S., Andre, F., Mar-\nvaldi, J.L., and Pommier, G.J. (2000). Insulin-like growth factor-1\nprotects colon cancer cells from death factor-induced apoptosis by\npotentiating tumor necrosis factor \u0002-induced mitogen-activated\nprotein kinase and nuclear factor \u0007B signaling pathways. Cancer\nRes. 60, 2007–2017.\nRowinsky, E.K., and Donehower, R.C. (1991). The clinical pharma-\ncology and use of antimicrotubule agents in cancer chemotherapy.\nPharmacol. Ther. 52, 35–84.\nRudel, T., and Bokoch, G.M. (1997). Membrane and morphological\nchanges in apoptotic cells regulated by caspase-mediated activation\nof PAK2. Science 276, 1571–1574.\nSchurmann, A., Mooney, A.F., Sanders, L.C., Sells, M.A., Wang,\nH.G., Reed, J.C., and Bokoch, G.M. (2000). P21-activated kinase 1\nphosphorylares the death agonist Bad and protects cells from apo-\nptosis. Mol. Cell. Biol. 20, 453–461.\nSeidman, R., Gitelman, I., Sagi, O., Horwitz, S.B., and Wolfson, M.\n(2001). The role of erk1\/2 and p38 MAP-kinase pathways in taxol-\ninduced apoptosis in human ovarian carcinoma cells. Exp. Cell Res.\n268, 84–92.\nShah, J.V., and Cleveland, D.W. (2000). Waiting for anaphase: Mad2\nand the spindle assembly checkpoint. Cell 103, 997–1000.\nShtil, A.A., Mandlekar, S., Yu, R., Walter, R.J., Hagen, K., Tan, T.H.,\nRoninson, I.B., and Kong, A.N. (1999). Differential regulation of\nmitogen-activated protein kinases by microtubule-binding agents in\nhuman breast cancer cells. Oncogene 18, 377–384.\nSorger, P.K., Dobles, M., Tournebize, R., and Hyman, A.A. (1997).\nCoupling cell division and cell death to microtubule dynamics.\nCurr. Opin. Cell Biol. 9, 807–814.\nStadheim, T.A., Xiao, H., and Eastman, A. (2001). Inhibition of\nextracellular signal-regulated kinase (ERK) mediates cell cycle\nphase independent apoptosis in vinblastine-treated ML-1 cells. Can-\ncer Res. 61, 1533–1540.\nSubbaramaiah, K., Hart, J.C., Norton, L., and Dannenberg, A.J.\n(2000). Microtubule-interfering agents stimulate the transcription of\ncyclo-oxygenase-2. Evidence for involvement of ERK1\/2 and p38\nmitogen-activated protein kinase pathways. J. Biol. Chem. 275,\n14838–14845.\nK. Deacon et al.\nMolecular Biology of the Cell2086\nTang, Y., Zhou, S., Chen, A., Pittman, R.N., and Field, J. (2000). The\nAkt proto-oncogene links Ras to Pak and cell survival signals.\nJ. Biol. Chem. 275, 9106–9109.\nTan, Y., Demeter, M.R., Ruan, H., and Comb, M.J. (2000). BAD\nSer-155 phosphorylation regulates BAD\/Bcl-XL interaction and cell\nsurvival. J. Biol. Chem. 275, 25865–25869.\nVerheij, M., et al. (1996). Requirement for ceramide-initiated SAPK\/\nJNK signaling in stress-induced apoptosis. Nature 380, 75–79.\nWang, T.H., Wang, H.S., Ichijo, H., Giannakakou, P., Foster, J.S.,\nFojo, T., and Wimalasena, J. (1998). Microtubule-interfering agents\nactivate c-Jun N-terminal kinase\/stress-activated protein kinase\nthrough both ras and apoptosis signal-regulating kinase pathways.\nJ. Biol. Chem. 273, 4928–4936.\nWang, T.H., Wang, H.S., and Soong, Y.K. (2000). Paclitaxel-induced\ncell death: where the cell cycle and apoptosis come together. Cancer\n88, 2619–2628.\nWilson, L., and Jordan, M.A. (1995). Microtubule dynamics: taking\naim at a moving target. Chem. Biol. 2, 569–573.\nWolter, K.G., Hsu, Y-T., Smith, C.L., Nechustan, A., Xi, X.G., and\nYoule, R.J. (1997). Movement of bax from the cytosol to mitochon-\ndria during apoptosis. J. Cell Biol. 139, 1281–1292.\nWoods, C.M., Zhu, J., McQuenet, P.A., Bollag, D., and Lazarides, E.\n(1995). Taxol-induced mitotic block triggers rapid onset of a p53-\nindependent apoptotic pathway. Mol. Med. 1, 506–526.\nXia, Z., Dickens, M., Raingeaud, J., Davis, R.J., and Greenberg, M.E.\n(1995). Opposing effects of ERK and JNK-p38 MAPKs on apoptosis.\nScience 270, 1326–1331.\nXiang, J.G., Chao, D.T., and Korsmeyer, S.J. (1996). BAX-induced cell\ndeath may not require interleukin IL\u0004-converting enzyme-like pro-\nteases. Proc. Natl. Acad. Sci. USA 93, 14559–14563.\nYujiri, T., Fanger, G.R., Garrington, T.P., Schlesinger, T.K., Gib-\nson, S., and Johnson, G.L. (1999). MEK kinase 1 (MEKK1) trans-\nduces c-Jun NH2-terminal kinase activation in response to\nchanges in the microtubule cytoskeleton. J. Biol. Chem. 272,\n12605–12610.\np38 MAPK, PAK, and Mitotic Arrest\nVol. 14, May 2003 2087\n"}