{"doi":"10.1088\/1475-7516","coreId":"70591","oai":"oai:eprints.lancs.ac.uk:11387","identifiers":["oai:eprints.lancs.ac.uk:11387","10.1088\/1475-7516"],"title":"Type II See-Saw at Collider, Lepton Asymmetry and Singlet Scalar Dark Matter.","authors":["McDonald, John","Sahu, Narendra","Sarkar, Utpal"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04","abstract":"We propose an extension of the standard model with a B–L global symmetry that is broken softly at the TeV scale. The neutrinos acquire masses through a type-II seesaw while the lepton (L) asymmetry arises in the singlet sector but without B–L-number violation. The model has the virtue that the scale of L-number violation (Λ) giving rise to neutrino masses is independent of the scale of leptogenesis (Λ'). As a result the model can explain neutrino masses, singlet scalar dark matter and leptogenesis at the TeV scale. The stability of the dark matter is ensured by a surviving Z2 symmetry, which could be lifted at the Planck scale, thereby allowing Planck scale suppressed decay of singlet scalar dark matter particles of mass 3 MeV to e+e- pairs in the Galactic halo. The model also predicts a few hundred GeV doubly charged scalar and a long-lived charged fermion, whose decay can be studied at the Large Hadron Collider (LHC) and International Linear Collider (ILC)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70591.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11387\/1\/0711.4820v2.pdf","pdfHashValue":"8c3c390cc34bf0b2ab683afaf42bb328bd46af01","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11387<\/identifier><datestamp>\n      2018-01-24T00:04:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Type II See-Saw at Collider, Lepton Asymmetry and Singlet Scalar Dark Matter.<\/dc:title><dc:creator>\n        McDonald, John<\/dc:creator><dc:creator>\n        Sahu, Narendra<\/dc:creator><dc:creator>\n        Sarkar, Utpal<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We propose an extension of the standard model with a B–L global symmetry that is broken softly at the TeV scale. The neutrinos acquire masses through a type-II seesaw while the lepton (L) asymmetry arises in the singlet sector but without B–L-number violation. The model has the virtue that the scale of L-number violation (Λ) giving rise to neutrino masses is independent of the scale of leptogenesis (Λ'). As a result the model can explain neutrino masses, singlet scalar dark matter and leptogenesis at the TeV scale. The stability of the dark matter is ensured by a surviving Z2 symmetry, which could be lifted at the Planck scale, thereby allowing Planck scale suppressed decay of singlet scalar dark matter particles of mass 3 MeV to e+e- pairs in the Galactic halo. The model also predicts a few hundred GeV doubly charged scalar and a long-lived charged fermion, whose decay can be studied at the Large Hadron Collider (LHC) and International Linear Collider (ILC).<\/dc:description><dc:date>\n        2008-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/1475-7516\/2008\/04\/037<\/dc:relation><dc:identifier>\n        McDonald, John and Sahu, Narendra and Sarkar, Utpal (2008) Type II See-Saw at Collider, Lepton Asymmetry and Singlet Scalar Dark Matter. Journal of Cosmology and Astroparticle Physics, 2008 (4). p. 37. ISSN 1475-7516<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11387\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1088\/1475-7516\/2008\/04\/037","http:\/\/eprints.lancs.ac.uk\/11387\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"ar\nX\niv\n:0\n71\n1.\n48\n20\nv2\n  [\nhe\np-\nph\n]  \n7 M\nar \n20\n08\nType-II Seesaw at Collider, Lepton Asymmetry and Singlet Scalar Dark Matter\nJohn McDonald∗ and Narendra Sahu†\nCosmology and Astroparticle Physics Group, University of Lancaster, Lancaster LA1 4YB, UK\nUtpal Sarkar‡\nTheory Division, Physical Research Laboratory, Navarangpura, Ahmedabad, 380 009, India\nWe propose an extension of the standard model with a B-L global symmetry that is broken softly at the TeV\nscale. The neutrinos acquire masses through a type-II seesaw while the lepton (L) asymmetry arises in the\nsinglet sector but without B-L violation. The model has the virtue that the scale of L-number violation (Λ)\ngiving rise to neutrino masses is independent of the scale of leptogenesis (Λ′). As a result the model can explain\nneutrino masses, singlet scalar dark matter and leptogenesis at the TeV scale. The stability of the dark matter\nis ensured by a surviving Z2 symmetry, which could be lifted at the Planck scale and thereby allowing Planck\nscale-suppressed decay of singlet scalar dark matter particles of mass ≈ 3 MeV to e+e− pairs in the Galactic\nhalo. The model also predicts a few hundred GeV doubly charged scalar and a long lived charged fermion,\nwhose decay can be studied at Large Hadron Collider (LHC) and International Linear Collider (ILC).\nPACS numbers: 12.60.Fr, 14.60.St, 95.35.+d, 98.80.Cq\nI. INTRODUCTION\nWithin the standard model (SM), neutrinos are massless.\nOn the other hand, the current low energy neutrino oscillation\ndata [1, 2, 3] indicate that at least two of the physical left-\nhanded (LH) neutrinos have tiny masses and therefore mix\namong themselves. However, as yet we do not know if the\nneutrinos are Dirac or Majorana. If the neutrinos are assumed\nto be Majorana then the sub-eV neutrino masses can be gen-\nerated through the dimension five operator [4]\nOν =\nφφℓℓ\nΛ , (1)\nwhere Λ is the scale of lepton (L) number violation (∆L =\n2). The dimension five operator (1) can originate through the\ncelebrated see-saw mechanism.\nIn type-I seesaw models, three right-handed (RH) neutrinos\n(N’s) are added without extending the gauge group of the SM.\nThe canonical seesaw (or type-I seesaw) [5] then gives the\nlight neutrino mass matrix:\nmν = m\nI\nν =−mDM−1N mTD , (2)\nwhere mD is the Dirac mass matrix of the neutrinos connect-\ning the LH neutrinos (νL) with the RH neutrinos and MN is\nthe Majorana mass matrix of the RH heavy neutrinos, which\nalso sets the scale of L-number violation (Λ). The Dirac mass\nterms determine the L-numbers of the RH neutrinos to be\n+1 and hence the Majorana mass of the RH neutrinos vio-\nlates L-number by two units. The decays of the RH neutrinos\nwould then violate L-number and their CP violating out-of-\nequilibrium decay to SM fields can be a natural source of L-\nasymmetry [6] in the early Universe. The CP-violation, which\n∗Electronic address: j.mcdonald@lancaster.ac.uk\n†Electronic address: n.sahu@lancaster.ac.uk\n‡Electronic address: utpal@prl.res.in\ncomes from the Yukawa couplings that determine the Dirac\nmass mass of neutrinos via the one-loop radiative vertex cor-\nrection, requires at least two RH neutrinos. The masses of the\nRH neutrinos producing the final L-asymmetry then satisfy [7]\n1\n.\nMN ≥ O(109)GeV . (3)\nIf the corresponding theory of matter is supersymmetric\n(SUSY) then this bound, being dangerously close to the maxi-\nmum reheat temperature, poses a problem. A modest solution\nwas proposed in ref. [9] by introducing an extra singlet heavy\nfermion. However, the model only achieves a reduction of\nabove bound [7] by an order of magnitude.\nIn the type-II seesaw models, on the other hand, SU(2)L\ntriplet Higgses (∆’s) are added to the SM gauge group. Ex-\nplicit breaking of the L-number by trilinear couplings of the\ntriplet Higgs scalar then induces a tiny vacuum expectation\nvalue (VEV) of the heavy triplet Higgs scalars [10], generat-\ning a light neutrino mass matrix:\nmν = m\nII\nν = f µ\nv2\nM2∆\n, (4)\nwhere M∆ is the mass of the triplet Higgs scalar ∆, µ is the\ncoupling constant with mass dimension 1 for the trilinear term\nwith the triplet Higgs and two standard model Higgs doublets,\nand f is the Yukawa coupling of the triplet Higgs to the light\nleptons. M∆ and µ are of the same order of magnitude and set\nthe scale (Λ) of L-number violation. v is the VEV of the SM\nHiggs doublet. In these models, the L-asymmetry is generated\nthrough the L-number violating decays of the ∆ to SM leptons\nand Higgs [11]. The CP-violation, originating from the one-\nloop self-energy correction, requires at least two triplets. The\nscale of L-number violation is determined by M∆ and µ and is\n1 This could be next-to-lightest RH neutrino if flavor leptogenesis is consid-\nered [8].\n2required to be very high. In most cases the scale of L-violation\nin type-II seesaw models is larger than the type-I seesaw mod-\nels [12].\nFrom the above discussion we see that the L-number vi-\nolating scales MN ∼ Λ in type-I see-saw models or M∆ ∼ Λ\nin type-II seesaw models comes out to be large because the\nsame L-number violation gives rise to both neutrino masses\nand mixings and to the L-asymmetry. While sub-eV neu-\ntrino masses require large values of Λ, the large values of MN\nand M∆ can easily satisfy the out-of-equilibrium decay condi-\ntion, a necessary condition for the generation an L-asymmetry,\nwithout any fine-tuning of the Yukawa couplings. From this\nperspective, these models are attractive. However, they can-\nnot be verified in future colliders since the scale of L-number\nviolation is very high. Alternatives to these models are pro-\nvided by mechanisms which work at the TeV scale, either in\nSUSY extensions of the SM [13] or by introducing an addi-\ntional source of CP violation into the model [14].\nOn the other hand, one could ask if the origin of neutrino\nmasses and leptogenesis is different? It is well-known that\nthere is no one-to-one correspondence between the parame-\nters in the neutrino mass matrix and those involved in lepto-\ngenesis [15]. In particular, in type-I see-saw model with 3 RH\nneutrinos, while 15 parameters enter into leptogenesis, there\nare only 9 parameters: 3 masses, 3 mixing angles and 3 phases\n(one L-number conserving phase called the Dirac phase and\ntwo L-number violating phases called Majorana phases) in\nthe low energy neutrino mass matrix. Obviously there is no\nconnection. Conservatively, if one considers type-I seesaw\nmodel with 2 RH neutrinos for leptogenesis as well as for low\nenergy sub-eV neutrino masses, then the number of parame-\nters in both cases are 9. However, one can show that there is\nno one-to-one correspondence between the Majorana phases\nresponsible for L-number violation in leptogenesis and Ma-\njorana phases in neutrino mass matrix [16]. The connection\nbetween leptogenesis and low energy neutrino mass matrix is\neven worse in case of type-II see-saw models.\nMotivated by the fact that there is no one-to-one correspon-\ndence between leptogenesis and the effective low energy neu-\ntrino mass matrix, we propose a new mechanism of leptogen-\nesis which occurs completely in the singlet sector at the TeV\nscale [17]. As we will show, the origin of neutrino masses is\ndifferent from the origin of L-asymmetry. The L-asymmetry\nthen arises without any B-L violation. We will show that the\nB-L violation required for neutrino masses does not conflict\nwith the leptogenesis. This model is then extended to incor-\nporate a singlet scalar dark matter particle. While the nature\nof dark matter is still a mystery, we will show that the sin-\nglet dark scalar can either be collisionless cold dark matter\n(CCDM) or self-interacting dark matter (SIDM). The stabil-\nity of the dark matter is ensured by a surviving Z2 symmetry\nwhich could be lifted at the Planck scale and thereby allow\nPlanck scale-suppressed decay of the singlet dark scalars to\ne+e− pairs in the Galactic halo. The most important feature\nof the model is that it predicts a few hundred GeV doubly\ncharged scalar and a long lived singly charged fermion whose\ndecay can be studied at the LHC\/ILC.\nThe paper is organized as follows. In section II we intro-\nduce a model which simultaneously explains neutrino masses,\nsinglet scalar dark matter and singlet leptogenesis. In section\nIII, the type-II seesaw model of neutrino masses and the via-\nbility of testing it at colliders are discussed. In section IV we\ngive a brief description of singlet leptogenesis, which arises\nfrom a conserved B-L symmetry. Section V is devoted to sin-\nglet scalar dark matter and its Planck scale suppressed decay\nto e+e− pair in the Galactic halo. In section VI we give a brief\ndescription of collider signatures and section VII concludes.\nII. THE MODEL: SM×U(1)B−L\nWe extend the SM gauge symmetry with a global U(1)B−L\nsymmetry, which is softly broken at the TeV scale. In addition\nto the quarks, leptons (ℓ) and the usual Higgs doublet φ of\nthe SM, we introduce two triplet scalars ξ and ∆ and a singlet\ncomplex scalar χ. We also introduce two neutral singlet heavy\nscalars Sa,a = 1,2 and a charged fermion η−. The particle\ncontent of the model and their respective quantum numbers is\ngiven in table (I).\nTABLE I: Fermions and scalars included in the model.\nParticle Content SU(3)C×SU(2)L×U(1)Y U(1)B−L\nℓ (1,2,-1) -1\ne−R (1,1,-2) -1\nφ (1,2,1) 0\nξ (1,3,2) 2\n∆ (1,3,2) 0\nχ (1,1,0) 0\nη−L ,η\n−\nR (1,1,-2) -1\nSa (1,1,0) 0\nIt is then straightforward to write down the Lagrangian in-\nvariant under the SM and the globalU(1)B−L. We present here\nonly those terms in the Lagrangian that are directly relevant to\nthe rest of our discussions. Those are given by\n−L ⊇ fi jξℓiLℓ jL + µ∆†φφ+ M2ξξ†ξ+ M2∆∆†∆\n+hiae¯iRSaη−L + M2SabS\n†\naSb + yi jφ ¯ℓiLe jR\n+gi1 ¯ℓiLφη−R + Mηη−L η−R + µφaSaφ†φ\n+µχaSaχ†χ +V(φ,χ,S,∆)+ h.c. , (5)\nwhere V (φ,χ,S,∆) constitutes all possible quadratic and quar-\ntic terms invariant under the SM and the global U(1)B−L,\nV (φ,χ,S,∆) = m21φ†φ+ m22χ†χ + λ1(φ†φ)2 + λ2(χ†χ)2\n+λ3(φ†φ)(χ†χ) + λa(S†aSa)(φ†φ)+ λb(S†bSb)(χ†χ)\n+λ4(∆†∆)(φ†φ) + λ5(∆†∆)(χ†χ) . (6)\n3As the Universe expands, ∆ acquires a very small VEV,\n〈∆〉=−µ v\n2\nM2∆\n. (7)\nFor µ ∼M∆ ∼ 1012 GeV and v = 〈φ〉= 174 GeV one can get\nthe VEV of ∆ to be a few eV. The singlet scalars S1 and S2\nacquire VEV much below the mass scale of ∆. They develop\nVEV at a temperature T ∼ 10 TeV. The VEVs of S1 and S2\nare:\n〈Sa〉=−µφa v\n2\nM2Sa\n, a = 1,2 . (8)\nFor µφa ∼ MSa ∼ 10 TeV, the VEV of Sa are in the order of\n1 GeV. The singlet scalar χ does not acquire a VEV. With\na Z2 symmetry under which χ is odd while all other fields\nare even, χ becomes a candidate for dark matter [18, 19, 20].\nAs we will see below, the L-asymmetry arises from the L-\nnumber conserving decay of Sa to e−R and η+L while the neu-\ntrino masses arise from the L-violating interactions produced\nvia a soft breaking interaction of ξ and ∆.\nIII. SOFT BREAKING OF B-L SYMMETRY AND\nNEUTRINO MASSES\nThe VEV of ∆ does not break B-L gauge symmetry since\nit is inert under the U(1)B−L symmetry. This also ensures\nthat B-L is an exact symmetry until it is broken softly at the\nTeV scale. Note that ξ does not acquire any VEV at the tree\nlevel and hence there are no neutrino masses unless the B-L\nsymmetry is broken. We assume that Mξ ≪M∆ and that ξ and\n∆ contribute equally to the effective neutrino masses.\nTo generate neutrino masses we need to break the global\nU(1)B−L symmetry without destroying the renormalizability\nof the theory while ensuring that there is no massless Nambu-\nGoldstone boson that can cause conflict with phenomenology.\nThis can be achieved by adding a soft term in the Lagrangian\n(5)\n−L∆ξ = m2s ∆†ξ+ h.c. , (9)\nwhere the mass parameter ms is of the order of a few hundred\nGeV. We assume that such a soft term could originate from\ntheories with larger symmetries. However, we will not con-\nsider its origin in this paper. The mixing between ξ and ∆ is\nthen parameterized by\ntan2θ = 2m\n2\ns\nM2∆−M2ξ\n(10)\nSince we have assumed that M∆ ≫ Mξ, the mixing angle is\nsimply\nθ≃ m\n2\ns\nM2∆\n. (11)\nAs a result the mass eigenstates are:\nξ′ = ξ−\n(\nm2s\nM2∆\n)\n∆≃ ξ and ∆′ = ∆ +\n(\nm2s\nM2∆\n)\nξ≃ ∆ . (12)\nx\nl\nl\nξ ∆\nφ\nφ<   >\n<   >\nFIG. 1: Modified type-II seesaw for neutrino masses arising from\nsoft L-number violation.\nSince the soft term (9) introduces L-number violation by two\nunits, the neutrino can acquire a mass. The effective L-number\nviolating Lagrangian is 2:\n−Lν−mass = fi jξℓiLℓ jL +µ m\n2\ns\nM2∆\nξ†φφ+ fi j m\n2\ns\nM2∆\n∆ℓiLℓ jL +µ∆†φφ+h.c. .\n(13)\nAfter electroweak symmetry breaking, the field ξ acquires\nan induced VEV,\n〈ξ〉=−µ v\n2m2s\nM2ξM2∆\n. (14)\nThis can be verified by minimization of the complete poten-\ntial. The VEVs of ξ and ∆ will contribute equally to neutrino\nmasses and thus the neutrino mass matrix, derived from fig.\n(1), is given by\n(mν)i j =− fi jµ\nv2m2s\nM2ξM2∆\n. (15)\nIf we consider the mass scales µ∼M∆ ∼ 1012 GeV, ms ∼ 100\nGeV and Mξ ∼ v, a natural choice of the Majorana Yukawa\ncoupling f gives the scale of neutrino masses to be mν ∼ O (1)\neV, as required by laboratory, atmospheric and solar neutrino\nexperiments. As discussed previously, one of the triplet Higgs\nscalar ξ could remain very light without any conflict with neu-\ntrino masses or any other phenomenology. Since the mass of ξ\ncould be in the range of a few hundred GeV, its decay through\nsame sign dilepton can be tested at the LHC or ILC. Thus\nthe proposed type-II seesaw is testable in contrast to the con-\nventional type-II seesaw. We will come back to this point in\nsection VI while discussing collider signatures.\nIV. LEPTON ASYMMETRY FROM CONSERVED B-L\nWe note that the interaction Saη−L e+R conserves B-L-\nnumber. Therefore, out-of-equilibrium decay of Sa cannot\n2 We thank Hiroaki Sugiyama for pointing out a typographical mistake in\nequation (13).\n4generate any B-L asymmetry. However, if there is CP-\nviolation in the decay of Sa then it can produce an equal and\nopposite B-L asymmetry between e+R (e\n−\nR ) and η−L (η+L ). If\nthese two B-L asymmetries never equilibrate with each other\nbefore the electroweak phase transition then the B-L asym-\nmetry in e−R can be transferred to the left-handed fields in SM,\nwhile keeping an equal and opposite B-L asymmetry in η+L .\nThe Yukawa couplings of the charged leptons with the SM\nHiggs field will transfer any asymmetry in e−R into an asym-\nmetry in e−L , which will then take part in sphaleron processes\nbefore the electroweak phase transition. Thus the B-L asym-\nmetry in e−R will generate the required baryon asymmetry via\nsphaleron transitions, while the equal and opposite amount\nof B-L asymmetry in η+L will remain unaffected even after\nthe electroweak phase transition. Eventually this field will\ndecay slowly after the electroweak phase transition, which\ncan generate a small L-asymmetry, but the baryon asymme-\ntry of the universe will not be affected at this time since the\nsphaleron processes are out of thermal equilibrium. Therefore\nthe baryon asymmetry will survive.\nAs the Universe expands, the temperature of the thermal\nbath falls. Below their mass scales the CP violating decay of\nthe heavy singlet scalars Sa,a = 1,2 generate an equal and op-\nposite B-L-asymmetry between e−R (e\n+\nR ) and η+L (η−L ) through\nSa → e−iR + η+L\n→ e+iR + η−L .\nThe decay rate can be given as\nΓa =\n(h†h)aa\n16pi MSa , (16)\nwhere the masses of η−L and e−R are small in comparison to the\nmass of Sa. A net CP asymmetry is generated through the in-\nterference of tree-level diagram and the one-loop self-energy\ncorrection diagram involving φ and χ as shown in figure (2).\nThe CP-asymmetry in the decay of Sa can be estimated as\nSa S a S b\nφ,χ\nφ, χ    \n R Ree\nη\nη+\n+\nL\nL\nFIG. 2: The tree level diagram and the self energy correction diagram\nof Sa which give a net CP violation.\nεa =\nIm\n[\n(µφ1µ∗φ2 + µχ1µ∗χ2)∑i hi1h∗i2\n]\n8pi2(M2S1 −M2S2)\n[\nMSa\nΓa\n]\n. (17)\nThe lightest of Sa will generate an equal amount of eR and η\nasymmetries. If the masses of S1 and S2 are close enough then\nthe CP asymmetry can be resonantly enhanced, [21, 22] such\nthat the mass scale of Sa can be a few TeV.\ne R\nc\ne R\ne L\nc\ne L\nφ0\nFIG. 3: The L-number conserving process which transfer the B-L\nasymmetry from right handed sector to the left-handed sector.\nThe L-asymmetry in eR can be transferred to eL through the\nt-channel process eRecR ↔ φ0 ↔ eLecL as shown in the figure\n(3). These interactions will be in equilibrium for all the three\ngenerations of charged leptons below 105 GeV and hence\nthere will be equal amount of eR and eL asymmetry. This B-L\nasymmetry in eL will be converted to the baryon asymmetry\nof the universe before the electroweak phase transition when\nthe sphaleron processes are in thermal equilibrium. An equal\nand opposite amount of B-L asymmetry in ηL will remain un-\naffected by these interactions.\nNote that the generated B-L asymmetry in the left-handed\nsector is not washed out by the L-violating interactions me-\ndiated by ξ and ∆ because those processes are suppressed.\nIn particular ℓℓ↔ φφ is suppressed by m2s\/M2∆. For ms ∼ 1\n100 GeV and M∆ ∼ 1012 GeV the suppression of ∆L = 2 pro-\ncesses are of the order 10−20. However, this asymmetry can be\nwashed out through the decay: η+R → ¯ℓ+ φ, unless the decay\nrate\nΓη =\n|gi1|2\n16pi Mη , (18)\nsatisfies Γ−1η ≡ τη > τEW , where τEW ∼ 10−12s is the time\nof electroweak phase transition. Furthermore, η+ should be\ndecayed away well before Big-Bang Nucleosynthesis (BBN)\nin order not to conflict with the prediction of BBN. Therefore\nτη < τBB ∼ 1s . (19)\nFrom Eqns. (18) and (19), and using τ≈H−1 ≈ (T 2\/MPl)−1,\nwe get\nT 2BB\/MPl <∼\n|gi1|2\n16pi Mη\n<∼ T 2EW\/MPl , (20)\nwhere TEW and TBB respectively are the temperatures corre-\nsponding to the electroweak phase transition and BBN. We\nshow the allowed masses and Yukawa couplings of η as a plot\nof ln |g| versus Mη. From figure (4) it can be seen that g can\nvary from 10−7 to 10−12 for Mη taking its values between 200\nGeV to 1 TeV.\nV. SINGLET SCALAR DARK MATTER\nAs the universe expands the temperature of the thermal bath\nfalls. As a result the heavy fields Sa and ∆ acquires VEV\n5200 400 600 800 1000\nHMΗ\u0090GeVL\n-4\n-2\n0\n2\n4\n6\nln\nH\nÈ\ng\nÈ\nL\nGΗ\n*=105 GeV\nGΗ\n*=103 GeV\nGΗ\n*=100 GeV\nGΗ\n*=10 GeV\nGΗ\n*=100 MeV\nGΗ\n*=10 MeV\nFIG. 4: Allowed contours of Γ∗η ≡ 1019Γη, required for generating a\nsuccessful L-asymmetry, are shown in the plane of ln |g| versus Mη.\nbelow their mass scales. Consequently the effective potential\nbefore the electroweak phase transition is given by\nVe f f = m2φφ†φ+ λ1(φ†φ)2 + m2χχ†χ\n+ λ2(χ†χ)2 + λ3(φ†φ)(χ†χ) (21)\nwhere\nm2φ =\n(\nm21 + λa〈Sa〉2 + λ4〈∆〉2\n)\nand m2χ =\n(\nm22 + λb〈Sb〉2 + λ5〈∆〉2\n)\n. (22)\nThe above effective potential is bounded from below if and\nonly if λ1,λ2 > 0 and λ3 >−2\n√\nλ1λ2. For m2φ < 0 and m2χ > 0,\nthe minimum of the potential is given by\n〈φ〉=\n(\n0\nv\n)\nand 〈χ〉= 0 . (23)\nThe VEV of φ gives masses to the SM fermions and gauge\nbosons. The physical mass of the SM Higgs is then given by\nmh =\n√\n4λ1v2. Since χ is odd under the surviving Z2 symme-\ntry it cannot decay to any of the conventional SM fields and\nhence the χ can constitute the dark matter component of the\nUniverse.\nA. Cold Dark Matter\nGauge singlet scalars interacting via the renormalisable\nχ†χφ†φ coupling to the Higgs doublet can account for cold\ndark matter (CDM) [18, 19, 20]3. For λ3 >∼ 0.01, the gauge sin-\nglet scalar CDM density is produced via conventional freeze-\nout from thermal equilibrium. For 10GeV <∼ mχ tot <∼ 1TeV and\n0.01 <∼ λ3 <∼ 1, the scalar density is naturally of the order of the\nobserved CDM density over a wide region of the (λ3,mχ tot)\nparameter space [18]. (mχ tot denotes the physical χ mass,\nincluding the contribution from the Higgs expectation value,\nm2χ tot = m\n2\nχ + λ3 < φ†φ >.) Such scalars have annihilation\nand nuclear scattering cross-sections which make them a po-\ntentially detectable CDM candidate in cryogenic detectors and\nneutrino telescopes, on a par with more conventional WIMP\ncandidates [18]. They may also be produced at the LHC via\nHiggs decay [18, 20].\nFor small λ3 there is an alternative possibility for gauge sin-\nglet scalar dark matter [19]. If λ3 ≪ 1, gauge singlet scalars in\nthermal equilibrium are unable to annihilate efficiently, result-\ning in too much CDM after freeze-out [23]. In order to evade\nthis problem, λ3 must be sufficiently small that the gauge sin-\nglets never come into thermal equilibrium. Although there is\nno freeze-out thermal relic density in this case, it is still pos-\nsible to produce a CDM density via decay of thermal equilib-\nrium Standard Model particles to χ pairs, in particular Higgs\ndecay [19]. In this case the density of CDM is given by [19]\nΩχ = 0.3\n( λ3\n2×10−10\n)2(115GeV\nmh\n)3(0.7\nh\n)2( mχ tot\n4.8MeV\n)2\n,\n(24)\nwhere mh is the physical Higgs boson mass and h parameter-\nizes the Hubble constant. Thus λ3 ≈ 10−10 is necessary to\naccount for CDM. A particularly interesting possibility is that\nχ gains its mass mostly from the Higgs expectation value. In\ngeneral m2χ tot = m2χ + λ3v2\/2 (v = 174 GeV). Therefore for\nmχ = 0, the χ mass is a function only of λ3. In this case the\ndark matter density is entirely determined by mχ tot and mh\n[19],\nΩχ = 0.3\n(\n115GeV\nmh\n)3(0.7\nh\n)2( mχ tot\n2.8MeV\n)5\n. (25)\nThus mχ tot ≈ 3 MeV is predicted for the scalar mass in this\ncase. (Note that this is a rather precise estimate, due to the\nhigh power of mχ tot in Eq.(25).) As discussed below, this is a\nphysically significant mass scale. Light gauge singlet scalars\nwith masses in the 1-10 MeV range [19, 24] can account for\nself-interacting dark matter (SIDM) [25], whilst the decay of\n1-6 MeV scalars to e+ e− pairs can account for the 511 keV γ\nline from the galactic center [26, 27, 28] observed by INTE-\nGRAL [29].\nB. Self-Interacting Dark Matter\nSIDM has been suggested as a way to explain the ab-\nsence of peaked galaxy halo profiles and the small number\n3 The notation used in [18, 19] is such that S↔ χ, λS ↔ λ3, m↔ mχ, mS ↔\nmχ tot and η↔ 4λ2.\n6of sub-halos in galaxies as compared with CDM simulations\n[25]. This requires that the self-interaction cross-section of\nthe dark matter, σ, satisfies rχ ≡ σ\/mχ = (0.45−5.6)cm2g−1\n[25]. Recently, comparison of the theoretical dynamics of\nthe merging galaxy cluster 1E 0657-56 (the ’Bullet cluster’)\nwith observation has placed a new upper bound on this range,\nrχ <∼ 1cm2g−1 [30]. Nevertheless, a window still remains\nwhere SIDM scalars could have a significant effect on galaxy\nhalos.\nFor a gauge singlet self-interaction λ2|χ|4, the total scatter-\ning cross-section is [19]\nσ = σχχ†→χχ† + σχχ→χχ =\n3λ22\n8pim2χ\n. (26)\nThis self-interaction can modify galaxy halos if the mass is in\nthe range mS = α\n1\/3\nλ2 (38.8−90.1) MeV (with αλ2 = λ\n2\n2\/4pi),\nwhere the lower bound is the value at which galaxy halos\nwould evaporate due to interaction with hot particles in cluster\nhalos, while the upper bound is the value at which the scalars\ndo not interact within a typical galactic halo during a Hubble\ntime and so have no effect [19, 25]. (The new constraint from\nthe Bullet cluster raises the lower bound to 68.7α1\/3λ2 MeV.) If\nwe consider the magnitude of the χ self-coupling to be simi-\nlar to the SM Higgs self-coupling, such that λ2 ≈ 0.025, then\nthis mass range is mχ ∼ 1−4 MeV. In this case there is a good\npossibility that light scalar dark matter will have an observable\neffect on galaxy halos.\nC. Decaying χ Dark Matter and the INTEGRAL 511 keV flux\nIn order to explain the 511 keV γ-ray flux observed by\nINTEGRAL, we need a large number density of dark mat-\nter particles at the center of the galaxy plus low energy\npositrons from their decay in order that the positrons can slow\nto non-relativistic velocities before annihilating with back-\nground electrons. These conditions require that the decaying\nparticles are in the range 1-6 MeV, corresponding to positron\ninjection energies <∼ 3 MeV [28], in good agreement with\nmχ ≈ 3 MeV. For an interaction of the form χmeee\/M∗, the\nγ flux relative to the experimentally observed flux is [27]\nΦ\nΦexp\n≈ 25\n(\n1019GeV\nM∗\n)2( Ωχ\n0.23\n)\n, (27)\nwhere the dominant decay mode is assumed to be χ → e+e−\nwith decay rate\nΓχ→e+e− =\nm2emχ\n8piM2∗\n. (28)\nThus with a Planck-suppressed decay rate, light gauge singlet\nscalars of mass mχ ≈ 3 MeV can account for the observed 511\nkeV flux.\nThe above decay: χ→ e+e− can be realized if we allow Z2\nto be violated at the Planck scale. We have then the allowed\nPlanck scale suppressed Lagrangian\nL = y\nχφ ¯ℓeR\nMPl\n+ f χξℓℓ\nMPl\n+ f\nχ(m2s\/M2ξ)∆ℓℓ\nMPl\n+g\nχ ¯ℓφη−R\nMPl\n+ h χSη\n−\nL e\n+\nR\nMPl\n+ ˆhχη−L e+R + h.c. . (29)\nSince mχ ≪Mη, the decay modes: χ→ η−L e+R and χ→ ¯ℓφη−R ,\nSη−L e+R are forbidden. Thus the relevant effective Z2 violating\nLagrangian is given as:\nL =\nme\nMPl\nχe¯LeR + f ′χℓℓ+ f ′(m2s\/M2ξ)χℓℓ+ h.c. , (30)\nwhere f ′ ≡ f ′(〈∆〉\/MPl)≤ 10−26. Therefore, the contribution\nof the second and third terms are negligible to the observed\nγ-ray flux while the first term is in the right ballpark.\nVI. SIGNATURES OF ξ±± AND η±\nThe doubly charged component of the light triplet Higgs\nξ can be observed through its decay into same sign dilep-\ntons [31]. Since M∆ ≫ Mξ, the production of ∆ particles in\ncomparison to ξ is highly suppressed. Hence it is worth look-\ning for the signature of ξ±± either at LHC or ILC. From Eq.\n(13) one can see that the decay ξ±±→ φ±φ± are suppressed\nsince the decay rate involves the factor m\n2\ns\nM2∆\n∼ 10−20. While\nthe decay mode ξ±± → h±W± is phase space suppressed,\nthe decay mode ξ±± → W±W± is suppressed because the\nVEV of ξ is small as required for sub-eV neutrino masses and\nto maintain the ρ parameter of SM to be unity. Therefore,\nonce produced, ξ mostly decays through same sign dileptons:\nξ±± → ℓ±ℓ±. Note that the doubly charged particles cannot\ncouple to quarks. Therefore the SM background of the pro-\ncess ξ±± → ℓ±ℓ± is quite clean and so the detection will be\nunmistakable. From Eq. (13) the decay rate of the process\nξ±±→ ℓ±ℓ± is given by\nΓii =\n| fii|2\n8pi Mξ++ and Γi j =\n| fi j|2\n4pi\nMξ++ , (31)\nwhere the fi j are highly constrained by lepton flavor violating\ndecays. Therefore if a doubly charged scalar can be detected\nin the future, the neutrino mass patterns can be probed at a\ncollider [32] 4.\nSince the mass of η− is a few hundred GeV, the decay\nη−→ he− can be observed in future colliders (LHC\/ILC). On\nthe other hand, η− can also be produced in high energy neu-\ntrino collisions with matter through νLe−R → νLη−R . Since it\nis long-lived, it can travel large distances and be detected in\nneutrino telescopes [34] 5.\n4 There has been recent interest in detecting neutrino mass parameters at\ncolliders [33]. These references appeared on arXiv after our paper.\n5 We thank John F. Beacom for bringing this to our notice.\n7VII. CONCLUSIONS\nWe have introduced a new leptogenesis mechanism in a\nU(1)B−L extension of the SM which allowed us to explain si-\nmultaneously neutrino masses, dark matter and leptogenesis.\nThe important message is that the L-asymmetry arises without\nany B-L violation. Since the L-number violation required for\nleptogenesis and neutrino masses are different, the leptogene-\nsis scale can be lowered to as low as a few TeV.\nNeutrino masses arise through a modified type-II seesaw\nwhich predicts a few hundred GeV triplet scalar. Note that\nin conventional type-II seesaw models the mass scale of the\ntriplets is required to be at least O(1010) GeV to produce sub-\neV neutrino masses. Since one of the triplets in our model,\nnamely ξ, has a mass of a few hundred GeV, the proposed\nmodel can be tested in the near future at colliders through\nsame sign dilepton decay of ξ.\nThe model also predicts a singly charged fermion η− of\nmass ranging from 200 GeV to 1 TeV. η− can be produced in\nhigh energy neutrino collision with matter. Since it is long-\nlived, it can travel large distances and be observed in neutrino\ntelescopes.\nWe proposed a singlet scalar, χ, with mass ≈ 3 MeV as\na candidate for dark matter, whose stability is ensured by a\nZ2 symmetry. This Z2 discrete symmetry can be broken at\nthe Planck scale. We then showed that a possible origin of\n511 KeV Galactic line detected by INTEGRAL could be the\nPlanck scale-suppressed decay of χ to e−e+ pairs in the Galac-\ntic halo.\nAcknowledgement\nJM and NS were supported by the European Union through\nthe Marie Curie Research and Training Network \"Uni-\nverseNet\" (MRTN-CT-2006-035863) and by STFC (PPARC)\nGrant PP\/D000394\/1.\n[1] Q.R. Ahmed et al (SNO Collaboration), Phys. Rev. Lett.\n89, 011301-011302 (2002); J.N. Bahcall and C. Pena-Garay,\n[arXiv:hep-ph\/0404061].\n[2] S. Fukuda et al (Super-Kamiokande Collaboration), Phys. Rev.\nLett. 86, 5656 (2001).\n[3] K. Eguchi et al (KamLAND collaboration), Phys. Rev. Lett. 90,\n021802 (2003).\n[4] S. Weinberg, Phys. Rev. Lett. 43, 1566 (1979).\n[5] P. Minkowski, Phys. Lett. B 67, 421 (1977); M. Gell-Mann,\nP. Ramond and R. Slansky in Supergravity (P. van Niewen-\nhuizen and D. Freedman, eds), (Amsterdam), North Holland,\n1979; T. Yanagida in Workshop on Unified Theory and Baryon\nnumber in the Universe (O. Sawada and A. Sugamoto, eds),\n(Japan), KEK 1979; R.N. Mohapatra and G. Senjanovic, Phys.\nRev. Lett. 44, 912 (1980) .\n[6] M. Fukugita and T. Yanagida, Phys. Lett. B174, 45 (1986) .\n[7] S. Davidson and A. Ibarra, Phy . Lett. B535, 25 (2002);\nW. Buchmuller, P. Di Bari and M. Plumacher, Nucl. Phys.\nB643, 367 (2002) .\n[8] See for example G. Engelhard, Y. Grossman, E. Nardi and\nY. Nir, Phys. Rev. Lett. 99 (2007) 081802 .\n[9] E. Ma, N. Sahu and U. Sarkar, J. Phys. G 34, 741\n(2007) [arXiv:hep-ph\/0611257]; J. Phys. G 32, L65 (2006)\n[arXiv:hep-ph\/0603043].\n[10] J. Schechter and J.W.F. Valle, Phys. Rev. D 22, 2227 (1980);\nM. Magg and C. Wetterich, Phys. Lett. B 94, 61 (1980);\nR. N. Mohapatra and G. Senjanovic, Phys. Rev. D23, 165\n(1981); G. Lazarides, Q. Shafi and C. Wetterich, Nucl.\nPhys. B181, 287 (1981) .\n[11] E. Ma and U. Sarkar, Phys. Rev. Lett. 80 (1998) 5716-5719 .\n[12] S. Antusch and S. F. King, Phys. Lett. B 597, 199 (2004);\nT. Hambye and G. Senjanovic, Phys. Lett. B582, 73 (2004);\nN. Sahu and U. Sarkar, Phys. Rev. D 74, 093002 (2006);\nN. Sahu and S. Uma Sankar, Nucl. Phys. B 724, 329 (2005);\nPhys. Rev. D 71, 013006 (2005); Pei-hong Gu and Xiao-jun Bi,\nPhys. Rev. D70, 2004 (063511) .\n[13] L. Boubekeur, T. Hambye and G. Senjanovic, Phys. Rev.\nLett. 93, 111601 (2004); [arXiv:hep-ph\/0404038]; T. Ham-\nbye, J.M. Russel, S.M. West, JHEP 0407, 070 (2004),\n[arXiv:hep-ph\/0403183]; E.J. Chun, [arXiv: hep-ph\/0508050];\n[14] A partial list: N. Sahu and U.A. Yajnik, Phys. Rev. D71,\n2005 (023507), [arXiv:hep-ph\/0410075]; Phys. Lett. B 635\n(2006) 11, [arXiv:hep-ph\/0509285]; A. Sarkar and U. A. Ya-\njnik, Phys. Rev. D 76, 025001 (2007) [arXiv:hep-ph\/0703142];\nS. F. King and T. Yanagida, Prog. Theor. Phys. 114,\n1035 (2006) [arXiv:hep-ph\/0411030]; A. Abada, H. Ais-\nsaoui and M. Losada, Nucl. Phys. B 728, 55 (2005)\n[arXiv:hep-ph\/0409343].\n[15] A. S. Joshipura, E. A. Paschos and W. Rodejohann, JHEP\n0108 (2001) 029; S. Pascoli, S. T. Petcov and W. Rodejohann,\nPhys. Rev. D 68, 093007 (2003); J. R. Ellis and M. Raidal,\nNucl. Phys. B 643 (2002) 229; G. C. Branco, T. Morozumi,\nB. M. Nobre and M. N. Rebelo, Nucl. Phys. B 617 (2001) 475\n[arXiv:hep-ph\/0107164].\n[16] K. Bhattacharya, N. Sahu, U. Sarkar and S.K. Singh, Phy. Rev.\nD 74, 093001 (2006); T. Endoh, S. Kaneko, S. K. Kang, T. Mo-\nrozumi and M. Tanimoto, Phys. Rev. Lett. 89 (2002) 231601;\nP. H. Frampton, S. L. Glashow and T. Yanagida, Phys. Lett. B\n548 (2002) 119 .\n[17] M. Frigerio, T. Hambye and E. Ma, JCAP 0609, 009 (2006);\nN. Sahu and U. Sarkar, Phys. Rev. D 76, 045014 (2007)\n[arXiv:hep-ph\/0701062].\n[18] J. McDonald, Phys. Rev. D 50, 3637 (1994)\n[arXiv:hep-ph\/0702143].\n[19] J. McDonald, Phys. Rev. Lett. 88, 091304 (2002)\n[arXiv:hep-ph\/0106249].\n[20] V. Silveira and A. Zee, Phys. Lett. B 161, 136 (1985);\nC. P. Burgess, M. Pospelov and T. ter Veldhuis, Nucl. Phys.\nB 619, 709 (2001) [arXiv:hep-ph\/0011335]; V. Barger, P. Lan-\ngacker and G. Shaughnessy, Phys. Rev. D 75, 055013 (2007)\n[arXiv:hep-ph\/0611239]; H. Sung Cheon, S. K. Kang and\nC. S. Kim, arXiv:0710.2416 [hep-ph].\n[21] M. Flanz, E.A. Paschos and U. Sarkar, Phys. Lett. B 345, 248\n(1995); A. Pilaftsis and T. E. J. Underwood, Nucl. Phys. B 692,\n303 (2004) .\n[22] G. D’Ambrosio, T. Hambye, A. Hektor, M. Raidal and\n8A. Rossi, Phys. Lett. B 604, 199 (2004); E. J. Chun\nand S. Scopel, Phys. Lett. B 636, 278 (2006);\n[arXiv:hep-ph\/0609259] .\n[23] M. C. Bento, O. Bertolami and R. Rosenfeld, Phys. Lett. B 518,\n276 (2001) [arXiv:hep-ph\/0103340].\n[24] M. C. Bento, O. Bertolami, R. Rosenfeld and L. Teodoro, Phys.\nRev. D 62, 041302 (2000) [arXiv:astro-ph\/0003350].\n[25] D. N. Spergel and P. J. Steinhardt, Phys. Rev. Lett. 84, 3760\n(2000) [arXiv:astro-ph\/9909386].\n[26] C. Boehm, D. Hooper, J. Silk, M. Casse and J. Paul, Phys. Rev.\nLett. 92, 101301 (2004) [arXiv:astro-ph\/0309686].\n[27] C. Picciotto and M. Pospelov, Phys. Lett. B 605, 15 (2005)\n[arXiv:hep-ph\/0402178].\n[28] J. F. Beacom and H. Yuksel, Phys. Rev. Lett. 97, 071102\n(2006) [arXiv:astro-ph\/0512411]; J. F. Beacom, N. F. Bell\nand G. Bertone, Phys. Rev. Lett. 94, 171301 (2005)\n[arXiv:astro-ph\/0409403].\n[29] P. Jean et al., Astron. Astrophys. 407, L55 (2003)\n[arXiv:astro-ph\/0309484]; J. Knodlseder et al., Astron. Astro-\nphys. 411, L457 (2003) [arXiv:astro-ph\/0309442].\n[30] S. W. Randall, M. Markevitch, D. Clowe, A. H. Gonzalez and\nM. Bradac, arXiv:0704.0261 [astro-ph]; M. Markevitch et al.,\nAstrophys. J. 606, 819 (2004) [arXiv:astro-ph\/0309303].\n[31] G. Barenboim, K. Huitu, J. Maalampi and M. Raidal, Phys.\nLett. B 394, 132 (1997); K. Huitu, J. Maalampi, A. Pietila and\nM. Raidal, Nucl. Phys. B 487, 27 (1997); T. Han, H. E. Logan,\nB. Mukhopadhyaya and R. Srikanth, Phys. Rev. D 72, 053007\n(2005); E. Ma, M. Raidal and U. Sarkar, Nucl. Phys. B 615, 313\n(2001); C. Yue and S. Zhao, [arXiv: hep-ph\/0701017].\n[32] A. G. Akeroyd and M. Aoki, Phys. Rev. D 72, 035011 (2005);\nE. J. Chun, K. Y. Lee and S. C. Park, Phys. Lett. B 566, 142\n(2003).\n[33] A. G. Akeroyd, M. Aoki and H. Sugiyama, arXiv:0712.4019\n[hep-ph]; M. Kadastik, M. Raidal and L. Rebane,\narXiv:0712.3912 [hep-ph]; J. Garayoa and T. Schwetz,\narXiv:0712.1453 [hep-ph].\n[34] S. Ando, J. F. Beacom, S. Profumo and D. Rainwater,\narXiv:0711.2908 [hep-ph] and the references therein.\n"}