{"doi":"10.1103\/PhysRevC.60.051301","coreId":"100828","oai":"oai:epubs.surrey.ac.uk:226","identifiers":["oai:epubs.surrey.ac.uk:226","10.1103\/PhysRevC.60.051301"],"title":"Mean-field and blocking effects on odd-even mass differences and rotational motion of nuclei","authors":["Xu, F. R.","Wyss, R.","Walker, P. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-09-27","abstract":"<p>The odd-even differences of nuclear masses are strongly influenced by mean-field and odd-nucleon blocking effects. When such effects are taken into account, the determination of the pairing interaction strength needs to be modified, resulting in larger pairing gaps. This method leads to an improved description for both moments of inertia and backbending frequencies of rotational bands, with no additional parameters.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:226<\/identifier><datestamp>\n      2017-10-31T13:57:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/226\/<\/dc:relation><dc:title>\n        Mean-field and blocking effects on odd-even mass differences and rotational motion of nuclei<\/dc:title><dc:creator>\n        Xu, F. R.<\/dc:creator><dc:creator>\n        Wyss, R.<\/dc:creator><dc:creator>\n        Walker, P. M.<\/dc:creator><dc:description>\n        <p>The odd-even differences of nuclear masses are strongly influenced by mean-field and odd-nucleon blocking effects. When such effects are taken into account, the determination of the pairing interaction strength needs to be modified, resulting in larger pairing gaps. This method leads to an improved description for both moments of inertia and backbending frequencies of rotational bands, with no additional parameters.<\/p><\/dc:description><dc:date>\n        1999-09-27<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/226\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Xu, F. R., Wyss, R. and Walker, P. M.  (1999) Mean-field and blocking effects on odd-even mass differences and rotational motion of nuclei   Physical Review C, 60 (051301).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.60.051301<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/226\/","10.1103\/PhysRevC.60.051301"],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"RAPID COMMUNICATIONS\nPHYSICAL REVIEW C, VOLUME 60, 051301Mean-field and blocking effects on odd-even mass differences and rotational motion of nuclei\nF. R. Xu,1,* R. Wyss,2 and P. M. Walker1\n1Department of Physics, University of Surrey, Guildford, Surrey GU2 5XH, England\n2Department of Physics, Royal Institute of Technology, Frescativa¨gen 24, S-104 05 Stockholm, Sweden\n~Received 24 May 1999; published 27 September 1999!\nThe odd-even differences of nuclear masses are strongly influenced by mean-field and odd-nucleon blocking\neffects. When such effects are taken into account, the determination of the pairing interaction strength needs to\nbe modified, resulting in larger pairing gaps. This method leads to an improved description for both moments\nof inertia and backbending frequencies of rotational bands, with no additional parameters.\n@S0556-2813~99!50111-8#\nPACS number~s!: 21.60.Cs, 21.10.Dr, 27.70.1qSince the Bardeen-Cooper-Schrieffer ~BCS! theory was\napplied to atomic nuclei @1,2#, pairing correlations have been\ncrucial to the understanding of many properties, such as\nbinding energies, collective rotational motion, and quasipar-\nticle excitation energies. The interaction strength, G, of the\npairing force is the key parameter that governs the properties\nof the short-range correlations.\nThe G value is usually determined by fitting the BCS\npairing gaps (D5G( iUiVi @2#! of even-even nuclei to ex-\nperimental odd-even mass differences. However, if one then\ncalculates the corresponding theoretical mass differences\n~i.e., in the same manner as calculating the experimental\nvalue, but with theoretical masses!, it turns out that they are\nsystematically smaller than the experimental mass differ-\nences and also smaller than the BCS pairing gaps, at least for\nthe deformed rare-earth nuclei described below. The experi-\nmental mass difference should, in principle, be identical to\nthe corresponding theoretical value, but not to the pairing\ngap, though the gap plays the dominant role in determining\nthe mass difference.\nThe above systematic discrepancies suggest that other sig-\nnificant effects exist. It has been pointed out, in a recent\nwork by Satuła, Dobaczewski, and Nazarewicz @3#, that one\nof the important effects stems from the deformed mean field.\nDue to the twofold Kramers degeneracy of single-particle\nlevels, odd- and even-nucleon systems in the deformed field\nhave different energies, which contribute to odd-even mass\ndifferences. For light- and medium-mass nuclei, the Kramers\neffect can be comparable with the pairing contribution @3#.\nFurthermore, when neighboring nuclei have different defor-\nmations, the shape-changing effect also plays a role. These\ntwo factors originate from the deformed mean field and,\ntherefore, we will refer to them in the following as the mean-\nfield effect.\nMoreover, the pairing gaps of even-even nuclei cannot\ninclude the odd-nucleon blocking effects of adjacent odd nu-\nclei, while experimental odd-even mass differences of course\ncontain such blocking effects @2,4#. This can become signifi-\ncant when the density of single-particle levels around the\n*Permanent address: Department of Technical Physics, Peking\nUniversity, Beijing 100871, China.0556-2813\/99\/60~5!\/051301~5!\/$15.00 60 0513Fermi surface is not very high. Simple BCS calculations\ntypically show that the odd-nucleon blockings can reduce\npairing gaps by more than 10% for the rare-earth nuclei.\nHence, it should be expected that the mean-field and block-\ning effects influence the determination of pairing strengths.\nTwo very sensitive probes of pairing correlations and,\ntherefore, of the pairing strengths, are moments of inertia\n~see, e.g., @2,5,6#! and backbending ~bandcrossing! frequen-\ncies @7,8#. High-seniority states may serve as another probe.\nThe recent calculations of the energies of multiquasiparticle\nstates show the need for the adjustment of pairing strengths\n@9#. Hence, the question arises as to whether the pairing\nstrength determined from odd-even mass differences is con-\nsistent with the pairing strength used to calculate moments of\ninertia or the energies of high-seniority states. This is an\nimportant issue for the quantitative description of nuclear\nproperties. In this paper, we show that when the mean-field\nand blocking effects are taken into account, the pairing\nstrengths need to be modified in order to reproduce the odd-\neven mass differences. Such modifications result in an im-\nproved description for both moments of inertia and band-\ncrossing frequencies.\nAccording to the Strutinsky energy theorem @10#, the total\nenergy of a nucleus can be decomposed into a macroscopic\nand a microscopic part. The latter consists of shell and pair-\ning correction energies. For the macroscopic energy, we em-\nploy the standard liquid-drop model of Ref. @11#. The micro-\nscopic energy is calculated within the deformed Woods-\nSaxon ~WS! model @12,13#. The pairing correlations are\ntreated by a technique of approximate particle-number pro-\njection, known as the Lipkin-Nogami ~LN! method @14#,\nwhich takes particle-number-fluctuation effects into account\nby introducing an additional Lagrange multiplier, l2. Both\nmonopole and quadrupole pairings are included.\nThe odd-even mass difference, Doe, can be expressed by a\nthree-point ~see, e.g., @3#!, a four-point @2#, or a five-point\n@15# formula with respect to nuclear masses. Considering\nthat nuclear masses contain nonlinear terms in nucleon num-\nber, such as the symmetry and Coulomb energies @11#, which\ncannot be well canceled out in the three-point formula @3#,\nwe use the five-point formula to minimize the influences of\nthe quantities that are not relevant for the present discussion.\nFor an even-even nucleus @15#,©1999 The American Physical Society01-1\nRAPID COMMUNICATIONS\nF. R. XU, R. WYSS, AND P. M. WALKER PHYSICAL REVIEW C 60 051301Doe52\n1\n8 @M ~N12 !24M ~N11 !16M ~N !24M ~N21 !\n1M ~N22 !# , ~1!\nwhere M (N) is the mass of an atom with neutron number, N\n~or Z for protons!. The quantity, Doe, is calculated along an\nisotopic ~or isotonic! chain. Using the above formula, the\nsmooth nonlinear terms can be canceled, up to the fourth\norder @15,16# when neglecting the shape-changing effect.\nThe nuclear shape is determined by minimizing the cal-\nculated potential energy surface ~PES! in the quadrupole de-\nformation (b2 ,g) space with hexadecapole (b4) variation.\nFor well-deformed nuclei, pairing energies only weakly in-\nfluence the values of deformations @9,10#. In the determina-\ntion of equilibrium deformations, we use the monopole pair-\ning strength obtained by the average gap method @16#. The\nquadrupole pairing strength is determined by restoring the\nlocal Galilean invariance with respect to quadrupole shape\noscillations @17,18#. Whereas quadrupole pairing is impor-\ntant for the proper description of the moments of inertia\n@19,20#, its influence on nuclear binding energies is negli-\ngible, since we use the doubly stretched quadrupole opera-\ntors @17,18#.\nFor the total energy of a nucleus, the shell-correction term\nis sensitive to the level distribution around the Fermi surface,\nwhich is strongly related to the particle number and defor-\nmation of the nucleus @10#. It is via the shell energies that the\nKramers degeneracy affects odd-even mass differences @3#.\nOn the other hand, macroscopic surface and Coulomb ener-\ngies are deformation dependent @11#, which can also contrib-\nute to the Doe values if considering shape changes with par-\nticle number. These effects originate from the deformed\nmean field. The mean-field effect can be calculated using Eq.\n~1! with only the shell and macroscopic energies included for\nthe quantity M of the equation. The results show that the\nmean-field effects are usually of the order of 100 to 200 keV\nfor even-even rare-earth nuclei. If one neglects the changes\nof nuclear deformation, the Kramers effect for a deformed\neven system (N52n) can be written as 12 (en112en) for the\nthree-point formula @3# or 14 (en112en) for the five-point for-\nmula ~where ei is the single-particle energy!. However, the\nKramers effect obtained from the above simple forms differs\nfrom the corresponding value calculated according to Eq. ~1!\nwhen shape changes are included. This implies that the po-\nlarization effects of the odd nucleons have to be considered\nexplicitly, as is done in the present work.\nIn the LN model ~for the case of monopole pairing! the\nquantity, D1l2, is assumed to be identical @16# with odd-\neven mass difference, provided that other physical influences\n~e.g. the mean-field and blocking effects! are ignored. In or-\nder to extract the blocking effect, we define an odd-even\npairing-energy difference, Dp\noe\n. The Dp\noe value is calculated\nusing Eq. ~1! but with only the pairing energies included for\nthe quantity M in Eq. ~1!. In the pairing calculations of odd\nnuclei, the odd-nucleon blockings are taken into account @9#.\nThe blocking effect can be extracted by\ndblock5Dp\noe2~D1l2!. ~2!05130If the blocking effect were neglected, we should have Dp\noe\n’D1l2. Since both the Dp\noe and D1l2 values increase\n~decrease! with increasing ~decreasing! pairing strength, the\ndblock value is not very sensitive to the change in the G value.\nWe calculate the blocking effect with the G value obtained\nby the average gap method @16#. The results show that the\nvalues of the blocking effect, dblock , are usually about 2200\nto 2400 keV for deformed rare-earth nuclei. It can be seen\nthat there is partial cancellation between the mean-field and\nthe blocking effects, but nonzero effects remain systemati-\ncally.\nWe are interested in the well-deformed rare-earth nuclei\nwhere an abundance of regular collective rotational bands\nwith backbendings have been observed. The combined effect\n(d5dMF1dblock) from the mean field (dMF) and blocking\n(dblock) is shown in Fig. 1. The d values range mostly from\n2100 to 2300 keV, or about 10 to 30 % of the correspond-\ning odd-even mass differences, clearly suggesting that one\ncannot neglect this component.\nIn general, the mean-field and blocking effects change\nsmoothly with particle number, and one would like to sepa-\nrate their contributions. However, the situation can become\nrather complex in some cases. When N598–102, for ex-\nample, the calculated PES’s show that the nuclei are soft in\nFIG. 1. Obtained mean-field and blocking effects (d5dMF\n1dblock) as a function of nucleon number. The upper panel is for\nneutrons (n) and the lower panel is for protons (p). Note that the\nd values are negative.1-2\nRAPID COMMUNICATIONS\nMEAN-FIELD AND BLOCKING EFFECTS ON ODD-EVEN . . . PHYSICAL REVIEW C 60 051301the b2 deformation, particularly for 1722176W. The b2 soft-\nness results in relatively large uncertainties in the determina-\ntion of the b2 values and hence significantly influences the\ndMF values. The same holds for the dblock values, leading to\nfluctuating results. Hence, separate consideration of the dMF\nand dblock values can be misleading. In contrast, the com-\nbined value of the mean-field and the blocking effects is less\nshape dependent, since the total energy of a soft nucleus is\nnot so sensitive to the deformation value in an area around\nthe minimum of its PES.\nWith inclusion of the above mean-field and blocking ef-\nfects, d , the theoretical odd-even mass difference, D th\noe\n, can\nbe written as\nD th\noe5D1l21d . ~3!\nIn the practical calculations, the contribution from quadru-\npole pairing is also included, though this term is not written\nexplicitly in the above equation. However, as mentioned, the\ncontribution of the doubly stretched quadrupole pairing en-\nergies is very small ~usually less than 30 keV in magnitude!.\nOn the right-hand side of Eq. ~3! the pairing gap, D , is the\ndominant term. Obviously, due to the presence of the d term,\nthe D th\noe is, in general, not equivalent to the quantity, D\n1l2, of the even-even nucleus. The D value is very sensi-\ntive to the G value, while the l2 and d values are not.\nThe presence of the negative d values implies that the\npairing strength, G, needs to be increased when one aims at\nself-consistent calculations of odd-even mass differences. By\nadjusting the pairing strength, one can reproduce the experi-\nmental Doe value with Eq. ~3!. However, in that case we\nfound that each nucleus requires a separate determination of\nits G value. Apparently, the average gap method @16# does\nnot give proper particle-number and deformation dependence\nfor the pairing gaps of the studied nuclei. On the other hand,\nother quantities contributing to the odd-even mass difference\nmay be lacking in our model. One such effect is the coupling\nto phonons, which will influence the ground-state binding\nenergy, depending on the softness of the nuclear shape. Also,\ndisplacements of the single-particle spectrum of the Woods-\nSaxon potential will affect the calculated Doe values. To dis-\nentangle the different contributions, especially to optimize a\nmethod to determine the average pairing strength, is outside\nthe scope of the present work.\nWe scale the pairing strength by G5FG0, where G0 is\nthe strength obtained by the average gap method @16#. For\nreasons of simplicity, we use a constant F factor for the local\nmass region of the studied nuclei. The constant F value is\ndetermined by averaging the individual F values that have\nbeen obtained by reproducing the corresponding Dexpt\noe values\nof the nuclei. We expect that using the average F value will\nreduce the fluctuations arising from the uncertainties of ex-\nperimental masses and from possible discrepancies between\ntheoretical and experimental single-particle levels. For the\nregion of the studied nuclei, we obtain F˜ n51.08 ~neutrons!\nand F˜ p51.05 ~protons! using the experimental masses of\n@21#. This results in increases of the LN pairing gaps by\nabout 25% for neutrons and 15% for protons.05130To investigate the consistency of our method, we calcu-\nlate the moments of inertia of yrast rotational bands by\nmeans of the pairing-deformation self-consistent cranked\nshell model @22,23#. In this model, pairing and deformation\nchange with rotational frequency in a self-consistent way,\ni.e., for a given frequency, pairing is self-consistently treated\nby solving the cranked LN equation, and deformation is de-\ntermined by minimizing the calculated total Routhian surface\n~TRS! @22#. The total collective angular momentum is calcu-\nlated as follows:\nIx5 (\na ,b.0\n^bu jˆxua&rab1 (\na ,b.0\n^b˜ u jˆxua˜ &ra˜ b˜ , ~4!\nwhere r is the density matrix of the cranked LN model in the\nrepresentation of signature basis denoted explicitly by a ,\nb (a˜ , b˜ are for opposite signatures! @22#. The moment of\ninertia is then obtained by J (1)5Ix \/v; here v is the rota-\ntional frequency.\nAs mentioned earlier, the moment of inertia is a very\nsensitive probe of pairing correlations. It is not at all obvious\nthat a pairing interaction which reproduces the odd-even\nmass difference can, at the same time, also reproduce the\nmoment of inertia. In Fig. 2, we compare the experimentally\ndeduced moments of inertia with our results calculated with\nthe ‘‘standard’’ strength G0 and the adjusted G5F˜ G0.\nClearly, the adjusted G values lead to an improved descrip-\ntion for both moments of inertia and backbending frequen-\ncies. ~No additional parameters are involved or adjusted.!\nIn this context, one needs to recall the long-standing prob-\nlem of cranking calculations in the case of monopole pairing,\ni.e., one cannot at the same time describe both moments of\ninertia and bandcrossing frequencies ~see, e.g., @7,8#!. In or-\nder to reproduce moments of inertia, one in general needs to\nuse a reduced pairing strength @6,8#. On the other hand, an\nenhanced strength is required to reproduce bandcrossing fre-\nquencies @7#. The presence of the time-odd component of the\nquadrupole pairing field induces an additional contribution to\nthe moment of inertia @19,20#, which allows an increase in\nthe G value. Apparently, the doubly stretched quadrupole\npairing interaction, in combination with the cranked LN\nmethod, enables a consistent discription for both moments of\ninertia and bandcrossing frequencies. However, other effects,\nsuch as the coupling with vibrations, may also affect the\ncrossing frequencies.\nFor some heavy isotopes, using the average F˜ value re-\nsults in too-small moments of inertia, e.g., in 178Hf and\n180W. For these isotopes, the average F˜ value gives too-large\nD th\noe values compared to the corresponding Dexpt\noe values. In\nfact, the D1l2 values obtained from the ‘‘standard’’ G0\nhave already overestimated the Dexpt\noe values for the heavy\nisotopes, e.g., by 166 keV ~neutrons! and 190 keV ~protons!\nin 178Hf and, correspondingly, 98 keV and 125 keV in 180W.\nIn general, the average gap method gives too-large D1l2\nvalues for heavy isotopes and too-small D1l2 values for\nlight isotopes, indicating the problem of the A dependence of\nthe pairing gaps. Obviously, averaging the G-adjusting fac-\ntors does not change the A dependence.1-3\nRAPID COMMUNICATIONS\nF. R. XU, R. WYSS, AND P. M. WALKER PHYSICAL REVIEW C 60 051301FIG. 2. Calculated and experimental moments of inertia. The open triangles and circles denote the calculations with the pairing strengths\nobtained by the average gap method (G0) and those adjusted, on average, for mean-field and blocking effects (G5F˜ G0), respectively. The\ndots show the experimental values @24#.In order to check the influence of the above unsatisfactory\nA dependence, we have also done the calculation with the\npairing strength, G0, which makes D1l25Dexpt\noe for each\ngiven nucleus. The G0 value is normally smaller than the\n‘‘standard’’ G0 value for a heavy isotope, e.g., in 178Hf and\n180W. Results show that the moments of inertia obtained\nwith such G0 values are systematically larger than the corre-\nsponding experimental moments of inertia. However, when\nthe G0 value instead is adjusted by reproducing the Dexptoe\nvalue with D1l21d ~i.e., including the mean-field and\nblocking effects, D th\noe5Dexpt\noe ) a significantly improved de-\nscription can be obtained, as shown in Fig. 3 for 178Hf and\n180W. Here we have obtained different F values ~see Fig. 3,\ncaption! compared to the above average F˜ value, mainly be-\ncause the different pairing strengths (G0 or G0) have been\nchosen as the reference of the G adjustment. The nonaverage\nF values are mostly in the range of 1.05–1.10 for neutrons\nand 1.03–1.08 for protons. Clearly, the proper pairing\nstrength for odd-even mass differences is also consistent with\nthat for moments of inertia. In addition, the increase of the\npairing strength found in the present work agrees with that\nneeded to reproduce the excitation energies of high-seniority\nstates @9#.\nThe moment of inertia is also sensitive to nuclear shape.\nIn order to check the determined deformations, we calculated05130intrinsic quadrupole moments @9#, and obtained results which\nagree with the corresponding experimental values @25#. The\ndeformation changes due to the adjustments of the G values\nare very small (uDb2u,0.003 and uDb4u<0.002) for nuclei\nFIG. 3. Similar to Fig. 2, but with nonaverage G values. The\nopen triangles are for the calculations with the G0 values, which\nmake D1l25Dexpt\noe for each nucleus. The open circles show the\nresults with G\/G051.13 ~neutons! and 1.05 ~protons! for 178Hf\nand, correspondingly, 1.10 and 1.09 for 180W, which make D1l2\n1d5Dexpt\noe ~i.e., including the mean-field and blocking effects!.1-4\nRAPID COMMUNICATIONS\nMEAN-FIELD AND BLOCKING EFFECTS ON ODD-EVEN . . . PHYSICAL REVIEW C 60 051301that are not soft. In 172,176W, some shifts in J (1) are seen,\nwhich are due to the shifts of the b2 values with increasing\nrotational frequency. For 1722176W, as mentioned, the calcu-\nlated TRS’s are soft in the b2 direction.\nIn summary, we have investigated the mean-field and\nblocking effects on odd-even mass differences for the de-\nformed even-even nuclei in the rare-earth region. These ef-\nfects are shown to be in the range of 10–30 % of the corre-\nsponding odd-even mass differences, and should not be\nneglected in the determination of pairing strengths. Indeed,\nwhen the blocking and mean-field effects are taken into ac-\ncount, pairing strengths are increased by about 5–10 %, re-05130sulting in sizable changes of the pair gaps. The adjusted\nstrengths are consistent with what is needed to reproduce the\nexcitation energies of multiquasiparticle configurations, and\nlead to an improved description of nuclear collective rota-\ntional motion, through calculating moments of inertia and\nbackbending frequencies. The present work establishes a\nconsistent relation between mass differences, moments of in-\nertia and excitation energies of high-seniority states.\nThis work was supported by the U.K. Engineering and\nPhysical Sciences Research Council and the Swedish Natural\nSciences Research Council.@1# S.T. Belyaev, Mat. Fys. Medd. K. Dan. Vidensk. Selsk. 31, 1\n~1959!.\n@2# S.G. Nilsson and O. Prior, Mat. Fys. Medd. K. Dan. Vidensk.\nSelsk. 32, 16 ~1961!.\n@3# W. Satul\u0094a, J. Dobaczewski, and W. Nazarewicz, Phys. Rev.\nLett. 81, 3599 ~1998!.\n@4# J.Y. Zeng and T.S. Cheng, Nucl. Phys. A405, 1 ~1983!.\n@5# R. Bengtsson and S. A˚ berg, Phys. Lett. B 172, 277 ~1986!.\n@6# L. Goetting and W. Nazarewicz, J. Phys. G 16, L51 ~1990!.\n@7# R. Bengtsson, Y.S. Chen, J.-Y. Zhang, and S. A˚ berg, Nucl.\nPhys. A405, 221 ~1983!.\n@8# T. Bengtsson, Nucl. Phys. A496, 56 ~1989!.\n@9# F.R. Xu, P.M. Walker, J.A. Sheikh, and R. Wyss, Phys. Lett. B\n435, 257 ~1998!.\n@10# M. Brack, J. Damgaard, A.S. Jensen, H.C. Pauli, V.M. Strutin-\nsky, and C.Y. Wong, Rev. Mod. Phys. 44, 320 ~1972!.\n@11# W.D. Myers and W.J. Swiatecki, Ann. Phys. ~N.Y.! 55, 395\n~1969!.\n@12# W. Nazarewicz, J. Dudek, R. Bengtsson, T. Bengtsson, and I.Ragnarsson, Nucl. Phys. A435, 397 ~1985!.\n@13# A. Oros, I. Wiedenho¨ver, and R. Wyss ~unpublished!.\n@14# H.C. Pradhan, Y. Nogami, and J. Law, Nucl. Phys. A201, 357\n~1973!.\n@15# D.G. Madland and J.R. Nix, Nucl. Phys. A476, 1 ~1988!.\n@16# P. Mo¨ller and J.R. Nix, Nucl. Phys. A536, 20 ~1992!.\n@17# H. Sakamoto and T. Kishimoto, Phys. Lett. B 245, 321 ~1990!;\nNucl. Phys. A501, 205 ~1989!.\n@18# W. Satul\u0094a and R. Wyss, Phys. Rev. C 50, 2888 ~1994!.\n@19# M. Diebel, Nucl. Phys. A419, 221 ~1984!.\n@20# R. Wyss and W. Satul\u0094a, Phys. Lett. B 351, 393 ~1995!.\n@21# C. Audi, O. Bersillon, J. Blachot, and A.H. Wapstra, Nucl.\nPhys. A624, 1 ~1997!.\n@22# W. Satul\u0094a, R. Wyss, and P. Magierski, Nucl. Phys. A578, 45\n~1994!.\n@23# W. Satul\u0094a and R. Wyss, Phys. Scr. T56, 159 ~1995!.\n@24# R.B. Firestone and V.S. Shirley, Table of Isotopes ~Wiley,\nNew York, 1996!, Vol. II.\n@25# S. Raman et al., At. Data Nucl. Data Tables 36, 1 ~1987!.1-5\n"}