{"doi":null,"coreId":"10706","oai":"oai:www.e-space.mmu.ac.uk:2173\/95365","identifiers":["oai:www.e-space.mmu.ac.uk:2173\/95365",null],"title":"Can exercise prevent osteoporosis?","authors":["Rittweger, Jörn"],"enrichments":{"references":[{"id":17790727,"title":"A brief review for orthopedic surgeons: fatigue damage (microdamage) in bone (its determinants and clinical implications).","authors":[],"date":"1998","doi":"10.1007\/s007760050053","raw":"Frost  HM.  A  brief  review  for  orthopedic  surgeons: fatigue  damage  (microdamage)  in  bone  (its  determinants  and  clinical  implications).  J  Orthop  Sci  1998; 3:272-281.","cites":null},{"id":17790734,"title":"American College of Sports Medicine Position Stand: physical activity and bone health. Med Sci Sports Exerc","authors":[],"date":"2004","doi":null,"raw":"Kohrt  WM,  Bloomfield  SA,  Little  KD,  Nelson  ME, Yingling  VR.  American  College  of  Sports  Medicine Position Stand: physical activity and bone health. Med Sci Sports Exerc 2004; 36:1985-1996.","cites":null},{"id":660556,"title":"Bone &quot;mass&quot; and the &quot;mechanostat&quot;: a proposal. Anat Rec","authors":[],"date":"1987","doi":"10.1002\/ar.1092190104","raw":"Frost HM. Bone &quot;mass&quot; and the &quot;mechanostat&quot;: a proposal. Anat Rec 1987; 219:1-9.","cites":null},{"id":17790743,"title":"Bone status in elite male runners.","authors":[],"date":"2005","doi":"10.1007\/s00421-005-0060-1","raw":"Kemmler W, Engelke K, Baumann H, Beeskow C, von Stengel  S,  Weineck  J,  Kalender  WA.  Bone  status  in elite male runners. Eur J Appl Physiol 2005; 96:78-85.","cites":null},{"id":17790770,"title":"Bone-muscle strength indices for the human lower leg. Bone","authors":[],"date":"2000","doi":"10.1016\/s8756-3282(00)00327-6","raw":"Rittweger J, Beller G, Ehrig J, Jung C, Koch U, Ramolla  J,  Schmidt  F,  Newitt  D,  Majumdar  S,  Schiessl  H, Felsenberg  D.  Bone-muscle  strength  indices  for  the human lower leg. Bone 2000; 27:319-326.","cites":null},{"id":664685,"title":"Changes in bone density during childhood and adolescence: an approach based on bone's biological organization. J Bone Miner Res","authors":[],"date":"2001","doi":"10.1359\/jbmr.2001.16.4.597","raw":"Rauch F, Schönau E. Changes in bone density during childhood  and  adolescence:  an  approach  based  on bone's biological organization. J Bone Miner Res 2001; 16:597-604.","cites":null},{"id":17790775,"title":"Defining osteopenias and osteoporoses: another view (with insights from a new paradigm). Bone","authors":[],"date":"1997","doi":"10.1016\/s8756-3282(97)00019-7","raw":"Frost  HM.  Defining  osteopenias  and  osteoporoses: another view (with insights from a new paradigm). Bone 1997; 20:385-391.","cites":null},{"id":17790738,"title":"Designing exercise regimens to increase bone strength. Exerc Sport Sci Rev","authors":[],"date":"2003","doi":"10.1097\/00003677-200301000-00009","raw":"Turner CH, Robling AG. Designing exercise regimens to increase bone strength. Exerc Sport Sci Rev 2003; 31:45-50.","cites":null},{"id":660553,"title":"Discorsi e dimonstrazioni matematiche, intorno a due nuove scienze attentanti alla meccanica ed a movimenti locali.","authors":[],"date":null,"doi":null,"raw":"Galilei G. Discorsi e dimonstrazioni matematiche, intorno a due nuove scienze attentanti alla meccanica ed a movimenti locali. University of Wisconsin Press, Madison; 1638.","cites":null},{"id":17790773,"title":"Effect of 6-month whole body vibration training on hip density, muscle strength, and postural control in postmenopausal women: a randomized controlled pilot study.","authors":[],"date":"2004","doi":"10.1359\/jbmr.0301245","raw":"Verschueren SM, Roelants M, Delecluse C, Swinnen S, Vanderschueren D, Boonen S. Effect of 6-month whole body vibration training on hip density, muscle strength, and postural control in postmenopausal women: a randomized controlled pilot study. J Bone Miner Res 2004; 19: 352-359.J. Rittweger: Can exercise prevent osteoporosis?","cites":null},{"id":664676,"title":"Effects of exercise training on bone remodeling, insulin-like growth factors, and bone mineral density in postmenopausal women with and without hormone replacement therapy. Calcif Tissue Int","authors":[],"date":"2003","doi":"10.1007\/s00223-001-1128-5","raw":"Milliken LA, Going SB, Houtkooper LB, Flint-Wagner HG, Figueroa A, Metcalfe LL, Blew RM, Sharp SC, Lohman  TG.  Effects  of  exercise  training  on  bone remodeling, insulin-like growth factors, and bone mineral density in postmenopausal women with and without  hormone  replacement  therapy.  Calcif  Tissue  Int 2003; 72:478-484.","cites":null},{"id":17790747,"title":"Effects of high versus low-intensity resistance training on bone mineral density in young males. Calcif Tissue Int","authors":[],"date":"2001","doi":"10.1007\/s002230010001","raw":"Tsuzuku S, Shimokata H, Ikegami Y, Yabe K, Wasnich RD.  Effects  of  high  versus  low-intensity  resistance training on bone mineral density in young males. Calcif Tissue Int 2001; 68:342-347.","cites":null},{"id":17790746,"title":"Effects of high-intensity resistance training on bone mineral density in young male powerlifters. Calcif Tissue Int","authors":[],"date":"1998","doi":"10.1007\/s002239900527","raw":"Tsuzuku S, Ikegami Y, Yabe K. Effects of high-intensity resistance training on bone mineral density in young male powerlifters. Calcif Tissue Int 1998; 63:283-286.","cites":null},{"id":664677,"title":"Effects of one year of resistance training on the relation between muscular strength and bone density in elderly women.","authors":[],"date":"2000","doi":"10.1249\/00005768-199505001-00121","raw":"Rhodes  EC,  Martin  AD,  Taunton  JE,  Donnelly  M, Warren  J,  Elliot  J.  Effects  of  one  year  of  resistance training on the relation between muscular strength and bone density in elderly women. Br J Sports Med 2000; 34:18-22.","cites":null},{"id":17790771,"title":"Estrogen and bonemuscle strength and mass relationships [see comments].","authors":[],"date":"1998","doi":null,"raw":"Schiessl H, Frost HM, Jee WSS. Estrogen and bonemuscle strength and mass relationships [see comments]. Bone 1998; 22:1-6.","cites":null},{"id":17790728,"title":"Fatigue fractures in thoroughbred racehorses: relationships with age, peak bone strain, and training.","authors":[],"date":"1990","doi":"10.1002\/jor.1100080417","raw":"Nunamaker DM, Butterweck DM, Provost MT. Fatigue fractures  in  thoroughbred  racehorses:  relationships with age, peak bone strain, and training. J Orthop Res 1990; 8:604-611.","cites":null},{"id":660548,"title":"Group. Assessment of fracture risk and its application to screening for postmenopausal osteoporosis.","authors":[],"date":null,"doi":"10.1007\/BF01622200","raw":"WHO Study Group. Assessment of fracture risk and its application to screening for postmenopausal osteoporosis.  Geneva,  Switzerland,  WHO.  WHO  Technical Report Series; 1994:843.","cites":null},{"id":17790748,"title":"High intensity resistance training: effects on bone in older men and women. Calcif Tissue Int","authors":[],"date":"2000","doi":"10.1007\/s002230010081","raw":"Maddalozzo GF, Snow CM. High intensity resistance training: effects on bone in older men and women. Calcif Tissue Int 2000; 66:399-404.","cites":null},{"id":664678,"title":"Highimpact exercise promotes bone gain in well-trained female athletes. J Bone Miner Res","authors":[],"date":"1997","doi":"10.1359\/jbmr.1997.12.2.255","raw":"Taaffe DR, Robinson TL, Snow CM, Marcus R. Highimpact  exercise  promotes  bone  gain  in  well-trained female athletes. J Bone Miner Res 1997; 12:255-260.","cites":null},{"id":17790731,"title":"Increased intracortical remodeling following fatigue damage.","authors":[],"date":"1993","doi":"10.1016\/8756-3282(93)90235-3","raw":"Mori S, Burr DB. Increased intracortical remodeling following fatigue damage. Bone 1993; 14:103-109.","cites":null},{"id":17790741,"title":"Low bone mass and high bone turnover in male long distance runners.","authors":[],"date":"1993","doi":"10.1210\/jcem.77.3.8370698","raw":"Hetland ML, Haarbo J, Christiansen C. Low bone mass and high bone turnover in male long distance runners. J Clin Endocrinol Metab 1993; 77:770-775.","cites":null},{"id":664683,"title":"Low magnitude mechanical loading is osteogenic in children with disabling conditions. J Bone Miner Res","authors":[],"date":"2004","doi":"10.1359\/JBMR.040129","raw":"Ward k, Alsop C, Caulton J, Rubin C, Adams J, Mughal Z. Low magnitude mechanical loading is osteogenic in children with disabling conditions. J Bone Miner Res 2004; 19:360-369.","cites":null},{"id":664680,"title":"Low mechanical signals strengthen long bones. Nature","authors":[],"date":"2001","doi":null,"raw":"Rubin C, Turner AS, Bain S, Mallinckrodt C, McLeod K. Anabolism. Low mechanical signals strengthen long bones. Nature 2001; 412:603-604.","cites":null},{"id":17790744,"title":"Maintenance of BMD in older male runners is independent of changes in training volume or VO(2)peak.","authors":[],"date":"2002","doi":"10.1093\/gerona\/57.4.m203","raw":"Wiswell RA, Hawkins SA, Dreyer HC, Jaque SV. Maintenance of BMD in older male runners is independent of changes in training volume or VO(2)peak. J Gerontol A Biol Sci Med Sci 2002; 57:M203-M208.","cites":null},{"id":660547,"title":"Mechanical effects on the skeleton: are there clinical implications? Osteoporos Int","authors":[],"date":"2001","doi":null,"raw":"Forwood  MR.  Mechanical  effects  on  the  skeleton:  are there clinical implications? Osteoporos Int 2001; 12:77-83.","cites":null},{"id":660554,"title":"Mechanical function as an influence on the structure and form of bone.","authors":[],"date":"1976","doi":null,"raw":"Lanyon LE, Baggott DG. Mechanical function as an influence on the structure and form of bone. J Bone Joint Surg Br 1976; 58-B 436-443.","cites":null},{"id":17790772,"title":"Mechanical stimulation in the form of vibration prevents postmenopausal bone loss in ovariectomized rats. Calcif Tissue Int","authors":[],"date":"1998","doi":"10.1007\/s002239900566","raw":"Flieger J, Karachalios T, Khaldi L, Raptou P, Lyritis G. Mechanical stimulation in the form of vibration prevents postmenopausal bone loss in ovariectomized rats. Calcif Tissue Int 1998; 63:510-514.","cites":null},{"id":664681,"title":"Mechanical strain, induced noninvasively in the high-frequency domain, is anabolic to cancellous bone, but not cortical bone. Bone","authors":[],"date":"2002","doi":"10.1016\/S8756-3282(01)00689-5","raw":"Rubin  C,  Turner  AS,  Mallinckrodt  C,  Jerome  C, McLeod  K,  Bain  S.  Mechanical  strain,  induced  noninvasively in the high-frequency domain, is anabolic to cancellous  bone,  but  not  cortical  bone.  Bone  2002; 30:445-452.","cites":null},{"id":17790733,"title":"Nonpharmacological means to prevent fractures amongJ. Rittweger: Can exercise prevent osteoporosis? older adults. Ann Med","authors":[],"date":"2005","doi":"10.1080\/07853890510007197","raw":"Kannus P, Uusi-Rasi K, Palvanen M, Parkkari J. Nonpharmacological  means  to  prevent  fractures  amongJ. Rittweger: Can exercise prevent osteoporosis? older adults. Ann Med 2005; 37:303-310.","cites":null},{"id":660551,"title":"On Growth and Form.","authors":[],"date":"1917","doi":"10.1086\/418080","raw":"D'Arcy T. On Growth and Form. Cambridge University Press, Cambridge; 1917.","cites":null},{"id":17790737,"title":"Osteoporosis and exercise: a review.","authors":[],"date":"1999","doi":null,"raw":"Sheth P. Osteoporosis and exercise: a review. Mt Sinai J Med 1999; 66:197-200.","cites":null},{"id":17790740,"title":"Population-based study of age and sex differences in bone volumetric density, size, geometry, and structure at different skeletal sites. J Bone Miner Res","authors":[],"date":"2004","doi":"10.1359\/jbmr.040916","raw":"Riggs BL, Melton IL III, Robb RA, Camp JJ, Atkinson EJ, Peterson JM, Rouleau PA, McCollough CH, Bouxsein ML, Khosla S. Population-based study of age and sex differences in bone volumetric density, size, geometry,  and  structure  at  different  skeletal  sites.  J  Bone Miner Res 2004; 19:1945-1954.","cites":null},{"id":664679,"title":"Power training is more effective than strength training for maintaining bone mineral density in postmenopausal women.","authors":[],"date":"2005","doi":null,"raw":"Stengel SV, Kemmler W, Pintag R, Beeskow C, Weineck J, Lauber D, Kalender WA, Engelke K. Power training  is  more  effective  than  strength  training  for maintaining  bone  mineral  density  in  postmenopausal women. J Appl Physiol 2005; 99:181-188.","cites":null},{"id":664684,"title":"Prevention of postmenopausal bone loss by a low-magnitude, high-frequency mechanical stimuli: a clinical trial assessing compliance, efficacy, and safety. J Bone Miner Res","authors":[],"date":"2004","doi":"10.1359\/JBMR.0301251","raw":"Rubin  C,  Recker  R,  Cullen  D,  Ryaby  J,  McCabe  J, McLeod K. Prevention of postmenopausal bone loss by a low-magnitude, high-frequency mechanical stimuli: a clinical trial assessing compliance, efficacy, and safety. J Bone Miner Res 2004; 19:343-351.","cites":null},{"id":664682,"title":"Quantity and quality of trabecular bone in the femur are enhanced by a strongly anabolic, noninvasive mechanical intervention. J Bone Miner Res","authors":[],"date":"2002","doi":"10.1359\/jbmr.2002.17.2.349","raw":"Rubin C, Turner AS, Muller R, Mittra E, McLeod K, Lin  W,  Qin  YX.  Quantity  and  quality  of  trabecular bone in the femur are enhanced by a strongly anabolic, noninvasive mechanical intervention. J Bone Miner Res 2002; 17:349-357.","cites":null},{"id":17790749,"title":"Resistance exercise and bone turnover in elderly men and women. Med Sci Sports Exerc","authors":[],"date":"2002","doi":"10.1097\/00005768-200201000-00004","raw":"Vincent KR, Braith RW. Resistance exercise and bone turnover in elderly men and women. Med Sci Sports Exerc 2002; 34:17-23.","cites":null},{"id":17790774,"title":"Resistive vibration exercise prevents bone loss during 8 weeks of strict bed rest in healthy male subjects: Results from the Berlin Bed Rest (BBR) study. J Bone Miner Res","authors":[],"date":"2004","doi":null,"raw":"Rittweger J, Felsenberg D. Resistive vibration exercise prevents bone loss during 8 weeks of strict bed rest in healthy male subjects: Results from the Berlin Bed Rest (BBR)  study.  J  Bone  Miner  Res  2004;  19(Suppl. 1):1145.","cites":null},{"id":17790735,"title":"Role of exercise in preventing and treating osteoporosis. Rheum Dis Clin North Am","authors":[],"date":"2001","doi":"10.1016\/s0889-857x(05)70190-3","raw":"Marcus R. Role of exercise in preventing and treating osteoporosis. Rheum Dis Clin North Am 2001; 27:131-41.","cites":null},{"id":17790745,"title":"Site-specific skeletal response to long-term weight training seems to be attributable to principal loading modality: a pQCT study of female weightlifters. Calcif Tissue Int","authors":[],"date":"2002","doi":"10.1007\/s00223-001-1019-9","raw":"Heinonen A, Sievanen H, Kannus P, Oja P, Vuori I. Site-specific  skeletal  response  to  long-term  weight training seems to be attributable to principal loading modality: a pQCT study of female weightlifters. Calcif Tissue Int 2002; 70:469-474.","cites":null},{"id":17790730,"title":"Skeletal structural adaptations to mechanical usage (SATMU): 2. Redefining Wolff's Law: the remodeling problem. Anat Rec","authors":[],"date":"1990","doi":"10.1002\/ar.1092260403","raw":"Frost HM. Skeletal structural adaptations to mechanical usage (SATMU): 2. Redefining Wolff's Law: the remodeling problem. Anat Rec 1990; 226:414-422.","cites":null},{"id":660550,"title":"The muscle-bone relationship: methods and management - perspectives in glycogen storage disease.","authors":[],"date":"2002","doi":"10.1007\/bf02679994","raw":"Schönau  E,  Schwahn  B,  Rauch  F.  The  muscle-bone relationship: methods and management - perspectives in  glycogen  storage  disease.  Eur  J  Pediatr  2002; 161(Suppl. 1):S50-S52.","cites":null},{"id":17790732,"title":"The role of fatigue in the pathogenesis of senile femoral neck fractures.","authors":[],"date":"1974","doi":null,"raw":"Freeman MA, Todd RC, Pirie CJ. The role of fatigue in the  pathogenesis  of  senile  femoral  neck  fractures.  J Bone Joint Surg Br 1974; 56-B:698-702.","cites":null},{"id":660549,"title":"The Utah Paradigm of Skeletal Physiology.","authors":[],"date":"2004","doi":"10.1159\/000053296","raw":"Frost HM. The Utah Paradigm of Skeletal Physiology. ISMNI, Athens, Greece; 2004.","cites":null},{"id":660555,"title":"Über die innere Architectur und ihre Bedeutung für die Frage vom Knochenwachstum. Archiv für pathologische Anatomie und Physiologie 1870;","authors":[],"date":null,"doi":"10.1007\/bf01944490","raw":"Wolff J. Über die innere Architectur und ihre Bedeutung für die Frage vom Knochenwachstum. Archiv für pathologische Anatomie und Physiologie 1870; 50:389-450.","cites":null},{"id":660552,"title":"Vital biomechanics: proposed general concepts for skeletal adaptations to mechanical usage. Calcif Tissue Int","authors":[],"date":"1988","doi":"10.1007\/BF02556327","raw":"Frost HM. Vital biomechanics: proposed general concepts for skeletal adaptations to mechanical usage. Calcif Tissue Int 1988; 42:145-156.","cites":null},{"id":17790742,"title":"Why do marathon runners have less bone than weight lifters? A vital biomechanical view and explanation [see comments]. Bone","authors":[],"date":"1997","doi":"10.1016\/s8756-3282(96)00311-0","raw":"Frost HM. Why do marathon runners have less bone than  weight  lifters?  A  vital  biomechanical  view  and explanation [see comments]. Bone 1997; 20:183-189.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-31T12:46:11Z","abstract":"Full-text of this article is available at http:\/\/www.ismni.org\/jmni\/pdf\/24\/11RITTWEGER.pdf","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/10706.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2173\/95365","pdfHashValue":"33d22ff11a6b28a18b9d4a63e107af673fce845e","publisher":"The International Society of Musculoskeletal and Neuronal Interactions","rawRecordXml":"<record><header><identifier>\noai:www.e-space.mmu.ac.uk:2173\/95365<\/identifier><datestamp>2010-03-31T12:46:11Z<\/datestamp><setSpec>hdl_2173_1571<\/setSpec><\/header><metadata><oai_dc:dc xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Can exercise prevent osteoporosis?<\/dc:title><dc:creator>Rittweger, Jörn<\/dc:creator><dc:subject>Sport<\/dc:subject><dc:subject>Osteopenia<\/dc:subject><dc:subject>Aging<\/dc:subject><dc:subject>Material Fatigue<\/dc:subject><dc:subject>Bone<\/dc:subject><dc:description>Commonly used definitions of osteoporosis rely upon the measurement of bone mass or bone mineral density and regard the difference between osteopenia and osteoporosis as gradual. An alternative definition has been proposed by Harold Frost, suggesting that osteopenia is the bone’s physiological response to disuse. On the contrary, true osteoporoses imply the bone’s inability to adapt to the loads imposed on them by their habitual mechanical usage. As a consequence, fractures occur with no or very little trauma in osteoporotic, but not in osteopenic bones. There is now ample evidence that mechanical stimuli can increase strength. Accordingly, exercise, in particular some new forms of it that involve high strain rates, seems to be preventing bone loss and possibly also induces increases in bone mass even at older ages. Hence, exercise may ameliorate osteopenia in the sense of Frost’s definition. However, exercise must be feared to facilitate rather than to ameliorate the occurrence of true osteoporoses, e.g., due to microdamage accumulation. This is in sharp contrast to the general ‘understanding’.<\/dc:description><dc:description>Full-text of this article is available at http:\/\/www.ismni.org\/jmni\/pdf\/24\/11RITTWEGER.pdf<\/dc:description><dc:publisher>The International Society of Musculoskeletal and Neuronal Interactions<\/dc:publisher><dc:date>2010-03-31T12:46:11Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>The Journal of Musculoskeletal and Neuronal Interactions, 2006, vol. 6, no. 2, pp. 162-166<\/dc:identifier><dc:identifier>16849827<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/2173\/95365<\/dc:identifier><dc:language>en<\/dc:language><dc:relation>http:\/\/www.ismni.org\/jmni\/index.htm<\/dc:relation><dc:relation>http:\/\/www.ismni.org\/jmni\/pdf\/24\/11RITTWEGER.pdf<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/www.ismni.org\/jmni\/index.htm","http:\/\/www.ismni.org\/jmni\/pdf\/24\/11RITTWEGER.pdf"],"year":2010,"topics":["Sport","Osteopenia","Aging","Material Fatigue","Bone"],"subject":["Article"],"fullText":""}