{"doi":"10.1375\/bech.21.2.115.55423","coreId":"197769","oai":"oai:lra.le.ac.uk:2381\/10040","identifiers":["oai:lra.le.ac.uk:2381\/10040","10.1375\/bech.21.2.115.55423"],"title":"Cyber-flirting: An examination of men's and women's flirting behaviour both offline and on the Internet","authors":["Whitty, Monica T."],"enrichments":{"references":[{"id":43730913,"title":"An evolutionary view on understanding sex effects in communicating attraction. In","authors":[],"date":"1998","doi":null,"raw":"Trost, M. R., & Alberts, J. K. (1998). An evolutionary view on understanding sex effects in communicating attraction. In D. J. Canary (Ed.), Sex differences and similarities in communication. Critical essays and empirical investigations of sex and gender in interaction (pp. 233-255). Mahwah, NJ, US: Lawrence Erlbaum Associates Inc Publishers..","cites":null},{"id":43730904,"title":"Coming apart at the seams: Sex, text and the virtual body. In","authors":[],"date":"1996","doi":null,"raw":"McRae, S. (1996). Coming apart at the seams: Sex, text and the virtual body. In L. Cherny & E. R. Weise (Eds.), Wired women: Gender and new realities in cyberspace (pp. 242-263). New York: Seal Press.","cites":null},{"id":43730916,"title":"Cyber-flirting: Playing at love on the Internet.","authors":[],"date":"2003","doi":"10.1177\/0959354303013003003","raw":"Whitty, M. T. (2003). Cyber-flirting: Playing at love on the Internet. Theory and Psychology, 13 (3), 339-357.","cites":null},{"id":43730918,"title":"Cyberspace as potential space: Considering","authors":[],"date":"2003","doi":"10.1177\/00187267030567005","raw":"Whitty, M.T. & Carr, A.N. (2003). Cyberspace as potential space: Considering","cites":null},{"id":43730898,"title":"Evolution, traits, and the stages of human courtship: Qualifying the parental investment model.","authors":[],"date":"1990","doi":"10.1111\/j.1467-6494.1990.tb00909.x","raw":"Kenrick, D. T., Sadalla, E. K., Groth, G., & Trost, M. R. (1990). Evolution, traits, and the stages of human courtship: Qualifying the parental investment model. Journal of Personality, 58(1), 97-116.","cites":null},{"id":43730899,"title":"Friendly? Flirting? Wrong?, In","authors":[],"date":"1993","doi":null,"raw":"Koeppel, L. B., Montagne Miller, Y., O'Hair, D., & Cody, M. J. (1993). Friendly? Flirting? Wrong?, In P. J. Kalbfleisch (Ed). (1993). Interpersonal communication: Cyber-flirting 24 Evolving interpersonal relationships. Communication. (pp. 19-45). Hillsdale, N. J.: Erlbaum.","cites":null},{"id":43730901,"title":"Gender differences in nonverbal flirtation.","authors":[],"date":"1989","doi":null,"raw":"McCormick, N. B., & Jones, A. J. (1989). Gender differences in nonverbal flirtation. Journal of Sex Education and Therapy, 15(4), 271-282.","cites":null},{"id":43730910,"title":"Georg Simmel: On women, sexuality, and love. Translated and edited","authors":[],"date":"1984","doi":"10.1086\/228220","raw":"Simmel, G. (1984). Georg Simmel: On women, sexuality, and love. Translated and edited by Kurt H. Wolff. New York: The Free Press.","cites":null},{"id":43730897,"title":"Integrating evolutionary and social exchange perspectives on relationships: Effects of gender, selfappraisal, and involvement level on mate selection criteria.","authors":[],"date":"1993","doi":"10.1037\/0022-3514.64.6.951","raw":"Kenrick, D. T., Groth, G. E., Trost, M. R., & Sadalla, E. K. (1993). Integrating evolutionary and social exchange perspectives on relationships: Effects of gender, selfappraisal, and involvement level on mate selection criteria. Journal of Personality and Social Psychology, 64(6), 951-969.","cites":null},{"id":43730902,"title":"Internet relationships: People who meet people.","authors":[],"date":"2001","doi":"10.1089\/109493101753235188","raw":"McCown, J. A., Fischer, D., Page, R., & Homant, M. (2001). Internet relationships: People who meet people. CyberPsychology and Behavior, 4(5), 593-596.","cites":null},{"id":43730896,"title":"Let’s make a deal: An analysis of revelations and stipulations in lonely hearts advertisements.","authors":[],"date":"1977","doi":"10.1037\/0022-3514.35.4.257","raw":"Harrison, A. & Saeed, L. (1977). Let’s make a deal: An analysis of revelations and stipulations in lonely hearts advertisements. Journal of Personality and Social Psychology, 38, 604-617.","cites":null},{"id":43730915,"title":"Liar, Liar! An examination of how open, supportive and honest people are in Chat Rooms.","authors":[],"date":"2002","doi":"10.1016\/s0747-5632(01)00059-0","raw":"Whitty, M. T. (2002). Liar, Liar! An examination of how open, supportive and honest people are in Chat Rooms. Computers in Human Behavior, 18(4), 343-352.","cites":null},{"id":43730914,"title":"Life on the screen: Identity in the age of the Internet.","authors":[],"date":"1995","doi":"10.1177\/135485659700300112","raw":"Turkle, S. (1995). Life on the screen: Identity in the age of the Internet. London: Weidenfeld & Nicolson.","cites":null},{"id":43730907,"title":"Making friends in cyberspace.","authors":[],"date":"1996","doi":"10.1111\/j.1460-2466.1996.tb01462.x","raw":"Parks, M. R., & Floyd, K. (1996). Making friends in cyberspace. Journal of Communication, 46(1), 80-97.","cites":null},{"id":43730908,"title":"Making MOOsic&quot;: The development of Personal Relationships on-line and a comparison to their off-line counterparts.","authors":[],"date":"1998","doi":"10.1177\/0265407598154005","raw":"Cyber-flirting 25 Parks, M. R., & Roberts, L. D. (1998). &quot;Making MOOsic&quot;: The development of Personal Relationships on-line and a comparison to their off-line counterparts. Journal of Social and Personal Relationships, 15, 517-537.","cites":null},{"id":43730912,"title":"Men and women report their views on masculinity.","authors":[],"date":"1977","doi":null,"raw":"Travis, C. (1977). Men and women report their views on masculinity. Psychology Today, 10, 34-42.","cites":null},{"id":43730905,"title":"Nonverbal courtship patterns in women: Context and consequences.","authors":[],"date":"1985","doi":"10.1016\/0162-3095(85)90016-0","raw":"Moore, M. M. (1985). Nonverbal courtship patterns in women: Context and consequences. Ethology and Sociobiology, 6(4), 237-247.","cites":null},{"id":43730895,"title":"Nonverbal sex differences: Communication accuracy and expressive style.","authors":[],"date":"1984","doi":"10.1086\/494458","raw":"Hall, J. A. (1984). Nonverbal sex differences: Communication accuracy and expressive style. Baltimore: Johns Hopkins University Press.","cites":null},{"id":43730909,"title":"Overcoming relationship-initiation barriers: The impact of a computer-dating system on sex role, shyness, and appearance inhibitions.","authors":[],"date":"1995","doi":"10.1016\/0747-5632(94)00028-g","raw":"Scharlott, B. W. & Christ, W. G. (1995). Overcoming relationship-initiation barriers: The impact of a computer-dating system on sex role, shyness, and appearance inhibitions. Computers in Human Behavior, 11 (2), 191-204.","cites":null},{"id":43730917,"title":"Peering into online bedroom windows: Considering the ethical implications of investigating Internet relationships and sexuality.","authors":[],"date":"2004","doi":"10.4018\/978-1-59140-152-0.ch011","raw":"Cyber-flirting 26 Whitty, M.T. (2004). Peering into online bedroom windows: Considering the ethical implications of investigating Internet relationships and sexuality. In E. Buchanan (Ed.), Readings in Virtual Research Ethics: Issues and Controversies (pp. 203-218). Hershey, USA: Idea Group Inc.","cites":null},{"id":43730903,"title":"Relationship formation on the Internet: What's the big attraction?","authors":[],"date":"2002","doi":"10.1111\/1540-4560.00246","raw":"McKenna, K. Y. A., Green, A. S., and Gleason, M. E. J. (2002). Relationship formation on the Internet: What's the big attraction? Journal of Social Issues, 58, 659-671.","cites":null},{"id":43730900,"title":"Self-presentation in personal advertisements: The influence of implicit notions of attraction and role expectations.","authors":[],"date":"1988","doi":"10.1177\/026540758800500202","raw":"Koestner, R., & Wheeler, L. (1988). Self-presentation in personal advertisements: The influence of implicit notions of attraction and role expectations. Journal of Social and Personal Relationships, 5(2), 149-160.","cites":null},{"id":43730911,"title":"Single white male looking for thin, very attractive…&quot;","authors":[],"date":"1990","doi":"10.1007\/bf00289255","raw":"Smith, J. E., Waldorf, V. A. & Trembath, D. L. (1990). &quot;Single white male looking for thin, very attractive…&quot; Sex Roles, 23 (11\/12), 675-685.","cites":null},{"id":43730892,"title":"Statistical power analysis for the behavioral sciences.","authors":[],"date":"1988","doi":"10.4324\/9780203771587","raw":"Cohen, J. (1988). Statistical power analysis for the behavioral sciences. Hillsdale, NJ: Erlbaum.","cites":null},{"id":43730893,"title":"Teasing: Innocent fun or sadistic malice? Far Hills,","authors":[],"date":"1996","doi":null,"raw":"Feinberg, L. S. (1996). Teasing: Innocent fun or sadistic malice? Far Hills, NJ, US: New Horizon Press.","cites":null},{"id":43730891,"title":"The evolution of human intrasexual competition: Tactics of mate attraction.","authors":[],"date":"1988","doi":"10.1037\/0022-3514.54.4.616","raw":"Buss, D. M. (1988). The evolution of human intrasexual competition: Tactics of mate attraction. Journal of Personality and Social Psychology, 54 (4), 616-628.","cites":null},{"id":43730894,"title":"The nonverbal basis of attraction: Flirtation, courtship, and seduction.","authors":[],"date":"1978","doi":null,"raw":"Givens, D. (1978). The nonverbal basis of attraction: Flirtation, courtship, and seduction. Psychiatry, 41, 346-359.","cites":null},{"id":43730906,"title":"Verbal and nonverbal cues that convey interest in dating: Two studies.","authors":[],"date":"1986","doi":"10.1016\/s0005-7894(86)80071-5","raw":"Muehlenhard, C. L., Koralewski, M. A., Andrews, S. L., & Burdick, C. A. (1986). Verbal and nonverbal cues that convey interest in dating: Two studies. Behavior Therapy, 17(4), 404-419.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-04","abstract":"While flirting is a relatively underresearched area within psychology, even less is known about how people cyber-flirt. This paper explores how often individuals flirt offline compared to online. Moreover, it attempts to examine how men and women flirt within these different spaces. Five thousand, six hundred and ninety-seven individuals, of which 3554 (62%) were women and 2143 (38%) were men, completed a survey about their flirting behaviour both in face-to-face interactions and in chatrooms. The first hypothesis, which stated that the body would be used to flirt with as frequently online as offline, was partly supported. However, it was found that individuals downplayed the importance of physical attractiveness online. Women flirted by displaying nonverbal signals (offline) or substitutes for nonverbal cues (online), to a greater extent than men. In chatrooms men were more likely than women to initiate contact. It is concluded that cyber-flirting is more than simply a meeting of minds and that future research needs to consider the role of the body in online interactions.Peer-reviewedPost-prin","downloadUrl":"http:\/\/www.atypon-link.com\/AAP\/doi\/abs\/10.1375\/bech.21.2.115.55423","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10040\/4\/Cyberflirting%20Chat%20rooms_Whitty.pdf","pdfHashValue":"7e5a384c75d6f74cf118df005cd9a8628f8359df","publisher":"Australian Academic Press","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10040<\/identifier><datestamp>\n                2012-01-25T02:01:48Z<\/datestamp><setSpec>\n                com_2381_304<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_399<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCyber-flirting: An examination of men's and women's flirting behaviour both offline and on the Internet<\/dc:title><dc:creator>\nWhitty, Monica T.<\/dc:creator><dc:subject>\nATTRACTION<\/dc:subject><dc:subject>\nCOURTSHIP<\/dc:subject><dc:subject>\nEVOLUTION<\/dc:subject><dc:subject>\nPEOPLE<\/dc:subject><dc:subject>\nCUES<\/dc:subject><dc:description>\nWhile flirting is a relatively underresearched area within psychology, even less is known about how people cyber-flirt. This paper explores how often individuals flirt offline compared to online. Moreover, it attempts to examine how men and women flirt within these different spaces. Five thousand, six hundred and ninety-seven individuals, of which 3554 (62%) were women and 2143 (38%) were men, completed a survey about their flirting behaviour both in face-to-face interactions and in chatrooms. The first hypothesis, which stated that the body would be used to flirt with as frequently online as offline, was partly supported. However, it was found that individuals downplayed the importance of physical attractiveness online. Women flirted by displaying nonverbal signals (offline) or substitutes for nonverbal cues (online), to a greater extent than men. In chatrooms men were more likely than women to initiate contact. It is concluded that cyber-flirting is more than simply a meeting of minds and that future research needs to consider the role of the body in online interactions.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2012-01-24T16:46:14Z<\/dc:date><dc:date>\n2012-01-24T16:46:14Z<\/dc:date><dc:date>\n2004-04<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:type>\nArticle<\/dc:type><dc:identifier>\nBehaviour Change, 2004, 21 (2), pp. 115-126.<\/dc:identifier><dc:identifier>\n0813-4839<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10040<\/dc:identifier><dc:identifier>\nhttp:\/\/www.atypon-link.com\/AAP\/doi\/abs\/10.1375\/bech.21.2.115.55423<\/dc:identifier><dc:identifier>\n10.1375\/bech.21.2.115.55423<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© Copyright 2004 Australian Academic Press.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nAustralian Academic Press<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0813-4839","0813-4839"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["ATTRACTION","COURTSHIP","EVOLUTION","PEOPLE","CUES"],"subject":["Journal Article","Article"],"fullText":"Cyber-flirting 1 \nWhitty, M.T. (2004). Cyber-flirting: An examination of men's and \nwomen's flirting behaviour both offline and on the Internet. Behaviour \nChange, 21(2), 115-126. \n \nRunning head: Cyber-Flirting \n \nCyber-flirting: An Examination of Men’s and Women’s Flirting Behaviour both Offline \nand on the Internet \n \n \n \nDr. Monica T. Whitty \n \nCyber-flirting 2 \nABSTRACT \n \nWhile flirting is a relatively under-researched area within psychology, we know even less \nabout how people cyber-flirt. This paper explores how often individuals flirt offline \ncompared to online. Moreover, it attempts to examine how men and women flirt within \nthese different spaces. Five thousand, six hundred and ninety seven individuals, of which \n3554 (62%) were women and 2143 (38%) were men, completed a survey about their \nflirting behaviour both in face-to-face interactions and in Chat Rooms. The first \nhypothesis, which stated that the body would be used to flirt with as frequently online as \noffline, was partly supported. However, it was found that individuals downplayed the \nimportance of physical attractiveness online. Women flirted by displaying non-verbal \nsignals (offline) or substitutes for non-verbal cues (online), to a greater extent than men. \nIn Chat Rooms men were more likely than women to initiate contact. It was concluded \nthat cyber-flirting is more than simply a meeting of minds and that future research needs \nto consider the role of the body in online interactions. \n \nKEYWORDS: Cyber-flirting, flirting, Internet relationships, sex differences, attraction \n \n \nCyber-flirting 3 \nCyber-flirting: An Examination of Men’s and Women’s Flirting Behaviour both Offline \nand on the Internet \n \n \nThe distinctiveness of the flirt lies in the fact that she awakens delight and desire \nby means of unique antithesis and synthesis: through the alternation or \nsimultaneity of accommodation and denial… \n-- [Simmel, 1984, p. 134] \n \nGiven the burgeoning number of reports of relationships that initiate online (e.g., \nMcCown, Fischer, Page, & Homant, 2001; Parks & Roberts, 1998; Whitty & Gavin, \n2001) there is now an additional pressing need to understand exactly how these \nrelationships begin. Some research has considered how romantic relationships progress \nonline. For example, Whitty and Gavin (2001) contended that relationships often do not \nremain online but tend to progress from chat to email to phone to face-to-face. McKenna, \nGreen and Gleason (2002) concluded from their research that the absence of gating \nfeatures and the ability to self-disclose more in an anonymous environment were \nimportant reasons why relationships on the Internet develop quickly and are often close \nand intimate. However, while their research does in part support their claims, these \nresearchers did not explore in detail the types of conversations that take place online. For \ninstance, were some of these conversations about appearance?  Whitty has argued that \nwhile physical bodies are not present online, the body still matters (Whitty, 2003, Whitty \n& Carr, 2003). For example, one can still flirt online by describing what one’s body \nlooks, feels, and smells like. \nCyber-flirting 4 \n Given the strong emphasis by theorists, such as McKenna et al. (2002), on the \nabsence of the body online and the arguments made for attraction on the Internet to be as \na result of a meeting of minds, one aim of this study was to examine whether the role of \nthe body has been overlooked. Moreover, this study aimed to explore whether men and \nwomen flirt online in traditionally defined ways. While it is recognised here that there is a \ngreat range of flirting behaviours that social scientists ought to consider, this study \nlimited its focus to the following flirtatious behaviours: non-verbal behaviours, such as \nsmiling, eye gaze and touch, substitutes for non-verbal behaviours, such as emoticons \n(smiles, winks), acronyms (LOL – laugh out loud), descriptions of physical \nattractiveness, descriptions of socio-economic status, and initiating contact. \n \nTraditional flirting versus cyber-flirting \nPreviously, it has been argued that discussions around the absence of the body on \nthe Internet are counter-productive, and instead social scientists need to shift their focus \nto how the body is portrayed  online (Whitty, 2003; Whitty & Carr, 2003). Givens (1978) \nbelieved that face-to-face flirting behaviour mostly consists of non-verbal signals, \nespecially in the early stages of relationships. Unlike the spoken word, body language can \nsignal attraction without being too obvious. This ambiguity protects people from any \nhumiliation if the person to whom they are signalling attraction does not share these \nsentiments. Some basic codes that are important to consider in flirting include kinetics, \noculesics, physical appearance, olfactics, vocalics, proxemics and haptics (defined \nbelow). Whilst individuals might be skilled at displaying these flirting signals in face-to-\nface encounters, the question is how are these traditional offline cues replicated online (if \nCyber-flirting 5 \nat all)? This paper now turns to consider these basic flirting codes in greater detail and \nspeculates on what the online equivalents might be. \nTraditional displays of kinetic gestures include hair tossing, licking lips, mirroring \nbehaviour, smiling, laughing or giggling. Oculesics, or eye movements, include pupil \ndilation, demure glances, short darting glances, eyebrow flashes often accompanied by a \nsmile and eye contact. Olfactic forms of flirting are exemplified by the wearing of \nperfume and after-shave. Flirtatious speech is typically more animated speech with \nmoderate amounts of laughter, fewer silences and pauses and increased warmth and \ninterest. Proxemics is the amount of personal distance kept between individuals. \nIndividuals who lean toward one another and who are at the same body angle are \nperceived as being more seductive than those individuals who lean away from each other. \nHaptics, or the use of touch, is a common form of communication, particularly in \nflirtatious behaviour. Another sign of seductive behaviour is the use of unnecessary \nclothing adjustment. \nFor flirting to occur in cyberspace the body needs to be represented through text \n(Whitty, 2003, Whitty & Carr, 2003). For example, rather than making an effort to look \ngood, as one would traditionally do for an offline date, individuals can create a first \nimpression by describing via the text how attractive they appear. However, unlike \ntraditional interactions, this is not restricted to the appearance of one’s actual body. As \nargued in previous papers, cyberspace allows one, through text, to create new attractive \nbodies (Whitty, 2003, Whitty & Carr, 2003). Indeed, we can devise an entirely new \nattractive being, one that has a good job, earns huge sums of money, and is well educated. \nEven if photos are exchanged online, these are not necessary photos of the actual \nCyber-flirting 6 \nindividual, or alternatively, people are able to carefully select images of themselves that \nput themselves in the best light (possibly by selecting pictures of when they were much \nyounger). \nDemure glances and eyebrow flashes are not as easily replicated online. However, \nthe are some alternatives to these non-verbal gestures. For example, emoticons, which are \ndrawings made from grammatical symbols, might be a useful alternative. We can use \nfacial expressions such as smiley faces, winks and kisses as a substitute for body \nlanguage. Moreover, rather than use audible laughing and giggling, individuals can use \nacronyms, such as LOL (laugh out loud or lots of laughs). Seductive ‘screen names’ are \nanother device people can add to their repertoire of online flirting behaviours. Although \none cannot physically touch online, one can describe touching another individual, what \nthat touch feels like and in turn how they visualise being touched by the person they are \ninteracting with (see Whitty, 2003, Whitty & Carr, 2003 for a more detailed discussion of \ncyber-flirting). \nSome offline flirting behaviours are not so easy to translate online. For example, \nit is difficult to find substitutes for olfactics, vocalics and proxemics. Online participants \ndo not know what the person they are chatting with smells like, nor are they allured by \ntheir sexy deep voice. The subtleties of voice, such as pitch and tone, are not evident \nonline. Pauses in conversation might be attributed to a poor Internet connection, or bad \ntyping skills, as opposed to a lack of interest. Individuals also cannot indicate attraction \nonline by leaning closer to another or by mirroring their body movements.  \nCyber-flirting 7 \n \nGender differences \nIn addition to considering how the body might be represented in flirtatious \nbehaviour online, this study examined whether similar gender differences characteristic \nof offline flirting were evident in online flirting. Evolutionary psychologists contend that \nin considering courting behaviours we need to examine the resources that men and \nwomen contribute to  mating and potential offspring (e.g., Buss, 1988;  Trost & Alberts, \n1998). They suggest that women contribute their physical bodies, which should indicate \ngood health, youthfulness and fertility. In contrast, some of the important defining \ncharacteristics for men include physical dominance, and an ability to produce resources \n(e.g., social status, ambition, and high income). Indeed research has found evidence to \nsupport these assumptions. Men, more than women, rate physical attractiveness to be an \nimportant quality in a partner (Kenrick, Sadalla, Groth, & Trost, 1990; Travis, 1977). \nWomen, more than men, rate traits reflecting dominance and social status as an important \ncharacteristic in selecting a potential partner (Kenrick, Groth, Trost, & Sadalla, 1993; \nKenrick et al., 1990).  \n If men and women place more importance on some attractive qualities than \nothers, we would, in turn, expect men and women to flirt in different ways in order to \naccentuate these characteristics. Moore (1985) contends that women are not passive in \nthe courting process, but rather, in the main, control much of the flirting process. Her \nresearch has observed women in places, such as singles bars. She identified 52 different \nnon-verbal displays by women, which she argued were courtship signals that served to \nattract and elicit the approach of men. These included gestures such as facial and head \nCyber-flirting 8 \npatterns, smiling, laughing, touch, leaning and primping. In addition to Moore’s (1985) \nresearch, others have argued that women posses a larger repertoire of flirtation strategies \nused to signal interest in men (e.g., Muehlenhard, Koralewski, Andrews, & Burdick, \n1986). Hall (1984), for instance, has purported that women gate at interaction partners \nmore, and use touch and body movements more in interpersonal interactions. McCormick \nand Jones (1989) observed 70 couples and found that women  were more active \nparticipants  in flirtation and were often the initiators of the flirtation. Trost and Alberts \n(1998) reported that, in contrast to women, men were more likely to flirt by signalling \nstatus and dominance, which is often achieved by flashing money, exaggerating their \nincome, wearing expensive clothes, bragging about their superior intelligence, and \nexaggerating their level of sexual popularity.  \nThese gender differences are not simply confined to face-to-face encounters. \nResearch conducted in the 1970s found that women in personal ads were more likely to \noffer attractiveness and seek financial security, while men were more likely to offer \nfinancial security and seek attractiveness (Harrison & Saeed, 1977). Smith, Waldorf and \nTrembath (1990) analysed personal ads from six issues of ‘On the Scene’ magazine from \nJanuary 1989 to June 1989. They were interested in what attractive qualities individuals \nwere seeking in a partner. Not surprisingly, these researchers found that physical \nattractiveness was the highest ranking quality desired by men and in fact appeared more \nthan twice as often in men’s ads than it did in women’s ads. Women, in contrast, were \nmore likely to hope for a man who is understanding, emotionally healthy and is \nfinancially stable. Koestner and Wheeler (1988) examined what attractive features men \nand women were more likely to emphasise about themselves in lonely hearts columns. \nCyber-flirting 9 \nAgain, these researchers found that men were more likely than women were to emphasise \ntheir own educational and occupational status.  \n \nTranscending gender roles on the Internet? \nTo date, little is known about gender differences in courting behaviour and \nattraction online. Some theorists have suggested that cyberspace is a place where people \nare liberated to be whoever they want to be (e.g., Turkle, 1995). Applying Turkle’s \nunderstandings of cyberspace, this is possibly a place where individuals can transcend \ngender roles when it comes to flirtatious behaviour. In contrast to Turkle’s view, some \nresearch suggests that the trends that exist in offline relationships are replicated online. \nFor example, it has been found that in Chat Rooms men, more than women, lie or \nexaggerate details about their education, occupation and income (Whitty, 2002). Scharlott \nand Christ’s (1995) work also sheds some light on gender differences and attraction in an \nonline dating site. These researchers surveyed people in 1990 using an Internet dating site \ncalled ‘Matchmaker’. At the time, photos and videos were not a feature of the service, \nhowever, participants were able to rate their attractiveness on a scale from very good \nlooks to below average. These individuals also included other details about themselves \nincluding income. Scharlott and Christ (1995) found that “many heterosexual users of \nMatchmaker largely conform to the gender-specific roles traditionally ascribed to \n‘available’ men and women” (p. 201). In their study men were more likely to initiate \ncontact and women were more likely to take on a more passive role. Moreover, the \nwomen who rated their own appearance as above average or very good received more \nCyber-flirting 10 \nmessages from men than the women who rated themselves as average. Interesting, the \nsame result did not occur for men.  \nFor the purposes of this study, chatrooms were chosen, as text was the primary \nmode of communication in these spaces at the time of the study; unlike, for example, \nonline dating sites which typically have photographs displayed. Drawing on the research \ndescribed in this paper, the following hypotheses were generated: \nH1:  That the body (or depictions of it) will be used to flirt with as frequently in Chat \nRooms as it is face-to-face situations. \nH2: Women will flirt more frequently than men both in Chat Rooms and in face-to-\nface situations by employing non-verbal signals (or substitutes online for these \nsignals), such as smiling and eye-gaze, laughing (or indicating laughter online) \naround someone they are attracted to, using touch (or indicating the use of touch \nonline), and by emphasising physical attractiveness. \nH3: Men will flirt more frequently than women both in Chat Rooms and in face-to-\nface situations by describing their social economic status, and by initiating contact \nwith someone they find attractive. \n \nMETHOD \nParticipants \nParticipants who had used Chat Rooms were invited to participate in the study. \nFive thousand, six hundred and ninety seven individuals completed the survey, of which \n3554 (62%) were women and 2143 (38%) were men. Although a limitation of the survey, \nin order to eliminate bias, only heterosexuals were invited to participate in the study. \nAges ranged from 18 to 70 years with a mean of 23 years (SD = 8.28) years. Seventy \nCyber-flirting 11 \npercent of the sample had a high school education, 14% had completed a diploma or a \ncertificate, 13% a degree, and 3% post-graduate qualifications. Fifty-five percent of the \nsample were single, 29% had a boyfriend or girlfriend, 11% were married or cohabiting, \n4% were separated or divorced, and 1% did not answer. Seventy four percent had formed \na romantic relationship with someone they had met offline, while 23% had formed a \nromantic relationship with someone they had met online. Thirty five percent had met up \nwith someone face-to-face whom they had first encountered online. Fifty-nine percent of \nthe sample stated they flirted more frequently offline, 22% online, 13% the same, and 6% \ndid not flirt. The sample consisted of individuals from a range of countries, with 69% \nfrom America and Canada completing the survey, 16% from Australia and New Zealand, \n6% from the UK, 2% from Europe, 2% from Asia, 1% from South America, 0.5% from \nthe Middle East and 0.2% from Africa (the remainder of the participants did not state \ntheir country of residence). \n \nMaterials \nFor this study a survey was constructed which focused on ways people flirt in \nface-to-face situations and how they flirt in Chat Rooms. Although a plethora of flirting \nbehaviours could have been selected for this study, given that the aims were to examine \nwhether the body can be reconstructed online to flirt with and to examine whether men \nand women flirt in traditionally defined ways, this study focussed on non-verbal \nbehaviours and substitutions of non-verbal behaviours online, descriptions of \nattractiveness and socio-economic status and the initiation of contact with another. \nCyber-flirting 12 \nPast research on traditional flirting was considered in the construction of the \nsurvey. In addition, substitute acts for flirting behaviour online were considered. \nParticipants were asked to rate on a 7-point Likert scale (1 = never, 7 = all the time) how \nfrequently they flirted by displaying particular behaviours to indicate attraction to \nanother. Participants were asked to consider flirtatious behaviour in face-to-face \nsituations and flirtatious behaviour in Chat Rooms. Some example of items included: “Do \nyou ever make an effort to look physically attractive so that you might attract \nanother\/others?” and “Do you ever use emoticons, such as smiley faces :-) or a wink ;-) to \nsignal to someone online that you are attracted to them?” Participants were asked if they \nflirted by describing income, and\/or education, and\/or occupation; making an effort to \nlook physically attractive; initiating conversation with someone they found attractive; \ndisplaying non-verbal gestures, such as smiling or eye gaze; and laughing and touch. \nParticipants were asked if they flirted online by describing income, and\/or education, \nand\/or occupation; describing oneself to appear physically attractive; initiating contact \nwith someone they met online; and by displaying non-verbal substitutes, such as \nemoticons; and by using acronyms, such as LOL (laugh out loud, lots of laughs) with \nsomeone they find attractive. \n \nProcedure \nFor this study, it was deemed insufficient to exclusively recruit participants via a \nweb survey. Given that such a method might have solely attracted regular Internet users \nand this study was interested in both offline and online flirting, it was decided to recruit \npeople both online and offline. Participants were recruited online by placing notices in a \nCyber-flirting 13 \nrandom selection of online newsgroups (these included religious, political, student and \nrelationships groups). With the increase in annoyance people are experiencing with spam, \nit was elected to place notices, rather than target individuals randomly within these \ngroups as studies have done in the past (e.g., Parks & Floyd, 1996). In addition, \nparticipants were targeted offline by inviting university students at the University of \nWestern Sydney, and by placing surveys in randomly selected cafes and libraries \nthroughout Sydney, Australia. Thirteen percent of the participants answered the survey \noffline and 87% answered the survey online. To eliminate problems with multiple \nsubmissions online IP addresses were logged. In both conditions participants were \nensured confidentiality and were able to withdraw consent up until the time of submitting \nthe survey. Participants were invited to complete the survey and place it in a provided \nlocked box. The survey ran continuously for 6 months. \n \n \n \nRESULTS \n \nAn analysis was originally performed to determine if there was any significant \ndifference between participants who completed the survey online compared to those that \ncompleted the survey offline as well as country of origin.  Given there were no significant \ndifferences this factor was not considered in the final analysis. \nTo test the first hypothesis paired t-tests were performed on the items that \nassessed the extent to which the body was depicted in flirting behaviour. As shown in \nTable 1, the first hypothesis was not supported for any of the items. \n \nTable 1 \nCyber-flirting 14 \nPaired t-tests for using the body to flirt with offline and online  \nVariable Offline flirting \nbehaviours \nM \n(SD) \nOnline flirt \nbehaviours \nM \n(SD) \nt \nAppearing physically \nattractive \n4.90 \n(1.48) \n2.28 \n(1.71) \n96.22*** \nNon-verbal (e.g., \nsmiles, emoticons) \n4.59 \n(1.45) \n3.50 \n(2.07) \n37.06*** \nLaugh (or acronyms, \nsuch as LOL) \n4.57 \n(1.48) \n3.45 \n(2.05) \n37.80*** \nTouch (or descriptions \nof touch) \n3.76 \n(1.61) \n2.21 \n(1.65) \n55.76*** \n* p < .05,   ** p < .01, *** p < .001 \n Given that the majority of the participants (59%) stated that they flirted more \nfrequently offline this it is perhaps not surprising. To explore this further, each of the \nflirting behaviours were considered for whether participants claimed to flirt more \nfrequently offline, online, or both the same (note: those who claimed not to flirt were not \nincluded in this analysis). A MANOVA was performed using the online and offline \nflirting behaviours as the dependent variables, and place were individuals flirted more \nfrequently as the independent variable. Applying an α-level of 0.05, there was a \nstatistically significant difference on the combined dependent variables F(24, 10194) = \n109.67, p < .001; Wilks’ Lambda = .63; partial eta squared = .21. The dependent \nvariables were then considered separately. Table 2 presents the Univariate F-tests, using \nan α-level of .05. It is noteworthy to point out that according to Cohen (1988) these effect \nsizes are mostly moderate. \nTable 2 \nFrequency differences for online and offline flirting items. \n \nCyber-flirting 15 \nVariable Flirt \nmore \noffline \nM \n(SD) \nFlirt \nmore \nonline \nM \n(SD) \nSame \n \n \nM \n(SD) \nF η2 \nOffline \nAttractiveness \n5.03 \n(1.41) \n4.87 \n(1.46) \n4.91 \n(1.51) \n7.00** .003 \nOffline Non-\nVerbal \n4.84 \n(1.32) \n4.23 \n(1.40) \n4.87 \n(1.43) \n91.59*** .04 \nOffline Laugh 4.71 \n(1.38) \n4.48 \n(1.46) \n4.72 \n(1.50) \n11.49*** .004 \nOffline Initiate 4.42 \n(1.27) \n3.76 \n(1.30) \n4.38 \n(1.31) \n117.05*** .04 \nOffline Touch 4.02 \n(1.55) \n3.28 \n(1.50) \n4.03 \n(1.54) \n106.19*** .04 \nOffline SES 2.05 \n(1.32) \n2.13 \n(1.44) \n2.14 \n(1.50) \n2.55 .001 \n      \nOnline \nAttractiveness \n2.05 \n(1.57) \n2.92 \n(1.91) \n2.58 \n(1.82) \n124.60*** .047 \nOnline Non-\nverbal \n2.97 \n(1.95) \n4.68 \n(1.76) \n4.52 \n(1.88) \n455.69*** .151 \nOnline Laugh 2.97 \n(1.95) \n4.54 \n(1.81) \n4.36 \n(1.88) \n375.56*** .128 \nOnline Initiate 2.53 \n(1.72) \n4.23 \n(1.62) \n4.01 \n(1.80) \n553.49*** .178 \nOnline Touch 1.78 \n(1.35) \n3.22 \n(1.85) \n2.86 \n(1.80) \n448.27*** .149 \nOnline SES 1.97 \n(1.54) \n2.71 \n(1.94) \n2.42 \n(1.79) \n98.28*** .037 \n* p < .05,   ** p < .01, *** p < .001 \n \nPerhaps not surprisingly, Bonferroni post-hoc comparisons revealed that \nindividuals who flirted more frequently face-to-face were more likely than individuals \nwho flirted online, to flirt in face-to-face situations by emphasising attractiveness, using \nnon-verbal signals and laughter, initiating contact, and by using touch. Comparisons also \nshowed that individuals who flirted more frequently online emphasised attractiveness  \nmore than individuals who flirted face-to-face or flirt as much online as they do offline. \nFurthermore, individuals who flirted more frequently online, were more likely than \nCyber-flirting 16 \nindividuals who flirted more frequently face-to-face to use substitutes for non-verbal \ncues, initiate contact, use descriptions of touch, and emphasise socio-economic status. \nInterestingly, an inspection of the means revealed, that emphasising the body \noffline through attractiveness, non-verbally and through laughter appeared to be the more \nfavoured way to attract others for people who flirt more frequently offline. Nonetheless, \nthe body still appeared to play a significant part of cyber-flirting for people who flirt \nmore online, via non-verbal signals (such as emoticons) and by representing laughter. \nHowever, the emphasis of physical attractiveness appears to be downplayed.  \nA MANOVA was performed to investigate, sex differences in flirting behaviour. \nThe dependent variables included items that measured online and offline flirtatious \nbehaviour. Applying an α-level of 0.05, there was a statistically significant difference on \nthe combined dependent variables for sex F(12, 5440) = 38.73, p < .001; Wilks’ Lambda \n= .92; partial eta squared = .079. The dependent variables were then considered \nseparately. Table 3 presents the Univariate F-tests, an α-level of .05 was employed to \ndetermine significance. The effect sizes are relatively small (Cohen, 1988). \nTable 3 \nSex differences for online and offline flirting items. \nVariable Men Women F η2 \nOffline \nAttractiveness \n4.62 \n(1.57) \n5.08 \n(1.39) \n125.21*** .022 \nOffline Non-\nVerbal \n4.50 \n(1.48) \n4.65 \n(1.43) \n14.90*** .003 \nOffline Laugh 4.34 \n(1.51) \n4.72 \n(1.44) \n85.54*** .015 \nOffline Initiate 4.20 \n(1.36) \n4.18 \n(1.35) \n0.349 .000 \nOffline Touch 3.51 \n(1.62) \n3.93 \n(1.57) \n88.83*** .016 \nOffline SES 2.11 2.02 5.37* .001 \nCyber-flirting 17 \n(1.41) (1.32) \n     \nOnline \nAttractiveness \n2.15 \n(1.67) \n2.35 \n(1.73) \n16.69*** .003 \nOnline Non-\nverbal \n3.32 \n(2.02) \n3.61 \n(2.09) \n25.68*** .005 \nOnline Laugh 3.25 \n(2.00) \n3.57 \n(2.07) \n32.41*** .006 \nOnline Initiate 3.22 \n(1.86) \n2.96 \n(1.87) \n23.91*** .004 \nOnline Touch 2.31 \n(1.67) \n2.15 \n(1.64) \n12.07** .002 \nOnline SES 2.17 \n(1.69) \n2.17 \n(1.69) \n.017 .000 \n* p < .05,   ** p < .01, *** p < .001 \n Hypothesis 2 was partially supported by the results. Women did flirt more than \nmen in face-to-face situations by displaying non-verbal signals, with laughter, touch and \nby making an effort with their appearance. Online, women flirted more than men using \nsubstitutes for non-verbal cues (such as emoticons), using substitutes for laughter (such \nas acronyms like LOL), and by describing themselves as physically attractive. However, \ncontrary to what was predicted, men scored higher on indicating touch in their flirting \nonline.  \n Hypothesis 3 was also partially supported. Men, more than women, flirted in face-\nto-face situations by emphasising their socio-economic status. However, contrary to \nexpectations, men were not more likely to initiate contact offline. Online, however, men \nwere more likely than women to initiate contact but they were not as likely to emphasise \nSES more than women.  \n \n \nDISCUSSION \nCyber-flirting 18 \n In spite of some researchers’ claims that the Internet is more of a meeting of \nminds than of bodies, this study found some evidence that the body plays a significant \nrole in cyber-flirting in Chat Rooms. The data suggests that individuals are more likely to \nuse the body to flirt with offline. However, given that the majority of the sample stated \nthat they flirted more offline a second analysis was required. In this analysis people who \nclaimed to flirt more face-to-face were compared to people who claimed to flirt more \nonline and people who claimed to flirt online as much as they did offline. This \nhighlighted some significant differences. The results suggested that those who flirt more \nonline were able to translate the body through text. For example, kinetics (in the form of \nacronyms, such as LOL), oculesics (in the form of emoticons, such as a wink), \nspeech\/laughter and haptics (through descriptions in the text). Indeed, the representation \nof non-verbal cues and laughter appeared to be a popular way for individuals to cyber-\nflirt. This study goes some way in supporting previous theoretical arguments that the \nbody can be successfully translated online (Whitty, 2003, Whitty & Carr, 2003). \nHowever, it is possibly the more Internet savvy that are better able to do this (future \nresearch is required to test out this claim). Researchers have collectively argued that \nusing the body offline in isolation of verbal cues allows one to convey sexual interest \nwithout the high risk of possible humiliation, shame or possible rejection (Feinberg, \n1996; Koeppel, Montage, Miller, O’Hare and Cody, 1993, Moore, 1985). Although future \nresearch needs to consider the role of verbal cues online in more detail, this study does \nsuggest that we cannot dismiss the importance of the body altogether when it comes to \ninitiating relationships in Chat Rooms. \nCyber-flirting 19 \n While this current study does provide some evidence that we must consider the \npresence of the body more online, it must not be ignored that, in line with previous work, \nsuch as McKenna et al.’s, 2002, who focused on presentation of self online, it was found \nhere that how one physically looks does not play as an important role online as it does \noffline in the development of romantic relationships. Perhaps by overlooking how one \nactually looks, individuals are able to maintain some anonymity. In turn, being \nunidentifiable possibly creates more opportunities for individuals to feel free to open up \non the net (Whitty & Gavin, 2001).  \n In the main, men and women flirted in distinctively gender defined ways, both in \nface-to-face encounters and in Chat Rooms. Although the small effect sizes suggest that \nwe need to treat these results with caution, as predicted, women were more likely than \nmen were to flirt online and offline by employing non-verbal signals, laughing and \nemphasising physical attractiveness. The only item where this was not supported was \nwith descriptions of touch online, where men scored significantly higher than women did. \nPerhaps this is because the use of touch in face-to-face situations is a more subtle \nadvance than the descriptions of touch online. Moreover, future research might \ninvestigate what exactly these descriptions of touch are online (for example, are these \nmore explicitly sexual?). \n Hypothesis 3 was only partly supported. Men were not more likely than women \nwere to initiate contact in face-to-face situations with women they were attracted to. \nHowever, they were more likely than women were to emphasise SES. In contrast, online \nmen were more likely to make initial contact, but were not more likely to emphasise SES. \nPerhaps men were more likely to make initial contact online, as the anonymity that the \nCyber-flirting 20 \nInternet provides allows men to feel less inhibited than they would in face-to-face \nencounters.  \n The gender differences revealed in this research were interesting. Despite the \nchanges that the women’s movement has brought about and the increased likelihood that \nwomen can fend for and support themselves and their children, when it comes to \ninitiating relationships women still pay more attention to their resources, such as their \nphysical bodies. This appears to be evident across all mediums, including face-to-face, \npersonal ads and as this study has found in Chat Rooms. Despite the opportunities, as \narticulated so well by theorists such as Turkle (1995), that the Internet provides \nindividuals to play and experiment with identity, this study suggests that gender roles are \nnot easily transcended online. However, this study only partly supports an evolutionary \napproach (see Buss, 1988), suggesting that other theories need to be developed to explain \nthese gender differences. \n This study provides us with some important insights into how men and women \nflirt online compared to face-to-face encounters. Nevertheless, there are some limitations \nto this research that are necessary to point out, which future studies might want to \nconsider. One of these being that flirting is not necessarily an entirely conscious \nbehaviour. For example, people do not typically consciously dilate their pupils to indicate \nsexual interest in others, nor do they always consciously flirt by displaying an eyebrow \nflash, accompanied by a hair toss. This makes it difficult to measure flirtatious behaviour \nwith self-report questionnaires. Self reports on behaviour cannot guarantee that \nindividuals behave in the same way they report they do in surveys. Moore (1985) \nattempted to overcome this limitation by using observational methods. However, her \nCyber-flirting 21 \nstudy also had its shortcomings, in that it is also difficult to ascertain for certain whether \nthe non-verbal signals she observed were truly flirtatious signals (conscious or \nunconscious). Of course observing flirtatious behaviour online is fraught with difficulties. \nFirstly, it is more difficult to determine if what is being said is flirtatious and secondly \nthere are a number of ethical issues to consider (see Whitty, 2004). Considering this in \nanother light, however, people could possibly be more aware of what they do to flirt \nonline as communication online is typically more thoughtful and strategic. Hence, self \nreports might be the most appropriate tool to employ to measure cyber-flirting. Future \nresearch might give further consideration to this question. \n Another limitation of this study was the list of items chosen to consider flirtatious \nbehaviours. Future research, for instance, might consider a broader ranger of behaviours, \nwith more attention to verbal flirtation. Of course, it is also acknowledged here that more \nresearch is required to confidently determine how the body is represented in online \nflirting.  \n  Rather than considering the Internet as one generic space, future studies might \ncontinue to consider how men and women flirt in different spaces on the Internet. Spaces \nsuch as MUDs and MOOs (multiple-user dungeon, or more commonly understood these \ndays to mean multi-user dimension or domains) which were originally a space where \ninteractive role-playing games could be played, very similar to Dungeons and Dragons, \nmight be considered further. In this space we find people experimenting with and playing \nwith multiple characters. We might predict that individuals playing in these spaces might \nfind it easier to flirt than other online places. We would also perhaps expect that online \ndating sites, where the expectation is to find someone romantically to hook up with, are \nCyber-flirting 22 \none of the more popular sites to flirt on in cyberspace. However, given the expectations \nto put up photos of oneself, future research might find in these spaces online physical \nappearance does play an important role. Spaces such as newsgroups (spaces on the \nInternet devoted to the discussion of a specific topic) possibly create less opportunity for \nindividuals to cyber-flirt. The type of topic and whether people reveal who they really are \ncan alter the dynamics of such as space. \n \nConclusions \nOverall, these results are important because they give a general overview of how \nmen and women flirt online compared to offline. Despite changes in our social \nconditions, and the possibilities of experimenting with new roles online, both online and \noffline, women tend to flirt more than men by emphasising physical attributes. This study \nchallenges the oft-touted claim by theorists that the Internet is a place where there is a \nmeeting of minds, in absence of the body (McRae, 1996). Instead, it is suggested here \nthat researchers need to focus more on how the body is reconstructed on the Internet. This \nstudy suggests that in Chat Rooms physical appearance is downplayed, however, that the \nbody is nevertheless represented in emoticons and acronyms. In conclusion, these results \nhighlight that the empirical and theoretical examination of how we might conceptualise \nflirting online is worthy of further investigation.  \n \nCyber-flirting 23 \nREFERENCES \n Buss, D. M. (1988). The evolution of human intrasexual competition: Tactics of \nmate attraction. Journal of Personality and Social Psychology, 54 (4), 616-628. \nCohen, J. (1988). Statistical power analysis for the behavioral sciences. Hillsdale, \nNJ: Erlbaum. \n Feinberg, L. S. (1996). Teasing: Innocent fun or sadistic malice? Far Hills, NJ, \nUS: New Horizon Press. \n Givens, D. (1978). The nonverbal basis of attraction: Flirtation, courtship, and \nseduction. Psychiatry, 41, 346-359. \n Hall, J. A. (1984). Nonverbal sex differences: Communication accuracy and \nexpressive style. Baltimore: Johns Hopkins University Press. \nHarrison, A. &  Saeed, L. (1977). Let’s make a deal: An analysis of revelations \nand stipulations in lonely hearts advertisements. Journal of Personality and Social \nPsychology, 38, 604-617. \n Kenrick, D. T., Groth, G. E., Trost, M. R., & Sadalla, E. K. (1993). Integrating \nevolutionary and social exchange perspectives on relationships: Effects of gender, self-\nappraisal, and involvement level on mate selection criteria. Journal of Personality and \nSocial Psychology, 64(6), 951-969. \n Kenrick, D. T., Sadalla, E. K., Groth, G., & Trost, M. R. (1990). Evolution, traits, \nand the stages of human courtship: Qualifying the parental investment model. Journal of \nPersonality, 58(1), 97-116. \n Koeppel, L. B., Montagne Miller, Y., O'Hair, D., & Cody, M. J. (1993). Friendly? \nFlirting? Wrong?, In P. J. Kalbfleisch (Ed). (1993). Interpersonal communication: \nCyber-flirting 24 \nEvolving interpersonal relationships. Communication. (pp. 19-45). Hillsdale, N. J.: \nErlbaum. \n Koestner, R., & Wheeler, L. (1988). Self-presentation in personal advertisements: \nThe influence of implicit notions of attraction and role expectations. Journal of Social and \nPersonal Relationships, 5(2), 149-160. \n McCormick, N. B., & Jones, A. J. (1989). Gender differences in nonverbal \nflirtation. Journal of Sex Education and Therapy, 15(4), 271-282. \n McCown, J. A., Fischer, D., Page, R., & Homant, M. (2001). Internet \nrelationships: People who meet people. CyberPsychology and Behavior, 4(5), 593-596. \nMcKenna, K. Y. A., Green, A. S., and Gleason, M. E. J. (2002). Relationship \nformation on the Internet: What's the big attraction? Journal of Social Issues, 58, 659-\n671. \n McRae, S. (1996). Coming apart at the seams: Sex, text and the virtual body. In L. \nCherny & E. R. Weise (Eds.), Wired women: Gender and new realities in cyberspace (pp. \n242-263). New York: Seal Press. \n Moore, M. M. (1985). Nonverbal courtship patterns in women: Context and \nconsequences. Ethology and Sociobiology, 6(4), 237-247. \n Muehlenhard, C. L., Koralewski, M. A., Andrews, S. L., & Burdick, C. A. (1986). \nVerbal and nonverbal cues that convey interest in dating: Two studies. Behavior Therapy, \n17(4), 404-419. \n Parks, M. R., & Floyd, K. (1996). Making friends in cyberspace. Journal of \nCommunication, 46(1), 80-97. \nCyber-flirting 25 \n Parks, M. R., & Roberts, L. D. (1998). \"Making MOOsic\": The development of \nPersonal Relationships on-line and a comparison to their off-line counterparts. Journal of \nSocial and Personal Relationships, 15, 517-537. \nScharlott, B. W. & Christ, W. G. (1995). Overcoming relationship-initiation \nbarriers: The impact of a computer-dating system on sex role, shyness, and appearance \ninhibitions. Computers in Human Behavior, 11 (2), 191-204. \nSimmel, G. (1984). Georg Simmel: On women, sexuality, and love. Translated \nand edited by Kurt H. Wolff. New York: The Free Press. \nSmith, J. E., Waldorf, V. A. & Trembath, D. L. (1990). \"Single white male \nlooking for thin, very attractive…\" Sex Roles, 23 (11\/12), 675-685. \n Travis, C. (1977). Men and women report their views on masculinity. Psychology \nToday, 10, 34-42. \n Trost, M. R., & Alberts, J. K. (1998). An evolutionary view on understanding sex \neffects in communicating attraction. In D. J. Canary (Ed.), Sex differences and \nsimilarities in communication. Critical essays and empirical investigations of sex and \ngender in interaction (pp. 233-255). Mahwah, NJ, US: Lawrence Erlbaum Associates Inc \nPublishers.. \n Turkle, S. (1995). Life on the screen: Identity in the age of the Internet. London: \nWeidenfeld & Nicolson. \n Whitty, M. T. (2002). Liar, Liar! An examination of how open, supportive and \nhonest people are in Chat Rooms. Computers in Human Behavior, 18(4), 343-352. \n Whitty, M. T. (2003). Cyber-flirting: Playing at love on the Internet. Theory and \nPsychology, 13 (3), 339-357. \nCyber-flirting 26 \n Whitty, M.T. (2004). Peering into online bedroom windows: Considering the \nethical implications of investigating Internet relationships and sexuality. In E. Buchanan \n(Ed.), Readings in Virtual Research Ethics: Issues and Controversies (pp. 203-218). \nHershey, USA: Idea Group Inc. \nWhitty, M.T. & Carr, A.N. (2003). Cyberspace as potential space: Considering \nthe web as a playground to cyber-flirt. Human Relations, 56 (7), 861-891. \n Whitty, M. T., & Gavin, J. K. (2001). Age\/Sex\/Location: Uncovering the social \ncues in the development of online relationships. CyberPsychology & Behavior, 4(5), 623-\n630. \n"}