{"doi":"10.1142\/S0219493705001432","coreId":"70944","oai":"oai:eprints.lancs.ac.uk:9328","identifiers":["oai:eprints.lancs.ac.uk:9328","10.1142\/S0219493705001432"],"title":"Inference of systems with delay and applications to cardiovascular dynamics","authors":["Bankrivskyy, A.","Luchinsky, Dmitry G.","McClintock, Peter V. E.","Smelyanskiy, V. N.","Stefanovska, Aneta"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-06","abstract":"A Bayesian inference technique, able to encompass stochastic nonlinear systems, is described. It is applicable to differential equations with delay and enables values of model parameters, delay, and noise intensity to be inferred from measured time series. The procedure is demonstrated on a very simple one-dimensional model system, and then applied to inference of parameters in the Mackey-Glass model of the respiratory control system based on measurements of ventilation in a healthy subject. It is concluded that the technique offers a promising tool for investigating cardiovascular interactions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70944.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9328\/1\/wittenberglancsrPostPrint.pdf","pdfHashValue":"2a4ad9ba8db90aea1c20691b2666c0532289b5be","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9328<\/identifier><datestamp>\n      2018-01-24T03:21:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Inference of systems with delay and applications to cardiovascular dynamics<\/dc:title><dc:creator>\n        Bankrivskyy, A.<\/dc:creator><dc:creator>\n        Luchinsky, Dmitry G.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Smelyanskiy, V. N.<\/dc:creator><dc:creator>\n        Stefanovska, Aneta<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        A Bayesian inference technique, able to encompass stochastic nonlinear systems, is described. It is applicable to differential equations with delay and enables values of model parameters, delay, and noise intensity to be inferred from measured time series. The procedure is demonstrated on a very simple one-dimensional model system, and then applied to inference of parameters in the Mackey-Glass model of the respiratory control system based on measurements of ventilation in a healthy subject. It is concluded that the technique offers a promising tool for investigating cardiovascular interactions.<\/dc:description><dc:date>\n        2005-06<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9328\/1\/wittenberglancsrPostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1142\/S0219493705001432<\/dc:relation><dc:identifier>\n        Bankrivskyy, A. and Luchinsky, Dmitry G. and McClintock, Peter V. E. and Smelyanskiy, V. N. and Stefanovska, Aneta (2005) Inference of systems with delay and applications to cardiovascular dynamics. Stochastics and Dynamics, 5 (2). pp. 321-331. ISSN 0219-4937<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9328\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1142\/S0219493705001432","http:\/\/eprints.lancs.ac.uk\/9328\/"],"year":2005,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"November 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nStochastics and Dynamics\nc© World Scientific Publishing Company\nINFERENCE OF SYSTEMS WITH DELAY\nAND APPLICATIONS TO CARDIOVASCULAR DYNAMICS\nA. BANDRIVSKYY, D .G. LUCHINSKY, P. V. E. McCLINTOCK\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, UK.\na.bandrivskyy@gmx.net, d.luchinsky@lancaster.ac.uk, p.v.e.mcclintock@lancaster.ac.uk\nV. N. SMELYANSKIY\nNASA Ames Research Center, MS 269-2, Moffett Field, CA 94035-1000, USA.\nVadim.N.Smelyanskiy@nasa.gov\nA. STEFANOVSKA\nNonlinear Dynamics and Synergetics, Faculty of Electrical Engineering,\nUniversity of Ljubljana, Trzˇasˇka 25, 1000 Ljubljana, Slovenia.\naneta@osc.fe.uni-lj.si\nReceived (Day Month Year)\nRevised (Day Month Year)\nA Bayesian inference technique, able to encompass stochastic nonlinear systems, is de-\nscribed. It is applicable to differential equations with delay and enables values of model\nparameters, delay, and noise intensity to be inferred from measured time series. The\nprocedure is demonstrated on a very simple one-dimensional model system, and then\napplied to inference of parameters in the Mackey-Glass model of the respiratory control\nsystem based on measurements of ventilation in a healthy subject. It is concluded that\nthe technique offers a promising tool for investigating cardiovascular interactions.\nKeywords: Stochastic delay equation; cardiovascular dynamics; Bayesian inference.\nAMS Subject Classification: 34K50, 62F15, 92C30\n1. Introduction\nThe inference of unobserved parameters in a stochastic dynamical model from mea-\nsured time series is a problem of huge practical importance, and one that arises in a\nvariety of different contexts. In systems with noise, unobserved parameters have to\nbe estimated rather than evaluated, and the process of inference is therefore based\non an analysis of probabilities. Thus, if some parameter is to be estimated, the\nwhole distribution has to be computed rather than just a single number.\nThe well-established framework for model inference from data is based on Bayes’\ntheorem, which relates the statistical distribution of model parameters after the\nmeasurement is made (posterior) to the statistical distribution of the model param-\neters prior to the measurement (prior) and to the probabilistic model of measure-\n1\nPublished in Stoch. Dynamics 5, 321-331 (2005).\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\n2 Bandrivskyy, Luchinsky, McClintock, Smelyanskiy & Stefanovska\nment itself (likelihood). The problems of how to construct the necessary probabili-\nties, in particular the likelihood, and how to compute the posterior probability can\nbe highly challenging. There does not yet exist any general theory of how to carry\nout inference for nonlinear systems with dynamical noise. Existing approaches that\nassume both dynamical and measurement noise rely on heavy numerical techniques,\nsuch as the Markov chain Monte Carlo (MCMC) method, to generate Bayesian con-\nditional probabilities [9, 1]. In the Bayesian method for estimation of noise levels\nsuggested [4] by Heald and Stark it was assumed, however, that all other param-\neters of the dynamical model are known. In [2] a method for Bayesian statistical\nmodel inference was developed and applied to reconstruction of nonlinear dynamical\nnoise-driven systems. However it relies on global optimization techniques such as\nsimulated annealing to achieve the result. Recently a new Bayesian model inference\nalgorithm was proposed [10, 11] that avoids extensive nonlinear optimization and\nrequires only quadratic optimization in the space of model parameters to infer their\nmean values and variances from the trajectory measurements. A version of this al-\ngorithm for a one-dimensional noise driven dynamical system was developed in [12]\nin the context of the coupled-oscillator model [13] of cardiovascular dynamics.\nIn this paper we extend the theory [12] to encompass the problem of model\nidentification from time-series data derived from noisy nonlinear dynamical systems\nwith time delay, treating the delay as an unknown parameter. In Sec. 2 we outline\nthe derivation of the inference algorithm for the particular case of a one-dimensional\nstochastic system with time delay, extending the results [12, 10, 11]. In Sec. 3 we\nverify this method numerically using a one-dimensional system with time delay. In\nSec. 4 we apply it to fit the Mackey-Glass model to respiratory data, enabling us\nto extract important information about the cardiovascular system from measured\ntime series. Finally, we sum up and draw conclusions in Sec.5.\n2. The inference algorithm\nWe now take a one dimensional version (cf.[12]) of the inference algorithm derived\n[10, 11] and extend it to a system with time delay of the form\nx˙ = K(x(t), x(t − τ)|c) + ξ(t), (2.1)\n〈ξ(t)〉 = 0, 〈ξ(t)ξ(0)〉 = Dδ(t),\nwhere K(x(t), x(t−τ)|c) is a deterministic drift force, ξ(t) is white zero-mean Gaus-\nsian noise, D is the noise intensity, and τ is the time delay. We assume that the\nunknown deterministic force can be represented in the form\nK(x(t), x(t− τ)|c) =\nL∑\nl=1\nclfl(x(t), x(t − τ)), (2.2)\nwhere fl(x(t), x(t − τ)) are known model base functions, and c = {cl} is a set of\nunknown coefficients that have to be inferred from the experimentally measured\ntime series x(t). We assume that the measurement error is negligible compared to\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nInference of dynamical systems with time-delay and application to cardiovascular dynamics 3\nthe intrinsic dynamical noise ξ(t), and we treat the state variable x(t) as directly\nobservable.\nThe conditional probability density function (PDF) L(x|c) for the system to\nhave the trajectory x(t) for a given choice of model parameters c can [9, 3, 8] be\nwritten as\nL(x|c) = ρst(x(t0)|c)ρc [x(t)] .\nHere ρst(x|c) is a stationary PDF of the system (2.1) and ρc[x(t)] is a probability\ndensity functional of the observed stochastic trajectory x(t). It can be expressed\nthrough the white noise path integral using the direct interrelation between the\nnoise variable ξ(t) and x(t) given by (2.1).\nConsider a time lattice ti = t0 + i h (i = 0, 1, . . . , N), with the step h = (tf −\nt0)\/N , and number of data points N . The time delay measured in h and can be\nwritten as τ = m · h, where m ≥ 1. Then the probability density functional for\nwhite noise defined on a time lattice {ti} can be written as\nρ[ξi] =\nN−1∏\ni=m\n1√\n2piDh\ne−ξ\n2\ni\n\/2Dh =\n1\n(2piDh)N\/2\nexp\n(\n−\nN−1∑\ni=m\nξ2i\n2Dh\n)\n.\nNote that the first instant of time in the equations above is shifted to m to allow for\nthe time delay. Denoting x(ti) ≡ xi and x(ti − τ) ≡ xi−m we use a discrete version\nof the model equation (2.1)\nxi+1 − xi = hK\n(\nxi+1 + xi\n2\n, xi−m|c\n)\n+ ξi\nto obtain the probability density functional for the stochastic variable x\nρc[xi] =\n1\n(2piDh)\nN\/2\nJ(x) exp\n(\n−\nN−1∑\ni=m\n[∆xi − hKi,m]2\n2Dh\n)\n.\nHere we denote ∆xi ≡ xi+1 − xi, Ki,m ≡ K (xi, xi−m|c), and\nJ(x) = exp\n(\n−h\n2\nN−1∑\ni=m\n∂Ki,m\n∂x\n)\n, (2.3)\nis the Jacobian of transformation from ξ to the x variable, which implies the pre-\npoint discretization scheme. The choice of the factor 1\/2 in the exponent is some-\nwhat ambiguous due to the singular nature of white noise, and our choice corre-\nsponds to the Stratonovich prescription [7, 3]. It is crucial to use the correct form\nof the Jacobian (2.3) in order to obtain a correct inference result.\nThe contribution to the likelihood due to the stationary probability density\nρst(x(t0)|c) can be neglected if N is large. Then finally the likelihood for the stochas-\ntic trajectory of the dynamical variable x, defined on the time lattice ti (t0 ≤ ti ≤ tf )\nfor a certain choice of parameters c may be written\nL(x|c) = 1\n(2piDh)N\/2\nexp\n(\n−1\n2\nN−1∑\ni=m\n[\nh\n∂Ki,m\n∂x\n+\n[∆xi − hKi,m]2\nDh\n])\n. (2.4)\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\n4 Bandrivskyy, Luchinsky, McClintock, Smelyanskiy & Stefanovska\nIn this derivation we assumed that the time step h is sufficiently small (h \u001c\n|∂K(x(t), x(t − τ)|c)\/∂x|−1) and therefore x(t − τ) was considered as a constant\nparameter during integration over small time step h. The same rule was applied to\ndifferentiation in ∂K(x(t), x(t− τ)|c)\/∂x|−1, where x(t− τ) considered as a param-\neter. We note that x(t) and x(t − τ) are always correlated and their independence\nis not required for the derivation of (2.4): the only requirement is that τ > h.\nPrior information about the model parameters is contained in the prior distri-\nbution ρ(c). Given a set of observations, one can improve the estimate of the model\nparameters by computing a posterior distribution ρ(c|x) taking advantage of Bayes’\ntheorem\nρ(c|x) = L(x|c)ρ(c)∫\nL(x|c)ρ(c)dc . (2.5)\nThe integral in the denominator in (2.5) ensures that the posterior probability is\nnormalized. Clearly, equation (2.5) can be applied iteratively each time a new record\nof measurements is used. The prior distribution in the next iteration is just the\nposterior distribution from the previous iteration. For a sufficiently large number N\nof observations in x, the posterior distribution ρ(c|x) becomes sharply peaked about\ncertain parameter values c corresponding to the most probable model of the system\nfor a given measurement set. We choose the prior distribution ρ(c) as a Gaussian\nform with respect to the unknown parameters c\nρ(c) =\n√\ndet A0\n(2pi)L\nexp\n[\n−1\n2\n(c− c0)A0(c− c0)T\n]\n.\nIf no initial knowledge about the model parameters is assumed, then c0 can be\nchosen as a vector with arbitrary initial parameter values and A0 can be chosen\nas a diagonal matrix with arbitrary but very small values of diagonal elements,\ncreating a noninformative prior distribution.\nThe normalization integral in the denominator of (2.5) can readily be evaluated\nand the posterior probability can be written as\nρ(c|x) =\n√\ndet(B\/D + A0)\n(2pi)L\nexp(−S(c|x)), (2.6)\nwhere the log-posterior function S(c|x) is\nS(c|x) = G +\n(\nγ − α\nD\n− c0A0\n)\ncT + c\n(\nB\n2D\n+\nA0\n2\n)\ncT . (2.7)\nHere G is a constant, given by\nG =\n(\nγ − α\nD\n− c0A0\n)(2B\nD\n+ 2A0\n)\n−1 (\nγ − α\nD\n− c0A0\n)T\n,\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nInference of dynamical systems with time-delay and application to cardiovascular dynamics 5\nand the superscript T denotes that a vector is transposed. We also define a scalar\nR, vectors α, γ, and a matrix B which are evaluated on the data set xi as\nαl =\nN−1∑\ni=m\n1\n2\n(xi+1 − xi) fl(xi, xi−m), xi = x(ti), l, k = 1, L, (2.8)\nBl k = h\nN−1∑\ni=m\n1\n4\nfl(xi, xi−m) fk(xi, xi−m), (2.9)\nγl =\nh\n2\nN−1∑\ni=m\n∂fl(xi, xi−m)\n∂x\n, R =\n1\n2h\nN−1∑\ni=0\n(xi+1 − xi)2 . (2.10)\nThe minimum of the log-posterior function (2.7) corresponds to the maximum of\nthe posterior distribution. So, minimizing S(c|x) with respect to the vector c we\nobtain an estimate of the mean value of the parameters\nc1 = (A1)\n−1\n(\nα\nD1\n+ c0A0 − γ\n)T\n, A1 =\nB\nD1\n+ A0 (2.11)\nwhere the matrix A1 defines the width of the posterior distribution. For a uniform\nprior distribution of the noise intensity D the mean value of D can be estimated as\nD1 =\n1\nN\n(\n2R− 2αcT0 + c0BcT0\n)\n. (2.12)\nIn this discussion we do not consider variance of the noise intensity D but note that\nthe estimation (2.12)improves, as the inferred model parameters c start to converge\ntowards their correct values.\nFor a given time delay τ the algorithm (2.8)-(2.12) can be applied iteratively:\nthe inferred mean values of the noise intensity D1, parameters c1 and the widths of\ntheir distributions are updated with each new block of data. Improved parameters\nc1 and the matrix A1 form the prior distribution for the next step of inference.\nHowever, for unknown τ the log-posterior function cannot be minimized ana-\nlytically in the general case when no prior information is given. It often happens,\nthough, that the time delay may be expected to vary within some range of possible\nvalues that are known when the model is built. Thus one can define a discrete grid\nof the time delay parameter τ , and then apply the iterative inference algorithm\n(2.8)-(2.12) for the set of fixed τ within a certain range. We note that this range\ncan be arbitrary large. The only condition is τ > h. For each fixed τ we find optimal\ncoefficients c and D. Then, using the inferred values of c and D we evaluate the\nlikelihood or the corresponding log-likelihood function\nSL(x|c) = N\n2\nln(2pihD) + γcT +\nR\nD\n− αc\nT\nD\n+\ncBcT\n2D\n.\non the data set xi, xi−m. Note that, if convergence of the parameters c and D has\nbeen achieved, the log-likelihood function can be simplified and evaluated as\nSL(x|c) = N\n2\nln(2pihD) + γcT +\nN\n2\n.\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\n6 Bandrivskyy, Luchinsky, McClintock, Smelyanskiy & Stefanovska\n0 2000 4000 6000 8000 10000 12000\n−1\n0\n1\n2\n t\n \ny(t\n)\n10 12 14 16 18 20\n−2038.6\n−2038.4\n−2038.2\n τ\n \nS L\n(τ)\n0 2000 4000 6000 8000 10000 12000\n−0.1\n−0.05\n0\nc 1\n0 2000 4000 6000 8000 10000 12000\n−0.05\n0\n0.05\nc 2\n0 2000 4000 6000 8000 10000 12000\n9.6\n9.8\n10\n10.2 x 10\n−3\ntime, s\nD\nFig. 1. Left column: the model signal y(t) (top), and inference of the time delay τ (bottom). Right\ncolumn: inference of all the other parameters of the model (3.13). The original (exact) model\nparameters were: c1 = −0.05, c2 = 0.02, τ = 15, D = 0.01.\nWe evaluate this function for each τ in a chosen range. Note that SL(x|c) depends\non τ via dependance on other inferred coefficients and first of all via dependance\non noise intensity D. The global minimum of the log-likelihood function reveals the\noptimal value of the time delay τ . The corresponding to the optimal τ parameters\nc and D can be picked up as a solution to the inference problem. Thus the outlined\nalgorithm allows for a straightforward extension to encompass inference of stochastic\nmodels with unknown time delay.\nWe note that one of the advantages of the suggested algorithm is its high ef-\nficiency. This makes it possible to achieve good convergence on very short time\nintervals (see for example parameter estimation of the Lorenz attractor in [10, 11].\nCorrespondingly, we can apply the algorithm to treat slowly varying parameters,\nas will be explained in more detail elsewhere. Nonetheless, the general problem of\nanalysing non-stationary data with arbitrarily strong non-stationarity in all param-\neters still remains an open challenge in nonlinear time-series analysis.\n3. Inference of models with a time delay\nIn this section we verify numerically the algorithm outlined above. As an example\nwe consider a simple model with a time delay\ny˙ = c1z + c2yz + ξ(t), (3.13)\nz = yτ = y(t− τ),\nwhere we choose c1 = −0.05, c2 = 0.02, the noise intensity D = 0.01, and the time\ndelay τ = 15. A signal generated by the model for given parameters is shown in\nFig. 1(top left). The dependance of the log-likelihood function SL(y, z|c) on τ for\nthe model system is shown in Fig. 1(bottom left). One can see that the inferred\nvalue of τ is correct. The inference process of all the parameters of the model for\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nInference of dynamical systems with time-delay and application to cardiovascular dynamics 7\n0 500 1000 1500\n0.05\n0.1\n0.15\n  time, s\n \n \nve\nn\ntil\nat\nio\nn\n0 0.05 0.1 0.15 0.2 0.25 0.3 0.35 0.40\n0.02\n0.04\n0.06\n0.08\n  frequency, Hz\n \n \nPS\nD\nFig. 2. The ventilation signal V (t) (left) and its power spectral density (right).\nτ = 15 is shown in Fig. 1(right). Again, one can see that the parameters converge\nto their correct values.\n4. Inference of the Mackey-Glass model of the respiratory control\nsystem\nMackey and Glass proposed [6] a simple dynamical model of breathing control in\nwhich the human respiratory control was considered as a closed loop system with\ntime delay. The model was subsequently extended [5] by Landa and Rosenblum to\ninclude the function of the brainstem respiratory center.\nThere are two state variables in the original Mackey-Glass model: V – ventila-\ntion, which is the volume of air that passes through the lungs during a single breath\nmultiplied by the frequency of respiration; and x – the partial pressure of CO2 in\nthe blood. The model was formulated as\nx˙ = λ− αxV, (4.14)\nV = Vm\nxnτ\nΘn − xnτ\n, (4.15)\nwhere xτ = x(t− τ), and τ is the time delay.\nThis simple model is able to reproduce both normal and pathological Cheyne-\nStokes breathing. The pathological or periodic breathing consists of short periods\nof deep and frequent breathing alternating with its complete cessation. One of the\nreasons for such behavior is abnormal blood circulation giving an increase in the\ntime between oxygenation of blood in the lungs and stimulation of chemoreceptors\nin the brainstem. This corresponds to an increase of the time delay τ in the model\n(4.14)–(4.15).\nIn this section we show an example of inference of the slow dynamics of the\nrespiratory control system. We slightly modify the existing model (4.14)-(4.15) and\nwe infer its parameters from an available recording of a respiration signal. In the\noriginal and the later extended models [6, 5], stochastic dynamics was not consid-\nered. However noise is an inherent feature of the respiratory control system, and\nto take it into account we introduce a stochastic term in the equation (4.14) for\nCO2 concentration x. Further, in order to formulate a simple model for inference\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\n8 Bandrivskyy, Luchinsky, McClintock, Smelyanskiy & Stefanovska\n1 1.5 2 2.5 3 3.5 4-6450\n-6350\n-6250\n-6150\n τ, s\nτ)\n \nS \n( L\n0 200 400 600 800 1000 1200 1400 1600 18000.03\n0.035\n0.04\n \nc 1\n0 200 400 600 800 1000 1200 1400 1600 1800−0.9\n−0.8\n−0.7\n \nc 2\n0 200 400 600 800 1000 1200 1400 1600 18003\n3.5\n4\n \nc 3\n0 200 400 600 800 1000 1200 1400 1600 18000\n0.000001\n0.000002\n time, s\n \nD\nFig. 3. Left: inference of the time delay τ for the modified Mackey-Glass model (4.18) from the\nconstructed ventilation signal V (t). Right column: inference of the other model parameters from\nthe constructed ventilation signal V (t) for the inferred time delay of τ = 2.1 s.\nwe approximate the CO2 response curve given in (4.15) as a linear function of xτ\nV (xτ ) = a + bxτ . (4.16)\nThis simple approximation is justified if the control system is working close to the\nlinear part of V (xτ ). The assumption is reasonable for normal and healthy breath-\ning patterns, but it would be not correct for pathological Cheyne-Stokes breathing,\nwhen the effect of saturation in the dependence of V (xτ ) on xτ is significant. As-\nsuming additive white Gaussian noise ξ(t), and substituting xτ from (4.16) into\nequation (4.14) we obtain a dynamical model for ventilation\nV˙ = λb + αaVτ − αV Vτ + ξ(t), (4.17)\nwhere Vτ = V (t−τ) and τ is the time delay. Finally, changing variables and notation\nwe rewrite (4.17) as\ny˙ = c1 + c2z + c3yz + ξ(t), (4.18)\ny = V, z = yτ = y(t− τ), 〈ξ(t)〉 = 0, 〈ξ(t)ξ(0)〉 = Dδ(t).\nIn order to apply the inference algorithm we require time series of the ventilation\nsignal V (t). We construct it from noninvasively measured respiratory efforta r(t)\nthrough the following procedure:\n(i) We identify maxima and minima of the r(t) signal and construct their slowly\nvarying envelopes. We suppose that the difference R(t) between these two\nenvelope functions is proportional to the volume of the air passing through\nthe lungs during a single breath.\n(ii) We construct the continuous respiration frequency function F (t), interpo-\nlating the distances between successive points. The procedure is similar to\naRecord TSID=516 from Lancaster Cardio database.\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nInference of dynamical systems with time-delay and application to cardiovascular dynamics 9\n0 500 1000 1500 2000\n0.06\n0.08\n0.1\n0.12\n  time, s\n \n \ny(t\n)\n0 0.05 0.1 0.15 0.2 0.25 0.3 0.35 0.40\n0.02\n0.04\n0.06\n0.08\n  frequency, Hz\n \n \nPS\nD\nFig. 4. Numerically generated ventilation signal y(t) from the model (4.18) based on the inferred\nparameters (left), and its power spectral density (right).\nthat used for construction of the heart rate variability (HRV) signal from\nthe ECG.\n(iii) Finally, the ventilation signal V (t) is computed as the product of R(t) and\nF (t). The signal and its power spectral density (PSD) are shown in Fig. 2.\nFollowing the procedure described previously we infer parameters c and D for a set\nof τ in a range from 0 s to 35 s. The behavior of the log-likelihood function near\nthe minimum is shown in Fig. 3(left). The result of inference of the model (4.18) for\nthe optimal (inferred) value of τ = 2.1 s is shown in Fig. 3(right). The estimated\nparameters are: c1 = 0.034; c2 = −0.68; c3 = 3.25; D = 1.4× 10−6. In order to get\nsome sense of whether the inference was successful, we numerically generate time\nseries of the model (4.18) using these inferred parameters.b Time series of the model\nstate variable y and its PSD are shown in Fig. 4. This result can be compared with\nthe original ventilation signal in Fig. 2. One can see that the model produces very\nsimilar behavior to the original ventilation signal V (t), in spite of the fact that\nthe inferred time delay parameter differs from that imposed in the original model\n[6, 5]. The question, whether this is due to simplification of the model, or indeed the\ninferred parameter corresponds to the physiological delay in the respiratory system,\nwe leave for future research.\n5. Summary and conclusions\nWe have demonstrated a new Bayesian inference technique and shown that it can\nsuccessfully be applied to stochastic nonlinear systems with delay. It enables us to\nextract model parameters from measured time series. We have tested the scheme\non a simple one-dimensional model with delay, and applied it to the Mackey–\nGlass model of respiratory control. For both systems the scheme converged well\nand yielded parameter values that were either correct or, in the latter case, plau-\nbNote that, because of the simplification of the model, it has unstable regions in phase space where\nits trajectories diverge. The stable region, where the system operates, is not well separated, and\nthe model system can be pushed away to the unstable region by a large burst of the stochastic force\nξ(t). In order to eliminate this possibility in the numerical analysis we estimated the boundary of\nstability (which is yb ≈ 0.13 for the given signal) and imposed a limitation y ≤ yb in the numerical\nalgorithm.\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\n10 REFERENCES\nsible. It seems, therefore, that it offers a promising way of inferring physiologically\nrelevant parameters from measured cardiovascular data.\nMuch remains to be done, however, before the technique can routinely be applied\nto the range of physiological systems that we would like to investigate. For example,\nthe scheme needs to be extended to treat the non-white noise commonly found in\nphysiology. In the medium\/longer term, we hope to be able to infer parameters\nand interaction constants in the coupled-oscillator model [13] of the cardiovascular\nsystem, leading in turn to improved early diagnosis and better assessment of the\nefficacy treatment, based on simple noninvasive measurements.\nAcknowledgements\nThe research was supported by the Engineering and Physical Sciences Research\nCouncil (UK), Leverhulme Trust (UK), NASA Intelligent Systems\/Intelligent Data\nUnderstanding program (USA), Ministry of Education, Science and Sport (Slovenia)\nand INTAS.\nReferences\n1. C. L. Bremer and D. T. Kaplan, Markov chain Monte Carlo estimation of\nnonlinear dynamics from time series, Physica D 160 (2001) 116–126.\n2. J.-M. Fullana and M. Rossi, Identification methods for nonlinear stochastic sys-\ntems, Phys. Rev. E 65 (2002) 031107.\n3. R. Graham, Path integral formulation of general diffusion processes, Z. Phys.\nB 26 (1977) 281–290.\n4. J. P. M. Heald and J. Stark, Estimation of noise levels for models of chaotic\ndynamical systems, Phys. Rev. Lett. 84 (1999) 2366–2369.\n5. P. Landa and M. Rosenblum, Modified Mackey-Glass model of respiration con-\ntrol, Phys. Rev. E 52 (1995) R36–R39.\n6. M. C. Mackey and L. Glass, Oscillations and chaos in physiological control\nsystems, Science 197 (1977) 287–288.\n7. A. J. McKane, H. C. Luckock and A. J. Bray, Path integrals and non-Markov\nprocesses. I. General formalism, Phys. Rev. A 41 (1990) 644–656.\n8. P. E. McSharry and L. A. Smith, Better nonlinear models from noisy data:\nAttractors with maximum likelihood, Phys. Rev. Lett. 83 (1999) 4285–4288.\n9. R. Meyer and N. Christensen, Bayesian reconstruction of chaotic dynamical\nsystems, Phys. Rev. E 62 (2000) 3535–3542.\n10. V. N. Smelyanskiy and D. G. Luchinsky, Inference of stochastic nonlinear os-\ncillators with applications to physiological problems, in Z. Gingl, J. M. San-\ncho, L. Schimansky-Geier and J. Kertesz (eds.), Noise in Complex Systems and\nStochastic Dynamics II, (Proc. SPIE), vol. 5471 (SPIE, Bellingham) (2004) pp.\n344–354.\n11. V. N. Smelyanskiy, D. A. Timuchin, D. Luchinsky and A. Bandrivskyy,\nNovember 9, 2004 9:2 WSPC\/INSTRUCTION FILE wittenberglancsr\nREFERENCES 11\nFast Bayesian inference of stochastic nonlinear systems (available at:\nhttp:\/\/arxiv.org\/abs\/cond-mat\/0409282), Phys. Rev. E submitted (2004).\n12. V. N. Smelyanskiy, D. A. Timucin, D. G. Luchinsky, A. Stefanovska, A. Ban-\ndrivskyy and P. V. E. McClintock, Time-varying cardiovascular oscillations, in\nN. S. Namachchivaya and Y. K. Lin (eds.), IUTAM Symposium on Nonlinear\nStochastic Dynamics (Kluwer, Amsterdam) (2003) pp. 455–464.\n13. A. Stefanovska and M. Bracˇicˇ, Physics of the human cardiovascular system,\nContemporary Phys. 40 (1999) 31–55.\n"}