{"doi":"10.1109\/49.898732","coreId":"211631","oai":"oai:eprints.lse.ac.uk:23577","identifiers":["oai:eprints.lse.ac.uk:23577","10.1109\/49.898732"],"title":"Internet service classes under competition","authors":["Gibbens, R.","Mason, R.","Steinberg, Richard"],"enrichments":{"references":[{"id":17224269,"title":"A stochastic equilibrium model of internet pricing,”","authors":[],"date":"1997","doi":"10.1016\/s0165-1889(96)00003-6","raw":"A. Gupta, D. O. Stahl, and A. B. Whinston, “A stochastic equilibrium model of internet pricing,” J. Economic Dynamics Contr., vol. 21, no. 4–5, pp. 697–722, 1997.","cites":null},{"id":17224262,"title":"Competitive price discrimination,” Mimeo,","authors":[],"date":"1999","doi":"10.2307\/2696383","raw":"M. Armstrong and J. Vickers, “Competitive price discrimination,” Mimeo, 1999.","cites":null},{"id":17224279,"title":"Congestion and game in capacity: A duopoly analysis in the presence of network externalities,”","authors":[],"date":"1989","doi":null,"raw":"A. de Palma and L. Leruth, “Congestion and game in capacity: A duopoly analysis in the presence of network externalities,” Annales d’Economie et de Statistique, no. 15–16, pp. 389–407, 1989.","cites":null},{"id":17224287,"title":"Efficient and competitive rationing,”","authors":[],"date":"1989","doi":"10.2307\/1912571","raw":"R. B. Wilson, “Efficient and competitive rationing,” Econometrica, vol. 57, no. 1, pp. 1–40, 1989. Richard Gibbens was born in London, England, in 1962. He obtained the B.A. degree in mathematics, from the University of Cambridge, the Diploma in Mathematical Statistics, and the Ph.D. degree in 1988. His doctoral thesis work, which was a collaborationbetweentheUniversityofCambridgeandBritish Telecom, was on the design and analysis of dynamic routingstrategiesintelecommunicationnetworks,resulting in the development of the dynamic alternative routing strategy now in operation in the British Telecom trunk network. He has worked in the area of modeling of communication networks, mainly at the Statistical Laboratory, University of Cambridge, but was also a Visiting Consultant at AT&T Bell Laboratories, Murray Hill, NJ, during 1989. Dr. Gibbens was awarded a Royal Society University Research Fellowship in 1993. Robin Mason received the Masters and Ph.D. degrees in economics from the University of Cambridge. He has held Research Fellowships at the Universities of Oxford and Cambridge. He is currently a Lecturer in the Economics Department at the University of Southampton. His work is on competition in and structure of network industries. Richard Steinberg received the B.A. degree from Reed College, the Ph.D. degree in combinatorics and optimizationfromtheUniversityofWaterloo,andthe MBA degree from the University of Chicago. Hehastaught attheUniversityofChicagoandColumbia University, and has served on the Technical Staffs of AT&T Bell Laboratories and GTE Laboratories. He is currently a Lecturer in Operations Management at the University of Cambridge in the Judge Institute of Management Studies.","cites":null},{"id":17224281,"title":"Endogenous qualitydifferentiationin congested markets,”","authors":[],"date":"1991","doi":"10.2307\/2098666","raw":"D.Reitman, “Endogenous qualitydifferentiationin congested markets,” J. Ind. Economics, vol. 39, no. 6, pp. 621–647, 1991.","cites":null},{"id":17224283,"title":"firms and market structure,”","authors":[],"date":"1990","doi":"10.2307\/2555492","raw":", “Multiproduct firms and market structure,” Rand J. Economics, vol. 21, pp. 45–62, 1990.","cites":null},{"id":17224266,"title":"Game Theory.","authors":[],"date":"1991","doi":"10.2307\/2554596","raw":"D. Fudenberg and J. Tirole, Game Theory. Cambridge, MA: MIT Press, 1991.","cites":null},{"id":17224271,"title":"Games with randomly disturbed payoffs: A new rationale for mixed strategy equilibrium points,”","authors":[],"date":"1973","doi":"10.1007\/978-94-017-2527-9_4","raw":"J. Harsanyi, “Games with randomly disturbed payoffs: A new rationale for mixed strategy equilibrium points,” Int. J. Game Theory, vol. 2, pp. 1–23, 1973.","cites":null},{"id":17224264,"title":"Internet cost allocation and pricing,”","authors":[],"date":"1997","doi":"10.3998\/3336451.0001.124","raw":"D. Clark, “Internet cost allocation and pricing,” in Internet Economics, L. W. McKnight and J. P. Bailey, Eds: MIT Press, 1997, pp. 215–252.","cites":null},{"id":17224284,"title":"Making greed work in networks: A game-theoretic analysis of switch service disciplines,” in","authors":[],"date":"1994","doi":"10.1145\/190314.190319","raw":"S. Shenker, “Making greed work in networks: A game-theoretic analysis of switch service disciplines,” in Proc. SIGCOMM Symp. Commun. Architectures Protocols, 1994, pp. 47–57.","cites":null},{"id":17224268,"title":"Multiproduct competition between congestible networks,”","authors":[],"date":"1998","doi":"10.2139\/ssrn.136739","raw":"R. J. Gibbens, R. Mason, and R. Steinberg, “Multiproduct competition between congestible networks,” Working Paper WP 26\/98, Judge Inst. Manage. Studies, Univ. Cambridge, Sept. 1998.","cites":null},{"id":17224274,"title":"On partial equilibrium in a queuing system with two servers,”","authors":[],"date":"1976","doi":"10.2307\/2297230","raw":"I. Luski, “On partial equilibrium in a queuing system with two servers,” Rev. Economic Studies, vol. 43, no. 3, pp. 519–525, 1976.","cites":null},{"id":17224277,"title":"Paris Metro pricing for the Internet,” in","authors":[],"date":"1999","doi":"10.1145\/336992.337030","raw":"A. Odlyzko, “Paris Metro pricing for the Internet,” in Proc. ACM Conf. Electronic Commerce (EC’99), ACM, 1999, pp. 140–147.","cites":null},{"id":17224278,"title":"Paris rail abolishes first-class travel,”","authors":[],"date":null,"doi":null,"raw":"D. Owen, “Paris rail abolishes first-class travel,” Financial Times,p .2 , Sept. 1, 1999.","cites":null},{"id":17224275,"title":"Pricing congestible network resources,”","authors":[],"date":"1995","doi":"10.1109\/49.414634","raw":"J. K. MacKie-Mason and H. R. Varian, “Pricing congestible network resources,” IEEE J. Select. Areas Commun., vol. 13, pp. 1141–1149, 1995.","cites":null},{"id":17224280,"title":"Quality of service provision in noncooperative networks with diverse user requirements,” Decision Support Systems,","authors":[],"date":"2000","doi":"10.1016\/s0167-9236(99)00078-0","raw":"K. M. Park, M. Sitharam, and S. Chen, “Quality of service provision in noncooperative networks with diverse user requirements,” Decision Support Systems, Special Issue on Information and Computation Economies, vol. 28, pp. 101–122, 2000.","cites":null},{"id":17224273,"title":"Quantity precommitment and Bertrand competition yield Cournot outcomes,”","authors":[],"date":"1983","doi":"10.2307\/3003636","raw":"D. M. Kreps and J. A. Scheinkman, “Quantity precommitment and Bertrand competition yield Cournot outcomes,” Bell J. Economics, vol. 14, no. 2, pp. 326–337, 1983.","cites":null},{"id":17224272,"title":"Rate control in communication networks: Shadow prices, proportional fairness and stability,”","authors":[],"date":"1998","doi":"10.2307\/3010473","raw":"F. P. Kelly, A. Maulloo, and D. Tan, “Rate control in communication networks: Shadow prices, proportional fairness and stability,” J. Operat. Res. Soc., vol. 49, pp. 237–252, 1998.","cites":null},{"id":17224282,"title":"Relaxing price competition through product differentiation,”","authors":[],"date":null,"doi":"10.2307\/2297136","raw":"A. Shaked and J. Sutton, “Relaxing price competition through product differentiation,” Rev. Economic Studies, vol. 49, no. 1, pp. 3–13, 1982.","cites":null},{"id":17224267,"title":"Segmentingthe market: The monopolist’s optimal product mix,”","authors":[],"date":"1986","doi":"10.1016\/0022-0531(86)90046-3","raw":"J.J. Gabszewicz,A. Shaked, J.Sutton, andJ. F. Thisse, “Segmentingthe market: The monopolist’s optimal product mix,” J. Economic Theory, vol. 39, no. 2, pp. 273–289, 1986.","cites":null},{"id":17224285,"title":"Services models and pricing policies for an integrated services Internet,”","authors":[],"date":"1995","doi":null,"raw":", “Services models and pricing policies for an integrated services Internet,” in Public Access to the Internet, B. Kahin and J. Keller, Eds. Cambridge, MA: MIT Press, 1995, pp. 315–337.","cites":null},{"id":17224276,"title":"Simple competitive internet pricing,” Euro. Economic Rev.,","authors":[],"date":"2000","doi":"10.1016\/s0014-2921(00)00042-8","raw":"R. A. Mason, “Simple competitive internet pricing,” Euro. Economic Rev., 2000.","cites":null},{"id":17224265,"title":"The existence of equilibrium in discontinuous games, I: Theory,” Rev.","authors":[],"date":"1986","doi":"10.2307\/2297588","raw":"P. Dasgupta and E. Maskin, “The existence of equilibrium in discontinuous games, I: Theory,” Rev. Economic Studies, vol. 53, no. 1, pp. 1–26, 1986.","cites":null},{"id":17224263,"title":"The optimal product mix for a monopolist in the presence of congestion effects: A model and some results,”","authors":[],"date":"1989","doi":"10.1016\/0167-7187(89)90010-6","raw":"P. Chander and L. Leruth, “The optimal product mix for a monopolist in the presence of congestion effects: A model and some results,” Int. J. Industrial Org., vol. 7, no. 4, pp. 437–449, 1989.","cites":null},{"id":17224286,"title":"The Theory of Industrial Organization.","authors":[],"date":"1988","doi":"10.2307\/2554286","raw":"J. Tirole, The Theory of Industrial Organization. Cambridge, MA: MIT Press, 1988.","cites":null},{"id":17224270,"title":"The tragedy of the commons,”","authors":[],"date":"1968","doi":"10.1126\/science.162.3859.1243","raw":"G. Hardin, “The tragedy of the commons,” Science, vol. 162, pp. 1243–1248, 1968.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-12","abstract":"This paper analyzes competition between two Internet service providers (ISPs), either or both of which may choose to offer multiple service classes. In the model analyzed, a social planner who maximizes the total benefit from network usage and a profit maximizing monopolist will both form multiple service classes; but two networks competing to maximize profits will not. The reason is that a competition effect always outweighs a segmentation effect. Networks wish to offer multiple service classes in order to increase user benefits and hence charge higher prices. In doing so, however, they effectively increase the number of points in the service quality range at which they compete. Consequently, in any equilibrium competitive outcome, both ISPs offer a single service class. The analysis has particular implications for the Paris Metro pricing (PMP) proposal, which is considered in depth in this paper, since it suggests that PMP may not be viable under competitio","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/211631.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/23577\/1\/Internet%20service%20classes%20under%20competition%28lsero%29.pdf","pdfHashValue":"a77425fa5bdf0428aeaae0e7ccfbd176e9a245ca","publisher":"Institute of Electrical and Electronics Engineers (IEEE)","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:23577<\/identifier><datestamp>\n      2013-12-02T12:28:03Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F4D616E5F536369<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/23577\/<\/dc:relation><dc:title>\n        Internet service classes under competition<\/dc:title><dc:creator>\n        Gibbens, R.<\/dc:creator><dc:creator>\n        Mason, R.<\/dc:creator><dc:creator>\n        Steinberg, Richard<\/dc:creator><dc:subject>\n        HF Commerce<\/dc:subject><dc:subject>\n        TK Electrical engineering. Electronics Nuclear engineering<\/dc:subject><dc:subject>\n        HE Transportation and Communications<\/dc:subject><dc:description>\n        This paper analyzes competition between two Internet service providers (ISPs), either or both of which may choose to offer multiple service classes. In the model analyzed, a social planner who maximizes the total benefit from network usage and a profit maximizing monopolist will both form multiple service classes; but two networks competing to maximize profits will not. The reason is that a competition effect always outweighs a segmentation effect. Networks wish to offer multiple service classes in order to increase user benefits and hence charge higher prices. In doing so, however, they effectively increase the number of points in the service quality range at which they compete. Consequently, in any equilibrium competitive outcome, both ISPs offer a single service class. The analysis has particular implications for the Paris Metro pricing (PMP) proposal, which is considered in depth in this paper, since it suggests that PMP may not be viable under competition<\/dc:description><dc:publisher>\n        Institute of Electrical and Electronics Engineers (IEEE)<\/dc:publisher><dc:date>\n        2000-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/23577\/1\/Internet%20service%20classes%20under%20competition%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Gibbens, R. and Mason, R. and Steinberg, Richard  (2000) Internet service classes under competition.  IEEE Journal on Selected Areas in Communications, 18 (12).  pp. 2490-2498.  ISSN 0733-8716     <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpl\/RecentIssue.jsp?punumber=49<\/dc:relation><dc:relation>\n        10.1109\/49.898732<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/23577\/","http:\/\/ieeexplore.ieee.org\/xpl\/RecentIssue.jsp?punumber=49","10.1109\/49.898732"],"year":2000,"topics":["HF Commerce","TK Electrical engineering. Electronics Nuclear engineering","HE Transportation and Communications"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nR. Gibbens, R.Mason and Richard Steinberg \nInternet service classes under competition \n \nArticle (Accepted version) \n(Refereed) \n \n \nOriginal citation: \nGibbens, R. and Mason, R. and Steinberg, Richard (2000) Internet service classes under \ncompetition. IEEE journal on selected areas in communications, 18 (12). pp. 2490-2498. ISSN \n0733-8716  \nDOI: 10.1109\/49.898732 \n \n© 2000 IEEE \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/23577\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \n2490 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 18, NO. 12, DECEMBER 2000\nInternet Service Classes Under Competition\nRichard Gibbens, Robin Mason, and Richard Steinberg\nAbstract—This paper analyzes competition between two\nInternet service providers (ISPs), either or both of which may\nchoose to offer multiple service classes. In the model analyzed,\na social planner who maximizes the total benefit from network\nusage and a profit maximizing monopolist will both form multiple\nservice classes; but two networks competing to maximize profits\nwill not. The reason is that a competition effect always outweighs\na segmentation effect. Networks wish to offer multiple service\nclasses in order to increase user benefits and hence charge higher\nprices. In doing so, however, they effectively increase the number\nof points in the service quality range at which they compete.\nConsequently, in any equilibrium competitive outcome, both\nISP’s offer a single service class. The analysis has particular\nimplications for the Paris Metro pricing (PMP) proposal, which is\nconsidered in depth in this paper, since it suggests that PMP may\nnot be viable under competition.\nIndex Terms—Congestion, differentiated services, Internet\ncharging, multiproduct competition, Paris Metro pricing, quality\nof service.\nI. INTRODUCTION AND MOTIVATION\nI T IS widely recognized that Internet usage is subject to a“tragedy of the commons” [10], and that pricing of Internet\nresources is required to control congestion. Many proposals\nhave been considered in the literature. The reader is referred, in\nparticular, to [4], [9], [12], and [15]. One approach suggested\nby several authors is that a small number of service classes\nshould be offered on the Internet. For example, Gupta, Stahl,\nand Whinston advocate a finite number of (perhaps four or less)\npriority classes. In Odlyzko’s “Paris Metro Pricing” (PMP)\nproposal [17], between two and four service classes would be\ngenerated by differential pricing on logically separate channels.\n(See below for more on this scheme.)\nThis paper assesses the viability of these service class\nproposals in general—and Odlyzko’s PMP in particular—when\nthere are competing network providers. Three cases are referred\nto in the paper: the social optimum, where total benefit from\nnetwork usage is maximized; monopoly, where a single network\nmaximizes profit; and duopoly, where two networks compete to\nmaximize their individual profits. In the model developed here,\nboth a “social planner,” interested in maximizing the welfare\nManuscript received October 15, 1999; revised April 15, 2000. The work of\nR. Gibbens was supported by a Royal Society University Research Fellowship;\ncomputing equipment was provided by the EPSRC under Grant GR\/M09551.\nThe work of R. Mason was supported by Alcatel Bell.\nR. Gibbens is with the Statistical Laboratory, University of Cambridge, Cam-\nbridge, CB2 1SB, U.K. (e-mail: R.J.Gibbens@statslab.cam.ac.uk).\nR. Mason is with the Department of Economics, University of Southampton.\nR. Steinberg is with the Judge Institute of Management Studies, University\nof Cambridge.\nPublisher Item Identifier S 0733-8716(00)09222-2.\nof users, and a profit maximizing monopolist will wish to use\nseveral service classes; duopolists will not.1\nThe model is based on the particular proposal by Odlyzko.\nSome years ago on the Paris Metro, and up until quite recently\non the suburban RER lines [18], users were offered a choice of\ntravelling in first or second class carriages. The only difference\nwas the price charged: both carriages had the same number and\nquality of seats, and obviously both reached the destination at\nthe same time. The first class carriage was, however, more ex-\npensive, and consequently on average had fewer passengers in it.\nThose users with a strong preference for, e.g., obtaining a seat,\nwere willing to pay the higher price; others, content to travel in\nwhat they would expect to be a more congested carriage, paid\nthe lower second class fare.2\nOdlyzko’s proposal is to apply the same scheme to packet\nbased networks, such as the Internet. A network would be\npartitioned into separate logical networks, with different\ncharges applied on each subnetwork. No guarantees of service\nquality would be offered; but, on average, networks charging\nhigher prices will be less congested. Users will sort themselves\naccording to their preferences for congestion and the prices\ncharged on the subnetworks.\nIn order to assess the PMP proposal, we place the problem in a\nmore general context of competition between networks who sell\nmultiple products in the presence of negative externalities, i.e.,\ncongestion. There has been little analysis of multiproduct com-\npetition in the economic literature, and even less when conges-\ntion is present. The model involves two competing profit-maxi-\nmizing networks who each may offer several service classes. Ser-\nvice classes are generated by forming “subnetworks,” differenti-\natedbycongestionlevel.Thecongestiononasubnetworkisdeter-\nmined by two factors: the fraction of the network’s total capacity\nallocated to the subnetwork; and the number of users on the sub-\nnetwork. A subnetwork with a low capacity and many users will\nhave a high level of congestion. Quality is therefore demand-de-\npendent, determined (in part) by the choices of networks’ prices.\nOur main result is as follows. The unique outcome is that nei-\nther network subdivides its network. The intuition behind this\ncan be understood by appealing to the analyzes by [2] and [24].\nThe desire to discriminate between users with heterogeneous\nvaluations drives networks to charge different prices on separate\nsubnetworks (i.e., produce multiple goods of different qualities).\n1See the Appendix for an analysis of the social optimum.\n2There are many other examples of PMP. Reference [3] cites dentists in India\nwho operate a “two queue scheme” in which people requiring dental treatment\ncan pay a lower price and join a longer queue, or pay a higher price and join a\nshorter queue. Both sets of people are treated by the same dentist; but the second\nset receive treatment sooner. In the U.K., there is the choice to receive free (at\nthe point of delivery) medical care via the National Health Service (NHS), or to\npay for private treatment. While the patient sees the same doctor regardless of\nthe option chosen, the waiting time is usually greater under the NHS.\n0733–8716\/00$10.00 © 2000 IEEE\nGIBBENS et al.: INTERNET SERVICE CLASSES UNDER COMPETITION 2491\nThis is a “segmentation effect.” Offsetting this is any increase\nin competition between networks which results from the use of\nanother subnetwork (i.e., production of another good); this is a\n“competition” (in Champsaur and Rochet’s terms) or “expan-\nsion” (Shaked and Sutton) effect. In the model of this paper,\nthese two effects interact so that either 1) there is no outcome\nthat is an equilibrium3 under competition, or 2) when an equilib-\nrium outcome exists, the competition effect always outweighs\nthe segmentation effect, and both networks in a duopoly earn\nlower profits in any “multiproduct” outcome in which multiple\nservice classes are offered than in the unique outcome in which\neach network offers a single service class.\nThe paper is structured as follows. The next section presents\nthe model and discusses related work. Section III provides the\nmain results of the paper concerning the outcomes of the model\nwhen there are two competing networks with fixed and equal\ncapacities. Section IV presents numerical results to assess how\nallowing capacities to be freely and optimally chosen might\nchange the conclusions of Section III. Section V concludes.\nProofs are contained in the Appendix.\nII. THE MODEL AND RELATED WORK\nIn this section, we present the basic framework and discuss re-\nlated work. On joining network , a user receives utility\nper unit time, which has three components: a positive benefit\nwhich is independent of which network he has joined; a disben-\nefit, depending on the degree of congestion on the network ,\nand his preference for (lack of) congestion ; and a disbenefit\nfrom having to pay a price per unit time to the network for\nits services. Thus, the utility of a user with preference from\njoining a network can be written as\nTo simplify further, suppose that congestion on a network is\nsimply the number of users divided by the capacity of the net-\nwork:\nwhere is the mass of users on the network, and is the\nnetwork capacity. Three main assumptions are contained in this\nfunctional form for utility. First, the congestion function is linear.\nThis may not be very realistic—it might be, for example, that the\neffect of congestion will be negligible at low usage levels, but\nwill rise sharply beyond some critical level. The linear functional\nform captures, however, the relevant feature that congestion in-\ncreases with the number of users, while maintaining tractability.4\nSecond, the utility function is separable in the various terms. In\nfact, there is no major loss of generality here: all that is required\nis that expenditure on network services is not too large relative\nto a user’s income (so that there are no wealth effects to be\n3See Section II-A for a precise definition of equilibrium.\n4In the monopoly case, it can be shown that the linearity assumption does\nnot make a qualitative difference to the conclusions; see [3]. There is as yet no\nequivalent result when there is more than one network.\nconsidered). Finally, it is assumed that each user contributes\nequally to congestion, i.e., generates the same amount of traffic.\nThis assumption is commented on further below.\nTwo further assumption are made. First, all users join one and\nonly one network. Second, a user pays a price per unit time for\nthe right to be connected to network ; hence, prices are sub-\nscription-based rather than usage-based. (In the latter case, the\nprice paid would depend on the volume of data transmitted.)\nThe first assumption seems more extreme than actually it is. In\nparticular, it is compatible with users selecting networks on a\nper packet or call basis, provided that the decision as to which\nnetwork to use is largely independent across the various packets\nand calls. In this case, the price charged by the network in the\ncurrent model is price per packet or call. When the network\nchoice decision is not independent across packets or calls, a\nfully dynamic analysis would be required; this is outside the\nscope of the present paper. The second assumption, that prices\nare subscription-based, is reasonable when users generate the\nsame amount of traffic. When this is not the case, the networks\nmight wish to use both subscription and usage charges. Refer-\nences [1] and [16] show that the degree of competition may be\nincreased when both subscription- and usage-based pricing is\nallowed. These analyzes suggest that including such two-part\npricing might strengthen this paper’s results, since the same fac-\ntors that will rule out multiple service classes in this model (see\nSection III) can lead to only subscription prices being charged\nin, e.g., [16]. There are no agreed results in this area, however;\nconsequently, we ignore this issue in the rest of the paper.\nWith these assumptions, the profit of network is .\n(Costs of forming subnetworks, as well as any other costs, are\nfor simplicity set to zero.)\nUsers differ in their preference for congestion. For example,\nthose with elastic traffic will receive little disbenefit from con-\ngestion; they will have low values of . Users with inelastic\ntraffic will be very sensitive to congestion, and will have high\nvalues of .5 To reflect the range of preferences in the popula-\ntion of users in the simplest manner, assume that there is a con-\ntinuum of users whose parameters form a population distri-\nbution which is uniformly distributed on the interval [0, 1]. The\nuniform distribution is commonly used in economic models of\ncompetition between firms whose products are of different qual-\nities; see, among many others, [22], [7], and [27]. The use of a\nuniform distribution is not crucial: as [2] shows, the important\nfeature is that the density function is not too “irregular” (see [2,\nassumptions A.1 and A.1 bis]).6\nA. Nash Equilibria\nIn this model, two networks compete to maximize individual\nprofits. This assumption may not be as extreme as it appears.\nAs far as users are concerned, choice is not necessarily limited\nby this restriction, since the two networks may offer multiple\nservice classes. More importantly, there is good reason to sup-\npose that, under certain circumstances, industries with conges-\ntion (and, more generally, industries in which firms sell products\n5Here, we use the terms elastic and inelastic in the sense introduced by [26]:\na user with inelastic traffic is sensitive to congestion and hence delay; elastic is\nnot.\n6Taking the support to be [0, 1] is simply a normalization.\n2492 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 18, NO. 12, DECEMBER 2000\nof different qualities) may have very concentrated market struc-\ntures (i.e., a small number of firms have a large market share);\nsee the analyses of [22] and [23]. Nevertheless, the restriction\nto two networks is quite strong, and further work should gener-\nalize the model to allow for more networks to enter the industry.\nIn the meantime, the current setting is the most transparent en-\nvironment in which to study the effect of competition on the use\nof multiple service classes.\nIt is natural to assume that prices on the subnetworks are\nchosen after the decisions have been made regarding the number\nof subnetworks and the capacities of these subnetworks. Thus,\na network has three decisions to make. First, it must choose the\nnumber of subnetworks to form. Second, it must set the capacity\nof its subnetworks. Finally, it must choose its prices. The non-\ncooperative game between networks may have, therefore, three\nstages. In Section III, for analytical convenience, capacities are\ntreated as fixed; hence, there are two stages in the game in this\nsection. The three stage game with chosen capacities is analyzed\nnumerically in Section IV. The rest of the paper analyzes the out-\ncomes of this game. For the basic game theoretic terminology\nand concepts, the reader is referred to [6].\nIn the two stage game, a network’s strategy in the first stage is\nthe number of subnetworks to form. A strategy for the network\nin the second stage consists of a pricing decision, taking the\nnumber of subnetworks as given.\nThis paper concentrates on pure strategies. An important\nfinding of the paper is that equilibrium may fail to exist in the\npricing stage of the game when networks form subnetworks.\nNote, however, that the results of [5] ensure that mixed strategy\nequilibria always exist in this model—that is, equilibria in\nwhich networks randomize over pure strategies (choose proba-\nbility distributions over all prices) rather than a single price for\nsure.7 (A pure strategy is therefore a special case of a mixed\nstrategy, where the probability distribution is degenerate.)\nMixed strategy equilibria are not examined here, for several\nreasons. The first and most important is that the aim is to show\nthat pure strategy equilibria may not exist, since the proof of\nthis highlights the two key economic forces that are at play in\nthe model (the segmentation and competition effects). Second,\na standard criticism of mixed strategy equilibria is that they\nimpose too large an informational burden on users; see, e.g.,\n[6]. When choosing a network to join, users are faced not with\ncertain price levels, but price distributions from which the final\nprices will be drawn. The complexity of this task is increased\nin the setting here, since quality is demand-dependent: in order\nfor users to decide which subnetwork to join, they must be\nfully aware not only of the equilibrium strategies (probability\ndistributions over prices) of networks, but also the choices of\nall other users. It is unlikely that actual users would be able to\n7Hence, in this model, a mixed strategy in the pricing stage is a real-valued\n(distribution) function defined overR with a range in [0, 1] . In a simpler ex-\nample, suppose that an individual has two actions open to her,A andB. A pure\nstrategy specifies that one of the two actions should be played for sure in a par-\nticular situation; e.g., “chooseA if another player choosesA; otherwise choose\nB.” A mixed strategy specifies that an action be chosen with some probability;\ne.g., “chooseAwith probability p andB with probability 1\u0000p if another player\nchooses A with probability q; otherwise. . .,” and so on. See [6] for more detail\non mixed strategies.\nperform this task.8 Third, the mixed strategy formulation in\nthis setting does not entirely solve the problem of nonexistence\nof equilibrium. Randomization may generate an equilibrium;\nbut once prices have actually been chosen (i.e., the randomness\nrealized), the networks will adjust their prices. Hence, for\nthe mixed strategy formulation to work, it must be that the\nnetworks are committed in some way to charge the prices that\nemerge from the randomization procedure. This is inconsistent\nwith the setup in which prices are the networks’ most flexible\nchoice variable.\nIf a network is not divided into subnetworks, then the net-\nwork’s price is simply a scalar: ; if subnetworks\nare formed, price is an -vector: . Index the networks\nby . Let the profit of firms and be denoted and\n, respectively; these profits are functions of the number of\nsubnetworks formed and the prices charged. A Nash equilib-\nrium in the second stage subgame is a pair of price vectors,\n, such that for all , and\n(1)\nand for all , , and\n(2)\nIn other words, in a Nash equilibrium, no network has a uni-\nlateral incentive to change its strategy. We call a Nash equilib-\nrium conditionally subgame perfect if the networks’ pure strate-\ngies constitute a Nash equilibrium in every subgame in which\na pure strategy equilibrium exists. This concept of conditional\nsubgame perfection is motivated by the concept of subgame per-\nfection, which allows mixed strategies as well. In our case, how-\never, we rule out mixed strategies; and so it may be (and, in fact,\nwill be) that no equilibrium exists in a particular subgame. The\nstandard notion of subgame perfection, described in, e.g., [6] is\nmodified to take account of this issue.\nA strategy for a user is a choice of network to join, given the\nprices quoted by the networks. (If the user is indifferent between\nany two (sub)networks, his choice can be made randomly.) Any\nsolution to this model will satisfy the following properties.9\nProperty 1: A (sub)network charging a higher price has\nlower congestion; e.g., in the two network case, if ,\nthen .\nProperty 2: Users who dislike congestion more will join a\nmore expensive, less congested (sub)network; e.g., in the two\nnetwork case, if , then users with high will join\nnetwork ; in other words, there exists such that for ,\n.\nIn the example with just two networks, the critical value\nidentified in property 2 is the identity of the marginal user who\nis indifferent between network and network . When the two\n8There are, however, justifications of mixed strategies that rely on the in-\nformation incompleteness; see for example the famous purification theorem of\n[11].\n9The proofs of these properties are straightforward, and so are omitted.\nGIBBENS et al.: INTERNET SERVICE CLASSES UNDER COMPETITION 2493\nFig. 1. The critical value of \u0012 .\nnetworks set prices and with , and have ca-\npacities and , the mass of users who join network is\n, and network , (given the assumption of prefer-\nences uniformly distributed on the unit interval). This is illus-\ntrated in Fig. 1. Here is determined by the indifference rela-\ntion , which implies:10\n(3)\nB. Related Work\nThe model is related to the substantial body of existing work\nwhich examines charging schemes for congestible resources.\nThe contribution of this paper is to analyze the equilibrium when\nmultiple networks each offer one or more subnetworks. That is,\nthe paper addresses the question of multiproduct duopoly with\ndemand-dependent quality. None of the papers surveyed below\nhas attempted a full analysis of this area.\nThe model used here is based on work by [3] and [19].\n(In turn, these papers can be related to the theory of price\ncompetition with capacity constraints, e.g., [13].) Chander and\nLeruth show that a profit maximizing monopolist will charge\nthe maximum number of different prices, and hence offer the\nmaximum number of subnetworks with different qualities.\nBy doing this, the monopolist segments the market, and can\ntherefore extract more surplus from users and earn higher\nprofits. Reference [19] studies duopoly outcomes with two\nfirms, when each firm charges a single price, in an identical\nmodel setup to ours. (Part of their analysis is repeated briefly\nin the next section.) Reference [14] examines the duopoly case,\nand [21] oligopoly, again with each firm offering a single price.\nIn contrast with these papers, we examine duopoly competition\nwhen both firms can charge more than one price, and hence\noffer more than one quality.\nOur analysis is also related, therefore, to the literature on\nmultiproduct competition. The majority of papers assume that\nthe number and\/or characteristics of products are fixed; [2] and\n[24] allow both the number, quality, and price of products to\nbe chosen optimally. Both papers highlight two effects. Firms\nwish to offer a broad range of qualities, in order to segment the\nmarket. On the other hand, a firm lowers its profits when it of-\nfers qualities close to those of its rivals due to price competition;\nthis effect drives firms toward a small quality range. The model\nin this paper differs from Champsaur and Rochet and Shaked\nand Sutton, since quality is determined by price, and costs play\nno part in the argument. Nevertheless, the same two effects will\nbe important for competitive outcomes.\n10Only the positive root is taken in the quadratic for \u0012 , to ensure that a net-\nwork attracts fewer users when it charges a higher price.\nThere is a small but growing literature that combines engi-\nneering with economics to provide a multidisciplinary analysis\nof quality of service provision on the Internet. For example, see\n[25] and [20]. These papers provide considerable detail on the\nengineering aspects of networks, and consequently adopt a more\nabstract approach to the economic analysis, concentrating on\nthe existence and general inefficiency of noncooperative (Nash)\nequilibrium. In this paper, we concentrate on the economic as-\npects, constructing specific Nash equilibria to assess efficiency;\nconsequently, the engineering aspects of the model are less de-\ntailed. These two approaches should be seen as complements—\nboth are required to gain a complete understanding of the how\nservice classes can and should be implemented on the Internet.\nOf special relevance to our work is that of [28], who considers\na problem of the supply of electricity when there is the possi-\nbility of excess demand. He confines his analysis to priority ra-\ntioning, where customers are grouped into priority classes such\nthat those with highest priority are supplied first. His model is\ntherefore somewhat different to the one used in this paper; how-\never, many of his conclusions have parallels in our setting.\nIn summary, many papers have considered charging and com-\npetitive outcomes when resources are congestible. A few pa-\npers have examined multiproduct competition when qualities\nare given. This paper combines these two approaches to address\nthe question: will competing firms offer multiple products when\nquality is demand-dependent?\nIII. RESULTS\nIn order to derive analytical results, this section treats capac-\nities as fixed and equal: ; and, when a network\nforms subnetworks, it assumes that the network splits its total\ncapacity equally between the subnetworks. These assumptions\nwill be relaxed in Section IV.\nOur results, described below, confirm two results suggested\nby the work in [28] on priority rationing.\n1) The only equilibrium when one network offers two\nclasses (prices), while the other offers one, has the\nsingle-offer network’s class lying between the two-offer\nnetwork’s classes. The two-class network earns lower\nprofits in this equilibrium than in the single class,\nsymmetric case. (By symmetric, we mean that the two\nnetworks offer the identical set of prices.)\n2) No asymmetric equilibrium exists when both networks in\na duopoly offer two or more classes.\nIn fact, the first result holds in a stronger form in this model:\nwe show that both networks earn lower profits as a result of\none of the networks introducing a second class. Moreover, un-\nlike Wilson who uses numerical methods (which he himself\nconcedes “are subject, of course, to the fallibility of numerical\nmethods”), we derive our results analytically.\nProposition 1: Consider the case of fixed, equal capacities\nfor the two networks. In the pricing subgame where neither net-\nwork divides into subnetworks, there is a unique Nash equilib-\nrium: the two networks charge the same price,\nand have positive profits, .\nIn the equilibrium identified in the Proposition 1, the networks\ncompete directly (both have the same capacity, charge the same\n2494 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 18, NO. 12, DECEMBER 2000\nprice, and offer the same level of congestion), and yet earn posi-\ntive profits.11 The level of equilibrium profits is a consequence of\ncongestion. A cut in price by one network does not attract the en-\ntire market demand (as it would in a standard Bertrand model),12\nsince as users defect from the high-price network, congestion\nrises on the low-price network. The fall in quality of the low-price\nnetwork’s good eventually stems the flow of users.\nProposition 2: Consider the case of fixed, equal capacities\nfor the two networks. In the pricing subgame where (wlog)\nnetwork chooses to subdivide its network and network\ndoes not, there exists a unique Nash equilibrium in pure strate-\ngies: network charges price which lies\nstrictly between network ’s two prices, ,\n. The profits of the networks are:\nand .\nProposition 3: Consider the case of fixed, equal capacities\nfor the two networks. In the pricing subgame where (wlog) both\nnetworks choose to subdivide their networks into subnetworks,\nthere exists no Nash equilibrium in pure strategies.\nThe proofs of Propositions 1, 2, and 3 appear in the Appendix.\nThese propositions yield the following.\nProposition 4: The following strategy (expressed for net-\nwork , but symmetric for the two networks) constitutes the\nunique (up to the arbitrary prices ) conditionally subgame\nperfect equilibrium of the two-stage game.\nFirst Stage: Do not subdivide into subnetworks.\nSecond Stage: If both networks have not formed subnetworks\nin the first stage, charge ; if network has not subdi-\nvided its network, but network formed two subnetworks,\ncharge ; if network formed two subnetworks and\nnetwork did not subdivide its network, charge\nand ; and if both networks formed two subnetworks,\ncharge any two nonnegative prices .\nCorollary 1: The unique equilibrium outcome is that neither\nnetwork subdivides its network, and both charge the single price\n.\nProposition 2 shows the outcome of the two economic\nforces—the segmentation and competition effects—that deter-\nmine equilibrium in this model. The segmentation effect can be\nseen by considering the profit derivatives for the two networks\nwhen prices are all equal to , the level in the 2-network,\n2-price equilibrium identified in proposition 1:\n(4)\nThese derivatives imply that, from a starting point of equal\nprices, network wishes to increase and decrease .\nNetwork , on the other hand, will not wish to change\n11The requirement that all users join a network requires that the user with the\nhighest dislike of congestion, with \u0012 = 1, should be willing to join a network.\nThis user has utility equal to V \u0000 (1\u0000 \u0012 )=C \u0000 p ; for this to be nonnegative\nin equilibrium requires that V \u0015 1=C .\n12See, e.g., [27].\nits price. (But of course, once network changes its price,\nnetwork may wish to respond.) Network —the segmenting\nnetwork—wishes to offer a broader range of qualities.\nDue to the competition effect, such a move lowers profit. In\nthe equilibrium identified in Proposition 2, network succeeds\nin segmenting that market: . But in this case, it\nis as if the two networks compete in two places, rather than just\none, since there are now two indifferent users (the one indifferent\nbetween network ’s cheaper, more congested subnetwork and\nnetwork ; and the one indifferent between network ’s more\nexpensive, less congested subnetwork and network ). As a\nresult, the networks compete more fiercely and the average price\n(weighted by market share) charged by the networks falls from\nin the two-network, two-price equilibrium in Proposition\n1 to . Note that, although this difference is small, in\npractice it may be large, for several reasons. First, this model\nrelies on a certain parameterization in order to show that profits\ndecrease through introducing multiple service classes. With\nother parameterizations, the difference may be larger (although,\nof course, it could also be smaller). Second, for the sake of clarity,\nthe cost of introducing multiple service classes has been ignored.\nIf these are at all significant, then profits will be even lower and\nmultiple service classes even less attractive to the networks.\nThese same two forces are at work in Proposition 3 and lead\nto nonexistence of equilibrium in pure strategies in the pricing\nsubgame when both networks form two subnetworks. As in [28],\nthe basic problem is that profit maximization drives the net-\nworks to move prices away from feasible levels. Consider, for\nexample, the possible case in which . Both\nnetworks gain from greater segmentation (other things equal),\nand so network will decrease and network increase\nuntil the case no longer holds. Instead, ;\nbut then there are three indifferent users between the networks,\nrather than one, and so competition is increased. As a result,\nthe networks will adjust prices to move away from this case.\nThis process continues through all other possible cases and so\nan equilibrium in pure strategies does not exist.\nIV. CHOICE OF CAPACITIES\nSection III assumes that network capacities are fixed and\nsymmetric. This assumption is convenient analytically; but,\nclearly, it is a strong restriction. In this section, numerical\nanalysis is presented which suggests that the main conclu-\nsion—that multiproduct competition is not sustainable in a\nprofit maximizing equilibrium—stands when networks are free\nto choose capacities, as well as prices.13\nThe game now has three stages. The number of subnetworks\nis chosen in the first stage; capacities are chosen in the second\nstage; and prices in the third stage. The Nash equilibrium is\nfound for the third stage pricing sub-game, taking capacities\nand the number of subnetworks as given. Then the Nash equilib-\nrium is found for the second stage subgame in capacities, taking\ninto account the effect that capacity choice will have on optimal\nprices in the third stage pricing subgame. Finally, profits for dif-\nferent numbers of subnetworks are compared. The assumption\nof costless capacity is maintained in this section.\n13Full details of the numerical analysis are contained in [8].\nGIBBENS et al.: INTERNET SERVICE CLASSES UNDER COMPETITION 2495\nFig. 2. The profit functions for C = C = 1.\nIn the simplest case of two networks each charging a single\nprice, [19] proves that the Nash equilibrium in capacities is\nasymmetric. In the absence of costs of increasing capacity and\nwhen all users join one network, the network who charges the\nhigher price has a strict incentive always to add to its capacity;\nthe other network has a strict incentive always to decrease its\ncapacity. While this result may appear counterintuitive, it is in\nfact the familiar result that firms have an incentive to differen-\ntiate themselves to the greatest extent; see, e.g., [22]. The reason\nis that, by making their services as different as possible, the two\nnetworks minimize price competition between them and hence\nmaximize profits. In the absence of capacity costs, the one net-\nwork increases its capacity, and hence its price, until the require-\nment is reached that the user with receives nonnegative\nsurplus from joining the network.\nAs in the previous section, it is helpful to consider first the\n2-network, 3-price situation. There are two cases: 1)\nor ; and 2) . Let the capacities\nof network ’s subnetworks be and ;\nnetwork ’s capacity is .\nThe analytical results of the previous section show that there\nis no equilibrium in the price stage in case 1 when\nand . Numerical investigation indicates that, for any\nfixed value of , there are critical values of and , denoted\nand , respectively, such that a pricing equilibrium exists\nonly when and . Furthermore, network\n’s profits are decreasing in for all values of and for\nwhich there exists a pricing equilibrium. Hence, the numerical\nanalysis of this case suggests network ’s optimal choice of\nis zero, so that the 2-network, 3-price solution collapses to the\n2-network, 2-price equilibrium: network allocates all of its\ncapacity to a single subnetwork, i.e., it does not subdivide.\nConsider next the price stage under case 2, examined in Fig. 2.\nThe figure plots profits with fixed total capacities\n( 1), and with varying between 0 and 1. It confirms the ana-\nlytical results in Section III: when , profits when there\nFig. 3. The profit functions for C = 1; C = 0:75.\nis PMP (denoted and ) are, respectively, lower than those\nwith no PMP ( and ). (Note that in this instance co-\nincides with .) The figure shows that there is an interior op-\ntimal choice of , close to but less than 1. But for this value\nof , a computation shows that network ’s profits are de-\ncreasing in its capacity . Network will therefore lower its\ncapacity; the effect of this is to make network ’s optimal choice\nof (still holding fixed) the corner value of 1. This is illus-\ntrated in Fig. 3, which shows the profit functions for\nand . With , the 2-network, 3-price solution\ncollapses to the 2-network, 2-price equilibrium. This argument\nholds for any . There is another case: suppose that\nis much smaller than ; in the calculations here, it is sufficient\nfor and . The numerical analysis then shows\nthat case 3 is equivalent to case 1 (although the networks are\nreversed, with network 2 being the large, high-price network).\nAgain, the 2-network, 3-price solution collapses to the 2-net-\nwork, 2-price equilibrium.\nA full numerical analysis of the two-network, four-price case\nhas not been undertaken. Instead of calculating equilibrium\nprices and profits over a 4-dimensional grid of capacities, only\ncertain values have been considered. Moreover, only the case\nin which has been examined. The aim\nis not to provide an exhaustive numerical analysis, but instead\nto indicate the sort of results that might emerge. The analysis\nsuggests first that equilibria are possible only in certain ranges\nof networks’ capacities, and second that even when a 4-price\nequilibrium is possible (i.e., even when profit-maximizing\nprices are feasible), the networks both earn higher profits in the\n2-price solution.\nThis section has assessed whether the main result of Sec-\ntion III—that competing profit-maximizing networks will not\nsell multiple products—is robust to relaxing the assumption of\nfixed, equal, and symmetrically split capacities. This section of-\nfers substantial support for the analytical results. In all cases\nconsidered, the networks maximize profits by charging a single\nprice and offering one network each.\n2496 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 18, NO. 12, DECEMBER 2000\nV. CONCLUSION\nThis paper has developed a general analysis of an Internet\npricing scheme for packet based networks under competition\nin which the networks are partitioned into logical subnetworks\ndistinguished only by price level. The costs of increased compe-\ntition as more subnetworks are introduced always outweigh the\nbenefits from greater segmentation of the market. The intuition\nbehind this is that the desire to segment drives the network with\nthe high prices to lower one of its prices to straddle those of its\nrival; in turn, this leads to lower profits.\nThe complexity of the problem required that several assump-\ntions be made, including: a uniform distribution of user prefer-\nences toward congestion, a linear congestion function, given and\nequal network capacities, and a fixed number of networks in the\nindustry. Numerical analysis suggests that at least one of these\nassumptions—fixed capacity—may not be critical to the conclu-\nsions. Further work is required to assess the importance of the\nother assumptions. One area in particular seems promising. The\ncurrent analysis suggests that there will be limited product dif-\nferentiation in equilibrium, since each network offers only one\nservice class. We have assumed that there is a fixed number of\nnetworks (i.e., two) in the network industry. The process of free\nentry may be, however, a mechanism by which a broad range of\nprices and qualities arises in equilibrium.\nAPPENDIX\nThe Social Optimum\nWe show that, given the model described in Section II, the so-\ncial planner who aims to maximize the total welfare (user sur-\nplus) from network services will wish to use multiple products\n(subnetworks). It is assumed that he\/she is able to allocate users\nto the most appropriate subnetwork. Consider the case where\nhe\/she splits the network, with total capacity of , into two\nsubnetworks, each with capacity . Let denote the critical\nvalue of the congestion parameter. Then total user surplus is\nThe planner chooses to maximize . The first-order condi-\ntion, , gives . (The second-\norder condition for a maximum is satisfied.) Thus, he\/she uses\ntwo subnetworks. Users with higher tolerance for congestion\n(i.e., lower s) are allocated to a network with a market share of\naround 61%. Users more sensitive to congestion are allocated to\na network with market share of 39%. It is straightforward to ex-\ntend this result to where the planner forms subnetworks\nof equal capacity. In general, the planner will wish to form as\nmany subnetworks as possible.\nProof of Proposition 1\nThe networks have equal and fixed capacities:\n. There is a marginal user who is indifferent between the\ntwo networks; from equation (3), this user is given by\nTABLE I\nSOLUTIONS FOR PROOF OF PROPOSITION 2\n. Suppose is an equilib-\nrium, where without loss of generality we assume .\nThen and , where is given\nabove. The first-order equilibrium conditions imply\nand . Since , then\n, but then the first-order conditions imply ,\na contradiction. The case , say, has .\nIn this case, the first-order conditions for an equilibrium imply\n. The second-order conditions are easily verified.\nProof of Proposition 2\nSuppose there exists a Nash equilibrium with ;\nwithout loss of generality, suppose . Now consider\nthe subcase where . There are two marginal\nusers: one, with congestion parameter , is indifferent between\njoining network ’s higher priced subnetwork with capacity\nand joining network ’s lower priced subnetwork with\ncapacity ; the other, with congestion parameter , is\nindifferent between network with capacity and network\n’s lower priced subnetwork. These users are defined by the\nindifference equations\n(5)\n(6)\nSuppose there exist stationary solutions to the networks’\nprofit maximization problems that are consistent with the\nconstruction. The profits are\nand . From (5) and the first-order conditions\nfor stationary profit maximizing prices, it follows that\n.\nSimilarly, (6) and the first-order condition imply\nwhere .\nThere are therefore two possible solutions in the feasible region\n(defined by and ). The\nsolutions are shown in Table I. The first solution can be ruled\nout immediately, since it involves negative prices. The second\nsolution has positive variables, but violates the construction; in\nparticular, . Hence, there are no Nash equilibria in this\ncase. If , the proof proceeds similarly.\nNow consider the subcase where . There are\ntwo marginal users: one is indifferent between joining network\n’s higher priced subnetwork and joining network , with ;\nthe other is indifferent between network and network ’s\nGIBBENS et al.: INTERNET SERVICE CLASSES UNDER COMPETITION 2497\nlower priced subnetwork, with . These users are defined by\nthe indifference equations\n(7)\n(8)\nProfits of the two networks are and\n. First-order conditions for stationary profit\nmaximizing prices and the indifference equation yield two si-\nmultaneous nonlinear equations in the two unknowns, and\n:\nThese equations have a unique solution in the relevant range\nthat ensures that . This is and\n; equations (7) and (8) then give prices as\n, and , and so profits\nare , . These profits are both\nlower than the profits in the equilibrium where both networks\noffer only one price, derived in Proposition 1, viz., .\nIf , then this solution, which was an equilibrium\nin Proposition 1, is not an equilibrium here, as easily verified\nfrom the first order conditions (4).\nProof of Proposition 3\nWithout loss of generality, assume that the highest price is\ncharged by network and that each network’s 2nd price does not\nexceed its 1st. There are three cases: i) ,\nii) , iii) .\nConsider case i. The method of analysis is the same as\nfor the cases where three prices are charged by the two net-\nworks—first, write down the indifference relations defining the\nmarginal users, denoted ; then use the implicit\nfunction theorem to determine the derivatives of with respect\nto the prices; finally, calculate derivatives of profit functions.\nThe indifference equations give\n(9)\n(10)\n(11)\nThe profits of the networks are\nand .\nThe proof will show that either network will wish to\nlower below or, equivalently, network will wish\nto raise above . Consider the derivatives\nand , evaluated at , with and\ndetermined as stationary solutions. From (11),\nimplies that . Setting the derivatives and\nequal to zero, and substituting the resulting ex-\npressions with the equality into the profit derivatives\ngives\nIn order for an equilibrium to exist with ,\nit must be that\nThese inequalities together with (9) yield\n. (The negative root is ruled out by the\nrequirement that .) This inequality must be combined\nwith (9) and the requirement that , i.e., yielding:\n. This requires that , and therefore that\nand .\nThe last stage of the proof shows that these inequalities are\ninconsistent with stationary solutions for and . The first-\norder conditions give\nIt is straightforward to show that, when ,\n. When the inequality is strict (i.e., and\n, the solution violates the requirement that . With\nequality, the solution collapses to .\nWe conclude that in case i where ,\neither network will wish to lower below , or network\nwill wish to raise above , or the inequalities will be\nweak, i.e., the solution is the 2-network, 2-price case that arises\nas an equilibrium in Proposition 1; however, as in Proposition\n2, this solution is not an equilibrium here.\nFinally, although we have assumed here to be in case i, the\nother two cases proceed similarly. Note that in case ii, the sub-\ncase that arises as an equilibrium in Propo-\nsition 2 is not an equilibrium here. This is because when network\nis able to charge two prices, its best response to network\ncharging (any) two prices is also to charge two prices. (This\nstatement can be verified easily by examining the first-order\nconditions for prices that maximize network ’s profits when\nit has formed two subnetworks in the first stage.) In summary, it\nis always the case that one or another of the networks will wish\nto change the assumed order of prices.\n2498 IEEE JOURNAL ON SELECTED AREAS IN COMMUNICATIONS, VOL. 18, NO. 12, DECEMBER 2000\nACKNOWLEDGMENT\nThe authors are very grateful to F. Kelly and D. Newbery for\nmany helpful conversations; to J. Cave, M. Cripps, I. H. Lee,\nM. Miller, A. Odlyzko, S. Scholtes, and M. Waterson for com-\nments; and to seminar participants in Bristol, Cambridge, and\nWarwick. Any errors are our responsibility.\nREFERENCES\n[1] M. Armstrong and J. Vickers, “Competitive price discrimination,”\nMimeo, 1999.\n[2] P. Champsaur and J. C. Rochet, “Multiproduct duopolists,” Economet-\nrica, vol. 57, no. 3, pp. 533–557, 1989.\n[3] P. Chander and L. Leruth, “The optimal product mix for a monopolist\nin the presence of congestion effects: A model and some results,” Int. J.\nIndustrial Org., vol. 7, no. 4, pp. 437–449, 1989.\n[4] D. Clark, “Internet cost allocation and pricing,” in Internet Economics,\nL. W. McKnight and J. P. Bailey, Eds: MIT Press, 1997, pp. 215–252.\n[5] P. Dasgupta and E. Maskin, “The existence of equilibrium in discontin-\nuous games, I: Theory,” Rev. Economic Studies, vol. 53, no. 1, pp. 1–26,\n1986.\n[6] D. Fudenberg and J. Tirole, Game Theory. Cambridge, MA: MIT\nPress, 1991.\n[7] J. J. Gabszewicz, A. Shaked, J. Sutton, and J. F. Thisse, “Segmenting the\nmarket: The monopolist’s optimal product mix,” J. Economic Theory,\nvol. 39, no. 2, pp. 273–289, 1986.\n[8] R. J. Gibbens, R. Mason, and R. Steinberg, “Multiproduct competition\nbetween congestible networks,” Working Paper WP 26\/98, Judge Inst.\nManage. Studies, Univ. Cambridge, Sept. 1998.\n[9] A. Gupta, D. O. Stahl, and A. B. Whinston, “A stochastic equilibrium\nmodel of internet pricing,” J. Economic Dynamics Contr., vol. 21, no.\n4–5, pp. 697–722, 1997.\n[10] G. Hardin, “The tragedy of the commons,” Science, vol. 162, pp.\n1243–1248, 1968.\n[11] J. Harsanyi, “Games with randomly disturbed payoffs: A new rationale\nfor mixed strategy equilibrium points,” Int. J. Game Theory, vol. 2, pp.\n1–23, 1973.\n[12] F. P. Kelly, A. Maulloo, and D. Tan, “Rate control in communication\nnetworks: Shadow prices, proportional fairness and stability,” J. Operat.\nRes. Soc., vol. 49, pp. 237–252, 1998.\n[13] D. M. Kreps and J. A. Scheinkman, “Quantity precommitment and\nBertrand competition yield Cournot outcomes,” Bell J. Economics, vol.\n14, no. 2, pp. 326–337, 1983.\n[14] I. Luski, “On partial equilibrium in a queuing system with two servers,”\nRev. Economic Studies, vol. 43, no. 3, pp. 519–525, 1976.\n[15] J. K. MacKie-Mason and H. R. Varian, “Pricing congestible network\nresources,” IEEE J. Select. Areas Commun., vol. 13, pp. 1141–1149,\n1995.\n[16] R. A. Mason, “Simple competitive internet pricing,” Euro. Economic\nRev., 2000.\n[17] A. Odlyzko, “Paris Metro pricing for the Internet,” in Proc. ACM Conf.\nElectronic Commerce (EC’99), ACM, 1999, pp. 140–147.\n[18] D. Owen, “Paris rail abolishes first-class travel,” Financial Times, p. 2,\nSept. 1, 1999.\n[19] A. de Palma and L. Leruth, “Congestion and game in capacity: A\nduopoly analysis in the presence of network externalities,” Annales\nd’Economie et de Statistique, no. 15–16, pp. 389–407, 1989.\n[20] K. M. Park, M. Sitharam, and S. Chen, “Quality of service provision\nin noncooperative networks with diverse user requirements,” Decision\nSupport Systems, Special Issue on Information and Computation\nEconomies, vol. 28, pp. 101–122, 2000.\n[21] D. Reitman, “Endogenous quality differentiation in congested markets,”\nJ. Ind. Economics, vol. 39, no. 6, pp. 621–647, 1991.\n[22] A. Shaked and J. Sutton, “Relaxing price competition through product\ndifferentiation,” Rev. Economic Studies, vol. 49, no. 1, pp. 3–13, 1982.\n[23] , “Natural oligopolies,” Econometrica, vol. 51, no. 5, pp.\n1469–1483, 1983.\n[24] , “Multiproduct firms and market structure,” Rand J. Economics,\nvol. 21, pp. 45–62, 1990.\n[25] S. Shenker, “Making greed work in networks: A game-theoretic anal-\nysis of switch service disciplines,” in Proc. SIGCOMM Symp. Commun.\nArchitectures Protocols, 1994, pp. 47–57.\n[26] , “Services models and pricing policies for an integrated services\nInternet,” in Public Access to the Internet, B. Kahin and J. Keller,\nEds. Cambridge, MA: MIT Press, 1995, pp. 315–337.\n[27] J. Tirole, The Theory of Industrial Organization. Cambridge, MA:\nMIT Press, 1988.\n[28] R. B. Wilson, “Efficient and competitive rationing,” Econometrica, vol.\n57, no. 1, pp. 1–40, 1989.\nRichard Gibbens was born in London, England, in\n1962. He obtained the B.A. degree in mathematics,\nfrom the University of Cambridge, the Diploma in\nMathematical Statistics, and the Ph.D. degree in\n1988.\nHis doctoral thesis work, which was a collabora-\ntion between the University of Cambridge and British\nTelecom, was on the design and analysis of dynamic\nrouting strategies in telecommunication networks, re-\nsulting in the development of the dynamic alterna-\ntive routing strategy now in operation in the British\nTelecom trunk network. He has worked in the area of modeling of communi-\ncation networks, mainly at the Statistical Laboratory, University of Cambridge,\nbut was also a Visiting Consultant at AT&T Bell Laboratories, Murray Hill, NJ,\nduring 1989.\nDr. Gibbens was awarded a Royal Society University Research Fellowship in\n1993.\nRobin Mason received the Masters and Ph.D.\ndegrees in economics from the University of\nCambridge.\nHe has held Research Fellowships at the Universi-\nties of Oxford and Cambridge. He is currently a Lec-\nturer in the Economics Department at the University\nof Southampton. His work is on competition in and\nstructure of network industries.\nRichard Steinberg received the B.A. degree from\nReed College, the Ph.D. degree in combinatorics and\noptimization from the University of Waterloo, and the\nMBA degree from the University of Chicago.\nHe has taught at the University of Chicago and Co-\nlumbia University, and has served on the Technical\nStaffs of AT&T Bell Laboratories and GTE Labora-\ntories. He is currently a Lecturer in Operations Man-\nagement at the University of Cambridge in the Judge\nInstitute of Management Studies.\n"}