{"doi":"10.1136\/jech.2009.090621","coreId":"65144","oai":"oai:dro.dur.ac.uk.OAI2:6760","identifiers":["oai:dro.dur.ac.uk.OAI2:6760","10.1136\/jech.2009.090621"],"title":"Yesterday once more ? unemployment and health in the 21st century.","authors":["Bambra, C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-01","abstract":"The relationship between economic recession, higher unemployment and poorer health is well established in the medical and social science research literature. Much of this research resulted from the last major economic recessions of the early 1980s and 1990s. Many parallels are being made between then and now. Therefore, this paper revisits this literature to ascertain what the unemployment consequences of the economic recession may mean for public health and health services. However, this research agenda paper also outlines key differences between then and now focussing on the structure of the welfare system and the organisation and experience of work. Therefore, it is not simply a case of ‘yesterday once more’ and public health research, policy and practice needs to be sensitive and responsive to these changes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65144.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6760\/1\/6760.pdf","pdfHashValue":"17987fd3facd0f9712a284de7630b61010986362","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6760<\/identifier><datestamp>\n      2010-10-04T09:45:38Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Yesterday once more ? unemployment and health in the 21st century. <\/dc:title><dc:creator>\n        Bambra, C.<\/dc:creator><dc:description>\n        The relationship between economic recession, higher unemployment and poorer health is well established in the medical and social science research literature. Much of this research resulted from the last major economic recessions of the early 1980s and 1990s. Many parallels are being made between then and now. Therefore, this paper revisits this literature to ascertain what the unemployment consequences of the economic recession may mean for public health and health services. However, this research agenda paper also outlines key differences between then and now focussing on the structure of the welfare system and the organisation and experience of work. Therefore, it is not simply a case of ‘yesterday once more’ and public health research, policy and practice needs to be sensitive and responsive to these changes.<\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:source>\n        Journal of epidemiology and community health, 2010, Vol.64(3), pp.213-215 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6760<\/dc:identifier><dc:identifier>\n        issn:0143-005X<\/dc:identifier><dc:identifier>\n        issn: 1470-2738<\/dc:identifier><dc:identifier>\n        doi:10.1136\/jech.2009.090621 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6760\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/jech.2009.090621 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6760\/1\/6760.pdf<\/dc:identifier><dc:rights>\n        This article has been accepted for publication in Journal of Epidemiology and Community Health (JECH). The definitive copyedited, typeset version,\\ud\nBambra, C. (2010) 'Yesterday once more ? unemployment and health in the 21st century.', Journal of epidemiology and community health., 64 (3). pp. 213-215 is available online at : http:\/\/jech.bmj.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1470-2738","issn:0143-005X","0143-005x"," 1470-2738"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 June 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBambra, C. (2010) ’Yesterday once more ? unemployment and health in the 21st century.’, Journal of\nepidemiology and community health., 64 (3). pp. 213-215.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/jech.2009.090621\nPublisher’s copyright statement:\nThis article has been accepted for publication in Journal of Epidemiology and Community Health (JECH). The\ndefinitive copyedited, typeset version, Bambra, C. (2010) ’Yesterday once more ? unemployment and health in the 21st\ncentury.’, Journal of epidemiology and community health., 64 (3). pp. 213-215 is available online at :\nhttp:\/\/jech.bmj.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nYesterday once more? Unemployment and health in the 21\nst\n century.    \n \n \nBambra, C.* \n \n* Department of Geography, Durham University, UK. \n \nAddress for correspondence: Dr Clare Bambra, Department of Geography, Wolfson Research \nInstitute, Queen's Campus, Durham University, Stockton on Tees, TS17 6BH. Tel: 0191 \n3340417, Fax: 0191 3340361, clare.bambra@durham.ac.uk \n \n \n \nThe Corresponding Author has the right to grant on behalf of all authors and does grant on behalf of all \nauthors, an exclusive licence (or non-exclusive for government employees) on a worldwide basis to the \nBMJ Publishing Group Ltd and its Licensees to permit this article (if accepted) to be published in Journal \nof Epidemiology and Community Health and any other BMJPGL products to exploit all subsidiary rights, \nas set out in our licence (http:\/\/jech.bmj.com\/ifora\/licence.pdf). \n \n \n \nArticle word count = 2040 words  \n \n 2 \nAbstract  \nThe relationship between economic recession, higher unemployment and poorer health is \nwell established in the medical and social science research literature. Much of this research \nresulted from the last major economic recessions of the early 1980s and 1990s. Many \nparallels are being made between then and now. This paper therefore revisits this literature to \nascertain what the unemployment consequences of the economic recession may mean for \npublic health and health services. However, this research agenda paper also outlines key \ndifferences between then and now focusing on the structure of the welfare system, and the \norganisation and experience of work. It is therefore, not simply a case of „yesterday once \nmore‟ and public health research, policy and practice needs to be sensitive and responsive to \nthese changes.  \n \n124 words \n 3 \nINTRODUCTION \nThe relationship between economic recession, higher unemployment and poorer health and \nwellbeing is well established in the medical, epidemiological and social science research \nliterature.\n1\n Much of this research resulted from the last major economic recessions of the \nearly 1980s and 1990s.\n2\n Many parallels are being made between the current economic crisis \nand previous ones, not least in terms of the economic, social and health effects of rising \nunemployment (expected to rise to around 8.5% in the UK and the USA and 10% in France \nduring 2009).\n3 4\n  It therefore seems timely to revisit this literature in order to ascertain what the \nunemployment consequences of the economic recession may mean for public health and \nhealth services. However, this research agenda paper also outlines key differences between \nthen and now which may be important in terms of fully understanding how unemployment and \nits health effects are experienced in the changed labour market context of the 21\nst\n century.  \n \nUNEMPLOYMENT AND HEALTH \nUnemployment is associated with an increased likelihood of morbidity and mortality.\n1\n There \nare clear relationships between unemployment and increased risk of poor mental health and \nparasuicide,\n5 6\n higher rates of all cause and specific causes of mortality,\n7 8\n self reported health \nand limiting long term illness,\n9\n and, in some studies, a higher prevalence of risky health \nbehaviours (particularly amongst young men), including problematic alcohol use and \nsmoking.\n10\n The negative health experiences of unemployment are not limited to the \nunemployed only but also extend to families and the wider community.\n11 12\n For example, \nfigures from a 1984 study suggested that for every “2000 men seeking work 2 (1.94), and \namong their wives 1 (0.98), will die each year as a result of unemployment”.\n13\n  Unemployment \ntherefore has serious implications for health service planning with, for example, increased \npressures on mental health services.\n14\n  \n \nLinks between unemployment and poorer health have conventionally been explained through \ntwo inter-related concepts: the material consequences of unemployment (e.g. wage loss and \nresulting changes in access to essential goods and services), and the psychosocial effects of \nunemployment (e.g. stigma, isolation and loss of self-worth).\n14\n Research has also drawn \n 4 \nattention to the contributory role of ill health itself as a factor behind unemployment (health \nselection) and this will probably be attenuated in times of economic hardship. Ill health related \njob loss also has a social gradient, with adverse employment consequences more likely for \nthose in lower socio-economic groups.\n15 16\n These older studies have tended to suggest that \nthe negative relationship between unemployment and health is stronger for men than \nwomen.\n17\n  \n \nThe current research literature therefore suggests that the increased unemployment resulting \nfrom the current economic recession will have negative public health effects and a \ncorresponding increase in the use of health services. However, significant changes in the \nconstitution of economic life mean that the magnitude of the unemployment related health \neffects of this recession may be under estimated if we rely solely upon research data from the \nrecessions of previous eras. Key differences between then and now include the structure of \nthe welfare system, and the organisation and experience of work. It is therefore, not simply a \ncase of „yesterday once more‟ and public health research needs to be sensitive to these \nchanges if the contemporary health consequences of unemployment are to be fully \nunderstood. \n \n \n \nWELFARE SYSTEM \nThe welfare systems of most developed economies have experienced considerable reform \nsince the last two economic recessions. This has meant that access and entitlement to out of \nwork cash benefits and welfare services have decreased considerably. For example, the \npopulation coverage of unemployment benefit in the UK decreased from 90% in 1980 to 77% \nin 1999, in Germany it decreased from 100% to 84% and in Norway, from 100% to 79%.\n18\n  \nThe replacement value of unemployment benefit has also decreased in the UK from 45% of \naverage wages in 1980 to just 16% in 1999; in Germany it decreased from 68% to 37%, and \nin Norway from 70% to 62%.\n18\n The welfare safety net for women is often smaller than that for \nmen.\n17\n The extent to which the welfare state can act as a buffer against the negative social \nand health consequences of economic recession has therefore been diminished.  \n \n 5 \nFurther, there is an increased use of welfare to work policies, requiring the unemployed to \npartake in compulsory employability and skills training in order to receive benefits.\n19\n The likely \nsuccess of such schemes in returning people to employment seems limited within a \ncontracting labour market. In fact, from a health perspective, they may well be counter \nproductive in terms of their stigmatising effects and the division of the poor into deserving and \nundeserving.\n20\n Certainly, an Australian study of welfare to work schemes amongst young \npeople in the 1990s found them to be almost as detrimental to mental health as \nunemployment.\n21\n Indeed, the economic recession and the resulting rise in unemployment \nhave not put a stop to the continued individualisation of responsibility for unemployment or \nindeed, for poor health. Previous recessions suggest that the stigmatising of benefit \nrecipients, particularly in the UK, Australia and the USA, as scroungers will only increase.\n22\n \nThis has meant that although unemployment benefit has long been characterised by stigma \nand means-testing,\n22 23\n the cash benefits now provided to people when they are out of work \nare of considerably less value in real terms than they used to be and a lot more is required in \norder to be entitled to them. Given the links between material poverty and poor health, and \nbetween social stigma and poor health, this may have important negative influences on the \nrelative health of the unemployed.\n1 14\n This may increase health inequalities between those \nwith and without work. \n24\n  \n \nIt is also important to note that this “new” unemployment coexists with structural worklessness \nin the form of long term sickness absence and disability pension receipt. Across Europe, \ndisability pension receipt has increased significantly over the past 25 years and in some post-\nindustrial areas of Europe rates are as high as 18% of the working age population.\n25\n The vast \nmajority of new disability claims are on the basis of mental health.  Mental health problems \nalso develop as co-morbidities amongst those who are initially out of the labour market due to \nchronic physical health problems (such as musculoskeletal conditions).\n26\n It therefore seems \nlikely that the new wave of unemployment will also impact on mental health more than on \nphysical health. This will certainly be the case initially, as most previous studies have noted a \nlag in terms of the physical health effects of unemployment of up to 2 years.\n27 28\n It is possible \nthat the coexistence of high levels of health and disability related worklessness may actually \n 6 \ndecrease the stigma attached to unemployment as worklessness of various forms becomes \n“normalised” within certain deprived post-industrial communities. As Orwell commented in \nThe Road to Wigan Pier (1937[1981]: 78), “when people live on the dole for years at a time \nthey grow used to it, and … though it remains unpleasant, it ceases to be shameful … It \nmakes a great deal of difference when things are the same for everybody”.\n23\n This will not of \ncourse decrease the health effects of the material deprivation experienced by unemployed \nindividuals and workless communities. Further, the social exclusion of workless communities \n(as opposed to unemployed individuals within them) may well increase in the longer term and \nlead to the further stigmatisation of such places with resulting rises in geographic inequalities \nin health and economic development.   \n \nWORLD OF WORK \nWork itself has long been acknowledged as an important social determinant of health and \nhealth inequalities.\n29\n The quality and type of employment are vital in terms of income and \nsocial status in all advanced industrialised societies. Work also dominates adult life. However, \nthe nature of work has altered considerably in the UK, Northern America, Japan and Europe \nover the past two decades, with a decrease in industrial employment and an increase in the \nsize of the service sector (e.g. in the UK, the manufacturing sector‟s share of GDP has \ndeclined by nearly 50% over the last 25 years). A 24 hour society has also started to emerge \nwith the increased use of shift work. This has led to public health concerns about abnormal \nworking hours and work-life balance.\n30\n This has also been accompanied by a decline in the \nnumber of standard full-time, permanent jobs and a rise in flexible – precarious – \nemployment: increasing numbers of people are working on either temporary contracts or no \ncontracts, with limited or no employment or welfare rights. There is a negative relationship \nbetween precarious, insecure employment and health. \n1 31\n \n \nSimultaneously, women‟s employment rates have also substantially increased in most \nWestern economies (e.g. in the UK they have increased from 56% in 1971 to 70% in 2007). \nPrevious research suggested that the health effects of unemployment were greater for men \nthan for women. Explanations of this were based on the vital importance of paid work for male \n 7 \nself-identity \n22 23\n and\/or the fact that men are less likely to seek health and social support.\n4\n In \ncontrast, women‟s traditional social roles (notably motherhood or homemaking) acted as \nbuffers to the mental health effects of job loss as they gave alternative sources of identity. As \nthe labour market is becoming increasingly feminised and gender roles shift, this might no \nlonger be the case (if indeed it ever was) as work becomes an increasingly important part of \nmost women‟s self-identity. This time, the negative health effects of unemployment may be \nmore equally experienced by women as by men. This will increase the demands on health \nservices.  \n \nThese new economic forms will also impact on the experience and distribution of \nunemployment as those with the least protection will be at most risk of unemployment, often \nwithout redundancy packages. These are likely to be women, the young, and immigrants – \nthe “reserve army of labour”. These are also the workers who have the least entitlement to \npublic welfare benefits. They are also less likely to have community based social support. \nFurther, workers currently experiencing a daily existence of low paid, high-strain, temporary \nemployment, may be ill prepared for, and least resilient to, the additional negative health \npremium of unemployment. So in such cases, whilst unemployment may temporarily release \npeople from the negative health effects of insecure employment, it does not provide an \nadequate safety net to be a healthy alternative. Those remaining in the workplace will also be \nsubject to more psychosocial stress from increased job insecurity and increased likelihood of \nredundancy.\n1\n   \n \nCONCLUSION \nThis brief analysis suggests that there are at least four key differences between \nunemployment then and now: (1) the safety net available to the unemployed is less than in \nprevious recessions although benefit receipt is more stigmatised; (2) in some areas, the “new” \nunemployment co-exists with significant structural worklessness in the form of disability \npension receipt; (3) the changed work environment, the deterioration of employment rights, \nand the decrease in social support, suggests that unemployment may have an additional \nrelative health burden for some than in the past; and (4), as a recent pan-European study \n 8 \nshows, women‟s unemployment is likely to become a greater public health issue than in the \npast.\n17\n Depending on the length and depth of the current recession (which is unknown), this \nsuggests that the negative health consequences of unemployment are likely to be wider and \ngreater than in the past. Based on previous research, in the short term we can expect \nincreased mental health problems amongst the unemployed of both genders, their children, \nand the wider community.\n11 12\n Longer term, it is likely that physical health problems, including \nmortality, will also increase.\n27 28\n This will have important consequences in terms of public \nhealth research and practice, as well as in terms of political discussions of unemployment.\n4 14\n \nResearch on unemployment needs to be more sensitive to this changed context by, for \nexample, examining more closely women‟s experiences of unemployment. Similarly, the \nemployment and rehabilitation services provided by public agencies will need to be increased \nand they may also need to be more gender sensitive and gender specific than they have in \nthe past.\n32\n We also need to be aware of the health effects of such interventions and so \neducation should be favoured over welfare to work programmes.\n4\n Most notably, policy \ninterventions need to break the relationship between unemployment and poor health for \neveryone.  \n 9 \nReferences \n1. Bartley M, Ferrie J, Montgomery SM. Health and labour market disadvantage: \nunemployment, non-employment, and job insecurity. . In: Marmot M, \nWilkinson RG, editors. Social determinants of health. Oxford: Oxford \nUniversity Press, 2006:78-96. \n2. Smith R. \"Bitterness, shame, emptiness, waste\": an introduction to unemployment \nand health. BMJ 1985;291(6501)  1024–1027. \n3. Kawachi I. The US elections and the global recession: what's next? Journal of \nEpidemiology and Community Health 2009;63:89-90. \n4. Dorling D. Unemployment and health: Health benefits vary according to the \nmethod of reducing unemployment. BMJ 2009;338:b829. \n5. Montgomery SM, Cook DG, Bartley M, Wadsworth ME. Unemployment pre-dates \nsymptoms of depression and anxiety resulting in medical consultation in \nyoung men. Int J Epidemiol 1999;28:95-100. \n6. Platt S. Parasuicide and unemployment. Br J Psychiatry 1986;149:401-5. \n7. Morris JK, Cook DG, Shaper AG. Loss of employment and mortality. BMJ \n1994;308:1135-9. \n8. Scott-Samuel A. Unemployment and health. Lancet 1984;22\/29 Dec:1465. \n9. Bartley M, Plewis I. Accumulated labour market disadvantage and limiting long-\nterm illness: data from the 1971-1991 ONS longitudinal study. Int J Epidemiol \n2002;31:336-41. \n10. Montgomery SM, Cook DG, Bartley M, Wadsworth ME. Unemployment, \ncigarette smoking, alcohol consumption and body weight in young British \nmen. Eur J Public Health 1999;8:21-7. \n11. Solantaus T, Leinonen J, Punamaki R. Children's mental health in times of \neconomic recession: Replication and extension of the family economic stress \nmodel in Finland. Developmental Psychology 2004;40:412-429     \n12. Novo M, Hammarstrom A, Janlert U. Do high levels of unemployment influence \nthe health of those who are not unemployed? A gendered comparison of young \nmen and women during boom and recession Soc Sci Med 2001;53:293-303  \n13. Moser KA, Fox AJ, DR J. Unemployment and mortality in the OPCS \nLongitudinal Study. Lancet 1984;ii:1324-1329. \n14. Watkins S. Economic adversity and health: Policy implications In: Eskin F, editor. \nUnemployment: a challenge to public health. Manchester Centre for \nProfessional Development, University of Manchester, 1986:1-72. \n15. Arber S. Social class, non-employment, and chronic illness: continuing the \ninequalities in health debate. British Medical Journal 1987;294:1069–1073. \n16. Bartley M, Owen C. Relation between socioeconomic status, employment, and \nhealth during economic change, 1973-93. BMJ 1996;313(7055):445-449. \n17. Bambra C, Eikemo T. Welfare state regimes, unemployment and health: A \ncomparative study of the relationship between unemployment and self-\nreported health in 23 European countries. Journal of Epidemiology and \nCommunity Health 2009;63:92-98. \n18. Bambra C, Eikemo T. The welfare state: a glossary for public health. Journal of \nEpidemiology and Community Health 2008;62:3-6. \n19. Rhodes M. The Welfare State: Internal Challenges, External Constraint. In: \nRhodes M., Vincent A., editors. Developments in Western European Politics. \nLondon: Macmillan, 1997. \n 10 \n20. Bambra C. In sickness or in health? Incapacity Benefit reform and the politics of \nill health. . BMJ 2008;337:a1452. \n21. Morrell SL, Taylor RJ, Kerr CB. Unemployment and young people’s health. Med \nJ Aust 1998;168:236-40. \n22. Campbell B. Wigan Pier Revisited. London: Virago, 1984. \n23. Orwell G. The Road to Wigan Pier. London: Penguin, 1937[1981]. \n24. Kondo N, Subramanian S, Kawachi I, Takeda Y, Yamagata Z. Economic \nrecession and health inequalities in Japan: analysis with a national sample, \n1986–2001 Journal of Epidemiology and Community Health 2008;62:869-\n875. \n25. Bambra C, Norman P. What is the association between medically certified long \nterm sickness absence, and morbidity and mortality? Health and Place \n2006;12(728-33). \n26. Organisation for Economic Cooperation and Development. Sickness, Disability \nand Work: Background paper. Available at: \nhttp:\/\/www.oecd.org\/dataoecd\/42\/15\/42699911.pdf, 2009. \n27. Bunn A. Ischematic Heart Disease Mortality and the business cycle in Australia  \nAmerican Journal of Public Health 1979;69(8). \n28. Brenner H. Relation of economic change to Swedish Health and Social Wellbeing, \n1950-1980. Social Science and Medicine 1987;25:183-195. \n29. Marmot M, Siegrist J, Theorell T, Feeney A. Health and the psychosocial \nenvironment at work. . In: Marmot M., Wilkinson R., editors. The social \ndeterminants of health. New York: Oxford University Press, 2006. \n30. Rajaratnam S., Arendt J. Health in a 24-h society. Lancet 2001;358:999-1005. \n31. Benach J, Muntaner C. Precarious employment and health: Developing a research \nagenda. Journal of Epidemiology and Community Health 2007;61:276-77. \n32. Smith K.E, Bambra C, Joyce K.E. ‘Striking out’: Shifting labour markets, welfare \nto work policy and the renegotiation of gender performances. . Critical Social \nPolicy in press. \n \n \n"}