{"doi":"10.1109\/IEMBS.2005.1617118","coreId":"102249","oai":"oai:epubs.surrey.ac.uk:1703","identifiers":["oai:epubs.surrey.ac.uk:1703","10.1109\/IEMBS.2005.1617118"],"title":"A Template Effect Study on Voxel-Based Morphometry in Statistic Parametric Mapping","authors":["Shen, Shan","Sterr, Annette","Szameitat, Andre J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-01","abstract":"<p>Voxel-based morphometry (VBM) is an automated method allowing identification of anatomical differences in the whole brain without the pre-specification of a region of interests. Spatial normalization is one of the major processes in VBM, which transforms all images to a standard template. A variety of templates were employed in VBM researches in the literature, including the MNI template and study-specific templates. Few studies were presented to test the effect of templates on the detection accuracy of VBM, although it is claimed in many papers that the study-specific template performs better. However, the creation of the study-specific template differs on the subjects included. In this paper, the gray matter (GM) difference of two groups (female vs male) was analyzed to evaluate the effects of templates on the VBM results. The statistic parametric mapping (SPM) package, as the standard software for VBM implementation, was used for analyses.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1703<\/identifier><datestamp>\n      2017-10-31T14:02:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1703\/<\/dc:relation><dc:title>\n        A Template Effect Study on Voxel-Based Morphometry in Statistic Parametric Mapping<\/dc:title><dc:creator>\n        Shen, Shan<\/dc:creator><dc:creator>\n        Sterr, Annette<\/dc:creator><dc:creator>\n        Szameitat, Andre J.<\/dc:creator><dc:description>\n        <p>Voxel-based morphometry (VBM) is an automated method allowing identification of anatomical differences in the whole brain without the pre-specification of a region of interests. Spatial normalization is one of the major processes in VBM, which transforms all images to a standard template. A variety of templates were employed in VBM researches in the literature, including the MNI template and study-specific templates. Few studies were presented to test the effect of templates on the detection accuracy of VBM, although it is claimed in many papers that the study-specific template performs better. However, the creation of the study-specific template differs on the subjects included. In this paper, the gray matter (GM) difference of two groups (female vs male) was analyzed to evaluate the effects of templates on the VBM results. The statistic parametric mapping (SPM) package, as the standard software for VBM implementation, was used for analyses.<\/p><\/dc:description><dc:date>\n        2005-09-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1703\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Shen, Shan, Sterr, Annette and Szameitat, Andre J.  (2005) A Template Effect Study on Voxel-Based Morphometry in Statistic Parametric Mapping  In: 2005 IEEE Engineering in Medicine and Biology 27th Annual Conference.     <\/dc:identifier><dc:relation>\n        10.1109\/IEMBS.2005.1617118<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1703\/","10.1109\/IEMBS.2005.1617118"],"year":2005,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"ATemplate Effect Study on Voxel-Based\nMorphometry in Statistic Parametric Mapping\nS. Shen, A. Sterr, A. Szameitat\nDepartment of Psychology, University of Surrey, UK\nAbstract- Voxel-based morphometry (VBM) is an automated\nmethod allowing identification of anatomical differences in the\nwhole brain without the pre-specification of a region of interests.\nSpatial normalization is one of the major processes in VBM,\nwhich transforms all images to a standard template. A variety of\ntemplates were employed in VBM researches in the literature,\nincluding the MNI template and study-specific templates. Few\nstudies were presented to test the effect of templates on the\ndetection accuracy of VBM, although it is claimed in many papers\nthat the study-specific template performs better. However, the\ncreation of the study-specific template differs on the subjects\nincluded. In this paper, the gray matter (GM) difference of two\ngroups (female vs male) was analyzed to evaluate the effects of\ntemplates on the VBM results. The Statistic Parametric Mapping\n(SPM) package, as the standard software for VBM\nimplementation, was used for analyses.\nI. INTROUCTION\nThe investigation of structural brain differences among\ndifferent populations is an important issue in neurological\nresearch. However, the advent of magnetic resonance imaging\n(MRI) has made it more feasible to access structural\ncharacteristic of the brain. Most MRI morphometric studies\nhave been based on manual delineation of a region of interests\n(ROI). It is a labour intensive procedure suffering from\ndifficulties related to defining reliable anatomical boundaries\nand requiring substantial prior knowledge. In contrast,\nvoxel-based morphometry (VBM) is an automated method\nallowing identification of differences in tissue concentration\nwithout the necessity to define a prior region of interests. It\nenables a structural analysis of the whole brain between subject\ncohorts, with minimal operator dependence [1, 2, 3]. This\ntechnique has been employed by many researchers to detect\npathological changes in gray matter (GM) and white matter\n(WM) in various neurological conditions, such as\nschizophrenia, Alzheimer’s disease and epilepsy [4, 5, 6].\nThe initial step of VBM involves spatially normalizing all\nMR images to the same stereotactic space to co-register\nhomologous brain regions across subjects. The study brain\ntissue is then extracted from the normalized brain and\nsmoothed to reduce the individual anatomical variability.\nFinally, a statistical analysis of generalized linear model (GLM)\non a voxel-by-voxel basis is performed to localize the\nstructural differences between groups.\nThe statistical parametric mapping (SPM) technique is\ninitially designed to construct and assess the spatially extended\nstatistical processes used to test hypotheses about functional\nimaging data. Ashburner et al [1] proposed an adaptation of\nSPM for VBM analyses. Therefore, the SPM software package\n(http:\/\/www.fil.ion.ucl.ac.uk\/spm\/) developed by the Wellcome\nDepartment of Imaging Neuroscience, University college\nLondon becomes the standard software for VBM.\nThe detection accuracy of VBM highly depends on the\nresults of spatial normalization. In SPM, normalization is\nimplemented by using a global linear and local nonlinear\nregistration method to conform all images to a standard\ntemplate. The ideal results are required to ensure that\nhomologous regions are compared across subjects, but on the\nother hand they are not intended to be an exact match, where\nall inter individual anatomical differences may be removed [7].\nA popular template employed by many VBM researches was\ncreated by 152 T1-weighted images from the Montreal\nNeurological Institute (MNI), provided in SPM. However, the\nusage of the MNI template may have problems due to the\ncontrast differences between MR images and the MNI template\nand the demographic differences of the study population from\nthe population used to generate the existing template. It was\nalso proposed in the literature that each scanner introduces\nspecific non-uniformities in image intensity, which may cause\na potential bias from normalization [8]. Therefore, many other\nresearches have used study-specific templates for spatial\nnormalization, i.e. a template created especially for one study,\nProceedings of the 2005 IEEE\nEngineering in Medicine and Biology 27th Annual Conference\nShanghai, China, September 1-4, 2005\n0-7803-8740-6\/05\/$20.00 ©2005 IEEE. 3051\ndiffering from any existing templates [5, 6, 7].\nAlthough the suggestion of using a study-specific template is\nquite strong, a few comparisons using the MNI template and\nthe study-specific template for spatial normalization implied\nthat the choice of templates does not affect the final detection\nof the anatomical differences [7, 9]. However, these studies do\nnot provide an exhaustive analysis of template effects.\nTherefore, the first question this paper wants to answer is\nwhether the sensitivity of VBM is template dependant.\nAssuming the template effect exists, the creation of a\nstudy-specific template presents further questions. Generally,\nthe study-specific template is generated from the images\nacquired from a group of healthy subjects in the same scanner.\nHowever, the literature demonstrated four types of subject\nselection: 1) all subjects of the healthy control group, which is\ncompared with the study group (such as patients) [10, 11]; 2) a\nsubset of the healthy control group [8]; 3) a subset of the\ncontrol group plus a subset of the study group [9] and 4) a\nsubset of the control group plus a subset of a different\npopulation, where all images are obtained within the same\nscanner [12]. A further option would be using images acquired\nfrom a totally different population from the control [7].\nIn addition, Duchesne et al [13] introduced the idea that\nnormalizing the study group and the control group to their own\ngroup specific templates, rather than normalizing both to the\nidentical template, would decrease the within group anatomical\nvariability and therefore increase the between group separation.\nThe question is then how the different groups or different\nnumbers of subjects, employed to create the templates, can\naffect the VBM results.\nIn this paper, the template variations stated above are tested\non detecting GM concentration differences of a female and a\nmale group. Section II introduces the methodology and the\nresults are presented and discussed in Section III. Section IV\ncontains conclusions and addresses future work.\nII. METHODS\nA. Subjects\nThe study group consisted of 11 healthy female subjects\n(mean age 27.9) and the control group was 17 healthy male\nsubjects (mean age 25.2). All subjects were confirmed as right\nhanded using Edinburgh Handedness Inventory. The study was\napproved by the local Ethics Committee.\nB. MRI Acquisition\nHigh-resolution 3D brain MRI images were obtained on a 3\nT Siemens Trio scanner (Erlangen, Germany) using a\nT1-weighted magnetization prepared rapid acquisition gradient\necho (MPRAGE) pulse sequence. TR=1830ms, TE=4.43ms, 1\nacquisition, flip angle=11°, FOV=256mm, 176 slices, voxel\nsize=1×1×1mm3, in-plane matrix=256×256.\nC. Image Processing\nThe latest version of SPM (SPM2) was used for VBM\nanalyses running in MATLAB 6.5. The original MR images in\nIMA format were converted to SPM adapted ANALYZE\nformat using the DICOM tool box of SPM. The origin of each\nimage was manually set to the anterior commissure (AC).\nIntensity inhomogeneities were corrected using the Bias cor.\nfunction of SPM.\nThe following templates were created using the\ncg_create_template program developed by Gaser [14]:\n1) T27: 27 subjects from the study group and the control\ngroup (excluding one male subject with enlarged\nventricle).\n2) TF11: 11 female subjects from the study group.\n3) TM16: 16 male subjects from the control group\n(excluding one male subject with enlarged ventricle).\n4) TM8: 8 male subjects from the control group.\n5) TF4-M4: 4 female subjects from the study group and 4\nmale subjects from the control group.\nAll templates were spatially smoothed with an 8mm full\nwidth at half maximum (FWHM) isotropic Gaussian kernel.\nTemplates created from subjects, other than members of the\nstudy and control groups, were not covered in this paper.\nThe spatial normalization was implemented in two steps.\nThe first step involved matching the images to the template by\nestimating the optimum 12-parameter affine transformation.\nThe second step accounted for global nonlinear shape\ndifferences, which are modelled by a linear combination of\n7×8×7 smooth spatial basis function [1]. Seven comparisons\nwere derived from the different templates applied for\nnormalization. TABLE I lists the templates used in each study.\nThe non-brain regions were removed from the normalized\nimages using MRIcro (http:\/\/www.mricro.com), developed by\nRorden. Images were then segmented into GM, WM and\ncerebral spinal fluid (CSF). SPM segmentation employed a\nmixture model cluster analysis to identify voxel intensities\nmatching particular tissue types combined with a priori\nknowledge of the spatial distribution of these tissues in normal\nsubjects, derived from probability maps. GM images were then\nsmoothed using a 12mm FWHM isotropic Gaussian kernel.\n3052\nTABLE I\nTEMPLATES FOR COMPARED STUDIES\nTemplateStudy\nNo. Study group Control group\n1 MNI MNI\n2 T27 T27\n3 TF11 TF11\n4 TM16 TM16\n5 TM8 TM8\n6 TF4-M4 TF4-M4\n7 TF11 TM16\nD. Statistical Analysis\nGroup comparisons were performed using the random\neffects analysis in SPM. The statistical model included a\nmeasure of the original volume of gray matter in each brain as\na confound (ANCOVA) to remove the global differences.\nSignificance levels were set at P<0.0005 uncorrected with an\nextend threshold of 100 contiguous voxels.\nIII. RESULTS AND DISCUSSION\nThe increased gray matter concentration was detected in the\nbrains of female subjects compared with those of males. The\nsagittal and coronal patterns of the compared studies were\nshown in standard SPM glass brain projections (Fig.1). The\nsignificance was also shown on the axial 3D brains in Fig.1.\nStudy 1 used the MNI template for normalization and the\nother studies employed the study-specific templates. It is clear\nthat the latter displayed artefacts at the edge of the brain (Fig.1\n(b)-(g)). One explanation for these artefacts may be that female\nbrains are usually smaller than male brains. This hypothesis\nwas further supported by the finding that the artefacts were\nstronger when the templates were created from the female\nbrains. In addition, Study 1 found markedly greater GM in\nfemales, in the bilateral parahippocampal gyrus and the left\nsuperior temporal gyrus* (Region 1, Fig. 1), as compared to the\nmale group. In contrast, Study 2-7 only found a small GM\nincrease in the left parahippocampal gyrus. The increase of GM\nconcentration was further located in the bilateral inferior\nfrontal gryus* (Region 2, Fig. 1) in all studies. However, the\nsize of significant voxels varied substantially across studies.\nTABLE II lists the details of these two significant regions from\nall seven studies.\nFig. 2 plots the significant voxel numbers in each region. It\nis clear that Study 1 showed the most significant results which\nsuggests that using the MNI template is either more sensitive to\n* The anatomical region was localized using Talairach Daemon\n(http:\/\/ric.uthscsa.edu\/resources\/talairachdaemon\/), the MNI coordinates were\nconverted to the Talairach coordinates before use.\ndetect the structural differences or it has the higher possibility\nof Type I errors (false positive).\nAmong studies using study-specific templates, Study 4 and 5\nobtained the most significant results. This suggests that if study\nspecific templates are used, they are best created from the\ncontrol group. However, these results further indicate that\nsubject size affects the VBM sensitivity only marginally.\nStudy 2 and 6 used the templates created by both groups, but\ndifferent subject sizes. Their similar results confirm that no\nsignificant effect was caused by the subject size creating the\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(a)\nFig.1 Significant patterns of increased gray matter concentration in females\nversus males. (a)-(g): Study 1-7 (Study numbers were defined in TABLE I).\nLeft column: sagittal view; centre column: coronal view; right column: axial\n3D brain. Region 1: square\/red, Region2: circle\/yellow\n3053\ntemplates.\nStudy 3 employed the template created by the study group.\nThe sensitivity was one of the worst among all studies.\nSurprisingly, group specific templates were applied in Study\n7, the result was not promising.\nIV. CONCLUSION\nIn this paper, the template effect on the VBM technique was\nTABLE II\nSIGNIFICANT REIGIONS IN COMPARED STUDIES\nRegion 1\nLeft hemisphere Right hemisphereStudy\nNo. MNI\nCoordinate\nT\nValue\nNumber\nof Voxels\nMNI\nCoordinate\nT\nValue\nNumber\nof Voxels\n1 -43 -27 -9 5.46 4168 21 -52 -11 4.46 761\n2 -19 -49 -14 5.48 468 N\/A 0\n3 -18 -49 -15 5.21 417 N\/A 0\n4 -19 -49 -15 5.36 397 N\/A 0\n5 -19 -49 -15 5.40 535 21 -50 -12 4.23 941\n6 -19 -48 -15 5.90 498 N\/A 0\n7 -19 -49 -15 5.04 288 N\/A 0\nRegion 2\n1 -47 0 21 8.37 2375 53 1 21 6.69 5616\n2 -47 3 20 6.17 1077 44 7 23 6.52 1421\n3 -48 3 19 4.87 346 47 9 23 5.01 477\n4 -47 2 21 6.41 1302 43 5 23 6.22 1988\n5 -48 2 21 6.48 1416 43 5 23 6.15 2263\n6 -47 2 20 5.96 935 45 8 25 5.08 1386\n7 -49 5 22 4.50 121 46 9 25 4.56 122\nFig. 2 Plots of significant regions in compared studies\n(top)Region 1 (bottom) Region 2\ntested on detecting the GM concentration difference between a\nfemale group and a male group. The results indicated that\nVBM is more sensitive when using the MNI template for\nnormalization than using the study-specific templates, but Type\nI error may occur. It also demonstrated that the template should\nbe created using the control group only, not the study group.\nThe different numbers of subjects included in the templates\nmight not affect the results, as long as the subjects were in the\nsame group. No evidence showed that the group specific\ntemplates for the study and control groups performed better\nthan an identical template for both groups.\nSimulated lesion and bigger groups may be applied in our\nfuture work for further demonstration.\nREFERENCES\n[1] J. Ashburner and K. Friston, “Voxel-based morphometry-the methods,”\nNeuroImage, vol. 11, pp. 805-821, 2000.\n[2] J. Ashburner, J. Csernansky, C. Davatzikos, N. Fox, G. Frisoni and P.\nThompson, “Computer-assisted imaging to assess brain structure in healthy\nand diseased brains,” The Lancet Neurology, vol. 2, no. 2, pp. 79-88, 2003.\n[3] N. Bernasconi, S. Duchesne, A. Janke, J. Lerch, D. L. Collins and A.\nBernasconi, “Whole-brain voxel-based statistical analysis of gray matter\nand white matter in temporal lobe epilepsy, ” NeuroImage, vol. 23, pp.\n717-723, 2004.\n[4] M. Kubicki, M. E. Shenton, D. F. Salisbury, Y. Hirayasu, K. Kasai, R.\nKikinis, F. A. Jolesz and R. W. McCarley, “Voxel-based morphometric\nanalysis of gray matter in first episode schizophrenia,” NeuroImage, vol. 17,\npp.1711-1719, 2002.\n[5] G. B. Karas, E. J. Burton, S. A. Rombouts, R. A. van Schijndel, J. T.\nO’Brien, P. Scheltens, I. G. Mckeith, D. Williams, C. Ballard and F.\nBarkhof, “A comprehensive study of gray matter loss in patients with\nAlzheimer’s disease using optimized voxel-based morphometry,”\nNeuroImage, vol. 18, pp. 895-907, 2003.\n[6] S. Keller, U. C. Wieshmann, C. E. Mackay, C. E. Denby, J. Webb and N.\nRoberts, “Voxel based morphometry of grey matter abnormalities in\npatients with medically intractable temporal lobe epilepsy: effects of side of\nseizure onset and epilepsy duration,” Journal of Neurology Neurosurgery\nand Psychiatry, vol. 73, pp. 648-655, 2002.\n[7] C. H. Salmond, J. Ashburner, F. Vargha-Khadem, A. Connelly, D. G. Gadian\nand K. J. Friston, “Technical note-the precision of anatomical\nnormalization in the medial temporal lobe using spatial basis functions, ”\nNeuroImage, vol. 17, pp. 507-512, 2002.\n[8] C. D. Good, I. S. Johnsrude, J. Ashburner and R. N. A. Henson, “A\nvoxel-based morphometric study of ageing in 465 normal adult human\nbrains,” NeuroImage, vol. 14, pp. 21-36, 2001.\n[9] S. S. Keller, M. Wilke, U. C. Wieshmann, V. A. Sluming and N. Roberts,\n“Comparison of standard and optimized voxel-based morphometry for\nanalysis of brain changes associated with temporal lobe epilepsy,”\nNeuroImage, vol. 23, pp. 860-868, 2003.\n[10] D. E. Job, H. C. Whalley, S. McConnell, M. Glabus, E. C. Johnstone and S.\nM. Lawrie, “ Voxel-based morphometry of grey matter densities in subjects\nat high risk of schizophrenia,” Schizophr Res, vol. 64, no. 1, pp. 1-13, 2003.\n[11] C. Gaser and G. Schlaug, “Brain Structures Differ between Musicians and\nNon-Musicians,” J Neurosci, vol. 23, no. 7, pp.9240-9245, 2003.\n[12] E. A. Maguire, D. G. Gadian, I. S. Johnsrude, C. D. Good and J. Ashburner,\n“Navigation-related structural change in the hippocampi of taxi drivers,”\nPNAS, vol. 97, no. 8, pp. 4398-4403, 2003.\n[13] S. Duchesne, N. Bernasconi, A. Janke, A. Bernasconi and D. L. Collins,\n“Within-group nonlinear registration improves VBM results,” Proc.\nISMRM, 2003.\n[14] C. Gaser, VBM Tools, Accessed at http:\/\/dbm.neuro.uni-jena.de\/vbm.html,\n2004.\n3054\n"}