{"doi":"10.1017\/S0028688502000279","coreId":"66872","oai":"oai:dro.dur.ac.uk.OAI2:67","identifiers":["oai:dro.dur.ac.uk.OAI2:67","10.1017\/S0028688502000279"],"title":"Jesus and purity : an ongoing debate.","authors":["Dunn, J. D. G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-10","abstract":"The importance of purity legislation and the \"separateness\" that it implied within Second Temple Judaism confirms the significance of the renewed interest in purity issues in \"historical Jesus\" research. The relevance of John the Baptist's \"baptism\" is less clear than at first appears. But that Jesus himself shared at least some purity priorities is implied by Mark 1.44 and by his \"cleansing of the Temple\". Yet he also sat loose to the purity \"halakhoth\" regarding clean and unclean and table-fellowship, which suggests that Jesus did not regard such concerns as central to the definition of Israel and its practice.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66872.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/67\/1\/67.pdf","pdfHashValue":"717c52bdef1a0ed49c812b537344171fe8f96f8b","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:67<\/identifier><datestamp>\n      2011-04-19T08:44:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Jesus and purity : an ongoing debate.<\/dc:title><dc:creator>\n        Dunn, J. D. G.<\/dc:creator><dc:description>\n        The importance of purity legislation and the \"separateness\" that it implied within Second Temple Judaism confirms the significance of the renewed interest in purity issues in \"historical Jesus\" research. The relevance of John the Baptist's \"baptism\" is less clear than at first appears. But that Jesus himself shared at least some purity priorities is implied by Mark 1.44 and by his \"cleansing of the Temple\". Yet he also sat loose to the purity \"halakhoth\" regarding clean and unclean and table-fellowship, which suggests that Jesus did not regard such concerns as central to the definition of Israel and its practice.\\ud\n<\/dc:description><dc:subject>\n        Second Temple Judaism<\/dc:subject><dc:subject>\n         Purity<\/dc:subject><dc:subject>\n         Baptism.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        New Testament studies, 2002, Vol.48(4), pp.449-467 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:67<\/dc:identifier><dc:identifier>\n        issn:0028-6885<\/dc:identifier><dc:identifier>\n        issn: 1469-8145<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0028688502000279<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/67\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0028688502000279<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/67\/1\/67.pdf<\/dc:identifier><dc:rights>\n        © 2002 Cambridge University Press<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0028-6885","0028-6885","issn: 1469-8145"," 1469-8145"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Second Temple Judaism","Purity","Baptism."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 May 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDunn, J. D. G. (2002) ’Jesus and purity : an ongoing debate.’, New Testament studies., 48 (4). pp. 449-467.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0028688502000279\nPublisher’s copyright statement:\n2002 Cambridge University Press\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nJesus and Purity: An Ongoing Debate*\nJAMES D. G. DUNN\nDept of Theology, University of Durham, Abbey House, Palace Green, Durham\nDH1 3RS\nThe importance of purity legislation and the ‘separateness’ that it implied within\nSecond Temple Judaism confirms the significance of the renewed interest in purity\nissues in ‘historical Jesus’ research. The relevance of John the Baptist’s ‘baptism’ is\nless clear than at first appears. But that Jesus himself shared at least some purity\npriorities is implied by Mark 1.44 and by his ‘cleansing of the Temple’. Yet he also\nsat loose to the purity halakhoth regarding clean and unclean and table-fellow-\nship, which suggests that Jesus did not regard such concerns as central to the defi-\nnition of Israel and its practice.\nOne of the main features of current investigations into the life and mission\nof Jesus is that they start from the recognition that Jesus was a Jew. The emphasis\nis part of the continuing reaction within Western scholarship to Christianity’s\nshameful heritage of anti-Judaism. And partly it is the result of scholarly recog-\nnition that Second Temple Judaism was itself a complex and diverse phenomenon\nwithin whose complexity and diversity it is possible more easily to locate Jesus \nthe Jew. But the move has generated its own set of problematic issues. As always\nwhen Jesus is seen as some sort of bridge figure between Judaism and Christianity,\nany attempt to pull him more firmly to one side provokes protest from those who\nsuspect his relation to the other side has been compromised.\nOne of the major issues thus triggered is that of Jesus and purity. The issue has\nbeen posed most sharply by E. P. Sanders,1 in debate particularly with J. Neusner,2\n\n* This paper was delivered at the SBL meeting in Denver, Colorado, in November 2001, in what\nwas intended to be a three-way debate with E. P. Sanders and Bruce Chilton. Unfortunately\nSanders was unable to be present in person (other than by video-presentation), so that the\ndebate could not develop as intended.\n1 E. P. Sanders, Jesus and Judaism (London: SCM, 1985); also idem, Jewish Law from Jesus to the\nMishnah: Five Studies (London: SCM, 1990), and Judaism: Practice and Belief, 63 BCE–66 CE\n(London: SCM, 1992).\n2 In his presentation at the Denver meeting Sanders urged that ‘everyone should read Jacob\nNeusner, The Idea of Purity in Ancient Judaism (SJLA 1; Leiden: Brill, 1973). This work opened\nthe modern discussion of the topic.’\nNew Test. Stud. , pp. –. Printed in the United Kingdom ©  Cambridge University Press\nDOI:10.1017\/S0028688502000279\nand by B. Chilton who has made his own distinctive contribution to the current\ndebate.3 The present paper is intended as a contribution to that debate. I start by\nrecalling the relevance of the subject for anyone who takes the Jewishness of Jesus\nseriously.\n1. The importance of purity in Second Temple Judaism\nIt cannot be doubted that purity was a major preoccupation in the Judaism\nof Jesus’ time.\n(a) The laws of clean and unclean were central to Jewish identity (Lev 11.1–23;\nDeut 14.3–21). Whatever the importance of such legislation before the exile, it is\nclear from 1 Macc 1.62–3 that the resolution ‘not to eat unclean food’ became a\ndefining characteristic of the Maccabean rebellion, and thus definitive for Jewish\nnational identity. The fact that Maccabean martyrs were prepared to die ‘rather\nthan to be defiled by food or to profane the holy covenant’ evidently imprinted\nitself upon Jewish subconsciousness. The inherent self-contradiction of a Jew\neating something unclean is well caught in Luke’s account of Peter’s vision on the\nrooftop in Joppa. According to that account, Peter, Jesus’ right-hand man, had\n‘never eaten anything that is common or unclean’ (Acts 10.14). Luke repeats the\nstory so that there should be no misunderstanding on the point: ‘nothing\ncommon or unclean has ever entered my mouth’ (Acts 11.8).\nOne aspect of the legislation on clean and unclean food which has not been\ngiven enough attention is the link between clean\/unclean and Israel’s separa-\ntion from the (other) nations. The point should have been clearer from Lev\n20.24–6:\nI am the LORD your God; I have separated you from the peoples. You shall\ntherefore make a distinction between the clean animal and the unclean, and\nbetween the unclean bird and the clean; you shall not bring abomination on\nyourselves by animal or by bird or by anything with which the ground\nteems, which I have set apart for you to hold unclean. You shall be holy to\nme; for I the LORD am holy, and I have separated you from the other\npeoples to be mine.\nHoliness and purity go hand in hand. To be pure is to be set apart to Yahweh,\nthat is, to be separated from other peoples that would infringe or compromise\n450  . . \n3 B. Chilton, The Temple of Jesus: His Sacrificial Program within a Cultural History of Sacrifice\n(University Park, PA: Pennsylvania State University, 1992); also idem, Rabbi Jesus: An Intimate\nBiography (New York: Doubleday, 2000). Also deserving of mention is M. Borg, Conflict,\nHoliness and Politics in the Teachings of Jesus (Harrisburg, PA: Trinity Press International,\n1984, 21998), and Jesus: A New Vision (San Francisco: Harper & Row, 1987).\nthat holiness, that purity. Israel had a divine mandate to maintain a distinct and\nseparate identity from the other nations (Gentiles).4 Here again the episode in\nActs 10–11 demonstrates the logic. That which is ‘common’ (koinov~ )5 is that\nwhich has not been ‘separated’ from common usage, that is, has not been ren-\ndered or treated as holy. In turn, Peter recognizes the logic of the revelation\ngiven to him: that the divine annulment of the laws of clean and unclean beasts\nmeans that Peter should no longer ‘call any man common or unclean’. And so\nhe willingly eats with uncircumcised Gentiles (11.3). The historical facts behind\nthe episode are not as clear as we might wish. Peter’s action in withdrawing\nfrom table-fellowship with Gentile believers in Antioch and ‘separating’ himself\nfrom them (Acts 2.12) raises questions which we need not go into here. The\npoint is firm whatever the precise facts and sequence of events. Both episodes\nbear clear testimony to the crucial role of the laws of clean and unclean in\ndefining Second Temple Jewish identity, and in enforcing the corollary of sep-\naration of Jews from Gentiles where clean\/unclean food marked the dividing\nline.\n(b) There is no need for me to go into detail regarding the rest of the biblical\npurity laws, relating particularly to the processes of human generation, birth and\ndeath (Lev 12–15). Sanders has provided a thorough documentation of the main\nimpurities and the requisite purifications.6 Two aspects, however, require some\nclarification.\nOne is the relation between impurity and sin. As Sanders has repeatedly\nobserved, impurity is not sin;7 to be impure was not wrong.8 But as already noted,\nholiness and purity are closely related, and breach of the holiness code is sin \nJesus and Purity: An Ongoing Debate 451\n4 The prophecy of Balaam in Num 23.9 was particularly significant for Jewish self-understand-\ning – ‘a people dwelling alone, and not reckoning itself among the nations’. ‘Exclusivism was\npart and parcel of Judaism’ (Sanders, Judaism, 266). The attitude is expressed in extreme\nform in Jub. 15.30–32 and 22.16; but note also Dan 1.8–16; Ep. Arist. 139, 142; and see further \nJ. D. G. Dunn, The Partings of the Ways between Christianity and Judaism (London: SCM,\n1991) 23–31.\n5 The uniquely Jewish sense of ‘profane, unclean, defiled’ is given because koinov~ was used as\nequivalent to the biblical tame’ (e.g. Lev 11.4–8; Deut 14.7–10; Judg 13.4; Hos 9.3) or chol (Lev\n10.10; Ezek 22.26; 44.23). The step was taken subsequent to the LXX rendering of the Hebrew\nBible, but was established in the Maccabean crisis (1 Macc 1.47, 62; note also Jos. Ant. 11.346),\nand is well attested in relation to eating food for mid-first-century CE by Rom 14.14 and Acts\n10.14; 11.18, as well as by Mark 7.2, 5.\n6 Sanders, Jewish Law, 134–51; idem, Judaism, 214–22. See also now T. Kazen, Jesus and Purity\nHalakhah: Was Jesus Indifferent to Impurity? (ConBNT 38; Stockholm: Almqvist & Wiksell,\n2002) esp. ch. 4.\n7 Particularly Jesus and Judaism, 182–3.\n8 In his video-presentation at Denver Sanders repeated what he has often said elsewhere: that\n‘most Jews were impure most of the time’.\n(e.g. Lev 19.8; 20.17; 22.9). And religious observance in a state of impurity is sin (e.g.\nIsa 6.7; 1 Enoch 5.4; Pss. Sol. 8.12–13).9\nThe other is the relation between purity and the Temple. There is no doubt\nthat the Temple was the focal point and reason for purity: if one was to approach\nthe holy God one had to be holy\/pure oneself. Strictly speaking, purification was\nonly necessary for those who wished to attend the Temple. That, however, did not\nmean that impurity could be treated lightly when one was distant from the\nTemple. Galilean Jews, for example, were several days’ journey away from the\nTemple, and might attend the Temple only during one pilgrim feast in the course\nof a year. That again does not mean that they could and did sit light to the purity\nlaws during the interval between visits to the Temple. As J. Milgrom has observed,\n‘the priestly laws of impurity (Lev 11–15) rest on the postulate that impurity\nincurred anywhere is potentially dangerous to the sanctuary’, and ‘the priestly\nlegislators are very much concerned with the need to eliminate, or, at least, con-\ntrol the occurrence of impurity anywhere in the land – whether in the home, on\nthe table, or in the bed’.10\n(c) The archaeological evidence provides surprisingly robust confirmation\nthat such logic was widely practised in the Judaism of Jesus’ day. Of direct rel-\nevance is what J. Reed calls four indicators of Jewish religious identity: stone\nvessels (chalk or soft limestone), attesting a concern for ritual purity;11 plastered\nstepped pools, that is, Jewish ritual baths (miqwaoth);12 burial practices, reflecting\nJewish views of the afterlife;13 and bone profiles without pork, indicating con-\nformity to Jewish dietary laws. Such finds have been made across Galilee, whereas\nthey are lacking at sites outside the Galilee and the Golan.14 This confirms the\n452  . . \n9 See further the discussion in Kazen, Jesus and Purity Halakhah, 201–19, who points out, in\ndiscussion with J. Klawans (below, n. 42), that the hattat sacrifice (usually translated as ‘sin-\noffering’) is present in all cases of defilement, except for semen emissions and menstruation,\n‘which implies that there are moral connotations to all these cases which require such sacri-\nfices’ (209–10).\n10 J. Milgrom, Leviticus (AB 3; 2 vols; New York: Doubleday, 1991) here 1.1007. Kazen also sees\nevidence of an ‘expansionist purity practice’ in Second Temple Judaism (Jesus and Purity\nHalakhah, 72–8).\n11 According to the Mishnah stone vessels are impervious to ritual impurity (Kelim 10.1; Ohol.\n5.5; Para. 5.5).\n12 See Sanders, Jewish Law, 214–27; R. Reich, ‘Ritual Baths’, OEANE 4.430–1. Over 300 ritual\nbaths from the Roman period have been uncovered in Judea, Galilee and the Golan (see e.g.\nJ. D. Crossan and J. L. Reed, Excavating Jesus: Beneath the Stones, Behind the Text [San\nFrancisco: Harper, 2001] 168–70).\n13 ‘Placing ossuaries inside so-called kokhim or loculi, horizontally shafted underground family\ntombs, was a distinctly Jewish phenomenon at the end of the Second Temple period’ (J. L.\nReed, Archaeology and the Galilean Jesus [Harrisburg, PA: Trinity Press International, 2000]\n47).\n14 Reed, Archaeology, 43–52.\ngrowing consensus that the population of Galilee at this time was characteristi-\ncally Jewish,15 and that as such, maintenance of purity was a consistent concern\nfor them, an integral part of their being Jewish.\nIt is true that some voices have been raised to query the identification of many\nof the stepped pools as miqwaoth.16 The principal reasons are the absence of a\ndividing partition (as at Qumran) to distinguish those descending into the\nmiqweh from those ascending (cf. m. Shekalim 8.2), and the absence of an adja-\ncent reservoir (as beside the miqweh close by the synagogue in Gamla). The issue\nis unclear: whether private miqwaoth would have had a dividing partition; and\nwhether the later mishnaic rules regarding reservoirs were already or were uni-\nversally observed.17 But there is no doubt that there were some miqwaoth at a dis-\ntance from the Temple, that is, at a distance which rules out the likelihood that\nthey functioned to purify only in preparation for attendance at the Temple. And\ngiven the other indications of active purity concerns in the Galilee of Jesus’ time,\nit remains likely that a good many of the pools thus far discovered did indeed\nfunction as miqwaoth.18\nEven with the reservations that the current dispute calls for, then, the evidence\nof an attentive practice of purity in the Galilee of Jesus’ time remains substantial.\nThat is to say, purity\/impurity was not regarded as a matter of insignificance or to\nbe treated lightly. Why would purification be sought on a regular basis at dis-\ntances so remote from the Temple if purity was only required to enter the Temple?\nIt can only be that impurity was regarded as undesirable, to be avoided as much\nas possible, and to be removed at the earliest opportunity. It is not without rel-\nevance to note the several episodes in the Synoptic Gospel tradition which reso-\nnate with purity concerns, resonances which would have been unmistakable for \na Palestinian Jewish audience (Mark 1.40–4; 5.1–20, 25–34; Luke 10.30–7). These\npassages will call for closer attention below.\n(d) In the light of the above discussion, the emphasis on purity which has been\nseen as distinctive of the Jewish ‘sects’, particularly the Pharisees and the Essenes,\nJesus and Purity: An Ongoing Debate 453\n15 See further my Jesus Remembered (Grand Rapids: Eerdmans, 2002) #9.6.\n16 H. Eshel, ‘A Note on “Miqvaot” at Sepphoris’, in Archaeology and the Galilee (ed. D. R.\nEdwards and C. T. McCollough; University of South Florida; Atlanta: Scholars, 1997) 131–3; \nB. G. Wright, ‘Jewish Ritual Baths – Interpreting the Digs and the Texts: Some Issues in the\nSocial History of Second Temple Judaism’, in The Archaeology of Israel: Constructing the \nPast, Interpreting the Present (ed. N. A. Silberman and D. Small; JSOTSup 237; Sheffield: \nJSOT, 1997) 190–214 (I am grateful to Kathleen Corley for the latter reference).\n17 Eshel notes that stepped pools of the period have been identified as miqwaoth, even though\nthey lack both features (‘Note’, 131).\n18 Kazen also notes the likelihood that the practice of tebul yom (immersion before sunset to\nreduce impurity) was already being enacted by this time, as is implied by the allusions in\n4QMMT B 15 and 4Q514, which would imply greater need for and use of miqwaoth (Jesus and\nPurity Halakhah, 76–81).\nshould be seen not so much as distinctive, rather as an exaggeration or reinforce-\nment or expansion of the purity concerns which characterized what Sanders calls\n‘common Judaism’.\nThe question of how important purity was for the Pharisees, and whether\nthey are rightly described in Neusner’s terms as a purity sect,19 is one of the\nbones of contention between Sanders and Neusner. Sanders objects to\nNeusner’s strong emphasis on this feature, though he concedes a good deal of\nkey ground while disputing its significance.20 But he seems to forget that where\nparticular religious practices are integral to a group’s identity, even ‘minor ges-\ntures’ can become make-or-break points of division.21 And more weight should\nsurely be given to the Pharisees’ very name, generally agreed to signify ‘separ-\nated ones’,22 and thus indicating a wider perception of the Pharisees as a group\nwho defined themselves by their concern to keep themselves apart – a primarily\npurity concern.23\nJosephus reports that the Pharisees handed down various traditions ‘to \nthe people’ (Ant. 13.297), which suggests that their degree of exclusivism was\n454  . . \n19 E.g. J. Neusner, From Politics to Piety: The Emergence of Pharisaic Judaism (Englewood Cliffs,\nNJ: Prentice-Hall, 1973).\n20 Sanders, Jewish Law, ch. 3; also idem, Judaism, particularly 431–40 (‘minor gestures’ – Jewish\nLaw, 232, 235; Judaism, 440). For Neusner’s own reply, see his ‘Mr. Sanders’s Pharisees and\nMine’, BBR 2 (1992) 143–69.\n21 G. F. Moore perceptively observed that ‘In all sects, and in every ecclesiola in ecclesia, it is the\npeculiarities in doctrine, observance, or piety, that are uppermost in the minds of the mem-\nbers; what they have in common with the great body is no doubt taken for granted, but, so to\nspeak, lies in the sectarian subconsciousness’ (Judaism in the First Three Centuries of the\nChristian Era [Cambridge, MA: Harvard University, 1927–30] 2.161). R. A. Kraft and G. W. E.\nNickelsburg similarly note: ‘In such instances, differences in interpretation and disputes\nabout law are raised to the level of absolute truth and falsehood and have as their conse-\nquences salvation and damnation’ (Early Judaism and its Modern Interpreters [Atlanta, GA:\nScholars, 1986] 18).\n22 Perushim, from parash, ‘to separate’; see e.g. E. Schürer, The History of the Jewish People in\nthe Age of Jesus Christ (rev. and ed. G. Vermes and F. Millar; Edinburgh: T. & T. Clark, 4 vols\n1973, 1979, 1986, 1987) 2.396–7; S. J. D. Cohen, From the Maccabees to the Mishnah\n(Philadelphia: Westminster, 1987) 162; A. J. Saldarini, Pharisees, Scribes and Sadducees in\nPalestinian Society (Edinburgh: T. & T. Clark, 1988) 220–5.\n23 See further Saldarini, Pharisees, 212–16, 233–4, 285–7, 290–1; G. Stemberger, Jewish\nContemporaries of Jesus: Pharisees, Sadducees, Essenes (Minneapolis: Fortress, 1995) 75–82; M.\nHengel and R. Deines, ‘E. P. Sanders’ “Common Judaism”, Jesus and the Pharisees’, JTS 46\n(1995) 1–70 (here 41–51); H. K. Harrington, ‘Did the Pharisees Eat Ordinary Food in a State of\nRitual Purity?’, JSJ 26 (1995) 42–54. The old view that the Pharisees sought to extend the holi-\nness of the Temple throughout the land of Israel, on the basis of Exod 19.5–6, is probably still\nwarranted (Schürer, History, 2.396–400; A. F. Segal, Rebecca’s Children: Judaism and\nChristianity in the Roman World [Cambridge, MA: Harvard University, 1986] 124–8; others in\nSanders, Jewish Law, 152).\nmotivated by a concern for the holiness (purity) of the whole people.24 It may\nindeed be that we should see their influence in the widespread concern for purity,\nas attested by the archaeological discoveries noted above (miqwaoth, stone\nvessels), that is, as reflecting characteristic Pharisaic concerns.25 As perhaps also\nby the popularity of the heroic story of Judith, which in its concern for purity could\nbe described as ‘early or proto-Pharisaic’.26 Equally fascinating is the possibility\nthat T. Mos. 7 is an attack on the Pharisees, by caricaturing Pharisaic concern to\nmaintain purity:27 ‘godless men, who represent themselves as being righteous’\nand who ‘with hand and mind . . . touch unclean things’, even though they them-\nselves say, ‘Do not touch me, lest you pollute me’ (7.3, 9–10)!\nIt is also worth noting that some see the basic issue separating Sadducees\nfrom Pharisees as that, once again, of purity.28 But there is no dispute that purity\nwas one of the driving motivations of the Essenes, as confirmed by the Qumran\ntexts, with their strict application of purity rules and discipline.29 Illuminating is\nJosephus’s description (now sufficiently confirmed by 1QS 6–7) of how the full\nmembers of the community bathed in cold water before their meal, ‘after which\nthey assemble in a private apartment which none of the uninitiated is permitted\nto enter; pure now themselves, they repair to the refectory, as to some sacred\nshrine’ (War 2.129). Or again, he speaks of the four grades of membership, and\nhow ‘a senior if but touched by a junior, must take a bath, as after contact with an\nalien’ (War 2.150). Equally illuminating has been what appears to be Qumran’s\nown explanation for or defence of their practice in 4QMMT: that they felt their\nown halakhoth touching many aspects of purity, with the implication that oppos-\ning rulings practised elsewhere breached the purity code, was sufficient justifica-\ntion for them to have ‘separated’ from the rest of the people, that is, to maintain\ntheir own (that is, Israel’s!) holiness.30\nThe point to be noted here is that such ‘separation’ of Pharisees and Essenes\nwithin Second Temple Judaism was only an exaggerated expression of a convic-\ntion close to the heart of Israel’s concept of election (to be separate from the\n[other] nations).\nJesus and Purity: An Ongoing Debate 455\n24 Hengel and Deines, ‘Sanders’ Judaism’, 30–1, 46–7, in contrast to the high degree of exclu-\nsivism shown by the Qumran people.\n25 Ibid., 34–5.\n26 Ibid., 48–9.\n27 So e.g. J. Jeremias, Jerusalem in the Time of Jesus (London: SCM, 1969) 250; D. Flusser, Jesus\n(Jerusalem: Magnes, 1969, rev. 1998) 60.\n28 G. G. Porton, ABD 5.892–3. ‘In the Mishnah and Tosefta most of the disputes between the\nSadducees and Pharisees (and others) concern interpretations of the laws of ritual purity’\n(Saldarini, Pharisees, 233).\n29 M. Newton, The Concept of Purity at Qumran and in the Letters of Paul (SNTSMS 53;\nCambridge: CUP, 1985).\n30 See my ‘4QMMT and Galatians’, NTS 43 (1997) 147–53 (here 147–8).\n(e) In the light of all this we can give fuller content to the description of Jesus\nas a Jew. If Jesus was brought up as a devout Jew, as I believe we can safely\nassume,31 then we can also assume, unless there is evidence to the contrary, that\nhe observed the laws of clean and unclean and purity, and that when he attended\nthe Temple he naturally observed the required purity ritual. Where he stood on\nthe various controversies within Judaism regarding purity, and its intensified\nobservation by Pharisees and Essenes in particular, is one of the issues that can\nnow be further clarified. The starting point for the discussion, however, is that\npurity\/impurity was regarded as a matter of primary concern for Judaism as a\nwhole, with the implication that Jesus the devout Jew would have shared that con-\ncern.\n2. John the Baptist\nIn an enquiry into Jesus and purity we can hardly ignore John the\nBaptist: partly because the unanimous tradition is that Jesus’ mission began\nfrom John; and partly because John was precisely ‘the Baptist’. As Chilton\namong others has stressed, the symbolism of purity is inescapable in a rite\ninvolving immersion (baptism) in water. But that initial consensus soon comes\nunder strain.\n(a) Why was John called ‘the Baptist’? The title is attested not simply \nby the Gospel writers – ‘the baptizer’ (oJ baptivzwn, Mark 6.14, 24), ‘the Baptist’ \n(oJ baptisthv~, Mark 6.25; 8.28; Matt 3.1; 11.11–12; 14.2, 8; 16.14; 17.13; Luke 7.20, 33; 9.19)\n– but also Josephus: ‘John, known as the Baptist (baptisthv~)’ (Ant. 18.116). So there\ncan be little doubt that that was how John was designated at the time. It is easy,\nhowever, to fail to appreciate the significance of the term; ‘Baptist’ is now so fa-\nmiliar to us as a title for John that we forget its unusualness. The English word\n‘baptize’ is, of course, a loan word, taken directly into English from the Greek\nbaptivzein. Behind baptivzein presumably lies the Hebrew\/Aramaic tabal. And\nsince we can hardly assume that the title ‘the Baptist’ was first coined in Greek, we\nmust assume that John was known as hattobel (Hebrew) or tabela (Aramaic). The\npoint is that in both cases (Aramaic and Greek) we are talking about a term or title\ncreated de novo. So far as we can tell, no one prior to John had been designated\n‘the Baptist’; in Greek the term is unique to John. That presumably indicates the\ncreation of a fresh usage: a foreign word is not usually drawn into another\nlanguage unless it describes something for which there is no adequate native\n456  . . \n31 The piety of the parents can be deduced from the names they gave their children (Mark 6.3)\n– James\/Jacob (the patriarch), Joses\/Joseph, Judas\/Judah, Simon\/Simeon (three of Jacob’s 12\nchildren, and heads of the resultant tribes), not to mention Jesus\/Joshua. See further my\nJesus Remembered, #9.9c.\nequivalent; and the direct translation (presumably) of tabela into oJ baptisthv~\nprobably signifies an equivalent recognition that an unusual\/unique role required\na fresh\/unique coinage. The uniqueness of the designation carries over from\nAramaic to Greek to English!\nThis immediately tells us that John was distinctive on this precise point. There\nhave been various speculations about ‘baptist movements’ in the Jordan valley,\nwith the implication that John’s was or may have been one of a number of such\npractices.32 But the fact that only John was picked out with this unusual formu-\nlation tells against such speculation.33 Similarly the much touted suggestion that\nJohn derived the act that gave him his nickname from an already established\npractice of proselyte baptism34 is seriously called in question.35 If there was an\nalready well-recognized practice of ‘baptism’, why would John be picked out as\n‘the Baptist’? The more plausible alternative, that John was influenced in at least\nsome measure by the emphasis placed on ritual bathing in Jewish piety, particu-\nlarly ‘down the road’ at Qumran,36 can still stand, but only if we recognize that the\nformulation of this specific designation must imply that John’s ritual was distinc-\ntive, requiring a fresh coinage, ‘baptism’.37 Further confirmation is provided by\nthe dialogue in Mark 11.28–33 pars., where the effectiveness of Jesus’ reply\ndepends on the high popular regard for what was a controversial innovation,\nJohn’s baptism (11.30).\n(b) What, then, was so different about John’s baptism? Two answers suggest\nthemselves at once. First, it was probably a once-for-all immersion, as distinct\nJesus and Purity: An Ongoing Debate 457\n32 A particular manifestation ‘of a much larger Jewish penitential and baptizing movement\naround the region of the Jordan in the 1st centuries BC and AD’ (J. P. Meier, A Marginal Jew,\nVol. Two: Mentor, Message, and Miracles [New York: Doubleday, 1994] 27), referring to J.\nThomas, Le mouvement baptiste en Palestine et Syrie (150 av. J.-C. – 300 ap. J.-C.) (Gembloux:\nDuculot, 1935). However, the only solid data we have for the period of John himself relates to\nthe Essenes and Josephus’s sometime ‘guru’ Bannus (Life 11–12).\n33 The fact that Josephus also uses baptismov~ and bavptisi~ (Ant. 18.117), as well as baptisthv~\n(Ant. 18.116), only here in his writings also signals his own awareness of the singularity of what\nJohn was doing. In contrast, for his description of Bannus’s ‘frequent bathings’ (Life 11) and\nthe daily ritual washings at Qumran (War 2.129) Josephus does not use a bapti- form, but\nforms of louvw (‘bathe, wash’).\n34 See e.g. those cited by G. R. Beasley-Murray, Baptism in the New Testament (London:\nMacmillan, 1963) 18 n.2.\n35 See further ibid., 18–31; L. H. Schiffman, ‘At the Crossroads: Tannaitic Perspectives on the\nJewish–Christian Schism’, in Jewish and Christian Self-Definition, vol. 2 (ed. E. P. Sanders;\nPhiladelphia: Fortress, 1981) 115–56 (here 127–31); R. L. Webb, John the Baptizer and Prophet:\nA Socio-Historical Study (JSNTSup 62; Sheffield: Sheffield Academic, 1991) 122–8.\n36 Beasley-Murray, Baptism, 11–18; W. D. Davies and D. C. Allison, Matthew 1–7 (ICC; Edinburgh:\nT. & T. Clark, 1988) 299.\n37 Cf. R. L. Webb, ‘John the Baptist and his Relationship to Jesus’, in Studying the Historical\nJesus (ed. B. Chilton and C. A. Evans; Leiden: Brill, 1994) 179–229 (here 187–9).\nfrom regular ritual baths. Although the text never says so explicitly, the inference\nis probably sound: otherwise we would expect John’s baptizing to be consistently\ndescribed in continuous tenses;38 pace Chilton, there is nothing to suggest that\nJesus was baptized by John more than once;39 and a once-for-all baptism corre-\nlates with John’s understanding of the imminent finality of the coming judg-\nment.40 Second, the fact that John is distinguished as ‘the baptizer’ reminds us\nthat in ritual immersion individuals immersed themselves. John was distinctive\nprecisely because he immersed others.41\nWorthy of more attention, however, is Mark’s description of ‘a baptism of\nrepentance for the forgiveness of sins’ (bavptisma metanoiva~ eij~ a[fesin\naJmartiwn`, Mark 1.4\/Luke 3.3). The people ‘were coming out to him and were being\nbaptized by him in the Jordan river confessing their sins’ (Mark 1.5\/Matt 3.5–6).\nThis would differentiate John’s baptism from the ritual purifications at Qumran\neven more. Not so much because immersion in a miqweh was for the removal of\nimpurity, not for the removal of sin; for in 1QS 3.6–9 the two cleansings seem to be\nclosely related.42 More because the ritual washings at Qumran were clearly part of\na larger complex in which commitment to and compliance with the ethos and\n458  . . \n38 Imperfect (Mark 1.5\/Matt 3.6); present (Matt 3.11\/Luke 3.16\/John 1.26); but also aorist (Mark\n1.8; Luke 3.7, 21).\n39 Chilton simply assumes that John’s baptism was ‘like Jewish baptism generally’ and so\ncould be repeated as necessity arose (Rabbi Jesus, 48; earlier his ‘John the Purifier’, in B.\nChilton and C. A. Evans, Jesus in Context: Temple, Purity and Restoration [Leiden: Brill, 1997]\n203–20).\n40 Meier, Marginal Jew, 2.51. The most obvious inference of Acts 19.3 is that a once-only baptism\nis envisaged.\n41 Webb, John the Baptizer, 180–1. This is the consistent picture of the Gospels (e.g. Mark 1.4, 5,\n8, 9 pars.).\n42 Ibid., 146–52. The rendering of 1QS 3.6–9 is important here: ‘By a spirit of true counsel con-\ncerning the paths of man all his iniquities are atoned, so that he can look at the light of\nlife. And by a spirit of holiness of the community, by its truth, he is cleansed of all his ini-\nquities. And by a spirit of uprightness and humility his sin is atoned. And by the humility\nof his soul towards all the statutes of God his flesh is cleansed by being sprinkled with the\nwaters of cleansing and sanctified with the waters of purification.’ The act of atonement,\nnormally linked to Temple sacrifice, is here attributed to the Spirit. The bath of purifi-\ncation cleanses the flesh. García Martinez wrongly translates the last phrase ‘the waters of\nrepentance’. J. Klawans, Impurity and Sin in Ancient Judaism (Oxford: OUP, 2000) con-\ncludes that ‘the sectarian [Qumran] approach to purity was quite different from that articu-\nlated in the Hebrew Bible, where moral impurity and ritual impurity remained distinct:\nSin did not produce ritual impurity, sinners were not ritually defiling, and sinners did not\nneed to be purified. At Qumran, sin was considered to be ritually defiling, and sinners had\nto purify themselves’ (90). Kazen is in basic agreement (Jesus and Purity Halakhah, 207).\nBut M. Himmelfarb, ‘Impurity and Sin in 4QD, 1QS and 4Q512’, DSD 8 (2001) 9–37,\nquestions whether the association of impurity and sin was characteristic of the Qumran\nsectarians.\nrulings of the community were fundamental (as the context of 1QS 3 makes clear).\nIn contrast, a baptism performed once, even with amendment of lifestyle, was\nrather different, both singular and innovative.43\nIt is the talk of ‘forgiveness of sins’ that should really catch the eye. This is not\nsimply the testimony of Mark. Here again Josephus confirms what otherwise\nmight be suspected. For though his description of John is obviously ‘dressed up’\nfor the benefit of his Roman readers, it is clear from his description that John was\nknown as one who linked his baptism closely to the ‘excusing’ of the sins of those\nbaptized (ejpiv tinwn aJmartavdwn paraithvsei) (Ant. 18.117).44 In fact it is Josephus’s\nlanguage that points us to the really innovative feature in John’s baptism. For the\nphrase just cited is cultic in character.45 That is to say, it reminds us that the Torah\nmade provision for sins to be dealt with through the sacrificial system. Of course,\nonly God could forgive sin; but a priest was an indispensable intermediary in the\noffering of the sacrifice.46 But John’s preaching gives no indication that a sacrifice\nor act of atonement was necessary. In a sense, baptism took the place of the sin-\noffering.47 That was the really distinctive feature of John’s baptism: not that he\nrejected the Temple ritual on the grounds that repentance alone was sufficient;\nrather that he offered his own ritual as an alternative to the Temple ritual.48\nPerhaps we should even say that John the Baptist in baptizing played the role of\nthe priest. How this went down with the Temple authorities we do not know.\nPossibly a once-only baptism would not be seen as much of a threat to the regular\nJesus and Purity: An Ongoing Debate 459\n43 It is Chilton’s emphasis on John’s baptism in terms of purification through ritual bathing\nthat presumably leads him to the conclusion that John’s baptism (ritual purifications)\nwere regularly repeated (see his Jesus’ Baptism and Jesus’ Healing [Harrisburg, PA; Trinity\nPress International, 1998] 26–9). But see Klawans, Impurity, 140–2. Kazen also understands\nthe Baptist’s baptism too much in terms of purification (Jesus and Purity Halakhah,\n231–9).\n44 Josephus uses aJmartav~, aJmavrthma and aJmartiva for ‘sin’ (LXX uses only the last two of these\nthree terms).\n45 Josephus uses aJmartav~ most often in his description of the sin-offering (Ant. 3.204, 230,\n238–40, 249). And although paraithvsi~ can mean both ‘request (that is, for pardon)’ and\n‘excuse’ (Ant. 2.43; Ap. 2.178), the closest parallels are in the same sequence in Ant. 3: 3.238 –\nan offering ‘in expiation of sins’ (ejpi; paraithvsesin aJmartavdwn); 3.221 – an offering ‘to make\nintercession for sins’ (ejpi; paraithvsei aJmarthmavtwn); 3.241 – ‘an expiation for sins’\n(paraithvsi~ uJpe;r aJmarthmavtwn); see also 3.246, 247; 11.137, 233.\n46 See e.g. J. S. Kselman, ‘Forgiveness’, ABD 2.831–2.\n47 At Qumran it was the community itself that atoned for sin ‘by doing justice and undergoing\ntrials’ (1QS 8.1–7, here 4; also 9.3–6); note also Jos. Ant. 18.19.\n48 C. H. Kraeling, John the Baptist (New York: Scribner’s, 1951); Webb, John the Baptizer, 203–5;\n‘John’s baptism was a ritual of atonement’ (Klawans, Impurity, 139, 143). In the Diaspora the\ndistance from the Temple would have encouraged the idea that sacrifices strictly speaking\nwere unnecessary (cf. Philo, Plant. 108; Mos. 2.107–8); but those who came out to John lived\nwithin easy distance of the Temple.\n‘trade’ in sin-offerings.49 Nevertheless, John stood in a prophetic tradition which\noffered an effective encounter with the divine, an effective alternative to that\nfocused in the Jerusalem Temple.\nMuch larger issues are opened up with such reflection, but the point for us\nhere is that simply to see the Baptist’s baptismal rite in terms of purification pays\ntoo little heed to its distinctiveness. And further, to see John’s baptismal rite as\nthough it was simply of a piece with traditional Jewish concerns regarding purity\nis to miss the point. The correlation of John’s baptism with forgiveness and its\nimplied imaging of the eschatological once-for-all (the ‘baptism’ to come) moves\nwell beyond such purity concerns and gives John’s baptism a quite different slant.\n(c) It is hardly appropriate to go into any detail in regard to John’s baptism of\nJesus. It must suffice simply to note that the above considerations make it unlikely\nthat Jesus underwent repeated immersions (baptisms) in John’s company, as\nChilton rather fancifully surmises.50 The same considerations likewise indicate\nthe improbability of Jesus continuing to baptize as a regular feature of his\nmission.51 It is true that John 3.22–4 reports a period of overlapping mission with\nJohn, in which Jesus seems to have modelled his mission on John’s. But the clear\nimplication of all the evangelists is that a firm line was drawn between the Baptist\nand Jesus as Jesus launched forth on his own distinctive mission. Had Jesus con-\ntinued to practise baptism (assuming that he had initially), then either the same\nepithet would most likely have been applied to him (‘Jesus the Baptist’), or the\nepithet could not have been retained in its unusualness for the Baptist alone.\nThe implication, then, is that Jesus may well have abandoned a practice that\nwould have most associated him with the Baptist, and also with the purification\nimagery which John’s practice evoked, even when John gave it his own distinctive\nslant.\n3. Did Jesus go out of his way to undermine purity rules?\nThe initial probe suggests, if anything, that Jesus, the devout Jew, turned\naway from even the purity concerns which motivated John to practise as ‘the\nBaptist’. Is this borne out by the rest of his mission?\n460  . . \n49 ‘An alternative to those sacrifices’ (Webb, ‘John the Baptist’, 197); ‘a clear alternative to the\nTemple’ (N. T. Wright, Jesus and the Victory of God [London: SPCK, 1996] 161); but would a\nonce-only baptism constitute an attempt to ‘replace’ the existing structures (160)? F.\nAvemarie, ‘Ist die Johannestaufe ein Ausdruck von Tempelkritik?’, in Gemeinde ohne Tempel\n\/ Community without Temple (ed. B. Ego et al.; Tübingen: Mohr Siebeck, 1999) 395–410, fairly\nconcludes that not so much criticism as indifference is indicated in regard to the Temple.\n50 Chilton, Rabbi Jesus, 55.\n51 Meier argues strongly for the view that Jesus did continue to baptize throughout his ministry\n(Marginal Jew, 2.120–9).\nOne obvious test case is Mark 1.40–4, ‘the cleansing of the leper’. Here a care-\nful middle course has to be steered. I have already observed that it was not wrong\nor sinful to contract impurity. On the contrary, the son of a parent who died was\nduty bound to contract impurity in attending to his father’s burial; the impurifi-\ncation caused by discharges from the sexual organs did not make the menstruat-\ning woman a sinner or require abstinence from sexual intercourse. So we cannot\nsay that Jesus touched the leper (1.41) in defiance of the purity code.52 And the\nprobable testimony of 1.44 is that Jesus instructed the leper to follow the required\nprocedure for a person with a contagious skin disease to be readmitted to\nsociety.53 In which case Jesus acted in accord with the purity laws.\nAt the same time, however, we should perhaps give weight to Chilton’s sug-\ngestion that what is in view in this episode is not Jesus’ attitude to the rules\nregarding impurity so much as the power of Jesus’ own purity. In this case Jesus\ncountered the contagion of impurity with the contagion of purity. Holiness for\nJesus, we might say, was not a negative, defiling force, but a positive, healing\nforce.54\nMuch the same could be said in regard to the episodes in the Jesus tradition\nwhere Jesus encounters the other main sources of impurity – corpse impurity\n(Mark 5.1–20, 21–4, 35–43; Luke 17.11–17) and discharge impurity (particularly Mark\n5.25–34). To be noted is the fact that Jesus is not remembered as going out of his\nway to defy the relevant purity laws: he incurred the first by his concern for those\nstruck by tragedy; and he incurred the second by the action of someone else (the\nwoman with the haemorrhage). At the same time, the stories again do not make\nthe purity issue explicit, though for any Jew telling or hearing these stories the\npurity implications would have been inescapable. The point is rather that Jesus\nseems to disregard the impurity consequences in such cases, so that it may be\nfairly concluded that Jesus was indifferent to such purity issues.55 And once again\nit may be valid to deduce that in these episodes we see the power of holiness\ncountering the contagion of impurity.\n4. Mark 7.1–23\nThe purity text in the Gospel tradition is, of course, Mark 7.1–23.\n(a) Did Jesus ignore or reject an already established halakhah regarding the\nimportance of washing hands before a meal – a purity halakhah? So Mark 7.1–8\nclearly indicates. Sanders doubts whether Pharisaic concern for purity of hands\nJesus and Purity: An Ongoing Debate 461\n52 As in Chrysostom’s Homily on Matthew 23.2.\n53 Discussion in Davies and Allison, Matthew 1–7, 16.\n54 Chilton speaks of Jesus’ ‘contagious purity\/holiness’ (Jesus’ Baptism, 58–71); similarly Borg,\nConflict, 134–6, but more widely applicable in his thesis (particularly 82–99).\n55 That Jesus was thus indifferent is Kazen’s principal thesis (Jesus and Purity Halakhah).\nhad developed so far before 70  and thus questions the historical veracity of the\nreport.56 But Mark has obviously inherited an account which captures much\nauthentic detail from the period: it speaks of hands as ‘defiled’, where the word in\nGreek (koinov~ \u0001 ‘common’) reflects the uniquely Jewish sense of ‘profane,\nunclean, defiled’;57 and the account reflects the importance in Pharisaic circles of\n‘the tradition (paravdosi~) of the elders’ (cf. e.g. Josephus, Ant. 13.297, 408; 17.41;\nLife 198; Gal 1.14), faithfully handed down (paralambavnw) to be observed by suc-\nceeding generations.58 So we can say firmly that we have here a pre-Markan tra-\ndition which clearly attests a pre-70 Pharisaic concern on the subject; and if\npre-70, then why not at the time of Jesus? The sensitivities on impurity contracted\nby touching are clear from of old.59 And the fact that a whole Mishnah tractate is\ndevoted to the subject, Yadaim (‘Hands’), indicates a long tradition history of\nhalakhic concern.\nThere is, therefore, no real reason to dispute the testimony (for that is what it\nis) of Mark 7 that the concern for purity of hands was already active in Pharisaic\nhalakhoth at the time of Jesus; it was a matter of concern for at least some (note\n7.1).60 Consequently, the testimony of Mark that Jesus defended a more casual\nattitude to purity tradition should be taken seriously.\n(b) The issue of purity is posed still more sharply in the latter section of the\npericope. For Mark 7.15, 19 poses the issue of food purity (and by implication ritual\npurity generally) in terms of outright antithesis (‘it is not possible for anything\nfrom outside to defile’; ‘thus he declared the end of the law distinguishing unclean\n462  . . \n56 Sanders, Jesus and Judaism, 185–6, 264–5. The argument is weakened by Sanders’s resort to\nsarcasm: ‘nor is it credible that scribes and Pharisees made a special trip to Galilee from\nJerusalem to inspect Jesus’ disciples’ hands’ (265). Luke knows a similar tradition and criti-\ncism in a different context (Luke 11.38).\n57 See above n. 5.\n58 Mark, or already the version which came to him, has made efforts to clarify the potential con-\nfusion of koinov~, by translating it to give the Greek its Jewish sense (‘that is, unwashed’), and\nby adding the exaggerated (‘all the Jews’?) explanation of vv. 3–4.\n59 E.g. Lev 5.2–3; 7.19, 21; 11.8, 24–8; Isa 52.11; 65.5; Hag 2.11–14; T. Mos. 7.9–10.\n60 In Jewish Law, 31, 39–40, 90–1, 228–31, Sanders observes that Pharisees practised hand-wash-\ning at their own sabbath and festival meals, but again notes that there is no evidence in rab-\nbinic literature that Pharisees washed their hands before eating ordinary meals. But how well\ngrounded is such a clear distinction in Pharisaic purity concerns between ‘sabbath and festi-\nval meals’ and ‘ordinary meals’? At least we can say that hand-washing prior to eating com-\nmunally would have been consistent with the concerns regarding the susceptibility of hands\nto uncleanness already evident in traditions attributed to the period (particularly m. Ber. 8.2,\n4; m. Mik. 1.5–6; further documentation in Sanders, Jewish Law, 228–31); see further especially\nKazen, Jesus and Purity Halakhah, 62–72, 81–5; R. P. Booth, Jesus and the Laws of Purity:\nTradition History and Legal History in Mark 7 (JSNTSup 13; Sheffield: JSOT, 1986) 194–202; J. C.\nPoirier, ‘Why did the Pharisees Wash their Hands?’, JJS 47 (1996) 217–33. Flusser follows G. Alon\nin concluding that prior to the destruction of the Temple, washing hands before a meal was\nregarded as advisable but not obligatory, and was not accepted by all the sages (Jesus, 59–60).\nfrom clean foods’). Many have concluded, on the assumption of Markan priority,\nthat Jesus abrogated the law of clean and unclean and abandoned the whole\nnotion of impurity.61 But as Sanders has observed, that is a much more difficult\nposition to maintain than is usually recognized. For if Jesus had spoken so clearly\nand decisively on the subject it becomes difficult to see how Peter could ever have\nbeen recorded as saying subsequently, ‘I have never eaten anything common or\nunclean’ (Acts 10.14; 11.8), or why the issue of food laws could have become so divi-\nsive in earliest Christianity (Gal 2.11–14; Rom 14.1–15.6; cf. 1 Cor 8; 10.20–30).62 We\nshould also observe that no memory of Jesus eating pork or non-kosher food is\npreserved in any Jesus tradition.\nThe issue is made more complex by the fact that Matthew seems to have\nedited the crucial elements in Mark’s version (Matt 15.11, 17–20). For he restates the\nteaching by omitting key words and phrases in Mark’s account: ‘nothing from\noutside . . . can defile’ (Mark 7.15, 18); ‘thus he declared all foods clean’ (7.19); ‘from\nwithin’ (7. 21, 23). In consequence, in Matthew’s version the outright antithesis has\nbecome more like a sharply drawn comparison, indicating priority of importance\nwithout denying validity to what is deemed of lesser importance.63 How to explain\nthis divergence? Is it simply that Matthew, writing in a context where Jewish law\nwas still highly regarded, has toned down the sharpness of Jesus’ teaching,64 has\n‘re-Judaized’ Jesus?65\nIn my own judgement, the discussion at this point has been distorted by the\nmodel of literary dependence as the exclusive explanation for such variations\nbetween Synoptic traditions. Even assuming Markan priority, does it necessarily\nfollow that the only version Matthew knew of Jesus’ teaching on purity was\nderived from Mark? On the contrary, it is likely that the Jewish-oriented com-\nmunities which Matthew represents would have known, and needed to have\nJesus and Purity: An Ongoing Debate 463\n61 See those cited in my Jesus Remembered, #14 n. 135. Kazen unwisely ignores the centrality of\nthe issue of clean\/unclean foods and limits the relevance of the passage to the issue of bodily\nimpurity and ritual hand-washing (Jesus and Purity Halakhah, 65).\n62 The point has been made most forcefully by Sanders: ‘the point of the saying [Mark 7.15] is so\nclear that the positions of the “false brethren”, Peter and James [referring to Gal 2.11–14]\nbecomes impossible to understand if the saying be considered authentic’ (Jesus and\nJudaism, 266). Similarly H. Räisänen, ‘Zur Herkunft von Markus 7.15’, in Logia: les paroles de\nJésus (ed. J. Delobel; Leuven: Leuven University, 1982) 477–84 (here 479–82).\n63 Sanders appositely cites as parallel Ep. Arist. 234: Jews honour God ‘not with gifts or sacri-\nfices, but with purity of heart and of devout disposition’ (Jewish Law, 28).\n64 See e.g. B. Lindars, ‘All Foods Clean: Thoughts on Jesus and the Law’, in Law and Religion.\nEssays on the Place of the Law in Israel and Early Christianity (ed. B. Lindars; Cambridge:\nJames Clarke, 1988) 61–71.\n65 H. Hübner’s discussion (Das Gesetz in der synoptischen Tradition [Witten: Luther, 1973]) is\nframed by talk of Matthew’s ‘(re-)Qumranizing’ and ‘(re-)Judaizing’ of the Gospel tradition\n(9–10, 237–9).\nknown, Jesus’ teaching in regard to purity long before Mark was written and cir-\nculated. In which case, it is likely that Matthew’s version represents the way the\ntradition was being retold in churches where continuity with Jewish tradition was\nmore important.66 Whereas Mark represents a performance trend, presumably in\nGentile or mixed churches,67 in which this tradition was heard as validating an\nantithesis between inward and ritual purity, Mark, or already his source, under-\nlines the trend by adding the interpretative note in 7.19. This is not an argument\nagainst Markan priority, that Matthew did know and use Mark at the time of\nwriting his Gospel. It is simply to affirm a more vital oral tradition independent of\nand prior to the written Gospels, and attesting already some at least of the diver-\nsity we see in the Synoptic tradition.68\nWe can conclude, then, that Jesus was recalled as speaking on the subject of\npurity, and as insisting that purity of heart is more important than ritual purity (cf.\nMatt 5.8; Matt 23.25\/Luke 11.39). Some heard Jesus as not content to debate issues\nof ritual purity solely at the level of ritual, but as pressing home the concerns\nbehind such law and halakhoth to the more fundamental level of purity of motive\nand intention.69 Others heard Jesus, when the teaching was rehearsed within\nwider circles of discipleship, as validating or commending a more radical conclu-\nsion, to the effect that Israel’s purity law no longer applied to the followers of\nJesus. Either way, Jesus evidently had no interest in making ritual purity a test case\nof covenant loyalty.70 The emphasis on matters of purity, so characteristic of the\nfactional rivalries of the time, was for Jesus an overemphasis.\n(c) Here it is necessary to enter a strong caveat against Chilton’s argument, not\nonly that ‘purity was Jesus’ fundamental commitment, the lens through which he\nviewed the world’,71 but also that for Jesus purity (not impurity) came from\nwithin.72 What is astonishing at this point is that he even quotes Mark 7.15 in\nsupport, in arguing that purity activated became the agent of the kingdom \n464  . . \n66 See further my ‘Jesus and Ritual Purity: A Study of the Tradition-History of Mark 7.15’, in\nJesus, Paul and the Law (London: SPCK, 1990) 37–60 (here 43–4).\n67 Rom 14.14 must provide some indication of the way the saying was being understood among\nGentile churches. It is generally regarded as one of the clearest echoes of Jesus tradition in\nPaul (see my ‘Jesus and Ritual Purity’, 50, with bibliography in 58 n. 73).\n68 In my ‘Jesus and Ritual Purity’ I note that the saying, particularly the Matthean form, goes\nback into an Aramaic mashal quite readily (41–2).\n69 Cf. Klawans, Impurity, 146–50: ‘Jesus nowhere defends ritual purity as a symbol of moral\npurity’ (149).\n70 T. Holmén, Jesus and Jewish Covenant Thinking (Leiden: Brill, 2001) 236–7: ‘he clearly ques-\ntioned the significance of the purity paradigm in the view of the Jews as the people of God’\n(251).\n71 Chilton, Rabbi Jesus, 90.\n72 ‘The innate purity of Israelites’ (ibid., 92); ‘Israelites were already pure and did not need to\nbe cleansed by elaborate ritual observances’ (140).\n(136).73 Since the point being made in Mark 7.15 is that impurity (not purity) comes\nfrom within, it is hard to see how Chilton can maintain his argument by appeal to\nthis text.\n5. Table-fellowship\nThere should be no doubt that table-fellowship was bound up with purity\nconcerns and regulated by purity halakhah. We need only recall the data mar-\nshalled above about the identity-defining importance of the laws of clean and\nunclean, and the way in which they played out in regard to the issue of association\nwith Gentiles and table-fellowship in the early Christian communities (Acts 10.28;\n11.3; Gal 2.12–14). Whatever the precise facts regarding the Pharisaic haburoth, the\nprobability is strong that purity concerns regulated the table-fellowship practised\nby many Pharisees. And the even stronger concerns of the Qumran community\nare well illustrated by 1QS 6–7 and 1QSa 2.3–10. It is not surprising, then, to be able\nto hear clear purity overtones in the criticisms directed against Jesus for consort-\ning with sinners at the meal table (particularly Mark 2.16 pars.; Matt 11.19\/Luke\n7.34).\nThe use of the term ‘sinners’ as part of the criticism should not surprise us. For\nit was already established as a term of condemnation within the factionalism of\nSecond Temple Judaism, and precisely as a way denying the validity of halakhoth\n(interpretations and practices) which diverged from those held dear by the\nspeaker’s faction.74 To refuse the legitimacy of divergent interpretations is ever the\nsectarian way of affirming the sole legitimacy of the particular sect’s interpre-\ntation; to be right oneself, it is necessary that all who disagree are wrong – not just\nof a different opinion, but ‘sinners’, law-breakers, criminals. In this case, to eat\nwith ‘sinners’ was to transgress what the critics regarded as the ‘obvious’ implica-\ntions of the purity code.\nHere again, then, the important conclusion can be drawn that Jesus did not\nfollow the logic of sectarian purity halakhah. The concern to keep oneself separ-\nate from the impure, as a way of professing Israel’s set-apartness (Lev 20.24–6),\nfound no echo in Jesus’ conduct and association either with fellow Jews, or with\n‘sinners’, or with such Gentiles as he occasionally encountered. If purity was a\nconcern of Jesus, it was an inclusive, not an exclusive, purity.\nJesus and Purity: An Ongoing Debate 465\n73 Ibid., 87, 136; similarly ‘A Generative Exegesis of Mark 7:1–23’, in Chilton and Evans, Jesus in\nContext, 297–319 (here 305–6). Similarly Temple: ‘bathing does not make one pure, but cele-\nbrates the fact of purity’ (123–5, 142).\n74 I have made this point several times; see e.g. my Partings, 103–5; Jesus Remembered, #13.5.\nKazen, Jesus and Purity Halakhah, again ignores the implications of purity requiring separ-\nation from the impure, and by extension from the ‘sinner’.\n6. The cleansing of the Temple\nSince the Temple was the focal point and raison d’être for the purity code,\nit is simply impossible to avoid the purity overtones of Jesus’ symbolic action in\nthe Temple (Mark 11.15–17 pars.), whatever precisely it consisted of. Pace Sanders,\nthe symbolism cannot be limited to that of destruction.75 Whether his actions are\nto be understood in terms of the ‘country boy’ appalled by the commercialization\nof the Temple cult, or as an act of protest against assumed or real abuse, or as\nsome kind of preparation of Mount Zion for its eschatological role, some sort of\n‘purifying’ (cleansing!) was bound to be at least part of Jesus’ motivation. We need\nonly think, for example, of passages like Isa 4.4, Mal 3.1–3 and Pss. Sol. 17.30, to rec-\nognize that the necessity for some sort of ‘purging’ of Israel’s focal centre was\nmore or less taken for granted within Jewish eschatological expectation.\nTo be more specific than that becomes exceedingly difficult: symbolism by its\nvery nature is more dependent for its effectiveness on the reactions it evokes than\non the message it conveys. But that some kind of transformation was in view is\nlikely. And that means also some kind of transformation of the purity system of\nwhich the Temple was the heart. Pace Chilton, it is more than doubtful whether\nJesus intended a reform of the mode and praxis of sacrifice.76 And the further\nsuggestion that Jesus intended to replace the cult sacrifice with the last supper\nmeal with his disciples77 smacks too much of special pleading on the part of those\n466  . . \n75 In the debate about the significance of Jesus’ act occasioned by Sanders, Jesus and Judaism,\n61–71, see R. Bauckham, ‘Jesus’ Demonstration in the Temple’, in Lindars, ed., Law and\nReligion, 72–89; C. A. Evans in Chilton and Evans, Jesus in Context, 395–439; H. D. Betz, ‘Jesus\nand the Purity of the Temple (Mark 11:15–18): A Comparative Religion Approach’, JBL 116\n(1997) 455–72; P. M. Casey, ‘Culture and Historicity: The Cleansing of the Temple’, CBQ 59\n–1997) 306–32; K. H. Tan, The Zion Traditions and the Aims of Jesus (SNTSMS 91; Cambridge:\nCUP, 1997) 166–81; J. Ådna, Jesu Stellung zum Tempel. Die Tempelaktion und das Tempelwort\nals Ausdruck seiner messianischen Sendung (WUNT 2.119; Tübingen: Mohr Siebeck, 2000)\n335–76. In contrast, D. Seeley, ‘Jesus’ Temple Act’, CBQ 55 (1993) 263–83, cannot find suffi-\ncient explanation at the historical level and deduces from the way Mark has integrated it into\nhis Gospel that the episode is better seen as a Markan composition.\n76 Chilton (Temple of Jesus, 100–11) in particular has developed an elaborate theory to explain\nwhy Jesus ‘occupied’ the Temple: the ‘occupation’ was designed to prevent the sacrifice of\nanimals acquired on the site; money-changing was not an issue (110–11) – that feature is likely\nfictional (130); he was seeking to realize the Targum of Zechariah’s prophecy of the kingdom\ncoming when offerings were directly presented in the Temple (without the intervention of\nmiddlemen) by both Israelites and non-Jews (Rabbi Jesus, 197–200). He notes a halakhah\nattributed to Hillel, that offerings should be brought to the Temple by the owners for sacri-\nfice, against the Shammaites’ insistence that an animal might be handed over directly with-\nout the owner laying hands on it (Temple, 101–2), and deduces that Jesus similarly regarded\nthe offerer’s actual ownership of what was offered as a vital aspect of sacrifice (109, 128).\n77 Chilton’s much repeated thesis (e.g. Temple, 150–4; Rabbi Jesus, 253–5); similarly Ådna con-\ncludes that the death of Jesus ‘replaces and supersedes the sacrificial cult in the Temple once\nfor all as the atoning death for the many’ (Jesu Stellung, 419–30 [here 429]).\nwho want to discern a seamless continuity between last supper and Lord’s\nSupper. But almost any thesis at this point is vulnerable to criticism, since the very\nlimited amount of data is open to a variety of readings. That is ultimately the frus-\ntration of the Temple episode for an enquiry into Jesus and purity: the episode is\nheavy with purity overtones, but the symbolical significance remains unclear.\nConsequently, if we are to draw firm conclusions in regard to Jesus and purity,\nwe are primarily dependent on the passages discussed earlier. The resultant con-\nclusions do share something of the same ambiguity. On the one hand, Jesus’\nassociation with the Baptist and acceptance of his baptism, as also his conformity\nwith the regulations regarding pronouncement of freedom from skin disease,\nboth attest a recognition of the importance of purity concerns within the com-\nmunity. The implication that he saw his action in the Temple as some sort of\nclimax to his mission confirms that the holiness it represented was important to\nJesus. On the other hand, the fact that he sat loose to the purity halakhoth regard-\ning clean and unclean and table-fellowship suggests equally, if not more strongly,\nthat he did not regard such concerns as central to his understanding of what con-\nstituted the Israel of God and what should regulate Jews’ social praxis of their\nreligion. It should probably not surprise us that it was the latter emphasis that the\nfirst Christians soon began to take up and develop.\nJesus and Purity: An Ongoing Debate 467\n"}