{"doi":"10.1017\/S004727941000067X","coreId":"220129","oai":"oai:eprints.lse.ac.uk:37339","identifiers":["oai:eprints.lse.ac.uk:37339","10.1017\/S004727941000067X"],"title":"Making the transition from sure start local programmes to children's centres, 2003-2008","authors":["Lewis, Jane","Roberts, Jonathan","Finnegan, C."],"enrichments":{"references":[{"id":17279084,"title":"A n n i n g ,A .a n dH a l l ,D .( 2008), ‘What was Sure Start and why did it matter?’,","authors":[],"date":"2006","doi":"10.4135\/9781446216620.n1","raw":"A n n i n g ,A .a n dH a l l ,D .( 2008), ‘What was Sure Start and why did it matter?’, in A. Anning and M.Ball(eds.),ImprovingServicesforYoungChildren:FromSureStarttoChildren’sCentres, London: Sage. B a g l e y ,C .a n dA c k e r l e y ,C .( 2006), ‘“I am much more than just a mum”: social capital, empowerment and Sure Start’, Journal of Education Policy, 21: 6, 717–734.","cites":null},{"id":17279085,"title":"B a g l e y ,C . ,A c k e r l e y ,C .a n dR a t t r a y ,J .( 2004), ‘Social exclusion, Sure Start and organizational social capital: evaluating inter-disciplinary multi-agency working in an education and health work programme’,","authors":[],"date":null,"doi":"10.1080\/0268093042000269162","raw":"B a g l e y ,C . ,A c k e r l e y ,C .a n dR a t t r a y ,J .( 2004), ‘Social exclusion, Sure Start and organizational social capital: evaluating inter-disciplinary multi-agency working in an education and health work programme’, Journal of Education Policy, 19: 5, 595– 607.","cites":null},{"id":17279087,"title":"D a h l b e r g ,G . ,M o s s ,P .a n dP e n c","authors":[],"date":"1999","doi":"10.1515\/9783110245240.71","raw":"D a h l b e r g ,G . ,M o s s ,P .a n dP e n c e ,A .R .( 1999), Beyond Quality in Early Childhood Education and Care: Postmodern Perspectives, London: Falmer Press.","cites":null},{"id":17279091,"title":"Editorial, Sure Start: key principles and ethos’, Child: Care,","authors":[],"date":"2002","doi":"10.1046\/j.1365-2214.2002.00249.x","raw":"Eisenstadt, N. (2002), ‘Editorial, Sure Start: key principles and ethos’, Child: Care, Health and Development, 28: 1, 3–4.","cites":null},{"id":17279094,"title":"H a n s e n ,K .a n dH a w k e s ,D .( 2009), ‘Early childcare and child development’,","authors":[],"date":"2013","doi":"10.1080\/03004430701217688","raw":"H a n s e n ,K .a n dH a w k e s ,D .( 2009), ‘Early childcare and child development’, Journal of Social Policy, 38: 2, 211–240. HouseofCommonsEducationandSkillsCommittee(2005a),EveryChildMatters:NinthReport of Session 2004–5,V o l u m e2,H C40-II, London: The Stationery Ofﬁce. HouseofCommonsEducationandSkillsCommittee(2005b),EveryChildMatters:NinthReport of Session 2004–5,V o l u m e1,H C40-1, London: The Stationery Ofﬁce.http:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48 612 jane lewis et al. Lewis,J.(inpress),‘FromSureStarttochildren’scentres:ananalysisofpolicychangeinEnglish early years programmes’, Journal of Social Policy.","cites":null},{"id":17279098,"title":"Implementing Sure Start Local Programmes: An In-depth Study,","authors":[],"date":"2005","doi":"10.1002\/chi.864","raw":"Tunstill, J., Meadows, P., Allnock, D., Akhurst, S., Chrysanthou, J., Garbers, C., Morley, A. and van de Velde, T. (2005c), Implementing Sure Start Local Programmes: An In-depth Study, NESS\/FR\/2005\/007, Nottingham: DfES.","cites":null},{"id":17279096,"title":"Implementing Sure Start Local Programmes: An Integrated Overview of the First Four Years,","authors":[],"date":"2005","doi":"10.1002\/chi.864","raw":"Tunstill, J., Meadows, P., Akhurst, S., Allnock, D., Chrysanthou, J., Garbers, C. and Morley, A. (2005a), Implementing Sure Start Local Programmes: An Integrated Overview of the First Four Years, NESS\/2005\/FR\/010, Nottingham: DfES.","cites":null},{"id":17279083,"title":"Improving Services for Young Children: From Sure Start to Children’s Centres,L o n d o n :S a g e .","authors":[],"date":"2008","doi":"10.4135\/9781446216620.n12","raw":"Anning, A. and Ball, M. (eds.) (2008), Improving Services for Young Children: From Sure Start to Children’s Centres,L o n d o n :S a g e .","cites":null},{"id":17279092,"title":"Letter to all SSLP Partnership Chairs,","authors":[],"date":"2003","doi":null,"raw":"Eisenstadt, N. (2003), Letter to all SSLP Partnership Chairs, 21 February.","cites":null},{"id":17279086,"title":"Outreach to Children and Families: A Scoping Study, Research Report DCSF – RR116,L o n d o n","authors":[],"date":"2009","doi":null,"raw":"Capacity (2009), Outreach to Children and Families: A Scoping Study, Research Report DCSF – RR116,L o n d o n :D C S F .","cites":null},{"id":17279088,"title":"Sure Start Children’s Centres: Phase 3 Planning and Delivery,N o t t i n g h a m","authors":[],"date":null,"doi":null,"raw":"DCSF (2007), Sure Start Children’s Centres: Phase 3 Planning and Delivery,N o t t i n g h a m :D C S F . DfES(2003a),SureStartGuidance2004–6:OverviewandLocalDeliveryArrangements,Annesley, Nottingham: DfES.","cites":null},{"id":17279090,"title":"Sure Start Children’s Centres: Planning and Performance Management Guidance, Annesley,","authors":[],"date":"2006","doi":null,"raw":"DfES (2006), Sure Start Children’s Centres: Planning and Performance Management Guidance, Annesley, Nottingham: DfES DfES (2007), Governance Guidance for Sure Start Children’s Centres and Extended School, Annesley, Nottingham: DfES.","cites":null},{"id":17279089,"title":"Sure Start Guidance 2004–2006: Delivery Guidance, Annesley,","authors":[],"date":"2005","doi":null,"raw":"DfES (2003b), Sure Start Guidance 2004–2006: Delivery Guidance, Annesley, Nottingham: DfES DfES (2005), Sure Start Children’s Centres: Practice Guidance, Annesley, Nottingham: DfES.","cites":null},{"id":17279097,"title":"Sure Start local programmes: implications of case study data from the National Evaluation of Sure Start’,","authors":[],"date":null,"doi":"10.1002\/chi.864","raw":"Tunstill, J., Allnock, D., Akhurst, S. and Garbers, C.,(2005b), ‘Sure Start local programmes: implications of case study data from the National Evaluation of Sure Start’, Children and Society, 19: 158–171.","cites":null},{"id":17279095,"title":"Sure Start, London: Social Innovation Exchange.","authors":[],"date":"2008","doi":null,"raw":"Mulgan, G., Ali, R., Halkett, R. and Sanders, B. (2008), Sure Start, London: Social Innovation Exchange.","cites":null},{"id":17279093,"title":"Sure Start: where did it come from; where is it going?’,","authors":[],"date":"2006","doi":"10.1136\/inpract.28.8.490","raw":"Glass, N. (2006), ‘Sure Start: where did it come from; where is it going?’, Journal of Children’s Services, 1: 1, 51–57.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-07","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220129.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37339\/1\/Lewis_Making_the_transition_2011.pdf","pdfHashValue":"f512bdba837814fc836cc82b437ed23b8097d1b6","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37339<\/identifier><datestamp>\n      2015-05-27T10:20:07Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37339\/<\/dc:relation><dc:title>\n        Making the transition from sure start local programmes to children's centres, 2003-2008<\/dc:title><dc:creator>\n        Lewis, Jane<\/dc:creator><dc:creator>\n        Roberts, Jonathan<\/dc:creator><dc:creator>\n        Finnegan, C.<\/dc:creator><dc:subject>\n        HN Social history and conditions. Social problems. Social reform<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2011-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37339\/1\/Lewis_Making_the_transition_2011.pdf<\/dc:identifier><dc:identifier>\n          Lewis, Jane and Roberts, Jonathan and Finnegan, C.  (2011) Making the transition from sure start local programmes to children's centres, 2003-2008.  Journal of Social Policy, 40 (3).  pp. 595-612.  ISSN 0047-2794     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP<\/dc:relation><dc:relation>\n        10.1017\/S004727941000067X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37339\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP","10.1017\/S004727941000067X"],"year":2011,"topics":["HN Social history and conditions. Social problems. Social reform"],"subject":["Article","PeerReviewed"],"fullText":"  \nJane Lewis, Jonathan Roberts and Cathy Finnegan \nMaking the transition from Sure Start local \nprogrammes to children's centres, 2003-2008 \n \nArticle (Published version) \n(Refereed) \n \n \n \n \nOriginal citation: \nLewis, Jane, Roberts, Jonathan and Finnegan, Cathy (2011) Making the transition from Sure \nStart local programmes to children's centres, 2003-2008. Journal of social policy, 40 (3), pp. \n595-612. \n \nDOI: 10.1017\/S004727941000067X \n \n© 2011 Cambridge University Press \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/37339\/ \nAvailable in LSE Research Online: August 2013 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nJournal of Social Policy\nhttp:\/\/journals.cambridge.org\/JSP\nAdditional services for Journal of Social Policy:\nEmail alerts: Click here\nSubscriptions: Click here\nCommercial reprints: Click here\nTerms of use : Click here\nMaking the Transition from Sure Start Local\nProgrammes to Children's Centres, 2003–2008\nJANE LEWIS, JONATHAN ROBERTS and CATHY FINNEGAN\nJournal of Social Policy \/ Volume 40 \/ Issue 03 \/ July 2011, pp 595 - 612\nDOI: 10.1017\/S004727941000067X, Published online: 25 August 2010\nLink to this article: http:\/\/journals.cambridge.org\/abstract_S004727941000067X\nHow to cite this article:\nJANE LEWIS, JONATHAN ROBERTS and CATHY FINNEGAN (2011). Making the\nTransition from Sure Start Local Programmes to Children's Centres, 2003–2008.\nJournal of Social Policy, 40, pp 595-612 doi:10.1017\/S004727941000067X\nRequest Permissions : Click here\nDownloaded from http:\/\/journals.cambridge.org\/JSP, IP address: 158.143.197.48 on 29 Aug 2013\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nJnl Soc. Pol. (2011), 40, 3, 595–612 C© Cambridge University Press 2010\ndoi:10.1017\/S004727941000067X\nMaking the Transition from Sure Start Local\nProgrammes to Children’s Centres,\n2003–2008\nJANE LEWIS∗, JONATHAN ROBERTS∗∗ and CATHY FINNEGAN∗∗∗\n∗[contact] Department of Social Policy, London School of Economics and Political Science,\nHoughton Street, London WC2A 2AE\nemail: J.Lewis@lse.ac.uk\n∗∗Research Officer, Department of Social Policy, LSE\n∗∗∗Research Officer, Department of Social Policy, LSE\nAbstract\nSure Start local programmes (SSLPs), an area-based early intervention programme for\nunder fives in England set up in 1998, was replaced by children’s centres (CCs), a universal,\nmainstream service, under the control of local authorities in 2003. This paper uses qualitative\ndata from three urban authorities in an exploratory study that investigates how far CCs differ\nfrom SSLPs, and how far they are more recognisably similar to one another than were SSLPs. We\nexplore interviewees’ understandings of the idea of an SSLP and of a CC; differences between\nthe core offers of the two programmes in terms of funding, consistency, local responsiveness\nand the balance of services; issues arising from making CCs a mainstream service; and changes\nin governance in terms of information flows, lines of accountability and parent participation.\nWe find that while CCs differ from SSLPs in significant respects, they also differ one from the\nother, and we offer some reflections on the possible causes of this.\nIntroduction\nSure Start was an area-based early intervention programme for under fives in\nEngland and a flagship policy for New Labour, which was intended to bring\ntogether a range of services, including family support, health services and support\nfor special needs, as well for childcare and education. Reporting directly to central\ngovernment’s Sure Start Unit, the Sure Start local programmes (SSLPs) enjoyed\nconsiderable autonomy and tended to be particularly responsive to local parents.\nThe final wave of SSLPs was not approved until 2002. But in 2003 it was decided\nthat SSLPs would be replaced by a network of children’s centres (CCs), providing\nuniversal coverage.1 The reasons for the shift in policy were complicated and have\nbeen addressed elsewhere (Lewis, in press). What the shift was intended to mean\nat the local level was also somewhat unclear. Naomi Eisentstadt, the director of\nthe Sure Start Unit set up in 1998 under the auspices of both the Department\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n596 jane lewis et al.\nfor Education and Skills and the Department of Health, wrote in 2003 to assure\nSSLPs that\nby embedding SSLPs in the local authority’s strategic vision for the delivery of children’s services\nin your area, we will ensure that the additional children’s centres’ funding will build on what\nyou have already started and improve mainstream services. (Eisenstadt, 2003)\nIn this interpretation, the move to create a network of CCs to cover the whole of\nEngland represented the ‘mainstreaming’ of Sure Start into a universal service.\nThis resulted in a trebling or quadrupling of the number of centres in each of\nthe three local authorities studied for this project during the first two phases of\npolicy development (between 2004 and 2008). The new CCs were called ‘Sure\nStart Children’s Centres’ in the policy documents, but some local authorities\nnever used this term, preferring ‘integrated children’s centres’ and, increasingly,\njust ‘children’s centres’.\nNotwithstanding the Sure Start Unit’s assurances regarding continuity,\nthe shift to a universal programme of CCs entailed some significant changes.\nFirst, their introduction meant not only turning SSLPs into CCs, but also the\n‘designation’ of other facilities (such as neighbourhood nurseries, maintained\nnurseries, early excellence centres and family centres) as CCs, as well as the\ncreation of new centres, often in conjunction with primary schools. Second, the\nofficial guidance made it clear that CCs in the 30 per cent most deprived areas\nwere to provide ‘a core service offer’, which put considerably greater emphasis\non the provision of childcare and education than had been usual for SSLPs. The\nguidance also set out government’s expectations for the way in which the new\nservice should work. Third, there were major changes in governance, with local\nauthorities, rather than central government, assuming responsibility for CCs.\nCCs were to be a universal, mainstream service, working in partnership with\nother services, such as health, at the local level. It was, however, acknowledged\nthat there must be more support for those with greatest need, meaning that\nservices would not be the same everywhere (DfES, 2006). Thus, centres in the\n70 per cent better-off areas would provide a more limited range of services. SSLPs\nhad developed largely in response to local needs and demands, and tended to be\nvery different from one another. The more top–down approach to developing\nCCs makes it reasonable to pose the question as to how far CCs are different\nfrom SSLPs and how far they are more ‘recognisably similar’ entities. In this\nexploratory study of ‘processes’,2 we can only begin to answer these questions;\nfurthermore, we find that the answers are far from simple. While there is evidence\nof real change, we suggest that longstanding, deep continuities in terms of the\nfragmentation of both early years provision and the early years workforce have\nmilitated against the emergence of a more uniform service.\nThe first part of the paper describes the policy shift from SSLPs to CCs and\nidentifies the main dimensions of change highlighted by the policy documents,\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 597\nwhich formed the starting point for the empirical investigation. The second part\nuses interview data first to document differences in the idea and role of SSLPs\nand of CCs, and second to examine how far the differences in the prescriptions\nfor CCs in regard to the service offer, mainstreaming centres and changes in\ngovernance have resulted in more tightly specified provision.\nMethods\nThe paper is based on interviews carried out with 18 staff covering all the CCs\n(three of which had been SSLPs), together with three local authority officers, in\none urban local authority. A further 13 interviews were carried out in two other\nurban authorities in order to provide a check on the findings. In one of these,\nfive CCs were visited (almost a fifth of the total), one of which had been an SSLP;\nand, in the second, six CCs were visited (three of which had been SSLPs), a much\nsmaller fraction of the total number. Some 16 interviewees had experience of an\nSSLP (including the three local authority officers), 12 in the local authority in\nwhich they were interviewed. Appendix 1 provides information on the posts held\nby interviewees and on the origin of the CCs visited. The interview data from the\nthree authorities have been pooled because, for the most part, the main issues\nwere very similar for all three areas; the text indicates points of difference. The\nSSLPs usually became CCs in phase 1 of their development (2004–6). All but\none of the CCs visited for this study were in the 30 per cent most deprived areas\n(CCs for the 70 per cent of better-off areas began to be developed from 2008).\nThe interviews with staff who had not been employed by SSLPs are identified\nin the text and used as and when they further illuminate key points. Thirty-one\ninterviews were carried out with one person; the remaining three interviews were\ncarried out with two people, usually the centre manager and the head of the\nschool on whose premises the centre was located. All interviews were transcribed\nand analysed manually.\nPolicy background\nThe SSLPs launched in 1998offered outreach and home visits, support for families\nand parents (including support groups, drop-in and parenting sessions); support\nfor good quality play, learning and childcare; primary and community health care\nand advice about child and family health; and support for children with special\nneeds. They could also provide additional services in response to local need – for\nexample, advice on housing or welfare benefits – and there was usually enough\nmoney to respond to parents’ wishes regarding social events. Services could be\nprovided by the SSLP, or money could be given to a provider – for example, to\nthe primary care trust, to fund an extra health visitor.\nSure Start had strong ambitions regarding the development and\nempowerment of local communities (Glass, 2006). Naomi Eisenstadt (2002: 3\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n598 jane lewis et al.\nand 4) commented that ‘probably the most important’ of Sure Start’s principles\nwas the injunction to involve parents and carers: ‘The fundamental premise is that\nbetter outcomes can only be achieved with the active participation of parents.’\nIndeed, only provision for special needs and for early years’ education focused\non the child alone; other parts of the services offered by SSLPs were usually\nfocused on the parent and child, or just the parent (Tunstill et al., 2005a). The\nnational targets set for SSLPs also focused on parents as much as the children,\nincluding a reduction in the proportion of workless adults in households and\nin the proportion of mothers who smoked, and an increase in the proportion\nwho breastfed. Anning and Hall (2008: 4) have recorded their view that ‘the story\nof Sure Start exemplified a tension between the rhetoric of local empowerment\nand the realities of central government control’. Nevertheless, SSLPs were given\nconsiderable autonomy as to how they delivered their services and met the targets.\nThe core offer for CCs was set out as: integrated early education and care,\noutreach to parents, family support, health services, information about other\nchildcare providers and community services, effective links with Jobcentre Plus,\nand workforce training. This list overlapped considerably with that for SSLPs,\nbut the focus on childcare and education, alongside the link to the employability\nagenda via Jobcentre Plus, together with the injunction to reach vulnerable\nparents, were new. In respect of the last of these, the interim report of the National\nEvaluation had made the damaging claim that Sure Start had not reached the most\ndisadvantaged families, had only produced modest benefits for the moderately\ndisadvantaged, and even small adverse effects for those most at risk (NESS, 2005).\nIn respect of childcare, the early official guidance set targets for the creation\nof new childcare places by CCs (DfES, 2003a) in line with the local authorities’\nobligation (from 2006) to provide a ‘sufficiency’ of childcare and, from September\n2008, fully integrated early years education and full daycare. Expectations regard-\ning the staffing of centres in the 30per cent most disadvantaged areas were also laid\nout by 2007, and gave strong encouragement to the appointment of a teacher and\na graduate early years professional (DCSF, 2007: App. 1), just as the targets set for\nCCs by central government focused more on children’s cognitive achievements.\nGovernment Ministers assured the House of Commons Education and Skills\nCommittee that CCs were a continuation of Sure Start. Thus, CCs would be\n‘community driven, parent driven and will retain that essence of Sure Start which\nhas made it so successful’ (House of Commons Education and Skills Committee,\n2005a Q. 479; see also DfES, 2006: 3). But the introduction of CCs involved\nconsiderable ‘up-scaling’ in provision. CCs were to become a mainstream service\nunder local authority control (DfES, 2006:3), working in partnership with other\nservices in the public, private and third sectors. Indeed, the 2006 Childcare Act\nmade health services and Jobcentre Plus statutory partners in providing services.\nHow parent participation was to be fitted into the new model of governance\nremained opaque.\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 599\nFindings\nThe idea and role of a CC compared to an SSLP\nGovernment spokespersons and documents represented the shift to CCs\nas something that built on Sure Start. While interviewees were broadly agreed\nthat both the underpinning principles and broad goal of the two programmes –\nto do the best for children – were similar, one of the local authority officers\ncommented that ‘children’s centres were packaged as Sure Start grown up [our\nitalics]’. In addition, as another local authority officer observed, people’s jobs had\noften ‘evolved with the Government’s agenda’ in ways that were not always easy\neither to recall or explain to an interviewer. Nevertheless, interviewees revealed\ndifferent approaches to CC provision.\nSSLPs were described by one manager as ‘tighter’ because they were more\noften located in one place (with seconded staff: for example, health visitors) than\nare the CCs. In urban areas, CCs often conform to a ‘hub and spoke’ model, with\na ‘lead setting’ identified by the local authority and other sites delivering other\nparts of the core offer, particularly childcare and education. As a manager put it:\n‘to me a children’s centre is not a building . . . it’s an umbrella, isn’t it?’. However,\nas many respondents acknowledged, this made it ‘confusing’, ‘misleading’ or\neven ‘meaningless’ for parents, who tended to think of a children’s centre as\na building, when in fact it is a service. But the idea of a centre as a ‘one stop\nshop’ for people with children under five is difficult to sustain when in practice\nservices are delivered in several different places. Front-line staff tended to talk\nmore about the changes that had taken place than did managers, largely because\nCCs had affected their ways of working. In fact, there was little evidence as to a\nstrongly focused perception of a children’s centre; rather, views differed according\nto the particular institutional history of the centre and the approach taken by the\nstaff, particularly the managers, which was in turn influenced by their different\ndisciplinary backgrounds.\nThe longer history of development of both SSLPs and CCs is crucial for\nunderstanding the approach to centres locally. For example, four of the former\nSSLPs visited in two of the authorities had been based in maintained nursery\nschools that then became ‘lead settings’ for CCs. Three of the managers were\nnursery school heads, and were convinced that in essence the nurseries had\ncontinued to work as they always had – pre- and post-Sure Start – with one\nstressing that the nursery had always also included services to support parents.\nOne of these managers felt strongly that the extra staff brought in by the\ndevelopment of the SSLP had worked in something of a ‘parallel universe’, as\n‘a team operating alongside the nurseries’, focusing on securing community\nrepresentation and bringing family support services together. Because of their\nbackground in early years education, these managers were convinced of the\noverwhelming importance of educational achievements for children – something\nthat the CCs agenda also brought to the fore – and thus felt that in essence ‘the\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n600 jane lewis et al.\nnursery is the children’s centre and the children’s centre is the nursery’. The\nprofessional background of these heads and managers of CCs was crucial in\nforming their ideas about SSLPs and centres.\nCCs serving the most disadvantaged areas were required to provide the core\noffer and to focus more strongly on educational outcomes for children and on\nincreasing the employability of parents, shifts that were clearly recognised by\nrespondents with experience of both programmes. However, paradoxically, it\nwas not uncommon to find interviewees with no previous experience of Sure\nStart stressing the importance of parents’ views about the services that should\nbe provided and emphasising the importance of other parts of the core offer.\nThus, a manager of a recently established children’s centre run by a voluntary\norganisation replied to a question on the role of the centre thus: ‘I like to refer\nto this as a family centre. We have to call it a children’s centre, but . . . that is\nmore government policy I would say. The role of this particular centre as I see it\nis to support local families.’ While this manager had no knowledge of Sure Start,\nhis priorities were more in keeping with the idea of an SSLP than of a children’s\ncentre. Indeed, a recent report on outreach work commented on the basis of\nwork in 55 centres that ‘although called CCs, in reality much, if not most, of their\nwork is with parents who are adults’ (Capacity, 2009: 4).\nCCs should be seen as a service rather than a building. However, continuities\nin terms of both the institutional histories of the centres and the approaches\ntaken by managers in particular seem to have been important factors accounting\nfor different approaches to delivering the core service offer.\nChanges in the core offer: issues of funding, consistency, local\nresponsiveness and balance\nRespondents were agreed that the bulk of funding for CCs is absorbed by\nlabour costs and that there was limited room for the provision of services that\nmight be requested by parents after core services had been provided. The funding\nper child for SSLPs was in any case much more generous. One local authority\nofficer referred to this rather disparagingly as having provided money for services\nsuch as ‘baby yoga’ requested by middle-class mothers; a CC manager said that\n‘I’ve known [SSLP] managers who’ve bought ponies with Sure Start money’; while\na voluntary sector provider in another authority referred to the ‘bribe money’ that\nhad been available in SSLPs to fund trips to the seaside or leisure centre passes and\nthus to entice disadvantaged families into the SSLP. Certainly, SSLPs had enough\nmoney to respond to a wide variety of requests from parents and to particular\nlocal needs; all respondents who had worked in them considered that they had\nbeen well funded and many expressed the view that it could not be expected that\nsuch a level of funding would be sustained. In all the CCs visited for this study,\nthere was a small amount of discretionary money – usually about £5,000 per\nyear – to spend on additional services, but one manager said that her centre was\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 601\nunable to do even a quarter of the work with the money allocated to CCs that they\nhad done as an SSLP (this centre was run by a voluntary organisation as a social\nenterprise and the manager thus was able to rely on other streams of funding).\nSeveral interviewees anticipated that future cuts in public sector expenditure\nwould result in more charging and a more basic level of service.\nGiven the tighter service specification for CC, it is reasonable to expect that\ncentres would offer a more consistent service than had SSLPs. One local authority\nofficer commented that ‘[i]f you’ve got a universal service to offer, you can have\nit locally tailored to local need, but you need some consistency in the way it runs\nbecause of money and accountability’. But a second officer in the same authority\nwas rather more cautious about imposing a more standard core offer across CCs:\nyou’ve got greater control and greater consistency with CCs, because you’ve got the local\nauthority involved . . . [but] that can also be, you know, a disadvantage if it’s not managed\ncarefully, because you kind of, lose some of that, I mean, local identity’s really important in\nresponding to local need, so you have to be careful that you enable that to continue as well as\nkeeping a kind of, centralised approach.\nThese comments about the differences in the nature of services provided by SSLPs\nand CCs wrapped up two issues: the extent to which the CC core offer resulted\nin greater consistency and the extent to which CC services were less responsive to\nlocal need.\nThe extent to which services became more consistent or standardised is\ndifficult to assess. Some primary school heads who had only become involved in\nCCs since 2006 felt that services were still ‘bitty’ in the words of two interviewees,\nand wanted much more consistency. But an outreach worker, who had worked in\nthe same place when it had been an SSLP commented regretfully: ‘so it’s a case of\nwell, we’ve decided that the parenting programme we [the local authority] will\noffer is this, or the exercise programme we will offer is that and you will have to go\non this training and then you have to roll it out’. Local authorities were advised,\nfor example, to choose from ‘evidence-based’ parenting programmes (usually\nAmerican and in one case Australian), one of the criticisms of SSLPs having been\nthat they focused too much on responding to the needs expressed by local parents\nrather than delivering evidence-based programmes, which many felt necessary in\norder to achieve better outcomes for children (e.g. Rutter, 2007). Local authorities\ncommissioned many services for all CCs in their authority, whereas SSLPs had\ndone their own commissioning. This should have resulted in a more recognisably\nsimilar profile for CCs, at least within a particular authority. But as the last section\nshowed, the history of each centre, together with the predilections of the manager,\nwere sufficiently powerful to make even geographically adjacent centres rather\ndifferent.\nNor was the nature of services necessarily more standardised in terms of\ndelivery or quality. For example, while CCs were obliged to employ outreach\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n602 jane lewis et al.\nworkers, there was no one model for outreach work, in terms of staff qualifications\nor the numbers of visits to families that were expected, despite this work having\nbeen identified as much more important in the shift to CCs. Nor was there any\nreal consistency in terms of the quality of childcare and education provision,\ndespite the fact that from September 2008 providers registered with Ofsted have\nbeen obliged to work to the statutory framework for the early years foundation\nstage, which sets common standards for the development, care and education\nof children aged 0–5. Many managers of CCs reported being linked to private,\nvoluntary sector and independent childcare and education providers over whose\nwork they had no control.\nInterviewees tended to agree that most of the elements of the core offer CCs\nwere obliged to provide had been present in SSLPs, but that the balance had\nchanged, with much more emphasis on childcare and education, on outreach\nwork in order to make contact with the most disadvantaged families, and on the\nemployability of parents, with the additional requirement that a worker from\nJobcentre Plus (an executive agency of the Department of Work and Pensions,\nwhich provides services to support people of working age from ‘welfare into\nwork’) be made available to work in CCs. However, one manager took the long\nview of changes in the balance of the service offer, commenting that while Sure\nStart had focused on young and vulnerable parents, now the focus was more\non the speech and language development of children: ‘The wheel turns and\nthings go round . . . work that’s happened in the past, fallen out of trend, [has]\ncome back into play.’ He felt that some of the work he had been doing prior\nto becoming an SSLP was now back in favour. Nevertheless, outreach workers\nwho had experienced the Sure Start approach were unhappy about the greater\nemphasis on early years education, which they felt had in some CCs (especially\nin the newly founded ones attached to primary schools) put an end to ‘fun\ndays’ with entertainers, balloons and face-painting, because the educational aim\nwas unclear. Yet, in the view of the outreach workers interviewed (see also DfES,\n2007), but not some of the managers or the local authority officers, such activities\nserved to draw parents into the centre.\nIn several CCs that had been SSLPs, there were differing degrees of resistance\nto the shift in the balance of the core offer. One manager, who was also a\nnursery school head, was very much in favour of the new emphasis on early\nyears education, but not on childcare as a means to increasing employability:\n‘I think it’s quite difficult for people in early child education and care and\nhealth to take on . . . [P]eople [in SSLPs] felt passionately that it should\nnot be about pushing parents into low paid jobs.’ Thus, while her view of\nchildcare and education provision was positive, she was nevertheless suspicious\nof linking childcare to employability rather than solely to child outcomes,\nfearing that an offer of both mediocre childcare and mediocre jobs would\nresult.\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 603\nA second manager reported that daycare and education provision had not\nbeen developed because of lack of local demand. She was in the process of making\na case to the local authority that there was a ‘sufficiency’3 of provision in their\narea, which had a large proportion of Asian families with relatively few working\nmothers, and that additional provision of childcare and education by the centre,\nwhich was run by a voluntary organisation, might endanger the businesses of\nother independent sector providers. This interviewee ‘struggled’ with the shift\nin the service offer to a greater emphasis on childcare linked to employability,\nwhich was additionally at odds with local perceptions about the proper role of\nmothers:\nWe all know from research4 that, you know, in the early days of the child’s life, to have your\nparents, one parent at least around during that period is actually greatly beneficial. And yet on\nthe other hand, in this government agenda around getting women back into work particularly,\nand the child care agenda, and I do struggle with that contradiction really.\nA third manager in the same authority reported that he had been preceded by a\nMuslim manager, who had not developed daycare because of the preferences of\nparents for homecare in his area, but who had set up good partnerships to ensure\nthe delivery of family services to support parenting. Finally, a voluntary sector\nmanager of a CC and former SSLP agreed that often it was more important for\nsomeone to work with the parent to sort out the child’s behaviour – ‘if you’ve got\na parent that’s having an issue with behaviour management, putting the child in\na nursery is not going to tackle that’ – adding that support for the parent to work\nwith the child should be judged the most important task for the centre in such\ncases.\nCCs were not funded as well as SSLPs, and their money was largely absorbed\nby meeting the core offer. But, the imposition of a core offer did not result\nin greater consistency or in higher quality services. Nevertheless, change in the\nservice prescriptions did result in a change in the balance of services above all.\nThe emphasis on children’s cognitive achievements and on parents’ employability\nshifted away from the focus of the SSLPs on parent and child services, and\non responding to parent demand. One interviewee remarked that SSLPs had\nbeen about ‘working with families for the good of the family, rather than\nworking with families for the good of the child and for that child achieving\neducational outcomes’, which he felt was the case in CCs. A manager of a former\nSSLP commented that SSLPs had paid more attention to parents qua parents,\norganising trips out, parent groups and benefits advice, services that had not\nusually been ‘rolled over’ into CCs.\nA universal service: mainstreaming and partnership\nAll interviewees welcomed the ending of the ‘post-code lottery’ whereby\nSSLPs had been permitted to serve only a particular geographical area, but making\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n604 jane lewis et al.\nCC provision a universal service under the control of local authorities brought\nnew challenges. SSLPs had often seconded staff from the provider and based them\nin the SSLP. Usually, SSLPs housed a number of staff from different disciplines\non their sites. CCs are unable to operate like this. It was intended by central\ngovernment that they would become ‘permanent, mainstream community\nservices’ (DfES, 2006: 2) and as such would rely on working with other\nmainstream services in partnership to deliver a fully integrated service. It is\noften the case that relatively few CC staff work out of the lead setting; in fact, no\ncentre visited for this project had the full complement of staff recommended in\nthe official guidance. Indeed, the vast majority of the managers interviewed for\nthis study were only appointed late in 2008, even though the National Evaluation\nof Sure Start (Tunstill et al., 2005b) and the official guidance on practice for\nCCs (DfES, 2005) had drawn attention to the importance of leadership. A local\nauthority officer talked energetically and optimistically about mainstreaming in\nterms of ‘reshaping the workforce’:\nWe had a Sure Start local programme health visitor, we had a Sure Start local programme\nmidwife, now what we’re doing is we’re saying ‘no, actually, we need to reshape mainstream\nservices around CCs’ and that’s what’s really positive . . . Because the mainstream teams actually\nfelt they didn’t have to change while there was a dedicated worker, so now, you know . . . people\nare joining, developing joint plans for things that were previously just, sort of, around health\nor education, around immunisation, breastfeeding.\nThis interviewee felt that there was an upside to having less money than had been\navailable to SSLPs, because:\nhaving less money makes you actually think how [to deliver services] . . . you can’t just keep\nadding layers . . . because nobody changes the way they’re working and you just create another,\nyou’ve still got that silo over there . . . you’ve got to reshape the workforce.\nA CC manager in the same authority also interpreted the changes in the ways of\nworking that had taken place during the 2000s positively:\nSo what was done three or four years ago by SSLPs, people have seen the benefit of and have\nchanged their working practices so we can, you know, we can manage it with this sort of\npartnership arrangement really.\nBut neither the clarity nor the optimism of these ways of thinking about the\nchanges in ways of working was widely shared, either in this particular local\nauthority or in the others. Many interviewees saw mainstreaming and the need\nto rely on partnership working as having been necessitated by the reduction in the\nbudgets of CCs. One voluntary sector provider commented that mainstreaming\n‘is kind of like “dream on” really, you know’. Most managers saw that operating\na CC required partnership working, which had not necessarily been the case\nin an SSLP. Several also stressed the extent to which this in turn required\n‘goodwill’ because many service providers had to contribute the time needed\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 605\nto attend meetings or to deal with the paperwork that resulted from the more\nintensive local authority monitoring requirements that had not been properly\ncosted. Nor were the partnership arrangements always reliable. In all three local\nauthorities respondents mentioned problems working with health visitors, who\nwere understaffed, and with Jobcentre Plus workers, who were not used to\nworking outside their offices.5\nNor was there consensus on whether SSLPs were advantaged or\ndisadvantaged in adapting to the new ways of working. One manager was of\nthe view that SSLPs started with ‘bigger teams’ and were better placed to begin\nwork as CCs. However, another manager, who had not herself worked in an SSLP,\nfelt that\n[i]t’s been harder for the Sure Start workers than it has been for us really, because they have had\nto get used to the fact that they’re working beyond a small area.\nThe challenges of working across boundaries and across different sites in ‘hub\nand spoke’ CCs, together with the need to integrate staff with different lines\nof accountability as well as training and terms and conditions of employment,\nare much stronger for CCs. As one CC manager who had experienced work in a\nSSLP put it: ‘They did do integrated working, but within their own little building.’\nFurthermore, a voluntary organisation provider said that the SSLP workforce had\nnot really been integrated, despite often working on a single site, and that ‘silos’\nhad continued to exist, something reinforced by a nursery head and CC manager,\nwho commented that new SSLP staff had worked ‘in parallel’ with nursery staff\n(see above).\nThe shift from an area-based service to a universal, mainstream service\nnecessitated partnership working, something that was broadly accepted – unlike\nthe revised prescriptions for services – but which proved hard to achieve.\nChanges in governance: information, accountability\nand parent participation\nThe more top–down approach to the control of CCs might have been\nexpected to result in greater uniformity in governance. However, no centre visited\nfor this study conformed to any of the models of governance set out in the official\nguidance (DfES, 2007). In addition, the vast majority of respondents in all three\nresearch areas reported a lack of ‘interference’ by the local authority. The closer\nmonitoring that was required by local authorities was attributed largely to central\ngovernment policy.\nThe main change perceived by centre staff had more to do with the flow of\ninformation than the degree of control that was exercised; indeed, three managers\nin one authority complained about the lack of guidance from the local authority.\nTwo interviewees in another authority were more positive about the advice they\nhad received, but commented that the local authority was a lot less ‘transparent’\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n606 jane lewis et al.\nthan the SSLP had been. These people felt that they no longer knew as much\nabout ‘what is going on’ in terms of the shifts in the policy of central government\nand the decisions made by the local authority officers. An outreach worker said\nthat she had been used to meeting the SSLP programme manager every four to six\nweeks and had heard about developments in Sure Start programmes locally and\nnationally. Now she hears nothing about future plans and has never met many of\nthe local authority officers with whom she deals; she referred to the officer from\nwhom she regularly sought reimbursement for the fruit provided at the parents’\nforums as a ‘virtual man’. Yet managers and providers of services complained\nabout the number of different kinds of meetings that they were now supposed to\nattend. A provider of services to an SSLP only had to attend one meeting at that\nsite on a regular basis, but in the universal children’s centre service, providers\nmay be commissioned to provide a service across all or a large part of a local\nauthority, and it is impossible for them to attend regular meetings in a large\nnumber of CCs.\nIn part, problems of information and feelings that there was a lack of strategic\ndirection flowed from the late appointment of managers in CCs. Some former\nSSLP programme coordinators became CC managers, but many moved into the\nlocal authority hierarchy to oversee the development of the new universal service.\nVirtually all managers and many front-line workers referred to the difficulties\nthey had in sorting out lines of accountability in the new governance structures.\nFor example, in a former SSLP that was run by a voluntary organisation, the\nmanager reported to the voluntary organisation but was employed by the local\nauthority, which was described by a front-line outreach worker as ‘an interesting\narrangement’. There were many similar examples. In the same authority, the head\nof a nursery school, which was the lead setting for a CC, said that she reported to\nthe nursery’s governing body but not to the CC, which she thought was ‘a very\nodd situation’. Several managers said that they would much prefer to have direct\noversight of the people working in their centres, as the managers of SSLPs had\nhad over their seconded staff. An outreach worker commented that ‘everybody\nis employed through somebody different’, an aspect of partnership working that\nshe found ‘bitty’ and difficult.\nFinally, the new forms of governance affected the role played by parents,\nwhich many had felt to be of primary importance to the ethos of SSLPs. While\nmany CCs visited for this study continued to ‘consult’ parents about services,\nideas about the importance of their participation and empowerment had faded.\nOfficial guidance had suggested that parents should occupy as many as one third\nof the places on SSLP partnership boards, but parental participation in CCs was\nconfined mainly to ‘parents’ forums’, from which a parent representative might\nbe persuaded to sit on one of the committees overseeing the work of the CCs.\nBut as one manager commented: ‘I don’t see how it [the CC] can be parent\ndriven in the same way [as the SSLPs]. . .the stuff around children’s language\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 607\ndevelopment is not negotiable.’ Bagley et al. (2004: 559) quoted an SSLP manager\non the importance of meeting targets, but CCs have been driven much more by\nthe core offer, national targets and local monitoring. Most interviewees stressed\nthe importance of consulting parents (often via a survey) even if they were unable\nto respond to their desire for particular kinds of provision (which often had to do\nwith leisure activities and would not help to achieve targets). As another manager\nin the same authority said, parents are asked to come in for a consultation and\nthey are asked what they’d like, but the CC has to meet the core offer, ‘so we\nhave to reach a happy medium between what the parents want and what we\ncan provide’. As encouraged by the guidance from central government, parents\nstill have a ‘voice’ and are consulted (DfES, 2003b, Annex 2), but participation\nas a means to empowerment and community development has largely dropped\noff the CC agenda (see also Mulgan, 2008; Pemberton and Mason, 2008). One\nmanager reported that parents were considerably less involved in the CC, with\nthe parents’ forum becoming a meeting for ‘moans’.\nThus the new forms of governance have given rise to difficulties regarding\nthe dissemination of information and the establishment of clear lines of\naccountability. Above all, a more top–down approach to CCs has meant less\nemphasis on the importance of parental participation. One local authority officer,\nwho had been involved in Sure Start, admitted that ‘sometimes I think, gosh, you\nknow, where are the parents in this, whereas I think in Sure Start local programmes\nthat was very evident’.\nConclusion\nStatements made by Ministers and by the former Director of the Sure Start\nUnit stressing the continuity between Sure Start and CCs were misleading\nin many respects. There was considerable change in the nature of CCs as\noften ‘virtual centres’, compared to the usually more unified SSLPs, with their\nseconded staff; in the amount of money per child that was made available; in the\nnature of service provision with more emphasis on childcare, children’s cognitive\nachievements and parents’ labour force participation; in the obligation to work\nin partnership that followed from mainstreaming CCs; and in the more top–\ndown patterns of governance, which gave considerably less space to parental\nengagement.\nHowever, we did not find that the shift from SSLPs to CCs was also marked by\ngreater uniformity. CCs differed from one another as well as differing from SSLPs.\nIndeed, there was evidence of considerable resistance to many of the key changes.\nIn nursery schools that had been SSLPs and that became CCs, the heads (who\nwere often also the CC managers) were happy to prioritise early years education,\nwhich was what they had always done and what they envisaged doing if CCs\nceased to exist.6 But this did not mean that they were convinced by the part of\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n608 jane lewis et al.\ncentral government’s goal for childcare that stressed the importance of increasing\nemployability for parents. Two of the former SSLPs in one of the authorities\ncontinued to place a low priority on both childcare and education because of the\nlow demand for this service in their neighbourhoods. They continued to hold\nboth to the priorities established by SSLPs in favour of family support services\nand to the respect SSLPs had tended to give to the wishes of parents. It is possible\nthat a larger study may find that this approach is relatively rare; however, we\nfound a striking example of a newly established CC where the service priorities\nand aims also more closely resembled those of an SSLP than a CC. Many of the\nmanagers and service providers we interviewed, especially those who had worked\nin SSLPs, were of the view that attention to the parents’ needs often had to precede\nor take equal place alongside a focus on outcomes for the child. Nevertheless,\nsome front-line workers in particular stressed the changes that they felt they had\nhad to make in order to adapt to the priority accorded early years education, for\nexample by forgoing events such as community fun days which both they and\nparents valued. Front-line workers were particularly concerned about the new\nways in which they were required to work, especially about the difficulties of\nworking in partnership. But again, given the exploratory nature of this study, our\nfindings regarding resistance to fully implementing the core offer, and differences\nin service delivery and in the experiences and views of managers and front-line\nworkers require further research.\nMainstreaming CCs as a new, universal service involved the designation of\na wide variety of institutions with different histories in the public and private\nsectors as centres, as well as the establishment of new centres. Managers came\nfrom a variety of disciplinary backgrounds, which influenced their approaches.\nIndeed, there is no coherence in either the English early years workforce or\nin the nature of provision. While the 2006 legislation integrated childcare and\neducation, there is still no common career path for early years workers, who are\nstill split most notably between poorly paid childcare workers and better paid\nnursery teachers. The fragmentation of provision continues to be matched by\nthe fragmentation of the workforce and, as Dahlberg et al. (1999) have observed,\nEngland has nothing to compare with the highly trained early years pedagogue\nworking in the Scandinavian countries. These deeper continuities with the past\naccount in large measure for the different approaches taken by CCs. Indeed,\nfurther research must determine the best analytical framework for exploring the\nwide variation in terms of service organisations and providers in CCs.\nThere does seem to have been an unequivocal change in one of the\nmain organising principles of Sure Start: the participation of parents which,\naccording to the former Director of the Sure Start Unit, had probably been\nthe most important principle (see above). Two of the three local authority\nofficers interviewed were as aware of this change as centre staff. While the\noversight exercised by local authorities was commonly agreed not to have\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 609\nresulted in uniform, direct control, there was a diminution in responsiveness\nto local demands, due both to less generous budgets and the demands of meeting\nnational targets tied to the core offer. Parental involvement in the governance of\ncentres was minimal compared to SSLPs. While central government specifications\nand local authority control did not completely remove the autonomy that had\nbeen experienced by SSLPs and did not impose an instantly recognisable new\ninstitutional form, many interviewees felt that there had been a significant change\nin principles, as well as in practices, particularly around the requirement to work\nin partnership with other mainstream services.\nIt is also important to note that the pace of change has been rapid; the House\nof Commons Education and Skills Committee (2005b: 11) commented on the fact\nthat children’s services as a whole were undergoing ‘transformational change’ at\n‘formidable speed’. Indeed, little was learned from the development of SSLPs in\nthis respect (Glass, 2006). As a manager of a CC that had been an SSLP put it:\nEverything has moved very quickly and I guess that one of the things that we have learnt, if we\nhave learned anything, is that substantial change at least takes a long time to bed down.\nFor although respondents saw continuities between SSLPs and CCs at the\noverarching level of promoting child well-being, the transition nevertheless posed\nthe need for significant changes to be made in all the areas considered in this\npaper. Furthermore, it is also reasonable to speculate that the new spending\nround beginning in 2010–11 is likely to bring more turbulence. One CC manager\nfeared that future spending cuts might increase standardisation by reducing\nprovision to a minimal level. Government has embedded CCs in legislation (via\nthe Apprenticeships, Skills, Children and Learning Act, 2009), but at the time of\nwriting it is too early to be sure that there will not be more fundamental changes\nto come. Further changes in the balance of services and in the target client group\nare possible.\nJust as it was difficult to describe a ‘typical’ SSLP, so it is difficult to describe\na ‘typical’ CC. CCs are not ‘recognisably similar’. Much of the variation between\nSSLPs was attributed to the extent to which they responded to local need. CCs\nrespond much less to local needs and demands and yet each centre visited for this\nproject was also very different, and this applied to the newly established centres as\nwell as to those that had had a previous existence as an SSLP or other institution.\nThe head of one of the nursery schools that had been an SSLP commented:\nit’s just so different everywhere . . . I think the discrepancy across each authority and between\ndifferent authorities just is quite bizarre really . . . Nobody really knows what somebody else’s\ncentre means.\nIt seems that it is remarkably difficult to forge a recognisably universal,\nmainstream early years service out of the fragmented institutions and workforce\nthat has characterised past provision.\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n610 jane lewis et al.\nAppendix 1: Numbers of interviewees by type of site and job title\nType of CC\nJob title Ex-SSLP\nEx-\nneighbourhood\nnursery\nEx-early\nexcellence\ncentre\nNewly created –\nco-located with\nprimary\/nursery\nschool\nNewly\ncreated –\nother sites\n(1) Primary\/nursery\nschool senior staff\n2 3\n(2) Manager of CC 3 2 1 9 2\n(3) Combined role:\nhead\/deputy head of\nprimary\/nursery\nschool and head\nof CC\n3 1\n4) CC front line staff 4 1\n5) Partner organisation\nstaff (not front line)\n3\nIn addition, three local authority officers were interviewed whose roles cannot\nbe linked to a particular centre.\nExplanation of categories\n1. Senior school\/nursery staff – head teachers and deputy head teachers of the\nlead setting who are not responsible for directly managing the CC.\n2. Manager of CC – job titles vary, and may include ‘children’s centre manager’,\n‘children’s centre co-ordinator’, ‘head of CC’ and ‘programme manager’.\nIndividuals responsible for running the CC on a day-to-day basis.\n3. Combined role – includes individuals whose roles involve leading and\nmanaging both the nursery\/primary school and the CC itself (although there\nmay also be another individual responsible for day-to-day CC business)\n4. CC front line staff – includes voluntary sector and PCT workers who provide\na service at the CC.\n5. Partner organisation staff – staff of voluntary sector organisations who do\nnot themselves provide a service within the CC, but who manage staff\nwho do.\nAcknowledgement\nWe would like to acknowledge the financial support of both the Nuffield Foundation and the\nSpencer Foundation. We would also like to acknowledge the help received from Norman Glass\na few months before his death, when we discussed both the policy change and its implications\nfor practice at the local level.\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\nfrom sure start local programmes to children’s centres 611\nNotes\n1 While there has been a considerable literature on Sure Start, much of it emanating from the\nNational Evaluation of the programme (Belsky et al., 2007; Anning and Ball, 2008), there is\na paucity of literature on CCs.\n2 Evaluation of outcomes will in any case prove difficult. For, while much more emphasis was\nplaced on the importance of child outcomes in the transition to CCs, the national targets set\nalso changed, making comparisons between SSLPs and CCs difficult.\n3 In line with the requirements placed on LAs by the 2006 Childcare Act.\n4 For a recent review of this research, see Hansen and Hawkes (2009).\n5 Tunstill et al. (2005c) observed that there has been a lack of training for partnership working,\nalthough Bagley and Ackerley (2006) noted on the basis of their local case study that Sure\nStart professionals were committed to a partnership perspective.\n6 In fact, the new funding formula for early years education makes nursery schools vulnerable\nto closure.\nReferences\nAnning, A. and Ball, M. (eds.) (2008), Improving Services for Young Children: From Sure Start to\nChildren’s Centres, London: Sage.\nAnning, A. and Hall, D. (2008), ‘What was Sure Start and why did it matter?’, in A. Anning and\nM. Ball (eds.), Improving Services for Young Children: From Sure Start to Children’s Centres,\nLondon: Sage.\nBagley, C. and Ackerley, C. (2006), ‘“I am much more than just a mum”: social capital,\nempowerment and Sure Start’, Journal of Education Policy, 21: 6, 717–734.\nBagley, C., Ackerley, C. and Rattray, J. (2004), ‘Social exclusion, Sure Start and organizational\nsocial capital: evaluating inter-disciplinary multi-agency working in an education and\nhealth work programme’, Journal of Education Policy, 19: 5, 595– 607.\nBelsky, J., Barnes, J. and Melhuish, E. (eds.) (2007), The National Evaluation of Sure Start,\nBristol: Policy Press.\nCapacity (2009), Outreach to Children and Families: A Scoping Study, Research Report DCSF –\nRR116, London: DCSF.\nDahlberg, G., Moss, P. and Pence, A. R. (1999), Beyond Quality in Early Childhood Education\nand Care: Postmodern Perspectives, London: Falmer Press.\nDCSF (2007), Sure Start Children’s Centres: Phase 3 Planning and Delivery, Nottingham: DCSF.\nDfES (2003a), Sure Start Guidance 2004–6: Overview and Local Delivery Arrangements, Annesley,\nNottingham: DfES.\nDfES (2003b), Sure Start Guidance 2004–2006: Delivery Guidance, Annesley, Nottingham: DfES\nDfES (2005), Sure Start Children’s Centres: Practice Guidance, Annesley, Nottingham: DfES.\nDfES (2006), Sure Start Children’s Centres: Planning and Performance Management Guidance,\nAnnesley, Nottingham: DfES\nDfES (2007), Governance Guidance for Sure Start Children’s Centres and Extended School,\nAnnesley, Nottingham: DfES.\nEisenstadt, N. (2002), ‘Editorial, Sure Start: key principles and ethos’, Child: Care, Health and\nDevelopment, 28: 1, 3–4.\nEisenstadt, N. (2003), Letter to all SSLP Partnership Chairs, 21 February.\nGlass, N. (2006), ‘Sure Start: where did it come from; where is it going?’, Journal of Children’s\nServices, 1: 1, 51–57.\nHansen, K. and Hawkes, D. (2009), ‘Early childcare and child development’, Journal of Social\nPolicy, 38: 2, 211–240.\nHouse of Commons Education and Skills Committee (2005a),EveryChildMatters: NinthReport\nof Session 2004–5, Volume 2, HC 40-II, London: The Stationery Office.\nHouse of Commons Education and Skills Committee (2005b),EveryChildMatters:NinthReport\nof Session 2004–5, Volume 1, HC 40-1, London: The Stationery Office.\nhttp:\/\/journals.cambridge.org Downloaded: 29 Aug 2013 IP address: 158.143.197.48\n612 jane lewis et al.\nLewis, J. (in press), ‘From Sure Start to children’s centres: an analysis of policy change in English\nearly years programmes’, Journal of Social Policy.\nMulgan, G., Ali, R., Halkett, R. and Sanders, B. (2008), Sure Start, London: Social Innovation\nExchange.\nNESS (National Evaluation of Sure Start) Research Team (2005), Early Impacts of Sure Start\nLocal Programmes on Children and Families, Research Report 13, Nottingham: DfES.\nPemberton, S. and Mason, J. (2008) ‘Co-production and Sure Start children’s centres: reflecting\nupon users’ perspectives and implications for service delivery, planning and evaluation’,\nSocial Policy and Society, 8: 1, 13–24.\nRutter, M. (2007), ‘Sure Start local programmes: an outsider’s perspective’, in J. Belsky, J. Barnes\nand E. Melhuish (eds.), The National Evaluation of Sure Start, Bristol: Policy Press.\nTunstill, J., Meadows, P., Akhurst, S., Allnock, D., Chrysanthou, J., Garbers, C. and Morley, A.\n(2005a), Implementing Sure Start Local Programmes: An Integrated Overview of the First\nFour Years, NESS\/2005\/FR\/010, Nottingham: DfES.\nTunstill, J., Allnock, D., Akhurst, S. and Garbers, C.,(2005b), ‘Sure Start local programmes:\nimplications of case study data from the National Evaluation of Sure Start’, Children and\nSociety, 19: 158–171.\nTunstill, J., Meadows, P., Allnock, D., Akhurst, S., Chrysanthou, J., Garbers, C., Morley, A. and\nvan de Velde, T. (2005c), Implementing Sure Start Local Programmes: An In-depth Study,\nNESS\/FR\/2005\/007, Nottingham: DfES.\n"}