{"doi":"10.1037\/0012-1649.44.3.695","coreId":"67981","oai":"oai:eprints.lancs.ac.uk:34206","identifiers":["oai:eprints.lancs.ac.uk:34206","10.1037\/0012-1649.44.3.695"],"title":"Task experience and children’s working memory performance : a perspective from recall timing.","authors":["Towse, John N.","Cowan, Nelson","Horton, Neil","Whytock, Shealagh"],"enrichments":{"references":[{"id":16632233,"title":"A structural analysis of working memory and related cognitive skills in young children.","authors":[],"date":"2004","doi":null,"raw":"Alloway, T. P., Gathercole, S. E., Willis, C., & Adams, A. (2004). A structural analysis of working memory and related cognitive skills in young children. Journal of Experimental Child Psychology, 87(2), 85-106.","cites":null},{"id":16632308,"title":"Children's working memory processes: A response-timing analysis.","authors":[],"date":"2003","doi":null,"raw":"Cowan, N., Towse, J. N., Hamilton, Z., Saults, J. S., Elliott, E. M., Lacey, J. F., Moreno, M. V., & Hitch, G. J. (2003). Children's working memory processes: A response-timing analysis. Journal of Experimental Psychology: General, 132(1), 113-132.","cites":null},{"id":16632333,"title":"Cognitive approaches to the development of short-term memory.","authors":[],"date":"1999","doi":null,"raw":"Gathercole, S. E. (1999). Cognitive approaches to the development of short-term memory. Trends in Cognitive Sciences, 3(11), 410-419.   Working Memory Task Experience and Timing   32 Haberlandt, K., Lawrence, H., Krohn, T., Bowe, K., & Thomas, J. G. (2005). Pauses and durations exhibit a serial position effect. Psychonomic Bulletin & Review, 12(1), 152-158.","cites":null},{"id":16632329,"title":"Comparison of four scoring methods for the reading span test.","authors":[],"date":"2005","doi":null,"raw":"Friedman, N. P., & Miyake, A. (2005). Comparison of four scoring methods for the reading span test. Behavior Research Methods, 37, 581-590.","cites":null},{"id":16632337,"title":"Contributions of source and inhibitory mechanisms to age-related retroactive interference in verbal working memory.","authors":[],"date":"2003","doi":null,"raw":"Hedden, T., & Park, D. (2003). Contributions of source and inhibitory mechanisms to age-related retroactive interference in verbal working memory. Journal of Experimental Psychology: General, 132(1), 93-112.","cites":null},{"id":16632222,"title":"Determinants of individual differences during skill acquisition: Cognitive abilities and information processing.","authors":[],"date":"1988","doi":null,"raw":"Ackerman, P. L. (1988). Determinants of individual differences during skill acquisition: Cognitive abilities and information processing. Journal of Experimental Psychology: General, 117, 288-318.","cites":null},{"id":16632346,"title":"Developmental change in proactive interference.","authors":[],"date":"2002","doi":null,"raw":"Kail, R. (2002). Developmental change in proactive interference. Child Development, 73(6), 1703-1714.","cites":null},{"id":16632237,"title":"Exploring the central executive.","authors":[],"date":"1996","doi":null,"raw":"Baddeley, A. (1996). Exploring the central executive. Quarterly Journal of Experimental Psychology, 49A(1), 5-28.","cites":null},{"id":16632320,"title":"Increases in intrusion errors and working memory deficit of poor comprehenders.","authors":[],"date":"1998","doi":null,"raw":"De Beni, R., Palladino, P., Pazzaglia, F., & Cornoldi, C. (1998). Increases in intrusion errors and working memory deficit of poor comprehenders. Quarterly Journal of Experimental Psychology, 51A(2), 305-320.","cites":null},{"id":16632383,"title":"Individual differences in memory span: The contribution of rehearsal, access to lexical memory, and output speed.","authors":[],"date":"2000","doi":null,"raw":"Tehan, G., & Lalor, D. M. (2000). Individual differences in memory span: The contribution of rehearsal, access to lexical memory, and output speed.","cites":null},{"id":16632315,"title":"Individual differences in working memory and reading.","authors":[],"date":"1980","doi":null,"raw":"Daneman, M., & Carpenter, P. A. (1980). Individual differences in working memory and reading. Journal of Verbal Learning and Verbal Behavior, 19, 450-466.","cites":null},{"id":16632365,"title":"Introduction: Methodologies and models in the study of executive function. In","authors":[],"date":"1997","doi":null,"raw":"Rabbitt, P. (1997). Introduction: Methodologies and models in the study of executive function. In P. Rabbitt (Ed.), Methodology of frontal and executive function (pp. 1-38). Hove, East Sussex: Psychology Press.","cites":null},{"id":16632395,"title":"Is working memory capacity task dependent?","authors":[],"date":"1989","doi":null,"raw":"Turner, M. L., & Engle, R. W. (1989). Is working memory capacity task dependent? Journal of Memory and Language, 28, 127-154.","cites":null},{"id":16632416,"title":"Measuring central executive functioning: What's in a reading span?","authors":[],"date":"2001","doi":null,"raw":"Whitney, P., Arnett, P. A., Driver, A., & Budd, D. (2001). Measuring central executive functioning: What's in a reading span? Brain and Cognition, 45, 1-14. Working Memory Task Experience and Timing   35","cites":null},{"id":16632293,"title":"On the capacity of attention: Its estimation and its role in working memory and cognitive aptitudes.","authors":[],"date":"2005","doi":null,"raw":"Cowan, N., Elliott, E. M., Saults, J. S., Morey, C. C., Mattox, S., Hismjatullina, A., & Conway, A. R. A. (2005). On the capacity of attention:  Its estimation and its role in working memory and cognitive aptitudes. Cognitive Psychology, 51, 42-100.","cites":null},{"id":16632373,"title":"On the nature of forgetting and the processing-storage relationship in reading span performance.","authors":[],"date":"2004","doi":null,"raw":"Saito, S., & Miyake, A. (2004). On the nature of forgetting and the processing-storage relationship in reading span performance. Journal of Memory and Language, 50, 425-443.","cites":null},{"id":16632275,"title":"Phonological similarity in working memory.","authors":[],"date":"2001","doi":null,"raw":"Copeland, D. E., & Radvansky, G. A. (2001). Phonological similarity in working memory. Memory & Cognition, 29(5), 774-776.","cites":null},{"id":16632258,"title":"Proactive interference and item similarity in working memory.","authors":[],"date":"2006","doi":null,"raw":"Bunting, M. (2006). Proactive interference and item similarity in working memory. Journal of Experimental Psychology: Learning, Memory and Cognition, 32(2), 183-196.","cites":null},{"id":16632344,"title":"Response Timing in Working Memory: An Annotated Guide.","authors":[],"date":"2007","doi":null,"raw":"Horton, N., Towse, J.N., & Cowan, N. (2007).  Response Timing in Working Memory: An Annotated Guide. Retrieved 18 April 2007 from Lancaster University website:  http:\/\/www.psych.lancs.ac.uk\/research\/TowseWM\/.","cites":null},{"id":16632295,"title":"Rethinking Speed Theories of Cognitive Development.","authors":[],"date":"2006","doi":null,"raw":"Cowan, N., Elliott, E. M., Saults, J. S., Nugent, L. D., Bomb, P., & Hismjatullina, A. (2006). Rethinking Speed Theories of Cognitive Development. Psychological Science, 17(1), 67-73.","cites":null},{"id":16632390,"title":"Sentence completion norms among adults: A corpus of sentences differing in length","authors":[],"date":"2000","doi":null,"raw":"Towse, J. N., Hamilton, Z., Hitch, G. J., & Hutton, U. (2000). Sentence completion norms among adults: A corpus of sentences differing in length (Technical Report No. CDRG 7): Royal Holloway, University of London.","cites":null},{"id":16632398,"title":"Simple and complex memory spans and their relation to fluid abilities: Evidence from list-length effects.","authors":[],"date":"2006","doi":null,"raw":"Unsworth, N., & Engle, R. W. (2006). Simple and complex memory spans and their relation to fluid abilities: Evidence from list-length effects. Journal of Memory and Language, 54, 68-80.","cites":null},{"id":16632380,"title":"Tests for comparing elements of a correlation matrix.","authors":[],"date":"1980","doi":null,"raw":"Steiger, J. H. (1980). Tests for comparing elements of a correlation matrix. Psychological Bulletin, 87(2), 245-251.","cites":null},{"id":16632361,"title":"The axioms and principal results of classical test theory.","authors":[],"date":"1966","doi":null,"raw":"Novick, M. R. (1966). The axioms and principal results of classical test theory. Journal of Mathematical Psychology(3), 1-18.","cites":null},{"id":16632245,"title":"The Complexities of Complex Span: Explaining Individual Differences in Working Memory in Children and Adults.","authors":[],"date":"2003","doi":null,"raw":"Bayliss, D. M., Jarrold, C., Gunn, D. M., & Baddeley, A. D. (2003). The Complexities of Complex Span: Explaining Individual Differences in Working Memory in Children and Adults. Journal of Experimental Psychology: General, 131(1), 71-92.","cites":null},{"id":16632281,"title":"The magical number 4 in short-term memory: a reconsideration of mental storage capacity.","authors":[],"date":"2001","doi":null,"raw":"Cowan, N. (2001). The magical number 4 in short-term memory: a reconsideration of mental storage capacity. Behavioral and Brain Sciences, 24(1), 87-185.","cites":null},{"id":16632413,"title":"The measurement of verbal working memory capacity and its relation to reading comprehension.","authors":[],"date":"1996","doi":null,"raw":"Waters, G. S., & Caplan, D. (1996). The measurement of verbal working memory capacity and its relation to reading comprehension. Quarterly Journal of Experimental Psychology, 49A(1), 51-70.","cites":null},{"id":16632350,"title":"The role of prefrontal cortex in Working Memory capacity, executive attention, and general fluid intelligence: An individual difference perspective.","authors":[],"date":"2002","doi":null,"raw":"Kane, M. J., & Engle, R. W. (2002). The role of prefrontal cortex in Working Memory capacity, executive attention, and general fluid intelligence: An individual difference perspective. Psychonomic Bulletin & Review, 9(4), 637-671.","cites":null},{"id":16632289,"title":"The role of verbal output time in the effects of word length on immediate memory.","authors":[],"date":"1992","doi":null,"raw":"Cowan, N., Day, L., Saults, J. S., Keller, T. A., Johnson, T., & Flores, L. (1992). The role of verbal output time in the effects of word length on immediate memory. Journal of Memory and Language, 31, 1-17.","cites":null},{"id":16632376,"title":"Theory testing and measurement error.","authors":[],"date":"1999","doi":null,"raw":"Schmidt, F. L., & Hunter, J. E. (1999). Theory testing and measurement error. Intelligence, 27(3), 183-198.","cites":null},{"id":16632370,"title":"Time and resource limits on working memory: Cross age consistency in counting span performance.","authors":[],"date":"2003","doi":null,"raw":"Ransdell, S., & Hecht, S. A. (2003). Time and resource limits on working memory: Cross age consistency in counting span performance. Journal of Experimental Child Psychology, 86, 303-313.","cites":null},{"id":16632311,"title":"Two separate verbal processing rates contributing to short-term memory span.","authors":[],"date":"1998","doi":null,"raw":"Cowan, N., Wood, N. L., Wood, P. K., Keller, T. A., Nugent, L. D., & Keller, C. V. (1998). Two separate verbal processing rates contributing to short-term memory span. Journal of Experimental Psychology: General, 127(2), 141-160.","cites":null},{"id":16632267,"title":"Variation in Working Memory.","authors":[],"date":"2007","doi":null,"raw":"Conway, A. R., Jarrold, C., Kane, M., Miyake, A., & Towse, J. N. (Eds.). (2007). Variation in Working Memory. New York: Oxford University Press.","cites":null},{"id":16632299,"title":"Verbal memory span in children: Speech timing cues to the Working Memory Task Experience and Timing 31 mechanisms underlying age and word length effects.","authors":[],"date":"1994","doi":null,"raw":"Cowan, N., Keller, T. A., Hulme, C., Roodenrys, S., McDougall, S., & Rack, J. (1994). Verbal memory span in children: Speech timing cues to the   Working Memory Task Experience and Timing   31 mechanisms underlying age and word length effects. Journal of Memory and Language, 33, 234-250.","cites":null},{"id":16632341,"title":"What limits working memory span? Theoretical accounts and applications for scholastic development.","authors":[],"date":"2001","doi":null,"raw":"Hitch, G. J., Towse, J. N., & Hutton, U. M. Z. (2001). What limits working memory span? Theoretical accounts and applications for scholastic development. Journal of Experimental Psychology: General, 130(2), 184-198.","cites":null},{"id":16632225,"title":"Working memory and children's mental addition.","authors":[],"date":"1997","doi":null,"raw":"Adams, J. W., & Hitch, G. J. (1997). Working memory and children's mental addition. Journal of Experimental Child Psychology, 67(1), 21-38.","cites":null},{"id":16632387,"title":"Working memory and its relevance for cognitive development. In","authors":[],"date":"2005","doi":null,"raw":"Towse, J. N., & Cowan, N. (2005). Working memory and its relevance for cognitive development. In W. Schneider, R. Schumann-Hengsteler & B. Sodian (Eds.), Young Children’s Cognitive Development: Interrelationships among Executive Functioning, Working Memory, Verbal Ability, and Theory of Mind (pp. 9-37). Mahwah, NJ: Lawrence Erlbaum Associates.   Working Memory Task Experience and Timing   34 Towse, J. N., Cowan, N., Hitch, G. J., & Horton, N. (submitted). The recall of information from working memory: insights from behavioural and chronometric perspectives. Manuscript submitted for publication.","cites":null},{"id":16632230,"title":"Working memory and phonological awareness as predictors of progress towards early learning goals at school entry.","authors":[],"date":"2005","doi":null,"raw":"Alloway, T. P., Gathercole, S. E., Adams, A., Willis, C., Eaglen, R., & Lamont, E. (2005). Working memory and phonological awareness as predictors of progress towards early learning goals at school entry. British Journal of Developmental Psychology, 23(3), 417-426.","cites":null},{"id":16632284,"title":"Working memory capacity.","authors":[],"date":"2005","doi":null,"raw":"Cowan, N. (2005). Working memory capacity. Hove, U.K.: Psychology Press.","cites":null},{"id":16632393,"title":"Working memory period: the endurance of mental representations.","authors":[],"date":"2005","doi":null,"raw":"Towse, J. N., Hitch, G. J., Hamilton, Z., Peacock, K., & Hutton, U. M. Z. (2005). Working memory period: the endurance of mental representations. Quarterly Journal of Experimental Psychology, 58A(3), 547-571.","cites":null},{"id":16632352,"title":"Working memory span and phonological awareness tasks as predictors of early reading ability.","authors":[],"date":"1994","doi":null,"raw":"Leather, C. V., & Henry, L. A. (1994). Working memory span and phonological awareness tasks as predictors of early reading ability. Journal of Experimental Child Psychology, 58, 88-111.","cites":null},{"id":16632357,"title":"Working memory span and the role of proactive interference.","authors":[],"date":"2001","doi":null,"raw":"Lustig, C., May, C. P., & Hasher, L. (2001). Working memory span and the role of proactive interference. Journal of Experimental Psychology: General, 130(2), 199-207.   Working Memory Task Experience and Timing   33 Miyake, A., & Shah, P. (Eds.). (1999). Models of working memory. New York: Cambridge University Press.","cites":null},{"id":16632271,"title":"Working memory span tasks: A methodological review and user's guide.","authors":[],"date":"2005","doi":null,"raw":"Conway, A. R. A., Kane, M. J., Bunting, M. F., Hambrick, D. Z., Wilhelm, O., & Engle, R. W. (2005). Working memory span tasks: A methodological review and user's guide. Psychonomic Bulletin & Review, 12(5), 769-786.","cites":null},{"id":16632263,"title":"Working memory, inhibitory control and reading ability.","authors":[],"date":"2000","doi":null,"raw":"Chiappe, P., Hasher, L., & Siegel, L. A. (2000). Working memory, inhibitory control and reading ability. Memory & Cognition, 28(1), 8-17.   Working Memory Task Experience and Timing   30 Chuah, Y. M. L., & Maybery, M. T. (1999). Verbal and spatial short-term memory: common sources of developmental change? Journal of Experimental Child Psychology, 73, 7-44.","cites":null},{"id":16632324,"title":"Working memory, short-term memory and general fluid intelligence: A latent variable approach.","authors":[],"date":"1999","doi":null,"raw":"Engle, R. W., Tuholski, S. W., Laughlin, J. E., & Conway, A. R. A. (1999). Working memory, short-term memory and general fluid intelligence: A latent variable approach. Journal of Experimental Psychology: General, 128(3), 309-331.","cites":null},{"id":16632242,"title":"Working Memory.","authors":[],"date":"1986","doi":null,"raw":"Baddeley, A. D. (1986). Working Memory. Oxford: Clarendon Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Working memory is an important theoretical construct among children, and measures of its capacity predict a range of cognitive skills and abilities. Data from 9- and 11-year-old children illustrate how a chronometric analysis of recall can complement and elaborate recall accuracy in advancing our understanding of working memory. A reading span task was completed by 130 children, 75 of whom were tested on two occasions, with sequence length either increasing or decreasing during test administration. Substantial pauses occur during participants’ recall sequences and they represent consistent performance traits over time, whilst also varying with recall circumstances and task history. Recall pauses help to predict reading and number skills, alongside as well as separate from levels of recall accuracy. The task demands of working memory change as a function of task experience, with a combination of accuracy and response timing in novel task situations being the strongest predictor of cognitive attainment","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67981.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34206\/1\/Dev_Psy_inpress.pdf","pdfHashValue":"087204bcd7417e0d6889fecd0dc5f29e7e9c2e8b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34206<\/identifier><datestamp>\n      2018-01-24T03:02:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Task experience and children’s working memory performance : a perspective from recall timing.<\/dc:title><dc:creator>\n        Towse, John N.<\/dc:creator><dc:creator>\n        Cowan, Nelson<\/dc:creator><dc:creator>\n        Horton, Neil<\/dc:creator><dc:creator>\n        Whytock, Shealagh<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Working memory is an important theoretical construct among children, and measures of its capacity predict a range of cognitive skills and abilities. Data from 9- and 11-year-old children illustrate how a chronometric analysis of recall can complement and elaborate recall accuracy in advancing our understanding of working memory. A reading span task was completed by 130 children, 75 of whom were tested on two occasions, with sequence length either increasing or decreasing during test administration. Substantial pauses occur during participants’ recall sequences and they represent consistent performance traits over time, whilst also varying with recall circumstances and task history. Recall pauses help to predict reading and number skills, alongside as well as separate from levels of recall accuracy. The task demands of working memory change as a function of task experience, with a combination of accuracy and response timing in novel task situations being the strongest predictor of cognitive attainment.<\/dc:description><dc:date>\n        2008<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34206\/1\/Dev_Psy_inpress.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1037\/0012-1649.44.3.695<\/dc:relation><dc:identifier>\n        Towse, John N. and Cowan, Nelson and Horton, Neil and Whytock, Shealagh (2008) Task experience and children’s working memory performance : a perspective from recall timing. Developmental Psychology, 44 (3). pp. 695-706. ISSN 0012-1649<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34206\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1037\/0012-1649.44.3.695","http:\/\/eprints.lancs.ac.uk\/34206\/"],"year":2008,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":" Working Memory Task Experience and Timing   1 \nTask experience and children’s working memory performance: A perspective from \nrecall timing \n \nTowse, John N. (Department of Psychology, Lancaster University) \nCowan, Nelson (Department of Psychological Sciences, University of Missouri)  \nHorton, Neil J. (Department of Psychology, Lancaster University) \nWhytock, Shealagh (Department of Psychology, Lancaster University) \n \nTo appear in: Developmental Psychology.  \n \nAddress for correspondence \n \nDr John N Towse \nDepartment of Psychology \nFylde College, Lancaster University \nBailrigg, Lancaster LA1 4YF, United Kingdom \n \nTel: +44-(0)1524-593705 Fax: +44-(0)1524-593744 \nEmail: j.towse@lancaster.ac.uk \n \nAcknowledgements \nWe are grateful to the staff and pupils at the following schools for their cooperation in the \nresearch: Arkholme; Ellel St John’s; Forton; Halton St. Wilfred’s; Nether Kellet; Tatham \nFells. The research was facilitated by the support of the ESRC (grant RES000220452 and \nRES000230859) and was written in part whilst the first author was a research visitor at the \n Working Memory Task Experience and Timing   2 \nUniversity of Colorado at Boulder. The manuscript has benefited from reviewers’ comments \nand discussions with Andrea Cheshire. \n \n Working Memory Task Experience and Timing   3 \nTask experience and children’s working memory performance: A perspective \nfrom recall timing \n \nAbstract \nWorking memory is an important theoretical construct among children, and \nmeasures of its capacity predict a range of cognitive skills and abilities. Data from 9- \nand 11-year-old children illustrate how a chronometric analysis of recall can \ncomplement and elaborate recall accuracy in advancing our understanding of working \nmemory. A reading span task was completed by 130 children, 75 of whom were \ntested on two occasions, with sequence length either increasing or decreasing during \ntest administration. Substantial pauses occur during participants’ recall sequences and \nthey represent consistent performance traits over time, whilst also varying with recall \ncircumstances and task history. Recall pauses help to predict reading and number \nskills, alongside as well as separate from levels of recall accuracy. The task demands \nof working memory change as a function of task experience, with a combination of \naccuracy and response timing in novel task situations being the strongest predictor of \ncognitive attainment.  \n \nKey words: working memory, recall timing, development, practice, proactive \ninterference \n Working Memory Task Experience and Timing   4 \nTask experience and children’s working memory performance: A perspective \nfrom recall timing \n \nWorking memory refers to the dynamic interplay of systems responsible for \nthe maintenance of transient representations, as well as their transformation into \nuseful cognitive products. The concept of working memory occupies centre-stage in \ncognitive science as a psychological construct important in its own right (Baddeley, \n1986; 1996; Cowan, 2005; Gathercole, 1999; Miyake & Shah, 1999) and a component \nembedded within a variety of real-world skills among adults and children. These skills \nencompass reading comprehension (Daneman & Carpenter, 1980; De Beni, Palladino, \nPazzaglia & Cornoldi, 1998) early reading development (Leather & Henry, 1994), \nmathematics (Adams & Hitch, 1997; Hitch, Towse & Hutton, 2001) and indeed a \nbroad range of school curriculum topics (Alloway, Gathercole, Willis & Adams, \n2004; Alloway et al., 2005) in addition to more abstract, higher level cognitive \nfunctions (Conway, Kane, Bunting, Hambrick, Wilhelm & Engle, 2005).  The present \nwork contributes to our understanding of working memory development in two ways:  \nby examining the effects of task experience on performance, and by examining \nresponse timing along with accuracy as a function of this experience.  We describe the \nbasis of these two contributions in turn. \nMeasurement of Working Memory and Task Experience \nReading span is probably the most widely used index of working memory \ncapacity (for some exceptions, see Bayliss, Jarrold, Gunn & Baddeley, 2003; Cowan \net al., 2005; Towse, Hitch, Hamilton, Peacock & Hutton, 2005; Turner & Engle, \n1989). In the original form of reading span used by Daneman and Carpenter (1980), \nparticipants read a sequence of separate sentences and attempted to remember the \n Working Memory Task Experience and Timing   5 \nfinal word from each. In tests for children, a popular approach is to ask children to \nread a set of incomplete sentences and to provide an appropriate word to complete \neach one, with these words forming the memoranda (e.g., Leather & Henry, 1994). \nThis gives the processing task a purpose (working out what the missing words are) \nand usually keeps children focused on reading for meaning. \nSingle administrations of reading span tests among adults sometimes generate \nonly modest levels of test-retest reliability over varying intervals (Waters & Caplan, \n1996). Among 8- to 11-year-old children, Hitch et al. (2001) reported that an \naveraged score from two tests correlated extremely well across a 12-month interval \n(r=.71), although the correlation between performance on single tasks at each time \npoint was lower (see also Towse et al., 2005). This shows that although performance \ncan vary from test to test, it is possible to obtain stable measures of working memory \nand that these are reliably associated with cognitive ability. However, surprisingly \nlittle is known about what contributes to stability and change in children’s working \nmemory.  \nThus, in the present work we ask the fundamental question: what happens to \nworking memory processes as children gain experience with reading span trials? In \nparticular, we consider whether the ability to orchestrate performance on a new \ncomplex task is especially relevant to the predictive ability of working memory \n(Ackerman, 1988). For example, it has been proposed that the deployment of \ncontrolled processes - those dealing with novel situations - are central to working \nmemory task performance (Engle, Tuholski, Laughlin & Conway, 1999; Kane & \nEngle, 2002). Even brief exposure to and practice on reading span trials may allow \nchildren to develop or modify strategies and procedures that help them accomplish the \n Working Memory Task Experience and Timing   6 \ntask. Simultaneously, proactive interference can emerge with practice; previous trial \nepisodes can persist and disrupt performance on the current trial. \nThe present study examines how task experience affects working memory \nperformance in two important and potentially complementary ways. First is the \ncomparison of recall performance from one testing occasion to another (although \nsome children completed a single test only at the second assessment epoch so as to \ncontrol for any developmental maturation, i.e., improvements attributable merely to \nbeing tested at a later point in the study). To our knowledge, this represents the first \nsystematic analysis of the reliability and consistency of recall timing in a complex \nworking memory span task. This unique aspect of our study permits an assessment of \nthe appropriate use of chronometric analyses in experimental and developmental \nresearch. \nThe second facet of task experience focuses on the more proximal or local \nimpact of some trial sets on others. Previous research has clearly established that \nresponse duration in both immediate serial recall and complex span varies with list \nlength; the first interword pause increases when there are more subsequent words to \nrecall in the sequence (e.g., Cowan et al., 1994; Cowan et al., 2003). This implies that \ninterword pauses involve list-wise search processes. However, relevant data come \nfrom test administrations that use an incremental list length testing procedure; \nparticipants recall long sequences only after short sequences (contingent on recall \nsuccess). Accordingly, characteristics of, for example, recall of lists with three items \nmay be influenced by responses given from lists with two items. From the simple \nperspective that practice aids performance, immediately preceding trials would be \nexpected to make the recall process more efficient, as optimal strategies are \nimplemented and refined (e.g., Whitney, Arnett, Driver & Budd, 2001).  In contrast, \n Working Memory Task Experience and Timing   7 \nfrom the perspective of inhibition-based accounts of working memory (e.g., Kail, \n2002, Lustig, Hasher & May, 2001; see also Bunting, 2006; Chiappe, Hasher & \nSiegel, 2000; Hedden & Park, 2003), there is more opportunity for the build-up of \nproactive interference, with residual activation of recalled information from earlier \ntrials contaminating production of subsequent items. The present paper evaluates the \ncontribution of both practice and interference processes for reading span. \nWe addressed the independence of current trials from past history by either \nsuccessively increasing or decreasing recall sequence lengths from an extreme \nstarting point. This provides the opportunity to compare, for example, recall of items \nfrom a list with two words undertaken either as the first or final set of trials. One \nmight consider this issue in general terms as an examination of massed practice on \nperformance, in contrast to the spaced practice that is explored through the test-retest \nanalysis.  \nWe also used individual differences to address this issue. There is evidence \nparticularly from adult research that the deployment of participants’ task strategies \ncan dampen the relationship between working memory and external measures of \ncognitive skill. For example, when the pacing of working memory trials is controlled \nby the participants not the experimenter, performance is less strongly associated with \nability (Friedman & Miyake, 2004; see also Dunlosky & Kane, in press; Lepine, \nBarrouillet & Camos, 2005; Turley-Ames & Whitfield, 2003). To the extent that \nnatural strategies will develop with task experience and children are often thought to \nbe initially less sophisticated in their deployment of strategies, we investigate whether \nnovel working memory trials have different properties from those presented once the \nchild has acquired experience.  For example, the aspect of working memory that \ncorrelates best with cognitive aptitude might be how quickly a satisfactory strategy \n Working Memory Task Experience and Timing   8 \nfor the task can be developed, or perhaps how well the task can be carried out before a \nstrategy has developed.  \nUse of Timing Measures \nWorking memory span has been characterised as a “beguilingly simple \noutcome measure for a complex task” (Hitch et al., 2001). Accordingly, \nunderstanding working memory per se and characterising its relationship with other \nvariables across development can be facilitated by considering multiple performance \nindices beyond the sheer number of items that can be simultaneously retained (Towse \n& Cowan, 2005; Towse et al., 2005). We suggest that the chronometry of recall \nrepresents one important source of evidence about memory representations. It forms \nan excellent ancillary measure because it can be derived from span trials; one does not \nrequire an additional task. Moreover, there is a growing body of research that \nstudying recall dynamics offers an insight into memory and memory development that \ncan be hard to obtain in other ways (e.g., Cowan et al., 1992; Cowan et al., 1998; \nTehan & Lalor, 2000). \nCowan et al. (2003) showed how recall timing analyses could contribute to our \nunderstanding of reading span, reporting both similarities and differences between \nimmediate serial recall and complex span paradigms. Interword pauses, that is the \nsilent gaps between the articulation of each recall word, were much longer in reading \nand listening span tasks than commonly reported in short-term-memory measures. \nPreparatory intervals (the gaps before recall commences) were substantially longer \ntoo. Children were doing something different when it came to the assembly and \nproduction of an output sequence. On the other hand, recall times were quicker for \ncounting span, an alternative working memory task, so it was the linguistic-based \nworking memory measures that were particularly unusual in terms of output \n Working Memory Task Experience and Timing   9 \nprocesses, rather than working memory span per se. Cowan et al. (2003) suggested \nthat children may have been drawing on memories of the sentences they had read in \norder to help access and reconstruct the target recall answers (for evidence supporting \nthis suggestion from adult data, see Towse, Cowan, Hitch & Horton, submitted). This \nposition echoes other views about the overlap between sentence reading and recall \n(Copeland & Radvansky, 2001; Saito & Miyake, 2004). From this perspective, recall \nfrom reading span and listening span potentially involves more than memory search \namong activated candidate answers. It involves also the consideration of a diverse set \nof episodic (in the sense of verbatim or gist) information.  \nCowan et al. also explored the relevance of recall timing variables for \nindividual differences in working memory and cognitive ability.  Overall response \nduration correlated with variance in recall ability, and recall processes were linked to \nwider achievement domains. The predictive value of recall timing is considered \nfurther in this paper, both at the level of the overall response and with respect to \nparticular response components.  \nThe preparatory interval is thought to involve processes relating to partial \nrehearsal, response planning and sequence preparation while word duration \nincorporates processes allied to articulation speed (see Cowan et al., 2003). The \ninterword pauses necessarily reflect search through memory for the identification or \nspecification of the next item to be recalled (although other processes are likely to be \ninvolved). Accordingly, interword pauses provide a more specific or focused measure \nof recall and item access than overall response length, though both measures are \nuseful. Studies of recall timing in immediate serial recall have teased apart influences \nfrom preparatory intervals, interword pauses and word durations (Cowan, 1992; \nCowan et al., 1998) supporting the contention that recall timing components reflect \n Working Memory Task Experience and Timing   10 \ndifferent memory process. See Table 1 for an overview of the dependent measures in \nthis study. \nRecall timing and task experience.  Although Cowan et al. (2003) examined \nresponse timing in working memory tasks they did not examine effects of task \nexperience.  One reason to do so is to get a better understanding of the nature of the \nprocesses that change with task experience.  Toward this end, we describe recall \ntiming at the macroscopic level - response timing using the overall output duration \nthat represents an amalgam of recall processes. We also consider particular recall \ntiming at the microscopic level  - the phases of recall that represent more specific sets \nof mental processes.  Another important reason to examine response timing along \nwith task experience is that timing measures may capture individual variance in \nresponding to experience that eludes the working memory accuracy measure. \n \nMethod \nParticipants \nWe recruited 130 children who agreed to take part after parental consent had \nbeen obtained. Children attended a number of schools in the northwest of England, \nand there were 66 9-year-olds (M = 9 years 1 month, SD=3.62 months) and 64 11-\nyear-olds (M=11 years 3 months, SD=3.46).   \nApparatus, Stimuli and Procedure \nComputer events were driven by an Apple Macintosh G4 ibook with 14-inch \nlaptop screen (programmed using the “Revolution” language running under OS X) \nwith response latencies measured in (1\/60 s) ticks. Recordings were captured digitally \non a minidisc player (Sony MZ-N710, with a Sony ECM-DS70P microphone). \n Working Memory Task Experience and Timing   11 \nReading span. The experimenter provided a verbal overview of the task; \nchildren were asked to read aloud sentences on-screen and offer a suitable completion \nword. Following presentation of a set of sentences, each of the sentence completion \nwords should then be recalled in serial order. As part of a practice phase, children \nwere initially shown sentences to complete without any concurrent memory \nrequirement. \nSentence completion words were mostly predictable and consistent across \nindividuals (see Towse, Hamilton, Hitch & Hutton, 2000). The corpus was split into \ntwo equally-sized sets and counterbalanced in both test and retest situations. If a child \nproduced a non-expected completion word, it was this item that they recalled. \nOnce the participant offered a completion word, the experimenter immediately \ntapped a computer key to initiate the next experimental event that followed after a 1 \nsecond interval (the keystroke also demarcated the completion of sentence reading). \nParticipants were instructed to remain silent between the reading phases and to begin \nreading each sentence immediately. A visually-presented recall screen, \ncontemporaneous with a brief auditory tone, cued children to report the memoranda in \nthe appropriate order; a series of on-screen boxes signalled the appropriate number of \nresponses. Children then received accuracy feedback on the sequence they had just \nproduced. \nFor the children in the ascending sequence order condition (n=76), \nexperimental trials commenced with three sets of two-sentence sequences. Provided at \nleast one recall sequence was correct, three further trials were presented with the \nnumber of sentences in each trial increased by one, up to a maximum of five \nsentences. For the children in the descending sequence order condition (n=54), the \nfirst set of three trials comprised five-sentence sequences. Subsequent trial sets \n Working Memory Task Experience and Timing   12 \ninvolved progressively shorter sequences down to the minimum of two sentences \n(unless children reached ceiling performance through correct recall of all three \nsequences before reaching this point). Most children were assigned the ascending \ncondition so as to permit comparison with published findings that have used this \nformat. In both conditions, children knew the list length prior to each trial. \nAll 130 children undertook the reading span test on at least one occasion. \nSeventy-five children completed two reading span assessments that differed only in \nthe set of sentence stimuli, at time epochs t1 and t2, separated by approximately 10 \nweeks. Fifty-two children were tested at t2 only. Three children were tested at t1 only, \nbeing absent from school at t2. Most children were tested twice because of the value \nof re-test data. Accordingly, it is possible to (a) examine session 1 performance \n(irrespective of exactly when that first assessment occurred), (b) compare, for a large \nsubset of children, test and retest performance and (c) compare initial test against \nretest performance for the same time point (t2). Condition (c) teases apart the impact \nof developmental change from any practice or experience-based change that may have \noccurred in (b). \nScholastic attainment. One-hundred and twenty-three children completed \nWord reading and Number Skills subscales from the British Abilities Scale II tests \n(BAS; Elliott, Smith & McCulloch, 1997); 7 children were unavailable for testing. \nBoth tasks were completed individually at t2, either before of after reading span \nassessment (varying with administrative convenience within the school timetable). \nThe Number Skills test emphasizes written arithmetic. Children were encouraged to \nanswer as many questions as they could, and their score signalled the total number of \nquestions answered correctly. The Word Reading test involves the presentation of a \ncard containing 90 words in ascending order of (normative) difficulty. Children read \n Working Memory Task Experience and Timing   13 \naloud as many words as possible, and the child’s score represented the total number of \nwords read correctly. \nResults \nData Analysis \nTo achieve comparability in the increasing and decreasing order conditions, \ntesting stopped when children reached floor or ceiling performance, respectively. Just \nas one typically assumes children at floor for a particular list-length will not recall \nlonger sequences, children at ceiling in the decreasing order condition were assumed \nto recall shorter sequences correctly (this curtailment of trials affected only three \nchildren in session 1). Reading span was measured as the number of words recalled \nfrom completely correct sequences (see Conway et al., 2005, and Friedman & \nMiyake, 2005, for a discussion of different span scoring procedures).  \nFrom auditory computer files of all correct recall sequences, we segmented the \nspeech waveform displays (using Sound Studio with Apple Macintosh OSX), co-\nreferenced with the corresponding auditory signal, into contiguous intervals. In \nparticular, we measured the length of the preparatory interval, the gap between the \nrecall cue and the initiation of the response sequence, the word duration for each \nmemorandum, and the interword pause, the length of the gap between words. The \nnumber of children with correctly recalled memory sequences is detailed in Table 2, \nwhich provides a general stratification of recall performance. Table 2 also specifies \nthe number of children who provided correct sequences that were timed, which is \nnecessarily smaller because (a) children occasionally produced extraneous non-recall \nwords or re-started their recall sequence; (b) equipment failure led to the loss of data; \n(c) occasionally testing was terminated in the descending condition due to ceiling \nperformance, as described above. \n Working Memory Task Experience and Timing   14 \nTwo raters independently completed all timing measurements, after training \non a different set of example sequences and with reference to common measurement \nguidelines (see Horton, Towse, & Cowan, 2007). In most cases (73% of responses), a \nsingle rater judged the timing of recall, while on the remaining occasions (i.e., 27% of \nresponses) two raters examined the same file. A comparison of 94 sampled word and \npause measurements showed that the two set of judgements were extremely closely \ncorrelated, r(92)=.998. This set of measurements contained 4 long intervals that affect \nthe sample range (i.e. response outliers), but after excluding these values, the \nagreement between measurements was still very high indeed, r(88)=.988. Comparison \nof timings in absolute terms indicated close correspondence; mean pause lengths were \nwithin 20ms and word lengths 50ms of each other. Yet these differences were \nstatistically significant, suggesting small biases or inconsistencies between raters in \nthe location of word onsets \/ offsets. Accordingly, we ensured that the ratio in the \nnumber of timings used from each rater was approximately constant (1:3) across cells \nof the experimental design. \nCorrect recall times were then screened for outliers. For each recall time \nsegment at each list-length, we examined the distribution of individual durations as z-\nscores. We set a conservative threshold of z=3.29; any larger values were curtailed \nback to this cut-off point (i.e., Winsorized). This affected 45 of 3352 durations (i.e., \n1.3%) for lists with 2-4 words. Relevant trial data were then averaged together for \nsubsequent analyses.   \nThe following sections describe in turn the results for session one, for stability \nand change across sessions, and for correlations with aptitude measures. We draw \nupon data from the overall response duration, to provide a global measure of recall \nand to provide measures in line with analyses offered by Cowan et al. (2003). We also \n Working Memory Task Experience and Timing   15 \nreport data based on specific recall phases since they allow us to provide more \nfocused accounts of recall processes. For all appropriate analyses, we report degrees \nof freedom adjusted for non-equal variances. \nAccuracy and recall timing of reading span in session 1 \nWe begin by considering children’s data from their first assessment, as this \nprovides the most direct point of comparison with previously published datasets.  We \nwill focus mainly on timing data but, first, Table 3 presents recall accuracy data. \nReading span scores (measured as the number of words recalled from correct \nsequences) were 52.8% larger among older children F(1,126)=19.4, p<.001, !p\n2\n=.134.  \nThere was no reliable difference overall between ascending and descending sequence \norders, F<1, !p\n2\n=.001, and so the results do not suggest a strong global effect from \nthe build-up of proactive interference. This outcome is not an artefact of self-\nterminating test administration; even if one re-scored recall accuracy on the \nimplausible assumption that children would fail to recall any of the non-presented \neasier lists in the descending sequence, reducing the scores for just a few children, the \ntwo sequence orders remain equivalent, t(128)=.665, !2=.003. The interaction \nbetween age and sequence order was marginal, F(1,126)=2.87, p=.093, !p\n2\n=.022, but \ninterpretation will be delayed until we report additional data from a second test \nsession that clarifies this pattern of data. \nFigure 1 shows the mean durations of recall components. Word durations are \nslightly longer but broadly similar to immediate serial recall data. However, as \nreported by Cowan et al., 2003, the preparatory intervals and interword pauses are \nconsiderably longer than is typically found for immediate serial recall. Appendix 1 \nprovides detailed analysis of the characteristics of recall-timing including a \ncomparison of sequences of different list length.  \n Working Memory Task Experience and Timing   16 \nWe focus on sequences with two items since they involve the most extreme \ncontrast between ascending and descending sequences (being the first and last sets \nrespectively) as well as yielding the greatest density of data. As indicated in Table 4, \nthe length of recall was quicker for descending compared with ascending sequences, \nF(1,114)= 13.1, p<.001, ! p\n2\n=.103 and 11-year-olds were quicker overall than 9-year-\nolds, F(1,114)= 11.9, p<.001, !p\n2\n=.094. Age and sequence order interacted,  \nF(1,114)= 6.80, p=.010, !p\n2\n=.056 indicating younger children benefited most from a \ndescending sequence. \nFollow-up analyses showed that this pattern of main effects and interaction for \nthe overall duration held true for the silent intervals in recall. With respect to the \nsequence order effect specifically, a descending sequence led to shorter interword \npauses, t(101.2)=3.19, p=.002, !2=.091, preparatory intervals, t(107.6)=2.90, p=.005, \n!2=.0720, and initial word durations, t(116)=2.22, p=.029, ! \n2\n=.040, although there \nwas not a significant difference for the second word duration, t(116)=1.15, p=.251, \n!2=.011. Thus, trial experience assisted multiple recall phases in terms of response \nspeed, despite the absence of corresponding differences in recall accuracy.  \nAccuracy and recall timing from reading span as a function of task session \nEvidence for stability. Among children who received two working memory \nassessments, both accuracy [r(73)=.46, p<.001] and the time taken to recall sequences \nwith two items [r(57)=.51, p<.001] correlated across the two sessions (the accuracy \ncorrelation is very similar to other studies with a similar time interval; r(54)=.47; \nTowse et al., 2005, Expt. 2). Moreover, each specific recall component correlated \nacross the two test sessions; preparatory intervals, r(57)=.43, the first word, \nr(57)=.60, the interword pause, r(57)=.45, and the second word, r(57)=.44, all \nps=<.001. Intriguingly, the interword pause correlation between-sessions – where \n Working Memory Task Experience and Timing   17 \ntrials are separated by several weeks – is larger than that between the two item \nsequence pause and both the first interword pause and average interword pause with \nthe three item sequence, where trials are separated by almost no time at all (r(40)=.13 \nand .25 respectively). This suggests that pauses at different list lengths might \nincorporate different processes. Figure 2 describes recall durations on the second \nsession, and Table 3 compares accuracy across task session. \nEvidence for change. Whilst the previous analyses establish performance \nstability, Table 3 and 4 also illustrate changes in, respectively, the accuracy and \nchronometry of working memory with experience. Analysis of variance on recall \naccuracy with session, sequence order and age as factors showed an increase in \nreading span from the first to the second session, F(1,71)=6.18, p=.015, !p\n2\n=.080. \nSince recall accuracy of children tested for the first time at t1 and t2 did not differ \n(M=9.21, SD=4.76 and M=9.45, SD=5.51, t(128)=.27, ! \n2\n=.001) this is not an effect \nof time of testing. Older children recalled more words, F(1,71)=11.5, p=.001, \n!p\n2\n=.140, but there was no overall effect of sequence order, F(1,71)=1.19, p=.280, \n!p\n2\n=.016.  \nThese main effects were complemented by a significant 3-way interaction \nbetween age group, sequence order and test session, F(1,71)=4.11, p=.046, !p\n2\n=.055, \nwhich suggested an age-related proactive interference effect. With ascending \nsequences, 11-year-olds remembered more words than 9-year-olds at both the first \nand second session, t(44)=4.29, p<.001, ! \n2\n=.295, and t(44)=2.50, p=.046, ! \n2\n=.124, \nrespectively. With descending sequences, the age difference was not reliable for either \nthe first or second session, t(27)=.71, ! \n2\n=.018, and, t(27)=1.58, ! \n2\n=.085, \nrespectively. Consequently, 9-year-olds initially recalled more words with descending \nsequences, but improved across sessions mostly with ascending sequences. In contrast \n Working Memory Task Experience and Timing   18 \n11-year-olds showed no initial advantage for descending sequences, but improved \nacross sessions quite a bit on precisely those sequences.  This suggests that among the \nolder children, the benefits of practice can be offset by the impact of proactive \ninterference, such that recall accuracy is facilitated by the descending sequence order \nin the second session. For younger children with some exposure to the task (i.e., at the \nsecond session) initial presentation of relatively easy sequences may have helped \nthem optimise their performance.  \nFigures 1 and 2 describe the overall response duration for sequences with two \nitems. Comparisons showed that recall was more rapid for younger children given \ndescending sequences (M=3.82 s, SD=1.79, vs. M=2.14 s, SD=.45) yet older children \nwere quicker with ascending sequences (M=2.12 s, SD=.24, vs. M=2.61 s, SD=1.10). \nThis was confirmed by analysis of variance that yielded a marginal age effect \n[F(1,55)=2.94, p=.092, !p\n2\n=.051], non-significant sequence order and session effects \n[F(1,55)=2.60, p=.113, !p\n2\n=.045, and F(1,55)=.243, p=.624, !p\n2\n=.004 respectively], \nbut a significant two-way interaction between age and sequence order, F(1,55)=8.94, \np=.004, !p\n2\n=.140. This pattern reinforces the conclusion from accuracy data that \npractice (in this case, task experience within a session) may be particularly important \nfor efficient performance among younger children. The three-way interaction was not \nsignificant, F<1, p=.519, !p\n2\n=.008. \n \nReading span and the prediction of cognitive ability  \nAmong both children and adults, reading span is typically a reliable predictor \nof cognitive performance. We combined the two BAS sub-scores to obtain a measure \nof scholastic attainment, which correlated strongly with reading span accuracy, \nr(121)=.67, p<.001. Cowan et al. (2003) reported that the duration of children’s \n Working Memory Task Experience and Timing   19 \nworking memory recall was relevant to ability and here the correlation between \nability and recall duration in two item lists was also significant, albeit modest, \nr(109)=-.29, p=.002 \nInspired by Chuah & Maybery (1999) and following Cowan et al. (2003), we \nused sets of regression analyses to calculate the unique and shared components of \nvariance in BAS performance that could be accounted for by three variables; age, the \nfirst assessment of accuracy at reading span, and interword pauses from sequences \nwith two recall items. Cowan et al. used BAS Number Skills as a variance mediator in \npredicting just Word Reading performance. We have included age instead because the \ncurrent sample varies on this dimension, and we have aggregated BAS scores to form \nan ability construct as the target variable. Cowan et al. used response duration as the \nrecall timing measure, whereas here we focus on the more specific interword pause \ncomponent, so as to target memory search and word identification processes. \nFigure 3 reports the partitioned variance associated with children’s ability. \nEach contributed significant unique variance (i.e., all variables yield significant !R\n2\n \nvalues, ps<.01). The analyses are important insofar as they (1) confirm that reading \nspan is a strong associate of scholastic ability, sharing 45% of variance; (2) indicate \nthat recall pauses are significant predictors of ability in their own right, sharing 14% \nof variance; (3) demonstrate that variance in recall pauses also overlaps with reading \nspan, in that 18% of all the variance common to both reading span and ability is \nlinked with pause length variation\n \n(that is, 45% of variance common to both reading \nspan and BAS scores includes an 8% component that is linked also to pauses (8 \/ \n45=17.8%)); (4) show that there are age-related changes in scholastic ability distinct \nfrom working memory changes. In other words, development across age involves \nmore than the development of memory and recall ability. Figure 4 summarises the \n Working Memory Task Experience and Timing   20 \ncorresponding pattern of relationships among children who contributed pause data \nfrom sequences with 2 and 3 items. This reveals an even greater unique contribution \nfrom the interword pause in predicting ability. Additional consideration of the \nreliability of timing measures is provided in Appendix 1. \nFurther individual-difference analysis involving BAS scores complements the \nexperimental evidence that working memory processes change as a function of task \nexperience. Among the subset of children who were tested twice, the first assessment \nof reading span accuracy correlated strongly with ability, r(57)=.65, p<.001, which \nmirrors the finding for the whole sample. The second assessment of reading span \naccuracy yielded a more modest, albeit still highly reliable, association with ability, \nr(57)=.37, p<.001. These two correlations are significantly different, z=2.82, p=.005 \n(following Steiger’s, 1980, computational recommendations). Recall accuracy is most \npredictive of cognitive skills when children have not been extensively exposed to the \ntask. \nThe correlations between overall response duration and ability also showed \nthe same pattern across session (r(57)=-.32 and -.27, both ps<.05) but the difference \nwas not significant, z=.38. Nonetheless, recall timing analysis with respect to \nsequence order provided evidence of a task experience effect. When two item trials \nwere presented first (i.e., with ascending sequences), scholastic ability correlated with \nboth the preparatory interval, r(67)=-.30, p=.013,  and the interword pause, r(67)=-\n.40, p=.001. When two item trials were presented last (i.e., descending sequences) this \ncorrelation was not significant, r(40)=-.01 and -.09 respectively. The difference in the \nsize of the correlations between sequence order was significant for the interword \npause, z=2.85, p=.004, although not for the preparatory interval, z=1.49, p=.14. Once \nagain experience can modulate what it is that reading span measures. Finally, in \n Working Memory Task Experience and Timing   21 \nregression analyses of ability scores, after entering age and the interword pauses for \nlists with two items, the pauses in three-item lists still yielded significant additional \nvariance (!R\n2\n=.07, p=.005). After entering age and pauses in lists with three items, \nthe interword pause for two-item lists also yielded significant additional variance \n(!R\n2\n=.03, p=.041). These effects support the conclusion that experience and task \nconfiguration lead to the emergence of different skills, such that interword pauses at \ndifferent list lengths can represent partially separable variables. \n \nDiscussion \n \nThe present study involves a rich dataset, yet one that has the power to \nilluminate a number of important interrelated issues. It examines the effects of task \nexperience on working memory, using both accuracy and response timing measures.  \nWe broadly consider each component of the results in turn, before we introduce more \ngeneral issues. \n \nAccuracy and recall timing of reading span in session 1 \nWorking memory as measured by recall accuracy is a stable and predictive \nindex of complex cognition, and is clearly a multifaceted construct that can be \ncomplemented using chronometric analysis. Recall from reading span is an effortful \nprocess that is far more protracted than is commonly found with immediate serial \nrecall or indeed non-language based working memory tasks (Cowan et al., 2003). \nMoreover, the extra time to produce a sequence is not principally a function of the \nrecall words, but the pauses surrounding them. Children take a relatively long time to \ninitiate recall (up to 50% of the recall period is occupied with the initial gap before \n Working Memory Task Experience and Timing   22 \nsequence production) and there are often long pauses between words. Each of these \ninterword pauses increases as a function of the number of recalled items, indicating \nthat the demands of individual item access increase when part of a longer list. \nThe present experimental design, in which children either recalled short \nsequence lengths followed by longer ones, or vice versa, permits an examination of \nthe interplay between effects of list length and task experience. Within each session \nthe sequence order affects the experience accrued before encountering either easier or \nharder trials. Sequence order did not affect accuracy overall but made a difference to \nresponse duration. The data allow one to gauge the relative importance of the build-up \nof proactive interference from previous trials (Bunting, 2006; Lustig et al., 2001) \nversus practice effects.  It is clear that the two-word lists were recalled more quickly \nin the descending sequence order, as one would expect from a practice effect.  Of \ncourse, logically this effect could co-exist with effects of proactive interference (PI) in \nthat span itself could depend on opposite factors:  practice for any particular sequence \nlength and the reduction of PI where the longest lists are concerned.  Nevertheless, \nperhaps because of these counteracting factors, we found no significant advantage of \nthe descending order on span. \nThis is certainly not to say that PI is unimportant in children’s reading span. \nIndeed, younger children were at a disadvantage in the standard, ascending sequence \norder, but there were no age differences with descending sequences.  This replicates \nfindings in the aging literature (Lustig et al., 2001; see also Chiappe et al., 2000). \nAmong adults, there is some suggestion that there may need to be quite a few trials at \neach list length for PI effects to be observed when manipulating sequence order (see \nLustig & Hasher, 2002, footnote 2). Whilst one might expect that children would be \nparticularly sensitive to PI effects, we recognise that pinpointing the strength and \n Working Memory Task Experience and Timing   23 \ncharacteristics of PI in children’s working memory would involve a large series of \nconvergent studies. \nTo summarize, there appear to be two potential interacting effects of trial \nrepetition; the beneficial effect of practice (discovering how to perform a complex \ntask efficiently) and the detrimental effect of interference from prior trials (alongside \ninterrelated phenomena such as fatigue). We propose that the balance of these factors, \nand their time course, change with development. The build up of PI may contribute to \nage differences insofar as these are reliable only for the ascending sequence length \nformat.  Practice helps younger children adapt to the incremental demands of an \nascending sequence length, while facilitating older children’s adaptation to trials that \nbegin as being supra-span. There is a complex dynamic between effects that \ncontribute to experience and developmental change. \n \nAccuracy and recall timing from reading span as a function of task session \nRecall times show consistency from one test assessment to another and, \ncrucially, they can indicate changes in task performance that are not evident from \naccuracy measures. Yet, practice can lead to important changes in what working \nmemory measures.  Our results suggest that both 9-year-olds and 11-year-olds \nsometimes benefit from reducing PI (i.e., from being tested with trial sequences that \ngradually get shorter) but that the role of PI changes across sessions.  There may be \nmore PI in older children when the second session is carried out.  This could explain \nwhy the descending sequence order led to greater accuracy for older children in the \nsecond session (as shown in Table 3).  In contrast, younger children showed more of a \nneed for practice.  They showed an increase in accuracy across sessions in the \nascending condition, perhaps because the practice helps them to acclimatise to task \n Working Memory Task Experience and Timing   24 \nrequirements.  Recall durations were also long in the ascending condition, when the \nshort lists that were timed did not have the benefit of practice within a trial.   \nReading span and the prediction of cognitive ability \n As Figures 3 and 4 illustrate, the data reaffirm the robust link in children \nbetween reading span accuracy and scholastic ability (e.g., Hitch et al., 2001; \nRansdell & Hecht, 2003; Towse et al., 2005).  This result is to be expected given the \nevidence that working memory correlates with a raft of adult cognitive skills (e.g., \nKane & Engle, 2002). Through the use of recall timing our study adds two notable \ndimensions. First, some though certainly not all of the predictive power of reading \nspan is shared with recall pauses, meaning that recall processes are relevant to \naccounts of the link between working memory and cognitive abilities. This \ndemonstrates that theories of working memory can be enhanced through a greater \nunderstanding of recall processes in addition to encoding and maintenance operations \n(see also Cowan et al., 1998; Towse & Cowan, 2005; Unsworth & Engle, 2006). \nSecond, recall pauses offer a significant independent source of variance in the \nprediction of ability. Pauses in children’s recall are associated with scholastic \nattainment not merely because such pauses are linked to memory, but also because \nthey reflect independent processes. This finding supports theoretical arguments that \nreading span recall can draw on reconstructive processes that involve representations \nfrom the processing events (i.e., the sentences being read) (Cowan et al., 2003; Saito \n& Miyake, 2004).  \nOne of the drivers for research into complex working memory is the attempt to \nunderstand why the relevant tasks share substantial amounts of variance with other \ncognitive processes (see Conway, Jarrold, Kane, Miyake, & Towse, 2007). Recall \ntiming variables partly mediate the relationship between reading span and scholastic \n Working Memory Task Experience and Timing   25 \nattainment and make an additional independent contribution to explaining attainment. \nOn the basis of the overall pattern of data, we argue that recall involves the important \nprocess of converting incomplete representations into a suitably ordered output \nsequence (incomplete in terms of content and\/or order). This conclusion resonates \nwith arguments from adult data that working memory span can involve both \nimmediate and longer-term memory processes (Miyake & Friedman, 2004; Unsworth \n& Engle, 2006) such that the task reflects embedded processes within working \nmemory (Cowan, 1999). The present results using data from children offer a \nconverging form of evidence for this view that different representational sources are \ninvolved. \nPrediction and practice across sessions. The systematic variance in the pause \nbetween recalled words underlines the contention that recall involves specific and \ncoherent mental processes, including item reactivation in the absence of continuous \nitem maintenance during the retention interval. The interword pauses in particular \nboth share variance between recall accuracy and ability and contribute unique \nvariance to ability over and above that of span. Thus, specific components of recall \ntiming as well as overall durations are predictive as well as reliable. Preparatory \nintervals were in general a less sensitive performance index. We account for this in \nterms of the multiplicity of processes incorporated in this measure, including post-\nsentence processing, sequence rehearsal and construction of the first recall word. \nMoreover, analysis of sequence order and session comparisons showed working \nmemory performance, both for accuracy and recall duration, is most closely related to \nability before children have had very long to learn how to do the task.  At this early \npoint, it appears to reflect the ability to orchestrate a complex and unfamiliar task (see \nalso Rabbitt, 1997).  \n Working Memory Task Experience and Timing   26 \nSeveral theories propose that working memory is linked most strongly with \nability when reading span trials are novel and relatively unpractised, and that the \ndeployment of memorial strategies can dampen the link between working memory \nand external measures (Dunlosky & Kane, in press; Friedman & Miyake, 2004; \nLepine et al., 2005; Turley-Ames & Whitfield, 2003). Yet, the present data are, we \nbelieve, unique in offering direct and convergent evidence for this view among \nchildren.  One interpretation of the data is that control of attention is relevant to \nreading span (Engle et al., 1999), but also that controlled attention requirements are \nnot fixed but diminish with practice (see also Ackerman, 1988).  In addition, Cowan \net al. (2005) argue that working memory tasks measure a core capacity characteristic \nof individuals, but only until other procedures or strategies (e.g., grouping, chunking, \nrehearsal, etc.) develop that relieve the burden on this capacity (see also Cowan, \n2001). We hasten to add that the evidence for controlled attention or core capacity \nviews does not exclude other processes from contributing to the characteristics of \nworking memory performance. Our findings highlight the importance of recognising \nthe complexity of reading span and its potential malleability. \nThese findings therefore have both theoretical and methodological importance. \nThey emphasise that working memory performance is not a unidimensional trait; \nexposure to complex span trials can lead to learning and change in terms of how the \ntask is accomplished and the initial novelty of the task contributes to its links wider \ncognitive skills. From a methodological standpoint, the data indicate that benefits \nfrom collecting additional trial data need to be balanced against the risk that the task \nmay no longer measure quite the same skill. In addition, apparently subtle details of \nhow trials are administered can affect various aspects of performance (e.g., the \nassociation between pauses and ability is weaker with a descending sequence \n Working Memory Task Experience and Timing   27 \npresentation, while age differences in recall ability are larger with an ascending \nsequence). Moreover, if a set of working memory tasks are administered in a fixed \norder, the association between later measures and ability may under-represent the link \nbetween them.  \nA new understanding of reading span in children \nThe importance of the current dataset arises in part from the demonstration of \nhow recall from reading span involves both stability and malleability. On the one \nhand, individual differences in the chronometry of recall show stability, through both \na significant test-retest correlation and associations with external measures of \ncognitive attainment. Indeed the reliability of both overall response durations and \nspecific interword pauses was at least equivalent to the reliability of recall accuracy. \nYet on the other hand, the length of pauses are not immutable; they change with age \nand task experience, and the strength of individual differences are modified by task \nexperience too. Therefore, these contrasting outcomes are not actually incompatible \nwith each other – they instead reflect the rich nature of the reading span task.  \nBoth the chronometry of reading span recall, as well as its accuracy, are \nflexible and sensitive to experience. The overall response duration of two-item \nsequences becomes shorter when they follow longer sequences, an effect that occurs \nspecifically for the interword pause as well as the preparatory interval. Thus, recent \nexperience allows recall to take place more efficiently (we specify ‘recent’ since there \nis no corresponding advantage for a second session taking place some time after the \nfirst).  In addition, there are changes in the predictive strength of recall performance \nwith experience. As the absolute levels of recall increase from the first to the second \nadministration, the strength of association declines between external measures of \nability and both reading span and pause length.  \n Working Memory Task Experience and Timing   28 \nAnalysis indicates that, on the one hand, children achieve more accurate recall \nin a second session without systematic changes to recall duration. On the other hand, \nchildren recall short sequences more rapidly when they have already been exposed to \nlonger sequences, while accuracy does not change. These performance dissociations \ndemonstrate that whilst accuracy and recall time measures can be linked conceptually \nand empirically, they can be shown to be partially independent too. Each measure can \nyield separate and complementary evidence for cognitive processes in children’s \nmemory (see also Cowan et al., 2006). Moreover, pauses in lists of two and three \nitems appear to capture different aspects of individual differences. One possible \nexplanation for this finding is that the contribution of primary and secondary memory \nto recall differs for these two sequence lengths (e.g., Unsworth & Engle, 2006). In \naddition, pauses increase with sequence length (see appendix). This implies that recall \ninvolves memory search through potential recall answers. \nWe argue that the gains from data analysis justify the investment of effort into \nthe examination of recall dynamics, particularly as it can reveal aspects of \nperformance that are not evident in accuracy measures. Our approach allows for a \nmore complete behavioural picture, with multiple dissociations in the patterns of \nperformance across experimental variables. Moreover, the present data amply confirm \nthat working memory is not merely about the maintenance of memoranda. It is also \nabout their production at the point of recall and their recovery from incomplete \nrepresentations. The timing of recall changes with age and shows both consistency \nand flexibility. In both respects, there is evidence for coherence, which can be used to \nincrease our understanding of working memory in children and its development. \n \n Working Memory Task Experience and Timing   29 \nReferences \nAckerman, P. L. (1988). Determinants of individual differences during skill \nacquisition: Cognitive abilities and information processing. Journal of \nExperimental Psychology: General, 117, 288-318. \nAdams, J. W., & Hitch, G. J. (1997). Working memory and children's mental \naddition. Journal of Experimental Child Psychology, 67(1), 21-38. \nAlloway, T. P., Gathercole, S. E., Adams, A., Willis, C., Eaglen, R., & Lamont, E. \n(2005). Working memory and phonological awareness as predictors of \nprogress towards early learning goals at school entry. British Journal of \nDevelopmental Psychology, 23(3), 417-426. \nAlloway, T. P., Gathercole, S. E., Willis, C., & Adams, A. (2004). A structural \nanalysis of working memory and related cognitive skills in young children. \nJournal of Experimental Child Psychology, 87(2), 85-106. \nBaddeley, A. (1996). Exploring the central executive. Quarterly Journal of \nExperimental Psychology, 49A(1), 5-28. \nBaddeley, A. D. (1986). Working Memory. Oxford: Clarendon Press. \nBayliss, D. M., Jarrold, C., Gunn, D. M., & Baddeley, A. D. (2003). The \nComplexities of Complex Span: Explaining Individual Differences in \nWorking Memory in Children and Adults. Journal of Experimental \nPsychology: General, 131(1), 71-92. \nBunting, M. (2006). Proactive interference and item similarity in working memory. \nJournal of Experimental Psychology: Learning, Memory and Cognition, 32(2), \n183-196. \nChiappe, P., Hasher, L., & Siegel, L. A. (2000). Working memory, inhibitory control \nand reading ability. Memory & Cognition, 28(1), 8-17. \n Working Memory Task Experience and Timing   30 \nChuah, Y. M. L., & Maybery, M. T. (1999). Verbal and spatial short-term memory: \ncommon sources of developmental change? Journal of Experimental Child \nPsychology, 73, 7-44. \nConway, A. R., Jarrold, C., Kane, M., Miyake, A., & Towse, J. N. (Eds.). (2007). \nVariation in Working Memory. New York: Oxford University Press. \nConway, A. R. A., Kane, M. J., Bunting, M. F., Hambrick, D. Z., Wilhelm, O., & \nEngle, R. W. (2005). Working memory span tasks: A methodological review \nand user's guide. Psychonomic Bulletin & Review, 12(5), 769-786. \nCopeland, D. E., & Radvansky, G. A. (2001). Phonological similarity in working \nmemory. Memory & Cognition, 29(5), 774-776. \nCowan, N. (2001). The magical number 4 in short-term memory: a reconsideration of \nmental storage capacity. Behavioral and Brain Sciences, 24(1), 87-185. \nCowan, N. (2005). Working memory capacity. Hove, U.K.: Psychology Press. \nCowan, N., Day, L., Saults, J. S., Keller, T. A., Johnson, T., & Flores, L. (1992). The \nrole of verbal output time in the effects of word length on immediate memory. \nJournal of Memory and Language, 31, 1-17. \nCowan, N., Elliott, E. M., Saults, J. S., Morey, C. C., Mattox, S., Hismjatullina, A., & \nConway, A. R. A. (2005). On the capacity of attention:  Its estimation and its \nrole in working memory and cognitive aptitudes. Cognitive Psychology, 51, \n42-100. \nCowan, N., Elliott, E. M., Saults, J. S., Nugent, L. D., Bomb, P., & Hismjatullina, A. (2006). \nRethinking Speed Theories of Cognitive Development. Psychological Science, 17(1), \n67-73. \nCowan, N., Keller, T. A., Hulme, C., Roodenrys, S., McDougall, S., & Rack, J. \n(1994). Verbal memory span in children: Speech timing cues to the \n Working Memory Task Experience and Timing   31 \nmechanisms underlying age and word length effects. Journal of Memory and \nLanguage, 33, 234-250. \nCowan, N., Towse, J. N., Hamilton, Z., Saults, J. S., Elliott, E. M., Lacey, J. F., \nMoreno, M. V., & Hitch, G. J. (2003). Children's working memory processes: \nA response-timing analysis. Journal of Experimental Psychology: General, \n132(1), 113-132. \nCowan, N., Wood, N. L., Wood, P. K., Keller, T. A., Nugent, L. D., & Keller, C. V. \n(1998). Two separate verbal processing rates contributing to short-term \nmemory span. Journal of Experimental Psychology: General, 127(2), 141-160. \nDaneman, M., & Carpenter, P. A. (1980). Individual differences in working memory \nand reading. Journal of Verbal Learning and Verbal Behavior, 19, 450-466. \nDe Beni, R., Palladino, P., Pazzaglia, F., & Cornoldi, C. (1998). Increases in intrusion \nerrors and working memory deficit of poor comprehenders. Quarterly Journal \nof Experimental Psychology, 51A(2), 305-320. \nElliot, C. D., Smith, P., & McCulloch, K. (1997). British Abilities Scale Second \nEdition (BAS II) Technical manual. Windsor, Berkshire: NFER-Nelson. \nEngle, R. W., Tuholski, S. W., Laughlin, J. E., & Conway, A. R. A. (1999). Working \nmemory, short-term memory and general fluid intelligence: A latent variable \napproach. Journal of Experimental Psychology: General, 128(3), 309-331. \nFriedman, N. P., & Miyake, A. (2005). Comparison of four scoring methods for the \nreading span test. Behavior Research Methods, 37, 581-590. \nGathercole, S. E. (1999). Cognitive approaches to the development of short-term \nmemory. Trends in Cognitive Sciences, 3(11), 410-419. \n Working Memory Task Experience and Timing   32 \nHaberlandt, K., Lawrence, H., Krohn, T., Bowe, K., & Thomas, J. G. (2005). Pauses \nand durations exhibit a serial position effect. Psychonomic Bulletin & Review, \n12(1), 152-158. \nHedden, T., & Park, D. (2003). Contributions of source and inhibitory mechanisms to \nage-related retroactive interference in verbal working memory. Journal of \nExperimental Psychology: General, 132(1), 93-112. \nHitch, G. J., Towse, J. N., & Hutton, U. M. Z. (2001). What limits working memory \nspan? Theoretical accounts and applications for scholastic development. \nJournal of Experimental Psychology: General, 130(2), 184-198. \nHorton, N., Towse, J.N., & Cowan, N. (2007).  Response Timing in Working Memory:  \nAn Annotated Guide. Retrieved 18 April 2007 from Lancaster University \nwebsite:  http:\/\/www.psych.lancs.ac.uk\/research\/TowseWM\/. \nKail, R. (2002). Developmental change in proactive interference. Child Development, \n73(6), 1703-1714. \nKane, M. J., & Engle, R. W. (2002). The role of prefrontal cortex in Working \nMemory capacity, executive attention, and general fluid intelligence: An \nindividual difference perspective. Psychonomic Bulletin & Review, 9(4), 637-\n671. \nLeather, C. V., & Henry, L. A. (1994). Working memory span and phonological \nawareness tasks as predictors of early reading ability. Journal of Experimental \nChild Psychology, 58, 88-111. \nLustig, C., May, C. P., & Hasher, L. (2001). Working memory span and the role of \nproactive interference. Journal of Experimental Psychology: General, 130(2), \n199-207. \n Working Memory Task Experience and Timing   33 \nMiyake, A., & Shah, P. (Eds.). (1999). Models of working memory. New York: \nCambridge University Press. \nNovick, M. R. (1966). The axioms and principal results of classical test theory. \nJournal of Mathematical Psychology(3), 1-18. \nRabbitt, P. (1997). Introduction: Methodologies and models in the study of executive \nfunction. In P. Rabbitt (Ed.), Methodology of frontal and executive function \n(pp. 1-38). Hove, East Sussex: Psychology Press. \nRansdell, S., & Hecht, S. A. (2003). Time and resource limits on working memory: \nCross age consistency in counting span performance. Journal of Experimental \nChild Psychology, 86, 303-313. \nSaito, S., & Miyake, A. (2004). On the nature of forgetting and the processing-storage \nrelationship in reading span performance. Journal of Memory and Language, \n50, 425-443. \nSchmidt, F. L., & Hunter, J. E. (1999). Theory testing and measurement error. \nIntelligence, 27(3), 183-198. \nSteiger, J. H. (1980). Tests for comparing elements of a correlation matrix. \nPsychological Bulletin, 87(2), 245-251. \nTehan, G., & Lalor, D. M. (2000). Individual differences in memory span: The \ncontribution of rehearsal, access to lexical memory, and output speed. \nQuarterly Journal of Experimental Psychology, 53A(4), 1012-1038. \nTowse, J. N., & Cowan, N. (2005). Working memory and its relevance for cognitive \ndevelopment. In W. Schneider, R. Schumann-Hengsteler & B. Sodian (Eds.), \nYoung Children’s Cognitive Development: Interrelationships among \nExecutive Functioning, Working Memory, Verbal Ability, and Theory of \nMind (pp. 9-37). Mahwah, NJ: Lawrence Erlbaum Associates. \n Working Memory Task Experience and Timing   34 \nTowse, J. N., Cowan, N., Hitch, G. J., & Horton, N. (submitted). The recall of information \nfrom working memory: insights from behavioural and chronometric perspectives. \nManuscript submitted for publication. \nTowse, J. N., Hamilton, Z., Hitch, G. J., & Hutton, U. (2000). Sentence completion \nnorms among adults: A corpus of sentences differing in length (Technical \nReport No. CDRG 7): Royal Holloway, University of London. \nTowse, J. N., Hitch, G. J., Hamilton, Z., Peacock, K., & Hutton, U. M. Z. (2005). \nWorking memory period: the endurance of mental representations. Quarterly \nJournal of Experimental Psychology, 58A(3), 547-571. \nTurner, M. L., & Engle, R. W. (1989). Is working memory capacity task dependent? \nJournal of Memory and Language, 28, 127-154. \nUnsworth, N., & Engle, R. W. (2006). Simple and complex memory spans and their \nrelation to fluid abilities: Evidence from list-length effects. Journal of Memory \nand Language, 54, 68-80. \nWaters, G. S., & Caplan, D. (1996). The measurement of verbal working memory \ncapacity and its relation to reading comprehension. Quarterly Journal of \nExperimental Psychology, 49A(1), 51-70. \nWhitney, P., Arnett, P. A., Driver, A., & Budd, D. (2001). Measuring central \nexecutive functioning: What's in a reading span? Brain and Cognition, 45, 1-\n14. \n \n Working Memory Task Experience and Timing   35 \nTable 1. Dependent variables and the processes that they are designed to measure. \n \n______________________________________   _______________ \nName   Measurement unit  Cognitive processes involved \nReading span Recall accuracy (no. of \nserially ordered items) \nInformation retention alongside (& embedded \nwithin) ongoing processing activity \nPreparatory intervals Duration (seconds) Response planning, sequence organisation and \nactivation of the first recall item \nWord duration  Duration (seconds) Articulation speed \nInterword pause Duration (seconds) Memory search and word reactivation, including \nredintegration and cue-based reconstruction \n \n \n Working Memory Task Experience and Timing   36 \nTable 2. Number of children credited with correct reading span sequence recall on first assessment. \n_____________________________________________________ \n   9-year-olds     11-year-olds \nSequence length order \n   Ascending (n=37) Descending (n=27) Ascending (n=37) Descending (n=27) \n_____________________________________________________ \nList-length-2  37 (37)  27 (20)  37 (37)  27 (24) \nList-length-3  18 (14)  17 (12)  33 (29)  21 (21) \nList-length-4  4 (3)   1 (1)   15 (14)  7 (7) \nList-length-5  0 (0)   2 (2)   0 (0)   0 (0) \n_____________________________________________________ \nNote.  Number of children with analysable sequences for recall timing in parentheses. \n Working Memory Task Experience and Timing   37 \nTable 3.  Reading span scores, as the number of words recalled from correct sequences.  \n______________________________________________________________________________________________ \n    First session  First of two sessions  Second of two sessions \nAscending sequence order \n9-year-olds   6.95 (4.83)  6.42 (3.99)   8.67 (3.64) \n11-year-olds   12.0 (4.86)  11.9 (4.62)   11.5 (5.60) \n \nDescending sequence order \n9-year-olds   8.04 (4.75)  9.00 (4.77)   9.94 (6.81) \n11-year-olds   10.3 (4.05)  10.2 (3.69)   13.5 (5.08) \n______________________________________________________________________________________________ \nNote.  Data from the first session involve 130 children, while 75 children completed two sessions, and their performance is reported at \neach assessment. Standard deviations in parentheses. \n \n Working Memory Task Experience and Timing   38 \nTable 4. Recall timing characteristics of correct list-length-2 sequences in children’s first session. \n______________________________________________________________________________________ \n \nRecall segment  PrepI  Wd1  Pause1  Wd2  Total duration \n \nRecall segment timings (ascending sequence order) \n9-year-olds   2.49 (1.78) .53 (.18) .66 (.55) .48 (.11) 4.16 (1.95) \n11-year-olds   1.26 (.73) .42 (.13) .36 (.37) .46 (.10) 2.50 (.90) \n \nRecall segment timings (descending sequence order) \n9-year-olds   1.22 (1.56) .45 (.15) .31 (.14) .47 (.10) 2.46 (1.63) \n11-year-olds   1.11 (.70) .39 (.09) .31 (.21) .42 (.11) 2.23 (.87) \n______________________________________________________________________________________ \n Note.  Standard deviations in parentheses. PrepI – preparatory interval, Wd1 = duration of first word, Pause1= interword pause \nbetween the first and second word, Wd2= duration of second word, Total Duration = Sum of all recall timing components. \n Working Memory Task Experience and Timing   39 \n \n \nTable 5.  Recall time profile for children who successfully recalled 4-item sequences in reading span. Standard deviations in parentheses. \n______________________________________________________________________________________________ \n    Ascending sequence    Descending sequence \n    List-length 2 List length 3 List length 4 List-length 2 List length 3 List length 4 \nPreparatory intervals  1.213 (.509) 1.448 (.823) 2.135 (3.000) 1.345 (.999) 2.484 (2.461) 1.498 (1.518) \nInterword pauses  .300 (.179) .547 (.556) .941 (.995) .341 (.342) 1.051 (1.164) .953 (.565) \nWord durations  .469 (.095) .511 (.123) .557 (.160) .431 (.087) .539 (.134) .560 (.170) \n______________________________________________________________________________________________ \n Working Memory Task Experience and Timing   40 \n \nFigure 1. The duration of correct recall sequences as a function of list-length \nand sequence administration order, for the first assessment of reading span.  \nPI Wd1 Ps1 Wd2 Ps2 Wd3\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\nList-Length 2 (ascending)\nList-Length 3 (ascending)\nList-Length 2 (descending)\nList-Length 3 (descending)\nResponse segment\nR\ne\nc\na\nll \nd\nu\nra\nti\no\nn\n (\ns\n)\n Working Memory Task Experience and Timing   41 \n Figure 2. The duration of correct recall sequences as a function of list length and \nsequence administration order, for the second assessment of reading span.  \n \n \nPI Wd1 Ps1 Wd2 Ps2 Wd3\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0 List Length 2 (ascending)\nList Length 3 (ascending)\nList Length 2 (descending)\nList Length 3 (descending)\nSession 2 recall sequences\nResponse segment\nR\ne\nc\na\nll \nd\nu\nra\nti\no\nn\n (\ns\n)\n Working Memory Task Experience and Timing   42 \n Figure 3. Schematic representation of the unique and common variance shared with \nthe criterion skill measure from BAS performance, using children with list-length 2 \nrecall pause data. \n \n \n \n Working Memory Task Experience and Timing   43 \nFigure 4. Schematic representation of the unique and common variance shared \nwith the criterion skill measure from BAS performance, using children with both list-\nlength 2 and list length-3 recall pause data. \n \n Working Memory Task Experience and Timing   44 \nAppendix 1. Further analysis of recall timing \nPerformance as a function of list length. Among children with correct recall of \ntwo and three item sequences, analysis of the first word, with age, list-length and \nsequence order as factors, indicated that words were produced more quickly at the \nshorter sequence length, F(1,69)=38.3, p<.001, !p\n2\n=.357 and by older children, \nF(1,69)=7.83, p=.007, !p\n2\n=.102, while there was no main effect of sequence order, \nF<1, !p\n2\n=.011. The list-length by sequence order interaction was marginally \nsignificant, F(1,69)=3.63, p=.061, !p\n2\n=.050 as was the three-way interaction between \nage, sequence order and list-length, F(1,69)=3.14, p=.081, !p\n2\n=.044.  \nPrevious analyses have suggested that children’s preparatory intervals do not \nsystematically change with list-length. Consistent with that view, analysis of \npreparatory intervals with age, list-length and sequence order as factors yielded a non-\nsignificant effect of list-length, F<1, p=.449, !p\n2\n=.008. Older children began their \nrecall more promptly, F(1,69)= 8.17, p=.006, !p\n2\n=.106, and preparatory intervals \nwere shorter with descending sequences, F(1,69)=4.95, p=.029, !p\n2\n=.067. The \nsequence order by age interaction was marginal, F(1,69)=3.24, p=.076, !p\n2 \n=.045. \nOther interactions were not significant.  \nAnalysis of the first interword pause with age, list-length and sequence order \nas factors showed in contrast with preparatory intervals that pauses significantly \nincreased for three- compared with two-item sequences, F(1,69)=16.24, p<.001, \n!2p=.191, almost tripling in duration. Pauses were marginally shorter among older \nchildren, F(1,69)=3.00, p=.088, !p\n2\n=.042, but there was no effect of sequence order, \nF<1, !p\n2\n=.011. Interactions were not significant.  \nAnalysis of output position effects can help to indicate, for example, whether \nrecall processes involve list wide search or whether earlier items can be excluded \n Working Memory Task Experience and Timing   45 \nfrom consideration (see Haberlandt, Lawrence, Krohn, Bowe, Thomas, 2005). \nAnalysis with respect to two-item sequences showed that the length of the first and \nsecond words did not differ, F<1, !p\n2\n=.002, although older children articulated words \nmore quickly, F(1,114)=9.08, p=.003, !p\n2\n=.074, and word duration was shorter with \ndescending sequences, F(1,114)=4.38, p=.039, !p\n2\n=.037. Corresponding analysis for \nsequences with three items indicated that word durations did become significantly \nshorter at later positions, F(2,146)=19.7, p<.001, !p\n2\n=.213 along with an age \ndifference, F(1,73)=6.09, p=.016, !p\n2\n=.077, but no sequence order effect, F<1, \n!p\n2\n=.002. There was an interaction between output position and sequence order, \nF(2,144)=3.41, p=.036, !p\n2\n=.045; the speeding up in recall was more pronounced \nfrom the second to the third word with descending sequences. A comparison of the \ntwo interword pauses at list-length-3 produced no effect of output position, F<1, \n!p\n2\n=.012, age, F(1,68)=1.48, p=.227, !p\n2\n=.020, or sequence order, F<1, !p\n2\n=.001. \nNone of the interactions was significant.   \nLonger list lengths. By aggregating data across testing sessions, it becomes \nfeasible to incorporate sequences of four items into recall timing analysis, with means \nreported in Table 5. It is worth bearing in mind that these data come mostly from \nolder children (n=33 from a sample of n=130) who would correspond to a high-span \ngroup in an extreme-group design (where the upper 25% quartile is often selected).  \nAnalysis collapses across age group because of the small cell sizes. Preparatory \nintervals, analysed with list-length and sequence order as factors, showed no \nsignificant effect of length, F(2,62)=1.60, p=.211, !p\n2\n=.049, nor order, F<1, !p\n2\n=.006, \nnor an interaction, F(2,62)=2.50, p=.114, !p\n2\n=.075. Pauses increased with the length \nof sequences, F(2.62)=7.12, p=.005, !p\n2\n=.187, but there were no effect of sequence \norder, F(1,31)=1.89, p=.178, !p\n2\n=.058, nor an interaction, F(2,62)=2.10, p=.146, \n Working Memory Task Experience and Timing   46 \n!p\n2\n=.063. Words were spoken more slowly at longer sequence lengths, F(2,62)=11.6, \np<.001, !p\n2\n=.272, but there was no effect of sequence order, F<1, !p\n2\n=.017, nor an \ninteraction, F<1, !p\n2\n=.027. \nMeasurement reliability in recall timing. Although rarely discussed in detail, \nmeasurement reliability is highly important to interpreting recall timing. Variations in \nthe temporal dynamics of word production are self-evidently constrained by \nintelligibility demands, in a way that does not apply to pauses. Pauses are also more \nopen-ended in the mental activities that can produce them. Given that pauses for \nsequences of two and three items are not correlated, and since reliability can severely \nconstrain the inter-relationships between variables (Schmidt & Hunter, 1999) we \nexamined the reliability of pauses further.  \nThere are different ways of formalising the reliability of each recall variable; \nhere, we calculated the correlation between the times of the first two analysable recall \ntrials used to calculate data for analysis (using the raw, pre-Winsorized data). This led \nto a reliability estimates of r(46)=.76, and r(6)=.49 for sequences of two and three \nitems. The corrected correlation for pauses between two- and three-item sequences in \nthe first test session became rc(71)=.26, p<.05, yet the correlations between pauses \nand scholastic ability were rc(109)=-.41, and rc(71)=-.55, ps<.01 for sequences of two \nand three items respectively (using normative data for estimating the reliability of the \nBAS). Thus, even after compensation for unreliability, the correlations between recall \npauses and BAS scores were higher than that between the pauses themselves. At one \nlevel, this is paradoxical: classical test theory suggests that test-retest reliability places \nan upper bound on any link between that variable and another (e.g., Novick, 1966). \nHowever, the pauses at each list length need not be measuring exactly the same \n Working Memory Task Experience and Timing   47 \nconstruct, and indeed the evidence from the data themselves suggests that task \nexperience produces changes in working memory processes.  \n"}