{"doi":"10.1063\/1.1302361","coreId":"68616","oai":"oai:eprints.lancs.ac.uk:31935","identifiers":["oai:eprints.lancs.ac.uk:31935","10.1063\/1.1302361"],"title":"Experimental studies of the non-adiabatic escape problem","authors":["Arrayas, M.","Khovanov, I. A.","Luchinsky, D. G.","Mannella, R.","McClintock, Peter V. E.","Greenall, M.","Sabbagh, H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"Noise-induced transitions between coexisting stable states of a periodically driven nonlinear oscillator have been investigated by means of analog experiments and numerical simulations in the nonadiabatic limit for a wide range of oscillator parameters. It is shown that, for over-damped motion, the field-induced corrections to the activation energy can be described quantitatively in terms of the logarithmic susceptibility (LS) and that the measured frequency dispersion of the corresponding corrections for a weakly damped nonlinear oscillator is in qualitative agreement with the theoretical prediction. Resonantly directed diffusion is observed in numerical simulations of a weakly damped oscillator. The possibility of extending the LS approach to encompass escape from the basin of attraction of a quasi-attractor is discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68616.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31935\/1\/AIPlakes2000ExperimentalStudies.pdf","pdfHashValue":"cd42f31f4f9f54f1212332fe7b71a5e9e50e56e7","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31935<\/identifier><datestamp>\n      2017-10-25T23:04:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Experimental studies of the non-adiabatic escape problem<\/dc:title><dc:creator>\n        Arrayas, M.<\/dc:creator><dc:creator>\n        Khovanov, I. A.<\/dc:creator><dc:creator>\n        Luchinsky, D. G.<\/dc:creator><dc:creator>\n        Mannella, R.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Greenall, M.<\/dc:creator><dc:creator>\n        Sabbagh, H.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Noise-induced transitions between coexisting stable states of a periodically driven nonlinear oscillator have been investigated by means of analog experiments and numerical simulations in the nonadiabatic limit for a wide range of oscillator parameters. It is shown that, for over-damped motion, the field-induced corrections to the activation energy can be described quantitatively in terms of the logarithmic susceptibility (LS) and that the measured frequency dispersion of the corresponding corrections for a weakly damped nonlinear oscillator is in qualitative agreement with the theoretical prediction. Resonantly directed diffusion is observed in numerical simulations of a weakly damped oscillator. The possibility of extending the LS approach to encompass escape from the basin of attraction of a quasi-attractor is discussed.<\/dc:description><dc:date>\n        2000<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31935\/1\/AIPlakes2000ExperimentalStudies.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31935\/4\/AIPlakes2000ExperimentalStudies.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1302361<\/dc:relation><dc:identifier>\n        Arrayas, M. and Khovanov, I. A. and Luchinsky, D. G. and Mannella, R. and McClintock, Peter V. E. and Greenall, M. and Sabbagh, H. (2000) Experimental studies of the non-adiabatic escape problem. AIP Conference Proceedings, 502. pp. 20-25. ISSN 0094-243X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31935\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"sq","id":41,"name":"Albanian"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.1302361","http:\/\/eprints.lancs.ac.uk\/31935\/"],"year":2000,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Experimental Studies Of The\nNon\u0002Adiabatic Escape Problem\nM\u0002 Arrayas\n\u0000\n\u0003 I\u0002A\u0002 Khovanov\n\u0002\n\u0003 D\u0002G\u0002 Luchinsky\n\u0000\n\u0003 R\u0002 Mannella\n\u0003\n\u0003\nP\u0002V\u0002E\u0002 McClintock\n\u0000\n\u0003 M\u0002 Greenall\n\u0000\n\u0003 H\u0002 Sabbagh\n\u0004\n\u0000\nDepartment of Physics\u0002 Lancaster University\u0002 Lancaster LA\u0003 \u0004YB\u0002 UK\n\u0002\nDepartment of Physics\u0002 Saratov State University\u0002 Astrahanskaya \u0005\u0006\u0002 \u0004\u0003\u0007\u0007\b\t Saratov\u0002 Russia\n\u0003\nDipartimento di Fisica\u0002 Universit\na di Pisa and and INFM UdR Pisa\u0002 Piazza Torricelli \b\u0002\n\u000b\t\u0003\u0007\u0007 Pisa\u0002 Italy\n\u0004\nSchool of Biomedical Sciences and Center for Nonlinear Studies\u0002 Leeds University\u0002\nLeeds LS\b \fJT\u0002 UK\nAbstract\u0002 Noise\u0005induced transitions between coexisting stable states of a periodically\ndriven nonlinear oscillator have been investigated by means of analog experiments and\nnumerical simulations in the non\u0005adiabatic limit for a wide range of oscillator param\u0005\neters\u0006 It is shown that\u0007 for over\u0005damped motion\u0007 the \beld\u0005induced corrections to the\nactivation energy can be described quantitatively in terms of the logarithmic suscepti\r\nbility \tLS\n and that the measured frequency dispersion of the corresponding corrections\nfor a weakly damped nonlinear oscillator is in qualitative agreement with the theoreti\u0005\ncal prediction\u0006 Resonantly directed di\u000busion is observed in numerical simulations of a\nweakly damped oscillator\u0006 The possibility of extending the LS approach to encompass\nescape from the basin of attraction of a quasi\u0005attractor is discussed\u0006\nINTRODUCTION\nNoise\u0002induced escape from a periodically driven state plays an important role\nin a wide range of phenomena e\u0003g\u0003 the earth\u0004s ice\u0002age cycle \u0005\u0006\u0007 and excitable neu\u0002\nrons \u0005\b\u0007\u0003 External driving can often exert a marked in\tuence on the escape prob\u0002\nability W \u0000 exp\n\u0002R\u0002kT \u000b\u0003 The corresponding mechanism is readily understood in\nthe case of adiabatic driving\f where the system remains in quasi\u0002equilibrium under\nthe instantaneous value of the driving force\f and the activation energy R is given\nby the height of the potential barrier\f as modulated slowly by the driving force\u0003\nFor higher driving frequencies \u0003\nf\n\u0004 t\n\u0000\u0000\nrel\n\nwhere t\nrel\nis a characteristic relaxation\ntime of the system\u000b a complete theoretical analysis is signi\rcantly more complicated\nbecause the system cannot be considered to remain in quasi\u0002equilibrium\u0003 One might\nperhaps expect that the change in activation energy R would be proportional to A\n\u0002\n\f\ni\u0003e\u0003 that the \reld would give rise to an e\u000eective \u000fheating\u0010 of the system \nsee e\u0003g\u0003 \u0005\u0011\u0007\u000b\u0003\nRecently\f however\f it was suggested \u0005\u0012\f\u0013\u0007 that the \reld\u0002induced corrections to the\nactivation energy at high frequencies should \u0014 quite counterintuitively \u0014 be linear\nin the \reld amplitude\u0003 The coe\u0015cient of proportionality was called the logarithmic\nsusceptibility \nLS\u000b\u0003\nThe LS\u0002theory \u0005\u0012\f\u0013\u0007 is based on the concept of optimal paths \u0005\u0016\u0007 \u0014 the most\nprobable paths along which system \tuctuates from a steady state to some speci\red\nremote state\u0003 In thermal equilibrium\f optimal paths are time\u0002reversed relaxational\npaths of the dissipative system \u0005\u0016\u0007\f and thus are known or can easily be found\nexperimentally\u0003 The main idea underlying the LS\u0002theory is that\f although in general\nthe \tuctuational and relaxational paths lose their time reversal symmetry under\nperiodic perturbation\f the \reld\u0002induced corrections of the equilibrium optimal path\nare small\u0003 The \reld\u0002induced corrections to the activation energy are therefore linear\nin the \reld and\f for periodic driving F \nt\u000b \u0017\nP\nk\nF\nk\nexp\nik\u0003t\u000b\f they can be written\n\u0005R \u0017 min\nt\nc\n\u0005R\nt\nc\n\u000b\u0006 \u0005R\nt\nc\n\u000b \u0017\nX\nk\nF\nk\n\u0018\u0007\nk\u0003\u000be\nik\u0002t\nc\n\u0006 \u0018\u0007\n\u0003\u000b \u0017 \u0002\nZ\n\u0002\n\u0000\u0002\ndt \u0019q\n\u0003\u0004\u0005\n\nt\u000be\ni\u0002t\n\b \n\u0006\u000b\nHere\f \u0018\u0007\n\u0003\u000b is the LS for escape and \u0019q\n\u0003\u0004\u0005\n\nt\u000b the velocity along the most probable\nescape path in the absence of driving \nF \nt\u000b \u0017 \u001a\u000b\u0003 The LS is a fundamental charac\u0002\nteristic of the system dynamics in equilibrium and does not depend on the \reld\u0003\nSome important properties of the LS can readily \u0005\u001b\u0007 be veri\red using \n\u0006\u000b\u0003 In\nparticular\f the \reld\u0002induced corrections to the activation energy should be linear in\nthe amplitude of the harmonic driving\u0003 The LS dependence on the phase shift be\u0002\ntween harmonics of the driving force should display singularities due to the acasual\ncharacter of the LS \u0005\u0012\u0007\u0003 \nNote that the integral in \n\u0006\u000b is taken from \u0002\u0003 to \u001c\u0003\nbecause we consider transitions between two stable states of the system\u0003\u000b The fre\u0002\nquency dispersion of the LS should be exponentially sharp \u0005\u0012\u0007 for strong damping\nand may exhibit a resonance\u0002like behaviour in weakly damped nonlinear oscilla\u0002\ntors\u001d in systems with asymmetric spatially periodic potentials\f resonantly directed\ndi\u000eusion \u0005\u0013\u0007 may be expected\u0003\nTo test these predictions\f we have built analog electronic models \u0005\u001e\u0007 of three\ndi\u000eerent types of nonlinear oscillators\u0003 We drive them with zero\u0002mean quasi\u0002white\nGaussian noise from a shift\u0002register noise generator\f digitize the response q\nt\u000b\f and\nanalyze it with a digital data processor\u0003 We have also carried out a complementary\ndigital simulation\f using a high\u0002speed pseudo\u0002random generator \u0005\u001f\u0007\u0003\nTHE STRONG DAMPING LIMIT\nWe consider \rrst the \tuctuations of an overdamped Brownian particle driven by\na periodic \nbut not necessarily sinusoidal\u000b force F \nt\u000b and white Gaussian noise \t\nt\u000b\f\n\u0019q \u0017 K\nq\u0006 t\u000b \u001c \t\nt\u000b\u0006 K\nq\u0006 t\u000b \u0017 \u0002U\n\u0003\n\nq\u000b \u001c F \nt\u000b\u0006 \n\b\u000b\nwhere h\t\nt\u000b\t\nt\n\u0003\n\u000bi \u0017 \bD\u0005\nt \u0002 t\n\u0003\n\u000b and the noise intensity D \u0017 kT \f and we consider\nthe double well Du\u0015ng potential U\nq\u000b \u0017 \u0002q\n\u0002\n\u0002\b\u001c q\n\u0006\n\u0002\u0012\f as used in diverse scienti\rc\ncontexts \nsee e\u0003g\u0003 \u0005\u0006\u001a\u0007 and references therein\u000b\u0003\nWe have measured the \reld\u0002dependent correction to the period\u0002averaged escape\nrate from the stable state\f\n \nW \u0017 \u0006\u0002hti\u0003 It is given by exp\n\u0002\u0005R\u0002D\u000b for j\u0005Rj \u0004 D\n\u0005\u0012\f\u0013\f\u0006\u0006\u0007\u0003 For a sinusoidal driving force\f the correction to the activation energy of\nescape \n\u0006\u000b is \u0005R \u0017 \u0002\bjF\n\u0000\n\u0018\u0007\n\u0003\u000bj\u0003 The major observation is that R is indeed linear\nin the force amplitude \nsee Fig\u0003 \u0006a\u000b\u0003 The slope yields the absolute value of the LS\u0003\nIts frequency dependence\f a fundamental characteristic of the original equilibrium\nsystem\f is also in good agreement \ninset of Fig\u0003 \u0006a\u000b with the theoretical predictions\u0003\n0 0.1 0.2 0.3 0.4\n0.1\n0.2\n0.3\n0.4\n A\n \nR\n0 2 4\n0\n0.4\n0.8\n \n∼\n ω\n \n⏐χ\n(ω\n)⏐\n(a) \n−3 0 3 6 9\n0\n0.1\n0.2\n φ0\n \nR\n   (b)\nFIGURE \u0003\u0002 \ta\n The dependence of the activation energy R on the amplitudeA of the harmonic\ndriving force F \tt\n \f A cos\t\u0000\u0002\u0002t\n\u0007 as determined by electronic experiment \topen circles\n\u0007 numerical\nsimulations \t\blled circles\n and analytic calculation \tsolid line\n based on \t\u0000\n\r the dash\u0005dot line is a\nguide to the eye\u0006 Inset\u000e the absolute value of the LS of the system j\u000f\u0003\t\u0004\nj \t\u0000\n measured \topen and\n\blled squares for experiment and numerical simulation\u0007 respectively\n and calculated \tfull curve\n\nas a function of frequency \u0004\u0006 \tb\n The activation barrier R as a function of phase di\u000berence \u0005\n\u0005\nfor\na biharmonic driving force\u0006 Calculations based on \t\u0000\n \tfull curve\n are compared with data from\nelectronic \t\blled circles\n and numerical \topen circles\n experiments\u0006\nThe results demonstrate that the variation of the activation energy with \reld\ncan be well described in terms of the LS for a wide range of parameter values\u0003 We\nnote however a small deviation from the theory at small amplitudes of the external\ndrive\f and the consequent systematic shift of the experimental and numerical points\nabove the theory \nsolid line\u000b\u0003 It is attributable to the \rnite noise intensities used\nin the experiment\f and the fact that the D\u0005 \u001a limit of the theory breaks down for\namplitudes F of the external driving for which j\u0007F j\u0002D is small! it can be accounted\nfor by an extension \u0005\u0006\u0006\u0007 of the theory taking account of changes in the prefactor\u0003\nTo verify experimentally the acasual character of the LS we seek the switching\nbetween escape paths predicted \u0005\u0012\u0007 for the biharmonic \reld F \nt\u000b \u0017 \u001a\b\u0006 cos\n\u0006\b\bt\u000b \u001c\n\u001a\b\u0011 cos\n\b\b\u0012t \u001c \n\n\u0004\n\u000b\u0003 For a \reld of this kind\f \u0005R\nt\nc\n\u000b \n\u0006\u000b may have two local minima!\nbut the activation energy will correspond to the absolute minimum\u0003 Thus\f as \n\n\u0004\nis\nchanged\f the escape path will switch from being determined by one local minimum\nto being determined by the other\u0003 The activation energy will consequently display\na singularity as a function of \n\n\u0004\n\f as clearly demonstrated in Fig\u0003 \u0006\nb\u000b\u0003\nWEAK DAMPING\nIn the limit of small damping we have considered the following model\n\"q \u001c \b# \u0019q \u001c U\n\u0003\n\nq\u000b \u0017 F \nt\u000b \u001c \t\nt\u000b\u0006 h\t\nt\u000b\t\nt\n\u0003\n\u000bi \u0017 \u0012#kT\u0005\nt\u0002 t\n\u0003\n\u000b\b \n\u0011\u000b\nIt was predicted earlier \u0005\u0013\u0007 that for this model the high\u0002frequency \reld F \nt\u000b may\nresonantly decrease the activation energy of escape from one of the potential wells\u0003\nMoreover\f for systems with spatially periodic asymmetric potentials the e\u000eect is\ndi\u000eerent in opposite directions\f which gives rise to resonantly directed di\u000eusion\u0003\n0 1 20\n4\n8\n \n~\n ω\n \nδ R\n\/A\n, |χ\n± (ω\n)|\n (a)\n0 0.4 0.80\n2\n4\n ω\n \nδ R\n\/A\n, |χ\n± (ω\n)|  (b)\nFIGURE \u0004\u0002 \ta\n The LS j\u000f\u0003\n\u0000\n\t\u0004\nj of the escape rates to the right \u0010 \tsolid curve\n and to the left \u0002\n\tdashed curve\n compared with corrections to the activation energy scaled by the \beld amplitude\n\u0006R\u0007A obtained in the numerical simulations \topen circles\u0007 to the right\r and \blled circles\u0007 to the\nleft\n for two sets of parameters\u0006 \ta\n The temperature T varied from \u0011\u0006\u0000 to \u0011\u0006\u0004 \ti\u0006e\u0006 \u0012 \u0003 kT \n\u0007\nU \tq\n \f sin q \u0010 \u0011\u0002\u0003 sin\t\u0002q \u0010 \u0011\u0002\u0004\n\u0007 F \tt\n \f \u0011\u0002\u0003 sin\t\u0004t\n\r \tb\n T varied from \u0011\u0006\u0011\u0000 to \u0011\u0006\u0011\u0004 \ti\u0006e\u0006 \u0012 \b kT \n\u0007\nU \tq\n \f \u0011\u0002\u0000 sin q \u0010 \u0011\u0002\u0011\u0004\u0013 sin\t\u0002q \u0010 \u0011\u0002\u0002\n\u0007 F \tt\n \f \u0011\u0002\u0011\u0003 sin\t\u0014t\n\u0006 The damping was \u0012 \f \u0011\u0002\u0000 in both\ncases\u0006\nWe have investigated this e\u000eect bymeans of numerical simulations\u0003 The two cases\nshown in Fig\u0003 \b should be carefully distinguished\u0003 In Fig\u0003 \b\na\u000b results are shown for\nthe set of parameters taken from \u0005\u0013\u0007\u0003 To be able to observe \tuctuational transitions\f\nthe temperature had to be set within the range \u001a\u0003\u0006\u0014\u001a\u0003\u0012\f so that # \u0006 kT \u0003 In this\ncase there is no di\u000eerence between the measured transition rates to the right and\nto the left\u0003 Resonantly directed di\u000eusion \u0014 as indicated by the di\u000eerent frequency\u0002\ndependences and crossings of the LSs for transitions to the right and left \u0014 can\noccur only for #\u0004 kT \f as in Fig\u0003 \b\nb\u000b\u000b\f i\u0003e\u0003 if the change of energy per oscillation\nis larger than kT and the concept of the optimal path is meaningful\u0003 Agreement\nwith theory is no more than semi\u0002quantitative\f but we note that the approximate\ntheory is only valid within a relatively narrow parameter range that varies with the\nfrequency of the driving \reld\u0003\n0.02 0.06 0.1 0.14 0.18\n−1.5\n−1\n−0.5\n0\n0.5\n h\n q1\n→4→1 →2 →3\n→5 →6→ 7→8 →9(a)\n0 6 12 18\n−1\n0\n1\n (b)\n ωft\/2π\n q1\nFIGURE \u0005\u0002 \ta\n A bifurcation diagram in Poincare cross\u0005section obtained for \t\u0004\n with\n\u0004\nf\nt \f \u0011\tmod\u0002\t\n\n \u0004\nf\n\f \u0000\u0002\u0011\u0011\u0015 shows values of q\n\u0000\n\u0006 Arrows \u0000 and \u0004 indicate the region of hys\u0005\nteresis for the period \u0002 resonance\u0006 The region of coexistence of the two resonances of period \u0002\nlies between arrows \u0002 and \u0015\r that of the large stable limit cycle of period \u0000 lies between arrows\n\u0003 and \u0013\u0006 Arrows \u0016\u0017\u0013 show the boundaries of the chaotic states\u0006 \tb\n The optimal escape path\nfrom the quasi\u0005attractor to the stable limit cycle\u0007 found in the numerical simulations by use of\nthe prehistory probability distribution\u0007 is shown by the solid line\u0006 Single periods of the unstable\nsaddle cycles of period \u0015\u0007 \u0003 and \u0000 are shown by open circles\u0007 pluses and asterisks respectively\r the\nstable limit cycle is shown by dots\u0006\nNOISY ESCAPE FROM A QUASI\u0002ATTRACTOR\nWe have also investigated the stochastic dynamics of a periodically driven non\u0002\nlinear oscillator with equation of motion in the form\n\"\nq\u001c \b#\n\u0019\nq \u001c \u0003\n\u0002\n\u0004\nq\u001c \u000bq\n\u0002\n\u001c \fq\n\u0007\n\u0017 h cos\n\u0003\nf\nt\u000bg\u001c \t\nt\u000b\u0006\n\r \t\nt\u000b \u0004\u0017 \u001a\u0006 \r \t\nt\u000b\t\n\u001a\u000b \u0004\u0017 \u0012kT#\u0005\nt\u000b\u0006 #\u0007 \u0003\nf\n\u0006\n\u001f\n\u0006\u001a\n\r\n\u000b\n\u0002\n\f\u0003\n\u0002\n\u0004\n\r \u0012\b \n\u0012\u000b\nFor these parameters the potential is monostable and the dependence of the energy\nof oscillations on the frequency is non\u0002monotonic\u0003 It was shown earlier \u0005\u0006\b\u0007 that\nchaos appears in \n\u0012\u000b at relatively small driving amplitudes\f h \b \u001a\b\u0006\u0003\nA bifurcation diagram is shown in the Fig\u0003 \u0011a for one set of parameters\u001d the chaot\u0002\nic state appears as the result of period\u0002doubling bifurcations\f and thus corresponds\nto a quasi\u0002attractor\u0003 The working point was chosen in the region of coexistence of\nthe stable limit cycle and quasi\u0002attractor\u001d h \u0017 \u001a\b\u0006\u0011\u0006 \u0003\nf\n\u0017 \u001a\b\u001f\u0013\u0003\nA statistical analysis of the measured \tuctuational trajectories \u0005\u001e\u0007 and the cor\u0002\nresponding realisations of the random force reveals the following scenario of escape\nfrom the basin of attraction of the quasi\u0002attractor \nsee Fig\u0003 \u0011b\u000b\u0003 The system comes\n\rrst to the unstable limit cycle of period \u0013 embedded in the quasi\u0002attractor\f and\nthen slides down the unstable manifold of this cycle\u0003 At this moment the optimal\nforce \ndeterministically related to the optimal path via the equations of motion\n\n\u0012\u000b\u000b switches on and the system is driven by noise to the period \u0011 unstable limit\ncycle\f which is not part of the quasi\u0002attractor and can be considered as its bound\u0002\nary\u0003 Next\f the optimal force drives the system from the period \u0011 limit cycle to the\nboundary of the basin of attraction of the quasi\u0002attractor\u0003 Thus the problem of\nescape from a quasi\u0002attractor can be considered in terms of \tuctuational transitions\nbetween limit cycles of low period and their corresponding logarithmic susceptibili\u0002\nties\u0003 Given that the LS\u0002theory can be extended to include the case of \tuctuational\ntransitions between limit cycles \nM\u0003I\u0003 Dykman and V\u0003N\u0003 Smelyanskiy\f private com\u0002\nmunication\u000b we may hope to apply it to estimate the probability of noise\u0002induced\nescape from the basin of attraction of a quasi\u0002attractor\u0003\nCONCLUSIONS\nIn conclusion\f we have shown experimentally that thermally activated escape\nunder nonequilibrium conditions can be understood in terms of the logarithmic\nsusceptibility\f and that the latter is a physically observable quantity\u0003 We have\nveri\red experimentally the predicted \u0005\u0012\u0007 non\u0002analytic behaviour of the activation\nenergy as a function of the \reld parameters for biharmonic driving and the ex\u0002\nponentially sharp frequency dispersion of the LS in the limit of strong damping\u0003\nResonantly directed di\u000eusion was observed in numerical simulations\u0003\nThe work was supported by the Engineering and Physical Sciences Research\nCouncil \nUK\u000b under grants Nos\u0003 GR$L\u001a\u0006\u001f\u001b\u001e\f GR$L\u001a\u001f\u0016\u0012\u0016\f GR$L\u0011\u001e\u001e\u001b\u0013 and\nGR$L\u001f\u001f\u0013\u0016\b\f by INTAS under grants Nos\u0003 INTAS\u0002\u001f\u0016\u0002\u001a\u0011\u001a\u0013 and INTAS\u0002\u001f\u001b\u0002\u001a\u0013\u001b\u0012 and\nby the Royal Society of London\u0003\nREFERENCES\n\u0000\u0002 Benzi\u0003 R\u0002\u0003 Sutera\u0003 A\u0002\u0003 and Vulpiani\u0003 A\u0002\u0003 J\u0002 of Phys\u0002 A \u0000\u0002\u0003 L\u0004\u0005\u0006 \u0007\u0000\b\t\u0000\n\u0002\n\u000b\u0002 Longtin\u0003 A\u0002\u0003 Nuovo Cimento D \u0000\u0003\u0003 \t\u0006\u0005 \u0007\u0000\b\b\u0005\n\u0002\n\u0006\u0002 Larkin\u0003 A\u0002I\u0002 and Ovchinnikov\u0003 Yu\u0002N\u0002\u0003 J\u0002 Low Temp\u0002 Phys\u0002 \u0004\u0005\u0003 \u0006\u0000\f \u0007\u0000\b\t\r\n\u0002\n\u0004\u0002 Dykman\u0003 M\u0002I\u0002\u0003 Rabitz\u0003 H\u0002\u0003 Smelyanskiy\u0003 V\u0002N\u0002\u0003 and Vugmeister\u0003 B\u0002E\u0002\u0003 Phys\u0002 Rev\u0002\nLett\u0002 \u0003\u0006\u0003 \u0000\u0000\f\t \u0007\u0000\b\b\f\n\u0002\n\u0005\u0002 Smelyanskiy\u0003 V\u0002N\u0002\u0003 Dykman\u0003 M\u0002I\u0002\u0003 Rabitz\u0003 H\u0002\u0003 and Vugmeister\u0003 B\u0002E\u0002\u0003 Phys\u0002 Rev\u0002\nLett\u0002 \u0003\u0006\u0003 \u0006\u0000\u0000\u0006 \u0007\u0000\b\b\f\n\u0002\n\r\u0002 Onsager\u0003 L\u0002\u0003 and Machlup\u0003 S\u0002\u0003 Phys\u0002 Rev\u0002 \u0006\u0000\u0003 \u0000\u0005\u000e\u0005 \u0007\u0000\b\u0005\u0006\n\u0002\n\f\u0002 Luchinsky\u0003 D\u0002G\u0002\u0003 Mannella\u0003 R\u0002\u0003 McClintock\u0003 P\u0002V\u0002E\u0002\u0003 Dykman\u0003 M\u0002I\u0002\u0003 and Smelyanskiy\u0003\nV\u0002N\u0002\u0003 J\u0002 Phys\u0002 A\u0003 Math\u0002 Gen\u0002 \u0005\u0007\u0003 L\u0006\u000b\u0000 \u0007\u0000\b\b\b\n\u0002\n\t\u0002 Luchinsky\u0003 D\u0002G\u0002\u0003 McClintock\u0003 P\u0002V\u0002E\u0002\u0003 and Dykman\u0003 M\u0002I\u0002 Rep\u0002 Prog\u0002 Phys\u0002 \u0004\u0000\u0003 \t\t\b\n\u0007\u0000\b\b\t\n\u0002\n\b\u0002 Mannella\u0003 R\u0002 in Supercomputation in Nonlinear and Disordered Systems\u0003 eds\u0002\nV\u000fazquez\u0003 L\u0002\u0003 Tirando\u0003 F\u0002 and Martin\u0003 I\u0002 \u0007Singapore\u0010 World Scienti\u0011c\n pp \u0000\u000e\u000e\u0012\u0000\u0006\u000e\u0003\n\u0000\b\b\f\u0002\n\u0000\u000e\u0002 Haken\u0003 H\u0002\u0003 Rev\u0002 Mod\u0002 Phys\u0002 \u0002\u0003\u0003 \r\f \u0007\u0000\b\f\u0005\n\u0002\n\u0000\u0000\u0002 Smelyanskiy\u0003 V\u0002N\u0002\u0003 Dykman\u0003 M\u0002I\u0002\u0003 and Golding\u0003 B\u0002 Phys\u0002 Rev\u0002 Lett\u0002 \b\u0007\u0003 \u0006\u0000\b\u0006 \u0007\u0000\b\b\b\n\u0002\n\u0000\u000b\u0002 Mannella\u0003 R\u0002\u0003 Soskin\u0003 S\u0002M\u0002\u0003 and McClintock\u0003 P\u0002V\u0002E\u0002\u0003 Int\u0002 J\u0002 of Bifurcation and Chaos\n\b\u0003 \f\u000e\u0000 \u0007\u0000\b\b\t\n\u0002\n"}