{"doi":"10.1186\/1471-2148-9-7","coreId":"65592","oai":"oai:dro.dur.ac.uk.OAI2:5301","identifiers":["oai:dro.dur.ac.uk.OAI2:5301","10.1186\/1471-2148-9-7"],"title":"Parasite resistance and the adaptive significance of sleep.","authors":["Preston , Brian T.","Capellini, I.","McNamara, P.","Barton, R. A.","Nunn , Charles L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"Sleep is a biological enigma. Despite occupying much of an animal's life, and having been scrutinized by numerous experimental studies, there is still no consensus on its function. Similarly, no hypothesis has yet explained why species have evolved such marked variation in their sleep requirements (from 3 to 20 hours a day in mammals). One intriguing but untested idea is that sleep has evolved by playing an important role in protecting animals from parasitic infection. This theory stems, in part, from clinical observations of intimate physiological links between sleep and the immune system. Here, we test this hypothesis by conducting comparative analyses of mammalian sleep, immune system parameters, and parasitism","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65592.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5301\/1\/5301.pdf","pdfHashValue":"03cf05757fc5462edc374994f78c07a11e2a5b0d","publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5301<\/identifier><datestamp>\n      2012-05-31T14:12:42Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Parasite resistance and the adaptive significance of sleep.<\/dc:title><dc:creator>\n        Preston , Brian T.<\/dc:creator><dc:creator>\n        Capellini, I.<\/dc:creator><dc:creator>\n        McNamara, P.<\/dc:creator><dc:creator>\n        Barton, R. A.<\/dc:creator><dc:creator>\n        Nunn , Charles L.<\/dc:creator><dc:description>\n        Sleep is a biological enigma. Despite occupying much of an animal's life, and having been scrutinized by numerous experimental studies, there is still no consensus on its function. Similarly, no hypothesis has yet explained why species have evolved such marked variation in their sleep requirements (from 3 to 20 hours a day in mammals). One intriguing but untested idea is that sleep has evolved by playing an important role in protecting animals from parasitic infection. This theory stems, in part, from clinical observations of intimate physiological links between sleep and the immune system. Here, we test this hypothesis by conducting comparative analyses of mammalian sleep, immune system parameters, and parasitism.<\/dc:description><dc:publisher>\n        BioMed Central<\/dc:publisher><dc:source>\n        BMC evolutionary biology, 2009, Vol.9(7) [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5301<\/dc:identifier><dc:identifier>\n        issn:1471-2148<\/dc:identifier><dc:identifier>\n        doi:10.1186\/1471-2148-9-7<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5301\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1186\/1471-2148-9-7<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5301\/1\/5301.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1471-2148","1471-2148"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n08 April 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPreston, , Brian T. and Capellini, I. and McNamara, P. and Barton, R. A. and Nunn, , Charles L. (2009)\n’Parasite resistance and the adaptive significance of sleep.’, BMC evolutionary biology., 9 (7).\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1186\/1471-2148-9-7\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n02 February 2009\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPreston, Brian, T. and Capellini, I. and McNamara, P. and Barton, R. A. and Nunn, Charles, L. (2009) 'Parasite\nresistance and the adaptive significance of sleep.', BMC evolutionary biology., 9 (7),\nFurther information on publishers website:\nhttp:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nBioMed Central\nPage 1 of 9\n(page number not for citation purposes)\nBMC Evolutionary Biology\nOpen AccessResearch article\nParasite resistance and the adaptive significance of sleep\nBrian T Preston*1, Isabella Capellini2, Patrick McNamara3, Robert A Barton2 \nand Charles L Nunn1,4\nAddress: 1Max Planck Institute for Evolutionary Anthropology, Deutscher Platz 6, 04103, Leipzig, Germany, 2Evolutionary Anthropology Research \nGroup, Department of Anthropology, Durham University, DH1 3HN, UK, 3Department of Neurology, Boston VA Medical Centre and Boston \nUniversity School of Medicine, Boston, MA 02130, USA and 4Department of Integrative Biology, University of California, Berkeley, CA 94720, USA\nEmail: Brian T Preston* - brian.preston@eva.mpg.de; Isabella Capellini - isabella.capellini@durham.ac.uk; \nPatrick McNamara - mcnamar@bu.edu; Robert A Barton - r.a.barton@durham.ac.uk; Charles L Nunn - nunn@eva.mpg.de\n* Corresponding author    \nAbstract\nBackground: Sleep is a biological enigma. Despite occupying much of an animal's life, and having\nbeen scrutinized by numerous experimental studies, there is still no consensus on its function.\nSimilarly, no hypothesis has yet explained why species have evolved such marked variation in their\nsleep requirements (from 3 to 20 hours a day in mammals). One intriguing but untested idea is that\nsleep has evolved by playing an important role in protecting animals from parasitic infection. This\ntheory stems, in part, from clinical observations of intimate physiological links between sleep and\nthe immune system. Here, we test this hypothesis by conducting comparative analyses of\nmammalian sleep, immune system parameters, and parasitism.\nResults: We found that evolutionary increases in mammalian sleep durations are strongly\nassociated with an enhancement of immune defences as measured by the number of immune cells\ncirculating in peripheral blood. This appeared to be a generalized relationship that could be\nindependently detected in 4 of the 5 immune cell types and in both of the main sleep phases.\nImportantly, no comparable relationships occur in related physiological systems that do not serve\nan immune function. Consistent with an influence of sleep on immune investment, mammalian\nspecies that sleep for longer periods also had substantially reduced levels of parasitic infection.\nConclusion: These relationships suggest that parasite resistance has played an important role in\nthe evolution of mammalian sleep. Species that have evolved longer sleep durations appear to be\nable to increase investment in their immune systems and be better protected from parasites. These\nresults are neither predicted nor explained by conventional theories of sleep evolution, and suggest\nthat sleep has a much wider role in disease resistance than is currently appreciated.\nBackground\nAll mammals studied exhibit some form of sleep, yet the\nadaptive value of sleeping remains obscure [1]. When\nviewed from this evolutionary perspective, the time spent\nin this state of reduced environmental awareness and\nbehavioural quiescence is likely to be costly in terms of\npredation risk [2-4], competition for resources [2,4,5],\nand reproductive opportunities [6]. To outweigh these\ncosts, the benefits of sleep must be substantial.\nPublished: 9 January 2009\nBMC Evolutionary Biology 2009, 9:7 doi:10.1186\/1471-2148-9-7\nReceived: 11 July 2008\nAccepted: 9 January 2009\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\n© 2009 Preston et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 2 of 9\n(page number not for citation purposes)\nA wide range of hypotheses have been proposed to\nexplain why this seemingly vulnerable and unproductive\nstate has evolved, including suggestions that sleep con-\nserves energy when alternative activities would bring little\nadvantage [7], is required for the consolidation of memo-\nries and learning [8], or plays a role in brain development\nor repair [9,10]. However, phylogenetically controlled\nanalyses investigating the evolution of mammalian sleep\ndurations have produced mixed support for these expla-\nnations [3-5], leaving the evolutionary significance of\nmammalian sleep a mystery.\nA further idea that has yet to be tested is that sleep evolved\nthrough the need to augment immune defences and pro-\ntect against disease [11-13]. It is increasingly recognized\nthat the immune system is energetically costly, as evi-\ndenced by its impairment under conditions of nutritional\nstress and when resources are diverted to increased growth\nor reproductive activity [14]. Since sleep is an enforced\nperiod of inactivity and physiological down-regulation,\nenergy that will otherwise be expended during waking\nactivity would be available to meet the demands of the\nimmune system [7,13,15].\nThis immune theory of sleep is supported by clinical stud-\nies that provide evidence of an intimate physiological link\nbetween sleep and the immune system. For example,\nmammals spend more time asleep, and particularly in\nnon-rapid eye movement (NREM) sleep, when infected\nwith a range of parasitic agents (e.g. influenza [16],\nEscherichia coli [13], and Candida albicans [13]). Immu-\nnomodulatory cytokines – the signalling molecules of the\nimmune system – play a role in both the normal regula-\ntion of sleep and its modulation during an immune\nresponse [17]. Direct evidence of a role for sleep in immu-\nnocompetence is provided by studies showing that rabbits\nthat sleep more following infection have an increased\nchance of recovery [18], and rats that are totally sleep\ndeprived die with a systemic invasion of bacteria [12].\nFinally, the human antibody responses to vaccination can\nbe halved when subjects are deprived of sleep either\nbefore or after vaccination [19,20]. While the numerous\nother physiological changes accompanying sleep depriva-\ntion or infection make it impossible to isolate sleep per se\nas a causal factor in experiments [17,21-23], when taken\ntogether these studies highlight the potential importance\nof disease resistance in the evolution of sleep.\nHere, we assess the evolutionary relationship between\nsleep and immunocompetence across a wide range of\nmammalian species by examining the extensive variation\nin sleep times (between 3 and 20 hours a day [1]; Figure\n1), investment in immune defences, and parasitic infec-\ntions.\nResults and Discussion\nWe first assessed the influence of sleep on the immune\nsystem. To do so we extracted data on sleeping times for\ndifferent mammalian species from the published litera-\nture and matched these data where possible with white\nblood cell counts reported by the International Species\nInformation System (ISIS [24]; [see Additional File 1]).\nWe use white blood cells as a proxy for immune system\ninvestment as they are central to all immune responses\nand are a measure of immunocompetence [25,26]. White\nblood cells originate in bone marrow and are derived\nfrom the same hematopoietic stem cells that produce red\nblood cells and platelets [25]. As these latter cells have no\ndirect immunological function, we use them as natural\ncontrols to test the specificity of any relationship between\nsleep and the immune system. If a key selective advantage\nof sleep is that it allows greater investment in the immune\nsystem, then species that sleep for longer should have\nincreased numbers of immune cells in circulation, but\nthere should be no similar relationship with control cells.\nAfter matching species values from each database we were\nable to analyze data for 26 mammalian species while con-\ntrolling for confounding factors (body size and activity\nperiod; see the Methods for details).\nAs expected if sleep enhances immune defences, species\nthat engaged in more sleep had higher numbers of white\nblood cells circulating in peripheral blood (coefficient =\n0.00976, s.e. = 0.00171, t22 = 5.71, P < 0.001; Figure 2a).\nAcross our dataset, a 14 hour increase in sleeping times\ncorresponded to an additional 30 million white blood\ncells in each millilitre of blood (a 615% increase). Cru-\ncially, no similar patterns were evident with either red\nblood cells or platelets (red blood cells: coefficient = -\n0.028, s.e. = 0.113, t24 = -0.24, P > 0.8, platelets: coefficient\n= -0.00602, s.e. = 0.00576, t21 = -1.04, P > 0.3).\nWe also tested predictions using phylogenetically inde-\npendent contrasts to account for the lack of statistical\nindependence in species data [27]. These analyses exam-\nine evolutionary change and showed that when lineages\nevolved longer sleep durations, they also increased their\nwhite blood cell counts (coefficient = 0.0153, s.e. =\n0.00250, t23 = 6.11, P < 0.001). Again, this relationship\nwas specific to immune cells (for red blood cells: coeffi-\ncient = -0.200, s.e. = 0.0123, t23 = -1.63, P > 0.11, for plate-\nlets: coefficient = -0.00463, s.e. = 0.00628, t21 = -0.74, P >\n0.45), leading to an increase in the ratio of immune cells\nto other blood cell types when species evolved longer\nsleeping durations (coefficient = 0.0639, s.e. = 0.0108, t20\n= 5.93, P < 0.001).\nTotal white blood cell counts are a compound measure of\nthe abundance of different cell types, each of which fulfils\nspecialized immunological roles [25]. We therefore also\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 3 of 9\n(page number not for citation purposes)\ninvestigated whether the correlated evolution of sleep and\nwhite blood cell counts was limited to specific cell types.\nNeutrophils constitute the largest component of the\ninnate immune system, representing 47% of white blood\ncells in our sample, and are seen as a first line of defence\nthat responds rapidly upon detection of invading patho-\ngens [25]. Analysis of independent contrasts indicated\nthat higher numbers of neutrophils in the bloodstream\nhave evolved in association with elevated sleep durations\n(bootstrapped coefficient = 0.0948, s.e. = 0.0223, n = 25,\nVariation in mammalian sleepFigure 1\nVariation in mammalian sleep. (a) Mammals exhibit striking differences in both their daily sleep durations and the amount \nof time they spend in each of the main sleep phases. Each bar denotes a species specific sleeping time, and the shaded portions \nshow the time devoted to NREM sleep (dark blue) and REM sleep (light blue). (b) The phylogenetic relationship between the \nspecies in our dataset. This composite tree was assembled from recently published sources [66-70]. The phylogeny was used \nto generate independent contrasts [59], and was restricted to the species present in immune investment and infection status \nanalyses. The available data on sleep durations could not always be matched to both haematological and parasite data, thus, \nsome species were only represented in one of the analyses. (c) A selection of species within the dataset, showing the wide-\nrange of sleep durations that have been recorded. Photo credits: B. T. Preston, The Max Planck Institute of Evolutionary \nAnthropology & Arco Images.\nB\no\ns\n t\na\nu\nru\ns\nO\nv\nis\n a\nri\ne\ns\nE\nq\nu\nu\ns\n c\na\nb\na\nllu\ns\nA\nrc\nto\nc\ne\np\nh\na\nlu\ns\n p\nu\ns\nill\nu\ns\nC\na\nllo\nrh\nin\nu\ns\n u\nrs\nin\nu\ns\nC\na\nn\nis\n f\na\nm\nili\na\nri\ns\nV\nu\nlp\ne\ns\n v\nu\nlp\ne\ns\nP\na\nn\nth\ne\nra\n o\nn\nc\na\nF\ne\nlis\n c\na\ntu\ns E\nri\nn\na\nc\ne\nu\ns\n e\nu\nro\np\na\ne\nu\ns\nR\na\ntt\nu\ns\n n\no\nrv\ne\ng\nic\nu\ns\nO\nc\nto\nd\no\nn\n d\ne\ng\nu\ns\nC\nh\nin\nc\nh\nill\na\n l\na\nn\nig\ne\nra\nC\na\nv\nia\n p\no\nrc\ne\nllu\ns\nO\nry\nc\nto\nla\ng\nu\ns\n c\nu\nn\nic\nu\nlu\ns\nP\ne\ntt\ne\nru\ns\n m\no\nn\ng\no\nz\nP\ne\ntt\ne\nru\ns\n m\na\nc\na\nc\no\nS\na\ng\nu\nin\nu\ns\n o\ne\nd\nip\nu\ns\nS\na\nim\nir\ni \ns\nc\niu\nre\nu\ns\nA\no\ntu\ns\n t\nri\nv\nir\ng\na\ntu\ns\nM\na\nc\na\nc\na\n r\na\nd\nia\nta\nM\na\nc\na\nc\na\n m\nu\nla\ntt\na\nP\na\np\nio\n a\nn\nu\nb\nis\nP\na\np\nio\n p\na\np\nio\nP\na\np\nio\n h\na\nm\na\nd\nry\na\ns\nT\nh\ne\nro\np\nit\nh\ne\nc\nu\ns\n g\ne\nla\nd\na\nC\ne\nrc\no\np\nit\nh\ne\nc\nu\ns\n a\ne\nth\nio\np\ns\nP\na\nn\n t\nro\ng\nlo\nd\ny\nte\ns C\nh\no\nlo\ne\np\nu\ns\n h\no\nff\nm\na\nn\nn\ni\nE\nle\np\nh\na\ns\n m\na\nx\nim\nu\ns\nO\nrn\nit\nh\no\nrh\ny\nn\nc\nh\nu\ns\n a\nn\na\nti\nn\nu\ns\nDa\nily\n sl\nee\np \ndu\nra\ntio\nn \n(hr\ns)\n0\n5\n10\n15\n20\nNREM Sleep\nREM Sleep\nSleep quotas not known\nDaily sleep duration (hrs)\n3.8 6.8 9.7 11.9 14.2 17.6\nsheep Guinea pig Chimpanzee Mongoose lemur\nDuck-\nbilled platypus Hedgehog\nA)\nB)\nC)\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 4 of 9\n(page number not for citation purposes)\nP < 0.001). Lymphocytes, which account for 44% of the\nwhite cell count in our sample and are mediators of the\nacquired immune response [25], were also present in\ngreater numbers when evolutionary increases in sleeping\ndurations occurred (bootstrapped coefficient = 0.0103,\ns.e. = 0.00385, n = 25, P = 0.004). Finally, eosinophils and\nbasophils, which are relatively minor components of the\nwhite blood cell count (5% and 1%, respectively) and act\nprimarily against macroparasites [25], showed the pre-\ndicted association with sleep (eosinophils: bootstrapped\ncoefficient = 0.0246, s.e. = 0.0125, n = 25, P < 0.035;\nbasophils: coefficient = 0.0676, s.e. = 0.0198, t24 = 3.42,\nP = 0.002). Only monocytes, accounting for 5% of the\ntotal white cell count [25], failed to show a significant\nassociation with sleep durations (bootstrapped coefficient\n= 0.0478, s.e. = 0.0323, n = 25, P > 0.14). Thus, evolution-\nary increases in the abundance of four of the five immune\ncell types have occurred in association with longer sleep\ntimes, suggesting that increased sleep may allow a gener-\nalized heightening of immune defences.\nNext, we addressed hypotheses regarding the role of the\ntwo main sleep stages (NREM and REM) in immune sys-\ntem investment. In clinical studies, increased duration\nand intensity of NREM sleep during illness are associated\nwith an improved prognosis, but occur at the expense of\nREM sleep [11,13,18]. From this, it is argued that immu-\nnological benefits of sleep occur while brain function is\ndown-regulated during the NREM phase [11,22]. Our\nresults did not support this suggestion, however, as we\nfound that evolutionary increases in both NREM and REM\nsleep occur in parallel with elevated white blood cell\ncounts (NREM: coefficient = 0.0853, s.e. = 0.0249, t17 =\n3.42; P = 0.003; REM: bootstrapped coefficient = 0.0633,\ns.e. = 0.0112, n = 19, P < 0.001). Thus, evolutionary\nincreases in sleep are associated with increased investment\nin the immune system regardless of its specific form.\nFinally, we assessed whether a role for sleep in enhancing\nimmune defences could translate into improved resist-\nance against parasitic infections. We were able to match\nsleep times with parasitism for 12 mammalian species\nfrom the Global Mammal Parasite Database [28], which\ndetails the diversity and prevalence of microparasites\n(viruses, bacteria and fungi) and macroparasites\n(helminths, protozoa and arthropods) that infect wild\npopulations of mammals [see Additional File 1]. If sleep\nis effective in protecting against infection, then species\nthat engage in more sleep should have fewer parasites\n(measured as a combination of species richness and prev-\nalence, see Methods). After correcting for differences aris-\ning from sampling effort [29-31], we found this predicted\nrelationship (coefficient = -3.554, s.e. = 0.888, t10 = -4.00,\nP = 0.003; Figure 2b). This analysis suggests that across the\n10 hour range of sleep durations present in the dataset\nthere is a 24-fold decline in levels of parasitism. A signifi-\ncant negative relationship was also evident in analyses of\nindependent contrasts (bootstrapped coefficient = -3.48,\ns.e. = 1.51, n = 11, P = 0.006). Thus, as species evolved\nSleep, immune defences and parasitismFigure 2\nSleep, immune defences and parasitism. Interspecific \nevidence that sleep protects against parasitic infection. (a) \nThe number of white blood cells in peripheral blood \nincreases among species with longer sleep durations. The fit-\nted line is derived from a multiple regression and controls for \na significant influence of body mass and activity period. (b) \nSpecies that sleep for longer are infected by fewer parasites. \nRelative infection status takes account of both the number \nand prevalence of different parasites infecting host species \nand corrects for differences in sampling effort [29-31].\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 5 of 9\n(page number not for citation purposes)\nlonger sleep durations and enhanced their immune sys-\ntems, they become less parasitized.\nOur results are consistent with parasite resistance having\nplayed an important role in the evolution of sleep, and\nsuggest therefore that sleep is of greater immunological\nsignificance than is currently recognized. It had been\nnoted that the physiological links between sleep and\nimmunity that have been highlighted by experimental\nstudies (e.g. in rats [12]) could arise from a negative\nimpact of sleep deprivation on the brain, leading to an\nimpaired coordination of immune system activity\n[11,17]. However, our findings reveal strong relationships\nbetween sleep and immune defences in the absence of\nsleep deprivation, and thus point to a more direct consti-\ntutive role for sleep in promoting immunocompetence.\nWe suggest that sleep fuels the immune system. While\nawake, animals must be ready to meet multiple demands\non a limited energy supply, including the need to search\nfor food, acquire mates, and provide parental care. When\nasleep, animals largely avoid these energetic costs, and can\nthus allocate resources to the immune system (sensu\n[13,15]). Unlike the energy conservation hypothesis of\nsleep [7], this reallocation hypothesis predicts little or no\noverall energy savings during sleep. This appears to be\ntrue: in humans, for example, energy savings from eight\nhours of sleep would be expended within one hour of\nwaking (63 kilocalories [32]). Direct estimates of the ener-\ngetic cost of maintaining immunity are not currently\navailable. However, numerous studies have suggested that\nthese costs are large enough to generate trade-offs with key\nlife history traits, such as growth and reproduction (e.g.\n[33,34]). Increased energy requirements when the\nimmune system is upregulated also point toward a sub-\nstantial metabolic cost associated with immune defence.\nEven during mild antigenic challenge, basal metabolic\nrate can be increased by as much as 15 to 30% [14,35-37].\nThus, a generalised elevation of immune defences may\ncome at considerable energetic cost.\nThe energetic costs of immune system maintenance and\nroutine functioning take multiple forms (see [14]). These\ninclude the relatively short lifespan and so high turnover\nrate of granulocytes (every 2 to 3 days [25]), the cost of\nsustaining the hypermetabolic rate of immune cells [38],\nand repairing the immunopathological damage that\nresults when cytotoxic compounds are released by\nimmune cells responding to antigens [39]. Thus, an influ-\nence of sleep need not be confined to investing in greater\nnumbers of immune cells. Indeed, both antibody\nresponses and natural killer cell activity are reduced fol-\nlowing sleep deprivation [19,40], showing that sleep\ncould have a far broader influence on immunocompe-\ntence.\nOur results and interpretation are consistent with experi-\nmental studies showing that animals sleep for extended\nperiods when mounting an immune response [13,16]. If\nevolved increases in sleep allow animals to channel more\nenergy into their immune defences and so protect against\nthe development of acute infections, then short term\nincreases in sleep may help provide the additional energy\nrequired for an acute phase response to an already estab-\nlished infection [13-15]. The possibility also exists that\nevolutionary and facultative changes in sleep share a com-\nmon underlying mechanism. Short term increases in sleep\nappear to be triggered by immunomodulatory cytokines\nthat are released by white blood cells during immune\nreactions [17]. If larger numbers of white blood cells pro-\nduce a greater immune response to antigenic challenge,\nand hence a greater release of sleep promoting cytokines,\nthis could potentially drive evolutionary increases in sleep\ndurations.\nOur finding that both sleep phases are associated with\nimmune investment appears to be in conflict with obser-\nvations that REM sleep is reduced during acute infection\n(e.g. [13]). It should be noted, however, that the advan-\ntage gained through evolutionary increases in normal\nsleep can also differ from the selective advantage of mod-\nulating sleep phases during the course of an infection. For\nexample, REM sleep is partly characterized by a loss of\nthermoregulation [41], and thus it is argued that REM\nsleep is inhibited during an acute phases response to\ninfection as it would prevent animals from maintaining\nan elevated body temperature that impedes further micro-\nbial proliferation [42]. While this explanation is plausible,\nit cannot be applied to evolutionary changes in normal\nREM sleep durations and immune investment, which\noccur in the absence of an acute phase response. As data\nbecome available on sleep architecture during the acute\nphase response of different species, comparative studies\nmay be able to assess the benefits of REM sleep suppres-\nsion directly. Similarly, analysis of the increased intensity\nof sleep that occurs during infection, as identified through\nan elevation in slow wave activity [22], could reveal an\nadditional role of the 'quality' of sleep.\nIt is commonly suggested that sleep may serve multiple\nfunctions (e.g. [1]). While our analyses yielded no evi-\ndence that sleep influenced cell production in the other\nphysiological systems we assessed, they do not eliminate\nthe possibility that sleep could have an additional func-\ntion(s) elsewhere in the body. In particular, it has been\nargued that sleep is 'primarily for the brain' [43], which is\na view that has both intuitive merit and considerable\nexperimental support (see review [44]). However, from an\nevolutionary perspective, phylogenetically controlled\nanalyses have yet to produce support for a key expectation\nof this hypothesis, namely that species with greater cogni-\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 6 of 9\n(page number not for citation purposes)\ntive abilities should require more sleep. At best, a recent\nstudy has suggested that REM sleep durations may\nincrease with the brain size of mammals ([3] but see [4]).\nSince REM sleep usually accounts for less than 20% of\ntotal sleep durations [our dataset; see Additional File 1],\nthese comparative findings cannot explain why different\nmammalian species sleep for as long as they do. Instead,\nit may be that sleep quality is of greater importance to\nbrain function than the overall duration of sleep per se,\nwhich is a possibility that could be assessed when suffi-\ncient data have accumulated. In the absence of these data,\nthe presence of characteristic patterns of brain activity in\nmammals during NREM and REM sleep, alongside the\ncognitive 'black-out' that is experienced while sleeping,\nimply that it does perform some important function for\nthe brain. The nature of this function remains hotly\ndebated [1]\nAn important implication of our findings is that ecologi-\ncal factors that impact sleep could indirectly affect\nimmune defences. By sleeping regularly in 'safe' sites such\nas burrows or dens, for example, individuals may be better\nprotected from predators, and thus able to sleep for longer\ndurations [2-4,45]. Conversely, herbivorous species with\nlarge foraging requirements could have less time available\nfor sleep than species living on an energy-rich carnivorous\ndiet [2,4,5]. Trade-offs between time invested in sleep and\nalternative activities may occur at key life history stages,\nsuch as during periods of reproductive competition [6] or\nparental care [46]. Current evidence links these activities\nto reduced immunocompetence [47], which could be due\nto reductions in the time available for sleep. However,\nfield studies should also ascertain the relationship\nbetween sleeping behaviour and an animal's exposure to\nparasites, which could reveal important ecological rela-\ntionships between sleep and parasitic infection that have\nthe potential to influence the analyses we report here [48].\nConclusion\nOur results suggest mammalian species that spend more\ntime asleep are able to increase investment in their\nimmune systems, and thus are better protected from par-\nasitic infection. These comparative findings are broadly\nconsistent with experimental evidence showing close\nphysiological links between sleep and the immune sys-\ntem, and point towards a major role for disease resistance\nin the evolution of mammalian sleep. Given the declines\nin human sleep durations that have occurred in recent\ndecades [49], there is a clear need for studies that further\nclarify the immunological significance of sleep. In partic-\nular, studies using artificial selection regimes would allow\nthe evolutionary relationship between immunocompe-\ntence and sleep to be quantified under controlled experi-\nmental conditions, and without potential confounds that\nare associated with sleep-deprivation studies [50] and the\ncorrelational analyses we present here. Similarly, further\nstudies assessing the selective advantages of modulating\nsleep durations and its sub-phases during infection are\nclearly warranted. There is also a need to further uncover\nthe physiological mechanisms underpinning the influ-\nence of sleep on the immune system, to examine how eco-\nlogical factors might constrain sleeping durations, and to\ninvestigate whether sleep deficits increase susceptibility to\ndisease at key stages of an animal's life history.\nMethods\nData collection\nSpecies specific sleep times were compiled from an\nexhaustive search of the published literature [see Addi-\ntional File 1 for details]. Data were screened for quality\nand included in analyses if the study animals were sexu-\nally mature (according to reference [51]), and the study\nwas designed to capture the entire sleeping period. This\ngenerally entailed observation periods of at least 24 hours,\nthough overnight observations on monophasic diurnal\nprimate species (lasting 12 to 14 hours) were included in\nfive cases. Where multiple estimates of sleep durations\nwere available for a given species, we calculated an average\nvalue for use in analyses.\nFor marine mammals, estimates were for animals sleeping\non land and, following others (e.g. [10]), unihemispheric\nsleep times for the left and right sides of the brain were\ncombined by averaging them. As the energetic cost of\nmaintaining half of the brain in a waking state is unclear,\nwe also tested alternative methods for the calculation of\nunihemispheric sleeping times (combining or excluding\ntime spent in unihemispheric sleep), but this did not pro-\nduce qualitative differences in our results (unpublished\nanalyses).\nWe use behavioural studies of sleep in our analyses of\ntotal sleep durations (n = 7), but restrict our analyses of\nNREM and REM sleep durations with haematological\nparameters to studies that utilized electroencephalo-\ngraphic (EEG) recordings of sleep [see Additional File 2\nfor an analysis of parasite counts and sleep that has been\nsimilarly restricted to studies that used EEG measurement\nof sleep durations]. The duck billed platypus (Ornitho-\nrhynchus anatinus) was excluded from analyses of NREM\nand REM sleep, as the validity of REM sleep times for this\nspecies has been questioned [52].\nThe across-study repeatability of sleeping time estimates\nusing these criteria was high (0.82, F15,24 = 12.67, [53];\ndata are from a larger sleep dataset [see Additional File\n1]), indicating that studies using our data selection criteria\nrecorded very similar sleep durations for a given species.\nThus, further restriction of the dataset (e.g. to EEG only\ndata [3,4]) would appear unnecessary for comparative\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 7 of 9\n(page number not for citation purposes)\nanalyses, as any remaining measurement error is small rel-\native to the wide variation in sleep durations between dif-\nferent species. Overall, this dataset compares favourably\nwith studies that have utilized all available sleep data (r =\n0.42), and a previous analysis of ours that had used alter-\nnate restrictions to control data quality (r = 0.71 [4]).\nThere remains a possibility that data on captive animals\nrepresent overestimates of sleeping times in the wild, as in\na more natural setting animals would seem likely to expe-\nrience ecological constraints on the time available for\nsleep (e.g. predator avoidance [3]). While behavioural\nstudies on shrews (Sorex araneus) that compared sleep\ntimes in the wild and in the laboratory recorded similar\nsleep durations [54], a more recent EEG based study on\nthe sloth (Bradypus tridactylus) suggested that this species\nmay sleep less in the wild than had been recorded in the\nlaboratory [55,56]. However, this comparison included\nlaboratory estimates from juvenile animals that are\nknown to sleep for longer durations, and is therefore\nquestionable [55-57]. More generally, the occurrence of\n'sleep rebounds' in a laboratory setting, in which animals\nsleep more following a period of sleep deprivation, sug-\ngest that the sleeping times that have been recorded are\nhomeostatically regulated and therefore representative of\nan animal's daily sleep requirement [58].\nHaematological data were extracted from the physiologi-\ncal reference values reported by ISIS [24], and are from\nzoo animals that are judged to be in normal health. These\nreference values are designed to be used in a diagnostic\ncapacity by veterinary professionals, and are screened for\nanomalous data. On average, these data have arisen from\nblood samples derived from 20 different zoological insti-\ntutions (range: 1 to 52), with 76 animals contributing to\nthe reference value (range: 4 to 289). Insufficient data\nwere available in some species to separate cell counts by\nage or sex; however, repeatability between sex and age\ngroups were high (for the white blood cell counts of spe-\ncies present in analyses: 0.88, F15,16 = 16.51, and 0.7, F15,29\n= 7.76, respectively [53]). Thus, we included averaged val-\nues in analyses from animals of mixed sex and age class.\nData on parasitism were extracted from the Global Mam-\nmal Parasite Database [28]. This database summarizes\nstudies that describe patterns of parasite occurrence in\nwild populations and includes both macro- and micro-\nparasites. The data were restricted to studies that provided\nmeasures of prevalence. Relative infection status was cal-\nculated as the number of parasite species found in species\nmultiplied by the (mean) percentage of animals infected.\nBy taking account of the prevalence of parasite species,\nthis measure avoids giving undue weight to parasites that\nrarely infect a particular host species successfully.\nData analysis\nPhylogenetically independent contrasts were calculated\nusing the CRUNCH algorithm in the CAIC computer pro-\ngram [59], with branch lengths set to be equal. The\nassumptions of independent contrasts were best met with\na combination of natural logarithm, square root, and\nreciprocal square root transformations [see Additional\nFile 1 for specific details [60]]. Analyses were performed\nusing multiple or univariate regression, with the regres-\nsion line forced through the origin [59,60]. Bootstrap esti-\nmates are presented when there was evidence of variance\nheterogeneity or outlying data-points [61]. Regression\nanalyses were implemented in Genstat 8th edition and\ncontrolled for an influence of body mass, activity period,\nand sampling effort when appropriate (see next section).\nSignificance of variables is judged from the estimate of the\nregression coefficient in association with its standard\nerror; the P values presented are calculated from the t sta-\ntistic that is derived from these estimates and the sample\nsize of each analysis. For predictions and plots, activity\nperiod was set to be diurnal, while body mass and sam-\npling effort were held at average levels.\nStatistical control for body mass\nPrevious comparative studies have identified allometric\nscaling relationships in haematological parameters\n[62,63]. We found a similar influence of body mass in our\nanalyses of white blood cell counts using the raw data\n(coefficient = 0.0257, s.e. = 0.00564, t22 = 4.55, P < 0.001),\nwhite blood cell counts using phylogenetically independ-\nent contrasts (coefficient = 0.0177, s.e. = 0.005, t23 = 3.55,\nP = 0.002), and the relative abundance of white blood\ncells (coefficient = 0.228, s.e. = 0.053, t20 = 4.29, P <\n0.001). We also found a negative relationship between\nbody mass and red blood cell counts (contrast analysis,\ncoefficient = -1.793, s.e. = 0.566, t23 = -3.17, P = 0.004).\nFor white blood cell counts, these relationships appeared\nto be driven by the allometric scaling of neutrophils and\nmonocytes (bootstrapped estimates for: neutrophils, coef-\nficient = 0.1227, s.e. = 0.0503, P = 0.002; monocytes, coef-\nficient = 0.1099, s.e. = 0.0557, P < 0.05; for all other cell\ntypes P > 0.7). In each of these cases, the results we present\nare therefore derived from multiple regressions in which\nbody mass was included as an explanatory variable.\nStatistical control for activity period\nWhite blood cell counts exhibit cyclical diurnal variation\n[64,65] that is intimately linked to the sleep-wake cycle\n[64]. We therefore examined whether the different activity\nperiod of nocturnal species was reflected in their white\nblood cell counts. We found that nocturnal species had\nsignificantly reduced white blood cell counts (nocturnal-\nity: effect = -0.0300, s.e. = 0.0120, t22 = -2.50, P = 0.02),\nwhich appeared to be driven solely by changes in neu-\ntrophil numbers (for log transformed neutrophil counts:\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 8 of 9\n(page number not for citation purposes)\neffect = -0.544, s.e. = 0.159, t22 = -3.42, P = 0.002; in anal-\nyses of all other cell types activity period was not signifi-\ncant, P > 0.33). This effect of nocturnality on neutrophil\nnumbers and total white blood cell count was statistically\ncorrected prior to the generation of independent con-\ntrasts; effect sizes were obtained from the parameter esti-\nmates in the corresponding multiple regression and are\nlisted above. Analyses of white blood cells that did not\naccount for differences in activity periods produced qual-\nitatively similar results [see Additional File 2].\nStatistical control for sampling effort\nEstimates of the number of micro- and macroparasites\nthat infect host species are dependent upon the degree to\nwhich the host species has been studied [29-31]. Thus, we\nstatistically corrected our estimates of infection status\nprior to analysis by controlling for the highly significant\ninfluence of sampling effort (estimated by the number of\nstudies that described the parasites of each host; raw spe-\ncies data: coefficient = 1.43, s.e. = 0.284, t10 = 4.03, P =\n0.002; contrasts: coefficient = 1.275, s.e. = 0.286, t10 =\n4.45, P = 0.001). Citation number explained 58% and\n64% of the variance in species and contrast data on para-\nsitism, respectively.\nAdditional material\nAcknowledgements\nWe thank Erica Harris for helping to construct the dataset and Paul Harvey \nand Sheila Patek for comments on the manuscript. This research was sup-\nported by a grant number 1R01MH070415-01A1 from the National Insti-\ntutes of Health (to P.M., C.N. & R.B.), and by the Max Planck Society (to \nB.P. and C.N.).\nReferences\n1. Siegel JM: Clues to the functions of mammalian sleep.  Nature\n2005, 437(7063):1264-1271.\n2. Allison T, Cicchetti DV: Sleep in mammals – ecological and con-\nstitutional correlates.  Science 1976, 194(4266):732-734.\n3. Lesku JA, Roth TC, Amlaner CJ, Lima SL: A phylogenetic analysis\nof sleep architecture in mammals: The integration of anat-\nomy, physiology, and ecology.  Am Nat 2006, 168(4):441-453.\n4. Capellini I, Barton RA, McNamara P, Preston BT, Nunn CL: Phylo-\ngenetic analysis of the ecology and evolution of mammalian\nsleep.  Evolution 2008, 62(7):1764-1775.\n5. Elgar MA, Pagel MD, Harvey PH: Sleep in mammals.  Anim Behav\n1988, 36:1407-1419.\n6. Gauthier-Clerc M, Tamisier A, Cezilly F: Sleep-vigilance trade-off\nin green-winged teals (Anas crecca crecca).  Can J Zool 1998,\n76(12):2214-2218.\n7. Berger RJ, Phillips NH: Energy-conservation and sleep.  Behav\nBrain Res 1995, 69(1–2):65-73.\n8. Karni A, Tanne D, Rubenstein BS, Askenasy JJ, Sagi D: Dependence\non REM sleep of overnight improvement of a perceptual\nskill.  Science 1994, 265(5172):679-682.\n9. Roffwarg HP, Muzio JN, Dement WC: Ontogenetic development\nof the human sleep-dream cycle.  Science 1966,\n152(3722):604-619.\n10. Savage VM, West GB: A quantitative, theoretical framework\nfor understanding mammalian sleep.  P Natl Acad Sci USA 2007,\n104(3):1051-1056.\n11. Kreuger J, Walter J, Levin C: Factor S and related somnogens:\nAn immune theory for slow wave sleep.  In Brain Mechanisms of\nSleep Edited by: McGinty DJ, Drucker-Colin R, Morrison A, Parmeg-\ngiani PL. New York: Raven Press; 1985:253-276. \n12. Everson CA, Toth LA: Systemic bacterial invasion induced by\nsleep deprivation.  Am J Physiol Regul Integr Comp Physiol 2000,\n278(4):R905-R916.\n13. Toth LA, Krueger JM: Effects of microbial challenge on sleep in\nrabbits.  Faseb J 1989, 3(9):2062-2066.\n14. Lochmiller RL, Deerenberg C: Trade-offs in evolutionary immu-\nnology: just what is the cost of immunity?  Oikos 2000,\n88(1):87-98.\n15. Hart BL: Biological basis of the behavior of sick animals.  Neu-\nrosci Biobehav Rev 1988, 12(2):123-137.\n16. Fang J, Sanborn CK, Renegar KB, Majde JA, Krueger JM: Influenza\nviral infections enhance sleep in mice.  Proc Soc Exp Biol Med\n1995, 210(3):242-252.\n17. Opp MR: Cytokines and sleep.  Sleep Med Rev 2005, 9(5):355-364.\n18. Toth LA, Tolley EA, Krueger JM: Sleep as a prognostic indicator\nduring infectious-disease in rabbits.  Proc Soc Exp Biol Med 1993,\n203(2):179-192.\n19. Spiegel K, Sheridan JF, Van Cauter E: Effect of sleep deprivation\non response to immunizaton.  J A M A 2002, 288(12):1471-1472.\n20. Lange T, Perras B, Fehm HL, Born J: Sleep enhances the human\nantibody response to Hepatitis A vaccination.  Psychosom Med\n2003, 65(5):831-835.\n21. Bryant PA, Trinder J, Curtis N: Sick and tired: Does sleep have a\nvital role in the immune system?  Nat Rev Immunol 2004,\n4(6):457-467.\n22. Toth LA: Sleep, sleep-deprivation and infectious-disease –\nstudies in animals.  Adv Neuroimmunol 1995, 5(1):79-92.\n23. Krueger JM, Majde JA: Host defense.  In Principles and practice of\nsleep medicine 4th edition. Edited by: Kryger MH, Roth T, Dement\nWC. New York: Elesevier Saunders; 2005:256-265. \n24. ISIS: Minnesota Zoological Garden, Apple Valley, MN.  .\n25. Roitt IM, Brostoff J, Male DK: Immunology.  London: Gower Med-\nical Publishing; 1998. \n26. Luster MI, Portier C, Pait DG, Rosenthal GJ, Germolec DR, Corsini\nE, Blaylock BL, Pollock P, Kouchi Y, Craig W, et al.: Risk assessment\nin immunotoxicology. II. Relationships between immune and\nhost-resistance tests.  Fund Appl Toxicol 1993, 21(1):71-82.\n27. Felsenstein J: Phylogenies and the comparative method.  Am\nNat 1985, 125(1):1-15.\n28. Nunn CL, Altizer S: The global mammal parasite database: An\nonline resource for infectious disease records in wild pri-\nmates.  Evol Anthropol 2005, 14(1):1-2.\n29. Gregory RD: Parasites and host geographic range as illus-\ntrated by waterfowl.  Func Ecol 1990, 4:645-654.\n30. Nunn CL, Altizer S, Jones KE, W S: Comparative tests of parasite\nspecies richness in primates.  Am Nat 2003, 162:597-614.\n31. Lindenfors P, Nunn CL, Jones KE, Cunningham AA, Sechrest W, Git-\ntleman JL: Parasite species richness in carnivores: effects of\nhost body mass, latitude, geographic range and population\ndensity.  Global Ecol Biogeogr 2007, 16:496-509.\nAdditional file 1\nData on sleep, immunity and infection. Species specific values for the \ntime spent in sleep and its different states, the number of white blood cells \nin peripheral blood, and the degree of parasitism.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2148-9-7-S1.pdf]\nAdditional file 2\nStatistical analyses with alternate data restrictions. Alternate analyses \nin which the relationship between sleep and parasitism is restricted to EEG \nstudies, and in which the relationship between sleep and immune defence \ndoes not control for activity period.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2148-9-7-S2.pdf]\nPublish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\nBMC Evolutionary Biology 2009, 9:7 http:\/\/www.biomedcentral.com\/1471-2148\/9\/7\nPage 9 of 9\n(page number not for citation purposes)\n32. Ravussin E, Lillioja S, Anderson TE, Christin L, Bogardus C: Determi-\nnants of 24-hour energy expenditure in man. Methods and\nresults using a respiratory chamber.  J Clin Invest 1986,\n78(6):1568-1578.\n33. Juan José S, Liesbeth de N, Tomás P-C, Manuel S, Gabriele S: Trade-\noff between immunocompetence and growth in magpies: an\nexperimental study.  Proc R Soc Lond B 2003, 270(1512):241-248.\n34. Festa-Bianchet M: Individual differences, parasites, and the\ncosts of reproduction for nighorn ewes (Ovis canadensis).  J\nAnim Ecol 1989, 58(3):785-795.\n35. Demas GE, Chefer V, Talan MI, Nelson RJ: Metabolic costs of\nmounting an antigen-stimulated immune response in adult\nand aged C57BL\/6J mice.   Am J Physiol 1997, 273(5 Pt\n2):R1631-R1637.\n36. Svensson E, Raberg L, Koch C, Hasselquist D: Energetic stress,\nimmunosuppression and the costs of an antibody response.\nFunct Ecol 1998, 12(6):912-919.\n37. Cooper AL, Horan MA, Little RA, Rothwell NJ: Metabolic and\nfebrile responses to typhoid vaccine in humans – effect of\nbeta-adrenergic-blockade.  J Appl Physiol 1992, 72(6):2322-2328.\n38. Newsholme P, Newsholme EA: Rates of utilization of glucose,\nglutamine and oleate and formation of end-products by\nmouse peritoneal macrophages in culture.  Biochem J 1989,\n261(1):211-218.\n39. Graham AL, Allen JE, Read AF: Evolutionary causes and conse-\nquences of immunopathology.  Annu Rev Ecol Evol S 2005,\n36:373-397.\n40. Moldofsky H, Lue FA, Davidson JR, Gorczynski R: Effects of sleep-\ndeprivation on human immune functions.  Faseb J 1989,\n3(8):1972-1977.\n41. Parmeggiani P: Physiological regulation in sleep.  In Principles and\nPractice of Sleep Medicine 2nd edition. Edited by: Dement WC. Phila-\ndelphia: WB Saunders; 2000:169-178. \n42. Opp MR: Fever, body temperature, and levels of arousal.  In\nHandbook of behavioral state control: cellular and molecular mechanisms\nEdited by: Lydic R, Baghdoyan HA. Boca Raton: CRC Press;\n1999:623-640. \n43. Hobson JA: Sleep is of the brain, by the brain and for the brain.\nNature 2005, 437(7063):1254-1256.\n44. Stickgold R: Sleep-dependent memory consolidation.  Nature\n2005, 437(7063):1272-1278.\n45. Lima SL, Rattenborg NC, Lesku JA, Amlaner CJ: Sleeping under the\nrisk of predation.  Anim Behav 2005, 70:723-736.\n46. Lyamin O, Pryaslova J, Lance V, Siegel J: Animal behaviour: Con-\ntinuous activity in cetaceans after birth.  Nature 2005,\n435(7046):1177-1177.\n47. Sheldon BC, Verhulst S: Ecological immunology: Costly parasite\ndefences and trade-offs in evolutionary ecology.  Trends Ecol\nEvol 1996, 11(8):317-321.\n48. Nunn CL, Altizer SM: Infectious diseases in primates: Behavior,\necology and evolution.  Oxford: Oxford University Press; 2006. \n49. Jean-Louis G, Kripke DF, Ancoli-Israel S, Klauber MR, Sepulveda RS:\nSleep duration, illumination, and activity patterns in a popu-\nlation sample: effects of gender and ethnicity.  Biol Psychiatry\n2000, 47(10):921-927.\n50. Rial RV, Nicolau MC, Gamundi A, Akaarir M, Aparicio S, Garau C,\nTejada S, Roca C, Gene L, Moranta D, et al.: The trivial function of\nsleep.  Sleep Med Rev 2007, 11(4):311-325.\n51. Hayssen V, Tienhoven AV, Tienhoven AV: Asdell's patterns of\nmammalian reproduction:a compendium of species-specific\ndata.  Ithaca, New York: Cornell University Press; 1993. \n52. Zepelin H, Siegel JM, Tobler I: Mammalian sleep.  In Principles and\nPractice of Sleep Medicine Fourth edition. Edited by: Kryger MK, Roth\nT, Dement WC. New York: Saunders; 2005:91-100. \n53. Lessells CM, Boag PT: Unrepeatable repeatabilities – a com-\nmon mistake.  Auk 1987, 104(1):116-121.\n54. Saarikko J, Hanski I: Timing of rest and sleep in foraging shrews.\nAnim Behav 1990, 40:861-869.\n55. Rattenborg NC, Voirin B, Vyssotski AL, Kays RW, Spoelstra K,\nKuemmeth F, Heidrich W, Wikelski M: Sleeping outside the box:\nelectroencephalographic measures of sleep in sloths inhabit-\ning a rainforest.  Biol Lett 2008, 4(4):402-405.\n56. De Moura Filho AG, Huggins SE, Lines SG: Sleep and wakingin the\nthree-toed sloth, Bradypus tridactylus.  Comp Biochem Physiol A\n1983, 76(2):345-356.\n57. Davis FC, Frank MG, Heller HC: Ontogeny of sleep and circadian\nrhythms.  In Regulation of sleep and circadian rhythms Edited by:\nTureck FW, Zee P. New York: Dekker; 1999:19-79. \n58. Tobler I: Phylogeny of sleep regulation.  In Principles and Practice\nof Sleep Medicine Edited by: Kryger M, Roth T, Dement W. Philadel-\nphia: Elsevier Saunders; 2005:77-90. \n59. Purvis A, Rambaut A: Comparative-analysis by independent\ncontrasts (CAIC) – an Apple-Macintosh application for ana-\nlyzing comparative data.  Comput Appl Biosci 1995, 11(3):247-251.\n60. Garland T Jr, Harvey PH, Ives AR: Procedures for the analysis of\ncomparative data using phylogenetically independent con-\ntrasts.  System Biol 1992, 41(1):18-32.\n61. Efron B, Tibshirani RJ: An introduction to the Bootstrap.  Lon-\ndon: Chapman and Hall; 1993. \n62. Nunn CL: A comparative study of leukocyte counts and dis-\nease risk in primates.  Evolution 2002, 56(1):177-190.\n63. Semple S, Cowlishaw G, Bennett PM: Immune system evolution\namong anthropoid primates: parasites, injuries and preda-\ntors.  Proc R Soc Lond B 2002, 269(1495):1031-1037.\n64. Born J, Lange T, Hansen K, Molle M, Fehm HL: Effects of sleep and\ncircadian rhythm on human circulating immune cells.  J Immu-\nnol 1997, 158(9):4454-4464.\n65. Oishi K, Ohkura N, Kadota K, Kasamatsu M, Shibusawa K, Matsuda J,\nMachida K, Horie S, Ishida N: Clock mutation affects circadian\nregulation of circulating blood cells.  J Circadian ryhthms 2006,\n4(1):13.\n66. Springer MS, Murphy WJ, Eizirik E, O'Brien SJ: Placental mammal\ndiversification and the Cretaceous-Tertiary boundary.  PNAS\n2003, 100(3):1056-1061.\n67. Bininda-Emonds ORP, Gittleman JL, Purvis A: Building large trees\nby combining phylogenetic information: a complete phylog-\neny of the extant Carnivora (Mammalia).  Biol Rev 1999,\n74(2):143-175.\n68. Purvis A: A composite estimate of primate phylogeny.  Philos T\nRoy Soc B 1995, 348(1326):405-421.\n69. Adkins RM, Gelke EL, Rowe D, Honeycutt RL: Molecular phylog-\neny and divergence time estimates for major rodent groups:\nEvidence from multiple genes.  Mol Biol Evol 2001,\n18(5):777-791.\n70. Huchon D, Douzery EJP: From the old world to the new world:\nA molecular chronicle of the phylogeny and biogeography of\nHystricognath rodents.  Mol Phylogenet Evol 2001, 20(2):238-251.\n"}