{"doi":"10.1080\/09687760500104070","coreId":"14187","oai":"oai:generic.eprints.org:595\/core5","identifiers":["oai:generic.eprints.org:595\/core5","10.1080\/09687760500104070"],"title":"Learning architectures and negotiation of meaning in European trade unions","authors":["Creanor, Linda","Walker, Steve"],"enrichments":{"references":[{"id":196829,"title":"A tale of two courses: a comparative study of tutoring online,","authors":[],"date":"2002","doi":"10.1080\/02680510120110175","raw":"Creanor L. (2002) A tale of two courses: a comparative study of tutoring online,  Open Learning, 17, 57–68.","cites":null},{"id":449666,"title":"Communities of practice: learning, meaning, and identity (Cambridge,","authors":[],"date":"1998","doi":"10.1017\/cbo9780511803932","raw":"Wenger, E. (1998)  Communities of practice: learning, meaning, and identity (Cambridge, Cambridge University Press).","cites":null},{"id":449754,"title":"Community of practice: a metaphor for online design?","authors":[],"date":"2003","doi":"10.1080\/01972240309462","raw":"Schwen T. M. & Hara N. (2003) Community of practice: a metaphor for online design?  The Information Society, 19, 257–270.","cites":null},{"id":196826,"title":"Considering trade union education as a community of practice,","authors":[],"date":"2003","doi":"10.1080\/02601370304842","raw":"Ball, M. (2003) Considering trade union education as a community of practice,  International Journal of Lifelong Learning, 22(3), 297–310.","cites":null},{"id":196827,"title":"Designing system dualities: characterizing a websupported professional development community,","authors":[],"date":"2003","doi":"10.1080\/01972240309466","raw":"Barab, S. MaKinster, G. & Scheckler, R. (2003) Designing system dualities: characterizing a websupported professional development community,  The Information Society, 19, 237–256.","cites":null},{"id":449753,"title":"E-learning and union mobilization,","authors":[],"date":"2002","doi":"10.2307\/25149231","raw":"Sawchuk, P. H., Gawron, Z. & Taylor, J. (2002) E-learning and union mobilization,  Journal of Distance Education\/Revue De L’educations a Distance, 17(3), 80–95.","cites":null},{"id":196833,"title":"Education and Skills","authors":[],"date":"2003","doi":"10.1001\/jama.289.1.93","raw":"Department for Education and Skills (2003)   E-strategy.  Available online at: http:\/\/ www.dfes.gov.uk\/publications\/e-strategy (accessed 12 May 2005).","cites":null},{"id":196830,"title":"European trade union distance education,","authors":[],"date":"2000","doi":"10.1080\/09523980050210466","raw":"Creanor, L. & Walker, S. (2000) European trade union distance education,  Educational Media International, 37(4), 263–269.","cites":null},{"id":196828,"title":"European trade union distance education: first ETUCO experiences, in: E. Gabaglio & R. Hoffman (Eds) European trade union yearbook","authors":[],"date":"2001","doi":null,"raw":"Bridgford, J. & Stubbs, D. (2001) European trade union distance education: first ETUCO experiences, in: E. Gabaglio & R. Hoffman (Eds)  European trade union yearbook (Brussels, ETUI).","cites":null},{"id":449665,"title":"European trade union distance education: potential and problems, paper presented at the","authors":[],"date":"2000","doi":"10.1080\/09523980050210466","raw":"Walker, S. & Creanor, L. (2000) European trade union distance education: potential and problems, paper presented at the  Proceedings of 2nd International Conference on Networked Learning, University of Lancaster, 17–19 April.","cites":null},{"id":449664,"title":"Extending richness with reach: participation and knowledge exchange in electronic networks of practice, in:","authors":[],"date":"2004","doi":"10.4018\/978-1-59140-200-8.ch019","raw":"Teigland, R. & Wasko, M. (2004) Extending richness with reach: participation and knowledge exchange in electronic networks of practice, in: P. Hildreth & C. Kimble (Eds)  Knowledge networks: innovations through communities of practice (Hershey , PA, Idea Group), 230–242.","cites":null},{"id":449750,"title":"Genre repertoire: the structuring of communicative practices in organizations,","authors":[],"date":"1994","doi":"10.2307\/2393771","raw":"Orlikowski, W. & Yates, J. (1994) Genre repertoire: the structuring of communicative practices in organizations, Administrative Science Quarterly, 39, 541–574.","cites":null},{"id":196831,"title":"How trade unions are using (and supporting) ICTs to Deliver Learning.","authors":[],"date":"2005","doi":null,"raw":"Creanor, L & Walker, S. (2005)  How trade unions are using (and supporting) ICTs to Deliver Learning.","cites":null},{"id":449746,"title":"Identifying the complexity of factors in the sharing and re-use of resources, in: A. Littlejohn (Ed.) Reusing online resources: a sustainable approach to e-learning (London,","authors":[],"date":"2003","doi":null,"raw":"McNaught, C. (2003) Identifying the complexity of factors in the sharing and re-use of resources, in: A. Littlejohn (Ed.)  Reusing online resources: a sustainable approach to e-learning (London, Kogan Page), 199–211.","cites":null},{"id":449752,"title":"International study circles,","authors":[],"date":"2000","doi":"10.1080\/13691180051033252","raw":"Salt, B. (2000) International study circles,  Information, Communication & Society, 3(3), 337–346.","cites":null},{"id":196834,"title":"Learning relationships: from theory to design,","authors":[],"date":"1999","doi":"10.3402\/rlt.v7i3.11554","raw":"Fowler, C. J. H. & Mayes, J. T. (1999) Learning relationships: from theory to design,  Association for Learning Technology Journal, 7(3), 6–16.","cites":null},{"id":1042606,"title":"Polarity management: identifying and managing unsolvable problems","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":1879212,"title":"Polarity management: identifying and managing unsolvable problems (Amherst, MA, HRD Press).Learning architectures and negotiation of meaning 123","authors":[],"date":"1992","doi":null,"raw":"Johnson, B. (1992)  Polarity management: identifying and managing unsolvable problems (Amherst, MA, HRD Press).Learning architectures and negotiation of meaning 123 Jones. C. (2004) Networks and learning: communities, practices and the metaphor of networks, ALT-J, 12, 81–93.","cites":null},{"id":196832,"title":"Report commissioned by Trades Union Congress, London. Available online at: http:\/\/ www.learningservices.org.uk\/national\/learning-4014-fo-cfm (accessed 12","authors":[],"date":"2005","doi":null,"raw":"Report commissioned by Trades Union Congress, London. Available online at: http:\/\/ www.learningservices.org.uk\/national\/learning-4014-fo-cfm (accessed 12 May 2005).","cites":null},{"id":449663,"title":"Scottish Further and Higher Education Funding Councils","authors":[],"date":"2003","doi":null,"raw":"Scottish Further and Higher Education Funding Councils (2003)  SFEFC\/SHEFC joint e-learning report.  Available online at: http:\/\/www.sfc.ac.uk\/joint_info\/publications\/joint_e-learning_ report_july_2003.pdf (accessed 12 May 2005).","cites":null},{"id":1042607,"title":"Seven aspects of democracy as related to study circles,","authors":[],"date":"2001","doi":"10.1080\/02601370110036073","raw":"Larsson, S. (2001) Seven aspects of democracy as related to study circles,  International Journal of Lifelong Learning, 20(3), 199–217.","cites":null},{"id":449751,"title":"Shaping electronic communication: the metastructuring of technology in the context of use,","authors":[],"date":"1995","doi":"10.1287\/orsc.6.4.423","raw":"Orlikowski, W., Yates, J., Okamura, K. & Fujimoto, M. (1995) Shaping electronic communication: the metastructuring of technology in the context of use,  Organization Science, 6, 423–444.","cites":null},{"id":196835,"title":"The constitution of society (Cambridge,","authors":[],"date":"1984","doi":"10.1177\/144078338602200128","raw":"Giddens, A. (1984) The constitution of society (Cambridge, Polity Press).","cites":null},{"id":449748,"title":"The duality of technology: rethinking the concept of technology in organizations,","authors":[],"date":"1992","doi":"10.1287\/orsc.3.3.398","raw":"Orlikowski W. (1992) The duality of technology: rethinking the concept of technology in organizations, Organization Science, 3(3), 398–427.","cites":null},{"id":449747,"title":"Trade union education in Europe: a pilot study (Dusseldorf, Hans Bockler Foundation).","authors":[],"date":"1997","doi":null,"raw":"Miller, D. & Stirling J. (1997)  Trade union education in Europe: a pilot study (Dusseldorf, Hans Bockler Foundation).","cites":null},{"id":449749,"title":"Using technology and constituting structures: a practice lens for studying technology in organizations,","authors":[],"date":"2000","doi":"10.1287\/orsc.11.4.404.14600","raw":"Orlikowski, W. (2000) Using technology and constituting structures: a practice lens for studying technology in organizations,  Organization Science, 11(4), 404–428.","cites":null},{"id":449745,"title":"Worker representative training in Europe: are there lessons for social responsibility?, paper presented to the seminar Responsible Restructuring in Europe,","authors":[],"date":"2003","doi":null,"raw":"Luton, G. (2003) Worker representative training in Europe: are there lessons for social responsibility?, paper presented to the seminar  Responsible Restructuring in Europe, Dublin, 19–20 June. Available online at: http:\/\/www.responsible-restructuring.org\/fr\/pdf\/Luton-final-text.pdf (accessed 12 May 2005).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"As networked learning becomes familiar at all levels and in all sectors of education, cross-fertilisation of innovative methods can usefully inform the lifelong learning agenda. Development of the pedagogical architectures and social processes, which afford learning, is a major challenge for educators as they strive to address the varied needs of a wide range of learners. One area in which this challenge is taken very seriously is that of trade unions, where recent large-scale projects have aimed to address many of these issues at a European level. This paper describes one such project, which targeted not only online courses, but also the wider political potential of virtual communities of practice. By analysing findings in relation to Wengers learning architecture, the paper investigates further the relationships between communities of practice and communities of learners in the trade union context. The findings suggest that a focus on these relationships rather than on the technologies that support them should inform future developments","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14187.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/595\/1\/ALT_J_Vol13_No2_2005_Learning%20architectures%20and%20neg.pdf","pdfHashValue":"38573a0b69f2af2ac7a1ca28699725e6ed03d25e","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:595<\/identifier><datestamp>\n      2011-04-04T09:06:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/595\/<\/dc:relation><dc:title>\n        Learning architectures and negotiation of meaning in European trade unions<\/dc:title><dc:creator>\n        Creanor, Linda<\/dc:creator><dc:creator>\n        Walker, Steve<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        As networked learning becomes familiar at all levels and in all sectors of education, cross-fertilisation of innovative methods can usefully inform the lifelong learning agenda. Development of the pedagogical architectures and social processes, which afford learning, is a major challenge for educators as they strive to address the varied needs of a wide range of learners. One area in which this challenge is taken very seriously is that of trade unions, where recent large-scale projects have aimed to address many of these issues at a European level. This paper describes one such project, which targeted not only online courses, but also the wider political potential of virtual communities of practice. By analysing findings in relation to Wengers learning architecture, the paper investigates further the relationships between communities of practice and communities of learners in the trade union context. The findings suggest that a focus on these relationships rather than on the technologies that support them should inform future developments.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/595\/1\/ALT_J_Vol13_No2_2005_Learning%20architectures%20and%20neg.pdf<\/dc:identifier><dc:identifier>\n          Creanor, Linda and Walker, Steve  (2005) Learning architectures and negotiation of meaning in European trade unions.  Association for Learning Technology Journal, 13 (2).  pp. 109-123.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760500104070<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/595\/","10.1080\/09687760500104070"],"year":2005,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 13, No. 2, June 2005, pp. 109–123\nISSN 0968-7769 (print)\/ISSN 1741-1629 (online)\/05\/020109–15\n© 2005 Association for Learning Technology\nDOI: 10.1080\/09687760500104070\nLearning architectures and negotiation \nof meaning in European trade unions\nLinda Creanora* and Steve Walkerb\naGlasgow Caledonian University, UK;  bLeeds Metropolitan University, UK\nTaylor and Francis LtdCALT110390.sgm10.1080\/ 9687760500104070ALT-J, Research in Learning Technology0968 7769 (pri t)\/174 -1629 (onli e)Original Article2 05ssoci tion for Learning Techno ogy3 000June 2005LindaCrea ocademic Pr ctic UnitGlas ow Caledonian University6 Rose StreetGlasgowG3 6RBUK141 2 0 13 3l.cre or@gc .a .uk\nAs networked learning becomes familiar at all levels and in all sectors of education, cross-fertilisa-\ntion of innovative methods can usefully inform the lifelong learning agenda. Development of the\npedagogical architectures and social processes, which afford learning, is a major challenge for\neducators as they strive to address the varied needs of a wide range of learners. One area in which\nthis challenge is taken very seriously is that of trade unions, where recent large-scale projects have\naimed to address many of these issues at a European level. This paper describes one such project,\nwhich targeted not only online courses, but also the wider political potential of virtual communities\nof practice. By analysing findings in relation to Wenger’s learning architecture, the paper\ninvestigates further the relationships between communities of practice and communities of learners\nin the trade union context. The findings suggest that a focus on these relationships rather than on\nthe technologies that support them should inform future developments.\nIntroduction\n… learning—whatever form it takes—changes who we are by changing our ability to partic-\nipate, to belong, to negotiate meaning. (Wenger, 1998, p. 226)\nAs we strive to come to terms with the possibilities of networked learning and its\npotential to afford a valuable, personalised learning experience for all participants, we\nbecome more aware of the variables that can influence the outcome (Creanor, 2002).\nOur perspective is strongly influenced by Jones (2004), who proposes the network\nmetaphor as a means of unifying different aspects of research into advanced learning\ntechnologies based on computer networks. We see networked learning as a concept\nencompassing a range of online learning opportunities, many of which are gradually\nbecoming familiar within educational practices at all levels, encouraged in the United\nKingdom by government strategies and funding bodies (for example, Department for\nEducation and Skills, 2005; Scottish Further and Higher Education Funding\n*Corresponding author. Academic Practice Unit, Glasgow Caledonian University, 6 Rose Street,\nGlasgow G3 6RB, UK. Email: l.creanor@gca.ac.uk\n110 L. Creanor and S. Walker\nCouncils, 2003). In order to establish firmly the lifelong learning ethos, collaboration\nacross traditional educational boundaries is encouraging an exchange of experiences\nand good practice between formal and less formal contexts, thus affording valuable\ninsights into emerging practices and the design of the learning experience in a variety\nof situations.\nOne area where innovative methods are being trialled on a large scale is the\ntrade union sector, where the lifelong learning agenda is being implemented in the\nUnited Kingdom via ambitious initiatives to raise skill levels and engage non-\ntraditional learners in the workplace, underpinned by a major investment in online\ncourses and the development of supportive environments (Creanor & Walker,\n2005). Across Europe also, federations are recognising the range of possibilities\n(Bridgford & Stubbs, 2001) and pan-European collaboration, underpinned by\nappropriate communication tools, is opening up new opportunities for engaging\nmembers in trade union-related education and training. It has also raised the ques-\ntion of whether cooperation enhanced by online networks can afford more effective\nand timely responses to European-level industrial and political developments\nthrough active online communities. Emerging practice in this area is raising inter-\nesting issues in terms of the design and implementation of transnational online\ncommunities, whether for short-term online courses or to support those within\nspecific industrial sectors whose interaction will evolve over longer periods. Emerg-\ning virtual communities such as these are referred to by Teigland and Wasko\n(2004) as electronic networks of practice, in which the mutual engagement associ-\nated with more traditional communities of practice (CoPs) is supported among\ngeographically distributed members in global organisations by communication\ntechnologies.\nWenger (1998) reminds us that learning cannot be designed, but merely facilitated\nor hindered by the processes and artefacts with which participants are expected to\nnegotiate meaning. Nevertheless, he does concede the necessity of designing social\ninfrastructures that will foster learning while simultaneously emphasising that a\nresponse to design is inevitably unpredictable, often giving rise to barriers and bound-\naries that may stifle rather than support engagement and identity. This paper will\nexamine Wenger’s proposed design for learning in relation to one particularly\ncomplex transnational online learning project in the trade union sector.\nBackground\nThe context of our paper is trade union education. While trade union education1 is\nprimarily concerned with improving the capacity of trade unions to organise and\nrepresent workers, educational methods vary from context to context. One central\ndebate in the design of learning situations has been the extent to which the tutor acts\nas a subject expert or a facilitator of learning (Miller & Stirling, 1997). There is gener-\nally a strong commitment to active and participative learning that recognises learners\nas the experts in their own working contexts, as exemplified in the Swedish tradition\nof participative education and study circles. Study circles emphasise the relationship\nLearning architectures and negotiation of meaning 111\nbetween learning and democracy, and there is no requirement for a study group\nleader to be a subject expert (Larsson, 2001). The pedagogy may vary, depending on\nthe organisational and political contexts of the trade union. Miller and Stirling (1997)\nsuggest that in contexts where unions need to emphasise the distinctiveness of their\nown positions, there may be a greater emphasis on expert-led education and the\ntransmission of established union policies. More recently, as trade unions have\nstarted to explore online learning in a transnational context, a number of models have\nbeen implemented, including international study circles, which explicitly seek to\nadapt the dynamic of study circles to online learning by using information and\ncommunication technology (ICT) to connect local study groups (Salt, 2000);\nblended-mode learning combining face-to-face and distance learning phases\n(Creanor & Walker, 2000) and larger-scale purely online workshops (Sawchuk et al.,\n2002).\nAs this paper will also demonstrate, new roles are emerging in response to inno-\nvative methods, including the concept of a proactive ‘broker’ who has the\nexperience and skills to build bridges across cultural and organisational divides in\nsupport of mutual knowledge sharing and learning. The existence of alternative\ndesigns suggests the value of a framework within which these approaches can be\nlocated, potentially highlighting strengths and weaknesses in particular contexts to\nassist the design of future learning events. Such a framework may also suggest\nnovel approaches.\nLearning architectures\nOne potential starting point for considering a ‘design space’ for transnational trade\nunion education is Wenger’s (1998, pp. 231–236) discussion of learning architectures\nas a set of concepts, which can be applied to the design of a particular learning\nsituation. Wenger proposes that the design of a learning situation confronts four\nfundamental issues—meaning, time, space and power—and that these can be\ncaptured through four corresponding dualities: participation versus reification, design\nversus emergence, local versus global and identification versus negotiability. These\ndualities are, in effect, axes that define the space in which learning design takes place.\nWenger, of course, is centrally concerned with social learning within the framework\nof communities of practice. While trade union education is often centrally concerned\nwith the practice(s) of trade unionism, it does not follow that all trade union\neducation is conducted in the context of communities of practice.\nThe social perspectives of learning underpin Wenger’s view of the gradual shap-\ning of an individual’s identity within a community. The ability to negotiate new\nmeaning is inherent in the ability of the members to become involved in the inter-\naction between participation and reification as practices emerge, stabilise and\nbecome accepted as legitimate processes. This is likely to involve boundary building\nas well as crossing, and convergence will only gradually be achieved through the\nevolution of individual expectations into the shared enterprise of the group. Wenger\nalso proposes three modes of belonging, which he has identified as engagement\n112 L. Creanor and S. Walker\n(involvement in meaningful activities and interactions), imagination (exploration\nand risk-taking) and alignment (coordination of perspectives towards a common\npurpose).\nThis model is not, however, without its critics. For example, Schwen and Hara\n(2003) suggest that the CoP may be viewed as a metaphor for online design. Based\non their analysis of four different types of CoPs within large organisations, they\nadvise against the tendency to ‘romanticise’ online communities. They argue that\nWenger’s CoP design concept is no more than an idealised theoretical description,\nwhich requires to be legitimised by more robust research before it can be consid-\nered in any way prescriptive. Nevertheless, they do concede that it presents a\n‘provocative ideal’, which is useful as a tool for dialogue rather than a blueprint for\nconstruction.\nMcNaught (2003) also highlights the need to find a balance between conflicting\ndimensions by working within what she terms the zone of effective change. She anal-\nyses this approach in the framework of polarity theory (Johnson, 1992), which\naddresses the implementation of innovation. McNaught re-interprets this in the\ncontext of innovative pedagogical methods with a specific focus on the re-use of\nlearning resources. The general principles, however, are generic. The theory supposes\nthat, by identifying the two extremes of a particular continuum, it should be possible\nto find a solution that accommodates both by focusing on the tensions between them.\nIf we map this onto Wenger’s four dimensions, the learning architecture appears to\nmirror the zone of effective change by recognising the polarities and explicitly\nincorporating them into the design process. Whereas Wenger’s model identifies\nspecific tensions within the learning design process, the polarity theory may be\napplied more flexibly as it recognises that these dimensions may change according to\ncontext. Nevertheless, the concept of tensions is clearly one that can be usefully\napplied to capture the many facets of learning design.\nSimilarly, Barab et al. (2003) have used Wenger’s dualities model of learning\narchitecture in discussing their design of a web-supported community of teachers.\nThey add two more dualities, which they found helpful: a diversity\/coherence dimen-\nsion referring to the population of participants, and an online\/face-to-face tension\nreferring to modes of organisation of learning.\nWithin trade union education, there is currently some debate about the value of the\nconcept of communities of practice. Some commentators have expressed concern\nthat the increasing corporatisation of the concept in the world of knowledge manage-\nment may render it insufficiently critical to realise value for trade unions (Sawchuk\net al., 2002; Luton, 2003). The concept has, however, usefully been used in trade\nunion education settings to explore learner participation in trade union education in\n(geographically) localised settings (Ball, 2003) and in considering the possible emer-\ngence of European transnational communities (Walker & Creanor, 2000; Luton,\n2003). While the critical edge of the CoP concept may have been diluted in discus-\nsions of workplace and vocational learning, concepts derived from communities of\npractice continue to have value in discussion of trade union education, as we hope to\ndemonstrate in the following.\nLearning architectures and negotiation of meaning 113\nProject context\nDialog On was a major project led by the European Trade Union College (ETUCO),\nthe training agency of the European Trade Union Congress. The project lasted for\njust over two years, finishing in February 2004. The activities were organised around\ntwo major strands, each addressing aspects of the new economy and its implications\nfor trade unions: \n● a ‘networking’ strand supporting cross-border sectoral trade union networking\nactivities; and\n● a computer-mediated distance learning (CMDL) strand developing models of\ncross-border trade union education.\nWithin these two strands, a total of 13 trade union organisations led activities with\ncentral project support organised by ETUCO along with staff from two trade union\nconfederations and Glasgow Caledonian University. The support comprised a\ntraining programme for each strand. The CMDL training prepared experienced trade\nunion educators from the confederations to design and deliver blended mode,\nnational and transnational courses. The networking training prepared ‘animateurs’\nfrom the various sectoral union federations to lead the creation of online networks of\nvarious types. Two animateurs were trained for each network, one primarily with\norganisational\/political responsibility for the network and one with more operational\/\npedagogic responsibility. The training was supported with a set of training materials,\nwhich were also available for ‘downstream’ courses and activities. A common techni-\ncal platform (First Class) was available to underpin all activities, along with technical,\norganisational and administrative support provided by ETUCO.\nGiven the rich and complex environment that provided the backdrop for the Dialog\nOn project, it was inevitable that certain challenges would be fore-grounded. For\nexample: \n● Historically the trade union movement has relied on face-to-face meetings and the\nspoken word, with great value placed on the ability to negotiate agreements\nthrough political astuteness combined with verbal dexterity. Transferring this to an\nonline, text-based environment where communication is more one-dimensional is\na major shift of emphasis.\n● An existing sense of trust and identity with the trade union culture is key to its\nprime aim of solidarity. Capturing this notion of belonging is crucial to engaging\nmembers in the virtual world. The highly political nature of some aspects of trade\nunion culture can, however, serve to undermine this sense of trust.\n● The democratic processes on which the trade union movement is founded may be\nhelped or hindered by the design of the learning environment.\n● Shifting from a national to a transnational focus is likely to heighten the tensions\nbetween local and global interests.\nNegotiation of meaning and convergence of what Wenger describes as ‘diverse\nknowledgeabilities’ (1998, p. 247) towards a shared vision involves accepting,\nassimilating and overcoming challenges as they emerge in response to, or even in spite\n114 L. Creanor and S. Walker\nof, the learning design. It was hoped to capture a wide range of these variables\nthrough the project evaluation.\nEvaluation methodology\nThe evaluation was designed primarily for an internal project audience, seeking to\ncontribute to the development of practice among trade union educators and trade\nunionists more widely. The evaluation design drew on structuration theory (Giddens,\n1984), largely as developed in the information systems field by Orlikowski (1992,\n2000). Structuration theory seeks to overcome the historic division in the social\nsciences between those accounts that see human behaviour as being largely deter-\nmined by broader structural forces and those that conceive of human agency purely\nin terms of subjective interpretations. Structuration theory provided a ‘sensitising\ndevice’ (Giddens, 1984) to consideration of the relationship between broader social\nstructures (including technology use) and the actions and interpretations of the people\ninvolved, both as tutors and learners. Structurational approaches to studying the use\nof information technology have also yielded more specific concepts such as commu-\nnicative genres (Orlikowski & Yates, 1994) and technology use mediation (Orlikowski\net al., 1995), which have been used in identifying key aspects of the project.\nThe evaluation was conducted as a series of comparative case studies of eight\n‘networks’ and eight CMDL courses. Within each case, data were gathered by analysis\nof content (focusing on the emergence of recurrent communication practices and\ngenres as indicators of communication behaviour) and levels of online messages; semi-\nstructured interviews with network ‘animateurs’, pre-participant and post-participant\/\nlearner questionnaires, and participation of animateurs, trainers and evaluators in a\nproject-end evaluation workshop.\nTwo case studies\nThe cases outlined in the following are examples of the two major strands of activity\nwithin the project. Case A is an example of a transnational computer-mediated\ndistance learning course that aimed to bring together (both physically and virtually)\nlearners from two countries for a specified period to work and learn together around\nissues of common concern. Case B is an example of a ‘networking’ activity in which\nan educational intervention was designed to establish a broader ICT-mediated\nnetwork of trade unionists with a view to extending their collaborative activities,\nencouraging cross-cultural exchanges and strengthening their political influence. A\nshort overview of each case is given, followed by a comparative discussion organised\naround Wenger’s (1998) four dualities.\nCase A overview: distance learning course\nThis distance learning course brought together 16 members of trade unions repre-\nsenting professional staff in Italy and France to examine the situation of those staff in\nLearning architectures and negotiation of meaning 115\nthe two countries, in the context of globalisation, as well as technological and\norganisational innovation. In particular, the course aimed to strengthen the role of the\nunion and to identify issues for negotiation by trade unions in the area of training and\nprofessional competences. The course was organised as a five-day residential work-\nshop, followed by a three-month distance learning phase, and a concluding three-day\nresidential workshop. Two experienced trade union educators led the first residential\nworkshop, with invited experts introducing particular themes to the course partici-\npants. The distance phase had three subphases: an introduction in which people\ndownloaded a template with which to present a short profile of themselves and the\ntrade union context in which they were employed; working collaboratively to produce\na document identifying and describing potential tools for the recognition of potential\ncompetences and measuring their value; and working collaboratively to produce a\ndocument discussing possible levels of union intervention. The second and third of\nthese subphases were conducted in three working groups—one made up of French\nparticipants, one of Italian participants and a joint group with a specific mandate to\nexplore the issues at a European level. At the second residential workshop, partici-\npants presented the results of their work, debated the analyses and evaluated the role\nof ICT in the course.\nCase B overview: sectoral network\nThis case concerns the establishment of a network of trade unionists concerned with\nEuropean Works Councils (EWCs)2 in the transport sector. The network aimed to\ninclude trade union members of EWCs, officials of national unions with responsibil-\nities for working with EWCs, and members of the relevant European Industry\nFederation’s (the European Transport Workers’ Federation) executive committee.\nDuring the project, the network grew to include 40 members, of whom 16 also took\npart in the residential workshops. Participants came from at least seven countries\nacross Europe, although a low response rate to the participant profile questionnaire\nmeans that this is almost certainly an underestimate. During the life of the project, 25\nnetwork members posted at least one message in the conference. Participants\nincluded a diverse mixture of elected representatives at various levels of the trade\nunion organisation, EWC members and trade union employees. The objectives of the\nnetwork, from the perspective of the European federation, were to collect and share\ninformation between EWCs and union officials, improve communications within and\nbetween EWCs, discuss and develop strategy for EWCs within the sector, and discuss\nand develop the role of EWC coordinators. Two members of the group took on the\nrole of facilitators or ‘animateurs’ of the network with the aim of encouraging partic-\nipation and knowledge sharing. One of these, an experienced EWC member, took\npart in the project’s ‘animateur’ training for those responsible for leading the work of\nthe networks. The second ‘animateur’ for the network withdrew from the training\nalthough he acted as a trainer\/workshop leader for the two subsequent residential\nworkshops. The format of combined residential and online phases was similar to that\nof case study A, although from its inception a longer lifespan was envisaged for the\n116 L. Creanor and S. Walker\nnetwork. The first of the two workshops provided an opportunity to prepare\nobjectives and strategy for the network, exchange information and establish jointly\nagreed guidelines. The strategic aspects of the workshop built on an earlier event,\norganised outside the framework of the project. The second workshop was held five\nmonths later and aimed to evaluate the work of the network to that point and consider\nplans for future development.\nFollowing the first workshop, the electronic network was launched with a prelimi-\nnary work programme of collecting information on well-established EWCs in the\nindustry in preparation for a conference bringing them together. Ground rules for\nonline working were established, including a commitment of participants to log on at\nleast weekly and an agreement to welcome new members in to the network, although\ntraining in the network technology could only be offered to participants in the pre-\nproject workshop. Although the ‘animateur’ would take overall responsibility for\nfacilitating the online group and organising its tasks and resources, it was expected\nthat members would also provide mutual support. Timescales for the completion of\nthe tasks were not published and little was communicated in direct relation to the task\nonline between the two workshops. Almost one-half (47%) of all messages were\nposted by just two participants, as the network adopted a predominantly information–\ndissemination pattern of communications. The second workshop agreed to continue\nthe online network and to establish a second subconference, particularly for an indus-\ntrial subsector where language was expected to be less of a barrier to communications,\nalthough this was not done during the life of the project.\nDialog On in four dimensions\nParticipation and reification\nWenger argues that participation and reification are central dimensions of practice\nand identity. Participation refers to the experiences of active involvement and\nmembership of communities of practices, and reification to the tools or ‘things’ that\nfacilitate them.\nThe residential workshops organised through the project gave both cases the\nopportunity for face-to-face encounters and participation. In Case B, these took place\nto some extent in the context of other events outside the project itself, which brought\ntogether at least some network members as part of an ongoing practice. However, the\nuse of online conferencing changes the relationship of participation and reification—\nthe very use of online text-based conferencing systems collapses aspects of the\nrelationship between participation and reification. In using the medium, participation\nby posting online immediately reifies the communications as stored text. Legitimated\ncommunication structures are also reified through the very structure of the conferenc-\ning software, which supports particular ways of organising messages and responses\n(threading) and the use of (in the context of First Class) subconferences, subfolders\nand file attachments. The design, by the tutors, of the conference space concretises\ncertain patterns of participation. In Case A, tutors established specific subconferences\nLearning architectures and negotiation of meaning 117\nin the main course conference for the three online working groups. Similarly, in Case\nB a subconference was established for discussions relating to the establishment of a\nparticular EWC, along with subfolders intended to contain supporting documenta-\ntion to the work of the network.\nThe organisation of the two activities differed in the extent to which the outcomes\nof online working were realised. In Case A, working groups organised their collabo-\nration around the production of documents as outputs: typically, word-processed\nreports or presentations designed to support face-to-face presentations at the second\nworkshop. While documents of various forms were circulated in the conferences of\nCase B, they were not used specifically as the outcome of particular tasks.\nA further consequence of the reification of communications reported across the\nproject related to the use of second or third languages. Some participants reported\nthat while their spoken\/aural skills in their second or third language were adequate,\ntheir written skills were less developed, particularly where language skills had been\ndeveloped informally. Posting messages in the networks was more time-consuming\nand also more intimidating in that a permanent record is bearing witness to linguistic\nmistakes. The ‘animateur’ of one network speculated further that this was a particular\nproblem for trade union officials for whom dealing in subtle shades of meaning is a\nwidespread concern.\nDesigned and emergent\nAccording to Wenger, communities’ practices are highly emergent and frequently\nimprovised, concerned primarily with getting something done. These practices\ncannot themselves be designed, but are better thought of as a response to design.\nLearning interventions therefore create a tension between the emergent practices of\na community and the design of the learning. Different approaches to the design of\nlearning might seek to promote or inhibit the emergence of particular ways of doing\nthings, but cannot ultimately guarantee that they will be achieved. The interaction\nbetween the designed and emergent, however, provides impetus to the process of\nnegotiation of meaning.\nThe project proposal pre-defined some elements of the learning activities, most\nclearly in specifying the mix of face-to-face and online episodes. The project also\nprovided central support both of educators and those taking on ‘animation’ respon-\nsibilities, a core element of which were training courses for the two functions, them-\nselves organised in a blended approach to give the tutors and ‘animateurs’ an\nexperience similar to that of the users. The tutors in the distance learning strand were\nthen responsible for the design of the residential and online phases of the course, as\nalready outlined for Case A. Two specific examples, however, illustrate the extent to\nwhich the design was flexible. First, for logistical reasons it proved impossible to\nprovide training in the conferencing platform at the first residential workshop. This\nwas less of a problem for the Italian participants, who already had experience because\ntheir own trade union confederations used the same system. The French participants,\nhowever, had not previously used the system and preferred to organise their\n118 L. Creanor and S. Walker\nsubstantive work via email. Second, as it became clear that the course participants\nwere taking longer to complete the tasks than the tutors had originally envisaged, a\nfourth subphase was abandoned.\nIt is clear that in Case A online activities were more explicitly designed by the\ntutors to achieve particular learning outcomes: each task had a specific output and\nassociated timescale (although this was open to negotiation). The online activities in\nCase B were less explicitly designed. The major focus of online working was not the\ntask agreed at the workshop. The network was used, for example to disseminate\ninformation about the establishment of a particular EWC and was used extensively\nin circulating information during a relatively short-lived industrial dispute. It was\nalso used to circulate information about relevant events. The inherent flexibility\nfavoured emergence, thus minimising the impact of the learning design and maxi-\nmising opportunities for negotiation of meaning.\nLocal and global\nAll practices, whatever their geographic scope, are, in Wenger’s terms, local practices.\nThese local practices are affected in learning situations by inputs from other, equally\nlocal, neighbouring practices in wider networks of practice. In designed learning\nsituations, a key neighbouring community to that of the learners will be that of the\neducators, giving rise to what Fowler and Mayes (1999) have identified as ‘first order’\nlearning relationships. Central to the learning interventions discussed here, the\nparticipants are simultaneously members of local (in a geographic sense) communi-\nties of practice and the learning communities constituted in the courses and networks.\nThe courses have been designed specifically to assist participants to learn from the\nother course participants and to incorporate new ideas and methods into the work of\ntheir geographically local community of practices.\nThe core concern of the project methodology was the establishment of working\nmethods among geographically widespread trade unionists in Case A between two\ncountries and in Case B, potentially at least, across the European Union. The resi-\ndential workshops in both cases provide opportunities for local encounters: the\nessential difficulty in both has been in sustaining interaction at a distance. This may\nbe for a number of reasons. One difficulty is competing demands on time. A\ncommon occurrence throughout the project has been participants’ apologising for\nbeing unable to sustain involvement in online activities when other, geographically\nlocal, demands are competing. It may be a particular feature of trade unionism that\nthe work is reactive to external events, as issues arise in the workplace or at the policy\nlevel. In the face of the demands that these have placed on participants’ time, it has\nproved difficult for many to sustain their involvement. Time factors may also have\nhad an effect on other dimensions, particularly in relation to the impact on emergent\npractices. However, as noted by Teigland and Wasko (2004, p. 239), level of\nparticipation in the network is more significant than the length of time over which\nindividuals participate. In these cases, neither the level nor length of participation\nwas easily sustained.\nLearning architectures and negotiation of meaning 119\nFurthermore, the extended geographic scope of the project is also closely associated\nwith language, the major difficulty in both of these situations. In face-to-face work-\nshops, this was addressed by providing simultaneous translation, at least in the formal\nsessions. In Case A this meant that, subject to the restrictions of simultaneous trans-\nlation, all participants could take part in their mother tongue. In Case B translation\ncould not be provided in language pairs, resulting in some participants working in a\nsecond or third language.\nIdentification and negotiability\nWhen learning interventions are designed they ‘place a stake in the ground’ (Wenger\n1998, p. 235), focusing participant identification and making a bid for the ownership\nof meaning. Design may allow for and encourage the negotiation of meaning, or it\nmay attempt to restrict it. In different approaches to learning, the meaning of a\nparticular event may be more or less open to negotiation between designers and\nparticipants. In the case of trade union education, there is typically a relatively open\napproach to the negotiation of meaning between tutors and learners.\nIn both of the cases here, participation itself can be taken as an indicator of indi-\nvidual identification at some level as trade unionists. Identification, which is at the\ncore of Wenger’s view of learning, is, however, limited in a number of ways. In\nCase A, the course is time limited, which itself is likely to constrain a sense of iden-\ntification with the course and other participants. One participant commented in a\nconference contribution that it felt as if the end of the course had blocked the work\n‘en route’ to successful completion. When asked whether they expected to continue\nworking with other course participants following the course, all of the respondents\n(7\/16 participants) either agreed or agreed strongly that they expected to continue\nworking with participants from their own country; one-half of the respondents (4\/7)\nagreed that they would continue working with colleagues from the other country,\nthe remainder being ‘unsure’. Reasons for the difference between participants’\nexpectations of working with fellow nationals and partner nationals may be attribut-\nable to a number of factors potentially including difficulties in developing shared\nsenses of belonging, exacerbated by language difficulties and organisation of learn-\ning (the majority of participants working in separate, linguistically based groups\nduring the online phase), and\/or recognition of the different national contexts of\ntrade union work and recognition of the logistical difficulties of sustaining future\ncollaboration.\nIn Case B, there is a more ambitious attempt to create a social formation that might\nlook rather more like a community of practice in which group members provide\nmutual support and share goals. For example, the two residential workshops\nexpressed a concern to help new members come in to the network, recognising the\nneed to encourage and legitimate such ‘novice’ participation. Participation in the\nnetwork, at least initially, was an indication of commitment to the development of a\npractice of trade unionism in EWCs. However, some network members expressed a\nconcern that involvement in the network was not sufficiently helpful in supporting\n120 L. Creanor and S. Walker\nparticipants’ involvements in other areas of (perhaps communities of) practice, such\nas their involvement in their own EWCs.\nDiscussion\nThe Dialog On activities described appear to indicate that Wenger’s learning\narchitecture should be seen as informative, rather than prescriptive, in relation to\ndevelopments in this sector. The tensions that emerged during the establishment and\nimplementation of the learning communities and the online networks confirm that\nthe dualities should be acknowledged and addressed directly if potential problem\nareas are to be designed out at an early stage. For example, had the initial training\ninterventions for the online facilitators in both strands included more comprehensive\nguidance on managing language issues, communication and participation may have\nbeen more productive for many of the groups. This explicit emphasis on communi-\ncation, language and culture would impact on an individual’s identification with and\nsense of belonging to the group, thus encouraging progress towards convergence and\ncommon goals. The highly prized ‘mutual knowledgeability’ becomes much more\ndifficult to attain when nuances of meaning and cross-cultural misunderstandings\ninterrupt the reciprocal flow of information.\nIn terms of the four dimensions, therefore, these cases highlight the role not only\nof learning design and its limitations in influencing emergent practices, but also the\npotential role of the tutor or ‘animateur’ as a broker of diverse knowledgeabilities\nacross cultural and organisational boundaries in a constellation of European trade\nunion practices. The outcomes suggest that while an awareness of the dimensions is\nundoubtedly helpful in designing a learning intervention and preparing for these key\nroles, the inherent challenges of facilitating online interaction across borders demand\nthorough preparation and an ability to incorporate a greater degree of flexibility than\nthe model suggests.\nThe modes of belonging can also inform design. For example, identity is seen as\nthe ‘vehicle that carries our experiences from context to context’ (Wenger, 1998,\np. 268). If, as Wenger suggests, the traditional classroom is too disconnected from the\nworld and too uniform to support meaningful forms of identification, how can the\nonline environment be designed in order to afford the boundary spanning that is\nessential to the expansion of the trade union influence in Europe? Participant profiles\ndemonstrated that those taking part in the online activities were active trade union-\nists, with many in a position to exert a strong influence on developments at a national\nand a transnational level. Informal feedback indicated that their experience within the\nproject is likely to have an impact on their work at a (geographically) local level. In\nDialog On the objective was not explicitly designed into the learning process\n(although there is an implicit assumption in most trade union education that trade\nunion practices will be strengthened through education), but by encouraging more\nexplicitly the transfer of boundary objects to other communities, both real and virtual,\nvia the multi-membership of individual participants, trade union influence can be\nusefully strengthened. In this scenario, the brokering role of the tutor\/animateur\nLearning architectures and negotiation of meaning 121\nexerts a major influence. By re-visiting the levels of participation and access to the\nonline communities, for example by allowing peripheral involvement via ‘read-only’\naccess to conferences, as happened in at least one of the networks, the involvement\nand interest of a wider trade union audience could be encouraged and democratic and\nparticipative traditions addressed.\nConclusion\nWenger’s learning architecture has been derived from the study of CoPs, but our\nevidence also suggests that sustainable ‘networks’ can be nurtured and encouraged as\na positive outcome from the kind of short-term learning communities established in\nthe project’s CMDL strand. This longer term collaboration can be encouraged and\ninformed by the pedagogical practices, social processes and roles established within\nthe online courses. Further research is needed to test this hypothesis but, if it is found\nto be a useful method to enhance the reach and influence of trade unions in Europe,\nit has significant implications for training interventions and learning design. It also\nreinforces the fact that networked learning and the more broadly defined communi-\nties of practice are closely related, and that, as Jones (2004) proposes, a range of inter-\ndisciplinary perspectives should be considered when examining the impact of online\ncollaboration.\nOther areas that merit further investigation beyond this particular sector include: \n● Designing for emergence—how can we reconcile the tension between developing\npractices within a community and the learning design? Given the current empha-\nsis on artefacts (learning objects), associated activities and the standards agenda,\nthis would appear to be a fundamental issue. In the specific context of trade union\neducation, the maturity and expertise of participants offers particular opportuni-\nties for explicitly linking online pedagogies to the emergence of novel external\npractices.\n● Boundary crossing—in complex transnational contexts, how can learning design\nsupport alignment between the often diverse local (national and organisational)\npriorities as well as the broader, global imperatives that communities such as these\nare invited to engage with?\n● Participation and reification online—we know that different communication modes\nreify participation in different ways (e.g. the text record in an online conference is\na very different type of reification from that of minutes produced after a formal\nmeeting). So what is the impact of the design of the virtual learning space, in\nparticular the organisation, facilitation and management of online discussions, on\nthe relationship between these dualities?\nWenger’s learning architecture is clearly not definitive. If it is to inform the design\nfor learning and, by extension, the longer term sustainability of effective communi-\nties, it should be viewed flexibly. Acknowledging and valuing the inevitable polarities\nand explicitly addressing them within the training interventions can make negotiation\nof meaning within and across complex boundaries more attainable and meaningful.\n122 L. Creanor and S. Walker\nCommunication technologies are vital to the future development of transnational\ncollaboration but, rather than experimenting with cutting edge tools, we would argue\nthat the focus should be on the nuances of interaction, the role of the ‘broker’ and the\nimpact of design. If the development of online learning and CoPs in the trade union\nsector is to be encouraged, continuing investigation of the emerging pedagogical and\nsocial processes, and the relationships between them, is essential.\nAcknowledgements\nThe Dialog On project was supported by the European Social Fund, Innovative\nMeasures, from November 2001 to February 2004. An earlier version of this paper\nwas presented at ALT-C 2004, where it won a research paper award.\nNotes\n1. In a trade union context, the terms education, training and skills development are used\ninterchangeably (Miller & Stirling, 1997).\n2. Since the 1990s, European Union legislation requires all companies employing more than 1000\npeople and operating in more than one member state to establish a EWC as a forum for sharing\ninformation and consulting with employee representatives. EWCs have represented a major\nnew area of work for European trade unions. Coordination of trade union involvement in\nestablishing and participating in EWCs is a task of the European trade union federations\n(European Industry Federations), which bring together the national trade unions that organise\nin a particular industrial sector.\nReferences\nBall, M. (2003) Considering trade union education as a community of practice,  International\nJournal of Lifelong Learning, 22(3), 297–310.\nBarab, S. MaKinster, G. & Scheckler, R. (2003) Designing system dualities: characterizing a web-\nsupported professional development community,  The Information Society, 19, 237–256.\nBridgford, J. & Stubbs, D. (2001) European trade union distance education: first ETUCO experi-\nences, in: E. Gabaglio & R. Hoffman (Eds)  European trade union yearbook (Brussels, ETUI).\nCreanor L. (2002) A tale of two courses: a comparative study of tutoring online,  Open Learning,\n17, 57–68.\nCreanor, L. & Walker, S. (2000) European trade union distance education,  Educational Media\nInternational, 37(4), 263–269.\nCreanor, L & Walker, S. (2005)  How trade unions are using (and supporting) ICTs to Deliver Learning.\nReport commissioned by Trades Union Congress, London. Available online at: http:\/\/\nwww.learningservices.org.uk\/national\/learning-4014-fo-cfm (accessed 12 May 2005).\nDepartment for Education and Skills (2003)  E-strategy. Available online at: http:\/\/\nwww.dfes.gov.uk\/publications\/e-strategy (accessed 12 May 2005).\nFowler, C. J. H. & Mayes, J. T. (1999) Learning relationships: from theory to design,  Association\nfor Learning Technology Journal, 7(3), 6–16.\nGiddens, A. (1984)  The constitution of society (Cambridge, Polity Press).\nJohnson, B. (1992)  Polarity management: identifying and managing unsolvable problems (Amherst,\nMA, HRD Press).\nLearning architectures and negotiation of meaning 123\nJones. C. (2004) Networks and learning: communities, practices and the metaphor of networks,\nALT-J, 12, 81–93.\nLarsson, S. (2001) Seven aspects of democracy as related to study circles,  International Journal of\nLifelong Learning, 20(3), 199–217.\nLuton, G. (2003) Worker representative training in Europe: are there lessons for social responsibil-\nity?, paper presented to the seminar Responsible Restructuring in Europe, Dublin, 19–20 June.\nAvailable online at: http:\/\/www.responsible-restructuring.org\/fr\/pdf\/Luton-final-text.pdf\n(accessed 12 May 2005).\nMcNaught, C. (2003) Identifying the complexity of factors in the sharing and re-use of resources,\nin: A. Littlejohn (Ed.)  Reusing online resources: a sustainable approach to e-learning (London,\nKogan Page), 199–211.\nMiller, D. & Stirling J. (1997)  Trade union education in Europe: a pilot study (Dusseldorf, Hans\nBockler Foundation).\nOrlikowski W. (1992) The duality of technology: rethinking the concept of technology in organiza-\ntions, Organization Science, 3(3), 398–427.\nOrlikowski, W. (2000) Using technology and constituting structures: a practice lens for studying\ntechnology in organizations,  Organization Science, 11(4), 404–428.\nOrlikowski, W. & Yates, J. (1994) Genre repertoire: the structuring of communicative practices in\norganizations,  Administrative Science Quarterly, 39, 541–574.\nOrlikowski, W., Yates, J., Okamura, K. & Fujimoto, M. (1995) Shaping electronic communi-\ncation: the metastructuring of technology in the context of use,  Organization Science, 6,\n423–444.\nSalt, B. (2000) International study circles,  Information, Communication & Society, 3(3), 337–346.\nSawchuk, P. H., Gawron, Z. & Taylor, J. (2002) E-learning and union mobilization,  Journal of\nDistance Education\/Revue De L’educations a Distance, 17(3), 80–95.\nSchwen T. M. & Hara N. (2003) Community of practice: a metaphor for online design?  The Infor-\nmation Society, 19, 257–270.\nScottish Further and Higher Education Funding Councils (2003)  SFEFC\/SHEFC joint e-learning\nreport. Available online at: http:\/\/www.sfc.ac.uk\/joint_info\/publications\/joint_e-learning_\nreport_july_2003.pdf (accessed 12 May 2005).\nTeigland, R. & Wasko, M. (2004) Extending richness with reach: participation and knowledge\nexchange in electronic networks of practice, in: P. Hildreth & C. Kimble (Eds)  Knowledge\nnetworks: innovations through communities of practice (Hershey , PA, Idea Group), 230–242.\nWalker, S. & Creanor, L. (2000) European trade union distance education: potential and prob-\nlems, paper presented at the Proceedings of 2nd International Conference on Networked Learning,\nUniversity of Lancaster, 17–19 April.\nWenger, E. (1998)  Communities of practice: learning, meaning, and identity (Cambridge, Cambridge\nUniversity Press).\n"}