{"doi":"10.1063\/1.1861985","coreId":"100756","oai":"oai:epubs.surrey.ac.uk:151","identifiers":["oai:epubs.surrey.ac.uk:151","10.1063\/1.1861985"],"title":"Dielectric properties of WS2-coated multiwalled carbon nanotubes studied by energy-loss spectroscopic profiling","authors":["Stolojan, V","Silva, SRP","Goringe, MJ","Whitby, RLD","Hsu, WK","Walton, DRM","Kroto, HW"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-02-07","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:151<\/identifier><datestamp>\n      2017-10-31T13:56:59Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/151\/<\/dc:relation><dc:title>\n        Dielectric properties of WS2-coated multiwalled carbon nanotubes studied by energy-loss spectroscopic profiling<\/dc:title><dc:creator>\n        Stolojan, V<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        Goringe, MJ<\/dc:creator><dc:creator>\n        Whitby, RLD<\/dc:creator><dc:creator>\n        Hsu, WK<\/dc:creator><dc:creator>\n        Walton, DRM<\/dc:creator><dc:creator>\n        Kroto, HW<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2005-02-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/151\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Stolojan, V, Silva, SRP, Goringe, MJ, Whitby, RLD, Hsu, WK, Walton, DRM and Kroto, HW  (2005) Dielectric properties of WS2-coated multiwalled carbon nanotubes studied by energy-loss spectroscopic profiling   APPLIED PHYSICS LETTERS, 86 (6), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1063\/1.1861985<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/151\/","10.1063\/1.1861985"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Dielectric properties of WS2-coated multiwalled carbon nanotubes studied\nby energy-loss spectroscopic profiling\nVlad Stolojan and S. R. P. Silvaa!\nAdvanced Technology Institute, University of Surrey, Guildford, GU2 7XH, United Kingdom\nMichael J. Goringe\nSchool of Engineering, University of Surrey, Guildford, GU2 7XH, United Kingdom\nR. L. D. Whitby, Wang K. Hsu, D. R. M. Walton, and Harold W. Kroto\nSchool of Chemistry, Physics and Environmental Sciences, University of Sussex, Brighton, BN1 9QJ,\nUnited Kingdom\nsReceived 29 July 2004; accepted 7 December 2004; published online 3 February 2005d\nWe investigate experimentally the electronic properties of the coating for multiwalled carbon\nnanotubes covered in tungsten disulfide sWS2d of various thicknesses. Coatings of thicknesses\nbetween 2 and 8 monolayers sMLd are analyzed using energy-loss spectroscopic profiling sELSPd,\nby studying the variations in the plasmon excitations across the coated nanotube, as a function of the\ncoating thickness. We find a change in the ELSP for coatings above 5 ML thickness, which we\ninterpret in terms of a change in its dielectric properties. © 2005 American Institute of Physics.\nfDOI: 10.1063\/1.1861985g\nThe discovery of carbon nanotubes1 and fullerenes2 has\nstarted a significant research effort into developing carbon\nelectronics as a possible alternative to the end-of-the-road for\nsilicon-based electronics, which is predicted to be reached in\nthe next 10–15 years. Recent advances in controlling the\ngrowth of nanotubes3 and the manipulation and welding of\nindividual nanotubes4 have brought the goal of producing\nworking carbon devices within reach. Carbon nanotubes\ncoated with functional layers are excellent candidates as\nstarting blocks for these devices. The heterojunctions formed\nat multiwalled carbon nanotubes sMWCNTsd coated with\nWS2, a known bulk semiconductor,5 could have applications\nin high-efficiency large-area photovoltaics and light-emitting\nstructures. Their use, however, requires knowledge of the\ndielectric properties of the coating, as a function of its thick-\nness, which we investigate here.\nThis information can be acquired in a general-purpose\ntransmission electron microscope sTEMd fitted with a Gatan\nimaging filter sGIFd using a technique known as energy-loss\nspectroscopic profiling sELSPd,6,7 without the need for focus-\ning the electron probe to subnanometer sizes. While the spa-\ntial sampling of the electronic structure information obtained\nin this manner is below that of a dedicated scanning TEM, it\nhas significantly better spatial resolution than if the same\nTEM were used to form a small electron probe, whose diam-\neter is not smaller than 1.5 nm in our case.8\nMWCNTs coated with a varying number of ordered WS2\nlayers were produced by pyrolysis; the production method\nand the characteristics of the nanotube and the coating are\ndescribed elsewhere.5 The tungsten disulfide coating appears\nto cover the nanotubes along their whole length. Small coat-\ning thickness variations f1–2 monolayers sMLdg can occur\nalong the length of the nanotube, so we only analyzed re-\ngions where the coating thickness was constant over lengths\n5–10 times the nanotube’s diameter. There was no detectable\noxygen fusing electron energy loss spectroscopy sEELSdg in\nthe coating. The samples were analyzed using a Philips\nCM200TEM with a LaB6 filament, fitted with a GIF2000\nspectrometer.\nWhen orienting a linear feature along the axis integrated\nby the quadrupoles of the GIF, the CCD records a two-\ndimensional image where one coordinate is the energy loss\nand other is, to within a scaling factor, the spatial coordinate\nnormal to the linear feature; this technique is ELSP.7 Here we\nuse a tilt-rotate holder to accurately align the tube along the\nintegrated axis to within 0.1°. The data are gathered in the\ndiffraction-coupled mode si.e., the image appears on the\nscreen but the spectrometer is focused on the beam crossover\nwhere one records the diffraction patternd, using the largest\ncollector aperture available s3 mmd, at ,820 0003 magnifi-\ncation. The choice of collection angle for samples with an\nanisotropic dielectric function can alter the relative contribu-\ntions of each of the dielectric components, but as the experi-\nments for all coating thicknesses were performed at the same\ncamera length and with the same collector aperture, the in-\nfluence of the collection angle is also the same for all thick-\nnesses.\nFor each coating thickness investigated, 40–50 ELSP im-\nages were collected, aligned in both dimensions and then\nsummed. The parallel recording of the position and energy\naxes in an ELSP image allows for the independent and accu-\nrate definition of the position of the coating. Our experimen-\ntal setup allowed for the spatial sampling of the electronic\nproperties of the coating with a resolution of ,3 Å. This was\ndetermined from a profile across the zero loss peak in the\nELSP image, which is identical to the image of the coated\nnanotube integrated in the horizontal direction. Provided a\nsuitable magnification is chosen, the ELSP profile ssee Fig.\n3d shows in this case WS2 fringes which can be used for\nalignment and calibration of the spatial dimension in the\nELSP images. Thus, we are able to sample the electronic\nstructure of a linear feature on the nanoscale, using an instru-\nment not ordinarily capable of forming probes smaller than\n1.5 nm.\nadAuthor to whom correspondence should be addressed; electronic mail:\nS.Silva@surrey.ac.uk\nAPPLIED PHYSICS LETTERS 86, 063112 s2005d\n0003-6951\/2005\/86~6!\/063112\/3\/$22.50 © 2005 American Institute of Physics86, 063112-1\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nFigure 1 shows low-loss spectra, after the removal of the\nzero-loss peak using a scaled-fitting method,9 at various po-\nsitions from the outer surface of the 4-ML-coated nanotube,\ndefined as negative outside the outer surface of the coating\nand positive towards the center of the MWCNT. When mov-\ning across the coated nanotube, the spectra in Fig. 1 show\npeaks at ,6, ,18, and ,23 eV, and also a further small\npeak at ,14 eV at grazing incidence and further from the\ncoating sso-called “aloof” spectroscopy10d.\nThe local anisotropy of the dielectric function and the\nhollow geometry of tubes result in a degeneracy of the sur-\nface plasmon mode into two or more modes.11–14 Previous\nwork conducted on MWCNTs on the one hand11,12 and WS2\nnanotubes on the other13,14 have associated the bulk and sur-\nface plasmon peaks observed in Fig. 2 to a family of allowed\ninterband transitions.12 We use these individual studies as the\nstarting point for the interpretation of our system combining\nthe two cases. The peak at 23 eV is the bulk plasmon asso-\nciated with the component of the dielectric function parallel\nto the local c-axis of the carbon tube senhanced at the edge\nof the tubed, while the bulk plasmon at 27 eV is associated\nwith the perpendicular component of the dielectric function\nsenhanced in the middle of the tubed.\nThe 17–18 eV peak is associated with the carbon tube’s\nsurface plasmon of the s electrons related to the s-s* tran-\nsition, the 14–15 eV peak is linked to p-s* and s-p* tran-\nsitions, and the 6 eV peak represents surface excitations\nlinked to the p-p* transitions for the parallel component of\nthe dielectric function.12 The hollow geometry can further\nsplit these plasmon modes into symmetric and antisymmetric\nbranches. For example,13 a thick pure WS2 nanotube sratio of\ninner to outer radii r \/R!1d shows, at grazing incidence, a\ndominant surface mode at ,16 eV which splits, for a thin\nnanotube sr \/R,1d, into two modes centered on 15 and\n22 eV. Similarly,11 at grazing incidence, the 14–15 eV peak\nfor thick carbon tubes is shown to split into a radial mode at\n,18 eV and a tangential mode at ,14 eV sFig. 1d.\nAs we step across the surface of the coated nanotube\nsFig. 1d, the relative weights of each of the peaks changes\ndepending on the position from the outer surface of the coat-\ning. In our combined case, because of the overlap of the\nrespective carbon and WS2 surface and bulk peaks, we con-\nclude that any interface plasmon between the tube and the\ncoating will result in the modification the relative weights of\nthe peaks in Fig. 1 according to the coating’s thickness. We\ninvestigate this relative change by normalizing each spec-\ntrum to the maximum value in the 4–35 eV range. Similar to\nthe studies of Stephan et al.,11 we used a 2 eV window cen-\ntered on the dominant peaks to integrate the spectral intensity\nand display it as a function of position across the nanotubes.\nFigure 2 shows typical measurements for the plasmon\nintensities from areas centered on 6, 14, 18, and 23 eV for a\n4 ML coating. The ELSP profile shown is taken across the\nzero-loss peak in the ELSP images and is equivalent to the\nimage of the nanotube integrated along that direction; it dem-\nonstrates the subnanometer spatial sampling and is used for\nthe accurate determination of the scale and origin of the po-\nsition axis. The origin of the position axis is determined in\neach case using the center of symmetry of the fringes from\nthe ELSP profile, and then shifting the scale by half of the\ncoating’s width where layers are separated by 6.2 Å and are\n,3.2 Å thick.5 This shift effectively sets the origin of the\nspatial dimension on the outer surface of the coated nano-\ntube, for easy comparison of MWCNTs with different WS2\ncoating thicknesses. The hashed region in Fig. 2 is a visual\nrepresentation of the coating’s width.\nWe repeated the experiment for several coating thick-\nnesses, for all of which we observed a transition from the\ndominant bulk plasmon mode at 23 eV to the surface plas-\nmon modes s18, 14, and 6 eVd. We note that the position at\nwhich the transition between the bulk and surface plasmons\nFIG. 1. Selected line spectra at various positions across the surface of a 4\nML WS2-coated MWCNT, after the removal of the zero-loss peak. The\norigin of the scale across the nanotube is defined at the outer surface of the\ncoating, positive at positions inside the tube and negative outside ssee inset\ndiagramd. The plasmon peak shows a transition from a dominant bulk mode\nto a surface plasmon dominant mode in the region of the coating. The\ndashed lines are guides to the eye for the positions of the various surface and\nbulk collective excitations in the region of the surface of the coating. The\nWS2 coating fringes are clearly visible in the ELSP spatial dimension and\ncan be used to determine the position of the coating independently.\nFIG. 2. Variation of areas of windows 2 eV wide and centered on 6, 14, 18,\n23, and 27 eV as a function of position across MWCNTs coated with 4 ML\nof WS2. The area under the zero-loss peak is represented as the ELSP profile\nfor each of the coating thicknesses and is used to determine accurately the\nposition of the outer surface of the coating si.e., the origin of the position\nscaled, when compared to the image profile in each case. The hashed region\nmarks the position of the coating layer, with negative positions being in the\nvacuum outside the nanotube.\n063112-2 Stolojan et al. Appl. Phys. Lett. 86, 063112 ~2005!\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nsthe crossover between the 18 and 23 eV curvesd occurs with\nrespect to the outer surface of the coating, depends on the\nthickness of the coating. Figure 3 summarizes the relative\nposition of the crossover point with respect to the coating’s\nsurfaces, normalized to the width of the layer. For the 2 and\n3 ML coatings, this transition occurs in the region of the\ninner surface of the coating, while for the 4 ML coating this\noccurs roughly in the middle of the coating. For coatings\nthicknesses beyond 5 ML, the transition occurs on the outer\nsurface of the coating.\nThe variation in the bulk-surface changeover as a func-\ntion of the position across the coated MWCNT can be inter-\npreted in terms of the dielectric nature of the coating. One\nsolution is that, when the coating is very thin, it acts as part\nof the surface of the MWCNT; for thicknesses equal or\nabove 5 ML, the coating is thick enough to establish dielec-\ntric properties more akin to a pure WS2 nanotube. In this\nmodel, the thin coatings sup to 4 MLd are seen to form a\nrelatively dielectrically thicker outer surface of the MWCNT,\nwith a less abrupt transition from vacuum to carbon nano-\ntube. Once the thickness reaches 5 ML, there is now enough\nWS2 for the coating to no longer be a dielectric part of the\nouter surface of the MWCNT so that there is now a sharp\ntransition from the dielectric function of the MWCNT to that\nof the coating and then to that of the vacuum. However,\nbecause now we are in a situation similar to a pure WS2\nnanotube with a very small r \/R radius, we expect13,14 to have\na strong coupling of the surfaces leading to a split of the\n16 eV surface mode into a peak at 22 eV and the “forest of\npeaks”13 at 0–15 eV. This peak in turn contributes to the\nsignal in the 23 eV peak sFig. 2d so that the bulk-to-surface\ntransition now occurs on the outer surface of the coating.\nAn alternate hypothesis, still based on the dielectric defi-\nnition of the inner and outer surfaces of the coating is that,\nfor the thin coating, the diffused outer surface of the\nMWCNT can also be represented by a “clean” MWCNT\nouter surface dielectric function, placed at a position within\nthe diffused outer surface model. This could be used to ex-\nplain the observed variation of the crossover position with\nchanging coating thicknesses below 4 ML sFig. 3d. When the\ncoating reaches 5 ML, then we revert to being able to define\nthe two abrupt dielectric surfaces of the coating. In this case,\nthe coupling between the coating and the MWCNT is now\nfacilitated, such that the outer surface of the coating acts also\nas the outer surface of the MWCNT. This would interpret the\nobserved crossover at the outer surface of the coating not as\na contribution from a surface coupling of the interfaces of the\ncoating, but simply as the outer surface of the coating being\nnow dielectrically coupled with the MWCNT.\nIn conclusion, we have investigated experimentally the\nnature of the interface between a MWCNT and its WS2 coat-\ning, as a function of the coating’s thickness. This was\nachieved with subnanometer spatial resolution, using parallel\nillumination in a nonscanning TEM, by means of energy loss\nspectroscopic profiling. The minimum width of the WS2\ncoating necessary for it to have defined dielectric internal\nand external interfaces, was found to be 5 ML.\nWe thank the EPSRC for funding through the Portfolio\nGrant and the Multidisciplinary project grant GR\/N36073\/\n01.\n1S. Iijima, Nature sLondond 354, 56 s1991d.\n2H. W. Kroto, J. R. Heath, S. C. O’Brien, R. F. Curl, and R. E. Smalley,\nNature sLondond 318, 162 s1985d.\n3L. A. W. Robinson, S.-B. Lee, K. B. K. Teo, M. Chhowalla, G. A. J.\nAmaratunga, W. I. Milne, D. A. Williams, D. G. Hasko, and H. Ahmed,\nNanotechnology 14, 290 s2003d.\n4D. Cox, R. D. Forrest, P. R. Smith, and S. R. P. Silva, “Manipulation of\nCarbon Nanotubes for Construction of Bespoke Nano-Device Structures”,\nin Nanoengineered Nanofibrous Materials, Proceedings of the NATO Ad-\nvanced Study Institute, Belek-Antalia, Turkey, 1–12 September 2003,\nNATO Science Series II: Mathematics, Physics and Chemistry, ,http:\/\/\nwww.springeronline.com\/sgw\/cda\/frontpage\/0,11855,3–185–69–\n33107180–0,00.html., Vol. 169, Guceri, Selcuk; Gogotsi, Yury G.; Kuz-\nnetsov, Vladimir sEds.d 2004, XII, 543 p., Softcover. ISBN: 1–4020–\n2549–1; pg. 311–xxx.\n5R. L. D. Whitby, W. K. Hsu, P. K. Fearon, N. C. Billingham, I. Maurin, H.\nW. Kroto, D. R. M. Walton, C. B. Boothroyd, S. Firth, R. J. H. Clark, and\nD. Collison, Chem. Mater. 14, 2209 s2002d; R. L. D. Whitby, W. K. Hsu,\nC. B. Boothroyd, H. W. Kroto, and D. R. M. Walton, Chem. Phys. Lett.\n359, 121 s2002d.\n6L. Reimer, I. Fromm, P. Hirsch, U. Plate, and R. Rennekamp,\nUltramicroscopy 46, 335 s1992d.\n7T. Walther, Ultramicroscopy 96, 401 s2003d.\n8Philips Operating Instructions CM200TEM, 1st ed. srev.d, Philips Elec-\ntronics N.V. sEindhoven, Netherlands, 1994\/1995d p. 2–24.\n9B. W. Reed and M. Sarikaya, Ultramicroscopy 93, 25 s2002d.\n10R. J. Warmack, R. S. Becker, V. E. Anderson, R. H. Ritchie, Y. T. Chu, J.\nLittle, and T. L. Ferrell, Phys. Rev. B 29, 4375 s1984d.\n11O. Stéphan, M. Kociak, L. Henrard, K. Suenaga, A. Gloter, M. Tencé, E.\nSandré, and C. Colliex, J. Electron Spectrosc. Relat. Phenom. 114–116,\n209 s2001d; Phys. Rev. B 66, 155422 s2002d.\n12M. Kociak, L. Henrard, O. Stéphan, K. Suenaga, and C. Colliex, Phys.\nRev. B 61, 13936 s2000d.\n13M. Kociak, O. Stéphan, L. Henrard, V. Charbois, A. Rothschild, R. Tenne,\nand C. Colliex, Phys. Rev. Lett. 87, 075501 s2001d.\n14D. Taverna, M. Kociak, V. Charbois, and L. Henrard, Phys. Rev. B 66,\n235419 s2002d.\nFIG. 3. The transition between the dominance of the bulk mode and that of\nthe surface mode occurs at positions dependent on the coating thickness,\ndisplayed normalized to the coating’s thickness: at the inner surface of the\ncoating for 2 ML WS2, within the coating for 4 ML WS2, and at the outer\nsurface of the coating for thicknesses above 5 ML of WS2. The error bars in\nthe 2 ML case are ,30%, but get smaller as the coating’s thickness in-\ncreases. In absolute terms, the error in position is ,3 Å.\n063112-3 Stolojan et al. Appl. Phys. Lett. 86, 063112 ~2005!\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}