{"doi":"10.1016\/j.dr.2007.03.001","coreId":"65782","oai":"oai:dro.dur.ac.uk.OAI2:4774","identifiers":["oai:dro.dur.ac.uk.OAI2:4774","10.1016\/j.dr.2007.03.001"],"title":"Getting Vygotskian about theory of mind : mediation, dialogue, and the development of social understanding.","authors":["Fernyhough,  C."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-06-01","abstract":"The ideas of Vygotsky [Vygotsky, L. S. (1987). Thinking and speech. In The collected works of L. S. Vygotsky, (Vol. 1). New York: Plenum. (Original work published 1934.)] have been increasingly influential in accounting for social–environmental influences on the development of social understanding (SU). In the first part of this article, I examine how Vygotskian ideas have to date been recruited to explanations of the development of SU. Next, I present a model of SU development which draws on two implications of Vygotsky’s ideas: the importance of semiotic mediation for mental functioning, and the dialogic nature of the higher mental functions. I then consider the value of the proposed model in accounting for evidence from three areas of enquiry: the typical development of SU in infancy and early childhood, relations between individual differences in SU and social–environmental variables, and atypical development. The model is suggested to be particularly helpful in understanding the transition from intentional-agent to mental-agent understanding, and the role of language in SU. Remaining challenges include a need to specify further the cognitive processes underlying internalization, and to gather more extensive evidence on the roles of typical and atypical social experience in SU development","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65782.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4774\/1\/4774.pdf","pdfHashValue":"80364734d6c81458fe403713a8e1da4b06487e47","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4774<\/identifier><datestamp>\n      2012-09-25T14:02:37Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Getting Vygotskian about theory of mind : mediation, dialogue, and the development of social understanding.<\/dc:title><dc:creator>\n        Fernyhough,  C.<\/dc:creator><dc:description>\n        The ideas of Vygotsky [Vygotsky, L. S. (1987). Thinking and speech. In The collected works of L. S. Vygotsky, (Vol. 1). New York: Plenum. (Original work published 1934.)] have been increasingly influential in accounting for social–environmental influences on the development of social understanding (SU). In the first part of this article, I examine how Vygotskian ideas have to date been recruited to explanations of the development of SU. Next, I present a model of SU development which draws on two implications of Vygotsky’s ideas: the importance of semiotic mediation for mental functioning, and the dialogic nature of the higher mental functions. I then consider the value of the proposed model in accounting for evidence from three areas of enquiry: the typical development of SU in infancy and early childhood, relations between individual differences in SU and social–environmental variables, and atypical development. The model is suggested to be particularly helpful in understanding the transition from intentional-agent to mental-agent understanding, and the role of language in SU. Remaining challenges include a need to specify further the cognitive processes underlying internalization, and to gather more extensive evidence on the roles of typical and atypical social experience in SU development. <\/dc:description><dc:subject>\n        Dialogue<\/dc:subject><dc:subject>\n         Inner speech<\/dc:subject><dc:subject>\n         Mentalizing<\/dc:subject><dc:subject>\n         Private speech<\/dc:subject><dc:subject>\n         Semiotic mediation<\/dc:subject><dc:subject>\n         Social understanding<\/dc:subject><dc:subject>\n         Vygotsky's theory.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Developmental review, 2008, Vol.28(2), pp.225-262 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4774<\/dc:identifier><dc:identifier>\n        issn:0273-2297<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.dr.2007.03.001<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4774\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.dr.2007.03.001<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4774\/1\/4774.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0273-2297","0273-2297"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Dialogue","Inner speech","Mentalizing","Private speech","Semiotic mediation","Social understanding","Vygotsky's theory."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 February 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nFernyhough, C. (2008) ’Getting Vygotskian about theory of mind : mediation, dialogue, and the development\nof social understanding.’, Developmental review., 28 (2). pp. 225-262.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.dr.2007.03.001\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n26 February 2009\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nFernyhough, C. (2008) 'Getting Vygotskian about theory of mind : mediation, dialogue, and the development\nof social understanding.', Developmental review., 28 (2), pp.\u0000225-262.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1016\/j.dr.2007.03.001\nVygotsky and social understanding    1 \n \nRunning head: VYGOTSKY AND SOCIAL UNDERSTANDING \n \n \n \nGetting Vygotskian about Theory of Mind: \nMediation, Dialogue, and the Development of Social Understanding \n \n \nCharles Fernyhough \nDurham University \n \n \nIn press, Developmental Review \n \n \n \nCorrespondence concerning this article should be addressed to Charles Fernyhough, Department \nof Psychology, Durham University, South Road, Durham, DH1 3LE, UK.  \nTel.: +44 (0) 191 334 3243 \nFax.: +44 (0) 191 334 3241 \nc.p.fernyhough@durham.ac.uk \n \n \nVygotsky and social understanding    2 \n \nAbstract \nThe ideas of L. S. Vygotsky (e.g., 1934\/1987) have been increasingly influential in accounting \nfor social-environmental influences on the development of social understanding (SU). In the first \npart of this article, I examine how Vygotskian ideas have to date been recruited to explanations \nof the development of SU. Next, I present a model of SU development which draws on two \nimplications of Vygotsky’s ideas: the importance of semiotic mediation for mental functioning, \nand the dialogic nature of the higher mental functions. I then consider the value of the proposed \nmodel in accounting for evidence from three areas of enquiry: the typical development of SU in \ninfancy and early childhood, relations between individual differences in SU and social-\nenvironmental variables, and atypical development. The model is suggested to be particularly \nhelpful in understanding the transition from intentional-agent to mental-agent understanding, and \nthe role of language in SU. Remaining challenges include a need to specify further the cognitive \nprocesses underlying internalization, and to gather more extensive evidence on the roles of \ntypical and atypical social experience in SU development. \n  \n \nKeywords: dialogue, inner speech, mentalizing, private speech, semiotic mediation, social \nunderstanding, Vygotsky’s theory \n \nVygotsky and social understanding    3 \n \nGetting Vygotskian about Theory of Mind: Mediation, Dialogue, and the Development of Social \nUnderstanding \n Human beings attain levels of social understanding (SU) whose sophistication is \nunknown elsewhere in the animal kingdom (Tomasello, Carpenter, Call, Behne, & Moll, 2005). \nOne thing we have learned from more than a quarter-century of theory-of-mind researchi is that \nthe cognitive processes underlying these forms of understanding are unlikely to be attributable to \na unitary social-cognitive capacity (Nelson, 2004). Among the reasons for skepticism about this \npossibility has been the absence so far of any compelling evidence for a modular mentalizing \ncapacity based on a unitary neuroanatomical substrate (Apperly, Samson, & Humphreys, 2005), \ndespite claims that SU is best understood in these terms (Fodor, 1992; Leslie, 1991). Another \nreason comes from evidence that any genetic component to SU is considerably weaker than the \nsocial-environmental variables that have been proposed to influence this process (Hughes, \nJaffee, Happé, Taylor, Caspi, & Moffitt, 2005). Indeed, the compelling evidence for social \ninfluences on SU development makes it clear that children’s developing understanding of others \nis determined by their ability to draw on pre-existing and parallel-developing social-cognitive \nand general cognitive resources. The time is ripe, therefore, for an account of SU development \nthat can pay full attention to how children’s emerging social-cognitive capacities are shaped by \ndevelopments in other areas of cognition.  \n A number of proposals have been made for psychological capacities and qualities that are \nlikely to play a part in SU. Simulation theorists (e.g., Gordon, 1992; Harris, 1989) have \nsuggested that SU depends upon individuals’ ability to project themselves imaginatively into the \nperspectives of others and simulate their mental processes. This suggests that children’s pre-\nexisting imaginative capacities are likely to constrain their social-cognitive reasoning abilities. A \nsecond suggestion, based on evidence for the importance of the narrative context of laboratory \nVygotsky and social understanding    4 \n \nassessments of SU (Lewis, Freeman, Hagestadt, & Douglas, 1994), is that children’s abilities in \nthis respect will depend upon the capacity to represent and process narratives. A third proposal \ncomes from Tomasello et al. (2005), who suggest that SU is predicated upon a species-specific \nmotivation to share intentional states with others. These authors argue that experience of social \ninteractions in which intentional relations to the world are shared is necessary for individuals to \nbuild the cognitive structures needed for more sophisticated reasoning about mental states and \nbehavior.  \n One developmental achievement that is more likely than any other fundamentally to \ntransform children’s SU is the acquisition of language. A rich body of recent empirical research \nhas shown how increasingly sophisticated linguistic abilities can mediate and structure children’s \nconceptual understanding of other minds (see chapters in Astington & Baird, 2005a). This \ngrowth of interest in the involvement of language in SU development is reflected in a more \ngeneral increase in interest in the constitutive role of language in cognition (e.g., Carruthers, \n2002; Clark, 2006).  \n One theory that can be useful for understanding this involvement of language in SU is \nthat of L. S. Vygotsky (e.g., 1931\/1997, 1934\/1987, 1930-1935\/1978). The heyday of research \ninto children’s understanding of other minds has witnessed a parallel groundswell of interest in \nVygotsky’s ideas about how human mental functioning is rooted in the interpersonal contexts \nwithin which it develops, and how cognitive functions traditionally considered separately can \ntransform each other in development (see Lloyd & Fernyhough, 1999). In exploring the \npossibility of a Vygotskian account of SU development, I shall be assuming that any such \naccount should be able to answer to three main types of evidence. First, it must provide a \ndescription of normal ontogenesis which can be evaluated with respect to developmental \nobservables. Secondly, it must be able to account for qualitative and quantitative differences \nVygotsky and social understanding    5 \n \nbetween individuals in development. Thirdly, it must be sufficient to explain situations where the \nnormal course of development is perturbed.  \n This article is in five parts. In the first, I examine how some central Vygotskian ideas \nhave been used in explaining SU development. In the second, I outline a theoretical framework \nwhich places emphasis on two important implications of Vygotsky’s ideas: the role of semiotic \nmediation in mental functioning, and the dialogic nature of the higher mental functions. In the \nthird section, I consider how this framework can be applied to explaining typical SU \ndevelopment, with a particular focus on the transition from intentional-agent to mental-agent \nunderstanding, and the role of language in SU. In the fourth part, I examine the model’s \npredictions with regard to those social-environmental and cultural variables known to relate to \nindividual differences in SU development. In the final section, I consider the model’s application \nto cases of atypical development, with a particular focus on autism and sensory impairment.  \nVygotsky and Social Understanding \n Wertsch (1985) identified three main themes to Vygotsky’s theory: (a) the reliance on a \n‘genetic method’, whereby mental functions are investigated with respect to their developmental \nprecursors and sequelae; (b) the claim that the higher mental functionsii have their origin in \ninterpersonal activity; and (c) the assumption that mental activity is mediated by culturally \nderived sign systems. A foundational concept in Vygotsky’s theory is the notion of \ninternalization, the process whereby the individual, through interaction with others, actively \nreconstructs external, shared operations on the internal plane (Vygotsky, 1931\/1997). For \nexample, Wertsch and Stone (1985) showed how a child collaborating with her mother on a \nproblem-solving task will internalize and abbreviate the dialogue which occurred between them \nand use it subsequently to regulate her own solo activity. The process of internalization, along \nwith its conceptual relation, the zone of proximal development (see below), has been the subject \nVygotsky and social understanding    6 \n \nof extensive research and elaboration (e.g., Lawrence & Valsiner, 1993; van Geert, 1998; \nWertsch, 1991).  \n A central assumption of Vygotsky’s theory is thus that ‘individual’ mental functioning is \nirreducibly social in origin. Mental activity which is initially distributed or shared between \nindividuals is later actively reconstructed on the internal plane. Such a theory has implications \nfor the problem of how an epistemic subject can ever come to know about another epistemic \nsubject, when the mental states of the other are not objectively observable (Austin, 1979). This \nepistemological problem flows from a Cartesian conception of mind as a mental substance, \ntrapped within the body, with no access to external reality except through (possibly unreliable) \nperceptual systems (Ryle, 1949\/1973). In contrast, followers of Vygotsky’s approach conceive of \nmind primarily as activity, which can extend beyond the skin to interpenetrate with other minds \nin interpersonal exchanges. Vygotsky’s theory thus offers the prospect of an account of SU \ndevelopment which avoids the ‘Cartesian ghost’ (Moore, 1996) by considering how the \ninternalization of interpersonal activity fundamentally restructures the individual’s cognition. \n Vygotsky was not the only developmentalist of his era to argue for the social origins of \nsome forms of thought (e.g., Piaget, 1977\/1995; Mead, 1934). Where Vygotsky differs from his \ncontemporary Piaget, however, is in his claim that higher forms of mental functioning are \nmediated by culturally derived artifacts, such as signs. Vygotsky stated that “the central fact \nabout our psychology is the fact of mediation” (1933\/1997, p. 138). In a large and diverse body \nof work, he explored the implications of typically developing children’s use of signs for verbal \nplanning (Levina, 1981), mediated memory (Leont’ev, 1932), and the self-regulation of behavior \n(Vygotsky, 1934\/1997). In a series of hypotheses which have been the focus of renewed \nempirical attention in recent years (e.g., Winsler, Fernyhough, & Montero, in press), Vygotsky \nclaimed that the development of verbal mediation is evidenced in children’s use of self-directed \nVygotsky and social understanding    7 \n \nlanguage (now commonly known as private speech) to accompany and regulate their behavior. \nRecent research has found support for his predictions of a U-shaped trajectory in private speech \ndevelopment (Winsler & Naglieri, 2003), relations with task difficulty and task performance \n(Fernyhough & Fradley, 2005), and the semantic and syntactic abbreviation hypothesized to \naccompany internalization (Winsler, de Leon, Wallace, Carlton, & Willson-Quayle, 2003).  \n Despite Piaget’s (e.g., 1977\/1995) acknowledgement of the importance of social \nexchanges for intellectual development, and the interest of neoPiagetian researchers in defining \nthe conditions under which interpersonal interaction can lead to intellectual progress (e.g., \nChapman, 1991), no equivalent to this idea of semiotic mediation exists in Piaget’s work or in \nany contemporary neoPiagetian accounts. Indeed, Piaget’s view of language was somewhat \nimpoverished in comparison with modern accounts (Müller & Carpendale, 2000), and probably \nnot rich enough to allow for the psychological functions that Vygotsky attributed to it, nor the \nsemiotic transformations that he proposed to accompany its internalization. On the grounds that \nVygotsky’s writings neither address nor repudiate the idea of cognitive egocentrism, Piaget \n(2000) explicitly rejected the Vygotskian view of private speech and, by implication, his claims \nfor the semiotic mediation of higher mental processes. Given this essential difference between \ntheir theories, it would seem important for any Vygotskian account of SU to examine fully the \nimplications of this aspect of his theory, and determine how accounts that draw on different \ncombinations of these two theorists’ ideas lead to diverging empirical predictions.  \n Vygotsky never addressed the set of theoretical problems that are nowadays gathered \nunder the umbrella of theory-of-mind research (see Note 1). Indeed, a lack of clarity in his theory \nabout how young children’s thought comes to be ‘socialized’, or capable of accommodating the \ndiffering perspectives of social partners, lay at the root of his disagreement with Piaget (2000) \nabout the developmental significance of private speech (Fernyhough, 1999). Any attempt to \nVygotsky and social understanding    8 \n \ndraw out the implications of Vygotsky’s theory for SU development must therefore tread a line \nbetween sensible extrapolations from his writings to new bodies of data, and attributing ideas to \nVygotsky that were never properly his. That said, Vygotsky’s writings offer a rich source of \nideas for making sense of social-environmental influences on SU development. His \nacknowledged influence as a theorist makes it important to determine what an account of SU \ndevelopment that is true to his theoretical ideas might look like, or, as is more likely, whether \ndifferent neoVygotskian accounts might be possible based on different combinations of his key \nconcepts.  \nFive Vygotskian Ideas \n At least five Vygotskian ideas are relevant to explaining the emergence of SU (see also \nFernyhough, 2004a). Although these ideas represent an integrated theoretical system, and thus \nresist attempts to consider them in isolation, evaluation of existing Vygotskian accounts is likely \nto benefit from clarity on the concepts from which they are founded. My aim in the remainder of \nthis section is to itemise these ideas and outline how they have been used in current theorizing \nabout SU development, before setting out a specific theoretical position in the sections that \nfollow.  \n The first idea that can be useful for accounts of SU development is that of internalization \n(Vygotsky, 1931\/1997). A view of SU development as involving the gradual and progressive \ninternalization of interpersonal exchanges can help us to make sense of the growing evidence \nthat children’s understanding of others is developmentally rooted in their experience of social \ninteraction. Vygotsky’s ideas about internalization involve a concept that is richer than that of \nsocial learning (or the assimilation of information made available in social contexts). Among the \nchallenges for contemporary theorizing about SU are firstly to pay attention to the syntactic and \nVygotsky and social understanding    9 \n \nsemantic abbreviation processes which transform the activity that is internalized, and secondly to \nconsider how internalization is itself constrained by existing SU competences.  \n The second concept that can help us to understand SU development is that of the zone of \nproximal development (Vygotsky, 1934\/1987, Ch. 6), which describes the difference between \nwhat children can achieve in isolation and with expert guidance. This notion allows us to \nunderstand how caregivers have a role in ‘packaging’ alternative perspectives on reality in such \na way that they can be readily assimilated by the children with whom they are interacting \n(Fernyhough, 1996). For example, appropriate and sensitively-pitched input from caregivers has \nbeen proposed to ‘scaffold’ (Wood, Bruner, & Ross, 1976) children’s developing SU (e.g., \nMeins, Fernyhough, Wainwright, Das Gupta, Fradley, & Tuckey, 2002).   \n A third relevant Vygotskian idea is that of naïve participation (Fernyhough, 2004a), in \nwhich, with adult guidance, children are drawn into practices that they will only later come to \nunderstand. For example, Bruner (1975) described how infants are initially able to agree with \nadults on a word’s correct use before they understand its meaning. Applying this idea to \nchildren’s use of mental-state terms, Nelson (1996) notes that children can use such terms before \nthey understand the concepts that constitute their referents. Similarly, in their theory of how \nsocial understanding is constructed within interactions with others, Carpendale and Lewis (2004) \nargue that an “initial, fragile social understanding” (p. 91) can, with the right sort of experience, \ndevelop into a full conceptual understanding of mind.  \n Fourthly, the role of semiotic systems (such as natural language) in mediating and \nenhancing children’s developing SU can be considered in light of Vygotsky’s (1930-1935\/1978) \nideas of language as a psychological tool that can augment pre-existing cognitive capacities. The \nterm mediation has a long history in the behavioral sciences, frequently being used to describe a \nsituation where one entity plays an intermediary causal role in the relation between two other \nVygotsky and social understanding    10 \n \nentities. In the more limited context of sociocultural theories of development, it can refer to the \nprocess whereby individuals’ understanding is refracted through the experience of others (e.g., \nChesnokova, 2004). In its stricter Vygotskian sense, mediation involves the use of culturally-\nderived psychological tools, such as utterances in spoken or sign language, in transforming the \nrelations between psychological inputs and outputs. As I shall argue later, the use of semiotic \nmediation in representing and reasoning about the mental states of others can crucially offset \nsome of the cognitive challenges of these processes.  \n The fifth idea concerns the dialogic nature of higher forms of cognition. Vygotsky did \nnot explicitly extend his remarks on the dialogicality of external social speech to the semiotically \nmediated, internalized cognitive processes that derive from it (Cheyne & Tarulli, 1999; Tappan, \n1997; Wertsch, 1980). As such, this idea retains a particular status as a thread that can be drawn \nout of a certain interpretation of Vygotsky’s writings, without representing a view that he \nexplicitly endorsed. Perhaps as a result, it is the aspect of his theory that has been considered \nleast in relation to SU development. A full examination of this idea and its implications for \ntheories of SU is presented in the second part of this article.  \n One further idea that is often mentioned in relation to Vygotsky’s ideas is enculturation \n(e.g., Astington, 1996; Nelson, Plesa Skwerer, Goldman, Henseler, Presler, & Walkenfeld, 2003; \nRaver & Leadbeater, 1993), according to which exposure to cultural norms of explaining \nbehavior allows children to “internalize the folk psychology of their particular culture” \n(Astington & Olson, 1995, p. 184). As Astington (2004) has noted, enculturation accounts do not \nnecessarily entail that children are passive participants in a process of absorption of cultural \nnorms. That said, it is important to remain critical about the interpretation of enculturation as a \nVygotskian concept. One point to note is that Vygotsky was interested in how specific \ninterpersonal relations shape individual cognition, and had little to say about cultural norms and \nVygotsky and social understanding    11 \n \npractices per se. Cultural influences, in his analysis, are largely restricted to particular patterns of \nsocial interaction (which are likely to be influenced by, but are not reducible to, broader cultural \npractices), and to the repercussions of the use of culturally-derived psychological tools (such as \nelements of natural language) in mediating cognition. Furthermore, Vygotsky’s concept of \ninternalization entails that patterns of interpersonal activity are fundamentally transformed in the \nprocess of being reconstructed on the plane of individual cognition. Children’s use of language, \nfor example, undergoes syntactic and semantic abbreviation in its transition from social speech \nto inner speech (Vygotsky, 1934\/1987). Without such transformations, the appropriation of \ncultural norms of explaining behavior should properly be considered an example of social \nlearning rather than internalization.  \nVygotskian Accounts of SU Development \n Existing accounts of SU development have drawn on different combinations of \nVygotskian themes. In this section, I review some of the most prominent of these accounts, with \na particular focus on how they have employed the key ideas itemised above. \n One of the first authors to make use of Vygotskian ideas in accounting for SU \ndevelopment was Nelson (1996). Nelson’s primary focus has been on children’s acquisition of \nconceptual SU through their entry into a ‘Community of Minds’ (Nelson, 2004; 2005; Nelson et \nal., 2003). Her work in this respect draws on a number of Vygotskian concepts, such as \ninternalization. Although the mediation of cognition by psychological tools (such as utterances \nin natural language) is also acknowledged to be important for cognitive development in general \n(e.g., Nelson, 1996), the full implications of mediation specifically for SU development are not \nspelled out. For example, in her consideration of the role of children’s own language in the \nconstruction of SU, Nelson’s (2005) focus is predominantly on the use of terms that directly \nrepresent mental state concepts. Although she considers how increasing facility with language \nVygotsky and social understanding    12 \n \nmay more generally augment children’s ability simultaneously to operate with differing \nrepresentations of reality, she offers no detailed account of how such complex representations \nemerge in ontogenesis, nor of how they relate to other key milestones such as the development of \nverbal mediation in non-mentalistic reasoning.  \n Another theoretical contribution to have emerged in recent years is that of Carpendale \nand Lewis (2004). In their integration of Piagetian, Vygotskian, and Wittgensteinian approaches, \nthese authors view SU as constructed through children’s experience of reflection on their own \nand others’ activity, in the context both of their experience of objective reality and others’ \nperspectives on that reality. They draw on a concept similar to the zone of proximal development \nto show how triadic engagement with others within the ‘epistemic triangle’ (Chapman, 1991) can \nscaffold children’s acquisition of the correct use of mental state terms and concepts. Although \nthey take care to show how such experience can account for the observed gradualism in \nchildren’s developing understanding of others, they are not clear about the importance of \nconcepts such as mediation, dialogue, and internalization (Fernyhough, 2004a). For example, \nthey note that “language mediates children’s knowledge of reality” (p. 89), without detailing \nhow this mediation might work nor committing themselves to a specifically Vygotskian (or \notherwise) reading of this term. Theirs remains, therefore, an essentially neoPiagetian account \nwhich sees no primary role for verbal mediation in SU. \n In another recent attempt to account for social influences on SU development, Symons \n(2004) draws on Vygotsky’s concept of internalization as a mechanism for children’s acquisition \nof self-other understanding through interpersonal engagement. This account places weight on \nchildren’s ability to participate in conceptual (and thus to some extent theory-driven) \nconversations about mental states, which is arguably not likely to occur until children have \nalready acquired some theory-like (see Note 1) mental state understanding. Symons argues that \nVygotsky and social understanding    13 \n \nconversations about mental states allow children to internalize concepts of self and other, which \ncan then be used as a basis for reasoning about the relations between mental states and behavior. \nAlthough Symons’ theory sees a role for the internalization of mental state language, there is no \nreference in his account to the syntactic and semantic transformations that Vygotsky proposed to \naccompany internalization, nor to how internalization is preferable to more orthodox conceptions \nof social learning as an explanation for a child’s mastering the usage of mental state terms and \nconcepts. \n Vygotskian concepts are also employed by Garfield, Peterson, and Perry (2001) in their \nexamination of the connections between mentalizing development and language acquisition. \nThey suggest that the observed associations between language ability and theory-of-mind \nperformance can be explained in terms of language constituting a second necessary condition for \nthe acquisition of SU, alongside early triadic engagement with others. Garfield et al.’s use of \nVygotskian ideas in accounting for these connections remains problematic, however. They offer \nno real detail on how language acquisition might interact developmentally with existing social-\ncognitive capacities, nor on what roles internalization and semiotic mediation might have in this \nprocess. Despite other valuable contributions, their account of SU development is therefore only \nVygotskian to the extent that it appeals to the principle of naïve participation, or children’s \nability to engage in social interactions before they fully understand them. \n A fifth theoretical contribution employing Vygotskian concepts is that of Tomasello et al. \n(2005). Central to this account is the distinction made by Tomasello, Kruger, and Ratner (1993) \nbetween intentional-agent understanding (which emerges between about 9 and 14 months, and \nunderpins infants’ developing ability to comprehend animate, goal-directed, and intentional \nbehavior) and mental-agent understanding (which is in place by about age 4, and equates to what \nothers [e.g., Perner, 1991; Wellman, 1990] have termed a ‘theoretical’ theory of mind). \nVygotsky and social understanding    14 \n \nTomasello et al. argue that the fusing of intentional-agent understanding with a motivation to \nparticipate in collaborations with others in which intentions, goals, emotions, and perspectives \nare shared (‘shared intentionality’) results in species-unique forms of cultural cognition. Of \nparticular interest is their claim that the internalization of interpersonal exchanges paves the way \nfor the construction of ‘dialogic cognitive representations’ on which participation in collective \nendeavours is founded. However, they explicitly reject a role for language in this early \ninternalization process, and thus, for this part of the developmental story at least, put themselves \nat odds with the view of development espoused by Vygotsky (Fernyhough, 2005).  \n My aim in the remainder of this article is to set out an alternative model of SU \ndevelopment which places particular emphasis on two implications of Vygotsky’s ideas: the role \nof semiotic mediation in mental functioning, and the dialogic nature of the higher mental \nfunctions. In the next section, I set out the main features of the Dialogic Thinking framework for \nunderstanding the development of the higher mental functions. I then attempt to show how the \nproposed model can fill some of the gaps in existing treatments of the issue, and leads to distinct \npredictions which are suggested as goals for future research.  \nThe Dialogic Thinking Framework \n The Dialogic Thinking (DT) framework (Fernyhough, 1996; 2004a; 2004b; 2005; in \npress) draws on Vygotskian and neoVygotskian ideas in exploring the implications of the \ninternalization of mediated interpersonal activity for individual cognition. In so doing, it \nhighlights an assumption implicit in Vygotsky’s writings but never properly examined by him: \nnamely, that the resulting forms of cognition preserve the dialogic nature of the interpersonal \nexchanges from which they derive. As described in more detail below, the internalization of \ndialogue necessarily entails the internalization of the alternative perspectives on reality \nmanifested in that dialogue, and the consequent restructuring of cognition to enable the \nVygotsky and social understanding    15 \n \nsimultaneous accommodationiii of multiple perspectives upon a topic of thought. I argue \nelsewhere that this view of cognitive development can account for the flexible, open-ended \nnature of human thought, as well as making sense of much of the evidence for social-\nenvironmental influences on cognitive development (Fernyhough, 1996; in press). \n The DT framework is thus an attempt to put some flesh on the venerable idea that \nthinking involves a conversation with oneself (Bibler, 1975\/1984; Janet, 1926; 1929; Mead, \n1934; Plato, undated\/1953; Rochat, 2001). Introspection tells us that we frequently ‘think in’ \nnatural language (Carruthers, 2002; Dennett, 1997; Hurlburt, 1990). Furthermore, the verbal \nthinking upon which we can sometimes introspect often appears to us as a kind of dialogue \nbetween distinct perspectives on reality (Fields, 2002; Tappan, 1997). The dialogic nature of \nhuman subjectivity has formed the basis of an important theory of self-organisation (Hermans, \n1996; 2002; Hermans & Kempen, 1993; 1995), and yet the cognitive-psychological implications \nof the dialogicality of human experience remain unexamined (Rochat, 2001). Although there has \nbeen some attempt to outline the psychological (Fernyhough, 1996) and neurobiological (Lewis, \n2002) preconditions for the emergence of internal dialogue, these approaches have to date \nprovided little in the way of testable hypotheses with which psychologists might work.  \n The key to understanding how dialogue can incorporate different, semiotically \nmanifested perspectives on reality lies in the work of the Soviet linguist and philosopher, M. M. \nBakhtin (e.g., 1986). Bakhtin’s ideas about the sociocultural situatedness of utterances in \neveryday language—that is, their ability to betray the position of the speaker with respect to the \nphysical and social worlds—have proved particularly fruitful for psychologists working within \nthe sociocultural paradigm (e.g., Cheyne & Tarulli, 1999; Hermans, 2002; Hermans & Kempen, \n1995; Tappan, 1997; Wertsch, 1980; 1991). Specifically, an assimilation of the Bakhtinian \nconcepts of voice and dialogue can provide a powerful extension of Vygotsky’s theory, capable \nVygotsky and social understanding    16 \n \nof speaking to some of the issues of most concern to modern developmental psychologists \n(Fernyhough, 1996; 1997; Fernyhough & Russell, 1997).  \n In Bakhtin’s theory, a voice is a way of speaking that reflects the perspective of the \nspeaker. By virtue of the fact that we each occupy a unique position in space and time, every \nspeaker has a unique perspective on reality which is reflected in the signs that individual uses to \ncommunicate with others. As well as betraying the perspective of the speaker, linguistic \nutterances typically reflect the perspectives of those who have used those words before, as well \nas being continually oriented towards a possible response from a real or imaginary interlocutor. \nOn this definition, dialogue is the phenomenon whereby differing perspectives on reality, \nmanifested in sign systems, come into ongoing and open-ended conflict. It was this ability of \nhuman discourse to accommodate multiple perspectives that, for Bakhtin, made dialogue the \nfundamental process in human meaning-making.  \n For present purposes, the most important aspect of Bakhtin’s work is his characterization \nof dialogue as involving a simultaneous accommodation of multiple perspectives (Fernyhough, \n1996; Holquist, 1990). The DT framework is founded on one important implication of this \nBakhtinian idea: namely that, in internalizing dialogic exchanges, the individual does more than \nmerely appropriate the utterances of the other. If Bakhtin is correct to claim that an individual’s \nutterances in dialogue are reflective of his or her orientation to reality, then the internalization of \ndialogic exchanges (or, in Vygotsky’s [1931\/1997] terms, their reconstruction on the \nintrapsychological plane) will necessarily involve some adoption of the other’s perspective. By \ntaking on the utterances of the other through the internalization of dialogue, one is also actively \nreconstructing some aspect of their perspective on physical and social reality. It is therefore \npossible to see certain forms of mental activity as an ongoing dialogic interplay between \ninternally reconstructed (internalized), semiotically manifested perspectives on reality \nVygotsky and social understanding    17 \n \n(Fernyhough, 1996; 2004a). The problem of understanding other minds thus shifts from the \nquestion of how an isolated epistemic subject could ever come to know about the non-observable \nmental states of another epistemic subject, towards a consideration of how such mental states \nmight be manifested in the concrete semiotic exchanges which are subsequently internalized to \nground the individual’s mediated thinking.  \n The emphasis on semiotic mediation is critical here. Of fundamental importance for our \nability to engage in interpersonal dialogues is our use of natural language (typically spoken \nlanguage, but also encompassing sign language) to describe reality for ourselves as agents, or to \nrepresent our intentional relations to reality. As Bakhtin (1984; 1986) noted, human languages \nare uniquely equipped to represent the speaker’s orientation to, or perspective on, reality. By \nrepresenting these intentional relations for ourselves in a systematically interpretable system of \nsigns, we give them a material form which crucially reduces the processing costs involved in \noperating with them (Clark, 1998; 2006). When this process becomes dialogic, individuals have \nthe basis for operating flexibly with the multiple perspectives of the people with whom they are \nsocially engaged, and thus eventually for understanding how orientations to reality can direct \nhuman behavior.  \nMy term for these semiotically manifested intentional relations is perspectives, by which \nI intend to pick out a set of orientations to the world that is specific to a particular physical, \ntemporal, and sociocultural location. Given the importance attributed by SU researchers to \nchildren’s understanding of epistemic states, it is worth considering how this concept of a \nperspective relates to the more familiar concept of belief. A perspective, as defined here, is not \nnecessarily a belief, although, as evidence for its veridicality is gathered, it may become one. For \na proclivity to believe to become an actual commitment to the truth of a proposition, information \nconcerning the subject’s own orientation to the world must be evaluated. The process of ‘belief \nVygotsky and social understanding    18 \n \nfixation’ (Fodor, 1983) must further involve the commitment to the truth of a proposition that \ncharacterizes genuine belief (Hamlyn, 1990). My suggestion here is that an individual who has \nacquired the capacity to conduct internalized, semiotically mediated dialogues will be able to \noperate with a range of often contradictory perspectives (used in the broad and inclusive sense \noutlined above) which, depending on the available information and the corresponding levels of \ncommitment to their truth, will vary in the extent to which they are held as occurrent or standing \nbeliefs. For example, I can participate in a debate about the existence of UFOs and temporarily \nadopt the different perspectives possible on the topic, without necessarily being committed to \nany of them as beliefs.  \n A second point is that the perspectives involved in mental dialogue are not exclusively \nperceptual. My account here owes much to that of Barresi and Moore (1996), who argue for a \nconstrual of the term intentional relations that incorporates perceptual and epistemic as well as \nconative and affective elements. In addition to a visual perspective on an element of reality, a \nperspective may thus involve an affective orientation to a situation (Hobson, 1995; Vygotsky, \n1934\/1987), a situated motivation to act, and so on. What is critical to the establishment of \ndialogue is firstly that these perspectives are semiotically manifested, and secondly that more \nthan one such perspective can be represented at the same time.  \n A third point to make about the interplay of perspectives in internal dialogue is that they \npreserve the triadic intentional relations (Barresi & Moore, 1996) of perspectives in external \ndialogue. That is, they bear relations to each other as well as to the element of reality to which \nthey are directed (Fernyhough, 2004a). These triadic intentional relations are depicted in Figure \n1 (similar depictions are found in Hobson, 1993, and Tomasello, 1999). Each agent has a \nperspective on (a) the ‘object’, or element of reality being jointly attended to (the thick lines in \nthe diagram); and (b) the other agent’s perspective on the object (thin lines). As in external \nVygotsky and social understanding    19 \n \ndialogue, the element of reality in question may or may not be physically present. Instead of the \nAristotelian logical relations of identity\/non-identity, the relations that obtain between \nperspectives are the dialogic relations of agreement\/disagreement (Hermans & Kempen, 1995). \nIn external dialogue, two or more linguistic agents typically share information, collaborate, \nargue, and so on, from distinct perspectives on reality. Even agreement, in dialogue, implies that \nthe agents concerned occupy different positions in the world (Hermans, 1996; Hermans & \nKempen, 1993). This difference in perspective is criterial for our describing an exchange as \ndialogue. As I shall argue below, the origins of internal dialogue in social exchanges with \nsensitive caregivers (particularly early triadic interactions centered around objects) ensures that \nthinkers are constantly open to the differing perspectives on reality offered by their interlocutors. \nIndeed, an implication of the DT framework is that the individual’s cognition is fundamentally \nstructured, through experience of social interaction, to expect such alternative perspectives. \n A final point about the dialogic interplay of perspectives concerns the extent to which it \nfollows the temporal patterning of external dialogue. Vygotsky (1934\/1987) argued that the \nreconstruction of external dialogue on the internal plane involved important structural and \nsemantic changes. For example, the development of inner speech is characterized as a continuous \nprocess of abbreviation, whereby ‘given’ information is omitted and only ‘new’ information \nincluded (Wertsch, 1979). Likening inner speech to cases of external dialogue where well-\nestablished shared assumptions between the interlocutors mean that only minimal overt speech is \nneeded, Vygotsky argued that the reduction of the “phonetic aspect” of inner speech ensures that \nit is “carried out almost without words” (1934\/1987, p. 275). One implication of this extensive \nabbreviation of inner speech is that mental dialogue develops away from the ‘give-and-take’ \npatterning of external dialogue, to a situation where multiple perspectives are represented at the \nsame time. It is this simultaneous accommodation of multiple perspectives that makes the \nVygotsky and social understanding    20 \n \nconcept of internal dialogue particularly useful in accounting for the developmental evidence \n(Fernyhough, 1996; 2004b). \n To summarize, the DT framework entails construing the higher mental functions as \ninvolving a simultaneity of multiple perspectives on reality, represented in systematically \ninterpretable sign systems such as natural language. These multiple perspectives preserve the \ntriadic intentional relations of interpersonal dialogue, and are routinely and flexibly co-ordinated \nin an open-ended and self-regulating manner.  \n Ontogenetically speaking, the DT framework holds that inner dialogue develops through \nthe internalization of semiotically mediated exchanges between individuals, following a \ndevelopmental trajectory from social speech, through the intermediary stage of private speech, \nand ultimately to fully covert inner speech (or verbal thought). This process of internalization is \naccompanied by processes of semantic and syntactic abbreviation, one result of which is the \ndiscarding of the linguistic ‘packaging’ of the perspectives involved, so that utterances in inner \ndialogue become less fully articulated in language. A second result is the abbreviation of the \ngive-and-take structure of external dialogue, so that multiple perspectives are manifested \nsimultaneously rather than in an alternating, temporally unfolding form (Fernyhough, 1996; \n2004b). Evidence for the syntactic abbreviation of children’s private speech has been provided \nby a number of studies (Feigenbaum, 1992; Wertsch, 1979; Winsler et al., 2003), suggesting \nsupport for Vygotsky’s account of the development of children’s overt and partially internalized \nspeech-for-self.  \n The following example illustrates some of these processes in action. This transcript was \ntaken from a three-and-a-half-year-old child solving a jigsaw puzzle (representing a lorry with \ndifferent colored blocks of ‘cargo’) in the presence of her mother (Fernyhough, 1994; C=child, \nM=mother; C’s utterances in bold type).  \nVygotsky and social understanding    21 \n \n  \nC: (Looks at model, places purple piece at correct location.) That goes there, does it? \n(Sees other purple piece already placed incorrectly.) Ah… (Looks at model.) That \nshouldn’t go there, should it? Who put that there? Not me. (Removes incorrectly \nplaced purple piece.) \nC:  (looking at model) Help… where’s the orange bit? (Points to model. Finds orange \npiece.) There. (Places orange piece at correct location.) Goes… in the corner.  \nC:  (Points to a gap where a cargo piece should go.) What goes there, then, Mummy? \n(Looks at model.) \nC:  White!     M: You tell me. (simultaneously) \n \n The dialogic nature of the child’s speech is clearly apparent in this extract. At several \nplaces the child appears to be asking questions of herself and then answering them. For example, \nin making the utterance “That shouldn’t go there, should it?”, the child adopts an alternative, \nadult perspective on the task and represents it for herself in overt speech while a response can be \ngenerated. In internalizing this dialogue, the child is consequently internalizing the adult’s \nperspective on this element of the taskiv. In addition, the child’s dialogue with herself is \nabbreviated relative to what would be expected in full external dialogue. From a Vygotskian \nviewpoint, the self-generated dialogue recorded here represents an intermediate step along the \npath of the internalization of external dialogue, during which children’s dialogue with \nthemselves becomes both more abbreviated and more covert. This process of abbreviation is \nfurther evidenced in a transition from expanded to condensed inner dialogue (Fernyhough, \n2004b), in the course of which the external-linguistic origin of the dialogue becomes \nprogressively more obscure.  \nVygotsky and social understanding    22 \n \n This developmental scheme is represented in Figure 2. As in Figure 1, thick lines \nrepresent each agent’s perspective on the object, while thin lines represent each agent’s \nperspective on the other’s perspective. At Level 1 (external dialogue), overt dialogue between \nchildren and caregivers displays the characteristic give-and-take structure of conversation. At \nLevel 2 (private speech), children begin to conduct these dialogues in their own overt (and then \ngradually subvocalised) speech-for-self. At this stage, the interlocutor’s contribution (P2 in the \ndiagram) is generated by the child (as, for example, in the above transcript, where the child both \ngenerates the question and answers it herself). At Level 3 (expanded inner dialogue), the give-\nand-take structure of external dialogue is manifested internally as a process of talking silently to \noneself. At Level 4 (condensed inner dialogue), the syntactic and semantic abbreviation of \nexternal dialogue is complete, and inner speech becomes a dialogic interplay between alternative \nperspectives which bears little structural or acoustic relation to the external dialogue from which \nit was derived. It is at this final stage that verbal thought becomes the act of “thinking in pure \nmeanings” described by Vygotsky (1934\/1987, p. 280).  \n It is important to note that this scheme is not intended to represent a one-way trajectory \nof development. Rather, it allows for movement between the four levels as processing demands \nchange. For example, demanding cognitive conditions may result in a transition from Level 4 \n(condensed) inner speech to Level 3 (expanded) inner speech, or even to Level 2 (private) speech \n(Fernyhough, 2004b). This is consistent with the evidence from introspection that we experience \na more explicit inner dialogue when a task is challenging (representing the Level 4 Æ Level 3 \ntransition). Under very demanding conditions, we may even speak to ourselves out loud (Level 4 \nÆ Level 2), an observation that is also consistent with the evidence that children’s (Behrend et \nal., 1989; Winsler & Diaz, 1995) and adults’ (Duncan & Cheyne, 2001) private speech increases \nunder cognitively challenging conditions. There appears to be a cognitive pay-off in reinstating \nVygotsky and social understanding    23 \n \nthe linguistic packaging of inner dialogue and holding it in phonological memory, or ‘farming it \nout’ to the speech articulation system for overt performance (Clark, 1998; 2006; Dennett, 1997).  \nExplaining Typical SU Development \n I now turn to considering what the DT framework can offer for our understanding of SU \ndevelopment. In this section, I suggest that an appreciation of the developing dialogicality of \nchildren’s thinking can fill two gaps in our current understanding. Firstly, it can help us to \nunderstand how experience of mediated social exchanges can build upon existing social-\ncognitive competences in effecting a transition from intentional-agent to mental-agent \nunderstanding. Secondly, the DT framework, with its emphasis on semiotic mediation, makes \npossible an interfunctionalv account of SU development which can make sense of the \noverwhelming evidence for a linguistic (or more general mediational) component in SU. \nFrom Intentional-Agent to Mental-Agent Understanding \n Any satisfactory account of SU development must be able to show how children’s \nbroadening opportunities for social interaction build upon and are constrained by their existing \nsocial-cognitive capacities. One challenge is to determine which innate or early-developing \nsocial-cognitive capacities underlie children’s later SU development. Another is to specify which \nkinds of social experience are relevant. Much progress has been made in recent years in \ndelineating the social-cognitive skills that infants bring to their earliest social interactions. \nAlthough there has been considerable debate about the timetable of infants’ developing \nunderstanding of others, there is an emerging consensus that infants entering the second year of \nlife have a conception of the caregiver as an intentional agent: that is, as an actor with \nintentional relations to reality. Tomasello et al. (2005) describe a developmental scheme \nwhereby infants progress from an understanding of other people as animate agents (6–9 months), \nthrough an understanding of the pursuit of goals (9–12 months), to an understanding of how \nVygotsky and social understanding    24 \n \nactors are able to choose rationally between different goal-directed action plans (12–14 months). \nEach milestone in social-cognitive competence makes possible a new advance in the \nsophistication of the infant’s social exchanges. At around 6 months, infants can interact directly \nwith another animate agent in dyadic interactions that involve sharing behavior and emotions. \nTowards the end of the first year, infants can share triadic goal-directed interactions with a social \npartner. At some time around 14 months, infants can cognitively represent the shared goals and \naction plans of the dyad. This fully-fledged intentional-agent understanding, coupled with the \nspecies-specific motivation to share intentions with others, forms the basis for children to engage \nin shared intentionality, or “collaborative actions in which participants have a shared goal \n(shared commitment) and coordinated action roles for pursuing that shared goal” (Tomasello et \nal., 2005, p. 680).  \n While both richer (Vaish & Woodward, 2005) and leaner (Moore & Corkum, 1994) \ninterpretations of the data on infants’ understanding of intentionality are possible, a full \nevaluation of this debate is beyond the scope of the present article. Rather, my focus will be on \nhow intentional-agent understandingvi is converted into richer forms of SU. My arguments will \ndraw on Tomasello et al.’s (1993) distinction between three levels at which a thinker can hold a \nconception of a person. In this view, the social-cognitive capacities typically investigated in SU \nresearch are a relatively late developmental achievement. It is not until around age 4 (the age at \nwhich children typically begin to succeed on standard false-belief tasks; Wellman, Cross, & \nWatson, 2001) that children treat others as mental agents, or as actors who hold representations \nof reality that may differ from their own. The third level of development is attained around age 6, \nwhen children come to conceive of others as reflective agents, understanding them as actors \ncapable of holding representations of their own representations of reality.   \nVygotsky and social understanding    25 \n \n The contribution that the DT model can make in this respect is in providing a link \nbetween intentional-agent and mental-agent understanding. Currently Tomasello et al.’s account \nhas little to say about the transition between these two levels of social-cognitive competence, not \nleast because they regard intentional-agent understanding to be the pre-eminent developmental \naccomplishment from which the most important species-specific forms of cognition flow. There \nare reasons for doubting this claim, however. Firstly, Tomasello et al.’s account appears to \nattribute considerable cognitive sophistication to 14-month-old infants, while leaving open the \nquestion of what remains for subsequent development to do in building upon these early social-\ncognitive achievements (Fernyhough, 2005). Secondly, Tomasello et al. remain uncommitted to \nany possible role for language in the developing capacity to operate with dialogic cognitive \nrepresentations. Thirdly, although Tomasello et al. appeal to a Vygotskian notion of \ninternalization in accounting for the construction of these representations, they admit that they \nhave no cognitive-developmental account of this process.  \n It is here that the DT model of SU development can be useful. On this account, the \ntransition between intentional-agent and mental-agent understanding is not a direct trajectory \ninvolving the gradual modification of underlying abstract epistemic structures (Nelson, 2005). \nRather, the link is indirect, and is mediated by language and other semiotic systems. The key to \nunderstanding the link between these two forms of understanding can be found in the social-\ncognitive consequences of the ability to operate with internal dialogues. In internalizing \ndialogue, and thus the semiotically mediated perspectives of their interlocutors, children’s \nthinking becomes permeated by a rich array of different perspectives (Fernyhough, 1996; \n2004a). To put it another way, engaging in an internal dialogue with a virtual other involves \ntaking on the perspective of that other. This adoption of the other’s perspective does not, in the \nearly stages of internalization, involve any reflective awareness of the multiplicity of \nVygotsky and social understanding    26 \n \nperspectives that make up internal dialogue (see Note 4). Just as young children are able, for \nexample, to adopt a role in sociodramatic pretence before they have any explicit metacognitive \nunderstanding of their role-taking (Perner, 1991), so too are children able to adopt the \nperspectives of others through fully or partially internalized dialogue before they attain a \ncomplete folk-psychological understanding of mind. For example, in the jigsaw puzzle example \ngiven above, the child is able to adopt perspectives previously held by the adult without \nnecessarily showing any metacognitive or metalinguistic awareness that this is happening. \nRather than seeing internal dialogue as being dependent upon the pre-existence of a fully-fledged \nrepresentational theory-of-mind, the DT model holds that any such folk-psychological \ncompetence is a relatively late-developing outcome of, inter alia, the internalization of dialogue.  \n The DT model may therefore explain how children are able to operate with other \nperspectives in the absence of any folk-theoretical understanding of how mental states determine \nbehavior. Another way of looking at this is to consider the role played by representations of \nmental representations in the DT model, as compared to alternative theories. Theory-theory \naccounts of SU development (e.g., Perner, 1991) typically require that, at some point in the \ndevelopmental process, children acquire the capacity to represent the mental states of others and \nuse such representations to predict and explain behavior. As several authors have pointed out \n(e.g., Carpendale & Lewis, 2004; Nelson, 1996), some such accounts make considerable \ncognitive sophistication (the ability to reason with metarepresentations) a prerequisite of \nimportant developments in SU, as well as paying insufficient attention to the gradual, socially-\nembedded nature of SU development. In contrast, the DT model would see representations of \nmental states as relatively late-occurring products of SU development. The only sense in which \nyoung mind-readers are required to represent the mental states of others is the extent to which \nVygotsky and social understanding    27 \n \ndialogic, mediated social exchanges already represent the different perspectives of the \nparticipating agents. \n A second point is that external and internal dialogue involves a simultaneous multiplicity \nof different perspectives. Success on many theory-of-mind tasks requires more than simply the \nability to represent another epistemic subject’s mental representation of a state of affairs; it \nentails the further requirement that this alternative perspective on reality be represented \nalongside the participant’s own perspective. Consider, for example, the unexpected-transfer task \ndescribed by Wimmer and Perner (1983). In the most common version of this task, a child sees a \nprotagonist’s desired object moved from one location (say, a blue box) to another (say, a red \nbox) in the protagonist’s absence. Success on such a task (i.e., correctly predicting where the \nprotagonist will look for his or her object) requires more than a simple overwriting of the child’s \nown perspective (‘the object is in the red box’) with that of the naïve protagonist (‘the object is \nin the blue box’). Rather, it requires that the child be able to hold both the naïve and informed \nperspectives about the state of affairs at the same time (Fernyhough, 1996; 2004a).  \n This need to account for the simultaneous accommodation of different perspectives \npresents a challenge to those theory-theoretical accounts which trace the understanding of \nperspectival difference to specific high-level cognitive capacities. In Perner’s (1991) theory, for \nexample, the relatively sophisticated function of metarepresentation is invoked to explain how \nchildren are able to compare two representations of the world. Other theory-theoretical accounts, \nsuch as that of Bartsch and Wellman (1995), address evidence that the understanding of \nperspectival difference is evidenced some time before children achieve success on formal tests of \ntheory-of-mind reasoning. Bartsch and Wellman’s analysis of children’s use of contrastives \n(Shatz, Wellman, & Silber, 1983) demonstrates that young children can represent perspectival \ndifference in their own speech before they would be expected to pass false-belief tasks. \nVygotsky and social understanding    28 \n \nContrastives can be construed as elements of speech which incorporate different possible \nperspectives on reality, such as the difference between an epistemic state and reality, or between \ntwo individuals’ differing thoughts about the world. For example, Bartsch and Wellman report \nthree-year-old Adam’s utterance, “It’s a bus; I thought a taxi.” (p. 206). In subsequent work \n(Wellman & Liu, 2004), meta-analytical data have been combined with findings from a new task \nbattery to show that children’s understanding of diverse beliefs precedes their understanding of \nfalse belief. Such evidence is consistent with the idea that children become able to represent \nperspectival difference (in dialogic private speech and inner dialogue) before they acquire the \nconceptual understanding of mind proposed by theory-theorists to be necessary to represent false \nbeliefs. Bartsch and Wellman’s careful analysis of contrastives involving mental-state terms has \nyet to be replicated for utterances that represent perspectival difference without any explicit \nreference to mental states, such as the private speech illustrated in the jigsaw example above. \nUntil such research can be conducted, it is worth noting that contrastives were relatively \nuncommon in Bartsch and Wellman’s (1995) database, raising the possibility that they will be \noutnumbered by utterances in which children represent different perspectives without explicit \nreference to mental states. The DT model would hold that such multi-perspectival utterances will \nrepresent a natural outcome of the internalization of perspectives proposed to result from the \ninternalization of dialogue.  \n The DT model thus gains support from evidence that young children use language to \nrepresent different simultaneously-held perspectives on reality. A similar emphasis on \nsimultaneity is present in Gordon and Olson’s (1998) argument that mentalizing performance is \nlikely to be limited by children’s ability to update information that they are already holding in \nmind. One way of offsetting the cognitive challenges involved is to assign different \nrepresentations to different social agents (Meins & Fernyhough, 2007). In terms of the DT \nVygotsky and social understanding    29 \n \nmodel, this capacity is underpinned by children’s ability, in inner dialogue, to assign different \nrepresentations to different virtual interlocutors, and thus simultaneously hold multiple \nperspectives in mind. In the case of the behavior-prediction unexpected transfer task mentioned \nabove, this might occur through the child’s conducting an abbreviated inner dialogue in which \nthe perspectives of both protagonists (‘the object is in the red box’ and ‘the object is in the blue \nbox’) are manifested simultaneously. Note that such a situation would not require the child to \nrepresent the beliefs (here, perspectives) of the protagonists, beyond the extent to which they are \nalready represented in the internal, condensed dialogue. When it comes to predicting the \nbehavior of the naïve protagonist, the child will have a representation of the relevant perspective \non the basis of which to compute a predicted response, without any necessary conceptual \nunderstanding of that perspective as a belief. Children’s justifications of their own responses on \nthe task might involve conceptual mental-state language, but this would not be a necessary \ncorollary of success on this task.   \n Several implications follow from this view of children’s behavior on the unexpected \ntransfer task. Firstly, it remains an open empirical question whether children employ private or \ninner speech while engaged in this task. As far as private speech is concerned, it is worth noting \nthat overt private dialogues might be relatively uncommon in such instances, if internalization is \nalready established (as Vygotsky’s theory would predict) by this age. Further, there are several \nreasons why classic false-belief tasks might not be ideal contexts for eliciting private speech, \nsuch as that they do not encourage children to adopt a protracted reasoning process in producing \nan answer (Carpendale, Lewis, Susswein, & Lunn, in press). An alternative might be that \nchildren conduct private dialogues in condensed or expanded inner speech, the empirical study \nof which can of necessity only be indirect. One possibility would be to employ a dual-task \nparadigm to assess whether interference with children’s phonological processing (for example, \nVygotsky and social understanding    30 \n \nthrough articulatory suppression) compromises their SU task performance. Future studies might \nalso investigate the relative contribution of dialogic SU to children’s developing mastery of the \nhierarchy of tasks described by Wellman and Liu (2004). It may be that internal dialogue is \nsufficient for success on those tasks at the lower and middle stages of the hierarchy (such as \nthose requiring an understanding of knowledge access and explicit false belief), while additional \nconceptual SU is necessary for those tasks higher up in the hierarchy (such as that requiring an \nintegration of information about belief and emotion). A further possibility for future research is \nto investigate manipulations to classic false-belief tasks in which children are directly invited to \nuse dialogic reasoning, either through presenting the task materials in the form of a dialogue, or \nby providing a dialogic context within which children can make their responses. If the DT model \nis accurate, such manipulations would be expected to produce success on false-belief tasks at \nearlier ages than would be observed on the tasks’ formally identical classic equivalents.  \n On the present model, success on typical theory-of-mind tasks involves not so much the \nalteration of a body of conceptual knowledge as the development of an ability to accommodate \nmultiple perspectives simultaneously in predicting and explaining behavior. Thanks to their \nexperience of social situations in which alternative perspectives on reality are readily offered \n(Fernyhough, 1997; see below for further discussion of caregiver input in this respect), children \nalready have the ‘open slot’ (the ability to accommodate the alternative perspective of an \ninterlocutor) necessary for engaging in internal dialogue before they begin to demonstrate formal \ntheory-of-mind competence. One consequence of this is that children will show early SU \ncompetence in naturalistic contexts, such as has been observed to occur some time before \nchildren are successful on formal tests of false-belief understanding (Carpendale & Lewis, 2004; \nLewis, 1993; Tomasello et al., 1993). For example, Wellman and Liu (2004) showed that an \nunderstanding of the diversity of desires precedes an equivalent understanding for beliefs, \nVygotsky and social understanding    31 \n \nallowing children to be successful on tasks such as judging that another person will desire an \nobject that does not match one’s own desire (see also Wellman, 1990). From the perspective of \nthe DT framework, this kind of SU is not dependent upon a formal, folk-psychological theory of \nmind, but rather on the fact that children’s early interpersonal experience ensures that, even in \ntoddlerhood, they are open to the alternative perspectives of their social partners.  \n The DT model thus outlines how gradually more sophisticated levels of SU can emerge \nthrough the interactions made possible by more primitive forms of understanding. Specifically, \nthe engagement in interpersonal exchanges necessary for the internalization of dialogue is \ndependent upon the child attaining intentional-agent, though not necessarily mental-agent, \nunderstanding. Furthermore, the principle of naïve participation is as relevant here as it is in the \narea of language acquisition (Nelson, 2004). That is, infants are able to participate in \ninterpersonal dialogic exchanges long before they demonstrate any conceptual understanding of \nother minds (Hobson, 1993; Rochat, 2001; Trevarthen, 1980). This evidence suggests that \nopportunities for the internalization of dialogue, which Vygotsky considered to begin very early \nin development, exist during the prelinguistic gestural dialogues of infancy, and continue \nthrough early verbal exchanges. This explains how there can be very early, pre-theoretical SU \nwhich stems directly from the child’s engagement in patterned interpersonal exchanges in which \nalternative perspectives on reality are routinely and readily offered. The specific types of social \nexperience which might be relevant here are considered in the next section.  \nThe Role of Semiotic Mediation \n The acquisition of language in the second year of life transforms the child’s opportunities \nfor social interaction. One consequence of language acquisition is that infants begin to engage in \nlinguistic dialogues with caregivers and other social partners, and thus begin the process of \ninternalization of these dialogues into overt self-directed (private) and ultimately inner speech \nVygotsky and social understanding    32 \n \n(Vygotsky, 1934\/1987). As described in the previous section, the DT model holds that the \nemergence of dialogic forms of thought, within which different semiotically manifested \nperspectives can be represented simultaneously, forms the basis of the individual’s ability to \noperate with the perspectives of others.  \nThe suggestion that language has a critical role to play in SU development is not a new \none. Astington and Baird (2005b) categorize previous attempts to understand the role of \nlanguage in SU development as involving conversational pragmatics (exposure to the differing \nperspectives of social partners; e.g., Harris, 1999; Lohmann & Tomasello, 2003), lexical \nsemantics (learning the correct usage of mental state terms; e.g., Peterson & Siegal, 2000), and \ncomplementation syntax (acquiring, through language acquisition, a grasp of the syntactic \nstructures necessary to use mental-state language to attribute differing perspectives to others; \ne.g., de Villiers & de Villiers, 2000). Each of these theoretical alternatives makes different \npredictions about what kinds of language input will be important, and in which kinds of social \ninteraction these forms of input might be expected to be embedded. In this section, I examine the \npredictions made in this respect by some prominent examples of each of these approaches, and \ncompare them with those made by the DT model.  \nWhat Astington and Baird (2005b) term the conversational pragmatics approach has been \npioneered by Harris (1996; 1999; 2005; see also Tomasello, 1999). In Harris’ discourse-based \nmodel, any interactions which expose children to alternative perspectives on reality will be \nexpected to lead to improvement on theory-of-mind tasks. In contrast, syntax-based accounts \n(e.g., de Villiers & de Villiers, 2000) would predict that only language input which enhances \nchildren’s understanding of complement-taking verbs (such as think) will lead to improvements \nin SU. Harris’s proposals gain support from training studies which have attempted to determine \nthe importance of language that presents evidence for perspectival difference. For example, \nVygotsky and social understanding    33 \n \nLohmann and Tomasello’s (2003) findings suggest that exposure to perspective-shifting \ndiscourse (requiring children to adopt alternative, linguistically-represented perspectives on the \nsame element of reality) and sentential complement syntax make independent contributions to \nimprovements in theory-of-mind reasoning. Particularly important forms of discourse in this \nrespect are disagreements about the truth of a proposition, adults’ misinterpretations of \nchildren’s utterances, and adults’ clarification requests. These serve to draw children’s attention \nto the fact that adult interlocutors’ perspectives on the world do not necessarily coincide with \ntheir own. Lohmann, Tomasello, and Meyer (2005) suggest that the form of discourse that is \nmost powerful in conveying these lessons is reflective discourse which involves adult and child \ncommenting on ideas previously expressed in the exchange. In terms of the DT model, all of \nthese forms of perspective-shifting discourse exemplify the simultaneous multiplicity of \nperspectives that defines dialogue. Furthermore, they do not necessarily entail specific reference \nto mental states, meaning that the kinds of discourse contexts that are likely to lead to progress in \nSU development are not limited to those in which the psychological world is the focus of \nattention. \nIn his evaluation of this and related studies, Harris (2005) suggests that “discourse that \nemphasizes different points of view with regard to the same event or object is sufficient to lead \nto an improvement in children’s performance on standard theory-of-mind tasks” (p. 76). In \ncontrast, he interprets the evidence from training and other studies as meaning that the mastery \nof complement structures is of only limited importance in SU development. For example, in Hale \nand Tager-Flusberg’s (2003) training study, improvements in theory-of-mind performance \nfollowing training with perspective-shifting discourse could not be attributed to increased \nmastery of complement structures. Harris admits, however, that the growing evidence for the \nimportance of perspective-shifting discourse is difficult to explain in terms of existing theoretical \nVygotsky and social understanding    34 \n \nalternatives. In particular, it is unclear how exposure to different perspectives (without reference \nto mental states) can promote the reorganization of existing conceptual knowledge about the \nmind (as theory-theoretical accounts might expect) or else enhance children’s ability to project \nthemselves imaginatively into other people’s subjective states (as simulation theories might \nrequire).  \n The DT model provides a potential solution to this conundrum. The internalization of \ndialogue leads to a fundamental restructuring of children’s cognition which allows multiple \nperspectives to be represented simultaneously. As the earlier discussion about the relation \nbetween perspectives and beliefs suggests, these different points of view on reality do not need \nto be couched as epistemic states. For example, consider the following exchange of alternative \nperspectives, in which a child says “It’s raining,” followed by the caregiver’s response, “The sun \nseems to be breaking through.” On Harris’ discourse-based model, this kind of exposure to \nalternative points of view (corresponding to, for example, the Discourse Only training condition \nin Lohmann and Tomasello’s [2003] study) should lead to improvements in theory-of-mind \nperformance. Not only is there no explicit reference to epistemic states in this exchange, there is \nalso no necessity for each perspective to have, for each respective interlocutor, the status of an \nepistemic state. Since perspectives are not necessarily beliefs (see above), there is no need for \nthe interlocutors to be committed to the truth of their propositions. Dialogue represents \nalternative perspectives while giving no direct information about epistemic states, in part \nbecause, as argued earlier, perspectives do not have to correspond to epistemic states.  \n Lohmann et al. (2005) take a slightly different view of the studies reviewed by Harris \n(2005). They suggest that evidence for the efficacy of perspective-shifting discourse can be \naccommodated alongside findings about the value of training in propositional attitude \nconstructions (which merely represent grammaticized versions of the looser discourse structures \nVygotsky and social understanding    35 \n \nrepresented in perspective-shifting discourse). Despite the common ground between Lohmann et \nal.’s discourse-based account and the DT model, important distinctions remain. Crucially, \nLohmann et al. offer no cognitive-developmental account of how exposure to perspective-\nshifting discourse has its developmental effects, nor do they offer any analysis of what \n‘perspective’ means in this respect. They mention Vygotskian internalization as a possible way \nin which children “begin to develop concepts and social-cognitive skills” (p. 249) but take no \nposition on the importance of semiotic mediation and other processes in this developmental \nstory. Rather, they seem to endorse a theory-theoretical account of SU development, in which \nchildren, through exposure to perspective-shifting discourse, are able to relate different, \nlinguistically-manifested perspectives to their own beliefs about the world. Theirs is therefore \nessentially an individualistic account which sees SU development as involving a growing body \nof knowledge about the social world.  \n Discourse-based models thus draw attention to the question of whether what matters for \nSU development is specifically exposure to perspectives on reality couched in terms of mental \nstates, or exposure to any perspective-shifting discourse (not necessarily involving mental-state \nreferences). A second class of theories, those concerned with lexical semantics, have argued for \nthe primacy of exposure to language involving explicit references to mental states. In their \naccount of how SU is constructed in the context of interactions within the epistemic triangle, \nCarpendale and Lewis (2004) argue for the importance of communicative exchanges in which \nchildren learn to talk about the psychological world by reflecting on their own and others’ \nactivity. For example, exposure to discourse involving mental-state terms is held to be crucial for \nlearning the criteria for correct application of these terms. Although Carpendale and Lewis \nexplicitly reject a theory-theoretical account of SU development, their account nevertheless \nentails that it is only talk in which beliefs, desires, intentions, and so on are the focus of attention \nVygotsky and social understanding    36 \n \nthat should help children in learning to talk about the psychological world. While Carpendale \nand Lewis can account for the evidence for social-environmental influences on SU development \nin terms of the extent to which the child’s relationships are ‘cooperative’ (Piaget, 1932\/1965), \nthey must still maintain that the relevant exchanges within such relationships be focused on the \npsychological world. In contrast, the DT model and other discourse-based approaches would \nhold that any dialogic exchanges, not only those that are about psychological processes, can \nenhance SU development. What matters is that the child is exposed to different perspectives; it is \nnot important that these should involve talk about beliefs, desires, and intentions.  \n Some recent empirical findings are relevant here. Peskin and Astington (2004) obtained \npre- and post-training measures of theory-of-mind performance for 4-year-olds in two \nconditions, one in which children were read picture books modified to include high frequencies \nof metacognitive language, and one in which the same pictures implicitly required participants to \nthink about alternative perspectives, while not being accompanied by any explicit metacognitive \nlanguage. Children in the second group (no metacognitive language exposure) scored more \nhighly on a battery of false-belief tasks than those in the first group (who had been exposed to \nmetacognitive terms). Peskin and Astington concluded that exposure to explicit metacognitive \nlanguage may be less important in theory-of-mind development than experience of situations \nwhere one is required actively to construct mentalistic interpretations of behavior. Such an \ninterpretation is consistent with the view that it is language (specifically dialogue) that \nrepresents the content of differing mental states, rather than being about those mental states (in \nany theoretical or metacognitive sense), that is of primary importance in SU development.  \n That is not to say that conversations explicitly focused on mental states can play no role \nin children’s developing SU. Firstly, talk involving mental states, such as the conversations \ninvolving contrastives described by Bartsch and Wellman (1995), will frequently involve the \nVygotsky and social understanding    37 \n \nexchange of alternative perspectives argued to be important for SU. Secondly, to the extent that \nchildren eventually develop a folk-psychological theory of mind, talk about specific theory-\ntheoretical concepts such as beliefs and desires will undoubtedly be important in acquiring those \nconcepts. Thirdly, the evidence for children’s early use of such terms (e.g., Shatz et al., 1983) \nsuggests that such linguistic expressions might have some value in reifying others’ unobservable \nmental states, without necessarily forming part of any theory-theoretical systemvii. \n All of these potential benefits of exposure to mental state language should be considered \nsecondary to the developmental implications of the internalization of dialogue. Other \nimplications of the DT model which distinguish it from alternative discourse-based models, \nparticularly relating to the importance of semiotic mediation, are considered in the next section. I \nconclude this section by returning to the issue with which it began, namely how to explain the \ntransition from intentional-agent to mental-agent understanding. The developmental pathways \nthrough which this transition is proposed to be effected are represented in Figure 3. Two caveats \nneed to be made in relation to this figure: firstly, it is intended to show general developmental \npatterns rather than specific causal pathways, and secondly, it incorporates ideas from a variety \nof theoretical accounts, not all of which share the Vygotskian perspective outlined here. Items in \nthe middle column of the figure represent the levels of social-cognitive competence attained at \ndifferent ages, while items in the right-hand column depict the changing interactional \nexperiences with which individuals are involved from birth. Thick arrows represent primary \ndevelopmental pathways; thin arrows represent secondary pathways. One purpose of this \ndiagram is to illustrate how the development of social-cognitive competence is constrained by \nand in turn constrains the types of social experience individuals can enjoy (Tomasello et al., \n1993). In addition, the diagram demonstrates how caregivers’ ability or willingness to construct \nsuch interactions can have profound implications for children’s developing SU. \nVygotsky and social understanding    38 \n \n These roles of caregivers and other social partners take two main forms. Throughout \ninfancy and the preschool years, caregivers are frequently observed to construct gesturally and \nlinguistically mediated dialogues with their children in which the intentional stance is taken \n(Fernyhough, 1996, 2004a; Garfield et al., 2001). Specifically, they have a role in offering \nalternative perspectives on reality in such a way that they can be readily assimilated, such as, for \nexample, in their early triadic interactions centred around objects (Hobson, 1993), their verbal \nscaffolding of children’s performance on complex cognitive tasks (Wood, Bruner, & Ross, \n1976), or their pitching of tutoring interventions within the zone of proximal development \n(Meins, 1997). For example, Meins (1997) describes how a mother rated as sensitive in her \ntutoring strategies goes to some lengths to provide alternative perspectives on a collaborative \nbox-construction task (particularly suggesting turning over pieces that did not previously fit) that \nare tailored to the child’s current level of functioning. Children’s experience of reciprocal \nexchanges with caregivers in which alternative perspectives are routinely offered, coupled with \nthe fact that they have internalized this mediated activity, ensures that individuals’ thought \nremains constantly open to the alternative perspectives provided by a real or virtual interlocutor.  \nDuring the period that follows the emergence of intentional-agent understanding, \nlanguage input from caregivers has an important secondary role in scaffolding the acquisition of \nfolk-psychological mental state terms and concepts (Meins et al., 2002; Carpendale & Lewis, \n2004). As discussed in the next section, individual differences in caregivers’ ability or \nwillingness to structure children’s social input will be reflected in individual differences in \nchildren’s attainment of milestones in SU. In this scheme, the construction of a theory-\ntheoretical understanding of mind is both a relatively late achievement, and one which is \ndevelopmentally dependent upon the child’s internalization of the alternative perspectives \nencountered in early interpersonal exchanges. \nVygotsky and social understanding    39 \n \n An obvious objection here is that the DT model places too much emphasis on natural-\nlanguage competence, and would thus exclude prelinguistic typically developing infants, and \nchildren with sensory impairments (e.g., deafness) and developmental disorders (e.g., \ndevelopmental dysphasia). The DT model avoids this charge by making explicit that any \nsystematically interpretable system of signs can form the basis of internalized dialogue. It would \nthus incorporate both sign languages and prelinguistic gestures such as pointing, both of which \nhave been shown to be internalized in a Vygotskian fashion (Delgado & Montero, 2005; Goldin-\nMeadow, 1999). In the next section, I consider how this model can help to explain individual \ndifferences in SU relating to different social experiences. In the final section, I consider how \nlimitations in the child’s experience of interpersonal dialogue, such as might stem from sensory \nimpairment or developmental disorders, will have consequences for the child’s developing SU.  \nExplaining Individual Differences in SU Development \n Since the groundbreaking studies of Dunn and colleagues (e.g., Dunn, Brown, \nSlomkowski, Tesla, & Youngblade, 1991), an impressive body of work has grown up relating \nindividual differences in SU to specific social-environmental influences (see Carpendale & \nLewis, 2006, and Hughes & Leekam, 2004, for reviews). Dunn et al. (1991) found that children’s \ntheory-of-mind performance at 40 months was predicted by their exposure, seven months earlier, \nto causal talk about mental states and by mothers’ attempts to control the behavior of siblings. In \nexplaining these and related findings, Dunn (1994) argued that certain types of family-based \nsocial interaction are important for SU development because of the opportunities they provide \nfor learning about others’ differing orientations to reality. As Carpendale and Lewis (2006) point \nout, this and other important studies nevertheless fall short of explaining precisely which aspects \nof interaction with siblings and other family members are most valuable in promoting SU \ndevelopment.  \nVygotsky and social understanding    40 \n \n In this section, I focus on predictions made by the DT model with respect to three \nparticular issues. Firstly, I consider what kinds of interaction are likely to have the greatest \ninfluence on children’s developing SU, and when in development those effects might be most \nlikely to occur. Secondly, I examine the DT model’s predictions about how SU development \nrelates to the emergence of semiotic mediation in other cognitive domains. Thirdly, I consider \npredictions following from the DT model in relation to issues around culture and enculturation.  \nQuality and Timing of Social Input \n The developmental scheme outlined above makes several predictions about what kinds of \nsocial experience should relate to children’s developing SU. One factor that may contribute to \ncaregivers’ ability to construct effective dialogues with their children is their willingness to \nadopt the intentional stance in interactions with their children, or their mind-mindedness (Meins, \n1997; Meins, Fernyhough, Russell, & Clark-Carter, 1998; Meins et al., 2002; 2003). In a series \nof longitudinal studies, Meins and colleagues have found maternal mind-mindedness \n(operationalized in terms of mothers’ appropriate linguistic references to their infants’ internal \nstates) to be a stronger predictor of children’s later theory-of-mind performance than other key \nsocial-interactional variables such as security of attachment and maternal sensitivity (Meins et \nal., 2002). It still remains to be determined how mind-mindedness relates to the quality of \ndialogues between infant and caregiver, although its proven value in predicting attachment \nsecurity (Lundy, 2003; Meins et al., 2001) suggest that it represents “one facet of a broader \nattunement between mother and infant” (Meins, 2004, p. 116).  \n In the developmental scheme outlined in Figure 3, children’s social partners have a part \nto play at two main stages: the initial construction of triadic interactions and subsequent \nlinguistic dialogic exchanges (from birth to around age 2), and the construction of conversations \nabout mental states (from age 2 onwards). Mind-minded caregivers will be influential at both \nVygotsky and social understanding    41 \n \nstages in presenting alternative perspectives on reality in such a way that they can be readily \ninternalized. For example, discourse that involves scaffolding has been shown to encourage the \ninternalization of self-regulatory dialogues, evidenced as private speech (Winsler, Diaz, & \nMontero, 1997). Meins et al.’s (1998) findings from a complex box-construction tutoring task \nshowed that mothers’ sensitivity in scaffolding their children’s performance (defined as their \nwillingness to adjust the specificity of their tutoring interventions in response to child feedback) \nwas positively correlated (with a non-significant medium effect size) with their mind-\nmindedness in an interview requiring them to describe their children. If these preliminary \nfindings are confirmed by future studies, it will additionally be important to determine which \npoint of caregiver input is most critical for the child’s developing SU. In their longitudinal study, \nMeins et al. (2003) presented evidence that it was early, rather than later, mind-mindedness that \nwas most important in fostering the development of SU. In contrast, those theories that have \nemphasized caregivers’ roles in encouraging conversations specifically about the psychological \nworld (e.g., Carpendale & Lewis, 2004; Symons, 2004), as opposed to constructing dialogues in \ngeneral, would seem to entail the prediction that later, rather than earlier, caregiver input would \nbe of most importance.  \n In summary, more research is needed to determine: 1) the kinds of social interaction that \nare important for SU development, 2) how these relate to other social-environmental variables \nthat have been postulated to play a role, 3) how any influence of caregivers in promoting the \ninternalization of dialogue translates into objective indices of internalization such as private \nspeech, and 4) at what points in development these influences have their greatest effects. A focus \non children’s involvement in dialogues with caregivers and other social partners may help to \ndirect research in this area, and to remedy the fact that existing relational theories of SU \nVygotsky and social understanding    42 \n \ndevelopment give few details about the kinds of caregiver intervention that are most likely to \nfacilitate SU construction (Meins, 2004).  \nSU Development and the Shift to Verbal Mediation \n  The DT model’s linking of SU development to the internalization of dialogue \ndistinguishes it from neoPiagetian accounts which postulate no specific role for language or \nother semiotic systems in SU reasoning. For example, Carpendale and Lewis (2004; 2006) claim \nan important role for language in the construction of conversations in which children develop \n“the ability to talk about the psychological world” (2006, p. 239), without aligning themselves to \na Vygotskian view of mediation (Fernyhough, 2004a). Similarly, Lohmann et al.’s (2005) \ndiscourse-based account envisages no role for semiotic mediation. On their account, language is \nseen as a source of information about the social world, but it is not suggested that it plays any \nconstitutive role in reasoning about social processes. Indeed, such a role for language is \nexplicitly rejected in Tomasello et al.’s (2005) related account. Empirically speaking, this leads \nto one important point of divergence between the DT model and the theories of Carpendale and \nLewis (2004) and Lohmann et al. (2005). Specifically, the DT model would entail that SU is \ndevelopmentally linked with the emergence of semiotic mediation in other cognitive domains. \nFor example, it would predict that SU development will proceed in parallel with the emergence \nand subsequent internalization of self-regulatory private speech, which, according to Vygotsky, \nprovides a window onto the development of verbal mediation of thought and behavior.  \n In order to understand how the interfunctional (Vygotsky, 1934\/1987; see Note 5) \nrelations between SU and private speech might unfold over the preschool and early school years, \nit is useful to consider Vygotsky’s claims about the developmental course of verbal self-\nregulation. In this analysis, private speech follows a quadratic developmental trajectory through \nearly and middle childhood, emerging in the preschool years and subsequently ‘going \nVygotsky and social understanding    43 \n \nunderground’ (Vygotsky, 1934\/1987) to form inner speech (or verbal thought). Evidence for this \ncurvilinear relationship has been provided by several studies (e.g., Kohlberg, Yaeger, & \nHjertholm, 1968; Winsler & Naglieri, 2003). One would therefore predict that correlations \nbetween private speech and laboratory assessments of SU will differ according to whether \nchildren are observed during the waxing or waning phases of private speech. Specifically, such \ncorrelations should be positive during the phase in which private speech is emergent, and should \nthen turn negative in the period during which private speech is becoming more covert, as \nchildren who are further along the road of internalization use less overt self-directed speech.  \n  To test this hypothesis, Fernyhough and Meins (in press) investigated whether self-\nregulatory private speech and theory-of-mind performance demonstrated changing patterns of \nassociation with increasing age. In three separate cross-sectional studies conducted with children \nof 49, 56, and 71 months, these authors obtained measures of SU through age-appropriate \ntheory-of-mind tasks. Private speech measures were obtained from free-play interactions (49 \nmonths) and from problem-solving episodes focused on an executive task (56 and 71 months). \nPartial correlations, controlling for age and verbal ability, were computed for the relation \nbetween self-regulatory private speech and theory-of-mind performance. In accordance with \npredictions, the sign of the correlation between private speech and theory-of-mind performance \nchanged from positive in the youngest children (r = .51, p < .05), to almost zero (r = -.11, n.s.) in \nthe middle age-group, to negative in the oldest group (r = -.48, p < .005). The authors argued that \nthis pattern is consistent with the assumption that continued use of overt self-regulatory speech \nin middle childhood reflects a delay in the process of internalization (as, according to Vygotsky, \nsuch speech has typically been internalized by this point), and would therefore be expected to be \nassociated with poorer theory-of-mind performance.  \nVygotsky and social understanding    44 \n \n Despite certain methodological limitations (such as their cross-sectional design and the \nheterogeneity of theory-of-mind assessments employed), these authors conclude that self-\nregulatory private speech might provide a mechanism for the child to build upon existing SU \ncapacities through the internalization of dialogic exchanges with others. They also point out that \nfurther light may be shed on this relation by investigations of the occurrence of mental state \nlanguage in children’s private speech. Furrow, Moore, Davidge, and Chiasson (1992) \ndemonstrated correlations between mothers’ and children’s use of mental state terms in samples \nof parent–child talk. To date, the occurrence of such terms in children’s self-regulatory private \nspeech has not been investigated. Two points can be made in assessing this research prospect. \nFirstly, caregivers’ general sensitivity to mind is likely to be reflected in behaviors other than \nmental-state language use (Harris, 2005; Lundy, 2003, Meins et al., 2003). Secondly, the DT \nmodel would hold that mind-related utterances should be rarer in children’s private speech than \nutterances that reflect perspectival difference without making any explicit reference to mental \nstates. This is because, as explained in the previous section, the DT model sees explicit mental-\nstate discourse as being of less importance for SU development than dialogues presenting \nalternative perspectives on reality without reference to mental states.  \n Despite these complexities and open empirical questions, evidence for a relation between \nPS and ToM is consistent with the view that the preschool and early school years witness an \nacross-the-board shift towards verbal mediation in a variety of domains. Generally speaking, \nVygotsky’s claims about the emergence and subsequent internalization of private speech, \nparticularly its relations with social context, task difficulty, and task performance, have been \nwell supported (Berk, 1992; Winsler, 2004). Cross-task and cross-context stability in private \nspeech production has been demonstrated in recent empirical studies (e.g., Winsler et al., 2003). \nEvidence for a domain-general shift towards verbal mediation has been presented by Al-Namlah, \nVygotsky and social understanding    45 \n \nFernyhough, and Meins (2006), who reported that children’s use of self-regulatory private \nspeech accounted for a significant amount of the variance in their use of phonological recoding \nof visually presented material in a short-term memory task. If theory-of-mind performance and \nverbal self-regulation are indeed linked by a domain-general shift towards verbal mediation, it \nmight provide an alternative explanation for the observed links between mentalizing \nperformance and executive functioning in early childhood (e.g., Carlson & Moses, 2001; see \nFernyhough, forthcoming, for further discussion). Although there is not yet any direct evidence \nthat developmental associations between these variables are mediated by self-regulatory private \nspeech, strong associations have been found between children’s use of such speech on an \nexecutive task and their performance on the same task (Al-Namlah et al., 2006; Fernyhough & \nFradley, 2005), suggesting that private and inner speech may mediate performance on classic \nmeasures of executive functioning.  \nCulture and Enculturation \n Given the emphasis in Vygotsky’s writings on situating development within its \nsociocultural context, it would seem important for any application of his ideas to SU \ndevelopment to consider children’s exposure to sociocultural practices which may vary across \ncultures. If a conceptual folk-psychological understanding is a relatively late addition to forms of \nSU founded on the internalization of dialogue, one might expect that differences relating to \nculture-specific traditions for explaining behavior (e.g., Lillard, 1998) might also emerge \nrelatively late. Instead, any early-emerging cultural differences in SU should relate to differences \nin children’s exposure to dialogic social exchanges. Although a thorough evaluation of the \nmodel’s power to explain cultural differences in SU development lies beyond the scope of this \narticle, one issue that should be addressed is whether the model makes specific predictions for \nsituations where children’s social-interactional experiences differ from those pedagogical \nVygotsky and social understanding    46 \n \nexchanges, typical to Western cultures, described by Vygotsky. For example, Rogoff, Paradise, \nArauz, Correa-Chávez, and Angelillo (2003) note that many non-Western and non-industrialized \ncultures privilege a form of learning in which children learn through careful observation of \nothers rather than through dialogic interaction. The DT model would predict that, because SU is \nnot transmitted through instructional contexts, such differences in socialization practices should \nnot translate into cultural differences in SU unless they impact upon children’s broader \nopportunities to engage in interpersonal dialogues. It seems likely that, in many cultures where \nlearning occurs through intent participation, children and adults will nevertheless engage \ndialogically in other everyday non-learning contexts. In cultures where non-instructional dialogic \ninteraction with adult caregivers were indeed found to be infrequent, any effects on \ninternalization might be partly compensated for by interactions with siblings, peers, and \nextended family. On this view, SU development would be seen to be founded on basic human \ninteractional processes expected to be relatively invariate across cultures (Carpendale & Lewis, \n2004). Future cross-cultural research might consider the relative contributions of these various \nsocial experiences to specific milestones in SU development, thus adding to the small body of \nexisting research relating cultural differences to Vygotskian internalization (see Al-Namlah et \nal., 2006). \n Another possible future research avenue concerns the effects of enculturation on non-\nhuman primates, whose SU capacities have been the subject of much empirical interest in recent \nyears (e.g., Tomasello et al., 2005). Tomasello et al. (2005) propose that apes show many of the \ncomponent skills that make up intentional-agent understanding (such as an understanding of \ngoal-directed behavior), but that their progression to higher levels of SU (such as mental-agent \nunderstanding) is limited by their failure to engage in shared intentionality. The DT model would \nhold that the transition from intentional-agent to mental-agent understanding involves the further \nVygotsky and social understanding    47 \n \nrequirement that the collaborative exchanges and dialogic cognitive representations that result \nfrom shared intentionality be semiotically mediated—otherwise, the internalization of such \nexchanges would have nothing to act upon (Fernyhough, 2005). Currently, Tomasello et al.’s \nclaims in this respect are difficult to tease apart empirically from those of the DT model, as \nshared intentionality would seem to be necessary for both the construction of mediated dialogues \nand the kinds of exchanges seen by Tomasello and colleagues as fostering further SU \ndevelopment. It is at least plausible, however, that future research with enculturated language-\ntrained apes might separate out the relative contributions of shared intentionality and language to \nSU development. Although even highly enculturated primates such as the bonobo Kanzi show no \nhuman-like motivation to share intentions (Tomasello et al., 2005), they nevertheless engage in \ncertain familiar social behaviors such as playing with toys (Savage-Rumbaugh, 1990). Future \nresearch in which the social interaction of enculturated apes is heavily scaffolded (to compensate \nfor the lack of an innate motivation to share intentions) might be able to determine whether (as \nTomasello and colleagues suggest) particular kinds of interaction are sufficient for the transition \nto mental-agent understanding, or whether (as the DT model would hold) such social experiences \nwould not be effective without the additional component of mediation by language or other sign \nsystems.  \nExplaining Atypical SU Development \n The DT model has clear implications for the study of atypical human populations. In this \nsection, I consider SU development in individuals with autism and sensory impairment. Given \nthat much of the relevant empirical work has not yet been carried out, parts of the following are \nnecessarily speculative, but nevertheless contain several specific proposals for future research.  \nSU in Autism \nVygotsky and social understanding    48 \n \n Given that it is only fairly recently that the focus of SU research has turned to explaining \nits development within a social context, it is perhaps not surprising that there have been few \nattempts to explain how atypical social experience can have profound influences on SU \ndevelopment. In the most well-known of these accounts, Hobson (e.g., 1993; 2002) has argued \nthat SU is developmentally determined by the ability to engage in socio-affectively patterned, \nintersubjective exchanges with other people. According to Hobson, the deficits in SU and \nsymbol use observed in children with autism (and in children affected by blindness and deafness) \nstem from such individuals’ lack of opportunity for engaging in interaction within the \n‘relatedness triangle’ (Hobson, 1993), and thus learning about the differing intentional relations \nthat others can have to reality. What is currently lacking in Hobson’s account is precise detail on \nthe cognitive-developmental mechanisms through which these SU and symbol-use deficits might \narise.  \n The DT model may help to fill this gap in Hobson’s account. Firstly, it proposes detail on \nthe kinds of social interaction through which normal and atypical social experience can have \ntheir effects. Secondly, it predicts associations between SU deficits and other cognitive deficits \nthat are not readily accounted for by the current theoretical alternatives. For example, the DT \nmodel would predict that individuals whose limited social experiences restrict their opportunities \nfor the internalization of dialogue will have difficulties with flexible, open-ended thinking \n(Fernyhough, 1996), difficulties that formed part of the original characterisation of the syndrome \nof autism (Kanner, 1943). In addition, the model would predict that restricted opportunities for \nthe internalization of dialogue will result in deficits in self-regulatory private speech and inner \nspeech, with all the implications for the development of self-regulation of cognition and \nbehavior. While much work remains to be done on verbal mediation in autism and other \ndevelopmental disorders, some existing findings are relevant in this respect. Baltaxe and \nVygotsky and social understanding    49 \n \nSimmons (1977) reported that the bedtime soliloquies of individuals with autism lacked the \ndialogic structure usually exhibited by such speech forms. Hurlburt, Happé, and Frith (1994) \nused an experience sampling and interview technique to demonstrate that three high-functioning \nindividuals with Asperger syndrome reported far less inner speech than had previously been \nreported by normal adults, a finding supported by first-person accounts of autism which suggest \na preponderance of visual rather than verbal imagery (e.g., Grandin, 1996). These findings are \nconsistent with the view that even verbally fluent individuals with autism are limited in their use \nof verbal dialogues to regulate their own behavior (Fernyhough, 1996; Tomasello et al., 1993). \nMore generally, these predicted deficits in verbal self-regulation are in line with \ncharacterisations of autism which see executive and theory-of-mind dysfunction as going hand in \nhand (e.g., Hughes & Russell, 1993). There is also a growing body of evidence for inner speech \ndeficits in autism which, given the assumed importance of inner speech for self-regulation, may \naccount for some of the executive deficits associated with the disorder (Joseph, Steele, Meyer, & \nTager-Flusberg, 2005; Russell, Jarrold, & Hood, 1999; Whitehouse, Maybery, & Durkin, 2006).  \nSU in Sensory Impairment \n Hobson’s account opens up the possibility that varied constraints on social experience \nwill lead, via different developmental pathways, to autism-like symptoms. One relevant research \narea in this respect is that relating to congenital deafness. Deafness has been a focus of SU \nresearch because of the obvious limitations it imposes on social interaction, particularly that \nmediated by language, and because any atypicalities in SU development are not confounded by \nother disabilities. Evidence of developmental delay in theory-of-mind in deaf children born to \nhearing parents (Peterson & Siegal, 1995) has been proposed to bear witness to the importance \nof social input in SU. These effects are said to be mediated by these children’s late acquisition of \nsign language (resulting from their own parents’ relative lack of fluency in sign language), as \nVygotsky and social understanding    50 \n \ncompared with deaf children of deaf (and hence sign-fluent) parents, who show no such delays in \nSU acquisition (Woolfe, Want, & Siegal, 2002). Such findings are also interpretable within the \nDT framework, which would see native-signing children to be equivalent to hearing children in \nall relevant opportunities for the internalization of dialogue (in this case, those mediated by sign \nlanguage). It should be noted that research into deafness has not yet been able to determine \nwhich specific kinds of sign-mediated interaction are most important in native signers’ \nacquisition of SU. In line with the foregoing arguments, the DT model would predict that it \nwould be signing interactions in which different perspectives are presented, but not necessarily \nframed in mental-state terms, that will be most important (and, by implication, represent the form \nof social input most critically lacking in late-signing children).  \n The DT model would make further predictions not entailed by other theories of SU. Of \nmost immediate empirical interest might be the prediction that native signers should show none \nof the atypicalities in the emergence of semiotic mediation that would be expected in late \nsigners. That is, their private self-regulatory signing should follow a similar developmental \ntrajectory (and show similar relations with task difficulty and task performance) to that observed \nin hearing children. In comparison, late signers should be delayed in the emergence and \ninternalization of private signing, and these delays should in turn be related to their SU. \nExamining SU development within the context of children’s overt use of semiotic mediation \nwould appear particularly worthwhile in the study of this population, given that research into \nchildren’s private signing (and other self-directed gestures) is still in its infancy (Goldin-\nMeadow, 1999). \nConclusions \n My aim has been to set out a model of SU development in which other minds can be \nunderstood to the extent to which they interpenetrate in social and internalized dialogue. This \nVygotsky and social understanding    51 \n \ninternalization process builds upon capacities for intentional-agent understanding which allow \ntriadic interactions, centered around objects, in which perspectives on reality are shared. The \nemergence of language and the child’s beginning participation in linguistic exchanges herald the \nbeginning of a progression from social dialogue, through the intermediate stage of private \nspeech, towards fully internalized inner dialogue. The resulting dialogic forms of thought \nprovide the basis for children’s capacity to adopt and operate with (in a pre-reflective manner; \nsee Note 4) the internalized perspectives of their social partners. In a secondary developmental \npathway, conversations about mental states with sensitive caregivers present children with \nopportunities to learn the correct usage of mental-state terms and concepts, allowing them \nultimately to enter into sophisticated folk-psychological ways of explaining and predicting the \nbehavior of others.  \n I have suggested that several benefits result from adopting such an approach. Firstly, the \nDT model speaks to our intuition that SU must be at least partly dependent upon social \nexperience, particularly that which builds upon pre-existing SU competence. Secondly, it allows \nus to examine the development of SU within a broad, gradualist context of social-cognitive \ndevelopment. Thirdly, the DT model proposes detail on the cognitive-developmental \nmechanisms that might lead from particular types of social interaction to enhanced SU, \nspecifically those relating to the internalization of mediated dialogue. Finally, the DT approach \nis effective in accounting for the evidence concerning the typical development of SU, findings of \nassociations between individual differences in SU and social experience, and atypical \ndevelopment. \n The DT model thus represents a departure from previous theories of SU. In unpacking \nVygotsky’s suggestions about the importance of semiotic mediation and internal dialogue, the \nDT model adds to the body of theory which sees SU as involving interfunctional (Vygotsky, \nVygotsky and social understanding    52 \n \n1934\/1987; see Note 5) relations between different domains of cognition. In addition to the \nempirical tests of the model proposed here, much theoretical and conceptual work remains to be \ndone. Most importantly, researchers should work to specify in greater detail the mechanisms by \nwhich external interpersonal exchanges are reconstructed on the plane of individual cognition. \nOne problem in this respect is that Vygotsky’s theory requires us to rethink our notions of ‘inner’ \nand ‘outer’ as they apply to human psychology, and to be sensitive to the various ways in which \nmind can ‘extend beyond the skin’ (Geertz, 1973; see also Clark, 1998; Clark & Chalmers, \n1998). In an important development in clarifying this aspect of Vygotsky’s theory, Tomasello et \nal. (1993) have considered internalization as a form of cultural learning, whereby the individual \ngradually comes to take the other’s perspective in thinking. Internalization is thus \ndevelopmentally constrained by children’s emerging concepts of others as intentional, mental, \nand reflective agents. A central assumption of the DT model is that children’s conceptions of the \nminds of others cannot develop entirely independently of their experience of them (Barresi & \nMoore, 1993; Hobson, 1993). At the same time, Tomasello et al. are correct to point out that \nchildren’s developing pre-theoretical and theoretical conceptions of others are bound to \ninfluence the kinds of interpersonal exchanges they will be able to enjoy. \nIt is here that another objection to the DT model is likely to emerge. I have argued that \nchildren’s ability to operate with simultaneously-held multiple perspectives in social reasoning is \ndependent upon their internalization of mediated interactions with others. Surely, though, the \nability to engage in dialogue is itself dependent upon the presence of a certain degree of social-\ncognitive sophistication? It is for this reason that SU development has sometimes been seen as \ndevelopmentally primary to the emergence of mediated thinking (e.g., Rochat, 2001). This issue \nboils down to the question of what is the minimal level of interpersonal understanding necessary \nfor engagement in dialogue. I have proposed that intentional-agent understanding is sufficient, \nVygotsky and social understanding    53 \n \nespecially when caregivers (who, if they are mind-minded, will be acting at the mental-agent \nlevel) are active in pitching their interventions appropriately and adopting the intentional stance \nin constructing dialogues with their charges. Engagement in dialogue, and therefore the \ninternalization of dialogue, is accordingly a precursor rather than a consequence of later \ndevelopments in SU. If this is so, it is predominantly due to the sensitive interactional context \nthat mind-minded caregivers are hypothesized to provide.  \nAnother way of thinking about this question is to ask how, if we are to take seriously the \npragmatic, socially effective qualities of language, the social-cognitive capacities that underpin \nsuch language use can themselves be dependent on language (Tomasello et al., 2005). The first \nresponse is that, as noted above, engagement in dialogue with sensitive caregivers can begin \nfrom the very earliest stages of life. Furthermore, the internalization of such dialogic exchanges \nrequires only intentional-agent (not mental-agent) understanding. The second response is that \nchildren are able to enjoy the semiotic, representational, and hence mediational functions of \nlanguage before they are fully conversant with its social uses. That is, the cognitive benefits of \nrepresenting the alternative perspectives of others in language are apparent well before children \nhave the social-cognitive skills necessary for a conceptual understanding of those perspectives.   \nI conclude by considering the phylogenetic status of dialogic SU. One plausible reason \nwhy non-human primates fail to develop human-like SU is because they do not enjoy mediated \nsocial exchanges with conspecifics. To what extent do the present claims about SU development \nconstitute a claim for the species-specificity of these cognitive processes? Tomasello and \nRakoczy (2003) suggest that the capacity to engage in social interactions underpinned by \nintentional-agent understanding of others is what makes human thought and culture distinct from \nany comparable phenomena elsewhere in the animal kingdom. For these authors, intentional-\nagent understanding allows human infants to engage in interpersonal exchanges mediated by \nVygotsky and social understanding    54 \n \nconventional sign systems, and thus enter into the flow of knowledge transmission particular to \ntheir culture. This (probably biologically determined) intentional-agent understanding is \ntransformed into mental-agent understanding after, inter alia, several years’ experience of \nperspective-shifting discourse. Like Lohmann et al.’s (2005) account, Tomasello and Rakoczy’s \nview of SU development remains an essentially individualistic account of how children can \nobtain evidence (through linguistic encounters with the perspectives of others) on how their own \nperspectives differ from those of others (Carpendale & Lewis, 2004; Harris, 1996). While \nexperience of perspectival conflict is undoubtedly an important part of this process, it is only to \nthe extent that these alternative perspectives can be internalized and simultaneously \naccommodated in social reasoning that the child’s formative experiences of sharing perspectives \nwith others can continue to play a role in their reasoning about others’ mental states \n(Fernyhough, 2004a). In the model presented here, this accomplishment is made possible by the \nfundamental restructuring of the child’s cognitive architecture that results from the \ninternalization of dialogue. In setting out how this developmental milestone is achieved within \nthe context of specific sociocultural practices, the DT model allows us to trace some defining \ncharacteristics of our adult cognitive processes back to the social and cultural milieux within \nwhich we develop.  \n \n \n \nVygotsky and social understanding    55 \n \nAcknowledgements \nI am grateful to Elizabeth Meins, Jeremy Carpendale, Charlie Lewis, Peter Hobson, Sue Leekam, \nand two anonymous reviewers for helpful comments on an earlier version of this article.  \nVygotsky and social understanding    56 \n \nNotes\n \ni The term ‘theory of mind’, with its implications of a theory-like understanding of how mental \nstates govern behavior, is frequently replaced by the less theory-laden ‘mentalizing’, ‘mind-\nreading’, or ‘social understanding’. In the present article, I follow Carpendale and Lewis (2004; \n2006) in favouring the term ‘social understanding’, because it can encompass the pre-theoretical \nunderstanding of other minds demonstrated in infancy and the early preschool years, as well as \nmore sophisticated later forms of mentalizing. When referring specifically to the folk-\npsychological understanding of mental states first evidenced between the ages of around 3 and 5, \nthe terms ‘theory of mind’ and ‘mentalizing’ are used. Although a proper consideration of such \nusages is beyond the scope of this article, it is noted that all of these terms may obscure \nimportant distinctions between forms of mentalistic understanding, such as the difference \nbetween understanding beliefs and desires. The extent to which the present account requires \nchildren to have any ‘theoretical’ understanding of mental states is considered later.  \n \nii The higher mental functions (Vygotsky, 1930-1935\/1978) are defined in contrast to the \nelementary mental functions, which are unconscious, involuntary, and driven entirely by \nenvironmental stimulation. By virtue of its being accessible to consciousness, under voluntary \ncontrol, and, as I shall argue, mediated by signs, I assume that reasoning about other minds \nqualifies as an example of a higher mental function. For a discussion of commonalities between \nthe elementary mental functions and Fodor’s (1983) modular input systems, see Fernyhough \n(1996). \n \niii The use of the term ‘accommodation’ in this context is not meant to carry any Piagetian or \nBaldwinian implications. The intention is simply to convey that a multiplicity of perspectives \ncan exist simultaneously within, or be accommodated by, an inclusive cognitive structure. The \nVygotsky and social understanding    57 \n \n                                                                                                                                                             \nterm is generally preferred to ‘representation’, which presupposes some unwarranted (in this \ncontext) social-cognitive or conceptual understanding.  \n \niv Note that this representation of the other’s perspective does not necessarily involve any \nmetacognitive reflection on co-existing perspectives. The process through which the child \nbecomes able to reflect on the simultaneity of multiple perspectives that makes up her internal \ndialogue is considered below, when the application of the DT framework to SU development is \nexamined. \n \nv Vygotsky characterized his approach as focusing on the problem of “interfunctional \nrelationships” (1934\/1987, pp. 43-44), by which he meant the changing developmental relations \nbetween cognitive functions such as thinking and language. The emphasis in his theory on \nsemiotic (particularly linguistic) mediation is thus consistent with his interfunctional approach \n(Fernyhough, forthcoming). \n \nvi It might be objected that Tomasello et al.’s account attributes a degree of conceptual \nunderstanding to infants which overestimates the sophistication of the cognitive structures \nunderlying their social behavior. My own use of the term ‘understanding’ is not meant to imply \nany conceptual understanding of how mental states underpin behavior, which, I argue below, is a \nrelatively late-occurring developmental achievement.   \n \nvii I am grateful to an anonymous reviewer for this suggestion.  \nVygotsky and social understanding    58 \n \nReferences \nAl-Namlah, A. S., Fernyhough, C., & Meins, E. (2006). Sociocultural influences on the \ndevelopment of verbal mediation: Private speech and phonological recoding in Saudi \nArabian and British samples. Developmental Psychology, 42, 117-131.  \nApperly, I. A., Samson, D., & Humphreys, G. W. (2005). Domain-specificity and theory of \nmind: Evaluating neuropsychological evidence. Trends in Cognitive Sciences, 9, 572-576.  \nAstington, J. W. (1996). What is theoretical about the child’s theory of mind? A Vygotskian \nview of its development. In P. Carruthers & P. K. Smith (eds.), Theories of theories of \nmind (pp. 184-199). Cambridge University Press.  \nAstington, J. W. (2004). What’s new about social construction? Distinct roles needed for \nlanguage and communication (Commentary on Carpendale & Lewis). Behavioral and \nBrain Sciences, 27, 96-97.  \nAstington, J. W., & Olson, D. R. (1995). The cognitive revolution in children’s understanding of \nmind. Human Development, 38, 179-189.  \nAstington, J. W., & Baird, J. A. (2005a). Why language matters for theory of mind. Oxford, UK: \nOxford University Press.  \nAstington, J. W., & Baird, J. A. (2005b). Introduction: Why language matters. In J. W. Astington \n& J. A. Baird (eds.), Why language matters for theory of mind (pp. 3-25). Oxford, UK: \nOxford University Press.  \nAustin, J. L. (1979). Philosophical papers (3rd ed.). Oxford: Oxford University Press.  \nBakhtin, M. M. (1984). Problems of Dostoevky’s poetics (C. Emerson, trans. and ed.). \nMinneapolis: University of Minnesota Press.  \nBakhtin, M. M. (1986). Speech genres and other late essays (C. Emerson and M. Holquist, ed.; \nV. W. McGee, trans.). Austin: University of Texas Press.  \nVygotsky and social understanding    59 \n \nBaltaxe, C. A. M., & Simmons, J. Q. (1977). Bedtime soliloquies and linguistic competence in \nautism. Journal of Speech and Hearing Disorders, 42, 376-393.  \nBarresi, J., & Moore, C. (1993). Sharing a perspective precedes the understanding of that \nperspective. Behavioral and Brain Sciences, 16, 513-514.  \nBarresi, J., & Moore, C. (1996). Intentional relations and social understanding. Behavioral and \nBrain Sciences, 19, 107-154.  \nBartsch, K., & Wellman, H. M. (1995). Children talk about the mind. New York: Oxford \nUniversity Press.  \nBehrend, D. A., Rosengren, K. S., & Perlmutter, M. (1989). A new look at children’s private \nspeech: The effects of age, task difficulty, and parent presence. International Journal of \nBehavioral Development, 12, 305-320.  \nBerk, L. E. (1992). Children’s private speech: An overview of theory and the status of research. \nIn R. M. Diaz and L. E. Berk (eds.), Private speech: From social interaction to self-\nregulation (pp. 17-53). Hove: Lawrence Erlbaum Associates.  \nBibler, V. S. (1984). Thinking as creation: Introduction to the logic of mental dialogue. Soviet \nPsychology, 22, 29-54.  \nBruner, J. S. (1975). From communication to language: A psychological perspective. Cognition, \n3, 255-287.  \nCarlson, S. M., & Moses, L. J. (2001). Individual differences in inhibitory control and children’s \ntheory of mind. Child Development, 72, 1032-1053.  \nCarruthers, P. (2002). The cognitive functions of language. Behavioral and Brain Sciences, 25, \n657-726.  \nVygotsky and social understanding    60 \n \nCarpendale, J. I. M., & Lewis, C. (2004). Constructing an understanding of mind: The \ndevelopment of children’s social understanding within social interaction. Behavioral and \nBrain Sciences, 27, 79-151.   \nCarpendale, J., & Lewis, C. (2006). How children develop social understanding. Oxford: \nBlackwell.  \nCarpendale, J., Lewis, C., Susswein, N., & Lunn, J. (in press). Talking and thinking: The role of \nspeech in social understanding. In A. Winsler, C. Fernyhough, & I. Montero (eds.), Private \nspeech, executive functioning, and the development of verbal self-regulation. Cambridge, \nUK: Cambridge University Press.  \nChapman, M. (1991). The epistemic triangle: Operative and communicative components of \ncognitive development. In M. Chandler and M. Chapman (eds.), Criteria for competence: \nControversies in the conceptualization and assessment of children’s abilities. Hove: \nErlbaum.  \nChesnokova, O. (2004). Agency mediation and an understanding of the mind (Commentary on \nCarpendale & Lewis). Behavioral and Brain Sciences, 27, 102.  \nCheyne, J. A., & Tarulli, D. (1999). Dialogue, difference and voice in the zone of proximal \ndevelopment. Theory & Psychology, 9, 5-28.  \nClark, A. (1998). Magic words: How language augments human cognition. In P. Carruthers and \nJ. Boucher (eds.), Language and thought: Interdisciplinary themes (pp. 162-183). \nCambridge: Cambridge University Press.  \nClark, A. (2006). Language, embodiment, and the cognitive niche. Trends in Cognitive Sciences, \n10, 370-374.  \nClark, A., & Chalmers, D. (1998). The extended mind (Active externalism). Analysis, 58, 7-19.  \nVygotsky and social understanding    61 \n \nDelgado, B., & Montero, I. (2005). Exploring the emergence and functions of pointing. Paper \npresented at the 35th Annual Meeting of the Jean Piaget Society, Vancouver, Canada, June \n2005.  \nDennett, D. C. (1997). How to do other things with words. Philosophy, 219-235, Suppl. 42.  \nde Villiers, J. G., & de Villiers, P. A. (2000). Linguistic determinism and the understanding of \nfalse beliefs. In P. Mitchell & K. J. Riggs (eds.), Children’s reasoning and the mind (pp. \n191-228). Psychology Press.  \nDuncan, R. M., & Cheyne, J. A. (2001). Private speech in young adults: Task difficulty, self-\nregulation, and psychological predication. Cognitive Development, 16, 889-906. \nDunn, J., Brown, J., Slomkowski, C., Tesla, C., & Youngblade, L. M. (1991). Young children’s \nunderstanding of other people’s feelings and beliefs: Individual differences and their \nantecedents. Child Development, 62, 1352-1366. \nFeigenbaum, P. (1992). Development of the syntactic and discourse structures of private speech. \nIn R. M. Diaz & L. E. Berk (eds.), Private speech: From social interaction to self-\nregulation (pp. 181-198). Hove, UK: Lawrence Erlbaum Associates. \nFernyhough, C. (1994). Social and private speech as determinants of early cognitive functioning. \nUnpublished doctoral dissertation, University of Cambridge.  \nFernyhough, C. (1996). The dialogic mind: A dialogic approach to the higher mental functions. \nNew Ideas in Psychology, 14, 47-62. \nFernyhough, C. (1997). Vygotsky’s sociocultural approach: Theoretical issues and implications \nfor current research. In S. Hala (ed.), The development of social cognition, pp. 65-93. \nLondon: Psychology Press.  \nFernyhough, C. (1999). Introduction to Volume I. In P. Lloyd & C. Fernyhough (eds.), Lev \nVygotsky: Critical assessments, pp. xli–lv. London: Routledge. \nVygotsky and social understanding    62 \n \nFernyhough, C. (2004a). More than a context for learning? The epistemic triangle and the \ndialogic mind (Commentary on Carpendale & Lewis). Behavioral and Brain Sciences, 27, \n104-105.  \nFernyhough, C. (2004b). Alien voices and inner dialogue: Towards a developmental account of \nauditory verbal hallucinations. New Ideas in Psychology, 22, 49-68.  \nFernyhough, C. (2005). What is internalised? Dialogic cognitive representations and the \nmediated mind. (Commentary on Tomasello et al.). Behavioral and Brain Sciences, 28, \n698-699. \nFernyhough, C. (in press). Dialogic thinking. In A. Winsler, C. Fernyhough, & I. Montero (eds.), \nPrivate speech, executive functioning, and the development of verbal self-regulation. \nCambridge, UK: Cambridge University Press.  \nFernyhough, C. (forthcoming). Vygotsky, Luria, and the social brain. In J. Carpendale, G. \nIarocci, U. Müller, B. Sokol, & A. Young (eds.), Self- and social-regulation: Exploring the \nrelations between social interaction, social cognition, and the development of executive \nfunctions. Oxford University Press.  \nFernyhough, C., & Fradley, E. (2005). Private speech on an executive task: Relations with task \ndifficulty and task performance. Cognitive Development, 20, 103-120. \nFernyhough, C., & Meins, E. (in press). Private speech and theory of mind: Evidence for \ndeveloping interfunctional relations. In A. Winsler, C. Fernyhough, & I. Montero (eds.), \nPrivate speech, executive functioning, and the development of verbal self-regulation. \nCambridge, UK: Cambridge University Press. \nFernyhough, C., & Russell, J. (1997). Distinguishing one’s own voice from those of others: A \nfunction for private speech? International Journal of Behavioral Development, 20, 651-\n665. \nVygotsky and social understanding    63 \n \nFields, C. (2002). Why do we talk to ourselves? Journal of Experimental and Theoretical \nArtificial Intelligence, 14, 255-272. \nFodor, J. A. (1983). The modularity of mind. Cambridge, MA: MIT Press.  \nFodor, J. (1992). A theory of the child’s theory of mind. Cognition, 44, 283-296.  \nFurrow, D., Moore, C., Davidge, J., & Chiasson, L. (1992). Mental terms in mothers’ and \nchildren’s speech: Similarities and relationships. Journal of Child Language, 19, 617-631.  \nGarfield, J. L., Peterson, C. C., & Perry, T. (2001). Social cognition, language acquisition and \nthe development of the theory of mind. Mind and Language, 16, 494-541.   \nGeertz, C. (1973). The interpretation of cultures: Selected essays. New York: Basic Books.  \nGoldin-Meadow, S. (1999). The role of gesture in communication and thinking. Trends in \nCognitive Sciences, 3, 419-429.  \nGordon, A. C. L., & Olson, D. R. (1998). The relation between acquisition of a theory of mind \nand the capacity to hold in mind. Journal of Experimental Child Psychology, 68, 70-83. \nGordon, R. M. (1992). The simulation theory: Objections and misconceptions. Mind and \nLanguage, 7, 11-34.  \nGrandin, T. (1996). Thinking in pictures: Autism. London: Vintage.  \nHale, C. M., & Tager-Flusberg, H. (2003). The influence of language on theory of mind: A \ntraining study. Developmental Science, 6, 346-359.  \nHamlyn, D. W. (1990). In and out of the black box: On the philosophy of cognition. Oxford: \nBasil Blackwell.  \nHarris, P. L. (1989). Children and emotion: The development of psychological understanding. \nOxford: Blackwell.  \nHarris, P. L. (1996). Desires, beliefs, and language. In P. Carruthers & P. K. Smith (eds.), \nTheories of theories of mind. Cambridge, UK: Cambridge University Press.  \nVygotsky and social understanding    64 \n \nHarris, P. L. (1999). Acquiring the art of conversation. In M. Bennett (ed.), Developmental \npsychology: Achievements and prospects (pp. 89-105). Hove, UK: Psychology Press.  \nHarris, P. L. (2005). Conversation, pretense, and theory of mind. In J. W. Astington & J. A. \nBaird (eds.), Why language matters for theory of mind (pp. 70-83). Oxford, UK: Oxford \nUniversity Press. \nHermans, H. J. M. (1996). Voicing the self: From information processing to dialogical \ninterchange. Psychological Bulletin, 119, 31-50.  \nHermans, H. J. M. (2002). The dialogical self as a society of mind. Theory and Psychology, 12, \n147-160.  \nHermans, H. J. M., & Kempen, H. J. G. (1993). The dialogical self: Meaning as movement. San \nDiego: Academic Press.  \nHermans, H. J. M., & Kempen, H. J. G. (1995). Body, mind and culture: The dialogical nature of \nmediated action. Culture and Psychology, 1, 103-114.  \nHobson, R. P. (1993). Autism and the development of mind. Hove: Lawrence Erlbaum \nAssociates.  \nHobson, R. P. (1995). Apprehending attitudes and actions: Separable abilities in early \ndevelopment. Development and Psychopathology, 7, 171-182.  \nHobson, R. P. (2002). The cradle of thought: Exploring the origins of thinking. London: \nMacmillan.  \nHolquist, M. (1990). Dialogism: Bakhtin and his world. London: Routledge.    \nHughes, C., & Leekam, S. (2004). What are the links between theory of mind and social \nrelations? Review, reflections and new directions for studies of typical and atypical \ndevelopment. Social Development, 13, 590-619.  \nVygotsky and social understanding    65 \n \nHughes, C., & Russell, J. (1993). Autistic children’s difficulty with mental disengagement from \nan object: Its implications for theories of autism. Developmental Psychology, 29, 498–510.  \nHughes, C., Jaffee, S. R., Happé, F., Taylor, A., Caspi, A., & Moffitt, T. E. (2005). Origins of \nindividual differences in theory of mind: From nature to nurture? Child Development, 76, \n356-370.  \nHurlburt, R. T. (1990). Sampling normal and schizophrenic inner experience. New York: \nPlenum. \nHurlburt, R. T., Happé, F., & Frith, U. (1994). Sampling the form of inner experience in three \nadults with Asperger syndrome. Psychological Medicine, 24, 385–395.  \nJanet, P. (1926). De l’angoisse à l’extasie (Vol. I). Paris: Felix Alcan.  \nJanet, P. (1929). De l’angoisse à l’extasie (Vol. II). Paris: Felix Alcan.  \nJoseph, R. M., Steele, S. D., Meyer, E., & Tager-Flusberg, H. (2005). Self-ordered pointing in \nchildren with autism: Failure to use verbal mediation in the service of working memory? \nNeuropsychologia, 43, 1400-1411.  \nKanner, L. (1943). Autistic disturbances of affective contact. Nervous Child, 2, 217–250.  \nKohlberg, L., Yaeger, J., & Hjertholm, E. (1968). Private speech: Four studies and a review of \ntheories. Child Development, 39, 691–736. \nLawrence, J. A., & Valsiner, J. (1993). Conceptual roots of internalization: From transmission to \ntransformation. Human Development, 36, 150-167.  \nLeont’ev, A. N. (1932). The development of voluntary attention in the child. Journal of Genetic \nPsychology, 40, 52-81. \nLeslie, A. M. (1991). The theory of mind impairment in autism: Evidence for a modular \nmechanism of development? In A. Whiten (ed.), Natural theories of mind. Oxford: \nBlackwell.  \nVygotsky and social understanding    66 \n \nLevina, R. E. (1981). L. S. Vygotsky’s ideas about the planning function of speech in children. \nIn J. V. Wertsch (ed.), The concept of activity in Soviet psychology. Armonk, NY: M. E. \nSharp.  \nLewis, C., Freeman, N. H., Hagestadt, C., & Douglas, H. (1994). Narrative access and \nproduction in preschoolers’ false belief reasoning. Cognitive Development, 9, 397-424.  \nLewis, M. (1993). The problem of the other in research on theory of mind and social \ndevelopment: Commentary. Human Development, 36, 363-367.  \nLewis, M. D. (2002). The dialogical brain: Contributions of emotional neurobiology to \nunderstanding the dialogical self. Theory and Psychology, 12, 175-190.  \nLillard, A. (1998). Ethnopsychologies: Cultural variations in theories of mind. Psychological \nBulletin, 123, 3-32.   \nLloyd, P., & Fernyhough, C. (1999). Lev Vygotsky: Critical assessments. London: Routledge. \nLohmann, H., & Tomasello, M. (2003). The role of language in the development of false belief \nunderstanding: A training study. Child Development, 74, 1130-1144.   \nLohmann, H., Tomasello, M., & Meyer, S. (2005). Linguistic communication and social \nunderstanding. In J. W. Astington & J. A. Baird (eds.), Why language matters for theory of \nmind. Oxford, UK: Oxford University Press.  \nLundy, B. L. (2003). Father– and mother–infant face-to-face interactions: Differences in mind-\nrelated comments and infant attachment? Infant Behavior and Development, 26, 200-212. \nMead, G. H. (1934). Mind, self and society from the standpoint of a social behaviorist. \nUniversity of Chicago Press.  \nMeins, E. (1997). Security of attachment and the social development of cognition. Hove: \nPsychology Press. \nVygotsky and social understanding    67 \n \nMeins, E. (2004). Infants’ minds, mothers’ minds and other minds: How individual differences \nin caregivers affect the co-construction of mind (Commentary on Carpendale & Lewis). \nBehavioral and Brain Sciences, 27, 116. \nMeins, E., & Fernyhough, C. (2007). Preschoolers’ understanding of multiple orientations to \nreality: The adjectives task. Cognitive Development.  \nMeins, E., Fernyhough, C., Wainwright, R., Das Gupta, M., Fradley, E., & Tuckey, M. (2002). \nMaternal mind-mindedness and attachment security as predictors of theory of mind \nunderstanding. Child Development, 73, 1715-1726.  \nMeins, E., Fernyhough, C., Wainwright, R., Clark-Carter, D., Das Gupta, M., Fradley, E., & \nTuckey, M. (2003). Pathways to understanding mind: Construct validity and predictive \nvalidity of maternal mind-mindedness. Child Development, 74, 1194-1211.  \nMoore, C. (1996). Theories of mind in infancy. British Journal of Developmental Psychology, \n14, 19-40.  \nMoore, C., & Corkum, V. (1994). Social understanding at the end of the first year of life. \nDevelopmental Review, 14, 349–372.  \nMüller, U., & Carpendale, J. I. M. (2000). The role of social interaction in Piaget’s theory: \nLanguage for social cooperation and social cooperation for language. New Ideas in \nPsychology, 18, 139-156.  \nNelson, K. (1996). Language in cognitive development: The emergence of the mediated mind. \nCambridge University Press.  \nNelson, K. (2004). Towards a collaborative community of minds (Commentary on Carpendale & \nLewis). Behavioral and Brain Sciences, 27, 119-120.  \nVygotsky and social understanding    68 \n \nNelson, K. (2005). Language pathways into the Community of Minds. In J. W. Astington & J. A. \nBaird (eds.), Why language matters for theory of mind (pp. 26-49). Oxford, UK: Oxford \nUniversity Press.  \nNelson, K., Plesa Skwerer, D., Goldman, S., Henseler, S., Presler, N., & Walkenfeld, F. F. \n(2003). Entering a community of minds: An experiential approach to “theory of mind”. \nHuman Development, 46, 24-46.  \nPerner, J. (1991). Understanding the representational mind. Cambridge, MA: MIT Press.  \nPeskin, J., & Astington, J. W. (2004). The effects of adding metacognitive language to story \ntexts. Cognitive Development, 19, 253-273.  \nPeterson, C. C., & Siegal, M. (1995). Deafness, conversation and theory of mind. Journal of \nChild Psychology and Psychiatry, 36, 459-474.  \nPeterson, C. C., & Siegal, M. (2000). Insights into theory of mind from deafness and autism. \nMind and Language, 15, 123-145.  \nPiaget, J. (1965). The moral judgment of the child (M. Gabian, trans.). Free Press. (Original \nwork published 1932). \nPiaget, J. (1995). Sociological studies (L. Smith, ed.). London: Routledge. (Original work \npublished 1977).  \nPiaget, J. (2000). Commentary on Vygotsky’s criticisms of Language and thought of the child \nand Judgement and reasoning in the child. New Ideas in Psychology, 18, 241-259.  \nPlato (1953). The dialogues of Plato, ed. B. Jowett. Oxford: Clarendon Press.  \nRaver, C. C., & Leadbeater, B. J. (1993). The problem of the other in research on theory of mind \nand social development. Human Development, 36, 350-362.  \nRochat, P. (2001). Dialogical nature of cognition (Commentary). Monographs of the Society for \nResearch in Child Development, 66, 133-143.  \nVygotsky and social understanding    69 \n \nRogoff, B., Paradise, R., Arauz, R. M., Correa-Chávez, M., & Angelillo, C. (2003). Firsthand \nlearning through intent participation. Annual Review of Psychology, 54, 175–203.  \nRussell, J., Jarrold, C., & Hood, B. (1999). Two intact executive capacities in children with \nautism: Implications for the core executive dysfunctions in the disorder. Journal of Autism \nand Developmental Disorders, 29, 103-112. \nRyle, G. (1973). The concept of mind. Harmondsworth, UK: Penguin. (Original work published \n1949.) \nSavage-Rumbaugh, S. (1990). Language as a cause-effect communication system. Philosophical \nPsychology, 3, 55-76.  \nShatz, M., Wellman, H. M., & Silber, S. (1983). The acquisition of mental verbs: A systematic \ninvestigation of first references to mental state. Cognition, 14, 301-321.  \nSymons, D. K. (2004). Mental state discourse, theory of mind, and the internalization of self-\nother understanding. Developmental Review, 24, 159-188.  \nTappan, M. B. (1997). Language, culture, and moral development: A Vygotskian perspective. \nDevelopmental Review, 17, 78-100.  \nTomasello, M. (1999). The cultural origins of human cognition. Cambridge, MA: Harvard \nUniversity Press.  \nTomasello, M., & Rakocky, H. (2003). What makes human cognition unique? From individual to \nshared to collective intentionality. Mind and Language, 18, 121-147. \nTomasello, M., Carpenter, M., Call, J., Behne, T., & Moll, H. (2005). Understanding and sharing \nintentions: The origins of cultural cognition. Behavioral and Brain Sciences, 28, 675-691.  \nTomasello, M., Kruger, A. C., & Ratner, H. H. (1993). Cultural learning. Behavioral and Brain \nSciences, 16, 495–552. \nVygotsky and social understanding    70 \n \nTrevarthen, C. (1980). The foundations of intersubjectivity: Development of interpersonal and \ncooperative understanding in infants. In D. Olson (ed.), The social foundations of language \nand thought: Essays in honor of Jerome Bruner. Norton.   \nVaish, A., & Woodward, A. (2005). Baby steps on the path to understanding intentions \n(Commentary on Tomasello et al.). Behavioral and Brain Sciences, 28, 717-718.  \nvan Geert, P. (1998). A dynamic systems model of basic developmental mechanisms: Piaget, \nVygotsky, and beyond. Psychological Review, 105, 634-677.  \nVygotsky, L. S. (1978). Mind in society: The development of higher psychological processes (ed. \nM. Cole, V. John-Steiner, S. Scribner & E. Souberman). Cambridge, MA: Harvard \nUniversity Press. (Original work published 1930, 1933, and 1935.) \nVygotsky, L. S. (1987). Thinking and speech. In The Collected Works of L. S. Vygotsky, Vol. 1. \nNew York: Plenum. (Original work published 1934.) \nVygotsky, L. S. (1997). The problem of consciousness. In The Collected Works of L. S. \nVygotsky, Vol. 3. New York: Plenum. (Original work published 1933.) \nVygotsky, L. S. (1997). Genesis of higher mental functions. In The Collected Works of L. S. \nVygotsky, Vol. 4 (ed. R. W. Rieber). New York: Plenum. (Original work published 1931.)  \nWellman, H. M. (1990). The child’s theory of mind. Cambridge, MA: MIT Press.  \nWellman, H. M., & Liu, D. (2004). Scaling of theory of mind tasks. Child Development, 75, 523-\n541.  \nWellman, H. M., Cross, D., & Watson, J. (2001). Meta-analysis of theory of mind development: \nThe truth about false belief. Child Development, 72, 655–684.  \nWertsch, J. V. (1979). The regulation of human action and the given–new organization of private \nspeech. In G. Zivin (ed.), The development of self-regulation through private speech. New \nYork: Wiley.  \nVygotsky and social understanding    71 \n \nWertsch, J. V. (1980). The significance of dialogue in Vygotsky’s account of social, egocentric \nand inner speech. Contemporary Educational Psychology, 5, 150-162.  \nWertsch, J. V. (1985). Vygotsky and the social formation of mind. Cambridge, MA: Harvard \nUniversity Press.  \nWertsch, J. V. (1991). Voices of the mind: A sociocultural approach to mediated action. Hemel \nHempstead: Harvester Wheatsheaf.  \nWertsch, J. V., & Stone, C. A. (1985). The concept of internalization in Vygotsky’s account of \nthe genesis of the higher mental functions. In J. V. Wertsch (ed.), Culture, communication \nand cognition: Vygotskian perspectives. Cambridge: Cambridge University Press.  \nWhitehouse, A. J. O., Maybery, M. T., & Durkin, K. (2006). Inner speech impairments in \nautism. Journal of Child Psychology and Psychiatry, 47, 857-865.  \nWimmer, H., & Perner, J. (1983). Beliefs about beliefs: Representation and constraining function \nof wrong beliefs in young children’s understanding of deception. Cognition, 13, 103-128. \nWinsler, A. (2004). Still talking to ourselves after all these years: Vygotsky, private speech, and \nself-regulation. Invited address given at First International Symposium on Self-Regulatory \nFunctions of Language, Madrid, November 2004.  \nWinsler, A., & Diaz, R. M. (1995). Private speech in the classroom: The effects of activity type, \npresence of others, classroom context, and mixed-age grouping. International Journal of \nBehavioral Development, 18, 463-488. \nWinsler, A., & Naglieri, J. (2003). Overt and covert verbal problem-solving strategies: \nDevelopmental trends in use, awareness, and relations with task performance in children \naged 5 to 17. Child Development, 74, 659-678.  \nVygotsky and social understanding    72 \n \nWinsler, A., de Leon, J. R., Wallace, B. A., Carlton, M. P., & Willson-Quayle, A. (2003). Private \nspeech in preschool children: Developmental stability and change, across-task consistency, \nand relations with classroom behaviour. Journal of Child Language, 30, 583–608.  \nWinsler, A., Diaz, R. M., & Montero, I. (1997). The role of private speech in the transition from \ncollaborative to independent task performance in young children. Early Childhood \nResearch Quarterly, 12, 59-79.  \nWinsler, A., Fernyhough, C., & Montero, I. (forthcoming). Private speech, executive \nfunctioning, and the development of verbal self-regulation. Cambridge, UK: Cambridge \nUniversity Press. \nWood, D., Bruner, J. S., & Ross, G. (1976). The role of tutoring in problem-solving. Journal of \nChild Psychology and Psychiatry and Allied Disciplines, 17, 89-100.  \nWoolfe, T., Want, S. C., & Siegal, M. (2002). Signposts to development: Theory of mind in deaf \nchildren. Child Development, 73, 768-778.  \n \n \n \nVygotsky and social understanding    73 \n \nVygotsky and social understanding    74 \n \n \n \n \nVygotsky and social understanding    75 \n \n \n"}