{"doi":"10.1111\/j.1475-5661.2009.00340.x","coreId":"65587","oai":"oai:dro.dur.ac.uk.OAI2:5407","identifiers":["oai:dro.dur.ac.uk.OAI2:5407","10.1111\/j.1475-5661.2009.00340.x"],"title":"The World Development Report 2009 'reshapes economic geography' : geographical reflections.","authors":["Rigg,  J.","Bebbington,  A.","Gough,  K. V.","Bryceson,  D. F.","Agergaard,  J.","Fold,  N.","Tacoli,  C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65587.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5407\/1\/5407.pdf","pdfHashValue":"e5332bdffc204f05de9ac75ab240c4d13597e383","publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5407<\/identifier><datestamp>\n      2011-11-01T09:18:48Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The World Development Report 2009 'reshapes economic geography' : geographical reflections.<\/dc:title><dc:creator>\n        Rigg,  J.<\/dc:creator><dc:creator>\n        Bebbington,  A.<\/dc:creator><dc:creator>\n        Gough,  K. V.<\/dc:creator><dc:creator>\n        Bryceson,  D. F.<\/dc:creator><dc:creator>\n        Agergaard,  J.<\/dc:creator><dc:creator>\n        Fold,  N.<\/dc:creator><dc:creator>\n        Tacoli,  C.<\/dc:creator><dc:publisher>\n        Wiley-Blackwell<\/dc:publisher><dc:source>\n        Transactions of the Institute of British Geographers, 2009, Vol.34(2), pp.128-136 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5407<\/dc:identifier><dc:identifier>\n        issn:0020-2754<\/dc:identifier><dc:identifier>\n        issn: 1475-5661<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1475-5661.2009.00340.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5407\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1475-5661.2009.00340.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5407\/1\/5407.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0020-2754"," 1475-5661","0020-2754","issn: 1475-5661"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n05 March 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRigg, J. and Bebbington, A. and Gough, K. V. and Bryceson, D. F. and Agergaard, J. and Fold, N. and\nTacoli, C. (2009) ’The World Development Report 2009 ’reshapes economic geography’ : geographical\nreflections.’, Transactions of the Institute of British Geographers., 34 (2). pp. 128-136.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1475-5661.2009.00340.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n01 April 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nRigg, J. and Bebbington, A. and Gough, K. V. and Bryceson, D. F. and Agergaard, J. and \nFold, N. and Tacoli, C. (2009) 'The World Development Report 2009 'reshapes economic \ngeography' : geographical reflections.', Transactions of the Institute of British Geographers., \n34 (2). pp. 128-136. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1111\/j.1475-5661.2009.00340.x \n \nPublisher’s copyright statement: \nThe definitive version is available at www.blackwell-synergy.com. \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \nThe World Development Report 2009 ‘reshapes economic geography’: \ngeographical reflections \n \nJonathan Rigg*, Anthony Bebbington**, Katherine V. Gough***, Deborah F. Bryceson****, \nJytte Agergaard***, Niels Fold***, Cecilia Tacoli***** \n \n* Department of Geography, University of Durham, j.d.rigg@durham.ac.uk \n** Institute of Development Policy and Management, University of Manchester, \nTony.Bebbington@manchester.ac.uk \n*** Department of Geography and Geology, University of Copenhagen, \nkg@geo.ku.dk, ja@geo.ku.dk, nf@geo.ku.dk \n**** Department of Geographical and Earth Sciences, University of Glasgow, \ndfbryceson@bryceson.net \n*****  International Institute of Environment and Development, London, \ncecilia.tacoli@iied.org  \n \n \n \n \n \n \n 2 \nThe World Development Report 2009 ‘reshapes economic geography’: \ngeographical reflections \n \nIntroduction: geography by economists \nBy and large, geographers have had little to say about the World Bank‘s annual flagship \nWorld Development Reports (WDRs). However, with the just published WDR 2009 \n(hereafter referred to as the Report) things might be different, for it claims to be \nconcerned with nothing less than ‗reshaping economic geography‘. In his foreword, the \nPresident of the World Bank, Robert Zoellick, writes that he expects ‗Reshaping \nEconomic Geography will stimulate a much-needed discussion on the desirability of \n―balanced growth‖, which has proved elusive. And by informing some important policy \ndebates, it will point the way towards a more inclusive and sustainable development‘ \n(World Bank 2009, xiii).   \n \nOn the face of it, many geographers will welcome the Report, not least because it takes \nissues of space seriously: ‗This Report advances the influence of geography on \neconomic opportunity by elevating space and place from mere undercurrents in policy to \na major focus‘ (World Bank 2009, 2). Placing the spatial dimensions of economic \ndevelopment centre stage, and recognising the reality and importance of spatial \nunevenness in development potentials and outcomes, may be reassuring. However, this \nwelcome should perhaps be tempered by a concern for what an institution dominated by \neconomists might do with geography. To put it another way, how does the World Bank – \nin the guise of this Report – ‗do‘ geography?  What does it say, who does it cite, what \ndoes it omit – and does all this make any difference?   \n \nThe concerns and content of the Report\n1\n \nThe Report focuses on the spatial transformations that must happen for countries to \ndevelop. Cities, migration and trade, it is claimed, have been the main catalysts of \nprogress and hence ‗Growing cities, ever more mobile people, and increasingly \nspecialised products are … essential for economic success‘ (World Bank 2009, xx). \nThese greater densities, shorter distances and reduced divisions will, the Report argues, \nbring about unbalanced growth: however, over time, other policies and mechanisms for \nintegration will foster convergence in living standards.  Development, seen through the \nReport‘s eyes, involves a necessary (and welcome) spatial unevenness in economic \nactivity coupled with progressive spatial evenness in human welfare.  This view is both \npositive (in that it reflects the way the Report reads economic history) and normative (in \nthat the Report argues that this is how things should be). The key policy challenge is to \naccelerate economic divergence while reducing the time taken for welfare convergence. \n \nA clear set of organising principles runs through the Report from beginning to end. The \nnotion of ‗Development in 3-D‘, meaning the intersection of Density, Distance and \nDivision, lies at the heart of the conceptual framework laid out in Part One of the Report \n(with each ‗D‘ the topic of a separate chapter). These three dimensions of development \n‗are easy metaphors, since density, distance, and division summon images of human, \nphysical, and political geography‘ (World Bank 2009, 6). The Report claims that by \npromoting transformations along these three dimensions, some places are doing well. \nHigher densities due to urbanization, shorter distances as people and businesses move \nto cities, and fewer divisions as economic borders are thinned and world markets \nentered, are ‗the changes that will help developing nations‘ (World Bank 2009, xx).  \n \nCorresponding to these three dimensions (referred to as ‗facts‘) are three drivers of \nchange: agglomeration, migration, and specialization with trade.  Part Two of the Report, \nmore descriptive in tone, dedicates a chapter to the transformations affected by each of \nthese drivers. These drivers in turn define three corresponding domains for policy: \nurbanization, territorial development and regional integration, the themes of Part Three.  \n                                                 \n1\n The Report can be downloaded from the World Bank‘s website at http:\/\/econ.worldbank.org \n 3 \nStructuring the Report around these groups of three has the effect, the authors suggest, \nthat it can be read ‗by part or policy‘.  The reader interested in concepts can read just \nPart 1, while people interested in agglomeration can read the Report ‗vertically‘, looking \nonly at the chapters on Density, Agglomeration and Scale Economies, and Urbanization \npolicies. Whilst this clear structure is helpful to the reader, the continuous use of tripartite \ndivisions throughout the Report gives the impression that the desire for simplicity of \nstructure may be obscuring complexity of experience and, therefore, is rather suspect.  \n \nIn terms of policy responses, density is seen to operate most powerfully at the local level, \ndistance is the most critical dimension at the national level, and division is the most \nimportant dimension at the international level. Governments can intervene to reduce \nspatial disparities through three types of instrument: institutions (which should be \nspatially blind and universal in coverage), infrastructure (to drive spatial connection), and \nincentives (which are spatially targeted interventions). The preference is for policies to \nfocus on spatially blind institutional interventions.  Consistent with recent trends in \nmultilateral lending, the Report is also supportive of infrastructural investments.  It is most \ndiffident about spatially targeted interventions to foster economic activity on the grounds \nthat historically they have failed to offset tendencies toward economic concentration.  \n \nThe Report is packed full of examples drawn from across the world and, unlike many \npreceding WDRs, this one is particularly concerned to draw inspiration from advanced as \nwell as developing economies. This approach to the use of example has two \nconsequences.  It allows the authors to put their stylized facts and 3-D structure ‗in place‘ \n– indeed, they claim that ‗Place is the most important correlate of a person‘s welfare‘ \n(World Bank 2009, 1).  Second, it gives the Report a vaguely evolutionist feel.  It is hard \nto escape the sense that, in the final instance, the experiences of the US and (to a lesser \nextent) Europe and contemporary China offer models from which the rest of the world \nought to learn. Thus one encounters sections entitled ‗Overcoming distance in North \nAmerica‘ (pages 45-46), ‗Overcoming division in Western Europe‘ (pages 122-124), and \n‗Distance and division in East Asia‘ (pages 194-196), which are positive in tone and \ntherefore become exemplar experiences. The African regional vignette, by contrast, \nhighlights multiple disadvantages: \n \n―Sub-Saharan Africa today suffers from the triple disadvantages of low density, long \ndistance, and deep division that put the continent at a developmental disadvantage. \nThese spatial dimensions reduce proximity between economic agents within Sub-\nSaharan Africa, and between Africa and the rest of the world. ‗Cumulative causation‘ \nbetween these forces catches many countries in Sub-Saharan Africa in a ‗proximity \ntrap‘‖ (World Bank 2009, 283). \n \nArgumentations, simplifications and omissions \nThe Report purports to re-energise geography‘s place in understanding economic and \nhuman development. In this section we reflect on the literatures that are cited in the \nReport, the approach that is taken, and the evidence that is deployed to make the case. \nWhat, in other words, is the disciplinary span, the historical reach and the evidential \nsubstance of the Report? \n \nSelecting literatures \nThe main perspective adopted in the Report derives from the relatively new and growing \nbody of literature known as ‗new economic geography‘. The inspiration for this literature \nis not the discipline of geography. Economists‘ theoretical constructs have avoided \nreference to existing economic geography. Instead they have theorized agglomeration \nwith the intention of revising neo-classical equilibrium models to take scale into account. \nNew economic geography theorists see their initiative as a major contribution to \neconomics as a discipline by helping to resolve the distortions of market imperfections \nthat have plagued modelling exercises. Scale, it is believed, adds complexity and most \nimportantly realism to their analyses. This view has been validated by the award of a \n 4 \nNobel prize to Paul Krugman this year for his pioneering work in new economic \ngeography. \n \nFew geographers would claim to be the fount of all wisdom on the spatial dimensions of \ndevelopment, but one would have thought that the discipline had something relevant to \nsay as well.  Yet this report cites scarcely any geographers – neither those early analysts \nof the relationships between space, economy and society, nor subsequent critics and \ninnovators.  Consider some of the more startling gaps. There is considerable discussion \nof the role of secondary urban centres in the Report but no mention of Dennis \nRondinelli‘s work on secondary cities and area development. Much play is made in \nChapter 7 on the possibility of fostering ‗Concentration without congestion‘ but no \nreference is made to Terry McGee‘s pioneering work on extended metropolitan regions in \nAsia. Tracking back in time, a geographer might also have expected some reference to \nearly work on spatial location such as that by Peter Haggett,\n2\n Peter Gould or Dick \nChorley, to name just three. All this is absent. Even more remarkably, Gunner Myrdal‘s \nwork on circular and cumulative causation (despite circular causation being one of the \nReport‘s ‗stylized facts‘) is ignored, as too is Michael Lipton‘s work on urban bias, and all \nthe literature by earlier development economists and others which followed his key \ncontribution.  Among more recent authors, Doreen Massey‘s sustained, critical (but also \npractically engaged) interpretations of regional inequality and policy merit no comment.  \nNor will one find here serious engagement with the work of Allen Scott, Peter Dicken, or \nany number of geographers\n3\n who have a great deal to say about the issues addressed in \nthe report, and whose work can hardly be dismissed as irrelevant to policy, or as unduly \ncritical of orthodox institutions.   \n \nAs a result, the Report appears, to geographers at least, academically narrow and \nhistorically shallow. It gives the impression that scholarship on economic geography \nbegan in the last decade or so. The result is that at times ‗old‘ issues and debates are \npresented as ‗new‘ insights (c.f Martin 2008). This, in turn, means that the evolution of \nscholarship and understanding has been underplayed in general, and often overlooked \nentirely. Had the authors of the Report taken the time to read these geographical and \nhistorical literatures and cast their net more widely they could have made some of the \ndiscussion both stronger and more nuanced.  The Report‘s enthusiastic discovery of \ncentral place theory could, for instance, have been tempered by the longstanding \nprofessional experience of previous agglomeration modellers from geography who know \nall too well the complexities of urban growth and welfare. More generally, the Report \nwould have been less mechanical in its depiction of the links between space, economic \nactivity and welfare(Smith, 1977); it would have gone much further in considering the \npolitics of spatial processes (Massey, 1984); it would have, at a higher level still, \n‗humanised‘ the spaces of economic activity (Wills and Lee, 1997); and it would have \nrecognized the many co-constituting intersections between economy and environment \n(Bridge, 2002). We expand on some of these points below. \n \nOf course, one might say that the absence of geographers‘ work, and the almost total \nabsence of geographers from the team that prepared the Report as well as the advisory \nAcademic and Policymaker Panels, reflects our discipline‘s failure to engage as much as \nthe Report‘s failure to recognize.  This may be so, but boundaries can be crossed from \nboth sides and this WDR makes precious little effort at boundary crossing.  While the \nReport calls for spatially blind institutions to foster density, reduce distance, and weaken \ndivision, its authors have assumed a monochromatic view of the world that has the effect, \nin disciplinary terms, of creating distance and deepening divisions.  \n \nArgumentation and privileging evidence \n                                                 \n2\n Elected a Foreign Associate, no less, of the US National Academy of Sciences. \n3\n Michael Storper is cited once (but a co-authored paper with economist Anthony Venables) \nas is Ron Martin (but only an unpublished paper). \n 5 \nA second concern we have relates to the way in which argument is constructed and \nsupporting evidence selected in the Report. The style of expression tends towards \nsimplification and at times smugness. Countries and regions are uncomfortably prised \ninto singular models. Difference is overlooked in the interest of the argument that the \nReport constructs and projects. There may be examples drawn from around the world, \nbut they are cherry picked and exceptions to the rule are not explored. The Report asks \ncomplex questions and then provides simple answers.  As just two examples: \n \n‗Are the policy messages of this Report anti-rural? No.‘ (World Development 2009, \n200) \n‗Are the policy messages of this Report anti-decentralization. No.‘ (World \nDevelopment 2009, 231) \n \nYet such difficult questions deserve far more deliberation since the reality of difference is \neschewed. So, for example, in considering urban transitions there is no attempt to think \nabout whether there are important differences between urbanisation processes across \nthe world, and to ask why that might be so.  More generally, the Report offers little \nembedded understanding of the empirical material that it uses to make its case.  This is \njarring, for two reasons.  First, space, difference, distance and division are treated out of \ncontext.  Historical examples are used not as contingent phenomena from which to learn, \nbut rather as examples from which lessons can be transferred elsewhere.  Positivism \ntrumps realism here, and all the work done since the 1970s to demonstrate the \nembeddedness of spatial relationships and the co-constitution of geography and political \neconomy might as well not have happened for this Report (see, for example: Bebbington, \n2000, Corbridge and Jewitt 1997, Johnson et al 2005, Li 1999, McEwan 2005, Mood \n2005, and Radcliffe and Laurie 2006). Second, qualitative analysis is eschewed.  \nDiscussing the Report in a workshop, one of its authors characterized such analysis as \nmerely anecdotal.  In Habermas‘s (1971) old terms, there is so much desperation for \ninstrumental knowledge, that anything vaguely hermeneutic or critical is treated as an \nirrelevance.  This is extreme even for the World Bank, for qualitative work has affected \nearlier WDRs.  Whatever its methodological shortcomings, the Voices of the Poor studies \n(Narayan 2000) that sought to capture people‘s own views and experiences of being poor \nand excluded had a very significant effect on the 2000\/2001 WDR on poverty.  In that \nsense, this Report reflects the extent to which relatively orthodox economists are once \nmore in absolute ascendance inside the Bank following a decade of internal debate about \ndevelopment, perhaps best reflected in the furore over the 2000\/2001 WDR which led to \nthe resignation of the team‘s Director, Ravi Kanbur (see Maxwell 2001, Kanbur 2001, \nBebbington et al., 2004). \n \nCondensing scale \nThe twin problems of how evidence is used and argument constructed are brought \ntogether in the Report‘s treatment of scale. There is, to be sure, a good deal of multi-\nscalar discussion. Indeed a three-fold scalar division lies at the heart of the Report. \nWhere the Report fails is in taking forward any analysis of relationships between scales. \nLocal level difference becomes lost by the time the discussion gets to generalisations at \nhigher levels of analysis. Maps of poverty are drawn at such a small scale that they hide \nas much as they reveal. Issues such as the transference of poverty from rural to urban \nareas is hidden, while the delocalisation of livelihoods and the dissolution of the \nhousehold as a co-residential dwelling unit comes to be seen as mere distraction rather \nthan a critical process in the shaping of spatial transformations. \n \nAt their highest level, the typologies that the Report constructs, while possibly useful \ndidactic starting points can, if taken too far, become absurd abstractions or even \ndangerous ones if translated into policy. As just one example, in the Report‘s final \nchapter 9, the world is subdivided into three types of country which are then boxed into \nthree types of developing region. Type I are countries in regions close to large world \nmarkets; Type II are countries in regions with big neighbours far from world markets; \n 6 \nwhile Type III are countries in regions far from world markets and without a large \nneighbour. This means that within the category Type II we have one of the world‘s most \nconnected countries (Singapore) and one of the world‘s least connected (the Lao PDR). \nThis crude typology then leads to a discussion of the ‗integration options‘ for countries of \neach type.  \n \nWhat is here and what is not \nTexts are as much defined by what they omit as by what they say, and this is certainly so \nwith this Report.  A number of serious omissions compromise the Report‘s central \narguments and policy prescriptions. In this section we focus on the Report‘s exclusion of \nsociety and environment, its simplification of politics and institutions, and its erasure of \nhistory. \n \nExclusions: society and the environment \nThe most important paragraph in the report, to our mind, comes in a short box in the \nintroductory chapter entitled ‗What this report is not about‘: \n \n‗To keep the Report focused, several important aspects of the spatial transformations \ndo not get the attention they would in a fuller study. The main aspects not considered \n– except when emphasising or qualifying the most important messages – are the \nsocial and environmental effects of a changing economic geography.‘ (World Bank \n2009, 34 [emphasis in original]). \n \nThis orientation is justified on the ground that this is an exercise in economic geography \nand therefore such effects can legitimately be excluded.  Yet these omissions leave \ndoubts about both the internal coherence of the Report‘s argument as well as its external \ncoherence with the Bank‘s stated mission of poverty alleviation.   \n \nOn internal coherence, the Report argues that human capital must be treated as \nendogenous in growth processes.  This is central to the ways in which the Report argues \nfor the benefits of agglomeration, with the returns to human capital increasing the greater \nthe concentration of human capital.  This allows the report to dismiss arguments (such as \nTodaro‘s) that draw attention to the costs of urban migration and therefore raise doubts \nabout its effects on growth (Harris and Todaro 1970).  Yet, one wonders, if human capital \nmust be considered endogenous to growth processes, how can it be consistent to then \nsay that natural and social capital should be treated as exogenous, and that the social \nand environmental should each be relegated to the domains of ‗effects‘ rather than of \n‗causes‘ in our understanding of development? \n \nSecond, how can it be consistent for the flagship report of the World Bank, which has as \nits strapline ‗Working for a world free of poverty‘, to produce a report of 380 pages that \nlargely ignores the social and environmental origins and consequences of the processes \nand policies which it addresses and promotes? What is all the more remarkable is that \nthe Report appears to be concerned with ‗point[ing] the way towards a more inclusive \ndevelopment‘, and yet evidently feels that inclusion can be examined without spending \ntoo much time considering the social and environmental aspects of inclusion. \n \nSince the 1970s, geographers have sought to humanise space, to move from abstract \ngeometry to inclusive geography highlighting the differences between ‗space‘ and ‗place‘. \n‗Space‘ has become a place of conflict, cooperation and interaction with people engaging \nwith space in different ways. Rather than merely noting, measuring and costing the \nmovement of goods or people, as the Report tends to do, geographers, sociologists and \nothers ask questions about why some people are mobile and others are not, reflecting on \nhow mobility re-works the nature of households and livelihoods (see, for example: \nGardner and Osella 2004, Hampshire 2002, Koning 2005, McKay 2005, Rogaly and \nCoppard 2003; Silvey and Elmhirst, 2002). Our discipline has been concerned, for \nexample, with how young women‘s experience of working in factories in or close to urban \n 7 \ncentres ripples back to affect inter-generational relations, the sustainability of rural \nlivelihoods, and the meaning of ‗home‘ to these urban sojourners.  This orientation results \nin scholars identifying the emergence of ‗remittance landscapes‘ in rural areas and the \nconstruction of rural villages as socially urban spaces (for just some such work in SE \nAsia see Rigg 2006, Mills 1999, Thompson 2007, Silvey and Elmhirst 2002).  \n \nThe Report, however, has picked up on none of these debates and instead uses place as \na mere adjunct to space, with the result that ‗place‘ is conceptualised as a de-humanised \nand, to a large extent, de-politicised space. Space is merely a zone where economic \nactivity occurs, or does not. The focus of the Report is on the mechanics of spatial \ntransformations; it does not go to the next level to analyse where those mechanics take \nus in terms of their effects and consequences for people and places. More specifically, it \nmeans that in the Report there is no real consideration of debates which we would regard \nas not merely incidental, but central to building an understanding of spatial \ntransformations and their origins and effects. For example, considerations of gender and \nethnicity are notably absent from the Report; there is no discussion of the role of \ngenerational dimensions in shaping economic geographies and spatial interactions; there \nis no concerted attempt to look at how space, economic activity and social exclusion \nintersect; there is little on the politics of space, and spatial politics; and there is nothing \non environmental issues and how they emerge in spatially contingent ways. We regard \nthese absences as major omissions – paradigmatic blind spots that arise because of the \nway that certain forms of evidence and approach are privileged over others.   \n \nSimplifications: politics, institutions, cultures \nThe Report‘s so-called ‗new approach‘ regarding how to improve welfare in lagging areas \nis that ‗territorial development policies should integrate lagging with leading areas, and \nthe discussion of spatially targeted incentives should come last‘ (World Bank 2009, 231).  \nPromoting density and human mobility towards such centres of density is, in this \nrendering, the cornerstone of good economic geography policy. There are echoes here of \nformer UK Conservative minister, Norman Tebbit, who, during the 1980s recession, \nfamously told unemployed people in the lagging regions of the UK to ‗get on yer bike‘ and \nhead off to regions with greater economic activity.  Tebbit‘s intervention became so \ninfamous because it reflected a complete erasure of histories and injustices (next \nsection), a deprecation of regional cultures and a call for markets to resolve problems of \nregional politics.  In arguing for increased mobility in labour markets to offset regional \ninequalities, and ignoring the cultural nature and consequences of such processes, the \nReport seems close to conveying the same impressions. Its willingness to entertain the \ncase for targeted intervention to foster economic activity seems at best grudging.  \nIndeed, targeted spatial interventions are presented only as a final policy option, and are \nportrayed mostly as exercises in economic inefficiency rather than attempts to respond to \ngeographical injustices. \n \nConsider just two of the simplifications at work in the text.  While some institutions may \nbe spatially blind, all are culturally embedded and culturally consequential, yet the Report \nskates over this quality of institutions.  As a result, just as Tebbit‘s comments were so \nculturally laden so too are the recommendations the Report makes to, for instance, \nliberalize rural land markets in lagging areas in order to help people sell their assets and \nthus have the capital to assist their out-migration to centres of agglomeration.  To raise \nconcerns about the meaning embedded in such policy suggestions and in the \nconsequences that they might have is not just a concern for starry eyed ethnographers \nand indigenous romantics.  When in 2008 the Peruvian government sought to foster quite \nsimilar policies to those that the Report suggests, it induced a strike led by indigenous \norganizations which ultimately closed down much of its Amazon (increasing economic \ndistance!) and forced the government to back down.  Making institutional \nrecommendations out of context can lead to bad policy advice.  \n \n 8 \nSecond, while the Report does give somewhat more attention to politics than to social \nissues and the environment, the political tends to be seen as a barrier to efficient spatial \ninteraction and integration, rather than as a reason for spatial interventions. The Report \nfavourably notes Deng Xiaoping‘s adage that ‗if all of China is to become prosperous, \nsome [areas] must get rich before others‘ (World Bank 2009, 73). This becomes the \nplatform to state that ‗This chapter shows that successful developers support‘s Deng‘s \ninsight‘ while also noting that ‗his wisdom may have eluded leaders in the developing \nworld‘ (World Bank 2009, 73). In the next sentence, the Report rather disparagingly \nstates that ‗for decades, ―spatially balanced growth‖ has been the mantra of policymakers \nin many developing countries‘ (World Bank 2008, 73). This sequence of argument is \nwrong, or at best narrow, in a number of respects. China has not ignored the tensions \nthat arise from spatially unbalanced growth, and policies continue to partially control the \nfree operation of the space economy, not least through the hukou (household \nregistration) policies inherited from the Maoist period (Chan and Zhang 1999, Goodkind \nand West 2002). At the same time, the implication that other countries have adopted a \nmantra of ‗spatially balanced growth‘ is simply myopic. Policymakers have long \nrecognised the impossibility of spatially balanced growth. They have also well \nappreciated, however, the political necessity – sometimes, imperative – to have an \nelement of regional development in their plans even if the logic of the development \nprocess may work against those regional development efforts. The Asian Development \nBank has, coincidentally, recently published a report on inequality in Asia (ADB 2007) \nwhich makes considerable play of the politics of inequality, noting that ―persistent and \nwide differences in mean outcomes across social groups can have serious \nconsequences for social and political stability‖, further noting that ―persistent and \nsignificant mean differences can also be normatively unacceptable‖ (ADB 2007: 58). The \nReport, therefore, sets up a straw figure by misrepresenting the position of most \npolicymakers, simplifying the experience of most countries, and overlooking the wealth of \ndiscussion and debate on this very issue. \n \nErasures: histories, injustices \nTo treat regional inequality as a function of density, distance and division diverts attention \nfrom the relationships of power that also help sustain inequality (a point that was made in \nthe WDR of 2006 [World Bank, 2006] but is absent here).  In many of the places in which \neach of us do our own work, the ‗margins‘ are marginal not because they are far from \ncentres of agglomeration but rather because they have been produced as places that are \ndistant from centres of power.\n4\n  Furthermore, they are far from centres of power because \nthese very centres have been produced through acts of dispossession and practices of \nracism that systematically exclude certain social and ethnic groups from exercising \nsignificant levels of political influence.  This is hardly an earth-shattering observation - \none only has to think of the Guatemalan altiplano or the Peruvian Andes.  Yet these sorts \nof history are absent in the Report‘s understanding of how uneven geographies are \nproduced. Understanding regional inequalities as an effect of social and power relations \nwould make it clear that it is no accident that certain regions become poor and stay poor.   \n \nTwo consequences derive from this erasure of history and they each have implications \nfor how the report treats policy.  First, understanding the production of regional inequality \nas a consequence of long-standing inequitable social and political relationships would \nimply that policies to address this inequality – be these spatially blind policies or targeted \nones – are unlikely to emerge without struggle.  This is for the very same reasons that \nproduced regional inequity in the first place.  In short there are interests that benefit from \nregional inequalities and their perpetuation, these interests are by definition over-\n                                                 \n4\n In terms of our field experiences, Jonathan Rigg works mainly in Southeast Asia; Anthony \nBebbington in Latin America; Katherine Gough in West Africa, Southeast Asia and Latin \nAmerica; Deborah Bryceson in Africa; Jytte Agergaard in South and Southeast Asia; Niels \nFold in Africa and Southeast Asia; and Cecilia Tacoli in Africa and Asia. \n \n 9 \nrepresented in the institutions that reproduce these inequalities, and they will therefore \nresist efforts to address them.  Policy is not then a realm only of technocrats awaiting \ngood advice, but also of socio-political interests who are quite clear about what they want \nto defend.  This Pandora‘s box is not recognized, far less opened, in the ways in which \nthe Report talks of policy.  \n \nSecond, the combined effect of these historical erasures and of the principles that \nunderlie the Report‘s analysis of the space economy is to remove any notion of justice as \na legitimate criterion for making policy choices.  Writing off spatially targeted policies on \nthe grounds that they ultimately waste resources overlooks the possibility that (whether \nor not we agree with this claim) this may not be the point.  In a positive sense, such \npolicies might be pursued because governments feel the need to do something about \nsuch histories; and in a normative sensitive, justice, an attempt to account for such \nhistorical wrongs, might be as sound a principle for policy as efficiency.  \n \nSo what? \nThis essay clearly reveals our sense that Reshaping Economic Geography is a \ndisappointment.  It does a disservice to economic geography (at least as done by many \ngeographers) and it elides many or most of the interesting debates in development \ngeography.  Most of what we feel economic geographers have and could contribute to \nour own work as development geographers is missing; and by the same token there is no \nsense in the Report that critical discussions about development have had any influence \nat all on how the economy is conceptualized.  In this report, even though the \n―development‖ goals are noble, the appropriate management of the economy precedes \nall else and issues of power, politics and embeddedness, so creatively worked by \ndevelopment and economic geographers, have very little purchase.  Certainly they seem \nnot to have complicated the arrow that, in this report, seems to run straight from \neconomic first principles to development outcomes.  Just consider the opening and \nclosing sentences of the Report‘s Overview: \n \n―Economic growth will be unbalanced, but development still can be inclusive—that is the \nmessage of this year‘s World Development Report‖ (page 1). \n \n―Everyone should support the efforts of these ―bottom billion‖ countries to integrate their \neconomies, within and across borders. A billion lives depend on it‖ (page 32). \n \nOur concerns with the Report, and our collective sense that it has not effectively bridged \nthe gap between ‗[economic] geography‘ and ‗development‘ can be distilled down to four \ncore issues. \n \nFirst of all, we believe that the devil of spatial transformations – how they occur and what \nthey mean – really is in the detail. While the Report is dense in the wealth of material \npresented, its arguments and interpretations seem ultimately thin. There is no creative \nattempt to think about the intersection of space, economy, society and politics. Research \nthat might challenge the view that the Report presents is neither used to unsettle its neat \nstructure and prescriptions, nor engaged with so as to foster creative debate over the \ntension between generalisation and specification.  Instead it is pushed to the margins. \n \nSecond, we do not believe that a serious analysis of the spatial dimensions of \ndevelopment can ignore the societal and environmental sources and implications of such \ntransformations nor treat society and environment as exogenous to growth and regional \ndevelopment processes. Not only do society, culture and politics shape spatial \ntransformations, but those spatial transformations feed back into profound changes in \nsociety, culture and politics.  \n \nThird, the Report is narrow in several other key respects. It is narrow in its disciplinary \nreach. It is narrow in its historical perspective. And it is narrow in its attention to scale.  \n 10 \n \nFourth, and most important, the Report‘s exclusions, simplifications and erasures have a \nprofound influence on the message conveyed.  The socio-political causes of regional \ninequality are invisible, policy is treated as a problem only of design but not also of \npolitics, questions of justice are absent and the potential environmental impacts of \nadvanced agglomeration and large-scale infrastructure development are at best epi-\nphenomena.  We sense that had a team of geographers written this Report, such issues \nwould have received more treatment and would have led to different conclusions and \npolicy prescriptions.  \n \nIs this sour grapes that the World Bank should be claiming to be ‗reshaping economic \ngeography‘ while ignoring the work of generations of geographers? To some extent, it is; \nand to some extent it is frustration that geographers‘ work has made so little impression \non the hegemonic discipline in social science. Still, we end with a question: how would \neconomists feel if a group of geographers sought to re-shape economics and blithely \nignored their scholarship? \n \nAcknowledgements \nThis paper stems from a one day workshop held at the Department of Geography and \nGeology, University of Copenhagen on October 31, 2008. We are grateful to the World \nDevelopment Report 2009 director, Indermit Gil, for giving us access to pre-publication \ncopies of the report, and to Truman Packard, one of World Bank‘s main authors of the \nReport, for participating in the workshop and engaging in discussions with us. Funding for \nthe workshop provided by the Danish Development Research Network and the \nEnvironment and Society in Developing Countries Research Group at the Department of \nGeography and Geology, University of Copenhagen, is gratefully acknowledged.  Tony \nBebbington acknowledges the support of an Economic and Social Research Council \nProfessorial Fellowship (RES-051-27-0191).\n 11 \nReferences \n \nADB 2007 Key indicators 2007: inequality in Asia Manila: Asian Development Bank. \nBebbington, A. 2000 Re-encountering development.  Livelihood transitions and place \ntransformations in the Andes.  Annals of the Association of American Geographers \n90 495-520. \nBebbington A, Guggenheim, S, Olson, E, and Woolcock, M. 2004 Exploring Social \nCapital Debates at the World Bank. Journal of Development Studies 40 33-64  \nBridge, G. 2002 Grounding Globalization: The Prospects and Perils of Linking Economic \nProcesses of Globalization to Environmental Outcomes. Economic Geography 78 \n361-386 \nChan K W and Zhang L 1999 The hukou system and rural-urban migration in China: \nprocesses and changes China Quarterly 160 18–55 \nCorbridge S and Jewitt S 1997 From forest struggles to forest citizens? Joint Forest \nManagement in the unquiet woods of India‘s Jharkhand Environment and Planning A \n29 2145–2164. \nGardner K and Osella, F 2004 ‗Migration, modernity and social transformation in South \nAsia: an introduction‘, in: K Gardner and F Osella (edits) Migration, modernity and \nsocial transformation in South Asia, Contributions to Indian Sociology, Occasional \nstudies 11, New Delhi: Sage Publications, pp. xi–xlviii. \nGoodkind D and West L A 2002 China‘s floating population: definitions, data and recent \nfindings Urban Studies 39 2237–2250 \nHabermas J 1971 Knowledge and human interests Beacon Press Boston \nHampshire K 2002 Fulani on the move: seasonal economic migration in the Sahel as a \nsocial process Journal of Development Studies 38 15–36. \nHarris J and Todaro M 1970 Migration, unemployment and development: a two-sector \nanalysis American Economic Review 60 126–42. \nJohnson C, Priya Deshingkar and Start D 2005 Grouding the state: devolution and \ndevelopment in India‘s panchayats Journal of Development Studies 41 937–970. \nKanbur R 2001 Economic policy, distribution and poverty: the nature of disagreements \nWorld Development 29 1083–1094. \nKoning J 2005 The impossible return? The post-migration narratives of young women in \nrural Java Asian Journal of Social Science 33 165–185. \nKoppel B 1991 The rural–urban dichotomy reexamined: beyond the ersatz debate? In \nGinsburg N, Koppel B and McGee T G (eds) The extended metropolis: settlement \ntransition in Asia University of Hawaii Press, Honolulu 47–70 \nLi T M 1999 Compromising power: development, culture and rule in Indonesia Cultural \nAnthropology 14 295–322. \nMartin R 2008 The 'New Economic Geography': credible models of the economic \nlandscape? in Leyshon A, McDowell L and Sunley P eds A compendium of economic \ngeography Sage, London \nMassey, D 1984  Spatial Divisions of Labour.  Methuen, London. \nMaxwell S 2001 WDR 2000: is there a new ‗new poverty agenda‘? Development Policy \nReview 19 143–149. \nMcEwan C 2005 New spaces of citizenship? Rethinking gendered participation and \nempowerment in South Africa Political Geography 24: 969–991. \nMcKay D 2005 Reading remittance landscapes: female migration and agricultural \ntransition in the Philippines Geografisk Tidsskrift, Danish Journal of Geography 105 \n89–99. \nMills M B 1999 Thai women in the global labor force: consumed desires, contested \nselves Rutgers University Press, New Brunswick \nMood, M S 2005 Opportunists, predators and rogues: the role of local state relations in \nshaping Chinese rural development Journal of Agrarian Change 5 217–250. \nNarayan D 2000 Can Anyone Hear Us? Oxford University Press, New York; World Bank, \nWashington DC \n 12 \nRadcliffe S and Laurie N 2006 Culture and development: taking culture seriously in \ndevelopment for Andean indigenous people Environment and Planning D: Society \nand Space 24 231–248. \nRigg J 2006 Land, farming, livelihoods and poverty: rethinking the links in the Rural \nSouth World Development 34 180-202 \nRogaly B and Coppard D 2003 ‗They used to go to eat, now they go to earn‘: the \nchanging meanings of seasonal migration from Puruliya District in West Bengal, India \nJournal of Agrarian Change 3: 395–433. \nSilvey R and Elmhirst R 2002 Engendering Social Capital: Women Workers and Rural–\nUrban Networks in Indonesia‘s Crisis World Development 31 865-879 \nSmith, D M 1977  Human geography: a welfare approach. London: Edward Arnold \nThompson E C 2007 Unsettling absences: place, migration, and urbanism in rural \nMalaysia NUS Press, Singapore \nWills, J. and Lee, R. eds. 1997  Geographies of Economies.  Hodder Arnold, London. \nWorld Bank 2001 Attacking poverty World Development Report 2000\/1 World Bank, \nWashington DC \nWorld Bank 2006 Equity and development World Development Report 2006 World \nBank, Washington DC \nWorld Bank 2009 Reshaping economic geography World Development Report 2009 \nWorld Bank, Washington DC \n \n \n"}