{"doi":"10.1017\/S1369415400000790","coreId":"212547","oai":"oai:eprints.lse.ac.uk:25009","identifiers":["oai:eprints.lse.ac.uk:25009","10.1017\/S1369415400000790"],"title":"Kant's indemonstrable postulate of right: a response to Paul Guyer","authors":["Flikschuh, Katrin"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":"The indispensability of the ‘postulate of practical reason with regard to Right’ to Kant's property argument in the Rechtslehre is now widely recognized. However, most commentators continue to focus their attention on the relation between the postulate and the deduction of the concept of intelligible possession. The nature of this relation remains a matter of dispute in part because the precise position of the postulate within chapter one of the Rechtslehre remains undecided. Given this, it is perhaps not surprising that the related question has been neglected, as to why Kant should characterize the postulate of Right as a postulate of practical reason. Yet the fact that he does so is of some significance – especially if one recalls the definition in the Critique of Practical Reason of postulates of practical reason as practically necessary but theoretically indemonstrable propositions. What is of interest about this definition is not just the fact that it designates postulates as practically necessary and as theoretically indemonstrable at the same time – even more intriguing is the intimated relation between practical necessity and theoretical indemonstrability. Kant does not think the postulates' theoretical indemonstrability morally insignificant. To the contrary, their moral significance for us appears to be a function, in part, of their theoretical indemonstrability","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/212547.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25009\/1\/Kant%27s%20indemonstrable%20postulate%20of%20right%28lsero%29.pdf","pdfHashValue":"34790bc124d94cf056812d267c62ae176e005f5f","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25009<\/identifier><datestamp>\n      2012-08-23T14:06:42Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25009\/<\/dc:relation><dc:title>\n        Kant's indemonstrable postulate of right: a response to Paul Guyer<\/dc:title><dc:creator>\n        Flikschuh, Katrin<\/dc:creator><dc:subject>\n        B Philosophy (General)<\/dc:subject><dc:description>\n        The indispensability of the ‘postulate of practical reason with regard to Right’ to Kant's property argument in the Rechtslehre is now widely recognized. However, most commentators continue to focus their attention on the relation between the postulate and the deduction of the concept of intelligible possession. The nature of this relation remains a matter of dispute in part because the precise position of the postulate within chapter one of the Rechtslehre remains undecided. Given this, it is perhaps not surprising that the related question has been neglected, as to why Kant should characterize the postulate of Right as a postulate of practical reason. Yet the fact that he does so is of some significance – especially if one recalls the definition in the Critique of Practical Reason of postulates of practical reason as practically necessary but theoretically indemonstrable propositions. What is of interest about this definition is not just the fact that it designates postulates as practically necessary and as theoretically indemonstrable at the same time – even more intriguing is the intimated relation between practical necessity and theoretical indemonstrability. Kant does not think the postulates' theoretical indemonstrability morally insignificant. To the contrary, their moral significance for us appears to be a function, in part, of their theoretical indemonstrability.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2007-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25009\/1\/Kant%27s%20indemonstrable%20postulate%20of%20right%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Flikschuh, Katrin  (2007) Kant's indemonstrable postulate of right: a response to Paul Guyer.  Kantian Review, 12 (1).  pp. 1-39.  ISSN 1369-4154     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=KRV<\/dc:relation><dc:relation>\n        10.1017\/S1369415400000790<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25009\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=KRV","10.1017\/S1369415400000790"],"year":2007,"topics":["B Philosophy (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nKatrin Flikschuh \nKant's indemonstrable postulate of right: a \nresponse to Paul Guyer \n \nArticle (Published version) \n(Refereed) \n \n \n \n \nOriginal citation: \nFlikschuh, Katrin (2007) Kant's indemonstrable postulate of right: a response to Paul Guyer. \nKantian review, 12 (1). pp. 1-39. ISSN 1369-4154  \nDOI: 10.1017\/S0003975605000159 \n \n© 2007 University of Wales Press \n  \nThis version available at: http:\/\/eprints.lse.ac.uk\/25009\/  \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKant's Indemonstrable Postulate of\nRight: A Response to Paul Guyer\nKATRIN FLIKSCHUH\ni London School of Economics\n'Die Freiheit selbst [ist] nicht in meiner Gewalt'1\nI. Introduction\nThe indispensability of the 'postulate of practical reason with\nregard to Right'2 to Kant's property argument in the Rechtslehre is\nnow widely recognized. However, most commentators continue to\nfocus their attention on the relation between the postulate and the\ndeduction of the concept of intelligible possession. The nature of\nthis relation remains a matter of dispute in part because the precise\nposition of the postulate within chapter one of the Rechtslehre\nremains undecided.3 Given this, it is perhaps not surprising that the\nrelated question has been neglected, as to why Kant should charac-\nterize the postulate of Right as a postulate of practical reason. Yet\nthe fact that he does so is of some significance - especially if one\nrecalls the definition in the Critique of Practical Reason of postu-\nlates of practical reason as practically necessary but theoretically\nindemonstrable propositions. What is of interest about this defin-\nition is not just the fact that it designates postulates as practically\nnecessary and as theoretically indemonstrable at the same time -\neven more intriguing is the intimated relation between practical\nnecessity and theoretical indemonstrability. Kant does not think\nthe postulates' theoretical indemonstrability morally insignificant.\nTo the contrary, their moral significance for us appears to be a\nfunction, in part, of their theoretical indemonstrability.\nIf current interpreters of Kant's practical philosophy have tended\nto side-step the issue of the postulates' place within it, this is\nlargely because of their propositions' transcendent implications -\nKANTIAN REVIEW, VOLUME 12, 2007 1\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nimplications which are considered to be inappropriate for a\nmodern, secular, practically orientated philosophical ethics.4\nHowever, some recent approaches have re-opened this issue, and\nhave argued the systematic importance of the postulates of the\nexistence of God and of the immortality of the soul to Kant's moral\nphilosophy once the latter is considered in a manner that goes\nbeyond practical concerns narrowly conceived.5 Though these\napproaches emphasize the importance of appreciating the transcen-\ndent dimension within Kant's practical writings, they do not\nthereby invoke or endorse a supersensible notion of transcendence\n- they do not appeal to a non-natural world peopled by supreme\nBeings, or to a Platonic plateau filled with Ideas. To the contrary,\nthese readings respect the fact that Kant's insistence upon the\ntheoretical indemonstrability of the postulate of the existence of\nGod, say, constitutes precisely a rejection of a notion of transcen-\ndence that equates it with the existence, or knowability, of a\nsupersensible world. Transcendence in the Kantian sense must be\nunderstood as the acknowledgement of the moral necessity, for us,\nof certain theoretical ideas and propositions, knowledge of the\nobjective contents of which is in principle unavailable to us. The\ntranscendent dimension within Kant's practical thinking thus refers\nto our acknowledged unknowability of practically necessary theo-\nretical propositions and Ideas.6\nThe present paper examines the status of the postulate of Right\nas a postulate of practical reason with reference to this notion of\ntranscendence as acknowledged unknowability. I shall argue that\nthe practical significance, for us, of the juridical postulate lies in\nour acknowledgement of the theoretical indemonstrability of its\npropositional content. The moral significance of such acknow-\nledged unknowability lies in the insight it affords us into our very\nlimited understanding of the ultimate grounds of our juridical obli-\ngations. This line of argument is motivated, in the first instance, by\na recent article by Paul Guyer, which does, unusually, consider the\nstatus of the postulate of Right as a postulate of practical reason.7\nGuyer's general approach to Kant's political philosophy is marked\nby a concern to demonstrate its philosophical proximity to current\npolitical thinking, especially to Rawlsian liberalism. Guyer accord-\ningly emphasizes what he takes to be the non-metaphysical\ncharacter of Kant's political thinking; his substantive focus is on\nestablishing Kant as the philosophical forerunner of contemporary\n2 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nliberalism, thereby demonstrating the supposed topicality of Kant's\npolitical philosophy for a variety of going liberal concerns.8 By\ncontrast, 'Kant's deductions of the principles of right' forefronts a\nnumber of systematic issues. One of them is the status of the postu-\nlate of Right as a postulate of practical reason. Guyer comes upon\nthis issue almost accidentally and as a result of his disagreement\nwith Markus Willaschek over the moral status of the universal\nprinciple of Right. According to Willaschek, Kant's characteriza-\ntion of the universal principle of Right as a 'postulate that is\nincapable of further proof'9 shows that it cannot have been derived\nfrom the categorical imperative, for if it had been thus derived,\nKant would not claim it to be non-provable. Since he does claim\nthis, the universal principle of Right must be treated as a juridical\nprinciple that is conceived independently of the categorical impera-\ntive, constituting an 'original expression of rational autonomy'.10\nGuyer's immediate concern is to show that the universal principle\nof Right is derived from the categorical imperative and that it\ndoes constitute a morally grounded juridical principle. This\nconcern engages him in an elaborate defence of the provability of the\npostulates of practical reason in the second Critique. Guyer's central\nclaim against Willaschek is that Kant's postulates of practical reason\nare not incapable of proof - that they constitute, rather, a 'particular\nkind of proof'.11 In a further step, Guyer applies the notion of\npractical provability gleaned from his analysis of the second\nCritique postulates to the postulate of Right: the idea is to show that\nthis postulate, too, is capable at least of a practical proof.\nI agree with Guyer that the postulate of Right is not posited\narbitrarily or spontaneously, as Willaschek suggests: it is intro-\nduced by Kant in the course of a complicated argument designed to\nestablish our a priori duty to enter into civil society with one\nanother. Yet I am puzzled as to why Guyer thinks the postulate\nprovable, or why he believes that it needs to be shown to be prov-\nable. Willaschek is right when he says that Kant regards the\npostulates of practical reason as incapable of proof - and indeed,\nthe Rechtslehre repeatedly reminds its readers of the juridical\npostulate's non-provability. But Willaschek is wrong to suggest that\nthe postulates' theoretical indemonstrability compromises their\nmoral status, and Guyer is therefore also wrong to assume that the\npostulates' moral status depends on showing them to be, in some\nsense, provable.\nKANTIAN REVIEW, VOLUME 12, 2007 3\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nOne might suspect the source of my disagreement with Guyer to\nbe merely terminological. Guyer acknowledges that Kant deems the\npostulates of practical reason theoretically indemonstrable: Guyer\nonly speaks of a special kind of proof - a practical proof - in relation\nto the postulates. While Kant considers the postulates of practical\nreason to be theoretically indemonstrable, he regards our appeal to\nthem as justified on practical grounds. So by practical provability\nGuyer might mean nothing more than practical justifiability. To\noffer a justification of our practically necessary assent to a postu-\nlate's theoretical proposition is not to offer a theoretical proof of the\ntruth of its propositional content. Perhaps, therefore, a practical\nproof is meant to amount to no more than a practical justification\nthus understood. A careful examination of Guyer's argument shows,\nhowever, that although he believes a practical proof of a postulate to\nfall short of a theoretical proof, he also thinks that practical prov-\nability takes him further than practical justifiability. Guyer does\nseem to want to offer a practical proof of the postulates' theoretical\npropositions, not merely a justification of our practically necessary\nassent to these propositions. The source of the disagreement\nbetween Guyer and myself is thus not merely terminological. While\nGuyer's notion of practical provability is weaker than that of theo-\nretical provability, it is stronger than that of practical justifiability.\nI believe Guyer's quest for practical provability in relation to\nKant's practical postulates to be misguided. I also believe this quest\nto be connected with Guyer's more general concern to provide a\nnon-metaphysical, non-transcendent reading of Kant's political\nphilosophy. Yet when applied to the postulate of Right, Guyer's\nnotion of practical provability encourages a misunderstanding of\nits systematic function in the context of Kant's property argument.\nIt also encourages the wrong moral conclusions. For these reasons\nthe dispute between Guyer and myself can be characterized as a\ndispute over the moral significance of the juridical postulate's\ntheoretical indemonstrability. Guyer wants to show that in so far as\nthe postulate of Right is capable of a practical proof, its theoretical\nindemonstrability is morally insignificant. Against this, I shall\nargue that an acknowledgement of the postulate's theoretical\nindemonstrability is morally significant for us in so far as it is\nprecisely this acknowledgement which affords us insight into the\nunconditional (and hence unknowable) grounds of our juridical\nobligations towards one another.\n4 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nThe remainder of the paper is structured as follows. The next\nsection offers a brief introductory outline of the juridical postu-\nlate's place and function in part 1 of the Rechtslehre on 'Private\nRight'. Section 3 considers the question of the provability of Kant's\npostulates of practical reason in general. I distinguish between\ntheoretical provability and practical provability, and between prac-\ntical provability and practical justification. Section 4 argues that\nGuyer's analysis of the juridical postulate in terms of practical\nprovability fails to offer an adequate reconstruction of its system-\natic function within Kant's property argument. I then go on to offer\nan alternative interpretation of the postulate's function, which is\nbased on the notion of practical justifiability. Section 5 contrasts\nthe normative implications, in relation to the postulate of Right, of\nGuyer's notion of practical provability with those of the notion of\npractical justifiability. I shall suggest that Guyer's non-metaphysical,\nnon-transcendent approach is driven by an underlying quest for\nmoral certainty regarding the grounds of our moral obligations,\nincluding our juridical obligations. But within a Kantian frame-\nwork, the achievement of such moral certainty comes at a high\nprice: it leaves us unable to account for the unconditional status of\nour moral obligations towards one another. Only a reading that\nacknowledges the transcendent dimension within Kant's political\nthinking - that acknowledges, in other words, the unknowability\nof the grounds of our juridical obligations - can account for the\nunconditional status of these obligations.\n2. Introducing the Postulate of Practical Reason with\nRegard to Right\nThe principal concern of the Rechtslehre is often assumed to\nconsist in a vindication of the universal principle of Right as that\nprinciple according to which, 'Any action is right if it can coexist\nwith everyone's freedom in accordance with a universal law, or if\non its maxim the power of choice of each can coexist with\neveryone's freedom in accordance with a universal law'.12\nHowever, I shall follow Bernd Ludwig's interpretation of the\nuniversal principle of Right as derived from the general version of\nthe categorical imperative outlined in the Groundwork in conjunc-\ntion with the concept of Right analysed in the Introduction to the\nKANTIAN REVIEW, VOLUME 12, 2007 5\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nRechtslehre.13 On this reading, the universal principle of Right\narticulates the categorical imperative as it applies to the domain of\nexternal freedom - freedom of choice and action in general. Since\nthe Critique of Practical Reason has already vindicated the cate-\ngorical imperative as a synthetic a priori principle of practical\nreason, a justification of the universal principle of Right cannot, on\nthis reading, constitute the philosophical burden of the\nRechtslehre. The principal argument is to be found not in the\nIntroduction but in Part 1 of the text, which deals with 'acquired\nRight', that is, with the right to external objects of one's choice.\nKant distinguishes between two categories of Right: innate Right\nand acquired Right. Each person has an innate right to freedom,\nand has it merely in virtue of their humanity: the innate right to\nfreedom thus covers a person's inner suum.14 However, Kant denies\nthat the category of acquired Right, which includes the right to\npossession of external objects of one's choice, can be derived from\na person's innate right to freedom directly. This denial represents\nKant's break with theories of natural property rights, a version of\nwhich he had himself endorsed in some of his earlier writings.15\nKant's revised position in the Rechtslehre designates the concept of\na property right as a moral concept, and therefore as a pure\nrational concept. As such, the concept of property rights specifies\nan 'intelligible'16 relation between subjects with regard to external\nobjects of their choice. In so far as property rights presuppose\nothers' justified exclusion from use of external objects of a person's\nchoice, a rightful claim to external possession presupposes others'\nacknowledgement of its rightfulness as the ground of its legitimacy.\nHowever, Kant's rejection of a natural or innate right to private\nproperty does not make him a consensus theorist on property\nrights. While a rightful claim to private property presupposes\nothers' assent, others are required to assent to its rightfulness in\naccordance with a universally valid law. This is because the concept\nof external freedom itself implies a claim to external objects of\none's choice.17\nThe relation between innate Right and acquired Right in the\nRechtslehre is thus complex and unusual. Clearly, the innate right\nto freedom does not cover all aspects of a person's rightful exercise\nof their external freedom: it covers relations between subjects in\ntheir inter-subjective external dealings with one another, but not\nrelations between subjects with regard to external objects of their\n6 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nr\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nrespective choices. I shall now make a simplifying assumption. I\nshall assume that the universal principle of Right as it is stated in\nthe introduction covers only persons' innate Right to freedom\n(their inner suum). It does not (yet) extend to relations of external\nmine and yours.18 The extension of the universal principle of Right\nto the category of acquired Right then becomes the central prob-\nlematic of part 1 of the Rechtslehre. According to Kant, the\npossibility of such an extension depends on the possibility of 'a\nsynthetic a priori proposition of Right'.19 Such a synthetic a priori\nproposition of Right, which includes what Kant calls the concept\nof intelligible possession, or of 'merely rightful possession',20 is in\nneed of a deduction. The task of chapter 1 of part 1 of the\nRechtslehre is to supply such a deduction. It is in connection with\nthe 'deduction of the concept of merely rightful possession' that\nKant introduces the 'postulate of practical reason with regard to\nRight':\nIt is possible for me to have any external object of my choice as mine,\nthat is, a maxim by which, if it were to become a law, an object of my\nchoice would in itself (objectively) have to belong to no one (res nullius)\nis contrary to Right.21\nI shall not here examine the complicated relation between postu-\nlate and deduction.22 Instead I shall focus only on the postulate of\nRight itself, which can be considered from two perspectives. First,\none might examine the postulate in terms of its function in the\ncontext of Kant's property argument. Here one will find that the\npostulate functions as a justificatory proposition which, in\ndeclaring external possession to be possible, makes entrance into\ncivil society obligatory. Kant says that the postulate of Right 'gives\nus an authorization that could not be got from mere concepts of\nRight as such' - the authorization, namely, to take into possession\nexternal objects of our choice.23 But in so far as rightful possession\nis possible only under the presupposition of the concept of intelli-\ngible possession, which is itself possible only in the civil\ncondition,24 our authorized unilateral act of acquisition effectively\nobliges all others to join into civil society with us. The postulate is\nthus crucial not only to Kant's property argument but also to his\naccount of political obligation in general.\nHowever, it is also possible to consider the postulate of Right\nfrom a second perspective. One can consider it in terms of its status\nKANTIAN REVIEW, VOLUME 12, 2007 7\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nas a postulate of practical reason. Considered from that perspec-\ntive, the postulate constitutes a practically necessary but\ntheoretically indemonstrable proposition of practical reason. Kant\nsays that 'there is no way of proving of itself the postulate's prop-\nosition that external possession is possible.25 He insists that 'the\ntheoretical principles of external objects that are mine and yours\nget lost in the intelligible and represent no extension of know-\nledge'.26 What is of interest in the present context is the conjunction\nof these two perspectives. Considered in conjunction they yield a\ncharacterization of the postulate of Right as a practically necessary\njustificatory proposition the grounds of which remain theoretically\nindemonstrable for us. This characterization of the postulate\nimplies that our knowledge of the grounds of our juridical obliga-\ntions towards one another is ultimately very limited: these grounds\n'get lost in the intelligible'. We can acknowledge that we stand\nunder obligations of Right towards one another, but we cannot ulti-\nmately know why this should be the case.\nAs already indicated above, Guyer's interpretation entails a\ndenial of these conclusions. This is because Guyer substitutes an\nacknowledgement of the postulate's theoretical indemonstrability\nwith a notion of its practical provability. The effect of this move is\nto render the postulate's theoretical indemonstrability practically\ninsignificant. My aim in the remainder of this paper is to defend,\nagainst Guyer, the practical significance, for us, of the juridical\npostulate's theoretical indemonstrability. I shall contest Guyer's\nreading on systematic grounds (section 4) as well as on substantive\ngrounds (section 5). However, before turning to an analysis of the\npostulate of Right itself, I shall set out, in the next section, the\ndifference between practical provability, as conceived by Guyer,\nand practical justification, as I understand it, in relation to the\npostulates of practical reason in general.\n3. Practical Proof or Practical Justification?\nKant's general conception of the postulates of practical reason is\nindebted to his view of mathematical postulates on the one hand\nand to his critique of rationalist metaphysics in the Transcendental\nDialectic of the Critique of Pure Reason on the other hand.\nAccording to L. W. Beck, Kant regards a mathematical postulate as\n8 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\n'an indemonstrable practical (i.e. technically practical) proposition\ngiving a rule for the synthesis of an object in intuition, when the\npossibility of the object is known a priori'.27 The postulate supplies\nthe rule for a mathematical proof but remains indemonstrable\nitself. The notion of indemonstrability recurs in relation to the\npostulates of practical reason, where it refers, however, to a postu-\nlate's theoretical proposition. The Critique of Practical Reason\ndefines a postulate of practical reason as 'a theoretical proposition\nwhich is not as such demonstrable, but which is an inseparable\ncorollary of an a priori unconditionally valid practical law'.28\nMore specifically, a postulate is a theoretical proposition, the truth\ncontent of which is neither provable nor refutable as such. From a\ntheoretical perspective, postulates constitute infinite or problem-\natic judgements for us: we are incapable, in principle, of judging\ntheir propositional contents to be either true or false.29 However,\nsince there is nothing contradictory about the logical form of these\npropositions, Kant thinks our appeal to them permissible within\nthe domain of practical reason.30\nTechnically, postulates of practical reason help resolve a conflict\nor antinomy of practical reason. In the second Critique, they resolve\nthe conflict between the moral ends of pure practical reason, which\nwe acknowledge, and the limitation of our human sensibility,\nwhich constrain us with regard to our possible achievement of\nthese ends.31 Morally, the postulates' necessity is foreshadowed in\nKant's references to the ideas of pure reason in the Transcendental\nDialectic. While Kant there concludes that we are not entitled to\nclaim objective knowledge of the existence of God or of the immor-\ntality of the soul, he acknowledges that the ideas of God and of\nimmortality are practically indispensable to finite rational beings\nlike us.32 In the Critique of Practical Reason these ideas are articu-\nlated in the form of two postulates which supply the necessary\ntheoretical presuppositions to the practical possibility of the idea of\nthe highest good. As practically necessary theoretical propositions\nthey represent not 'theoretical dogmas but presuppositions of\nnecessarily practical import'. They 'do not extend speculative\nknowledge', although they do 'give objective reality to the Ideas of\nspeculative reason'.33 The postulates are thus 'corollaries of a need\nof reason',34 which articulate an 'objectively insufficient' but\n'subjectively sufficient' reasoned faith (Vernunftglaube) in the\npossible existence of the postulated objects. Considered from a\nKANTIAN REVIEW, VOLUME 12, 2007 9\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\ntheoretical perspective, the postulates are 'secrets',35 because cogni-\ntively inaccessible to us. Yet from a practical perspective, their\ntheoretical indemonstrability in no way detracts from the practical\nnecessity of our subjective assent to them.\nIn these descriptions of the postulates of practical reason the\nemphasis on the feature of their theoretical indemonstrability is\nimmediately tempered by assurances that the fact of their practical\nnecessity makes up, in some sense, for their lack of theoretical\nprovability. Kant's view seems to be that the practical necessity of\nassenting to the postulates' theoretical propositions in itself\namounts to a justification of sorts of their validity for us. Though\ntheoretically indemonstrable, the postulates are practically justifi-\nable on the grounds of our practically necessary appeal to them.\nKant's distinction between Wissen and Glauben provides an indi-\ncation of what he takes to be the difference between theoretical\nproof and practical justification. According to Allen Wood,\nKant defines 'knowledge' (Wissen) as the holding of a proposition that\nis sufficient both objectively and subjectively, whereas 'faith' or 'belief\n(Glaube) is sufficient only subjectively, not objectively. But faith as\nmuch as knowledge is justified by reasons that 'hold for everyone'; in\nthis respect it is distinguished from mere 'opinion' (Meinung), which is\ninsufficient subjectively as well as objectively.36\nIn so far as a postulate is a Vernunftglaube, it is distinct from both\nknowledge and opinion. Although the subjectively valid reasons\nproffered in behalf of a postulate fall short of theoretical cognition,\na postulate is not held idiosyncratically or capriciously but is based\non a 'need of reason' which is valid for everyone. To say that a\nVernunftglaube is 'subjectively valid' is thus not to say that holding\nit is a matter of individual caprice: it is to say that the reasons for\nsuch a belief, while not sufficient for a claim to knowledge, have\npractical warrant - they justify our assent to the postulates on\npractical grounds.\nThe objective of a practical justification differs, however, from\nthat of a theoretical proof. This is best illustrated with reference to\nthe postulate of the existence of God, in the case of which 'object-\nively sufficient reasons' would require an 'intellectual intuition' of\nGod's existence.37 Since we are incapable, in principle, of this kind\nof intuition, a theoretical proof of the postulate of the existence of\nGod is unavailable to us. By contrast, a practical justification of the\n10 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\npostulate of the existence of God appeals to subjectively sufficient,\nthat is, practical reasons. These do not pertain to the truth of a\npostulate's theoretical proposition but to subjects' practical rela-\ntion to that proposition. Hence a practical justification of the\npostulate of the existence of God shows only that we have suffi-\ncient practical reason, arising from a need of reason, for assenting\nto the proposition of God's existence. On this account, to assent,\non practical grounds, to a postulate's theoretical proposition is not\nto raise any cognitive claims regarding its objective content. To\nbelieve, on practical grounds, in the existence of God is not to\nclaim knowledge of God's existence. To the contrary, for Kant, the\njustifiability of practical faith in the existence of God presupposes\nan acknowledgement of the indemonstrability of the actuality of\nHis existence. If a practically justified faith in the existence of God\nis to avoid slipping back into dogmatic assertion, it must not be\nconflated with knowledge of the actuality of God's existence.38 Only\nan explicit recognition of the unanswerability, in principle, of the\nquestion of the actuality of God's existence ensures avoidance of this\nconfusion. In this sense, practically justified assent to the postulate\nof the existence of God presupposes an acknowledgement of the\nproposition's theoretical indemonstrability. Strictly speaking, we\nshould affirm only our justified faith in the possibility of God's\nexistence, or our justified belief in the idea of His existence.\nGuyer's account of practical provability can be distinguished\nfrom the notion of practical justifiability just sketched in that\nGuyer does raise certain cognitive claims in relation to the postu-\nlates' propositional contents. Guyer says of the postulates of\npractical reason that they are 'a matter for practical rather than\ntheoretical cognition. Kant does not intend to imply that the princi-\nples admit of no proof at all, but rather to say something about the\nkind of proof of which they do admit'.39 In calling postulates a\nmatter for practical cognition Guyer invokes 'a kind of proof that\nis weaker than a theoretical proof; however, his calling it a matter\nof cognition indicates that he is after something stronger than prac-\ntical justification. This impression is confirmed by Guyer's\nsubsequent definition of a postulate of practical reason as an\n'existential proposition [that is] theoretical in form but connected\nwith a moral law or command'.40 More specifically, a postulate is\n'a theoretical proposition asserting the existence of an object or\nstate of affairs that is a condition of the possibility of the binding\nKANTIAN REVIEW, VOLUME 12, 2007 11\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nforce of a moral command'.41 Both times Guyer's formulations\nemphasize the objective (existential) content of the postulates'\ntheoretical propositions; indeed, when he moves to consider the\npostulate of the existence of God, a practical proof of the actuality\nof God's existence turns out to be his principal concern. The postu-\nlate of the existence of God, Guyer says, arises in connection with\nthe command to effect the practical realization of the Highest\nGood. What Guyer refers to as the 'real possibility' of the Highest\nGood depends upon the 'actual existence' of God as its ultimate\ncondition.42 Given that it is the object of a moral command, the\npractical realization of the Highest Good must be a real possibility.\nBut if the actuality of God's existence is the ultimate condition of\nthe real possibility of the Highest Good, the practical realization of\nwhich is itself the object of a binding moral command, we are enti-\ntled to infer the actuality of God's existence from our moral\nobligation to realize the Highest Good. We are entitled to 'affirm\non moral grounds the theoretical proposition asserting the exis-\ntence of God'.43\nOn this account, we infer the truth of the postulate's theoretical\nproposition - the actuality of God's existence - from the practical\nevidence we have in support of His existence. This is clearly\ndifferent from a practical justification of the postulate of the exis-\ntence of God. A practical justification does not seek to establish the\ntruth of a postulate's propositional content. It does not, therefore,\ntreat the command to effect the practical realization of the Highest\nGood as practical evidence from which to infer the actuality of\nGod's existence. A practical justification holds only that, in so far\nas we are under a moral obligation to bring about the Highest\nGood, and in so far as the real possibility of the Highest Good does\ndepend on the existence of God, we have sufficient practical\nreasons for assenting to the postulate's proposition of God's exis-\ntence. But these reasons do not pertain to the truth of the\npostulate's propositional content. They pertain to the practical\nnecessity of our assenting to that proposition.\nI am not sure how cogent Guyer's account of practical prov-\nability in fact is in relation to the second Critique postulates. It is\nnot clear to me that practical cognition of the actuality of God's\nexistence can be distinguished from theoretical cognition of His\nexistence. If we are entitled to claim knowledge of the actuality of\nGod's existence in the domain of practical reason, I am not sure\n12 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nhow we could simultaneously be obliged to deny such knowledge\nin the domain of theoretical reason. Nor is it clear to me how\nGuyer's account of the practical provability of the actuality of\nGod's existence is supposed to fit in with his descriptions elsewhere\nof the postulates of practical reason as 'naturally occurring psycho-\nlogical illusions' and as 'products of human psychology that can be\nused by the moral will as naturally occurring means to the realisa-\ntion of a morally necessary end'.44 However, neither the cogency of\nGuyer's notion of practical provability nor its consistency with his\ngeneral conception of the practical postulates are at issue here. At\nissue is only the difference between practical provability and prac-\ntical justification in relation to the postulates' theoretical\nindemonstrability. Here we can conclude that whilst practical justi-\nfication is conceptually distinct from theoretical provability,\npractical provability is modelled on theoretical provability.\nFurthermore, while the objective of a practical justification is to\nprovide warrant for subjects' practically grounded assent to a\npostulate's theoretical proposition, the objective of a practical\nproof aims to provide evidence of the truth of a postulate's propo-\nsitional content. Finally, while practical justifiability considers\nsubjects' acknowledgement of a postulate's theoretical indemon-\nstrability indispensable to their proper assessment of its practical\nsignificance for them, practical provability seeks to replace the\nnon-available theoretical proof with the available practical proof.\nThe next section considers these respective conceptions of practical\nprovability and of practical justifiability in relation to the postulate\nof Right.\n4. The Postulate of Right: Practical Proof or Practical\nJustification?\n4.a. A practical proof of the postulate\nSurprisingly, Guyer's forcefully stated defence of postulates' prac-\ntical provability in the first half of his paper appears to have little,\nif any, bearing upon his subsequent analysis of the postulate of\nRight. This is not to say that practical provability plays no role in\nthat analysis; however, it seems to take on a rather different\nmeaning. This shift in the meaning of practical provability may be\na consequence of Guyer's reading of the postulate of Right as\nKANTIAN REVIEW, VOLUME 12, 2007 13\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\ncontaining a practical, not a theoretical proposition. His reading of\nit as a practical proposition is a consequence, in turn, of a misinter-\npretation of the relation between the juridical postulate and the\nuniversal principle of Right. In the first half of the present section I\nexamine Guyer's practical proof of the postulate and shall say what\nI think is wrong with it. In the second half I turn to an analysis of\nthe postulate in terms of the notion of practical justifiability.\nTo begin with, recall the postulate itself:\nIt is possible for me to have any external object of my choice as mine,\nthat is, a maxim by which, if it were to become a law, an object of my\nchoice would in itself (objectively) have to belong to no one (res nullius)\nis contrary to Right.45\nFor present purposes it suffices to read the postulate as asserting\nthat it is possible for me to have any external object of my choice as\nmine and that any law to the contrary would itself be contrary to\nRight. The question is a) what conception of external mine is being\nproposed here? and b) which is that law that would be 'contrary to\nRight' relative to external mine\/yours relations? To answer the first\npart of the question we must return to the distinction between\nempirical possession and intelligible possession; the answer to the\nsecond part requires a further look at the universal principle of\nRight. Recall the above simplifying assumption, according to\nwhich the universal principle of Right extends, as it stands, only to\npersons' inner suum: it regulates the innate right to freedom of\neach. This innate right includes persons' bodily integrity but not a\nright to external possessions. As it stands, therefore, the universal\nprinciple of Right can recognize what Kant calls 'empirical posses-\nsion' - the physical holding of an object.46 On the conception of\nempirical possession, I can call an external object mine so long as I\nam physically attached to it, such as when I hold an apple in my\nhand, for example. Here my innate right to physical integrity\nextends to the apple: were someone to wrest the apple from my\nhand, they would be acting contrary to Right since their action\nwould constitute an attack on my bodily integrity.47 Strictly speaking,\nhowever, the universal principle of Right as it stands cannot extend\nto genuine relations of external mine and yours. It cannot cover a\ntype of possession whereby the object could be said to be mine\neven when it is not physically attached to me. Such a conception\nof an object that is genuinely mine externally - mine apart from\n14 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nany physical attachment to myself - is possible only on a concep-\ntion of intelligible possession. Here the connection between\nmyself and the object of my choice would be non-physical, hence\nintelligible: it would be 'possession of an object without holding\nit'.48\nIt is clear that in so far as Kant thinks of rightful possession as\npresupposing the conception of intelligible possession, he conceives\nof property rights as specifying relations between subjects with\nregard to external objects of (someone's) choice. To possess an\nobject without holding it is to be recognized as its rightful owner\nby others even when the object is 'apart from one'. Property rights\ncannot, therefore, simply constitute an extension of a person's\ninnate right to freedom. Since the universal principle of Right as it\nstands covers only relations of innate Right, it cannot countenance\nproperty rights in the proper sense of the term, that is, as rights in\nobjects apart from one. This is why the universal principle of Right\nrequires an 'a priori extension'.49 This extension is supplied by the\npostulate of Right. When the postulate asserts that it is possible for\nme to have any external object of my choice as mine, it must be\ntaken to be presupposing the conception of intelligible possession.\nBut in presupposing the conception of intelligible possession, the\npostulate is simultaneously proclaiming the universal principle of\nRight as it stands as deficient in relation to the question of external\nmine and yours.\nCrucially, Guyer's analysis of the juridical postulate fails to\nacknowledge its problematic relation to the universal principle of\nRight. Guyer recognizes the distinction between innate Right and\nacquired Right: he emphasizes that while the former is analytic, the\nlatter is based on a synthetic a priori proposition of Right. Despite\nthis, Guyer fails to see that the universal principle of Right cannot\nas it stands endorse the category of acquired Right. Far from\nviewing the postulate as an extension of the universal principle of\nRight, Guyer believes that 'the so-called postulate of acquired\nRight must itself be derivable from the [universal] principle of\nRight'.50\nGuyer observes, correctly, that the universal principle of Right\nconstitutes the general law of external freedom. He points out,\nagain correctly, that a person's use of their external freedom\nimplies their claim to exclusive use of external objects of their\nchoice. If exclusive use were not possible 'freedom would be\nKANTIAN REVIEW, VOLUME 12, 2007 15\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\ndepriving itself of the use of its choice with regard to an object of\nchoice'.51 From these two observations Guyer concludes that in so\nfar as the universal principle of Right endorses the exercise of one's\nfreedom so long as it is consistent with everyone else's freedom,\nand in so far as the exercise of one's freedom implies a claim to\nexclusive use of external objects of one's choice, a claim to external\npossession must be compatible with the equal exercise of their\nfreedom by everyone else. The claim to external possessions must\nbe consistent, in other words, with the universal principle of Right.\nThis is corroborated by the juridical postulate's assertion that\nexternal possession is possible. Guyer views the postulate's asser-\ntion that external possession is possible as simply an entailment of\nthe claim that under the universal principle of Right such posses-\nsion must be possible. However, if the assertion that external\npossession is possible does indeed follow from the claim that it\nmust be possible, it is difficult to see what precisely is left to be\nproven. Guyer's strategy of argumentation becomes very murky at\nthis point. However, we can perhaps understand him as saying that\nthe proof of the validity or truth of the postulate's assertion that\nexternal possession is possible consists in a demonstration of how\nor under what conditions this is possible. Guyer says that the proof\nof the postulate takes the form of 'an extended demonstration that\nthe conditions for the possibility of rightful acquisition of property\ncan be satisfied in our relations to physical objects and to each\nother in space and time'.52 This proof of the practical realizability\nof external possession comprises of three elements: a demonstra-\ntion of the 'moral possibility' of property rights, a demonstration\nof their 'theoretical possibility', and a demonstration of their 'prac-\ntical necessity'.53 I shall quickly run through each of these three\nsteps.\nDemonstration of the 'moral possibility' of property departs from\nthe observation that the concept of property rights specifies a rela-\ntion between subjects with regard to objects. From this Guyer infers\nthat the moral possibility of property rights depends on the possi-\nbility of intersubjective assent. 'Since a property right restricts the\nfreedom of others who might also have been able to use the object in\nquestion, such a right can be rightfully acquired only under condi-\ntions in which all could freely and rationally agree to the individual\nacquisition of the right.'54 So here the moral possibility of external\npossession is said to depend on the possibility of free and rational\n16 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nassent by each. The possibility of such assent is represented, Guyer\nclaims, in Kant's 'idea of a general united will'.55 In accordance with\nthis idea individuals can agree on the mutual securement of one\nanother's claims to external possession. Kant's references to the idea\nof a general united will in accordance with which individuals can\nreach actual agreement regarding property rights thus constitutes\n'proof of the moral possibility of such rights.\nProof of the 'theoretical possibility' of property rights 'appeals to\nthe spatio-temporal features of our existence'.56 Here Guyer has\nrecourse to two possible modes of acquisition identified in chapter\ntwo of the Rechtslehre: 'original acquisition', which Guyer glosses\nas 'first appropriation of a property', and 'derivative acquisition',\nwhich results from 'a rightful transfer of the property from one\nowner to the other'.57 While the latter is legitimate because based\non mutual consent, the legitimation of original acquisition is\nmore problematic. Even though it is 'not derived from what is\nanother's',58 the legitimacy of this type of acquisition, too, depends\non others' possible assent. To get around this difficulty Guyer\ninvokes Kant's 'idea of original possession in common',59 which\n'enables us to conceive of [original acquisition] as a transfer of an\noriginal rightful possession of the undivided commons to a rightful\npossession of a divided portion of the whole'.60 So we can think of\noriginal acquisition in terms of a collective agreement to divide\nwhat was originally held in common. Nothing about the spatio-\ntemporal conditions of our existence prevents us from proceeding\nin this manner: and this, it seems, constitutes sufficient proof of the\ntheoretical possibility of external possession.\nThe first two aspects of the proof are intended to show that\nexternal possession is 'morally possible' in so far as everyone can\nfreely agree to its institution under the idea of a general united will,\nand that it is 'theoretically possible' in so far as existing empirical\nconditions do not militate against the implementation of such a\nscheme. The third step shows that rightful external possession is\n'morally necessary'. External possession is morally necessary,\nGuyer says, because 'the psychological and physical conditions of\nour existence are such that we inevitably will attempt to claim\nproperty rights in circumstances where that will bring us into\nconflict with others. [Given this] we have a duty to claim such\nrights with an eye to the civil condition and in turn to bring about\nthat civil condition.'61\nKANTIAN REVIEW, VOLUME 12, 2007 17\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nA general difficulty with Guyer's approach lies in the fact that his\n'extended demonstration' dilutes the systematic function of the\npostulate within the property argument. Guyer delivers not so\nmuch a proof of the postulate as a general reconstruction of Kant's\nproperty argument, which conflates aspects of Kant's theory of\npossession with elements from his theory of acquisition - compo-\nnents of the account of acquired Right which Kant himself keeps\ndistinct. A related difficulty lies in Guyer's persistent tendency to\nempiricize Kant's argument - this is especially noticeable in relation\nto the second and third elements of his proof, which make the\nvalidity of the postulate's proposition dependent on spatio-\ntemporal and psychological conditions. Finally, Guyer's excessive\nreliance on Kant's preliminary notes in favour of the published text\nitself is disconcerting not least because the postulate, as the 'theor-\netical novum' of the published text, is not discussed in the\nunpublished notes.62 Remarkably, Guyer's proof strategy has no\nrecourse at all to the postulate's proposition.\nHowever, the principal difficulty with Guyer's strategy lies in the\nfact that his analysis of the relation between the universal principle\nof Right and unilateral claims to property renders redundant any\nappeal to a postulate. Recall the technical function of a postulate of\npractical reason mentioned in section 2 above. A postulate is meant\nto resolve a conflict of practical reason with itself by reconciling\ntwo otherwise contradictory propositions of practical reason.\nFrom this perspective, the problem with Guyer's account is that\nthere simply is no conflict between innate Right and acquired\nRight; nor does Guyer mention the conflict between the claim to\nexternal possession on the one hand and the constraints of the\nuniversal principle of Right on the other hand. For Guyer, the\npostulate of Right is derivable from the universal principle of\nRight, but in that case the postulate takes us no further, in justifica-\ntory terms, than the universal principle of Right. Far from making\npossible the a priori extension of the universal principle of Right,\nthe validity of the postulate becomes a function of its fit with that\nprinciple. Yet if the postulate is derivable from the universal prin-\nciple of Right, it is not at all clear why the proposition in question\nshould be characterized as a postulate of practical reason at all: as\na theoretical proposition, which asserts what is (or must be taken\nto be) the case in order for something else to be morally possible.\nOf course, once the juridical postulate fails to be treated as a\n18 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\npractically necessary theoretical proposition, it is difficult to see in\nwhat sense the proof just sketched constitutes an instance of\nGuyer's general notion of practical provability at all.\nI want to demonstrate this latter difficulty in Guyer's approach\nwith reference to the first and most important element of his proof,\naccording to which the 'moral possibility' of the postulate's propo-\nsition depends on the free and rational agreement of all to a system\nof property rights under the idea of a general united will. The ques-\ntion is this: does the validity of the postulate's proposition that\nexternal possession is possible depend on the possibility of the idea\nof the general united will? Or is the validity of the postulate a\nnecessary presupposition of the possibility of the idea of a general\nunited will? On Guyer's earlier account of practical provability we\nshould come away with the latter conclusion. However, the actual\nproof he delivers of the postulate's practical possibility entails the\nformer conclusion. To see this, recall Guyer's characterization of a\npostulate of practical reason as 'a theoretical proposition asserting\nthe existence of an object or state of affairs that is a condition of\nthe possibility of the binding force of a moral command'.63\nAccording to Guyer's initial account of practical provability a prac-\ntical proof infers the truth of a postulate's theoretical proposition\nfrom practical evidence advanced in support of its truth, where the\npractical evidence in question is the moral necessity of acting in\naccordance with a moral command. On this account the juridical\npostulate should be read as affirming a theoretical proposition,\nwhich constitutes the condition of the binding force of a moral\ncommand, where the binding force of that command functions as\npractical evidence for the truth of its necessary theoretical presup-\nposition. Assuming that the moral command in question is\nentrance into civil society (the idea of a general united will), we\nshould infer the truth of the juridical postulate's theoretical propo-\nsition, 'external possession is possible', from the fact that it\nconstitutes the condition of the possibility of the idea of a general\nunited will (entrance into civil society). Only if the postulate's theor-\netical proposition is true is the idea of a general united will\npractically realizable. Since, as the object of a moral command,\nthis idea must be practically realizable the postulate's theoretical\nproposition must be true. This is not the argument Guyer in fact\ndelivers: to the contrary, Guyer argues the other way around when\nhe says that the 'moral possibility' of the postulate is conditional\nKANTIAN REVIEW, VOLUME 12, 2007 19\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nupon the possibility of free and rational agreement to its propos-\nition under the idea of a general united will. According to this\nargument, the postulate does not constitute the condition of the\npractical realizability of the general united will. Instead the validity\nof the postulate's proposition that external possession is possible is\nsaid to be conditional upon the possibility of the idea of the general\nunited will.\nAt this point one may object that, whatever the merits of Guyer's\ninitial account of practical provability, it is hardly surprising that it\nfails to apply to the postulate of Right. This is because it is difficult\nto see in what sense that postulate can plausibly be construed as a\ntheoretical proposition at all. For one thing, the juridical postu-\nlate's provenance does not lie in the ideas of pure reason discussed\nin the Transcendental Dialectic: it does not refer to or invoke any\nnon-sensible object or state of affairs. Instead, it refers to subjects'\npossible acquisition of external objects, to maxims and to a law of\npractical reason. The juridical postulate's propositional content\nthus appears to be of a practical rather than a theoretical nature.64\nAll this may indeed appear to be the case. On the other hand, the\nform of the postulate's proposition is assertoric, not imperatival: 'it\nis possible', not 'it must\/ought to be possible'. Moreover, having\nstated the postulate's proposition that external possession is\npossible, Kant goes on to say that the 'theoretical principles' of\nmine\/thine relations 'lose themselves in intelligible grounds'.65\nMore specifically, 'we cannot show how intelligible possession is\npossible, and so how it is possible for something external to be\nmine or yours, but must infer it from the postulate of practical\nreason'.66 The remarks suggest that some indemonstrable theoret-\nical principles do underlie the postulate's proposition that external\npossession is possible. Rather than pass over Kant's admonish-\nments about their theoretical indemonstrability without mention,\nwe should ask what these theoretical principles might be. Once we\ndo raise this question, the uniqueness of the postulate's justificatory\nfunction in relation to Kant's property argument will come into\nbetter focus. This is what I shall try to show in the following.\n4.b. A practical justification of the postulate\nAs we have seen, Kant rejects the view according to which a\nrightful claim to external possession can be derived from the innate\nright to freedom of each. Property rights specify a relation between\n20 KANTIAN REVIEW, VOLUME 12,2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nsubjects with regard to external objects of possible choice; they\nthus presuppose the conception of intelligible possession. Since the\nconception of intelligible possession specifies an intelligible relation\nbetween persons, the right to external possession cannot be derived\nfrom the innate right of each. This implies that, according to the\ninnate right of each, external possession is not possible. According\nto the innate right of each, all subjects have a right to empirical\npossession of all objects and none has a right to exclusive posses-\nsion of any object. It follows that the unilateral acquisition and\nexclusive use of an object of choice would be contrary to the\nuniversal principle of Right as it stands (as it stands, the universal\nprinciple of Right covers, on my simplifying assumption, only rela-\ntions of innate right). At the same time Kant accepts that a person's\nclaim to external possessions is a corollary of their right to external\nfreedom of choice and action: to exercise this right just is to lay\nclaim to external objects of one's choice. If external possession\nwere not possible, freedom would 'be depriving itself of the use of\nits choice with regard to an object of choice'.67 The result is an\nantinomy of Right. On the one hand, exclusive possession of\nexternal cannot be rightful, as it would entail a unilateral curtail-\nment of everyone else's innate right to freedom. On the other hand,\nexclusive possession of external objects must be rightful since\nwithout it external freedom is not possible.68 It is this conflict of\nRight, which the postulate resolves by affirming that:\nIt is possible for me to have any external object of my choice as mine,\nthat is, a maxim by which, if it were to become a law, an object of\nchoice would in itself (objectively) have to belong to no one (res nullius)\nis contrary to Right. 69\nOn the face of it, this solution consists in an arbitrary assertion\nof the rightfulness of unilateral acquisition. Yet Kant claims that\nthe postulate provides an a priori extension of the universal prin-\nciple of Right. This implies that although external possession is not\n(yet) in accordance with the universal principle of Right as it\nstands, it is possible for this to become the case. In other words, the\npostulate introduces the possibility of rightful possession - posses-\nsion in accordance with the universal principles of Right - by\nextending that principle to relations between subjects with regard\nto external objects. The postulate, Kant says,\nKANTIAN REVIEW, VOLUME 12, 2007 21\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\ncan be called a permissive principle (lex permissiva) of practical reason,\nwhich gives us an authorisation that could not be got from mere\nconcepts of Right as such, namely to put all others under an obligation,\nwhich they would not otherwise have, to refrain from using certain\nobjects of our choice because we have been the first to take them into\nour possession. Reason wills that this hold as a principle, and it does\nthis as practical reason, which extends itself a priori by this postulate of\nreason.70\nAccording to this passage, I am authorized to put others under\nan obligation to refrain from using objects of my choice simply\nbecause 'I have been the first to take them into possession'. This\nauthorization 'could not be got from mere concepts of Right'. The\npostulate's authorization thus appears to exceed the bounds of\nthe universal principle of Right. This seems itself problematic.\nThe universal principle of Right constitutes the external version of\nthe categorical imperative: the categorical imperative is the\nsupreme principle of morality. On what grounds could I possibly\nbe authorized to violate a prohibition of the universal principle of\nRight as the external version of the supreme principle of morality?\nHere Reinhard Brandt's influential analysis of the postulate as a\npermissive law (lex permissiva) proves illuminating. According to\nBrandt, the categorical imperative recognizes two kinds of impera-\ntives in relation to action: morally required acts and morally\nprohibited acts. As a permissive law, the juridical postulate fits into\nneither class. How, then, is one to understand the relation between\nthe postulate and the universal principle of Right? Brandt proposes\nto treat the lex permissiva of the Rechtslehre as a kind of\nAusnahmegesetz — as an extraordinary law which mediates\nbetween a general prohibition and a general prescription. The\npostulate mediates between the prohibition against taking external\nobjects of one's choice into one's exclusive possession - a prohib-\nition grounded in the innate right of each - and the requirement to\nacknowledge the claims of each to exclusive possession of external\nobjects of their choice - a requirement grounded in the concept of\nexternal freedom itself. The postulate extraordinarily authorizes\nthe commission of an action that is morally prohibited (the unilat-\neral restriction of the innate right to freedom of each) in order to\nmake possible an action that is itself morally required (the\nacknowledgement of the rightfulness of external possession).\nHowever, this authorization is itself conditional upon subjects'\n22 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nentrance into the civil condition as the only condition within which\nproperty rights, as specifying an intelligible relation between\nsubjects with regard to objects, are strictly speaking rightful.71\nI have analysed and elaborated Brandt's interpretation of the\npostulate's justificatory function in relation to the problem of\nproperty rights in some detail elsewhere.72 Here a summary expo-\nsition will have to suffice. Let us say that the postulate\nextraordinarily and provisionally authorizes my unilaterial acqui-\nsition of an external object of my choice. This act constitutes an\nincursion into the innate freedom of all others, who are now\nexcluded from use of that object. Yet without such an act of\nunilateral acquisition freedom of choice and action itself would\nnot be possible. Although the act of unilateral acquisition does\nconstitute an incursion into the innate right to freedom of each,\nrightful external possession must be possible if external freedom\nof choice and action is to be possible. But rightful external posses-\nsion specifies a relation between subjects with regard to external\nobjects: rightful possession presupposes the conception of intelli-\ngible possession. Yet the conception of intelligible possession is\npossible only in the civil condition. If, therefore, rightful posses-\nsion presupposes the conception of intelligible possession, and if\nintelligible possession is possible only in the civil condition, then\nmy act of unilateral acquisition authorized by the postulate can\ncount as rightful only in so far as it can be taken as the expression\nof my intention to enter with all others into the civil condition.\nBut it must be taken as the expression of that intention, since the\nact could not otherwise count as rightful. If it could not count as\nrightful, I could not be authorized to put others under an obliga-\ntion to refrain from using the objects of his choice. But where my\nact of unilateral acquisition does proceed in accordance with the\npostulate's authorization of it - where it does express the intention\nto enter with all others into the civil condition - all others are also\nrequired to assent to that intention. According to the postulate,\ntherefore, external possession is possible because entrance into the\ncivil condition is obligatory. The postulate wills subjects' entrance\ninto the civil condition by provisionally authorizing an act of\nunilateral acquisition which, to qualify as rightful, must be inter-\npreted as the expression of the intention to enter into the civil\ncondition as that condition alone within which external posses-\nsion can be rightful.\nKANTIAN REVIEW, VOLUME 12, 2007 23\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nAlthough Brandt's interpretation has recently come under attack\nby a number of interpreters according to whom Kant's use of the\nconcept of a permissive law remains much closer to that of trad-\nitional natural law theory than Brandt allows, his account remains\nin my view one of the most systematic and compelling reconstruc-\ntions of Kant's justificatory strategy.73 However, my principal\nconcern in the present context is to argue that if one does accept\nthe postulate's justificatory function as an extraordinary, permis-\nsive law, one must take seriously the indemonstrability of the\nsource of its authorization. For although the postulate resolves the\nconflict of practical reason in relation to Right by provisionally\nauthorising an act of unilateral acquisition which in turn generates\nthe obligation to enter into the civil condition with all others, Kant\ninsists that 'there is no way of proving of itself the possibility of\n[merely rightful] possession or of having any insight into it. No one\nneed be surprised that theoretical principles about external objects\nthat are mine or yours get lost in the intelligible and represent no\nextension of knowledge'.74 At this juncture we return to Guyer's\ndifficulty in construing the postulate as a theoretical proposition.\nThe difficulty lies in understanding what could possibly be meant\nby 'the theoretical principles' of external mine and yours. As I said,\nin contrast to the postulates of the existence of God and of the\nimmortality of the soul the postulate of Right refers to no non-\nsensible object or idea of pure reason the existence of which it\nasserts on practical grounds. The juridical postulate is not, or does\nnot appear to be, the expression of a knowledge-transcending\nVernunftglaube (practical faith). Instead, it affirms the possibility\nof a particular juridical relation between subjects in space and\ntime. Given this, the surprise is not so much that the theoretical\nprinciples of external mine and yours 'get lost in the intelligible' as\nthat there should be any such theoretical principles at all.\nThe meaning of Kant's references to the postulate's indemonstra-\nbility may become clearer once the focus turns to the source of its\nauthorization. Kant says that the postulate gives us an authoriza-\ntion, and he adds that it is reason itself, which wills the postulate. It\nthus appears to be reason itself, which constitutes the source of the\nauthorization issued by the postulate. But what does it mean to say\nthat 'reason' authorizes the acquisition of external objects of one's\nchoice? In order to clarify what this may mean it will help to\nconsider what it cannot mean. I said above that the postulate\n24 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nauthorizes my unilateral acquisition of an external object of my\nchoice as the expression of my intention to join with all others into\nthe civil condition. This does not mean that I have any choice with\nregard to my intentions in this matter. It is not contingent that I\nraise a claim to external possession. Nor is it contingent that I\ncommit an act of unilateral acquisition. I must raise the claim and\nmust commit the act in virtue of my standing as a free agent: if I did\nnot raise the claim\/commit the act, external freedom itself would\nbe impossible. Nor is it contingent that I have the intention to enter\ninto the civil condition with all others: I must (be taken to) have\nthat intention given that my act of unilateral acquisition expresses\na claim to rightful possession, and given that rightful possession is\npossible only in the civil condition. Throughout, the postulate's\nauthorization expresses the fact of moral compulsion. I could not\nchoose not to commit the act and not to have the intention. But if I\ncould not choose not to have that intention, I cannot be the author-\nizing source of that intention. Hence I am not the author of my\nobligation to enter civil society.\nWho or what, then, is the authorizing authority? The author-\nizing authority is the idea of freedom. Kant says that no one need\nbe surprised that the theoretical principles about external objects\nthat are mine or yours get lost in the intelligible because 'no the-\noretical deduction can be given for the possibility of the concept of\nfreedom on which they are based'.75 The theoretical principles of\nexternal mine and yours are based on the idea of freedom. But the\nidea of freedom is itself a theoretically incomprehensible postulate\nof practical reason. Hence to say that my standing as free agent is\nitself the source of the postulate's authorization is not to say that I\nam the source of that authorization after all. I am not the source of\nmy freedom: its source lies beyond the limits of my possible\ncomprehension. Consider, in this respect, the postulate's extension\nof my juridical perspective: I raise a claim to external possession\nand find myself obligated to join into civil society with all others.\nThis is more than I had bargained for when initially raising my\nclaim. Yet, in obliging me to enter into the civil condition with all\nothers, the postulate effects a qualitative change in relations among\nsubjects, who now bear civic responsibilities towards one\nanother.76 It is reason, not the subjects themselves, which wills their\nentrance into civil society. Reason wills this as practical reason,\nthat is, in accordance with the idea of freedom. Yet although we\nKANTIAN REVIEW, VOLUME 12, 2007 25\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\ncan acknowledge that we do, as beings who cannot but think of\nthemselves as free, stand under obligations of Right towards one\nanother, we have no insight at all into the theoretical grounds of\nour obligations. In so far as it derives from the idea of freedom\nitself, the fact of our juridical obligations towards one another is,\nas such, a theoretically incomprehensible 'fact of reason'.\n5. The moral significance of the postulate's theoretical\nindemonstrability\nSection 3 distinguished between practical provability and practical\njustification in relation to the postulates of practical reason in\ngeneral. I suggested that while the latter seeks to offer practical\nwarrant for subjects' practically necessary assent to a postulate's\ntheoretical proposition, the former aims to provide practical\nevidence for the truth of its propositional content. Section 4\napplied the distinction to the postulate of Right. In the second half\nof that section, I argued that a case can be made for the postulate's\npractical justifiability, which acknowledges the moral significance\nof its theoretical indemonstrability. I also argued, in the first half of\nsection 4, that Guyer himself slips from claims about the practical\nprovability of postulates' theoretical propositions to a practical\nproof of what he construes, in effect, as a practical proposition of\nRight. This slippage does not mean that there is no connection\nbetween Guyer's two divergent accounts of practical provability. In\nboth cases, Guyer's principal concern is to reduce the threat he\nperceives the postulates' theoretical indemonstrability to pose to\nour sense of moral certainty regarding the grounds of our obliga-\ntions. It is, I believe, this perceived threat which initially motivates\nGuyer's forceful response to Willaschek's denial of the juridical\npostulate's provability. It is also this quest for moral certainty\nwhich leads him to overlook the discontinuity between the two\naccounts of practical provability he provides. Thus, whatever the\ndifferences between the two proof strategies he offers, their shared\nconcern is the elimination of the perceived potential of the postu-\nlates' theoretical indemonstrability to undermine our moral\nconfidence. In this final section I want to suggest that the juridical\npostulate's theoretical indemonstrability poses no threat to our\nunderstanding of our standing as moral subjects. To the contrary, it\n26 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nmay deepen that understanding. To this purpose, I want briefly to\nelaborate on the connection between the postulate of Right and the\npostulate of freedom.\nGiven its function as the ground of the possibility of the moral\nlaw Kant assigns the idea of freedom a special status compared to\nthe other postulates of practical reason. Nonetheless, when he does\nspeak of freedom as a postulate of practical reason, he emphasizes\nits theoretical indemonstrability. He also insists upon the practical\nsignificance of our acknowledgement of its theoretical indemon-\nstrability. On the one hand, we can have as little theoretical insight\ninto reason's capacity to 'frame its own order of ideas'77 as we have\ninto the possibility of reason's independence from the causality of\nnature. On the other hand, although 'we do not comprehend the\npractical unconditioned necessity of the supreme law of freedom,\nwe do comprehend its incomprehensibility'.78 When we do, we\nthink of ourselves, in our 'practical intentions' (in praktischer\nAbsicht), as participant members of an intelligible order of things.\nWe then understand it to be our practical task to 'give to the world\nof the senses the form of an intelligible world'.79\nDespite the moral significance which Kant himself obviously\nattaches to our practical comprehension of the theoretical incom-\nprehensibility of our freedom as a postulate of pure practical\nreason, recent interpretations of Kant's moral philosophy have\ntended to treat this aspect of the Kantian idea of freedom as practic-\nally irrelevant. The emphasis has been on avoiding the noumenal\ndimension of Kant's practical philosophy by interpreting the idea\nof freedom, so far as possible, in strictly immanent, practical\nterms.80 This now dominant interpretation of Kantian practical\nfreedom has been sharply criticized by Jean Grondin for ignoring\nwhat he refers to as the 'contemplative character' of Kant's\npractical philosophy.81 Grondin points to our experience of the\nsubliminal character of the moral law, which Kant refers to in\nthe famous Beschluss of the second Critique.82 Our very insight\ninto the incomprehensibility of the grounds of the possibility of the\nmoral law, invokes in us a feeling of Achtung for the law, and that\nfeeling, as one which follows upon the insight into the law's incom-\nprehensible 'majesty', supplies the proper incentive to moral\naction. Yet Achtung for the moral law as the proper incentive for\naction in accordance with it would not be possible in the absence\nof our insight into the law's noumenal dimension. Indeed, and\nreturning to the Rechtslehre, what is most striking about Guyer's\nKANTIAN REVIEW, VOLUME 12, 2007 27\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nreading of it is the impoverished account of the ends of Right he\noffers.\nAlthough what Guyer refers to as his 'teleological' account of\nKantian freedom differs from currently dominant, Rawlsian\nconstructivist interpretations, he shares with the latter a concern to\neclipse Kant's references to a noumenal dimension from it. Thus,\naccording to Guyer, freedom constitutes 'the supreme value of\nmorality' towards the empirical realization of which every rational\nbeing necessarily strives.83 The 'intrinsic value of freedom' is said\nto be closely connected with its 'instrumental value' as a means to\nthe attainment of human happiness. On the one hand, freedom is\ninstrumentally valuable in 'putting us in control over the source of\nour happiness'. In enabling us to choose and to pursue our own\ngoals and projects, freedom provides a 'more secure and certain\nfoundation of our happiness than mere nature'.84 On the other\nhand, there is also the 'special intrinsic happiness that we get from\nthe idea of freedom itself. This happiness is the 'pleasure we take\nin the thought that we are the authors of our happiness'.85 Hence,\n'the source of our special and deepest satisfaction in the exercise of\nour freedom is not our escape from the sensible world but the very\nfact of our unification of our desires and conduct in the sensible\nworld, or our transformation of the sensible world into a rational\nworld'.86\nFor Guyer, freedom is of supreme moral value in so far as it\nis both the condition for the maximal realization of worldly\nhappiness and the source of the special contentment that comes\nfrom viewing oneself as the author of one's own fate. This concep-\ntion of Kantian freedom as the condition of the realization of\nhuman happiness helps explain Guyer's reading of the juridical\npostulate in the Rechtslehre. For Guyer, Kant's property argument\nis an integral aspect of the practical realization of freedom under-\nstood as the achievement of maximal possible happiness for\npurposively rational beings. Since control over external objects of\none's choice is a condition of individuals' pursuing their freely\nchosen and rationally purposive activities, it is 'rational for all\naffected parties to adopt a system of property rights'.87 The attribu-\ntion to individuals of a rationally necessary interest in establishing\na system of property rights resolves the ambiguity noted earlier in\nrelation to Guyer's treatment of the idea of the general united will.\nThe postulate's moral validity was there said to be a function of\n28 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nindividuals' possible endorsement of it under the idea of a general\nunited will. While this move made the postulate's validity condi-\ntional upon the possibility of the idea of a general united will, it left\nthe modality of that idea - its rational necessity - unexplained.\nGuyer's account of freedom resolves that puzzle. It now turns out\nthat free and purposive beings have a necessary rational interest in\nacting in accordance with the idea of a general united will because\nthey have a necessary rational interest in establishing a system of\nproperty rights as a condition of realizing their freedom and the\nhappiness its realization affords them. For Guyer, therefore,\n'[Kant's] analysis of property makes the preservation of the liberty\nto acquire property the fundamental reason for the creation and\nmaintenance of government.'88 Yet, although it delivers a practical\nproof of sorts of the ultimate grounds of our juridical duties\ntowards one another - these grounds lie in the quest for happiness\n- Guyer's reading yields a curiously restricted conception of Kant's\nphilosophy of Right. This is so not just because in making the\nprotection of property rights the fundamental reason for entrance\ninto the civil condition Guyer ignores Kant's own claims regarding\nthe ends of civil society:\nThe concepts of the Right of a state and of a Right of nations lead\ninevitably to the Idea of a Right for all nations (ius gentium) or cosmo-\npolitan Right (ius cosmopoliticus). So if the principle of outer freedom\nlimited by law is lacking in any one of these three possible forms of\nrightful condition, the framework of all others is unavoidably under-\nmined and must finally collapse.89\nIn the present context this quote is of interest primarily in so far\nas it indicates the unconditional nature of Kant's conception of our\njuridical duties towards one another: the end of Right is the\ngradual establishment of thoroughgoing, that is global, relations of\nRight among subjects. The establishment of such thoroughgoing\nrelations of Right is, in other words, an end in itself. The restrictive\ncharacter of Guyer's reading, by contrast, consists in its tendency\nto instrumentalize the concept of Right. We are said to have an\ninterest in establishing relations of Right with one another because\nof some other interest of ours (happiness through freedom) we\nfurther in so doing. This reading precisely fails to capture the force\nof Kant's claim that entrance into the civil condition is an a priori\nobligation willed by reason and for the sake of reason. Admittedly,\nKANTIAN REVIEW, VOLUME 12, 2007 29\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nto say that entrance into the civil condition is willed by reason for\nthe sake of reason is to issue a claim that is deeply opaque: it is not\na claim which we can easily make sense of. But this does not\nwarrant the conclusion that the claim is valid only so long as we\ncan interpret it in a way that does make sense to us. We may not be\nable to make sense of it precisely because this sort of claim eschews\ninstrumentalization: the claim may be constitutively opaque for\nfinite rational beings like us. In other words, it may be the case that\nfor a claim like this to be fully comprehensible to us, we are\nconstrained to give it an instrumental explication. If this is so - if\nwe are able to render the grounds of the concept of Right fully\ncomprehensible to ourselves only at the cost of instrumentalizing\nit - any attempt to render it fully comprehensible will threaten\nto deprive Kant's political philosophy of its most arresting prop-\nosition: its view of the practical realization of relations of Right as\nan end in itself. If, for finite rational beings like us, any fully\ntransparent proposition of practical reason unavoidably takes the\nform of an instrumental explication, such beings can preserve the\nunconditional character of morality only by acknowledging that\nsome propositions of practical reason are not fully transparent to\nthem - are constitutively opaque to them. At the same time it is\ntheir comprehension of that opacity - their comprehension of its\nincomprehensibility - which constitutes subjects' most powerful\nincentive to action in accordance with the moral law.\nIt is the advantage of the alternative interpretation of the\njuridical postulate here proposed that in preserving this insight into\nthe constitutive opacity, for us, of the ultimate grounds of morality,\nit makes possible an appreciation of the unconditional character of\nthe universal principle of Right. Recall the reflective effect of the\npostulate upon us: we raise a claim to external possession and find\nourselves obligated to join into civil society. We had not anticipated\nthis result. Yet in eliciting our recognition of the fact that we owe\none another obligations of Right merely in virtue of our standing as\nfree agents, the postulate deepens our juridical moral perspective.\nAs beings who cannot but think of themselves as free, at least from\na practical perspective, we must acknowledge our membership in\nan intelligible order of things. The establishment of thoroughgoing\nrelations of Right as an end in itself then articulates, in practical\nterms, our capacity, in virtue of our freedom, 'to give the world of\nthe senses, as sensuous nature (which concerns rational beings), the\nform of an intelligible world'.90\n30 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nNothing in my interpretation renders the instrumental concep-\ntion of Right impermissible: it only puts it into its proper\nperspective. In so far as finite rational beings' comprehension of\nthe grounds of the concept of Right is unavoidably limited to an\ninstrumental explication of these grounds, they may be able to\neffect the practical realization of relations of Right only by means\nof the instrumental conception: only by securing, through its actual\ninstitutionalization, the right to external possession of each. It may\nbe that, for Kant, the gradual establishment of thoroughgoing rela-\ntions of Right can only take the form, among finite rational beings,\nof a globally instituted system of property rights. But the means to\nthe establishment of relations of Right must not be conflated with\nthe ends of Right. Instituting relations of Right is not a means to\nsecuring property rights. Rather, establishing property rights\namong finite rational subjects is a means to establishing thorough-\ngoing relations of Right between them. Only an interpretation of\nthe postulate of Right which takes seriously Kant's reminders\nregarding its theoretical indemonstrability, and our practical\ncomprehension of its indemonstrability can preserve this insight by\nKant of Right as an end in itself.91\nThis paper was written in 2003 in response to Paul Guyer's 'Kant's deduc-\ntion in the principles of Right', in Mark Timmons (ed.), Kant's\nMetaphysics of Morals: Interpretative Essays (Oxford: Oxford University\nPress, 2002), pp. 23-64. After this paper was accepted for Kantian Review\nin 2004, Guyer's paper was republished in his Kant's System of Nature and\nFreedom (Oxford: Clarendon Press, 2005). References are given\nthroughout to the 2002 version.\nNotes\n1\n Kant, Refl. Nr 71717=XIX 263, quoted in Reiner Wimmer, Rants\nKritische Religionsphilsophie (Berlin: de Gruyter, 1990), p.l.\n2\n Rechtslehre (RL) 6: 246. The following translations of Kant's works\nhave been used: The Metaphysics of Morals (Part I, The Metaphysical\nFirst Principles of Right (here referred to as Rechtslehre)), trans. Mary\nGregor (Cambridge: Cambridge University Press, 1991); The Critique\nof Pure Reason (CPR), trans. Norman Kemp Smith (London:\nMacmillan, 1933, second impression (1993 reprint); Groundwork of\nthe Metaphysics of Morals (GW), trans. H. J. Paton (New York:\nKANTIAN REVIEW, VOLUME 12, 2007 31\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nHarper Torchbooks, 1964); The Critique of Practical Reason {CprR),\ntrans. Lewis White Beck (New York: Macmillan, 1956, 1993,\nreprint); Towards Perpetual Peace (PP), in Kant's Political Writings,\ntrans. H. B. Nisbet (Cambridge: Cambridge University Press, 1970).\nVolume and page references are to the Prussian Academy edition of\nKant's collected works.\n3\n The 'spoilt' condition of the originally published edition of the\nRechtslehre has been the subject of intense discussion. In 1929\nGerhard Buchda suggested the elimination of section 4-8 from §6\nfrom the text, as their subject matter was irrelevant to the announced\ntask of §6 of providing a deduction of the concept of intelligible\npossession. See Gerhard Buchda, Das Privatrecht Kants. Ein Beitrag\nzur Geschichte und zum System des Naturrechts (Diss. Jena, 1929).\nMore recently, Bernd Ludwig has proposed more substantial revisions\nof the originally published text, including, most controversially,\nshifting the 'postulate of practical reason with regard to Right' from\nits original location in §2 to §6. See Immanuel Kant, Metaphysische\nAnfangsgriinde zur Rechtslehre, ed. Bernd Ludwig (Hamburg: Felix\nMeiner Verlag, 1986). For Ludwig's defence of these revisions, see\nBernd Ludwig, Kants Rechtslehre (Hamburg: Felix Meiner Verlag,\n1988). For a sharp criticism of Ludwig's proposal, see Burkhard\nTuschling, 'Das rechtliche Postulat der praktischen Vernunft: seine\nStellung und Bedeutung in Kant's Rechtslehre', in H. Oberer and\nG. Seel (eds), Kant. Analysen - Probleme - Kritik (Konigshausen und\nNeumann, 1988), pp. 273-90. More generally, scholarly work on the\npostulate of Right is more advanced in Germany than it is in the\nEnglish-speaking world. Apart from Ludwig's work, the most influen-\ntial single recent publication on the postulate is Reinhard Brandt's\n'Das Erlaubnisgesetz, oder: Vernunft und Geschichte in Kants\nRechtslehre', in Brandt (ed.), Rechtsphilosophie der Aufklarung\n(Berlin: de Gruyter, 1982), pp. 233-85. See also Wolfgang Kersting,\nWohlgeordnete Freiheit (Frankfurt: Suhrkamp Verlag 1993) (original\nhardback edition published with de Gruyter, 1984) pp. 241-50.\nAmongst Anglo-American Kant scholars, the postulate is most exten-\nsively discussed by Leslie Mulholland in his Kant's System of Rights\n(New York: University of Cornell, 1991), pp. 243-57. See also my\nown analysis and reconstruction of the postulate of Right in Katrin\nFlikschuh, Kant and Modern Political Philosophy (Cambridge:\nCambridge University Press, 2000), pp. 113-43.\n4\n I am thinking of the influential interpretations offered of Kant's prac-\ntical philosophy by former students of John Rawls, such as, for\nexample, Christine Korsgaard, Creating the Kingdom of Ends\n(Cambridge: Cambridge University Press, 1996); Barbara Herman,\nThe Practice of Moral judgement (Cambridge, MA: Harvard\n32 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nUniversity Press, 1993); Thomas Hill, Respect, Pluralism, and Justice:\nKantian Perspectives (Oxford: Oxford University Press, 2000).\n5\n See Jacqueline Marina, 'Making sense of Kant's highest good', Kant-\nStudien, 91 (2000), 329-55; also R. Z. Friedman, 'The importance\nand function of Kant's highest good', Journal of the History of\nPhilosophy, 22 (1984), 325-42. Both authors emphasize what John\nSilber has called the 'transcendent conception' of the Highest\nGood, though both attribute a meaning to this term which differs\nfrom Silber's use of it in 'Kant's conception of the highest good as\nimmanent and transcendent', The Philosophical Review, 68 (1959),\n460-92. For an influential reading that is unsympathetic both\ntowards the postulates and towards the concept of transcendence\nmore generally see L. W. Beck, A Commentary on Kant's Critique\nof Practical Reason (Chicago: University of Chicago Press, 1960),\npp. 242-81.\n6\n My use of transcendence as 'acknowledged unknowability' is\nindebted to T. L. S. Sprigge's interpretation of speculative metaphysics\nin those terms. See his, 'Has speculative metaphysics a future?', The\nMonist, 81 (1998), 513-33.\n7\n Paul Guyer, 'Kant's deductions of the principles of Right', in Mark\nTimmons (ed.), Kant's Metaphysics of Morals. Interpretative Essays\n(New York: Oxford University Press, 2002), pp. 23-64.\n8\n See, for example, Guyer's papers on 'Kantian foundations for liber-\nalism' and 'Life, liberty, and property: Rawls and Kant', in Guyer,\nKant on Freedom, Law, and Happiness (Cambridge: Cambridge\nUniversity Press), 2000.\n9\n RL, 6:219.\n10\n Markus Willascheck, 'Why the Doctrine of Right does not belong in\nthe Metaphysics of Morals', Jahrbuch fur Recht und Ethik 5 (1997),\n205-27 (223).\n11\n Guyer, 'Kant's deductions', 33.\n12\n RL, 6: 230.\n13\n Ludwig, Analytischer Kommentar, 92-101. See also Bernd Ludwig,\n'Whence public right? The role of theoretical and practical reasoning\nin Kant's Doctrine of Right', in Timmons (ed.), Kant's Metaphysics of\nMorals, pp. 159-84. For an alternative argument regarding the rela-\ntionship between the universal principle of Right and the categorical\nimperative, see Otfried Hoffe, 'Kant's Principle of Justice as categor-\nical imperative of law', in Y. Yovel (ed.), Kant's Practical Philosophy\nReconsidered (Amsterdam: Kluwer Academic Publishers, 1989),\npp. 149-67. See also Wolfgang Kersting, who speaks of a 'dual legis-\nlation' ('doppelte Gesetzgebung') in relation to the domains of law\nand ethics respectively in Wohlgeordnete Freiheit, 175-81.\n14\n Cf. RL 6: 238: 'There is only one innate right: freedom (independence\nKANTIAN REVIEW, VOLUME 12,2007 33\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\nfrom being constrained by another's choice) insofar as it can coexist\nwith the freedom of every other in accordance with a universal law, is\nthe only original right belonging to every man by virtue of his\nhumanity.'\n15\n Cf. Reinhard Brandt, Eigentumstheorien von Grotius bis Kant\n(Stuttgart: Frommann-Holzboog Verlag, 1974), 167-76. At RL, 6:\n268, 269 Kant comments that 'the first working, enclosing, or, in\ngeneral, transforming of a piece of piece of land can furnish no title of\nacquisition to it'. The view that it does, 'which is so old and still so\nwidespread' is due to the 'tacit prevalent deception of personifying\nthings and of thinking of a right to things as being directly a right\nagainst them, as if someone could, by the work he expends upon\nthem, put things under an obligation to serve him and no one else'. As\nBrandt points out, in 'Comments on the observations on the beautiful\nand the sublime', Kant himself defended a view according to which\nthe right to external possessions can be derived from a person's power\nof control over their own body, including the work produced by that\nbody.\n16\n RL, 6: 245, 246.\n17\n RL, 6: 246 'If it were not within my rightful power to make use of [an\nexternal object of my choice], then freedom would be depriving itself\nof the use of its choice with regard to an object of choice.'\n18\n This assumption is justified in so far as the moral authority of the\nuniversal principle of Right as it is stated in the introduction extends\nno further than that of the categorical imperative from which it is\nderived. Since the categorical imperative of the second Critique covers\nmoral relations between subjects but not between subjects with regard\nto external objects, an additional justificatory argument is required,\nwhich extends the universal principle of Right to rightful property\nrelations. This additional argument is supplied, as we shall see, by the\npostulate of Right.\n19\n RL, 6: 249.\n20\n RL, 6: 249.\n21\n RL, 6: 246.\n22\n See n. 3 for relevant references.\n2 3\n RL, 6: 2 4 7 .\n24\n RL, 6: 255: 'It is possible to have something external as one's own\nonly in a rightful condition, under an authority giving laws publicly,\nthat is, in a civil condition.' Kant's claim should not be taken to mean\nthat property rights are a matter of positive law, but should be inter-\npreted in the light of Kant's view that rightful possession presupposes\nthe conception of intelligible possession. The latter specifies a lawful\nrelation between subjects with regard to objects, which can be real-\nized only through entrance into civil society.\n34 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\n25\n RL, 6: 247 .\n26\n RL, 6: 252.\n2 7\n L. W. Beck, A Commentary, p . 2 5 1 .\n28\n CprR, 5:123.\n29\n CPR, A 72\/ B97.\n30\n According to Mary Zeldin, since a postulate 'does not express wha t\nought to be, but what is or must be, it is a theoretical, not a practical\nproposition; but, because it is based on a given moral law, it is related\nto the employment of practical reason ' . See Zeldin, 'Principles of\nreason, degrees of judgement, and Kant's argument for the existence\nof God' , The Monist, 54 (1979), 2 8 5 - 3 0 1 , (294).\n31\n Michael Albrecht, Kants Antinomie der Praktischen Vernunft\n(Hildesheim: Georg 01ms Verlag, 1978). For Albrecht the postulates\nresolve the antinomy of practical reason, which arises from reason's\nsearch for the highest condition of everything that is conditioned.\nThis interpretation of the postulates' systematic function differs from\nthat of Allen Wood, for whom the postulates are required to solve the\nabsurdum practicum argument. See Wood, Kant's Moral Religion\n(Ithaca, N.Y.: Cornell University Press, 1970).\n32\n CPR, A 642-668\/B 6 7 1 - 6 9 7 . In fact, the discussion in the first\nCritique largely confines itself to discussing the legitimate because\nregulative employment of ideas of reason in theoretical inquiries.\nHowever, the Critique of Practical Reason offers an analogous\ndefence of their employment in the practical domain. See CprR, 5:\n135-46.\n33\n CprR, 5 :132.\n34\n WOT, A317\/318.\n35\n Religion, B206\/207.\n36\n Allen Wood, 'Rational theology, moral faith, and religion' in Paul\nGuyer (ed.), The Cambridge Companion to Kant (Cambridge:\nCambridge University Press, 1992), pp . 3 9 4 - 4 1 6 (401). Compare\nCPR, A 820-31\/B 848-58 .\n37\n Zeldin, 'Reason and judgement' , 285 : 'All knowledge, Kant argues,\nmust be based on the forms of possible experience or deduced from\npremises k n o w n to be t rue: in the case of the existence of God ,\nhowever, the former is impossible because God transcends experience,\nand the latter is impossible because the premises themselves, to be\nknown to be true, would have to be grounded in possible experience,\nwhile, by the very nature of the question, possible experience has been\nexcluded.'\n38\n CPR, A825\/B853.\n39\n Guyer, 'Kant's deductions' , p . 33 .\n4 0\n Ibid., p . 36.\n41\n Ibid., p . 37.\nKANTIAN REVIEW, VOLUME 12, 2007 35\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\n42\n Although we have the necessary moral motivation to bring about the\nHighest Good, we lack 'the power to create the ideal conditions for its\nrealisation'. Hence we cannot ourselves ensure the conduciveness of\nthe sensible world to the practical realization of the Highest Good.\nOnly God can do this. See Paul Guyer, 'From a practical point of\nview: Kant's conception of a postulate of pure practical reason', in\nGuyer, Kant on Law, Freedom, and Happiness (Cambridge:\nCambridge University Press, 2000), pp. 333-72, at 345.\n43\n Guyer, 'Kant's deductions', p . 39. This reading seems to me to risk\ncompromising Kant's philosophy of practical hope.\n44\n Guyer, 'Practical point of view', p . 336.\n4 5\n RL, 6: 246.\n46\n RL, 6: 246.\n4 7\n The example is Kant's own. Cf. RL, 6: 248.\n48\n RL, 6: 246.\n49\n RL, 6: 247.\n50\n Guyer, 'Kant's deductions', p . 60.\n51\n RL, 6: 246.\n52\n Guyer, 'Kant's deductions', p . 54.\n53\n Ibid.\n54\n Ibid., pp. 58 -9 .\n55\n RL, 6 :256.\n56\n Guyer,'Kant's deductions, p. 61 .\n57\n Ibid.\n58\n RL, 6: 258, emphasis added.\n59\n RL, 6: 262.\n60\n Guyer, 'Kant's deductions', pp. 6 0 - 1 .\n61\n Ibid., p . 63 .\n62\n Bernd Ludwig, 'Der Platz des rechtlichen Postulats der praktischen\nVernunft innerhalb der Paragraphen 1-6 der Kantischen Rechtslehre',\nin Brandt (ed.), Rechtsphilosophie der Aufkldrung, pp. 218-232, at\n218.\n63\n Guyer, 'Kant's deductions' , p . 37.\n64\n Wolfgang Kersting advances this objection against interpreting the\npostula te of Right as a postula te of pure practical reason. See\nWohlgeordnete Freiheit, 247 , n. 3 2 . 1 respond to this objection in '1st\ndas rechtliche Postulat ein Postulat der reinen praktischen Vernunft?\nZ u m Endzweck der Rechtslehre Kants ' , Jahrbuch fur Recht und\nEthik, 12 (2004), 299 -330 .\n65\n RL, 6: 252 .\n66\n RL, 6: 254-5.\n67\n RL 6: 246 .\n68\n In §7, at RL 6: 2 5 5 , Kant sketches such an antinomy of Right, when he\nsays that 'rightfully practical reason is forced into a critique of itself in\n36 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nthe concept of something external that is mine or yours, and this by an\nantinomy of propositions concerning the possibility of such a concept\n. . . The thesis says: it is possible to have something external as mine,\neven though I am not in possession of it. The antithesis says: it is not\npossible to have something external as mine unless I am in possession\nof it. Solution: both propositions are true, the first if I understand, by\nthe word possession, empirical possession (possessio phaenomenon),\nthe second if I understand by it purely intelligible possession {possessio\nnoumenort).' If Kant's statement of the antinomy of Right has received\nlittle attention in the literature, this may be because he does not actually\nmention it until after the deduction of the concept of merely intelligible\npossession - the key to the 'solution' - in §6. The statement of the\nantinomy in §7 thus has a 'retrospective' flavour to it. Nonetheless, the\npreliminary notes to the Rechtslehre show that the antinomy of Right\npreoccupied Kant for a considerable length of time, remaining unre-\nsolved until the introduction of the postulate of Right in the published\ntext itself. For a detailed analysis of Kant's earlier notes on the\nantinomy, see Wolfgang Kersting, 'Freiheit und intelligibler Besitz:\nKants Lehre vom Synthetischen Rechtssatz a priori', Zeitschrift fur\nPhilosophie, 6 (1981), 31-51.\n69\n RL, 6: 246 .\n70\n RL, 6: 247.\n71\n Brandt, 'Das Erlaubnisgesetz' , p . 244: 'Der systematische Or t des\nnaturrechtlichen Erlaubnisgesetzes ergibt sich in einer Vermittlung\nvon Gebot und Verbot: Es wird etwas \"an sich\" Verbotenes provi-\nsorisch er laubt und dami t geboten, den Rechtsanspruch der\nVerhinderung nicht wirksam werden zu lassen.' Brandt makes much\nof Kant's distinction between 'provisional Right ' and 'peremptory\nRight' - a distinction also invoked in Perpetual Peace in connection\nwith a discussion of the legal category of permissive laws as used in\nnatural law theory. According to Kant it is sometimes permissible for\na sovereign to refrain from implementing requisite legal reforms and\nto abide by existing positive laws that are strictly speaking unjust\n(contrary to natural law). Postponement of legal reform may be justi-\nfied under conditions of political instability, or when the expected\nrisks outweigh the benefits of implementing reforms at that point in\ntime. Existing unjust positive laws then count as 'provisionally just' so\nlong as it is the sovereign's firm intention to implement the necessary\nreforms at the earliest possible opportunity. This notion of the 'provi-\nsional' authorization of a law that is unjust but permissible clearly\ninforms Brandt's analysis of the lex permissiva in the Rechtslehre,\nwhere the necessary commission of an injustice is justified with refer-\nence to the required inauguration of relations of peremptory Right\nmade possible through that act of necessary injustice.\nKANTIAN REVIEW, VOLUME 12, 2007 37\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKATRIN FLIKSCHUH\n72\n Cf. Kant and Modern Political Philosophy, chapters 5 and 6.\n73\n See, for example, Joachim Hruschka, 'The permissive law of Practical\nReason in Kant's Metaphysics of Morals ' , Law and Philosophy,\n23 (2004), 4 5 - 7 2 . See also Franz Hespe, \"Wbhl dem, der im Besitze\nist. Z u r Eigentumsbegriindung in Kants Rechtslehre' in D. Hiining,\nG. Stiening, U. Vogel (eds), Societas Rationis. Festschrift fur\nBurkhard Tuschling zum 65. Geburtstag (Berlin: Duncker &\nHumblot Verlag, 2002).\n74\n RL, 6: 252.\n7 5\n RL, 6: 252.\n76\n I develop this line of t hough t in more detail in '1st das rechtliche\nPostulat ein Postulat der reinen praktischen Vernunft?' , see n. 64.\n77\n CPR, A548\/B576.\n78\n GW,4:463.\n79\n CprR, 5: 44 .\n80\n See, for example , Christine Korsgaard , 'Moral i ty as freedom', in\nKorsgaard, Kingdom of Ends, pp . 158-87 . See also Andrews Reath,\n'Legislating for a realm of ends: the social dimension of autonomy', in\nA. Reath. B. Herman and C. Korsgaard (eds), Reclaiming the History\nof Ethics. Essays for John Rawls (Cambridge: Cambridge University\nPress, 1997), pp . 214 -40 .\n81\n Jean Grondin , 'Zu r Phanomenologie des moralischen \"Gesetzes\".\nDas kontemplat ive Mot iv der Erhebung in Kants praktischer\nMetaphysik ' , Kant-Studien, 91 (2000), 385-94 .\n82\n CprR, 5:162.\n83\n Paul Guyer, ' F r eedom as the inner value of the wor ld ' , in Guyer,\nFreedom, Law, Happiness, p p . 9 6 - 1 2 8 .\n84\n Ibid., p . 110.\n85\n Ibid., p . l l l .\n86\n Ibid., p . 113.\n87\n Paul Guyer, 'Kantian liberalism', in Guyer, Freedom, Law, Happiness,\np . 239 .\n88\n Paul Guyer, 'Life, liberty, and proper ty ' , in Guyer, Freedom, Law,\nHappiness, p . 2 6 6 , emphasis added.\n89\n RL, 6: 3 1 1 . There is nothing in the Rechtslehre that approximates\nGuyer's account of the ends of Right. As Ludwig emphasizes, the text\nmakes 'no reference to human desires, needs, or interests . . . no refer-\nence to any rational pursuit of life or the constitution of a person as a\nsource of individuality . . . no reference to human nature in the sense\nof being prone to war ' - and no reference, we may add, to the pursuit\nof human happiness. Cf. Ludwig, 'Whence public right?' , in\nM . Timmons (ed.), The Metaphysics of Morals, pp . 159 -83 , at 171 .\n90\n CprR, 5: 44 .\n91\n This paper was originally written for a conference on 'Kant's phil-\n38 KANTIAN REVIEW, VOLUME 12, 2007\nhttp:\/\/journals.cambridge.org Downloaded: 14 May 2012 IP address: 158.143.197.75\nKANT'S INDEMONSTRABLE POSTULATE OF RIGHT\nosophy of value', held at the University of Hertfordshire in March\n2003. Different drafts of the paper were given at seminars at the\nUniversity of Sheffield and at Manchester Metropolitan University. I\nwould like to thank organizers and participants of all these events for\ntheir helpful comments and suggestions. My particular thanks to\nSorin Baiasu, David Bell, Paul Guyer, Peter Niessen, Onora O'Neill,\nJane Singleton and Robert Stern. Finally, I would like to thank the\nanonymous referees for the Kantian Review for their comments and\nsuggestions for preparing the final version of this paper.\nKANTIAN REVIEW, VOLUME 12,2007 39\n"}