{"doi":"10.1016\/j.jasms.2009.05.002","coreId":"19135","oai":"oai:eprints.bham.ac.uk:396","identifiers":["oai:eprints.bham.ac.uk:396","10.1016\/j.jasms.2009.05.002"],"title":"Hot Electron Capture Dissociation Distinguishes Leucine from Isoleucine in a Novel Hemoglobin Variant, Hb Askew, β54(D5)Val→Ile","authors":["Williams, Jonathan P.","Creese, Andrew J.","Roper, David R.","Green, Brian N.","Cooper, Helen J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Population migration has led to the global dispersion of human hemoglobinopathies and has precipitated a need for their identification. An effective mass spectrometry-based procedure involves analysis of the intact α- and β-globin chains to determine their mass, followed by location of the variant amino acid residue by direct analysis of the enzymatically digested chains and low-energy collision induced dissociation of the variant peptide. Using this procedure, a variant was identified as either β54Val→Leu or β54Val→Ile, since the amino acids leucine and isoleucine cannot be distinguished using low-energy collisions. Here, we describe how hot electron capture dissociation on a Fourier transform-ion cyclotron resonance mass spectrometer was used to distinguish isoleucine from leucine and identify the mutation as β54(D5)Val→Ile. This is a novel variant, and we have named it Hb Askew","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:396<\/identifier><datestamp>\n      2011-10-12T11:06:40Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5152<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Hot Electron Capture Dissociation Distinguishes Leucine from Isoleucine in a Novel Hemoglobin Variant, Hb Askew, β54(D5)Val→Ile<\/dc:title><dc:creator>\n        Williams, Jonathan P.<\/dc:creator><dc:creator>\n        Creese, Andrew J.<\/dc:creator><dc:creator>\n        Roper, David R.<\/dc:creator><dc:creator>\n        Green, Brian N.<\/dc:creator><dc:creator>\n        Cooper, Helen J.<\/dc:creator><dc:subject>\n        QR Microbiology<\/dc:subject><dc:description>\n        Population migration has led to the global dispersion of human hemoglobinopathies and has precipitated a need for their identification. An effective mass spectrometry-based procedure involves analysis of the intact α- and β-globin chains to determine their mass, followed by location of the variant amino acid residue by direct analysis of the enzymatically digested chains and low-energy collision induced dissociation of the variant peptide. Using this procedure, a variant was identified as either β54Val→Leu or β54Val→Ile, since the amino acids leucine and isoleucine cannot be distinguished using low-energy collisions. Here, we describe how hot electron capture dissociation on a Fourier transform-ion cyclotron resonance mass spectrometer was used to distinguish isoleucine from leucine and identify the mutation as β54(D5)Val→Ile. This is a novel variant, and we have named it Hb Askew.<\/dc:description><dc:date>\n        2009<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/396\/1\/cooper2009_JASMS2.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/396\/1.hassmallThumbnailVersion\/cooper2009_JASMS2.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jasms.2009.05.002<\/dc:relation><dc:identifier>\n        Williams, Jonathan P. and Creese, Andrew J. and Roper, David R. and Green, Brian N. and Cooper, Helen J. (2009) Hot Electron Capture Dissociation Distinguishes Leucine from Isoleucine in a Novel Hemoglobin Variant, Hb Askew, β54(D5)Val→Ile. Journal of the American Society for Mass Spectrometry, 20 (9). p. 1707. ISSN 10440305<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/396\/<\/dc:relation><dc:language>\n        English<\/dc:language><dc:contributor.sponsor>\n        The Wellcome Trust<\/dc:contributor.sponsor><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/396\/1.hassmallThumbnailVersion\/cooper2009_JASMS2.pdf","http:\/\/dx.doi.org\/10.1016\/j.jasms.2009.05.002","http:\/\/eprints.bham.ac.uk\/396\/"],"year":2009,"topics":["QR Microbiology"],"subject":["Article","PeerReviewed"],"fullText":"Hot Electron Capture Dissociation\nDistinguishes Leucine from Isoleucine in a\nNovel Hemoglobin Variant, Hb Askew,\n\u000154(D5)Val¡Ile\nJonathan P. Williams,a Andrew J. Creese,b David R. Roper,c\nBrian N. Green,d and Helen J. Cooperb\na Department of Chemistry, University of Warwick, Coventry, United Kingdom\nb School of Biosciences, College of Life and Environmental Sciences, University of Birmingham, Edgbaston,\nUnited Kingdom\nc Department of Hematology, Imperial College Healthcare NHS Trust, Hammersmith Hospital, London,\nUnited Kingdom\nd Waters MS Technologies Centre, Micromass UK Ltd., Cheshire, United Kingdom\nPopulation migration has led to the global dispersion of human hemoglobinopathies and\nhas precipitated a need for their identification. An effective mass spectrometry-based\nprocedure involves analysis of the intact \u0001- and \u0002-globin chains to determine their mass,\nfollowed by location of the variant amino acid residue by direct analysis of the\nenzymatically digested chains and low-energy collision induced dissociation of the variant\npeptide. Using this procedure, a variant was identified as either \u000254Val¡Leu or\n\u000254Val¡Ile, since the amino acids leucine and isoleucine cannot be distinguished using\nlow-energy collisions. Here, we describe how hot electron capture dissociation on a Fourier\ntransform-ion cyclotron resonance mass spectrometer was used to distinguish isoleucine\nfrom leucine and identify the mutation as \u000254(D5)Val¡Ile. This is a novel variant, and we\nhave named it Hb Askew. (J Am Soc Mass Spectrom 2009, 20, 1707–1713) © 2009\nAmerican Society for Mass SpectrometryHemoglobin (Hb) exists in the blood cells ofvertebrates as a noncovalently assembled tet-ramer of \u0001- and \u0002-chains (\u00012\u00022), in which each\nchain is associated with a heme group. Its primary\nfunction is to supply oxygen to the organs of the body.\nAbnormalities of human hemoglobin (Hb) are the most\ncommon autosomal recessive inherited disorders in\nman. These disorders can be both quantitative, due to\nimpaired synthesis of the globin chains (thalassemia\nsyndromes), or qualitative (structural variants). Many\nhemoglobinopathies do not cause clinical problems, but\nsome are responsible for morbidity and mortality.\nHb variants initially tended to be located with high-\nfrequency in tropical and subtropical regions such as\nAfrica, the Caribbean, the Mediterranean, Asia, and the\nFar East. The large degree of population migration has\nled to the worldwide spread of Hb disorders.\nHb variants are often detected as part of a routine\nglycohemoglobin screen during diabetic monitoring or\nantenatal and neonatal screening healthcare programs.\nHemoglobinopathy diagnosis in clinical laboratories is\nAddress reprint requests to Dr. J. P. Williams, Department of Chemistry,\nUniversity of Warwick, Coventry, CV4 7AL, UK. E-mail: J.P.Williams@\nwarwick.ac.uk or to Dr. H. J. Cooper, School of Biosciences, University of\nBirmingham, Edgbaston, Birmingham, B15 2TT, UK. E-mail: H.J.Cooper@\nbham.ac.uk\n© 2009 American Society for Mass Spectrometry. Published by Elsevie\n1044-0305\/09\/$32.00\ndoi:10.1016\/j.jasms.2009.05.002routinely accomplished using isoelectric focusing (IEF)\nor cation exchange high-performance liquid chromatog-\nraphy (ce-HPLC) procedures. These methods presump-\ntively identify variants but cannot positively identify\nany variant. Precise variant identification requires pro-\ntein sequencing or DNA analysis. The majority of Hb\nvariants listed in the Globin Gene Server [1] database\nresult from a single point mutation in either the \u0001- or \u0002\nglobin gene that leads to the production of a single\namino acid substitution in either the \u0001- or \u0002-chain of the\nHb protein. Although many of these variants may be\ninnocuous, once detected in a first-line hospital screen,\nit is sensible to precisely identify the mutation.\nA procedure for identifying Hb variants by electro-\nspray ionization mass spectrometry (ESI-MS) has been\ndescribed previously [2, 3]. There are three steps in this\nprocedure. The first step involves analyzing blood\ndiluted in a denaturing solvent to determine the molec-\nular weight of the variant chain and assign the variant\nto the \u0001- or \u0002-chain. In the second step, diluted blood is\ndigested with trypsin and the resulting mixture of\npeptides analyzed directly by ESI-MS. The third step\ninvolves sequencing the variant tryptic peptide by\ntandem mass spectrometry if required. No chromato-\ngraphic separation of the tryptic peptides before or\nduring analysis is required. The accurate average mass\nPublished online May 18, 2009\nr Inc. Received February 23, 2009\nRevised May 5, 2009\nAccepted May 8, 2009\n1708 WILLIAMS ET AL. J Am Soc Mass Spectrom 2009, 20, 1707–1713measurement involved in step one allows for the detec-\ntion of variants in heterozygotes that differ by as little as\n1 Da from normal, providing the variant is present at\n\u000110% relative abundance [3, 4]. Using this procedure\nand applying the \u0001-chain mass for internal calibration,\nthe normal \u0002-chain mass can be determined with a\nprecision of \u00030.03 Da standard deviation [4]. Important\nminor Hb fractions, such as HbA1C (assessment of\nlong-term glycemic control in diabetics) [5–7] and HbA2\n(biomarker for \u00020-thalassemia trait) [8], are also de-\ntected and quantified using these procedures following\ncalibration with standards.\nThe above procedure involves sequencing peptides\nvia low-energy collision-induced dissociation (CID) in a\ntriple quadrupole instrument, and\u000195% of the variants\nencountered in practice can be identified. However,\nthere are a number of variants that involve amino acid\nexchanges governed by single mutations in the nucleo-\ntide codon to either leucine (Leu) or isoleucine (Ile),\nwhich cannot be differentiated using this procedure.\nLeu and Ile are isomeric species. Therefore, low-energy\nCID of variant peptide precursor ions, which contain\neither Leu or Ile, generates sequence ions [9] of the same\nm\/z and renders unequivocal assignment of these spe-\ncies impossible.\nHere, we describe a mass spectrometric approach,\nwhich allows distinction between Leu and Ile when char-\nacterizing human hemoglobinopathies. This approach uti-\nlizes hot electron capture dissociation (HECD) [10] on a\nFourier transform ion cyclotron resonance (FT-ICR)\nmass spectrometer. In conventional (low-energy) ECD\n[11, 12], peptide backbone cleavage occurs at the N-C\u0001\nbond to produce c= and z• ions. These fragments also\nresult from HECD but are accompanied by extensive\nsecondary fragmentation due to the excess energy.\nSecondary fragmentation of amino acid side chains of\nz• ions result in the formation of w ions. The loss of\n•CH(CH3)2 (\u000243 Da) or •CH2CH3 (\u000229 Da) from z•\nions containing N-terminal Leu or Ile, respectively,\nScheme 1. Secondary fragmentation of a z• io\na leucine residue and (b) an isoleucine residue.enables the two amino acids to be distinguished, see\nScheme 1. This method has been demonstrated on\nsynthetic peptides [10] and the bovine milk protein PP3\n[13]. In the present example, a blood sample was found\nto contain three variants, one of which involved a\nmutation to either Leu or Ile. Here we show how HECD\nwas used to resolve the ambiguity and identify a novel\n\u0002-chain variant. To confirm the assignment, HECD of\nLeu- and Ile-containing synthetic analogues of the tryp-\ntic peptide containing the variant was also performed.\nThis work demonstrates the significant potential role of\nHECD in the characterization of these types of Hb\nmutation, and also constitutes the first true clinical\napplication of the HECD technique.\nMethods\nCation-Exchange HPLC\nCation-exchange HPLC with UV detection was per-\nformed on a VARIANT HPLC system using the Variant\n\u0002-thalassemia Short program (Bio-Rad Laboratories\nLtd., Hemel Hempstead, Hertfordshire, UK).\nSample Preparation\nThe procedures for identifying variants in blood sam-\nples by mass spectrometry have been previously de-\nscribed in detail elsewhere [2, 3]. Briefly, 10 \u0004L of the\nblood sample (in ethylene diamine tetra-acetic acid\n(EDTA) anti-coagulant) was diluted 50-fold with 490 \u0004L\nof water to give a stock solution. Then, 20 \u0004L of the\nstock solution was diluted a further 10-fold with 180 \u0004L\nof 5:4 acetonitrile:water containing 0.2% formic acid\n(Solution A). Tryptic digests were prepared as follows:\nfirst, 100 \u0004L of the stock solution was denatured by\nmixing with 20 \u0004L of 50% aqueous acetonitrile contain-\ning 0.5% formic acid. Then, 6 \u0004L of 1 M ammonium\nbicarbonate solution was added, followed by 5 \u0004L of a\nroduce the w ion from a peptide containing (a)n to p\n1709J Am Soc Mass Spectrom 2009, 20, 1707–1713 HECD FOR ANALYSIS OF VARIANTS OF HEMOGLOBIN5 mg\/mL solution of trypsin (T1426, Sigma-Aldrich\nCorp., St. Louis, MO, USA). The resulting solution was\nthen incubated at 37 °C for 30 min, after which aliquots\nwere diluted 10-fold with Solution A.\nThe peptides FFESFGDLSTPDAIMGNPK and FFESFG-\nDLSTPDALMGNPK were synthesized by AltaBioscience,\nUniversity of Birmingham, UK, and used without fur-\nther purification. The peptides were diluted to 2\npmol\/\u0004L in methanol (Fisher Scientific, Leicester-\nshire, UK):water (J. T. Baker, Deventer, The Nether-\nlands) (75:25) with 1% formic acid (Fisher Scientific).\nMass Spectrometry\nESI-MS was performed on two instruments. Initial\nexperiments were undertaken on a triple quadrupole\nmass spectrometer (Quattro Ultima; Waters MS Tech-\nnologies, Manchester, UK) equipped with the standard\nZ-spray electrospray ion source and operated at a\nsource and desolvation temperature of 110 °C. Sample\nsolutions were introduced into the source region of the\ninstrument at a rate of 5 \u0004L\/min. The instrument was\noperated in positive mode of ionization, with a capillary\nvoltage of 3 kV, a cone voltage of 80 V, and hexapole 1\nion guide set to 60 V. Tandem mass spectrometry\n(MS\/MS) was carried out using argon collision gas at a\npressure of 2.5 \u0003 10\u00023 mbar within the RF-only hexa-\npole collision cell. Fragmentation of the precursor tryp-\ntic peptide ions was achieved with a collision energy of\n30 eV.\nFT-ICR analysis was performed on a Thermo Finni-\ngan LTQ FT mass spectrometer (Thermo Fisher Scien-\ntific, Bremen, Germany). Samples were injected by use\nof an Advion Biosciences Triversa electrospray source\n(Advion Biosciences, Ithaca, NY, USA) at a flow rate of\n\u0004200 nL\/min. For all experiments, scans were acquired\nin the ICR cell with a resolution of 100,000 at m\/z 400.\nECD and HECD of tryptic peptide: precursor ions were\nisolated in the linear ion trap and transferred to the ICR\ncell for (H)ECD. AGC target was 1 \u0003 106. Isolation\nwidth was 6 Th. The electrons for (H)ECD were pro-\nduced by an indirectly heated barium-tungsten cylin-\ndrical dispenser cathode (5.1 mm diameter, 154 mm\nfrom the cell, 1 mm off axis) (Heat-Wave Labs, Watson-\nville, CA, USA). The current across the electrode was\n\u00041.1 A. Ions were irradiated for 70 ms at 5% energy\n(ECD) (corresponding to ECD cathode potential \u00024.35\nV) or 15% energy (HECD) (corresponding to ECD\ncathode potential \u000214.35 V). Each (H)ECD scan com-\nprised four co-added microscans. Mass spectra shown\ncomprise fifty averaged scans. HECD of synthetic pep-\ntides: instrumental parameters were as above, except\nthat the current across the electrode was \u00041.0 A. Ions\nwere irradiated for 70 ms at 17.5% energy (correspond-\ning to ECD cathode potential \u000216.18 V). Each HECD\nscan comprised 20 co-added microscans. Mass spectra\nshown comprise one scan.Results\nA blood sample was submitted for investigation by mass\nspectrometry because abnormalities had been detected\nduring a routine antenatal screen in a hospital hematology\nlaboratory using ce-HPLC. The ce-HPLC chromatogram\n(Figure 1) showed two abnormal peaks, which eluted after\nthe time for normal adult Hb (A0, 2.44 min). The elution\ntime of the earlier peak (4.50 min) corresponds to that of\nthe clinically significant Sickle variant, but the peak itself is\natypical in that there appear to be shoulders on both its\nleading and trailing edges. A sickle cell solubility test was\npositive. Apart from the unusual ce-HPLC chromato-\ngram, no other hematological abnormalities were ob-\nserved. To clarify these anomalies, the sample was sub-\nmitted for analysis by ESI-MS.\nInitially, mass spectrometric analysis was performed\non a triple quadrupole instrument. Analysis of the intact\nHb chains revealed the presence of one \u0001-chain variant\nand, surprisingly, two \u0002-chain variants (Figure 2). The\n\u0001-chain variant was 14 Da heavier than normal and its\nproportion of total \u0001-chains was 28.3%. It was identified\nfrom a 30-min tryptic digest as Hb Stanleyville II\n(\u000178{EF7}Asn¡Lys). The lighter \u0002-chain variant (normal\n\u0002\u000230Da and 42.2% of total \u0002-chains) was confirmed from\nthe same digest as Hb Sickle (\u00026{A3}Glu¡Val). The un-\nexpected third variant was 14 Da heavier than the normal\n\u0002-chain and its mutant amino acid was shown from the\nspectrum of the tryptic digest to occur in the \u0002T5 peptide\n(Figure 3). There are nine potential mutations in this\npeptide that could give a 14 Da mass increase by a single\nbase change in the nucleotide codon. To distinguish these\npossibilities, the normal and variant \u0002T52\u0005 ions were\nsequenced by tandem mass spectrometry using low-energy\nCID (Figure 4). The 14 Damass increase at y\u00066 between the\nspectra from (a) the normal peptide and (b) the variant\npeptide placed the mutation at \u000254, but did not allow\n\u000254Val¡Leu to be distinguished from \u000254Val¡Ile.\nTo precisely characterize the mutation and resolve\nthe ambiguity between these two isomeric amino acids,\nthe variant \u0002T52\u0005 ion was subjected to hot ECD. The\nECDmass spectrum obtained under standard operating\nFigure 1. Cation-exchange HPLC trace of the abnormal blood\nsample. Peak names are those assigned by the ce-HPLC system.\nA0: normal hemoglobin.\nrespe\n1710 WILLIAMS ET AL. J Am Soc Mass Spectrom 2009, 20, 1707–1713conditions (ECD energy \u0007 5%, corresponding to ECD\ncathode potential \u0007 \u00024.35 V) (data not shown) did not\nallow differentiation between the isomeric amino acids.\nInterestingly, z6 ions were not observed in that mass\nspectrum. At higher electron energies (ECD energy \u0007\n15%, corresponding to ECD cathode potential \u0007 \u000214.35\nV) (Figure 5), additional fragmentation was detected. A\npeak corresponding to the z6= ion (m\/zmeas 644.3446,\nFigure 2. Maximum entropy deconvoluted ESI\nabnormal blood sample obtained by the triple q\nDa heavier than normal \u0001-chain variant (\u0001X), and\nother 14 Da heavier than normal (\u0002X). Masses a\n\u0001- and \u0002-chains are 15,126.38 and 15,867.24 Da,\nFigure 3. Diagnostic region of mass spectra o\n30-min tryptic digests of (a) a normal control sa\nmutation in the heavier than normal \u0002-chain variantm\/zcalc 644.3436) was observed, as was a peak corre-\nsponding to (z6• \u0002 29), (see insets). (Note that z= ions\nare the result of hydrogen abstraction by radical z• ions.\nIn the present case, apparently the z6• ions either\nfragment producing w ions, or hydrogen abstraction\noccurs resulting in z6= ions). No peak corresponding to\n(z6•\u0002 43) was observed at m\/z 600. As described above,\nthe z6• \u0002 29 ion constitutes a secondary w ion originat-\nspectrum of the 500-fold diluted and denatured\nupole instrument. It shows the presence of a 14\n\u0002-chain variants, one 30 Da lighter (\u0002S) and the\nperimental. The sequence masses of the normal\nctively. GSH: glutathione.\ned by the triple quadrupole instrument from\nand (b) the abnormal sample showing that themass\nuadr\ntwo\nre exbtain\nmpleoccurs in the \u0002T5 peptide.\n54Va\n1711J Am Soc Mass Spectrom 2009, 20, 1707–1713 HECD FOR ANALYSIS OF VARIANTS OF HEMOGLOBINing from an isoleucine residue (Scheme 1). To confirm\nour assignment, we performed HECD on the synthetic\npeptides FFESFGDLSTPDAIMGNPK and FFESFGDLST-\nPDALMGNPK (Figure 6). As for the \u0002T52\u0005 ions, HECD of\n[M \u0005 2H]2\u0005 ions of FFESFGDLSTPDAIMGNPK (Figure\n6a) resulted in a peak corresponding to (z6• \u0002 29) ions.\nNo peak corresponding to (z6• \u0002 43) ions was observed.\nHECD of [M \u0005 2H]2\u0005 ions of FFESFGDLSTPDALMGNPK\n(Figure 6b) resulted in a peak corresponding to (z6• \u0002 43)\nFigure 4. Diagnostic region of product ion spec\nnormal \u0002T52\u0005 peptide ion and (b) the variant \u0002T\nand (b) at y\u00066 identifies the mutation as either \u0002\nFigure 5. HECDmass spectra of the variant \u0002T\nThe insets show the detection of the w6 (z6\u0002 29 Da) ionions. No peak corresponding to (z6• \u0002 29) ions was\nobserved. The mutation is thus identified as \u000254(D5)Val¡\nIle. This mutation has not been described previously [1],\nand we have named it Hb Askew.\nDiscussion\nAs a stand alone technique ce-HPLC may presump-\ntively, but never positively, identify any variant. Mass\nbtained using the triple quadrupole from (a) the\neptide ion. The 14 Da mass-increase between (a)\nl¡Leu or \u000254Val¡Ile.\neptide ion obtained using the FT-ICR instrument.tra o\n52\u0005 p52\u0005 p\nwhich identifies the mutation as \u000254(D5)Val¡Ile.\nK. T\n1712 WILLIAMS ET AL. J Am Soc Mass Spectrom 2009, 20, 1707–1713spectrometry has been shown to be a powerful comple-\nmentary technique, which can detect and identify phe-\nnotypically silent mutations as well as those that are\neasily detected by ce-HPLC [8]. In this study, the\nmutation \u000254(D5)Val¡Ile is silent by ce-HPLC and was\nonly discovered because it occurred together with other\ndetectable mutations in the same patient, so prompting\nfurther investigation. The aim of the UK antenatal\nscreening program is to detect Sickle Hb, \u0002-thalassemia\ntrait, or one of the clinically significant variants, such as\nFigure 6. HECD mass spectra of the [M \u0005 2H]\nDAIMGNPK and (b) FFESFGDLSTPDALMGNPHb C, D-Punjab, E, O-Arab, and Lepore, which areknown to interact with Sickle to cause sickling. The\ninitial 3 min analysis of the intact Hb chains supported\nthe likely presence of the Sickle variant and ruled out\nthe presence of any of the above known interacting\nvariants. The results also demonstrate the utility of\nHECD for distinguishing between Leu and Ile residues\nin human hemoglobinopathies obviating the need for\nDNA analysis. The variant was initially identified as\n\u000254Val¡Leu or Ile by triple quadrupole mass spec-\ntrometry. Low-energy CID on the triple quadrupole\nns of the synthetic peptides (a) FFESFGDLSTP-\nhe insets show the detection of the w6 ions.2\u0005 ioand FT-ICR instruments, and conventional ECD could\n1713J Am Soc Mass Spectrom 2009, 20, 1707–1713 HECD FOR ANALYSIS OF VARIANTS OF HEMOGLOBINnot resolve the ambiguity as backbone sequence frag-\nments from the isomers have identical masses. HECD\nresults in secondary fragmentation of the amino acid\nside-chains allowing Leu and Ile to be distinguished. In\nthe present case, we identified the valine to isoleucine\nmutation at position 54 in the \u0002-chain following detec-\ntion of the w6 (z6• \u0002 29) ion from the peptide FFESFG-\nDLSTPDAIMGNPK, and the absence of a w6 (z6• \u0002 43)\nion that would have implied the tryptic peptide FFES-\nFGDLSTPDALMGNPK. The assignment was con-\nfirmed by performing HECD on the synthetic analogues\nof these peptides. The codon for the \u000254Val is GTT. The\ncodons for Ile are ATT, ATC, and ATA, and those for\nLeu are TTA, TTG, CTT, CTC, CTA, and CTG. Thus we\nconclude that the Askew variant is the result of a single\nbase change in the nucleotide codon, GTT¡ ATT.\nAcknowledgments\nJPW thanks the Warwick University Research Development Fund\nfor a grant and Professor Peter J. Sadler for helpful discussions.\nHJC gratefully acknowledges the Wellcome Trust (074131) for\nfunding.\nReferences\n1. Hardison, R. C.; Chui, D. H. K.; Giardine, B.; Riemer, C.; Patrinos, G. P.;\nAnagnou, N.; Millar, W.; Wajcman, H. HbVar: A relational database of\nhuman hemoglobin variants and thalassemia mutations at the globin\ngene server. Human Mutat. 2002, 19, 225–233. (http:\/\/globin.cse.\npsu.edu).2. Wild, B. J.; Green, B. N.; Cooper, E. K.; Lalloz, M. R. A.; Erten, S.;\nStephens, A. D.; Layton, D. M. Rapid identification of hemoglobin\nvariants by electrospray ionization mass spectrometry. Blood Cells Mol.\nDis. 2001, 27, 691–704.\n3. Rai, D. K.; Griffiths, W. J.; Landin, B.; Wild, B. J.; Alvelius, G.; Green,\nB. N. Accurate mass measurement by electrospray ionization quadru-\npole mass spectrometry: Detection of variants differing by \b6 Da from\nnormal in human hemoglobin heterozygotes. Anal. Chem. 2003, 75,\n1978–1982.\n4. Bateman, R. H.; Green, B. N.; Morris, M. Electrospray ionization mass\nspectrometric analysis of the globin chains in hemoglobin heterozygotes\ncan detect the variants HbC, D, and E. Clin. Chem. 2008, 54, 1256–1257.\n5. Roberts, N. B.; Green, B. N.; Morris M. Potential of electrospray mass\nspectrometry for quantifying glycohemoglobin. Clin. Chem. 1997, 43,\n771–778.\n6. Roberts, N. B.; Amara, A. B.; Morris, M.; Green, B. N. Long-term\nevaluation of electrospray ionization mass spectrometric analysis of\nglycated hemoglobin. Clin. Chem. 2001, 47, 316–321.\n7. Williams, J. P., Jackson, H., Green, B. N. Hb Belleville\n[\u000210(A7)Ala¡Thr] affects the determination of Hb A1C by routine\ncation exchange high performance liquid chromatography. Hemoglobin\n2009, 33, 45–50.\n8. Williams, J. P.; Scrivens, J. H.; Green, B. N.; Farrar, L. M.; Sutcliffe, M.\nHb Leeds [\u000256(D7)Gly¡Cys]: A new hemoglobin that aggravates\nanemia in a child with \u00020-thalassemia trait. Hemoglobin 2007, 31,\n367–373.\n9. Roepstorff, P.; Fohlman, J. Proposal for a common nomenclature for\nsequence ions in mass spectra of peptides. Biol. Mass Spectrom. 1984, 11,\n601.\n10. Kjeldsen, F.; Haselmann, K. F.; Budnik, B. A.; Jensen, F.; Zubarev, R. A.\nDissociative capture of hot (3–13 eV electrons by polypeptide polyca-\ntions: An efficient process accompanied by secondary fragmentation.\nChem. Phys. Lett. 2002, 356, 201–206.\n11. Cooper, H. J.; Hakansson, K.; Marshall, A. G. The role of electron\ncapture dissociation in biomolecular analysis. Mass Spectrom. Rev. 2005,\n24, 201–222.\n12. Zubarev, R. A.; Kelleher, N. L.; McLafferty, F. W. ECD of multiply\ncharged protein cations. A nonergodic process. J. Am. Chem. Soc. 1998,\n120, 3265–3266.\n13. Kjeldsen, F.; Haselmann, K. F.; Sorensen, E. S.; Zubarev, R. A. Distin-\nguishing of Ile\/Leu amino acid residues in the PP3 protein by (hot)\nelectron capture dissociation in Fourier transform ion cyclotron reso-\nnance mass spectrometry. Anal. Chem. 2003, 75, 1267–1274.\n"}