{"doi":"10.1063\/1.1312202","coreId":"101803","oai":"oai:epubs.surrey.ac.uk:1236","identifiers":["oai:epubs.surrey.ac.uk:1236","10.1063\/1.1312202"],"title":"Influence of sp(2) clusters on the field emission properties of amorphous carbon thin films","authors":["Carey, JD","Forrest, RD","Khan, RUA","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-09-25","abstract":"<p>The influence of the concentration and size of sp<sup>2<\/sup> carbon clusters on the field emission properties of hydrogenated amorphous carbon thin films is investigated. In combination with electron paramagnetic resonance and optical measurements, it is shown that the trend in the threshold field for emission for films deposited under certain conditions can be explained in terms of improvements in the connectivity between sp<sup>2<\/sup> clusters. These clusters are believed to be located near the Fermi level, and the connectivity is primarily determined by the cluster size and concentration, which in turn is determined by the choice of deposition conditions. Details of the appropriate emission mechanisms for different types of deposited carbon films are discussed.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1236<\/identifier><datestamp>\n      2017-10-31T14:01:11Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1236\/<\/dc:relation><dc:title>\n        Influence of sp(2) clusters on the field emission properties of amorphous carbon thin films<\/dc:title><dc:creator>\n        Carey, JD<\/dc:creator><dc:creator>\n        Forrest, RD<\/dc:creator><dc:creator>\n        Khan, RUA<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:description>\n        <p>The influence of the concentration and size of sp<sup>2<\/sup> carbon clusters on the field emission properties of hydrogenated amorphous carbon thin films is investigated. In combination with electron paramagnetic resonance and optical measurements, it is shown that the trend in the threshold field for emission for films deposited under certain conditions can be explained in terms of improvements in the connectivity between sp<sup>2<\/sup> clusters. These clusters are believed to be located near the Fermi level, and the connectivity is primarily determined by the cluster size and concentration, which in turn is determined by the choice of deposition conditions. Details of the appropriate emission mechanisms for different types of deposited carbon films are discussed.<\/p><\/dc:description><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2000-09-25<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1236\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Carey, JD, Forrest, RD, Khan, RUA and Silva, SRP  (2000) Influence of sp(2) clusters on the field emission properties of amorphous carbon thin films   APPLIED PHYSICS LETTERS, 77 (13), PII [S.  pp. 2006-2008.      <\/dc:identifier><dc:relation>\n        10.1063\/1.1312202<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1236\/","10.1063\/1.1312202"],"year":2000,"topics":[],"subject":["Article","NonPeerReviewed"],"fullText":"  \nInfluence of sp2 clusters on the field emission  \nproperties of amorphous carbon thin films \n \nJ. D. Careya), R. D. Forrest, R. U. A. Khan and S. R. P. Silva  \nSchool of Electronic Engineering, Information Technology and Mathematics,  \nUniversity of Surrey, Guildford GU2 7XH, United Kingdom \n \n \n \nThe influence of the concentration and size of sp2 carbon clusters on the field emission properties \nof hydrogenated amorphous carbon thin films is investigated. In combination with electron \nparamagnetic resonance and optical measurements, it is shown that the trend in the threshold \nfield for emission for films deposited under certain conditions can be explained in terms of \nimprovements in the connectivity between sp2 clusters. These clusters are believed to be located \nnear the Fermi level, and the connectivity is primarily determined by the cluster size and \nconcentration which in turn is determined by the choice of deposition conditions.  \n \n \n \na) Electronic mail:  David.Carey@surrey.ac.uk \n \n \n \n \n \n 1\nAppl. Phys. Lett. 77, (2000) 2006\n Amorphous carbon (a-C) and hydrogenated amorphous carbon (a-C:H) have attracted \nconsiderable attention due to possible applications as semiconductor materials [1] and as a \npotential field emission (FE) cathode material. [2]  There has been a great deal of interest in \ndetermining whether the most important factors which govern emission are “front surface” based \nsuch as negative electron affinity and surface termination. [3] An alternative mechanism in \nwhich the presence of a large internal electric field at the film\/substrate interface resulting in hot- \nelectron transport – the “back contact” model – has also been proposed. [4] The reduction of the \nthreshold field with N content [4],  the dependence of the threshold field with film thickness [5], \nand the non-uniformity of emission across a film surface have also been reported. [6, 7] The \nrelative proportion of the different hybridised C states influences the electronic structure with the \noptical properties being largely controlled by the size of sp2 clusters. [8, 9].  \nThe sp2 content is also important in the understanding of electron paramagnetic \nresonance (EPR) measurements made on a-C:H films [10]. EPR is sensitive to centers with a net \nunpaired election spin, for example such centers can result from odd numbered clusters. The \nlocation in the energy gap of sp2 clusters depends on whether they are even or odd numbered and \nwhether they are distorted or not [8]. Undistorted even numbered clusters give rise to states near \nthe Fermi level (EF) only if they are large enough, whereas odd clusters will give rise to states \neven if composed of a small number of clusters. Distorted clusters will give rise to states that are \ncloser to the EF than undistorted clusters [8]. In this way EPR can give a measure of the density \nof sp2 states at the Fermi level provided that a majority of these states have a net unpaired \nelectron present though the paramagnetically active sp2 states are likely to be only a small \nfraction of the total density of sp2 clusters. [8] There is some evidence that the properties of the \nsp2 clusters may have a significant role in determining the FE properties of amorphous carbon \nfilms [11]. In this letter we report the results of field emission, EPR and optical measurements on \na-C:H thin films deposited using r.f. plasma-enhanced chemical vapor deposition at different \nself-biases and varying nitrogen content.  \n 2\nAppl. Phys. Lett. 77, (2000) 2006\n Films of a-C:H(:N) were deposited on the driven and earthed electrode of a Plasma \nTechnology DP800 capacitively coupled radio frequency (13.56 MHz) plasma enhanced \nchemical vapour deposition system.  Films were grown on n-type 1-2 Ω cm (100) Si substrates \nfor FE measurements, onto Corning 7059 glass for optical measurements and high resistivity \n(>100 Ω cm) Si (100) substrates for EPR measurements. During deposition feed gases of \nmethane (30 sccm) with He (75 sccm) were used. The total deposition pressure was 200 mTorr. \nFilm thicknesses were measured using ellipsometry.  Nitrogenation of films deposited on the \nearth electrode was accomplished by addition of N2 into the deposition chamber with flow rates \nbetween 0-15 sccm. [12] \nThe FE characteristics of these films were examined using a sphere-to-plane geometry in \nwhich a 5 mm stainless-steel ball bearing is suspended 40 µm above the surface at a high \npositive potential in a vacuum better than 4 x 10-6 mbar. In a majority of the samples examined a \nlarge (> 40 V\/µm) field was required to initiate emission on the first voltage cycle, this reduced \nafter subsequent cycles and is evidence of conditioning of the film. [5] The threshold field (Eth) \nis defined as the macroscopic electric field which gives an emission current of 1 nA for a \nconditioned film. Room-temperature EPR measurements were made in a modified Bruker EPR \nspectrometer using 100 kHz field modulation and a microwave frequency of about 9.9 GHz. \nSpin concentrations were determined by comparing  with a standard Varian sample of pitch in \nKCl. The absolute spin populations are estimated to be correct to within a factor of 2; however, \ntheir relative values are correct to within ± 20%.  \n The variation of Eth for films deposited under different self-biases is shown in Fig. 1(a). \nAt a dc self bias of –50 V, Eth is 18 V\/µm, which initially increases to 26 V\/µm for films \ndeposited at –90 V and then decreases at high biases to remain approximately constant at about \n12 V\/µm. The measured spin densities, Ns, of these films are shown in Fig. 1(b). From the lowest \nbias Ns rises rapidly from 3 x 1017 cm-3  to 1.1 x 1020 cm-3 at –125 V. At higher biases Ns \nincreases only very gradually, finally reaching 1.6 x 1020   cm-3.  The Tauc gap and peak-to-peak \n 3\nAppl. Phys. Lett. 77, (2000) 2006\n linewidth ∆Bpp of the EPR signal are shown in Fig. 2. The Tauc gap falls rapidly from 2.6 eV (-\n50 V bias) to 1.3 eV (-125 V) and then falls gradually to about 1.1 eV at the highest bias \nvoltages. In the case of ∆Bpp there is an initial increase in the linewidth reaching a maximum of \n1.4 mT at  –125 V bias and then followed by a rapid decrease to 0.7 mT, which continues to \ndecrease to 0.56 mT at –265 V bias. At these higher biases the line shape is Lorentzian and the g \nvalue is 2.0027(2). At lower biases the line shape is composed of the C related centers at 2.0027 \nas well as defects originating from the Si substrate as described elsewhere. [13]   \nFor the sample deposited at –125 V bias the measured spin density is 1.1 x 1020 cm-3 and \nobserved linewidth is 1.4 mT. This line has a Lorentzian line shape and one of the sources of line \nbroadening which would produce such a line shape is dipolar broadening between like spins. \nAbragam has shown that the linewidth ∆Bppdipolar (mT), is related to the spin density (cm-3) via  \n[14]  \nssB\ndipolar\npp NNgB\n21\n2\n101.8\n9\n4 −×==∆ µπ  .      (1) \nUsing the measured value of Ns determined for this film, Eq. (1) gives a predicted linewidth of \n0.9 mT. This is slightly lower than the measured value of 1.4 mT but indicates that the principal \nsource of broadening in this film is most likely to be dipolar broadening. At higher biases the \nspin density gradually increases but there is a significant reduction in the observed linewidth. \nThis is clearly in contrast to what would be predicted from Eq. (1) and indicates that another \nmechanism is also present, which is narrowing the linewidth. The decrease in linewidth with \nincrease in self-bias, for voltages above –100 V bias, has been reported previously [10] and was \nattributed to motional effects. We believe that motional effects arising from exchange or rapid \nelectron hopping between sp2 clusters of increasing size are also occurring in these films. This is \nconsistent with the narrowing of the Tauc gap since the size of the gap is related to the size of the \ncluster. [8,15] The presence of these motional effects can also be used to explain the similarity of \nthe threshold fields measured for the samples deposited at the higher biases. All these films will \nhave a high sp2 content, and the consequent overlap of the clusters will result in electron \n 4\nAppl. Phys. Lett. 77, (2000) 2006\n delocalisation and\/or enhanced hopping between the clusters. We regard this as an effective \nimprovement in the connectivity between the clusters. Application of an external electric field \nresults in extraction of electrons from the film surface. Replenishment of the emitted electrons to \nthe surface layer is easily accomplished due to the good connectivity between the clusters. \nEmission from these high sp2 rich films would be characterized as a “front surface” type \nemission and since the sp2 clusters are located at or about EF they would be expected to yield a \npeak in the field electron energy distribution (FEED) at EF with a low energy cut off tail. Such a \nFEED characteristic has been observed in the high N (approximately 17 at. %) containing a-\nC:H:N films examined by Gröning et al. [16].  \nReducing the self bias to –90 V results in a reduction in the spin density by about two \norders of magnitude and  a rapid rise in the Tauc gap and shows that major structural changes in \nthe film are occurring. At low self biases a low concentration of small isolated sp2 clusters form.  \nInitially, the number of C atoms in each cluster is small (as inferred from the large Tauc gap) but \nthe greater energy available at higher biases allows the formation of a greater number of larger, \nbut still isolated, clusters. This results in a reduction of the Tauc gap and an increase in Ns, \nthough the electron delocalisation in the cluster and\/or hopping between clusters is kept to a \nminimum. This leads to poor connectivity between the clusters and results in films which needs a \nhigher applied electric field for the onset of emission and explains why Eth is higher at –90 V \nbias when compared with the films deposited the higher biases. The subsequent drop in Eth for \nthe film at the lowest bias voltages indicates that another emission mechanism is also present. \nThis additional mechanism is brought about by the presence of the high internal electric field (up \nto 20 V\/µm) at the a-C:H\/Si interface which produces ‘hot’ electrons from the Si conduction \nband. [4,5] The low concentration of the more conductive sp2 clusters is unable to screen the \nfield at the front surface.  In this way emission, from these low bias deposited films would be \nmore correctly described as being determined by “the back contact” rather than the “front \nsurface”. \n 5\nAppl. Phys. Lett. 77, (2000) 2006\n In order to demonstrate that it is the size of the cluster that is still important in \ndetermining the emission mechanism rather than the absolute concentration of the clusters we \nhave made measurements of the threshold field and spin density as a function of N content in the \nlow defect polymeric films. Addition of N has been shown previously to reduce the threshold \nfield in diamond-like carbon (DLC) films [4] and also in ta-C films [17]. However, in both of \nthese types of films there has been a reduction in the spin density and this was partly attributed to \npassivation of defects. [4,17] It can be seen from Fig. 3 (a) that Eth drops with addition of N \nsimilar to that reported elsewhere [4,16]  but in contrast to the DLC films of Silva et al., [18] no \nreduction in Ns is observed (Fig 3 (b)). The reduction in Ns in the DLC films was attributed to \nthe passivation of defects as evidenced by the initial increase in the Tauc gap followed by a \nsubsequent decrease. [17]  In the polymeric films the continued decrease in the Tauc gap without \nan increase in the spin density indicates that the number of sp2 clusters remains the same but that \nthe cluster size in increasing. Therefore, we attribute the lowering of the threshold field with \naddition of N to an increase in the cluster size.  \nWe believe that the field emission from a-C:H film can be explained in terms of the \nnumber and size of sp2 clusters lying at or near the Fermi level and that it is important that the \ncluster be large enough for efficient connectivity between clusters. In this way the a-C:H films \ndeposited under different conditions will consist of a matrix of sp3 C with regions of varying sp2 \ncluster concentration and size. Since these clusters will have dielectric constants, the application \nof the external field will result in local field enhancement around the clusters and will aid in the \nemission of electrons. A similar conclusion concerning the importance of the size of the sp2 \ncluster has also been reached by Ilie et al. [11] based upon a correlation between the measured \nvalues of threshold fields for various type of amorphous carbon films with the behaviour of the \nintensity of the ID to IG peaks measured using Raman spectroscopy [11]. They determined that \nthe optimal size of the clusters for emission  to be 1.5-2 nm depending on the specific type of \nfilm investigated.  \n 6\nAppl. Phys. Lett. 77, (2000) 2006\n  In conclusion, by using a combination of field emission, EPR, and optical measurements \nwe have shown that the threshold field depends on the size and concentration of sp2 C clusters. \nFilms deposited at high self-biases which have a good connectivity between the clusters and \nexhibit the lowest threshold fields. Such films would be characterised as “front surface emitters”. \nFilms with a comparable spin density but with poorer connectivity show higher threshold fields \nsince the sp2 cluster is not large enough. The films deposited at the low biases having low sp2 \ncontent (low spin density) have lower threshold field by virtue of the good field penetration and \nthe presence of a high internal electric field at the rear contact.  \n \nThis work has been sponsored by the EPSRC no. GR\/L77638.  The authors would like to thank \nDr. R. Barklie and Dr. M. Collins from the Department of Physics, Trinity College, Dublin. \naccess and assistance in making some of the EPR measurements. \n \n \n \n \n \n \n   \n \n \n \n \n \n \n \n \n 7\nAppl. Phys. Lett. 77, (2000) 2006\n References \n \n \n1   See, for example, Amorphous Carbon: State of the Art, Proceedings of the First International \nspecialist meeting on amorphous carbon. Ed. S.R.P Silva, J. Robertson, W.I. Milne, and \nG.A.J. Amaratunga, (World Scientific, Singapore, 1998). \n2  J. E. Jaskie, MRS Bulletin, 21, 59 (1996). \n3  J. Robertson, J. Vac. Sci. Technol. B 17, 659 (1999). \n4  G.A.J. Amaratunga and S.R.P. Silva, Appl. Phys. Lett. 68, 2529 (1996).   \n5  R.D. Forrest, A. P Burden, S.R.P. Silva, L. K. Cheah,  and X. Shi, Appl. Phys. Lett. 73, \n3784 (1998).  \n6      X. Shi, L.K. Cheah, B.K. Tay, and  S. R. P. Silva,  Appl. Phys. Lett. 74,  833  (1999). \n7      L. Zhang, T. Sakai, N. Sakuma, T. Ono, and K. Nakayama, Appl. Phys. Lett. 75, 3527 \n(1999).  \n8      J. Robertson and E. P. O’Reilly,  Phys. Rev. B, 35, 2946 (1987);  J. Robertson,  Diamond. \nRelat. Mater. 4, 297  (1995) \n9       J. V. Anguita, S. R. P. Silva, A. P. Burden, B. J. Sealy, S. Haq, M. Hebbron, I. Sturland,    \nand A. Pritchard, J. Appl. Phys. 86, 6276 (1999). \n10    R.C. Barklie, M. Collins, and  S.R.P. Silva, Phys. Rev. B 61, 3546 (2000).   \n11    A. llie, A. C. Ferrari, T. Yagi, and J. Robertson,  Appl. Phys. Lett. 76, 2627 (2000). \n12    N. P. Barradas, R. U. A. Khan, J. V. Anguita, S. R. P. Silva, U. Kreissig, R. Grötzschel,  \nand W. Möller, Nucl. Instrum. Methods B 161-163, 969 (2000). \n13    M. Collins, R.C. Barklie, J.V. Anguita, J.D. Carey, and S.R.P. Silva, Diamond Relat.  \nMater. 9, 781 (2000). \n14     A. Abragam, Principles of Magnetic Resonance (Clarendon Press, Oxford, 1996), p. 126. \n15 D. Dasgupta, F. Demichelis and A. Tagliaferro, Phil. Mag, B 63,  1255 (1991). \n16    O. Gröning, O. M. Küttel, P. Gröning, and L. Schlapbach, Appl. Phys. Lett. 71, 2253  \n(1997).  \n 8\nAppl. Phys. Lett. 77, (2000) 2006\n  \n \n17      L.K. Cheah, X. Shi, E. Liu, and K. Tay, J. Appl. Phys. 85,  6816  (1999). \n18     S.R.P. Silva, J. Robertson, G.A. J. Amaratunaga, B. Rafferty, L.M. Brown, J. Schwan, D.F. \nFranceschini, and G. Mariotto, J. Appl. Phys. 81, 2626 (1997).  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 9\nAppl. Phys. Lett. 77, (2000) 2006\n  \n \n \nFigure captions \n \nFigure 1. Variation of (a) threshold electric field and (b) spin density as a function of negative \nself bias during deposition. \n \nFigure 2. Variation of (a) Tauc optical gap (b) peak-to-peak linewidth as a function of negative \ndc self bias during deposition.   \n \n \nFigure 3.  Variation of (a) threshold field, (b) spin density and (c) Tauc gap as a function of N \ncontent for polymeric a-C:H:N films. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 10\nAppl. Phys. Lett. 77, (2000) 2006\n  \n \n10\n15\n20\n25\n30\n50 100 150 200 250\nTh\nre\nsh\nol\nd \nfie\nld\n (V\n\/µm\n)\n1017\n1018\n1019\n1020\n1021\n50 100 150 200 250\n(b)\n(a)\nNegative self bias (V)\nSp\nin\n d\nen\nsi\nty\n (c\nm\n-3\n)\n \n \n \n \n \n \n \nFig. 1                    Carey et al.  \n 11\nAppl. Phys. Lett. 77, (2000) 2006\n  \n \n \n \n1.0\n1.5\n2.0\n2.5\n3.0\n50 100 150 200 250\nTa\nuc\n g\nap\n (e\nV)\n0.6\n0.8\n1.0\n1.2\n1.4\n50 100 150 200 250\n(b)\n(a)\nNegative self bias (V)\nLi\nne\nw\nid\nth\n (m\nT)\n \n \n \n \nFig. 2                    Carey et al.  \n \n 12\nAppl. Phys. Lett. 77, (2000) 2006\n"}