{"doi":"10.1007\/s10665-005-9029-7","coreId":"96668","oai":"oai:generic.eprints.org:222\/core69","identifiers":["oai:generic.eprints.org:222\/core69","10.1007\/s10665-005-9029-7"],"title":"The transfer of fibres in the carding machine","authors":["Lee, M. E. M.","Ockendon, H."],"enrichments":{"references":[{"id":700839,"title":"A continuum model for entangled fibres.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":703564,"title":"A new aspect of the stochastic nature of carding.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":702853,"title":"A Treatise on the Mathematical Theory of Elasticity, 4th edn. Cambridge:","authors":[],"date":"1927","doi":null,"raw":null,"cites":null},{"id":701812,"title":"Aerodynamics and fibre transfer at the cylinder-doffer interface.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":700635,"title":"An assessment of changes in the state of fibre mass during the early stages of the carding process.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":701982,"title":"Analysis of the swimming of long and narrow animals.","authors":[],"date":"1952","doi":null,"raw":null,"cites":null},{"id":701622,"title":"Fibre dynamics in the revolvingflats card, part 1, a critical review.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":703348,"title":"Fluid motion for car undertrays in ground effect.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":704176,"title":"Mathematical modeling and simulation for carding. Textile Res.","authors":[],"date":"1994","doi":"10.1177\/004051759406401004","raw":null,"cites":null},{"id":703729,"title":"Modeling and simulation for control carding. Textile Res.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":704375,"title":"Modeling the diffusive transport of bulk fiber mass in a card. Textile Res.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":702621,"title":"Physical Properties of Textile Fibres.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":702397,"title":"Slender-body theory for particles of arbitrary cross-section in stokes flow.","authors":[],"date":"1970","doi":null,"raw":null,"cites":null},{"id":703078,"title":"The distortion of a flexible inextensible thread in a shearing flow.","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":701412,"title":"The load of the surfaces and the proportion of fibre transferred between the surfaces.","authors":[],"date":"1964","doi":null,"raw":null,"cites":null},{"id":702194,"title":"The motion of long slender bodies in a viscous fluid part 1. General theory.","authors":[],"date":"1970","doi":null,"raw":null,"cites":null},{"id":701229,"title":"Towards understanding the internal forces in a tuft of fibres.","authors":[],"date":null,"doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"The problem of understanding the transfer of fibres between carding-machine surfaces is addressed by considering the movement of a single fibre in an airflow. The structure of the aerodynamic flow field predicts how and when fibres migrate between the different process surfaces. In the case of a revolving-flats carding machine the theory predicts a “strong” aerodynamic mechanism between taker-in and cylinder and a “weak” mechanism between cylinder and removal cylinder resulting in effective transfer in the first case and a more limited transfer in the second","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96668.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/222\/1\/fibres.pdf","pdfHashValue":"ec8fc869c2fb493f11cd4822f73b52c8256b3ba3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:222<\/identifier><datestamp>\n      2015-05-29T18:18:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3736<\/setSpec><setSpec>\n      7375626A656374733D484E:4D3730<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/222\/<\/dc:relation><dc:title>\n        The transfer of fibres in the carding machine<\/dc:title><dc:creator>\n        Lee, M. E. M.<\/dc:creator><dc:creator>\n        Ockendon, H.<\/dc:creator><dc:subject>\n        Fluid mechanics<\/dc:subject><dc:subject>\n        Mechanics of particles and systems<\/dc:subject><dc:description>\n        The problem of understanding the transfer of fibres between carding-machine surfaces is addressed by considering the movement of a single fibre in an airflow. The structure of the aerodynamic flow field predicts how and when fibres migrate between the different process surfaces. In the case of a revolving-flats carding machine the theory predicts a “strong” aerodynamic mechanism between taker-in and cylinder and a “weak” mechanism between cylinder and removal cylinder resulting in effective transfer in the first case and a more limited transfer in the second.<\/dc:description><dc:date>\n        2006<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/222\/1\/fibres.pdf<\/dc:identifier><dc:identifier>\n          Lee, M. E. M. and Ockendon, H.  (2006) The transfer of fibres in the carding machine.  Journal of Engineering Mathematics .        <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10665-005-9029-7<\/dc:relation><dc:relation>\n        10.1007\/s10665-005-9029-7<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/222\/","http:\/\/dx.doi.org\/10.1007\/s10665-005-9029-7","10.1007\/s10665-005-9029-7"],"year":2006,"topics":["Fluid mechanics","Mechanics of particles and systems"],"subject":["Article","PeerReviewed"],"fullText":"DOI 10.1007\/s10665-005-9029-7\nJournal of Engineering Mathematics (2006) © Springer 2006\nThe transfer of fibres in the carding machine\nM.E.M. LEE1,∗ and H. OCKENDON2\n1BP Institute for Multiphase Flow, University of Cambridge, Madingley Road, Cambridge, CB3 0EZ, UK\n(E-mail: michael@bpi.cam.ac.uk); 2OCIAM, Mathematical Institute, 24-29 St. Giles’, Oxford, OX1 3LB, UK\n(E-mail: ockendon@maths.ox.ac.uk)\nReceived 14 February 2005; accepted in revised form 13 December 2005\nAbstract. The problem of understanding the transfer of fibres between carding-machine surfaces is addressed by\nconsidering the movement of a single fibre in an airflow. The structure of the aerodynamic flow field predicts how\nand when fibres migrate between the different process surfaces. In the case of a revolving-flats carding machine\nthe theory predicts a “strong” aerodynamic mechanism between taker-in and cylinder and a “weak” mechanism\nbetween cylinder and removal cylinder resulting in effective transfer in the first case and a more limited transfer\nin the second.\nKey words: carding machine, fibre transport, tethered fibres, transfer mechanism\n1. Introduction\n1.1. BACKGROUND\nThe fundamental operations of yarn manufacture are carding, drawing, twisting and spinning.\nCarding transforms the raw material, such as cotton, wool or polyester fibres, into a smooth\ncoherent web; by disentangling and ordering the fibres and eliminating unwanted materials.\nAlthough manufacturing technology has improved the speed and efficiency of the process, the\nunderlying principles have not changed for over 100 years. Originally the process was done\nby hand but now machines use huge arrays of hooks that tether and tease fibres or tufts at\nspeeds of up to 100m\/s.\nIn modern carding machines, as shown in Figure 1, fibres essentially come into contact\nwith hooks distributed on rapidly rotating cylinders and quasi-stationary flat plates. The first\nof the three cylinders is called the “taker-in”, and this introduces the initially highly tangled\nfibres, labelled the “lap”, into the carding machine. The hooked flat plates, known simply as\n“flats”, adjacent to the largest cylinder, known as the “cylinder”, act to break down and tease\ntufts into individual fibres. This leads to the formation of a smooth coherent web, called the\n“sliver”, by the transferal of individual fibres from the main cylinder to the removal cylinder,\nknown as the “doffer”. In order to produce yarns, a number of further “macroscopic” defor-\nmations are applied to the sliver, such as transverse compression, stretching and twisting, but\nthe physical properties of the resulting yarn depend critically on the formation of cohesive\nstructures during the carding process.\nThere are two regions in a short-staple carding machine where fibres are “stripped” or\ntransferred from one rotating cylinder to another: taker-in to cylinder and cylinder to dof-\nfer. Experience shows that virtually all fibres successfully migrate from taker-in to cylinder\n∗Corresponding author.\nM.E.M. Lee and H. Ockendon\nFigure 1. A diagram of a revolving-flats, short staple, carding machine.\nwhereas there is a less successful migration between cylinder to doffer. The main aim of this\npaper is to propose a mechanism for each transfer which explains this discrepancy.\nThe most obvious difference in the two fibre-transfer regions is the relative speed of the\nadjacent cylinders. Typically on a revolving-flats carding machine, the surface speed of the\ntaker-in is 10m\/s, the cylinder is 35m\/s and the doffer is 1m\/s. The approximate hook heights\non the taker-in and cylinder are 5mm and are spaced at 6 and 15 hooks per square centime-\nter, respectively, whereas the doffer hooks are several times larger, and the gap between the\nhook tips varies but is no more than a few millimeters.\nAlthough, initially many of the fibres are entangled, one can expect to find individual\nfibres throughout the process and by the time the textile has reached the end of the revolving-\nflats the tufts will be broken down into individual fibres; see [1]. Mathematical models for\nteasing entangled textile fibres are presented in [2, 3]. For groups of many entangled fibres,\none would expect the faster cylinder to grab and remove tufts off the taker-in; the hooks on\nthe taker-in are not directed to oppose this motion. However at the doffer, the material must\ntransfer from the faster to the slower cylinder and the hooks on the doffer are, at first sight,\npointing in the wrong direction. A model describing the journey of a single fibre in the card-\ning machine is of particular importance, and the work in this paper goes some way to under-\nstanding this process.\n1.2. OBJECTIVES\nUnderstanding the mechanisms for fibre transfer between carding surfaces, will provide much\nneeded insight into general fibre dynamics during the process, machine design and process-\ncontrol optimisation, and the formation of the sliver. We will model the behaviour of a single\nfibre in the transfer regions of a carding machine, and these results could easily be extended\nto consider many fibres in a dilute suspension.\nThe approach of the work in this paper is in some sense a natural extension of the static\nanalysis completed in [4], which considers frictional forces acting on a single fibre in tension,\nheld by two hooks on opposing carding surfaces. The question this paper attempts to answer\nis: “When does this scenario occur and, in particular, how are fibres that are tethered to a\nhook on one carding surface presented to the hooks on another carding surface?”\nA dimensional analysis shows that the dominant forces acting on a fibre are due to aero-\ndynamic drag, which is contrary to current theories that suggest a centrifugal-force-driven\nThe transfer of fibres in the carding machine\ntransfer (a review of these is presented in [5]). The aerodynamics in the carding machine\ninvolves complicated high-Reynolds-number flows generated by rapidly rotating, hooked\ncylinders, which are certainly turbulent in some regions. High-speed photographic observa-\ntions near the doffer and cylinder, just after the transfer region, are presented in [6], and the\nexperimental findings suggest that the flow is unsteady and probably turbulent. However, we\nwill use a global inviscid model that can be considered as either the mean turbulent flow or\nthe outer regime of a laminar boundary-layer flow to predict the aerodynamics in the trans-\nfer regions, which can then be used to determine the dynamics of tethered fibres. Our theory\npredicts two aerodynamic mechanisms that explain why the transfer rates between taker-in to\ncylinder and cylinder to doffer are very different.\n2. Fibre model\nIn this section we derive the forces acting on a single fibre in a given airflow. We consider a\nfibre attached to a hook on a cylinder and take axes fixed in the cylinder as shown in Fig-\nure 2. These axes are rotating with angular velocity Ω and the fibre is tethered at a radial\ndistance of rc. A dimensional analysis of the governing equations allow us to determine the\ndominant mechanisms for fibre transfer. Initially the equations will include effects due to lin-\near and rotational acceleration of the fibre, drag and elasticity of the fibre.\nShort wool, polyester and cotton are typical textiles that are carded in revolving-flats\nmachines. They share a number of physical characteristics, the most obvious being that they\nall have small aspect ratios, \u0001= al \u00021, where a is the average diameter and l the average length\nof a fibre; polyester fibres are typically 6micron in diameter and 4 cm in length. Therefore,\nwe can approximate a fibre by its centre-line R(s, t)= (x(s, t), y(s, t), z(s, t))T , using s for arc\nlength along the fibre and t for time. The coordinates (x, y, z) represent a local frame of ref-\nerence for a fibre attached to one of the cylinders, where R(0, t)=0 is the point at which the\nfibre is tethered by a hook.\n2.1. DRAG ON A FIBRE\nOur approach assumes that the fibres are in a dilute suspension; this means that the presence\nand dynamics of the fibres do not affect the fluid flow. The air velocity U is given relative to\nthe fibre velocity and due to axial symmetry we assume that the flow is two-dimensional.\nFigure 2. A diagram of a fibre tethered by a hook on a rotating cylinder.\nM.E.M. Lee and H. Ockendon\nThe drag on a variety of different types of fibres were studied by Taylor [7]. This\nsemi-empirical work measured the force acting on a fibre set obliquely to a stream of fluid,\nwhere the Reynolds numbers varied between 20 and 106. A range of drag laws are postulated\nfor different fibre surfaces, such as smooth, rough and hairy. In practice the Reynolds number\n(Re= Ua\nν\n) for flow around a fibre in the carding machine can vary by three orders of magni-\ntude, usually in the range 12 to 10\n2.\nWe define local orthonormal vectors for each point of a fibre with respect to the centre-line\nto be (d1, d3), where d1 is normal and is in the cross-sectional plane and d3 is the tangent; see\nFigure 2. Using φ(s, t) to represent the angle between the fibre’s tangent and the fluid-stream\ndirection, Taylor postulates that the drag term D per unit length for a hairy or bobbly surface,\nwhen Re\u00031, is\nD = cF ρairaU\n2\n2\n(− sinφ d1 + cosφ d3) , (1)\nwhere |U |=U , φ∈[0, π2 ), ρair is the density of air and cF is a parameter that is related to the\nspecific surface properties and without loss of generality we will assume to be unity. Other\ndrag laws for smooth and rough fibres in [7] involve nonlinear terms in sinφ.\nAlternatively, for Re\u00021 we can apply classical Stokes flow in the neighbourhood of a fibre\nand the drag to leading order in \u0001 for a smooth fibre is shown in [8] to be\nD = 2πµU\nlog 2\n\u0001\n(−2 sinφ d1 + cosφ d3) , (2)\nand µ is the viscosity of air. A number of other effects may also be considered from vari-\nous analytical studies of slow flow past nematic objects, such as small deviations in surface\ngeometry [9] and the effect of hydrodynamic interactions with other fibres [8].\nTo conclude, we see that the form of the drag term is similar in either case. On the taker-in\nRe≈O (10) and so we use the empirical approximation (1), whereas on the doffer the Rey-\nnolds number is O(1) so it is appropriate to use the Stokes drag given by (2). It turns out\nthat the mechanism for transfer is not at all sensitive to which drag law is selected.\n2.2. INTERNAL FIBRE FORCES\nMost fibres are not straight and even man-made fibres are deliberately crimped in order to\nproduce more cohesive yarns. Although most textile fibres have bending moduli of the same\norder of magnitude, their natural shapes can vary considerably; see [10, Chapters 1 and 17].\nFor natural fibres a distribution of shapes occur due to the conditions during their formation\nwhereas the uniform crimp in man-made fibres is regulated by machinery. Thus each fibre will\nhave a natural curvature and given cross-sectional area. We begin by treating our fibre as a\nflexible, inextensible, circular, elastic rod and use Kirchhoff’s equations to model its deforma-\ntion [11, Chapter XVIII]. We write down the geometrical relationship, that the fibre tangent\nis normal to the cross-sectional plane,\n∂ R\n∂s\n= d3. (3)\nWe define the stress resultant vector N(s, t) and the couple resultant vector M(s, t) to be\nN(s, t)=\n3∑\ni=1\nNi (s, t)di (s, t), M(s, t)=\n3∑\ni=1\nMi (s, t)di (s, t), (4)\nThe transfer of fibres in the carding machine\nwhere N1 and N2 are the shear forces and M1 and M2 are the bending moments along the\nprincipal axes of the cross-sectional plane, while N3 is the tensile force and M3 is the twisting\nmoment. Balancing forces and couples at each cross section in a rotating frame, with angular\nvelocity Ω=Ωk, gives\n∂ N\n∂s\n+ D = Aρ\n(\n∂2 R\n∂t2\n+2Ω∧ ∂ R\n∂t\n+Ω∧ (Ω∧ (R + rc j))\n)\n, (5)\n∂ M\n∂s\n+ ∂ R\n∂s\n∧ N =ρ I\n2∑\ni=1\n(\n∂2di\n∂t2\n+2Ω∧ ∂di\n∂t\n+Ω∧ (Ω∧ di )\n)\n∧ di , (6)\nwhere I is the coefficient of inertia, A is the cross-sectional area, and ρ is the density of the\nfibre. To complete the Equations (4)–(6) we use the Euler–Bernoulli constitutive law, which\nrelates moments linearly with components of curvature (i.e., the rotational strain):\nM = E I (κ1d1 +κ2d2)+ G Jκ3d3; (7)\nhere E is the Young’s modulus, G is the shear modulus, J is the polar moment of inertia, and\nthe κi ’s are the components of curvature. Equation (7) holds for a naturally straight rod; if\na fibre is not uniformly straight, we need to interpret κi in (7) as the variations in curvature\nfrom the natural state.\nIn order to capture the important terms, we derive a dimensionless form to equations (5)–\n(6). Appropriate scalings for each variable are:\ns = ls¯, R = l R¯, κi = κ¯il , t =\nl\nΩrc\nt¯,\nD = D D¯, N = l D N¯, M = E I\nl\nM¯,\nwhere the dimensionless quantities are denoted by an over-bar. The typical body force D rep-\nresents the magnitude of the drag terms D, which for Taylor drag will be ρairar2c Ω2\/2 and for\nslow flow 2πµrcΩ\/log 2\u0001 as discussed in Section 2.1. Equations (5) and (6) become\n∂ N¯\n∂ s¯\n+ D¯ =\b1\n(\n∂2 R¯\n∂ t¯2\n+ δk ∧ ∂ R¯\n∂ t¯\n+ δk ∧ (k ∧ (δ R¯ + j))\n)\n, (8)\n∂ M¯\n∂ s¯\n+\b2 ∂ R¯\n∂ s¯\n∧ N¯ =\b3\n2∑\ni=1\n(\n∂2di\n∂ t¯2\n+ δ2k ∧ (k ∧ di )+ δk ∧ ∂di\n∂ t¯\n)\n∧ di , (9)\nrespectively, where we have assumed that the wavelength of the crimp is comparable to the\nlength of the fibre. This results in three important parameters:\n\b1 = ρ AΩ\n2r2c\nl D\n, \b2 = l\n3D\nE I\n, \b3 = ρΩ\n2r2c\nl E\n, δ = l\nrc\n, (10)\nwhere \b1 represents fibre acceleration over drag, \b2 is drag over flexural rigidity, \b3 is the\ntorque over elastic modulus and δ is the ratio of fibre length to cylinder radius. Since δ is\nalways small, the additional terms in Equation (8), due to Coriolis and centrifugal accelera-\ntions, are small and we will ignore them from now on.\nThe above analysis leaves us with a number of parameters that will indicate the dominant\nmechanisms of fibre transport and will allow us to simplify the models accordingly. On both\nthe taker-in and cylinder \b2 \u0003 1 and \b3 \u0002 1, and this suggests that in (9), the rotational\nM.E.M. Lee and H. Ockendon\nacceleration can be neglected and the fibre’s elastic properties cannot compete with the drag\ninduced by the fluid flow. Therefore the textile can be modelled as a string. Now \b1 varies\nbetween O(10−1) and O(1), so we regard it as small for the purpose of providing a simple\nillustration and proceed with a quasi-steady approximation. Since the Re= O(10) based on\nthe surface speeds of the cylinder or taker-in, we will also use the Taylor drag (1) in the fol-\nlowing analysis. As explained above, the results are qualitatively the same if we use alternative\ndrag law (2).\n2.3. EQUATION FOR A QUASI-STEADY TETHERED STRING\nWe now focus our attention on two-dimensional quasi-steady simulations with Taylor drag,\nas this could represent fibre dynamics on the taker-in and cylinder. The governing equations\nfor deformations in an elastica, (8) and (9), where we now remove the over-bars, and neglect\nsmaller quantities, reduce to\n∂ N\n∂s\n+ D =0, (11)\n∂ R\n∂s\n∧ N =0. (12)\nEquation (12) implies that the stress resultant only has components in the direction of the\ntangent and we write N3 = T so that N = T (s, t)d3. We use the inextensibility constraint to\nclose the system of equations:\nd3 · d3 =1. (13)\nThe fibre equations incorporate a general fluid velocity U = (u, v), and\nφ(s)= θ(s)−arctan\n(u\nv\n)\n, (14)\nwhere θ is the angle between fibre tangent and the cylinder surface (see Figure 2). The dimen-\nsionless governing equations (11) now read:\ndT\nds\n+ (u2 +v2) cosφ =0, (15)\nT\ndθ\nds\n− sgn(φ)(u2 +v2) sinφ =0, (16)\ndx\nds\n− cos θ =0, (17)\ndy\nds\n− sin θ =0. (18)\nIt remains to apply boundary conditions, and we use the fact that the fibre is free at the non-\ntethered end s =1 and fixed geometrically at the other end s =0,\nT (1)=0, x(0)=0, y(0)=0. (19)\nThe angle of the free end θ(1) needs to be found by solving the equation\nsinφ(1)=0, (20)\nwhich is due to the no-tension condition from (19) that would otherwise cause a singularity in\n(16). This leaves us with a fourth-order system of coupled ordinary equations (15)–(18) with\nfour boundary conditions (19) and (20) to determine the position of a given fibre in a given\nflow (u, v).\nThe transfer of fibres in the carding machine\n3. Aerodynamics\nWe now turn our attention to the fluid flow. The Reynolds numbers of fluid flow in the\nmachine vary from O(104) and O(106) and so we expect it to be turbulent. This can be mod-\nelled by an inviscid mean flow when the Reynolds stresses are small. If the flow is laminar,\nan inviscid approximation will also be adequate, except when close to the machine surfaces.\nWe do not attempt to model the effect of the hooks but one expects that they act as vortex\ngenerators and would encourage turbulent behaviour.\nTo elucidate the basic flow structure we consider a simple two-dimensional incompress-\nible, irrotational and inviscid flow. Transfer occurs in regions between two cylinders, c+ and\nc−, of radius r+ and r− counter-rotating with angular velocities Ω+ and Ω− in close proxim-\nity to each other; see Figure 3. We prescribe no-penetration conditions and circulations \u000b+\nand \u000b− around each drum. This is equivalent to placing a point vortex within each cylinder.\nNote that a cylinder, of radius r , rotating in an infinite fluid at high-Reynolds-number flow\nwill eventually create a circulation \u000b= 2πr2Ω when rotating at angular velocity Ω and thus\n\u000b− =2πΩ−r2− and \u000b+ =2πΩ+r2+ are plausible values to take.\nThere are a number possible flow topologies that can occur as a consequence of variations\nin the circulations \u000b+ and \u000b−. However, in the case of the carding machine, the larger cylin-\nder c+ is moving considerably faster than the smaller one c− and so drives a rotational flow\nround both doffer and taker-in; the magnitude of \u000b+ will be much greater than the magni-\ntude of \u000b−. However, the counter-rotation of c− affects the flow in the gap between the cylin-\nders. This situation is illustrated in Figure 3, with two stagnation points on the smaller, slower\ncylinder. The large cylinder will entrain fluid, some of which will be ejected onto the smaller\ncylinder, when approaching the nip-regions between the drums. We postulate that the airflow\nnear the stagnation points is the critical area for fibre transport and different fibre-transfer\nmechanisms occur in going from the large and fast cylinder to a smaller slower cylinder or\nvice versa as described in the next two sections.\nThe flow illustrated in Figure 3 is a gross simplification and in reality will be modified by\nboundary-layer effects, the effect of the hooks and the presence of other machine surfaces, but\nthe changes in the mean flow direction near a stagnation point will still occur and this is the\nmechanism that we need to effect transfer of fibres from one cylinder to another.\nFigure 3. The flow topology for two neighbouring counter-rotating cylinders. The gap width between the cylinders\nis greatly exaggerated in this figure to allow the basic flow structure to be clearly illustrated.\nM.E.M. Lee and H. Ockendon\n4. Strong transfer\nWe use the term “strong transfer” to describe the process that occurs in going from the taker-\nin to the cylinder. In this section we describe a theoretical scenario that shows how single\nfibres will transfer, due to aerodynamic forces, without being in simultaneous contact with\nhooks on the taker-in and cylinder. This means that the transfer mechanism is purely aero-\ndynamic and does not involve the cylinder and taker-in hook competition described by [4].\nWe consider the flow near the taker-in as a fibre is transported into the stagnation region,\nand assume that the flow is of the type illustrated in Figure 3, where two stagnation points\nreside on the taker-in. Figure 4(a) illustrates the flow near the stagnation points on the taker-\nin; both surfaces move from right to left in the diagram but the cylinder moves at greater\nvelocity. We use a simplified flow containing two stagnation points in order to see how a fibre\nconnected to a hook on the taker-in is affected by this type of flow. First, we introduce global\ncoordinates (X ,Y ) where the stagnation points are placed at X = ±a on an infinite plate at\nY = 0; see 4(b). The complex potential for a particular flow field containing two stagnation\npoints on y =0 is w(z)= A0\n(\nz3\n3 − za2\n)\n, with components of velocity\nu = A0(X2 −Y 2 −a2), v =−2A0XY, (21)\nand the streamlines are also illustrated in Figure 4(b). This flow is used to simulate the\nmotion of the fibre shown in Figure 5 using the quasi-steady model (15)–(20). The point at\nwhich the fibre is tethered R(s = 0) = (X,YT ), moves from right to left, so X decreases for\nsome fixed YT .\nAs a fibre moves from the right to the first stagnation point at X = a, its displacement\nwill not alter significantly nor will the aerodynamic forces lift the fibre away from the taker-in\n(a)\n(b)\nFigure 4. Flow for strong transfer. (a) Schematic diagram of the strong transfer region. (b) Stagnation flow stream-\nlines.\n(a) (b)\n–\n–\n–\n–\n–\n–\nFigure 5. Strong transfer for stagnation point flow where a = ±1; the tethered point YT moves from right to left,\nx(0)= X decreasing from 1·5 to 0·5 and passes through the stagnation streamline near X =1. (a) Fibre angle at s =0\n(b) Fibre tension at s =0.\nThe transfer of fibres in the carding machine\nsurface. As the fibre moves past the stagnation streamline at X ≈a, the fluid begins to drag\nthe fibre towards the cylinder surface. At this point in time the tethered angle θ(0) decreases\nmore dramatically and the tension T (0) tends to zero, making it more likely that the fibre-\nhook contact point will slip and the fibre will free itself from the hook altogether; see Figure\n5. The fibre when free will be transported away from the surface at Y =0 and will migrate to\nthe cylinder, since in the case of negligible inertia it is known that a fibre will rapidly align\nwith the flow [12].\n5. Weak transfer\nA weaker transfer occurs between the cylinder and doffer. The build-up of fibres on the cyl-\ninder has been studied in some detail, and it is observed that only a small proportion of the\nfibres on the cylinder are transferred from the cylinder to the doffer; see [5]. Although the\nflow regime is again assumed to be of the type illustrated in Figure 3, this time the fibres are\non the cylinder while the stagnation points are on the doffer as shown in Figure 6(a). Note\nthat the direction of the cylinder has been reversed for ease of comparison with the strong\ntransfer mechanism. When a fibre is transported from right to left along the X -axis, the trail-\ning ends of the tethered fibres will be dragged towards the doffer by the upward flow. The\nmaximum altitude of the trailing end, depends on the locality of the neighbouring surface Y =\nhp and height of the tethered point y(0)=YT .\nTo illustrate this process, we calculate the position of a fibre tethered by hooks on the cyl-\ninder as it moves toward the doffer on which two stagnation points reside. We have chosen\nto use a stagnation point flow with a fixed semi-infinite plate at Y = hp and a parallel infi-\nnite plate at Y =0, see diagram 6(b), as we are interested in the first stagnation point of the\nflow because it is in this region the airflow will lift the fibre toward the adjacent surface. The\ninfinite lower plate represents the surface of the cylinder. If the high-Reynolds-number flow is\nlaminar, the leading-edge region is predominantly governed by Euler’s equations which match\nonto boundary layers on both plates. We will use an inviscid solution given by [13] for the\nflow and then solve Equations (14)–(20) for an inextensible fibre.\nIn Figure 7, we show quasi-steady animations of a fibre that moves underneath the stag-\nnation point. We note that the hooks on the doffer will typically occupy the majority of the\nregion 0<Y <h p, and so in both cases shown there will be a good chance of interaction with\nthe doffer hooks. It is not the case that all fibres that are presented will actually make contact\nwith a hook, and to compute the likelihood of interaction one would need to consider the\nvolume fraction of doffer hooks in the stagnation region. Once the fibres come into contact\nwith a doffer hook, there will be a competition between the frictional properties of the doffer\nand cylinder hooks and this, along with the way the fibre is presented to the doffer hook, the\n(a)\n(b)\nFigure 6. Flow for weak transfer. (a) Schematic diagram of the weak-transfer region. (b) Streamlines for parallel\ninfinite and semi-infinite plates set at a distance hp =0·5 apart.\nM.E.M. Lee and H. Ockendon\n(a) (b)\nFigure 7. Displacements of a fibre attached at height YT = 0·1 as it moves from the right towards the stagnation\npoint B. Figure (b) includes the hooks to which the fibres are tethered.\nchanging angle of attachment θ(0) to the cylinder hook and the hook geometries will deter-\nmine when transfer occurs. In the case of weak transfer, the static competition described by\n[4] will then be appropriate to complete the transfer model.\n6. Conclusion\nWe have postulated a theory of how individual fibres behave in the carding machine. In a sim-\nple dimensionless analysis, we eliminated the possibility of centrifugally driven transfer the-\nories, and highlighted the importance of aerodynamics within the carding process. Looking\nat the mean airflow, stagnation-point flows occur in the transfer regions between cylinders in\nthe carding machine. These produce two very different transfer mechanisms near the leading\nstagnation point: the strong mechanism occurs between taker-in and cylinder where all fibres\nmigrate to the cylinder surface as the tension holding the fibre to the hook decreases to zero\nand the weak mechanism between cylinder and doffer where only a proportion of fibres trans-\nfer to the doffer by slipping off one set of hooks and being caught or held by the other.\nThe experimental observations in [6] provide some evidence that supports our aerodynam-\nically driven transfer mechanisms described above. Their observations focussed on the region\nbetween doffer and cylinder, just after the point where fibres transfer from cylinder to doffer.\nThis coincides with the region close to the second stagnation point in Figure 6(a). Figures\n11, 12 and 14 in [6] show fibres that have already transferred from cylinder to doffer, being\nentrained by the fluid away from the doffer surface back towards the cylinder. As the fibres\nare tethered to the doffer, a surface upon which stagnation points reside, the local fluid flow\nrelative to the fibre will be similar to the strong-transfer-mechanism aerodynamics depicted in\nFigure 4, in particular the region close to the left stagnation point. The reason why there is\nfar greater retention of fibres on the doffer, when compared to similar fluid-entrained dynam-\nics on the taker-in, is the hook size and more importantly the angle; see Figure 1; the doffer\nhooks oppose the fibre motion away from the doffer surface.\nThe “micro-scale” work in this paper could be used to complement carding-machine models\nthat employ “macroscopic” variables such as fibre density, and assume probabilistic transfer\nrates between carding surfaces, such as [14–17]. The “macroscopic” parameters within these\nmodels are chosen by comparison with experimental data. By using the simulations and models\nexplored in this paper, we could relate the large-scale model parameters to hook geometry and\ndensity, fibre-hook friction, fibre length, cylinder geometry and linear surface speeds.\nAcknowledgements\nWe wish to express our gratitude to the EPSRC (Grant GR\/L62153) and Crosrol Ltd. who\nfunded the interdisciplinary project through which this research was undertaken. We are\nThe transfer of fibres in the carding machine\nalso grateful to Prof C. Lawrence, Dr. Abbas, Mr. B. Greenwood, Dr. C. Iype and Dr. M.\nMahmoudi of the Department of Textile Industries at Leeds University and Dr. M. Jones of\nthe School of Mathematics, University of Southampton for many useful discussions.\nReferences\n1. A. Dehghani, C.A. Lawrence, M. Mahmoudi, B. Greenwood and C. Iype, An assessment of changes in the\nstate of fibre mass during the early stages of the carding process. J. Textile Inst. 91 (2000) 359–373.\n2. M.E.M. Lee and H. Ockendon, A continuum model for entangled fibres. Eur. J. Appl. Math. 16 (2005) 145–160.\n3. G. Kozyreff, M.E.M. Lee and H. Ockendon, Towards understanding the internal forces in a tuft of fibres.\nSubmitted.\n4. Y.A. Baturin, The load of the surfaces and the proportion of fibre transferred between the surfaces. Technol.\nTextile Industry, U.S.S.R. 4 (1964) 37–43.\n5. C.A. Lawrence, A. Dehghani, M. Mahmoudi, B. Greenwood and C. Iype, Fibre dynamics in the revolving-\nflats card, part 1, a critical review. AUTEX Res. J. 1 (2000) 64–77.\n6. A. Dehghani, C.A. Lawrence, M. Mahmoudi, B. Greenwood and C. Iype, Aerodynamics and fibre transfer\nat the cylinder-doffer interface. J. Textile Inst. 95 (2004) 35–49.\n7. G.I. Taylor, Analysis of the swimming of long and narrow animals. Proc. R. Soc. London A 214 (1952)\n158–183.\n8. R.G. Cox, The motion of long slender bodies in a viscous fluid part 1. General theory. J. Fluid Mech. 44\n(1970) 791–810.\n9. G.K. Batchelor, Slender-body theory for particles of arbitrary cross-section in stokes flow. J. Fluid Mech. 44\n(1970) 419–440.\n10. W.E. Morton and J.W.S. Hearle, Physical Properties of Textile Fibres. London: William Heinemann (1975)\n660 pp.\n11. A.E.H. Love, A Treatise on the Mathematical Theory of Elasticity, 4th edn. Cambridge: Cambridge Univer-\nsity Press (1927) 643 pp.\n12. E.J. Hinch, The distortion of a flexible inextensible thread in a shearing flow. J. Fluid Mech. 74 (1976) 317–333.\n13. M.A. Jones and F.T. Smith, Fluid motion for car undertrays in ground effect. J. Engng. Math. 45 (2003) 309–334.\n14. A.S. Abhiraman and W. George, A new aspect of the stochastic nature of carding. Textile Res. J. 43 (1973)\n452–467.\n15. H.M. Gutierrez, J.P. Rust and A.F. Seyam, Modeling and simulation for control carding. Textile Res. J. 65\n(1995) 638–643.\n16. J.P. Rust and H.M. Gutierrez, Mathematical modeling and simulation for carding. Textile Res. J. 64 (1994)\n573–578.\n17. L.D. Wibberly and W.W. Roberts Jr., Modeling the diffusive transport of bulk fiber mass in a card. Textile\nRes. J. 67 (1997) 296–308.\n"}