{"doi":"10.1109\/ISWCS.2005.1547789","coreId":"102791","oai":"oai:epubs.surrey.ac.uk:2329","identifiers":["oai:epubs.surrey.ac.uk:2329","10.1109\/ISWCS.2005.1547789"],"title":"Cost Model for Evaluation of SDMB Service over Integrated Satellite-Terrestrial UMTS Networks","authors":["Pace, Pasquale","Marano, Salvatore","Sun, Zhili","Evans, Barry"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09","abstract":"The number of broadband users has beengrowing rapidly during the last years. It is not only the number of users that increases but also the average data volume per user; a consequence of the increased number of users connected via broadband techniques is that the demand for audio and video content is also increasing. In this papel we describe an integrated satellite-terrestrial UMTS architecture investigating on the minimization of the delivery cost. The proposed telecommunication system can offer SDMB (Satellite\\ud\nDigital Multimedia Broadcast) services to mobile users\\ud\nthrough the satellite or terrestrial UMTS downlink\\ud\nsegment. On the inside of this scenario we propose a\\ud\nsimple and efficient cost model for choosing the more\\ud\nsuitable bearer (satellite or terrestrial) in order to save\\ud\nservice delivery cost, moreover we design a new\\ud\nsignalling strategy based on users location information\\ud\nfor supporting this optimal choice. The simulations performed show the goodness of the proposed strategy also with several mobile operator networks varying the number of users asking for the SDMB service","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Institute of Electrical and Electronics Engineers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2329<\/identifier><datestamp>\n      2017-10-31T14:05:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2329\/<\/dc:relation><dc:title>\n        Cost Model for Evaluation of SDMB Service over Integrated Satellite-Terrestrial UMTS Networks<\/dc:title><dc:creator>\n        Pace, Pasquale<\/dc:creator><dc:creator>\n        Marano, Salvatore<\/dc:creator><dc:creator>\n        Sun, Zhili<\/dc:creator><dc:creator>\n        Evans, Barry<\/dc:creator><dc:description>\n        The number of broadband users has beengrowing rapidly during the last years. It is not only the number of users that increases but also the average data volume per user; a consequence of the increased number of users connected via broadband techniques is that the demand for audio and video content is also increasing. In this papel we describe an integrated satellite-terrestrial UMTS architecture investigating on the minimization of the delivery cost. The proposed telecommunication system can offer SDMB (Satellite\\ud\nDigital Multimedia Broadcast) services to mobile users\\ud\nthrough the satellite or terrestrial UMTS downlink\\ud\nsegment. On the inside of this scenario we propose a\\ud\nsimple and efficient cost model for choosing the more\\ud\nsuitable bearer (satellite or terrestrial) in order to save\\ud\nservice delivery cost, moreover we design a new\\ud\nsignalling strategy based on users location information\\ud\nfor supporting this optimal choice. The simulations performed show the goodness of the proposed strategy also with several mobile operator networks varying the number of users asking for the SDMB service.<\/dc:description><dc:publisher>\n        Institute of Electrical and Electronics Engineers<\/dc:publisher><dc:date>\n        2005-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2329\/1\/SRF002322.pdf<\/dc:identifier><dc:identifier>\n          Pace, Pasquale, Marano, Salvatore, Sun, Zhili and Evans, Barry  (2005) Cost Model for Evaluation of SDMB Service over Integrated Satellite-Terrestrial UMTS Networks   2nd International Symposium on Wireless Communication Systems, 2005..  pp. 667-671.      <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/search\/srchabstract.jsp?tp=&arnumber=1547789&queryText%3DCost+Model+for+Evaluation+of+SDMB+Service+over+Integrated+Satellite-Terrestrial+UMTS+Networks%26openedRefinements%3D*%26searchField%3DSearch+All<\/dc:relation><dc:relation>\n        10.1109\/ISWCS.2005.1547789<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2329\/","http:\/\/ieeexplore.ieee.org\/search\/srchabstract.jsp?tp=&arnumber=1547789&queryText%3DCost+Model+for+Evaluation+of+SDMB+Service+over+Integrated+Satellite-Terrestrial+UMTS+Networks%26openedRefinements%3D*%26searchField%3DSearch+All","10.1109\/ISWCS.2005.1547789"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Cost model for evaluation of SDMB service over\nintegrated satellite-terrestrial UMTS networks'\nPasquale Pace, Salvatore Marano\nUniversity of Calabria - Cosenza - ITALY\n{ppace, maranol@deis.unical.it\nAbstract- The number of broadband users has been\ngrowing rapidly during the last years. It is not only the\nnumber of users that increases but also the average data\nvolume per user; a consequence of the increased number\nof users connected via broadband techniques is that the\ndemand for audio and video content is also increasing.\nIn this papel we describe an integrated satellite-\nterrestrial UMTS architecture investigating on the\nminimization of the delivery cost. The proposed\ntelecommunication system can offer SDMB (Satellite\nDigital Multimedia Broadcast) services to mobile users\nthrough the satellite or terrestrial UMTS downlink\nsegment. On the inside of this scenario we propose a\nsimple and efficient cost model for choosing the more\nsuitable bearer (satellite or terrestrial) in order to save\nservice delivery cost, moreover we design a new\nsignalling strategy based on users location information\nfor supporting this optimal choice.\nThe simulations performed show the goodness of the\nproposed strategy also with several mobile operator\nnetworks varying the number of users asking for the\nSDMB service.\nKeywords-component: SDMB, 3G, UMTS, W-CDMA.\nI. INTRODUCTION\nBroadcasting technology and services have been around\nalmost as long as the radio communication itself, and have\nfor more than half a century, been a \"broadband\" channel to\nthe user. The development now is towards fully digital\nbroadcast networks with return channels enabling out-\nreaching two-way communication in addition to traditional\nbroadcast services.\nSeveral initiatives and projects have emerged around the\nworld to provide multimedia services using an hybrid\nsatellite\/terrestrial infrastructure to provide global coverage\nin a cost effective manner [1][2][3].\nIn the context of a growing market toward mobile\nmultimedia, many studies to the innovative concept of\nSatellite Digital Multimedia Broadcast (SDMB), have been\nconducted [4][5][6].\nThe purpose of the Satellite Digital Multimedia\nBroadcast system is to provide capacity for several mobile\noperators to deliver cost effective streaming and download\nservices directly to mobile handsets over satellite and\nterrestrial UMTS in both outdoor and indoor environments.\nIn addition, it aims at complementing 2G and 3G mobile\nsystem by achieving the true anywhere and anytime\nchallenge with a dependable infrastructure offering point to\npoint and point to multipoint services via satellite over zones\nnot covered by the terrestrial networks.\nZhili Sun, Barry Evans\nUniversity of Surrey - Guildford - UK\n{Z.Sun, B.Evans}@surrey.ac.uk\nIn this paper we propose a cost model analysis for\nhelping the BM-SC (Broadcast Multicast - Service Center)\nmodule to carry out an efficient choice for the data\ntransmission over the satellite or terrestrial UMTS bearer.\nThis cost analysis strategy is greatly based on some\ninformation about the number and the location of all users\nthat are interested in receiving the SDMB service.\nThe used network architecture for the proposed choice\nstrategy consists of bi-directional channel between the UE\nand the BM-SC which may be supported over either GPRS\nor UMTS-T bearer provided by the terrestrial Mobile\nNetwork Operator. Moreover, this architecture, also involves\nthe ability to make use of multimedia broadcast\/multicast\nservices (MBMS) [7] provided by the terrestrial Mobile\nNetwork Operator in addition to the SDMB broadcast over\nsatellite. In this way, a second option for routing of SDMB\nservices to the end users is provided.\nThis paper first presents the SDMB system architecture,\nthen explains the cost model and decision strategies, finally\nconcludes the paper as well as plants out future research\ndirections.\nII. SYSTEM ARCHITECTURE OVERVIEW\nThe system relies on a hybrid satellite & terrestrial\ninfrastructure operating in the IMT2000 core frequency band\nallocated to Mobile Satellite Systems.\nIt makes use of the UTRA FDD WCDMA waveform in\nfull compliance with the relevant 3GPP standard to allow a\nvery low impact on the cost of 3G handset. The system relies\non a very high power geo-stationary satellite able to\novercome indoor penetration constraints in rural areas.\nAn high level overview of the generic SDMB\narchitecture is shown in fig. I developed in the EU F6\nMAESTRO project [1].\nIt illustrates the key functional elements within the\nnetwork that will be used to support the SDMB service.\nThese elements include:\n* SDMB-capable User Equipment; a dual mode T-\nUMTS \/ S-UMTS mobile device enhanced to support SDMB\nservices.\n* SDMB Satellite that will support the transmission\nof SDMB services to defined coverage areas.\n* SDMB Terrestrial Repeaters that may be deployed\nto enhance SDMB signal availability for UEs in urban areas\nby retransmitting the satellite signal on the ground.\n* SDMIB Hub that controls broadcast transmission\nover the SDMB satellite system taking as input media\nstreams from the BM-SC.\n* BM-SC (Broadcast Multicast - Service Center) that\ncontrols all aspects of the delivery of SDMB services\nincluding authentication and authorization of subscribers,\nThis work was supported by the European Commission within the frame of the IST\/FP6 integrated project MAESTRO.\nThe authors would like to thank all project partners for their contributions to this work.\n0-7803-9206-X\/05\/$20.00 ©2005 IEEE\n667\nI\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:21:59 UTC from IEEE Xplore.  Restrictions apply. \nthrough delivery of services over the SDMB network, to\nservice accounting.\nContent Provider that will provide the multimedia\ncontent to be delivered over the SDMIB system.\nThe Gmb and Gi interfaces towards the SDMB Hub only\nneed to be able to support the Broadcast Mode defined in\n[7], furthermore those interfaces may need to support\nfunctionality \/ attributes which are specific to the SDMB\nsystem. For these reasons we refer to the interfaces as Gmb*\nand Gi* respectively.\nSDMB\n5DR 11\\\n_ ' SDXB TerrstnaXepewter it \\ \\M-SC\nMINOI\nSDNIB U1\nTU\\ e 3GNt-A, G ,,\nn\n.I\nI. Service Announcement message sent over the Gi*\ninterface between BM-SC and SDMB Hub\n2. Service Announcement message sent through the\nSDMB to each UE in a broadcast way\n3. New Answer UE message sent to BM-SC via return\nchannel over Terrestrial UMTS network in order to\ninform the BM-SC about the availability to receive the\nservice.\n4. Session start request message sent over Gmb* interface\n5. Session start response message sent over Gmb*\ninterface\n6. Data Transmission between BM-SC over Gi* interface\n7. Data Transmission through the SDMB to each UE in a\nbroadcast way\nDue to the long round trip time delay between satellite\nhub and user terminal, it is better to sent the session start\nresponse message (5) after the SDMB Resource Set Up\nphase execution. In this way it is safely guaranteed that the\nnecessary radio resources for the transfer of SDMB data to\nthe interested UEs, will be established before the data\ntransmission phase (6).\nFor the same reasons connected to the long round trip\ndelay over the satellite link, this new time messages\nsequence must be adopted also in the session stop phase as\nshown in the next figure.\nLIE\nFigure 1. Integrated System architecture.\n111. LOCATION INFORMATION SIGNALLING\nLocation information must be sent to the BM-SC by each\nusers in a new specific message after the reception of the\nservice announcement broadcast message.\nIn this way the BM-SC, knowing the amount of users\nand their location, can implement the following proposed\nstrategy in order to minimize the transmission costs for both\nmobile and satellite network operators without to decrease\nthe quality of service offered to the users.\nMoreover the BM-SC could \"periodically\" estimate the\nnumber of connected users and their location deciding to\nswitch the transmission bearer according to a new cost value.\nThe following time message scheme shows the\ncommunication between the UE, the Sat Hub and the BM-\nSC highlighted the exchanged messages over different\nimplicated interfaces.\nUE DM uBMC\nFigure 3. Session Stop.\nI. Session stop request message sent over Gmb* interface\n2. Session stop response message sent over Gmb*\ninterface.\nIV. COST MODEL FOR EACH MOBILE NETWORK\nOPERATOR\nTraditionally, cellular systems were designed to support\nvoice services, so measures as production cost per minute,\nare usually employed when discussing the economies of\nsuch systems. We take the same approach when considering\ndata services and derive the costs of supporting a certain user\nas being proportional with the usage time of the radio\nchannel. In the followings, Cu is the average cost per second\nper user using the radio channel for a point to point unicast\nconnection. Because the power consumption of radio\ntransmitters in a cellular system does not represent a\nsignificant part of the costs, Cu mainly represents the cost\nper user as derived from the cost of necessary infrastructure\ndeployment. This is because for a given user data rate the\ninfrastructure cost grows linearly with the number of\nsupported users, hence cost per user remains basically\nconstant. For a given deployed infrastructure the cost of\ndelivery the same multimedia item of size L (bits) to a\nnumber ofN users through point to pint connection is:\nN LCost = Cu * E-\nj=\/ r.\n(1)\nwhere rj is the data rate transmission of the jth connection.\nFigure 2. Session Start.\n668\nI\nm 5\nI 7\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:21:59 UTC from IEEE Xplore.  Restrictions apply. \nIn this model, the cost for the channel usage per\nsecond is then directly proportional with the transmitted\npower: Cb=aPt. The cost of transmission for an item of\nlength L (bits) with a data rate Rb for broadcast connection\nis:\nL\nCbroad =Cb - (2)\nRb\nIntuitively, it should be possible to set a high rate for a\nsubgroup of recipients experiencing good broadcasting link\nquality, while the rest will receive the item through terrestrial\ncellular unicast link.\nBefore introducing the optimization problem a few\ndefinitions and notations are necessary:\n* Every multimedia item i is characterized by a length L\n(bits) and is dedicated to a set of recipients N;, of size si.\n* The set of available data rates is Rb for broadcasting\nand Ru for unicasting.\n* For each available broadcasting rate Rx E Rb and item\ni there is a set of users Kx, of size s,, that is able to receive the\nitem with this rate if they met a certain signal-to-noise ratio\nrequired by R,. Kx is a subset of N; .\n* The cost experienced by the operator when delivering\nthe item i is CMNO. This cost is the sum of the cost for\nmulticasting the item to the set Kx using the broadcasting\ninfrastructure and the cost of serving the set Ni-Kx through\npoint-to-point connections provided by the cellular\ninfrastructure.\nWith these notations, the cost for each MNO can be\nwritten\nCMNO = Cb .-k+ CuE (3)\nwhere rj E Ru is the cellular data rate for each user j in\nthe set s; - sx. First term is the cost of broadcasting and the\nsecond one is the cost of using the cellular system. This\nexpression is valid if O<sx<si. For sx = si we have only\nbroadcasting with the rate corresponding to the \"worst\" user.\nFor sx = 0 only the cellular system is employed.\nThe optimization problem is formulated as minimize\nCMNO by finding the optimum set sx and the corresponding\nrate Rx such that all N; recipients eventually receive the item.\nThis problem has to be solved under different settings for\nnumber of item's recipients, certain values for Cu and Cb,\nsets of available data rates, number of cells in the service\narea, cell radius, height of broadcasting tower, transmitted\npower, etc. Obviously under different settings the solution of\nthe problem varies. Looking to the previous considerations,\nit is possible to note, that the proposed cost model is strictly\nconnected to the service data rate. The service classes chosen\nfor the SDMB network are Rich Media broadcast, Interactive\nTV broadcast, Data download and Group messages that\nsupport different application with different data rate; the\ntable 1 is derived from [7] and shows the possible bit rate\nvalues for each application ofthe proposed SDMB network.\nHowever, the previous considerations about the cost\nmodel are valid for a generic cellular network but in our\nstudies we use a mobile 3G network based on WCDMA\nradio interface thus more attention must be addressed to the\nrate transmission values.\nWide-band code division multiple access (WCDMA)\nsystems (e.g., ETSI WCDMA, cdma2000), which will be the\nmajor radio transmission technologies for IMT-2000, have\nintrinsic support for dynamic rate transmission. In a\nWCDMA system, with a fixed number of assigned codes,\nthe uplink data transmission rate can be controlled on a\nframe-by-frame basis by using a variable spreading factor\n(VSF) method [8][9][10]; on the contrary the spreading\nfactor and the number of codes in the downlink segment are\nfixed [11].\nNevertheless, using the WCDMA access scheme, the rate\ntransmission value for each service class is not equal to the\nreal data amount that must be send on the downlink segment\nbecause each connection needs to be spread on the entire\ntransmission bandwidth (e.g. 5 MHz) using a suitable\nspreading factor value.\nWith the aim of conducting a first simple analysis, we\nimpose the relation Rx = rj = R in the equation 3 considering\nthe same data rate for unicast and broadcast connections and\nobtaining the following one:\nCMNO Cb -L + CuL- (4)R j=1 Rj\nobserving the two different contributions and knowing\nthe ratio value between the broadcast and unicast costs, it is\npossible to derivate the following relation\nCMNO =X CU-=CuxL where C =X (5)MNO- R\n~~~~~~~~=1RCu\nWe demonstrate that, for each MNO, the broadcast\ntransmission cost is the same of the unicast transmission cost\nif the number of served users is equal to X, moreover if the\nnumber of active users in the MNO is equal to Y < X, it is\nbetter to use Y unicast connections rather than a single\nbroadcast one.\nObviously the data rate is different for each SDMB\napplication as shown in table I thus the generic proposed cost\nmodel can be used for estimating different cost values.\nTABLE I\nSDMB APPLICATIONS AND PARAMETERS.\nSDMB Service M MBMS User Application\nServices Example Media Service Data rateClassification\nRich media Audio Stereo Audio, Streaming Up to 128 kbps\nBroadcast distribution Video (e.g. 3fps)\nwith low\nquality video\nRich media Video Video & Download Up to 384 kbps\nBroadcast distribution supplementarydata (e.g. text,\nstill images)\nInteracfive Video Video & Streaming Up to 384 kbps\nTV streaming supplementarydata (e.g. text,\nstill images)\nData General Video, Audio, Carousel, Up to 384 kbps\ndownload Content File Data (binary download\nDistribution data)\nData Audio Stereo Audio, Streaming Up to 128kbps\ndownload distrbution Video (e.g. 3fps)\nwith low\nquality video\nData Audio Stereo Audio Download Up to 48kbps\nDownload download\nGroup Reliable text Text Download Up to 10 kbps\nMessages distribution (eg.\nLocal news)\nGroup Text Text, Still Carousel, Up to 32 kbps\nMessages distribution images, Video download\nwith still (e.g. 3fps)\nimages and\/or\nlow quality\nvideo\nV. DECISION STRAT EGY AND RESOURCES ALLOCATION\nFOR THE BM-SC (AGGREGATOR CENTRIC)\nIn our studies we used a network architecture role model\nbased on Aggregator Centric [1]; key features of this\narchitecture are that the MNNO still owns the SDMB user but\nthe MNO is not responsible for the delivery of SDMB\nservices to the users. This role is performed by a separate\nentity (the Aggregator) which hosts same functional aspects\n669\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:21:59 UTC from IEEE Xplore.  Restrictions apply. \nof the BM-SC including content aggregation, conditional\naccess and reliable transport.\nThis role model may have significant advantages in\nenabling the same content to be sold to many operators, thus\nmaking more efficient use of satellite bandwidth.\nFor each SDMB service or application we need to\nevaluate the cost function of each MNO, it is also necessary\nto evaluate the Utilization Factor or Congestion Factor for\neach NNO [12] in order to decide the best path over a\nsatellite or terrestrial bearer for an SDMB service.\nThe cost function for each MNO is already shown in (5)\nwhilst the cost function for the broadcast transmission over\nthe satellite bearer is:\nCb,.5d- SAT G-\nL (6)\nRBS\nwhere Cs is the cost for the satellite channel usage per\nsecond that is bigger than Cb and Cu and represent an other\nstudy parameter [131.\nTwo different cases have been investigated:\nI . No Mobile Network is congested\n2. At least one Mobile Network is congested\nIt is necessary to fix an utilization threshold value for\neach MNO in order to evaluate the congestion state and to\noperate the right choice.\nIn the first case, because no mobile network is congested,\nit is possible to try to allocate traffic resources over the\nterrestrial bearer evaluating the cost functions in the\nfollowing way:\nIn order to increase the QoS offered to the users reducing\nthe delivery delay for each application, we always prefer to\nuse the T-UMTS network even if it is not very profitable for\nthe Mobile Network Operator. However the expected\ndelivery delay for the chosen applications is always greater\nthan the satellite round trip time delay because this broadcast\nsystem is designed for not strictly real time services like rich\nmedia broadcast, interactive TV data download and group\nmessages that can support an IP delay variation in a range\nbetween 400ms up to I sec.\nIn the second case, if one of the mobile networks is\ncongested, we choose to send data using only the satellite\nbroadcast bearer for all the users of all mobile networks.\nObviously this is one of the possible choice, we don not say\nthat it is the best choice, it could be also possible to send data\nusing the congested mobile network infrastructure\ndecreasing the QoS offered to the users and saving the\nsatellite link bandwidth.\nVI. SIMULATION RESULTS\nIn our simulation campaign we perform a snapshot\nanalysis (steady state) with maximum fixed number of\nMNOs and users in each of them. In each snapshot one\nmultimedia SDMB service is delivered to the recipients in\nthe service area.\nThe service consists of delivery of a multimedia item i\nthat is characterized by its size in bits Li and number of\nrecipients ni. Each mobile user has a terminal that is always\non and able to connect simultaneously to both terrestrial-\nUMTS (unicast-broadcast) and Satellite (broadcast) systems.\nWe only consider the downlink segment. The main\nsimulation parameters are summarized in table II.\nTABLE 11\nSIMULATION PARAMETERS\nCb\/Cu 30-50-80-120-150\nCs 220\n#ofMNOs 5\nMultimedia Service Size Li 3 Mbits\nMultimedia Service Data Rate 384 kbps\nPercentage ofusers asking for I0%-20%-30%-40%-50%\nSDMB Services Exponential Distributed\nMaximum number ofusers for each 5000\nMNO\nCongestion MNO threshold 80%\nFigures 3 and 4 show the system behavior when no\nmobile network is congested. In particular figure 3 highlights\nin which conditions, in term of number of users asking for a\nSDMB service, is better to use terrestrial UMTS broadcast\nresources allocation rather than the unicast one. The curves\nare obtained varying the Cb\/Cu parameter that is a\ndistinctive MNO parameter.\n-No Bruadcast\ntransnls}ioo\n400 Cb\/Cu 150\n350 W.cCbCu= 120\nCbCu =80\n300\nCb\/Cu =50\n_ ~~~~~~~~~~~~~~~~~~~~~~CbfCu -150\naz 200-\n.,-2e 0 Cbru =12\n150\ninn ,c!,,g - Cbc=80s\n5'\n300\n00U\nRe,,,,,,,,,\n0-StS + -------++A+ t----------- ----- ++ +-+ + ++ +-1='_t 50Cb3Cu030\nb 4'¢ 4'e5 e° *t 4' 4'e° 4' 4' #,b # e 0°\nUer\nFigure 3. Costs for each MNO.\nService llME [nMn]\nFigure 4. Total MNOs cost varying the percentage of users\nasking for SDMB service.\n670\nif( E CAMOi < Cbroad-SAT )\ni=J\nthen Resources Allocation over T-UMTSAMNOs\nElse if d(expected delivery delay ) < delaySatRTT\nResources Allocation over T-UMTS M:NOs\nElse\nResources Allocation over Satellite bearer\n- Toy WJ0S C564rW10% -duorv d,.k SDfM3501vi\n-i- Toacc5Os%1fo 20% d -u1rs M dk SD0.5 .0. .\n- ToW MlJ0. colS fco 30% d -e {t k SDe -MC\nT0 M1JOs6he- f1 40% d users dt ask SD, se-ce\n-+Tda MOOs c-ts too 50% dsers 3ut ask SD0-Ssenie\n-Sa.t50f.1ik Cost\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:21:59 UTC from IEEE Xplore.  Restrictions apply. \nFigure 4 shows the total MNOs cost varying the\npercentage of users belonging to each MNO and asking for\nthe SDMB service. Obviously the BM-SC has to manage all\nthe five mobile networks that have different Cb\/Cu values.\nIt is possible to observe that, using the simulation parameter\nin table II, if the percentage of users asking for the SDMB\nservices is equal or greater than 40%, it is more convenient\nto send data to all MNOs through the satellite broadcast link.\nClearly the cost model analysis is always valid but the\nobtained results are strictly linked to the input parameters\nthat can be changed according to the real constrains of each\nmobile or satellite network operator.\nFigure 5 shows the congestion level for each MNO\nversus the SDMB service time is, obviously the congestion\ntrend is really unpredictable because it is function of many\nfactors like number of users, mobility and day time.\nMoreover the figure highlights the maximum congestion\nlevel that represents, in each time, the MNO that is more\ncongested.\nThis parameter is used by the BM-SC in order to make\nthe efficient choice for sending data over the terrestrial or\nsatellite broadcast link as already explained; if the maximum\ncongestion value is greater than the fixed congestion\nthreshold value, then the BM-SC chooses to send data using\nthe broadcast satellite link with the aim of saving the QoS\nlevel offered to the users in the congested mobile network.\nObviously this is only one possible approach; it should\nbe possible to send data using the terrestrial UMTS network\neven if it is congested, in this case a deep and accurate study\non the QoS degradation for the users belonging to the\ncongested mobile network, should be necessary.\n130 \/0 -\n12-1 MN0O1 -MN02\n110-16~~~~~~~~~~~~~~~~11\n10%\n9l% A AA fAlA SA l1E MlNO\ntl\ni%g it en\/\nW\/b\nthe choice is conducted with and without the information\nabout the congestion value of the MNOs.\nWhen no congestion has been found, the transmission\ncost is the sum of the costs of each mobile network whilst\nwhen at least one mobile network is congested, the\ntransmission cost is a fixed cost due to the broadcast satellite\nlink.\nVII. CONCLUSION AND DISCUSSION\nThis paper proposes a simple and efficient cost model for\nchoosing the more suitable transmission bearer (satellite or\nterrestrial) in an integrated satellite-terrestrial UMTS\narchitecture.\nThe conducted studies and the obtained results show how\nit is possible to evaluate the best unicast or broadcast\nallocation for each mobile network depending by the total\ncost function and varying the Cb\/Cu parameter; moreover it\nis possible to choose the minimum cost bearer according to\nthe percentage of users that ask for a specific offered SDMB\nservice.\nThe gains obtained by inter-working terrestrial and\nsatellite broadcast access should then be investigated in\nconjunction with the available information about radio links;\nunfortunately, this information might be incomplete, delayed\nor not available at all.\nI\n0\nswTIME {mini\nFigure 6. Congestion level for each MNO.\nREFERENCES\n[I] Mobile Applications & sErvices based on Satellite & Terrestrial\ninteRwOrking project; http:\/\/ist-maestro.dyndns.org\/MAESTRO\/\n[2] Broadband services for everyone over fixed wireless access networks:\nBROADWAN project; http:\/\/www.telenor.no\/broadwan\/\n[31 Stratospheric Broadband CAPANINA project;\nhttp:\/\/www.capanina.org\/\n[4] N. Chuberre, G. E. Corazza, MG Francon, C. Nussli, C. Selier, A.\nVanelli-Coralli, P. Vincent, \"Satellite Digital Multimedia\nBroadcasting for 3G and beyond 3G systems\" 13th IST Mobile &\nWireless Communications Summit 2004, Lyon, France, June 2004.\n[51 K. Narenhiran et al., \"S-DMB System Architecture and the MODIS\nDEMO\" IST Mobile and Wireless Telecommunications Summit,\nAveiro, Portugal, June 2003.\n[6] V.Kueh, M.Karaliopoulos, B.G.Evans, P.Vincent, G.Chengeleroyen\nJ.Malsch, N. Koutsokeras, E. Angelou, I.Andrikopoulos \"Satellite\nDigital Multimedia Broadcast (SDMB) Access Layer Definition\", 6'h\nEMPS & ASMS, Noordwijk\/NL, September 2004, ESA\/ESTEC.\n[7] 3GPP TS 22.246 V6.2.0 (2004-09) Technical SpecificationGroup\nServices and System Aspects; \"Multimedia Broadcast\/Multicast\nService (MBMS) user services\", Stage I (Release 6).\n[8] E. Dahlman et al., \"UMTS\/IMT-2000 based on wideband CDMA4\"\nIEEE Commun. Mag., vol. 36, pp. 70 80, Sept. 1998.\n[9] E. Dahlman and K. Jamal, \"Wide-band services in a DS-CDMA\nbased FPLMTS system\", Proc. IEEE VTC '96, pp. 1656 1660.\n110] S. Nanda, K. Balachandran, and S. Kumar, \"Adaptation techniques in\nwireless packet data services\", IEEE Commun. Mag., Jan. 2000.\n[11] D. In Kim, E. Hossain, V.K. Bhargava, \"Dynamic rate adaptation\nand integrated rate and error control in cellular WCDMA networks\"\nWireless Communications, IEEE Transactions on, Volume 3, Issue\n1, Jan. 2004, pp.35 - 49.\n[12] A. Bria, \"Multi-radio Resource Management in Hybrid Cellular-\nBroadcasting Networks\", PCC Personal Computing and\nCommunication Workshop, Stockholm, November 2003.\n[13] B. Xu, 0. Wolfson, S. Chamberlain, N. Rishe, \"Cost based data\ndissemination in satellite networks\" Mobile Networks and\nApplications - Kluwer Academic Publishers, Volume 7, pp.49-66,\nJanuary 2002.\n671\n210 - -- rr-\n,Toa EW sc usostso sa ask Si EB\nsI*' c iXgeska:\n170\nl TdMN costs ier30of ustt ask SDMB\nservice iashcororstic\n160 l w m w M a XIL X X 1 I I\n2\n1\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:21:59 UTC from IEEE Xplore.  Restrictions apply. \n"}