{"doi":"10.1097\/WNR.0b013e32832770a5","coreId":"52757","oai":"oai:eprints.lincoln.ac.uk:3366","identifiers":["oai:eprints.lincoln.ac.uk:3366","10.1097\/WNR.0b013e32832770a5"],"title":"Event-related potential correlates of spatiotemporal regularities in vision","authors":["Pollux, Petra","Guo, Kun"],"enrichments":{"references":[{"id":714478,"title":"An introduction to the event-related potential technique.","authors":[],"date":"2005","doi":null,"raw":"Luck  SJ.  An introduction to the event-related potential technique. Cambridge: The MIT Press; 2005.","cites":null},{"id":711428,"title":"Centre-surround interactions in response to natural scene stimulation in the primary visual cortex.","authors":[],"date":"2005","doi":"10.1111\/j.1460-9568.2005.03858.x","raw":"Guo K, Robertson RG, Mahmoodi S, Young MP. Centre-surround interactions in response to natural scene stimulation in the primary visual cortex. European Journal of  Neuroscience 2005; 21: 536-548. 13[9]  Guo K, Robertson RG, Pulgarin M, Nevado A, Panzeri S, Thiele A, Young MP. Spatio-temporal prediction and inference by V1 neurons. European Journal of Neuroscience 2007; 26: 1045-1054.","cites":null},{"id":711006,"title":"Contextual influences on visual processing. Annual Review of Neuroscience","authors":[],"date":"2002","doi":null,"raw":"Albright TD, Stoner GR. Contextual influences on visual processing. Annual Review of Neuroscience 2002; 25: 339-379.","cites":null},{"id":712940,"title":"Contrast dependence of motion-onset and pattern-reversal evoked potentials. Vision research","authors":[],"date":"1995","doi":"10.1016\/0042-6989(94)00138-c","raw":"Kubová Z, Kuba M, Spekreijse H, Blakemore C. Contrast dependence of motion-onset and pattern-reversal evoked potentials. Vision research 1995; 35: 197-205.","cites":null},{"id":713410,"title":"Effect of aging on visuospatial attention: an ERP study. Neuropsychologia","authors":[],"date":"2001","doi":"10.1016\/S0028-3932(00)00112-3","raw":"Curran T, Hills A, Patterson MB, Strauss ME. Effect of aging on visuospatial attention: an ERP study. Neuropsychologia 2001; 39: 288-301.","cites":null},{"id":710230,"title":"Effects on orientation perception of manipulating the spatiotemporal prior probability of stimuli. Vision Research","authors":[],"date":"2004","doi":"10.1016\/j.visres.2004.04.014","raw":"Guo K, Nevado A, Robertson RG, Pulgarin M, Thiele A, Young MP. Effects on orientation perception of manipulating the spatiotemporal prior probability of stimuli. Vision Research 2004; 44: 2349-2358.","cites":null},{"id":712275,"title":"Event-related potential correlates of two stages of information processing in physical and semantic discrimination tasks. Psychophysiology","authors":[],"date":"1983","doi":"10.1111\/j.1469-8986.1983.tb03283.x","raw":"Ritter W, Simson R, Vaughan H. Event-related potential correlates of two stages of information processing in physical and semantic discrimination tasks. Psychophysiology 1983; 20: 168-179.","cites":null},{"id":709825,"title":"Functional integration and inference in the brain.","authors":[],"date":"1996","doi":"10.1016\/s0301-0082(02)00076-x","raw":"Friston K. Functional integration and inference in the brain. Progress in Neurobiology 1996; 68: 113-143.","cites":null},{"id":714672,"title":"Identification of early visual evoked potential generators by retinotopic and topographic analyses. Human Brain Mapping","authors":[],"date":"1995","doi":"10.1002\/hbm.460020306","raw":"Clark VP, Fan S, Hillyard SA. Identification of early visual evoked potential generators by retinotopic and topographic analyses. Human Brain Mapping 1995, 2, 170-187.","cites":null},{"id":714778,"title":"Localizing visual discrimination processes in time and space.","authors":[],"date":"2002","doi":null,"raw":"Hopf JM, Vogel EK, Woodman G, Heinze HJ, Luck SJ. Localizing visual discrimination processes in time and space. Journal of Neurophysiology 2002; 88: 2088-2095. 15LEGENDS","cites":null},{"id":713105,"title":"Luminance and spatial attention effects on early visual processing.","authors":[],"date":"1995","doi":"10.1016\/0926-6410(95)90008-X","raw":"Johannes S, Munte TF, Heinze HJ, Mangun GR. Luminance and spatial attention effects on early visual processing. Cognitive Brain Research 1995; 2: 189-205. 14[17] Taylor  MJ.  Non-spatial attentional effects on P1. Clinicial Neurophysiology 2002; 113: 1903-1908.","cites":null},{"id":713300,"title":"Non-spatial attentional effects on P1. Clinicial Neurophysiology","authors":[],"date":"2002","doi":"10.1016\/S1388-2457(02)00309-7","raw":null,"cites":null},{"id":709563,"title":"Perception as bayesian inference.","authors":[],"date":"1996","doi":"10.1017\/cbo9780511984037","raw":"Knill DC, Richards W. Perception as bayesian inference. Cambridge: University Press; 1996.","cites":null},{"id":711922,"title":"Preparing for Action: Inferences from CNV and LRP.","authors":[],"date":"2004","doi":"10.1027\/0269-8803.18.23.77","raw":"Leuthold H, Sommer W, Ulrich R. Preparing for Action: Inferences from CNV and LRP. Journal of Psychophysiology 2004; 18: 77-88.","cites":null},{"id":713521,"title":"Sensory gain control as a mechanism of selective attention. Electrophysiological and neuroimaging evidence.","authors":[],"date":"1998","doi":"10.1098\/rstb.1998.0281","raw":"Hillyard SA, Vogel EK, Luck SJ. Sensory gain control as a mechanism of selective attention. Electrophysiological and neuroimaging evidence. Philosophical Transactions of the Royal Society: Biological Sciences 1998; 353: 1257-1270.","cites":null},{"id":711981,"title":"Spatial gradient of visual attention: behavioral and electrophysiological evidence. Electroencephalography and Clinical Neurophysiology","authors":[],"date":"1988","doi":"10.1016\/0013-4694(88)90019-3","raw":"Mangun GR, Hillyard SA. Spatial gradient of visual attention: behavioral and electrophysiological evidence. Electroencephalography and Clinical Neurophysiology 1988, 70, 417-428.","cites":null},{"id":711711,"title":"Spatio-temporal prediction and inference by V1 neurons.","authors":[],"date":"2007","doi":"10.1111\/j.1460-9568.2007.05712.x","raw":null,"cites":null},{"id":712692,"title":"Surround suppression in the human visual cortex: an analysis using magnetoencephalography. Vision Research","authors":[],"date":"2002","doi":"10.1016\/S0042-6989(02)00103-7","raw":"Ohtani Y, Okamura S, Yoshikazu Y, Toyama K, Ejima Y. Surround suppression in the human visual cortex: an analysis using magnetoencephalography. Vision Research 2002; 42: 1825-1935.","cites":null},{"id":714318,"title":"Synergistic effect of combined temporal and spatial expectation on visual attention.","authors":[],"date":"2005","doi":null,"raw":"Doherty JR, Rao A, Mesulam M, Nobre C. Synergistic effect of combined temporal and spatial expectation on visual attention. The Journal of Neuroscience 2005; 25: 8259-8266.","cites":null},{"id":710749,"title":"The architecture of visual cortex and inferential processes in vision. Spatial Vision","authors":[],"date":"2000","doi":"10.1163\/156856800741162","raw":"Young MP. The architecture of visual cortex and inferential processes in vision. Spatial Vision 2000; 13: 137-146.","cites":null},{"id":712472,"title":"The effect of stimulus-onset asynchrony on human visual event-related potentials during simple and choice reaction paradigms under constant or random conditions. Neuroscience Letters","authors":[],"date":"2003","doi":"10.1016\/S0304-3940(03)00486-5","raw":"Li M, Kuroiwa Y, Omoto S, Hotta S, Suzuki Y, Kamitani T et al. The effect of stimulus-onset asynchrony on human visual event-related potentials during simple and choice reaction paradigms under constant or random conditions. Neuroscience Letters 2003; 345: 109-112.","cites":null},{"id":713628,"title":"The visual N1 component as an index of a discrimination process. Psychophysiology","authors":[],"date":"2000","doi":"10.1111\/1469-8986.3720190","raw":"Vogel EK, Luck SJ. The visual N1 component as an index of a discrimination process. Psychophysiology 2000; 37: 190-203.","cites":null},{"id":710017,"title":"Top-down predictions in the cognitive brain. Brain and Cognition","authors":[],"date":"2007","doi":"10.1016\/j.bandc.2007.06.007","raw":"Kveraga K, Ghuman AS, Bar M. Top-down predictions in the cognitive brain. Brain and Cognition 2007; 65: 145-168.","cites":null},{"id":711278,"title":"V1 Neurons signal acquisition of an internal representation of stimulus location. Science","authors":[],"date":"2003","doi":"10.1126\/science.1081721","raw":"Sharma J, Dragoi V, Tenenbaum JB, Miller EK, Sur M. V1 Neurons signal acquisition of an internal representation of stimulus location. Science 2003; 300: 1758-1763.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03-25","abstract":"Spatiotemporal regularities in stimulus structure have been shown to influence visual target detection and discrimination. Here we investigate whether the influence of spatiotemporal regularity is associated with the modulation of early components (P1\/N1) in Event-Related Potentials (ERP). Stimuli consisted of five horizontal bars (predictors) appearing successively towards the fovea followed by a target bar at fixation, and participants performed a key-press on target detection. Results showed that compared to the condition where five predictors were presented in a temporally regular but spatially randomised order, target detection-times were faster and contralateral N1 peak latencies were shorter when the predictors and the target were presented with spatial and temporal regularity. Both measures were most prolonged when only the target was presented. In this latter condition, an additional latency prolongation was observed for the P1 peak compared to the conditions where the target was preceded by the predictors. The latency shifts associated with early ERP components provides additional support for involvement of early visual processing stages in the coding of spatiotemporal regularities in humans","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52757.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3366\/1\/ERP_Correlates_of_Spatiotemporal_Regularity_in_Vision.pdf","pdfHashValue":"d79a6ccc44ed43bf432e877badb0ce571c773733","publisher":"Lippincott, Williams & Wilkins","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3366<\/identifier><datestamp>\n      2013-11-18T13:58:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383530<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3366\/<\/dc:relation><dc:title>\n        Event-related potential correlates of spatiotemporal regularities in vision<\/dc:title><dc:creator>\n        Pollux, Petra<\/dc:creator><dc:creator>\n        Guo, Kun<\/dc:creator><dc:subject>\n        C800 Psychology<\/dc:subject><dc:subject>\n        C850 Cognitive Psychology<\/dc:subject><dc:description>\n        Spatiotemporal regularities in stimulus structure have been shown to influence visual target detection and discrimination. Here we investigate whether the influence of spatiotemporal regularity is associated with the modulation of early components (P1\/N1) in Event-Related Potentials (ERP). Stimuli consisted of five horizontal bars (predictors) appearing successively towards the fovea followed by a target bar at fixation, and participants performed a key-press on target detection. Results showed that compared to the condition where five predictors were presented in a temporally regular but spatially randomised order, target detection-times were faster and contralateral N1 peak latencies were shorter when the predictors and the target were presented with spatial and temporal regularity. Both measures were most prolonged when only the target was presented. In this latter condition, an additional latency prolongation was observed for the P1 peak compared to the conditions where the target was preceded by the predictors. The latency shifts associated with early ERP components provides additional support for involvement of early visual processing stages in the coding of spatiotemporal regularities in humans.<\/dc:description><dc:publisher>\n        Lippincott, Williams & Wilkins<\/dc:publisher><dc:date>\n        2009-03-25<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3366\/1\/ERP_Correlates_of_Spatiotemporal_Regularity_in_Vision.pdf<\/dc:identifier><dc:identifier>\n          Pollux, Petra and Guo, Kun  (2009) Event-related potential correlates of spatiotemporal regularities in vision.  Neuroreport, 20  (5).   pp. 525-530.  ISSN 0959-4965  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1097\/WNR.0b013e32832770a5<\/dc:relation><dc:relation>\n        10.1097\/WNR.0b013e32832770a5<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3366\/","http:\/\/dx.doi.org\/10.1097\/WNR.0b013e32832770a5","10.1097\/WNR.0b013e32832770a5"],"year":2009,"topics":["C800 Psychology","C850 Cognitive Psychology"],"subject":["Article","PeerReviewed"],"fullText":"ERP CORRELATES OF SPATIOTEMPORAL REGULARITY IN \nVISION \nPetra M. J. Pollux, Kun Guo \n \nDepartment of Psychology, University of Lincoln, UK \n \n \nCorresponding author: \n \nDr.  Petra M. J. Pollux \n \nDepartment of Psychology     \nUniversity of Lincoln     \nLincoln LN6 7TS \nUK       \nE-mail: ppollux@lincoln.ac.uk    \nTel: +44 1522 886360     \nFax: +44 1522 886026 \n \nCharacter count: 16479 (no spaces)   \n \n \n \nRunning head: ERP spatiotemporal regularity \n 1\nABSTRACT \nSpatiotemporal regularities in stimulus structure have been shown to influence \nvisual target detection and discrimination. Here we investigate whether the influence \nof spatiotemporal regularity is associated with the modulation of early components \n(P1\/N1) in Event-Related Potentials (ERP). Stimuli consisted of five horizontal bars \n(predictors) appearing successively towards the fovea followed by a target bar at \nfixation, and participants performed a key-press on target detection. Results showed \nthat compared to the condition where five predictors were presented in a temporally \nregular but spatially randomised order, target detection-times were faster and \ncontralateral N1 peak latencies were shorter when the predictors and the target were \npresented with spatial and temporal regularity. Both measures were most prolonged \nwhen only the target was presented. In this latter condition, an additional latency \nprolongation was observed for the P1 peak compared to the conditions where the \ntarget was preceded by the predictors. The latency shifts associated with early ERP \ncomponents provides additional support for involvement of early visual processing \nstages in the coding of spatiotemporal regularities in humans.   \n \nKeywords:  Spatiotemporal regularity, Event-related potentials, Visual cortex, \nHuman\n 2\nINTRODUCTION \nThe way in which objects appear and move in our visual environment is often \npredictable, reflecting a stream of events which are spatially and temporally coherent. \nThis spatiotemporal regularity, along with other common regularities existing in our \nnatural surroundings, is assumed to be informative for an efficient visual system in \nprocessing of visual inputs [1], and such inferential processes in vision have been \nevidenced by the modulation of both perceptual sensitivity and neural responses when \nprocessing scenes for which the visual system has prior knowledge or expectations \n[for reviews, see 1-3].  \nUsing a stimulus sequence comprising four collinear bars (predictors) \nappearing successively towards the fovea, followed by a target bar with the same or \ndifferent orientation, Guo et al [4] showed that human orientation judgement for the \ntarget bar was biased towards the orientation of the predictors. The degree of this bias \nwas correlated to the spatiotemporal prior probability induced by the orientated \npredictors (i.e. stronger bias for the predictors presented in a highly ordered and \npredictable sequence, with less bias for the predictors presented in a randomized order \nor with randomized duration), suggesting that contextual information about this \nspatiotemporal regularity is integrally used in the reconstruction of the visual scene \nwhen processing local visual information. \nWithin our extensive cortical neural network connected with feed-forward, \nlateral and feed-backward connections [5], it is still unclear where and how this \nspatiotemporal regularity is computed. However, recent extracellular recordings from \nmonkeys have suggested the involvement of primary visual cortex (area V1), the first \ncortical stage of visual processing [6-9]. When the predictors were consecutively \npresented in a highly ordered and predictable sequence towards a neuron’s classical \n 3\nreceptive field (CRF) with its preferred orientation, up to half of recorded V1 neurons \nresponded to the predictors prior to and distant from stimulation of their CRFs, and \nsome neurons’ orientation tuning to the CRF target bar were systematically biased \ntowards the orientation of the predictor bars [9]. This suggests that the computation of \nspatiotemporal regularity starts at the earliest stage of visual processing, and that those \nmodulated early neuronal responses may be correlated with the modulation of human \norientation perception demonstrated in psychophysical experiments [4].  \nHere we aim to extend this study of neural computation of spatiotemporal \nregularity to human observers. With its advantage of higher temporal resolution, scalp \nrecording of Event-Related Potentials (ERP) was employed. We expect a modulation \nof early ERP measures (P1\/N1 deflections) as a function of spatiotemporal regularities \nin the visual scene which may be linked with perceptual performance recorded at the \nsame time. Such approach would be relevant for our future study examining to what \ndegree human perceptual performance corresponds with underlying neural \ncomputation in processing visual signals in natural contexts. \n \nMETHOD \nParticipants: Ten volunteers participated in this experiment. All participants \n(mean age = 21; sd = 1.3) were right handed and had normal or corrected to normal \nvision. Informed consent was obtained from each participant, and all procedures \ncomplied with the British Psychological Society “Code of Ethics and Conduct”. \n Materials and procedure: Visual stimuli were generated using a ViSaGe \ngraphics system (Cambridge Research Systems, UK) and displayed on a high-\nfrequency non-interlaced gamma-corrected colour monitor (100 Hz frame rate, \n1024×768 pixels, Mitsubishi Diamond Pro 2070SB) with a uniform grey background \n 4\n(24 cd\/m2 luminance). They consisted of six horizontal short bars (1.5° length, 0.1° \nwidth, 15% contrast) which were presented collinearly and successively towards the \ncentre of the screen marked by a small red fixation point (FP, 0.15° diameter, 7.8 \ncd\/m2 luminance). The first five bars were predictors and were presented away from \nFP, the sixth bar was the target and presented 1° below FP.  Participants viewed the \nvisual stimuli binocularly with their heads placed in a chinrest at a distance of 57 cm \nfrom the monitor in a quiet, dim-lit room. After a warning tone (350 Hz, 150 ms), the \npredictor-target sequences were drawn from three conditions, Predictable condition \n(Pr), Random condition (R) and Target alone condition (TA), in a randomized block \ndesign (Fig. 1). In Pr and R, the first predictor was presented 500 ms after the warning \ntone. Each bar was presented for 200 ms, followed by a 100 ms delay before \npresentation of the next bar. The target was always presented immediately below FP \nin all conditions. There was no spatial interval between the locations of the adjacent \nbars: In Pr, the locations of the five predictors followed a straight horizontal line from \nthe most extreme left location (6.75° relative to fixation) to the target location below \nFP. Predictor bars in R were presented at the same predefined predictor locations in \nthe left visual field, but the order of the predictors’ locations was randomized. In TA, \nonly the target bar was presented, although the delay between the warning tone and \nonset of the target bar was kept the same as the time delay between warning tone and \ntarget presentation in Pr and R. Participants were instructed to maintain fixation \nduring the task, to press a response key on the detection of the target bar, and to \nignore any peripheral stimuli presented before the target. The experiment consisted of \ntwo blocks of 75 trials (in total 50 trials in each condition), which were presented after \na short practice block consisting of 10 trials to allow familiarization with the task.  \n 5\nERP-recording: EEG was recorded with a sampling rate of 256 Hz from 64 \nscalp locations using active Ag-AgCL-tipped electrodes attached to an electrode cap \nusing the 10\/20 labelling systems. The Active Two system (Biosemi, Amsterdam) \nwas used for recording, which does not require gain adjustment or measurement of \nimpedance. EEG signals were referenced during the recording to an additional active \nelectrode (Common Mode Sense). In addition to the electrode cap, four electrodes \nwere used to record electro-oculograms (EOGs). Two electrodes were placed at the \nouter canthi of both eyes (horizontal EOG) and two electrodes were placed on \ninfraorbital and supraorbital locations of the right eye (Vertical EOG). Two additional \nelectrodes (placed behind the left and right ear) were use for the off-line linked-\nmastoid referencing process. Signals were filtered off-line (high-pass filter: 0.1 Hz; \nlow-pass filter: 70 Hz). Segments were time-locked to the onset of the first predictor \nbar and to the onset of the target bar by triggers sent to the recording system. Raw \nEEG was first segmented in epochs of 2400 ms (which included a 100 ms baseline). \nAfter rejection of trials with horizontal eye-movements and EOG correction for blink-\nartifacts, separate segments were created for the pre-target epoch (1500 ms, included a \n100 ms baseline) and the target epoch (800 ms, including a 100 ms baseline), \nseparately for the three experimental conditions. Segments with amplitude change \ngreater than 180 uV or with amplitudes exceeding the amplitude criterion (± 100 uV) \nwithin 200 ms intervals at the scalp electrodes were rejected with an automatic \nrejection algorithm.  \nERP-Analyses: Within the target epoch, the latency window for P1 (110–\n170ms) and N1 (170–235ms) was determined by visual inspection of the waveforms \nat the posterior electrode locations (PO7\/PO8, PO3\/PO4, and O1\/O2). Peak latency \nfor P1 and N1 was defined as the global maximum within each specified time-\n 6\nwindows (automatic peak detection). As peak-latencies for target P1 and N1 were \ndifferent for the three testing conditions, P1\/N1 peak-to-peak amplitudes were used \nfor analysis. Following target N1, a difference between conditions was observable \nwithin the latency window 220-300 ms at posterior and occipital electrodes (analyzed \nat PO3\/PO4) and was assumed to reflect the influence of the N2 on the averaged ERP \nsignal. As peaks for this component were not clearly detectable, only mean \namplitudes were analyzed.  \nVisual inspection of the pre-target waveforms revealed an increased negative \ndrift from the onset of predictor two to target onset over the central and posterior \nelectrode locations. This increased negativity between warning signal and response \nstimulus (Contingent Negative Variation: CNV) is generally associated with motor \npreparation and time-uncertainty [10]. To establish whether the ERP effects observed \nat posterior electrode locations occurred independently from the CNV, the raw data \nwas filtered a second time with a higher high-pass filter (1 Hz) before repeating the \nanalysis of ERP measures (first and second reported F and p-values in the Results \nsection, respectively). For all analyses, the Greenhouse-Geisser adjustment was used \nwhenever appropriate in the interpretation of statistical results. Only significant main \neffects are reported. \n \nRESULTS \n \nBehavioural data: Response times to detect the target bar presented at fixation \ndiffered significantly across the three conditions [F(2,18) = 43.48; p < 0.001]. Pair-\nwise comparisons confirmed that mean response time to targets in Pr (251±7ms, \n 7\nMean±SEM) was faster compared to the R (295±9ms; p < 0.001) and TA (325±11ms; \np < 0.001). Responses in TA were also significantly slower than in R (p = 0.003).  \nPeak-latency: P1 peak-latency analysis as a function of Hemisphere, electrode \nSite and Condition revealed a significant effect of Hemisphere [F(1,9) = 9.02 and \n8.28; p < 0.02] (with shorter P1 peak-latencies over the left scalp), Condition [F(2,18) \n= 11.17 and 4.32; p < 0.03], Site [F(2.18) = 10.58 and 9.35; p < 0.002], and a \nsignificant interaction between Site x Hemisphere [F(2,18) = 6.63 and 6.378; p < \n0.007] and Site x Condition [F(4,36) = 5.56 and 4.72; p < 0.004]. The effect of \nCondition was more pronounced over the right posterior scalp and was significant at \nPO3\/4 [F(2,18) > 10.5 and 8.9; p < 0.002] and at O2 [F(2,18) = 5.41 and 4.03; p < \n0.04]. At all three sites, P1 latency was significantly longer for TA compared to Pr (p \n< 0.01) and R (p < 0.02), but the difference between Pr and R was not significant (see \nFig. 2). On average, P1 latency was 15 ms longer in TA compared to Pr and R. This \nsite-specific effect of Condition resulted in a different time-course of peak-latency \nacross the analyzed electrode: in TA, P1 peaked earlier at the more lateral electrode \nsites PO7\/8 [F(2,18) >  3.7 and 3.5; p < 0.05] compared to PO3\/4 (p < 0.02) and O1\/2 \n(p < 0.04). This effect of Site was not significant in Pr and R.  \nN1 peak-latency analysis revealed significant effects of Hemisphere [F(1,9) = \n5.43 and 4.48; p < 0.05] (with shorter latencies over the left posterior scalp), \nCondition [F(2,18) = 9.67 and 4.38; p < 0.05], and a significant interaction between \nSite and Condition [F(4,36) = 6.12 and 5.56; p < 0.03]. The effect of Condition was \nsignificant at PO3\/4 [F(2,18) > 9.5 and 4.3; p < 0.03] and O2 [F(2,18) = 16.4 and \n9.03; p < 0.002]. At PO3, N1 latency was significantly faster for Pr compared to TA \n(p < 0.023), but not compared to R. At PO4 and O2 however, all comparisons \nbetween TA, Pr and R were significant (p < 0.01): N1 peak-latency for Pr was \n 8\nsignificantly faster compared to R and TA (difference was on average 14 ms), and N1 \npeaked significantly faster for R than for TA (with a difference of 8 ms on average). \nThe differential effect of Condition at the different electrode sites was also reflected in \ndissimilar time-courses of peak-latency across the analyzed electrodes: In TA, N1 \npeaked earlier at PO7\/8 [F(2,18) > 6.0 and 4.4; p < 0.03] compared to PO3\/4 (p < \n0.03) and O1\/2 (p < 0.01). In Pr and R however, P1 peaked earliest at PO3\/4 \ncompared to PO7\/8 and 01\/2, but this effect was only significant for Pr over the right \nscalp F(2,18) = 4.01 and 3.74; p < 0.05].  \nAmplitude: Analysis of P1\/N1 peak-to-peak amplitude revealed a significant \neffect of Site [F(2,18) = 11.4 and 12.9; p < 0.01], and significant interaction effects \nbetween Condition x Hemisphere [F(2,18) = 4.65 and 4.7; p = 0.023] and Site and \nCondition [F(4,36) = 4.42 and 4.75; p < 0.005]. Further analyses revealed a significant \neffect of Site for Pr and R over the left and the right posterior scalp [F(2,18) > 10.8 \nand 9.9; p < 0.003], which was not significant in TA. Both in Pr and R, amplitude was \ngreatest at PO7\/8 (mean = 7 µV), intermediate at O1\/2 (mean = 5.5 µV) and smallest \nat PO3\/4 (mean = 4.5 µV): PO7\/8 vs. PO3\/4: p < 0.005; PO7\/8 vs. O1\/2: p < 0.016; \nO1\/2 vs. PO3\/4: p < 0.05. The effect of Condition was only significant over the right \nscalp, at PO4 [F(2,28) = 9.76 and 9.72; p < 0.001] and O2 [F(2,18) = 3.76 and 3.67; p \n< 0.05], where peak-to-peak amplitude was significantly enhanced in TA as compared \nto Pr and R (p < 0.04). Differences between R and Pr were not significant. Results of \nP1 and N1 analysis are discussed under ‘General Discussion’.   \nAnalysis of mean amplitudes within N2 latency window revealed a significant \neffect of Condition [F(2,18) = 6.7 and 10.1; p < 0.01]. The negativity was less in TA \ncompared to P (p = 0.01) and R (p = 0.02), whereas the difference between the latter \ntwo conditions was not significant. The posterior visual N2 has been associated with \n 9\nstimulus discrimination and classification processes [12, 13]. As the enhanced \nnegativity in the latency-window for N2 was comparable for Pr and R, the increase in \namplitude in these conditions may be related to stimulus classification processes \nwhich may be required when the target is embedded within a sequence of visual \nevents.  \n \nGENERAL DISCUSSION \nThe influence of spatiotemporal regularities on ERP measures associated with \ntarget processing was predominantly characterized by peak-latency shifts in early \nERP components: Compared to the Target Alone condition, P1 peak-latency at PO4 \nand O2 (contralateral to the visual field where the predictors were presented) was \nfaster when the target was embedded within a sequence of predictor bars, whereas N1 \npeak latency at these electrode sites was shorter when the stimulus structure was \ncharacterized by spatial and temporal regularities (Pr) as compared to only temporal \nregularity (R). This N1 peak-latency shift is consistent with the effect across the three \nconditions on target detection times, implying a close link between human perceptual \nperformance and neural responses associated with the processing of spatiotemporal \nregularities as reflected in the ERP latency effect. The potential causal relationship \nbetween these two measurements is currently under investigation in our laboratory. \nIn contrast to latency, amplitude of early ERP components to the target was \nnot differentially affected in the Predictable and Random conditions, although P1\/N1 \npeak-to-peak amplitude was enhanced when the target was not preceded by the \npredictors. This amplitude effect may however, be related to potential surround \nsuppression effects associated with processing of the preceding predictor bars. Using \nmagnetoencephalography (MEG), Ohtani et al [14] found that the amplitude of early \n 10\nvisually evoked magnetic responses to the central test grating was suppressed in \nconditions where the test stimulus was surrounded by adjacent high-contrast gratings, \neven when stimulus-onset asynchrony between surround context and test stimulus was \nincreased to 2000 ms. The variation in scalp distribution of amplitude in response to \nour different conditions may reflect a similar surround suppression effect: Over the \nright posterior scalp, where the effect of condition was most pronounced, amplitude \nwas reduced at PO4 and O2 compared to PO8 in the predictable and random \nconditions, whereas amplitude did not vary across these electrodes in the Target \nAlone condition. It is important to note however, that the surround suppression effect \nobserved in Ohtani et al’s study [14] only altered the amplitude of the visually evoked \nmagnetic responses without any change in the peak-latency. The early ERP latency \neffects associated with target processing are therefore not likely to be related to \nsurround suppression effects in the random and predictable conditions.  \nThe latency-shift at P1 and N1 indicates that speed of target processing is \nfacilitated when the target is embedded within a stimulus sequence defined by \ntemporal or spatiotemporal regularities. It has been established that the latency of \nearly ERP components can be influenced by a range of stimulus parameters, such as \nstimulus contrast on P1 latency [15] and luminance on N1 latency [16], whereas \nlatency of both components is modulated by the type of target used in visual search \ntasks [17]. P1 latency has further been found to decrease during development [17] and \nto increase in old age [18]. Potential influences of any of these factors on the early \nlatency-shift are however not probable given the consistency in task requirements and \nstimulus parameters of the target across the three conditions used in our experiment. \nFurthermore, although P1 amplitude is modulated by spatial attention and arousal \nstate [11, 19, 20], and N1 amplitude is influenced by spatial attention and stimulus \n 11\ndiscrimination [19, 20], these effects are generally reported without a change in \nlatency. In a recent study, Doherty et al [21] further varied spatiotemporal stimulus \nstructures to manipulate participants’ expectation of possible locations for target \npresentation. Although P1 and N1 amplitude was modulated by spatial and\/or \ntemporal attention in their study, no P1 or N1 latency effects were reported beside a \nlateralization effect (shorter P1 latencies over the scalp contralateral to the visual field \nwhere the target appeared). Given these findings, the latency-shift found here is more \nlikely to reflect influences of spatiotemporal regularity on visual target processing that \noccur independently from the established effect of attention on P1 and N1 amplitude. \nThe effect may instead be exclusively associated with the influence of spatiotemporal \nprediction at early visual processing stages in situations where the target stimulus is \nembedded within a coherent sequence of visual events.  \nSpatial resolution limitations of the ERP method make it difficult to associate \nthe latency-shift with specific neural sources. Although it has been noted that a large \nnumber of different visual areas are activated within the first hundred milliseconds \nafter onset of a visual stimulus [22], results of dipole modelling in combination with \nPET have identified neural generator sources for the P1 wave beyond the striate \ncortex, in ventral and occipital regions [23], and potential neural generators for the N1 \nwave were found in the inferior occipital lobe and the occipitotemporal junction with \nconverging imaging methods [24]. Our neurophysiological evidence suggests \ninvolvement of V1 in the coding of spatiotemporal stimulus regularities [9], but the \nrelationship between these findings and the P1 and N1 latency-shift remains to be \nestablished. The timing of the peak-latency differences between predictable and \nrandom sequences (170-235) suggests that this latency-shift is likely the result of \nfeed-backward processes. To establish if influences of regularity in stimulus structure \n 12\ncan be revealed within earlier ERP wave time-windows, the methodology could be \nmodified to reveal the C1 wave (60 – 80 ms), which is assumed to be generated in \narea V1 [23].  \n \n \nREFERENCES \n[1] Knill DC, Richards W. Perception as bayesian inference. Cambridge: \nUniversity Press; 1996. \n[2] Friston K. Functional integration and inference in the brain. Progress in \nNeurobiology 1996; 68: 113-143. \n[3] Kveraga K, Ghuman AS, Bar M. Top-down predictions in the cognitive brain. \nBrain and Cognition 2007; 65: 145-168.   \n[4] Guo K, Nevado A, Robertson RG, Pulgarin M, Thiele A, Young MP. Effects \non orientation perception of manipulating the spatiotemporal prior probability \nof stimuli. Vision Research 2004; 44: 2349-2358. \n[5] Young MP. The architecture of visual cortex and inferential processes in \nvision. Spatial Vision 2000; 13: 137-146. \n[6] Albright TD, Stoner GR. Contextual influences on visual processing. Annual \nReview of Neuroscience 2002; 25: 339-379. \n[7] Sharma J, Dragoi V, Tenenbaum JB, Miller EK, Sur M. V1 Neurons signal \nacquisition of an internal representation of stimulus location. Science 2003; \n300: 1758-1763. \n[8] Guo K, Robertson RG, Mahmoodi S, Young MP. Centre-surround interactions \nin response to natural scene stimulation in the primary visual cortex. European \nJournal of  Neuroscience 2005; 21: 536-548. \n 13\n[9] Guo K, Robertson RG, Pulgarin M, Nevado A, Panzeri S, Thiele A, Young \nMP. Spatio-temporal prediction and inference by V1 neurons. European \nJournal of Neuroscience 2007; 26: 1045-1054. \n[10] Leuthold H, Sommer W, Ulrich R. Preparing for Action: Inferences from \nCNV and LRP. Journal of Psychophysiology 2004; 18: 77-88. \n[11] Mangun GR, Hillyard SA. Spatial gradient of visual attention: behavioral and \nelectrophysiological evidence. Electroencephalography and Clinical \nNeurophysiology 1988, 70, 417-428. \n[12] Ritter W, Simson R, Vaughan H. Event-related potential correlates of two \nstages of information processing in physical and semantic discrimination \ntasks. Psychophysiology 1983; 20: 168-179. \n[13] Li M, Kuroiwa Y, Omoto S, Hotta S, Suzuki Y, Kamitani T et al. The effect of \nstimulus-onset asynchrony on human visual event-related potentials during \nsimple and choice reaction paradigms under constant or random conditions. \nNeuroscience Letters 2003; 345: 109-112. \n[14] Ohtani Y, Okamura S, Yoshikazu Y, Toyama K, Ejima Y. Surround \nsuppression in the human visual cortex: an analysis using \nmagnetoencephalography. Vision Research 2002; 42: 1825-1935. \n[15] Kubová Z, Kuba M, Spekreijse H, Blakemore C. Contrast dependence of \nmotion-onset and pattern-reversal evoked potentials. Vision research 1995; 35: \n197-205. \n[16] Johannes S, Munte TF, Heinze HJ, Mangun GR. Luminance and spatial \nattention effects on early visual processing. Cognitive Brain Research 1995; 2: \n189-205. \n 14\n[17] Taylor MJ. Non-spatial attentional effects on P1. Clinicial Neurophysiology \n2002; 113: 1903-1908. \n[18] Curran T, Hills A, Patterson MB, Strauss ME. Effect of aging on visuospatial \nattention: an ERP study. Neuropsychologia 2001; 39: 288-301. \n[19] Hillyard SA, Vogel EK, Luck SJ. Sensory gain control as a mechanism of \nselective attention. Electrophysiological and neuroimaging evidence. \nPhilosophical Transactions of the Royal Society: Biological Sciences 1998; \n353: 1257-1270.  \n[20] Vogel EK, Luck SJ. The visual N1 component as an index of a discrimination \nprocess. Psychophysiology 2000; 37: 190-203. \n[21] Doherty JR, Rao A, Mesulam M, Nobre C. Synergistic effect of combined \ntemporal and spatial expectation on visual attention. The Journal of \nNeuroscience 2005; 25: 8259-8266. \n[22] Luck SJ. An introduction to the event-related potential technique. Cambridge: \nThe MIT Press; 2005.  \n[23] Clark VP, Fan S, Hillyard SA. Identification of early visual evoked potential \ngenerators by retinotopic and topographic analyses. Human Brain Mapping \n1995, 2, 170-187.  \n[24] Hopf JM, Vogel EK, Woodman G, Heinze HJ, Luck SJ. Localizing visual \ndiscrimination processes in time and space. Journal of Neurophysiology 2002; \n88: 2088-2095. \n 15\nLEGENDS \nFigure 1: Sequence of trial-events as a function of time (milliseconds) and condition \n(Predictable, Random and Target Alone conditions). \n \nFigure 2: Average ERP waveforms for the Predictable, Random and Target Alone \ncondition elicited by the Target bars at PO7\/8, PO3\/4, and O1\/2.  \n 16\nFigure 1 \n \n \n \n \n 17\n18 \n \nFigure 2 \n \n"}