{"doi":"10.1029\/2008JG000787","coreId":"68730","oai":"oai:eprints.lancs.ac.uk:31444","identifiers":["oai:eprints.lancs.ac.uk:31444","10.1029\/2008JG000787"],"title":"Ecohydrologically important subsurface structures in peatlands revealed by ground-penetrating radar and complex conductivity surveys.","authors":["Kettridge, Nicholas","Comas, Xavier","Baird, Andrew","Slater, Lee","Strack, Maria","Thompson, Dan","Jol, Harry","Binley, Andrew"],"enrichments":{"references":[{"id":905052,"title":"A relation between the quadrature component of electrical conductivity and the specific surface area of sedimentary rocks,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":912389,"title":"A simulation model of mire patterning,","authors":[],"date":"1988","doi":"10.2307\/3565529","raw":"Swanson, D. K., and D. F. Grigal (1988), A simulation model of mire patterning, Oikos, 53, 309–314, doi:10.2307\/3565529.","cites":null},{"id":912649,"title":"A study of the geoelectrical properties of peatlands and their influence on ground-penetrating radar surveying,","authors":[],"date":"1994","doi":"10.1111\/j.1365-2478.1994.tb00205.x","raw":"Theimer, B. D., D. C. Nobes, and B. G. Warner (1994), A study of the geoelectrical properties of peatlands and their influence on ground-penetrating radar surveying, Geophys. Prospect., 42, 179–209, doi:10.1111\/ j.1365-2478.1994.tb00205.x. Vanhala, H. (1997), Mapping oil-contaminated sand and till with the spectral induced polarization (SIP) method, Geophys. Prospect., 45, 303–326, doi:10.1046\/j.1365-2478.1997.00338.x. von Post, L., and E. Granlund (1926), Sodra sveriges tortillangar I, Arsb. Sver. Geol. Unders., 335, 1–127.","cites":null},{"id":912684,"title":"An application of ground penetrating radar to peat stratigraphy of Ellice Swamp,","authors":[],"date":"1990","doi":"10.1139\/e90-096","raw":"Warner, B. G., D. C. Nobes, and B. D. Theimer (1990), An application of ground penetrating radar to peat stratigraphy of Ellice Swamp, southwestern Ontario, Can. J. Earth Sci., 27, 932–938.","cites":null},{"id":903690,"title":"Beyond the ‘‘limits to peat bog growth’’: Cross-scale feedback in peatland development,","authors":[],"date":"2006","doi":null,"raw":"Belyea, L. R., and A. J. Baird (2006), Beyond the ‘‘limits to peat bog growth’’: Cross-scale feedback in peatland development, Ecol. Monogr., 76(3), 299– 322, doi:10.1890\/0012-9615(2006)076[0299:BTLTPB]2.0.CO;2.","cites":null},{"id":904196,"title":"Clymo","authors":[],"date":"1982","doi":null,"raw":"Hayward, P. M., and R. S. Clymo (1982), Profiles of water content and pore size in Sphagnum and peat, and their relation to peat bog ecology, Proc. R. Soc. London, Ser. B, 215, 299–325.","cites":null},{"id":911281,"title":"Controls on induced polarization in sandy unconsolidated sediments and application to aquifer characterization,","authors":[],"date":"2003","doi":"10.1190\/1.1620628","raw":"Slater, L., and D.R. Glaser (2003), Controls on induced polarization in sandy unconsolidated sediments and application to aquifer characterization, Geophysics, 68, 1547–1558, doi:10.1190\/1.1620628.","cites":null},{"id":907883,"title":"Cross-borehole IP imaging for engineering and environmental applications,","authors":[],"date":"2004","doi":null,"raw":"Kemna, A., A. Binley, and L. Slater (2004), Cross-borehole IP imaging for engineering and environmental applications, Geophysics, 69, 97–105, doi:10.1190\/1.1649379.","cites":null},{"id":912962,"title":"Depth profiling of peat deposits with impulse","authors":[],"date":"1986","doi":"10.1139\/t86-024","raw":"Worsfold, R. D., S. K. Parashar, and T. Perrot (1986), Depth profiling of peat deposits with impulse radar, Can. Geotech. J., 23, 142–154. A. Baird, Department of Geography, Queen Mary, University of London, Mile End Road, London E1 4NS, UK. A. Binley and N. Kettridge, Lancaster Environment Centre, Lancaster University, Lancaster LA1 4YQ, UK. (n.kettridge@lancaster.ac.uk) X. Comas, Department of Geosciences, Florida Atlantic University, Room 360, 777 Glades Road, Boca Raton, FL 33431, USA. H. Jol, Department of Geography and Anthropology, University of Wisconsin-Eau Claire, 105 Garfield Avenue, P.O. Box 4004, Eau Claire, WI 54702-4004, USA. L. Slater, Department of Earth and Environmental Sciences, Rutgers University, 101 Warren Street, Smith Hall, Newark, NJ 07102, USA. M. Strack, Department of Geography, University of Calgary, Calgary, AB T2N 1N4, Canada.","cites":null},{"id":908985,"title":"Dielectric spectroscopy of sedimentary rocks,","authors":[],"date":"2001","doi":null,"raw":"Lesmes, D. P., and F. D. Morgan (2001), Dielectric spectroscopy of sedimentary rocks, J. Geophys. Res., 106, 13,329–13,346, doi:10.1029\/ 2000JB900402.","cites":null},{"id":904036,"title":"Do hollows control the rate of peat bog growth?,","authors":[],"date":"1998","doi":null,"raw":"Belyea, L. R., and R. S. Clymo (1998), Do hollows control the rate of peat bog growth?, in Patterned Mires and Mire Pools: Proceedings of the 1998 International Conference, edited by V. Standen, J. Tallis, and R. Meade, pp. 55–65, Br. Ecol. Soc., London.","cites":null},{"id":910669,"title":"Evaluation of permeable reactive barrier (PRB) integrity using electrical imaging methods,","authors":[],"date":"2003","doi":"10.1190\/1.1581043","raw":"Slater, L., and A. Binley (2003), Evaluation of permeable reactive barrier (PRB) integrity using electrical imaging methods, Geophysics, 68, 911–921, doi:10.1190\/1.1581043.","cites":null},{"id":905310,"title":"Evaluation of transport and storage properties in the soil and groundwater zone from induced","authors":[],"date":"1996","doi":null,"raw":"Bo ¨rner, F. D., J. R. Schopper, and A. Weller (1996), Evaluation of transport and storage properties in the soil and groundwater zone from induced G04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS 14 of 15 G04030polarization measurements, Geophys. Prospect., 44, 583–601, doi:10.1111\/j.1365-2478.1996.tb00167.x. Comas, X., and L. Slater (2004), Low-frequency electrical properties of peat, Water Resour. Res., 40, W12414, doi:10.1029\/2004WR003534.","cites":null},{"id":908694,"title":"Frye (2001), Influence of pore fluid chemistry on the complex conductivity and induced-polarization responses of Berea sandstone,","authors":[],"date":null,"doi":null,"raw":"Lesmes, D. P., and K. M. Frye (2001), Influence of pore fluid chemistry on the complex conductivity and induced-polarization responses of Berea sandstone, J. Geophys. Res., 106, 4079–4090, doi:10.1029\/ 2000JB900392.","cites":null},{"id":905582,"title":"Geophysical evidence for peat basin morphology and lithologic controls on vegetation observed in a northern peatland,","authors":[],"date":"2004","doi":null,"raw":"Comas, X., L. Slater, and A. Reeve (2004), Geophysical evidence for peat basin morphology and lithologic controls on vegetation observed in a northern peatland, J. Hydrol. Amsterdam, 295, 173–184, doi:10.1016\/ j.jhydrol.2004.03.008.","cites":null},{"id":907625,"title":"Ground penetrating radar of northern lacustrine deltas,","authors":[],"date":"1991","doi":null,"raw":"Jol, H. M., and D. G. Smith (1991), Ground penetrating radar of northern lacustrine deltas, Can. J. Earth Sci., 28, 1939–1947.","cites":null},{"id":909602,"title":"Ground-penetrating radar and its use in sedimentology: Principles, problems and progress,","authors":[],"date":"2004","doi":null,"raw":"Neal, A. (2004), Ground-penetrating radar and its use in sedimentology: Principles, problems and progress, Earth Sci. Rev., 66, 261–330, doi:10.1016\/j.earscirev.2004.01.004.","cites":null},{"id":910399,"title":"History, Theory and Data Acquisition,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":16710988,"title":"History, Theory and Data Acquisition,C a m b r i d g eU n i v .P r e s s ,N e w","authors":[],"date":"1982","doi":null,"raw":"Sheriff, R. E., and L. P. Geldart (1982), Exploration Seismology, vol. 1, History, Theory and Data Acquisition,C a m b r i d g eU n i v .P r e s s ,N e w York.","cites":null},{"id":904511,"title":"Inferring landscape dynamics of bog pools from scaling relationships and spatial patterns,","authors":[],"date":"2002","doi":null,"raw":"Belyea, L. R., and J. Lancaster (2002), Inferring landscape dynamics of bog pools from scaling relationships and spatial patterns, J. Ecol., 90, 223–234, doi:10.1046\/j.1365-2745.2001.00647.x. Binley, A., and A. Kemna (2005), Electrical methods, in Hydrogeophysics, edited by Y. Rubin and S. S. Hubbard, pp. 129–156, Springer, Dordt, Netherlands.","cites":null},{"id":911824,"title":"Investigating peatland stratigraphy and hydrogeology using integrated electrical geophysics,","authors":[],"date":"2002","doi":"10.1190\/1.1468597","raw":"Slater, L., and A. Reeve (2002), Investigating peatland stratigraphy and hydrogeology using integrated electrical geophysics, Geophysics, 67, 365–378, doi:10.1190\/1.1468597.","cites":null},{"id":911520,"title":"IP interpretation in environmental investigations,","authors":[],"date":"2002","doi":"10.1190\/1.1451353","raw":"Slater, L., and D. Lesmes (2002), IP interpretation in environmental investigations, Geophysics, 67, 77–88, doi:10.1190\/1.1451353.","cites":null},{"id":909268,"title":"Litter decomposition in temperate peatland ecosystems: The effect of substrate and site,","authors":[],"date":"2007","doi":null,"raw":"Moore, T. R., J. L. Bubier, and L. Bledzki (2007), Litter decomposition in temperate peatland ecosystems: The effect of substrate and site, Ecosystems, 10, 949–963, doi:10.1007\/s10021-007-9064-5.","cites":null},{"id":907089,"title":"Measuring soil water content with ground penetrating radar: A review,","authors":[],"date":"2003","doi":null,"raw":"Huisman, J. A., S. S. Hubbard, J. D. Redman, and A. P. Annan (2003), Measuring soil water content with ground penetrating radar: A review, Vadose Zone J., 2, 476–491.","cites":null},{"id":906606,"title":"Modeling northern peatland decomposition and peat accumulation,","authors":[],"date":"2001","doi":null,"raw":"Frolking,S.,N.T.Roulet,T.R.Moore,P.J.H.Richard,M.Lavoie,andS.D. Muller (2001), Modeling northern peatland decomposition and peat accumulation, Ecosystems, 4, 479–498, doi:10.1007\/s10021-001-0105-1.","cites":null},{"id":912065,"title":"Moulik (2007), Resistivity-based monitoring of biogenic gases in peat soils, Water Resour.","authors":[],"date":null,"doi":"10.1029\/2007WR006090","raw":"Slater, L., X. Comas, D. Ntarlagiannis, and M. R. Moulik (2007), Resistivity-based monitoring of biogenic gases in peat soils, Water Resour.","cites":null},{"id":906094,"title":"Occam’s inversion: A practical algorithm for generating smooth models from electromagnetic sounding data,","authors":[],"date":"1987","doi":null,"raw":"Constable, S. C., R. L. Parker, and C. G. Constable (1987), Occam’s inversion: A practical algorithm for generating smooth models from electromagnetic sounding data, Geophysics, 52, 289–300, doi:10.1190\/ 1.1442303.","cites":null},{"id":903420,"title":"Peat Stratigraphy and Climate Change: A Palaeoecological Test of the Theory of Cyclic Peat Bog Regeneration,","authors":[],"date":"1981","doi":null,"raw":"Barber, K. (1981), Peat Stratigraphy and Climate Change: A Palaeoecological Test of the Theory of Cyclic Peat Bog Regeneration, A. A. Balkema, Rotterdam, Netherlands.","cites":null},{"id":904786,"title":"Physical properties of peats as related to degree of decomposition,","authors":[],"date":"1969","doi":null,"raw":"Boelter, D. H. (1969), Physical properties of peats as related to degree of decomposition, Soil Sci. Soc. Am. Proc., 33, 606–609.","cites":null},{"id":16710909,"title":"Scho ¨n","authors":[],"date":"1991","doi":null,"raw":"Bo ¨rner, F. D., and J. H. Scho ¨n (1991), A relation between the quadrature component of electrical conductivity and the specific surface area of sedimentary rocks, Log Anal., 32, 612–613.","cites":null},{"id":913221,"title":"School of Geography and Earth Sciences,","authors":[],"date":null,"doi":null,"raw":"D. Thompson, School of Geography and Earth Sciences, McMaster University, 1280 Main Street West, Hamilton, ON L8S 4K1, Canada. G04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS 15 of 15 G04030","cites":null},{"id":906044,"title":"Seasonal geophysical monitoring of biogenic gasses in a northern peatland: Implications for temporal and spatial variability in free phase gas production rates,","authors":[],"date":"2008","doi":null,"raw":"Comas, X., L. Slater, and A. Reeve (2008), Seasonal geophysical monitoring of biogenic gasses in a northern peatland: Implications for temporal and spatial variability in free phase gas production rates, J. Geophys.","cites":null},{"id":906340,"title":"Self-organisation in raised bog patterning: The origin of microtope zonation and mesotope diversity,","authors":[],"date":"2005","doi":null,"raw":"Couwenberg, J., and H. Joosten (2005), Self-organisation in raised bog patterning: The origin of microtope zonation and mesotope diversity, J. Ecol., 93, 1238–1248, doi:10.1111\/j.1365-2745.2005.01035.x. Davis, R. B., and D. S. Anderson (2001), Classification and distribution of freshwater peatlands in Maine, Northeast. Nat., 8, 1–50.","cites":null},{"id":903154,"title":"Shallow horizontal groundwater flow in peatlands is reduced by bacteriogenic gas production,","authors":[],"date":"2003","doi":null,"raw":"Baird, A. J., and S. Waldron (2003), Shallow horizontal groundwater flow in peatlands is reduced by bacteriogenic gas production, Geophys. Res. Lett., 30(20), 2043, doi:10.1029\/2003GL018233.","cites":null},{"id":910159,"title":"Software","authors":[],"date":"1998","doi":null,"raw":"Sensors and Software (1998), Ground Penetrating Radar Workshop Notes, Mississauga, Ontario, Canada.","cites":null},{"id":907363,"title":"Soil layers in mires: Function and terminology,","authors":[],"date":"1978","doi":null,"raw":"Ingram, H. A. P. (1978), Soil layers in mires: Function and terminology, J. Soil Sci., 29, 224–227, doi:10.1111\/j.1365-2389.1978.tb02053.x. Jol, H. M., and C. S. Bristow (2003), GPR in sediments: Advice on data collection, basic processing and interpretation, a good practice guide, in GPR in Sediments, edited by C. S. Bristow and H. M. Jol, Geol. Soc. Spec. Publ., 211, 9–27.","cites":null},{"id":905828,"title":"Stratigraphic controls on pool formation in a domed bog inferred from ground penetrating radar","authors":[],"date":"2005","doi":null,"raw":"Comas, X., L. Slater, and A. Reeve (2005), Stratigraphic controls on pool formation in a domed bog inferred from ground penetrating radar (GPR), J. Hydrol. Amsterdam, 315, 40–51, doi:10.1016\/j.jhydrol.2005.04.020.","cites":null},{"id":911015,"title":"Synthetic and field-based electrical imaging of a zerovalent iron barrier: Implications for monitoring long-term barrier performance,","authors":[],"date":"2006","doi":"10.1190\/1.2235931","raw":"Slater, L., and A. Binley (2006), Synthetic and field-based electrical imaging of a zerovalent iron barrier: Implications for monitoring long-term barrier performance, Geophysics, 71, 129–137, doi:10.1190\/1.2235931.","cites":null},{"id":909871,"title":"The Biology of Peatlands,","authors":[],"date":"2006","doi":null,"raw":"Rydin, H., and J. K. Jeglum (2006), The Biology of Peatlands, Oxford Univ. Press, Oxford, U.K. Scoggan, H. J. (1978), The Flora of Canada, Natl. Mus. of Can., Ottawa.","cites":null},{"id":909842,"title":"The characterization of bogs using ground penetrating radar, Open File Rep.","authors":[],"date":"1991","doi":null,"raw":"Nobes, D. C., and B. G. Warner (1991), The characterization of bogs using ground penetrating radar, Open File Rep. 5778,O n t .G e o l .S u r v . , Toronto, Ont., Canada.","cites":null},{"id":908133,"title":"The effects of noise on Occam’s inversion of resistivity tomography data,","authors":[],"date":"1996","doi":null,"raw":"LaBrecque, D. J., M. Miletto, W. Daily, A. Ramirez, and E. Owen (1996), The effects of noise on Occam’s inversion of resistivity tomography data, Geophysics, 61, 538–548, doi:10.1190\/1.1443980.","cites":null},{"id":902879,"title":"The electrical resistivity log as an aid in determining some reservoir characteristics,","authors":[],"date":"1942","doi":null,"raw":"Archie, G. E. (1942), The electrical resistivity log as an aid in determining some reservoir characteristics, Trans. Am. Inst. Min. Metall. Pet. Eng., 164, 54–62.","cites":null},{"id":908395,"title":"Using ground-penetrating radar to delineate subsurface features along a wetland catena,","authors":[],"date":"1996","doi":null,"raw":"Lapen, D., B. Moorman, and J. Price (1996), Using ground-penetrating radar to delineate subsurface features along a wetland catena, Soil Sci. Soc. Am. Proc., 60, 923–931.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-12-16","abstract":"The surface pattern of vegetation influences the composition and humification of peat laid down during the development of a bog, producing a subsurface hydrological structure that is expected to affect both the rate and pattern of water flow. Subsurface peat structures are routinely derived from the inspection of peat cores. However, logistical limits on the number of cores that can be collected means that the horizontal extent of these structures must be inferred. We consider whether subsurface patterns in peat physical properties can be mapped in detail over large areas with ground-penetrating radar (GPR) and complex conductivity by comparing geophysical measurements with peat core data along a 36 m transect through different microhabitats at Caribou Bog, Maine. The geophysical methods show promise. Peat horizons produced radar reflections because of changes in the volumetric moisture content. Although these reflections could not be directly correlated with the peat core data, they were related to the depth-averaged peat properties which varied markedly between the microhabitats. Well-decomposed peat below a hollow was characterized by a discontinuous sequence of chaotic wavy reflections, while distinct layering of the peat below an area of hummocks coincided with a pattern of parallel planar reflections. The complex conductivity survey showed spatial variation in the real and imaginary conductivities which resulted from changes in the pore water conductivity; peat structures may also have influenced the spatial pattern in the complex conductivity. The GPR and complex conductivity surveys enabled the developmental history of the different microhabitats along the studied transect to be inferred","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68730.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31444\/1\/2008JG000787.pdf","pdfHashValue":"539f9fc8233a393e5ec39af14c01c7bdaac374ea","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31444<\/identifier><datestamp>\n      2018-01-24T02:55:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ecohydrologically important subsurface structures in peatlands revealed by ground-penetrating radar and complex conductivity surveys.<\/dc:title><dc:creator>\n        Kettridge, Nicholas<\/dc:creator><dc:creator>\n        Comas, Xavier<\/dc:creator><dc:creator>\n        Baird, Andrew<\/dc:creator><dc:creator>\n        Slater, Lee<\/dc:creator><dc:creator>\n        Strack, Maria<\/dc:creator><dc:creator>\n        Thompson, Dan<\/dc:creator><dc:creator>\n        Jol, Harry<\/dc:creator><dc:creator>\n        Binley, Andrew<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        The surface pattern of vegetation influences the composition and humification of peat laid down during the development of a bog, producing a subsurface hydrological structure that is expected to affect both the rate and pattern of water flow. Subsurface peat structures are routinely derived from the inspection of peat cores. However, logistical limits on the number of cores that can be collected means that the horizontal extent of these structures must be inferred. We consider whether subsurface patterns in peat physical properties can be mapped in detail over large areas with ground-penetrating radar (GPR) and complex conductivity by comparing geophysical measurements with peat core data along a 36 m transect through different microhabitats at Caribou Bog, Maine. The geophysical methods show promise. Peat horizons produced radar reflections because of changes in the volumetric moisture content. Although these reflections could not be directly correlated with the peat core data, they were related to the depth-averaged peat properties which varied markedly between the microhabitats. Well-decomposed peat below a hollow was characterized by a discontinuous sequence of chaotic wavy reflections, while distinct layering of the peat below an area of hummocks coincided with a pattern of parallel planar reflections. The complex conductivity survey showed spatial variation in the real and imaginary conductivities which resulted from changes in the pore water conductivity; peat structures may also have influenced the spatial pattern in the complex conductivity. The GPR and complex conductivity surveys enabled the developmental history of the different microhabitats along the studied transect to be inferred.<\/dc:description><dc:date>\n        2008-12-16<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31444\/1\/2008JG000787.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2008JG000787<\/dc:relation><dc:identifier>\n        Kettridge, Nicholas and Comas, Xavier and Baird, Andrew and Slater, Lee and Strack, Maria and Thompson, Dan and Jol, Harry and Binley, Andrew (2008) Ecohydrologically important subsurface structures in peatlands revealed by ground-penetrating radar and complex conductivity surveys. Journal of Geophysical Research: Biogeosciences, 113. ISSN 2169-8961<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31444\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2008JG000787","http:\/\/eprints.lancs.ac.uk\/31444\/"],"year":2008,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"Ecohydrologically important subsurface structures in peatlands\nrevealed by ground-penetrating radar and complex\nconductivity surveys\nNicholas Kettridge,1 Xavier Comas,2 Andrew Baird,3 Lee Slater,4 Maria Strack,5\nDan Thompson,6 Harry Jol,7 and Andrew Binley1\nReceived 15 May 2008; accepted 1 October 2008; published 16 December 2008.\n[1] The surface pattern of vegetation influences the composition and humification of peat\nlaid down during the development of a bog, producing a subsurface hydrological structure\nthat is expected to affect both the rate and pattern of water flow. Subsurface peat\nstructures are routinely derived from the inspection of peat cores. However, logistical\nlimits on the number of cores that can be collected means that the horizontal extent of\nthese structures must be inferred. We consider whether subsurface patterns in peat\nphysical properties can be mapped in detail over large areas with ground-penetrating radar\n(GPR) and complex conductivity by comparing geophysical measurements with peat core\ndata along a 36 m transect through different microhabitats at Caribou Bog, Maine. The\ngeophysical methods show promise. Peat horizons produced radar reflections because of\nchanges in the volumetric moisture content. Although these reflections could not be\ndirectly correlated with the peat core data, they were related to the depth-averaged peat\nproperties which varied markedly between the microhabitats. Well-decomposed peat\nbelow a hollow was characterized by a discontinuous sequence of chaotic wavy\nreflections, while distinct layering of the peat below an area of hummocks coincided with\na pattern of parallel planar reflections. The complex conductivity survey showed spatial\nvariation in the real and imaginary conductivities which resulted from changes in the pore\nwater conductivity; peat structures may also have influenced the spatial pattern in the\ncomplex conductivity. The GPR and complex conductivity surveys enabled the\ndevelopmental history of the different microhabitats along the studied transect to be\ninferred.\nCitation: Kettridge, N., X. Comas, A. Baird, L. Slater, M. Strack, D. Thompson, H. Jol, and A. Binley (2008), Ecohydrologically\nimportant subsurface structures in peatlands revealed by ground-penetrating radar and complex conductivity surveys, J. Geophys. Res.,\n113, G04030, doi:10.1029\/2008JG000787.\n1. Introduction and Aim of the Research\n1.1. Background\n[2] Peatlands are prototypical ecohydrological systems.\nThe pattern of vegetation at the peatland surface controls,\nand is controlled by, hydrological factors. For example, the\ndistribution of different plant species in raised bogs shows a\nclose correspondence with water table position so that\n‘‘microhabitats’’ such as hummocks, lawns, hollows, and\npools [cf. Belyea and Clymo, 1998] have distinctive\nassemblages of plants and distinctive hydrological regimes.\nHummocks tend to contain small-leaved Sphagna and a\nrelatively high cover of sedges and ericaceous shrubs, while\nlawns and hollows usually contain a lower cover of vascular\nplants with a high cover of large-leaved Sphagna. However,\necohydrological linkages in peatlands go beyond simple\nrelationships between hydrological regime and the assem-\nblage of plant species.\n[3] Different plant communities in peatlands lay down\nlitter or peat of different physical properties which becomes\nincorporated into the main body of the peat as the peatland\ngrows. These different peats may exert an influence on the\necohydrological functioning of the peatland long after the\npeat was formed. It has been suggested, for example, that in\nhumid temperate bogs, peat formed in hummocks has a\nlower permeability than peat formed in hollows because the\nplant litter that forms the peat in hummocks spends longer\nabove the water table and is therefore more decomposed\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 113, G04030, doi:10.1029\/2008JG000787, 2008\nClick\nHere\nfor\nFull\nArticle\n1Lancaster Environment Centre, Lancaster University, Lancaster, UK.\n2Department of Geosciences, Florida Atlantic University, Boca Raton,\nFlorida, USA.\n3Department of Geography, Queen Mary, University of London,\nLondon, UK.\n4Department of Earth and Environmental Sciences, Rutgers University,\nNewark, New Jersey, USA.\n5Department of Geography, University of Calgary, Calgary, Alberta,\nCanada.\n6School of Geography and Earth Sciences, McMaster University,\nHamilton, Ontario, Canada.\n7Department of Geography and Anthropology, University of\nWisconsin-Eau Claire, Eau Claire, Wisconsin, USA.\nCopyright 2008 by the American Geophysical Union.\n0148-0227\/08\/2008JG000787$09.00\nG04030 1 of 15\nthan the litter in hollows [cf. Belyea and Baird, 2006; see\nalso Boelter, 1969]. The degree of decomposition of peat\nwill also vary according to the plant species making up the\npeat, with peat containing vascular plant remains often\nbeing more decomposable than that containing Sphagnum\nremains [cf. Frolking et al., 2001; Moore et al., 2007]. If\nhummocks persist in the peatland landscape, the peat laid\ndown in them may form ‘‘columns’’ of lower-permeability\npeat. If hummocks coalesce to form ridges, the lower-\npermeability peat may form curtain-like structures in the\npeat deposit [Belyea and Baird, 2006]. The pattern of lower-\nand higher-permeability peat in the peat deposit can be\nexpected to affect both rates and patterns of water flow\nthrough the peat and, therefore, the spatial pattern of\nhydrological regimes (e.g., water table regime) across the\npeatland [Belyea and Baird, 2006], which in turn may affect\nthe patterning of vegetation. Such ecohydrological feed-\nbacks have been explored numerically by Swanson and\nGrigal [1988] and Couwenberg and Joosten [2005], who\nused simple cellular models to show that complex patterns\nof vegetation and of peat transmissivity may emerge from\nrelatively simple interactions between vegetation type and\nwater table position. However, a problem of such studies is\nthat they have not been tested with field data. Although\nsome paleoecological work has shown the spatial continuity\nof structures within bodies of peat [e.g., Barber, 1981], such\nwork relies on the inspection of faces of peat in peatlands\nthat are being cut for peat. Most studies of the subsurface\nproperties of peat use a relatively small number of boreholes\n(several tens of holes) in which vertical changes in peat type\nare mapped but from which horizontal variations can only\nbe inferred (if boreholes are constructed along transects).\n[4] To test models such as those of Swanson and Grigal\n[1988] and Couwenberg and Joosten [2005] and to improve\nunderstanding of how subsurface structures within a peat\ndeposit might affect patterns of water flow, it would be very\nuseful if the peat could be mapped noninvasively and in\ndetail over large areas. In theory, information about the level\nof decomposition of the peat can be obtained using geo-\nphysical methods such as ground-penetrating radar (GPR)\nand complex conductivity.\n1.2. Ground-Penetrating Radar\n[5] GPR is a geophysical technique for noninvasively\nidentifying changes in the dielectric permittivity between\nsoil layers [e.g., Huisman et al., 2003]. A transmitting\nantenna generates a high-frequency electromagnetic (EM)\nwave that penetrates the subsurface and returns to a receiv-\ning antenna as a sequence of reflections from the boundaries\nbetween materials with contrasting EM properties, such as\nthe boundary between different types of peat or peats with\ndifferent levels of saturation. The velocity of this EM wave\nis primarily controlled by the relative dielectric permittivity.\nTwo types of commonly applied GPR reflection surveys are\n(1) the common offset, where a fixed spacing is maintained\nbetween antennae as they are moved stepwise at fixed\nintervals along a transect, and (2) the common midpoint\n(CMP) gather, where the antennae are sequentially moved\napart at fixed intervals on either side of the measurement\nposition. Common offset measurements are used to con-\nstruct a transect of the changing physical properties through\nthe ground, recorded as a sequence of reflections in time at\neach measurement position along the transect. CMP surveys\nare commonly used to determine the subsurface velocity of\nthe EM wave. With knowledge of the subsurface velocity,\nthe depth of the reflections identified in the common offset\nmeasurements can be calculated. In addition, the subsurface\nvelocity can provide a bulk measure of the dielectric\npermittivity of the peat and can be attributed to changes\nin peat porosity or saturation [Comas et al., 2008] (see Jol\nand Bristow [2003] and Neal [2004] for further details on\nsurvey geometry and applications).\n[6] GPR has been used for peat deposit profiling for more\nthan 20 years, proving very useful for characterizing the\noverall depth of peat deposits and the suborganic lithology\n[Worsfold et al., 1986; Jol and Smith, 1991; Nobes and\nWarner, 1991; Lapen et al., 1996]. The boundary between\nthe peat and the underlying mineral sediment is clearly\nidentifiable because of the strong EM wave reflection\nresulting from the sharp reduction in the volumetric mois-\nture content between the peat and the underlying mineral\nsoil [e.g., Comas et al., 2004]. This strong EM reflection\nenables the peat depth to be mapped at a high spatial\nresolution [Worsfold et al., 1986]. However, the stratigraphic\ninformation on the peat profile that can be obtained from\nGPR measurements is less clear. Radar reflection profiles\nwithin peat often show a pattern of reflections [cf. Comas et\nal., 2004]. Theimer et al. [1994] suggested that these\nreflections strongly match variations in peat moisture con-\ntent (although no radar profiles were presented). However,\nWarner et al. [1990] could only identify the boundary\nbetween uppermost poorly decomposed peat (‘‘acrotelm’’)\nand underlying well-decomposed peat (‘‘catotelm’’) [cf.\nIngram, 1978], and Worsfold et al. [1986] suggested a lack\nof correlation between peat properties and radar reflections.\n[7] Although the identification of the boundaries between\nindividual peat horizons from GPR measurements may\nprove problematic, the potential of GPR to identify the\ndevelopmental history of different parts of a peatland has\nnot been evaluated. For example, the reflection profile of an\narea of peatland that has shown numerous switches between\ndifferent microhabitats may contrast clearly with the reflec-\ntion profile of a microhabitat that has persisted over the\ndevelopment of the bog. Therefore, instead of attempting to\nproduce direct correlations between the location of peat\nhorizons and EM reflections [e.g., Worsfold et al., 1986],\nGPR may be applied to identify different ‘‘developmental\nzones’’ of peat.\n1.3. Complex Conductivity\n[8] The complex conductivity, s*, of a material is com-\nposed of the in-phase (real) conductivity, s0, and out-of-\nphase (imaginary) conductivity, s00:\ns* ¼ s0 þ is00; ð1Þ\nwhere i =\nffiffiffiffiffiffi\u00061p . The real conductivity is a measure of how\nstrongly a material supports the flow of electrical current,\nand the imaginary conductivity is a measure of the\npolarization, the storage of electrical charge.\n1.3.1. Real Conductivity\n[9] Below the water table, the real conductivity of peat\ndepends on the pore fluid conductivity, the biogenic gas\ncontent (i.e., degree of saturation), and the physical prop-\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n2 of 15\nG04030\nerties of the peat matrix (porosity and surface area)\n[Theimer et al., 1994; Comas and Slater, 2004; Slater et\nal., 2007]. The commonly applied parallel electrolytic and\nsurface conduction model may be used for defining the\nrelationship between these properties [e.g., Comas and\nSlater, 2004] for peat soils:\ns0 ¼ qmeffSnsw þ ssurf ; ð2Þ\nwhere qeff is the effective porosity, S is the saturation, sw is\nthe pore fluid conductivity, ssurf is the surface conductivity\n(conduction within the electrical double layer that forms at\nthe solid-fluid interface), n is the saturation exponent, and m\nis the ‘‘cementation’’ factor, which depends on the shape of\nthe pores and their interconnectedness. The first term on the\nright side of equation (2), Archie’s law [Archie, 1942],\naccounts for the electrolytic current flow through the pore\nwater. Although Archie’s law has been parameterized for\nnumerous geological materials, few attempts have been\nmade to parameterize the equation for organic soils. Slater\net al. [2007] suggest that a value for the saturation exponent\nof \b1.3 is appropriate for poorly decomposed Sphagnum\npeat. However, they emphasize the approximate nature of\nthis value, with the need for future laboratory experiments\nto constrain it further.\n[10] Comas and Slater [2004] show that the first term on\nthe right side of equation (2) must be adapted to simulate\nthe electrical properties of peat under varying pore water\nconductivities. Their adapted equation accounts for the\ndilation of the pore space resulting from the flocculation\nof humic acids located on the surface of the peat fibers.\nThey also suggest that the surface conduction component\n(ssurf ; equation (2)) can be approximated by its linear depen-\ndence on the imaginary conductivity, s00 (section 1.3.2). The\nadapted version of equation (2), with the exclusion of qeff\nm\nand Sn, is\ns0 ¼ sel þ ssurf ¼ Asbw þ Cs00 swð Þ; ð3Þ\nwhere sel is the electrolytic conduction and A, b, and C are\nconstants. Comas and Slater [2004] found that A equaled\n1.29, b equaled 1.42, and C equaled 63 for a peat sample\ncollected at a depth of 1.0–1.25 m at Caribou Bog, Maine,\nUSA. Although this model accurately simulates s0 of\nComas and Slater’s [2004] calibration samples, the model\nhas not been widely evaluated and thus should only be\napplied with some caution. For example, the model failed to\nsimulate conductivity measurements obtained by Slater et\nal. [2007], possibly because the peat type looked at differed\nsubstantially from the peat types studied by Comas and\nSlater [2004].\n1.3.2. Imaginary Conductivity\n[11] The s00 is a measure of the storage of charge in the\nelectrical double layer that forms at the solid-fluid interface.\nUnlike s0, which aggregates the electrolytic and surface\nconduction into a single measure of conductivity (equation\n(2)), s00 is a function solely of the interfacial surface. The s00\ntherefore offers an additional, more distinct, measure of the\nstructural attributes of a material than s0 and may improve\nthe distinction between different peat types. Although the\ndependence of s00 on the structural attributes of different\npeat soils has not been examined, the dependence of s00 on\nthe surface area per unit pore volume [Bo¨rner and Scho¨n,\n1991; Bo¨rner et al., 1996; Slater and Glaser, 2003] or the\neffective grain size [Vanhala, 1997; Slater and Lesmes,\n2002] has been well established within mineral soils, and\nthe approach has been applied within field investigations to\ndifferentiate between lithologies not distinguishable with s0\n[see, e.g., Slater and Lesmes, 2002]. However, s00 is also a\nfunction of the surface charge density and surface ionic\nmobility within the interfacial boundary [Lesmes and Mor-\ngan, 2001], with their associated dependence on the pore\nfluid composition and concentration [Slater and Lesmes,\n2002]. Whereas the dependence of s00 on sw is minimal for\ninorganic soils and sandstone [Lesmes and Frye, 2001], a\npower law dependence of s00 on sw with an exponent \b0.5\nwas identified for peat soils obtained from Caribou Bog,\nMaine [Comas and Slater, 2004]. Therefore, changes in s00\ncannot be attributed solely to structural variations, such as\nthe surface area per unit pore volume, in peat soils.\n1.3.3. Complex Conductivity Surveys\n[12] An electrical survey reconstructs the 2-D or 3-D\ncomplex conductivity distribution of the subsurface from a\nlarge number of four-electrode resistance measurements\n(resistance being the reciprocal of conductance). Two elec-\ntrodes are used to produce an electrical circuit through the\npeat, and a further two electrodes are used to measure the\npotential difference that results from the current injection.\nComplex conductivity surveys performed in the frequency\ndomain inject an alternating current between the electrodes\nand measure the phase-shifted voltage relative to this\ninjected current. Measured currents and voltages are subse-\nquently converted to an apparent complex electrical con-\nductivity by means of the ‘‘geometric factor’’ that accounts\nfor the spatial arrangement of the four electrodes. This\napparent complex conductivity is represented by the con-\nductivity magnitude, jsj, and phase angle, f (shift between\nthe injected current and measured potential):\ns0 ¼ jsj cosf; ð4Þ\ns00 ¼ jsj sinf: ð5Þ\nThe subsurface conductivity distribution is calculated by\nfinding the parameterization of a model of subsurface\ncomplex conductivity that produces the best predictions of\nthe measured apparent complex conductivities. This process\nof model parameterization is called inverse modeling.\n[13] Surveys performed in the time domain measure the\npolarization of the ground by abruptly stopping the injection\nof current and measuring the subsequent decay in the\npotential with time. The decay curve is integrated between\ntwo points to provide a measure of polarization, the charge-\nability, which is dependent upon the measurement settings\nof the time domain instrument. To allow inverse modeling\n(‘‘inversion’’) of the complex conductivity, measured char-\ngeabilities can be converted into the frequency domain by\nassuming proportionality between the chargeability and\nphase angle. Proportionality between chargeability and\nphase angles is both theoretically and experimentally well\nestablished [e.g., Lesmes and Frye, 2001; Slater and\nLesmes, 2002], and the approach has been successfully\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n3 of 15\nG04030\napplied to invert 2-D time domain data sets using complex\nconductivity inversions [Slater and Binley, 2003, 2006]. In\ncomparison to the frequency method [see Binley and\nKemna, 2005], the approach produces scaled images of\ns00, the proportionality constant being dependent on the\nmeasurement settings of the time domain instrument. The\nimages thus obtained from the complex conductivity inver-\nsion faithfully record the relative changes in phase and s00\nwithin the subsurface (for details see Slater and Binley\n[2003]).\n[14] Low-resolution conductivity surveys (electrode spac-\ning 1.5–5 m) have been used to analyze the large-scale\nstratigraphy of northern peatlands, notably, the identifica-\ntion of the boundary between the peat and the underling\nmineral sediment and suborganic soil lithology [Slater and\nReeve, 2002; Comas et al., 2004]. These surveys suggest\nthat s0 is horizontally uniform and may increase with depth\nthrough the peat and that the s00 of the peat remains constant\nin all spatial directions. However, spatial variations in the\npeat properties will occur at a scale far smaller than that\nwhich can be resolved from these large-scale measurements,\nincluding at the scale of the different microhabitats dis-\ncussed in section 1.1 (100–101 m). These small-scale spatial\nvariations in electrical properties of the peat will be aver-\naged by large-scale complex conductivity surveys. Varia-\ntions in the real and imaginary conductivities associated\nwith changing peat structures across microhabitats have\ntherefore not previously been examined.\n1.4. Aim\n[15] Peat properties may show important variations in the\nlevel of decomposition between different microhabitats. As\npostulated in section 1.1, the resultant spatial variations in\npeat permeabilities can be expected to affect the spatial\npattern of hydrological regimes, which in turn may affect\nthe patterning of vegetation. The aim of this study was to\ntest whether changes in the dielectric permittivity, identified\nfrom ground-penetrating radar, or the real and imaginary\nconductivities, identified from a complex conductivity sur-\nvey, could identify differences in the physical properties of\npeat formed under different microhabitats. If the methods\nare successful in this respect, they will prove of enormous\nvalue in future studies of the ecohydrological functioning of\npeatlands, as noted at the end of section 1.1.\n2. Experimental Design and Methods\n2.1. Study Site\n[16] The experimental work was carried out at Caribou\nBog, a 2200 ha peatland situated near Bangor, Maine, USA\n(inset in Figure 1a). The study area was part of the largest of\nthree units that comprise the bog, the central unit. This unit,\nwhich covers approximately 3.6 km2, has a topography and\nstratigraphy characteristic of an eccentric bog [Davis and\nAnderson, 2001], with peat thicknesses reaching 12 m in\nplaces, and is characterized by sharp changes in vegetation\npatterns and the presence of open pools [Comas et al.,\n2005]. The area chosen for study comprised a wet Sphag-\nnum lawn and hollow surrounded by drier microhabitats\n(Figure 1b). A 36 m transect (Figure 1) was constructed so\nthat it passed through the center of the lawn and hollow. The\nfirst 16 m of the transect was in a relatively dry microhabitat\ndominated by small hummocks with a high cover of shrubs\n(Table 1). The next 12 m was through the lawn and hollow\nwith a high cover of Sphagnum mosses and a general lack\nof shrubs, with the last 8 m in another relatively dry area\ndominated by a spruce-tamarack thicket (Table 1). The site\nwas chosen because of the contrasting habitats; it was\nthought that if the habitats had differences in their devel-\nopmental histories [Belyea and Clymo, 2001], there might\nbe a clear contrast between the properties of the peats\nformed under them, making the site suitable for testing\nhow well the different geophysical methods could detect\ndifferences in peat type.\n2.2. Ground-Penetrating Radar Survey\n[17] GPR measurements were collected using a Sensors\nand Software pulseEKKO system, with each measurement\nFigure 1. Location of Caribou Bog and the study site.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n4 of 15\nG04030\nstacked 16 times to increase the signal-to-noise ratio.\nCommon offset measurements were collected with\n200 MHz antennae, with an antenna separation of 0.5 m, at\nintervals of 0.1 m along the transect. This frequency provided\na high measurement resolution while maintaining strong\nsignal strength through the studied peat profile. Minimal\nprocessing was applied to the resultant GPR data. A time-\nvarying gain equalized the amplitude of reflections with\ndepth, accounting for the attenuation of the EM wave. A\n‘‘dewow’’ filter removed low-frequency noise and a time\nzero static correction was applied to correct for drift in the\nposition of the time zero between traces [Sensors and\nSoftware, 1998; Jol and Bristow, 2003].\n[18] CMP gathers were collected with 100 MHz antennae\nat 8, 17, and 25 m along the transect (CMP1, CMP2, and\nCMP3, respectively). The 100 MHz antenna provided the\nnecessary measurement depth to identify the peat-mineral\ninterface (at a depth of approximately 9–10 m), used as the\nhorizontal reflector to calculate the velocity, v, of the EM\nwave (Figure 2). The choice of the location of the CMP\ngathers was based on the distribution of wetter lawn and\nhollow areas (CMP2 in Figure 3a) and the surrounding drier\nmicrohabitats (CMP1 and CMP3 in Figure 3a). The average\nv of the peat column from surface to mineral soil was\nobtained by fitting the first arrivals of the reflected wavelet\ncorresponding to the mineral soil reflector with the normal\nmoveout hyperbola (or difference between travel time of the\nEM wave between transmitter and receiver at a given\nantenna separation) using a least squares routine [Neal,\n2004].\n2.3. Complex Conductivity Survey\n[19] Electrical measurements were made using an array of\n72 stainless steel electrodes spaced 0.5 m apart along the\ntransect. Each electrode was inserted through the surface\nvegetation to a depth sufficient to ensure good electrical\ncontact with the main body of peat (tests showed that the\nTable 1. Vegetation Along the Transect, Where the Data Represent Percentage Covera\nDistance (m)\n0–2 2–4 4–6 6–8 8–10 10–12 12–14 14–16 16–18 18–20 20–22 22–24 24–25 25–27 27–29 29–31 31–33 33–36\nVascular plants\nCarex sp. <1 <1 <1 <1 path\nChamaedaphne\ncalyculata\n<1 3 2 7 1 3 5 9 10 10 20 30 path 4 1 7\nDrosera rotundifolia <1 <1 <1 <1 path <1\nEriophorum\nvaginatum\n<1 <1 <1 1 3 path <1\nKalmia angustifolia 20 10 20 15 15 20 15 4 path <1 5 8 8 10\nKalmia polifolia <1 <1 <1 <1 <1 <1 <1 path <1 <1 <1 <1\nLarix laricina <1 <1 2 path 8 20 20 15\nLedum\ngroenlandicum\n1 2 2 1 <1 3 2 2 <1 <1 path <1 1 3 3 5\nPicea mariana 2 2 8 3 4 8 30 30 <1 path 25 20 45 45 50\nRhododendron\ncanadense\npath <1 <1 <1 <1\nRhynchospora alba <1 1 1 <1 path <1\nSarracenia purpurea path <1\nVaccinium\nangustifolium\n1 4 6 5 2 3 10 1 <1 path 15 15 15 15 10\nVaccinium oxycoccus <1 <1 <1 <1 1 <1 <1 path <1 <1 <1 <1\nMosses and liverworts\nMylia anomala <1 path 2 2 1\nPolytrichum strictum <1 <1 <1 <1 <1 <1 <1 path\nSphagnum section\ncuspidata\n65 25 path\nSphagnum fuscum 30 25 50 35 35 40 35 5 path 1 30 35 35 30\nSphagnum\nmagellanicum\n<1 <1 <1 <1 <1 1 <1 20 <1 2 2 <1 path 4 <1 7\nSphagnum rubellum 10 30 30 8 20 5 20 50 30 75 95 100 path 40 15 15 15 15\nLichens 40 25 10 35 35 35 20\naFor ease of presentation, data have been presented in 2 m blocks, although some boundaries in the field cut across these blocks (see Figure 1). Cover\nwas estimated to the nearest 1% if under 10% and to the nearest 5% if over 10%. Here <1 denotes that a species was present but with less than 1% cover.\nSpecies names follow the nomenclature of Anderson and Crum [1981] and Scoggan [1978].\nFigure 2. CMP data taken at CMP2 (Figure 3).\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n5 of 15\nG04030\ncontact resistance was less than 6 kW between any electrode\npair). Data were acquired using a Syscal Pro instrument.\nThe complex conductivity survey was performed in the time\ndomain, and measured chargeabilities were converted to the\nfrequency domain to allow inversion of the complex con-\nductivity (section 1.3.3). A total of 1039 independent\nmeasurements were collected using a combination of four-\nelectrode configurations that provided a uniform sampling\nof the top \n3 m of the peat along the length of the transect.\nThe choice of electrode configuration (i.e., geometrical\narrangement of the current injection pair and voltage mea-\nsurement pair) can exert a strong influence on the recon-\nstructed conductivity image. The electrode configuration\naffects the spatial sensitivity of the reconstructed image (i.e.,\nhow the conductivity distribution of the subsurface image\nchanges in response to the measured resistances) and signal-\nto-noise ratio. We used a configuration that ensures large\nvoltages (often by straddling the current injection pair),\nwhich is critical to collecting reliable chargeability measure-\nments. The measurement quality was evaluated by collect-\ning a complete set of reciprocal data (i.e., an additional 1039\nmeasurements), whereby the voltage and current electrode\npairs were interchanged (in theory, these measurements\nshould be identical, and the deviation is a robust measure\nof the data quality [LaBrecque et al., 1996]).\n[20] The three-dimensional current field was simulated\nusing a finite element (FE) model. The model assumed a\ntwo-dimensional conductivity structure along the length of\nthe transect. This conductivity structure of the transect was\nparameterized by minimizing an objective function com-\nbining two terms: (1) the least squares, the weighted\ndifference between observed and predicted measurements;\nand (2) a measure of solution complexity based on a second\nderivative spatial filter. The two terms were weighted to\nachieve consistency between simulated and observed mea-\nsurement errors, i.e., an Occam’s inversion [Constable et\nal., 1987]. To perform the inversion, we utilized a complex\nconductivity algorithm called CR2 (available from Andrew\nBinley, Lancaster University) outlined by Kemna et al.\n[2004] and Binley and Kemna [2005]. The sensitivity of\nFigure 3. (a) CMP and pore water conductivity measurement locations. EM velocities presented above\neach measurement location, in m ns\u00061, and pore water conductivities presented, in mS cm\u00061. (b) The von\nPost classification of the peat from the six cores.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n6 of 15\nG04030\nthe resulting complex conductivity image is depth-depen-\ndent. Changes in the subsurface properties close to the\nground surface (near to the electrodes) have a larger effect\non the measured resistances than a similar change in\nsubsurface properties at depth. This reduced sensitivity\nproduces an increased smoothing of the complex conduc-\ntivity image with depth that should be borne in mind in the\nsubsequent data analysis.\n2.4. Ground Truthing: Topography, Stratigraphic\nSurvey and Specific Conductivity\n[21] Microtopographical (10\u00062–100 m) variations of the\npeatland surface along the transect line were measured using\na laser level and were expressed relative to an arbitrary\ndatum. Vegetation was mapped along a 3 m wide band\ncentered on the transect; that is, the vegetation 1.5 m on\neither side of the transect line was characterized. All plant\nspecies within this area were identified, and the surface\ncover of each was visually estimated using quadrats. Vas-\ncular plants were named according to Scoggan [1978],\nwhile the nomenclature of mosses followed Anderson and\nCrum [1981].\n[22] To help interpret the data from the GPR and electrical\nsurveys, six cores of peat were extracted using a Russian\ncorer at distances of 8, 13, 21, 24, 25.8, and 28 m along the\ntransect line, each to a depth of 2.5 m (C1–C6 in Figure\n3b). The peat from each core was classified using the von\nPost scale [von Post and Granlund, 1926]. The von Post\nscale involves in-the-hand assessment of the degree of\nhumification of peat and requires the classification of the\npeat into 1 of 10 categories, with 1 representing fresh litter\nand 10 representing intensely humified or decomposed peat\nin which visible plant remains and structures are absent.\nWhere appropriate, note was also taken of visible plant\nremains such as woody inclusions or whether the peat was\ndominated by Sphagnum remains or sedges.\n[23] Following the same criteria used for the CMP\nmeasurements, the specific conductivity of pore water was\nmeasured at distances of 8, 17, and 25 m along the transect\nline as shown in Figure 3a. Pore water was sampled from\ntemporary piezometers with screens 10 cm long inserted at\neach location and using a hand-operated pump, extracting\n16 cm3 of pore water per stroke. Three to four specific\nconductivity measurements with depth (surface, 1, 2,and 3 m\ndepth) were acquired using a Hach sensION5 conductivity\nmeter to investigate changes in fluid conductivity that could\npotentially influence the complex conductivity. Because s0\nis directly dependent on sw (equation (2)), electrical meas-\nurements must account for any significant changes in sw.\n3. Results\n3.1. Vegetation and Stratigraphic Data\n[24] The results from the vegetation survey are shown in\nFigure 4a and Table 1. As noted in section 2.1, there were\nthree broad areas along the transect in terms of vegetation\ncover. The first 13 m of the transect was dominated by small\nhummocks (diameters of <1 m), formed mostly of Sphag-\nnum fuscum and S. rubellum. There was a high cover of\nshrubs in this area, notably Kalmia angustifolia, and a\nscattering of short (<5 m) trees, almost all black spruce\n(Picea mariana). Bordering the hummock area and the lawn\nand hollow (i.e., between 13 and 16 m) was a small spruce\nthicket, after which there was an open area dominated by\nSphagnum. The hollow contained Sphagna of the section\ncuspidata, while the surrounding lawn was dominated by S.\nrubellum. The S. rubellum lawn gave way gradually to a\nlow-spreading hummock from about 21 m, which itself\ngave way rather abruptly at 28 m to a spruce-tamarack\nthicket (Picea mariana–Larix laricina) for the remainder of\nthe transect (to 36 m). The thicket contained some Kalmia\nangustifolia and a relatively high cover of Sphagnum\nfuscum and S. rubellum (Table 1).\n[25] The core data (Figure 3b) showed a clear correspon-\ndence with the vegetation in that there were distinct differ-\nences in the layering and degree of humification of the peat\nbetween the drier microhabitats and the lawn and hollow.\nThe core taken in the lawn and hollow at 21 m had an upper\nlayer of 0.5 m of poorly decomposed Sphagnum remains, in\nwhich individual Sphagnum plants could still be seen,\nwhich was underlain to a depth of 0.95 m by slightly more\ndecomposed peat containing abundant Sphagnum and sedge\nremains. There was then a sharp transition (<1 cm) to a\ngelatinous peat that was largely amorphous with a high\ndegree of humification. No layering was evident in this\nlower 1.55 m. A similar profile was evident in the core\ntaken in the low-spreading hummock at 24 m. However,\nwith this core the poorly decomposed peat containing\nvisible Sphagnum remains was confined to the upper\n0.5 m; this was underlain by a watery layer between\n0.5 and 0.95 m containing dark colloidal material that\nthen gave way abruptly to amorphous, gelatinous, highly\nhumified peat.\n[26] C1 and C2 in the hummocky area and C6 in the\nspruce-tamarack thicket were strikingly different from C3\nand C4, with a more complicated pattern of layering and\nmore variety in degrees of humification of the different\nlayers (Figure 3). For example, there were at least 10\ndistinct layers of peat in C1 and C2. This layering probably\nreveals switches in near-surface wetness and vegetation type\nwhen the peat was being formed. For example, between\ndepths of 0.87 and 1.5 m in C2 there is a change from\nmoderately humified peat to strongly humified peat to\nmoderately humified peat again (from von Post scores of\n5 between 0.87 and 1.07 m to 7–8 between 1.07 and 1.14 m\nand to 6 between 1.14 and 1.5 m). These switches may\nindicate autogenic changes in microhabitat disposition and\nextent at the peatland surface or they may indicate external\nforcing, with the less-humified peat forming during wetter\nand cooler climatic conditions than the more humified peat.\nAlthough C6 showed a similar level of complexity in terms\nof its number and pattern of layers, its layers do not appear\nto correspond to those of C1 and C2. Correlation between\nthe cores would require absolute dating of different layers,\nbut the evidence suggests that wet and dry episodes at the\ndifferent locations were, in part at least, independent of each\nother.\n3.2. Ground-Penetrating Radar Results\n[27] The peat-mineral interface was clearly identifiable\nwithin the CMP gathers (Figure 2), enabling accurate\ndetermination of the first arrivals of the reflected wavelets\nand therefore the accurate calculation of the EM wave\nvelocities. The EM wave velocity shows only a small\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n7 of 15\nG04030\nvariation between the different microhabitats (Figure 3a).\nDrier microhabitats (CMP1 and CMP3 corresponding to\nshrubby-lichen hummocks and a spruce-tamarack thicket,\nrespectively) show v values (plus or minus standard error of\nthe hyperbola regression) of 0.0359 ± 0.00044 and 0.0356 ±\n0.00021 m ns\u00061, respectively, and contrast with lower v\n(0.0346 ± 0.00028 m ns\u00061) in the wetter habitat (CMP2\ncorresponding to the wet Sphagnum lawn and hollow). The\ndifference in measured v between the different CMP loca-\ntions can be attributed to the spatial variations in the peat\nporosities, the entrapped biogenic gas content [cf. Comas et\nal., 2008] and water table depth, with the associated\nincrease in v through the unsaturated zone.\n[28] Common offset measurements along the transect are\npresented in Figure 4b. The depths of the reflections in the\ncommon offset measurements are calculated from a two-\nlayer velocity model. The EM wave velocity above the\nwater table was simulated using the CRIM model [see\nComas et al., 2004], assuming an unsaturated moisture\ncontent of 0.25 [Hayward and Clymo, 1982], giving an\nunsaturated v of 0.11 m ns\u00061. Beneath the water table, a\nconstant v of 0.0346 m ns\u00061 was assumed, obtained from\nCMP2 within the wet Sphagnum lawn and hollow where the\nwater table depth was less than 0.05 m from the peat\nsurface. The two-layer velocity model assumed that the\nwater table depth remained at a constant datum along the\nFigure 4. (a) Vegetation types along the west to east study transect. (b) Radar reflection profile from\ncommon offset data acquisition. (c) Radar stratigraphic interpretation showing the dominant reflections\nbeneath the ground wave, superimposed upon the radar reflection profile. Reflections are classified into a\nzone of continuous reflections to semireflections and a zone of chaotic reflections, marked by black and\nlight gray horizontal bands, respectively. Figures 4b and 4c also include the von Post classification of the\npeat from the six cores.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n8 of 15\nG04030\nlength of the transect; that is, the surface microtopography\nwas associated with variations in the depth of the unsatu-\nrated zone, ranging from a minimum depth of 0 m within\nthe wet Sphagnum hollow to a maximum depth of 0.61 m\nwithin the shrubby-lichen hummocks. The unsaturated v\nand water table depths were used to calculate the necessary\ntopographic correction to align each trace so that the point\nwhere the EM wave hits the water table (assumed to be at a\nconstant datum across the transect) occurs at a depth of\n0.0 m. Although this topographic correction enables the\ncore data to be aligned with the GPR measurements, the\nincorporation of the topographic corrections does introduce\nimage artifacts into common offset measurements. Notably,\nthe pattern of reflections below the peat surface does, in\npart, follow the surface topography, specifically a distance\nof between 0.0 and 14.0 m along the transect where the\nsurface topography is most pronounced. Such artifacts result\nprimarily from errors in the derived EM velocity within the\nunsaturated zone.\n[29] Assuming a ground wave velocity of 0.354 m ns\u00061,\nan antenna frequency of 200 MHz, and an antenna separa-\ntion of 0.5 m, the ground wave will influence the received\nsignal for up to 20 ns after the received air wave, to a depth\nof 0.35 m in the GPR profile. Below this zone, the transect is\ncharacterized by two distinctly different patterns of reflec-\ntions. These areas are identified within Figure 4c as a zone of\nmoderately continuous reflections, marked by black bands,\nand a zone of chaotic reflections, marked by light gray\nbands. The zone of chaotic reflections correlates closely\nwith the location of the S. rubellum lawn. On the western\nside of this zone, at a distance of 15 m along the transect, a\nsharp vertical boundary (the horizontal transition occurs in\nless than 1 m) exists between the two patterns of reflections.\nThis vertical boundary coincides closely with the transition\nfrom the spruce hummock to the S. rubellum lawn. On the\neastern side, the boundary between the two reflection pat-\nterns is sloping. At a distance of 20 m along the transect, the\nboundary is at a depth of 1.0 m, increasing to a depth of 2.2 m\nat a distance of 28 m along the transect. This transition zone\ncorrelates with the change in the vegetation classification\nfrom the S. rubellum lawn, through the spruce hummock, to\nthe spruce-tamarack thicket. At the top of the zone of chaotic\nreflections, the transition from a pattern of semicontinuous\nreflections to a pattern of chaotic reflections is marked by a\nhorizontal reflector at a depth of approximately 0.9 m,\nbetween 19 and 24 m along the transect.\n[30] While the pattern of reflections has been broadly\nclassified into two zones above, distinctive variations in the\nreflection patterns are evident within both the zone of\nmoderately continuous reflections and the zone of chaotic\nreflections. Within the zone of moderately continuous\nreflections, the pattern of the reflections differs between\nthe shrubby-lichen hummocks and the spruce-tamarack\nthicket. The reflections below the shrubby-lichen hum-\nmocks are weaker with depth than below the spruce-\ntamarack thicket. In addition, below the shrubby-lichen\nhummocks, the reflections are parallel with a small but\ndistinctive easterly dip of approximately 1.5\u0001. In contrast\nbeneath the spruce-tamarack thicket, the reflections are\ndivergent with a westerly dip in the reflections ranging\nfrom 0\u0001 to 3\u0001. Within the zone of chaotic reflections, the\npattern of reflections between 15 and 19 m contrasts with\nthe pattern of reflections between 19 and 24 m. Between 15\nand 19 m, the reflections are more chaotic with a strong\nvariation in the direction and length of the reflections. In\ncomparison, between 19 and 24 m, the reflections are more\ndiscontinuous.\n3.3. Complex Conductivity Survey\n[31] Reciprocal errors were analyzed to identify anoma-\nlous measurements (a measurement pair with a larger than\nexpected reciprocal error). Here 254 erroneous independent\nmeasurements were identified and discarded from the data\nanalysis. These measurements were discarded because ei-\nther the maximum measureable voltage of the IRIS Syscal\nPro was exceeded or the potential electrode pair included an\nelectrode that was used for current injection immediately\nprior to its measurement. The latter showed a significant\nincrease in the reciprocal errors (p < 0.001). To find a\nsatisfactory parameterization of the FE complex conductiv-\nity model (CR2), the data weightings in the least squares\nobjective function, between the remaining measured and\nsimulated resistances (section 2.3), were calculated. These\nweightings account for variations in measurement and\nmodeling accuracy between the different four-electrode\nmeasurement arrays and influence the complexity (‘‘rough-\nness’’) of the resultant complex conductivity image. Al-\nthough reciprocal errors of each measurement were\nobtained, they provide only a single estimate of the error\nof each data point [LaBrecque et al., 1996]. In addition,\nreciprocal errors do not account for errors in the FE model\n(notably, the discretization errors in the FE model and the\nassumption of a 2-D complex conductivity structure). We\ntherefore simulated the total resistance and chargeability\nerrors to provide a more accurate estimate of the total error.\nWe pooled all estimates of the reciprocal errors, calculated\nthe discretization error in the FE model, and explicitly\nincluded an additional error term to account for errors in\nthe FE model. The reciprocal errors of the measured\nresistances were low, with an average percentage error of\n0.14%. The total simulated resistance error was thus low\nand was assumed to be 0.9%. However, the total resistance\nerror showed significant variation between measurements,\nranging from 0.2 to 6.9%. The average reciprocal charge-\nability error was 4.1%, and the total simulated error was\n5.4%.\n[32] The real and imaginary conductivity transects are\npresented in Figure 5 (data are presented on a log scale).\nThe real and imaginary conductivities vary spatially, both\nhorizontally and vertically. The real conductivity ranges\nfrom 10 to 120 mS cm\u00061, and the imaginary conductivity\nranges from 0.032 to 0.5 mS cm\u00061. In the real conductivity\nimage, four regions are clearly identifiable (Figure 5b).\nRegion 1 is a low-conductivity area above the datum\n(0.0 m, Figure 5), between 0 and 15 m and between 28\nand 35 m along the transect. This low-conductivity zone\nrepresents the unsaturated zone (datum denotes the water\ntable position). Region 2 is a zone of high-conductivity peat\nat a depth of 0.0 to 0.6 m below the datum, delineated\nbetween 0 and 15 m along the transect. There is evidence of\nthis zone continuing beyond 15 m but with a lower\nconductivity than is evident between 0 and 15 m. Region\n3 is a zone of low conductivity at a depth of 0.6 to 2.5 m\nbelow the datum and occurred at a distance of 17–34 m\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n9 of 15\nG04030\nalong the transect. Region 4 represents the remainder of the\ntransect, composed primarily of the zone beneath region 2,\nbetween 0 and 17 m along the transect. The conductivity of\nregion 4 is between that of the high- and low-conductivity\nzones, regions 2 and 3, respectively. The imaginary and real\nconductivities are correlated (R2 = 0.61 and p < 0.001). The\nfour regions identified above are, therefore, also evident\nwithin the imaginary conductivity image (Figure 5d). How-\never, region 3 in the imaginary conductivity image is more\nconcentrated between 17 and 25 m and does not extend up\nto 35 m, as is evident in the real conductivity image.\n4. Discussion\n[33] The GPR and complex conductivity images show\nstrong spatial variations across the short transect analyzed in\nthis study. These spatial variations correspond with changes\nin the surface vegetation associated with the different\nFigure 5. (a) Vegetation types along the west to east study transect. (b) Transect of log10 s\n0 and (c)\ninterpretation of log10 s\n0 transect into regions of varying conductivities. (d) Transect of log10 s\n00. Figures 5b,\n5c, and 5d each incorporate the von Post classification of the peat from the six cores. Note the different von\nPost scale of Figure 5d as opposed to Figures 5b and 5c.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n10 of 15\nG04030\nmicrohabitats. We present a brief explanation of what may\nbe the dominant factors influencing this spatial variability in\nthe EM reflections and complex conductivity and identify\nhow these spatial variations relate to the different peat\nproperties as revealed by the stratigraphic survey. Finally,\nwe identify how information from the GPR and complex\nconductivity and stratigraphic surveys combines to give us\nclues to the developmental history of this part of Caribou\nBog.\n4.1. Ground-Penetrating Radar\n[34] GPR reflections occur where there is a boundary\nbetween two zones of differing dielectric permittivities.\nWithin the peat, and below the water table, changes in the\ndielectric permittivity occur primarily because of changes in\nthe volumetric water content which are caused by changes\nin the porosity of the peat or its biogenic gas content. Both\nof these attributes are likely to correlate with the changes in\npeat type identified within the stratigraphic survey. However,\na direct comparison between the GPR and stratigraphic\nsurveys proved problematic. While reflections in the GPR\nsurvey correlate with boundaries between different peat\nhorizons, reflections are also evident where no boundaries\nwere identified (Figure 4b). The poor correlation been the\nGPR and the stratigraphic survey may in part result from the\nlow resolution of the GPR measurements when compared to\nthe dimensions of the identified peat horizons. The vertical\nresolution of the GPR approach is often assumed to be equal\nto one quarter to one half of the wavelength [Sheriff and\nGeldart, 1982]. The peak frequency of the received signal\nfrom the 200 MHz antenna was 115 MHz, giving a vertical\nresolution of 0.08–0.16 m (assuming a velocity of 0.0354 m\nns\u00061) during the common offset measurement survey. With\npeat horizons as thin as 0.05 m evident in the stratigraphic\nsurvey (e.g., C3, 1.32–1.37 m), the identification of each\nhorizon from the common offset measurements is unfeasi-\nble. In addition, in the horizontal plane, the length of the\nradar reflection footprint parallel to the transect, Fpar, is\nequal to [Sensors and Software, 1998]\nFpar ¼ l\n2\nþ 2dffiffiffiffiffiffiffiffiffiffiffiffi\nK \u0006 1p ; ð6Þ\nwhere l is the peak wavelength, d is the depth, and K is the\ndielectric permittivity. The length of the radar reflection foot\nprint perpendicular to the transect, Fperp, is equal to Fpar\/2.\nAssuming a dielectric constant of 71 (calculated from the\nGPR wave velocity of 0.0354 m ns\u00061), at a depth of 1.5 m,\nFpar and Fperp equal 0.39 and 0.20 m, respectively. Although\nthe EM reflections identified within the common offset\nsurvey vary substantially in length, many are less than 1 m\n(Figure 4b). This complex 3-D pattern of small reflections,\nrelative to the size of the radar reflection footprint, will\nfurther prevent individual peat horizons from being\nextracted with any confidence. The comparison of the\nGPR and stratigraphic surveys, therefore, focuses on\npatterns in the EM reflections and how these correlate with\nthe stratigraphic data. The resolution of the GPR measure-\nments should be borne in mind in the subsequent\ndiscussions.\n[35] The complicated pattern of layering in C1, C2, C5,\nand C6 correlate strongly with the zones of moderately\ncontinuous reflections identified within the GPR survey.\nThe correlation between the pattern of reflections and the\nhorizons identified within the stratigraphic survey suggests,\nas postulated above, that the changes in the humification of\nthe peat produce changes in the dielectric permittivity and,\nthus, EM wave reflections. At a distance of 21 and 24 m\nalong the transect, the strong boundary between the poorly\ndecomposed peat (von Post scores of 3–6) and the zone of\nstrongly humified peat (von Post scores of 8, 9, and 10) is\nmarked by a strong linear reflection, and the zone of\nstrongly humified peat below coincides with the zone of\ndiscontinuous reflections. The zone of chaotic reflections\nbetween 15 and 19 m could not be sampled in the strati-\ngraphic survey because of the unstable nature of the surface;\nthe hollow lacked a thick, stable mat of Sphagnum. There-\nfore, no direct evaluation of any change in peat structure is\navailable.\n[36] In comparison to the traditional stratigraphic meth-\nods applied within this study, the GPR approach provides\nless detailed information about the structures of the peat.\nHowever, the stratigraphic survey is labor intensive and is\nonly able to provide point measurements of the peat profile.\nIn comparison, GPR provides valuable information about\nthe spatial extent of any structural variations. For example,\nfrom the GPR survey it can be seen that the patterns of\nreflections, and thus peat structure, coincide closely with the\ndifferent habitats. The area characterized by chaotic reflec-\ntions is evident beneath the entire length of the Sphagnum\nhollow. The pattern of parallel reflections between 0 and 15\nextends beneath the entire length of the shrubby-lichen\nhummocks, and the pattern of westerly dipping reflections\nextends along the length of the spruce-tamarack thicket. In\naddition, the zone of well-decomposed peat, identified\nwithin C3 and C4, extends across the entire length of the\nSphagnum lawn.\n4.2. Complex Conductivity Survey\n[37] If the structural attributes of the peat significantly\ninfluence the complex conductivity, spatial variations in s0\nand\/or s00 should correlate with the decomposition of the\npeat identified within the stratigraphic survey. The strati-\ngraphic survey identified a zone of strongly humified peat\nbeneath the S. rubellum lawn (von Post humification scale\n8–10). This zone of well-decomposed peat appears to\ncorrespond with the area of low s0 (region 3, Figure 5b).\nIn addition, region 2, and its extension (Figure 5c), is\ncharacterized by less decomposed peat, and region 4 is\ncharacterized by a zone showing distinct layers of peat.\nThe s00 shows a similar correspondence with the strati-\ngraphic survey because s00 and s0 are correlated (R2 =\n0.61, section 3.3). The only notable difference is that the\nlow s00 zone does not extend as far along the transect as the\nlow s0 zone (s00 increases at a distance of 26 m). The zone of\nlow s00 therefore correlates with the area of strongly\ndecomposed peat (von Post scores of 9–10; Figure 5d).\nAlthough further stratigraphic data are required to verify the\nlink between the peat decomposition and the complex\nconductivity, the measurements suggest that structural var-\niations may be identifiable from either s0 or s00. However,\nthe cause of the spatial variation in s0 and s00, and therefore\nthe cause of any link with peat decomposition, is unclear. It\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n11 of 15\nG04030\nis uncertain whether the variation in complex conductivity\nbeneath the water table results from spatial variations in the\nvolumetric moisture content of the peat (either qeff or S), sw,\nor the structural changes in the peat properties, specifically,\nthe surface area per unit pore volume. The possible influ-\nence of each of these peat properties on s* are discussed in\nturn in sections 4.2.2–4.2.4. This discussion focuses on\nidentifying the cause of spatial variations in s0. Within peat\nsoils, the petrophysical understanding of s00 is less fully\nunderstood than for s0, and the correlation between s0 and\ns00 suggests that similar properties are responsible for the\nspatial variation of each property.\n4.2.1 Volumetric Moisture Content\n[38] Beneath the water table, s0 may vary because of\nchanges in the peat saturation (because of entrapped biogenic\ngas bubbles) and peat porosity (equation (2)). Whether these\nproperties make a significant contribution to the spatial\nvariation in s0 is now considered. The analysis below does\nnot identify whether any change in the structure of the peat\nassociated with the change in porosity, for example, an\nincreased pore surface area, affects s0. The effect of peat\nstructure is considered within section 4.2.3.\n[39] If it is assumed that the peat properties are uniform\nbeneath the water table, i.e., that the variation in s0 results\nonly from a change in the saturation, the maximum entrap-\nped gas content necessary to produce the identified variation\nin s0 can be approximated from equation (2). In accordance\nwith Slater et al. [2007], assuming n = 1.3 and sel \u000b ssurf:\nS ¼ s\n0\nunsat\ns0sat\n\u0002 \u00031:3\n; ð7Þ\nwhere s0sat and s\n0\nunsat equal the maximum and minimum\nmeasured s0, respectively. To account for the measured\nvariation in s0, the saturation of the peat in the low-\nconductivity zone (region 3) must equal 0.12. This is\nunrealistically low. Laboratory measurements of the en-\ntrapped biogenic gas content suggest a minimum saturation\nof, for example, 0.87 [Baird and Waldron, 2003].\n[40] Without an approximation of m (equation (2)), the\nspatial variation in the peat porosity necessary to produce\nthe identified variation in s0 cannot be identified. However,\nvariations in the peat porosities are of a similar magnitude to\nchanges in the biogenic gas content (minimum porosity of\n0.8 [Boelter, 1969]). Because changes in the biogenic gas\ncontent cannot account for the spatial variations in the\nreconstructed s0, it appears improbable that variations in\nthe porosity can account for the identified variation in s0.\n[41] Although variations in the volumetric moisture con-\ntent of the peat, due to changes in either the saturation or\nporosity, do not appear to account for the spatial variation in\ns0, the volumetric moisture content of the peat cannot be\nexcluded as a significant source of variability. Without an\naccurate parameterization of equation (2), or another mixing\nmodel, the effect of spatial variations in the volumetric\nmoisture content cannot be accurately quantified. Most\nnotably, the assumption that sel \u000b ssurf is unlikely for peat\nsoils.\n4.2.2. Pore Water Conductivity\n[42] Pore water conductivity affects s0 by altering sel and\nssurf (section 1.3.1). If variations in sel, resulting from\nchanging pore water conductivities, were the dominant\ncause of spatial variations in s0, s0 and sw should be linearly\ncorrelated (equation (2); assuming that ssurf is constant).\nMeasured pore water conductivities ranged from 26.2 to\n43.5 mS cm\u00061 (n = 10) and were significantly correlated\nwith s0 (p = 0.03 and n = 10; Figure 6a). In addition, the\ngradient of the relationship is not significantly different\nfrom one, and the intercept is not significantly different\nfrom zero. However, there is considerable scatter in the\nrelationship between sw and s\n0 (R2 = 0.47). Therefore,\nvariations in s0 may instead result primarily from variations\nin ssurf and its associated dependence on the pore water\nFigure 6. Comparisons of (a) s0 and sw, (b) s\n00 and sw,\nand (c) simulated s0 and s0. Thick line shows linear\nregression; thin line marks 1:1 relationship.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n12 of 15\nG04030\nconductivity. Equation (3), parameterized with the measured\npore water conductivities and reconstructed values of s00,\npredicts that sel accounts for only 23% ±3 (mean plus or\nminus standard deviation) of s0 at the study site, i.e., that\nssurf is the dominant conduction pathway. The s\n00 and sw are\nlinearly correlated (p = 0.03 and n = 10; Figure 6b);\nhowever, considerable scatter is again evident in the rela-\ntionship (R2 = 0.47). It therefore appears probable that\nvariations in s0 result from variations in both electrolytic\nand surface conduction. The dependence of sel and ssurf on\nthe pore water conductivity has been presented by Comas\nand Slater [2004] (equation (3)). Reconstructed and mod-\neled (equation (3)) s0 were significantly correlated (p =\n0.018 and n = 10) and account for a higher proportion of the\nvariability in the reconstructed s0 (R2 = 0.56) than either s0\nor s00 alone. However, equation (3) provides a poor simu-\nlation of absolute values of the reconstructed s0, even\nthough the calibration samples used to parameterize equa-\ntion (3) were obtained from Caribou Bog [Comas and\nSlater, 2004]. Simulated s0 was on average 54% lower than\nthe reconstructed s0, and the gradient of the relationship was\nsignificantly different from 1.0, with the model underesti-\nmating the measured variation in s0. However, Comas and\nSlater [2004] presented only a small number of measure-\nments of ssurf and s\n00 at low pore water conductivities. In\naddition, their measurements were conducted on a limited\nnumber of peat types from Caribou Bog. Therefore, the\nimportance of ssurf on s\n0 and its dependence on sw at low\npore water conductivities remains unclear.\n4.2.3. Structural Changes in the Peat Properties\n[43] Measurements suggest that sw has an important\ninfluence on the spatial variation in s0 (section 4.2.2).\nHowever, it appears probable that the pore water conduc-\ntivity was not the only property that significantly influenced\ns0. First, considerable scatter is evident in the relationship\nbetween modeled and measured s0. Second, only a limited\nnumber of sw measurements were obtained across the\ntransect, and no measurements were taken within the\nhigh-conductivity zone (region 2). It is uncertain whether\nthere could be a zone of high pore water conductivity at a\ndepth of 0.3 m, at a distance of 8 m along the transect, three\ntimes the pore water conductivity at a depth of 1.6 m.\nChanges in s0, associated with changing sw, may therefore\nbe enhanced by spatial variations in the peat properties. For\nexample, higher surface areas or improved interconnectivity\nof the electrical double layer within certain peat types may\nenhance surface conduction. However, to identify whether\nadditional peat properties have a significant influence on s0,\nfurther data are required to better quantify the magnitude of\nscatter in the relationship between s0 and sw.\n4.2.4. Imaginary Conductivity\n[44] The identified variation in s00 and the correlation\nbetween s0 and s00 can be explained by a spatial variation in\neither the pore water conductivity or the peat structure. At\nlow pore water conductivities, sw alters the charge density\nwithin the electrical double layer, increasing s00 [cf. Comas\nand Slater, 2004], while an increased surface area per unit\npore volume has been widely shown, at least in mineral\nsoils, to increase s00 (section 1.3.2). Therefore, the recon-\nstructed s00 cannot clarify whether changes in peat proper-\nties, and the associated variation in surface conduction, has\na significant influence on s0, and it cannot be used as a\ndirect measure of changing peat properties. However, unlike\ns0, s00 is a function solely of the interfacial surface and does\nnot directly depend on sel. Therefore, if changing peat\nproperties do significantly influence the complex conduc-\ntivity, their influence should be more clearly apparent from\nthe reconstructed s00. The improved correspondence be-\ntween s00 and the stratigraphic survey (notably the zone of\nhumified peat, region 3) does suggest that changes in the\npeat properties could be having an additional influence on\nthe complex conductivity. In addition, the zone of low s00\nbelow the lawn is also more consistent with the size and\nshape of the zone of chaotic GPR reflections (section 3.2),\nsuggesting that s00 is being controlled more significantly by\npeat structure. This is most evident on the eastern side of the\nzone of low s00. The boundary between the zone of high and\nlow s00 is more consistent with the boundary between the\nchaotic and moderately continuous GPR reflections than\nwith the boundary between the low and high s0. The exact\ncause of the spatial variation in s*, therefore, remains\nuncertain. However, the measurements suggest that it results\nprimarily because of combined changes in both the pore\nwater conductivity and the peat structure.\n4.3. Peatland Development\n[45] The stratigraphic survey identified different, appar-\nently unconnected peat profiles with different developmen-\ntal histories. The GPR and complex conductivity surveys\nhave enabled these stratigraphic measurements to be ex-\ntrapolated along the length of the transect to produce a fully\n2-D image of the peat profile. The switches in peat type\nevident across the length of the hummocky area and the\nspruce-tamarack thicket suggest wetter and drier phases and\nwholesale changes in microhabitat. The peat below the lawn\nconsisted of two basic types: upper poorly decomposed peat\nunderlain by gelatinous, strongly decomposed material,\nwith a sharp boundary between the two. The lower gelat-\ninous peat is likely a pool infill, with the pool becoming\novergrown by Sphagnum more recently to form a lawn and\nhollow. Without dating of the peat at various depths below\nthe different microhabitats it is difficult to reconstruct the\nappearance of the peatland in the past. However, it seems\nthat the area currently occupied by the lawn and hollow was\na pool for a considerable period of time (thousands of years)\nduring which the surrounding peatland increased in eleva-\ntion and underwent numerous switches in microhabitat\n(shown by the layers in C1, C2, and C6). At the same time\norganic muds, dy or gyttja [cf. Rydin and Jeglum, 2006,\np. 78], built up in the base of the pool, consolidating to form\ngelatinous ‘‘peat’’ (strictly, peat is a sedentary deposit,\nwhereas dy and gyttja are sedimentary deposits [cf. Rydin\nand Jeglum, 2006, p. 78]; however, for simplicity, the\ngelatinous material at the base of the cores from the lawn\nhas been referred to as peat). Interestingly, the pool appears\nto have been asymmetric, as reported for bog pools studied\nelsewhere [cf. Belyea and Lancaster, 2002], with a steep or\nvertical western margin and a sloping eastern margin, the\nlatter allowing Sphagnum to colonize as a mat which has\nbuilt in thickness to give the poorly decomposed near-\nsurface peat. That the geophysical data show clearly the\nasymmetric form of the pool and the bulk contrasts between\nthe Sphagnum mat and the dy or gyttja and between the\npool peat profile and the profile of peat in the microhabitats\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n13 of 15\nG04030\nto the west and east suggests that GPR and complex\nconductivity surveys have considerable potential for helping\nus reconstruct peatland developmental history.\n5. Conclusion\n[46] We sought to determine whether ground-penetrating\nradar and complex conductivity can be used to map sub-\nsurface structures within peat deposits in detail over large\nareas. These approaches revealed spatial variation in the\npattern of EM reflections and the real and imaginary\nconductivities of the peat along the study transect.\n[47] The spatial pattern in the EM reflections correlated\nstrongly with the pattern of peat humification obtained from\nthe stratigraphic survey. For example, the location where C3\nwas extracted, which was composed of strongly humified\npeat at depths of 0.95 to 2.5 m, was characterized by a\npattern of weak and sporadic reflections. The correlation\nbetween the stratigraphic and GPR surveys enabled the\nspatial extent of the differing peat profiles to be identified.\nThis highlighted a strong correlation between the surface\nhabitat and the peat profile. Notably, the hummocky area\nand the spruce-tamarack thicket were both underlain by a\ncomplicated layered profile with varying degrees of humi-\nfication, suggesting wholesale changes in the microhabitat\nduring the development of the bog. In comparison, the\nSphagnum lawn was underlain by two principal peat layers\nwhich are consistent with a pool becoming infilled with dy\nor gyttja and then being overgrown by Sphagnum.\n[48] The conductivity measurements highlight spatial\nvariations in s0 and s00 along the transect. Comparison with\nthe stratigraphic survey suggests that the approach may\nhave potential for the mapping of spatial variations in the\nproperties of the peat. However, it is currently unclear how\nthe spatial variations in the geophysical measurements\ncorrespond to the physical properties of the peat, although\nthe results suggest that the pore water conductivity and the\npeat structure are the primary properties affecting the\ncomplex conductivity. The future application of the com-\nplex conductivity approach within peatland studies, there-\nfore, requires the detailed parameterization of petrophysical\nrelationships so that the exact cause of these spatial patterns\ncan be identified. The spatial variation in s0 and s00\nidentified here between the differing peatland habitats\nshould act as a driver for this future development.\n[49] Despite these problems, the geophysical methods\nshowed considerable promise in being able to identify\nsubsurface features in the peat deposit, such as the infilled\npool, and the multiple layers of contrasting peat types under\nthe drier microhabitats. In addition, the methods allowed the\nhorizontal continuity of such features to be mapped. When\nused to complement traditional stratigraphic surveys, such\ninformation will provide the data which are needed for the\ntesting of peatland development and peatland ecohydrolog-\nical models.\nNotation\nA constant, dimensionless.\nb constant, dimensionless.\nC constant, dimensionless.\nd depth, m.\nFpar horizontal footprint length parallel to transect, m.\nFperp horizontal footprint length perpendicular to\ntransect, m.\ni\nffiffiffiffiffiffi\u00061p .\nK dielectric permittivity, dimensionless.\nm cementation factor, dimensionless.\nn saturation exponent, dimensionless.\nS saturation, dimensionless.\nv EM wave velocity, m ns\u00061.\nqeff effective porosity, dimensionless.\nf phase angle, radians.\nl peak wavelength, m.\ns* complex conductivity, S cm\u00061.\ns0 real conductivity, S cm\u00061.\ns00 imaginary conductivity, S cm\u00061.\ns0sat saturated real conductivity, S cm\n\u00061.\nsel electrolytic conduction, S cm\n\u00061.\nssurf surface conductivity, S cm\n\u00061.\ns0unsat unsaturated real conductivity, S cm\n\u00061.\nsw pore fluid or pore water conductivity, S cm\n\u00061.\njsj conductivity magnitude, S cm\u00061.\n[50] Acknowledgments. This material is based upon work supported\nby the National Science Foundation under grant 0609534. This award\nfunded a Peatlands Geophysics Workshop from 1–15 June 2007, during\nwhich participants performed the field surveys described in this paper. We\nare particularly grateful to Andrew Reeve (co-instructor on the workshop)\nfor helping to organize this workshop. We also thank the following\nworkshop participants for their assistance with this project in the field:\nSweeta Chauhan (Rutgers University, Newark), Mike Gracz (Kenai Water-\nshed Forum), Guido Grosse (University of Alaska Fairbanks), Kristen\nHarrison (McMaster University), Scott Ketcheson (University of Waterloo),\nJeffrey McKenzie (McGill University), Jay Nolan (Rutgers University,\nNewark), Andy Parsekian (Rutgers University, Newark), Georg Schwam-\nborn (A. Wegener IPMR), Imelda Stamp (Queen Mary, University of\nLondon), and Katey Walter (University of Alaska Fairbanks).\nReferences\nAnderson, L.E., and H. A. Crum (1981),Mosses of Eastern North America,\nColumbia Univ. Press, New York.\nArchie, G. E. (1942), The electrical resistivity log as an aid in determining\nsome reservoir characteristics, Trans. Am. Inst. Min. Metall. Pet. Eng.,\n164, 54–62.\nBaird, A. J., and S. Waldron (2003), Shallow horizontal groundwater flow\nin peatlands is reduced by bacteriogenic gas production, Geophys. Res.\nLett., 30(20), 2043, doi:10.1029\/2003GL018233.\nBarber, K. (1981), Peat Stratigraphy and Climate Change: A Palaeoeco-\nlogical Test of the Theory of Cyclic Peat Bog Regeneration, A. A. Balk-\nema, Rotterdam, Netherlands.\nBelyea, L. R., and A. J. Baird (2006), Beyond the ‘‘limits to peat bog growth’’:\nCross-scale feedback in peatland development, Ecol. Monogr., 76(3), 299–\n322, doi:10.1890\/0012-9615(2006)076[0299:BTLTPB]2.0.CO;2.\nBelyea, L. R., and R. S. Clymo (1998), Do hollows control the rate of peat\nbog growth?, in Patterned Mires and Mire Pools: Proceedings of the\n1998 International Conference, edited by V. Standen, J. Tallis, and R.\nMeade, pp. 55–65, Br. Ecol. Soc., London.\nBelyea, L. R., and R. S. Clymo (2001), Feedback control of the rate of peat\nformation, Proc. R. Soc. London, Ser. B, 268, 1315–1321, doi:10.1098\/\nrspb.2001.1665.\nBelyea, L. R., and J. Lancaster (2002), Inferring landscape dynamics of\nbog pools from scaling relationships and spatial patterns, J. Ecol., 90,\n223–234, doi:10.1046\/j.1365-2745.2001.00647.x.\nBinley, A., and A. Kemna (2005), Electrical methods, in Hydrogeophysics,\nedited by Y. Rubin and S. S. Hubbard, pp. 129–156, Springer, Dordt,\nNetherlands.\nBoelter, D. H. (1969), Physical properties of peats as related to degree of\ndecomposition, Soil Sci. Soc. Am. Proc., 33, 606–609.\nBo¨rner, F. D., and J. H. Scho¨n (1991), A relation between the quadrature\ncomponent of electrical conductivity and the specific surface area of\nsedimentary rocks, Log Anal., 32, 612–613.\nBo¨rner, F. D., J. R. Schopper, and A. Weller (1996), Evaluation of transport\nand storage properties in the soil and groundwater zone from induced\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n14 of 15\nG04030\npolarization measurements, Geophys. Prospect., 44, 583 – 601,\ndoi:10.1111\/j.1365-2478.1996.tb00167.x.\nComas, X., and L. Slater (2004), Low-frequency electrical properties of\npeat, Water Resour. Res., 40, W12414, doi:10.1029\/2004WR003534.\nComas, X., L. Slater, and A. Reeve (2004), Geophysical evidence for peat\nbasin morphology and lithologic controls on vegetation observed in a\nnorthern peatland, J. Hydrol. Amsterdam, 295, 173–184, doi:10.1016\/\nj.jhydrol.2004.03.008.\nComas, X., L. Slater, and A. Reeve (2005), Stratigraphic controls on pool\nformation in a domed bog inferred from ground penetrating radar (GPR),\nJ. Hydrol. Amsterdam, 315, 40–51, doi:10.1016\/j.jhydrol.2005.04.020.\nComas, X., L. Slater, and A. Reeve (2008), Seasonal geophysical monitor-\ning of biogenic gasses in a northern peatland: Implications for temporal\nand spatial variability in free phase gas production rates, J. Geophys.\nRes., 113(), G01012, doi:10.1029\/2007JG000575.\nConstable, S. C., R. L. Parker, and C. G. Constable (1987), Occam’s in-\nversion: A practical algorithm for generating smooth models from elec-\ntromagnetic sounding data, Geophysics, 52, 289–300, doi:10.1190\/\n1.1442303.\nCouwenberg, J., and H. Joosten (2005), Self-organisation in raised bog\npatterning: The origin of microtope zonation and mesotope diversity,\nJ. Ecol., 93, 1238–1248, doi:10.1111\/j.1365-2745.2005.01035.x.\nDavis, R. B., and D. S. Anderson (2001), Classification and distribution of\nfreshwater peatlands in Maine, Northeast. Nat., 8, 1–50.\nFrolking, S., N. T. Roulet, T. R. Moore, P. J. H. Richard, M. Lavoie, and S. D.\nMuller (2001), Modeling northern peatland decomposition and peat accu-\nmulation, Ecosystems, 4, 479–498, doi:10.1007\/s10021-001-0105-1.\nHayward, P. M., and R. S. Clymo (1982), Profiles of water content and pore\nsize in Sphagnum and peat, and their relation to peat bog ecology, Proc.\nR. Soc. London, Ser. B, 215, 299–325.\nHuisman, J. A., S. S. Hubbard, J. D. Redman, and A. P. Annan (2003),\nMeasuring soil water content with ground penetrating radar: A review,\nVadose Zone J., 2, 476–491.\nIngram, H. A. P. (1978), Soil layers in mires: Function and terminology,\nJ. Soil Sci., 29, 224–227, doi:10.1111\/j.1365-2389.1978.tb02053.x.\nJol, H. M., and C. S. Bristow (2003), GPR in sediments: Advice on data\ncollection, basic processing and interpretation, a good practice guide, in\nGPR in Sediments, edited by C. S. Bristow and H. M. Jol, Geol. Soc.\nSpec. Publ., 211, 9–27.\nJol, H. M., and D. G. Smith (1991), Ground penetrating radar of northern\nlacustrine deltas, Can. J. Earth Sci., 28, 1939–1947.\nKemna, A., A. Binley, and L. Slater (2004), Cross-borehole IP imaging for\nengineering and environmental applications, Geophysics, 69, 97–105,\ndoi:10.1190\/1.1649379.\nLaBrecque, D. J., M. Miletto, W. Daily, A. Ramirez, and E. Owen (1996),\nThe effects of noise on Occam’s inversion of resistivity tomography data,\nGeophysics, 61, 538–548, doi:10.1190\/1.1443980.\nLapen, D., B. Moorman, and J. Price (1996), Using ground-penetrating\nradar to delineate subsurface features along a wetland catena, Soil Sci.\nSoc. Am. Proc., 60, 923–931.\nLesmes, D. P., and K. M. Frye (2001), Influence of pore fluid chemistry on\nthe complex conductivity and induced-polarization responses of Berea\nsandstone, J. Geophys. Res. , 106 , 4079 – 4090, doi:10.1029\/\n2000JB900392.\nLesmes, D. P., and F. D. Morgan (2001), Dielectric spectroscopy of sedi-\nmentary rocks, J. Geophys. Res., 106, 13,329–13,346, doi:10.1029\/\n2000JB900402.\nMoore, T. R., J. L. Bubier, and L. Bledzki (2007), Litter decomposition in\ntemperate peatland ecosystems: The effect of substrate and site, Ecosys-\ntems, 10, 949–963, doi:10.1007\/s10021-007-9064-5.\nNeal, A. (2004), Ground-penetrating radar and its use in sedimentology:\nPrinciples, problems and progress, Earth Sci. Rev., 66, 261 – 330,\ndoi:10.1016\/j.earscirev.2004.01.004.\nNobes, D. C., and B. G. Warner (1991), The characterization of bogs using\nground penetrating radar, Open File Rep. 5778, Ont. Geol. Surv.,\nToronto, Ont., Canada.\nRydin, H., and J. K. Jeglum (2006), The Biology of Peatlands, Oxford\nUniv. Press, Oxford, U.K.\nScoggan, H. J. (1978), The Flora of Canada, Natl. Mus. of Can., Ottawa.\nSensors and Software (1998), Ground Penetrating Radar Workshop Notes,\nMississauga, Ontario, Canada.\nSheriff, R. E., and L. P. Geldart (1982), Exploration Seismology, vol. 1,\nHistory, Theory and Data Acquisition, Cambridge Univ. Press, New\nYork.\nSlater, L., and A. Binley (2003), Evaluation of permeable reactive barrier\n(PRB) integrity using electrical imaging methods, Geophysics, 68,\n911–921, doi:10.1190\/1.1581043.\nSlater, L., and A. Binley (2006), Synthetic and field-based electrical ima-\nging of a zerovalent iron barrier: Implications for monitoring long-term\nbarrier performance, Geophysics, 71, 129–137, doi:10.1190\/1.2235931.\nSlater, L., and D.R. Glaser (2003), Controls on induced polarization in\nsandy unconsolidated sediments and application to aquifer characteriza-\ntion, Geophysics, 68, 1547–1558, doi:10.1190\/1.1620628.\nSlater, L., and D. Lesmes (2002), IP interpretation in environmental inves-\ntigations, Geophysics, 67, 77–88, doi:10.1190\/1.1451353.\nSlater, L., and A. Reeve (2002), Investigating peatland stratigraphy and\nhydrogeology using integrated electrical geophysics, Geophysics, 67,\n365–378, doi:10.1190\/1.1468597.\nSlater, L., X. Comas, D. Ntarlagiannis, and M. R. Moulik (2007), Resis-\ntivity-based monitoring of biogenic gases in peat soils, Water Resour.\nRes., 43, W10430, doi:10.1029\/2007WR006090.\nSwanson, D. K., and D. F. Grigal (1988), A simulation model of mire\npatterning, Oikos, 53, 309–314, doi:10.2307\/3565529.\nTheimer, B. D., D. C. Nobes, and B. G. Warner (1994), A study of the\ngeoelectrical properties of peatlands and their influence on ground-pene-\ntrating radar surveying, Geophys. Prospect., 42, 179–209, doi:10.1111\/\nj.1365-2478.1994.tb00205.x.\nVanhala, H. (1997), Mapping oil-contaminated sand and till with the\nspectral induced polarization (SIP) method, Geophys. Prospect., 45,\n303–326, doi:10.1046\/j.1365-2478.1997.00338.x.\nvon Post, L., and E. Granlund (1926), Sodra sveriges tortillangar I, Arsb.\nSver. Geol. Unders., 335, 1–127.\nWarner, B. G., D. C. Nobes, and B. D. Theimer (1990), An application of\nground penetrating radar to peat stratigraphy of Ellice Swamp, south-\nwestern Ontario, Can. J. Earth Sci., 27, 932–938.\nWorsfold, R. D., S. K. Parashar, and T. Perrot (1986), Depth profiling of\npeat deposits with impulse radar, Can. Geotech. J., 23, 142–154.\n\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\u0006\nA. Baird, Department of Geography, Queen Mary, University of London,\nMile End Road, London E1 4NS, UK.\nA. Binley and N. Kettridge, Lancaster Environment Centre, Lancaster\nUniversity, Lancaster LA1 4YQ, UK. (n.kettridge@lancaster.ac.uk)\nX. Comas, Department of Geosciences, Florida Atlantic University,\nRoom 360, 777 Glades Road, Boca Raton, FL 33431, USA.\nH. Jol, Department of Geography and Anthropology, University of\nWisconsin-Eau Claire, 105 Garfield Avenue, P.O. Box 4004, Eau Claire,\nWI 54702-4004, USA.\nL. Slater, Department of Earth and Environmental Sciences, Rutgers\nUniversity, 101 Warren Street, Smith Hall, Newark, NJ 07102, USA.\nM. Strack, Department of Geography, University of Calgary, Calgary, AB\nT2N 1N4, Canada.\nD. Thompson, School of Geography and Earth Sciences, McMaster\nUniversity, 1280 Main Street West, Hamilton, ON L8S 4K1, Canada.\nG04030 KETTRIDGE ET AL.: SUBSURFACE STRUCTURES IN PEATLANDS\n15 of 15\nG04030\n"}