{"doi":"10.1080\/1369118X.2010.539245","coreId":"219259","oai":"oai:eprints.lse.ac.uk:36072","identifiers":["oai:eprints.lse.ac.uk:36072","10.1080\/1369118X.2010.539245"],"title":"Book review: the social dynamics of information and communication technology","authors":["Helsper, Ellen"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-02","abstract":"Eugene Loos, Leslie Haddon & Enid Mante-Meijer, The Social Dynamics of Information and Communication Technology (Hampshire: Ashgate, 2008), 227 pp., ISBN 978-075467082","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219259.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36072\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Helsper%2C%20E_Social%20dynamics_Helsper_Social%20Dynamics_2014.pdf","pdfHashValue":"7b6abf0cf7c4e280727b0dea31e24b34d808dbbd","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36072<\/identifier><datestamp>\n      2017-11-09T10:49:00Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D43<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36072\/<\/dc:relation><dc:title>\n        Book review: the social dynamics of information and communication technology<\/dc:title><dc:creator>\n        Helsper, Ellen<\/dc:creator><dc:subject>\n        HM Sociology<\/dc:subject><dc:description>\n        Eugene Loos, Leslie Haddon & Enid Mante-Meijer, The Social Dynamics of Information and Communication Technology (Hampshire: Ashgate, 2008), 227 pp., ISBN 978-0754670827<\/dc:description><dc:publisher>\n        Taylor & Francis<\/dc:publisher><dc:date>\n        2011-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36072\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Helsper%2C%20E_Social%20dynamics_Helsper_Social%20Dynamics_2014.pdf<\/dc:identifier><dc:identifier>\n          Helsper, Ellen  (2011) Book review: the social dynamics of information and communication technology.  Information, Communication and Society, 14 (2).  pp. 295-297.  ISSN 1369-118X     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/rics<\/dc:relation><dc:relation>\n        10.1080\/1369118X.2010.539245<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/36072\/","http:\/\/www.tandf.co.uk\/journals\/rics","10.1080\/1369118X.2010.539245"],"year":2011,"topics":["HM Sociology"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nEllen J. Helsper \nBook review: the social dynamics of \ninformation and communication technology \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nHelsper, Ellen (2011) Book review: the social dynamics of information and communication \ntechnology. Information Communication and Society, 14 (2). pp. 295-297. ISSN 1369-118X  \n \nDOI: 10.1080\/1369118X.2010.539245 \n \n© 2011 The Author \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36072\/ \n \nAvailable in LSE Research Online: September 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nEugene Loos, Leslie Haddon and Enid Mante-Meijer (2008).The Social Dynamics Of Information \nand Communication Technology. Hampshire: Ashgate.  \nPrice Hardcover £55.  \nISBN: 978-0754670827 \n \nThis book is a collection of papers based on presentations at the conference ‘ The Good, the Bad \nand the Irrelevant: The user and the Future of information and Communication Technologies’ \norganised by the European COST 269 network of researchers. The editors frame this incredibly \ndiverse set of papers as the study of the integration and use of Information and Communication \nTechnologies (ICTs) in everyday life. Domestication is consequently a key organising term \nespecially in the introduction and the conclusion but also in the organisation of the chapters. \nSilverstone and Haddon’s influence is clearly present in the book’s framing of how ICTs are \nappropriated in different contexts (Silverstone & Haddon, 1996). \n \nAfter reading the book the question lingers what the boundaries are of the field of domestication \nresearch? In bringing together a collection of papers related to education, family life, business, legal \nmatters and ICT design, the answer, based on this book, seems to be that domestication is \neverything.. Domestication as practiced by the different authors in this book feels like a descriptive \nrather than an explanatory theoretical approach. In addition, the relation between this approach as a  \nframing device for the book and the individual chapters is sometimes tenuous. Key themes in \ndomestication and social dynamics of ICTs theories such as commodification and appropriation are \nnot addressed in many of the contributions to this book. Which is a loss because a more thorough \nknowledge of this framework by individual authors could have furthered an understanding of the \nway in which ICTs were used in that particular project. The book as a whole does not succeed, if \nthis was the aim to begin with, to dispel any of the reservations one might have about the value of \nthe domestication framework as an explanatory theory in the way that the editors would probably \nhave liked. \n \nAs a result, the contribution of this book towards the study of domestication and study of everyday \nlife is less clear to me. The feeling I was left with after reading it from cover to cover was that there \nis a lot of research that looks at ICTs in a variety of contexts but there is no coherent theoretical \nframework that can help us come to informed conclusions about the processes taking place. It \nsuggests that trying to construct a general theory of ICTs and everyday life is a equivalent to finding \nthe theory that explains life in general. \n  \nA review of the book as a unified whole is an almost impossible task. It is a patchwork of studies \nwith glimpse of interesting projects but underdeveloped theoretically and without a clear indication \nof what these mean for future research. Some of the chapters are presented as one off, \ndecontextualised, stand alone projects others are more clearly integrated into the overarching social \ndynamics and domestication framework. The variety of approaches and topics makes the potential \nreader base for this book very broad. Some contributions deal with very practical issues and would \nthus be informative for practitioners and policy makers, others are clearly academically focussed. \nNevertheless, a background in related (social or informational) sciences would benefit the reader in \ndrawing the links between the chapters as proposed by the editors and to spot some of the \nweaknesses in individual contributions..  \n \nOne of my reservations is that there are methodological flaws in the ways some of the studies have \nbeen carried out. For example, correlational statistics were used for an experimental research design \nwhich did not do the data justice . Other chapters suffer from a lack of theory; for example, \nconsidering the importance of culture in many of the contributions, there is an apparent lack of \ntheoretisiation and subsequent operationalisation of culture in everyday life. The spelling and \ngrammatical errors did not really contribute to a seamless reading either. The flipside of this is that \nthe book should be commended for combining the contributions of so many different authors and \ncontaining studies the reader would not have otherwise heard of, from countries that are usually off \nthe map in terms of publications. Interestingly given the framing in domestication and social \ndynamics, the sections on business and work were the most theoretically and empirically grounded. \n \nAs a result of this being such an all encompassing book the nature, writing style and focus of each \nchapter is very different. It does not read as a coherent narrative from start to finish, for this the \nauthors backgrounds and approaches differ too much, but it does create an overall impression of the \nimportance of ICTs in all aspects of people’s lives. As a whole the book does succeed in stressing \nthe importance of an informed perspective of ICTs in whichever field of social science and praxis \none is involved in. It certainly makes the reader aware that ‘it is important to be aware of their \n[ICTs] mixed potentiality’ (p.220).  \n \nThe diversity in subject matter is also one of the strengths of the book. It cannot do anything but  \nintroduce the reader to areas of research and theoretical development that they are not familiar with. \nMost of the chapters are written in such a way that they are accessible for even those completely \nunfamiliar with the subject area.  The best reading strategy is perhaps to read individual chapters  of \ninterest and seeing the framing of the whole project as a underlying thought but not an organising \nprinciple.  \n \nReviewer: \nDr Ellen J. Helsper,  \nLecturer in Media and Communications  \nLondon School of Economics and Political Science \n \nCurrent Research: Ellen Helsper’s current research interests include the links between digital and \nsocial exclusion; interpersonal mediated communication; and quantitative and qualitative \nmethodological developments in media research. She is also an Academic Advisor to the Media and \nCommunications Department of the Universidad Catolica in Chile and a Research Associate at the \nOxford Internet Institute (University of Oxford). \n \n"}