{"doi":"10.1080\/08856250701791203","coreId":"82393","oai":"oai:eprints.ioe.ac.uk.oai2:789","identifiers":["oai:eprints.ioe.ac.uk.oai2:789","10.1080\/08856250701791203"],"title":"Vulnerability to bullying in children with a history of specific speech and language difficulties","authors":["Lindsay, Geoff","Dockrell, Julie","Mackie, Clare"],"enrichments":{"references":[{"id":586825,"title":"A longitudinal study of bullying, dominance, and during the transition from primary school through secondary school.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":586731,"title":"A modified version of the Rutter parent questionnaire including items on children‟s strengths.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":586588,"title":"A multi-methodological approach to measuring bullying in schools and the effectiveness of one intervention strategy. Unpublished PhD thesis.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":586664,"title":"A review and reformulation of social informationprocessing mechanisms in children‟s adjustment.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":586658,"title":"Access behaviours of children with specific language impairment.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":586625,"title":"Aggression, social cognition, anger and sadness in bullies and victims.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":586748,"title":"An analysis of the revised Olweus bully-victim questionnaire for students using the Rasch measurement model.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":586769,"title":"Big fish little pond effect on academic self-concept: A cross-cultural (26-country) test of the negative effects of academically selective schools.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":586690,"title":"British ability scales II: Administration and scoring manual.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":586685,"title":"British picture vocabulary scale (II).","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":586811,"title":"Bully\/victim problems among school children: basic facts and effects of a school based intervention programme. In","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":586742,"title":"Bullying among adolescents: The strong, the weak and the troubled.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":586922,"title":"Bullying of children with special needs in mainstream schools. Support for Learning,","authors":[],"date":"1994","doi":"10.1111\/j.1467-9604.1994.tb00168.x","raw":null,"cites":null},{"id":586876,"title":"Bullying prevalence and relationship to gender, grade level, ethnicity, self-esteem, and depression.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":586755,"title":"Bullying risks of 11-year-old children with specific language impairment (SSLD): Does school placement matter?","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":586782,"title":"Children with mild learning difficulties in an integrated and in a special school: Comparison of behaviour, teasing and teachers‟ attitudes.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":586760,"title":"Children with specific language impairments.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586889,"title":"Clinical evaluation of language fundamentals – Revised. (UK edition).","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":586672,"title":"Code of practice for the identification and assessment of children with special educational needs.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":586617,"title":"Conversational responsiveness in specific language impairment: Evidence for disproportionate pragmatic difficulties in a subset of children.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":586834,"title":"Criteria for SSLD: The Stark and Tallal legacy and beyond.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586612,"title":"Development of the Children‟s Communication Checklist (CCC): A method for assessing qualitative aspects of communicative impairment in children.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586681,"title":"Formatted: Font: Not Italic Vulnerability to bullying 9.8..07","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":586789,"title":"Learning disabilities and bullying: Double jeopardy.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":586603,"title":"Levels of bullying measured by British schools using the „Life in School‟ Checklist: A case for benchmarking? Pastoral Care,.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":586793,"title":"Neale analysis of reading ability (Revised British edition).","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":586619,"title":"Negotiation skills of children with specific language impairment.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586719,"title":"Peer-assessed behavioural characteristics and sociometric rejection: Differences between pupils who have moderate learning difficulties and their mainstream peers.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":586907,"title":"Profiles of nonvictims, escaped victims, continuing victims and new victims of school bullying.","authors":[],"date":"2004","doi":"10.1348\/0007099042376427","raw":null,"cites":null},{"id":586927,"title":"Prosocial children, bullies and victims: An investigation of their sociometric status, empathy and social problem-solving strategies.","authors":[],"date":"2003","doi":"10.1348\/026151003322277757","raw":null,"cites":null},{"id":586798,"title":"Pupils‟ views on inclusion: Moderate learning difficulties and bullying in mainstream and special schools.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":586815,"title":"Self esteem and its relationship to bullying behaviour.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":586898,"title":"Situational and interpersonal correlates of anxiety associated with peer victimization. Child Psychiatry and Human Development, 25, 97-107. Vulnerability to bullying 9.8..07","authors":[],"date":"1994","doi":"10.1007\/BF02253289","raw":null,"cites":null},{"id":586650,"title":"Social difficulties and victimization in children with SSLD at 11 years of age.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":586723,"title":"Social skills of children with specific language impairment.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":586669,"title":"Sociodynamic relationships between children who stutter and their non-stuttering classmates.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":586896,"title":"Tackling bullying in your school: A practical handbook for teachers.","authors":[],"date":"1994","doi":"10.1002\/cbm.124","raw":null,"cites":null},{"id":586609,"title":"Test of reception of grammar (Rev.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":586764,"title":"The behaviour and self-esteem of children with specific speech and language difficulties.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":586850,"title":"The bus story.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":586694,"title":"The social skills problems of victims of bullying: Self, peer and teacher perceptions.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":586838,"title":"The socioemotional behaviours of children with SSLD: Social adaption or social deviance?","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586677,"title":"The ways in which speech and language difficulties impact on children‟s access to the curriculum. Child Language Teaching and Therapy,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586828,"title":"Victims of peer aggression.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":586736,"title":"Vulnerability to bullying: Teacher-reported conduct and emotional problems, hyperactivity, peer relationship difficulties, and prosocial behaviour in primary school children.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":586656,"title":"We‟re not friends anymore! Unless…‟: The frequency and harmfulness of indirect, relational, and social aggression.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-07","abstract":"This is an electronic version of an article published in Lindsay, Geoff and Dockrell, Julie and Mackie, Clare (2008) Vulnerability to bullying in children with a history of specific speech and language difficulties. European Journal of Special Needs Education, 23 (1). pp. 1-16. European Journal of Special Needs Education is available online at: http:\/\/www.informaworld.com\/10.1080\/0885625070179120","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/82393.pdf","fullTextIdentifier":"http:\/\/eprints.ioe.ac.uk\/789\/1\/Lindsay2008Vulnerability1.pdf","pdfHashValue":"ff6584623244267d97e7ff8b276e3112231f7b50","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.ioe.ac.uk.oai2:789<\/identifier><datestamp>\n      2015-01-29T08:34:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Vulnerability to bullying in children with a history of specific speech and language difficulties<\/dc:title><dc:creator>\n        Lindsay, Geoff<\/dc:creator><dc:creator>\n        Dockrell, Julie<\/dc:creator><dc:creator>\n        Mackie, Clare<\/dc:creator><dc:description>\n        This is an electronic version of an article published in Lindsay, Geoff and Dockrell, Julie and Mackie, Clare (2008) Vulnerability to bullying in children with a history of specific speech and language difficulties. European Journal of Special Needs Education, 23 (1). pp. 1-16. European Journal of Special Needs Education is available online at: http:\/\/www.informaworld.com\/10.1080\/08856250701791203<\/dc:description><dc:date>\n        2008-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.ioe.ac.uk\/789\/1\/Lindsay2008Vulnerability1.pdf<\/dc:identifier><dc:identifier>\n          Lindsay, Geoff and Dockrell, Julie and Mackie, Clare  (2008) Vulnerability to bullying in children with a history of specific speech and language difficulties.  European Journal of Special Needs Education, 23 (1).  pp. 1-16.  ISSN 0885-6257.  DOI UNSPECIFIED     <\/dc:identifier><dc:relation>\n        http:\/\/eprints.ioe.ac.uk\/789\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.ioe.ac.uk\/789\/"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Vulnerability to bullying 9.8..07   \n 1 \n \nVulnerability to bullying in children with a history of  \nspecific speech and language difficulties \n \n \nGeoff Lindsay \nUniversity of Warwick \nCoventry, England \n \nJulie E. Dockrell \nInstitute of Education, University of London. \nLondon, England \n \nClare Mackie \nUniversity of Warwick, \nCoventry, England \n \n \nAcknowledgements \nThis project was funded by the Gatsby Charitable Foundation. The project has been \ncontinually supported by the children, parents and constructive steering group. \n \nCorrespondence \nProfessor Geoff Lindsay \nCEDAR \nUniversity of Warwick \nCoventry CV4 7AL \nTel:  024 76 523638 \nFax: 024 76 524472 \nEmail: geoff.Lindsay@warwick.ac.uk \n \nVulnerability to bullying 9.8..07   \n 2 \nVulnerability to bullying in children with a history of specific speech and language \ndifficulties \n \nThis study examined the susceptibility to problems with peer relationships and being \nbullied in a UK sample of 12 year old children with a history of specific speech and \nlanguage difficulties. Data were derived from the children‟s self reports and the reports of \nparents and teachers using measures of victimization, emotional and behavioural \ndifficulties, prosocial development and self-esteem, together with measures of the \nchildren‟s language development. Similar prevalence rates for victimization were found \ncompared with matched groups of typically developing children and children with special \neducational needs related to general learninglanguage difficulties. The importance of \nprosocial skills and their relationship with language development, particularly pragmatic \nimpairment, are explored.  \n \n \n \n \n \nKeywords: specific language impairment, specific speech an language difficulties, \nbullying, victimization \n \nVulnerability to bullying 9.8..07   \n 3 \n \nIntroduction \n \n There has been a substantial interest in the prevalence and types of bullying in \nschools. However, there is a lack of studies examining whether groups of children with \nspecific difficulties are more vulnerable than others. Studies of atypical populations \nprovide an opportunity to explore the factors that underpin bullying and thereby \ncontribute to models seeking to explain peer interactions. Difficulties with expressing \nviews and feelings or problems in negotiating social situations, for example, may increase \nthe risk of being bullied. Such problems are characteristic of children with specific \nspeech and language difficulties (SSLD), also referred to as specific language impairment \n(SLI) (Dockrell, et al., 2006) and may make them particularly vulnerable. These children \nhave language difficulties in the absence of intellectual, sensory or neurological \nimpairment and have a level of language functioning below that of their non-verbal \ncognitive ability (Leonard, 1998).  The current study considers the problems of children \nwith SSLD that may place them at risk of being bullied at the age of transfer to secondary \nschools in England, and compares their reported experiences with those of other children \nwith special needs and typically developing age-matched peers.  \n According to Olweus (1991) “a person is being bullied when he or she is exposed \nrepeatedly over time, to negative actions on the part of one or more persons” (p280). \nBullying is viewed as a subtype of aggressive behaviour characterised by the intentional \nand repeated harm of a victim who is physically or psychologically weaker than the \naggressor. Bullying behaviour constitutes a spectrum of actions including physical \nVulnerability to bullying 9.8..07   \n 4 \naggression (e.g. hitting, pushing over), verbal aggression (e.g. name calling, racist \nremarks) and relational harassment involving social manipulation and exclusion and the \nspreading of unpleasant rumours.  \nStudies have revealed bullying to be a significant problem across many countries \n(see Kyriakides et al. (2006) for a review). Prevalence rates have varied substantially \nbetween studies, because of different operational definitions or instruments, or age of \nsample but the general trend is that victimization decreases with age (Pellegrini & Long, \n2002).  It has been proposed that this decline results from young people developing a \nrange of coping skills as they get older, including ignoring the bullying, retaliating and \nimproving their negotiating skills to avoid conflicts or defuse potentially negative \nsituations (Camodeca & Goossens, 2005).  However, there is a need for more research at \nsecondary school age.  Furthermore, interacting with age is change of schooling from \nprimary\/elementary to secondary, typically from a smaller to a larger and more complex \norganisation.  \n Fear of being bullied is a major concern for young people on their transition from \nprimary to secondary school. Negative effects have also been reported on the \ndevelopment of self-esteem in the victims (O‟Moore & Kirkham, 2001) and on their \nconcentration and learning (Sharp & Smith, 1994). Children who are bullied are at risk of \nmental health problems including depression and increased anxiety (Juvonen et al., 2003) \nand have poorer social skills (Fox & Boulton, 2005) with fewer friends (Smith et al., \n1999). In the long term, some children continue to present low self-esteem and \ndepression (Seals & Young, 2003) or even commit suicide (Slee, 1994).  \nVulnerability to bullying 9.8..07   \n 5 \nGender effects in bullying behaviour have been demonstrated but with important \ninteractions: boys are more likely to use physical bullying while girls tend to use non-\nphysical forms including relational bullying (Coyne et al., 2006: Smith et al., 1999). \nHowever, the most common form for both is verbal bullying (Smith et al., 1999). \n Children with special educational needs (SEN) have been identified as a group \nparticularly at risk of victimization and relationship difficulties.  Being a victim of \nbullying or social rejection has been linked to lower intelligence and academic \nachievement (Norwich & Kelly, 2004; Perry et al., 1998) and to stuttering (Davis et al \n2002). Within mainstream schools, children with SEN are more vulnerable to bullying \nand have more difficulties forming social relationships with peers than typically \ndeveloping peers (Martlew & Hodson, 1991), characteristics that can lead to social \nrejection (Frederickson & Furnham, 2004). \n A key question that arises concernsis the causal mechanisms leading to increased \nvictimization and whether these are the same for children\/young people with SEN and, in \nparticular, those with SSLD.  There is evidence for the importance of two different but \nrelated domains: firstly, impaired communication skills related to poorer social cognition \nskills (e.g. the social information processing approach of Crick and Dodge 1994); and \nsecondly, low self esteem (O‟Moore & Kirkham, 2001).  It is also important to consider \nfactors that might reduce risk and enhance resilience, including compensatory resources \nwhere other competences (e.g. prosocial skills) moderate the risk posed by relative \nweaknesses (e.g. language impairment).  \n Mahady et al. (2000) argue for two styles of dealing with being bullied: problem-\nsolving, associated with de-escalation and resolution, and aggression. Children with \nVulnerability to bullying 9.8..07   \n 6 \nSSLD, however, have greater difficulties than typically developing children on a range of \ntasks requiring social interaction (Brinton et al., 1998). Conflict resolution and \nnegotiation have been found to pose specific difficulties for children with SSLD as they \ndemonstrate fewer strategies.  Hence, children with language problems may be at \nparticular risk for social difficulties in peer relationships and hence susceptible to being \nbullied (Redmond & Rice, 1998). Furthermore, Children with SSLD may be at increased \nrisk of being bullied as they are more likely to lack reciprocal friendships and are \nsignificantly lonelier at school than their typically developing age matched classmates \n(Fujiki et al., 1996). \n In considering why children with SSLD often have difficulties interacting with \npeers, it is tempting to conclude that impaired language skills lead directly to social \nproblems. Yet it is important to consider both the extent and the nature of the language \nproblem. Severity of language impairment does not consistently predict levels of peer \nacceptance and there is evidence that receptive rather than expressive language is \ncorrelated with measures of peer acceptance (Craig & Washington, 1993). \nCommunication may also be impaired because of pragmatic difficulties, using language \ninappropriately in a given context (Bishop, 1998; Bishop, et al., 2000). Children with \npragmatic difficulties are thought to have difficulties keeping friends because they cannot \nread social cues, and therefore do not know how to act or what to say in unstructured \nsituations. These children may be at especially high risk of victimization, although this \nwas not found by Conti-Ramsden and Botting (2004) in a study of 11 year old children \nwith SSLD in their last year of primary school.  \nVulnerability to bullying 9.8..07   \n 7 \n Children with SSLD have increased levels of behaviour problems including \ndifficulties with peer relations which might further predispose them to bullying (Lindsay \n& Dockrell, 2000). They are also at higher risk for impaired self esteem (Lindsay & \nDockrell, 2000; Lindsay, et al., 2002). Hence children with language problems may be \nvulnerable to bullying either as a specific result of their language impairment, or as a \nresult of associated behaviour problems and reduced self–esteem. Each of these sets of \nexplanatory variables would indicate that children with language difficulties would \nexperience higher levels of victimization than typically developing peers. Given that \nchildren with other SEN are also at risk of difficulties with communication, peer \nrelationships, lower self esteem, and victimization, it is important to distinguish those \nfactors that are generic to children with additional learning needs from those specific to \nchildren with language impairments. \nPurpose \n The present study had three aims.  Firstly, the study investigated the prevalence of \nvictimization and its relationship with self esteem among children with SSLD at the age \nof transfer to secondary education and compared this with the prevalence for both \ntypically developing children and children with special educational needs resulting from \ngeneral learning difficulties.  The second aim was to explore whether prosocial skills \nexercised a moderating effect on the likelihood of being victimized.  Thirdly, the study \nexplored whether the risk of victimization for the children with SSLD was associated \nwith pragmatic language impairment.   \n   \nMethod \nVulnerability to bullying 9.8..07   \n 8 \nParticipants \n The present study was part of a longitudinal study conducted in two local \nauthorities (LAs) and two regional special schools for children with specific language \nimpairment in the United Kingdom. One LA is a large urban community in the north of \nEngland; the other covers both rural areas and a series of small towns. This project \nfocused on a group of 69 children with SSLD whose first language was English, selected \nwhen they were in Year 3 (about 8 years of age). An initial survey of all educational \n(school) psychologists, speech and language therapists, and schools‟ special educational \nneeds coordinators in the two LAs identified 133 children with SSLD, from whom a \nsubsample of about 30 from each LA was derived. The 59 selected were supplemented by \n10 children attending regional special schools for children with SSLD. There were 52 \nboys and 17 girls, a gender disparity typical of samples of children with SSLD (Leonard, \n1998). At age 8 all children were on their school‟s special educational needs register \nthereby documented as requiring additional learning support to access the curriculum; \n54% had a statement of special educational needs (SEN) under the Education Act 1996.  \nThe statement specifies the provision that must by law be made to meet the child‟s SEN, \na status applied to about 3% of school pupils, over half of whom attend mainstream \nschools. \n The present study comprised 67 of the same children with a history of SSLD (16 \ngirls, 51 boys) in year 7, the first year of secondary education (mean age 12:1, range 11:5 \nto 12:7). Fifty were now attending mainstream schools, either included as individuals in \ntheir local schools or attending a Designated Special Provision within a mainstream \nschool for part of their time, and 17 were attending special schools.   \nVulnerability to bullying 9.8..07   \n 9 \n The children had a history of substantially delayed development on a number of \nlanguage and educational measures when originally tested, at mean chronological age 8 \nyears 3 months: e.g. Bus Story Information (Renfrew, 1967) mean Z = -1.54 (Dockrell & \nLindsay, 1998) – see Table 1. At mean age 10 years 8 months the children continued to \nhave difficulties in language, e.g. British Picture Vocabulary Scale II (Dunn et al., 1997) \nmean Z = -1.2 and literacy, e.g. Neale Analysis of Reading Ability: Revised (Neale, et \nal., 1997) mean Z = -1.46 (Accuracy) and -1.73 (Comprehension), despite non-verbal \ncognitive ability within the normal range, mean Z = -0.54 (British Ability Scales II \nMatrices: Elliott, et al. 1997). Ninety-one per cent of the sample had a gap greater than \n1SD between their non-verbal ability and one or more of the language measures (N = 62). \nThus the sample at 10;8 years continued to have primary language difficulties and the \nlarge majority of the children fell within the category of SSLD as normally defined \n(Plante, 1998).  \n<Table 1 here> \n In addition, two comparison samples had been created in Year 6 for those children \nattending mainstream: a group of typically developing children (TD) and a group of \nchildren with other non-language based learning difficulties, referred to as general special \neducational needs (SEN). For each child in mainstream a typically developing child in the \nsame class who was of the same gender, within the average range of ability with no SEN \nwas selected by the teacher, (N = 42, mean age 11:4 years, range 10:5 to 11:6). This \ncomparison group allows the results of the bullying measure to be compared with a direct \nsample of typically developing peers from the same educational context. The SEN \ncomparison group were also selected by the teacher from children in the same class and \nVulnerability to bullying 9.8..07   \n 10 \nmatched by gender and level of SEN, as estimated by the stage on the 5-stage Code of \nPractice for Identification and Assessment of Children with Special Educational Needs \n(Department for Education, 1994), where the main area of concern was general learning \ndifficulties (N = 32, mean age 11:2 years, range 10:5 to 11:8).  The comparison groups \nwere only possible for children attending mainstream in Year 6 and, in the case of the \nSEN group, where the teacher was able to identify a child on the comparable level of the \n5-stage Code of Practice in the same class. \nConfirmation that the two teacher-selected samples were appropriate was \nobtained by assessing the children‟s reading.  In each case the mean Z scores indicated \nthe TD group to be about average (Neale Accuracy M = 0.28, SD = .60; Neale \nComprehension M = 0.14, SD = .62) whereas both the SSLD and SEN groups were \nfunctioning at a lower level – SSLD: Neale Accuracy M = -1.34, SD = .98; Neale \nComprehension M = -1.55, SD = .86; SEN: Neale Accuracy M = -1.54, SD = .72, Neale \nComprehension, M = -1.69, SD = .67.  In each case one-way Anovas indicated \nstatistically significant between group differences: Neale Accuracy F (2,137) = 59.19, p < \n.0005; Neale Comprehension F (2, 137) = 75.29, p < .0005. Bonferroni post hoc tests \nconfirmed that in each case there was no significant difference between the SSLD and \nSEN groups (p > .05) while for each test both the SSLD and SEN groups were \nsignificantly different from the TD group (p < .0005). \nInstruments \nLife in School (LIS) \n Bullying was measured with the Life in School (LIS), secondary school version, \ncompleted individually by the children (Arora & Thompson, 1987) a 40 item \nVulnerability to bullying 9.8..07   \n 11 \nquestionnaire with a mix of statements describing bullying, friendly and aggressive \nbehaviour. (NB The study by Conti-Ramsden and colleagues used the primary age \nversion of this scale but referred to it as the My Life in School checklist: Conti-Ramsden, \n& Botting, 2004; Knox & Conti-Ramsden, 2003). Children are required to state for each \nitem whether the behaviour happened „more than once‟ (coded 2), „once‟ (coded 1) or \n„not at all‟ (coded 0) during the previous week. The checklist includes six items which \ndescribe bullying behaviour, namely: tried to kick me, threatened to hurt me, tried to \nmake me give them money, tried to hurt me, tried to break something of mine, and tried \nto hit me. These six items produce a Bullying Index with a range of possible scores from \n0 to 12.   \n A limitation of the Bullying Index is that it comprises physical bullying items.  \nConsequently, a new scale was devised for the present study consisting of verbal items \nfrom the LIS, the Verbal Bullying Index, comprising 10 items (range of scores 0-20), \nnamely: called me names, teased me about my family, teased me because I‟m different, \nasked me a stupid question, teased me, told me a lie, was rude about the colour of my \nskin, shouted at me, laughed at me, and told a lie about me.  For clarity, the Bullying \nIndex will be retitled Physical Bullying Index for the present paper.  There are also 15 \nitems in the LIS describing positive behaviour towards the child (e.g. helped me with my \nclass work).  These were used to produce a Prosocial Index (range 0-30). The LIS has \nbeen found to have satisfactory split-half reliability, and to show a high level of \nagreement with the Olweus Questionnaire (Ahmad, 1997). Data are available from \nseveral studies on over 5000 children (Ahmad, 1997; Arora, 1999; Arora & Thompson, \n1987), however,; there has been no standardization study of the scale. Consequently, the \nVulnerability to bullying 9.8..07   \n 12 \npresent study used a typically developing group of children for comparison (see \nParticipants). \nSelf Perception Profile of Children (SPPC) \n The Self Perception Profile of Children (SPPC) (Harter, 1985) was used to \nmeasure the children‟s self-perception or self-esteem. It comprises six subscales, which \naddress five specific domains, namely Scholastic Competence, Social Acceptance, \nAthletic Competence, Physical Appearance, and Behavioural Conduct, together with a \nmeasure of Global Self Worth. Each subscale comprises six items. Children are presented \nwith two written statements and asked to select which one is most like themselves. They \nthen choose whether this statement is either „really true of me‟ or „sort of true of me‟. \nHence there is a four point scale for each item and a possible range of 6-24 for each \nsubscale.  \n Modifications were made to improve the user friendliness of the SPPC for \nchildren with speech and language difficulties. In each case changes were made to \nAnglicise or simplify language without altering the meaning, e.g. „smart‟ was replaced by \n„clever‟;  the negative pole item „BUT Other kids don‟t feel that they are very good when \nit comes to sports‟ was replaced by „BUT other kids don’t feel they are very good at \nsports‟.  To aid focus on the positive-negative distinction, key words e.g. don’t were \nitalicised for emphasis and stressed when read by the researcher. A further modification \nwas to colour code the child‟s answer sheet. The responses to the left hand statement \nwere coded dark green for „really true for me‟ and light green for „sort of true for me‟. By \ncomparison, the right hand statements were coded dark and light purple (See Lindsay et \nal., 2002 for fuller details).  \nVulnerability to bullying 9.8..07   \n 13 \nStrengths and Difficulties Questionnaire \n The parents and teachers of the children with a history of SSLD completed the \nStrengths and Difficulties Questionnaire (SDQ) (Goodman, 1994). The SDQ has five \nscales each comprising five items: Emotional Symptoms, Conduct Problems, \nHyperactivity, Peer Problems, and Prosocial Behaviour. Items are marked „not true‟ (0), \n„somewhat true‟ (1) or „certainly true‟ (2) – range 0-10 for each scale.  The scores for the \nfirst four scales can be summed to produce a total difficulties score (range 0-40) with the \nprosocial scale providing a separate score relating to positive behaviour. Separate score \nranges are specified as „normal‟, „borderline‟ and „abnormal‟ representing 80%, 10% and \n10% of children respectively for both parent and teacher reports..  \nChildren’s Communication Checklist \n The Children's Communication Checklist (Bishop, 1998) was designed to assess \naspects of communication that are clinically important but not well covered by traditional \nlanguage assessments and was designed to be used with children who have an identified \nlanguage difficulty. The CCC comprises nine scales:  \n1. Speech (output, intelligibility, fluency, e.g. people can understand virtually \neverything he says);  \n2. Syntax (complexity of spoken grammar, e.g. speech is mostly two- to three-\nword phrases such as „me got ball‟ or „give dolly‟);  \n3* Inappropriate Initiation (e.g. talks to anyone and everyone; talks too much);  \n4*   Coherence (making sense in conversation, e.g. uses terms like „he‟ and „it‟      \n without making it clear what\/who is being talked about);   \nVulnerability to bullying 9.8..07   \n 14 \n5*   Stereotyped Conversation (using learned chunks or favourite topics of   \n language, e.g. has favourite phrases, sentences or longer sequences which he \n will use a great deal, sometimes in inappropriate situations);   \n6* Context (use of context in understanding conversation, e.g. takes in just one or \n two words in a sentence and so often misinterprets what has been said);   \n7* Rapport (use of conversational cues, e.g. poor at using facial expressions or \n gestures to convey his feelings, may look blank when angry or smile when \nanxious);  \n8. Social (relationships, e.g. is popular with other children; may hurt or upset \nother children unintentionally);   \n9. Interests (restricted interests, e.g. has one or more overriding specific interests \nand will prefer doing activities involving this to anything else).  \n A composite „Pragmatic Impairment‟ score can be derived from the five scales 3- \n7 (marked „*‟ above). (Bishop, 1998). \nOther language measures \n Four language measures, administered as part of the battery of assessment in Year \n6 (mean age 10 years 8 months), will be used in analyses for the present paper to \nestablish the extent of children‟s expressive and receptive language problems at this age. \nReceptive language was measured with the British Picture Vocabulary Scale II (BPVS II) \n(Dunn et al., 1997) and the Test of Reception of Grammar (TROG: Bishop, 1989). \nExpressive language was measured by the Recalling Sentences and Word Structure \nsubtests of the UK version of the Clinical Evaluation of Language Functioning (Semel, et \nal., 1997).  \nVulnerability to bullying 9.8..07   \n 15 \nNon-verbal ability \n Non-verbal ability was assessed by the Matrices subtest of the British Ability \nScales II (BAS II Matrices: Elliott et al., 1996) \nProcedure \n The children were assessed individually on the LIS, SPPC and (for SSLD group \nonly) the language measures by one of the authors (CM), an experienced researcher with \na Masters degree in child development, or by a second researcher who was a qualified \nspeech and language therapist, and assured that the information they provided would be \nconfidential. The SPPC and the LIS were read to the child to ensure that completion of \nthe questions was not compromised by poor literacy skills, which characterised the SSLD \nand SEN groups. \n The teachers and parents each completed the SDQ independently on the SSLD \ngroup only. The form teacher was responsible for completing the SDQ for the children \nattending mainstream and special schools; the teacher who was the head of the \nDesignated Special Provision (e.g. a language unit) completed the SDQ for children \nattending those settings. In some cases the class teacher consulted the child‟s Learning \nSupport Assistant to aid completion of the SDQ; this was especially true for the children \nattending mainstream schools. A meeting was arranged to interview the teachers and \nexplain the completion of the SDQ which was left with them to complete subsequently, \nalong with a reply paid envelope. \n Contact had been maintained with the parents since the beginning of this \nlongitudinal project when the children were about 8 years of age. Previous assurances \nthat all information given would be kept confidential were repeated. Completion of the \nVulnerability to bullying 9.8..07   \n 16 \nSDQ was explained at the interview conducted at home; the SDQ was left with the \nparents along with a reply paid envelope. Responses were received from 58 teachers and \n54 parents.  \nResults \n The distributions of scores for the LIS Physical Bullying Index (PBI) and Verbal \nBullying Index (VBI) revealed significant deviation from a normal distribution \n(Kolmogorov-Smirnoff one sample test). Consequently non-parametric analyses were \ncarried out on these measures, using either the Mann-Whitney test or the Kruskal-Wallis \none-way analysis of variance for independent groups for comparison of between group \nmean scores, and Spearman correlations for analysis of associations. As there were no \nstatistically significant differences for gender on either the PBI (U = 380.5, p = .648) or \nthe VBI (U = 342, p = .330) analyses were conducted on the total SSLD sample. \nParametric tests were used for analyses not including these measures.  Two-tailed tests \nwere used throughout.  As not all of the language and literacy tests produced standardised \nscores, z score transformations were used. \n The results are presented in three sections.  Section 1 presents the comparison of \nthe SSLD, TD and SEN groups‟ results for prevalence of victimization and its \nrelationship with self esteem; Section 2 examines the relationship between victimization \nand prosocial skills for the three groups; Section 3 explores the relationship for the SSLD \ngroup between victimization and these children‟s language abilities, in particular the \ndegree of pragmatic impairment.  \nPrevalence of victimization and relationship with self esteem \nPrevalence of victimization \nVulnerability to bullying 9.8..07   \n 17 \n A child who records any item on the LIS Bullying Index as occurring „more than \nonce‟ during the past week is considered to be at risk of bullying (Smith & Sharp, 1994). \nThis criterion was used for both the PBI and the VBI.  Of the children with SSLD in \nmainstream schools, 28% were in this category (14\/50) on the PBI, with 16% recording at \nleast two instances and 10% recording at least four (Table 2). These are high rates but are \nnot statistically significantly different from those found for the two comparison groups: \n25% of the SEN group reported at least one bullying incident (19% at least two instances, \n6% at least four), and 22% of the TD group (6% recording at least two instances, 6% at \nleast four): X² (2, N = 123) = 0.48, ns.  \n <Table 2 here> \n The results for the VBI were comparable (Table 2) with no statistically significant \ndifference between the three groups: \n2\n (2, N = 123) = 0.06, ns.  Furthermore, although \nthe number of SSLD children reporting being bullied verbally was greater than those that \nreported being physically bullied  (54% v 28%), this was also the case for both the SEN \ngroup (44% v 25%) and TD group (46% v 22%): \n2\n (2, N = 123) = 0.09, ns.  \n There was no significant difference between the SSLD group in mainstream (n = \n50) compared with those SSLD children attending special schools for children with \nlanguage difficulties or moderate learning difficulties (n = 17) for either the PBI: \nMainstream (M = 1.98, SD = 3.37), Special (M = 1.0, SD = 2.24), U = 378.5, p = .449; or \nfor the VBI: Mainstream (M = 4.4, SD = 4.87) Special (M = 3.59, SD = 3.72), U = 397, p \n= .683. Within the mainstream sample, eight children were attending designated special \nprovision: half of these reported physical victimization.  \nSelf-esteem \nVulnerability to bullying 9.8..07   \n 18 \n Table 3 presents the correlations of the PBI, VBI and Prosocial Index (PI) \ncompared with the SPPC scales.  Given the large number of correlations there is a risk of \nType 1 error and so any correlation where p is not < .001 should be treated with caution.  \nConsequently it is concluded that there were no statistically significant correlations \nbetween the SPPC and either Bullying Index. However, the negative correlations for the \nSEN group between physical appearance and PBI (rs (32) = - .48, p = .005) and VBI (rs \n(32) = - .42, p = .015), and between global self worth and PBI ((rs (32) = - .41, p = .019) \nand VBI (rs (32) = -.38, p = .033) are worthy of note as there were common trends. \nFurthermore, the VBI correlated significantly (p <.005) for all three groups with the PBI \nfor all three groups (SSLD: rs (67) = .42, p < .0005; SEN: rs (32) = .74, p < .0005; TD: rs \n(41) = .59, p < .0005).   \n<Table 3 here> \n One way Anovas followed by Bonferroni post hoc tests were conducted to \nexamine differences between SPPC mean scores by group (Table 4). Both the SSLD \ngroup (p = .001) and SEN group (p = .02) had lower scores on social acceptance than the \nTD group. There was a similar pattern for perceptions of scholastic competence, but this \ndifference was statistically significant only for the SEN group (p < .001).    Finally, the \nSSLD group had positive perceptions of their behavioural conduct comparable to those of \nthe TD group and significantly higher scores than those of the SEN group (p = .018). \n<Table 4 here> \nProsocial skills \nThis section examines the relationship between victimization and prosocial skills for the \nthree groups. There was a statistically significant difference on the LIS Prosocial Index \nVulnerability to bullying 9.8..07   \n 19 \nbetween the SSLD, (M = 13.24, SD = 5.6) TD (M = 16.37, SD = 5.66) and SEN (M = \n11.94, SD = 6.83) groups in mainstream schools (F (2,120) = 5.54, p = .005). Bonferroni \npost hoc tests revealed that both the SSLD group (p = .043, d = 0.56) and the SEN group \n(p = .006, d = 0.71) had significantly lower scores on the Prosocial Index than the TD \ngroup with moderate to large effect sizes, indicating fewer positive behaviours received; \nthere was no significant difference between the SSLD and SEN groups. \n The Prosocial Index was not correlated with either victimization index for the \ntotal sample: PBI rs (123) = .01 ns; VBI rs (123) = .14 ns nor when each group was \nanalysed separately, e.g. mainstream SSLD group PBI rs (50) = .11 ns; VBI rs (50) = .03 \nns.  However, the Prosocial Index was significantly correlated with the SPPC Social \nacceptance scale for both the SSLD mainstream sample (r (50) = .60 p < .0005) and the \ntotal SSLD group (r (64) = .51 p <.0005), indicating that children with SSLD who \nperceived themselves as socially accepted also perceived higher levels of positive \nbehaviour directed to them.  This relationship was also found for the TD group (r (41) = \n.39, p = .012) but not for the SEN group (r (32) = .27 p = .138). \n The LIS Prosocial Index correlated positively for the SSLD group with the SDQ \nProsocial scale.  This was statistically significant for the teachers scale (r (57) = .39, p = \n.003) but not the parents scale (r (52) = .22, p = .113).  The LIS Prosocial Index was \nnegatively correlated with the SDQ Peer problems scale; indicating that receiving \nprosocial interactions was less likely when a child had problems with peers.  However, \nthis relationship was statistically significant for parents r (52) = -.33, p = .017, but not for \nteachers r (57) = -.17, p = .212).  The Prosocial Index did not correlate significantly for \nthe SSLD group with any of the language measures (Table 5).  \nVulnerability to bullying 9.8..07   \n 20 \n \nRelationship between victimization and pragmatic impairment for children with SSLD \nIn this section the relationship between victimization and the language abilities of \nchildren with SSLD will be examined.  The main focus will be on pragmatic impairment.  \nAs there were no statistically significant differences between the boys and girls on any \nlanguage test (p > .05), the SSLD sample were taken as a whole for these analyses. \nCorrelations between both the PBI and VBI and all language measures and nonverbal \ncognitive ability (BAS matrices) were nonsignificant (Table 5), indicating no linear \nrelationship between increasing levels of language difficulties and increased risk of \nvictimization. \n<Table 5 here> \n Children within the SSLD group scoring <132 on the CCC Composite score \n(those with pragmatic impairment) were compared on both the PBI and VBI with those \nwithout pragmatic impairment (>132). The cut-off on the PBI was selected at 0 (no \nvictimization) v 1-12 (experience of victimization); the VBI had too few children at 0 so \na cut off of 0-1 v 2-20 was used.  In each case the cut-off was the best estimate for a 50% \nsplit.  Pragmatic impairment was not related to physical victimization (\n2\n (1, N = 61) = \n1.01, ns) but was related to verbal victimization (\n2\n (1, N = 61) = 4.55, p < .05) indicating \nthat children within the SSLD group with pragmatic impairment were less likely to report \nhaving experienced verbal bullying.   \n Neither the PBI (rs (61) = .05 ns) nor the VBI (rs (61) = .12, ns) was correlated \nwith the CCC Composite scale.  However, comparison of the CCC Composite scores \nwith the SDQ Peer Problem scale indicated that peer problems, whether rated by parents \nVulnerability to bullying 9.8..07   \n 21 \nor teachers, were correlated with level of pragmatic impairment: parents rs (48) = -.42, p \n= .003; teachers rs (52) = -.43, p = .001. \n The proportion of children with peer problems on the SDQ (those rated abnormal \nor borderline) in the SSLD sample was substantial: 77% pragmatic impairment, 52% \nnon-pragmatic impairment according to parents; 57%:36% according to teachers, \ncompared with the expectation within a community of 20% (Goodman, 1994).  The \npragmatic impairment group were rated as having higher levels of peer problems (parents \nM = 3.47, SD = 1.7; teachers M = 3.67, SD = 2.31) than the non-pragmatic impairment \ngroup (parents M = 2.52, SD = 1.67; teachers M = 2.45, SD = 2.16); in each case the \ndifference just failed to reach significance: parents t (46) = 1.88, p = .066; teachers t (50) \n= 1.94, p = .058. \nDiscussion \n The purpose of this study was to investigate the extent of bullying experienced by \nchildren with a history of specific speech and language difficulties (SSLD) compared \nwith their typically developing (TD) peers and children with special educational needs \n(SEN) related to general learning difficulties, and to examine the relationship between \nbullying, the children‟s language abilities, prosocial behaviour, their self-esteem and \neducational provision (mainstream v special school). Selection of comparison children \nfrom within the same classes as the SSLD children in mainstream allowed experiences \nspecific to children with SSLD to be distinguished from those common also to children \nwith general learning difficulties and to typically developing children at this point of \ntransition to secondary education. \nVulnerability to bullying 9.8..07   \n 22 \nThe prevalence of physical bullying reported by the mainstream SSLD group was \nhigh (28% reported experiencing at least one type of physical bullying more than once in \nthe previous week) but comparable to that reported by SSLD children in the last year of \nprimary school in Year 6 (Knox & Conti-Ramsden, 2003).  The proportion of the \nmainstream SSLD group in the present study reporting victimization as a result of verbal \nbullying was about twice as high (54%)  As this scale was devised for the present study \nno comparative data are available.  \nThese are high rates of victimization.  However, comparison with TD children \nand those with SEN indicates comparable levels for being the victim of physical bullying \n(22% TD, 25% SEN).  This is almost twice the level reported by Knox and Conti-\nRamsden (2003) for their typically developing children (12%) but that study used a non-\nmatched sample of typically developing children from three primary schools and so the \ndifference in prevalence may reflect a methodological confound. The prevalence of \nverbal bullying experienced by the comparison groups in the present study was also \ncomparable to the SSLD sample (54% SSLD, 46% TD, 44% SEN). Other studies have \nreported high rates for typically developing children. Johnson et al (2002), for example, \nin a study of 7-11 year olds in England also using the LIS reported 33%. Transfer to \nsecondary school is often associated with concerns by pupils and anxiety concerning \nentry to a much larger school.  However, evidence on age trends for bullying does not \nindicate an increase in reported victimization between primary and secondary (Seals & \nYoung, 2003). \nThe current data suggest that at secondary school age children with a history of \nSSLD are not specifically vulnerable to being bullied. However, whether they are able to \nVulnerability to bullying 9.8..07   \n 23 \nmoderate the high level of victimization over time will depend on other social factors. As \nwill be considered below, these social factors may place these children at continued risk \nwhich they are unable to resolve. For example, socially competent children may deal with \nnew challenges of victimization by drawing upon their social skills and forming new \nfriendship groups, so enhancing protective factors (Smith et al., 2004). Children with \nSSLD, however, may not be able to do this and may be more at risk of later adverse \noutcomes to similar levels of victimization. Also, similar rates may not represent equal \nimpact because of different social linkages and peer group support, as suggested by the \ncurrent data on the importance of peer acceptance. \nPrevious studies have reported that children with SSLD have a range of \nbehavioural, emotional and social difficulties including peer problems and aspects of self \nesteem (Conti-Ramsden & Botting, 2004; Lindsay & Dockrell, 2000; Lindsay et al., \n2002). The present study found that both the SSLD and SEN groups had poorer self \nperceptions of social acceptance and scholastic competence than typically developing \nchildren but neither was correlated with likelihood of being bullied. Lower self esteem is \ntypically related to victimization (O‟Moore & Kirkham, 2001), but although global sense \nof self worth was associated with level of victimization for both the SEN and typically \ndeveloping children there was no association for the SSLD group.  In common with \nprevious research (O‟Moore & Kirkham, 2001), concern about physical appearance was \nnot associated with victimization for either the SSLD or typically developing children.  \nHowever, lower self perception of physical appearance was associated with higher levels \nof victimization for children with SEN.  This is an intriguing finding and would benefit \nfrom closer scrutiny to explore the nature of this association.  It is not possible from the \nVulnerability to bullying 9.8..07   \n 24 \npresent study to identify whether the reasons concern bodily appearance (e.g. facial \nfeatures), behavioural manifestations of appearance (i.e. presentation of self) or other \naspects of appearance such as clothing where style, for example, is important.  \nThe SSLD sample had a history of language difficulties which were confirmed to \nbe continuing when they were reassessed at 10 years.  However, there was no correlation \nbetween physical or verbal victimization and any measure of expressive or receptive \nlanguage ability (see also Conti-Ramsden & Botting, 2004). This lack of relationship is \napparently counter-intuitive as other studies have indicated that the ability of children \nwith SSLD to understand language is related to their own behavioural difficulties \n(Lindsay & Dockrell, 2000) although a lack of relationship between language ability and \nvictimization is consistent with Fujiki et al. (1996). However, the finding that pragmatic \nimpairment among the SSLD children was related to self reports of lower levels of verbal \nbullying may reflect lack of awareness of the salience of the interactions rather than \nlower prevalence. As victims generally display more deficits in processing social \ninformation than other children, this finding could suggest children with pragmatic \nimpairments are at greater risk of actual victimization even if they did not recognise all \nthe negative interactions appropriately. \nStudies of victims of bullying have reported increased risk for children with SEN \nand those with poorer peer relations and prosocial skills (Champion, et al., 2003; \nFrederickson & Furnham, 2004; Mishna, 2003).  For the SSLD children, a higher level of \nreceiving positive interactions from peers was associated with a higher level of perceived \nsocial acceptance and teachers‟ ratings of having good prosocial skills.  Children with \nhigher levels of prosocial skills show greater empathic awareness, are more likely to \nVulnerability to bullying 9.8..07   \n 25 \nachieve popular status and are less likely to be rejected (Warden & Mackinnon, 2004).  \nHowever, strengths in this domain did not provide protection against being bullied. \n Contrary to the central trend in the literature that typically developing boys report \nmore direct victimization than girls (Hunter et al, 2004; Olweus, 1991; but see Norwich \n& Kelly, 2004), there was no gender difference in self reports of being bullied by the \nchildren in the SSLD group. Neither were there significant differences in prevalence of \nbullying for the SSLD group by type of educational provision. The previous research \nevidence on this is not consistent. Children with SEN attending mainstream schools have \nbeen found to experience more bullying than their typically developing peers (O‟Moore \n& Hillary, 1989). Martlew and Hodson (1989) and Thompson et al. (1994) have reported \nthat children with SEN in mainstream schools and Designated Special Provision (DSP) \nexperience more bullying than those attending special schools. However, Norwich and \nKelly (2004) found no difference for a sample of children with moderate learning \ndifficulties and Knox and Conti-Ramsden (2003) also found this for children with SSLD, \na finding consistent with the present study.  These differences may reflect the greater \nawareness of bullying and the development of school policies and anti-bullying training \nprogrammes over the past ten years, and the development of positive approaches to \nsupport inclusive education. The higher levels of perceptions of scholastic competence by \nthose attending special schools were also found when the children were 8 years (Lindsay \n& Dockrell, 2000).  This may reflect the „big fish little pond‟ phenomenon (Marsh & \nHau, 2003) where children compare their academic achievements with those of their \npeers.  Lower achieving pupils in mainstream are faced daily with unfavourable \ncomparisons with higher achieving pupils in their class.  \nVulnerability to bullying 9.8..07   \n 26 \n The study has raised a number of methodological questions about research in this \nfield.  The Life in School checklist has not been fully standardised and the original LIS \nBullying Index is limited to six items that are essentially concerned with physical \nvictimization.  To improve the range of types of victimization examined, a new scale \nfrom items within the LIS, the Verbal Bullying Index, was created for the study. \nSimilarly, a Prosocial Index (also using LIS items) was created to explore the children‟s \nperceptions of positive behaviours they experienced.  These scales have proven useful but \nrequire further research to explore their qualities.  Data from the Strengths and \nDifficulties Questionnaire were only available for the SSLD group, thereby limiting \ncomparisons across the different cohorts. Finally, the study drew on self reports of \nvictimization rather than behavioural observations. On the other hand, the study benefited \nfrom reports from both teachers and parents; from the inclusion of comparison groups \nmatched by school class; and from being part of a longitudinal study of a group of \nchildren identified as having SSLD at age 8 and followed up over the next four years, \nincluding their transfer to secondary school. \nConclusions \nChildren with SSLD have an increased risk of comorbid educational and social-\nbehavioural difficulties but although prevalence of victimization at age of transition to \nsecondary school was high, a worrying finding, it was comparable to the prevalence for \nmatched typically developing peers and to that reported for children with  a history of \nSSLD in their last year of primary education. However, as the study used self report it is \npossible that those children with pragmatic impairment were misreading situations. In \nassociation with lower levels of social acceptance and higher levels of peer problems, \nVulnerability to bullying 9.8..07   \n 27 \nthese children‟s prognosis in terms of subsequent susceptibility to victimization may be \nless positive. Furthermore, interventions addressing victimization need to take account of \nthese children‟s impaired communication skills as many programmes put emphasis on \nmethods that engage the children themselves in tackling bullying either informally during \nday to day interactions or as peer counsellors. Hence further research will need to include \nlong term follow up, with direct evidence of victimization rather than, or in addition to, \nself report, as well as comparative data on other children, in order to investigate whether \nreducing prevalence of victimization from these very high levels will require different \nmethods for children with communication difficulties or other SEN.  \n \nVulnerability to bullying 9.8..07   \n 28 \nReferences \nAhmad, Y. (1997) A multi-methodological approach to measuring bullying in schools \nand the effectiveness of one intervention strategy. Unpublished PhD thesis. \nUniversity of Sheffield. \nArora, C.M.J. (1999) Levels of bullying measured by British schools using the „Life in \nSchool‟ Checklist: A case for benchmarking? Pastoral Care,. 17, 17-22 \nArora, C. M. J, and Thompson, D. A. (1987) Defining bullying for a secondary school. \nEducational and Child Psychology, 4, 110-120. \nBishop, D.V.M. (1989) Test of reception of grammar (Rev. ed.). (University of \nManchester, England:  The Author, Age and Cognitive Performance Research \nCentre). \nBishop, D.V.M., (1998) Development of the Children‟s Communication Checklist \n(CCC): A method for assessing qualitative aspects of communicative impairment \nin children.  Journal of Child Psychology and Psychiatry, 39, 879-891. \nBishop, D.V.M., Chan. J., Adams, C., Hartley, J., & Weir, F. (2000) Conversational \nresponsiveness in specific language impairment: Evidence for disproportionate \npragmatic difficulties in a subset of children. Development and Psychopathology, \n12, 177-199. \nBrinton, B., Fujiki, M., & McKee, L. (1998) Negotiation skills of children with specific \nlanguage impairment. Journal of Speech, Language and Hearing Research, 41, \n927-940.  \nCamodeca, M. & Goossens, F.A. (2005) Aggression, social cognition, anger and sadness \nin bullies and victims. Journal of Child Psychology and Psychiatry, 46, 186-197. \nVulnerability to bullying 9.8..07   \n 29 \nChampion, K., Vernberg, E. & Shipman, K. (2003) Non bullying victims of bullies: \nAggression, social skills, and friendship characteristics. Applied Developmental \nPsychology, 24, 535-551. \nConti-Ramsden, G. & Botting, N. (2004) Social difficulties and victimization in children \nwith SSLD at 11 years of age. Journal of Speech, Language, and Hearing \nResearch, 47, 145-161. \nCoyne, S. M., Archer, J., & Eslea, M. (2006) „We‟re not friends anymore! Unless…‟: \nThe frequency and harmfulness of indirect, relational, and social aggression. \nAggressive Behavior, 32, 294-307. \nCraig, W. M., & Washington, J. A. (1993) Access behaviours of children with specific \nlanguage impairment. Journal of Speech and Hearing Research, 36, 322-337. \nCrick, N. R. & Dodge, K. A. (1994) A review and reformulation of social information-\nprocessing mechanisms in children‟s adjustment. Psychological Bulletin, 115, 74-\n101. \nDavis, S., Howell, P. & Cooke, F. (2002) Sociodynamic relationships between children \nwho stutter and their non-stuttering classmates. Journal of Child Psychology and \nPsychiatry. 43, 939-947. \nDepartment for Education (1994) Code of practice for the identification and assessment \nof children with special educational needs. (London, HMSO). \nDockrell, J. E. & Lindsay, G. (1998) The ways in which speech and language difficulties \nimpact on children‟s access to the curriculum. Child Language Teaching and \nTherapy, 14, 117-133.  \nFormatted: Font: Not Italic\nVulnerability to bullying 9.8..07   \n 30 \nDockrell, J.E., Lindsay, G., Letchford, C. & Mackie, C., (2006) Educational provision for \nchildren with specific speech and language difficulties: Perspectives of speech \nand language therapy managers, International Journal of Language and \nCommunication Disorders, 41, 423-440.  \nDunn, L.M., Dunn, L.M., Whetton, C. & Burley, J. (1997) British picture vocabulary \nscale (II). (Windsor, NFER-Nelson). \nElliott, C.D., Smith, P. & McCulloch, K. (1996) British ability scales II: Administration \nand scoring manual. (Windsor, NFER-Nelson). \nFox, C. L. & Boulton, M. J. (2005) The social skills problems of victims of bullying: \nSelf, peer and teacher perceptions. (2005). British Journal of Educational \nPsychology, 75, 313-328. \nFrederickson, N. L. & Furnham, A.F. (2004) Peer-assessed behavioural characteristics \nand sociometric rejection: Differences between pupils who have moderate \nlearning difficulties and their mainstream peers. British Journal of Educational \nPsychology, 74, 391-410. \nFujiki, M., Brinton, B., & Todd, C. (1996) Social skills of children with specific language \nimpairment. Language, Speech and Hearing Services in Schools, 27, 195-202. \nGoodman, R. (1994) A modified version of the Rutter parent questionnaire including \nitems on children‟s strengths. Journal of Child Psychology and Psychiatry, 38, \n581-586 \nHarter, S. (1985) Manual for the self-perception profile for children. (Denver, Co, \nUniversity of Denver). \nVulnerability to bullying 9.8..07   \n 31 \nHunter, S., Boyle, J.M.E. & Warden, D. (2004) Help seeking among child and adolescent \nvictims of peer-aggression and bullying: The influence of school-age, gender, \nvictimization, appraisal, and emotion. British Journal of Educational Psychology, \n74, 375-390. \nJohnson, H.R., Thompson, M.J.J., Wilkinson, S., Walsh, L., Balding, J., & Wright, V. \n(2002) Vulnerability to bullying: Teacher-reported conduct and emotional \nproblems, hyperactivity, peer relationship difficulties, and prosocial behaviour in \nprimary school children. Educational Psychology, 22, 553-556. \nJuvonen, J., Graham, S. & Schuster, M.A. (2003) Bullying among adolescents: The \nstrong, the weak and the troubled. Pediatrics, 112, 1231-1237. \nKyriakides, L., Kaloyirou, C. & Lindsay, G. (2006) An analysis of the revised Olweus \nbully-victim questionnaire for students using the Rasch measurement model. \nBritish Journal of Educational Psychology, 76, 781-801. \nKnox, E. & Conti-Ramsden, G. (2003) Bullying risks of 11-year-old children with \nspecific language impairment (SSLD): Does school placement matter? \nInternational Journal of Language and Communication Disorders, 38, 1-12. \nLeonard, L. B. (1998) Children with specific language impairments. (Cambridge, MA, \nMIT Press). \nLindsay, G., & Dockrell, J. E. (2000) The behaviour and self-esteem of children with \nspecific speech and language difficulties. British Journal of Educational \nPsychology, 70, 583-601. \nVulnerability to bullying 9.8..07   \n 32 \nLindsay, G., Dockrell, J. E., Letchford, B., & Mackie, C. (2002) Self esteem of children \nwith specific speech and language difficulties. Child Language Teaching and \nTherapy, 18, 125-43 \nMahady Wilton, M.M., Craig, W.M. & Pepler, D.J. (2000) Emotional regulation and \ndisplay in classroom victims of bullying: Characteristic expressions of affect, \ncoping styles and relevant contextual factors.  Social Development, 9, 226-245. \nMarsh, H. W. & Hau, K-T. (2003) Big fish little pond effect on academic self-concept: A \ncross-cultural (26-country) test of the negative effects of academically selective \nschools. American Psychologist, 58, 364-376.  \nMartlew, M., & Hodson, J. (1991) Children with mild learning difficulties in an \nintegrated and in a special school: Comparison of behaviour, teasing and teachers‟ \nattitudes. British Journal of Educational Psychology, 61, 355-372. \nMishna, F. (2003) Learning disabilities and bullying: Double jeopardy. Journal of \nLearning Disabilities, 36, 336-347. \nNeale, M., Christophers, U. & Whetton, C. (1997) Neale analysis of reading ability \n(Revised British edition). (Windsor, NFER-Nelson). \nNorwich, B. & Kelly, N. (2004) Pupils‟ views on inclusion: Moderate learning \ndifficulties and bullying in mainstream and special schools. British Educational \nResearch Journal, 30, 43-65. \nOlweus, D. (1991) Bully\/victim problems among school children: basic facts and effects \nof a school based intervention programme. In D. Pepler & K. Rubin (Eds.). The \ndevelopment and treatment of childhood aggression. (Hillsdale, NJ: Erlbaum). \nVulnerability to bullying 9.8..07   \n 33 \nO‟ Moore, A. M & Hillary, B. (1989) Bullying in Dublin schools. Irish Journal of \nPsychology, 10, 426-441.  \nO‟Moore, M. & Kirkham, C. (2001) Self esteem and its relationship to bullying \nbehaviour. Aggressive Behaviour, 27, 269-283. \nPellegrini, A.D. & Long, J.D. (2002)  A longitudinal study of bullying, dominance, and \nduring the transition from primary school through secondary school. British \nJournal of Developmental Psychology, 20, 259-280. \nPerry, D.G., Kusel, S.J. & Perry, L.C. (1998) Victims of peer aggression. Developmental \nPsychology, 24, 807-814. \nPlante, E. (1998) Criteria for SSLD: The Stark and Tallal legacy and beyond. Journal of \nSpeech, Language, and Hearing Research, 41, 951-957. \nRedmond, S., & Rice, M. (1998) The socioemotional behaviours of children with SSLD: \nSocial adaption or social deviance? Journal of Speech, Language and Hearing \nResearch, 41, 688-700.  \nRenfrew, K. (1997) The bus story. (Bicester, Winslow). \nSeals, D. & Young, J. (2003) Bullying prevalence and relationship to gender, grade level, \nethnicity, self-esteem, and depression. Adolescence, 38, 735-747. \nSemel, E., Wiig, E. & Secord, W. (1997) Clinical evaluation of language fundamentals – \nRevised. (UK edition). (London, Psychological Corporation). \nSharp, S., & Smith, P. (1994) Tackling bullying in your school: A practical handbook for \nteachers. (London, Routledge).  \nSlee, P. T., (1994) Situational and interpersonal correlates of anxiety associated with peer \nvictimization. Child Psychiatry and Human Development, 25, 97-107. \nVulnerability to bullying 9.8..07   \n 34 \nSmith, P., Morita, Y., Junger-Tas, J., Olweus, D., Catalano, R., & Slee, P. (Eds.) (1999) \nThe nature of school bullying: A cross national perspective. (London, Routledge). \nSmith, P., Talamelli, L., Cowie, H., Naylor, P., & Chauhan, P. (2004) Profiles of non-\nvictims, escaped victims, continuing victims and new victims of school bullying. \nBritish Journal of Educational Psychology, 74, 565-581. \nThompson, D., Whitney, I. & Smith, P.K. (1994) Bullying of children with special needs \nin mainstream schools. Support for Learning, 9, 103-106. \nWarden, D. & Mackinnon, S. (2003) Prosocial children, bullies and victims: An \ninvestigation of their sociometric status, empathy and social problem-solving \nstrategies. British Journal of Developmental Psychology, 21, 367-385. \n \nVulnerability to bullying 9.8..07   \n 35 \nTable 1:   Mean Z scores (SDs) for language and nonverbal ability of the SSLD group at 8 \nand 10 years.  \n  \n 8 years\n1 \n10 years\n2\n \n Mean Z SD Mean Z SD \nLanguage Measures     \nTest of Reception of Grammar (TROG) -1.45 .94 -1.22 1.02 \nBritish Picture Vocabulary Scale (BPVS) -1.12 .62 -1.20 .71 \nBus Story Information -1.54 1.17 - - \nNaming Vocabulary (BAS) -1.03 .93 - - \nRecalling Sentences (CELF) - - -1.76 .73 \nNonverbal ability     \nMatrices (BAS) -0.76 .88 -0.54 .95 \n \n1\n N = 68\n  \n2 \nN = 67 \n \n \nFormatted Table\nVulnerability to bullying 9.8..07   \n 36 \nTable 2:   Number (%) of SSLD, SEN and TD children in mainstream and special schools \nreporting victimization  \n \n SSLD \nmainstream \nSEN TD SSLD  \nSpecial school \n (n = 50) (n = 32) (n = 41) (n = 17) \nPhysical victimization n % n % n % N % \nNo bullying  item 36 72 24 75 32 78 14 82 \n1  6 12 2 6 6 15 2 12 \n2  1 2 4 13 1 2 0 0 \n3  2 4 0 0 0 0 0 0 \n4  3 6 1 3 0 0 1 6 \n5 1 2 1 3 0 0 0 0 \n6 1 2 0 0 2 5 0 0 \nVerbal victimization         \nNo bullying item 23 46 18 56 22 54 7 41 \n1 13 26 2 6 5 12 6 35 \n2 4 8 1 3 2 5 0 0 \n3 3 6 7 22 7 17 2 12 \n4 1 2 0 0 2 5 1 6 \n5 1 2 3 9 1 2 1 6 \n6 2 4 1 3 1 2 0 0 \n7 1 2 0 0 1 2 0 0 \n8 1 2 0 0 0 0 0 0 \n9 0 0 0 0 0 0 0 0 \n10 1 2 0 0 0 0 0 0 \n \nNote: SSLD: specific speech and language difficulties; SEN: special educational needs; \nTD: typically developing \nVulnerability to bullying 9.8..07   \n 37 \n \nTable 3: Correlations between the Self Perception Profile for Children and the Life \nin School Physical and Verbal Bullying Indexes and Prosocial Index. \n \n \n Physical Bullying Index Verbal Bullying Index Prosocial Index \n SSLD TD SEN SSLD TD SEN SSLD TD SEN \nScholastic achievement  .40 -.29 -.08 -.20 .05 -.21 -.01 .13 .06 \nSocial acceptance -.09 .04 -.28 -.15 .11 -.13       .45***   .33* .21 \nAthletic competence .05 .20 -.25 -.10 .02 -.13 -.02 -.10 -.10 \nPhysical appearance -.01 .01 -.48* -.23 -.05 -.42* -.20 -.16 -.07 \nBehavioural conduct .30* -.31* -.21 -.01 -.16 -.27 .06 .16 .12 \nGlobal self worth -.11 -.33* -.41* -.22 -.10 -.38* .20 .26 -.01 \nNote: SSLD: n = 64; TD: n = 41; SEN: n = 32 \n* p <. 05, ** p = .01, *** p = .001 \n \nVulnerability to bullying 9.8..07   \n 38 \nTable 4 Comparison of means (SDs) of the Self Perception Profile for Children for \nSSLD, SEN and TD groups. \n SSLD TD SEN F \n     \nScholastic competence 2.57 (.73) 2.85 (.55) 2.25 (.60) 7.65*** \nSocial acceptance 2.79 (.64) 3.25 (.48) 2.85 (.75) 7.50*** \nAthletic competence 2.84 (.71) 2.98 (.63) 2.84 (.71) 1.22 \nPhysical appearance 2.98 (.67) 2.97 (.67) 2.83 (.80) 0.39 \nBehavioural conduct 3.04 (.64) 2.90 (.63) 2.66 (.66) 3.90* \nGlobal self worth 3.11 (.54) 3.22 (.56) 3.08 (.68) 0.66 \nN 64 41 32  \n \n* p < .05, ** p < .01, *** p < .001 \n \n \nVulnerability to bullying 9.8..07   \n 39 \nTable 5: Correlations between the Life in School Physical Bullying Index, Verbal \nBullying Index and Prosocial Index , and the language measures for the SSLD group (n = \n66) \n \nLanguage measures PBI VBI PI \nReceptive vocabulary (BPVS) -.06 -.14 .02 \nReceptive grammar (TROG) .10 -.17 -.04 \nExpressive language ( CELF Recalling \nsentences) \n.03 -.02 -.01 \nExpressive syntax (CELF Word structure) .08 -.05 -.04 \nPragmatic difficulties (CCC composite) .05 .12 .17 \nNon-verbal cognitive ability  \n(BAS Matrices) \n \n.07 .06 .33** \n* p <.05 ** p <.01 \n  \n \n \n"}