{"doi":"10.1016\/j.biosystemseng.2007.06.005","coreId":"138269","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1937","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1937","10.1016\/j.biosystemseng.2007.06.005"],"title":"The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies","authors":["Ansorge, Dirk","Godwin, R. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-09","abstract":"One option for ground drive systems with large harvesting equipment is to use rubber-belted tracks; however, little is known about the performance of these systems relative to appropriately sized pneumatic tyres. The effect of self-propelled wheels and a track with high axle loads (9–24 t) on soil compaction were studied. Soil displacement and soil density changes were assessed by embedding talcum powder lines as tracer into the soil during preparation. In addition, soil dry bulk density and penetrometer resistance were measured. The track with loads of both 10.5 and 12 t compacts the soil less than wheels at a 10.5 t load in both weak uniform and stratified soil. Towed implement wheels with a 4.5 t load caused similar soil displacement to the track with a load of 12 t. Tyre inflation pressure had a significant influence on soil parameters. To reduce compaction a larger overall diameter was found to be more beneficial than a wider tyre. This emphasised the importance of contact pressure and its distribution with respect to soil density changes. Total axle loads are less important than how these loads are distributed on the ground","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138269.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1937","pdfHashValue":"8a8b851e67afbcb2429faa609dbbc36afa103505","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1937<\/identifier><datestamp>2014-06-27T12:52:46Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies<\/dc:title><dc:creator>Ansorge, Dirk<\/dc:creator><dc:creator>Godwin, R. J.<\/dc:creator><dc:description>One option for ground drive systems with large harvesting equipment is to use rubber-belted tracks; however, little is known about the performance of these systems relative to appropriately sized pneumatic tyres. The effect of self-propelled wheels and a track with high axle loads (9–24 t) on soil compaction were studied. Soil displacement and soil density changes were assessed by embedding talcum powder lines as tracer into the soil during preparation. In addition, soil dry bulk density and penetrometer resistance were measured. The track with loads of both 10.5 and 12 t compacts the soil less than wheels at a 10.5 t load in both weak uniform and stratified soil. Towed implement wheels with a 4.5 t load caused similar soil displacement to the track with a load of 12 t. Tyre inflation pressure had a significant influence on soil parameters. To reduce compaction a larger overall diameter was found to be more beneficial than a wider tyre. This emphasised the importance of contact pressure and its distribution with respect to soil density changes. Total axle loads are less important than how these loads are distributed on the ground.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2007-10-22T15:55:55Z<\/dc:date><dc:date>2007-10-22T15:55:55Z<\/dc:date><dc:date>2007-09<\/dc:date><dc:type>Article<\/dc:type><dc:format>838617 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>D. Ansorge and R.J. Godwin, The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies, Biosystems Engineering, Vol. 98, Iss 1,  Sept 2007, pp. 115-126<\/dc:identifier><dc:identifier>1537-5110<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1937<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.biosystemseng.2007.06.005<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1537-5110","issn:1537-5110"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":"Ansorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n1\nThe Effect of Tyres and a Rubber Track at High Axle Loads on Soil1\nCompaction, Part 1: Single Axle Studies2\nD Ansorge; R J Godwin3\nCranfield University, Cranfield, Bedford, MK43 0AL, UK; email of corresponding author:4\nd.ansorge.s04@cranfield.ac.uk5\n6\nOne option for ground drive systems with large harvesting equipment is to use rubber7\nbelted tracks; however, little is known about the performance of these relative to appropriately8\nsized pneumatic tyres. We aimed to study the effect of self propelled wheels and a track with9\nhigh axle loads (9-24t) on soil compaction. This was assessed by embedding talcum powder10\nlines as tracer into the soil during preparation to measure soil displacement and soil density11\nchanges. Additionally, soil dry bulk density and penetrometer resistance were measured. The12\ntrack with loads of both 10.5 and 12 t compacts the soil less than wheels at 10.5 t load in both13\nweak uniform and stratified soil. Towed implement wheels with 4.5 t load caused similar soil14\ndisplacement to the track with a load of 12 t. Inflation pressure had a significant influence on15\nsoil parameters and a larger overall diameter is more beneficial than a wider tyre. The study16\nemphasises the importance of contact pressure and its distribution with respect to soil density17\nchanges. Total axle loads are less important than how these are distributed on the ground.18\n19\n20\n1. Introduction21\n22\nThis paper is the first in a series of three; it describes an investigation into the effect of23\ndifferent drive systems on soil compaction in a controlled laboratory environment. The24\nsecond paper deals with the effect of machine configurations on soil compaction and explains25\ntrack behaviour. The final paper extends and develops prediction models to estimate the26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n2\nincrease in soil density from both tyres and rubber tracks and relates these to the experimental1\nresults in the earlier two papers.2\n3\nCereal farmers are under significant pressure due to a reduction in product related4\nsubsidies and a low world market price for cereals. Farmers must either grow in size and raise5\nproductivity or cease operation. In order to gain income with a given amount of produce,6\nproductivity has to increase.7\n8\nProductivity can either be enhanced by more efficient machinery using more sophisticated9\ntechnology or as a result of economies of scale. The current tendency is clearly towards larger10\nmachinery (Kutzbach, 2000), but larger machinery tends to imply heavier machinery and the11\nthreat of soil compaction increases. Raper (2005) has reported that there were no laboratory12\ninvestigations published concerning axle loads significantly higher than 10 t and the13\ncomparison of wheels and tracks was limited to in - field investigations.14\n15\nThe aim of this study was to conduct a fundamental study in a controlled laboratory16\nenvironment into the relative effects of a track and self propelled wheels with axle loads of 9-17\n24 t on soil physical parameters. The effect of soil compaction was assessed by measuring soil18\ndisplacement, changes to soil density and cone penetrometer resistance. The same type of tyre19\nand track as used for the study is shown in Fig. 1 in a field situation.20\n21\n2. Literature Review22\n23\nIn general, tracks are better than wheels at limiting soil compaction (Erbach, 1994).24\nHowever, according to Culshaw (1986) and Erbach (1994) they can have detrimental effects25\nupon soil for several reasons: a) although the calculated mean contact pressure is smaller than26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n3\nfor a wheel, it is applied for longer; b) the idler wheel configuration and track belts with1\ninadequate tension may result in a non uniform pressure distribution, and c) vibrations from2\nthe engine and other machine parts are more readily transmitted into the soil on tracks3\nbecause of the reduced suspension effect.4\n.5\nInvestigations showing the advantage of steel tracks were published by Reaves and Cooper6\n(1960), Soane (1973), Taylor and Burt (1975), Janzen et al. (1985), Erbach et al. (1988),7\nErbach et al. (1991), and Kinney et al. (1992). For a 40 t steel tracked excavator changes in8\npre-compression stress in the topsoil could only be detected in very wet conditions with no9\ndetectable change in the subsoil conditions irrespective of moisture status (Berli et al., 2003).10\nSteel bogie tracks on a trailer are beneficial compared to wheels according to Bygden et al.11\n(2004). However, no differences between a steel tracked and a rubber tyred tractor could be12\ndetected by Burger et al. (1983) and Burger et al. (1985). These authors conclude that13\nmachine related factors other than contact pressure had an influence on the results.14\n15\nThe less rigid belt of rubber tracks, whilst an advantage for highway travel, is a16\ndisadvantage compared with traditional steel track belts on soft surfaces due to the problem of17\nan uneven weight distribution below the rubber belt due to the idler configurations and belt18\ntension effects referred to earlier by Brown et al. (1992). Their results showed that rubber19\ntracks performed in an intermediate manner between those of wheels and steel tracks and20\nwere not significantly different from either.21\n22\nCampbell et al. (1988) found a greater cone penetrometer resistance after using a wheeled23\ntractor even though the rubber - tracked machine had a 24% greater total mass. Comparisons24\nbetween a wheeled and a rubber tracked tractor by Pagliai et al. (2003) showed less soil25\ndensity change and penetrometer resistance increase in the top 100 mm for the wheeled26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n4\ntractor, less for the tracked vehicle between 100 – 200 mm depth and no difference between1\neither at a depth of 200 – 400 mm. This was supported by the results of Servadio et al. (2001)2\nand Brown et al. (1992). Servadio et al. (2001) found lower penetrometer resistance in the top3\n200 mm and a greater resistance between 200 – 400 mm depth for a wheeled tractor in4\ncomparison to a rubber tracked tractor. Brown et al. (1992) found more compaction in the top5\n125 mm for wheeled tractors, but below 125 mm differences were minimal between wheeled6\nand tracked tractors.7\n8\nBlunden et al. (1994) could not detect significant penetrometer resistance differences at9\n500 mm depth between a wheeled and a rubber belted tractor. Between 400 and 500 mm the10\nwheeled tractor produced 0.03 MPa less penetrometer resistance. These results are interesting11\nas the wheeled tractor weighed 18 t and the tracked one 15 t with a mean contact pressure12\nbelow the tracked one which was 25% lower. From this work it is not evident why the13\ndifferences in penetrometer resistance were small but this could be due to unequal pressure14\ndistribution below the track as reported by Weissbach, (2003), Keller et al. (2002) and Tijink,15\n(1994).16\n17\nAll the above results cannot be generalized but they show the importance of designing the18\ntrack frame carrying the rubber belts and transferring the weight whereas the frame is less19\ncrucial for steel tracks. A summary of papers reporting advantages (Bashford et al., 1988 and20\nRusanov, 1991) or disadvantages (Blunden et al., 1994) of tracks on soil compaction is given21\nby Alakukku et al. (2003).22\n23\n24\n3. Methods25\n26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n5\nThe rubber track, harvester tyres and implement tyres used in this study are specified in1\nTable 1. The track was loaded to both 10.5 t and 12 t enabling the comparison of the tyre and2\nthe track under the same overall load and under the same working conditions. The additional3\nweight of the track system for a given combine harvester is 1.5 t per track unit. Three4\ndifferent harvester tyre sizes were selected at the recommended inflation pressure for a 10.5 t5\nload. The medium section width tyre was chosen to be operated at half the recommended6\ninflation pressure to investigate the effect of a lower inflation pressure. The four implement7\ntyres were laden to 4.5 t and inflated to the recommended inflation pressures. These8\nimplement tyres are typical rear tyres of a combine harvester and will be used to mimic whole9\nmachines in the second paper of this series.10\n11\nThe study was conducted in the 20 m long, 1 m deep, and 1.8 m wide soil bin laboratory at12\nCranfield University, Silsoe. The laboratory has been described in detail by Alexandrou and13\nEarl (1998). The soil used was a sandy loam (Cotterham series) with 17% clay, 17% sand and14\n66% sand and water content was maintained at 10% dry base during the studies. Both a15\nuniform and a stratified soil condition were prepared. The uniform soil condition with a dry16\nbulk density of 1.4 g\/cm3 was chosen to imitate soil conditions with a low bearing capacity17\nand to enhance the differences between the single treatments. Under these conditions the18\nbenefit of tracks would be expected to be greatest. The initial penetrometer resistance is19\nshown in Fig. 2 for both the uniform and stratified soil conditions. The stratified soil20\ncondition replicated a real in-field situation with a subsoil, a dense ‘plough layer’ and a soft21\nworking depth, with dry bulk densities of 1.5 g\/cm3, 1.6 g\/cm3, and 1.4 g\/cm3, respectively.22\nThe 900mm\/10.5t\/1.9bar tyre was compared to the T12t type to simulate field loading23\nconditions on the stratified soil.24\nIn addition to the initial values for the stratified soil conditions in the soil bin, Fig. 2 also25\nincludes the penetrometer resistance of a real field condition with a ‘plough layer’. The close26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n6\nagreement of the field and soil bin conditions show that it was possible to replicate these field1\nstrength conditions in the soil bin. The working depth from 0 – 200 mm shows the least2\nresistance, followed by the compacted ‘plough layer’ between 200 – 300 mm, below which,3\nin the subsoil from 300 – 700 mm, the depth penetrometer resistance reduces. The only4\ndifference between field and soil bin conditions is that the plough layer was situated 30 – 405\nmm deeper in the field.6\n7\n3.1. Track and tyre test apparatus8\n9\nTo test the harvester tyres and the track, a test apparatus was designed and built in10\naccordance with the requirements of the study and the soil bin (Godwin et al., 2006). The11\napparatus, shown in Fig. 3 with a track unit before a run (left hand side) and a 900 mm12\nsection width tyre after a run (right hand side), allowed the application of 0 to 14 t on to a self13\npropelled wheel or track mounted on a standard Claas Lexion axle using a hydraulic cylinder.14\nThe test apparatus was self propelled in a similar manner to the single wheel tester built by15\nBillington (1973). However, the load was applied indirectly on to the wheel\/track which16\nsimplified the handling of the rig because the loading weights supplying the counterforce of17\nthe cylinder were spread over the frame of the test rig and remained in place during the18\nchange of drive systems.19\n20\nWheel or track loads could easily be adjusted as the applied load was a function of the21\npressure in the hydraulic cylinder for which the pressure was set using a pressure maintaining22\nvalve. The hydraulic cylinder was also used for lowering the wheel and track onto the surface23\nof the soil and raising it up again. All the forces, except the vertical component, and the24\ntorques developing from both the weight application to and the movement of the wheel and25\ntrack were removed by the use of linear bearings to prevent weight transfer from the axle. The26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n7\naxle was a standard Claas – Lexion combine axle which included the 300 kW hydraulic motor1\nand gear box with the differential locked. The hydraulic power to drive the self propelled2\nwheels and the track using the hydraulic motor on the axle was supplied from a PM10003\nhydraulic pump which was able to supply 60 kW. This, in turn, was driven by a Perkins 63544\n88 kW combustion engine.5\n6\nAdditionally, a fifth wheel could be mounted to the frame to measure the true speed during7\nan investigation using a digital encoder. The speed of the tyre\/track was measured via a8\nsecond digital encoder mounted to the axle. The investigations were carried out at a speed of9\n0.8 m\/s and a slip of 0.14 for the tyres and 0.05 for the track.10\n11\nThe implement tyres were placed in a test rig towed by the soil processor of the soil bin.12\nThe tyre was mounted on a continuous axle supporting the frame which accommodated up to13\n14 t of additional load.14\n15\n3.2. Soil displacement measurement16\n17\nA novel “non - invasive” procedure inspired by a technique of Trein (1995) was used to18\ndetermine soil displacement (strain) and effective density change. This was achieved by19\nplacing talcum powder lines into the soil during preparation of the 20 m long, 1.7 m wide and20\n0.7 m deep soil bin and measuring the change in their relative position following each passage21\nof a tyre or track. Three sets of talcum powder lines were placed along the length of the soil22\nbin. The position of the talcum powder lines was located from the digitized output of two23\ndrawstring transducers connected to a pin drawn to each talcum line appearing in the profile24\nas a point, when the length of each draw string was recorded. From the length of each25\ndrawstring and the distance between the drawstring transducers, the vertical and horizontal26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n8\ncoordinates of each point were calculated. Figure 4 shows the two points on either side of the1\nsoil bin in the areas undisturbed by the tyre\/track which were taken as both depth and lateral2\nposition reference points. The initial positions of the other (central) talcum powder points3\nwere located at equal spacing along these lines from knowledge of their initial relative4\npositions. Compared to the approach taken by Trein (1995) visualization had been enhanced5\nas the talcum powder was much easier and hence faster to locate than the dye used earlier6\nwhile maintaining accuracy.7\n8\nThe mechanical accuracy of the measurements was assessed by printing an imaginary cut9\nthrough the soil bin profile with a large CAD plotter and measuring the position of the points10\nwith the drawstring transducers. Hence the true position of every single point was known and11\nthen compared to its measured position. This comparison showed that the individual position12\nof a single point could be measured to an accuracy of +\/- 2 mm, and the depth of a layer could13\nbe measured to within +\/- 0.5 mm with repeated measurements. Having gained the initial and14\nthe final positions of the talcum powder points, it was possible to draw a vector diagram of15\nthe soil movement from the initial coordinate to the final. Such a vector diagram is shown in16\nFig. 5 for the 800mm\/10.5t\/2.5bar tyre.17\n18\nThe vectors in Fig. 5 exhibit near vertical soil displacement with little sideways movement19\nwhich is independent of section width. Hence, it was concluded that the effect of the wall20\nfriction affecting the soil displacement was of little significance.21\n22\nTo compare the different treatments in one diagram the length of the central four vectors23\nwas averaged for each depth. This average vector length representing the soil displacement of24\nthe central 300 mm for the rut is plotted against depth in Fig. 6 for the 800mm\/10.5t\/2.5bar25\ntyre. Vectors with greater displacement, as shown by the solid line, show a greater change in26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n9\nsoil density and a smaller displacement as shown by the broken line indicate smaller changes1\nin soil density. Figure 6 shows soil displacement as a function of depth, which can be2\ndescribed by the following equation fitted to the top 500 mm (with d(z) being positive with3\ndepth):4\nzsdzd  0)(5\n(1)6\nwhere: d is the soil displacement in mm at a given depth z; d0 is the displacement at the7\nsurface in mm; s is the change in vector length per unit of depth in mm\/mm; and z is the depth8\nin mm.9\n10\nWhen Eqn (1) is differentiated with respect to depth, the displacement change, i.e. the11\naverage increase in soil density is derived:12\nszd )('13\n(2)14\nThus │s│ is a direct measure of the relative increase in soil density caused by vertical soil15\nmovement and will be used to compare the treatments. As stated earlier, the maximum error16\nin measuring the depth of a layer was +\/- 0.5 mm which would result in 1% error of │s│ in17\nthe worst case, i.e. all points line up in such a way that the top has a larger displacement of +18\n0.5 mm than in reality and the bottom has 0.5 mm less than in reality. This is unlikely due to19\nthe large amount of measurements and handling errors do not exist with the drawstring20\nmethod.21\n22\n23\n3.3. Cone penetrometer resistance24\n25\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n10\nCone penetrometer resistance was determined by measuring the force necessary to push a1\n125 mm2, 30o cone into the soil. The data were automatically digitally recorded in 10 mm2\ndepth increments and plotted as penetrometer resistance with respect to depth. Cone3\npenetrometer resistance was measured across the soil bin in ten places (1- 10) at 120 mm4\nspacing for both the initial control and the three replicated positions of the wheel\/track5\npassage. This resulted in diagrams such as Fig. 7. The increase in measured penetrometer6\nresistance at 700 mm depth was due to the penetrometer sensing the bottom of the soil bin.7\nConsequently, the last five readings were always disregarded for statistical analysis. As Fig. 78\nindicates the central four readings were similar and thus averaged.9\n10\n3.4. Dry bulk density11\n12\nDry bulk density (DBD) and moisture content were measured at depths of 0, 250, and 50013\nmm, with three replicates before and after each run, at the centre of the track mark in the soil14\nbin by sampling using a cylindrical ring (60 mm diameter and 51.5 mm deep).15\n16\n3.5. Statistical analysis17\n18\nBefore the statistical analyses were conducted, the normal distribution of the data was19\nalways verified. All parameters were analyzed using generalized linear models to determine20\nwhether there were significant differences between the initial values and the treatment values,21\nbetween single treatments, and for interactions over the depth of measurement collections at22\nthe 95% - level. Variances within the process of taking measurements were accounted for by23\nidentifying appropriate covariance parameters on the level of measurement and replication.24\nAs measurements were taken in the same soil bin several times per run, they have to be25\ntreated as repeated unpaired measurements (Piepho et al., 2004). Normal probabilities were26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n11\nused for multiple comparisons because the standard errors of the different treatments were1\nsimilar in magnitude and differences are implied by analyzing the data as suggested by Nelder2\n(1985).3\n4\n3.6. Repeatability of soil bin preparations5\n6\nDue to the time consuming preparation and data collection procedure, each treatment was7\nusually only carried out once and repeated measurements taken which was taken into account8\nin the statistical analysis. To show repeatability of the results in the soil bin, one treatment9\nwas carried out twice. As Fig. 8 shows, results were repeatable if the soil bin was prepared to10\nthe same initial conditions and the same treatment was applied.11\n12\n4. Results13\n4.1. Uniform soil conditions14\n4.1.1. Soil displacement15\n16\nIn weak uniform soil conditions vertical soil displacement and strain were significantly17\nsmaller for the track compared to the wheels at both normal and half inflation pressures as18\nshown in Fig. 9. This figure shows that there was an expected gradual increase in the slope of19\nthe line with depth which corresponded to a reduction in the density increase with depth.20\nHowever, if the data for depths of 500 mm and less were considered, this effectively gave rise21\nto a near constant slope and thus a uniform change in soil density. Applying this criterion22\nshowed that all treatments were statistically significantly different at the 95% - probability23\nlevel except for the two track loads and the 800mm\/10.5t\/2.5bar tyre from the24\n680mm\/10.5t\/2.2bar tyre.25\n26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n12\nThe nearly identical soil displacement caused by these two tyres shown in Fig. 9 was1\nunexpected as the larger section width was expected to cause less soil displacement than the2\n680mm\/10.5t\/2.2bar. However, the larger diameter of the 680mm\/10.5t\/2.2bar tyre (1.94 m3\ndiameter) gave rise to a larger contact patch than the 800mm\/10.5t\/2.5bar tyre (1.82 m)4\ndiameter (an area of 0.69 m2 compared to 0.62 m2) and hence to the lower contact pressure.5\nThe 900mm\/10.5t\/1.9bar tyre due to its width and inflation pressure produced the least soil6\ndisplacement at the recommended inflation pressure. The effect of reducing inflation pressure7\nfrom 2.5 bar to 1.25 bar for the 800mm\/10.5t tyre produced a significant decrease in soil8\ndisplacement.9\n10\nFigure 9 also shows that the displacement of the soil caused by the tracks was11\napproximately 60 mm at the soil surface and decreased to zero mm displacement at 500 mm12\ndepth. The track at a 12 t load caused 8% more displacement than the track at a 10.5 t load,13\nbut the difference was not statistically significant.14\n15\nFrom Eqn (2) the tyres at a normal inflation pressure increased soil density by 18%, the16\ntyre at half inflation pressure by 12% and the track by 13%. The data for the increase in17\ndensity of individual treatments including the correlation coefficient for the regression lines is18\nshown in Table 2. The higher increase in soil density caused by the tracks was due to their19\nsoil displacement being reduced to zero at 500 mm depth whereas all tyres showed a residual20\nsoil displacement between 8 – 14 mm.21\n22\nFigure 10 shows the soil displacement for the range of implement tyres tested. Larger23\ncontact areas and lower inflation pressure reduced soil displacement. Statistically all24\ncombinations were similar to each other with the exception of the 500-70mm\/4.5t\/2.3bar tyre.25\nThe similarity of the 500-85mm\/4.5t\/1.4bar and 600mm\/4.5t\/1.4bar, with contact areas of26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n13\n0.41 and 0.39 m2, respectively, is similar to the case of the 680mm\/10.5t\/2.2bar and the1\n800mm\/10.5t\/2.5bar. Again the higher section width of the tyre combined with an identical2\ninflation pressure created identical soil displacement as the wider tyre. Despite the potential3\ndifference in carcass stiffness of cross ply vs. radial tyres, the two tyres produced near4\nidentical footprints although with different geometries. The 700mm\/4.5t\/1.0bar tyre was not5\nable to utilize its large section width and low inflation pressure to create a significantly6\nsmaller soil displacement although having the largest contact area of 0.47 m2.7\n8\nThe track at 12 t load in this context caused similar soil displacement to the three lower9\npressure implement tyres at 4.5 t; although the track carried 2.67 times the load. Additionally10\nthe tyres caused a residual soil displacement of 3 – 7 mm at 500 mm depth. The average11\nincrease in soil density caused by the implement tires was similar to the 800mm\/10.5t\/1.25bar12\ntyre, both increasing soil density by 12%. Thus approximately half the load on a smaller tyre13\nincreased density by a similar amount to the total load at half the recommended inflation14\npressure. The individual increases in soil density are listed in Table 2.15\n16\n4.1.2. Penetrometer resistance17\n18\nThe average of the central four penetrometer resistance readings over depth is shown in19\nFig. 11, including both the undisturbed initial readings as a mean over all experiments and the20\nLSD with 5% error probability. This demonstrates that tracks caused a higher penetrometer21\nresistance than tyres at depths close to the surface where the increase in strength can be more22\neasily alleviated. All the tyres had higher penetrometer resistance in the subsoil (below 250 –23\n300 mm) than the tracks.24\n25\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n14\nThe grouping of the tyre configurations (680mm\/10.5t\/2.2bar and 800mm\/10.5t\/2.5bar1\nagainst the 900mm\/10.5t\/1.9bar and 800mm\/10.5t\/1.25bar) indicates a relationship between2\ninflation pressure and penetrometer resistance as the tyres with lower inflation pressures3\ncreated less penetrometer resistance. Again, all comparisons were significantly different with4\nthe exception of the 680mm\/10.5t\/2.2bar from the 800mm\/10.5t\/2.5bar and the two track5\nloads from each other.6\n7\nFrom Fig. 11 it can be seen that the shape and the values of the penetration resistance8\ncurves for the track at both loads of 12 t and 10.5 t were not significantly different, except at9\ndepths between 100 and 200 mm. Below 350 to 400 mm depth the penetration resistance10\napproached that of the initial condition for T10.5t and the difference between the final and11\ninitial conditions was only significant for the T12t. The LSD shown in Fig. 11 did not vary12\nwith depth as the depth factor was accounted for as covariance parameter.13\n14\nThe tracks exhibited a major change in penetrometer resistance close to the surface. For the15\nwheels, the peak penetrometer resistance was smaller near the surface, with the penetrometer16\nresistance in deeper layers being significantly higher than for tracks. Thus the advantage of17\ntracks was that while there was a greater increase in penetrometer resistance this was close to18\nthe surface, where it could be alleviated with shallower tillage operations. The origin and19\nimplications of the peak in penetrometer resistance for the tracks will be discussed in detail in20\nPart II, Multi-Axle Machine Studies.21\n22\nPenetrometer resistance for the implement tyres is shown in Fig. 12 and the values were23\nnot significantly different at the 5% level. The penetration resistance of these tyres were all24\nsignificantly smaller than those of larger harvester tyres.25\n26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n15\n4.1.3. Dry bulk density1\n2\nThe final measured dry bulk density (DBD) for both tyres and tracks was significantly3\nhigher than initial DBD over all depths. The differences were in the range of 0.11 – 0.154\ng\/cm3 and the least significant difference at the 95 % level was 0.046 g\/cm3. The data5\nincluding the least significant difference bars is shown in Fig. 13. The difference between the6\ntyre and track was just significant, whereas the statistical analysis of individual tyres and7\ntracks showed no significant differences. The implement tyres show the same soil density as8\nthe track. In addition the final DBD was estimated from the initial DBD and the slope of the9\nsoil displacement lines and did not show significant differences except for the tyre.10\n11\nFrom these results the conclusion could be drawn that the soil displacement analysis was12\nmore sensitive in determining differences between the single treatments, but the overall trends13\nfollowed a similar pattern.14\n15\nCampell (1994) discussed the difficulty in assessing soil compaction using dry bulk16\ndensity. The soil displacement data had a finer resolution than the dry bulk density. The17\nmeasured increase in DBD for the tyres was on average 11% and for both the tracks and the18\nimplement tyres it was 8%.19\n20\n21\n22\n4.2. Stratified soil conditions23\n4.2.1. Soil displacement24\n25\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n16\nFigure 14 compares the soil displacement in the stratified soil conditions with a simulated1\n‘plough layer’ at a depth between 200 – 300 mm. This figure shows that due to the stronger2\nsoil conditions of the stratified soil, the displacement was reduced to 20 % rut depth and3\nhence soil displacement of that in uniform soil conditions which was included as reference.4\n5\nThe displacement by the track was less than by the tyre over the entire depth and was6\nreduced to zero at 300 mm. The 900mm\/10.5t\/1.9bar, however, pushed the ‘plough layer’7\nwith a small increase in density down into the weaker subsoil. Soil displacement for the tyre8\napproached zero at a depth between 500 – 600 mm.9\n10\n4.2.2. Penetrometer resistance11\n12\nAfter the pass of the 900mm\/10.5t\/1.9bar tyre the penetrometer resistance increased13\nsignificantly as shown in Fig. 15 (a) which exhibits that the tyre increased penetrometer14\nresistance over the whole profile except for the ‘plough layer’. The shape of the penetrometer15\nresistance curve for the tyre was similar for the stratified and uniform soil. The final16\npenetrometer resistance below 130 mm was constant at 2 MPa excluding the ‘plough layer’.17\nThe plough layer did not become stronger, but its thickness was increased by about 20 mm.18\nFigure 14 confirms this as it shows that the ‘plough layer’ was pushed down into the weaker19\nsubsoil increasing the thickness of the ‘plough layer’.20\n21\nThe initial and final penetrometer resistance for the track in stratified soil conditions is22\nshown in Fig. 15 (b). As with the tyre, the final curve was similar to that in uniform soil23\nconditions with a pronounced peak close to the soil surface followed by a reduction in24\npenetrometer resistance. The penetrometer resistance for the final condition merged with that25\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n17\nfor the initial condition above the plough layer. No soil compaction occurred below the1\n‘plough layer’.2\n3\nThe benefit for soil physical conditions after the pass of the rubber track compared to4\nwheel\/tyre systems was clearly shown in uniform and stratified soil conditions. The most5\nsignificant effect of the study was to record how close to the surface the maximum6\npenetrometer resistance can be kept using tracks compared to tyres and that with a ‘plough7\nlayer’ below 200 mm there was no change in penetrometer resistance and hence apparent soil8\nstrength.9\n10\n5. Discussion11\n12\nThe results of this work have shown that soil displacement measurements are a sensitive13\nmethod to determine differences between treatments. The penetrometer resistance could not14\ndetect any differences for the implement tyres, but measuring soil displacement differences15\ncould be detected. Stranks (2006) found similar results during an investigation with pea16\nharvester tyres loaded to 4.5 t.17\n18\nThe rubber track used in this study weighed 1.5 t more, but caused a significantly smaller19\nincrease in soil displacement and penetration resistance than wheels in controlled laboratory20\nconditions. Therefore the overall finding is that rubber belted tracks have significant benefits21\nover the currently available tyre choices, corroborating the work of Erbach (1994). However,22\nit is in contrast to the results by Brown et al. (1992) where rubber tracked vehicles were23\nintermediate to steel tracked and wheeled vehicles but not significantly different from either.24\nThe reason for this may be due to improved frame and belt tension for this track system25\ncompared with those used by Brown et al. (1992) and the controlled conditions. The26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n18\nsignificantly reduced penetrometer resistance in the subsoil was not detected by Blunden et al.1\n(1994), Pagliai et al. (2003) and Brown et al. (1992) when using rubber tracks. Servadio et al.2\n(2001) only found a lower penetrometer resistance below a rubber belted tractor in the range3\nof 200 to 400 mm depth than for a wheeled tractor. The large natural variation in field data4\nmight be a possible reason for this. Research could not be found indicating the reduced5\npenetrometer resistance down to 650 – 700 mm.6\n7\nThese results confirm the results from Bekker (1956) and Hakanson (1988) who state that8\ntyres with a smaller section width can reduce soil compaction when the contact area is9\nmaintained or increased with a longer contact patch resulting from a larger wheel diameter.10\nThe track can achieve this whilst confined to a much smaller vertical envelope.11\n12\nTracked vehicles equipped with such a belt and frame system as those used in this13\ninvestigation may be the answer to the requirement of highly efficient farm machinery14\nsimultaneously protecting the soil as postulated by Hamza and Anderson (2005). Taking the15\nreduced soil compaction in deeper soil areas into account and ignoring the higher soil16\ncompaction close to the surface, where it can easily be alleviated, tracks may be the answer to17\nmaintain high yields in agricultural systems relying on heavy farm machinery in order to18\nmaintain or increase productivity.19\n20\nWith stratified soil conditions the ‘plough layer’ was able to protect the subsoil for the21\ntracked treatment. Brandhuber et al. (2006) were able to show in field measurements the22\nbenefit of tracked sugar beet harvesters. Our results of the 900mm\/10.5t\/1.9bar on the same23\nsoil conditions agree with the findings from Arvidsson et al. (2001), Trautner & Arvidsson24\n(2003) and Yavuzcan et al. (2004) who detected increases in soil density to 0.3-0.4 m for25\nwheeled sugar beet harvesters in field measurements. The subsoil conditions in the soil bin26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n19\nwere insufficiently strong to resist the load without density change as found in field by1\nDickson (1994) on a previously compacted soil after passes with a combine harvester.2\n3\nThe benefit of constant tramlines for all field work shown by Chamen et al. (1994) will4\nwork very well with the track especially as it creates a high penetration resistance close to the5\nsurface which can act as a pathway.6\n7\nThe results of this investigation add to the evidence to support the conclusions for the tyre8\ndata given in Alakukku et al. (2003) and Keller and Arvidsson (2004) and contradiction to the9\nestablishment of an axle load limitation as suggested in Ericsson et al. (1974), Carpenter et al.10\n(1985) and van der Ploeg et al. (2006).11\n12\n6. Conclusions13\n14\n(1) The change in soil physical properties commonly referred to as soil compaction is not a15\nfunction which only is influenced by load; it is also influenced by the spreading of the16\nload over a large contact area. With the same load this study found a range of responses17\nfor different under carriage systems, whereby some caused significantly less soil18\ncompaction than others.19\n(2) The major benefits of ‘Terra Trac’ drive systems over conventional tyre systems were:20\n(a) a reduction in the surface rut depth and the sub-surface soil displacement of21\napproximately 40% compared to that of a tyre system with substantial reductions in22\nthe increase in soil bulk density (i.e. a 13% rather than a 18% increase).23\n(b) a smaller increase in penetrometer resistance in the subsoil layers, albeit with a greater24\nincrease in penetrometer resistance in the surface layers which can be more easily and25\nmore cheaply removed with subsequent shallower tillage operations.26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n20\n(3) The effect on soil displacement and penetrometer resistance from a ‘Terra Trac’ loaded to1\n12 t, whilst higher, is not significantly greater compared to 10.5 t load.2\n(4) Track loads of 10.5 t and 12 t caused similar soil displacement as smaller tyres with 4.5 t3\nof load.4\n(5) Reducing the inflation pressure from 2.5 bar to 1.25 bar for the 800 mm section width tyre5\nsignificantly reduced the penetrometer resistance, surface rut depth, and sub surface soil6\ndisplacement. This effect reduced the increase in dry bulk density from 18% to 12%.7\n(6) Soil compaction in a stratified soil (to simulate a dense layer situated 200\/300 mm deep as8\nin field conditions) in the laboratory stopped at the ‘plough layer’ for the ‘Terra Trac’9\nwhereas the tyre pushed the hard pan into the weaker subsoil below.10\n(7) The results from the layered soil conditions show the benefit in managing hard pans11\neffectively in the intended traffic lanes as they can protect the underlying soil from12\ncompaction.13\n14\nAcknowledgement15\n16\nThe authors want to thank Claas – Company, Harsewinkel, Germany, for its support and17\nGordon Spoor for useful suggestions concerning the work. Thanks must go to Prof. Kutzbach18\nfrom the University of Hohenheim for enabling Dirk Ansorge to participate in the Double19\nDegree Program under which these parts of the study were conducted. The help in analyzing20\nthe data statistically from Prof. Piepho from the University of Hohenheim was very valuable.21\n22\n23\nReferences24\n25\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n21\nAlakukku L; Weisskopf P; Chamen W C T; Tijink F G J; van den Linden J P; Pires S;1\nSommer C and Spoor, G (2003). Prevention strategies for field traffic – induced subsoil2\ncompaction: a review. Part 1. Machine \/ Soil interactions. Soil and Tillage Research3\n73(1-2), 145-1604\nAlexandrou A and Earl R (1998). The relationship among pre-compaction stress, volumetric5\nwater content and initial dry bulk density of soil. Journal or Agricultural Engineering6\nResearch 71(1), 75-807\nArvidsson J; Trautner A; van den Akker J J H and Schjonning P (2001). Subsoil8\ncompaction caused by heavy sugarbeet harvesters in southern Sweden II. Soil9\ndisplacement during wheeling and model computations of compaction. Soil and Tillage10\nResearch 60(1-2), 79-8911\nBashford L L; Jones A J and Mielke L N (1988). Comparison of bulk density beneath a belt12\ntrack and a tyre. Applied Engineering in Agriculture 4(1): 122- 12513\nBekker M G (1956). Theory of Land Locomotion. University of Michigan Press, Ann Arbor14\nMichigan, USA.15\nBerli M; Kirby J M; Springman S M and Schulin R (2003). Modeling compaction of16\nagricultural subsoils by tracked heavy construction machinery under various moisture17\nconditions in Switzerland. Soil and Tillage Research 73(1-2), 57-6618\nBillington W P (1973). The N.I.A.E. MKII Single Wheel Tester. Journal of Agricultural19\nEngineering Research 18(1), 67-7020\nBlunden B G; McBride R A; Daniel H and Blackwell P S 1994. Compaction on an earthy21\nsand by rubber tracked and tyred vehicles. Australian Journal of Soil Research 32(6),22\n1095-110823\nBrandhuber R; Geischeder R and Demmel M (2006) Effects of heavy agricultural24\nmachines for sugar beet harvesting on subsoil physical properties. Proceedings25\nInternational Soil and Tillage Research Organisation, Kiel, Germany26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n22\nBrown H J; Cruse R M; Erbach D C and Melvin S W (1992). Tractive device effects on1\nsoil physical properties. Soil and Tillage Research 22(1-2), 41-532\nBurger J A; Perumpral J V; Kreh R E; Torbert J L and Minaei S (1983). The effect of3\ntrack and rubber – tyred vehicles on soil compaction. ASAE Paper No. 83-16214\nBurger J A; Perumpral J V; Kreh R E; Torbert J L and Minaei S (1985). Impact of5\ntracked and rubber – tyred tractors on a forest soil. Transactions of the American Society6\nof Agricultural Engineers 28(2), 369-3737\nBygden G; Eliasson L and Wasterlund I (2004). Rut depth, soil compaction and rolling8\nresistance when using bogie tracks. Journal of Terramechanics 40(3), 179-1809\nCampbell D J (1994). Determination and use of dry bulk density in relation to soil10\ncompaction. In: Soil Compaction in Crop Production. Developments in Agricultural11\nEngineering 11 (Soane B D; van Ouwerkerk C eds), pp 113 – 139, Elsevier, Amsterdam12\nCampbell D J; Dickson J W and Owen G M (1988). Soil compaction, drawbar pull and13\nstability measurements for Hytracker all terrain vehicle. Dep. Note 14, Scottish Center14\nfor Agricultural Engineering, Penicuik15\nCarpenter T G; Fausey N R and Reeder R C (1985). Theoretical effect of wheel loads on16\nsubsoil stresses. Soil and Tillage Research 6(2), 179-19217\nChamen W T C; Dowler D; Leede P R and Longstaff D J (1994). Design, operation and18\nperformance of a gantry system: experience in arable cropping . Journal of Agricultural19\nEngineering Research 59(1), 45-6020\nCulshaw D (1986). Rubber tracks for agriculture. Div. Note DN 1345, Natl. Inst. Agric.21\nEngng., Silsoe. UK22\nDickson J W (1994). Compaction by a combine harvester operating on moist loose soil. Soil23\nand Tillage Research 29(2-3), 145-15024\nEriksson J; Hakansson I and Danfors B (1974). Effects of soil compaction on soil structure25\nand crop yields. Swedish Institute of Agr. Eng. Bull. 50426\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n23\nErbach D C; Melvin S W and Cruse R M (1988). Effects of tractor tracks during secondary1\ntillage on corn production. ASAE Paper No. 88-16142\nErbach D C; Melvin S W and Cruse R M (1991). Low ground pressure equipment fleets3\nfor crop production. ASAE Paper No. 91-15174\nErbach D C (1994). Benefits of tracked vehicles in crop production. In: Developments in5\nAgricultural Engineering 11. Soil Compaction in Crop Production (Soane B D; van6\nOuwerkerk C eds), pp501-520, Elsevier, Amsterdam7\nGodwin R J; Brighton J L; Blackburn K; Richards T E; Ansorge D and Wheeler P N8\n(2006). Off-road dynamics research at Cranfield University at Silsoe. Proceedings9\nASABE Annual International Meeting, Portland, Oregon.10\nHakansson I; Voorhees W B and Riley H (1988). Vehicle and wheel factors influencing11\nsoil compaction and crop response in different traffic regimes. Soil and Tillage Research12\n11(3-4), 239-28213\nHamza M A and Anderson W K (2005). Review – Soil Compaction in Cropping Systems.14\nA review of the nature, causes, and possible solutions. Soil and Tillage Research 82(2),15\n121-14516\nJanzen D C; Hefner R E and Erbach D C (1985). Soil and corn response to track and wheel17\ncompaction. Proceedings International Conference on Soil Dynamics, National Soil18\nDynamics Laboratory, Auburn, AL, USA19\nKeller T and Arvidsson J (2004). Technical solutions to reduce the risk of subsoil20\ncompaction: effects of dual wheels, tandem wheels and tyre inflation pressure on stress21\npropagation in soil. Soil and Tillage Research 79(2), 191-20522\nKeller T; Trautner A and Arvidsson J (2002). Stress distribution and soil displacement23\nunder a rubber tracked and a wheeled tractor during ploughing, both on land and within24\nfurrows. Soil and Tillage Research 68(1), 39-4725\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n24\nKinney G R; Erbach D C and Bern C J (1992). Soil strain under three tractor1\nconfigurations. Transactions of the American Society of Agricultural Engineers 35 (4),2\n1135-11393\nKutzbach H D (2000). Trends in Power and Machinery. Journal of Agricultural Engineering4\nResearch 76(3), 237-2475\nNelder J A (1985). Discussion of Dr. Chatfield’s paper. Journal of the Royal Statistical6\nSociety. Series A, 148 (3), 2387\nPagliai M; Marsili A; Servadio P; Vignozzi N and Pellegrini S (2003). Changes in some8\nphysical properties of a clay soil in central Italy following the passage of rubber tracked9\nand wheeled tractors of medium power. Soil and Tillage Research 73(1-2), 119-12910\nPiepho H P; Buechse A and Richter C (2004). A mixed modeling approach for randomized11\nexperiments with repeated measures. Journal of Agronomy and Crop Science 190(4),12\n230-24713\nRaper R L (2005). Agricultural traffic impacts on soil. Journal of Terramechanics 42(3-4),14\n259-28015\nReaves C A and Cooper A W (1960). Stress distribution in soils under tractor loads.16\nAgricultural Engineering 41(1): 20-21, 3117\nRusanov V A (1991). Effects of wheel and track traffic on the soil and crop growth and yield.18\nSoil and Tillage Research 19(2-3), 131-14319\nSoane B D (1973). Techniques for measuring changes in the packing state and cone20\nresistance of soil after the passage of wheels and tracks. Journal of Soil Science 24(3),21\n311-32322\nServadio P; Marsili A; Pagliai M; Pellegrini S and Vignozzi N (2001). Effects on some23\nclay soil qualities following the passage of rubber – tracked and wheeled tractors in24\ncentral Italy. Soil and Tillage Research 61(3-4), 143-15525\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n25\nTaylor J H and Burt E C (1975). Track and tyre performance in agriculture. Transactions of1\nthe American Society of Agricultural Engineers 18(1), 3-62\nTijink F G J (1994). Quantification of vehicle running gear. In: Developments in3\nAgricultural Engineering 11. Soil Compaction in Crop Production (Soane B D; van4\nOuwerkerk C eds), pp 391-415, Elsevier, Amsterdam5\nTrautner A and Arvidsson J (2003). Subsoil compaction caused by machinery traffic on a6\nSwedish Eutric Cambiosol at different soil water contents. Soil and Tillage Research7\n73(1-2), 107-1188\nTrein C R (1995). The mechanics of soil compaction under wheels. PhD-Thesis in9\nAgricultural Engineering. Cranfield University, Silsoe College, UK.10\nVan der Ploeg R; Ehlers W and Horn R (2006). Schwerlast auf dem Acker[Heavy load on11\nthe field.] Spektrum der Wissenschaft, August 2006: 80-8812\nWeissbach M (2003). Landtechnische Untersuchungen zur Wirkung bodenschonender13\nFahrwerke an Schleppern und Arbeitsmaschinen mit verschiedenen Radlasten14\n[Agricultural engineering research with of soil protecting drive systems from tractors and15\nself proplled agricultural machinery.] Habilitationsschrift, University of Kiel. Logos16\nVerlag, Berlin17\nYavuzcan G H; Matthies D and Auernhammer H (2005). Vulnerability of Bavarian silty18\nloam soil to compaction under heavy wheel traffic: impacts of tillage method and soil19\nwater content. Soil and Tillage Research 84(2), 200-21520\n21\n22\n23\n24\n25\n26\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n26\nTable 11\nTyre and Track Specifications2\nUndercarriage\nSystem\nLoad\n(t)\nInflation\nPressure (bar)\nAbbreviation\nSection Width\/Load\/Inflation Pressure\n680\/85 R32 10.5 2.2 680mm\/10.5t\/2.2bar\n800\/65 R32 10.5 2.5 800mm\/10.5t\/2.5bar\n900\/65 R32 10.5 1.9 900mm\/10.5t\/1.9bar\n800\/65 R32 10.5 1.25 800mm\/10.5t\/1.25bar\nClaas Terra Trac 10.5 0.75(1) T10.5t\nClaas Terra Trac 12 0.86(1) T12t\n500\/70 R24 4.5 2.3 500-70mm\/4.5t\/2.3bar\n500\/85 R24 4.5 1.4 500-85mm\/4.5t\/1.4bar\n600\/55 – 26.5 4.5 1.4 600mm\/4.5t\/1.4bar\n710\/45 – 26.5 4.5 1.0 700mm\/4.5t\/1.0bar\n(1) mean pressure assuming a contact patch of 1.4 m23\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n27\n1\n2\n3\nTable 24\nAverage Increase in Soil Density for Tyre and Track Specifications5\nUndercarriage System\n(Section Width\/Load\/Inflation\nPressure)\nAverage\nIncrease in Soil\nDensity (%)\nRegression Coefficient of\nregression line\nLeast\nSignificant\nDifference\n680mm\/10.5t\/2.2bar 17.7 0.989 0.1\n800mm\/10.5t\/2.5bar 17.6 0.999 0.1\n900mm\/10.5t\/1.9bar 17.3 0.994 0.1\n800mm\/10.5t\/1.25bar 11.6 0.997 0.1\nT10.5t 12.4 0.952 1.5\nT12t 13.4 0.968 1.5\n500-70mm\/4.5t\/2.3bar 14.3 0.989 0.8\n500-85mm\/4.5t\/1.4bar 11.1 0.968 0.8\n600mm\/4.5t\/1.4bar 11.0 0.985 0.8\n700mm\/4.5t\/1.0bar 10.6 0.995 0.8\n6\n7\n8\n9\n10\n11\n12\n13\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n28\n1\nFig. 1. During harvest a track and a tire identical to the ones used in the study2\n3\n4\n5\n6\n7\n8\n9\n10\n11\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n29\n0\n1 00\n2 00\n3 00\n4 00\n5 00\n6 00\n7 00\n8 00\n0 0,5 1 1,5 2 2,5 3\nPe ne t r o m e te r Re s is tanc e , M P a\nD\ne\np\nth\n,\nm\nm\n1\nFig. 2. Initial penetrometer resistance profiles in the soil bin of uniform and stratified soil2\nconditions and including a field condition: ×, uniform; ■, ♦, stratified one and two; 3\n▲, field condition4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n30\n1\n2\n3\n4\nFig. 3. Single Wheel\/Track test apparatus with a track (left hand side) and a tyre (right hand5\nside)6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n31\n+\/- 2 mm\nLinearly interpolated Control\n1\n2\nFig. 4. Vertical cut through soil with points of talcum powder and the drawstring transducers3\nin the initial condition4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n32\n0 200 400 600 800 1000 1200 1400\n1000\n900\n800\n700\n600\n500\n400\n300\n200\nWidth, mm\nD\nep\nth\n,m\nm\n1\nFig. 5. Vector diagram of soil movement after the pass of an 800mm\/10.5t\/2.5bar tyre2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n33\n1\n2\n3\n4\n5\n6\nFig. 6. Soil displacement vs. depth after a pass of an 800mm\/10.5t\/2.5bar: □, 7\n800mm\/10.5t\/2.5bar; - - ,5% increase; - ,30% increase; and▲ ,LSD8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n0\n100\n200\n300\n400\n500\n600\n700\n0 50 100 150 200\nDisplacement, mm\nD\nep\nth\n,m\nm\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n34\n1\n0\n100\n200\n300\n400\n500\n600\n700\n800\n0 0,5 1 1,5 2\nPenetrometer Resistance, MPa\nD\nep\nth\n,m\nm\n2\nFig. 7. Penetrometer resistance across the soil bin for the 900mm\/10.5t\/1.9bar tyre with ten3\nreadings: •, 1; ■, 2; +, 3; Δ, 4; ×, 5; ♦, 6; , 7; ○, 8; □, 9; and ▲, 104\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n35\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\nFig. 8. Repeated treatments with near identical initials and results: ♦, 680mm\/10.5t\/2.2bar 13\nTest 1; ■, 680mm\/10.5t\/2.2bar Test 1; ▲, Initial Test 1; and ×, Initial Test 214\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n0\n100\n200\n300\n400\n500\n600\n700\n800\n0 0,5 1 1,5 2 2,5\nPenetrometer Resistance, MPa\nD\nep\nth\n,m\nm\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n36\n1\n2\n3\n0\n100\n200\n300\n400\n500\n600\n700\n-20 0 20 40 60 80 100 120\nDisplacement, mm\nD\nep\nth\n,m\nm\n4\nFig. 9. Vertical soil displacement caused by harvester tyres at recommended and reduced5\ninflation pressure and tracks: , 680mm\/10.5t\/2.2bar; ■, 800mm\/10.5t\/2.5bar;6\n×, 900mm\/10.5t\/1.9bar; ♦, 800mm\/10.5t\/1.25bar; □, T10.5t; ▲, T12t; and Δ, 7\nleast significant difference at 95% confidence level at given depth8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n37\n1\n2\n3\n0\n100\n200\n300\n400\n500\n600\n700\n-10 0 10 20 30 40 50 60 70 80\nDisplacement, mm\nD\nep\nth\n,m\nm\n4\nFig. 10. Soil displacement vs. depth for the implement tyres including a track: ♦, 5\n700mm\/4.5t\/1.0bar; ■, 600mm\/4.5t\/1.4bar; □, 500-85mm\/4.5t\/1.4bar; Δ, 500-6\n70mm\/4.5t\/2.3bar;, T12t; and ○, least significant difference at 95% confidence7\nlevel8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n38\n1\n2\n0\n100\n200\n300\n400\n500\n600\n700\n800\n0 0,5 1 1,5 2 2,5\nPenetrometer Resistance, MPa\nD\nep\nth\n,m\nm\n3\nFig. 11. Penetration resistance vs. depth initial and after the pass of the front tyres and the4\ntrack: - , initial; , 680mm\/10.5t\/2.2bar; ■, 800mm\/10.5t\/2.5bar; ♦, 5\n900mm\/10.5t\/1.9bar;  Δ, 800mm\/10.5t\/1.25bar; □, T10.5t; •, T12t; and +, least6\nsignificant difference at 95% confidence level7\n8\n9\n10\n11\n12\n13\n14\n15\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n39\n1\n2\n0\n100\n200\n300\n400\n500\n600\n700\n800\n0 0,5 1 1,5 2 2,5\nPemetrometer Resistance, MPa\nDe\npt\nh,\nm\nm\n3\nFig. 12. Penetrometer resistance for the implement tyres: -, initial; ♦, 700mm\/4.5t\/1.0bar; ■,4\n600mm\/4.5t\/1.4bar; , 500-85mm\/4.5t\/1.4bar; Δ, 500-70mm\/4.5t\/2.3bar; and □,  5\nleast significant difference at 95% confidence level6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n40\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\nFig. 13. Overall dry bulk density initially and finally measured (white bars) and calculated18\nfrom soil displacement (shaded bars) for wheels and for tracks including least19\nsignificant difference bar at 95%-probability20\n21\n22\n23\n24\n25\n26\n1\n1,1\n1,2\n1,3\n1,4\n1,5\n1,6\n1,7\nInitial Final (Wheel) Final (Track) Final (Rear Tyre)\nA\nve\nra\ng\ne\nD\nry\nB\nu\nlk\nD\nen\nsi\nty\n,g\n\/c\nm\n3\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n41\n1\n2\n3\n4\n0\n100\n200\n300\n400\n500\n600\n700\n-20 0 20 40 60 80 100 120\nDisplacement, mm\nD\nep\nth\n,m\nm\n5\nFig. 14. Soil displacement over depth for stratified soil conditions and uniform conditions as6\nreference: , T12t stratified; ♦, 900mm\/10.5t\/1.9bar stratified; ×, T12t; Δ, 7\n800mm\/10.5t\/1.25bar; ■, 800mm\/10.5t\/2.5bar; +, 900mm\/10.5t\/1.9bar; •, least8\nsignificant difference at 95% confidence level9\n10\n11\n12\n13\n14\n15\n16\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n42\n1\n2\n3\n4\n5\n6\n0\n100\n2 00\n3 00\n4 00\n500\n6 00\n700\n8 00\n0 0,5 1 1,5 2 2,5 3\nPe n etr om e te r Re s is tance , M Pa\nD\ne\np\nth\n,\nm\nm\n7\nFig. 15 a. Stratified soil conditions for the 900mm\/10.5t\/1.9bar: initial, ♦, and final, ■,8\nincluding a least significant difference, Δ, at 95% confidence level9\n10\n11\n12\n13\n14\n15\n16\nAnsorge, D. and Godwin, R.J., 2007. The effect of tyres and a rubber track at high axle loads on soil compaction, Part 1: Single axle-studies;\nBiosystems Engineering 98 (1) pp. 115-126\n43\n1\n2\n3\n4\n5\n0\n10 0\n2 0 0\n3 0 0\n4 0 0\n50 0\n6 0 0\n70 0\n8 0 0\n0 0 ,5 1 1,5 2 2 ,5 3\nPenetrom eter Res istance, M Pa\nD\nep\nth\n,m\nm\n6\n7\nFig. 15 b. Stratified soil conditions for the T12t: initial, ♦, and final, ■, including a least8\nsignificant difference, Δ, at 95% confidence level9\n10\n11\n12\n13\n14\n"}