{"doi":"10.2113\/gspalynol.31.1.19","coreId":"62753","oai":"oai:nora.nerc.ac.uk:3508","identifiers":["oai:nora.nerc.ac.uk:3508","10.2113\/gspalynol.31.1.19"],"title":"An effective palynological preparation procedure using hydrogen peroxide","authors":["Riding, James","Kyffin-Hughes, Jane E.","Owens, Bernard"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"Most pre-Quaternary palynology samples are currently prepared by demineralization of the sediment\/sedimentary rock matrix using hydrochloric and hydrofluoric acids (HCl and HF respectively). If a consistently effective alternative to this procedure can be developed, palynological processing will be made significantly less hazardous to both laboratory personnel, and to the wider environment. Furthermore, most non-acid processing methods are normally quicker and cheaper than matrix dissolution using acid. Some authors have previously used hydrogen peroxide (H2O2) to extract palynomorphs by the physico–chemical disaggregation of the clay fraction. However, H2O2 is a powerful oxidizing agent and hence can potentially destroy sedimentary organic material, including palynomorphs. A new method using hot H2O2, where exposure of the sample material to the H2O2 is minimized, has been developed. Crushed sample material in a suitable vessel is placed on a hot plate for one minute, treated with 15–30% H2O2 for 10 minutes, then the residue is diluted with cold distilled water. Disaggregated sample material tends to float, and is decanted into a large vessel containing distilled water to further dilute the H2O2. If any undisaggregated sample remains, the procedure is repeated several times if necessary. Relatively indurated sedimentary lithotypes normally require several treatments. The reason for this stepwise treatment is that the organic material is not exposed to H2O2 for sustained periods, thereby reducing the possibility of palynomorph damage\/degradation due to oxidation. When the sample matrix has been fully disaggregated, the residue can be further processed as appropriate. \\ud\n\\ud\nIn this study, eight samples of Carboniferous, Jurassic, Paleogene, and Quaternary age were prepared quantitatively using the new H2O2 method. These were all prepared using 30% H2O2. For comparison, they were also prepared quantitatively using HCl\/HF and\/or sodium hexametaphosphate [(NaPO3)6]. Quantitative preparations allow the concentration of palynomorphs extracted to be determined, and therefore the effectiveness of the techniques used can be compared objectively. The palynomorph residues derived from these three techniques varied markedly. The H2O2 method does not consistently disaggregate all the sample material, particularly the older and more indurated lithotypes. Some evidence of oxidation effects was observed. Two samples of Mississippian mudstone from the U.S.A. were prepared using H2O2 and (NaPO3)6. Both methods produced abundant miospores, however the H2O2 procedure yielded far higher palynomorph concentrations than the (NaPO3)6 technique. Minor degradation of palynomorphs in the H2O2 preparation was noted. The H2O2 and HCl\/HF methods were compared directly on a palynomorph-rich sample of Upper Carboniferous mudstone from offshore Scotland. Both preparations produced abundant miospores. The HCl\/HF method had significantly higher recovery levels than the H2O2 procedure. It appears that the H2O2 method simultaneously macerates the matrix, and oxidizes any amorphous organic material (AOM) present. In this sample, the HCl\/HF residue was relatively rich in AOM. By contrast, the H2O2 preparation is virtually clear of this phytoclast type, which partially obscures palynomorphs. Two samples of the Middle Jurassic Grantham Formation of eastern England were processed using H2O2 and HCl\/HF. The two methods produced abundant palynofloras of similar palynomorph concentrations. Two dinoflagellate cyst acmes within the Danian (Paleogene) part of the López de Bertodano Formation of Seymour Island, Antarctica were also tested using H2O2, (NaPO3)6, and HCl\/HF. TheH2O2 preparation completely destroyed the dominant taxon, Palaeoperidinium pyrophorum, in one sample. By contrast, the (NaPO3)6 and HCl\/HF preparations produced abundant, fully representative palynofloras. In the other sample, the acme of Spinidinium spp. is completely unaffected by the H2O2 preparation procedure. The final sample of this study is an unconsolidated clay of Late Pleistocene age from offshore Scotland. Both the H2O2 and HCl\/HF preparations proved similar in both taxonomic content and overall palynomorph yield. \\ud\n\\ud\nThe new method of preparation using hot H2O2 has proved to be extremely effective. In particular, it appears to be superior to the (NaPO3)6 procedure for indurated lithotypes. However care should be taken because H2O2 can destroy certain dinoflagellate cysts and kerogen macerals which are especially susceptible to oxidation. Further development work, and more comparative testing of the H2O2, (NaPO3)6, and HCl\/HF procedures, should be undertaken. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62753.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3508\/1\/HYDROGEN_PEROXIDE_MS.pdf","pdfHashValue":"18a514cee1c5ebd238bd00869075155c26c2265b","publisher":"American Association of Stratigraphic Palynologists","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3508<\/identifier><datestamp>\n      2017-03-30T15:41:30Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3508\/<\/dc:relation><dc:title>\n        An effective palynological preparation procedure using hydrogen peroxide<\/dc:title><dc:creator>\n        Riding, James<\/dc:creator><dc:creator>\n        Kyffin-Hughes, Jane E.<\/dc:creator><dc:creator>\n        Owens, Bernard<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Most pre-Quaternary palynology samples are currently prepared by demineralization of the sediment\/sedimentary rock matrix using hydrochloric and hydrofluoric acids (HCl and HF respectively). If a consistently effective alternative to this procedure can be developed, palynological processing will be made significantly less hazardous to both laboratory personnel, and to the wider environment. Furthermore, most non-acid processing methods are normally quicker and cheaper than matrix dissolution using acid. Some authors have previously used hydrogen peroxide (H2O2) to extract palynomorphs by the physico–chemical disaggregation of the clay fraction. However, H2O2 is a powerful oxidizing agent and hence can potentially destroy sedimentary organic material, including palynomorphs. A new method using hot H2O2, where exposure of the sample material to the H2O2 is minimized, has been developed. Crushed sample material in a suitable vessel is placed on a hot plate for one minute, treated with 15–30% H2O2 for 10 minutes, then the residue is diluted with cold distilled water. Disaggregated sample material tends to float, and is decanted into a large vessel containing distilled water to further dilute the H2O2. If any undisaggregated sample remains, the procedure is repeated several times if necessary. Relatively indurated sedimentary lithotypes normally require several treatments. The reason for this stepwise treatment is that the organic material is not exposed to H2O2 for sustained periods, thereby reducing the possibility of palynomorph damage\/degradation due to oxidation. When the sample matrix has been fully disaggregated, the residue can be further processed as appropriate. \\ud\n\\ud\nIn this study, eight samples of Carboniferous, Jurassic, Paleogene, and Quaternary age were prepared quantitatively using the new H2O2 method. These were all prepared using 30% H2O2. For comparison, they were also prepared quantitatively using HCl\/HF and\/or sodium hexametaphosphate [(NaPO3)6]. Quantitative preparations allow the concentration of palynomorphs extracted to be determined, and therefore the effectiveness of the techniques used can be compared objectively. The palynomorph residues derived from these three techniques varied markedly. The H2O2 method does not consistently disaggregate all the sample material, particularly the older and more indurated lithotypes. Some evidence of oxidation effects was observed. Two samples of Mississippian mudstone from the U.S.A. were prepared using H2O2 and (NaPO3)6. Both methods produced abundant miospores, however the H2O2 procedure yielded far higher palynomorph concentrations than the (NaPO3)6 technique. Minor degradation of palynomorphs in the H2O2 preparation was noted. The H2O2 and HCl\/HF methods were compared directly on a palynomorph-rich sample of Upper Carboniferous mudstone from offshore Scotland. Both preparations produced abundant miospores. The HCl\/HF method had significantly higher recovery levels than the H2O2 procedure. It appears that the H2O2 method simultaneously macerates the matrix, and oxidizes any amorphous organic material (AOM) present. In this sample, the HCl\/HF residue was relatively rich in AOM. By contrast, the H2O2 preparation is virtually clear of this phytoclast type, which partially obscures palynomorphs. Two samples of the Middle Jurassic Grantham Formation of eastern England were processed using H2O2 and HCl\/HF. The two methods produced abundant palynofloras of similar palynomorph concentrations. Two dinoflagellate cyst acmes within the Danian (Paleogene) part of the López de Bertodano Formation of Seymour Island, Antarctica were also tested using H2O2, (NaPO3)6, and HCl\/HF. TheH2O2 preparation completely destroyed the dominant taxon, Palaeoperidinium pyrophorum, in one sample. By contrast, the (NaPO3)6 and HCl\/HF preparations produced abundant, fully representative palynofloras. In the other sample, the acme of Spinidinium spp. is completely unaffected by the H2O2 preparation procedure. The final sample of this study is an unconsolidated clay of Late Pleistocene age from offshore Scotland. Both the H2O2 and HCl\/HF preparations proved similar in both taxonomic content and overall palynomorph yield. \\ud\n\\ud\nThe new method of preparation using hot H2O2 has proved to be extremely effective. In particular, it appears to be superior to the (NaPO3)6 procedure for indurated lithotypes. However care should be taken because H2O2 can destroy certain dinoflagellate cysts and kerogen macerals which are especially susceptible to oxidation. Further development work, and more comparative testing of the H2O2, (NaPO3)6, and HCl\/HF procedures, should be undertaken. \\ud\n<\/dc:description><dc:publisher>\n        American Association of Stratigraphic Palynologists<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3508\/1\/HYDROGEN_PEROXIDE_MS.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Riding, James; Kyffin-Hughes, Jane E.; Owens, Bernard.  2007  An effective palynological preparation procedure using hydrogen peroxide.   Palynology, 31. 19-36.  https:\/\/doi.org\/10.2113\/gspalynol.31.1.19 <https:\/\/doi.org\/10.2113\/gspalynol.31.1.19>     \n <\/dc:identifier><dc:relation>\n        http:\/\/palynology.geoscienceworld.org\/<\/dc:relation><dc:relation>\n        10.2113\/gspalynol.31.1.19<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3508\/","http:\/\/palynology.geoscienceworld.org\/","10.2113\/gspalynol.31.1.19"],"year":2007,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nAN EFFECTIVE PALYNOLOGICAL PREPARATION PROCEDURE USING \nHYDROGEN PEROXIDE \n \nJAMES B. RIDING1 \nJANE E. KYFFIN-HUGHES \nBERNARD OWENS \nBritish Geological Survey \nKingsley Dunham Centre \nKeyworth \nNottingham NG12 5GG \nUnited Kingdom \n1corresponding author, e-mail: jbri@bgs.ac.uk \n \n \n \nAbstract \n \nMost pre-Quaternary palynology samples are currently prepared by demineralisation \nof the sediment\/sedimentary rock matrix using hydrochloric and hydrofluoric acids \n(HCl and HF respectively). If a consistently effective alternative to this procedure can \nbe developed, palynological processing will be made significantly less hazardous to \nboth laboratory personnel, and to the wider environment. Furthermore, most non-acid \nprocessing methods are normally quicker and cheaper than matrix dissolution using \nacid. Some authors have previously used hydrogen peroxide (H2O2) to extract \npalynomorphs by the physico-chemical disaggregation of the clay fraction. However, \nH2O2 is a powerful oxidizing agent and hence can potentially destroy sedimentary \norganic material, including palynomorphs. A new method using hot H2O2, where \nexposure of the sample material to the H2O2 is minimised, has been developed. \nCrushed sample material in a suitable vessel is placed on a hot plate for one minute, \ntreated with 15-30% H2O2 for 10 minutes, then the residue is diluted with cold \ndistilled water. Disaggregated sample material tends to float, and is decanted into a \nlarge vessel containing distilled water to further dilute the H2O2. If any \nundisaggregated sample remains, the procedure is repeated several times if necessary. \nRelatively indurated sedimentary lithotypes normally require several treatments. The \nreason for this stepwise treatment is that the organic material is not exposed to H2O2 \nfor sustained periods, thereby reducing the possibility of palynomorph \ndamage\/degradation due to oxidation. When the sample matrix has been fully \ndisaggregated, the residue can be further processed as appropriate. \nIn this study, eight samples of Carboniferous, Jurassic, Paleogene, and \nQuaternary age were prepared quantitatively using the new H2O2 method. These were \nall prepared using 30% H2O2. For comparison, they were also prepared quantitatively \nusing HCl\/HF and\/or sodium hexametaphosphate [(NaPO3)6]. Quantitative \npreparations allow the concentration of palynomorphs extracted to be determined, and \ntherefore the effectiveness of the techniques used can be compared objectively. The \npalynomorph residues derived from these three techniques varied markedly. The H2O2 \nmethod does not consistently disaggregate all the sample material, particularly the \nolder and more indurated lithotypes. Some evidence of oxidation effects was \nobserved. Two samples of Mississippian mudstone from the U.S.A. were prepared \nusing H2O2 and (NaPO3)6. Both methods produced abundant miospores, however the \nH2O2 procedure yielded far higher palynomorph concentrations than the (NaPO3)6 \n 2\ntechnique. Minor degradation of palynomorphs in the H2O2 preparation was noted. \nThe H2O2 and HCl\/HF methods were compared directly on a palynomorph-rich \nsample of Upper Carboniferous mudstone from offshore Scotland. Both preparations \nproduced abundant miospores. The HCl\/HF method had significantly higher recovery \nlevels than the H2O2 procedure. It appears that the H2O2 method simultaneously \nmacerates the matrix, and oxidizes any amorphous organic material (AOM) present. \nIn this sample, the HCl\/HF residue was relatively rich in AOM. By contrast, the H2O2 \npreparation is virtually clear of this phytoclast type, which partially obscures \npalynomorphs. Two samples of the Middle Jurassic Grantham Formation of eastern \nEngland were processed using H2O2 and HCl\/HF. The two methods produced \nabundant palynofloras of similar palynomorph concentrations. Two dinoflagellate \ncyst acmes within the Danian (Paleogene) part of the Lopez de Bertodano Formation \nof Seymour Island, Antarctica were also tested using H2O2, (NaPO3)6, and HCl\/HF. \nThe H2O2 preparation completely destroyed the dominant taxon, Palaeoperidinium \npyrophorum, in one sample. By contrast, the (NaPO3)6 and HCl\/HF preparations \nproduced abundant, fully representative palynofloras. In the other sample, the acme of \nSpinidinium spp. is completely unaffected by the H2O2 preparation procedure. The \nfinal sample of this study is an unconsolidated clay of Late Pleistocene age from \noffshore Scotland. Both the H2O2 and HCl\/HF preparations proved similar in both \ntaxonomic content and overall palynomorph yield. \n The new method of preparation using hot H2O2 has proved to be extremely \neffective. In particular, it appears to be superior to the (NaPO3)6 procedure for \nindurated lithotypes. However care should be taken because H2O2 can destroy certain \ndinoflagellate cysts and kerogen macerals which are especially susceptible to \noxidation. Further development work, and more comparative testing of the H2O2, \n(NaPO3)6, and HCl\/HF procedures, should be undertaken. \n \nKey words: palynomorph preparation techniques; hydrogen peroxide; Carboniferous; \nJurassic; Paleogene; Quaternary; Antarctica; U.K.; U.S.A. \n \n \nINTRODUCTION \n \nThe traditional method of extracting palynomorphs from the sediment matrix \nuses hydrochloric acid (HCl) and hydrofluoric acid (HF) to remove the carbonate and \nsilicate minerals respectively (Gray, 1965; Doher, 1980; Phipps and Playford, 1984; \nTraverse, 1988; Wood et al., 1996). Nitric acid (HNO3) or other aggressive oxidizing \nagents are also normally used to remove any extraneous organic material. Due to the \ntoxicity of these mineral acids, these procedures must be done in a fume hood. This \nprocedure is potentially hazardous and polluting. Therefore effective non-acid \npreparation techniques would be significantly preferable. Other disadvantages of acid \ndigestion are that the reagents are relatively expensive and reaction times can be long. \nRecently, a non-acid method using sodium hexametaphosphate [(NaPO3)6] was \ndescribed (Riding and Kyffin-Hughes, 2004; 2006; Riding et al. 2006). In this \nmethod, the (NaPO3)6 deflocculates the clay minerals, so they can be sieved away in \norder to concentrate the organic fraction. This non-acid technique is generally quicker \nand hence cheaper than the traditional acid-based procedure; it is unequivocally \nsignificantly safer and more environmentally friendly. It also has the significant \nadvantage that it also extracts palynomorphs and other microfossils, notably \nsilicofossils (Riding and Kyffin-Hughes, 2004, text-figs 6e, f)). The (NaPO3)6 method \n 3\nhas been tested on material of Ordovician, Carboniferous, Jurassic, Cretaceous, \nPaleogene, and Quaternary age. It appears to be less effective on carbonates and \nrelatively highly indurated siliciclastic sample material (Riding and Kyffin-Hughes, \n2004; 2006). The purpose of this contribution is to describe a new preparation method \nusing hot hydrogen peroxide (H2O2), and to report the results of testing this procedure \non Carboniferous, Jurassic, Paleogene, and Quaternary sample material. \n \n \nTHE PREVIOUSLY DESCRIBED USE OF HYDROGEN PEROXIDE IN \nPALYNOLOGICAL PROCESSING \n \nHydrogen peroxide (H2O2) physico-chemically disaggregates clay-rich \nsediments\/sedimentary rocks, and therefore can extract calcareous microfossils, \nphosphatic microfossils, palynomorphs, and silicofossils. The effect of H2O2 on \nsediments and sedimentary rocks is simultaneously to break down the fabric, and to \noxidize the organic material. Because H2O2 is a powerful oxidizing agent, great care \nmust be taken to avoid damage to, and\/or degradation of, the less robust \npalynomorphs (Hopkins and McCarthy, 2002). Leschik (1956) and Brown (1960) \ndescribed using H2O2 to prepare brown coal; the H2O2 oxidizes the powdered coal \nprior to other chemical treatment. Smith and Butterworth (1967, p. 102) also \ndescribed a procedure for preparing lignites by boiling in H2O2. These authors gently \nboiled 1 g of powdered coal in 50 ml of 100% H2O2 for at least six hours to oxidize \nthe coal. Smith and Butterworth (1967) warned that if the coal is pyritic, this reaction \ncan be violent. Funkhouser and Evitt (1959), Traverse (1988), and Eshet and Hoek \n(1996) mentioned the use of H2O2 as an oxidizing agent, used following HCl\/HF \ndigestion. Furthermore, Jenkins (1967), Doher (1980), and Batten (1999) stated that \nH2O2 can be used to bleach darkened palynomorphs due to its oxidizing properties. \nCollinson (1980) briefly described the use of H2O2 to disaggregate a silty clay of Late \nEocene age. The residue was sieved after H2O2 treatment, and palynomorphs were \nrecovered. The extraneous mineral matrix was removed using HF, and the \npalynomorphs lightened with Schultze’s solution. This disaggregation using H2O2 was \npreviously used to extract sporangia from Paleogene clays from southern England \n(Collinson, 1978). Here the clays were soaked in dilute H2O2 solution for between 15 \nand 60 minutes. The H2O2 disaggregates the clay much more effectively than water or \nsodium carbonate (Na2CO3) solution. Pearson and Scott (1999) mentioned that 10% \nH2O2 can be used to disaggregate some clay-rich lithotypes in order to release \nmegaspores. Riding and Kyffin-Hughes (2004; 2006) outlined the use of H2O2 \ntreatment for 15-20 minutes in order to break down rock fragments that resisted \ndisaggregation using (NaPO3)6. Another significant paper on this topic is Williams et \nal. (2005) who described palynomorph preparation using H2O2, and demonstrated its \nutility in five case histories. These authors stated that trial and error are required to \ndetermine both the optimum concentration of H2O2, and the timing of the treatment. \nThe nature of the palynomorphs and the lithology of the sample material determine \nboth these parameters. Clay-rich material which has been buried to less than 3000 m \nneeds a 6% H2O2 solution. If the sample material is siltstone, and\/or has been deeply \nburied, a 12% solution of H2O2 is preferable. The duration of the H2O2 treatment can \nvary from between 1 and 30 minutes, depending on the rate of disaggregation. \nWilliams et al. (2005) used 3% to 12% H2O2, and noted that certain dinoflagellate \ncyst taxa such as Palaeoperidinium pyrophorum can be destroyed. This phenomenon \ncan be prevented by reducing the concentration of the reagent, and the duration of the \n 4\ntreatment. When the sample is adequately disaggregated, the residue is passed through \na nest of sieves with mesh sizes from 63 μm to 1 mm, and gravity-separated to \nconcentrate the palynomorphs. The residue is cleaned of fine mineral particles and \nkerogen using sieves and detergent. Riding and Kyffin-Hughes (2006) prepared three \nPaleozoic samples using H2O2. The crushed sample was heated to 70˚C, covered in \nH2O2, and left for five minutes. It was then diluted with water at 60˚C and left for 15 \nminutes, or until any reaction was complete. The residue was sieved at 10 μm in order \nto remove the fine extraneous debris, then at 500 μm to remove any >500 μm \nfragments. The process was repeated as many times as necessary until all the >500 \nμm fragments have disaggregated. The mineral fraction was separated using a suitable \ngravity method. This method proved ineffective on the Lower Ordovician \n(Tremadocian) Shineton Shale Formation and the Lower Carboniferous Lawmuir \nFormation. These were not fully disaggregated by this method. By contrast, a sample \nof the Lower Carboniferous Ballagan Formation produced a moderately abundant \npalynoflora using H2O2, but this was not as rich as the preparations made using \nHCl\/HF digestion and (NaPO3)6 (Riding and Kyffin-Hughes, 2006, table 1, pl. 2, figs. \n1, 2). The reduced yield may be due to the oxidizing effects of H2O2. \nHydrogen peroxide is therefore an extremely important reagent in \npalynological preparation, especially when the use of mineral acids is precluded. \nHowever, because of the oxidizing effects of H2O2, more development work is needed \nto accurately assess its potential. \n \n \nTHE NEW METHOD OF PALYNOMORPH PROCESSING USING HOT \nHYDROGEN PEROXIDE \n \n The method used in this study is described step-by-step in Appendix 1. Firstly \nthe sample material is crushed, or broken up, to maximise the surface area in contact \nwith the H2O2, and to minimise any mechanical damage to the palynomorphs. The \nfragmented sample is heated to ca. 100˚C and treated with 15-30% H2O2 for 10 \nminutes. The concentration of the H2O2 is dependent upon the induration level of the \nsample material. It was found that H2O2 is more effective on sample material which \nhas been pre-heated. The residue is then diluted with water, causing the disaggregated \nmaterial to float. This is decanted into a beaker containing water to dilute the H2O2. \nFrequently, some undisaggregated sample will remain. Therefore, the \nundisaggregated residue is reheated, and the 10 minute maceration in H2O2 is repeated \nas many times as necessary until all the sample is broken down. It may be possible \nand\/or necessary to extend the treatment time, leaving the residue for longer than 10 \nminutes. When all of the sample material is entirely disaggregated, the aqueous \nresidue can be further processed as appropriate. \n The new method described here and the procedure of Riding and Kyffin-\nHughes (2006, p. 87) are somewhat similar. They are both based on the exposure to \nthe heated sample material to H2O2 for relatively short periods of time (5-10 minutes) \nin order to disaggregate the outer surface. The treatment is done in a stepwise fashion \nso that the organic materials are not exposed to H2O2 for prolonged periods, hence the \npossibility of damage by oxidation is minimised. The new method is considered to be \nsuperior to that of Riding and Kyffin-Hughes (2006) because the sample has less \ncontact time with the H2O2, and the residue does not need to be sieved after each \nexposure to H2O2. These factors meant that palynomorph losses via oxidation and \nduring sieving are minimised. \n 5\n \n \nHYDROGEN PEROXIDE – BACKGROUND AND HEALTH\/SAFETY \nASPECTS \n \nThe systematic name of H2O2 is dihydrogen dioxide, but it is universally \nknown as hydrogen peroxide. Pure H2O2 is a pale blue liquid, however it is colorless \nin dilute solution. It is a weak acid, and slightly more viscous than water. Because of \nits strong oxidizing properties, it has been used as a bleaching agent (e.g. for human \nhair), a disinfectant, and a propellant. Hydrogen peroxide is used extensively to \nbleach paper and pulp, and in the chemical industry. \nThe principal hazards of H2O2 are that it is a strong oxidant and it is corrosive, \nespecially at concentrations greater than 50%. However, typical concentrations are \nbetween 3 and 35%; solutions greater than 60% present markedly increased risks. It is \nnon-flammable, however it can form potentially explosive compounds when \ncombined with several other chemicals and materials. The latter include inorganic and \norganic compounds, and metallic elements. Furthermore, H2O2 readily dissociates, \nespecially when heated, to form water and oxygen. Naturally, any build-up of oxygen \nrepresents an increased fire hazard. Hence it should not be stored, or used, close to \nany potential fuels. The concentrations of H2O2 used in microfossil extraction sensu \nlato (i.e. <30%) are such that these hazards are minimal, given safe laboratory \npractice. For example, potentially explosive H2O2 vapor is only given off using ca. \n>70% H2O2 at >70°C. It also should be stored in cool conditions in robust containers \nmade from a neutral (i.e. nonreactive or noncatalytic) material. Up to date safety data \nfor 30% H2O2 are given as a Manufacturer’s Safety Data Sheet at: \nhttp:\/\/ptcl.chem.ox.ac.uk\/MSDS\/HY\/hydrogen_peroxide_30pc.html. \nIn terms of safe palynology laboratory operations, this means storing the H2O2 \nin a suitable cool, dark place which is well separated from any potential fuels. It \nshould be handled with care, as all chemical reagents are in a well run laboratory. \nHydrogen peroxide is far less corrosive than hydrochloric and hydrofluoric acids, but \nshould be used with similar safeguards and precautions. This is a new technique, and \nevery laboratory undertaking this procedure should undertake a thorough risk \nassessment. The principal risk associated with the method is the fact that when heated, \nH2O2 gives off oxygen. Therefore, H2O2 should be used in an efficient fume cupboard \nwhile wearing adequate personal protective equipment, most importantly safety \nglasses and acid-resistant gloves. The most important factor is that the fume cupboard \neffectively removes the oxygen which is given off so that there is no build-up in the \nfume cupboard. The use of H2O2 in the technique described herein is entirely safe, \nprovided there are no potential fuel materials in the fume cupboard, and\/or substances \nwhose vapor could mix with the oxygen given off during the maceration. Due to the \nwide range of materials which are flammable in the presence of increased oxygen \nlevels, H2O2 macerations should be done in a dedicated, otherwise empty, fume \ncupboard with the sash down. Obviously, a fuel vapor\/oxygen mixture is potentially \nexplosive and flammable. This means, for example, that organic liquids should not be \nin, or near to, the fume cupboard during maceration with H2O2. \n \n \nMATERIALS AND METHODS \n \n 6\nIn this study, eight samples of Carboniferous, Jurassic, Paleogene, and \nQuaternary age were prepared using hot 30% H2O2. For comparative purposes, the \nsamples were also prepared using the traditional HCl\/HF acid digestion technique \nand\/or the technique using (NaPO3)6 of Riding and Kyffin-Hughes (2004). The \nsamples are listed in Appendix 2, and selected low-magnification photomicrographs \nof the residues are presented in Plates 1-5. All rock samples, organic residues, \nmicroscope slides, primary data, and illustrated material are housed in the collections \nof the British Geological Survey (BGS), Keyworth, Nottingham, U.K. All the \npalynomorph taxa at and below species level which are mentioned are listed in \nAppendix 3, with their respective author citations. The new preparation procedure \nusing H2O2 is outlined in Appendix 1. The eight samples were prepared quantitatively \nusing the method described by Harland (1989) and Gelsthorpe (2002). This allows the \npalynomorphs extracted per gram of sample to be determined. This quantitative \nmethod allows the effectiveness of both the techniques used to be objectively \ncompared. The quantitative results are given in Table 1. The palynomorph residues \nderived from the H2O2, (NaPO3)6, and HCl\/HF preparations vary significantly. For \nexample, the H2O2 treatment does not consistently disaggregate all the sample \nmaterial, especially in the case of some of the older and more indurated sedimentary \nrocks (Table 1). \n \n \nCASE STUDIES \n \nThe Portsmouth Member, Cuyahoga Formation (Lower Carboniferous, \nMississippian, Kinderhookian\/Osagean) of the Springville Hill road cutting, \nSouth Portsmouth, Kentucky, U.S.A (samples 1 and 2; H2O2 and (NaPO3)6 \npreparation methods, both quantitative) \n \nTwo samples of the Portsmouth Shale Member of the Cuyahoga Formation \nwere collected from Springville Hill road cutting, directly across the Ohio River from \nPortsmouth, Ohio. The Two Mile Hill section, north of Portsmouth, is traditionally \nregarded as the type section of the Portsmouth Shale Member, but no formal type \nsection was designated by Hyde (1915). The Springville Hill road cutting is \nconsidered to be an important reference section. This succession is known to be rich \nin palynomorphs. \nThe samples are both mudstones and were processed using H2O2 and \n(NaPO3)6. There was insufficient material to prepare the samples using HCl\/HF. \nSamples 1 and 2 both produced extremely abundant miospores which are light to dark \nbrown in color (Plate 1). Representatives of the spore genera Spelaeotriletes and \nVallatisporites are especially common, and both samples also contain a significant \nnumber of undescribed taxa. Acritarchs, which are significantly lighter in color \ncompared to the miospores, are also present in relatively low proportions. Dark wood \nfragments also occur in moderate numbers. Precise interpretation of the age of the \nsamples is difficult in the absence of a published biozonation for the Mississippian in \nNorth America. Coleman and Clayton (1987) have investigated an extended \nMississippian section exposed along Interstate Highway 64 between Lexington and \nMorehead, Kentucky which provides the only reliable local database. The Interstate \nHighway 64 study provides the best available correlation between palynomorph \nasemblages and the standard North American chronostratigraphic scheme, in addition \n 7\nto suggested correlations with the western European palynozonation scheme for the \nMississippian (Clayton et al., 1977). \nAlthough there are no consistent preservational differences between \ncomponents in either of the two assemblages, it is clear that they contain both in-situ \nand reworked components. The youngest (i.e. in-situ) association is dominated by \nSpelaeotriletes balteatus and Spelaeotriletes pretiosus, together with Acanthotriletes \nacritarchus, Acanthotriletes macrogaleatus, Acanthotriletes persibus, \nBaculatisporites fusticulus, Camptotriletes prionotus, Colatisporites decorus, \nConvolutispora major, Neoraistrickia logani, Raistrickia condylosa, Raistrickia \nstrumosa, Vallatisporites ciliaris, and Verrucosisporites irregularis. This association \ncompares closely with those reported by Coleman and Clayton (1987) from the \ninterval of the Borden Formation between the uppermost part of the Henley and \nCowbell members. An early Osagean age was suggested for this succession, and a \ncorrelation to the Spelaeotriletes pretiosus-Raistrickia clavata (PC) miospore Biozone \nof Clayton et al. (1977) in western Europe was proposed. However, a latest \nKinderhookian age for the section cannot be precluded because a palynologically \nbarren interval in the lower part of the Henley Member, which may contain the \nKinderhookian-Osagean boundary, was encountered in the Interstate 64 section. \nThe older, reworked, association in both samples represents a small percentage \nof the total palynofloras, but was identified by the presence of Apiculiretusispora \nfructicosa, Emphanisporites annulatus, Hymenozonotriletes explanatus, Retispora \nlepidophyta, Retispora lepidophyta var. minor, and Vallatisporites pusillites. The \ndistinctive association of Retispora lepidophyta and Vallatisporites pusillites is a \ncharacteristic component of latest Devonian and earliest Mississippian assemblages in \nEurope and North America, and has been previously reported from the Bedford Shale \nin Ohio and Kentucky (Winslow, 1962; Molyneux et al., 1984, Coleman and Clayton, \n1987; Clayton et al. 1998). This association, which is accompanied by several Late \nDevonian-Early Mississippian acritarchs including Gorgonisphaeridium, \nLeiosphaeridia, Multiplicisphaeridium, Umbellisphaeridium, and Veryhachium, is \nconsidered to be present in the Portsmouth Shale due to reworking of material from an \nolder Bedford Shale source. Both assemblages contain a further group of long ranging \ntaxa including Auroraspora macra, Retusotriletes  incohatus, Spinozonotriletes  \nuncatus, Verrucosisporites  nitidus, Vallatisporites vallatus, and Vallatisporites \nverrucosus, which have been previously reported throughout the Lower Mississippian \n(Coleman and Clayton, 1987; Clayton et al., 1998). \nThere are no differences in the diversity and relative proportions in the \nsubsamples prepared using the H2O2 and (NaPO3)6 methods. It is clear that both \nprovide fully representative associations. The majority of the spores are well-\npreserved, however, some specimens appear to be somewhat degraded. These pale \nand degraded spores appear to be more prevalent in the material prepared using H2O2 \n(Plate 1, fig. 1). Furthermore, the rare acritarchs are most common in the (NaPO3)6 \npreparations. The presence of significant numbers of apparently degraded spores, and \nthe virtual lack of acritarchs, in the H2O2 preparations may be a result of the effects of \noxidation by H2O2. In samples 1 and 2, the palynomorph concentrations are 4,080 and \n2,830 grains per gram respectively with the H2O2 method (Table 1). The (NaPO3)6 \nmethod produced significantly sparser associations, 835 and 390 grains per gram \nrespectively (Table 1). For sample 1 prepared with H2O2, this figure was calculated as \nfollows. A total of 408 palynomorphs were counted using 0.05 ml from a total of 5 ml \nof homogenised aqueous organic residue prepared from 10 g of sample. This gives a \nfigure of 4,080 palynomorphs per gram. All the other quantitative calculations in this \n 8\nstudy were made using this method. It is clear from the nature of the palynofloras \nproduced from samples 1 and 2 using the two non-acid methods that both techniques \ncan effectively extract palynomorphs from moderately well lithified claystones that \nare inherently palynologically rich. In this case, is possible that the H2O2 method \ncauses some palynomorph damage and degradation. However, this method produced a \nsignificantly higher palynomorph concentration than the (NaPO3)6 procedure (Table \n1). This is thought to be because the H2O2 method is more effective at breaking down \nthe lithified rock matrix than (NaPO3)6. \n \n \nThe Upper Carboniferous (Westphalian) of British Geological Survey offshore \nborehole at site 74\/13, east of Fife Ness, Forth Approaches, offshore Scotland, \nU.K. (sample 3; H2O2 and HCl\/HF preparation methods, both quantitative) \n \nA single sample of mudstone, number 3, was collected at 18.07 m from this \nshallow (77.00 m), cored offshore borehole. It was drilled in 1974 as part of a major \nBGS offshore geological mapping project, and is mentioned in Institute of Geological \nSciences (1975, p. 24) and Owens and Marshall (1978, p. 19). The site lies \nimmediately east of Fife Ness, southeast Scotland, and was illustrated in Owens and \nMarshall (1978, text-fig. 3). The borehole penetrated till and shelly sand of \nQuaternary age to 17.00 m, prior to coring 60.00 m of interbedded coal seams, \nmudstones, sandstones, and siltstones of Late Carboniferous (Westphalian B) age. \nSample 3, which is known to be palynologically rich, was prepared using \nH2O2 and HCl\/HF.  Both preparations yielded exceptionally abundant and well-\npreserved miospores which are mid to dark brown in color (Plate 2).  Spores are \nmarkedly more abundant than pollen, and microplankton is entirely absent. Relatively \nlow proportions of wood fragments are also present. The sample yielded a well \npreserved, typical middle Pennsylvanian-Duckmantian (late Bashkirian-early \nMoscovian or Atokan) miospore assemblage dominated by approximately 80% \nLycospora pusilla with common Crassispora and Florinites. The presence of the \nindex species Endosporites globiformis and Florinites junior indicates assignment to \nthe Microreticulatisporites nobilis-Florinites junior (NJ) Biozone of Clayton et al. \n(1977). This is supported by the presence of characteristic components of the NJ \nBiozone including Cirratriradites saturni, Cristatisporites indignabundus, \nGrumosisporites varioreticulatus, Raistrickia fulva, Raistrickia saetosa, Raistrickia \nsuperba, Reinschospora triangularis, Simozonotriletes intortus, Triquitrites \nbransonii, Triquitrites sinani, Vestispora cancellata, and Vestispora costata. \nThere are no differences in either diversity or relative proportions between the \nH2O2 and HCl\/HF preparations. Furthermore, absolutely no damage or degradation of \nthe palynomorphs due to oxidation effects were observed in the H2O2 preparation \n(Plate 2). The HCl\/HF preparation was not oxidized, and it contains significant levels \nof amorphous organic material (AOM) (Plate 2, fig. 2). This extraneous material \ncould be readily eliminated by a brief wash with nitric acid (HNO3). The reason for \nthe H2O2 preparation being clear of AOM in this study (Plate 2, fig. 1) is that this was \noxidized during the maceration with H2O2. Consistency in not separately oxidizing the \nresidues was maintained throughout this study in order to be able to make objective \ncomparisons of the H2O2 and the HCl\/HF methods. The simultaneous breaking down \nof the matrix and the oxidation of the AOM by H2O2 is an extremely useful property, \nexcept in kerogen\/palynofacies studies. However, if the palynomorphs are potentially \nsusceptible to oxidation, they may be damaged. \n 9\nThe quantitative analyses of the two preparation methods gave significantly \ndifferent results. The H2O2 and HCl\/HF preparations yielded 2,994 and 54,600 grains \nper gram respectively (Table 1). The H2O2 method did not break the entire rock \nsample down, explaining the marked disparity in yield. Non-acid techniques are \nknown to be somewhat less effective in the breakdown of relatively hard and \nindurated sedimentary rocks (Riding and Kyffin-Hughes, 2006). In the non-acid \nmethods, ions of the reagent are adsorbed, and this disaggregates the clays due to the \nhigh ionic charges. The disaggregation effect is significantly less effective on hard \nclaystones, than it is on soft, unconsolidated clays. This disparity in the different \neffectiveness of H2O2 and HCl\/HF in breaking down the bulk of the sediment matrix \nis not a serious problem in highly palynomorph-rich material such as sample 3. In rich \nmaterial such as sample 3, the H2O2 method will demonstrably extract sufficient \nmaterial for study which is apparently representative of the sample (Plate 2, fig. 1). \nShould the sample material be less rich in palynomorphs, the sample could be \nrepeatedly macerated in stronger H2O2 in order to extract workable palynofloras. It is \npossible that the H2O2 method can be adapted to be more effective in the breakdown \nof the rock matrix provided a method can be found of softening it prior to H2O2 \ntreatment. \n \n \nThe Grantham Formation (Aalenian, Middle Jurassic) of the BGS Copper Hill \nBorehole, near Ancaster, Lincolnshire, England (samples 4 and 5; H2O2 and \nHCl\/HF preparation methods, both quantitative) \n \nTwo samples, numbers 4 and 5, were prepared from this stratigraphic borehole \ndrilled during early 1991 at Copper Hill Quarry, near Ancaster, Lincolnshire, central \nEngland (NGR SK 9787 4265). This borehole was drilled in order to prove the \nMiddle and Lower Lias succession of the Grantham area. It is 202.11 m deep, and \ncored a succession from the Scunthorpe Mudstone Formation (Lower Sinemurian) to \nthe Lower Lincolnshire Limestone Formation (Aalenian) (Berridge et al., 1999, text-\nfigs. 19-21). The Copper Hill Borehole and the BGS Walks Farm Borehole (Berridge \net al., 1999, text-figs. 22, 24) provide an important Jurassic reference section \napproximately 320 m thick for the East Midlands Shelf.  Samples 4 and 5 (5.10-5.20 \nand 7.00 m respectively) are from a mudstone unit within the Grantham Formation, \nwhich is of Aalenian age (Murchisonae Chronozone) (Berridge et al., 1999, table 7). \nThey are known to yield rich and well-preserved associations of pollen and spores \nwith associated wood and plant fragments (Riding, 1992). \n The H2O2 and the HCl\/HF preparations both yielded identical abundant \npalynomorphs which are mid brown in color (Table 1, Plate 3). No diversity or \nabundance differences were observed. Gymnospermous pollen and pteridophytic \nspores are present in subequal proportions. Both samples are also rich in wood and \nother plant material; AOM is absent. The pollen and spores observed from samples 4 \nand 5 include bisaccate pollen, Baculatisporites comaumensis, Callialasporites \ndampieri, Callialasporites microvelatus, Callialasporites turbatus, Cibotiumspora \njuriensis, Classopollis classoides, Concavissimisporites verrucosus, Coronatispora \nvaldensis, Cyathidites spp., Duplexisporites problematicus, Gleicheniidites \nsenomicus, Ischysporites variegatus, Leptolepidites spp., Perinopollenites elatoides, \nRetitriletes austroclavatidites, Todisporites spp., Uvaesporites argentiformis, and \nVitreisporites pallidus. This pollen\/spore association is typical of the paralic \nAalenian-Bathonian facies in the Middle Jurassic of northwest Europe (Srivastava, \n 10\n1987; Riding et al., 1991). The freshwater\/brackish alga Botryococcus braunii is also \npresent. \nThe taxa present appeared to be entirely unaffected by either of the preparation \nmethods.  Specifically, the palynomorphs in the H2O2 preparation show absolutely no \nevidence of damage or degradation effects (Plate 3, fig. 1). However, it is possible \nthat the H2O2 oxidized some of the light plant tissue (Plate 3). Quantitative analyses \nof the two preparation methods gave remarkably similar results.  Sample 4 yielded \n6,560 and 7,370 grains per gram with the H2O2 and HCl\/HF preparations respectively \n(Table 1). Using the H2O2 and HCl\/HF procedures, sample 5 produced 8,170 and \n8,250 grains per gram respectively (Table 1).  Both methods readily broke the entire \nrock sample down, and this explains the similar palynomorph concentrations and \nspectra.  The fact that H2O2 is equally effective as HCl\/HF confirms that the non-acid \ntechniques are viable alternatives to mineral acids for lightly or moderately indurated \nclay-rich sample material (Riding and Kyffin-Hughes, 2004; 2006). \n \n \nThe uppermost López de Bertodano Formation (Danian, Lower Paleogene) of \nSeymour Island, northern Antarctic Peninsula (sample 6: H2O2, (NaPO3)6, and \nHCl\/HF preparation methods, all quantitative; sample 7; H2O2, and HCl\/HF \npreparation methods, both quantitative) \n \nSamples 6 and 7, from the uppermost López de Bertodano Formation from \nsouth-central Seymour Island, offshore northeast Antarctic Peninsula were selected \nfor this study. The samples were taken from measured section D5 229, which was part \nof a major sampling progam of the entire López de Bertodano Formation of southern \nSeymour Island (Thorn et al., 2007). The location of the measured section D5 229, \nand a summary sedimentological log, were illustrated by Thorn et al. (2007, text-figs. \n3, 4). The López de Bertodano Formation of the Marambio Group is of Maastrichtian \nto Danian age, and outcrops in the upper part of a back-arc basin fill which represents \nan extensive regressive megasequence (Pirrie et al., 1992; Crame et al., 2004). The \ntwo samples are from immediately above the Maastrichtian-Danian (K\/T) boundary, \nclose to the boundary with the overlying Sobral Formation. Samples 6 and 7 represent \nacmes of the dinoflagellate cysts Palaeoperidinium pyrophorum and Spinidinium sp. \nrespectively. These distinctive, stratigraphically restricted ‘flood’ occurrences were \ninterpreted as representing restricted inshore-estuarine paleoenvironments, or settings \nwhere a single taxon invaded a vacant ecological niche (Askin, 1988a,b). Given that \nthe paleoenvironment probably was significantly disrupted by the effects of the K\/T \nimpact event, it seems most likely that these acmes represent opportunistic forms \nwhich recolonised devastated habitats. The reason for choosing these closely related \ntwo dinoflagellate cyst acmes was to test the contention of Williams et al. (2005) that \nH2O2 destroys certain peridiniacean dinoflagellate cyst taxa such as Palaeoperidinium \npyrophorum. Hence, assuming that Spinidinium is not adversely affected by H2O2, \nsample 7 acts as a control. The López de Bertodano Formation is known to be \npalynologically rich (Riding et al., 1992).  Sample 6 was prepared using the H2O2, \n(NaPO3)6, and HCl\/HF methods so that the two non-acid procedures could be directly \ncompared because of the potential damage to Palaeoperidinium pyrophorum using \nH2O2. By contrast, sample 7 was prepared using the H2O2 and HCl\/HF procedures. \n \nSample 6. This sample yielded an extremely abundant palynoflora. The assemblage is \noverwhelmingly dominated by the dinoflagellate cyst Palaeoperidinium pyrophorum \n 11\n(Plate 4). Other dinoflagellate cysts are present in relatively low proportions and \ninclude Cassidium fragile, Eisenackia circumtabulata, Hystrichosphaeridium \nsalpingophorum, Senegalinium obscurum, and Trithyrodinium evittii. This \nassemblage is clearly within the Early Paleogene (Danian) dinoflagellate cyst zone 5 \nof Askin (1988a). The freshwater\/brackish alga Botryococcus braunii was also \nobserved in relatively small numbers. Palambages is also present, together with \npollen and spores including Azolla sp., bisaccate pollen, Cyathidites spp., \nLaevigatosporites spp., Microcachryidites antarcticus, Nothofagidites spp., \nPeninsulapollis truswelliae, Proteacidites spp., Retitriletes austroclavatidites, and \nStereisporites spp. The pollen-spore association is similar to those documented by \nAskin (1990a,b) from the López de Bertodano Formation of Seymour Island. \n The H2O2, (NaPO3)6, and HCl\/HF preparations proved significantly different, \nin terms of palynomorph productivity and content. The three methods produced 3,575, \n11,700, and 22,700 palynomorphs per gram of sediment respectively (Table 1). \nDespite the concentration differences between them, the (NaPO3)6 and HCl\/HF \npreparations are identical in terms of general appearance, preservational state, and \nabundance\/diversity (Plate 4). It is, however clear that the HCl\/HF method is \nsignificantly more effective at extracting palynomorphs from this sediment in terms of \ngrains per gram. The acid method produced approximately double the numbers of \npalynomorphs than the (NaPO3)6 method (Table 1). Furthermore, the H2O2 \npreparation proved richer in resistant mineral grains than the other preparations. The \nmost important finding here is that Palaeoperidinium pyrophorum is entirely absent \nfrom the H2O2 residue. The residues produced with the HCl\/HF and (NaPO3)6 \nmethods produced superabundant Palaeoperidinium pyrophorum, and this taxon \ndominates the assemblage (Plate 4). However, the slides from the 30% H2O2 \nprocedure proved entirely devoid of this distinctive dinoflagellate cyst, hence the \noxidizing effects of H2O2 have destroyed all the specimens of Palaeoperidinium \npyrophorum. This confirms the findings of Williams et al. (2005, p. 220), who found \nthat Palaeoperidinium pyrophorum is destroyed in certain samples by 3-12% H2O2. It \nis clear that a reduced concentration of H2O2 will not destroy at least some of the \nPalaeoperidinium pyrophorum specimens (see Williams et al., 2005, text-figs. 6, 7), \nbut these authors did not state this figure, or the range of concentrations. In this study, \nthe standard H2O2 concentration (i.e. 30%) was used on sample 6 in order to directly \ncompare with the other samples herein. Recent peridiniacean dinoflagellate cysts are \nknown to be more prone to damage by oxidation in comparison to gonyaulacalean \nforms (Dale, 1976; Head, 1996). This situation, however, is not always the case. By \ncontrast, Dodsworth (1995) found that the prolonged oxidation of Cretaceous residues \nwith Schulze’s solution and alkali selectively and progressively destroyed \ngonyaulacacean dinoflagellate cysts. The peridiniacean dinoflagellate cyst taxa \nremained unaffected. Because of the findings of Dale (1976), most workers on \nQuaternary dinoflagellate cysts do not oxidize at all during preparation (e.g. Harland, \n1989). In particular, it is well known that dinoflagellate cysts belonging to the \nSubfamily Congruentidioideae are highly susceptible to oxidation during processing \n(Head, 1996). For example, the genus Brigantedinium is extremely prone to \ndestruction by even low levels of oxidation with H2O2 (Hopkins and McCarthy, \n2002). It therefore appears that certain taxa throughout the Suborder Peridiniineae are \nprone to destruction by oxidation. However, although H2O2 destroys \nPalaeoperidinium pyrophorum, there is clearly significant variation because the \nperidinialean taxa Senegalinium obscurum and Trithyrodinium evittii are both present \nin the H2O2 preparation. These taxa belong to the Subfamily Deflandreoideae \n 12\n(Fensome et al., 1993). It is possible that Palaeoperidinium pyrophorum is especially \nsusceptible to destruction via oxidation is because it is highly unusual in forming \nexterior to the dinoflagellate theca (Evitt et al., 1998). The dinosporin chemistry \nhence may be different to conventional dinoflagellate cysts, which form inside the \ntheca. The destruction of such an important dinoflagellate cyst taxon as \nPalaeoperidinium pyrophorum due to the action of H2O2 is a major disadvantage to \nthis method. The range top of this species is a reliable marker for the mid Thanetian \n(Powell, 1992). The strength of the H2O2, and the duration of the exposure should be \ntested using similar material so that a tolerance level can be formulated. \n The remainder of the palynoflora appears to be entirely unaffected, although \nsome pale relatively poorly-preserved palynomorphs were noted in the the H2O2 \npreparation, indicating that the H2O2 did cause some limited degradation to other \npalynomorphs than Palaeoperidinium pyrophorum. Obviously, the lack of \nPalaeoperidinium pyrophorum in the H2O2 preparation enhances the relative \nproportions of the rarer forms. This is similar to the effect noted by Hughes et al. \n(1964) when these authors prepared some coals using strong oxidants. Hughes et al. \n(1964) found that the spore Crassispora kosankei was destroyed by Schultze’s \nsolution. By contrast, Laevigatosporites spp. were found to be highly resistant and \nhence were overrepresented in overoxidized material. \n \nSample 7. This sample from Seymour Island also proved extremely rich \npalynologically. Like sample 6, a dinoflagellate cyst acme is present. The \ndinoflagellate cyst assemblage is a virtually monospecific association of a \nrepresentative of Spinidinium. This form was termed Spinidinium sp. 1 by Askin \n(1988a,b), and it overwhelmingly dominates the palynoflora (Plate 5). Other \ndinoflagellate cysts are extremely rare, and largely comprise Hystrichosphaeridium \nsalpingophorum. Botryococcus braunii is also present. Pollen and spores are also \nrelatively prominent. These are similar to those in sample 6, and are dominated by \nspores, especially Cyathidites spp. The palynoflora is also within the Early Paleogene \n(Danian) dinoflagellate cyst zone 5 of Askin (1988a). \n The H2O2 and HCl\/HF preparations were both highly palynologically \nproductive. They produced 51,810 and 130,850 specimens per gram respectively \n(Table 1, Plate 5). Both methods fully broke down the sediment, and it is not known \nwhy there is such a large disparity in the palynomorph concentrations. It is possible \nthat some palynomorphs were lost in the H2O2 preparation due to non-selective \noxidation, and during sieving and other procedures. Also, there are slightly more \nmineral grains in the H2O2 preparation than the HCl\/HF residue; these may have \ndisplaced palynomorphs. Nevertheless, both these methods of preparation have \nproduced highly abundant palynomorph associations, which are identical in terms of \nspecies content and relative proportions. It is clear that the H2O2 has not selectively \ndegraded or destroyed specimens of Spinidinium (Plate 5). \n \n \nQuaternary (Late Pleistocene) clays of the BGS offshore borehole 99\/3, Faroes-\nShetland area, offshore northern Scotland (Judd Sheet) (sample 8; H2O2 and \nHCl\/HF preparation methods, both quantitative) \n \nSample 8 is from 34.22 m in a BGS offshore borehole, number 99\/3, which \ndrilled a succession of Quaternary clays offshore northern Scotland. The borehole is \nlocated at 60° 24.8133’N; 04° 39.0639’W. This is on the Judd Sheet, which lies \n 13\ndirectly north of Sutherland (Stoker et al., 1993, inside back cover). The Late \nPleistocene diamictons and clay-rich suspension deposits were seen to 54 m (Riding, \n2000). The reason for choosing this succession is to test the effectiveness of the H2O2 \npreparation procedure on unconsolidated marine clays. The Pleistocene of borehole \n99\/3 is known to be relatively palynologically rich (Riding, 2000). \nSample 8 was prepared using both H2O2 and HCl\/HF. Both the preparations \nyielded abundant and well-preserved indigenous and allochthonous palynomorphs. \nThe abundant reworked palynomorphs are typical of a diamicton-dominated \nsuccession. The allochthonous palynomorphs are Carboniferous, Jurassic, Lower \nCretaceous, and Paleogene (Eocene to Early Oligocene) and Quaternary dinoflagellate \ncysts are more common than Quaternary pollen (Riding, 2000). Quaternary \ndinoflagellate cysts are relatively low in diversity and include Achomosphaera \nandalousiensis, Bitectatodinium tepikiense, Brigantedinium cariacoense, \nBrigantedinium simplex, Brigantedinium spp., Impagidinium aculeatum, \nLingulodinium machaerophorum, Operculodinium centrocarpum, and Spiniferites \nspp. The presence of Brigantedinium spp. is indicative of cold, glacial conditions with \nseasonal or permanent sea-ice (Harland, 1992). Wood fragments are common, and \nother plant tissues were also observed. There are no differences between the \ndiversities and relative abundances of the H2O2 and HCl\/HF preparations, and no \ndamage to the palynomorphs due to oxidative effects of the H2O2 was observed. \nThe quantitative analyses of the two preparation methods gave markedly \nsimilar results. The H2O2 and HCl\/HF preparations yielded 7,700 and 7,600 grains per \ngram respectively (Table 1). This was the only sample in this study where the H2O2 \npreparation produced more palynomorphs than the HCl\/HF procedure. Non-acid \ntechniques are known to be effective in breaking down soft, unconsolidated clay-rich \nsediments (Riding and Kyffin-Hughes, 2006; Riding et al., 2006). \n \n \nCONCLUSIONS \n \nThis demonstration of a reliable palynomorph preparation procedure using hot \nH2O2 clearly indicates that the use of mineral acid digestion is not needed in all cases. \nFive case studies were undertaken, comprising eight samples of Early Carboniferous \nto Quaternary age from Antarctica, the U.K., and the U.S.A. The samples were \nprepared quantitatively using H2O2 and also with HCl\/HF and\/or (NaPO3)6 in order to \nprovide absolute frequency data that are directly comparable. It is clear from this \nstudy that disaggregation using H2O2, together with density separation, oxidation etc., \nwhere necessary, can effectively separate and concentrate palynomorphs from a \nvariety of clay-rich lithologies. \nIn the Early Carboniferous samples 1 and 2, the H2O2 method was \nsignificantly more effective than the (NaPO3)6 procedure. However some \npalynomorphs extracted using H2O2 appear to have been degraded. Sample 3, which \nis Late Carboniferous, was prepared effectively using both H2O2 and HCl\/HF, \nhowever the palynomorph concentration is much higher in the HCl\/HF preparation. \nHowever the H2O2 method produced a residue clear of AOM. Samples 3 and 4 are \nfrom a Middle Jurassic paralic deposit and the palynofloras are comparable in terms \nof both taxonomic content and yield with both the H2O2 and the HCl\/HF preparations. \nTwo samples, 6 and 7, are from Danian unconsolidated siliciclastic sediments. These \nsamples represent two different dinoflagellate cyst acmes. The 30% H2O2 totally \ndestroyed Palaeoperidinium pyrophorum in sample 6, but did not affect Spinidinium \n 14\nsp. in sample 7. The H2O2 and the HCl\/HF methods produced similar palynofloras in \nsample 7, which is a Quaternary clay. \nIn the majority of the samples studied, the HCl\/HF technique produced a \nsignificantly greater concentration of palynomorphs than either of the non-acid \nprotocols. The H2O2 method is less effective than HCl\/HF in disaggregating relatively \nhard, indurated sedimentary rocks such as sample 3. However, the H2O2 procedure \nappears to be more effective that the (NaPO3)6 method for indurated claystones. \nNevertheless, in most of the Mesozoic and Cenozoic samples, the palynomorph yields \nof the H2O2 and HCl\/HF methods are broadly comparable. Therefore, for both non-\nacid techniques, the possibility of pre-treating sample material so that it is made \nsignificantly softer than in the raw state should be investigated. Potential reagents for \nthis include strong detergents and\/or organic solvents. \nHydrogen peroxide can degrade or damage palynomorphs, and evidence of \nthis was noted in samples 1, 2 and 6. In sample 6, the 30% H2O2 was found to \ncompletely destroy the dominant species, the dinoflagellate cyst Palaeoperidinium \npyrophorum. By contrast, the HCl\/HF and (NaPO3)6 procedures both did not \nadversely affect Palaeoperidinium pyrophorum in this sample. However, the \noxidizing effects of H2O2 can sometimes be useful. For example in sample 3, the \nH2O2 method produced a palynomorph assemblage that was cleaner in terms of the \nlevels of extraneous AOM than the residue produced by the acid digestion method. \nThe H2O2 method has the marked advantage of its capability to macerate the matrix \nand to oxidize the AOM simultaneously. \n Despite the fact that H2O2 often frequently cannot fully disaggregate indurated \nlithotypes, if the sample material is abundant in palynomorphs, this method will \nnormally produce abundant and workable associations. It appears to be more effective \nthan (NaPO3)6 for preparing relatively lithified samples. However, if the sample \nmaterial is relatively soft and contains palynomorphs susceptible to oxidation, such as \nsample 6, the (NaPO3)6 technique is frequently just as effective. Hence if a non-acid \nmethod is required, H2O2 and (NaPO3)6 should be used on hard and soft sediments \nrespectively. Further tests should be done on representative material using both H2O2 \nand (NaPO3)6 to determine which non-acid preparation method is most effective. \nAdditionally, more investigations should be undertaken using various concentrations \nof H2O2 to further prove its effectiveness in palynological processing. \n \n \nACKNOWLEDGEMENTS \n \nThis contribution was funded by the BGS laboratory maintenance and \ndevelopment of capability project managed by Shaun Reeder (BGS, Keyworth). The \nauthors thank Stewart G. Molyneux and Michael H. Stephenson (BGS, Keyworth) for \ntheir perceptive reviews of the manuscript. The authors publish with the permission of \nthe Executive Director, British Geological Survey (NERC). Samples 1 and 2 were \ncollected from Springville Hill by Professor Walter L. Manger (University of \nArkansas). Samples 6 and 7 were collected on Seymour Island by J. E. Francis, R. W. \nRaiswell, J. B. Riding, and V. C. Thorn during the Austral summer of 2006 as part of \nBritish Antarctic Survey’s Antarctic Funding Initiative project number AFI 6\/28 \nproject on 'Terminal Cretaceous climate change in Antarctica'. \n \n 15\n \nReferences Cited \n \nASKIN, R.A. \n1988a Campanian to Paleocene palynological succession of Seymour and \nadjacent islands, northeastern Antarctic Peninsula. In: Feldmann, R.M., and \nWoodburne, M.O. (eds.). Geology and paleontology of Seymour Island, Antarctic \nPeninsula. Geological Society of America Memoir, 169: 131-153. \n \n1988b The palynological record across the Cretaceous\/Tertiary transition on \nSeymour Island, Antarctica. In: Feldmann, R.M., and Woodburne, M.O. (eds.). \nGeology and paleontology of Seymour Island, Antarctic Peninsula. Geological \nSociety of America Memoir, 169: 155-162. \n \n 1990a Campanian to Paleocene spore and pollen assemblages of Seymour \nIsland, Antarctica. Review of Palaeobotany and Palynology, 65: 105-113. \n \n 1990b Cryptogam spores from the upper Campanian and Maastrichtian of \nSeymour Island, Antarctica. Micropaleontology, 36(2): 141-156. \n \nBATTEN, D.J. \n1999 4. Small palynomorphs. In: Jones, T.P., and Rowe, N.P. (eds.). Fossil \nplants and spores: modern techniques. Geological Society, London, p. 15-19. \n \nBERRIDGE, N.G., PATTISON, J., SAMUEL, M.D.A., BRANDON, A., HOWARD, \nA.S., PHARAOH, T.C., and RILEY, N.J. \n1999 Geology of the Grantham district. Memoir of the British Geological \nSurvey, Sheet 127 (England and Wales). The Stationery Office, London, 133 p. \n \nBROWN, C.A. \n1960. Palynological Techniques. Privately published, 1180 Stanford Avenue, \nBaton Rouge, Louisiana, USA, vi + 188 p. \n \nCLAYTON, G., COQUEL, R., DOUBINGER, J., GUEINN, K.J., LOBOZIAK, S., \nOWENS, B., and STREEL, M. \n1977 Carboniferous miospores of western Europe: illustration and zonation. \nMededelingen Rijks Geologische Dienst, No. 29, 71 p. \n \nCLAYTON, G., MANGER, W.L., and OWENS, B. \n1998 Mississippian (Lower Carboniferous) miospores from the Cuyahoga \nand Logan formations of northeastern Ohio, USA. Journal of Micropalaeontology, \n17: 183-191. \n \nCOLEMAN, U., and CLAYTON, G. \n1987 Palynostratigraphy and palynofacies of the uppermost Devonian and \nLower Mississippian of eastern Kentucky (U.S.A.), and correlation with western \nEurope. Courier Forschungsinstitut Senckenberg, 98: 75-93. \n \nCOLLINSON, M.E. \n 16\n1978 Dispersed fern sporangia from the British Tertiary. Annals of Botany, \n42: 233-250. \n \n1980 A new multiple-floated Azolla from the Eocene of Britain with a brief \nreview of the genus. Palaeontology, 23(1): 213-229. \n \nCRAME, J.A., FRANCIS, J.E., CANTRILL, D.J., and PIRRIE, D. \n 2004 Maastrichtian stratigraphy of Antarctica. Cretaceous Research, 25: \n411-423. \n \nDALE, B. \n1976 Cyst formation, sedimentation, and preservation: factors affecting \ndinoflagellate assemblages in Recent sediments from Trondheimsfjord, Norway. \nReview of Palaeobotany and Palynology, 22: 39-60. \n \nDODSWORTH, P. \n1995 A note of caution concerning the application of quantitative \npalynological data from oxidized preparations. Journal of Micropalaeontology, 14(1): \n6. \n \nDOHER, L.I. \n1980 Palynomorph preparation procedures currently used in the \npaleontology and stratigraphy laboratories, U.S. Geological Survey. United States \nGeological Survey Circular, No. 830, v + 29 p. \n \nESHET, Y., and HOEK, R. \n1996 Palynological processing of organic-rich rocks, or: How many times \nhave you called a palyniferous sample “barren”? Review of Palaeobotany and \nPalynology, 94: 101-109. \n \nEVITT, W.R., DAMASSA, S.P., and ALBERT, N.R. \n 1998 A tiger by the tail: the exophragm of the Cretaceous-Paleocene \ndinoflagellate Palaeoperidinium and its implications. Palynology, 22: 1-55. \n \nFENSOME, R.A., TAYLOR, F.J.R., NORRIS, G., SARJEANT, W.A.S., \nWHARTON, D.I., and WILLIAMS, G.L. \n1993 A classification of living and fossil dinoflagellates. Micropaleontology \nSpecial Publication, No. 7, viii + 351 p. \n \nFENSOME, R.A., and WILLIAMS, G.L. \n2004 The Lentin and Williams index of fossil dinoflagellates 2004 edition. \nAmerican Association of Stratigraphic Palynologists Foundation, Contributions \nSeries, No. 42: 909 p. \n \nFUNKHOUSER, J.W., and EVITT, W.R. \n1959 Preparation techniques for acid-insoluble microfossils. \nMicropaleontology, 5(3): 369-375. \n \nGELSTHORPE, D.N. \n 17\n 2002 Testing of palynological processing techniques: an example using \nSilurian palynomorphs from Gotland. Journal of Micropalaeontology, 21: 81-86. \n \nGRAY, J. \n1965 Techniques in palynology: extraction techniques. In: Kummel, B., and \nRaup, D. (eds.). Handbook of Paleontological Techniques. W. H. Freeman and \nCompany, San Francisco, p. 530-587. \n \nHARLAND, R. \n1989 A dinoflagellate cyst record for the last 0.7 Ma from the Rockall \nPlateau, northeast Atlantic Ocean. Journal of the Geological Society, 25: 113-117. \n \nHARLAND, R. \n1992 Dinoflagellate cysts of the Quaternary System. In: Powell, A.J. (ed.). A \nstratigraphic index of dinoflagellate cysts. British Micropalaeontological Society \nPublications Series. Chapman and Hall, London, 253-272. \n \nHEAD, M.J. \n1996 Chapter 30. Modern dinoflagellate cysts and their biological affinities. \nIn: Jansonius, J., and McGregor, D.C. (eds.). Palynology: principles and applications. \nAmerican Association of Stratigraphic Palynologists Foundation, Dallas, 3: 1197-\n1248. \n \nHOPKINS, J.A., and McCARTHY, F.M.G. \n2002 Post-depositional palynomorph degradation in Quaternary shelf \nsediments: a laboratory experiment studying the effects of progressive oxidation. \nPalynology, 26:167-184. \n \nHUGHES, N.F., DE JEKHOWSKY, B., and SMITH, A.H.V. \n1964 Extraction of spores and other organic microfossils from Paleozoic \nclastic sediments and coals. Cinquième Congrès International de Stratigraphie et de \nGéologie Carbonifère, Paris, 9-12 Septembre 1963, Comptes Rendus, 3: 1095-1109. \n \nHYDE, J.E. \n1915 Stratigraphy of the Waverley formations of central and southern Ohio. \nJournal of Geology, 23: 655-682 and 757-779. \n \nINSTITUTE OF GEOLOGICAL SCIENCES \n1975 I.G.S. Boreholes 1974. Report of the Institute of Geological Sciences, \nNo. 75\/7, 26 p. \n \nJENKINS, W.A.M. \n1967 Ordovician chitinozoa from Shropshire. Palaeontology, 10(3): 436-\n488. \n \nLESCHIK, G. \n 1956 Sporen aus dem Salzton des Zechsteins von Neuhof (Bei Fulda). \nPalaeontographica Abteilung B, 100: 122-142. \n \nMOLYNEUX, S.G., MANGER, W.L., and OWENS, B. \n 18\n1984 Preliminary account of Late Devonian palynomorph assemblages from \nthe Bedford Shale and Berea Sandstone Formations of central Ohio, U.S.A. Journal of \nMicropalaeontology, 3: 41-51. \n \nOWENS, B., and MARSHALL, J. (compilers) \n 1978 Micropalaeontological biostratigraphy of samples from around the \ncoasts of Scotland. Report of the Institute of Geological Sciences, No. 78\/20, 35 p. \n \nPEARSON, T., and SCOTT, A.C. \n1999 Chapter 5. Large palynomorphs and debris. In: Jones, T.P., and Rowe, \nN.P. (eds.). Fossil plants and spores: modern techniques. Geological Society, \nLondon, 20-25. \n \nPHIPPS, D., and PLAYFORD, G. \n1984 Laboratory techniques for extraction of palynomorphs from sediments. \nPapers of the Department of Geology, University of Queensland, No. 11, 23 p. \n \nPIRRIE, D., DUANE, A.M., and RIDING, J.B \n1992 Jurassic-Tertiary stratigraphy and palynology of the James Ross Basin: \nreview and introduction. Antarctic Science, 4(3): 259-266. \n \nPOWELL, A.J. \n1992 Dinoflagellate cysts of the Tertiary System. In: Powell, A.J. (ed.). A \nstratigraphic index of dinoflagellate cysts. Chapman and Hall, London, 155-251. \n \nRIDING, J.B. \n 1992 A palynological investigation of the BGS Copper Hill Borehole, \nLincolnshire (1\" sheet 127). British Geological Survey Technical Report, \nWH\/92\/307R, 18 p. \n \n 2000 A palynological investigation of the Quaternary of BGS Boreholes \n99\/3 and 99\/6 (1999 Rockall Consortium drilling programme). British Geological \nSurvey Technical Report, CR\/00\/08, 13 p. \n \nRIDING, J.B., and KYFFIN-HUGHES, J.E. \n2004 A review of the laboratory preparation of palynomorphs with a \ndescription of an effective non-acid technique. Revista Brasileira de Paleontologia, \n7(1): 13-44. \n 2006 Further testing of a non-acid palynological preparation procedure. \nPalynology, 30: 69-87. \n \nRIDING, J.B., KEATING, J.M., SNAPE, M.G., NEWHAM, S., and PIRRIE, D. \n1992 Preliminary Jurassic and Cretaceous dinoflagellate cyst stratigraphy of \nthe James Ross Island area, Antarctic Peninsula. Newsletters on Stratigraphy, 26: 19-\n39. \n \nRIDING, J.B., WALTON, W., and SHAW, D. \n 1991 Toarcian to Bathonian (Jurassic) palynology of the Inner Hebrides, \nnorth-west Scotland. Palynology, 15: 115-179. \n \n 19\nRIDING, J.B., WILKINSON, I.P., JONES, L.D., and FREEBOROUGH, K. \n2006 The occurrence of dinoflagellate cysts in calcareous\/siliceous \nmicrofossil preparations from the Eocene of southeast England. Journal of \nMicropalaeontology, 25: 35-36. \n \nSMITH, A.V.H., and BUTTERWORTH, M.A. \n1967 Miospores in the coal seams of the Carboniferous of Great Britain. \nSpecial Papers in Palaeontology, No. 1, 324 p. \n \nSRIVASTAVA, S.K. \n1987 Jurassic spore-pollen assemblages from Normandy (France) and \nGermany. Geobios, 20(1): 5-79. \n \nSTOKER, M.S., HITCHEN, K., and GRAHAM, C.C. \n1993 United Kingdom offshore regional report: the geology of the Hebrides \nand West Shetland shelves, and adjacent deep-water areas. Her Majesty’s Stationery \nOffice, London for the British Geological Survey, 149 p. \n \nTHORN, V.C., FRANCIS, J.E., RIDING, J.B., RAISWELL, R.W., PIRRIE, D., \nHAYWOOD, A.M., CRAME, J.A., and MARSHALL, J.M. \n2007 Terminal Cretaceous climate change and biotic response in Antarctica. \nIn: Cooper, A.K., and Raymond, C.R. (eds.). Online Proceedings of the 10th \nInternational Symposium on Antarctic Earth Sciences (ISAES X), August 26th to \nSeptember 1st 2007, Santa Barbara, U.S.A., extended abstract. United States \nGeological Survey Open-File Report, in press. \n \nTRAVERSE, A. \n1988 Paleopalynology. Unwin Hyman, Boston, 600 p. \n \nWILLIAMS, G., PAYNE, S.N.J., DYER, R., EWEN, D.F., PATRICK, N., and \nWATSON, P. \n2005 Non-acid wellsite palynology: widening opportunities. In: Powell, A.J., \nand Riding, J.B. (eds.). Recent Developments in Applied Biostratigraphy. The \nMicropalaeontological Society, Special Publication. The Geological Society, London, \n219-235. \n \nWINSLOW, M.A. \n1962 Plant spores and other microfossils from Upper Devonian and Lower \nMississippian rocks of Ohio. United States Geological Survey Professional Paper, \nNo. 364, 93 p. \n \nWOOD, G.D., GABRIEL, A.M., and LAWSON, J.C. \n1996 Chapter 3. Palynological techniques – processing and microscopy. In: \nJansonius, J., and McGregor, D.C. (eds.). Palynology: principles and applications. \nAmerican Association of Stratigraphic Palynologists Foundation, Dallas, 1: 29-50. \n \n 20\n \nAPPENDIX 1. Description of the new palynological processing technique using \nhydrogen peroxide (H2O2). \n \n1 The sample is gently crushed to fragments 1000 µm\/1 mm in maximum \ndiameter; unconsolidated material is gently broken up. \n2 The crushed\/broken up sample material is placed in a large (ca. 22 cm \ndiameter) ceramic dish. \n3 A few drops of H2O2 are added to the cold sample material, to test for a \nviolent reaction. \n4 The ceramic dish is placed on a hot plate that has been pre-heated to ca. 100 \n˚C in a fume hood. \n5 The sample is heated on the hot plate for 1 minute. \n6 The sample material is covered with 15% to 30% H2O2, and left to heat for 10 \nminutes with the hot plate switched on. The concentration of the H2O2 is \ndependent upon the level of induration of the rock. The 30% H2O2 is only \nnecessary for the hardest of sedimentary rocks and, if the sample material is \nrelatively unidurated, significantly lower concentrations of H2O2 can be used. \n7 The sample residue is then taken off the hot plate and diluted with ca. 250 ml \nof cold distilled water. The disaggregated sample material then floats, and is \ncarefully decanted into a large (ca. 2-3 liter) beaker. This beaker contains \nsome cold distilled water to further dilute the H2O2. Care should be taken if \nthe oxidizing reaction is still proceeding. \n8 Replace the ceramic dish onto the hot plate and repeat this process as many \ntimes as necessary, leaving the sample for longer than 10 minutes if \nneccessary. \n9 Swirl and\/or centrifuge or the residue to separate any resistant mineral grains \nand the organic fraction. \n10 Any remaining extraneous AOM can be destroyed using oxidation followed \nby alkali treatment. \n11 The washed residue is then stained if necessary, and concentrated by sieving \nusing an appropriate mesh (normally between 10-15 µm). \n12 The concentrated residue is mounted on microscope slides. \n \n \nAPPENDIX 2. List of samples. \n \nThis Appendix lists all the samples with details of sample registration \nnumbers, depths where appropriate, and lithology. The eight samples were registered \nin the BGS micropaleontological collection and these unique numbers are all prefixed \n‘MPA’ or ‘CSA’. \n \n1 THE PORTSMOUTH MEMBER, CUYAHOGA FORMATION \n(MISSISSIPPIAN, LOWER CARBONIFEROUS) OF SPRINGVILLE HILL \nROAD CUTTING, SOUTH PORTSMOUTH, KENTUCKY, U.S.A. \n \nThis road cutting lies in Kentucky, directly across the Ohio River from Portsmouth, \nOhio. The section samples lies on the Portsmouth, Kentucky-Ohio 7.5’ quadrangle. It \n 21\nis adjacent to U.S. highway 23 at the south end of the U.S. Grant Toll Bridge across \nthe Ohio River at Portsmouth. A prominent bluff is formed by the river, and the road \ncutting allows access to the river level from the south. \n \n1 MPA 55798 64.00 m above the base of the Portsmouth Shale mudstone \n2 MPA 55797 33.52 m above the base of the Portsmouth Shale mudstone \n \n \n2 THE UPPER CARBONIFEROUS (WESTPHALIAN B) OF BGS \nOFFSHORE BOREHOLE AT SITE 74\/13, EAST OF FIFE NESS, FORTH \nAPPROACHES, SCOTLAND, U.K. \n \nThis offshore borehole was drilled 17 km east of Fife Ness, in the Forth Approaches \nat 56˚ 18.10’N; 02˚ 19.30’W (Owens and Marshall, 1978, text-figs 1, 3). \n \n3 CSA 1231 18.07 m mudstone \n \n \n3 THE GRANTHAM FORMATION (AALENIAN, MIDDLE JURASSIC) \nOF THE BGS COPPER HILL BOREHOLE, NEAR ANCASTER, \nLINCOLNSHIRE, ENGLAND, U.K. (NGR SK 9787 4265) \n \n4 MPA 36317 5.10-5.20 m Grantham Formation  mudstone \n5 MPA 36320 7.00 m  Grantham Formation  mudstone \n \n \n4 THE UPPERMOST LÓPEZ DE BERTODANO FORMATION \n(DANIAN, LOWER PALEOCENE) OF SEYMOUR ISLAND, ANTARCTIC \nPENINSULA (MEASURED SECTION D5 229 OF THORN ET AL., 2007) \n \nSamples 6 and 7 represent acmes of Palaeoperidinium pyrophorum and Spinidinium \nspp. respectively.  The global positioning system (GPS) coordinates are accurate to 5 \nm. Both samples are silty clays. \n \n6 MPA 56193\/D5.1320 60 m from base 64° 18' 30.2\"S; 056° 44' 32.8\"W \n7 MPA 56194\/D5.1309 50 m from base 64° 18' 29.2\"S; 056° 44' 38.1\" W \n \n5 THE QUATERNARY SEDIMENTS OF BGS OFFSHORE BOREHOLE \n99\/3, FAROES-SHETLAND AREA, OFFSHORE NORTHERN SCOTLAND \n \nThis offshore borehole was drilled in the Judd Sheet, directly north of Sutherland at \n60° 24.8133’N; 04° 39.0639’W (Riding, 2000). \n \n8 MPA 49340 34.22 m Late Pleistocene clay \n \n \nAPPENDIX 3. Listing of palynomorph species. \n \nAll validly published palynomorph taxa, at and below the species level or \nbelow mentioned in this contribution are listed here with full author citations. The \n 22\nlistings are alphabetical within the four major palynomorph groups. A full \nbibliography on dinoflagellate cyst taxonomy was given by Fensome and Williams \n(2004). \n \n \nDinoflagellate cysts: \nAchomosphaera andalousiensis Jan du Chêne 1977 \nBitectatodinium tepikiense Wilson 1973 \nBrigantedinium cariacoense (Wall 1967) Lentin & Williams 1973 \nBrigantedinium simplex Wall 1965 ex Lentin & Williams 1993 \nCassidium fragile (Harris 1965) Drugg 1967 \nEisenackia circumtabulata Drugg 1967 \nHystrichosphaeridium salpingophorum Deflandre 1935 ex Deflandre 1937 \nImpagidinium aculeatum (Wall 1967) Lentin & Williams 1981 \nLingulodinium machaerophorum (Deflandre & Cookson 1955) Wall 1967 \nOperculodinium centrocarpum (Deflandre & Cookson 1955) Wall 1967 \nPalaeoperidinium pyrophorum (Ehrenberg 1843 ex Wetzel 1933) Sarjeant 1967 \nSenegalinium obscurum (Drugg 1967) Stover & Evitt 1978 \nTrithyrodinium evittii Drugg 1967 \n \nMiscellaneous microplankton: \nBotryococcus braunii Kützing 1849 \n \nPollen: \nCallialasporites dampieri (Balme 1957) Sukh Dev 1961 \nCallialasporites microvelatus Schulz 1966 \nCallialasporites turbatus (Balme 1957) Schulz 1967 \nClassopollis classoides (Pflug 1953) Pocock & Jansonius 1961 \nFlorinites junior Potonié & Kremp 1956 \nMicrocachryidites antarcticus Cookson 1947 \nPerinopollenites elatoides Couper 1958 \nVitreisporites pallidus (Reissinger 1950) Nilsson 1958 \n \nSpores: \nAcanthotriletes acritarchus Neville in Neves et al. 1973 \nAcanthotriletes macrogaleatus Phillips & Clayton 1980 \nAcanthotriletes persibus Higgs 1975 \nApiculiretusispora fructicosa Higgs 1975 \nAuroraspora macra Sullivan 1968 \nBaculatisporites fusticulus Sullivan 1968 \nCamptotriletes prionotus Higgs 1975 \nCibotiumspora juriensis (Balme 1957) Filatoff 1975 \nCirratriradites saturni (Ibrahim) Schopf et al., 1944 \nColatisporites decorus (Bharadwaj & Venkatachala) Williams in Neves et al. 1973 \nConcavissimisporites verrucosus Delcourt & Sprumont 1955 \nConvolutispora major (Kedo 1963) Turnau 1978 \nCoronatispora valdensis (Couper 1958) Dettmann 1963 \nCrassispora kosankei (Potonié & Kremp 1955) Bharadwaj 1957 \nCristatisporites indignabundus (Loose 1932) Staplin & Jansonius 1964 \nDuplexisporites problematicus (Couper 1958) Playford & Dettmann 1965 \n 23\nEmphanisporites annulatus McGregor 1961 \nEndosporites globiformis (Ibrahim 1932) Schopf et al. 1944 \nGleicheniidites senonicus Ross 1949 \nGrumosisporites varioreticulatus (Neves 1958) Smith & Butterworth 1967 \nHymenozonotriletes explanatus (Luber 1941) Kedo 1963 \nIschyosporites variegatus (Couper 1958) Schulz 1967 \nNeoraistrickia logani (Winslow 1962) Coleman & Clayton 1987 \nLycospora pusilla (Ibrahim 1932) Somers 1972 \nRaistrickia condylosa Higgs 1975 \nRaistrickia fulva Artüz 1957 \nRaistrickia saetosa (Loose 1932) Schopf et al. 1944 \nRaistrickia strumosa Playford 1976 \nRaistrickia superba (Ibrahim 1933) Schopf et al. 1944 \nReinschospora triangularis Kosanke 1950 \nRetispora lepidophyta (Kedo 1957) Playford 1976 \nRetispora lepidophyta (Kedo 1957) Playford 1976 var. minor Kedo 1963 \nRetitriletes austroclavatidites (Cookson 1953) Döring et al. 1963 \nRetusotriletes incohatus Sullivan 1964 \nSimozonotriletes intortus (Waltz 1938) Potonié & Kremp 1954 \nSpelaeotriletes balteatus (Playford 1963) Higgs 1975 \nSpelaeotriletes pretiosus (Playford 1964) Neves & Belt 1970 \nSpinozonotriletes uncatus Hacquebard 1957 \nTriquitrites bransonii Wilson & Hoffmeister 1956 \nTriquitrites sinani Artüz 1957 \nUvaesporites argentiformis (Bolkhovitina 1953) Schulz 1967 \nVallatisporites ciliaris (Luber 1938) Sullivan 1964 \nVallatisporites pusillites (Kedo 1957) Dolby & Neves 1970 \nVallatisporites vallatus Hacquebard 1957 \nVallatisporites verrucosus Hacquebard 1957 \nVerrucosisporites irregularis Phillips & Clayton 1980 \nVerrucosisporites nitidus (Naumova 1953) Playford 1964 \nVestispora cancellata (Dybovà & Jachowicz 1957) Wilson & Venkatachala 1963 \nVestispora costata (Balme 1952) Spode in Smith & Butterworth 1967 \n \n 24\n \nSample \nNo. Age \nPalynomorphs per \ngram with the 30% \nH2O2 method \nPalynomorphs per gram \nwith the (NaPO3)6 \nmethod \nPalynomorphs per \ngram with the \nHF\/HCl method  \n1 \nEarly \nCarboniferous 4,080 835 N\/A \n2 \nEarly \nCarboniferous 2,830 390 N\/A \n3 \nLate \nCarboniferous 2,994 N\/A 54,600 \n4 Middle Jurassic  6,560 N\/A 7,370 \n5 Middle Jurassic 8,170 N\/A 8,250 \n6 Early Paleogene 3,575 11,700 22,700 \n7 Early Paleogene 51,810 N\/A 130,850 \n8 Quaternary 7,700 N\/A 7,600 \n \nTable 1. Table illustrating the numbers of palynomorphs per gram recorded from \nsamples 1 to 8 herein. This material was prepared quantitatively using various \ncombinations of the 30% H2O2, (NaPO3)6, and HCl\/HF methods. For each sample, the \nlargest palynomorph concentration is in bold type. \n \n \nPlate captions: \n \nPLATE 1 \n \nA comparison of the hydrogen peroxide (H2O2) and the sodium hexametaphosphate \n[(NaPO3)6] preparation techniques on sample 1 from the Portsmouth Member of the \nCuyahoga Formation, (Mississippian, Lower Carboniferous) of the U.S.A. For scale, \nwhich applies to both photomicrographs, the polygonomorph acritarch at the top \ncenter of fig. 2 is 127 μm in length. Both photomicrographs were taken using plain \ntransmitted light. Note the overall similarity of these two non-acid preparations. \n \n1 the H2O2 preparation, note the relatively abundant, well-preserved miospores, \nwith occasional acritarchs. The slightly degraded spore at the center-right may \nhave been oxidized by the H2O2. BGS Slide MPA 55798\/2\/H2O2\/non-\nquantitative, ‘England Finder’coordinate N67\/3. \n \n2 the (NaPO3)6 preparation, note the relatively abundant, well-preserved \nmiospores, with occasional acritarchs. BGS Slide MPA 55798\/2\/hexa\/non-\nquantitative, ‘England Finder’coordinate J60\/3. \n \n \nPLATE 2 \n \nA comparison of the hydrogen peroxide (H2O2) and the mineral acid (HCl\/HF) \npreparation techniques on sample 3 from the Upper Carboniferous of offshore \nScotland. For scale, which applies to both photomicrographs, the saccate pollen grain \nin the center of fig. 1 is 82 μm in length. Both photomicrographs were taken using \nplain transmitted light. Note the absence and presence of AOM in figs. 1 and 2 \nrespectively.  It therefore appears that the H2O2 simultaneously macerates the rock \n 25\nmatrix and oxidizes the AOM. The HCl\/HF preparation (fig. 2) was not separately \noxidized. \n \n1 the H2O2 preparation, note the abundant, well-preserved miospores which are \ndominated by Lycospora pusilla. The residue is extremely ‘clean’; the \nmiospores are free of AOM. BGS Slide CSA 1231\/H2O2\/quantitative, \n‘England Finder’coordinate L70\/4. \n \n2 the HCl\/HF preparation, again, note the abundant, well-preserved miospores, \ndominated by Lycospora pusilla. This preparation was not separately oxidized \nand note the relatively abundant AOM. The AOM partially obscures the \nmiospores, note the prominent specimen of Raistrickia in the center of the \nfield of view which is partially occluded by AOM. BGS Slide CSA \n1231\/2\/HCl-HF\/quantitative, ‘England Finder’coordinate N57\/4. \n \n \nPLATE 3 \n \nA comparison of the hydrogen peroxide (H2O2) and the mineral acid (HCl\/HF) \npreparation techniques on sample 5 from the Grantham Formation (Aalenian, Middle \nJurassic) of the Copper Hill Borehole, Lincolnshire, U.K. For scale, which applies to \nboth photomicrographs, the specimen of the smooth trilete spore Cyathidites at the top \nright of fig. 1 is 58 μm in diameter. Both photomicrographs were taken using plain \ntransmitted light. Note the relatively abundant miospores in both preparations, and the \nabundant plant tissue in the HCl\/HF preparation (fig. 2). It is possible that significant \nproportions of the lighter plant tissues have been oxidized in the H2O2 preparation \n(fig. 1). \n \n1 the H2O2 preparation, note the relatively abundant miospores, including the \nsaccate pollen Callialasporites, and the clean nature of the residue. BGS slide \nMPA 36320\/3\/H2O2\/quantiattive, ‘England Finder’coordinate P72\/2. \n \n2 the HCl\/HF preparation, note the relatively abundant pollen and spores, \nincluding Callialasporites and Cyathidites, and the abundant plant tissue. BGS \nslide MPA 36320\/3\/HCl-HF\/quantitative, ‘England Finder’coordinate Q50. \n \n \nPLATE 4 \n \nA comparison of the sodium hexametaphosphate [(NaPO3)6] and the mineral acid \n(HCl\/HF) preparation techniques on sample 6 from the López de Bertodano \nFormation (Danian, Lower Paleocene) of Seymour Island, Antarctica. For scale, \nwhich applies to both photomicrographs, the specimen of the dinoflagellate cyst \nPalaeoperidinium pyrophorum at the bottom left of fig. 1 is 82 μm in length. Both \nphotomicrographs were taken using plain transmitted light. Note the abundant levels \nof Palaeoperidinium pyrophorum, and the overall similarity of these two preparations. \nThe H2O2 preparation is not illustrated here; the abundant specimens of \nPalaeoperidinium pyrophorum have apparently been oxidized by the 30% H2O2. \n \n 26\n1 the (NaPO3)6 preparation, note the relatively abundant, well-preserved \nspecimens of Palaeoperidinium pyrophorum, with occasional other taxa such \nas Hystrichosphaeridium salpingophorum at the center right. BGS slide MPA \n56193\/1\/(NaPO3)6\/non-quantitative, ‘England Finder’coordinate P63\/1. \n \n2 the HCl\/HF preparation, note the abundant, specimens of Palaeoperidinium \npyrophorum well-preserved miospores, with moderate levels of plant tissue. \nBGS slide MPA 56193\/3\/hexa\/quantitative, ‘England Finder’coordinate \nM52\/3. \n \n \nPLATE 5 \n \nA comparison of the hydrogen peroxide (H2O2) and the mineral acid (HCl\/HF) \npreparation techniques on sample 7 from the López de Bertodano Formation (Danian, \nLower Paleocene) of Seymour Island, Antarctica. The assemblage is overwhelmingly \ndominated by the Spinidinium sp., which is a pale, biconical, proximate dinoflagellate \ncyst. Note the overall similarity of the two preparations. Note that plant tissue is \nsignificantly more common in the HCl\/HF preparation (fig. 2). It is therefore possible \nthat some of the non-woody plant tissues have been oxidized in the H2O2 preparation \n(fig. 1). For scale, which applies to both photomicrographs, the abundant \nrepresentatives of Spinidinium are typically between 40-47 μm long and 27-33 μm \nwide. Both photomicrographs were taken using phase contrast illumination. \n \n1 the H2O2 preparation, note the abundant representatives of Spinidinium. BGS \nslide MPA 56194\/3\/H2O2\/quantitative, ‘England Finder’coordinate Q53\/1. \n \n2 the HCl\/HF preparation, again note the abundant Spinidinium spp., a small \nbiconical dinoflagellate cyst. BGS slide MPA 56194\/3\/HCl-HF\/quantitative, \n‘England Finder’coordinate R52\/4. \n \n \nProofmarks for Riding\/Kyffin-Hughes\/Owens: \n \nGlobal: the author names on the header should not be ‘J. B. Riding and J.E. Kyffin-\nHughes’; please replace with either ‘J. B. Riding et al.’ or ‘J. B. Riding, J.E. \nKyffin-Hughes, and B. Owens’ \n \n1 p. 1.  Please do not underline my email address. \n2 p. 1.  Abstract, 9 lines from the bottom.  The ‘o’ in ‘López’ has an acute \naccent (ó).  Please check this globally; I think that you have got all the \nothers. \n3 Check the size of the hyphen on the first line of ‘THE PREVIOUSLY \nDECRIBED……….’  Is it too big? \n4 p. 3, col. 1, two lines up from base.  Please replace the ‘to’ with ‘of’.  It \nshould read: ‘…….on the exposure of the heated……’ \n5 p. 3, col. 2, twelve lines up from base.  Up-to-date, not Up to date.  (insert \nhyphens). \n6 p. 3, col. 2, nine\/ten lines up from base.  Please do not underline this web \naddress. \n 27\n7 p. 4, col. 2, ten lines up from base.  U.S.A. and not U.S.A (please insert \nstop after ‘A’. \n8 p. 5, col. 2, six lines up from base.  well-lithified and not well lithified \n(insert hyphen). \n9 p. 5, col. 2, five lines up from base.  It should read: ‘In this case, it is…..’ \nand not ’In this case, is…..’ Please insert ‘it’. \n10 p. 8 Plate 3, fig 1 explanation.  ‘quantitative’ and not ‘quantiattive’ please. \n11 p. 8, col. 1, three lines down from top.  Please insert ‘U.K.’ after \n‘England’. \n12 p. 10, Plate 5, fig 2 explanation.  Two lines from top.  ‘…..dominated by \nSpinidinium sp.……..’  Not ‘…..dominated by the Spinidinium sp……..’ \n(Delete ‘the’) \n13 p. 10, Plate 5, fig 2 explanation.  ‘Spinidinium sp.’ and not ‘Spinidinium \nspp.’ please. (delete a ‘p’). \n14 p. 12, col. 1, line 17.  Insert ‘U.K.’ after ‘Scotland’. \n15 p. 12, col. 1, line 22.  insert ‘from’, so that it reads: ‘….clays from \noffshore….’ \n16 p. 13, col. 1, line 22.  Delete ‘often’.  It should read: ‘….H2O2 frequently \ncannot….’  Not ‘….H2O2 often frequently cannot….’  (I.e. delete the \nsuperfluous word). \n17 p. 17, line 7.  ‘Spinidinium sp. and not ‘Spinidinium spp. (delete ‘p’). \n18 p. 18, col. 2.  Somehow, several names (Kedo)\/years (8 instances) here are \nin bold.  Can you please make them normal font? \n19 Delete the Jim photo on p. 19 (unfortunately!). \n \n"}