{"doi":"10.1080\/09638180701391014","coreId":"136150","oai":"oai:bradscholars.brad.ac.uk:10454\/3547","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3547","10.1080\/09638180701391014"],"title":"Corporate compliance with non-mandatory statements of best practice: the case of the ASB statement on interim reports.","authors":["Mangena, Musa","Tauringana, V."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2007","abstract":"NoThis paper contributes to our understanding of compliance with non-mandatory statements of best practice. Specifically, we examine the efficacy of agency-related mechanisms on the degree of disclosure compliance with the ASB Statement on interim reports. Using data drawn from a sample of 259 UK companies listed on the London Stock Exchange, we show that although overall disclosure compliance is high (74.5% of the items of information being disclosed), companies do not fully comply with the ASB Statement on interim reports. We employ an ordinary least square (OLS) regression model to establish whether selected company-specific and corporate governance characteristics (proxying for agency-related mechanisms) are related to the degree of disclosure compliance. Our results indicate that multiple listing, company size, interim dividend and new share issuance are positively associated with the degree of compliance. We also find that the degree of disclosure compliance is positively associated with auditor involvement, audit committee independence and audit committee financial expertise. These results have important implications for policy because they suggest that whilst agency-related mechanisms may motivate compliance with best practice non-mandatory statements, full compliance may be unattainable without regulations","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3547<\/identifier><datestamp>\n                2016-07-25T17:13:39Z<\/datestamp><setSpec>\n                com_10454_232<\/setSpec><setSpec>\n                col_10454_6344<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCorporate compliance with non-mandatory statements of best practice: the case of the ASB statement on interim reports.<\/dc:title><dc:creator>\nMangena, Musa<\/dc:creator><dc:creator>\nTauringana, V.<\/dc:creator><dc:subject>\nBest practice<\/dc:subject><dc:subject>\nAccounting<\/dc:subject><dc:subject>\nASB Statement on interim reports<\/dc:subject><dc:subject>\nDisclosure compliance<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis paper contributes to our understanding of compliance with non-mandatory statements of best practice. Specifically, we examine the efficacy of agency-related mechanisms on the degree of disclosure compliance with the ASB Statement on interim reports. Using data drawn from a sample of 259 UK companies listed on the London Stock Exchange, we show that although overall disclosure compliance is high (74.5% of the items of information being disclosed), companies do not fully comply with the ASB Statement on interim reports. We employ an ordinary least square (OLS) regression model to establish whether selected company-specific and corporate governance characteristics (proxying for agency-related mechanisms) are related to the degree of disclosure compliance. Our results indicate that multiple listing, company size, interim dividend and new share issuance are positively associated with the degree of compliance. We also find that the degree of disclosure compliance is positively associated with auditor involvement, audit committee independence and audit committee financial expertise. These results have important implications for policy because they suggest that whilst agency-related mechanisms may motivate compliance with best practice non-mandatory statements, full compliance may be unattainable without regulations.<\/dc:description><dc:date>\n2009-09-30T07:42:06Z<\/dc:date><dc:date>\n2009-09-30T07:42:06Z<\/dc:date><dc:date>\n2007<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nMangena, M. and Tauringana, V. (2007).  Corporate compliance with non-mandatory statements of best practice: the case of the ASB statement on interim reports.   European Accounting Review. Vol. 16, No. 2, pp. 399-427.<\/dc:identifier><dc:identifier>\n90012974<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3547<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1080\/09638180701391014<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1080\/09638180701391014"],"year":2007,"topics":["Best practice","Accounting","ASB Statement on interim reports","Disclosure compliance"],"subject":["Article","No full-text available in the repository"],"fullText":null}