{"doi":"10.1103\/PhysRevA.71.033417","coreId":"66462","oai":"oai:dro.dur.ac.uk.OAI2:1396","identifiers":["oai:dro.dur.ac.uk.OAI2:1396","10.1103\/PhysRevA.71.033417"],"title":"Quantum-mechanical cumulant dynamics near stable periodic orbits in  phase space : application to the classical-like dynamics of quantum accelerator modes.","authors":["Bach, R.","Burnett, K.","d'Arcy, M. B.","Gardiner, S. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-03","abstract":"We formulate a general method for the study of semiclassical-like dynamics in stable regions of a mixed phase space, in order to theoretically study the dynamics of quantum accelerator modes. In the simplest case, this involves determining solutions, which are stable when constrained to remain pure-state Gaussian wave packets, and then propagating them using a cumulant-based formalism. Using this methodology, we study the relative longevity, under different parameter regimes, of quantum accelerator modes. Within this attractively simple formalism, we are able to obtain good qualitative agreement with exact wave-function dynamics","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66462.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1396\/1\/1396.pdf","pdfHashValue":"ac768cbdaea840c315378d092048ecfd934c5e66","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1396<\/identifier><datestamp>\n      2011-08-05T13:26:13Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Quantum-mechanical cumulant dynamics near stable periodic orbits in  phase space : application to the classical-like dynamics of quantum accelerator modes.<\/dc:title><dc:creator>\n        Bach, R.<\/dc:creator><dc:creator>\n        Burnett, K.<\/dc:creator><dc:creator>\n        d'Arcy, M. B.<\/dc:creator><dc:creator>\n        Gardiner, S. A.<\/dc:creator><dc:description>\n        We formulate a general method for the study of semiclassical-like dynamics in stable regions of a mixed phase space, in order to theoretically study the dynamics of quantum accelerator modes. In the simplest case, this involves determining solutions, which are stable when constrained to remain pure-state Gaussian wave packets, and then propagating them using a cumulant-based formalism. Using this methodology, we study the relative longevity, under different parameter regimes, of quantum accelerator modes. Within this attractively simple formalism, we are able to obtain good qualitative agreement with exact wave-function dynamics.<\/dc:description><dc:subject>\n        Delta-kicked rotor<\/dc:subject><dc:subject>\n         Atom-optics billiards<\/dc:subject><dc:subject>\n         Wave-packet dynamics<\/dc:subject><dc:subject>\n         Momentum distributions<\/dc:subject><dc:subject>\n         Semiclassical dynamics<\/dc:subject><dc:subject>\n         Standing-wWave<\/dc:subject><dc:subject>\n         Chaos<\/dc:subject><dc:subject>\n         Localization<\/dc:subject><dc:subject>\n         System<\/dc:subject><dc:subject>\n         Decoherence.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review A, 2005, Vol.71, pp.033417 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1396<\/dc:identifier><dc:identifier>\n        issn:1050-2947<\/dc:identifier><dc:identifier>\n        issn: 1094-1622<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevA.71.033417<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1396\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevA.71.033417<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1396\/1\/1396.pdf<\/dc:identifier><dc:rights>\n        © 2005 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-2947"," 1094-1622","1050-2947","issn: 1094-1622"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Delta-kicked rotor","Atom-optics billiards","Wave-packet dynamics","Momentum distributions","Semiclassical dynamics","Standing-wWave","Chaos","Localization","System","Decoherence."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 April 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBach, R. and Burnett, K. and d’Arcy, M. B. and Gardiner, S. A. (2005) ’Quantum-mechanical cumulant\ndynamics near stable periodic orbits in phase space : application to the classical-like dynamics of quantum\naccelerator modes.’, Physical review A., 71 . 033417.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.71.033417\nPublisher’s copyright statement:\n2005 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nBach, R. and Burnett, K. and d'Arcy, M. B. and Gardiner, S. A. (2005) 'Quantum-\nmechanical cumulant dynamics near stable periodic orbits in phase space : application \nto the classical-like dynamics of quantum accelerator modes.' , Physical review A., 71, \n033417. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.71.033417 \nar\nX\niv\n:p\nhy\nsic\ns\/0\n31\n01\n43\nv3\n  [\nph\nys\nics\n.at\nom\n-p\nh]\n  2\n0 A\npr\n 20\n04\nQuantum Mechanical Cumulant Dynamics near Stable Periodic Orbits in Phase Space\nR. Bach,1 M.B. d’Arcy,2 S.A. Gardiner,3 and K. Burnett4\n1Center for Theoretical Physics, Polish Academy of Sciences, 02-668 Warsaw, Poland\n2Atomic Physics Division, National Institute of Standards and Technology, Gaithersburg, Maryland 20899-8423\n3JILA, University of Colorado and National Institute of Standards and Technology, Boulder, Colorado 80309-0440\n4Clarendon Laboratory, Department of Physics, University of Oxford, Oxford OX1 3PU, United Kingdom\n(Dated: March 6, 2008)\nWe formulate a general method for the study of semiclassical-like dynamics in stable regions of a mixed\nphase-space. In the simplest case, this involves determining stable Gaussian wavepacket solutions, and then\npropagating them using a cumulant-based formalism. We apply our method to the problem of quantum ac-\ncelerator modes, determining their relative longevity under different parameter regimes, and obtaining good\nqualitative agreement with exact wavefunction dynamics.\nPACS numbers: 03.65.Sq, 02.50.Cw, 05.45.Mt, 32.80.Lg\nSemiclassical approaches in quantum chaotic dynamics\nhave proved very successful in forging conceptual links be-\ntween classically chaotic systems and their quantum mechan-\nical counterparts [1]. When trying to include quantum me-\nchanical effects, an obvious step beyond point-particle dy-\nnamics is to consider the evolution of Gaussian wavepack-\nets. Straightforward semiclassical Gaussian wavepacket dy-\nnamics are limited in that, e.g., the wavepacket is unrealisti-\ncally forced to maintain its Gaussian form. Pioneering work\nby Huber, Heller, and Littlejohn [2] proposed remedying this\nby allowing complex classical trajectories. These also per-\nmit the study of a wider range of classically forbidden pro-\ncesses, and the propagation of superpositions of Gaussians.\nWe propose an alternative approach, which, most simply, is\nto follow the dynamics of the cumulants of initially Gaus-\nsian wavepackets. When taken to second order, the dynam-\nics are described purely in terms of means and variances, as\nin a Gaussian wavepacket, but evolution into non-Gaussian\nwavepackets is not proscribed. After developing the formal-\nism, we apply it to an exciting development in atom-optical\nstudies of quantum-nonlinear phenomena: quantum accelera-\ntor modes (QAM) [3, 4, 5, 6, 7, 8, 9]. Quantum accelerator\nmodes have proved to be a fascinating example of a robust\nquantum resonance effect, and the demonstrated coherence of\ntheir formation [6] promises important applications in coher-\nent atom optics [4, 10]. In a configuration consisting of a laser\ncooled cloud of freely falling cesium atoms subjected to peri-\nodic δ-like kicks from a vertically oriented off-resonant laser\nstanding wave [3, 4, 5, 6, 7, 8], QAM are characterized exper-\nimentally by a momentum transfer, linear with kick number,\nto a substantial fraction (up to ∼ 20%) of the initial cloud of\natoms. This system is also attractive in that it is possible to\ntune its effective classicality in an accessible regime far from\nthe true semiclassical limit, making it an ideal testing ground\nfor semiclassical theories. We use our approach to obtain in-\nsight into the relative longevity of QAM, and present very en-\ncouraging results on its utility.\nWe consider two conjugate self-adjoint operators: ˆξ and ˆζ,\nsuch that [ ˆξ, ˆζ] = iη, and a Hamiltonian ˆH( ˆξ, ˆζ). The dynam-\nics of these operators can be fully described by the expectation\nvalues µξ = 〈 ˆξ〉 and µζ = 〈 ˆζ〉 only as η → 0. In this limit there\nis a well-defined {ξ, ζ} phase space, which generally consists\nof a mixture of stable islands based around stable periodic or-\nbits, and a chaotic sea. This is the case for our model example,\nthe δ-kicked accelerator (see Fig. 1) [5].\nWhen considering dynamics near a stable periodic orbit in\nphase space, we use that: local dynamics approximate those of\na harmonic oscillator [11], and Gaussian wavepackets remain\nGaussian when experiencing harmonic dynamics. This moti-\nvates the initial use of a Gaussian ansatz of the form [2, 12]\nψ(ξ) =(2πσ2ξ)−1\/4\n× exp\n− [1 − i2σ\n2\nξζ\/η][ξ − µξ]2\n4σ2\nξ\n+\niµζ [ξ − µξ]\nη\n , (1)\nwhere σ2\nξ\n= 〈 ˆξ2〉 − 〈 ˆξ〉2 is the variance in ˆξ, and σ2\nξζ\n=\n〈 ˆξ ˆζ + ˆζ ˆξ〉\/2 − 〈 ˆξ〉〈 ˆζ〉 is the symmetrized covariance in ˆξ and\nˆζ. As Eq. (1) describes a minimum uncertainty wavepacket,\nthe ˆζ variance, σ2ζ = 〈 ˆζ2〉 − 〈 ˆζ〉2, can be deduced from the\ngeneral uncertainty relation σ2ξσ\n2\nζ − (σ2ξζ)2 = η2\/4 [this can\nbe seen from Eq. (1), using −iη∂\/∂ξ as the ξ representation of\nˆζ]. If the stable islands around the periodic orbits of interest\nare significant compared to the size of a minumum uncertainty\nwavepacket, we find stable periodic orbits in {µξ , µζ , σ2ξ , σ2ξζ}\nwhen such a Gaussian ansatz is enforced. In reality this sta-\nbility is only approximate, but we will nevertheless utilize\nsuch solutions, as they are good estimates to maximally stable\nGaussian wavepackets.\nA complete picture of the observable dynamics can only be\ndetermined from the time-evolution of all possible expectation\nvalues of products of the dynamical variables. Except for very\nsimple systems, this produces a complicated hierarchy of cou-\npled equations. In order to gain any insight we must determine\na truncation scheme to reduce this to a managable description.\nThis is in a sense achieved by the Gaussian ansatz, which\nconsiders only means and variances. Means and variances\nare the first two orders of an infinite hierarchy of cumulants\n[13], which we denote by double angle brackets to distinguish\n2them from expectation values. The non-commutative cumu-\nlants can be obtained directly in terms of operator expectation\nvalues through [14]\n〈〈qˆ1 · · · qˆn〉〉 = ∂\n∂τ1\n· · · ∂\n∂τn\nln〈eτ1qˆ1 · · · eτnqˆn〉|τ1=0,...,τn=0, (2)\nwhere qˆi ∈ { ˆξ, ˆζ}. More conveniently, the expectation values\ncan be expressed in terms of cumulants:\n〈qˆ1〉 =〈〈qˆ1〉〉,\n〈qˆ1qˆ2〉 =〈〈qˆ1qˆ2〉〉 + 〈〈qˆ1〉〉〈〈qˆ2〉〉,\n〈qˆ1qˆ2qˆ3〉 =〈〈qˆ1qˆ2qˆ3〉〉 + 〈〈qˆ1〉〉〈〈qˆ2qˆ3〉〉 + 〈〈qˆ2〉〉〈〈qˆ1qˆ3〉〉\n+ 〈〈qˆ3〉〉〈〈qˆ1qˆ2〉〉 + 〈〈qˆ1〉〉〈〈qˆ2〉〉〈〈qˆ3〉〉, . . . ,\n(3)\nwhere the ordered observables have been partitioned in all\npossible ways into products of cumulants. Cumulants tend to\nbecome smaller with increasing order, unlike expectation val-\nues; intuitively, higher-order cumulants encode only an ‘ex-\ntra bit’ of information that lower-order cumulants have not\nyet provided. It is therefore often possible to provide a good\ndescription by systematically truncating, expressing moments\nof all orders in terms of cumulants up to some finite order\n[14]. Truncating at first order is equivalent to considering only\nmean values, and thus reproduces the corresponding Hamil-\nton’s equations of motion. It is tempting to think that trun-\ncating at second order is equivalent to enforcing the Gaussian\nansatz. This will not in general reproduce the dynamics given\nby enforcing the Gaussian ansatz. Gaussian wavepacket dy-\nnamics are unitary, meaning that the uncertainty relation is\nalways exactly observed, and that one need consider only two\nof {σ2\nξ\n, σ2\nζ\n, σ2\nξζ\n}. This is only true when no terms in the Hamil-\ntonian are of greater than quadratic order in { ˆξ, ˆζ} [2]. Further-\nmore, finding a fixed point of {µξ , µζ , σ2ξ , σ2ξζ} is equivalent to\nfinding a perfectly Gaussian eigenstate of the system, which\nis only true for the harmonic oscillator.\nWhen propagating the second-order truncated equations of\nmotion for the first and second order cumulants, it is necessary\nto consider the dynamics of each of {σ2ξ , σ2ζ , σ2ξζ} explicitly,\nas, unlike for the Gaussian ansatz [Eq. (1)], the uncertainty\nrelation is not hard-wired into the formalism. This implies\nthat the evolution described solely in terms of the first and\nsecond order cumulants is not unitary. This feature of our ap-\nproach more accurately reflects the fact that truncating gener-\nally leaves us with an incomplete description of the dynamics,\nwith a correspondingly inevitable loss of information about\nthe state of the system. We are also not restricted to initially\npure states, although this flexibility is not exploited here.\nNonetheless, when situated inside a stable island in {ξ, ζ}\nphase space, such a ‘stable’ Gaussian wavepacket should be\nlong-lived due to the harmonic nature of the local dynam-\nics [15]. We then use the equations of motion appropriate to\nsecond-order cumulant dynamics to get an idea of how long-\nlived the initial wavepacket actually is, as physically sensible\nimperfections are included in the dynamics in a straightfor-\nward manner.\nThe approach we have described is most obviously applica-\nble in the standard semiclassical regime, but is not restricted\nto it. We will illustrate our method by applying it to a very in-\nteresting and experimentally relevant system, the quantum δ-\nkicked accelerator [5], outside the semiclassical regime. Our\napproach provides useful insights on the longevity of QAM in\nthis system, essential for their possible application in coherent\natom optics [4, 10].\nThe dynamics of the atoms in the Oxford QAM experiment\n[3, 4, 5, 6, 7, 8] are well modelled by the one-dimensional\nδ-kicked accelerator Hamiltonian:\nˆH =\npˆ2\n2m\n+ mgzˆ − ~φd[1 + cos(Gzˆ)]\n∞∑\nn=−∞\nδ (t − nT ) . (4)\nHere zˆ is the position, pˆ the momentum, m the particle mass, g\nthe gravitational acceleration, t the time, T denotes the pulse\nperiod, G = 2π\/λspat where λspat is the spatial period of the\npotential applied to the atoms, and ~φd quantifies the depth of\nthis potential.\nThe near-fulfilment of the quantum resonance condition\n(closeness to particular resonant pulse periodicities [4, 9, 16])\nmeans the free evolution of a wavefunction, e.g., initially well\nlocalized in momentum and (periodic) position space imme-\ndiately after it experiences a kick, causes it to rephase to close\nto its initial condition just before each subsequent kick. The\ntreatment due to Fishman, Guarneri, and Rebuzzini accounts\nfor this in terms of a so-called ǫ-classical limit [9], where a\nkind of kick-to-kick classical point dynamics is regained in\nthe limit of the pulse periodicity approaching integer mul-\ntiples of the half-Talbot time T1\/2 = 2πm\/~G2 [4], i.e., as\nǫ = 2π(T\/T1\/2 − ℓ) → 0, where ℓ ∈ Z. This accurately ac-\ncounts for the observed acceleration for up to ∼ 100 kicks, as\nwell as predicting numerous experimentally observed high-\norder accelerator modes [7]. It is this ǫ, whose smallness indi-\ncates nearness to special resonant kicking frequencies, leading\nto the production of QAM [9], and not ~, which takes the place\nof η in our cumulant-based approach. We now sketch the treat-\nment of Refs. [9] to justify the appropriate phase-space which\nis the starting point of our analysis, providing enough detail\nfor the explanation to be self-contained.\nMoving to a frame comoving with the gravitational accel-\neration [ ˆU = exp(imgzˆt\/~)], Eq. (4) transforms to:\nH =\n(ρˆ − γt˜)2\n2\n− κ(1 + cos χˆ)\n∞∑\nn=−∞\nδ\n(\nt˜ − n) . (5)\nWe have used scaled units: χˆ = Gzˆ, ρˆ = GT pˆ\/m, and t˜ = t\/T .\nThe parameters are: the rescaled effect of gravity γ = gGT 2,\nand the stochasticity parameter κ = ~φdG2T\/m = kφd, where\nk = ~G2T\/m = 2πT\/T1\/2 = −i[χˆ, ρˆ] is a rescaled Planck\nconstant. As the transformed Hamiltonian is spatially peri-\nodic, we parametrize the momentum in terms of the quasi-\nmomentum (in the lab frame, the initial quasimomentum) β,\ni.e., |ρ〉 = |(n + β)k〉, where n ∈ Z and β ∈ [0, 1). The cor-\nresponding time-dependent kick-to-kick time-evolution oper-\nator ˆFn =\n∫\ndβ ˆFn(β) ˆP(β). Here ˆP(β) is a projection oper-\n3FIG. 1: (color online). Poincare´ sections determined by ǫ-classical\nversions of Eq. (7) (white dots), superimposed on Wigner functions\ncorresponding to single wavepackets of the form given in Eq. (1)\n(color density plots). Means and variances determined by Eq. (8),\nfor ˜k = 2 and (a) ǫ = −0.2, (b) ǫ = 0.2. Units are dimensionless.\nator ensuring that ˆFn(β) acts on a subspace of one value of\nβ only, and the time-evolution of the transformed wavevec-\ntor |ψ〉 is given by |ψ(t˜ = n′)〉 = ∏n′n=1 ˆFn|ψ(0)〉. Substituting\nǫ = 2π(T\/T1\/2 − ℓ) = k − 2πℓ,\nˆFn(β) = exp(−i{ ˆI + sgn(ǫ)[πℓ + kβ − γ(n − 1\/2)]}2\/2ǫ)\n× exp(i˜k cos ˆθ\/|ǫ|). (6)\nSubspaces of different β are decoupled. A wavefunction con-\ntained within any such subspace is periodic, multiplied by a\nphase e−iβχˆ, and can be equivalently represented by a rotor\nwavefunction [9]. We have therefore introduced the angle\nvariable ˆθ = χˆmod(2π) and its discrete conjugate momentum\nˆI (∝ ρˆ|ǫ|\/k with a discrete spectrum of integer multiples of\n|ǫ|), where [ˆθ, ˆI] = i|ǫ| and ˜k = κ|ǫ|\/k = φd |ǫ|.\nThe kick-to-kick Heisenberg map corresponding to the\ntime-evolution operator of Eq. (6) is given by\nˆθn+1 =ˆθn + sgn(ǫ) ˆJn+1, (7a)\nˆJn+1 = ˆJn − ˜k sin ˆθn − sgn(ǫ)γ, (7b)\nwhere we have introduced ˆJn = ˆIn + sgn(ǫ)[πℓ + kβ − γ(n −\n1\/2)]. We thus reduce the dynamics of each of the decou-\npled β-rotor subspaces to a mapping [Eq. (7)] plus a sim-\nple transformation, where the overall dynamics can be recov-\nered by the superposition principle [9]. The general relation\n[ ˆξ, ˆζ] = iη, which we is for this specific example replaced\nby [ˆθ, ˆJ] = i|ǫ|. Quantum accelerator modes are explained\nby stable periodic orbits in the {θ,J} phase space obtained\nby taking the pseudoclassical limit (|ǫ| → 0) [9], independent\nof what the phase space structure in the semiclassical limit\n(k → 0) might be. We consider the originally discovered (1,0)\naccelerator modes around T = T1\/2 [3], corresponding to a\nfixed point of order 1 and jumping index 0 in the ǫ-classical\nmapping produced by replacing the operators in Eq. (7) with\ntheir mean values [9].\nThe quantities we consider are the mean position θ, the\nmean momentumJ , the position variance σ2, the momentum\nFIG. 2: (color online). Number of iterations of Eq. (9) evolved by\na Gaussian stable fixed point such that |J| < π. Black indicates\nabsence of ǫ-classical stable solutions [9], white absence of Gaussian\nstable solutions. Numbers label the contours where |J| < π for that\nnumber of iterations (the number of iterations is capped at 100). The\nsolid line marks the average experimental laser intensity φd = 0.8π,\ndashes demarcate its experimental range (0.3π–1.2π) [6]. Units are\ndimensionless.\nvariance S 2, and the symmetrized covariance Υ, correspond-\ning to the general quantities {µξ , µζ , σ2ξ , σ2ζ , σ2ξζ}. Enforcing\nthe Gaussian ansatz of Eq. (1) and implicitly assuming\n√\nσ2\nto be small compared to 2π, the resulting kick-to-kick Gaus-\nsian mapping is given by\nθn+1 =θn + sgn(ǫ)Jn+1, (8a)\nJn+1 =Jn − ˜ke−σ2n\/2 sin θn − sgn(ǫ)γ, (8b)\nσ2n+1 =σ\n2\nn + 2sgn(ǫ)(Υn − ˜ke−σ\n2\nn\/2σ2n cos θn)\n+ [2(Υn − ˜ke−σ2n\/2σ2n cos θn)2 + ǫ2]\/4σ2n, (8c)\nΥn+1 =Υn − ˜ke−σ2n\/2σ2n cos θn\n+ sgn(ǫ)[2(Υn − ˜ke−σ2n\/2σ2n cos θn)2 + ǫ2]\/4σ2n, (8d)\nwhere S 2\nn+1 can be deduced from σ\n2\nn+1S\n2\nn+1 −Υ2n+1 = ǫ2\/4. In\nour search for ‘stable’ Gaussian wavepackets, we search for\nsolutions extending the conditions θn+1 = θn and Jn+1 = Jn,\nappropriate to an ǫ-classical fixed point, to σ2\nn+1 = σ\n2\nn, S 2n+1 =\nS 2n and Υn+1 = Υn. A Gaussian solution is thus dependent on\nǫ as well as ˜k and γ. We consider situations which correspond\nexperimentally to freely varying the kicking periodicity and\nthe laser intensity, with γ = gGT 2 determined by T = (ǫ +\n2π)T1\/2\/2π, g = 9.8 ms−2, and G = 2π\/(447 nm). Wigner\nrepresentations [13] of such ‘stable’ Gaussian wavepackets,\noverlaid by Poincare´ sections of the ǫ-classical phase space\n[9], are shown in Fig. 1. We see that the Wigner functions\nclosely match the shape of the stable island.\n4~\n-2 -1 0 1 2\nε\n0\n1\n2\n3\n4\n5\n6\n7\nk\n0\n20\n40\n60\n80\n100\nFIG. 3: (color online). As in Fig. 2, but for exact wavepacket evo-\nlutions, propagating initial conditions from Eq. (10) with the time\nevolution operator of Eq. (6) (β = 0). Units are dimensionless.\nWe now come to the central point of our analysis, propagat-\ning Gaussian fixed point solutions using the full second-order\ncumulant mapping, where all variances must be considered\nexplicitly:\nθn+1 =θn + sgn(ǫ)Jn+1, (9a)\nJn+1 =Jn − ˜ke−σ2n\/2 sin θn − sgn(ǫ)γ, (9b)\nσ2n+1 =σ\n2\nn + S 2n+1 + 2sgn(ǫ)(Υn − ˜ke−σ\n2\nn\/2σ2n cos θn), (9c)\nS 2n+1 =S\n2\nn − 2˜ke−σ\n2\nn\/2Υn cos θn\n+ ˜k2(1 − e−σ2n )[1 + e−σ2n cos(2θn)]\/2, (9d)\nΥn+1 =Υn − ˜ke−σ2n\/2σ2n cos θn + sgn(ǫ)S 2n+1. (9e)\nThis mapping has no fixed points. In Fig. 2, we display the\ntime for which the center of mass momentum remains inside\nits initial phase space cell (|Jn| < π), using this as a rule-\nof-thumb measure of relative longevity (for a genuine fixed\npoint this would be forever). We see that there is a sizable\nregion where there there are no stable Gaussian fixed points, in\naddition to the region where there are no ǫ-classical solutions,\nand that QAM for ǫ < 0 are generally more long-lived. These\nobservations are broadly born out by experiment [3].\nWe have also computed for how long |Jn| < π when inte-\ngrating the exact evolution described by Eq. (6) [5]. The com-\nputationally more convenient I representation of the initial\nstate determined by Eqs. (8a)–(8d) is then |ψ〉 ∝ ∑∞n=−∞ cn|I =\nn|ǫ|〉, where [17]\ncn =\n[\nσ2\n2π(ǫ2\/4 + Υ2)\n]1\/4\n× exp\n(\n−σ\n2\/ǫ2[n|ǫ| − I0]2\n1 − i2Υ\/|ǫ| −\niθ0[n|ǫ| − I0]\n|ǫ|\n)\n.\n(10)\nThis corresponds to a spatially periodic train of shifted Gaus-\nsians. Figure 3 shows the results of these integrations. We see\nthat Fig. 2 reproduces its qualitative features quite well, es-\npecially for smaller values of ǫ and ˜k. More surprising is the\nreplication of a saddle-point feature at around {ǫ = −1.5, ˜k =\n2}, indicating a resurgence of stability for large ǫ that is clearly\nnot an artefact of our approximations.\nIn conclusion, we have developed a general method for\nusing second order cumulants to study semiclassical-like\ndynamics near stable periodic orbits in phase space. We\nhave successfully applied this method to quantum accelerator\nmode dynamics, which operate in an unusual ǫ-semiclassical\nregime, thus gaining insight into the longevity of quantum ac-\ncelerator modes in different parameter regimes.\nWe thank R.M. Godun, I. Guarneri, T. Ko¨hler, M. Kus´, and\nK. ˙Zyczkowski for stimulating discussions. We acknowledge\nsupport from the ESF through BEC2000+, the UK EPSRC,\nthe EU through the ‘Cold Quantum Gases’ network, the Royal\nSociety, the Wolfson Foundation, the Lindemann Trust, and\nNASA.\n[1] M.C. Gutzwiller, Chaos in Classical and Quantum Mechanics\n(Springer, New York, 1990).\n[2] D. Huber and E.J. Heller, J. Chem. Phys. 87, 5302 (1987), and\nreferences therein; D. Huber, E.J. Heller, and R.G. Littlejohn,\nibid. 89, 2003 (1988).\n[3] M.K. Oberthaler et al., Phys. Rev. Lett. 83, 4447 (1999).\n[4] R.M. Godun et al., Phys. Rev. A 62, 013411 (2000).\n[5] M.B. d’Arcy et al., Phys. Rev. E 64, 056233 (2001).\n[6] S. Schlunk et al., Phys. Rev. Lett. 90, 054101 (2003).\n[7] S. Schlunk et al., Phys. Rev. Lett. 90, 124102 (2003).\n[8] M.B. d’Arcy et al., Phys. Rev. A 67, 023605 (2003).\n[9] S. Fishman, I. Guarneri, and L. Rebuzzini, Phys. Rev. Lett. 89,\n084101 (2002); J. Stat. Phys. 110, 911 (2003).\n[10] P. Berman, Atom Interferometry (Academic, San Diego, 1997).\n[11] A.J. Lichtenberg and M.A. Lieberman, Regular and Chaotic\nDynamics (Springer, New York, 1992), 2nd ed.\n[12] This in principle assumes both ˆξ and ˆζ to be continuously de-\nfined on (−∞,∞).\n[13] C.W. Gardiner, Handbook of Stochastic Methods (Springer,\nBerlin, 1996), 2nd ed.\n[14] J. Fricke, Ann. Phys. (N.Y.) 252, 479 (1996); T. Ko¨hler and K.\nBurnett, Phys. Rev. A 65, 033601 (2002).\n[15] S. Tomsovic and E.J. Heller, Phys. Rev. Lett. 67, 664 (1991);\nM.A. Sepulveda, S. Tomsovic, and E.J. Heller, ibid. 69, 402\n(1992).\n[16] M.V. Berry and E. Bodenschatz, J. Mod. Opt. 46, 349 (1999).\n[17] For small σ2, the ∝ can be considered an equality. In principle\nthe state must be normalized to compensate for the Gaussian\nwavepacket not dropping to zero at the θ boundary.\n"}