{"doi":"10.1016\/j.jairtraman.2005.01.007","coreId":"140927","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1453","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1453","10.1016\/j.jairtraman.2005.01.007"],"title":"Passengers’ perceptions of low cost airlines and full service carriers: a case study involving Ryanair, Aer Lingus, Air Asia and Malaysia Airlines","authors":["O'Connell, John F.","Williams, George"],"enrichments":{"references":[{"id":37922209,"title":"A qualitative study of the current practices of ‘no-frills’ airlines operating in the UK,","authors":[],"date":"2001","doi":"10.1177\/135676670100700402","raw":"Gilbert, D., Child, D., & Bennett, M., 2001. A qualitative study of the current practices of ‘no-frills’ airlines operating in the UK, Journal of Vacation Marketing 7, No. 4, 302-315.","cites":null},{"id":37922203,"title":"Air Asia to issue RPF for up to 80 new aircraft,","authors":[],"date":"2004","doi":null,"raw":"Air Transport Intelligence (ATI), 2004. Air Asia to issue RPF for up to 80 new aircraft, Air Transport Intelligence news, 11 th  June.","cites":null},{"id":37922217,"title":"Air carrier demand: analysis of market share determinants,","authors":[],"date":"1995","doi":"10.1007\/bf01098165","raw":"Proussaloglou, K., Koppleman, F., 1995. Air carrier demand: analysis of market share determinants, Transportation 22, 371-388. Ryanair, 2004.  www.ryanair.com Ryanair, 2002. Annual Report and Financial Statement Sreenivasan, V., 2003. ‘Low-Fare dogfight looms, The Business Times, Singapore, December 11.","cites":null},{"id":37922205,"title":"Asia’s emerging low cost carriers, Aviation Strategy,","authors":[],"date":"2003","doi":null,"raw":"Aviation Strategy, 2003. Asia’s emerging low cost carriers, Aviation Strategy, May, 2-5.","cites":null},{"id":37922211,"title":"Asian e-volution, Airline Business,","authors":[],"date":"2001","doi":null,"raw":"Ionides, N., 2001. Asian e-volution, Airline Business, March, 74-75.","cites":null},{"id":37922219,"title":"Comparison of passenger profiles and selection criteria: a study of London","authors":[],"date":"2003","doi":null,"raw":"Turner, S., 2003. Comparison of passenger profiles and selection criteria: a study of London – Amsterdam passengers, ATRS Conference, Toulouse.","cites":null},{"id":37922207,"title":"Continental barriers to LCC expansion, Aviation Strategy,","authors":[],"date":"2003","doi":null,"raw":"Aviation Strategy, 2003. Continental barriers to LCC expansion, Aviation Strategy, January, 2.","cites":null},{"id":37922218,"title":"Fortress Defense,","authors":[],"date":"2002","doi":null,"raw":"Still, S., 2002. Fortress Defense, Airline Business, September.","cites":null},{"id":37922216,"title":"Market segments:","authors":[],"date":"1994","doi":null,"raw":"Paci, E., 1994. Market segments: The major international VFR markets’ EIU travel and tourism analyst 6, 36-50.","cites":null},{"id":37922212,"title":"Marketing low-cost airline services to business travelers,","authors":[],"date":"2001","doi":"10.1016\/s0969-6997(00)00036-3","raw":"Mason, K., 2001. Marketing low-cost airline services to business travelers, Journal of Air Transport Management 7(2), 103-109.","cites":null},{"id":37922208,"title":"Peripheral market entry, product differentiation, supplier rents and sustainability in the deregulated European aviation market – a case study,","authors":[],"date":"1999","doi":"10.1016\/s0969-6997(98)00033-7","raw":"Barrett, S., 1999. Peripheral market entry, product differentiation, supplier rents and sustainability in the deregulated European aviation market – a case study, Journal of Air Transport Management 5(1), 21-30.","cites":null},{"id":37922215,"title":"Room for all?, Airline Business,","authors":[],"date":"2004","doi":null,"raw":"O’Connell, J. F., Ionides, N., 2004. Room for all?, Airline Business, April, 30-32.","cites":null},{"id":37922204,"title":"Ryanair plans to lease ‘significant minority’ of fleet,","authors":[],"date":"2003","doi":null,"raw":"Air Transport Intelligence (ATI), 2003. Ryanair plans to lease ‘significant minority’ of fleet, Air Transport Intelligence news, 3 rd November.","cites":null},{"id":37922214,"title":"Short breaks abroad,","authors":[],"date":"2002","doi":null,"raw":"Mintel, 2002. Short breaks abroad, June.","cites":null},{"id":37922210,"title":"The economics of the Internet, the new economy and opportunities for airports,","authors":[],"date":"2002","doi":"10.1016\/s0969-6997(01)00041-2","raw":"Gillan, D. & Lall, A., 2002. The economics of the Internet, the new economy and opportunities for airports, Journal of Air Transport Management 8, 49-62.","cites":null},{"id":37922213,"title":"Visiting Friends and relatives -","authors":[],"date":"2000","doi":null,"raw":"Mintel, 2000. Visiting Friends and relatives - UK, December.","cites":null},{"id":37922220,"title":"Will Europe’s charter carriers be replaced by “no-frills” scheduled Airlines?,","authors":[],"date":"2001","doi":"10.1016\/s0969-6997(01)00022-9","raw":"Williams, G., 2001. Will Europe’s charter carriers be replaced by “no-frills” scheduled Airlines?, Journal of Air Transport Management 7(5), 277-286.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-07-01T00:00:00Z","abstract":"Direct competition between full service airlines and no-frills carriers is intensifying across the world. US and European full service airlines have lost a significant proportion of their passengers to low cost carriers, the experience now being repeated in the domestic markets of Asia. This paper attempts to provide answers to a number of critical questions: What are the key drivers of each type of airline's business model? Is there a difference in passengers’ perceptions between low cost carriers and full service incumbents in a mature European market and in a rapidly developing Asian economy? What are the principle reasons why a passenger chooses a particular airline model? How could a legacy carrier encourage passengers to return and so regain their domestic market share? These questions are addressed using information obtained in passenger surveys that were recently conducted in Europe and Asia","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140927.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.jairtraman.2005.01.007","pdfHashValue":"00c97a481bdfc1a6cf36f0ddf028734a4e3dda64","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1453<\/identifier><datestamp>2016-02-10T12:02:52Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Passengers’ perceptions of low cost airlines and full service carriers: a case study involving Ryanair, Aer Lingus, Air Asia and Malaysia Airlines<\/dc:title><dc:creator>O'Connell, John F.<\/dc:creator><dc:creator>Williams, George<\/dc:creator><dc:subject>Full service airline<\/dc:subject><dc:subject>Low cost carrier<\/dc:subject><dc:subject>Passenger perceptions<\/dc:subject><dc:description>Direct competition between full service airlines and no-frills carriers is intensifying across the world. US and European full service airlines have lost a significant proportion of their passengers to low cost carriers, the experience now being repeated in the domestic markets of Asia. This paper attempts to provide answers to a number of critical questions: What are the key drivers of each type of airline's business model? Is there a difference in passengers’ perceptions between low cost carriers and full service incumbents in a mature European market and in a rapidly developing Asian economy? What are the principle reasons why a passenger chooses a particular airline model? How could a legacy carrier encourage passengers to return and so regain their domestic market share? These questions are addressed using information obtained in passenger surveys that were recently conducted in Europe and Asia.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2011-11-13T23:09:07Z<\/dc:date><dc:date>2011-11-13T23:09:07Z<\/dc:date><dc:date>2005-07-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>O'Connell, J.F. and Williams, G. 2005. Passengers' perceptions of low cost airlines and full service carriers: a case study involving Ryanair, Aer Lingus, Air Asia and Malaysia Airlines. Journal of air transport management, 11(4), pages 259-272. DOI: 10.1016\/j.jairtraman.2005.01.007<\/dc:identifier><dc:identifier>0969-6997<\/dc:identifier><dc:identifier>https:\/\/dx.doi.org\/10.1016\/j.jairtraman.2005.01.007<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1453<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0969-6997","issn:0969-6997"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Full service airline","Low cost carrier","Passenger perceptions"],"subject":["Article"],"fullText":" 1\nPassengers’ perceptions of low cost airlines and full service carriers \n- A case study involving Ryanair, Aer Lingus, Air Asia and Malaysia Airlines \n \n \nJohn F. O’Connell, George Williams* \n \nAir Transport Group, College of Aeronautics, Cranfield University, Bedfordshire, MK43 OAL, UK  \n \n \nAbstract \n \nDirect competition between full service airlines and no-frills carriers is intensifying \nacross the world. American and European full service airlines have lost a significant \nproportion of their passengers to low cost carriers, the experience now being repeated in \nthe domestic markets of Asia. This paper attempts to provide answers to a number of \ncritical questions: What are the key drivers of each type of airline’s business model? Is \nthere a difference in passengers’ perceptions between low cost carriers and full service \nincumbents in a mature European market and in a rapidly developing Asian economy? \nWhat are the principle reasons why a passenger chooses a particular airline model? How \ncould a legacy carrier encourage passengers to return and so regain their domestic market \nshare? These questions are addressed using information obtained in passenger surveys \nthat were recently conducted in Europe and Asia.  \n  \nKeywords: full service airline, low cost carrier, Aer Lingus, Ryanair, Malaysia Airlines, \nAir Asia. \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                                                 \n* Corresponding Author. Tel.: +44-1234-754239; fax: +44-1234-752207 \n  E-mail  addresses:  john.f.oconnell@cranfield.ac.uk, george.williams@cranfield.ac.uk \n \n 2\n \n1.0 Introduction \n \nThe aim of this paper is to compare passengers’ selection criteria between a full service \nairline and a low cost carrier in a mature European market and in a rapidly growing Asian \neconomy. Surveys have been undertaken to ascertain why passengers are choosing one \nparticular airline over another. Passenger surveys involving Ryanair and Air Asia have \nnot previously been conducted and this paper therefore contributes to the literature by \nexamining the differences in passengers’ perceptions between the two airline models in \ncontrasting geographical markets.  \n \nThe paper begins by examining the background of the selected carriers including traffic \ncarried and operating cost performance. It then concentrates primarily on the surveys that \nwere conducted in Europe and Asia, highlighting key findings such as passenger \ncharacteristics, journey purpose, booking methods, fares, connecting traffic, carrier \nchoice criteria and types of trips undertaken in the previous twelve months.  \n \n \n2.0  Background of the airlines surveyed \n \nLow cost carriers have reshaped the competitive environment within liberalised markets \nand have made significant impacts in the world’s domestic passenger markets, which had \npreviously been largely controlled by full service network carriers. In Europe, 14% of \nAvailable Seat Miles are now provided by low cost airlines, with the two largest players \neasyJet and Ryanair accounting for nearly 9%. These carriers have pursued simplicity, \nefficiency, productivity and high utilization of assets to offer low fares. Table 1 below \nprovides a summary of the main differentiating characteristics between incumbent \nnetwork carriers and no-frills scheduled airlines. \n \nTable 1 \n \nPrior to 2002, there were no significant low cost scheduled carriers operating in the Asia-\nPacific rim. Carriers such as JAL Express, Air Do and Skymark in Japan and Citilink in \nIndonesia existed some years earlier, but did not significantly impact their respective \nmarkets. The initial slow development was in part due to the perception that the low cost \nmodel adopted in the United States and Europe could not be replicated in Asia, because \nof the longer aircraft stage lengths, lack of secondary airports and regulatory restrictions \npreventing access to international markets. The latter being particularly relevant given \nthat the bulk of traffic and revenues are drawn from international markets in Asia. \n \nThus, the low cost experience is a relatively new phenomenon in the Asia Pacific rim \nwith much of the necessary management experience brought in from outside the region, \nfor example, from Ryanair. Asian low cost carriers accordingly are in the initial growth \nphase of their development, while many of their American and European counterparts are \napproaching or have reached maturity. Due to this, little data is available about low cost \n 3\noperations in Asia. Table 2 highlights the surge in low cost airlines commencing \noperations in the Asia Pacific rim within the last two years. \n \nTable 2  \n \n2.1 Ryanair and Aer Lingus  \n \nFigures 1a and 1b below show the annual passenger traffic carried by Ryanair and Aer \nLingus between 1997 and 2003 and their respective falling unit cost levels over this \nperiod. The incumbent has managed to reduce its unit cost to a level that it can now \nchallenge its low fare rival. The carrier’s business model has been effectively reshaped in \norder for it to compete out of Irish markets with Ryanair. \n \nFigures 1a & 1b \n \nWhen Ryanair was restructured and re-launched as a low cost carrier in 1991, it carried \n0.7 million passengers and Aer Lingus transported 3.7 million. It took only 7 to 8 years \nfor Ryanair to catch up. Fares charged by Aer Lingus on the Dublin-London and Cork –\nLondon routes were cut by 70% when Ryanair entered the market (Barrett, 1999). \n \nDuring the late 1990s and early 2000s, Ryanair achieved a compound annual traffic \ngrowth rate of 30.5%. The company has set itself the target of becoming the largest \nairline in Europe with over 40 million passengers a year (Ryanair, 2002). This ambitious \nplan is evidenced by the airline taking delivery of its 51st Boeing 737-800 in March 2004.  \nIn late 2003 the carrier ordered 125 Boeing 737-800s and placed options on a further 125 \n(ATI, 2003). It increased its capacity by 44% in 2003 alone and has tripled its seat \ncapacity overall since 2000. \n \nA significant proportion of its earnings are derived from ancillary revenues. In 2003, the \ncarrier made €28 million from commissions on car rentals, €23 million from in-flight \nsales, €12 million from Internet sales and €35 million from non-flight sales. It also gave \naway 20% of its flights for nothing in 2003 and aims for 50% free seats by 2009. \n  \nAer Lingus, the Irish flag carrier, which is 95% state-owned and part of the Oneworld \nalliance, now carries over 6 million passengers annually using 7 long-haul Airbus aircraft \nand 24 short-range types. The carrier’s 120 weekly transatlantic flights account for 40% \nof its revenue. Traffic feed via code sharing to British Airways at London Heathrow is \nkey to its UK-Ireland profitability. 88% of Aer Lingus’ cargo business is accounted for \nby its transatlantic and German markets, however airfreight overall is important to \nIreland as nearly one-quarter of the country’s exports and imports by value are \ntransported by air.  \n \nAer Lingus’s structural reformation into a low fares airline caused Ryanair’s profits on \nthe city pair to fall by 20% in 2003. In 2001, Aer Lingus had accumulated a net loss of \n€149 million and was losing €2.5 million a day, with passenger numbers having fallen by \n4.6% over the previous year. The new management instigated a survival plan targeting an \n 4\nannual cost reduction of 16%, representing €90 million. The carrier turned in a net profit \nof €69 million in 2003, producing an operating margin of 9.3%. Between 2001 and 2003, \nthe transformed carrier increased its passenger traffic by 7% and its load factor by 11%, \nwhile reducing seat capacity by 6%. Over the same period, Aer Lingus managed to \nreduce its operating costs significantly as a newly focused management team trimmed \n31% off fuel costs, 28% from airport charges, 51% off aircraft rentals, 12% from \nmaintenance, 53% off distribution, 21% from staff cuts, 36% off overheads, 21% from \ndepreciation and 49% off other miscellaneous direct operating costs, which netted the \ncarrier an overall saving of €340 million. \n \nTables 3 and 4 provide details of the passenger traffic carried by Aer Lingus and Ryanair \nbetween each main Irish airport and the five London airports between 1997 and 2002. \nThe growth in traffic carried by Ryanair between 1997 and 2002 is very high, with \nDublin - Stansted increasing by 36% and Cork-Stansted by 58%, while Shannon-Stansted \ngrew by 300,000 passengers in just over three years. Aer Lingus has also witnessed a \ngrowth in its traffic, with passenger numbers on the Dublin-Heathrow route increasing by \n29% and on Cork-Heathrow by 30% between 1997 and 2002. The traffic carried by Aer \nLingus on the Shannon-Heathrow route however remained flat over this period. \n \nTable 3 \n \nTable 4 \n \nBy the end of 2002, low cost carriers accounted for one-third of the total intra-European \nmarket involving the UK and Ireland. Between Ireland and the UK, low cost carriers \naccounted for 47.2% of the traffic (Aviation Strategy, January 2003). By 2004, Ryanair \nhas carried over 45 million passengers to\/from Ireland since operations commenced in \n1985 (Ryanair, 2004).   \n \nAccording to forecasts from Tourism Ireland, approximately 7.7 million tourists are \nexpected to visit in 2005 and the tourism minister is expected to invest over €110 million \nin support of tourism of which almost €70 million will be spent in support of marketing \nand promotion. Travellers from Britain, France, Germany and the US accounted for 83% \nof the total number of visitors to Ireland in 2002. \n \n2.2 Air Asia and Malaysia Airlines \n \nThe history of Malaysia’s Air Asia is similar to that of Ryanair, as both carriers have \ntransformed themselves from loss making regional operators to profitable low cost \nairlines. Perhaps this is not surprising, given that Air Asia is managed by Conor \nMcCarthy, an ex-Ryanair director. Besides attracting passengers from buses and ferries, \nboth carriers have experienced a large proportion of first time flyers, largely attracted by \nthe low fares on offer.  \n \nAir Asia currently has a 30% share of the domestic Malaysian market. Since the airline’s \ninception in December 2001, the market has grown from 9 million passengers annually to \n13 million. Bankers are valuing the carrier between $750 million to $1.2 billion (Ionides, \n 5\n2004). Currently, the airline has 14 Boeing 737-300s in its fleet and by the end of 2004 it \nwill have acquired up to 30 aircraft, representing a 114% compound growth in capacity. \nIn mid June 2004, it issued a tender to manufacturers that it was interested in acquiring \nup to 80 new aircraft comprising 40 firm orders and 40 options (ATI, June 2004). \n \nFigures 2a and 2b show passenger enplanements and unit costs for Malaysia Airlines and \nAir Asia between 1998 and 2004. The unit cost differential is very significant and is due \nto Malaysia Airlines excessive labour force, its poor productivity, low aircraft utilisation, \nunprofitable domestic routes and the limitations of intra-Asian bilaterals.    \n  \nFigures 2a & 2b  \n \nWith the world’s lowest unit cost of US$0.023\/ASK and a passenger break-even load \nfactor of 52%, Air Asia is showing all the signs of being a Ryanair clone. It has hedged \n100% of its fuel requirements for the next three years, achieves an aircraft turnaround \ntime of 25 minutes, has a crew productivity level that is triple that of Malaysia Airlines \nand achieves an average aircraft utilisation rate of 13 hours a day. In comparison, \nMalaysia Airlines has hedged only 20% of its fuel requirements, achieves one-hour \nturnaround times and has an aircraft utilisation rate in the domestic market of just over 8 \nhours a day. Air Asia has captured the growth in the domestic market of 4-5% in 2003 \nand consequently left Malaysia Airlines with stagnant traffic.  \n \nEquipped with a strong low cost formula, Air Asia is beginning to move into new intra-\nAsian markets, such as Thailand, by developing a franchise, under the brand name ‘Thai \nAir Asia’. It is taking a 49% shareholding in the franchise, with the remaining shares \nbeing taken up by the Thai Prime Minister’s Thaksin Shinawatra’s Shin Corporation, \nwhich will enable the carrier to operate by acquiring international landing rights in what \nwould otherwise be a tightly regulated environment. The partnership with the Thai \ngovernment is having its benefits, as Sreenivasan (2003) has revealed. The current Thai \ntransport minister Suriya Jungrungreangkit will remove the current minimum airfare \nregulations in order to open up the Thai market. The minimum airfare ruling was \nestablished to prevent the undercutting of fares in the local market, with the probable \nintention of safeguarding Thai airlines. \n \nAir Asia has also pushed forward with its expansion program into Indonesia, where it is \noperating out of three cities: Jakarta, Surabaya and Bandung. It is offering tickets priced \nbetween 40% and 50% lower than the other domestic carriers. This growth outside the \ndomestic Malaysian market follows a similar strategy of Ryanair and easyJet in Europe, \nwhich have expanded by creating hubs in different neighbouring countries. This was \nachieved in the EU as a result of full deregulation of the sector, however. The tightly \nregulated international intra-Asian market is a major obstacle to the full-scale \ndevelopment of low cost carriers in the region. \n \nMalaysia Airlines, the country’s flag carrier, is over 90% owned by the government. It \ncarries over 16 million passengers annually and has extensive code sharing agreements \nwith 24 international airlines. The carrier’s fleet consists of 100 aircraft of which 54% are \nused in the domestic and intra-Asian markets. A further 10 aircraft are on order, including \n 6\n6 A380s. It has an extensive overhaul and maintenance facility that specialises in engine \nand avionics repair. The currency crisis of 1997, followed by three successive years of \npoor revenues and a debt of $2.6 billion forced the Malaysian Government to intervene \nand rescue the airline. It transferred ownership of 73 aircraft, leases on another 17 and \nliabilities of $1.8 billion to the Malaysian Finance Ministry (Penerbangan Malaysia \nBerhad PMB). As a result, Malaysia Airlines today with nearly 22,000 employees \noperates on behalf of PMB. In 2002, the airline achieved a net group profit of $89 \nmillion. Since then, the carrier has posted its best profit since 1985 of $121.4 million. \nHowever, it has achieved an average operating margin of only 0.3% in recent years.   \n \n    \n3.0 Methodology \n \nUsing a similar methodology to that adopted by Mason (2001) and Turner (2003), data \nwas collected in each of the two regions from two large groups of passengers, one flying \nwith a low cost carrier and the other an incumbent. Both groups were travelling to the \nsame city destination, but not necessarily to the same airport. There has been no previous \nresearch on passengers’ perceptions of low cost carriers in Asia.  \n \nThe airlines surveyed were Aer Lingus and Ryanair operating in the mature European \nmarket, and Malaysia Airlines and Air Asia operating in the recently liberalised \nMalaysian domestic market. The passengers were surveyed in the relaxed open landside \narea of the airport. The airports where permission was granted to undertake the surveys \nwere Cork, Kerry1 and Shannon in Ireland, and Kuala Lumpur International in Malaysia. \nLarge teams of personnel were involved in capturing the data, as pilot studies concluded \nthat the second page of the survey was often omitted and it was important that all \nquestions were understood and fully answered. The personnel also assisted with language \nbarriers and in answering any issues raised regarding the open-ended questions, in which \neach respondent could give a personal response in his or her own words. A total of 281 \nresponses were collected at the Irish airports, 52% of which comprised Ryanair \npassengers, and 247 responses at Kuala Lumpur International airport, 48% of which were \nfrom Air Asia passengers. Each survey was conducted over a period of two days.  \n \n \n4.0 Survey Findings \n \nAs expected, the low-cost carriers attracted a high number of younger people, with 24% \nof the Ryanair passengers surveyed and 47% of Air Asia’s being in the under 24 years \nage group.  87% of this age group were travelling for non-business purposes that included \nvisiting friends\/family and trips to\/from places of education. Parents mostly paid for these \ntrips. For the 25-58 age group, which represented 84% of those surveyed, passenger \nchoice changed considerably in favour of the incumbent carriers.  \n \n                                                 \n1 Only Ryanair flights depart from Kerry airport. \n 7\nThe age segregation between the carrier types is very clear, with the older passengers \ntending to prefer the incumbent carriers, possibly because these offer additional airline \nproducts not offered by the low cost carriers.  \n \nGroup travel is particularly significant to airline revenues. Business travellers usually \ntend to travel singularly but leisure travellers often journey in small groups. Low cost \nairlines carry more passengers who travel as part of a group than do the incumbent \nairlines, with almost 45% of Ryanair passengers travelling in pairs and 41% of Air Asia’s \npassengers travelling as part of a group of people comprising 3 or more.    \n \nIt is only in recent years that the incumbent carriers have sold discounted one-way \ntickets. This has been in response to the provision of such fares accessible via the Internet \nby the low cost carriers. Both low cost carriers surveyed had over 70% of their \npassengers purchasing return tickets (72% in the case of Air Asia and 76% in the case of \nRyanair).  Aer Lingus’s passengers also had a significantly high percentage, with 80% \nbooking a return ticket. By contrast, over 18% of Malaysia Airlines’ passengers were \ntravelling on one-way tickets.  \n \nThe mode of surface access and the distance travelled to the departing airport was also \nascertained. The significance of having a frequent high-speed, non-stop train service from \nthe city centre of Kuala Lumpur to the airport was apparent, with one third of the \npassengers surveyed making use of this. In contrast, there is no such service linking any \nIrish airport, and on average 76% of passengers accessed their flights by personal car, \nwhich provides a significant income to the airport authorities in parking fees. \n \nPassengers were also asked how far they had travelled to the airport. In Malaysia, those \nwho were using the national flag carrier travelled an average distance of 50 miles to reach \nthe airport, while Air Asia passengers travelled an average of 77 miles. The distance from \nKuala Lumpur to the international airport is approximately 40 miles. In Europe, the \nsurvey highlighted the fact that Ryanair passengers travelled 44% further than the \nincumbent carrier’s passengers in order to reach the airport. Lawton (2002) and Doganis \n(2001) have both referred to the fact that European passengers flying on a low cost carrier \nare travelling further to reach their departure airport. The positioning of secondary \nairports large distances from the major cities does not seem to pose a significant barrier to \nthe use of low fare carriers.   \n \nFinally, questions were asked about the type of accommodation used. There was a \nnoticeable difference in the type of accommodation used by low cost airline users in \nEurope and those in Asia.  31% of Ryanair’s passengers stayed in hotels, while almost \n49% of Air Asia’s passengers stayed in places such as inns, guesthouses, bed and \nbreakfast establishments, or hostels. The European travel trade has often suggested that \npassengers who travel on a low cost carrier tend to use the savings that were derived from \nthe lower fares in staying at more luxurious accommodation, such as a hotel. The \nincumbent carriers’ passengers tended to opt for hotels, which generally reflects their \nrequirement for additional full service attributes, with an average of 39% of them staying \nin this type of accommodation. \n 8\n  \n4.1 Journey Purpose \n \nTable 5 shows journey purpose and as expected, the two incumbent airlines carried a \nsignificant proportion of business traffic, with meetings being the primary reason for the \ntrip. However, almost 29% of the Ryanair passengers surveyed were also travelling on \nbusiness, which was only 8.5% less than the equivalent figure for Aer Lingus. Of \nsignificance here is the fact that Ryanair is operating to a secondary airport, which adds \ntime and inconvenience for business travellers in getting into central London.  Some 40% \nof the passengers travelling for business purposes with Ryanair were going to events such \nas conferences and training courses. These journeys would generally be considered as \nbeing less urgent business trips. The low p-value means that the difference between the \ncarriers is unlikely to be due to chance. \n \nTable 5 \n \nApproximately 8% of Air Asia passengers, all of whom were male, were travelling for \nbusiness purposes. The low p-values for the Asian carriers cited above reflects the fact \nthat passengers are more likely to travel on Malaysia Airlines for meetings and \nconferences and are more likely to travel on Air Asia for sporting events and that these \ndifferences are statistically significant. In more mature European markets however, this \ntrend is somewhat reversed.  \n \nTable 6 provides details of the sizes of companies that the business passengers surveyed \nwork for. It is perhaps not so surprising that such a high proportion of self-employed \npeople choose the low cost carriers. A cross tabulation of self employed passengers and \nprimary reason for choice of a low cost carrier revealed that 91% of these travellers chose \nthe carrier primarily due to the fare and were not attracted by the extended full service \nproducts offered by the incumbent airlines. Business passengers travelling on incumbent \nairlines tend to come from larger companies that employ over 100 people. These \ncompanies would generally have larger travel budgets and would adopt corporate travel \npolicies. Mason (2001) states that 73% of business passengers he surveyed at Heathrow \nhad a company corporate travel policy, as opposed to 55% of the travellers using a low \ncost carrier at Luton airport. Over one third of Aer Lingus and Malaysia Airlines business \npassengers work for companies that employ over 1000 people, indicating corporate \npreference for the additional airline products that the full service carriers provide.  \n \nTable 6 \n \nThe low cost carriers attracted proportionately more leisure traffic, with. Ryanair and Air \nAsia having respectively 10% and 22% higher proportions of their traffic comprising \nleisure users than their incumbent counterparts. It was also apparent that the biggest \nleisure market segment comes from those passengers who regularly visit friends and \nfamily. \n \n 9\nPaci (1994) showed that the Asian leisure market, and in particular, the VFR segment \nwas steadily growing and that culturally, time spent with family and friends is a very \nimportant leisure activity.  Air Asia’s VFR traffic represents almost a quarter of its total \nmarket, while that of Malaysia Airlines fewer than 17%. This segment represented the \nlargest number of passengers carried on both surveyed airlines. Student travel accounted \nfor the second largest non-business market. Cross-referencing indicated that most of this \ntravel was paid for by parents, although the choice of airline was largely selected by the \nstudents. Most of these students have migrated from travelling on trains and buses to Air \nAsia. Overall, a large proportion of Air Asia’s passengers are first time flyers (Aviation \nStrategy, May 2003). The brand perception of lower fares, large network, high \nadvertising awareness campaigns and 24 hour booking via the Internet is certainly \npushing the Malaysian low cost carrier’s non-business market.  \n  \nThe rivalry for domestic market share in Malaysia is just beginning to surface. Air Asia \nhas taken away the annual domestic passenger market growth of 4-5% from Malaysia \nAirlines as domestic leisure traffic was stagnant in 2003 for the incumbent. This may be \nin part due to the fact that Malaysia Airlines does not advertise its domestic route \nnetwork in the local media, in contrast to Air Asia, which has an aggressive media \npresence, somewhat mirroring that of Ryanair.  \n \nBetween 1993 and 1999, which covered the establishment and growth phase of Ryanair, \nannual VFR traffic from Ireland to the UK grew from around 500,000 to 835,000. The \neffect is even more revealing when considering VFR traffic from the UK to Ireland, \nwhich grew from 950,000 to 1.8 million per year over the same period (Mintel, 2000). \nThis growth was primarily due to the large second and third generation Irish-British \npopulation living in the UK.  VFR traffic constituted the largest segment of non-business \npassengers surveyed, with respectively 20.5% of Aer Lingus and 27.7% of Ryanair \npassengers travelling for this purpose. \n  \nThe second biggest non-business segment consisted of passengers travelling for holiday \nand short break purposes. Both the low cost carriers sampled carry more of this type of \ntraffic than the incumbents. In Europe, low cost scheduled carriers have encroached on \nthe charter market. Williams (2001) argues that package tour charter carriers are \nvulnerable to low cost airlines on sectors of up to 2.5 hours, given that travellers can now \nintegrate their own flights and accommodation into personalised package holidays via \nlow cost carrier websites. However this is not the case in Malaysia, where there is an \nabsence of such charter airlines. \n  \nShort holiday breaks have become very significant representing an important market in \nthe leisure sector. The two low cost carriers attracted slightly more short break travellers \nthan the incumbents, with this sector accounting for an average of 12.5% of their traffic. \nMintel (2002) estimates that UK nationals took 5.6 million short breaks in 2002, which \nrepresents around 15% of all UK holidays abroad. By 2005 this figure is forecast to \nincrease to 7.2 million, accounting for around one fifth of international holidays.  \n \n 10\nThe low cost airlines are extending their brands to capture this short break market. Air \nAsia is marketing inclusive packages on its website under ‘Go Holiday’, offering a wide \nrange of mini-breaks consisting of 2-3 nights.  Ryanair also offers short break packages \nand advertises leisure activities on its website. These packages form an important part of \nadditional ancillary revenue with the low cost airlines integrating package holidays into \ntheir core business model. These short break packages are generally absent from both the \nAer Lingus and Malaysia Airlines websites.   \n \nAttending sports events is the journey purpose for around one tenth of travellers. It was \napparent that over 80% of groups that consisted of 4 or more passengers were travelling \nto sporting fixtures. Sporting activities are usually considered unimportant by tour \noperators and are left to the competencies and\/or skills of local suppliers.  It would appear \ntherefore that there is ample opportunity for low cost airlines to capitalise on this market. \n \n \n4.2 Booking Methods  \n \nTable 7 below shows the distribution channels used by the passengers surveyed. The \ncarriers are significantly associated with method of booking, with Ryanair passengers \nmore likely to use the website (78%) than Aer Lingus passengers (58%). Many Aer \nLingus passengers used a travel agent (16%), whereas this type of booking channel was \nnot available to Ryanair passengers. There was no significant difference in the use of \nother booking methods. The contrast is even more apparent between Malaysia Airlines \nand Air Asia, with the latter’s passengers predominantly using the Internet to book their \ntickets and generally avoiding travel agents, while Malaysia Airlines passengers do the \nopposite. Malaysia Airlines in particular stands out, as there were no passengers that \nbooked online due to the incumbent only introducing its online booking engine in late \nJanuary 2004, when passengers became able to purchase domestic tickets to a select \nnumber of destinations. This would seem to confirm the findings of Gillan and Lall \n(2002), as the majority of tickets purchased were via travel agents or call centres. In \n2001, roughly 10% of the Malaysian population had personal computers, but this had \nincreased to 18% by 2003, this technology enabling the development of low cost travel \n(Thomas, 2003). Low cost airlines are forcing change through the competitive advantage \nof online distribution and it is predicted that 25-30% of all Asian airline ticket sales will \nbe online by 2005 (Ionides, 2001). \n \nTable 7 \n \nThere are only a small number of incumbents that have fully functional e-commerce \nwebsites in Asia, including Singapore Airlines and Cathay Pacific. Low cost airlines are \nformulated so that a large proportion of their sales are conducted via direct channels, such \nas host websites. Air Asia launched its online sales facility via www.airasia.com in its \nfifth month of operation and was the first airline in Asia to introduce Internet booking \nwith online payments and ticket less travel. By May 2003, 45% of its bookings were \nmade through the Internet (Thomas, 2003).  The carrier is extremely innovative, being the \nfirst airline worldwide to offer SMS booking, and is processing 2,000-3,000 messages per \nmonth. Additional channels include 10 sales offices and call centres each equipped with \n 11\nover 180 lines that take 6,000 calls a day. The carrier has also been innovative in \nproviding alternative distribution channels, such as enabling passengers to book tickets at \npost offices. \n \nDirect bookings were made by over 64% of Air Asia’s passengers surveyed. This rises to \n73.7% if the additional channels of office booked and family\/friends are included. The \ncall centre channel accounted for over 13% of bookings. A relatively large number of \ntickets (10%) were purchased on the day of departure, which normally represents the \nmost expensive time to purchase a ticket.  \n \nThere is a very noticeable discrepancy between the booking profiles of Malaysia Airlines \npassengers and those of Air Asia. This reflects the incumbent’s inability to implement \nchange (technology) and keep pace with its innovative rival. Even in countries where use \nof the Internet is not widespread, evidence shows that passengers will seek out all the \navailable booking channels in order to access lower fares. \n \n93% of Ryanair passengers surveyed booked online (this includes the combination of a \nnumber of channels, such as website, office booked and family\/friends). Ryanair is now \nthe fifth most searched website worldwide, which demonstrates the strength of the low \ncost carrier brand.2  By contrast, 16.2% of Aer Lingus passengers used travel agents to \nbook their tickets. Commissions by the carrier to the travel trade in the UK and Ireland \nhave been cut to 1%; however in continental Europe commissions are still between 4% \nand 7%. In November 2001, Aer Lingus sold 1% of its tickets via the Internet, but by late \n2003 its Internet bookings had grown to 50%, with the carrier handling 10-12% of sales \nthrough its call centre. \n  \n58.1% of Aer Lingus passengers surveyed booked online. The airline’s aggressive \nmarketing campaign in promoting a strong brand is having an effect on the way tickets \nare now booked. It recently removed the shamrock logo from a number of its aircraft and \nreplaced it with AerLingus.com, demonstrating its willingness to lose its trademark link \nwith tradition and heritage in favour of an innovative and technological logo in order to \ngain competitive advantage. One of the principle reasons for the carrier’s financial \nreformation and its challenge to Ryanair has been the shift in its distribution channels. \nAer Lingus benchmarked its passenger processing costs against those of Ryanair and \ndeclared that there was a €20 difference per passenger between the two carriers, the \nInternet providing the solution to this cost disadvantage (O’Toole and Pilling, 2003). \n \n4.3 Fares   \n \nLawton (2002) pointed out that the average fares of no frills carriers were some 40-60% \nlower than their full service competitors. Ryanair’s one-way fares averaged 50 Euros in \n2002, with the airline having become renowned for stimulating markets through its low \nfare offerings, which has given rise to the term ‘Ryanair effect’.  \n                                                 \n2 The 2003 Year End Google Zeitgeist survey (based on 55 billion searches over the past year), which \ntracks the most popular sites, ranks Ryanair.com as the fifth most searched for brand across the worldwide \nweb. Ryanair news, December 22, 2002 at www.ryanair.com \n 12\n \nPart of Ryanair’s strategy for market stimulation is the issuing of free tickets. For \nexample, in the first six months of 2003, the carrier issued 100,000 free seats to celebrate \nthe opening of its new base at Bergamo in January 2003; 66,000 free seats in May 2003 \nwhen its competitor easyJet announced half yearly losses of €66 million; 70,000 on June \n12th to celebrate the fact that it had carried 70,000 more passengers in May than its low \nfare competitor; and 27,000 on June 16th for having a better level of punctuality for the \n27th consecutive week than easyJet. More recently, on April 20th 2004, Ryanair celebrated \nits 80 millionth passenger with 800,000 free seats and by August 19th it reached 90 \nmillion and consequently gave away 900,000 seats at 90 pence. In five years’ time the \ncarrier plans to give away 50% of its flights for free. Passengers’ perception is therefore \nto expect low fares from this no frills carrier.  \n \nOnly passengers on flights going only to the London airports from Ireland were surveyed. \nThe average one-way fare paid by Ryanair passengers was €65 and the average return \nfare was €159. Taxes constituted €19.5 for Ireland-UK trips, with an additional €21.70 \nfor the return journey. If these taxes were deducted, then the fares would equate to \napproximately €45 one-way and approximately €117 for return journeys. The Aer Lingus \naverage one-way fare paid by those surveyed was €82 and the average return fare was \n€183. The taxes in this case were higher as the carrier served different airports in the \nLondon area. The average one-way tax was approximately €20, and the tax on the return \njourney was an additional €28.  Again, if these taxes were subtracted then the fares would \nequate to approximately €62 one-way and €135 for return journeys.    \n \nTable 8 shows the fare differences between the two Malaysian carriers surveyed on a \nnumber of routes. Shortly after the government assumed 6.9 billion Ringgits of Malaysia \nAirlines’ debt, the carrier cut fares by 50% on 14,000 seats a week to compete more \neffectively with Air Asia in the domestic market. The information shown in Table 8 takes \naccount of these discounted fares. \n \nTable 8 \n \nThe low unit cost of Air Asia at US$0.023 cents per ASK3 enables the carrier to offer \nsuch low fares. As Malaysia Airlines loses money on its domestic operation, matching \nthe low fares of Air Asia could be harmful to its financial viability, however it needs its \ndomestic network to feed into the Kuala Lumpur hub.  \n \nA further question related to how important the fare was in actually choosing a carrier. \nThe results are shown in Figure 3. As expected, fare constituted the principle reason for \nchoosing a low cost carrier.  Almost 65% of Aer Lingus passengers stated that fare had \nbeen the sole influencing factor in their choice of airline, while only 31.5% of Malaysia \nAirlines passengers did so. It is evident that a significant number of passengers travelling \non incumbent carriers are also influenced by factors other than the fare paid.  \n                                                 \n3 Air Asia has the lowest operating costs in the airline industry. \n 13\n \nFigure 3 \n \nAn attempt was made to assess the cross-price elasticity of demand between incumbents \nand low cost carriers. Figure 4 provides an indication of what proportion of a low cost \ncarrier’s passengers would switch over to an incumbent if the full service provider \nreduced its fares respectively by 10%, 20% and 30%. The results show that if Aer Lingus \nand Malaysia Airlines were to reduce their fares by 10%, then 6.1% on average of \nRyanair’s and Air Asia’s passengers would switch over to them. A further reduction to \n20% would persuade 19.6% of Ryanair’s passengers and 14.4% of Air Asia’s passengers \nto switch over to the respective incumbent carrier. \n \nFigure 4 \n \nA significant aim of the survey was to find the fare levels at which a large number of \npassengers travelling on a low cost carrier would be willing to switch over to an \nincumbent airline. If the incumbent airlines reduced their fares by 30%, then 45.9% of \nRyanair’s passengers and 39.4% of Air Asia’s passengers would be prepared to switch. \nThere are a significant proportion of passengers however who would not transfer to any \nother carrier. The data shows that 40.6% of Air Asia’s passengers and 28% of Ryanair’s \npassengers would remain loyal. This is due to a combination of factors, such as brand \ndevelopment, fares, flight schedule, simplified website, package holidays, etc. \n \nAlthough low cost airlines are relatively new to Asia, they have already developed very \nstrong low fare brands through strong advertising and clever use of the media. The wide \nperception of people in Malaysia, when acknowledging Air Asia, is that it represents low \nfares. Gilbert et al. (2001) argue that branding is becoming increasingly important as a \nmeans of product and service differentiation, and that the low cost airlines are building \nbrand recognition to compete in such a competitive environment.   \n  \nFigure 5 provides an indication of what proportion of an incumbent carrier’s passengers \nwould switch over to low cost airlines if it raised its fares by respectively 10%, 20% and \n30%. This information provides an indication of the amount of fare flexibility that \nincumbent airlines have and identifies the point at which passengers would begin to shift \ntheir custom to low cost carriers. Given incumbents offer the benefit of full service, \nincluding interlining, serving primary airports, business class, frequent flyer mileage, etc., \nsome passengers are clearly willing to pay more for these features.   \n \nFigure 5   \n \nThe survey data shows that fare increases of 10% and 20% would persuade \napproximately 5% and 14.8% respectively of the incumbents’ passengers to switch to low \ncost carriers, with the differences between the two carriers not being significant.4  If the \nincumbents however, raised their fares by 30%, then 42.8% of Aer Lingus’s passengers \nand 48.7% of Malaysia Airlines passengers would switch. An interesting observation \n                                                 \n4 Statistical test of means, 10% significance level. \n 14\nderived is that an average of 34.3% of the incumbents’ passengers would remain loyal, \npossibly due to the wide range of products\/facilities offered.5  \n  \nIt is clear that low cost carriers offer a strong substitute to the full service airline product. \nNot surprisingly, this has important implications for marketing and advertising – \nbranding, customer loyalty and satisfaction should be carefully considered by every \nairline.  Interestingly, the results of the survey show that cross-price elasticity is not \nconstant – in Figure 4, for example, a small fare reduction (10%) by the incumbent \ntriggers a less than proportional switch, while a high one (30%) leads to a dramatic \nchange. This defies the usual assumption made in various econometric models of \nconstant cross-price elasticity and shows the importance of absolute fare levels in \ndetermining customer choice. \n \nFinally, to complete the discussion, income effects should be considered. Although the \nsurvey has not been designed to quantify explicitly any income effect, it is evident that \nconsumer income does play an important role, as less wealthy consumers are more price-\nconscious and hence more susceptible to a switch between airlines as a result of changes \nin fares.  Having said this, dynamic effects are highly important; air travel does not have \nthe glamour of the past any more and the low cost carriers have managed to develop \nbrands of their own. Therefore, when airport location and total travelling time are similar, \nlow cost carriers may also become the preferred choice of more wealthy customers. \n \n \n \n4.4 Airline Connections   \n \nFigure 6 shows the percentage of connecting traffic for both groups of carriers. A big \nfeature of a full service carrier is the ability to interline traffic at its hub airport. As \nexpected, there is a strong interline requirement for both flag carriers that operate hub and \nspoke networks. 41.2% of Aer Lingus passengers surveyed were interlining, as compared \nto 36.7% of those of Malaysia Airlines. This reflects an incumbent’s ability to leverage \n‘network benefits’ and thus attract a high proportion of passengers who wish to connect \nseamlessly.  \n \nFigure 6 \n \nLow cost airlines operate mostly on a point-to-point basis only. These carriers emphasise \nthat they will not be responsible if passengers fail to make their connections, even if the \nonward journey is with the same carrier. The risk of failing to make a connection \ninvolves the traveller purchasing another ticket. Data from the surveys indicate that \npassengers are willing to accept that risk. 17.2% of Ryanair’s passengers questioned were \ntransferring to other carriers at London Stansted. Ryanair’s creation of traffic bases \nacross Europe has provided the opportunity for passengers to interline using a point-to-\npoint network. Air Asia’s transfer traffic was only 5.8%, which is not surprising as it was \nonly formed in December 2001. \n                                                 \n5 Statistical test of means, 5% significance level. \n 15\n \nFigure 7 identifies the principle airlines to which the interlining passengers surveyed \nwere transferring. It is apparent that the incumbent carriers have a significant proportion \nof their traffic transferring to alliance or code-sharing partners. Aer Lingus had 55.3% of \nits connecting passengers questioned transferring to the Oneworld alliance, of which the \nmajority were transferring to British Airways.  By contrast, 72% of Ryanair’s passengers \nsurveyed who were making connections continued their journeys from Stansted on other \nRyanair flights, while around 20% connected with easyJet services. Ryanair operates \nclose to 30% of the daily departures at London Stansted and 12.5% at Dublin, thus \nproviding numerous permutations of connections and ample opportunity for passengers to \ntransfer to other destinations. \n \nFigure 7 \n \nMalaysia Airlines is not part of an alliance, but 68.5% of its connecting passengers \nsurveyed were transferring to other code-share flights. Only 6.6% of Malaysia Airlines \npassengers questioned connected with Air Asia at Kuala Lumpur. Very few of Air Asia \npassengers surveyed were transferring: four were connecting to a Malaysia Airlines long \nhaul service, while the remaining three were transferring to Air Asia flights. As the \nmarket begins to mature and Air Asia develops additional hubs, there will be a greater \nopportunity for passengers to transfer to other flights. The perception is evident in the \nAsian market that passengers can use a combination of carrier types to reach their \ndestinations, and that interlining via a low cost carrier network is certainly a workable \noption. \n \n4.5 Principal Reasons for Carrier Selection \n \n43.8% of the two incumbents’ passengers questioned stated that they had looked at other \ncarriers’ offerings prior to booking their flights.6 By contrast, 65.2% of the low cost \ncarriers’ passengers surveyed stated that they had not considered other carriers’ services \nprior to booking their flights.7    \n \nAn important element of this research was to establish the principle reason why each \npassenger had selected a particular airline. A study undertaken by Proussaloglou and \nKoppleman (1995) on the demand for air carrier services concluded that carrier selection \nwas based on a combination of factors that included the airline's market presence, \nschedule convenience, low fares, on time performance, reliability and the availability of \nfrequent flier programs. Figure 8 provides confirmation of their results, with the evidence \nfrom this survey that passengers choose a full service carrier for a variety of reasons, \nincluding: service reliability, service quality, flight schedules, fares, connections, frequent \nflyer programs, comfort, safety and company policy. Passengers questioned chose an \nincumbent carrier in order to benefit from the wide range of services available and the \nhigh reliability associated with this type of airline. Service reliability was one of the top \nreasons for choosing an incumbent airline. 20.5% of Aer Lingus passengers and 18.7% of \n                                                 \n6 Statistical test of means, 5% significance level. \n7 Statistical test of means, 10% significance level. \n 16\nMalaysia Airlines passengers questioned selected this as their principle reason for carrier \nchoice. \n \nFigure 8  \n \nFigure 9 below shows that the low cost airlines’ passengers questioned had a very \ndifferent principle reason for carrier selection. The majority replied that fare was by far \nthe most important factor in choosing to fly on a low cost airline, with flight schedules \ncoming a distant second. Turner (2003) also showed that passengers travelling on a low \ncost carrier selected fare as their principle reason for carrier choice, while passengers \ntravelling on an incumbent carrier indicated flight timings. Ryanair has given away 20% \nof its flights for free in 2003, leading passengers to expect very cheap tickets from the \ncarrier. 5.2% of Air Asia’s passengers identified the ability to book via the Internet as \ntheir most important reason for choice of carrier, with a further 4.3% citing the holiday \npackage offered by the airline on their website.  \n \nFigure 9  \n \nThe evidence presented in Figures 8 and 9 clearly confirms the principle differences in \npassengers’ perceptions between incumbent and low cost airlines. Passengers are \nselecting low cost carriers primarily because of their low fares, while passengers \nselecting full service airlines opt for them in part because of the additional product \nservices they provide.   \n \n \n \n5.0 Concluding comments \n \nLow cost carriers have reshaped the traditional airline business model and have \nsignificantly changed the competitive dynamics of the industry. Their highly successful \nmodel strictly adheres to the containment of operating costs.  Network carriers have gone \nvirtually unchanged throughout the decades relying on hub and spoke systems, serving \nhigh to low yield customers and leveraging loyalty programmes, but they are burdened by \nhigh costs, complexities and inefficiencies. The incumbents are no longer the leaders of \nthe airline industry in short haul markets.   \n \nTwo contrasting markets have been examined in this paper; the first, a mature Europe, \nwhere liberal skies have allowed low cost carriers to establish traffic hubs across \ninternational boundaries, and the second, an Asian economy, where strict bilaterals act to \nconstrain such network developments. \n  \nThe survey has revealed that while there are differences between passengers travelling on \na low cost carrier and those on a full service airline, there appears to be no difference in \nthe attitude and perception of passengers from two very different continents. It would \nseem that the success of Air Asia in Malaysia, which was based on the Ryanair model \n 17\nand which in turn was modelled on Southwest in the US, can be successfully replicated in \nany part of the world as passengers’ opinions and expectations appear consistent.  \n \nThere is a strong bias towards young people taking low cost carriers and it will be \ninteresting to observe if these travellers migrate towards incumbents when they have \nmore disposable income in the future. It is clear that passengers travelling on low cost \ncarriers place great importance on price and appear to arrange their itineraries using the \nleast expensive airfares. 65% of those passengers travelling on a low cost carrier \nsurveyed did not look at any other carrier when booking their travel. It would appear \ntherefore that the brand reputation of low fare airlines has become embedded into the \nminds of consumers.  \n \nIn contrast, passengers using full service airlines are concerned about price but will \ntolerate a higher fare in order to gain an advantage through the additional airline products \noffered by full service carriers. Historically, incumbents have been incapable of matching \nthe fares of no-frills airlines because they were burdened with inefficient operating \npractices.  Low cost carriers are now dominating the leisure markets and are encroaching \non business segments. There is significant business traffic for Ryanair especially from the \nself-employed and employees of small-medium sized enterprises, however large \ncorporations still favour the incumbents, strongly indicating that corporate deals appear to \nwork.  \n \nTravellers are willing to connect through secondary airports and to accept no frills in \nexchange for low fares. Incumbents are retaining their complex and wide range of airline \nproducts as a counteractive strategy for higher fares. However, this research clearly \nindicates that this works only for a specific number of travellers. The way forward for \nincumbents is to reinvent themselves by adopting those elements of the low cost model \nthat are pertinent to their requirements. The data ascertained from the survey provides \nevidence that if incumbents could reduce their fares by 30%, it would stimulate a \nsignificant number of passengers (over 40%) to switch from low cost carriers. It is clear \nthat cross-price elasticities are far from constant, with small percentage changes in fare \nproducing little effect while price changes above 20% result in large shifts in demand.  \n \nIt is apparent that passengers travelling on incumbents place strong emphasis on \nreliability, quality, flight schedules, connections, frequent flyer programmes and comfort, \nwhile travellers taking low cost carriers focus almost exclusively on fare. The surveys \noverall indicate that the ideal for passengers however, would be to have a combination of \nlow fares (at no-frills airline levels) and some of the full service products offered by the \nincumbent airlines. It would seem therefore that passengers would like to see the two \nairline models become ever closer! \n \n \n \n \n 18\n \nReferences \n \nAir Transport Intelligence (ATI), 2004. Air Asia to issue RPF for up to 80 new aircraft, Air Transport \nIntelligence news, 11th  June. \n \nAir Transport Intelligence (ATI), 2003. Ryanair plans to lease ‘significant minority’ of fleet, Air Transport \nIntelligence news, 3rd November.  \n \nAviation Strategy, 2003. Asia’s emerging low cost carriers, Aviation Strategy, May, 2-5. \n \nAviation Strategy, 2003. Continental barriers to LCC expansion, Aviation Strategy, January, 2. \n \nBarrett, S., 1999. Peripheral market entry, product differentiation, supplier rents and sustainability in the \nderegulated European aviation market – a case study, Journal of Air Transport Management 5(1), 21-30. \n \nDoganis, R., 2001. The Airline Business in the 21st Century, Routledge, London. \n \nGilbert, D., Child, D., & Bennett, M., 2001. A qualitative study of the current practices of ‘no-frills’ \nairlines operating in the UK, Journal of Vacation Marketing 7, No. 4, 302-315.    \n \nGillan, D. & Lall, A., 2002. The economics of the Internet, the new economy and opportunities for airports, \nJournal of Air Transport Management 8, 49-62. \n \nIonides, N., 2004. Man of the Moment, Airline Business, April, 27-29.  \n \nIonides, N., 2001. Asian e-volution, Airline Business, March, 74-75. \n \nLawton, T., 2002. Cleared for Take-Off – Structure and Strategy in the Low Fare Airline Business, \nAshgate. \n \nMason, K., 2001. Marketing low-cost airline services to business travelers, Journal of Air Transport \nManagement 7(2), 103-109. \n  \nMintel, 2000. Visiting Friends and relatives - UK, December. \n \nMintel, 2002. Short breaks abroad, June. \n \nO’Connell, J. F., Ionides, N., 2004. Room for all?, Airline Business, April, 30-32. \n \nO’Toole, K. & Pilling, M., 2003. Marketing Mix, Airline Business, December, 70-73. \n \nPaci, E., 1994. Market segments: The major international VFR markets’ EIU travel and tourism analyst 6, \n36-50. \n \nProussaloglou, K., Koppleman, F., 1995. Air carrier demand: analysis of market share determinants, \nTransportation 22, 371-388. \n \nRyanair, 2004.  www.ryanair.com \n \nRyanair, 2002. Annual Report and Financial Statement \n \nSreenivasan, V., 2003. ‘Low-Fare dogfight looms, The Business Times, Singapore, December 11. \n \nStill, S., 2002. Fortress Defense, Airline Business, September. \n \nTaneja, N. K., 2003. Airline Survival Kit, Ashgate, Aldershot, 37. \n \nThomas, G., 2003. In tune with low fares in Malaysia, Air Transport World, May, 45-46. \n       \nTurner, S., 2003. Comparison of passenger profiles and selection criteria: a study of London – Amsterdam \npassengers, ATRS Conference, Toulouse. \n \nWilliams, G., 2001. Will Europe’s charter carriers be replaced by “no-frills” scheduled Airlines?, Journal of \nAir Transport Management 7(5), 277-286. \n \n \n"}