{"doi":"10.1371\/journal.pone.0009609","coreId":"67964","oai":"oai:eprints.lancs.ac.uk:34303","identifiers":["oai:eprints.lancs.ac.uk:34303","10.1371\/journal.pone.0009609"],"title":"Measuring the conservation value of tropical primary forests:the effect of occasional species on estimates of biodiversity uniqueness","authors":["Barlow, Jos","Gardner, Toby","Louzada, Julio","Peres, Carlos A."],"enrichments":{"references":[{"id":840364,"title":"A new statistical approach for assessing similarity of species composition with incidence and abundance data.","authors":[],"date":"2005","doi":null,"raw":"Chao A, Chazdon RL, Colwell RK, Shen TJ (2005) A new statistical approach for assessing similarity of species composition with incidence and abundance data. Ecology Letters 8: 148–159.","cites":null},{"id":840067,"title":"Abundance-based similarity indices and their estimation when there are unseen species in samples.","authors":[],"date":"2006","doi":null,"raw":"Chao A, Chazdon RL, Colwell RK, Shen TJ (2006) Abundance-based similarity indices and their estimation when there are unseen species in samples. Biometrics 62: 361–371.","cites":null},{"id":839319,"title":"Agriculture and biodiversity conservation: opportunity knocks.","authors":[],"date":"2008","doi":null,"raw":"Norris K (2008) Agriculture and biodiversity conservation: opportunity knocks. Conservation Letters 1: 2–11.","cites":null},{"id":838158,"title":"Benthic invertebrate assemblages and species diversity patterns of the upper Paraguay River.","authors":[],"date":"2005","doi":"10.1002\/rra.814","raw":"Marchese MR, Wantzen KM, De Drago IE (2005) Benthic invertebrate assemblages and species diversity patterns of the upper Paraguay River. River Research and Applications 21: 485–499.","cites":null},{"id":836567,"title":"Change in Marine Communities: An Approach to Statistical Analysis and Interpretation: Primer-E Ltd,","authors":[],"date":"1994","doi":null,"raw":"Clarke KR, Warwick RM (1994) Change in Marine Communities: An Approach to Statistical Analysis and Interpretation: Primer-E Ltd, Plymouth. .","cites":null},{"id":836295,"title":"Density as a misleading indicator of habitat quality.","authors":[],"date":"1983","doi":"10.2307\/3808148","raw":null,"cites":null},{"id":841188,"title":"Emergent properties of land mosaics: implications for land management and biodiversity conservation.","authors":[],"date":"2007","doi":"10.1016\/j.biocon.2006.06.008","raw":"Bennett A, Radford JQ (2007) Emergent properties of land mosaics: implications for land management and biodiversity conservation. In: Lindenmayer BD, Hobbs RJ, eds. Managing and designing landscapes for conservation. Oxford: Blackwell. pp 201–214.","cites":null},{"id":841969,"title":"Estimating Terrestrial Biodiversity through Extrapolation.","authors":[],"date":"1994","doi":"10.1098\/rstb.1994.0091","raw":"Colwell RK, Coddington JA (1994) Estimating Terrestrial Biodiversity through Extrapolation. Philosophical Transactions of the Royal Society of London Series B-Biological Sciences 345: 101–118.","cites":null},{"id":837328,"title":"Explaining the excess of rare species in natural species abundance distributions.","authors":[],"date":"2003","doi":"10.1038\/nature01547","raw":"Magurran AE, Henderson PA (2003) Explaining the excess of rare species in natural species abundance distributions. Nature 422: 714–716.","cites":null},{"id":835136,"title":"Ferns, frogs, lizards, birds and bats in forest fragments and shade cacao plantations in two contrasting landscapes in the Atlantic forest,","authors":[],"date":"2007","doi":null,"raw":"Faria D, Paciencia MLB, Dixo M, Laps RR, Baumgarten J (2007) Ferns, frogs, lizards, birds and bats in forest fragments and shade cacao plantations in two contrasting landscapes in the Atlantic forest, Brazil. Biodiversity and Conservation 16: 2335–2357.","cites":null},{"id":840941,"title":"Frequent and occasional species and the shape of relative-abundance distributions.","authors":[],"date":"2004","doi":null,"raw":"Ulrich W, Ollik M (2004) Frequent and occasional species and the shape of relative-abundance distributions. Diversity and Distributions 10: 263–269.","cites":null},{"id":838927,"title":"Have we overstated the tropical biodiversity crisis?","authors":[],"date":"2007","doi":null,"raw":"Laurance WF (2007) Have we overstated the tropical biodiversity crisis? Trends in Ecology & Evolution 22: 65–70.","cites":null},{"id":838392,"title":"Initial effects of the toxic waste spill (Aznalcollar mine accident) on the aquatic macrofauna of the Guadalquivir Estuary.","authors":[],"date":"1999","doi":"10.1016\/S0048-9697(99)00395-2","raw":"Drake P, Baldo F, Cuesta JA, Garcia-Gonzalez D, Silva-Garcia A, et al. (1999) Initial effects of the toxic waste spill (Aznalcollar mine accident) on the aquatic macrofauna of the Guadalquivir Estuary. Science of the Total Environment 242: 271–280.","cites":null},{"id":834454,"title":"Invited views in basic and applied ecology - Tropical biodiversity loss and people - A brief review.","authors":[],"date":"2008","doi":null,"raw":"Sodhi NS (2008) Invited views in basic and applied ecology - Tropical biodiversity loss and people - A brief review. Basic and Applied Ecology 9: 93–99.","cites":null},{"id":842789,"title":"Is wildlife research useful for wildlife conservation in the tropics? A review for Borneo with global implications.","authors":[],"date":"2007","doi":"10.1007\/s10531-007-9161-y","raw":"Meijaard E, Sheil D (2007) Is wildlife research useful for wildlife conservation in the tropics? A review for Borneo with global implications. Biodiversity and Conservation 16: 3053–3065. Conservation Value of Forests PLoS ONE | www.plosone.org 8 March 2010 | Volume 5 | Issue 3 | e9609","cites":null},{"id":839572,"title":"Moilanen A","authors":[],"date":"2005","doi":null,"raw":"Arponen A, Heikkinen RK, Thomas CD, Moilanen A (2005) The value of biodiversity in reserve selection: Representation, species weighting, and benefit functions. Conservation Biology 19: 2009–2014.","cites":null},{"id":842546,"title":"Patterns of rarity in the birds of the Atlantic forest of Brazil.","authors":[],"date":"1997","doi":"10.1046\/j.1523-1739.1997.95314.x","raw":"Goerck JM (1997) Patterns of rarity in the birds of the Atlantic forest of Brazil. Conservation Biology 11: 112–118.","cites":null},{"id":837079,"title":"Patterns of rarity in the native British flora.","authors":[],"date":"2004","doi":"10.1016\/j.biocon.2004.02.008","raw":"Pilgrim ES, Crawley MJ, Dolphin K (2004) Patterns of rarity in the native British flora. Biological Conservation 120: 161–170.","cites":null},{"id":833939,"title":"Predicting the Uncertain Future of Tropical Forest Species in a Data Vacuum.","authors":[],"date":"2007","doi":null,"raw":"Gardner TA, Barlow J, Parry LTW, Peres CA (2007) Predicting the Uncertain Future of Tropical Forest Species in a Data Vacuum. Biotropica 39: 25–30.","cites":null},{"id":833831,"title":"Principles of landscape design that emerge from a formal problem solving approach.","authors":[],"date":"2007","doi":null,"raw":"Possingham HP, Nicholson E (2007) Principles of landscape design that emerge from a formal problem solving approach. In: Lindenmayer BD, Hobbs NT, eds. Managing and Designing Landscapes for Conservation. London: Blackwell Publishing.","cites":null},{"id":834579,"title":"Quantifying the biodiversity value of tropical primary, secondary and plantation forests.","authors":[],"date":"2007","doi":null,"raw":"Barlow J, Gardner TA, Araujo IS, Bonaldo AB, Costa JE, et al. (2007) Quantifying the biodiversity value of tropical primary, secondary and plantation forests. Proceedings of the National Academy of Science 104: 18555–18560.","cites":null},{"id":837608,"title":"Reef classification by coral morphology predicts coral reef conservation value.","authors":[],"date":"2000","doi":"10.1016\/S0006-3207(99)00067-1","raw":"Edinger EN, Risk MJ (2000) Reef classification by coral morphology predicts coral reef conservation value. Biological Conservation 92: 1–13.","cites":null},{"id":836816,"title":"Seven forms of rarity.","authors":[],"date":"1981","doi":null,"raw":"Rabinowitz D (1981) Seven forms of rarity. In: Synge H, ed. The Biological Aspects of Rare Plant Conservation Wiley. pp 205–217.","cites":null},{"id":840616,"title":"Sources and sinks in population biology.","authors":[],"date":"1996","doi":null,"raw":"Dias PC (1996) Sources and sinks in population biology. Trends in Ecology & Evolution 11: 326–330.","cites":null},{"id":837895,"title":"Spatial and temporal patterns in summer ichthyoplankton assemblages on the eastern Bering Sea shelf 1996–2000.","authors":[],"date":"2006","doi":"10.1111\/j.1365-2419.2005.00348.x","raw":"Duffy-Anderson JT, Busby MS, Mier KL, Deliyanides CM, Stabeno PJ (2006) Spatial and temporal patterns in summer ichthyoplankton assemblages on the eastern Bering Sea shelf 1996–2000. Fisheries Oceanography 15: 80–94.","cites":null},{"id":835374,"title":"The challenge of maintaining Atlantic forest biodiversity: A multi-taxa conservation assessment of specialist and generalist species in an agro-forestry mosaic in southern Bahia.","authors":[],"date":"2009","doi":null,"raw":"Pardini R, Faria D, Accacio GM, Laps RR, Mariano-Neto E, et al. (2009) The challenge of maintaining Atlantic forest biodiversity: A multi-taxa conservation assessment of specialist and generalist species in an agro-forestry mosaic in southern Bahia. Biological Conservation 142: 1178–1190.","cites":null},{"id":839054,"title":"The cost-effectiveness of biodiversity surveys in tropical forests.","authors":[],"date":"2008","doi":null,"raw":"Gardner TA, Barlow J, Araujo IS, Avila-Pires TCS, Bonaldo AB, et al. (2008) The cost-effectiveness of biodiversity surveys in tropical forests. Ecology Letters","cites":null},{"id":838682,"title":"The uncertain future of tropical forest species.","authors":[],"date":"2006","doi":null,"raw":"Wright SJ, Muller-Landau HC (2006) The uncertain future of tropical forest species. Biotropica 38: 443–445.","cites":null},{"id":835714,"title":"The value of primary, secondary and plantation forests for fruit-feeding butterflies in the Brazilian Amazon.","authors":[],"date":"2007","doi":null,"raw":"Barlow J, Overal WL, Araujo IS, Gardner TA, Peres CA (2007) The value of primary, secondary and plantation forests for fruit-feeding butterflies in the Brazilian Amazon. Journal of Applied Ecology 44: 1001–1012.","cites":null},{"id":836011,"title":"Understanding the consequences of habitat change for tropical forest biodiversity. Norwich: University of East Anglia.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":16651521,"title":"Understanding the consequences of habitat change for tropical forest biodiversity. Norwich: University of East Anglia. Conservation Value of Forests PLoS","authors":[],"date":"2008","doi":null,"raw":"Gardner TA (2008) Understanding the consequences of habitat change for tropical forest biodiversity. Norwich: University of East Anglia. Conservation Value of Forests PLoS ONE | www.plosone.org 7 March 2010 | Volume 5 | Issue 3 | e960913. Vanhorne B (1983) Density as a misleading indicator of habitat quality. Journal of Wildlife Management 47: 893–901.","cites":null},{"id":839806,"title":"Using generalized dissimilarity modelling to analyse and predict patterns of beta diversity in regional biodiversity assessment; Nov 02–04;","authors":[],"date":null,"doi":null,"raw":"Ferrier S, Manion G, Elith J, Richardson K Using generalized dissimilarity modelling to analyse and predict patterns of beta diversity in regional biodiversity assessment; Nov 02–04; Baeza, SPAIN. pp 252–264.","cites":null},{"id":842212,"title":"Using subsets of species in biodiversity surveys.","authors":[],"date":"2008","doi":"10.1111\/j.1365-2664.2007.01413.x","raw":"Vellend M, Lilley PL, Starzomski BM (2008) Using subsets of species in biodiversity surveys. Journal of Applied Ecology 45: 161–169.","cites":null},{"id":834857,"title":"Where are the wild things? Assessing the potential for species conservation in tropical secondary forests. Conservation Biology.","authors":[],"date":"2009","doi":null,"raw":"Chazdon RL, Peres CA (2009) Where are the wild things? Assessing the potential for species conservation in tropical secondary forests. Conservation Biology.","cites":null},{"id":841696,"title":"Where to put things? Spatial land management to sustain biodiversity and economic returns.","authors":[],"date":"2008","doi":"10.1016\/j.biocon.2008.03.022","raw":"Polasky S, Nelson E, Camm J, Csuti B, Fackler P, et al. (2008) Where to put things? Spatial land management to sustain biodiversity and economic returns. Biological Conservation 141: 1505–1524.","cites":null},{"id":834175,"title":"Why we need megareserves in Amazonia.","authors":[],"date":"2005","doi":null,"raw":"Peres CA (2005) Why we need megareserves in Amazonia. Conservation Biology 19: 728–733.","cites":null},{"id":835455,"title":"Wright SJ (in press) The future of tropical species in secondary forests: A quantitative review. Biological Conservation.","authors":[],"date":null,"doi":null,"raw":"Dent DH, Wright SJ (in press) The future of tropical species in secondary forests: A quantitative review. Biological Conservation.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-09","abstract":"Background Developing effective conservation plans for multi-functional landscapes requires an accurate knowledge of the relative conservation value of different land-uses. A growing number of tropical ecologists have evaluated conservation value using the number (or proportion) of species that are unique to primary or old-growth forests. However, estimates of the conservation value of modified land-uses may be inflated by the presence of occasional species (e.g. singletons and doubletons) that may be unable to exist as viable populations in isolation. Methodology\/Principal Findings We use a unique 15-taxa dataset from a mixed-use forest landscape in the Brazilian Amazon to test the hypothesis that the removal of occasional species from sample data can increase estimates of the value of primary forest for biodiversity conservation. Conclusions\/Significance Estimates of conservation value that are based on the proportion of species that are unique to tropical primary or old-growth forests are highly sensitive to decisions researchers make regarding the inclusion or exclusion of occasional species. By removing singletons from modified forest samples, and considering only those species known to occur in primary forest, we almost double estimates of the conservation value of tropical primary forests","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67964.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34303\/1\/journal.pone.0009609.pdf","pdfHashValue":"3fbfab633b59c55c1bd867f876ff2ae587beca45","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34303<\/identifier><datestamp>\n      2018-01-24T03:03:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Measuring the conservation value of tropical primary forests:the effect of occasional species on estimates of biodiversity uniqueness<\/dc:title><dc:creator>\n        Barlow, Jos<\/dc:creator><dc:creator>\n        Gardner, Toby<\/dc:creator><dc:creator>\n        Louzada, Julio<\/dc:creator><dc:creator>\n        Peres, Carlos A.<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Background Developing effective conservation plans for multi-functional landscapes requires an accurate knowledge of the relative conservation value of different land-uses. A growing number of tropical ecologists have evaluated conservation value using the number (or proportion) of species that are unique to primary or old-growth forests. However, estimates of the conservation value of modified land-uses may be inflated by the presence of occasional species (e.g. singletons and doubletons) that may be unable to exist as viable populations in isolation. Methodology\/Principal Findings We use a unique 15-taxa dataset from a mixed-use forest landscape in the Brazilian Amazon to test the hypothesis that the removal of occasional species from sample data can increase estimates of the value of primary forest for biodiversity conservation. Conclusions\/Significance Estimates of conservation value that are based on the proportion of species that are unique to tropical primary or old-growth forests are highly sensitive to decisions researchers make regarding the inclusion or exclusion of occasional species. By removing singletons from modified forest samples, and considering only those species known to occur in primary forest, we almost double estimates of the conservation value of tropical primary forests.<\/dc:description><dc:date>\n        2010-03-09<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34303\/1\/journal.pone.0009609.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1371\/journal.pone.0009609<\/dc:relation><dc:identifier>\n        Barlow, Jos and Gardner, Toby and Louzada, Julio and Peres, Carlos A. (2010) Measuring the conservation value of tropical primary forests:the effect of occasional species on estimates of biodiversity uniqueness. PLoS ONE, 5 (3). ISSN 1932-6203<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34303\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1371\/journal.pone.0009609","http:\/\/eprints.lancs.ac.uk\/34303\/"],"year":2010,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"Measuring the Conservation Value of Tropical Primary\nForests: The Effect of Occasional Species on Estimates of\nBiodiversity Uniqueness\nJos Barlow1*, Toby A. Gardner2,3, Julio Louzada2, Carlos A. Peres4\n1 Lancaster Environment Centre, Lancaster University, Lancaster, United Kingdom, 2Departamento de Biologia, Universidade Federal de Lavras, Lavras, Minas Gerais,\nBrazil, 3Department of Zoology, University of Cambridge, Cambridge, United Kingdom, 4 School of Environmental Science, University of East Anglia, Norwich, United\nKingdom\nAbstract\nBackground: Developing effective conservation plans for multi-functional landscapes requires an accurate knowledge of\nthe relative conservation value of different land-uses. A growing number of tropical ecologists have evaluated conservation\nvalue using the number (or proportion) of species that are unique to primary or old-growth forests. However, estimates of\nthe conservation value of modified land-uses may be inflated by the presence of occasional species (e.g. singletons and\ndoubletons) that may be unable to exist as viable populations in isolation.\nMethodology\/Principal Findings: We use a unique 15-taxa dataset from a mixed-use forest landscape in the Brazilian\nAmazon to test the hypothesis that the removal of occasional species from sample data can increase estimates of the value\nof primary forest for biodiversity conservation.\nConclusions\/Significance: Estimates of conservation value that are based on the proportion of species that are unique to\ntropical primary or old-growth forests are highly sensitive to decisions researchers make regarding the inclusion or exclusion\nof occasional species. By removing singletons from modified forest samples, and considering only those species known to\noccur in primary forest, we almost double estimates of the conservation value of tropical primary forests.\nCitation: Barlow J, Gardner TA, Louzada J, Peres CA (2010) Measuring the Conservation Value of Tropical Primary Forests: The Effect of Occasional Species on\nEstimates of Biodiversity Uniqueness. PLoS ONE 5(3): e9609. doi:10.1371\/journal.pone.0009609\nEditor: Jerome Chave, Centre National de la Recherche Scientifique, France\nReceived September 17, 2009; Accepted February 19, 2010; Published March 9, 2010\nCopyright: \u0002 2010 Barlow et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This study was financed by a UK Darwin Initiative grant 162\/12\/014, with additional support from the Center for Applied Biodiversity Science of\nConservation International, the Natural Environment Research Council (NERC), the National Geographic Society, the Conservation Food and Health Foundation,\nFAPEMIG CRA - 000343\/07, and the Instituto Nacional de Cieˆncia e Tecnologia - Biodiversidade e Uso da Terra na Amazoˆnia (CNPq 574008\/2008-0). TAG also\nthanks the Natural Environmental Research Council (NE\/F01614X\/1). The funders had no role in study design, data collection and analysis, decision to publish, or\npreparation of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\n* E-mail: josbarlow@gmail.com\nIntroduction\nMaking informed decisions on the design of multi-functional\nlandscapes for biodiversity conservation requires an accurate\nknowledge of the relative conservation value of the different land-\nuses [1]. The ability to accurately determine the relative\nconservation values of undisturbed primary and human-modified\nenvironments is of particular importance. However, quantifying\nthese values can be extremely difficult in complex species-rich\necosystems. This problem is particularly acute in the humid tropics\nwhere most species are locally rare, many remain undescribed,\nand there is a lack of ecological or biological information available\nfor those species that are known to science [2,3,4].\nGiven the critical lack of detailed information on species\nranges, preferred habitats and functional roles, comparisons of\nthe biodiversity value of different land-uses invariably depend\nupon relatively simple metrics. In recent years, a growing\nnumber of tropical ecologists have evaluated conservation value\nusing the number (or proportion) of species that are unique to\nprimary or old-growth forests when compared to other land-uses\nwithin the wider landscape [5,6,7,8]. Despite its simplicity, this\nmethod has many advantages as it facilitates comparisons\nbetween studies [6,9], and is intuitive and easier for non-\nscientists to understand than many alternative measures of\nconservation value like similarity indices (see Materials and\nMethods).\nHowever, it is possible that this metric is highly sensitive to\noccasional species in samples. There are good reasons why species\nmay be naturally rare [10], but in many cases this rarity may be a\nsampling artifact. For example, some of the individuals recorded in\nbiodiversity samples could represent transient or sink populations\nand spill-over effects could mean that occasional species are\nrecorded in modified land-uses even though they are unable to\nsustain viable populations in the long-term when isolated from\nsource populations in primary habitat. This could lead scientists to\nunderestimate the conservation value of primary forests compared\nto alternative land-uses [5,11,12]. These occasional or rare species\nare thought to dominate species sample data from systems around\nthe world [10], and their presence in samples could distort indices\nof uniqueness.\nPLoS ONE | www.plosone.org 1 March 2010 | Volume 5 | Issue 3 | e9609\nIn an ideal world, we would have direct assessments of the\nviability of all species in biodiversity samples, and could use this to\ninform our estimates of conservation value of different land-uses.\nHowever, we are highly unlikely to ever fulfill this for the vast\nmajority of tropical forest species, and are thereby forced to use\nspecies sample-abundances as a proximate estimate of its viability\nin a given environment (while acknowledging the abundance does\nnot always provide a good proxy of habitat quality; [13]). This\npresents a dilemma regarding occasional species, as all else being\nequal we have much greater confidence about the viability of\nspecies that are abundant that species that are rare in samples.\nOne common approach used to address this problem is to simply\nremove occasional species from analyses [14], so inferences are\nlimited to those species that we have most confidence in. This is\nequivalent to discarding species that were only recorded using a\nparticular sampling technique that is known to be unreliable.\nHowever, in this case there is a risk of losing valuable information\nregarding patterns of conservation value. Furthermore, determin-\ning which of these occasional species are genuinely rare (i.e. having\neither a small geographic range, narrow habitat breadth or a low\nlocal density; [15] is difficult and highly context-dependent [16]\nand requires detailed biological information that remains unavail-\nable for the vast majority of species [17], and especially for those\nfound in tropical forests.\nAn alternative method is to remove occasional or rare species\naccording to their rank abundance or occupancy [10]. However,\nrules regarding how many species to remove, or where to remove\nthem from, are very subjective. A search of the literature quickly\nreveals a bewildering array of criteria for classifying or excluding\nrare and occasional species from ecological analyses, including\nremoving species with ,3 occurrences [18]; species that are not\npresent in at least 5% of the samples [19]; species representing\n#1% of any sample [20]; and species that fail to represent at least\n2% (in term of abundance and biomass) of every monthly sample\nfrom each sampling station [21].\nGiven the frequency with which these removal rules have been\napplied, it is alarming that so little is known about how these\nessentially arbitrary decisions affect estimates of conservation\nvalue. This question has particular applied relevance to the\ncurrent tropical conservation research agenda as it has recently\nbeen argued that agricultural abandonment and subsequent\nrecovery of secondary forests on degraded land could help offset\nthe biodiversity lost from the clearance of old-growth tropical\nforests [22]. Understanding the extent to which secondary forests\nand modified forest land-uses such as plantation forestry may\nprovide a ‘‘safety net’’ for tropical forest species depends on having\na robust understanding of their conservation value [2,6,23].\nWe use a comprehensive dataset of 15 taxa sampled in primary,\nsecondary and plantation forests in the northeastern Brazilian\nAmazon to explore how occasional species affect estimates of\nconservation value. By sequentially removing different abundance\nclasses of occasional species, we test the hypothesis that occasional\nspecies can significantly decrease estimates of the conservation\nvalue of primary forests (or, conversely, increase the estimated\nconservation value of modified land-uses). The rationale for this is\nbased on the possibility that spill-over effects could lead to the\ndetection of a disproportionately high number of occasional\nspecies in modified land-uses, although the lack of biological data\non almost all tropical forest species means we are unable to\nexamine the mechanistic causes behind the observed patterns. We\nuse two different removal rules (removing occasional species from\nall forest types simultaneously, or removing occasional species\nfrom modified land-uses only) and two alternative metrics of\nuniqueness (the proportion of the entire species pool unique to\nprimary forest, and the proportion of species that were recorded in\nprimary forest that were also unique to primary forest). Although\nmost tropical forest biologists are aware that the removal of the\nrarest species from analyses will inevitably affect estimates of\nconservation value based on unique species, this is the first time the\nsensitivity of these commonly used conservation value metrics has\nbeen assessed in any systematic way.\nMaterials and Methods\nData Collection\nField data were collected within the Jari region of Para´, north-\neastern Brazilian Amazonia. Sampling protocols, vegetation\ndescriptions, and landscape structure are described in detail\nelsewhere [5,11,24]. Data on 14 faunal taxa and one plant taxon\n(trees and lianas) were collected from 15 study sites, including five\nprimary forests, five 14–19 year old secondary forests, and five 4–6\nyear old Eucalyptus plantations. These forest blocks were spatially\nindependent (mean distance between primary, secondary and\nEucalyptus sites was 30 km (range= 14–67 km), 9 km (range = 4–\n44 km) and 11 km (range= 7–50 km), respectively), and the\npotential influence of adjacent land-uses was minimized as forest\nblocks were very large in comparison with most previous studies\n(mean size of Eucalyptus and secondary forest blocks was 1687 ha\n(range= 574–3910 ha) and 2682 ha (range= 1079–3508 ha), re-\nspectively). However, the modified land-uses were embedded in a\nvast area of relatively intact primary forest, and it seems likely that\nthe secondary and plantation forest samples could have recorded\nmany occasional species that would not exist without the\nfavourable landscape context [11,25].\nA large multi-national research team spent over two years and\n.18,200 person-hours sampling and identifying the focal taxa,\nrecording a total of 1441 species. Taxa (no. of records; no. of\nspecies) were grouped following [5], and included leaf-litter\namphibians (1,739; 23), lizards (1,937; 30), large mammals\n(1,227; 30), small non-volant mammals (219; 32), bats (4,125;\n54), birds (6,865; 255), epigeic arachnids (3,176; 116), scavenger\nflies (5,365; 30), dung beetles (9,203; 85), fruit-feeding butterflies\n(10,987; 128), fruit flies (5,085; 38), moths from the Sphingidae,\nSaturnidae, and Arctiidae (1,848, 335), grasshoppers (942; 44) and\norchid bees (2,363; 22), and tree and woody liana genera (8,077;\n219). Almost all species were native to South America (with some\nobvious exceptions such as Eucalyptus).\nDefining Conservation Value and Occasional Species\nWe define the conservation value of old-growth forest by the\npercentage of species that do not occur in the surrounding\nmodified land-uses: put simply, the more species that are unique to\nold-growth forests, the greater their importance for conservation.\nWe recognize that this definition represents a gross simplification\nas rare, declining, phylogenetically distinct, and functionally\nimportant species are generally perceived as having a higher\nconservation value [26]. However, the lack of baseline information\non the overwhelming majority of species means we weight all\nspecies equally.\nAlthough similarity indices are becoming increasingly sophisti-\ncated, and can be used as alternative measures of conservation\nvalue [27], we do not address them here as the robustness of these\nindices to sampling representation and rare species has already\nbeen addressed in detail before [28,29]. Furthermore, while some\nof these similarity indices are robust to incomplete sampling and\nlow sample effort, these require a level of data complexity that is\nnot often available in meta-analyses of multi-taxa datasets (for\nexample, estimation of probabilities of detection requires that the\nConservation Value of Forests\nPLoS ONE | www.plosone.org 2 March 2010 | Volume 5 | Issue 3 | e9609\ncommunity is sampled several times and is divided into multiple\nspatially explicit subsamples). Finally, similarity indices are much\nless intuitive for non-scientists than a percentage of species unique\nto a forest type.\nSpecies encountered in modified land-uses could have few\noccurrences either because they are naturally rare in samples [17],\nor because individuals could be reproductively immature or\njuvenile individuals [30], vagrants [10], or could represent long-\nterm sink populations [31]. However, we lack the baseline\ninformation or long-term monitoring required to distinguish\nfrequent from occasional species [17,32]. Instead, we define\noccasional species as those that form the tail of the species\nabundance distribution in each forest type, with 10 or fewer\nrecords (on average, a species with 10 captures in a forest type\nwould only have been recorded twice at each site). In practice, this\nis the only objective way of defining occasional species in relatively\nshort-term studies that compare the conservation value of different\nland-uses in tropical forest regions (i.e. the vast majority of field\nresearch to date).\nData Analysis\nWe grouped data from replicate sites within each land-use type.\nWe examine how estimates of the conservation value of primary\nforest vary following the sequential removal of different abundance\nclasses, defined as species that were recorded once, twice and three\ntimes, etc, in each forest type. We use two different metrics to\ndefine the conservation value of primary forest in our samples:\nThe proportion of the entire species pool that is unique to primary\nforest in our samples, and the proportion of primary forest species\nthat are unique to primary forest (herafter, primary forest species\nare defined as those that were sampled at least once in any of the\nprimary forest sites). We applied two different removal rules,\nremoving occasional species from all land-uses simultaneously, or\nonly removing species from modified land-uses. The combination\nof these removal rules and uniqueness metrics provides four\ndifferent estimates of the conservation value of primary forest:\n1) The proportion of all species that was unique to primary\nforest, simultaneously removing occasional species from all\nland-uses.\n2) The proportion of primary forest species that was unique to\nprimary forest, simultaneously removing occasional species\nfrom all land-uses.\n3) The proportion of all species that was unique to primary\nforest, simultaneously removing occasional species from\nmodified land-uses only.\n4) The proportion of primary forest species that was unique to\nprimary forest, simultaneously removing occasional species\nfrom modified land-uses only.\nBecause the sequential removal of occasional species excludes a\ndifferent proportion of the overall abundance of each taxon, we\nalso calculate the proportion of the total abundance and species\nrichness that were depleted for each taxon.\nResults\nOverall, the removal of occasional species consistently increased\nestimates of the conservation value of primary forest (Figure 1a\nand 1b) while reducing estimates of the conservation value of both\nsecondary forests and Eucalyptus plantations (Figure 1c–f). Irre-\nspective of the removal rule or uniqueness metric, there was a\nfundamental difference among different taxa in the proportion of\nspecies considered to be unique to primary forest (Figure 2, and\nsee [5]). The consequences of removing occasional species were\nalso highly variable between taxa. Arachnids, fruit-flies and fruit-\nfeeding butterflies were either strongly affected by the removal\nrule, the uniqueness metric, or both, while other taxa were less\nsensitive (Figure 2)\nThe removal of singletons had a greater effect on conservation\nvalue estimates than the sequential removal of doubletons,\ntrebletons, etc (Figures 1 and 2). The removal of additional\noccasional species (those recorded more than three times) had little\nor no overall effect on the most unbiased uniqueness metrics which\nexcluded occasional species from both primary and modified land-\nuses, regardless of whether we considered the proportion of all\nprimary forest species or the proportion of the entire species pool\n(Figure 1a). Unsurprisingly, when occasional species were only\nremoved from modified land-uses, a larger proportion of species\nwere considered to be unique to primary forests (Figure 1b), but\nthis rise approached an asymptote after the removal of species\nrecorded five times or less.\nSample Representation\nOccasional species accounted for a highly variable proportion of\nthe species richness and total abundance of the different taxa\n(Figure 3). Overall, singletons accounted for 3% of the total\nabundance and 28% of the species from the forest treatments,\nwhile doubletons accounted for 2% and 12%, and trebletons 2%\nand 6%, respectively. There was substantial variation between\ntaxa and between forest types: singletons alone accounted for\nbetween 55–60% of all species in the three forest types in species\nrich taxa like moths, but just 12–14% of the species of scavenger\nflies (Figure 3).\nSample representation was estimated by dividing observed\nrichness in each forest type by the average of three abundance-\nbased richness estimators (Chao 1, Jack 1 and ACE; see Colwell,\n2005). Overall, estimated sample representation was generally\nhigh across taxa (.70% for 11, 12, and 13 of the 15 taxa sampled\nin primary, secondary and plantations, respectively; see [24]). The\nmean sample representation for all forest types was not correlated\nwith the proportion of species in each taxa that were considered\nunique to primary forest (r =20.02, n = 15, P= 0.9). Within\ntreatment sample representation can also be assessed visually from\nspecies accumulation curves shown in previous manuscripts using\nthe same data (see [5]).\nDiscussion\nThe development of effective conservation management plans\nthat encompass entire landscapes requires a detailed understand-\ning of the biodiversity consequences of land-use change and\nlandscape modification [33,34]. Within the humid tropics, this\nunderstanding is severely limited by our poor knowledge of species\nbiology, making it almost impossible to determine whether\noccasional species recorded in modified land-uses represent viable\npopulations.\nAs a result, the biodiversity uniqueness of undisturbed primary\nforests is shrouded by many layers of uncertainty. Estimates are\nparticularly sensitive to decisions researchers make regarding the\ninclusion or exclusion of occasional species, or how many to exclude\n(Figures 1 and 2); whether occasional species are excluded from all\nland-uses, or only modified land-uses (Figure 1, comparing panels a,\nc and e with b, d and f); whether the metric of conservation value\nconsiders the entire species pool for that landscape, or only those\nspecies known to exists within the land-use of conservation interest\n(e.g. primary tropical forests in our case) (Figures 1a & b); and the\nchoice of study taxa (Figure 2). Moreover, estimates of uniqueness\nConservation Value of Forests\nPLoS ONE | www.plosone.org 3 March 2010 | Volume 5 | Issue 3 | e9609\nare also likely to be affected by the level of taxonomic resolution\nachieved by researchers, particularly when apparently abundant\ngenera are composed of many rare species (as is likely to be the case\nfor many genera of trees and lianas). If primary forests hold more\nrare species then anthropogenic land-uses, then a low taxonomic\nresolution could also lead researcher to underestimate the unique\nconservation value of primary forests.\nOur results show that the lowest proportion of species are\nconsidered to be unique to the land-use of interest if no occasional\nspecies are removed and the proportion is calculated based on the\nentire species pool [5]. By contrast, estimates of uniqueness are\nmuch higher if an increasing number of occasional species are\nremoved (from either pool), if occasional species are only removed\nfrom modified land-uses, and if the proportion is based on the pool\nof species that are known to inhabit primary forest.\nBy presenting the uncertainty inherent in almost all biodiversity\nsample data, we provide a more transparent estimate of the\nimportance of areas of primary forest in multiple-use landscape\nmosaics. Yet the metrics that make up this upper and lower bound\nshould not be weighted equally. The lower bound of uniqueness\nFigure 1. The conservation value of forests in the Jari landscape. Panels show how the metric of conservation value changes in primary\nforest (a & b), secondary forest (c & d) and Eucalyptus plantations (e & f) as an increasing number of abundance classes of occasional species are\nsequentially removed from the analysis. Values represent the mean proportion (6 SE) from 15 vertebrate, invertebrate and plant taxa sampled. Panels\non the left (a, c & e) represent values when occasional species are removed from all forest types simultaneously (symbols as circles), while panels on\nthe right (b, d, & f) represent values when occasional species are only removed from modified forest types (symbols as triangles). Solid and open\nsymbols (panels a & b) represent the proportion of the entire species pool, and the proportion of primary forest species (i.e. only species that were\nrecorded at least once in primary forest), respectively.\ndoi:10.1371\/journal.pone.0009609.g001\nConservation Value of Forests\nPLoS ONE | www.plosone.org 4 March 2010 | Volume 5 | Issue 3 | e9609\nwill almost certainly underestimate the biodiversity uniqueness of\nprimary forests, because the metric includes many species that are\nnot found in undisturbed land-uses (i.e. open-area and generalist\nspecies), and because the removal rule removes many of the rare\nspecies that are so characteristic of tropical primary forests.\nIn our opinion, the upper bound is much more likely to provide\nan accurate estimate of the conservation value of primary forests.\nThis is because there is much stronger theoretical support for 1)\nremoving occasional species from modified forest sites only\n(removing species from primary environments is likely to remove\nFigure 2. The conservation value of primary forest (measured as the proportion of species unique to primary forest samples) for 15\nvertebrate, invertebrate and plant taxa, following the sequential removal of abundance classes. Lines within each panel show different\nselection criteria and removal rules, and the grey shaded area indicates the region between the upper and lower estimates of uniqueness. Circles\nrepresent values when occasional species are removed from all forest types simultaneously, and triangles represent the removal of occasional species\nfrom modified forest types only. Solid and open symbols represent the proportion of the entire species pool, and the proportion of primary forest\nspecies (i.e. only species that were recorded in primary forest), respectively. Order of panels follows Barlow et al. (2007).\ndoi:10.1371\/journal.pone.0009609.g002\nConservation Value of Forests\nPLoS ONE | www.plosone.org 5 March 2010 | Volume 5 | Issue 3 | e9609\nviable populations of threatened or rare species) and 2) only\nvaluing species that were recorded at least once in primary forest\n(it makes little sense to include species that are recorded outside of\nprimary forest but never within it, as these are likely to be species\nof lowest conservation concern). Although this metric could\noverestimate conservation value, as some of the occasional species\nrecorded outside primary forest inevitably represent viable\npopulations, we believe it is the most useful metric to use under\na precautionary approach, especially when considered against the\nfull range of uncertainty. Finally, it is important to note that we did\nnot remove occasional species from the primary forest only, while\nleaving them in the modified land-uses. We chose not adopt this\napproach as we can see no rational biological justification for\nassuming that occasional species would be able to maintain viable\npopulations in modified land-uses, but would not be able to so in\nnative primary forests.\nFigure 3. Patterns of rarity in the species data used in this paper. Panels show the cumulative proportion of species (black symbols) and\nindividuals (open symbols) removed from primary forest (circles), secondary forests (squares) and tree plantations (triangles) (i.e. following the\nremoval of singletons, doubletons, and so on, up to those species that were recorded #10 times in each forest type).\ndoi:10.1371\/journal.pone.0009609.g003\nConservation Value of Forests\nPLoS ONE | www.plosone.org 6 March 2010 | Volume 5 | Issue 3 | e9609\nHow Irreplaceable Are the Primary Forests of Jari\nWithout removing any occasional species, 25% of the entire\nspecies pool (averaging across all 15 taxa) was unique to primary\nforest when compared to alternative land-uses, here represented\nby young (14–19 year old) secondary forests and 4–6 year old\nEucalyptus plantations [5]. However, this figure rose to 34% if we\nonly consider species that were recorded at least once in primary\nforest sites, which targets those species of particular conservation\nvalue because they are by definition more sensitive to forest loss\nthan species able to inhabit anthropogenic environments. The\nremoval of singletons from all forest types increased the average\nestimate of biodiversity uniqueness to 41%, and the removal of\nsingletons from land-uses other than primary forests increased the\nestimate further still, to 47%. In short, we almost doubled the\nestimate of the conservation value of primary forest by excluding\nspecies that were only recorded once outside primary forest, and\nby limiting the comparison to species known to occur in primary\nforest. In doing so we also reduced our estimates of the value of the\nmodified forests in the Jari region of Amazonia. The secondary\nforests and Eucalyptus plantations held 59% and 47% of all primary\nforest species, respectively, without the removal of occasional\nspecies [5], yet these values fell to 46% and 39% if singletons were\nexcluded from these samples, and were further reduced by the\nexclusion of more occasional species.\nVariation between Taxa\nIt is also important to note that estimates of conservation value\nwere much higher for some taxa than others, and some taxa were\nmore sensitive to the exclusion of occasional species (Figure 2).\nThe exclusion of singletons increased the percentage of bird\nspecies (range 46–68%) and tree and liana genera (60–73%) that\nwould be expected to be lost if primary forests were converted to\nlandscapes dominated exclusively by secondary forests and tree\nplantations. These values are considerably higher than those\nreported previously based on the most conservative measure of\nbiodiversity uniqueness (40% for birds and 62% for tree and liana\ngenera [5]), and provide strong justification for a focus of\nconservation efforts on the protection of remaining areas of\nprimary forests, wherever this is possible.\nShould Biodiversity Sampling Ignore Rare Species\nOccasional and rare species are often difficult to sample and\nidentify, and where it is attempted this work occupies a\ndisproportionate amount of research time [35]. Removing these\nrare species from the identification process and subsequent\nanalyses may be cost effective, helping to maximise statistical\npower (e.g. by increasing the number of sites that are sampled) for\nrelatively little loss of ecological information [36]. Although our\nresults demonstrate the importance of considering occasional\nspecies from some analyses, we do not advocate ignoring them in\nthe identification process. First, it is obviously impossible to know\nwhich species are rare without attempting to identify all specimens\nthat are collected. Second, there are additional benefits to\nidentifying rare species, especially in the fields on taxonomy and\nbiogeography. Third, rare species are often the most vulnerable to\ndisturbance or land-use change [37]. Finally, without identifying\nrare species, it would not be possible to understand the sensitivity\nof patterns of conservation value to differences in data analysis.\nConclusions\nAlthough it seems obvious to ecologists that relatively intact or\npristine environments have a high conservation value, this does\nnot always translate through to environmental policy [38]. It is\ntherefore vital that conservation biologists are able to make\naccurate assessments of the biodiversity consequences of land-use\nchange. Inferences researchers make about the distribution and\nabundance of species in relation to their local environment are\nunavoidably influenced by a multitude of decisions concerning\nresearch design, execution and interpretation [12]. We demon-\nstrate that estimates of the conservation value of primary forest\nrelative to human-modified land-uses are highly sensitive to\ndecisions regarding occasional species when based on the\nproportion of unique species. We suggest that scientists using this\nmetric should consider the influence of occasional species on their\nresults, and should report upper and lower bounds on estimates\nrather than the exact numbers which are almost certainly\nincorrect.\nAcknowledgments\nWe thank Jari Celulose, Grupo Orsa and the staff of Orsa Florestal for\nlogistical support and access to the Jari forest landscape. We are very\ngrateful to the people who collected data and identified specimens: I.S.\nAraujo, T.C. Avila-Pires, A.B. Bonaldo, J.E. Costa, M.C. Esposito, L.V.\nFerreira, J. Hawes, M.I.M. Hernandez, M.S. Hoogmoed, R.N. Leite, N.F.\nLo-Man-Hung, J.R. Malcolm, M.B. Martins, L. .M. Mestre, R. Miranda-\nSantos, A.L. Nunes-Gutjahr, W.L. Overal, L. Parry, S.L. Peters, M.A.\nRibeiro-Junior, M.N.F. da Silva, and C. da Silva Motta. Joe Wright and\nJerome Chave provided comments that helped improve the manuscript.\nThis is publication number 22 of the Land-Use Change and Amazonian\nBiodiversity Project.\nAuthor Contributions\nConceived and designed the experiments: JB TAG CAP. Performed the\nexperiments: JB TAG. Analyzed the data: JB JL. Wrote the paper: JB TAG\nJL CAP.\nReferences\n1. Possingham HP, Nicholson E (2007) Principles of landscape design that emerge\nfrom a formal problem solving approach. In: Lindenmayer BD, Hobbs NT, eds.\nManaging and Designing Landscapes for Conservation. London: Blackwell\nPublishing.\n2. Gardner TA, Barlow J, Parry LTW, Peres CA (2007) Predicting the Uncertain\nFuture of Tropical Forest Species in a Data Vacuum. Biotropica 39: 25–30.\n3. Peres CA (2005) Why we need megareserves in Amazonia. Conservation Biology\n19: 728–733.\n4. Sodhi NS (2008) Invited views in basic and applied ecology - Tropical biodi-\nversity loss and people - A brief review. Basic and Applied Ecology 9: 93–99.\n5. Barlow J, Gardner TA, Araujo IS, Bonaldo AB, Costa JE, et al. (2007)\nQuantifying the biodiversity value of tropical primary, secondary and plantation\nforests. Proceedings of the National Academy of Science 104: 18555–18560.\n6. Chazdon RL, Peres CA (2009) Where are the wild things? Assessing the\npotential for species conservation in tropical secondary forests. Conservation\nBiology.\n7. Faria D, Paciencia MLB, Dixo M, Laps RR, Baumgarten J (2007) Ferns, frogs,\nlizards, birds and bats in forest fragments and shade cacao plantations in two\ncontrasting landscapes in the Atlantic forest, Brazil. Biodiversity and Conser-\nvation 16: 2335–2357.\n8. Pardini R, Faria D, Accacio GM, Laps RR, Mariano-Neto E, et al. (2009) The\nchallenge of maintaining Atlantic forest biodiversity: A multi-taxa conservation\nassessment of specialist and generalist species in an agro-forestry mosaic in\nsouthern Bahia. Biological Conservation 142: 1178–1190.\n9. Dent DH, Wright SJ (in press) The future of tropical species in secondary forests:\nA quantitative review. Biological Conservation.\n10. Gaston KJ (1994) Rarity. London: Chapman and Hall.\n11. Barlow J, Overal WL, Araujo IS, Gardner TA, Peres CA (2007) The value of\nprimary, secondary and plantation forests for fruit-feeding butterflies in the\nBrazilian Amazon. Journal of Applied Ecology 44: 1001–1012.\n12. Gardner TA (2008) Understanding the consequences of habitat change for\ntropical forest biodiversity. Norwich: University of East Anglia.\nConservation Value of Forests\nPLoS ONE | www.plosone.org 7 March 2010 | Volume 5 | Issue 3 | e9609\n13. Vanhorne B (1983) Density as a misleading indicator of habitat quality. Journal\nof Wildlife Management 47: 893–901.\n14. Clarke KR, Warwick RM (1994) Change in Marine Communities: An\nApproach to Statistical Analysis and Interpretation: Primer-E Ltd, Plymouth. .\n15. Rabinowitz D (1981) Seven forms of rarity. In: Synge H, ed. The Biological\nAspects of Rare Plant Conservation Wiley. pp 205–217.\n16. Pilgrim ES, Crawley MJ, Dolphin K (2004) Patterns of rarity in the native British\nflora. Biological Conservation 120: 161–170.\n17. Magurran AE, Henderson PA (2003) Explaining the excess of rare species in\nnatural species abundance distributions. Nature 422: 714–716.\n18. Edinger EN, Risk MJ (2000) Reef classification by coral morphology predicts\ncoral reef conservation value. Biological Conservation 92: 1–13.\n19. Duffy-Anderson JT, Busby MS, Mier KL, Deliyanides CM, Stabeno PJ (2006)\nSpatial and temporal patterns in summer ichthyoplankton assemblages on the\neastern Bering Sea shelf 1996–2000. Fisheries Oceanography 15: 80–94.\n20. Marchese MR, Wantzen KM, De Drago IE (2005) Benthic invertebrate\nassemblages and species diversity patterns of the upper Paraguay River. River\nResearch and Applications 21: 485–499.\n21. Drake P, Baldo F, Cuesta JA, Garcia-Gonzalez D, Silva-Garcia A, et al. (1999)\nInitial effects of the toxic waste spill (Aznalcollar mine accident) on the aquatic\nmacrofauna of the Guadalquivir Estuary. Science of the Total Environment 242:\n271–280.\n22. Wright SJ, Muller-Landau HC (2006) The uncertain future of tropical forest\nspecies. Biotropica 38: 443–445.\n23. Laurance WF (2007) Have we overstated the tropical biodiversity crisis? Trends\nin Ecology & Evolution 22: 65–70.\n24. Gardner TA, Barlow J, Araujo IS, Avila-Pires TCS, Bonaldo AB, et al. (2008)\nThe cost-effectiveness of biodiversity surveys in tropical forests. Ecology Letters\n11.\n25. Norris K (2008) Agriculture and biodiversity conservation: opportunity knocks.\nConservation Letters 1: 2–11.\n26. Arponen A, Heikkinen RK, Thomas CD, Moilanen A (2005) The value of\nbiodiversity in reserve selection: Representation, species weighting, and benefit\nfunctions. Conservation Biology 19: 2009–2014.\n27. Ferrier S, Manion G, Elith J, Richardson K Using generalized dissimilarity\nmodelling to analyse and predict patterns of beta diversity in regional\nbiodiversity assessment; Nov 02–04; Baeza, SPAIN. pp 252–264.\n28. Chao A, Chazdon RL, Colwell RK, Shen TJ (2006) Abundance-based similarity\nindices and their estimation when there are unseen species in samples.\nBiometrics 62: 361–371.\n29. Chao A, Chazdon RL, Colwell RK, Shen TJ (2005) A new statistical approach\nfor assessing similarity of species composition with incidence and abundance\ndata. Ecology Letters 8: 148–159.\n30. Terborgh J, Weske JS (1969) Colonization of Secondary Habitats by Peruvian\nBirds Ecology 50: 765–782.\n31. Dias PC (1996) Sources and sinks in population biology. Trends in Ecology &\nEvolution 11: 326–330.\n32. Ulrich W, Ollik M (2004) Frequent and occasional species and the shape of\nrelative-abundance distributions. Diversity and Distributions 10: 263–269.\n33. Bennett A, Radford JQ (2007) Emergent properties of land mosaics: implications\nfor land management and biodiversity conservation. In: Lindenmayer BD,\nHobbs RJ, eds. Managing and designing landscapes for conservation. Oxford:\nBlackwell. pp 201–214.\n34. Polasky S, Nelson E, Camm J, Csuti B, Fackler P, et al. (2008) Where to put\nthings? Spatial land management to sustain biodiversity and economic returns.\nBiological Conservation 141: 1505–1524.\n35. Colwell RK, Coddington JA (1994) Estimating Terrestrial Biodiversity through\nExtrapolation. Philosophical Transactions of the Royal Society of London Series\nB-Biological Sciences 345: 101–118.\n36. Vellend M, Lilley PL, Starzomski BM (2008) Using subsets of species in\nbiodiversity surveys. Journal of Applied Ecology 45: 161–169.\n37. Goerck JM (1997) Patterns of rarity in the birds of the Atlantic forest of Brazil.\nConservation Biology 11: 112–118.\n38. Meijaard E, Sheil D (2007) Is wildlife research useful for wildlife conservation in\nthe tropics? A review for Borneo with global implications. Biodiversity and\nConservation 16: 3053–3065.\nConservation Value of Forests\nPLoS ONE | www.plosone.org 8 March 2010 | Volume 5 | Issue 3 | e9609\n"}