{"doi":"10.1029\/2003JC002104","coreId":"194731","oai":"oai:lra.le.ac.uk:2381\/688","identifiers":["oai:lra.le.ac.uk:2381\/688","10.1029\/2003JC002104"],"title":"The measurement of climate change using data from the Advanced Very High Resolution and Along Track Scanning Radiometers","authors":["Lawrence, S. P.","Llewellyn-Jones, D. T.","Smith, S. J."],"enrichments":{"references":[{"id":44681428,"title":"A closer look at United States and global surface temperature change,","authors":[],"date":"2001","doi":"10.1029\/2001jd000354","raw":"Hansen, J., R. Ruedy, M. Sato, M. Imhoff, W. Lawrence, D. Easterling, T. Peterson, and T. Karl (2001), A closer look at United States and global surface temperature change, J. Geophys. Res., 106, 23,947–23,963.","cites":null},{"id":44681437,"title":"A comprehensive ocean-atmosphere data set,","authors":[],"date":"1987","doi":"10.1175\/1520-0477(1987)068<1239:acoads>2.0.co;2","raw":"Woodruff, , S. D. R. J. Slutz, R. L. Jenne, and P. M. Steurer (1987), A comprehensive ocean-atmosphere data set, Bull. Am. Meteorol. Soc., 68, 1239–1250.","cites":null},{"id":44681431,"title":"A nonlinear dynamical perspective on climate change,","authors":[],"date":"1999","doi":"10.1002\/j.1477-8696.1993.tb05802.x","raw":"Palmer, T. N. (1999), A nonlinear dynamical perspective on climate change, Weather, 48, 313–348.","cites":null},{"id":44681433,"title":"An improved in situ and satellite SST analysis for climate,","authors":[],"date":"2002","doi":"10.1175\/1520-0442(2002)015<1609:aiisas>2.0.co;2","raw":"Reynolds, R. W., N. A. Rayner, T. M. Smith, D. C. Stokes, and W. Wang (2002), An improved in situ and satellite SST analysis for climate, J. Clim., 15, 1609–1625.","cites":null},{"id":44681425,"title":"AVHRR Pathfinder SST approach and results, Eos Trans.","authors":[],"date":"1996","doi":null,"raw":"Evans, R., and G. Podesta (1996), AVHRR Pathfinder SST approach and results, Eos Trans. AGU, 77(46), Fall Meet Suppl., F354.","cites":null},{"id":44681438,"title":"Bias characteristics in the AVHRR sea surface temperature,","authors":[],"date":"2004","doi":"10.1029\/2003gl018804","raw":"Zhang, H.-M., R. W. Reynolds, and T. M. Smith (2004), Bias characteristics in the AVHRR sea surface temperature, Geophys. Res. Lett., 31, L01307, doi:10.1029\/2003GL018804.","cites":null},{"id":44681434,"title":"Climate trends in the southwest Pacific,","authors":[],"date":"1995","doi":"10.1002\/joc.3370150305","raw":"Salinger, M. J., R. E. Basher, B. B. Fitzharris, J. E. Hay, P. D. Jones, J. P. MacVeigh, and I. Scmidely-Leleu (1995), Climate trends in the southwest Pacific, Int. J. Climatol., 12, 285–302.","cites":null},{"id":44681432,"title":"Degradation of the visible and near-infrared channels of the Advanced Very High Resolution Radiometer on the NOAA-9 spacecraft: Assessment and recommendations for corrections,","authors":[],"date":"1993","doi":"10.1080\/01431169608949104","raw":"Rao, C. R. N. (1993), Degradation of the visible and near-infrared channels of the Advanced Very High Resolution Radiometer on the NOAA-9 spacecraft: Assessment and recommendations for corrections, NOAA Tech. Rep., NESDIS-70, 25 pp.","cites":null},{"id":44681426,"title":"Efficient three-dimensional global models for climate studies: Models I and II,","authors":[],"date":"1983","doi":"10.1175\/1520-0493(1983)111<0609:etdgmf>2.0.co;2","raw":"Hansen, J., G. Russell, D. Rind, P. Stone, A. Lacis, S. Lebedeff, R. Ruedy, and L. Travis (1983), Efficient three-dimensional global models for climate studies: Models I and II, Mon. Weather Rev., 111, 609–662.","cites":null},{"id":44681436,"title":"ENSO, volcanoes and record-breaking temperatures,","authors":[],"date":"2000","doi":"10.1029\/2000gl012159","raw":"Wigley, T. M. L. (2000), ENSO, volcanoes and record-breaking temperatures, Geophys. Res. Lett., 27, 4101–4104.","cites":null},{"id":44681427,"title":"GISS analysis of surface temperature change,","authors":[],"date":"1999","doi":"10.1029\/1999jd900835","raw":"Hansen, J., R. Ruedy, J. Glascoe, and M. Sato (1999), GISS analysis of surface temperature change, J. Geophys. Res., 104, 30,997–31,022.","cites":null},{"id":44681416,"title":"Global and regional sea surface temperature trends,","authors":[],"date":"2001","doi":"10.1175\/1520-0442(2001)014<3801:garsst>2.0.co;2","raw":"Casey, K. S., and P. Cornillon (2001), Global and regional sea surface temperature trends, J. Clim., 14, 3801–3818.","cites":null},{"id":44681414,"title":"Global change detection,","authors":[],"date":"1994","doi":"10.1038\/370024b0","raw":"Allen, M. R., C. T. Mutlow, G. M. C. Blumberg, J. R. Christy, R. T. McNider, and D. T. Llewellyn-Jones (1994), Global change detection, Nature, 370, 24–25.","cites":null},{"id":44681422,"title":"Implications of the oceanic thermal skin temperature deviation at high wind speed,","authors":[],"date":"1999","doi":"10.1029\/1999gl900547","raw":"Donlon, C. J., T. J. Nightingale, T. Sheasby, J. Turner, I. S. Robinson, and W. J. Emery (1999), Implications of the oceanic thermal skin temperature deviation at high wind speed, Geophys. Res. Lett., 26, 2505–2508.","cites":null},{"id":44681435,"title":"Modified version of the TIROS","authors":[],"date":"1982","doi":null,"raw":"Schwalb, A. (1982), Modified version of the TIROS N\/NOAA A-G Satellite Series (NOAA E-J)—Advanced TIROS N (ATN), NOAA Tech. Memo. NESS 116, Natl. Oceanic and Atmos. Admin., Silver Spring, Md.","cites":null},{"id":44681415,"title":"Monitoring sea-level and sea-surface temperature trends from ERS satellites,","authors":[],"date":"2002","doi":"10.1016\/s1474-7065(02)00081-5","raw":"Andersen, O. B., P. Knudsen, and B. Beckley (2002), Monitoring sea-level and sea-surface temperature trends from ERS satellites, Phys. Chem.","cites":null},{"id":44681424,"title":"Multiscale variabilities in global sea surface temperatures and their relationships with tropospheric climate patterns,","authors":[],"date":"1999","doi":"10.1175\/1520-0442(1999)012<2719:mvigss>2.0.co;2","raw":"Enfield, D. B., and A. M. Mestas-Nunez (1999), Multiscale variabilities in global sea surface temperatures and their relationships with tropospheric climate patterns, J. Clim., 12, 2719–2733.","cites":null},{"id":44681430,"title":"NOAA Polar Orbiter User’s","authors":[],"date":"1995","doi":null,"raw":"Kidwell, K. (1995), NOAA Polar Orbiter User’s Guide, Natl. Clim. Data Cent., Washington, D. C. (Available at http:\/\/www2.ncdc.noaa.gov\/POD) Kilpatrick, K. A., G. P. Podesta, and R. Evans (2001), Overview of the NOAA\/NASA Advanced Very High Resolution Radiometer Pathfinder C08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA 15 of 16 C08017 algorithm for sea surface temperature and associated matchup database, J. Geophys. Res., 106(C5), 9179–9197.","cites":null},{"id":44681417,"title":"Satellite greenhouse signal,","authors":[],"date":"1994","doi":"10.1038\/367325a0","raw":"Christy, J. R., and R. T. McNider (1994), Satellite greenhouse signal, Nature, 367, 325.","cites":null},{"id":44681418,"title":"Signature of recent climate change in frequencies of natural atmospheric circulation regimes,","authors":[],"date":"1999","doi":null,"raw":"Corti, S., F. Molteni, and T. N. Palmer (1999), Signature of recent climate change in frequencies of natural atmospheric circulation regimes, Nature, 398, 799–802.","cites":null},{"id":44681420,"title":"The Advanced Very High Resolution Radiometer, Taylor and Francis,","authors":[],"date":"1997","doi":null,"raw":"Cracknell, A. P. (1997), The Advanced Very High Resolution Radiometer, Taylor and Francis, Philadelphia, Pa.","cites":null},{"id":44681423,"title":"The Along Track Scanning Radiometer measurement of sea-surface temperature from ERS-1,","authors":[],"date":"1990","doi":"10.1109\/oceans.1994.363914","raw":"Edwards, T., et al. (1990), The Along Track Scanning Radiometer measurement of sea-surface temperature from ERS-1, J. Br. Interplanet. Soc., 43, 160–180.","cites":null},{"id":44681429,"title":"Trenberth","authors":[],"date":"1997","doi":null,"raw":"Hurrel, J. W., and K. E. Trenberth (1997), Spurious trends in satellite MSU temperatures from merging different satellite records, Nature, 386, 164– 167.","cites":null},{"id":44681439,"title":"Trend detection in regional-mean temperature series: Maximum, minimum, mean, diurnal range and SST,","authors":[],"date":"1997","doi":"10.1175\/1520-0442(1997)010<0317:tdirmt>2.0.co;2","raw":"Zheng, X., R. E. Basher, and C. S. Thompson (1997), Trend detection in regional-mean temperature series: Maximum, minimum, mean, diurnal range and SST, J. Clim., 10, 317–326.  S. P. Lawrence, D. T. Llewellyn-Jones, and S. J. Smith, Department of Physics and Astronomy, Space Research Centre, University of Leicester, Leicester, LE1 7RH, UK. (spl5@le.ac.uk; dlj1@le.ac.uk; sts@star.le.ac.uk)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-08-27","abstract":"Global sea-surface temperature is an important indicator of climate change, with the ability to reflect warming\/cooling climate trends. The detection of such trends requires rigorous measurements that are global, accurate, and consistent. Space instruments can provide the means to achieve these required attributes in sea-surface temperature data. Analyses of two independent data sets from the Advanced Very High Resolution and Along Track Scanning Radiometers series of space sensors during the period 1985 to 2000 reveal trends of increasing global temperature with magnitudes of 0.09°C and 0.13°C per decade, respectively, closely matching that expected due to current levels of greenhouse gas exchange. In addition, an analysis based upon singular value decomposition, allowing the removal of El Niño in order to examine areas of change other than the tropical Pacific region, indicates that the 1997 El Niño event affected sea-surface temperature globally. The methodology demonstrated here can be applied to other data sets, which cover long time series observations of geophysical observations in order to characterize long-term change. The conclusion is that satellite sea-surface temperature provides an important means to quantify and explore the processes of climate change","downloadUrl":"http:\/\/hdl.handle.net\/2381\/688","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/688\/1\/Lawrence_et_al-2004-Journal_of_Geophysical_Research-_Oceans.pdf","pdfHashValue":"ae3b9c9269d9675c619bd58c9d5fd324f292097d","publisher":"American Geophysical Union (AGU), Wiley","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/688<\/identifier><datestamp>\n                2015-12-23T03:25:00Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe measurement of climate change using data from the Advanced Very High Resolution and Along Track Scanning Radiometers<\/dc:title><dc:creator>\nLawrence, S. P.<\/dc:creator><dc:creator>\nLlewellyn-Jones, D. T.<\/dc:creator><dc:creator>\nSmith, S. J.<\/dc:creator><dc:description>\nGlobal sea-surface temperature is an important indicator of climate change, with the ability to reflect warming\/cooling climate trends. The detection of such trends requires rigorous measurements that are global, accurate, and consistent. Space instruments can provide the means to achieve these required attributes in sea-surface temperature data. Analyses of two independent data sets from the Advanced Very High Resolution and Along Track Scanning Radiometers series of space sensors during the period 1985 to 2000 reveal trends of increasing global temperature with magnitudes of 0.09°C and 0.13°C per decade, respectively, closely matching that expected due to current levels of greenhouse gas exchange. In addition, an analysis based upon singular value decomposition, allowing the removal of El Niño in order to examine areas of change other than the tropical Pacific region, indicates that the 1997 El Niño event affected sea-surface temperature globally. The methodology demonstrated here can be applied to other data sets, which cover long time series observations of geophysical observations in order to characterize long-term change. The conclusion is that satellite sea-surface temperature provides an important means to quantify and explore the processes of climate change.<\/dc:description><dc:date>\n2009-12-08T16:23:50Z<\/dc:date><dc:date>\n2009-12-08T16:23:50Z<\/dc:date><dc:date>\n2004-08-27<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Geophysical Research, 2004, 109, pp.C08017-<\/dc:identifier><dc:identifier>\n0148-0227<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1029\/2003JC002104\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/688<\/dc:identifier><dc:identifier>\n10.1029\/2003JC002104<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nEarth Observation Science<\/dc:relation><dc:rights>\nArchived with reference to SHERPA\/RoMEO and publisher website.<\/dc:rights><dc:format>\nMetadata<\/dc:format><dc:publisher>\nAmerican Geophysical Union (AGU), Wiley<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0148-0227","0148-0227"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","Earth Observation Science"],"year":2004,"topics":[],"subject":["Article"],"fullText":"The measurement of climate change using data from the Advanced\nVery High Resolution and Along Track Scanning Radiometers\nS. P. Lawrence, D. T. Llewellyn-Jones, and S. J. Smith\nDepartment of Physics and Astronomy, Space Research Centre, University of Leicester, UK\nReceived 22 August 2003; revised 2 April 2004; accepted 20 May 2004; published 27 August 2004.\n[1] Global sea-surface temperature is an important indicator of climate change, with the\nability to reflect warming\/cooling climate trends. The detection of such trends requires\nrigorous measurements that are global, accurate, and consistent. Space instruments can\nprovide the means to achieve these required attributes in sea-surface temperature data.\nAnalyses of two independent data sets from the Advanced Very High Resolution and Along\nTrack Scanning Radiometers series of space sensors during the period 1985 to 2000\nreveal trends of increasing global temperature with magnitudes of 0.09\u0001C and 0.13\u0001C per\ndecade, respectively, closely matching that expected due to current levels of greenhouse gas\nexchange. In addition, an analysis based upon singular value decomposition, allowing\nthe removal of El Nin˜o in order to examine areas of change other than the tropical Pacific\nregion, indicates that the 1997 El Nin˜o event affected sea-surface temperature globally. The\nmethodology demonstrated here can be applied to other data sets, which cover long time\nseries observations of geophysical observations in order to characterize long-term change.\nThe conclusion is that satellite sea-surface temperature provides an important means to\nquantify and explore the processes of climate change. INDEX TERMS: 1635 Global Change:\nOceans (4203); 1640 Global Change: Remote sensing; 4294 Oceanography: General: Instruments and\ntechniques; KEYWORDS: climate change, satellite data, sea-surface temperature\nCitation: Lawrence, S. P., D. T. Llewelyn-Jones, and S. J. Smith (2004), The measurement of climate change using data from the\nAdvanced Very High Resolution and Along Track Scanning Radiometers, J. Geophys. Res., 109, C08017,\ndoi:10.1029\/2003JC002104.\n1. Introduction\n[2] There is currently debate as to the extent of global\nclimate change resulting from greenhouse gas concentra-\ntions in the atmosphere. There is evidence from a range of\nobservational and model sources, which suggests that global\nclimate change is enhanced by industrial pollution and that\nthis is already impacting the Earth’s climate [Houghton et\nal., 2001], although several authors suggest that natural\ndynamical influences could lead to decadal scale cooling\/\nwarming phases [e.g., Hansen et al., 2001]. One conclusion\nof such studies is that current trends may be due more to\nnatural variability, although Palmer [1999] and Corti et al.\n[1999] argue that the enhanced greenhouse effect could\nproject on to natural modes of variability, making it difficult\nto determine the primary drivers of climate change.\n[3] These and other investigations indicate that the rela-\ntive impacts of the enhanced greenhouse effect and of\nnatural variability are difficult to ascertain. In the face of\nthis debate, there is a need for detailed, accurate observa-\ntions that are global in nature, so that the true trend and\nassociated spatial patterns can be identified, and that can\nalso act as a rigorous test bed for model results. Such\nobservations are provided by the Advanced Very-High\nResolution Radiometers (AVHRRs), a series of infrared\nimaging space sensors whose data products are widely used\nfor the accurate measurement of global sea-surface temper-\nature (SST). The proposition that SST should be a surrogate\nfor global change has been made in other studies [e.g., Allen\net al., 1994]. Essentially, a climate trend should be reflected\nin SST, which in turn can be quantified using satellite data\nfrom the AVHRR instruments.\n[4] Allen et al. [1994] showed that given currently\nexpected changes in temperature, a climate trend could be\nidentified to a level of 90% confidence after 15 years of\nmeasurement using global SSTs, providing the instrumental\ndrift is less than about 0.02\u0001K per decade. If the influence of\nnatural phenomena such as El Nin˜o could be removed from\nthe data, this level of confidence can be increased, or else the\ntimescale of data required can be reduced. Thus a prime\nconsideration in work of this type is that the data set must be\ncontinuous and long term, suggesting an important reason for\nusing AVHRR data. In this paper, we analyze 16 years of\nsatellite SST data derived from AVHRR, in order to deter-\nmine their merit in detecting global climate trends. Part of our\nmethodology involves removing El Nin˜o from the SST data\nset, using singular value decomposition, in order to investi-\ngate climate trends due to processes other than El Nin˜o. For\ncomparison, we have also performed a similar analysis with\nan independent set of measurements, provided by the Euro-\npean Space Agency’s Along Track Scanning Radiometers\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 109, C08017, doi:10.1029\/2003JC002104, 2004\nCopyright 2004 by the American Geophysical Union.\n0148-0227\/04\/2003JC002104\nC08017 1 of 16\n(ATSR) series of satellite sensors. The ATSRs are infrared\nimagers with many similarities to AVHRR, but they use an\nSST retrieval methodology that is quite different than that\nemployed for AVHRR. It will be seen that the results from\nAVHRR and ATSR are remarkably similar, indicating that\nthe climate trend we have measured is largely independent of\ninstrument or retrieval methodology, which provides a higher\nconfidence in the results.\n[5] The AVHRR and ATSR sensors are described in detail\nelsewhere [Schwalb, 1978, 1982; Kidwell, 1995; Cracknell,\n1997; Edwards et al., 1990]. Briefly, they are both imaging\nradiometers in Sun-synchronous orbits, making measure-\nments of top-of-the-atmosphere brightness temperatures at\nwavelengths of 3.7, 11, and 12 mm, with a spatial resolution,\nor pixel size, of 1 km square at the subsatellite point. Both\nsensors also have coregistered channels at visible or\nreflected infrared wavelengths, which are used to identify\nthe presence of clouds by day. The principal differences\nbetween the two sensors are that ATSR employs a conical\nscanning method, whereby each terrestrial scene is viewed\ntwice, at nadir and at approximately 55\u0001 to nadir, within\nabout 100 s. This has the potential to achieve an improved\natmospheric correction, especially in the presence of\nexcessive atmospheric aerosol loading. There are also\ndifferences concerning calibration methodology, detector\ncooling, and other engineering aspects.\n[6] In the case of both sensors, SST is retrieved as a linear\ncombination of the directly measured brightness temper-\natures at the various wavelengths. Although the brightness\ntemperatures are measured at very similar wavelengths, the\nderivation of the retrieval coefficients is very different, and\neach is quite independent of the other. The most important\ndifference is that the AVHRR coefficients are derived by\nregression against in situ SSTmeasurements, while theATSR\nscheme relies instead upon historical atmospheric profile data\nand radiative transfer calculations. In this respect, the SST\ndata provided by AVHRR and ATSR can be regarded as\ntotally independent. In section 2 of this paper, we discuss the\ndata briefly. In section 3, we outline the methodology used to\nderive trends from the data, which is based upon the time\nseries analysis of globally averaged SSTs from AVHRR and\nATSR, and in section 4we present the results. In section 4, we\nalso detail a comparison between AVHRR andATSR data; an\ninteresting aspect of our work is a ‘‘proof of concept’’\nanalysis of climate change using SST from two major\nobserving systems, in which it is useful to compare results\nfrom these systems to investigate whether any differences\naffect the climate change analysis. Indeed, throughout the\ndiscussion, we highlight this comparison as a key aspect of\nour work, although it must be stressed that the primary goal is\nto provide details of climatic trends in satellite data. We use\nthe data intercomparison in an attempt to reduce any ambi-\nguity or uncertainty in our results and to evaluate whether any\nglobal change we detect is due to the retrieval methodology\nor real climate processes. Finally, in section 5 we give the\nsummary and conclusions.\n2. Sea-Surface Temperature Data From AVHRR\nand ATSR\n[7] The analysis described in this paper uses SST data\nissued by the National Oceanic and Atmospheric Adminis-\ntration\/National Aeronautics and Space Administration\n(NOAA\/NASA) AVHRR Oceans Pathfinder Project\n[Kilpatrick et al., 2001] over the period January 1985\nthrough to December 2000. These data are easily acquired\nfrom the Jet Propulsion Laboratory’s (JPL) Physical Ocean-\nography Distributed Active Archive Center (PO-DAAC) by\nftp. The AVHRR data record we have used consists of two\nchannel data that have been reprocessed in a uniform way in\nwhich, after cloud-affected values have been identified and\nremoved from the record, the SSTs have been retrieved\nusing formulae based upon linear regression. The SST data\nare binned onto a regular 54 km in longitude by 54 km in\nlatitude grid, starting at 89.75\u0001S, 179.75\u0001W.\n[8] We also use data from ATSR, obtained by ftp from the\nATSR website (ftp:\/\/atsabt.ag.rl.ac.uk). These are daily data\navailable for the period August 1991 through to April 1999,\naveraged onto a 0.5\u0001 \u0001 0.5\u0001 grid, with cloud-affected data\npoints removed from each grid box, as with AVHRR. We\nuse two-channel ATSR-2 SSTs retrieved from channels at\n11 mm and 12 mm, which, due to the failure of the 3.7-mm\nchannel on ATSR-1 early in the mission, provides some\nconsistency of retrieval between ATSR-1 and ATSR-2,\navoiding any issues concerning the different characteristics\nof two-channel and three-channel retrieval schemes.\n[9] The objective of this paper is to investigate trends\nin SST. As indicated earlier, one component of the\nmethodology is to compare data from two independent\nspaceborne sensors. Therefore, for consistency through-\nout, we use daytime data from AVHRR, which provide a\nsensible and logical correspondence with the two-channel\nATSR data that we are using. The use of nighttime\nAVHRR data, or mixed day-night data, may introduce a\ntime-varying bias, which it would be difficult to account\nfor in our analysis.\n[10] Although using a two-channel algorithm, the ATSR\ndata stream includes both daytime and nighttime data, so it\nis possible that day-night SST differences could depress the\nmean temperatures derived from ATSR data. Similarly,\nAVHRR equatorial crossing times are typically at 13.30\nand 19.30, so that some diurnal variation would be antic-\nipated. However, it will be seen that the analysis presented\nhere has been designed to extract trends from the time series\nand that the results are unaffected by small systematic biases\nbetween the observing systems, as described in section 4.\n[11] In this investigation, all data are monthly averaged.\nAn example of a typical global map of SST from AVHRR is\nshown in Figure 1. Figure 1a shows the map for December\n1996. The AVHRR provide a large amount of detail as can\nbe seen for example in the Gulf Stream region of the North\nAtlantic and in the South Atlantic off the coast of Argentina.\nIn addition, the east Pacific cold tongue exhibits tropical\ninstability waves that remain even after averaging over a\nmonth. Figure 1b shows the corresponding map for Decem-\nber 1997. The significant difference between this map and\nthat shown in Figure 1a is the absence of the east Pacific\ncold tongue, indicative of the 1997 El Nin˜o event.\n[12] An important feature of Figure 1 as regards this\nanalysis is the presence of persistent cloud over a whole\nmonth as represented by missing data, particularly off the\nwest coasts of Africa and South America. The areas over\nwhich such cloud persists varies from month to month and\nfrom year to year, and this variability must be taken into\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n2 of 16\nC08017\naccount in any time series analysis in order to have\ncontinuous data over each 54 km \u0001 54 km grid box.\n[13] In addition to continuity of data, a factor to consider\nin a trend analysis based upon satellite data is the consis-\ntency of the record across the series of instruments that are\nused to make up the data stream. In the case of AVHRR, a\ngreat deal of effort has been employed to ensure a reliable\nproduct, through the AVHRR Oceans Pathfinder program.\nConsistent retrieval and cloud-clearing algorithms\nhave been applied [Kilpatrick, 2001; Rao, 1993; Vasquez\net al., 1996], and the archived data were reprocessed using\na nonlinear algorithm, to lower any biases [Evans and\nPodesta, 1996].\n[14] When considering ATSR data, this series of instru-\nments are self-calibrating, and no evidence has been\nreported to suggest that there exist significant time-varying\ninstrumental biases. There are minor differences in retrieval\nschemes for ATSR-1 and ATSR-2, which concern some\nrefinements in the radiative transfer calculations used to\nderive the retrieval coefficients and some improvements in\nthe cloud-clearing algorithms used in the respective retrieval\nschemes. These differences give rise to biases that are small\ncompared to the large-scale fluctuations that we consider in\nthis paper and are either random or seasonal in nature.\n[15] The orbits of the ERS1 and ERS2 satellites are\nmaintained to be sun synchronous with a nominal equatorial\ncrossing time of 1030 and 2230 local time. Any occasional\nvariations in this crossing time amount to minutes rather\nthan hours and therefore are insufficient to introduce any\nspurious trend signals based on diurnal variation of SST.\nThe possibility of instrumental drift affecting the ATSR time\nseries has been considered and is unlikely to be significant\nsince, as described by Edwards et al. [1990], the ATSR\ninstruments each have two onboard blackbody targets, held\nrespectively at two temperatures, one at each extreme of the\ninstrument’s measuring range. These targets are carefully\ndesigned and well monitored, so that their degradation is\ndetectable.\nFigure 1. Sea-surface temperature from AVHRR for (a) December 1996 and (b) December 1997. The\ncolor bar scale is in \u0001C. See color version of this figure in the HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n3 of 16\nC08017\n[16] Therefore we assume that any bias between ATSR-1\nand ATSR-2 is constant in time, or else is seasonal in nature.\nIn both cases, our methodology ensures that differences\nbetween ATSR-1 and ATSR-2 are eliminated to first order\nfrom the analysis. We present evidence for this in section 4,\nwhen we consider the SST anomalies derived from\nAVHRR, ATSR-1, and ATSR-2.\n3. Analysis\n[17] The procedure is to use monthly average data on a\nregular grid, as described in section 2. We average these\ndata globally and calculate a linear trend in this global\naverage, after removing the signal due to the seasonal cycle\nand El Nin˜o, using techniques described in sections 3.3.\nBefore performing this analysis, several preliminary steps\nare required, as outlined in sections 3.1 and 3.2.\n3.1. Constructing a Land-Sea Mask\n[18] A trend analysis of the type outlined in this paper\nrequires continuous data for each grid box. In order to\nguarantee this, we use the condition that if a grid-box has a\nmissing data value for any month, then data from that grid\nbox are discarded for all months in the data stream. The\nresult is a ‘‘master mask’’ that has a value 0 over land or\nmissing data and a value 1 over ocean. Once a master mask\nhas been constructed, each grid box in the data stream is\nmultiplied by the corresponding mask value to yield a\nconstant, time-invariant mask for each monthly average\ndata point.\n[19] The criterion that a data value is missing for the\nwhole record may be too rigorous for an investigation of the\ntype performed here, especially when using ATSR data. In\nthis case, only 12% of data points remain as SST values\nuseful in the trend analysis as illustrated in Figure 2, which\nshows the master mask generated from almost an 8-year\nrecord of 0.5\u0001 \u0001 0.5\u0001 gridded ATSR data corresponding to\n259,200 potential SST grid boxes for each month. Here the\ndark shading represents land or missing data, and the light\nshading indicates areas that have an SST value for all\nmonths. Using this master mask, it would be impossible\nto ascribe a trend to particular regions of the globe, since the\nrelatively few data points that remain occur predominantly\nwithin the tropics.\n[20] In contrast to ATSR, AVHRR exhibits fuller cover-\nage over the 16 years of data considered here compared with\nthat for ATSR data over approximately 8 years. This could\nbe due to a number of factors, including AVHRR’s wider\nswath width, or the intrinsic rigor and efficiency of the\nrespective cloud identification procedures used in the data\nprocessing schemes, combined with the radiometric sensi-\ntivity of either sensor to marginal quantities of cloud at the\n1-km pixel level. Nevertheless, only 31% of grid boxes\nremain continuously cloud free in AVHRR data, and again\nan analysis of global patterns of change would not be\npossible using these data with the master mask.\n[21] The coverage does not significantly affect the climate\nchange calculations discussed here since the large areas of the\ntropical regions, where both ATSR and AVHRR data exhibit\nthe most extensive coverage, dominate a globally averaged\nSST field. As a result of this, our time series analysis of global\naveraged SST, to be outlined later, is unaffected by the choice\nof master mask, within reasonable limits. Nevertheless, in\norder to explore patterns of change at higher latitudes, we\nspatially averaged each monthly field onto a coarser 2.5\u0001 \u0001\n2.5\u0001 grid using simple averaging over 25 0.5\u0001 grid boxes.\nThis results in a wider regional coverage of data, with the\ncaveat that data points close to cloudy pixels could them-\nselves include some cloud contamination and a bias could\nsubsequently be carried through into the global average.\nNevertheless, for consistency throughout our exploration of\nclimate trends, we use 2.5\u0001 data. As an alternative to the\nabove approach, one could employ a simple linear interpo-\nlation in time, in order to fill the data. We decided not to do\nFigure 2. Master mask obtained from ATSR data. In constructing the mask, data values that are missing\nfor any one month are defined to be missing for the whole time series. The dark shading indicates land or\nmissing data, and the light shading represents regions where a surface temperature can be defined for the\nwhole time series.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n4 of 16\nC08017\nthis since we felt that biases could be introduced, especially\nwhen interpolating through long gaps in data.\n[22] Finally, it may be worth pointing out that one could\nrelax the criterion of demanding full continuity of data by\nrequiring a certain proportion, say 80%, of the grid boxes to be\ncloud free. However, such a criterion would, by its nature, be\narbitrary, although a parametric analysis of the effects of\napplying such an upper limit on data availability could be\nundertaken, together with a statistical confidence analysis.\nWe have not performed such an analysis and instead have\nused the rigorous requirement of 100% coverage at each grid\nbox.\n3.2. Globally Averaged Data\n[23] We perform a time series analysis of climate trends\nusing globally averaged SST data. This average is generated\nin two stages: First, each 2.5\u0001, or 270-km latitude band, is\nzonally averaged, and second, each zonal average is\nsummed and divided by the total number of latitude bands\nthat contain valid data. In the case of ATSR, an additional\nstage of area weighting in latitude is employed.\n[24] Figure 3 shows the global average for AVHRR data\nfor the period 1985 to 2000 (solid line) and ATSR data for the\nperiod August 1991 through to April 1999 (dashed line).\nOver the period of ATSR data, the correlation between ATSR\nand AVHRR SSTs is 0.92, indicating that the seasonal\nvariation (the dominant variability in SST) is captured fairly\nconsistently in AVHRR and ATSR. Note that due to technical\nproblemswith the sensor, data points during the first 6months\nof 1996 are missing from the ATSR time series.\n3.3. Removing the Seasonal Cycle and El Nin˜o\n[25] To examine climate trends, we analyze data\nobtained by removing the seasonal cycle and El Nin˜o\nfrom the global average SST. The result is an anomaly\nfield that describes climate trends due to processes other\nthan these two most dominant modes of variability,\nincluding the enhanced greenhouse effect and natural\nvariability due to, for example, a coupling with the North\nAtlantic Oscillation, of which there is evidence in figures\nnot shown in this paper. Similar procedures were carried\nout by Christy and McNider [1994] and Wigley [2000]\nusing global data, and in regional studies by Salinger et al.\n[1995] and Zheng et al. [1997]. In this paper, we use a\ndifferent methodology to produce SST anomalies, based\nupon singular value decomposition.\n[26] The seasonal cycle was calculated by averaging\nover all Januarys, Februarys, etc. A more sophisticated\ntechnique based on spectral analysis yielded a seasonal\ncycle with spectral components very similar to those\nprovided by simple averaging, indicating that the calcu-\nlation of a seasonal cycle by an averaging approach is\nadequate.\n[27] We remove El Nin˜o by linear regression of the time\nseries at each data-point onto modes derived from a\nsingular value decomposition (SVD) of SSTs from the\ntropical Pacific region. Providing that we have removed\nthe seasonal cycle adequately, the dominant mode (first\ncolumn of the EOF matrix and first row of principal\ncomponent matrix) should represent El Nin˜o. Figure 4\nshows the resultant first EOF (Figure 4a) and first princi-\npal component (Figure 4b) for AVHRR data. The large\nsignal in the eastern tropical Pacific (Figure 4a) and\ndominant peaks during 1987 and 1997 (Figure 4b) are\nrepresentative of El Nin˜o.\n[28] A linear regression between the SST anomaly time\nseries and the first principal component yields regression\nconstants amn and bmn at each spatial grid point (xm, yn)\nFigure 3. Time series of globally averaged sea-surface temperature from AVHRR (solid line) and ATSR\n(dashed line).\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n5 of 16\nC08017\nwhich are used to determine the El Nin˜o signature associ-\nated with the SST anomalies\nTENSOmnk ¼ amnP1k þ bmn;\nwhere the subscripts m and n relate to the grid point (xm, yn),\nthe subscript k represents time, and P1k represents the first\nprincipal component.\n[29] Subtracting Tmnk\nENSO from the SST at each location\nwith seasonal cycle already removed (Tmnk) yields an SST\nanomaly with El Nin˜o subtracted,\nT^mnk ¼ Tmnk \u0004 TENSOmnk ; ð1Þ\nwhere T^mnk is the required anomaly data at the spatial grid\npoint (xm, yn) that provides trends due to processes other\nthan the seasonal cycle and El Nin˜o.\n[30] Note that this procedure is similar to that followed by\nEnfield and Mestas-Nunez [1999], except that these authors\nused global data to determine their empirical orthogonal\nfunction (EOF) patterns and principal components. In that\ncase, it is necessary to employ complex EOFs, since El Nin˜o\ncould contaminate the lower modes of the ordinary EOFs. In\nour investigations, an ordinary EOF analysis is possible since\nwe evaluate the modes from the tropical Pacific region only,\nwhere El Nin˜o is by far the most important mode of\nvariability. Certainly, there is no obvious signature of El\nNin˜o in the lower EOFs and principal components.\nFigure 4. (a) First empirical orthogonal function for AVHRR data, obtained by singular value\ndecomposition of tropical Pacific SSTs, in the latitude range 30\u0001S to \u000730\u0001N and 120\u0001E to 60\u0001W.\n(b) Corresponding time series (principal component). Variability due to El Nin˜o is evident in both plots as\na high-amplitude signal. The color bar scale in Figure 4a is arbitrary. See color version of this figure in\nthe HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n6 of 16\nC08017\n[31] Once we have removed the seasonal cycle and El\nNin˜o, the analysis of trends is a straightforward linear\nregression onto the SST global average. In the remainder\nof this paper, we provide results from a time series analysis,\nleaving an analysis of patterns of change to a later paper.\n4. Results\n[32] In what follows, we describe the results of globally\naveraging AVHRR and ATSR SSTs, as the basic step\nrequired to obtain an estimate of a global SST trend. The\ndiscussion is broken down into subsections, in which we\nfirst outline the characteristics of the seasonal cycle, and\nthen go on to describe SST anomalies for the two space\nsensors. Part of the process of our analysis involves a\ncomparison between AVHRR and ATSR time series, in\norder to elucidate whether a consistent trend can be found in\ndata from these independent measurement systems, or to\ndetermine whether any trend detected is seriously affected\nby the different SST retrieval methods employed for the two\nsensors. It is useful to detail this comparison between results\nfrom AVHRR and ATSR, in order to bring extra confidence\nin the trend estimates outlined in section 4.4. Finally, in this\nsection, we describe the possible impact of the 1997 El Nin˜o\nevent upon the global sea-surface temperature field, in an\ninitial analysis of the spatial patterns of climate change.\n4.1. Seasonal Cycle\n[33] As described above, we calculate globally averaged\nSST to determine the global trend. The SST field exhibits an\nasymmetry between the Northern and Southern Hemisphere\ndue to the presence of landmass and axial tilt. Therefore the\nseasonal cycle shows up in the global averages, as illustrated\nin Figure 3.\n[34] Figure 5 shows the seasonal cycles calculated using\nbasic averaging, as described in section 3, using AVHRR\n(solid line) and ATSR (dashed line) global averages. The\nseasonal cycle is very consistent between these two instru-\nments, with a correlation of greater than 0.99 and ampli-\ntudes of 1.07\u0001C(AVHRR) and 1.06\u0001C (ATSR). There is an\noffset of 0.47\u0001C between the two seasonal cycles, possibly\nreflecting differences in the SST retrieval technique used;\nfor example, the AVHRR retrieval is derived from statistical\nregression against in situ bulk SST data, while those for\nATSR are physically based using a radiative transfer model\nand atmospheric profile data resulting in the retrieval of the\nskin SST from the ATSR sensors. The skin SST is expected,\nwhen averaged, to be consistently lower than the bulk\ntemperature by several tenths of a degree [Donlon et al.,\n1999], which could indeed account for the AVHRR\/ATSR\nSST differences. Alternatively, the use of daytime data only\nfrom AVHRR, in contrast to ATSR where some nighttime\ndata are used, could have introduced a diurnal bias that will\nbe seasonal in nature. However, any differences between\nAVHRR and ATSR are taken into account when the\nseasonal cycle is removed, as we discuss later. If the mean\noffset is removed the maximum difference between AVHRR\nand ATSR seasonal cycles is approximately 4% of the\namplitude in the seasonal cycle.\n[35] We also compared the seasonal cycles derived sep-\narately for ATSR-1 and ATSR-2. The correlation between\nthese is also greater than 0.99. The seasonal cycles exhibit\nan average offset of approximately 0.5\u0001C, possibly because\nthe 1991 Pinatubo eruption gives rise to a cooler seasonal\ncycle when using ATSR-1 data, while the 1997 El Nin˜o\nevent leads to the calculation of a warmer seasonal cycle\nfrom ATSR-2. If this offset is taken into account in\ncomparing the seasonal cycles derived from ATSR-1 and\nFigure 5. Seasonal cycles for AVHRR (solid line) and ATSR (dashed line) obtained from simple\naveraging. The seasonal cycles are in phase and have similar amplitude, indicating some consistency\nbetween these instruments.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n7 of 16\nC08017\nATSR-2, we obtain an average difference of 0.04\u0001C.\nAndersen et al. [2002] noticed a similar offset.\n[36] The fact that the seasonal cycles derived from an\naveraging process are consistent across the individual\ninstruments and measuring systems provides some evi-\ndence that there is limited bias in the time series associated\nwith the globally averaged SST field. Any bias that does\nexist shows up as a constant offset between the various\ndata sets, possibly due to differences between the retrieval\nschemes. In the case of ATSR-1 and ATSR-2, the seasonal\ncycle derived across the full-range time series of ATSR\ndata is consistent with that obtained from ATSR-1 or\nATSR-2 alone, but offsets will be introduced into the\ncalculation of temperature anomalies if the full-range\nseasonal cycle is used to calculate the ATSR SST anoma-\nlies. In what follows, when considering ATSR data, we\nderive seasonal cycles separately for the two instruments\nfrom the freely available data. That is, for ATSR-1, a\nseasonal cycle is calculated from data during August 1991\nthrough to May 1995, and for ATSR-2 from data during\nJune 1995 through to April 1999.\n4.2. SST Anomalies\n[37] Figure 6 shows the anomaly data that result from\nremoval of the seasonal cycle, for AVHRR (solid line) and\nATSR (a dashed line is used for ATSR-1 and a dash-dotted\nline for ATSR-2), using the respective seasonal cycles to\ngenerate anomalies for ATSR-1 and ATSR-2. A spectral\nanalysis reveals no significant power at the annual period,\nso we conclude that the seasonal cycle has been satisfacto-\nrily removed from these data. At first glance, the two curves\nin Figure 6 look substantially different over the period of\nATSR data. However, closer inspection reveals some sim-\nilarity. During 1991–1993, both data sets show substantial\ncooling due to the Mount Pinatubo eruption, as indicated by\nvertical dashed lines in Figure 6, which reduces the SST\nanomaly due to the extended El Nin˜o during that period.\nThe ATSR time series seems to ‘‘recover’’ more quickly\nthan AVHRR, although it is perhaps difficult to suggest\nconclusively that either data set records an accurate SST\nduring this time. We discuss the effects of Pinatubo aerosols\nfurther in the next section. From June 1994 to July 1995, the\nATSR-1 and AVHRR anomalies follow each other very\nclosely, at which point the ATSR-1 time series ends.\n[38] Consideration of the period after the Pinatubo\neruption appears to affect the data; that is, about March\n1994 onward yields a correlation between the AVHRR and\nATSR data of 0.6, indicating good agreement between\nthese instruments. Choosing a period July 1994 to the end\nof the ATSR data yields an increased correlation of 0.65,\nrising to 0.9 or higher for various periods between 1995\nthrough to 1999. These high correlations indicate that\nAVHRR and ATSR anomalies are in phase with one\nanother overall.\n[39] During the period August 1996 to April 1999,\nAVHRR anomalies are 0.15\u0001C warmer than ATSR on\naverage, with a correlation of 0.9 indicating the broad\ncorrespondence in temperature anomaly between the two\nindependent data sets. Inspection of Figure 6 during this\nperiod indicates that the basic structure of the two data sets\nfollows the same pattern, with rises in AVHRR data being\nreflected closely by ATSR, on the whole, particularly during\nthe 1997\/1998 El Nin˜o event, until April 1999, when the\nATSR-2 time series ends.\nFigure 6. Time series of sea-surface temperature anomaly after removal of the seasonal cycles, for\nAVHRR (solid line) and ATSR (dashed line). The anomalies exhibit similar behavior, especially during\n1996–1999. Prior to this period, Mount Pinatubo aerosols contaminate the data during the period\nindicated by vertical dashed lines.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n8 of 16\nC08017\n[40] The 0.15\u0001C bias between AVHRR and ATSR appar-\nent during the period of ATSR-2 may be due to a diurnal\ncycle, which would lower the monthly average temperature\nin ATSR-2 relative to AVHRR. However, it would be\nsupposed that this should affect the ATSR-1 time series in\na similar way. We expect the diurnal cycle to have a\nseasonal element, which will feed into the calculation of\nthe seasonal cycle. Therefore, the diurnal cycle should be\neliminated (to a certain extent) when the seasonal cycle is\nremoved. The fact that there is no evident ATSR-1\/AVHRR\nbias up to the end of the ATSR-1 series in May 1995 (apart\nfrom differences resulting from Pinatubo aerosols) seems to\nindicate that the diurnal cycle has been removed adequately\nfrom the ATSR data stream, through the removal of the\nseasonal cycle. As a check, we compared anomalies from\nAVHRR nighttime and daytime data. We find no time-\ndependent change between these two data sets, indicating\nagain that there is no diurnal cycle evident in our data that\ncould influence our trend analysis. However, as pointed out\nearlier, we want to be sure that differences between two-\nchannel and three-channel retrievals do not influence our\nanalysis of global SST trends, and it is for this reason that\nwe use daytime AVHRR data throughout.\n[41] If we compute the AVHRR seasonal cycle using data\nover the period of ATSR-2 operation, that is, June 1995 to\nApril 1999, we find that AVHRR anomalies during this\nperiod are 0.15\u0001C cooler on average than those obtained\nfrom AVHRR when using the period August 1991 to April\n1999 (that is, the total range over which we have ATSR\ndata). Therefore we conclude that the ATSR-2\/AVHRR cool\nbias occurs not because of any diurnal variability, which\nmay result from the use of day-night data, but rather\nbecause a warm seasonal cycle has been subtracted from\nATSR-2 globally averaged SSTs, due to a warm bias from\nthe 1997 El Nin˜o, leading to cool anomalies for ATSR-2.\n[42] These points are important because a diurnal cycle\ncould manifest itself as a climate trend, especially when\nseveral instruments are involved, as is the case here. In this\ninvestigation, we conclude that any diurnal variations are\neliminated during the removal of the seasonal cycle, leaving\nat most a constant offset in both AVHRR and ATSR data\nsets. The case for a comparison between instruments is\nmade stronger, since we can effectively determine any bias\nintroduced by any diurnal\/seasonal variations in ATSR data\nthrough comparison with AVHRR, yielding time series from\nthese two sensors that are consistent with each other.\n[43] The fact that ATSR and AVHRR temperature anoma-\nlies are very similar throughout the post-Pinatubo period,\nwith correlations greater than 0.6, indicates that to a\nconstant offset, globally averaged ATSR-1 and ATSR-2\nSST anomalies are also consistent with one another. This\nprovides evidence to suggest that our analysis methodology\nis appropriate and that any climate trends we detect are not\ndue to inconsistencies in the ATSR retrievals, supporting the\narguments outlined in sections 2 and 3 that we can treat\nATSR data as a single time series providing we remove the\nappropriate seasonal cycle separately from each instrument.\n[44] There is a distinct value in comparing AVHRR and\nATSR data in that analyses for these two types of instrument\nare essentially independent, so that similarities in results\ncould be indicative of true warming or cooling variations.\nCertainly, an analysis of this type avoids problems associ-\nated with merged data sets, as highlighted by Hurrel and\nTrenberth [1997], or with inconsistencies in retrievals,\nwhether for the same instrument or for a series. The major\nerrors and differences between ATSR and AVHRR seem to\nderive from the way the retrievals deal with the Mount\nPinatubo eruption so that, in any case, a merged data set\nwould not necessarily yield new information during that\nperiod.\n4.3. Comparison With In Situ Data\n[45] In section 4.2, we discussed similarities between\nAVHRR and ATSR. The conclusion is that there is good\nagreement between the time series, particularly post-\nPinatubo. It is also useful to compare with in situ data as\na further check on the satellite data, particularly during\nPinatubo when AVHRR and ATSR data differ most sub-\nstantially. For this purpose, we use data from the Compre-\nhensive Ocean-Atmosphere Data Set (COADS) [Woodruff\net al., 1987] for the period 1985–1997.\n[46] Figure 7 shows globally averaged data from AVHRR\n(solid line) and from COADS (dashed line). The first point\nto note is that variations in COADS and AVHRR agree\nwell, with a correlation of 0.71 between these data over this\n13-year period. The ATSR data (not shown in this figure)\nagree less well with COADS, but nevertheless the correla-\ntion is 0.61.\n[47] The AVHRR and COADS anomalies agree well\nduring 1991–1993 (i.e., during the contamination by\nPinatubo aerosols highlighted in section 4.2), with a corre-\nlation coefficient of 0.7 possibly resulting from the changes\nto the algorithm coefficients that were made in order to deal\nwith Pinatubo aerosols. The AVHRR anomalies begin to fall\nduring January 1991, at about the same time as COADS, but\nremain positive. In both data sets the anomalies rise slightly\nduring March–June 1991, before becoming negative during\nOctober 1991, due to cooling by Pinatubo aerosols. In the\ncase of AVHRR data, this is the minimum anomaly in\nthe whole time series with a value of \u00040.36\u0001C, less than the\nCOADS value of \u00040.16\u0001C for the same point. From\nDecember 1991 to spring 1992, the anomalies rise again\ndue to the 1991\/1992 El Nin˜o and then, as El Nin˜o decays,\nthe anomalies in both data sets decrease to \u00040.23\u0001C\n(AVHRR) and \u00040.21\u0001C (COADS) during November\n1992. The AVHRR recovery from negative toward zero\nanomaly occurs during January 1994, slightly prior to rises\nin the COADS anomaly.\n[48] The net temperature decrease in COADS data from\nApril 1990 (i.e., the maximum in COADS anomalies during\n1990\/1991) to October 1991 is 0.34\u0001C, whereas the\nAVHRR data show a decrease of 0.45\u0001C over a similar\nperiod. Note that aerosols could lead to a negative bias in\nAVHRR data as pointed out by Reynolds et al. [2002] and\nZhang et al. [2004], who suggest that regions of low\nAVHRR SSTs are likely to be associated with aerosol\ncontamination. Given the uncertainty in these measure-\nments, a conclusion from this comparison between AVHRR\nand COADS may well be that AVHRR is recording a\nrealistic cooling of the climate during 1991–1993 due to\nthe Pinatubo eruption.\n[49] Subsequent to Pinatubo, from January 1994 to\nDecember 1997, the AVHRR and COADS anomalies\nfollow each other very closely, with a correlation of 0.8\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n9 of 16\nC08017\nover this 48-month period. This remarkably high value\nillustrates the phase relationship between the two data sets,\nin which rises and falls in COADS data are matched closely\nby those in AVHRR.\n[50] The behavior of SST anomalies in AVHRR or\nCOADS is different than that exhibited by ATSR (see\nFigure 6), in which anomalies depart from the AVHRR\ntime series during May 1993. While there are differences in\nthe times at which the SST anomalies rise and fall during\nPinatubo, the rate of change in ATSR anomalies is similar to\nthat displayed in AVHRR. The indication appears to be that\nthe cooling\/warming phase during 1991–1994 is captured\nby ATSR, but that either the dual-angle view or the SST\nretrieval process could be underemphasizing the extent of\nthe cool phase represented in AVHRR or COADS data.\nNevertheless, the conclusion in this comparison with in situ\ndata is that both AVHRR and ATSR record climate varia-\ntions well and are therefore useful in establishing global\nclimate trends.\n4.4. Trend Analysis After Removing El Nin˜o Signal\n[51] In order to explore climate trends further, we take\nthe SST anomalies outlined above and remove the effects\nof El Nin˜o using the method described in section 3.\nFigure 8a shows the global SST anomaly field for\nDecember 1997 after the removal of El Nin˜o, derived\nfrom AVHRR, and Figure 8b shows the difference\nbetween this and the original field (Figure 1b). The\nindication is that El Nin˜o was successfully removed from\nthese data. We also analyzed ATSR data in the same way,\nwith similar results. Figure 9 shows the globally averaged\nanomalies (seasonal cycle and El Nin˜o removed) for\nAVHRR (solid line) and ATSR (dashed line). For clarity,\na 12-point moving average was used to remove higher-\nfrequency variations from the data.\n[52] To demonstrate any trend, we fit a straight line\nthrough the data. Not only are the anomalies from AVHRR\nand ATSR qualitatively similar, particularly during 1996–\n2000, but also the trend lines have a comparable gradient (in\nunits of \u0001C per decade) of 0.09 (AVHRR) and 0.13 (ATSR).\nWe note here that if we add 0.15\u0001C to ATSR-2 data prior to\nthe removal of El Nin˜o, as discussed in the context of Figure\n6, we obtain much closer agreement between AVHRR and\nATSR, with ATSR providing a trend estimate of 0.09\u0001C per\ndecade identical to that of AVHRR.\n[53] In the case of both AVHRR and ATSR, excursions\nfrom the straight line are similar in magnitude to the\nestimate of trend during the period of this study. In order\nto determine the validity of fit and the accuracy of fit\ncoefficients, we adopt the method of Casey and Cornillon\n[2001] to estimate the standard error in the globally aver-\naged data. The average error was found to be 0.16\u0001C for\nAVHRR data and 0.14\u0001C for ATSR. In the case of both\nAVHRR and ATSR the goodness-of-fit parameters were\nclose to unity, indicating that given the above errors, the\nestimates of trends using these satellite data are reasonable.\nThe associated error in the straight-line fit coefficients was\nfound to be 0.03\u0001C per decade for AVHRR and 0.06\u0001C per\ndecade for ATSR. These values agree well with the errors\nestimated by Casey and Cornillon [2001] for surface data.\nSubject to these errors, the trends estimated from AVHRR\nor ATSR are consistent with each other and also with\nestimates from other sources. The Intergovernmental Panel\non Climate Change (IPCC) report [Houghton et al., 2001]\ngives a value of about 0.06 ± 0.02\u0001C per decade, estimated\nfrom a wide range of in situ data over the period 1860 to\nFigure 7. Time series of AVHRR (solid line) and COADS (dashed line) SST anomalies during the\nperiod 1985–1997. The data have been smoothed for clarity using a six-point moving average. The two\ncurves follow each other closely, with a correlation coefficient of 0.77.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n10 of 16\nC08017\n2000. Using data from 1960 to 1990, Casey and Cornillon\n[2001] obtained a trend estimate of 0.09 ± 0.03\u0001C per\ndecade from long-term COADS data and 0.14 ± 0.04\u0001C\nper decade from the World Ocean Atlas. An average of\nvalues taken from Andersen et al. [2002] yields 0.1\u0001C per\ndecade for ATSR over the period August 1991 to June 1998,\nagreeing well with previous studies.\n4.5. Effects of El Nin˜o on Patterns of Climate Change\n[54] The discussion thus far has surrounded a time series\nanalysis of globally averaged data. It is interesting to\ninvestigate also patterns of climate variability and change,\nfor which satellite data are particularly useful, since they\nprovide data that are consistent, continuous, and global in\nnature. As part of our investigation, we analyzed the effect\nof El Nin˜o upon the global patterns of SST variability\nduring 1997\/1998. An interesting result of this is that the\nhigh SST anomaly occurring during 1997 (Figure 6) is\nbiased by a general increase in surface temperature globally\nduring that year. Removing only the equatorial Pacific\ncomponent reduces the global average temperature anomaly,\nbut only by about 35%. The remaining 65% of the warming\nduring 1997 comes from regions outside the tropical Pacific,\nas illustrated in Figure 10, which shows the global SST\nanomaly (seasonal cycle only removed) for December 1997\nusing AVHRR data. The additional in-crease in SST occurs\nover parts of the Indian Ocean, particularly off the Somalian\ncoast, the extratropical north and south Pacific, and with a\ncomponent along the eastern boundary of the Pacific\npossibly associated with Kelvin wave activity, or more\nlikely related to a mass movement of water associated with\nchanges in trade winds. In order to remove the effects of El\nNin˜o more completely from the global data, we must take\nthe approach that led to Figure 9 of projecting the first\nprincipal component onto each data point globally, rather\nthan just over the tropical Pacific.\nFigure 8. (a) Global SST anomaly field after the removal of El Nin˜o for December 1997 and (b) the\ndifference between this and the original field. The color bar scale representing temperature in \u0001C is the\nsame for both plots. These plots were derived from AVHRR data, but similar results are obtained from\nATSR. The plots illustrate the reduction of El Nin˜o during this month by regression onto the first\nprincipal component. See color version of this figure in the HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n11 of 16\nC08017\n[55] We obtain a similar result using ATSR data, which,\ntogether with the fact that we see no such high global\nanomalies during other El Nin˜o years, may indicate that this\nis a real climatic effect rather than it being a product of our\nanalysis. Hansen et al. [1999] identified a similar warming\nin analyzed data from the Goddard Institute for Space\nStudies model (GISS) [Hansen et al., 1983], suggesting\nthat this is due to decadal scale processes in the oceans. This\nFigure 9. Globally averaged anomalies after removal of the seasonal cycle and El Nin˜o for AVHRR\n(solid line) and ATSR (dashed line). For clarity, a 12-point moving average was used to remove higher-\nfrequency variations from the data. The reduction in El Nin˜o anomalies can be seen by comparison with\nFigure 6, which has the same vertical axis scale. The trend lines for AVHRR and ATSR for Figure 9a are\n0.09 and 0.13\u0001C per decade, respectively.\nFigure 10. Global SST anomaly for December 1997 when the seasonal cycle only is removed from\nAVHRR data. The plot illustrates warming across the globe that may be associated with El Nin˜o. In\nparticular, there is an increase in SST over parts of the Indian Ocean, and the extratropical north and south\nPacific. The color bar scale is in \u0001C. See color version of this figure in the HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n12 of 16\nC08017\nmay be the case; however, it is interesting to note that we\ncan see a possible global impact of the 1997 El Nin˜o event\nif we further analyze AVHRR data. Figure 11 shows a\ncorrelation plot of SST anomaly (seasonal cycle only\nremoved) with the first principal component (that is, asso-\nciated with El Nin˜o). In order to highlight possible global\neffects of the 1997 El Nin˜o, we use principal component\ndata over the range January 1994 to December 2000, i.e.,\neliminating data occurring during Mount Pinatubo. Corre-\nlations higher than 0.9 occur over the regions highlighted\nfor Figure 10, indicating a time variability there that is\nsimilar to that of the 1997 El Nin˜o. It is therefore possible\nthat the processes leading to the warming of the tropical\nPacific due to an intensification of Pacific SSTs during 1997\nare also contributing to an increase in temperature on a\nmore global scale. However, whether El Nin˜o-related pro-\ncesses have indeed led to the global high SST anomaly\nduring 1997\/1998, as found in the time series of Figure 6, is\nambiguous in this analysis. In addition to high positive\ncorrelations, we also find high negative correlations, partic-\nularly over the Atlantic Ocean. Therefore the variability\nthere is in anti-phase with El Nin˜o. Using GISS data,\nHansen et al. [1999] also identified a cooling of the Atlantic\nduring El Nin˜o, with which our results are in good\nagreement.\n[56] Further evidence of an increased SST globally due to\nEl Nin˜o comes from an analysis of SST anomaly (seasonal\ncycle only removed) for October 1998 (Figure 12), which\nindicates a high SST anomaly over the whole of the Atlantic\nOcean. If we plot a correlation map between SST anomaly\nFigure 11. Correlation plot of sea-surface temperature anomaly (seasonal cycle only removed) with the\nfirst principal component (January 1994 to December 2000) associated with El Nin˜o. Correlations higher\nthan 0.9 indicate a time variability similar to that of the 1997 El Nin˜o. These high correlations occur over\nregions of positive SST anomaly shown in Figure 10. See color version of this figure in the HTML.\nFigure 12. Sea-surface temperature anomaly for October 1998, obtained by removal of the seasonal\ncycle. A high SST anomaly occurs over much of the Atlantic Ocean. The color bar scale is in \u0001C. See\ncolor version of this figure in the HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n13 of 16\nC08017\nand the first principal component, we find maximum\ncorrelations of greater than 0.9 over much of the Atlantic,\nincluding the extratropics, at a lag of 10 months, as\nillustrated in Figure 13. This lag corresponds to the timing\nbetween the maximum of El Nin˜o during December 1997\n(see Figure 6) and the high Atlantic SST variability found in\nFigure 12. We again reason that the temporal variability of\nSSTs over the Atlantic is similar to that of El Nin˜o, this time\nlagging by 10 months. A conclusion one could draw is that\nEl Nin˜o is influencing SST globally, with a lag that could\ndepend upon teleconnection timescales. As commented\npreviously, it is uncertain whether El Nin˜o has indeed\ninfluenced SST globally, although a modeling study or\ninvestigation of analyzed data could provide further clues\nas to the causes of increased SST globally during 1997\/\n1998, as discussed also by Hansen et al. [1999]. How-\never, even a simple comparison of SST in Figure 1a\n(October 1996) with Figure 1b (October 1997) does\nindicate an increase in SST globally, and it is this\nincrease that comes out in our analysis.\n5. Discussion and Conclusions\n[57] We have investigated climate trends, using two\nindependent satellite SST data-sets. After removing the\nseasonal cycle and effects due to El Nin˜o, the temperature\nanomalies during the overlap period in the two data sets\nexhibit similar features after the Mount Pinatubo eruption.\nWe deduce an ocean SST increase of 0.09 ± 0.03\u0001C per\ndecade for AVHRR and 0.13 ± 0.06\u0001C per decade for\nATSR, indicating some consistency between these instru-\nments and also with previous studies.\n[58] The trend of increasing temperature apparent in\nFigure 9 is due to one or more of the following: instrumen-\ntal drift, residual effects of El Nin˜o, effects of Pinatubo\naerosols, the processing method used to derive the SSTs\nfrom satellite, natural climatic processes, or human-induced\nclimate change. We explore each of these, in turn, below.\n[59] One important aspect of our work was the comparison\nof threedata sets, twofromsatellite sensorsandonefrominsitu\nmeasurements. In comparing these data, we were able to\nconclude that diurnal variations were adequately removed\nand that the observed climate variations are realistic, rather\nthan relating to a characteristic of the measurement system.\nTherefore the first of these reasons for a positive trend, that of\ninstrumental drift,we canperhaps discount, sincewe areusing\nindependentmeasurement systems,whichgivesimilar results.\n[60] As regards the second point, there is the possibility\nthat the AVHRR warm anomaly of 0.14\u0001C during 1998 in\nFigure 9 may be due to an El Nin˜o remnant. On the other\nhand, it may be equally true that it is due to processes other\nthan El Nin˜o. However, artificially reducing this component\nto zero over the period 1996–2000 (i.e., one third of the\nwhole data range) nevertheless gives a warming trend of\n0.04\u0001C per decade, which is still significant.\n[61] With regard to the effects of the Pinatubo aerosols on\nthe satellite measurement, we note that a comparison of the\nAVHRR time series with in situ data from COADS indicates\na time variation of cooling\/warming during 1991–1994 that\nis very consistent. Notwithstanding any differences between\nCOADS and ATSR, particularly during Pinatubo, the con-\nclusion in section 4 was that all three data sets provide\naccurate measurements that are useful in global change\nanalyses, despite the cooling due to Pinatubo.\n[62] The fourth point, namely the effects of processing\nmethodology, is the most difficult to assess. One problem is\nthat we are examining climate trends with a gradient of the\nsame order as the maximum excursions in the data, and one\ncould suppose that these excursions occur due to the SST\nretrieval. If it were the retrieval that gives rise to the\nfluctuations found in Figure 9, we presume that independent\ninstruments would provide an anomaly time series that\nFigure 13. A correlation map between SST anomaly and the first principal component associated with\nEl Nin˜o (January 1996 to December 2000). Maximum correlations of greater than 0.9 occur over much of\nthe Atlantic at a lag of 10 months, which corresponds to the timing between the maximum of El Nin˜o\nduring December 1997 and the high Atlantic SST variability found in Figure 12. This may be indicative\nof SST variability over the Atlantic that is similar to that of El Nin˜o, at a lag of 10 months. See color\nversion of this figure in the HTML.\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n14 of 16\nC08017\nexhibits different characteristics. Since the anomaly time\nseries from AVHRR and ATSR yield similar results, we\nreason that the trend we have calculated is associated more\nwith natural climatic processes and fluctuations rather than\nwith the instrument or the processing of SSTs. Certainly, the\nfact that the anomalies in Figure 9 are so similar for both\ninstruments is unexpected and encouraging, and perhaps\nindicates that we are seeing a true trend toward increased\nocean temperatures or else atmospheric effects that influ-\nence AVHRR and ATSR to almost the same degree, which\nwould be surprising given the differences between the\ninstruments and retrieval methodology. This latter point is\nparticularly unlikely given the close correspondence\nbetween COADS and AVHRR SSTs.\n[63] Therefore we conclude that the positive trend seen in\nFigure 9 is representative of a true increase in ocean SST,\nespecially as the trends in AVHRR and ATSR data are\nsimilar. However, within the scope of this analysis, it is not\npossible to deduce whether this trend is due to natural or\nhuman-induced processes, or whether the trend is simply a\nmanifestation of the fluctuations in the anomaly time series.\nA related point of concern is whether or not effects from La\nNin˜a provide a cooling of global SST that is reflected in the\ntime series, but not in our analysis methodology. However,\nLa Nin˜a does not occur at the same times as cool phases in\nFigure 9, and so we discount this possibility. It is interesting\nto note here that plans are being developed to reprocess\nATSR data, so that it will be possible to undertake a study\nsimilar to this one with a longer and very consistent set of\ndata. Using these data and comparing with the already\navailable AVHRR data, it should be possible to allow for\nthe effects of La Nin˜a, in a similar way as was done for\nEl Nin˜o.\n[64] One important aspect of our analysis (and indeed\nmany analyses of satellite-derived SST) is that fluctuations\nin the anomalies are larger than the derived trend, putting\nsome limit upon the accuracy of the trend. As pointed out,\nthese fluctuations may be natural in origin, so that any\nobserving system will be affected in a similar way. How-\never, the error analysis that we performed when estimating\nthe trend line provides an error in trend of about 0.03\u0001C per\ndecade, indicating an increase in SST of at least 0.06\u0001C per\ndecade obtained from these satellite data. Therefore, when\nthe fluctuations about the trend line are natural, the globally\naveraged SST field obtained from these satellite data is\nnevertheless increasing by this amount overall, over the\nperiod of our data, regardless of the processes that drive that\ntrend. Furthermore, if we propose the techniques and results\ngiven here as a ‘‘proof of concept’’ exercise, then the\nlonger-term measurements to be provided by satellites in\nthe future should help to make the estimates more accurate.\nAt present, the results we have provided can be used for\ncomparison with independent observations and model\nresults to give more confidence in the variability and trends\nderived from other data sources, such as those used by the\nIPCC and other organizations.\n[65] Finally, we have started to investigate spatial patterns\nassociated with the temperature anomalies. Specifically, we\nlooked at possible global effects of El Nin˜o and concluded\nthat the 1997 event appears to have affected SST globally at\nlead times of up to 10 months. We partially took these\neffects into account by a lag 0 regression of SSTs onto the\nfirst principal component associated with El Nin˜o. What-\never the causes of the high global SST anomalies during\n1997\/1998 identified in Figures 10–13, it is clear that the\neffects need to be taken into account when investigating\nclimate change. For example, if it is anthropogenic change\nthat is under consideration, then allowance may need to be\nmade for natural processes such as El Nin˜o, as was done\nhere.\n[66] In conclusion, we suggest that this analysis of global\nsatellite data provides new quantitative details of global\nclimate change unavailable through any other observational\nmeans. We are able not only to generate an estimate of\nglobal SST trend, but also to begin to analyze spatial\npatterns of change. In this paper, we have analyzed the\nnatural changes due to El Nin˜o, and attempted to remove\nthese to look at residual trends. However, it is clear that a\ngreat deal of further work remains, particularly as regards\nthe fingerprinting of climate change. In a further paper, we\nhope to revisit this aspect, comparing patterns of change\nwith those from long-term predictions.\n[67] Acknowledgments. The AVHRR Oceans Pathfinder SST data\nwere obtained from the Physical Oceanography Distributed Active Archive\nCenter (PO-DAAC) at the NASA Jet Propulsion Laboratory, Pasadena,\nCalifornia (http:\/\/podaac.jpl.nasa.gov). We acknowledge the Rutherford\nAppleton Laboratory, ESA, and the NERC Post-Launch Support\nProgramme at RAL, through which the ATSR data products were supplied.\nReferences\nAllen, M. R., C. T. Mutlow, G. M. C. Blumberg, J. R. Christy, R. T.\nMcNider, and D. T. Llewellyn-Jones (1994), Global change detection,\nNature, 370, 24–25.\nAndersen, O. B., P. Knudsen, and B. Beckley (2002), Monitoring sea-level\nand sea-surface temperature trends from ERS satellites, Phys. Chem.\nEarth, 27, 1413–1417.\nCasey, K. S., and P. Cornillon (2001), Global and regional sea surface\ntemperature trends, J. Clim., 14, 3801–3818.\nChristy, J. R., and R. T. McNider (1994), Satellite greenhouse signal,\nNature, 367, 325.\nCorti, S., F. Molteni, and T. N. Palmer (1999), Signature of recent climate\nchange in frequencies of natural atmospheric circulation regimes, Nature,\n398, 799–802.\nCracknell, A. P. (1997), The Advanced Very High Resolution Radiometer,\nTaylor and Francis, Philadelphia, Pa.\nDonlon, C. J., T. J. Nightingale, T. Sheasby, J. Turner, I. S. Robinson, and\nW. J. Emery (1999), Implications of the oceanic thermal skin temperature\ndeviation at high wind speed, Geophys. Res. Lett., 26, 2505–2508.\nEdwards, T., et al. (1990), The Along Track Scanning Radiometer measure-\nment of sea-surface temperature from ERS-1, J. Br. Interplanet. Soc., 43,\n160–180.\nEnfield, D. B., and A. M. Mestas-Nunez (1999), Multiscale variabilities in\nglobal sea surface temperatures and their relationships with tropospheric\nclimate patterns, J. Clim., 12, 2719–2733.\nEvans, R., and G. Podesta (1996), AVHRR Pathfinder SST approach and\nresults, Eos Trans. AGU, 77(46), Fall Meet Suppl., F354.\nHansen, J., G. Russell, D. Rind, P. Stone, A. Lacis, S. Lebedeff, R. Ruedy,\nand L. Travis (1983), Efficient three-dimensional global models for cli-\nmate studies: Models I and II, Mon. Weather Rev., 111, 609–662.\nHansen, J., R. Ruedy, J. Glascoe, and M. Sato (1999), GISS analysis of\nsurface temperature change, J. Geophys. Res., 104, 30,997–31,022.\nHansen, J., R. Ruedy, M. Sato, M. Imhoff, W. Lawrence, D. Easterling,\nT. Peterson, and T. Karl (2001), A closer look at United States and global\nsurface temperature change, J. Geophys. Res., 106, 23,947–23,963.\nHoughton, J. T., et al. (Eds.) (2001), Climate Change 2001, Cambridge\nUniv. Press, New York.\nHurrel, J. W., and K. E. Trenberth (1997), Spurious trends in satellite MSU\ntemperatures from merging different satellite records, Nature, 386, 164–\n167.\nKidwell, K. (1995), NOAA Polar Orbiter User’s Guide, Natl. Clim. Data\nCent., Washington, D. C. (Available at http:\/\/www2.ncdc.noaa.gov\/POD)\nKilpatrick, K. A., G. P. Podesta, and R. Evans (2001), Overview of the\nNOAA\/NASA Advanced Very High Resolution Radiometer Pathfinder\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n15 of 16\nC08017\nalgorithm for sea surface temperature and associated matchup database,\nJ. Geophys. Res., 106(C5), 9179–9197.\nPalmer, T. N. (1999), A nonlinear dynamical perspective on climate change,\nWeather, 48, 313–348.\nRao, C. R. N. (1993), Degradation of the visible and near-infrared channels\nof the Advanced Very High Resolution Radiometer on the NOAA-9\nspacecraft: Assessment and recommendations for corrections, NOAA\nTech. Rep., NESDIS-70, 25 pp.\nReynolds, R. W., N. A. Rayner, T. M. Smith, D. C. Stokes, and W. Wang\n(2002), An improved in situ and satellite SST analysis for climate,\nJ. Clim., 15, 1609–1625.\nSalinger, M. J., R. E. Basher, B. B. Fitzharris, J. E. Hay, P. D. Jones, J. P.\nMacVeigh, and I. Scmidely-Leleu (1995), Climate trends in the southwest\nPacific, Int. J. Climatol., 12, 285–302.\nSchwalb, A. (1978), The TIROS-N\/NOAA A-G Satellite Series, Tech.\nMemo. NESS 95, Natl. Oceanic and Atmos. Admin., Silver Spring, Md.\nSchwalb, A. (1982), Modified version of the TIROS N\/NOAA A-G\nSatellite Series (NOAA E-J)—Advanced TIROS N (ATN), NOAA Tech.\nMemo. NESS 116, Natl. Oceanic and Atmos. Admin., Silver Spring,\nMd.\nVasquez, J., A. V. Tran, R. Sumagaysay, and E. Smith (1996), NOAA\/NASA\nAVHRR Oceans Pathfinder Sea Surface Temperature User Reference\nManual, Jet Propul. Lab., Pasadena, Calif.\nWigley, T. M. L. (2000), ENSO, volcanoes and record-breaking tempera-\ntures, Geophys. Res. Lett., 27, 4101–4104.\nWoodruff, , S. D. R. J. Slutz, R. L. Jenne, and P. M. Steurer (1987), A\ncomprehensive ocean-atmosphere data set, Bull. Am. Meteorol. Soc., 68,\n1239–1250.\nZhang, H.-M., R. W. Reynolds, and T. M. Smith (2004), Bias characteristics\nin the AVHRR sea surface temperature, Geophys. Res. Lett., 31, L01307,\ndoi:10.1029\/2003GL018804.\nZheng, X., R. E. Basher, and C. S. Thompson (1997), Trend detection in\nregional-mean temperature series: Maximum, minimum, mean, diurnal\nrange and SST, J. Clim., 10, 317–326.\n\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\u0004\nS. P. Lawrence, D. T. Llewellyn-Jones, and S. J. Smith, Department of\nPhysics and Astronomy, Space Research Centre, University of Leicester,\nLeicester, LE1 7RH, UK. (spl5@le.ac.uk; dlj1@le.ac.uk; sts@star.le.ac.uk)\nC08017 LAWRENCE ET AL.: CLIMATE CHANGE IN AVHRR\/ATSR DATA\n16 of 16\nC08017\n"}