{"doi":"10.1007\/s10653-006-9076-7","coreId":"62773","oai":"oai:nora.nerc.ac.uk:3472","identifiers":["oai:nora.nerc.ac.uk:3472","10.1007\/s10653-006-9076-7"],"title":"A health risk assessment for fluoride in Central Europe","authors":["Fordyce, Fiona","Vrana, K.","Zhovinsky, E.","Povoroznuk, V.","Toth, G.","Hope, B.C.","Iljinsky, U.","Baker, J."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007","abstract":"Like many elements, fluorine (which generally occurs in nature as fluoride) is beneficial to human health in trace amounts, but can be toxic in excess. The links between low intakes of fluoride and dental protection are well known; however, fluoride is a powerful calcium-seeking element and can interfere with the calcified structure of bones and teeth in the human body at higher concentrations causing dental or skeletal fluorosis. One of the main exposure routes is via drinking water and the World Health Organisation currently sets water quality guidelines for the element. In Central Europe, groundwater resources that exceed the guideline value of 1.5 mg l-1 are widespread and effects on health of high fluoride in water have been reported. The aim of the current project was to develop a geographic information system (GIS) to aid the identification of areas where high-fluoride waters and fluorosis may be a problem; hence, where water treatment technologies should be targeted. The development of the GIS was based upon the collation and digitisation of existing information relevant to fluoride risk in Ukraine, Moldova, Hungary and Slovakia assembled for the first time in a readily accessible form. In addition, geochemistry and health studies to examine in more detail the relationships between high-fluoride drinking waters and health effects in the population were carried out in Moldova and Ukraine demonstrating dental fluorosis prevalence rates of 60–90% in adolescents consuming water containing 2–7 mg l-1 fluoride","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62773.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3472\/1\/A_health_risk_assessment_for_fluoride_in_Central_Europe_final.pdf","pdfHashValue":"0929629b7e642d5b05052ebbd8e791a8403763af","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3472<\/identifier><datestamp>\n      2012-11-22T11:51:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3472\/<\/dc:relation><dc:title>\n        A health risk assessment for fluoride in Central Europe<\/dc:title><dc:creator>\n        Fordyce, Fiona<\/dc:creator><dc:creator>\n        Vrana, K.<\/dc:creator><dc:creator>\n        Zhovinsky, E.<\/dc:creator><dc:creator>\n        Povoroznuk, V.<\/dc:creator><dc:creator>\n        Toth, G.<\/dc:creator><dc:creator>\n        Hope, B.C.<\/dc:creator><dc:creator>\n        Iljinsky, U.<\/dc:creator><dc:creator>\n        Baker, J.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Like many elements, fluorine (which generally occurs in nature as fluoride) is beneficial to human health in trace amounts, but can be toxic in excess. The links between low intakes of fluoride and dental protection are well known; however, fluoride is a powerful calcium-seeking element and can interfere with the calcified structure of bones and teeth in the human body at higher concentrations causing dental or skeletal fluorosis. One of the main exposure routes is via drinking water and the World Health Organisation currently sets water quality guidelines for the element. In Central Europe, groundwater resources that exceed the guideline value of 1.5 mg l-1 are widespread and effects on health of high fluoride in water have been reported. The aim of the current project was to develop a geographic information system (GIS) to aid the identification of areas where high-fluoride waters and fluorosis may be a problem; hence, where water treatment technologies should be targeted. The development of the GIS was based upon the collation and digitisation of existing information relevant to fluoride risk in Ukraine, Moldova, Hungary and Slovakia assembled for the first time in a readily accessible form. In addition, geochemistry and health studies to examine in more detail the relationships between high-fluoride drinking waters and health effects in the population were carried out in Moldova and Ukraine demonstrating dental fluorosis prevalence rates of 60–90% in adolescents consuming water containing 2–7 mg l-1 fluoride. <\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3472\/1\/A_health_risk_assessment_for_fluoride_in_Central_Europe_final.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Fordyce, Fiona; Vrana, K.; Zhovinsky, E.; Povoroznuk, V.; Toth, G.; Hope, B.C.; Iljinsky, U.; Baker, J..  2007  A health risk assessment for fluoride in Central Europe.   Environmental Geochemistry and Health, 29 (2). 83-102.  https:\/\/doi.org\/10.1007\/s10653-006-9076-7 <https:\/\/doi.org\/10.1007\/s10653-006-9076-7>     \n <\/dc:identifier><dc:relation>\n        http:\/\/ejournals.ebsco.com\/Article.asp?ContributionID=11194980<\/dc:relation><dc:relation>\n        doi:10.1007\/s10653-006-9076-7<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3472\/","http:\/\/ejournals.ebsco.com\/Article.asp?ContributionID=11194980","doi:10.1007\/s10653-006-9076-7"],"year":2007,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"A health risk assessment for fluoride in Central Europe \n \nF. M. Fordyce1 8, K. Vrana2, E. Zhovinsky3, V. Povoroznuk4, G. Toth5, B. C. Hope1, \nU. Iljinsky6 and J. Baker7 \n \n1 British Geological Survey, West Mains Road, Edinburgh EH9 3LA, UK  \n2  HYDEKO-KV, Planckova 4, 851 01 Bratislava, Slovakia \n3 Institute of Geochemistry, Mineralogy and Ore Formation, National Academy of Sciences of \nUkraine, 3 4 Palladin Prospect, Kiev 142, 252680 Ukraine \n4 Institute of Gerontology AMS Ukraine, 67 Vyshgorodska Street, Kiev, 254114 Ukraine \n5 Niobium BT, Mimoza ut 14, H-1146 Budapest, Hungary \n6 Association of State Geologists, Moldova, 156 Metropolita Dorofeja Street, Chisinau, Moldova \n7 Selor eeig, Saffierstraat 101c, 1074 GP Amsterdam, The Netherlands \n8 Author for correspondence (e-mail fmf@bgs.ac.uk) \n \n \nKeywords: dental fluorosis, fluoride, GIS, Hungary, Moldova, Slovakia, risk \nassessment, Ukraine, water   \n \n \n \nAbstract \n \nLike many elements, fluorine (which generally occurs in nature as fluoride) is \nbeneficial to human health in trace amounts but can be toxic in excess. The links \nbetween low intakes of fluoride and dental protection are well known, however, \nfluoride is a powerful calcium-seeking element and can interfere with the calcified \nstructure of bones and teeth in the human body at higher concentration causing dental \nor skeletal fluorosis. One of the main exposure routes is via drinking water and the \nWorld Health Organisation currently set water quality guidelines for the element. In \nCentral Europe, groundwater resources that exceed the guideline value of 1.5 mg L-1 \nare widespread and health effects associated with high fluoride in water have been \nreported. The aim of the current project was to develop a geographic information \nsystem (GIS) to aid the identification of areas where high-fluoride waters and \nfluorosis may be a problem, hence where water treatment technologies should be \ntargeted. The GIS development was based upon the collation and digitisation of \nexisting information relevant to fluoride-risk in Ukraine, Moldova, Hungary and \nSlovakia assembled for the first time in a readily accessible form. In addition, \ngeochemistry and health studies to examine in more detail the relationships between \nhigh-fluoride drinking waters and health effects in the population were carried out in \nMoldova and Ukraine demonstrating dental fluorosis prevalence rates of 60 – 90% in \nadolescents consuming water containing 2 – 7 mg L-1 fluoride.  \n \n \nIntroduction \n \nFluorine is the 13th most abundant naturally occurring element in the Earth’s crust and \nis the lightest member of the halogens. It is the most electronegative and reactive of \nall the elements and as a result, elemental fluorine does not occur in nature but is \nfound as fluoride mineral complexes. Fluorides account for 0.06 – 0.08% of the \nEarth’s crust but their average abundance is low (300 mg kg-1; Tebbutt 1983). Unlike \nsome of the other halogens, the majority of fluoride in the Earth’s surface is derived \nfrom rock minerals whereas other sources such as air; seawater and anthropogenic \nactivities constitute a relatively small proportion (Fuge 1988; Lahermo et al. 1991).  \n \nLike several other naturally occurring elements, fluoride can enter the human body \nvia the inhalation of air and ingestion of food and water and effect health (WHO, \n1996a). Studies carried out in the USA and Europe in the 1940s demonstrated a link \nbetween improved dental health and the introduction of fluoridated toothpaste and \nfluoridated drinking water to local communities (Dean et al. 1942). Scientists are still \nuncertain whether fluoride is essential to human health but the mechanisms of dental \nbenefaction are thought to be two-fold. During the pre-eruptive stage (i.e. during tooth \nformation in children up to 12 years old) fluoride is thought to accelerate the \nmineralisation process and can enter the mineral lattice forming fluorapatite, which is \nstronger (less soluble) than hydroxylapatite. Experiments on rats have also \ndemonstrated the activation of mineralisation and increases in dental cement growth \nіn animals receiving higher fluoride concentrations. Secondly, fluoride acts as an anti-\nbacterial agent in the mouth helping to minimise acid-attack on teeth (Brown and \nKonig 1977; Jenkins 1967; Lukomsky 1955; Pashayev et al. 1990; Petrovich et al. \n1995; Voynar 1960). \n \nIn contrast health problems associated with too much fluoride have also been widely \nreported. The detrimental effects of high-fluoride intake on the structure of dental \nhard tissue were established by Smith et al. (1931), who proved a connection between \nmottled enamel and excess fluoride in drinking water. This condition, named dental \nfluorosis, is an irregular calcification disorder of the enamel-forming cells. Fluorosed \nenamel is porous, often stained and has brown pits and in its more severe form, is \nbrittle and prone to erosion and breakage.  \n \nSubsequent investigations revealed that fluoride also affects the human skeletal \nstructure as it is a powerful calcium-seeking element. Endemic skeletal fluorosis is a \nchronic metabolic bone and joint disease caused by intake of large amounts of \nfluoride either through water or rarely from foods\/air in endemic areas. Human and \nother animal bones are composed of hydroxylapatite but this mineral and fluorapatite \nare end-members in the apatite solid solution series therefore fluoride exchanges \nreadily with the OH- ion in the apatite structure increasing the brittleness and \ndecreasing the solubility of the bone structure (Dissanayake and Chandrajith, 1999; \nSkinner, 2000). The bones of the human body are constantly resorbed and redeposited \nduring a lifetime and high fluoride intakes increase the accretion, resorption and Ca-\nturnover rates of bone tissue affecting the homeostasis of bone mineral metabolism \n(Krishnamachari, 1986). Calcification of soft tissues such as ligaments can also occur. \nAlthough approximately 80% of fluoride entering the body is excreted mainly in the \nurine, the remainder is adsorbed into body tissues from where it is released very \nslowly (WHO, 1996a). Repeated or continuous exposure to fluoride therefore causes \naccumulation of fluoride in the body. Hence fluoride is a cumulative toxin and \nalthough skeletal fluorosis commonly affects older people following long years of \nexposure, crippling forms of the disease are also seen children in endemic areas \n(WHO, 1996a).  \n \nChildren dwelling in territories with increased fluoride very often exhibit problems \nwith normal physical maturity and bone formation as a result of exposure at sensitive \ndevelopmental stages particularly the pre- and postnatal ontogenesis period, the first \nyear of life and during puberty (Vyeltishchyev, 1995). Clinical symptoms in children \ninclude rachitis, osteoporosis and disorders of the Ca homeostasis balance (Teotia et \nal., 1998).  \n \nNo effective cures are available for either form of fluorosis; however, the diseases are \npreventable if fluoride intake is controlled. \n \nFluoride concentrations in the environment are highly variable and are often \ndependent on the presence of particular types of rocks or minerals or water. For \nexample, endemic dental and\/or skeletal fluorosis have been reported in the East \nAfrican Rift Valley associated with volcanic rock types and thermal waters (Frencken \net al., 1990). In India and Sri Lanka, fluorosis is linked to fluoride-rich alkaline \ngroundwaters (Susheela, 1999; Dissanayake, 1996) and in China problems are \nassociated with high-fluoride groundwaters and inhalation of fluoride from coal \nsmoke (Zheng et al., 1999). The concentration of fluoride in most waters is controlled \nby the solubility of the main fluoride-bearing mineral fluorite (CaF2); hence waters \nthat are sodium (Na), potassium (K) and chloride (Cl) -rich and calcium (Ca) -poor \ntend to contain high fluoride concentrations. In general, groundwaters contain more \nfluoride than surface water resources due to greater contact times with fluoride-\nbearing minerals in rock-water interactions (Hem, 1992; Edmunds and Smedley, \n1996; WHO, 2000). In addition to natural sources, man disperses fluoride into the \nenvironment via aluminium and coal industries, fertiliser use and manufacturing \nprocesses (Bartram and Balance, 1996). \n \nNumerous clinical and experimental studies show a variety of influences of fluoride \non human health depending upon the content in drinking water (Gnatyuk 1988; \nGrigoryeva et al. 1993; Rozier 1999). Indeed, approximately 90% of fluoride ingested \nin water is absorbed in the gastro-intestinal tract compared to only 30 – 60% of \nfluoride in food (WHO 1996a). Research has shown that fluoride concentrations \nbetween 0 – 0.5 mg L-1 favour dental caries development whereas concentrations \nbetween 1.5 - 5 mg L-1 can result in dental fluorosis. Ingestion of 5 - 40 mg day-1 \nfluoride via drinking water can produce skeletal deformities, and knock knees (genu \nvalgum) have been reported in adolescents receiving > 10 mg day-1 in water \naccumulated from birth. However, fluoride contents of between 0.5 – 1.5 mg L-1 have \na beneficial effect, reducing caries development WHO (1996b). There is also \nevidence that the adverse health effects of fluoride are enhanced by a lack of Ca, \nvitamins and protein in the diet (Jacks et al. 1993; Li et al. 1996; Zheng et al. 1999).  \n \nIn response to the potentially harmful effects of high-fluoride waters, the World \nHealth Organisation (WHO) has set an upper drinking water quality guideline of 1.5 \nmg L-1 (Table 1). Conversely, the WHO also recommends intakes of water containing \n0.5 – 1.0 mg L-1 in the prevention of dental caries (Table 1). \n \nIn Central Europe, groundwater resources that exceed the upper guideline value of 1.5 \nmg L-1 are widespread and dental fluorosis associated with high fluoride \nconcentrations in water has been reported in Ukraine, Moldova and Hungary \n(Gnatyuk 1988; Grigoryeva et al. 1993; Povoroznuk et al., 2001; Zhovinsky and \nPovoroznuk 1998). \n \nThe aim of the current project was to develop a risk assessment GIS to produce high-\nfluoride risk maps so that water fluoride removal remediation technologies could be \ndeployed most effectively.  In the original project plan, the geographic focus centred \non Ukraine, Moldova and Hungary, however, information for Slovakia was also \nincluded as excellent geochemical data were available for Slovakia and enhanced the \noverview of fluoride risks in the study region. It should be noted that the risks of \ndental caries associated with low fluoride intakes were also considered as part of the \nproject but are not reported here. The development of the project risk assessment GIS \nwas based upon the collation and digitisation of existing information relevant to \nfluoride risk, assembled for the first time in a readily accessible form to aid water \nmanagement. In addition, geochemistry and health studies to examine in more detail \nthe relationships between high-fluoride drinking waters and health effects in the \npopulation were carried out in Moldova and Ukraine. This was the first time that the \ndental-skeletal and physiological status of the population and the hydrogeochemistry \nwere investigated simultaneously in these countries and the data contribute to a new \nassessment of fluoride risk in Central Europe. \n \n \nDevelopment of the Risk Assessment \n \nOn the basis of the current state of knowledge identified from an international \nliterature review and geochemistry and health expertise in the four study countries, an \ninitial theoretical risk framework for Central Europe was devised to aid data collation. \nThe framework was subsequently modified into a final risk assessment scheme in \nlight of the research carried out and data available for the study countries. The first \nstage of this process was to identify the likely factors controlling environmental \nfluoride and fluoride-related disease and the main indicators of fluoride-related risk. \n \nThe main factors under consideration in the initial theoretical framework were: \n \n1. Water Quality \n• Geochemical information for surface and groundwaters from the study \narea used to define regions with naturally occurring fluoride \nconcentrations that exceed WHO water quality guidelines.  \n• Assessment of other water quality parameters such as alkalinity and Ca \ncontent, which have a fundamental effect on the amount and chemical \nform of fluoride in water.  \n• Delineation of areas of anthropogenic contamination.  \n• Determination of relationships between water quality parameters, \nvolume of water consumed and health effects. \n \n2. Health Criteria \n• Information on fluorosis prevalence and the severity of fluorosis in the \nstudy countries used to indicate areas of high risk. \n• Consideration of other dietary factors that control the uptake of \nfluoride in humans, such as fluoride intake from non-water sources and \nthe amount of Ca, Vitamin D and Vitamin C in the diet. \n \n3. Hydrogeology  \n• Consideration of the importance of water resources as part of the \nscheme \n• Inclusion of water supply information  \n \n4. Population \n• Consideration of population density, as a high-density population \nliving in an area of high-fluoride drinking water represents an \ninherently greater risk than a sparse population exposed to high-\nfluoride waters. \n \n5. Geological Factors \n• Rock geochemistry exerts a major control on fluoride concentrations in \ngroundwater. Volcanic and granitic rock types, geothermally active \nareas and tectonically active zones tend to contain high concentrations \nof fluoride. Therefore, some rock types present a higher potential risk \nthan others.  \n \n \nEach of these factors, which are presented graphically in Figure 1, was assigned an \nimportance category based on the significance of the factor as a fluoride-risk \nindicator. The factors were also graded according to relative importance in terms of \ncontrolling environmental fluoride or the incidence of fluoride-related diseases. The \ninitial importance and influence categories assigned to each factor are outlined in \nTable 2. \n \nOnce the overall framework for the risk assessment was completed, the second stage \nof the project was to collate and review the relevant information from Central Europe. \nOn the basis of these reviews, several of the factors outlined in Table 2 were \ndiscounted from the final risk assessment scheme as follows: \n \n \nGeological and Tectonic Controls \n \nGeology exerts a fundamental influence on water fluoride concentrations. Certain \nrock types commonly contain high concentrations of fluoride and on this basis it is \npossible to define a crude relative risk assessment scheme based on geology. \nHowever, geological maps are a two-dimensional representation of the rock units \nappearing at surface and could give a misleading indication of likely fluoride risk as \nfluoride-rich horizons may be present at depth and deeper waters often contain more \nfluoride than shallow waters. Furthermore, high-fluoride waters are not restricted to \nindividual rock units and even within the same rock unit fluoride concentrations in \nwater can be highly variable. Therefore, it is not possible to predict, other than in \ngeneral terms, the fluoride content of water on the basis of geology alone.  \n \nTectonically active fault zones are commonly the focus of hydrothermal water \nmovement near the Earth’s surface and as such, waters in these regions often contain \nhigh fluoride concentrations. In Ukraine, high-fluoride groundwaters are associated \nwith faults in the Odessa and Lvov regions. However, not all tectonic zones produce \nhigh- fluoride groundwaters and in Ukraine, there are many other tectonic zones \nwhere high-fluoride waters are not a problem.  \nOn this basis, these data were not incorporated into the final risk assessment scheme. \nWater chemistry information was available in all four countries and was considered a \nfar more important indicator of risk.  \n \n \nHydrogeological Controls \n \nInformation on the location and importance of the main aquifers in each country was \nalso considered as part of the risk assessment. Although major aquifers used for \npublic drinking water supply constitute an inherently greater risk than minor or non-\naquifer units, it was not possible to include this information alone in the fluoride risk \nassessment because the actual risk to the population depends upon where the water is \nused and on the water quality (fluoride content). Therefore, hydrogeological maps \nwere not included in the final risk assessment. \n \n \nWater Type - Hydrogeochemical Controls \n \nThe solubility of fluoride in waters is controlled by the presence or absence of other \nelements and the major element chemistry in particular. Waters that are Na+K-\ndominated tend to contain more free fluoride in solution than Ca-dominated waters \n(Edmunds and Smedley 1996).  Human fluoride absorption from water is also \ninversely related to dietary Ca intake and high concentrations of other cations that \nform insoluble complexes with fluoride such as Mg and Al can markedly reduce \ngastrointestinal fluoride absorption (Jowsey and Riggs 1978; Whitford 1997).  \n The relationships between fluoride content and water type were considered during the \npresent study. In general, the investigations confirmed an association between high \nfluoride concentrations in water and Na+K-dominated water types. In particular, \ngroundwaters in Moldova and in the Poltava region of the Ukraine showed low Ca-\ndominance and high fluoride contents and presented a significant high-fluoride threat \nin these regions. However, high fluoride waters (> 1.5 mg L-1) occurred across a \nbroad range of Ca\/Na+K anion dominance ratios and not all Na+K-dominated waters \ncontained high fluoride contents (Fordyce and Vrana 2001).  \n \nIn some circumstances, where very high fluoride concentrations in water are \nsuspected, it may be possible to use water type as a general guide to the likely risk of \nhigh fluoride contents in water. For the purposes of the present study, however, \nfluoride water chemistry data were available therefore water type was not included in \nthe final risk assessment. \n \n \nPopulation Data \n \nIn the theoretical framework outlined in Table 2, population density was highlighted \nas a risk parameter whereby densely populated areas represent inherently higher risks \nof fluoride exposure than sparsely populated areas. Population statistics were \navailable for Slovakia and Hungary but not for Moldova and Ukraine therefore \npopulation density data was difficult to quantify for the study region, Furthermore, \nrelationships between populations at risk and fluoride in water depend upon the \nsource of the water supply. For example, an area may contain high fluoride contents \nin groundwaters and a high population density, but if the population is supplied with \nlow-fluoride water from elsewhere, the risk is significantly reduced. As a result, \npopulation density was not included the final risk assessment scheme. \n \n \nDietary Factors \n \nFluorosis prevalence is not only dependent on fluoride intake from water but is \ninfluenced by other fluoride sources in the diet and dietary composition. There were \nvery few dietary surveys available for the study countries but from the limited \ninformation available it is likely that Ca, Mg and vitamin deficiencies are prevalent in \ncommunities at risk from fluorosis (Kajaba and Bucko, 1968; Biro et al. 1996; \nZaichick et al. 1996). In Slovakia, detailed dietary studies carried out in the Ziarska \nKotlina Region associated with industrial sources of fluoride showed no evidence of \nelevated concentrations in food (Ministry of the Environment, 1998). In Hungary, the \nuse of high-fluoride waters in cooking was found to enhance levels in prepared foods \n(Schamschula et al. 1988) and Toth and Sugar (1978) concluded that the daily dietary \nintakes of fluoride from foodstuffs including the effect of cooking water were 0.096 - \n0.567 mg kg-1 day-1. \n \nThe absence of detailed information about the relationships between diet and fluorosis \non a national scale for Slovakia, Hungary and Moldova made the impact of these \nfactors difficult to quantify in the final risk assessment. Dietary factors were included \nin the national risk assessment of Ukraine based on previous studies carried out by the \nUkrainian project partners. Total dietary intakes including water were estimated at 0.5 \nmg in fluoride-poor regions, 0.8 mg in fluoride-optimal regions and 1.2 mg in high-\nfluoride regions (Povoroznuk et al., 2001). Previous studies also demonstrated that \nfluoride intake varied with climate and with the degree of physical activity of the \nperson (Groshikov 1985). The detailed dietary studies carried out as part of this \nproject in Moldova are described in this paper and constitute a valuable contribution \nto the knowledge and understanding of the links between fluorosis and diet of which \nvery few studies have been carried out internationally. \n \nThe following factors were included in the final risk assessment: \n \n \nWater Fluoride Content \n \nThe concentration of fluoride in water is one of the most important risk indictors for \nhealth outcomes. National hydrochemical data were available for Moldova \n(Association of State Geologists (ASG) data), Slovakia (State Geological Institute of \nDionyz Stur (SGUDS) data, Rapant et al. 1996) and Hungary (Hungarian Geological \nSurvey (MAFI) data, Toth 1989) (Table 3). The distribution of data points in Slovakia \nand Hungary (1 per 3 km2) were of sufficient sample density to provide information \nfor the whole country whereas data in Moldova were not evenly distributed, therefore \nin some areas of the country it was not possible to make an assessment of fluoride risk \non the basis of water chemistry. \n \nNo national hydrogeochemical data were available in Ukraine, however, geochemical \nexperts estimated the likely fluoride content in water and potential for fluoride-related \nhealth problems in different regions of the country as part of this project. More \ndetailed water chemistry information was available for four regions Kiev, Lvov, \nPoltava and Odessa (Institute of Geochemistry and Ore Mineral Formation (IGMOF) \ndata), which were examined more fully as part of the project (Fordyce and Vrana \n2001). \n \nThe framework outlined in Table 2 bases the risk assessment of fluoride \nconcentrations in water on the current WHO drinking water quality guideline of ≥ 1.5 \nmg L-1 for dental fluorosis. Geochemistry and health investigations carried out as part \nof the present study in Moldova and Ukraine confirmed that dental fluorosis occurred \nwhen water concentrations exceeded 1.5 mg L-1 (Fordyce and Vrana 2001). Therefore, \nthe water fluoride data collated for the project were included in the final risk \nassessment GIS categorised according to the WHO guideline.  \n \nHowever as indicated above, in Ukraine, evidence from previous investigations \nsuggested that in the south of the country where the climate is warmer, people drink \nmore water and fluorosis can occur at concentrations of below 1.2 mg L-1 (Groshikov \n1985). Therefore, the national assessment of fluoride risk for Ukraine carried out by \nUkrainian experts took account of fluorosis incidence at fluoride concentrations below \nthe WHO recommended guideline of 1.5 mg L-1.  \n \n \nWater Supply Information \n In addition to examining the potential for natural surface- and ground- waters to \ncontain high fluoride concentrations, in order to assess risk it was important to \ndetermine an exposure route to the population, namely whether or not the waters were \nused for drinking and if any treatments were carried out on the water prior to drinking. \nComprehensive water supply information for each country was not available to the \nproject but is held by local water engineers and operators who will be in a position to \nexamine the results of this study in more detail to initiate mitigation actions. In \nSlovakia and Hungary, for example, water is supplied by a complex mains pipeline \nsystem therefore relationships between natural groundwaters and tap drinking waters \nare difficult to quantify at the national scale. Broad-scale information on water \nsupplies as outlined in Table 4 was incorporated into the final risk assessment scheme. \n \n \nFluorosis Prevalence \n \nInformation on fluorosis prevalence in the study countries was limited. In Slovakia, \nno human incidences of fluorosis had been recorded. Dental fluorosis had been \nreported historically in three locations in Hungary associated with high-fluoride \nwaters, the water sources in these areas have since been altered and the disease is no \nlonger prevalent (Toth, 2000). In a study of 3 groups of Hungarian children aged 14 \nexposed to contrasting fluoride concentrations in drinking water, Schamschula et al. \n(1985) demonstrated a link between high fluoride contents and community fluorosis \nindex values but the index values were too low (< 0.6) to constitute a public health \nproblem.  \n No national surveys of fluorosis prevalence have been carried out in Moldova or \nUkraine. Therefore, fluorosis prevalence data for these countries were derived from \nprevious studies of particular areas and information generated by the present project. \nThe absence of information for large areas of these countries does not indicate a low \nrisk of fluorosis, rather that the problem has yet to be fully investigated. The \nprevalence information available for the study countries demonstrate that the \nrelationships between fluorosis and fluoride concentrations in the water are not simple \n(Table 5). Although it is often the case that waters containing > 1.5 mg L-1 cause \ndisease, the disease also occurs in areas where water fluoride contents are below 1.5 \nmg L-1 and this may be due to other water chemistry factors, other non-water sources \nof fluoride and dietary or physiological factors in the areas concerned. However, all \navailable fluorosis prevalence information was incorporated into the risk assessment \nscheme as this is one of the most important indicators of potential water fluoride \nproblem areas.  \n \n \nIndustrial Sources \n \nInformation on industrial sources of fluoride in the study countries was made \navailable to the project for Slovakia Hungary and Ukraine. There are no major \nindustrial sources of fluoride in Moldova, however, dispersion in the environment \ndoes occur from agricultural products (Vedina and Kreidman 1999; Toma et al. 1999). \nThe presence of industry was included in the final risk assessment as many of these \nsources do cause elevated concentrations of fluoride in surrounding surface and \ngroundwaters. In Ukraine, an assessment of two industrial regions, Chervonograd in \nthe West and Khar'kov-Dnepropetrovsk-Donetsk-Zaporozh’ye in the Centre-East of \nthe country revealed that sources related to coal mining resulted in enhanced fluoride \nin the environment of Chervonograd but had little impact on water fluoride \nconcentrations in Khar’kov-Dnepropetrovsk-Donetsk-Zaporozh’ye (Fordyce and \nVrana 2001). These findings were incorporated into the national risk assessment for \nUkraine. \n \nFollowing the review of the information available for Central Europe a simplified \napproach to the development of the GIS was adopted. \n \n \nDevelopment of the GIS \n \nIn recent years, GIS have been used increasingly in environmental epidemiology and \nare an extremely useful tool to determine spatial variability and relationships between \nenvironmental factors and health-outcomes provided that exposure routes are \nestablished (Jarup 2004). Risk assessment GIS have been developed previously for \nfluoride in Durango, Mexico where concentrations determined in tap water were used \nto categorise the city into zones of low to high risk. Exposure assessments were \ncalculated for infants, adults and children on the basis of body weight and water \nconsumption and demonstrated that 95% of the population had high fluoride intakes \nin excess of 0.05 mg kg day-1 (Ortiz et al. 1998). Apambire et al. (1997) investigating \nprevalence rates of 62 % dental fluorosis in school children in the Bolgatanga and \nBongo Districts of Ghana demonstrated that 23 % of the groundwater wells in the \nregion had concentrations above 1.5 mg L-1 F. Due to the climatic conditions, daily \nwater consumption in the population was approximately 3 to 4 L. In addition, dietary \nintake was higher than WHO baseline values (0.2-0.5 mg day-1). 'Geochemical health-\nrisk maps' were generated by contouring the water fluoride data using intake interval \nguidelines more closely aligned to regional climatic and dietary conditions, to aid \nhealth officials in the assessment of fluorosis risk. A similar spatial approach to \nassessing fluoride risk in the West Plain of Jilin Province, China has been reported by \nZhang et al. (2003). The concentration of fluoride in unconfined shallow \ngroundwaters used for drinking water across the Plain were assessed and varied from \nlow concentrations (< 0.5 mg L-1) to 10 mg L-1 in waters from three counties in the \ncentre of the Plain. Fluoride exposure from all sources was estimated on the basis of \nfood, water and air contents and demonstrated that water accounted for 90% of intake. \nExisting fluorosis prevalence data were compared to the water quality information \nand demonstrated strong positive correlations between dental and skeletal disease \nrates and water fluoride concentration. These correlation factors and the \nconcentrations in drinking water were used to develop a series of risk index factors for \nboth diseases, which were plotted across the region and highlighted the high risk \ncounties in the centre of the Plain. \n \nThese three fluoride risk assessment investigations focussed on relatively small \nsurvey areas where water data, exposure information and disease prevalence rates \ncould be collected and examined simultaneously, allowing exposure risk assessments \nto be calculated. During the present study it was not possible to collate this type of \ninformation at the national level for Central Europe. However, information on water \nsupply and fluorosis prevalence were included to give some indication of exposure in \nthe GIS risk assessment adopted.  \n \nAs outlined above, different information was available for each of the study countries \nat both national and regional scales. As a result, the project GIS, based on ArcView® \nsoftware, was designed to incorporate two different levels of information. The first or \nbasic level of the risk assessment covered the whole country in each case of Ukraine, \nSlovakia, Hungary and Moldova. The purpose of this level was to provide an \noverview of the risks of high-fluoride and highlight areas that in the opinion of the \ngeology and health experts from Central Europe, presented a known or suspected \nthreat to human health from fluoride.  \n \nThe second or more detailed level of risk assessment incorporated information from \nthe current project where the links between environmental and health factors had been \nmore closely examined at the local scale. Information at this level was available for \nthe Ziarska Kotlina Basin in Slovakia, the Falesti Region of Moldova and the Kiev, \nLvov, Poltava and Odessa Regions of Ukraine.  \n \nWithin the GIS, the final risk maps for Slovakia, Ziarska Kotlina, Hungary, Moldova, \nKiev, Poltava, Lvov and Odessa were developed using a grid-square system. \nCountries and local study regions were divided into a series of grid square polygons. \nThe size of the grid was selected on the basis of the sample density of the water \nchemistry information as in all cases this was the most comprehensive data set in each \nlocation (Table 6). Creating the grids as polygons allowed the risk attributes of the \nbasic data layers to be assigned to each grid polygon according to the final GIS risk \nassessment scheme, which is outlined in Table 7. \n \nDuring the first phase of the risk assessment, risk codes were assigned for every grid \nsquare based on the presence or absence of high fluoride in the environment indicated \nby water fluoride contents ≥ 1.5 mg L-1 and the locations of fluorosis incidence and \nindustrial sources (Table 7) using the ArcView® Query Function. The scheme \nadopted a precautionary principle approach whereby if any one of or a combination of \nthese conditions was met in a location, the location was initially assigned a high risk. \nSimilarly, in cases where both high and low fluoride waters were present in the same \nsquare, the highest fluoride value was selected.  \n \nDuring the second phase of the risk assessment, a further field was added to the grid \nattribute tables to indicate whether or not the water was used for drinking as an \nindication of exposure (Table 7). The final phase of the assessment used the \nArcView® Query Function to combine information about fluoride sources (Phase 1) \nwith the water supply information (Phase 2) to assign the final risk code to each \nsquare.  \n \nFor example, an area of historic fluorosis incidence was categorised as high risk \nduring the first phase of the assessment, however, if the population in this region no \nlonger drank the high-fluoride water, the overall risk was reduced to moderate \nindicating that although no immediate problems were evident, the situation should be \nmonitored in the future. Similarly if an industrial source was present and was known \nto cause high fluoride in the surrounding environment, the initial risk assigned was \nhigh. However, if the local population drank water from elsewhere, the overall risk \nwas reduced to moderate. The grid squares were displayed in map format and colour \ncoded according to high-fluoride risk. \n \nHigh- and low-fluoride waters sometimes occurred in the same vicinity. These \nlocations were highlighted in the scheme to show that although the risk of fluorosis \nwas high, alternative low-fluoride water sources were available locally. It should be \nnoted, however, that for the reasons outlined in the section on Geology and Tectonic \nControls above, it is not possible to guarantee that water from a new well will contain \nlow-fluoride on the basis of existing water data.  \n \nDue to the lack of national geochemistry and health data available for Ukraine, the \nfinal countrywide risk assessment map was not based on the GIS risk assessment \nscheme or on the gird square system but was compiled on the basis of the \nbiogeochemical characteristics of the different regions of Ukraine determined by local \nexperts. The map takes into account the likely fluoride content in drinking water, \nlikely total dietary fluoride intake, likely dietary intake from water, likely industrial \nsources of fluoride; the presence of high-fluoride waters associated with tectonically \nactive zones and information on the prevalence of dental fluorosis.  \n \n \nResults \n \nThe final risk assessment map for the study region is presented in Figure 2 and \ndemonstrates that the main areas of concern in terms of high-fluoride risk are located \nin Ukraine and Moldova whereas risks over Slovakia and Hungary are generally low. \nIt should be noted, however, that although coverage for Ukraine appears complete, \nthis area of the map is based on regional rather than grid-square risk classes. The \nregional classifications represent general estimates only, as information about high-\nfluoride risks in Ukraine is limited.  \n \nDespite the overwhelming evidence for effects of fluoride intake on human health, \nthere are surprisingly few studies that truly combine geochemistry and health \ninformation investigating factors such as the peak bone mass (PBM) status, bone \nstructural functional state, dental status, physical development status, gender, \nnutritional status (Ca, P and Mg in particular), gastrointestinal status, socio-economic \nand lifestyle factors in relation to environmental fluoride exposure.  \n \nGeochemistry and health investigations were carried out by local experts in two of the \nregions of concern identified in the present project to address these knowledge gaps in \nthe Central European region. Full details of these studies are available in Fordyce and \nVrana (2001) and are summarised here.  \n \n \nFalesti, Moldova \n \nThe links between high-fluoride contents in drinking water and human fluorosis were \nexamined in more detail in the towns of Kalarash, Cornesti and Falesti in Moldova, \nwhich lie in a known fluorosis hotspot region (Figure 3). Medical examinations were \ncarried out on 103 adolescents aged from 10 to 15 years (48 boys and 55 girls) from \nall three towns and 34 women residents of Falesti were also examined to establish \ntime-series differences in the dental and bone status of “mother-daughter” pairs in the \npopulation. \n \nAs part of the study, anthropometric measurements were made and nutritional status \nwas estimated by means of a questionnaire-weighing method for proteins, fats, \ncarbohydrates, amino acids, macro- and microelements and vitamins in the food \nration. The structural-functional state of bone was examined by an ultrasound \ndensitometry method, using an “Achilles+” densitometer (Lunar Corp., Medison, WI) \non heel bones consisting of trabecular (spongy) bone tissue. Dental status was \ndetermined according to CFM (sum of caries, filled and missing permanent teeth), \ncfm (the same with respect to temporary teeth) indices. Clinical forms of dental \nfluorosis were determined by means of the Patrikyeyev (1958) classifications and the \ndegree of dental fluorosis was estimated according to four categories of severity \n(Gabovych and Ovrutsky 1969).  \n \nThe population of Falesti uses approximately equal quantities of tap water and water \nfrom deep wells. In the past, 98% of water usage in the town was provided by the \ncentral public water supply system, the source of which is underground waters (21 \nartesian wells). Of these, 13 boreholes of 160-180 m depth are currently active. In \nrecent years, power-cuts and electricity shortages in Moldova have meant a reduction \nin the availability of water from these wells and today, the town also exploits \napproximately 70 shallow wells of 10 to 25 m depth. \n \nA similar situation exists in Kalarash where, in the past, the population were supplied \nwith water from a combination of deep wells (central public supply) and shallow \nwells.  There is currently a lack of electricity to run the central public supply system \nand residents are entirely dependent on water from shallow wells.  \n \nAnalysis of water (by ion selective electrode) from 2 drinking-water taps in Falesti \nand one in Kalarash during the present study indicated that the highest fluoride \ncontents were found in Falesti tap water (5.31 mg L-1) (Table 3).  \n \nFluoride concentrations in 8 well waters examined in each town were highly variable. \nIn Kalarash, well-water fluoride contents ranged from 0.19 to 3.65 mg L-1; in Falesti \nfrom 0.39 to 2.43 mg L-1 and in Cornesti water from shallow wells did not exceed \n0.88 mg L-1 fluoride (Table 8). In general, deep artesian waters contained higher \nfluoride concentrations than shallow wells. \n \nThe concentration of Ca in Cornesti well waters (determined by Inductively Coupled \nPlasma Atomic Emission Spectrometry, ICP-AES) was generally higher (66.4 – 243.0 \nmg L-1) than in Kalarash  (1.6 – 192 mg L-1) and Falesti (14.6 – 53.4 mg L-1). It was \nconcluded that the low Ca concentrations in Kalarash and Falesti were likely to \nproduce a negative influence on the calcium-phosphorus metabolism in the \npopulation of these towns and enhance the aggressive effects of fluoride. \n \nThe daily nutritional status of adolescents in all three towns did not accord with \nrecommended normal intakes to meet adolescent physiological needs (Health \nProtection Ministry, 1999). Dietary fluoride intakes for girls and boys were high for \nall three towns (Table 8) and were characterized by insufficient irreplaceable amino \nacids and proteins and by imbalances in carbohydrate, fat and vitamin consumption. \nDeficiencies in the amount of dietary Ca and P necessary for PBM formation in \nadolescents and for adequate mineralisation of the skeleton were also identified. It \nwas concluded that these factors could exacerbate the detrimental affects of fluoride \non dental and skeletal mineralisation in the region. \n \nThe results of the dental and skeletal examinations indicated that water containing \nbetween 1.5 to 5 mg L-1 provoked dental fluorosis development without any \nsignificant change in the structural-functional state of bone tissue confirming results \nof previous investigations in the international literature. The higher fluoride content in \nFalesti water (< 5.31 mg L-1) compared with Kalarash (< 3.65 mg L-1) resulted in a \ngreater prevalence of dental fluorosis and higher degree of dental injury in adolescents \nfrom Falesti (Table 8) (Figure 4).  \n \nStudies also revealed that the incidence of fluorosis in these towns was not broadly \ndistributed throughout the population but formed clusters around high-fluoride water \nsources. Interestingly other indicators of the importance of the water supply in the \ndisease were the results for ‘mother-daughter pairs’ in Falesti, which showed that \nmothers who had received water from the deeper electric pumped high-fluoride wells \nin the past had highly developed dental fluorosis whereas their daughters who now \nonly have access to the low-fluoride shallow well water showed lesser effects of the \ndisease. Similarly no dental fluorosis was observed in Cornesti adolescents as the \npopulation of this town no longer consume high-fluoride waters therefore the \nprevalence of dental fluorosis has fallen in recent years. \n However, water quality in the shallow wells is extremely poor and it is desirable that \nthe population return to drinking the deeper water as soon as possible and \ndefluoridation is recommended. \n \n \nArciz, Ukraine \n \nDuring the present study, tap-water chemistry and human dental status in a high-\nfluoride area in Odessa Region were examined in more detail. The contents of \nfluoride in waters of the region generally do not exceed 0.5 mg L-1, however, high \nvalues had been reported previously in association with a tectonically active fault \nzone in the south of the area around Tatarbunary, Arciz and Tarutino. These waters \nare Na-Cl dominated with low Ca and Mg contents rising from depth in the fault zone \n(Gabovych and Minkh 1979; Zhovinsky 1979).  \n \nAnalysis of fluoride concentrations in tap-water samples during the present study \nrevealed 2.54 mg L-1 in Arciz, 1.14 mg L-1 in Viklovo-Tarutino, 0.24 mg L-1 in Izmail \nand 0.71 – 7.13 mg L-1 in the village of Podgorny (Table 9). 97 adolescents aged 10 – \n15 years in the town of Arciz and 28 in the adjacent village of Podgorny underwent \ndental examinations using the same methods described in previous sections of this \npaper. The results demonstrated that 97% and 86% of the population in each town \nwere suffering dental fluorosis respectively (Table 9). In terms of severity, I and II \ndegree fluorosis (Gabovych and Ovrutsky 1969) were the most prevalent. However, a \ngreater proportion of adolescents in Podgorny suffered from ІІІ and IV degree dental \nfluorosis (Fordyce and Vrana 2001). \n \n \nOverview of High Fluoride Risks in Central Europe \n \nOn the basis of the information collated by Central European experts and on the \ngeochemistry and health studies carried out as part of the project, the high-fluoride \nrisks in the region were prioritised as follows:  \n \n \nHigh \nPriority \nLocation \n1. Arciz District, Odessa Region, Ukraine. \n High fluoride contents associated with upwelling mineralised water in tectonically active fault zones result in \ndental fluorosis prevalence rates of 90% in the local population. In this Region, water is abstracted from the \nNeogene aquifer and fluoride concentrations of 2 – 7 mg L-1 fluoride are reported. Fluoride removal would be \ndesirable \n2. Falesti, Prut and Chadyr-Lunga Regions, Moldova \n Moldovan groundwaters abstracted from deep horizons generally contain high concentrations of fluoride (< 16 \nmg L-1) and fluorosis prevalence in these regions reaches 80 – 90%. Although shallow low-fluoride waters are \navailable, these are heavily polluted with biological and other contaminants and it is desirable that the \npopulation is able to drink deeper waters. Fluoride removal would be desirable \n3. Poltava Region, Ukraine \n The main water bearing horizon in this region, the Buchak-Kaniv contains high (< 18 mg L-1) fluoride due to the \npresence of phosphatic deposits at shallow depths. The Buchak-Kaniv aquifer supplies 2 million people and \nPoltava Region contains the highest number of dental fluorosis hotspots in Ukraine. Although lower-fluoride \nwaters are available in deeper Cretaceous and Jurassic aquifers, exploitation at depth is prohibitively \nexpensive therefore defluoridation of shallower waters is desirable.  \n4. Chervonograd Mining District, Lvov, Ukraine \n High-fluoride waters associated with tectonically active fault zones and mining contamination result in dental \nfluorosis in the local population (64% prevalence rate). Alternative lower-fluoride waters have been supplied to \nthe public in recent years but the disease is still endemic in the region. Defluoridation technologies may be \nhelpful in this area. \n \n \nConclusions \n \n1. A number of readily available environmental datasets such as geology, \nhydrogeology and water type were considered in the risk assessment for \nCentral Europe. It was concluded that these datasets could only be used to give \na very general indication of likely risks from high-fluoride waters as \ninvestigations carried out during the present study and evidence from the \ninternational literature demonstrate that water fluoride contents are extremely \nvariable even within the same geological\/hydrogeological setting and that high \nfluoride contents occur in a variety of water types.  \n \n2. It was concluded that for Central Europe, water fluoride contents, fluorosis \nprevalence information, water supply information and anthropogenic point \nsources of fluoride were the key datasets needed to carry out a high-fluoride \nrisk assessment.  \n \n3. Using these datasets and information gathered by geochemistry and health \nstudies carried out in the region, it was possible to identify areas at risk of \ndental fluorosis in Ukraine and Moldova related to high-fluoride waters so that \nfluoride remediation technologies could be targeted most effectively. \n \n4. The information presented in this study is based on generalized data and any \nfollow-up implementation of defluoridation technologies should incorporate \ndetailed localized assessments of environmental fluoride conditions and health \neffects in the local population. In particular, information on fluorosis incidence \nand water chemistry are sparse for Ukraine and Moldova and it is \nrecommended that these areas should be the focus of future study. \n \n5. Detailed geochemistry and health studies were carried out for the first time in \nUkraine and Moldova during this project, and confirm high prevalence (60 – \n90%) of dental fluorosis with no skeletal effects in populations consuming \ndrinking water with up to 7 mg L-1 fluoride. However, these data are \npreliminary and it is recommended that further investigations be carried out to \nelucidate the relationships between water type and fluoride content, diet, \nphysiological status and fluoride-related diseases more fully. \n \n \nAcknowledgements \n \nThis work was carried out as part of the European Union INCO-COPERNICUS IC15-\nCT98-0139 ‘Water Quality Improvement Through Fluoride Reduction in \nGroundwater of Central Europe’ Project, DGXII. The authors gratefully acknowledge \npermission to use data for this study from the Geological Survey of Slovakia \n(SGUDS); the Geological Survey of Hungary (MAFI); the Association of State \nGeologists of Moldova (ASG); the Institute of Geochemistry and Ore Mineral \nFormation, Ukraine (IGMOF) and the Institute of Gerontology, Ukraine (IGAMS). Dr \nChris Johnson and Prof Barry Smith of the British Geological Survey are thanked for \ntheir comments on the text. This paper is published with permission from the Director \nof the British Geological Survey. \n \n \nReferences \n \nApambire, WB, Boyle DR and Michel, FA. 1997. Geochemistry, genesis and health \nimplications of fluoriferous groundwaters in the upper regions of Ghana. \nEnvironmental Geology, 33 (1), 13-24. \n Bartram J, Balance R. 1996. Water Quality Monitoring, a Practice Guide to the \nDesign and Implementation of Freshwater Quality Studies and Monitoring \nProgrammes. London: E&F Spon.  \n \nBiro G, Antal M, Zajkas G. 1996. Nutrition survey of the Hungarian population in a \nrandomized trial between 1992-1994. European Journal of Clinical Nutrition 50, 201-\n208.  \n \nBrown W, Konig KG. 1977. Cariostatic mechanism of fluorides. Caries Research 11 \n(Suppl 1), 1-327.  \n \nDean H, Arnold F, Elvove E. 1942. Domestic water and dental caries. Part 5 - \nAdditional studies of the relation of fluoride in domestic waters and dental caries., \nPublic Health Report 57, 1155-1179.  \n \nDissanayake CB. 1996. Water quality and dental health in the Dry Zone of Sri Lanka. \nIn Appleton JD, Fuge R, McCall GJH, eds. Environmental Geochemistry and Health \nwith specific reference to developing countries. Geological Society Special \nPublication 113. London: The Geological Society, 131-141.  \n \nDissanayake CB, Chandrajith R. 1999. Medical geochemistry of tropical \nenvironments. Earth-Science Reviews 47 (3-4), 219-258.  \n \nEdmunds WM, Smedley PM. 1996. Groundwater geochemistry and health - an \noverview. In Appleton JD, Fuge R, McCall GJH, eds. Environmental Geochemistry \nand Health with specific reference to developing countries. Geological Society \nSpecial Publication 113. London: The Geological Society, 91-107. \n \nFordyce FM, Vrana K, eds. 2001. Development of a Fluoride Risk Assessment GIS for \nCentral Europe. Final Report: Water Quality Improvements through Fluoride \nReduction in Groundwater of Central Europe. Inco - Copernicus 15-CT98-0139. \n \nFrencken JE, Truin GJ, Van't Hof MA, Konig KG, Mabelya L, Mulder J, Ruiken HM. \n1990. Prevalence of dental caries in 7-13-yr-old children in Morogoro District, \nTanzania, in 1984, 1986, and 1988. Community Dental Oral Epidemiology 18 (1), 2-\n8. \n \nFuge R. 1988. Sources of halogens in the environment, influences on human and \nanimal health. Environmental Geochemistry and Health 10 (2), 51-61. \n \nGabovych R, Minkh A. 1979. Hygienic Problems of Drinking Water Fluoridation. \nMoscow: Meditsina. \n \nGabovych R, Ovrutsky G. 1969. Fluoride in Stomatology and Hygiene. Kazan: \nTatpoligraph.  \n \nGnatyuk P. 1988. Fluorosis and caries of temporal teeth. Stomatology 67 (5), 67-68.  \n \nGrigoryeva L, Golovko N, Nikolishiyn A, Pavlyenko L. 1993. Fluoride influence on \nprevalence and intensity of stomatological disease in adolescents of Poltava Oblast. In \nConference Proceedings - Fluoride Problems of Ecology, Biology, Medicine and \nHygiene. Poltava, 25-26.  \n \nGroshikov M. 1985. Non-caries Injuries of Dental Tissues. Moscow: Meditsina.  \n \nHealth Protection Ministry. 1999. Norms of Physiological Needs of Ukrainian \nPopulation in Main Food Nutrients. Decree 272. Kiev: Health Ministry of Ukraine.  \n \nHem, J. 1992. Study and Interpretation of the Chemical Characteristics of Natural \nWater. Reston: US Geological Survey.  \n \nJacks G, Rajagopalan K, Alveteg T, Jonsson M. 1993. Genesis of high-F \ngroundwaters, southern India. Applied Geochemistry Supplementary Issue 2, 241-\n244.  \n \nJarup L. 2004. Health and environmental information systems for exposure and \ndisease mapping and risk assessment. Environmental Health Perspectives 112 (9), \n995-997 \n \nJenkins G. 1967. The mechanism of action of fluoride in reducing caries incidence. \nInternational Dental Health 17, 385-390.  \n \nJowsey J, Riggs B. 1978. Effects of concurrent calcium ingestion in intestinal \nabsorption of fluoride. Metabolism 27, 971-974.  \n \nKajaba I, Bucko A. 1968. Health and nutritional status of children in an industrialised \nand agricultural area of Eastern Slovakia. 3. Investigations of the lipid metabolism. \nReviews of Czech Medicine 14 (3), 180-91.  \n \nKrishnamachari K. 1986. Skeletal fluorosis in humans - a review of recent progress in \nthe understanding of the disease. Progress in Food and Nutrition Science 10 (3-4), \n279-314.  \n \nLahermo P, Sandstrom H, Malisa, E. 1991. The occurrence and geochemistry of \nfluorides in natural waters in Finland and East Africa with reference to their \ngeomedical implications. Journal of Geochemical Exploration 41, 65-79.  \n \nLi Y, Liang CK, Katz BP, Niu S, Cao S, Stookey, GK. 1996. Effect of fluoride \nexposure and nutrition on skeletal fluorosis. Journal of Dental Research 75 (SISI), \n2699.  \n \nLukomsky I. 1955. Anti-caries Fluoridation of Teeth. Moscow: Meditsina.  \n \nMinistry of the Environment. 1998. The Evaluation of Ecological Sustainability of the \nZiarska Kotlina Basin. Bratislava: Ministry of the Environment. \n \nOrtiz D, Castro L, Turrubiartes F, Milan J, Diaz-Barriga F. 1998. Assessment of the \nexposure to fluoride from drinking water in Durango, Mexico using a geographic \ninformation system. Fluoride 31 (4), 183-187. \n \nPashayev C, Akhmyedov R, Halifa-Zade C. 1990. Fluoride and other biogeochemical \nfactors influence on microstrength of enamel and dentin. Stomatology 69 (6), 10-12.  \n \nPatrikyeyev V. 1958. Histological study of dental hard tissue injured by endemic \nfluorosis. Stomatology 5, 19-21.  \n \nPetrovich Y, Podorozhnaya R, Dmitriyeva L, Knavo O, Vasyukova O. 1995. \nGlutamate and organic phosphates metabolic ferments under fluorosis. Stomatology \n74 (2), 26-28.  \n \nPovoroznuk V, Zhovinsky E, Barhanel I, Voloh O. 2001. Impact of increased fluoride \nconcentrations in water on bone tissue functional state and teeth. Ukrainian Medicine \nAlmanac 1.  Kiev. \n \nRapant S, Vrana K, Bodis D. 1996. Geochemical Atlas of Slovakia - Part 1. \nGroundwater. Bratislava: Geological Survey of the Slovak Republic.  \n \nRozier R. 1999. The prevalence and severity of enamel fluorosis in North American \nadolescents. Journal of Public Health Dentistry 59 (4), 239-246.  \n \nSchamschula RG, Sugar, E, Un PS, Duppenthaler JL, Toth K, Barmes DE. 1988. The \nfluoride content of selected foods in relation to the fluoride concentration of water. \nActa Physiology Hungary 72 (2), 217-227. \n  \nSchamschula RG, Sugar E, Un PS, Toth K, Barmes DE, Adkins BL. 1985. \nPhysiological indicators of fluoride exposure and utilization: an epidemiological \nstudy. Community Dental Oral Epidemiology 13 (2), 104-107.  \n \nSkinner C. 2000. In praise of phosphates, or why vertebrates chose apatite to \nmineralise their skeletal elements. International Geology Review 42, 232-240. \n \nSmith M, Lantz E, Smith H. 1931. The cause of mottled enamel. Science 74, 244.  \n \nSusheela AK. 1999. Fluorosis management programme in India. Current Science 77 \n(10), 1250-1256.  \n \nTebbutt THY. 1983. Relationship between Natural Water Quality and Health. Paris: \nUNESCO.  \n \nTeotia M, Teotia SPS, Singh K. 1998. Endemic chronic fluoride toxicity and dietary \ncalcium deficiency interaction syndromes of metabolic bone disease and deformities \nin India: year 2000. Indian Journal of Paediatrics 65 (3), 371-381.  \n \nToma S, Kreidman J, Vedina O, Veliksar S. 1999. Some observations on fluoride \nproblems in the Moldova Republic. Fluoride 32 (2), 67-70.  \n Toth G. 1989. Mineral and Thermal Wells. In Pecsi M, ed. National Atlas of Hungary.  \nBudapest: Kartografiai Vallalat, 74.  \n \nToth, G. 2000. Development of Fluoride Risk Assessment GIS – Phase 2: Dec 1999 – \nDec 2000, Hungary. In Baker J, ed. Water Quality Improvement Through Fluoride \nReduction in Groundwater of Central Europe Inco-Copernicus Programme Project \n(IC15-CT98-0139) Technical Annex to Second Annual Report. Amsterdam: Selor. \n \nToth K, Sugar E. 1978. Fluoride content of food and the estimated daily intake from \nfoods. Acta Physiology Hungary 51 (4), 361-369.  \n \nVedina O, Kreidman J. 1999. Fluoride distribution in burozems of Moldova. Fluoride \n32 (2), 71-73.  \n \nVoynar A. 1960. Biological role of Microelements in Human and Animal Organism. \nMoscow: Vysshaya Shokola.  \n \nVyeltishchyev Y. 1995. Ecopathology in childhood. Paediatrics  4, 26-33.  \n \nWhitford, GM. 1997. Determinants and mechanisms of enamel fluorosis. Ciba \nFoundation Symposium 205, 226-241  \n \nWHO. 1996a. Trace Elements in Human Nutrition and Health. Geneva: World Health \nOrganisation. \n WHO. 1996b. Guidelines for Drinking Water Quality. Geneva: World Health \nOrganisation.  \n \nWHO. 2000 Posting date. Fluoride in Drinking Water. \nhttp:\/\/www.who.int\/environmental_information\/Information_resources\/htmdocs\/Fluor\nide\/fluoride.html \n \nZaichick V, Tsyb A, Matveenko E, Chernichenko I. 1996. Instrumental neutron \nactivation analysis of essential and toxic elements in child and adolescent diets in the \nChernobyl disaster territories of Kaluga Region. The Science of the Total \nEnvironment, 192 (3), 269-274. \n \nZhang B, Hong M, Zhao Y, Lin X, Zhang X, Dong J. 2003. Distribution and risk \nassessment of fluoride in drinking water in the West Plain region of Jilin Province, \nChina. Environmental Geochemistry and Health 25 (4), 421-431. \n \nZheng BS, Ding ZH, Huang RG, Zhu JM, Yu XY, Wang AM, Zhou DX, Mao DJ, Su \nHC. 1999. Issues of health and disease relating to coal use in southwestern China. \nInternational Journal of Coal Geology 40 (2-3), 119-132.  \n \nZhovinsky E. 1979. Geochemistry of Fluoride in Sedimentary Formations of \nSouthwestern East-European Platform. Kiev: Naukova Dumka.  \n \nZhovinsky E, Povoroznuk V.  1998. Fluorine in water of Lvov region and relation \nwith bone diseases. Carpathian-Balkan Geological Association. XVI Congress. \nAustria: University of Vienna, 652. \n \n \n \n \nTable 1. International guidelines for fluoride concentrations in drinking water and \npossible health effects. \n \nTable 2. Different importance and influence categories for each of the likely \ncontrolling factors and risk indicators considered in the development of the fluoride-\nrelated risk assessment scheme.  \n \nTable 3. Fluoride concentrations in different waters from the study region. \n \nTable 4. Water supply information for each country included in the final risk \nassessment scheme. \n \nTable 5. Fluorosis prevalence information collated for the present study. \n \nTable 6. Grid sizes used for the preparation of final risk assessment maps in Central \nEurope. \n \nTable 7. Final risk assessment scheme for high-fluoride. \n \nTable 8. Water fluoride, fluoride dietary intake and dental fluorosis prevalence from \nthe Falesti study area, Moldova. \n \nTable 9. Water fluoride concentrations and dental fluorosis prevalence in the Arciz \nstudy area, Ukraine. \n \n \nFig. 1. Initial theoretical framework for the assessment of fluoride risk \n \nFig. 2. High fluoride risk map of Central Europe – Hungary, Moldova, Slovakia and \nUkraine. \n \nFig. 3. High-fluoride risk map of Moldova. \n \nFig. 4. Dental fluorosis (III degree, Gabovych and Ovrutsky (1969) classification) in \nFalesti, Moldova \n \nTable 1. International guidelines for fluoride concentrations in drinking water and \npossible health effects \n \nGuideline Value  F mg L-1 Water Possible Health Effects \n-------------------------------------------------------------------------------------------------------------------------------------------------- \nRecommended Minimum 0.5  Dental cavities may occur at lower concentrations \n \nOptimum Range  0.5 – 1.5  No adverse health effects, cavities decrease \n \nRecommended Maximum 1.5 Mottling of teeth and dental fluorosis may occur at higher  \n  concentrations. Association with skeletal fluorosis at > 3 mg L-1 \nconcentrations \n \nFrom: WHO (1996b) \n \nTable 2. Different importance and influence categories for each of the likely \ncontrolling factors and risk indicators considered in the development of the fluoride-\nrelated risk assessment scheme.  \n \nControlling Factor\/ Risk Indicator Importance Category Influence Category \nHydrogeology \n \nLow  High   Major aquifer unit used  for \ndrinking water supply more \npeople are exposed to this \nwater therefore the risk is \nhigher \n  Moderate  Minor units or units not used \ndirectly for drinking but \nconnect to drinking water  \nunits \n  \nThe importance of the \nhydrogeological resource as \nan indicator of risk is less than \nthat of knowing the water \nsupply regime \nLow  Impermeable units or units not \nused for drinking water \nFluoride Concentration in Water High High \nFluorosis*  \nConcentration of fluoride > 1.5 \nmg L-1 \n  \nThe concentration of fluoride \nin water is one of the most \nimportant risk indicators Low*  Concentration of fluoride 0.5 – \n1.5 mg L-1 \nFluorosis and Health Criteria High High   Evidence of fluorosis \nincidence and low Ca\/ protein \ndiets etc \n  \nIf fluorosis is already known to \noccur, this is an important \nindicator of high risk \nLow No evidence of fluorosis \nincidence \nWater Type Low  High    Na+ K dominated , Ca-poor \nwaters, thermal waters, waters \nin fluoride mineralised zones \n  \nMajor element chemistry of \nwaters can be an indicator of \nlikely risk but is not as \nimportant as knowing the \nfluoride content of water \nLow   Waters with normal to high Ca \ncontent \nPopulation Density Low  High   High population density \n  Moderate   Medium population density \n  \nGives an approximate \nindication of risk but \ninformation on the water \nsupply regime is a more \nimportant indicator \nLow  Low population density \nFluoride Contamination High High   Source of fluoride exists and \nimpacts upon the environment \n  Moderate   Source of fluoride exists but \ndoes not impact upon the \nenvironment \n  \nIndustrial and agricultural \nsources enhance \nenvironmental fluoride \ncontents and are indicators of \npotential risk \nLow   No source of fluoride exists \nTectonic\/ Geological Conditions Low  High   Area evaluated includes rock \ntypes\/ tectonic regions which \nmay contain high fluoride \nconcentrations \n  \nTectonic and geological \ninformation can give an \nindication of risk but are not as \nimportant as knowing the \nfluoride content of water Low Area evaluated does not \ncontain rock types\/ tectonic \nzones with fluoride potential \nWater Supply High High Water is used for drinking and \nis not fluoridated \n  Moderate  Water has high (fluorosis)\/low \n(caries) fluoride content but is \nnot used for drinking \n  \nThe nature and type of water \nsupply is a key factor in the \nrisk assessment \nLow  Water is not used for drinking \n* Based on Drinking Water Quality Guidelines WHO (1996b) \nTable 3. Fluoride concentrations in different waters from the study region \n \nCountry Coverage Water Type F mg L-1 \nMin \nF mg L-1    \nMax \nF mg L-1 \nAv. \nN \nSlovakia National¬ Groundwater  \n0.05 4.0 0.1\n1615\n6\n Ziarska   Groundwater 0.01 3.6 0.1 107\n Kotlina¬ Surface water 0.03 9.0 0.4 126\n  Snow’ 0.02 1.3 0.3 20\nHungary National^ Thermal Wells > 25oC 0.60 6.2 1.4 344\n  Cold Wells < 25oC 0.30 3.3 0.2 532\n  Tap Water 0.00 1.8 0.2 3266\nMoldova National#  Unconfined – Quaternary , \nPliocene Pontic + Levantin \nSediments aquifer 1.4 7.6 3.1 45\n  Mid Sarmatian – Conherian \naquifer 0.20 3.5 1.0 35\n  Baden Sarmat (Lower \nSarmatian) aquifer 0.17 15.7 2.4 161\n  Silurian-Cretaceous Chalk \naquifer 0.10 16.2 2.9 86\n Falesti* Tap and well water 0.39 5.3 1.3 10\n Kalarash* Tap and well water 0.19 3.6 1.6 9\n Cornesti* Well water 0.25 0.88 0.41 8\nUkraine Odessa~ Neogene aquifer 0.05 0.8 0.4 58\n Kiev~ Quaternary aquifer 0.00 0.3 0.2 28\n  Palaeogene aquifer 0.00 1.15 0.3 26\n  Cretaceous aquifer 0.18 0.6 0.2 15\n  Jurassic aquifer 0.06 1.1 0.4 18\n  Proterozoic aquifer 0.2 0.9 0.4 6\n Poltava~ Quaternary aquifer 0.00 3.2 0.6 37\n  Palaeogene aquifer 0.00 8.8 2.8 53\n  Cretaceous aquifer 0.18 2 1.1 21\n Lvov~ Quaternary aquifer 0.00 0.9 0.2 39\n  Cretaceous aquifer 0.00 3.8 0.9 20\n Khar’kov* Well Water 0.4 1.8 1.1 2\n Dnepropetrovsk* Well Water 0.12 2.7 1.0 34\n Donetsk* Well Water 0.05 1.5 0.5 36\n Zaporozh’ye* Well Water 0.04 2.2 0.7 36\n Podgorny* Tap water 0.71 7.13 2.5 13\n Arciz* Tap water - - 2.54 1\n Izmail * Tap water - - 0.24 1\n Tarutino* Tap water - - 1.14 1\n¬SGUDS National Groundwater Data (Rapant et al. 1996); ‘Ministry of the Environment (1998); ^MAFI National \nGroundwater Data (Toth 1989); # ASG Groundwater Data; ~ IGMOF Groundwater Data; *Data from the present \nstudy. Min = minimum, Max = maximum, Av = average, N = number \nTable 4. Water supply information for each country included in the final risk \nassessment scheme \nCountry Water Sources Water Used for Drinking \nSlovakia Water mains supply Water adjacent to \nindustrial sources is not \nused for drinking \nHungary Water mains supply. High \nand low fluoride waters \nfrom cold and thermal \nwells can be available in \nthe same location and are \noften mixed in the mains \nsystem \nWater in areas of historic \nfluorosis incidence is no \nlonger used for drinking \nMoldova Water mains supply and \nlocal supplies. High and \nlow fluoride waters from \ndifferent aquifer horizons \ncan be available in the \nsame location \nWaters from several \naquifer horizons are used \nfor drinking \nUkraine Water mains supply and \nlocal supplies. High and \nlow fluoride waters from \ndifferent aquifer horizons \ncan be available in the \nsame location \nWaters from several \naquifer horizons are used \nfor drinking \n \nTable 5. Fluorosis prevalence information collated for the present study \n \nCountry Location Water  \nF mg L-1  \nFluorosis   \nPrevalence Rate %\nHungary Bar >4# Unknown \n  Dunaszekcso 2.2-2.4# Unknown \n  Herceghalom 2.0-2.2# Unknown \nMoldova Hyncheshty   30^ \n  Gaydar   32^ \n  Naslava Oknits   40^ \n  Ungheny   40^ \n  Komrat   40^ \n  Congas, Komrat   40^ \n  Beshgioz   40^ \n  Bulboka, Nov. Aneny 0.6 - 1.0^ 40^ \n  Kiseliea, Komrat 0.6 - 1.0^ 40^ \n  Djoltay   45^ \n  Falesti 0.39 - 5.3* 50^\/ 61* \n  Kalarash 0.19 - 3.6* 50^\/ 60* \n  Chadyr-Lunga   50^ \n  Baurchi   50^ \n  Ishkalevo, Falesti   50^ \n  Glodeany   60^ \n  Fegedeu, Falesti   60^ \n  Falesti   62^ \n  Beltsy   66^ \n  Edintsy   72^ \n  Pyrlitsa, Ungheny 1.2 – 17^ 74^ \n  Skuleany, Ungheny 1.2 – 17^ 10^ \n  Chadyr-Lunga   80^ \n  Kazakliea   80^ \n  Cornesti 0.2 - 0.88* 0* \nUkraine Sosnovka 0.2 - 3.5* 71.4* \n  Silyets 0 - 0.5* 0 \n  Zhovkva + Kulykiv   0 - 0.5* 0 \n  Peremyshlyany 0 - 0.5* 0 \n  Chervonograd 3 - 3.8* 38 – 68^ \n  Lvov 3 - 3.8* 38 – 68^ \n  Stryii 3 - 3.8* 38 – 68^ \n  Drogobech 3 - 3.8* 38 – 68^ \n  Odessa 0.01 - 0.6*   \n  Arciz 2 - 7* 92.78* \n  Tatarbunary 2 - 7* 90^ \n  Tarutino 2 - 7* 90^ \n  Kiev < 0.7*   \n Podgorny 2.5 – 7.1* 85.71* \n  Kiev 0.7 - 1.0* 4 \n  Girnik 3 - 3.8^ Unknown \n  Dimer 0 - 3* Unknown \n  Dimer 1 – 2^ Unknown \n  Dimer 0 – 1^   \n  Buchak 3.4 - 3.5^ 100^ \n  Stavishe 1 – 2^  Unknown  \n  Stavishe 0 - 3* Unknown \n  Stavishe 0 - 0.12^   \n  Tarashansky 0 - 0.12^   \n  Volodarsky 0 - 0.12^   \n  Jagotinsky 1 – 2^ Unknown \n  Poltava 1.4^ 20^ \n  Poltava > 5^ 100^ \n  Poltava 1.8^ 30^ \nSlovakia     0 \n^ Zhovinsky and Povoroznuk (1998); Povoroznuk et al. (2001)    #Toth (2000) \n * Data from present study    \n \n \n \nTable 6. Grid sizes used for the preparation of final risk assessment maps in Central \nEurope \n \nLocation    Water Chemistry Data  Grid Square Size \n    Sample Density per km2  km2 \n------------------------------------------------------------------------------------------------------------------------------------- \nSlovakia    1 per 2-3    2 \nZiarska Kotlina, Slovakia  1 per 0.5    0.5 \nHungary    1 per 3    3 \nMoldova    1 per 5    5 \nLvov, Ukraine   1 per 6.5    6.5 \nPoltava, Ukraine   1 per 6.5    6.5 \nOdessa, Ukraine   1 per 6.5    6.5 \nKiev, Ukraine   1 per 6.5    6.5 \n \n \n \n \n Table 7. Final risk assessment scheme for high-fluoride \n           \nHigh-Fluoride Risk      \nPhase 1   Phase 2  Final Risk Assessment Rationale \nIf water F \nmg L-1 ≥ 1.5 \nPotential \nRisk \nIf Drinking \nWater \nPotential \nRisk \n  \nNo Low Yes Low Low Fluoride content should not normally cause \nproblems, but may do under certain circumstances in \nhot climates \nNo Low No Low Low Fluoride content should not normally cause \nproblems, but may do under certain circumstances in \nhot climates \nYes High No Low Moderate Although water is not currently used for drinking, if it \nwere to be used in the future, health problems could \narise \nYes High Yes High High Fluoride content may cause health problems \nYes and No High\/low   High\/low Water has high fluoride content but lower fluoride \nwater is available in the vicinity \nUnknown    Unknown If the water fluoride content is unknown and there is \nno evidence of fluorosis incidence or industrial \nsources, the risk is not assessed \nOr If \nFluorosis \nIncidence \nPotential \nRisk \n    \nNo Low   Low No history of fluorosis in the area, therefore low risk \nYes High No Low Moderate There is a history of fluorosis in the region but the \nwater is no longer used for drinking therefore the risk \nis moderate indicating the situation should be \nmonitored in case high fluoride waters are used for \ndrinking in the future \nYes High Yes Yes Yes There is evidence of fluorosis in the region and the \nwaters are used for drinking therefore high risk \nOr If \nIndustrial \nSource \n     \nNo Low   Low No industrial sources of fluoride in the area, \ntherefore low risk \nYes High No Low Moderate Although there is an industrial source of fluoride in \nthe area, the waters are not used for drinking \ntherefore the risk is moderate indicating the situation \nshould be monitored in case high fluoride waters are \nused for drinking in the future \nYes High Yes High High An industrial source of fluoride is present and the \nwaters are used for drinking therefore high risk \n \nTable 8. Water fluoride, fluoride dietary intake and dental fluorosis prevalence from \nthe Falesti study area, Moldova. \n \nTown Well Water          \nF mg L-1 \nGirls F Dietary \nIntake µg day-1 \nBoys F Dietary \nIntake µg day-1 \nGirls Dental \nFluorosis % \nBoys Dental \nFluorosis % \nCornesti 0.25 - 0.88 538.51±60.6 463.82±41 0 0 \nKalarash 0.19 - 3.65 874.1± 222.86 1304.26±201.3 62 62 \nFalesti 0.39 - 2.43 2528.9±176.0 2362.45±686.7 72 80 \nN wells in each town = 8   Age = 10 – 15 years; n girls = 55; n boys = 48 \n \nTable 9. Water fluoride concentrations and dental fluorosis prevalence in the Arciz \nstudy area, Ukraine. \n \nData Arciz Vilkovo-Tarutino Izmail Podgorny \nTap Water F mg L-1 2.54 1.14 0.24 0.71 – 7.13 \nNo of Water Samples 1 1 1 13 \nDental Fluorosis Prevalence % 93   86 \nNo of Adolescents Examined 97   28 \nAdolescents age = 10 – 15 years \n \n \n \nHydrogeology \n(main aquifers) \n Water Fluoride Content  Fluorosis and Health \nCriteria \n \n \n \nWater Supply  High Fluoride Risk Map  Water Type \n(Ca content etc.) \n \n \n \nGeology\/ \nTectonics \n Fluoride Contamination \n(industrial, agricultural) \n Population Density \n \n \n \nFig. 1. Initial theoretical framework for the assessment of fluoride risk \nFig. 2. High fluoride risk map of Central Europe – Hungary, Moldova, Slovakia and Ukraine.\nBudapest\nLvov\nKiev\nOdess\nKishinev\nChernovtsyBratislava\nKosice\nGyor\nPecs\nDebrecen\nHungary Moldova\nUkraine\nSlovakia\n16\n16\n18\n18\n20\n20\n22\n22\n24\n24\n26\n26\n28\n28\n30\n30\n44\n46\n48\n50\n52\n54\n0\nEuropean Countries\nHigh Fluoride Risk\nHigh, but alternative low fluoride water source available\nHigh\nModerate\nLow\nUnknown\nCities\nRivers\nRoads\nThis map is based upon info\nused in conjunction with the\nin Groundwater of Central E\n2001 Development of a Fluo\nArciz \nFig. 3. High-fluoride risk map of Moldova. \n \n \nKalarash\nCornesti\nFalesti\nKISHINEV\nBendery Tiraspol\nBeltsy\n27\n27\n28\n28\n29\n29\n3\n3\n46\n47\n48\nRiver\nRailways\nUrban areas\nRoads 0 50 100 150 Kilometers\nHigh fluoride risk\nHigh, but alternative low fluoride water source available\nHigh\nLow\nUnknown\nDetailed study area\nThis map is based upon information for groundwater and health\nand should only be used in conjunction with the report Water Qu\n Improvements through Fluoride Reduction in Groundwater of C\nEurope Inco - Copernicus 15-CT98-0139 Final Report Decembe\nDevelopment of a Fluoride Risk Assessment GIS for Central Eu\n  \nPhoto: Prof V Povoroznuk  \n \nFig. 4. Dental fluorosis (III degree, Gabovych and Ovrutsky (1969) classification) in \nFalesti, Moldova. \n \n \n \n"}