{"doi":"10.1093\/imaman","coreId":"97054","oai":"oai:generic.eprints.org:647\/core69","identifiers":["oai:generic.eprints.org:647\/core69","10.1093\/imaman"],"title":"Optimal hedging and parameter uncertainty","authors":["Monoyios, Michael"],"enrichments":{"references":[{"id":860068,"title":"(2004b) Performance of utility-based strategies for hedging basis risk.","authors":[],"date":null,"doi":"10.1088\/1469-7688\/4\/3\/001","raw":null,"cites":null},{"id":861267,"title":"A solution approach to valuation with unhedgeable risks.","authors":[],"date":"2001","doi":"10.1007\/PL00000040","raw":null,"cites":null},{"id":860322,"title":"An example of indifference prices under exponential preferences.","authors":[],"date":"2004","doi":"10.1007\/s00780-003-0112-5","raw":null,"cites":null},{"id":858403,"title":"Hedging of contingent claims under incomplete information.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":859287,"title":"Lifetime portfolio selection under uncertainty: the continuous-time case.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":858199,"title":"Optimal hedging with basis risk. From Stochastic Calculus to Mathematical Finance: The Shiryaev Festschrift","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":859048,"title":"Optimal trading strategy for an investor: the case of partial information.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":859566,"title":"Optimum consumption and portfolio rules in a continuous-time model.","authors":[],"date":"1971","doi":null,"raw":null,"cites":null},{"id":857958,"title":"Option pricing in incomplete markets.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":859829,"title":"Option pricing with transaction costs using a Markov chain approximation.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":861047,"title":"Probability Theory and Statistical Inference. Cambridge:","authors":[],"date":"1999","doi":"10.1002\/jae.675","raw":null,"cites":null},{"id":860563,"title":"Stochastic Differential Equations: An Introduction with Applications, 6th edn.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":857700,"title":"The pricing of options and corporate liabilities.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":860776,"title":"The relaxed investor and parameter uncertainty.","authors":[],"date":"2001","doi":"10.1007\/PL00013532","raw":null,"cites":null},{"id":858836,"title":"Utility maximization with partial information.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":858611,"title":"Valuation of claims on nontraded assets using utility maximization.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-01","abstract":"We explore the impact of drift parameter uncertainty in a basis risk model, an incomplete market in which a claim on a non-traded asset is optimally hedged using a correlated traded stock. Using analytic expansions for indifference prices and hedging strategies, we develop an efficient procedure to generate terminal hedging error distributions when the hedger has erroneous estimates of the drift parameters. These show that the effect of parameter uncertainty is occasionally benign, but often very destructive. In light of this, we develop a filtering approach in which the hedger updates her parameter estimates from observations of the asset prices, and we find an analytic soultion to the hedger's combined filtering and control problem in the case that the drift of the traded asset is known with certainty","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97054.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/647\/1\/ima_final.pdf","pdfHashValue":"85166d48e9b770b51a6ac3c3e3f4fff80b9bbdb6","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:647<\/identifier><datestamp>\n      2015-05-29T18:25:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3931<\/setSpec><setSpec>\n      7375626A656374733D4F5A:4D3630<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/647\/<\/dc:relation><dc:title>\n        Optimal hedging and parameter uncertainty<\/dc:title><dc:creator>\n        Monoyios, Michael<\/dc:creator><dc:subject>\n        Game theory, mathematical finance, economics, social and behavioral sciences<\/dc:subject><dc:subject>\n        Probability theory and stochastic processes<\/dc:subject><dc:description>\n        We explore the impact of drift parameter uncertainty in a basis risk model, an incomplete market in which a claim on a non-traded asset is optimally hedged using a correlated traded stock. Using analytic expansions for indifference prices and hedging strategies, we develop an efficient procedure to generate terminal hedging error distributions when the hedger has erroneous estimates of the drift parameters. These show that the effect of parameter uncertainty is occasionally benign, but often very destructive. In light of this, we develop a filtering approach in which the hedger updates her parameter estimates from observations of the asset prices, and we find an analytic soultion to the hedger's combined filtering and control problem in the case that the drift of the traded asset is known with certainty.<\/dc:description><dc:date>\n        2007-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/647\/1\/ima_final.pdf<\/dc:identifier><dc:identifier>\n          Monoyios, Michael  (2007) Optimal hedging and parameter uncertainty.  IMA Journal of Management Mathematics, 18 .   pp. 331-351.      <\/dc:identifier><dc:relation>\n        10.1093\/imaman\/dpm022<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/647\/","10.1093\/imaman\/dpm022"],"year":2007,"topics":["Game theory, mathematical finance, economics, social and behavioral sciences","Probability theory and stochastic processes"],"subject":["Article","PeerReviewed"],"fullText":"IMA Journal of Management Mathematics (2007) 18, 331−351\ndoi:10.1093\/imaman\/dpm022\nAdvance Access publication on May 5, 2007\nOptimal hedging and parameter uncertainty\nMICHAEL MONOYIOS†\nMathematical Institute, University of Oxford\n[Received on 8 September 2006; accepted on 15 March 2007]\nWe explore the impact of drift parameter uncertainty in a basis risk model, an incomplete market in\nwhich a claim on a nontraded asset is optimally hedged using a correlated traded stock. Using analytic\nexpansions for indifference prices and hedging strategies, we develop an efficient procedure to generate\nterminal hedging error distributions when the hedger has erroneous estimates of the drift parameters.\nThese show that the effect of parameter uncertainty is occasionally benign, but often very destructive. In\nlight of this, we develop a filtering approach in which the hedger updates her parameter estimates from\nobservations of the asset prices, and we find an analytic solution to the hedger’s combined filtering and\ncontrol problem in the case that the drift of the traded asset is known with certainty.\n1. Introduction\nThis paper examines the problem of drift parameter uncertainty on the optimal hedging of a claim\nin an incomplete market. We study a ‘basis risk’ model (Davis, 2006; Henderson, 2002; Monoyios,\n2004b; Musiela & Zariphopoulou, 2004) in which a claim on a nontraded asset Y is optimally hedged\nusing a correlated traded asset S, with correlation ρ ∈ [−1, 1]. Our contributions are threefold. First,\nwe improve the analytic approach initiated in Monoyios (2004b) for generating the terminal hedging\nerror distribution, associated with the utility-based hedging of the claim, over simulated asset price\npaths. Second, we use this approach to examine the impact of drift parameter misestimation on the\nterminal hedging error. Third, we propose a filtering approach to the parameter uncertainty problem,\nincorporating Bayesian learning into the drift parameter estimation.\nIn a complete market, such as the Black & Scholes (1973) (BS) setting, perfect hedging of a claim\ndoes not require estimation of the stock price drift μ in the stochastic differential equation (SDE) (1)\nfor the stock S. As is well-known, estimation of the volatility σ is possible with reasonable confidence\ngiven sufficient data, but as discussed by Rogers (2001) and as we discuss in Section 3, it is virtually\nimpossible to have confidence in an estimate of μ. This has serious implications for optimal investment\nrules such as the classical Merton (1969, 1971) policy, where knowledge of μ is needed to compute the\noptimal proportion of wealth to assign to the risky asset. By the same token, drift parameter uncertainty\nwill also have a bearing on hedging strategies for derivatives in ‘incomplete’ markets when ‘hedging’\nbecomes synonymous with ‘investment’ since there is, in general, no preference-free way to perfectly\nreplicate a claim.\nIn a lognormal basis risk model, it was shown in Monoyios (2004b) that an optimal strategy, based\non exponential utility maximization, gave superior hedging performance than a ‘naive’ strategy (a BS-\nstyle hedge) that assumes the traded asset S is a good proxy for the nontraded asset Y (tacitly assuming\nthat for high correlation, the approximation ρ ≈ 1 is a good one). This was done by generating the\ndistribution of hedging error associated with hedging the claim over many simulated asset price paths.\n†Email: monoyios@maths.ox.ac.uk\nc© The authors 2007. Published by Oxford University Press on behalf of the Institute of Mathematics and its Applications. All rights reserved.\n332 M. MONOYIOS\nWith optimal hedging, the hedging error distribution was found to have, among other features, a higher\nmedian relative to that obtained with the BS-style strategy. This reflects the greater frequency of profits\nover losses generated by optimal hedging.\nUnfortunately, however, the optimal strategy requires knowledge of the drift parameters of the dif-\nfusions S and Y , as well as the volatilities and correlation. The drift parameters are notoriously difficult\nto estimate with precision, as already remarked. In contrast, the naive strategy only requires knowledge\nof the volatilities of S and Y . Although estimation of volatility and correlation is itself not perfect, it can\nbe improved with more observations much more rapidly than the drift estimation. For this reason, we\nfocus on the severe problem of drift parameter uncertainty.\nWe investigate the effect of this parameter uncertainty on the hedging error distribution by supposing\nthat the hedger misestimates the drift parameters and we look at the effect on the median hedging\nerror distribution. This reveals that the effect of parameter uncertainty can indeed be severe. It can lead\nto large reductions in median hedging error distribution, depending on the size and direction of the\nmisestimation. The direction of the misestimation can be such as to make the agent too aggressive,\nleading to selling the claim at too low a price and leading to frequent hedging losses. Conversely, if the\nsign of the estimation error is such as to make the agent more conservative, the relative frequency of\nhedging losses is reduced, but at the cost of selling the claim at too high a price, making the agent into\nan uncompetitive market maker.\nWe then initiate a filtering approach to this problem, allowing the agent to use observations of the\nasset prices to update her estimates of the drift parameters. This approach shows promise, though ana-\nlytic results for indifference prices and hedging strategies are not generally available, as the dimension of\nthe problem is increased by incorporating parameter uncertainty. However, we are able to develop an ana-\nlytic approach in the special case when the agent is uncertain about the drift of the nontraded asset only.\nThe effect of such Bayesian learning on the hedging error distribution will be a topic of future papers.\nPartial information problems, in which agents do not have precise knowledge of drift parameters,\nhave received some attention in the context of optimal investment problems such as the classical Merton\n(1969, 1971) problems, but this is the first attempt to examine such uncertainty in the context of opti-\nmal hedging of derivatives. Rogers (2001) investigated the disutility arising from parameter uncertainty\nversus that from discrete portfolio rebalancing for a Merton investor seeking to maximize expected util-\nity of wealth or consumption (the theoretically optimal strategy requires continuous portfolio revision).\nRogers finds that parameter uncertainty outweighs the effect of rebalancing the portfolio infrequently.\nLakner (1995, 1998) uses a dual approach to examine the impact of drift parameter uncertainty on the\nMerton problem, while Brennan (1998) derives the asset price dynamics under the observation filtration\nand characterizes the optimal investment rule in terms of the solution of a Hamilton–Jacobi–Bellman\n(HJB) equation. Our approach is also based on stochastic control and a HJB equation, though it differs\nfrom Brennan’s in some significant ways. Even though we incorporate uncertainty in the drifts of two\nassets S and Y (Brennan deals with the Merton problem involving a single stock), we are able to treat\nthe problem such that the resulting HJB equation has only one extra dimension compared to the full in-\nformation case. Remarkably, in the case where the investor is uncertain only about the drift of Y , we are\nable to retain the same dimensionality as the full information problem. Future work will exploit these\nfeatures to investigate in detail the effect on the hedging error distribution.\nThe rest of the paper is organized as follows: In Section 2, we outline the basis risk model. We recall\nprevious results (Monoyios, 2004b) for the claim’s indifference price and optimal hedging strategy, and\nderive improved analytic formulae (compared to Monoyios, 2004b) for these objects, as well as a SDE\nfor the ‘residual risk’ (or hedging error) process, allowing for an extremely efficient generation of the\nterminal hedging error distribution via simulation. We demonstrate the superiority of optimal over naive\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 333\nhedging, given perfect knowledge of parameter values. In Section 3, we explore the impact of drift\nparameter uncertainty. We show that one needs hundreds of years of price data to have any confidence\nin drift parameter estimates, and we generate terminal hedging error distributions when the hedger\nmisestimates the drifts of S and Y . Section 4 proposes a filtering algorithm to incorporate Bayesian\nlearning into the drift parameter estimation, and Section 5 concludes.\n2. Basis risk model\nWe consider a basis risk model, involving a traded asset S and a nontraded asset Y , following corre-\nlated log-Brownian motions, as in Davis (2006), Monoyios (2004b), Henderson (2002) and Musiela &\nZariphopoulou (2004). On a complete filtered probability space (Ω,F ,F := (Ft )06t6T , P), the stock\nprice process S := (St )06t6T is\ndSt = μSt dt + σ St dBt (1)\nand the nontraded asset price process Y := (Yt )06t6T is\ndYt = νYt dt + βYt dWt , (2)\nwhere μ, σ, ν and β are constants and the Brownian motions B and W have correlation ρ ∈ [−1, 1]:\ndBt dWt = ρ dt, W = ρB +\n√\n1− ρ2Z ,\nwhere B and Z are independent Brownian motions.\nAn agent may trade the stock in a self-financing fashion, leading to the portfolio wealth process\nXπ ≡ X := (Xt )06t6T satisfying\ndXt = r Xt dt + σπt (λ dt + dBt ), λ := (μ− r)\/σ,\nwhere r > 0 is a constant rate of interest and π := (πt )06t6T is the wealth in the stock, representing the\nagent’s trading strategy. An admissible trading strategy is one satisfying\n∫ T\n0 π\n2\nt dt < ∞ almost surely.\nDenote the set of such strategies by A.\nA European claim on Y pays h(YT ) at time T . The claim cannot be perfectly replicated using a\nportfolio in S unless |ρ| = 1, so the market is incomplete. Suppose the agent takes a position in n\nclaims at some time t 6 T . The utility-indifference approach to valuing such a position in the claim has\nbeen analysed by Davis (2006), Henderson (2002) and Musiela & Zariphopoulou (2004) among others.\nThis strand of research culminated with Monoyios (2004b), who analysed the optimal hedging of the\nclaim associated with the utility-indifference approach. This showed that optimal hedging produces a\nhedge profit and loss distribution that had a higher median hedging error than a naive strategy based on\nthe ρ → 1 limit of the optimal hedging formulae, and which therefore tacitly assumes that the traded\nasset is a good proxy for the nontraded asset. In this sense, optimal hedging was shown to be beneficial,\neven when the correlation is close to 1.\nThe major caveat to the above arguments is that the optimal strategies require knowledge of the\ndrift parameters μ and ν of the assets, as well as the volatilities and correlation. In contrast, the naive\nstrategies require only knowledge of the volatilities. This casts doubt on the true efficacy of the optimal\nschemes in the face of the severe parameter uncertainty associated with drift estimation.\nWe introduce the well-known minimal martingale measure QM of Fo¨llmer & Schweizer (1991)\nwhich will feature in many of our formulae. The probability measure QM has density process with\n334 M. MONOYIOS\nrespect to P given by\ndQM\ndP\n∣∣∣∣Ft = E(−λ ∙ B)t , 0 6 t 6 T .\nUnder QM, (S, Y ) follow\ndSt = r St dt + σ St dBQMt ,\ndYt = (ν − βρλ)Yt dt + βYt dWQMt ,\nwhere BQM and WQM are correlated Brownian motions under QM. The discounted stock price S is a\nlocal QM-martingale (the drift of S is r ), but this is not the case for the nontraded asset unless we have\nthe perfect correlation case ρ = 1. In this case, Y is effectively a traded asset (as Yt is then a function of\nSt ), so the QM-drift of Y is r . Therefore, given σ and β, in the ρ = 1 case the drifts are related by\nθ := ν − r\nβ\n= μ− r\nσ\n=: λ.\nIn this case, the market becomes complete, and perfect hedging is possible. It is easy to show that with\nρ = 1 so that W = B, we have\nYt = Y0\n(\nSt\nS0\n)β\/σ\nect\nc=\n(\nr + 1\n2\nσβ\n)(\n1− β\nσ\n)\n.\nLet the claim price process be v(t, Yt ), 0 6 t 6 T , where v: [0, T ] × R+ → R+ is smooth enough to\napply the Itoˆ formula so that\ndv(t, Yt ) = [vt (t, Yt )+AY v(t, Yt )]dt + βYtvy(t, Yt )dWt ,\nwhere AY is the generator of the process Y in (2). The replication conditions are\nXt = v(t, Yt ), 0 6 t 6 T, dXt = dv(t, Yt ).\nStandard arguments then show that to perfectly hedge the claim, one must hold Δt shares of S at t ∈\n[0, T ], given by\nΔt = β\nσ\nYt\nSt\n∂v\n∂y\n(t, Yt ), (3)\nand the claim pricing function v(t, y) satisfies\nvt (t, y)+ (ν − βλ)yvy(t, y)+ 12β2y2vyy(t, y)− rv(t, y) = 0,\nv(T, y) = h(y).\nBut with ρ = 1, ν − βλ = r , so we get the BS partial differential equation (PDE), and\nv(t, Yt ) = BS(t, Yt ),\nwhere BS(t, y) denotes the BS option pricing formula at time t with underlying asset price y.\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 335\n2.1 Utility-indifference valuation and hedging\nNow, suppose the correlation is not perfect so that the market is incomplete. We embed the problem in a\nutility-maximization framework in a manner that is by now classical. Let the agent have risk preferences\nexpressed via the exponential utility function\nU (x) = −exp(−αx), x ∈ R, α > 0.\nThe agent maximizes the expected utility of terminal wealth at time T with a random endowment of n\nunits of claim pay-off:\nJ (t, x, y;π) = E[U (XT + nh(YT ))|Xt = x, Yt = y].\nThe value function is u(n)(t, x, y) ≡ u(t, x, y), defined by\nu(t, x, y) := sup\nπ∈A\nJ (t, x, y;π), (4)\nu(T, x, y) = U (x + nh(y)). (5)\nDenote the optimal trading strategy that achieves the supremum in (4) by π∗ ≡ π∗,n , and denote the\noptimal wealth process by X∗ ≡ X∗,n .\nWe make the following assumption to ensure that we get a meaningful optimization problem in (4).\nASSUMPTION 1 The random endowment nh(YT ) is bounded below.\nThis assumption ensures that the maximum utility in (4) is well-defined, and means that we can\ncover the cases of short and long put positions and long call positions. The case of valuing a short call\nposition in this framework is a topic for future research.\nThe following definitions of utility-based price and hedging strategy are now standard (seeMonoyios,\n2004a,b; Musiela & Zariphopoulou, 2004, for instance).\nDEFINITION 1 (Indifference price) The indifference price per claim at t ∈ [0, T ], given Xt = x, Yt = y\nand p(t, x, y) ≡ p(n)(t, x, y), is defined by\nu(n)(t, x − np(n)(t, x, y), y) = u(0)(t, x, y).\nWe allow for possible dependence on t, x and y of p(n) in the above definition, but with exponential\npreferences it turns out that there is no dependence on x .\nDEFINITION 2 (Optimal hedging strategy) The optimal hedging strategy for n units of the claim is\nπ(H) := (π(H)t )06t6T given by\nπ\n(H)\nt := π∗,nt − π∗,0t , 0 6 t 6 T .\nThe solution to the optimization problem (4) is well-known, using the so-called distortion technique\n(Zariphopoulou, 2001). See Monoyios (2004b) for more details.\nThe HJB equation for the value function u is\nut + r xux +AY u − (λux + ρβyuxy)\n2\n2uxx\n= 0.\n336 M. MONOYIOS\nThe optimal trading strategy π∗ is given by π∗t = Π∗(t, X∗t , Yt ), where the functionΠ∗: [0, T ]×R×R+\nis given by\nΠ∗(t, x, y) := −\n(\nλux + ρβyuxy\nσuxx\n)\n. (6)\nWe have the following well-known representation for the value function and indifference price.\nPROPOSITION 1 (Henderson, 2002; Monoyios, 2004b; Musiela & Zariphopoulou, 2004) The value\nfunction u ≡ u(n) and indifference price p ≡ p(n), given Xt = x and Yt = y for t ∈ [0, T ], are given by\nu(n)(t, x, y)=−e−αb(t,T )x− 12λ2(T−t)[F(t, Y )]1\/(1−ρ2),\nF(t, y)= EQM[exp(−α(1− ρ2)nh(YT ))|Yt = y],\np(n)(t, y)=− 1\nb(t, T )α(1− ρ2)n log F(t, y), (7)\nwhere b(t, T ) := er(T−t).\nThe function F(t, y) satisfies a linear PDE by virtue of the stochastic representation (7) and the\nFeynman–Kac theorem. The indifference pricing function p(t, y) ≡ p(n)(t, y) then satisfies\npt + (ν − βρλ)ypy + 12β\n2y2 pyy − rp − 12β\n2y2nb(t, T )α(1− ρ2)(py)2 = 0.\nGiven the above results, it is easy to show that the expression (6) for the optimal control loses its\ndependence on x and simplifies to\nΠ∗(t, y) := 1\nασb(t, T )\n(\nλ+ ρβy\n1− ρ2\nFy\nF\n)\n.\nThen, applying Definition 2 gives the optimal hedging strategy for a position in n claims (see Monoyios,\n2004b, for further details of this derivation).\nPROPOSITION 2 The optimal hedging strategy for a position in n claims is to hold Δ(H)t shares at\nt ∈ [0, T ] given by\nΔ\n(H)\nt = −nρ\nβ\nσ\nYt\nSt\n∂p(n)\n∂y\n(t, Yt ).\nWe note that if n = 1 and ρ = 1, we recover the perfect delta hedge (3), and that the claim price\nthen satisfies the BS PDE.\n2.2 The residual risk process\nSuppose the agent trades n claims at time 0 for price p(n)(0, Y0) per claim. The agent hedges this position\nover [0, T ] using the strategy (Δ(H)t )06t6T . Her overall position has value process V := (Vt )06t6T\ngiven by Vt = X (H)t + np(n)(t, Yt ) so that\ndVt = dX (H)t + n dp(n)(t, Yt ), (8)\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 337\nwhere X (H) = (X (H)t )06t6T is the value of the hedging portfolio in S, satisfying\ndX (H)t =Δ(H)t dSt + r(X (H)t −Δ(H)t St )dt,\nX (H)0 =−np(n)(0, Y0).\nUsing this in (8) along with the Itoˆ formula and the PDE satisfied by p(n)(t, y), we obtain\ndVt = rVt dt + 12β\n2n2b(t, T )α(1− ρ2)Y 2t (p(n)y )2(t, Yt )dt + βn\n√\n1− ρ2Yt p(n)y (t, Yt )dZt , (9)\nwith V0 = 0. We call V the residual risk (or hedging error) process. The term in dZt , orthogonal to\nthe Brownian increments driving the stock price, is interpreted as the unhedgeable component of risk.\nIf ρ = 1, we see that the process V becomes riskless, reflecting the fact that the market incompleteness\ndisappears in this case.\n2.3 Cumulant expansions\nWe are interested in analysing the distribution of the terminal hedging error VT . This is not possible in\nclosed form, so our approach is to use the SDE (9) to simulate V over many asset price histories and\ncompute the distribution of terminal hedging error VT . This is a similar approach to that in Monoyios\n(2004b), but the use of the SDE (9) makes the procedure more efficient than in Monoyios (2004b).\nTo simulate V via (9) efficiently, we use analytic approximations for p(t, y) and py(t, y), in the\nform of power series expansions in powers of a := −α(1− ρ2)n. These arise from a Taylor expansion\nof the indifference pricing function\np(n)(t, y) = 1\nb(t, T )a\nlog EQ\nM[exp(ah(YT ))| Yt = y]. (10)\nFor a random variable X , recall that its cumulant generating function (CGF) (Grimmett & Stirzaker,\n2001; Spanos, 1999) is ΨX (a) := log E exp(aX). Using linearity of the expectation operator, it is not\nhard to see that the CGF has a Taylor expansion of the form\nΨX (a) =\n∞∑\nj=1\n1\nj!k j (X)a\nj ,\nwhere k j (X) ≡ k j is the ‘ j th cumulant’ of X related to the j th central moment of X as described below.\nWriting\nm j (X) := E(X j ), μ j (X) := E[(X − m1) j ], j ∈ N,\nfor the j th raw and central moments, it is not hard to show that\nk1(X)=m1(X),\nk2(X)=μ2(X),\nk3(X)=μ3(X),\nk4(X)=μ4(X)− 3μ22(X),\nk5(X)=μ5(X)− 10μ2(X)μ3(X),\n338 M. MONOYIOS\nwhich can also be expressed in terms of the raw moments only: for j ∈ {2, 3, 4, 5},\nk2 =m2 − m21,\nk3 =m3 − 3m1m2 + 2m31,\nk4 =m4 − 4m1m3 − 3m22 + 12m21m2 − 6m41,\nk5 =m5 − 5m1m4 − 10m2m3 + 20m21m3 + 30m1m22 − 60m31m2 + 24m51, (11)\nwhere the dependence on X is suppressed for brevity.\nSince the pricing function (10) is proportional to the CGF of the pay-off under the minimal measure,\nwe have the following analytic approximation for the indifference pricing function.\nPROPOSITION 3 The indifference pricing function p(n)(t, y) has the power series expansion\np(n)(t, y) = 1\nb(t, T )\n5∑\nj=1\n1\nj!k j (h(YT ))a\nj−1 + O(a5), (12)\nwhere a = −α(1 − ρ2)n and k j is the j th cumulant of the pay-off under QM, conditional on Yt = y.\nThe expansion is valid for model parameters satisfying\nEQ\nM[exp(ah(YT ))|Yt = y] 6 2. (13)\nProof. Expand the exponential inside the expectation in (10) as a Taylor series and use linearity of the\nexpectation operator to give\np(n)(t, y) = 1\nab(t, T )\nlog\n1+ ∞∑\nj=1\na j\nj!m j (h(YT ))\n ,\nwhere m j (h(YT )) ≡ EQM[h j (YT )|Yt = y]. Then, (12) follows from applying the Taylor expansion of\nlog(1+ x). This is valid for |x | 6 1. In our case, this means we require\n∞∑\nj=1\na j\nj!m j (h(YT )) 6 1,\nwhich is implied by (13), and the proof is complete. ¤\nUsing these equations, we are able to produce an accurate perturbation series for p(n)(t, y), as a\nseries of BS-type formulae, which can be differentiated term by term to give an analytic approximation\nfor py(t, y). The leading-order term in the price expansion is Davis’ (1997) marginal price. The terms\nin the expansion depend ultimately on the moments m j := EQM[h j (YT )|Yt = y], j ∈ N, and (in the\ncase of py(t, y)) on their partial derivatives ∂m j := ∂m j\/∂y, j ∈ N. The formulae up to order a4 are\ngiven below in the case of a put option on the nontraded asset. The formulae are extensions of those in\nMonoyios (2004b): first, the power series expansions for p(n)(t, y) and p(n)y (t, y) are extended to higher\norder in a than in Monoyios (2004b); second, we develop a single succinct formula for the j th moment\nm j := EQM[h j (YT )|Yt = y], j ∈ N, and also for its derivative ∂m j := ∂m j\/∂y, j ∈ N. These follow\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 339\nfrom the fact that under QM, conditional upon Yt = y, log YT is normally distributed. With N (M,Σ2)\ndenoting the normal probability law with mean M and variance Σ2, we have\nlog YT ∼N\n(\nlog y + b − 1\n2\nv2, v2\n)\n,\nb= (r − q)(T − t),\nq = r − (ν − βρλ),\nv2 = β2(T − t). (14)\nFor the optimal hedging strategy, the explicit results are obtained by differentiating (12) with respect\nto y, giving the following corollary. Denote by ∂κ j the partial derivative of κ j with respect to y:\n∂κ j ≡ ∂κ j\n∂y\n,\nwhere κ j denotes any of m j , μ j and k j .\nCOROLLARY 1 The partial derivative of the indifference price p(n)(t, y)with respect to y has the power\nseries expansion\n∂p(n)\n∂y\n(t, y) = 1\nb(t, T )\n5∑\nj=1\n1\nj! (∂k j )a\nj−1 + O(a5).\nThe partial derivatives of the cumulants are related to μ j and ∂μ j by\n∂k1 = ∂m1,\n∂k2 = ∂μ2,\n∂k3 = ∂μ3,\n∂k4 = ∂μ4 − 6μ2∂μ2,\n∂k5 = ∂μ5 − 10(μ2∂μ3 + μ3∂μ2).\nFor j ∈ {2, 3, 4, 5}, these relations may recast in terms of m j and ∂m j :\n∂k2 = ∂m2 − 2m1∂m1,\n∂k3 = ∂m3 − 3(m1∂m2 + m2∂m1 − 2m21∂m1),\n∂k4 = ∂m4 − 4(m1∂m3 + m3∂m1)− 6m2∂m2\n+ 12m1(m1∂m2 + 2m2∂m1 − 2m21∂m1),\n∂k5 = ∂m5 − 5(m1∂m4 + m4∂m1)− 10(m2∂m3 + m3∂m2)\n+ 20m1(m1∂m3 + 2m3∂m1)+ 30m2(2m1∂m2 + m2∂m1)\n− 60m21(m1∂m2 + 3m2∂m1 − 2m21∂m1).\n340 M. MONOYIOS\nThe significance of the expansions is that they give easily computed closed-form approximations\nfor the indifference price and optimal hedge. In the specific case of a put option, we have the following\nformulae for the raw moments of the pay-off under the minimal measure QM.\nPROPOSITION 4 For a put option, h(y) = (K − y)+, where K > 0 is the strike price, the j th moment\nm j := EQM[h j (YT )|Yt = y], j ∈ N, is given by\nm j =\nj∑\n`=0\n( j\n`\n)\n(−y)`K ( j−`) exp\n[\n`\n(\nb + 1\n2\n(`− 1)v2\n)]\nN (−d1 − (`− 1)v),\nwhere N (∙) denotes the standard cumulative normal distribution function, and where\nd1 = 1\nv\n[\nlog\n( y\nK\n)\n+ b + 1\n2\nv2\n]\n,\nb= (r − q)(T − t),\nq = r − (ν − βρλ),\nv2 = β2(T − t).\nProof. For the put pay-off, we have, for j ∈ N,\n(h(YT )) j = ((K − YT )+) j\n= (K − YT ) j I{YT6K }\n=\nj∑\n`=0\n j\n`\n (−1)`K ( j−`)Y `T I{YT6K },\nwhere I{YT6K } denotes the indicator function of the event {YT 6 K }. Given the lognormal distribution\n(14) of YT , it is easy to show that\nEQ\nM\n[\nY `T I{YT6K }\n∣∣∣ Yt = y] = y` exp(`(b + 12 (`− 1)v2\n))\nN (−d1 − (`− 1)v),\nfrom which the result follows. ¤\nPROPOSITION 5 Let j ∈ N. For a put option pay-off, h(y) = (K − y)+, ∂m j is given by\n∂m j = −\nj∑\n`=1\n( j\n`\n)\n(−y)(`−1)K ( j−`) exp\n(\n`\n(\nb + 1\n2\n(`− 1)v2\n))\n`N (−d1 − (`− 1)v).\nProof. This is a straightforward (but lengthy) exercise in differentiation. ¤\nWe now have a fast (instantaneous) and accurate (see Monoyios, 2004b) computation of the optimal\nprice and hedging strategy. Note that the leading-order term in the expansion for the price is the marginal\nprice, p̂(t, y) = EQM[h(YT )|Yt = y], of the claim.\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 341\n2.4 Optimal versus naive hedging\nWe wish to compare the hedging of the claim with the optimal strategy with the naive strategy (3) which\ntakes S as a good proxy for Y . To this end, repeat the calculation leading to the residual risk SDE (9),\nbut with the claim traded at the BS price BS(0, Y0) per claim and hedged using the ρ → 1 limit of\nhedging formula (even though the true value of ρ is not equal to 1). This results in the naive hedging\nerror process V N following\ndV Nt = rV Nt dt + nβYt (θ − λ)vy(t, Yt )dt + nβYtvy(t, Yt )[(ρ − 1)dBt +\n√\n1− ρ2 dZt ].\nOnce again, we note that this is not riskless, but becomes so if the true value of ρ is indeed 1. The naive\ntrader hopes this proves a good approximation.\nSuppose the agent sells a put option (so n = −1) on the nontraded asset. Figure 1 shows the optimal\nand naive hedging error distributions generated from 10,000 asset price histories for ρ = 0.75. α = 0.01\nwith the other parameters as in Table 1. Summary statistics for the hedge error distributions, in Table 2,\nshow that the optimal hedge error distribution has a higher mean, lower standard deviation and a higher\nmedian than the naive hedge error distribution. The increased median, in particular, shows how the\nrelative frequency of profits over losses is increased when hedging optimally.\nFIG. 1. Hedging error distributions over 10,000 simulated asset price histories. A short put position is hedged with ρ = 0.75 and\nα = 0.01. The remaining parameters are as in Table 1. The put is sold optimally for price p(−1)(0, Y0) = 13.14 and naively for\nprice BS(0, Y0) = 12.66.\n342 M. MONOYIOS\nTABLE 1 Model parameters for histograms in Fig. 1\nS0 Y0 K r μ σ ν β T\n100 100 110 5% 13% 30% 10% 25% 1 year\nTABLE 2 Summary statistics for histograms in Fig. 1\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n0.4346 9.5902 2.1621 33.40 −41.60\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.8574 10.3724 0.1216 39.11 −47.99\n3. Parameter uncertainty\nThe results above indicate that optimal hedging is beneficial, with the proviso that we know the parame-\nters μ, σ, ν, β and ρ with certainty. This is a strong assumption, of course. The effect of drift parameter\nuncertainty is particularly severe. As Rogers (2001) mentions, one can achieve reasonable confidence\nin estimates of volatilities and correlation with a few years of data, but one needs hundreds of years of\ndata to have any confidence in estimates of drift parameters.\nIt is worth spelling out some precise details on this that do not appear in Rogers (2001). For simplic-\nity, let us take r = 0 and a stock price S following\ndSt = σ St (λ dt + dBt ),\nwhere λ = μ\/σ , and consider an agent trying to infer the value of λ from observations of the share price.\nAssume (unrealistically, of course) for simplicity that the agent observes the stock returns continuously\nand that the volatility σ is known. The agent records the normalized returns\ndSt\nσ St\n= λ dt + dBt ,\nand uses these to estimate λ. Using observations over a time interval [0, t], the best estimate of λ is λˉ(t)\ngiven by\nλˉ(t) = 1\nt\n∫ t\n0\ndSs\nσ Ss\n= λ+ Bt\nt\n. (15)\nThe estimator is normally distributed, λˉ(t) ∼ N (λ, 1\/t), so (λˉ(t) − λ)\/(1\/√t) is a standard normal\nrandom variable. Hence, a 95% confidence interval for λ is[\nλˉ(t)− 1.96√\nt\n, λˉ(t)+ 1.96√\nt\n]\n.\nSuppose that the true parameter values are μ = 20% per annum and σ = 20% per annum so that λ = 1.\nWe ask, for how long do we have to observe the share price to be 95% certain that we know the value\nof λ to within 5% of its true value? That is, we require |λˉ(t)− λ| 6 0.05. This implies that\nλˉ(t)+ 1.96√\nt\n−\n(\nλˉ(t)− 1.96√\nt\n)\n= 0.1,\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 343\nwhich gives t ≈ 1537 years. This gives a measure of the severity of drift parameter uncertainty in\nlognormal models, and it is remarkable that (to the best of our knowledge) the above calculation does\nnot appear in any of the standard financial mathematics texts.\nIn the rest of this paper, we shall restrict our attention to uncertainty in the drifts of the asset prices in\nthe basis risk model, assuming that the agent has precise knowledge of the volatilities and the correlation.\n3.1 Optimal hedging with erroneous drift parameters\nIn this section, we assess the impact of drift parameter misestimation by repeating the simulation experi-\nments of Section 2.4 using erroneous values for the drift parameters μ and ν. That is, we assume that\nthe agent computes the indifference price and optimal hedging strategy using her (incorrect) estimates\nof the parameters, but the simulated asset price histories are generated using the correct values of the\nparameters.\nFigure 2 shows the optimal and naive hedging error distributions from hedging a short put position\nin the case when the agent’s estimates of these parameters are 50% higher than the true values.\nSummary statistics for the hedge error distributions, in Table 4, show that the optimal hedge is still\nsuperior to the naive hedge, though not to the extent seen earlier. (For comparison, Table 5 shows the\nhedging error statistics if the correct drift parameter values are used.) This can be traced to the fact that\nif the agent overestimates ν, she lowers the asking price for the put (relative to the asking price with\nthe true model parameters), so the claim is viewed as less risky than it truly is. The effect of parameter\nFIG. 2. Hedging error distributions over 10,000 simulated asset price histories when the agent overestimates the drifts μ and ν by\n50%. A short put position is hedged with ρ = 0.75 and α = 0.01. The remaining parameters (correct values) are as in Table 3.\nThe agent optimally sells the put for price 10.81 (this price would be 11.45 using the true values of μ and ν) and naively for price\nBS(0, Y0) = 12.50.\n344 M. MONOYIOS\nTABLE 3 Model parameters for histograms in Fig. 2\nS0 Y0 K r μ σ ν β T\n100 100 110 0 13% 18% 10% 15% 1 year\nTABLE 4 Summary statistics for histograms in Fig. 2\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n−0.2962 6.4436 0.8739 20.44 −30.58\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.4788 7.1117 0.1211 27.42 −30.88\nTABLE 5 Summary statistics for hedging a short put when the drifts μ and ν\nare correctly estimated with ρ = 0.75 and α = 0.01. The remaining param-\neters are as in Table 3. The agent optimally sells the put for price 11.45 and\nnaively for price BS(0, Y0) = 12.50\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n0.1923 6.5562 1.3779 21.91 −29.73\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.5089 7.2561 0.0962 26.67 −32.86\nmisestimation in this case is relatively benign, mainly because the misestimation is in the same direction\nfor both drifts μ and ν. As we shall see, this is not always the case.\nTable 6 shows the results if the drifts are both underestimated by 50%. In this case, the optimal\nhedging appears to be even more beneficial than before because the agent perceives the claim to be\nriskier than it truly is, and raises the asking price of the put (relative to the asking price with the true\nmodel parameters).\nTable 7 shows the results when the stock price drift μ is overestimated by 50% and the nontraded\nasset price drift ν is underestimated by 50%. The effect of parameter misestimation now becomes more\nsignificant. The agent believes that the claim is riskier than it truly is, and this effect is exacerbated\nby hedging with a traded asset which the agent believes is a less-effective hedging instrument than it\nreally is. The result is that the agent significantly raises the price at which she sells the option (by about\n50% over the price she would charge if she knew the true drift values), and this results in an optimal\nhedging error distribution that is much more favourable than the naive hedging distribution. Of course,\nthis improvement has come at a cost of selling the claim at a very high price, so the agent becomes a\nvery uncompetitive market maker who may not be able to sell the put at her chosen price.\nFinally, Table 8 shows the results in the case that the stock price drift μ is underestimated by 50%\nand the nontraded asset price drift ν is overestimated by 50%. Now, the effect of parameter misesti-\nmation becomes truly destructive. The agent believes that the claim is ‘less’ risky than it truly is, so\nbecomes overly aggressive, selling the claim for a low price, and this results in an optimal hedging\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 345\nTABLE 6 Summary statistics for hedging a short put when the drifts μ and ν are\nunderestimated by 50% with ρ = 0.75 and α = 0.01. The remaining parameters\nare as in Table 3. The agent optimally sells the put for price 12.11 (this price would\nbe 11.45 using the true values of μ and ν) and naively for price BS(0, Y0) = 12.50\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n0.8916 6.4686 1.9822 23.01 −27.11\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.3958 7.1714 0.2745 28.18 −30.02\nTABLE 7 Summary statistics for hedging a short put when the stock price drift μ\nis overestimated by 50% and the nontraded asset price drift ν is underestimated\nby 50% with ρ = 0.75 and α = 0.01. The remaining parameters are as in Table 3.\nThe agent optimally sells the put for price 18.27 (this price would be 11.45 using\nthe true values of μ and ν) and naively for price BS(0, Y0) = 12.50\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n6.3905 6.6061 7.0682 27.71 −28.69\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.5497 7.3022 0.1482 29.93 −38.36\nTABLE 8 Summary statistics for hedging a short put when the stock price drift μ\nis underestimated by 50% and the nontraded asset price drift ν is overestimated\nby 50% with ρ = 0.75 and α = 0.01. The remaining parameters are as in Table 3.\nThe agent optimally sells the put for price 6.03 (this price would be 11.45 using\nthe true values of μ and ν) and naively for price BS(0, Y0) = 12.50\nEVT sd(VT ) med(VT ) max(VT ) min(VT )\n−4.3950 6.7976 −2.6025 14.55 −35.41\nEV NT sd(V\nN\nT ) med(V\nN\nT ) max(V\nN\nT ) min(V\nN\nT )\n−0.5102 7.2510 0.0854 26.67 −32.86\nerror distribution that is much less favourable than the naive hedging distribution. This would lead to\ndisastrous losses in practice.\nOverall, we conclude that drift parameter misestimation is occasionally benign, but can be extremely\ndestructive, depending on the sign of the misestimation. In Section 4, we propose a Bayesian learning\nalgorithm that may help remedy this situation.\n4. A filtering approach\nIn this section, we acknowledge uncertainty in drift parameters by taking them to be random variables\nwith known prior distribution, and we shall require the agent’s trading strategies to be adapted to the\n346 M. MONOYIOS\nobservation filtration generated by the asset prices S and Y . We shall refer to this problem as one of ‘par-\ntial information’. A number of authors (Lakner, 1995, 1998; Brennan, 1998) have treated the classical\nMerton (1969, 1971) optimal investment problems under partial information. Our approach is similar\nthough our problem is more complex. We show how it is possible to treat the problem as a Markovian\none with only one extra dimension compared to the full information problem.\nFurthermore, we are able to treat a special case, where the agent only has uncertainty in θ , in an\nanalytic fashion. The implementation of the filtering solution to simulated and real data is left as a topic\nfor future work. Here, in a preliminary foray into the filtering approach, we are concerned with showing\nthe ideas behind the technique.\nFor simplicity, we take r = 0. The asset price SDEs are then\ndSt = σ St (λ dt + dBt ),\ndYt = βYt (θ dt + dWt ), (16)\nwhere λ = μ\/σ and θ = ν\/β. We shall suppose that the distributions of λ and θ are normal, with\nλ ∼ N (λ0, v0), θ ∼ N (θ0, γ0).\nWe suppose that the agent infers the values of λ0 and v0 (respectively, θ0 and γ0) by observing the values\nof S (respectively, Y ) over some time interval [−τ, 0], and using classical estimation theory, as described\nby (15). The agent will then filter (update) her estimates of λ and θ from subsequent observations of\nξt := 1\nσ\n∫ t\n0\ndSs\nSs\n= λt + Bt ,\nζt := 1\nβ\n∫ t\n0\ndYs\nYs\n= θ t +Wt , (17)\nover the hedging interval [0, T ]. We can treat this as a standard Kalman filtering problem with the\nfollowing solution.\nTHEOREM 1 Let H := (Ht )06t6T denote the observation filtration, with Ht = F ξt ∪ F ζt , where\n(F ξt )06t6T denotes the natural filtration of ξ (and similarly for ζ ).\nThe problem with partial information can be reduced to one with full information, with the parame-\nters λ and θ replaced by random parameters λˆt ≡ λˆ(t, St ) and θˆt ≡ θˆ (t, Yt ) given by\nλˆ(t, St )= λ0 + v0ξt1+ v0t ,\nθˆ (t, Yt )= θ0 + γ0ζt1+ γ0t , (18)\nwhere\nξt = 1\nσ\nlog\n(\nSt\nS0\n)\n+ 1\n2\nσ t,\nζt = 1\nβ\nlog\n(\nYt\nY0\n)\n+ 1\n2\nβt. (19)\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 347\nThe asset price dynamics are then\ndSt = σ St (λˆ(t, St )dt + dB̂t ), (20)\ndYt = βYt (θˆ(t, Yt )dt + dŴt ), (21)\nwhere Ŵ and B̂ are correlated Brownian motions in the observation filtration.\nProof. We give the analysis for the filtering of the stock price drift. The analysis is identical for the case\nof the nontraded asset.\nUsing the nomenclature of Øksendal (2003) for filtering theory, the ‘observation process’ is ξ =\n(ξt )06t6T , described by\ndξt = λ dt + dBt .\nThe unobservable ‘signal process’ is λ, described by\ndλ = 0.\nDefine the optimally filtered value of λ, the process λˆ = (λˆt )06t6T by the conditional expectation\nλˆt := E[λ|F ξt ], λˆ0 = λ0,\nand denote the conditional variance of λ by the process v = (vt )06t6T , given by\nvt := E[(λ− λˆt )2|F ξt ],\nwith initial value v0.\nThe ‘innovations process’ is B̂ = (B̂t )06t6T , defined by\nB̂t := ξt −\n∫ t\n0\nλˆs ds. (22)\nBy classical filtering results (e.g. Lemma 6.2.6 in Øksendal, 2003), B̂ is an F ξt -Brownian motion. Fur-\nther, by the celebrated Kalman–Bucy filter (e.g. Theorem 6.2.8 in Øksendal, 2003), the optimal filter λˆt\nsatisfies the SDE\ndλˆt = −vt λˆt dt + vt dξt . (23)\nMoreover, vt solves the Riccati equation\ndvt\ndt\n= −v2t ,\nwhich has solution\nvt = v01+ v0t .\nInserting this into (23) and solving the SDE for λˆt give (18). Moreover, ξt = λt + Bt (from (17)), while\nthe stock price SDE (16) has solution\nSt = S0 exp\n(\n−1\n2\nσ 2t + σ(λt + Bt )\n)\n= S0 exp\n(\n−1\n2\nσ 2t + σξt\n)\n,\nfrom which (19) follows.\n348 M. MONOYIOS\nFinally, using the definition (22) of the innovations process, we can write the SDE for the stock in\nterms of processes adapted to the observation filtration as follows:\ndSt = σ St dξt = σ St (λˆt dt + dB̂t ),\nwhich is (20). ¤\nUsing Theorem 1, we can now use standard techniques to solve the agent’s optimal hedging problem\nwith asset price dynamics given by (20) and (21). The agent’s value function is now\nu(t, s, x, y) := sup\nπ∈A\nJ (t, s, x, y;π),\nJ (t, x, y;π) := E[U (XT + nh(YT ))|St = s, Xt = x, Yt = y],\nu(T, s, x, y) = U (x + nh(y)),\nwhere X is the wealth process described by dXt = (πt\/St )dSt .\nDefine the differential operator A(QM)S,Y as the generator of the 2D process S, Y in (20) and (21)\nunder the minimal martingale measure:\nA(QM)S,Y f = 1\n2\nσ 2s2 fss + βy(θˆ − ρλˆ) fy + 12β\n2y2 fyy + ρσβsy fsy,\nfor any function f (t, s, y). We then have the following result.\nPROPOSITION 6 The value function u(t, s, x, y) is given by\nu(t, s, x, y) = −e−αx f (t, s, y), (24)\nwhere the function f satisfies\nft +A(QM)S,Y − 12 λˆ\n2 f − (ρβy fy + σ s fs)\n2\n2 f = 0, (25)\nwith f (T, s, y) = e−αnh(y). The optimal trading strategy is π = (π∗t )06t6T given by π∗t = Π∗(t, St , Yt ),\nwhere\nΠ∗(t, s, y) = λˆ\nσα\n+ ρβy fy + σ s fs\nσα f . (26)\nProof. The HJB equation for u(t, s, x, y) is\nut +ASu +AY u + ρσβsyusy − (λˆux + ρβyuxy + σ susx )\n2\n2uxx\n= 0,\nwhereAS andAY are the generators of the diffusions (20) and (21). The optimal trading strategy is π∗ =\n(π∗t )06t6T given by π∗t = Π∗(t, St , X∗t , Yt ), where the optimal feedback control functionΠ∗(t, s, x, y)\nis given by\nΠ∗(t, s, x, y) := −\n(\nλˆux + ρβyuxy + σ susx\nσuxx\n)\n(27)\nand X∗t is the optimal wealth process satisfying dX∗t = (π∗t \/St )dSt . Now, separate out the dependence\non initial wealth x as in (24). Then, the function f satisfies (25), and the expression (27) for the optimal\ncontrol then simplifies to (26). ¤\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 349\nREMARK 1 In the above proof, we have implicitly supposed that a classical solution to the PDE (25)\nexists, to which the Itoˆ formula can be applied. If this is the case, then optimality of the proposed\nsolution for the value function follows from a verification theorem. In the absence of a classical solution\nto (25), techniques based on generalized solutions such as viscosity solutions would have to be used to\ndemonstrate that the candidate solution is indeed optimal. This will be investigated in future research\nwhen a full solution to the optimal hedging problem under partial information will be sought.\nWe recognize the first term in (26) as the classical Merton strategy. The subsequent terms represent\nthe additional hedging associated with (i) the randomness in Y (the risk from the claim), which includes\nuncertainty in the drift of Y , and (ii) the risk associated with uncertainty in the drift of S.\n4.1 A special case with an analytic solution\nWe now consider the special case that the agent has precise knowledge of the stock price drift, but we\nretain uncertainty in the drift of the nontraded asset. Then, the dependence of the value function and\noptimal trading strategy on S disappears. The problem becomes similar to the full information problem\nand the distortion (Zariphopoulou, 2001) technique can be used to give the following solution for the\nvalue function and optimal trading strategy.\nPROPOSITION 7 In the case where the agent has precise knowledge of the stock price drift, with uncer-\ntainty in the drift of the nontraded asset, the value function and indifference price are given by\nu(t, x, y)=−e−αx− 12λ2(T−t)[H(t, y)]1\/(1−ρ2),\nH(t, y)= EQM[exp(−α(1− ρ2)nh(YT ))|Yt = y],\np(t, y)=− 1\nα(1− ρ2)n log H(t, y),\nwhere QM denotes the minimal martingale measure for the market (20) and (21), under which Y follows\ndYt = β(θˆ(t, Yt )− ρλ)Yt dt + βYt dŴ QMt ,\nand Ŵ QM is a QM-Brownian motion.\nIn this special case, the problem solution becomes remarkably similar to the full information solution\nwith the proviso that the market price of risk of the nontraded asset, θ = ν\/β, is replaced by the random\nprocess θ(t, Yt ). In particular, the optimal hedging strategy for the claim will also be given by a formula\nsimilar to that in Proposition 2.\nIt is feasible that analytic formulae for the indifference price and optimal hedging strategy can be\nderived in this case. This is in progress, as is a numerical solution of the general partial information\nmodel, based upon finite-difference solution of the PDE (25). The aim will be to determine if, with\npartial information and Bayesian updating of the drift parameter estimates, the optimal hedging strategy\nis indeed superior to the BS-style strategy that does not require estimation of the drift parameters.\n5. Conclusions\nWe have developed an efficient approach, based on enhanced analytic approximations for indifference\nprices and optimal hedging strategies, for examining the impact of drift parameter uncertainty on the\n350 M. MONOYIOS\noptimal hedging of a claim on a nontraded asset. This showed that the effect of parameter misestimation\ncan be highly destructive, calling into question whether optimal hedging really is an improvement over a\nBS-style hedge that does not rely on drift parameter estimation. We then developed a filtering approach\nto incorporate Bayesian learning into the drift parameter estimation, and we were able to reduce this\nproblem to one in which the HJB equation increased in dimensionality by only one dimension, compared\nto the full information case. Finally, we were able to treat analytically the special case where the agent\nhas precise knowledge of the stock price drift, while being uncertain of the nontraded asset price drift.\nThis approach shows promise, opening the possibility of incorporating parameter uncertainty into the\noptimal hedging program. The efficacy of such strategies will be the subject of forthcoming work, which\nwill require efficient numerical solution of a 3D PDE. This will allow the optimal hedge to be tested\nover a large number of simulated asset price histories so that the terminal hedging error distribution can\nbe computed. An empirical implementation over real data, as was done in the full information case in\nMonoyios (2004b), will also be a significant topic for future research.\nAcknowledgements\nThis work was presented at the 2006 SIAM Conference on Financial Mathematics and Engineering,\nBoston. The author is grateful to participants in the conference, to seminar participants at Princeton\nUniversity, University of Oxford, the Isaac Newton Institute for Mathematical Sciences and to two\nanonymous referees for helpful comments and suggestions.\nREFERENCES\nBLACK, F. & SCHOLES, M. (1973) The pricing of options and corporate liabilities. J. Polit. Econ., 81, 637–659.\nBRENNAN, M. J. (1998) The role of learning in dynamic portfolio decisions. Eur. Financ. Rev., 1, 295–306.\nDAVIS, M. H. A. (1997) Option pricing in incomplete markets. Mathematics of Derivative Securities (M. A. H.\nDempster & S. R. Pliska eds). Cambridge, UK: Cambridge University Press, pp. 216–226.\nDAVIS, M. H. A. (2006) Optimal hedging with basis risk. From Stochastic Calculus to Mathematical Finance: The\nShiryaev Festschrift (Y. Kabanov, R. Lipster & J. Stoyanov eds). Berlin, Germany: Springer, pp. 169–188.\nFO¨LLMER, H. & SCHWEIZER, M. (1991) Hedging of contingent claims under incomplete information. Applied\nStochastic Analysis (M. H. A. Davis & R. J. Elliott eds), Stochastics Monographs, vol. 5. New York: Gordon &\nBreach, pp. 389–414.\nGRIMMETT, G. & STIRZAKER, D. (2001) Probability and Random Processes, 3rd edn. Oxford: Oxford University\nPress.\nHENDERSON, V. (2002) Valuation of claims on nontraded assets using utility maximization. Math. Financ., 12,\n351–373.\nLAKNER, P. (1995) Utility maximization with partial information. Stoch. Process. Appl., 56, 247–273.\nLAKNER, P. (1998) Optimal trading strategy for an investor: the case of partial information. Stoch. Process. Appl.,\n76, 77–97.\nMERTON, R. C. (1969) Lifetime portfolio selection under uncertainty: the continuous-time case. Rev. Econ. Stat.,\n51, 247–257.\nMERTON, R. C. (1971) Optimum consumption and portfolio rules in a continuous-time model. J. Econ. Theory, 3,\n373–413 (erratum ibid 6, 213–214, 1973).\nMONOYIOS, M. (2004a) Option pricing with transaction costs using a Markov chain approximation. J. Econ. Dyn.\nControl, 28, 889–913.\nMONOYIOS, M. (2004b) Performance of utility-based strategies for hedging basis risk.Quant. Financ., 4, 245–255.\nOPTIMAL HEDGING AND PARAMETER UNCERTAINTY 351\nMUSIELA, M. & ZARIPHOPOULOU, T. (2004) An example of indifference prices under exponential preferences.\nFinanc. Stoch., 8, 229–239.\nØKSENDAL, B. (2003) Stochastic Differential Equations: An Introduction with Applications, 6th edn. Berlin,\nGermany: Springer.\nROGERS, L. C. G. (2001) The relaxed investor and parameter uncertainty. Financ. Stoch., 5, 131–154.\nSPANOS, A. (1999) Probability Theory and Statistical Inference. Cambridge: Cambridge University Press.\nZARIPHOPOULOU, T. (2001) A solution approach to valuation with unhedgeable risks. Financ. Stoch., 5, 61–82.\n"}