{"doi":"10.1109\/TCBB.2008.37","coreId":"65281","oai":"oai:dro.dur.ac.uk.OAI2:6302","identifiers":["oai:dro.dur.ac.uk.OAI2:6302","10.1109\/TCBB.2008.37"],"title":"Consistency of topological moves based on the balanced minimum evolution principle of phylogenetic inference.","authors":["Bordewich, M.","Gascuel, O.","Huber, K. T.","Moulton, V."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"Many phylogenetic algorithms search the space of possible trees using topological rearrangements and some optimality criterion. FastME is such an approach that uses the balanced minimum evolution (BME) principle, which computer studies have demonstrated to have high accuracy. FastME includes two variants: balanced subtree prune and regraft (BSPR) and balanced nearest neighbor interchange (BNNI). These algorithms take as input a distance matrix and a putative phylogenetic tree. The tree is modified using SPR or NNI operations, respectively, to reduce the BME length relative to the distance matrix, until a tree with (locally) shortest BME length is found. Following computer simulations, it has been conjectured that BSPR and BNNI are consistent, i.e. for an input distance that is a tree-metric, they converge to the corresponding tree. We prove that the BSPR algorithm is consistent. Moreover, even if the input contains small errors relative to a tree-metric, we show that the BSPR algorithm still returns the corresponding tree. Whether BNNI is consistent remains open","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65281.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6302\/1\/6302.pdf","pdfHashValue":"c59c7e95e0ca6496026868b2a00ee5fdf57d4cc2","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6302<\/identifier><datestamp>\n      2011-12-06T16:24:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Consistency of topological moves based on the balanced minimum evolution principle of phylogenetic inference.<\/dc:title><dc:creator>\n        Bordewich, M.<\/dc:creator><dc:creator>\n        Gascuel, O.<\/dc:creator><dc:creator>\n        Huber, K. T.<\/dc:creator><dc:creator>\n        Moulton, V.<\/dc:creator><dc:description>\n        Many phylogenetic algorithms search the space of possible trees using topological rearrangements and some optimality criterion. FastME is such an approach that uses the balanced minimum evolution (BME) principle, which computer studies have demonstrated to have high accuracy. FastME includes two variants: balanced subtree prune and regraft (BSPR) and balanced nearest neighbor interchange (BNNI). These algorithms take as input a distance matrix and a putative phylogenetic tree. The tree is modified using SPR or NNI operations, respectively, to reduce the BME length relative to the distance matrix, until a tree with (locally) shortest BME length is found. Following computer simulations, it has been conjectured that BSPR and BNNI are consistent, i.e. for an input distance that is a tree-metric, they converge to the corresponding tree. We prove that the BSPR algorithm is consistent. Moreover, even if the input contains small errors relative to a tree-metric, we show that the BSPR algorithm still returns the corresponding tree. Whether BNNI is consistent remains open. <\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:source>\n        IEEE\/ACM transactions on computational biology and bioinformatics, 2009, Vol.6(1), pp.110-117 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6302<\/dc:identifier><dc:identifier>\n        issn:1545-5963<\/dc:identifier><dc:identifier>\n        doi:10.1109\/TCBB.2008.37<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6302\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1109\/TCBB.2008.37<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6302\/1\/6302.pdf<\/dc:identifier><dc:rights>\n        ©2009 IEEE. This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and all rights therein are retained by authors or by other copyright holders. All persons copying this information are expected to adhere to the terms and constraints invoked by each author's copyright. In most cases, these works may not be reposted without the explicit permission of the copyright holder.\\ud\n\\ud\nPersonal use of this material is permitted. However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1545-5963","issn:1545-5963"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n06 January 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBordewich, M. and Gascuel, O. and Huber, K. T. and Moulton, V. (2009) ’Consistency of topological moves\nbased on the balanced minimum evolution principle of phylogenetic inference.’, IEEE\/ACM transactions on\ncomputational biology and bioinformatics., 6 (1). pp. 110-117.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1109\/TCBB.2008.37\nPublisher’s copyright statement:\n2009 IEEE. This material is presented to ensure timely dissemination of scholarly and technical work. Copyright and\nall rights therein are retained by authors or by other copyright holders. All persons copying this information are\nexpected to adhere to the terms and constraints invoked by each author’s copyright. In most cases, these works may\nnot be reposted without the explicit permission of the copyright holder. Personal use of this material is permitted.\nHowever, permission to reprint\/republish this material for advertising or promotional purposes or for creating new\ncollective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in\nother works must be obtained from the IEEE.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n06 January 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nBordewich, M. and Gascuel, O. and Huber, K. T. and Moulton, V. (2009) 'Consistency of \ntopological moves based on the balanced minimum evolution principle of phylogenetic \ninference.', IEEE\/ACM transactions on computational biology and bioinformatics., 6 (1). pp. \n110-117. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1109\/TCBB.2008.37 \n \nPublisher’s copyright statement: \n©2009 IEEE. This material is presented to ensure timely dissemination of scholarly and \ntechnical work. Copyright and all rights therein are retained by authors or by other copyright \nholders. All persons copying this information are expected to adhere to the terms and \nconstraints invoked by each author's copyright. In most cases, these works may not be \nreposted without the explicit permission of the copyright holder. \n \nPersonal use of this material is permitted. However, permission to reprint\/republish this \nmaterial for advertising or promotional purposes or for creating new collective works for \nresale or redistribution to servers or lists, or to reuse any copyrighted component of this work \nin other works must be obtained from the IEEE. \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nConsistency of Topological Moves Based on\nthe Balanced Minimum Evolution Principle\nof Phylogenetic Inference\nMagnus Bordewich, Olivier Gascuel, Katharina T. Huber, and Vincent Moulton\nAbstract—Many phylogenetic algorithms search the space of possible trees using topological rearrangements and some optimality\ncriterion. FastME is such an approach that uses the balanced minimum evolution (BME) principle, which computer studies have\ndemonstrated to have high accuracy. FastME includes two variants: balanced subtree prune and regraft (BSPR) and balanced nearest\nneighbor interchange (BNNI). These algorithms take as input a distance matrix and a putative phylogenetic tree. The tree is modified\nusing SPR or NNI operations, respectively, to reduce the BME length relative to the distance matrix until a tree with (locally) shortest\nBME length is found. Following computer simulations, it has been conjectured that BSPR and BNNI are consistent, i.e., for an input\ndistance that is a tree metric, they converge to the corresponding tree. We prove that the BSPR algorithm is consistent. Moreover,\neven if the input contains small errors relative to a tree metric, we show that the BSPR algorithm still returns the corresponding tree.\nWhether BNNI is consistent remains open.\nIndex Terms—Phylogenetic tree, topological move, subtree prune and regraft (SPR), BSPR algorithm, Nearest Neighbor Interchange\n(NNI), BNNI algorithm, balanced minimum evolution principle (BME), tree length, quartet distance, Robinson Foulds distance,\nconsistency, safety radius.\nÇ\n1 INTRODUCTION\nMANY practical methods for phylogenetic tree inferenceproceed by repeatedly updating a proposed tree\nusing topological rearrangements until a locally optimal\ntree is found according to some optimality criterion. Such\nmethods include those implemented in the widely used\nPAUP\u0002 [29] and PHYLIP packages [12], and optimality\ncriteria include likelihood and parsimony scores. The most\ncommonly used topological rearrangements are Subtree\nPrune and Regraft (SPR), Nearest Neighbor Interchange\n(NNI), and Tree Bisection and Reconnection (TBR); see [25]\nfor definitions and properties and Section 2 for a brief\ndescription of SPR and NNI moves.\nRecently, such a local topology search approach was\nintroduced for inferring phylogenetic trees from distance\nmatrices, based on the balanced minimum evolution (BME)\nprinciple [6]. The optimality criterion used is to minimize\nPauplin’s [20] tree-length estimate relative to the given\ndistance matrix. This approach is implemented in a soft-\nware called FastME [6]. Two topological rearrangement\npossibilities are available in the latest release of FastME: the\nbalanced subtree prune and regraft (BSPR) algorithm [17] and\nthe balanced nearest neighbor interchange (BNNI) algorithm [6].\nFastME has been shown [6], [7] to be a fast and accurate\nmethod for tree inference, compared to other popular\ndistance-based methods such as NJ [23], BIONJ [15], FITCH\n[13], or WEIGHBOR [3]. Vinh and von Haeseler [30] even\nconcluded “We found that BNNI boosts the topological\naccuracy of all [distance-based] methods.” Note that the\nlocal search range under NNI operations is a subset of that\nunder SPR operations, so BSPR is expected to be at least as\naccurate as BNNI.\nA number of studies have been dedicated to the greedy\nalgorithms used to infer an initial tree for use in a\ntopological search, for example, Atteson’s study of NJ [2].\nHowever, to the best of our knowledge, no one has explored\ntheoretical properties of topological moves in the context of\ntree inference. Here, we will make the first step toward\nfilling this gap in relation to the BME framework and, in\nthis way, shed some light on why BSPR and BNNI work so\nwell in practice. In particular, we consider the following\nquestion. Suppose the matrix of pairwise distances given as\ninput is in fact a tree metric \u0002\u0002, i.e., there is a unique\nphylogenetic tree T \u0002 with positive edge lengths for T \u0002 so\nthat, for each x, y 2 X, the distance \u0002\u0002xy is the length of the\npath between x and y in T \u0002. If we apply the BSPR (BNNI)\nalgorithm starting with distance \u0002\u0002 and any initial phylo-\ngenetic tree T , is the algorithm guaranteed to output T \u0002?\nThat is to say, is the BSPR (BNNI) algorithm consistent?\nNumerous computer simulations have suggested that\nboth the BSPR and BNNI algorithms are consistent [7].\nHere, we prove that the BSPR algorithm is indeed\nconsistent. In fact, we show that even if the input \u0002 contains\n110 IEEE\/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS, VOL. 6, NO. 1, JANUARY-MARCH 2009\n. M. Bordewich is with the Department of Computer Science, University of\nDurham, Science Laboratories, South Road, DH1 3LE, Durham, UK.\nE-mail: m.j.r.bordewich@durham.ac.uk.\n. O. Gascuel is with the team Me´thodes et Algorithmes pour la\nBioinformatique, LIRMM, CNRS–Universite´ Montpellier II, France.\nE-mail: gascuel@lirmm.fr.\n. K.T. Huber and V. Moulton are with the School of Computing Sciences,\nUniversity of East Anglia, NR4 7TJ Norwich, UK.\nE-mail: {katharina.huber, vincent.moulton}@cmp.uea.ac.uk.\nManuscript received 12 Dec. 2007; revised 14 Mar. 2008; accepted 30 Mar.\n2008; published online 16 Apr. 2008.\nFor information on obtaining reprints of this article, please send e-mail to:\ntcbb@computer.org, and reference IEEECS Log Number\nTCBBSI-2007-12-0173.\nDigital Object Identifier no. 10.1109\/TCBB.2008.37.\n1545-5963\/09\/$25.00 \u0002 2009 IEEE Published by the IEEE CS, CI, and EMB Societies & the ACM\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nsome errors but remains sufficiently close to \u0002\u0002, then the\nBSPR algorithm will still output T \u0002 (Theorem 5.2). Here,\nsufficiently close means j\u0002xy \u0003 \u0002\u0002xyj is less than 1\/3 of the\nsmallest edge weight of T \u0002, for all x, y 2 X, i.e., the BSPR\nalgorithm has a safety radius of at least 1\/3. As a corollary,\nwe show that the BME principle itself has a safety radius of\nat least 1\/3, which solves an open question [8]. Safety\nradius analysis was introduced by Atteson [2] and has\nbecome a standard approach to characterize the perfor-\nmance of distance-based tree-building algorithms (see,\ne.g., [9] for a review). In particular, Atteson showed\nthat no distance method can have a safety radius larger\nthan 1\/2 and that NJ and related greedy algorithms have\noptimal 1\/2 safety radius.\nThe rest of the paper is organized as follows: In the\nfollowing section, we review some basic definitions con-\ncerning phylogenetic trees and BME and prove a key lemma\nconcerning the structure of pairs of trees. In Sections 3\nand 4, we prove some results analogous to consistency of\nthe BSPR algorithm for the Robinson-Foulds [22] and the\nquartet [11] tree comparison metrics. In particular, in\nSection 3, we show that for two distinct phylogenetic trees\nT and T \u0002, there is a sequence of SPR operations that\ntransforms T into T \u0002 and decreases the Robinson-Foulds\ndistance to T \u0002 at every step. In Section 4, we prove a similar\nresult for the quartet distance. In Section 5, we show that the\nBSPR algorithm is consistent and has safety radius at least\n1\/3. However, the question remains open for BNNI. This is\ndiscussed along with other open questions in Section 6.\n2 BASICS, DEFINITIONS, AND NOTATION\nA phylogenetic tree is a binary tree T whose leaves are\nbijectively labeled by the elements of some finite set X. The\nset X usually denotes a set of species or taxa, and the tree T\nrepresents the evolutionary relationships between them.\nUnless stated otherwise, from now on,X will denote a finite\nset and all trees considered will be phylogenetic trees on X.\nThroughout, we consider phylogenetic trees as unweighted,\ni.e., they do not have intrinsic edge lengths, with the\nexception of the true tree T \u0002 that does have edge lengths (or\nweights). Furthermore, capital letters will be used in all\nfigures to represent subtrees.\nThe NNI and SPR tree rearrangement operations can be\ndescribed as follows [25]: Suppose that T is the tree\ndepicted in Fig. 1 that A, B, C, C0; . . . ; Ck, and D are\nsubtrees of T as indicated in that figure and that T 0 is a tree\nresulting from one NNI or SPR operation applied to T .\nRegarding NNI, T 0 is obtained from T by deleting some\nedge e ¼ fu; rBg of T , where rB is the root of B, suppressing\nvertex u, and adding an edge e0 between rB and a vertex\nthat subdivides the edge between v and D or between v to\nC, where v is the neighbor of u in T \u0003 e (cf., Fig. 1a).\nRegarding SPR, T 0 is obtained from T by deleting some\nedge e ¼ fu; rBg in T , where again, rB is the root of B,\nsuppressing u, and adding an edge e0 between rB and a\nvertex that subdivides an edge in the component of T \u0003 e\nthat does not contain B (cf., Fig. 1b). Note that in both\noperations, the root of B is unchanged, i.e., the edges e and\ne0 share the same vertex of B.\nThe BSPR (BNNI, respectively) algorithm works as\nfollows: For an input distance matrix \u0002, with entries \u0002xy, x,\ny 2 X, and some phylogenetic tree T on X, the total tree\nlength l^ðT Þ of T (relative to \u0002) is defined according to the\nfollowing formula by Pauplin [20]:\nl^ðT Þ ¼\nX\nx;y2X\n21\u0003pxy\u0002xy; ð1Þ\nwhere pxy denotes the number of edges in the path from x\nto y. Semple and Steel [26] provided an elegant interpreta-\ntion of (1), which we present in Fig. 2 for the convenience\nof the reader. Then, for all trees T 0 that can be obtained\nfrom T by performing a single SPR (NNI, respectively)\noperation on T (see Fig. 1), it is checked whether\nl^ðT Þ \u0003 l^ðT 0Þ > 0. If this holds, i.e., the total tree length of\nT 0 is less than that of T , the tree T 0 is taken in preference\nto T , and the process is iterated. This process is repeated\nuntil a tree T 00 is found with the property that no SPR\noperation (NNI, respectively) on T 00 yields a tree having\nshorter total tree length. Note that 1) if \u0002 is a tree metric\nand T an edge weighted phylogenetic tree that realizes \u0002,\nthen l^ðT Þ is the sum of the branch lengths of T [26], 2) the\nlocal search range under NNI operations is a subset of that\nunder SPR, and 3) the check l^ðT Þ \u0003 l^ðT 0Þ > 0 can be\nperformed efficiently. Indeed, in both BSPR and BNNI, it\nBORDEWICH ET AL.: CONSISTENCY OF TOPOLOGICAL MOVES BASED ON THE BALANCED MINIMUM EVOLUTION PRINCIPLE OF... 111\nFig. 1. A schematic description of (a) an NNI and (b) an SPR operation; see text for details.\nFig. 2. The figure depicts two drawings of the same tree T on the set\nX ¼ fa; b; c; dg. By crossing each edge twice as indicated, the tree\nlength l^ðT Þ of the tree T depicted in (a) equates to 12 ð\u0002ad þ \u0002dc þ \u0002cb þ\n\u0002baÞ and to 12 ð\u0002ac þ \u0002cd þ \u0002db þ \u0002baÞ in (b), where \u0002xy denotes the distance\nbetween any two elements in X. Pauplin’s formula for l^ðT Þ is the\naverage of these two alternative ways to compute l^ðT Þ, i.e.,\nl^ðT Þ ¼ 12 ð12 ð\u0002ad þ \u0002dc þ \u0002cb þ \u0002baÞ þ 12 ð\u0002ac þ \u0002cd þ \u0002db þ \u0002baÞÞ. This interpre-\ntation can be extended to larger trees using circular orderings of X,\nsee [26].\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \ntakes time OðjXj2Þ to evaluate all moves and update all\ndata structures corresponding to the new current tree, see\n[6] and [17] for details.\nA split S ¼ fA;Bg on a taxa set X is a bipartition of X\ninto two nonempty disjoint subsets A, B \u0004 X whose\nunion is X. For ease of notation, we will write AjB or,\nequivalently, BjA for the split fA;Bg. In general, a\ncollection of splits of X is called a split system of X.\nSuppose that T is a tree on X. Then, a split system SðT Þ\ncan be associated to T in the following way. Consider some\nedge e 2 EðT Þ. Then, deleting e induces a split Se ¼ AjB of\nthe leaf set LðT Þ ¼ X, where A is the leaf-label set of one of\nthe resulting connected components, and B is the leaf-label\nset of the other. The collection of splits of X obtained by\ndeleting, in turn, every edge in T is the split system SðT Þ.\nA subtree T 0 of T is any tree that can be obtained from\nT by removing an edge of T and picking of the connected\ncomponents in the resulting graph.1 Note that T 0 can\nalways be thought of as a tree rooted at the unique vertex\nin e \\ V ðT 0Þ or as unrooted by suppressing this degree\n2 vertex. For convenience, we will always denote the root\nof a subtree T 0 of T by rT 0 . Note also that every leaf of T\nis a subtree of T .\nGiven two subtreesA andB ofT , we callA andB disjoint if\nV ðAÞ \\ V ðBÞ ¼ ;. IfA andB are disjoint and there exist some\nvertexx 2 V ðT Þ such that erA ¼ fx; rAg; erB ¼ fx; rBg 2 EðT Þ,\nthen we denote the subtree of T with vertex set V ðAÞ [\nV ðBÞ [ fxg and edge set EðAÞ [ EðBÞ [ ferA ; erBg by A [B.\nWe conclude this section with a lemma concerning trees\nthat will be helpful throughout the paper. Given a tree T ,\nwe call a pair of leaves a, b in T , which are incident with the\nsame vertex a cherry of T and denote the set of cherries of T\nby CðT Þ.\nLemma 2.1. Suppose T and T \u0002 are two trees with distinct\ntopologies. Then, there exist disjoint subtrees B, D in T such\nthat B, D, and B [D are subtrees of T \u0002, but B [D is not a\nsubtree of T .\nProof. Suppose T and T \u0002 are two trees with distinct\ntopologies. To prove the lemma, we distinguish between\nthe cases that 1) there exist elements x, y 2 X such that x\nand y form a cherry in T \u0002 but not in T , and 2)\nCðT \u0002Þ \u0004 CðT Þ.\nSuppose that case 1 holds, i.e., there exist x, y 2 X\nsuch that x and y form a cherry in T \u0002 but not in T . Then,\ntaking B to be the subtree x andD to be the subtree y, the\nstatement holds.\nNow, suppose case 2 holds, i.e., CðT \u0002Þ \u0004 CðT Þ.\nAssociate to T and T \u0002 new trees T and T \u0002, respectively,\nby contracting every cherry, with labels a and b, say, of\nCðT \u0002Þ in both T and T \u0002, into a leaf which we label fa; bg.\nClearly, since T and T \u0002 have distinct topologies, T and\nT \u0002 have distinct topologies.\nNow, define X to be the leaf-label set of T . If there\nexist x, y 2 X such that x and y form a cherry in T \u0002 but\nnot in T , then we define the trees B andD as described in\ncase 1 (with X, T , and T \u0002 replaced by X, T , and T \u0002,\nrespectively). The required subtrees B and D of T and T \u0002\ncan then be obtained from B and D by expanding every\nleaf labeled by a subset A of X of size 2, to a cherry with\nlabel set A. If, on the other hand, CðT \u0002Þ \u0004 CðT Þ, then we\niterate the contraction process until we have found two\nbinary leaf labeled trees T and T \u0002 for which there is a\ncherry in CðT \u0002Þ, which is not in CðT Þ. From this cherry,\nwe obtain B andD, and the required subtrees B andD of\nT and T \u0002 can then be obtained by repeatedly applying\nthe above described expansion process. tu\n3 ROBINSON-FOULDS DISTANCE\nThe Robinson-Foulds distance [22] is tree comparison metric\nthat is commonly used to measure dissimilarity between\nphylogenetic trees on the same leaf set. For two trees T1 and\nT2 on X, it is defined by\ndRF ðT1; T2Þ ¼ SðT1Þ \u0003 SðT2Þj j þ SðT2Þ \u0003 SðT1Þj j:\nNote that T1 and T2 have the same topology if and only if\ndRF ðT1; T2Þ ¼ 0.\nIn this section, we prove the following result.\nTheorem 3.1. If T \u0002 is a fixed tree and T is any other tree, then\nthere is a sequence of trees T0 ¼ T; T1; . . . ; Tk ¼ T \u0002, such that\n1. tree Tiþ1 is obtained from Ti by a single SPR-\noperation, and\n2. dRF ðTi; T \u0002Þ \u0003 dRF ðTiþ1; T \u0002Þ > 0,\nfor all 0 \u0005 i \u0005 k\u0003 1.\nThis result is a direct consequence of the following\nlemma. For two trees, T1 and T2, the SPR-distance\ndSPRðT1; T2Þ between T1 and T2 is the minimal number of\nSPR-operations needed to transform the topology of T1 into\nthat one of T2.\nLemma 3.2. Suppose T and T \u0002 are two trees with distinct\ntopologies. Then, there exists a tree T 0 such that dSPRðT; T 0Þ ¼\n1 and dRF ðT \u0002; T 0Þ < dRF ðT \u0002; T Þ.\nProof. Suppose T and T \u0002 are two trees with distinct\ntopology. Then, by Lemma 2.1, there exist disjoint\nsubtrees B, D in T such that B and D are subtrees of\nT \u0002, and the subtree B [D is also a subtree of T \u0002 but not\nof T . Consider the tree T 0 obtained from T by pruning\nthe subtree B and regrafting it adjacent to D (see Fig. 3),\ngiving rise to a new vertex p. Clearly, dSPRðT; T 0Þ ¼ 1.\nTo see that the inequality stated in the lemma holds,\nwe distinguish between two types of splits displayed by\nT . For R denoting either T or T 0, let SbðRÞ denote the set\nof splits in SðRÞ, which correspond to the edges in the\npath from a to b in case R ¼ T and the edges in the path\nfrom s to p in case R ¼ T 0. For the convenience of the\nreader, we indicate these edges in bold (see Fig. 3). Put\nSnbðRÞ ¼ SðRÞ \u0003 SbðRÞ. Note that the latter set also\ncontains those splits that correspond to an edge in the\nsubtrees B, D, or in one of the subtrees of R indicated by\nC0; . . . ; Ck, k \u0006 0, in Fig. 3.\nNow, suppose that S is a split on X. Then, by\nconstruction, S 2 SnbðT Þ if and only if S 2 SnbðT 0Þ. Let\nS1 ¼ LðBÞjX \u0003 LðBÞ and S2 ¼ LðDÞjX \u0003LðDÞ. Note that\nS1; S2 2 SnbðT Þ \\ SnbðT 0Þ \\ SðT \u0002Þ. Let Se denote the split\n112 IEEE\/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS, VOL. 6, NO. 1, JANUARY-MARCH 2009\n1. Note that this definition of a subtree is more restrictive than the one\nthat is commonly used, as described in, e.g., [25].\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nin SðT 0Þ that corresponds to the edge e 2 EðT 0Þ as\nspecified in Fig. 3. Observe that\n1. SnbðT Þ ¼ SnbðT 0Þ,\n2. SbðT Þ \\ SðT \u0002Þ ¼ ;, since the only splits of T \u0002\nwhich separate B and D are S1 and S2, and\n3. SbðT 0Þ \\ SðT \u0002Þ 6¼ ; since Se is a split of T 0 and T \u0002.\nHence, it follows that\nSðT \u0002Þ \u0003 SðT Þj j ¼ SðT \u0002Þ \u0003 SnbðT Þ \u0003 SbðT Þj j\n¼ SðT \u0002Þ \u0003 SnbðT 0Þ \u0003 SbðT Þj j\n> SðT \u0002Þ \u0003 SnbðT 0Þ \u0003 SbðT 0Þj j\n¼ SðT \u0002Þ \u0003 SðT 0Þj j:\nSince the trees are binary, they all have the same number\nof internal edges and hence splits. Thus,\nSðT Þ \u0003 SðT \u0002Þj j ¼ SðT \u0002Þ \u0003 SðT Þj j > SðT \u0002Þ \u0003 SðT 0Þj j\n¼ SðT 0Þ \u0003 SðT \u0002Þj j:\nThe inequality stated in the lemma follows. tu\n4 QUARTET DISTANCE\nIn this section, we prove the following analogous result to\nTheorem 3.1 in which we replace the Robinson-Foulds\ndistance dRF by the quartet distance dQ, another popular\ntree-comparison metric [5], [11], [19], [27].\nWe start with recalling the definition of the quartet\ndistance. Let QðXÞ denote the set of all quartets of X, that is,\nsplits AjB of subsets of X of size 4 with jAj ¼ 2 ¼ jBj. For\nbrevity, we write abjcd rather than fa; bgjfc; dg with\nfa; b; c; dg \u0004 X. For a tree T and a quartet abjcd, we say that\nT displays abjcd if there exists some splitAjB 2 SðT Þ such that\na, b 2 A, and c, d 2 B. Let QðT Þ denote the set of all quartets\ndisplayed by a treeT . Then, for two treesT1 andT2, the quartet\ndistance dQðT1; T2Þ between T1 and T2 is defined as\ndQðT1; T2Þ ¼ QðT1Þ \u0003QðT2Þj j þ QðT2Þ \u0003QðT1Þj j:\nIn contrast to the Robinson-Foulds distance, the quartet\ndistance between any tree T and the optimal tree T \u0002 can be\ndirectly estimated from the data. For example, the popular\nQuartet Puzzling algorithm [28] first estimates all quartets\nusing maximum likelihood based on the sequences corre-\nsponding to each of the taxa and then builds a tree in a greedy\nway, trying to maximize the number of quartets being\ndisplayed by the inferred tree. Theorem 4.1 is thus related\nto the consistency of SPR-moves when the input is given in\nterms of quartets. In particular, assuming that these quartets\nexactly correspond to a phylogenetic tree T \u0002, it shows thatwe\nare able to recover T \u0002 starting from any tree T by simply\napplying SPR moves and using the quartet distance.\nTheorem 4.1. If T \u0002 is a fixed tree and T is any other tree, then\nthere is a sequence of trees T0 ¼ T; T1; . . . ; Tk ¼ T \u0002, such that\n1. tree Tiþ1 is obtained from Ti by a single SPR-\noperation, and\n2. dQðTi; T \u0002Þ \u0003 dQðTiþ1; T \u0002Þ > 0,\nfor all 0 \u0005 i \u0005 k\u0003 1.\nTheorem 4.1 is a direct consequence of the following\nlemma, which is an analog of Lemma 3.2.\nLemma 4.2. Let T and T \u0002 be two trees with distinct topologies.\nThen, there exists a tree T 0 such that dSPRðT; T 0Þ ¼ 1 and\ndQðT \u0002; T 0Þ < dQðT \u0002; T Þ.\nProof. Let B and D denote two disjoint subtrees of T and T \u0002\nsuch that B [D is a subtree of T \u0002 but not of T (which\nmust exist by Lemma 2.1). We consider the following\ntwo trees: T 0 formed by pruning B and regrafting it\nadjacent to D, and T 00 formed by pruning D and\nregrafting it adjacent to B.\nFor R 2 fT; T 0; T 00g, we consider a partition of the\nset QðRÞ of displayed quartets into four classes\nQR0 ; Q\nR\n1 ; Q\nR\n2 ; Q\nR\n3 defined as follows:\nQR0 ¼\n\u0002\nwx\n\u0003\u0003yz 2 QðRÞ : either fw; x; y; zg \\Bj j > 1\nor fw; x; y; zg \\Dj j > 1\nor fw; x; y; zg \\Bj j ¼ 0 ¼ fw; x; y; zg \\D\u0003\u0003\u0004;\nQR1 ¼\n\u0002\nwxjyz 2 QðRÞ : fw; x; y; zg \\Bj j ¼ 1\nand fw; x; y; zg \\Dj j ¼ 0\u0004;\nQR2 ¼\n\u0002\nwxjyz 2 QðRÞ : fw; x; y; zg \\Bj j ¼ 0\nand fw; x; y; zg \\Dj j ¼ 1\u0004; and\nQR3 ¼\n\u0002\nwxjyz 2 QðRÞ : fw; x; y; zg \\Bj j ¼ 1\n¼ fw; x; y; zg \\Dj j\u0004:\nNote that\nQT0 ¼ QT\n0\n0 ¼ QT\n00\n0 ; ð2Þ\nand\nQT3 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 < QT 03 \\QðT \u0002Þ\u0003\u0003 \u0003\u0003 ¼ QT 003 \\QðT \u0002Þ\u0003\u0003 \u0003\u0003: ð3Þ\nFor R 2 fT; T 0; T 00g, a fixed leaf x, and j 2 f0; 1; 2; 3g,\nlet QRj ðxÞ be the subset of QRj consisting of quartets\ncontaining x. Now, fix some b 2 B. Observe that since B\nis a subtree of T \u0002,\nQT1 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jBj QT1 ðbÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003:\nBORDEWICH ET AL.: CONSISTENCY OF TOPOLOGICAL MOVES BASED ON THE BALANCED MINIMUM EVOLUTION PRINCIPLE OF... 113\nFig. 3. The trees T and T 0 considered in the proof of Lemma 3.2.\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nSimilarly, for a fixed leaf d 2 D, we have\nQT2 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jDj QT2 ðdÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003:\nMoreover, since B and D are adjacent in T \u0002, we can\nconclude that\nQT\n00\n1 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jBj QT1 ðbÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003 and\nQT\n00\n2 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jDj QT1 ðbÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003:\nSimilarly, we can conclude that\nQT\n0\n1 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jBj QT2 ðdÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003 and\nQT\n0\n2 \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003 ¼ jDj QT2 ðdÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003:\nHence,\nQT\n00\n1 [QT\n00\n2\n\u0005 \u0006\n\\QðT \u0002Þ\n\u0003\u0003\u0003 \u0003\u0003\u0003\u0003 QT1 [QT2\u0007 \b \\QðT \u0002Þ\u0003\u0003 \u0003\u0003\n¼ jDj QT1 ðbÞ \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003\u0003 QT2 ðdÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003\u0007 \b;\nand\nQT\n0\n1 [QT\n0\n2\n\u0005 \u0006\n\\QðT \u0002Þ\n\u0003\u0003\u0003 \u0003\u0003\u0003\u0003 QT1 [QT2\u0007 \b \\QðT \u0002Þ\u0003\u0003 \u0003\u0003\n¼ jBj QT2 ðdÞ \\QðT \u0002Þ\n\u0003\u0003 \u0003\u0003\u0003 QT1 ðbÞ \\QðT \u0002Þ\u0003\u0003 \u0003\u0003\u0007 \b:\nSince these cannot both be negative, and by (2) and (3),\neither\nQðT Þ \\QðT \u0002Þj j < QðT 0Þ \\QðT \u0002Þj j\nor\nQðT Þ \\QðT \u0002Þj j < QðT 00Þ \\QðT \u0002Þj j\nholds. The result now follows. tu\n5 SPR MOVES AND THE BME TREE LENGTH\nIn this section, we prove the main result of the paper\n(Theorem 5.2), from which it immediately follows that the\nBSPR algorithm is consistent with safety radius 13 . Note that\nfor the rest of this section, we assume that we are given a\nmatrix \u0002 of estimated distances on X, which corresponds in\npractice to estimated evolutionary distances between ele-\nments of X.\nThe key tool used in our proof is [6, eq. (10)], which we\nnow recall. First, for any tree R and for any two disjoint\nsubtrees U and V of R, we define the balanced average\ndistance \u0002RUV between the leaf sets of U and V recursively as\nfollows: If U and V only contain a single taxa u and v,\nrespectively, then \u0002RUV is equal to the estimated distance \u0002uv\nbetween u and v. Moreover, if one of U and V , say, V , is of\nthe form V ¼ V1 [ V2 for disjoint subtrees V1 and V2, then\n\u0002RUV ¼ \u0002RUðV1[V2Þ ¼\n1\n2\n\u0002RUV1 þ \u0002RUV2\n\u0005 \u0006\n: ð4Þ\nThis definition is motivated by the observation that in\nbiological studies a single isolated taxon often gives as\nmuch information as a cluster containing several remote\ntaxa [24]. Also, by placing less weight on pairs of taxa that\nare separated by numerous edges, it addresses the problem\nthat long evolutionary distances are poorly estimated (see,\n[8, Sec. 1.2.7)] and [6] for more details).\nNow, let T be the tree on the left in Fig. 1a and T 0 be the\ntree obtained from T by interchanging the subtrees B and C\nof T (i.e., T 0 is the tree depicted in the right of Fig. 1a). Then,\nwith the total tree length as defined by (1) in Section 1,\n[6, eq. (10)] states that\nl^ðT Þ \u0003 l^ðT 0Þ ¼ 1\n4\n\u0002TAB þ \u0002TCD\n\u0007 \b\u0003 \u0002TAC þ \u0002TBD\u0007 \b\t \n: ð5Þ\nAs mentioned in the introduction, this formula allows a\nsignificant improvement of the efficiency of the BNNI\nalgorithm [6].\nMoreover, the balanced framework allows for simple\nedge length estimators [20] (see also [7]). Let e be the branch\nshown in Fig. 4 and assume that B is composed of two\ndisjoint subtrees B0; B00, i.e., B ¼ B0 [B00. The estimated\nlength of e is then equal to\nl^ðeÞ ¼ 1\n2\n\u0003\u0002TB0B00 þ \u0002TBA þ \u0002TBC \u0003 \u0002TAC\n\u0007 \b\n; ð6Þ\nwhere the same formula holds if B is a leaf by defining\n\u0002TB0B00 ¼ 0.\nAs a first step toward proving Theorem 5.2, we look at\nhow a single SPR-operation applied to a tree T affects the\ntotal tree length of T .\nLemma 5.1. Let T and T 0 be the trees given in Fig. 5 so that T 0 can\nbe obtained from T by a single SPR operation inwhich subtreeB\nis pruned and regrafted. Then,\n114 IEEE\/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS, VOL. 6, NO. 1, JANUARY-MARCH 2009\nFig. 4. Edge length estimation from average distance between subtrees\nusing (6).\nFig. 5. The trees T and T 0 have an SPR-distance 1: C0; . . . ; Ck, B, and D denote subtrees of T (or equivalently of T 0).\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nl^ðT Þ \u0003 l^ðT 0Þ ¼ 1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0002TC0B \u0003 \u0002TBD\n\u0005 \u0006\nþ\nXk\ni¼1\n1\n2k\u0003iþ2\n\u0002TCiD \u0003 \u0002TCiB\n\u0005 \u0006\n\u0003 1\n2iþ1\n\u0002TC0Ci \u0003 \u0002TCiB\n\u0005 \u0006\r \u000e\n:\nProof. We first provide a reformulation of (5), which gives\nthe difference in tree length when performing one NNI\noperation. Let T and T 0 be the two trees in Fig. 1a, in\nwhich T 0 is obtained from T by using a single NNI\noperation, and let e and e0 be the edges connecting B in T\nand T 0, respectively. Using (4), (5), and (6), it follows that\nl^ðeÞ \u0003 l^ðe0Þ ¼ 1\n2\n\u0003\u0002TB0B00 þ \u0002TBA þ \u0002TBðC[DÞ \u0003 \u0002TAðC[DÞ\n\u0005 \u0006\n\u0003 1\n2\n\u0003\u0002TB0B00 þ \u0002TBD þ \u0002TBðA[CÞ \u0003 \u0002TDðA[CÞ\n\u0005 \u0006\n¼ 1\n4\n\u0002TAB þ \u0002TCD \u0003 \u0002TAC \u0003 \u0002TBD\n\u0007 \b\n¼ l^ðT Þ \u0003 l^ðT 0Þ:\nIn other words, the difference in tree length is simply the\ndifference between the lengths of edges e and e0.\nWe now show that this property also holds for SPR\nmoves. Let T and T 0 be the two trees shown in Fig. 5, and\nlet e and e0 denote the edges connecting B in T and T 0,\nrespectively. Moreover, consider the series of trees\nT ¼ T0; T1; T2; . . . ; Tk ¼ T 0, where T1 is obtained from T\nby one NNI move exchanging B, and C1, T2 is obtained\nfrom T1 by one NNI move exchanging B, and C2; . . . ; T\n0\nis obtained from Tk\u00031 by one NNI move exchanging B\nand Ck. Let e ¼ ei be the edge connecting B in Ti. Just as\nwith the NNI move, we have\nl^ðT Þ \u0003 l^ðT 0Þ ¼\nXk\u00031\ni¼0\nl^ðTiÞ \u0003 l^ðTiþ1Þ\n¼\nXk\u00031\ni¼0\nl^ðeiÞ \u0003 l^ðeiþ1Þ ¼ l^ðeÞ \u0003 l^ðe0Þ:\nUsing the equation above and (4) and (6), it follows that\nl^ðT Þ \u0003 l^ðT 0Þ\n¼ \u0002\nT\nBC0\n2\nþ\nXk\ni¼1\n\u0002TBCi\n2iþ1\nþ \u0002\nT\nBD\n2kþ1\n\u0003\nXk\ni¼1\n\u0002TC0Ci\n2iþ1\n\u0003 \u0002\nT\nDC0\n2kþ1\n\u0003 \u0002\nT 0\nBD\n2\nþ\nXk\ni¼1\n\u0002T\n0\nBCi\n2k\u0003iþ2\nþ \u0002\nT 0\nBC0\n2kþ1\n\u0003\nXk\ni¼1\n\u0002T\n0\nDCi\n2k\u0003iþ2\n\u0003 \u0002\nT 0\nDC0\n2kþ1\n !\n:\nSince the topological structure within each labeled\nsubtree in Fig. 5 is the same in T and T 0, we have \u0002TUV ¼\n\u0002T\n0\nUV for all U , V 2 fB;C0; . . . ; Ck;Dg. The lemma now\nfollows by simplifying this formula. tu\nWe now prove our main result. Suppose T \u0002 is a fixed\nedge-weighted phylogenetic tree on X and, for any edge e\nof T \u0002, denote the length of e in T \u0002 by lðeÞ. In addition, let \u0002\u0002\ndenote the distance on X defined by taking shortest paths\nbetween the leaves of T \u0002 so that, in particular, \u0002\u0002 is a binary\ntree metric. Recall that we also have a matrix \u0002 containing\nestimates of the distances given by \u0002\u0002.\nTheorem 5.2. Let T be a tree having a different topology to T \u0002.\nLet B and D be disjoint subtrees in T such that B, D, and\nB [D are subtrees of T \u0002, but B [D is not a subtree of T . Let\nT 0 be obtained from T by pruning the subtree B and regrafting\nit adjacent to D. Then, provided that j\u0002ab \u0003 \u0002\u0002abj < \u0003 :¼\n1\n3mine2EðT \u0002Þ lðeÞ for all a, b 2 X, we have l^ðT Þ \u0003 l^ðT 0Þ > 0.\nProof. Note that B and D are well defined by Lemma 2.1.\nLet C0; . . . ; Ck denote the subtrees depicted in Fig. 5, as\nin Lemma 5.1. For notational simplicity, for any two\ndisjoint subtrees U , V of T , we will write \u0002UV for \u0002\nT\nUV\nand for any subtree U of T and leaf v 62 U , we will\nwrite \u0002Uv for \u0002\nT\nUfvg. Let x be the parent vertex of\nsubtrees B and D in T \u0002. Let ex be the edge adjacent to\nx but not B or D (see Fig. 6). Then, for any subtree A\nin T \u0002 disjoint with B, we have \u0002AB ¼\nP\nb2B 2\n1\u0003pxb\u0002Ab,\nwhere pxb is the number of edges in the path from x\nto b in T \u0002. Likewise, \u0002AD ¼\nP\nd2D 2\n1\u0003pxd\u0002Ad. SinceP\nb2B 2\n1\u0003pxb ¼ 1 ¼Pd2D 21\u0003pxd , Lemma 5.1 yields\nl^ðT Þ \u0003 l^ðT 0Þ\n¼\nX\nb2B;d2D\n22\u0003pxb\u0003pxd\n\"\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0002C0b \u0003 \u0002bdð Þ\nþ\nXk\ni¼1\n1\n2k\u0003iþ2\n\u0002Cid \u0003 \u0002Cibð Þ \u0003\n1\n2iþ1\n\u0002C0Ci \u0003 \u0002Cibð Þ\n\r \u000e#\n:\nð7Þ\nWe now consider a specific pair b 2 B and d 2 D and\nexamine its contribution to the summation over b and d\nin (7). To this end, we denote the sum of the lengths of\nthe edges in the path Pxb between x and b in T\n\u0002 by \u0002\u0002xb and\nsimilarly define \u0002\u0002xd.\nSince the path in T \u0002 from any taxon in Ci to any taxon\nin B or D must pass through x and the error in any\nestimated distance is at most \u0003, we have\nXk\ni¼1\n1\n2k\u0003iþ2\nð\u0002Cid \u0003 \u0002CibÞ \u0006\nXk\ni¼1\n1\n2k\u0003iþ2\n\u0002\u0002Cid \u0003 \u0002\u0002Cib \u0003 2\u0003\n\u0005 \u0006\n¼ 1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0002\u0002xd \u0003 \u0002\u0002xb \u0003 2\u0003\n\u0007 \b\n;\nand also\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0003\u0002bdð Þ \u0006 1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0003\u0002\u0002xd \u0003 \u0002\u0002xb \u0003 \u0003\n\u0007 \b\n:\nIn addition\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u0002C0b ¼\nXk\ni¼1\n1\n2iþ1\n\u0002C0b\n\r \u000e\n:\nBORDEWICH ET AL.: CONSISTENCY OF TOPOLOGICAL MOVES BASED ON THE BALANCED MINIMUM EVOLUTION PRINCIPLE OF... 115\nFig. 6. Sketch illustrating the proof of Theorem 5.2.\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nHence, (7) implies\nl^ðT Þ \u0003 l^ðT 0Þ \u0006\nX\nb2B;d2D\n22\u0003pxb\u0003pxd\n\"\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u00032\u0002\u0002xb \u0003 3\u0003\n\u0007 \b\nþ\nXk\ni¼1\n1\n2iþ1\nð\u0002C0b \u0003 \u0002C0Ci þ \u0002CibÞ\n\r \u000e#\n:\nð8Þ\nNow, consider the term ð\u0002C0b \u0003 \u0002C0Ci þ \u0002CibÞ. For\nc0 2 C0, ci 2 Ci let zc0ci be the vertex in T \u0002 on the path\nbetween c0 and ci at which the path to the subtree B [D\nis attached, (see Fig. 6). Then,\nð\u0002c0b \u0003 \u0002c0ci þ \u0002cibÞ \u0006 \u0002\u0002c0b \u0003 \u0002\u0002c0ci þ \u0002\u0002cib \u0003 3\u0003\n\u0005 \u0006\n¼ \u0007\u0002\u0002c0zc0ci þ \u0002\u0002zc0ci b \u0003 \u0002\u0002c0zc0ci\n\u0003 \u0002\u0002zc0ci ci þ \u0002\n\u0002\ncizc0ci\nþ \u0002\u0002zc0ci b \u0003 3\u0003\n\b\n¼ 2\u0002\u0002zc0ci b \u0003 3\u0003\n\u0006 2lðexÞ þ 2\u0002\u0002xb \u0003 3\u0003:\nIt follows that ð\u0002C0b \u0003 \u0002C0Ci þ \u0002CibÞ \u0006 2lðexÞ þ 2\u0002\u0002xb \u0003 3\u0003,\nand therefore, (8) implies\nl^ðT Þ \u0003 l^ðT 0Þ \u0006\nX\nb2B;d2D\n22\u0003pxb\u0003pxd\n\"\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n\u00032\u0002\u0002xb \u0003 3\u0003\n\u0007 \b\nþ\nXk\ni¼1\n1\n2iþ1\n2lðexÞ þ 2\u0002\u0002xb \u0003 3\u0003\n\u0007 \b\r \u000e#\n¼\nX\nb2B;d2D\n22\u0003pxb\u0003pxd\n1\n2\n\u0003 1\n2kþ1\n\u000b \f\n2 lðexÞ \u0003 3\u0003ð Þ\n\r \u000e\n¼ð1\u0003 2\u0003kÞ lðexÞ \u0003 3\u0003ð Þ\n> 0:\nThis completes the proof. tu\nWe next show that our results imply that the safety\nradius of the BME principle itself is at least 1\/3. Recall that\nBSPR and BNNI are only heuristics for finding a tree of\nminimal tree length. The following corollary states that the\ntree that achieves the minimal tree length is the correct tree\nprovided that the errors in the distance matrix are at most\n1\/3 the minimum edge length. In particular, this radius is\nindependent of the method used to find the shortest tree.\nCorollary 5.3. Suppose that j\u0002ab \u0003 \u0002\u0002abj < \u0003 :¼ 13mine2EðT \u0002Þ lðeÞ\nfor all a, b 2 X, then the unique phylogenetic tree that\nminimizes tree length relative to \u0002 is T \u0002.\nProof. Suppose for contradiction that there is a tree T distinct\nfrom T \u0002 that minimizes tree length relative to \u0002, i.e., l^ðT Þ \u0005\nl^ðT 0Þ for all trees T 0. Thus, l^ðT Þ is minimal relative to \u0002. By\nLemma 2.1, there exist disjoint subtreesB,D inT such that\nB, D, and B [D are subtrees of T \u0002, but B [D is not a\nsubtree of T . By Theorem 5.2, there exists a tree T 0 distinct\nfrom T such that l^ðT Þ \u0003 l^ðT 0Þ > 0, i.e., l^ðT Þ > l^ðT 0Þ, contra-\ndicting the minimality of l^ðT Þ. tu\n6 DISCUSSION\nIn this paper, we have shown that the BSPR algorithm is\nconsistent. As noted in the introduction, SPR moves are\nmore general than NNI moves in that any SPR move can be\nachieved through a sequence of NNI moves (Fig. 1). It\nwould be interesting to know whether BNNI is also\nconsistent.\nIn addition to consistency, we have shown that BSPR has\nsafety radius of at least 1\/3. Can this result be improved or\nextended to other variants of minimum evolution (ME) and\nto different search algorithms? We make the following\nobservations.\n1. As previously mentioned, no distance based method\ncan have a safety radius greater than 1\/2 [2].\n2. We have observed that our results imply that\nthe safety radius of the BME principle itself is at\nleast 1\/3. In particular, this radius is independent of\nthe method used to find the shortest tree. We believe\nthat the BME safety radius should be 1\/2 but a proof\nremains to be found.\n3. Several variants of ME are discussed in the literature\nand are implemented within various computer\nprograms. The most common, first proposed by Kid\nand Sgaramella-Zonta [18] and studied in depth by\nRzhetsky and Nei [21], estimates tree edge lengths\nusing ordinary least squares (OLS) and defines the\ntree length estimate to be the sum of the edge length\nestimates (including the negative ones). In [31], it is\nshown that this OLS version of ME has safety radius\nat most 1\/4 as the number of taxa grows large.\nMoreover, Gascuel and Guillemot [16] have recently\nshown that OLS-ME actually has safety radius\nconverging to 0 as the number of taxa tends to\ninfinity. These results could explain the poor accu-\nracy of OLS-ME compared to BME, which has been\nobserved in simulations (e.g., [6]). Moreover, it\nsuggests that our approach to proving the consis-\ntency of the BSPR algorithm will not apply to the\nOLS-ME variant without significant modification.\nIn summary, there are a number of open problems in the\ncontext of using topological moves for inferring phyloge-\nnetic trees. We believe that this is an important direction for\nfurther research and that such research should yield\nfundamental insights into the performance of some com-\nmonly used tree inference methods.\nACKNOWLEDGMENTS\nThe authors would like to thank the Isaac Newton Institute\nfor Mathematical Sciences, Cambridge, UK, for hosting\nthem in the context of their Phylogenetics Program, where\npart of the research presented in this paper was carried out.\nThey would also like to thank the referees for their helpful\ncomments and Vincent Berry and Sylvain Guillemot for\nuseful discussions on the topic discussed in this paper.\nMagnus Bordewich was supported by an EPSRC Post-\ndoctoral Fellowship (EP\/D063574\/1), and Olivier Gascuel\nwas supported by ModelPhylo project of ACI-IMPBIO.\nKatharina T. Huber and Vincent Moulton would like to\nthank LIRMM, Montpellier, for hosting them during the\nfirst stages of this work.\n116 IEEE\/ACM TRANSACTIONS ON COMPUTATIONAL BIOLOGY AND BIOINFORMATICS, VOL. 6, NO. 1, JANUARY-MARCH 2009\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \nREFERENCES\n[1] B. Allen and M. Steel, “Subtree Transfer Operations and Their\nInduced Metrics on Evolutionary Trees,” Annals of Combinatorics,\nvol. 5, pp. 1-13, 2001.\n[2] K. Atteson, “The Performance of the Neighbor-Joining Methods of\nPhylogenetic Reconstruction,” Algorithmica, vol. 25, pp. 251-278,\n1999.\n[3] W.J. Bruno, N.D. Socci, and A.L. Halpern, “Weighted Neighbor\nJoining: A Likelihood Based Approach to Distance-Based Phylo-\ngeny Reconstruction,” Molecular Biology and Evolution, vol. 17,\npp. 189-197, 2000.\n[4] D. Bryant, “The Splits in the Neighbourhood of a Tree,” Annals of\nCombinatorics, vol. 8, pp. 1-11, 2004.\n[5] D. Bryant, J. Tsang, P.E. Kearney, and M. Li, “Computing the\nQuartet Distance between Evolutionary Trees,” Proc. 11th Ann.\nACM-SIAM Symp. Discrete Algorithms (SODA ’00), pp. 285-286,\nJan. 2000.\n[6] R. Desper and O. Gascuel, “Fast and Accurate Phylogeny\nReconstruction Algorithms Based on the Minimum Evolution\nPrinciple,” J. Computational Biology, vol. 9, pp. 587-598, http:\/\/\natgc.lirmm.fr\/fastme\/, 2002.\n[7] R. Desper and O. Gascuel, “Theoretical Foundation of the\nBalanced Minimum Evolution Method of Phylogenetic Inference\nand Its Relationship to Weighted Least-Squares Tree Fitting,”\nMolecular Biology and Evolution, vol. 21, pp. 587-598, 2004.\n[8] R. Desper and O. Gascuel, “The Minimum-Evolution Distance\nBased Approach to Phylogenetic Inference,” Math. Evolution and\nPhylogeny, O. Gascuel, ed. Oxford Univ. Press, 2005.\n[9] R. Desper and O. Gascuel, “Distance-Based Phylogeny Recon-\nstruction, (Optimal Radius; 1999, Atteson2005, Elias and Lagerg-\nren),” Encyclopedia of Algorithms, M.-Y. Kao, ed., chapter, pp. 1-99,\nSpringer, 2008.\n[10] R. Desper, V. Lefort, H. Phan, and O. Gascuel, manuscript in\npreparation.\n[11] G.F. Estabrook, F.R. McMorris, and C.A. Meacham, “Comparison\nof Undirected Phylogenetic Trees Based on Subtrees of Four\nEvolutionary Units,” Systematic Zoology, vol. 34, pp. 192-200, 1985.\n[12] J. Felsenstein, “PHYLIP—Phylogeny Inference Package\n(Version 3.2),” Cladistics, vol. 5, pp. 164-166, 1989.\n[13] J. Felsenstein, “An Alternating Least-Squares Approach to\nInferring Phylogenies from Pairwise Distances,” Systematic Biol-\nogy, vol. 46, pp. 101-111, 1997.\n[14] J. Felsenstein, Inferring Phylogenies. Sinauer Assoc., Inc., 2004.\n[15] O. Gascuel, “BIONJ: An Improved Version of the NJ Algorithm\nBased on a Simple Model of Sequence Data,”Molecular Biology and\nEvolution, vol. 14, pp. 685-695, 1997.\n[16] O. Gascuel and S. Guillemot, “Sur la Consistance et le Rayon de\nSe´curite´ du Principe d’\u0002Evolution Minimum,” internal report in\nFrench (available on request), 2005\n[17] W. Hordijk and O. Gascuel, “Improving the Efficiency of SPR\nMoves in Phylogenetic Tree Search Methods Based on Maximum\nLikelihood,” Bioinformatics, vol. 21, no. 24, pp. 4338-4347, 2005.\n[18] K.K. Kidd and L.A. Sgaramella-Zonta, “Phylogenetic Analysis:\nConcepts and Methods,” Am. J. Human Genetics, vol. 23,\npp. 235-252, 1971.\n[19] T. Mailund and C.N.S. Pedersen, “QDist—Quartet Distance\nbetween Evolutionary Trees,” Bioinformatics, vol. 20, no. 10,\npp. 1363-1637, 2004.\n[20] Y. Pauplin, “Direct Calculation of Tree Length Using a Distance\nMatrix,” J. Molecular Evolution, vol. 51, pp. 66-85, 2000.\n[21] A. Rzhetsky and M. Nei, “Theoretical Foundation of the\nMinimum-Evolution Method of Phylogenetic Inference,” Molecu-\nlar Biology and Evolution, vol. 10, pp. 1073-1095, 1993.\n[22] D. Robinson and L. Foulds, “Comparison of Phylogenetic Trees,”\nMath. Biosciences, vol. 53, pp. 131-147, 1981.\n[23] N. Saitou and M. Nei, “The Neighbor-Joining Method: A New\nMethod for Reconstructing Phylogenetic Trees,” Molecular Biology\nand Evolution, vol. 4, pp. 406-424, 1987.\n[24] P.H.A Sneath and R.R. Sokal, Numerical Taxonomy, pp. 230-234.\nW.K. Freeman, 1973.\n[25] C. Semple and M. Steel, Phylogenetics. Oxford Univ. Press, 2003.\n[26] C. Semple and M. Steel, “Cyclic Permutations and Evolutionary\nTrees,” Advances in Applied Math., vol. 32, pp. 669-680, 2004.\n[27] M. Steel and D. Penny, “Distributions of Tree Comparison\nMetrics—Some New Results,” Systematic Biology, vol. 42, no. 2,\npp. 126-141, 1993.\n[28] K. Strimmer and A. von Haeseler, “Quartet Puzzling: A Quartet\nMaximum Likelihood Method for Reconstructing Tree Topolo-\ngies,” Molecular Biology and Evolution, vol. 13, pp. 964-969, 1996.\n[29] D.L. Swofford, PAUP\u0002, Phylogenetic Analysis Using Parsimony\n(\u0002 and Other Methods). Sinauer Assoc., Inc., 2003.\n[30] L.S. Vinh and A. von Haeseler, “Shortest Triplet Clustering:\nReconstructing Large Phylogenies Using Representative Sets,”\nBMC Bioinformatics, vol. 6, no. 92, pp. 1-14, 2005.\n[31] S.J. Willson, “Minimum Evolution Using Ordinary Least Squares\nIs Less Robust Than Neighbor-Joining,” Bull. Math. Biology,\nvol. 67, pp. 261-279, 2005.\nMagnus Bordewich received the MMath de-\ngree from Oxford University and the DPhil\ndegree in mathematics in 2003 from Oxford\nUniversity. Following postdoctoral positions at\nthe University of Canterbury, New Zealand, and\nLeeds University, and he has been a permanent\nstaff member at Durham University since 2006.\nHe is a lecturer in the Department of Computer\nScience, Durham University and an EPSRC\npostdoctoral fellow. His research interests are\nalgorithms and complexity, combinatorics, phylogenetics, and computa-\ntional biology.\nOlivier Gascuel first studied mathematics\nalthough his PhD was in computer science,\nand he started working in bioinformatics in the\n1980s, at the very beginning of the genomic era.\nHis first interests were in sequence analysis and\nprotein structure prediction, using machine\nlearning approaches. Since the mid-90s, he\nhas concentrated on evolution and phyloge-\nnetics, with particular focus on the mathematical\nand computational tools and concepts. He now\nleads a research group at the Centre National de la Recherche\nScientifique, Montpellier, France. He has published 110 papers and\nbook chapters and is the author of several widely used computer\nprograms in phylogenetics and bioinformatics.\nKatharina T. Huber received the PhD degree in\nmathematics from the University of Bielefeld,\nBielefeld, Germany, in 1997. After holding a\nMarsden postdoctoral position at Massey Uni-\nversity, she moved to Sundsvall, Sweden, where\nshe joined the Department of Mathematics and\nPhysics as a lecturer on discrete mathematics.\nAfter two years, she moved to Uppsala, and\njoined the Swedish University of Agricultural\nSciences and the Linnaeus Centre for Bioinfor-\nmatics. In April 2003, she was awarded the title of a “docent” by Uppsala\nUniversity, and in the summer of 2004, she joined the School of\nComputing Sciences, University of East Anglia to take up a lectureship\nin computational biology. Her research focuses on problems arising in\nphylogenetics and finite metric spaces.\nVincent Moulton received the PhD degree in\nmathematics from Duke University in 1994\nand did postdoctoral research at University of\nBielefeld, University of Canterbury, and Massey\nUniversity. He was a senior lecturer in discrete\nmathematics at Mid Sweden University from\n1999 to 2002 and a professor in bioinformatics at\nUppsala University from 2002 to 2004. In 2004,\nhe moved to the School of Computing Sciences,\nUniversity of East Anglia, where he is a professor\nin computational biology. His research interests are in phylogenetics,\ncomputational biology of RNA, metabolic modeling, algorithms in\nbioinformatics, and the study of discrete structures such as graphs and\nfinite metric spaces.\n. For more information on this or any other computing topic,\nplease visit our Digital Library at www.computer.org\/publications\/dlib.\nBORDEWICH ET AL.: CONSISTENCY OF TOPOLOGICAL MOVES BASED ON THE BALANCED MINIMUM EVOLUTION PRINCIPLE OF... 117\nAuthorized licensed use limited to: University of Durham. Downloaded on January 6, 2010 at 07:10 from IEEE Xplore.  Restrictions apply. \n"}