{"doi":"10.1017\/S0040298205260254","coreId":"67871","oai":"oai:eprints.lancs.ac.uk:34688","identifiers":["oai:eprints.lancs.ac.uk:34688","10.1017\/S0040298205260254"],"title":"CD Review: Peter Maxwell Davies' new and classic.","authors":["Venn, Edward"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2005-07","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67871.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34688\/1\/displayFulltext14.pdf","pdfHashValue":"b8c3145af9c2716a70dd007acba0a06ba0837ec0","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34688<\/identifier><datestamp>\n      2018-01-24T03:04:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4D:4D31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        CD Review: Peter Maxwell Davies' new and classic.<\/dc:title><dc:creator>\n        Venn, Edward<\/dc:creator><dc:subject>\n        M Music<\/dc:subject><dc:date>\n        2005-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34688\/1\/displayFulltext14.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0040298205260254<\/dc:relation><dc:identifier>\n        Venn, Edward (2005) CD Review: Peter Maxwell Davies' new and classic. Tempo, 59 (233). pp. 79-80. ISSN 1478-2286<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34688\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0040298205260254","http:\/\/eprints.lancs.ac.uk\/34688\/"],"year":2005,"topics":["M Music"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nBENJAMIN: Palimpsests1; At First Light1; Sudden Time1;\nOlicantus2. Ensemble Modern, Ensemble Modern\nOrchestra, c. 1George Benjamin, 2Oliver Knussen.\nNimbus NI 5732.\nNimbus’s ongoing support for George Benjamin\ncontinues with a disc of live performances\nrecorded over the last decade. The programming\nof two recent compositions – Palimpsests and\nOlicantus – with key works from earlier in\nBenjamin’s career allows one to perceive how his\ncompositional style has evolved.\nCommon to the works with which Benjamin\nfirst came to prominence is an astounding\ncommand of instrumental and harmonic colour.\nSuch qualities, seamlessly incorporated into a\ncompelling and thoroughly convincing musical\ndesign, are abundant in At First Light, the earliest\npiece represented on the disc. The central conceit\nof the work, to ‘melt’ sharply defined ideas into a\n‘flowing, nebulous continuum of sound’,1 was\ninspired by a late painting by Turner. The timbral\nand textural manipulations by which this is\nachieved are constantly dazzling; some two\ndecades after its composition, At First Light\ncontinues to sound fresh and vital.\nThe difficulties Benjamin faced in the\ncomposition of Sudden Time, in which he\nattempted to ‘liberate form by writing in a much\nmore linear way than before’ may well explain its\nlengthy gestation (around a decade).2 Here, the\nunderlying metaphor is that of (musical) time as\nbeing something pliable, able to be stretched or\ncompressed. What one actually hears is a musical\ndiscourse in which different strata move at\ndifferent speeds (or give the impression of\ncontrasting states of motion); from this, points of\nstability emerge only to be engulfed soon after.\nThe huge orchestral resources at Benjamin’s\ndisposal are treated with utmost sensitivity in\norder to colour and clarify the unfolding material.\nOne cannot underestimate the significance of\nSudden Time in Benjamin’s output: the technical\nsolutions it provided to previously intransigent\ncompositional problems seem to have allowed\nhim to refine his distinctive voice in a string of\nmajor works over the last decade.\nTime also figures, albeit obliquely, in the\nconception of Palimpsests. A palimpsest is a\nmanuscript in which the original text has been\npartially obscured and put into new contexts by\nthe addition of one or more overlaid texts.\nHowever, Benjamin’s alternative analogy of a\ncityscape, in which the addition of new buildings\nserves to throw the older constructions into new\nrelief, seems to me more pertinent in\nunderstanding what is happening in the music. In\na cityscape, as one’s perspective changes, so too\ndo the relationships between old and new: a\nbuilding previously hidden from one angle can\nsuddenly become revealed. Equivalently,\nBenjamin’s musical argument is not solely the\noverlaying of different musics (as would be the\ncase with a palimpsest), but rather a study of how\nthese musics interact and force reinterpretations\nof one another. A polyphonic clarinet song\nannounced at the opening of the work provides\nthe original ‘text’ which is continually disrupted\nand modified by new material; each subsequent\npresentation bears the traces of this engagement.\nThe second movement, though more expansive,\nhas a similar interaction between contrasting\nstrata. As with At First Light and Sudden Time,\nPalimpsests demonstrates how an abstract extra-\nmusical idea can be transformed into a\ncompelling and vividly realized musical design. \nOlicantus, written as a 50th-birthday present for\nOliver Knussen, is by comparison, much more\nmodest in scope than the other offerings on the\ndisc. Unlike At First Light, which employs a\nsimilar-sized ensemble, the concentration is on\nthe lower registers of instruments: there is little of\nthe brilliance of the earlier work. As with\nPalimpsests, the opening material is presented on\nclarinets (here, bass clarinets), providing a text\nthat gains accretions and additional layers,\nwithout ever sacrificing its identity. \nBenjamin has recorded both At First Light and\nSudden Time before; these more recent\nperformances make for an interesting\ncomparison.3 Given the array of timbres that\nBenjamin makes use of in both of these works, it\nis surprising to note that the instrumental colours\nof these later recordings are not as vivid as the\n1 George Benjamin, George Benjamin (London: Faber and Faber,\n1997), p. 69.\n2 Ibid., p. 78.\n3 Available on Nimbus NI 5643 (with the London Sinfonietta) and\nNI 5505 (with the London Philharmonic Orchestra)\nrespectively.\n \n73Tempo 59 (233) 73–84 © 2005 Cambridge University Press\nDOI: 10.1017\/S0040298205000252 Printed in the United Kingdom\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nearlier ones: the sounds are better blended, less\ndistinct. But what one loses in sharp definition is\ngained in the greater sense of assurance: the\nperformances are tauter and more focused, and\nthe ensemble playing more accurate. Benjamin’s\nreading of Palimpsests is similarly compelling.\nHowever, I found the clarinet’s audible key-\nclacking at the start of Palimpsests and Olicantus a\ndistraction, and my stereo had problems coping\nwith the extremities of levels: I had to keep\nadjusting the volume in order to hear the quiet\npassages and avoid being deafened by the louder\nones. But even with these quibbles, this remains a\nwelcome and highly recommended disc.\nEdward Venn \nPETRASSI: Concertos for Orchestra Nos. 1–8.\nNetherlands Radio Symphony Orchestra c. Arturo\nTamayo. Stradivarius STR 33700 (2-CD set).\nWhen does a concerto for orchestra become a\nsymphony? What, really, is the difference\nbetween the two forms? Both are large-scale\ngenres, often – though not necessarily –\nshowcasing either the orchestra as a whole or\nindividual players or sections within it. Bartók,\ncreator of still the most-performed orchestral\nconcerto, certainly highlighted the display\npurpose as the raison d’etre behind his choice of\ntitle, but then his style of symphonism-by-stealth\nmade the concerto tag innately more apt.\nBartók’s Concerto, like Lutoslawski’s, does not\nfeel like a symphony – any more than either of\nHindemith’s: one from 1925, an updated concerto\ngrosso with which he invented the form, or the\nvariation-form Philharmonic Concerto (1932).4\nHindemith is especially pertinent when\ndiscussing the concerti of Goffredo Petrassi\n(1904–2003), since it was the example his 1925\nConcerto that prompted the composition of the\nItalian’s first (to which, incidentally, he never\nassigned a number) in 1933–4. It may also\naccount for the notably Hindemithian cast of that\nwork’s themes and design: a bracing opening\nAllegro (in which there is a deal of Stravinsky to be\nheard and, here and there, of Honegger) and a\nmarch finale framing a less impersonal Adagio, the\nlongest in duration of the three. If the Roman’s\nown voice had not yet fully formed, it bore a\ndistinctive accent that later works would refine. \nPetrassi may not have written the most\nconcertos for orchestra – Hovhaness has that\nhonour, I think – but he was undoubtedly its most\nconsistent exponent. Yet it took him another 17\nyears to pick up the form again: and then the\nflood-gates opened with five concertos in six\nyears. If No.1 put form over virtuosic display, the\nsingle-span Second (1951) married the two most\nconvincingly. Commissioned by Paul Sacher for a\nclassically sized band, Petrassi created a highly\ncogent design that, were it to be called symphony,\nwould not raise a single eyebrow. The frame of\nreference is now wider, with elements of Busoni\nand Karl Amadeus Hartmann – whose Second\nSymphony is also in a single movement5 –\nsuffusing he score; but over and above one hears\nPetrassi’s own voice clearly for the first time in the\ncycle. These traits are continued and embellished\nfurther in Récréation concertante (1952–3, subtitled\nThird Concerto), which has an altogether spikier\nfeel to the thematic material (featuring a 12-note\nrow) and to the orchestration. Here Stravinskyan\nrhythmic élan was married to Busoniesque\n‘Young Classicality’ to produce a lean litheness of\nsound (occasionally reminiscent of Roussel’s later\nmusic) that marked this concerto as the most\nsatisfying of the series to date.\nBut in the Fourth (1954), scored for strings\nalone, Petrassi topped it. The virtuosity of its\nwriting is apparent from the opening bars, with\nthe high violin lines entering after the music has\nemerged quietly from the depths. Concerto or no,\nit has the breadth – and breath – of a real\nsymphonist. Yet, ironically, this is Petrassi’s most\nBartókian score: many commentators have noted\nits kinship to the Music for strings, percussion and\ncelesta.6 (However, there is also another parallel\nwith Hartmann, whose Fourth Symphony is for\nstring orchestra.) The music traverses some\nextraordinarily wide-ranging tonal and textural\nvistas, all the more remarkable, perhaps, for its\nmonochrome medium – though it is by no means\nunique in transcending that limitation – and the\nrigour of its often dodecaphonic material. Almost\nas soon as he had completed this wonderful piece,\nPetrassi embarked on a Fifth, completed in 1955,\nwhich astonishes by being so utterly different in\nform and feel from its predecessor. It sounds like\nmusic from another world; there is a far lesser\nstylistic divide between the first two concertos\nthan the Fourth and Fifth, which really do sound\n17 years apart! \n4 Composed for the Berlin Philharmonic. Likewise Malcolm\nArnold’s identically-named piece written decades later to\ncelebrate the Manchester-based BBC orchestra.\n5 Or if not Hartmann, a mutation of Hindemith along very\nsimilar lines.\n6 Including Paolo Petazzi, in the set’s accompanying booklet\n(which could have done with some closer proof-reading), and\nMalcolm MacDonald, in his excellent ‘Petrassi and the\nConcerto Principle (II)’, Tempo Vol.57 no.225, pp. 9–22. Though\nno-one, as far as I know, has noted how the brief Sereno third\nsection foreshadows middle-period Robert Simpson!\n74\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nUniquely in the series, the Fifth is cast as a\ndiptych, the first movement moving from an\ninitial Molto moderato tempo through various\nvicissitudes to a closing spectral Presto. The longer\nsecond span arches from Andantino to Lento e grave\nby way of a Mosso, con vivacità central episode. In\nmany respects, Petrassi’s resumption of writing\norchestral concertos arose from a need to replace\novertly theatrical composition – that had come to\nthe fore in his music in the 1940s but he eschewed\nit from 1950 – with abstract dramas every bit as\ncompelling as those for the stage. The Fifth\nConcerto, for all its compositional virtuosity and\nsurface brilliance, has a darker undertow than its\npredecessors. Petrassi was as alive to the issues of\nthe wider world around him as any composer of\nhis time, but whereas in Concertos Nos 2–4 he\nconcerned himself with matters musical, as if as\nan escape to the events of the recent past, in the\nFifth and its successor he seems finally to have\ndecided to meet these issues head-on, albeit\nsublimated in orchestral panoplies of remarkable\nsophistication. Curiously, both the Fifth and Sixth\n(1956–7) were composed to mark institutional\nanniversaries, respectively the 75th of the Boston\nSymphony Orchestra and the 10th of the BBC\nThird Programme. \nNo. 6 returned to the single-span format, but\nits primary title of Invenzione concertata conveys\nmore accurately its more sectional construction,\nthe five parts dovetailing into each other.\nHowever, despite this and the sometimes\nfragmentary, even eruptive, orchestral textures\n(another feature carried over from No. 5), this is\none of Petrassi’s most closely argued and\nconcentrated scores. (It is by some way the\nshortest of the concertos.) Its level of invention is\ncorrespondingly high, creating a fantastical\nsound-world that is rivetting on first acquaintance\nyet is still yielding up secrets on the tenth hearing.\nIn the booklet essay, Paolo Petazzi calls the Sixth\nan ‘arrival point’ and it is the pinnacle of the\nseries, with a feeling of closure in its final bars.\nHad Petrassi stopped the sequence here, his\nachievement as – ironically – Italy’s foremost\nsymphonist, outstripping even Malipiero, would\nbe clear for all to hear. But in 1961–4 and again in\n1970–2 he produced two further concertos that\ntook up from where the Sixth left off. And there\nmay be another faint parallel with Hartmann\nhere, whose own Sixth Symphony –arguably the\npeak of his career – had marked, just a few years\nearlier, the end of a sustained period of\nsymphonic composition, eventually succeeded by\ntwo isolated further symphonies that benefited\nfrom its liberation of expression. Petrassi may\nindeed, as Petazzi notes, have intended the\nSeventh (more clearly cast in an unbroken\nsequence of prologue, four inventions and\nepilogue) to round off the cycle, even quoting the\nopening and closing notes of the First, but a\ncommission from the Chicago Symphony\nOrchestra for Carlo Maria Giulini was too much\nto resist. In his Eighth and last Concerto Petrassi\nreverted to the First’s three-movement design,\nbroadly Allegro-Adagio-Allegro (though there\nare no tempo indications beyond metronome\nmarkings, and internally the processes are\nentirely different, products of a lifetime of\nexperience). This, much more than the Seventh,\nmarks a fitting conclusion to the cycle, though its\nsoloistic use of percussion (played on this new\nrecording by Ruud Stotijn, Vincent Cox, Maarten\nSmit and Mark Haeldermans) might have pointed\nto a new departure had the urge to write a Ninth\nborne fruit.\nThese new recordings represent the first cycle\nby a single conductor and orchestra, since Zoltán\nPeskó’s pioneering and much re-issued set,\ncurrently available on 3 discs from Warner-Fonit,\nwas made using three different orchestras.7\nStradivarius’s newcomer scores straight off in\nbeing able to place the eight works on just two\nwell-filled discs (running to 81’ 12” and 78’)\nrespectively. This is due partly to Tamayo’s often\nsnappier tempi – just compare his account of the\nFirst with Peskó’s – and probably to an effort of\nwill to squeeze it all on to two discs. There is no\nsacrifice in sound quality and the Dutch\nrecordings have great presence, benefitting from\na uniform acoustic. However, it must be said that\nthe drier, albeit variable sonic pictures from the\nPeskó discs do suit Petrassi’s music rather better\nthan the perhaps over-warm sound from\nStradivarius. In terms of performances, there is\nno doubt that Tamayo’s new set is superior,\ndespite Peskó’s authority as a student of the\ncomposer. Broadly, the latter conductor’s\nrecordings with the BBC Symphony Orchestra\nfare pretty well against the new accounts, though\nTamayo’s seem to me better focussed and\nprepared. The two Philharmonia Hungarica\nrecordings are in no way inadequate but, again,\nthe Netherlands Radio players have the edge. The\nmain area where Peskó’s set is let down is with the\nperformance of the Fifth and especially Sixth\nConcertos: by comparison to Tamayo’s these\nseem mere play-throughs. The orchestral balance\nis more realistic on the new discs; but the most\npalpable gain is the greater understanding of\nPetrassi’s style that the Dutch players show –\n7 Concertos 1, 2, 7 and 8 with the BBC Symphony Orchestra,\nNos. 3 and 4 with the Philharmonia Hungarica, Nos 5 and 6\nwith an under-rehearsed Milan Radio Orchestra.\n  75\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nsomething even the BBC Symphony Orchestra in\n1978 could only approximate. To summarize,\nthen, this new set is nothing short of a triumph.\nGuy Rickards\nJOHN ADAMS: On the Transmigration of Souls. New\nYork Choral Artists, Brooklyn Youth Chorus, New York\nPhilharmonic c. Lorin Maazel. Nonesuch 7559 79816 2.\nCommissioned by the New York Philharmonic in\ncommemoration of the first anniversary of the\nWorld Trade Center attacks, On the\nTransmigration of Souls was premièred on 19\nSeptember 2002 in Avery Fisher Hall, Lincoln\nCenter, as the opening work of the orchestra’s\n2002–3 season. Scored for orchestra, chorus,\nchildren’s choir and pre-recorded multi-channel\nsoundtrack, the 25-minute work received the\n2003 Pulitzer Prize for Music.\nWith an oeuvre that includes Nixon in China, The\nDeath of Klinghoffer and El Dorado, Adams is clearly\npredisposed to mining subjects from\ncontemporary history – indeed his third opera,\nDoctor Atomic, due to receive its world premiè re in\nOctober 2005 in San Francisco, focuses on the\nfinal days leading up to the explosion of the first\natomic bomb – but nothing could quite have quite\nhim for this latest commission.\nFor On the Transmigration of Souls Adams\nassembles a text comprised of three main sources:\na recitation of the names of victims, brief\nfragments taken from missing person signs that\nhad been posted around Ground Zero by the\nfamilies and friends of the victims, and personal\nreminiscences drawn predominantly from\ninterviews in the New York Times’ ‘Portraits of\nGrief ’ series. \nIn its superimposition of pre-recorded street\nsounds (city traffic, voices, footsteps, sirens) and\nrecitation of victims’ names with the live\nelements of children’s chorus, adult chorus and\norchestra, the work’s subtle blending of sound\nsources and multiplicity of event evokes the\ncompositional technique of Cage’s Roaratorio,\nalbeit creating an entirely different emotional\nresponse. Adams had already employed the very\nparticular timbral quality of the children’s chorus\nin his oratorio El Niño. But whereas in that work\ntheir voices only appeared at the very end of the\npiece, here they are very much centre-stage – it is\nthe stark contrast between the children’s chorus\nand adult chorus that gives the work much of its\nspecific flavour.\nBy blurring the boundaries of the concert hall\nand the everyday world beyond its walls, Adams\ncreates a vast reverberating space that serves to\nembrace both the souls of the dead and the\nchanged lives of those left behind – past and\npresent brought movingly together. The opening\neight minutes of music, in which the various\nlayers appear to float and collide freely in space,\npossesses an almost hallucinatory quality and is\none of the finest passages to come from the\ncomposer’s pen. The protracted climax that\nerupts at the two-thirds point (‘I loved him from\nthe start … I wanted to dig him out. I know just\nwhere he is’) is absolutely crushing. \nThe sound quality of the live Nonesuch\nrecording is exceptionally good. In the role of\nsoundscape designer and sound engineer –\nliterally enveloping the audience with the pre-\nrecorded elements – special plaudits must go to\nMark Grey.\nPeter Quinn\nEGON WELLESZ: Vorfrühling; Leben, Traum und Tod;\nLied der Welt; Sonette der Elizabeth Barrett Browning; Ode\nan die Musik; Vision; Symphonischer Epilog. Regina\nKlepper (sop), Sophie Koch (mezzo), Deutsches\nSymphonie-Orchester Berlin, c. Roger Epple. Capriccio\n67077.\nWELLESZ: Symphonies Nos. 1 and 8; Symphonischer\nEpilog. Radio Symphonieorchester Wien, c. Gottfried\nRabl. CPO 999998-2.\nWELLESZ: Symphonies Nos. 2 and 9. Radio\nSymphonieorchester Wien, c. Gottfried Rabl. CPO\n999997-2.\nWELLESZ: Prosperos Beschwörungen; HONEGGER:\nSymphony No. 5; STRAVINSKY: Le Sacre du printemps;\nJANÁCˇEK: Sinfonietta; WEBERN: Passacaglia; Six\nMovements op. 6; BERG: Der Wein; SCHOENBERG:\nPelleas und Melisande; SCHMIDT: Symphony No. 2.\nVienna Philharmonic c. Haitink, Ansermet,\nMarkevitch, Kubelik, Mehta, Dorov, Bohm, Leinsdorf.\nAndante AND4080.\n‘Continental Britons: The Emigré Composers’.\nWELLESZ: Octet; Geistliches Lied; Kirschblutenlieder.\nSPINNER: Zwei Kleine Stücke. GOLDSCHMIDT:\nFantasy for oboe, cello and harp; The Old Ships.\nGELLHORN: Intermezzo for violin and piano.\nTAUSKY: Coventry. GÁL: Sonata in B flat minor for\nviolin and piano, op. 17; Fünf Melodien. SEIBER: Sonata\nfor violin and piano. REISENSTEIN: Quintet for flute,\noboe, clarinet, bassoon and horn. RANKL: Two songs\nfrom War, op. 10; The Whim. Ensemble Modern,\nFrankfurt, with Christian Immler (bar), Erik Levi (pno),\nNurit Pacht (vln), Konstantin Lifschitz (pno), Paul\nSilverthorne (vla). Nimbus NI 5730\/1 (2-CD set).  \n76\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nEgon Wellesz (1885–1974) suffered decades of\nneglect in his later years, especially in Britain,\nwhere he settled in 1938 as an exile from Nazi-\noccupied Austria. The ever-expanding Wellesz\ndiscography is one of the most heartening\ndevelopments in the record industry in recent\nyears. There is no room for complacency,\nhowever: concert performances of his works in\nthis country are still depressingly rare and it is\nworth noting that, apart from the Nimbus CD\nspecifically devoted to émigré composers, all of\nthe above releases originated outside the UK.\nThe Capriccio disc makes an excellent starting\npoint for anyone wishing to explore the Wellesz\nsound-world, providing examples from his early\nImpressionist phase, through his mid-period post-\nRomantic era and his glorious Indian summer –\ncharacterized by a return to his Second Viennese\nSchool roots (Wellesz studied with Schoenberg\n1904–06). Vorfrühling (1912) is a lusciously-scored\nsymphonic poem for large orchestra with bitter-\nsweet harmonies revealing the influence of\nDebussy. It is a half-brother to Webern’s Im\nSommerwind and merits comparable popularity.\nThe Sonnets of Elizabeth Barrett Browning for\nsoprano and strings, from 1934, serve notice of\nWellesz’s skill in enhancing English texts,\nsomething which was to come to fruition ten\nyears later in his gloriously dramatic setting of\nGerard Manley Hopkins’s The Leaden Echo and the\nGolden Echo for soprano and ensemble. The disc\nalso provides a representative selection from the\ncomposer’s tougher, harmonically adventurous\nfinal years, including the powerfully\nepigrammatic Vision from 1966 and the grippingly\nExpressionist Symphonischer Epilog (1969). This\nrelease, with subtle and responsive playing\nthroughout from the DSO, Berlin under Roger\nEpple, is very highly recommended.\nSymphonischer Epilog also appears on the latest\nissue from CPO’s Wellesz symphony cycle with\nthe Radio Symphonieorchester Wien under\nGottfried Rabl. In this performance, the\nconception is more urgent and compelling, with\ntaut and brutal climaxes. Rabl also applies this\nbrisk, no-nonsense approach to the symphonies.\nThe tautly-argued Eighth Symphony from 1970\nbenefits from such a cogent, clear-sighted view.\nOn the other hand the First Symphony, composed\nin 1945 after a five-year creative impasse brought\non by enforced exile, ideally needs more time to\nbreathe, especially in the genuinely sublime\nconcluding slow movement. However, Rabl does\nsound much more emotionally committed here\nthan he does elsewhere in the cycle. \nIn the Second and Ninth Symphonies, there is\noccasionally a feeling of clinical efficiency in the\nhabitual observance of quick tempi. Rabl’s dry-\neyed approach certainly helps to avoid any sense\nof special pleading, but the Second Symphony’s\nScherzo, for example, is such a charming\ninvention, with its knowingly academic fugato\nmain subject and artlessly rustic Trio, that one\nlongs for a less analytical, unyielding conception.\nThe Ninth Symphony is a worthy farewell to\norchestral writing from Egon Wellesz; here Rabl\nand his Viennese players find moving echoes of\nearlier Ninths from Bruckner and Mahler,\nespecially in the anguished concluding Adagio.\nBoth CPO discs deserve praise as dependable\nintroductions to Wellesz’s symphonic legacy,\nwhilst leaving the way wide open for more\ncharismatic readings to reveal further insights. I\nhope Rabl, who makes a trustworthy if at times\ninflexible guide, will return to these intensely\nhuman scores again, his interpretations deepened\nby familiarity and experience.  \nProsperos Beschwörungen (1936), five symphonic\npieces after The Tempest, was the last major piece\nWellesz wrote before emigrating and its\nShakespearian provenance seems with hindsight\nto presage his future career as an Oxford\nUniversity tutor. This 3-CD set from Andante\ncontains a live recording of the work with Haitink\nconducting the Vienna Philharmonic at the 1985\nSalzburg Festival. It’s a surprisingly rough-hewn\nreading from these usually ultra-sophisticated\nmusicians, but Haitink is audibly alert to the\nmany subtleties of Wellesz’s masterly\norchestration. The only alternative recording – by\nthe Vienna Radio Symphony Orchestra under\nGerd Albrecht on Orfeo (C 78981A), coupled with\nthe gritty Violin Concerto – is more polished, but\nmuch less gripping.\nThe Nimbus collection, entitled ‘Émigré\nBritons’, is a treat, packed with long-forgotten\nchamber works bearing the stamp of genuine\ncraftsmanship. Wellesz is represented by his\nsunny, liltingly Schubertian Octet, perhaps his\nmost immediately attractive instrumental work.\nIt is a wonderfully ripe, lyrical and dramatic piece\nwhose Austrian charm and fastidiousness would\ngrace the programme of any chamber concert; it\nreceives a reading of unforced charm and wit and\nought to win the composer many new friends.\nThe other items on the 2-disc set are just as\ninvaluable, not least a rare opportunity to hear\nsome brief excerpts from the music of Karl\nRankl, another Schoenberg disciple whose eight\nsymphonies shamefully still remain unrecorded.\nAll these recent Wellesz releases are essential in\nfurthering our understanding of the expressive\nrange of a man who was more widely regarded in\nEngland as a scholar than a composer. There is\n  77\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nsome way to go, however, before his hugely\nimpressive output is adequately represented on\nCD. For example, Wellesz’s nine skilfully-\nwrought string quartets, which cover six decades\nof his creative life, all demand to be heard. After\nhe completed the Ninth Quartet in 1966, he went\non write a further trio of concentrated chamber\nworks – three sets of four pieces – which match\nthe late symphonies in their powerful integrity:\nVier Stücke für Streichquartett (1968), Vier Stücke für\nStreichtrio (1969) and Vier Stücke für Streichquintett\n(1970). These merit urgent attention, along with\nhis operas, Die Prinzessin Girnara (1920), Alkestis\n(1923), Scherz, List und Rache (1927) and the\nStraussian Incognita (1950).8 Until these pieces\nhave been committed to disc, along with the early\nballets Das Wunder der Diana (1917), Persisches\nBallett (1920), Achilles auf Skyros (1921), the mid-\nperiod masterpiece The Leaden Echo and the Golden\nEcho (1944) and the late choral works Mirabile\nMysterium (1967) and Canticum Sapientiae (1968),\nwe cannot claim to have a truly representative\nselection of Wellesz’s oeuvre on record from\nwhich to begin to measure the full extent of his\ncreative achievement.  \nPaul Conway\nCYRIL SCOTT: Symphony No. 3 The Muses; Piano\nConcerto No. 2; Neptune. Howard Shelley (pno),\nHuddersfield Choral Society, BBC Philharmonic, c.\nMartyn Brabbins. Chandos CHAN 10211. \nIn a recent lecture Lukas Foss stated ‘I believe that\nthe only criterion for making an intelligent\nevaluation of a piece of music is: does it make you\nwant to hear it again?’ Since the raison d’être of the\nCD is repeated hearings, a positive review would\nhave to state reasons why the music in question\nreveals different aspects every time, compelling\none to return to it. Such a case can definitely be\nmade for this new release of works from Cyril\nScott’s middle and late periods. Far from the\nrather soupy impression that certain of the\ncomposer’s minor works give, these large-scale\nworks reveal toughness, consequence and strong\nmental discipline, together with great passion. \nToughness, discipline? Can we be talking about\nthe same composer? The early potboilers\nnotwithstanding, Scott’s 70-year composing career\ndoes indeed show a ripening, deepening, that\nbecomes ever more apparent with each new major\nwork. Take the 1980s cassette release (‘John Ireland\nand Friends’) of the late Piano Sonata No. 3 (1956),\nbeautifully performed by Eric Parkin. This is a\nhighly original and convincing work by the nearly\n80-year-old Scott. One of the finest British post-\nwar piano works, it certainly rewards repeated\nhearings. Or the orchestral music recorded by\nPeter Marchbank and the S.A.B.C. Symphony on\nMarco Polo. Thinking of the Neapolitan Rhapsody\nof 1962, I am reminded of Chris Newman’s\ncomment a propos Debussy’s Jeux: ‘that piece\nhangs together like magic’. An inner logic, elusive\nand yet compelling, lends an unexpected substance\nto this work of modest dimensions. \nThis new CD is a further step in completing\nour view of this previously much neglected (even\nmaligned) composer. Scott’s great natural talent\nwas apparent early on, of course, but true\nmaturity was actually rather slow in coming, with\nthe exception of a few major works like the fine\nPiano Sonata No. 1 and the Poems, much\nperformed and praised by Percy Grainger. The\noptimal realization of Scott’s musical personality\nbegins with his middle and late works, where the\nbest of the composer’s personal fingerprints,\nidiosyncrasies and mannerisms all come together\nand really jell, transcending themselves. In the\ncomposer’s own words: ‘I plead guilty to not\nhaving “progressed” with the times; though I\ncannot thus plead, if I may say so, to not having\nprogressed along the line and within the limits of\nmy own particular idiom’. \nIn the tremendous Symphony No. 3, The Muses\n(1937) (dedicated to Beecham but never\nperformed by him), Scott’s earlier harmonic\nvocabulary, replete with unresolved seventh-\nchords, is greatly expanded to include fresh\nfourth-based harmonies and polychords not\nunlike those later favoured by Schuman, Harris\nand Persichetti. There is also a fair amount of\ntriadic harmony, often in parallel motion on\nfragments of the octatonic scale. These features\nwill continue to play a role in subsequent works,\nforming the harmonic cornerstone of the late\nperiod. Scott must himself have realized the\nlimitations of his earlier idiom, for he later stated:\n‘For the sake of variety and strength, it is\nnecessary to have periods of discordance as a foil\nto the concordant parts… For my own part, I have\nnot been afraid of discord, but neither have I been\nafraid of melody as a necessary contrast’. The\nfirst movement, ‘Melpomene: Muse of Epic\nPoetry and Tragedy’ contains some of the most\nexhilarating sea music this listener has ever heard,\nBax, Bridge and Debussy notwithstanding. Scott’s\norchestration is everywhere skilful, always highly\ndifferentiated – a far cry from Grainger’s\ncomplaint of ‘Cyril’s laziness in this regard’,\n8 On some of these works see Philip Ward’s article ‘Egon\nWellesz: an Opera Composer in 1920s Vienna’ in Tempo 219\n( January 2002), pp.22–28 – (Ed). \n78\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nalthough this remark may have contained a grain\nof truth when Grainger made it, around 1910.\nEach of the remaining movements – the\nboisterous ‘Thalia: Muse of Comedy and Merry\nVerse’, the delicious ‘Erato: Muse of Love and\nPoetry’ and the exultant ‘Terpsichore: Muse of\nDance and Song’ (with wordless choir!) – could\nserve as a major work in its own right. \nNeptune (1933) is a revision of a work entitled\nDisaster at Sea, which gave a programmatic\naccount of the sinking of the Titanic. In the\ncomposer’s words, it depicts ‘the mythological\ngod who is at one moment benign and lenient, at\nanother lashed to a destructive fury’. It was\nperformed but once, in 1933. The work has a\nhuge expressive range and is full of original ideas\nin orchestration (of which the opening pizzicato\nglissandi are just a foretaste). \nThe Piano Concerto No. 2 (1958) is finally\navailable again. This is a profound work; its darkly\nglowing sound invites the listener to return to\ngrasp its themes, at once simple and elusive. It is a\nfine example of music with a relatively simple\nsurface but a complex background. Frank Martin,\nTcherepnin and Jacques Hétu have also given us\nsuch inwardly searching, multi-dimensional\nworks. Howard Shelley and the BBC\nPhilharmonic under Martyn Brabbins are\noutstanding, as is to be expected. This listener is\nperhaps too accustomed to John Ogdon’s\npremiere recording (on a Lyrita LP) from the 70s,\nfinding the first movement a bit too brisk in the\nnew interpretation. But this is a very minor\nquibble indeed. Perhaps the greatest work on this\nCD, the Concerto is utterly personal, at once\ntragic and optimistic. It offers solace. Not a typical\npiano concerto; perhaps Glenn Gould would have\napproved of the work’s avoidance of show-off\nvirtuosity and ‘competition’ between soloist and\norchestra. Ogdon obviously held it in high esteem. \nTo sum up: Scott has much to recommend him\nas a composer whose music rewards repeated\nhearings. There are melodic ideas of distinction,\nmemorable yet never banal. His forms are new\nand original, spontaneous without sacrificing\nsolidity. The orchestration is striking and\npersonal. Above all, he has an individual voice\ntranscending all influences. He was a man of\nwide-ranging interests and great spiritual\nawareness, which shows in the music. \nWe can look forward to hearing the new issue\nof Scott String Quartets, including works of his\nlate period.9 Let us hope that more major works\nby this very special British composer will soon be\nmade available. \nDavid Babcock \nMAXWELL DAVIES: Miss Donnithorne’s Maggot1; Eight\nSongs for a Mad King2. 1Jane Manning (sop), 2Kelvin\nThomas (bar), Psappha. PSA CS 1001\nMAXWELL DAVIES: Naxos Quartets Nos. 1 and 2.\nMaggini Quartet. Naxos 8.557396\nThe first release on Manchester-based ensemble\nPsappha’s own label is a coupling of Peter\nMaxwell Davies’s celebrated music-theatrical\nportraits of madness, Miss Donnithorne’s Maggot\nand Eight Songs for a Mad King. Few readers will\nneed an introduction to these works; for those\nthat do, and even for those that don’t, these new\nrecordings are to be highly recommended.  \nPsappha, together with vocalists Jane Manning\nand Kelvin Thomas, have been performing these\nworks – without a conductor – for at least four\nyears prior to the recording. Although a\nsignificant proportion of the musical material\ndemands unsynchronized parts (for which the\nabsence of a conductor might be considered a\nbonus), the performances become all the more\ntelling when precision of ensemble playing is\ncalled upon. The accuracy, the tightness of the\nensemble, and above all the sheer energy of these\nreadings on this disc bears ample witness to the\nsuccessful collaboration between singers and\nensemble.\nIn an enjoyable interview included on the CD,\nDavies tells of how the teacher of Roy Hart, the\noriginal soloist of Eight Songs, learnt to produce\nvocal multiphonics through imitating the sounds\nof the dying and wounded he heard on the\nbattlefields of World War I. Hart and Davies’s\ntranslation of noises made from physical torment\ninto the depiction of mental torment is inspired.\nAnd, whilst it is tragic that Roy Hart did not live\nlong enough to record his version, the absence of\nsuch a document can have a liberating effect. Such\nis the case with Kelvin Thomas’s reading, in which\nhis confrontation with the extraordinary demands\nof Davies’s sometimes graphic notation gives rise\nto a compelling performance. Where the notation\nhints at chords, Thomas makes appropriate use of\ngroaning, gargling and tortured moans that\nshockingly and vividly convey the dementia of\nGeorge III. The virtuosic writing extends to the\ninstrumental parts as well, handled with\nconsiderable élan by Psappha. But if the musical\nportrayal of madness were to be incoherent (as in\nthe most literal depiction), it would soon become\n9 Quartets Nos.1, 2 and 4 were recently issued on Dutton Epoch\nCDLX 7138 in performances by the Archaeus Quartet. Dutton\nhave also issued Scott’s Piano Qartet and Quintet, performed by\nthe London Piano Quartet with Marilyn Taylor (vln) – (Ed).\n  79\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nbanal; thus the extreme vocal and instrumental\nwriting is in fact balanced by music of considerable\nrigour. Combined with this, Thomas and Psappha\nassured dramatic shaping results in a constantly\nengaging performance.\nThe vocal writing in Miss Donnithorne’s Maggot\npresents slightly different challenges to those of\nEight Songs. Both push the soloists to extremes,\nbut Miss Donnithorne’s madness is less graphic.\nThe generally more lyrical writing demands a\ngreater range of characterization, which Jane\nManning supplies in abundance. It is no mean task\nto convey on disc a character teetering on the\nbrink of sanity, but in addition to this, Manning\ninvests humour, tenderness and poignancy in the\nrole. Once again, the instrumentalists are the\nequals of the vocalist: the frequent use of allusion\nand pastiche in both works seemingly leaves the\nensemble untroubled as they switch between\nstyles and modes of expression with disarming\nease. The use of pastiche becomes particularly\nprominent towards the end of both works, but\ndifferent musical ends. For King George, it\nculminates in his eventual capitulation to insanity\nand the pronouncement of his death. For Miss\nDonnithorne, it is an accompaniment to her\nincreasing intoxication: though encouraging us to\nlaugh, the music also engages our affections – we\nare touched by her despair. In this respect, Miss\nDonnithorne’s Maggot is undoubtedly the more\nsubstantial work, even if it does not reach the\nmore disturbing heights of its companion piece.\nThe decision by Naxos Records to commission\nten string quartets from Maxwell Davies may\nhave raised eyebrows in some quarters. No-one\ncan question his industry, nor, since his first seven\nsymphonies, his ability to conceive and realize an\nextended cycle. But the string quartet has not\nfigured largely in his output hitherto: two ‘Little\nQuartets’, a ‘Quartet Movement’ and the more\nsubstantial String Quartet of 1961 are the only\nworks in this genre.10 This does not appear to have\nposed any problems: the evidence on the first CD\nrelease points to an assured handling of the\nidiom, and augurs well for the complete cycle (to\ndate, six of the ten quartets have been performed,\nbut only two have been recorded).11\nIn the expressionistic, dramatic music theatre\nworks of the late 1960s, Maxwell Davies\nfrequently made use of allusion for ironic effect.\nIn the quartets, the allusions are more subtle, and\nfulfil a different purpose, creating a complex\nnetwork of cross-references. The more obvious\nconnexions are the thematic links between\nmovements, such as in the second quartet, when\nthe material of the first subject of the first\nmovement recurs in the later movements. There\nare also links between the quartets of the cycle:\nthe first quartet ends practically mid-sentence,\nfloating off into the stratosphere, in music to be\ntaken up again in the third quartet. \nOther allusive ghosts haunt the quartets:\nHaydn, Beethoven and Chopin inform the\nmusical substance to various degrees, and more\nrecent 20th-century precedents can be detected in\nthe textures and sonorities. The spectre of the\nClassical string quartet, and particularly the\nsonata allegro, looms most strongly behind the\nfirst movements. Nevertheless, traditional\ngestures are subverted: repeats of expositions are\npromised, but left unfulfilled or distorted, and\nexpected recapitulations are omitted. The result is\nambiguous: one does not know if such distortions\nare ironic or a deferral of material until later in the\ncycle.\nThe quartets are by turns rugged, passionate,\nlyrical, mysterious and beautiful – and performed\nwith conviction by the Maggini Quartet.\nAlthough neither of the quartets in this recording\nfeels incomplete, it appears that each subsequent\naddition to the cycle will retrospectively alter our\nperception of the earlier members of the cycle.\nMy impression, at this stage, is that the leanings\ntowards the tonal centres of F and D will become\nincreasingly important, but you can never tell\nwith Max. One hopes that the complete cycle will\nenrich our understanding of these works. Until\nthen, we have plenty to enjoy. \nEdward Venn\nBRUN: Symphony No. 3 in D minor. Moscow\nSymphony Orchestra c. Adriano. Sterling CDS-1059-2.\nBLOCH: Helvetia; Suite for viola and orchestra; Suite\nHébraïque for viola and orchestra. Gérard Caussé‚ (vla),\nOrchestre de la Suisse Romande c. Lior Shambadal.\nCascavelle RSR 6170.\nFritz Brun’s Third Symphony and Ernest Bloch’s\nHelvetia are two very different orchestral works\nwith a common source of inspiration: the Swiss\nartist Ferdinand Hodler (1853–1918). Hodler’s\nfame was at its height when he exhibited at the\n1904 Vienna Secession – hence, perhaps, the use\nof his art to illustrate the cover of Peter Franklin’s\nlife of Mahler. Like Arnold Böcklin, but drawing\nmore on French than on German or Italian\nmodels, Hodler went in for evocative Symbolist\n10 These four early quartet works are usefully collected on Metier\nMSV CD92055, performed by the Kreutzer Quartet – (Ed.).\n11 As this review went to press, Naxos announced the issue of two\nmore – Quartets Nos.3 and 4 (Naxos 8.557397) – (Ed.).\n80\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\npaintings of figures and landscapes. A typical\nview of the Bernese Oberland, the Alps wreathed\nin vigorous swirls of cloud and light, appears on\nthe cover of Sterling’s Fritz Brun CD. It was, in\nfact, a Hodler painting of the Jungfrau as seen\nfrom Mürren which Brun named to the\nconductor Hermann Scherchen in connexion\nwith his hour-long Third Symphony (1919).\n‘Autumn, bad weather, the picture inspired me,\nalthough secondarily. The first impression was\nthe mountain itself, holding me in its clutches.’\nIn contrast to this on-the-spot musicalization,\nBloch’s continuous ‘symphonic fresco’ Helvetia\nwas composed in San Francisco in 1929, several\nyears after America and more than a decade after\nhis Israel symphony. The sub-title reads ‘Le Pays\ndes Montagnes et son Peuple’, and Bloch\ndedicated the work ‘to all lovers of mountains and\nfreedom, and in memory of Ferdinand Hodler’.\nBloch’s Hodler is the painter of the Alps but also\nof historical frescoes and the designer of a Swiss\nbank-note (using both his wife and his Parisian\nmistress as models for Helvetia).\nCan stylistic parallels be drawn between artists\nand composers? One might venture to say that\nBrun’s linear technique has affinities with\nHodler’s. Whereas Bloch, in Helvetia, was\ncultivating the Straussian tone poem, Brun sits\nfirmly in the Brahms-Bruckner tradition,\nalthough there are features of his Third that set\nhim apart. In his painstakingly researched\nbooklet notes, Adriano defines these features as\n‘almost atonal and very dramatic, harsh sounding\nsections, full of syncopated chords and shifting\nchains of “rustling” or “gargling” notes\n(subdivided into different groupings of short note\nvalues), proceeding either in unison, in octaves, or\nin parallel and irregular intervals’. A three-note\nmotif is the ‘spark igniting the thematic material’\nof the elemental first movement. The epic strain\nvies with more intimate and peaceable moods; in\nits confrontation of man and nature, this music\nbrings Vaughan Williams to mind.\nDespite its overall length, Brun’s Third\nSymphony consists of three movements, not four.\nThe central movement comprises a set of six\nvariations on a Swiss-Italian Epiphany carol.\nAdriano argues that the elaborate final variations\n(headed Sostenuto and Adagio affettuoso) might be\ntreated as a self-contained slow movement. With\nits duet for solo cellos, the Adagio affettuoso presents\na small masterpiece of instrumental lyricism. Here\nthe composer acknowledged a debt to Berlioz. The\nfinal movement, in D major – a brighter though\nsimilarly craggy companion to the first –\nconstitutes a potent demonstration of Brun’s\n  81\nlistening to musicians – responding to their needs\nFor people in the music \nbusiness there is always help \nat hand from the Musicians\nBenevolent Fund\n•Help with stress and \nhealth problems\n•Help and advice with financial \nproblems\n•Help that’s given in strict \nconfidence\n•Help given to outstanding \nyoung musicians \nWe operate throughout \nEngland, Scotland, Wales \nand the whole of Ireland\nIf you or someone you know \nneeds our help, please contact:\nMusicians Benevolent Fund \n16 Ogle Street, London W1W 6JA\nTelephone: 020 7636 4481\nFacsimile: 020 7637 4307\nemail: info@mbf.org.uk\nwebsite: www.mbf.org.uk\nReg. Charity No.228089\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\ncontrapuntal art. Brun shows a Brahms-like\nrestraint in his orchestration; its contrabassoon\nand four horns seem especially Brahmsian. From\nhis Russian players Adriano elicits an intensely\nvivid and cohesive performance, delectably\nfiligrane within the variations. \nFor their part, the Suisse Romande Orchestra\nunder Lior Shambadal positively revel in the\ncolours of Bloch’s Helvetia. For a work lasting\nunder 25 minutes, the scoring can only be\ndescribed as extravagant: quadruple woodwind\n(including cor anglais, bass clarinet and\ncontrabassoon), six horns, four trumpets, three\ntrombones, tuba, a variety of percussion, celesta,\ntwo harps, plus strings.  Emotionally, too, Bloch’s\nmusic goes gorgeously over the top in its\ncelebration of an ancient Swiss victory. But unlike\nthe ‘1812’, or for that matter the William Tell\noverture, it ends as poetically as it begins. \nBloch provided the following Romantic\nprogramme: \nI. The Mountain itself, its mystery, its rocks and its\nforests. II. Dawn, the awakening of the Mountain and\nof men. III. The “Landsgemeinde”, the open-air gath-\nering where events are discussed. With dignity but\ntragically, the “Elders” announce that “the Fatherland\nis in danger”. IV. But suddenly the people rise up. Their\nmountains shall not be enslaved. And then a true\nmedieval battle erupts. It ends in Victory, which I have\nsymbolized through an old Genevan song, “Cé qué lé\nno” (He who is on high). V. Epilogue. The Mountain is\nliberated, serene again, as after a storm.\nComparisons? The middle section includes a\nRaffish (rather than raffish) march and a\nMahlerian wind chorale. There are reminiscences\nof Bloch’s own early C sharp minor Symphony\n(the first sketches for Helvetia date from around\nthe turn of the century). There is also a foretaste\nof the more elevated stretches of his 1938 Violin\nConcerto. And in the dramatic sections, the sheer\nenergy of the writing recalls Carl Nielsen. Helvetia\nis well complemented on the present CD by\nBloch’s Suite for Viola and Suite Hébraïque, each in\nthe version with orchestra. \nPeter Palmer\nPE¯TERIS VASKS: Violin Concerto Distant Light1; Musica\ndolorosa; Viatore. 1Katarina Andreasson (vln and leader),\nSwedish Chamber Orchestra. BIS-CD-1150.\nAs a former double bass player with the\nLithuanian Philharmonic Orchestra, the Latvian\nChamber Orchestra and the Latvian Radio and\nTelevision orchestra, it is perhaps not surprising\nthat Pe¯teris Vasks feels a special affinity with\nstrings. In addition to the three works featured on\nthis new BIS CD – all written for string orchestra –\nother works composed for this medium include\nCantabile (1979), Voices (1991), Musica adventus\n(1995–96), Adagio (1995–96) and the four string\nquartets.\nVasks describes the violin concerto Distant\nLight (1997), commissioned by the Salzburg\nFestival, as ‘a concerto, in single-movement form,\nwith contrasting episodes and three cadenzas for\nthe soloist. A song, coming from silence and\nfloating away into silence, full of idealism and\nlove, at times melancholy and dramatic.’ Despite\nits loose, episodic structure the work hangs\ntogether surprisingly well, due in no small part to\nthe central solo role of Katarina Andreasson.\nAndreasson carries off the solo part with great\naplomb, making light of any technical difficulties\n(glissandos, double-stopping) and playing with\ngreat intensity and luminosity of tone in the\nwork’s numerous cantabile passages so beloved by\nthe composer.\nSpeaking about Musica dolorosa, Vasks has\nstated that ‘I have always dreamed that my music\n– comforting and thought-provoking as it is –\nwould be heard where people were unhappy: in\nhospitals and prisons, in crowded trains and\nbuses … My music is intended for a large\nnumber of people, not just for the audiences \nat concert halls’ (perhaps London Underground\ncould look into the possibility of having the disc\non repeat play). The earliest of the works on the\ndisc – Vasks composed it in 1983 as a requiem for\nhis sister – Musica dolorosa possesses a singular,\nperfectly fashioned beauty. Constructed from the\nvery simplest of materials (pedal points,\nobsessively repeating pitches and, once again, the\nalmost thematic use of the glissando) the work\nnevertheless builds to a densely argued and\nforceful climax. Taking on the key solo cello\npart, Mats Levin is an assured and big-toned\nsoloist. \nThe disc also presents the world première\nrecording of Viatore (‘The Wanderer’), composed\nin 2001. Its musical material, alternating a\ncantabile section played first by cellos and divisi\ndouble basses with a 51-bar ritornello, contains\nstrong echoes of the music of Arvo Pärt and of\nand one work – Tabula rasa – in particular.\nViatore’s striking ritornello passages, with their\nslight heterophonic variations and registral\ndescents\/ascents, especially call to mind Tabula\nrasa’s vigorous opening movement, Ludus.\nSimilarly, the ethereal glissando at the end of\nViatore bears a striking similarity to the Pärtian\npractice of a work slowly unwinding into silence\nand reverberating beyond the final note.\n82\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nAll three works, recorded in the presence of\nthe composer in the first-rate acoustic of\nSweden’s Örebro Concert Hall, receive\ncommitted, crisply articulated performances by\nScandinavia’s only full-time chamber orchestra,\nthe Swedish Chamber Orchestra. \nPeter Quinn\nCHINARY UNG: Spiral VI1; Seven Mirrors2; Grand Alap3;\nGrand Spiral (‘Desert Flowers Bloom’)4. 1Quake, 2Gloria\nCheng (pno), 3Walter Gray (vc), Rob Tucker (perc). La\nJolla Symphony Orchestra c. Harvey Sollberger. New\nWorld 80619-2.\nThe music of the Far East has long exercised a\nfascination for European and American\ncomposers, so it was inevitable that composers of\nFar Eastern ethnic origin would in turn be\ninfluenced by Western traditional forms. From\nthe concertos-by-committee that came into view\nin the West after the Cultural Revolution in China\nto the delicate beauty of Takemitsu’s later output,\nEast Asian music written to synthesize the\nconventions of East and West has increasingly\nmade its presence felt in the concert hall and on\ndisc. Not surprisingly, composers in the cultural\nmelting-pot of the United States have represented\nthe vanguard of the West’s like-minded efforts in\nresponse, whether native-born (such as the late\nLou Harrison) or émigrés like Tan Dun or Bright\nSheng, both born in China and now creating\nenviable international reputations. \nChinary Ung (b. 1942) is unusual in this respect\nin being of neither Chinese nor Japanese descent.\nHe is Cambodian, but emigrated to the USA in\n1964. After graduating from the Manhattan\nSchool of Music and Columbia University (his\nteachers along the way included Chou Wen-\nchung and, at Tanglewood, George Crumb), Ung\nbegan a distinguished teaching career at several\ncolleges and universities in the US, slowly\nmigrating westwards until arriving at the\nUniversity of California in San Diego, where he is\ncurrently in his tenth year. A naturalized\nAmerican, he was apparently the first US\ncomposer to receive the Grawemeyer Award, for\nhis orchestral tone poem Inner Voices (1986) in\n1989. This work was commissioned by the\nPhiladelphia Orchestra shortly after Ung had\nbroken a self-imposed exile from composition,\nfrom 1974 to 1985, during which he seems to have\nturned his back on Western avant-garderie and\ngone back to his roots. The fruits of his researches\ninto Cambodian music and their impact on his\nstyle can be heard in Spiral, a trio for piano, cello\nand percussion recorded by the Aequalis Trio in\n1991 for New World (80412-2), as well as on the\ncurrent New World new disc devoted entirely to\nhis music.12\nSome of the compositional concerns and traits\nin Spiral are clearly audible on the new disc, not\nleast in that two works have similar titles: Spiral VI\n(1992), a beguiling single-movement quartet for\nviolin, cello, clarinet and piano, and the orchestral\nGrand Spiral (‘Desert Flowers Bloom’) from 1991.\nUng has remarked: ‘If East is yellow and West is\nblue, then my music is green’. Spiral VI is\npositively emerald, in that case: its soulful Asian\nmelodies merge seamlessly into an evocative,\nmid-European sound world that recalls a wealth\nof musics from the early decades of the last\ncentury. Indeed, there is much about Ung’s music\nthat suggests what Western Classical music from\na Cambodian might have sounded like in, say, the\n1910s and 1920s. Yet there is nothing archaic or\nbackward-looking in Ung’s musical persona; the\nharmonies are piquantly late-20th-century and\nthe fantasia-like internal processes are modern\nand effortlessly developmental. There is also a\nvery clear expressive focus throughout each of\nthe compositions here, from the initial gesture –\noften a held chord and a set of repeated notes\nfollowed by the primary intervals the piece is\nconstructed from – to the usually gentle close.\nWhat occurs between, however, is very different\nfrom work to work.\nThis is most obviously noticeable in the large\npiano suite that gives the album its title, Seven\nMirrors (1997). In the booklet, John Kays speaks of\nhow its familiar ‘piano gestures reflect post-\nmodern characteristics that prevailed in the last\nquarter of the twentieth century’. Ung, as a good\nteacher, would undoubtedly have been aware of\nthe trends around him, but it could also be that his\nstyle is characteristically a little outside of time,\n12 The other works on New World 80412-2 are: Mario\nDavidovsky’s ground-breaking Synchronism No. 6 for piano &\nelectronic sounds; Rand Steiger’s engaging Trio in Memoriam (Paul\nFromm); Miriam Gideon’s wonderful Cello Sonata; and Martin\nBrody’s Commedia. The performances of all these works are\nvery fine, the result of good preparation in live performance\nand sympathy with the very diverse styles involved. The\nrepertoire selected is not entirely random, either. Ung studied\nwith Davidovsky, who in turn had been a pupil of Milton\nBabbitt, who was a fellow student with Gideon of Roger\nSessions. New World’s sound is very good, also. Ung’s\ndiscography is fairly modest but includes several works issued\non various CRI discs (e.g. SD-363 and SD-487) but collected later\nonto CRI SD-710. These works include the symphonic band\noriginal of Grand Spiral, two versions of Khse Buon (also\navailable on Koch 37464-2), the early Mohori (1974) and Tall\nWind (1970), and Spiral II. The Grawemeyer Award-winning\nInner Voices appeared on Argo 444 560-2, in a performance by the\nAmerican Composers Orchestra conducted by Dennis Russell\nDavies. And coupled with Lou Harrison’s Suite for strings and\nMcPhee’s seminal Tabuh-Tabuhan.\n  83\nhttp:\/\/journals.cambridge.org Downloaded: 08 Dec 2010 IP address: 194.80.32.10\nstandards. While the opening section is turbulent,\nthe main span is quiet and mesmeric, seeming to\nstretch time as it approaches its nicely inevitable\nconclusion. Another metaphor might be of a river\nwinding – but never simply meandering –\nthrough a reed bed to the sea. Although at first\nhearing this is the work that strives the least to\ningratiate itself upon the Western ear, Grand Alap\nis perhaps the most sheerly fascinating of the four\nunder consideration: Walter Gray (cellist in the\nQuake ensemble) and Rob Tucker provide an\nexcellent account. One quibble, though: Ung\ndirects that the duo should comprise one male\nand one female player.\nGrand Spiral, by contrast, is perhaps closer to\nwhat one might expect of a work merging Asian\nand Western musics. Astonishingly, given its\nassurance in handling the ensemble, it was only\nUng’s second score for full orchestra (Inner Voices\nbeing the first), although he may have benefited\nfrom the experience of writing originally for a\nsymphonic wind band. Grand Spiral is also the\nmost immediate in appeal of the works here,\nthough it creates a rather different impression to\nthe chamber pieces, which have a common\norchestral bigness about their sound even though\nemploying only a few players. Harvey Sollberger\ndirects a solid performance, but it is clear that the\nLa Jolla Symphony Orchestra, recorded here at a\nlive concert in June 2002, were not entirely within\ntheir comfort zone with the idiom. This results in\nsome tentative passages, but ironically these help\nto illuminate the music’s inner workings and\nindividual lines. The sound is clear, if with\nnecessarily a very different perspective to the\ninstrumental and chamber pieces, which were\nrecorded all together in the following November.\nCompleted by a wonderful cover photograph of\nAngkor Wat, this is a splendid disc, heartily\nrecommended.\nGuy Rickards\n13 The term alap ‘represents the opening section of an Indian raga,\nbased primarily on the elaboration of improvisational materials\nthat sets the pattern for what will follow’.\n84\nreflecting the Asian side of his sensibilities, or at\nleast less concerned with questions of\npostmodernism than other American composers.\nI would argue that the style of Seven Mirrors – very\ndifferent to those of the couplings – arises\nprimarily from its extra-musical concerns with\nthe poetry of Jelaluddin Rumi and Rabindranath\nTagore: especially of the latter’s Song Offerings,\nwhich colours the opening span, ‘A Window in\nthe Sky’ and the central ‘Laughter passes over the\nEarth’. Seven Mirrors is best thought of as a set of\npreludes or studies, demanding technically for the\npianist – but ably expressed here by Gloria Cheng\n– which follow on from Debussy in being such\nperfectly realized miniatures, without Skryabin’s\nfloridity. Ung has said how he often composes\nfrom the middle outwards, and this suite seems to\nbe no exception. For example, the second\nmovement, ‘Dotted Path’, sounds as much a\nconsequence of ‘Laughter passes over the Earth’\n(the first to be written) as does the penultimate\n‘Tattooing Space-Time’. Only in the brilliant,\nfinal ‘Flying Mirrors’ is there an audible sense of a\nsection destined to close the whole.\nIf Seven Mirrors holds more to the traditional\nWestern side of Ung’s musical make-up, in Grand\nAlap (1996)13 we are in a very different part of the\nworld and time. It is particularly instructive to\ncompare this single-span work with the opening\nmovement of the suite: the subtitle of the one\nbeing the main title of the other and both derived\nfrom Tagore, yet they feel entirely different. In\nGrand Alap, a bracing duo for amplified cello and a\nbattery of percussion, what sound like more\ntraditional Asian musical sounds rub shoulders\nwith gestures not uncommon in more avant-\ngarde Western scores, such as the syllabic\nvocalizations of the two performers. The net\neffect of this, however, is a music that is\nsurprisingly contemplative, even by Ung’s\n"}