{"doi":"10.1086\/339054","coreId":"194825","oai":"oai:lra.le.ac.uk:2381\/770","identifiers":["oai:lra.le.ac.uk:2381\/770","10.1086\/339054"],"title":"High resolution spectroscopy of G191-B2B in the extreme-Ultraviolet","authors":["Cruddace, R. G.","Kowalski, M. P.","Yentis, D.","Brown, C. M.","Gursky, H.","Barstow, Martin A.","Bannister, N. P.","Fraser, G. W.","Spragg, J. E.","Lapington, J. S.","Tandy, J. A.","Sanderson, B.","Culhane, J. L.","Barbee, T. W.","Kordas, J. F.","Goldstein, W.","Fritz, G. G."],"enrichments":{"references":[{"id":44682264,"title":"2; accepted","authors":[],"date":"2001","doi":null,"raw":"R. G. Cruddace,1 M . P. Kowalski,1 D. Yentis,1 C. M. Brown,1 H. Gursky,1 M. A. Barstow,2 N. P. Bannister,2 G. W. Fraser,2 J. E. Spragg,2 J. S. Lapington,3 J. A. Tandy,3 B. Sanderson,3 J. L. Culhane,3 T. W. Barbee,4 J. F. Kordas,4 W. Goldstein,4 and G. G. Fritz5 Received 2001 November 2; accepted 2001 December 7; published 2002 January 7 Bannister, N. P., Barstow, M. A., Holberg, J. B., & Bruhweiler, F. C. 2001, in ASP Conf. Ser. 226, 12th European Workshop on White Dwarfs, ed.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-01-07","abstract":"We report a high-resolution (R = 3000-4000) spectroscopic observation of the DA white dwarf G191-B2B in the extreme-ultraviolet band 220-245 Å. A low-density, ionized He component is clearly present along the line of sight, which if completely interstellar implies a He ionization fraction considerably higher than is typical of the local interstellar medium. However, some of this material may be associated with circumstellar gas, which has been detected by analysis of the C IV absorption-line doublet in a Hubble Space Telescope\/Space Telescope Imaging Spectrograph spectrum. A stellar atmosphere model assuming a uniform element distribution yields a best fit to the data that includes a significant abundance of photospheric He. The 99% confidence contour for the fit parameters excludes solutions in which photospheric He is absent, but this result needs to be tested using models allowing abundance gradients","downloadUrl":"http:\/\/iopscience.iop.org\/article\/10.1086\/339054\/meta","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/770\/1\/APJL-10.1086-339054.pdf","pdfHashValue":"7df245eae9474ba72eddba6402ce1d34c53214d1","publisher":"American Astronomical Society, IOP Publishing","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/770<\/identifier><datestamp>\n                2015-12-02T17:08:19Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nHigh resolution spectroscopy of G191-B2B in the extreme-Ultraviolet<\/dc:title><dc:creator>\nCruddace, R. G.<\/dc:creator><dc:creator>\nKowalski, M. P.<\/dc:creator><dc:creator>\nYentis, D.<\/dc:creator><dc:creator>\nBrown, C. M.<\/dc:creator><dc:creator>\nGursky, H.<\/dc:creator><dc:creator>\nBarstow, Martin A.<\/dc:creator><dc:creator>\nBannister, N. P.<\/dc:creator><dc:creator>\nFraser, G. W.<\/dc:creator><dc:creator>\nSpragg, J. E.<\/dc:creator><dc:creator>\nLapington, J. S.<\/dc:creator><dc:creator>\nTandy, J. A.<\/dc:creator><dc:creator>\nSanderson, B.<\/dc:creator><dc:creator>\nCulhane, J. L.<\/dc:creator><dc:creator>\nBarbee, T. W.<\/dc:creator><dc:creator>\nKordas, J. F.<\/dc:creator><dc:creator>\nGoldstein, W.<\/dc:creator><dc:creator>\nFritz, G. G.<\/dc:creator><dc:description>\nWe report a high-resolution (R = 3000-4000) spectroscopic observation of the DA white dwarf G191-B2B in the extreme-ultraviolet band 220-245 Å. A low-density, ionized He component is clearly present along the line of sight, which if completely interstellar implies a He ionization fraction considerably higher than is typical of the local interstellar medium. However, some of this material may be associated with circumstellar gas, which has been detected by analysis of the C IV absorption-line doublet in a Hubble Space Telescope\/Space Telescope Imaging Spectrograph spectrum. A stellar atmosphere model assuming a uniform element distribution yields a best fit to the data that includes a significant abundance of photospheric He. The 99% confidence contour for the fit parameters excludes solutions in which photospheric He is absent, but this result needs to be tested using models allowing abundance gradients.<\/dc:description><dc:date>\n2009-12-08T16:24:57Z<\/dc:date><dc:date>\n2009-12-08T16:24:57Z<\/dc:date><dc:date>\n2002-01-07<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAstrophysical Journal Letters, 2002, 565 (1), pp.47-50<\/dc:identifier><dc:identifier>\n0004-6388<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/770<\/dc:identifier><dc:identifier>\nhttp:\/\/iopscience.iop.org\/article\/10.1086\/339054\/meta<\/dc:identifier><dc:identifier>\n10.1086\/339054<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nX-ray and Observational Astronomy<\/dc:relation><dc:rights>\nArchived with reference to SHERPA\/RoMEO and publisher website. © 2002. The American Astronomical Society. All rights reserved.<\/dc:rights><dc:publisher>\nAmerican Astronomical Society, IOP Publishing<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0004-6388","0004-6388"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","X-ray and Observational Astronomy"],"year":2002,"topics":[],"subject":["Article"],"fullText":"L47\nThe Astrophysical Journal, 565:L47–L50, 2002 January 20\n\u0001 2002. The American Astronomical Society. All rights reserved. Printed in U.S.A.\nHIGH-RESOLUTION SPECTROSCOPY OF G191-B2B IN THE EXTREME-ULTRAVIOLET\nR. G. Cruddace,1 M . P. Kowalski,1 D. Yentis,1 C. M. Brown,1 H. Gursky,1 M. A. Barstow,2 N. P. Bannister,2\nG. W. Fraser,2 J. E. Spragg,2 J. S. Lapington,3 J. A. Tandy,3 B. Sanderson,3 J. L. Culhane,3\nT. W. Barbee,4 J. F. Kordas,4 W. Goldstein,4 and G. G. Fritz5\nReceived 2001 November 2; accepted 2001 December 7; published 2002 January 7\nABSTRACT\nWe report a high-resolution ( –4000) spectroscopic observation of the DA white dwarf G191-B2BRp 3000\nin the extreme-ultraviolet band 220–245 A˚ . A low-density, ionized He component is clearly present along the\nline of sight, which if completely interstellar implies a He ionization fraction considerably higher than is typical\nof the local interstellar medium. However, some of this material may be associated with circumstellar gas, which\nhas been detected by analysis of the C iv absorption-line doublet in a Hubble Space Telescope\/Space Telescope\nImaging Spectrograph spectrum. A stellar atmosphere model assuming a uniform element distribution yields a\nbest fit to the data that includes a significant abundance of photospheric He. The 99% confidence contour for\nthe fit parameters excludes solutions in which photospheric He is absent, but this result needs to be tested using\nmodels allowing abundance gradients.\nSubject headings: circumstellar matter — ISM: general — stars: individual (G191-B2B) — white dwarfs\n1. INTRODUCTION\nWhite dwarfs are among the oldest objects in the Galaxy. As\nremnants of all stars with an initial mass of less than 8 , theyM,\nare important laboratories for the study of evolutionary pro-\ncesses and the behavior of matter at extreme temperature and\ndensity. Study of their space and luminosity distributions helps\nmap the history of star formation and could, in principle, de-\ntermine the age of the disk, yielding an important lower limit\nto the age of the universe. Furthermore, cool white dwarfs may\naccount for a substantial fraction of the missing mass in the\nGalactic halo (Oppenheimer et al. 2001). However, these goals\ndepend on our understanding of white dwarf evolution and, in\nparticular, on predictions of the cooling rates. These in turn are\naffected by the mass, radius, and photospheric composition of\nthe stars. Our understanding of the physical mechanisms that\ndetermine white dwarf evolution leaves several major questions\nunanswered. While the emergence from the asymptotic giant\nbranch of two groups of white dwarfs whose compositions are\ndominated by H or He is beginning to be understood, the com-\nplex relationship between these branches and a demonstrable\ntemperature gap in the cooling sequence of the He-rich branch\ncannot yet be explained. Determination of the photospheric He\nand heavy-element content would provide important infor-\nmation on the evolutionary history of the stars. Already it has\nbeen established that significant quantities of elements heavier\nthan He are present in the atmospheres of the hottest (T 1\nK) white dwarfs (Barstow et al. 1993).50,000\nG191-B2B is one of the brightest and best studied of the\nhot, H-rich DA white dwarfs. As it lies near the top of the DA\ncooling sequence, measurements of its effective temperature,\nsurface gravity, and composition represent an important bench-\nmark in the study of the whole DA sample. IUE and Hubble\nSpace Telescope (HST) observations at high spectral resolution\n1 E. O. Hulburt Center for Space Research, Naval Research Laboratory,\nWashington, DC 20375.\n2 Department of Physics and Astronomy, University of Leicester, Leicester\nLE1 7RH, UK.\n3 Mullard Space Science Laboratory, University College London, Holmbury\nSt. Mary, Dorking, Surrey RH5 6NT, UK.\n4 Lawrence Livermore National Laboratory, Livermore, CA 97550.\n5 Praxis, Inc., 2200 Mill Road, Alexandria, VA 22314.\nhave made it clear that G191-B2B falls into the group of very\nhot DA stars ( K) whose atmospheres contain sig-T 1 50,000\nnificant quantities of heavy elements. In particular, detections\nof C, N, O, Si, P, S, Fe, and Ni have been reported in various\nstudies (Bruhweiler & Kondo 1983; Sion et al. 1992; Vennes\net al. 1992, 1996; Holberg et al. 1994). Such material is re-\nsponsible for severe depression of the extreme-ultraviolet\n(EUV) flux in G191-B2B at A˚ , when it is comparedl ! 200\nwith stars with pure H atmospheres, and the star has been an\nimportant target for spectroscopic EUV observations to deter-\nmine the principal opacity sources. In addition, an important\ngoal is to obtain a self-consistent model having an effective\ntemperature, surface gravity, and composition that can fit the\nfar-ultraviolet (FUV) and EUV observations simultaneously.\nThis would demonstrate our understanding of the star and the\nreliability of the model calculations, which could then be ap-\nplied to other objects.\nHowever, a complete understanding of the Extreme Ultra-\nviolet Explorer (EUVE) spectrum of G191-B2B has been elu-\nsive. Initial attempts to match the observation with synthetic\nspectra failed to reproduce either the flux level or the general\nshape of the continuum (see Barstow et al. 1996), as the model\ncontained insufficient Fe and Ni lines. Consequently, about nine\nmillion predicted lines were added to the few thousand with\nmeasured wavelengths, yielding a self-consistent model able\nto reproduce the EUV, FUV, and optical spectra (Lanz et al.\n1996). However, good agreement could be achieved only by\nincluding a significant quantity of He, in either the photosphere\nor an ionized interstellar component. Unfortunately, owing to\nthe limited resolution of EUVE (∼0.5 A˚ ) in the He ii Lyman\nseries band, the He contribution could not be detected directly.\nMore recently, it has been shown that photospheric heavy el-\nements may not be distributed homogeneously in the radial\ndirection, so more complex stratified structures should be con-\nsidered. This approach has yielded a good fit of model at-\nmospheres to observational data across the soft X-ray, EUV,\nand FUV bands (Barstow, Hubeny, & Holberg 1999; Dreiz-\nler & Wolff 1999). Important progress has been made also in\nincorporating radiative levitation and diffusion self-consistently\ninto the calculations (Dreizler & Wolff 1999; Schuh, Dreizler,\n& Wolff 2001). The need for a He contribution is reduced in\nL48 G191-B2B HIGH-RESOLUTION EUV SPECTRUM Vol. 565\nFig. 1.—High-resolution EUV spectrum of G191-B2B, obtained with the J-PEX spectrometer in the wave band 221–244 A˚ . All data points have error bars.\nThe red histogram is the best-fit model of the star and ISM. The strongest predicted lines of He, C, N, O, and P are labeled with their ionization state and\nwavelength. Lines of Fe and Ni, too numerous to include here, account for some unlabeled individual features and broader absorption structures.\nthese stratified models but is not eliminated. We present the\nresults of a search for the He ii component in the EUV spectrum\nof G191-B2B, using the Joint Astrophysical Plasmadynamic\nExperiment (J-PEX) high-resolution EUV spectrometer. This\nspectrum was obtained by J-PEX after launch by a sounding\nrocket in 2001 February.\n2. THE J-PEX HIGH-RESOLUTION EUV SPECTROMETER\nThe J-PEX spectrometer, described by R. Cruddace et al.\n(2002, in preparation), is a slitless, normal-incidence instrument\nemploying figured spherical gratings in a Wadsworth mount.\nThe optic comprises four ion-etched laminar gratings with a\ngroove density of 3600 g mm\u00011 and a focal length of 2.0 m.\nThe gratings are coated with a Mo5C\/Si\/MoSi2 multilayer de-\nsigned to operate in the band 220–245 A˚ and are optimized to\nsuppress zero order and yield maximum efficiency in first order\nat 235 A˚ . At this wavelength the spectrometer achieves an\neffective area of 3.0 cm2. The design specification for the spec-\ntral resolving power (R) in flight is 4980, which includes the\neffect of a pointing uncertainty of 1\u0001. Calibration of R was\nhindered by thermal deflections in the spectrometer caused by\ndetector heating overlong exposure times, and consequently the\naverage measured resolving power was 2750, yielding an es-\ntimate for in-flight resolving power of 2600. However, the prob-\nlem encountered in calibration should have a much smaller\neffect during a flight lasting only 5 minutes. Therefore, we can\nset only reasonable bounds to the resolving power in flight,\nnamely, . This uncertainty is taken into ac-3000 ! R ! 4000\ncount in analysis of the flight data. J-PEX was launched by a\nNASA Black Brant IX sounding rocket (NASA 36.195DG) at\n05.45 UT on 2001 February 22. The payload completed its\nmission successfully, during which time it observed the target\nG191-B2B for 300 s.\n3. DATA REDUCTION AND ANALYSIS\nThe spectra of the four gratings were recorded independently\nby the focal plane detector. In R. Cruddace et al. (2002, in\npreparation), we describe how the positions of photon events\nin each spectrum were corrected for attitude control system\ndrift and jitter and the wavelength of each spectrum was cal-\nibrated. The events were summed in bins of width 0.024 A˚\nbefore being superposed to yield one spectrum. The bin width\nwas chosen to oversample the data by a factor of 2.4 in com-\nparison with the resolution at so as to minimize theRp 4000\nloss of information during superposition. The final spectrum,\nin which the signal-to-noise ratio (S\/N) has been maximized\nby increasing the bin size to 0.048 A˚ , is shown in Figure 1.\nThe average S\/N per bin was 5.0.\nThe background count rate in the detector field during the\nobservation was 4.2 counts s\u00011, sufficiently low that the spectra\nwere essentially free of background. Therefore, the error bars\nin Figure 1 have been assigned assuming Poisson statistics. The\nspectrum contains one flaw caused by the pointing on target,\nin which data above ∼239 A˚ was lost in two of the spectra.\nThus, only half the instrument effective area was used in this\nregion, and accordingly we have increased the bin width to\n0.096 A˚ .\nWe have compared the observed spectrum with the predic-\ntions of a model in which the white dwarf atmosphere has a\nhomogeneous composition and the flux is absorbed by H i,\nHe i, and He ii in the interstellar medium (ISM). Although\nstratified atmosphere models are more successful in reconciling\nspectra of G191-B2B in the EUV and FUV bands (Barstow &\nHubeny 1998; Barstow et al.1999), the homogeneous models\nare adequate for the relatively narrow J-PEX wave band and\ngive a useful baseline for comparison with abundance mea-\nsurements made in other studies. The analysis technique has\nbeen described extensively in earlier papers (e.g., Lanz et al.\n1996), and we give here only a brief overview. The XSPEC\nsoftware was used to fold model spectra through the J-PEX\ninstrument response, and as we were dealing with a spectrum\nhaving a small number of counts per bin, the best match be-\ntween model and data was obtained by minimization of the\nCash statistic (Cash 1979). This does not assign an absolute\nvalue to the goodness of fit, but it does allow uncertainty ranges\nto be determined for each free parameter.\nThe model spectra, based on work reported by Lanz et al.\n(1996) and Barstow, Hubeny, & Holberg (1998, 1999), were\ncalculated using the non-LTE code TLUSTY (Hubeny & Lanz\n1995). For this initial analysis, we fixed the stellar temperature\nand surface gravity ( K; ) at the gridT p 54,000 log gp 7.5eff\npoints closest to the values determined using the Balmer and\nLyman lines (Barstow et al. 1998). Apart from the He abun-\ndance, which was allowed to vary freely between the grid limits\nof 10\u00014 and 10\u00016, the heavy-element abundances were fixed at\nvalues determined in earlier homogeneous-model analyses of\nG191-B2B ( , ,\u00017 \u00017C\/Hp 4.0# 10 N\/Hp 1.# 10 O\/Hp\n, , ,\n\u00017 \u00017 \u000189.6# 10 Si\/Hp 3.0# 10 P\/Hp 2.5# 10 S\/Hp\n, , ).\u00017 \u00015 \u000173.2# 10 Fe\/Hp 1.0# 10 Ni\/Hp 5.0# 10\nThe value taken for Fe\/H lies between limits established by\nFUV ( ; Vennes & Lanz 2001) and EUV [(3–4\u000162.4# 10 )#\n; Barstow et al. 1999] analyses. The effect of Fe\/H in the\u0001510\n225–245 A˚ band is to change the level of the overall spectrum,\nand we have verified that this does not affect the conclusions\nreached in our analysis. The ISM H i and He i column densities\nwere fixed at values obtained from analysis of the broader\nband, lower resolution EUVE spectrum (Barstow et al. 1999):\nNo. 1, 2002 CRUDDACE ET AL. L49\nFig. 2.—The 1, 2, 3, 5, and 10 j contours for the two parameters varied in\nfitting a uniform-abundance white dwarf atmosphere model to the measured\nspectrum of G191-B2B. The 3 j contour corresponds to a confidence level of\n99.7%. The secondary contour at 10 j locates a weak secondary minimum in\nthe distribution.2x\nFig. 3.—Top: Expanded view of the J-PEX spectrum of G191-B2B in the\nwavelength range 226–232 A˚ spanning the He ii Lyman series limit. The red\nhistogram is the best-fitting model of the stellar atmosphere and absorption in\nthe ISM. Bottom: Expanded view of the J-PEX spectrum of G191-B2B in the\nrange 226–232 A˚ , but this time showing the best fit, traced by the green\nhistogram, of a model in which absorption by interstellar and circumstellar\nHe has been removed.\ncm\u00012 and . The18 17 \u00012H ip 2.15# 10 He ip 2.18# 10 cm\nparameters varied during the fit were the column density of\nHe ii in the line of sight ( ) and the photospheric He abun-NHe ii\ndance (nHe: measured by numbers of nuclei). For this fit, the\ndata were summed in bins of width 0.060 A˚ , equivalent to\n. Given the uncertainty in the resolving power (§ 2;Rp 4000\n–4000), the fits were performed also for lower valuesRp 3000\nof R, but yielded no significant change in the results presented\nbelow in § 4. The best fit to the data, shown by the red line\nin Figure 1, was obtained for and17 \u00012N p 5.97# 10 cmHe ii\n, and in Figure 2 we show the 1, 2, 3, 5,\u00015n p 1.60# 10He\nand 10 j contours for the two parameters. The 3 j contour is\nthe locus on which exceeds the minimum by 11.8 and within2x\nwhich the parameter confidence level is greater than 99.7%.\nWe use this contour to derive 99% confidence limits of\n(5.76–6.18 cm\u00012 for and (1.31–1.91 cm\u0001217 \u00015)# 10 N )# 10He ii\nfor nHe.\n4. DISCUSSION\nThe good agreement between the best-fit model and the data\nin Figure 1 is striking, e.g., at the prominent absorption feature\nat 233.5 A˚ produced by a cluster of O iv lines. Many other\nfeatures are present that are mainly blends of large numbers\nof Fe v and Ni v lines. The broad features between 227 and\n232 A˚ are a characteristic of the overlapping series of inter-\nstellar He ii absorption lines superposed on a continuum. This\nis shown more clearly in the upper panel of Figure 3, an ex-\npanded view of the 226–232 A˚ region shown in Figure 1. Taken\nwith the strong depression of the flux below 227 A˚ , this is\nstrong evidence that interstellar He ii is present along the line\nof sight. Conclusive proof is obtained when the data are fitted\nby a model in which is set to zero. The degradation ofNHe ii\nthe fit is evident in the lower panel of Figure 3, particularly in\nthe region below 229 A˚ . Furthermore, in this case the best-fit\nvalue of for nHe is about 4 times the upper limit\u000158.0# 10\nwe obtained from the absence of detectable He ii at 1640 A˚\nin the HST\/Space Telescope Imaging Spectrograph (STIS) spec-\ntrum of G191-B2B. On the other hand, the best-fit model in\nthe upper panel of Figure 3, in which , is\u00015n p 1.6# 10He\nconsistent with the STIS limit.\nThe best-fit He ii column density of cm\u00012 im-175.97# 10\nplies a He ionization fraction, based on EUVE measurements\nof the He i column density, of ∼0.73. This is substantially\nhigher than the typical range of 0.25–0.50 in the local ISM\n(LISM; e.g., Barstow et al. 1997). However, a possible cir-\ncumstellar medium (CSM) component has been identified re-\ncently through analysis of the C iv absorption-line doublet\n(1548.202 and 1550.774 A˚ ) in the STIS FUV spectrum of\nG191-B2B (Bannister et al. 2001). Therefore, some of the He\nii detected in the J-PEX spectrum may be circumstellar, al-\nthough the fraction would have to be at least one-third to bring\nthe interstellar component within the LISM range. The known\nLISM and CSM components are separated by ∼8 km s\u00011 and\ntherefore could not be resolved by J-PEX.\nThe photospheric absorption line at 243.026 A˚ is predicted\nto be the strongest in the J-PEX wave band. Unfortunately, this\nlies in a region of reduced exposure (§ 3), and Figure 1 shows\nno feature in the measured spectrum at this wavelength. How-\never, the depth of the predicted line is similar to the magnitude\nof the statistical errors for the data points, yielding only a very\nweak constraint on the possible He abundance. A weak ab-\nsorption line is seen at the position of He ii 237.331 A˚ , but\nlikewise the photon statistics do not allow a significant de-\ntection.\nThe above discussion of the column density of ISM\/CSM\nHe ii and the evidence for photospheric He are underpinned\nby the good agreement between the homogeneous stellar at-\nmosphere models and the observational data, as shown by the\ngood correspondence between predicted and observed features\nin Figure 1 and the upper panel of Figure 3. However, closer\ninspection also reveals several significant features present in\nL50 G191-B2B HIGH-RESOLUTION EUV SPECTRUM Vol. 565\nthe observed but not in the synthetic spectrum, for example at\n229.3 and 231.2 A˚ . This indicates that the model atmosphere\nis incomplete and that other elements should be included in\naddition to C, N, O, Si, P, S, Fe, and Ni.\n5. CONCLUSIONS\nWe have presented our first analysis of the high-resolution\nEUV spectrum of G191-B2B obtained with the J-PEX spec-\ntrometer, which has the highest resolving power (3000–4000)\nachieved so far in the EUV and X-ray wave bands. The results\nshow conclusively that ionized He is present along the line of\nsight and yield a column density of cm\u00012. How-175.97# 10\never, if this is all interstellar, the measured column density\nyields an estimated He ionization fraction significantly higher\nthan is typical of the LISM. Some of this material may be\nassociated with a newly discovered circumstellar component,\nbut further investigation is necessary to demonstrate whether\nthis is plausible.\nThe white dwarf model that best fit the data included a\nsignificant abundance, , of photospheric He, and at\u000151.6# 10\nthe 99% confidence level we could exclude models containing\nno photospheric He. However, we caution that a simple model,\nin which elements are distributed uniformly in the atmosphere,\nwas used in this analysis, and further work with models in\nwhich stratification of elements is allowed, and taking greater\nadvantage of other G191-B2B observations, is needed to verify\nor disprove our result.\nThe Naval Research Laboratory (NRL) was supported in\nthis work by NASA under the grant NDPR S-47440F and by\nthe Office of Naval Research under NRL work unit 3641 (Ap-\nplication of Multilayer Coated Optics to Remote Sensing). The\nUniversity of Leicester and the Mullard Space Science Labo-\nratory acknowledge the support they received for this project\nfrom the Particle Physics and Astronomy Research Council in\nthe UK.\nREFERENCES\nBannister, N. P., Barstow, M. A., Holberg, J. B., & Bruhweiler, F. C. 2001,\nin ASP Conf. Ser. 226, 12th European Workshop on White Dwarfs, ed.\nJ. L. Provencal, H. L. Shipman, J. MacDonald, & S. Goodchild (San Fran-\ncisco: ASP), 105\nBarstow, M. A., Dobbie, P. D., Holberg, J. B., Hubeny, I., & Lanz, T. 1997,\nMNRAS, 286, 58\nBarstow, M. A., & Hubeny, I. 1998, MNRAS, 299, 379\nBarstow, M. A., Hubeny, I., & Holberg, J. B. 1998, MNRAS, 299, 520\n———. 1999, MNRAS, 307, 884\nBarstow, M. A., Hubeny, I., Lanz, T., Holberg, J. B., & Sion, E. M. 1996, in\nIAU Colloq. 152, Astrophysics in the Extreme Ultraviolet, ed. S. C. Bowyer\n& R. F. Malina (Dordrecht: Kluwer), 203\nBarstow, M. A., et al. 1993, MNRAS, 264, 16\nBruhweiler, F. C., & Kondo, Y. 1983, ApJ, 269, 657\nCash, W. 1979, ApJ, 228, 939\nDreizler, S., & Wolff, B. 1999, A&A, 348, 189\nHolberg, J. B., Hubeny, I., Barstow, M. A., Lanz, T., Sion, E. M., & Tweedy,\nR. W. 1994, ApJ, 425, L105\nHubeny, I., & Lanz, T. 1995, ApJ, 439, 875\nLanz, T., Barstow, M. A., Hubeny, I., & Holberg, J. B. 1996, ApJ, 473, 1089\nOppenheimer, B. R., et al. 2001, Science, 292, 698\nSchuh, S., Dreizler, S., & Wolff, B. 2001, in ASP Conf. Ser. 226, 12th European\nWorkshop on White Dwarfs, ed. J. L. Provencal, H. L. Shipman, J. Mac-\nDonald, & S. Goodchild (San Francisco: ASP), 79\nSion, E. M., Bohlin, R. C., Tweedy, R. W., & Vauclair, G. P. 1992, ApJ, 391,\nL29\nVennes, S., Chayer, P., Hurwitz, M., & Bowyer, S. 1996, ApJ, 468, 898\nVennes, S., Chayer, P., Thorstensen, J. R., Bowyer, S., & Shipman, H. L. 1992,\nApJ, 392, L27\nVennes, S., & Lanz, T. 2001, ApJ, 553, 399\n"}