{"doi":"10.1177\/1357034X05056193","coreId":"65985","oai":"oai:dro.dur.ac.uk.OAI2:3799","identifiers":["oai:dro.dur.ac.uk.OAI2:3799","10.1177\/1357034X05056193"],"title":"Transformations of intimacy and sociality in anorexia : bedrooms in public institutions.","authors":["Warin, M."],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2005-09-01","abstract":"Anorexia can be characterized as a profound transformation in social relations. These transformations occur across a number of overlapping fields, and include a range of  institutional and domestic spaces and myriad mundane bodily practices in each. Through an examination of household space and a conventional treatment programme this article demonstrates the ways in which people with anorexia use and transform   space. While there are many treatment programmes available for those with a diagnosis of anorexia, the ethnographic focus here is on those who have undergone   bed programmes in public hospitals. As a result of the particularities of time and space, these rooms are transformed into intimate spaces that represent domestic  bedrooms, thus fundamentally changing the nature of shared space in institutionalized settings. These transformations, however, are not straightforward, for these bedrooms fuse a number of bodily practices (such as eating, sleeping and abluting) that are sharply demarcated in domestic architecture. In these hospital  bedrooms, private and public space is conflated, reversed and made ambiguous. Moreover, this article argues that this institutional transformation of space  reproduces many of the private practices associated with anorexia, a factor which has been overlooked in the recorded failure of these types of programmes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65985.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3799\/1\/3799.pdf","pdfHashValue":"d77439474785c01d327f52ce97dd22b5cf96302f","publisher":"Sage UK","rawRecordXml":"<record><header><identifier>\n  \n  \n    \n      oai:dro.dur.ac.uk.OAI2:3799<\/identifier><datestamp>\n      2011-08-31T08:53:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Transformations of intimacy and sociality in anorexia : bedrooms in public institutions.<\/dc:title><dc:creator>\n        Warin, M.<\/dc:creator><dc:description>\n        Anorexia can be characterized as a profound transformation in social relations. These transformations occur across a number of overlapping fields, and include a range of  institutional and domestic spaces and myriad mundane bodily practices in each. Through an examination of household space and a conventional treatment programme this article demonstrates the ways in which people with anorexia use and transform   space. While there are many treatment programmes available for those with a diagnosis of anorexia, the ethnographic focus here is on those who have undergone   bed programmes in public hospitals. As a result of the particularities of time and space, these rooms are transformed into intimate spaces that represent domestic  bedrooms, thus fundamentally changing the nature of shared space in institutionalized settings. These transformations, however, are not straightforward, for these bedrooms fuse a number of bodily practices (such as eating, sleeping and abluting) that are sharply demarcated in domestic architecture. In these hospital  bedrooms, private and public space is conflated, reversed and made ambiguous. Moreover, this article argues that this institutional transformation of space  reproduces many of the private practices associated with anorexia, a factor which has been overlooked in the recorded failure of these types of programmes.<\/dc:description><dc:subject>\n        Anorexia<\/dc:subject><dc:subject>\n         Embodiment<\/dc:subject><dc:subject>\n         Relatedness<\/dc:subject><dc:subject>\n         Space.<\/dc:subject><dc:publisher>\n        Sage UK<\/dc:publisher><dc:source>\n        Body & society, 2005, Vol.11(3), pp.97-113 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3799<\/dc:identifier><dc:identifier>\n        issn:1357-034X<\/dc:identifier><dc:identifier>\n        issn: 1460-3632<\/dc:identifier><dc:identifier>\n        doi:10.1177\/1357034X05056193<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3799\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/1357034X05056193<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3799\/1\/3799.pdf<\/dc:identifier><dc:rights>\n        The final, definitive version of this article has been published in the Journal, Body & society, 11\/3, 2005, © SAGE Publications Ltd, 2005 at the Body & society page: http:\/\/bod.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1460-3632","1357-034x"," 1460-3632","issn:1357-034X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Anorexia","Embodiment","Relatedness","Space."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n15 August 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWarin, M. (2005) ’Transformations of intimacy and sociality in anorexia : bedrooms in public institutions.’,\nBody society., 11 (3). pp. 97-113.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/1357034X05056193\nPublisher’s copyright statement:\nThe final, definitive version of this article has been published in the Journal, Body society, 11\/3, 2005, SAGE\nPublications Ltd, 2005 at the Body society page: http:\/\/bod.sagepub.com\/ on SAGE Journals Online:\nhttp:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n15 August 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWarin, M. (2005) 'Transformations of intimacy and sociality in anorexia : bedrooms\nin public institutions.', Body &amp; society., 11 (3), pp.\u000097-113.\nFurther information on publisher\u0000s website:\nhttp:\/\/dx.doi.org\/10.1177\/1357034X05056193\nPublisher\u0000s copyright statement:\nThe final, definitive version of this article has been published in the Journal, Body &\nsociety, 11\/3, 2005, © SAGE Publications Ltd, 2005 at the Body & society page: http:\/\/bod.sagepub.com\/\non SAGE Journals Online: http:\/\/online.sagepub.com\/\u0000\u0000\nTransformations of Intimacy and Sociality in Anorexia: Bedrooms in Public \nInstitutions  \n \nAbstract \n \nAnorexia can be characterized as a profound transformation in social relations.  These \ntransformations occur across a number of overlapping fields, and include a range of \ninstitutional and domestic spaces and the myriad of mundane bodily practices in each.  \nThrough an examination of household space and a conventional treatment program \nthis paper demonstrates the ways in which people with anorexia use and transform \nspace. While there are many treatment programs available for those with a diagnosis \nof anorexia, the ethnographic focus here is on those who have undergone bed \nprograms in public hospitals.  As a result of the particularities of time and space, these \nrooms are transformed into intimate spaces that represent domestic bedrooms, thus \nfundamentally changing the nature of shared space in institutionalized settings.  These \ntransformations, however, are not straightforward, for these bedrooms fuse a number \nof bodily practices (such as eating, sleeping and abluting) that are sharply demarcated \nin domestic architecture.  In these hospital bedrooms, private and public space is \nconflated, reversed and made ambiguous.  Moreover, this paper argues that this \ninstitutional transformation of space reproduces many of the private practices \nassociated with anorexia, a factor which has been overlooked in the recorded failure of \nthese types of programs. \n \n \n 2\nAnorexia is defined as ‘an expression of a woman’s confusion about how much space she may take up \nin the world’.        (Orbach 1986:14) \n \nIntroduction \nMuch of the critical and feminist literature on anorexia nervosa draws upon the work \nof Foucault to throw light on the ways in which discourses such as medicine and \ngender are fundamental to understanding the operations of power and knowledge in \nthe production of disciplined and docile bodies.  Foucault’s theory of discourse has \nbeen highly influential and productive in this field because it provides a critique of \nmedicine, and by extension, of patriarchy.  Writers such as Turner (1984, 1987), \nBordo (1988, 1989, 1990), Bartky (1988), Tait (1992), Eckerman (1997), Hepworth \n(1999) and Malson (1998) all argue in some form or another, that the most common \nreason for eating disorders is that constructions of femininity, a pre-occupation with \ndiets and exercise promulgated through the media, and institutional control and \nregulation of individuals, have constituted these disorders.   \n \nA small number of writers in this field (Bartky, 1988; Eckerman, 1997; Malson, 1998) \nhave extended Foucault’s insights of the architectural design of hospitals into \npsychiatric wards and their relationships to social control.  Eckerman, for example, in \nher work with women with anorexia, notes the irony of architectural design in eating \ndisorder units.  Those in treatment programs were constantly surveilled as ‘the rooms \nchosen for those undergoing behaviour modification were within sight of the nurses \nstation, with glass panels internally and large windows to the outside to allow \nuninterrupted vision.  All meals, showers and toileting were carefully supervised’ \n 3\n(Eckerman, 1997: 157).  This was Bentham’s panoptican par excellence, and the \ninterchange between prisons and inmates, hospitals and inpatients has not gone \nunnoticed, as Bartky, reading from Foucault writes: \nEach inmate is alone, shut off from effective communication with his fellows \n[sic], but constantly visible from the tower … In the perpetual self-surveillance \nof the inmate lies the genesis of celebrated ‘individualism’ and heightened self-\nconsciousness that are hallmarks of modern times. (Bartky, 1988: 63) \nWhile not denying the use of power within medicine or the profound influences of \nFoucault’s work, this paper differs from these Foucauldian approaches to anorexia and \ninstitutional spaces.  My aim (akin to Gremillion 2003) is to extend and complicate \nwidely used Foucauldian analyses by challenging the many polarised oppositions that \nare to be found in this body of literature (of docile or resistant bodies, and of public or \nprivate spaces).   \nIn earlier works on self-starvation, the ‘anorexic body’ is read as a metaphor for the \nsocial body — as Bordo’s title explicitly states, a ‘crystallisation of culture’ (1988).1  \nThe body of these analyses, which reproduces the docile body that Foucault \narticulated, is a text in which cultural values are inscribed, etched and written upon.2  \nPower relations ‘have an immediate hold on it; they invest it, mark it, train it, torture \nit, force it to carry out tasks, to perform ceremonies, to emit signs’ (Foucault, 1977: \n25).  The particular use of Foucault’s discourse has rendered the gendered body \nmalleable, one which ‘locates the generative forces outside the immediate, lived \nreality of the lifeworld’ (Jackson, 1996: 21; cf. McNay, 1999).   \nThis passivity of the body is, in part, a result of the way in which discourse and its \noperations of power and knowledge have been located by these writers in specific \n 4\ninstitutional practices – in hegemonic and dualist structures that allow little room for \nanalysing the everyday spaces of anorexia.  This is in spite of Foucault’s own \ntheoretical shift in understanding power from institutions to the self.3  Turner (1984), \nfor example, demonstrates this hegemony at work:  \nAnorexia is ... a symbolic struggle against forms of authority [patriarchy, \nfamily and medicine] and an attempt to solve the contradictions of the female \nself, fractured by the dichotomies of reason and desire, public and private, \nbody and self, nature and culture. (Turner, 1984: 201) \n \nSuch an analysis, not only accommodates structuralist (and hence disembodied) \naccounts, but also, as McNay suggests, tends to position ‘disciplinary power as a fully \ninstalled monolithic force which saturates all social relations’(McNay,1994: 104),  \nIn attempting to acknowledge the shifts in Foucault’s theories of power, recent \nanalyses of power within the field argue that anorexia is not an extreme extension of \npatriarchal ideals, but an active, oppositional practice to ‘normative’ femininity.  \nAnorexia is characterised as an act of resistance against dominant, hegemonic \ndiscourses, and its use is a productive, rather than a repressive force (Eckerman, 1997: \n157-8, Grosz, 1994: 40).  While focusing on resistance allows room for agency on the \npart of those in subordinate positions of power, resistance and power still remain as \npolar opposites, rather than configurations that work in multiple ways.  This \npositioning of resistance in a dualist framework falls prey to what Abu Lughod refers \nto as a ‘romance of resistance’ (1990), in which defiant acts are heroicised.  As Grosz \nargues, the line between compliance and subversion is always a fine one (Grosz, 1994: \n144). \n 5\nAnother important distinction this paper makes in regards to extending Foucauldian \naccounts of anorexia, is to problematise the common sense dichotomy of public and \nprivate space.  Analyses of space that adopt Foucault’s panoptican understanding, \nwhilst acknowledging the pervasiveness of this gaze, tend to focus on institutional \n(Eckerman, 1997; Gremillion, 2003) and public space (read as community spaces) \n(Malson, 1998).4  An analysis of everyday, intimate spaces is overlooked.  Drawing on \nDuncan’s (1996) critique of binary spaces, this analysis does not take for granted the \nfamiliar spatial division between the domestic and institutional.  Rather, it examines \nhow these spaces are subject to a remapping through a blurring of embodied practices, \nhighlighting the myriad and complexity of spaces in which bodies constantly move.   \n \nRather than use a structuralist or discursive analytic framework, it is through the lens \nof embodiment that intersections of spaces, bodies and power are examined.  Informed \nby anthropological analyses of space, place and gender (Bourdieu, 1977; Carsten & \nHugh-Jones, 1995; Low & Lawrence-Zuniga, 2003), and feminist geographies \n(Duncan, 1996; Longhurst, 2001; Butler & Parr 1999), the analysis examines the \nmultiple ways in which people with anorexia embody different architectural spaces, \nthat is, how they create, reproduce, reconfigure and disrupt spaces.  I trace the ways in \nwhich spaces are transformed by participants in their own homes, arguing that these \ntransformations are reproduced and contested in institutional spaces, yet with entirely \ndifferent consequences.  This analysis does not segregate spaces, but closely examines \nthe ways in which the domestic and institutional collapse and constantly refer to each \nother.  Central to this relationship is the understanding that space needs to be \nunderstood not simply as a geographical place, but as ‘a space of relations’, a complex \n 6\nand sometimes contradictory arena of potential struggle for ‘symbolic power’ \n(Bloustein, 1999: 117). \n \nThe study \nSurprisingly, there are few ethnographies of anorexia, and the fieldwork that has been \ndone has been institutionally focused (cf. Gremillion, 2003).  Considering that many \nof the participants in this research project spoke of a consuming desire to ‘fade away’, \n‘disappear’, ‘dissolve into thin air’ and ‘fit into a matchbox’, it is even more surprising \nthat there are few spatial analyses of embodiment in anorexia.  Ethnography is ideally \nplaced to explore these interactions of spaces and bodies, as it does not rely solely on \ntextual data as discursive analyses often do,5 but attends to what Bourdieu (1977) \nrefers to as the embodied, spatial practices of everyday life — the habitus.   \n \nIt was ethnographic fieldwork (of extended interviews and participant observation) \nwith 46 people diagnosed with anorexia (44 women and 2 men, aged between 14 and \n55) that enabled me to share in participants’ everyday worlds.6,7 My fieldwork sites \n(Vancouver, Edinburgh and Adelaide) took me to a variety of treatment settings (in-\npatient and out-patient units in public and private institutions, community treatment \nprograms), community education centres (eating disorder associations and support \ngroups), and into people’s own homes and everyday spaces.  I spent many hours with \nparticipants in their kitchens, lounge rooms, and bedrooms, shared food and drink, met \nwith families and friends, and accompanied them into their community spaces.   \n \n 7\nAs anorexia is often a long term condition, many participants had established \nrelationships with mental health care providers and were admitted to (and discharged  \nfrom) eating disorder programs during the fieldwork.  With their consent, I continued \nto meet with them during their hospitalizations, ate with them in communal dining \nrooms, sat in on ward rounds and therapeutic sessions, interviewed those involved in \ntreatment teams (including psychiatrists, nurses, dietitians, psychotherapists and art \ntherapists), read case notes and closely examined the day to day routines of ward life.   \n \nIt was via this engagement with people in their everyday lives that I was able to \nunderstand anorexia8 through both spoken and written language and what Desjarlais \nrefers to as a ‘phenomenology of embodied aesthetics’ (Desjarlais, 1992: 66).  I \nwatched the ways in which arms and legs were held close to the body, or folded neatly \nunder torsos as participants sat in chairs, thus minimizing the consumption of space in \nan attempt to appear physically smaller and disappear.  In addition, I drew maps of \ndomestic and institutional spaces with participants, and asked them to take their own \nphotographs of spaces, noting the horrified, recoiling bodily reactions of some to \nspecific sites such as kitchens or open fridges, and the humour attached to \nphotographing symbols of hospitalization (such as bedpans and meal trays).  \n \nThese were the fields in which people traveled, these were part of their everyday \nworlds and experiences.  As Lucas argues in his ethnography of people with \nschizophrenia, to ignore the interconnections between experiences and objects, \nbetween people and places, would be to explore only part of their worlds (Lucas, \n1999: 108-109; cf. Parr & Butler, 1999: 12).  My field sites, like the everyday worlds \nof participants, were not pristine, bounded or contained.  People moved back and forth \n 8\nbetween what Parr and Philo (1995: 211) refer to as a ‘mish mash of sites’ — of \npsychiatric services, community spaces, and domestic dwellings — each site a social \nspace enmeshed in and generating its own representations, knowledges and powers \n(Bourdieu & Wacquant, 1992).  It is thus impossible to speak of institutional spaces \nwithout referring to their relationships with other daily spaces.  \n \nDespite the relational aspects of these differing spaces, institutional spaces continue to \nbe aligned with concepts of public, sharply divided from the private (and intensely \ngendered) realm of domestic spaces.  Duncan argues that this hierarchical dichotomy \nis ‘deeply rooted in political philosophy, law, popular discourse and recurrent spatial \nstructuring practices’ (Duncan, 1996: 127), in which public space is assumed to be \nexterior and open, and domestic space interior and closed.  Bloustein similarly \nsuggests that because the ‘attributes of space seem so self-evident, they are frequently \ncategorized into private and public spheres as though these were neatly bounded areas \nthat could be defined and understood objectively’ (1999: 128).  As a result, there is \nlittle acknowledgement of the multiple ways in which these concepts operate.  Within \nany hospital, for example, there is a myriad of private and public spaces — operating \ntheatres for example, are the most closeted spaces of privacy that are never seen or \naccessed by the general public (unless of course they are undergoing surgery, and even \nthen their memories of such spaces are anaesthetized).  Nor are institutional spaces \nalways hegemonic as suggested in Foucauldian analyses of anorexia (aforementioned).  \nInstitutions, as Saris (1995) argues in his critique of institutional assumptions within \nmedical anthropology, not only control, reproduce and name, but are simultaneously \nsites where agency, meaning and power are created.   \n \n 9\nReconfiguring spaces of relatedness \nIt is widely recognized that people with anorexia have a range of practices that \nsignificantly alter they ways in which they engage in social relationships.  As Dias \nnotes, ‘the early stages of anorexia are usually marked by extreme isolation, secrecy, \nand disconnection’ (Dias, 2003: 31).  Social gatherings around food such as meal \ntimes, drinks with friends or any social event presents a level of anxiety that can only \nbe circumnavigated by withdrawal.  The isolation that results from negating social \nrelationships was reflected amongst those involved in this study; many had reduced \nsocial networks and over a third lived alone.  The most striking aspect of people’s \nlives was the absence of sexual relationships.  Over seventy percent were single at the \ntime of my fieldwork and not engaged in any sexual relationships and\/or activities.  In \nterms of relatedness, this is significant, for several described the difficulty of having \n‘other’ and intimate relationships whilst ‘you were having a relationship with \nanorexia’.  As Maddy, now recovered, said: ‘The place where anorexia is, it’s a very \nnarrow space, and there is little room for anything else’. \n \nAs I have argued elsewhere (Warin, 2004) the negation of social relationships did not \nleave people in a void, but allowed the creation of new relationships with themselves, \nwith the personified Ana or Ed (acronyms for anorexia and eating disorders), other \npeople (often with the same diagnosis) and spaces.  For those who lived with families \nor in share houses (and this was over half the group), living spaces were \nfundamentally transformed.  Participants utilized spaces that were already signalled as \nprivate (bathrooms, toilets and bedrooms) to purge and hide food, and transformed \nshared social spaces (such as kitchens and dining rooms) into private spaces.  When \nparticipants did enter kitchen spaces it was often on their own terms: alone and at a \n 10\ntime of their choice.  Suzi remembers shutting all the doors to the kitchen in her family \nhome – ‘so it was all private’ — and cooking cakes that she would then take hours to \nmeticulously decorate.  If her parents or younger brother came into the kitchen whilst \nshe was making cakes she would lose her temper and scream at them, for to be \ndisturbed around food, or ‘caught eating’ was tantamount to a grave invasion of \nprivacy. \n \nClosing off the kitchen and refusing to eat with the family created anger amongst \nSuzi’s family, so she simply refused to eat with them, or even allow them to prepare \nfood for her.  Negating family meal times was an affront to her parents, who were \n‘believers in that saying “the family that eats together stays together”’.  Suzi’s \ntransformation of spaces within the family home had profound consequences for the \ntaken for granted nature of social relations.  Akin to Counihan’s analysis of food, \nintimacy and autonomy in a Florentine family (1999: 156-77), the places in which \nfood was made and consumed was no longer symbolic of ties and connections, and it’s \nrefusal a powerful act that ruptured and disconnected family relations.   \n \nInstead of eating with her family in the kitchen Suzi transformed the intimate space of \nher bedroom into the single space in which she stored, prepared, ate and expelled food.  \nI was buying in tonnes of food - my wardrobe was like stuffed with packets, \nand packets of crisps, packets and packets of biscuits, anything sweet - \nbiscuits, cakes, ice creams - my wardrobe was stuffed full.  My whole life was \nspent in my bedroom to be honest, that’s where I lived all the time. \n 11\nAs well as hiding food in the cupboards, she spat and vomited into plastic containers \nthat were hidden under her bed.  Her bedroom was not simply a place for sleeping, it \nwas also a dining room, a kitchen, a pantry and a receptacle for bodily wastes.   \n \nPart of the retreat to the bedroom was related to the difficulty of sharing domestic \nspaces, of having to deal with the sociability surrounding food preparation and eating.  \nElise, the youngest research participant at 14, knew that her mother would ‘go spare’ \n(be angry) if she found her wearing rubber washing-up gloves in an attempt to avoid \ncontamination from fats while preparing food.  It was easier to avoid people and \nemotions by withdrawing to a bedroom.  The history of the bedroom, as Lofgren \n(2003) and Epstein (1994) note, changed during the Victorian era with the \ndevelopment of the concept of individualism and privacy.  Privacy in sleep and sexual \nintimacy of the married couple meant that the bedroom became the most private \ndomain of the home (Lofgren, 1984\/2003: 145), where seclusion of sleeping and \nsexual activity was marked in space.  It was this seclusion and privacy of bedrooms in \nfamily homes and share houses that allowed participants to disconnect from others.  \nGrant explained that his bedroom was a haven, a place where he could retreat:  \nI’ve always seen [the bedroom] as my place - I shut the door, that’s it - it’s my \nworld sort of thing.  My parents wouldn’t come in there and I could have that \nspace around me and be comfortable.  So I’d go down there to retreat and get \naway from everyone else and that’s when I started doing a lot of stupid food \nthings eating in my room and chucking food away [into the waste paper bin], I \nsaw my bedroom as a safe place to do that. \n \n 12\nBathrooms and toilets were similarly private spaces, and these were sometimes \ntransformed into eating spaces.  Lara discussed the difficulty of sharing a house with \nanother woman, outlining her strategy of taking food to the bathroom.  Late at night \nshe would take one apple from her ‘stash’ — the ‘mountain of apples’ in her bedroom \n— to the privacy of the bathroom, avoiding the commensality of eating.  It was not \nonly a transformation of spatial practices, but also of time, for she ate only late at night \nwhen the darkness of the house ensured absolute privacy.9  \n \nAs I have argued in accompanying papers on bodily contamination, hygiene and \nanorexic practices (Warin, 2003a & b), bathrooms, kitchens and bedrooms are key \nsites in everyday experiences of anorexia.  These are abject zones (cf. Longhurst, \n2001:132; Kristeva, 1992) in which the materiality of the body is laid bare and opened.  \nIn each the body’s permeability is heightened via the ingestion of foods (in kitchens), \nthe expulsion of wastes (in toilets\/bathrooms) and the exchange of bodily fluids (in \nbedrooms).  Bodily boundaries are transgressed and the cultural logic of the ‘clean and \nproper body’ (Grosz, 1994: 194) is threatened.   \n \nThrough their remapping of domestic spaces, participants blurred the practices of \nsociality and privacy that one would normally associate with each of these domestic \nspaces.  And it was precisely these re-configurations of space that supported anorexic \npractices, for it allowed participants to remove themselves from the surveillance of \nfamily and friends. They could eat alone (and what they chose to eat), hide and discard \nfood without recrimination, and purge unwanted food in order to cleanse their bodies \nof contaminating foods.  Clearly hospital programs attempt to prevent some of these \nwell known ‘anorexic behaviours’, but as the next section argues, the spaces of single \n 13\nside rooms that are the mainstay of in-patient treatments actually reproduce and \nsupport these facets of anorexia. \nRe-creating bedrooms in institutional spaces \nWhile there are a multitude of treatment programs for people with anorexia (ranging \nfrom in-patient, residential, community, out-patient and so-called ‘alternative’ \nmodalities), the hospital based programs I engaged with, although they varied in \nspecific content, were remarkably similar in design and instrumentation.  Those who \nwere admitted to in-patient programs always met a criterion that warranted \nhospitalisation (most often dangerously low weights that had immediate consequences \nfor health) and were ‘confined’ to hospital beds to conserve energy and gain weight.  \nIn line with Eckerman’s (1997: 157) earlier observations, single side rooms for in-\npatients were positioned directly opposite the nurses’ stations, and the occupants of \neach room could be observed around the clock.  Doors were not allowed to be closed \n(although curtains could be used for privacy when patients needed to wash or go the \ntoilet).  These admissions were voluntary (although often sparked by family pressures) \nand patients signed contracts to which they conformed or were asked to leave.  \nContracts were often broken, with the main reasons being a vehement resistance to \nweight gain; frustration of intense surveillance (and strict guidelines for mealtimes, \nactivities such as showering, and visiting hours); boredom; hiding food, and secretly \nexercising.  The programs varied in length (from 2 weeks to 6 weeks), and participants \nhad often done successive programs over the years.   \n \nWhilst establishing relationships with health professionals prior to my fieldwork entry \na psychiatrist asked me if I’d like to meet some of ‘the girls’ with anorexia on the \n 14\nward.  He specifically wanted me to see how these hospital rooms had been \ntransformed into what he called ‘bedrooms’.  While these rooms were striking in their \ndifference to others on the ward, it was not until I had spent time with participants in a \nvariety of spaces that the significance of these transformed bedrooms took hold.  In \none psychiatric ward the single side room (of four square metres) conflated all spaces: \nit was the bedroom, the bathroom\/toilet and the place where patients ate.  As such it \nwas a site that was profoundly ambiguous and confusing, for it was a private side \nroom, yet located in the most public of spaces.  I noted this conflation in my fieldnotes \nat the time:  \nThere was something ‘odd’ about the space of Elise’s single room.  On the \npsychiatric ward of this major public hospital there are 8 beds dedicated to \npatients with eating disorders.  Those who sign contracts with the staff to do \nbed programs are allocated a single room - a room which contains a bed, a side \nlocker and a cupboard.  Nearly all patients transform these rooms into \nbedrooms - Elise’s room, for example, was heavily decorated with posters of \nSilverchair10 on the walls and doors, many cards and letters (some from a \nfriend with anorexia whom she had met in hospital and who was also a \nparticipant in my research), photographs of school friends, craft pieces, \npuzzles, a radio cassette player, a television, candles, gifts from visitors \nincluding dried bunches of hanging flowers (arranged in a line above her bed).  \nHer parents had brought in her pillows and duvet from home, adding the final \ntouch of transformation.  Like many high-rise buildings, the windows do not \nopen, and the view is of the bricks of the adjacent building.  There is a sink, but \nit has no taps and the plumbing underneath has been removed.  This is to \nensure that patients cannot vomit or throw food down the sinks.  The door to \n 15\nthe ensuite bathroom is locked for the same reason, and patients are brought \nbedpans to use on a chair.  The door to the room should remain open at all \ntimes so if you were to be surreptitiously exercising you would be seen and \ngiven a warning and the only time it can be shut or the curtain pulled across is \nwhen you need to use a bed pan.  Activity is restricted to a minimum and bed \nrest is encouraged.  The single room thus becomes the bedroom, the \nbathroom\/toilet and the place where people eat - it is a conflation of what is \notherwise sharply demarcated in the private and public spaces of suburban \nhomes.  \n \nHowever, it was not simply a reversal of the public\/private dichotomy, of the private \nlives of patients becoming public, but a conflation of practices and spaces: for what \nwas deemed private became public and what would normally be associated with \nsociality, became private.  This conflation was demonstrated when I was asked by a \nfemale staff member to leave a participant’s room whilst she ate her lunch.  I hurried \nafter the psychiatric nurse to ask her the rationale behind the request, as the only times \nthat I had ever been asked to leave a room in a hospital was when someone needed to \ndo something that was deemed ‘private’, such as using a bedpan or having part of their \nbody attended to (an open wound dressing or an invasive bodily procedure).  The \nnurse explained that eating alone was a stipulation of the bed program for it allowed \nAmanda to concentrate on the task of eating with no competing distractions.  She \nreferred me to dot point 8 of the contract that Amanda had signed, which read: ‘No-\none will be present while the patient is eating meals.  Meals must be eaten before \nvisitors can be seen and must be completed within 30 minutes.  TV and radio to be \nswitched off while eating’.  The single side room thus created a stage for reproducing \n 16\nmany of the spatial configurations and social relations that were practiced at home to \nsupport anorexia.   \n \nAlthough space is not a focus of her analysis, this reproduction of anorexia’s \nconditions of possibility are highlighted by Gremillion (2003) in her recent \nethnography of a psychiatric program for adolescents with anorexia in North America.  \nIn her analysis of therapeutic processes, Gremillion similarly argues that psychiatric \ntreatments unwittingly participate in and reproduce culturally dominant ideals of \ngender, individualism, and family life that are so central to anorexia (cf. Moulding, \n2004).  The psychiatric team for example, becomes the substitute therapeutic family \nwhich takes over traditional gender roles that are assumed to be pathogenic in the \ncauses of anorexia.  These pathogenic family relations, as Malson notes, are reported \nto be ‘typical [of] anorexic families’ and consist of certain personalities or behaviours \n(such as dominant mothers, passive fathers, and sibling rivalry) (Malson, 1998: 84-\n89). Over involved mothers and absent, authorative fathers are reproduced in a clinical \nsetting through gender hierarchies of staff.  As in my fieldwork, most psychiatrists in \neating disorder wards are older males, and hold dominant positions of power within \nthe therapeutic family.  The majority of nurses, who are intensely involved in the day \nto day care of people with anorexia, are women.  The therapeutic family thus acts as a \nsubstitute family, unwittingly reproducing the very family that it assumed to be at fault \nin the underlying pathology of anorexia.  Similarly, the intimate surveillance of bodies \non bed programs (through daily weigh ins, measurement of urine and calorie counting) \nis enacted by both staff and patients, with some patients becoming ‘better practiced \nanorexics’ through their hospital stay (Gremillion, 2003: 10). \n \n 17\nIn arguing that treatment teams participate in the reproduction of anorexia, it is \nimportant to highlight that this is not a straightforward mapping.   As in any cultural \nreproduction there are tensions and transformations.  Participants may have \ntransformed their ward rooms into bedrooms, but as already highlighted, the privacy \nassociated with the private single room was a misnomer for they were constantly and \nintimately surveilled by staff.  There are, however, subtle and important differences \nbetween the hegemonic rendering of Foucault’s panoptican and acts of resistance to \nthis surveillance.  One participant, who at 44 years of age hated ‘being treated like a \nchild’, crawled on her hands and knees out of her room, along the floor on the other \nside of the nurses’ station, and to the smoking room down the corridor so she could \nhave a cigarette.  The fact that participants had to eat all food that was presented to \nthem (or risk a warning), that they couldn’t use the plumbing in their rooms, or wash \ntheir hands after touching food, set up anxieties against which they rallied.  Many \nlaughed with me about how they had tricked the staff through tactics akin to de \nCerteau’s (1984) la perroque – hiding food in the ceiling panels, draining apple juice \ninto bed pans that were taken away and disposed of by the nurses, and scraping butter \nbetween newspaper sheets or duvet covers.  In subordinate positions of power, \nparticipants strategically worked within established spaces and networks to \nappropriate their own power.  This creative and resistant act belie the ‘docile bodies’ \nthat are emphasised in Foucault’s work and is akin to Battaglia’s (1997: 507) and \nDesjarlais’ (1996) notion of agency play, in which people, in the continual negotiation \nof their everyday lives, appropriate and transform power according to the context and \nstruggles at stake.  \n \n 18\nHowever, in characterizing these spatial tactics as a way of obscuring power relations, \none should not fall into a ‘romance of resistance’.  Gremillion illuminates Abu-\nLughod’s point in arguing that resistance through anorexia does not occur \nstraightforwardly as an heroic reaction to medical dominance.  Rather, she reveals \nhow, in her field site, resistance was part of a ‘diagnostic of power’ and was actively \nnurtured by the treatment team in therapeutic protocols.  Opposition to treatment was \nviewed as a positive step in progress as it indicated a shift in patients from ‘mousy and \ncompliant … to arguing the fine points of their program and resisting you tooth and \nnail … [and finally] they start getting better, because they decide it’s not worth their \ntime to hang out in hospital and talk to us’ (Gremillion, 2003: 48-49).  If however, one \nwas to extend Gremillion’s argument, the power of resistance that people with \nanorexia garner is, in Bourdieu’s terms, ‘misrecognised’.  As Gremillion herself \nargues, those who use anorexia as a form of resistance are ultimately self-defeated \n(2003: 47) because they participate in a field of symbolic power in which they are \nalways disadvantaged.  \n \nBeing confined to a bed program reinforces gendered associations of space in which \nwomen, who were often referred to as ‘girls’ in ward rounds, are isolated and \nrestricted from participating in social networks.  Ardener, in Women and Space (1993) \nargues that ‘the organisation, meanings, and uses of space express the hierarchy of \nsocial relationships and ideologies encoded in it’ (Ardener, 1991, quoted in Low and \nLawrence-Zuniga, 2003: 9).  Restricting women to bed programs, in which there are \nstrict guidelines for physical movement, visiting, and social interactions with staff and \nother in-patients), positions them squarely within relations of power in which they are \neffectively muted.11   \n 19\n \nAs such, this confinement to space can be likened to Sedgwick (1990) and Brown’s \n(2000) use of the closet metaphor in their analysis of gay oppression. The closet, \nBrown argues, is a metaphorical and material space that works as a site of oppression \nand resistance, in which people lie, hide, are silenced, unseen and ‘come out of’ in \norder to exist.  Certainly for people with anorexia, the need to conceal and deny their \neveryday practices is an important element of maintaining anorexia, and for hiding \nbehaviours that are readily pathologised (such as self-induced vomiting or laxative \nuse). In order to continue closeted ‘anorexic behaviours’, participants retreated to \nbedrooms, toilets (water closets) and bathrooms.12  Like the bedrooms in institutional \nspaces, these closetted spaces are coded as feminine and ‘employed to exclude, \ncontrol, confine and suppress gender and sexual difference preserving traditional \npatriarchal and heterosexist power structures’ (Duncan, 1996: 8). \nConclusion and Implications \nIn examining the relationships between a number of spaces, this paper extends \nGremillion’s argument by revealing how the space of a single side room reproduces \nthe conflation of domestic spaces that are reconfigured at home.  People with anorexia \nnegate the myriad of social relations associated with food, and retreat to the privacy of \nbedrooms to eat alone.  When admitted to hospital in-patient programs, participants \ntransformed the clinical rooms and replicated the intimacy of their bedrooms, thus \nreproducing the practices of eating, sleeping and abluting in the one conflated space.  \nTreating staff encouraged this transformation and reproduction by encouraging parents \nto bring in items from home, ensuring that participants ate alone, and not allowing \nactivities outside of the room (unless participants gained weight).  Unknowingly, the \n 20\nprograms effectively reproduced and supported the many isolating practices that \npeople with anorexia use to negate relatedness. \n \nPsychiatrists, allied health professionals and families recognise that anorexia is a \nserious disorder with a high morbidity and a significant lifetime mortality.  Treatment \nis difficult and prolonged, and as a recent article in the Lancet found, the existing in-\npatient treatment programs are not improving outcomes (Ben-Tovim et al., 2001).  \nWhile these programs have already been criticized for their narrow focus on weight \nand behaviour modification, this paper argues that the spatial and temporal \nconfiguration of bed programs reproduces the social isolation and negation of \nrelatedness that is central to maintaining anorexia.  Considering that participants \nrepeatedly stated that anorexia was not solely concerned with food and weight, but a \nway of dealing with the complexity of social relations, it is surprising that such \nindividualist programs remain the first choice of institutional in-patient care.13   \n \nNot all programs, however, operate on this model.  One hospital in which I conducted \nfieldwork had ten different programs for people with eating disorders, the majority of \nwhich were out-patient based (only four in-patient beds were reserved for acute \npatients). There were several features of this program that stood in clear distinction to \nthe hospital programs in their reproduction of anorexic practices.  Firstly, this was a \ncommunity residential program located in a large three storey heritage home in the \nsuburbs of Vancouver.  Residents participated in a community and this location \nchanged the very nature of their identity (as they were not circumscribed by \ninstitutional walls they did not consider themselves to be patients) and their recovery \nprocess.  The relationships between food and relatedness were central to this program, \n 21\n                                                \nand people learnt skills that would enable them to engage in social relationships when \nthey left the program.  These included shared preparation of food and cooking in the \nhouse kitchen, inviting friends and family members to share meals on certain nights, \ngrocery shopping, participation in day-to-day running of the house, and eating out. \nThis service could only be accessed by those who had physically and emotionally \nprepared for a four month stay through another supported program (which included \nreaching target weight prior to entering the program to circumvent competition \nbetween residents).   \n \nThe location of this treatment program unsettled and shifted the spatial relations of \ninstitutionalized power.  Moreover, therapeutic spaces which supported the practices \nof anorexia (such as isolation in single bedrooms and eating alone) were challenged in \nan environment that focused on the fundamental relationships between sociality and \nfood.  At the time of my fieldwork this residential program had not been evaluated.  In \nlight of the arguments put forward in this paper, a therapeutic model that positions \nitself in stark contrast to traditional models of care warrants much closer attention \nfrom both the clinical and academic worlds. \n \n \n1 Probyn (1987) and Eckermann (1994) similarly critique early feminist writers such as Orbach and \nLawrence who have embraced Bruch’s (1978) leanings ‘towards a causal model of the media as directly \nresponsible for all social ills, and anorexia in particular as a falling out from experiencing too much \nrepresentation’ (Probyn 1987: 203; Eckermann 1994: 92). \n2 Grosz (1994) makes a similar point concerning the close analogy between the body and the text (1994: \n117).  She also suggests that while Bordo’s discussion of anorexia in terms of a psychology of self \ncontrol is extremely useful, it risks duplicating the mind\/body dualism and taking the body as a kind of \nnatural bedrock on which psychological and sociological analyses may be added as cultural overlays \n(Grosz 1994: 145). \n3 Foucault himself recognised the overemphasis on ‘techniques of domination’ in institutions and \nshifted his later work into ‘technologies of the self’ (Foucault 1980, cited in Miller 1993: 321-2, cf. \nFoucault 1990).  \n 22\n                                                                                                                                             \n4 Dias’ (2003) examination of women’s pro-anorexia narratives in cyberspace also breaks from simple \ndistinctions of public\/private, as the very public space of the internet emerges as a private sanctuary in \nwhich the women can recount personal narratives yet remain completely anonymous. \n5 While Malson (1998) acknowledges that ‘a discourse is not simply a set of linguistic practices’ (1998: \n28), her methodology and analysis is informed by textual data from single, individual interviews, and \nnot the embodied discourses that exist in the social practices of everyday life.   \n6 The small numbers of men involved in this project precludes an examination of the relationship \nbetween masculinity, anorexia and space. \n7 Following standard ethnographic practice, pseudonyms have been used throughout this paper. \n8 Although different people had different names for ‘anorexia’, throughout this thesis I refer to it as \nanorexia, as this is the diagnosis that each were given, a ‘label’ that profoundly affected people’s lives. I \nrecognise the desire of many to write this term away (Malson 1998: 144; Pembroke 1993; Eckermann \n1994), but I could not ignore the symbolic power attached to such a word, and the strategies used to \nmobilise its worth.  This is not to suggest that the label existed independently as a clinical entity, or that \nit was necessarily taken as a given (it was, at certain times, denied), but rather to point to the ways in \nwhich anorexia was mobilised and transformed by participants.  Anorexia was more than a medical \ndiagnosis; it was, amongst many things, an empowering state of being, a friend, an enemy, and a way of \nlife (cf. Warin 2004).  \n9 This cultural construction of privacy is an important aspect of anorexia.  How would Grant practice \nanorexia in the houses that Carsten describes in Langkawi, where houses are characterised by a general \nlack of division of interior space? (1995: 113).  Houses usually consist of a hearth and one main room, \nand individual household members do not have their own daytime space.   \n10 During my fieldwork the lead singer (Daniel Johns) of a three piece Australian band Silverchair wrote \na song — Ana’s song — about his experiences of anorexia.  His experiences, and his ability to \n‘articulate’ them through music, were seen to embody what was unspeakable about anorexia. \n11 One participant, who had experienced repeated sexual abuse, reported that anorexia was a way of \ndisappearing and remaining silent, thus not attracting further unwanted attention.  \n12 Longhurst (2001) makes a similar argument in her analysis of pregnant bodies and ‘confinement’. \n13 Gremillion notes that whilst programs have changed considerably in the last decade, that ‘many \npractitioners today idealise programs like the one I studied [long term in-patient hospitalisation]and \nstrive (or wish) to emulate its practices and principles as much as possible.  Also, the centrepiece of \nmost ‘pared down’ hospital programs remains, not surprisingly, weight gain through behaviour \nmodification. In fact, some hospital programs are now narrowing to this focus’. (2003: 11) \n 23\nReferences \nAbu-Lughod, Lila (1990) ‘The Romance of Resistance: Tracing Transformations of \nPower through Bedouin Women’,  American Ethnologist 17 (1): 43-55 \nAngel, Maria & Zoe Sofia (1996) ‘Cooking up: Intestinal Economies and the \nAesthetics of Specular Orality’,  Cultural Studies 10(3): 464-83 \nArdener, Shirley (1993) Women and Space: Ground Rules and Social Maps. Oxford: \nBerg. \nBartky, Sandra (1988) ‘Foucault, femininity and the modernisation of patriarchal \npower’, in I. Diamond and L. Quinby (eds) Feminism and Foucault: Reflections on \nResistance.  Boston: Northeastern University Press. \nBattaglia, Deborrah (1997) ‘Ambiguating agency: The Case of Malinowski’s Ghost’,  \nAmerican Anthropologist 99(3): 505-10. \nBen-Tovim, David, Kay Walker, Peter Gilchrist, Robyn Freeman, Ross Kalucy & \nAdrian Esterman (2001) ‘Outcome in Patients with Eating Disorders: a 5-year study’,  \nThe Lancet 357: 1254-7 \nBloustein, Gerry (1999) Striking Poses: An Investigation into the Constitution of \nGendered Identity as Process, in the Worlds of Australian Teenage Girls.  PhD Thesis, \nDepartment of Anthropology, University of Adelaide. \nBordo, Susan (1988) ‘Anorexia Nervosa: Psychopathology as the Crystallisation of \nCulture’, in I. Diamond and L. Quinby (eds) Feminism and Foucault: Reflections on \nResistance.  Boston: Northeastern University Press. \n 24\n⎯  (1989) ‘The Body and the Reproduction of Femininity: A Feminist Appropriation \nof Foucault’, in A. Jagger and S. Bordo (eds) Gender\/Body\/Knowledge: Feminist \nReconstructions of Being and Knowing.  New Brunswick: Rutgers University Press. \n⎯  (1990) ‘Reading the Slender Body’, in M. Jacobus., E. Fox Keller and S. \nShuttleworth. (eds) Body\/Politics: Women and the Discourses of Science. London & \nNew York: Routledge. \nBourdieu, Pierre (1977) Outline of a Theory of Practice.  (trans.) R. Nice. Cambridge: \nCambridge University Press. \n⎯ & Wacquant, Loic (1992) An Invitation to Reflexive Sociology. Cambridge: polity \nPress. \nBrown, Micahel (2000) Closet Space: Geographies of Metaphor from the Body to the \nGlobe.  London and New York: Routledge. \nButler, Ruth & Hester Parr (eds) (1999) Mind and Body Spaces: Geographies of \nIllness, Impairment and Disability.  London and New York: Routledge. \nCarsten, Janet & Stephen Hugh-Jones (eds) (1995) About the House: Levi-Strauss and \nBeyond.  Cambridge ; New York: Cambridge University Press. \nCounihan, Carole (1999) The Anthropology of Food and Body: Gender, Meaning and \nPower.  New York & London: Routledge. \nde Certeau, Michel (1984) The Practice of Everyday Life.  Berkeley: University of \nCalifornia. \n 25\nDesjarlais, Robert (1996) ‘The Office of Reason: On the Politics of Language and \nAgency in a Shelter for ‘The Homeless Mentally Ill’’, American Ethnologist 23(4): \n880-900 \nDias, Karen (2003) ‘The Ana Sanctuary: Women’s Pro-Anorexia Narratives in \nCyberspace’, Journal of International Women’s Studies 4 (2): 31-45 \nDuncan, Nancy (ed) (1996) BodySpace: Destabilizing Geographies of Gender and \nSexuality. London and New York: Routledge. \nEckermann, Liz (1994) ‘Self-starvation and Binge-Purging: Embodied \nSelfhood\/Sainthood’,  Australian Cultural History 13: 82-99 \n⎯  (1997) ‘Foucault, Embodiment and Gendered Subjectivities: The Case of \nVoluntary Self-starvation’, in A. Petersen and R. Bunton (eds) Foucault, Health and \nMedicine. London: Routledge. \nEpstein, A (Bill). (1994) ‘Privacy and the Boundaries of the Self: Reflections on some \nTolai Data’, Canberra Anthropology 17 91), 1-29 \nFoucault, Michel (1980) Power\/Knowledge.  London: Harvester. \n⎯ (1990) The Use of Pleasure. Vol 2 of The History of Sexuality (trans.) R. Hurley.  \nNew York: Vintage Books. \nGremillion, Helen (2003) Feeding Anorexia: Gender and Power at a Treatment \nCenter.  Durham: Duke University Press. \nGrosz, Elizabeth (1994) Volatile Bodies: Towards a Corporeal Feminism.  Sydney: \nAllen and Unwin. \n 26\nHepworth, Julie (1999) The Social Construction of Anorexia Nervosa.  London: Sage. \nJackson, Michael (1996) ‘Introduction: phenomenology, radical empiricism, and \nanthropological critique’, pp. 1-50 in M. Jackson (ed)  In Things As They Are: New \nDirections in Phenomenological Anthropology. Bloomington and Indianapolis: \nIndiana University Press. \nLofgren, Orvar (1984\/2003) ‘The Sweetness of Home: Class, Culture and Family Life \nin Sweden’, pp. 142-159 in S. Low and D. Lawrence-Zuniga (eds) (2003) The \nAnthropology of Space and Place. Oxford: Blackwell. \nLonghurst, Robyn (2001) Bodies: Exploring Fluid Boundaries.  London and New \nYork: Routledge. \nLow, Setha and Lawrence-Zuniga. Denise (eds) (2003) The Anthropology of Space \nand Place. Oxford: Blackwell. \nLucas, Rod (1999) Uncommon Lives: An Ethnography of Schizophrenia as \nExtraordinary Experience.  Unpublished PhD, Departments of Anthropology and \nPsychiatry, University of Adelaide, Adelaide. \nMalson, Helen (1998) The Thin Woman: Feminism, Post-structuralism and the Social \nPsychology of Anorexia Nervosa.  London: Routledge. \nMiller, James (1993) The Passion of Michel Foucault.  New York: Simon and \nSchuster. \n 27\nMoulding, Nicole (2004) Disciplining the Feminine: The Reproduction of Gender \nContradictions in Mental Health Care.  Unpublished PhD, Departments of Social \nInquiry and Public Health, University of Adelaide, Adelaide. \nMcNay, Lois (1992) Foucault and Feminism. Cambridge: Polity Press. \nOrbach, Susie (1986) Hunger Strike: The Anorectic’s Struggle as a Metaphor for Our \nAge.  London: Faber and Faber. \nParr, Hester & Chris Philo (1995) ‘Mapping Mad Identities’, in S. Pile & N. Thrift \n(eds) Mapping the Subject: Geographies of Cultural Transformation.  London: \nRoutledge. \nProbyn, Elsepth (1987) ‘The Anorexic Body’, pp. 199-211 in A. Kroker & M. Kroker \n(eds) Body Invaders, Panic Sex in America.  Montreal: New World Perspectives, \nCultureTexts Series, Oxford University Press. \nSaris, Jamie (1995) ‘Telling Stories: Life Histories, Illness Narratives, and \nInstitutional Landscapes’,  Culture, Medicine and Psychiatry 19: 39-72 \nSedgwick, Eve (1990) Epistemology of the Closet.  Berkeley: University of California \nPress. \nTait, G. (1992) ‘Anorexia nervosa: asceticism, differentiation, government’,  The \nAustralian and New Zealand Journal of Sociology  29(2): 194-208 \nTurner, Bryan (1984) The Body and Society: Explorations in Social Theory.  London: \nBasil Blackwell. \n⎯ (1987) Medical Power and Social Knowledge.  London: Sage. \n 28\nWarin, Megan (2003a) ‘Miasmatic Calories and Saturating Fats: Fear of \nContamination in Anorexia’,  Culture, Medicine and Psychiatry 27: 77-93 \n⎯ (2003b) ‘Be-coming Clean: The Logic of Hygiene in Anorexia’,  Sites: A Journal \nof Social Anthropology and Cultural Studies 1 (1): 109-132 \n— (2004) ‘Re-configuring Relatedness in Anorexia’, Anthropology and Medicine \n(currently under review). \n \n"}