{"doi":"10.1080\/00107510600893960","coreId":"68330","oai":"oai:eprints.lancs.ac.uk:32817","identifiers":["oai:eprints.lancs.ac.uk:32817","10.1080\/00107510600893960"],"title":"Biological physics of the developing embryo.","authors":["McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-07","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68330.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32817\/1\/embryoPrePrint.pdf","pdfHashValue":"d72406be2e81f3792f897358ac021f794de4d4eb","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32817<\/identifier><datestamp>\n      2017-10-26T23:02:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Biological physics of the developing embryo.<\/dc:title><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:date>\n        2006-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32817\/1\/embryoPrePrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/00107510600893960<\/dc:relation><dc:identifier>\n        McClintock, Peter V. E. (2006) Biological physics of the developing embryo. Contemporary Physics, 47 (4). p. 232. ISSN 0010-7514<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32817\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1080\/00107510600893960","http:\/\/eprints.lancs.ac.uk\/32817\/"],"year":2006,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Biological Physics of the Developing Embryo, by Gabor Forgacs and Stuart A.\nNewman, Cambridge University Press, Cambridge, 2005, pp vii + 337. Scope: textbook.\nLevel: undergraduate and postgraduate.\nPhysicists usually take it as an article of faith that, at least in principle, all science\nmust ultimately be explicable in terms of the laws of physics. Chemists, understandably\nirritated by the condescension inherent in this world picture are apt to retort: “Yes,\nmaybe, and in that case the useful parts of physics are called chemistry”. The reality, as\nusual, is far more complex, especially in the case of the connections between physics and\nbiology. Even the simplest living system is so complicated that the application of physics\nseems at first sight unlikely to be helpful. Even knowing that only electromagnetic forces\nare involved, with some effect from gravity in particular cases, the sheer complexity of\nlife seems at first sight overwhelming. Physicists usually work with simplified models\nof reality. They are unaccustomed to matter that displays goal-directed behaviour, for\nexample, although it is absolutely normal and to be expected in living systems that have\nevolved with an ability and drive to reproduce. It is now understood, however, there are\nmany cases where physics can in fact be applied directly to gain deeper understanding.\nThis is still so, even at much higher levels of modelling than that of atoms and molecules\nwhere physics and chemistry and biology are well understood to meet together in their\ncommon discussion of DNA. The importance of physics in accounting for e.g. the operation\nof molecular motors, the architecture of biological individual cells, and the biomechanical\nproperties of tissues is now widely appreciated by biologists.\nGabor Forgacs and Stuart Newman – respectively professors of biological physics and\nof cell biology and anatomy – have joined forces to produce a book about how physics can\nusefully be applied to biology, intended to be accessible to both biologists and physicists.\nIt is an ambitious enterprise. As their exemplar they take the developing embryo, starting\nfrom a single cell, because it undergoes such an extraordinary series of changes with,\ncorrespondingly, many different stages where physics is of importance. As the authors\npoint out, the role of physics is especially obvious in constraining and influencing the\noutcome during early development.\nThe book opens by introducing the eukaryotic cell (with a nucleus, the kind of cell\nof which plants and animals are made) in simple terms, but in sufficient detail to bring\nout its huge complexity. Relevant physical concepts and processes within the cell are\nthen described, including free diffusion, directed diffusion, osmosis, viscosity, transport,\n1\nPublished in Contemp. Phys. 47, 232 (2006).\nelasticity, and viscoelasticity. The overdamped nature of the internal cell dynamics is\nemphasised, showing that inertial effects are essentially absent: net motion ceases almost\ninstantly when the force is removed. This introduction sets the scene for most of what\nfollows.\nThe second chapter describes the processes through which an embryo develops from\na single cell to a multicellular aggregate or blastula. In the course of this description,\nmany important concepts and definitions are introduced including e.g. DNA, chromo-\nsomes, microtubules, mitosis and cytokinesis. Another physical concept, surface tension,\nis introduced and deployed in modelling the first cleavage.\nThere follow eight chapters treating different aspects of the physics of the developing\nembryo including, to mention only a few examples, gene expression, oscillatory processes\nin cells, diversification, adhesion, cell sorting, gastrulation, neurulation, pattern forma-\ntion, segmentation, development of the cardiovascular system, branching morphogenesis,\nvertebrate limb development, fertilization, calcium waves, and an example of an evolu-\ntionary transition: segmentation in insects.\nThere are numerous beautiful coloured illustrations to illuminate the structures and\nideas discussed in the text, and are enormously helpful in clarifying some difficult concepts\nand sequences of events. Detailed material is confined to boxes so as not to break the flow\nof the narrative. Each chapter closes with a perspective paragraph to summarise what\nhas been said and set it in context. There is a very substantial glossary of technical terms,\nwhich is indeed essential in a book of this kind, together with an extensive bibliography\nand a detailed and seemingly inclusive index.\nHave the authors succeeded in their ambitious aim of being comprehensible to both\nphysicists and biologists? I believe that they have. The average physicist will have to\nwork quite hard, but everything he or she needs is there and the illustrations and glossary\nare a great help. Of course, the book only covers particular examples of the application\nof physics to biology, but the topics included are both interesting and remarkably diverse.\nI cannot speak for biologists, but physicists who read to the end will learn a lot. They\nwill enjoy doing so, and they will gain an appreciation of the way in which quite simple\nphysics often underlies the extraordinarily complex behaviour exhibited by living systems.\nPeter V. E. McClintock\nLancaster University.\n2\n"}