{"doi":"10.1186\/1472-6963-10-135","coreId":"96199","oai":"oai:eprints.lse.ac.uk:28971","identifiers":["oai:eprints.lse.ac.uk:28971","10.1186\/1472-6963-10-135"],"title":"Medication errors with electronic prescribing (eP): two views of the same picture","authors":["Savage, Imogen","Cornford, Tony","Klecun, Ela","Barber, Nick","Clifford, Sarah","Franklin, Bryony Dean"],"enrichments":{"references":[{"id":17248294,"title":"BD: The effects of electronic prescribing on the quality of prescribing.","authors":[],"date":"2007","doi":"10.1111\/j.1365-2125.2007.02995.x","raw":"Donyai P, O'Grady K, Jacklin A, Barber N, Franklin BD: The effects of electronic prescribing on the quality of prescribing.  Br J Clin Pharmacol 2007, 65:230-7.","cites":null},{"id":17248298,"title":"Case record review of adverse events: a new approach. Qual Saf Health Care","authors":[],"date":"2003","doi":"10.1136\/qhc.12.6.411","raw":"Woloshynowych M, Neale G, Vincent C: Case record review of adverse events: a new approach.  Qual Saf Health Care 2003, 12:411-5.","cites":null},{"id":17248283,"title":"Commission for Healthcare Audit and Inspection: The Best Medicine. Managing medicines in acute and specialist trusts.","authors":[],"date":"2007","doi":null,"raw":"Commission for Healthcare Audit and Inspection: The Best Medicine. Managing medicines in acute and specialist trusts. London 2007.","cites":null},{"id":17248290,"title":"Electronic prescribing- &quot;I want it and I want it now!&quot;. Hospital Pharmacist","authors":[],"date":"2007","doi":null,"raw":"Swanson D: Electronic prescribing- &quot;I want it and I want it now!&quot;. Hospital Pharmacist 2007, 14:210.","cites":null},{"id":17248286,"title":"Electronic prescribing-the way forward.","authors":[],"date":"2000","doi":null,"raw":"Summers V: Electronic prescribing-the way forward.  Pharm J 2000, 265:834.","cites":null},{"id":17248288,"title":"Faxvaag A: No paper but the same routines: a qualitative exploration of experiences in two Norwegian hospitals deprived of the paper-based medical record. BMC Medical Informatics and Decision Making","authors":[],"date":"2008","doi":"10.1186\/1472-6947-8-2","raw":"Lium J-T, Tjora A, Faxvaag A: No paper but the same routines: a qualitative exploration of experiences in two Norwegian hospitals deprived of the paper-based medical record.  BMC Medical Informatics and Decision Making 2008, 8:2.","cites":null},{"id":17248307,"title":"Hiding in plain sight: What Koppel et al tell us about healthcare IT.","authors":[],"date":"2005","doi":"10.1016\/j.jbi.2005.05.010","raw":"Nemeth C, Cook R: Hiding in plain sight: What Koppel et al tell us about healthcare IT.  J Biomed Informatics 2005, 38:262-3.","cites":null},{"id":17248296,"title":"Klecun E, Savage I: Safer, faster, better? Evaluating electronic prescribing.","authors":[],"date":"2006","doi":null,"raw":"Barber N, Franklin BD, Cornford T, Klecun E, Savage I: Safer, faster, better? Evaluating electronic prescribing.  2006 [http:\/\/ www.pcpoh.bham.ac.uk\/publichealth\/psrp\/documents\/ PS019_Final_Report_Barber.pdf].","cites":null},{"id":17248297,"title":"Klecun E: Qualitative evaluation of an electronic prescribing and administration system. Qual Saf Health Care","authors":[],"date":"2007","doi":"10.1136\/qshc.2006.019505","raw":"Barber N, Cornford T, Klecun E: Qualitative evaluation of an electronic prescribing and administration system.  Qual Saf Health Care 2007, 16:271-278.","cites":null},{"id":17248305,"title":"Medication errors: a prospective cohort study of hand-written and computerised physician order entry in the intensive care unit. Clinical Care","authors":[],"date":"2005","doi":null,"raw":"Shulman R, Singler M, Goldstone J, Bellingan G: Medication errors: a prospective cohort study of hand-written and computerised physician order entry in the intensive care unit.  Clinical Care 2005, 9:R516-21.","cites":null},{"id":17248285,"title":"MS: To Err is Human: Building a safer health system Washington DC: National Academy Press;","authors":[],"date":"2000","doi":"10.12968\/bjhc.2000.6.9.19311","raw":"Kohn LT, Corrigan JM, Donaldson MS: To Err is Human: Building a safer health system Washington DC: National Academy Press; 2000.","cites":null},{"id":17248301,"title":"Nurses attitudes and beliefs about medication errors in a UK hospital.","authors":[],"date":"2000","doi":"10.1111\/j.2042-7174.2000.tb00997.x","raw":"Hand K, Barber N: Nurses attitudes and beliefs about medication errors in a UK hospital.  Int J Pharm Pract 2000, 8:128-34.","cites":null},{"id":17248282,"title":"Office: A safer place for patients: Learning to improve patient safety. London","authors":[],"date":"2005","doi":null,"raw":"National Audit Office: A safer place for patients: Learning to improve patient safety. London 2005.","cites":null},{"id":17248284,"title":"Office: The National Programme for IT in the NHS: progress since 2006. London","authors":[],"date":"2008","doi":null,"raw":"National Audit Office: The National Programme for IT in the NHS: progress since 2006. London 2008.","cites":null},{"id":17248300,"title":"Qualitative data analysis for applied policy research.","authors":[],"date":"1993","doi":"10.4324\/9780203413081_chapter_9","raw":"Ritchie J, Spencer L: Qualitative data analysis for applied policy research.  In Analysing qualitative data Volume 1993. Edited by: Bryman A, Burgess R. London: Routledge :173-94.","cites":null},{"id":17248292,"title":"Scemama O: Comparison of three methods for estimating rates of adverse events and rates of preventable adverse events in acute care hospitals. BMJ","authors":[],"date":"2004","doi":"10.1136\/bmj.328.7433.199","raw":"Michel P, Quenon JL, de Sarasqueta AM, Scemama O: Comparison of three methods for estimating rates of adverse events and rates of preventable adverse events in acute care hospitals.  BMJ 2004, 328:199-203.","cites":null},{"id":17248287,"title":"Spours A: Electronic prescribing and medicines administration: are we overcoming the barriers to success? Br J Healthcare Comput Info Manage","authors":[],"date":"2003","doi":null,"raw":"Brennan S, Spours A: Electronic prescribing and medicines administration: are we overcoming the barriers to success?  Br J Healthcare Comput Info Manage 2003, 20(4):19-22.","cites":null},{"id":17248289,"title":"Strom BL: Role of computerised physician order entry systems in facilitating medication errors. JAMA","authors":[],"date":"2005","doi":null,"raw":"Koppel R, Metlay JP, Cohen A, Abaluck B, Localio AR, Kimmel SE, Strom BL: Role of computerised physician order entry systems in facilitating medication errors.  JAMA 2005, 293:1197-203.","cites":null},{"id":17248303,"title":"The attitudes and beliefs of healthcare professionals on the causes and reporting of medication errors in a UK ICU. Anaesthesia","authors":[],"date":"2007","doi":"10.1111\/j.1365-2044.2006.04858.x","raw":"Sanghera IS, Franklin BD, Dhillon S: The attitudes and beliefs of healthcare professionals on the causes and reporting of medication errors in a UK ICU.  Anaesthesia 2007, 62:53-61.","cites":null},{"id":17248319,"title":"The Bayswater Institute: Research evaluation of the early NHS electronic record pilot sites. London","authors":[],"date":"2001","doi":null,"raw":"The Bayswater Institute: Research evaluation of the early NHS electronic record pilot sites. London 2001.","cites":null},{"id":17248295,"title":"The impact of a closed loop electronic prescribing and automated dispensing system on the ward pharmacist's time and activities. Int J Pharm Pract","authors":[],"date":"2007","doi":"10.1211\/ijpp.15.2.0009","raw":"Franklin BD, O'Grady K, Donyai P, Jacklin A, Barber N: The impact of a closed loop electronic prescribing and automated dispensing system on the ward pharmacist's time and activities.  Int J Pharm Pract 2007, 15:133-9.","cites":null},{"id":17248293,"title":"The impact of a closed-loop electronic prescribing and administration system on prescribing errors, administration errors and staff time: a before and after study. Qual Saf Health Care","authors":[],"date":"2007","doi":"10.1136\/qshc.2006.019497","raw":"Franklin BD, O'Grady K, Donyai P, Jacklin A, Barber N: The impact of a closed-loop electronic prescribing and administration system on prescribing errors, administration errors and staff time: a before and after study.  Qual Saf Health Care 2007, 16:279-284.","cites":null},{"id":17248291,"title":"The incidence of prescribing errors in hospital inpatients - an overview of the research methods. Drug Saf","authors":[],"date":"2005","doi":"10.2165\/00002018-200528100-00005","raw":"Franklin BD, Vincent C, Schachter M, Barber N: The incidence of prescribing errors in hospital inpatients - an overview of the research methods.  Drug Saf 2005, 28:891-900.","cites":null},{"id":17248299,"title":"What is a prescribing error? Qual Health Care","authors":[],"date":"2000","doi":null,"raw":"Dean BS, Barber ND, Schachter M: What is a prescribing error?  Qual Health Care 2000, 9(4):232-7.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05-24","abstract":"Background: Quantitative prospective methods are widely used to evaluate the impact of new technologies such as electronic prescribing (eP) on medication errors. However, they are labour-intensive and it is not always feasible to obtain pre-intervention data. Our objective was to compare the eP medication error picture obtained with retrospective quantitative and qualitative methods. Methods: The study was carried out at one English district general hospital approximately two years after implementation of an integrated electronic prescribing, administration and records system. Quantitative: A structured retrospective analysis was carried out of clinical records and medication orders for 75 randomly selected patients admitted to three wards ( medicine, surgery and paediatrics) six months after eP implementation. Qualitative: Eight doctors, 6 nurses, 8 pharmacy staff and 4 other staff at senior, middle and junior grades, and 19 adult patients on acute surgical and medical wards were interviewed. Staff interviews explored experiences of developing and working with the system; patient interviews focused on experiences of medicine prescribing and administration on the ward. Interview transcripts were searched systematically for accounts of medication incidents. A classification scheme was developed and applied to the errors identified in the records review. Results: The two approaches produced similar pictures of the drug use process. Interviews identified types of error identified in the retrospective notes review plus two eP-specific errors which were not detected by record review. Interview data took less time to collect than record review, and provided rich data on the prescribing process, and reasons for delays or non-administration of medicines, including \"once only\" orders and \"as required\" medicines. Conclusions: The qualitative approach provided more understanding of processes, and some insights into why medication errors can happen. The method is cost-effective and could be used to supplement information from anonymous error reporting scheme","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96199.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/28971\/1\/Medication%20errors%20with%20electronic%20prescribing%20%28eP%29%28lsero%29.pdf","pdfHashValue":"f6b586d78b41e420cc4610a25372efa02f320786","publisher":"BioMed","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:28971<\/identifier><datestamp>\n      2017-05-04T09:35:38Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3839<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/28971\/<\/dc:relation><dc:title>\n        Medication errors with electronic prescribing (eP): two views of the same picture<\/dc:title><dc:creator>\n        Savage, Imogen<\/dc:creator><dc:creator>\n        Cornford, Tony<\/dc:creator><dc:creator>\n        Klecun, Ela<\/dc:creator><dc:creator>\n        Barber, Nick<\/dc:creator><dc:creator>\n        Clifford, Sarah<\/dc:creator><dc:creator>\n        Franklin, Bryony Dean<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        Background: Quantitative prospective methods are widely used to evaluate the impact of new technologies such as electronic prescribing (eP) on medication errors. However, they are labour-intensive and it is not always feasible to obtain pre-intervention data. Our objective was to compare the eP medication error picture obtained with retrospective quantitative and qualitative methods. Methods: The study was carried out at one English district general hospital approximately two years after implementation of an integrated electronic prescribing, administration and records system. Quantitative: A structured retrospective analysis was carried out of clinical records and medication orders for 75 randomly selected patients admitted to three wards ( medicine, surgery and paediatrics) six months after eP implementation. Qualitative: Eight doctors, 6 nurses, 8 pharmacy staff and 4 other staff at senior, middle and junior grades, and 19 adult patients on acute surgical and medical wards were interviewed. Staff interviews explored experiences of developing and working with the system; patient interviews focused on experiences of medicine prescribing and administration on the ward. Interview transcripts were searched systematically for accounts of medication incidents. A classification scheme was developed and applied to the errors identified in the records review. Results: The two approaches produced similar pictures of the drug use process. Interviews identified types of error identified in the retrospective notes review plus two eP-specific errors which were not detected by record review. Interview data took less time to collect than record review, and provided rich data on the prescribing process, and reasons for delays or non-administration of medicines, including \"once only\" orders and \"as required\" medicines. Conclusions: The qualitative approach provided more understanding of processes, and some insights into why medication errors can happen. The method is cost-effective and could be used to supplement information from anonymous error reporting schemes<\/dc:description><dc:publisher>\n        BioMed<\/dc:publisher><dc:date>\n        2010-05-24<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/28971\/1\/Medication%20errors%20with%20electronic%20prescribing%20%28eP%29%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Savage, Imogen and Cornford, Tony and Klecun, Ela and Barber, Nick and Clifford, Sarah and Franklin, Bryony Dean  (2010) Medication errors with electronic prescribing (eP): two views of the same picture.  BMC Health Services Research, 10 (135).   ISSN 1472-6963     <\/dc:identifier><dc:relation>\n        http:\/\/www.biomedcentral.com\/bmchealthservres\/<\/dc:relation><dc:relation>\n        10.1186\/1472-6963-10-135<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/28971\/","http:\/\/www.biomedcentral.com\/bmchealthservres\/","10.1186\/1472-6963-10-135"],"year":2010,"topics":["R Medicine (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nImogen Savage, Tony Cornford, Ela Klecun, Nick Barber \nSarah Clifford and Bryony Dean Franklin \nMedication errors with electronic \nprescribing (eP): two views of the same \npicture \n \nArticle (Published version) \n \nOriginal citation: \nSavage, Imogen and Cornford, Tony and Klecun, Ela and Barber, Nick and Clifford, Sarah and \nFranklin, Bryony Dean (2010) Medication errors with electronic prescribing (eP): two views of the \nsame picture. BMC health services research, 10 (135). ISSN 1472-6963  \nDOI: 10.1186\/1472-6963-10-135 \n \n© 2010 The Authors; BioMed Central Ltd. This is an Open Access article distributed under the \nterms of the Creative Commons attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the \noriginal work is properly cited. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/28971\/ \nAvailable in LSE Research Online: June 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nOpen AccessR E S E A R C H  A R T I C L EResearch articleMedication errors with electronic prescribing (eP): \nTwo views of the same picture\nImogen Savage*1, Tony Cornford2, Ela Klecun2, Nick Barber1, Sarah Clifford1 and Bryony Dean Franklin1,3\nAbstract\nBackground: Quantitative prospective methods are widely used to evaluate the impact of new technologies such as \nelectronic prescribing (eP) on medication errors. However, they are labour-intensive and it is not always feasible to \nobtain pre-intervention data. Our objective was to compare the eP medication error picture obtained with \nretrospective quantitative and qualitative methods.\nMethods: The study was carried out at one English district general hospital approximately two years after \nimplementation of an integrated electronic prescribing, administration and records system. Quantitative: A structured \nretrospective analysis was carried out of clinical records and medication orders for 75 randomly selected patients \nadmitted to three wards (medicine, surgery and paediatrics) six months after eP implementation. Qualitative: Eight \ndoctors, 6 nurses, 8 pharmacy staff and 4 other staff at senior, middle and junior grades, and 19 adult patients on acute \nsurgical and medical wards were interviewed. Staff interviews explored experiences of developing and working with \nthe system; patient interviews focused on experiences of medicine prescribing and administration on the ward. \nInterview transcripts were searched systematically for accounts of medication incidents. A classification scheme was \ndeveloped and applied to the errors identified in the records review.\nResults: The two approaches produced similar pictures of the drug use process. Interviews identified types of error \nidentified in the retrospective notes review plus two eP-specific errors which were not detected by record review. \nInterview data took less time to collect than record review, and provided rich data on the prescribing process, and \nreasons for delays or non-administration of medicines, including \"once only\" orders and \"as required\" medicines.\nConclusions: The qualitative approach provided more understanding of processes, and some insights into why \nmedication errors can happen. The method is cost-effective and could be used to supplement information from \nanonymous error reporting schemes.\nBackground\nReplacing inpatient paper medication orders and medical\nnotes with electronic records is widely seen as the key\nstep to improve patient safety both in the United King-\ndom [1-3] and elsewhere [4]. Most UK hospital trusts are\nreported [1] to think that computerisation will reduce\nmedication errors by increasing control over prescribing.\nHowever, very few UK hospitals [5,6] have actually imple-\nmented hospital-wide electronic systems for ordering\nand recording administration of medicines (both defined\nas electronic prescribing in the UK). A similar, though\nslightly better, situation has been reported in Norway [7]\nwith implementation in most hospitals \"stalled\". In the\nUSA, widely perceived as leading the field in hospital\ncomputerised prescribing, less than 10% of hospitals are\nreported [8] to have electronic systems.\nThis is not really surprising as information and com-\nmunication technology systems are complex and costly\ninterventions. Committing to a particular system\nrequires belief in the evidence that it will be better than\ncurrent practice, and that potential problems can be\nmanaged [9]. Such evidence usually comes from evalua-\ntion studies.\nThe majority of research studies testing the effect of\ninterventions on medication prescribing error rates have\nused prospective process (observational error counting)\nor outcome (harm recording) methods [10]. Prospective\ndetection of unintended injury caused by medical man-\n* Correspondence: imogen.savage@pharmacy.ac.uk\n1 Department of Practice and Policy, the School of Pharmacy University of \nLondon, London, UK\nFull list of author information is available at the end of the article© 2010 Savage et al; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative Commons\nAttribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in\nany medium, provided the original work is properly cited.\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 2 of 8agement has higher face validity than retrospective meth-\nods [11]. For medication errors [12-14] the advantage of\nprospective methodology is that it allows some or all of\nthe data collection to be done as part of a pharmacist's\nnormal prescription (order) monitoring duties, so reduc-\ning research staff workload and cost. The drawback is\nthat if- as frequently happens- an evaluation is commis-\nsioned quite close to the time of implementation, it may\nnot be possible for the evaluators to obtain access to the\nsite before the intervention is put in place. In such cases,\nthe only option is to gather pre-intervention data retro-\nspectively, an approach which has been little used in the\nUK [10,15].\nTo date, retrospective eP evaluations have involved car-\nrying out a structured clinical review of a sample of\npatient medical records to identify, classify and count dif-\nferent types of medication errors. However, the people\nproviding or receiving hospital care also offer a rich\nsource of data on the day-to-day workings of a newly\nimplemented eP system. Interviews with stakeholders\nhave already been used to understand the ways such a\nsystem can be introduced into, and become part of, hos-\npital practice [15,16].\nThe aim of this study is to compare the post-eP error\npictures provided by retrospective record review and by\ninterviews with staff and patients within one hospital,\nand to consider the usefulness of interviews as an evalua-\ntion method.\nMethods\nThis retrospective evaluation was approved by the South\nEast Staffordshire local research ethics committee\n(LREC) and conducted at Queen's Hospital Burton upon\nTrent [QHB]. This district general hospital was an early\nadopter of eP and has a long-established system [15]\noperating as part of a Meditech hospital-wide informa-\ntion system (HIS) and linked to all other electronic\npatient and laboratory data. Traditional paper medical\nnotes were maintained but all other records were made\nand stored electronically. Wireless laptops and static ter-\nminals allowed access from almost anywhere in the hos-\npital site. Senior staff could also access the system from\nhome.\nAll authorised staff had access to patient care records;\npharmacists used the system to carry out daily prescrip-\ntion review of their allotted patients. System entry was via\npersonal identification number (PIN) and password,\nissued after mandatory in-house training. All activities\nwere fully auditable.\nQHB had a clear policy on eP decision support: the pre-\nscriber remained responsible for the decision and hence\nmost of the support was ensuring that drugs prescribed\nwere on the hospital formulary, in doses and formulations\nthat could be supplied. The eP system had been cust-\nomised to give prescriber \"red box\" warnings only for\nclinically significant drug-drug interactions, as defined in\nthe British National Formulary. These could be over-rid-\nden if the prescriber wished, Default doses, dosing fre-\nquencies and maximum dose warnings were only set for\nspecific drugs when the consensus was that these would\nbe useful. Drug-allergy and drug-laboratory tests (eg:\nrenal function; INR) checks were not activated.\nImplementation began in late 1996 and by 2002, elec-\ntronic prescribing and administration of medications was\nthe norm on all NHS wards, with paper charts reserved\nfor drugs with highly variable regimens (eg: insulin).\nOur data collection began approximately two years\nafter eP rollout was complete. Initial contact with the\nhospital was made through the head of pharmacy ser-\nvices who then provided information about the study to\npotential participants. Verbal informed consent was\nobtained and documented for all interviewees; patients\nwere also given an information leaflet. The LREC did not\nrequire patient consent for the retrospective record\nreview.\nRecord review data\nPatients were sampled from three wards (general medi-\ncine; general surgery; paediatrics) which had different\nversions of the Meditech software introduced at different\ntimes between 1999 and 2002. For each ward, data were\ncollected for 25 randomly selected patients admitted in\nthe calendar month six months before implementation of\neP and for 25 patients admitted in the calendar month six\nmonths afterwards. Only post-eP data will be presented\nin this paper. Patients were identified from the HIS and\nall electronic and paper records retrieved.\nOne research pharmacist carried out a structured\nreview of all medication orders and laboratory tests for\neach patient throughout his or her stay on the ward. The\ntotal number of medication orders written was also\nrecorded. An electronic retrospective review form (RRF)\nadapted from that used in the first UK study of iatrogenic\ninjury [17] was used to capture data for each patient\nreviewed, and to classify errors according to published\ncriteria [18]. A short text description providing informa-\ntion on the drug, dose and clinical situation was recorded\nfor each error identified.\nInterview data\nPharmacy staff and the majority of senior clinicians were\nidentified and approached by a senior hospital manager.\nOther clinical and ward staff were recruited by senior\npharmacists responsible for the relevant wards or identi-\nfied by the research team during interviews and depart-\nment visits. A staff announcement was also put out on\nthe HIS.\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 3 of 8Twenty-six staff (8 doctors, 6 nurses, 8 pharmacists\/\ntechnicians and 4 others) at senior, middle and junior\ngrades, and 19 adult in-patients were interviewed. All\nstaff participants used the HIS as part of their work. The\nmajority of interviews were tape-recorded. If recording\nwas not feasible (because of the setting), written notes\nwere made.\nThe interview topic guide [15] was developed from ini-\ntial interviews with four members of the implementation\nteam and three users (prescribers). There were no direct\nquestions about medication errors. All staff interviews\nexplored stakeholder views of key benefits and problems,\nand influences on working practices. Questions were tai-\nlored to the respondent's professional group.\nAdult patients were recruited from all general surgery\nand acute medicine wards in the hospital, including the\ntwo wards used in the record review. Recruiting children\nwas not attempted. Nineteen men and women aged 26 to\nover 70 took part. Sampling was purposive, based on use\nof \"as required\" medication and previous admission his-\ntory. Using Meditech, a senior pharmacist generated a\npaper listing of eligible patients for each ward. The\nresearchers then checked with the ward sister to deter-\nmine if patients were available, and well enough to be\napproached. Interviews were shorter than for staff and\nfocused on the system for prescribing and administering\nmedicines on the ward [15]. We asked specific questions\nabout missed or refused doses, access to medicines out-\nside normal drug round times, and discharge medication.\nData analysis\nThe text descriptions of errors found in the retrospective\nrecord review were entered into the database by the\nresearch pharmacist and reviewed by BDF.\nInterview data were collected and analysed by TC, EK,\nIS and SC. Transcripts and notes were read indepen-\ndently, then emerging themes discussed and agreed.\nInterview transcripts were then searched systematically\nfor accounts of medication incidents, both actual and\nhypothetical. A classification scheme based on the stage\nof the medicine use process was developed through itera-\ntive review of individual reports [19] and then applied to\nthe text descriptions of errors identified in the records\nreview.\nThe manpower required to collect data for each\napproach was estimated from staff diaries at the end of\nthe study.\nResults\nThe record review database included 85 individual\ndescriptions of prescribing and administration errors,\nThree of these (one drug-drug interaction and two fail-\nures to adjust dose in renal impairment) resulted in harm\n[15].\nSeventeen of the 26 staff interviews contained 69\naccounts of possible medication errors. One of these\naccounts concerned fluid overload with intravenous ther-\napy and had serious consequences. Three of the 19\npatient interviews also contained error accounts. Nine\nstaff did not describe possible medication errors. Four of\nthem had no direct involvement with medication, three\nwere nurses, and two were senior members of the original\nimplementation team.\nFigure 1 shows the classification scheme developed\nfrom the staff interviews. Table 1 presents the types of\nerror described by different respondent groups. Table 2\ncompares the types of error identified using interviews\nand with record review.\nDetails of specific errors identified are set out below,\nordered under the headings used in Figure 1. This scheme\nfollows the drug use process from the decision to pre-\nscribe through to administering, recording and monitor-\ning the effects of medication, and reflects the way that\nsubjects \"talked through the screens\" as they explained\nhow they used the eP system.\neP interface errors\nAt QHB, the vast majority of clinical information was\navailable electronically through the HIS. Outside the hos-\npital, the situation was different. Patients admitted to and\ndischarged from wards using eP therefore moved across\nan interface between a mostly paper-free and mostly\npaper-based world. As they moved, errors could occur.\nOne staff interview described a case where medicines\nhad been omitted from a patient's prescription on admis-\nsion. The patient had been in hospital for two months\nbefore she told the pharmacist that she normally used\neye-drops at home. A patient recounted a similar inci-\ndent. In another interview, a junior doctor spoke of a dia-\nbetic patient who had been discharged to a care home\nwith no insulin because the prescriber had not put a note\non the eP system to prescribe this on discharge. Record\nreview found three cases where medication (salbutamol,\namitriptyline, insulin) had not been continued as\nexpected when the patient moved between health care\nsectors. This could happen because medication required\nfor discharge had to be flagged on the system by the pre-\nscriber, then \"converted\" from inpatient orders in the\npharmacy before dispensing.\nErrors at the prescribing stage\nClinical need\nRecord review provided a wide range of examples where\nthe need for treatment, review or investigation had not\nbeen met. Cases included antibiotic therapy for methicil-\nlin-resistant Staphylococcus aureus not being prescribed;\nlack of potassium supplementation in a hypokalaemic\nasthmatic; not reviewing fluoxetine treatment when\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 4 of 8\nFigure 1 Error classification scheme developed from staff interviews.\n \nPatient \nenters \n“paperless” \nworld\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPatient \nleaves \n“paperless” \nworld\nStage at which an error can occur\neP interface: Patient admitted from primary care; \nfrom another hospital; from theatre\/ICU\nPatient’s current medicines entered into the eP \nsystem\nPrescribing the medicine (doctors)\nPrescriber assesses clinical need for medication\nSelects patient record from eP menu\nDecides which drug(s) to prescribe \nPicks drug name, strength and formulation (eg: tablet, \nliquid, injection....) from menu\nEnters dose to be given (as strength, eg: 500mg or as \nnumber of units, eg: “2 tablets”)\nEnters frequency (eg: give now; give if needed; give \nregularly three times a day)\nMay also give instructions for length of treatment; \nquantity to supply \nSupplying the medicine (pharmacy staff)\nDispensing of ward stock items and  individual patient \nmedication \nAdministering the medicine (nurses)\nNurse selects patient record\nAdministers and records regular drugs due at that time\nAdministers  and records “when required” medicines\nAdministers and records  “once only” drugs\nMonitoring the effects (doctors, nurses, \npharmacists)\nMake and record clinical observations\nOrder and assess laboratory tests\nObserve and record drug-related problems\nOrder and assess drug plasma levels\neP interface: Patient is discharged home; to \nanother hospital; or moves to theatre or ICU \nPrescriber assesses clinical need for medication\nPrescribes medicines (as above) “to take home”\nCurrent medication reported for paper-based \nprescribing\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 5 of 8hyponatraemia was reported; and untreated hyperlipi-\ndaemia. Interviews provided only two examples: neglect-\ning to prescribe antibiotics for a patient with heart valve\ndisease and an account from a patient who reported not\nbeing able to get the hospital doctors to prescribe her\nusual migraine medication.\nPatient selection\nA pharmacy interview described a case where medicines\nhad been prescribed for the wrong patient because of a\nscrolling error on the patient selection screen. Junior doc-\ntors also described near-misses, and said that this error\ncould happen \"because you are not going to the bedside\".\nNo cases of prescribing to the wrong patient were\ndetected in the record review\nDrug choice\nBoth methods identified knowledge-based errors. In\nrecord reviews these included potentially clinically signif-\nicant drug interactions involving aminophylline and phe-\nnytoin; use of digoxin and acitretin in renal impairment;\nand prescribing a penicillin to a patient recorded as possi-\nbly allergic. Interviews with doctors mentioned lack of\npenicillin allergy warnings, and also prescribing a non-\nsteroidal analgesic drug which was \"hidden\" in a post-\noperative \"order set\" to an asthmatic patient. However\nthere were no accounts of drug-drug interactions.\nMenu picking\nThe eP prescribing (order entry) screen had \"look-up\"\nfunctions for drug names, doses and routes, and links to\ndrug monographs and local guidelines and policies. In\nTable 1: Number of accounts of different types of medication errors described in staff and patient interviews.\nData source eP interface Prescribing Supply Administration Monitoring\nDoctors (7) 1 19 0 8 5\nNurses (3) 0 3 0 7 1\nPharmacy staff \n(7)\n4 15 1 4 1\nPatients (3) 1 1 0 1 0\nTOTAL 6 38 1 20 7\nTable 2: Medication errors identified using interviews and record review.\nType of medication error Was error identified using this method?\nRecord review Interview\neP interface yes yes\nPrescribing\nClinical need yes yes\nPatient record selection no yes\nDrug choice yes yes\nMenu picking no yes\nDose, form and dosing frequency yes yes\nDrug\/dose duplication yes yes\nSupplying yes yes\nAdministering\nDose omission (regular medication) yes yes\nDose omission (once only or if required) no yes\nRecording of administered dose yes yes\nMonitoring yes yes\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 6 of 8record review it was not possible to say whether picking\nthe wrong drug or strength was purely a scrolling error, or\nif the prescriber did not know what the correct choice\nshould be. However, pharmacy staff describing cases\nwhere doctors had ordered the next drug on the lookup\nmenu considered it very unlikely that this would have\nhappened if the prescription had been hand-written as\nthe drugs (methotrexate instead of methotrimeprazine;\nethamsylate instead of ethambutol) were so very differ-\nent.\nDrug\/dose duplication\nBoth methods identified unintentional drug duplication\n(eg: prescribing paracetamol, and a paracetamol-contain-\ning combination product) and dose duplication, where a\ndrug (eg: an analgesic or anti-emetic) was prescribed\norally and by other routes to allow nurses flexibility\ndepending on the patient condition but the maximum\ndaily dose for the drug was not specified.\nDose, form and frequency\nWrong doses, product strengths and dosing frequencies\nwere identified in both interviews and notes review.\nHowever interviews primarily cited warfarin and special-\nist paediatric drugs while errors identified in reviews\ninvolved different paediatric and anticoagulant drugs,\nplus anti-epileptics. Dose frequency errors often involved\nthe lack of a daily limit on \"as required\" analgesics and\nanti-emetics, reflecting the inflexibility of eP for this type\nof drug order. Interviews generated two examples of pos-\nsible dosing frequency errors: a once-weekly drug pre-\nscribed once a day, and drugs for Parkinson's disease.\nFormulation selection errors mainly involved enteric\ncoated products.\nSupply and administration errors\nNew orders for drugs not carried as ward stock were\npicked up by the pharmacy system. Review of administra-\ntion records identified several regular drugs (including\nantibiotics and anti-epileptics) which had not been given\nbecause no supply was available on the ward. One phar-\nmacy technician described how an incorrect strength of\nan unidentified drug had been issued as \"ward stock\". The\nerror had been detected by a nurse during a drug round.\nThere were no accounts of scrolling errors when nurses\nselected patient names from the screen during drug\nrounds.\nDose omission\nThe patient drug administration screen listed all regular\nmedication before as required and once-only orders. In\ninterviews, junior doctors and nurses mentioned that\nurgent once-only orders (eg intravenous furosemide) and\nsome as-required medicines were not given because they\n\"fell off the screen\" ie could not be seen without \"paging\ndown\". One patient complained that her once-only dose\nof an IV antibiotic was several hours overdue. Record\nreview did not identify any errors of this type. We also\nfound some patients who didn't know that they had been\nprescribed as-required drugs that they could have asked\nfor if needed. Retrospective record review could not iden-\ntify errors with this type of drug order as it was impossi-\nble to know if need had in fact existed.\nScheduling of doses was done at the point of prescrib-\ning. Regular medicines were allocated times correspond-\ning to ward drug rounds, with a 2-hour window to allow\nfor variation. Junior doctors and nurses described how\ndefault timings in the eP dose scheduling system could\ndelay the start of a new regular medication. Pharmacists\nand doctors also described difficulties with flexibly dosed\ndrugs such as warfarin and insulin, which required paper\nrecords.\nRecording and monitoring errors\neP recording\nThe risk of dose duplication when eP records were not\navailable was identified in both interviews and record\nreview. Nurse and doctor interviews described being\nunsure, when the system was down, if a patient asking for\nanalgesia had recently received a dose. There was also a\nreport that analgesic doses given in theatre (which did\nnot use eP) might be repeated on the ward. Record review\nfound cases where analgesics and propranolol had been\nprescribed as regular drugs, but no administration\nrecords had been made so it was not clear whether or not\nthey had been given.\nTwo interviews described cases where medication (top-\nicals and IV fluids) had been given but had not been pre-\nscribed on the system and so an eP administration record\ncould not be made. Record review identified several cases\nwhere oxygen had been given but not prescribed.\nMonitoring\nRecord review identified errors involving lack of renal\nfunction monitoring for patients prescribed digoxin, and\nlack of aminophylline and phenytoin plasma level mea-\nsurement for patients co-prescribed clarithromycin.\nInterviews generated possible incidents where warfarin\nand gentamicin doses had not been adjusted on the basis\nof test results (eg with warfarin, gentamicin, sliding scale\ninsulin), or where physiological monitoring had not been\ndone (intravenous fluids)\nResearch resources comparison\nFrom initial scoping visit to final interview, collecting\ndata for this study took 14 months. Record review: On\naverage, only four patients could be reviewed each day.\nDespite most records being electronic, retrieving patient\ninformation was not particularly quick as there were\nproblems accessing the optical disk archive at busy times.\nReviewing 75 patients took approximately 20 researcher-\ndays.\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 7 of 8Interviews\nThe 26 staff interviews took approximately 11 researcher-\ndays, with the majority (19) conducted by three research-\ners over three consecutive days. Patients were recruited\nand interviewed by two researchers over a second three-\nday period.\nBoth record review and interview datasets required fur-\nther work after collection. Unfortunately diary informa-\ntion was not available for all researchers involved so we\nwere unable to make a comparison.\nDiscussion\nOur classification of the prescribing process is an over-\nsimplification, developed from the way the staff partici-\npants described how they worked. The actual prescribing\nprocess is probably much less linear as each step may\nneed to draw on knowledge of previous events (medi-\ncines, diagnoses, tests, observations) recorded in patients'\ncharts and notes. The interview sample size was method-\nologically adequate [19] but the relatively small number\nof records reviewed was a pragmatic choice, based on\nprevious experience [15]. By its nature, record review is\nmore likely to identify errors of omission than an inter-\nview.\nDespite these limitations, record review and interviews\nproduced similar pictures of medication errors, although\ninterviewees often described hypothetical incidents with-\nout mentioning the specific drugs involved. The three\ndrugs they mentioned most often were warfarin, insulin\nand intravenous fluids. This is probably because these\nvariable dose medicines were less straightforward to pre-\nscribe, with or without eP.\nIn interviews, the types of incident described reflected\nthe respondent's role. Junior doctors (who do most of the\nprescribing) and pharmacy staff (who supply the drugs\nand review most of the orders) described the widest\nrange of incidents. Nurses focused on drug administra-\ntion and were generally cautious in their responses. All\nthree professional groups had been involved in system\ndevelopment, but nurses were clearly the most concerned\nabout personal accountability [20,21]. Some patients were\nalso concerned about sounding negative, despite assur-\nances that what they told the interviewer would not affect\ntheir future care.\nThe majority of incidents described by staff were close\nanalogies of those that also happen with paper charts. In\ninterviews the inability to \"see the whole picture\" on the\nscreen appeared to be mainly a problem for those rela-\ntively new to the system, but much less of a problem than\nin the recent USA study [8].\nThe general view is that eP will reduce errors but new\ntechnology can also introduce new types of error\n[8,13,22]. Two of the three serious post-eP errors\ndescribed by Shulman et al [22] were \"menu picking\"\nerrors. Our retrospective review did not detect these eP-\nspecific errors but, significantly, our interview data did. It\nalso provided rich detail on the technical work [23] of\nprescribing and administering drugs on the wards.\nRobust evaluations are vital tools for persuading users\nto adopt new technologies, but prospective before-after\ndata collection can take 18 months. This time may not be\navailable, particularly if the evaluation is commissioned\naround the time of implementation. This can weaken the\nimpact of the findings. The evaluation report [24] of the\nthree pilot sites for the proposed NHS Electronic Health\nRecord (EHR) noted that the study was \"seriously ham-\npered\" by the failure to build in evaluation before the\nEHR project started.\nThe retrospective record review reported here was\nquicker than the prospective evaluation we did at a differ-\nent site [12] but record data collection took more\nresearcher-days than interview data. Interviews tailored\nto address policy-makers' questions could therefore offer\ngood research value particularly if the study site is remote\nfrom the research contractors' usual workplace.\nEvaluation increases our understanding of the influence\nof technologies on working practices and patient out-\ncomes, including occurrences of medication errors, but\nqualitative data on staff perception of errors has been\nclaimed to provide weaker evidence than counts of actual\nerrors [25]. Counts provide error frequencies which are\ngood for efficacy testing but we suggest that counting is\nnot the only way. We need to explore how people change\nand are changed by systems [7] and use beliefs about\nerrors [8] to maintain and develop safe and effective\nhealthcare working practices.\nFor example, pharmacists using eP may believe that\nready access to a wide variety of computerised results\nimproves their ability to trap prescribing errors, but it\nmay also reduce face-to-face contact with staff and\npatients because they no longer need to visit the wards to\nget the clinical information they need for effective pre-\nscription review. This change in practice could have a sig-\nnificant effect on inter-professional communication; it\nmight also change the pattern of errors that pharmacists\nmiss.\nConclusions\nMedication error is a sensitive subject, and people may\nhave concerns about reporting actual errors. In our staff\ninterviews, talking about the perceived benefits and\ndrawbacks of their hospital eP system generated many\naccounts of specific errors which \"could\" or \"might\" hap-\npen, as well as descriptions of near misses which had\nbeen made by other people.\nImportantly, these interviews identified the same types\nof medication errors as did the more resource-intensive\nrecord review method. This method therefore offers not\nSavage et al. BMC Health Services Research 2010, 10:135\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\nPage 8 of 8only an evaluation tool but also another way of auditing\ncurrent medication safety problems, which could be used\nto supplement information from anonymous reporting\nschemes.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthors' contributions\nThe work reported in this paper formed part of a larger evaluation, conceived,\ndesigned and co-ordinated by NB. IS co-ordinated the qualitative data collec-\ntion, designed the qualitative\/quantitative data comparison, and drafted the\nmanuscript. Interview data were collected and analysed by TC EK IS and SC.\nBDF designed, co-ordinated and validated the quantitative data collection. All\nauthors read and approved the final manuscript.\nAcknowledgements\nThanks to our research pharmacist Mansi Shah for carrying out the retrospec-\ntive records reviews and to everyone who took part in, or helped us with, this \nstudy. We are especially grateful to Chris Curtis and Nick Ford at QHB, who \nmade this project both possible and a pleasure. The Centre for Medication \nSafety and Service Quality is affiliated with the Centre for Patient Safety and \nService Quality at Imperial College Healthcare NHS Trust which is funded by \nthe National Institute of Health Research.\nThis research was funded by the UK Department of Health's Patient Safety \nResearch Programme. The funding organisation played no part in the design \nand conduct of the study; collection, management, analysis, and interpretation \nof the data; or preparation, review, and approval of the manuscript.\nAuthor Details\n1Department of Practice and Policy, the School of Pharmacy University of \nLondon, London, UK, 2Department of Information Systems, London School of \nEconomics and Political Science, London, UK and 3Centre for Medication \nSafety and Service Quality, Imperial College Healthcare NHS Trust, London, UK\nReferences\n1. National Audit Office: A safer place for patients: Learning to improve patient \nsafety. London 2005.\n2. Commission for Healthcare Audit and Inspection: The Best Medicine. \nManaging medicines in acute and specialist trusts. London 2007.\n3. National Audit Office: The National Programme for IT in the NHS: progress \nsince 2006. London 2008.\n4. Kohn LT, Corrigan JM, Donaldson MS: To Err is Human: Building a safer \nhealth system Washington DC: National Academy Press; 2000. \n5. Summers V: Electronic prescribing-the way forward.  Pharm J 2000, \n265:834.\n6. Brennan S, Spours A: Electronic prescribing and medicines \nadministration: are we overcoming the barriers to success?  Br J \nHealthcare Comput Info Manage 2003, 20(4):19-22.\n7. Lium J-T, Tjora A, Faxvaag A: No paper but the same routines: a \nqualitative exploration of experiences in two Norwegian hospitals \ndeprived of the paper-based medical record.  BMC Medical Informatics \nand Decision Making 2008, 8:2.\n8. Koppel R, Metlay JP, Cohen A, Abaluck B, Localio AR, Kimmel SE, Strom BL: \nRole of computerised physician order entry systems in facilitating \nmedication errors.  JAMA 2005, 293:1197-203.\n9. Swanson D: Electronic prescribing- \"I want it and I want it now!\".  \nHospital Pharmacist 2007, 14:210.\n10. Franklin BD, Vincent C, Schachter M, Barber N: The incidence of \nprescribing errors in hospital inpatients - an overview of the research \nmethods.  Drug Saf 2005, 28:891-900.\n11. Michel P, Quenon JL, de Sarasqueta AM, Scemama O: Comparison of \nthree methods for estimating rates of adverse events and rates of \npreventable adverse events in acute care hospitals.  BMJ 2004, \n328:199-203.\n12. Franklin BD, O'Grady K, Donyai P, Jacklin A, Barber N: The impact of a \nclosed-loop electronic prescribing and administration system on \nprescribing errors, administration errors and staff time: a before and \nafter study.  Qual Saf Health Care 2007, 16:279-284.\n13. Donyai P, O'Grady K, Jacklin A, Barber N, Franklin BD: The effects of \nelectronic prescribing on the quality of prescribing.  Br J Clin Pharmacol \n2007, 65:230-7.\n14. Franklin BD, O'Grady K, Donyai P, Jacklin A, Barber N: The impact of a \nclosed loop electronic prescribing and automated dispensing system \non the ward pharmacist's time and activities.  Int J Pharm Pract 2007, \n15:133-9.\n15. Barber N, Franklin BD, Cornford T, Klecun E, Savage I: Safer, faster, better? \nEvaluating electronic prescribing.  2006 [http:\/\/\nwww.pcpoh.bham.ac.uk\/publichealth\/psrp\/documents\/\nPS019_Final_Report_Barber.pdf].\n16. Barber N, Cornford T, Klecun E: Qualitative evaluation of an electronic \nprescribing and administration system.  Qual Saf Health Care 2007, \n16:271-278.\n17. Woloshynowych M, Neale G, Vincent C: Case record review of adverse \nevents: a new approach.  Qual Saf Health Care 2003, 12:411-5.\n18. Dean BS, Barber ND, Schachter M: What is a prescribing error?  Qual \nHealth Care 2000, 9(4):232-7.\n19. Ritchie J, Spencer L: Qualitative data analysis for applied policy \nresearch.  In Analysing qualitative data Volume 1993. Edited by: Bryman A, \nBurgess R. London: Routledge :173-94. \n20. Hand K, Barber N: Nurses attitudes and beliefs about medication errors \nin a UK hospital.  Int J Pharm Pract 2000, 8:128-34.\n21. Sanghera IS, Franklin BD, Dhillon S: The attitudes and beliefs of \nhealthcare professionals on the causes and reporting of medication \nerrors in a UK ICU.  Anaesthesia 2007, 62:53-61.\n22. Shulman R, Singler M, Goldstone J, Bellingan G: Medication errors: a \nprospective cohort study of hand-written and computerised physician \norder entry in the intensive care unit.  Clinical Care 2005, 9:R516-21.\n23. Nemeth C, Cook R: Hiding in plain sight: What Koppel et al tell us about \nhealthcare IT.  J Biomed Informatics 2005, 38:262-3.\n24. The Bayswater Institute: Research evaluation of the early NHS electronic \nrecord pilot sites. London 2001.\n25. Bates DW: Computerised physician order entry and medication errors: \nFinding a balance.  J Biomed Informatics 2005, 38:259-61.\nPre-publication history\nThe pre-publication history for this paper can be accessed here:\nhttp:\/\/www.biomedcentral.com\/1472-6963\/10\/135\/prepub\ndoi: 10.1186\/1472-6963-10-135\nCite this article as: Savage et al., Medication errors with electronic prescrib-\ning (eP): Two views of the same picture BMC Health Services Research 2010, \n10:135\nReceived: 27 January 2010 Accepted: 24 May 2010 \nPublished: 24 May 2010\nThis article is available from: http:\/\/www.biomedcentral.com\/1472-6963\/10\/135© 2010 Savage et l; icensee BioMed Central Lt . is an Open Access articl  distributed under th  terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.BMC Hea th S r ices R s ar h 2010, 10:135\n"}