{"doi":"10.1063\/1.363927","coreId":"102840","oai":"oai:epubs.surrey.ac.uk:2389","identifiers":["oai:epubs.surrey.ac.uk:2389","10.1063\/1.363927"],"title":"Nitrogen modification of hydrogenated amorphous carbon films","authors":["Silva, SRP","Robertson, J","Amaratunga, GAJ","Rafferty, B","Brown, LM","Schwan, J","Franceschini, DF","Mariotto, G"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1997-03-15","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2389<\/identifier><datestamp>\n      2017-10-31T14:05:24Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2389\/<\/dc:relation><dc:title>\n        Nitrogen modification of hydrogenated amorphous carbon films<\/dc:title><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        Robertson, J<\/dc:creator><dc:creator>\n        Amaratunga, GAJ<\/dc:creator><dc:creator>\n        Rafferty, B<\/dc:creator><dc:creator>\n        Brown, LM<\/dc:creator><dc:creator>\n        Schwan, J<\/dc:creator><dc:creator>\n        Franceschini, DF<\/dc:creator><dc:creator>\n        Mariotto, G<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        1997-03-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2389\/1\/nitrogen_modification_SILVA_97.pdf<\/dc:identifier><dc:identifier>\n          Silva, SRP, Robertson, J, Amaratunga, GAJ, Rafferty, B, Brown, LM, Schwan, J, Franceschini, DF and Mariotto, G  (1997) Nitrogen modification of hydrogenated amorphous carbon films   JOURNAL OF APPLIED PHYSICS, 81 (6).  pp. 2626-2634.      <\/dc:identifier><dc:relation>\n        http:\/\/jap.aip.org\/resource\/1\/japiau\/v81\/i6\/p2626_s1<\/dc:relation><dc:relation>\n        10.1063\/1.363927<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2389\/","http:\/\/jap.aip.org\/resource\/1\/japiau\/v81\/i6\/p2626_s1","10.1063\/1.363927"],"year":1997,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"DownloadNitrogen modification of hydrogenated amorphous carbon films\nS. R. P. Silvaa)\nDepartment of Electronic and Electrical Engineering, University of Surrey, Guildford, Surrey GU2 5XH,\nUnited Kingdom\nJ. Robertson\nCambridge University, Engineering Department, Trumpington Street, Cambridge CB2 1PZ,\nUnited Kingdom\nG. A. J. Amaratunga\nDepartment of Electrical Engineering, University of Liverpool, Brownlow Hill, Liverpool L69 3BX,\nUnited Kingdom\nB. Rafferty and L. M. Brown\nPhysics Department, Cambridge University, Madingley Road, Cambridge CB3 0HE, United Kingdom\nJ. Schwan\nUniversity of Kaiserslautern, Department of Physics, Kaiserslautern 67663, Germany\nD. F. Franceschini\nDepartamento de Fisica, Pontificia Universidade Catolica do Rio de Janeiro, Cx 38071, 22452-970,\nRio de Janeiro, Brazil\nG. Mariotto\nUniversita degli Studi di Trento, Department of Physics, 1-38050 Povo, Trento, Italy\n~Received 26 July 1996; accepted for publication 20 November 1996!\nThe effect of nitrogen addition on the structural and electronic properties of hydrogenated\namorphous carbon ~a-C:H! films has been characterized in terms of its composition, sp3 bonding\nfraction, infrared and Raman spectra, optical band gap, conductivity, and paramagnetic defect. The\nvariation of conductivity with nitrogen content suggests that N acts as a weak donor, with the\nconductivity first decreasing and then increasing as the Fermi level moves up in the band gap.\nCompensated behavior is found at about 7 at. % N, for the deposition conditions used here, where\na number of properties show extreme behavior. The paramagnetic defect density and the Urbach\ntailwidth are each found to decrease with increasing N content. It is unusual to find alloy additions\ndecreasing disorder in this manner. © 1997 American Institute of Physics.\n@S0021-8979~97!02605-4#I. INTRODUCTION\nRecent studies of nitrogen additions to amorphous car-\nbon ~a-C! have been motivated by two factors; the synthesis\nof the possible superhard compound C3N4,1 and the elec-\ntronic doping of a-C. We are interested here in the semicon-\nducting forms of a-C and hydrogenated a-C ~a-C:H! which\ncan be doped electronically using nitrogen. Meyerson and\nSmith2 observed that a-C:H could be doped n- and p-type by\nphosphorus and boron, respectively, in a similar fashion to\na-Si:H. They concluded that there was true substitutional\ndoping by observing the thermopower sign reversal expected\nas the conductivity changed from n- type to p-type.3 How-\never, the doping effect was weaker than in a-Si:H. Indeed,\nJones and Stewart4 found still lower doping efficiencies and\nthey questioned whether true doping was occurring. Interest-\ningly, they observed that nitrogen was able to increase the\nconductivity of a-C:H, and this has since been repeated by\nnumerous other groups.4–10 However, it has been unclear\nwhether N increased the conductivity by doping—raising the\nFermi level towards the conduction band, or by graphitiza-\ntion of the bonding—narrowing the band gap.7\na!Electronic mail: s.silva@ee.surrey.ac.uk2626 J. Appl. Phys. 81 (6), 15 March 1997 0021-8979\/97\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPRecently, a highly sp3 bonded form of a-C denoted tet-\nrahedral amorphous carbon ~ta-C! has been deposited by fil-\ntered cathodic vacuum arc ~FCVA!.11 Ta-C is a semiconduc-\ntor with a 2.5 eV wide band gap. Undoped ta-C is\nmoderately p-type.12 Ta-C can be doped in a rather uncon-\ntrollable fashion by P.13 It can be doped more controllably by\nN,14,15 and N was found to first decrease the conductivity,\nthen increase it, as EF moves upwards in the band gap, from\nnear the valence band, through midgap, to close to the con-\nduction band edge EC . The optical gap and the fraction of\nsp3 bonding were both found to remain constant during these\nN additions, and they only decreased at higher N contents. It\nwas clear that N acted as a substitutional donor in ta-C, al-\nthough with low doping efficiency.\nSubsequently, a hydrogenated analogue of ta-C, ta-C:H,\nwas prepared by deposition from a low pressure plasma\nbeam source.16 Ta-C:H has an optical gap of 2.7 eV, but\nagain the conductivity activation energy for undoped ta-C:H\nis much less than half the optical gap, suggesting that EF lies\nwell away from midgap. N additions to ta-C:H are also found\nto give a strong increase in the conductivity, while the opti-\ncal gap remains unchanged.17 In this case, it was not possible\nto observe the initial decrease in conductivity as EF passed\nthrough midgap. These latter results, therefore, suggest that\/81(6)\/2626\/9\/$10.00 © 1997 American Institute of Physics\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadN does act as a substitutional donor in ta-C and ta-C:H, but\nits role in a-C:H is less clear.\nIn fact, ta-C:H differs from conventional a-C:H in two\nways. It has a higher sp3 content, and a lower H content.16 It\nhas recently been observed that a-C:H with a much lower H\ncontent could be prepared by plasma deposition from a con-\nventional higher pressure plasma by employing magnetic\nconfinement to increase the plasma ionization.18–20 This\nform of a-C:H is found to have a lower H content than ta-\nC:H, but only a moderate sp3 content. It is therefore of in-\nterest to study the ability to dope it with nitrogen.\nA further motivation for this work is the possible use of\ndiamond and diamondlike carbon as thin film cold cathodes\nin field emission displays,21 because of their low electron\naffinities. Field emission from diamond films frequently in-\ncreases as the crystal quality of the diamond decreases,22\npresumably because of the need for a conduction path along\nthe grain boundaries. There is clearly a need for an n- type\ndopant for diamond, but N is deep ~1.4 eV! while other\ngroup V elements are insoluble. In contrast, N can in prin-\nciple form shallow levels in a-C~:H! because of its smaller\nband gap. This causes the field emission from the a-C:H\nfilms studied in this article to increase by over one hundred\nby the addition of nitrogen.23\nThe analysis of the effect of N in a-C:H is complicated\nby the ability of N to adopt a variety of different bonding\nconfigurations,24,25 such as those shown in Fig. 1. In Fig. 1,\nvalence electrons are either paired in bonds ~shown as a\nline!, unpaired ~a dot!, or paired in a nonbonding ‘‘lone\npair’’ state ~shown as two dots!. Nitrogen has five valence\nelectrons. In its simplest trivalent configuration ~a!, N forms\nthree s bonds with the remaining two electrons in a lone\npair. This is nondoping and is the stable configuration of N\nto be found in Si3N4. N at a fourfold coordinated ‘‘substitu-\ntional’’ site ~b! uses four electrons in s bonds and the fifth is\nFIG. 1. Possible configurations of nitrogen in a-C:H:N. The lines represent\nbonds, dots are unpaired electrons, and dot pairs are lone pairs.J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPunpaired and available for doping. A variant of this ~c!,\nforms a trivalent C site and transfers the unpaired electron to\nthe C, to give a positive N1 \/ C2 defect pair. This group has\nall electrons paired, like the analogous group in a-Si:H.26\nThere are other configurations, because N can also form p\nbonds. N can substitute for C in a benzene ring @~d!\/~e!#.\nNitrogen can have just two neighbors within the ring, using\nthree bonding electrons ~2 s and one p), leaving two elec-\ntrons as a lone pair, Fig. 1~d!. This pyrridine configuration is\nnondoping. Alternatively ~e!, three can form s bonds, a\nfourth forms a p bond ~as in benzene!, and the fifth is un-\npaired and enters an antibonding p* state. This electron is\navailable for ‘‘p’’ doping. Another alternative ~f! is for the\nN to have to bond to three neighbors, as in ~e!, but in a\nfive-fold ring,24 so it uses three electrons in bonds and two as\na lone pair. This ‘‘pyrrole’’ configuration is also nondoping.\nThere are also olefinic variants of p bonding. A double\nbonded unit ~g! uses two electrons in s bonds, one in a p\nbond, leaving a lone pair. This is nondoping. A double\nbonded unit ~h! uses three electrons in s bonds, one in a p\nbond, and the fifth in a nonbonding p* state, available for\ndoping. The last configuration is a ‘‘chain terminating’’ cy-\nano ~or nitrile! grouping ~i!, in which N forms a triple bond\nand a lone pair. This in nondoping. It is relatively stable,\nbeing related to that found in the N2 molecule itself. This\nvariety of configurations available for N, most of which are\nnondoping, indicates why N is likely to be a weak dopant\nand why the behavior of N in a-C~:H! needs careful analysis.\nII. EXPERIMENT\nThe nitrogenated a-C:H ~a-C:H:N! films were deposited\nin a magnetically confined rf plasma enhanced chemical va-\npor deposition ~PECVD! system.19 The substrate was placed\non the rf powered electrode which acquires a negative dc\nself-bias voltage. This causes an ion bombardment of the\ngrowing film which is believed to be responsible for creating\nthe sp3 bonding. An encased permanent rare earth magnet\n~Nd-B-Fe! is used around the substrates to increase the\nplasma density. The deposition was carried out at a fixed\npressure of 0.1 Torr from a CH4, He, and N2 gas mixture,\nwith flow rates of 5 sccm for CH4, 45 sccm for He, and 0–20\nsccm for N2. The magnetic field and the He increases the\nionization of the methane plasma, giving a plasma electron\ntemperature of over 6 eV, which results in a higher deposi-\ntion rate and a lower bias voltage for a given rf power. The\nsubstrate temperature was maintained at 20 °C, although the\nsurface temperature was seen to vary from 30–100 °C de-\npending on the rf power. The a-C:H:N films were deposited\non $100% Si and quartz substrates.\nThe composition of the a-C:H:N films was determined\nby a combination of elastic recoil detection analysis\n~ERDA!, Rutherford backscattering ~RBS!, and nuclear reac-\ntion analysis ~NRA!. The N content was found using the\n14N(d ,p)15N nuclear reaction. Infrared ~ir! spectra were col-\nlected at room temperature on a Mattson FTIR spectrometer.\nRaman spectroscopy measurements were conducted in the\nback scattering mode using an Ar laser ~wavelength 488 nm!\noperating at a power of 300 mW. The scattered radiation was2627Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadanalyzed with a 1 m focal length double-pass monochro-\nmator ~Yobin-Yvon, Ramanor model HG2-S! equipped with\nholographic gratings ~2000 lines per mm!, and was detected\nby a cooled (235 °C) GaAs photomultiplier tube ~RCA,\nModel C31034A-02!, operated in photon counting mode.\nThe monochromator stokes Raman spectra were recorded be-\ntween 500 and 3000 cm21 and stored in a multichannel ana-\nlyzer. Optical absorption spectra were derived from transmis-\nsion and reflection measurements on a Philips uv-VIS\nspectrometer in the wavelength range 200–900 nm. The con-\nductivity was measured using metal-carbon-metal sandwich\nstructures using Au and Al electrodes evaporated onto the\nsamples at pressures better than 1026 Torr. Electron spin\nresonance ~ESR! studies were performed on a Bruker EPR\nmachine such that the signal did not saturate. The microwave\npower was varied between 200 mW and 2 mW using a mi-\ncrowave frequency of 9.3 GHz. The modulation amplitude\nwas 0.9 G using a modulation frequency of 100 KHz.\nTransmission electron microscopy ~TEM! samples\nwere prepared by dissolving the $100% Si substrate in a\nHF:HNO3 deionized water solution and releasing the\na-C:H:N samples. These films were then floated onto Cu\ngrids. Electron energy loss spectra ~EELS! were measured on\na VG501 scanning transmission electron microscope\n~STEM! operated at 100 KeV. The spectra were acquired on\na dedicated parallel EELS detector with a collection angle of\n10 mrad and an energy resolution of 0.6 eV. The specimen\nthickness was kept constant ~60–80 Å! with the EELS spec-\ntra collected over an area of approximately 100 nm diam.\nThe collected data was corrected for multiple scattering us-\ning the log ratio method.27 Low loss spectra were also mea-\nsured to derive the valence plasmon energy and the joint\ndensity of states. Typical collection times for the low loss\nregion was under 1 s and 30 s for the high energy region.\nThe low loss region was then analyzed in terms of dielectric\nmodel which allowed the extraction of the real and imagi-\nnary parts of the dielectric function. This allowed the extrac-\ntion of the optical conductivity or joint density of states\n~JDOS!.28\nIII. RESULTS\nA. Composition and growth\nThe variation of H and N content of the a-C:H films as a\nfunction of nitrogen gas flow ratio, R5@N2#\/@CH4# is shown\nin Fig. 2. The N content is seen to increase quite rapidly up\nto R51, and then increase more gradually. The data shows\nthat the incorporation ratio is much less than one, presum-\nably because N is less easily ionized than CH4. Although the\nionization potential of N2 is 11.1 eV, in order to get N1 ions\nan energy of 14.5 eV is required. To generate CH41 and\nCH3\n1 species from the CH4 molecule, ionization energies of\n12.6 and 14.3 eV are required. The H content of undoped\na-C:H is 21 at %. This value decreases gradually with N\nincorporation, up to a gas flow ratio of 1.0, and it then falls\nmore rapidly.\nThe growth rate depends strongly on N addition, and it\nappears to decrease in a roughly exponential fashion until an2628 J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPatomic N content of 3%, as seen in Fig. 3~a!. After this, the\ndecrease in growth rate is more gradual.\nCompressive stress is an intrinsic feature of films grown\nhere under conditions of ion bombardment. The compressive\nstress was derived using the method proposed by Argon\net al.29 based on the change in curvature of the substrate\nusing Stoney’s equation. The variation of the stress as a\nfunction of atomic N content is shown in Fig. 3~b!. The\nstress is seen to decrease with N content. The lower stress at\nhigher N contents is desirable, as it allows thicker, adherent\nfilms to be deposited. The maximum thickness increases\nfrom about 400 nm for a-C:H ~non-nitrogenated! to over\n1 mm for 15 at. % N content.\nB. Transmission electron microscopy and electron\nenergy loss spectroscopy\nThe TEM studies of the a-C:H:N films show them to be\ncompletely amorphous with no crystalline inclusions. Two\ndiffused rings centred at 2.1 and 1.1 Å are seen in diffraction\nmode which correspond to amorphous carbon.30 The struc-\nture of the film changes dramatically when the N content\nFIG. 2. Variation of nitrogen and hydrogen content of a-C:H:N films with\nN2 gas flow ratio.\nFIG. 3. ~a! Growth rate and ~b! compressive stress of a-C:H:N films vs N\ncontent.Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadexceeds a threshold of 14 at.%. At low N content, the films\nare extremely smooth, with peak-to-peak roughness of less\nthan 5 nm over atomic force microscopy ~AFM! scans of\n1 mm. For N contents over 14%, the surface becomes\nrougher, with amorphous nodulelike surface features with\naverage heights of 20 nm and diameters of 50 nm.\nThe nature of the C and N bonding was derived from\nEELS. The spectrum consists of absorption edges for each\nelement’s core level, and the absorption just above the edge\nis proportional to the local density of conduction states about\nthat atom. The carbon K edge consists of a step at 290 eV\ndue to transitions from the C 1s core level to s* states and a\npeak at 285 eV due to transitions to p* states of sp2 sites\n~and sp1 sites!. The N K edge spectrum appears around 400\neV and consists of a similar step and peak features,15 Fig. 4.\nThe C sp2 fraction can be deduced from the C K edge, as the\nratio of the area of the 285 eV peak to the 290 eV step,\nnormalized to its value in fully sp2 graphitic C. This same\nratio is then assumed to apply to that for sp2 N sites. The\nEELS spectrum could also be used to derive the N\/C com-\nposition.\nThe variation of sp2 fraction for C and N sites as a func-\ntion of N content is shown in Figs. 5~a! and 5~b!. The C\nsp3 fraction is seen to remain within the range 30–40% up to\na N content of 7 at.%, where the sp3 fraction reaches a maxi-\nmum of 45%, and then it decreases gradually to 20% sp3\ncontent at 14 at.% N. The latter fall corresponds to graphiti-\nzation which usually occurs at high N content. The sp2 frac-\ntion at N sites varies more dramatically. At low N content,\nthe N sp3 fraction is low. It then rises sharply to about 80%\nof N sites at 7% N, and it then decreases again to about 40%\nat higher N contents. This result is one of a number to indi-\ncate that 7% N is a critical composition.\nThe valence plasmon energy was also measured by\nEELS, and used to derive a value for the mass density. The\nplasmon is 22.860.3 eV across the range of N contents.\nC. Infrared spectroscopy\nThe local bonding of C, H, and N sites can be deduced\nfrom a representative infrared absorption spectrum as shown\nin Fig. 6. The spectra can be divided into four regions, the\nC–C, C–H and C–N modes from 0 to 1700 cm21, C[N\nstretching modes from 2065 to 2260 cm21, C–H stretching\nFIG. 4. Typical EELS spectrum for a-C:H:N with the assignment of promi-\nnent bands.J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPmodes from 2700 to 3100 cm21, and N–H stretching modes\nfrom 3150 to 3400 cm21, according to assignments in\nmolecules.31\nThe variation of the intensity of these modes as a func-\ntion of N content is shown in Fig. 7. The intensities of the\nC–H stretching modes are seen to decline rather rapidly with\nincreasing N content. These modes are assigned to vibrations\nof sp3 and sp2 sites. Notice that sp1 sites would introduce\nmodes around 3300 cm21.31,32 The finite value of modes\naround 3300 cm21 in N-free films indicates a contribution\nfrom H–C[C- groups as well as 5N–H groups. Infrared\npeaks observed at 2325 cm21 in cathodic arc deposited\na-C~:N! films by Merchant et al.33 has also been ascribed to\ntriple bonded carbon.\nFIG. 5. ~a! Carbon and ~b! nitrogen sp2 fraction of a-C:H:N films vs N\ncontent.\nFIG. 6. Typical infrared spectrum for a-C:H:N with the assignments of\nprominent bands in an a-C:H:N film with an atomic N content of 11%.2629Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadThe intensity of the N–H modes at 3140–3350 cm21 is\nseen to increase rapidly with N content. Similar modes as-\ncribed to N–H modes in the data of Kaufman et al.34 can be\nassociated with an increase in N–H bonds.\nThe modes below 1700 cm21 are particularly interest-\ning. The C–C stretching modes lie up to about 1350 cm21\nfor sp3 C, up to 1600 cm21 for aromatic sp2 C and up to\n1700 cm21 for olefinic sp2 C. The –NH2 (1650–1560\ncm21), . NH (1580–1490 cm21), –NH31 ~1600 and\n1500cm21), .C5N– (1690–1640 cm21), –N5N–\n(1575 cm21) groups also may make a contribution to these\nmodes, but is unlikely to be of significant magnitude espe-\ncially at low N contents. In a-C~:H! the C–C modes are not\nir active ~only Raman active!, because the C–C bond is not\npolar. However, in a-C:H:N, the introduction of polar C–N\nbonds may render these modes ir active.34 Moreover, as the\nmodes are delocalized, particularly around aromatic rings,\nthe N atoms tend to make all modes to an extent ir active.\nFor example, the N atom in the pyrridine ring, Fig. 1~d!, will\nmake all the modes of a distorted ring ir active. Figure 7\nshows that the intensity of the 1500–1785 cm21 modes,\nwhich is one of the dominant peaks in this region, first in-\ncreases and then decreases with increasing N content. The\nincrease corresponds to the increasing oscillator strength of\nmixed C–C–N modes of both aromatic and olefinic units.\nThe decrease presumably corresponds to a fall in the concen-\ntration of aromatic and olefinic groups due to an increase in\ncyano ~nitrile! groups at high N contents. The offset ob-\nserved in the data confirms the fact that the C–C stretching\nmodes dominate initially with any consequent changes aris-\ning from the C–C–N modes.\nModes at 2065–2260 cm21 correspond to the terminat-\ning cyano ~nitrile! group –C[N, Fig. 1~i!, the intensity of\nwhich is seen to rise rapidly with increasing N content in\nFig. 7. There are no corresponding modes of C atoms in this\nrange. Schwan et al10 also found a rapid increase in the\nC[N and C5N bonded modes in their plasma deposited\na-C:H~:N! films with increasing N content in the source\ngases.\nD. Raman spectroscopy\nRaman spectroscopy is a widely used technique to char-\nacterize amorphous and noncrystalline carbons. The Raman\nspectrum of a noncrystalline C in general consists of two\nFIG. 7. Variation of the ir band intensities vs N content.2630 J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPfeatures, a G peak at around 1550 cm21 due to optical zone\ncenter vibrations (E2g mode! in graphite of aromatic rings,\nand a D peak or shoulder around 1360 cm21, due to the\ndisorder activated optical zone edge modes of microcrystal-\nline graphitic sheets. The modes of sp3 bonding in a-C tend\nnot to show up in Raman, because of their low scattering\ncross-section. Tamor and Vassel35 have provided a useful\nempirical correlation of the position, width, and intensity ra-\ntio of the G and D peaks to the properties of a-C~:H!. The\nRaman spectra of our films were quantitatively analyzed us-\ning a computer code in order to reproduce the data as a sum\nof two Gaussians.36 The position, width, and intensity of\neach line were assumed as fitting parameters and the least\nsquare fit of the experimental data was attempted. Figure 8\nshows that the position of the G peak, vG , increases with N\ncontent. This generally corresponds to increasing graphitic\ncharacter in a-C:H.35,36 The width of the G peak GG de-\ncreases with increasing N content. GG is a measure of the\nnetwork disorder, as it is in a-Si, and its reduction is consis-\ntent with the fall in stress with N content seen in Fig. 3~b!.\nThe position of the G band shifts to higher frequency and its\nbandwidth decreases. These results show that N incorpora-\ntion in the a-C:H films favor the formation of sp2 units ac-\ncording to the Raman data. These microstructural modifica-\ntions ~and decrease in the average coordination number! may\naccount for the observed reduction in the internal stress of\nthese films.10,37\nE. Optical properties\nThe variation of the optical ~Tauc! gap as a function of\nN content is shown in Fig. 9~a!. The optical gap is seen to\nincrease from 1.65 eV in a-C:H itself up to 2.10 eV at 7% N.\nThe gap then decreases slightly as the N content rises from\n7% to 14%. The latter decline is presumably due to the in-\nFIG. 8. Variation of ~a! peak position vG and ~b! width GG of the Raman\nG peak with N content.Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadcreased sp2 fraction induced by the addition of N, Fig. 5~a!.\nThe local maximum in the gap at 7% N is further indication\nof a critical composition.\nThe refractive index shown in Fig. 9~b! generally de-\nclines with increasing N content. The refractive index is re-\nlated to the average of ‘‘Penn’’ band gap Eg and the plasmon\nenergy Ep by the Penn model,38\nn2215«0215Ep\n2\/Eg\n2\n. ~1!\nIt has already been noted that the plasmon energy re-\nmains constant at 22.8 eV with N content, according to the\nlow loss EELS. Thus, the Penn gap increases with increasing\nN content. The average gap corresponds to the average bond-\ning antibonding splitting and is much larger than the mini-\nmum optical gap. The average gap of a-C:H from Eq. 1 is\n11.3 eV. This is less than for diamond, 13.6 eV, because of\nthe presence of p states which have a narrower gap. The\naverage band gap is expected to increase with N incorpora-\ntion as the bonding acquires a polar content.\nThe width of the optical absorption edge shown in Fig.\n9~c!, the Urbach energy E0, declines with increasing N con-\ntent up to 7% and then remains relatively constant. The Ur-\nbach energy is a measure of the disorder of the atomic net-\nwork. This decrease suggests that the disorder of a-C:H:N\nFIG. 9. ~a! Optical gap, ~b! refractive index, and ~c! Urbach tail energy of\na-C:H:N films vs N content.J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPmay reduce with initial addition of N. This is the only case\nknown to the authors of alloying actually decreasing disor-\nder.\nF. Electrical characterization\nThe activation energy DE of conductivity of a-C:H:N\nwas derived from an Arrhenius plot of conductivity versus\ninverse temperature. The Arrhenius plot shows two straight\nline regimes, one in the temperature range 40–100 °C, and\nthe other between the temperatures of 100–200 °C. The\nvariation of DE shown in Fig. 10 is for temperatures greater\nthan 100 °C. The conduction mechanism for temperatures\nbelow 100 °C in a-C:H:N films, where DE varies from 0.34\nto 0.55 eV in a similar manner to that shown in Fig. 10,20 is\nattributed to localized tail states. Above 100 °C, thermally\nactivated conduction predominates. For a-C:H:N, which is an\namorphous material, the mobilities of electrons and holes at\nthe band edge states are assumed to be similar.\nDE for a-C:H ~0.5 eV! is considerably less that half the\noptical gap ~1.65 eV!. DE then increases to a value of 0.9 eV\nat 7% N. This is much closer to half the optical gap at this\ncomposition ~2.1 eV!. DE then declines to 0.46 eV at 15%\nN, which is again much less than half the gap ~1.8 eV! at that\ncomposition. We interpret this as follows. DE corresponds to\nthe energy difference from EF to the conduction level, usu-\nally the nearest band edge. EF in conventional a-C:H tends to\nlie near midgap.2 However, EF in ta-C and ta-C:H appears to\nlie well below midgap, as summarized in the introduction.\nThis arises because half-filled C defect levels lie predomi-\nnantly below midgap. We believe that the present a-C:H,\nalso with a low H content, has a similar behavior, with its\nEF below midgap. In that case, if N is a weak donor, N\naddition causes EF to rise through the gap towards EC . This\naccounts in general terms for the increase and then decrease\nof DE in Fig. 10. The 7% N composition is the compensated\ncomposition, where the N donors compensate the acceptor-\nlike defects. This situation is locally stable, and perhaps ac-\ncounts for why the fraction of N sp3 bonding reaches a maxi-\nmum there.\nThe alternative interpretation, that the activation energy\nchange arises simply from changes in the gap, is rejected\nbecause the conductivity changes are consistent with the\nstrong changes in the bonding at N sites shown in Fig. 5.\nFIG. 10. Conductivity activation energy DE vs N content.2631Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadThe compensation occurring at such a high composition\nas 7% emphasises the low doping efficiency of N in a-C:H.\nIn essence, the addition of 7% N atoms has moved EF\nthrough a defect density of say 431018–431020 cm23 ~see\nSec. III G!, so the efficiency is given by 1020\/(0.07Nat) or\n0.02%–1.5%, where Nat is the atomic density,\n3.731023 cm23 derived from the valence plasmon energy.\nThere are many possibilities for the nature of the N donor\nlevel, from Figs. 1~b!, 1~c!, 1~e!, and 1~h!.\nG. Electron spin resonance\nVarious bonding configurations give rise to states in the\ngap, which when half-filled and paramagnetic gives rise to\nan electron spin resonance ~ESR! signal. The variation of\nthis spin density as a function of atomic N content is shown\nin Fig. 11. The spin density decreases rapidly from a high\nvalue of 431020 cm23 to values below 1018 cm23 with in-\ncreasing N content.\nThere are two possible reasons for the decrease in spin\ndensity, either the total defect density has decreased, or the\ndefects have been converted from their paramagnetic to dia-\nmagnetic configuration by the transfer of electrons from N\nsites. Generally, diamagnetic defects are expected in the\npresence of dopants, because the donor electrons will fall\ndown from the donor level into the singly occupied defect\nlevel and make it fully occupied and diamagnetic. A typical\nexample of this situation is the diamagnetic N4\n1\n–C3\n2 configu-\nration shown in Fig. 1~c!. This effect has been shown to\noccur in a-Si:H.26\nOn the other hand, the total defect density is correlated\nwith the network disorder and Urbach slope, as occurs in\na-Si:H. Thus the decrease in Urbach slope seen in Fig. 9~c!\nsuggests that at least part of the decrease in spin density is\ndue to a decrease in the total defect density. If so, this is a\nremarkable decrease. We hope to confirm this by measuring\nFIG. 11. ~a! Spin density and ~b! ESR line width Hpp vs N content.2632 J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPthe total defect density by light induced ESR, in which all\ndefects are excited to their paramagnetic state.\nThe nature of the defect configuration can often be iden-\ntified from the ESR g-factor and linewidth. A g-factor of\n2.0028 indicates a carbon center.39 The ESR linewidth in\nFig. 11~b!, shows it to decrease with increasing nitrogen con-\ntent. The ESR linewidth in a-C:H films has been attributed to\nexchange narrowing.39–43 The linewidth under exchange nar-\nrowing is proportional to the electron density per site and so\ninversely proportional to the number of sites over which the\nunpaired electron is delocalized. The 2.0028 defect has been\nassociated with sp2 clusters,43 so the decrease in linewidth\nwith N content suggests that the defect becomes larger with\nincreasing N content. The alternative line broadening mecha-\nnism in spin resonance is dipolar broadening by interaction\nwith nearby H atoms, in which the linewidth would increase\nwith H content. A dependence on H content was observed in\nsputtered a-C:H by Hoinkis et al.41 In our case, the linewidth\ndecreases from 5 to 2 G for N contents from 0% to 7%, while\nthe H content is essentially constant ~Fig. 2!, which is evi-\ndence against this dipolar broadening in PECVD a-C:H.\nIV. DISCUSSION\nThe variation of the JDOS as a function of N content is\nshown in Fig. 12. The area shown boxed in Fig. 12 is ex-\npanded in Figs. 12~a! and 12~b!. The JDOS for all three films\nin general can be taken to consist of two broad peaks cen-\ntered about 5 and 12 eV. The peak at ;5 eV is attributed to\np–p* states and the one at 12 eV to s–s* states. It is seen\nthat there is a significant reduction in the gap states as the N\ncontent changes from 0% to 7%, seen as a reduction in the\nJDOS in the 0–5 eV region in Fig. 12~a!. This is consistent\nwith the widening of the optical gap and sharpening of band\ntails seen in Fig. 9. As the N content rises to 14%, it is seen\nthat the JDOS at the band edges now increases again. This is\nattributed to the introduction of extra states near the band\nedges by N sites.\nIn analyzing the electronic doping results, a model as to\nhow a predominantly sp2 bonded material can contribute to\nthe conduction process must be considered. If it is assumed\nthat each of the N that is sp3 bonded to C contributes an\nelectron to the conduction process when found sitting in a\nFIG. 12. Joint density of states from EELS.Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownloadsp3 C environment Fig. 1~b!, and that the N which is sp2\nbonded in a sp2 C environment contributes an electron due to\npairing up of the C p electron with the fourth N electron,\nFigs. 1~e! and 1~h!, then an empirical expression which re-\nlates the electronic activation energy for conduction to the C\nand N bonding configuration can be derived.\n@~k3Nsp23Csp2!1~m3Nsp33Csp3!#3Nat.\n5constant3DE intr , ~2!\nwhere k and m are the electrically active doping efficiencies\nin the sp2 and sp3 bonding configurations and DE intr the\nmovement of the Fermi level from the undoped state. By\nusing a suitable set of axes in the form shown in Fig. 13,\n@(Nsp23Csp23Nat. \/DE intr# versus @12(Nsp23Csp23Nat. \/\nDE intr] , it is possible to obtain a measure for the relative\nefficiency of doping (k\/m) in the two configurations. A suit-\nable fit to the data shown in Fig. 13 gives a straight line\napproximation and a value for ‘‘k\/m’’ equivalent to 0.2. The\nexperimental data indicates that it is five times more likely\nthat an N which substitutes in a C sp3 environment acts as an\nactive donor compared to an N which is in a Csp2 environ-\nment. This result also agrees with the experimental observa-\ntion that highly tetrahedral a-C can be more easily and effi-\nciently doped with N when compared to a-C:H:N films. In\nthe results published by Veerasamy et al.14 an atomic N con-\ntent of 0.5% was needed to shift the Fermi level to midgap in\nhighly tetrahedral a-C, whereas an atomic N content of 7% is\nneeded in the a-C:H:N thin films.\nThe compressive stress in the a-C:H:N films decreased\nwith increasing N content, Fig. 3~b!. This variation is evi-\ndence for structural relaxation due to the addition of N. The\nstress in a thin film is a good indicator as to the constraints\npresent in the bonding in a material. Thrope44 defined a mean\ncoordination number ^r& for a skeleton network in terms of\nthe fraction of threefold, fourfold coordinated, and H sites in\na network,\n^r&5\n4Csp313Csp22CH\n12CH\n, ~3!\nwhere Csp3 is the carbon sp3 content, Csp2 is the carbon sp2\ncontent and CH the hydrogen content in the a-C:H:N films.\nFIG. 13. The relative electronic doping efficiency of N in an sp2 and sp3\nenvironment in a-C:H thin films ~see text for details!.J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIPFigure 14 shows the variation of the coordination number for\nthe a-C:H:N thin films. The peak in the coordination number\nis seen to correspond to the maximum of the C and N sp3\ncontents. The coordination of our a-C:H:N alloys decreases\ngradually with N content and rapidly beyond an atomic N\ncontent of 7%. This is expected if the atomic N acts as a\ntermination site and thereby relaxes the entire a-C:H:N net-\nwork towards three. Since the optical band gap still remains\nrelatively high, it is difficult to classify these films as gra-\nphitic in nature. As the N bonds preferentially in a threefold\ncoordination in the C–N alloys, the relative N content too\nshould be considered before a classification is made as to the\nnature of the film.\nV. CONCLUSIONS\nThe effect of nitrogen addition on the structural and\nelectronic properties of hydrogenated amorphous carbon ~a-\nC:H! films has been characterized. The variation of conduc-\ntivity with nitrogen content suggest that N acts as a weak\ndonor, with the conductivity first decreasing and then in-\ncreasing as the Fermi level moves up in the band gap. Com-\npensated behavior is found at about 7 at. % N, where various\nproperties such as the optical gap, and N sp3 content show a\nmaximum. The Urbach energy and paramagnetic defect den-\nsity are found to decrease with increasing N content. This\nindicates an unusual decrease in disorder with alloying.\n1A. M. Liu and M. Cohen, Science 245, 841 ~1989!.\n2B. Meyerson and F. W. Smith, Solid State Commun. 34, 531 ~1980!.\n3B. Meyerson and F. W. Smith, Solid State Commun. 41, 68 ~1982!.\n4D. I. Jones and A. D. Stewart, Philos. Mag. B 46, 423 ~1982!.\n5O. Amir and R. Kalish, J. Appl. Phys. 70, 4958 ~1991!.\n6A. Mansour and D. Ugolini, Phys. Rev. B 47, 4958 ~1993!.\n7A. Helmbold, P. Hammer, J. U. Thiele, K. Rohwer, and D. Meissner,\nPhilos. Mag. B 72, 335 ~1995!.\n8O. Stenzel, M. Vogel, S. Ponitz, R. Petrich, and T. Wallendorf, Phys.\nStatus Solidi A 140, 179 ~1993!.\n9H. X. Han and B. J. Feldman, Solid State Commun. 65, 921 ~1988!.\n10 J. Schwan, W. Dworschak, K. Jung, and H. Ehrhardt, Diam. Relat. Mater.\n3, 1034 ~1994!.\n11D. R. McKenzie, Y. Yin, N. A. Marks, C. A. Davis, E. Kravtchinskaia, B.\nA. Pailthorpe, and G. A. J. Amaratunga, J. Non-Cryst. Solids 164, 1101\n~1993!.\n12V. S. Veerasamy, G. A. J. Amaratunga, C. A. Davis, W. I. Milne, P.\nHewitt, and M. Weiler, Solid-State Electron. 37, 319 ~1993!.\n13V. S. Veerasamy et al., J. Phys. Condens Matter 5, L169 ~1993!.\nFIG. 14. Mean network coordination number vs N content.2633Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\nDownload14V. S. Veerasamy, J. Yuan, G. Amaratunga, W. I. Milne, K. W. R. Gilkes,\nM. Weiler, and L. M. Brown, Phys. Rev. B 48, 17 954 ~1993!.\n15C. A. Davis, D. R. McKenzie, Y. Yin, E. Kravtchinskaia, G. A. J. Ama-\nratunga, and V. S. Veerasamy, Philos. Mag. B 69, 1133 ~1994!.\n16M. Weiler, S. Sattel, T. Giessen, K. Jung, H. Ehrhardt, V. S. Veerasamy,\nand J. Robertson, Phys. Rev. B 53, 1594 ~1996!.\n17M. Weiler, S. Sattel, H. Ehrhardt, and J. Robertson, Proceedings of the\nElectrochemical Society Conference, Reno, NV, ~Unpublished!.\n18S. R. P. Silva, K. J. Clay, S. P. Speakman, and G. A. J. Amaratunga,\nDiam. Relat. Mater. 4, 977 ~1995!.\n19S. R. P. Silva, J. Robertson, Rusli , G. A. J. Amaratunga, and J. Schwan,\nPhilos. Mag. B 74, 369 ~1996!.\n20S. R. P. Silva, and G. A. J. Amaratunga, Thin Solid Films 270, 194\n~1995!.\n21N. Kumar, H. Schmidt, and C. Xie, Solid State Technol. 38, 71 ~1995!\n22W. Zhu, G. P. Kochanski, S. Jin, and L. Seibles, J. Appl. Phys. 78, 2707\n~1995!.\n23G. A. J. Amaratunga and S. R. P. Silva, Appl. Phys. Lett. 68, 2529 ~1996!.\n24 J. Robertson and C. A. Davis, Diam. Relat. Mater. 4, 441 ~1994!.\n25 J. Robertson and E. P. O’Reilly, Phys. Rev. B 27, 3760 ~1987!.\n26R. A. Street, Phys. Rev. Lett. 49, 1187 ~1982!.\n27R. F. Egerton, Electron Energy Loss Spectroscopy in the Electron Micro-\nscope ~Plenum, New York, 1986!.\n28N. W. Ashcroft and N. D. Mermin, Solid State Physics ~Saunders College\nPublication, New York, 1976!, Appendix K.\n29A. S. Argon, V. Gupta, H. S. Landis, and J. A. Cronie, Mater. Sci. Eng. A\n107, 41 ~1989!.2634 J. Appl. Phys., Vol. 81, No. 6, 15 March 1997\ned¬01¬Oct¬2010¬to¬131.227.178.158.¬Redistribution¬subject¬to¬AIP30D. C. Green, D. R. McKenzie, and P. B. Lukins, Mater. Sci. Forum 52, 53,\n103 ~1989!.\n31B. Dischler, Proc. European Mater. Res. Symp. 17, 18 ~1987!.\n32S. R. P. Silva, G. A. J. Amaratunga, and C. P. Constantinou, J. Appl. Phys.\n72, 1149 ~1992!.\n33A. R. Merchant, D. G. McCulloch, D. R. McKenzie, Y. Yin, L. Hall, and\nE. G. Gerstner, J. Appl. Phys. 79, 6914 ~1996!.\n34H. Kaufman, S. Metin, and D. D. Saperstein, Phys. Rev. B 39, 13 053\n~1989!.\n35M. A. Tamor and W. C. Vassell, J. Appl. Phys. 76, 3832 ~1994!; M. A.\nTamor, W. C. Vassell, and K. P. Carduner, Appl. Phys. Lett. 58, 592\n~1991!.\n36G. Mariotto, F. L. Freire, and C. A. Achete, Thin Solid Films 241, 255\n~1994!.\n37D. F. Franceschini, C. A. Achete, and F. L. Freire, Appl. Phys. Lett. 60,\n3229 ~1992!.\n38 J. C. Philips, Rev. Mod. Phys. 42, 107 ~1970!.\n39D. J. Miller and D. R. McKenzie, Thin Solid Films 108, 257 ~1983!.\n40R. Kleber, K. Jung, H. Ehrhardt, I. Muhling, K. Breuer, H. Metz, and F.\nEngelke, Thin Solid Films 205, 274 ~1991!.\n41M. Hoinkis, E. D. Tober, R. L. White, and M. S. Crowder, Appl. Phys.\nLett. 61, 2653 ~1992!.\n42S. Schutte, S. Will, H. Mell, and W. Fuhs, Diam. Relat. Mater. 2, 1360\n~1993!.\n43A. Sadki, Y. Bounoh, M. L. Theye, J. vonBardleben, J. Cernogora, and J.\nL. Fave, Diam. Relat. Mater. 5, 439 ~1996!.\n44M. F. Thorpe, J. Non-Cryst. Solids 182, 135 ~1995!.Silva et al.\n¬license¬or¬copyright;¬see¬http:\/\/jap.aip.org\/about\/rights_and_permissions\n"}