{"doi":"10.1007\/s10546-010-9471-6","coreId":"113920","oai":"oai:epubs.surrey.ac.uk:3016","identifiers":["oai:epubs.surrey.ac.uk:3016","10.1007\/s10546-010-9471-6"],"title":"Tracer Flux Balance at an Urban Canyon Intersection","authors":["Carpentieri, M","Robins, AG"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05","abstract":"Despite their importance for pollutant dispersion in urban areas, the special features of dispersion at street intersections are rarely taken into account by operational air quality models. Several previous studies have demonstrated the complex flow patterns that occur at street intersections, even with simple geometry. This study presents results from wind-tunnel experiments on a reduced scale model of a complex but realistic urban intersection, located in central London. Tracer concentration measurements were used to derive three-dimensional maps of the concentration field within the intersection. In combination with a previous study (Carpentieri et al., Boundary-Layer Meteorol 133:277-296, 2009) where the velocity field was measured in the same model, a methodology for the calculation of the mean tracer flux balance at the intersection was developed and applied. The calculation highlighted several limitations of current state-of-the-art canyon dispersion models, arising mainly from the complex geometry of the intersection. Despite its limitations, the proposed methodology could be further developed in order to derive, assess and implement street intersection dispersion models for complex urban areas","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:3016<\/identifier><datestamp>\n      2017-10-31T14:07:31Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/3016\/<\/dc:relation><dc:title>\n        Tracer Flux Balance at an Urban Canyon Intersection<\/dc:title><dc:creator>\n        Carpentieri, M<\/dc:creator><dc:creator>\n        Robins, AG<\/dc:creator><dc:description>\n        Despite their importance for pollutant dispersion in urban areas, the special features of dispersion at street intersections are rarely taken into account by operational air quality models. Several previous studies have demonstrated the complex flow patterns that occur at street intersections, even with simple geometry. This study presents results from wind-tunnel experiments on a reduced scale model of a complex but realistic urban intersection, located in central London. Tracer concentration measurements were used to derive three-dimensional maps of the concentration field within the intersection. In combination with a previous study (Carpentieri et al., Boundary-Layer Meteorol 133:277-296, 2009) where the velocity field was measured in the same model, a methodology for the calculation of the mean tracer flux balance at the intersection was developed and applied. The calculation highlighted several limitations of current state-of-the-art canyon dispersion models, arising mainly from the complex geometry of the intersection. Despite its limitations, the proposed methodology could be further developed in order to derive, assess and implement street intersection dispersion models for complex urban areas.<\/dc:description><dc:date>\n        2010-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3016\/2\/DAPPLE_ffid_mass-balance_PP.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3016\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Carpentieri, M and Robins, AG  (2010) Tracer Flux Balance at an Urban Canyon Intersection   Boundary-Layer Meteorology, 135 (2).  pp. 229-242.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10546-010-9471-6<\/dc:relation><dc:relation>\n        10.1007\/s10546-010-9471-6<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/3016\/","http:\/\/dx.doi.org\/10.1007\/s10546-010-9471-6","10.1007\/s10546-010-9471-6"],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Tracer flux balance at an urban canyon intersection\nMatteo Carpentieri Alan G. Robins\nBoundary-Layer Meteorology 135 (2), 229–242 [2010]\ndoi: 10.1007\/s10546-010-9471-6\nAbstract\nDespite their importance for pollutant dispersion in urban areas, the special features\nof dispersion at street intersections are rarely taken into account by operational air quality\nmodels. Several previous studies have demonstrated the complex flow patterns that occur\nat street intersections, even with simple geometry. This study presents results from wind\ntunnel experiments on a reduced scale model of a complex but realistic urban intersection,\nlocated in central London. Tracer concentration measurements were used to derive three-\ndimensional maps of the concentration field within the intersection. In combination with\na previous study (Carpentieri et al., Boundary-Layer Meteorol. 133:277–296) where the\nvelocity field was measured in the same model, a methodology for the calculation of the\nmean tracer flux balance at the intersection was developed and applied. The calculation\nhighlighted several limitations of current state-of-the-art canyon dispersion models, arising\nmainly from the complex geometry of the intersection. Despite its limitations, the proposed\nmethodology could be further developed in order to derive, assess and implement street\nintersection dispersion models for complex urban areas.\n1 Introduction\nThe causes of poor air quality in most cities around the world can be found in the results of\nhuman activities. World population has more than doubled during the last 50 years, while the\nnumber of cars has increased by a factor of 10. Urban population has increased by a factor of 4\nin the same period and this development is expected to continue in the coming years (Fenger,\n1999). Most of the harmful pollutants found in cities (CO, NOX , volatile organic compounds,\nparticulates, etc.) are emitted by industrial operations (mainly by combustion processes) and\ntraffic. The increase in traffic volume within the densely built and poorly ventilated urban\nareas is a worrying trend, exacerbated because of the increased numbers who live and work in\ncities. Human exposure to hazardous substances is expected to increase world-wide, primarily\nin those areas where population and traffic density are relatively high. Understanding flow and\ndispersion in urban streets is therefore of paramount importance for air quality management\nand planning, particularly for reasons related to human health. Furthermore, the particular\npresent international political situation adds further concerns, as the deliberate discharge of\ntoxic material in populated areas is a serious threat.\nThe sources and dispersion of pollution and its effects on buildings and the population have\nbeen the subject of numerous previous studies. Models of varying complexity have been de-\nveloped and experimental data from the field and wind tunnels use in their validation. Most of\n1\nthe work has focussed on simple geometries, such as the well-known urban street canyon (see\nthe reviews of Vardoulakis et al., 2003; Berkowicz et al., 1997; Britter and Hanna, 2003); nev-\nertheless, those attempts to study real urban situations have produced some important insight\ninto the dispersion process, highlighting the role of three-dimensional effects, particularly at\nstreet intersections (Soulhac, 2000; Scaperdas, 2000). Pollution hotspots may be found at such\nlocations due to the presence of high traffic levels and traffic flow controls and intersections\nare more common than regular street canyons in real cities. Intersection flow and dispersion\nprocesses are extremely complex, making their treatment much more difficult than that found\nadequate for basic street canyons (see, e.g. Hoydysh and Dabberdt, 1994; Kastner-Klein et al.,\n1997; Wichmann-Fiebig et al., 1997; Scaperdas and Colvile, 1999; Robins et al., 2002).\nMost existing urban dispersion models are not applicable to near field dispersion modelling\nat urban intersections and the development of a specialised intersection dispersion model has re-\nceived only very limited attention. Yamartino and Wiegand (1986) briefly considered a simple\nmethodology for including the effect of street canyon intersections, as part of the development\nof CPBM (Canyon Plume Box Model). The intersection was considered in terms of a well\nmixed reactor that is fed polluted air by one or more street canyons, and drained of pollutants\nby other neighbouring street canyon. A simple mass balance could then be used to calculate\nconcentrations within the canyons, using CPBM. However, they did not have experimental data\nto evaluate this approach and recognised that “a realistic modelling of concentrations and their\ngradients within an intersection must involve three dimensional aspects of the flow”, such as\nfor example, “canyon edge vortices”. Based on this concept, Scaperdas (2000) analysed an ex-\ntensive experimental data-set (flow measurements in a wind tunnel) in order to quantify volume\nflux exchanges between the canyons at intersections of different shape and geometry. Unfortu-\nnately, tracer concentration measurements were not available at the same positions as the flow\nmeasurements and, therefore, pollutant mass fluxes could not be evaluated. These data were\nused, together with results from CFD (Computational Fluid Dynamics) simulations (Ketzel et\nal., 2002), to develop intersection parameterisations for the three dimensional street canyon\nmodel SEP-SCAM (Semi-Empirical Parameterised Street Canyon Model, Papathanassiou et\nal., 2008). More details of the previous literature in this field can be found in the paper by\nBelcher (2005), who reviewed several approaches to modelling flow and dispersion in urban\nareas, discussing, in particular, the role of street intersections.\nRecently, a ‘street network’ modelling concept has been developed (Soulhac, 2000) for\nneighbourhood-scale dispersion. The basic concept is that a series of short streets form a net-\nwork of boxes that comprise the canopy space. Tracer material is advected along the streets and\nis assumed to be well mixed within each box, due to vigorous mixing from recirculatory struc-\ntures and locally generated turbulence around the obstacles. The transfers of tracer between\nstreets, and between the canopy and the air above are parameterised on the basis of mass flux\nbalances from wind tunnel experiments and CFD simulations (Hamlyn et al., 2007; Soulhac et\nal., 2008).\nIn the present work, tracer concentration measurements in a wind tunnel were carried out\nin order to describe the complex three-dimensional dispersion patterns occurring in a realistic\nurban environment. For this purpose, a ‘Fast’ Flame Ionisation Detector (FFID) was employed.\nThis instrument is capable of measuring hydrocarbon concentration fluctuations. The study is\nthe natural follow-up to a previous set of wind tunnel experiments (Carpentieri et al., 2009) that\nfocussed on measuring the three-dimensional flow field at the canyon intersection by means of\nlaser-Doppler anemometry (LDA) and flow visualisation (FV) techniques. The resulting data\n2\nset, which combines the results of three sets of experiments (FV+LDA+FFID), is the most\ncomplete and, as flow and concentration have been measured at the same points, allowed us\nto estimate the mean pollutant flux balance at the intersection, particularly useful for model\nvalidation and model development purposes.\nThis study is part of the DAPPLE (Dispersion of Air Pollution and its Penetration into the\nLocal Environment) series of projects. These began as a 4-year U.K. Engineering and Phys-\nical Sciences Research Council (EPSRC) funded project within the Engineering for Health,\nInfrastructure and Environment Programme (Arnold et al., 2004). The work then continued\nunder a 3-year follow-up project (DAPPLE-HO) funded by the UK Home Office (Wood et al.,\n2009). A key objective of DAPPLE is to provide a better understanding of pollutant dispersion\nprocesses in realistic urban environments, such as a street canyon intersection studied here.\nDAPPLEs interdisciplinary approach aims to enhance understanding of the physical processes\naffecting the street and neighbourhood scale flow of air, traffic and people, by means of field\nmeasurements (meteorology, roadside pollution levels, traffic flow, personal exposure and inert\ntracer releases), wind tunnel modelling and computer simulations. General information about\nthe project can be found at www.dapple.org.uk.\n2 Tracer concentration measurements\n2.1 Wind tunnel model\nThe DAPPLE site (see also Carpentieri et al., 2009) is located at the intersection between\nMarylebone Road and Gloucester Place in Central London, UK, with a surrounding study area\napproximately 250 m in radius. Wind tunnel modelling extends to a radius of about 500 m.\nMarylebone Road is a busy dual carriageway (A501) and forms the northern boundary of the\nLondon Congestion-Charging Zone. Gloucester Place is 3 lanes, one-way northbound (Baker\nStreet is southbound one block to the East). The roads intersect perpendicularly and Maryle-\nbone Road runs approximately from west-south-west to east-north-east. The prevailing wind is\nsouth-westerly, and the average building height is approximately 22 m. As it is a real site, the\nheights and sizes of the buildings and streets are all different and this strongly influences the\npollutant dispersion mechanism within the intersection.\nThe experiments were carried out at the boundary layer wind tunnel of the Environmental\nFlow Research Centre (EnFlo) at the University of Surrey, UK. It is an open circuit, ‘suck-\ndown’ wind tunnel with a 20 m long, 3.5 m wide and 1.5 m high working section. The wind\nspeed range is from 0.3 to 3.5 m s−1, and the facility is capable of simulating both stable and\nunstable atmospheric conditions, although these features were not used in this study. Reference\nflow conditions were measured by two ultrasonic anemometers, one held at a fixed location and\nthe other positioned as required, and two propeller anemometers mounted on either side of the\ntraverse carriage. The motor shaft speed was also measured. Temperature conditions were\nmonitored by thermocouple rakes in the flow and individual thermocouples in each tunnel wall\npanel. The pressure drop across the inlet was also monitored, primarily to indicate the state of\nthe inlet screens. The wind tunnel and the associated instrumentation are fully automated and\ncontrolled using ‘virtual instrument’ software created in LabVIEW by EnFlo research staff.\nThe 1:200 model installed in the wind tunnel is the simplest DAPPLE site model, where all\nbuildings have been reduced to simple blocks with flat roofs. The generated boundary layer has\na thickness of ≈ 1 m and a surface roughness z0 = 1.5 mm (equivalent to 0.3 m at full scale).\n3\nMost of the tests were carried out with a reference wind speed (Ure f ) of about 2.5 m s−1. Ure f\nwas measured with an ultrasonic anemometer positioned outside the boundary layer.\nA site-aligned co-ordinate system was used, with the x axis along Marylebone Road, posi-\ntive towards the east, and the y axis along Gloucester Place, positive towards the north. Wind\nvector directions were defined as zero along the positive x-axis and positive anticlockwise.\nThe model was mounted on a turntable and aligned to give a wind direction of 51.4o, as in\nthe first field tracer dispersion experiment (Arnold et al., 2004). This corresponds to a wind\napproximately from the south-west.\n2.2 Tracer dispersion experiments\nTracer concentration measurements were carried out to investigate the dispersion phenomena\nwithin the intersection. Dispersion experiments were performed by releasing a neutrally buoy-\nant gas ‘tracer’ into the flow and measuring its concentration using air sampling at selected\npoints downstream. The tracer used was a gas mixture of (order 1%) ethylene (or propane,\nin a second series of experiments) in air, the precise source concentration chosen to optimise\ndetectability. To approximate a passive, ground level point source, the tracer gas was released\nvertically downwards from a pipe positioned at a small distance above the surface, with very\nlow initial momentum.\nThe instrument used for concentration measurement was a CAMBUSTION FFID, a fast\nresponse instrument that is capable of measuring hydrocarbon concentration fluctuations with\na frequency response of about 200 s−1. The average sampling time was generally set to about 1\nminute, as in previous LDA experiments (Carpentieri et al., 2009), though some measurements\nwere performed using a longer averaging time.\nEight different source locations were used, all at a height of z = 10 mm; five were in Maryle-\nbone Road and three in Gloucester Place, as shown in Figure 1. Multiple point sources were\nused so that the combined concentration fields filled the lateral extent of the street canyon in\nwhich they were located. The location of the sources allowed us to investigate the problem\nfrom a ‘near-to-intermediate field’ perspective (see, e.g., Belcher, 2005; Wood et al., 2009, for\na description of the classifications: near-, intermediate-, and far-field).\nThe measurement points were on the 6 levels chosen for the previous LDA experiments (z\n= 25, 50, 75, 100, 125 and 150 mm), with an additional level at 10 mm from the ground. A\nregular 40 mm x 40 mm horizontal measurement grid was used, so that concentration values\nwere available at the same locations as the LDA flow measurements (Carpentieri et al., 2009,\nsee also Figure 2).\nOf course, this set of sources were effectively at ground level and the resulting plumes by\nno means fill the street canyons in which the sources were located. Other configurations were\npossible but the set-up investigated is relevant to air quality modelling as emissions at and near\nintersections tend to be much greater than those further away because of the time spent queuing\nand the deceleration\/acceleration driving behaviour at intersections. Air fluxes can, of course,\nalso be derived directly from the velocity field data but linking any given exit flow with an inlet\nflow requires tracer to be added.\n4\nFigure 1: Source locations for the tracer concentration measurements\nFigure 2: Horizontal velocity field at z = 25 mm derived from LDA measurements (Carpentieri\net al., 2009)\n5\nFigure 3: Non-dimensional concentrations at z = 10 mm, source height 10 mm; all the Maryle-\nbone Road sources\n2.3 Results\nResults are reported in terms of the non-dimensional concentration and velocity, C∗ and U∗:\nC∗ =\nCUre fH2re f\nQ\n(1)\nU∗ =\nU\nUre f\n(2)\nwhere C and U are the measured mean volume concentration and air speed, Ure f the refer-\nence wind speed at the boundary layer edge, Hre f a reference length (in this case the average\nbuilding height of the model, 110 mm) and Q the volume emission rate. Example maps of the\nmean, ground level, non-dimensional concentration field are given in Figures 3, 4 and 5. These\nmeasurements were obtained at a height of 10 mm, that is 2 m at full scale. The concentration\nmaps for more than one source have been obtained by simple superposition of the maps for\nsingle sources.\nAs expected, the results show that the ground level concentration field was heavily influ-\nenced by the complex three-dimensional flow described by the flow visualisation and LDA\nexperiments (Carpentieri et al., 2009). The circulation in the street canyons resulted in higher\nconcentrations of tracer at ground level occurring on the leeward side of the streets, and thus at\nthe south-west corner of the intersection due from the sum of the effects of the two canyons.\nIn this situation, horizontal vortices observed by Carpentieri et al. (2009) resulted in a further\nincrease in the concentrations at the south-west and north-west corners of the intersection, and\na ‘cleaner’ area at the south-east corner.\n6\nFigure 4: Non-dimensional concentrations at z = 10 mm, source height 10 mm; all the Glouces-\nter Place sources\nFigure 5: Non-dimensional concentrations at z = 10 mm, source height 10 mm; all the sources\n7\nFigure 6: Vertical y-z sections (x = –100, 20 and 100 mm) showed in the following figures\nAt ground level, it can be observed from Figure 4 that nearly all the incoming tracer from\nGloucester Place was, on average, deflected into the main stream in Marylebone Road, while\nthe incoming tracer from Marylebone Road was carried either into one canyon or the other\n(Figure 3), depending on its initial position and the state of the unsteady ‘switching’ vortices\nobserved by Carpentieri et al. (2009). Concentration maps in three vertical y-z sections, defined\nby Figure 6, are shown in Figures 7–8.\nDespite the asymmetrical geometry, the tracer from these sources tended to remain mostly\nwithin the canyons, with only limited exchange with the flow above roof level. Tracer transport\nnear the centre of the intersection was very complex (Carpentieri et al., 2009). The incoming\nflow from Gloucester place was initially deflected downwards and then, near the centre of the\nintersection, spread vertically. Beyond the intersection centre, it was deflected again but this\ntime upwards, by the incoming flow from Marylebone Road.\nVertical sections along the x axis (not included in the figures) confirmed the observations\nof the y-z sections. In particular, the trapping effect due to the recirculation vortices inside the\ncanyons was clearly visible. This effect was weaker at the intersection centre, where a rapid\nvertical spread can be seen (see also Figure 8). The maximum exchange rate between the urban\ncanopy and the above boundary layer above roof level is expected at this very location.\n3 Tracer flux balance\nSince most of the LDA measurements in Carpentieri et al. (2009) were made at the same posi-\ntions as the FFID measurements presented in this paper, a pollutant flux balance at the intersec-\ntion can be attempted. The methodology applied here is different from that in previous studies\n(Scaperdas, 2000; Robins et al., 2002) because both velocity and concentration measurements\n8\n(a)\n(b)\n(c)\nFigure 7: Non-dimensional concentrations at (a) x = –100 mm (YS1), (b) x = 20 mm (YS2),\nand (c) x = 100 mm (YS3); sources in Marylebone Road, height 10 mm\n9\n(a)\n(b)\nFigure 8: Non-dimensional concentrations at (a) x = 20 mm (YS2) and (b) x = 100 mm (YS3);\nsources in Gloucester Place, height 10 mm\n10\nhave been used and thus the tracer flux exchange between the streets can be estimated as well\nas the overall volume exchange.\nThe volume flux through a reference plane, as calculated by Scaperdas (2000) and Robins\net al. (2002), can be simply estimated from the expression:\nφV =\n∫∫\nS\nUn ds (3)\nwhere S denotes the area of the plane, s an element of area, and Un the mean flow normal\nto the plane. These volume flux values have been compared with the tracer volume fluxes\nderived from the joint concentration and velocity field data. Only the transport by the mean flow\ncould be derived as simultaneous concentration and velocity measurements were not available.\nOverall, the tracer volume flux, φM, through a reference plane S is given by:\nφM =\n∫∫\nS\n(UnC+ 〈unc〉)ds (4)\nwhere 〈unc〉 is the mean turbulence flux across the plane. In the case studied here, where\nadvection was strong along all streets (because of the wind direction was approximately at 045\ndegrees to the streets), we expect that turbulent fluxes, at least in the horizontal directions,\nwere small in comparison with the advective transport. However, later work will address the\nturbulent fluxes directly and will be reported separately.\nFour vertical sections (see Figures 9 and 10) were selected for the calculation, two upwind\nand two downwind the intersection, as well as the top horizontal section (at 150 mm). The\ntracer volume flux through a specified ‘cell’ in a section has been calculated as the average of\nthe fluxes at the corner points, φM = 14∑iφM,iA, where φM,i = C\n∗\niU\n∗\ni is the flux at each point\n(i = 1..4), C∗i is the non dimensional concentration (equation 1), U∗i is the non dimensional\nvelocity component perpendicular to the section plane (equation 2), A is the area of the cell (U∗i\nat any wall and at ground level was set to 0).\nThe grid spacing (mostly 40 mm horizontal and 25 mm vertical) did not really allow a very\naccurate estimate to be made of the flux in the incoming flows, particularly that from Gloucester\nPlace. In effect, the measurement points proved to be insufficiently close to the walls and\nground level and, thus, the flux profiles in these regions were not very well represented by the\nassumed linear variation across cells. The calculation of the fluxes in the outgoing flows was not\naffected by these problems because the concentration profiles were deeper and more uniform\nat the downwind sections. The flux balances were therefore expressed with respect to the total\noutgoing fluxes. These were smaller than the total emissions from the sources because not\nall of the emitted material reached the intersection. For example, the building in Marylebone\nRoad on the north-west side of the junction is relatively low and a significant fraction of the\nemissions in Marylebone Road were lost from the street canyon and carried over the roof of\nthis building.\nThe results (see Figure 9) from the tracer flux balance at the intersection show that about\n47% of the incoming pollutant from Marylebone Road (calculated as percentage of the total\noutgoing flux) continues in that street, while about 50% deviates into Gloucester Place (north)\nand 3% is lost through the top section. On the other hand, most of the tracer coming from\nGloucester Place is entrained into Marylebone Road (85%), with only 13% continuing along\nGloucester Place (North) and 2% lost to the above roof flow.\nThe tracer flux balance calculation substantially confirms the qualitative observations from\nthe flow visualisation experiments by Carpentieri et al. (2009).\n11\nFigure 9: Tracer volume flux balance expressed in terms of the total outgoing flux\nThe average tracer fluxes through the top section (and thus, supposedly, the exchange be-\ntween the canopy and the above layer) were quite limited, accounting for just 2.5% of the total\nemitted tracer. The estimation of this flux was, however, rather imprecise. The buildings sur-\nrounding the intersection have very different heights, ranging from 55 mm (about 11 m at full\nscale) for Marathon House (on the north-west side of the intersection), to 155 mm (about 31\nm at full scale) for the building on the north-east side. The choice of an appropriate ‘upper’\nboundary was therefore quite difficult. The 150 mm level was chosen, given the importance\nof the downwind building on the vertical exchange within the intersection. In this case, we\ncould rely on the fact that most of the tracer below that level remained within the canyons be-\nyond the intersection (at least until the end of the 155 mm tall block), while the tracer passing\nthrough the upper boundary is probably entrained into the canopy flow above. If the building\narrangement were different then the situation might have been even more complex. Another\nuncertainty in the estimate of the vertical flux lies in the fact that much of the exchange mech-\nanism here was probably a turbulent process, while in the analysis only the advective terms\nwere considered (and it was not be possible to do otherwise, given the fact that velocity and\nconcentration measurements had been taken at different times).\nThe percentages of the outgoing fluxes have been calculated in terms of the total outgoing\nflux. An imbalance of about 6% between the incoming and outgoing fluxes was found and this\nmight be caused by several factors:\n• measurement errors;\n• high concentration gradients at the in-flow sections, which, in combination with the spa-\ntial resolution of the measurements, resulted in significant numerical error and undetected\nfluxes near the walls and the ground; and\n• turbulent fluxes that have been ignored, which could result in significant error where\nthe mean velocity normal to the plane was small, (especially for the fluxes between the\n12\ncanopy and the flow above roof level) and where concentrations fluctuation were rela-\ntively large (e.g., as observed in the south-west corner of the intersection, Carpentieri et\nal., 2009).\nThese possible sources of error can introduce either a positive or a negative error into the\ncalculations and, thus, the 6% value quoted above (simply as the difference between the incom-\ning and outgoing fluxes) is by no means a maximum limit for the sum of the errors. It is not\nclear how this will affect the reliability of the estimates. Clearly, care should be exercised when\nestimating the flux through the top section by simple difference between the incoming and the\noutgoing fluxes, as the result might be contaminated by any or all of the above errors. The next\nlogical step in this research, though by no means a trivial one, is to measure the turbulent tracer\nfluxes directly and the results of this effort will be reported in due course.\nFor comparison purposes, volume fluxes have been estimated by using LDA data only,\nfollowing the methodology proposed by Scaperdas (2000) and Robins et al. (2002), except\nthat, unlike in the original applications, in this case the vertical fluxes through the top section\nhave been measured rather than derived from imbalance in the other fluxes. The results of the\nvolume flux estimates are shown in Figure 10 as percentage of the incoming fluxes. For an easy\ncomparison, the results of the tracer flux calculations have also been included in Figure 10 as\npercentages of the incoming fluxes, without source apportionment.\nThe volume flow in Gloucester Place shown in Figure 10 is surprisingly large compared\nwith that in Marylebone Road, given that the cross sectional area of Gloucester Place is con-\nsiderably smaller that that of Marylebone Road and that the components of the wind above\nroof level parallel to the respective streets only differ by about 20%. The volume flux results\nshow that the flow along Marylebone Road increased by about 40% across the intersection and\nthat in Gloucester Place reduced to compensate. The pollutant flux exchanges followed this\npattern, with the flux in Marylebone Road increasing significantly across the intersection. This\nsuggests that knowledge of the volume flux balance, which on the whole is easier to measure,\ncan give a reasonable estimate of the pollutant exchanges. However, it is only measurement of\nthe pollutant fluxes that can assign the contributions to the outgoing fluxes from the original\nsources, so both types of measurement are clearly valuable.\n4 Conclusions\nThis paper presents results from tracer concentration measurements that were carried out in a\nwind tunnel in order to describe the complex three-dimensional dispersion patterns occurring\nin a realistic urban environment, in particular at a busy street intersection in central London.\nFast flame ionisation detector measurements were employed to derive three-dimensional maps\nof the concentration field at the intersection.\nAs highlighted by previous studies (Carpentieri et al., 2009), the flow field within the inter-\nsection was very complex and highly three-dimensional, and this naturally resulted in complex\nconcentration fields. The circulations within the street canyons caused higher ground level con-\ncentrations of tracer to occur on the leeward side of the streets. The simple model proposed by\nSoulhac (2000) for street intersections, which assumes a complete mixing in the intersection,\ndoes not seem to be adequate for intersections with complex geometry, like the one studied here.\nThis fact is also supported by studies that have analysed less complex intersections (Soulhac\n13\nFigure 10: Volume (left) and tracer (right) exchange balance expressed in terms of the incoming\nflux from Gloucester Place (top) and from Marylebone Road (bottom)\n14\net al., 2009). Of course, the sources studied were effectively at ground level, near the inter-\nsection and a different picture would emerge if they were distributed throughout the canyon.\nHowever, we argue that the case studied is most pertinent to air quality applications because of\nthe likelihood of relatively high emission rates from vehicles in the vicinity of intersections.\nThe tracer concentration measurements were located where previous flow measurements\n(Carpentieri et al., 2009) were also available. This allowed a tracer flux balance to be cal-\nculated at the intersection. The proposed methodology was based on the calculation of the\naverage tracer fluxes through the four vertical sections constituting the interface between the\nstreet canyons and the intersection. The mean flux through the top horizontal section was also\nestimated. One important result from this was the magnitude of the mean flux observed be-\ntween the southern and the northern sections of Gloucester Place. Given the wind direction\nand the intersection geometry, one might have expected all the tracer emitted in that street to\nbe entrained into the wider Marylebone Road. On the contrary, flow instabilities and three-\ndimensional effects within the intersection (see also Carpentieri et al., 2009) resulted in about\n13% of the incoming mean flux from Gloucester Place continuing along that street, north of\nthe intersection. This feature is not necessarily observed in more regular street canyon intersec-\ntions (Soulhac et al., 2009) and should be taken into account by street intersection dispersion\nmodels. Many regulatory models neglect any interactions of the type found here and simply\nadd the contributions from the two streets forming the intersection, thus neglecting the 85% of\nthe flux from Gloucester Place that transfers into Marylebone Road (east) and the 50% of the\nflux from Marylebone Road into Gloucester Place (north) and, therefore, failing to provide a\nrealistic prediction of concentration levels.\nThe methodology proposed in this paper, to our knowledge, is the first attempt to derive\ntracer flux balance calculations in a realistic environment. However, the procedure as applied\nhas a number of limitations and should be improved before further application in model devel-\nopment and evaluation work. The spatial resolution of the measurements, for example, did not\nallow a reliable estimation to be made of the incoming fluxes. Furthermore, it is not clear how\ninclusion of the turbulent fluxes will affect the overall tracer flux balance of the intersection. In\norder to estimate turbulent fluxes, velocity and concentration measurements have to be taken\nsimultaneously and this is the subject of the continuing research effort. The results reported in\nthis paper are, obviously, very case-specific and strongly dependent on the particular geometry\nof the site and the choice of the (single) wind direction. A generalisation of the findings by\nusing simpler, but still realistic models and different wind directions is also an ongoing field of\ninvestigation in the EnFlo laboratory.\nAcknowledgements\nThe DAPPLE project has been funded by the Engineering and Physical Sciences Research\nCouncil (EPSRC). The experimental work was carried out in the EnFlo Laboratory by Matteo\nCarpentieri during his PhD research funded by the University of Florence.\nReferences\nArnold SJ, ApSimon H, Barlow J, Belcher S, Bell M, Boddy JW, Britter R, Cheng H, Clark\nR, Colvile RN, Dimitroulopoulou S, Dobre A, Greally B, Kaur S, Knights A, Lawton T,\n15\nMakepeace A, Martin D, Neophytou M, Neville S, Nieuwenhuijsen M, Nickless G, Price\nC, Robins A, Shallcross D, Simmonds P, Smalley RJ, Tate J, Tomlin AS, Wang H, Walsh P\n(2004) Introduction to the DAPPLE air pollution project. Sci Total Environ, 332:139–153\nBelcher SE, (2005) Mixing and transport in urban areas. Philos T Roy Soc A, 363:2947–2968\nBerkowicz R, Palmgren F, Hertel O, Vignati E (1996) Using measurements of air pollution in\nstreets for evaluation of urban air quality – meteorological analysis and model calculations.\nSci Total Environ, 189-190:259–265\nBerkowicz R, Hertel O, Larsen SE, Sørensen NN, Nielsen M (1997) Modelling traffic pollution\nin streets. Danish Ministry of Environment and Energy, National Environmental Research\nInstitute\nBritter RE, Hanna SR (2003) Flow and dispersion in urban areas. Annu Rev Fluid Mech,\n35:469–496\nBuckland AT (1998) Validation of a street canyon model in two cities. Environ Monit Assess,\n52:255–267\nCarpentieri M, Robins AG, Baldi S (2009) Three-dimensional mapping of air flow at an urban\ncanyon intersection. Boundary-Layer Meteorol, 133:277–296\nFenger J (1999) Urban air quality. Atmos Environ, 33:4877–4900\nHamlyn D, Hilderman T, Britter RE (2007) A simple network approach to modelling dispersion\namong large groups of obstacles. Atmos Environ, 28:5848–5862\nHoydysh WG, Dabberdt WF (1994) Concentration fields at urban intersections: fluid modeling\nstudies. Atmos Environ, 28:1849–1860\nHoydysh WG, Griffiths RA, Ogawa Y (1974) A scale model study of the dispersion of pol-\nlutants in street canyons. Paper 1974-157, Proc. 67th Annual Meeting of the Air Pollution\nControl Association, Denver, Colorado, 9-13 June, 24 pp\nJohnson WB, Ludwig FL, Dabberdt WF, Allen RJ An urban diffusion simulation model for\ncarbon monoxide. JAPCA J Air Waste Ma, 23:490–498\nKastner-Klein P, Plate EJ, Fedorovich E (1997) Gaseous pollutant dispersion around urban\ncanopy elements: wind tunnel case studies. Int J Environ Pollut, 8:727–737\nKetzel M, Louka P, Sahm P, Guilloteau E, Sini J-F, Moussiopoulos N (2002) Intercomparison\nof numerical urban dispersion models – Part II: Street canyon in Hannover, Germany. Water\nAir Soil Pollut Focus, 2:603–613\nPapathanassiou A, Douros I, Moussiopoulos N (2008) A simplified three-dimensional approach\nto street canyon modelling using SEP-SCAM. Environ Modell Softw, 23:304–313\nRobins A, Savory E, Scaperdas A, Grigoriadis D (2002) Spatial variability and source-receptor\nrelations at a street intersection. Water Air Soil Pollut Focus, 2:381–393\n16\nScaperdas A, Colvile RN (1999) Assessing the representativeness of monitoring data from an\nurban intersection site in central London, UK. Atmos Environ, 33:661–674\nScaperdas A-S (2000) Modelling flow and pollutant dispersion at urban canyon intersections.\nPhD thesis, Imperial College of Science, Technology and Medicine, University of London\nSoulhac L (2000) Mode´lisation de la dispersion atmosphe´rique a´ l’inte´rieur de la canope´e\nurbaine. PhD thesis, E´cole Centrale de Lyon, France\nSoulhac L, Perkins RP, Salizzoni P (2008) Flow in a street canyon for any external wind\ndirection. Boundary-Layer Meteorol, 126:365–388\nSoulhac L, Garbero V, Salizzoni P, Mejean P, Perkins RP (2009) Flow and dispersion in street\nintersections. Atmos Environ, in press, DOI 10.1016\/j.atmosenv.2009.02.061\nVardoulakis S, Fisher BEA, Pericleous K, Gonzalez-Flesca N (2003) Modelling air quality in\nstreet canyons: a review. Atmos Environ, 37:155–182\nWichmann-Fiebig M, Pfeffer H-U, Rau M (1997) A dataset for the validation of flow and\ndispersion models as an urban intersection. Int J Environ Pollut, 8:747–760\nWood CR, Arnold SJ, Balogun AA, Barlow JF, Belcher S, Britter RE, Cheng H, Dobre A,\nLingard JJN, Martin D, Neophytou MK, Petersson FK, Robins AG, Shallcross DE, Smalley\nRJ, Tate JE, Tomlin AS, White IR (2009) Dispersion experiments in Central London: the\n2007 DAPPLE project. Bull Am Meteorol Soc, 90:955–969\nYamartino RJ, Wiegand G (1986) Development and evaluation of simple models for the flow,\nturbulence and pollutant concentration fields within an urban street canyon. Atmos Environ,\n20:2137–2156\n17\n"}