{"doi":"10.1080\/03054980500222221","coreId":"195070","oai":"oai:lra.le.ac.uk:2381\/1016","identifiers":["oai:lra.le.ac.uk:2381\/1016","10.1080\/03054980500222221"],"title":"The Project of the other: Developing inclusive learning communities in schools","authors":["Busher, Hugh"],"enrichments":{"references":[{"id":44683042,"title":"Changing teachers, changing times: Teachers’ work and culture in the postmodern age (London, Cassell) Hodgkinson, C","authors":[],"date":"1994","doi":"10.1177\/0263211x9402200407","raw":"Hargreaves, A (1994) Changing teachers, changing times: Teachers’ work and culture in the postmodern age (London, Cassell) Hodgkinson, C (1999) The triumph of the will: An exploration of certain fundamental problematics in administrative philosophy P. T. Begley, and P. E. Leonard, (eds) (1999) The Values of Educational Administration (London, Falmer Press) Hopkins, D (2001) Improving the Quality of Education for All (London, David Fulton) Howard, S. and Gill, J. (2000) ‘The pebble in the pond: Children’s constructions of power, politics and democratic citizenship’, Cambridge Journal of Education, Vol.30, No.3, pp.355-378.","cites":null},{"id":44683040,"title":"Early childhood educational research: Issues in methodology and ethics","authors":[],"date":"2000","doi":"10.4324\/9780203995877","raw":"Aubrey, C. David, T. Godfrey, R and Thompson, L. (2000) Early childhood educational research: Issues in methodology and ethics (London, RoutledgeFalmer) Bennett, N (2001) Power, structure and culture: An organisational view of school effectiveness and school improvement in Bennett, N and Harris, A (eds) School effectiveness and school improvement: searching for the elusive partnership (London, Continuum) Blase, J. and Anderson, G. L (1995), The micro-politics of educational leadership: From control to empowerment (London, Cassell) Blase, J and Blase, J (1994) Empowering teachers: What successful Principals do. (Thousand Oaks, Ca, Corwin) Blase, J and Blase, J (1995) The micro-political orientation of facilitative school principals and its effects on teachers’ sense of empowerment. Paper given at the (American Educational Research Association (AERA) Conference, San Francisco, April 1995) Bottery, M. (2003) The leadership of learning communities in a culture of unhappiness Paper given to the ESRC Seminar Series Challenging the orthodoxy of school leadership: Towards a new theoretical perspective, (National College for School Leadership, UK, June 2003) Bourdieu, P and Passeron, J-C (1977) Reproduction in education: Society and culture London: Sage Bradley, C and Roaf, C (1995) Meeting special educational needs in the secondary school: a team approach Support for Learning 10, 2, pp.93-99 Busher, H (2001) The micro-politics of change, improvement and effectiveness in schools, in Bennett, N and Harris, A (eds) School effectiveness and school improvement: searching for the elusive partnership (London, Continuum) Busher, H and Blease, D (2000) Growing Collegial cultures in subject departments in secondary schools: working with Science staff School Leadership and Management 20,1, pp.99-112 Busher, H and Harris, A (1999) Leadership of School Subject Areas: tensions and dimensions of managing in the middle, School Leadership and Management 19, 3, pp. 305-317.","cites":null},{"id":44683046,"title":"Forging Links: Effective Schools","authors":[],"date":"1997","doi":null,"raw":"Sammons, P. Thomas, S and Mortimore, P (1997) Forging Links: Effective Schools and Effective Departments. (London, Paul Chapman) Schon, D (1987) Educating the Reflective Practitioner: Towards a new design for teaching and learning in the professions (San Francisco Ca, Jossey Bass) Senge, P (1990) The fifth discipline (New York, Doubleday) Sergiovanni, T. (1994) Building Community in schools. (San Francisco, Ca, Jossey-Bass) Siskin, L. (1994) Realms of knowledge: Academic departments in secondary schools, (London, Falmer Press) Stoll, L and Fink, D (1996) Changing our schools: Linking school effectiveness and school improvement (Buckingham, Open University Press) Learning communities in schools \/ 2003 21 Smylie, M. (1994) Redesigning teachers work: Connections to the classroom, in L. DarlingHammond (ed) Review of research in education (Washington DC, American Educational Research Association) Smyth, J. Dow, A. Hattam, R. Reid, A. and Shacklock, G. (2000) Teachers’ work in a globalising economy (London, Falmer Press) Tannenbaum, R and Schmidt, W (1973) How to choose a leadership pattern Harvard Business Review .51, 3, pp.162-180 Thomas, D. (1995) Treasonable or trustworthy text: Reflections on teacher narrative studies in D.","cites":null},{"id":44683044,"title":"Management and the school, Block 3, E323 Management Processes in Schools (Milton Keynes,","authors":[],"date":"1981","doi":null,"raw":"Hoyle, E (1981) Management and the school, Block 3, E323 Management Processes in Schools (Milton Keynes, Open University Press) Linstead, S. (1993) Deconstruction of the study of organisations in J. Hassard and M. Parker (eds) (1993) Postmodernism and organisations (London, Sage) Louis, K. Marks, H. and Kruse, S. (1996) Teachers’ professional community in restructuring schools. American Educational Research Journal 33 McGregor, J (2000) The challenge of collaboration: What encourages joint working between teachers? Paper given at the Sixth quadrennial BEMAS research conference, (Robinson College, Cambridge, UK, 2000) Marsh, M (1997) In conversation with Janet Ouston in, P. Ribbins (ed) (1997) Leaders and leadership in the school, college and university (London, Cassell) Measor, L. and Sikes, P. (1992) Visiting lives: Ethics and methodology in life history in I. Goodson (ed)(1992) Studying teachers’ lives (London, Routledge) Murphy, J. (1992). The landscape of leadership preparation. (Newbury Park, CA, Crowin Press) Nias, J (1999) Primary teaching as a culture of care, in Prosser J (ed) School Culture (London, Paul Chapman) Ribbins, P (1997) Leaders and leadership in the school, college and university (London, Cassell) Ribbins, P (1999) Foreword in P. T. Begley, and P. E. Leonard, (eds) (1999) The Values of Educational Administration (London, Falmer Press) Rudduck, J. Wallace, G. and Chaplain, R. (1996) School improvement: What can pupils tell us? (London, David Fulton) Rudduck,J and Flutter, J. (2000) Pupils Participation and Pupils Perspective: ‘carving a new order of experience’. Cambridge Journal of Education. 30, 1, pp.75-89.","cites":null},{"id":44683048,"title":"Resistance to change in educational organisations paper given at the Fifth Quadrennial Research Conference of the British Educational Management and Administration Society, (Robinson College,","authors":[],"date":"1995","doi":null,"raw":"Thomas (ed) (1995) Teachers’ stories (Buckingham, Open University Press) Van der Westhuizen, P. (1996) Resistance to change in educational organisations paper given at the Fifth Quadrennial Research Conference of the British Educational Management and Administration Society, (Robinson College, Cambridge University, UK) Wallace, R. Engel, D. and Mooney, J (1997) The Learning School: A guide to Vision based leadership (Thousand Oaks, Ca., Corwin Press) Watson, L (1969) Office and expertise in the secondary school Educational Research, 11, 2, pp.104-112 Weick, K.(1976) Educational organisations as loosely coupled systems, Administrative Science Quarterly, 21, 1, pp.1-19 West-Burnham, J. (1992) Managing quality in schools: A TQM approach (Harlow, Longman) Wragg, E.C., Haynes, G.S., Wragg, C.M. and Chamberlin, R.P. (2000) Failing Teachers? (London, Routledge)","cites":null},{"id":44683041,"title":"Teachers’ Conditions of Employment: a study in the politics of school management,","authors":[],"date":"1992","doi":null,"raw":"Busher, H and Saran, R (1992) Teachers’ Conditions of Employment: a study in the politics of school management, (London, Bedford Way Series, Institute of Education, University of London \/ Kogan Page) Busher, H and Saran, R (1995) Managing with support staff in H. Busher and R. Saran (eds) Managing teachers as professionals in schools. (London, Kogan Page) Busher, H and Barker, B (2003) The crux of leadership: Shaping school culture by contesting the policy contexts and practices of teaching and learning Educational Management and Administration 31, 1, pp.51-65 Clark, D. (1996) Schools as learning communities: Transforming education (London, Cassell) Cooper, P. Drummond, M. Hart, S. Lovey, J. and McLaughlin, C. (2000) Positive alternatives to exclusion, (London, RoutledgeFalmer) Cooper, P and McIntyre, D. (1996) Effective teaching and learning: Teachers’ and students’ perspectives, (Milton Keynes, Open University Press) Dearing Commission (1993) The National Curriculum and its assessment: Final Report (London, School Curriculum and Assessment Council) Fullan, M (2003) The moral imperative of school leadership (Thousand Oaks, Ca, Corwin Press) Giddens, A (1979) Central problems in social theory (Cambridge, Polity Press) Giddens, A. (1984) Constitution of society (Cambridge, Polity Press) Giddens, A. (1991) Modernity and self-identity: Self and society in the late modern age (Cambridge, Polity Press) Gray, L. (1991) Marketing Education (Milton Keynes, Open University Press) Learning communities in schools \/ 2003 20 Greenfield, T. B and Ribbins, P. (1993) Greenfield on Educational Administration (London, Routledge) Gronn, P (2000) Distributed properties: A new architecture for leadership Educational Management and Administration 28, 3, pp.317-338 Gronn, P (2003) Leadership: Who needs it? Paper given to the ESRC Seminar Series Challenging the orthodoxy of school leadership: Towards a new theoretical perspective, (University of Birmingham, UK, February 2003) Gunter, H., McGregor, D. and Gunter, B. (2001) ‘Teachers as leaders: A case study’, Management in Education, 15,1, pp.26-28.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"This paper considers the possible nature and membership of learning communities in schools and\\ud\nwhat evidence there may be of middle leaders trying to develop and sustain learning communities\\ud\nwith their colleagues, even though these communities encompass asymmetrical power relationships\\ud\nbetween members. Although it is argued that students and support staff are part of these learning\\ud\ncommunities, not apart from them, the limited evidence from this study does not support this. How\\ud\npower is used and distributed to construct collaborative cultures, and the part played by middle\\ud\nleaders, is central to the development of a learning community. The promotion of dialogue and\\ud\nconsultation amongst members helps them to generate a sense of community which, in turn, enables\\ud\nthem to tackle effectively the tasks and dilemmas facing them. Empirical evidence from a small\\ud\nscale study in England, UK, indicates the ways in which some middle leaders have tried to build\\ud\nlearning communities, and their colleagues views on their efforts, while negotiating the value-laden\\ud\ntensions and dilemmas inherent in all middle management posts in educational organisations","downloadUrl":"http:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/03054980500222221","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/1016\/1\/article%20%26%20BERA%202003%20-%20The%20Project%20of%20the%20other%20v2.pdf","pdfHashValue":"1843a08052ee6a677642441bd00e849e03817862","publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/1016<\/identifier><datestamp>\n                2015-02-20T02:01:16Z<\/datestamp><setSpec>\n                com_2381_428<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_4676<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe Project of the other: Developing inclusive learning communities in schools<\/dc:title><dc:creator>\nBusher, Hugh<\/dc:creator><dc:description>\nThis paper considers the possible nature and membership of learning communities in schools and\\ud\nwhat evidence there may be of middle leaders trying to develop and sustain learning communities\\ud\nwith their colleagues, even though these communities encompass asymmetrical power relationships\\ud\nbetween members. Although it is argued that students and support staff are part of these learning\\ud\ncommunities, not apart from them, the limited evidence from this study does not support this. How\\ud\npower is used and distributed to construct collaborative cultures, and the part played by middle\\ud\nleaders, is central to the development of a learning community. The promotion of dialogue and\\ud\nconsultation amongst members helps them to generate a sense of community which, in turn, enables\\ud\nthem to tackle effectively the tasks and dilemmas facing them. Empirical evidence from a small\\ud\nscale study in England, UK, indicates the ways in which some middle leaders have tried to build\\ud\nlearning communities, and their colleagues views on their efforts, while negotiating the value-laden\\ud\ntensions and dilemmas inherent in all middle management posts in educational organisations.<\/dc:description><dc:date>\n2009-12-08T16:27:14Z<\/dc:date><dc:date>\n2009-12-08T16:27:14Z<\/dc:date><dc:date>\n2005<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nOxford Review of Education, 2005, 31 (4), pp.459-477<\/dc:identifier><dc:identifier>\n0305-4985<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/03054980500222221<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/1016<\/dc:identifier><dc:identifier>\n10.1080\/03054980500222221<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nArchived with reference to SHERPA\/RoMEO and publisher website. The Version of Record of this manuscript has been published\\ud\nand is available in Oxford Review of Education 2005 http:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/03054980500222221<\/dc:rights>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0305-4985","issn:0305-4985"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2005,"topics":[],"subject":["Article"],"fullText":"Learning communities in schools \/ 2003   1 \nThe Project of the other: Developing inclusive learning \ncommunities in schools  \n \n \nHugh Busher, School of Education, University of Leicester \n \n \n \n \nAcc by Oxford Review 31 (2) 2005\nLearning communities in schools \/ 2003   2 \n \n \nThe Project of the other: Developing inclusive learning \ncommunities in schools \n \n \nAuthor’s note \nDr. Hugh Busher, a senior lecturer in the School of Education, University of Leicester, has research \ninterests in leadership and organisational culture, change processes and micro-politics, teacher \nprofessional development and the creation of inclusive education.  He is a council member for the \nBritish Educational Research Association \n \n \n \n \nEstimated word length: 7640 ex-references, and end papers \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAddress for Correspondence: \n \nDr Hugh Busher, School of Education, University of Leicester, 21 University Road, Leicester, LE1 \n7RF, UK.  Tel: +44 (0)116 252 3688; fax: +44 (0)116 252 3653  \nemail: hugh.busher@leicester.ac.uk   \nLearning communities in schools \/ 2003   3 \n \nThe Project of the other: Developing inclusive learning \ncommunities in schools \n \n \n \nAbstract \n \nThis paper considers the possible nature and membership of learning communities in schools and \nwhat evidence there may be of middle leaders trying to develop and sustain learning communities \nwith their colleagues, even though these communities encompass asymmetrical power relationships \nbetween members. Although it is argued that students and support staff are part of these learning \ncommunities, not apart from them, the limited evidence from this study does not support this. How \npower is used and distributed to construct collaborative cultures, and the  part played by middle \nleaders, is central to the development of a learning community. The promotion of dialogue and \nconsultation amongst members helps them to generate a sense of community which, in turn, enables \nthem to tackle effectively the tasks and dilemmas facing them. Empirical evidence from a small \nscale study in England, UK, indicates the ways in which some middle leaders have tried to build \nlearning communities, and their colleagues views on their efforts, while negotiating the value-laden \ntensions and dilemmas inherent in all middle management posts in educational organisations. \n \n \n \nLearning communities in schools \/ 2003   4 \nIntroduction \n \nThis paper arises out of a small scale research project that explored how members of subject and \npastoral departments in some secondary schools worked, and the part that middle leadership, a role \nthat can be defined in a variety of ways depending on the nature of the department (Busher and \nHarris, 1999), played in that. The term middle leadership is used through out this paper in part to \nindicate the commonality between the work of departmental leaders, whether they are responsible \nfor and to subject departmental colleagues and students or pastoral departmental colleagues and \nstudents, and in part to avoid long winded phrases.  \n \nOne conceptual framework for understanding the dynamic interactions that took place in the subject \nand pastoral departments is the notion of professional learning communities. Clark (199x: 28) \nperceived communities as social systems which have a purpose, the members of which fulfil a \ndiversity of roles within a recognisable and sustainable collectivity. Senge (1990) perceived \nlearning communities as sites where people expand their capacities to work in new and creative \nways through working together, a not unreasonable description of what takes place in schools.  \n \nThis raises a question about who has membership of a school or professional learning community. \nIn many departments in secondary schools not only teachers have membership of them, but support \nstaff, too. Indeed earlier research by Busher and Saran (1995) suggests that support staff play an \nimportant part in the construction of a school as an organisation or community – Sergiovanni (1994) \nteases out the important differences between these two perspectives - and are an integral element of \nmany departmental teams (Busher and Blease, 2000). Further, an organisational perspective on \nschools and other institutions draws a clear line between things and people (Giddens, 1979). As \nGreenfield (1993: 103) points out, ‘organisations are accomplished by people and people are \nresponsible for what goes on in them’. If this framework is pursued then students or pupils also \nhave to be included within the notion of a learning community in schools, since they are people \nwithin the corporation of a school, not objects that are the constructions or outcomes of it or, \nindeed, its customers as the arguments for applying total quality management to schools maintain \n(West-Burnham, 1992).  \n \nThus to talk of learning communities in schools, one has to encompass all the potential members of \nit. Linstead (1993) suggests that ethnographic interest in multiple voices in organisations is part \nepistemological and part ethical (p.53). These include the support staff and their middle leaders, \nteachers, students and their carers or parents – although the extent to which parents can be said to be \npart of a school organisation is debatable (Gray, 1991) – as well as school governors, and teachers \nin various promoted posts such as departmental leaders, assistant headteachers, and headteachers or \nprinciples. Students do the work of creating knowledge through their learning and the teachers, \nsupport staff and parents or carers lead, manage and support them in this activity. Within a school \nstudents have considerable impact on the construction of its culture (Marsh, 1997; Busher and \nBarker, 2003), whether or not they are commonly included in discourses about professional \ninteractions in schools and whether or not they are conventionally marginalised from discourses \nabout school organisational process and construction by being labelled customers or learners, or \ndehumanised as school outcomes in league tables of school performance. Linstead (1993: 59) \ndescribes this as students helping to write the texts of schools, perceiving the construction of \norganisations as an intertextual process that takes place between the authors and actors of it and in \nit. It raises questions about how students’ acute awareness of the processes of schooling and the \nmany insights they have of them (Rudduck et al, 1996; Rudduck and Flutter, 2000) can be heard \nand acknowledged by staff at all levels in order to contribute positively to the development of a \nschool. It also raises questions about how staff, especially senior staff, are constrained by the \nLearning communities in schools \/ 2003   5 \ncultures in which they find themselves working. Bottery (2003) also rejects the notion of learning \ncommunities being exclusive on grounds of race, religion, or finance. In these circumstances to \nlabel learning communities as ‘professional’ seems at best confusing and at worst an indication of \nsome covert exclusivity - restricted to the professional members of a school, presumably the \nteachers, although some other staff might claim membership, too. It also risks ignoring the needs all \nmembers of a school have for support in developing and reflecting on relevant work-related skills, \nknowledge and processes of interpersonal relationships. \n \nThis raises three questions then: What is the nature of a learning community? What is the nature \nand distribution of power within a learning community? How are the values and culture that \nunderpin the sense and notion of community and the ways in which power and influence are used \naffect the ways in which teachers work with each other and with others. \n  \n \nSo, what is a learning community? \n \nLearning communities can be as large as a whole school or as small as a classroom, or a subject \ndepartment or pastoral area in a secondary school in England and Wales. It is where a group of \npeople are trying to learn together, although that does not mean that all have equal power to direct \nor shape that learning process. Senge (1990) perceived learning communities as sites where people \nexpand their capacities to work in new and creative ways through working together. Smylie (1994) \nthought they have collaborative cultures, allowing teachers to work interdependently to promote \nstudent learning. Louis et al (1996) point out the importance of members sharing values and of \nreflective dialogue to improve practice. It implies a culture of trust between members (Blase and \nBlase, 1994) that allows them to take risks, perhaps through sharing ideas and receiving \nconstructive feedback from colleagues. Such a culture allows teachers, support staff and students to \ntackle complex problems as effectively as possible (Hargreaves, 1994) by building on existing \nexpertise, pooling resources and providing each other with moral support. It revolves around social \nvalues that emphasise an awareness of others and is a key part in developing the distinctive \ncollaborative cultures of learning communities (Wallace et al, 1997). \n \nThe characteristics of effective schools and departments (Sammons et al., 1997) and of the cultures \nof improving schools claimed by Stoll and Fink (1996) point to synergies between successful \nlearning communities and high achievement, not to a conflict between the two. At the core of both \nlies the nurturing of others to promote learning which has been put forward as one of the main \npurposes of schooling (Cooper et al, 2000), especially in Primary schools (Nias, 1999). Central \ngovernment legislation in England and Wales recognises the importance of this by emphasising the \nsocial and emotional development of students alongside academic achievement (Dearing, 1993). \nHowever many aspects of current central government education policy in England and Wales \ncontradict this, emphasising a narrow academic attainment as the only measure of students’ success \nthrough, for example, league tables, OFSTED reports, and literacy and numeracy hours. \n \nThe development of school learning communities is in part shaped by their leaders and managers at \nall levels and in part by the members of them. Their collaborative cultures develop through people \nworking together.  Although fostered by leaders at various levels in an organisation through \nmodelling particular values in their interpersonal relationships and engaging in rigorous reflection \non the values they espouse and enact (Schon, 1987), these also develop through the ways in which \ndifferent members of these communities choose to interact with each other to reflect their personal \nsocial values. However only managers by definition have authority that arises from their formal \nposts in the organisational hierarchy of a school or college (Gronn, 2003), although other people \nLearning communities in schools \/ 2003   6 \ncan also gain access to power (Busher, 2001). They use this to implement various policies and \npractices through working with other people in diverse ways to project a vision of how the school or \nan aspect of it should develop. Having awareness of and sympathy with the social, emotional and \nwork-related needs of staff colleagues and students helps leaders and teachers to implement policy \nand practices more successfully (Blase and Blase, 1994) in a western anglo-phone culture. To some \nextent this awareness may depend on who they are as people, their personhood (Aubrey et al 2000), \nand the values they project through that, in other words on the identities they have constructed for \nthemselves in their past and present interactions with other people (Giddens, 1991).  \n \nPart of that awareness of others concerns the differentiated access to power and authority that \nmembers of learning communities have, and of the impact of social and policy contexts inside and \noutside school on their work, and how that shapes their relationships with each other. Smyth et al \n(2000) point out that teachers in developing their work-related identities ‘have to contend with the \npower relationships that operate in schools and educational systems’ (p.149). Howard and Gill \n(2000) point out that even young children develop understandings of power and powerlessness from \ntheir experiences at home and school. Bottery (2003) points out that vigorous learning communities \ninevitably invite their members to develop critical perspectives of the impact that external social, \norganisational, political and economic contexts have on the ways in which they work and would \nlike to work. Not only middle leaders or school level managers, such as school principals, have \naccess to a variety of sources of power and authority (Busher, 2001), but teachers do too (Bourdieu \nand Passeron, 1977). Students and parents also have power that they may exercise legitimately, if \nonly through resistance to policies (van der Westhuisen, 1996) when their views and interests are \noverlooked.  Hoyle (1981) points out how teachers can exert power over head teachers, and students \nand parents can use the same strategies over teachers.  \n \nHow access to these sources of power is used affects the relationships between middle leaders and \ntheir colleagues and shape the decisions that are taken and the ways in which they can be \nimplemented. Middle leaders using power with or through people (Blase and Anderson, 1995) tend \nto enable colleagues and students to enhance their positive work-related identities and engage \ncollaboratively with their work. If power is used manipulatively rather than facilitatively then \nleaders are likely to promote corporatism (Tannenbaum and Schmidt, 1973), however soft the \nmeans they may be using, and cynicism amongst staff about consultative processes (Busher and \nSaran, 1992). It suggests that leaders who wish to promote learning communities have to act as \nservant leaders (Murphy, 199x) or possibly as social architects to distribute power amongst \ncommunity members and facilitate individual and collective development. Teachers working with \nstudents face the same situation. Gunter et al (2001) point out that teachers are leaders in the \nclassroom who guide and manage the learning processes.  \n \nUsing power to improve working practices has a moral dimension as well as an instrumental one, as \nRibbins (1999) points out, since all choice making involves permitting some events to happen at the \nexpense of others and this choice is rooted in the implicit and explicit values of the choice makers. \nSchools and classrooms are sites for debating and developing particular values as well as conduits \nthrough which they can be transmitted. Fullan (2003: 3) suggests that moral purpose is at the heart \nof the role of public schools in democratic societies, and sees moral imperatives operating at every \nlevel within a school because the intention of schooling is to benefit students in terms of desirable \nidentifiable goals and particular cultures of social and production relationships in which are \nembedded certain values, whether or not these are clearly articulated. Hodgkinson (1999: 8) argues \nthat leaders cannot ignore these values and there impact on social relationships and working \npractices. Hargreaves (1994) suggests that to construct successful teaching and learning these \nvalues are those of teachers working collaboratively with each other and with other people who are \nLearning communities in schools \/ 2003   7 \nnot teachers. Hopkins (2001) argues that this depends on teachers developing authentic \nrelationships and fostering social cohesion. Such arguments apply equally to how all staff in a \nschool might work together and with students and their carers, even though the latter relationships \nencompass strongly asymmetrical power differences. The extensive literature on effective \nclassroom leadership by teachers, for example, Wragg et al (2000) and Cooper and McIntyre (1996) \npoints to exactly the same quality of relationships being needed in classrooms, at least in England \nand Wales. \n \n \nResearch study \n \nWhile acknowledging this broad construction of the notion of learning communities in schools, the \nresearch on which this paper is based focused on the development of learning communities amongst \na subset of this broader learning community, that of the teaching staff in some pastoral and subject \ndepartments in some secondary school in the midlands of England, UK, in 2001\/02. In particular it \nfocuses on the work of some subject and pastoral leaders, following the work of Measor and Sikes \n(1992). Siskin (1994) points out that subject areas are critical sites for developing teachers’ \npractices. As the study included subject and pastoral leaders, the term middle leader is preferred \nexcept where indicating a person’s particular status. The study used an interpretative approach to \nexplore how people constructed and construed meanings in their social situations, following \nRibbins (1997) view that is only by listening to people’s voices that one really finds out what it is \nlike to be and to work in an institution like a school.  \n \nThe study focused on six middle leaders (three men and three women) in their secondary school \ncontexts who were observed in action and interviewed about their practice. They were selected \nopportunistically from among schools and departments that regularly have PGCE students on \nplacement with them. They came from a variety of different sized departments, following the views \nof Busher and Harris (1999), including two pastoral departments (Sixth Forms); a history \ndepartment; a humanities faculty (including history, geography and RE departments); and an \nEnglish department. I also interviewed their departmental colleagues (10 in all:  four men and six \nwomen) and senior staff (four men and one woman) about their work. Their colleagues were found \nby snowball sampling to minimise ethical problems of talking with people about others without \npermission, and because it was an expeditious means of finding such participants. The triangulation \nof middle leaders’ views of their work with that of staff colleagues was intended to strengthen the \nauthenticity of the study by addressing doubts about the trustworthiness of single authored texts \n(Thomas, 1995). It allowed me to check their espoused theories of practice against their enacted \ntheories (Schon, 1987). However in this paper it is mainly the middle leaders’ voices that are heard. \nAll the interviews were semi-structured, as were the observations of middle leaders working with \ncolleagues and with students and teaching in classrooms. In addition relevant documents about each \nschool and department were collected.  \n \nThe views that emerged from middle leaders and their staff colleagues were remarkably \nhomogeneous, but this may be explained by the way in which the sample was constructed. The \npaper does not seek to establish or suggest any predictive generalisations from the study’s findings, \nmerely to report what was found in these six departments. \n \n \nEvidence of the project of the other: building learning communities \n \nLearning communities in schools \/ 2003   8 \nHow middle leaders and their colleagues interacted to operate departments and construct \ndepartmental cultures emerged under four sections: one focusing on middle leaders’ instrumental, \ntechnical and political activities to implement the curriculum; a second focusing on middle leaders’ \ninterpersonal relationships with colleagues; a third focusing on middle leaders as curriculum leaders \nfacilitating students’ learning; and a fourth focusing on middle leaders’ reflections on practice. \nWhatever the focus actions were underpinned by values that were often clearly articulated and \nhelped shape departments’ cultures. The tensions and contradictions between values in some actions \nwere often acknowledged. \n \n \nSection One: Instrumental, technical and political activities in policy contexts \n \nFunctionalist perspectives on school management would probably describe the following \nperspectives under the term boundary management, but that term seems to under estimate the pro-\nactivity of middle leaders in this study in this aspect of their work, and obscures the ways they \ninteracted with different contexts, particular the external contexts of government policy and \npressures from communities in the schools catchment area, as compare with the internal contexts of \nsenior school management policy. \n \na)  Middle leaders’ perspectives on working with external and internal policy contexts \n \nMiddle leaders recognised that their work and professional relationships were bounded and \ninfluenced by national government education policy, be it the National curriculum: \n \nI would quite happily [only] talk about rain forests coasts and rivers … but the National \ncurriculum also says I have to do settlement, population, development (female subject \nleader) \n \nOr new imposed management processes: \n \nQuite a lot of people are not very happy about doing performance management but \nrecognise that … it is a hoop that they have to jump through (female subject leader) \n \nTheir work with colleagues and students was also affected by the local communities in which their \nschools were located: \n \nThe main problem is [students saying] ‘I am not part of this religion. My dad says I don’t \nhave to do this. So I am not going to learn it’ … I don’t know what sort of programmes they \nwatch at home (male subject leader) \n \nMiddle leaders showed an acute awareness of the distribution of power and the hierarchy of \nauthority in schools. They acknowledged the legitimacy of the senior management team (SMT) to \nmanage the school strategically: \n \nBasically the school will layout what areas they want covered on the school improvement \nplan … I will have six sections to fill in with the headings laid down by SMT and then we \nwill have a humanities section (female subject leader) \n \nBut acknowledge the power wielded by SMT through acting as gatekeepers to resources: \n \nLearning communities in schools \/ 2003   9 \nI have always been very well supported by SMT in the budget. Provided you could justify \nwhat you wanted, they would support that if possible … But there have been occasions \nwhen I have come into loggerheads with SMT (female subject leader) \n \nMiddle leaders regarded themselves as intermediaries between the SMT and their departmental \ncolleagues, both representing their and their colleagues’ views to the SMT, as well as acting as \nagents of the SMT. As the latter they tried to persuade colleagues to acquiesce to SMT policy, albeit \nwhile trying to help colleagues gain ownership of the processes of its implementation: \n \nBut I act as the lynch pin and also as the person who feeds to the department the aims of the \nschool … and how we can bring those aims down through into the department and in to a \nclassroom level (female subject leader) \n \n \nb) Middle leaders facilitating action  \n \nMiddle leaders projected power to implement value-based collaborative management of \ndepartments. They claimed they had the delegated authority from SMT to manage their departments \noperationally.  \n \nI think that as a subject leader and middle manager … I have very clear expectations of what \nI want from the faculty and I am very much prepared… to stand up for what I believe in … \nSometimes what I want is reasonable but may be the department [staff] don’t agree. The \nbottom line is I am the head of faculty and this is how we are going to do it, like it or not, \nand if you have a problem with it you will have to take it higher (female subject leader) \n \nHowever they also believed they had to have the consent of their colleagues if they, as middle \nleaders, were to implement decisions about the curriculum successfully. This took the form of \nlistening to colleagues’ perspectives on how policy might be implemented, especially when that had \nbeen imposed by senior management – as emerged in a department meeting that was observed – and \nin acknowledging colleagues’ preferences as far as possible: \n \nThe underlying principle … will be to give staff as much as possible what they want … \ncertain staff … specifically enjoy teaching the older students (male subject leader) \n \nAnother major source of authority, the middle leaders claimed, when trying to manage their \ndepartments was the ability: \n \nto be a proven classroom teacher … If you can show that to colleagues through the response \nof the students that you teach (male subject leader) \n \nObservational data showed that the middle leaders in this study were effective teachers. \n \nTo manage their departments successfully, the middle leaders thought it important to encompass \nvarious elements. One of these was to have a strategic vision for their departments that they could \nimplement with their colleagues: \n \nIt is up to me as subject leader to know where the department is going, to have the vision for \nwhere the department … and to think about the steps to achieve that, but then to work with \n[colleagues] … to move the department on (female subject leader) \nLearning communities in schools \/ 2003   10 \n \nA second was to provide physical and intellectual resources to facilitate the work of their \ncolleagues:  \n \nIt is no good asking [teachers] to do a group exercise if the resources are not there for them \n… trying to share ideas, mainly through schemes of work, putting teaching methods down, \nfor example. But also just being there when people come along and say ‘have you got any \nideas?  What about this? (female subject leader) \n \nA third was to co-ordinate their departments effectively through centralised administrative systems \nwhich middle leaders monitored: \n \nWe have central resources and common schemes of work, common assessment, common \n[student] records that we put on to excel that can be monitored to see how different classes \nare doing and that staff are meeting deadlines (female subject leader) \n \nA subset of this was managing curriculum materials effectively. Stock cupboards in several \ndepartments held neatly labelled boxes of resources and teachers were expected to return resources \nthey had borrowed at the end of every lesson to them. \n \nA fourth was to take decisions about resources in a transparent and principled way. The educational \nvalues they proclaimed and appeared to enact tended to be more egalitarian than the meritocratic \nones enshrined in national policy and focused inclusively on raising students’ achievements:  \n \nWe would want to spend the money fairly and equally across all the students … Obviously \nwith the National Curriculum … we have to make sure that all the students have got the \nright book allocation and all the other resource allocations (male subject leader) \n \nA fifth was to engage their colleagues in taking decisions about managing the departments by \nactively consulting with them through formal channels of timetabled meetings and informal \napproaches: \n \nBut the actual real running takes place constantly through out the day, breaks, lunchtimes \nand during lessons … it is done informally through conversations in here [humanities office] \n… wander into each other’s lessons [to] pass on information in that way (male teacher) \n \nMiddle leaders expressed concern when some members of a department were not easily accessible \nfor consultation:  \n \nOne of the guys is on a different corridor and that is a problem because I don’t see him very \nmuch and his head of subject doesn’t see him very much … I think that has had an effect on \nhim and how he feels as part of the department (female subject leader) \n \nHowever one subject leader claimed not every teacher wanted to be involved in consultation: \n \nThey don’t really take much part in decision-making processes. I ask for consultation, but \nthey often don’t want to be involved because it involves effort or giving up time. So \ntherefore I make the decisions (female subject leader) \n \nA sixth was to create social cohesion in their departments, as is discussed later.  \nLearning communities in schools \/ 2003   11 \n \n \n \n \nc) Other teachers’ views of middle leaders’ instrumental and political actions  \n \nIn large measure the colleagues of the middle leaders shared their views of how they managed the \ndepartments. Teachers welcomed the ways in which their middle leaders defended and represented \nthem and the department to other staff, especially the SMT. Bradley and Roaf (1995) described this \nas a form of advocacy. \n  \nI had some trouble with the trip to Warwick castle with [SMT] after I had been … and \nlooked round and done the worksheets … [SMT] suddenly said we couldn’t go. [Head of \nfaculty] was straight up there: why? This is what [I] has done, taken one day out of her half \nterm to go there. We have booked the coach, sent out letters [to parents], so why are you \nnow saying we can’t go. [And the trip is now going ahead] (female teacher) \n \nTeachers welcomed middle leaders managing their departments effectively, even if this also \nconstrained their work by creating a corporate framework into which their teaching was required to \nfit: \n \nHe is a very good strategic planner and manager of things … He ensures that targets are \nclear for students and monitors how far students are achieving their targets … checks with \nother [people] about the strategies we are using to improve [students’ work] … So \neverybody knows exactly when things need to be done, what is involved, and how to do it \n(female teacher) \n \nWhen asked to clarify what aspects of effective management they liked, teachers signalled they \nliked being involved in decision-making, but preferred informal processes of consultation to the \nmore formal. \n \nWe have a formal briefing every Thursday morning and then we have a faculty meeting \nonce every four or five weeks … after school for an hour. But the actual real running takes \nplace constantly through out the day (male teacher) \n \nThey commented adversely when they were not involved. \n \nTeachers welcomed the provision of resources to support their work, whether this took the form of \nmiddle leaders providing support through reference to their position-derived authority: \n \nHaving a problem with one of my students … and then [subject leader] … put him on \nfaculty report and then monitored this student – sent a letter home, spoke to this student after \nlesson (female teacher) \n \nor knowledge and information about organising the curriculum and coping with the school system, \n \n[Head of faculty] has this very good knowledge of how things work and who to approach … \nthe right people to go and talk to and in what order … She has given me INSET on writing \nschemes of work (male teacher) \n \nLearning communities in schools \/ 2003   12 \nor physical and intellectual resources for the curriculum.  \n \n \nSection Two: Interpersonal relationships between middle leaders and their colleagues \n \na) Middle leaders views \n \nMiddle leaders held remarkably homogeneous views about what constituted effective working \nrelationships the teachers, but acknowledged that they had to work with different individual \nteachers in different ways within this conceptual framework. Several thought that working \neffectively with colleagues was the hardest part of their job. Although most of the middle leaders \nwere very complementary about their colleagues, especially in departments where they had worked \ntogether for a considerable number of years:  \n \nvery lucky to have a very good set of English teachers whom I trust implicitly to do the job \n… It still means I have to have an overview of everything to make sure the job is being \ndone. (male subject leader) \n \nthey recognised that some of their colleagues were not so engaged. One subject leader of a small \ndepartment described her colleagues as ‘tired teachers’ who did not want to get involved in \ncurriculum development: \n \nTheir job is to teach … deliver the curriculum …structured by me in my head of department \nrole. Otherwise they have to answer to me or someone above me … With a different \ndepartment I would like to think things could be much more forward thinking (female \nsubject leader) \n \nOne aspect of the process of working successfully with colleagues they thought involved generating \nsocial cohesion with their colleagues, at least in the context of the work place, despite the inevitable \nprofessional disagreements. \n \nsocially as a team, although we are so diverse, we chat in the staff room. At the end of term \nwe have a faculty meal either in school or we go out. Some of the faculty go to the pub on a \nFriday, not every week. Other members go at different times (female subject leader) \n \nAnother aspect involved how they perceived their relationships with their colleagues and projected \ntheir authority and power with them. They perceived themselves as the first among equals, the \nprinciple of cabinet government in Britain, not as part of a separate management cadre: \n \nwithin your subject area it has to be a team … that works together. I … [take] a lead in terms \nof developing schemes of work, of monitoring standards, and discussing ideas within the \nteam. The team contribute to that … The subject leader gives suggestions as to what should \nhappen… so the team can share that and have ownership of that (male subject leader) \n \nIt led one middle leader to assert that he did not ‘think personally there is much of a difference’ \nbetween being a teacher and a subject leader and considered ‘the priority is being a classroom \nteacher’. \n \nThis person-oriented approach to management acknowledged the professional and personal needs \nand interests of teachers who worked in the middle leaders’ departments: \nLearning communities in schools \/ 2003   13 \n \nI don’t see any reason in asking or making staff teach groups or year groups they don’t want \nto ... If the staff are happy in teaching the groups … that will benefit the students (male \nsubject leader) \n \nand to value being part of a forward looking learning community based on clearly articulated values \n \nWe have not thought that we have been in the job so long that we have nothing to learn. I \nthink sometimes we are still uncertain about our capabilities … we do not want to let the \nstudents down. So we have this shared ethos … do primarily the best for the students (male \nsubject leader) \n \n \nb) Other teachers’ views of middle leaders’ social and interpersonal relationships \n \nTeacher colleagues of the middle leaders thought the personhood of the middle leader very \nimportant: \n \nHe is a very easy person to work with … You [work] because you respect him … He is a \nvery approachable man …[ a good] sense of humour … He will help out if things are going \nwrong … He is friendly. And you know that he is putting in as much effort as you are \n(female teacher) \n \nAnd recognised it helped to construct particular departmental cultures:  \n \nThere is this atmosphere around the place that is very nice to be in … [head of faculty] is  … \nvery good at team building … at delivering criticism with a smile … it is just a sum of her \npersonality traits … It is very different to how it was … under the previous head of faculty, \nwho was verging on going into senior management and was slightly older, so gave us a \nslightly different atmosphere (male teacher) \n \nThey appreciated being valued for the work they did as well as for who they were: \n \nHe will always look for ways of making your job easier … tries to give us that sense of our \nimportance in the whole system, and that we are valued … People need to feel valued for \nwhat they do (female teacher) \n \nThis social cohesion helped departments to work together, even when members of it had work-\nrelated disagreements: \n \nRelationship between the faculty are generally very good. We obviously have our spats now \nand again but overall… [We] are all fairly young and quite happy to go out and socialise … \nThe other members of the faculty in a social sense tend to be alienated, but not so much in a \nprofessional sense (female teacher) \n \nSurprisingly, gender as factor was only referred to twice, once as a stereotype: \n \nlike a lot of young female managers, they have got a point to prove and there is an agenda of \npromotion … often things are decided on with a career in mind rather than necessarily the \nLearning communities in schools \/ 2003   14 \nfaculty … she is quite friendly and quite nice as a person … [She gets] what she wants with \nthe kids (male teacher) \n \nand once as a significant factor in developing a departmental sub-group: \n \n[We] are all fairly young and quite happy to go out and socialise … that tends to have gelled \nus together. [male teacher] does not socialise with us so much – we tend to do girlie things – \nbut in terms of the Friday lunch and sitting around chatting, he is there as well (female \nteacher) \n \n \nSection Three: Facilitating students’ learning \n \nMiddle leaders’ views and actions for constructing cohesive departments with staff were echoed in \ntheir work with students.  \n \nI think the fact that we have this trust in the [students] to time manage and always be on top \nof their work comes from the way [head of sixth form] is with them … trusting them, but \nbeing there if there is a problem, and being stricter with them to sort something out … he is \nthe same with staff (female support staff) \n \nIn the classroom, too, they signalled a clear vision or purpose, often writing lesson objectives on the \nboard as well as mentioning them orally, showing how one lesson fitted with another. They then \nengaged inclusively with students to support their work and meet students’ learning needs for work-\nrelated knowledge and skills. The teaching and learning was managed effectively to:  \n \nmake my subject accessible to all students so that they are engaged in history and not turned \noff by it … have a variety of teaching styles that apply to different learners. Some get a real \nkick out of writing reams and reams … [others] are more into hands on learning, like games, \nand that sort of thing, discussion work, card activities, where the emphasis is not so much on \nthe writing… but they are still learning history (female subject leader) \n \nHowever this was no coldly instrumental process but a passionate one. Middle leaders recognised \nthe importance of projecting their and their colleagues’ enthusiasm for their subjects and activities. \nOne talked about wanting to have ‘dynamic teachers’ and perceived the generation of this as her \nmain aim as a subject leader. Several others lauded their own teachers who had been enthusiastic \nabout their subjects. They also recalled those pedagogic practices and modes of relating to students \nby their former teachers that they now studiously eschewed because of the damaging effect these \nhad had on their own perceptions of subjects. Through their teaching they wanted to ensure: \n \nall students being able to achieve something, and actually encourage students to develop \ntheir strengths (female pastoral leader) \n \nas well as to think critically about their work intellectually and morally \n \nI don’t … push any particular religion … the two Attainment Targets: Learning about \nreligion; and what we can learn from religion … I try to encourage … tolerance, so even if \nthey don’t like the ideas they don’t just right it off as rubbish (male subject leader) \n \nLearning communities in schools \/ 2003   15 \nEmbedded in their pedagogy were certain values. One of these was demonstrating care for students’ \nwell being through creating high quality resources for them: \n \nkids need to know you care, that you have taken care in making the worksheets … so they \ncan feel that someone is bothered and therefore they will be bothered (female subject leader) \n \nAnother was valuing students as people. ‘Kids need to be happy to learn, I think’, said one middle \nleader, while others talked approvingly about those teachers who had valued them when they were \nstudents. This was most clearly summed up by one middle leader as: \n \nacknowledging students as individuals and then identifying those areas and encouraging \nthem to develop … [exam success] is important, and students certainly see that … but I \nthink it is … how [students] stretch themselves individually, rather than being focused on \n[grades] all the time (female subject leader) \n \nThey were concerned to help students develop as social beings: \n \nIf you succeed at whatever level you are capable of, it will help to prepare you for whatever \nyou go on to … [and] into your relationship to others … it is the process of getting [the \nresults] and hopefully the personal and intellectual skills that they develop through that \n(male subject leader) \n  \n \nSection Four: Middle leaders’ reflections on practice \n \nMiddle leaders’ reflected on their experiences and biographies to explain the educational values and \nviews that influenced their actions. These experiences were located as often in their lives at home as \nin their lives as students in school or at university. Less often they referred to events outside these \narenas which had been formative in some way. One particular vein of experiences on which they \ncommented was the importance of receiving support at various times from more senior people, \nusually in their schools, who sponsored their career advancement. This shows the importance of \nsenior staff using their access to power to sponsor more junior staff by offering or encouraging them \nto take opportunities, or by denying them such support. Another vein was the impact of their social \nlives on their work or career choices. The world of work was not perceived as an island isolated \nfrom the rest of their lives but as part of the fabric. The demands from it had to be balanced against \ntheir social and family commitments as they tried to shape their work-related identities as middle \nleaders. A third vein was the centrality of working with people of all ages and statuses and trying to \ntake cognisance of their needs while leading and managing a subject or pastoral area successfully, \nexposing the tensions between agency and structure and those between the needs of individuals and \nthe corporation of the school. \n \n \nCompassionate leaders constructing collaborative learning communities \n \nThis study gives a view of schools and departments as strongly managed centrally by their \nappointed leaders, reflecting the way in which schools as a whole are managed centrally by and \nthrough central government policies in England and Wales, what ever claims government makes for \nthe devolution of control of schools under its scheme of local management (1988). Such constraints \nseem to reverse Weick’s (1976) notion of schools as loosely-coupled organisations. Yet teachers in \nthis study, despite these managerialist constraints, seemed to have establish a form of collaborative \nLearning communities in schools \/ 2003   16 \npractice which had many of the hallmarks of developing learning communities, albeit ones in which \npower was distributed unequally. In part this was because the middle leaders held core values that \nwere communitarian rather than individually competitive and used their access to power, including \nthe authority of their office (Watson, 1969) which arose through the leadership distributed to them \nby senior staff (Gronn, 2000), to foster staff engagement with decisions and changes in practices to \nimprove teaching and learning. In return they gave staff on-the-job work-related development, when \nasked for it, which fostered critical reflection on practice.  \n \nThe construction of a sense of community in these departments was fraught with tensions and \ncontradictions. A key element seems to have been middle leaders’ concerns with developing \ncolleagues’ senses of self and of agency (Giddens, 1991, 1984) through fostering participation in \ndepartmental decision-making and individual pedagogical initiatives within the framework of \ndepartmental policy. On the other hand the middle leaders were passionately concerned to meet the \nneeds, as they perceived them, of the students for whom they were responsible. Achieving the latter \ninvolved an on-going struggle to improve the quality of teaching and learning despite and because \nof the macro and institutional policy contexts in which they worked.  \n \nEmbedded in these contexts were sources of power (Busher, 2001; Bennett, 2001) and \nasymmetrical power relationships which affected the relationships between middle leaders and their \ncolleagues and shaped the decisions that were taken and the ways in which they could be managed. \nThus on the one hand middle leaders tried to create collaborative cultures through a commitment to \nvalues of improving teaching and learning and facilitating personal and work-related development \namong the members of their departments, students and teachers alike. They tried to construct \nconsultative decision-making with their staff colleagues, by using formal and informal channels of \nnegotiation, and to generate social cohesion in their areas through the quality of their interpersonal \nrelationships with colleagues. They were compassionate leaders. Some teachers resisted their \nefforts, perhaps through not wanting to change their long-established ways of working and \ninteracting with colleagues, but many teachers welcomed their efforts, and students were observed \nto appreciate their manner of working in lessons. \n \nOn the other hand pressures in the institutional contexts as well as middle leaders own educational \nvalues led these leaders to require staff to carry out various procedures, the implementation of \nwhich they monitored, even if the need for and processes of implementation had been negotiated \npreviously with staff colleagues to gain their consent. Procedures included checking stock in and \nout of rooms; recording student assessments; and implementing senior staff policies and middle \nleaders’ visions for their departments. Middle leaders justified using such coercive practices to \nmanage their departments by an appeal to core educational values - enhancing student opportunities \nfor learning - and pragmatic concerns with the pressures of external and internal policies on \ndepartmental practice.  \n \nAlthough at one level these tensions and asymmetrical relationships made visible the collaborative \nrather than the collegial nature of the culture in the departments (McGregor, 2000), it also illustrates \nthe balancing act these middle leaders had to perform, weighing principle against the harsh realities \nof power. They had to be astute politicians to survive successfully, and not merely operationally \noriented functionalist managers. What is surprising is that the professional cohesion of the \ndepartments does not seem to have been shaken by such actions by the middle leaders. It is argued \nthat in part this was because their colleagues in the departments viewed such activity as legitimate \nwithin the hierarchical organisation of a school, and in part because the supportive nature of middle \nleaders’ interpersonal relationships with colleagues helped to sustain it, a conclusion in line with \nresearch reported by Blase and Blase (1995). \nLearning communities in schools \/ 2003   17 \nThe extent to which the collegial cultures associated in theory with learning communities existed in \nthese departments, then, is questionable because some people in the departments had greater access \nto power than others. However, within the framework of the asymmetrical power relationships that \nexisted, collaborative working processes were sustained, focused around core and apparently widely \nagreed values for successful teaching and learning and interpersonal relationships. Consequently the \ndepartments seemed to have functioned as learning communities, encouraging and supporting their \nmembers as they engaged together in tackling the dilemmas they confronted in sustaining \nsuccessful teaching and learning.  \n \nHow membership of learning communities in schools is constituted remains problematic. Although \nstudents’ voices were not recorded in this study, they clearly influenced the processes of lessons and \nof departmental decision-making, but they could not be said to have been members of the same \nlearning community as the teachers. Teachers and middle leaders were concerned to foster student \nlearning and promote warm interpersonal relationships with them within the hierarchical authority \nframework of a school. Perhaps the asymmetry of the power relationships between teachers and \nstudents was too great to allow a meaningful sense of collaboration to develop. Even the few \nlearning support staff and administrative assistants who were observed in this study were not part of \nteachers’ learning communities. The one who was interviewed, seemed to be at best a partial \nmember. This is similar to findings by Busher and Blease (2000) on laboratory technicians in \nsecondary schools. It raises questions about how far inclusive learning communities can be \nconstructed in schools given the hierarchical distribution of power in such organisations which \nframe interpersonal relationships in them. \n \nFrom the foregoing discussion emerge seven indicators by which it might be possible to gauge the \nextent to which learning communities are developing, at least amongst staff, in a school or \ndepartment. However these indicators need testing in a much larger scale study before they could be \nconsidered to have any predictive value: \n \n Responsiveness to internal and external policy contexts: middle leaders as mediators and \nadvocates, helping colleagues to come to terms with the contexts in which they work; \n Emergent facilitative leadership: middle leaders helping teachers and other staff to be \ninvolved with principled departmental decision about the distribution of financial, physical \nand intellectual resources to take forward learning and teaching effectively, while taking \naccount of the personal and professional interests of staff in particular policy contexts.  \n Evidence of values consensus between department members: a visible and broadly \nsupported coherent vision of the purposes and processes of a department that is constructed \nby its members and projected by its leader; \n Evidence of open communications systems, using various formal and informal arenas and \nchannels, through which middle leaders listen to and debate with staff colleagues the \ndevelopment of the department in certain directions generally agreed by its members; \n Development of practice through consultation within particular policy contexts: Middle \nleaders developing changes in practice through discussion with staff on an explicit basis of \neducational values and educational perspectives in a department; \n Development of social cohesion in a collaborative culture that acknowledges the \nasymmetrical distribution of power that is embedded in hierarchical organisations while \nrecognising the common humanity and social needs of departmental members. \n Effective reflexive management: Leaders and members improving practice collaboratively \nthrough monitoring and evaluating practice in the light of an explicit value base for decision \nmaking. \nLearning communities in schools \/ 2003   18 \nIn this study middle leaders seem to have gone some way to constructing learning communities \nwith their staff colleagues, within the constraints of hierarchically organised education institutions. \nBut the cultures that emerged were collaborative rather than genuinely collegial, and were \npredicated on shared and communitarian social and educational values, rather than on market-\noriented individualistic and competitive ones. Although these developing learning communities did \nnot include students, many of their members seemed committed to facilitating the participation and \nengagement of all their students in successful learning and in decision-making about how they \nengaged more or less successfully with the work (curriculum) they had to undertake in order to \npromote their personal and work-related development. \nLearning communities in schools \/ 2003   19 \n \nReferences \n \nAubrey, C. David, T. Godfrey, R and Thompson, L. (2000) Early childhood educational research: \nIssues in methodology and ethics  (London, RoutledgeFalmer) \nBennett, N (2001) Power, structure and culture: An organisational view of school effectiveness and \nschool improvement in Bennett, N and Harris, A (eds) School effectiveness and school \nimprovement: searching for the elusive partnership  (London, Continuum) \nBlase, J. and Anderson, G. L (1995), The micro-politics of educational leadership: From control to \nempowerment (London, Cassell) \nBlase, J and Blase, J (1994) Empowering teachers: What successful Principals do. (Thousand Oaks, \nCa, Corwin) \nBlase, J and Blase, J (1995) The micro-political orientation of facilitative school principals and its \neffects on teachers’ sense of empowerment. Paper given at the (American Educational Research \nAssociation (AERA) Conference, San Francisco, April 1995) \nBottery, M. (2003) The leadership of learning communities in a culture of unhappiness Paper given \nto the ESRC Seminar Series Challenging the  orthodoxy of school leadership: Towards a new \ntheoretical perspective, (National College for School Leadership, UK,  June 2003) \nBourdieu, P and Passeron, J-C (1977) Reproduction in education: Society and culture London: Sage \nBradley, C and Roaf, C (1995)  Meeting special educational needs in the secondary school: a team \napproach  Support for Learning  10, 2, pp.93-99 \nBusher, H (2001) The micro-politics of change, improvement and effectiveness in schools, in \nBennett, N and Harris, A (eds) School effectiveness and school improvement: searching for the \nelusive partnership  (London, Continuum) \nBusher, H and Blease, D (2000) Growing Collegial  cultures in subject departments in secondary \nschools: working with Science staff  School Leadership and Management 20,1, pp.99-112 \nBusher, H and Harris, A (1999) Leadership of School Subject Areas: tensions and dimensions of \nmanaging in the middle, School Leadership and Management 19, 3, pp. 305-317. \nBusher, H and Saran, R (1992) Teachers’ Conditions of Employment: a study in the politics of \nschool management, (London, Bedford Way Series, Institute of Education, University of London \/   \nKogan Page) \nBusher, H and Saran, R (1995) Managing with support staff in H. Busher and R. Saran (eds) \nManaging teachers as professionals in schools. (London, Kogan Page) \nBusher, H and Barker, B (2003) The crux of leadership: Shaping school culture by contesting the \npolicy contexts and practices of teaching and learning  Educational Management and \nAdministration 31, 1, pp.51-65 \nClark, D. (1996) Schools as learning communities: Transforming education (London, Cassell) \nCooper, P. Drummond, M. Hart, S. Lovey, J. and McLaughlin, C. (2000) Positive alternatives to \nexclusion, (London, RoutledgeFalmer) \nCooper, P and McIntyre, D. (1996) Effective teaching and learning: Teachers’ and students’ \nperspectives, (Milton Keynes, Open University Press) \nDearing Commission (1993) The National Curriculum and its assessment: Final Report  (London, \nSchool Curriculum and Assessment Council) \nFullan, M (2003) The moral imperative of school leadership (Thousand Oaks, Ca, Corwin Press) \nGiddens, A (1979) Central problems in social theory (Cambridge, Polity Press) \nGiddens, A. (1984) Constitution of society (Cambridge, Polity Press) \nGiddens, A. (1991) Modernity and self-identity: Self and society in the late modern age \n(Cambridge, Polity Press) \nGray, L. (1991) Marketing Education (Milton Keynes, Open University Press) \nLearning communities in schools \/ 2003   20 \nGreenfield, T. B and Ribbins, P. (1993) Greenfield on Educational Administration (London, \nRoutledge) \nGronn, P (2000) Distributed properties: A new architecture for leadership Educational Management \nand Administration 28, 3, pp.317-338 \nGronn, P (2003) Leadership: Who needs it?  Paper given to the ESRC Seminar Series Challenging \nthe  orthodoxy of school leadership: Towards a new theoretical perspective, (University of \nBirmingham, UK,  February 2003) \nGunter, H., McGregor, D. and Gunter, B. (2001) ‘Teachers as leaders: A case study’, Management \nin Education, 15,1, pp.26-28. \nHargreaves, A (1994) Changing teachers, changing times: Teachers’ work and culture in the post-\nmodern age (London, Cassell) \nHodgkinson, C (1999) The triumph of the will: An exploration of certain fundamental problematics \nin administrative philosophy P. T. Begley, and P. E. Leonard, (eds) (1999) The Values of \nEducational Administration (London, Falmer Press) \nHopkins, D (2001) Improving the Quality of Education for All (London, David Fulton) \nHoward, S. and Gill, J. (2000) ‘The pebble in the pond: Children’s constructions of power, politics \nand democratic citizenship’, Cambridge Journal of Education, Vol.30, No.3, pp.355-378. \nHoyle, E (1981) Management and the school, Block 3, E323 Management Processes in Schools  \n(Milton Keynes, Open University Press) \nLinstead, S. (1993) Deconstruction of the study of organisations in J. Hassard and M. Parker (eds) \n(1993) Postmodernism and organisations (London, Sage) \nLouis, K. Marks, H. and Kruse, S. (1996) Teachers’ professional community in restructuring \nschools. American Educational Research Journal  33  \nMcGregor, J (2000) The challenge of collaboration: What encourages joint working between \nteachers? Paper given at the Sixth quadrennial BEMAS research conference, (Robinson College, \nCambridge, UK, 2000) \nMarsh, M (1997) In conversation with Janet Ouston in, P. Ribbins (ed) (1997) Leaders and \nleadership in the school, college and university (London, Cassell) \nMeasor, L. and Sikes, P. (1992) Visiting lives: Ethics and methodology in life history in I. Goodson \n(ed)(1992) Studying teachers’ lives (London, Routledge)  \nMurphy, J. (1992). The landscape of leadership preparation. (Newbury Park, CA, Crowin Press) \nNias, J (1999) Primary teaching as a culture of care, in Prosser J (ed) School Culture  (London, Paul \nChapman) \nRibbins, P (1997) Leaders and leadership in the school, college and university (London, Cassell) \nRibbins, P (1999) Foreword in   P. T. Begley, and P. E. Leonard, (eds) (1999) The Values of \nEducational Administration (London, Falmer Press) \nRudduck, J. Wallace, G. and Chaplain, R. (1996) School improvement: What can pupils tell us? \n(London, David Fulton) \nRudduck,J and Flutter, J. (2000) Pupils Participation and Pupils Perspective: ‘carving a new order \nof experience’. Cambridge Journal of Education. 30, 1, pp.75-89. \nSammons, P. Thomas, S and Mortimore, P (1997) Forging Links: Effective Schools and Effective \nDepartments. (London, Paul Chapman) \nSchon, D (1987) Educating the Reflective Practitioner: Towards a new design for teaching and \nlearning in the professions (San Francisco Ca, Jossey Bass)  \nSenge, P (1990) The fifth discipline (New York, Doubleday) \nSergiovanni, T. (1994) Building Community in schools.  (San Francisco, Ca, Jossey-Bass) \nSiskin, L. (1994) Realms of knowledge: Academic departments in secondary schools, (London, \nFalmer  Press) \nStoll, L and Fink, D (1996) Changing our schools: Linking school effectiveness and school \nimprovement  (Buckingham, Open University Press)  \nLearning communities in schools \/ 2003   21 \nSmylie, M. (1994) Redesigning teachers work: Connections to the classroom, in L. Darling-\nHammond (ed) Review of research in education (Washington DC, American Educational Research \nAssociation) \nSmyth, J. Dow, A. Hattam, R. Reid, A. and Shacklock, G. (2000) Teachers’ work in a globalising \neconomy (London, Falmer Press)  \nTannenbaum, R and  Schmidt, W (1973) How to choose a leadership pattern  Harvard Business \nReview .51, 3, pp.162-180  \nThomas, D. (1995) Treasonable or trustworthy text: Reflections on teacher narrative studies in D. \nThomas (ed) (1995) Teachers’ stories (Buckingham, Open University Press) \nVan der Westhuizen, P. (1996) Resistance to change in educational organisations  paper given at the \nFifth Quadrennial Research Conference of the British Educational Management and \nAdministration Society, (Robinson College, Cambridge University, UK) \nWallace, R. Engel, D. and Mooney, J (1997) The Learning School: A guide to Vision based \nleadership (Thousand Oaks, Ca., Corwin Press) \nWatson, L (1969) Office and expertise in the secondary school Educational Research, 11, 2, \npp.104-112 \nWeick, K.(1976) Educational organisations as loosely coupled systems, Administrative Science \nQuarterly, 21, 1, pp.1-19 \nWest-Burnham, J. (1992) Managing quality in schools: A TQM approach (Harlow, Longman) \nWragg, E.C., Haynes, G.S., Wragg, C.M. and Chamberlin, R.P. (2000) Failing Teachers?  \n(London, Routledge) \n  \n \n"}