{"doi":"10.1136\/bmj.326.7390.649","coreId":"66065","oai":"oai:dro.dur.ac.uk.OAI2:3374","identifiers":["oai:dro.dur.ac.uk.OAI2:3374","10.1136\/bmj.326.7390.649"],"title":"Medicine, management, and modernisation : a “danse macabre”?","authors":["Degeling,  P.","Maxwell,  S.","Kennedy,  J.","Coyle,  B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-03-22","abstract":"To break their destructive antagonism over issues of health service modernisation, doctors and managers should engage more directly with nursing and allied health professionals when responding to reform initiatives\\ud\n\\ud\nEdwards and Marshall have recently called for constructive dialogue to replace the mutual suspicion between doctors and managers.1 They suggest that the recent tensions over the negotiation of the new UK consultant contract should be seen as part of a “deeper problem [with] a long history.” They propose that doctors' and managers' very different approaches to issues such as accountability, use of guidelines, and finance are the result of each discipline's training, beliefs, and experiences. Finally, they suggest that, left unresolved, these differences have the potential to threaten individual institutions and perhaps even the future of the NHS","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66065.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3374\/1\/3374.pdf","pdfHashValue":"0fc9954486c9048852a46b7e301ec5903b21a9b3","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3374<\/identifier><datestamp>\n      2015-07-31T11:59:07Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Medicine, management, and modernisation : a “danse macabre”?<\/dc:title><dc:creator>\n        Degeling,  P.<\/dc:creator><dc:creator>\n        Maxwell,  S.<\/dc:creator><dc:creator>\n        Kennedy,  J.<\/dc:creator><dc:creator>\n        Coyle,  B.<\/dc:creator><dc:description>\n        To break their destructive antagonism over issues of health service modernisation, doctors and managers should engage more directly with nursing and allied health professionals when responding to reform initiatives\\ud\n\\ud\nEdwards and Marshall have recently called for constructive dialogue to replace the mutual suspicion between doctors and managers.1 They suggest that the recent tensions over the negotiation of the new UK consultant contract should be seen as part of a “deeper problem [with] a long history.” They propose that doctors' and managers' very different approaches to issues such as accountability, use of guidelines, and finance are the result of each discipline's training, beliefs, and experiences. Finally, they suggest that, left unresolved, these differences have the potential to threaten individual institutions and perhaps even the future of the NHS.<\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:source>\n        British medical journal, 2003, Vol.326(7390), pp.649-652 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-03-22<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3374<\/dc:identifier><dc:identifier>\n        issn:0959-8138<\/dc:identifier><dc:identifier>\n        issn: 1468-5833<\/dc:identifier><dc:identifier>\n        doi:10.1136\/bmj.326.7390.649<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3374\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/bmj.326.7390.649<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3374\/1\/3374.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0959-8138","issn: 1468-5833","issn:0959-8138"," 1468-5833"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 November 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDegeling, P. and Maxwell, S. and Kennedy, J. and Coyle, B. (2003) ’Medicine, management, and\nmodernisation : a ’danse macabre’ ?’, British medical journal., 326 (7390). pp. 649-652.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/bmj.326.7390.649\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n11 November 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nPublished version \n \nCitation for published item: \nDegeling, P., Maxwell, S., Kennedy, J. and Coyle, B. (2003), ‘Medicine, management, and \nmodernisation : a 'danse macabre' ?’, British medical journal, 326 (7390), pp. 649-652. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1136\/bmj.326.7390.649 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n5 Harrison S. Health policy. In: Kogan M, Hawksworth M, eds. Routledge\nencyclopaedia of government and politics. 2nd ed. London: Routledge (in\npress).\n6 Harrison S, Hunter D, Marnoch G, Pollitt C. Just managing: power and cul-\nture in the National Health Service. London: Macmillan, 1992.\n7 Harrison S, AhmadW.Medical autonomy and the UK state 1975 to 2025.\nSociology 2000;34:129-46.\n8 Harrison S, Lim J. The frontier of control: doctors and managers in the\nNHS 1966 to 1997. Clin Gov Int J 2003;8(1):13-8.\n9 Bate P. Changing the culture of a hospital: from hierarchy to networked\ncommunity. Public Administration 2000;78:485-512.\n10 Degeling P, Kennedy J, Hill M.Mediating the cultural boundaries between\nmedicine, nursing and management—the central challenge in hospital\nreform.Health Serv Manage Res 2001;14:36-48.\n11 Davies HTO, Hodges C-L, Rundall TG. Views of doctors and managers\non the doctor-manager relationship in the NHS. BMJ 2003;326:626-8.\n12 Harrison S, Dowswell G. Autonomy and bureaucratic accountability in\nprimary care: what English general practitioners say. Sociol Health Illness\n2002;24:208-26.\n13 Willcocks S. Clinical management and cultural diversity: the cultural con-\ntext of doctor involvement in the managerial process.Health Serv Manage\nRes 1999;12:212-6.\n14 Hearing S, Dent T, Swann J, Gunaratna I, McLellan I, Ikidde U. Maximiz-\ning the contribution doctors make to NHS Management. Health Serv\nManage Res 1999;12:227-31.\n15 Green S. Professional\/ bureaucratic conflict: the case of the medical pro-\nfession in the NHS. Sociol Rev 1975;3(1).\n16 Pollitt C, Birchall J, Putnam K. Decentralising public services management.\nLondon: Macmillan, 1998.\n17 Thorne ML. Being a clinical director: first among equals or just a\ngo-between? Health Serv Manage Res 1997;10:205-15.\n18 Schulz R, Harrison S. Teams and top managers in the National Health Serv-\nice. London: King’s Fund, 1983.\n19 Harrison S, Small N, Baker M. The wrong kind of chaos? The early days\nof an NHS trust. Public Money and Management 1994;14(1):39-46.\n20 Newman K, Pyne T, Cowling A. Junior doctors and management: myth\nand reality.Health Manpower Management 1996;22(1):32-8.\n21 Fairfield G,Hunter DJ, Mechanic D, Rosleff F. Managed care: implications\nof managed care for health systems, clinicians, and patients. BMJ\n1997;314:1895-8.\n22 Walshe K. The rise of regulation in the NHS. BMJ 2002;324:967-70.\n23 Harrison S, Moran M, Wood B. Policy emergence and policy\nconvergence: the case of “scientific-bureaucratic medicine” in the USA\nand UK. Br J Polit Int Relations 2002;4(1):1-24.\n24 Davies HTO, Lampel J. Trust in performance indicators.Qual Health Care\n1998;7:159-62.\n25 Hood C. Controlling public management. Public Finance Foundation\nReview 1995;7:3-6.\n26 Davies HTO, Nutley SM, Mannion R. Organisational culture and health\ncare quality.Qual Health Care 2000;9:111-9.\nMedicine, management, and modernisation:\na “danse macabre”?\nPieter Degeling, Sharyn Maxwell, John Kennedy, Barbara Coyle\nTo break their destructive antagonism over issues of health service modernisation, doctors and\nmanagers should engage more directly with nursing and allied health professionals when\nresponding to reform initiatives\nEdwards and Marshall have recently called for\nconstructive dialogue to replace the mutual suspicion\nbetween doctors and managers.1 They suggest that the\nrecent tensions over the negotiation of the new UK\nconsultant contract should be seen as part of a “deeper\nproblem [with] a long history.” They propose that doc-\ntors’ and managers’ very different approaches to\nissues such as accountability, use of guidelines, and\nfinance are the result of each discipline’s training,\nbeliefs, and experiences. Finally, they suggest that, left\nunresolved, these differences have the potential to\nthreaten individual institutions and perhaps even the\nfuture of the NHS.\nIn this article we offer a brief analysis of the wider\nnature and the essential elements of the reforms being\nsought by governments. We offer some cross-national\nevidence to support the proposition that understand-\ning different professional cultures is crucial for under-\nstanding each profession’s response to the reforms.We\nconclude by drawing on that evidence to offer some\nways forward.\nOrientations of reform\nReforming how clinical work is organised, performed,\nand monitored has been at or near the top of the\npolicy agenda in most industrial societies for the past\n25 years. The reasons for this are:\nx The growing cost of health care, leading to\nquestions about the resource efficiency of existing\nmodes of service delivery\nx Doubts about the appropriateness and value of\nexisting patterns of clinical work organisation\nSummary points\nCalls to modernise health services require health\nprofessionals to accept that all clinical decisions\nhave resource dimensions, recognise the need to\nbalance clinical autonomy with transparent\naccountability, support the systemisation of\nclinical work, and subscribe to the power sharing\nimplications of team based approaches to clinical\nwork\nThere are consistent and marked differences in\nhow medical, nursing, and managerial staff across\ncountries evaluate individual aspects of such a\nreform programme\nPolicy authorities’ efforts to overcome resistance\nto reforms by widening the scope and reach of\n“top-down” performance management and\nregulation are self defeating\nWhat is required is more support for clinicians\nand others (including nurse managers) to pursue\nmodernised clinical work practices\nRe-establishing “responsible autonomy” as the\nprimary organising principle of clinical work will\nempower health professionals to strike a balance\nbetween the clinical and resource dimensions of\ncare and between clinical autonomy and\ntransparent accountability\nEducation and debate\nCentre for Clinical\nManagement\nDevelopment,\nWolfson Research\nInstitute, University\nof Durham,\nQueen’s Campus,\nStockton on Tees\nTS17 6BH\nPieter Degeling\nprofessor of clinical\nmanagement\ndevelopment\nSharyn Maxwell\nresearch fellow\nJohn Kennedy\nresearch fellow\nBarbara Coyle\nresearch associate\nCorrespondence to:\nP Degeling\np.j.degeling@\ndurham.ac.uk\nBMJ 2003;326:649–52\n649BMJ VOLUME 326 22 MARCH 2003 bmj.com\nx Worries about the medical profession’s capacity to\nensure the accountability of its members.2 3\nThese issues are best tackled at the level at which\nclinical work is performed. When clinicians make deci-\nsions about what constitutes best practice, they are also\nmaking decisions about how care should be organised.\nWhen applying those best practice decisions in their\nencounters with patients, clinicians are also allocating\nand spending the health budget. Reform initiatives to\naddress these concerns, however, are characterised by\ntheir dependence on “top-down” bureaucratic mecha-\nnisms external to individual clinical settings, such as\nmarket mechanisms and moral persuasion.4 5\nExamples of these top-down approaches in Britain\ninclude capped hospital budgets, tightened spending\ncontrols, and an increasing range of performance indi-\ncators. Competitive arrangements such as purchaser-\nprovider splits and requirements for provider diversity\nrepresent efforts to introduce the discipline of the\n“market” into health care. Shifting the balance of\npower towards primary care trusts and the introduc-\ntion of tariffs based on case mix for service\ncommissioning for these trusts are recent examples of\nthis approach. As with the earlier “internal market,” the\npolicy hope is that these arrangements will stimulate\nhospital managers to attend more closely to efficiency\nand quality in service delivery.6 7\nMoral persuasion initiatives have been directed at\nincreasing clinician involvement in clinical audit, qual-\nity improvement, and evidence based clinical practice\n(despite many of these initiatives having emanated\nfrom within medicine itself).8 The highly publicised\nfailures of (medical) self regulation in England such as\nthe Bristol and Shipman cases, however, has led policy\nauthorities over the past five years to adopt a more\nregulatory approach.\nFor example, the National Institute for Clinical\nExcellence and national collaboratives now set\nstandards for care, which the Commission for Health\nImprovement uses to assess providers’ performance.\nThese are complemented by an extensive national per-\nformance framework9 and a national patient and user\nsurvey. Policy authorities intend that this clinical\nimprovement agenda will be given local effect via clini-\ncal governance mechanisms that make trust boards\ndirectly responsible for quality assurance, clinical audit,\nrisk reduction, and related clinical development\nprogrammes among staff.10\nHealthcare managers, however, need the active par-\nticipation of healthcare clinicians, especially doctors, to\nimplement these policy initiatives at the level that clinical\nwork is done.11 Whether that active participation is\nforthcoming depends in part on how the various\nprofessions interpret the policy initiatives and on the\nconflicts of priority that exist even among holders of\ncommon objectives.12 These, in turn, are dependent on\nhow the various professions conceive of clinical work.\nClinicians’ perceptions of reform\nStripped down to its essential elements, the “moderni-\nsation agenda” described above calls on doctors,\nnurses, allied health workers, and managers in acute,\nprimary, and community settings to:\nx Accept the proposition that all clinical decisions\nhave resource dimensions\nx Recognise the need to balance clinical autonomy\nwith transparent accountability\nx Support the systemisation of clinical work\nx Subscribe to the power sharing implications of team\nbased approaches to clinical work.\nEvidence about how healthcare professionals view\nthese issues was obtained from a survey of 3065 medi-\ncal clinicians, medical managers, general managers,\nnurse managers, and nurse clinicians working in 26\nhospitals in England, Wales, Australia, and New\nZealand.13–16 The survey asked questions about health\nprofessionals’ attitudes towards:\nx Key healthcare issues\nx Strategies for dealing with hospital resource issues\nx Interconnections between clinical and resource\ndimensions of care\nx The causes of variation in clinical practice\nx Who should be involved in setting clinical standards\nx The forms of knowledge on which clinical standards\nshould be based\nx How clinical units should be based\nx The accountability and autonomy of clinicians\nx The organisation of their trust.\nThe results strongly suggest that medical, nursing,\nand managerial staff have distinct, profession based\nconceptions of clinical work. The data show that these\ndifferences occur on four dimensions, two of which\naccount for 93% of the variation in the data (figure).\nThe figure shows highly significant differences\n(P < 0.001) between professional groups in terms of\nindividualist versus systematised conceptions of clinical\nwork and in terms of conceptions of the financial and\naccountability aspects of clinical work (that is, between\nfinancial realism and transparent accountability and\nclinical purism and accountability to self, peers, and\npatients (or opaque accountability)).\nThe consistency in the views of each professional\ngroup in the different countries is striking. The\nprofessions tend to conceive of clinical work in the\nfollowing ways:\n-2.5\n-0.5\n0.5\n-2.0-2.5 -1.5 -0.5 0.5 1.5 2.0 2.5\n1.5\n2.5\nEmphasis on financial realism\nand transparent accountability\nSy\nst\nem\nat\nis\ned\n c\non\nce\npt\nio\nns\nof\n c\nlin\nic\nal\n w\nor\nk\nIndividualist conceptions\nof clinical w\nork\nEmphasis on clinical purism\nand opaque accountability\nGM\nNM\nNC\nMM\nMC\n-1.5\nEngland 2002 England 1995 Wales 2000\nAustralia 1995, 1999 New Zealand 1999 Mean for total data\nProfile of healthcare professionals’ conceptions of clinical work. MC=medical clinicians,\nMM=medical managers, GM=general managers, NM=nurse managers, NC=nurse clinicians.\nOvoids represent 1 standard deviation from mean (69% of each professional group fall within\nthat area)\nEducation and debate\n650 BMJ VOLUME 326 22 MARCH 2003 bmj.com\nx General managers hold strongly systematised\nconceptions of clinical work and financial realism and\ntransparent accountability\nx Medical managers tend to hold individualist\nconceptions of clinical work and to support financial\nrealism and transparent accountability\nx Medical clinicians hold strongly individualist con-\nceptions of clinical work and are equivocal about\nfinancial realism and transparent accountability\nx Nurse managers tend to hold systematised concep-\ntions of clinical work and to be somewhat equivocal\nabout clinical purism and opaque accountability\nx Nurse clinicians hold systematised conceptions of\nclinical work and strongly support clinical purism and\nopaque accountability.\nThe table shows how each professional group’s con-\nceptions of clinical work relate to the four key elements\nof modernisation. Given the media and historical depic-\ntions of ongoing tension between doctors andmanagers\nreferred to earlier, the results may be surprising. Nurse\nmanagers, not general managers, are the professional\ngroup most supportive of modernisation.\nImplications of professionals’\ndiffering views\nThese results suggest that Edwards and Marshall are\ncorrect when they effectively attribute tensions between\ndoctors and managers to differing professional cultures.\nSome members of the medical profession may believe\nthat these results confirm the willingness and ability of\ndoctors to resist what they perceive to be the imposition\nof wrongheaded changes. Alternatively, policy makers\nand managers may regard the results as providing\nevidence of medical intransigence and providing justifi-\ncation for redoubling efforts in existing top-down\napproaches to reform.\nEach of these conclusions is mistaken. Celebrations\nof medical resistance misjudge the extent of the\nsocietal forces in play. Specific details of the health\nreform programme (in each country) mirror reforms\nin other services such as education and welfare. The\nimpetus for reform lies not just with the minister of the\nday and his or her advisers but also within society at\nlarge. The drive for efficiency reflects a well established\nshift in public sector management, driven in large part\nby the public’s desire for lower taxes.17 Moves to\nstrengthen the accountability of clinicians are matched\nby similar efforts in other trust based endeavours such\nthe priesthood and the legal system.\nThe recent explosion of performance targeting and\nmonitoring suggests that policy authorities try to over-\ncome (medical) resistance at the implementation stage\nby amplifying the scope and reach of performance\nmanagement and creating new regulatory structures.\nSuch responses, however, contain the seeds of their\nrejection by clinical staff. Focus groups in Wales\nshowed, for example, that clinicians of all disciplines\nare critical of what they perceive as a blind and\nunrelenting drive on increased throughput and\nreduced waiting times that inappropriately skew\nclinical priorities.14 Clinicians are also highly critical of\nthe time now absorbed by “management generated\nand oriented (paper)work” “totally lacking (in) clinical\nsignificance.” These (often valid) conclusions provide\ngrounds for further resistance. The political import-\nance of the NHS to the present government, however,\nmeans that policy efforts on these issues are likely to\nincrease rather than decrease.2 18\nThe persistence of tensions, resistance, and bureau-\ncratisation in health care has resulted in a seemingly\nunending and discordant medical and management\n“two-step.” This is strange, not just because many man-\nagers have a medical background,1 but because it\nsuggests an apparent lack of awareness or interest by\npolicy makers, local managers, and doctors in the\npotential contributions that other professions, most\nnotably nurse managers, can make to reform.\nThe multidisciplinary, team based systems that\nnurse managers champion—in particular, integrated\ncare pathways for common types of cases—provide the\nbasis for re-establishing “responsible autonomy” as the\nprimary organising principle of clinical work. Fully\ndeveloped integrated care pathways specify the agreed\nsequence of diagnostic and therapeutic processes and\nincorporate the views of (medical, nursing, and allied\nhealth) clinicians and managers, which (in the light of\nthe available evidence, stated resource constraints, and\nexperience of patients) are essential for achieving\ndesired outcomes for specified clinical conditions.19–22\nThey therefore provide a tool for empowering\nclinicians to strike a balance between the clinical and\nresource dimensions of care and between the require-\nments of both clinical autonomy and transparent\naccountability.\nGiven the various conceptions of clinical work, our\nsuggestion that doctors and managers engage more\ndirectly with nursing and allied health professionals\nwhen responding to reform initiatives is likely to be\nrejected as both culturally difficult and destabilising to\nestablished positions of power. We would argue,\nhowever, that continuing to refer to healthcare issues as\nprimarily a medical and management debate narrows\nthe range of alternative and perhaps more constructive\napproaches that may be taken to reform issues.\nConclusion\nWe believe that, left unresolved, the “danse macabre”\nthat has characterised health systems reform will have\nthree effects. Firstly, it will undermine opportunities to\nincorporate the perspectives of clinicians in local\nmodernisation strategies. Secondly, it will prevent the\nrevival of “responsible autonomy” as an organising\nHealthcare professionals’ stances on the key elements of health service modernisation\nMedical clinicians Medical managers General managers Nurse managers Nurse clinicians\nRecognise connections between clinical\ndecisions and resources\nOppose Support Equivocal Support Oppose\nTransparent accountability Oppose Support Support Support Oppose\nSystematisation Oppose Oppose Support Support Equivocal\nMultidisciplinary teams Oppose Oppose Equivocal Support Support\nEducation and debate\n651BMJ VOLUME 326 22 MARCH 2003 bmj.com\nprinciple in health care. Finally, it will mean that all\nparties will continue to be driven by the distrust and\nrelated crises of confidence that pervade the field.\nCompeting interests: None declared.\n1 Edwards N, Marshall M. Doctors and managers. BMJ 2003;326:116-7.\n2 Harrison A, Dixon J. The NHS—facing the future. London: King’s Fund,\n2000.\n3 Ham C.Health policy in Britain. 4th ed. Hampshire: Palgrave, 1999.\n4 Department of Health. The new NHS: modern and dependable—a national\nframework for assessing performance. Consultation document. Wetherby: NHS\nExecutive, 1997.\n5 Department of Health.A first class service—quality in the new NHS. London:\nDoH, 1998.\n6 Department of Health. Shifting the balance of power.London: DoH, 2002.\n7 Department of Health, Reforming NHS financial flows—introducing payment\nby results. London: DoH, 2002.\n8 Gray J. Evidence-based healthcare. London: Churchill Livingstone, 1997.\n9 Public Health Development Unit. Performance assessment framework. Qual-\nity and performance in the NHS: clinical indicators. Leeds: NHS Executive,\n1999.\n10 Swage T. Clinical governance in health care practice. Oxford: Butterworth-\nHeinemann, 2000.\n11 Harrison S, Hunter D, Marnoch G, Pollitt C. Just managing: power and cul-\nture in the National Health Service. London: MacMillan, 1992.\n12 Rivlin A. Obstacles to social progress: why can’t we get things done?\n1971. Quoted in: Harrison S, Hunter D, Marnoch G, Pollitt C. Just manag-\ning: power and culture in the National Health Service. London: MacMillan,\n1992.\n13 Degeling P, Macbeth F, Kennedy J, Maxwell S, Coyle B, Telfer B.\nProfessional subcultures and clinical governance implementation in Wales: a\nreport for the National Assembly for Wales. Durham: Centre for Clinical\nManagement Development, University of Durham and College of Medi-\ncine, University of Wales, 2002:48.\n14 Degeling P, Hill M, Kennedy J, Coyle B, Maxwell S. A cross-national study\nof differences in the identities of nursing in England and Australia and\nhow this has affected nurses’ capacity to respond to hospital reform.\nNursing Inquiry 2000;7(2):120-35.\n15 Degeling P, Sage D, Kennedy J, Perkins R. A comparison of the impact of\nhospital reform on medical subcultures in some Australian and New\nZealand hospitals. Aust Health Rev 1999;22:172-88.\n16 Degeling P, Kennedy J, Hill M, Carnegie M, Holt J. Professional subcultures\nand hospital reform. Sydney: University of New South Wales, 1998.\n17 Pollitt C. Managerialism and the public services: cuts or cultural change in the\n1990’s? Oxford: Blackwell Business, 1996.\n18 McDonald P. If managers don’t take on change then the government will\n[rapid response]. BMJ 2001 (http:\/\/bmj.com\/cgi\/eletters\/323\/7324\/\n1262[17851).\n19 Holt P, Wilson A, Ward J. Clinical practice guidelines and critical pathways: a\nstatus report on national and NSW development and implementation activity.\nSydney: NSW Health Department, 1996.\n20 Thomson R, Lavender M, Madhok R. How to ensure that guidelines are\neffective. BMJ 1995;311:237-42.\n21 Leape LL. Practice guidelines and standards: an overview. Qual Rev Bull\n1990;16:42-9.\n22 Lomas J. Do practice guidelines guide practice? N Engl J Med\n1989;321:1306-11.\nImproving the doctor-manager relationship\nDavid B Nash; Laurence Malcolm, Lyn Wright, Pauline Barnett, Chris Hendry; Francis J Crosson;\nRifat A Atun; Hilary Thomas\nThe problem with doctor-manager relationships is well studied. The potential for these relationships\nto harm the working environment and affect organisational performance is acknowledged and\nunderstood. The same is not true of possible solutions. To bridge this gap we invited short\ncontributions, and we are publishing a selection of these to start the debate. This is the kind of issue\nwhere those from different sides might wish to contest all the potential solutions. We hope so.\nPlease post your responses on bmj.com\nDoctors and managers: mind the gap\nDavid B Nash\nThe US healthcare system is characterised by uneven\nquality, very high cost relative to health outcome, and\npatchy access, particularly for those lacking adequate\nhealth insurance coverage. These performance gaps in\nthe system were described as a “chasm” in a recent\nreport from the Institute of Medicine’s committee on\nquality of health care.1 Many observers (including doc-\ntors and managers) agree that little research has been\ndone on the impact of management on improved per-\nformance of healthcare delivery systems. I propose\nhere a seven point plan to seek common ground\nbetween doctors and managers.\nFirstly, we should foster interdisciplinary education\nfor managers and physicians at the earliest possible\nstage in professional education. Managers could do\nclinical rounds and clinicians could attend manage-\nment programmes.2 A deeper understanding of each\nother’s culture will help to improve relationships and\nquality of care.\nSecondly, we should develop the management\nresearch agenda through the Agency for Healthcare\nResearch and Quality, the US federal government\nbody for research in this arena. The agency needs $1bn\n(£0.6bn; €0.9bn) to tackle the challenges identified in\nthe Institute of Medicine’s report.1 Better management\nresearch will enable us to redesign care processes\nbased on best practice and to coordinate care more\neffectively over time.\nThirdly, we should encourage measurement and\nassessment of clinical performance.We need a national\nsystem of clinical accountability with robust measures\nthat make sense to individual clinicians and managers.\nCurrently, performance assessment tools in the United\nStates can support quality improvement only in the\npractice environment (Daley J et al, unpublished data)\nas they lack specificity at the level of individual\nphysicians. The tools are inadequate for rewarding\nclinical excellence on the basis of current measures.\nFourthly, we should promote the widespread\nimplementation of a combined managerial and clinical\nreport card when the performance of healthcare insti-\ntutions is being reviewed. Regular, annual, quality\nEducation and debate\nOffice of Health\nPolicy and Clinical\nOutcomes, Jefferson\nMedical College,\n1015 Walnut Street,\nSuite 115 Curtis,\nPhiladelphia,\nPA 19107\nDavid B Nash\ndirector\nCorrespondence to:\nD B Nash\nDavid.nash@\nmail.tju.edu\nBMJ 2003;326:652–3\n652 BMJ VOLUME 326 22 MARCH 2003 bmj.com\n"}