{"doi":"10.1063\/1.3501046","coreId":"140038","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5228","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5228","10.1063\/1.3501046"],"title":"The shock response of a rendered porcine fat","authors":["Wilgeroth, J. M.","Hazell, P. J.","Appleby-Thomas, G. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-11-15T00:00:00Z","abstract":"Characterization of the shock response of biological materials is required in\norder to develop an understanding of how such materials behave under high\nstrain-rate loading. In this work, a predominately linear U s-up Hugoniot\nrelationship for a rendered porcine fat has been established using the plate-\nimpact technique. This has been shown to take the form U s=1.58+2.47up (ρ0\n=0.945 g \/cc) and comparison has been made between the dynamic behavior of the\nadipose material and both 20 wt % ballistic gelatin and water. The adipose\nmaterial has been shown to behave in likeness with simple polymers such as\npolyethylene and to strengthen under shock loading, unlike ballistic gelatin,\nwhich has been shown to behave hydrodynamically. An experimental design\nincorporating direct insertion of lateral stress gauges within the rendered fat\nhas given insight into both the behavior of lateral gauges and the lateral\nstress response of the material under dynamic loadin","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140038.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1063\/1.3501046","pdfHashValue":"3f5c455a3f80006fb9c1e0a17c12e6a74b7d7da3","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5228<\/identifier><datestamp>2015-01-29T16:17:34Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The shock response of a rendered porcine fat<\/dc:title><dc:creator>Wilgeroth, J. M.<\/dc:creator><dc:creator>Hazell, P. J.<\/dc:creator><dc:creator>Appleby-Thomas, G. J.<\/dc:creator><dc:subject>Shock response<\/dc:subject><dc:subject>Hugoniot<\/dc:subject><dc:subject>porcine fat<\/dc:subject><dc:subject>explosion effects<\/dc:subject><dc:description>Characterization of the shock response of biological materials is required in\norder to develop an understanding of how such materials behave under high\nstrain-rate loading. In this work, a predominately linear U s-up Hugoniot\nrelationship for a rendered porcine fat has been established using the plate-\nimpact technique. This has been shown to take the form U s=1.58+2.47up (ρ0\n=0.945 g \/cc) and comparison has been made between the dynamic behavior of the\nadipose material and both 20 wt % ballistic gelatin and water. The adipose\nmaterial has been shown to behave in likeness with simple polymers such as\npolyethylene and to strengthen under shock loading, unlike ballistic gelatin,\nwhich has been shown to behave hydrodynamically. An experimental design\nincorporating direct insertion of lateral stress gauges within the rendered fat\nhas given insight into both the behavior of lateral gauges and the lateral\nstress response of the material under dynamic loading<\/dc:description><dc:publisher>American Institute of Physics<\/dc:publisher><dc:date>2011-04-20T23:21:19Z<\/dc:date><dc:date>2011-04-20T23:21:19Z<\/dc:date><dc:date>2010-11-15T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0021-8979<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1063\/1.3501046<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5228<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-8979","issn:0021-8979"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Shock response","Hugoniot","porcine fat","explosion effects"],"subject":["Article"],"fullText":"The shock response of a rendered porcine fat\nJ. M. Wilgeroth,a\u0002 P. J. Hazell, and G. J. Appleby-Thomas\nCranfield Defence and Security, Cranfield University, Shrivenham, Swindon SN6 8LA, United Kingdom\n\u0002Received 26 July 2010; accepted 8 September 2010; published online 15 November 2010\u0003\nCharacterization of the shock response of biological materials is required in order to develop an\nunderstanding of how such materials behave under high strain-rate loading. In this work, a\npredominately linear Us-up Hugoniot relationship for a rendered porcine fat has been established\nusing the plate-impact technique. This has been shown to take the form Us=1.58+2.47up \u0002\u00020\n=0.945 g \/cc\u0003 and comparison has been made between the dynamic behavior of the adipose material\nand both 20 wt % ballistic gelatin and water. The adipose material has been shown to behave in\nlikeness with simple polymers such as polyethylene and to strengthen under shock loading, unlike\nballistic gelatin, which has been shown to behave hydrodynamically. An experimental design\nincorporating direct insertion of lateral stress gauges within the rendered fat has given insight into\nboth the behavior of lateral gauges and the lateral stress response of the material under dynamic\nloading. © 2010 American Institute of Physics. \u0004doi:10.1063\/1.3501046\u0005\nI. INTRODUCTION\nIn order to provide the required ballistic protection to an\nindividual, damage mechanisms, and the response of the\nbody and its tissues to dynamic loading must be understood.\nWounding occurs through the mechanisms of blast waves in\nair\/water, penetration from projectiles and fragments, blunt-\nforce impact, and rapid acceleration\/deceleration effects on\nthe organs and limbs. The strain-rates and pressures encoun-\ntered under these scenarios necessitate a knowledge of the\nhigh strain-rate response of such materials; typically strain-\nrates \u0003104 \/s are of interest.\nThe consequence of impact on body tissues, many of\nwhich are anisotropic and vary in composition and distribu-\ntion from person to person, is notably complex. For this rea-\nson, material impact tests are often simplified in order to\nelucidate understanding of the governing mechanics i.e.,\ncomplex three-dimensional problems such as ballistic impact\nevents are often simplified into one-dimensional \u00021D\u0003 load-\ning of materials over a range of strain-rates. Further, it is\noften necessary to analyze body materials in isolation in or-\nder to depict an understanding of how the body, as a whole\nsystem, will respond to dynamic loading.\nThe early example of McElhaney1 looked at the response\nof muscle tissue to a piston accelerated into the material via\nan air gun system. His conclusions related the cellular struc-\nture of the bovine muscle to ‘humped regions’ witnessed in\nthe stress-strain curve of the material at specific strain rates,\nsuggesting that, as strain increases, it is the inhibition of fluid\nmovement between cells and the interstitial spacing between\nthem that eventually leads to cell rupture and the observed\nincongruities in the stress-strain response. This work focused\non a singular muscle type; hence, it is not possible to con-\nclude that the observed behavior is typical of other muscle\ngroups and function-specific muscle types such as smooth\nand cardiac muscle.\nSaraf et al.2 investigated the dynamic response of soft\nhuman tissues using the Kolsky bar technique to determine\nthe uniaxial compression and shear response at various\nstrain-rates. Soft tissues were interrogated at stresses below\n25 MPa and at strain-rates of 300–7700\/s. The behavior of\nthe materials under dynamic compression was represented by\nan approximately linear relationship between the pressure\nand the volumetric strain, while the relationship between the\nshear stress and the shear strain was found to be strongly\nnon-linear. It was also shown from the shear response of the\nsoft materials that minimal stress levels existed at low strain-\nrates. However, a rapid stiffening and increase in stress oc-\ncurred at higher stain-rates.\nA similar approach, as used by Al-Mousawi et al.3 and\nMarais et al.,4 has produced data on the compressive re-\nsponse of various biological materials such as porcine\nmuscle,5 pig skin,6 and bovine muscle.7 In addition, analysis\nof the tissue simulant, ballistic gelatin, has also been carried\nout.8 Such work has provided detailed insight into the re-\nsponse of biological and soft tissues at strain-rates up to ap-\nproximately 104 \/s. However, despite such studies, there is a\nnotable lack of data in the literature governing the response\nof such systems to shock, where the strain-rate would typi-\ncally be 105–106 \/s.\nWhile widely employed as a tissue stimulant, substantive\nresearch into the higher strain-rate or shock response of bal-\nlistic gelatin has only recently been investigated. Plate-\nimpact experiments were employed by Shepherd et al.9 to\ndetermine equation-of-state data for 20 wt % ballistic gelatin\nfor particle velocities \u00041 mm \/\u0005s. Similar Us-up and P-up\nHugoniot relationships to water10,11 were found and, in par-\nticular, gelatin was shown to behave hydrodynamically i.e.,\nto possess negligible strength under shock loading. Further,\nballistic gelatin was found to be unable to support a shear\nwave. Similar work on the shock compression of several\nbio-related materials was presented by Nagayama et al.10,11\nHugoniot relationships in the Us-up plane were established\nfor water, 10% gelatin solution, 20% gelatin solution \u0002in\ngood agreement with Shepherd et al.9\u0003, and both 10% anda\u0003Electronic mail: j.wilgeroth@cranfield.ac.uk.\nJOURNAL OF APPLIED PHYSICS 108, 093527 \u00022010\u0003\n0021-8979\/2010\/108\u00039\u0002\/093527\/10\/$30.00 © 2010 American Institute of Physics108, 093527-1\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\n20% sodium chloride \u0002NaCl\u0003 solution. Plate-impact experi-\nments were also employed to interrogate the shock response\nof chicken breast meat. Interestingly, the Hugoniot data for\nthis material was observed to be almost coincident with that\nof 20 wt % gelatin in the Us-up plane.\nTissue damage \u0002wounding\u0003 as a result of ballistic\/high-\nstrain-rate events is unlikely to be an entirely hydrodynamic\nprocess. Consequently, penetration behavior in such a\n“weak” material as 20 wt % gelatin is unlikely to be compa-\nrable with the ballistic response of “stronger” body tissues\nsuch as muscle, bone, fat, and connective tissues, which are\nyet to be characterized under such loading regimes. Further,\nbody tissues such as muscle exhibit anisotropic properties\nand, as a consequence, cannot be expected to behave in a\nuniform manner \u0002as opposed to intimately mixed\/isotropic\nballistic gelatin blocks\u0003. Thus, there is a clear requirement\nfor ballistic simulants to be more representative of the human\nbody.\nAn important element of tissue is the adipose or “fat”\nlayer. The literature regarding the compressive response of\nlard\/body fat is limited, and quantitative analysis of dynamic\nloading on the material is yet to be undertaken. However,\nNishioka and Irie12 did demonstrate that, under low \u0002strain\u0003\nrates of compression, the firmness of porcine perirenal fat\nincreases with the percentage of saturated fatty acids within\nthe material.\nTriglycerides or triaglycerols, are the most common\nform of fat in the body, accounting for approximately 95% of\nall body fat.13,14 These fats are composed of a structure\nwhich is essentially a biological polymer. Usefully, unlike\nfatty tissues, the behavior of polymers under dynamic\/shock\nloading has been extensively studied. The dynamic response\nof three simple polymers was investigated by Millett and\nBourne,15 who looked at the shock response of polyethylene,\npolypropylene, and polystyrene by means of plate-impact ex-\nperiment. Their results showed an increase in resistance to\ncompression under shock with the complexity of side chain\nattachment of the polymer \u0002i.e., polyethylene to polystyrene\u0003.\nWhile Millett and Bourne15 investigated the dynamic re-\nsponse of polymers at pressures \u00046 GPa, Carter et al.16 pro-\nvide insight into the shock response of various polymeric\nmaterials at pressures of 20–30 GPa.\nLittle work on the response of body tissues or tissue\nsimulants at pressures in the order of GPa is apparent within\nthe literature. Such pressures are obtained through 1D\nexplosively-driven-hammer and plate-impact experiments.\nFurther, no significant work appears to have been undertaken\ndirectly comparing the response of biological simulants with\nbody tissues of either animal or human origin. In this work,\nplate-impact experiments have been conducted to investigate\nthe 1D high strain-rate response of a commercially available\nlard. The primary aim of this work is to elucidate under-\nstanding of how the adipose element of more accurate tissue\nsimulants will respond under impact. As discussed, mamma-\nlian tissues are complex and anisotropic in nature. Conse-\nquently, an understanding of the high strain-rate response of\nisolated tissue components is required before the behavior of\nmore complex biological systems and anatomical regions,\nsuch as the organs and thorax, respectively, are considered.\nFurther, the equation-of-state data derived here aims to in-\nform the future development of hydrocode models, poten-\ntially providing insight into wound morphology and the in-\nvestigation of protection concepts. This work is part of a\nwider study on the dynamic behavior of biological materials.\nII. EXPERIMENTAL METHODS\nA. Materials\nThe adipose material adopted in this work was a com-\nmercially available lard manufactured in the U.K. by Mat-\nthews Foods plc and retailed by the Co-operative Food\nGroup under the product name “Fresh Fields Lard.” The ma-\nterial was chosen as a good approximation of human fat tis-\nsues and adipose layers, due to its high fat content \u0002approxi-\nmately 99.8%\u0003, and the requirement that such materials\/\nsimulants comply with ethical regulations for the testing of\nanimal and human tissues.\nFigure 1 highlights the chemical structure and mecha-\nnisms involved with triglyceride formation \u0002approximately\n95% body fat\u0003. As discussed, it has been shown elsewhere12\nthat the percentage saturation of the fatty acid component of\nfat is a factor governing the firmness of the material.\nThe adipose target material was stored at 4 °C up until\nthe point of target preparation. The longitudinal sound speed\nof the material was measured ultrasonically at room tempera-\nture using a Panametrics 5077PR pulser-receiver in the\npulse-receive configuration and a 1.0 MHz Panametrics\nquartz transducer. This relatively low frequency was adopted\n3H20\nGlycerol Fatty Acids Triglyceride Molecule\nNote: ‘R’ represents a repeating unit within the molecule. In the above, ‘R’ substitutes a repeating CH2 Carbon chain\nFIG. 1. \u0002Color online\u0003 Triglyceride formation \u0004adapted\nfrom Mackenna and Callander \u0002Ref. 13\u0003\u0005.\n093527-2 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\nto ensure maximum penetration of the ultrasonic waves in\nthe highly attenuating lard. A value of cL\n=1.51\u00060.10 mm \/\u0005s was determined. This is in good\nagreement with longitudinal wave speeds obtained elsewhere\nfor gelatin9 and water17 \u00021.48\u00060.06 mm \/\u0005s and\n1.49 mm \/\u0005s, respectively\u0003. A shear wave speed for the ma-\nterial was not discernible, most likely due to the material’s\nlow stiffness. Target material density was measured using a\nMicromeritics AccuPyc 1330 Gas Pycnometer and was de-\ntermined to be 0.945\u00060.006 g \/cm3 at room temperature.\nB. Measurement of longitudinal stress\nFood-grade lard was subjected to various shock pres-\nsures by means of plate-impact experiment18,19 using a\n\u000250 mm single-stage gas gun.20 The design specifications\nof the system ensure that all points of the projectiles’ surface\nmake contact with the target simultaneously upon impact,\nthus generating a planar \u00021D\u0003 shock within the material. This\nleads to all strain acting along the axis of impact such that:\n\u0007x \u0004 \u0007y = \u0007z = 0 and \bx \u0004 \by = \bz \u0004 0.\nWhere subscript x denotes the condition along the impact\naxis and subscripts y and z denote the conditions orthogonal\nto the impact axis.\nA sequence of experiments were conducted to interro-\ngate the longitudinal stresses generated within the sample\nmaterial under shock-loading. Shock response of the target\nmaterial was measured using Vishay Micro-Measurements &\nSR-4 Manganin Pressure Gauges of type LM-SS-125CH-048\ncalibrated according to Rosenberg et al.21 During impact,\ngauge response was monitored using Tektronix TDS 5104\nDigital Phosphor Oscilloscopes \u00022GS\/s\u0003. Subsequent analy-\nsis, employing the impedence matching technique,22 allowed\nfor shock velocity-particle velocity \u0002Us-up\u0003, pressure–particle\nvelocity \u0002P-up\u0003, and pressure-volume \u0002P-v\u0003 Hugoniot rela-\ntionships to be established for the sample material. A sche-\nmatic highlighting key features of the experimental setup\/\ntarget assembly is shown in Fig. 2.\nWith the longitudinal targets, the adipose material was\ncast\/encapsulated within a \u000260 mm aluminum ring \u0002see Fig.\n3\u0003. These were machined to a thickness of 10 mm\u000620 \u0005m,\nwith the mount faces of the ring finished flat and parallel to\na tolerance of 10 \u0005m. Before each experiment, sample\nthickness was carefully measured using a digital micrometer.\nWhen combined with knowledge of arrival times at the two\nsample-faces, this measurement allowed for calculation of\nshock velocity \u0002Us\u0003 through the target material. In all cases,\nthe sample material was encapsulated between a 1mm copper\ncover plate and a polymethyl-methacrylate \u0002PMMA\u0003 backing\nblock \u0002chosen due to its well-defined Hugoniot which al-\nlowed for subsequent calculation of stresses in the target ma-\nterial\u0003. The manganin gauges were insulated from both the\nsample material and the copper cover plate using a thin\n\u0002\u000625 \u0005m\u0003 Mylar® layer.\nAn assembled plate-impact target for the measurement\nof longitudinal stresses within the adipose material is shown\nin Fig. 3. Liquid lard was cast at 50–60 °C into the alumi-\nnum sample-ring via a \u00027 mm hole machined into the side\nwall. While above the melting temperature of 35–40 °C,\nthis temperature is significantly below the temperatures and\nprocessing times employed in commercial rendering pro-\ncesses \u0002\u0003100 °C in steam processing and 1–5 h, respec-\ntively\u0003. Thus, it seems reasonable to suggest that the casting\nprocess employed will have caused minimal or no significant\nalteration to the microstructure of the lard from that at the\npoint of acquisition.\nC. Measurement of lateral stress\nA second set of experiments were conducted in order to\ninvestigate the lateral stresses generated within the adipose\nmaterial under shock loading. The techniques employed to\nmeasure lateral stress are widely covered in the literature.23,24\nHowever, the types of materials that are typically examined\nare metals and polymers, whose machinability allows for the\nplacement of lateral stress gauges directly between prepared\ntarget-material halves. Aluminum rings of \u000260 mm and of 6\nand 10 mm+ \/−20 \u0005m thickness with opposing faces ma-\nchined flat and parallel to a tolerance of 10 \u0005m were em-\nployed for target-material confinement. Adhered to the front\nof the sample ring was a 1 mm thick copper cover-plate,\nwhile the rear of the target ring allowed for the insertion of\nthe gauge-support assembly \u0002see Fig. 4\u0003. The lateral response\ntargets were initially assembled into a hollow-casing form\nprior to filling with liquid lard through one of two 4 mm\nholes machined into the side-wall of the target-rings; the sec-\nond allowing for the release of air from the target void. The\nSealed gun\/barrel\nsection\nVelocity pin\nblock\nBarrel\nGauge assembliesTrigger pins\nTarget ring\nCover plate\nSample confinement\n(Food-grade lard)\nPMMA\nSabot\nFlyer plate\nCavity\nFIG. 2. \u0002Color online\u0003 Experimental setup and target arrangement.\nFIG. 3. \u0002Color online\u0003 Precast lard target assembly.\n093527-3 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\nlateral gauges employed were of type J2M-SS-580SF-025\nVishay Micro-Measurements & SR-4 Manganin Pressure\nSensors, calibrated according to the method outline by\nAppleby-Thomas et al.25 \u0002a technique is based upon the pre-\nvious work of Rosenburg and Partom,26 Rosenburg and\nBrar,27 and Millett et al.28\u0003. The lateral gauges were initially\nencapsulated between two 50 \u0005m Mylar® sheets prior to\nsecondary confinement between two PMMA halves with flat\nmount faces. As shown in Fig. 4, this arrangement was then\nemployed as the rear-surface of the hollow casing assembly,\nwith the encased gauge protruding into the target cavity.\nMylar® encapsulation was employed because it enhanced the\nstiffness of the pressure gauge. This property allowed for\naccurate alignment of the gauge element in relation to the\nimpact axis at distances of 4 and 6mm from the copper\/lard\nimpact boundary. In addition to experiments in which a\nMylar® encapsulating layer was used to surround the gauge\nelement, experiments were also conducted in which the\ngauge element protruded further ahead of any encapsulation.\nIn such configurations, only “as-cast” lard surrounded the\ngauge element. Distances of 4 and 6 mm from the front edge\nof the target material were, however, maintained. These two\ndistinct types of lateral gauge experiments were undertaken\nin order to ascertain any effect of localized encapsulation on\ngauge response. All target components were bonded together\nwith Pacer Technology Z-Poxy™, a two-part epoxy resin\ncomprising an epoxy resin and mercaptan hardener.\nIII. RESULTS AND DISCUSSION\nA. Longitudinal response\nShock response data of the adipose material for an im-\npact velocity range of 39–882 m\/s is shown in Table I.\nFigure 5 shows typical front\/rear gauge responses for the\ndynamic loading of the adipose material. A number of key\nfeatures common to most traces are apparent. These have\nbeen labeled \u0002a\u0003–\u0002e\u0003. A small undershoot at shock arrival \u0002a\u0003\noccurred on the front surface gauge. This undershoot has\nbeen seen elsewhere29 and has been attributed to a capaci-\ntance effect as the conducting cover plate moves toward the\ninsulated gauge. The two gauge traces are clearly resolved\nand possess a number of similar features, namely; \u0002i\u0003 rapid\nrise times \u0002b\u0003 of 100–123 ns \u0002indicative of good target align-\nment\u0003, \u0002ii\u0003 a constant \u0002Hugoniot\u0003 stress behind the shock \u0002c\u0003,\nand; \u00023\u0003 a distinctive separation of shock arrival times \u0002\tt\u0003.\nCombined with knowledge of the sample thickness\/\ngauge separation, measurement of the interval between\nshock arrival at successive gauges \u0002\tt\u0003 allowed calculation\nof the shock velocity for a given experiment. In Fig. 5, the\nfront gauge trace shows the stress-time behavior of the adi-\npose material while the rear gauge response shows the stress\nobserved in the PMMA backing. Given knowledge of the\ndensity and measured shock velocity in the target, it is pos-\nsible to convert the rear gauge response to that in the target\nmaterial using Eq. \u00021\u0003, where; ZLard is the shock impedance\nof the lard, ZPMMA is the shock impedance of the PMMA,\nand in general, Z=\u00020Us.\n\bLard =\n1\n2\n\u0002ZLard + ZPMMA\u0003\nZPMMA\n\bPMMA. \u00021\u0003\nInterestingly, the rear gauge response in Fig. 5 has a higher\nHugoniot stress than the front gauge trace. From Eq. \u00021\u0003, this\nimplies that the lard has a lower shock impedance than the\nPMMA. After evolution of the Hugoniot stress within the\nlard sample and PMMA backing, both materials show ini-\ntially elastic release behavior \u0002d\u0003. This is the result of release\nwaves from the rear of the flyer catching up with the shock in\nthe material. Finally, reloading of the adipose material occurs\nat \u0002e\u0003.\nIn Fig. 6 the Us-up Hugoniot for the adipose sample\nmaterial, based on the information presented in Table I, is\ncompared with the Hugoniot of 20 wt % ballistic gelatin9 and\nwater.10 Us errors shown in the Hugoniot were calculated\nFIG. 4. \u0002Color online\u0003 Side views of lateral gauge target assembly.\nTABLE I. Longitudinal experimental data.\nExperiment\nFlyer\nthickness\n\u0002mm\u0003\nImpact\nvelocity\n\u0002m\/s\u0003\nUp\n\u0002mm \/\u0005s\u0003\nUS\n\u0002mm \/\u0005s\u0003\n\bx\n\u0002GPa\u0003\n1 10 39 0.04 1.44 ¯\n2 5 76 0.07 1.75 0.09\n3 5 79 0.08 1.82 0.12\n4 10 183 0.17 2.06 0.31\n5 10 310 0.29 2.29 0.67\n6 10 411 0.39 2.39 0.95\n7 5 489 0.46 2.77 1.26\n8 10 596 0.55 2.87 1.79\n9 10 758 0.70 3.26 2.63\n10 5 882 0.80 3.67 3.08\n093527-4 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\nfrom the possible range of shock arrival times \u0002\tt in Fig. 5\u0003\nand are expressed as maximum and minimum values from\nthe median shock arrival time.\nThe measured longitudinal sound speed of the adipose\nmaterial \u0002cL=1.51\u00060.10 mm \/\u0005s\u0003 holds good correlation\nwith the corresponding values of cL and Hugoniot intercept\nfor ballistic gelatin \u00021.48\u00060.06 mm \/\u0005s and 1.57 mm \/\u0005s,\nrespectively9\u0003. Further, initial observations suggest that the\nHugoniot relationships of water and ballistic gelatin \u0002estab-\nlished elsewhere9,10\u0003 in the Us-up plane are somewhat similar\nto that of the rendered fat at particle velocities \u00041 mm \/\u0005s.\nInformation within the literature suggests that the value\nof Poisson’s ratio for fatty\/adipose materials is approxi-\nmately 0.5. Delalleau et al.30 determined the value of Pois-\nson’s ratio for subcutaneous fat as 0.48 from indentation\nstudies while a value of 0.49 has been adopted during re-\nsearch into deep tissue injury.31 Further, a review presented\nby Palomar et al.32 highlighted the wider acceptance that a\nvalue for Poisson’s ratio for fatty tissues is close to 0.5. As-\nsumption of a value of 0.47 for Poisson’s ratio of the ren-\ndered porcine fat investigated in this work suggests a shear\nwave velocity of 0.35 mm \/\u0005s. This would equate to a bulk\nsound speed for the material of 1.45 mm \/\u0005s, in good agree-\nment with values of 1.42 and 1.44 mm \/\u0005s established ultra-\nsonically elsewhere.33,34 Increasing the value of Poisson’s ra-\ntio for the adipose material to 0.49 \u0002a value used\nelsewhere31\u0003 resulted in a calculated value of c0\n=ca. 1.49 mm \/\u0005s. This value is significantly higher than the\nexpected bulk sound speed for fat\/fatty tissues taken from the\nliterature \u00041.42 mm \/\u0005s \u0002Ref. 33\u0003 and 1.44 mm \/\u0005s \u0002Ref.\n34\u0003\u0005. Consequently, a value of \n=0.49 was considered less\nsuitable than the chosen value of 0.47. A value of c0\n=ca. 1.45 mm \/\u0005s for fat \u0002obtained from \n=0.47\u0003 suggests\nthat slight-curvature of the otherwise-linear Hugoniot rela-\ntionship for the adipose material exists at low particle veloci-\nties. Given the nature of the adipose material and the limited\nsuitability of manganin pressure gauges in measuring shock\nat such low stress levels, detailed interrogation of the sug-\ngested curvature of the Hugoniot in the lower particle veloc-\nity region is not further practicable. Nevertheless, curvature\nat low particle velocity for otherwise linear Hugoniots has\nbeen witnessed elsewhere for polymers.16,35 The linear rela-\ntionships established for Polyethylene, Polypropylene, and\nPolystyrene provide c0 \u0002linear Hugoniot intercept\u0003 values of\n2.34 mm \/\u0005s, 2.90 mm \/\u0005s, and 2.21 mm \/\u0005s,\nrespectively.15 These values are significantly higher than the\nbulk sound speeds \u0002cB\u0003 for each material; 2.05, 2.18, and\n1.83 mm \/\u0005s. Taken together, the combination of experi-\nmental results; the trend in polymers to exhibit lower sound\nspeeds than values obtained through a linear-fit intercept; and\na calculated value of c0 at \u00061.45 mm \/\u0005s for fat \u0002assuming\n-0.25\n0.25\n0.75\n1.25\n1.75\n0 1 2 3 4 5 6 7 8 9\nTime (μs)\nσσ\nx\n(G\nPa\n)\n10\nFront Gauge\nRear Gauge\nΔt\nSample Thickness = 9.906mm\n(a)\n(c)\n(b)\n(c)\n(d)\n(d)\n(e)\n(b)\nFIG. 5. \u0002Color online\u0003 5 mm Cu flyer impacting lard sample at 489 m\/s.\n0.0\n1.0\n2.0\n3.0\n4.0\n0.0 0.2 0.4 0.6 0.8 1.0\nup (mm\/μs)\nU\nS\n(m\nm\n\/ μ\ns)\nLard Hugoniot Lard - longitudinal wave speed\nWater (Nagayama et al.) Fat - estimated sound speed value\nLinear (Lard Hugoniot) Gelatin (Shepherd et al.)\nUs = 1.57 +1.77up\nUs = 1.58 + 2.47up\nUs = 1.45 + 1.99up\nFIG. 6. \u0002Color online\u0003 Us-up Hugoniot of the food-grade lard.\n093527-5 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\n\n=0.49\u0003, further reinforce the suggestion that the bulk sound\nspeed of the rendered porcine fat tested here should be lower\nthan the linear-fit value of c0=1.58 mm \/\u0005s.\nThe main mechanism proposed to explain curvature of\nthe Us-up Hugoniot at lower particle velocities involves two\nstages: \u00021\u0003 primary reduction in the spaces between the poly-\nmeric chains, due to the existence of weak van der Waals\nforces, before; \u00022\u0003 secondary compression of the backbone\ncarbon chain. Although this mechanism is arguably appli-\ncable to polymers in general, Carter et al.16 discussed the\nexistence of phase changes within certain polymeric materi-\nals at low pressures and how these could also account for\nsuch observations. Further, other theories describing this be-\nhavior in polymers also exist, such as the elastic-plastic flow\nmodel,36 which predicts extreme curvature of the Hugoniot\nat low particle velocities. Consequently, the inclusion of the\ndata-point corresponding to an impact velocity of 39 m\/s,\nsuggesting slight-curvature in the Hugoniot of the adipose\nmaterial at low particle velocities, supports evidence that the\nmaterial possesses structural similarity to simple polymers.\nIn terms of basic repeat structure, the polymer chain of\npolyethylene, which does not possess side group attach-\nments, is somewhat similar to lard. Excluding the presence\nof glycerol within the triglyceride molecule, which is both a\nkey structural component of fat and a functional group that\nwill have significant effect of the response of the material to\nshock compression, the two materials both possess a long\ncarbon chain without attachment–essentially a CH2 repeat.\nLard exists as a semi-solid at room temperature due to the\nlargely saturated nature of the fatty acid chains contained\nwithin it. Saturation of fatty materials may vary, however,\nand as discussed,12 the variance in percentage saturation is\nknown to have an effect on material firmness.\nMillett and Bourne15 studied the shock loading of poly-\nethylene \u0002no side group\u0003, polypropylene \u0002methyl side group\u0003,\nand polystyrene \u0002benzene side group\u0003. It was found that as\nthe complexity, or size, of the side chain addition to the\nrepeat unit increased, there was an increase in the shear\nstrength of the material \u0002i.e., its ability to resist compression\nunder shock loading\u0003. Essentially, greater resistance to the\ncompression that accompanies increases in stress was en-\ncountered with more complex polymer chain side groups. It\nhas been postulated that there is a direct link between the key\nshock parameters c0 and S \u0002the shock velocity at up=0 and\nthe slope of the equation-of-state in the Us-up plane, respec-\ntively\u0003 and the physical material properties. Higher values of\nc0 have been linked to a greater resistance to compression,37\nwhile lower values of S have been linked both to increased\nresistance to compression and enhanced material stiffness.38\nAs shown in Fig. 6, the value of S is significantly lower for\ngelatin than lard \u00021.77 and 2.47, respectively\u0003. This suggests\nthat gelatin will show a greater resistance to 1D strain than\nthe adipose material.38\nIn contrast with Shepherd et al.,9 where it was shown\nthat 20 wt % ballistic gelatin behaves hydrodynamically, i.e.,\nit exhibits no significant shear strength, the adipose material\ninvestigated here appears to strengthen under dynamic load-\ning. This behavior is reflected in an increase in the gradient\nof the experimental lard data above the included hydrody-\nnamic lines with increased impact stress in the P-up and P-v\nHugoniot relationships \u0002Figs. 7 and 8, respectively\u0003. The P-up\nHugoniot shown in Fig. 7 also includes the hydrodynamic\nresponse curve for 20 wt % gelatin \u0002experimentally found to\nbe equivalent to the P-up Hugoniot9\u0003. This serves to highlight\na key difference between material behaviors. Hydrodynamic\ncurves are calculated according to Eq. \u00022\u0003. From Fig. 7 it is\napparent that at up= \u00060.7 mm \/\u0005s a difference in pressure\nof ca.0.5 GPa would result between 20 wt % ballistic gelatin\nand the rendered fat. This suggests that there is a significant\ndifference in the response of the two materials at elevated\nparticle velocities. Furthermore, at very high shock pressures\n\u0002beyond the scope of the experiments presented here\u0003 a sub-\nstantial difference in response of the two materials is antici-\npated due to the divergent nature of the two curves.\nP = \u00020Usup. \u00022\u0003\nThe \bx\/pressure value for the datapoint corresponding to the\nlargest stress and particle velocity in the P-up and P-v Hugo-\nniots presented in Figs. 7 and 8 was calculated from the\nrear-surface trace according to Eq. \u00021\u0003. As shown in both\nHugoniot planes, there is some discrepancy between the\nfront and \u0002adjusted\u0003 rear-surface \bx\/pressure for this\ndatapoint. However, despite this discrepancy, in both cases\nmeasurable deviation from the hydrostatic response occurs;\nindicative of strengthening. Adoption of the rear-surface\nvalue for \bx in determining the experimental best-fit was felt\nto be justified here for two reasons: \u0002i\u0003 due to the good agree-\nment with the deviation from the hydrostat apparent for the\n0\n1\n2\n3\n0.0 0.2 0.4 0.6 0.8 1.0\nuP (mm\/μs)\nσ x\n\/P\nin\nth\ne\nla\nrd\n(G\nPa\n)\n20 wt.% Gelatin (Shepherd et al.)\nHydrodynamic Response - Lard\nMeasured Response - Lard\nCalculated Value;\n( )\nPMMA\nPMMA\nPMMALard\nLard Z\nZZ\nσσ\n+\n=\n2\n1\nFIG. 7. P-up Hugoniot of the food-grade lard and 20 wt % gelatin.\n0\n1\n2\n3\n0.80 0.85 0.90 0.95 1.00 1.05\nVolume (cc\/g)\nP\nre\nss\nur\ne\n(G\nP\na)\nHydrodynamic Response\nMeasured Response\nCalculated Value;\n( )\nPMMA\nPMMA\nPMMALard\nLard Z\nZZ\nσσ\n+\n=\n2\n1\nFIG. 8. P-v Hugoniot of the food-grade lard.\n093527-6 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\n758 m\/s datapoint from Table II in Figs. 7 and 8, and; \u0002ii\u0003 due\nto anomalous features on the recorded front-gauge trace\nwhich made determination of a Hugoniot stress problematic.\nThe long-chain structure of lard\/fat and the strengthen-\ning behavior of the material in the P-up plane under shock\nloading appear to be broadly similar to that of simple\npolymers.15,16,39 It therefore seems reasonable to suggest that\nthis biological material has similar properties to its synthetic\ncounterparts in the high stress\/strain-rate regime.\nIt is generally accepted that the shear strength \u0002\u000b\u0003 of a\nmaterial governs its response under shock loading. The rela-\ntionship between shear strength, the pressure \u0002P\u0003, and the\nlongitudinal stress \u0002\bx\u0003 is given in Eq. \u00023\u0003.\n\bx = P +\n4\n3\u000b max, \u00023\u0003\n2\u000b = \bx − \by. \u00024\u0003\nEquation \u00024\u0003 relates longitudinal and lateral stresses gener-\nated within a material to the materials shear strength. Both\nstresses are known to vary with impact velocity. As such,\nknowledge of both \bx and \by evolution within the rendered\nporcine fat for a range of impact conditions should allow\ncharacterization of its shear strength response to shock.\nB. Lateral response\nA total of four experiments were conducted to investi-\ngate the lateral stresses generated within the rendered porcine\nfat under shock loading conditions. Further, comparison has\nbeen made between the effects of the presence, or lack there-\nof, of an encapsulating Mylar® layer around the gauge ele-\nment \u0002but not ahead of the gauge\u0003 upon the response of the\ngauge to shock. Initially, two 10 mm thick copper flyer-plate\nexperiments at impact velocities of 405 and 682 m\/s were\nconducted. Here, lateral gauges were encapsulated between\ntwo 50 \u0005m Mylar® layers before lard was cast around the\ngauge package. A further two experiments, in which no en-\ncapsulating Mylar® layer was present, were conducted at im-\npact velocities of 346 and 804 m\/s, also using 10 mm copper\nflyer-plates.\nLateral gauges are typically employed to investigate the\ndevelopment of lateral stresses in metals and polymers.24,40,41\nDespite the nature of the food-grade lard, i.e., its semisolid\nstate at room temperature, the techniques used in this work\nhave allowed for successful measurement of a material re-\nsponse. Adopting a value of c0=1.45 mm \/\u0005s,33,34 and tak-\ning Poisson’s ratio to be 0.47, lateral response data for the\nadipose material has been presented in this work as cali-\nbrated stress-time plots, see Fig. 9. At impact velocities of\n804 and 346 m\/s the gauge element was positioned 4 mm\nfrom the impact face of the target, while a distance of 6 mm\nwas used during the 682 and 405 m\/s impacts. Such place-\nment corresponds to distances of 6 mm and 4 mm, respec-\ntively, from the rear of the 10 mm target ring in all but the\n346 m\/s shot. In the case of the 346 m\/s impact, a smaller\ntarget ring thickness of 6mm meant that the gauge element\nsat only 2 mm from the rear of the target when placed at a\ndistance of 4 mm from the impact face. This arrangement\nproduced unfavorable noise within the 346 m\/s trace from t\n=ca.1.5 \u0005s onwards, most likely due to re-loading upon re-\nflection of the shock from the rear of the target. As a result,\n346 m\/s data for t\u00031.56 \u0005s after impact has been omitted\nfrom the lateral gauge traces in Fig. 9. The square markers\non gauge traces in Fig. 9 correspond to the range over which\ngradients behind the shock have been established. Circular\nmarkers correspond to the range over which average stress\nvalues have been measured in order to give an indication of\nthe shear strength of the material over that time.\nThere are a number of points to note from the lateral\nresponse data for the adipose material \u0002see Fig. 9\u0003. First, as\nimpact velocity increases, so do both the initial gradient and\namplitude of the gauge response corresponding to shock ar-\nrival. Such behavior is indicative of \u0002i\u0003 an increase in shock\nvelocity, and, \u0002ii\u0003 the subsequent increase in pressure gener-\nated within the target material as a result of greater shock\nvelocity. However, it should be noted that such a combined\nresponse is generally expected from the relative change in\nimpact conditions.\nInitial overshoots \u0002a\u0003 can be seen to occur upon shock\narrival at impact velocities of 405, 682, and 804 m\/s in Fig.\n9; however, this artifact appears to be significantly enhanced\nin targets where an encapsulating layer was present, i.e., at\nimpact velocities of 405 and 682 m\/s. Notably, an overshoot\nis not clearly discernible at 346 m\/s, which lacked a Mylar®\nencapsulating layer. Similar overshoots to those seen in the\nlateral response of the adipose material have been observed\nin longitudinal gauge traces \u0002Fig. 5\u0003. This behavior in longi-\ntudinal gauges, however, has been attributed to an electrical\ncapacitance effect between the gauge and the surface of the\ntarget material.29\nOne explanation proposed in the literature for such over-\nshoots in lateral gauge response is based on the concept of\ndiffering shock velocities in the target\/matrix \u0002generally met-\nals and polymers\u0003 and the encapsulation layer, leading to the\nformation of a Mach-stem. Hydrocode simulations under-\ntaken by Winter and Harris42 indicated that if the shock in\nTABLE II. Lateral gauge gradients established behind the shock.\nImpact velocity \u0002m\/s\u0003 346 405 682 804\nGradient behind the\nshock \u0002GPa \/\u0005s\u0003 \f0.018 37 \f0.049 96 \f0.050 80 \f0.020 97\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0 1 2 3 4 5\nTime (μs)\nS\ntre\nss\n(G\nP\na)\n346m\/s\n405m\/s\n682m\/s\n804m\/s\n(a)\n(a)\n(a)\n(b)\n(b)\n(b)\n(c)\n(c)\n(c)\nFIG. 9. \u0002Color online\u0003 Lateral shock-response of lard.\n093527-7 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\nthe matrix runs ahead of the shock in the encapsulation, the\npressure, and hence the determinant stress, will be initially\ncharacterized by an overshoot with a subsequent decay in\nmagnitude behind. Conversely, a continuous rise in pressure\/\nstress with time would be apparent when the shock in the\nmatrix lags the shock in the encapsulation.\nSlight negative gradients are apparent behind the shock\nin the adipose material \u0004see \u0002b\u0003 in Fig. 9\u0005. However, it should\nbe stressed that the relatively noisy nature of the \by stress\nresponse behind the shock—attributed to the nature of the\nadipose material under test makes determination of such gra-\ndients highly subjective. Nevertheless, the calculated magni-\ntudes of the gradients taken between the two square markers\non gauge traces and the circular markers on the 346 m\/s trace\nare presented in Table II. In addition to the observed reduc-\ntion in the overshoot in stress witnessed upon shock arrival,\nthe gradients in Table II appear to suggest that the lack of\nencapsulating Mylar® also reduces the magnitude of the\nnegative gradient established behind the shock. This appears\nto be the case for both maximum and minimum impact ve-\nlocities tested here. At first glance, experimental results seem\nto suggest that the overshoot witnessed upon shock arrival is,\nas proposed by Winter and Harris,42 an artifact caused by\nMach-stem formation between the matrix and the encapsu-\nlating Mylar® layer\/gauge packaging. However, the combi-\nnation of; \u0002i\u0003 rapid rise times witnessed for longitudinal\ngauges \u0002\u0004125 ns\u0003, suggesting a close match in impedance\nbetween the gauge packaging and the epoxy resin used in\ntarget construction and \u0002ii\u0003 the form of the Hugoniot relation-\nships of epoxy resin and PMMA within the literature \u0004Us\n=2.65+1.55up \u0002Ref. 43\u0003 and Us=2.59+1.52up,16 respec-\ntively\u0005 suggests that the velocity of the shock in the gauge\nencapsulation, modeled as either PMMA or epoxy resin, will\nbe greater than the velocity of the shock in the matrix \u0002lard\u0003\nat particle velocities \u00041.16 mm \/\u0005m. Lateral experiments\nconducted here correspond to particle velocities of less than\n1 mm \/\u0005s. Consequently, the overshoots witnessed in stress\nupon shock arrival are unlikely to be the result of a Mach-\nstem between the matrix and the gauge package in this case.\nEvidence of a slight overshoot at the higher impact velocity\nof 804 m\/s, despite exclusion of an encapsulating Mylar®\nlayer, suggests that the overshoot is part of an inherent re-\nsponse of lateral gauges to the onset of shock. However, it is\nreasonable to suggest that this artifact may only be observed\nat significant levels at higher impact velocities, e.g., 804 m\/s.\nAt point \u0002c\u0003 in Fig. 9, reloading occurs, most likely as the\nresult of a reflection of the shock from the PMMA backing\nmaterial, due to its higher density and shock impedance.\nFor a given material, if longitudinal stress remains con-\nstant while lateral stress decreases, Eq. \u00024\u0003 suggests that the\nshear strength will increase. The adipose material has been\nobserved to exhibit both constant longitudinal stress \u0004see\npoint \u0002c\u0003 in Fig. 5\u0005 and indications of a possible slight nega-\ntive gradient behind the shock in lateral investigations. This\ntherefore suggests the possibility of an increase in shear\nstrength within the material under shock loading conditions.\nHowever, the magnitudes of the gradients established behind\nthe shock and lack of any significant change in gradient for a\nrange of impact velocities implies that any increase in shear\nstrength is; \u0002a\u0003 minimal and \u0002b\u0003 independent of the shock\nvelocity, i.e., an increased shock velocity within the adipose\nmaterial may not result in an increase in the rate of change in\nshear strength. Furthermore, the relatively small magnitude\nof the gradients recorded behind the shock may suggest that\nsuch measurements lie close to the limit of experimental\nnoise. Appleby-Thomas et al.44 previously presented a lim-\nited part of the data set shown in Fig. 9 as raw voltage data.\nObservations from this previous data set showed \u0002i\u0003 a more\nsignificant rate of change of increase in shear strength for the\nadipose material and \u0002ii\u0003 a pressure-dependant rate of change\nin shear strength. Such observations contradict those pre-\nsented for the material here. However, it is reasonable to\nsuggest that the raw voltage data for the adipose material\nmay not completely correspond to lateral stress interpreta-\ntions. Despite the listed differences between stress-time and\nvoltage-time lateral data, and the fact that it is hard to decon-\nvolute experimental data from noise, both sets of results are\nin agreement that a \u0002small\u0003 change in shear strength appears\nto be observed for the rendered porcine fat under shock load-\ning. This result correlates well with lateral response data for\npolymers observed elsewhere.39,25\nThe dynamic shear strength response of the polymeric\nmaterial, Sylgard, has been investigated.41 Notably, a similar\nexperimental approach was taken i.e., the casting of lateral\ngauges within the target material. Sylgard was shown to pos-\nsess an increase in lateral stress with time behind the\nshock-in likeness with the apparent response of the adipose\nmaterial here. In both cases, this has been shown to result in\nan increase in shear strength with time; however, the data\npresented for Sylgard does not clearly indicate the possible\nexistence of a pressure-dependent rate of change in shear\nstrength with time i.e., steepening of the negative lateral\nstress gradient behind the shock. It is postulated that, while\nthe rendered fat strengthens at a rate that is independent of\nthe pressures investigated here, shown via a mechanism of\nnegligible change in lateral stress gradient behind the shock,\nSylgard would exhibit a pressure-dependent response due to\ncross-linkage between its polymeric chains. This suggestion\nis backed by the pressure-dependent rate of change in shear\nstrength response of resin transfer molding \u0002RTM\u0003 6, also\nexhibiting cross-linkage, provided by Appleby-Thomas et\nal.25\nThe increase in deviation of the Hugoniot stress of the\nadipose material above the hydrodynamic curve in the P-up\nand P-v planes is suggestive of the fact that the material\nexhibits increased strengthening with pressure. However, this\nbehavior is only significant at higher impact velocities, e.g.,\n758 and 882 m\/s. As discussed, the adipose material has been\nshown to exhibit a minimal rate of change in lateral stress,\nand hence shear strength, with increased pressure over the\nrange of impact conditions examined here. Given this, it\nseems reasonable to suggest that the homogenous rendered\nfat might exhibit an increase in negative gradient, corre-\nsponding to an increased rate of change in lateral stress, at\nhigher pressures than those examined here. Absence of such\na response at elevated pressures would suggest saturation of\nany strengthening mechanism at shock pressures of the order\nof those examined here. It has also been shown that, while\n093527-8 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\nthe rate of change in shear strength behind the shock is a\ntime-dependent response of the adipose material, the signifi-\ncant increase in constant longitudinal stresses above the hy-\ndrodynamic response appears to be a near instantaneous re-\nsponse of the material to the onset of shock.\nIV. CONCLUSIONS\nFlyer-plate impact experiments have successfully al-\nlowed for the formation of an equation-of-state for a ren-\ndered porcine fat, with the linear form Us=1.58+2.47up\ngiven a density of 0.9451 g \/cm3.\nThis work has shown that a ca. approximately 99.8% fat\nmaterial—highly analogous to human body fat—exhibits a\nstrengthening characteristic when subjected to dynamic load-\ning within the high strain-rate range of investigations. Both\nthe equation-of-state and the strengthening characteristic of\nthe material under shock loading provide contrasting behav-\nior to that of water and 20 wt % ballistic gelatin.\nAlthough an excellent medium for displaying projectile\nbehavior under impact, by mechanism of transparency, bal-\nlistic gelatin cannot be fully representative of fatty tissues,\nskeletal muscle, or the varying types of smooth muscle\nwhich make up the hollow organs, glands, and skin. In gen-\neral, it is not reasonable to assume that these tissue types\npossess a lack of significant strength, as shown for ballistic\ngelatin or water under shock loading.\nInvestigations into the lateral response of the adipose\nmaterial have highlighted several key features, namely; \u00021\u0003\nthe adipose material appears to display a very small increase\nin shear strength behind the shock, albeit subject to a some-\nwhat subjective choice of gradient measurement sampling\npositions; \u00022\u0003 the rate of change in the apparent increase in\nshear strength in the lard appears to be independent of im-\npact stress, and; \u00023\u0003 the initial overshoot in stress witnessed\nin lateral gauge traces upon shock arrival is unlikely to be the\nresult of Mach-stem formation between the encapsulation\/\ngauge package and matrix \u0002lard\u0003.\nThe tested adipose material in this work provides an ini-\ntial data set and characteristic behavior of a material that, to\nthe best of the authors’ knowledge, has previously remained\nun-tested under such loading regimes. The behavior of the\nmaterial has been investigated for a range of impact pres-\nsures corresponding to the limitations of the adopted experi-\nmental technique i.e., the single-stage gas gun employed dur-\ning experiments. As such, future work may seek to highlight\n\u0002i\u0003 the behavior of the material at higher pressures than those\ninvestigated in this paper and \u0002ii\u0003 possible differences in the\ndynamic properties of various classes\/grades of fat.\nACKNOWLEDGMENTS\nThe authors would like to acknowledge the invaluable\ntechnical assistance provided by Mr Andy Roberts of the\nDynamic Response Group, Cranfield University. One of the\nauthors, James Wilgeroth, who is a Ph.D. student at Cranfield\nUniversity, is indebted to Cranfield Defense and Security for\nthe funding that made this work possible.\n1J. H. McElhaney, J. Appl. Physiol. 21, 4 \u00021966\u0003.\n2H. Saraf, K. T. Ramesh, A. M. Lennon, A. C. Merkle, and J. C. Roberts,\nJ. Biomech. 40, 1960 \u00022007\u0003.\n3M. M. Al-Mousawi, S. R. Reid, and W. F. Deans, Proc. Inst. Mech. Eng.\n211, 4 \u00021997\u0003.\n4S. T. Marais, R. B. Tait, T. J. Cloete, and G. N. Nurick, Latin American\nJournal of Solids and Structures 1, 319 \u00022004\u0003.\n5B. Song, W. Chen, Y. Ge, and T. Weerasooriya, J. Biomech. 40, 2999\n\u00022007\u0003.\n6O. A. Shergold, N. A. Fleck, and D. Radford, Int. J. Impact Eng. 32, 1384\n\u00022006\u0003.\n7C. Van Sligtenhorst, D. S. Cronin, and G. Wayne Brodland, J. Biomech.\n39, 10 \u00022006\u0003.\n8C. P. Salisbury and D. S. Cronin, Exp. Mech. 49, 829 \u00022009\u0003.\n9C. J. Shepherd, G. J. Appleby-Thomas, P. J. Hazell, and D. F. Allsop, AIP\nConf. Proc. 1195, 1399 \u00022009\u0003.\n10K. Nagayama, Y. Mori, Y. Motegi, and M. Nakahara, AIP Conf. Proc. 845,\nII \u00022006\u0003.\n11K. Nagayama, Y. Mori, Y. Motegi, and M. Nakahara, Shock Waves 15,\n267 \u00022006\u0003.\n12T. Nishioka and M. Irie, Meat Sci. 70, 399 \u00022005\u0003.\n13B. R. Mackenna and R. Callander, Illustrated Physiology, 5th ed. \u0002Long-\nman Group HK Limited, Edinburgh, 1997\u0003, p. 266.\n14R. R. Seeley, T. D. Stephen, and P. Tate, Anatomy and Physiology \u0002Bur-\nrRich, Boston, 1996\u0003.\n15J. C. F. Millett and N. K. Bourne, J. Phys. D 37, 20 \u00022004\u0003.\n16W. J. Carter, S. P. Marsh, and R. G. McQueen, Los Alamos National\nLaboratory Report No. LA-13006-MS, 1995.\n17F. M. White, Fluid Mechanics, 3rd ed. \u0002McGraw-Hill, New York, 1994\u0003.\n18G. J. Appleby-Thomas, P. J. Hazell, C. Stennett, G. Cooper, K. Helaar, and\nA. M. Diederen, J. Appl. Phys. 105, 064916 \u00022009\u0003.\n19N. K. Bourne and J. C. F. Millett, Proc. R. Soc., Math. Physic. Eng. Sci.\n459, 2031 \u00022003\u0003.\n20N. K. Bourne, Meas. Sci. Technol. 14, 273 \u00022003\u0003.\n21V. E. Keilin and V. K. Shleifman, J. Appl. Phys. 51, 7 \u00021980\u0003.\n22M. A. Meyers, Dynamic Behavior of Materials \u0002John Wiley & Sons, New\nYork, 1994\u0003.\n23G. J. Appleby-Thomas, P. J. Hazell, J. Millett, and N. K. Bourne, AIP\nConf. Proc. 1195, 533 \u00022009\u0003.\n24J. C. F. Millett, G. Whiteman, and N. K. Bourne, J. Appl. Phys. 105,\n033515 \u00022009\u0003.\n25G. J. Appleby-Thomas, P. J. Hazell, and C. Stennett, J. Mater. Sci. 44,\n6187 \u00022009\u0003.\n26Z. Rosenberg and Y. Partom, J. Appl. Phys. 58, 8 \u00021985\u0003.\n27Z. Rosenberg and N. S. Brar, J. Appl. Phys. 77, 4 \u00021995\u0003.\n28J. C. F. Millett, N. K. Bourne, and Z. Rosenberg, J. Phys. D 29, 2466\n\u00021996\u0003.\n29N. K. Bourne and Z. Rosenberg, Meas. Sci. Technol. 8, 570 \u00021997\u0003.\n30A. Delalleau, G. Josse, J. Lagarde, H. Zahouani, and J. Bergheau, J. Bio-\nmech. 39, 9 \u00022006\u0003.\n31J. J. Elsner and A. Gefen, J. Biomech. 41, 3322 \u00022008\u0003.\n32J. V. Soulis, G. D. Giannoglou, Y. S. Chatzizisis, K. V. Seralidou, G. E.\nParcharidis, and G. E. Louridas, Med. Eng. Phys. 30, 9 \u00022008\u0003.\n33C. Li, N. Duric, P. Littrup, and L. Huang, Ultrasound Med. Biol. 35, 10\n\u00022009\u0003.\n34H. Shin, R. Prager, H. Gomersall, N. Kingsbury, G. Treece, and A. Gee,\nUltrasonics 50, 716 \u00022010\u0003.\n35G. J. Appleby-Thomas, P. J. Hazell, C. Stennett, and G. Cooper, 9th In-\nternational Conference on the Mechanical and Physical Behaviour of Ma-\nterials under Dynamic Loading, DYMAT 2009, 7–11 September 2009,\nBrussels, Belgium, Vol. 2, p. 1081.\n36D. N. Schmidt and M. W. Evans, Nature \u0002London\u0003 206, 1348 \u00021965\u0003.\n37J. C. F. Millett, N. K. Bourne, and J. Akhavan, J. Appl. Phys. 95, 9 \u00022004\u0003.\n38L. Davison and R. A. Graham, Phys. Rep. 55, 255 \u00021979\u0003.\n39N. K. Bourne, J. C. F. Millett, and S. G. Goveas, J. Phys. D 40, 5714\n\u00022007\u0003.\n40J. C. F. Millett, G. T. Gray III, and N. K. Bourne, J. Appl. Phys. 101,\n033520 \u00022007\u0003.\n093527-9 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\n41J. C. F. Millett, G. Whiteman, S. M. Stirk, and N. K. Bourne, Society for\nExperimental Mechanics—SEM Annual Conference and Exposition on\nExperimental and Applied Mechanics, 1–4 June, 2009, Albuquerque, NM\n\u0002Curran Associates, Inc., Red Hook, NY, 2009\u0003, Vol. 1, p. 498.\n42R. E. Winter and E. J. Harris, J. Phys. D 41, 3 \u00022008\u0003.\n43P. J. Hazell, C. Stennett, and G. Cooper, Polym. Compos. 29, 1106 \u00022008\u0003.\n44G. J. Appleby-Thomas, P. J. Hazell, J. M. Wilgeroth, and D. C. Wood, J.\nAppl. Phys. 108, 033524 \u00022010\u0003.\n093527-10 Wilgeroth, Hazell, and Appleby-Thomas J. Appl. Phys. 108, 093527 \u00032010\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/jap.aip.org\/jap\/copyright.jsp\n"}