{"doi":"10.1103\/PhysRevLett.91.167205","coreId":"66495","oai":"oai:dro.dur.ac.uk.OAI2:1360","identifiers":["oai:dro.dur.ac.uk.OAI2:1360","10.1103\/PhysRevLett.91.167205"],"title":"Direct observation of orbital ordering in La0.5Sr1.5MnO4 using soft x-ray diffraction.","authors":["Wilkins, S. B.","Spencer, P. D.","Hatton, P. D.","Collins, S. P.","Roper, M. D.","Prabhakaran, D.","Boothroyd, A. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-10","abstract":"We report the first direct resonant soft x-ray scattering observations of orbital ordering. We have\\ud\nstudied the low temperature phase of La0:5Sr1:5MnO4, a compound that displays charge and orbital\\ud\nordering. Previous claims of orbital ordering in such materials have relied on observations at the\\ud\nmanganese K edge. These claims have been questioned in several theoretical studies. Instead we have\\ud\nemployed resonant soft x-ray scattering at the manganese LIII and LII edges which probes the orbital\\ud\nordering directly. Energy scans at constant wave vector are compared to theoretical predictions and\\ud\nsuggest that at all temperatures there are two separate contributions to the scattering: direct orbital\\ud\nordering and strong cooperative Jahn-Teller distortions of the Mn3 ions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66495.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1360\/1\/1360.pdf","pdfHashValue":"13d92ea9e627316bc345663e85e9c24a5f065460","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1360<\/identifier><datestamp>\n      2010-09-13T13:15:18Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Direct observation of orbital ordering in La0.5Sr1.5MnO4 using soft x-ray diffraction.<\/dc:title><dc:creator>\n        Wilkins, S. B.<\/dc:creator><dc:creator>\n        Spencer, P. D.<\/dc:creator><dc:creator>\n        Hatton, P. D.<\/dc:creator><dc:creator>\n        Collins, S. P.<\/dc:creator><dc:creator>\n        Roper, M. D.<\/dc:creator><dc:creator>\n        Prabhakaran, D.<\/dc:creator><dc:creator>\n        Boothroyd, A. T.<\/dc:creator><dc:description>\n        We report the first direct resonant soft x-ray scattering observations of orbital ordering. We have\\ud\nstudied the low temperature phase of La0:5Sr1:5MnO4, a compound that displays charge and orbital\\ud\nordering. Previous claims of orbital ordering in such materials have relied on observations at the\\ud\nmanganese K edge. These claims have been questioned in several theoretical studies. Instead we have\\ud\nemployed resonant soft x-ray scattering at the manganese LIII and LII edges which probes the orbital\\ud\nordering directly. Energy scans at constant wave vector are compared to theoretical predictions and\\ud\nsuggest that at all temperatures there are two separate contributions to the scattering: direct orbital\\ud\nordering and strong cooperative Jahn-Teller distortions of the Mn3 ions.<\/dc:description><dc:subject>\n        Magnetic order<\/dc:subject><dc:subject>\n         Manganites<\/dc:subject><dc:subject>\n         Scattering<\/dc:subject><dc:subject>\n         Charge<\/dc:subject><dc:subject>\n         Lamn03.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review letters, 2003, Vol.91(16), pp.167205 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1360<\/dc:identifier><dc:identifier>\n        issn:0031-9007<\/dc:identifier><dc:identifier>\n        issn: 1079-7114<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevLett.91.167205<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1360\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.91.167205<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1360\/1\/1360.pdf<\/dc:identifier><dc:rights>\n        © 2003 by The American Physical Society. All rights reserved. <\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0031-9007"," 1079-7114","issn:0031-9007","issn: 1079-7114"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Magnetic order","Manganites","Scattering","Charge","Lamn03."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n13 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWilkins, S. B. and Spencer, P. D. and Hatton, P. D. and Collins, S. P. and Roper, M. D. and Prabhakaran, D.\nand Boothroyd, A. T. (2003) ’Direct observation of orbital ordering in La0.5Sr1.5MnO4 using soft x-ray\ndiffraction.’, Physical review letters., 91 (16). p. 167205.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.91.167205\nPublisher’s copyright statement:\n2003 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nDirect Observation of Orbital Ordering in La0:5Sr1:5MnO4 Using Soft X-ray Diffraction\nS. B. Wilkins,* P. D. Spencer, and P. D. Hatton\nDepartment of Physics, University of Durham, Rochester Building, South Road, Durham, DH1 3LE, United Kingdom\nS. P. Collins† and M. D. Roper\nDaresbury Laboratory, Warrington, Cheshire WA4 4AD, United Kingdom\nD. Prabhakaran and A.T. Boothroyd\nDepartment of Physics, University of Oxford, Clarendon Laboratory, Parks Road, Oxford OX1 3PU, United Kingdom\n(Received 24 April 2003; published 16 October 2003)\nWe report the first direct resonant soft x-ray scattering observations of orbital ordering. We have\nstudied the low temperature phase of La0:5Sr1:5MnO4, a compound that displays charge and orbital\nordering. Previous claims of orbital ordering in such materials have relied on observations at the\nmanganese K edge. These claims have been questioned in several theoretical studies. Instead we have\nemployed resonant soft x-ray scattering at the manganese LIII and LII edges which probes the orbital\nordering directly. Energy scans at constant wave vector are compared to theoretical predictions and\nsuggest that at all temperatures there are two separate contributions to the scattering: direct orbital\nordering and strong cooperative Jahn-Teller distortions of the Mn3\u0001 ions.\nDOI: 10.1103\/PhysRevLett.91.167205 PACS numbers: 75.25.+z, 61.10.–i, 71.30.+h, 75.47.Lx\nNearly 50 years ago, Goodenough [1] proposed that\nperovskite manganites such as La1\u0002xCaxMnO3 would be\norbitally ordered, consisting of a low temperature insu-\nlating phase containing two sublattices resulting from\ncharge ordering between Mn3\u0001 and Mn4\u0001 ions. In addi-\ntion, this would be accompanied by orbital ordering,\nwhereby the 3d3z2\u0002r2 Mn3\u0001 orbitals (associated with the\nlong Mn3\u0001-O bonds in the Jahn-Teller distorted Mn3\u0001O6\noctahedra) in the form of zigzag chains. This ordering\nwould entail concomitant displacements of the Mn4\u0001O6\noctahedra. Since then various crystallographic studies\nhave established the correlation between structural, mag-\nnetic, and transport properties, and have detailed the\ncharge and spin ordering observed at low temperatures\nin addition to the correlated Jahn-Teller distortions. Until\nrecently, however, very little was known about the role of\norbital ordering. This situation has changed dramatically\nin the past few years following the claim of direct de-\ntection of orbital ordering by resonant x-ray scattering\ntechniques. Murakami et al. [2] employed anomalous\nscattering to observe orbital ordering in La0:5Sr1:5MnO4.\nBy tuning to the Mn3\u0001 K edge, they observed a sharp\nreflection at \u000334 ; 34 ; 0\u0004. The observation of such reflections is\nruled out by the crystal symmetry of the high tempera-\nture structure, and can proceed only if the symmetry is\nreduced by some mechanism, such as the Jahn-Teller\neffect. Such resonant techniques have since been used to\nclaim orbital order in a number of manganites such as\nLaMnO3 [3] and other materials, based on the assumption\nthat anisotropy in the Mn 4p band, probed by 1s-4p\nexcitations at the Mn K edge, arises from interaction\nwith the anisotropic 3d states. The claim that such\ntechniques offer a direct probe of orbital ordering has\nattracted considerable criticism and debate [4–7]. Theo-\nretical studies have shown that a more likely explanation\nis that the isotropic resonance effect is caused by the\noxygen displacements related to the cooperative Jahn-\nTeller effect. Recently, a theoretical paper suggested the\nuse of resonant x-ray scattering at the LIII and LII edges of\nMn3\u0001 [8], which directly probe the 3d states and give\nenergy resonances which distinguish between the two.\nIn a previous paper [9], we demonstrated how it was\npossible to use resonant enhancement at the L edge of\nmanganese to observe antiferromagnetic ordering at\nlow temperatures. In this Letter, we report the first un-\nambiguous observation of orbital ordering using soft\nx-ray diffraction and will demonstrate by using the spe-\ncific theoretical predictions of Castleton and Altarelli\n[8] that the orbital ordering is caused by Jahn-Teller\ndisplacements.\nLa0:5Sr1:5MnO4 is a typical transition metal oxide dis-\nplaying strongly correlated electron states. Upon cooling,\nthe material undergoes a phase transition at TCO \u0005 240 K\ninto a charge ordered state in which there is a unit differ-\nence in the valence states between subsequent manganese\natoms (see Fig. 1). In addition to the structural Bragg\nreflections of the high temperature I4=mmm phase (a \u0005\nb \u0005 3:86 \u0013A, c \u0005 12:40 \u0013A), other reflections at a wave\nvector of \u000312 ; 12 ; 0\u0004 have been observed which are a result\nof this charge ordered state that doubles the unit cell\n[10]. In addition, peaks with a wave vector of \u000314 ; 14 ; 0\u0004\nhave been observed in electron diffraction measure-\nments [11,12]. However, subsequent x-ray and neutron\nstudies have confirmed the presence of the quarter-wave\nP H Y S I C A L R E V I E W L E T T E R S week ending17 OCTOBER 2003VOLUME 91, NUMBER 16\n167205-1 0031-9007=03=91(16)=167205(4)$20.00  2003 The American Physical Society 167205-1\nmodulation [2,13]. This additional wave vector implies\nthat the a and b axes of this high temperature tetragonal\nphase are quadrupled. However, a smaller A-centered\northorhombic unit cell, rotated by 45\u0006 with ao \u0007 bo \u0007\n2\n\u0001\u0001\u0001\n2\np\nat and co \u0005 ct, can be used to index all the reflections.\nThe nature of this additional modulation is still unclear.\nK edge resonant x-ray scattering was used to claim that\nthis quarter-wave modulation was due to orbital ordering\n[2]. Another study using nonresonant techniques sug-\ngested that this could be caused by cooperative Jahn-\nTeller distortions causing a shear-type distortion, similar\nto that proposed in La0:5Ca0:5MnO3 and LaSr2Mn2O7\n[13]. Irrespective of the mechanism, it is clear that orbital\norder develops at the same temperature as the charge\nordering (TOO \u0005 TCO \u0005 240 K).\nFurther cooling results in long-range spin ordering,\nobserved by neutron scattering [10] as a complex\nantiferromagnetic ordering at TN \u0005 110 K. Magnetic sus-\nceptibility measurements give a much higher antiferro-\nmagnetic transition temperature, concurrent with the\ncharge and orbital ordering [14]. It therefore seems likely\nthat in-plane antiferromagnetic order develops at 240 K\n[TN\u0003ab\u0004 \u0005 TCO \u0005 TOO] consistent with the rodlike neu-\ntron scattering reported between TN and TCO [10]. This\nin-plane antiferromagnetic order then develops fully\nthree dimensionally at TN\u0003c\u0004 \u0005 160 K. At the Mn3\u0001 sites\n(3d4) the Hund’s rule coupling is strong and the crystal\nfield has a large cubic (Oh) component. This causes a\ntwofold degenerate configuration t32g\"e1g\". This degeneracy\ncan be lifted by a Jahn-Teller distortion of the MnO6\noctahedron reducing the symmetry to D4h and separating\nthe two components of the eg\" level into 3d3z2\u0002r2\" and\n3dx2\u0002y2\". Goodenough [1] showed that the spin ordering is\ndependent upon the ordering of this orbital degree of\nfreedom and, hence, a distinctive ‘‘herringbone’’ pattern\nof the orbitals is required to explain the observed anti-\nferromagnetic spin structure. This orbital order pattern\nhas a wave vector of \u000314 ; 14 ; 0\u0004.\nThere are thus at least two possible mechanisms to\naccount for the observed orbital ordering. It could arise\nfrom spin ordering that forms at TN . Alternatively, the\norbital ordering could be a consequence of the coopera-\ntive Jahn-Teller that forms at TCO. In some manganites,\nsuch as LaMnO3 [15] and La0:5Ca0:5MnO3 [16], the extent\nof the Jahn-Teller distortions has been observed using\ncrystallographic refinements of neutron and x-ray diffrac-\ntion. The distortions vary between 7% and 12% suggest-\ning that the Jahn-Teller mechanism may be important.\nHowever, in La0:5Sr1:5MnO4 the MnO6 octahedra appear\nto be almost undistorted with a fractional change in the\nMn-O bond length of only \u0007 1% [10]. This led to the\nsuggestion that in La0:5Sr1:5MnO4 the principal mecha-\nnism was the Goodenough spin mechanism.\nIn order to understand the interaction and interdepen-\ndence of the charge, spin, orbital, and Jahn-Teller\ndistortion degrees of freedom, it is vital to develop tech-\nniques that can distinguish between orbital and coopera-\ntive Jahn-Teller ordering. The K edge experiment of\nMurakami et al. is only an indirect indication of 3d\norbital ordering as they probe the 4p states. Any sensi-\ntivity of the 4p band to the splittings in the 3d electron\nband was believed to arise from a combination of\nCoulomb interaction with the ordered 3d electrons and\nJahn-Teller distortions [4]. However, subsequent theoreti-\ncal studies have shown that K edge experiments are about\n100 times more sensitive to Jahn-Teller distortions. The\nobvious method is resonant scattering at the L edges,\nwhich directly probe the 3d states.\nThe present experiments were conducted on station\n5U1 at the Synchrotron Radiation Source (SRS) at Dares-\nbury Laboratory. A single crystal of La0:5Sr1:5MnO4 was\nused with dimensions \u00034\n 4\n 1\u0004 mm3. The sample\nwas cut and polished with [110] surface normal, and\naligned in the two-circle diffractometer [17] with the\n[110] and [001] axes defining the diffraction plane. The\nbeam line produces an energy resolution of \u0018E \u0007 1 eV at\n640 eV. The incident photon energy was tuned to the\nmanganese LIII edge (639 eV) and a search was under-\ntaken for a superlattice reflection at \u000314 ; 14 ; 0\u0004. This reflec-\ntion has a Bragg angle of \u001d \u0005 62:9\u0006 at 640 eV and a\nclear peak was observed here; a scan taken parallel to\nthe scattering vector is shown in the inset of Fig. 2.\nThe peak was well defined with a Lorentzian squared\nline shape, significantly broader than the instrumental\nresolution.\nFIG. 1 (color online). Schematic representation of the pro-\nposed orbital order pattern in the a-b plane.\nP H Y S I C A L R E V I E W L E T T E R S week ending17 OCTOBER 2003VOLUME 91, NUMBER 16\n167205-2 167205-2\nAn energy scan was then undertaken at constant wave\nvector, the results of which are shown in Fig. 2. No\nscattering above background was observed away from\nthe LIII and LII edges. We are therefore confident that\nthese effects are dominated by ordering of the Mn3\u0001\nsublattice. The interpretation of the energy scan of Fig. 2\nrelies on the work of Castleton and Alterelli [8]. In their\npaper, they made specific predictions based on atomic\nmultiplet calculations as to the energy dependence of\nthe L edge orbital ordering reflection in La0:5Sr1:5MnO4.\nThey even calculated the different types of resonance that\nwould be observed if the orbital ordering originated from\na direct Goodenough model, or as a consequence of\ncooperative Jahn-Teller distortions.\nThe energy scan of Fig. 2 displays four clear features.\nThe calculations of Castleton and Altarelli predict four\nmajor features, which were interpreted within a simple\none-electron picture of Mn3\u0001. The energy dependence\ncarries specific information regarding the type and\norigin of the orbital ordering. In the K edge experiments\nof Murakami [2] it was impossible to differentiate\nbetween the 3d3x2\u0002r2=3d3y2\u0002r2 ordering and the alterna-\ntive 3dx2\u0002z2=3dz2\u0002y2 ordering. However, Castleton and\nAltarelli [8] include in their paper calculations for both\ntypes of orderings that are very different. A brief com-\nparison of our data and their calculations would suggest\nthat the orbital ordering in La0:5Sr1:5MnO4 consists of the\nlatter type. However, at this stage some degree of caution\nis required, as the calculations are not derived from\nexperimental spectra. Further work is therefore required\ninvolving detailed fitting to the data before a definitive\nanswer can be given. Our work, however, does indicate,\neven at this early stage, the additional information avail-\nable from direct measurements at the LIII and LII edges.\nThe energy scan of Fig. 2 gives definitive answers as to\nthe mechanism of the orbital ordering. As discussed ear-\nlier, the observed scattering could be due to direct\nGoodenough orbital ordering alone, or could be a conse-\nquence of strong cooperative Jahn-Teller distortions on\nthe Mn3\u0001 ions which causes the orbital ordering. Again,\nCastleton and Altarelli [8] produced detailed predictions\nas to the energy spectra that would be observed for each\nlimiting case, and even for a mixture of both via a scaling\nparameter, \u001e. \u001e \u0005 0 effectively turns off the lattice dis-\ntortion and simulates the effect of pure orbital ordering\nand no Jahn-Teller distortions. The predicted energy de-\npendence for \u001e \u0005 0:005 is given in Fig. 3(a). For such a\ncase, and even for the case of the Jahn-Teller distortion\nbeing relatively small (0< \u001e< 0:25), the predominant\nintensities should be contained in the higher energy fea-\ntures associated with the LII edge. For a mixture of orbital\nordering and Jahn-Teller distortions (0:25< \u001e< 0:75),\nthe intensity of the LII peaks is relatively constant\nbut there is a rapid rise in the intensity of a peak at\n\u000b642 eV just above the LIII edge. Finally, for dominant\nJahn-Teller distortions (0:75< \u001e< 1) the spectral weight\nresides in two features close to the LIII edge [see Fig. 3(b)].\nOur observations could not be clearer. Even in\nLa0:5Sr1:5MnO4, the archetypal material for orbital order-\ning in which it had been claimed that Jahn-Teller distor-\ntions might be relatively small, Fig. 2 shows that\ncooperative Jahn-Teller distortions are the dominant\nFIG. 3. Energy spectra prediction by Castleton and Altarelli\n[8] for the \u000314 ; 14 ; 0\u0004 reflection with \u001e \u0005 0:005 (no Jahn-Teller)\nand \u001e \u0005 1 (strong Jahn-Teller).\n630 640 650 660 670\nIncident Photon Energy [eV]\n8\n12\n16\nIn\nte\nns\nity\n [a\nrb.\n un\nits\n]\n0.24 0.25 0.26[110] (r.l.u)\n6\n9\n12\nIn\nte\nns\nity\nFIG. 2 (color online). Energy scan at fixed wave vector\nthrough the \u000314 ; 14 ; 0\u0004 orbital order reflection at 140 K. The\nsymbols (\u0001, \u0002, \u0003, \u0004) show the energies of the four major\nfeatures in the scan as in Ref. [8]. The inset shows a scan taken\nat E \u0005 641 eV through the orbital order reflection in the [110]\n(longitudinal) direction. By fitting the peak to a Lorentzian\nsquared line shape, the inverse correlation length [defined as\n \u00021 \u0005 2!c \", where \" is the half width at half maximum in\nreciprocal lattice units (r.l.u.) and c is the direct space lattice\nparameter] is found to be 2:6\n 10\u00023 \u0013A\u00021.\nP H Y S I C A L R E V I E W L E T T E R S week ending17 OCTOBER 2003VOLUME 91, NUMBER 16\n167205-3 167205-3\ncause of the observed orbital ordering. This is simply\nbecause of the strong intensity at the LIII edge of the\ntwo low-energy features. However, it is also apparent that\nthere is considerable intensity at the LII edge which can be\ncaused only by direct Goodenough orbital ordering. We\ntherefore conclude that there are two separate contribu-\ntions to the observed orbital ordering: direct Goodenough\norbital ordering and strong cooperative Jahn-Teller dis-\ntortions of the Mn3\u0001 ions. All previous studies have\nconsidered only a single contribution to the orbital order.\nThe temperature dependence of the orbital ordering\nbelow the phase transition was also measured. Energy\nscans at constant wave vector were also taken of the\norbital ordering peak to determine if the cause of such\norbital ordering had a temperature dependence. A graph\nof the integrated intensity of the four individual energy\nresonances comprising the orbital order peak is shown in\nFig. 4. This shows the disappearance of the orbital order-\ning peak as the sample is warmed up to and through the\norbital ordering phase transition. Figure 4 shows that the\nlower energy peaks attributed to the cooperative Jahn-\nTeller effect become even more dominant at lower tem-\nperatures. This demonstrates that the two causes of the\norbital ordering are separate, because they have a differ-\nent temperature dependence. Detailed fitting of the tem-\nperature dependence will be undertaken in a future paper,\nbut at this stage we will simply note the differing re-\nsponse to temperature of direct Goodenough orbital order\n(the features at 653 and 656 eV) and those of Jahn-Teller\ndistortions (those at 641 and 643 eV).\nIn conclusion, our results demonstrate the first use of\nsoft x-ray diffraction to probe orbital ordering. Resonant\nscattering at the L edge of manganese provides a direct\nprobe of the orbital order and provides information on the\nelectronic configuration and the underlying mechanism of\nthe orbital order. In La0:5Sr1:5MnO4, we find that the\norbital order develops at the first-order structural transi-\ntion at 240 K. Jahn-Teller distortions of the Mn3\u0001 ions\ncause considerable distortion of the MnO6 octahedra and\nthe individual Mn-O bond lengths and angles. This, si-\nmultaneously, causes cooperative displacements of the\nMn4\u0001 ions and orbital ordering on the Mn3\u0001 sublattice.\nIt is likely that the strong cooperative Jahn-Teller distor-\ntions are one of the causes of orbital ordering in all the\nmanganites. Finally, our results show that soft x-ray\nresonant diffraction will become a major technique for\nthe study of charge, spin, and orbital ordering in a wide\nrange of materials.\nWe gratefully acknowledge experimental support from\nT. A.W. Beale. We are grateful to the director of the\nSRS for access to the beam line and to EPSRC and\nCLRC for support. P. D. H. acknowledges support from\nthe University of Durham Research Foundation.\n*Present addresses: European Commission, Joint\nResearch Center, Institute for Transuranium Elements\n(ITU), Hermann von Helmholtz-Platz 1, 76344\nEggenstein-Leopoldshafen, Germany, and European\nSynchrotron Radiation Facility, Boıˆte Postal 220, F-\n38043 Grenoble Cedex, France.\nElectronic address: wilkins@esrf.fr\n†Present address: Diamond Light Source Ltd., Rutherford\nAppleton Laboratory, Chilton, Didcot, Oxon OX11 0QX,\nUK.\n[1] J. B. Goodenough, Phys. Rev. 100, 564 (1955).\n[2] Y. Murakami et al., Phys. Rev. Lett. 80, 1932 (1998).\n[3] Y. Murakami et al., Phys. Rev. Lett. 81, 582 (1998).\n[4] S. Ishihara and S. Maekawa, Phys. Rev. Lett. 80, 3799\n(1998).\n[5] I. S. Elfimov et al., Phys. Rev. Lett. 82, 4264 (1999).\n[6] M. Benfatto, Y. Joly, and C. R. Natoli, Phys. Rev. Lett. 83,\n636 (1999)\n[7] Priya Mahadevan, K. Terakura, and D. D. Sarma, Phys.\nRev. Lett. 87, 066404 (2001).\n[8] C.W. M. Castleton and M. Altarelli, Phys. Rev. B 62,\n1033 (2000).\n[9] S. B. Wilkins et al., Phys. Rev. Lett. 90, 187201 (2003).\n[10] B. J. Sternlieb et al., Phys. Rev. Lett. 76, 2169 (1996).\n[11] Y. Moritomo et al., Phys. Rev. B 51, 3297 (1995).\n[12] W. Bao et al., Solid State Commun. 98, 55 (1996).\n[13] S. Larochelle et al., Phys. Rev. Lett. 87, 095502 (2001).\n[14] F. Damay et al., J. Magn. Magn. Mater. 183, 143 (1998).\n[15] J. Rodriguez-Caravajal et al., Phys. Rev. B 57, R3189\n(1998).\n[16] P. G. Radaelli et al., Phys. Rev. Lett. 75, 4488 (1995).\n[17] M. D. Roper et al., Nucl. Instrum. Methods Phys. Res.,\nSect. A 467, 1101 (2001).\n80 120 160 200 240\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n 641 eV\n 643 eV\n 653 eV\n 656 eV\nN\nor\nm\na\nliz\ne\nd \nIn\nte\nns\nity\nTemperature [K]\nFIG. 4 (color online). Temperature dependence of the inte-\ngrated intensity (measured in the longitudinal direction) of the\n\u000314 ; 14 ; 0\u0004 superlattice reflection as a function of temperature of\nthe four features in the energy spectrum. The intensities have\nbeen normalized at 140 K.\nP H Y S I C A L R E V I E W L E T T E R S week ending17 OCTOBER 2003VOLUME 91, NUMBER 16\n167205-4 167205-4\n"}