{"doi":"10.1177\/0170840607083104","coreId":"101768","oai":"oai:epubs.surrey.ac.uk:1199","identifiers":["oai:epubs.surrey.ac.uk:1199","10.1177\/0170840607083104"],"title":"Empirical challenges in organizational aesthetics research: towards a sensual methodology","authors":["Warren, S"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1199<\/identifier><datestamp>\n      2017-10-31T14:01:00Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:6D676D74<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1199\/<\/dc:relation><dc:title>\n        Empirical challenges in organizational aesthetics research: towards a sensual methodology<\/dc:title><dc:creator>\n        Warren, S<\/dc:creator><dc:date>\n        2008<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1199\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Warren, S  (2008) Empirical challenges in organizational aesthetics research: towards a sensual methodology   Organization Studies, 19 (4).       <\/dc:identifier><dc:relation>\n        10.1177\/0170840607083104<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1199\/","10.1177\/0170840607083104"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Word count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 1 \n \n \nEmpirical challenges in organizational aesthetics research: towards a sensual methodology \n \nAbstract \nDespite growing scholarly interest in aesthetic dimensions of organizational life, there is a lack of \nliterature expressly engaging with the methodological mechanics of ‘doing aesthetics research’. \nThis article addresses that gap. It begins with an overview of the conceptual idiosyncrasies of \n‘aesthetics’ as a facet of human existence and maps out the challenges these pose for empirical \nresearch methodology. A review of methodological approaches adopted to date in empirical \nstudies of organizational aesthetics is then presented. The remainder of the article draws on the \nauthor’s experiences and suggests methods and techniques to address both conceptual and \npractical challenges encountered during the execution of an organizational aesthetics research \nproject. The article calls for a firmer focus on the aesthetic experiences of organizational members \nin addition to those of researchers and concludes with some suggestions as to the future of such \n‘sensual methodologies’ \n \nKeywords:   \nQualitative methodology; organizational aesthetics; photography; visual research;  \naesthetic field research methods  \n \n  \n \nAuthor contact details: \nDr. Samantha Warren \nSenior Lecturer in HRM \nSchool of Management \nUniversity of Surrey \nGuildford \nSurrey GU2 7XH \ns.warren@surrey.ac.uk \n \n \nBiography \nSamantha lives on the south coast of England with her husband and two sons and is a Senior \nLecturer in the School of Management at the University of Surrey where she teaches research \nmethods and organizational behaviour. Her current research interests include organizational \naesthetics, processes of material and cultural aestheticization, visual research methods and arts-\nbased management initiatives. She is an executive board member of SCOS, a member of the \neditorial collective of the journal ephemera: theory and politics in organizations and has guest edited \nspecial issues of Consumption, Markets and Culture and the Accounting, Auditing and Accountability \nJournal. \n \n \n \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 2 \n \nIntroduction \nThe sub-discipline of ‘organizational aesthetics’ urges scholars to pay attention to so-called ‘non-\nrational’ elements of organizational life in order to explore what has traditionally been hidden in \nmainstream organization and management studies. With roots in the study of organizational \nsymbolism during the 1980’s, this approach is no longer particularly new, indeed there are now \nmany excellent publications extolling the conceptual virtues of an aesthetic\/ artistic take on \nmanagement and organization and reporting on studies where the aesthetic approach has been \nfruitfully used in understanding organizational life (see, for example, Carr and Hancock 2003; \nGagliardi 1996; Guillet de Monthoux 2004; Linstead and Höpfl 2000; Ramirez 1991; Strati 1999; \nand special issues of Consumption, Markets & Culture 2002, 2006; Human Relations 2002; \nOrganization 1996).  Therefore, the purpose of this paper is not to replicate the excellent \nconceptual advances that have already been made, but to ask in a more practical vein “how do we \nactually do aesthetics research?” Whilst more scholars seem to be recognising the theoretical \nsignificance and import of an aesthetic understanding of organization, suggestions about how to \ncarry out empirical research in this regard are less forthcoming.  \n \nThese aesthetic elements of organization emanate from the ‘felt meanings’ of organizational \nmembers – the perceptions and judgements that people make about their organizational lives \nbased especially on their sensory encounters with the world around them. An employee’s \nopinions about their office decor, a managerial decision to communicate a particular corporate \nidentity in a logo and\/ or corporate livery, and the ‘feel’ of an organization’s culture are examples \nof aesthetic data that shed light on many aspects of organizational life.  Taylor and Hansen (2005) \nusefully map the terrain of this flourishing scholarly field, classifying texts according to whether \ntheir content addresses ‘instrumental’ or ‘aesthetic’ issues and whether their methods of enquiry \ncan be regarded as ‘intellectual’ or ‘artistic’. They observe that limited attention has been paid to \nthe fourth classification in this system – the exploration of aesthetic issues using artistic means – \nand suggest this area offers the richest potential for advancing aesthetic understanding in \norganization studies. This article responds, in part, to that call and I contend that such a task \nrequires organizational scholars to reflect on their research design and methodology first and \nforemost.  \n \nI hope that this article will help in the pursuit of this goal in two ways: (1) through a critical \nreview of the methods used by other writers on organizational aesthetics; and (2) by sharing my \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 3 \nown experiences of researching aesthetic issues in an organizational setting. Before I turn to these \nendeavours, I shall first lay out the idiosyncratic character of aesthetics and the outline the \nchallenges posed by this research agenda in organizations. \n \nChallenges of an aesthetic agenda in organizational research \nThe definition of aesthetics upon which this article is founded is, of course, my reading of \naesthetics that I have constructed with reference to aesthetics literature (organizational and \nphilosophical) and as a result of reflecting on my own experiences in the field. As my aim is to \naddress the methodological issues posed by aesthetics research, not to offer another philosophical \nexegesis on the origins and nature of aesthetics, the summary that follows is necessarily brief not \nleast because several excellent contributions along these lines exist already (see Gagliardi 1996; \nStrati 1999, 2000a and Welsch 1997 in particular). Aesthetics, as I conceptualise it, comprises three \ninterconnected parts. These are: \n \n1. ‘The aesthetic’ always implicates an external object or event (broadly defined) as a ‘trigger’. \nDebate has raged for centuries as to whether aesthetics are entirely subjective responses or can \nbe defined as ‘significant forms’ pertaining to particular objects (Warburton 2003). Here, \nfollowing Linstead and Höpfl (2000), I conceptualise aesthetics as an oscillation between the \ntwo – aesthetic experiences\/ judgements are subjective reactions to material things (real or \nimagined) but cannot be reduced to one or the other. \n \n2. Aesthetic experiences are universal, embodied, sensory, modes of human being-in-the-world. \nHere I am following the original meaning of Baumgarten’s doctrine of philosophical aesthetics \nto denote a kind of ‘sensible knowledge’ (Strati 1999, 2000a) that is open to all rather than \nreserved for the production, consumption and criticism of ‘high art’ (Lyas 1997). Importantly, \nthis knowledge is acquired in the first instance by the continual stream of sense impressions \nthat provide the backdrop to everyday life. Given their corporeal nature, aesthetic experiences \nare often (but not necessarily) involuntary, overwhelming and short-lived. \n \n3. However, ‘the aesthetic’ is characterised by two quite conceptually distinct elements – \nexperience and judgement – the latter being an intersubjectively constructed appraisal of the \nformer, influenced by socialization processes and ‘habitus’ (Bourdieu 1984) . As Welsch (1997) \nputs it, aesthetics has a ‘double character’.  \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 4 \nBut what do these observations on the nature of aesthetics mean for empirical research? I have \nalready noted the inextricability of aesthetic experiences\/ judgements from the objects that \nprovoke them. Together with claims to pay attention to organizational objects as “symbols and \npathways of organizational life” (Gagliardi 1990) the first challenge of research of this kind is that \nthere is a clear need for the material world to be brought within the ‘aesthetic frame of reference’.  \n \nSecondly, since aesthetics pertains to embodied, sensuous experience, effective aesthetic \ncommunication through language is difficult, largely because as Langer (1957) observes, aesthetic \nexperience cannot be broken down into the basic syntactical units which language demands. At \nbest we have to speak of our feelings metaphorically (Witkin 1974) and employ what Gagliardi \n(1996: 576) calls an “allusive, poetic language” to try and evoke a similar aesthetic (empathetic?) \nreaction in our listener, and as Strati (2000a: 13-14) tells us:    \nThe network of the sensory perceptive faculties of both organizational actors and organization scholars \nproduces knowledge that is not entirely verbal, nor entirely sayable. Other languages intervene, from visual to \ngestural, and other knowledge-creating processes, from intuitive to evocative.   \n \nHere is the second methodological challenge – how do we read (or stimulate) these alternative \nlanguages and knowledge creation processes with research participants?  \n \nRelated to the issue of ineffability outlined above, a further difficulty is the momentary nature of \nmuch aesthetic experience. Very often we are dealing with something as short as a sudden \npleasant rush of memory that ‘tingles’ through us when we hear a musical refrain or recognise a \nfamiliar smell. Thus, aesthetic experience is often fleeting, existing tantalizingly beyond our \ngrasp. Even if researchers were constantly present in organizations, they could not be with all \nparticipants all the time, so how can these transitory experiences be ‘pinned down’ for later \nevaluation? \n \nFinally, the intersubjectivity of aesthetic judgements presents a further challenge to aesthetics \nresearch, that of contextualisation. Although aesthetic encounters are subjectively experienced \nand individually embodied, the interpretation of those encounters is socially shaped. Perhaps the \naesthetic experience-judgement dyad is best thought of as an oscillation incorporating cognitive \nand intellectual capacity as well as physical sense perception – put another way, experience \ninforms judgements which, in turn, shade interpretation of further experience and so on ad \ninfinitum (Martienssen 1979). How can these socio-cultural influences on aesthetic judgements be \naccounted for when gathering aesthetic data? \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 5 \nI take these considerations forward to the rest of the article, beginning with a review of how \norganizational aesthetics researchers have dealt with their subject matter to date. I then discuss \nmy own ‘sensual methodology’ developed to engage with the above challenges and conclude the \narticle with some possibilities for the future of organizational aesthetics research. \n \nSense, aesthetics and methodology \nDespite advances being made in other social sciences, e.g.: anthropology (Pink 2005), attention to \nthe senses in organization studies is scant, although there have recently been some interesting \ndevelopments. For example, there is a growing interest in ‘the visual’, evidenced by \nStrangleman’s (2004) call to rectify the ‘blind spot’ in management research. An early example is \nDougherty and Kunda’s (1990) content analysis of photographs in the annual reports of five \nmajor corporations. Utilising images differently, Buchanan (2001) photographed the re-\nengineering of business processes in a hospital and relatedly, Cohen et al (2006) reflect on how art \nphotography can open up critique and debate about abjection in organizational life. Other \nbusiness and management disciplines also regard the visual dimension of their subject matter as \nworthy of attention, for example Preston and Young (2000) who also engage in a visual critique of \ncompany annual reports, Beattie and Jones (1992, 2000) who analyse the effect of graphs on \nstakeholders’ perceptions of firms’ financial performance, Schroeder (2002, 2003) who, among \nother things, explores the importance of banks’ architecture in transferring their services (and \nreputation) to the Internet and Ells (2001) who explored children’s brand preferences and eating \nhabits by asking them to photograph the contents of their school lunch-boxes and kitchen \ncupboards at home.  \n \nRegarding attention to the visual as occularcentric, Corbett (2003a) emphasises hearing and sound \nin organizational processes originating during the Middle Ages. This is a theme taken up by \nLinstead (2006) in his commentary on the use of musical arrangements of interview narratives \nabout working life by the UK’s BBC radio in the 1960’s. Corbett (2006) also presses for attention to \nsmell and the influence of ‘olfactory symbolism’, which is similarly emphasised by Martin (2002) \nin her study of elderly residential care homes. Likewise, Candlin’s (2003) writing on museum \ncollections calls for a greater regard for touch (or absence of it) in organizational settings, as does \nRippin (2006) who ruminates over haptic representations of organizational issues in fabric quilts. \nRelatedly, Rehn (forthcoming) questions why taste and the tongue are also conspicuous by their \nabsence from our disciplines – especially given the importance of food and drink in \norganizational ritual, celebration and everyday life. All these authors call our attention to \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 6 \nsensation as an underutilised resource for the organizational researcher, yet only cursorily reflect \non how we might enact such sensory research, leaving the reader to deduce methodological \ninsights from ‘between the lines’ on their pages. It is my intention in this article to make these \nprocesses more explicit. \n \nNotwithstanding the above, there are several studies that take empirical examples of organized \naesthetics as their focus, although by and large they do not do so from within an explicitly sensory \nframework. These studies can be divided into those that draw on what Boyle (2003) has referred \nto as ‘impressionistic’ analyses of cultural and\/ or organizational examples in the manner of a \ndetached commentator; and those that engage with organizational members to co-construct \naccounts of organizational aesthetics rather than rely solely on their own aesthetic perceptive \nfaculties (Strati 1999). Thus, I am distinguishing here between studies that privilege the \nresearcher’s voice and those that attempt to foreground the voices of organizational members. It \nis important to note at this juncture that I do not claim to be undertaking an exhaustive review of \nevery empirical study in organizational aesthetics research. Although I do hope to provide a \nreasonable reflection of the range of studies now published in the field, my purpose is to \nhighlight general methodological trends rather than to embark on a comprehensive review of the \nkind impressively undertaken by Taylor and Hansen (2005). \n \nStudies that take the ‘commentator’ approach are more prevalent than those focussing on \norganizational members’ aesthetic accounts. Jackson and Carter’s (2000) study of war graves, \nNissley et al.’s (2003) historical interrogation of company songs as aesthetic discourse and \nDougherty and Kunda’s (1990) and Cohen et al’s (2006) analyses of organizational images are \nexemplars. All observe organizational phenomena using a range of theoretical lenses to \nunderstand their operation and impact. Likewise, Larsen and Schultz (1990), Dale and Burrell \n(2003) and Kersten and Gilardi (2003) all analyse the aesthetic (and anaesthetic) effects of \ncorporate architecture in various ways, but from a similar critical distance. As Taylor and Hansen \n(2005) would put it, these authors apply their own intellectual analyses to aesthetic issues. Of \ncourse, methodological imperatives must also be at play in these studies given that all are \nempirical: they concern ‘real life’ examples of aesthetics-at-work. For instance, all of the above \nstress the importance of sensory experience in their analysis and with the exception of Nissley et \nal. (2003) expressly incorporate the material environment within their remit – two of the ‘aesthetic \nchallenges’ I identify above.  \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 7 \nStrati (1992, 1996, 1999) suggests that the researcher is key to aesthetic research because we sense \nand feel in our own experiences and are therefore able to study the aesthetics of organization. For \nexample, he proposes that a researcher might gain a 'feel' for the aesthetics of an organizational \nepisode by sensually experiencing it for themselves when carrying out fieldwork. He uses the \nterm 'imaginative participant observation' (Strati 1999: 14) to describe the way we might \nunderstand organizational aesthetics by imagining ourselves in the situations described by others \n- even though we may not even be physically present in the organizational scenario the author is \nrecounting. Thus we become valid sources of data in ourselves via our own aesthetic experiences; \nrefining our capacity to empathise with others and imagining what it might be like to be them.  \n \nWhilst the researcher is undoubtedly an important source of data in their own right – indeed \nsome would argue the only source (see for discussion Mervis and Reis-Louis 1988) – as Taylor \n(2002: 822) nonetheless advocates in the case of aesthetics, this approach may not be sufficient: \n \nBecause aesthetic experience is inherently subjective it makes sense as a next step to look at the aesthetic \nperspective of members of the organization from their own perspective. What is their aesthetic experience of \norganizational actions and organizational artefacts? This requires asking organizational members to take an \naesthetic perspective on their own organizational environment. \n \n \nSimilarly, as Rusted (2000) has firmly reminded us, the ‘commentator’ method positions the \nresearcher as ‘connoisseur’ assuming a privileged interpretative position in relation to others’ \naesthetic worlds.  Furthermore, it tends to make him\/ her appear as the only person possessing \nthe refined sensibilities to adequately investigate the aesthetic matters of the study. In other \nwords, these investigations of aesthetics in organizational life invariably invoke only the \nresearcher’s aesthetic sensibilities, rather than exploring the aesthetic responses of the people who \nwork and live within such spheres (see also Rusted 1990: 86).  \n \nIn doing this, and following Willis’s (1990) notion of “grounded aesthetics” as inseparable from \nthe cultural milieu they are generated through, Rusted urges organizational researchers to take \ntheir lead from the ethnographic methods of cultural studies and folklorists who have long \nrecognised the importance of an immersive research strategy. Indeed, there are already some \nexcellent examples of ethnographic studies of aesthetics. For example, Tyler and Taylor (1998) \nand Hancock and Tyler (2000) take a broadly ethnographic stance towards the ‘exchange of \naesthetics’ in flight attendants work and Witz et al. (2003) continue the theme of exploring the \npolitics and performance of ‘aesthetic labour’ in the hospitality sector. Letiche (2000) discusses life \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 8 \nin a dance company, Alferoff and Knights (2003) present their case study of the ‘fun and games’ \nin call-centre agents’ work, Martin (2002) recounts her evocative exploration of the management \nof aesthetics in a residential home for the elderly and Beadle and Könyöt (2006) take life in the \ncircus as their focus.   \n \nThe methodological issues here, then, seem to shift from ‘how do we (as researchers) take an \naesthetic perspective on organizational life?’ to ‘how do we evoke and represent others’ aesthetic \nperspectives on organizational life?’ All the above studies incorporate the perspectives of \norganizational members but remain strangely silent on the complexities of the methodologies \nemployed to do this – subsuming them under the banner of ‘case study’ or ‘ethnography’. \nHowever, other writers have sought to conceptualise possibilities for alternative, complementary \nresearch strategies. For instance, Linstead (2000: 88) considers the problem of ineffability and \nponders how we might achieve an “anthropological poetics” in ethnographic research and \nwriting, utilising the poetic genre:  \n“…to accept no limits to the economy of thought; to poeticize and theorize and dramatize and metaphorize as \nwe analyze; to proceed through atopy, enigma, silence and laughter…”  \n \nSimilarly, Barrett (2000: 243) notes the fleeting and processual nature of aesthetics, arguing \nresearchers need to be open to an aesthetics of unfolding – “one that allows players to quickly \nnotice and respond to unanticipated cues”. Strati (1999: 179) refers to this as attempting to grasp \nthe “sentiment-in-use”. An unusual manifestation of this process can be seen in Case and Piñeiro \n(2006) who analyse the performativity of aesthetic discourses by computer programmers’ online \ndiscussion forums. Finally, and in a more explicitly artistic vein, Taylor (2002) advocates the use \nof drawing and painting to encourage organizational members to more easily communicate their \naesthetic experiences (for an anthropological viewpoint on this, see Alfonso et al. 2004). \n \nIn sum, as Küpers (2002: 28) observes, “what competent aesthetic perception and response might \nconsist of, and whether this can meaningfully be developed, is the subject of considerable debate \nin its own right.” And as Taylor (2002) notes, this is especially so in work organizations \npredisposed towards rational, purposeful endeavour where managers and employees are little \nused to inquisitive researchers asking them to adopt an aesthetic perspective on their work, let \nalone expecting them to write poetry or paint pictures. Indeed he refers to this problem as \n‘aesthetic muteness’ in organizations and as Rippin (2006) also points out, this challenge is faced \nin the academe too – aesthetically sensitive methods (such as Linstead’s ‘anthropological poetics’ \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 9 \nor Rippin’s own work with quilts) are often regarded as self-indulgent by the mainstream \nacademic psyche, regardless of their efficacy in generating and soaking up ‘aesthetic data’. \n \nThe rest of this article draws on my own experiences of conducting aesthetic research and \ndiscusses in a more practical vein how I sought to deal with the challenges thrown up by an \naesthetic research agenda. Although I do not assert that these methods are any kind of definitive \ntoolkit for aesthetics research, I do hope that my ideas go some way towards addressing academic \nand organizational aesthetic muteness and may help others engaging in similar projects. In the \nnext section I outline the aims of my project in order to contextualise the methods I then discuss, \nproviding details of the research site and including photographs taken by the participants. \n \nTowards a sensual methodology: a case study of aestheticization at Department X,  \nThe objective of the research was to explore employees’ perspectives on a programme of \nworkplace aestheticization in the web-design department (Department X) of a global, \nmultinational IT firm (MCS) based in a rural part of the south of England. Workplace \naestheticization can be defined as a (usually) managerially instigated change process designed to \nembellish attributes of working life in order to make them more sensually appealing to \norganizational members. The rationale for this is commonly and unsurprisingly articulated in \nterms of improved ‘bottom line’ business success – in the form of reduced labour turnover and\/ \nor absenteeism, lower staff stress levels, better team spirit, motivation and morale, enhanced \ncommunication and creativity, higher productivity and so on. The premise behind this is ‘the \nhappy worker is a productive one’ – a highly problematic and poorly evidenced assumption that \nnonetheless seems to find a high degree of cultural resonance in the developed West (Bauman \n1998; Warren and Fineman 2006) \n \nActivities that might fall under this banner are varied (see Hancock 2003), but in the present case, \nthe aim of the aestheticization programme was to transform Department X into a fun, funky place \nto work. The changes took two broad forms: (1) cosmetic enhancement of the material office space \nand (2) encouragement of a culture of ‘fun and play’ during working hours. These two strands \nwere related, of course, since it was hoped that the physical changes would foster a fun \nenvironment and the fun environment would lead to further enjoyment of the office space:  for \nexample, paint and lighting effects were combined to give the appearance that the office had been \ntransformed into a ‘funky’ and ‘futuristic’ space.  The office was also newly equipped with toys, \ngames and large sculptures – the existence and use of which were intended to impart a sense of \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 10 \n‘fun’ to the workplace and their use was actively encouraged during the working day. Finally, a \nmeeting room had been incorporated and furnished along the lines of a child’s soft play room – \nwith large brightly coloured foam blocks as seating, wipe-clean vinyl floors and walls and a \nvariety of children’s toys, such as giant Lego and over-size boxing glove. The photographs left \nand below, taken by the research participants, show two of the most striking parts of the office. \nINSERT FIGURES 1 AND 2 SOMEWHERE HERE \n \nPreviously, its first floor office had been a bland and characterless corporate space with poor \nlighting and few remarkable features (the photograph to below shows a typical example of MCS \nspace INSERT FIGURE 3 ABOUT HERE). In addition, some of the members of Department X had \npreviously been located in a basement office with no natural light. Thus, the changes were quite \nsubstantial alterations to their working environment.  Importantly, these changes were effected in \nthe hope that staff and clients’ perceptions of MCS (and their resulting behaviour and attitudes \ntowards the company) would be enhanced, ultimately contributing to increased sales volume and \nrevenue. Accordingly, MCS’ managerial rationale for the programme was twofold: \n \n \n1. To create a space that would communicate the creativity of Department X’s staff to clients and \nthe public. MCS was\/ is not well known for its web-design capability and to most people’s \nminds has a reputation for ‘staid respectability’ rather than avant-garde innovation.  \n2. To provide a facilitating environment where the creativity of the staff would be enhanced. By \nencouraging a playful, fun environment it was hoped that staff would be more relaxed, \nleading to greater creativity and ultimately to more innovative web-site designs and software \n‘solutions’ as a source of increased competitive advantage. \n \nHowever, my interest in the aestheticization of Department X was not managerialist – ie, aimed at \nevaluating whether the initiative ‘worked’ in the sense that the aforementioned objectives had \nbeen met. Instead, I explored how it felt to be an employee who was ‘required’ to play at work, \nexecuting her\/ his duties in an environment where fun was explicitly encouraged (see Warren \n2005a and Fineman 2006 for a discussion of these findings). Staff working at Department X \nperformed several roles that can be loosely classified as either graphic design; software \nprogramming; project management\/ production; customer administration or technical support.  \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 11 \n31 participants formally took part in the study. The sample was drawn from each of the \ngroupings above and participants were self-selecting or invited to take part on account of their \nrole and\/ or involvement in the aestheticization programme. They were each asked to take a set \nof photographs on a digital camera that represented to them how it felt to work at Department X. \nThese images (some of which are included in this article) subsequently set the agenda for semi-\nstructured interviews between the participant and myself. In addition, over the ten weeks of the \nproject, many others were involved through an ethnographic component, engaging in casual \nconversations and allowing me to observe their daily working practices. In sum, I employed three \nmain methods to generate my data: \n1. Semi-structured biographical interviews; \n2. Respondent-led photography; and \n3. ‘Aesthetic ethnography’ \n \nIn reality, these three elements blended together during the research and consequently I will \ndiscuss them below in a more interrelated manner than the tripartite construction above suggests. \nHowever, I do not intend to discuss the generalities of interviewing as a qualitative research \nmethod here, for this is already a well-trodden path (e.g., Kvale 1996). Instead, in what follows, I \nwill focus on the characteristics of the interviews that were the most useful for generating \naesthetic data. Furthermore, given this article’s aim of discussing how we might draw out the \naesthetic experiences and judgements of research participants and not researchers, I will not deal \nwith the third element of my approach – ‘aesthetic ethnography’ – in any depth, since this \nmethod relied heavily on my own aesthetic relationship with the research site. However, my \naesthetic experiences and judgements were also useful ‘empathetic framing’ of the experiences of \nothers. Sharing my personal aesthetic reactions with the participants enabled us to discuss why \nwe felt similarly or differently about certain features of Department X’s office space. This process \ngenerated some fascinating data, not least because the participants’ judgements were often very \ndifferent to mine. For them, the office was more than an aesthetic object – it was inscribed with \nthe everyday practicalities, joys and frustrations of workaday life and symbolised in several cases \nrecent political goings-on and departmental conflicts between management and staff. Thus, their \naesthetic judgements of the space were inextricability caught up with the political economy of the \ndepartment and the wider organization. Their aesthetics were “grounded” in a different way to \nmine – as Willis (1990) would put it – because I was able to appreciate the office space as a \npolitically neutral ‘thing-in-itself’ – or even more favourably since I was grateful for being granted \naccess to carry out my research.  \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 12 \n \nInter-views: words and pictures in aesthetics research \nGiven that I have argued for the ineffability of aesthetic experience it may seem strange to be \nadvocating the use of interviews in this context. If aesthetic experience is not reducible to \nlanguage then surely it makes little sense to expect people to be able to verbalise their feelings? \nHowever, as also noted earlier, we nonetheless do try to communicate aesthetic experience in \nwords, utilising metaphor and attempting to evoke a similar aesthetic (empathetic?) reaction in \nour listener by employing “allusive, poetic language” (Gagliardi 1996: 576; Witkin 1974). Thus, it \nwas this more ‘emotionally infused’ facet of the interviews I particularly wished to encourage and \ndid so by asking interviewees to tell me stories about their experiences.  As Gabriel (1999) \nrecognises, stories are rich tapestries of facts, embellishments and folklore that allow emotional \nundercurrents to bubble up to the surface – and so were ideal for my purposes.  \n \nThe first story I asked interviewees to recount was their own biographical or ‘life-history’ \nnarrative (Musson 2004). Beginning the process with a familiar topic was intended partly as a \nrapport-building exercise, but also as a way of getting interviewees used to the story-telling \nmode. As well as enabling the allusive language outlined above, these stories sparked fascinating \ndialogue on how the interviewees’ ‘habitus’ (Bourdieu 1984) influenced their perception of \nworking life. In concentrating on this ‘enabling context’ I was able to ask the respondent to reflect \non possible linkages between, for example, childhood past-times and adult aesthetic preferences \nwhich further enriched the data by effectively bringing the past into the equation and helping to \nsocially contextualise their aesthetic judgements. For example, when questioned why she found \nworking in a countryside location so appealing, one interviewee  recounted that happy memories \nof a rural childhood were undoubtedly a factor in her assessment of a ‘nice place to work’. \nConversely, another participant who had enjoyed playing with Lego blocks as a child shunned \ntheir appearance in her workplace as an adult, as she explains here: \n \n“We don't use Lego, I think that's a nonsense – its what I played with when I was a kid! We might muck \nabout with it every now and again but that has nothing to do with work.” \n (Deb, Designer) \n   \nThe rest of the interviews continued to generate rich narrative data. The social dimension of \naesthetic judgements was once again recognisable in the ways these stories fitted together or \ndiverged from one another and in several cases this helped me to gain some sense of the context \nin which aesthetic judgements were being made; ie: the everyday political nature of the \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 13 \nDepartment. A particularly striking example of this was a story about an incident where some of \nthe staff of Department X had become so incensed by the presence of what they considered to be \nugly, kitsch sculptures (shaped like giant ‘Russian Dolls’, see left INSERT FIGURE 4 \nSOMEWHERE NEAR HERE) that they physically ‘attacked’ them by punching one of the Dolls in \nthe face. These Dolls had been imposed by management and at great expense (so it was \nrumoured). This story was told to me in many variants – sometimes with humour, other times \nwith embarrassment and even anger, but importantly all opened up a space to understand why \nthese objects were so aesthetically despised through their colourful retellings. As Coffey (1999) \nnotes, the emotional elements to fieldwork are often overlooked or downplayed (see also \nKleinmann and Copp 1993), however in this research it was exactly those dimensions that added \nto the aesthetic richness of the data, by encouraging participants, among other things, to tell \nstories, laugh, joke, be angry and describe their experiences and feelings in ‘flowery’ allusive \nlanguage – and so counter the difficulties of linguistically conveying aesthetic feeling.  \n \nThe image reproduced above was taken by one of the participants in the study and it is to the \nimportant role of photography in the interview process that I now turn. To reiterate, in advance of \nthe interviews, I issued a digital camera to participants with the instruction that they should take \nphotographs that simply ‘showed me how it felt to work at Department X’. These images were \nthen jointly viewed and discussed. This technique is known by various names depending on the \ndiscipline concerned, but usually comes under the label of ‘photo-elicitation’ (Collier and Collier \n1986); ‘auto-driving’ (Heisley and Levy cited in Hurworth 2003); a model of visual ‘collaboration’ \n(Harper 1998); ‘photo-interviewing’ (Schwartz 1994) or ‘photo-novella’ (Wang & Burris 1994, \n1997). All variants differ slightly – see Hurworth 2003 for a concise overview and Parker 2006 for \na fuller one. However, the main premise that unites them is that a respondent and researcher \ndiscuss an image or photograph in some way to generate data.  \n \nWith particular regard to aesthetics, the photographs generated appropriate data in a number of \nways: (1) by acting as a window on participants’ aesthetic worlds; (2) by evoking and ‘recreating’ \naesthetic experiences during the interviews; and (3) operating as sites through which to explore \nthe socially constructed nature of the participants’ aesthetic judgements. \n \nThe first benefit, as alluded to above, was that participants were free to photograph whatever \nthey chose – immediately highlighting what was aesthetically important for them in their \nworking environment. Consciously or not, the visual culture of the photographer conditions what \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 14 \nis included in (or left outside) the photograph’s frame, the choice of subject, its position in the \noverall composition, the angle and orientation of the camera, and so on. Thus, a photograph \nprobably tells us more about the culture of the photographer than the culture of what is \nphotographed (see for example, Scott 1999 and Pink 2001). When I first arrived, I had begun to \nphotograph the office myself, but became increasingly aware that these images portrayed my \naesthetic preferences – not those of my participants – so I decided to ask them to take the pictures. \nSince it was the aesthetic experiences and judgements of the participants that I was particularly \ninterested in, this trait of photography was extremely useful. \n \nHowever, at this point it became clear that my ‘purely’ inductive stance was going to prove \nproblematic. In a case of Taylor’s (2002) ‘aesthetic muteness’, the participants wanted me to tell \nthem what they should take pictures of! Treading a fine line between leading them to particular \nobjects and helping them interpret the research brief, I directed them to photograph things they \nliked, disliked, had particular meaning for them, or even that they considered bland, boring or \nmeaningless – hoping to generate aesthetic data by asking people to make judgements of taste \nabout elements of their work environment. Strati (1999: 140) describes a similar strategy when he \nrecounts asking research participants whether they considered their work to be ‘beautiful’.  \nThe second notable characteristic of photography for aesthetics research was that during the \ninterviews, we talked about the places, objects and people in the images as if they were actually \nthere with us. The iconographic nature of photography means that we act as if we are relating to \nthe thing depicted itself when we view the photograph ourselves and show it to others – no \nmatter how posed, partial, or otherwise constructed we might also know the image to be (Harper \n1998). Thus the photographs almost literally brought the material environment ‘into’ the \ninterview room and given my earlier argument that aesthetic experiences necessarily implicate an \nobject, this is a helpful facet of the approach. \n \nIn addition to serving as points of reference for verbal descriptions (talking about the content of \nthe image) photographs also arouse aesthetic experiences in their own right. Indeed, the power of \nphotography as an art genre is testament to this fact (Strati 2000b). Although these photographs \nwere visible depictions of objects from Department X and indeed, outside the office, what they \n‘conjured up’ in the interviews was a much more sensory experience. Pink (2001) notes this as the \ndifference between what is visible and what is visualised – the latter being intrinsically bound up \nwith richly infused remembrances and memories of ‘being there’ and apprehending the artefact \nin the photograph. This also has the advantage of virtually ‘recreating’ aesthetic experiences in \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 15 \nthe interview setting, – much as one gets ‘transported back’ while looking at one’s own happy \nholiday snapshots – and this goes at least some way towards addressing the issue of the \ntransience of aesthetic experience I noted above. To give an example from my study, one \nparticipant photographed the branches of a tree (INSERT FIGURE 5 ABOUT HERE) to explain to \nme how, in summer, she valued being able to lie on the grass outside the office, looking up at the \ntrees and sky, ‘smelling the air’ and feeling the grass on her skin. In this example what seemed of \nmost import was not what was actually visible but what the image allowed its photographer to \nvisualise which included recollections of sensory experiences other than sight.  \n \nWhat the photograph engenders beyond itself is significant in another way too on account of the \nfact that discussing photographs is a social act. This is beneficial to aesthetics research as it allows \nthe socially constructed nature of aesthetic judgements to be explored. As I noted at the beginning \nof this section, my ‘aesthetic ethnographic’ observations were useful in empathising with and \nreflecting on differences between mine and others’ interpretations and this led to interesting \nconversational detours. Furthermore, the way the photographs were interpreted during the \ninterviews was different from the photographer’s original motivation for taking them and the \nviewer’s subsequent solo understanding of them. Belova (2006: 47) refers to this as the ‘event of \nseeing’ where “…meaning is created in movement and dialogue between image, author, viewer and \ncircumstance of perception and\/ or discourse”: instigating a ‘can opener effect’ whereby the \nconversations that are triggered by the image lead to all sorts of interesting and often unexpected \ndata (Walker and Weidel 1985). The photograph and excerpt from its accompanying interview \ntranscript below illustrate this process.  \n \n INSERT FIGURE 6 BESIDE QUOTE  \n \nMe: What’s this a picture of?!  \nSimon: It’s a plasma screen image that I just liked [artwork displayed on a large computer screen in the office \nfoyer] – it’s actually done by the technical continuity director – one of my management level buddies and he \nreally enjoys taking photographs and whether or not you think he’s got that talent … he enjoys doing it and \nthat’s his free space for him to air –and I think its just as important to realise that we are all creative.  \n \nMe: Is everyone able to put stuff on the screens?  \n \nSimon: They are. Now that there’s a lot of interest and there’s a lot of people doing it, it’ll be vetted to a degree \n– against criteria, sensitivities etc um, but yeah they’re free to… \n \n \n Me: Even support staff [clerical administrators]? \n \nSimon: Yeah – I guess the push [to display artwork] has been for the… creative people – all the do-ers on the \nprojects – the designers, the developers and the producers I don’t think any of the infrastructure staff [have]… \nPerhaps they need to be told that a bit more clearer, but yeah – it’s very much a free space. \n \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 16 \n \nDuring questioning, Simon reveals that he took the photograph because he believes creativity is \nuniversal – something which is certainly impossible to guess from looking at the image alone. \nHowever, my further probe as to whether everyone is free to display artwork on these publicly \nvisible screens reveals that it is not such a ‘free’ space as Simon claims since the images are \n‘vetted’ for appropriateness. When I ask if this ‘freedom’ extends to all the staff, we sense that \nSimon actually considers the ‘do-ers’ on the projects to be the only ones who should be labelled \n‘creative’ and he tells us that they have been ‘pushed’ to contribute – contradicting his final claim \nthat the screens represent a ‘free space’ and earlier rationale for taking the photograph as \nrepresenting the universal nature of creativity. Importantly for my purposes here, that rationale \nwas first and foremost an aesthetic one: Simon took the photograph because he liked the image. \n \nThe above notwithstanding, what remains unequivocal from these data and the preceding \ndiscussion is the importance of language – more precisely, discussion during the interviews – in \ncontextualising the photographs and generating data through them. The relationship between \nlanguage and image is a long-standing and complex debate beyond the scope of this particular \narticle (see Mitchell 1994; Scott 1999; Warren 2002, 2005b), but it is important to stress that the \nefficacy of these ‘photo-interviews’ in aesthetics research springs from the combination of the \nphotograph and  discussion, and not from either one or the other.  \n \nTo sum up this section, my sensual methodology attempted to draw the aesthetic experiences of \nmy research participants to the fore in a number of ways. Framed by my own aesthetic \nrelationship with Department X, I developed qualitative interviews into aesthetically attuned \narenas; encouraging the telling of stories about participants’ ‘aesthetic biographies’ and the \nobjects, places and people that they deemed significant enough to photograph in their working \nenvironment. These photographs added a ‘virtual’ tangible material dimension to the discussions \nabout them, and evoked sensory recollections that extended beyond what they visibly \nrepresented, allowing a kind of ‘re-feeling’ that helped to capture some sense of what it might \nhave felt like to be physically apprehending the scene within its frame. Finally, viewing the \nphotographs collaboratively, facilitated reflection on the socially constructed nature of aesthetic \njudgements through conversations about differences in our aesthetic interpretations. \n \nConclusion \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 17 \nMy aim in this article has been to explicitly draw methodological issues to the forefront of \ndiscussions of organizational aesthetics and I hope to have done this in three ways.  \n(1) I began by bringing together and restating conceptual literature that reminds us what makes \naesthetic research especially problematic. This was expressed as a series of challenges for \norganizational researchers, carried forward throughout the article as various methodological \npositions were discussed.  \n(2) I then conducted a review of methodological approaches taken in a range of empirical studies \nof aesthetics in organizational settings, noting that studies taking a researcher-as-\ncommentator or ‘connoisseur’ perspective (Rusted 2000) were more prevalent than those \naddressing the experiences of organizational members themselves. Those that do take such a \nfocus tend to rely heavily on ‘traditional’ ethnographic strategies – with alternative \npossibilities (such as haptic representation (Rippin 2006), olfactory symbolism (Corbett 2006) \nand anthropological poetics (Linstead 2000) seeming still to be at a highly speculative and \nexperimental stage. \n(3) Finally, I put forward reflections on my own experiences of carrying out a case study in an \naestheticized organizational environment in the spirit of advancing these ‘sensory \npossibilities’ in organization studies in order to assist others wanting to overcome ‘aesthetic \nmuteness’ among organizational members and in the scholarly community. Whilst I would \nnot go so far as to claim that the approach detailed above surmounts the challenges of an \naesthetic research agenda, I would suggest that it does embrace these difficulties. \n \nOf course, this brings with it a whole host of related problems regarding the dissemination of \naesthetic research accounts – matters I do not have space to deal with here (see Warren 2002, \nGagliardi 1996) but which others are making advances in. Pink’s (2001, 2006) work with \nmultimedia presentations opens up new possibilities for expressing organizational life in a non-\nlinear fashion, blending image, sound and narrative in a way that resembles Strati’s (2005) \nconceptualisation of organization as ‘aesth-hypertext’. Although multimedia and the Internet are \nstill two dimensional, they can bring together sight, sound and 3-D modelling to bring research \naccounts alive in new and exciting ways. If we also consider the almost synaesthesic properties of \npowerful, high resolution digitised images, we can almost imagine smell and touch to be \ncommunicable using these media. In a lecture on visual research methods, I display a large, full \ncolour photograph of a rotting fish and watch as students physically recoil from the projector \nscreen in disgust at the smell they can almost sense in their imaginations. Aesthetics, through \ndigital media and Internet technologies, are thus potentially more accessible to our scholarly \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 18 \ncommunities and students than the print-based outlets we so dearly cling to. Indeed, some online \njournals are now beginning to realise these possibilities – although not explicitly related to \naesthetics, see for example, the recent issue 5(X) of the online journal ephemera: theory and politics in \norganizations that combined image, text, movie and sound to convey the proceedings of an \nacademic conference held on the Trans-Siberian express train in 2005. \n \nTo conclude this article then, I support Taylor and Hansen’s (2005) call for more research that \nemploys artistic\/ aesthetic methods to explore aesthetic issues in organizational life. Thus I hope \nthis conclusion may in actuality be only the beginning of a rich and sensual branch of aesthetics \nresearch. Gagliardi (1990: 31) sums this up with characteristic linguistic flair: \n \n“…what we have ‘felt’ that the natives ‘feel’ can only be given in a way that enables our audience to ‘feel’ and \nit demands that we use our creative imaginations. The aesthetic experience should be transmitted in ways \nconsonant with its nature” \n \n \nReferences \n \nAlferoff, Catrina and David Knights (2003) ‘We’re all partying here: targets and games, or targets \nas games in call centre management’,  in A. Carr & P. Hancock (eds.) Art and aesthetics at work, \nLondon: Palgrave Macmillan, 70 – 92 \nAlfonso, Ana-Isobel, Laslo Kurti and Sarah Pink (2004) Working images: visual research and \nrepresentation in ethnography, London: Routledge \nWarren, Samantha (2002) ‘Show me how it feels to work here: The role of photography in \nresearching organizational aesthetics’ ephemera: theory and politics in organization, 2\/ 3: 224 – 245  \navailable at www.ephemeraweb.org \nWarren, Samantha (2005a) Consuming work? An exploration of organizational aestheticization \nUnpublished PhD thesis, University of Portsmouth, UK \nWarren, Samantha (2005b) ‘Photography and voice in critical, qualitative, management research’ \nAccounting, Auditing and Accountability Journal, 18\/ 6:  861 – 882  \nWarren, Samantha and Stephen Fineman (2006) ‘’Don’t get me wrong, it’s fun here but…’: \nambivalence and paradox in a ‘fun’ work environment’ in Carl Rhodes and Bob Westwood (eds.) \nHumour and organization, London: Routledge, forthcoming \nBarrett, Frank (2000) ‘Cultivating an aesthetic of unfolding: Jazz improvisation as a self-\norganizing system’ in Stephen Linstead and Heather Höpfl (editors) The aesthetics of organizing,  \nLondon: Sage, 228 – 245  \nBauman, Zygmunt (1998) Work, consumerism and the new poor, London: Sage \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 19 \nBeadle, Ron and David Könyöt (2006) ‘The man in the red coat – management in the circus’ \nCulture and Organization, 12\/2: 127 – 138  \nBeattie, Vivian and Michael Jones (1992) ‘The use and abuse of graphs in annual reports: \ntheoretical framework and empirical study’, Accounting and Business Research, 22\/ 88: 291 – 303 \nBeattie, Vivian and Michael Jones (2000) ‘Impression management: the case of inter-country \nfinancial graphs’  Journal of International Accounting, Auditing and Taxation  9\/ 2:  159 – 183   \nBelova, Olga (2006) ‘The event of seeing: A phenomenological perspective on visual sense-\nmaking’ Culture and Organization, 12\/2: 93 – 107  \nBourdieu, Pierre (1984) Distinction: a social critique of the judgement of taste , London: Routledge \nBoyle, Mary-Ellen (2003) ‘Reconciling aesthetics and justice in organization studies’ in A. Carr \nand P. Hancock, Art and aesthetics at work,  London: Palgrave Macmillan, 51 – 64  \nBuchanan, David (2001) ‘The role of photography in organization research: a reengineering case \nillustration’ Journal of Management Inquiry, 10\/2: 151 – 164  \nCandlin, Fiona (2003) ‘Can matter think? Touch and knowing in museum collections’ Paper \npresented to the 22nd meeting of the Standing Conference on Organizational Symbolism, Halifax, \nCanada, July 2003 \nCarr, Philip and Adrian Hancock (2003) Art and aesthetics at work, London: Palgrave \nCase, Peter and Erik Piñeiro (2006) ‘Aesthetics, performativity and resistance in the narratives of a \ncomputer programming community’ Human Relations, 59\/6: 753 – 782  \nCoffey, Amanda (1999) The ethnographic self, London: Sage \nCohen, Laurie & Melissa Tyler (2004) ‘The office (27 November 2003 - 18 January 2004), The \nphotographers' gallery, London: a review' Work, Employment and Society  18\/ 3:  621 – 629   \nCollier, John & Margaret Collier (1986) Visual anthropology: photography as a research method, \nAlbuquerque: University of New Mexico Press \nConsumption, Markets and Culture (2002) Special issue, ‘Building bridges to art’, 5\/ 1 \nConsumption, Markets and Culture (2006) Special issue, ‘The art of oppression’, 9\/ 2 \nCorbett, Martin (2003a) ‘Sound organization: A brief history of psychosonic management’ \nEphemera: Theory & Politics in Organization, 3\/ 4: 265 – 276 available at www.ephemeraweb.org \nCorbett, Martin (2006) ‘Scents of identity: organization studies and the cultural conundrum of the \nnose’ Culture and Organization. 12\/3: 221 – 232  \nDale, Karen and Gibson Burrell (2003) ‘An-aesthetics and architecture’ in A. Carr & P. Hancock \n(eds.) Art and aesthetics at work, London: Palgrave, 155 – 173  \nDougherty, Deborah and Gideon Kunda (1990) ‘Photograph analysis: a method to capture \norganizational belief systems’ in Pasquale Gagliardi (ed.) Symbols and Artefacts: Views of the \ncorporate landscape, Berlin: Walter de Gruyter, 185 – 206  \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 20 \nElls, Harvey (2001) ‘Talking pictures in working school lunches: investigating food choice with \nchildren and adolescents.’ British Food Journal, 103\/6:  374 – 382  \nGabriel, Yiannis (2000) Storytelling in organizations: facts, fictions and fantasies, Oxford:  Oxford \nUniversity Press \nGagliardi, Pasquale (1990) Symbols and artifacts: views of the corporate landscape Berlin, New York: \nde Gruyter \nGagliardi, Pasquale (1996) ‘Exploring the aesthetic side of organizational life’ in Stuart Clegg, \nCynthia Hardy and Walter Nord, eds. Handbook of organizational studies, Sage: London, 565 - 580 \nGuillet de Monthoux, Pierre (2004) The art firm: aesthetic management and metaphysical marketing, \nCalifornia: Stanford University Press \nHancock, Philip and Melissa Tyler (2000) ‘The look of love: gender and the organization of \naesthetics’ in J. Hassard, R. Holliday & H. Willmott (eds.) Body and Organization, London: Sage, \n108 – 129  \nHarper, Douglas (1998) ‘An argument for visual sociology’ in Jon Prosser (ed.) Image-based \nresearch: a sourcebook for qualitative researchers, London: Falmer Press 24 – 41 \nHuman Relations (2002) Special issue ‘Organizing aesthetics’ 55\/ 7 \nHurworth, Rosalind (2003) ‘Photo-interviewing for research’ Social Research Update, 40 \nJackson, Norman & Pippa Carter (2000) ‘An-aesthetics’ in Stephen Linstead and Heather Höpfl \n(eds.) The aesthetics of organization, London: Sage, 180 – 196  \nKersten, Astrid and Ronald Gilardi (2003) ‘The barren landscape: reading US corporate \narchitecture’ in in A. Carr & P. Hancock (eds.) Art and aesthetics at work, London: Palgrave \nMacmillan, 70 – 92 \nKleinman, Sheryl & Martha Copp (1993) Emotions and fieldwork, Qualitative Methods Series 28, \nSage University Papers, London: Sage, 138 – 154  \nKüpers, Wendelin (2002) ‘Phenomenology of aesthetic organizing – ways towards aesthetically \nresponsive organizations’ Consumption, Markets and Culture, 5\/1: 21 – 46  \nKvale, Steinar (1996) InterViews  London: Sage \nLanger, Suzanne (1957) Philosophy in a new key,  Milton Keynes: Open University Press \nLarsen, Janne and Majken Schultz (1990) ‘Artifacts in a bureaucratic monastery’ in P. Gagliardi \n(ed.) Symbols and artefacts: views of the corporate landscape, Berlin: Walter de Gruyter, 281 – 302  \nLetiche, Hugo (2000) ‘Observer versus audience’ in S. Linstead and H. Höpfl (eds.) The aesthetics of \norganizing, London: Sage, 154 – 179  \nLinstead, Stephen (2000) ‘Ashes and madness: The play of negativity and the poetics of \norganization’ in S. Linstead and H. Höpfl (eds.) The aesthetics of organizing, London: Sage, 61 – 92  \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 21 \nLinstead, Stephen (2006) ‘Exploring culture with the Radio Ballads: using aesthetics to facilitate \nchange’ Management Decision, 44\/4: 474 – 485  \nLinstead, Stephen and Heather Höpfl (2000) The aesthetics of organizing, London: Sage \nLyas, Colin (1997) Aesthetics, London: UCL Press \nMartin, Patricia (2002) ‘Sensation, bodies, and the ‘spirit of the place’: aesthetics in residential \norganizations for the elderly’ Human Relations, 55\/ 7: 861 – 885 \nMartienssen, Heather (1979) ‘A note on formalism’ British Journal of Aesthetics, 19\/ 1: 144 – 146  \nMervis, P. and Meryl Reis-Louis (1988) `Self-full research: working through the self as instrument \nin organizational research’, in D. Berg and K. Smith (editors), The self in social inquiry: researching \nmethods, London: Sage, 229 – 246  \nMusson, Gill (2004) ‘Life histories’ in Catherine Cassell & Gillian Symon (editors) Essential guide to \nqualitative methods in organizational research  London: Sage, 34 – 44  \nNissley, Nick, Steve Taylor, and Orville Butler (2003) ‘The power of organizational song: an \norganizational discourse and aesthetic expression of organizational culture’ in A. Carr and P. \nHancock (editors) Art and aesthetics at work,  London: Palgrave Macmillan, 93 – 114  \nOrganization (1996) Special issue on ‘Essays on aesthetics and organization’,  3\/ 2 \nParker, Lee (2006) ‘Photo-elicitation: an ethno-historical accounting and management research \nprospect’ paper presented to the Interdisciplinary Perspectives on Accounting conference, Cardiff, \nWales, July. \nPink, Sarah (2001) Doing visual ethnography, London: Sage \nPink, Sarah (2005) The future of visual anthropology: engaging the senses, London: Routledge \nPink, Sarah (2006) personal webpage at \nhttp:\/\/www.lboro.ac.uk\/departments\/ss\/depstaff\/staff\/bio\/pink.htm last accessed 25\/10\/06 \nPreston, Alistair & Joni Young (2000) ‘Constructing the global corporation and corporate \nconstructions of the global: a picture essay’ Accounting, Organizations and Society 25: 427 – 449 \nRamirez, Rafael (1991) The beauty of social organization, Munich: Accedo \nRehn, Alf (forthcoming) ‘The tongue in economy’ Spices, the value of taste and the tongue in economy, \nAbo: Dvalin Books \nRippin, Ann (2006) ‘Refusing the therapeutic: Marion Milner and me’ Culture and Organization, \n12\/1: 25 – 36  \nRusted, Brian (1990) ‘Housing modifications as organizational communication’ in Pasquale \nGagliardi (ed.) Symbols and artefacts: views of the corporate landscape, Berlin: Walter de Gruyter, 85 – \n106  \nRusted, Brian (2000) ‘Cutting a show: grounded aesthetics and entertainment’ in in S. Linstead \nand H. Höpfl (eds.) The aesthetics of organizing, London: Sage, 111 – 129  \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 22 \nSchroeder, Jonathan (2002) Visual consumption, London: Routledge \nSchroeder, Jonathan (2003) ‘Building brands: architectural expression in the electronic age’ in L. \nScott & R. Batra (editors) Persuasive imagery: a consumer response perspective: New Jersey: Lawrence \nErlbaum, 349 – 382  \nSchwartz, Dona (1994), “Visual ethnography: using photographs in qualitative research” \nQualitative Sociology, 12\/ 2: 119-154 \nScott, Clive. (1999) The spoken image: photography & language,  London: Reaktion Books \nStrati, Antonio (1992) ‘Aesthetic understanding of organizational life’ Academy of Management \nReview, 17\/ 3:  568 – 581  \nStrati, Antonio (1996) ‘Organizations viewed through the lens of aesthetics’ Organization  3\/ 2: 209 \n– 218  \nStrati, Antonio (1999) Organization and aesthetics, London: Sage \nStrati, Antonio (2000a) ‘The aesthetic approach in organization studies’ in Stephen Linstead and \nHeather Höpfl (editors) The aesthetics of organizing,  London: Sage \nStrati, Antonio (2000b) “Putting people in the picture: art and aesthetics in understanding \norganizational life”, Organization Studies, 21\/ 0: 53 – 69  \nStrati, Antonio (2005) ‘Designing organizational life as ‘aesth-hypertext’: insights into business \npractice’ Organization, 12\/6: 919 – 923  \nStrangleman, Tim (2004) ‘Ways of (not) seeing: the visual as a blind spot in WES?’ Theory, Culture \nand Society, 18\/ 1: 179 – 192  \nTaylor, Steve (2002) ‘Overcoming aesthetic muteness: researching organizational members \naesthetic experience’ Human Relations, 55\/ 7:  821 – 840  \nTaylor, Steve and Hans Hansen (2005) ‘Finding form: looking at the field of organizational \naesthetics’ Journal of Management Studies, 42\/6: 1211 – 1230   \nTyler, Melissa and Steve Taylor (1998) ‘The exchange of aesthetics: women’s work and ‘the  gift’’ \nGender, Work and Organization, 5\/3: 165 – 171 \nWalker, Rob & Janine Weidel (1985) ‘Using photographs in a discipline of words’ in Robert \nBurgess (ed.) Field methods in the study of education,  London:  Falmer Press, 191 – 216  \nWang, Caroline & Mary-Ann Burris (1994) ‘Empowerment through photo novella: portraits of \nparticipation’ Health Education Quarterly, 21\/ 2: 171 – 186 \nWang, Caroline & Mary-Ann Burris (1997) ‘Photovoice; concept, methodology and use for \nparticipatory needs assessment’ Health and Behaviour, 24\/ 3: 369 – 387 \nWarburton, Nigel (2003) The art question, London: Routledge \nWelsch, Wolfgang (1997) Undoing aesthetics, London: Sage \nWord count 8,862     To appear in Organization Studies \nAuthor’s pre-publication proof   (DOI no: 10.1177\/0170840607083104) \n 23 \nWillis, Paul (1990) Common culture, CO: Westview Press \nWillis, Paul (2000) The ethnographic imagination, London: Polity Press \nWitkin, Robert (1974) The intelligence of feeling , London: Heinemann \nWitz, Anne, Chris Warhurst and Dennis Nickson (2003) ‘The labour of aesthetics and the \naesthetics of organization’ Organization, 10\/1: 33 – 54  \n \n \n"}