{"doi":"10.1007\/978-0-387-87503-3","coreId":"81178","oai":"oai:usir.salford.ac.uk:2261","identifiers":["oai:usir.salford.ac.uk:2261","10.1007\/978-0-387-87503-3"],"title":"Technological frame incongruence, diffusion and noncompliance","authors":["Sobreperez, P"],"enrichments":{"references":[{"id":730362,"title":"A failed panopticon: surveillance of nursing practive via new technology.&quot;","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":729104,"title":"A participative approach to planning and designing computer systemsand procedures to assist this.&quot;","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":724786,"title":"A Technological Frames Perspective on Information Technology and Organisational Change.&quot;","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":728724,"title":"An Attributional Explanation of Individual Resistance to the Introduction of Information Technologies in the Workplace.&quot;","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":727781,"title":"An ecology of resistance. Facilitating Technology Transfer through Partnership: Learning from practice and research.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":726247,"title":"An investigation of User-Led Systems design: Rational and Political perspectives.&quot;","authors":[],"date":"1984","doi":"10.1145\/2135.2138","raw":null,"cites":null},{"id":727375,"title":"Call Centre Employees' Responses to Electronic Monitoring: Some Research Findings.&quot;","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":727204,"title":"Community Design of DLESE's Collections Review Policy: A Technolgoical frames Analysis.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":729897,"title":"Competitive Groups as cognitive communities:The case of Scottish Knitwear manufacturers.&quot;","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":725352,"title":"Computerisation and controversy: value conflicts and social choices.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":729598,"title":"Costs and Benefits of the Workaround: Inventive Solution or Costly alternative.&quot;","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":730072,"title":"Diffusion of Innovation.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":724252,"title":"Edwards Revisited: Technical Control and Call Centres.&quot;","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":723389,"title":"Entrapped by the 'electronic panopticon'? Worker resistance in the call centre.&quot;","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":726633,"title":"Four Paradigms of Information Systems Development.&quot;","authors":[],"date":"1989","doi":"10.1145\/67933.67937","raw":null,"cites":null},{"id":727836,"title":"Framing Implementation Management.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":728895,"title":"How political proceses shaped the IT adoption by a small make to order company: A Case study in the insulated wire and cable industry.&quot;","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":727570,"title":"Incongruence, Diffusion and non-compliance","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":726783,"title":"Information Systems and User Resistance: Theory and Practice.&quot;","authors":[],"date":"1988","doi":"10.1093\/comjnl\/31.5.398","raw":null,"cites":null},{"id":728133,"title":"Information systems failures:a survey and classification of the empirical literature.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":726006,"title":"Innofusion or diffusation? The nature of technologival development in robotics.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":723599,"title":"IT Diffusion and innovation models: the conceptual domains. Facilitating Technology Transfer through Partnership: Learning from practice and research.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":725031,"title":"Making sense of Technology Frames: Promise, progress and potential. Relevant Theory and Informed Practice: Looking Forward from a 20 year perspective on","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":730655,"title":"Managerial and Organizational Cognition: Notes from a Trip Down Memory Lane.&quot;","authors":[],"date":"1995","doi":"10.1287\/orsc.6.3.280","raw":null,"cites":null},{"id":723826,"title":"Of Bicycles, Bakelites, and Bulbs: Toward a Theory of Sociotechnical Change.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":728322,"title":"Passive Resistance Misuse: Overt Support and Covert Recalcitrance in IS Implementation.&quot;","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":728536,"title":"Power, Politics, and MIS Implementation.&quot;","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":725558,"title":"Resist, Comply or Workaround: An examination of different facets of user engagement with information systems.&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000629","raw":null,"cites":null},{"id":730280,"title":"Someone to watch over me': Surveillance, Discipline and the Justin-time labour process.&quot;","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":726484,"title":"Symbols, Scripts and Sensemaking: Creating Meaning in the Organisational Experience. The Thinking Organisation.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":724513,"title":"Taking industry seriously in IS Research.&quot;","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":729300,"title":"Technological Frames:Making Sense of Information Technology in Organizations.&quot;","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":726979,"title":"The interaction between organisational subcultures and usercentred design - a case study of an implementation effort.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":728003,"title":"The Social and Political construction of technological frames.&quot;","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":725113,"title":"Through the Eyes of Experts: A Socio-cognitive Perspective on the Automation of Fingerprint work.&quot;","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":730567,"title":"Towards a theory of Organisational Socialisation.&quot;","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":725787,"title":"Tricks or Trompe L'Oeil? An Examination of Workplace Resistance in an Information Rich Managerial Environment.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":727278,"title":"Work Co-ordination, Workflow and workarounds in a Medical Context.&quot; CHI:","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":724018,"title":"Workflow from within and without:","authors":[],"date":"1995","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":null,"abstract":"The Technological Frames of Reference strand of Social Shaping of Technology theory is used to overlay the issues arising from a case study looking at non-compliance with information systems. A recent review of the theory suggests that the process of framing is not always addressed and could be more useful in revealing the differing attitudes and views of the relevant social groups. This paper attempts to address this shortfall by applying the antecedents identified by previous published research on the case study and highlighting their usefulness and value. In this way, the author suggests that issues surrounding non-compliance should not be dismissed as resistance but instead should be addressed and dealt with by managers and developers. The author proposes that the antecedent conditions underpinning different categories of non-compliance can be utilized as a skeleton or framework for understanding the situations in which non-compliance arises. Further examination of the antecedent conditions reveals dependence on inefficient or ineffective organizational situations and issues and thus the framework can be perceived as a scaffold for retribution for those who have ignored uncomfortable truths, allowed these inefficient situations to develop, or ignored cultural issues leading to acts of non-complianc","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:usir.salford.ac.uk:2261<\/identifier><datestamp>\n      2017-08-09T15:01:21Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D7375626A65637473:51:5141:51413735<\/setSpec><setSpec>\n      7375626A656374733D6F74686572<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><setSpec>\n      6861735F6469676974616C5F6F626A6563743D54525545<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><dc:description>The Technological Frames of Reference strand of Social Shaping of Technology theory is used to overlay the issues arising from a case study looking at non-compliance with information systems. A recent review of the theory suggests that the process of framing is not always addressed and could be more useful in revealing the differing attitudes and views of the relevant social groups. This paper attempts to address this shortfall by applying the antecedents identified by previous published research on the case study and highlighting their usefulness and value. In this way, the author suggests that issues surrounding non-compliance should not be dismissed as resistance but instead should be addressed and dealt with by managers and developers. The author proposes that the antecedent conditions underpinning different categories of non-compliance can be utilized as a skeleton or framework for understanding the situations in which non-compliance arises. Further examination of the antecedent conditions reveals dependence on inefficient or ineffective organizational situations and issues and thus the framework can be perceived as a scaffold for retribution for those who have ignored uncomfortable truths, allowed these inefficient situations to develop, or ignored cultural issues leading to acts of non-compliance<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/usir.salford.ac.uk\/2261\/2\/Technological_frame_incongruence.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>Springer<\/dc:publisher><dc:relation>http:\/\/dx.doi.org\/10.1007\/978-0-387-87503-3<\/dc:relation><dc:source>9780387875026<\/dc:source><dc:subject>QA75<\/dc:subject><dc:subject>other<\/dc:subject><dc:title>Technological frame incongruence, diffusion and noncompliance<\/dc:title><rioxxterms:author>Sobreperez, P<\/rioxxterms:author><rioxxterms:type>Book chapter<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1007\/978-0-387-87503-3<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/978-0-387-87503-3"],"year":null,"topics":["QA75","other"],"subject":["QA75","other"],"fullText":"Sobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 1\nTECHNOLOGICAL FRAME INCONGRUENCE,  DIFFUSION \nAND NON-COMPLIANCE  \nSobreperez, Polly   University of Salford, Salford Crescent, Salford, M5 4WT, \np.sobreperez@salford.ac.uk \nAbstract \nThe technological frames of reference strand of social shaping of technology theory is used to overlay the \nissues arising from a case study looking at non-compliance with information systems.  A recent review of \nthe theory suggests that although frame content is often addressed, frame structure, the process of \nframing, and the characteristics and outcomes of frames are largely overlooked.  This paper attempts to \naddress this shortfall by applying the indicators identified by case study research to the frames of \ndifferent groups and using them to highlight differing perceptions and attitudes.  In this way, the author \nsuggests that issues surrounding non-compliance should not be dismissed as resistance but instead should \nbe further studied by managers and developers, leading to accommodation of differing views.   Further \nexamination of frame incongruence reveals dependence on inefficient or ineffective organizational \nsituations and thus these indicators can be useful in future studies to identify and address procedural, \nacceptance and cultural issues leading to acts of non-compliance. \nKeywords: Social Shaping, Technological Frames, Resistance, Workaround. \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 2\n1 INTRODUCTION \nThis paper builds on work identifying categories of non-compliance with information systems (Ferneley, \nSobreperez et al. 2005; Ferneley and Sobreperez 2006).  The author now ties in the technological frames \nof reference aspect of social shaping of technology (Bijker 1995);Orlikowski & Gash 1994) and applies \nthese to the case study data to identify different relevant social groups.  A recent review of technological \nframes theory suggests that most applications of theory fail to investigate; the process of ‘framing’; the \ncultural and institutional foundations of frames; and the characteristics and consequences of frame \nstructure (Davidson 2006).  This paper attempts to address this issue by applying, across a single case \nstudy, the notion of technological frame incongruence across identified relevant social groups, and uses \nindicators for non-compliance to construct contrasting technological frames.    In this way, this paper \napplies the lens of technological frames theory to the findings of the original case study (Ferneley & \nSobreperez 2006) and uses the identified groups of conditions underpinning non-compliant behaviour to \ncreate the structure of the technological frames.   This action outlines clearly that relevant groups of \nemployees who interact with information have widely disparate views of the nature and purpose of the \ninformation they use, and that this can stifle congruence or commensuration of attitudes to information \nsystems.   \nThe issue of frame commensurability is addressed (Khoo 2001) and the author believes this study clearly \nhighlights the differing attitudes of groups across a commensurate framework structure.   In addition, the \napplication of technological frames helps to identify areas where management, supervisors and \ndevelopers take different standpoints and dismiss or minimise non-compliant behaviours and their \nsubsequent negative impact on data integrity, accuracy of reporting, and organisational culture.  An \norganisational ideal is the seeking of technological frame congruence (Orlikowski and Gash 1994) and the \ncomparison of stances across different dimensions helps to identify the differing attitudes, beliefs and \nviewpoints of the relevant social groups.  In this way areas in which these differing standpoints have \ncontributed to conditions which are precursors for non-compliant behaviour are highlighted.   This action \nmay assist in the categorising, across other contexts, those behaviours which are harmless, hindering or, \nvitally, essential to the completion of tasks, processes or roles within an organisation (Ferneley and \nSobreperez 2006; Davis and Hufnagel 2007).         \n2 THEORETICAL AND RESEARCH BACKGROUND  \nEffective diffusion of innovation is considered essential to the adoption of information systems \n(Baskerville and Pries-Heje 1997) and any resistance or non-compliance is usually considered as harmful, \nundesirable and deviant and to be managed or minimised as a standard human reaction to change (Franz \nand Robey 1984; Lyytinen and Hirschheim 1987a).  In contrast several researchers have noted that \nresistance can be seen as a positive force and should be studied more closely rather than dismissed as \nrecalcitrance or reaction to fear of change (Mumford, Land et al. 1978; Markus 1983; Hirschheim and \nNewman 1988; Levine 1997).   \nIf we accept that technologies are prefigured by existing forms of work organisation, at least in part, \n(Fleck 1988) then the diffusion of technical change must be designed, developed and implemented with \nparticular objectives concerning work transformation.   The study of the implementation of technology \nhas been seen as an important site for innovation (Fleck 1988).    In this view, Fleck coins the term \n‘innofusion’ to describe ‘learning by struggling’ and lends weight to the view of the user, who manages, \nthrough trial and exploration, to identify their needs and requirements and to attempt to have these \nincorporated in future versions and configurations.   In this way technological development is a spiralling \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 3\nrather than linear process, as innovation takes place not only at design, but also at implementation and this \nfeeds into future changes.  This implies the abandonment of the notion of technology as ‘equipment’ only \nand acknowledges influences on the adoption, diffusion, configuration and usage of technologies.         \nThis ties in well with studies of non-compliance or ‘resistance’ as it is often these acts of struggling, trial \nand exploration that are seen as resistant by those who are distanced from the user\/technology interface \n(Marakas and Hornik 1996; Martinko, Henry et al. 1996; Lapointe and Rivard 2005).  In addition, other \ngroups interacting with systems or with information produced may have different views and perceptions. \nThe concept of technological frames has emerged which captures the interactions among the members of \na relevant social group (Orlikowski and Gash 1994).   The term ‘frames’ refers to the concept of frames of \nreference, borrowed from cognitive psychology, and defined by Gioia as ‘a built-up repertoire of tacit \nknowledge that is used to impose structure upon and impart meaning to otherwise ambiguous social and \nsituational information to facilitate understanding’(Gioia 1986)  \nThese frames include assumptions, knowledge and expectations expressed through language, visual \nimages, metaphors and stories.  Frames are constructed as an interaction around an artefact or process, \nand comprise shared elements such as tacit knowledge, objectives, organisational constraints, shared \nmethods, and procedures and problems.    In this way the relationships between relevant social group \nmembers are captured but made fluid and open to change where the elements change.  Frames are flexible \nin structure and content and have variable dimensions that shift in relevance and content over time and \naccording to changing context.  According to Orlikowski and Gash (1994), frames typically operate in the \nbackground and can be helpful in that they reduce uncertainty of conditions, structure organisational \nexperience and allow common interpretations of ambiguity.  They can also have constraining effects in \nthat they reinforce established and possibly negative assumptions and knowledge, inhibit creative \nproblem solving and distort information to fit existing cognitive structures (Orlikowski and Gash 1994).     \nOrlikowski and Gash use framework dimensions across three domains are common to most organisations \nto contrast their case study frames.  These are nature of technology, technology strategy (including \nmotivation and criteria of success) and technology in use (including priorities and resources, training, \nease-of use, and security and quality policies).    \nThere has been widespread application of technological frames theory to explain individual case based \nphenomenon (Lin and Cornford 2000; Khoo 2001; Iivari and Abrahamsson 2002; Davidson and Pai 2004; \nMcGovern and Hicks 2004; Lin and Silva 2005) but there is need for tools to help build a cumulative base \nof empirical findings or of cross-case comparisons (Chiasson and Davidson 2005);Davidson 2006).   \nDavidson (2006) suggests that more emphasis on the process of framing, the cultural and institutional \nfoundations of frames, and the characteristics and consequences of frame structure will add to this body \nof study and assist in cross case comparisons.   \nOrlikowski and Gash (1994) suggest the ideal of frame congruence, where frames of relevant social \ngroups related in structure and content are aligned. Congruence of technological frames implies similar \nexpectations around the role of technology in business processes and incongruence implies important \ndifferences in expectations or assumptions around key technological aspects.  The existence of \nincongruent technological frames suggests that differences in the view of division of labour, autonomy of \nemployees, and status and position of individuals are consciously or implicitly built into information \nsystems by systems planners and designers (Hirschheim and Klein 1989).    In addition, Khoo (2001) \nsuggests that the appropriateness or commensurability of frame structure is addressed.  Where frames are \nincommensurate, the concepts in one frame cannot be addressed in other frames as the there are no \ncommon meanings given to structural headings.   \nWhere incongruence is shown, the implication is that one or several relevant social groups will need to \nshift or modify their frames of reference in order to resolve incongruence.  Davidson (2006) concludes \nthat this change is likely to be required by the user or operator and not by the designer, consultant, \nmanager, executive champion or financer of the project.  This view highlights power relations and it \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 4\nbecomes difficult to see how interpretive processes are separate from political influences. The very idea \nof communicating and cooperating with users undermines the status, power and privilege of managers, \ndevelopers and those who ‘know best’ how to organise work activity.     The groups involved in IT often \nhave different priorities and goals and this creates the potential for conflict and controversy (Dunlop and \nKling 1991).   \nWalsh (1995) has also suggested that studies of structure would be more useful than studies of content, as \neffective frame structure may differ during early planning, requirements definition, implementation, and \noperation of a new IT application.  Clearly frames of reference may also change with the changing \norganisational circumstances such as diversification of products, markets or distribution channels, or \nchanges in organisational structure such as mergers and acquisitions which may bring aboard enormous \nand quickly moving changes to hardware, software, communications and data sets which must be quickly \naccommodated and for which existing software was not written or specified. \nOrlikowski and Gash (1994) provide limited guidance on the question of frame structure and include only \ncategories or domains of knowledge, highlighting frame incongruence as differing frame content. If the \nframe structure is included, then frame incongruence becomes a process of development among diverse \nstakeholders changing as a project moves through different stages of diffusion and may facilitate the \nchange process, lightening the interpretive burden and revealing patterns of association which clarify \npositions.  In this way frame incongruence may not always be problematic but may provide signposts to \nareas for further investigation.   \nThis paper attempts to add to the study of frame structure; in particular the characteristics and \nconsequences of frame structure are augmented under the technology in use heading (Orlikowski and \nGash 1994) by the application of three further sub-headings.   These are taken from the findings of the \nearlier study into non-compliance and are used to create a useful frame structure which clearly highlights \nthe notion of frame incongruence as a starting point for looking at areas where the differing attitudes of \ngroups of people have serious consequences on acceptance, progress and confidence in organisational \ninformation systems.     \n3 RESEARCH APPROACH - CASE STUDY \nThe case study described took place in 2004 \/2005 and a detailed description is found in Ferneley & \nSobreperez (2006).  To enable the reader to contextualise the research without recourse to the previous \npaper a brief outline follows.  The case study setting was a UK County Fire and Rescue Service and the \noriginal research objective was to identify, classify and understand non-compliance with information \nsystems.  The case study setting was selected because it was a highly operationally controlled \nenvironment, with clear preset routines, procedures and practices.   The culture was historically quasi-\nmilitaristic in that rank uniforms are worn, military language is used, national flags are flown, and \nsuperior ranks are deferred to in conduct, speech and dress.   In all these elements have created an \nenvironment where it might be supposed there would be an emphasis on conformity and little opportunity \nfor deviation.  The County Fire and Rescue Service is concerned with managing fire and rescue incidents \nwith minimal damage to people and property and the information context was the recording and reporting \nof these incidents.  As incidents are reported to the Fire Service a centralised control office records details \nincluding location, reporting details, personnel and equipment dispatched immediately and subsequently, \nroutes taken, dispatch and arrival times and a log of all communications with the deployed teams.   \nA detailed electronic report known as the FDR1 is completed after the incident using an on-line form with \nsemi-structured questions and any level of Officer can be assigned the responsibility of completing the \nreport.  Structured attributes include cause of fire, location within the address, degree and speed of fire \nspread, number of casualties, other emergency services involved, specific equipment used and arrival and \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 5\ndeparture times.  In addition there are free format responses for incident handling strategies and \nevaluation.  Reports are collated and summarized by a centralised office that then presents the abstracted \nresults to management who plan the allocation of future human and physical resources from this data.  In \naddition the summarized data is reported to the Office of the Deputy Prime Minister (ODPM) where it is \ncollated and compared with data from other regions.  The data is then compiled and published and \nnational funding and policy decisions are made based on the data. \nData collection included participant observation based on watching and listening, individual and group \nsemi-structured interviewing and document analysis.  Interviews typically began with generic questions \nallowing users to express their opinions on the use of technology before moving to more specific \nquestioning.   Semi structured interviews of between 40 minutes and 1½ hours were conducted with 3 \nsenior managers, 8 middle managers chosen for their wealth of experience and the diverse range of roles \nthat they occupied.  In addition 3 data analysis personnel were interviewed representing staff responsible \nfor collating and distributing the data under analysis.  Within fire stations, 24 taped group semi-structured \ninterviews of between 1½ and 3 hours were conducted with groups of between 8 and 15 Fire Officers who \nworked together as a team or ‘watch’.  Group interviews revealed situations where information systems \nwere unable to record the actuality of events and various ‘workarounds’ had been implemented.  In \naddition individuals were questioned as they were observed entering data, and were questioned closely on \ntheir reasons for responding in particular ways.    \nIn addition, key personnel outside the operational fire service were interviewed including two interviews \nat the County Statistics Office and two at the Office of the Deputy Prime Minister (ODPM) in Watford.  \nThis was in order to follow through the statistics produced by the consolidation of fire incident records by \nregion and determine how distortions were handled.   A total of four interviews took place at these \nlocations with statisticians, data entry clerks and technicians dealing with data from regional counties.  \nThe data was analysed using inductive coding and grounded theory principles of categorising and \nclustering data .   The aim was to allow a conceptual framework to emerge during the course of study as \nthe data was gathered.  This detailed process is described in a paper published in EJIS in 2006 (Ferneley \nand Sobreperez) and underpins the original intention to identify different types of non-compliance. \nIn the case study relevant social groups were  identified as the firefighters themselves involved in a \nparticular incident, the station officers using the information systems, developers, installers and \nmaintainers of information systems, senior staff involved in debriefing, local statisticians involved in \nrecording, compiling and presenting information for the county, national staff consolidating synthesizing \nand presenting national information, and politicians and policy makers involved in designing, funding and \nmanaging a national fire and rescue service.   \n4 DATA ANALYSIS \nThe seminal paper on technological frames identifies three domains which characterise case work and \ncontext (Orlikowski and Gash 1994).  These cover what the technology is, why it was introduced and how \nit was used: Nature of Technology, which refers to understanding of capabilities and functionality; \nTechnology Strategy, which refers to understanding of motivation and vision behind adoption; \nTechnology in Use which covers understanding of day-today use and associated conditions and \nconsequences.    \nThe context of this paper focuses on the ‘Technology in Use’ domain as the initial case study purpose was \nto investigate reasons for non compliance with information systems by end users.  Orlikowski and Gash \nsubdivide this domain into priorities and resources, training, ease of use, and policies for security and \nquality.     \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 6\nIn searching for explanations for non-compliance with information systems, the notion of frame \ncongruence or commensurability provides a useful tool for identifying areas where different groups of \nusers have differing beliefs and attitudes to workplace situations and where conflicts occur leading to \nsystems usage which is different from that expected by developers and managers.  The case study data \nhighlighted three subdivisions of technology in use in which perceptions of technology in use differed \ngreatly. \n4.1 Proceduralisation  \nThis includes situations where systems enforce procedures contrary to effective working practices.  For \nexample enforcing step by step chronological procedures where concurrent steps or different ordering is \nmore efficient either occasionally or regularly.  Where procedures are enforced, employees tend to \n‘workaround’ these using activities as incorrect job sequencing, retrospective data entry and pre-emptive \nprocessing.   \nFor example, firefighters noted that \n“We have to complete the FDR1 before we have had chance to have a debriefing.” \nIn other words the whole picture of the incident is not synthesized but the FDR1 must be completed \nwithin a certain timeframe which local statisticians see as a positive constraint. \nThe FDR1 must be completed while the incident is fresh in their minds.” \nIn addition local statisticians considered that the online FDR1 form gave ample opportunities for freedom \nof expression  \n“Allowing free text requires a level of interpretation which may require further investigation.” \nAt the same time, they considered the form to balance free-from and closed questions well to improve \nstandardisation.   \n“Standardisation removes ambiguities.” \n Whereas firefighters felt constrained by the form, commenting  \n“The form doesn’t let you describe what really happened, it’s just making the fire fit the form” \n“The report I saw was not the fire I went to.” \n“We sometimes request equipment we ‘may’ need and then justify it later by describing the incident \nas though we needed the kit.” \nThere were also differences between the firefighters and their senior officers in this issue.  A senior \nofficer was certain that firefighters were very careful over recording details. \n“Information is used in court for insurance, to refuse housing and occasionally to remove children \nfrom families. Fire Officers are very careful how they enter data.” \nThese examples show clearly that different groups of information users take different stances over \nproceduralisation.  Senior officers and statisticians believe that proceduralisation is in line with and useful \nto the data collection process.  Firefighters believe the system to be obstructive and do not consider \ninformation gathering to be important.  They see their ‘real’ work as fire fighting, rescuing and protecting \nand lives and property and information gathering as bureaucratic paper shuffling.  \n4.2 Acceptance \nThe issue of acceptance includes behaviours such as non-use of system in favour of manual or earlier \nsystems, and avoidance of systems usage.  This incorporates situations where users do not identify \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 7\nthemselves to the system, time spent recording accurately is seen as a waste and is avoided, and personal \nattribution is avoided by misuse of user names. \nDiffering attitudes to these is encapsulated by remarks by the firefighters such as  \n“Once it’s logged in it’s logged in for the day, I have never seen anyone log out and back in under \ntheir own password.” \nClearly this is not the perception of local statisticians who note \n“Firefighters are trained to use computers to record incidents and recording is done accurately \nand immediately after the incident.  The form is very precise and there is no room for ambiguity.” \n“Every individual has their own login details and this drives funding and training programmes.” \nNational Statisticians at the ODPM were fervent supporters of the recording systems commenting:-  \n“The system has been in use since phased implementation began in 1994 and works well to capture \nthe data required by government.”  \n“Before 1998, local statistics offices brigades coded their own data and there were many \nanomalies and ambiguities and much data was unusable.”  \n“County Fire Brigades are accredited after 18 months of external measurements and are then \nallowed to perform their own internal quality checks.”  \n“The intention is that Brigades provide routine FDR1 information as Electronic Data only, there \nare no paper forms.” \nIn contrast however, local statisticians were not so enthusiastic about the system and commented \n“At the end of the training we gave up and went back to manual systems.” \nThey were however under the impression that their work was vital and important and were proud of their \naccreditation status.  \n“Only accredited County Brigades send their information directly.” \n“Sending information to the ODPM is the most important work we do.” \nHowever National Statisticians noted that some of their carefully collated work was unused. \n“Not everything collected is used; political considerations have changed at every level since the \nFDR1 was designed.” \nThese quotes point out the different attitudes of groups to the acceptance of the system.  Local \nstatisticians considered it more important than the firefighters, but national statisticians had an overview \nand awareness of future plans which was in contrast to local implementation, even pointing out that some \nof the carefully collected and compiled information is not used. \n4.3 Culture and control \nThis covers organisational culture and management supervision and control.  Widespread deception, \nsetting and ignoring of inappropriate targets, and falsifying of deliberate inaccuracies were observed and \ndescribed.  These behaviours are underpinned by a culture of collective non-compliance and a perception \nof systems which do not properly support the work done in terms of holistic overview, and opportunity to \nexercise professional judgement.   This includes situations where systems do not support or allow \ncollaborative recording, or where recording is overlooked in favour of contingent action in emergency \nsituations.  \n \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 8\nFirefighter’s comments include:  \n“We record time of arrival early so as to meet targets.” \n“If we say cause of fire is ‘arson’ we have to liaise with the Police, better to say ‘unknown’.” \n“There is active discouragement of IT use among the lads.” \n“We cannot record what really happened if it is against guidelines or policy.” \n“We work as a team, as a unit, it doesn’t matter how incidents are recorded or who does it.” \nSenior Fire Officers loftily assured  \n“We are encouraging greater use of information systems to support record keeping and to instigate \nknowledge sharing and knowledge management across the service.” \n4.4 Summary  \nAmong firefighters, the recording of incidents using the computerised form was seen as ‘paperwork’, as \nbureaucratic, and as irrelevant to the work of firefighting.    There was no feeling of ownership or \npossession of data and little interest in accuracy.  Firefighters with the task of entering the data saw it as \nan imposition and that it was for regional and central statistics offices and not owned by the firefighters \nthemselves.  Regional and national statisticians on the other hand saw the compilation, consolidation and \npresentation of statistics as intrinsic and central to not only their own personal and individual work but to \nthe work of the regional and national fire service in general, feeding into policy and procedure.   The \ncollection of management data for the purposes of monitoring and control is misunderstood, viewed with \nsuspicion and de-prioritised by a workforce frustrated by software applications which appear to obstruct \nwhat they perceive as their ‘proper work’.   \nStaff at both the regional and national statistics office believed the database collecting information about \nindividual incidents was malleable, flexible and customizable, that they could manipulate it in many ways \nto produce their required information.  The users however, who did not use the same interface, thought it \ninflexible, over-standardized, clumsy and awkward to use, and even obstructive in its capacity to support \ntrue incident reporting.     \nThe local statistics office workers clearly believe the system is tight and that firefighters are adequately \ntrained.  The perception is that the system is well utilised within the region and that accurate data is \nforwarded to appropriate government departments.  This perspective was evident where visits to the local \nstatistics office of the County force and to the Office of the Deputy Prime Minister revealed quite \ndifferent attitudes to the information systems and issues such as acceptance, approval, confidence and \ntrust. \nIt is interesting to note that all senior officers will have been firefighters at some time in their career, so \nwill have some awareness of the local and individual use of the system.  They have an overview of the \nuse of individual statistics rather than the collation of information seen by statisticians and display a \nmanagement view of knowledge management across the service.  The firefighters perceive that the \nrecording system and the organisational circumstances force inaccuracies.   \nLocal offices are very concerned with their own provision and were very proud of their accreditation \nstatus.  They had some criticisms of the system but had found ways to ‘workaround’ some elements \nthrough recourse to manual systems.  The National Statistics Office had a nationwide overview and \nawareness of future plans not available to local offices.  At the time of the interview, only three county \nbrigades were accredited but a lofty ‘intention’ was communicated.  Interestingly, the National Statistics \nOffice revealed that not all of the carefully compiled information was used, although local offices were \nnot aware of this. In the case study the author believes that there is a high degree of commensurability and \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 9\nthat the members of relevant social groups are aware of and addressing the same areas. For example in the \ncase study, firefighters and managers share frames bout incidents, but managers share frames concerning \nstatistics with local and national statisticians. \nThe existence of incongruent technological frames can clearly be seen in the context of the case study \nwhere views of the division of labour, autonomy of employees, and status and position of individuals are \nconsciously or implicitly built into information systems by systems planners and designers (Hirschheim \nand Klein 1989).     \n5 DISCUSSION \nDiffusion and innovation has been underdeveloped and has become stagnant across the organisation \nstudied in this case research.  The Fire Service does not make use of collaborative, mobile or workflow \ntechnologies which may be more suitable in this specialised area.   Indeed many of the proceduralisation, \nacceptance and control issues underpinning non-compliance could be addressed by recourse to these \ntechnologies which more closely match the work of the Fire Service, and other emergency services.  The \nentire information systems are still following 1980’s technology models, for example the practice, \nundertaken by all regional offices, of posting a floppy disk in a padded envelope to the ODPM was \nreferred to as electronic data interchange. \nRogers (1995) theory of diffusion includes four main elements of innovation, communication, time and \nsocial systems.  The innovation itself, ‘more suitable technologies’, has many advantages which are \nobservable and trialable but there is little knowledge of the advantages of these within the fire service. \nThe data from the case study revealed that social systems and communications were such that firefighters \nwho generated information, and the only people who could verify or refute any implications drawn, had \nlittle interest in accuracy of detail or presentation.    They felt in particular that information was owned by \nregional and national statisticians and was used for purposes outside their knowledge, understanding and \ncontrol.  Firefighters and station officers had awareness of the implications of targets benchmarks and \nperformance indicators, but felt that data was twisted and manipulated at various stages to meet \nunachievable targets, and to provide regional and national policy makers with information they wanted to \nsee. Senior personnel were not interested in innovation and senior information systems personnel were \nconcerned only with centralised data collection and not in supporting firefighters at the scene of incidents. \nSocial shaping theory suggests that a process of action and interaction involving communication and \ncollaboration between groups form and shape technology (Van Maanen and Schein 1979; Porac, Thomas \net al. 1989).   The different levels and areas of expertise in many overlapping fields, and the different \nobjectives, priorities and concerns of these groups suggests that there is considerable potential for poor \ncommunication, discord and conflict.   For example from the case research, there is conflict between the \npolitical expediency of recording short arrival times to fire incidents by firefighters, and the accuracy of \nrecording required by statisticians. \nThe particular issue of innovation within organisations also includes issues of structure including; the \ndegree of centralisation; organizational complexity; level of formality; interconnections between \ndepartments and resources, and finally size.   \nRogers (1995) suggests that a high degree of centralisation and high degree of formality are negatively \ncorrelated with innovation and that high levels of interconnections, high levels of complexity and large \nsize of organisations are positively correlated with innovation.    Clearly and as outlined earlier, there is a \nhigh degree of centralisation and formality within the Fire Service  \nRogers also adds a stratum of leadership and posits that the attitude towards change held by leaders will \ninfluence innovation along with systems openness and interactions with those in the same industry using \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 10\ninnovative technologies.  All senior firefighters, including those in management, will have been junior \nfirefighters earlier in their careers and thus perceive that they know and understand the systems used.  \nAny innovations will be outside of their knowledge and they may wish to ensure knowledge and power \nrelations by keeping things as they are. In addition, although there are similarities with other emergency \nservices, the Fire and Rescue Service is unique in the nature of its business and is unlikely to come across \nother information systems that meet requirements, although international collaboration in these matters \nmight be a useful starting place. \nRogers (1995) suggests that organisational size and complexity are positively correlated with innovation \ndue to the possibility of access to higher knowledge and expertise.  However others have highlighted the \ncomplexity of interactions between groups as a probable cause of even further problems where complex \nhuman action, not necessarily understood in depth by developers and technical specialists, is to be \nsupported using information systems. (Fincham, Fleck et al. 1995)    This is particularly true in the Fire \nService where each incident is different and firefighters, both individually and as a group, bring a large \namount of tacit experience and knowledge to any situation.   Each incident is extremely idiosyncratic and \nmust be dealt with so dynamically that there can be no ‘right answer’ to the way it is handled.  \nApproaches are and must be contingent on the location and severity of the incident; the speed of \noccurrences, events and responses; the skills and expertise of those present; and the response of the \ncontrol centre and senior officers present or not present.     As each incident is unique it becomes difficult \nto draw up and apply rules and guidelines and it may be that what superficially appear to be similar \nincidents are dealt with entirely differently in response to a variety of factors which will be complex and \nproblematic to identify.  In view of this it becomes increasingly challenging to create information systems \nto match and support workforce action or to manage knowledge across an organisation involved in highly \ncomplex individualistic, distinctive incidents which need to be grouped and consolidated in a variety of \nways to be presented to policy makers and managers. \nRogers (1995) also draws attention to types of innovation-decisions and identifies three types as optional, \ncollective and authority.  The description of the quasi militaristic culture in the research approach section \ninforms us that decisions in the fire service are likely to be authority based.  \nThe characteristics and consequences of framing (Davidson 2006) are addressed in this paper through the \nselection of three indicators developed from the case study data.  These may be reconciled with the \n‘Technology in use’ structural elements of Orlikowski and Gash but are less quality, security and policy \noriented and more aligned to the issue of non-compliance.  These may prove useful as a way of cutting \nacross organisational boundaries to find common perceptions in information systems usage and to reach \naccommodation of parallel but differing requirements rather than compliance with an imposed system. \nWithin the Fire Service, firefighters, local and national statisticians had never met each other and had \nlittle direct interaction.  Use of the three indicators underpinning non-compliant behaviour were \ncontextually relevant to all social groups and were recognised and acknowledged as areas of concern.  \nUse of these conditions takes a step closer to acknowledgment of these issues and forms a framework for \nidentifying and addressing the differing attitudes and perceptions and noting where non-compliance is \nharmless, hindering, or essential (Ferneley & Sobreperez 2006).  This distinction is important in \ndetermining which behaviours to study further and identify as critique.   “The seeds of innovation grow \nout of resistance and defensive patterns that suppress resistance, suppress innovation” (Levine \n1997,p167). \nThis paper brings the notion of incongruent or incommensurate technological frames of reference into the \nstudy of resistance and its underlying motivations.  From the perspective of the firefighter, systems \nhindered working practices, from a management perspective any non-compliant behaviour had negative \nramifications as data integrity was destroyed and workplace routines and regulations were regularly \nflouted.  Again, viewed through a different technological frame, non-compliance may be regarded as a \npositive force and may also highlight a dynamic organisational culture and willingness to innovate and \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 11\nimprovise ((Petrides, McClelland et al. 2004).    Non compliance with a system that does not properly \nmatch and support work practice may lead to development of a new and better systems which improve \nthis aspect.  This can only be true if systems specifiers and information users are aware of systems \nshortcomings and are willing to appraise, assess and review systems in the light of knowledge about the \nmotivations for non-compliance. \nThe cultural and institutional foundations of differing frames (Davidson 2006) can be distinguished by the \ndiffering educational backgrounds, career paths, workplace and data usage of the relevant social groups \nwhich are very clear in this case study and which may account for incompatible attitudes to data \ncollection and utilisation.  Understandings, interpretations and expectations of information systems are \nframed and reframed through the exercise of power (Lin and Silva 2005) and the case study shows that in \nthe context of data collection and usage, operational firefighters are in the least powerful position.  \nSimilarly there are power issues between local and national statisticians in that local statisticians must \nfeed data through for consolidation and comparison with other regional services and clearly would not \nwish this to reflect badly on their local service.  In this way then, power is exercised through the enforced \ndenial of actual events, which may be contrary to guidelines, by firefighters and the acceptance of \ninformation known to be inaccurate by statisticians and senior firefighters.    \nThe process of framing and reframing has been shown to facilitate moves towards frame congruence (Lin \nand Silva 2005).  Their study details the process of framing and reframing by rephrasing and renaming \nissues, artefacts and purposes so that common ground is carefully reconstructed.  The Fire Service case \nstudy is built upon commonly accepted terminology within the organisation and stakeholders refer to \nthese elements using common language and understanding. The characteristics and consequences of \nframe structure (Davidson 2006)  may be addressed by the acceptance of these conditions as recognisable \nby relevant social groups and may also provide direction for future research within this and other case \nstudy settings.    \nThe three indicators are brought together from this case study but are also found in other empirical \nstudies.  Enforced and inappropriate proceduralisation is found notably Bowers Mason and Sharrock’s \nstudy of the print industry(1995), where a new system required printshop workers to take tasks in job \nnumber order when it would have been more appropriate to group those using the same type or size of \npaper to avoid paper loading overheads.   \nThe acceptance issue is found not only in this case study but across other studies such as Timmons (2003) \nstudy of nursing which found that much electronic record keeping was simply not done.  In addition, and \nin common with this case study, on many occasions users did not identify themselves for fear of \nattribution of errors and inaccuracies. \nCulture and control issues are recorded in other case studies in particular of call centres where perceptions \nare that workforces are closely monitored (Sewell and Wilkinson 1992; Bain and Taylor 2000; Callaghan \nand Thompson 2001; Lankshear, Cook et al. 2001)  It may be that all workplaces ignore this type of \nbehaviour up to a point to allow some ‘breathing space’ but within this case study there was a definite \nmanagement attitude of ‘as long as we get our data.....’ and the reflection of actuality was not considered \nimportant or perhaps too difficult to confront.   \nThe issue here is that those who have specified the system do not understand the detail of the tasks \nundertaken by the end users.  They have specified a system which is counter-efficient and continue to \ninsist that it is utilised by a workforce that been perfunctorily consulted because it meets their \nmanagement requirements but does not adequately match and support the actual work undertaken.   This \nseems particularly true in situations where the system does not support or allow collective recording, or \nwhere the recording of steps taken or behaviours is ignored in favour of emergency actions such as \nfirefighting or nursing.  Emergency actions which may contravene policy or guidelines are routinely \nundertaken but not recorded and again such actions are found across other case studies such as Kobayashi \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 12\n(2005) study of workarounds in a medical context or Timmons (2003) study of nursing and the use of \nrecording technology. \nDue to the shortcomings of the imposed system, and the unequal power relations between \ndesigner\/manager and the end user, it is the end user who must typically ‘workaround’ the system to try \nand get the job done.  This is in line with the notion of frame incongruence and Davidson’s view that the \nshift towards congruence must be made by those lower in the power relation stakes.   \n6 CONCLUSION \nInformation from different groups across a single case study has been examined and reveals differences in \nattitudes perceptions and stances around information systems.  The technological frames construct is used \nto contrast thoughts, opinions and mindsets of different groups towards non compliance with information \nsystems.  Three indicators are employed to provide structure for the frames of reference and these were \nidentified within the case study as precursors for non-compliant behaviour.  The emergence and \nunderstanding of these precursors were understood and widely discussed throughout the organisation and \nthus commensurability was ensured.  The overlaying of technological frames theory and application of \ncase study findings points out very clearly the differing attitudes, perceptions and expectations of the \ndiverse groups, both to systems usage and to any non-compliant behaviour.   \nThe use of these dimensions in the structure of the frames led to a more meaningful comparison than \nmore general structures such as ‘how technology is used’.  This approach is useful in bringing issues to \nlight and raising awareness of those concerned with implementation of the contradictions between the \nbeliefs of organizational members and actual system functionality.   The characteristics and consequences \nof the selection of frame structure components highlight concerns in that non-compliant behaviour \nbecomes a result of indicators within the control of managers, supervisors and developers.  The differing \ntechnological frame views of relevant groups indicate issues that are within the control of managers and \ndevelopers and that could be addressed in future planning and implementation.  In this way non-\noperational groups take responsibility for cultural attitudes, control of data entry, proceduralisation and \nsystems acceptance.     \nThe author suggests that issues surrounding non-compliance should not be dismissed as resistance but \nshould addressed by managers and developers and become a skeleton or framework for understanding \nproblems and developing organisationally aligned solutions.  The contribution of this study then is to \npoint out that case study findings can interlock and intersect across theoretical areas and the use of the \ntechnological frames of reference provides a useful way to clearly demonstrate the existence of relevant \nsocial groups and the congruence or otherwise of their technological frames, therefore clearly highlighting \nareas of concern. \nThe framework used by Orlikowski and Gash (1994) is augmented by three further subdivisions of \nproceduralisation, acceptance, and culture and control, which serve to focus more clearly on issues of \nnon-compliance and seek understanding and accommodation of viewpoints rather than dismissal of issues \nimportant to users and to successful implementation of information systems across and organisation. \n7 REFERENCES \nBain, P. and P. Taylor (2000). \"Entrapped by the 'electronic panopticon'? Worker resistance in the call \ncentre.\" New Technology Work and Employment 15(1): 2-18. \nBaskerville, R. and J. Pries-Heje (1997). IT Diffusion and innovation models: the conceptual domains. \nFacilitating Technology Transfer through Partnership: Learning from practice and research. T. \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 13\nMcMaster, E. Mumford, E. Burton Swanson, B. Warboys and D. Wastell. London, Chapman & \nHall. \nBijker, W. E. (1995). Of Bicycles, Bakelites, and Bulbs: Toward a Theory of Sociotechnical Change. \nCambridge, Massachusetts, The MIT Press. \nBowers, J., G. Button and W. Sharrock (1995). Workflow from within and without: Technology and Co-\noperative work on the Print Industry Shopfloor. European Conference on Computer Supported C-\noperative work, Stockhom, Sweden, Kluwer Academic Publishers, Dordrecht. \nCallaghan, G. and P. Thompson (2001). \"Edwards Revisited: Technical Control and Call Centres.\" \nEconomic and Industrial Democracy 22(1): 13-37. \nChiasson, M. and E. Davidson (2005). \"Taking industry seriously in IS Research.\" MIS Quarterly 29(2-\n16). \nDavidson, E. (2006). \"A Technological Frames Perspective on  Information Technology and \nOrganisational Change.\" Journal of Applied Behavioural Science 42(1): 23-39. \nDavidson, E. and D. Pai (2004). Making sense of Technology Frames: Promise, progress and potential. \nRelevant Theory and Informed Practice: Looking Forward from a 20 year perspective on IS \nresearch. B. Kaplan, D. Truex, D. Wastell, T. Wood Harper and J. DeGross. Boston, Kluwer: \n473-491. \nDavis, C. and E. Hufnagel (2007). \"Through the Eyes of Experts: A Socio-cognitive Perspective on the \nAutomation of Fingerprint work.\" MIS Quarterly 31(4): 681-703. \nDunlop, C. and R. Kling (1991). Computerisation and controversy: value conflicts and social choices. \nBoston, Academic Press. \nFerneley, E. and P. Sobreperez (2006). \"Resist, Comply or Workaround: An examination of different \nfacets of user engagement with information systems.\" European Journal of Information Systems \n15(4): 345-356. \nFerneley, E., P. Sobreperez and F. A. Wilson (2005). Tricks or Trompe L'Oeil? An Examination of \nWorkplace Resistance in an Information Rich Managerial Environment. 13th European \nConference on Information Systems, Regensberg, Germany. \nFincham, R., J. Fleck, R. Procter, H. Scarborough, M. Tierney and R. Williams (1995). Expertise and \nInnovation:Information Strategies in the Financial Services Sector. Oxford, Oxford University \nPress. \nFleck, J. (1988). Innofusion or diffusation? The nature of technologival development in robotics. \nEdinburgh PICT Working Paper No 7. Edinburgh. \nFranz, C. R. and D. Robey (1984). \"An investigation of User-Led Systems design: Rational and Political \nperspectives.\" Communications of the ACM 27(12): 1202-1209. \nGioia, D. A. (1986). Symbols, Scripts and Sensemaking: Creating Meaning in the Organisational \nExperience. The Thinking Organisation. San Francisco, Jossey-Bass: 49-74. \nHirschheim, R. and H. Klein, K. (1989). \"Four Paradigms of Information Systems Development.\" \nCommunications of the ACM 32(10): 1199-1216. \nHirschheim, R. A. and M. Newman (1988). \"Information Systems and User Resistance: Theory and \nPractice.\" Computer Journal 31(5): 398-408. \nIivari, N. and P. Abrahamsson (2002). The interaction between organisational subcultures and user-\ncentred design - a case study of an implementation effort. 35th Annual Hawaii International \nConference on Systems Science, Los Alamitos, IEEE Computer Society Press. \nKhoo, M. (2001). Community Design of DLESE's Collections Review Policy: A Technolgoical frames \nAnalysis. Proceedings of the 1st Joint Conference on Digital Libraries, New York, Association \nfor Computing Machinery. \nKobayashi, M., S. Fussell, Y. Xiao and J. Seagull (2005). \"Work Co-ordination, Workflow and \nworkarounds in a Medical Context.\" CHI: 1561-1564. \nLankshear, G., P. Cook, D. Mason, S. Coates and B. Graham (2001). \"Call Centre Employees' Responses \nto Electronic Monitoring: Some Research Findings.\" Work, Employment and Society 15(3): 595-\n605. \nSobreperez.\/Technological Frame Incongruence, Diffusion and non-compliance 14\nLapointe, L. and S. Rivard (2005). \"A Multilevel Model of Resistance to Information Technology \nImplementation.\" MIS Quarterly 29(3): 461-491. \nLevine, L. (1997). An ecology of resistance. Facilitating Technology Transfer through Partnership: \nLearning from practice and research. T. McMaster, E. Mumford, E. Burton Swanson, B. Warboys \nand D. Wastell. London, Chapman & Hall. \nLin, A. and T. Cornford (2000). Framing Implementation Management. 21st International Conference on \nInformation Systems, Atlanta, Association for Information Systems. \nLin, A. and L. Silva (2005). \"The Social and Political construction of technological frames.\" European \nJournal of Information Systems 14: 49-59. \nLyytinen, K. and R. Hirschheim (1987a). Information systems failures:a survey and classification of the \nempirical literature. Oxford Surveys in Information Technology. Oxford, Oxford University \nPress. \nMarakas, G. M. and S. Hornik (1996). \"Passive Resistance Misuse: Overt Support and Covert \nRecalcitrance in IS Implementation.\" European Journal of Information Systems 5(3): 208-220. \nMarkus, M., L. (1983). \"Power, Politics, and MIS Implementation.\" Communications of the ACM 26(6): \n430-444. \nMartinko, M. J., J. W. Henry and R. W. Zmud (1996). \"An Attributional Explanation of Individual \nResistance to the Introduction of Information Technologies in the Workplace.\" Behaviour & \nInformation Technology 15(5): 313-330. \nMcGovern, T. and C. Hicks (2004). \"How political proceses shaped the IT adoption by a small make to \norder company: A Case study in the insulated wire and cable industry.\" Information and \nManagement 42: 243-257. \nMumford, E., F. F. Land and J. Hawgood (1978). \"A participative approach to planning and designing \ncomputer systemsand procedures to assist this.\" Impact of science on society 28(3): 235-253. \nOrlikowski, W. J. and D. C. Gash (1994). \"Technological Frames:Making Sense of Information \nTechnology in Organizations.\" ACM Transactions on Information Systems 12(2): 669-702. \nPetrides, L. A., S. I. McClelland and T. R. Nodine (2004). \"Costs and Benefits of the Workaround: \nInventive Solution or Costly alternative.\" International Journal of Educational Management \n18(2): 100-108. \nPorac, J. F., H. Thomas and C. Baden Fuller (1989). \"Competitive Groups as cognitive communities:The \ncase of Scottish Knitwear manufacturers.\" Journal of Management Studies 26(4): 397-416. \nRogers, E. M. (1995). Diffusion of Innovation. New York, Free Press. \nSewell, G. and B. Wilkinson (1992). \"'Someone to watch over me': Surveillance, Discipline and the Just-\nin-time labour process.\" Sociology 26(2): 271-289. \nTimmons, S. (2003). \"A failed panopticon: surveillance of nursing practive via new technology.\" New \nTechnology Work and Employment 18(2): 143-153. \nVan Maanen, J. and E. Schein (1979). \"Towards a theory of Organisational Socialisation.\" Research in \nOrganisational Behaviour 1: 209-264. \nWalsh, J. P. (1995). \"Managerial and Organizational Cognition: Notes from a Trip Down Memory Lane.\" \nOrganization Science 6(3): 280-321. \n \n"}