{"doi":"10.1029\/2008GL035798","coreId":"11149","oai":"oai:eprints.lancs.ac.uk:35429","identifiers":["oai:eprints.lancs.ac.uk:35429","10.1029\/2008GL035798"],"title":"Could negative ion production explain the polar mesosphere winter echo (PMWE) modulation in active HF heating experiments?","authors":["Kero, A.","Enell, C.-F.","Kavanagh, A.J.","Vierinen, J.","Virtanen, I.","Turunen, E."],"enrichments":{"references":[{"id":763439,"title":"Characterization of auroral radar power spectra and autocorrelation functions,","authors":[],"date":"2000","doi":"10.1029\/1998rs002133","raw":"Jackel, B. J. (2000), Characterization of auroral radar power spectra and autocorrelation functions, Radio Sci., 35, 1009–1023.","cites":null},{"id":16409200,"title":"D-Region ion chemistry model, in STEP Handbook of Ionospheric Models,","authors":[],"date":"1996","doi":null,"raw":"Turunen, E., H. Matveinen, J. Tolvanen, and H. Ranta (1996), D-Region ion chemistry model, in STEP Handbook of Ionospheric Models, edited by R. W. Schunk, pp. 1–25, Sci. Comm. on Sol. Terr. Phys., Boulder, Colo.","cites":null},{"id":761534,"title":"Effects of D-region RF heating studied with the Sodankyla¨ Ion Chemistry model,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-1575-2005","raw":null,"cites":null},{"id":763228,"title":"Extension of the MSIS thermosphere model into the middle and lower atmosphere,","authors":[],"date":"1991","doi":"10.1029\/90ja02125","raw":"Hedin, A. E. (1991), Extension of the MSIS thermosphere model into the middle and lower atmosphere, J. Geophys. Res., 96, 1159–1172.","cites":null},{"id":760706,"title":"First artificially induced modulation of PMSE using the EISCAT heating facility,","authors":[],"date":"2000","doi":"10.1029\/2000gl011897","raw":"Chilson, P. B., E. Belova, M. T. Rietveld, S. Kirkwood, and U.-P. Hoppe (2000), First artificially induced modulation of PMSE using the EISCAT heating facility, Geophys. Res. Lett., 27, 3801–3804.","cites":null},{"id":761936,"title":"First detection of charged dust particles in the Earth’s mesosphere,","authors":[],"date":"1996","doi":"10.1029\/96ja00003","raw":"Havnes, O., J. Trøim, T. Blix, W. Mortensen, L. I. Næsheim, E. Thrane, and T. Tønnesen (1996), First detection of charged dust particles in the Earth’s mesosphere, J. Geophys. Res., 101, 10,839–10,847.","cites":null},{"id":763671,"title":"First HF radar measurements of summer mesopause echoes at SURA,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0935-z","raw":"Karashtin, A. N., Y. V. Shlyugaev, V. I. Abramov, I. F. Belov, I. V. Berezin, V. V. Bychkov, E. B. Eryshev, and G. P. Komrakov (1997), First HF radar measurements of summer mesopause echoes at SURA, Ann. Geophys., 15, 935–941.","cites":null},{"id":760507,"title":"First observation of the overshoot effect for polar mesosphere winter echoes during radiowave electron temperature modulation,","authors":[],"date":"2008","doi":"10.1029\/2007gl032457","raw":"Belova, E., M. Smirnova, M. T. Rietveld, B. Isham, S. Kirkwood, and T. Sergienko (2008), First observation of the overshoot effect for polar mesosphere winter echoes during radiowave electron temperature modulation, Geophys. Res. Lett., 35, L03110, doi:10.1029\/2007GL032457.","cites":null},{"id":763901,"title":"First observations of the artificial modulation of polar mesospheric winter echoes,","authors":[],"date":"2006","doi":"10.1029\/2006gl027565","raw":"Kavanagh, A. J., F. Honary, M. T. Rietveld, and A. Senior (2006), First observations of the artificial modulation of polar mesospheric winter echoes, Geophys. Res. Lett., 33, L19801, doi:10.1029\/2006GL027565.","cites":null},{"id":762909,"title":"First observations of the PMSE overshoot effect and its use for investigating the conditions in the summer mesosphere Geophys,","authors":[],"date":"2003","doi":"10.1029\/2003gl018429","raw":"Havnes, O., C. La Hoz, L. I. Næsheim, and M. T. Rietveld (2003), First observations of the PMSE overshoot effect and its use for investigating the conditions in the summer mesosphere Geophys, Geophys. Res. Lett., 30(23), 2229, doi:10.1029\/2003GL018429.","cites":null},{"id":761031,"title":"Hocking","authors":[],"date":"1992","doi":null,"raw":"Collis, P. N., M. T. Rietveld, J. Ro ¨ttger, and W. K. Hocking (1992), Turbulence scattering layers in the middle-mesosphere observed by the EISCAT 224-MHz radar, Radio Sci., 27, 97–107.","cites":null},{"id":765171,"title":"Infrasound—The cause of strong polar mesosphere winter echoes?,","authors":[],"date":"2006","doi":"10.5194\/angeo-24-475-2006","raw":"Kirkwood, S., P. Chilson, E. Belova, P. Dalin, I. Ha ¨ggstro ¨m, M. Rietveld, and W. Singer (2006), Infrasound—The cause of strong polar mesosphere winter echoes?, Ann. Geophys., 24, 475–491.","cites":null},{"id":16409202,"title":"Ionosphere-atmosphere interaction during solar proton events,","authors":[],"date":"2006","doi":null,"raw":"Verronen, P. T. (2006), Ionosphere-atmosphere interaction during solar proton events, Ph.D. thesis, Finn. Meteorol. Inst., Helsinki.","cites":null},{"id":767151,"title":"Joint radar\/lidar observations of possible aerosol layers in the winter mesosphere,","authors":[],"date":"2004","doi":"10.1016\/j.jastp.2004.03.008","raw":null,"cites":null},{"id":767386,"title":"Meteor smoke particle properties derived from Arecibo incoherent scatter radar observations,","authors":[],"date":"2007","doi":"10.1029\/2007GL030635","raw":"Strelnikova, I., M. Rapp, S. Raizada, and M. Sulzer (2007), Meteor smoke particle properties derived from Arecibo incoherent scatter radar observations, Geophys. Res. Lett., 34, L15815, doi:10.1029\/2007GL030635.","cites":null},{"id":766192,"title":"Meteoric smoke particles: Evidence from rocket and radar techniques,","authors":[],"date":"2007","doi":"10.1016\/j.asr.2006.11.021","raw":"Rapp, M., I. Strelnikova, and J. Gumbel (2007), Meteoric smoke particles: Evidence from rocket and radar techniques, Adv. Space Res., 40, 809–817.","cites":null},{"id":765415,"title":"Neutral air turbulence and temperatures in the vicinity of polar mesosphere summer echoes,","authors":[],"date":"2002","doi":"10.1029\/2003jd003415","raw":"Lu ¨bken, F., M. Rapp, and P. Hoffmann (2002), Neutral air turbulence and temperatures in the vicinity of polar mesosphere summer echoes, J. Geophys. Res., 107(D15), 4273, doi:10.1029\/2001JD000915.","cites":null},{"id":764422,"title":"New incoherent scatter diagnostic methods for the heated D-region ionosphere,","authors":[],"date":"2008","doi":"10.5194\/angeo-26-2273-2008","raw":"Kero, A., J. Vierinen, C.-F. Enell, I. Virtanen, and E. Turunen (2008), New incoherent scatter diagnostic methods for the heated D-region ionosphere, Ann. Geophys., 26, 2273–2279.","cites":null},{"id":766426,"title":"Polar mesosphere summer echoes (PMSE) studied at Bragg wavelengths of 2.8 m, 67 cm, and 16 cm,","authors":[],"date":"2008","doi":"10.1016\/j.jastp.2007.11.005","raw":"Rapp, M., I. Strelnikova, R. Latteck, P. Hoffmann, U.-P. Hoppe, I. Ha ¨ggstro ¨m, and M. T. Rietveld (2008), Polar mesosphere summer echoes (PMSE) studied at Bragg wavelengths of 2.8 m, 67 cm, and 16 cm, J. Atmos. Sol. Terr. Phys., 70, 947–961.","cites":null},{"id":765948,"title":"Polar mesosphere summer echoes (PMSE): Review of observations and current understanding,","authors":[],"date":"2004","doi":"10.5194\/acp-4-2601-2004","raw":"Rapp, M., and F.-J. Lu ¨bken (2004), Polar mesosphere summer echoes (PMSE): Review of observations and current understanding, Atmos.","cites":null},{"id":766935,"title":"Polar mesosphere summer echoes observed with the EISCAT 933-MHz radar and the CUPRI 46.9-MHz radar, their similarity to 224-MHz radar echoes, and their relation to turbulence and electron density profiles,","authors":[],"date":"1990","doi":"10.1029\/rs025i004p00671","raw":"Ro ¨ttger, J., M. T. Rietveld, C. La Hoz, T. Hall, M. C. Kelley, and W. E. Swartz (1990), Polar mesosphere summer echoes observed with the EISCAT 933-MHz radar and the CUPRI 46.9-MHz radar, their similarity to 224-MHz radar echoes, and their relation to turbulence and electron density profiles, Radio Sci., 25, 671–687.","cites":null},{"id":764939,"title":"Polar mesosphere winter echoes during solar proton events, Adv. Polar Upper Atmos.","authors":[],"date":"2002","doi":null,"raw":"Kirkwood, S., V. Barabash, E. Belova, H. Nilsson, T. N. Rao, K. Stebel, A. Osepian, and P. B. Chilson (2002), Polar mesosphere winter echoes during solar proton events, Adv. Polar Upper Atmos. Res., 16, 111–125.","cites":null},{"id":764668,"title":"Polar mesosphere winter echoes—A review of recent results,","authors":[],"date":"2007","doi":"10.1016\/j.asr.2007.01.024","raw":"Kirkwood, S. (2007), Polar mesosphere winter echoes—A review of recent results, Adv. Space Res., 40, 751–757.","cites":null},{"id":761651,"title":"Polar Mesospheric Summer Echoes (PMSE) overshoot effect due to cycling of artificial electron heating,","authors":[],"date":"2004","doi":"10.1029\/2003ja010159","raw":"Havnes, O. (2004), Polar Mesospheric Summer Echoes (PMSE) overshoot effect due to cycling of artificial electron heating, J. Geophys. Res., 109, A02309, doi:10.1029\/2003JA010159.","cites":null},{"id":765848,"title":"Radar measurements of turbulence, electron densities, and absolute reflectivities during polar mesosphere winter echoes (PMWE),","authors":[],"date":"2007","doi":"10.1016\/j.asr.2007.01.015","raw":"Lu ¨bken, F., W. Singer, R. Latteck, and I. Strelnikova (2007), Radar measurements of turbulence, electron densities, and absolute reflectivities during polar mesosphere winter echoes (PMWE), Adv. Space Res., 40, 758–764.","cites":null},{"id":16409208,"title":"Radar observations of winds and turbulence in the stratosphere and mesosphere,","authors":[],"date":"1974","doi":"10.1175\/1520-0469(1974)031<0493:roowat>2.0.co;2","raw":"Woodman, R. F., and A. Guillen (1974), Radar observations of winds and turbulence in the stratosphere and mesosphere, J. Atmos. Sci., 31, 493–505. C.-F. Enell, A. Kero, E. Turunen, and J. Vierinen, Sodankyla ¨ Geophysical Observatory, University of Oulu, Ta ¨htela ¨ntie 62, FIN-99600 Sodankyla ¨, Finland. (antti.kero@sgo.fi) A. J. Kavanagh, Department of Communication Systems, Lancaster University, Infolab 21, Lancaster LA1 4YW, UK. I. Virtanen, Department of Physical Sciences, University of Oulu, P.O. Box 3000, FIN-90014 Oulu, Finland. L23102 KERO ET AL.: PMWE MODULATION DUE TO NEGATIVE IONS? L23102 4o f4","cites":null},{"id":760283,"title":"Response time of PMSE to ionospheric heating,","authors":[],"date":"2003","doi":"10.1029\/2002jd002385","raw":"Belova, E., P. B. Chilson, S. Kirkwood, and M. T. Rietveld (2003), Response time of PMSE to ionospheric heating, J. Geophys. Res., 108(D8), 8446, doi:10.1029\/2002JD002385.","cites":null},{"id":16409190,"title":"S t e b e l ,K . ,U .B l u m ,K . - H .F r i c k e ,S .K i r k w o o d ,N .M i t c h e l l ,a n d A. Osepian (2004), Joint radar\/lidar observations of possible aerosol layers in the winter mesosphere,","authors":[],"date":null,"doi":"10.1016\/j.jastp.2004.03.008","raw":"S t e b e l ,K . ,U .B l u m ,K . - H .F r i c k e ,S .K i r k w o o d ,N .M i t c h e l l ,a n d A. Osepian (2004), Joint radar\/lidar observations of possible aerosol layers in the winter mesosphere, J. Atmos. Sol. Terr. Phys., 66, 957–970.","cites":null},{"id":16409205,"title":"Simultaneous and common-volume observations of noctilucent clouds and polar mesosphere summer echoes,","authors":[],"date":"1999","doi":"10.1029\/1999gl900206","raw":"von Zahn, U., and J. Bremer (1999), Simultaneous and common-volume observations of noctilucent clouds and polar mesosphere summer echoes, Geophys. Res. Lett., 26, 1521–1524.","cites":null},{"id":16409197,"title":"The SOLAR2000 empirical solar irradiance model and forecast tool,","authors":[],"date":"2000","doi":"10.1016\/s1364-6826(00)00070-5","raw":"Tobiska, W., T. Woods, F. Eparvier, R. Viereck, L. Floyd, D. Bouwer, G. Rottman, and O. White (2000), The SOLAR2000 empirical solar irradiance model and forecast tool, J. Atmos. Sol. Terr. Phys., 62, 1233–1250.","cites":null},{"id":766669,"title":"The structure and dynamics of polar mesosphere summer echoes observed with the EISCAT 224 MHz radar,","authors":[],"date":"1988","doi":"10.1029\/gl015i012p01353","raw":"Ro ¨ttger, J., C. La Hoz, M. C. Kelley, U.-P. Hoppe, and C. Hall (1988), The structure and dynamics of polar mesosphere summer echoes observed with the EISCAT 224 MHz radar, Geophys. Res. Lett., 15, 1353–1356.","cites":null},{"id":765665,"title":"The thermal and dynamical state of the atmosphere during polar mesosphere winter echoes,","authors":[],"date":"2006","doi":"10.5194\/acp-6-13-2006","raw":"Lu ¨bken, F.-J., B. Strelnikov, M. Rapp, W. Singer, R. Latteck, A. Brattli, U.-P. Hoppe, and M. Friedrich (2006), The thermal and dynamical state of the atmosphere during polar mesosphere winter echoes, Atmos. Chem. Phys., 6, 13–24.","cites":null},{"id":764175,"title":"The University of Bern Atmospheric Ion Model: Time-dependent modeling of the ions in the mesosphere and lower thermosphere,","authors":[],"date":"2003","doi":"10.1029\/2002jd003024","raw":"Kazil, J., E. Kopp, S. Chabrillat, and J. Bishop (2003), The University of Bern Atmospheric Ion Model: Time-dependent modeling of the ions in the mesosphere and lower thermosphere, J. Geophys. Res., 108(D14), 4432, doi:10.1029\/2002JD003024.","cites":null},{"id":761146,"title":"Variations of mesospheric structures in different seasons,","authors":[],"date":"1979","doi":"10.1029\/gl006i006p00459","raw":"Czechowsky, P., R. Ru ¨ster, and G. Schmidt (1979), Variations of mesospheric structures in different seasons, Geophys. Res. Lett., 6, 459–462.","cites":null},{"id":760001,"title":"VHF echoes from the high-latitude mesosphere and lower thermosphere, observations and interpretations,","authors":[],"date":"1983","doi":"10.1175\/1520-0469(1983)040<2451:vefthl>2.0.co;2","raw":"Balsley, B. B., W. L. Ecklund, and D. C. Fritts (1983), VHF echoes from the high-latitude mesosphere and lower thermosphere, observations and interpretations, J. Atmos. Sci., 40, 2451–2466.","cites":null},{"id":761266,"title":"VHF radar echoes observed in the summer and winter polar mesosphere over Andøya,","authors":[],"date":"1989","doi":"10.1029\/jd094id04p05199","raw":null,"cites":null},{"id":16409089,"title":"VHF radar echoes observed in the summer and winter polar mesosphere over Andøya, Norway,","authors":[],"date":"1989","doi":"10.1029\/jd094id04p05199","raw":"Czechowsky, P., I. M. Reid, R. Ru ¨ster, and G. Schmidt (1989), VHF radar echoes observed in the summer and winter polar mesosphere over Andøya, Norway, J. Geophys. Res., 94, 5199–5217.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/11149.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35429\/1\/art_938.pdf","pdfHashValue":"4dd80bf58e66d4c2c757d48827de468a55fcf480","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35429<\/identifier><datestamp>\n      2018-01-24T03:07:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Could negative ion production explain the polar mesosphere winter echo (PMWE) modulation in active HF heating experiments?<\/dc:title><dc:creator>\n        Kero, A.<\/dc:creator><dc:creator>\n        Enell, C.-F.<\/dc:creator><dc:creator>\n        Kavanagh, A.J.<\/dc:creator><dc:creator>\n        Vierinen, J.<\/dc:creator><dc:creator>\n        Virtanen, I.<\/dc:creator><dc:creator>\n        Turunen, E.<\/dc:creator><dc:date>\n        2008-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35429\/1\/art_938.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2008GL035798<\/dc:relation><dc:identifier>\n        Kero, A. and Enell, C.-F. and Kavanagh, A.J. and Vierinen, J. and Virtanen, I. and Turunen, E. (2008) Could negative ion production explain the polar mesosphere winter echo (PMWE) modulation in active HF heating experiments? Geophysical Research Letters, 35. L23102. ISSN 0094-8276<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35429\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2008GL035798","http:\/\/eprints.lancs.ac.uk\/35429\/"],"year":2008,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Could negative ion production explain the polar mesosphere winter\necho (PMWE) modulation in active HF heating experiments?\nA. Kero,1 C.-F. Enell,1 A. J. Kavanagh,2 J. Vierinen,1 I. Virtanen,3 and E. Turunen1\nReceived 25 August 2008; revised 2 October 2008; accepted 6 October 2008; published 5 December 2008.\n[1] The mechanism behind the modulation of polar\nmesospheric winter echoes (PMWE) observed in active\nHF heating experiments is considered. We propose that\nnegative ion chemistry plays a role in the heater-induced\nmodulation of the PMWEs. In the mesosphere, an increased\nelectron temperature leads to a higher rate of electron to\nneutral attachment, and therefore to a decreased electron\ndensity. To a first-order approximation, scattering from\nBragg-scale gradients caused by turbulence can be\nconsidered to be proportional to the electron density\nsquared. Under this assumption, the electron density\nvariation calculated by the detailed Sodankyla¨ Ion\nChemistry model (SIC) predicts correctly both the\nmagnitude and the timescale of the modulation observed\nwith the EISCAT VHF radar. Citation: Kero, A., C.-F. Enell,\nA. J. Kavanagh, J. Vierinen, I. Virtanen, and E. Turunen (2008),\nCould negative ion production explain the polar mesosphere\nwinter echo (PMWE) modulation in active HF heating\nexperiments?, Geophys. Res. Lett., 35, L23102, doi:10.1029\/\n2008GL035798.\n1. Introduction\n[2] Coherent radar echoes from the mesosphere on both\nsummer and winter periods have become a familiar feature\nin radar data across a range of latitudes and operating\nfrequencies [e.g., Woodman and Guillen, 1974; Czechowsky\net al., 1979; Ecklund and Balsley, 1981; Karashtin et al.,\n1997; Ro¨ttger et al., 1988, 1990]. Over the years much\neffort has gone into understanding the underlying cause of\nthe so-called polar mesosphere summer echoes (PMSE)\n[Rapp and Lu¨bken, 2004], including direct stimulation of\nthe ionosphere with powerful high frequency (HF) heaters\n[e.g., Chilson et al., 2000; Belova et al., 2003]. Results of\ndedicated active experiments [Havnes et al., 2003] have\nconfirmed the established premise that PMSE relies on the\nexistence of charged aerosol particles in the cold summer\nmesosphere [von Zahn and Bremer, 1999; Lu¨bken et al.,\n2002; Havnes et al., 1996]. Careful modeling of the electron\ntemperature dependent charging of the aerosols explains the\nvariation in PMSE power during the heating experiments\n[e.g., Havnes, 2004].\n[3] As mentioned, strong radar returns from the meso-\nsphere are not confined to the polar latitudes. Therefore, the\ncommonly used concept of polar mesosphere winter echoes\n(PMWE) is actually a misnomer [e.g., Woodman and\nGuillen, 1974]. In the high latitudes, PMWE were first\nobserved in the 1980s in Alaska [Ecklund and Balsley,\n1981; Balsley et al., 1983] and Norway [Czechowsky et al.,\n1989]. In each case the mechanism for generating the scatter\nwas determined to be turbulence from breaking gravity\nwaves. PMWE occur at a lower altitude than PMSE (50\nto 80 km) [Kirkwood et al., 2002] and against a background\nof elevated electron density such as during solar proton\nevents [e.g., Collis et al., 1992].\n[4] Measurements with lidar and radar [Stebel et al.,\n2004] have raised questions over the assumption that\naerosol particles in the winter hemisphere are too small\nand too few to influence the radar echoes. As a result for an\nextensive rocket campaign, Lu¨bken et al. [2006] concluded\nthat characteristics of PMWE can be fully explained by the\nturbulence alone, without aerosols involved. On the other\nhand, recent rocket and radar observations show clear\nevidence for nanometer scale particles throughout the polar\nwinter mesosphere [Strelnikova et al., 2007; Rapp et al.,\n2008] and hence, the possible role of these particles in the\nPMWE formation should be reconsidered.\n[5] Moreover, a competing explanation over the cause of\nPMWE has been proposed by Kirkwood et al. [2006].\nAccording to this idea, here referred as viscosity wave\ntheory, the PMWE is caused by scattering from evanescent\nion-acoustic waves, i.e., viscosity waves, which are gener-\nated by partial reflection of infrasonic waves. Kirkwood\n[2007] presents two observational contradictions to the\ntraditional turbulence theory, which could be qualitatively\nexplained by the viscosity wave theory. Firstly, a detailed\nanalysis of ESRAD 52 MHz interferometric radar data has\nshown horizontal velocities of a few hundred meters per\nsecond within the PMWE [Kirkwood et al., 2006].\nSecondly, by using a typical PMWE observation by the\nEISCAT VHF radar, Kirkwood [2007] demonstrates that the\nwidth of the backscattered spectrum inside the PMWE is\nequal to the values above and below the layer.\n[6] The latter argument has been recently questioned by\ninvestigating directly the measured autocorrelation function\n(ACF), instead of spectra determined as its Fourier trans-\nformation. By using the spectral characterization method by\nJackel [2000], based on a fitting of a generalized exponen-\ntial function into the detected ACF, Lu¨bken et al. [2007]\nshow that the spectral shape of the PMWE is, in their case,\nclose to Gaussian and the spectrum above the echo is of\nLorentzian shape. This supports strongly the turbulence\ninterpretation of the PMWE.\n[7] Since HF heating of the ionosphere has proved to be\nan important diagnostic technique for PMSE, it has recently\nbeen applied to PMWE as well. Kavanagh et al. [2006]\nGEOPHYSICAL RESEARCH LETTERS, VOL. 35, L23102, doi:10.1029\/2008GL035798, 2008\nClick\nHere\nfor\nFull\nArticle\n1Sodankyla¨ Geophysical Observatory, University of Oulu, Sodankyla¨,\nFinland.\n2Department of Communication Systems, Lancaster University,\nLancaster, UK.\n3Department of Physical Sciences, University of Oulu, Oulu, Finland.\nCopyright 2008 by the American Geophysical Union.\n0094-8276\/08\/2008GL035798$05.00\nL23102 1 of 4\nmade the first observations of PMWE being modulated by\nhigh-power heating; their results demonstrated a distinct\neffect, similar to the results of Chilson et al. [2000] for\nPMSE. Epoch analysis of a short period heating cycle\n(10 seconds on and off) showed evidence of a recovery in\nthe PMWE during heater-on. In PMSE experiments this was\ntaken as evidence for the presence of charged aerosols\n[Havnes et al., 2003]; however the experiment performed\nby Kavanagh et al. [2006] was not optimized for determin-\ning this. Belova et al. [2008] attempted to repeat the\nexperiment of Havnes et al. [2003] for PMWE. They\nconcluded that a so-called overshoot effect, i.e., a sudden\nincrease of the echo power above the original level after the\nheater was turned off, was present, perhaps indicating the\npresence of very small dust particles. However, they ac-\nknowledged the need for better statistics before drawing\nfirm conclusions.\n[8] In this paper we present one EISCAT VHF incoherent\nscatter radar (224 MHz) observation of PMWE modulation\ninduced by the EISCAT Heating facility. We interpret the\ncharacteristics of the data in terms of mesospheric ion\nchemistry using the Sodankyla¨ Ion Chemistry (SIC) model.\nWe suggest an electron temperature dependent negative ion\nproduction as a possible mechanism participating to the\nheating-induced PMWE modulation.\n2. Data\n[9] In November 2006, a set of EISCAT heating experi-\nments were carried out dedicated to detect the D-region\nheating effect by using newly designed methods for the\nVHF radar [Kero et al., 2008]. In this study we focus on the\nfirst of the six data examples (Figure 1a). In this particular\ncase, the overall heating signature in the incoherent scatter,\nabove the altitudes of a strong PMWE, was the weakest of\nall 6 data examples. In contrast, the backscattered power\nfrom the PMWE modulated clearly along the heating cycle\n(Figure 1c). In order to characterize the origin of the\nbackscatter in different heights, we adopted the method\npresented by Jackel [2000]. A generalized exponential\nfunction of form a(t) = A exp (iBt\u0001(Ct)n) was fitted to\nthe detected ACF by using A, B, C and n as free parameters.\nIn particular, at the altitude of the PMWE, the n-parameter\nwas found to be close to 2 (n = 1.91 ± 0.09), which indicates\na Gaussian spectral shape. This confirms the result by\nLu¨bken et al. [2007] indicating that the PMWE is caused\nby scattering from turbulence. Above the PMWE, the\nn-parameter decays close to unity (n = 1.06 ± 0.08 at 80 km),\nwhich corresponds to Lorentzian shaped spectrum of inco-\nherent scattering. In fact, the n-parameter stays consistently\nabove 1 throughout the D-region altitudes, which according\nto diagnostics proposed by Rapp et al. [2007], may indicate\nan absence of dust particles in our case.\n[10] The super-imposed epoch analysis (SEA) shown in\nFigure 2 reveals the characteristic PMWE response to the\nHF heating. In this approach, the PMWE power was divided\nin super-imposed sequences according to the 6 second on\/\noff heating cycles. In order to obtain the relative PMWE\npower change during the cycles, each sequence was nor-\nmalized by the PMWE power corresponding to the end of\nthe current and previous cycle (mean value of the first and\nthe last column in Figure 2). Distributions of the SEA\nFigure 1. (a) Backscattered power detected by the\nEISCAT VHF radar 24 November 2006. Horizontal solid\nlines represent the PMWE altitude range (63–66 km).\n(b) Theoretical incoherent scatter power (dashed line) based\non the SIC modeled electron density profile (solid line)\nversus observed backscatter power (dots). (c) Mean PMWE\nstrength for each of the 6 second heater on\/off periods.\n(d) SIC modeled electron density response to 6 second on\/\noff heating. In this case, Te = 5Tn during the on period.\nFigure 2. Superimposed Epoch Analysis (SEA) of the\nPMWE strength and SIC modeled change of Ne\n2. The\ndistributions of the 77 superimposed PMWE strength\nestimates are illustrated as vertical gray scale histograms.\nThe error bars represent the limits of the 50 percent\ncentermost SEA estimates. The solid lines show the SIC\nmodeled Ne\n2 response to the 6 second on\/off heating\ncorresponding to electron-neutral temperature ratios of 5\n(upper line), 10 (middle) and 30 (lower) during the on\nperiod.\nL23102 KERO ET AL.: PMWE MODULATION DUE TO NEGATIVE IONS? L23102\n2 of 4\nestimates along the heating cycle are illustrated in Figure 2 as\nvertical gray scale histograms. In addition, error bars show\nthe limits of 50% centermost points in the distributions.\n[11] The analysis shows that the PMWE strength is\nreduced approximately to half the background level after\nthe heater is turned on, and when turned off, the echo power\nrecovers to the original level. Both these transitions take\napproximately two seconds, which are several orders of\nmagnitude longer timescales than typical transition times in\nthe PMSE modulation [Belova et al., 2003]. Moreover,\nneither an overshoot effect after the heater is turned off,\nnor a recovery during the heater-on period was found in the\nanalysis. The absence of these characteristics, typically\nassociated with the PMSE modulation, may be due to the\n6 seconds on\/off modulation used in the experiment being\ntoo fast. The chosen modulation provides, however, a\nrelatively good statistical sample of SEA estimates, and\ntherefore reveals clearly the characteristics of the PMWE\nmodulation.\n3. Model\n[12] The electron density response to the HF heating was\nparameterized by Kero et al. [2008] by using the Sodankyla¨\nIon Chemistry model (SIC) [Verronen, 2006] extended\nversion 7.2 which solves the concentrations of 36 positive\nions, 29 negative ions and 15 minor neutrals via 339\nreactions [Enell et al., 2005]. It should be noted that the\nnegative ion chemistry of the SIC 7.2 is updated to include a\nrevision according to Kazil et al. [2003]. Before the param-\netrization of the chemistry response to the heating, the\nmodel was preconditioned to reproduce the EISCAT VHF\nbackground power profile (see Figure 1b) by introducing\nsolar radiation [Tobiska et al., 2000] and an adjusted\nelectron precipitation as ionization sources.\n[13] Here, the chemical response to the 6 second on\/off\nheating at the PMWE altitude is studied for the electron\ntemperatures Te increased during the heater-on periods by\na factor of 5, 10 and 30 above the neutral temperature Tn\nof 240 K (MSISE-90 model) [Hedin, 1991]. The SIC\nmodel predicts that the electron temperature increase leads\nto a higher electron attachment rate, i.e., production of\nnegative ions, and therefore to a loss of free electrons\n(see Figure 1d). The electron density reduction reaches its\nsaturation point during the heater-on period, and recovers\nto the background state during the off period, in time-\nscales of few seconds.\n[14] Table 1 lists the most important reactions responsible\nfor the electron density modulation. The primary negative\nion O2\n\u0001 is produced via the electron temperature dependent\nattachment process (a). The following reactions in the chain\n(b, c and d) transfer O2\n\u0001 ions effectively into CO4\n\u0001 and CO3\n\u0001.\nIn the end of the heating period only 32 percent of the\nelectron density decrease is due to O2\n\u0001, while CO4\n\u0001 and CO3\n\u0001\ncorrespond to 22 and 46 percents respectively. The loss\nreaction chain (e and f) leads to saturation during the heater-\non period, and recovery when the heater is turned off. Under\nthe assumption that the backscattered power from the\nPMWE is proportional to the electron density squared\n[Lu¨bken et al., 2006], the modeled response, i.e., the relative\nchange of Ne\n2, can be compared to the observed PMWE\nmodulation. In Figure 2, the modeled curves correspond to\nthe heating factors of 5, 10 and 30.\n4. Discussion\n[15] Figure 2 shows that the electron temperature depen-\ndent negative ion chemistry offers a potential explanation\nfor the HF heating induced PMWE modulation with rea-\nsonable electron heating factors. Besides the magnitude, the\ntimescale of the modeled PMWE response matches the\nobserved one well. The model predicts only a slightly\nslower PMWE response compared to the median behavior\nof the superimposed PMWE observations. This small dif-\nference, however, can be due to uncertainties in the model\npreconditioning (see Figure 1b) which has an effect on the\ncharacteristic electron density response. Note that the model\nis not re-adjusted to match the data for this particular\napplication. The chemistry parametrization presented in this\npaper is the same as shown by Kero et al. [2008], where the\neffect of the heating dependent chemistry on the incoherent\nscatter spectrum was studied.\n[16] The critical assumption that the PMWE power is\nproportional to the electron density squared, must be\nregarded as a first order approximation of the true turbu-\nlence scattering response to the heating. Appendix A of\nRapp et al. [2008] shows in details the derivation of the\nturbulence scattering cross section for stationary conditions,\nwhere the production of small scale gradients by turbulence\nis balanced by the diffusion. A challenge for the work in\nfuture would be to develop a time-dependent model de-\nscribing the turbulence scattering in non-stationary condi-\ntions, where the electron temperature changes both the\nchemistry and the diffusion of the plasma. Moreover, the\nchemistry scheme should be upgraded to include the re-\ncently observed charged dust particles in order to quantify\ntheir contribution to the PMWE modulation.\n5. Conclusions\n[17] The electron temperature dependent negative ion\nchemistry offers a potential explanation for the observed\nPMWE modulation shown in Figure 2, assumed that the\necho power is proportional to the electron density squared.\nThe ion chemistry, which is responsible for most of the\nelectron density changes in the model, follows the reaction\nchain listed in Table 1. Besides the need of further PMWE\nobservations during heating experiments, a non-stationary\ntheory for the turbulence backscattering should be devel-\noped for more realistic diagnostics of the heating induced\nPMWE modulation. This work indicates that the D-region\nTable 1. List of the Prominent Reactions Causing the Heating-\nInduced Electron Density Modulation in SIC 7.2a\nReaction Rate Coefficient\na) 2O2+ e ! O2\u0001 + O2 4 \u0003 10\u000130 \u0003 exp (\u0001193\/Te)\nb) O2\n\u0001 + O2+ M ! O4\u0001 + M 3.4 \u0003 10\u000131\nc) O4\n\u0001 + CO2 ! CO4\u0001 + O2 4.3 \u0003 10\u000110\nd) CO4\n\u0001 + O ! CO3\u0001 + O2 1.4 \u0003 10\u000110\ne) CO3\n\u0001 + O ! O2\u0001 + CO2 1.1 \u0003 10\u000110\nf) O2\n\u0001 + O2(\n1Dg) ! 2O2+ e 2 \u0003 10\u000110\naFollowing the original scheme of Turunen et al. [1996]. The unit of the\nrate coefficient for the three-body reactions a) and b) is cm6s\u00011 and for the\nrest it is cm3s\u00011. The electron temperature Te is given in Kelvins.\nL23102 KERO ET AL.: PMWE MODULATION DUE TO NEGATIVE IONS? L23102\n3 of 4\nnegative ion chemistry should be taken into account in this\napproach.\n[18] Acknowledgments. The main author’s work is funded by the\nAcademy of Finland research project 123275, THERMES. Juha Vierinen is\nfunded by the Academy of Finland (application 213476, Finnish\nProgramme for Centres of Excellence in Research 2006-2011). Carl-Fredrik\nEnell is funded by the Academy of Finland through project 109054, Solar\nEnergetic Radiation and Chemical Aeronomy of the Mesosphere. Ilkka\nVirtanen is funded by the Finnish Graduate School in Astronomy and Space\nPhysics. A. J. Kavanagh was supported by the LAPBIAT2 program\n(contract RITA-CT-2006-025969). The EISCAT measurements were made\nwith special programme time granted for Finland. EISCAT is an interna-\ntional assosiation supported by China (CRIRP), Finland (SA), Germany\n(DFG), Japan (STEL and NIPR), Norway (NFR), Sweden (VR) and United\nKingdom (STFC).\nReferences\nBalsley, B. B., W. L. Ecklund, and D. C. Fritts (1983), VHF echoes from\nthe high-latitude mesosphere and lower thermosphere, observations and\ninterpretations, J. Atmos. Sci., 40, 2451–2466.\nBelova, E., P. B. Chilson, S. Kirkwood, and M. T. Rietveld (2003), Re-\nsponse time of PMSE to ionospheric heating, J. Geophys. Res., 108(D8),\n8446, doi:10.1029\/2002JD002385.\nBelova, E., M. Smirnova, M. T. Rietveld, B. Isham, S. Kirkwood, and\nT. Sergienko (2008), First observation of the overshoot effect for polar\nmesosphere winter echoes during radiowave electron temperature mod-\nulation, Geophys. Res. Lett., 35, L03110, doi:10.1029\/2007GL032457.\nChilson, P. B., E. Belova, M. T. Rietveld, S. Kirkwood, and U.-P. Hoppe\n(2000), First artificially induced modulation of PMSE using the EISCAT\nheating facility, Geophys. Res. Lett., 27, 3801–3804.\nCollis, P. N., M. T. Rietveld, J. Ro¨ttger, and W. K. Hocking (1992),\nTurbulence scattering layers in the middle-mesosphere observed by the\nEISCAT 224-MHz radar, Radio Sci., 27, 97–107.\nCzechowsky, P., R. Ru¨ster, and G. Schmidt (1979), Variations of meso-\nspheric structures in different seasons, Geophys. Res. Lett., 6, 459–462.\nCzechowsky, P., I. M. Reid, R. Ru¨ster, and G. Schmidt (1989), VHF radar\nechoes observed in the summer and winter polar mesosphere over An-\ndøya, Norway, J. Geophys. Res., 94, 5199–5217.\nEcklund, W. L., and B. B. Balsley (1981), Long-term observations of the\nArctic mesosphere with the MST radar at Poker Flat, Alaska, J. Geophys.\nRes., 86, 7775–7780.\nEnell, C.-F., A. Kero, E. Turunen, T. Ulich, P. T. Verronen, A. Seppa¨la¨,\nS. Marple, F. Honary, and A. Senior (2005), Effects of D-region RF\nheating studied with the Sodankyla¨ Ion Chemistry model, Ann. Geophys.,\n23, 1575–1583.\nHavnes, O. (2004), Polar Mesospheric Summer Echoes (PMSE) overshoot\neffect due to cycling of artificial electron heating, J. Geophys. Res., 109,\nA02309, doi:10.1029\/2003JA010159.\nHavnes, O., J. Trøim, T. Blix, W. Mortensen, L. I. Næsheim, E. Thrane, and\nT. Tønnesen (1996), First detection of charged dust particles in the\nEarth’s mesosphere, J. Geophys. Res., 101, 10,839–10,847.\nHavnes, O., C. La Hoz, L. I. Næsheim, and M. T. Rietveld (2003), First\nobservations of the PMSE overshoot effect and its use for investigating\nthe conditions in the summer mesosphere Geophys, Geophys. Res. Lett.,\n30(23), 2229, doi:10.1029\/2003GL018429.\nHedin, A. E. (1991), Extension of the MSIS thermosphere model into the\nmiddle and lower atmosphere, J. Geophys. Res., 96, 1159–1172.\nJackel, B. J. (2000), Characterization of auroral radar power spectra and\nautocorrelation functions, Radio Sci., 35, 1009–1023.\nKarashtin, A. N., Y. V. Shlyugaev, V. I. Abramov, I. F. Belov, I. V. Berezin,\nV. V. Bychkov, E. B. Eryshev, and G. P. Komrakov (1997), First HF radar\nmeasurements of summer mesopause echoes at SURA, Ann. Geophys.,\n15, 935–941.\nKavanagh, A. J., F. Honary, M. T. Rietveld, and A. Senior (2006), First\nobservations of the artificial modulation of polar mesospheric winter\nechoes, Geophys. Res. Lett., 33, L19801, doi:10.1029\/2006GL027565.\nKazil, J., E. Kopp, S. Chabrillat, and J. Bishop (2003), The University of\nBern Atmospheric Ion Model: Time-dependent modeling of the ions in\nthe mesosphere and lower thermosphere, J. Geophys. Res., 108(D14),\n4432, doi:10.1029\/2002JD003024.\nKero, A., J. Vierinen, C.-F. Enell, I. Virtanen, and E. Turunen (2008), New\nincoherent scatter diagnostic methods for the heated D-region ionosphere,\nAnn. Geophys., 26, 2273–2279.\nKirkwood, S. (2007), Polar mesosphere winter echoes—A review of recent\nresults, Adv. Space Res., 40, 751–757.\nKirkwood, S., V. Barabash, E. Belova, H. Nilsson, T. N. Rao, K. Stebel,\nA. Osepian, and P. B. Chilson (2002), Polar mesosphere winter echoes\nduring solar proton events, Adv. Polar Upper Atmos. Res., 16, 111–125.\nKirkwood, S., P. Chilson, E. Belova, P. Dalin, I. Ha¨ggstro¨m, M. Rietveld,\nand W. Singer (2006), Infrasound—The cause of strong polar mesosphere\nwinter echoes?, Ann. Geophys., 24, 475–491.\nLu¨bken, F., M. Rapp, and P. Hoffmann (2002), Neutral air turbulence and\ntemperatures in the vicinity of polar mesosphere summer echoes, J. Geo-\nphys. Res., 107(D15), 4273, doi:10.1029\/2001JD000915.\nLu¨bken, F.-J., B. Strelnikov, M. Rapp, W. Singer, R. Latteck, A. Brattli,\nU.-P. Hoppe, and M. Friedrich (2006), The thermal and dynamical state\nof the atmosphere during polar mesosphere winter echoes, Atmos. Chem.\nPhys., 6, 13–24.\nLu¨bken, F., W. Singer, R. Latteck, and I. Strelnikova (2007), Radar mea-\nsurements of turbulence, electron densities, and absolute reflectivities\nduring polar mesosphere winter echoes (PMWE), Adv. Space Res., 40,\n758–764.\nRapp, M., and F.-J. Lu¨bken (2004), Polar mesosphere summer echoes\n(PMSE): Review of observations and current understanding, Atmos.\nChem. Phys., 4, 2601–2633.\nRapp, M., I. Strelnikova, and J. Gumbel (2007), Meteoric smoke particles:\nEvidence from rocket and radar techniques, Adv. Space Res., 40,\n809–817.\nRapp, M., I. Strelnikova, R. Latteck, P. Hoffmann, U.-P. Hoppe,\nI. Ha¨ggstro¨m, and M. T. Rietveld (2008), Polar mesosphere summer\nechoes (PMSE) studied at Bragg wavelengths of 2.8 m, 67 cm, and 16\ncm, J. Atmos. Sol. Terr. Phys., 70, 947–961.\nRo¨ttger, J., C. La Hoz, M. C. Kelley, U.-P. Hoppe, and C. Hall (1988), The\nstructure and dynamics of polar mesosphere summer echoes observed\nwith the EISCAT 224 MHz radar, Geophys. Res. Lett., 15, 1353–1356.\nRo¨ttger, J., M. T. Rietveld, C. La Hoz, T. Hall, M. C. Kelley, and W. E.\nSwartz (1990), Polar mesosphere summer echoes observed with the\nEISCAT 933-MHz radar and the CUPRI 46.9-MHz radar, their similarity\nto 224-MHz radar echoes, and their relation to turbulence and electron\ndensity profiles, Radio Sci., 25, 671–687.\nStebel, K., U. Blum, K.-H. Fricke, S. Kirkwood, N. Mitchell, and\nA. Osepian (2004), Joint radar\/lidar observations of possible aerosol\nlayers in the winter mesosphere, J. Atmos. Sol. Terr. Phys., 66, 957–970.\nStrelnikova, I., M. Rapp, S. Raizada, and M. Sulzer (2007), Meteor smoke\nparticle properties derived from Arecibo incoherent scatter radar observa-\ntions, Geophys. Res. Lett., 34, L15815, doi:10.1029\/2007GL030635.\nTobiska, W., T. Woods, F. Eparvier, R. Viereck, L. Floyd, D. Bouwer,\nG. Rottman, and O. White (2000), The SOLAR2000 empirical solar\nirradiance model and forecast tool, J. Atmos. Sol. Terr. Phys., 62,\n1233–1250.\nTurunen, E., H. Matveinen, J. Tolvanen, and H. Ranta (1996), D-Region\nion chemistry model, in STEP Handbook of Ionospheric Models, edited\nby R. W. Schunk, pp. 1–25, Sci. Comm. on Sol. Terr. Phys., Boulder,\nColo.\nVerronen, P. T. (2006), Ionosphere-atmosphere interaction during solar pro-\nton events, Ph.D. thesis, Finn. Meteorol. Inst., Helsinki.\nvon Zahn, U., and J. Bremer (1999), Simultaneous and common-volume\nobservations of noctilucent clouds and polar mesosphere summer echoes,\nGeophys. Res. Lett., 26, 1521–1524.\nWoodman, R. F., and A. Guillen (1974), Radar observations of winds\nand turbulence in the stratosphere and mesosphere, J. Atmos. Sci., 31,\n493–505.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nC.-F. Enell, A. Kero, E. Turunen, and J. Vierinen, Sodankyla¨ Geophysical\nObservatory, University of Oulu, Ta¨htela¨ntie 62, FIN-99600 Sodankyla¨,\nFinland. (antti.kero@sgo.fi)\nA. J. Kavanagh, Department of Communication Systems, Lancaster\nUniversity, Infolab 21, Lancaster LA1 4YW, UK.\nI. Virtanen, Department of Physical Sciences, University of Oulu, P.O.\nBox 3000, FIN-90014 Oulu, Finland.\nL23102 KERO ET AL.: PMWE MODULATION DUE TO NEGATIVE IONS? L23102\n4 of 4\n"}