{"doi":"10.1080\/0968776030110208","coreId":"6280","oai":"oai:generic.eprints.org:408\/core5","identifiers":["oai:generic.eprints.org:408\/core5","10.1080\/0968776030110208"],"title":"Reviews","authors":["Barker, Philip","Knight, John","McAleese, Ray","Barker, Philip"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"Eta De Cicco, Mike Farmer and James Hargrave, Using the Internet in Secondary Schools, London: Kogan Page (2nd edn), 2001. ISBN: 0–7494–3459–7. Softback, x + 192 pages, £16.99","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6280.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/408\/1\/ALT_J_Vol11_No2_2003_Reviews.pdf","pdfHashValue":"6c4b6faec322b7e744215f676a81242a0aac4185","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:408<\/identifier><datestamp>\n      2011-04-04T09:09:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/408\/<\/dc:relation><dc:title>\n        Reviews<\/dc:title><dc:creator>\n        Barker, Philip<\/dc:creator><dc:creator>\n        Knight, John<\/dc:creator><dc:creator>\n        McAleese, Ray<\/dc:creator><dc:creator>\n        Barker, Philip<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Eta De Cicco, Mike Farmer and James Hargrave, Using the Internet in Secondary Schools, London: Kogan Page (2nd edn), 2001. ISBN: 0–7494–3459–7. Softback, x + 192 pages, £16.99.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/408\/1\/ALT_J_Vol11_No2_2003_Reviews.pdf<\/dc:identifier><dc:identifier>\n          Barker, Philip and Knight, John and McAleese, Ray and Barker, Philip  (2003) Reviews.  Association for Learning Technology Journal, 11 (2).  pp. 67-72.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776030110208<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/408\/","10.1080\/0968776030110208"],"year":2003,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Reviews\nedited by Philip Barker\nEta De Cicco, Mike Farmer and James Hargrave,\nUsing the Internet in Secondary Schools, London:\nKogan Page (2nd edn), 2001. ISBN: 0-7494-\n3459-7. Softback, x + 192 pages, £16.99.\nThe Internet and its many aspects, including the\nuse of the increasingly media-rich World Wide\nWeb and online communication tools is becoming\nincreasingly central to teaching and learning\nacross the whole educational spectrum. Neverthe-\nless, despite directives such as the National Grid\nfor Learning, which has led to near universal, if\nstill uneven, provision of Internet-enabled techno-\nlogy in schools, and (not always entirely success-\nful) teacher development initiatives such as those\nprovided by NOF (New Opportunities Funding)\nfunded training programmes, effective exploit-\nation of the Internet (and ICT in general) remains\na problematic issue in much of our compulsory\neducation system. Of all the things that com-\nputers do effectively, it seems, one of the things\nthey continue to do best is to make teachers feel\nuncomfortable and inadequate . . . As such, there\ncontinues to be a need for readily available and\naccessible resources that offer support for those\nwho lack confidence in the use of ICT. This\nsecond edition of the book sets out to do precisely\nthis, updating the original 1998 edition (which\nwas reviewed in ALT-J, 8 (3), 109-10) to encom-\npass recent technological developments and\nchanges to the National Curriculum and offer a\n'practical, down-to-earth and straightforward\nguide' to using the Internet in secondary schools.\nThe book is divided into two main sections:\n'Using the Internet in Schools' and 'Curriculum\nActivities'. The first focuses predominantly on\nthe Internet as a source of information and\nresources, a publishing tool and a means of\nsupporting communication and collaborative\nworking practices. The second focuses on the use\nof the Internet in the curriculum and provides\nbrief but useful introductions to the use of the\nInternet in teaching a broad range of curriculum\nareas along with a number of suggested\nactivities and lessons for each.\nThe first section is divided into four chapters,\neach following a common format of discussion,\nexamples and links to useful online resources.\nChapter 1 offers basic tips on using the Internet\nand covers Web browsers (with specific focus on\nInternet Explorer and Netscape), explanations\nof the various components of URLs, or Web\naddresses, 'bookmarking' and 'favourites',\ndownloading files from the Web and a discussion\nof online safety issues. Common to the rest of\nthe book is the friendly, informal tone used to\ndiscuss technical issues and the accessible\nexplanations of Internet jargon and terminology.\nUseful suggestions for using the Web are\nprovided throughout along with screen shots to\nillustrate more difficult concepts. A minor\ncriticism, however, is that some of the areas dealt\nwith, such as creating and managing 'book-\nmarks', may have benefited from a more detailed\ndescription of the procedures involved.\nChapter 2 concentrates on using the Web in\nschools and offers an introduction to school\nnetworks, and issues related to connecting to the\nInternet, including broadband, and the\n67\nReviews\ndevelopment of school websites. The section on\nnetworks is necessarily brief but should serve to\nprovide teachers with a basic grasp of the\ntechnology and terminology involved. An\nintroduction to HTML and Web authoring are\nincluded, along with sensible though passing\nreference to the use of graphics and other design\nfeatures. Important issues relating to the\nmotivational and empowering aspects of getting\nchildren to publish their own work on the Web\nare also mentioned. While this book in no way\npurports to offer a comprehensive guide to web-\nsite development, it does provide pointers to\nonline resources for those who wish to take this\nsubject further.\nChapter 3, which deals with common internet\nfacilities, concentrates on effective use of search\nengines and a wide range of Internet-related\ntechnologies, including common file formats,\nplug-ins (or browser add-on programs) and\nprograms for handling a range of media types\nand file-compression programs and techniques.\nOf the many skills teachers need to develop in\norder to exploit the Web, effective searching\ntechniques are perhaps the most important and\nconsiderable space is devoted to this subject.\nMethods for narrowing searches using Boolean\noperators are given alongside useful strategies\nfor developing useful search strings. It is\nsurprising, however, that no mention is given to\nthe use of inverted commas to allow searches on\nphrases. The chapter provides a veritable raft of\npointers to search-engine resources, including\nsubject directories and meta search-engines as\nwell as those specific to the UK, although I do\nfeel that more attention could have been given to\nthe need to evaluate Web-based resources for\nvalidity and reliability.\nThe focus of Chapter 4 is on communicating and\nlearning via the Internet and particular emphasis\nis given to tools that support collaborative\nworking practices, such as e-mail, mailing lists\nand online conferencing software. The section\non mailing lists is of particular use to teachers\nwishing to exchange views and ideas with others\nwithin a community of practice, and links are\ngiven to important resources such as the NGfL\nVirtual Teacher Centre and JlSCmail. Tools\nsuch as these continue to be underused by\nteachers and the authors are to be commended\nfor drawing attention to them. Opportunities for\ndeveloping collaborative learning between pupils\nin different schools (and countries!) via e-mail\nexchange programmes and videoconferencing\nare also discussed, although more attention\n68\ncould have been given to strategies for managing\nsuch projects.\nSection Two of the book consists of intro-\nductions to and examples of using the Internet\nto support the teaching of Mathematics,\nEnglish, Science, Citizenship, Geography,\nHistory, Design and Technology, Modern\nForeign Languages, Music, RE and Art and\nDesign. These have been revised since the 1998\nversions and tied into specific areas of the\nNational Curriculum for Key Stages 3 and 4.\nKey Stage 3 activities have also been linked into\nDfES Schemes of Work. Learning outcomes are\nclearly stated and brief but useful notes are\nprovided to enable teachers to adapt and plan\nthe activities for use with their own classes. A\nuseful addition to this section would perhaps\nhave been comments and advice from teachers\nwho had used the lesson suggestions outlined in\nthe original edition, but the current selection\ndoes seem sound and usable.\nOverall, this book is a useful introductory\nresource for teachers wishing to improve their\nunderstanding and use of the Internet for\nteaching. The language throughout is accessible\nand terminology is explained in clear and readily\nunderstandable terms. Although the treatment\nthat is given to some aspects of the Internet is\nnecessarily brief, explanations and discussions\nare always supported with links and pointers to\nappropriate online resources for those who wish\nto take things further. The first section of the\nbook will be of most use to those teachers with\nlittle or no knowledge of the area, although it is\nlikely that many old hands will also learn some\nnew tricks! The second, curriculum-based,\nsection will surely be of use to all teachers\ninterested in using the Internet in their teaching\nand provides an excellent foundation on which\nto build. As a final note, the nature of\ntechnological innovation is such that any book\non the subject is almost certain to be slightly out\nof date by the time it is published. As such, it\nwould have been useful to have allied this\npublication with an online resource of its own\nthat could have been maintained and updated\nmore readily. Nevertheless, this is a useful paper-\nbased introduction to the area of using the\nInternet to support teaching in secondary\nschools.\nJohn Knight\nOxford Brookes University\nAlt-J Volume 11 Number 2\nS. Ketteridge, S. Marshall and H. Fry, The\nEffective Academic - A Handbook for Enhanced\nAcademic Practice, London: Kogan Page, 2002.\nISBN 0-7494-3570-4. Softback, xi+292, pages,\n£19.99.\nIt has been a turbulent twenty-year period. In\nthe early 1980s I was promoted to a senior\nlectureship in education at an ancient Scottish\nuniversity. I ran an annual course in University\nTeaching Methods for new staff and contributed\nto some postgraduate teaching on an M.Ed. I\nhad learned my trade as an observant apprentice\nsurrounded by silent journeymen. Then things\nbegan to change. The death of the quinquennial\nreview, the reduction in grant funding from the\nUGC and the transmogrification of the\nacademic life and practice - as we knew it at that\ntime - had begun to take form. I had a sense of\nthis cataclysm at the time, in the rush to set up\nappraisal of academic staff and training for\nappraisers.\nIn this excellent book, the editors and con-\ntributors tell the reader of the new reality of\nacademic practice. The new reality is that we\npractise our trade in a billion-pound inter-\nnational business. We are charged with creating\nwealth for the higher education sector and we\noperate at a 'digital chalk face'. The harsh reality\nis that academic competence is a professional\nrequirement that at best is an aspirational\nobjective rather than an achieved state. So what\nhave the editors and contributors to this book\nattempted to do in order to prepare us better for\nour new roles?\nIn fifteen chapters they provide a romp through\nthe issues that confront the potentially com-\npetent academic. To do this they start with a\nreview of the 'turbulent environment' that we\nchoose to work in. While they do not tell us all\nthat has happened in twenty years, the\ncontributors identify the 'academic Munros'.1 In\nfact the book describes the key features of what\nthe keen academic needs to be able to\nunderstand and do in order to survive the chilly\nwinds of the academic terrain. So much for a\nsetting - what about the content? In envisaging\nthis book, the editors took a risk in using\nacademic narrative to carry their message. Some\nfifty contributors tell stories about the student\nexperience, learning from quality assurance,\nharnessing C&IT (computing and information\ntechnology) and for learning and developing a\nstrategic culture for research. The level of\ndiscourse is aimed at the experienced academic\nwho is about to apply for ILT (Institute for\nLearning and Teaching) membership. It assumes\nan intrinsic interest in, and an awareness of, the\nhigher education system and how to make the\nmost of opportunities for learners and teachers\nalike. When confronted with a request such as\n'Please comment on the range of ways in which\nyou contribute to making the learning\nenvironment effective for learners . . .', ILT\napplicants need not only to reflect on their own\npractice, but on the academic landscape they\nwork in.\nThe contributors do not take prisoners. They tell\nthe story as it seems to them. Alan Hurst (from\nthe University of Central Lancashire), writing\nabout 'students with disabilities', concludes that\n'institutions will . . . also have to ensure that\nthese students are not treated less favourably\nthan others, and that \"reasonable adjustments\"\nhave been made, including \"adjustments\" to the\ncurriculum . . . institutions need to start looking\naf course provision . . . and ensure that they are\naccessible and inclusive . . .' Ranging from\ninstitutional review to CPD (continuing\nprofessional development) and the 'learning\norganization', the contributors to this book offer\npractical advice in a series of 'Enhancing\nPractice' key messages. In Chapter 4, Tom\nKennie (Sheffield Hallam University), writing\non strategic and operational planning, offers this\nmissive: 'Imagine you were invited into another\ndepartment which had recently won a national\nprize for its success in teaching and research . . .\nDuring your visit, what sort of evidence would\nindicate to you that the departmental planning\nprocess was of value . . .?' Does the approach\nwork? Yes, it does. Storytelling within an\nacademic narrative framework locates practice\nin a theoretical context. The chosen contributors\nhave a good sense of audience as they describe\nand evaluate our turbulent system effectively.\nThey draw out messages from the narrative that\nspeaks clearly to the intended reader.\nEach of the chapters has a focused bibliography\nand there is a helpful index (well done Kogan\nPage!). My professional criticism of the book is\nthat in Su White and Hugh Davis's otherwise\nexcellent chapter on 'Harnessing IT for\nLearning' (Chapter 13, pp. 232^16), the authors\ndo not really take on the principal tacit\nassumption in the great rush to make use of\nC&IT: 'Are the new learners capable of making\nthe most of C&IT-rich learning opportunities?'\nIn Chapter 3, 'The Student Experience', Rob\nShorrock also skips this issue. If I could add my\n69\nReviews\nreflective perspective, I would like to ask ILT\napplicants to reflect on the way we can help our\n'co-stakeholders' - the students - to start the\nprocess of personal development reflection. In\nthis turbulent system, we must not forget the\ncontribution the learners need to make in order\nto create personal and systems intellectual\nwealth. As 'co-stakeholders' we need a com-\npanion book called 'The Effective Learner'. One\ncontributor concludes his narrative by saying:\n'Keep hoping for the unexpected . . . and\nremember that the reason academics look young\nis because they keep on learning\nOf course there might be one criticism that I\nshould offer. In the pedagogic narrative\ntradition, the individual Writers have different\nperspectives and exhibit different views of their\nintended audience. This might irritate some, as\nthe chapters do not seem to hang together very\nwell. I am prepared to take these multiple\nperspectives as a case of 'different friends' that I\nmight phone to ask for advice. If I were in that\nawful television programme where I could\n'Phone a Friend', I would like there to be a\nfriendship network where I can get the best\nadvice - not just one assertive or opinionated\nadviser.\nLet's not be frightened about the present. Let's\nlearn from others. Buy this book and take it with\nyou in your rucksack as you 'bag your academic\nMunros!'\nRay McAleese\nUniversity of Aberdeen\nNote\n1. For the non-Scottish reader there are 284 hills\nin Scotland whose elevation is greater than 3,000\nfeet. They are known as 'Munros' after the\nauthor of an authoritative list. 'Munro-bagging'\nis a respectable pursuit for walkers and climbers\nof all ages.\nWilliam Bezanson, Performance Support Solu-\ntions - Achieving Business Goals through Enabling\nUser Performance, Victoria, BC: Trafford\nPublishing, 2002. ISBN: 1-55369-467-8.\nSoftback, xiii + 354 pages, $30.00.\nWe live in a world in which we are surrounded by\na vast array of sophisticated and complex\nobjects. How do these objects tell us what they\nare and what they can do? The problem is that,\nthe majority of them do not explicitly do this.\nTherefore, through the processes of early\n70\nlearning and lifelong development (through\nongoing learning, research and experimentation)\nwe acquire the 'working knowledge' that we need\nin order to recognize various classes of object\nand the behavioural characteristics that each\nclass exhibits. Of course, in an 'ideal' world, all\n'man-made' objects, systems, services and\nproducts would be so intuitive and obvious that\nnobody would need any training or instruction\nin order to understand what they do or how to\nuse them. Sadly, in this respect, we live in a world\nthat is far from ideal. Hence, the growing need\nfor 'performance support solutions' - and, of\ncourse, this new book.\nThe material in Bezanson's book is organized\ninto four main parts (labelled 'A', 'B', 'C and\n'D') that together contain a total of twelve\nchapters. There is also a set of six appendices\nand a reference section. In the first part of the\nbook (entitled 'Want Better Users?') the author\naddresses some of the background and\nintroductory issues upon which the remainder of\nhis material is based. Having covered the 'basics'\nin the first three chapters, in the second section\nof the book the author now turns his attention\nto the theme of 'making products obvious'. The\nunderlying 'message' contained in the three\nchapters that make up this part of the book\nrelates to the importance of 'performance-\ncentred design'. The three chapters that make up\nthe third part of the book cover the important\ntopics of 'marketing', 'performance architecture'\nand 'implementing performance support solu-\ntions', respectively. The fourth part of the book\nis devoted to a variety of 'advanced topics' such\nas 'configuration management', 'testing',\n'quality assurance' and the development of 'user\nsupport environments'. The six appendices that\nare included, taken together, provide a compre-\nhensive and detailed analysis (and discussion) of\nmaking a business case for using a performance\nsupport solution within an organization.\nAlthough the reference section is not com-\nprehensive, it serves to indicate the flavour of\nperformance support and the directions in which\nthis technology is now moving.\nIn the first part of the book (Part A), the author\ngives a good explanation of the rationale\nunderlying performance support (PS) and how\nthis important area has emerged and grown since\nthe early pioneering work of Gloria Gery and\nBarry Raybould in the 1980s. As a working\ndefinition, on page 18, Bezanson suggests that\nperformance support 'is an attribute of product\ndesign that enhances user and business\nAlt-J Volume 11 Number 2\nperformance through a working environment\nthat anticipates the user's goals and needs and\nhelps users achieve them conveniently and\neffectively'. The goal of PS is therefore 'devel-\noping products that enhance user performance\nwith these products' (p. 49). An important\nprinciple underlying the design of a performance\nsupport system (PSS) is that there should be an\n'integrated deployment of products and support'\n(p. 52). The support is therefore embedded\n(intrinsically) within the product - thereby\nreducing the need for any external form of help\n(such as an instructor, manual or short course).\nAs an illustration of such a PSS, just think of\nMicrosoft's Office 2002 products - which\nrepresent an example of a multi-functional,\nintegrated electronic performance support\nsystem.\nThe three chapters that make up the second part\nof the book (Part B) deal with performance-\ncentred systems, making products obvious and\ndeveloping performance support solutions,\nrespectively. As I mentioned earlier, the\nunderlying rationale for this part of the book is\nthe concept of performance-centred design\n(PCD). This is an approach to design in which\nperformance-enabling attributes are built into a\nproduct (or system) so that users do not need\nextrinsic or external forms of support such as\ntraining and\/or paper-based documentation.\nWithin this part of the book the author\nintroduces, describes and discusses Gloria Gery's\nnineteen characteristic attributes of a\nperformance-centred system and then deliber-\nates on how these should be deployed within the\ncontext of making a product easy and obvious\nto use - in other words, enabling users to\n'achieve business goals'. He illustrates his case\nwith recourse to the extensive experience that he\nhas had with his Palm Pilot personal digital\nassistant (PDA). The author goes on to suggest\nthat appropriate combinations of the nineteen\nperformance-centred attributes can be used to\nmake a product 'obvious'. He also recommends\nthat suitable auditing techniques should be used\nto assess the level to which any given product\nmeets this requirement (p. 108). Of course, as\nwell as designing and auditing systems for\n'obviousness' (and the presence of embedded\nPCD attributes), it is also necessary to be able to\ncreate performance support solutions\n('PSSolutions') that are based on sound PCD\npractice. This issue is addressed in some depth in\nChapter 6. Essentially, this chapter is devoted to\nintroducing and explaining the various stages\ninvolved in the author's proposed six-step\nPerformance Support Solution Design and\nDevelopment Process.\nIn Part C, the third section of the book, the\nauthor turns his attention to the various ways in\nwhich PSSolutions might be implemented. In\ntotal, about sixty different methods are\nidentified, described and discussed. His rationale\nfor describing so many discrete methods is\nsimply to allow organizations (that are not ready\nfor full performance support) to get started with\none or two small techniques and then to expand\nincrementally to an end vision of fully integrated\nperformance support. Indeed, such a scheme is\nthe essence of Bezanson's notion of 'perform-\nance support solutions'. As was mentioned\npreviously, the first chapter in this section is\ndevoted to the topic of marketing the concept of\nperformance support solutions within business\norganizations. Two important techniques that\nare described in this chapter are the use of\n'demonstrations' and 'prototyping'. These are\noften used for proof-of-concept purposes. How-\never, the author strongly advocates their use for\n'selling' PSSolutions to both clients and\ncolleagues. The next chapter in this section\ndiscusses a variety of ideas relating to the design\nof a 'performance architecture'. At sixty-two\npages, this is by far the longest chapter in the\nbook. Some of the important issues that are\ndiscussed include system architecture, per-\nformance-enhancing features, user-interaction\nmodels, knowledge management technologies\nand human performance technology. On page\n200 the author states that 'the biggest choice to\nmake for a PS information architecture is\nwhether to have the user support materials\nlocalised or networked'. Naturally, the use of the\nInternet and\/or in-house intranets figures prom-\ninently as an architectural component within\nthis chapter. Indeed, the author recommends:\n'Design a PSSolution architecture with a view to\ndistributing and dynamically updating user\nsupport materials. The Internet provides an\nobvious medium for this purpose, and should be\nconsidered seriously as part of the architecture'\n(p. 194). Within Chapter 9 (the third and final\nchapter in this part of the book) the author\npresents a number of different methods for\ntransforming the architectural and design ideas\n(presented in the previous two chapters) into\nconcrete implementations of PSSolutions.\nThe three chapters that comprise the last part of\nthe book (Part D) explore a number of different\nadvanced topics. For example, in Chapter 10, the\n71\nReviews\nauthor consolidates and reinforces many of the\nissues (that were only briefly introduced and\ndiscussed in earlier parts of the book) with more\nin-depth treatments. Chapter 11 then discusses\nthe problems of designing and building\nperformance systems to support multiple\napplications. In order to overcome these\nproblems the author introduces the concept of a\n'user support environment' (USE). According to\nthe author (p. 290), a USE is 'an open standard\nfor integrating a performance support system\nwith more than one application'. In order to\nfacilitate this approach, the author proposes an\narchitecture involving a 'PSS engine', a 'message\nbus' and a 'protocol' for using this bus to service\nthe applications that make up a given host\nsystem. Several examples are given of how the\nUSE protocol could function within the confines\nof a multi-application performance support\nenvironment. The final chapter in this section\nprovides a conclusion to the book. This chapter\nis very brief Oust two pages!); its essential\nmessage is the need to convert performance\nsupport solution development into an engineer-\ning discipline (akin to software engineering).\nOverall, I think this book makes a very useful\ncontribution to the growing field of performance\nsupport. However, having said this, it is my\nopinion that many of the ideas expressed in the\nbook are just 'common sense' HCI (human-\ncomputer interaction) and human-factors issues.\nIndeed, for many years, in my HCI courses, I\nhave introduced both PS (in general) and ERPSS\n(Event Related Potential Software System) (in\nparticular) as mechanisms to enable people to\novercome their innate, natural limitations - both\nphysical and intellectual. Because of its richness\nof ideas, I will undoubtedly recommend this\nbook to both my colleagues and students.\nHowever, as an academic, I have one major\n'crab' about this book - its over-emphasis on\n'business applications'. In my view performance\nsupport is a generic, universal tool that can be\napplied to all systems and organizations - not\njust those whose primary concern is 'business'.\nPhilip Barker\nUniversity of Teesside\n72\n"}