{"doi":"10.1016\/j.cageo.2009.10.001","coreId":"58214","oai":"oai:nora.nerc.ac.uk:9446","identifiers":["oai:nora.nerc.ac.uk:9446","10.1016\/j.cageo.2009.10.001"],"title":"Combining numercial and cognitive 3D modelling approaches in order to determine the structure of the Chalk in the London Basin","authors":["Royse, Katherine R."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2010-04","abstract":"In order to determine the structure of the Chalk in the London Basin, a combined cognitive and numerical approach to model construction was developed. A major difficultly in elucidating the structure of the Chalk in the London Basin is that the Chalk is largely unexposed. The project had to rely on subsurface data such as boreholes and site investigation reports. Although a high density of data was\\ud\navailable problems with the distribution of data and its quality meant that, an approach based on a numerical interpolation between data points could not be used in this case. Therefore a methodology was developed that enabled the modeller to pick out areas of possible faulting and to achieve a geologically reasonable solution even in areas where the data was sparse or uncertain. By using this combined approach, the resultant 3D model for the London Basin was more consistent with current geological observations and understanding. In essence, the methodology proposed here decreased the disparity between the digital geological model and current geological Knowledge. Furthermore, the analysis and interpretation of this model resulted in an improved understanding of how the London Basin evolved during the Cretaceous period.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/58214.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9446\/1\/Combining_geostatistical_and_cognitive_3D_modelling_approachesv3.pdf","pdfHashValue":"bec4e95fa4072ecbfc86801ca8fb58220cc14468","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9446<\/identifier><datestamp>\n      2012-11-22T12:08:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5338<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9446\/<\/dc:relation><dc:title>\n        Combining numercial and cognitive 3D modelling approaches in order to determine the structure of the Chalk in the London Basin <\/dc:title><dc:creator>\n        Royse, Katherine R.<\/dc:creator><dc:subject>\n        Computer Science<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        In order to determine the structure of the Chalk in the London Basin, a combined cognitive and numerical approach to model construction was developed. A major difficultly in elucidating the structure of the Chalk in the London Basin is that the Chalk is largely unexposed. The project had to rely on subsurface data such as boreholes and site investigation reports. Although a high density of data was\\ud\navailable problems with the distribution of data and its quality meant that, an approach based on a numerical interpolation between data points could not be used in this case. Therefore a methodology was developed that enabled the modeller to pick out areas of possible faulting and to achieve a geologically reasonable solution even in areas where the data was sparse or uncertain. By using this combined approach, the resultant 3D model for the London Basin was more consistent with current geological observations and understanding. In essence, the methodology proposed here decreased the disparity between the digital geological model and current geological Knowledge. Furthermore, the analysis and interpretation of this model resulted in an improved understanding of how the London Basin evolved during the Cretaceous period.\\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010-04<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9446\/1\/Combining_geostatistical_and_cognitive_3D_modelling_approachesv3.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Royse, Katherine R..  2010  Combining numercial and cognitive 3D modelling approaches in order to determine the structure of the Chalk in the London Basin.   Computers and Geosciences, 36 (4). 500-511.  https:\/\/doi.org\/10.1016\/j.cageo.2009.10.001 <https:\/\/doi.org\/10.1016\/j.cageo.2009.10.001>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00983004<\/dc:relation><dc:relation>\n        10.1016\/j.cageo.2009.10.001<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9446\/","http:\/\/www.sciencedirect.com\/science\/journal\/00983004","10.1016\/j.cageo.2009.10.001"],"year":2010,"topics":["Computer Science","Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nCombining numerical and cognitive 3D modelling 1 \napproaches in order to determine the structure of 2 \nthe Chalk in the London Basin  3 \n 4 \nKatherine R. Royse, British Geological Survey, Keyworth, Nottingham, NG12 5GG, UK 5 \nk.royse@bgs.ac.uk 6 \n 7 \nAbstract 8 \n 9 \nIn order to determine the structure of the Chalk in the London Basin, a combined cognitive and 10 \nnumerical approach to model construction was developed.  A major difficultly in elucidating the 11 \nstructure of the Chalk in the London Basin is that the Chalk is largely unexposed. The project had to 12 \nrely on subsurface data such as boreholes and site investigation reports. Although a high density of 13 \ndata was available problems with the distribution of data and its quality meant that, an approach 14 \nbased on a numerical interpolation between data points could not be used in this case. Therefore a 15 \nmethodology was developed that enabled the modeller to pick out areas of possible faulting and to 16 \nachieve a geologically reasonable solution even in areas where the data was sparse or uncertain. 17 \n 18 \nBy using this combined approach, the resultant 3D model for the London Basin was more 19 \nconsistent with current geological observations and understanding. In essence, the methodology 20 \nproposed here decreased the disparity between the digital geological model and current geological 21 \nknowledge. Furthermore, the analysis and interpretation of this model resulted in an improved 22 \nunderstanding of how the London Basin evolved during the Cretaceous period.  23 \n 24 \n 2\nKeywords: London, faulting, Cretaceous, Chalk, Numerical and knowledge driven modelling 25 \n 26 \n1. Introduction  27 \n 28 \nSince 3D geological modelling became an economic and technical  reality in the late 1980s 29 \n(Rosenbaum 2003), there has been a remarkable growth in computer modelling applications able to 30 \nproffer 3D modelling solutions (Gibbs 1993, Perrin et al. 2005, Sobisch 2000, Turner 2006). It is 31 \nnow possible not only to view and manipulate 3D models on a standard desk top computer but also 32 \nto integrate disparate digital datasets (De Donatis et al. 2009). This has enabled 3D geological 33 \nmodels to move from the sole used of the petroleum and mining industry to becoming a standard 34 \ngeological tool used by all (Kessler et al. 2009, Rosenbaum , Turner 2003, Royse et al. 2009, Xue et 35 \nal. 2004).  36 \n 37 \nOne of the key developments within the UK has been the increased availability of digital geological 38 \ndata. The first major step was achieved through the digitisation of the Geological map (Jackson , 39 \nGreen 2003). In subsequent years, data, for example borehole logs, tunnel maps and site 40 \ninvestigation reports, became increasingly available in digital formats (Bowie 2005, Jackson 2004). 41 \nThis necessitated changes in data management practice (Culshaw 2005, Turner 2006), such as the 42 \nrequirement for data to be spatially registered in nationally recognised coordinate and elevation 43 \nsystems and a move towards corporate databases which  have nationally agreed data standards and 44 \nvalidation procedures (Baker , Giles 2000, Kessler et al. 2009). This increased accessibility of 45 \ndigital data has resulted in 3D models moving from the conceptual model of (Fookes 1997) towards 46 \nthe ‘real’ geological  model of (Culshaw 2005, Royse et al. 2008).  In order to fully complete this 47 \nprocess, improvements will be needed in the current algorithms and concepts used in current 48 \ncomputer modelling packages (Wycisk et al. 2009).  49 \n 50 \n 3\nGeological 3D modelling software currently works in one of two ways, either using numerical 51 \nalgorithms to interpolate between data points such as borehole data (Krige 1966, Mallett 1992) or 52 \nby using a more cognitive interpretative approach, which allows for the incorporation of expert 53 \ngeological knowledge between observational data points (Hinze et al. 1999, Sobisch 2000). In this 54 \npaper a numerical 3D modelling method is defined as one where numerical algorithms are used to 55 \ninterpolate between data points (Wycisk et al. 2009) and a Cognitive 3D modelling methodology is 56 \none where the modeller incorporates his own geological knowledge to connect between data points 57 \n(Kessler et al 2009).  Both systems have their advantages; however, for many ‘real life’ situations, 58 \nthe best answer is one where a combination of both approaches should be used. This was the case 59 \nwith the London Chalk Model (LCM) which comprises of a series of seven faulted layers, 60 \nrepresenting six Chalk formations and the overlying undivided Palaeogene strata (Royse 2008). 61 \nProducing as realistic a geological model as possible becomes more significant when the model is 62 \nto be used to generate further numerical datasets, for example, a groundwater model (Wycisk et al. 63 \n2009). The work presented in this paper was funded by the Environment Agency, Thames Region, 64 \nto support work on the production of a new hydrogeological model for the River Thames 65 \ncatchment. 66 \n 67 \n2. Geographical and geological context 68 \n 69 \nThe model encompasses an area within the catchment of the River Thames; it extends from 70 \nHornchurch Marshes in the east to Hounslow in the west, up to Enfield in the north and down to 71 \nCroydon in the south (Fig. 1). Geologically, the London Basin is a broad, gentle synclinal fold, 72 \nwhose axis can be traced from Chertsey through to Southend-on-Sea (Fig. 1). The basement rocks 73 \n(Palaeozoic strata) of the region belong to 2 distinct structural provinces. To the north is the London 74 \nPlatform which is part of the Midlands Microcraton and in the south is the Variscan Fold Belt 75 \n(Ellison et al 2004, Fig 3.).  The geological structure of the Cretaceous and Palaeogene strata has in 76 \n 4\nthe past been considered to be ‘relatively simple’ (Ellison et al 2004) for example, on the current 77 \ngeological maps for the region only two faults are shown, the Wimbledon and Stratham fault and 78 \nthe Greenwich fault (Fig 2). There is however a growing body of data, particularly from recent 79 \ndeeper engineering projects such as the Channel Tunnel Rail link (CTRL, (Harris et al. 1996, 80 \nNewman 2009), CROSSRAIL and the Docklands light railway, suggesting that the structure of 81 \nLondon is far more complex.  82 \n 83 \nThe London Basin is thought to have formed in the Oligocene to mid-Miocene times during the 84 \nmain Alpine compressional event (Ellison et al. 2004). Formations in this region range from 85 \nCretaceous (144 to 65 Ma) to Quaternary (2 Ma to present day) in age. The Cretaceous Chalk is 86 \npresent at subcrop throughout the London basin and comes to the surface along the southern margin 87 \n(the North Downs) and along the northwest margin (Chiltern Hills) and is locally at or close to the 88 \nsurface e.g. along the Greenwich and Purfleet anticlines in East London.  89 \n 90 \nThe Cretaceous Chalk is typically a fine grained white limestone. (Bristow et al. 1997) provides a 91 \ndetailed description of the Chalk lithostratigraphy (Fig 4). The Chalk in the London area can be 92 \ndivided into 6 Formations; West Melbury Marly Chalk, Zig Zag Chalk, Holywell Chalk, New Pit 93 \nChalk, Lewes Nodular Chalk, and the Seaford and Newhaven Chalk undivided (Fig 3). These are 94 \ndistinguished by changes in their, hardness, colour and lithology and by the presence or absence of 95 \nmarl and flint bands. In the London area the total thickness of the Chalk is between 170 and 210 m 96 \nand generally thins from the west to the east. The London Basin succession is a relatively thin 97 \nsuccession compared to that of the Hampshire – Dieppe Basin where the Chalk is over 400 m thick 98 \n(Ellison et al 2004). Overlying the Chalk is the oldest Palaeogene deposit, the Thanet Sand 99 \nFormation. This formation consists of a coarsening upwards succession of fine grained, grey sand. 100 \nThe formation reaches a maximum thickness of around 30 m in the area. Above the Thanet Sand 101 \nFormation lies the Lambeth Group. This group consists of three formations: the Upnor, the 102 \n 5\nWoolwich and the Reading Formations. The Lambeth Group is between 20 and 30 m thick in the 103 \narea and lithologically, the group is highly variable, consisting of variable proportions of sands, 104 \nsilts, clays and gravels. Overlying the Lambeth Group are the Eocene sediments of the Thames 105 \nGroup which consist of the Harwich and London Clay Formations. The Harwich Formation 106 \n(formally known as the Blackheath or Oldhaven Beds) consists predominantly of sand and pebble 107 \nbeds up to 4 m thick. Above this is approximately 90 to 130 m of London Clay. The London Clay 108 \nFormation consists of grey to blue grey, bioturbated, silty clay. Quaternary deposits are encountered 109 \nthroughout the London Basin. These include evidence of ancient river systems and the development 110 \nof the present-day River Thames valley. Deposits include alluvium, peat, brickearth and river 111 \nterrace deposits (for example the Kempton Park, Taplow and Shepperton Gravels). 112 \n 113 \n3. Data sources and acquisition   114 \n 115 \nThis section describes the data collected for the LCM. The LCM project area is entirely within the 116 \ncity of London and as a consequence there is a huge quantity and variety (both in age and type) of 117 \ngeological data which can be incorporated into the model. This data has been collected by the 118 \nBritish Geological Survey over a period stretching from the 1830s to the present day. Therefore the 119 \nquality as well as the quantity of data available to define the position of each geological surface in 120 \nthe model is highly variable. In general, uncertainty in the thickness and geometry of any modelled 121 \ngeological unit is greatest in areas where the data is sparse and or of poor quality. Conversely, 122 \nconfidence is highest where there is a high concentration of good quality data (Kaufmann , Martin 123 \n2008b). Therefore the first stage in the modelling process was to collect, sort, interpret and validate 124 \nthis data (Kaufmann , Martin 2008b).  The data used in this project, described below, can be divided 125 \ninto two main types: interpretative (geological maps, cross sections, research reports and memoirs) 126 \nand observational (boreholes, site investigation reports, and outcrop descriptions) 127 \n 128 \n 6\n3.1 INTERPRETATIVE DATA  129 \nFour digital 1:50 000 scale geological maps published by the BGS cover the LCM project area 130 \n[sheets 256 (North London), 257 (Romford), 270 (South London) and 271 (Dartford)]. These maps 131 \nwere all re-surveyed during 1970–1995.  The London Memoir (Ellison et al. 2004) covers all four 132 \nmap sheets within the study area and has been used as the definitive text in this study (additional 133 \ninformation sources are listed below). The map sheets 256, 257 and 270 all use the traditional three-134 \nfold subdivision of the Chalk. However, map sheet 271 uses the new lithostratigraphic scheme 135 \ndeveloped for the Chalk over the last eleven years (Bristow et al. 1997, Rawson et al. 2001). For a 136 \nfull list of interpretive information sources used in this project, see table 1.  137 \n 138 \n3.2 OBSERVATIONAL   139 \nIn this study, 12,400 lithostratigraphic and 200 geophysical (natural gamma and resistivity) 140 \nborehole records were looked at; these records are held in the National Geological Records Centre 141 \nand by the Environment Agency. The records are of variable age and quality and many lacked 142 \nuseful lithological (or lithostratigraphical) information, the descriptions being too vague, imprecise 143 \nor inaccurate. In the end, some 4,300 borehole logs were found to provide useful information about 144 \nat least one stratigraphic boundary. 145 \n 146 \nWhere possible, the level of each stratigraphic boundary recorded in these logs was determined and 147 \nstored centrally in an oracle database called Borehole Geology (Kessler et al 2009). The database 148 \ncontains information on each borehole’s unique identification code, its national grid reference, its 149 \nheight relative to UK Ordnance Datum and information on the depth to base of each stratigraphic 150 \nboundary encountered in the borehole along with a free text description of that boundary. The 151 \ndigital borehole data was then downloaded form a data portal (Kessler et al 2009, (Howard et al. 152 \n2009) into a tab separated table which was compatible with the data formats required for GSI3D 153 \n 7\nand GoCad.   As errors can occur in any portion of the borehole data for example, in the original 154 \nrecord, in its subsequent interpretation  and in the recorded location of the borehole, (Aldiss et al. 155 \n2004)  these were checked for in each individual borehole. The National Grid coordinates for 156 \nboreholes were taken from the BGS Single Onshore Borehole Index (SOBI).  The ground surface 157 \nlevel (relative to Ordnance Datum) for each borehole was taken from the borehole record, where 158 \ndocumented. Recorded levels were checked against the NEXTMAP DTM. Where ground levels 159 \nwere not recorded, or were obviously incorrect, the level was interpolated from the NEXTMAP 160 \nDTM elevation data.  161 \n 162 \nThe lithological boreholes were interpreted using the new Chalk lithostratigraphy (Bristow et al. 163 \n1997). Borehole logs intersecting the top of the Chalk beneath the Palaeogene were extrapolated 164 \ndownwards to the base of each of the new Chalk formations, using an estimated thickness for each 165 \n(Aldiss et al 2004). It should be noted that the thickness of each unit is known to vary slightly 166 \nacross the area, and so these ‘phantom data points’ are correspondingly uncertain. The ‘phantom 167 \ndata points’ were incorporated into the production of the digital geological cross-sections, which 168 \nwere drawn up as part of GSI3D modelling procedure (see section 4.1). The cross-sections provided 169 \na means of checking each phantom point’s position relative to other boreholes in the near vicinity. 170 \nIn this way the ‘phantom data points’ made a valuable contribution to elucidating the position of 171 \neach Chalk formation within the model.    172 \n 173 \nGeophysical logs (natural gamma and resistivity) stratigraphic interpretation was based on work by 174 \nMortimore and Pomerol (1987b) and Murray (1986) and is described more fully by Woods (2001, 175 \n2002). Geophysical boreholes were scrutinised in a similar way to those of the lithological 176 \nboreholes; each record was first interpreted individually, and then each interpretation was compared 177 \nwith that of its nearest neighbours, as a further check on the consistency of the interpretation.  178 \n 179 \n 8\nInterpreted borehole data was then used to generate the 3D model, enabling the borehole records to 180 \nbe considered relative to each other, in their local context. Borehole records which gave rise to 181 \nobvious anomalies in the modelled surfaces and which seemed to be in some way unreliable (e.g. 182 \nover-simplified drillers’ logs) were noted within the modelling metadata files and then discarded. It 183 \nshould be noted that borehole records which are somehow incorrect but which are nevertheless 184 \nconsistent with the model will generally remain unsuspected (Aldiss et al 2004). 185 \n 186 \n4. Geological modelling  187 \n 188 \nModelling was carried out to ascertain not only the distribution of the six Chalk formations found 189 \nwithin the London Basin but also the Chalk’s structure. One of the major difficulties in elucidating 190 \nthe structure of the Chalk within the London Basin is that the Chalk is largely unexposed and where 191 \nit is exposed, it is either covered by superficial deposits (drift) or obscured from view due to urban 192 \ndevelopment. Therefore the project had to rely to a large extent on the Geologist’s interpretation of 193 \nthe subsurface data and geological observations made in the mid to late 1800s. Although few faults 194 \nare indicated on the current published geological maps, there is a growing body of data, particularly 195 \nfrom recent deeper engineering projects such as the Channel Tunnel Rail link (CTRL), (Harris et al. 196 \n1996, Mortimore et al. In prep), that suggests that faults are far more numerous. These data are 197 \nfurther supported by the mounting evidence that tectonic and sea-level movement occurred in 198 \nphases throughout the upper Cretaceous (Evans , Hopson 2000, Evans et al. 2003, Mortimore , 199 \nPomerol 1987a, 1991, Mortimore et al. 1998).  200 \n 201 \nA methodology was needed that enabled the Geologist to apply his geological knowledge 202 \nintuitively into the 3D model, as would be the case when producing a traditional geological map 203 \nTherefore a workflow was needed to mirror as much as possible the methods used when drafting 204 \ntraditional cross-sections across areas with sparsely distributed control data (Fig. 5). This allowed 205 \n 9\nthe modeller to pick out areas of possible faulting and to achieve a geologically reasonable solution 206 \neven in areas where the data was sparse or uncertain (kaufmann , Martin 2008a, b, Lemon , Jones 207 \n2003). Therefore a methodology was developed that combined a cognitive and numerical approach 208 \nusing the combined functionality of GSI3D (version 2.5) and GoCad (version 2.1.3). This approach 209 \nallowed the modeller to capture his\/her own interpretation of the geometry and thickness of each 210 \ngeological unit (Kessler et al. 2009), to pick out areas of faulting and generalise the faults into a 211 \ncoherent fault network, and finally, using  numerical techniques in GoCad, to smooth and cut the 212 \nmodel by the fault network generated. 213 \n 214 \n4.1 Cognitive modelling  methodology  215 \n 216 \nGSI3D modelling methodology (Sobisch 2000)  allows the modeller to model the distribution and 217 \ngeometry of geological units by using the modeller’s geological knowledge (Wycisk et al. 2009). 218 \nThe modelling procedure within GSI3D is based on the creation, by the user, of a series of 219 \nintersecting cross-sections. The Cross-sections are generated from borehole information and 2D 220 \ngeological map and surface data. A generalised vertical section (GVS) is then defined for all the 221 \nrock units in the study area. The package then interpolates between nodes along the sections and 222 \nproduces a series of triangulated irregular networks (TINs), for each rock unit modelled (Kessler et 223 \nal 2009). Because GSI3D uses a ‘constructive method’ (Wycisk et al 2009) the package provides 224 \nthe modeller with the ability to connect areas in the model, where there is either only partial data 225 \ncoverage or where the geometry of the geological units is poorly understood. The LCM was 226 \nconstructed by correlating outcrop data with boreholes that were linked together in a network of 227 \nintersecting cross-sections.  Data was included from a considerable distance beyond the project area 228 \nin order to ensure that regional trends were correctly represented (Fig 6a) 229 \n 230 \n 10\nThe cross-sections were constructed in roughly orthogonal directions (north-south and west-east), 231 \nwhich allowed for borehole correlations to be checked iteratively across the area (Fig 6c). Where 232 \npossible, cross-sections were placed at right angles to known geological structures. Shorter, 233 \nancillary cross-sections on other alignments were constructed, in order to encompass local 234 \nvariations and anomalies. Errors caused by data deficiencies were checked against the supporting 235 \ndata and removed or smoothed. A total of 100 sections were constructed (Fig 6c). 236 \n 237 \nDuring model construction, metadata was recorded describing the geologist’s decision-making 238 \n(cognitive) processes and any boreholes found to be erroneous.  This is an essential part of the 239 \nprocedure. Firstly, it is important that the model is repeatable; therefore the modeller needs to 240 \nrecord what assumptions or actions were made as part of the cognitive modelling method. 241 \nSecondly, it allows the eventual model to be reused at a later date when the originator may not be 242 \nreachable, thereby future-proofing the data.  Once the model was assembled in GSI3D, the sections 243 \nwere revisited to check that fault determinations were valid.  244 \n 245 \n4.1.1 Determination of faulting 246 \n 247 \nAs mentioned in section 2 only two faults have been mapped in the London Basin yet a growing 248 \nbody of evidence from recent site investigations suggests that in reality the structure of the Basin is 249 \nmore complex (Newman 2009, Skipper et al. 2008).  However determining the exact nature of 250 \nfaulting within the London basin is difficult because the majority of the bedrock is either at subcrop 251 \nand\/or covered by the built environment of the city of London or by thick superficial deposits 252 \nrelated to the development of the River Thames. To further add to the problem, elucidating faulting 253 \nwithin the Chalk outcrop of Southern England is  known to be problematic (Aldiss et al. 2004). This 254 \nis due to the fact that when faulting is observed in the Chalk, the displacement has often been 255 \naccommodated by movements on numerous small-scale faults within a zone tens or even hundreds 256 \n 11\nof metres wide. For example, known (mapped) faults in the London Basin such as the Greenwich 257 \nfault (Ellison et al. 2004), occur as a single plane on the geological map, but is in reality a zone of 258 \ndisruption which includes a number of closely spaced faults and fractures. Therefore, in unexposed 259 \nChalk terrain, it is rarely possible to distinguish the difference between a broad, gentle anticlinal 260 \nfold and a broad fault zone (Aldiss et al. 2004). Therefore to elucidate the structure of the London 261 \nBasin an approach was needed that would allow a geologist trained in traditional field surveying 262 \ntechniques and specialising in the geology of the London Basin the ability to capture his specialist 263 \nknowledge and understanding in a 3D geological model. It was found that by using the GSI3D 264 \ncognitive approach (see section 4.1) with its methodology based on the long-standing relationship 265 \nbetween the geological map and cross-section generation (Kessler et al 2009), a structural model for 266 \nthe London Basin could be achieved. During this process a set of criteria, that suggested areas 267 \nwhere faulting in the Chalk Strata was probable, was documented, see Table 2.  268 \n 269 \nAt this stage 90 individual fault traces were picked out. As discussed above, known faults in the 270 \nLondon Basin are in reality zones of disruption which consist of a number of closely spaced en 271 \nechelon faults. Therefore the individual fault traces were viewed in a more regional context and 272 \ncompared with the gravity anomaly and interpreted datasets in ArcGIS (Fig 3, Table 1). This was 273 \nthen used to produce a regional fault pattern for the London Basin.  The resulting fault network 274 \nconsisted of 13 major fault zones cutting across the project area (Fig 6 d). It should be noted that the 275 \nrelatively sparse distribution of subsurface data did not allow for the delineation of any but the most 276 \nobvious structures, particularly where the occurrence of small to medium scale faults in the Chalk is 277 \nless than the general spacing of the boreholes. 278 \n 279 \n4.2 Numerical modelling   280 \n 281 \n 12\nOnce these steps were completed, the data was exported into GoCad. GoCad operates on the 282 \npremise that the geometry of any geological object can be defined by a set of points. An object 283 \nis modelled by the links connecting these points. The Discrete Smooth Interpolation algorithm 284 \n(DSI), which sits in the interior of the GoCad programme, was designed to model the geometry 285 \nof complex geological objects and  account for any constraints, such as boreholes data, placed 286 \nupon it (Mallet 1997). 287 \n 288 \n The data imported consisted of digital cross-sections generated in GSI3D, the original borehole 289 \ndata, which were all imported into GoCad as 3D geo-registered point data,  the NEXTMAP 290 \nDTM was  brought in as a surface and the generalised fault network work (Fig 3) and digital 291 \ngeological line work was imported in as 3D line datasets. Data exchange between the two 292 \nprogrammes (GSI3D and GoCad) was simply made through existing file exchanges. This data 293 \nprovided the constraints to the final modelled surface produced in GoCad.  294 \n 295 \nUsing scripts ‘wizards’ within GoCad, triangulated surfaces were generated for each geological 296 \nformation and fault plane. The surfaces were constructed using the  DSI algorithm to compute 297 \nthe location of the nodes (Mallett 1997). This algorithm produces a geometry which is smooth, 298 \nbut can also takes account of a set of constraints, in this case the borehole and cross-section data 299 \n(Galera et al. 2003). Once this is done, a series of steps are followed which removes cross-over 300 \nerrors between the surfaces. This is done through either applying thickness constraints or 301 \nmoving surfaces above or below a reference surface i.e. the surface with the highest quantity of 302 \ngood quality well distributed data. Once these stages were completed the resultant model could 303 \nbe visualised and assessed (Fig 7). 304 \n 305 \n4.3 Comparison of the proposed 2 step methodology with a single step numerical modelling 306 \nmethod 307 \n 13\nAfter the modelling work was carried out, a comparison was undertaken between the combined 308 \ncognitive and numerical workflow with a more numerical workflow using script ‘wizards’ within 309 \nGoCad to interpolate between borehole points. In Figure 8 part of the base Palaeogene surface has 310 \nbeen remodelled using a numerical workflow. The same borehole dataset was used as in the 311 \ncombined approach discussed in sections 4.1 and 4.2. The base Palaeogene surface was specifically 312 \nchosen for this comparison because it has the highest number of borehole data points defining its 313 \nsurface.  The location was picked as it is an area where faulting is not recorded on the current 314 \ngeological maps but where observations from deeper engineering works would suggest that faulting 315 \nmay be present.  316 \n 317 \nThe comparison of the two surfaces in Figure 8 shows clearly the effects of the combined approach 318 \non surface construction and fault determination on the base Palaeogene surface.  For example the 319 \nnorthern boundary fault, NW and ENE trending faults described in section 5 (Fig 9) are clearly 320 \nobserved in the combined method however the more numerical workflow does not provide a clear 321 \nindication of all of these structures.  In this case even though a large number of boreholes are 322 \navailable for the base Palaeogene surface, where the geology was faulted the numerical workflow 323 \nwas not able to achieve a model that was as consistent with current geological knowledge and 324 \nobservations as the combined methodology attained (see section 6; Newman 2009).  Subsequent 325 \nlayers beneath the base Palaeogene surface have significantly less borehole data defining their 326 \nsurfaces, for example, the Seaford Chalk Formation contains only 54% of the total number of 327 \nboreholes used in the project. With depreciating amounts of borehole data intersecting each 328 \nsucceeding lower layer the results achieved with a single stepped numerical workflow become 329 \nincreasingly inadequate. In essence the single stepped numerical modelling methodology requires a 330 \nhigh concentration of boreholes which are evenly distributed for each surface to be modelled.  331 \n 332 \n5 The Structure of the Chalk under London as derived from the London Chalk Model  333 \n 14\n 334 \nBy using a combined cognitive and numerical method, the resultant 3D model for the London Basin 335 \nwas consistent with current geological observations and understanding. The analysis and 336 \ninterpretation of this model, discussed below, has resulted in an improved understanding of how the 337 \nLondon Basin evolved during the Cretaceous period.  338 \n 339 \nThe geological structure of the London Basin was generally thought to be a relatively simple north-340 \neast trending syncline (Ellison et al. 2004). However, the LCM suggests that, in detail, the London 341 \nBasin is a much more complex structure, being a collection of at least 5 fault-bounded basins (Fig 9 342 \nand 10). The model also suggests that the project area can be split into two sections or regions, 343 \nwhich have behaved differently during the evolution of the basin. This split can be related to the 344 \ntwo structural provinces observed within the basement strata in the region (Ellison et al. 2004): the 345 \nnorthern portion being underlain by the London Platform (part of the Midlands Microcraton) and 346 \nthe southern portion by a zone of transition between the London Platform and the Variscan fold-347 \nthrust belt (Fig 3). This change in basement material across the Basin has determined, to a large 348 \nextent, the type and intensity of the geological features found in each region.  349 \n 350 \nFor example, folding within the project area (Fig. 11) can be divided into two groups: the first 351 \ngroup  found south of the London Basin Axis (Fig1) and coincidently South of the River Thames 352 \nconsists of east-north-east trending periclinal folds, including the Greenwich and Streatham 353 \nanticlines. These features are generally high amplitude and short wavelength folds, many of which 354 \nare asymmetric, usually with steeper north-facing limbs. The second group are confined to the 355 \nnorthern part of the project area and are in the main low amplitude, long wavelength folds.  356 \n 357 \nFaulting is predominantly confined to the south-eastern portion of the project area; its distribution 358 \nwithin the London Basin again appears to have been controlled by the properties of the basement 359 \n 15\nwhich underlie it. The faults, broadly speaking, can be divided into 3 groups (Fig 9): ENE trending 360 \nfaults, which downthrow to the north (the majority of faulting within the south-eastern sector); ENE 361 \ntrending faults, which downthrow to the south (northern boundary faults); and northwest trending 362 \nfaults, which downthrow to the west. Displacements range between 10 to 50 m. The LCM modelled 363 \nChalk surfaces also suggest the presence of a central structural high. The central structural high is 364 \nbound to the west by the NW trending faults and to the north by an ENE trending fault.  365 \n 366 \n6. Summary and Conclusions 367 \nThis paper has described a combined cognitive and numerical modelling methodology.  368 \nIn order for this approach to work, two key developments were necessary; the availability of digital 369 \ngeological data within the UK and the inter-operability between modelling packages, which 370 \nprovided the tools necessary to integrate different types of digital geoscientific data and modelling 371 \napproaches. This methodology was developed in order to overcome the problem of having an 372 \nuneven distribution of borehole\/subsurface data which was clustered around linear routes e.g. 373 \ninfrastructure developments and a limited amount of surface exposure of the Chalk in central 374 \nLondon, (either because the stratum was at sub-crop or because it was covered by superficial 375 \ndeposits and\/or the built environment).  It was found, that to produce the most realistic 3D model 376 \npossible, large quantities of data was not enough; it was also essential to use the correct processing 377 \nmethod. The method had to produce surfaces (faults and stratigraphic horizons) that not only 378 \nhonoured the data but were also geologically reasonable and finally, the resultant model had to be 379 \nrepeatable, in other words the hypotheses or concepts used to generate the model had to be 380 \ncaptured.  381 \n 382 \nThe project therefore had to incorporate specialist geological knowledge from a geologist more at 383 \nhome with traditional field surveying techniques than ‘state of the art’ computer modelling 384 \npackages. Consequently it was essential that a methodology was developed that enabled the 385 \n 16\nGeologist to not only capture his knowledge and understanding of the geology of Chalk in London 386 \nbut to also provide a means of selecting areas of possible faulting and finally to achieve a 387 \ngeologically reasonable solution even in areas where the data was sparse or uncertain.  388 \n 389 \nTherefore the accuracy of any 3D digital model will depend not only on the data, its density and 390 \nquality, but also on the theoretical understanding of the underlying geology by the modeller.  It 391 \nfollows therefore that, when assessing the confidence or uncertainty of a model, a key component 392 \nshould be the modeller’s theoretical knowledge and experience (Royse et al. 2009).  This becomes 393 \nmore critical when the model is to be used to generate further numerical datasets as is the case in 394 \nthe London Chalk Model. All users of 3D models must be able to understand the limitations of the 395 \ndata on which they base their assessments. Improvements in 3D modelling methods are allowing 396 \ngeoscientists to introduce a far greater level of realism into their 3D models. It is therefore essential, 397 \nparticularly where cognitive modelling techniques have been used, that users are able to understand 398 \nhow the model was produced as well as the density and quality of the data used.  One way to 399 \nachieve this is to compile metadata files during the modelling process. These files should contain 400 \ninformation on exactly what modelling processes were undertaken, the modellers understanding of 401 \nthe geological setting, what data was discarded and why these actions were taken. As Users, 402 \nultimately, need to be able to assess the risk associated with using 3D models, so that sound 403 \ndecisions can be made (Royse et al 2009).  404 \n 405 \nThe methodology combined together the combined functionality of GSI3D and GoCad. This 406 \napproached allowed the modeller to capture an interpretation of the geometry and thickness of 407 \neach geological unit (Kessler et al. 2009), to pick out areas of faulting and generalise the faults 408 \ninto a coherent fault pattern, and finally, using numerical techniques in GoCad, to smooth and cut 409 \nthe model by the generated fault pattern. In essence it provided a conduit through which the 410 \ncapture of specialist geological knowledge could be achieved and used within a 3D modelling 411 \n 17\nenvironment. It was essential that metadata was kept with the modelling project, so that a record of 412 \nthe concepts and processes performed on the model were recorded. This would mean that the 413 \nmodelling procedures could, at a later date, be reproduced.  414 \n 415 \nThe resultant model is more consistent with current geological observations and theories and as a 416 \nconsequence the model is a closer representation of geological reality. For example the model 417 \npredicts that the Greenwich fault continues into north east London and that there is faulting to the 418 \nsouth of the River Lea (Fig 6d). Ground investigations, including rotary cored boreholes, carried 419 \nout as part of the Thames Tideway tunnelling project (Newman 2009) has shown that these 420 \npredictions can be substantiated. Further evidence for validation of the modelling methodology has 421 \ncome from chalk-cored boreholes from the Thames Waters Lee Tunnel and Thames Waters Ring 422 \nMain extension, where site investigations recently reported by Mortimore et al (In prep) suggest 423 \nthe presence of a major north-south offset which has again been predicted by this model.  Current 424 \nwork underway on production of a new hydrogeological model for London has found that in using 425 \nthe new fault model the resulting groundwater level pattern fits better with groundwater level 426 \nobservations (Steve Buss pers. comm.) 427 \n 428 \nIn conclusion, the increasing accessibility of digital data along with a combined cognitive and 429 \nnumerical  approach to model development will result in 3D models moving from the conceptual 430 \nmodel of Fookes ( 1997) towards the ‘real’ geological  model of Culshaw ( 2005). To fully 431 \ncomplete this process, modelling software that combines both cognitive and numerical approaches 432 \nis required. If this can be achieved, then the future proposed by Culshaw (2005), where ground 433 \ninvestigations and the development of groundwater models will start by testing the validity of the 434 \n‘real’ geological model, will become a reality.  435 \n 436 \nAcknowledgement 437 \n 18\nThe author would like to thank her many colleagues at BGS for their help and support with the 438 \nproduction of this paper. The two referees are thanked for there constructive comments on the 439 \noriginal submission, which have helped her, make significant improvements to the paper.  This 440 \narticle is published with the permission of the Executive Director of the British Geological 441 \nSurvey (NERC).  442 \nReferences  443 \nAldiss, D. T., Bloomfield, J. R., Buckley, D. K., Doran, S. K., Evans, P. M., Hopson, P. M., Royse, 444 \nK. R., Woods, M. A. 2004. A geological model of the chalk of East Kent. Volume 1 , 2. 445 \nBritish Geological Survey Commissioned Report. CR\/04\/92, 97pp. 446 \nBaker, G. R., Giles, J. 2000. BGS Geoscience integrated database system: a repository for corporate 447 \ndata. Earthwise 16, 12-13. 448 \nBowie, R. 2005. Creating a digital landslide. Geoscientist 15(3), 4-7. 449 \nBristow, C. R., Mortimore, R. N., Wood, C. J. 1997. Lithostratigraphy for mapping the chalk of 450 \nsouthern England. Proceedings of the Geologists' Association 108, 293-315. 451 \nCulshaw, M. G. 2005. From concept towards reality: developing the attributed 3D model of the 452 \nshallow subsurface.  Quarterly Journal of Engineering Geology and Hydrogeology 39, 231-453 \n284. 454 \nDe Donatis, M., Borraccini, F.  , Susini, S. 2009. Sheet 280 - Fosombrone 3D: A study project for a 455 \nnew geological map of Italy in three dimensions. Computers & Geosciences 35, 19-32 456 \nEllison, R. A., Woods, M. A., Allen, D. J., Forster, A., Pharaoh, T. C., King, C. 2004. Geology of 457 \nLondon Special Memoir for 1: 50 000 Geological Sheets 256 (North London), 257 458 \n(Romford), 270 (South London) and 271 (Dartford) (England and Wales). British 459 \nGeological Survey. 114 pp. 460 \nEvans, D. J., Hopson, P. M. 2000. The seismic expression of synsedimentary channel features 461 \nwithin the chalk of southern England. Proceedings of the Geologists’ Association 111(3), 462 \n219-230. 463 \nEvans, D. J., Hopson, P. M., Kirby, G. A., Bristow, C. R. 2003. The development and seismic 464 \nexpression of synsedimentary features within the chalk of southern England. Journal of the 465 \nGeological Society, London 160, 797-813. 466 \nFookes, P. G. 1997. Geology for engineers: the geological model, prediction and performance 467 \nQuarterly Journal of Engineering Geology 30, 293-424. 468 \nGalera, C., Bennis, C., Moretti, I., Mallett, J. L. 2003. Construction of coherent 3D geological 469 \nblocks. Computers & Geosciences 29, 971-984. 470 \nGibbs, B. 1993. Mineral Industry Software. In: Bird, D., Brewis, T., Chadwick, J., Clifford, D., 471 \nEllis, R., Kennedy, A., Morgan, R., Pearse, G., Rosin, N., Schooling, J., Spooner, J., West, 472 \nM. (Eds.) Mining Annual Review, 1993. Mining Journal Publications, London, p. 57-63. 473 \nHarris, C. S., Hart, M. B., Varley, P. M., Warren, C. D. 1996. Engineering Geology Of The Channel 474 \nTunnel. Thomas Telford Publishing. 526 pp 475 \nHinze, C., Sobisch, H.-G., H-H, V. 1999. Spatial modelling in geology and its practical use. 476 \nMathematische Geologie 4, 51-60. 477 \nHoward, A., Hatton, B., Reitsma, F., Lawrie, K. 2009. Developing a geoscience knowledge 478 \nframework for a national geological survey organisation. Computers & Geosciences 35(4), 479 \n820-835. 480 \nJackson, I. 2004. Britain Beneath Our Feet.  British Geological Survey Occasional Publication No. 481 \n4, Hawthorns, Nottingham. 114pp. 482 \nJackson, I., Green, C. A. 2003. The Digital geological map of Great Britain. Geoscientist 13(2), 4-7. 483 \n 19\nKaufmann, O., Martin, T. 2008. 3D geological modelling from boreholes, cross-sections and 484 \ngeological maps, application over former natural gas storages in coal mines. Computers & 485 \nGeosciences 34, 278-290. 486 \nKessler, H., Mathers, S., Sobisch, H.-G. 2009. The Capture and dissemination of integrated 3D 487 \ngeospatial knowledge at the British Geological Survey using GSI3D software and 488 \nmethodology. Computers & Geosciences 35, 1311-1321. 489 \nKrige, D. G. 1966. Two-dimensional weighted moving average trend surfaces for ore valuation. 490 \nJournal of South African Institution of Mining and Metallurgy (Proceedings from the 491 \nSymposium on mathematical statistics and Computer Applications in Ore Valuation) 66, 13-492 \n38. 493 \nLemon, A. M., Jones, N. L. 2003. Building solid models from boreholes and user-defined  cross 494 \nsections. Computers & Geosciences 29, 547-555. 495 \nMallett, J. L. 1992. GOCAD: a computer aided design program for geological applications. In: 496 \nTurner, A. K. (Ed) Three-dimensional Modelling with Geoscientific Information Systems. 497 \nKluwer, London. p. 123-141. 498 \nMallett, J. L. 1997. Discrete modelling for natural objects. Mathematical Geology 29, 199 - 219. 499 \nMortimore, R. N., Pomerol, B. 1987a. Correlation of the Upper Cretaceous White Chalk (Turonian 500 \nto Campanian) in the Anglo-Paris Basin. Proceedings of the Geologists' Association 98, 97-501 \n143. 502 \nMortimore, R. N., Pomerol, B. 1987b. Correlation of the Upper Cretaceous White Chalk (Turonian 503 \nto Campanian) in the Anglo-Paris Basin. Proceedings of the Geologists’ Association 98, 97-504 \n143. 505 \nMortimore, R. N., Pomerol, B. 1991. Stratigraphy and eustatic implications of trace fossil events in 506 \nthe Upper Cretaceous Chalk of Northern Europe. Palaios 6, 216-231. 507 \nMortimore, R. N., Wood, C. J., Pomerol, B., Ernst, G. 1998. Dating the phases of the Subhercynian 508 \ntectonic epoch: Late cretaceous tectonics and eustatics in the cretaceous basins of northern 509 \nGermany compared with the Anglo-Paris Basin. Zentralblatt Für Geologie und 510 \nPaläontologie 1(11\/12), 1349-1401. 511 \nMurray, K. H. 1986. Correlation of electrical resistivity marker bands in the Cenomanian and 512 \nTuronian Chalk from the London Basin to east Yorkshire. British Geological Survey Report 513 \n17\/8. London: Her Majesty's Stationery Office. 18pp 514 \nNewman, T. 2009. The impact of adverse geological conditions on the design and construction of 515 \nthe thames water ring main in greater London, UK. Quarterly Journal of Engineering 516 \nGeology and Hydrogeology 42(1), 5-21. 517 \nPerrin, M., Zhu, Z., Rainaud, J.-F., Schnieder, S. 2005. Knowledge-driven applications for 518 \ngeological modelling Journal of Petroleum Science Engineering 47, 89-104. 519 \nRawson, P. F., Allen, P. W., Gale, A. S. 2001. The Chalk Group - a revised lithostratigraphy. 520 \nGeoscientist 11(1), 21. 521 \nRosenbaum, M. S. 2003. Characterisation of the shallow subsurface: implications for urban 522 \ninfrastructure and environmental assessment. In: Rosenbaum, M. S., Turner, A. K. (Eds) 523 \nNew paradigms in subsurface prediction. Lecture notes in earth sciences 99. Springer-524 \nVerlag, Berlin.  p. 3-6. 525 \nRosenbaum, M. S., Turner, K. 2003. New paradigms in subsurface prediction : characterization of 526 \nthe shallow subsurface implications for urban infrastructure and environmental assessment 527 \nSpringer, Berlin. 397pp 528 \nRoyse, K. R. 2008. The London Chalk Model. British Geological Survey Commissioned Report, 529 \nCR\/08\/125. 21pp. 530 \nRoyse, K. R., Reeves, H. J., Gibson, A. R. 2008a. The modelling and visualisation of digital 531 \ngeoscientific data as an aid to land-use planning in the urban environment, an example from 532 \nthe Thames Gateway. In: Liverman, D. G. E., Pereira, C., Marker, B. (Eds) Communicating 533 \nEnvironmental Geoscience. Geological Society, London, Special Publication 305, 89-106. 534 \n 20\nRoyse, K. R., Rutter, H. K., Entwisle, D. C. 2009. Property attribution of 3D geological models in 535 \nthe thames gateway: new ways of visualising geoscientific information. Bulletin of 536 \nEngineering Geology and the Environment. 68, 1-16   537 \nSkipper, J. A., Newman, T., Mortimore, R. N. 2008. The Engineering geology of the lee tunnel, east 538 \nLondon, UK. Euroengeo 2008. International Association of Engineering Geology Madrid. p 539 \n1-3 540 \nSobisch, H.-G. 2000. Ein difitles raeumliches Modell des Quartaers der GK25 Blatt 3508 Nordhorn 541 \nauf der Basis vernetzer Profilschnitte. . Shaker Verlag, Aachen. 542 \nSumbler, M. G. 1996. British regional geology: London and the Thames Valley. Her Majesty's 543 \nStationary Office for the British Geological Survey, London.173pp 544 \nTurner, A. K. 2006. Challenges and trends for geological modelling and visualisation. Bulletin of 545 \nEngineering Geology and the Environment 65, 109 - 127. 546 \nWoods, M. A. 2001. Lithostratigraphical interpretation of borehole geophysical logs in the chalk 547 \ngroup of the berkshire downs. British Geological Survey Internal Report, IR\/01\/150 10pp. 548 \nWoods, M. A. 2002. Correlation and lithostratigraphical interpretation of borehole geophysical logs 549 \nin the chalk group of the north downs. British Geological Survey, Commissioned Report 550 \nCR\/02\/247, 5pp. 551 \nWycisk, P., Hubert, T., Gossel, W., Neumann, C. 2009. High-resolution 3D spatial modelling of 552 \ncomplex geological structures for an environmental risk assessment of abundant mining and 553 \nindustrial megasites. Computers & Geosciences 35, 165-182. 554 \nXue, Y., Sun, M., Ma, A. 2004. On the reconstruction of three-dimensional complex geological 555 \nobjects using Delaunay triangulation. Future Generation Computer Systems 20, 89-104. 556 \n 557 \n 558 \nFigure Captions  559 \n 560 \nFigure 1: Geological sketch map of project area. Adapted from Sumbler (1996) 561 \n 562 \nFigure 2: Geological cross-section across region showing ‘relatively simple’ geological structure of 563 \nregion as previously proposed by Sumbler (1996). Section adapted from Sumbler (1996). 564 \n 565 \nFigure 3: Colour-shaded bouguer gravity relief map showing location of two structural provinces 566 \ndissecting project area (outlined in purple). OS data ©Crown Copyright.  All rights reserved. BGS 567 \n100017897 \/ 2009 568 \n 569 \nFigure 4: Detailed lithostratigraphy of Chalk in London. Adapted from Ellison et al. (2004) 570 \n 571 \nFigure 5: Diagram of workflow developed to model Structure of Chalk under London  572 \n 573 \nFigure 6: Data and fault distribution in study area. a) Distribution of boreholes in study area b) 574 \nDistribution of fault traces as determined from cross-section analysis c) Fence diagram showing 575 \ndistribution of cross-sections within study area d) Regional Fault Network  576 \n 577 \nFigure 7: 3D model of Chalk Group under London. OS data ©Crown Copyright.  All rights 578 \nreserved. BGS 100017897 \/ 2009  579 \n 580 \nFigure 8: Structure contour plots of part of base Palaeogene to compare combined methodology 581 \nproposed in this paper with a numerical modelling method based solely on interpolation between 582 \nboreholes. OS data ©Crown Copyright.  All rights reserved. BGS 100017897 \/ 2009 583 \n 584 \n 21\nFigure 9: Structure contour plot of base of Palaeogene, showing major fault groups and location of 585 \nstructural high 586 \n 587 \nFigure 10: Updated Geological cross-section across region showing more complex geological 588 \nstructure of London Basin as proposed in Figure 10. 589 \n 590 \nFigure 11: Base of Seaford Chalk showing fold axial traces (lines: black with diamonds anticlines; 591 \nmagenta with crosses synclines and brown faults 592 \n 593 \n 594 \nTable Captions  595 \n 596 \nTable 1: Interpretive information sources used in 3D modelling of Chalk in London Basin 597 \n 598 \nTable 2: Set of criteria indicating a high probability of faulting within the sub-crop Chalk Strata in 599 \nthe London basin  600 \n 601 \n"}