{"doi":"10.1016\/j.bulm.2004.03.003","coreId":"96788","oai":"oai:generic.eprints.org:362\/core69","identifiers":["oai:generic.eprints.org:362\/core69","10.1016\/j.bulm.2004.03.003"],"title":"Bulletin of Mathematical Biology - facts, figures and comparisons","authors":["Maini, P. K.","Schnell, S.","Jolliffe, S."],"enrichments":{"references":[{"id":765043,"title":"Nicolas Rashevskay 1899–1972.","authors":[],"date":"1972","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"The Society for Mathematical Biology (SMB) owns the Bulletin of Mathematical Biology (BMB). This is an international journal devoted to the interface of mathematics and biology. At the 2003 SMB annual meeting in Dundee the Society asked the editor of the BMB to produce an analysis of impact factor, subject matter of papers, submission rates etc. Other members of the society were interested in the handling times of articles and wanted comparisons with other (appropriate) journals. In this article we present a brief history of the journal and report on how the journal impact factor has grown substantially in the last few years. We also present an analysis of subject areas of published papers over the past two years. We finally present data on times from receipt of paper to acceptance, acceptance to print (and to online publication) and compare these data with some other journals","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96788.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/362\/1\/170.pdf","pdfHashValue":"fca92b997da26f6d9b3124324ae68bda9511dc9d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:362<\/identifier><datestamp>\n      2015-05-29T18:20:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/362\/<\/dc:relation><dc:title>\n        Bulletin of Mathematical Biology - facts, figures and comparisons<\/dc:title><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Schnell, S.<\/dc:creator><dc:creator>\n        Jolliffe, S.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        The Society for Mathematical Biology (SMB) owns the Bulletin of Mathematical Biology (BMB). This is an international journal devoted to the interface of mathematics and biology. At the 2003 SMB annual meeting in Dundee the Society asked the editor of the BMB to produce an analysis of impact factor, subject matter of papers, submission rates etc. Other members of the society were interested in the handling times of articles and wanted comparisons with other (appropriate) journals. In this article we present a brief history of the journal and report on how the journal impact factor has grown substantially in the last few years. We also present an analysis of subject areas of published papers over the past two years. We finally present data on times from receipt of paper to acceptance, acceptance to print (and to online publication) and compare these data with some other journals.<\/dc:description><dc:date>\n        2004<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/362\/1\/170.pdf<\/dc:identifier><dc:identifier>\n          Maini, P. K. and Schnell, S. and Jolliffe, S.  (2004) Bulletin of Mathematical Biology - facts, figures and comparisons.  Bulletin of Mathematical Biology, 66  (4).   pp. 595-603.      <\/dc:identifier><dc:relation>\n        10.1016\/j.bulm.2004.03.003<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/362\/","10.1016\/j.bulm.2004.03.003"],"year":2004,"topics":["Biology and other natural sciences"],"subject":["Article","NonPeerReviewed"],"fullText":"doi:10.1016\/j.bulm.2004.03.003\nBulletin of Mathematical Biology (2004) 66, 595–603\nBulletin of Mathematical Biology—Facts, Figures and\nComparisons\u0001\nPHILIP K. MAINI†, SANTIAGO SCHNELL‡∗† AND SARA JOLLIFFE\nCentre for Mathematical Biology,\nMathematical Institute,\n24-29 St Giles’,\nOxford OX1 3LB,\nUK\nE-mail: bmb@maths.ox.ac.uk\nThe Society for Mathematical Biology (SMB) owns the Bulletin of Mathematical\nBiology (BMB). This is an international journal devoted to the interface of mathe-\nmatics and biology. At the 2003 SMB annual meeting in Dundee the Society asked\nthe editor of the BMB to produce an analysis of impact factor, subject matter of\npapers, submission rates etc. Other members of the society were interested in the\nhandling times of articles and wanted comparisons with other (appropriate) jour-\nnals. In this article we present a brief history of the journal and report on how the\njournal impact factor has grown substantially in the last few years. We also present\nan analysis of subject areas of published papers over the past two years. We finally\npresent data on times from receipt of paper to acceptance, acceptance to print (and\nto online publication) and compare these data with some other journals.\nc© 2004 Society for Mathematical Biology. Published by Elsevier Ltd. All rights\nreserved.\nHISTORY OF THE BULLETIN\nThe BMB was first published in March 1939 with the title Bulletin of Mathe-\nmatical Biophysics as a supplement to the journal Psychometrika. The Bulletin\nwas published in March, June, September and December and was devoted to pub-\nlications of research in mathematical biophysics, as contributing to the physico-\nmathematical foundations of biology. The papers covered physico-mathematical\ntheories as well as any other mathematical treatments of biological phenomena,\nwith the exception of purely statistical studies or papers dealing with empirical\n\u0001This is an expanded version of a report published in the Society for Mathematical Biology\nNewsletter, Volume 16, Number 3, pp. 9–12, 2003.\n†These authors contributed equally.\n‡Also at: Christ Church, Oxford OXI 1DP, UK.\n∗Author to whom correspondence should be addressed. E-mail: schnell@maths.ox.ac.uk\n0092-8240\/04\/040595 + 09 $30.00\/0 c© 2004 Society for Mathematical Biology. Published by\nElsevier Ltd. All rights reserved.\n596 P. K. Maini et al.\nequations. Description of experimental work also fell within the scope of the Bul-\nletin provided that it made close comparison with the mathematical formulations\ndeveloped in the same paper (Rashevsky, 1939). The Bulletin was sent free to all\nmembers of the Psychometric Society.\nThe Bulletin of Mathematical Biophysics was founded by Dr Nicolas Rashevsky,\nwho is generally recognised as the founder of the first organised group in Math-\nematical Biology in the world. This group had been formed at the University of\nChicago in 1947 as the interdisciplinary Committee on Mathematical Biology from\nthe previous one on Mathematical Biophysics. The latter had been founded by\nRashevsky in 1934 after obtaining a Rockefeller Fellowship on the basis of his\nmany investigations of the mathematics of biological phenomena, in particular the\neffects of surface tension and diffusion drag forces during cell division, and nerve\nexcitation (Bartholomay et al., 1972; Rosen, 1972).\nThe Bulletin of Mathematical Biophysics quickly became the classical journal in\ngeneral mathematical biology and served as the principal natural publication outlet\nfor the majority of mathematical biologists. Many classical papers have appeared\nin the Bulletin and several of these are familiar to biologists. It has become an\nimportant avenue for the exchange and transmission of new ideas and approaches to\nbiological problems and incorporates both the quantitative and qualitative aspects\nof mathematical models and characterisations of biological processes and systems.\nDr Rashevsky remained the editor of the Bulletin of Mathematical Biophysics\nuntil his death on January 16th, 1972. During the last year of his life he founded\nMathematical Biology, Inc. which became the publisher of the Bulletin. Dr Rashev-\nsky owned Mathematical Biology, Inc. and acquired the ownership of the Bulletin\nas well. In June 1972, Volume 34, Number 2, he was succeeded by Herbert D.\nLandahl from University of California at San Francisco (Chief Editor), and George\nKarreman from University of Pennsylvania and Anthony F. Bartholomay from the\nMedical College of Ohio at Toledo working as co-editors.\nIn February–April 1973, Volume 35, Numbers 1–2, the Bulletin of Mathematical\nBiophysics was re-titled the Bulletin of Mathematical Biology and became the offi-\ncial journal of the recently incorporated Society for Mathematical Biology of which\nDr Landahl was a co-founder [see, Conrad (1996), for a History of the Society].\nThe BMB continued to be published bi-monthly and the editorial policy remained\nthe same as that of its predecessor, the Bulletin of Mathematical Biophysics. The\nannual dues for membership of the Society for Mathematical Biology were $25\nwhich included a subscription to the Bulletin. Herbert D. Landahl continued as\nChief Editor with Hugo M. Martinez as Assistant Editor until Volume 43, Num-\nber 6, 1981. Hugo Martinez took over as Chief Editor in Volume 44, Number 1,\n1982 with Julie S. Ransom (The University of California, San Francisco) as Edi-\ntorial Assistant. They retired in 1986, Volume 48, No. 3\/4. Lee A. Segel from\nthe Weizmann Institute of Science, Israel, became the first non-American editor of\nthe Bulletin in Volume 48, No. 5\/6, 1986. Lee Segel in his Editorial Announce-\nment of Volume 49, No. 1, pp. i–iv, 1987 changed the scope of the journal to offer\nBulletin of Mathematical Biology 597\nthe publication of research at or near the interface of theoretical and experimen-\ntal biology. An ideal article for the Bulletin would be a symbiotic combination of\ntheory and experiment. Lee Segel also welcomed papers providing documentation\nof a purely theoretical advance together with a clear exposition of how this advance\nfurthers biological understanding. Philip K. Maini became the present editor in\n2002, Volume 64, Number 1. As he mentioned in his Editorial (Volume 64, No. 1,\np. 1), he took over as editor of the Bulletin at a very exciting time for mathemati-\ncal biology. The advances made in molecular biology over the past three decades\nhave resulted in the generation of a vast amount of experimental data. The need\nto understand this data requires the development and analysis of mathematical and\ncomputational models; this is increasingly recognised as a number of interdisci-\nplinary centres have recently been set up for modelling in life sciences and more\nfaculty positions are being advertised. This also confirms the great insight shown\nby those who set up and worked as editors for this particular journal, and it is\nreflected in the present position of the BMB in the Journal Citation Reports.\nJOURNAL CITATION REPORTS\nThe Journal Citation Reports (JCR) is a comprehensive resource for journal eval-\nuation from the Institute of Scientific Information (ISI)∗. It is used by scientists,\nuniversities, research institutes, publishers and government to evaluate the impact\nof journals in the scientific community, and also to select preferred journals in\nwhich to publish. The JCR lists the highest impact journals, most frequently used\njournals, ‘hottest’ journals and largest journals. It uses citation data drawn from\nover 8400 scholarly and technical journals worldwide and the citations are col-\nlected from 1981. Coverage is both multidisciplinary and international, and incor-\nporates journals from over 3000 publishers in 60 countries.\nThe most widely used index from JCR is the journal impact factor, which is a\nmeasure of the frequency with which the ‘average article’ in a journal has been\ncited in a particular year. The impact factor is calculated by dividing the number of\ncurrent citations to articles published in the two previous years by the total number\nof articles published in the two previous years. This index helps to evaluate a\njournal’s relative importance, especially when compared to others in the same field.\nIn this report we show the JCR results for the BMB in the year 2002.\nThe trends in the impact factor show that the BMB has increased its impact from\n0.980 in the year 1997 to 1.408 in 2002. In fact, the impact has been increasing\nfrom 2000 when it was 1.002 and 1.316 in 2001. The JCR gathers journals into\nsubject categories for comparison with journals in the same field. The Bulletin\n∗ISI Journal Citation Report\u0001 is a product of the Thomson Corporation (http:\/\/www.isinet.com).\nIt is delivered via Journal Citation Reports\u0001 on the Web (http:\/\/jcrweb.com) or via CD-ROM. The\nWeb service for UK Education is http:\/\/wok.mimas.ac.uk.\n598 P. K. Maini et al.\nTable 1. 2002 JCR statistics for mathematical journals with interdisciplinary applications\nto biology and medicine.\nRank Abbreviated 2002 Impact Immediacy 2002 Cited\njournal title total cites factor index articles half life\n1 Bull. Math. Biol. 974 1.408 0.178 45 8.3\n2 Math. Biosci. 1609 1.080 0.141 71 >10.0\n3 Biometrics 7469 1.077 0.115 96 >10.0\n4 J. Math. Biol. 1219 0.980 0.283 53 >10.0\n5 Biometrika 6742 0.970 0.117 77 >10.0\n6 IMA J. Math. Appl. Med. Biol. 215 0.658 0.333 3 7.5\n7 Biometrical J. 287 0.250 0.071 70 8.0\nis in two subject categories: ‘Mathematics (Interdisciplinary Applications)’ and\n‘Biology (General)’.\nIn the subject category ‘Mathematics (Interdisciplinary Applications)’, the BMB\nis ranked 7th in a list containing 30 journals, if the list is sorted by the impact\nfactor. The top journals are Econometrica (2.737), Journal of Computational Neu-\nroscience (1.855), Educational and Psychological Measurement (1.661), Journal\nof Mathematical Psychology (1.641), Archive for Rational Mechanics and Analy-\nsis (1.585). However, these journals are not strictly mathematical biology journals.\nThe BMB is the top mathematical journal with interdisciplinary applications to\nbiology and medicine. We show this in Table 1.\nIn the subject category ‘Biology (General)’, the BMB is ranked by impact factor\nin 21st position out of 62 general biology journals. The top journal on this cate-\ngory is Bioessays (7.888), followed by FASEB Journal (7.252), Biological Reviews\n(5.730), Quarterly Review of Biology (5.200), Philosophical Transactions of the\nRoyal Society of London Series B—Biological Sciences (3.410). There are only two\njournals above the BMB which accept mathematical biology papers (see Table 2),\nthese are the Proceedings of the Royal Society of London Series B—Biological\nSciences (3.396), now known as Proceedings: Biological Sciences, and the Journal\nof Theoretical Biology (1.552).\nNote that in Tables 1 and 2 we show other indices. Citation and article counts\nare important indicators of how frequently current researchers are using individ-\nual journals. By tabulating and aggregating citation and article counts, we can\ngain another perspective for journal evaluation and comparison. Citation counts\nacknowledge previously published research, publicly recorded in the references\nlisted by contemporary authors. This is measured by the 2002 total cites column\nin the ranking tables. It indicates the total number of times that each journal has\nbeen cited by all journals included in the ISI database during the period 1981–2002.\nThe 2002 articles column shows the number of articles published in each jour-\nnal in 2002. In this index, editorials, letters and meeting abstracts are not included.\nThe journal immediacy index is a measure of how quickly the ‘average article’ in\nBulletin of Mathematical Biology 599\nTable 2. 2002 JCR Statistics for general biology journals publishing mathematical biology\npapers.\nRank Abbreviated 2002 Impact Immediacy 2002 Cited\njournal title total cites factor index articles half life\n1 Proc. R. Soc. Lond. B Biol. 12798 3.396 0.478 347 6.0\n2 J. Theor. Biol. 7501 1.552 0.273 238 >10.0\n3 Bull. Math. Biol. 974 1.408 0.178 45 8.3\n4 Math. Biosci. 1609 1.080 0.141 71 >10.0\n5 Biometrics 7469 1.077 0.115 96 >10.0\n6 J. Math. Biol. 1219 0.980 0.283 53 >10.0\n7 Biometrika 6742 0.970 0.117 77 >10.0\n8 Biosystems 806 0.846 0.112 80 6.5\n9 Comput. Biol. Med. 430 0.814 0.125 40 7.7\n10 Theor. Biosci. 78 0.705 0.167 12\n11 IMA J. Math. Appl. Med. Biol. 215 0.658 0.333 3 7.5\n12 C. R. Acad. Sci. III—Vie.a 1842 0.528 0 9.4\n13 Acta Biotheor. 264 0.522 0.000 13 >10.0\n14 J. Biol. Syst. 98 0.282 0.000 26\n15 Riv. Biol.–Biol. Forum 72 0.220 0.083 12\na Statistics are incomplete because the journal was re-titled Comptes Rendus Biologies\nin 2002.\na journal is cited. The immediacy index indicates how often articles published in\na journal are cited within the same year. It is calculated by dividing the number of\ncitations to articles published in a given year by the number of articles published in\nthat year. The immediacy index is useful for comparing how quickly journals are\ncited. This index tends to discount the advantage of large journals over small ones,\nbecause it uses a per-article average. However, frequently issued journals have an\nadvantage, because an article published early in the year has a better chance of\nbeing cited than one published later in the year. For comparing journals specialis-\ning in cutting-edge research, the Immediacy Index can provide a useful perspective.\nThe cited half-life is the number of publication years from the current year which\naccounts for 50% of current citations received. This index evaluates the age of the\nmajority of cited articles published in a journal. Only those journals cited 100 or\nmore times have a cited half-life in the database. A higher or lower cited half-\nlife does not imply any particular value for a journal. For instance, a primary\nresearch journal might have a longer cited half-life than a journal that provides\nrapid communication of current information.\nJOURNALS CITING ARTICLES PUBLISHED IN BMB\nThe JCR also identifies those publications that most frequently cited a particular\njournal. These citation links can reveal a journal’s subject orientation, point to its\n600 P. K. Maini et al.\nTable 3. Number of citations to articles published in the Bulletin between 1981 and 2002.\nThe table shows the citing journals and their rank.\nRank Citing journal(s) Number of\narticles cited\n1 J. Theor. Biol. 41\n2 Phys. Rev. E 32\n3 Bull. Math. Biol.; Math. Comput. Model 24\n4 J. Math. Biol. 22\n5 Biosystems 18\n6 Proc. Natl. Acad. Sci. USA 16\n7 Bioinformatics; IMA V. Math. 15\n9 Ecol. Model. 14\n10 J. Comput. Biol. 12\n11 Biophys. J. 11\n12 Int. J. Bifurcat. Chaos; Network-Comp. Neural; SIAM Rev.;\nZ. Phys. Chem. 10\n13 Am. Nat. Indian J. Pure. Appl. Math.; Lect. Notes. Comput. Sci.;\nPhysica A 9\n14 Ecology 8\n15 Appl. Math. Comput.; Chaos, Solitons Fract.; Math. Biosci.; Math.\nModel Meth. Appl. Sci.; Nature; Neurocomputing; Proc. R. Soc. Lond.\nB Biol.; Physica D; Theor. Comput. Sci. 7\n16 Bioessays, Int. J. Eng. Sci.; J. Comput. Syst. Sci.; Theor. Popul. Biol. 6\n17 All others (351 journals) 5 or less\nTotal 974\nclosest peer or competitor publications, and describe speciality-specific networks\nof journals. The BMB has received 974 citations between 1981 and 2002. The jour-\nnal citing most articles in the BMB is the Journal of Theoretical Biology with 41\nreferences to the Bulletin. It is followed by Physical Review E citing articles 32\ntimes in the BMB. These two journals are followed by Bulletin of Mathematical\nBiology and Mathematical and Computer Models (24 citations each), Journal of\nMathematical Biology (22 citations), Biosystems (18 citations) and Proceedings of\nthe Natural Academy of Sciences of USA (16 citations). We summarise number of\ncitations to articles published in the Bulletin between 1981 and 2002 in Table 3.\nIn Table 3, we show the ranking of 33 journals. The other 351 journals cite the\nBulletin five or less times, among these we can find Trends in Ecology and Evolu-\ntion, Nucleic Acid Research, Physical Review Letters, Annual Review of Genomics\nand Human Genetics, Behavioural and Brain Science, Journal of Biological Chem-\nistry, Journal of Molecular Biology, AIDS, Diabetes, Genome Research, Journal of\nNeuroscience, Journal of Virology, Neuroimage and Systematic Biology.\nThis shows that the BMB is making an impact in the experimental community\nas well as in the theoretical community. However, it is vital that we do not become\ncomplacent. We must continue to increase the awareness among our experimental\ncolleagues of articles in the BMB.\nBulletin of Mathematical Biology 601\n2002\n2003\nN\num\nbe\nr o\nf p\nap\ner\ns \n(cu\nmm\nula\ntiv\ne %\n)\nWeeks for first decision\n0 4 8 12 16 20 24 28 32 36 40\n0\n25\n50\n75\n100\nFigure 1. Cumulative percentage of submitted papers versus weeks taken to made the first\neditorial decision.\n2002–2003 STATISTICS FOR THE BULLETIN OF MATHEMATICAL\nBIOLOGY\nWe have carried out an analysis for the data available in the editorial office up to\nJanuary 31st, 2004. For the year 2002, the total number of papers submitted was\n114. From those, 66 were accepted, 45 rejected and 3 are outstanding. The median\ntime in weeks for the first decision from the editorial office is 14 weeks (mean time\nis 14.8 weeks) for the papers submitted in 2002.\nFor the year 2003, the total papers submitted were 143. The Bulletin accepted\n47 papers, rejected 46 and 50 are outstanding. We analyse the time in weeks for\nthe first decision from the editorial office for 118 papers. The median is 11 weeks\n(mean time is 12.4 weeks). In 2003 there was an improvement in the median\nresponse time which is due to new measures taken by the editorial office to improve\nthe processing of the papers. This is clearly illustrated in Fig. 1.\nThe subject of published papers in 2002 and 2003 remained almost homogeneous\nwith the exception of the ‘Physiology’ and ‘Computational Biology and Bioinfor-\nmatics’ categories. The number of ‘Physiology’ papers decreased in 2003 and\nthe number of ‘Computational Biology and Bioinformatics’ papers increased (see\nFig. 2).\n2003 PUBLICATION BACKLOG OF MATHEMATICAL BIOLOGY JOURNALS\nWe have estimated the publication backlog in a number of journals of choice for\nmathematical biologists, focusing on: Journal of theoretical Biology, Bulletin of\nMathematical Biology, Mathematical Biosciences, Journal of Mathematical Biol-\nogy and Mathematical Medicine and Biology—A Journal of the IMA, formerly\nknown as IMA Journal of Mathematics Applied in Medicine and Biology.\n602 P. K. Maini et al.\nO\nth\ner\ns\nD\nev\n. B\nio\nl.\nEc\nol\nog\ny\nEp\nid\nem\nio\nlo\ngy\nIm\nm\nun\nol\nog\ny\nM\nol\n. B\nio\nl.\nM\nor\nph\nol\nog\ny\nN\neu\nro\nbi\nol\nog\ny\nPh\nar\nm\nac\nol\nog\ny\nPh\nys\nio\nlo\ngy\nPo\npu\n. B\nio\nl.\nCo\nm\npu\nt. \nBi\nol\n. &\nBi\noi\nnf\nor\nm\n.\n2003\n2002\nPu\nbl\nish\ned\n a\nrti\ncle\ns \n(%\n)\n0\n5\n10\n15\n20\n25\nFigure 2. Percentage published articles for the years 2002 and 2003 in subject categories.\nThe source of our data is the relevant journal Website with the exception of Jour-\nnal of Mathematical Biology. We have calculated for papers published in 2003 the\nnumber of days between received and acceptance dates, acceptance to print and\nacceptance to online publication, based on a 360-day year (twelve 30-day months).\nThe data for the Journal of Mathematical Biology were obtained from ‘Backlog of\nMathematics Research Journals’ published in the Notices of the AMS, Volume 50,\nNumber 8—September 2003, pp. 961–964.\nFrom Table 4, we observe that the Bulletin of Mathematical Biology is the peri-\nodical which was quickest to publish a paper. The median time from received to\nprint is 11.2 months (336.5 days). The Bulletin is followed very closely by the\nJournal of Theoretical Biology with a median time from received to print of 12.2\nmonths (366 days). They are followed by Mathematical Biosciences, which has a\nmedian (printed) publication time of 13.7 months (411 days). We calculated the\nreceived to print times for Medicine and Biology—A Journal of the IMA from the\n2003 printed version of the journal. We obtained a median time of 11.3 months\n(340 days), which is very similar to that for the Bulletin.\nCONCLUSIONS\nIt is important to view the above data in context. For example, there has been a\n25% increase in the number of papers submitted to the Bulletin from 2002 to 2003.\nIt remains to be seen whether this is a statistical blip, or whether it reflects the\nincrease in research in the field. The most striking feature of Fig. 2 is the increase in\nthe number of papers in computational biology and bioinformatics, as a percentage\nof the total accepted papers.\nBulletin of Mathematical Biology 603\nTable 4. Publication backlog for mathematical biology journals for papers published in\n2003.\nJournal Issues Approximate 2003 Median time (in months) from:\nper year pages per year Received Acceptance Acceptance to Received\nacceptance to print online publication print\nBull. Math. Biol. 6 1174 6.9 4.4 2.9 11.2\nJ. Theor. Biol. 24 3389 6.5 5.5 3.3 12.2\nMath. Biosci. 12 1324 9.2 4.6 2.4 13.7\nJ. Math. Biol. 12 1152 10.8 6.8 4.7 15.1a\nMath. Med. Biol.b 4 378 NA NA NA 11.3\nNA: not available from Website or printed journal.\na Editor’s estimate for papers to be published in 2003 obtained from ‘Backlog of Mathematics\nResearch Journals’ published in the Notices of the AMS, Volume 50, Number 8—September\n2003, pp. 961–964.\nb Formerly known as IMA J. Math. Appl. Med. and Biol.\nThe data on processing times presented in Table 4 must also be taken in context.\nFor example, many biological journals have substantially quicker turn-round times,\nmainly because reviewers are not expected to redo the experiments presented in the\npaper. One would expect that the more mathematical a journal is, the longer it will\ntake to review because the reviewer is expected to work through at least some of\nthe mathematics (see ‘Backlog of Mathematics Research Journals’ published in\nthe Notices of the AMS, Vol. 50, Number 8—September 2003, pp. 961–964, which\nshows that some mathematics journals can take up to 28.2 months from received to\nprint). The ‘Received to accepted’ data only partly reflect the journal’s efficiency,\nas they depend also on the time taken for the authors to revise their manuscript.\nOne thing that is clear is the steady increase in impact factor of the journal. This\nis very exciting and bodes well for the future of the journal.\nACKNOWLEDGEMENTS\nWe would like to thank Edmund Crampin, Lov Gross and Ramit Mehr for helpful\ncomments.\nREFERENCES\nBartholomay, A. F., G. Karreman and H. D. Landahl (1972). Obituary of Nicolas\nRashevsky. Bull. Math. Biophys. 34.\nConrad, M. (1996). Childhood, boyhood, youth. Soc. Math. Biol. Newsletter 9, 8–9.\nRashevsky, N. (1939). Editorial. Bull. Math. Biophys. 1.\nRosen, R (1972). Nicolas Rashevskay 1899–1972. Prog. Theor. Biol. 2, xi–xiv.\nReceived 24 March 2004 and accepted 24 March 2004\n.\n"}