{"doi":"10.1103\/PhysRevC.74.034312","coreId":"100633","oai":"oai:epubs.surrey.ac.uk:27","identifiers":["oai:epubs.surrey.ac.uk:27","10.1103\/PhysRevC.74.034312"],"title":"Excited state halos in <sup>10<\/sup>Be","authors":["Al-Khalili, Jim","Arai, Koji"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-09-13","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:27<\/identifier><datestamp>\n      2017-10-31T13:56:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/27\/<\/dc:relation><dc:title>\n        Excited state halos in <sup>10<\/sup>Be<\/dc:title><dc:creator>\n        Al-Khalili, Jim<\/dc:creator><dc:creator>\n        Arai, Koji<\/dc:creator><dc:date>\n        2006-09-13<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/27\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Al-Khalili, Jim and Arai, Koji  (2006) Excited state halos in 10Be   Physical Review C, 74 (034312).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.74.034312<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/27\/","10.1103\/PhysRevC.74.034312"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C 74, 034312 (2006)\nExcited state halos in 10Be\nJim Al-Khalili1 and Koji Arai2\n1Department of Physics, University of Surrey, Guildford GU2 7XH, United Kingdom\n2Division of General Education, Nagaoka National College of Technology, 888 Nishikatakai, Nagaoka, Niigata 940-8532, Japan\n(Received 19 July 2005; published 13 September 2006)\nThe structure of certain bound excited states in 10Be have been shown to have exotic features because of\ntheir weak binding and cluster-like configurations. In this article, we investigate E1 and E2 transitions between\nthese states and compare the findings with recent experimental results. We compare the predictions of two types\nof structure calculations: a microscopic multicluster model and an ab initio no-core shell model. Both predict\nvery similar transition strengths. By considering the relative contributions from the various matrix elements\ncontributing to the transitions arising from the coupling of different 9Be×n configurations in the wave functions\nmaking up the states, we conclude that the very weak B(E1; 2− → 2+1 ) can only be understood if the 2− state\n(with a separation energy of its predominantly 1s1\/2 neutron of just 0.548 MeV) is a clear halo state. Other nearby\nstates, such as the 2+2 , do not exhibit a clear halo signature because of the less than clean decoupling into the\nwell-defined 9Be core plus halo neutron.\nDOI: 10.1103\/PhysRevC.74.034312 PACS number(s): 21.60.Gx, 23.20.−g, 27.20.+n\nI. INTRODUCTION\nOver the past few decades, a number of neutron-rich nuclei\nhave been discovered to have a ground state structure with\nan extended spatial distribution due to the long range tail in\nthe wave function of the last one or two valence neutrons, a\nphenomenon known as the “neutron halo”. The best-known\none-neutron halo nucleus is 11Be whose 12\n+ ground state is\ndue to the presence of an intruder state from the sd shell, the\nvalence neutron occupying the 1s1\/2 orbit rather than the 0p1\/2\nas would be expected from a simple shell model description. In\nthis ground state, the neutron is bound by just 0.5 MeV (with\nthe 12\n−\nexcited state 0.32 MeV above it and even closer to\nthe 10Be+n threshold). Other one-neutron halo nuclei include\n15C and 19C and there are also two-neutron halo (Borromean)\nnuclei such as 6He, 11Li, and 14Be. In this article, we investigate\nthe properties of certain excited states of 10Be to see if they\nqualify as excited state halos.\nThe field of halo nuclei has generated much excitement\nand hundreds of papers over the past two decades since their\ndiscovery in the 1980s (see the reviews [1–4] for background\non the field) after the experimental determination of large E1\ntransitions in 11Be [5] and large interaction cross sections in\nneutron-rich lithium and helium isotopes [6,7]. The “halo”\nis essentially a threshold effect arising from the very weak\nbinding of the last one or two valence nucleons (usually\nneutrons) to, and decoupling from, a well-defined relatively\ninert core containing all the other nucleons. Textbook quantum\nmechanics states that a weakly bound nucleon in a short-range\nnuclear potential can tunnel out to a volume well beyond the\nrange of the potential (assuming in this case that the core is\nrelatively compact). The accepted definition of a halo nucleus\nis thus that the halo neutrons have more than 50% of their\nprobability density outside the range of the core potential that\nbinds them. In such an open structure it is not surprising\nthat shell model and mean field approaches breakdown and\nthat few-body cluster models of core plus valence particles\ncan account for the most general properties of these nuclei,\nsuch as their large matter radii.\nIn addition to the decoupling of core and valence particles\nand their small separation energy, the other important criterion\nfor the formation of a halo is that the valence particle must\nbe in a low orbital angular momentum state relative to the\ncore, preferably an s wave, since higher \u0001 values give rise\nto a confining centrifugal barrier. Indeed, it is the additional\nconfining Coulomb barrier that explains why proton halos are\nnot so spatially extended as neutron halos.\nThe study of excited state halos is difficult because of their\nvery short lifetimes, and one must resort to searching for them\nas products of reactions or decays. To date, the only clear\nexample of an excited halo state is the proton halo in the 12\n+\nexcited state of 17F. What is surprising is that no analogous\nneutron halo state has been confirmed despite the view that\nsuch states should be rather common in light nuclei.\nIn this article we first review the evidence, both theoretical\nand experimental, for the existence of neutron halo states\nin one or more excited states of 10Be. We then provide\nfurther supporting evidence for this by comparing E1 and\nE2 transitions between some of these states and show that\ntheir strengths can only be understood if we take into account\nexotic structures, both halo and molecular states.\nIt is well-known that 9Be has a good α + α + n structure\nwith a ground state three-body separation energy of just\n1.6 MeV. However, by adding one extra neutron to make\n10Be the binding is increased to a 9Be+n separation energy of\n6.8 MeV. This gives the ground and first excited states (0+1 , 2+1 )\nreasonably good shell-model-like structure. However, the\nmore interesting cluster structure returns for the group of four\nbound excited states of 10Be (2+2 , 1−, 0+2 , and 2−) concentrated\nwithin 0.3 MeV just below the 9Be+n threshold. A number\nof recent studies (see next section) have suggested that these\nstates have exotic molecular-like (6He+α) structures.\nThe question we address in this article is whether the 2+2 and\n2− states, in particular, have a structure that can be considered\n0556-2813\/2006\/74(3)\/034312(7) 034312-1 ©2006 The American Physical Society\nJIM AL-KHALILI AND KOJI ARAI PHYSICAL REVIEW C 74, 034312 (2006)\nmolecular-like, halo-like, or some exotic combination of the\ntwo: a single halo neutron weakly bound to a molecular-like\n9Be core. In the next section we briefly examine experimental\nevidence for such unusual structures and review several\ntheoretical attempts to model these states. In Sec. III, we lay\nout the formalism for the B(E1) transition strength between\ntwo states, each made up of a sum of different single-particle\nconfigurations. Then, in Sec. IV and V, the values obtained are\ncompared with those calculated within both the no-core shell\nmodel and a four-body cluster model. Finally, we summarize\nour results in Sec. VI.\nII. EVIDENCE FOR EXOTIC STATES IN 10Be\nA number of experimental results have suggested the\nexistence of possible molecular structures in 10Be arising\nfrom its 2α + 2n clustering [8–10]. In addition, a more recent\nexperiment at TRIUMF [11] provided accurate measurements\nof the lifetime of the 2− (6.264 MeV) state following the\nβnγ decay of the most famous halo nucleus, 11Li. The study\nsuggested that this state in 10Be can be populated through a\nrather novel pathway via 11Be∗ and that if so it would be a\nstrong candidate for halo-like structure involving a weakly\nbound neutron to a 9Be core. Since the 9Be+n breakup\nenergy is at 6.812 MeV, the 2− would have a valence neutron\nseparation energy of just 0.548 MeV.\nIt has been suggested previously [12] that the 2− state\nis halo-like, and knockout studies at MSU also back this\nup. In the one-neutron knockout reaction (11Be,10Be) it was\nsuggested [13] that the 2− is populated when a deeply bound\np3\/2 neutron is removed from the 10Be core of 11Be, leaving\nthe 1s1\/2 valence (halo) neutron intact. Indeed, what is most\ninteresting is that the 2− state in 10Be shows remarkable\nsimilarity at first glance to the 12\n+ ground state of 11Be. Both\nare dominated by a 1s1\/2 neutron bound to the rest of the\nnucleus (the core) by about 0.5 MeV.\nFew-body structure models assuming 10Be to be a four-\nbody system of α + α + n + n have suggested a molecular-\nlike structure for several of its bound excited states [14–18].\nThis would suggest that a shell model description is inappro-\npriate. Yet, more microscopic ab initio calculations have now\nreached a high level of sophistication. In particular, the no-core\nshell model (NCSM) [19,20] has been applied to the study of\nthe lighter Be isotopes, using model spaces up to 9h¯\u0005 [21,22].\nThe many-body NCSM calculation is performed with a version\nof the shell model code ANTOINE [23]. This approach predicts\nboth the positive and negative parity states in 10Be, in the\ncorrect order separately, but the three weakest bound states\n(1−, 0+2 , and 2−) are too high in excitation energy (and above\nthe 9Be+n threshold). This is possibly due to the model space\nneeding to be even larger, or the need for three-body NNN\nforces. The NCSM predicts the 0+2 intruder state to be up at\naround 9.5 MeV above the ground state. This state is dominated\nby a 2h¯\u0005 excitation of two p-shell neutrons into the 1s1\/2 orbit.\nThe inability of the NCSM to predict this state as bound is most\nlikely related to its problems predicting the 12\n+ intruder in 11Be\nto be its ground state.\n2-(6.263)\nExp.\n0+2(6.179)\n1-(5.961)\n2+2(5.958)\n2+1(3.368)\n0+1(0)\n0+2\n9Be+n\n2-\n1-\n2+2\n2+1\n0+1\nCalc.\n(6.812)\nFIG. 1. Energy spectrum for the bound states in 10Be. The\nexperimental levels are from Refs. [27,28] while the theoretical ones\nare from the microscopic cluster model [24].\nOne of the most successful models of the structure of\nexcited states of 10Be to date seems to be that based on the\nmicroscopic α + α + n + n four-cluster model according to\nthe resonating group method [24]. In this approach, all the\nnucleons are treated explicitly and two sets of four nucleons\n(2n+2p) are arranged in 0s clusters (the α particles) whose\nwave functions are taken to be simple shell model wave\nfunctions built up from 0s harmonic oscillator states. For 10Be,\nthe full four-body wave function is then constructed to satisfy\nthe Pauli principle for all the nucleons exactly, is free from any\nspurious center of mass motion, and has good total angular\nmomentum and parity. Henceforth, when we refer to MCM\ncalculations in this paper we mean the four-body microscopic\ncluster model of Ref [24].\nFigure 1 shows the energy spectrum for the bound states of\n10Be as predicted by the cluster model calculations against the\nexperimental values. The 9Be+n breakup energy is also shown\nsince all states above this threshold are particle unbound.\nTable I shows the predicted rms matter, proton, and neutron\nradii for several of these states from two cluster models: the\nMCM of [24] and a similar one (also assuming a four-body\nstructure) based on the stochastic variational method (SVM)\n[15]. It is clear from these values that the 2− state is much\nlarger in extent, due to the larger neutron distribution, hinting\nat the existence of a possible neutron halo.\nWe concern ourselves in this article with the electromag-\nnetic transitions between four of these states: 0+1 , 2\n+\n1 , 2\n+\n2 , and\n2−. The reason for this is the suggestion, from the recent\nTRIUMF-ISAC experiment on the β decay of 11Li [11], and\nsubsequent interpretation, that both the 2+2 and 2− states in\n10Be are halo-like. It was suggested in that work [11] that\nthese two states are the end products of the β decay of 11Li to\nthe halo-like continuum state in 11Be (8.81 MeV), which has\na 9Be+2n cluster structure, followed by the subsequent decay\n034312-2\nEXCITED STATE HALOS IN 10Be PHYSICAL REVIEW C 74, 034312 (2006)\nTABLE I. The rms matter, proton, and neutron radii for several of\nthe bound states in 10Be as predicted by the four-body cluster model\nbased on the resonating group method (RGM) [24]. The values in\nbrackets are those calculated by the stochastic variational method\n(SVM) of Ref. [15], which also assumes a four-body cluster model.\nState in 10Be rms radius (fm)\nrm rp rn\n0+1 2.20 (2.28) 2.08 (2.17) 2.28 (2.35)\n2+1 2.17 (2.41) 2.05 (2.25) 2.25 (2.51)\n2+2 2.36 (2.58) 2.17 (2.36) 2.49 (2.72)\n2− 2.90 (3.17) 2.32 (2.50) 3.24 (3.50)\nof one of the two halo neutrons, leaving the remaining neutron\nintact in a halo configuration in 10Be. This result has been\npartially brought into question by another recent experimental\nresult (also from TRIUMF) [25] that claims that the neutron\ndecay pathway from the 8.81-MeV state in 11Be is to the\n2−state and, possibly, the higher (and particle unbound) 3−\nstate, but not to the 2+2 state.\nOf interest in this article is the fact that the half-life\nmeasurement of the 2− state of T1\/2 = 85 ± 12 fs corresponds\nto the very small experimental value of B(E1; 2− → 2+1 ) =\n7.7 × 10−4 W.u. Furthermore, surprisingly no γ transition\nis seen between the 2− and 2+2 states. Of course, because\nthe second 2+ is an order of magnitude closer in energy to\nthe 2− than the first one, there is a factor of three orders of\nmagnitude on the lifetime for this E1 transition. It is therefore\nnot surprising that the 2− → 2+2 transition is not seen because\nthe 2− → 2+1 happens much more quickly. But this tells us\nnothing about any differences in the structure of these states\nentering into the transition matrix elements.\nTo understand whether these very small B(E1) values\nare to be expected we look here more closely at possible\ncluster structures of these states in 10Be and whether we can\nunderstand why these transitions are so weak. In particular,\nwe compare with the very large B(E1) transition between\nthe two bound states in the neighboring 11Be. In all three\ncases [B(E1; 2− → 2+1 ) and B(E1; 2− → 2+2 ) in 10Be and\nB(E1; 12\n− → 12\n+\n1 ) in 11Be], the transition is a pure single-\nparticle one involving the valence neutron between the sd and\np shells. We will see that the 9,10Be × n configurations that\ndescribe these states involve initial and final core states of the\nsame parity, but neutrons in different parity states. Because E1\ntransitions require a change in parity they cannot proceed via a\ncollective excitation within the core and the analysis becomes\nmuch simpler.\nIII. FORMALIZM FOR E1 TRANSITIONS\nWe model the 10Be states as a sum of 9Be × n configurations\nand write the wave function in the state Jπ as\n\u0007J\nπM =\n∑\nα\nCα\n[\n\b9(Iπα ) × φj\n]\nJM\n, (1)\nwhere \b9(Iπα ) is the wave function of 9Be in state Iπα and φj\nis the 9Be-n cluster wave function. In the four-body cluster\nmodel of Ref. [24], the 9Be intrinsic wave function is itself a\nthree-body (α + α + n) cluster one, but we need not concern\nourself with its details here since the E1 transitions will only\ninvolve the neutron-core relative wave functions.\nThe E1 transition strength, from initial state |Jπ1 M1〉 to\nfinal state |Jπ2 M2〉 is defined as\nB\n(\nE1; Jπ1 → Jπ2\n) = ∑\nµ,M2\n|〈J2M2| ˆO1µ(E1)|J1M1〉|2, (2)\nwhere the electric transition operator ˆO1µ(E1) is\nˆO1µ(E1) =\nZ∑\ni=1\neriY1µ(rˆi). (3)\nBecause the valence particle in our model is a neutron, only\nthe core contributes to electric transitions. One can therefore\nderive an expression for the transition operator involving a\nsum of two terms: one involving a collective excitation of the\ncore and the other involving the core recoil as a function of the\ncore-neutron separation vector \u0005r . The latter will be the term that\ncouples the different core-neutron cluster wave functions,φ(\u0005r),\nand can be regarded as the single-particle transition with the\ndifference that the initial and final state wave functions that are\ncoupled are relative wave functions between the neutron and\nthe core. For light systems this distinction involves important\ncore recoil effects that are taken into account here. It is then\nstraightforward to show that\nˆO1µ(E1) =\nZ∑\ni=1\n(\nexiY1µ(xˆi) − e r\nA\nY1µ(rˆ)\n)\n= ˆOcore1µ (E1) −\nZ\nA\ne r Y1µ(rˆ). (4)\nSubstituting for the operator into Eq. (2) it is clear that, for\nthe states of interest here, the first term will not contribute to\nthe matrix element because E1 transitions require an overall\nchange in parity and for this to be caused by a change in\nthe state of the 9Be core requires the parity of the core-neutron\nwave function to be unchanged. However, as mentioned earlier,\nthe transitions we consider are all between states involving the\nvalence neutron moving between the sd shell and the p shell.\nSubstituting for the initial and final state wave functions,\nas defined in Eq. (1), into the matrix element in Eq. (2), it is\nthen straightforward to work through the angular momentum\nalgebra to obtained the well-known expression\nB(E1; Jπ1 → Jπ2 ) =\n3\n4π\n(\nZ\nA\n)2\n×\n[∑\nα,α′\nCαCα′ ˆJ1 ˆJ2δI1,I2\n(\nj1\n1\n2\n10|j2 12\n)\n×\n{\nj1 I1 J1\nJ2 1 j2\n}\n〈r〉\n]2\ne2fm2, (5)\nwhere Cα and Cα′ are amplitudes associated with the different\nconfigurations that make up each of the initial and final states.\nWe will associate these quantities with spectroscopic factors\n034312-3\nJIM AL-KHALILI AND KOJI ARAI PHYSICAL REVIEW C 74, 034312 (2006)\nobtained from the four-body RGM model calculations [24].\nNote that δI1,I2 ensures that only core states with the same\nangular momentum can be coupled because the transition only\ntakes place because of coupling the different relative core-\nneutron states (with angular momentum j1 and j2. The overlap\nintegral 〈r〉 is between different relative radial wave functions\nof the core-neutron system,\n〈r〉 =\n∫ ∞\n0\nr3 drun1\u00011 (r)un2\u00012 (r). (6)\nNote that while the expression in Eq. (5) gives the B(E1)\nstrength in units of e2fm2, we quote values in the more\ntraditional Weisskopf units.\nThe above radial wave functions are calculated assuming\nWood-Saxon interactions between the neutron and 9Be core\nwith depths chosen to give the correct neutron separation\nenergy. As was pointed out many years ago [5], the use\nof harmonic-oscillator wave functions for the neutrons is\ninappropriate for such weakly bound states and leads to\nan underestimation of the transition strength because of the\nimportance of the long-range behavior in the overlap intergal\nthat is not picked up unless realistic wave functions are used.\nIt is clear from the summation in Eq. (5) that the overall\ntransition strength arises from a coherent sum of all allowed\nmatrix elements coupling the different configurations. It is\nwell-known that this can lead to important cancellation effects\nfrom matrix elements of opposite signs. A factor missing from\nthis expression, however, is a spatial mismatch factor due to\nthe overlap of different looking 9Be core wave functions. Thus,\nwhile the intial and final core states must have the same angular\nmomentum, their spatial distributions can differ because of\ndifferent clusterization effects. This would lead to one-body\ntransition densities less than unity if different looking core\nstates (with the same quantum numbers) are coupled. This\neffect has been discussed [26] in the context of the knockout\nreaction (12Be,11Be) in which the surviving weakly bound or\nunbound 11Be state following neutron removal differs spatially\nfrom the more tightly bound (and hence more compact) initial\n11Be state within the bound 12Be projectile.\nAn alternative qualitative description of this core effect is\nto say that a deformed, or polarized, core will present to the\nvalence neutron a modified binding potential, which in turn\nwill affect the shape of the radial wave function in either the\ninitial or the final states in the overlap integral of Eq. (6). In\nparticular, if a wave function has a node (such as that involving\nneutrons in the sd shell) then the geometry of the potential will\naffect the position of the node and possibly have a dramatic\ncancellation effect in the overlap.\nIV. THE TEST CASE: E1 TRANSITION IN 11Be\nThe best-known, and indeed the fastest, E1 transition in\nnuclear physics is that between the first excited state and the\nground state of 11Be. One of the most important features of this\nnucleus is the state inversion that leads to a 12\n+ ground state and\na 12\n− first excited state. The measured E1 transition strength\nbetween these two states is 0.3 W.u. To calculate this we take\nthe ground state to be a sum of two terms. The dominant\nconfiguration is 10Be(0+) × ν(s1\/2) with a smaller but quite\nsignificant 10Be(2+) × ν(d5\/2) configuration. If the 12\n−\nstate\nis then taken to be purely 10Be(0+) × ν(p1\/2), and since only\nlike-core states contribute, there will be only one term in the\nsum in Eq. (5) involving the 0+ ground states of the core. This\ngives, assuming W-S wave functions for the neutron relative\nto the core in both initial and final states, a value of B(E1) =\n0.86 W.u. It is well known [5] that to reduce this overestimation\nof the observed strength, we must also take into account\nexcited core configuration in the 12\n−\nstate: 10Be(2+) × ν(p3\/2).\nThis can couple to the 10Be(2+) × ν(d5\/2) configuration in the\nground state and the two matrix elements lead to a cancellation\nand a value of B(E1) = 0.12 W.u.. Clearly, the precise value\ncan be tweaked by adjusting the amplitudes corresponding\nto the various configurations. This is not important; what is\nimportant is the need for more than one matrix element in a\ncoherent sum. It should be pointed out here that the recent\nNCSM calculation [22] underestimates the B(E1) strength by\nover an order of magnitude. The authors attribute this to the\nunique halo structure of the two bound states. Clearly, the\ndecoupling between core and valence degrees of freedom in\nthese states not only makes the picture simpler but also more\naccurately reproduces observables such as transition strengths.\nV. THE TRANSITIONS IN 10Be\nWe now turn our attention to the transitions in 10Be and\nconsider first the dominant 9Be×n configurations in the various\nstates of interest as predicted by the MCM calculations of [24].\nThe 0+ ground state of 10Be looks almost entirely shell model-\nlike and, in a simple cluster model picture, can be thought of\nas a p3\/2 neutron coupled to the 32\n− ground state of 9Be. The\nfirst excited state, 2+1 , is also relatively simple to picture; in\nthis case with the p3\/2 neutron mainly coupling to the 52\n− first\nexcited state of 9Be. This explains the very strong collective\nB(E2) transition between these states (see Table II) and the\nMCM and NCSM predictions are in agreement.\nOf the four other bound excited states (2+2 , 1−, 0+2 , 2−)\nwe focus on the two (2+2 , 2−) suggested to be fed by the\nthe decay of the 8.81-MeV state in 11Be as discussed in\nRef. [11] and predicted to be possibly halo-like in their\nstructure since they are the remnants of the β decay of 11Li.\nTABLE II. A comparison between the measured and calculated\nvalues for some E1 and E2 transition strengths in 10Be. Experimental\nvalues are taken from [27] and [11]. Calculated values are from the\nmicroscopic cluster model (MCM) and no-core shell model (NCSM)\n[30].\nTransition MCM NCSM [30] Exp.\n(Values are in Weisskopf units)\nB(E2; 2+1 → 0+1 ) 4.8 5.4 8.00 (0.80)\nB(E2; 2+2 → 0+1 ) 0.1 0.17 0.1\nB(E1; 2− → 2+1 ) 0.02 0.022 0.00077\nB(E1; 2− → 2+2 ) 0.006 0.007 Not seen\n034312-4\nEXCITED STATE HALOS IN 10Be PHYSICAL REVIEW C 74, 034312 (2006)\nThe 2+2 state is dominated by configurations in which a p1\/2\nneutron couples to a 9Be core in either of the 32\n−\nor 52\n−\nstates. In addition, there is a small mixing from configurations\nthat resemble those in the 2+1 state: 9Be(3\/2−) × ν(p3\/2) and\n9Be(5\/2−) × ν(p3\/2). As for the negative parity 2− state, this\nis dominated by the 9Be(3\/2−) × ν(s1\/2) configuration with\nsmall amounts of 9Be(5\/2−) × ν(s1\/2),9 Be(3\/2−) × ν(d5\/2),\nand 9Be(5\/2−) × ν(d5\/2). It is worth mentioning here that the\nshell model [29] predicts that both the 2+2 and the 2− states\nhave a strong 52\n− 9Be core component coupled to a p1\/2 and a\ns1\/2 neutron, respectively.\nIt is natural to make the comparison between the 2− state\nin 10Be and the 12\n+ ground state in 11Be. The difference now\nis that we can have an s1\/2 or d5\/2 neutron each coupling\nto either 32\n−\nor 52\n− 9Be core states, whereas in the ground\nstate of 11Be only two configurations, 10Be(0+) × ν(s1\/2) and\n10Be(2+) × ν(d5\/2), contribute. Nevertheless, if we are to\nnaively associate the 2− state in 10Be with the 12\n+\nstate in\n11Be then we should also expect to see strong E1 transitions\nfrom this state. This is not the case. In [11], only a very small\nB(E1; 2− → 2+1 ) strength of 0.00077 W.u. was measured\nand no transition between the 2− and the 2+2 states was\nseen at all. This is consistent with the calculated MCM\nvalues for these strengths of B(E1; 2− → 2+1 ) = 0.02 W.u.\nand B(E1; 2− → 2+2 ) = 0.006 W.u., which are in turn in\nclose agreement with those predicted by the NCSM [30] (see\nTable II). We address now whether we can understand these\ncalculated B(E1) strengths and what they can tell us about the\nstructure of these states.\nWe begin by looking first at B(E1; 2− → 2+1 ) and consider\nthe simplest scenario in which the 2− state is described entirely\nby its dominant 9Be(3\/2−) × ν(s1\/2) configuration. Because\nthis can only couple to the same core state in 2+1 , we only\nhave one matrix element in Eq. (5) to consider involving\nthe 9Be(3\/2−) × ν(p3\/2) configuration in the final state. By\nfollowing the method used to calculate the B(E1) for 11Be\ndescribed earlier (using W-S core-neutron wave functions) and\nassuming only a single-particle transition between an initial\nstate as a pure 3\/2− × s1\/2 and a final state as a pure 3\/2− ×\np3\/2 we arrive at a value of B(E1; 2− → 2+1 ) = 0.12 W.u.,\nwhich is 6 times larger than the value calculated in the cluster\nmodel and more than three orders of magnitude larger than the\nexperimental value. This suggests that it is important to take\ninto account other configurations in the 2− state to allow for\npossible cancellation in the coherent sum of matrix elements\nin Eq. (5).\nFirst, to do this we must make an assumption about the\noccupation probabilities of the different 9Be × n configura-\ntions (the Cα,α′s). In Ref. [24] the reduced width amplitudes\n(spectroscopic amplitudes) are defined as the overlap of\nthe cluster model wave functions for the 10Be states with\nthe various configurations of 9Be+n decay. The (integrated)\nspectroscopic factors obtained are tabulated in [24], and while\nnot an ideal solution, we take these values for the dominant\nconfigurations considered here (Table III). This enables us to\ntake into account in a simple and consistent way the relative\nimportance of the different coupling matrix elements in the\nE1 transition.\nTABLE III. The occupation probabilities for the dominant 9Be+n\nconfigurations in the 10Be states of interest, defined as renormalized\n“spectroscopic factors” from [24].\nState in 10Be Configuration\n[9Be(Iπ ) × ν(\u0001j )]\nSpectroscopic factors\nfrom MCM\n0+1 3\/2− × p3\/2 2.26\n2+1 3\/2− × p3\/2 0.24\n5\/2− × p3\/2 1.17\n2+2 3\/2− × p3\/2 0.28\n3\/2− × p1\/2 0.54\n5\/2− × p3\/2 0.23\n5\/2− × p1\/2 0.13\n2− 3\/2− × s1\/2 0.70\n3\/2− × d5\/2 0.16\n5\/2− × s1\/2 0.02\n5\/2− × d5\/2 0.10\nThere are thus four matrix elements that contribute to\nB(E1; 2− → 2+1 ). These are shown in Table IV along with\ntheir numerical values to show their cancellation effect. These\nvalues are the quantities in square brackets in Eq. (5). The\nfirst and fourth of these matrix elements are opposite in sign\nto the second and third and the full coherent sum gives a\nvalue ofB(E1; 2− → 2+1 ) = 0.033 W.u., which is, presumably\nsomewhat fortuitously, in reasonable agreement with the\ncluster model value of 0.02 W.u. However, the cancellation\nbetween the different matrix elements is not as vital here as it\nwas for the E1 transition in 11Be. We note in Table III that the\n3\/2− × p3\/2 configuration in the 2+1 state has an occupation\nprobability of 0.24. Including this factor but assuming the\n2− state is still a pure 3\/2− × s1\/2, we obatin a value of\n0.028 W.u. Thus we do not necessarily need to include the\nother three matrix elements that appear when we include the\nmissing configurations in the 2− because they simply cancel\neach other out. Of course, by tweaking the relative strengths\nof the different configurations in the initial and final states,\nthe B(E1) strength can be forced to have any value between\na maximum of 0.12 W.u. (when only the first, and largest,\nTABLE IV. The values of the different matrix elements contribut-\ning to the two E1 transitions of interest. The numerical values in\ncolumn 3 refer to the quantities inside the square brackets in Eq. (5).\nTransition Matrix element Value\nB(E1; 2− → 2+1 ) [3\/2− × s1\/2] → [3\/2− × p3\/2] −0.41\n[3\/2− × d5\/2] → [3\/2− × p3\/2] +0.24\n[5\/2− × s1\/2] → [5\/2− × p3\/2] +0.19\n[5\/2− × d5\/2] → [5\/2− × p3\/2] −0.53\nB(E1; 2− → 2+2 ) [3\/2− × s1\/2] → [3\/2− × p1\/2] −1.02\n[3\/2− × s1\/2] → [3\/2− × p3\/2] −0.73\n[3\/2− × d5\/2] → [3\/2− × p3\/2] +0.55\n[5\/2− × s1\/2] → [5\/2− × p1\/2] −0.05\n[5\/2− × s1\/2] → [5\/2− × p3\/2] +0.14\n[5\/2− × d5\/2] → [5\/2− × p3\/2] −0.26\n034312-5\nJIM AL-KHALILI AND KOJI ARAI PHYSICAL REVIEW C 74, 034312 (2006)\nmatrix element is considered) and zero (when there is complete\ncancellation). Furthermore, we have a similar freedom to force\nB(E1) to be very small if we assume that the 9Be core remains\nin its 3\/2− ground state in the 2− state but allowing it to couple\nto an s- or d-wave neutron (thus leaving us with only the first\ntwo matrix elements) or indeed if the valence neutron is purely\nin s-state and coupling to either a 32\n−\nor a 52\n−\ncore (the first and\nthird matrix elements). In both these cases, the two surviving\nmatrix elements are of opposite sign and their relative strengths\ncan be adjusted for the appropriate amount of cancellation.\nIt seems from the previous analysis that we cannot infer too\nmuch about the contributions of the different configurations in\nthe 2− wave function other than to say that its core is probably\nnot too dissimilar to that of the 2+1 . Of course, we are still left\nwith explaining why the measured strength is over an order of\nmagnitude smaller than the calculated values. But as described\nearlier, a polarized 10Be core due to molecular configurations\nwill affect the potential felt by the valence neutron and this\ncan have an effect on the overlap integral that comes into the\nsingle-particle transition by shifting the position of the node in\nthe initial state radial wave function. However, this is a rather\nqualitative argument and does not explain why the theoretical\nvalues do not pick it up.\nIf we turn our attention to the E1 transition between the\n2− and 2+2 states, we find that even more matrix elements can\ncontribute and must be taken into account. However, even\nso, we arrive at a value of B(E1; 2− → 2+2 ) = 0.25 W.u.,\nwhich is far bigger than the MCM and NCSM predictions\nof 0.006 and 0.007 W.u., respectively. Again, if we consider\nonly the dominant transition [3\/2− × s1\/2] → [3\/2− × p1\/2],\nthen we arrive at a similarly large value. Even if we allow\nconfigurations involving the two different core states of 32\n−\nand 52\n−\nwhile assuming the transition takes place because of\nthe s1\/2 neutron coupling to either p1\/2 or p3\/2 we get nowhere\nnear the correct amount of cancelation, nor when we include\nthose configurations in the 2− involving the neutron in a d5\/2\nstate.\nThus we see that, for the E1 transition between these two\nnearby states (2− and 2+2 ), not only is it necessary to include\nmany configurations in each state but their occupation proba-\nbilities must also be such that they give just the right balance for\nthe matrix elements to cancel each other completely! Using the\noccupation probabilities predicted by the MCM calculations\nwe do not get this cancellation. And yet the MCM predicts a\nvery small B(E1). A possible interpretation is that the strength\nof the transition to the 2+1 state is, while small, preferred over\nthe one to the 2+2 state because the 9Be cores of the dominant\nconfigurations in the 2− and 2+1 states look more alike. That is,\nthe 2− state has a core that looks similar in its spatial structure\nto that of the 2+1 state. However, the 2\n+\n2 state has a core that is\nmore molecular and extended and therefore has little overlap\nwith the core in the initial 2− state.\nThe previous argument is supported if we consider the\nE2 transitions between each of the two 2+ states and the\nground state. We have already mentioned the very large\nB(E2; 2+1 → 0+) = 8 W.u. due to a collective transition in\nthe core. This compares with a value of B(E2; 2+2 → 0+) =\n0.1 W.u., measured experimentally [11] and confirmed by the\ncluster model prediction. The transition operator in this case\nis [comparing with Eq. (4)]\nˆO2µ(E2) = ˆOcore2µ (E2) +\nZ\nA2\ne r2 Y2µ(rˆ), (7)\nand we cannot now disregard the first term. The states that\nare connected now involve configurations in which both the\ncore and the valence parities are unchanged. We find that the\nobservedB(E2; 2+2 → 0+) strength can be reproduced without\nincluding any contribution from the first term in Eq. (7). If the\ncore in the 2+2 state looks like that in the 2\n+\n1 state, then we\nshould expect there to be a large collective core excitation,\nwhich would add to the small single-particle transition to give\nan overall large B(E2), which is not the case. Again, we are\nforced to conclude that the 9Be core in the second 2+ state is\nmore molecular in structure that in the first 2+ state.\nWe have not considered here the structure of the other two\nexcited states in 10Be: 1− and 0+2 , for which there is strong\ntheoretical evidence of molecular structure. We can conclude\ntentatively, however, that the 2− state does indeed appear to\nbe halo-like in its structure because of the dominance of the\nconfigurations involving a valence neutron in an s1\/2 orbit. But,\njust as was found in the 12\n+ ground state of 11Be, there is likely\nto be an important contribution from configurations in which\nthe neutron is in a less spatially extended (due to the centrifugal\nbarrier) d5\/2 orbit. There are also likely to be core polarization\neffects that will affect the value of the overlap integral. The\n2+2 on the other hand does not lend itself to such a simple\nhalo structure as its single-particle configurations involve p-\nwave neutrons only. It is more likely to be a molecular cluster\nstructure involving an extended (α + α + n) core coupled to a\np-wave neutron.\nVI. SUMMARY\nWe considered the possible halo-like structure of the 2−\nstate in 10Be that sits just 548 keV below the 9Be+n threshold\nby examining the only observed electromagnetic transition\nfrom this state, a pure B(E1) to the 2+1 state. We deduce that,\nif this state is dominated by a 3\/2− × s1\/2 configuration, then\nthis configuration alone can explain the calculated weak E1\ntransition. Because the measured transition is even smaller\nthan that predicted by either the microscopic cluster model,\nor the no-core shell model we conclude that the 2− state is\nlikely to have a 9Be core that is polarized because of the\neffects of other, more molecular-like, configurations but that is\nnevertheless well decoupled from the predominantly s-wave\nvalence neutron. This decoupling of the core and valence\ndegrees of freedom, along with the weak binding, is what\ndefines a halo state. The 2− state is thus our clearest candidate\nto date of an excited state neutron halo.\nACKNOWLEDGMENTS\nThe authors thank B. A. Brown, P. Navra´til, F. Sarazin, and\nI.J. Thompson for useful discussions, helpful comments, and\ncarrying out calculations.\n034312-6\nEXCITED STATE HALOS IN 10Be PHYSICAL REVIEW C 74, 034312 (2006)\n[1] B. Jonson, Phys. Rep. 389, 1 (2004).\n[2] J. S. Al-Khalili, Lect. Notes Phys. 651, 77 (2004).\n[3] I. Tanihata, J. Phys. G 22, 157 (1996).\n[4] B. Jonson, P. G. Hansen, A. S. Jensen, and B. Jonson, Annu.\nRev. Nucl. Part. Sci. 45, 591 (1995).\n[5] D. J. Millener, J. W. Olness, E. K. Warburton, and S. S. Hanna,\nPhys. Rev. C 28, 497 (1983).\n[6] I. Tanihata, H. Hamagaki, O. Hashimoto, Y. Shida,\nN. Yoshikawa, K. Sugimoto, O. Yamakawa, K. Obayashi, and\nN. Takahashi, Phys. Rev. Lett. 55, 2676 (1985).\n[7] I. Tanihata et al., Phys. Lett. B160, 380 (1985).\n[8] N. Soic´ et al., Europhys. Lett. 34, 7 (1996).\n[9] M. Milin et al., Europhys. Lett. 48, 616 (1999).\n[10] M. Freer et al., Phys. Rev. C 63, 034301 (2001).\n[11] F. Sarazin et al., Phys. Rev. C 70, 031302(R) (2004).\n[12] F. Negoita et al., Phys. Rev. C 59, 2082 (1999).\n[13] T. Aumann et al., Phys. Rev. Lett. 84, 35 (2000).\n[14] W. von Oertzen, Z. Phys. A 357, 355 (1997).\n[15] Y. Ogawa et al., Nucl. Phys. A673, 122 (2000).\n[16] N. Itagaki and S. Okabe, Phys. Rev. C 61, 044306 (2000);\nN. Itagaki, S. Hirose, T. Otsuka, S. Okabe, and K. Ikeda, ibid.\n65, 044302 (2002).\n[17] Y. Kanada-En’yo and H. Horiuchi, Phys. Rev. C 66, 024305\n(2002).\n[18] P. Descouvemont, Nucl. Phys. A699, 463 (2002).\n[19] P. Navra´til, J. P. Vary, and B. R. Barrett, Phys. Rev. Lett. 84,\n5728 (2000).\n[20] P. Navra´til, J. P. Vary, and B. R. Barrett, Phys. Rev. C 62, 054311\n(2000).\n[21] E. Caurier, P. Navra´til, W. E. Ormand, and J. P. Vary, Phys. Rev.\nC 66, 024314 (2002).\n[22] C. Forsse´n, P. Navra´til, W. E. Ormand, and E. Caurier, Phys.\nRev. C 71, 044312 (2005).\n[23] E. Caurier, G. Martinez-Pinedo, F. Nowacki, A. Poves,\nJ. Retamosa, and A. P. Zuker, Phys. Rev. C 59, 2033 (1999).\n[24] K. Arai, Phys. Rev. C 69, 014309 (2004).\n[25] Y. Hirayama et al., Phys. Lett. B611, 239 (2005).\n[26] P. G. Hansen and J. A. Tostevin, Annu. Rev. Nucl. Part. Sci. 53,\n219 (2003).\n[27] F. Ajzenberg-Selove, Nucl. Phys. A490, 1 (1988).\n[28] N. Curtis, D. D. Caussyn, N. R. Fletcher, F. Marechal, N. Fay,\nand D. Robson, Phys. Rev. C 64, 044604 (2001).\n[29] B. A. Brown (private communication).\n[30] P. Navra´til (private communication).\n034312-7\n"}