{"doi":"10.1186\/1471-2288-9-46","coreId":"177392","oai":"oai:aura.abdn.ac.uk:2164\/2201","identifiers":["oai:aura.abdn.ac.uk:2164\/2201","10.1186\/1471-2288-9-46"],"title":"Strategies for achieving a high response rate in a home interview survey","authors":["Kiezebrink, Kirsty","Crombie, Iain K.","Irvine, Linda","Swanson, Vivien","Power, Kevin","Wrieden, Wendy L.","Slane, Peter W."],"enrichments":{"references":[{"id":6189,"title":"A: Using CommunityLevel Correlates to Evaluate Nonresponse Effects in a Telephone Survey. Public Opinion Quarterly","authors":[],"date":"2006","doi":"10.1093\/poq\/nfl032","raw":"Johnson T, Cho Y, Campbell R, Holbrook A: Using CommunityLevel Correlates to Evaluate Nonresponse Effects in a Telephone Survey.  Public Opinion Quarterly 2006, 70:704-719.","cites":null},{"id":6187,"title":"Bartholomae S: The recruitment of normal healthy volunteers: a review of the literature on the use of financial incentives.","authors":[],"date":"2002","doi":"10.1177\/00912700222011409","raw":"Tishler CL, Bartholomae S: The recruitment of normal healthy volunteers: a review of the literature on the use of financial incentives.  J Clin Pharmacol 2002, 42:365-375.","cites":null},{"id":6195,"title":"Capon T: Increasing response rates in telephone surveys: a randomized trial.","authors":[],"date":"1995","doi":null,"raw":"Smith W, Chey T, Jalaludin B, Salkeld G, Capon T: Increasing response rates in telephone surveys: a randomized trial.  J Public Health Med 1995, 17:33-8.","cites":null},{"id":6198,"title":"Design and use of questionnaires: a review of best pracitce applicable to surveys of health service staff and patients. Health Technology Assessment","authors":[],"date":"2001","doi":null,"raw":"McColl E, Jacoby A, Thomas L, Soutter J, Bamford C, Steen N, et al.: Design and use of questionnaires: a review of best pracitce applicable to surveys of health service staff and patients. Health Technology Assessment 2001, 5:31.","cites":null},{"id":6186,"title":"Frost C: Meta-analysis of randomised trials of monetary incentives and response to mailed questionnaires.","authors":[],"date":"2005","doi":"10.1136\/jech.2005.034397","raw":"Edwards P, Cooper R, Roberts I, Frost C: Meta-analysis of randomised trials of monetary incentives and response to mailed questionnaires.  J Epidemiol Community Health 2005, 59:987-999.","cites":null},{"id":6197,"title":"Haines A: Overcoming barriers to recruitment in health research. BMJ","authors":[],"date":"2006","doi":"10.1136\/bmj.333.7562.300","raw":"Hewison J, Haines A: Overcoming barriers to recruitment in health research.  BMJ 2006, 333:300-2.","cites":null},{"id":6180,"title":"Loosveldt G: Minimizing survey refusal and noncontract rates: do our efforts pay off? Survey Research Methods","authors":[],"date":"2007","doi":null,"raw":"Heerwegh D, Abts K, Loosveldt G: Minimizing survey refusal and noncontract rates: do our efforts pay off?  Survey Research Methods 2007, 1:3-10.","cites":null},{"id":6183,"title":"Maximising response to postal questionnaires – a systematic review of randomised trials in health research.","authors":[],"date":"2006","doi":null,"raw":"Nakash RA, Hutton JL, Jørstad-Stein EC, Gates S, Lamb SE: Maximising response to postal questionnaires – a systematic review of randomised trials in health research.  BMC Med Res Methodol 2006, 6:5.","cites":null},{"id":6188,"title":"Measuring socioeconomic position in dietary research: is choice of socio-economic indicator important? Public Health Nutr","authors":[],"date":"2003","doi":"10.1079\/PHN2002416","raw":"Turrell G, Hewitt B, Patterson C, Oldenburg B: Measuring socioeconomic position in dietary research: is choice of socio-economic indicator important?  Public Health Nutr 2003, 6:191-200.","cites":null},{"id":6182,"title":"Methods to increase response rates to postal questionnaires. Cochrane Database of Systematic Reviews","authors":[],"date":"2007","doi":"10.1002\/14651858.mr000008.pub3","raw":"Edwards P, Roberts I, Clarke M, DiGuiseppi C, Pratap S, Wentz R, et al.: Methods to increase response rates to postal questionnaires.  Cochrane Database of Systematic Reviews 2007:MR000008.","cites":null},{"id":6176,"title":"Nonresponse Bias in Household Surveys. Public Opinion Quarterly","authors":[],"date":"2006","doi":"10.1093\/poq\/nfl034","raw":"Singer E: Nonresponse Bias in Household Surveys.  Public Opinion Quarterly 2006, 70:637-645.","cites":null},{"id":6179,"title":"Nonresponse in the American Time Use Survey. Who is missing from the data and how much does it matter? Public Opinion Quarterly","authors":[],"date":"2006","doi":"10.1093\/poq\/nfl037","raw":"Abraham K, Maitland A, Bianchi S: Nonresponse in the American Time Use Survey. Who is missing from the data and how much does it matter?  Public Opinion Quarterly 2006, 70:676-703.","cites":null},{"id":6191,"title":"Office of the Chief Statistician: Scottish Index of Multiple Deprivation","authors":[],"date":"2004","doi":null,"raw":"Office of the Chief Statistician: Scottish Index of Multiple Deprivation 2004 Technical Report.  Scottish Executive 2004 [http:\/\/ www.scotland.gov.uk\/Resource\/Doc\/26350\/0025281.pdf].","cites":null},{"id":6190,"title":"PD C: Factors affecting response rates to the Consumer Assessment of Health Plans Study survey. Med Care","authors":[],"date":"2002","doi":"10.1097\/00005650-200206000-00006","raw":"Zaslavsky A, Zaborski L, PD C: Factors affecting response rates to the Consumer Assessment of Health Plans Study survey. Med Care 2002, 40:485-99.","cites":null},{"id":6196,"title":"PD: Using telephone interviews to reduce nonresponse bias to mail surveys of health plan members. Med Care","authors":[],"date":"2002","doi":"10.1097\/00005650-200203000-00003","raw":"Fowler FJJ, Gallagher PM, Stringfellow VL, Zaslavsky AM, Thompson JW, Cleary PD: Using telephone interviews to reduce nonresponse bias to mail surveys of health plan members.  Med Care 2002, 40:190-200.","cites":null},{"id":6181,"title":"Personally addressed hand-signed letters increase questionnaire response: a meta-analysis of randomised controlled trials.","authors":[],"date":"2006","doi":null,"raw":"Scott P, Edwards P: Personally addressed hand-signed letters increase questionnaire response: a meta-analysis of randomised controlled trials.  BMC Health Services Research 2006, 6:111.","cites":null},{"id":6192,"title":"Quality of response in different population groups in mail and telephone surveys.","authors":[],"date":"1984","doi":null,"raw":"Siemiatycki J, Campbell S, Richardson L, Aubert D: Quality of response in different population groups in mail and telephone surveys.  Am J Epidemiol 1984, 120:302-14.","cites":null},{"id":6185,"title":"Roberts I: Strategies to improve recruitment to research studies. Cochrane Database of Systematic Reviews","authors":[],"date":"2007","doi":"10.1002\/14651858.mr000013.pub3","raw":"Mapstone J, Elbourne D, Roberts I: Strategies to improve recruitment to research studies.  Cochrane Database of Systematic Reviews 2007:MR000013.","cites":null},{"id":6194,"title":"S: Selection bias from sampling frames: telephone directory and electoral roll compared with door-to-door population census: results from the Blue Mountains Eye Study.","authors":[],"date":"1997","doi":"10.1111\/j.1467-842X.1997.tb01671.x","raw":"Smith W, Mitchell P, Attebo K, Leeder S: Selection bias from sampling frames: telephone directory and electoral roll compared with door-to-door population census: results from the Blue Mountains Eye Study.  Aust N Z J Public Health 1997, 21:127-33.","cites":null},{"id":6178,"title":"Separating refusal bias and non-contact bias: evidence from UK national surveys. The Statistician","authors":[],"date":"2002","doi":"10.1111\/1467-9884.00321","raw":"Lynn P, Clarke P: Separating refusal bias and non-contact bias: evidence from UK national surveys.  The Statistician 2002, 51:319-333.","cites":null},{"id":6177,"title":"Survey Non-Response Procedures in Cross-National Perspective: The","authors":[],"date":"2005","doi":null,"raw":"Smith T: Survey Non-Response Procedures in Cross-National Perspective: The 2005 ISSP Non-Response Survey.  Survey Research Methods 2007, 1:45-54.","cites":null},{"id":6199,"title":"The long-term effectiveness of refusal conversion procedures on longitudinal surveys.","authors":[],"date":"2006","doi":"10.1111\/j.1467-985X.2006.00402.x","raw":"Burton J, Laurie H, Lynn P: The long-term effectiveness of refusal conversion procedures on longitudinal surveys.  J R Statist Soc A 2006, 169:459-478. Pre-publication history The pre-publication history for this paper can be accessed here: http:\/\/www.biomedcentral.com\/1471-2288\/9\/46\/prepub","cites":null},{"id":6193,"title":"Tierney WM: Assessing inner-city patients' hospital experiences. A controlled trial of telephone interviews versus mailed surveys. Med Care","authors":[],"date":"1997","doi":"10.1097\/00005650-199701000-00006","raw":"Harris LE, Weinberger M, Tierney WM: Assessing inner-city patients' hospital experiences. A controlled trial of telephone interviews versus mailed surveys.  Med Care 1997, 35:70-6.","cites":null},{"id":6184,"title":"Torgerson DJ: Increasing recruitment to randomised trials: a review of randomised controlled trials.","authors":[],"date":"2006","doi":null,"raw":"Watson JM, Torgerson DJ: Increasing recruitment to randomised trials: a review of randomised controlled trials.  BMC Med Res Methodol 2006, 6:34.","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences","University of Aberdeen, Institute of Applied Health Sciences"],"datePublished":"2009-06-30","abstract":"Peer reviewedPublisher PD","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2201<\/identifier><datestamp>\n                2018-01-06T08:41:06Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_632<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_633<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nStrategies for achieving a high response rate in a home interview survey<\/dc:title><dc:creator>\nKiezebrink, Kirsty<\/dc:creator><dc:creator>\nCrombie, Iain K.<\/dc:creator><dc:creator>\nIrvine, Linda<\/dc:creator><dc:creator>\nSwanson, Vivien<\/dc:creator><dc:creator>\nPower, Kevin<\/dc:creator><dc:creator>\nWrieden, Wendy L.<\/dc:creator><dc:creator>\nSlane, Peter W.<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Institute of Applied Health Sciences<\/dc:contributor><dc:subject>\ntelephone interviews<\/dc:subject><dc:subject>\nnonresponse bias<\/dc:subject><dc:subject>\nmetaanalysis<\/dc:subject><dc:subject>\nrecruitment<\/dc:subject><dc:subject>\nincentives<\/dc:subject><dc:subject>\ntrials<\/dc:subject><dc:subject>\ncensus<\/dc:subject><dc:subject>\nmail<\/dc:subject><dc:subject>\nR Medicine<\/dc:subject><dc:subject>\nR<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher PDF<\/dc:description><dc:date>\n2011-12-13T09:51:01Z<\/dc:date><dc:date>\n2011-12-13T09:51:01Z<\/dc:date><dc:date>\n2009-06-30<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nKiezebrink , K , Crombie , I K , Irvine , L , Swanson , V , Power , K , Wrieden , W L & Slane , P W 2009 , ' Strategies for achieving a high response rate in a home interview survey ' BMC Medical Research Methodology , vol 9 , 46 . DOI: 10.1186\/1471-2288-9-46<\/dc:identifier><dc:identifier>\n1471-2288<\/dc:identifier><dc:identifier>\nPURE: 4354575<\/dc:identifier><dc:identifier>\nPURE UUID: 71668421-5664-4d8a-a0fe-3d05d22f9b1a<\/dc:identifier><dc:identifier>\nWOS: 000268636800001<\/dc:identifier><dc:identifier>\nScopus: 68249143510<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2201<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1186\/1471-2288-9-46<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nBMC Medical Research Methodology<\/dc:relation><dc:rights>\nThe full License can be found at: http:\/\/www.biomedcentral.com\/about\/license<\/dc:rights><dc:format>\n6<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1471-2288","issn:1471-2288"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["BMC Medical Research Methodology"],"year":2009,"topics":["telephone interviews","nonresponse bias","metaanalysis","recruitment","incentives","trials","census","mail","R Medicine","R"],"subject":["Journal article"],"fullText":"BioMed Central\nBMC Medical Research \nMethodology\nssOpen AcceResearch article\nStrategies for achieving a high response rate in a home interview \nsurvey\nKirsty Kiezebrink1, Iain K Crombie*2, Linda Irvine2, Vivien Swanson3, \nKevin Power4, Wendy L Wrieden5 and Peter W Slane6\nAddress: 1Division of Health and Food Sciences, School of Contemporary Sciences University of Abertay, Bell Street, Dundee, UK, 2Department of \nPublic Health, University of Dundee, Mackenzie Building, Kirsty Semple Way, Dundee, UK, 3Department of Psychology, University of Stirling, \nStirling, UK, 4Department of Clinical Psychology, Dudhope Terrace, Dundee, UK, 5Health Services Research Unit, University of Aberdeen, Health \nSciences Building, Aberdeen, UK and 6Erskine Practice, Arthurstone Medical Centre, Dundee, UK\nEmail: Kirsty Kiezebrink - k.Kiezebrink@abertay.ac.uk; Iain K Crombie* - i.k.crombie@cpse.dundee.ac.uk; \nLinda Irvine - m.a.j.irvine@cpse.dundee.ac.uk; Vivien Swanson - vivien.swanson@stir.ac.uk; Kevin Power - kevin.power@nhs.net; \nWendy L Wrieden - w.l.wrieden@abdn.ac.uk; Peter W Slane - peter.slane@nhs.net\n* Corresponding author    \nAbstract\nBackground: Response rates in surveys have been falling over the last 20 years, leading to the need for\nnovel approaches to enhance recruitment. This study describes strategies used to maximise recruitment\nto a home interview survey of mothers with young children living in areas of high deprivation.\nMethods: Mothers of two year old children received a letter from their GP inviting them to take part in\na survey on diet. Participants were subsequently recruited by a researcher. The researcher first tried to\ncontact potential participants by telephone, to discuss the study and make an appointment to conduct a\nhome interview. Where telephone numbers for women could not be obtained from GP records, web\nsearches of publicly available databases were conducted. After obtaining correct telephone numbers, up\nto six attempts were made to establish contact by telephone. If this was unsuccessful, a postal request for\ntelephone contact was made. Where no telephone contact was achieved, the researcher sent up to two\nappointments by post to conduct a home interview.\nResults: Participating GPs invited 372 women to take part in a home based interview study. GP practices\nprovided telephone numbers for 162 women, of which 134 were valid numbers. The researcher identified\na further 187 numbers from electronic directories. Further searches of GP records by practice staff\nyielded another 38 telephone numbers. Thus, telephone numbers were obtained for 99% of potential\nparticipants.\nThe recruitment rate from telephone contacts was 77%. Most of the gain was achieved within four calls.\nFor the remaining women, contact by post and home visits resulted in 18 further interviews,\ncorresponding to 35% of the women not recruited by telephone. The final interview rate was 82%. This\nwas possible because personal contact was established with 95% of potential participants.\nConclusion: This study achieved a high response rate in a hard to reach group. This was mainly achieved\nby first establishing contact by telephone. The use of multiple sources identified the telephone numbers of\nalmost all the sample. Multiple attempts at telephone contact followed by postal approaches led to a high\nhome interview rate.\nPublished: 30 June 2009\nBMC Medical Research Methodology 2009, 9:46 doi:10.1186\/1471-2288-9-46\nReceived: 6 February 2009\nAccepted: 30 June 2009\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2288\/9\/46\n© 2009 Kiezebrink et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Page 1 of 6\n(page number not for citation purposes)\nBMC Medical Research Methodology 2009, 9:46 http:\/\/www.biomedcentral.com\/1471-2288\/9\/46Background\nConcern with survey non-response and the potential for\nintroducing bias is long standing [1]. These concerns are\nincreasing because of evidence that non-response rates in\nmany countries have risen over time [2]. An important\ndistinction is made between refusal to participate and fail-\nure to establish contact with potential participants [3].\nThere is evidence that non-contact makes an important\ncontribution to overall non-response [4] and that non-\ncontact can result in substantial bias [5].\nConsiderable effort is often made to reduce non-response\nby making multiple attempts at contact through repeated\ncalling, incentives to interviewers and respondents and\nintroductory telephone calls. Systematic reviews of postal\nquestionnaire surveys have shown that response rates are\nincreased by hand signed letters [6], repeated mailings\nand telephone contact [7,8]. Similar strategies have been\neffective in recruiting subjects to randomised controlled\ntrials [9,10]. Recent reviews have found that the provision\nof incentives is also effective [8,11,12]. The key require-\nment for all such approaches is that accurate contact\ndetails are available.\nLow response rates are commonly associated with social\ndeprivation [4,13,14] leading to a call for strategies to\nimprove participation by disadvantaged groups [15]. Tel-\nephone contact has been found to improve socio-demo-\ngraphic representativeness [16]. Thus in a study of\nmothers with young children who lived in areas of high\ndeprivation we made extensive efforts to contact potential\nparticipants. The main strategies were to ensure that accu-\nrate contact details were identified and to use telephone\ncalls as the primary means of contact. This paper presents\nthe techniques used and the results of these efforts.\nMethods\nThe dietary survey was designed to investigate maternal\nfactors associated with poor diet among children living in\nareas of high deprivation. Families were suitable for inclu-\nsion if the mother lived with a two year old child and was\nresponsible for buying, planning and providing the\nchild's meals. Mothers were interviewed in their own\nhomes using a computer aided personal interview (CAPI)\nwhich took approximately one hour to administer. The\nstructured questionnaire included an assessment of the\nchild's current diet, mother's knowledge about diet and\ncooking, her beliefs and attitudes to providing a healthy\ndiet, and barriers to providing a healthy diet, such as\naccess to shops of lack of cooking facilities.\nEthical permission for the dietary study was obtained\nfrom the local Committees on Medical Research Ethics in\nTayside and Fife (Scotland) (Project reference number 04\/\nS1401115). The Scottish Index of Multiple Deprivation\n(SIMD) [17] was used to identify areas of high depriva-\ntion. Ten GP practices located in the two most deprived\ndeciles of Dundee and Fife were recruited. These practices\nsupplied anonymised lists of all children aged two years\nwho lived with their mother. From these lists the mothers\nwith addresses in the two most deprived deciles of SIMD\nscores were identified. The UK Data Protection Act (1998)\ndoes not allow researchers direct access to patients' per-\nsonal details. Thus, GPs checked patients' suitability for\nparticipation, then sent a letter of invitation together with\nan information leaflet about the study. The letter stated\nthat if mothers did not wish to take part they should\nreturn an enclosed postcard, otherwise the research team\nwould be given their contact details and a named\nresearcher would contact them.\nFollowing the letter of invitation from the GP, potential\nparticipants were contacted by a researcher who discussed\nthe study and, if mothers were willing to take part, made\nan appointment to interview them in their own homes. As\ntelephone call was the intended first means of contact by\nthe researcher, several strategies were used to obtain tele-\nphone numbers. Internet searches of four databases in the\npublic domain were used to obtain land line numbers\n[18,19] and mobile numbers [20]. The searches used com-\nbinations of the mother's surname, the child's surname if\nit differed from the mother's and parts of the address.\nUp to six attempts were made to contact the women by\ntelephone. When a woman refused to participate no fur-\nther contact attempts were made. The timing of calls was\nvaried to maximise the chances of contact: the first two\ncalls were at different times of the working day, with sub-\nsequent calls in the evening and then at the weekend.\nVoicemail messages were left when it was clear that the tel-\nephone of the correct person had been contacted (ie a\nrecorded message gave the person's name).\nIf no contact was established by telephone a letter was\nsent asking the women to contact the researcher. Women\nwere asked to return a stamped response slip or telephone\na designated number. Women who did not respond to\nthis letter were then offered up to two appointments for\nhome interviews at a specified time (one delivered by\npost, one by a hand-delivered visiting card).\nParticipants were given a €10 high street gift voucher [21]\nto thank them for their participation. The gift voucher was\nnot mentioned at any of the contact attempts, but was\noffered after the interview was completed.\nResults\nParticipating GPs invited 372 women to take part in the\nstudy. Only three women opted out on receiving the letter\nof invitation from the GP. The home address of 36 womenPage 2 of 6\n(page number not for citation purposes)\nBMC Medical Research Methodology 2009, 9:46 http:\/\/www.biomedcentral.com\/1471-2288\/9\/46proved inaccurate, but after checking with GP staff this\nwas reduced to six women with unknown addresses.\nWomen whose current address could not be identified\nwere excluded from further contact attempts. This left 363\nwomen to be contacted.\nFigure 1 gives a summary of the recruitment process\nincluding the number of women contacted and the\nnumber recruited at each stage. Telephone numbers for\n162 women were initially received from the GPs, but only\n134 of these were valid (ie rang when dialled). Searching\nof the web-based directories yielded another 187 num-\nbers. Further searching of GP records by practice staff pro-\nvided 31 more. Finally health visitors (nurses trained in\nhealth promotion) were able to supply an additional 7\nnumbers. In total valid telephone numbers (ie number\nrang when dialled) were obtained for 359 of the 363\nwomen with valid addresses.\nOf the 305 women interviewed, 287 were recruited by a\ntelephone call from the researcher (Table 1). Sixty women\n(16.7% of those telephoned) were recruited at the first tel-\nephone call. The recruitment rate increased to the fourth\nattempt when 57.4% of those telephoned agreed to take\npart. The number recruited on the fifth and sixth tele-\nphone calls was low (7.9% and 3.8% of those contacted).\nThe overall refusal rate was low but was slightly higher for\nthe later contacts. Overall, only 7% of those contacted by\ntelephone refused to be interviewed.\nThe 47 women who did not answer the telephone calls,\nplus four for whom telephone numbers were unavailable,\nwere contacted by letter. Twenty two women responded to\nthis letter by calling the researcher. Twelve of these\nwomen were subsequently recruited and ten refused to\ntake part. The 29 women who did not respond to this let-\nter were sent a second letter, which gave a specific\nappointment time for a home visit. Thirteen women were\nat home at the time of the interview of whom six were\nrecruited. Visiting cards were left at the homes of the 16\nwomen who were out at the first home visit, offering a\nnew appointment time. Of the 16, only four were at home\nat the second visit and all of them refused to participate.\nOverall, of the 372 women invited to take part, 305 were\nrecruited giving a recruitment rate of 82%. Most of the\nappointments for home interview were arranged by the\ntelephone contact (Table 2). However the yield for each\nmethod of contact (ie the percent of those contacted who\nwere subsequently interviewed) exceeded 20% for all\nmethods except the final home visit. Only 49 women\nrefused to take part; 3 at the initial invitation letter, 25 at\ntelephone contact, 10 at the postal contact and 11 at the\nhome visits. As might be expected the refusal rate progres-\nsively increased as the contact method was switched from\ntelephone to postal approach to home visit (Table 2).\nThe non-contact rate in this study was very low. At the end\nof all the contact procedures only 18 women (5%) were\nnot contacted by the researcher: six for whom the initial\naddress was known to be incorrect and 12 who remained\nnon-contactable after the final home visit. The non-con-\ntact rate increased dramatically with successive methods\nof contact (Table 2).\nDiscussion\nThis study achieved a very high response among people\nliving in deprived areas, a group that are known to be dif-\nficult to recruit to research studies [4,13-15]. The sequence\nof letter of invitation, followed by up to six attempts for a\ntelephone contact, and finally resorting to postal\napproaches used, resulted in a very low non-contact rate.\nTelephone numbers were obtained for almost all of the\npotential participants. The refusal rate at telephone con-\ntact was very low, possibly because the researcher was able\nto talk to potential participants before recruitment. The\nresearcher was able to form a rapport, answer any queries\nabout the study and arrange appointments for interviews\nSummary of recruitmentFigure 1\nSummary of recruitment.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSent letter of invitation from GP \nn=372 \nIncorrect address \nn=6 \nAvailable for contact \nn=363 \nRefused \nn=3 \nPhone number not \nidentified \nn=4 \n \nPhone number identified \nn=359  \n134 identified by GP \n225 identified by researcher \nRecruited \nn=287 \nRefused \nn=25 \n \nNo contact \nestablished by phone \nn=47 \nContacted by letter  \nn=51 \nNo contact \nestablished \nn=12 \nRefused \nn=21 \nRecruited \nn=18 \nTotal interviewed at home \nn=305 \nResponse rate=82% Page 3 of 6\n(page number not for citation purposes)\nBMC Medical Research Methodology 2009, 9:46 http:\/\/www.biomedcentral.com\/1471-2288\/9\/46at a time that suited the mothers, including evenings and\nweekends. Thus making contact by telephone offers the\nbenefits of a high contact rate and a low refusal rate.\nWhen attempts to make contact by telephone were unsuc-\ncessful, postal invitations were used. Trials comparing the\neffect of contact sequence found that telephone then\npostal contact gives a higher response than the reverse\n[22,23]. In this study, because the target group were moth-\ners of young children we anticipated a high level of tele-\nphone ownership. Further most telephones have a voice\nmessage facility which enables contact to be established\neven when the telephone is not answered. A key finding of\nthis study is that recruitment rates remained high up to\nthe fourth attempt at telephone contact. As this is a rela-\ntively inexpensive method of approach, multiple attempts\nat contact are strongly recommended.\nA crucial requirement for high response rates is accurate\ncontact details. Thus several strategies were used to obtain\ntelephone numbers, to reduce the potential non-response\nbias. All types of approach (initial data from GPs, web\nbased searches and further contact with practice staff)\nproved fruitful. The web-based searches were carried out\nearly to reduce the workload for practice staff as much as\npossible. However this transfers the burden to the\nresearcher, as the process of gaining access to websites and\nthe conduct of trial and error searches was time-consum-\ning. The very high contact rate achieved in this study indi-\ncates the value of using multiple sources to identify\ntelephone numbers. The use of multiple sources also\nreduces the opportunity for selection bias that could arise\nif only one or two sources were used.\nGaining access to some web-based directories required the\nresearcher to provide an e-mail address, a telephone\nnumber or personal details. Clearly some researchers may\nbe reluctant to give personal details because this might\nlead to unsolicited contacts. However this can be easily\novercome by providing dedicated mobile telephones and\ne-mail addresses for the duration of a study. A further\nproblem is that some websites charge for use. These costs\nare likely to be modest in comparison with the total study\ncosts, although researchers could take advantage of offers\nof free trials.\nMaking an approach by telephone might raise concerns in\nrespondents' minds about how the telephone number\nwas obtained. However the use of telephone surveys is a\ncommon practice[14,24,25] and telephone follow-up of\nnon-responders has been used to increase response rates\n[23,26]. In this study the refusal rate at each telephone\ncontact was small suggesting that there was little concern\nat being contacted. A previous study also found low levels\nof concern about telephone contact [27]. The lack of con-\ncern in the present study may have occurred because the\ninvitation letter informed the women that they would be\napproached and gave them the opportunity to opt out.\nAnother factor could be that unsolicited telephone con-\ntact by commercial organisations (tele-marketing) is now\ncommonplace. Although these arguments seem plausible,\ntelephone contact could raise ethical issues. People may\nbe unaware that their telephone numbers, including\nTable 1: Recruitment rate at successive telephone calls\nPhone call* Number telephoned Number of calls yielding interviews Refused\n1 359 60 (16.7%) 2 (0.6%)\n2 297 46 (15.5%) 4 (1.3%)\n3 247 81 (32.8%) 4 (1.6%)\n4 162 93 (57.4%) 6 (3.7%)\n5 63 5 (7.9%) 5 (7.9%)\n6 53 2 (3.8%) 4 (7.5%)\n* When a woman refused to participate no further contact attempts were made\nTable 2: Recruitment rate by method of approach\nMethod of approach Number approached Interviewed\nn (%*)\nRefused\nn (%*)\nNot contacted\nn (%*)\nInvitation letter 372 n\/a 3 (1.0) 6 (2.0)\nTelephone 359 287 (79.9) 25 (7.0) 47 (13.1)\nLetter seeking contact 51 12 (23.5) 10 (19.6) 29 (56.9)\nFirst home visit 29 6 (20.7) 7 (24.1) 16 (55.2)\nSecond home visit 16 0 (0) 4 (25.0) 12 (75.0)\n* Percentages were calculated using all those contacted by this method as the denominatorPage 4 of 6\n(page number not for citation purposes)\nBMC Medical Research Methodology 2009, 9:46 http:\/\/www.biomedcentral.com\/1471-2288\/9\/46mobile telephone numbers, could be found on websites.\nThus unexpected calls could raise concerns about privacy.\nFurther research on attitudes to contact by telephone\nwould seem warranted.\nAnother factor which might have helped increase the\ninterview rate was the interest of the topic to the mothers.\nAlthough we did not collect data on this we suspect that\nmany mothers of young children would enjoy discussing\ntheir child with others. There is good evidence that sali-\nency, the perceived importance of the topic, has a strong\neffect on response rates [28].\nMonetary incentives were not used to increase recruitment\nin this study. Participants were offered a €10 gift voucher\non completion of the study. Thus, the gift voucher was not\nused as an incentive to recruitment but as a reward for tak-\ning part. An even higher response rate may have been\nobtained if the €10 was offered to potential participants\nin the letter of invitation or during telephone contact with\nthe researcher.\nA technique which we did not use, refusal conversion, is\ncommon in national surveys [2,3,5]. In this, those who\ninitially refuse are approached by expert interviewers who\nattempt to persuade them to participate. Conversion\nattempts can be successful with up to 40% of refusers [29]\nand thus could have a considerable impact on non-\nresponse. Whether such methods would be acceptable to\nthe ethics committees that are important feature of medi-\ncal research, remains open to question.\nA limitation of the study is that it was not designed to\nanswer the question: was the final recruitment rate worth\nthe cost of the effort involved? This question needs to be\nlooked at explicitly by investigating costs using a different\nresearch design. Several other strategies have already been\ntested in randomised controlled trials eg financial incen-\ntives, hand signed letters, succinct questionnaires and the\nuse of reminders[6,7,11].\nConclusion\nThis study has found that a high response rate can be\nobtained for a hard to reach group. This was achieved by\nmaking multiple efforts to obtain accurate contact details,\ntogether with repeated efforts at contact. The strategy of\nusing telephone as the initial method of contact, although\nlittle used at present, may have considerable value for\nhome-based interview surveys.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthors' contributions\nThe initial survey was conceived by IKC and designed by\nIKC, LI, VS, KP, WLW, PWS. KK developed the methods to\nobtain telephone numbers and made all the attempts at\npatient contact. IKC, KK and LI conducted the analyses\nand wrote the initial draft of the manuscript. All authors\nthen contributed to produce the final manuscript.\nAcknowledgements\nWe are grateful to Lisa Stephen who carried out many web-based searches \nto identify telephone numbers. We would like to thank the staff in the gen-\neral practices who assessed patient suitability for inclusion in the study and \nprovided patient contact details. This paper describes methods used for a \nsurvey that was funded by the Chief Scientist Office, Scotland (CSO refer-\nence number CZH\/4\/205). This research grant funded KK (WTE) and LI \n(0.2 WTE). IKC, VS and WLW were funded by the Scottish Funding Coun-\ncil, KP and PWS were funded by NHS Tayside. The funding body approved \nthe protocol for the study prior to awarding the research grant, but had no \nfurther input into the conduct of the study, interpretation of the results or \nthe decision on where to publish the findings.\nReferences\n1. Singer E: Nonresponse Bias in Household Surveys.  Public Opin-\nion Quarterly 2006, 70:637-645.\n2. Smith T: Survey Non-Response Procedures in Cross-National\nPerspective: The 2005 ISSP Non-Response Survey.  Survey\nResearch Methods 2007, 1:45-54.\n3. Lynn P, Clarke P: Separating refusal bias and non-contact bias:\nevidence from UK national surveys.  The Statistician 2002,\n51:319-333.\n4. Abraham K, Maitland A, Bianchi S: Nonresponse in the American\nTime Use Survey. Who is missing from the data and how\nmuch does it matter?  Public Opinion Quarterly 2006, 70:676-703.\n5. Heerwegh D, Abts K, Loosveldt G: Minimizing survey refusal and\nnoncontract rates: do our efforts pay off?  Survey Research Meth-\nods 2007, 1:3-10.\n6. Scott P, Edwards P: Personally addressed hand-signed letters\nincrease questionnaire response: a meta-analysis of ran-\ndomised controlled trials.  BMC Health Services Research 2006,\n6:111.\n7. Edwards P, Roberts I, Clarke M, DiGuiseppi C, Pratap S, Wentz R, et\nal.: Methods to increase response rates to postal question-\nnaires.  Cochrane Database of Systematic Reviews 2007:MR000008.\n8. Nakash RA, Hutton JL, Jørstad-Stein EC, Gates S, Lamb SE: Maxim-\nising response to postal questionnaires – a systematic review\nof randomised trials in health research.  BMC Med Res Methodol\n2006, 6:5.\n9. Watson JM, Torgerson DJ: Increasing recruitment to ran-\ndomised trials: a review of randomised controlled trials.  BMC\nMed Res Methodol 2006, 6:34.\n10. Mapstone J, Elbourne D, Roberts I: Strategies to improve recruit-\nment to research studies.  Cochrane Database of Systematic Reviews\n2007:MR000013.\n11. Edwards P, Cooper R, Roberts I, Frost C: Meta-analysis of ran-\ndomised trials of monetary incentives and response to\nmailed questionnaires.  J Epidemiol Community Health 2005,\n59:987-999.\n12. Tishler CL, Bartholomae S: The recruitment of normal healthy\nvolunteers: a review of the literature on the use of financial\nincentives.  J Clin Pharmacol 2002, 42:365-375.\n13. Turrell G, Hewitt B, Patterson C, Oldenburg B: Measuring socio-\neconomic position in dietary research: is choice of socio-eco-\nnomic indicator important?  Public Health Nutr 2003, 6:191-200.\n14. Johnson T, Cho Y, Campbell R, Holbrook A: Using Community-\nLevel Correlates to Evaluate Nonresponse Effects in a Tele-\nphone Survey.  Public Opinion Quarterly 2006, 70:704-719.\n15. Lorant V, Demarest S, Miermans PJ, Van Oyen H: Survey error in\nmeasuring socio-economic risk factors of health status: a\ncomparison of a survey and a census.  Int J Epidemiol 2007,\n36:1292-9.Page 5 of 6\n(page number not for citation purposes)\nBMC Medical Research Methodology 2009, 9:46 http:\/\/www.biomedcentral.com\/1471-2288\/9\/46Publish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\n16. Zaslavsky A, Zaborski L, PD C: Factors affecting response rates\nto the Consumer Assessment of Health Plans Study survey.\nMed Care 2002, 40:485-99.\n17. Office of the Chief Statistician: Scottish Index of Multiple Depri-\nvation 2004 Technical Report.  Scottish Executive 2004 [http:\/\/\nwww.scotland.gov.uk\/Resource\/Doc\/26350\/0025281.pdf].\n18. 192.com   [http:\/\/www.192.com\/]\n19. The Phone Book from BT   [http:\/\/www.thephonebook.bt.com\/\npublisha.content\/en\/index.publisha]\n20. Mobile Numbers UK   [http:\/\/www.mobilenumbers.org\/]\n21. Love2reward   [http:\/\/www.love2reward.co.uk\/rewards\/]\n22. Siemiatycki J, Campbell S, Richardson L, Aubert D: Quality of\nresponse in different population groups in mail and tele-\nphone surveys.  Am J Epidemiol 1984, 120:302-14.\n23. Harris LE, Weinberger M, Tierney WM: Assessing inner-city\npatients' hospital experiences. A controlled trial of tele-\nphone interviews versus mailed surveys.  Med Care 1997,\n35:70-6.\n24. Smith W, Mitchell P, Attebo K, Leeder S: Selection bias from sam-\npling frames: telephone directory and electoral roll com-\npared with door-to-door population census: results from the\nBlue Mountains Eye Study.  Aust N Z J Public Health 1997,\n21:127-33.\n25. Smith W, Chey T, Jalaludin B, Salkeld G, Capon T: Increasing\nresponse rates in telephone surveys: a randomized trial.  J\nPublic Health Med 1995, 17:33-8.\n26. Fowler FJJ, Gallagher PM, Stringfellow VL, Zaslavsky AM, Thompson\nJW, Cleary PD: Using telephone interviews to reduce nonre-\nsponse bias to mail surveys of health plan members.  Med Care\n2002, 40:190-200.\n27. Hewison J, Haines A: Overcoming barriers to recruitment in\nhealth research.  BMJ 2006, 333:300-2.\n28. McColl E, Jacoby A, Thomas L, Soutter J, Bamford C, Steen N, et al.:\nDesign and use of questionnaires: a review of best pracitce\napplicable to surveys of health service staff and patients.\nHealth Technology Assessment 2001, 5:31.\n29. Burton J, Laurie H, Lynn P: The long-term effectiveness of\nrefusal conversion procedures on longitudinal surveys.  J R\nStatist Soc A 2006, 169:459-478.\nPre-publication history\nThe pre-publication history for this paper can be accessed\nhere:\nhttp:\/\/www.biomedcentral.com\/1471-2288\/9\/46\/prepubPage 6 of 6\n(page number not for citation purposes)\n"}