{"doi":"10.1103\/PhysRevA.74.023412","coreId":"66307","oai":"oai:dro.dur.ac.uk.OAI2:2037","identifiers":["oai:dro.dur.ac.uk.OAI2:2037","10.1103\/PhysRevA.74.023412"],"title":"High-order above-threshold ionization of argon : plateau resonances and the Floquet quasienergy spectrum.","authors":["Potvliege,  R. M.","Vucic,  S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-08","abstract":"The Floquet quasienergy spectrum of argon in a strong laser field of 800 nm wavelength is calculated for intensities up to 7×1013  W  cm–2, and beyond for some states, using a discrete complex basis set. Many of the dressed excited states of interest shift nonponderomotively in complicated ways but keep an ionization width narrow enough to produce sharp enhancements of above-threshold ionization (ATI) through Stark-shift-induced resonances. The quasienergy map is compared to high-resolution ATI spectra for 120  fs Ti:sapphire pulses [Nandor et al., Phys. Rev. A 60, R1771 (1999)]. The plateau enhancements happen at intensities where the dressed ground state is in resonance or in the wing of resonances with dressed excited states. The resonant dressed states are identified. In many cases, the same state is responsible for an enhancement of ATI in the low as well as the high orders. No evidence is found for enhancements that are not concomitant with any curve crossing and could thereby be interpreted as channel-closing enhancement","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66307.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2037\/1\/2037.pdf","pdfHashValue":"5c94f0f5a70699e0be343989ee89ed451a257a6e","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2037<\/identifier><datestamp>\n      2010-09-20T15:07:09Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        High-order above-threshold ionization of argon : plateau resonances and the Floquet quasienergy spectrum.<\/dc:title><dc:creator>\n        Potvliege,  R. M.<\/dc:creator><dc:creator>\n        Vucic,  S.<\/dc:creator><dc:description>\n        The Floquet quasienergy spectrum of argon in a strong laser field of 800 nm wavelength is calculated for intensities up to 7×1013  W  cm–2, and beyond for some states, using a discrete complex basis set. Many of the dressed excited states of interest shift nonponderomotively in complicated ways but keep an ionization width narrow enough to produce sharp enhancements of above-threshold ionization (ATI) through Stark-shift-induced resonances. The quasienergy map is compared to high-resolution ATI spectra for 120  fs Ti:sapphire pulses [Nandor et al., Phys. Rev. A 60, R1771 (1999)]. The plateau enhancements happen at intensities where the dressed ground state is in resonance or in the wing of resonances with dressed excited states. The resonant dressed states are identified. In many cases, the same state is responsible for an enhancement of ATI in the low as well as the high orders. No evidence is found for enhancements that are not concomitant with any curve crossing and could thereby be interpreted as channel-closing enhancement.<\/dc:description><dc:subject>\n        MULTIPHOTON PROCESSES; HARMONIC-GENERATION; ATOMIC-HYDROGEN; LASERFIELD; 248 NM; ENHANCEMENT; STATES; TIME; DYNAMICS; HELIUM<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review A, 2006, Vol.74(2), pp.023412 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2037<\/dc:identifier><dc:identifier>\n        issn:1050-2947<\/dc:identifier><dc:identifier>\n        issn: 1094-1622<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevA.74.023412<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2037\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevA.74.023412<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2037\/1\/2037.pdf<\/dc:identifier><dc:rights>\n        © 2006 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-2947"," 1094-1622","1050-2947","issn: 1094-1622"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["MULTIPHOTON PROCESSES; HARMONIC-GENERATION; ATOMIC-HYDROGEN; LASERFIELD; 248 NM; ENHANCEMENT; STATES; TIME; DYNAMICS; HELIUM"],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n20 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPotvliege, R. M. and Vucic, S. (2006) ’High-order above-threshold ionization of argon : plateau resonances\nand the Floquet quasienergy spectrum.’, Physical review A., 74 (2). 023412.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.74.023412\nPublisher’s copyright statement:\n2006 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nHigh-order above-threshold ionization of argon: Plateau resonances and the Floquet\nquasienergy spectrum\nR. M. Potvliege\nDepartment of Physics, Durham University, Durham DH1 3LE, United Kingdom\nSvetlana Vučić\nInstitute of Physics, Pregrevica 118, 11080 Belgrade-Zemun, Serbia\n\u0001Received 18 May 2006; published 31 August 2006\u0002\nThe Floquet quasienergy spectrum of argon in a strong laser field of 800 nm wavelength is calculated for\nintensities up to 7\u00011013 W cm−2, and beyond for some states, using a discrete complex basis set. Many of the\ndressed excited states of interest shift nonponderomotively in complicated ways but keep an ionization width\nnarrow enough to produce sharp enhancements of above-threshold ionization \u0001ATI\u0002 through Stark-shift-induced\nresonances. The quasienergy map is compared to high-resolution ATI spectra for 120 fs Ti:sapphire pulses\n\u0003Nandor et al., Phys. Rev. A 60, R1771 \u00011999\u0002\u0004. The plateau enhancements happen at intensities where the\ndressed ground state is in resonance or in the wing of resonances with dressed excited states. The resonant\ndressed states are identified. In many cases, the same state is responsible for an enhancement of ATI in the low\nas well as the high orders. No evidence is found for enhancements that are not concomitant with any curve\ncrossing and could thereby be interpreted as channel-closing enhancement.\nDOI: 10.1103\/PhysRevA.74.023412 PACS number\u0001s\u0002: 32.80.Rm, 42.50.Hz\nI. INTRODUCTION\nThe above-threshold ionization \u0001ATI\u0002 spectrum of atoms\nexposed to intense laser pulses normally decreases in mag-\nnitude after the first few orders, levels off in a plateau, and\nthen drops to noise level \u00031\u0004. The structure of the spectrum\ncan be readily explained by a simple classical model, the\n“simple-man model”: the plateau is formed by photoelec-\ntrons that rescatter from their parent ion before escaping,\nwhile those that do not rescatter \u0001the majority\u0002 contribute\nonly to the low ATI orders \u00032\u0004. It has been known from some\ntime that the emission of low-energy electrons is strongly\nenhanced, and often completely dominated, by series of mul-\ntiphoton resonances between the ground state and excited\nstates Stark shifted by the field \u00033\u0004. More recently, detailed\nmeasurements of ATI in argon and xenon have revealed that\nthe plateau part of the spectrum is also dominated by narrow\nresonancelike structures appearing at specific intensities, at\nleast for pulse durations not shorter than those used in these\nexperiments \u0001120 fs\u0002 \u00034–6\u0004. High-precision calculations on\none-electron, three-dimensional models of argon and helium\nhave revealed that these enhancements occur at particular\nintensities where the atom is in a state akin to a superposition\nof the ground state and of one or several excited states,\nand in which the electron, driven back and forth by the field,\nhas a high probability of recolliding with the ionic core and\nbeing scattered in the polarization direction \u00036–13\u0004. This\nfinding indicated that the plateau enhancements originate\nfrom Stark-shift-induced resonances, like the enhancements\npreviously found in the low-energy part of the spectrum.\nHowever, not all the resonant states were identified with\nparticular field-free bound states.\nExcited states are ignored in the simple-man model and in\nits semiclassical counterpart \u00031\u0004. Instead of resonances with\nexcited states, the semiclassical calculations predict the exis-\ntence of plateau enhancements at particular intensities where\na multiphoton ionization channel closes due to the Stark shift\nof the initial state with respect to the continuum threshold\n\u000314\u0004. These enhancements can be ascribed to photoelectrons\nwhich linger for a long time in the vicinity of the core before\nbeing scattered and ejected with a large drift momentum.\nThis mechanism differs fundamentally from the one outlined\nabove only in that ordinary Stark-shift-induced resonances\ndepend on an interaction between the initial state and a reso-\nnant excited state, while channel-closing induced enhance-\nments do not. They have been found in full quantum me-\nchanical calculations on the multiphoton detachment of\nelectrons from a zero-range potential, which does not support\nany excited state \u000315\u0004. They may have been observed in de-\ntachment from one-dimensional potentials, too; however, it is\npossible that these structures were ordinary Stark-shift-\ninduced resonances with light-induced states lying very close\nto the continuum threshold \u000316\u0004. Channel-closing enhance-\nments have been proposed as an alternative explanation of\nthe plateau resonances in rare gases: they would occur in this\ncase not when an actual multiphoton channel closes—none\nhave been found so far at these intensities—but when the\nground state crosses an effective continuum threshold lower\nthan the actual threshold \u000314\u0004.\nThe question of the origin of plateau resonances in rare\ngases has remained topical, given the current interest in the\nrole played by the electron-core interaction in recollisional\nprocesses \u000317\u0004 and for multiphoton processes in ultrashort\npulses. One may indeed wonder to what extent the dephasing\nof slow electrons due to their interaction with the core might\naffect the building up of channel-closing enhancements, and\nhow these enhancements and the resonances with excited\nstates evolve as the pulse duration is gradually reduced\n\u000314,18,19\u0004. A better understanding of plateau resonances in\nlong pulses would be useful on both fronts. In this work, our\nmain aim is to shed more light on their origin by comparing\nexisting high-resolution ATI spectra of argon to a newly\nPHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n1050-2947\/2006\/74\u00012\u0002\/023412\u000111\u0002 ©2006 The American Physical Society023412-1\ncompiled Floquet quasienergy map of this atom.\nFor relatively long pulses such as the 120 fs Ti:sapphire\npulses we are considering here, it is useful to analyze the\ndynamics of the atom in terms of an interplay between\ndressed states. These generalize the concept of stationary\nstates of an unperturbed atom to quasistationary states of an\natom exposed to a monochromatic laser field \u000320\u0004. They are\ndescribed by state vectors of the Floquet form \u0005\u0002\u0001t\u0002\u0006=exp\u0001\n−i\u0003t \/ \u0004 \u0002 \u0005F\u0001t\u0002\u0006, where \u0005F\u0001t\u0002\u0006 is periodic in time with the same\nperiod as the field and \u0003, the quasienergy, is complex for\nbound states undergoing photoionization. Stark-shift-induced\nresonances occur at intensities where the real part of the\nquasienergy of the dressed ground state matches the real part\nof the quasienergy of a dressed excited state within an inte-\nger multiple of the photon energy \u000321–24\u0004. As has been dem-\nonstrated in one-dimensional models \u000316\u0004, high-order ATI\ncan be enhanced by such resonances.\nWe calculate the quasienergy spectrum for a wavelength\nof 800 nm and intensities up to 70 TW cm−2 \u0001and beyond for\nselected states\u0002. The quasienergies are obtained as complex\neigenvalues of the complex-rotated Hamiltonian represented\non a discrete basis of Sturmian functions and spherical har-\nmonics \u000324–27\u0004. To the best of our knowledge, this is the\nfirst comprehensive compilation of the Floquet map of a\ncomplex atom in the visible or in the infrared \u000328\u0004. We\npresent this spectrum in some detail, given that the wave-\nlength and the species are of experimental interest, that the\nprecise location of each crossing is important for identifying\nplateau resonances, and that its main features are generic.\nMany of the states shift in complicated ways through a\nplethora of avoided crossings, changing character as the in-\ntensity increases. The assignment of resonances to field-free\nstates is therefore fraught with difficulties.\nChannel-closing enhancements should have no counter-\npart in the quasienergy spectrum, since they do not involve\nexcited states. However, we find that all the plateau enhance-\nments observed in the experimental ATI spectrum and in the\ntime-dependent calculations are associated with quasienergy\ncurve crossings, albeit loosely in some cases. Even at high\nintensity, the widths of the relevant resonant dressed states\nare not so large that the resonance structures are washed\naway.\nThe calculation of the quasienergy spectrum is outlined in\nSec. II. The results are presented in Sec. III, and conclusions\nare drawn in Sec. IV. The low-energy part of the ATI spec-\ntrum at intensities between 50 and 66 TW cm−2 is discussed\nin the Appendix.\nII. THEORY\nAs in Ref. \u00036\u0004, we describe the atom by the one-electron\nmodel potential\nW\u0001r\u0002 = \u00031 + Ae−Br + \u000117 − A\u0002e−Cr\u0004\/r \u00011\u0002\nin atomic units, where A=5.25, B=0.97, and C=3.7131 for\nthe series converging to the 3p5 2P3\/2\no threshold, and A=7.3,\nB=1.15, and C=4.5823 for the series converging to the\n3p5 2P1\/2\no threshold. Apart from the deeply bound 1s, 2s, 2p,\nand 3s states, which have no counterpart among the valence\nstates of the real atom, and the 4s state, for which there is a\n2% difference, the energy levels of the model practically\ncoincide with the centroids of the experimental fine-structure\nmultiplets \u000329\u0004.\nWe assume that the field is linearly polarized in the z\ndirection and write the Hamiltonian as\nH\u0001t\u0002 = H0 + i \u0004\ne\nm\nA\u0001t\u0002\n\u0001\n\u0001z\n+\ne2\n2m\nA2\u0001t\u0002 . \u00012\u0002\nIn this equation, H0 denotes the field-free Hamiltonian of the\nmodel atom, A\u0001t\u0002 the vector potential of the field, and m and\ne the mass and the absolute charge of the electron. We set\nA\u0001t\u0002= \u0001F0 \/\u0005\u0002 sin\u0001\u0005t\u0002. Within the dipole approximation, the\nterm proportional to A2\u0001t\u0002 has no influence on the photoion-\nization dynamics and can be removed from H\u0001t\u0002 by a simple\ngauge transformation \u000330\u0004. In the following, we use the\ntransformed Hamiltonian\nH\u0001\u0001t\u0002 = H0 + i \u0004\ne\nm\nA\u0001t\u0002\n\u0001\n\u0001z\n. \u00013\u0002\nApart for an overall intensity-dependent shift of all levels by\n−Up, where Up=e2F0\n2 \/ \u00014m\u00052\u0002, H\u0001\u0001t\u0002 has the same quasien-\nergy spectrum as H\u0001t\u0002 \u000323\u0004. \u0001Up is the ponderomotive energy,\ni.e., the cycle-averaged energy of a free electron with zero\ndrift velocity oscillating in the field.\u0002 The energy of a con-\ntinuum state lying just above the ionization threshold is equal\nto Up when calculated using H\u0001t\u0002. It therefore varies with the\nintensity. By contrast, this energy is 0 when calculated using\nH\u0001\u0001t\u0002, because of the general shift of all energy levels by\n−Up. The position of the ionization threshold defined by\nH\u0001\u0001t\u0002 thus remains the same at all intensities. The real part of\nthe quasienergy of the high Rydberg states also remains \u0001al-\nmost\u0002 constant as a function of the intensity, while the\nreal part of the quasienergy of the ground state shifts down-\nward by approximately −Up. The effective binding energy of\nthe ground state thus increases with intensity. However, the\ndifference in energy between any two dressed states is the\nsame whether one uses H\u0001t\u0002 or H\u0001\u0001t\u0002. The drift kinetic energy\nof a photoelectron detached by absorption of N photons from\na state with quasienergy \u0003 is simply Re \u0003+N\u0004\u0005 if \u0003 is\ncalculated using H\u0001\u0001t\u0002.\nTo obtain the quasienergies, we seek solutions of the\nSchrödinger equation of the form \u000330\u0004\n\u0002\u0001r,t\u0002 = e−i\u0003t\/\u0004\u0007\nN\ne−iN\u0005tFN\u0001r\u0002 . \u00014\u0002\nThe index N characterizes the net number of real or virtual\nphotons absorbed by the atom. Making this ansatz and equat-\ning the terms oscillating as the same power of exp\u0001i\u0005t\u0002 in the\nSchrödinger equation yields the following system of coupled\ntime-independent equations:\n\u0001\u0003 + N \u0004 \u0005 − H0\u0002FN = V+FN−1 + V−FN+1. \u00015\u0002\nThe operators V+ and V− are defined by the equation\nR. M. POTVLIEGE AND SVETLANA VUČIĆ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-2\ni \u0004\ne\nm\nA\u0001t\u0002\n\u0001\n\u0001z\n= V+e−i\u0005t + V−ei\u0005t. \u00016\u0002\nEquation \u00015\u0002 must be solved for the harmonic components\nFN\u0001r\u0002 and the quasienergy \u0003. For a solution to represent a\nbound state dressed by the field and undergoing photoioniza-\ntion, the harmonic components must be regular at the\nnucleus and must behave at asymptotic distances as superpo-\nsitions of outgoing waves in the open channels and damped\nwaves in the closed channels \u000331\u0004; namely,\nFN\u0001r\u0002 \b \u0007\nM\nfMNr−i\u0006M eikMr\/r, r → \u0007 , \u00017\u0002\nwith \u0006M =me2 \/ \u00014\b\u00030\u00042kM\u0002 and\nkM = \u0003\u00012m\/\u00042\u0002\u0001\u0003 + M \u0004 \u0005\u0002\u00041\/2. \u00018\u0002\nThe branch of the square root function is chosen so that\nRe kM\t0 for Re \u0003+M\u0004\u0005\t0 and Im kM\t0 for Re \u0003\n+M\u0004\u0005\n0. These Siegert boundary conditions make the\nquasienergy complex: If E is the energy that \u0003 reduces to in\nthe zero-field limit, \u000b the ac Stark shift of the state, and \f its\nphotoionization width, then \u0003=E+\u000b− i\f \/2.\nWe calculate the quasienergies by expanding the har-\nmonic components on a discrete basis of spherical harmonics\nand complex radial Sturmian functions \u000324–26\u0004. The result-\ning eigenvalue problem for the quasienergy and the coeffi-\ncients of the expansion is solved by Arnoldi iterations. Spu-\nrious solutions arising from numerical inaccuracies and\nsolutions representing approximate continuum states rather\nthan the relevant decaying bound states are eliminated by\nignoring the quasienergies that are not stable with respect to\nreasonable variations of the parameters of the Sturmian func-\ntions. \u0001The Sturmian basis is inadequate for representing\ndressed continuum states.\u0002\nIII. RESULTS AND DISCUSSION\nA. Quasienergy spectrum\nAll our calculations have been carried out for a field of\n800 nm wavelength \u0001\u0004\u0005=1.55 eV\u0002. The spectra for the two\ncore symmetries of the excited states \u0001J=1\/2 and 3\/2\u0002 are\nvery similar. The only important difference is that the energy\nlevels with J=1\/2 are about 0.18 eV higher with respect to\nthe ground state, which has the consequence that the Stark-\nshift-induced resonances between the dressed ground state\nand most dressed excited states occur at intensities weaker\nby about 3 TW cm−2 for J=1\/2 than for J=3\/2. However,\nwith rare exceptions, the energy of the photoelectrons emit-\nted at these resonances is practically the same for both\nsymmetries.\nThe J=3\/2 spectrum between 0 and 70 TW cm−2 is dis-\nplayed in Fig. 1. Each dot represents a calculated quasien-\nergy. To facilitate the discussion of the results, each value of\nRe \u0003 is plotted shifted upward by an integral multiple of the\nphoton energy, N\u0004\u0005, with N chosen such that 0\rRe \u0003\n+N\u0004\u0005\r \u0004\u0005. Re \u0003 being counted from the ionization thresh-\nold, the vertical axis of the diagrams gives the energy of the\nphotoelectrons emitted in the zeroth ATI order. As the basis\nset used in the calculation is not suitable for resolving the\ndressed Rydberg states accumulating between −0.25 and\n0 eV, modulo \u0004\u0005, no results are presented between \u0004\u0005\n−0.25 eV \u00011.30 eV\u0002 and \u0004\u0005+0 eV \u00011.55 eV\u0002. Dressed excit-\nedstates that do not interact with the dressed ground state\nunder the dipole selection rules are not shown, and neither\nare the dressed 1s, 2s, 2p, and 3s states. Due to numerical\ninstabilities, some of the quasienergy curves could not be\nfollowed below or above certain intensities, at which they\nseem to start or end abruptly.\nBeing deeply bound, the dressed ground state shifts little\nin the field, apart from the downward shift by −Up intro-\nduced by the removal of the term proportional to A2\u0001t\u0002 from\nthe Hamiltonian. The solid straight lines indicate where the\npoints corresponding to this state would lie if its Stark shift\nwas exactly −Up. Its actual trajectory \u0001i.e., the trajectory of\nthe dressed 3pm=0 state of the one-electron model\u0002 is traced\nby the alignments of points closely following the solid lines.\nAll the other quasienergies pertain to dressed excited states.\nThe atom must absorb at least 11 photons to ionize from the\nground state in weak fields. As the intensity increases, the ac\nStark shift of this state lowers its energy with respect to the\ncontinuum limit, with the effect that it passes under the 12-\nphoton ionization threshold at 21 TW cm−2. \u0001That is, 11-\nphoton ionization becomes impossible and 12 photons are\nrequired to ionize the atom.\u0002 Likewise, the atom passes the\n13-photon threshold at 47 TW cm−2 and the 14-photon\nthreshold at 73 TW cm−2. Each crossing of an ionization\nthreshold is accompanied by a change in the parity of the\nRydberg states the ground state can couple to within the di-\npole selection rules, and therefore by a change in the set of\nthe dressed excited states the dressed ground states can in-\nteract with. The dressed states relevant between the 12- and\nthe 13-photon thresholds are shown in Fig. 1\u0001b\u0002, while those\nrelevant below the 12-photon threshold or between the 13-\nand 14-photon thresholds are shown in Fig. 1\u0001a\u0002. The divi-\nsion ensures that the curve crossings visible in these\ndiagrams all correspond to Stark-shift-induced resonances\nbetween the corresponding dressed states.\nMore information about the crossings involving the\ndressed ground state is provided in Table I. Columns \u0001a\u0002 and\n\u0001b\u0002 of the table give the intensity at which each of these\noccurs and the corresponding photoelectron energy in the\nzeroth-order ATI peak \u0001i.e., the horizontal and vertical coor-\ndinates of these crossings in the diagrams\u0002. Column \u0001c\u0002 gives\nthe energy width of the resonant states, \f, at their crossing. It\nis worth noting that a width of 0.05 eV corresponds to an\nionization lifetime \u0004 \/\f of about 13 fs. Even at large intensi-\nties, many dressed excited states have a width of the order of\n0.05 eV or smaller at their crossing with the ground state. If\npopulated at the resonance, these states may therefore with-\nstand several optical cycles before being photoionized. Their\nlifetime may seem surprisingly long, given that all excited\nstates of argon may decay by over-the-barrier ionization at\nthe intensities considered. However, one should keep in mind\nthat over-the-barrier ionization is not efficient if the laser\nperiod is shorter than the orbital period \u0001because the electron\nis then unlikely to have enough speed to leave before the\nelectric field reverts\u0002, which is the case for all the excited\nstates important here.\nHIGH-ORDER ABOVE-THRESHOLD IONIZATION OF¼ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-3\nFor each crossing, the field-free state that the quasienergy\ncurve of the resonant state reduces to in the zero-field limit is\nspecified in column \u0001d\u0002, when known. For convenience, we\nuse these limits as labels identifying the various dressed\nstates. It should be noted, however, that the dressed states\noften have a different character at high intensity than in weak\nfields. This can be seen by comparing columns \u0001d\u0002 and \u0001e\u0002 of\nthe table. The latter identifies the partial waves that dominate\nthe wave function of the resonant state at the crossing inten-\nsity \u000332\u0004. For example, the state developing adiabatically\nfrom the 7g state has a predominantly s character at its cross-\ning with the ground state at 26 TW cm−2: its wave function is\ndominated by a partial wave with l=0, which accounts for\n51% of its norm at that intensity, while its most important\npartial wave with l=4 only contributes 32% of its norm. \u0001We\ncount the photon numbers N with respect to the dominant\nharmonic component of the dressed ground state. Therefore,\nthe values given in the table also indicate the order of the\nresonances with the various dressed excited states.\u0002 The\nstates of largest angular momentum—the 6h, 7h, and 7i\nstates—keep their character up to high intensities. These ex-\ncited states also have a particularly long lifetime and follow\nstraight-line, almost horizontal trajectories in Fig. 1. \u0001The 7i\nstate is visible at 1.27 eV in the right-hand side of Fig. 1,\nalthough its quasienergy curve is partly hidden by other ex-\ncited states. The other two states can be seen at about 1.16\nand 1.26 eV in the left-hand side of the figure.\u0002 Their\nmomentum-space distribution is sharply peaked at p=0,\nwhich explains why they couple relatively little with the\nfield. Some other states simply swap character in avoided\ncrossings, e.g., the 9s and the 7g, the 8s and the 6g, the 7s\nand the 5g, and the 8p and the 7f . Low excited states tend to\n0 10 20 30 40 50 60 70\nIntensity (TW cm−2)\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\nEn\ner\ngy\n (e\nV)\n0 10 20 30 40 50 7060\nIntensity (TW cm−2)\nFIG. 1. Real part of the quasienergies of Ar in a laser field of 800 nm wavelength vs intensity. The atom is described by the model\npotential for the J=3\/2 core. The solid straight lines represent the trajectory of the dressed ground state in the absence of any nonpondero-\nmotive shift. Left-hand side: dressed states interacting with the ground state below 21 TW cm−2 and above 47 TW cm−2; right-hand side:\ndressed states interacting with the ground state between 21 and 47 TW cm−2.\nR. M. POTVLIEGE AND SVETLANA VUČIĆ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-4\nlose their zero-field identity even at moderate intensities. For\nexample, the dressed 6p state has a mixed p and f character\nat its first crossing with the ground states, at 8.6 TW cm−2,\nand no clear character at its second crossing, at\n59.6 TW cm−2. The dressed 4f state, which is dominated by\nl=1 partial waves when it crosses the ground state at\n64.5 TW cm−2, has already acquired a p character at the rela-\ntively low intensity of 10 TW cm−2.\nThe dressed ground state is much more stable than the\ndressed excited states considered here. Its energy width is at\nmost 5.5\u000110−5 eV below 70 TW cm−2, corresponding to a\nlifetime of at least 4500 optical cycles. Because of this dis-\ncrepancy in energy widths, one can expect that all the cross-\nings it undergoes are direct in the real part of the quasienergy\n\u000322,23\u0004. This is borne out by the absence in Fig. 1 of avoided\ncrossings involving the ground state. However, we cannot\nexclude that some of the crossings are actually avoided\nrather than direct, with an unresolved energy gap of the order\nof 5 meV or less. Physically, there is little difference be-\ntween these two cases, because the variation of the intensity\nin a realistic laser pulse would be fast enough for the atom to\njump diabatically across any energy gap of that width. Given\nthe speed at which the ground state shifts with respect to the\nexcited states, the two dressed states involved would then\ninterchange character within a negligibly small region of in-\ntensity. Whether their crossing is avoided or not, the two\nstates may influence each other over the whole range of in-\ntensity where they overlap in energy, with the dressed ground\nstate acquiring some of the character of the resonant state\nand conversely. The resonances may thus affect ionization\nfrom the ground state without transfer of population to the\ndressed resonant state \u000333\u0004.\nThe changes in the wave function of the dressed ground\nstate between 54 and 70 TW cm−2 are illustrated by Fig. 2.\nThe resonant states are dominated by their N=12 harmonic\ncomponent in this range of intensity, with the exception of\nthe dressed 6p state. Correspondingly, certain partial waves\nof the N=12 harmonic component of the dressed ground\nstate are enhanced as it shifts through the width of the reso-\nnant states. Note, in particular, the large increase of the f\nwave around 60 TW cm−2 and of the p wave around\n64 TW cm−2. These increases are concomitant with the\ncrossings, respectively, of the dressed 5f state \u0001which has a\ndominant f character\u0002 and of the dressed 4f state \u0001which has\na dominant p character\u0002. The width of the ground state and\nthe shift of the resonant states being both negligible, the\nintensity width of each enhancement reflects the energy\nwidth of the resonant state. Since ionization from the dressed\nground state may be enhanced in the whole range of intensity\nwhere its quasienergy falls within the width of the resonant\nstate, the width of the corresponding resonance peak in the\nATI spectrum will be equal to the ionization width of the\ndressed excited state, even without transfer of population to\nthe latter.\nB. Resonances in the ATI energy spectra\nWe now examine the ATI energy spectra obtained\nat 800 nm by Nandor et al. \u00036\u0004. The pulses used in their\nTABLE I. Details of the crossings visible in Fig. 1 between the\ndressed ground state and the dressed excited states \u0001J=3\/2 core\u0002.\n\u0001a\u0002 Crossing intensity in TW cm−2. \u0001b\u0002 Photoelectron energy at the\nresonance, within the range \u00030, \u0004\u0005\u0004, in eV. \u0001c\u0002 Ionization width of\nthe resonant dressed state \f in eV. \u0001d\u0002 Adiabatic zero-field limit of\nthe resonant dressed state. \u0001e\u0002 Composition of the resonant state \u0001the\nphoton index N and the orbital angular momentum quantum number\nl of the dominant partial waves, and their contributions to the norm\nof the wave function, in %\u0002. \u0001f\u0002 Same as \u0001b\u0002, but for the crossing of\nthe same dressed excited state with the dressed ground state\nbetween 73 and 99 TW cm−2.\n\u0001a\u0002 \u0001b\u0002 \u0001c\u0002 \u0001d\u0002 \u0001e\u0002 \u0001f\u0002\n25.6 1.30 0.014 ? N=11, l=2 \u000179%\u0002\n26.0 1.28 0.032 7g N=11, l=0 \u000151%\u0002 1.29\nN=11, l=4 \u000132%\u0002\n26.0 1.27 0.016 9s N=11, l=4 \u000146%\u0002 1.27\nN=11, l=0 \u000134%\u0002\n26.2 1.27 0.0001 7i N=11, l=6 \u000169%\u0002 1.26\n27.0 1.21 0.022 7d N=11, l=2 \u000176%\u0002 1.23\n27.5 1.18 0.046 8s N=11, l=0 \u000155%\u0002 1.21\nN=11, l=4 \u000123%\u0002\n27.6 1.18 0.034 6g N=11, l=4 \u000145%\u0002 1.17\nN=11, l=0 \u000124%\u0002\n29.2 1.08 0.041 6d N=11, l=2 \u000168%\u0002 1.11\n30.0 1.04 0.070 7s N=11, l=0 \u000173%\u0002 1.09\n30.7 1.00 0.049 5g N=11, l=4 \u000137%\u0002 0.99\nN=10, l=3 \u000114%\u0002\n33.0 0.86 0.097 5d N=11, l=2 \u000151%\u0002 0.89\n34.3 0.78 0.140 6s N=11, l=0 \u000158%\u0002 0.69\n40.8 0.39 0.231 ? N=11, l=0 \u000129%\u0002 0.50\nN=11, l=2 \u000115%\u0002\n44.1 0.19 0.360 4d N=10, l=1 \u000115%\u0002 0.01\nN=11, l=0 \u000110%\u0002\n51.7 1.29 0.029 9p N=12, l=3 \u000168%\u0002\n52.0 1.26 0.005 7h N=12, l=5 \u000153%\u0002\n52.2 1.25 0.038 7f N=12, l=1 \u000164%\u0002\n53.2 1.19 0.048 8p N=12, l=3 \u000158%\u0002\n53.8 1.16 0.005 6h N=12, l=5 \u000134%\u0002\nN=11, l=4 \u000115%\u0002\nN=13, l=6 \u000111%\u0002\n54.1 1.14 0.062 6f N=12, l=1 \u000156%\u0002\n55.8 1.04 0.086 ? N=12, l=3 \u000140%\u0002\n57.1 0.96 0.134 7p N=12, l=1 \u000133%\u0002\nN=11, l=0 \u000111%\u0002\n59.6 0.81 0.400 6p N=11, l=0 \u000118%\u0002\nN=11, l=2 \u000117%\u0002\nN=12, l=1 \u000117%\u0002\n60.5 0.75 0.203 5f N=12, l=3 \u000113%\u0002\nN=11, l=2 \u000112%\u0002\n64.5 0.51 0.321 4f N=12, l=1 \u000125%\u0002\nN=10, l=1 \u000111%\u0002\nHIGH-ORDER ABOVE-THRESHOLD IONIZATION OF¼ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-5\nexperiment had a duration of 120 fs. Their calculations were\ndone for 45-cycle flat-top pulses smoothly turned on over an\nhalf optical cycle. An ATI spectrum was calculated for a\nnumber of such pulses. These results were then averaged\nover the spatial and temporal distributions of intensity of the\nexperimental pulses and over the two core symmetries of the\nexcited states, so as to yield theoretical spectra that could be\ncompared to the data. We concentrate here on the theoretical\nspectra, as they reproduce all the features of the experimental\nspectra but have a higher resolution. The photoelectron yield\nis shown in Figs. 3–5 below, for three different pulse peak\nintensities and for five consecutive ATI orders belonging to\nthe plateau part of the spectrum. For each order, the yield is\nplotted as a function of the reduced energy, Er=Eph−S\u0004\u0005,\nwhere Eph is the photoelectron energy and S is the number of\nexcess photons \u0001S=1 in the first order, 2 in the second order,\netc.\u0002 Photoelectron energies differing by integral multiples of\n\u0004\u0005 all correspond to the same value of Er, and Er varies\nbetween 0 and \u0004\u0005.\nThe agreement between calculated and measured spectra\nshows that the plateau resonances can be understood from\nthe response of the atom to a stationary field. It is therefore\nmeaningful to compare the results of Figs. 3–5 to the\nquasienergy spectrum of Fig. 1. However, since most of the\nrelevant resonances overlap to some extent, the structures\nthey induce in the yield may vary from ATI order to ATI\norder and may be more complex than simple Lorentzian\npeaks. The profile of the resonances may also be affected by\nthe finite resolution of the calculation and by the averaging\nover the distribution of intensity. In some cases, it may also\nbe slightly broadened by the difference in energy between\nthe two core symmetries.\nTransfer of population between dressed states is possible\nwhen the intensity varies \u000334\u0004. We expect that the fast turnon\nof the flat-top pulses used in the calculations of Ref. \u00036\u0004 left\nthe atom in a superposition of the dressed ground state\n\u0001mainly\u0002 and of the neighboring resonant states \u0001to a small\nextent\u0002. A resonance structure in the ATI spectrum may thus\noriginate primarily from ionization from one or several of\nthese dressed excited states. Alternatively, if there was little\nor no transfer, it may originate primarily from ionization\nfrom the dressed ground state. The Floquet map alone does\nnot offer much information about which of these two mecha-\nnisms might predominate. However, it is likely that both pro-\nduce similar resonance structures, since, as we have seen at\nthe end of last section, dressed states imprint their “image” in\nthe dressed ground state.\n1. Low intensities\nLet us first consider ionization in a pulse with a peak\nintensity of 44.5 TW cm−2 \u0001Fig. 3\u0002. This field is strong\n54 58 62 66 70\nIntensity  (TW cm−2)\n0\n0.001\n0.002\nCo\nnt\nrib\nut\nio\nn \n (%\n)\nFIG. 2. \u0001Color online\u0002 Contribution of the l=1 \u0001closed circles\u0002, 3\n\u0001open circles\u0002, and 5 \u0001crosses\u0002 partial waves of the N=12 harmonic\ncomponent of the dressed ground state to the norm of its wave\nfunction, in %. The range of intensity considered covers the last six\nentries of Table I.\n0.0 0.5 1.0 1.5\nReduced energy (eV)\n0\n100\n200\n300\nYi\nel\nd \n(ar\nb. \nun\n.)\nFIG. 3. \u0001Color online\u0002 Theoretical ATI energy spectrum for an\nexperimental 800 nm pulse of 44.5 TW cm−2 peak intensity, as cal-\nculated by numerically integrating the time-dependent Schrödinger\nequation \u00036\u0004. Solid curves, from top to bottom: yield in the 12th,\n13th, 14th, 15th, and 16th ATI orders. For clarity, each curve has\nbeen shifted vertically by an arbitrary amount. The horizontal axis\nis the photoelectron energy reduced to the interval \u00030, \u0004\u0005\u0004. Adapted\nfrom Ref. \u000335\u0004, with permission.\nR. M. POTVLIEGE AND SVETLANA VUČIĆ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-6\nenough that the ground state may be in resonance with the\ndressed excited states shown in the right-hand side of Fig. 1.\n\u0001The states shown in the left-hand side can be ignored here\nas emission in the 12th and higher ATI orders is negligible\nbelow 21 TW cm−2.\u0002 The details of the relevant crossings are\nprovided in the top half of Table I.\nThe two most prominent features of the low-order ATI\nspectrum in such relatively weak pulses are a narrow peak at\nEr=1 eV and a broad enhancement covering much of the\nregion below 0.7 eV \u00038,13\u0004. \u0001Here and in the following, all\nenergies refer to reduced energies Er. The structures men-\ntioned are visible in several ATI orders.\u0002 The analysis of the\ntime-dependent wave function shows that the narrow peak\noriginates from a resonance with the 5g state \u00038,13\u0004. The\nsame conclusion can be drawn from the quasienergy spec-\ntrum, as the maximum is centered at the energy expected for\nelectrons detached at the crossing of the dressed ground state\nwith the dressed 5g state. This peak is repeated at the same\nposition in all ATI orders but is less prominent in the high-\nenergy part of the spectrum. It is still well marked in the 12th\norder and it gradually disappears in the higher orders. The\ntime-dependent calculations indicate that recollisional ATI is\nunlikely for the 5g state at the intensities involved \u00038\u0004. This\npeak is best seen as a simple case of high-order, resonantly\nenhanced multiphoton absorption, similar in mechanism to\nthe familiar resonance enhancements of low-order ATI.\nMore resonance structures are visible above Er=1 eV,\nparticularly in S=12 and 13. \u0001The higher ATI orders fall well\nbeyond the cutoff of the energy distribution.\u0002 Most of these\nstructures can be referred to particular curve crossings, using\nthe data provided in Table I. Like the 5g peak, they probably\narise from nonrecollisional multiphoton absorption.\nThe broad enhancement below Er=0.7 eV in the low-\norder spectrum has been assigned to a double resonance with\nthe 4p and 4d states accompanied by nonresonant ionization\n\u000313,36\u0004. It certainly occurs in a region of intensity where the\nground state interacts with two broad, overlapping dressed\nexcited states \u0001Fig. 1, Table I\u0002. One, of unknown origin\ncrosses the dressed ground state at 0.39 eV in the J=3\/2\nspectrum and at 0.47 eV in the J=1\/2 spectrum. The other\noriginates from the 4d state and crosses at, respectively, 0.19\nand 0.29 eV. These two states participate in a sequence of\navoided crossings with large energy gaps, which might fur-\nther complicate the ground state’s ionization dynamics. Like\nthe first few ATI orders, the plateau part of the spectrum is\nalso marked by a conspicuous resonance peak in this range\nof reduced energies. For S=12, the maximum of this peak\ncoincides within 0.01 eV with the reduced energy expected\nfor electrons detached at the crossing with the state of un-\nknown origin mentioned above. The width of this peak is\nalso consistent with the ionization width of this state. The\nmaximum shifts to smaller energies for S\t12 but remains\nwithin a range consistent with an enhancement primarily due\n0.0 0.5 1.0 1.5\nReduced energy (eV)\n0\n100\n200\n300\nYi\nel\nd \n(ar\nb. \nun\n.)\nFIG. 4. \u0001Color online\u0002 As in Fig. 3. Here, the peak intensity of\nthe pulse is 66.1 TW cm−2. The dashed curve shows the yield in the\nfirst ATI order \u0001not to scale\u0002 \u00036\u0004.\n0.0 0.5 1.0 1.5\nReduced energy (eV)\n0\n100\n200\n300\nYi\nel\nd \n(ar\nb. \nun\n.)\nFIG. 5. \u0001Color online\u0002 As in Fig. 3. Here, the peak intensity of\nthe pulse is 94.2 TW cm−2.\nHIGH-ORDER ABOVE-THRESHOLD IONIZATION OF¼ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-7\nto this dressed state. Given the width of this peak, the\ndressed 4d state and nonresonant ionization might also con-\ntribute. Resonance with the 4d state seems to modulate the\nlow-energy wing of this peak, around and below 0.2 eV, by a\nbroad enhancement for S=15 and 16 and by a crest-and-\ntrough Fano profile for S=13 and 14. There is clear evidence\nfor nonresonant ionization in the spectrum of the photoelec-\ntrons ejected at 90° from the polarization direction \u000312\u0004.\nHowever, the importance of nonresonant ionization in the\ndirection of polarization is difficult to ascertain.\n2. Middle intensities\nThe ATI spectrum at a peak intensity of 66.1 TW cm−2 is\npresented in Fig. 4, for the same ATI orders as in Fig. 3 and\nalso for S=1 \u0001the dashed curve\u0002. Ionization is sufficiently\nstronger above 50 TW cm−2 that the resonance enhance-\nments occurring at lower intensities are almost completely\nmasked by new enhancements occurring between 50 and\n66 TW cm−2. The former only manifest by the barely visible\nshoulders at Er\t0.35 eV, which for S\u000e12 are the remnants\nof the large peaks so conspicuous in Fig. 3 \u000337\u0004. The atom\nneeds to absorb at least 13 photons to lose an electron from\nthe ground state, here, and the relevant dressed states\nare now those represented in the left-hand side of Fig. 1.\nThe details of the crossings are given in the bottom half of\nTable I.\nWhile the low-order spectrum exhibits a number of nar-\nrow resonances up to close to Er= \u0004\u0005, the high-order spec-\ntrum is dominated by a large enhancement, between 0.4 and\n0.8 eV, and by a few smaller peaks between 0.8 and 1.3 eV.\nThe large enhancement has its maximum a little below\n0.7 eV in S=12, which is not inconsistent with a resonance\nwith the dressed 5f state. However, the maximum occurs at\nlower energies in higher ATI orders and tends towards the\nposition of the crossing with the dressed 4f state. By con-\ntrast, the resonances with the dressed 4f and 5f states are\nboth individually visible in the first ATI order. This double\npeak for S=1 evolves continuously into a single peak in\nhigher ATI orders, as can be seen from the full ATI spectra of\nRef. \u00036\u0004. We therefore believe that these enhancements origi-\nnate from these two Stark-shift-induced resonances, in the\nlow orders as well as in the high orders. Its significant drift\nbetween the 12th and the 16th orders may seem difficult to\nreconcile with a picture of ionization from dressed excited\nstates populated during the turnon of the pulse. However, the\nelectrons contributing to this enhancement are almost cer-\ntainly emitted from the dressed ground state, not from\ndressed excited states. Indeed, Muller and Kooiman \u00037\u0004,\nwhen looking at the quasistationary state producing the pla-\nteau electrons at intensities between the 4f and the 5f reso-\nnances, noted that this state was decreasing, due to ioniza-\ntion, by three parts in 104 at each optical cycle in the flat part\nof the trapezoidal pulses used in their calculations. This de-\ncrease matches that of the dressed ground state and is four\norders of magnitude slower than that of the two resonant\nstates. We have seen above that the dressed ground state is\nperturbed by the influence of the dressed 4f and 5f states\nbetween the crossings as well as at the crossings. From this,\nwe surmise that the emission of plateau electrons can be\nresonantly enhanced even at energies differing somewhat\nfrom those of the crossings. However, the recolliding wave\npackets must also interfere constructively \u0001with themselves\nand with the rest of the wave function\u0002 for this to happen \u00038\u0004.\nThe interference is likely to limit the intervals of intensities\n\u0001hence, of photoelectron energies\u0002 over which strong emis-\nsion takes place. As these intervals can be expected to be\nslightly different in different ATI orders, there is no contra-\ndiction between the possibility of resonantly enhanced ion-\nization and the change in the position of the “4f-5f” peak.\nThe importance of population transfer to the resonant\ndressed states depends on the pulse shape. It may be larger\nfor pulses used in actual experiments than for the flat-top\npulses used in the calculations. Nevertheless, given the ex-\ncellent agreement between the calculated and the measured\nspectra, we believe that population transfer does not play a\nsignificant role for this particular plateau resonance in the\nexperiments of Nandor et al. \u00036\u0004.\nThe requirement of a constructive interference might also\nmake a same Stark shift induced resonances enhancing ion-\nization in certain ATI orders but not in others. An example of\nsuch selective enhancements is found in Fig. 4. The two\npeaks around 1.05 and 1.21 eV in the 12th and 13th orders\nare consistent with resonances with a dressed state of un-\nknown origin, which crosses the ground state at 1.04 eV, and\nwith the dressed 8p state, which crosses at 1.19 eV. How-\never, these two peaks decrease in importance for S\t12, at\nthe same time as two new ones grow at 0.96 and 1.14 eV.\nOnly the latter two show up in the 16th order. \u0001We tentatively\nidentify these as resonances with the dressed 7p and 6f\nstates, since their positions coincide with the corresponding\ncrossing energies. As is noted in the Appendix, where the S\n=1 spectrum is examined, three of these four crossings are\nalso clearly manifest in the low-order spectrum.\u0002\n3. High intensities\nPart of the ATI plateau at 94.2 TW cm−2 peak intensity is\nshown in Fig. 5. The electrons detached between 60 and\n70 TW cm−2 are responsible for much of the large enhance-\nment below Er=0.85 eV. Far more are detached above\n70 TW cm−2 than below 60 TW cm−2, with the result that all\nthe peaks above Er=0.85 eV are new resonances. Apart from\nthe exception mentioned below, the relevant dressed states\nare the same as in the case of Fig. 3. We have calculated the\nquasienergy of the states shown in the right-hand side of Fig.\n1 beyond 70 TW cm−2, up to their next crossing with the\ndressed ground state. The photoelectron energy at each high-\nintensity crossing is given in column \u0001f\u0002 of Table I. The\ncrossing intensities are higher by about 52 TW cm−2 than\nthose specified in column \u0001a\u0002 of this table.\nComparing the spectra at intensities intermediate between\nthose of Fig. 4 and Fig. 5 shows that the faint resonance\nprofile visible below 0.2 eV in the latter is due to ionization\nbetween 70 and 73 TW cm−2 \u0001for J=3\/2\u0002. The ground\nstate is within the width of a broad excited state at these\nintensities. Although they do not cross each other, the prox-\nimity of this resonance makes it likely that it influences ion-\nization from the ground state and produces a structure in the\nhigh-order spectrum.\nR. M. POTVLIEGE AND SVETLANA VUČIĆ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-8\nThe two new significant enhancements below 1 eV seem\nto be straightforward Stark-shift-induced resonances. One,\npeaking at 0.70 eV, is superimposed on the 4f-5f peak com-\ning from ionization at middle intensities; the other peaks at\n0.95 eV. These two new resonance change little in position\nbetween S=12 and 16. In view of their position, they can be\nascribed, respectively, to the dressed 6s state and to a state of\nunknown origin which crosses the ground state at 0.96 eV.\n\u0001This state appears at 30 TW cm−2, in the right-hand side of\nFig. 1, at too high an intensity to cross the ground state\nbelow 70 TW cm−2. It is not mentioned in Table I.\u0002 Surpris-\ningly perhaps, the dressed excited state that produces the\nlarge peak at Er\t0.4 eV in Fig. 3 does not give rise to any\nenhancement in Fig. 5.\nThe spectrum is more complex above 1 eV. This region\ncorresponds to intensities where the ground state crosses a\nnumber of overlapping dressed excited states. The spectrum\nchanges significantly between S=12 and 16, with some of\nthe peaks shifting appreciably and new maxima developing\nbetween them. These structures are difficult to assign to reso-\nnances with particular dressed states in the absence of any\nother information than their position. As in the case of the\n4f-5f resonance at lower intensities, it is possible that sev-\neral resonant states are capable of enhancing the emission of\nhot electrons in this region.\nIt is striking, if we compare Figs. 3–5, that the leftmost\nmajor enhancement occurs at higher and higher reduced en-\nergies as the intensity increases. This implies that the lowest\nresonant dressed excited states responsible for the emission\nof hot electrons are higher and higher in the quasienergy\nspectrum. This shift possibly originates in the growing am-\nplitude of the quiver motion of the electron, which enables\nelectrons initially more and more distant to recollide with the\ncore. The recollision may involve electrons initially in a\ndressed excited state; however, this does not need to be the\ncase since resonant states mix with the dressed ground state\nover the whole interval of intensity where they overlap in\nenergy.\nIV. CONCLUSIONS\nIn conclusion, we have calculated the quasienergy spec-\ntrum of argon submitted to an intense 800 nm laser field and\nhave related the plateau resonances to the Stark-shift-induced\nresonances predicted by this calculation.\nThe quasienergy spectrum is complex, and a simple pic-\nture of states shifting linearly as the intensity increases is\nincorrect for most of the excited states of interest. Many of\nthem have multiple avoided crossings with each other and\nonly a few can be identified with field-free excited states up\nto high intensity. However, the ionization width of many of\nthe important dressed excited states is narrow enough to ex-\nplain the sharp enhancements of high-order ATI observed for\npulses of long duration.\nOur results support the interpretation of these enhance-\nments as arising from Stark-shift-induced resonances. They\noccur at intensities where resonant excited states mix with\nthe ground state in the dressed-ground-state wave function.\nOften, but not always, they coincide with a crossing between\nthe corresponding quasienergy curves. We have found no\nevidence for enhancements that are not concomitant with\na perturbation of the dressed ground state by one or several\ndressed excited states. Such enhancements would likely be\nchannel-closing enhancements rather than Stark-shift-\ninduced resonances.\nIn many cases, a same resonant state seems responsible\nfor an enhancement of ATI in the low orders as well as in the\nhigh orders. Because of the mixing, ionization from the\nground state can be resonantly enhanced without population\npresent in a dressed excited state. In particular, there is\nstrong evidence that the most intense plateau enhancement\nbelow 70 TW cm−2, the 4f-5f peak, arises from ionization\nfrom the dressed ground state, not from ionization from a\ndressed excited state.\nBelow 40 TW cm−2, there seems to be little difference\nbetween resonances in the low ATI orders and resonances in\nthe high ATI orders, apart from the magnitude of the en-\nhancement. At these relatively low intensities, emission of\nhot electrons can be ascribed to nonrecollisional multiphoton\nabsorption. Recollision is clearly important at higher intensi-\nties \u00037,8\u0004, and it seems that Stark-shift-induced resonances\noften create conditions favorable for this process. Overlap-\nping resonances with similar potential for recollision are\nlikely to interfere with each other, which may explain why\nthere is no one-to-one correspondence between plateau en-\nhancements and quasienergy curve crossings in certain re-\ngions of intensity where the ground state sweeps through\nmultiple resonances. However, we still find sharp enhance-\nments associated with single, identifiable dressed excited\nstates well above 80 TW cm−2. Some of the resonant dressed\nstates of interest are short lived at the relevant intensities—\nfor example, the dressed 4f and 5f states both have a lifetime\nof less than two optical cycles between 60 and 65 TW cm−2.\nNonetheless, they affect the dressed ground state, as shown\nby Fig. 2.\nThe analyses in Refs. \u00037,8,10\u0004 of the time-dependent wave\nfunction reveals that at high intensity a remarkable bunching\nof wave packets starts when part of the electronic density is\ntrapped in the Coulomb tail of the atomic potential, at about\n3 a.u. from the nucleus. Furthermore, at intensities at which\nthe emission in the high ATI orders is particularly intense,\nthe wave function has maxima close to the nucleus, with\nnear-zero drift velocity, which produce bursts of high-energy\nelectrons upon backscattering on the nucleus. \u0001For this to\nhappen, the resonant state should also be relatively low in the\nspectrum and, at least at the intensities considered here,\nshould have an orbital angular momentum not larger than\n3—see Table I.\u0002 As will be reported elsewhere, this increase\nof electronic density close to the nucleus also manifests in\nthe Floquet wave function, particularly in the partial wave of\nlowest l value of the harmonic component corresponding to\nthe order of the highest ATI peak in the plateau: The mean\nradius of this partial wave shrinks to values below 1 a.u.. and\npasses through a broad minimum at the intensities where the\nemission of high-energy electrons has been observed \u00036\u0004. The\npart of the electronic wave packet described by this partial\nwave is thus located close to the nucleus, where it can absorb\nmany photons from the laser field.\nHIGH-ORDER ABOVE-THRESHOLD IONIZATION OF¼ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-9\nACKNOWLEDGMENTS\nWe thank L. D. Van Woerkom for the permission to re-\nproduce the ATI spectra shown in Figs. 3–5. A large part of\nthe calculations presented have been performed on comput-\ners financed by EPSRC. S.V. is supported by the MNTR of\nSerbia under Project No. 141029A.\nAPPENDIX: RESONANCES IN LOW ATI ORDERS\nIn this appendix, we identify the Stark-shift-induced reso-\nnances manifesting in the low ATI orders at 66.1 TW cm−2\npeak intensity. The photoelectron spectrum is represented by\na dashed curve in Fig. 4.\nIn view of their position, and in agreement with the wave-\nfunction analysis \u00038\u0004, we interpret the tall peaks at 1.16 and\n1.26 eV as due to electrons ionized at resonance with, re-\nspectively, the dressed 6h and the dressed 7h states. Since\nthe ionization widths of the h series are much smaller than\nthe widths of the corresponding ATI peaks, it is likely that\nneighboring resonances with the dressed 6f and 7f states\nalso contribute to these peaks. We identify the small peak at\n1.20 eV to the dressed 8p state, since it occurs at an energy\nalmost exactly equal to that expected for this resonance. The\ndoublet with subpeaks at 1.00 and 1.05 eV can be associated\nwith the two crossings at 0.96 and 1.04 eV, respectively with\na state of unknown zero-field limit but clear f character at the\nresonance, and with the dressed 7p state. The crossing with\nthe dressed 6p state does not seem to induce any structure in\nthe low-energy spectrum. The broad peak centered at\n0.50 eV develops on a background originating from ioniza-\ntion below 45 TW cm−2. This peak and the one centered at\n0.76 eV have the energies and the widths expected for reso-\nnances with, respectively, the dressed 4f state \u0001which has a p\ncharacter at the resonance\u0002 and the dressed 5f state \u0001which\nhas f character at the resonance\u0002. The character of these reso-\nnant states is echoed by the larger importance at the corre-\nsponding crossings of the p and f partial waves of the n\n=12 harmonic component of the dressed ground state \u0001Fig.\n2\u0002. It is also consistent with the time-dependent wave func-\ntion of Refs. \u00038,13\u0004 having an off-axis component of p sym-\nmetry in the high-intensity wing of this double hump and of\nf symmetry in the low-intensity wing.\n\u00031\u0004 See, e.g., W. Becker, F. Grasbon, R. Kopold, D. B. Milosěvić,\nG. G. Paulus, and H. Walther, Adv. At., Mol., Opt. Phys. 48,\n35 \u00012002\u0002.\n\u00032\u0004 B. B. van Linden van den Heuvell and H. G. Muller, in Mul-\ntiphoton Processes, edited by S. J. Smith and P. L. Knight\n\u0001Cambridge University Press, Cambridge, U.K., 1988\u0002, p. 25;\nP. B. Corkum, Phys. Rev. Lett. 71, 1994 \u00011993\u0002; K. C. Ku-\nlander, K. J. Schafer, and J. L. Krause, in Super-Intense Laser-\nAtom Physics, edited by B. Piraux, A. L’Huillier, and K.\nRzążewski \u0001Plenum Press, New York, 1993\u0002, p. 95.\n\u00033\u0004 R. R. Freeman, P. H. Bucksbaum, H. Milchberg, S. Darack, D.\nSchumacher, and M. E. Geusic, Phys. Rev. Lett. 59, 1092\n\u00011987\u0002.\n\u00034\u0004 P. Hansch, M. A. Walker, and L. D. Van Woerkom, Phys. Rev.\nA 55, R2535 \u00011997\u0002.\n\u00035\u0004 M. P. Hertlein, P. H. Bucksbaum, and H. G. Muller, J. Phys. B\n30, L197 \u00011997\u0002.\n\u00036\u0004 M. J. Nandor, M. A. Walker, L. D. Van Woerkom, and H. G.\nMuller, Phys. Rev. A 60, R1771 \u00011999\u0002.\n\u00037\u0004 H. G. Muller and F. C. Kooiman, Phys. Rev. Lett. 81, 1207\n\u00011998\u0002.\n\u00038\u0004 H. G. Muller, Phys. Rev. A 60, 1341 \u00011999\u0002.\n\u00039\u0004 H. G. Muller, Phys. Rev. Lett. 83, 3158 \u00011999\u0002.\n\u000310\u0004 H. G. Muller, Opt. Express 8, 44 \u00012001\u0002.\n\u000311\u0004 H. G. Muller, Opt. Express 8, 86 \u00012001\u0002.\n\u000312\u0004 E. Cormier, D. Garzella, P. Breger, P. Agostini, G. Chériaux,\nand C. Leblanc, J. Phys. B 34, L9 \u00012001\u0002.\n\u000313\u0004 R. Wiehle, B. Witzel, H. Helm, and E. Cormier, Phys. Rev. A\n67, 063405 \u00012003\u0002.\n\u000314\u0004 G. G. Paulus, F. Grasbon, H. Walther, R. Kopold, and W.\nBecker, Phys. Rev. A 64, 021401\u0001R\u0002 \u00012001\u0002; R. Kopold, W.\nBecker, M. Kleber, and G. G. Paulus, J. Phys. B 35, 217\n\u00012002\u0002.\n\u000315\u0004 B. Borca, M. V. Frolov, N. L. Manakov, and A. F. Starace,\nPhys. Rev. Lett. 88, 193001 \u00012002\u0002; S. V. Popruzhenko, Ph. A.\nKorneev, S. P. Goreslavski, and W. Becker, ibid. 89 023001\n\u00012002\u0002.\n\u000316\u0004 J. Wassaf, V. Véniard, R. Taïeb, and A. Maquet, Phys. Rev.\nLett. 90, 013003 \u00012003\u0002; Phys. Rev. A 67, 053405 \u00012003\u0002.\n\u000317\u0004 C. C. Chirilă and R. M. Potvliege, Phys. Rev. A 71, 021402\u0001R\u0002\n\u00012005\u0002; F. H. M. Faisal and G. Schlegel, J. Phys. B 38, L223\n\u00012005\u0002; D. G. Arbó, S. Yoshida, E. Persson, K. I. Dimitriou,\nand J. Burgdorfer, Phys. Rev. Lett. 96, 143003 \u00012006\u0002.\n\u000318\u0004 F. Grasbon, G. G. Paulus, H. Walther, P. Villoresi, G. Sansone,\nS. Stagira, M. Nisoli, and S. De Silvestri, Phys. Rev. Lett. 91,\n173003 \u00012003\u0002.\n\u000319\u0004 M. Wickenhauser, X. M. Tong, and C. D. Lin, Phys. Rev. A\n73, 011401\u0001R\u0002 \u00012006\u0002.\n\u000320\u0004 J. H. Shirley, Phys. Rev. 138, B979 \u00011965\u0002; Shih-I Chu, Adv.\nAt. Mol. Phys. 21, 197 \u00011985\u0002.\n\u000321\u0004 Y. Gontier and M. Trahin, Phys. Rev. A 7, 1899 \u00011973\u0002.\n\u000322\u0004 C. R. Holt, M. G. Raymer, and W. P. Reinhardt, Phys. Rev. A\n27, 2971 \u00011983\u0002.\n\u000323\u0004 R. M. Potvliege and R. Shakeshaft, Phys. Rev. A 40, 3061\n\u00011989\u0002.\n\u000324\u0004 R. M. Potvliege and R. Shakeshaft, Adv. At., Mol., Opt. Phys.\n1(Suppl), 373 \u00011992\u0002.\n\u000325\u0004 A. Maquet, Shih-I Chu, and W. P. Reinhardt, Phys. Rev. A 27,\n2946 \u00011983\u0002.\n\u000326\u0004 R. M. Potvliege, Comput. Phys. Commun. 114, 42 \u00011998\u0002.\n\u000327\u0004 S. Vučić, Phys. Rev. A 65, 033421 \u00012002\u0002.\n\u000328\u0004 The quasienergy spectrum of argon at 248 nm has been calcu-\nlated by Plummer and Noble using the R-matrix–Floquet\nmethod \u0003M. Plummer and C. J. Noble, J. Phys. B 33, L807\n\u00012000\u0002; 34, L51 \u00012002\u0002; 36, L219 \u00012003\u0002\u0004.\n\u000329\u0004 The difference is less than 0.01 eV for all the excited levels\nabove the 5s, and 0.01–0.02 eV for the 4p, 3d, and 5s states.\nIn the context of a fully time-dependent calculation, it is ad-\nR. M. POTVLIEGE AND SVETLANA VUČIĆ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-10\nvantageous to remove the 1s, 2s, and 2p states by adjusting the\nshort-range part of the model potentials \u00037,8\u0004. No adjustment is\nnecessary here, as these states are too weakly coupled to the\ndressed states of interest.\n\u000330\u0004 C. J. Joachain, M. Dörr, and N. J. Kylstra, Adv. At., Mol., Opt.\nPhys. 42, 225 \u00012000\u0002.\n\u000331\u0004 R. M. Potvliege and R. Shakeshaft, Phys. Rev. A 38, 6190\n\u00011988\u0002.\n\u000332\u0004 We define the dominant partial waves as being those that con-\ntribute at least 10% of the norm of the wave function, the norm\nbeing calculated as the cycle-average overlap of the wave\nfunction with the complex conjugate of its dual.\n\u000333\u0004 H. Rottke, B. Wolff-Rottke, D. Feldman, K. H. Welge, M.\nDörr, R. M. Potvliege, and R. Shakeshaft, Phys. Rev. A 49,\n4837 \u00011994\u0002.\n\u000334\u0004 H. C. Day, B. Piraux, and R. M. Potvliege, Phys. Rev. A 61,\n031402\u0001R\u0002 \u00012000\u0002.\n\u000335\u0004 L. D. Van Woerkom et al., www.physics.ohio-state.edu\/~lvw\/\nwhat\/singlee\/singlee.html; see also L. D. Van Woerkom, M. A.\nWalker, M. J. Nandor, and H. G. Muller, in Multiphoton Pro-\ncesses, edited by L. F. DiMauro, R. R. Freeman, and K. C.\nKulander \u0001AIP, Melville, NY, 2000\u0002, p. 70.\n\u000336\u0004 However, we find that the dressed 4p state cannot be followed\nas a continuous quasienergy curve above 5 TW cm−2.\n\u000337\u0004 These peaks are more visible at slightly lower intensities. To-\ngether with the two largest peaks visible in Fig. 4, they form\nthe “subpeak triplets” observed by Hertlein, Bucksbaum, and\nMuller in each ATI order of the plateau \u00035\u0004.\nHIGH-ORDER ABOVE-THRESHOLD IONIZATION OF¼ PHYSICAL REVIEW A 74, 023412 \u00012006\u0002\n023412-11\n"}