{"doi":"10.3366\/elr.2006.10.3.386","coreId":"194236","oai":"oai:lra.le.ac.uk:2381\/3098","identifiers":["oai:lra.le.ac.uk:2381\/3098","10.3366\/elr.2006.10.3.386"],"title":"Domicile of Children: the new Law in Scotland","authors":["Harder, Sirko"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/hdl.handle.net\/2381\/3098","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/3098\/1\/Domicile%20of%20Children%20the%20new%20law%20of%20Scotland.pdf","pdfHashValue":"cfb7dbfe8d88c1c9071b77608d120cb83a73e8c6","publisher":"Edinburgh University Press","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/3098<\/identifier><datestamp>\n                2013-11-07T02:01:27Z<\/datestamp><setSpec>\n                com_2381_1402<\/setSpec><setSpec>\n                com_2381_9548<\/setSpec><setSpec>\n                col_2381_8708<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nDomicile of Children: the new Law in Scotland<\/dc:title><dc:creator>\nHarder, Sirko<\/dc:creator><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:19:12Z<\/dc:date><dc:date>\n2009-12-08T16:19:12Z<\/dc:date><dc:date>\n2006<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nEdinburgh Law Review, 2006, 10 (3), pp.386-398<\/dc:identifier><dc:identifier>\n1364-9809<\/dc:identifier><dc:identifier>\nhttp:\/\/www.euppublishing.com\/doi\/abs\/10.3366\/elr.2006.10.3.386<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/3098<\/dc:identifier><dc:identifier>\n10.3366\/elr.2006.10.3.386<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2006 Edinburgh University Press. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nEdinburgh University Press<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1364-9809","issn:1364-9809"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2006,"topics":[],"subject":["Article"],"fullText":"EdinLR Vol 10 pp 386-398\nDomicile of Children:\nthe New Law in Scotland\nSirko Harder*\nA. INTRODUCTION\nB. THE NEW TEST OF CLOSEST CONNECTION\n(1) Parents with same domicile\n(2) Parents with different domiciles\n(3) One or both parents dead\nC. CHANGES TO DOMICILE OF ORIGIN AND DOMICILE OF\nCHOICE\n(1) The traditional role of domicile of origin\n(2) The background to section 22\n(3) Four approaches to section 22\n(4) Replacing the revival rule with the continuance rule\nD. TRANSITIONAL PROVISION\nE. CONCLUSION\nA. INTRODUCTION\nOne of the objectives of the Family Law (Scotland) Act 2006, which came into\nforce on 4 May 2006,' is to abolish the status of illegitimacy in Scots law.2 In conse-\nquence, section 22 of the Act introduces a rule of domicile of children that no\nlonger differentiates according to the marital status of the child's parents.\nDomicile is still an important connecting factor in Scots private international\nlaw, for the civil status or \"personal law\"3 of a person is in general governed by\nthe law of the country in which the person is domiciled. For instance, intestate\n* Teaching Assistant in Law, University of Aberdeen. The author would like to thank Professor Peter\nMcEleavy, Professor Chris Clarkson, and an anonymous referee for helpful comments on an earlier draft\nof this article.\n1 Family Law (Scotland) Act 2006 (Commencement, Transitional Provisions and Savings) Order 2006,\nSSI 2006\/212, art. 2.\n2 To this end, s 21 of the Act amends s 1(1) of the Law Reform (Parent and Child) (Scotland) Act 1986.\n3 This term is used, for instance, by A E Anton and P R Beaumont, Private International Late: A treatise\nfrom the standpoint of Scots law, 2 d edn (1990) 121 if; P M North and J J Fawcett, Cheshire and North's\nPrivate International Law, 13th edn (1999) 134 ff.\nVol 10 2006 DOMICILE OF CHILDREN\nsuccession to moveables4 and the essential validity of testamentary dispositions\nof moveables are governed by the law of the deceased's last domicile. The 2006\nAct reaffirms the relevancy of domicile for the essential validity of a marriage,\n6\nfor the rights of spouses in each other's moveable property,' and for questions of\nlegitimacy and legitimation. s\nThe common law knows three types of domicile: domicile of origin, which\nthe law assigns to every person at birth; domicile of choice, which can be both\nacquired and abandoned; and derivative domicile (or domicile of dependence) for\npersons who lack the capacity to choose their domicile themselves. The group of\nlegally dependent persons includes children under the age of sixteen.9\nIn relation to the domicile of origin and the derivative domicile of children the\ncommon law differentiated according to the marital status of the child's parents.\nLegitimate children acquired at birth and subsequently followed their father's\ndomicile whereas illegitimate children acquired and followed their mother's\ndomicile.10 The domicile of the mother was further relevant for legitimate children\nwhose father was dead and in general\" for legitimate children whose parents were\ndivorced or separated.\nThe domicile of children is now governed by section 22 of the 2006 Act, which\nreads:\nDomicile of persons under 16\n(1) Subsection (2) applies where -\n(a) the parents of a child are domiciled in the same country as each other; and\n(b) the child has a home with a parent or a home (or homes) with both of them.\n(2) The child shall b domiciled in the same county as the child's parents.\n(3) Where subsection (2) does not apply, the child shall be domiciled in the country\nwith which the child has for the time being the closest connection.\n(4) In this section, \"child\" means a person under 16 years of age.\n4 Bnce v Bnrce (1790) 3 Paton 163; Balfour v Scott (1793) 3 Paton 300.\n5 Lashley v Hog (1804) 4 Paton 581; Ommanney v Bingham (1796) 3 Paton 448; Boe v Anderson (1862)\n24 D 732.\n6 Family Law (Scotland) Act 2006 s 38.\n7 2006 Act s39.\n8 2006 Act s 41. In relation to Scottish domiciliaries questions of legitimacy and legitimation will no longer\narise as the status of illegitimacy is now abolished in Scots law.\n9 The age limit of 16 years for all children 'was fixed by the Age of Legal Capacity (Scotlanmd) Act 1991 s 7\n(a provision repealed by the new Act). The previous law differentiated between pupils (girls under 12\nand boys under 14) and minors and perhaps also between forisfamiliated and unforisfamiliated minors:\nAnton & Beaumont, Private International Law 133-134.\n10 \"It is a settled principle that no man shall be without a domicil, and to secure this result the law attributes\nto every individual as soon as he is born the domicil of the father if the child be legitimate, or the domicil\nof the mother if illegitimate\": Udny v Udny (1869) 7 M (HL) 89 at 99 per Lord Westbury. The cases of\nfoundlings, putative marriages, legitimation and adoption are discussed by Anton & Beaumont, Private\nInternational Law 130-131.\n11 For details see the Domicile and Matrimonial Proceedings Act 1973 s 4. This provision is repealed for\nScotland by the Family Law (Scotland) Act 2006 Sch 3.\nVo6 10 2006 DOMICILE OF CHILDREN\n388 THE EDINBURGH LAW REVIEW Vol 10 2006\nThe effect of this rather intricate provision is that the domicile of a child is\nnow in general the country with which the child is for the time being most closely\nconnected. No longer does domicile depend on the marital status of the child's\nparents; no longer does it invariably follow that of the child's father or mother.\nHowever, where both parents are domiciled in the same country and the child has\na home with at least one of them, the child shares the parents' domicile whether\nor not the test of closest connection would come to the same result.\nIt is clear that section 22 replaces the common law rules on the derivative\ndomicile of children with a new test of closest connection. It is also clear that\nsection 22 does not affect the common law rules on the acquisition of domicile\nof choice. What is unclear, however, is the extent to which section 22 alters the\ncommon law rules on domicile of origin and on the abandonment of a domicile\nof choice.\nB. THE NEW TEST OF CLOSEST CONNECTION\nBy introducing a test of closest connection for the domicile of children the 2006\nAct implements a recommendation made by the Law Commission for England\nand Wales and the Scottish Law Commission in their joint report on domicile of\n1987,12 reaffirmed by the Scottish Law Commission in its report on Family Law\nof 1992.13 The 1987 report rejected the idea of replacing domicile as the deter-\nminant for status with either habitual residence or nationality. Habitual residence\nwas considered too fluctuating a link between a person and a country to deter-\n14 15\nmine status, 4 and nationality was considered too abstract a link for that purpose.\nIn the case of children, the 1987 report rejected the idea of treating them like\nadults and making their domicile dependent on intention, since children, even\nwhere capable of forming the requisite intention, were under the control of an\nadult and thus not free in choosing where to live and for how long.16 For these\nreasons, the 1987 report subscribed to the test of treating a child as domiciled in\nthe country with which the child was for the time being17 most closely connected.\n12 Law Commission and Scottish Law Commission, Report on Private International Law: The Law of\nDomicile (Law Coin No 168, Scot Law Coin No 107, 1987) (henceforth Law Commissions, Report on\nDomicile). The Report was rejected by the UK Government in 1996: see Law Commission, Thirtieth\nAnnual Report (Law Corn No 239, 1996) para 1.15 n 24.\n13 Scottish Law Commission, Report on Family Law (Scot Law Coin No 135, 1992), paras 17.12 and 17.13\n(henceforth Scottish Law Commission, Report on Family Law).\n14 Law Commissions, Report on Domicile paras 3.5-3.8, 4.11.\n15 Law Commissions, Report on Domicile paras 3.9-3.11.\n16 Law Commissions, Report on Domicile para 4.10.\n17 The phrase \"for the time being\" was said to indicate that the court has to find the closest connection\nas at the time for which the domicile needs to be determined. It was not intended to prevent the court\nfrom considering any previous event in the child's life: see Law Commissions, Report on Domicile para\n4.18.\nIt was thought that this test would allow the courts' s\nto reach the most appropriate conclusion taking into account all the circumstances of\nthe case including, for example, the intentions of the child, if any, and of his parents or\nof those who have control over him; his and his parents' nationality; where he is or was\nin fact resident at the time in question; his family background and his education.\nA further attraction of a closest connection test is that, in the case of a child who lives\nwith neither parent, it provides a certain amount of built-in protection against a third\nparty attempting to manipulate the child's domicile for some improper purpose.\nLike the 1987 report, the Act does not seek to give guidance as to how closeness\nof connection is to be determined. This is to be welcomed. A court should be free\nto consider all the circumstances of the case when determining the domicile of a\nchild. As the report pointed out, the mention of specific factors in the legislation\ncould lead the courts to confining their attention to those factors. 19\n(1) Parents with same domicile\nThe Act does, however, contain a special provision for one situation. As already\nmentioned, it is provided in section 22 that where a child's parents are domiciled\nin the same country as each other and the child has a home with a parent or a\nhome (or homes) with both of them, the child is domiciled in the same country as\nthe parents. The Bill as introduced into the Scottish Parliament gave this rule in\nthe form of a rebuttable presumption of closest connection, 20 following a recom-\nmendation by the Law Commissions. \"1 It was one of six presumptions, all of which\nwere later replaced by subsections (1) and (2) of section 22. The replacement, it\nwas explained, was simpler in application while still achieving the same policy\nobjective as before.' 2\nIn the bulk of cases a child has indeed the closest connection with the country\nof the parents' domicile, especially where the child's home is in that country. But\nother situations are conceivable. Suppose the parents have the same country of\norigin (country X), from which they have moved to country Y where they intend to\nlive for a number of years until they move finally to country Z. They have no inten-\ntion ever to return to X and have cut all ties to X. Their child is born in Y, grows up\nin Y, socialises with the people of Y and speaks their language. The child has never\nbeen to X nor has any contact with people living in X. Yet the Act prescribes the\n1.8 Law Commissions, Report on Domicile paras 4.12 and 4.13.\n19 Law Commissions, Report on Domicile para 4.18.\n20 Family Law (Scotland) Bill (as introduced) s 16(3)(a).\n21 Law Commissions, Report on Domicile para 4.15; Scottish Law Commission, Report on Family Law\npara 17.13.\n22 Statement by Hugh Henry, 1)eputy Minister for Justice: see Official Report, 9 November 2005, col 2261\n(Justice 1 Committee).\nVoll0 2006 DOMICILE OF CHILDREN\nchild to be domiciled in X. However, this and other situations where the inflexible\nrule in section 22(1) and (2) may seem inappropriate are rare indeed; and even on\nthose rare occasions, it has the advantage that all family members share the same\ndomicile.\nIn refraining from defining when a child has a \"home\", the Act follows the Law\nCommissions' lead. The word \"home\", said the 1987 report, sufficiently conveys\n\"the combined ideas of physical presence and emotional link\".23 Indeed, existing\nlegislation already uses the concept of \"home\" without defining it,24 and this does\nnot seem to have produced difficulties. The report took the view that a child has\na \"home\" with the parent(s) not only when they live together day to day, but also\nwhere there are temporary separations on a regular basis, such as where the child\nattends a boarding school or is in hospital (even directly after birth) or where the\nparent works abroad.27 This accords with the definition of a child's \"hone\" in the\nChildren Act 1975.26 But the 1987 report went further and suggested that a child's\n\"home\" with the parent(s) may persist even where the child lives for a while with\nfoster parents or in care.27 Whether this view will be adopted in practice remains\nto be seen.\n(2) Parents with different domiciles\nAdopting a recommendation by the Law Commissions,25 the Bill as introduced\ninto the Scottish Parliament provided that where a child has a home with one\nparent only and the parents are not domiciled in the same country, it is presumed\nthat the child is most closely connected with the country in which the parent with\nwhom the child has a home is domiciled.29 As already mentioned, this presump-\ntion was dropped for the sake of simplifying the application of what is now section\n22; and indeed it seens preferable to determine the country of closest connection\nwithout the constraints of a presumption which is unnecessary in some cases and\ninappropriate in others. The presumption is unnecessary where the parent with\nwhom the child has a home is domiciled in the country where the home is located,\n23 Law Commissions, Report on Domicile para 4.20.\n24 For instance Domicile and Matrimonial Proceedings Act 1973 s 4; Adoption (Scotland) Act 1978 ss 13,\n19, 20, 27, 28; Family Law (Scotland) Act 1985 s 13; Child Support Act 1991 ss 3, 42.\n25 Law Commissions, Report on Domicile para 4.19.\n26 Section 87(3). This reads: \"In this Act, unless the context otherwise requires, references to the person\nwith whom a child has his home refer to the person who, disregarding absence of the child at a hospital\nor boarding school and any other temporary absence, has actual custody of the child.\" The Children Act\n1975 has been repealed for England and Wales but is still in force in Scotland.\n27 Law Colmmissions, Report on Domicile para 4.20.\n28 Law Commissions, Report on Domicile para 4.16; Scottish Law Commission, Report on Family Law\npara 17.13.\n29 Family Law (Scotland) Bill (as introduced) s 16(3)(b).\nVo6 10 2006THE EDINBURGH LAWV REVIEWV\nbecause there will rarely be doubt that the child has the closest connection with\nthat country. And the presumption is inappropriate where the parent with whom\nthe child has a home is not so domiciled3\" because this presumes the child to be\nmost closely connected with the domicile of the parent rather than the country\nwhere the child lives. The child may have.no connections to the country of the\nparent's domicile and the parent may intend never to return there.\nThe test of closest connection is also directly applicable where the child's parents\nhave a different domicile and the child shares a home with both. This situation\nmay arise where the parents have different intentions as to the permanence of\ntheir stay in the country where the joint home is located, or where their domicile\nof origin is in different countries and they now live temporarily in a third country.\nIn order to create certainty in this situation, the consultation document leading up\nto the 1987 report proposed that the child share the mother's dolmicile.\"' To no-\none's surprise, this arbitrary rule received a cold welcome from the commentators\nand was dropped in the 1987 report.32 It was not revived either in the 1992 report\nor in the 2006 Act itself. Indeed, giving priority to the domicile of one parent\nwould introduce through the backdoor the very inequality that the Act seeks to\nabolish.\n(3) One or both parents dead\nThe Bill as introduced into Parliament contained as many as four presumptions\nfor the domicile of a child with one or both parents dead.' In the case of the death\nof a parent with whom the childhadlived (the oilier parent being still aivc), it was\npresumed that the child had the closest connection with the country of domicile\nof that parent or, if the child now lived with the other parent, of that parent.34 In\nthe case of the death of both parents, the Bill provided for the persistence of the\ndomicile which the child previously had in accordance with the presumptions\ndiscussed earlier.\nThe abandonment of these presumptions is welcome. A presumption that a\nchild shares the domicile of the only living parent produces the same problems\nas the presumption, discussed earlier, that a child shares the domicile of the\nonly parent with whom the child has a home where both parents are alive. And\na presumption that the domicile a parent had at the time of death continues for\n30 I.e. because that country is not the parent's domicile of origin and the parent intends to stay in that\ncountry only temporarily.\n31 Law Commission and Scottish Lsw Commission, Private International Law: The Law of Domicile (Law\nCoin WP No 88, Scot Law Corn CM No 63, 1985) paras 4.6-4.9.\n32 Law Commissions, Report on Domicile para 4.17.\n33 Family Law (Scotland) Bill (as introduced) s 16(3)(c)-(f.\n34 This largely followed the Domicile and Matrimonial Proceedings Act 1973 s 4(3).\nVol 10 2006 DOMICILE OF CHILDREN\nthe child is inappropriate considering that the child may since have been lawfully\nbrought to another jurisdiction by a guardian or foster parents. Indeed, the idea of\nmaking any presumptions for the domicile of orphans or children not living with\ntheir parents was already rejected in the consultation document leading to the\n1987 report ' and was not even found worthy of discussion in the report itself.\nC. CHANGES TO DOMICILE OF ORIGIN AND DOMICILE OF\nCHOICE\nWhile it is clear that the common law rules on the derivative domicile of children\nare completely replaced with the new test of closest connection, it is less certain\nwhether and how the Act affects the common law rules on the domicile of origin\nand the abandonment of a domicile of choice.\n(1) The traditional role of domicile of origin\nAt common law the domicile of origin is relevant where the status of a person has\nto be determined for the time of that person's birth; and if this were its only role\nnobody would doubt that domicile of origin too is now to be determined under the\ntest of closest connection set out in section 22. For it would make no sense to have\ntwo different domicile regimes for the time of birth and the time immediately\nafterwards. But to determine the status of a person at the time of birth is not the\nonly role the domicile of origin plays in the common law of Scotland and England.\nUnder the traditional rules, a person can abandon a domicile of choice without\nsimultaneously acquiring a new one. Since nobody can ever be without domicile,\n36the person's domicile of origin then revives. For this reason, the domicile of\norigin remains relevant to the determination of a person's status up until that\nperson's death. Indeed, disputes over succession often necessitate a determination\nof domicile as at the date of death. In that case, the deceased's domicile has to be\ntraced from birth to death, with the possibility of the domicile of origin reviving\neven shortly before the death.\n35 Law Commission and Scottish Law Commission, Private International Late: The Law of Domicile (Law\nCorn WP No 88, Scot Law Corn CM No 63, 1985) paras 4.11 and 4.12.\n36 The leading case is Udny v Udny (1869) 7 M (HL) 89. The re\\'ival rule was further applied in Arnott\nArnott's Trustees (1884) 22 SLR 1, and Ross v Ross 1926 SLT 689 at 706 per Lord Ashmore. For English\nlaw see, for instance, Harrison v Harrison [1953] 1 WLR 865; Tee v Tee [1974] 1 WA'LR 213.\n37 Earlier cases suggested that it was more difficult to change from the domicile of origin to a domicile\nof choice than from one domicile of choice to another. But this rule seems to have vanished from both\nScots and English law: Law Commissions, Report on Domicile para 2.8. Should this rule still exist, it\nwould belong to the rules on the acquisition of a domicile of choice and would not be affected by the\n2006 Act.\nTHE EDINBURGH LAWV REVIEWV Vol110 2006\n(2) The background to section 22\nIn considering the meaning ofsection 22 it is helpful to begin with some background.\nIn their 1987 report the Law Commissions recommended an overhaul of the law\nof domicile as a whole, including the replacement of the revival rule 38 with what\nmay be called a \"continuance rule\", that is, a rule that a domicile of choice should\npersist until a new domicile of choice has been established.39 Having thus confined\nthe role of domicile of origin to the determination of a person's domicile at the\ntime of birth, the report went on to replace both the domicile of origin so confined\nand the derivative domicile of children with an independent domicile of children\ngoverned by a test of closest connection. As a result, the domicile of origin as a\nseparate type of domicile with a separate set of rules was to \"disappear from the\nlaws of the United Kingdom\".4 \" With hindsight it is unfortunate that the 1987\nreport failed to emphasise that the domicile of origin can only be integrated into\nthe concept of a domicile of children if the revival rule is abolished. For if the\nrevival rule is retained, then so is domicile of origin as a separate type of domicile.\nIf the domicile of origin may revive in a person's adult life, it cannot be integrated\ninto a concept of a domicile of children. Consequently, the decision in the 1987\nreport to recommend abolition of the revival rule influenced the drafting of the\nprovision introducing the test of closest connection. 4\nThe Scottish Law Commission's 1992 report concerned family law, not the law\nof domicile. Since, however, the report recommended the abolition of the status\nof illegitimacy; it had to address the law on domicile insofar as this was necessary\nto achieve thai aim. Approving the joint report of 1987, the i992 report said:\"\nIn the context of the abolition of the status of illegitimacy in Scots law it is clearly essen-\ntiad that the existing law on the domicile of children be changed. We therefore suggest\nthat, if the joint report on domicile has not been implemented by the time this report\nis implemented, the Scottish law on the domicile of children should be changed in the\nway recommnended in the joint report.\nThe 1992 report went on to copy from the 1987 report the rules on the domicile\nof children (the test of closest connection supplemented by two presumptions),\nadding that \"It should be made clear that a person's domicile of origin is the first\ndomicile which he or she has under the above rules.\"43 The purpose of this last\nstatement might simply be to clarify that the test of closest connection governs\n38 I.e. the rule that the domicile of origin revives if a domicile of choice is abandoned without a replace-\nnlent.\n39 Law Commissions, Report on Domicile paras 5.23-5.25.\n40 Law Commissions, Report on Domicile para 4.24.\n41 Law Commissions, Report on Domicile Appendix A, Draft Domicile Bill, Schedule para 1.\n42 Scottish Law Commission, Report on Family Lamw para 17.13.\n43 Scottish Law Counission, Report on Family Law para 17.13.\nVol110 2006 DOMICILE OF CHILDREN\nthe domicile of children not only for the time between birth and the age of sixteen\nbut also for the time of birth itself. But the statement might also mean that the\nScottish Law Commission took for granted the survival of the domicile of origin\nas a separate type of domicile including its ability to revive in a person's adult life.\nThe latter meaning, however, seems unlikely if only because the relevant provi-\nsion in the Commission's draft Bill' says nothing as to the domicile of origin or\nthe revival rule and bears a heading (\"Domicile of Children\") which would not be\nvery accurate if the revival rule were being retained.\nWhen the 2006 Act was drafted on the basis of the 1992 report, it seems to have\nbeen overlooked that the provision on the domicile of children recommended\nin that report had been copied from the 1987 report where it had been comple-\nmented by a provision replacing the revival rule with the continuance rule, and\nthat the provision or at least its heading would have to be redrafted were the\nrevival rule to be retained. The explanatory notes to what is now section 22 state\nsimply that the provision eradicates the distinction between legitimate and illegiti-\nmate children in relation to domicile: \"There will therefore no longer be a link\nbetween a child's domicile and that of his or her parents' marital status in relation\nto both the domicile of origin and the dependent domicile. ' '4a Again, the reference\nto the domicile of origin might mean that a persistence of the revival rule was\nassumed but this would not sit happily with the heading of section 22 itself or with\nthe omission of any mention that the test of closest connection might affect adults\ntoo through the revival of a domicile of origin governed by this test.\n(3) Four approaches to section 22\nIn applying section 22 to domicile of origin, four approaches are theoretically\npossible. The first is to take both section 22 and its explanatory notes at their word\nand to apply section 22 to all types of domicile that children can have (but only\nto the domicile of children). This would mean that the domicile of a person from\nbirth until the age of sixteen is governed by the new test of closest connection,\nsupplemented by the specific rule in section 22(1) and (2). Thereafter domicile of\norigin would be determined by the common law rules with its distinction between\nlegitimate and illegitimate children. The problem with this approach is that a\nperson's domicile at birth could then be different from that person's domicile of\norigin for the purpose of filling a domicile gap in the person's adult life.\nThe second approach is to disregard the reference to the domicile of origin in\nthe explanatory notes and to replace the common law rules with the rules in section\n44 Scottish Law Commission, Report on Family Lawe Appendix A, Draft Family Law (Scotland) Bill cl\n45(1)-(3).\n45 Revised Explanatonj Notes for Family Lav (Scotland) Bill (as amended at Stage 2) para 36.\nVol 10 2006THE EDINBURGH LAWV REVIEW\n22 only in relation to the derivative domicile of children but not in relation to the\ndomicile of origin. This would ensure that a person has the same domicile of origin\nfrom birth to death. But it would mean that the donicile of origin remains subject\nto the common law distinction between legitimate and illegitimate children, the\nvery distinction that the Act seeks to abolish. It would also mean that a person's\ndomicile at birth could be different from the domicile immediately after birth, for\nwhile the former would be the domicile of the person's father or mother at that\ntime, the latter would be governed by the test of closest connection.\nThe third approach is to replace the common law rules with the rules in section\n22 in relation to both the domicile of origin and the derivative domicile of children.\nIn that case the test of closest connection would govern a person's domicile at the\ntime of birth, from birth until aged sixteen, and again whenever an adult abandons\na domicile of choice without immediately acquiring a new one. This approach\nwould avoid the obvious absurdities of the first two approaches but would not sit\nhappily with the fact that section 22 defines the domicile for \"persons under 16\"\nand thus discloses no intention of defining domicile after that age.46\nThe fourth and final approach is to replace the revival rule with the continu-\nance rule, and to apply section 22 both to domicile at birth and to domicile from\nbirth until aged 16.47 Since the domicile at birth could no longer revive at a later\ndate, the domicile of origin as a separate type of domicile would disappear from\nScots law. An abandonment of the revival rule would avoid the absurdities created\nby the first two approaches, and would render wholly accurate the reference in\nsection 22 to persons under sixteen. Moreover, there are strong policy arguments\nfor replacing the revival rule with the continuance rule.\n(4) Replacing the revival rule with the continuance rule\nThe revival rule was developed in the nineteenth century with respect to those\nwho settled or worked in the British colonies but with the intention of returning.4s\nWhere these people ceased to have a permanent home it was indeed appropriate\nto determine their status in accordance with the law of their native country. As\nFaville J of the Supreme Court of Iowa said in Re Jones' Estate:49\nMen left their native land knowing that they would be gone for long periods of time,\nand that means of communication with their home land were infrequent, difficult, and\nslow. The traditions of their native country were strong with these men. In the event\n46 Apart, of course, from a domicile based on closest connection persisting after the age of 16 in tbe absence\nof a new domicile of choice.\n47 As recommended by the Law Commissions' 1987 report: see C.(2) above.\n48 A comparison with \"elephants who allegedly return to their birthplace to die\" is made by C M V Clarkson\nand J Hill, Jaffey on the Conflict of Laws, 2' edn (2002) 30.\n49 (1921) 192 Iowa 78 at 83; 182 NW 227 at 229-230.\nVol 10 2006 DOMICILE OF CHILDREN\nof death, while absent, they desired that their property should descend in accordance\nwith the laws of the land of their birth. Many such men were adventurers who had the\npurpose and intent to eventually return to the land of their nativity. There was a large\ndegree of patriotic sentiment connected with the first announcement of the rules of law\nin the matter of the estates of such men.\nIn the modern world, where people are much more ready to cut all ties to their\ncountry of birth, it is no longer justified to resort to the domicile of origin to fill\na gap between two domiciles of choice. Rather, the status of a person in such a\ngap should be determined in accordance with the law of the country which was\nmost recently the permanent home. ° Where a person has only stale or tenuous\nconnections to the country of birth, the revival rule produces artificial results.51\nIndeed, the revival rule may lead to a person being domiciled in a country where\nthat person has never been. The consultation document leading to the 1987 report\ngives the following example:. 2\nA is born in India to English domiciled parents, and thus receives at birth a domicile\nin England. He remains in India after reaching the age of 16 and acquires a domicile\nof choice there. Later, in middle life, he leaves India intending to settle in the USA.\nAt that point, A's domicile of choice in India ceases and his English domicile revives,\n-although he has never even visited, let alone lived in, England. If A dies intestate before\nacquiring a domicile in one of the States of the Union, the succession to his moveable\nestate would be governed by English law.\nThe more appropriate result, of A dying domiciled in India, would be reached\nby the continuance rule under which a domicile of choice persists until a new\ndomicile of choice has been established.\nSome authors point out, however, that the continuance rule \"sometimes\nproduces equally bizarre results\", as indeed the consultation document for the\n1987 report acknowledged:54\nTake, for example, C born to parents resident and domiciled in Scotland where he also\nremains until he is an adult. Thereafter he moves to Ruritania where he sets up business\nand decides to make his permanent home. A revolution and change of government\nfollowed by political unrest and a threat of persecution drive him out and he moves to\n50 M North and J J Fawcett, Cheshire and Norths Private International Law, 13\"' edn (1999) 153.\n51 See L Collins (ed), Dicey and Morris on the Conflict of Laws, 13 h edn (2000) para 6-077, example 5.\n52 Law Commission and Scottish Law Commission, Private International Law: The Law of Domicile (Law\nCoin WP No 88, Scot Law Coin CM No 63, 1985) para 5.18, example (1). Further examples are given\nby North & Fawcett, Private International Law 152-153.\n53 J H C Morris, The Con~flict of Laws, 6th edn, by D McClean and K Beevers (2005) para 2-029. Likewise\nJ G Collier, Conflict of Lacs, 3\" edn (2001) 52. Both textbooks take Re Jones\" Estate (1921) 192 Iowa\n78; 182 N\\V 227 as an example: Mr Jones, a Welshinan, moved to Iowa at the age of 33 to live there\npermanently but decided at the age of 65 to see out his final days in Wales. He died on the voyage to\n\\Vales. Applying the continuance rule it was held that Mr Jones had died domiciled in Iowa.\n54 Law Commission and Scottish Law Commission, Private International Law: The Law of Domicile (Law\nCoin \\VP No 88, Scot La w Coin CM No 63, 1985) para 5.19.\nVoll10 2006THE EDINBURGH LAW REVIEW\nthe USA where he has business interests. However, by this time, C has resolved never\nto return to Ruritania, but to retire to Scotland when he stops work. He then dies.\nAccording to the continuance rule his domicile on death would be Ruritania, the one\ncountry in the world in which he has positively resolved never again to live, whereas the\nrevival rule would have given him a domicile in Scotland.\nBut even though the continuance rule may produce artificial results on rare\noccasions, this rule is still preferable to the revival rule, for the following reasons.\nFirst, the continuance rule ensures that a person is domiciled in a country in\nwhich that person has at one time lived whereas the revival rule can lead to a\nperson being domiciled in a country where that person has never lived. Secondly,\nby providing that a domicile can only be lost through the acquisition of a new\ndomicile, the continuance rule renders obsolete all rules on the abandonment of a\ndomicile which are the companion of the revival rule. Finally, since countries such\nas Australia, 56 New Zealand 5 7 and the United States58 have adopted the continu-\nance rule, the United Kingdom should follow suit. It may be argued that the\nrevival rule should not be abandoned in Scots law alone, in the interests of unifor-\nmity within the United Kingdom. But this uniformity has been lost in any event,\nas section 22 parts English and Scots law at least in determining the domicile of\npeople between birth and their sixteenth birthday.\nD. TRANSITIONAL PROVISION\nThe 2006 Act came into force on 4 May 2006, and article 4 of the commence-\nmcnt Ordcr proV .. ,at section 22 ofl th Act \"shall not apply in relatiOn. to anly\nproceedings which commenced before 4th May 2006\". Interestingly, however,\nthe Order does not provide that section 22 governs the domicile of people for the\ntime, and only for the time, after the coming into force of the Act. The implica-\ntions seem worth exploring.\nIn proceedings which commenced before 4 May 2006 the old domicile rules\nstill apply even in the (theoretical) case that the domicile of a person has to be\n55 Law Commissions, Report on Domicile para 5.24.\n56 Domicile Act 1982 (Commonwealth) s 7: \"The rule of law whereby the domicile of origin revives upon\nthe abandonment of a domicile of choice without the acquisition of a new domicile of choice is abolished\nand the domicile a person has at any time continues until he acquires a different domicile.\"\n57 Domicile Act 1976 s 11: \"A new domicile acquired in accordance with section 9 of this Act continues\nuntil a further new domicile is acquired in accordance with that section; and the rule of law known as\nthe revival of domicile of origin whereby a person's domicile of origin revives upon his abandoning a\ndomicile of choice is hereby abolished.\"\n58 The leading example is Re Jones' Estate (1921) 192 Iowa 78; 182 NW 227. See also Re Moore's Estate\n(1966) 68 Wash.2d 792 at 796; 415 P.2d 653 at 656; Restatement (Second) of Conflict of Laws (1971) §\n19: \"A domicile once established continues until it is superseded by a new domicile.\"\n59 Family Law (Scotland) Act 2006 (Commencement, Transitional Provisions and Savings) Order 2006,\nSSI 2006\/212.\nVol 10 2006 DOMICILE OF CHILDREN\ndetermined for a time on or after that date. Conversely, in proceedings which\ncommenced on or after 4 May 2006 the rules of section 22 apply even, it seems,\nfor the purpose of determining the domicile of a person before 4 May 2006. This\nretrospective effect would be particularly significant if, contrary to the suggestion\nabove, the revival rule were to survive. Thus if a person's domicile of origin were\nable to revive in the person's adult life, the revived domicile of origin would have\nto be determined (in proceedings which commenced on or after 4 May 2006) by\nascertaining with which country the person was most closely connected at the time\nof birth, no matter how long ago that was. The domicile of origin of people born\nbefore 4 May 2006 could thus change for several decades back. This long-reaching\nchange would be largely avoided if the revival rule were abandoned as of 4 May\n2006, for without the revival rule the domicile at birth is hardly ever relevant.\nE. CONCLUSION\nThe introduction of a test of closest connection for determining the domicile of\nchildren by section 22 of the Family Law (Scotland) Act 2006 was an overdue step\ntowards the equal treatment of all children regardless of the marital status of their\nparents. In this respect, Scots law has taken the lead in implementing a recom-\nmendation made jointly by the Law Commission for England and Wales and the\nScottish Law Commission. English law should now follow suit.\nIn order to create certainty for a large group of cases, section 22(1) and (2)\nprovides that where both parents are domiciled in the same country and the\nchild has a home with at least one of them, the child shares the parents' domicile\nwhether or not the test of closest connection would come to the same result. This\ninflexible rule may be defended on the ground that the parents' domicile will\nusually be the country of closest connection anyway, and where it is not, a unity of\ndomicile for the whole family has its own advantages.\nAccording to the explanatory notes to the Act, the new test of closest connection\nalso governs a person's domicile of origin. But to apply section 22 to the domicile\nof origin sits unhappily with the fact that this provision defines the domicile only\nfor \"persons under 16\", assuming it is maintained that the domicile of origin may\nrevive in a person's adult life in order to fill a gap between two domiciles of choice.\nSince the revival rule may lead to a person being domiciled in a country in which\nthat person has never been, the courts should adopt the continuance rule according\nto which a domicile of choice persists until a new domicile is established. Such a\ndevelopment of the law would be supported by policy arguments, would render the\nwording of section 22 wholly accurate, and would largely avoid the retrospective\nchange of the domicile of origin of people born before the Act came into force.\nVoll0 2006THE EDINBURGH LAWV REVIE'W\n"}