{"doi":"10.1103\/PhysRevLett.86.1749","coreId":"71344","oai":"oai:eprints.lancs.ac.uk:2271","identifiers":["oai:eprints.lancs.ac.uk:2271","10.1103\/PhysRevLett.86.1749"],"title":"Phase synchronization between several interacting processes from univariate data.","authors":["Janson, N. B.","Balanov, A. G.","Anishchenko, V. S.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-02","abstract":"A novel approach is suggested for detecting the presence or absence of synchronization between two or three interacting processes with different time scales in univariate data. It is based on an angle-of-return-time map. A model is derived to describe analytically the behavior of angles for a periodic oscillator under weak periodic and quasiperiodic forcing. An explicit connection is demonstrated between the return angle and the phase of the external periodic forcing. The technique is tested on simulated nonstationary data and applied to human heart rate variability data","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71344.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/2271\/1\/PRL2001PhasesUnivariate.pdf","pdfHashValue":"e46812329505898d2ce1b9b920f5afe56769c221","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:2271<\/identifier><datestamp>\n      2018-01-24T02:42:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Phase synchronization between several interacting processes from univariate data.<\/dc:title><dc:creator>\n        Janson, N. B.<\/dc:creator><dc:creator>\n        Balanov, A. G.<\/dc:creator><dc:creator>\n        Anishchenko, V. S.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        A novel approach is suggested for detecting the presence or absence of synchronization between two or three interacting processes with different time scales in univariate data. It is based on an angle-of-return-time map. A model is derived to describe analytically the behavior of angles for a periodic oscillator under weak periodic and quasiperiodic forcing. An explicit connection is demonstrated between the return angle and the phase of the external periodic forcing. The technique is tested on simulated nonstationary data and applied to human heart rate variability data.<\/dc:description><dc:date>\n        2001-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/2271\/1\/PRL2001PhasesUnivariate.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.86.1749<\/dc:relation><dc:identifier>\n        Janson, N. B. and Balanov, A. G. and Anishchenko, V. S. and McClintock, Peter V. E. (2001) Phase synchronization between several interacting processes from univariate data. Physical Review Letters, 86 (9). pp. 1749-1752. ISSN 1079-7114<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/2271\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevLett.86.1749","http:\/\/eprints.lancs.ac.uk\/2271\/"],"year":2001,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"VOLUME 86, NUMBER 9 P H Y S I C A L R E V I E W L E T T E R S 26 FEBRUARY 2001Phase Synchronization between Several Interacting Processes from Univariate Data\nN. B. Janson,1,2 A. G. Balanov,1,2 V. S. Anishchenko,2 and P. V. E. McClintock1\n1Department of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n2Department of Physics, Saratov State University, Astrahanskaya 83, 410026, Saratov, Russia\n(Received 12 October 2000)\nA novel approach is suggested for detecting the presence or absence of synchronization between two or\nthree interacting processes with different time scales in univariate data. It is based on an angle-of-return-\ntime map. A model is derived to describe analytically the behavior of angles for a periodic oscillator under\nweak periodic and quasiperiodic forcing. An explicit connection is demonstrated between the return angle\nand the phase of the external periodic forcing. The technique is tested on simulated nonstationary data\nand applied to human heart rate variability data.\nDOI: 10.1103\/PhysRevLett.86.1749 PACS numbers: 05.45.Xt, 05.45.Tp, 87.19.HhTo ascertain whether or not synchronization exists\nbetween two processes in interacting or forced systems\nrepresents an important problem of long standing. It has\nbeen studied extensively for forced or interacting periodic\noscillators [1,2], oscillators influenced by noise [3], chaotic\n[4,5], and stochastic systems [6]. The synchronization\nof two coupled periodic oscillators was originally taken\nto mean that their fundamental frequencies are coinci-\ndent or rationally connected, and that their instantaneous\nphases are continuously locked. This definition suggests\nthat one might decide whether the processes are synchro-\nnized simply by estimating the Fourier spectrum of the\nsignal from one of the coupled systems and comparing\nits characteristic frequencies. In the presence of noise,\nhowever, only effective synchronization can take place\n[7] for which the instantaneous phases are only locked\nduring finite times and the frequencies are not necessarily\nrationally connected. Serious problems may also arise due\nto the nonstationarity of experimental data.\nIn view of these difficulties, modern techniques for es-\ntablishing the presence or absence of synchronization are\nbased on the assumption that the behavior of each subsys-\ntem can be considered separately and their individual time\nseries can be compared by a variety of techniques (e.g., by\ncomputation of the phase differences between them [5]).\nThis approach can work well for forced systems, or for\ncoupled radiotechnical systems [4], or for biological sys-\ntems in vitro such as neurons [8]. Cases often arise, how-\never, where the system under study cannot readily be split\ninto its component subsystems in order to measure a sepa-\nrate signal from each of them. In living organisms, for\nexample, noninvasively acquired signals will usually re-\nsult from the interaction of many processes with different\ntime scales [9]. Thus the question as to whether or not syn-\nchronization exists may need to be tackled in cases where\none has only a one-dimensional signal to analyze from a\nsystem of interacting oscillators.\nIn this Letter we introduce a novel approach that ad-\ndresses this problem directly and appears to be widely\napplicable. It is based on the fact that, where m peri-0031-9007\u000501\u000586(9)\u00051749(4)$15.00 ©odic processes interact weakly enough within a single self-\noscillatory system, an m-dimensional torus will exist in its\nphase space [2]. Figure 1(a) illustrates the case of two\ncoupled oscillators. If the processes are nonsynchronous,\nthe phase trajectory covers the whole torus surface, and\nits Poincaré map is a closed curve. But if they are syn-\nchronous, stable and saddle cycles lie on the torus, which\nis then called resonant, and the phase trajectory tends to\nthe stable limit cycle. The Poincaré map consists of one\nor several points of a stable cycle, and the same number of\npoints of a saddle cycle lying between them on the closed\ncurve formed by unstable manifolds of the saddle cycle\n[Fig. 1(b)]. Consider the dynamics of the Poincaré map,\nplacing the origin in the interior of the closed curve. Each\ndiscrete time ti of the trajectory’s return to the Poincaré\nsecant surface can be described by a phase vector at angle\nfi as illustrated. In the synchronous regime there is a\ndiscrete number of possible values of fi, whereas for the\nasynchronous one fi may take any value within \u00012p;p\u0002.\nAccording to Takens’ theorem [10] and its extension\nto noise-influenced systems [11], the system’s attractor\nand its Poincaré map can be reconstructed from a one-\ndimensional time series. In [12] it was shown that the\nPoincaré map can be reconstructed from return times of\nthe system. Maps for the angles,\nfi \u0001 f\u0003fi21\u0004 , (1)\nhave been applied earlier to reveal determinism in experi-\nmental data [13].\nir\nSC\nR\nO\nφi r\nφi\ni\n(a) (b)\nFIG. 1. (a) A two-dimensional torus. (b) Poincaré map for a\ntwo-dimensional resonant torus for 1:3 synchronization.2001 The American Physical Society 1749\nVOLUME 86, NUMBER 9 P H Y S I C A L R E V I E W L E T T E R S 26 FEBRUARY 2001We now derive the explicit form of the function f in\nEq. (1) for the case when the angles fi are taken from\nthe return times map of a dynamical system with a two-\ndimensional torus. Consider a quasiharmonic oscillator\nwith eigenfrequency v0 and amplitude R which is forced\nharmonically with frequency V and small amplitude\nr ø R. A two-dimensional torus therefore appears\n[Fig. 1(a)]. The solution of the resulting nonautonomous\nequations can then be approximated by a sum of terms\ndescribing rotation around some origin O [Fig. 1(a)] with\nfrequency v and amplitude R, and around the unstable\ncycle SC with the external forcing frequency V and\namplitude r:\nx\u0003t\u0004 \u0001 R sin\u0003vt\u0004 1 r sin\u0003Vt\u0004 . (2)\nThe frequency v coincides with v0 in the absence of syn-\nchronization; but if the latter exists it is shifted in the di-\nrection defined by the forcing. We define the return times\nas the intervals between successive crossings by x\u0003t\u0004 of the\nthreshold x \u0001 0 in one direction. Although the transcen-\ndental equation x\u0003t\u0004 \u0001 0 has no analytic solution, the first\nterm is much larger than the second, so that the times tk\nof zero crossing by x\u0003t\u0004 are close to the times t\u0001k \u0001\npk\nv\nof zero crossing by R sin\u0003vt\u0004. We therefore expand (2) as\na Taylor series in the vicinity of t\u0001k neglecting terms be-\nyond the linear ones. Taking account of every second zero\ncrossing to register intersections in only one direction, we\nfind the ith moment of crossing,\nti \u0006 2\nr\nRv\nsin 2piV\nv\n1\n2pi\nv\n. (3)\nDenoting the rotation number j \u0001 V\u0005v and settingCi \u0001\n2piV\nv , we find the return time\nTi \u0001 ti11 2 ti \u0001 2\nr\nRv\ncos\u0003Ci 1 pj\u0004 sinpj 1\n2p\nv\n.\n(4)\nWe place the origin at the central point ( 2pv , 2pv ) of the\nreturn times map (Ti ,Ti11), introduce the angle fi as\narctan\u0001\u0003Ti11 2\n2p\nv \u0004\u0005\u0003Ti 2\n2p\nv \u0004\u0002, and derive an expression\nfor tanfi\ntanfi \u0001 cos2pj 2 tan\u0003Ci 1 pj\u0004 sin2pj . (5)\nEquation (5) provides an explicit connection between the\ncurrent angle of the return times map fi and Ci , the lat-\nter being the phase of external forcing at the time moment\n2pi\nv defining the stroboscopic section of the system. Simi-\nlarly, we derive an expression for cotfi21 and sum it with\nEq. (5) to obtain the following map:\nfi \u0001 arctan\u00032 cos2pj 2 cotfi21\u0004 . (6)\nEquation (6) shows that, if the forcing amplitude is much\nsmaller than the amplitude of natural oscillations in the1750system, the map (1) does not depend on amplitudes. The\nsame Eq. (6) can be obtained by consideration of the re-\nturn times map constructed from the moments when \u0002x\u0003t\u0004\ntakes zero values, or from the stroboscopic map of the sys-\ntem \u0003xi , xi11\u0004 where xi \u0001 x\u0003\n2pi\nV \u0004. The function arctanx is\ndefined for \u00010;p\u0002, although the real angles fi lie within\n\u00012p;p\u0002. Thus, we need to extend the map (6) to the inter-\nval \u00012p;p\u0002 by deducting p from f\u0003fi21\u0004 if fi21 is less\nthan zero. Further when referring to (6) we will assume\nthe extended map.\nFigure 2(a) plots the return function (6) for two values\nof the rotation number j (full curves). The resultant one-\ndimensional map belongs to the class of continuous circle\nmaps [14] of topological degree 1. To reveal how angle\nfi is related to the conventional phase difference Fi be-\ntween the forcing and response, we considerFi at the zero\ncrossing of x\u0003t\u0004 [see Eq. (3)]:\nFi \u0001 2\nr\nR\n\u00031 2 j\u0004 sin\u00032pij\u0004 1 2pi\u00031 2 j\u0004 . (7)\nCalculating rotation numbers yF , yf for variables Fi and\nfi, respectively:\nyC \u0001\n1\n2p\nlim\ni!`\nF0 2 Fi\ni\n\u0001 \u0003j 2 1\u0004 ;\nyf \u0001\n1\n2p\nlim\ni!`\nf0 2 fi\ni\n\u0001 j .\nNote that yF and yf differ by 1. The points of Fig. 2(a)\nshow the map for angles calculated from numerical data for\na Van der Pol system [1] forced by a weak harmonic signal,\nfor two values of the forcing frequency. The simulated data\nagree well with the theoretical curves.\nNext, we consider the general case of a quasiharmonic\noscillator forced by n harmonic signals with different fre-\nquencies Vi , i \u0001 1, . . . , n, where the amplitude Ai of each\nof these signals is much smaller than R:\nx\u0003t\u0004 \u0001 R sinvt 1\nnX\nj\u00011\nAj sinVjt, Ai ø R . (8)\nΩ=0.4\nΩ=0.7\n(b)(a) (c)\nFIG. 2. (a) Return function of the map (6) (curves), compared\nwith the map (1) plotted for numerical data for a weakly forced\nVan der Pol oscillator (empty circles) with v \u0001 1 and V \u0001\n0.4, V \u0001 0.7. The map points fall accurately on the curves.\n(b) Phase portrait of the map (9) for v \u0001 1, V1 \u0001 0.\u00021\u00020, V2 \u0001\n0.0\u00021\u00020, i.e., in the absence of synchronization. (c) As in (b), but\nforV2 \u0001 0.\u00023, showing the effect of 1:3 synchronization between\nV2 and v. The full curve in (c) indicates the return function for\n(6) with v \u0001 1 and V \u0001 0.\u00023.\nVOLUME 86, NUMBER 9 P H Y S I C A L R E V I E W L E T T E R S 26 FEBRUARY 2001Denoting Vjv \u0001 jj and bj \u0001\nAj\nA1\nsinpjj\nsinpj1 , b1 \u0001 1, and proceeding by analogy with the derivation of (6), we obtain a relation\nconnecting two successive angles of the return times map:\nfi \u0001 arctan\n∑\n2 cos2pj1 2 cotfi21 1 2\nPn\nj\u00012bj cos\u00032pijj 1 pjj\u0004 \u0003cos2pjj 2 cos2pj1\u0004Pn\nj\u00011bj cos\u00032pijj 1 pjj\u0004\n∏\n. (9)The validity of (9) follows from that of (8). Quasiperiodic\nmotion on an M-dimensional torus for M $ 3 is struc-\nturally unstable [15], so that after such a torus appears,\nan arbitrarily small perturbation of the system causes tra-\njectories on its three-dimensional hypersurface to become\nLyapunov unstable. Thus, three-frequency quasiperiodic\noscillations cannot exist in real systems affected by noise.\nHowever, (9) is valid asymptotically as the perturbation\ntends to zero.\nFigures 2(b) and 2(c) illustrate how the map (9) may\nbehave for n \u0001 2. R is set to 1. Figure 2(b) shows the\nphase portrait of the map (9) for the case when no two of\nthe three rhythms are synchronous. In Fig. 2(c) the points\nbelong to the phase portrait of (9) for the 1:3 synchronous\nregime between the rhythm with frequency V2 and the\nmain rhythm, while the full curve shows the return function\nof (6) for v \u0001 1 and V \u0001 0.\u00023. Here and in what follows,\na dot or dots above one or more digits of a number imply\na recurring decimal, i.e., an infinite repetition of the digits\nunder the dots. When all three rhythms are synchronized,\nthe map just consists of a fixed number of points (a trivial\ncase, not illustrated).\nThus, plotting the map (1) for the experimental time se-\nries allows one to draw immediate conclusions about the\nminimum number of rhythms involved, and their synchro-\nnization. Although similar conclusions can sometimes be\ndrawn from Poincaré maps, they appear to be less reliable\nin experimental practice because usually randomness in the\ninstantaneous radii ri [Fig. 1(b)] confuses the picture and\nprevents one from drawing confident inferences. By com-\nparison, the angular map has a much more pronounced and\nrecognizable structure.\nTo test the method on a nonstationary process we have\nsimulated the common experimental situation where non-\nstationarity exhibits itself in a slow random variation of the\nbasic oscillation frequency. We consider the Van der Pol\noscillator with the randomly varying parameter v, under\nexternal harmonic forcing:\n\u0002x \u0001 y; \u0002y \u0001 e\u00031 2 x2\u0004y 2 v2x 1 C sinVt ;\nw \u0001 w0 1\nDh\nt\nh\u0003t\u0004; \u0002h \u0001 2\nh\nt\n1 m\u0003t\u0004 ,\n(10)\nfor e \u0001 0.1, v0 \u0001 1, C \u0001 1 V \u0001 0.\u00023. m\u0003t\u0004 is Gaussian\nwhite noise (\u0007m\u0003t\u0004\b \u0001 0, \u0007m\u0003t\u00042\b \u0001 1), and h\u0003t\u0004 is colored\nnoise of variance Dh and correlation time t \u0001 200.\nFirst, the presence or absence of synchronization be-\ntween self-oscillations and forcing was detected by di-\nrect computation of the phase differenceF\u0003t\u0004 \u0001 3F1\u0003t\u0004 2F2\u0003t\u0004, whereF1\u0003t\u0004 is the phase of forced oscillations in the\nsystem (10), and F2\u0003t\u0004 is the phase of the external forcing\n[5]. In the absence of noise (Dh \u0001 0) 1:3 phase synchro-\nnization occurs, detectable from the plateau around zero\non the plot of F\u0003t\u0004 over the whole observation time, while\nthe corresponding map (1) consists of just three points (not\nillustrated here). For noise variance Dh \u0001 0.1, nonstation-\nary oscillations take place in the system exhibiting effec-\ntive 1:3 phase synchronization, detectable from the long\nplateaus separated by 2p phase slips [Fig. 3(a), gray line].\nFor Dh \u0001 0.7, the phase difference shows no plateaus\n[Fig. 3(a), black line], thus pointing to an absence of\nsynchronization.\nSecond, efforts were made to analyze the behavior of the\nsystem using only univariate data. The power spectra of\nthe synchronized and nonsynchronized regimes [Fig. 3(b)]\nare very similar (apart from some fluctuational broadening\nof the peaks), and do not provide a basis for distinguish-\ning between them. However, computation of the map (1)\nfor the two cases provides a much clearer distinction, as\nshown in Figs. 3(c) and 3(d). Figure 3(c) consists of three\nisolated segments lying close to a one-dimensional curve\n(i.e., indicating synchronization) while (d) does not con-\ntain isolated segments (i.e., nonsynchronization).\nWe have tried a preliminary application of the tech-\nnique to heart rate variability (HRV) data from healthy hu-\nman subjects, yielding encouraging results. In Figs. 4(a)\nFIG. 3. (a) Phase difference versus time for the forced\nVan der Pol with slowly randomly varying eigenfrequency\n(10) for noise variance Dh \u0001 0.1 (gray line, showing 2 syn-\nchronization plateaus), and for Dh \u0001 0.7 (black line, no\nplateaus). (b) Power spectra of the forced oscillations for Dh \u0001\n0.1 (shaded) and for Dh \u0001 0.7 (black line). (c) Angle-of-return-\ntime map for (10) with Dh \u0001 0.1 (indicating synchronization).\n(d) As in (c) but for Dh \u0001 0.7 (no synchronization).1751\nVOLUME 86, NUMBER 9 P H Y S I C A L R E V I E W L E T T E R S 26 FEBRUARY 2001FIG. 4. (a),(c) Power spectra for two sequences of human R-R\nintervals. Characteristic frequencies and their combinations are\nindicated. (b),(d) Angle-of-return-time map for these R-R in-\ntervals after removing trends. (b) testifies to synchronization\nbetween two of the three time scales (see text), while (d) points\nto the absence of synchronization.\nand 4(c) Fourier spectra of the HRV data for the two\nsubjects are given. Three frequencies dominate in the\nspectra, namely, f1 (average heart rate), f2 (respiration),\nand f3\u0003\t0.1 Hz\u0004, as well as their combinations. After\nremoving trends in experimental data, we plotted the re-\nturn times map and the corresponding map (1) [Figs. 4(b)\nand 4(d)]. These maps, like most others obtained from hu-\nman HRV data, appear to be in remarkable correspondence\nwith the theoretically predicted dependences [(9); Fig. 2].\nTherefore, the first conclusion to be drawn is that the in-\nteraction of rhythms within the cardiovascular system of\na typical human subject can be considered as weak. Fig-\nure 4(b) looks very similar to the phase portrait of map (9)\naffected by noise for the parameter values as in Fig. 2(c).\nThree isolated clouds of points testify to the presence of\n1:3 phase synchronization between the main heart rhythm\nand respiration. Actually, each cloud represents a smeared\ncircle (note the “holes” inside the clouds) indicating that\nthe third (\u00060.1 Hz) rhythm is present and nonsynchronous\nwith either of the two rhythms mentioned (otherwise in-\nstead of circles one would in principle observe smeared\npoints). Figure 4(d) does not imply any synchronization\nbetween the rhythms considered.\nTo summarize, our proposed new approach to the detec-\ntion of synchronization (or lack of it) between two or more\ninteracting processes is based on an analysis of univari-\nate data only. It has been shown to work well even when\nthe basic frequencies of the interacting processes slowly\nfluctuate in time due to nonstationarity. Application to\nhuman electrocardiograms demonstrated the presence or\nabsence of synchronization between particular oscillatory\nprocesses in different subjects.1752The work was supported in part by the Royal Society of\nLondon, the Engineering and Physical Sciences Research\nCouncil (U.K.), and CDRF (REC 006). The authors are\ngrateful to Dr. M. G. Rosenblum and Dr. A. Stefanosvka\nfor helpful discussions.\n[1] B. Van der Pol, Radio Rev. 1, 701 (1920).\n[2] V. I. Arnold, Geometrical Methods in the Theory of Ordi-\nnary Differential Equations (Springer, New York, 1983).\n[3] R. L. Stratonovich, Topics in Theory of Random Noise\n(Gordon and Breach, New York, 1963).\n[4] L. M. Pecora and T. L. Carroll, Phys. Rev. Lett. 64, 821\n(1990); V. S. Anishchenko, T. E. Vadivasova, D. E. Postnov,\nand M. A. Safonova, Radiotekh. Elektron. 36, 338 (1991)\n(in Russian); V. S. Anishchenko, T. E. Vadivasova, D. E.\nPostnov, and M. A. Safonova, Int. J. Bifurcation Chaos 2,\n633 (1992).\n[5] M. G. Rosenblum, A. Pikovsky, and J. Kurths, Phys. Rev.\nLett. 76, 1804 (1996); A. S. Pikovsky, M. G. Rosenblum,\nG. V. Osipov, and J. Kurths, Physica (Amsterdam) 104D,\n219 (1997).\n[6] A. B. Neiman, A. Silchenko, V. S. Anishchenko, and\nL. Schimansky-Geier, Phys. Rev. E 58, 7118 (1998); A. B.\nNeiman, Phys. Rev. E 49, 3484 (1994); A. Silchenko,\nT. Kapitaniak, and V. S. Anishchenko, Phys. Rev. E\n59, 1593 (1999); B. Shulgin, A. Neiman, and V. S.\nAnishchenko, Phys. Rev. Lett. 75, 4157 (1995).\n[7] A. N. Malakhov, Fluctuations in Self-Oscillatory Systems\n(Nauka, Moscow, 1968) (in Russian).\n[8] P. Tass, M. G. Rosenblum, J. Weule, J. Kurths, A. Pikovsky,\nJ. Volkmann, A. Schnitzler, and H.-J. Freund, Phys. Rev.\nLett. 81, 3291 (1998); A. B. Neiman, X. Pei, D. Russell,\nW. Wojtenek, L. Wilkens, F. Moss, H. A. Braun, M. T.\nHuber, and K. Voigt, Phys. Rev. Lett. 82, 660 (1999).\n[9] A. Stefanovska and M. Brac˘ic˘, Control Eng. Pract. 7, 161\n(1999).\n[10] F. Takens, in Dynamical Systems and Turbulence,\nLecture Notes in Mathematics, edited by D. A. Rang and\nL. S. Young (Springer, Berlin, 1981), Vol. 898, p. 366.\n[11] J. Stark, D. S. Broomhead, M. E. Davies, and J. Huke,\nNonlinear Anal. Theory Methods Appl. 30, 5303 (1997).\n[12] R. Hegger and H. Kantz, Europhys. Lett. 38, 267 (1997);\nN. B. Janson, A. N. Pavlov, A. B. Neiman, and V. S.\nAnishchenko, Phys. Rev. E 58, R4 (1998).\n[13] K. Suder, F. R. Drepper, M. Schiek, and H.-H. Abel, Model.\nPhys. 44, H1092 (1998); J. Godelle and C. Letellier, Phys.\nRev. E 62, 7973 (2000).\n[14] V. I. Arnol’d, Geometrical Methods in the Theory of\nOrdinary Differential Equations (Springer-Verlag, New\nYork, 1983); J. Guckenheimer and P. Holmes, Nonlinear\nOscillations (Springer-Verlag, New York, 1983); L. Glass,\nChaos 1, 13 (1991).\n[15] S. Newhouse, D. Ruelle, and F. Takens, Commun. Math.\nPhys. 64, 35 (1979).\n"}