{"doi":"10.1016\/j.jspi.2004.07.008","coreId":"66108","oai":"oai:dro.dur.ac.uk.OAI2:3118","identifiers":["oai:dro.dur.ac.uk.OAI2:3118","10.1016\/j.jspi.2004.07.008"],"title":"Trade-off sensitive experimental design : a multicriterion, decision theoretic, Bayes linear approach.","authors":["Farrow,  M.","Goldstein,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-02","abstract":"We show how mutually utility independent hierarchies, which weigh the various costs of an experiment against benefits expressed through a mixed Bayes linear utility representing the potential gains in knowledge from the experiment, provide a flexible and intuitive methodology for experimental design which remains tractable even for complex multivariate problems. A key feature of the approach is that we allow imprecision in the trade-offs between the various costs and benefits. We identify the Pareto optimal designs under the imprecise specification and suggest a criterion for selecting between such designs. The approach is illustrated with respect to an experiment related to the oral glucose tolerance test","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66108.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3118\/1\/3118.pdf","pdfHashValue":"a219b04ba5e30edd2581a830953e14c22c223eb6","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3118<\/identifier><datestamp>\n      2011-08-24T12:30:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Trade-off sensitive experimental design : a multicriterion, decision theoretic, Bayes linear approach.<\/dc:title><dc:creator>\n        Farrow,  M.<\/dc:creator><dc:creator>\n        Goldstein,  M.<\/dc:creator><dc:description>\n        We show how mutually utility independent hierarchies, which weigh the various costs of an experiment against benefits expressed through a mixed Bayes linear utility representing the potential gains in knowledge from the experiment, provide a flexible and intuitive methodology for experimental design which remains tractable even for complex multivariate problems. A key feature of the approach is that we allow imprecision in the trade-offs between the various costs and benefits. We identify the Pareto optimal designs under the imprecise specification and suggest a criterion for selecting between such designs. The approach is illustrated with respect to an experiment related to the oral glucose tolerance test. <\/dc:description><dc:subject>\n        Imprecise utility<\/dc:subject><dc:subject>\n         Multi-attribute utility<\/dc:subject><dc:subject>\n         Pareto optimality<\/dc:subject><dc:subject>\n         Oral glucose tolerance test.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Journal of statistical planning and inference, 2006, Vol.136(2), pp.498-526 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3118<\/dc:identifier><dc:identifier>\n        issn:0378-3758<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.jspi.2004.07.008<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3118\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.jspi.2004.07.008<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3118\/1\/3118.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0378-3758","0378-3758"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Imprecise utility","Multi-attribute utility","Pareto optimality","Oral glucose tolerance test."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n24 February 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nFarrow, M. and Goldstein, M. (2006) ’Trade-off sensitive experimental design : a multicriterion, decision\ntheoretic, Bayes linear approach.’, Journal of statistical planning and inference., 136 (2). pp. 498-526.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.jspi.2004.07.008\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n24 February 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nFarrow, M. and Goldstein, M. (2006) 'Trade-off sensitive experimental design : a \nmulticriterion, decision theoretic, Bayes linear approach.', Journal of statistical planning and \ninference., 136 (2). pp. 498-526. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1016\/j.jspi.2004.07.008 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nTrade-Off Sensitive Experimental Design: A Multicriterion,\nDecision Theoretic, Bayes Linear Approach\nMalcolm Farrow\nNewcastle University, UK\nMichael Goldstein\nUniversity of Durham, UK\nAbstract\nWe show how mutually utility independent hierarchies, which weigh the various costs of an\nexperiment against benefits expressed through a mixed Bayes linear utility representing the\npotential gains in knowledge from the experiment, provide a flexible and intuitive methodology\nfor experimental design which remains tractable even for complex multivariate problems. A\nkey feature of the approach is that we allow imprecision in the trade-offs between the various\ncosts and benefits. We identify the Pareto optimal designs under the imprecise specification\nand suggest a criterion for selecting between such designs. The approach is illustrated with\nrespect to an experiment related to the oral glucose tolerance test.\nKeywords: Imprecise utility; Multi-attribute utility; Pareto optimality; Oral glucose tolerance\ntest.\n1\n1 Introduction\nThis paper is concerned with the decision theoretic approach to the design of experiments. In\nprinciple, the choice of an experimental design is a decision problem. We have a number of possible\nchoices of design (decisions). Each choice has certain benefits, typically derived from expected\ngains in knowledge, and incurs expenditure, typically relating to both resource and ethical costs.\nChoosing a good design is a hard decision problem, which would benefit, in two fundamental\nways, from appropriate methodology, in which all costs and benefits were quantitatively assessed,\ncombined and jointly optimised. Firstly, the formulation of design choice as a decision problem,\nby making all relevant judgments explicit, would bring a clarity to the process. Such a quantitative\nformulation would make explicit the implied trade-offs between costs and benefits which underlie\nthe choice of design for each of the participants, namely the experimenters, the subjects in the\nexperiment, the ethics committee, the funding body and so forth. Secondly, the solution of the\nresulting decision problem would identify the best choice of design, or, more in the spirit of decision\nanalysis, the collection of designs which are almost optimal would identify the pragmatic range of\ndesign choices that merit serious consideration.\nAmong the problems that we must address in developing a decision theoretic approach to\ndesign are the following: (i) costs: resource usage, ethical costs, and so forth may be hard to\nquantify; (ii) benefits: potential gains in knowledge from the experiment may be even harder to\nquantify; (iii) trade-offs: experimenters may find it very difficult to weigh the relative importance\nof the different costs, and even harder to weigh such costs against the potential benefits of the\nexperiment; (iv) prior knowledge: this is hard to quantify for complex problems; (v) design:\neven were we able to specify fully all of the above ingredients, for example within a full Bayes\nframework, choosing the optimal design would be an extremely difficult computing problem.\nWhile there is plenty of theoretical work on Bayes designs, (see, for example, the review in\nChaloner and Verdinelli, 1995), there is little Bayes (or any other!) methodology which, in practice,\noffers guidance on decision theoretic design for complex multivariate experiments with realistic cost\nstructures. Much of the Bayesian design literature is concerned with one or other of two aspects\nof the problem. The first, which we might term the design-point selection problem, is concerned\nwith finding an “optimal” design, often specified by a design matrix, given a fixed total sample\nsize. Most literature on the second aspect, the sample size problem, involves simple designs and,\nusually, a simple trade-off between the cost of experimental units and information gain.\nIn the design-point selection literature, by relaxing the requirement for the numbers of observa-\ntions at different design points to be integers, the problem, at least in linear models, can be made\none of selecting the proportions of the total sample to be allocated to each design point. Thus the\nquestion of choosing a sample size is avoided. Moreover, usually no allowance is made for differ-\nences in costs between observations at different design points. The optimality criterion is often\nthe Bayesian version of a criterion such as A- or D-optimality. These two and some others can be\njustified as maximising the expectation of a utility function which values information gain in some\nsense. For example, Sebastiani and Wynn (2000) use maximum entropy sampling which, in the\nnormal linear model, leads to Bayesian D-optimality. Recent work in this area has included the\ncombination of several information-gain criteria, for example to measure learning about different\npossible models. Examples of this include Clyde and Chaloner (1996) and Dette and Franke (2000).\nThe criteria are usually combined as a weighted sum or one is optimized subject to constraints\non the values attained for the others. In this paper we combine an information-gain utility with\nutilities for costs. The information-gain utility involves combining, not necessarily additively, a\nnumber of sub-utilities, each of which is related to the utility leading to the Bayesian A-optimality\ncriterion. Verdinelli and Kadane (1992) use a utility which combines information gain, in the\nD-optimality form, with the total value of the dependent variable in an experiment.\nThe Bayesian sample-size literature generally involves maximising the expectation of a utility\nwhich involves the cost of making observations and either the consequence of some action following\nthe experiment or a measure of information gain. Lindley (1997), Bernardo (1997) and Adcock\n(1997) give a useful introduction to the area. Recent examples include Walker (2003), whose utility\ninvolves the consequence of an action such as choice of treatment, for the case of a simple random\n2\nsample, and Gittins and Pezeshk (2000), who propose both a “public health” utility, involving both\nthe benefit of a new treatment and the number who will use it as well as costs, and a “commercial”\nutility, for the case of a clinical trial to compare two treatments. For a Bayes linear approach to\nfinding sample sizes to obtain specified reductions in variance, see Goldstein and Wooff (1997) and\nShaw and Goldstein (1999).\nTan and Smith (1998) consider the use of realistic utility functions for both sample-size determi-\nnation and allocation to treatments in a two-treatment clinical trial, with a cost-benefit trade-off in\nwhich benefit is related to “success” of the trial. Claxton et al. (2000) discuss choice of treatment\n(not design) with “cost-benefit” trade-off.\nThis paper has two parts. In the first part, we develop a multi-criterion decision theoretic\napproach to the design of experiments. We use a flexible cost utility structure which allows costs\nof several types and differences in costs between design points. We allow multivariate observations\nand use a correspondingly flexible information-gain utility. To provide a focus for our discussion, we\ndiscuss a multivariate, grouped, repeated measurement study in a medical context, with two types\nof cost (financial, ethical), which must be weighed against the potential gains from the experiment.\nWhile decision theory addresses the choices of the individual, experimental design typically\nneeds to reconcile the preferences of many protagonists. Further, even in fairly simple examples,\na single individual may not be able to specify precisely the relative importance of the various\ncosts and benefits. Therefore, one of the most difficult steps in many decision analyses is the\nquantification of the relative importance of the different attributes of the design, due either to the\nunwillingness or inability on the part of the experimenter to specify certain risk trade-offs or from\ndisagreement on priorities within a committee with responsibility for the design. In the second\npart of the paper, we therefore address this issue by developing an approach which explicitly allows\nfor and incorporates such imprecision in the trade-offs between the different costs and benefits of\nthe experiment.\nIn Section 2 of this paper we introduce our illustrative example. In Section 3 we introduce\na suitable structure for utility functions in experimental design problems and, in particular, a\nmethod of assigning utilities to the gains in knowledge obtained by the experiments. In Section\n4 we describe how an optimal design may be selected. In Section 5 we generalise the method\nby allowing imprecision in the trade-offs between the attributes of the utility. This leads to the\nselection of a set of Pareto optimal designs as shown in Section 6. A criterion for selecting between\nthe Pareto optimal designs is suggested in Section 7. Finally, in Section 8, we extend the method\nto allow a more general form of utility function.\n2 Example: The oral glucose tolerance test\nWe shall consider an experiment, actually conducted some years ago, concerning the oral glucose\ntolerance test (O.G.T.T.) which is used to help measure the severity of disease suffered by a\ndiabetic patient. After a period without food, patients are given glucose orally. Blood samples\nare taken immediately before the glucose is given and at intervals thereafter. The concentration of\nglucose in each sample is determined and, roughly speaking, the quicker the glucose concentration\nreturns to its fasting level the more healthy is the patient. High fasting levels of glucose, or slow\nreturn to fasting levels after taking glucose, are suggestive of diabetes. For example, the World\nHeath Organisation diagnostic levels were that a fasting glucose level above 7 mmol\/litre or a two\nhour level above 10 mmol\/litre suggests diabetes, while a fasting level below 7 mmol\/litre and a\ntwo hour level between 7 and 10 mmol\/litre suggest “impaired glucose tolerance” (World Health\nOrganisation, 1980). One of the main reasons for the study was that the experimenters believed\nthat methods of interpretation of O.G.T.T. results designed for young patients might need to be\naltered to suit the elderly because of a generally slower response rate in old people. The groups\nof elderly subjects in the study included Group 1: “Well-controlled” (diabetes controlled by diet\nwith or without drugs but not insulin), and Group 2: “Insulin dependent” (the most severe form,\nrequiring insulin treatment). (To simplify our account, we accept the clinicians’ classifications at\nface value.)\nBlood samples were taken immediately before the glucose was given and at intervals thereafter.\n3\nFrom each sample, the concentrations of glucose and, in addition, C-peptide could be determined.\n(See also Wickramasinghe et al.,1992, Farrow and Leyland, 1991, and Farrow and Goldstein, 1992).\nThe experiment had two aims. Firstly, in order to improve the interpretation of test results for\nelderly patients and perhaps shorten test duration for such patients, information was required\non typical responses to the O.G.T.T. from elderly patients with different degrees of diabetes.\nSecondly the investigators wished to see whether C-peptide measurements, in addition to blood\nglucose, provided extra diagnostic information, as C-peptide concentration in the blood is thought\nto indicate insulin production.\nThere are two types of cost in this experiment. Firstly, there are financial costs, both in\ntaking each blood sample and also the laboratory costs for each determination of glucose or C-\npeptide concentration. It costs much more to determine a C-peptide concentration than a glucose\nconcentration. Further, there are staff costs involved in the care and administration for each patient\nand these increase with the duration of the test and the severity of illness. Secondly, there are\nethical costs, which arise not only from the inconvenience and discomfort, but also because there\nmay be damage to a diabetic patient’s health, from fasting, taking glucose and fasting again. These\ncosts greatly increase with the severity of the illness and the duration of the test. They must be\nweighed against the benefits of the experiment which derive from our gain in knowledge.\nTo simplify our account, we restrict our attention to Groups 1 and 2 and to the baseline and\n60 minute values and we suppose that we always take the cheaper observation, namely the glucose\nlevel, for each patient, making the more expensive, C-peptide, observation on a subset of the\npatients. Thus our design choices are to determine four numbers ngv, where ngv is the number\nof patients chosen from group g, where g = 1, 2, for which variables v are observed where v = 1\nlabels the subset on which only glucose measures are taken, and v = 2 labels the subset on which\nboth glucose and C-peptide measures are taken. We will denote a particular design choice by the\nquadruple (n12, n22, n11, n21).\nIf, as here, financial and ethical costs are of serious concern, then decision analysis is the only\napproach which allows us to weigh the benefits of different experiments against the costs in a\nmanner which allows us to identify the design of maximal value. In order to carry out such an\nanalysis, we must (i) formulate a utility function on experimental costs and outcomes, (ii) quantify\nall uncertainties and (iii) optimise expected utility over all choices of design. Of course, if we do\nnot use decision analysis, we will still have to choose a design, but without a formal approach for\nweighing costs and benefits the choice will be much more difficult and, to a large extent, arbitrary.\nIn the following sections, we shall show how to set up and analyse experiments such as these within\nthe decision formalism, and then introduce certain extensions to the standard methodology which\nare useful for dealing with problems involving risk trade-offs that are considered difficult to specify.\nThe first step is to construct the utility function. To motivate our general discussion, observe\nthat it is often valuable to think of the utility in the form of a hierarchy. See figure 1. In the\npresent example, the top level node is the overall utility of the designed experiment. We may\nview this utility as having two attributes, namely Costs and Benefits. So on the second level\nwe have a Cost node and a Benefit node, both leading into the Overall node. The Cost node\nitself has two attributes, namely Ethical and Financial costs, and so, on the third level, each has\na node, both leading into the Cost node. The Benefit node similarly has various attributes, all\narising from gains in information about the various patient responses in the two groups. There\nare many ways that we may choose to represent such benefits, depending on the context in which\nwe plan to use our results. In our account, we will suggest a simple choice for benefits, which is\nsufficient to illustrate the general approach, namely to suppose that there are four attributes for\nthe benefit comprising improved information about each of the following collections of quantities:\nM1 fasting levels for C-peptide; M2 fasting levels for glucose; M3 changes in C-peptide levels\nover one hour; M4 changes in glucose levels over one hour. For example, M1 represents gains in\ninformation about the joint distribution of fasting C-peptide levels both for individuals who are\n“Well controlled” and individuals who are “Insulin dependent”. We will clarify the precise way in\nwhich this benefit is quantified in later sections. Our utility hierarchy is therefore completed by\nadding nodes representing each of M1 to M4 at the third level, entering the Benefit node.\n4\nFigure 1: Utility hierarchy.\nDesign D\nBenefit B Cost C\nFinancial F Ethical E\n\u0000\n\u0000\n\u0000\n\u0000\n\u0000\n\u0000\u0012\n@\n@\n@\n@\n@\n@I\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\u0015\nA\nA\nA\nA\nA\nAK\nM1\nM2\nM3\nM4\n6 6 6 6\n5\n3 Utility hierarchies for experimental design\n3.1 Mutually utility independent hierarchies\nWe now explain the formal properties that we require of a utility hierarchy, in order that it should\nbe amenable to formal specification and analysis, and construct appropriate utility functions for\nexperimental design. In this section we consider a general class of multi-attribute utility functions.\nAttributes Y = (Y1, ..., Yk) are utility independent of the attributes Z = (Z1, ..., Zr) if conditional\npreferences over lotteries with differing values of Y but fixed values, z, of Z, do not depend on the\nparticular choice of z. AttributesX = (X1, ..., Xs) are mutually utility independent if every subset\nof X is utility independent of its complement. If attributes X are mutually utility independent,\nthen the utility function for X must be given by the multiplicative form, (1+kU(X)) =\n∏s\ni=1(1+\nkaiUi(Xi)), or the additive form, U(X) =\n∑s\ni=1 aiUi(Xi), (see Keeney and Raiffa, 1976), where\nUi(Xi) is a conditional utility function for attribute Xi, namely an evaluation of the utility of Xi for\nfixed values of the other attributes. The coefficients in these equations are the trade-off parameters;\nthe ai reflect the relative importance of the attributes and k reflects the degree to which rewards\nmay be regarded as complementary, if k > 0, or as substitutes, if k < 0 (Keeney and Raiffa, 1976,\nsection 5.4.5). Keeney and Raiffa (1976) also describe the idea of a hierarchy of utilities, as follows.\nWe form an overall multi-attribute utility from marginal utilities for the various attributes by a\nhierarchical structure which may be represented as a graph in which each attribute of the problem\nis represented as a node. Some of the attributes are themselves comprised of sub-attributes and, in\nthe graphical representation, each attribute node is joined to each of the constituent sub-attributes\nby an arc. An example of such a structure is given as figure 1. The overall utility is constructed\nas follows. For each attribute with no sub-attributes, we specify a utility function. At each other\nnode in the structure, we construct the utility by merging the utilities of all of the constituent sub-\nattributes. Eventually, one overall utility function is formed corresponding to the node at the head\nof the graph. If, at each node, we have mutual utility independence for the utilities combined at\nthat node, then we term such a utility function a Mutually Utility Independent Hierarchic (MUIH)\nutility. Thus, in a MUIH utility, at each node we combine utilities using either the multiplicative\nor additive form.\nIn our utility hierarchy we consider the overall utility node to be at the “top” level and the\npredecessors of a node to be at “lower” levels. We refer to the nodes corresponding to the individual\nattributes, that is nodes which have no predecessors, as marginal nodes. We refer to a direct\npredecessor of a node as a parent and a direct successor as a child. For each node i, we denote\nby N(i), the sub-hierarchy under i, where N(i) is the set of nodes containing i and all of its\npredecessors. We divide the child nodes in the hierarchy into three types: additive, binary and\nmultiplicative. In an additive node utilities are combined using the additive form giving\nU =\ns∑\ni=1\naiUi (1)\nwith\n∑s\ni=1 ai ≡ 1 and ai > 0 for i = 1, . . . , s. In a binary node, with parameters a1, a2, h, precisely\ntwo utilities are combined and we rescale the combined utility as\nU = a1U1 + a2U2 + hU1U2 (2)\nwhere 0 < ai < 1, −ai ≤ h ≤ 1− ai and a1 + a2 + h = 1. In a multiplicative node more than two\nutilities are combined and the parameter k in the multiplicative form may be nonzero. We rescale\nthe utility so that\nU =\n∏s\ni=1(1 + kaiUi)− 1∏s\ni=1(1 + kai)− 1\n(3)\nwhere a1 ≡ 1, k > −1 and, for i = 1, . . . , s, we have ai > 0 and kai > −1.\nThe above categorisation embraces all of the different specifications that we may make which\nare consistent with the property of utility independence. (Binary nodes are the special case of\n6\nmultiplicative nodes where s = 2. Equation (2) is derived by setting s = 2 and h = ka1a2 in (3).\nWe distinguish between binary and multiplicative nodes only because some results may be stated\nmore simply in the binary case.) For some problems, it will be sufficient to work only with additive\nnodes. However, we gain much flexibility by allowing the more general forms, as this allows us\nto consider problems where, while the attributes are utility independent, they still complement or\nsubstitute for each other. See the discussion in Keeney and Raiffa (1976).\nFor each child node i, we denote by φi = (φi1, . . . , φim(i)) the collection of trade-off parameters\nwhich determine how the parent utilities at node i are combined to give the value at the child node.\nThus, each φij corresponds to an ai in (1) an ai or h term in (2), or an ai or k in (3). If there are\nn child nodes, then we denote by θ = (φ1, . . . ,φn) the collection of all the trade-off parameters\nin the hierarchy. As the marginal utility at each marginal node is expressed in a utility scale, we\nnorm all the marginal utilities to lie between 0, the worst outcome that we shall consider for the\nproblem, and 1, the best outcome. The effect of the scalings that we have chosen for additive,\nbinary and multiplicative nodes is that, at each node i in the hierarchy, the utility is 1 for the\noutcome Ci when all marginal predecessor nodes have utility 1, and is zero for the outcome ci\nwhen all marginal predecessor nodes have utility zero. Therefore, a utility value of u at node i may\nalways be interpreted as the utility of a gamble giving Ci with probability u and ci with probability\n1−u, irrespective of the chain of trade-off parameters in the hierarchy. This utility scale is termed\nthe standard scale for the hierarchy. Throughout this paper, all utilities are assumed to be on\nthe standard scale.\n3.2 Costs and benefits\nWe now construct MUIH hierarchies for experimental design. Our overall utility U(D) for choosing\na design D depends on the costs, C, and the benefits, B. If costs and benefits can be taken to be\nmutually utility independent, then our overall utility, Ud, for a design is a binary node (2) with\nparents Uc, Ub, the marginal utilities for cost and benefit, scaled to [0,1], with parameters ac, ab, h.\nUd = acUc + abUb + hdUcUb (4)\nWe now separate Uc and Ub into contributory attributes. As an illustration, suppose that Uc\ndepends both on ethical costs, E, and financial costs, F, which we judge to be utility independent.\nThen\nUc = aeUe + afUf + hcUeUf (5)\nwhere Ue and Uf are utilities for ethical and financial costs respectively, placed on a [0, 1] scale by\nsetting each cost utility to one for the null experiment, i.e. no experiment at all, and to zero for\nthe largest cost which might be tolerated.\nIn some circumstances, it will be reasonable to construct benefit utilities which relate directly\nto the effectiveness of potential future treatments in a well-defined clinical context, e.g. Gittins and\nPezeshk (2000), Walker (2003). Such utility specifications will typically be highly problem specific\nand usually will require great care in taming the computational complexity required to identify\ngood designs, as Bayesian design choice is a notoriously computer intensive problem, often requiring\nsimulations (e.g. Mu¨ller, 1999). In many cases, however, treatment decisions will not follow directly\nfrom the individual study, which, as in our example, is part of an ongoing series of investigations\nwhich will in combination identify treatment regimes. In such cases, the main benefits from a\nmedical experiment derive from our gain in knowledge. This might lead to the development of\nbetter diagnostic or therapeutic methods, it might show that the test or treatment was useless or\nit might lead to further experiments which are eventually fruitful in some currently unsuspected\nway. Therefore, a natural way to express the benefit is to quantify the change in information,\nrelative to our current state of knowledge. This view, of course, is also the justification for the\nuse of criteria such as Bayesian A- and D-optimality which are widely used in the Bayesian design\nliterature (Chaloner and Verdinelli, 1995). We may then weigh the value of possible gains in\nknowledge against the various costs. (Additional benefits, for example direct benefit to patients in\n7\na trial from the new treatment, may be handled analogously to the costs.) We now develop such\na benefit utility in a flexible form which leads to a tractable design methodology.\n3.3 Mixed Bayes linear utilities for gains in knowledge\nDesign calculations for full Bayes analyses are notoriously expensive, as, for each choice of design,\nthe reduction in uncertainty must be assessed for each possible sample that could be obtained.\nTherefore, we instead choose to assess the reduction in uncertainty from a Bayes linear viewpoint.\nThis approach may be viewed either as applying when the underlying uncertainties are roughly\nGaussian, or as providing a general, simple and tractable upper bound approximation to the pre-\nposterior expectation of the posterior variance given certain simple moment assessments, or as the\nappropriate form of analysis when we are only prepared to make a partial prior belief specification\nin the form of first and second moments. (See Goldstein, 1999, and Farrow and Goldstein, 1993).\nHowever, provided the experiment is sufficiently simple for a full Bayes preposterior design calcu-\nlation to be tractable, then the methodology that we develop below for design choice will apply\nequally for any such Bayes analysis. We now describe the Bayes linear utility, which we build in\nthree stages.\n(i) Consider an experiment in which we learn about a single quantity, X. Suppose that, from\ndesign D, we observe data d, and calculate the Bayes linear adjusted expectation, Ed(X) for X.\nAs the Bayes linear approach takes expectation as primitive it is natural and tractable to consider\na basic attribute of the experiment to be the magnitude of the difference between Ed(X) and the\nactual value of X, namely d(X) = X−Ed(X), assessed as (X−Ed(X))2 (see, for example, de Finetti\n(1974) in which the preferred choice of penalty of this type is taken as the operational definition for\nexpectation). A simple benefit utility, constructed from this attribute, is given by the expectation\nof this quantity, namely E(d2(X)) = vard(X), the adjusted variance of X given d. We scale so that\nthe utility of carrying out a precise experiment, i.e. one which will reveal exactly the value of\nX, is 1, and the utility of carrying out no experiment is 0, so that U(X) = 1− vard(X)\/var(X).\n(ii) Now suppose that we learn about a collection X = (X1, ..., Xm), where all linear com-\nbinations of X are considered equally important. Then, a corresponding collection of attributes\nwhich express our gain in knowledge is the vector d(X) =X −Ed(X), where Ed(X) is the vector\nof adjusted expectations for the elements of X after observing data d. If (X1, ..., Xm) are un-\ncorrelated, then a corresponding representation of the joint utility is the additive form, namely\nU(X) = m−1\n∑m\ni=1 U(Xi), where each U(Xi) = 1 − vard(Xi)\/var(Xi). If (X1, ..., Xm) are corre-\nlated, then we may apply this to the principal components of X, equivalently assessing U(X) to\nbe\nU(X) = 1− E{m−1d(X)TV −1X d(X)}, (6)\nwhere V X is the prior variance matrix of X. (If V X is of less than full rank, we first reduce X to\na maximal sub-collection for which V X has full rank.) We term (6) the Bayes linear utility as we\nmay evaluate U(X) purely in terms of the sufficient belief specifications necessary to carry out a\nBayes linear analysis. A priori, our variance matrix for d(X) is V X −CXDV −1D CDX , where V D\nis the variance of the data and CXD = C ′DX is the covariance between X and the data, D. The\nBayes linear utility U(X) in (6) is therefore evaluated as\nU(X) = 1−m−1trace{V −1X (V X −CXDV −1D CDX)} = 1−m−1trace{MD} (7)\nwhere MD = I − V −1X CXDV −1D CDX is the adjustment transform matrix for X adjusted by\nthe data from the proposed experiment (see Farrow and Goldstein, 1993). This utility may be\ncompared with the utility U (A)(X) = 1 − E{m−1d(X)TAd(X)} which leads, in the univariate\nnormal linear model, to the Bayesian A-optimality criterion (e.g. Chaloner and Verdinelli, 1995).\nIn our multivariate setting we obtain 1 − m−1trace{A(V X − CXDV −1D CDX)} and we choose\nA = V −1X although other values of A could easily be used.\n(iii) Suppose that we judge that increased knowledge for some linear combinations of elements of\nX is more important than for others. We construct the linear space L(X) of all linear combinations\nof the elements of X, i.e. all quantities of the form\n∑k\ni=1 ciXi. Then we divide L(X) into linear\n8\nsubspaces L1, ...,Lr for which we judge increased knowledge about each linear combination within\na particular collection Li to be of equal value. We assess the utility, Ui(Li), of the experiment for\nlearning about the elements of subspace Li, by applying (6) to any maximal collection of elements\nof Li with variance matrix of full rank.\nIn many circumstances, we will judge gains in information over each of L1, ...,Lr to be mutually\nutility independent. Therefore, for a particular choice of design and a particular collection of\nexperimental outcomes, we can represent our overall benefit utility, Ub, for the experiment by\n(1+kbUb) =\n∏r\ni=1[1+kbbiUi(Li)], where Ui(Li) is given by (6). We call this form the mixed Bayes\nlinear utility for X. In the special case where kb = 0, Ub is given by the additive form\nUb =\nr∑\ni=1\nbiUi(Li), (8)\nwith constraints as in (1). Similarly, if r = 2, we have a binary benefit node and\nUb = b1U1(L1) + b2U2(L2) + hbU1(L1)U2(L2), (9)\nwith constraints as in (2), and where r > 2 and the parameter kb may be nonzero,\nUb =\n∏r\ni=1[1 + kbbiUi(Li)]− 1∏r\ni=1(1 + kbbi)− 1\n(10)\nwith constraints as in (3). These scalings ensure that, for any choices of trade-off parameters in\nthe mixed Bayes linear utility, the utility of carrying out no experiment is zero, while the utility of\na precise experiment for all elements of X is 1, so that the overall benefit utility is on the standard\nscale.\nNote that, when the additive form (8) is used, this benefit utility function leads to a “weighted”\nor “compound” optimality criterion (e.g. Clyde and Chaloner, 1996) in which the individual terms\nare the Bayes linear version of the multivariate generalisation of the usual Bayesian A-optimality\ncriterion. The forms (9) and (10) allow greater flexibility in the way that the individual “criteria”\nare combined.\nIt is also possible to justify the use of (7) as the expectation of a utility function based directly\non the value of d(X).\n4 Choosing optimal designs for the glucose trial\n4.1 Example: utilities for the glucose trial\nWe now illustrate the Bayes linear choice of optimal design for an experiment based on a MUIH\nby working through the prior assessment and design choice for the glucose trial example. For the\npurposes of this example, we will consider the utility of the financial costs to be proportional to\nthe monetary costs, as given in Table 1. For simplicity, the expected marginal ethical utility for\neach type of patient was elicited directly as there was no prior belief in substantial correlations\nbetween benefits and ethical costs. The expected ethical costs were assessed in “units of ethical\ncost.” (Compare Farrow and Goldstein, 1992). Both costs varied between groups. All costs\nwere then converted to an approximately [0, 1] utility scale by Ue = (emax − ecost)\/emax and\nUf = (fmax − fcost)\/fmax, where ecost and fcost are the ethical and financial costs and emax and\nfmax are the values corresponding to a “large” experiment, actually one with 40 patients in each\ngroup. The expected ethical and financial costs (in scaled units) and the corresponding marginal\nutilities for a single patient in each group were as given in Table 1. Notice that the ratio of Group\n2 to Group 1 costs is greater for ethical costs than for financial costs and so the design will be\nsensitive to the trade-off between financial and ethical costs, tending to concentrate patients in\nthe healthier group if ethical costs are given relatively high weighting. However, the experimenters\nfound it very hard to specify this trade-off. We will be particularly concerned with considerations\nof trade-off sensitivity in later sections.\n9\nTable 1: Ethical and financial costs. (1): Glucose only. (2): Glucose and C-Peptide.\nEthical Cost Financial Cost (1− Ue)× 103 (1− Uf )× 103\n(1) (2) (1) (2)\nGroup 1: Well controlled 192 3.50 8.86 6.82 4.02 10.19\nGroup 2: Insulin 512 7.52 12.88 18.18 8.65 14.81\nThe benefit utility is based on our gain in knowledge. For each patient in each group, there\nare two possible measurements, glucose and C-peptide, at each of two time points. We wish to\nlearn about the means at each time point for each variable in each group. Each quantity may be\nof clinical interest, as may be various combinations of the quantities. Because the purpose of the\nOGTT is to distinguish the more severe from the less severe level of diabetes, it is natural to work\nin terms of the following four sets of quantities which, collectively, are equivalent to the means:\nM1 and M2, the fasting (i.e. t = 0) means, and M3 and M4, the mean change over 60 minutes,\nfor C-peptide and glucose respectively. The change in glucose level over time and the fasting level\nfor an individual patient are diagnostic for diabetes.\nThese groups having been established, the marginal utility function for the benefit from learning\nabout each of these groups of quantities is of the form (6) with mi = 2. The utilities for the four\ngroups are then combined using (8), (9) or (10) to give Ub. The financial and ethical cost utilities\nare combined using (5) and finally the overall utility is formed using (4).\nOur overall utility function might contain products of marginal utilities and we may well have\nbeliefs in which the utilities are not independent of each other. In some cases evaluation of expec-\ntations may require specification of moments beyond the second. However we will often be able\nto simplify this task, even without fully specified probability distributions. For reasons of space\ndetails are left to be presented elsewhere.\n4.2 Example: choice of trade-off parameters\nTo simplify our account, we first consider the case where all utilities are additive. We therefore\nneed to specify the benefit trade-off values b1, . . . , b4 in (8), the cost trade-off ae, af in (5) and the\ncost benefit trade-off ac, ab in (4).\nOur experience was that the four benefit utilities were sufficiently comparable that we could\nask a series of elicitation questions which effectively fixed these values. The values used for this\nillustration are b1 = 0.18, b2 = 0.12, b3 = 0.35 and b4 = 0.35, and these are regarded as fixed\nfor now. (For further details of the elicitation of such a benefit utility, see Farrow and Goldstein,\n1992). All evaluations of expected benefit utilities are given by (7).\nThe financial-ethical trade-off was assessed indirectly by comparing the desirability of omitting\npatients from different groups. For example, the financial cost for a patient in Group 2 is 45 %\ngreater than for a patient in Group 1, when both variables are observed, but the ethical cost for\nGroup 2 is 167 % greater than that for Group 1. In fact, the value chosen was af = 0.45 which\nsuggests that one patient from Group 2 would “cost” approximately the same as two from Group\n1 and gives 22% more weight to financial cost than to ethical cost in Group 1 but still gives 50%\nmore weight to the ethical cost than to the financial cost for a patient in Group 2.\nWe found it helpful in eliciting the cost-benefit trade-off to evaluate the expected costs and\nbenefits for a range of simple, standard designs, for which we chose (n, n, 0, 0) designs with n =\n1, 2, . . . , and to elicit np, the preferred value of n among these, where the various costs were to be\ninformally weighed against the square root of the expected benefit, expressed as a “reduction in\nstandard deviation.” A rough preference for np = 15, combined with af = 0.45 led to a value of\nab = 0.85.\nThe experimenters felt uncomfortable with the need to specify precise values for these trade-off\nparameters. Thus there is a need for methods which do not rely on such precise choice of trade-offs.\nWe will introduce methods of this type in Section 5.\n10\nTable 2: Beliefs for simplified example.\nMean Variances and Covariances\nM110 M111 M120 M121 M210 M211 M220 M221\nM110 0.41 0.10000 0.10000 -0.04400 -0.04400 0.05000 0.05000 -0.02200 -0.02200\nM111 2.17 0.20580 -0.04400 -0.08370 0.05000 0.10460 -0.02200 -0.04490\nM120 1.95 0.04000 0.04000 -0.02200 -0.02200 0.02000 0.02000\nM121 3.27 0.07145 -0.02200 -0.04490 0.02000 0.04015\nM210 -0.69 0.09000 0.09000 -0.03900 -0.03900\nM211 -0.06 0.20260 -0.03900 -0.08655\nM220 2.30 0.03500 0.03500\nM221 3.81 0.07690\nVariances and Covariances Variances and Covariances\nR1i10 R1i11 R1i20 R1i21 R2i10 R2i11 R2i20 R2i21\nR1i10 0.09905 0.06905 -0.02802 -0.02302 R2i10 0.06383 0.04083 -0.00360 -0.00260\nR1i11 0.09905 -0.02302 -0.02802 R2i11 0.06383 -0.00260 -0.00360\nR1i20 0.12707 0.09207 R2i20 0.06383 0.04083\nR1i21 0.12707 R2i21 0.06383\n4.3 Example: prior beliefs\nAs our approach is based on the quantification of gains in knowledge, it is necessary to express\nour current state of knowledge about the O.G.T.T. Currently, elderly patients are being classified,\nat least in part, on their response to this test, so there already exists an implicit prior judgment\nas to the relevance of the outcome of the test to such patients. Establishing the framework for\nsuch a prior specification is outside the scope of this paper, and so here we give only the necessary\nmoment specifications.\nWithin each group, we suppose that individuals are second-order exchangeable (i.e. second or-\nder beliefs are unaffected by permutation of the members of the group) and co-exchangeable with\nindividuals in the other group (i.e. covariances between individuals are unaffected by permutation\nof members within each group). From the representation theorem for second order exchangeable\nstructures (Goldstein, 1986), we may therefore express the observation at time t for individual\ni in group g for variable v as Ygivt = Mgvt + Rgivt where Mgvt may be considered to be the\nunderlying population mean at time t in group g and Rgivt, termed the individual variation, rep-\nresents the deviation, from that expectation, of individual i. Individual variation of one individual\nis uncorrelated with that of another individual in any group and with any underlying mean. Thus\nE(Rgivt) = 0, E(MgvtRg′i′v′t′) = 0 for all g, v, i, t, g′, v′, i′, t′ and E(RgivtRg′i′v′t′) = 0 unless\ng = g′ and i = i′. Thus belief specification requires prior expectations, variances and covariances\nfor the collection of meansMgvt and variances and covariances within individuals for the individual\nvariation Rgivt.\nThe values are given in Table 2. Variables 1 and 2 are the logarithms of the C-peptide and\nglucose concentrations respectively. We worked in terms of logarithms to stabilise the variance and\nto make the uncertainties symmetric in the sense that the events that an observation is more than\nx units greater or less than its expectation would be judged to be equally likely.\n4.4 Example: optimal design\nUsing the trade-off parameters specified in section 4.2, the optimal choice is (21, 11, 1, 0). That is,\nwe have 22 subjects in Group 1 and 11 in Group 2 but, for 1 of the patients in Group 1, we only\nanalyse the blood samples for glucose content. The final zero shows that it is not worth subjecting\na Group 2 patient to the trial if we are not going to measure C-peptide.\n11\nWe can examine the sensitivity of this choice to the trade-offs by varying the trade-off param-\neters. For example, holding af = 0.45 fixed but increasing ab to 0.90, corresponding to np = 20,\ngives an optimum at (26,15,3,0), while decreasing ab to 0.74, corresponding to np = 10, gives an\noptimum at (14,7,0,0). Similarly, holding ab = 0.85 constant but varying af , setting af = 1, so\nthat ethical cost is ignored, gives an optimum of (13,11,14,1), while setting af = 0, so that financial\ncost is ignored, gives an optimum of (24,11,0,0).\n4.5 Example: generalisation to binary nodes\nTo illustrate the use of binary nodes we now allow hd in (4) and hc in (5) to be nonzero. In this\nexample we consider Uf , Ue and Ub to be stochastically independent.\nConsider first the ethical-financial trade-off. We might prefer the costs of a design where the\nexpectations of the two scaled cost utilities, afUf and aeUe, are approximately equal to one where\nthey are very different. This would suggest a positive value for hc. With af = 0.45, ae = 0.55,\nhc = 0, we have E(afUf ) = E(aeUe) approximately when n2 = 30 + 0.25n1 among (n1, n2, 0, 0)\ndesigns, for example (8,32,0,0). Also, approximately, E(afUf + aeUe) is a constant when n1 +2n2\nis a constant so that, for example, we would be indifferent in terms of costs between (0,35,0,0),\n(8,31,0,0) and (16,27,0,0). Now consider the effect of varying hc. If we continue to be indifferent in\nterms of cost between (0,35,0,0) and (16,27,0,0) this implies, approximately, that ae = 0.55(1−hc)\nand af = 0.45(1 − hc) but, a preference for the central design, (8,31,0,0), over either of these\nsuggests a positive value for hc. However, in this particular case, even increasing hc to 1.0 is\ninsufficient to make (8,32,0,0), a slightly larger design, preferable to (0,35,0,0) or (16,27,0,0).\nIf we set hc = 1.0 and ae = af = 0.0, we need to adjust ab to 0.875 and ac to 0.125 to preserve\nnp = 15. The optimum design with these parameter values is (19,11,3,0). Similarly by maintaining\nae = 0.55(1− hc) and af = 0.45(1− hc) and setting hc = −0.81818, the smallest value it can take\nunder this condition, we obtain ae = 1.0 and af = 0.81818. This requires adjustment of ab to 0.81\nand ac to 0.19 and this makes the optimum design (22,11,0,0).\nRestoring the financial-ethical trade-off parameters to the values specified in section 4.2, we\nturn our attention to hd. If we set hd = 1, we have no choice over the values of ab and ac. This leads\nto np = 5 which conflicts with the expressed value. In fact we need to reduce hd to approximately\n0.18, while holding ac = 0, to restore np = 15. The overall optimum in this case is (21,11,1,0).\nSimilarly, if we set hd = −1, we must have ab = ac = 1 and this leads to a preference for no\nexperiment at all since this maximises the cost utility. We can restore the preference for np = 15\nby setting hd = −0.91, ab = 1.0 and ac = 0.91. This gives an overall optimum at (28,16,4,0), a\ndesign which clearly compensates for a poor cost utility with a good benefit utility.\nThese explorations show that, while the choice of design seems to be fairly insensitive to the\nvalue of hc, it can be greatly affected by the value chosen for hd.\n5 Using Imprecise Trade-off Parameters\nOne of the most difficult tasks in specifying a mutually utility independent structure is the quan-\ntification of the various trade-off parameters in the forms (1), (2) and (3), as this typically requires\nthe comparison of intrinsically different types of costs and benefits. For example, in medical stud-\nies, many clinicians would be unwilling to place a precise financial cost on the possible health risks\nto patients in a trial. Further, many experiments must satisfy various participants who may make\ndifferent judgments as to such trade-offs. In practice, this means that we can often elicit Ue and\nUf , but not elicit an agreed value for ae, af or hc, in (5). Therefore, it is of fundamental interest\nto consider problems where we are unwilling to fix on particular trade-off values or where a group\nof individuals must make a joint decision, and there is broad agreement on the marginal utilities,\nbut different members of the group have different priorities when trading risks. We now develop\nan appropriate methodology for treating such imprecise utility.\nWe proceed as follows.\n(i) We explain how we may formally introduce imprecision into our utility trade-offs, as follows.\nFor each child node at which attributes are combined, we identify which preferences we are prepared\n12\nto assert between collections of sub-attribute values. From this collection of preferences, we deduce\nthe implied constraints on the trade-off parameters which are used to combine attributes at that\nnode. (In a precise utility specification, we would be prepared to specify preferences between all\nsets of attribute values, which would uniquely determine the trade-off values).\n(ii) We now introduce a weak condition which is often sufficient to eliminate many of the designs\nunder consideration, essentially that we should prefer design A to design B if we prefer A to B\nunder every choice of trade-off parameters consistent with our stated preferences. (Under such\ncircumstances, we would remove design B from further consideration). We then identify a greatly\nreduced subset of possible trade-off choices which is sufficient to check such design preferences,\nessentially the vertices of the region of allowable trade-off parameters identified at stage (i).\n(iii) We now suggest various theoretical arguments for selecting a particular choice of design\namong those retained at stage (ii), which is based on optimising a linear combination of the utilities\ncorresponding to the vertex trade-offs identified as sufficient at stage (ii). We discuss the properties\nof this choice, and illustrate how we may explore the sensitivity of our chosen design to variation\nin our specification.\nIf we allow imprecision in some of the elements of θ, then we refer to the resulting utility spec-\nification as an imprecise independence hierarchy (IIH). This methodology is much more straight-\nforward to describe for simple imprecise independence hierarchies, where all nodes are additive or\nbinary, than for the more general case. If there are no multiplicative nodes in the hierarchy, then\nwe refer to the specification as a simple imprecise independence hierarchy (SIIH). To clarify the\nexposition, we shall first present the theory for the SIIH.\n5.1 Imprecise utility trade-offs\nThe theory of imprecise probability can be built around the notion that, while we may be unwilling\nto specify a precise value for the probability of some particular event, there are various prices at\nwhich we would certainly buy a gamble on the outcome of the event and other prices at which we\nwould certainly sell such a gamble. These preferences may be used to construct upper and lower\nprobabilities for the corresponding event, see e.g. Walley (1991).\nWe may apply a similar approach to develop the theory of imprecise utility and in particular\nto quantify the imprecision in trade-offs between attribute values. Although we are unwilling to\nplace strict values on the trade-offs, there will be certain combinations of outcomes over which\nwe are prepared to state preferences and these comparisons establish the region of the space of\ntrade-off parameters which we must consider. We choose to elicit our imprecision in the values of\nthe trade-off parameters θ based on our stated preferences over utility combinations for outcomes,\nas this is usually more meaningful than considering directly the imprecision in the elements of θ.\nWe proceed as follows.\nFor each child node, we make a collection of pairwise comparisons between vectors of values of\nparent utilities (or, equivalently, the corresponding vectors of attribute values). As we shall vary\nthe trade-off parameters, and thus the utilities at the child nodes, we require a scale for all utilities\nin the IIH, whose interpretation does not depend on the choice of trade-off parameters. Recall\nthat the standard scale that we are using is such that a utility value of u at node i may always be\ninterpreted as the utility of a gamble giving Ci with probability u and ci with probability 1 − u,\nirrespective of the chain of trade-off parameters in the hierarchy.\nAt node i, we denote strict preference for utility vector U = (U1i, U2i, ..., Usi) over utility vector\nV = (V1i, V2i, ..., Vsi) as U \u001f∗ V , and denote the weak preference, namely that we do not prefer\nV to U as U \u0017∗ V . Each such preference places constraints on the allowable choices for the\ntrade-off parameters φi. We term the collection, R, of all sets of trade-off parameters consistent\nwith each of the stated preferences the feasible set of choices for the trade-off parameters. We say\nthat the collection of pairwise comparisons is consistent if R is non-empty, i.e. there is at least\none set of trade-off parameters satisfying all stated preferences. A comparison is redundant if its\nremoval does not affect R. A change in any marginal utility will produce a change of the same\nsign in the overall utility. Therefore, when comparing two utility vectors where A \u001f∗ B, we may\nconsider whether we can decrease any of the utilities in A or increase any of the utilities in B while\n13\npreserving the preference. In this way, we should avoid redundancy and make stringent comparisons\nleading to the smallest feasible set that we can determine through our stated preferences. We\ndescribe a comparison as sharp if (U11, . . . , Us1) \u0017∗ (U12, . . . , Us2) but there is no vector (δ1, . . . , δs)\nsuch that δi ≥ 0, for i = 1, . . . , s, and\n∑s\ni=1 δi > 0 for which we are prepared to assert that\n(U11 − δ1, . . . , Us1 − δs) \u0017∗ (U12, . . . , Us2). In general, we seek sharp comparisons to restrict R as\nfar as possible.\nWe have described our formulation from the viewpoint of an individual who does not wish to\nstate precise utility trade-offs. The same formulation describes a group of decision makers who\nagree on the marginal utilities but disagree on the utility trade-offs, where now each preference\nbetween pairs of utility vectors denotes the sharpest comparison which is agreed by all members\nof the group.\nFor additive and binary child nodes, elicitation is unconstrained. For each such node, we state\nwhichever preferences we wish between pairs of utility vectors for the parent nodes. However, if we\nallow such unconstrained comparisons at the multiplicative child nodes, then the analysis that we\nshall develop becomes more complex. Therefore, we shall leave discussion of such nodes to section\n8. We now describe the implications of the above elicitation.\nTheorem 1 The shape of the region of trade-off parameters resulting from the above elicitation\nscheme for an SIIH is as follows. At each additive or binary node i, we obtain a convex polyhedron\nRi for the allowable values of φi. The regions R1, . . . , Rn together define a region R in the combined\nspace of parameters θ, where θ ∈ R if and only if φi ∈ Ri for i = 1, . . . , n.\nProof Consider first a single child node. We treat the two types of node in turn.\n(i) Suppose node i is additive. From the definition, the parameters a2, . . . , as lie within a convex\npolyhedron bounded by a2 = 0, . . . , as = 0 and\n∑s\ni=2 ai = 1. Suppose that, for a particular pair\nof vectors of parent utilities (U11, . . . , Us1) \u0017∗ (U12, . . . , Us2). This preference imposes the linear\ninequality a1(U11 − U12) + a2(U21 − U22) + · · · + as(Us1 − Us2) ≥ 0 on the values of a2, . . . , as\n(where a1 ≡ 1 −\n∑s\ni=2 ai), which is of the form b1 +\n∑s\ni=2 biai ≥ 0. If a1 = (a12, . . . , a1s)′ and\na2 = (a22, . . . , a2s)′ both satisfy this inequality, then so does λa1 + (1− λ)a2. Thus the region Ri\nis convex and the boundary is made up of a finite number of intersecting planes.\n(ii) Suppose node i is binary. If (U11, U21) \u0017∗ (U12, U22) then (1−a2−h)(U11−U12)+a2(U21−\nU22)+h(U11U21−U12U22) > 0. Therefore, binary nodes are the same as additive nodes except that\nthe parameters are a2, h and the boundaries given by the definition are a2 = 0, a2 = 1, h = −a2\nand h = 1− a2.\nAs all preferences are based on the marginal utilities using the standard scale, the ranges of\nparameters at one node are independent of the values at other nodes and so the whole feasible set\nis as described. 2\n5.2 Example: trade-off imprecision\nWe now illustrate the construction of a feasible set. For example, in the hierarchy in the OGTT\nexample, shown in figure 1, trade-off imprecision at node B is determined by eliciting pairwise\npreferences between values of the vector {U1(L1), . . . , U4(L4)}, while at node C ranges are deter-\nmined by preferences between vectors (E,F ). In every case, preferences are expressed between\nlotteries over the corresponding marginal attributes. For example, at node C, we express prefer-\nences between pairs of utility vectors (E∗, F ∗) and (E∗∗, F ∗∗). All utilities are expressed in the\nstandard scale.\nSuppose that, at nodeB, for the vector {U1(L1), . . . , U4(L4)}, (0.6, 0.9, 0.7, 0.7) \u001f∗ (0.7, 0.7, 0.7, 0.7).\nThis leads to 0.7b1+0.7(1−b1−b3−b4)+0.7b3+0.7b4 < 0.6b1+0.9(1−b1−b3−b4)+0.7b3+0.7b4\nand thence to 1.5b1 + b3 + b4 < 1. Further, increasing the value of any of the utilities in the\nsecond vector leads to uncertainty over the preference so that, for example, it is not agreed\nwhether (0.6, 0.9, 0.7, 0.7) should be preferred to (0.71, 0.7, 0.7, 0.7). Therefore the comparison is\nsharp and we adopt 1.5b1 + b3 + b4 < 1 as part of the boundary of our parameter region. Simi-\nlarly, (0.81, 0.7, 0.7, 0.7) \u001f∗ (0.6, 0.74, 0.74, 0.74) but we are unwilling to state preferences between\n(0.8, 0.7, 0.7, 0.7) and (0.6, 0.74, 0.74, 0.74). The definite preference here leads to b1 > 0.16.\n14\nTable 3: Trade-off parameter ranges.\nNode B Node C Node D\nVertex a1 a2 a3 a4 ae af hc ab ac hd\n1 0.24 0.12 0.32 0.32 0.577 0.823 -0.400 0.82 0.16 0.02\n2 0.16 0.20 0.32 0.32 0.225 0.375 0.400 0.82 0.27 -0.09\n3 0.16 0.08 0.44 0.32 0.871 0.529 -0.400 0.90 0.27 -0.17\n4 0.16 0.08 0.32 0.44 0.526 0.074 0.400 0.90 0.16 -0.06\nAlso (0.7, 0.7, 0.77, 0.7) \u001f∗ (0.78, 0.78, 0.6, 0.78) and (0.7, 0.7, 0.7, 0.77) \u001f∗ (0.78, 0.78, 0.78, 0.6)\nbut we do not state a preference between (0.7,0.7,0.76,0.7) and (0.78,0.78,0.6,0.78) or between\n(0.7,0.7,0.7,0.76) and (0.78,0.78, 0.78,0.6). Here, the definite preferences lead to b3 > 0.32 and\nb4 > 0.32. These four inequalities define a feasible region. We could impose more constraints but\nthe region would always be the convex hull of a finite number of vertex points. In the absence of\nsuitable information on definite preferences, the absolute limits would apply. For example, if the\nfirst inequality above was not given, then b1 + b3 + b4 < 1 would be the fourth face of the region.\nNode C is a binary node. Suppose that, for the vector (Ue, Uf ), (0.5, 0.5) \u001f∗ (0.65, 0.4) and\nthat this comparison is sharp, leading to 0.5ae+0.5af +0.5×0.5hc ≥ 0.65ae+0.4af +0.65×0.4hc\nwhich gives −0.15ae + 0.1af − 0.01(1 − ae − af ) ≥ 0 and hence af ≤ 0.09 + 1.27ae. Similarly\n(0.6, 0.27) \u001f∗ (0.5, 0.5) and this leads to af ≥ −0.62 + 1.32ae. To obtain two more inequalities it\nis helpful to introduce lotteries. Suppose that we offer a choice between the following alternatives:\n(1) with certainty attribute values such that Ue = Uf = 0.5; (2) with probability α, attribute\nvalues such that Ue = Uf = 1, that is zero cost, and, with probability 1− α, attribute values such\nthat Ue = Uf = 0. Suppose that (2) is preferred whenever α ≥ 0.6, leading to 0.5ae + 0.5af +\n0.25(1 − ae − af ) ≤ 0.6 and hence af ≤ 1.4 − ae, and that (1) is preferred whenever α ≤ 0.4,\nleading to af ≥ 0.6 − ae. These latter two constraints are equivalent to −0.4 ≤ hc ≤ 0.4. These\nfour constraints give the four sides of a quadrilateral region in the plane of ae and af .\nConsider the non-marginal node D. Suppose that we offer a choice between the following al-\nternatives: (1) with certainty, attribute values such that Ub = 0 and Uc = 1, equivalent to the\nexpectations when no experiment is conducted; (2) with probability α, attribute values such that\nUb = Uc = 1, that is complete information at no cost, and, with probability 1 − α, attribute\nvalues such that Ub = Uc = 0, that is a costly experiment which provides no information. Sup-\npose that (1) is preferred whenever α < 0.16 and that (2) is preferred whenever α > 0.27. Then\n0.16 ≤ ac ≤ 0.27. Similarly, if, when offered the alternatives: (1) with certainty attribute values\nsuch that Ub = 1 and Uc = 0, that is a costly experiment which provides full information; (2) with\nprobability α, attribute values such that Ub = Uc = 1 and, with probability 1−α, attribute values\nsuch that Ub = Uc = 0; (1) is preferred whenever α < 0.82 and (2) is preferred whenever α > 0.90,\nthen 0.82 ≤ ab ≤ 0.90. Thus we obtain a rectangular region in the plane of ab and ac. However, in\ngeneral, the region need not be rectangular and boundaries not parallel to the ab and ac axes can\nbe obtained by varying the utility values offered in the lotteries.\nTable 3 gives the vertex set Pi for the feasible region Ri, at each node i.\n6 Pareto optimality\n6.1 Pareto optimal decisions\nWe have to choose from a set D of designs. The utility of any choice of design A ∈ D depends\non the values of the trade-off parameters that we specify. As we are comparing different choices\nof trade-offs, we denote the utility of A, using trade-off parameters θ, evaluated as described in\nsection 3, as UAθ.\nDifferent choices of trade-off parameters induce different preference orderings over the possible\nalternatives. A natural weak, partial preference ordering over allowable alternatives is that alter-\n15\nnative A is at least as good as B, over feasible region R, written A \u0017 B, if UAθ ≥ UBθ, ∀θ ∈ R,\nA is preferred to B, over R written A \u001f B, if A \u0017 B and UAθ > UBθ for some θ ∈ R, and A is\nequivalent to B, written A ' B, if UAθ = UBθ ∀θ ∈ R. Alternative A is Pareto optimal for R if\nthere is no other allowable alternative B for which B \u001f A over R. It seems reasonable to restrict\nattention to Pareto optimal alternatives. Furthermore, if we form equivalence classes of equivalent\ndecisions A1 ' A2 ' ... ' Ar, then it is reasonable to restrict attention to only one representative\nmember of each equivalence class. When we eventually choose a design, we may re-examine the\ncollection of alternatives in the corresponding equivalence class by any subsidiary criteria, which\nhave not yet been introduced into the problem. In this section, we discuss the identification of the\nPareto optimal class. In later sections we suggest criteria for choosing between the Pareto optimal\ndesigns.\nWe now develop an equivalent form for the Pareto optimal designs which is much easier to\ncompute. We first consider the difference between the expected utilities of a general pair of alter-\nnatives A,B as a function of the trade-off parameters θ, namely dAB(θ) = UAθ − UBθ. We have\nthe following lemmas.\nLemma 1 In a SIIH utility, the utility Uj at any non-marginal node j is of the form\nUj(θj) =\n∑\nl\n{\npilj(θj)U?lj\n}\n(11)\nwhere pilj(θj) is a product of parameters with not more than one from each node and U?lj is a\nproduct of marginal utilities (possibly just one).\nProof. Clearly (11) is true for a marginal node.\nSuppose (11) is true for the utilities at each of the parent nodes of a node i. Then, whether i\nis additive or binary, it is clearly also true at i. Hence, by induction, (11) holds for any node. 2\nFor each node i, we define Pi to be the set φi = {φi1, . . . , φir(i)} of values at the r(i) > m(i)\nvertices of Ri, and denote by P the set of overall vertex specifications for R, so that P is the subset\nof R with elements θ = (φ1, . . . ,φn) ∈ R such that φi ∈ Pi for i = 1, . . . , n.\nLemma 2 If we have a SIIH utility, then, for any alternatives A,B, the minimum and maximum\nvalues of dAB(θ) in R are taken at points in P.\nProof. From Lemma 1 it follows that dAB(θ) =\n∑\nl[pil(θ){EA(U?l )−EB(U?l )}], where EA and\nEB denote expectations under designs A,B respectively.\nConsider node i, with parameters at all other nodes fixed. We see that dAB(θ) is a linear\nfunction of the parameters at node i. It therefore follows that it is maximised with respect to those\nparameters at a vertex of Ri.\nWe can now fix φi1, . . . , φim(i) at this point in Pi and vary the parameters of another node i′.\nBy applying the same argument we can see that we can move these parameters to a point in Pi′\nwithout increasing dAB(θ). This argument can then be applied to the parameters at each node in\nturn leading to the conclusion that for any point in R there is a point in P at which the value of\ndAB(θ) is no greater.\nSimilarly, for any point in R there is a point in P at which the value of dAB(θ) is no less. 2\nWe now deduce that it is sufficient to check for Pareto designs in the vertex set P .\nTheorem 2 For a SIIH utility, Pareto optimal alternatives for R are the same as Pareto optimal\nalternatives for P.\nProof If dAB ≥ 0 over P it follows from Lemma 2 that dAB ≥ 0 over R. The converse is\nobvious since P ⊆ R. It follows immediately that A \u0017 B over R if and only if A \u0017 B over P. If\nA \u001f B over P then dAB ≥ 0 over P and dAB > 0 at some point in P so, since P ⊆ R, it also\nfollows that A \u001f B over R. The converse follows since the maximum of dAB in R must be in P.2\n16\nTable 4: Maxima and minima of n12, n22, n11, n21 among designs optimal at the vertices of R.\nn12 n22 n11 n21\nMinimum 13 8 0 0\nMaximum 29 15 12 0\n6.2 Example: Pareto optimal designs\nFor each of the sixty four vertices of R, we found the design which maximised the overall utility at\nthis vertex. There is a wide variety among these vertex-optimal designs. Table 4 gives the maxima\nand minima of n12, n22, n11, n21 among them.\nWe searched for Pareto optimal designs among all designs where 11 ≤ n12 ≤ 30, 5 ≤ n22 ≤ 24,\n0 ≤ n11 ≤ 19 and 0 ≤ n21 ≤ 4. This set of 40000 candidate designs contains every design optimal\nat a vertex of R with some room to spare. Among these we found 433 Pareto optimal designs.\nThe search can be conducted quickly since we know, from Theorem 2, that it is only necessary to\ncompare candidate designs at the vertices of R.\nThere are various ways by which we can, in practice, further reduce the size of the Pareto\noptimal set, by eliminating designs which are “almost dominated” everywhere over the feasible\nregion. For reasons of space, we shall address such reductions elsewhere, and instead, we now\nconsider further criteria for selecting designs within the Pareto optimal collection.\n7 Boundary linear utility\n7.1 Definitions and motivation\nThe feasible region for the trade-off parameters in a SIIH is the convex hull of a finite collection of\ntrade-off parameters θi ∈ P, i = 1, . . . , s. Let Ui be the utility function determined by the choice\nof trade-offs θi ∈ P, i = 1, . . . , s. Any function of the form\nU¯λ =\ns∑\ni=1\nλiUi (12)\nwhere λ = (λ1, . . . , λs) are non-negative constants such that\n∑s\ni=1 λi = 1 is termed a boundary\nlinear utility . For any such U¯λ, we may identify the rule which maximises U¯A,λ =\n∑s\ni=1 λiUA,i,\nwhere UA,i is the utility of alternative A with trade-off θi.\nThe boundary linear form is motivated by various theoretical considerations as follows. Suppose\nthat, to solve the design problem, we intend to construct a single overall utility function U¯ . We\nhave shown that Pareto optimality over the full feasible region of trade-off parameters is completely\ndetermined by optimality over the vertex set P . Suppose that we therefore insist that U¯ is to be a\nfunction only of the corresponding boundary utilities U1, . . . , Us. Each of the following arguments\nsuggests the boundary linear form.\n1. If U¯ is to agree with the weak preference ordering, i.e. U¯(A) > U¯(B), U¯(A) ≥ U¯(B), when\nA \u001f B, A \u0017 B, over P , respectively, then Harsanyi’s theorem (Harsanyi, 1955) implies that\nU¯ must be of the form (12), for some λ. A further condition that U¯ must be unaffected by\na permutation of the utilities at the points in P would imply that λi = 1 for all i (see e.g.\nResnik, 1987).\n2. Suppose that we regard, for each alternative, the values of the boundary utilities U1, . . . , Us\nas attributes of the alternative; for example, the various boundary values of the trade-off\nparameters might be identified as corresponding to the different views of members of some\ncommittee which must be synthesised by the decision maker. Theorem 10.6 of Keeney and\nRaiffa (1976) shows that the following assumptions hold if and only if U¯ is of the form (12):\n17\n(a) the attributes {Ui, Uj} are preferentially independent of their complement U˜ij for all\ni 6= j, that is, the conditional preference structure over Ui, Uj does not depend on the\nother utilities;\n(b) the conditional utility function u?i over the attribute Ui, in the combined utility, is\nstrategically equivalent to Ui, that is, u?i and Ui imply the same preferences over lotteries;\n(c) each attribute Ui is utility independent of the others;\n(d) if there is agreement over parameter values, that is the ranges for parameters shrink to\na point, then the combined utility should be the same as each of the individual utilities;\n3. If we regard the boundary utilities , U1, . . . , Us, as being the utilities of members of a\ngroup then Theorem 2 of Keeney (1976) shows that the following assumptions (adapted\nfrom Keeney) hold if and only if U¯ is of the form (12) :\n(a) s ≥ 2, the number of alternatives is at least two and overall utilities are specified for all\npossible U1, . . . , Us.\n(b) If the overall utilities indicate alternative A is preferred to alternative B for a certain\nset of values of U1, . . . , Us, then the overall utilities must imply that A is preferred to\nB if:\ni. the values of U1, . . . , Us are not changed for alternatives other than A and\nii. the values of U1, . . . , Us under A either remain unchanged or are increased.\n(c) If an alternative is eliminated from consideration, the new overall utilities for the re-\nmaining alternatives should be equivalent to the original overall utilities for these same\nalternatives.\n(d) For each pair of alternatives, A and B, there is some set of values U1, . . . , Us such that,\noverall, A is preferred to B.\n(e) There is no member of P such that whenever A is preferred to B at that point, A is\npreferred to B overall regardless of the utilities at other members of P.\nIn addition to such theoretical support, the boundary linear form is easy to interpret, gives a\nclear comparison between different choices and leads to tractable procedures even for large numbers\nof alternative decisions. The choice of the λ weights can be used to emphasise or de-emphasise the\nimportance of a particular attribute by putting more or less weight on vertices corresponding to\ndifferent values for a particular trade-off.\n7.2 Properties of the boundary linear utility\nFrom Theorem 2 we may deduce the natural relation between Pareto optimality and Bayes rules\nfor boundary linear utilities as follows.\nCorollary 1 A decision in D which is either (i) a unique Bayes decision for some U¯λ, or (ii) a\nBayes decision for some U¯λ, with λi > 0 for i = 1, . . . , s, is Pareto optimal over R.\nProof For any pair of decisions A,B, we have U¯Aλ − U¯Bλ =\n∑s\ni=1 λidAB(θi). If A is the\nunique Bayes decision for U¯λ then, for some i, dAB(θi) > 0. Alternately, if A is Bayes for U¯λ, with\neach λi > 0 then, for any other decision B, either dAB(θi) = 0 for all i, and hence, by lemma 2,\ndAB(θ) = 0 everywhere in R, or dAB(θi) > 0 for at least one i. Hence A is Pareto optimal over R.\n2\nIt is often helpful to equate the boundary linear form with the utility at interior trade-off\nvalues. Suppose that at node i we assign weights λi1, . . . , λir(i) to φi1, . . . ,φir(i), for i = 1, . . . , n,\nand that the weight λ assigned to any overall parameter specification θ obtained by combining\nspecifications from the n nodes, is given by the product of the corresponding weights. That is,\nif θ is the combination of φ˜1, . . . , φ˜n, which were assigned weights λ˜1, . . . , λ˜n, at nodes 1, . . . , n,\nthen λ =\n∏n\ni=1 λ˜i. Such a weight specification is called a multiplicative weighting. For such a\n18\nTable 5: “Best” and “worst” Pareto optimal designs, equal vertex weights.\nRank Design U¯λ Rank Design U¯λ\n1 21 11 1 0 0.883155 11 19 11 4 0 0.883063\n2 20 11 2 0 0.883146 12 22 11 1 0 0.883062\n3 21 11 0 0 0.883138 426 26 15 5 0 0.878881\n4 20 11 1 0 0.883137 427 23 15 9 0 0.878868\n5 19 11 3 0 0.883129 428 14 8 2 0 0.878720\n6 20 11 3 0 0.883115 429 13 8 4 0 0.878667\n7 22 11 0 0 0.883114 430 15 8 0 0 0.878547\n8 19 11 2 0 0.883114 431 13 8 3 0 0.878268\n9 21 11 2 0 0.883103 432 14 8 1 0 0.878210\n10 20 11 0 0 0.883073 433 13 8 2 0 0.877745\nspecification, we may vary the weights at each node separately. It follows directly from the fact\nthat Ri is a convex polyhedron that, for any θ in R, there exists a multiplicative weighting λ such\nthat θ = θ¯λ and, for any multiplicative weighting λ, there exists a θ in R such that θ = θ¯λ, where\nθ¯λ =\n∑\nj λjθj and the sum is taken over all of the vertices of R. We now give a theorem which\nestablishes a correspondence between the elements of R and the multiplicative boundary linear\nutilities.\nTheorem 3 In a SIIH, if λ is a multiplicative weighting then U¯λ = U(θ¯λ).\nProof. Consider a particular term pil(θ)U?l in (11). Suppose pil(θ) = φ1 · · ·φM . In U¯λ the\ncoefficient of U?l is\n∑\nj λjφ1k(1j) · · ·φMk(Mj) where k(ij) denotes which value of φi is selected at\nvertex j. Since λ is multiplicative, we can write λj = λ1k(1j) · · ·λMk(Mj). Hence the coefficient of U?l\ncan be written\n∏\nm (\n∑\nk λmkφmk) but, since\n∑\nλnk = 1, we can write λmk = λmk\n∏\nn 6=m (\n∑\nk λnk)\nand the coefficient is\n∏\nm\n(∑\nj λjφmk(mj)\n)\n, which is its value in U(θ¯λ). 2\nWe know, from Theorem 3, that, for any θ in R, we can find λ1, . . . , λs such that U(θ) =∑\ni λiUi. Values of θ not on the boundary of R will give λ values satisfying the condition for\nCorollary 1. Rules which are Bayes for such internal θ values will therefore be Pareto optimal over\nR.\n7.3 Example: boundary linear design choices\nPlacing equal weights on all vertices gives (21,11,1,0) as the optimum design, as in Section 4.4.\nTable 5 shows the first twelve and last eight designs when ranked in decreasing order of U(θ¯λ)\nwith equal weights on the vertices. Since this is a multiplicative weighting, Theorem 3 shows that\nU(θ¯λ) = U¯λ. There is a relatively large drop in U¯λ after the first nine designs. The differences\nin utility among the first few are small. For example, an increase in Uf of 4.52 × 10−4, that is a\ndecrease in financial cost of 0.0452 % of fmax, would bring the value of U¯λ for the tenth ranked\ndesign up to that of the ninth ranked design.\nOnly two of the “best nine” designs are also optimal at vertices of R, the third and seventh\nranked.\nTable 6 shows the maxima and minima obtained by evaluating the utility of each of the “best\nnine” at each vertex, subtracting it from the best utility attainable at that vertex, then multiplying\nby 103.We can make comparisons such as this because all utilities are always on the standard scale.\nWe see that the difference for none of these designs is ever worse than 6 × 10−3 anywhere in the\nfeasible region so there is little difference in performance between these designs. The third and\nseventh ranked designs, being optimal at vertices, give the best minima in Table 6. The best\nmaximum in the table belongs to the fourth ranked design and the second best belongs to the\nthird ranked design. The third ranked design is thus better than the first in terms of both maxima\nand minima. It will be noted that it is a very similar design.\n19\nTable 6: Comparison of “best nine” designs with optima at vertices. The figures shown are the\nmaxima and minima obtained by evaluating the utility of each of the first nine designs, ranked\nby U(θ¯λ) (equal weights), at each vertex, subtracting it from the best utility attainable at that\nvertex, then multiplying by 103.\nDesign rank 1 2 3 4 5 6 7 8 9\nMinimum 0.041 0.134 0.000 0.095 0.066 0.140 0.000 0.079 0.116\nMaximum 5.320 5.012 4.907 4.874 4.990 5.546 5.674 4.922 5.783\nThis analysis suggests that our design is locally robust, i.e. that there is no design of very\ndifferent form to our suggested choice which is almost as good according to our suggested criterion.\nFor reasons of space, we stop our investigation at this point. Elsewhere, we will describe how the\nstructure allows us a much fuller investigation of the sensitivity and robustness properties of our\nchosen decision, based on optimisation under different choices of boundary linear utility.\n8 Methodology for multiplicative nodes\nWe now describe how the methodology is modified for a general IIH, in which there are imprecise\nmultiplicative nodes. In order to extend the types of analyses that we have described to a general\nIIH, we impose the following restrictions on the preferences that we elicit at a multiplicative child\nnode. First, at each such node, we choose one of the parent utilities to be a standard or reference\nutility. Suppose that this is U1. We set a1 ≡ 1.We then assess trade-off ranges for each of the other\nattributes at the node by comparing that attribute with the standard. Thus, in each comparison,\nwe vary only one of the utilities at a time, so that we compare each attribute j with attribute 1.\nDenote by U+j (u) the vector (U1, . . . , Us) for which Uj = u and Ui = 0, j 6= i. For each j > 1, we\nmake at least one comparison of the form U+1 (u1) \u0017∗ U+j (uj), and optionally, several comparisons\nof the form U+j (uj) \u0017∗ U+1 (u1). Secondly, we elicit pairwise preferences between utility vectors of\nthe form U+1 (u) and vectors (U12, . . . , Us2), where only U1 = U12 and Uj = Uj2 are positive. The\nresulting feasible set generalises theorem 1 as follows.\nTheorem 4 The shape of the region of trade-off parameters resulting from the above elicitation\nscheme for an IIH is as follows. At each additive or binary node i, the shape is as given in theorem\n1. For each multiplicative node i, for each fixed value of k, we obtain a bounded rectangular region\nRi(k) for the remaining elements of φi. The region Ri of allowable specifications for φi is the\nunion of the collections {k,Ri(k)}. For each fixed value of the remaining elements of φi, we obtain\nan interval for the value of k. The regions R1, . . . , Rn together define a region R in the combined\nspace of parameters θ, where θ ∈ R if and only if φi ∈ Ri for i = 1, . . . , n.\nProof All that we need to show is the form of the region for multiplicative nodes. Suppose node\ni is multiplicative. Each preference of form U+1 (u1) \u0017∗ U+j (uj), implies u1 ≥ ajuj , so that u1\/uj ≥\naj . Now suppose, for example, that the utility vector U+1 (U11) is preferred to that vector where\nall utilities are zero except U1 = U12 and Uj = Uj2. This leads to U11 > U12 + ajUj2 + kajU12Uj2\nand then to k < (U11 − U12 − ajUj2)\/(ajU12Uj2). Thus, the form for Ri is as stated. 2\nNote that while the feasible region for each additive and binary node is a convex polyhedron,\nthe shape of the feasible region for a multiplicative node i is more complex. Therefore, we often\nchoose to expand such a region to a more convenient shape R?. For additive and binary nodes\nwe define R?i ≡ Ri. For multiplicative nodes we define R?i as follows. Firstly, we identify the\nmaximum and minimum values of k, denoted kM , km, in the set Ri. For each trade-off parameter\naj , we define ajM , ajm to be the maximum and the minimum values of aj respectively over the\ntwo sets Ri(kM ), Ri(km). Denote by R?i , the rectangular region bounded by the values km < k <\nkM , ajm < aj < ajM , j = 2, .... Then R?i is the smallest rectangular region for which Ri ⊆ R?i .\nWhen we replace each such Ri by R?i , we denote the corresponding extended feasible region as\n20\nR?. For each additive or binary node define P ?i to be the set {φi1, . . . ,φir(i)} of the r(i) > m(i)\nvertices of R?i . For each multiplicative node with s parents define P\n?\ni to be the set of φi such\nthat aj = ajm or aj = ajM , for j = 2, . . . , s, and km < k < kM . Then P ? is the set of overall\nspecifications each element of which is the combination of one element from each of P ?1 , , . . . , P\n?\nn .\nWe may now generalise theorem 2 as follows. The details of the proof are in the appendix.\nTheorem 5 For a general IIH utility, Pareto optimal alternatives for R? are the same as Pareto\noptimal alternatives for P ?.\nThe further modification we must make is to the boundary linear forms. If there are some\nmultiplicative nodes with imprecise values for the parameter k in (2), the corresponding boundary\nis continuous over k. The natural generalisation of the boundary linear form to a continuous weight\nfunction is as follows. Let the imprecise k parameters be k = (k1, . . . , kw)′. Now let θi denote a\nvertex specification of the other parameters so that each element of P is a particular θi combined\nwith a value for k and replace λi with λi(k), a scaled probability density function for k so that\ns∑\ni=1\n∫\n· · ·\n∫\nλi(k).dk1 . . . dkw = 1,\nwhere the integrals are taken over the ranges of k1, . . . , kw. Then\nU¯λ =\ns∑\ni=1\n∫\n· · ·\n∫\nλi(k)Ui.dk1 . . . dkw.\nWe may also allow λi(k) to be wholly or partly discrete with some or all of the weight concentrated\nat discrete values of some or all of k1, . . . , kw. In this case, integrals are replaced by summations\nas appropriate. We may generalise theorem 3 as follows. The proof is given in the appendix.\nTheorem 6 In any IIH, for any θ in R there exists a multiplicative weighting λ such that U(θ) =\nU¯λ.\n9 Concluding comments\nThis paper has two aims. Firstly, we show how mutually utility independent hierarchies, which\nweigh the various costs of the experiment against benefits expressed through a mixed Bayes linear\nutility, provide a flexible and intuitive methodology for experimental design which remains tractable\neven for complex multi-variate problems. Secondly, we develop methodology for problems in which\nthe experimenters are unwilling to specify unique trade-off values between the attributes in the\nhierarchy. Partly, we do this as we consider that precise specification of such trade-offs is likely to\nbe one of the main stumbling points in implementing our approach. Partly also, we consider that\nproblems in imprecise utility are of fundamental interest in their own right, in much the same way\nas are problems in imprecise probability.\nThis paper is intended to offer a framework for experimental design which respects the com-\nplexities of the cost and benefit structure. The imprecise utility formulation is intended to identify\nclasses of designs which are worthy of further consideration and to suggest criteria for selecting\nbetween these designs. This raises important methodological questions concerning the best ways\nto identify and choose between the leading contenders for the best choice of design, and these\nquestions will be pursued elsewhere.\nAPPENDIX: PROOFS OF THEOREMS\nProof of Theorem 5\nFirst we need to modify Lemma 1. We now show that\n21\nU(θ) =\n∑\nl\n{pi?l (θ)U?l } , (13)\nwhere pi?l (θ) = pi\n?\nl1(θ)\/pi\n?\nl2(θ).\nHere pi?l1(θ) is a product of parameters with not more than one from each additive or binary\nnode and any parameters, other than k, from a multiplicative node which are present are present\nlinearly and pi?l2(θ) is either a product of terms of the form\n∏s\ni=1(1 + kai)− 1 from multiplicative\nnodes or is 1.\nClearly (13) holds for a marginal node.\nSuppose (13) holds for the utilities at each of the parent nodes of a node i. Then, if i is additive\nor binary, it clearly also holds at i. If i is multiplicative then we observe that the numerator in (3)\ncan be written as a sum of terms, each of which is of the form km\n∏\na\np(j)\nj U\np(j)\nj where p(j) is either\n0 or 1 and Uj is a parent utility. It follows that (13) holds for node i. Hence, by induction, (13)\nholds for the overall utility.\nNow we can write dAB(θ) =\n∑\nl[pi\n?\nl (θ){EA(U?l )− EB(U?l )}].\nConsider a single parameter aij at a multiplicative node i. We can write dAB(θ) in the form\nf(aij) = [C1 + C2aij ]\/[C3 + C4aij ] + C5, where C1, . . . , C5 are constants. As ∂f(aij)\/∂aij =\n(C2C3−C1C4)\/(C3−C4aij)2, it follows that f(aij) is monotonic in aij , over any domain in which\n|f(aij)| is bounded away from infinity. So dAB(θ) is monotonic in any single aij . If we minimise\ndAB(θ) with respect to any single aij we will always reach one of the limits for aij . Hence the\nminimum of dAB(θ) for any fixed ki must be at a vertex of the subset of R?i , for this value of ki,\nwhere R?i for a multiplicative node is the rectangular region bounded by the upper and lower limits\nof ai2, . . . , ais(i). Now, if we allow ki to vary, we see that the global minimum of dAB(θ) must be\nat a point in P ?i .\nThe rest of the proof follows as before.\nProof of Theorem 6\nSuppose that multiplicative weightings can be found for each of the parent nodes of node i such\nthat U(θj) = U¯λj , where the subscript j denotes that this applies to the sub-hierarchy under node\nj. Trivially we can find such a weighting for a marginal node. If node i is additive or binary it is\nclear from Theorem 3 that we can find a multiplicative weighting such that U(θi) = U¯λi.\nSuppose node i is multiplicative. Our definition allows us to concentrate all of the weight at the\nchosen value of ki so we can now consider ki to be fixed. Suppose that we assign weights λ?ij and\n(1−λ?ij) to the lower and upper values of ai2, . . . , air(i), where ai1 = 1−\n∑r(i)\nj=2 aij , and then obtain\nweights for the vertices of Ri by multiplying together the appropriate combinations of these. In\nthis way we can consider averaging over each of ai2, . . . , air(i) in turn. The averaging property will\nnow apply, with respect to ai2, . . . , air(i), to the unscaled utility\nU?i = k\n−1\ni\nr(i)∏\nj=1\n(1 + kiaijUij)\n− 1 = k−1i (1 + kiaijUij)\n∏\nf 6=j\n(1 + kiaifUif )\n− 1\nwhere Ui = U?i \/Fi and\nFi = k−1i\nr(i)∏\nj=1\n(1 + kiaij)\n− 1 = k−1i (1 + kiaij)\n∏\nf 6=j\n(1 + kiaifUif )\n− 1\nbut does not apply exactly to the scaled utility Ui because F−1i is not linear in aij .\nNow write Ui(aij) and Fi(aij) to show dependence on aij and let the lower and upper values\nof aij be aij1, aij2 (such that aij1 < aij2). Choose any other value aij3 with aij1 ≤ aij3 ≤ aij2. We\ncan write aij3 = µijaij1 + (1− µij)aij2 for some µij with 0 ≤ µij ≤ 1. Clearly\n22\nUi(aij3) = [U?i (µijaij1 + {1− µij}aij2)]\/[Fi(µijaij1 + {1− µij}aij2)]\n= [µijU?i (aij1) + {1− µij}U?i (aij2)]\/[µijFi(aij1) + {1− µij}Fi(aij2)]\nbut\nλ?ijUi(aij1) + (1− λ?ij)Ui(aij2) = λ?ij [U?i (aij1)]\/[Fi(aij1)] + (1− λ?ij)[U?i (aij2)]\/[Fi(aij2)].\nWe require\n[µij ]\/[µijFi(aij1) + (1− µij)Fi(aij2)] = [λ?ij ]\/[Fi(aij1)]\nand\n[(1− µij)]\/[µijFi(aij1) + (1− µij)Fi(aij2)] = [(1− λ?ij)]\/[Fi(aij2)]\nand these are satisfied when\nλ?ij = [µijFi(aij1)]\/[µijFi(aij1) + (1− µij)Fi(aij2)]\nwhich is in 0 ≤ λ?ij ≤ 1.\nWe can now extend the argument to the other parameters at node i.\nThus we can find a multiplicative weighting such that U(θi) = U¯λi and, by induction, we can\nfind a multiplicative weighting such that U(θ) = U¯λ.\n2\nReferences\nAdcock, C.J., 1997. Sample size determination: a review. The Statisticican, 46, 261-283.\nBernardo, J.M., 1997. Statistical inference as a decision problem: the choice of sample size. The\nStatisticican, 46, 151-153.\nChaloner, K., and Verdinelli, I., 1995. Bayesian experimental design, a review. Statistical Science\n10, 273-304.\nClaxton, K., Lacey, L.F., and Walker, S.G., 2000. Selecting treatments: a decision theoretic ap-\nproach. Journal of the Royal Statistical Society, Ser. A, 163, 211-225.\nClyde, M. and Chaloner, K., 1996. The equivalence of constrained and weighted designs in multiple\nobjective design problems. Journal of the American Statistical Association, 91, 1236-1244.\nDette, H. and Franke, T., 2000. ConstrainedD− andD1−optimal designs for polynomial regression.\nThe Annals of Statistics, 28, 1702-1727.\nFarrow, M. and Goldstein, M., 1992. Reconciling costs and benefits in experimental design. In:\nBernardo, J.M., Berger, J.O., Dawid, A.P., Smith, A.F.M. (Eds.), Bayesian Statistics 4,\nOxford University Press, Oxford, 607-615.\nFarrow, M. and Goldstein, M., 1993. Bayes linear methods for grouped multivariate repeated\nmeasures studies with application to crossover trials. Biometrika, 80, 39-59.\nFarrow, M. and Leyland, A.H., 1991. Interpretation of oral glucose tolerance test results. In:\nDunstan,F., Pickles,J. (Eds.), Statistics in Medicine, Clarendon Press, Oxford, 249-266.\nde Finetti, B., 1974. Theory of Probability: A Critical Introductory Treatment, Volume 1. John\nWiley, New York.\nGittins, J. and Pezeshk, H., 2000. How large should a clinical trial be? The Statistician, 49, 177-187.\n23\nGoldstein, M., 1986. Exchangeable belief structures. Journal of the American Statistical Associa-\ntion, 81, 971-976.\nGoldstein, M., 1999. Bayes linear analysis. In: Kotz, S., Read,C., Banks, D.L. (Eds.), Encyclopedia\nof Statistical Sciences, Update volume 3. John Wiley, Chichester, 29-34.\nGoldstein, M., Farrow, M. and Spiropoulos, T., 1993. Prediction under the influence: Bayes linear\ninfluence diagrams for prediction in a large brewery. The Statistician, 42, 445-459.\nGoldstein, M. and Wooff, D.A., 1997. Choosing sample sizes in balanced experimental designs: a\nBayes linear approach. The Statistician, 46, 167-183.\nHarsanyi, J.C., 1955. Cardinal welfare, individualistic ethics and interpersonal comparisons of\nutility. Journal of Political Economy, 63, 309-321.\nKeeney, R.L., 1976. A group preference axiomatization with cardinal utility. Management Science,\n23, 140-145.\nKeeney, R.L. and Raiffa, H., 1976. Decisions with Multiple Objectives: Preferences and Value\nTrade-offs.John Wiley & Sons, New York.\nLindley, D.V., 1997. The choice of sample size. The Statistician, 46, 129-138.\nMu¨ller, P., 1999. Simulation-based optimal design. In: Bernardo,J.M., Berger, J.O., Dawid, A.P.,\nSmith, A.F.M. (Eds.), Bayesian Statistics 6, Oxford University Press, Oxford, 459-474.\nResnik, M.D., 1987. Choices: an Introduction to Decision Theory. University of Minnesota Press,\nMinneapolis.\nShaw, S.C. and Goldstein, M., 1999. Simplifying complex designs: Bayes linear experimental design\nfor grouped multivariate exchangeable systems. In: Bernardo, J.M., Berger, J.O., Dawid,\nA.P., Smith, A.F.M. (Eds.), Bayesian Statistics 6, Oxford University Press, Oxford, 839-848.\nTan, S.B. and Smith, A.F.M., 1998. Exploratory thoughts on clinical trials with utilities. Statistics\nin Medicine, 17, 2771-2791.\nVerdinelli, I. and Kadane, J.B., 1992. Bayesian designs for maximising information and outcome.\nJournal of the American Statistical Association, 87, 510-515.\nWalker, S.G., 2003. How many samples?: a Bayesian nonparametric approach. The Statistician,\n52, 475-482.\nWalley, P., 1991. Statistical Reasoning with Imprecise Probabilities. Chapman and Hall, London.\nWorld Health Organisation, 1980. W.H.O. Expert Committee on diabetes mellitus. World Health\nOrganisation Technical Report Series 646, W.H.O., Geneva.\nWickramasinghe, L.S.P., Chazan, B.I., Farrow, M., Bansal, S.K. and Basu, S.K., 1992. C-peptide\nresponse to oral glucose and its clinical role in elderly people. Age and Ageing, 21, 103-108.\n24\n"}