{"doi":"10.1007\/s11149-007-9039-7","coreId":"139346","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4101","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4101","10.1007\/s11149-007-9039-7"],"title":"Electricity sector reform in developing countries: an econometric assessment of the effects of privatisation, competition and regulation","authors":["Zhang, Yin-Fang","Parker, David","Kirkpatrick, Colin"],"enrichments":{"references":[{"id":37974021,"title":"A Guide to Econometrics, Cambridge, Mass.: MIT Press.30 Kessides I.","authors":[],"date":"1992","doi":null,"raw":"Kennedy, P. (1992), A Guide to Econometrics, Cambridge, Mass.: MIT Press.30 Kessides I. (2004) Reforming Infrastructure: Privatisation, Regulation and Competition. World Bank Research Report. Washington DC: World Bank Kirkpatrick C., Parker D., and Zhang Y-F (2006, forthcoming) ‘Foreign Investment in Infrastructure in Developing Countries: Does Regulation Make a Difference?’ Transnational Corporations.","cites":null},{"id":37974036,"title":"An Econometric Analysis of Telecom Competition, Privatization, and Regulation in","authors":[],"date":"2001","doi":"10.1111\/1467-6451.00135","raw":"Wallsten, S.J. (2001), ‘An Econometric Analysis of Telecom Competition, Privatization, and Regulation in Africa and Latin America’, The Journal of Industrial Economics, 49(1), 1-19.","cites":null},{"id":37974029,"title":"and Kirkpatrick C.(2005) ‘Privatisation in Developing Countries: A Review of Evidence and Policy Lessons’","authors":[],"date":"1995","doi":"10.1080\/00220380500092499","raw":"Parker D. and Kirkpatrick C.(2005) ‘Privatisation in Developing Countries: A Review of Evidence and Policy Lessons’ Journal of Development Studies, 41(4), 513-541 Pollitt (1995) Ownership and Performance in Electric Utilities, Oxford: Oxford University Press.","cites":null},{"id":37974019,"title":"Benchmarking and Regulation of Electricity Transmission and Distribution Utilities: Lessons from International Experience’, Working Paper,","authors":[],"date":"2000","doi":"10.1016\/s0957-1787(01)00010-8","raw":"Jamasb, T. and Pollitt M. (2000) ‘Benchmarking and Regulation of Electricity Transmission and Distribution Utilities: Lessons from International Experience’, Working Paper, University of Cambridge.","cites":null},{"id":37974026,"title":"Bureaucracy and Representative Government,","authors":[],"date":"1971","doi":"10.7202\/1003731ar","raw":"Niskanen., W.A.Jr. (1971) Bureaucracy and Representative Government, Chicago: Aldine.","cites":null},{"id":37974015,"title":"Competition and Choice in Electricity,","authors":[],"date":"1996","doi":"10.1016\/0140-6701(96)88725-x","raw":"Hunt, S. and Shuttleworth, G. (1996) Competition and Choice in Electricity, Chichester: Wiley.","cites":null},{"id":37974006,"title":"Development and Project Financing of Private Power Projects in Developing Countries: a case study of India’,","authors":[],"date":"1998","doi":"10.1016\/s0263-7863(97)00030-6","raw":"Gupta, J.P. and Sravat, A.K. (1998) ‘Development and Project Financing of Private Power Projects in Developing Countries: a case study of India’, International Journal of Project Management, 16 (2),99-105.","cites":null},{"id":37974031,"title":"Does Ownership or Competition Matter? The Effects of Telecommunications Reform on Network Expansion and Efficiency’,","authors":[],"date":"1999","doi":null,"raw":"Ros, A. J. (1999) ‘Does Ownership or Competition Matter? The Effects of Telecommunications Reform on Network Expansion and Efficiency’, Journal of Regulatory Economics, 15, 65-92.","cites":null},{"id":37974004,"title":"Economic Freedom of the World:","authors":[],"date":"2002","doi":null,"raw":"Economic Freedom of the World: 2002 Annual Report, www.freetheworld.com\/release.html Energy Information Administration (EIA), www.eia.doe.gov Gilbert, R.J. and Khan, E.P. (1996) International Comparisons of Electricity Regulation, Cambridge: Cambridge University Press.28 Gomez-Ibanez J. (2003) Regulating Infrastructure: Monopoly, Contracts and Discretion. Cambridge Mass. Harvard University Press.","cites":null},{"id":37974020,"title":"Electricity Sector Reform in Developing Countries: A Survey of Empirical Evidence on Determinants and Performance. Cambridge Working Papers in Economics,","authors":[],"date":"2004","doi":"10.1596\/1813-9450-3549","raw":"Jamash T., Mota R. Newbery D. and Pollitt M. (2004) ‘Electricity Sector Reform in Developing Countries: A Survey of Empirical Evidence on Determinants and Performance. Cambridge Working Papers in Economics, CWPE 0439. Department of Applied Economics. Cambridge Jamasb, T., Nillesen, P. and Pollitt, M.G. (2003) 'Strategic behaviour under regulation benchmarking', CMI EP Working Paper 19, University of Cambridge.","cites":null},{"id":37974025,"title":"From State to Market: A Survey of Empirical Studies on Privatization’,","authors":[],"date":"2001","doi":"10.2139\/ssrn.262311","raw":"Megginson, W.L. and Netter, J.M. (2001) ‘From State to Market: A Survey of Empirical Studies on Privatization’, Journal of Economic Literature, 39, 321-389.","cites":null},{"id":37973994,"title":"Global Electric Power Reform, Privatization and Liberalization of the Electric Power Industry in Developing Countries’,","authors":[],"date":"2001","doi":null,"raw":"Bacon, R.W. and Besant-Jones, J. (2001) ‘Global Electric Power Reform, Privatization and Liberalization of the Electric Power Industry in Developing Countries’, Annual Reviews Energy & the Environment, 26, 331-59.","cites":null},{"id":37973998,"title":"Incentive regulation in the United Kingdom and the United States: Some lessons’,","authors":[],"date":"1996","doi":"10.1007\/bf00133474","raw":"Crew, M.A. and Kleindorfer, P.R. (1996) ‘Incentive regulation in the United Kingdom and the United States: Some lessons’, Journal of Regulatory Economics, 9, 211-225.","cites":null},{"id":37974008,"title":"Institutions, Competition and the Performance of Telecommunications Infrastructure in Africa’, Working Paper,","authors":[],"date":"2001","doi":null,"raw":"Hamilton, J. (2001) ‘Institutions, Competition and the Performance of Telecommunications Infrastructure in Africa’, Working Paper, Florida: Department of Economics, University of Florida.","cites":null},{"id":37974028,"title":"Institutions, Institutional Change and Economic Performance,","authors":[],"date":"1990","doi":"10.1017\/cbo9780511808678","raw":"North, D. C. (1990) Institutions, Institutional Change and Economic Performance, Cambridge: Cambridge University Press.31 Parker, D. (2002), ‘Economic Regulation: A Review of Issues’, Annals of Public and Cooperative Economics, 73 (4), pp.493-519.","cites":null},{"id":37974002,"title":"Modelling the Costs of Electricity Regulation: Evidence of Human Resource Constraints in Developing Countries’, Regulation Initiative Working Paper Series,","authors":[],"date":"2002","doi":"10.2139\/ssrn.371600","raw":"Domah P. Pollitt M. and Stern J. (2002) ‘Modelling the Costs of Electricity Regulation: Evidence of Human Resource Constraints in Developing Countries’, Regulation Initiative Working Paper Series, No. 49, London Business School.","cites":null},{"id":37974011,"title":"Performance of Power Sectors in Developing Countries – A Study of Efficiency and World Bank Policy using Data Envelopment Analysis, Surrey Energy Economics Centre Discussion Paper 88,","authors":[],"date":"1996","doi":null,"raw":"Hawdon, D. (1996) Performance of Power Sectors in Developing Countries – A Study of Efficiency and World Bank Policy using Data Envelopment Analysis, Surrey Energy Economics Centre Discussion Paper 88, University of Surrey.","cites":null},{"id":37973995,"title":"Political Institutions and Electric Utility Investment: a Cross-nation Analysis’, Working Paper,","authors":[],"date":"1997","doi":"10.2307\/41165931","raw":"Bergara, M, Henisz, W.J. and Spiller, P.T. (1997) ‘Political Institutions and Electric Utility Investment: a Cross-nation Analysis’, Working Paper, University of California Energy Institute.","cites":null},{"id":37974014,"title":"Political Risk, Political Capabilities and International Investment Strategy: Evidence from the Power Generation Industry’, mimeo,","authors":[],"date":"2001","doi":"10.2139\/ssrn.1091615","raw":"Holburn, G.F. (2001) ‘Political Risk, Political Capabilities and International Investment Strategy: Evidence from the Power Generation Industry’, mimeo, paper29 presented at the the 5 th Annual EUNIP Conference, Vienna, 29 November-1 December 2001.","cites":null},{"id":37974018,"title":"Private Participation in Energy’, Note 208, the World Bank, Private Participation in infrastructure Group,","authors":[],"date":"2000","doi":null,"raw":"Izaguirre, A. K. (2000) ‘Private Participation in Energy’, Note 208, the World Bank, Private Participation in infrastructure Group, Washington, D.C. Jamash T. (2002) ‘Sustainable Electricity Sector Reform and Regulation in Developing Countries’ unpublished mimeo, Department of Applied Economics, University of Cambridge.","cites":null},{"id":37974017,"title":"Private Participation in the Electricity Sector – Recent Trends’, Note 154, the World Bank, Private Participation in Infrastructure Group,","authors":[],"date":"1998","doi":null,"raw":"Izaguirre, A.K. (1998) ‘Private Participation in the Electricity Sector – Recent Trends’, Note 154, the World Bank, Private Participation in Infrastructure Group, Washington, D.C..","cites":null},{"id":37973993,"title":"Privatization and Reform in the Global Electricity Supply Industry’,","authors":[],"date":"1995","doi":"10.1146\/annurev.energy.20.1.119","raw":"Bacon, R.W. (1995) ‘Privatization and Reform in the Global Electricity Supply Industry’, Annual Reviews Energy & the Environment, 20, 119-43.","cites":null},{"id":37974000,"title":"Privatization and Restructuring of Electricity Provision,","authors":[],"date":"1999","doi":null,"raw":"Czamanski, D. (1999) Privatization and Restructuring of Electricity Provision, Westport, Conn.: Praeger.","cites":null},{"id":37974027,"title":"Privatization, Restructuring and Regulation of Network Industries,","authors":[],"date":"1999","doi":null,"raw":"Newbery D M (1999) Privatization, Restructuring and Regulation of Network Industries, Cambridge, Mass.: MIT Press.","cites":null},{"id":37974035,"title":"Privatization: An Economic Analysis, LondonCambridge MA,","authors":[],"date":"1988","doi":"10.2307\/2233742","raw":"Vickers, J. and Yarrow, G. (1988), Privatization: An Economic Analysis, LondonCambridge MA, The MIT Press.32 Villalonga, B. (2000), ‘Privatization and Efficiency: Differentiating Ownership Effects from Political, Organizational, and Dynamic Effects’, Journal of Economic Behaviour & Organization, 42, 43-74.","cites":null},{"id":37973997,"title":"Rebalancing the Public and Private Sectors: Developing Country Experience,","authors":[],"date":"1991","doi":null,"raw":"Bouin, O. and Michalet, C.A. (1991) Rebalancing the Public and Private Sectors: Developing Country Experience, OECD, Paris.","cites":null},{"id":37973996,"title":"Regulation and Privatisation: the Case of Electricity’, Working","authors":[],"date":"1998","doi":null,"raw":"Bortolotti, B., Fantini, M. and Siniscalco, D. (1998) ‘Regulation and Privatisation: the Case of Electricity’, Working Paper, Department of Economics and Finance, Turin: University of Turin.27 Bortolotti, B., D’Souza, J., Fantini, M. and Megginson, W.L. (2002) ‘Privatization and the Sources of Performance Improvement in the Global Telecommunications Industry’, Telecommunications Policy, 26, 243-268.","cites":null},{"id":37974033,"title":"Regulation, Industry Structure and Performance in the Electricity Supply Industry’, Economics Department Working Papers No.238,","authors":[],"date":"2000","doi":"10.1787\/880084226021","raw":"Steiner, F. (2000) ‘Regulation, Industry Structure and Performance in the Electricity Supply Industry’, Economics Department Working Papers No.238, Paris: OECD.","cites":null},{"id":37974023,"title":"Regulations, Institutions, and Commitment: Comparative Studies of Telecommunications, Cambridge:","authors":[],"date":"1996","doi":"10.1017\/cbo9781139174589","raw":"Levy, B. and Spiller, P.T. (1996) Regulations, Institutions, and Commitment: Comparative Studies of Telecommunications, Cambridge: Cambridge University Press.","cites":null},{"id":37974034,"title":"Regulatory Governance: Criteria for Assessing the Performance of Regulatory Systems: An application to Infrastructure Industries in the Developing Countries of Asia’,","authors":[],"date":"1999","doi":"10.2139\/ssrn.321421","raw":"Stern, J. and Holder, S. (1999) ‘Regulatory Governance: Criteria for Assessing the Performance of Regulatory Systems: An application to Infrastructure Industries in the Developing Countries of Asia’, Utilities Policy, 8, 33-50.","cites":null},{"id":37973992,"title":"Regulatory Reform: Economic Analysis and British experience,","authors":[],"date":"1994","doi":null,"raw":"Armstrong, M., Cowan, S. and Vickers, J. (1994) Regulatory Reform: Economic Analysis and British experience, Cambridge, Mass.: MIT Press. Asia Pacific Energy Research Centre, www.ieej.or.jp\/aperc.","cites":null},{"id":37973991,"title":"Some Economics of Property Rights’,","authors":[],"date":"1965","doi":"10.1057\/9780230226203.1353","raw":"Alchian, A.A. (1965) ‘Some Economics of Property Rights’, Il Politico, 30, 816-29. APERC (2000) Electricity Sector Deregulation in the APEC Region, Asia Pacific Energy Research Centre, Institute of Energy Economics, Japan.","cites":null},{"id":37974007,"title":"Telecommunications Liberalization and Regulatory Governance: Lessons from Latin America’,","authors":[],"date":"2000","doi":"10.1016\/s0308-5961(00)00069-0","raw":"Gutierrez, L.H. and Berg, S. (2000) ‘Telecommunications Liberalization and Regulatory Governance: Lessons from Latin America’, Telecommunications Policy, 24, 865-884.","cites":null},{"id":37974016,"title":"Testing for Unit Roots in Dynamic Heterogeneous Panels’, Working Paper,","authors":[],"date":"1995","doi":"10.1016\/s0304-4076(03)00092-7","raw":"Im, L.S.; Pesaran, M.H. and Shin, Y. (1995), ‘Testing for Unit Roots in Dynamic Heterogeneous Panels’, Working Paper, Department of Applied Economics, University of Cambridge.","cites":null},{"id":37974038,"title":"The Benefits and Deficiencies of Energy Sector Liberalisation, Vol.1, World Energy Council, London. Yearbook of Privatisation (various issues),","authors":[],"date":"1998","doi":null,"raw":"World Energy Council (1998), The Benefits and Deficiencies of Energy Sector Liberalisation, Vol.1, World Energy Council, London. Yearbook of Privatisation (various issues), London: Privatisation International.","cites":null},{"id":37974040,"title":"The Control and Performance of State-owned Enterprises’,","authors":[],"date":"1989","doi":"10.1007\/978-94-011-7429-9_2","raw":"Zeckhauser, R.J. and Horn, M. (1989) ‘The Control and Performance of State-owned Enterprises’, in P.W.MacAvoy, W.T. Stanbury, G.Yarrow and R.J. Zeckhauser (eds.)33 Privatization and State-owned Enterprises: Lessons from the United States, Great Britain and Canada, Boston: Kluwer. Zhang Y-F., Parker D. and Kirkpatrick C. ‘Competition, Regulation and Privatisationof Electricity Generation in Developing Countries: Does the Sequencing of the Reforms Matter?’ Quarterly Review of Economics and Finance, 54(2-3), 358-","cites":null},{"id":37974005,"title":"The Costs and Benefits of Regulation: Implications for Developing Countries’, The World Bank Research Observer,","authors":[],"date":"1999","doi":"10.1093\/wbro\/14.1.137","raw":"Guasch, J.L. and Hahn, R.W. (1999) ‘The Costs and Benefits of Regulation: Implications for Developing Countries’, The World Bank Research Observer, 14 (1), 137-158.","cites":null},{"id":37974001,"title":"The Economics of Property Rights: a Review of the Evidence’,","authors":[],"date":"1980","doi":null,"raw":"De Alessi, L. (1980), ‘The Economics of Property Rights: a Review of the Evidence’, Research in Law and Economics, 2, 1-47.","cites":null},{"id":37974039,"title":"The Efficiency of the National Electricity Board in Malaysia: an Intercountry comparison using DEA’,","authors":[],"date":"1997","doi":"10.1016\/s0140-9883(96)01018-3","raw":"Yunos, J.M. and Hawdon, D. (1997) ‘The Efficiency of the National Electricity Board in Malaysia: an Intercountry comparison using DEA’, Energy Economics, 19 (2), 255-69.","cites":null},{"id":37974032,"title":"The Hold-Up Problem and Incomplete Contracts: A Survey of Recent Topics in Contract Theory’,","authors":[],"date":"2001","doi":"10.2139\/ssrn.264969","raw":"Schmitz, P.W. (2001) ‘The Hold-Up Problem and Incomplete Contracts: A Survey of Recent Topics in Contract Theory’, Bulletin of Economic Research, 53 (1), 1-17.","cites":null},{"id":37974030,"title":"The Impact of Liberalization on the Performance of the Electricity Supply Industry: An International Survey’,","authors":[],"date":"1997","doi":null,"raw":"Pollitt, M.G. (1997) ‘The Impact of Liberalization on the Performance of the Electricity Supply Industry: An International Survey’, The Journal of Energy Literature, 3 (2), 3-31.","cites":null},{"id":37973999,"title":"The Impact of Regulatory Governance and Privatisation on Electricity Industry Generation Capacity in Developing Economies’, World Bank Economic Review,","authors":[],"date":"2006","doi":"10.1093\/wber\/lhj004","raw":"Cubbin J. and Stern J. (2006) ‘The Impact of Regulatory Governance and Privatisation on Electricity Industry Generation Capacity in Developing Economies’, World Bank Economic Review, vol.20, pp.115-41.","cites":null},{"id":37974013,"title":"The Institutional Environment for Telecommunications Investment’,","authors":[],"date":"2001","doi":"10.1162\/105864001300122575","raw":"Henisz, W. and Zelner, B.A. (2001) ‘The Institutional Environment for Telecommunications Investment’, Journal of Economics and Management Strategy, 10, 123-147.","cites":null},{"id":37974024,"title":"The Single-buyer Model: a Dangerous Path toward","authors":[],"date":"1996","doi":null,"raw":"Lovei, L. (1996) ‘The Single-buyer Model: a Dangerous Path toward Competitive Electricity Markets’, Electricity Journal, 19(2), 21-27.","cites":null},{"id":37974022,"title":"The Theory of Procurement and Regulation,","authors":[],"date":"1993","doi":"10.2307\/2235329","raw":"Laffont, J.J. and Tirole, J. (1993) The Theory of Procurement and Regulation, Cambridge, Mass.: MIT Press Leibenstein, H. (1966) ‘Allocative Efficiency versus X-Efficiency’, American Economic Review, 56, 392-415.","cites":null},{"id":37974012,"title":"The Use of Knowledge in","authors":[],"date":"1945","doi":"10.1016\/b978-0-7506-9749-1.50005-3","raw":"Hayek, F.A. (1945) ‘The Use of Knowledge in Society’, American Economic Review, 35, 519-530.","cites":null},{"id":37974037,"title":"World Development Report: A Better Investment Climate for Everyone, Oxford and Washington DC: Oxford University Press and World Bank World Bank","authors":[],"date":"2005","doi":"10.1596\/0-8213-5682-8","raw":"World Bank (2005) World Development Report: A Better Investment Climate for Everyone, Oxford and Washington DC: Oxford University Press and World Bank World Bank (2003) Power for Development: A Review of the World Bank Group’s Experience with Private Participation in the Electricity Sector. World Bank, International Finance Corporation, Multilateral Investment Guarantee Agency: Washington DC World Bank (1995) Bureaucrats in Business: The Economics and Politics of Government Ownership, Oxford and Washington, DC: Oxford University Press and World Bank. World Energy Council (WEC), www.worldenergy.org\/wec-geis.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04","abstract":"Over the last two decades electricity sectors in both developed and developing\ncountries have been subject to restructuring to introduce private capital and increase\ncompetition. Although the effects of such reforms in a number of the developed\neconomies are now well documented, apart from a few case studies the experience of\ndeveloping countries is much less well researched. This paper provides an\neconometric assessment of the effects of privatisation, competition and regulation on\nthe performance of the electricity generation industry using panel data for 36\ndeveloping and transitional countries, over the period 1985 to 2003. The study\nidentifies the impact of these reforms on generating capacity, electricity generated,\nlabour productivity in the generating sector and capacity utilisation. The main\nconclusions are that on their own privatisation and regulation do not lead to obvious\ngains in economic performance, though there are some positive interaction effects. By\ncontrast, introducing competition does seem to be effective in stimulating\nperformance improvements","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139346.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s11149-007-9039-7","pdfHashValue":"c24926edc169bf3fe4b976a2a162917a7b9dfd61","publisher":"Springer Netherlands","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4101<\/identifier><datestamp>2010-01-14T19:01:43Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Electricity sector reform in developing countries: an econometric assessment of the effects of privatisation, competition and regulation<\/dc:title><dc:creator>Zhang, Yin-Fang<\/dc:creator><dc:creator>Parker, David<\/dc:creator><dc:creator>Kirkpatrick, Colin<\/dc:creator><dc:subject>Privatisation<\/dc:subject><dc:subject>Competition<\/dc:subject><dc:subject>Regulation<\/dc:subject><dc:subject>Developing economies<\/dc:subject><dc:subject>Electricity sector<\/dc:subject><dc:description>Over the last two decades electricity sectors in both developed and developing\ncountries have been subject to restructuring to introduce private capital and increase\ncompetition. Although the effects of such reforms in a number of the developed\neconomies are now well documented, apart from a few case studies the experience of\ndeveloping countries is much less well researched. This paper provides an\neconometric assessment of the effects of privatisation, competition and regulation on\nthe performance of the electricity generation industry using panel data for 36\ndeveloping and transitional countries, over the period 1985 to 2003. The study\nidentifies the impact of these reforms on generating capacity, electricity generated,\nlabour productivity in the generating sector and capacity utilisation. The main\nconclusions are that on their own privatisation and regulation do not lead to obvious\ngains in economic performance, though there are some positive interaction effects. By\ncontrast, introducing competition does seem to be effective in stimulating\nperformance improvements.<\/dc:description><dc:publisher>Springer Netherlands<\/dc:publisher><dc:date>2010-01-06T11:55:09Z<\/dc:date><dc:date>2010-01-06T11:55:09Z<\/dc:date><dc:date>2008-04<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Yin-Fang Zhang, David Parker and Colin Kirkpatrick. Electricity sector reform in developing countries: an econometric assessment of the effects of privatisation, competition and regulation. Journal of Regulatory Economics. Volume 33, Number 2, April, 2008, Pages 159-178<\/dc:identifier><dc:identifier>0922-680X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s11149-007-9039-7<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/4101<\/dc:identifier><dc:language>en<\/dc:language><dc:rights>The original publication is available at www.springerlink.com<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0922-680X","0922-680x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Privatisation","Competition","Regulation","Developing economies","Electricity sector"],"subject":["Article"],"fullText":"1Journal of Regulatory Economics. Vol. 33, No. 2, April, 2008, Pages 159-178\nELECTRICITY SECTOR REFORM IN DEVELOPING\nCOUNTRIES: AN ECONOMETRIC ASSESSMENT OF THE\nEFFECTS OF PRIVATISATION, COMPETITION AND\nREGULATION\nby\nYin-Fang Zhang, David Parker*and Colin Kirkpatrick\nCentre on Regulation and Competition\nInstitute for Development Policy and Management\nUniversity of Manchester\nUK\n*and Cranfield School of Management\nCranfield University\nBedfordshire\nUK\nAuthor for correspondence: David Parker, Cranfield School of Management,\nCranfield University, Befordshire, MK43 0AL: Tel (0044) 1234 754378;\nemail:david.parker@Cranfield.ac.uk\nFurther Revised 2 November 2006\nElectricity sector reform JRE revised\n2ELECTRICITY SECTOR REFORM IN DEVELOPING\nCOUNTRIES: AN ECONOMETRIC ASSESSMENT OF THE\nEFFECTS OF PRIVATISATION, COMPETITION AND\nREGULATION\nAbstract\nOver the last two decades electricity sectors in both developed and developing\ncountries have been subject to restructuring to introduce private capital and increase\ncompetition. Although the effects of such reforms in a number of the developed\neconomies are now well documented, apart from a few case studies the experience of\ndeveloping countries is much less well researched. This paper provides an\neconometric assessment of the effects of privatisation, competition and regulation on\nthe performance of the electricity generation industry using panel data for 36\ndeveloping and transitional countries, over the period 1985 to 2003. The study\nidentifies the impact of these reforms on generating capacity, electricity generated,\nlabour productivity in the generating sector and capacity utilisation. The main\nconclusions are that on their own privatisation and regulation do not lead to obvious\ngains in economic performance, though there are some positive interaction effects. By\ncontrast, introducing competition does seem to be effective in stimulating\nperformance improvements.\nKey Words: Privatisation, competition, regulation, developing economies, electricity\nsector.\nJEL classification: L33; L43; L44; L50; 012; O38; O50\n31. Introduction1\nIn the last twenty years, a large number of developed and developing countries have\nintroduced major electricity sector reforms which have altered significantly the\nsector’s market structure and institutional framework. This increase in private\nparticipation in the electricity sector was accompanied by a change in thinking on how\nutilities should be organised and regulated (Newbery, 1999; Gomez-Ibanez, 2003).\nPower sector reform has usually involved some combination of product market\ncompetition, privatisation and regulation. In developed countries, the process of\nreform in the electricity sector has been well documented and appears to have been\nreasonably successful (Pollitt, 1995; Newbery, 1999) In developing countries,\nhowever, the path to reform has been more difficult. Developing countries can suffer\nfrom serious institutional weaknesses, meaning that planned reforms may not produce\ntheir intended benefits (Parker, 2002). In most developing countries the process of\ncapacity building and establishing adequate regulatory institutions has been a slow\nand complex one, lagging behind the entry of private operators in the electricity\nsector (World Bank, 2003, pp. ix-x; Cubbin and Stern, 2006; Zhang, Parker and\nKirkpatrick, 2005).\nThe motivation for this paper is to examine the separate effects of privatisation,\ncompetition and regulation as components of electricity sector reform on performance\nin developing countries. In doing so, we deploy a new and hitherto unused panel\ndatabase, which provides separate measures of the level of privatisation, competition\nand regulation in the electricity sector in 36 developing and transitional economies\nover the period 1985 to 2003. The aim of the analysis is to improve our understanding\nof the determinants of performance improvements in electricity sectors in developing\ncountries and thereby contribute to the design of better reform programmes.\nThe paper is organised as follows. Section 2 discusses the impetus for electricity\nreform in developing countries, describes the typical components of reform and\n1 We would like to thank two referees for their constructive comments on an earlier draft of the paper.\nWe also thank Tony Boardman, Dieter Bös, Michael Crew, Monica Giuiletti, Richard Green, Graeme\n4provides a review of relevant empirical studies on the effects of competition,\nprivatisation and regulation. Section 3 generates a number of research hypotheses\nand Section 4 then addresses data issues and discusses the modelling used to test the\nhypotheses. The results are presented in section 5. The last part of the paper, section\n6, provides a discussion of the results and summarises the main conclusions and\npolicy implications.\n2. Reform of the Electricity Sector in Developing Countries\nThe principal driving forces behind electricity reforms have been discussed in the\nliterature (for example, Bacon, 1995; World Energy Council, 1998; Czamanski, 1999;\nAPERC, 2000; Bacon and Besant-Jones, 2001). Following Jamasb, et al. (2004), we\ncan distinguish between ‘push’ and ‘pull’ factors. The former category includes the\npoor performance of state-run electricity operators in terms of high costs, inadequate\nexpansion of access to electricity services and unreliable supply; the inability of the\nstate sector to meet the investment and maintenance costs of the electricity industry\nassociated with the increasing demands for power resulting from economic\ndevelopment in other sectors of the economy; the need to remove electricity subsidies\nso as to release resources for other areas of public expenditure; and the desire to raise\nimmediate revenue for the government through the sale of state assets. The ‘pull’\nfactors have included: the demonstration effects of the pioneering reforms of the\npower sectors in Chile, England and Wales and Norway in the 1980s and early 1990s;\nadvocacy of reform by international financial organisations and donor agencies such\nas the IMF and World Bank, through their ‘lending for institutional reform’\nprogrammes; and rapid changes in technology in both the generation of electricity\nand in the computing systems used to meter and dispatch power, making new\nindustrial structures possible.\nThe reform programmes adopted by countries have tended to include the following\nthree main elements:\nHodge, Bill Megginson, Jon Stern, David Saal and attendees at a DFID workshop for helpful\ncomments on earlier versions of this paper. The usual disclaimer applies.\n51. Restructuring the industry in order to enable the introduction of\ncompetition. This means breaking up, or ‘unbundling’, the incumbent\nmonopoly utilities, possibly into separate generation, transmission,\ndistribution and retail suppliers of electricity.\n2. Privatisation of the unbundled generators, transmitters, distributors or\nsuppliers.\n3. Development of a new regulatory framework. Instead of direct regulation\nby a government department, the establishment of ‘independent’ or quasi-\nindependent regulatory bodies, in the forms of offices and commissions,\nhas been favoured, drawing particular on the regulatory models of the\nUSA and UK (Spiller, 1996; Schmitz, 2001)\nWhile the reform programmes for the electricity sector have been built around these\nthree elements, the detail has varied to reflect local circumstances (Bacon and Besant-\nJones, 2001; World Bank, 2004). For example, privatisation of power has occurred in\nthe form of operating concessions and greenfield investments, as well as state asset\nsales, but has rarely involved complete transfer of the entire electricity supply chain to\nthe private sector, as occurred in Britain. The result is electricity systems with private\nand public ownership co-existing. Also, the degree of competition permitted can vary\ndepending on which restructuring model has been used, for example the single-buyer\nmodel, wholesale competition (which can itself take various forms), or retail\ncompetition (Lovei, 1996; Hunt and Shuttleworth, 1996). Finally, regulation can take\nmany shapes (Gilbert and Khan, 1996; Stern and Holder, 1999) and, as Crew and\nKleindorfer note (1996, p.215), the need for workable solutions can lead to the design\nand implementation of regulatory systems that are not necessarily in line with\neconomic theory.\nA number of studies have examined the effects of privatisation on economic\nperformance in developing countries (Megginson and Netter, 2001; Parker and\nKirkpatrick, 2005). The conclusions of these studies are broadly consistent in\nshowing that ownership alone does not generate economic gains. This conclusion is\nsupported by studies that have found that competition is associated with lower costs,\nlower prices and higher productive efficiency (Bouin and Michalet, 1991) and that the\nsuccess or failure of the privatisation of monopolies depends on the post-privatisation\n6regulatory framework, which in turn is affected by political and social norms (Levy\nand Spiller, 1996; Villalonga, 2000). Megginson and Netter’s (2001) recent review\nof the privatisation literature suggests that, on balance, in the utilities sector\nderegulation and market liberalisation are associated with efficiency improvements,\nbut that the effect of privatisation by itself is less obvious. Studies by Wallsten (2001),\nGutierrez and Berg (2000) and Bortolotti et al. (2002) of telecommunications across a\nnumber of countries report similarly that privatisation alone is associated with few\nperformance improvements and that effective regulation and competition are\nimportant.\nThere is a limited literature that focuses on the impact on economic performance of\nreform in the electricity sector in developing countries (Jamasb, et al. 2004). The\nstandard structure-conduct-performance model has been used to test the effect of\nmarket structure, institutional factors and reform measures, on economic performance.\nThese three main types of determinants have been tested in a number of combinations\nand a wide range of variables has been used to represent market structure, institutional\nfactors and sector reforms. Similarly, a number of different performance measures\nhave been adopted. A particularly important study is that by Bortolotti et al. (1998),\nwho use data on the privatisation of electricity generation in 38 countries (both\ndeveloped and developing) between 1977 and 1997. They conclude that effective\nregulation is crucial to the success of privatisation (also see Pollitt, 1997). Steiner\n(2000) uses a panel data set for 19 OECD countries and dummy variables for market\nliberalisation, ownership and privatisation of generation, along with variables for\nvertical integration, the existence of an electricity market and consumer choice. She\nfinds that market liberalisation led to lower prices and that capacity utilisation was\nhigher under private ownership and vertical unbundling.\nTurning to other relevant studies, Hawdon (1996), analysing the performance of\npower sectors supported by World Bank loans, found that those countries adopting\nprivatisation had significantly higher efficiency than the non-privatising group.\nHowever, causation was unclear: ‘privatisation was adopted by those least in need of\nefficiency gains’ (ibid., p.28). In a comparison of electricity production in 27\n7developing countries in 1987, and using DEA analysis,2 Yunos and Hawdon (1997)\nfound that public sector suppliers performed as well as private sector companies;\nalthough in none of the countries studied had effective competition been introduced.\nBergara, et al. (1997) composed two political indexes to examine the effect of\ninstitutions on electric utility investment. They found that well-defined and credible\npolitical institutions were positively and significantly correlated with global electricity\ngenerating capacity. Cubbin and Stern (2006) assessed for 28 developing countries\nover the period 1980-2001 whether the existence of a regulatory law and higher\nquality regulatory governance are significantly associated with superior electricity\noutcomes. Their empirical analysis concludes that a regulatory law and higher quality\ngovernance are positively and significantly associated with higher per capita\ngeneration capacity levels and that this positive effect increases over time as\nexperience develops and regulatory reputation grows. Domah et al (2002) empirically\nestimated a translog cost function which specified a model of the determinants of staff\nnumbers that reflect the complexity of the electricity system, and national economic\nand regulatory environments. They found that developing countries faced high fixed\ncosts relative to market size in establishing independent regulatory agencies.\nOverall, therefore, the available empirical evidence suggests that in assessing the\nresults of electricity privatisation in developing countries the effects of competition\nand regulation also need to be taken into account. However, previous studies have\ntended to look at only one or maybe two of these three reforms without controlling for\nthe others and considering possible interaction effects. For this study a data set was\ncreated that allowed for the measure of these separate effects and their possible\ninteractions.\n3 The Research Hypotheses\nThis section of the paper develops a number of hypotheses as to the effects of\nprivatisation, competition and regulation in electricity generation, which are then\ntested empirically in the next section of the paper.\n2 Data envelopment analysis: a form of frontier efficiency measurement using a non-stochastic method.\n83.1 Hypotheses on privatisation\nThe new institutional economics (North, 1990; Levy and Spiller, 1996) provides\nimportant insights into the incentive effects of different types of ownership structure.\nOther streams of thought that are relevant to forming a hypothesis of the impact of\nprivatisation on economic performance are agency and public choice theories\n(Niskanen, 1971; Zeckhauser and Horn, 1989; Boycko and Vishny, 1996). In brief,\nprivatisation is expected to raise economic efficiency by (1) changing the allocation of\nproperty rights, which leads to a different structure of incentives for management and\nhence to changes in managerial behaviour; (2) removing the ‘soft budget’ constraint\nof taxpayer support and exposing enterprises to the disciplines of the private capital\nmarket (Alchian, 1965; De Alessi, 1980); (3) introducing more precise and\nmeasurable objectives, thus reducing transaction costs, especially associated with\nprincipals monitoring management (agent) behaviour; and (4) removing political\ninterference in the management of enterprises and capture by special interest groups\n(Boycko and Vishny, 1996).\nMost of the theoretical arguments for privatisation are concerned with the effects on\nproductive efficiency. It is expected, for example, that privatisation will lead to higher\nlabour productivity and higher utilisation of the available capital stock. When\napplying the theoretical insights into aspects of economic performance in the\nelectricity sector, however, specific features of that sector need to be taken into\naccount. The electricity utility industry is characterised by large sunk investments and\nnon-storable outputs. These factors provide governments (either national or local)\nwith the possibility of behaving opportunistically vis-à-vis the investing company.\nKnowing that under some circumstances governments may not be able to refrain from\nreneging on explicit or implicit agreements and behaving opportunistically, private\ninvestors may be cautious about investing in capacity. As a result, the actual effect of\nprivatisation on generation-capacity expansion and use is not clear, although one of\nthe expectations of governments pursuing privatisation is that it will lead to more\ncapital invested.\nFrom the above arguments the following two hypotheses are derived:\nHypothesis P1: Privatisation will lead to higher labour productivity and higher\ncapital utilisation.\n9Hypothesis P2: Privatisation will lead to more capacity and hence higher output,\nprovided that the regulatory regime is supportive of investor confidence.\n3.2 Hypotheses on competition\nIn the economics literature competition is regarded as a reliable mechanism for\nstimulating both allocative and technical efficiency (Leibenstein, 1966). In a\ncompetitive market, prices and profits reveal important information about the costs of\na firm and the efficiency of input use, thus providing the firm with incentives to\nimprove internal efficiency (Hayek, 1945). As a result, it is to be expected that\ncompetition will lead to higher electricity generation per employee. Moreover, lower\nper-unit costs resulting from increased technical efficiency may be passed through in\nlower prices, thus increasing the quantity demanded. Therefore, competition is likely\nto have positive effects on both the quantity of electricity supplied and capacity\nexpansion.\nThe following two hypotheses are therefore relevant on the effects of competition:\nHypothesis C1: Competition will lead to higher labour productivity and higher\ncapacity utilisation.\nHypothesis C2: Competition will lead to a larger capacity and a higher output in\nelectricity generation.\nIt is, of course, possible that in large firms, prevalent in the electricity sector,\nmanagerial discretion and “x-inefficiency” may mean that competition does not have\nthe expected results.\n3.3 Hypotheses on regulation\nElectricity generation is characterised by long-term sunk investments, which is why\nan effective regulatory system is crucial for both investor confidence and consumer\nprotection. The primary purpose of a well-designed regulatory system is to protect\nconsumers from monopoly abuse, while providing investors with protection from\narbitrary political action and incentives to promote efficient operation and investment\n(Laffont and Tirole, 1993). Carefully designed regulation can be expected, therefore,\nto be a key component of a successful process of electricity privatisation.\n10\nRegulation can affect a firm’s efficiency. Regulation that is too onerous will\nnegatively affect a firm’s input (Averch and Johnson, 1962) and output decisions and\ndepress productivity. Private operators will be unwilling to invest and will produce\nless under risky regulatory conditions (Gupta and Sravat, 1998; Holburn, 2001). At\nthe same time, clearly stated regulatory rules within a well-defined regulatory\nframework can be expected to reduce ‘regulatory risk’ and provide incentives for\nprivate investment and this is the main objective when ‘independent’ regulatory\nbodies are established. Such expectations lead to the following two hypotheses:\nHypothesis R1: Independent regulation in place of direct government\ndepartment regulation will improve labour productivity and capacity utilisation.\nHypothesis R2: Independent regulation will also raise investment in the industry\nleading to more capacity and more electricity generated.\n4. Data and Modelling\nThe above hypotheses were tested using panel data for 36 developing and transitional\neconomies over the period from 1985 to 2003.3 The starting date for the study, 1985,\nwas dictated by data availability; although this is not a problem because little reform\nof the electricity sector occurred before this date. The final date, 2003, represented the\nlast year for which data were available at the time the research was conducted. The\nchoice of the sample countries was based on access to data and especially information\non privatisation, competition and regulation. Even so, not all data exist for all of the\nyears for all 36 countries and therefore the sample size differs depending on the\nperformance indicator used in a particular estimation (the sample sizes are given when\nthe results are reported in table 2 below and vary between 644 and 347). Again for\ndata availability reasons, we focus on electricity generation. However, given that\nprivatisation has been concentrated in power generation, with three quarters of private\ninvestment in power generation plants (Izaguirre, 1998,p.4), this is not a serious\nlimitation to the study.\n3 The countries are: Albania, Algeria, Argentina, Armenia, Bangladesh, Bolivia, Brazil, Chile, China,\nColumbia, Costa Rica, Czech Rep., Dominican Rep., Ecuador, El Salvador, Gabon, Honduras, Hong\nKong China, Hungary, Indonesia, Kenya, Latvia, Malaysia, Mexico, Morocco, Nepal, Nicaragua,\nPanama, Peru, Philippines, Poland, Singapore, South Africa, Sri Lanka, Tanzania, Zambia. Details of\nthe dates of competition, regulation and privatisation can be obtained from the authors.\n11\nThe performance indicators used in the study are net electricity generation per capita\nof the population, installed generation capacity per capita of the population, net\nelectricity generation per employee in the industry and electricity generation to\naverage capacity (capacity utilisation). These indicators capture the extent of\nelectricity available to the economy, labour productivity and capacity utilisation in the\ngeneration of electricity. Another potentially useful measure of performance, quality\nof service, could not be estimated because of a lack of data. Similarly, we would like\nto have investigated the impact of reforms on the prices charged for electricity\ngenerated, but there is a lack of sufficient comparable data across our sample of\ncountries to carry out such an analysis.4 The indicators of generation, capacity and\ncapital efficiency were calculated based on data from the Asia Pacific Energy\nResearch Centre (APERC) database and the World Development Indicators published\nby the World Bank. The employment data used to calculate labour efficiency were\ncompiled from the Industrial Statistics Yearbook (various years) and the database of\nthe International Labour Organisation.5 The privatisation, competition and regulatory\nvariables were constructed according to reports in The Yearbook of Privatisation\n(various years), Energy Information Administration (EIA) publications, World Energy\nCouncil (WEC), APERC publications and databases published by the World Bank.\nThe privatisation variable used in the study was constructed as the percentage of\ngenerating capacity owned by private investors. Data on total generation capacity\nwere drawn from the World Bank Development Indicators. Data on privately owned\ngenerating capacity were calculated based on the database of Private Participation in\n4 In an earlier stage of the research we used cruder proxies for privatisation, competition and regulation\nthan used in this paper, in which a dummy variable simply indicated whether the economy had any\nprivate sector generation capacity; the measure of competition was a dummy variable that equalled 1\neither when there existed a wholesale market where generators competed to conclude supply contracts\nwith distributors or where large users could negotiate contracts directly with generators; and a dummy\nvariable was employed to indicate whether a country claimed to have an electricity regulatory agency\nnot directly under the control of a Ministry. The use of these broader measures allowed for the\ninclusion of a larger data base (consisting of 51 countries rather than 36) and permitted an analysis of\nprice effects in a sub-set of these countries. The findings suggested that competition was the main\ninfluence on prices but more especially for industrial users rather than domestic consumers. The earlier\nresults can be obtained from the authors.\n5 For those countries where data on employment in the generation subsector were not available, the\nnumber of employees was estimated by applying the average ratio of generation employment to\ntotal sector employment to the available data on total electricity sector employment.\n12\nInfrastructure (PPI) published by the World Bank. It should be noted that data on\ninvestment in the PPI database include private and public sector contributions.\nHowever, detailed inspection of the PPI database indicated that at least 80% of the\ninvestment in the projects reported in the database came from the private sector\n(Kirkpatrick et al, 2006, forthcoming)\nThe measure of competition was constructed on the basis of the market share of the\nthree largest generators in the sector. Data on the share for 20 of the 36 sample\ncountries came from the Electricity Regulation Database published by the World\nBank. Information for the other countries was mainly drawn from the Country Briefs\nof the US Energy Information Administration and the Latin American Energy\nOrganisation (OLADE).6 Particular difficulties arise in measuring regulation for the\npurposes of empirical study. There is limited published information on the forms of\nregulation adopted in particular developing countries and, in any event, practice may\nbe different to the published information. In this study, we constructed a four-\ncomponent index of regulatory governance in the electricity sector. The four elements\nare: (1) whether there is an electricity or energy law; (2) whether the regulator claims\nto be independent; (3) whether there is a fixed-term appointment for the head of the\nregulatory body, as fixed terms appointments may provide more independence from\npolitical manipulation; and (4) whether the finance of the regulator depends on licence\nfees and levies rather the government funding. The first three components are all\nrepresented by binary dummies in our model. The last element takes a value between\n0 and 1, with 0 indicating that the regulator is financed completely by government\nbudget and 1 meaning that it relies totally on levies. Data for constructing the index\ncame from the Electricity Regulation Database, the International Directory of Utility\n6 In a competitive market, the percentage of the market supplied by the largest producers can be a good\nproxy of competition. However, in infrastructure industries like electricity, this proxy may exaggerate\nthe extent of market competition. For example, the electricity sector in a country which has been\nunbundled may have several generators, not all of whom serve the same geographic market. In order to\nreduce this potential bias in the market share proxy for competition, the competition variable used in\nthe study was transformed and rebased using logarithms and the square root of the market share. The\nresults were consistent with those reported here; which are also consistent with the alternative\ncompetition proxy used in an earlier version of this paper. As mentioned already, this reflected the\nexistence of a wholesale market where generators competed to conclude supply contracts with\ndistributors or where large users could negotiate contracts directly with generators. None of the\ncompetition proxies used is perfect, but the use of different variables producing the same broad results\ngives confidence that we have not seriously misspecified the degree of competition.\n13\nRegulatory Institutions, and the Country Briefs of the US Energy Information\nAdministration.\nIn the model a time-specific residual was included to capture the time effect.7 Also, a\nnumber of variables were included in the model as environmental controls. In\nparticular, both an increase in GDP per capita and the share of the population living\nin urban areas can be expected to be associated with a higher demand for electricity,\nthus inducing higher investment by utilities.8 Other control variables included the\npercentage of industrial output as a share of GDP and a variable to measure a\ncountry’s ‘economic risk’. A large proportion of industrial customers implies a higher\npotential for co-generation and a more even demand for electricity, and, ceteris\nparibus, a reduction in the need for generation capacity. The economic risk variable\nmeasures the quality of governance in five areas (the size of government, legal\nstructure and security of property rights, access to sound money, freedom to trade\ninternationally and regulation of credit, labour and business ), and can be interpreted\nas a proxy for wider political and institutional factors associated with performance\nimprovement, independent of privatisation, competition and independent regulation.9\nThe openness of an economy, measured as the percentage of GDP accounted for by\nexports, was included as an additional control variable, and acts as a proxy for the\neconomy’s integration with rules-based international transactions. The\nmacroeconomic and demographic variables came from the World Bank’s World\nDevelopment Indicators and the economic risk variable was based on the 10-point\nindices published by the Fraser Institute. Table 1 lists the independent variables used\nin the study.10\n7 We also ran regressions with the time trend as an independent variable instead of as a composite error\nterm and the results were similar. Ideally, we would have liked to have used leads and lags of the\nreform variables but were unable to do so given the number of observations and therefore the degrees\nof freedom.\n8 Admittedly, over the long run there could be a causation problem here: GDP per capita and\nurbanisation may result from increased electricity generated because of the economic gains from\nelectrification. However, the study deals with a relatively short period in which these long-run\ncausation effects are unlikely to seriously bias the results.\n9 A number of studies have confirmed the influence of such political and institutional factors on private\ninvestment in the utilities sector (Guitierrez and Berg,2000; Hamilton 2000; Henisz and Zelner, 2001;\nKirkpatrick et al 2006).\n10 The correlation matrix for the independent variables is provided in the appendix table A1. The\ndescriptive statistics for the variables used in the study are given in appendix table A2.\n14\n(Table 1 here.)\nThe model employed in this study draws from those used in Ros (1999) and Wallsten\n(2001) for telecommunications and Bergara et al. (1997) for electricity. All non-index\nand non-percentage variables used in the study took the log form. A fixed-effects\npanel model that controls for country effects and time effects was used.11 The model\nis:\nittiititititiit uvxPGCRy   )()()()(ln 321 (1)\nwhere ity is each of the electricity indicators discussed above; ititit PCR ,, are the\nregulation, competition and privatisation variables, respectively; itx denotes the\ncontrol variables; iv is the unit-specific residual that differs between countries but\nremains constant for any particular country; while tu captures the time effect and\ntherefore differs across years but is constant for all countries in a particular year; it is\nthe remainder of the disturbance.\nAs noted above, privatisation, competition and regulation may interact to result in\nperformance improvements. To explore interaction effects, model (2) was also\nestimated:\nittiititititititititititiit uvxPGCPGRCRPGCRy   )()*()*()*()()()(ln 554321\n(2)\nModel (2) allows for both the separate effects of the reform variables and their\ninteractions to be examined.\nThe variables proved to be stationary over the period studied, thus reducing the\ndanger of spurious regressions. The unit root test (IPS test) for the panel structure of\n11 According to Kennedy (1992), the use of the fixed-effects model is reasonable when the sample data\nare large relative to the entire population, as in our case. Also, the Hausman test showed that the fixed-\n15\ndata proposed by Im et al. (1995) was used. Countries with missing data were first\nsingled out and balanced panel datasets were obtained. These were subsequently\ntested using the IPS method. Because the periods covered by the data for the countries\nwith missing data are relative short, this meant that excluding these countries from the\nunit root test did not exert a significant effect on the general results. The results from\nthe unit root tests are listed in the appendix table A3.12\nThe variables for privatisation, competition and regulation may be endogenously\ndetermined. In other words, privatisation, competition and regulation may influence\neach other, as well as the performance of the electricity sector. For example, the\npoorly performing generators may be privatised first because governments are keen to\nget rid of them, while better performing generators are sold off more slowly leaving\ntime to introduce prior changes to the regulatory and competitive environment. Our\nanalysis deals to some extent with this potential problem by including country and\nyear fixed effects. The country fixed effects control for country-specific propensities\nto reform and matters such as institutional quality, and year fixed effects control for\nany general trend in the reform of electricity generation.13\n5. The Results\nModels (1) and (2) were estimated for each of the dependent variables, namely,\nelectricity generation per capita, installed generation per capita, electricity generation\nper employee, and electricity generation to average installed capacity. The Prais-\nWinsten transformation was used to overcome the problem of autocorrelation in the\ninitial estimations. Table 2 presents the regression results.\n(Table 2 here.)\neffect model was superior for the purposes of our study. The Hausman test results can be obtained from\nthe authors.\n12 We also ran Seemingly Unrelated Regressions, as proposed by a referee. The results were similar to\nthose reported in Table 2. The SUR results can be obtained from the authors on request.\n13 We are grateful to a referee for raising the issue of endogeneity. Instrumental variables have been\nused in the literature to correct for this potential bias, however, as Jamasb et al. (2004) point out, the\nmajor challenge is identifying appropriate instrumental variables and collecting data on them.\n16\nElectricity generation per capita\nThe first two columns of Table 2 show the results for the regressions using the log\nform of electricity generation per capita. In both of the equations the regulation\nvariable (R) and the privatisation variable (P) are statistically insignificant. This\nsuggests that regulatory reform or private investment, on their own, is not sufficient to\nincrease the availability of electricity in our sample of developing and transitional\ncountries. Indeed, both variables have an unexpected negative sign suggesting that\nthese reforms on their own may actually reduce electricity output. The negative\ncoefficient for the privatisation variable may be explained by the fact that the primary\nobjective of private investors is to make profits. In contrast, under state ownership the\nobjective may be to provide electricity to as many individuals as possible, sometimes\nat prices well below costs. Possibly privatisation would then lead to lower output, at\nleast in the short term. The result for regulation is less easy to explain, but may\nindicate that imposing an independent regulator where state ownership persists is\nineffective. However, in both cases the coefficient values are statistically insignificant\nand therefore not too much should be read into these results.\nWhen the interaction variable between regulation and privatisation (PR) is considered,\nthere appears to be a positive correlation, significant at the 10% level. In other words,\nalthough not significant when considered separately, private involvement in electricity\ngeneration together with regulatory reforms is associated with an increase in\nelectricity generation per capita. This finding is consistent with the view that\nprivatisation of electricity generation increases output where independent regulation\nexists to reduce the threat of ‘hold up’.\nTurning to the effects of competition, competition among generators (C) is found to\nbe positively associated with electricity generation per capita in both of the\nestimations, i.e. with or without the inclusion of interaction effects, and has the largest\ncoefficient of any of the reforms. Hence, it seems that competition is an effective\ndriver of increased electricity production. However, the interaction terms between\nprivatisation and competition (PC) and regulation and competition (RC) are not\nstatistically significant and in the case of regulation and competition the coefficient\nhas an unexpected negative sign. These results suggest that it is competition on its\n17\nown rather than competition and ownership change or competition and the\nestablishment of an effective regulatory framework that is critical in explaining\nincreased electricity output in our sample.\nAs expected, GDP per capita is positively correlated with electricity generation as is\nthe degree of openness of the economy, as reflected in the exports variable. Also as\nexpected, the larger the degree of industrialisation in a country the higher the average\namount of electricity generation available to each citizen. The urbanisation variable\nwas not statistically significant and nor was the economic risk variable.\nInstalled generation capacity per capita\nThe regression results on installed capacity per capita in Table 2 (columns 3 and 4)\nare similar to those for electricity generation per capita. Again, the competition\nvariable (C) seems to have a significant, positive effect on capacity expansion, while\nthe coefficient for the effect of regulatory reforms with an independent regulator, (R)\nis once again statistically insignificant and negative, and the privatisation variable (P)\nalso has a negative sign.\nThe interaction results confirm that performance improvement following private\nparticipation is dependent on the deepening of regulatory reforms if there is a lack of\ncompetition. The PR variable is positive and statistically significant at the 1% level, a\nresult that is consistent with the argument that private generators will feel their\ninvestment is less likely to be devalued or expropriated where there is an independent\nregulator instead of direct government control of the sector. They are therefore more\nwilling to invest in capacity building. Privatisation on its own, however, has\nseemingly a negative effect on installed generating capacity, underlining the\nimportance of competition and regulation. Private participation in a more competitive\nindustrial structure (PC) has a positive effect on installed capacity. The results for\nthe interaction of regulation and competition (RC) are also consistent with those for\nelectricity generation per capita in finding a negative effect, in this case reducing\ninstalled generating capacity. This time the coefficient is statistically significant (at\nthe 10% level), implying that regulation can actually impair the positive effects of\ncompetition. This may be explained by inefficiencies in the operation of regulation in\ndeveloping countries, for example the existence of regulatory regimes that protect\n18\nexisting suppliers from competition. Recent research by the World Bank has stressed\nthe damaging effects that poor regulation can have on economic growth (World Bank,\n2005).\nThe effects of GDP per capita and urbanisation on capacity expansion are significant\nand positive, as is the coefficient for industrialisation in one of the results. These\nresults are in line with expectation, as are the results for both the economic risk and\nthe export orientation variables. Countries with lower economic risk and with\neconomies more open to exporting seem to be associated with higher installed\ngenerating capacity. This confirms that economies with better protected property\nrights, smaller government, access to sound money and greater freedom to trade\ninternationally are more conducive to private investment in electricity generation.\nLabour productivity\nTurning to columns 5 and 6 of Table 2, the competition variable (C) in the estimations\nis shown to have a positive impact on electricity generation per employee. However,\nprivate participation alone does not seem to lead to higher productivity and indeed the\nnegative sign on P suggests the alternative, although it is statistically insignificant.\nThe regulation variable is also statistically insignificant except when the interaction\nterms are introduced. With the interaction terms the results suggest that a more\nindependent regulator is associated with higher labour productivity except where\ncompetition is also strong. In this case, the regulatory reforms may be reversing some\nof the productivity gains introduced by competition, perhaps by restricting the extent\nto which competition removes overmanning. Regulators may be given an objective\nby government of reducing unemployment or may introduce regulations that lead to\nincreased manning. In contrast, regulation and private participation together (PR) do\nseem to lead to increased labour productivity. The overmanning may therefore be\ncentred on regulated state-owned generators.\nPerhaps surprisingly the variable for the interaction between competition and\nprivatisation (PC), while having the expected positive sign, is statistically\ninsignificant. But considered alongside the positive competition (C) variable and\nnegative privatisation variable (P), the result is consistent with the view that labour\nproductivity is most likely to rise when generators are privatised into a competitive\n19\nenvironment. Once again the GDP and export variables are significant and have the\nexpected sign. The degree of industrialisation and urbanisation and the economic risk\nvariables, however, do not appear to have a significant effect on labour productivity.\nCapacity utilisation\nIn a capital-intensive industry like electricity generation, a labour productivity\nmeasure needs to be supplemented by a measurement of capital productivity. The\nresults for the ratio of electricity generated to generating capacity are reported in\nTable 2 columns 7 and 8. They confirm, once again, that private investment and\nindependent regulation on their own have little obvious effects on performance and\nthat competition is the most important variable. In these results the interaction effect\nbetween privatisation and regulation (PR) is also once again statistically significant,\nconfirming that in the absence of competition performance improvements following\nthe involvement of the private sector may be heavily dependent upon having in place\neffective regulation. Indeed, for this set of results competition and the interaction of\nprivatisation and regulation dominate in terms of explaining improved capacity\nutilisation.\nTo add further detail, Table 3 provides estimates of the quantitative effects of the\nindividual reform variables calculated on the basis of the results in Table 2.14 As some\nof the coefficients of the reform variables are not statistically significant, the calculation\nwas based on the significant ones only.\n(Table 3 here)\n6. Discussion\nMore and more developing countries are thinking of, or have already undertaken,\nreforms in their electricity industry with the objectives of increasing private capital,\npromoting competition and introducing new regulatory structures. This study is based\non a data base especially created from a range of international sources to measure the\neffects of privatisation, regulation and competition on performance in electricity\n14 We thank a referee for suggesting this extension to the reporting of our results.\n20\ngeneration in developing countries. Data were collected for 36 countries covering the\nperiod 1985 to 2003. The empirical results presented show consistently that\ncompetition in electricity generation is more important than privatisation or the\nestablishment of independent regulation in bringing about performance\nimprovements.\nReviewing our findings in more detail and in relation to the research hypotheses, we\ndid not find that privatisation leads to improved labour productivity or to higher\ncapital utilisation (Hypothesis P1) or to more generating capacity and higher output\n(Hypothesis P2), except where it is coupled with the existence of an independent\nregulator. But regulation on its own also seemed to have little significant effect on the\nperformance variables (Hypotheses R1 and R2). In other words, when competition is\nweak, performance improvements from private participation seem to be dependent\nupon having an effective regulatory regime in place to stimulate management to\nimprove performance. In contrast, independent regulation without privatisation, in\neffect regulation of state-owned enterprises, seems to be ineffective. This result is not\nsurprising when we bear in mind that where government is the operator of enterprises,\nthe existence of independent regulation may lack credibility. Regulatory decisions are\nsubject to being overridden where they impact adversely on state industries and\nbudgets. Independent regulation may then become little more than a sham.\nIn contrast to the results for regulation and privatisation, our findings do confirm\nstrongly the overwhelming importance of increasing competition to promote\nimproved performance, in terms of greater electricity generation, generating capacity\nand improved labour productivity and capital utilisation in developing countries\n(Hypotheses C1 and C2). In our results competition dominated as the explanation of\nperformance in electricity generation. Although it is possible that managerial\ndiscretion and “x-inefficiency” could reduce the beneficial effects of competition on\nperformance, our results are consistent with the view that competition is very\nbeneficial.\n.\nOur results complement earlier research into electricity generation. Like Bortolotti et\nal. (1998) and Pollitt (1997) we conclude that in the absence of competition, effective\nregulation is crucial to the success of privatisation. In our results, as in Cubbin and\n21\nStern (2006), regulation is associated with higher per capita generation capacity\nlevels, but only when private operators exist. Like Yunos and Hawdon (1997) our\nresults are consistent with state-owned suppliers performing as well as private sector\ncompanies in the absence of complementary reforms. However, unlike Bergara et al.\n(1997) our measures of the institutional conditions in different countries (economic\nrisk and export orientation) were less consistently associated with performance. This\nmay be because in our study the reform variables, especially competition, were\ncapturing some of the effect of the institutional conditions researched by Yunos and\nHawdon, or it could be a reflection of using different institutional measures. This\ndeserves further investigation given the current emphasis in the development literature\non the importance of institutions.\nThe results on the relative roles of privatisation, regulation and competition are also\nvery similar to those found by Wallsten (2001), Gutierrez and Berg (2000) and\nBortolotti et al., 2002) for the telecommunications sector. For example, Wallsten\nconcludes that competition is beneficial for economic performance, but that\nprivatisation is beneficial only when coupled with the existence of an independent\nregulator. Our results do differ from those of Steiner (2000), who was concerned with\nelectricity generation in 19 OECD countries and found that capacity utilisation was\nhigher under private ownership. However, this is not entirely unexpected as\ndifferences are likely between developed and developing economies. Differences in\nthe results may reflect a superior management of the privatisation process in OECD\neconomies, with their more developed governmental and capital market institutions.\nMoreover, we would expect independent regulation to be more fully developed (and\ncredible) in the OECD countries. This conclusion needs further investigation, but is\nintuitively appealing given knowledge of widespread institutional weaknesses in\ndeveloping countries. It is also the case that reforming the electricity sector can be\nexpected to be more complex than reforming telecommunications because of the\ndiffering technologies involved and the greater difficulties of introducing effective\ncompetition. In telecommunications wireless technology has helped to circumvent the\nincumbent’s ownership of the fixed line network. However, in electricity new market\nentrants must obtain access to the existing transmission and distribution systems.\n22\nThe results have policy implications for electricity reformers in developing countries.\nThey suggest that in developing countries performance improvements in electricity\ngeneration are more assured when competition is promoted or, failing that,\nindependent regulation is instituted. Because competition is confirmed as the most\nreliable means of improving performance, this suggests that the use in a number of\ndeveloping countries of exclusivity periods granted to new generators and long-term\npurchase contracts for IPPs, arranged so as to stimulate investment, may be unwise.\nSuch measures may dim efficiency incentives and reduce economic performance by\nremoving the incentive of competition. It is also the case that it might be difficult to\nintroduce and maintain competition in the absence of privatisation because of the\nincentive for government to protect its own assets from depreciation. Nevertheless,\nour results suggest that privatisation without competition is likely to disappoint.\nThe research does, however, have a number of limitations, which we acknowledge.\nTo begin with, the sample is composed of developing countries (including five\nemerging transitional economies) for which we could obtain data on regulation,\ncompetition and privatisation to create our variables. There will be sample selection\nbias if the countries making this data available have differing results for the dependent\nvariables than those which do not make data available. We have no reason to believe\nthat this should be the case, but cannot of course rule it out. Secondly, while we have\nendeavoured to produce satisfactory measures of competition, regulation and\nprivatisation, more work would be valuable at an international level to obtain superior\nmeasures especially on the effectiveness of regulation.\nFinally, the paper has not explored the long-term developmental effects of price and\nservice changes in developing countries resulting from privatisation and market\nliberalisation in the electricity sector. Nor has the paper developed an analysis of the\npoverty and income distribution effects of privatisation. These are important issues for\ndeveloping countries, particularly in the context of the Millennium Development\nGoals, and remain the subject of future research.\n23\nTable 1: DESCRIPTION OF THE INDEPENDENT VARIABLES\nVariable Description Source\nR Four-component regulatory index The Yearbook of Privatisation, Energy\nInformation Administration, World\nEnergy Council, APERC and the\nWorld Bank.\nC Square root of (100 – the market\nshare of the three largest\ngenerators)\nThe Yearbook of Privatisation, Energy\nInformation Administration, World\nEnergy Council, APERC, the World\nBank and OLADE.\nP Share of privately-owned\ncapacities (%)\nThe Yearbook of Privatisation, Energy\nInformation Administration, World\nEnergy Council, APERC and the\nWorld Bank.\nGDP GDP per capita (1995 constant\nUS$\/person)\nWorld Bank Development Indicators\nUrbanisation Urban population as a share of the\ntotal (%)\nWorld Bank Development Indicators\nIndustrialisation Industrial output as a percentage of\nGDP (%)\nWorld Bank Development Indicators\nExports Export of goods and services as a\npercentage of GDP (%)\nWorld Bank Development Indicators\nRISK The degree of economic risk The Fraser Institute\n24\nTable 2: THE MAIN RESULTS USING FIXED EFFECTS PANEL DATA\nANALYSIS\nElectricity\ngeneration\nper capita\n(1) (2)\nInstalled\ngeneration\ncapacity per\ncapita\n(3) (4)\nElectricity\ngeneration\nper\nemployee\n(5) (6)\nGeneration\n\/ average\ncapacity\n(7) (8)\nEquation 1 Equation 2 Equation 1 Equation 2 Equation 1 Equation 2 Equation 1 Equation 2\nR -0.008\n(1.364)\n-0.007\n(0.752)\n-0.009\n(1.413)\n-0.011\n(1.522)\n-0.016\n(0.815)\n0.052\n(2.050)**\n0.004\n(0.523)\n-0.002\n(0.173)\nP -0.0001\n(0.353)\n-0.001\n(1.381)\n-0.00008\n(0.178)\n-0.003\n(4.027)***\n-0.0002\n(0.195)\n-0.002\n(0.590)\n0.00001\n(0.026)\n-0.002\n(1.545)\nC 0.017\n(1.748)*\n0.019\n(1.818)*\n0.034\n(3.567)*\n0.028\n(1.875)*\n0.030\n(2.929)***\n0.021\n(2.070)**\n0.046\n(1.709)*\n0.094\n(2.856)***\nRC -0.005\n(1.404)\n-0.006\n(1.733)*\n-0.02\n(3.903)***\n-0.002\n(1.237)\nPC 0.000001\n(0.004)\n0.0006\n(3.824)***\n0.0001\n(0.291)\n-0.0005\n(1.233)\nPR 0.0005\n(1.781)*\n0.0006\n(2.580)***\n0.001\n(1.993)**\n0.0006\n(3.863)***\nLGDP 0.573\n(13.753)***\n0.575\n(13.752)***\n0.527\n(12.707)***\n0.496\n(11.78)***\n0.527\n(2.906)***\n0.311\n(2.256)**\n0.046\n(0.965)\n0.068\n(1.427)\nIndustri\nalisation\n0.006\n(5.353)***\n0.007\n(5.476)***\n0.002\n(1.897)*\n0.003\n(2.677)\n0.007\n(1.225)\n0.005\n(1.161)\n0.007\n(5.201)***\n0.006\n(4.694)***\nUrbanis\nation\n-0.0008\n(0.353)\n0.00007\n(0.027)\n0.008\n(3.467)***\n0.013\n(4.889)***\n-0.012\n(1.039)\n-0.003\n(0.385)\n-0.012\n(4.346)***\n-0.016\n(5.522)***\nExport\n(%of\nGDP)\n0.003\n(4.192)***\n0.003\n(4.038)***\n0.002\n(2.713)***\n0.002\n(3.075)***\n0.005\n(2.582)**\n0.003\n(1.933)*\n0.0007\n(0.383)\n-0.0009\n(1.140)\nFreedo\nm\n-0.047\n(0.906)\n-0.037\n(0.711)\n0.068\n(5.690)***\n0.024\n(4.614)***\n0.044\n(0.501)\n-0.034\n(0.502)\n-0.017\n(0.579)\n-0.011\n(0.379)\nAdjuste\nd R-\nsquared\n0.99 0.99 0.99 0.99 0.89 0.93 0.69 0.70\nD-W\ntest\n1.74 1.73 1.79 1.79 1.81 1.83 1.74 1.73\nNumber\nof obs\n638 638 644 644 347 347 638 638\n25\nTable 3: THE QUANTITATIVE EFFECTS OF THE INDIVIDUAL REFORM\nVARIABLES\nElectricity\ngeneration per\ncapita\nInstalled\ngeneration\ncapacity per\ncapita\nElectricity\ngeneration per\nemployee\nGeneration \/\naverage capacity\nR\nOne unit change in\nthe regulatory index\nis associated with\n0.05% increase\nin electricity\ngeneration per\ncapita\n0.54%\ndecrease in\ninstalled\ncapacity per\ncapita\n3.30% increase\nin electricity\ngeneration per\nemployee\n0.06%\nincreased in\ngeneration\/av\nerage capacity\nP\nWhen the\nproportion of\ngeneration capacity\nowned by private\ninvestors increase\none percent, there\nwill be\n0.05% increase\nin electricity\ngeneration per\ncapita\n0.18%\ndecrease in\ninstalled\ncapacity per\ncapita\n0.1% increase in\nelectricity\ngeneration per\nemployee\n0.06%\nincreased in\ngeneration\/av\nerage capacity\nC\nwhen there is one\nunit change in the\nmeasurement of the\ncompetition\nvariable, there will\nbe\n1.90% increase\nin electricity\ngeneration per\ncapita\n2.26%\nincrease in\ninstalled\ncapacity per\ncapita\n0.1% increase in\nelectricity\ngeneration per\nemployee\n9.4% increased\nin\ngeneration\/av\nerage capacity\n26\nReferences\nAlchian, A.A. (1965) ‘Some Economics of Property Rights’, Il Politico, 30, 816-29.\nAPERC (2000) Electricity Sector Deregulation in the APEC Region, Asia Pacific\nEnergy Research Centre, Institute of Energy Economics, Japan.\nArmstrong, M., Cowan, S. and Vickers, J. (1994) Regulatory Reform: Economic\nAnalysis and British experience, Cambridge, Mass.: MIT Press.\nAsia Pacific Energy Research Centre, www.ieej.or.jp\/aperc.\nAverch, H. and Johnson, L.L. (1962) ‘Behavior of the Firm under Regulatory\nConstraint’, American Economic Review, vol.52, pp.1052-69.\nBacon, R.W. (1995) ‘Privatization and Reform in the Global Electricity Supply\nIndustry’, Annual Reviews Energy & the Environment, 20, 119-43.\nBacon, R.W. and Besant-Jones, J. (2001) ‘Global Electric Power Reform,\nPrivatization and Liberalization of the Electric Power Industry in Developing\nCountries’, Annual Reviews Energy & the Environment, 26, 331-59.\nBergara, M, Henisz, W.J. and Spiller, P.T. (1997) ‘Political Institutions and Electric\nUtility Investment: a Cross-nation Analysis’, Working Paper, University of California\nEnergy Institute.\nBortolotti, B., Fantini, M. and Siniscalco, D. (1998) ‘Regulation and Privatisation: the\nCase of Electricity’, Working Paper, Department of Economics and Finance, Turin:\nUniversity of Turin.\n27\nBortolotti, B., D’Souza, J., Fantini, M. and Megginson, W.L. (2002) ‘Privatization\nand the Sources of Performance Improvement in the Global Telecommunications\nIndustry’, Telecommunications Policy, 26, 243-268.\nBouin, O. and Michalet, C.A. (1991) Rebalancing the Public and Private Sectors:\nDeveloping Country Experience, OECD, Paris.\nBoycko, A.S. and Vishny, R. (1996) ‘A Theory of Privatization’, Economic Journal,\n106, 309-319.\nCrew, M.A. and Kleindorfer, P.R. (1996) ‘Incentive regulation in the United Kingdom\nand the United States: Some lessons’, Journal of Regulatory Economics, 9, 211-225.\nCubbin J. and Stern J. (2006) ‘The Impact of Regulatory Governance and\nPrivatisation on Electricity Industry Generation Capacity in Developing Economies’,\nWorld Bank Economic Review, vol.20, pp.115-41.\nCzamanski, D. (1999) Privatization and Restructuring of Electricity Provision,\nWestport, Conn.: Praeger.\nDe Alessi, L. (1980), ‘The Economics of Property Rights: a Review of the Evidence’,\nResearch in Law and Economics, 2, 1-47.\nDomah P. Pollitt M. and Stern J. (2002) ‘Modelling the Costs of Electricity\nRegulation: Evidence of Human Resource Constraints in Developing Countries’,\nRegulation Initiative Working Paper Series, No. 49, London Business School.\nEconomic Freedom of the World: 2002 Annual Report,\nwww.freetheworld.com\/release.html\nEnergy Information Administration (EIA), www.eia.doe.gov\nGilbert, R.J. and Khan, E.P. (1996) International Comparisons of Electricity\nRegulation, Cambridge: Cambridge University Press.\n28\nGomez-Ibanez J. (2003) Regulating Infrastructure: Monopoly, Contracts and\nDiscretion. Cambridge Mass. Harvard University Press.\nGuasch, J.L. and Hahn, R.W. (1999) ‘The Costs and Benefits of Regulation:\nImplications for Developing Countries’, The World Bank Research Observer, 14 (1),\n137-158.\nGupta, J.P. and Sravat, A.K. (1998) ‘Development and Project Financing of Private\nPower Projects in Developing Countries: a case study of India’, International Journal\nof Project Management, 16 (2),99-105.\nGutierrez, L.H. and Berg, S. (2000) ‘Telecommunications Liberalization and\nRegulatory Governance: Lessons from Latin America’, Telecommunications Policy,\n24, 865-884.\nHamilton, J. (2001) ‘Institutions, Competition and the Performance of\nTelecommunications Infrastructure in Africa’, Working Paper, Florida: Department of\nEconomics, University of Florida.\nHawdon, D. (1996) Performance of Power Sectors in Developing Countries – A Study\nof Efficiency and World Bank Policy using Data Envelopment Analysis, Surrey\nEnergy Economics Centre Discussion Paper 88, University of Surrey.\nHayek, F.A. (1945) ‘The Use of Knowledge in Society’, American Economic Review,\n35, 519-530.\nHenisz, W. and Zelner, B.A. (2001) ‘The Institutional Environment for\nTelecommunications Investment’, Journal of Economics and Management Strategy,\n10, 123-147.\nHolburn, G.F. (2001) ‘Political Risk, Political Capabilities and International\nInvestment Strategy: Evidence from the Power Generation Industry’, mimeo, paper\n29\npresented at the the 5th Annual EUNIP Conference, Vienna, 29 November-1\nDecember 2001.\nHunt, S. and Shuttleworth, G. (1996) Competition and Choice in Electricity,\nChichester: Wiley.\nIm, L.S.; Pesaran, M.H. and Shin, Y. (1995), ‘Testing for Unit Roots in Dynamic\nHeterogeneous Panels’, Working Paper, Department of Applied Economics,\nUniversity of Cambridge.\nIzaguirre, A.K. (1998) ‘Private Participation in the Electricity Sector – Recent\nTrends’, Note 154, the World Bank, Private Participation in Infrastructure Group,\nWashington, D.C..\nIzaguirre, A. K. (2000) ‘Private Participation in Energy’, Note 208, the World Bank,\nPrivate Participation in infrastructure Group, Washington, D.C.\nJamash T. (2002) ‘Sustainable Electricity Sector Reform and Regulation in\nDeveloping Countries’ unpublished mimeo, Department of Applied Economics,\nUniversity of Cambridge.\nJamasb, T. and Pollitt M. (2000) ‘Benchmarking and Regulation of Electricity\nTransmission and Distribution Utilities: Lessons from International Experience’,\nWorking Paper, University of Cambridge.\nJamash T., Mota R. Newbery D. and Pollitt M. (2004) ‘Electricity Sector Reform in\nDeveloping Countries: A Survey of Empirical Evidence on Determinants and\nPerformance. Cambridge Working Papers in Economics, CWPE 0439. Department of\nApplied Economics. Cambridge\nJamasb, T., Nillesen, P. and Pollitt, M.G. (2003) 'Strategic behaviour under regulation\nbenchmarking', CMI EP Working Paper 19, University of Cambridge.\nKennedy, P. (1992), A Guide to Econometrics, Cambridge, Mass.: MIT Press.\n30\nKessides I. (2004) Reforming Infrastructure: Privatisation, Regulation and\nCompetition. World Bank Research Report. Washington DC: World Bank\nKirkpatrick C., Parker D., and Zhang Y-F (2006, forthcoming) ‘Foreign Investment in\nInfrastructure in Developing Countries: Does Regulation Make a Difference?’\nTransnational Corporations.\nLaffont, J.J. and Tirole, J. (1993) The Theory of Procurement and Regulation,\nCambridge, Mass.: MIT Press\nLeibenstein, H. (1966) ‘Allocative Efficiency versus X-Efficiency’, American\nEconomic Review, 56, 392-415.\nLevy, B. and Spiller, P.T. (1996) Regulations, Institutions, and Commitment:\nComparative Studies of Telecommunications, Cambridge: Cambridge University\nPress.\nLovei, L. (1996) ‘The Single-buyer Model: a Dangerous Path toward Competitive\nElectricity Markets’, Electricity Journal, 19(2), 21-27.\nMegginson, W.L. and Netter, J.M. (2001) ‘From State to Market: A Survey of\nEmpirical Studies on Privatization’, Journal of Economic Literature, 39, 321-389.\nNiskanen., W.A.Jr. (1971) Bureaucracy and Representative Government, Chicago:\nAldine.\nNewbery D M (1999) Privatization, Restructuring and Regulation of Network\nIndustries, Cambridge, Mass.: MIT Press.\nNorth, D. C. (1990) Institutions, Institutional Change and Economic Performance,\nCambridge: Cambridge University Press.\n31\nParker, D. (2002), ‘Economic Regulation: A Review of Issues’, Annals of Public and\nCooperative Economics, 73 (4), pp.493-519.\nParker D. and Kirkpatrick C.(2005) ‘Privatisation in Developing Countries: A Review\nof Evidence and Policy Lessons’ Journal of Development Studies, 41(4), 513-541\nPollitt (1995) Ownership and Performance in Electric Utilities, Oxford: Oxford\nUniversity Press.\nPollitt, M.G. (1997) ‘The Impact of Liberalization on the Performance of the\nElectricity Supply Industry: An International Survey’, The Journal of Energy\nLiterature, 3 (2), 3-31.\nRos, A. J. (1999) ‘Does Ownership or Competition Matter? The Effects of\nTelecommunications Reform on Network Expansion and Efficiency’, Journal of\nRegulatory Economics, 15, 65-92.\nSchmitz, P.W. (2001) ‘The Hold-Up Problem and Incomplete Contracts: A Survey of\nRecent Topics in Contract Theory’, Bulletin of Economic Research, 53 (1), 1-17.\nSpiller, P. (1996) ‘Institutions and Commitment’, Industrial and Corporate Change,\nvol.5, no.2, pp. 421-452.\nSteiner, F. (2000) ‘Regulation, Industry Structure and Performance in the Electricity\nSupply Industry’, Economics Department Working Papers No.238, Paris: OECD.\nStern, J. and Holder, S. (1999) ‘Regulatory Governance: Criteria for Assessing the\nPerformance of Regulatory Systems: An application to Infrastructure Industries in the\nDeveloping Countries of Asia’, Utilities Policy, 8, 33-50.\nVickers, J. and Yarrow, G. (1988), Privatization: An Economic Analysis, London-\nCambridge MA, The MIT Press.\n32\nVillalonga, B. (2000), ‘Privatization and Efficiency: Differentiating Ownership\nEffects from Political, Organizational, and Dynamic Effects’, Journal of Economic\nBehaviour & Organization, 42, 43-74.\nWallsten, S.J. (2001), ‘An Econometric Analysis of Telecom Competition,\nPrivatization, and Regulation in Africa and Latin America’, The Journal of Industrial\nEconomics, 49(1), 1-19.\nWorld Bank (2005) World Development Report: A Better Investment Climate for\nEveryone, Oxford and Washington DC: Oxford University Press and World Bank\nWorld Bank (2003) Power for Development: A Review of the World Bank Group’s\nExperience with Private Participation in the Electricity Sector. World Bank,\nInternational Finance Corporation, Multilateral Investment Guarantee Agency:\nWashington DC\nWorld Bank (1995) Bureaucrats in Business: The Economics and Politics of\nGovernment Ownership, Oxford and Washington, DC: Oxford University Press and\nWorld Bank.\nWorld Energy Council (WEC), www.worldenergy.org\/wec-geis.\nWorld Energy Council (1998), The Benefits and Deficiencies of Energy Sector\nLiberalisation, Vol.1, World Energy Council, London.\nYearbook of Privatisation (various issues), London: Privatisation International.\nYunos, J.M. and Hawdon, D. (1997) ‘The Efficiency of the National Electricity Board\nin Malaysia: an Intercountry comparison using DEA’, Energy Economics, 19 (2), 255-\n69.\nZeckhauser, R.J. and Horn, M. (1989) ‘The Control and Performance of State-owned\nEnterprises’, in P.W.MacAvoy, W.T. Stanbury, G.Yarrow and R.J. Zeckhauser (eds.)\n33\nPrivatization and State-owned Enterprises: Lessons from the United States, Great\nBritain and Canada, Boston: Kluwer.\nZhang Y-F., Parker D. and Kirkpatrick C. ‘Competition, Regulation and\nPrivatisationof Electricity Generation in Developing Countries: Does the Sequencing\nof the Reforms Matter?’ Quarterly Review of Economics and Finance, 54(2-3), 358-\n379\n34\nAppendix\nTable A1: Correlation Matrix for the Independent Variables\nR C P LGDPP UB IN EX RISK\nR 1.00\nC .57 1.00\nP .33 .45 1.00\nLGDPP .18 .26 .37 1.00\nUB .27 .43 .43 .65 1.00\nIN -.15 .03 -.17 .26 .19 1.00\nEX -.07 -.13 .31 .58 .48 .08 1.00\nRISK .36 .22 .57 .50 .38 -.22 .62 1.00\n35\nTable A2 Descriptive Statistics for the Variables\nVariable Mean Std.Dev. Minimum Maximum\nLNGP 6.692 1.200 3.069 8.987\nLCAP -1.512 1.175 -4.581 0.609\nLGPE -0.075 0.792 -2.907 1.883\nLCAPEFF 8.204 0.232 7.283 8.841\nR 0.970 1.489 0.000 4.000\nP 14.617 25.244 0.000 100.000\nC 1.549 2.382 0.000 9.967\nLGDP 0.507 1.1589 -1.812 3.340\nUB 56.257 21.317 7.800 100.000\nIN 31.974 9.925 12.774 66.530\nEX 36.400 33.603 6.250 206.930\nRISK 5.636 1.277 1.700 9.030\nTable A3: Results for the Panel Unit Root Tests\nDependent Variable LNG LCAP LGPE LCAPEFF LGDP\nt-bar statistics -2.1.783 -2.9400 -2.3728 -2.9635 -7.8654\nThe critical value at the 1% confidence level is –1.96.\nL indicates logged values.\n"}