{"doi":"10.1111\/j.1574-6968.2010.02057.x","coreId":"19025","oai":"oai:eprints.bham.ac.uk:563","identifiers":["oai:eprints.bham.ac.uk:563","10.1111\/j.1574-6968.2010.02057.x"],"title":"Is the abundance of Faecalibacterium prausnitzii relevant to Crohn's disease?","authors":["Jia, Wenjing","Whitehead, Rebekah N.","Griffiths, Lesley","Dawson, Claire","Waring, Rosemary H.","Ramsden, David B.","Hunter, John O.","Cole, Jeffrey A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Reports that bacteria within the Firmicutes phylum, especially the species Faecalibacterium prausnitzii, are less abundant in Crohn’s disease (CD) patients and supernatants from cultures of this bacterium are anti-inflammatory prompted the investigation of the possible correlations between the abundance of F.prausnitzii and the response to treatment in patients with gut diseases and healthy controls. In a randomized, double-blind trial, faeces were collected from healthy volunteers, and from patients with active CD, ulcerative colitis (UC) and irritable bowel syndrome before and after treatment. The levels of F. prausnitzii DNA in faecal suspensions were determined by PCR. Treatment by an elemental diet was effective, resulting in decreases in both the Harvey and Bradshaw index (P<0.001) and the concentrations of serum C-reactive protein (P<0.05). The total levels of F. prausnitzii in faecal samples from CD patients at presentation were lower than those in the other groups both before and after the treatment. There was no correlation between F. prausnitzii abundance and the severity of CD before treatment. Clinical improvement unexpectedly correlated with a significant decrease in the abundance of F. prausnitzii, especially the A2-165 subgroup (P<0.05). Our data suggest that a paucity of F. prausnitzii in the gastrointestinal microbial communities is likely to be a minor aetiological factor in CD: recovery following elemental diet is attributed to lower levels of gut flora","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:563<\/identifier><datestamp>\n      2011-10-12T11:08:51Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5152<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Is the abundance of Faecalibacterium prausnitzii relevant to Crohn's disease?<\/dc:title><dc:creator>\n        Jia, Wenjing<\/dc:creator><dc:creator>\n        Whitehead, Rebekah N.<\/dc:creator><dc:creator>\n        Griffiths, Lesley<\/dc:creator><dc:creator>\n        Dawson, Claire<\/dc:creator><dc:creator>\n        Waring, Rosemary H.<\/dc:creator><dc:creator>\n        Ramsden, David B.<\/dc:creator><dc:creator>\n        Hunter, John O.<\/dc:creator><dc:creator>\n        Cole, Jeffrey A.<\/dc:creator><dc:subject>\n        QR Microbiology<\/dc:subject><dc:description>\n        Reports that bacteria within the Firmicutes phylum, especially the species Faecalibacterium prausnitzii, are less abundant in Crohn’s disease (CD) patients and supernatants from cultures of this bacterium are anti-inflammatory prompted the investigation of the possible correlations between the abundance of F.prausnitzii and the response to treatment in patients with gut diseases and healthy controls. In a randomized, double-blind trial, faeces were collected from healthy volunteers, and from patients with active CD, ulcerative colitis (UC) and irritable bowel syndrome before and after treatment. The levels of F. prausnitzii DNA in faecal suspensions were determined by PCR. Treatment by an elemental diet was effective, resulting in decreases in both the Harvey and Bradshaw index (P<0.001) and the concentrations of serum C-reactive protein (P<0.05). The total levels of F. prausnitzii in faecal samples from CD patients at presentation were lower than those in the other groups both before and after the treatment. There was no correlation between F. prausnitzii abundance and the severity of CD before treatment. Clinical improvement unexpectedly correlated with a significant decrease in the abundance of F. prausnitzii, especially the A2-165 subgroup (P<0.05). Our data suggest that a paucity of F. prausnitzii in the gastrointestinal microbial communities is likely to be a minor aetiological factor in CD: recovery following elemental diet is attributed to lower levels of gut flora.<\/dc:description><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/563\/1\/j.1574%2D6968.2010.02057.x.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/563\/1.hassmallThumbnailVersion\/j.1574%2D6968.2010.02057.x.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1111\/j.1574-6968.2010.02057.x<\/dc:relation><dc:identifier>\n        Jia, Wenjing and Whitehead, Rebekah N. and Griffiths, Lesley and Dawson, Claire and Waring, Rosemary H. and Ramsden, David B. and Hunter, John O. and Cole, Jeffrey A. (2010) Is the abundance of Faecalibacterium prausnitzii relevant to Crohn's disease? FEMS Microbiology Letters, 310 (2). p. 138. ISSN 03781097<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/563\/<\/dc:relation><dc:language>\n        English<\/dc:language><dc:contributor.sponsor>\n        The Wellcome Trust<\/dc:contributor.sponsor><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/563\/1.hassmallThumbnailVersion\/j.1574%2D6968.2010.02057.x.pdf","http:\/\/dx.doi.org\/10.1111\/j.1574-6968.2010.02057.x","http:\/\/eprints.bham.ac.uk\/563\/"],"year":2010,"topics":["QR Microbiology"],"subject":["Article","PeerReviewed"],"fullText":"R E S E A R CH L E T T E R\nIs theabundanceof Faecalibacteriumprausnitzii relevanttoCrohn’s\ndisease?\nWenjing Jia1, Rebekah N. Whitehead1, Lesley Griffiths1, Claire Dawson2, Rosemary H. Waring1,\nDavid B. Ramsden3, John O. Hunter2 & Jeffrey A. Cole1\n1School of Biosciences, University of Birmingham, Birmingham, UK; 2Gastroenterology Research Unit, Addenbrookes Hospital, Cambridge, UK; and\n3Medical School, University of Birmingham, Birmingham, UK\nCorrespondence: Jeffrey A. Cole, School of\nBiosciences, University of Birmingham,\nBirmingham B15 2TT, UK. Tel.: 144 121 414\n5440; fax: 144 121 414 5925; e-mail:\nj.a.cole@bham.ac.uk\nReceived 30 March 2010; revised 25 June 2010;\naccepted 30 June 2010.\nFinal version published online 2 August 2010.\nDOI:10.1111\/j.1574-6968.2010.02057.x\nEditor: Ross Fitzgerald\nKeywords\nCrohn’s disease; ulcerative colitis; irritable\nbowel syndrome; Faecalibacterium prausnitzii;\nbutyrate; faecal bacteria.\nAbstract\nReports that bacteria within the Firmicutes phylum, especially the species\nFaecalibacterium prausnitzii, are less abundant in Crohn’s disease (CD) patients\nand supernatants from cultures of this bacterium are anti-inflammatory prompted\nthe investigation of the possible correlations between the abundance of F.\nprausnitzii and the response to treatment in patients with gut diseases and healthy\ncontrols. In a randomized, double-blind trial, faeces were collected from healthy\nvolunteers, and from patients with active CD, ulcerative colitis (UC) and irritable\nbowel syndrome before and after treatment. The levels of F. prausnitzii DNA in\nfaecal suspensions were determined by PCR. Treatment by an elemental diet was\neffective, resulting in decreases in both the Harvey and Bradshaw index\n(Po 0.001) and the concentrations of serum C-reactive protein (Po 0.05). The\ntotal levels of F. prausnitzii in faecal samples from CD patients at presentation were\nlower than those in the other groups both before and after the treatment. There\nwas no correlation between F. prausnitzii abundance and the severity of CD before\ntreatment. Clinical improvement unexpectedly correlated with a significant\ndecrease in the abundance of F. prausnitzii, especially the A2-165 subgroup\n(Po 0.05). Our data suggest that a paucity of F. prausnitzii in the gastrointestinal\nmicrobial communities is likely to be a minor aetiological factor in CD: recovery\nfollowing elemental diet is attributed to lower levels of gut flora.\nIntroduction\nThe cause of Crohn’s disease (CD) is unknown and successful,\nlong-term treatment represents considerable clinical and phar-\nmacological challenges. The conventional treatment of disease\nof mild to medium severity consists of antibiotics to counteract\ninfection and 5-aminosalicylic acid (5-ASA) with or without\ncorticosteroids to counter inflammation, but remission can also\nbe achieved with enteral feeding (King et al., 1997). The faecal\nbacterial flora in CD is known to be abnormal (Sartor, 2008).\nCD has been suggested to be an autoimmune disease with an\nimmune attack directed against the resident bacteria of the\ncolon (Macpherson et al., 1996). The coating of colonic bacteria\nwith immunoglobulin approaches 100% in active CD, as\ncompared with 20% in healthy subjects and patients with\nirritable bowel syndrome (IBS). After enteral feeding, this\ncoating is rapidly reduced (van der Waiij et al., 2004).\nThere is increasing evidence that gut microorganisms play\nkey roles in gastrointestinal disease (Sartor, 2006; 2008).\nSome are believed to generate a harmful toxin (Pitcher &\nCummings, 1996; Loubinoux et al., 2002). Many others are\nknown to yield butyrate, which is not only an essential\nenergy source for colonocytes (Chapman et al., 1994;\nCostello et al., 1994; Macpherson et al., 1996; Aminov\net al., 2006; Louis & Flint, 2009; Mai & Draganov, 2009)\nbut also is both anti-inflammatory and anticarcinogenic\n(Hamer et al., 2008; Tazoe et al., 2008). Therefore, consider-\nable interest has been generated by reports that a reduction\nin bacteria within the Firmicutes phylum, especially the\nspecies Faecalibacterium prausnitzii, has been observed in\nthe gut of CD patients and that supernatants from cultures\nof this bacterium are anti-inflammatory (Sokol et al., 2008).\nBecause oxidation of butyrate is the major source of ATP in\ncells lining the colon (Yin et al., 2001), decreased levels of\nFEMS Microbiol Lett 310 (2010) 138–144c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\nM\nIC\nRO\nBI\nO\nLO\nG\nY\n L\nET\nT\nER\nS\nF. prausnitzii could well reduce ATP within these cells. At the\nsame time, coupled with the loss of anti-inflammatory\nagents from F. prausnitzii, this would, in a double blow,\nweaken the ability of the cells to fight infection (Smith et al.,\n2008). Thus, these findings potentially shed light on the\naetiology of CD and offer a novel therapeutic approach\ninvolving recolonization of the gut with the bacterium.\nTo evaluate these findings and to assess the effects of\nelemental diet therapy (ED) on the population of F. praus-\nnitzii within the gut, faecal samples were collected before\nand after therapy from patients suffering from CD, IBS and\nulcerative colitis (UC) as disease control groups, and also\nfrom healthy controls.\nMaterials and methods\nPatients and control subjects\nTwenty patients diagnosed to be suffering from CD, 21\npatients with IBS, 14 patients with UC and 18 healthy\nsubjects as controls were recruited at Addenbrookes Hospi-\ntal, Cambridge, which functions as a tertiary referral centre\nfor inflammatory bowel disease. A faecal sample and a blood\nsample were taken at the start of the treatment and again\n(except for the controls) 2 weeks later. Faecal samples were\ncollected at the homes of patients and control subjects and\nimmediately stored at 4 1C. Samples were taken to Adden-\nbrookes Hospital, assigned undisclosed identification codes\nand sent by courier at 4 1C to the University of Birmingham\nfor DNA extraction, arriving within 48 h of collection.\nSample identifications were decoded only after data collec-\ntion had been completed. Ethical permission to collect these\nsamples was obtained from Leeds West Ethics Research\nCommittee, ref. 07\/Q1205\/39, and informed, written con-\nsent was obtained from each subject.\nTreatment regimes and assessment of the\neffects of treatment\nMost CD patients attending the Addenbrookes Hospital\ntertiary referral clinic were considered to be relatively\ncomplex cases that had proved refractory to previous\npharmacological treatments. These included steroids and\/\nor immuno modulation therapy (azathioprine or metho-\ntrexate), or 5-ASA. Treatment was chosen by the individual\nconsultant supervising each case, but all included in the\npresent study were given ED (King et al., 1997). All normal\nfood items were withdrawn and patients were maintained\nfor 2 weeks on ED (E 028 Extra, Scientific Hospital Supplies\nInternational, Liverpool, UK), which contains a predigested\nmixture of amino acids, malto-dextrins, minerals and\nvitamins, with a single fat source, rape seed oil. Thus, no\nadditional complex carbohydrate or protein was provided\nfor the gut flora to use as energy substrates other than\nendogenous sources, for example, protein released from\nsloughed cells. Water ad libitum was the only other item\nallowed. The nutritional requirements were individually\ncalculated using the Schofield equation (Schofield, 1985).\nThe efficacy of treatment was assessed on symptoms using\nthe Harvey and Bradshaw index (Harvey & Bradshaw, 1980),\nand by an assay of serum C-reactive protein (CRP) as a\nmeasure of inflammatory stress.\nNone of the UC and IBS patients was given ED. Eleven of\nthe UC patients had received either immuno-modulation or\n5-ASA therapy before this study, and this was continued,\nalbeit with changes in the drugs and increases in the doses\nused. Treatment-naı¨ve patients were placed on similar regi-\nmens. IBS patients received conventional treatment.\nThe Harvey and Bradshaw index and the Walmsley index\nwere used to determine the severity of CD and UC,\nrespectively.\nDNA extraction\nDNA was extracted from each faecal sample (0.2 g) using a\nQIAamp DNA stool Mini Kit (Qiagen) by following the\nmanufacturer’s instructions. Extracted DNA was stored in\naliquots at \u0003 20 1C. DNA quality was assessed by determin-\ning the ratio of A260 nm to A280 nm.\nPCR amplification of bacterial DNA\nTwo subgroups of F. prausnitzii have been identified on the\nbasis of their published whole-genome DNA sequences.\nPrimers Fp.ID.F2 (GTGACCGGATCGAACGACC) and\nFp.ID.R2 (TCCAGGTCATGTGGGCAGC) were designed\nagainst the nucleotidyl transferase gene and the butyryl-\nCoA transferase gene, respectively, using the nucleotide\nsequences of both F. prausnitzii A2-165 and M21\/2. Ampli-\ncons from the two F. prausnitzii subgroups could be\ngenerated simultaneously within a single PCR reaction and\ndistinguished by the fragment length: approximately 650 bp\nfor the A2-165-related subgroup and 778 bp for the M21\/2-\nrelated subgroup. For each PCR amplification, 50 ng of DNA\nwas used as a template with HotStarTaq Plus Master Mix Kit\n(Qiagen) plus 4 mL of Q-solution (Qiagen) according to the\nmanufacturer’s instructions. The reaction conditions were:\ninitial denaturation (5 min at 95 1C), then 35 cycles of\ndenaturation (1 min at 94 1C), annealing (1 min at 58 1C)\nand elongation (1 min at 72 1C) and a final extension\n(10 min at 72 1C).\nFor samples from which F. prausnitzii was not amplified,\nthe quality of the DNA was confirmed using 50 ng of DNA\nas template in a second PCR with the primers 27F (50-AG\nAGTTTGATCATGGCTCAG-30) and 1492R (50-GGTTACC\nTTGTTACGACTT-30) that annealed to bacterial DNA en-\ncoding 16S rRNA gene (Lane, 1991). These primers amplify\na highly conserved region in the DNA from many bacterial\nFEMS Microbiol Lett 310 (2010) 138–144 c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n139Relevance of F. prausnitzii to Crohn’s disease\nspecies in human faeces. The reaction conditions were as\nfollows: initial denaturation (5 min at 95 1C), then 35 cycles\nof denaturation (30 s at 94 1C), annealing (1 min at 55 1C)\nand elongation (2 min at 72 1C) and a final extension (8 min\nat 72 1C). The reaction mixture was the same as stated\nabove.\nQuantification of amplified DNA\nBecause the same amount of template DNA, 50 ng, was\nadded to each PCR, the differing brightness of the bands\non the gel was used as an indicator of the amount of F.\nprausnitzii in each patient. The intensity of the bands was\nmeasured using the software QUANTITY ONE (Bio-Rad) and\nquantified by comparison with known amounts of a 1-kb\nladder (New England Biolabs). The experiment was repeated\nonce. Samples that failed to yield a PCR product were\nreassayed a third or a fourth time, and the quality of the\nDNA was confirmed by amplification of bacterial 16S rRNA\ngene.\nSerum CRP assay\nSerum CRP levels were determined by the Clinical Biochem-\nistry Department, Addenbrookes Hospital.\nStatistical analyses\nThe results were assessed using nonparametric methods.\nThe results of the estimated amount of each subgroup of\nF. prausnitzii DNA generated by PCR amplification for the\nthree patient groups both pre- and post-treatment and the\ncontrol group were analysed separately using Kruskal–Wal-\nlace one-way ANOVA and Dunn’s post hoc all comparisons test.\nTo gain an estimate of the effects of illness on the total\namount of F. prausnitzii, the results for the controls and the\nthree pretreatment samples were ranked first for the M21\/2\nsubgroup (the larger PCR fragment) and then for the A2-\n165 subgroup (the smaller PCR product), and the two\nranking values for each sample were added together to yield\na combined rank value that was regarded as an estimate of\nthe total F. prausnitzii content of the faeces. Post-treatment\nsamples were analysed in the same way. These two new data\nsets were also analysed using the Kruskal–Wallace one-way\nANOVA and Dunn’s post hoc all comparisons. Paired data were\nanalysed using the Wilcoxon signed rank-sum (WSRS) test.\nKruskal–Wallace analyses were carried out initially using the\nMINITABS statistical package. Data were then reanalysed using\nthe INSTAT (Graphpad) program, which was also used for\nDunn’s post hoc all comparisons (but completed only if the\ntwo-tailed P value was o 0.05 in the Kruskal–Wallace\nanalysis), Mann–Whitney tests for unpaired data, the WSRS\ntest for paired data and Spearman r to determine the level of\ncorrelation between parameters.\nResults\nThe results are summarized in Tables 1 and 2. The original\ndata on which these tables are based are available as\nSupporting Information, Tables S1–S3 in the online version\nof this article.\nSubject characteristics\nThe patient groups consisted of 20 patients diagnosed as\nsuffering from CD, 21 patients with IBS and 14 patients with\nUC. They were recruited at Addenbrookes Hospital, Cam-\nbridge, which functions as a tertiary referral centre for\ninflammatory bowel disease. The patients gave a faecal and\na blood sample at the start of the treatment and again 2\nweeks later. In addition, blood and faecal samples were\nobtained from 18 healthy subjects as controls.\nEffects of treatment on the clinical state\nEighty-four per cent of the initial group of CD patients\nreturned to follow-up clinics. The effects of treatment were\nbeneficial, as evidenced by decreases in the Harvey and\nBradshaw scores of individual patients (Po 0.0001; WSRS\ntest). At presentation, all 15 patients whose serum was\nassayed had serum CRP levels above the upper limit of the\nreference range (6 mg L\u00031). Following treatment, there was a\nsignificant decline in the CRP levels (Po 0.05, WSRS test).\nQuantification of F. prausnitzii-specific PCR\nproducts\nBacterial DNA was obtained from each faecal sample. The\nsame amount of faecal DNA was used as a template in PCR\nreactions with the primer pair Fp.ID.F2 and Fp.ID.R2 to\ndetect the presence of F. prausnitzii. Although the total\nquantity of F. prausnitzii PCR products and the ratio of the\ntwo subgroups varied considerably from sample to sample\n(Fig. 1), only a minority of samples failed to yield one or\nboth F. prausnitzii PCR products. The sequences of PCR\nproducts were 100% identical to those of the published\nTable 1. Yields of PCR products related to the two Faecalibacterium\nprausnitzii subgroups from the different patient groups\nGroup N\nA2-165 subgroup M21\/2 subgroup\nMean SD Mean SD\nControl 18 170 135 248 161\nCD before treatment 20 103 103 127 144\nCD after treatment 20 44 74 113 138\nUC before treatment 14 170 147 149 164\nUC after treatment 14 157 162 175 164\nIBS before treatment 21 202 162 246 149\nIBS after treatment 21 180 131 214 111\nN, number of samples; Means, average yield (ng) of PCR product\ngenerated; SD, SD within the sample.\nFEMS Microbiol Lett 310 (2010) 138–144c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n140 W. Jia et al.\nF. prausnitzii genomes A2-165 or M21\/2, and to no other.\nWhen no F. prausnitzii product was detectable, a second\namplification to produce an amplicon from the DNA\nencoding the 16S rRNA gene was always successful, demon-\nstrating that the bacterial DNA extracted was of good\nquality.\nComparison of F. prausnitzii abundance in the\nfaecal samples\nThere were no significant differences in the levels of the A2-\n165 subgroup of F. prausnitzii in the three treatment groups\nat initial presentation and in the control group (Kruskal–\nWallace P= 0.248, adjusted for ties), although the levels for\nCD patients were the lowest of the four groups. There was a\nsignificant difference among the three post-treatment and\ncontrol groups (Kruskal–Wallace P= 0.006, adjusted for\nties), with the levels for the CD group being significantly\nlower than those of the control group (Dunn’s post hoc test\nPo 0.05). For the CD group, the levels had decreased\nsignificantly post-treatment (WSRS test P= 0.0046).\nThe levels of the M21\/2 F. prausnitzii subgroup were\nanalysed similarly. There was a significant difference among\nthe three pretreatment patient groups and the control group\n(Kruskal–Wallace P= 0.029, adjusted for ties), although the\npost hoc test revealed no significant difference when indivi-\ndual groups were compared with each other, despite lower\nvalues for both the CD and the UC samples. However, for\nthis F. prausnitzii subgroup, the levels in the CD patients\nwere significantly lower than those in the control samples, as\njudged by the Mann–Whitney test (P= 0.02). Following\ntreatment, there was also a significant difference in the levels\nof the M21\/2 subgroup among the three patient groups and\nthe control group (Kruskal–Wallace P= 0.034, adjusted for\nties). The levels in the CD group were significantly lower\nthan those in controls (Dunn’s post hoc Po 0.05), although\nthe difference between the pre- and the post-treatment levels\n(median before treatment 77 compared with 65.5 post-\ntreatment) was not significantly different (WSRS P= 0.61).\nThus, the levels of both F. prausnitzii subgroups for\nCD patients either decreased or remained low rather\nthan increased following successful treatment with an\nenteral diet.\nIt is obvious from Fig. 1 that there were wide differences\nbetween the ratios of the levels of the two F. prausnitzii\nsubgroups between patient samples. However, the overall\ntotal levels of each subgroup were similar, and so it was\nappropriate to lend equal weight to the two subgroups to\ncompare the total levels of F. prausnitzii among the patient\nand control populations. The analyses revealed that the total\nlevels of F. prausnitzii in CD patients were significantly lower\nthan those in the other groups both before and after\ntreatment (Kruskal–Wallace test Po 0.005 before treatment\nand o 0.001 after treatment; Dunn’s comparisons for the\nCD group relative to the control group Po 0.05 before\ntreatment; o 0.001 after treatment).\nTable 2. Kruskal–Wallis test for data on the abundance of the Faecalibacterium prausnitzii subgroup in different groups of patients\nGroup N\nA2-165 subgroup M21\/2 subgroup\nMedian Average rank Z value Median Average rank Z value\nControl vs. before treatment 18 178 39.3 0.52 275 43.9 1.60\nControl vs. after treatment 18 178 42.8 1.32 275 45.3 1.90\nCD before treatment 20 77 29.1 \u0003 1.95 77 28.3 \u0003 2.16\nCD after treatment 20 0 23.4 \u0003 3.36 66 26.5 \u0003 2.61\nUC before treatment 14 177 38.4 0.28 110 30.2 \u0003 1.33\nUC after treatment 14 141 38.4 0.27 154 34.9 \u0003 0.42\nIBS before treatment 21 180 41.6 1.18 241 43.9 1.76\nIBS after treatment 21 192 44.1 1.32 197 41.4 1.13\n100 bp ladder\n600 bp \n800 bp \nM21\/2 (778 bp)\nA2-165 (650 bp)\nFig. 1. Relative quantity of Faecalibacterium prausnitzii in faecal DNA determined by PCR. Agarose gel showing bands of the F. prausnitzii amplicon\nfrom 22 faecal samples. The upper band of 778 bp corresponds to the M21\/2 subgroup; the lower 650 bp band corresponds to the A2-165 subgroup.\nThe same amount of template DNA was added to each PCR reaction, and so these differences indicate the relative amount of F. prausnitzii in each\npatient. Where a PCR product was present, the brightness of the band was measured using the software QUANTITY ONE (Bio-Rad) and converted to DNA\namount by reference to a 1 kb ladder (New England Biolabs: right-hand lane).\nFEMS Microbiol Lett 310 (2010) 138–144 c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n141Relevance of F. prausnitzii to Crohn’s disease\nLack of a correlation between the levels of\nF. prausnitzii and clinical assessment\nThe levels of each subgroup of F. prausnitzii in CD patients\nwere analysed for correlation with clinical status, as deter-\nmined by the Harvey and Bradshaw scores, both before and\nafter treatment. The data were assessed using the nonpara-\nmetric Spearman r coefficient. As the r value for the A2–165\nsubgroup was 0.018 (P= 0.3) and r= 0.02 (P= 0.92) for the\nM2\/21 group, neither set of F. prausnitzii levels correlated\nwith clinical status.\nFurther analysis of data from samples from the\nUC patients\nThe data for UC patients before treatment appeared to show\nthat the levels of the F. prausnitzii M2\/21 subgroup were\nlower those than in the control group, but the statistical tests\nused failed to establish that the difference was significant.\nWe therefore used the nonparametric Mann–Whitney test to\ncompare the data for this UC subgroup with the controls. As\nthe resulting P value, 0.087, tended towards, but did not\nconfirm that the difference was significant, this is probably a\ntype 2 error: more data are required for this patient group.\nDiscussion\nPrevious studies have established that Firmicutes are domi-\nnant among the diverse range of butyrate-producing bacter-\nia in the human gut, with five species being especially\nabundant: Eubacterium rectal; Roseburia faecis; Eubacterium\nhallii; an unnamed but cultured species, SS2\/1; and F.\nprausnitzii (Aminov et al., 2006; Louis et al., 2009). The\nreport that the levels of F. prausnitzii in the gut of patients\nwith CD were lower than the levels in healthy subjects was\nbased on analysis of tissue taken from patients undergoing\nelective surgery (Sokol et al., 2008). The current study used\nan alternative way of identifying bacteria present in the\nhuman gut, which was to investigate the bacterial compo-\nnent of faecal samples. However, analysis of faecal DNA in\nthe present study only partially confirmed these earlier\nfindings. Although F. prausnitzii, especially the M21\/2 sub-\ngroup, were less abundant in CD patients at presentation\nthan in the control group, contrary to expectation, success-\nful treatment of the CD group resulted in a decrease rather\nthan an increase in F. prausnitzii abundance. It is an open\nquestion as to whether the treatment received by CD\npatients before attendance at the Addenbrookes clinic might\nhave resulted in the statistically significant decline in the\nfaecal levels of F. prausnitzii: a recent study strongly suggests\nthat this might be the case (Benus et al., 2010). However, the\nsubsequent decline following ED treatment clearly excludes\nthe possibility that recovery might be due to an increase in\nF. prausnitzii levels within the gut and the consequent\nincrease in immuno-suppressive agents secreted by the\nbacteria (Sokol et al., 2008).\nThe causes of CD and other gastrointestinal diseases are\nclearly multifactorial, and it is therefore not surprising that\nthe same is true of mechanisms that protect against disease.\nThe previous report clearly established that the positive\neffect of F. prausnitzii in deterring the recurrence of CD\nfollowing surgery was due to the production of an unidenti-\nfied metabolite other than butyrate (Sokol et al., 2008).\nBacteria generate butyrate during fermentation of lactate,\nbut lactate is also the preferred energy source of many other\nbacteria, including propionibacteria, acetogens and sul-\nphate-reducing bacteria (Macpherson et al., 1996). In the\ncurrent study, patients were treated nutritionally with a\nminimal diet that would decrease the availability of lactate\nand hence also decrease the bacterial flora, including F.\nprausnitzii (Chapman et al., 1994; Costello et al., 1994; King\net al., 1997; Whelan et al., 2005; Johnson et al., 2006). It is\nknown that faecal bacterial dry weight in healthy volunteers\nfed ED declines drastically (Costello et al., 1994). A positive\noutcome following treatment might therefore be due to a\ngreater reduction in the production of toxic, inflammatory\nmetabolites by other bacteria relative to any negative effects\nof a decreased population of butyrate-producing bacteria.\nFor example, decreased availability of lactate would select\nagainst sulphate-reducing bacteria such as Desulfovibrio\npiger, which is abundant in human faeces and the major\nsource of sulphide, which inhibits butyrate oxidation by\ncolonocytes (Pitcher & Cummings, 1996; Roediger et al.,\n1997; Willis et al., 1997; Levine et al., 1998; Loubinoux\net al., 2002; Duncan et al., 2004; Fite et al., 2004; Marquet\net al., 2009).\nThe different results reported in this and the previous\nstudy may have arisen from the differences in the material\nassayed. Normally produced stools, which were used in this\nstudy, represent bacterial populations chiefly along the\ncolon, whereas the surgically resected material in the earlier\nstudy were from higher up the alimentary canal. Bacterial\npopulations in the two sites may well differ. Furthermore,\npatients awaiting surgery may have been given enteral or\nparenteral feeds to improve their state of nutrition or fasted\npreoperatively. If the organism is dependent on dietary\ncomplex carbohydrate, these also could have been factors\nleading to the low numbers of F. prausnitzii reported.\nIn conclusion, the clinical improvement in our patients\nwith CD was associated with a decline in the numbers of F.\nprausnitzii, but this does not mean that the organism can be\nconsidered to be a pathogen responsible for producing CD,\nas it was equally frequent in our healthy volunteers. It is\nmore likely to be an innocent bystander, whose numbers\ndecline with ED feeding, which exerts its effects in CD\nthrough its action on the gut microbial communities\n(Hunter, 1991). We therefore attribute the decrease in the\nFEMS Microbiol Lett 310 (2010) 138–144c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n142 W. Jia et al.\nfaecal F. prausnitzii levels in CD patients following ED to the\nfact that this diet reduces the undigested food residues\nrequired to sustain normal levels of flora in the lower gut,\nparticularly bacteria such as F. prausnitzii. Such a change in\nflora was associated with the marked improvement seen in\npatients’ symptoms and the levels of CRP. We suggest,\ntherefore, that this reduction in gut flora was chiefly\nresponsible for the patients’ improvement.\nAcknowledgement\nThis work was funded by The Wellcome Trust (Grant No.\nWT080238MA).\nAuthors’contribution\nW.J. and R.N.W. contributed equally to this work.\nStatement\nRe-use of this article is permitted in accordance with the\nTerms and Conditions set out at: http:\/\/www3.interscience.\nwiley.com\/authorresources\/onlineopen.html\nReferences\nAminov RI, Walker AW, Duncan SH, Harmsen HJM, Welling GW\n& Flint HJ (2006) Molecular diversity, cultivation, and\nimproved detection by in situ hybridization of a dominant\ngroup of human gut bacteria related to Roseburia spp. or\nEubacterium rectale. Appl Environ Microb 72: 6371–6376.\nBenus RF, Harmsen HJ, Welling GW, Spaniersberg R, Zijlstra JG,\nDegena JE & van der Werf TS (2010) Impact of digestive and\noropharyngeal decontamination on the intestinal microbiota\nin ICU patients. Intens Care Med 36: 1394–1402.\nChapman MAS, Grahn MF, Boyle MA, Hutton M, Rogers J &\nWilliams NS (1994) Butyrate oxidation is impaired in colonic\nmucosa of sufferers of quiescent ulcerative colitis. Gut 35:\n73–76.\nCostello AJ, Murphy JL, Wootton SA, Rucker JT, Kirby GA &\nHunter JO (1994) The effect of elemental diet on stool output\nin irritable bowel syndrome. Proc Nut Soc 53: 223A.\nDuncan SH, Louis P & Flint HJ (2004) Lactate-utilizing bacteria,\nisolated from human feces, that produce butyrate as a major\nfermentation product. Appl Environ Microb 70: 1136–1142.\nFite A, Macfarlane CT, Cummings JH, Kong FC, Furrie E &\nMacfarlane S (2004) Identification and quantification of\nmucosal and faecal desulfovibrios using real time polymerase\nchain reaction. Gut 53: 523–529.\nHamer HM, Jonkers D, Venema K, Vanhoutvin S, Troost FJ &\nBrummer RJ (2008) Review article: the role of butyrate in\ncolonic function. Aliment Pharm Therap 27: 104–119.\nHarvey RF & Bradshaw JM (1980) A simple index of Crohn’s\ndisease activity. Lancet 1: 514.\nHunter JO (1991) Food allergy or enterometabolic disorder?\nLancet 338: 495–496.\nJohnson T, MacDonald S, Hill SM, Thomas A & Murphy MS\n(2006) Treatment of active Crohn’s disease in children using\npartial enteral nutrition with a liquid formula: a randomised\ncontrolled trial. Gut 55: 306–307.\nKing TS, Woolner JT & Hunter JO (1997) Dietary treatment of\nCrohn’s disease. Aliment Pharm Toxicol 11: 17–31.\nLane DJ (1991) 16S\/23S rRNA sequencing. Nucleic Acid\nTechniques in Bacterial Systematics E (Stackebrandt E &\nGoodfellow MN, eds), pp. 115–147. Wiley, Chichester.\nLevine J, Ellis CJ, Furne JK, Springfield J & Levitt MD (1998)\nFaecal hydrogen sulfide production in ulcerative colitis. Am J\nGastroenterol 93: 83–87.\nLoubinoux J, Bronowscki J-P, Pereira IAC, Mougenel J-L & Faou\nAEL (2002) Sulphate-reducing bacteria in human feces and\ntheir association with inflammatory bowel disease. FEMS\nMicrobiol Ecol 40: 107–112.\nLouis P & Flint HJ (2009) Diversity, metabolism and microbial\necology of butyrate-producing bacteria from the human large\nintestine. FEMS Microbiol Lett 294: 1–8.\nLouis P, Young P, Holtrop G & Flint HJ (2009) Diversity of\nhuman colonic butyrate-producing bacteria revealed by\nanalysis of the butyryl-CoA: acetate CoA-transferase gene.\nEnviron Microbiol, in press 12: 304–314.\nMacpherson A, Khoo UY, Forgacs I, Philpott-Howard J &\nBjarnason I (1996) Mucosal antibodies in inflammatory bowel\ndisease are directed against intestinal bacteria. Gut 38:\n365–375.\nMai V & Draganov PV (2009) Recent advances and remaining\ngaps in our knowledge of associations between gut microbiota\nand human health. World J Gastroentero 15: 81–85.\nMarquet P, Duncan S, Chassard C, Bernalier-Donadille A & Flint\nHJ (2009) Lactate has the potential to promote hydrogen\nsulphide formation in the human colon. FEMS Microbiol Lett\n299: 128–134.\nPitcher MCL & Cummings JH (1996) Hydrogen sulphide: a\nbacterial toxin in ulcerative colitis? Gut 39: 1–4.\nRoediger WEW, Moore J & Babidge W (1997) Colonic sulphide\nin pathogenesis and treatment of ulcerative colitis. Digest Dis\nSci 42: 1571–1579.\nSartor RB (2006) Mechanisms of disease: pathogenesis of Crohns\ndisease and ulcerative colitis. Nat Clin Pract Gastr 3: 390–407.\nSartor RB (2008) Microbial influences in inflammatory bowel\ndiseases. Gastroenterology 134: 577–594.\nSchofield WN (1985) Predicting basal metabolic rate: new standards\nand review of previous work. Hum Nutr-Clin Nutr 39: 5–41.\nSmith S, Shaw J & Nathwani D (2008) Nitazoxanide for\ncryptosporidial infection in Crohn’s disease. Gut 57: 1179–1180.\nSokol H, Pigneur B, Watterlot L et al. (2008) Faecalibacterium\nprausnitzii is an anti-inflammatory commensal bacterium\nidentified by gut microbiota analysis of Crohn’s disease\npatients. P Natl Acad Sci USA 105: 16731–16736.\nTazoe H, Otomo Y, Kaji I, Tanaka R, Karaki SI & Kuwahara A\n(2008) Roles of short chain fatty acid receptors, GPR41 and\nFEMS Microbiol Lett 310 (2010) 138–144 c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n143Relevance of F. prausnitzii to Crohn’s disease\nGPR43 on colonic functions. J Physiol Pharmacol 59 (suppl 2):\n251–262.\nvan der Waiij LA, Kroese FG, Visser A, Nelis GF, Westerveld BD &\nJansen PC (2004) Immunoglobulin coating of faecal bacteria\nin inflammatory bowel disease. Eur J Gastroen Hepat 16:\n669–674.\nWhelan K, Judd PA, Preedy VR, Simmering R, Jann A & Taylor\nMA (2005) Fructooligosaccharides and fiber partially prevent\nthe alterations in fecal microbiota and short-chain fatty acid\nconcentrations caused by standard enteral formula in healthy\nhumans. J Nutr 135: 1896–1902.\nWillis CL, Cummings JH, Neale G & Gibson GR (1997)\nNutritional aspects of dissimilatory sulphate reduction in the\nhuman large intestine. Curr Microbiol 35: 294–298.\nYin L, Laevsky G & Giardina C (2001) Butyrate suppression of\ncolonocyte NF-B activation and cellular proteasome activity.\nJ Biol Chem 276: 44641–44646.\nSupporting Information\nAdditional Supporting Information may be found in the\nonline version of this article:\nTable S1. Quantified yields of the two PCR products from\nthe different groups of Faecalibacterium prausnitzii strains in\nindividual patient samples.\nTable S2. Clinical assessment of the patient group with\nCrohn’s disease.\nTable S3. Clinical assessment of the patient group with\nulcerative colitis.\nPlease note: Wiley-Blackwell is not responsible for the\ncontent or functionality of any supporting materials supplied\nby the authors. Any queries (other than missing material)\nshould be directed to the corresponding author for the article.\nFEMS Microbiol Lett 310 (2010) 138–144c\u0002 2010 Federation of European Microbiological Societies\nPublished by Blackwell Publishing Ltd. All rights reserved\n144 W. Jia et al.\n"}