{"doi":"10.1109\/COMST.2008.4483669","coreId":"102360","oai":"oai:epubs.surrey.ac.uk:1819","identifiers":["oai:epubs.surrey.ac.uk:1819","10.1109\/COMST.2008.4483669"],"title":"An overview of routing optimization for Internet traffic engineering","authors":["Wang, N","Ho, KH","Pavlou, G","Howarth, MP"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-04-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1819<\/identifier><datestamp>\n      2017-10-31T14:03:15Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1819\/<\/dc:relation><dc:title>\n        An overview of routing optimization for Internet traffic engineering<\/dc:title><dc:creator>\n        Wang, N<\/dc:creator><dc:creator>\n        Ho, KH<\/dc:creator><dc:creator>\n        Pavlou, G<\/dc:creator><dc:creator>\n        Howarth, MP<\/dc:creator><dc:date>\n        2008-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1819\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Wang, N, Ho, KH, Pavlou, G and Howarth, MP  (2008) An overview of routing optimization for Internet traffic engineering   IEEE Communications Surveys and Tutorials, 10 (1).  pp. 36-56.      <\/dc:identifier><dc:relation>\n        10.1109\/COMST.2008.4483669<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1819\/","10.1109\/COMST.2008.4483669"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"he Internet is currently experiencing a transition from\npoint-to-point best effort (BE) communications toward\na multiservice network that supports many types of\nmultimedia applications, with potentially high bandwidth\ndemand. Thanks to the rapid development of communication\nnetwork hardware, adding physical resources (fast-speed\nswitching and routing elements, high-capacity network links,\netc.) to the existing Internet has become relatively cheap in\nrecent years. Typically, the advent of increasingly high-speed\nlinks has offered opportunities for IP network providers\n(INPs) to adopt a strategy of bandwidth overprovisioning in\ntheir networks. Nevertheless, this approach is currently only\napplicable to the core network, and the demand from sharply\ngrowing customer traffic over the global Internet still cannot\nbe satisfied. The measurement results presented in [1] indi-\ncate that bottlenecks of the Internet backbone are not only\nlocated at interdomain links between autonomous systems\n(ASs), but also within individual domains. Given this informa-\ntion, it is essential for INPs to perform efficient resource opti-\nmization both intra- and interdomain so as to eliminate these\nbottlenecks. Internet traffic engineering (TE) is the process of\nperforming this task. In [2] TE is defined as large-scale net-\nwork engineering for dealing with IP network performance\nevaluation and optimization. A more straightforward explana-\ntion of TE is also given in [3]: “to put the traffic where the\nnetwork bandwidth is available.” Therefore, the nature of TE\nis effectively a routing optimization for enhancing network\nservice capability without causing network congestion. In\ndoing so, typical TE objectives include balancing the load dis-\ntribution and minimizing bandwidth consumption in the net-\nwork. Figure 1 illustrates this with a simple TE example. We\nassume that the bandwidth capacity of each link is 10 Mb\/s,\nand there are three individual customer flows injected at node\nA, heading toward node C. If conventional shortest path rout-\ning is applied, all the customer flows are routed on the direct\nlink A–C, thus causing the link utilization to be as high as 180\npercent (6 × 3\/10). On the other hand, if the three flows are\nrouted through different paths, as shown in Fig. 1b, the total\ntraffic within the network is evenly distributed without causing\nlink congestion. As this example illustrates, routing optimiza-\ntion that uses alternative multiple paths other than conven-\ntional shortest-path-based approaches can be an effective\nmeans to improving the network service capability.\nTwo major issues that have recently received attention in\nTE approaches are quality of service (QoS) and resilience.\nFirst, many of the new multimedia applications not only have\nbandwidth requirements, but also require other QoS guaran-\ntees, such as end-to-end delay, jitter, or packet loss probabili-\nty. These QoS requirements impose new challenges on INPs’\nTE in that the end-to-end QoS demands need to be satisfied\nthrough TE mechanisms. Second, given the fact that network\nnode and link failure are still frequent events on the Internet\n[4], TE solutions have to consider how to minimize the impact\nof failures on network performance and resource utilization.\nIEEE Communications Surveys & Tutorials • 1st Quarter 200836\nT\nS U R V E Y S\nI E E E\nC O M M U N I C A T I O N S\nT h e  E l e c t r o n i c  M a g a z i n e  o f\nO r i g i n a l  P e e r - R e v i e w e d  S u r v e y  A r t i c l e s\nNING WANG, KIN HON HO, GEORGE PAVLOU, AND MICHAEL HOWARTH, UNIVERSITY OF SURREY\nABSTRACT\nTraffic engineering is an important mechanism for Internet network providers\nseeking to optimize network performance and traffic delivery. Routing optimization\nplays a key role in traffic engineering, finding efficient routes so as to achieve the\ndesired network performance. In this survey we review Internet traffic engineering\nfrom the perspective of routing optimization. A taxonomy of routing algorithms in\nthe literature is provided, dating from the advent of the TE concept in the late 1990s.\nWe classify the algorithms into multiple dimensions: unicast\/multicast, intra-\/inter-\ndomain, IP-\/MPLS-based and offline\/online TE schemes. In addition, we investigate\nsome important traffic engineering issues, including robustness, TE interactions, and\ninteroperability with overlay selfish routing. In addition to a review of existing solu-\ntions, we also point out some challenges in TE operation and important issues that\nare worthy of investigation in future research activities.\nAN OVERVIEW OF ROUTING OPTIMIZATION\nFOR INTERNET TRAFFIC ENGINEERING\n1ST QUARTER 2008, VOLUME 10, NO. 1\nwww.comsoc.org\/pubs\/surveys\n1553-877X\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 37\nWe discuss detailed robustness-aware TE solu-\ntions later.\nMany papers have been published in the area\nof routing optimization. As a result, it is by no\nmeans an easy task to classify various TE solu-\ntions, and present a comprehensive and clear sur-\nvey. In this article we classify these TE routing\napproaches according to four orthogonal criteria:\n• From the aspect of traffic optimization\nscope, TE can be classified into intradomain\nTE and interdomain TE.\n• From the aspect of routing enforcement\nmechanisms, TE can be classified into multi-\nprotocol label switchinig (MPLS)-based TE\nand IP-based TE.\n• From the aspect of availability of traffic\ndemand or timescale of operations, TE can\nbe classified into offline TE and online TE.\n• From the aspect of traffic type, TE can be\nclassified into unicast TE and multicast TE.\nAn overall taxonomy of Internet TE is presented in Fig. 2,\nand this article is organized following the structure of this dia-\ngram. The objective of this article is thus to provide a compre-\nhensive survey on routing optimization for all the components\nin the TE hierarchy. The rest of the article is organized as fol-\nlows. We specify the detailed characteristics of different types\nof TE according to Fig. 2. We introduce intradomain TE,\nwhich includes both MPLS- and IP-based routing optimization\nalgorithms. Then we move on to interdomain TE, which we\nfurther divide into inbound and outbound TE. Multicast TE is\npresented, we discuss some important interactions between\ncurrent TE approaches, and we conclude with a summary. It\nis worth mentioning that this survey does not claim to be\nexhaustive, although we attempt not to miss important work\nin the area.\nTRAFFIC ENGINEERING CLASSIFICATIONS\nINTRADOMAIN TE VS. INTERDOMAIN TE\nThe task of intradomain TE is to optimize customer traffic\nrouting between AS border routers (ASBRs) within a single\ndomain. In comparison, interdomain TE deals with the prob-\nlem of optimizing interdomain traffic traveling across multiple\nASs. Interdomain TE mainly focuses on how to select ASBRs\noptimally as the ingress\/egress points for interdomain traffic\nthat travels across the local AS. That is to say, if the traffic\nhas multiple potential ASBRs from which it can enter or leave\nthe local domain, the problem of interdomain TE for an INP\nis: “which ASBR(s) should be used as the ingress\/egress\npoint(s) for routing the traffic through the local network so\nthat the network resource utilization is optimized?” According\nto the control over how traffic enters\/leaves the domain, inter-\ndomain TE can be further classified into inbound TE and out-\nbound TE. Figure 3 presents a simple example to illustrate\nthe difference between intra- and interdomain TE semantics,\nspecifically using outbound TE as an example for interdomain\nTE. We assume that traffic destined to the remote prefix\n20.20.20.0\/24 (AS200) is injected into the local AS (AS100,\n10.10.10.0\/24) via ASBR 10.10.10.3, and both the internal\npeers 10.10.10.1 and 10.10.10.2 can provide a route to AS200\n(i.e., both routers receive reachability information toward\n20.20.20.0\/24 through external Border Gateway Protocol\n[BGP] advertisements). In this scenario the decision to use\nASBR 10.10.10.1 or 10.10.10.2 (or both for load balancing\nwith interdomain multiple paths) as the egress point is the\ntask of interdomain\/outbound TE. Once the egress point has\nbeen selected, say ASBR 10.10.10.1, intradomain TE is then\nresponsible for selecting the best intradomain path between\neach pair of ASBRs in the network. In this simple example,\nintradomain TE attempts to find an optimal internal path (or\nmultiple paths if allowed) from ASBR 10.10.10.3 to ASBR\n10.10.10.1 (e.g., path A or B or both) as well as an optimal\npath C from 10.10.10.3 to ASBR 10.10.10.2.\nDespite their clear difference in definition, intra- and\ninterdomain TE should not be considered independent of\neach other in practice, since the network configuration of one\ncould potentially impact the other. Research has emerged\n■ Figure 1. A simple TE example: a) three traffic flows are routed over a common path, which causes overloading; b) traffic engineering\ndirects the traffic flows onto different paths, thus achieving network load balancing.\nE D\nC\nB\nA\n(a)\n6 Mb\/s\n6 Mb\/s\n6 Mb\/s 10 Mb\/s\n10 Mb\/s\n10 Mb\/s\n10 Mb\/s 10 Mb\/s\n10 Mb\/s\nE D\nC\nB\nA\n(b)\n6 Mb\/s\n6 Mb\/s\n6 Mb\/s 10 Mb\/s\n10 Mb\/s\n10 Mb\/s\n10 Mb\/s 10 Mb\/s\n10 Mb\/s\n■ Figure 2. Hierarchical classification of Internet traffic engineering.\nIntradomain\nUnicast TE Multicast TE\nTraffic engineering\nInterdomain\nMPLS-based\nIP-based\nOffline\nOnline\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nrecently on the interaction between the two types of TE, and\nsome results are presented in [5]. We provide more details on\nthe interaction between intra- and interdomain TE later.\nMPLS-BASED TE VS. IP-BASED TE\nThe concept of traffic engineering was first introduced in\nMPLS-based environments [6, 7]. By intelligently setting up\ndedicated label switched paths (LSPs) for delivering encapsu-\nlated IP packets, MPLS-based TE can provide an efficient\nparadigm for traffic optimization. The most distinct advantage\nof MPLS-based TE is its capability of explicit routing and\narbitrary splitting of traffic, which is highly flexible for both\nrouting and forwarding optimization purposes. However, since\ntraffic trunks are delivered through dedicated LSPs, scalability\nand robustness become issues in MPLS-based TE. First, the\ntotal number of LSPs (assuming full mesh or equivalent) with-\nin a domain is O(N2) where N is the number of ASBRs. This\nmeans that the overhead of setting up LSPs can be very high\nin large-size networks. In addition, path protection mecha-\nnisms (e.g., using backup paths) are necessary in MPLS-based\nTE, as otherwise traffic cannot be automatically delivered\nthrough alternative paths in case of any link failure in active\nLSPs.\nThe first IP-based TE solution was proposed by Fortz et al.\n[8–10]. The basic idea of their approach is to set the link\nweights of interior gateway protocols (IGPs) according to the\ngiven network topology and traffic demand so as to control\nintradomain traffic and meet TE objectives. Unlike MPLS-\nbased TE, which enables dedicated explicit routing for individ-\nual flows, such “fine-grained” path selection cannot be\nachieved in IP-based TE, as the changes of IGP link weight\nmay affect the routing patterns of the entire set of traffic\nflows. More recently, schemes that manipulate BGP routing\nattributes, known as BGP tweaking [11], have also been pro-\nposed for interdomain TE. In this scenario optimized BGP\nrouting is achieved through tuning of routing attributes on a\nper destination prefix basis. In comparison to the MPLS-\nbased approach, these IP-based TE solutions lack flexibility in\npath selection, since explicit routing and uneven traffic split-\nting are not supported. However, the IP-based approach has\nbetter scalability and availability resilience than MPLS-based\nTE, because no overhead for dedicated LSPs is required, and\nalso because traffic can be automatically delivered via alterna-\ntive shortest paths in case of link failure without explicitly pro-\nvisioning backup paths. However, given this type of\nauto-rerouting in the IP-based environment, link failures may\nintroduce dramatic changes to traffic distribution (thus intro-\nducing new traffic congestion) even across multiple domains.\nFor example, [12] indicates that\nlink failures in IGP routing can\nincrease the utilization of other\nlinks, as they have to carry the\nshifted traffic that originally tra-\nversed the broken shortest IGP\npath. In addition, in [13] the\nauthors pointed out that in\nIGP\/BGP routing an intradomain\nlink failure may cause transit traf-\nfic to shift to alternative egress\npoints due to a hot potato routing\neffect. This low TE robustness is in\ncomparison to MPLS-based TE\nschemes, where a single link fail-\nure does not impact other primary\nLSPs unless they are using the\nfaulty link. Table 1 summarizes the\nkey differences between MPLS-based and IP-based TE.\nOFFLINE TE VS. ONLINE TE\nThe third part of our taxonomy is to classify TE as offline and\nonline. The principal difference between offline and online\ntraffic engineering is the availability of a traffic matrix (TM)\nand timescale of traffic manipulation. The concept of a TM\nwas originally associated with intradomain TE, where\ningress\/egress points of traffic are fixed. In this case the over-\nall traffic demand on the network can be represented by a\nmatrix TM, say, with each element t(i, j) of the TM being the\ntotal bandwidth demand of all individual traffic flows (known\nas traffic trunk) from ingress node i to egress node j. Unlike\nintradomain TM, interdomain TM does not specify both\ningress and egress points, as traffic travel across domains may\nenter\/leave an AS through multiple border routers, which pro-\nvides the opportunity for interdomain TE to select optimized\ningress\/egress points.\nIn some scenarios it is possible for an INP to forecast the\ntraffic matrix before routing optimization is performed. Cur-\nrently, there are two principal inputs from which traffic matrix\ncan be forecasted: a service level specification (SLS) and mon-\nitoring\/measurement (e.g., [14, 15]). An SLS is the detailed\ninformation on the agreement negotiated between customers\nand the INP. By aggregating the traffic predicted in SLSs with\nindividual customers, the INP can estimate the overall band-\nwidth demand between each pair of ASBRs. In addition, the\nINP can also apply monitoring\/measurement mechanisms at\nthe network boundary for aiding traffic matrix estimation.\nHaving obtained the traffic matrix for the specific network\ntopology, an INP can perform offline TE (i.e., map optimally\nthe whole traffic matrix onto the physical network). Figure 4\npresents a basic diagram for the offline TE process. One\nimportant issue in offline TE is the average duration between\ntwo consecutive TE cycles, and this period is known as the\nresource provisioning cycle (RPC) [16]. In common practice,\nthe RPC for offline TE is weekly or monthly, depending on\nvarious factors such as the frequency of establishing, modify-\ning, and terminating SLSs with customers. The major weak-\nness of offline TE is the lack of adaptive traffic manipulation\naccording to traffic and network dynamics, such as traffic\nburst and network failures. These uncertainties may make\noffline TE less efficient as the actual traffic pattern might be\ndifferent from what has been forecasted.\nIn some cases an INP might not be able to predict the\noverall TM in advance, and this requires that the INP perform\nonline TE that does not require any knowledge about future\ntraffic demands. In order to rapidly respond to dynamic traffic\nIEEE Communications Surveys & Tutorials • 1st Quarter 200838\n■ Figure 3. Scope of traffic engineering. IntradomainTE considers optimized routing for \neach node pair within the network; for example, path A and\/or B between 10.10.10.3 and\n10.10.10.1. On the other hand, interdomain TE focuses on optimized ASBR selection; for\nexample, the selection of egress point between 10.10.10.1 and 10.10.10.2 for the traffic des-\ntined to AS200.\nA\nB\nC\n10.10.10.2\n10.10.10.3\n10.10.10.1\nAS100\n10.10.10.0\/24\nAS200\n20.20.20.0\/24\nTraffic to\n20.20.20.0\/24\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 39\nfluctuations, online TE is typically performed on a timescale\nof hours or even minutes. A practical concern for INPs to\ndeploy online TE is how to make sure such a dynamic control\nsystem is self-converged without human intervention. General-\nly, the basic task of resource optimization is to optimally\nassign the new incoming traffic one by one so that the possi-\nbility of accommodating further incoming traffic without con-\ngestion can be maximized. Toward this end, online TE\napproaches should make sure that the traffic load is as evenly\ndistributed as possible within the network, so random incom-\ning traffic demand in the future can easily be satisfied. In\nsome cases it is also possible to reroute existing flows in the\nnetwork so as to reserve bandwidth for new and future incom-\ning traffic. However, this rerouting should not involve a signif-\nicant proportion of traffic flows in the network, as competing\nflows might interfere with each other and cause traffic insta-\nbility and service disruption. In addition, due to the uncertain-\nty of the traffic pattern (i.e., the lack of a global view on\noverall traffic conditions), online TE may have difficulties in\nhandling future incoming traffic based on the current network\nstate. To overcome these issues, a promising approach is to\nconsider both offline and online TE together as complemen-\ntary with each other. Specifically, offline TE provides guide-\nlines to the behaviors of its online counterpart, which works as\na more adaptive and local adjustment paradigm that tackles\nevents that are not forecast by offline TE. This feature is\naddressed in more detail later.\nUNICAST TE VS. MULTICAST TE\nThe Internet carries heterogeneous traffic, including both uni-\ncast\/multicast traffic and various types of flows that use overlay\nrouting techniques. In this article we survey not only unicast\nTE but also multicast TE, which is becoming important given\nrecent progress in Internet multicast service development [17].\nCompared to unicast TE, multicast TE is more complicated,\nsince multicast routing is associated with point-to-multipoint\ntree construction. In the literature resource optimization in\nmulticast TE is normally formulated as a Steiner tree related\nproblem with the objective of minimizing bandwidth consump-\ntion. Although their TE problem formulations might be differ-\nent, it should be noted that since IP unicast and multicast\ntraffic can be simultaneously injected into the same physical\nnetwork, TE for both types of traffic should not be done inde-\npendently without an awareness of each other.\nINTRADOMAIN TRAFFIC ENGINEERING\nIn this section we focus on routing optimization algorithms for\nintradomain TE. We first split intradomain TE into MPLS-\nbased and IP-based subsections, and within each of them we\ndiscuss both offline and online TE.\nINTRADOMAIN MPLS-BASED TE\nMPLS is an Internet Engineering Task Force (IETF) stan-\ndardized forwarding scheme. In MPLS traffic is sent along\nexplicit LSPs. An LSP is the path between an ingress label\nswitching router (LSR) and an egress LSR. At the boundary\nof an MPLS domain, LSRs classify IP packets into forwarding\nequivalence classes (FECs) and append different labels for\npacket forwarding within the MPLS domain. The Label Dis-\ntribution Protocol (LDP) [18] is used to distribute label bind-\nings during the setup of an LSP. MPLS is a powerful\ntechnology for Internet TE, as it allows traffic to be forwarded\nonto an arbitrary explicit route, which may not necessarily fol-\nlow the shortest path computed by conventional IP routers.\nTypically, individual flows are aggregated by MPLS-based TE\ninto traffic trunks identified by FECs, which are then carried\non LSPs between ingress and egress routers. In this case the\nconventional shortest-path-based routing infrastructure (e.g.,\n■ Figure 4. Offline traffic engineering.\nTraffic\ncondition\nTopology\ninformation\nNetwork\nconfiguration\nPhysical network\nOffline\nTE\nengine\nMonitoring\nTraffic\nforecast\nSLSes\nTE objectives and policies\n■ Table 1. MPLS\/IP TE comparison.\nMPLS-based TE IP-based TE\nRouting mechanism Explicit routing with packet encapsulation Plain IGP\/BGP-based routing\nRouting optimization Constraint-based routing (CBR) IGP link weight adjustmentBGP route attribute adjustment\nMultipath forwarding Arbitrary traffic splitting Even traffic splitting only\nHardware requirement MPLS capable routers required Conventional IP routers\nRoute selection flexibility More flexible — arbitrary path Less flexible — shortest path only\nScalability (overhead in\nmaintaining network state) Less scalable\nMore scalable, with scalability of underlying routing\nprotocol\nFailure impact on traffic delivery\n(availability)\nHigh (normally need backup paths in case\nof failures) Low\nFailure impact on TE performance Low High\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200840\nOpen Shortest Path First, OSPF) is overridden with MPLS\nexplicit routing tunnels.\nOffline Traffic Engineering — A generalized MPLS routing\noptimization can be formulated as a multicommodity flow\nproblem [19], and can thus be solved using linear program-\nming to yield an optimal solution for routing mechanisms that\nallow arbitrary traffic splitting. However, this approach is\noften regarded as impractical, especially in a large-sized net-\nwork, since the number of LSPs required is potentially huge\ndue to arbitrary traffic splitting. To obtain a more scalable TE\nsolution, traffic splitting has to be limited in scope. An early\nMPLS-based TE approach used simple constraint-based rout-\ning (CBR) [20] without coordination between individual traf-\nfic trunks [21]. A typical CBR algorithm is as follows. Before\nsetting up an LSP for a specific traffic trunk, all the infeasible\nnetwork links (e.g., those with insufficient available band-\nwidth) are removed from the network topology. Shortest path\nrouting (SPR) is then performed on the residual network\ngraph, and the LSP is assigned to this shortest path. The algo-\nrithm repeats the above procedure until all the traffic trunks\nare assigned. This routing algorithm is known as Constrained\nShortest Path First (CSPF). Other routing schemes have also\nbeen proposed to extend SPR, such as Widest Shortest Path\n(WSP) and Shortest Widest Path (SWP) [22, 23], both of\nwhich try to increase the available bandwidth at bottlenecks\nalong the path. By applying WSP\/SWP, not only has the\nunderlying traffic a higher probability of finding a feasible\npath, but also network bottlenecks are avoided by “reserving”\nbandwidth resources for future demands, benefiting other\ntraffic from this more sophisticated routing strategy.\nIn the literature many MPLS-based TE schemes have\naddressed the problem of minimizing the maximum utiliza-\ntion; this approach is often formulated as a linear or integer\nprogramming problem. In [24] TE is investigated using both\nsingle and multiple paths. The authors prove that TE using\nmultiple paths (LSP bifurcation) and arbitrary traffic splitting\nis able to achieve optimal solutions using linear programming,\nwhile integer programming can be applied to MPLS-based TE\nwithout LSP bifurcations.\nWith the development of differentiated services (DiffServ),\nDiffServ-based MPLS-based TE has become a research area\nfor supporting QoS differentiation. DiffServ-MPLS-based TE\nis now supported by both Cisco and Juniper routers, with\nCSPF being the fundamental routing algorithm. In addition,\nmore sophisticated DiffServ aware\/equivalent MPLS-based\nTE schemes have also been proposed in the literature [25–27].\nThe authors of [26] proposed a general framework for intrado-\nmain QoS provisioning through MPLS-based TE in DiffServ\nnetworks. From a routing optimization perspective, the TE\nobjectives are to satisfy the QoS requirements of the traffic\ntrunks and minimize the overall network cost (load). The cost\nfunction is formulated as a convex function of the traffic load\non a per-QoS class basis, and the TE optimization task is for-\nmulated as a nonlinear programming problem. In order to\nfind the optimal solution, the authors apply a general gradient\nprojection method for calculating LSPs. The QoS metrics con-\nsidered in this work include end-to-end delay and loss, both of\nwhich are transformed into unified hop-count-based con-\nstraints. In order to verify whether these QoS requirements\nare met during the optimization process, shortest path adapta-\ntions (e.g., kth shortest paths) are applied on a hop count\nbasis. In [27], a differentiated TE (DTE) solution was pro-\nposed. To solve the path selection problem in DTE, the over-\nall routing optimization is decomposed into two subproblems:\nthe non-convex part of the optimization problem is solved by\na simulated annealing technique, while the convex part is\nsolved using the gradient projection method.\nApart from the pipe model, where LSPs are point-to-point\n(P2P), other papers have also proposed alternative models,\nsuch as the funnel model (multipoint-to-point, MP2P) [28–30]\nand the hose model (point-to-multipoint, P2MP) [31]. The\nadvantage of these alternative models in LSP construction is\nto alleviate the scalability issues in LSP construction and\nmaintenance. In order to reduce the total number of LSPs\nneeded, the authors in [28] proposed a TE scheme using mul-\ntiple MP2P LSPs. Specifically, the proposed approach consists\nof two distinct procedures: MP2P LSP construction and flow\nassignment. During the phase of LSP construction, a set of\npoint-to-point paths is first selected between each\ningress\/egress pair with two constraints: the total hop counts\nof each path should not exceed the threshold that is the hops\nof the minimum hop count path plus a predefined number,\nand at least one path must be node-disjoint with the rest of\nthe path set. If such a path set cannot be found, a path pair is\nselected comprising the minimum hop path and another dis-\njoint path with a second minimum hop count. Thereafter, the\nMP2P LSP design applies binary integer programming on a\nper egress router basis, and merges the preselected point-to-\npoint paths. In the flow assignment phase the task is to map\nthe traffic trunks onto the constructed MP2P LSPs with the\nobjective of minimizing the maximum load. In this work the\ndesign of MP2P LSPs has three distinct advantages: LSP scal-\nability, load balancing, and resilience. In [29] MP2P LSPs are\nused for TE with deterministic end-to-end QoS guarantees. In\naddition, two admission control algorithms are introduced at\nthe packet level, but routing optimization is not much\naddressed in this work. MP2P TE was also studied in [30],\nwhere the scalability issue in MPLS label space is investigated.\nThe basic idea is similar to [28], which attempts to merge\npoint-to-point paths into MP2P LSPs. However, this work\nassumes that the P2P paths are predefined, so the task is only\nto assign each of them to individual MP2P LSPs. From this\npoint of view, routing and resource optimization are not the\nmajor concern in this work.\nA summary of published offline MPLS-based TE work is\npresented in Table 2.\nOnline Traffic Engineering — Online MPLS-based TE can\nbe classified into two categories: dynamically adjusting the\ntraffic splitting ratio among preconstructed static LSPs [32,\n33], and computing dynamic LSPs on the fly for each new\ntraffic trunk demand. MATE [32] is a typical example of the\nfirst category, and its basic operation is to adaptively forward\nincoming traffic onto multiple preconstructed LSPs according\nto probing results from the network core. For this TE\nparadigm, routing optimization is not directly involved, as\ntraffic and resource optimization are achieved through online\nforwarding adaptation. In the rest of this section we restrict\nour focus to the second category of online MPLS-based TE.\nThe CSPF, WSP, and SWP algorithms described earlier\nare the fundamental routing solutions that can be applied to\nonline MPLS-based TE schemes. In DORA [34] the online\nTE solution contains two stages that maximize the ability of\nthe network to accommodate future bandwidth-specified traf-\nfic demands. First, a parameter called path potential value\n(PPV) is computed for each link on a per ingress\/egress node\npair basis. The metric of PPV indicates the frequency with\nwhich each link has been used in the disjoint paths between\ningress\/egress node pairs. In the second stage network links\nwithout sufficient residual bandwidth are removed from the\nnetwork graph, and then a combined weight is calculated for\neach remaining link based on the PPV value and the available\nbandwidth, with a tuning parameter known as bandwidth pro-\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 41\nportion (BWP) for handling the trade-off between the two\nmetrics. Finally, a conventional Dijkstra’s shortest path algo-\nrithm is applied based on the set of defined link weights.\nOne important issue often addressed in online MPLS-\nbased TE schemes is the LSP interference problem [35–38].\nThe authors of [35, 36] noticed that by directly setting up\nLSPs (e.g., using CSPF) without considering the location of\ningress\/egress nodes for incoming traffic trunks, potential con-\ngestion is liable to take place at some critical links that multi-\nple LSPs use. Competition by LSPs on the critical links that\ndo not have sufficient available bandwidth for supporting all\nthe LSP demands is known as LSP interference. Figure 5 pro-\nvides a simple example of this. First, we assume an incoming\ntraffic trunk from ingress node D to egress node G. If this is\nassigned the shortest-path-based LSP (D→E→F→G), future\ntraffic trunks from H to I will be blocked if the residual link\n(E, F) cannot support both demands. In effect, we can find\nfrom the network topology that link (E, F) is critical to the\ntraffic trunks from H to I in that any LSPs from H to I need\nto use that link. In this case a more intelligent strategy is to\nroute the traffic trunk from D to G via an alternative longer\npath (D→A→B→C→G) and reserve the bandwidth on the\ncritical link (E, F) for the future demand from the traffic\ntrunk from H to I. From this example we can see that critical\nlinks are associated with the location of individual\ningress\/egress pairs. Hence, if the location of the ingress\/egress\nnodes for traffic trunks is taken into consideration, the proba-\nbility of LSP interference can be decreased if the LSP con-\nstruction bypasses the critical links. Toward this end, the\nauthors proposed the Minimum Interference Routing Algo-\nrithm (MIRA) to defer high loading on critical links. First,\ncritical links associated with individual ingress\/egress pairs are\nidentified through calculating the maxflow value. Thereafter,\nan ingress\/egress pair specific weight is created for each link,\nbeing an increasing function of its criticality. Finally, conven-\ntional shortest path algorithms are used according to the\nresulting link weights on top of the network graph containing\nonly feasible links that can support the bandwidth demand of\nthe incoming traffic trunk. The authors also implemented a\nsoftware package called Routing and Traffic Engineering\nServer (RATES) [37], which is based on MIRA. In DAMOTE\n[38], decentralized agent for online MPLS-based TE, an algo-\nrithm for computing LSPs with minimization of a given objec-\ntive function under bandwidth constraint is proposed.\nExamples of such objective functions are resource utilization,\nload balancing, and preemption-aware routing. DAMOTE\ncomputes in an efficient way that achieves near-optimal solu-\ntions.\nOnline MPLS-based TE has also been studied in DiffServ\nenvironments for QoS support, a typical example being\nTEAM [39]. The Traffic Engineering Tool (TET) in the\nTEAM framework is responsible for LSP preemption and\nconstruction. First, for each incoming demand, three types of\ncost are considered in the cost function: bandwidth, switching,\nand signaling. The objective of LSP manipulation is to mini-\nmize the overall cost throughout the process, which can be\nachieved by a Markov-process-based decision. There are two\ndistinct LSP operations in TEAM: LSP preemption and LSP\nrouting. LSP preemption allows existing LSPs to be preempt-\ned by newly constructed LSPs with higher priority. To do this,\neach LSP is assigned a priority attribute, which is taken into\naccount when there is competition for resources (i.e., interfer-\nence). Thus, even if an LSP has already been assigned a path,\nit will be rerouted if it has a lower priority attribute than a\nnew LSP that is competing for the shared network resources.\nIn order to avoid frequent LSP switching and thus traffic\ninstability, the proposed preemption policy includes the fol-\nlowing three guidelines: preempt the LSP with the lowest pri-\nority attribute, preempt the fewest number of LSPs, and\npreempt the least amount of bandwidth while satisfying the\ntraffic demand requirement. For LSP routing, the Stochastic\nPerformance Comparison Routing Algorithm (SPeCRA) [40]\nis adopted in TEAM. SPeCRA behaves like a homogeneous\nMarkov chain where the optimal routing scheme is a state of\nthe chain that is visited at the steady state. Specifically, it\nattempts to select adaptively the best routing algorithm from a\nset of candidate schemes, each of which might be suitable for\na specific type of traffic trunk. The same authors also pro-\n■ Figure 5. LSP interference.\nD G\nH I\nA B C\nE F\n■ Table 2. Offline MPLS-based solutions.\nReference Optimization objectives\/metrics Optimization method LSPtype\nApplicable\nenvironment\n[24] Minimize maximum utilization Linear programming P2P Any\n[26] Minimize network cost with QoS constraints Nonlinear programming (gradient projection) P2P DiffServ\n[27] Minimize network cost across multiple classes Simulated annealing + gradient projection P2P DiffServ\n[28] Minimize the number of LSPs and hop counts Heuristic + binary integer programming MP2P Any\n[29] Provide deterministic end-to-end QoS Not available MP2P Any\n[30] Minimize the overhead in LSP labels Not available MP2P Any\n[31] Minimize LSP bandwidth allocation Not available P2MP Any\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nposed a new DiffServ-based LSP preemption policy known as\nV-PREPT that attempts to avoid LSP rerouting [41]. Similar\nto the TEAM scheme, the optimization for LSP preemption\nconsiders multiple criteria, including LSP priority, the number\nof LSPs, and the preempted bandwidth. With V-PREPT, the\ntrade-off between the three criteria can be adaptively tuned\naccording to the policy adopted by the INP. Apart from the\nsimple LSP preemption algorithm, an adaptive version of V-\nPREPT was also proposed for reducing the overhead (essen-\ntially in signaling) introduced by frequent events of LSP\nteardown and rerouting. The basic idea of the adaptation is to\nallow some LSPs with lower priority attributes to have their\nrate allocation reduced so as to accommodate more requests\nin the future. In this case Resource Reservation Protocol with\nTE (RSVP-TE) signaling is responsible for indicating the\nupdated allocation of rate on the static LSP, while there is no\nextra signaling overhead in tearing down and setting up LSPs.\nIn DiffServ-based networks, this adaptive V-PREPT scheme is\nuseful in LSP operations for the assured forwarding (AF) per\nhop behavior (PHB). Given the common practice that the\nexpedited forwarding (EF) PHB is normally used to support\nhard QoS guarantees, bandwidth allocation in AF can be\nmore flexible and dynamic, and the proposed adaptive V-\nPREPT algorithm can be efficiently adopted for this class of\nPHBs. \nSurvivable online TE in MPLS networks has also been con-\nsidered in [42]. Similar to MIRA, this scheme constructs LSPs\ndynamically by applying the shortest path algorithm to the\ndedicated link weight metric that reflects the specific TE\nrequirement. This type of dynamic link metric is based on a\nLost Flow in Link (LFL) function that is used to assign work-\ning routes with local restoration. In LFL the metric of a par-\nticular link reflects the change in the objective function if an\nincremental demand has been (re)routed through or even\nnear that particular link.\nA summary of the existing online MPLS-based TE\napproaches is shown in Table 3.\nINTRADOMAIN IP-BASED TRAFFIC ENGINEERING\nTheoretical Background — The advent of plain IP-based\nTE solutions has recently challenged MPLS-based approaches\nin that Internet traffic can also be effectively tuned through\nnative hop-by-hop-based routing, without the associated com-\nplexity and cost of MPLS. In [43] the authors proved that any\narbitrary set of loop-free routes can be resolved into shortest\npaths with respect to a set of positive link weights that can be\ncalculated by solving the dual of a linear programming formu-\nlation. This implies theoretically that if a network is optimally\nengineered through a set of loop-free explicit LSPs, by setting\nappropriate OSPF\/Intermediate System to Intermediate Sys-\ntem (IS-IS) link weights, this set of LSPs can be transformed\ninto shortest paths according to this set of link weights. As a\nresult, plain IP routers can directly compute this set of paths\nby using Dijkstra’s algorithm, and hence the associated LSPs\nare not necessary anymore. Take the small network in Fig. 6a\nas a simple example (with symmetric weight setting in both\ndirections of each link): The explicit path set {a→c→b,\nb→c→d} are shortest paths if we assign the weight value of 3\nto links (a, b) and (b, d), and set the weight of all the other\nlinks to 1. Nevertheless, there are two major issues that\nrestrict the practical deployment of link weight-optimization-\nbased TE. First, not any arbitrary set of paths can be repre-\nsented into shortest paths according to a set of link weights.\nFor example, if we add another explicit path d→b→c to the\naforementioned path set, as shown in Fig. 6b, these three\npaths cannot be represented simultaneously as shortest paths\nwith any set of link weights, as the two paths b→c→d and\nd→b→c form a path cycle. As a result, these three paths can\nbe enforced with MPLS explicit routing, but not with IGP link\nweight setting. Second, the distinct advantage of MPLS-based\nTE is not only explicit routing, but also arbitrarily unequal\nsplitting of traffic. In this case, even if a set of LSPs can be\nrepresented as shortest paths, it is still not possible to unequal-\nly split the traffic given the underlying OSPF\/IS-IS routers.\nEvolving from [43], [44] presented further analysis on the rel-\nevant issues in shortest path representability. One important\ncontribution from this work is how to prevent unintended\npaths from becoming shortest paths when setting specific link\nweights. The authors argue that the network could suffer from\ntraffic suboptimality if some bad paths are included in the\nshortest path set configured to deliver customers’ traffic.\nECMP-Based Link Weight Optimization — In the Equal\nCost Multipaths (ECMP) mechanism, if there are multiple\nshortest paths with equal IGP link weights toward the same\ndestination, traffic is evenly split onto the next hop routers on\nthese paths. Normally, the forwarding behavior in ECMP is\non a per flow basis rather than a per packet basis to avoid\nout-of-order packet arrival. This multipath approach was first\nadopted and analyzed in the Netscope TE tool [45].\nFortz and Thorup [8–10] claimed that by optimizing\nOSPF\/IS-IS link weights for the purpose of load balancing,\nthe network service capability can be improved by 50–110 per-\ncent in comparison to the conventional configuration of link\nweight setting using inverse proportional bandwidth capacity.\nThe key idea of the proposed algorithm is to adjust the weight\nof a certain number of links that depart from one particular\nIEEE Communications Surveys & Tutorials • 1st Quarter 200842\n■ Table 3. Online MPLS-based TE solutions.\nReference Optimization objectives\/metrics Major LSP computing method Applicableenvironment\n[34] Maximize future traffic demands accommodation with bandwidthguarantees Heuristic (CSPF based) Any\n[35, 36] Minimize LSP interference so as to accommodate maximum futuredemands Heuristic (CSPF based) Any\n[38] Minimize path hop count and improve load balancing Heuristic Any\n[39] Minimize bandwidth, switching and signaling costs The SPeCRA algorithm [40] DiffServ\n[41] Optimize LSP priority, number of LSPs and preempted bandwidth V-PREPT for LSP preemption DiffServ\n[42] Minimize loss of traffic flow Heuristic (kth shortest path based) Any\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 43\nnode so new paths with equal cost are created from this node\ntoward the destination. As a result, the traffic originally trav-\neling through one single path can be evenly split into multiple\npaths with equal OSPF\/IS-IS weights based on ECMP. In gen-\neral, the authors proved that the optimal configuration of\nsuch link weights is NP-hard. Figure 7 provides a simple illus-\ntration of the basic idea of the algorithm. Consider destina-\ntion node t and assume that part of traffic demand going to t\ntravels through an intermediate node x. Fortz and Thorup’s\nstrategy is to split the flow to t going through x evenly along k\nlinks (x, xi), 1 ≤ i ≤ k, from x, if these links (x, xi) belong to the\nshortest path from x to t. This type of “local adjustment”\nneeds special attention, since shifting traffic might incur addi-\ntional congestion to other links. In order to avoid this oscilla-\ntion phenomenon, the authors apply sophisticated Tabu\nsearch for achieving the best load balancing performance.\nReference [46] also proposed a genetic algorithm (GA)-\nbased approach for the same IP-based TE optimization prob-\nlem, and the authors claimed that by properly tuning the GA\nparameters, the resulting performance is very close to that of\n[8–10]. Retvari et al. additionally raised some practical issues\nin OSPF traffic engineering, such as explicit knowledge of link\ncapacity and reasonable range of OSPF link weight values\n[47]. Toward this end, the authors formulated the TE as the\nprime minimum cost maximum throughput problem, and the\nresulting link weight configuration provides a plausible basis\nto build a practical IP-based TE architecture.\nOptimal routing often requires arbitrary traffic splitting.\nInstead of optimizing OSPF\/IS-IS link weights, another TE\napproach for near-optimal network performance is to emulate\nuneven traffic splitting over ECMP paths at the\nedge or core routers. In [48] the authors pro-\nposed a scheme based on the manipulation of a\nsubset of next hops for some routing prefixes; the\nscheme is capable of achieving near-optimal traf-\nfic distribution without any change of existing\nrouting protocols and forwarding mechanisms.\nThe basic idea is as follows. First, optimal link\nweights are calculated based on [43] through lin-\near programming. Second, in order to deal with\nthe requirement of arbitrary traffic splitting, the\nauthors proposed activating only a subset of\nECMP next hops for packet forwarding to the\nselected destination prefix so as to emulate\nunequal splitting of traffic in the MPLS-based\nsolutions. Three different heuristic algorithms\nwere studied for optimally configuring the next\nhop of unicast destination prefixes. This approach\nexhibits a typical strategy of making graceful\ntrade-off between the performance and the over-\nhead associated with the additional configuration\nneeded.\nEdge-Based Link Weight Setting — Wang et al. pro-\nposed in [49] a new OSPF traffic engineering approach\nwithout the necessity of ECMP splitting. Their approach\nis to divide the physical network into several logical rout-\ning planes, each being associated with a dedicated link\nweight configuration. There are two distinct procedures\ninvolved. First of all, the overall external traffic demands\nfrom all customers are partitioned properly into k traffic\nmatrices only at the edge of the network, and each of the\ntraffic matrices is identified by the type of service (ToS)\nor DiffServ code point (DSCP) in the IP header. Second,\nindividual traffic matrices are independently routed over\nthe k planes, each of which has its dedicated link weight\nconfiguration. The basic strategy of this approach is to\nemulate MPLS unequal splitting of flows by partitioning the\noverall traffic demand at the edge of the network so that traf-\nfic within different partitions is delivered through dedicated\nrouting planes. To achieve the best overall traffic distribution,\none of the most challenging tasks is to efficiently assign flows\nto the traffic matrices for different planes. Through simula-\ntions, the authors prove that a fairly small number of overlays\n(k = 2 or 4) can achieve near-optimal TE performance.\nTable 4 presents a brief comparison of the IP-based TE\napproaches.\nOnline IP-Based Traffic Engineering — Unlike offline TE,\nwhich has been extensively studied, there are also few propos-\nals for online or adaptive IP-based TE. Two online TE\napproaches are to change link weights on the fly and to make\nlink weights sensitive to some loading or QoS parameters\n(e.g., to make the link weight a function of link utilization or\ndelay). However, these approaches require the flooding of\nnew link weights throughout the network, which can cause\nroute instability and looping problems during the convergence\nprocess [50].\nAnother online TE approach is to dynamically adjust the\ntraffic splitting ratio according to the network load. Adaptive\nmultipath (AMP) [51] considers multiple nonequal cost paths\nand balances load by optimizing the traffic splitting ratios at\neach router. However, AMP only keeps network available\ninformation to a local scope rather than employing a global\nperspective of the network in each node.\n■ Figure 6. Shortest path representation.\nA B\nC\n1\n1\n3\n3\n1\nD\nA B\nC D\n■ Figure 7. Fortz and Thorup's link weight optimization algorithm.\nxl\nxi\nx t\nxk\nEqual cost path\nEqual cost path\nEqual cost pathTraffic to t\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200844\nINTERDOMAIN TRAFFIC ENGINEERING\nIn this section we introduce interdomain TE, an emerging\ntopical research area that has evolved from its intradomain\ncounterpart.\nThe Internet is a large decentralized internetwork com-\nposed of more than 26,000 ASs or domains by March 2007.\nFrom a business perspective, the relationship between any two\ndomains can be classified into one of the following two types:\n• Transit service (customer-provider relationship): This\ntype of relationship exists commonly between low- and\nhigh-tier INP networks. Low-tier INPs (typically stub\ndomains) purchase transit services from higher-tier INPs\nfor Internet connectivity.\n• Peering: This type of relationship exists commonly\nbetween neighboring INPs that are roughly equal in size\nand at the same tier. The INPs agree to simply exchange\ntraffic without making any payment to each other.\nWe can also classify all the domains in the Internet into\ntwo categories: transit domains and stub domains. Transit\ndomains offer transit services (i.e., interdomain traffic delivery\nacross the Internet). Stub domains, on the other hand, are the\nleaf domains of the AS-level hierarchy. They only send or\nreceive traffic, and do not provide transit services to any other\nAS. In general, the two types of domain have different inter-\ndomain TE objectives. The incentive for transit domains to\nperform interdomain TE is normally to optimize network\nresources so as to maximize their incoming revenue. On the\nother hand, stub domains compose more than 80 percent of\nASs in the Internet, and most of them are multihomed.\nHence, their principal interdomain issue is how to minimize\nthe monetary expense of subscribing to Internet transit ser-\nvices from their INPs.\nAnother dimension for categorizing interdomain TE is\ninbound and outbound TE, which focus respectively on how\nto control interdomain traffic entering or leaving a domain. A\ndomain may only require either inbound or outbound TE, or\nboth, according to its business objectives. For example, a\ndomain that contains popular content providers generates a\nlarge amount of traffic that needs to be sent out of the net-\nwork efficiently, and thus outbound TE is needed. On the\nother hand, domains that have a large number of multimedia\napplication receivers (e.g., Internet TV\/MP3 subscribers) are\ntypically traffic consumers. They therefore need to perform\ninbound TE in order to control traffic injected into their net-\nworks. Finally, since transit domains normally exchange Inter-\nnet traffic between each other, both inbound and outbound\nTE may be required.\nIn the rest of this interdomain TE section we first give a\nbrief introduction to the de facto interdomain routing proto-\ncol, BGP-4 [52], which can be used to perform interdomain\nTE by appropriately adjusting route attributes. Then some\ngeneral guidelines for interdomain TE are presented. We then\ndescribe relevant TE work, classifying it into inbound and out-\nbound TE. Finally, we discuss advanced interdomain TE\nparadigms such as cooperative TE between adjacent domains.\nBGP OVERVIEW\nBGP is the de facto interdomain routing protocol used to\nexchange routing information for the Internet. ASs are inter-\nconnected via dedicated interdomain links or Internet\nexchange points (IXPs). Border routers from different ASs\nexchange routing reachability advertisements through external\nBGP (eBGP) sessions, and these advertisements are also\npropagated to all other BGP speakers within the AS through\ninternal BGP (iBGP) sessions. BGP enables import\/export\npolicies that enable INPs to control interdomain routes rather\nthan always using the shortest AS paths. In the case where a\nBGP speaker receives multiple route advertisements for the\nsame destination prefix, it selects only one of them as the best\npath according to the prioritized path selection process (Fig.\n8), using the attributes associated with each route advertise-\nment as the selection criterion. More specifically, if multiple\nBGP routes are received with the same value of the attribute\nin a higher priority, tie breaking is applied through comparing\nthe attribute in the next priority, as the arrows indicate in Fig.\n8. The best path is then installed in the IP routing table and\nexported to other peers.\nAs described above, interdomain TE can be classified into\ninbound\/outbound TE, and an INP can configure BGP\nattributes to help achieve its TE objectives (Tables 5 and 7).\nFrom Fig. 8, it is obvious that only one single path should be\nselected for a particular destination prefix, because the final\nstep of tie breaking is based on the unique IP address of the\nnext hop of BGP peer. Some vendors have also implemented\nthe BGP multipath functionality. In Cisco’s BGP implementa-\ntion, if the INP chooses to enable BGP multiple paths, the tie\nbreaking criteria in steps 6–7 in the above process are overrid-\nden [53], which means that multiple (up to six) interdomain\nroutes can be installed simultaneously into the BGP routing\ntable for the same destination prefix. Similar to the intrado-\nmain scenario, this BGP multipath functionality provides flexi-\nble mechanisms for the INP to perform load balancing for\ntransit traffic traveling through the network.\nINTERDOMAIN TE GUIDELINES\nInterdomain TE is performed by taking into account the rout-\ning information advertised by adjacent domains. We note that\nthe change of TE configuration in one domain might affect\nthe routing decisions of other ASs nearby, and this can propa-\ngate in a cascaded fashion. This often introduces route insta-\nbility problems across the whole Internet, where a single\n■ Table 4. IP-based TE solutions.\nReference Feasibility Traffic splitting Protocol requirement Configuration complexity Performance\n[43, 44] Theoreticalanalysis only Arbitrary splitting — —\nTheoretically\noptimal\n[8–10, 46] Practical ECMP Plain IGP Conventional IGP link weightsetting\n50–110%\nimprovement\n[48] Practical Selective ECMP Plain IGP Manual configuration of nexthops for some prefixes Near optimal\n[49] Practical Traffic splitting at thenetwork edge\nToS-aware routing with\nmulti-RIB IGP\nConfiguration of multiple sets\nof link weights Near optimal\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nchange of interdomain path may take up to several minutes to\nconverge [54]. As a result, domains may be unable to predict\nwhether their interdomain TE solutions can produce the tar-\nget performance. Thus, interdomain TE should take into con-\nsideration how to preserve its predictability as well as stability\nso as to ensure stable traffic distribution and fast routing con-\nvergence [55]. For this purpose, recent research has proposed\nseveral guidelines for interdomain TE. We summarize the\nguidelines proposed in [54, 56] as follows:\n• Achieving predictable traffic flow changes: The objective\nis to minimize the frequency with which upstream\ndomains need to switch their outgoing traffic to different\ndomains by changing the local BGP configuration. This\nadversely affects the traffic volume entering their net-\nworks.\n• Limiting the influence of neighboring domains: The\nobjective is to minimize the impact on routing decisions\nof neighboring domains. These routing decisions may\ncontain inconsistent route advertisements from adjacent\ndomains, which reduce the operator’s control capability\nover traffic flows.\n• Reducing the overhead of routing changes: If the traffic\nhas to be separately engineered for all address prefixes in\nthe Internet, the configuration overhead is too high to be\nrealistic. To reduce this overhead, the number of destina-\ntion prefixes to be considered should be limited through\nefficient address aggregation.\nIn effect, it is suggested that\nINPs need only engineer the\ntraffic toward a small number\nof popular destination prefix-\nes that account for a large\nportion of Internet traffic\n[56]. This TE strategy allows\nINPs to efficiently control a\nlarge portion of traffic in the\nInternet by considering only a\nsmall number of prefixes.\n• Customer routes preferred:\nReference [54] has shown that\nInternet stability can be\nachieved by imposing a set of\npolicies on individual\ndomains. Thus, global coordi-\nnation among all domains\nacross the Internet is not nec-\nessary. The guidelines pro-\nposed in [54] ensure stable\nTE with fast convergence by\nfavoring routing via customer\ndomains over peer and\nprovider domains. If customer\ndomains are not directly avail-\nable, routing via peer domains is preferred over provider\ndomains.\nOUTBOUND TRAFFIC ENGINEERING\nOutbound TE Mechanisms — A number of mechanisms are\ncurrently known for outbound TE, as shown in Table 5:\n• Setting local preference (Local_pref): The local prefer-\nence attribute has the highest priority in the BGP route\nselection process. The value assigned to this attribute\nindicates the preference on one border router to other\ncandidates as the best egress point. Take Fig. 3 as an\nexample. If the local preference value for the prefix\n20.20.20.0\/24 on the border router 10.10.10.1 is higher\nthan that on 10.10.10.2, the traffic destined for AS 200\nwill use 10.10.10.1 as the egress point in AS 100.\n• Hot potato routing: If multiple routes exist with equal\nvalue of BGP route attributes up to step 5 of the BGP\nroute selection process shown in Fig. 8, the route with\nthe lowest IGP weight from the ingress to the egress\npoint is selected. This scenario is known as hot potato or\nearly-exit routing, which is often adopted by large INPs.\nThe objective of hot potato routing is to send the traffic\nto downstream domains across the core network as\nquickly as possible. By manipulating IGP link weights, an\nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 45\n■ Figure 8. BGP path selection process. The attributes used in BGP path selection are shown\nin the middle box.\nBGP\nrouting table\nInstall route\nBGP routing\ndecision steps\nHighest Local_prefReachable\nto prefix P\nLowest AS_path length\nLowest Origin type\nLowest MED\neBGP over iBGP\nLowest BGP router ID\nReachable\nto prefix P\nReachable\nto prefix P\nOutgoing\nadvertisementReachable\nto prefix P\nIncoming\nadvertisements\n■ Table 5. Mechanisms for outbound inter-domain TE.\nMechanism Description Implementationtechniques Applicable environment\nBGP local preference\n(Local_pref)\nTo select the egress router directly by setting the highest\nBGP local preference value BGP Stub\/transit domains\nHot potato routing To select the egress router with the lowest IGP weight BGP\/IGP Usually transit domains\nExplicit routing\n(MPLS)\nTo select the egress router by establishing explicit paths\nacross domains\nRSVP-TE, BGP\/IGP-TE,\nPCE Stub\/transit domains\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nINP is able to influence egress router selections within\nthe local domain. In Fig. 3 we now assume that all the\nroute attributes are “equally good” (Fig. 8, steps 1 to 5)\nfor both 10.10.10.1 and 10.10.10.2. If the IGP weight of\nshortest path A (between 10.10.10.3 and 10.10.10.1) is\nlower than that of shortest path C (between 10.10.10.3\nand 10.10.10.2), 10.10.10.1 is selected as the egress point\naccording to hot potato routing.\n• Explicit routing (interdomain MPLS): Interdomain MPLS\nenables a domain to enforce traffic to be delivered on the\nexplicit paths to the destination across downstream\ndomains. Thus, domains may establish explicit paths\nthrough their desired egress points to the downstream\ndomains and destinations. Currently, mechanisms support-\ning interdomain MPLS have been proposed and imple-\nmented such as path computation element (PCE) [57].\nOffline Outbound Traffic Engineering — We initially con-\nsider offline outbound TE in stub domains. The authors in\n[58] proposed offline optimization algorithms to distribute the\ntraffic of a multihomed stub domain among multiple down-\nstream INPs. The TE objective is to optimize both monetary\nexpenses and network performance (measured by average\nlatency). The authors found that the optimization of expenses\nand performance are often in conflict. In order to cope with\nthis, they consider an approach that tackles expense and per-\nformance optimization separately and sequentially. First of all,\nthe optimization of monetary expense is performed. This is\nbased on the business operation viewpoint that minimizing the\noverall expense has higher priority than optimizing the net-\nwork resource utilization in stub domains. Based on a per-\ncentile-based charging model, the objective of the optimization\nis to determine the amount of traffic to be sent to each of the\ndownstream INPs so that the total charge is minimized. The\nperformance optimization is then applied to assign the traffic\nto the downstream INPs. As a result, the total latency is mini-\nmized within the constraint of the computed expense. Instead\nof tackling the expense and performance optimization in a\nlexicological importance order, the authors in [59, 60] pro-\nposed a multi-objective evolutionary algorithm to solve a simi-\nlar optimization problem. The aim is to find a compromising\nsolution that is good with respect to all the optimization\nobjectives. As with [58], the metric to be minimized is the\ncharge incurred by the downstream INP, whereas the perfor-\nmance to be optimized is the load balancing across the inter-\ndomain links. In addition to these two objectives, the authors\nalso consider how to minimize the iBGP communication over-\nhead in order to enforce the TE decisions. The authors in [61]\nintroduced an INP subscription problem of subscribing to a\nset of downstream INPs so as to minimize the cost in pay-\nment. The INP subscription problem is different from the\nabove mentioned expense optimization in that the latter\nassumes that the INP subscription decision has already been\nmade; thus, traffic can only be assigned to the subscribed\ndownstream INPs. However, in order to further minimize the\nmonetary expense, a domain may\nhave the freedom to select the opti-\nmal set of downstream INPs from\nall the available candidates and\nthen assign traffic to this set of\nINPs. The INP subscription prob-\nlem is based on a percentile-based\ncharging model and is solved\nthrough dynamic programming.\nThe authors in [62] addressed a\nsimilar INP subscription problem\non top of a total-volume-based\ncharging model. Their work goes one step further: the chosen\ndownstream INPs also need to provide end-to-end bandwidth\nguarantees toward the destination domains. The problem is\nsolved by a GA-based approach.\nWe now describe a number of schemes that focus on tran-\nsit domain TE issues. The BGP TE approach proposed by\nBressoud et al. [63] was the first piece of work dealing specifi-\ncally with outbound interdomain TE for transit domains. The\nobjective of the TE problem is to determine an optimal set of\negress points for the advertisement of destination prefixes so\nas to minimize the traffic cost (i.e., bandwidth consumption)\nwhile satisfying the bandwidth capacity constraints of the\ninterdomain links. The outbound interdomain TE problem is\nfurther subdivided into two parts: single egress selection\n(SES) and multiple egress selection (MES). SES ensures that\none and only one egress point is selected for each destination\nprefix, whereas MES allows multiple egress points. Two\nheuristic algorithms, combining the approximation algorithm\nproposed for the generalized assignment problem (GAP) with\na simple greedy heuristic, were proposed to solve the SES and\nMES problems. Finally, the authors in [64] proposed an open\nsource tool, called Tweak-it, for outbound interdomain TE in\nlarge transit domains. The authors in [65] extended outbound\ninterdomain TE to support end-to-end bandwidth guarantees\nacross transit domains. Their work is based on the MESCAL\ncascaded model that allows negotiations between adjacent\ndomains and achieves bandwidth guarantee by establishing\nINP-level service level agreements (SLAs) [66]. As Fig. 9\nshows, each domain offers its upstream neighbor (through\nprovider SLAs) a guaranteed bandwidth (o-BW) toward each\ndestination aggregate prefix (Dest). Each SLA is associated\nwith the amount of available bandwidth that is guaranteed\nfrom the offering downstream domains to the destination\ndomains. In order to provide end-to-end bandwidth guaran-\ntees for the traffic, the outbound interdomain TE problem has\nbeen extended for finding not only an optimal egress point\nthat maintains the capacity constraints of interdomain links\nand SLAs, but also the paths within the network to satisfy the\ntraffic demand requirement. In [65] the TE objectives are to\nminimize the total bandwidth consumption and balance the\nload over intra- and interdomain links. The authors in [67]\nproposed an interdomain TE system for provisioning end-to-\nend delay guarantees in addition to meeting bandwidth\nrequirements.\nOnline Outbound Traffic Engineering — In the literature,\nonline outbound TE schemes have only focused on stub\ndomains. They can be classified into the following two types:\n• Proactive: These TE solutions rely on traffic predictors to\nforecast traffic for a short time interval (e.g., minutes)\nand then run a lightweight TE algorithm in a quasi-\noffline manner to produce solutions in a short timescale.\n• Reactive: These TE solutions are adaptive and dynamic\nto incoming traffic demand without traffic prediction\nbeforehand.\nIEEE Communications Surveys & Tutorials • 1st Quarter 200846\n■ Figure 9. Cascaded model for end-to-end bandwidth guarantee.\no-BW2\nSLA3-2\nAS3\no-BW1\nSLA2-1\nAS2 AS1\no-BWX - Offered bandwidth from AS X\nSLAX-Y - Service level agreement from AS X to AS Y\nDest\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 47\nIn [58] the authors proposed proactive online algorithms\nfor multihomed domains to select appropriate INPs for out-\nbound traffic. The objective is to minimize first the total\nexpense and then the end-to-end latency. The approach to\nshort-term traffic forecast is based on the exponentially\nweighted moving average (EWMA) method. In this scenario\ntraffic prediction is performed through detecting traffic\nchanges based on a sequence of independent preceding obser-\nvations. The proposed online TE algorithm is a greedy heuris-\ntic based on traffic sorting, which has also been used for\nsolving the bin-packing problem [68]. Another proactive\nonline TE approach was addressed in [69]. The authors\ndesigned a systematic BGP-based outbound TE technique for\nstub domains over the timescale of minutes. Apart from the\nTE objectives considered in [58, 69] also investigated how to\nminimize the overhead of the associated iBGP message adver-\ntisements. A quasi offline multi-objective evaluation algorithm\nwas proposed to solve the online outbound TE problem.\nFor reactive TE paradigms, the first work on quantifying\nthe benefits of dynamic route selection with multihoming was\nproposed in [70]. The multihomed domain under considera-\ntion may subscribe to multiple downstream INPs, and it also\nmeasures the end-to-end path performance (turnaround\ndelay) through each downstream INP toward the destination.\nBased on the performance obtained from measurement, the\ndomain dynamically switches traffic to the INP that has the\nbest instant performance. Compared to random selection of\nINPs, the measurement-based multihoming approach can\nachieve a 40 percent performance improvement in terms of\nthe average turnaround delay. Based on this approach, the\nauthors in [71] proposed a round-trip time (RTT) measure-\nment approach for outbound route selection. The proposed\napproach is scalable and does not require RTT measurements\nvia each INP to individual large numbers of destinations.\nTo summarize the outbound traffic engineering schemes in\nthis section, we list and compare in Table 6 the major charac-\nteristics of the solutions presented in this subsection.\nINBOUND TRAFFIC ENGINEERING\nInbound TE Mechanisms — In this section we first provide\nan overview of available mechanisms for inbound TE. As with\noutbound TE, although there are various candidate imple-\nmentation mechanisms, inbound TE routing optimization\nalgorithms have only used a few of them (e.g., AS path\nprepending.) Nevertheless, we list all of the potential mecha-\nnisms in Table 7 based on which inbound TE can be per-\nformed.\n• Selective advertisement. In this approach routes toward a\ndestination prefix are only advertised through a set of\nchosen ingress links. We take Fig. 10 as an example. If\nAS300 would like to receive traffic from AS400 via\nASBR 30.30.0.1 heading toward AS301, it chooses not to\nadvertise the route to AS301 through ASBR 30.30.0.2.\nHowever, the shortcoming of this approach is that if the\nchosen ingress point fails, no alternative routes can be\nused as backup.\n• More specific advertisement. In this approach, if multiple\nroutes exist toward the same destination, the one with\nthe longest matching prefix will be selected. In Fig. 10 we\nassume AS300 advertises to AS400 the reachability of\ndestination prefix 30.30.0.0\/16 on 30.30.0.1, and its sub-\nprefix 30.30.30.0\/24 on 30.30.0.2. As a result, the traffic\ntoward any destination in “nested” AS301 will not use\n30.30.0.1, as the other ingress router has a route with a\nmore specific prefix. Compared to selective advertise-\nment, this type of ingress point selection is more robust\nin case of link failure. If the interdomain link attached to\n30.30.0.2 breaks, the traffic toward AS301 can still be\nrouted via 30.30.0.1 using the route with a more coarse-\ngrained prefix. It is worth mentioning that advertising too\nmany specific prefixes may cause the scalability problem\nin terms of increase in BGP routing tables, which is the\nmain reason this approach is not commonly considered\nfor interdomain TE.\n• AS path prepending. A route advertisement is made less\nattractive to upstream domains by adding several instances\nof AS number to the AS path attribute to inflate the AS\n■ Table 6. Outbound traffic engineering approaches.\nReference Optimization objectives\/metrics TE semantics Implementationtechniques\nApplicable\nenvironment\n[58] Minimize overall expenses and end-to-end latency Offline\/online Not specified Stub\n[59, 60] Minimize overall expenses, improve inter-domain load balanc-ing and minimize BGP communication overhead Offline Local_pref Stub\n[61] Minimize overall expenses Offline Not specified Stub\n[62] Minimize overall expenses and provide end-to-end bandwidthguarantee Offline Not specified Stub\n[63] Minimize network cost (e.g., bandwidth consumption) Offline Local_pref, AS path Transit\n[65] Minimize network cost and provide end-to-end bandwidthguarantee Offline Not specified Transit\n[69] Minimize overall expenses, improve inter-domain load balanc-ing and minimize iBGP communication overhead Online Local_pref Stub\n[70] Turn-around delay Online Not specified Stub\n[71] Round Trip Time (RTT) Online Local_pref Stub\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200848\npath length of that route. In Fig. 10, if AS300 would like\nto receive traffic from AS400 toward AS301 via ingress\npoint 30.30.0.1, it may prepend its own AS number in the\nadvertisement on 30.30.0.2 such that the overall AS path\nvia this ASBR is made “longer” than via 30.30.0.1. It\nshould be noted that this is only possible if AS400 does\nnot apply the Local_pref metric to select the preferred\nroute. Related work on and performance evaluation of\nAS path prepending can be found in [72–74].\n• Setting Multi-exit Discriminator (MED) value. This\napplies only if two adjacent ASs have two or more direct\nconnections between them, and both ASs agree to imple-\nment MED. In these circumstances a domain may select\nits preferred ingress router by assigning a lower MED\nvalue. Consider the example of Fig. 10; if AS300 would\nlike to receive traffic from AS400 via 30.30.0.1, it may\nadvertise a BGP route with a lower MED value through\nthis router than the one on 30.30.0.2. The prerequisite\nfor using the MED metric for ingress point selection is\nthat all the route attributes with higher BGP route selec-\ntion priority for the two routes should be set equal (e.g.,\nthe Local_pref metric set internally by AS 400 and the\nAS path length via the two border routers).\n•Community attribute. In this approach a route can be\nadvertised associated with the community attribute that\ninstructs upstream domains how to manipulate this route\nwith certain actions. For example, AS path prepending\ncan be included in the community attribute to instruct\nupstream domains to perform AS path prepending\nbefore sending route adver-\ntisements to their specific\nupstream domains [75, 76].\n• NAT address translation. This\napproach manipulates Net-\nwork Address Translation\n(NAT) tables [77, 78]. The\nNAT rules associate destina-\ntion prefixes with the best\ningress point such that the\nsource address in packets for\nthe destination is translated to\nthe address of the chosen\ningress point.\n• BGP overlay. An overlay poli-\ncy control architecture (OPCA) has been proposed to\nseparate the policy from routing so that a faster channel\ncan be used to handle routing policy changes [79]. OPCA\nconsists of several major components including policy\nagent and database, measurement infrastructure, mes-\nsage propagation, and so on. The aims of OPCA are to\nsolve the BGP convergence problem by improving route\nfailover time and to balance the inbound traffic load for\nmultihomed domains.\nOffline Inbound Traffic Engineering — In [80] the authors\naddressed an offline inbound interdomain TE problem by\noptimizing AS path prepending for stub domains. The prob-\nlem is called constrained optimal prepending (COP). The\nobjective of COP is to determine the minimum number of\nprepended ASs for each prefix advertised through each\ningress link such that the load constraint on each ingress link\nis satisfied. An essential assumption in this work is that the\ninbound route selection at the local domain is not affected by\nthe setting of the Local_pref attributes in its upstream\ndomains. This is because, if Local_pref is used, the upstream\ndomains may send the traffic through another path toward the\nlocal domain using different ingress links. As a result, this\nmakes the effect of AS path prepending hard to predict. An\nOptimal Padding Vector (OPV) heuristic algorithm is pro-\nposed for solving the COP problem. The basic idea of the\nOPV algorithm is first to identify the most overloaded ingress\nlink at each time, and then to increase the AS path length by\none of all customer prefixes to be advertised through the\n■ Figure 10. Inbound traffic engineering examples.\nAS400\n40.40.0.0\/16\nAS300\n30.30.0.0\/16 AS30130.30.30.0\/24\nTraffic  to\n30.30.30.0\/16\n30.30.30.1\n30.30.30.2\n■ Table 7. Mechanisms for inbound interdomain TE.\nMechanism Description Implementationtechniques\nApplicability\nenvironment\nSelective advertisement Advertise a route only at the set of ingress points that is expectedto receive traffic BGP Stub\/transit\nMore specific advertisement Advertise routes with more specific prefixes to suppress thecoarse-grained ones BGP Stub\/transit\nAS path prepending Inflate the length of the AS path attribute to reduce the attrac-tiveness of the route BGP Stub\/transit\nLowest MED value Advertise preferred routes with the lowest value of MED BGP Stub\/transit\nCommunity attribute Suggest to adjacent domains how to manipulate the advertisedroutes BGP Stub\/transit\nNetwork address translation Modify the packet headers by assigning the desired ingress pointas the source of packets NAT Usually stub\nBGP overlay Direct communication between any two domains bypassing BGP User specified Stub\/transit\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 49\ningress link. The algorithm iterates until the traffic load\nreceived by each ingress link satisfies its maximum load con-\nstraint.\nOnline Inbound Traffic Engineering — In [72] the authors\nproposed a systematic and automated procedure named Auto-\nPrepend to control inbound traffic using AS path prepending.\nThe basic operation of AutoPrepend is to artificially inflate\nthe length of the AS path attribute in order to divert traffic\nonto different ingress links until the outcome network perfor-\nmance meets the TE goals. AutoPrepend is composed of four\ncomponents:\n• Passive measurement: To identify a set of top senders\nresponsible for most of the inbound traffic.\n• Active measurement: To send ICMP echo requests to the\nset of top senders and record the ingress links that\nreceive the ICMP replies. A virtual beacon prefix with\ninflated AS path length on one of the ingress links is sent\nto the set of top senders. The ingress links where the top\nsenders respond to the beacon prefix are examined.\n• Traffic prediction: Based on passive and active measure-\nment, to predict the changes in the traffic volume on\neach ingress link when AS path length increases. This is\naccomplished by comparing the measurements from the\nICMP requests and the beacon prefixes described above.\n• AS path update: To check if the predicted outcome satis-\nfies the traffic engineering goals. If so, enforce the\nchange by advertising the prefixes with the chosen AS\npath length.\nThe authors in [73] proposed a greedy AS path prepending\nheuristic algorithm to apply the above mentioned algorithm to\nthe most heavily (or least) loaded ingress link and then virtu-\nally inflate (or decrease) the AS path length of the routes\nthrough the link by one until the TE goals are met.\nIn [78] the authors proposed the use of the NAT-based\napproach to control inbound traffic through the best ingress\npoint. The instantaneous performance of the connected\ningress points is continuously measured through active or pas-\nsive measurement methods. The ingress link that gives the\nbest performance is then selected for a given transfer.\nA summary of the existing inbound TE work is presented\nin Table 8.\nCompared to the outbound scenario, BGP-based inbound\nTE is more difficult for INPs to put into practice. This is gen-\nerally because the BGP routing attribute used for outbound\nTE (Local_pref) can always “suppress” those attributes used\nfor inbound TE (e.g., AS path and MED). Let’s take Fig. 10\nas an example again. If AS300 decides to receive traffic from\nAS400 via 30.30.0.1 through either AS path prepending or set-\nting appropriate MED values, AS400 can still force the traffic\nto be injected into the downstream domain through 30.30.0.2\nby setting higher Local_pref on this border router. Given the\nsituation that individual INPs may have different or even con-\nflicting routing policies, it is not surprising that this happens\nfrom time to time in the Internet. To solve this problem,\ncooperative TE between adjacent domains have been pro-\nposed, which are described in the following section.\nCOOPERATIVE INTERDOMAIN\nTRAFFIC ENGINEERING\nSince most domains in the Internet are self-governed entities\nand are effectively in competition with each other for cus-\ntomers, it is natural that they perform interdomain TE indi-\nvidually without considering their neighbors. However, recent\nresearch has found that when adjacent domains perform their\ninterdomain TE selfishly, not only is the global network per-\nformance not optimized, but also the interdomain TE strate-\ngies of each domain may adversely affect each other [81]. In\nthis case routing instability may occur, as domains need to\nchange their path selection strategies whenever the TE deci-\nsions of their adjacent domains change. Such instability is pri-\nmarily due to interdomain TE policy conflicts between\ndomains. A desirable way to achieve overall good TE perfor-\nmance is to encourage INPs to negotiate with each other in\norder to obtain a compromising solution that benefits them\nall. This is known as cooperative-based TE [82].\nCooperative-based TE relies on the negotiation between\ntwo adjacent domains to achieve an agreement on how traffic\nis routed between their networks. The TE objectives of the\nadjacent domains should be jointly considered in order to\nachieve a “win-win” agreement that is satisfied by participat-\ning domains. Such an agreement can be determined through\nintelligent optimization methods, taking into consideration the\ntopologies, TE objectives, and traffic matrices of the two\ndomains.\nCompared to the existing effort on independent outbound\nand inbound TE, a very limited number of papers have inves-\ntigated routing optimization using cooperative TE. In [83] the\nauthors formulated an optimal peering problem for two\ndomains that have agreed to establish peering relationships.\nThe problem is to determine how many peering points are\nneeded and how they are located such that the total cost of\npeering is minimized without compromising interdomain ser-\nvice quality. With the peering point fixed, traffic is routed\nthrough the agreed ingress and egress points. A similar opti-\nmal peering problem has also been formulated in [84]. Most\nrecently, cooperative interdomain TE schemes have also been\naddressed using game theory and nonlinear programming\n(specifically Nash bargaining and dual decomposition tech-\nniques) [85].\nApart from the optimal peering problem, the authors in\n[86] proposed using IP tunneling to establish explicit paths\nbetween source and destination domains through the ingress\nlinks that are chosen to receive traffic. This approach is\nassumed valid in the environment where all network domains\nare cooperative. In addition, the authors in [87] proposed an\n■ Table 8. Inbound traffic engineering solutions.\nReference Optimization objectives\/metrics TE semantics Implementationtechniques\nApplication\nEnvironment\n[72] Minimize link congestion and foresee performance impact Online AS path prepending Stub\n[73] Improve load balancing Online AS path prepending Stub\/Transit\n[78] Reduce traffic request response time Online NAT Stub\n[80] Minimize the number of prepending with the bandwidthconstraint of ingress links Offline AS path prepending Stub\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200850\nalgorithm for optimal route control among a group of cooper-\native multihomed stub domains in order to reach a global TE\nsolution that avoids oscillation caused by any conflict on TE\nobjectives between domains.\nMULTICAST TRAFFIC ENGINEERING\nThe problem of how to optimally engineer multicast traffic is\nfar less well understood than unicast TE. A common objective\nof multicast TE is to minimize the total amount of bandwidth\nto be consumed. This objective is also known as bandwidth\nconservation, where conventional shortest-path-based routing\nparadigms are normally not optimal solutions. In the litera-\nture bandwidth conservation in multicast routing is formulat-\ned as the directed Steiner tree problem [88], which has been\nproved to be NP-hard. It is worth mentioning that the task of\nmulticast TE is not necessarily identical to the classic Steiner\ntree problem. For example, apart from bandwidth conserva-\ntion, there are also some other TE objectives such as load bal-\nancing and maximizing throughput.\nMPLS-BASED MULTICAST TRAFFIC ENGINEERING\nThe most straightforward approach to MPLS-based multicast\nTE is to set up P2MP LSPs, and this is where Steiner tree\nalgorithms play a role. Before considering individual multicast\nTE schemes, we first investigate how to aggregate multicast\ntraffic from different groups, which is an important procedure\nprior to LSP computation. This issue was first addressed in\n[89], and a scheme known as Aggregate Multicast was pro-\nposed. In this scheme multiple multicast groups are forced to\nshare one single P2MP LSP, even if the egress router set of\nthese groups does not completely overlap. At the expense of\nsome extra bandwidth consumption, this approach is able to\nsignificantly reduce the total number of LSPs needed, thus\nimproving scalability.\nIn [90] the authors proposed the Edge Router Multicast-\ning (ERM) scheme for setting up P2MP LSPs only at the\nboundary of an MPLS domain. In ERM multicast traffic\naggregation in LSPs is confined to the network edge; thus,\nthe task is reduced to unicast TE within the domain. The\nauthors studied two types of ERM: the first scheme is based\non modifications to the existing multicast protocols, while the\nsecond approach applies a Steiner-tree-based routing heuris-\ntic at edge routers.\nApart from an offline approach, online multicast traffic\nengineering has also been investigated, where future multi-\ncast sessions are not known a priori. In [88] Kodialam et al.\nextended their MPLS-based online unicast TE scheme [36] to\na multicast semantic. The basic objective is to accommodate\nas many multicast routing requests as possible without know-\ning about any incoming traffic in advance. The authors pro-\nposed a directed Steiner-tree-based online multicast routing\nalgorithm for computing dynamic multicast trees with mini-\nmum bandwidth interference between individual sessions.\nIP-BASED MULTICAST TRAFFIC ENGINEERING\nDespite theeir flexibility, explicit-routing-based TE\napproaches suffer from the complexity and cost associated\nwith MPLS deployment. This problem becomes more serious\nin supporting multicast services, as P2MP (other than point-\nto-point) LSPs need to be maintained throughout the net-\nwork. Compared to the unicast scenario, another difficulty in\nMPLS multicast TE is how to aggregate multicast flows,\nbecause different multicast sessions tend to have different\negress routers attached to group members. As described\nabove, this problem was addressed in the Aggregate Multi-\ncast scheme [89], but the associated scalability issue is still\nleft open for further investigation. Naturally, one might won-\nder if it is also possible to engineer multicast traffic without\nMPLS enforcement (e.g., by using plain IP based paradigms).\nThe answer is yes, but the number of relevant publications\nhas been very small. The reason for this situation can be\nsummarized as follows. First, Protocol Independent Multi-\ncast - Sparse Mode (PIM-SM) [91] uses the underlying IP\nunicast routing table for the construction of multicast trees,\nand hence it is difficult to decouple multicast TE from its\nunicast counterpart. Second, the enforcement of Steiner\ntrees can be achieved through packet encapsulation and\nexplicit routing mechanisms such as MPLS tunneling. How-\never, this approach lacks support from hop-by-hop protocols,\ndue to reverse path forwarding (RPF) in the IP multicast\nrouting protocol family. In PIM-SM, if multicast packets are\nnot received on the shortest path through which unicast traf-\nfic is delivered back to the source, they are discarded so as\nto avoid traffic loops. Given the difference between the\nshortest path tree used by PIM-SM and the optimized mini-\nmum hop Steiner tree, engineered multicast traffic for band-\nwidth optimization through Steiner tree heuristics could\nresult in RPF check failure.\nThe authors in [92] first stated that the theorem proved in\n[43] can also be applied to P2MP routes. This implies that a\nset of loop-free Steiner trees can also be represented theoreti-\ncally in shortest path trees with a proper set of link weights.\nThus, it is also possible to engineer multicast trees into Stein-\ner trees for bandwidth conservation purposes without IP layer\nRPF check failure. However, the authors did not propose how\nto achieve this type of tree representation in their work. To\nfill this gap, the authors of [93] proposed a GA-based\napproach to optimize PIM-SM multicast trees with bandwidth\nconstraint by setting properly the underlying IGP link weights.\nThe objective is to achieve bandwidth conservation and load\nbalancing through tuning the link weight of multitopology-\nenabled IGP (MT-IGP) protocols such as M-ISIS [94] and\nMT-OSPF [95]. The most distinct advantage of these two pro-\ntocols is that they allow multiple sets of link weights for the\nsame physical topology, with each corresponding to a specific\ntype of traffic. In this scenario multicast TE can be effectively\ndecoupled from its unicast counterpart given the underlying\nMPLS-free environment. Figure 11 illustrates a simple exam-\nple of how to conserve bandwidth in multicast routing by con-\nfiguring optimized M-ISIS\/MT-OSPF link weights. In this\nexample the single multicast source is node A, and nodes E,\nF, and G are multicast group members. By conventional hop\ncount shortest-path-based PIM-SM routing, the bandwidth\nconsumption is 6 units, with 1 unit consumed on each on-tree\nlink. However, with proper link weight setting for MT-IGP,\nthe optimal multicast tree for the same group is in effect a\nSteiner tree in terms of hop counts, with only 4 units of band-\nwidth being consumed (Fig. 11b). In general, the practical\napproach is to optimize multiple multicast trees with only a\nset of MT-IGP link weights.\nSOME TRAFFIC\nENGINEERING CONSIDERATIONS\nIn this section we discuss some important issues that need to\nbe considered in routing optimization for advanced TE,\nspecifically TE robustness, TE interactions, and interoperabili-\nty between TE and overlay selfish routing.\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 51\nTE ROBUSTNESS\nMost of the offline TE solutions described in this article are\nbased on the assumption that TMs are accurate and the net-\nwork is operating under normal conditions. However, to\nderive accurate TMs is far from trivial due to the dynamic\nnature of Internet traffic. Moreover, failures, in particular log-\nical ones, often occur in core networks. As a result, traffic\nfluctuation and network failure may cause TE performance to\nbe unpredictable, and thus make network management more\ncomplicated. Hence, it is necessary to make TE more robust\nin order to maintain the expected performance when any of\nthose situations take place. Apart from achieving the expected\nperformance, another advantage of this robust approach is\nthat only one relatively stable network configuration is needed\nwithout frequent changes in response to the occurrence of any\nunexpected situation.\nIn the literature robust TE has considered two issues: link\nfailure and traffic demand uncertainty. The idea of the robust\nTE approach is first to model these issues as separate scenar-\nios. For example, each link failure or TM represents a distinct\nscenario. Thereafter, a single TE configuration is produced\nthat performs well in any given scenario.\nAs for the case of intradomain link failure, which has been\nfound to be common and transient, [4, 12, 96–99] proposed\nIGP link weight setting algorithms to achieve the desired per-\nformance at any single link failure scenario. However, the\ncomputational complexity of algorithms increases significantly\nas the number of links in the network gets larger. In order to\nreduce such complexity, [12] further suggested performing\nrobust TE optimization only on the critical links that have a\nsignificant impact on overall network performance. Recently,\nmultitopology IGP link weight setting for robust intradomain\nTE has also been proposed [99]. The idea is that traffic can be\nshifted to alternative IGP topologies (hence alternative IGP\npaths) in order to retain load balancing once link failures are\ndetected. For MPLS, the authors of [100] considered com-\nbined working and backup LSP optimization for all traffic\ndemands. Specifically, a proactive ingress-to-egress restoration\nscheme with resource reservation was studied. The objective is\nto maximize the network’s ability to carry future demands.\nThrough this MPLS-based TE, the traffic carried over the net-\nwork is fully restorable against all single event failures. Given\nthat interdomain peering link failures are as common and\ntransient as intradomain link failures, the authors of [101]\nproposed a local search heuristic to obtain an outbound inter-\ndomain TE solution that is robust to any interdomain link\nfailure. Their objective is to minimize interdomain link utiliza-\ntion under both normal state (no failure) and failure state\nwith any single interdomain link failure.\nTraffic engineering in the case of multiple TM scenarios\nfor the purpose of handling traffic demand uncertainty\nis relatively new. For intradomain TE, Applegate and\nCohen [102] found that it is possible to obtain a robust\nrouting configuration that guarantees nearly optimal\nutilization with fairly limited knowledge of the applica-\nble TMs. Similar work with link failure consideration\nwas also proposed by the same authors [103]. Based on\ntheir work, the authors in [104] proposed algorithms to\nsolve the robust intradomain TE problem. Instead of\nusing distinct TM scenarios, Mitra and Wang [105] pro-\nposed a stochastic optimization approach which\nassumes that the traffic demands are given probability\ndistributions. Apart from being used for TM uncertain-\nty, the robust TE approach can be used to obtain a\nhigh chance of performing well for multiple TMs, each\nof which represents traffic demands in a distinct period\n(e.g., days and evenings). This can be achieved through\na set of OSPF link weight settings with the changing of a few\nlink weights for different time periods [9]. This approach\nreduces the complexities in network management, as network\noperators do not need to change link weights on a regular\nbasis. The COPE MPLS-based TE approach [106] was pro-\nposed to optimize for the expected TM scenarios while provid-\ning a worst case performance guarantee for unexpected ones,\nincluding those caused by link failures and traffic spikes. On\nthe other hand, for interdomain TE, the authors in [107] pro-\nposed an outbound TE approach based on scenario-based\nrobust optimization, taking as input a set of interdomain TMs.\nThe objective of their work is to obtain an outbound TE solu-\ntion that achieves good maximum interdomain link utilization\nwhile minimizing the performance gap between the achieved\nsolution and the optimal solution for any given interdomain\nTM.\nThe ultimate objective of using robust TE approaches is to\nmake network design and provisioning more predictable. This\ntopic has been further receiving attention in designing a pre-\ndictable Internet backbone network using novel approaches.\nZhang and McKeown [108] proposed using Valiant load bal-\nancing over a fully connected logical mesh for backbone net-\nwork design. The aim of this approach is to achieve\npredictable and guaranteed performance, even when TMs\nchange, and links and routers fail. Kodialam et al. [109] pro-\nposed a simple static routing scheme that is robust to extreme\ntraffic fluctuations without requiring significant network over-\nprovisioning. \nTE INTERACTIONS\nEarlier we classified traffic engineering into a set of cate-\ngories. In this section we discuss TE interactions within each\ncategory from the viewpoint of routing optimization.\nIntra-\/Interdomain TE Interaction — Much research has\nbeen conducted on intradomain and interdomain TE, respec-\ntively, but how they work together as an integrated TE\nparadigm has not been well addressed. Recently, some publi-\ncations have indicated that the interaction between intra- and\ninterdomain TE significantly impacts overall performance\n[110]. First, any change of BGP ingress\/egress point for traffic\nacross a domain influences the intradomain TM and leads to\nsignificant impact on the effectiveness of intradomain TE\n[110]. Hence, a more appropriate TE strategy is to take\nintradomain conditions into consideration when performing\ninterdomain TE. For example, when selecting an egress point\nfor any traffic trunk with bandwidth requirements, a prerequi-\nsite is to guarantee that at least one feasible intradomain path\nwith sufficient network resources exists between the ingress-\n■ Figure 11. Steiner tree with IGP link weight optimization.\nB\nE F\n(a)\nG\nC\nA\nD B\n2 2\n2 2\n11\n1\n1\n1\n1\nE F\n(b)\nG\nC\nA\nD\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200852\negress pair. In [111] the authors proposed a joint optimization\napproach of intra- and interdomain TE that is solved by a\nlocal search heuristic algorithm. Their results show that per-\nforming intra- and interdomain TE simultaneously can maxi-\nmize the network’s capability to accommodate future traffic\ndemands better than a sequential or nested approach that\nperforms both types of TE separately.\nThe configuration of intradomain TE can, however, also\nimpact interdomain path selection. A typical example is HPR,\noften used by large INPs [5]. According to the BGP route\nselection policy, if multiple routes toward the same destina-\ntion prefix are received through the same type of e\/iBGP\nadvertisement with identical values of Local_pref, origin type,\nAS path length, and MED, the route having the lowest\nintradomain IGP link weight is selected. Today, many INPs\nadopt HPR, which allows IGP link weights to influence egress\nrouter selection. By doing so, they hope that the traffic can be\ndelivered out of the local domain using the least number of\nhops (assuming each IGP link weight to be 1), which indicates\nthat the least bandwidth resources are consumed. However,\nHPR also potentially leaves the interdomain traffic instability\nproblem in time of link failure. We reuse Fig. 3 as an exam-\nple. Assume that the INP of AS100 applies HPR for traffic\ndelivery toward AS200 via egress node 10.10.10.1 according to\nits TE requirement. To achieve this, the configured IGP link\nweight for the shortest path between 10.10.10.3 and 10.10.10.1\n(i.e., path A) should be lower than its counterpart between\n10.10.10.3 and 10.10.10.2 (path C). Under this configuration,\nin case of a link failure on path A, the whole traffic trunk\ntoward AS200 will shift automatically to use 10.10.10.2 as the\negress point in AS100 if the IGP weight of the newly formed\nshortest path between 10.10.10.3 and 10.10.10.1 (e.g., path B)\nis larger than that of path C. In this scenario, not only does\ntraffic routing within the network become unstable, but also\nthe original TE objectives may be violated. With this example,\nwe can see that intradomain TE might also interact with inter-\ndomain path selection. By showing the above examples, we\nindicate the importance of the intra-\/interdomain TE interac-\ntion, and we believe that further investigation in this area is\nworthwhile for more effective and robust TE.\nMPLS\/IP-based TE Interaction — We showed earlier the\ndistinct advantages and disadvantages of using IP\/MPLS-\nbased TE schemes. Recently, some proposals have been made\nto integrate IP and MPLS tech-\nnologies to provide a hybrid TE\nsolution. In [112] the authors sug-\ngested the option of using LSPs\nonly to reroute the traffic trunks\nthat potentially contribute to net-\nwork congestion, while the rest of\nthe traffic is routed through plain\nIGP. In this case the overhead\nintroduced from LSP states can be\nreduced significantly at the expense\nof reasonably less flexibility in path\nselection. In the offline scenario,\nhow to set up LSPs and configure\nIGP link weights so as to achieve\noverall network optimality is the\nkey objective of the hybrid TE\napproach. If the IGP link weight is\nproperly calculated, the number of\nLSPs needed for explicit routing to\neliminate congestion can be\nreduced. In addition, hybrid online\nTE with both IGP and MPLS has\nalso been investigated in [113–115]. These works aim at effi-\ncient allocation of unpredictable incoming traffic trunks onto\ndifferent routing planes. In both cases the interaction between\nIP-based and MPLS-based TE on top of the same physical\nnetwork is of significant importance, as there is a typical\ntrade-off between performance and scalability that should be\ntaken into consideration by INPs.\nOffline\/Online TE Interaction — Despite the fundamental\ndifference between offline\/online TE described earlier, it is\nstill possible, and even desirable in some circumstances, to\ncombine them for more sophisticated TE optimization.\nAlthough TMs can sometimes be obtained in advance (e.g.,\nthrough SLSs) to provide the possibility of offline TE, it is not\nalways the case that the overall traffic demands can be accu-\nrately predicted. In this case static configuration according to\nthe result from offline TE may not be able to handle unex-\npected traffic dynamics within each resource provisioning\ncycle. To compensate for this inefficiency, online TE can be\nused to dynamically adjust traffic trunks according to the\ninstant network condition obtained from real-time monitoring\nmechanisms. On the other hand, online TE should not com-\npletely discard the original configuration from offline TE, as\nsignificant traffic flapping and oscillation might be incurred,\nintroducing network instability. In effect, a desired strategy to\nhandle the relationship between offline and online TE is to\nallow offline TE to provide proper guidelines and restrictions\nto the online TE component so that dynamic routing adjust-\nment can be applied in a controlled manner. A typical exam-\nple is the TEQUILA [16] architecture, where the offline\nnetwork dimensioning (ND) functional block provides direc-\ntives and nonspecific “hard” values so as to leave space for\nunpredictable traffic fluctuations that will be handled by the\ndynamic route\/resource management (DRtM, DRsM) func-\ntional blocks. In addition, design-based routing has been pro-\nposed in [116] to use offline TE results to guide online traffic\nrouting. During the offline network provisioning phase, the\nINP may configure multiple routes toward a remote destina-\ntion prefix, while BGP speakers can split traffic dynamically\nonto different next hop peers based on the advertised interdo-\nmain link bandwidth through eBGP [117].\nMultiplane TE Interaction — Finally, if we regard intra-\/\ninterdomain TE interaction (including interdomain TE itself)\n■ Figure 12. Horizontal\/vertical TE interactions.\nVertical\nTE\nTE interactions\nHorizontal\nTE\nHorizontal\nTE\nTE interactions\nVertical\nTE\nNetwork plane 0\nNetwork plane 1\nNetwork plane n\nNetwork plane 0\nNetwork plane 1\nNetwork plane n\nINP 1 INP 2\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 53\nas a type of horizontal TE semantic between adjacent\ndomains, the terminology of vertical TE can be borrowed as\nthe concept of network resource optimization across multiple\nnetwork planes within a domain (Fig. 12). Currently, there are\ntwo major scenarios of TE with multiple network planes: rout-\ning incongruence between different traffic types (e.g.,\nIPv4\/IPv6, unicast\/multicast) and different QoS requirements\n(e.g., DiffServ TE). Recently, with the advent of multitopolo-\ngy-aware routing protocols such as MT-OSPF, M-ISIS, and\nthe multiprotocol extension to BGP (MP-BGP [118]), togeth-\ner with DiffServ-MPLS-based solutions, vertical TE for multi-\nple traffic types and QoS\/TE requirements becomes a feasible\noption. However, even if these multiplane routing protocols\noffer high flexibility in path selection, TE in the management\nplane concerning overall resource optimization is still indis-\npensable, as all types of traffic are mapped onto the same\nphysical network infrastructure. In this case TE for individual\nnetwork planes needs to be coordinated so as to achieve “ver-\ntical” optimization across all planes. Taking unicast\/multicast\nTE as an example, the MT-IGP link weights can be assigned\nfor unicast traffic and multicast traffic independently, aiming\nat different TE objectives (e.g., load balancing for unicast traf-\nfic and bandwidth conservation for multicast traffic). Howev-\ner, the calculation of link weights for the two planes should\nnot proceed independently, as both unicast and multicast traf-\nfic are projected onto the same network resources. This\nmeans that the link weight setting for the two planes should\nconcern overall TE optimization as well as the objectives in\nindividual planes. It is also worth mentioning that multiplane\nrouting protocols are not absolutely necessary for routing of\ndifferent traffic types. In fact, all types of traffic can be routed\nthrough a single plane with conventional OSPF\/ISIS and\nBGP. In this scenario configuration of the unique set of link\nweight and BGP path selection should include all TE objec-\ntives. Since multiplane routing protocols have not been widely\ndeployed in the Internet, it would be interesting to investigate\nthe relevant performance against the scalability in the routing\ninformation base (RIB) needed to store the routing informa-\ntion for multiple planes, compared to the conventional single\nplane routing semantics.\nTRAFFIC ENGINEERING VS. OVERLAY SELFISH ROUTING\nIn some circumstances there are conflicts between TE objec-\ntives and end-to-end QoS demands from individual customers\nin which TE cannot satisfy the QoS requirements. In this case\noverlay selfish routing is a flexible mechanism for end users to\nbypass TE constraints. A distinct characteristic of overlay\nrouting is that path selection is performed by end hosts run-\nning applications according to their QoS requirements, and\nthe underlying IP routing infrastructure is not aware of any\noverlay traffic.1 In this sense overlay routing is also known as\nselfish routing, as it does not consider the optimization for\nany other traffic within the network [119]. As has been men-\ntioned, TE aims at overall optimization of network perfor-\nmance by controlling traffic across the network. With the\nintroduction of overlay routing, TE becomes less efficient\nbecause the routing of overlay traffic is outside the control of\nthe INP. This problem has been identified recently, and sever-\nal research papers have addressed the interaction between TE\nand overlay routing. In [119] the authors applied game theory\nto analyze the behavior of overlay routing and IP\/MPLS-based\nTE, taking end-to-end delay as a typical QoS metric. The\nresult of their work showed that through dedicated overlay\nrouting, near-optimal traffic delay can be achieved provided\nthat the network layer routing of other traffic is static. Howev-\ner, network congestion still occurs at some hot spots within\nthe network, because the overall traffic distribution cannot be\nfully managed by TE. Furthermore, the performance of IP-\nbased TE with overlay traffic coexistence was found to be very\npoor, while the situation can be improved using MPLS-based\nTE with explicit routing and uneven splitting functionality.\nOther research work, such as [120], also indicated the same\nconclusion based on both theoretical and experimental analy-\nsis. As a conclusion, the more traffic in the network that is\noutside the management scope of the INP, the poorer the TE\nperformance results. This indicates that excessive overlay traf-\nfic brings significant negative impacts to effective TE.\nSUMMARY\nToday, Internet traffic engineering techniques have been\nlargely confined to theoretical analysis, and most of them have\nnot been applied in real operational networks. As far as\nintradomain traffic engineering is concerned, it has been\nreceiving less and less attention due to the trend of bandwidth\noverprovisioning at core networks. Nevertheless, as network\ncongestion may still occur due to the significant changes in\ntraffic load distribution caused by network element failures\nand traffic spikes, making TE robust to failures and traffic\ndemand uncertainty is a topic worthy of investigation even\nwithin a single domain. It is not difficult to imagine that this\nresilience issue also needs to be considered for supporting\nQoS (e.g., edge-to-edge delay), specifically, how to compute\noptimized backup paths in order to support the original QoS\nrequirements while at the same time meeting the TE objec-\ntives.\nCompared to its intradomain counterpart, interdomain TE\nis not yet fully understood, let alone ready for practical\ndeployment. We argue that there are two interrelated issues\nthat plague the practicality of interdomain TE. First of all, the\noriginal design of BGP did not consider how individual rout-\ning policies can be systematically used to optimize interdo-\nmain traffic. Although various BGP-based TE techniques have\nbeen proposed in recent years, routing issues of stability and\ndivergence have generally been ignored, which are vital to\nconsider in practice. It is worth mentioning that these are not\nproblems from the individual TE schemes that have been pro-\nposed, but are inherently associated with the policy-based\nBGP routing infrastructure. It is still unknown how many of\nthe existing interdomain TE approaches can be practically\nconfigurable when stability issues are taken into account. Nev-\nertheless, recent BGP-based TE with stability consideration\nhas already made efforts in this direction.\nAnother issue that hinders the practicality of interdomain\nTE is the noncooperative or even conflicting routing strategies\nof individual, especially adjacent, INPs. Strictly speaking, the\nconcept of interdomain TE can be split into two categories:\nengineering interdomain (transit) traffic within one single\ndomain and a more “genuine” interdomain TE that considers\nengineering traffic across multiple cooperative domains. Most\ninterdomain TE proposals belong to the first category, as the\nTE objectives are purely for the benefit of the local domain\nwithout considering whether the local BGP routing decision\nwill introduce negative impacts on its neighbors or even the\nglobal Internet. In effect, inconsistency in interdomain routing\npolicies between neighboring domains may cause routing\n1 This flexible functionality of overlay routing is very similar to MPLS\nexplicit routing. The key difference is that overlay routing is always per-\nformed by end users for their own QoS benefits, while MPLS explicit rout-\ning is normally adopted by INPs for TE purposes.\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200854\nanomalies such as the “bad gadget” effect [121]. Hence, a\nmuch more challenging task is to consider the second sce-\nnario, which requires cooperation between participating\ndomains in order to achieve mutual benefits. Unfortunately,\ngiven the current situation where individual INPs are general-\nly in competitive rather than cooperative relationships, it is\nhard to tell whether such a “genuine” interdomain TE, espe-\ncially at the global Internet scale, is realistic or just Utopian.\nA new trend in interdomain TE is to use alternative routing\nmechanisms to avoid the inefficiency of the BGP routing\nparadigm, such as interdomain MPLS-based path computation\nservices. By the time this article is written, IETF activities in\nthis area are only in the architectural design phase, and there\nhave been very few operational experiences thus far. Never-\ntheless, it is envisaged that PCE-based interdomain TE is able\nto provide promising solutions, not only for traffic optimiza-\ntions across domains, but also for more advanced services\nsuch as end-to-end QoS and resilience. Apart from the prob-\nlem of how to compute optimized interdomain paths, one\nimportant issue to be considered in deploying PCE-based TE\ninfrastructure is scalability, mainly in how interdomain traffic\ncan be efficiently aggregated in order to avoid deploying mas-\nsive LSPs across multiple domains.\nFinally, with the Internet becoming a multiservice plat-\nform, Internet TE needs to take into account different types\nof traffic (e.g., unicast vs. multicast, IPv4 vs. IPv6) as well as\nheterogeneous service requirements. Although the idea of\nusing multitopology routing or combined routing techniques\nsuch as IP+MPLS may provide some potential solutions, the\nactual management of heterogeneous traffic on top of the\ncommon physical routing infrastructure in order to achieve\nboth operational objectives and service requirements still\nneeds further research effort, typically on the vertical interac-\ntions across different traffic types and traffic with heteroge-\nneous service requirements. Again, how to achieve this goal in\nthe interdomain environment in order to enable a genuine\nmultiservice Internet is a much more challenging task for the\nfuture.\nREFERENCES\n[1] N. Hu et al., “Locating Internet Bottlenecks: Algorithms, Measure-\nments and Implications,” Proc. ACM SIGCOMM, 2004, pp. 41–54.\n[2] D. Awduche et al., “Overview and Principles of Internet Traffic\nEngineering,” IETF RFC 3272, May 2002.\n[3] Y. Lee et al., “Traffic Engineering in Next-Generation Optical\nNetworks,” IEEE Commun. Surveys & Tutorials, vol. 6, no. 3,\n2004, pp. 16–33.\n[4] G. Iannaccone et al., “Analysis of Link Failures in an IP Back-\nbone,” Proc. ACM IMW, 2002, pp. 237–42.\n[5] R. Teixeira et al., “Network Sensitivity to Hot-Potato Disrup-\ntions,” Proc. ACM SIGCOMM, 2004, pp. 231–44.\n[6] D. Awduche et al, “Requirements on Traffic Engineering over\nMPLS,” RFC 2702, June 1999.\n[7] D. Awduche et al., “MPLS and Traffic Engineering in IP Networks,”\nIEEE Commun. Mag., vol. 37, no. 12, Dec. 1999, pp. 42–47.\n[8] B. Fortz et al., “Internet Traffic Engineering by Optimising\nOSPF Weights,” Proc. IEEE INFOCOM, 2000, pp. 519–28.\n[9] B. Fortz et al., “Optimizing OSPF\/IS-IS Weights in a Changing\nWorld,” IEEE JSAC, vol. 20, no. 4, May 2000, pp. 756–67.\n[10] B. Fortz et al., “Traffic Engineering with Traditional IP Rout-\ning Protocols,” IEEE Commun. Mag., vol. 40, no. 10, Oct.\n2002, pp. 118–24.\n[11] B. Quoitin et al., “Interdomain Traffic Engineering with BGP,”\nIEEE Commun. Mag., vol. 41, no. 5, May 2003, pp. 122–28.\n[12] B. Fortz et al., “Robust Optimization of OSPF\/IS-IS Weights,”\nProc. INOC 2003, pp. 225–30.\n[13] R. Teixeira et al., “Dynamics of Hot-Potato Routing in IP Net-\nworks,” Proc. ACM SIGMETRICS 2004, pp. 307–19.\n[14] Cisco IOS Netflow, http:\/\/www.cisco.com\/en\/US\/products\/\nps6601\/products_ios_protocol_group_home.html\n[15] A. Asgari et al., “Scalable Monitoring Support for Resource\nManagement and Service Assurance,” IEEE Network, vol. 18,\nno. 6, Nov.\/Dec. 2004, pp. 6–18.\n[16] P. Trimintzios et al., “A Management and Contral Architecture for\nProviding IP Differentiated Services in MPLS-Based Networks,” IEEE\nCommun. Mag., vol. 39, no. 5, May 2001, pp. 80–88.\n[17] Multicast Deployment Status, http:\/\/multicast.internet2.edu\/\nwg-multicast-status.shtml\n[18] L. Andersson et al., “LDP Specification,” IETF RFC 3036, Jan. 2001.\n[19] D. Mitra and K. G. Ramakrishnan, “A Case Study of Multiser-\nvice, Multipriority Traffic Engineering Design for Data Net-\nworks,” Proc. IEEE GLOBECOM, 1999, pp. 1077–83.\n[20] O. Younis et al, “Constraint-Based Routing in the Internet:\nBasic Principles and Recent Research,” IEEE Commun. Surveys\n& Tutorials, 3rd qtr., 2003, pp. 2–13.\n[21] X. Xiao et al., “Traffic Engineering with MPLS in the Internet,”\nIEEE Network, vol. 14, no. 12, Mar.\/Apr. 2000, pp. 28–33.\n[22] Z. Wang et al., “Quality of Service Routing for Supporting\nMultimedia Applications,” IEEE JSAC, vol. 14, no. 7, Sept.\n1996, pp. 1228–34.\n[23] R. Guerin, et al., “QoS Routing Mechanisms and OSPF Exten-\nsions,” Proc. IEEE GLOBECOM 1997, pp. 1903–08.\n[24] Y. Wang et al., “Explicit Routing Algorithms for Internet Traf-\nfic Engineering,” Proc. IEEE ICCCN, 1999, pp. 582–88.\n[25] F. Le Faucheur et al., “Requirements for Support of Differen-\ntiated Services-aware MPLS Traffic Engineering,” IETF RFC\n3564, July 2003.\n[26] P. Trimintzios et al., “Quality of Service Provisioning through Traf-\nfic Engineering with Applicability to IP Based Production Net-\nworks,” Comp. Commun., vol. 26, no. 8, May 2003, pp. 845–60.\n[27] V. Tabatabaee et al., “Differentiated Traffic Engineering for\nQoS Provisioning,” Proc. IEEE INFOCOM, 2005, pp. 2349–59.\n[28] H. Saito et al., “Traffic Engineering Using Multiple Multi-\npoint-to-point LSPs,” Proc. IEEE INFOCOM, 2000, pp. 894–901.\n[29] G. Urvoy-Keller et al., “Traffic Engineering in a Multipoint-to-Point\nNetwork,” IEEE JSAC, vol. 20, no. 4, May 2002, pp. 834–49.\n[30] S. Bhatnagar et al., “Creating Multipoint-to-Point LSPs for\nTraffic Engineering,” IEEE Commun. Mag., vol. 43, no. 1, Jan.\n2005, pp. 95–100.\n[31] P. Trimintzios et al., “Engineering the Multi-Service Internet: MPLS\nand IP-Based Techniques,” Proc. IEEE ICT, 2001, pp. 129–34.\n[32] A. Elwalid et al., “MATE: MPLS Adaptive Traffic Engineering,”\nProc. IEEE INFOCOM, 2001, pp. 1300–09.\n[33] S. Kandula et al., “Walking the Tightrope: Responsive Yet Sta-\nble Traffic Engineering,” ACM SGICOMM Comp. Commun.\nReview, vol. 35, no. 4, Oct. 2005, pp. 253–64.\n[34] R. Boutaba et al., “DORA: Efficient Routing for MPLS Traffic\nEngineering,” J. Network and Sys. Mgmt., vol. 10, no. 3, Sept.\n2002, pp. 309–25.\n[35] K. Kar et al., “Minimum Interference Routing of Bandwidth\nGuaranteed Tunnels with MPLS Traffic Engineering Applica-\ntions,” IEEE JSAC, vol. 18, no. 12, Dec. 2000, pp. 2566–79.\n[36] K. Kodialam et al., “Minimum Interference Routing of Appli-\ncations to MPLS Traffic Engineering,” Proc. IEEE INFOCOM,\n2000, pp. 884–93.\n[37] P. Aukia et al., “RATES: A Server for MPLS Traffic Engineer-\ning,” IEEE Network, vol. 14, no. 2, Mar.\/Apr. 2000, pp. 34–41.\n[38] F. Blanchy, L. Melon, and G. Leduc, “A Preemption-Aware\nOn-line Routing Algorithm for MPLS Networks,” Telecommun.\nSys., vol. 24, no. 2–4, Oct. 2003, pp. 187–206.\n[39] C. Scoglio et al., “TEAM: A Traffic Engineering Automated\nManager for DiffServ Based MPLS Networks,” IEEE Commun.\nMag., vol. 42, no. 10, Oct. 2004, pp. 134–45.\n[40] J. C. de Oliveira et al., “SPeCRA: A Stochastic Performance\nComparison Routing Algorithm for LSP setup in MPLS Net-\nworks,” Proc. IEEE GLOBECOM, 2002, pp. 2190–94.\n[41] J. C. de Oliveira et al., “New Preemption Policies for DiffServ\nAware Traffic Engineering to Minimize Rerouting in MPLS Net-\nworks,” IEEE\/ACM Trans. Networking, vol. 12, no. 4, Aug.\n2004, pp. 733–45.\n[42] K. Walkowiak, “Survivable Online Routing for MPLS Traffic\nEngineering,” Proc. QoFIS, 2004, pp. 288–97.\n[43] Y. Wang et al., “Internet Traffic Engineering without Full\nMesh Overlaying,” Proc. IEEE INFOCOM, 2001, pp. 565–71.\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 2008 55\n[44] G. Retvari et al., “On the Representability of Arbitrary Path\nSets as Shortest Paths: Theory, Algorithms and Complexity,”\nProc. IFIP NETWORKING, 2004, pp. 1180–91.\n[45] A. Feldmann et al., “NetScope: Traffic Engineering for IP Net-\nworks,” IEEE Network, vol. 14, no. 2, Mar.\/Apr. 2000, pp. 11–19.\n[46] M. Ericsson et al., “A Genetic Algorithm for the Weight Set-\nting Problem in OSPF Routing,” J. Combinatorial Optimization,\nvol. 6, no. 3, Sept. 2002, pp. 299–333.\n[47] G. Retvari et al., “Practical OSPF Traffic Engineering,” IEEE\nCommun. Letters, vol. 8, no. 11, Nov. 2004, pp.689–91.\n[48] A. Sridharan et al., “Achieving Near-Optimal Traffic Engineer-\ning Solutions for Current OSPF\/IS-IS Networks,” IEEE\/ACM\nTrans. Networking, vol. 13, no. 2, Apr. 2005, pp. 234–47.\n[49] J. Wang et al., “Edge Based Traffic Engineering for OSPF Net-\nworks,” Comp. Networks, vol. 48, no. 4, July 2005, pp. 605–25.\n[50] C. Labovitz et al., “Internet Routing Instability,” IEEE\/ACM\nTrans. Networking, vol. 6, no. 5, Oct. 1998, pp. 515–28.\n[51] I. Gojmerac, T. Ziegler, F. Ricciato and P. Reichl, “Adaptive\nMultipath Routing for Dynamic Traffic Engineering,” Proc. IEEE\nGLOBECOM, 2003, pp. 3058–62.\n[52] Y. Rekhter and T. Li, “A Border Gateway Protocol 4 (BGP-4),”\nIETF RFC 1771, Mar. 1995.\n[53] Cisco Systems, “BGP Multipath Load Sharing for Both eBGP\nand iBGP in an MPLS-VPN,” 2005.\n[54] L. Gao and J. Rexford, “Stable Internet Routing without Glob-\nal Coordination,” IEEE\/ACM Trans. Networking, vol. 9, no. 6,\nDec. 2001, pp.681–92.\n[55] Y. R. Yang et al., “On Route Selection for Interdomain Traffic\nEngineering,” IEEE Network, vol. 19, no. 6, Nov.\/Dec. 2005, pp\n20–27.\n[56] N. Feamster et al., “Guidelines for Interdomain Traffic Engi-\nneering,” ACM SIGCOMM Comp. Commun. Rev., vol. 33, no.\n5, Oct. 2003, pp. 19–30.\n[57] A. Farrel et al., “A Path Computation Element (PCE)-Based\nArchitecture,” IETF RFC 4655, Aug. 2006.\n[58] D. Goldenberg et al., “Optimizing Cost and Performance for\nMultihoming,” Proc. ACM SIGCOMM 2004, pp. 79–92.\n[59] S. Uhlig et al., “Interdomain Traffic Engineering with Minimal\nBGP Configurations,” Proc. 18th Int’l. Teletraffic Cong., 2003.\n[60] S. Uhlig, “A Multiple-Objectives Evolutionary Perspective to Inter-\ndomain Traffic Engineering in the Internet,” Int’l. J. Computational\nIntelligence and Apps., vol. 5, no. 2, June 2005, pp. 215–30.\n[61] H. Wang, “Optimal ISP Subscription for Internet Multihom-\ning: Algorithm Design and Implication Analysis,” Proc. IEEE\nINFOCOM, 2005, pp. 2360–71.\n[62] K. Ho et al., “An Incentive-based Quality of Service Aware\nAlgorithm for Offline Inter-AS Traffic Engineering,” Proc. IEEE\nIPOM, 2004, pp. 34–40.\n[63] T.C. Bressoud et al., “Optimal Configuration for BGP Route\nSelection,” Proc. IEEE INFOCOM 2003, pp. 916–26.\n[64] S. Uhlig and B. Quoitin, “Tweak-it: BGP-Based Interdomain\nTraffic Engineering for Transit ASs,” Proc. Next Gen. Internet\nNetworks, 2005, pp. 75–82.\n[65] K. Ho et al., “Multi-Objective Egress Router Selection Policies\nfor Inter-domain Traffic with Bandwidth Guarantees,” Proc.\nIFIP Networking, 2004, pp. 271–83.\n[66] M. Howarth et al., “Provisioning for Inter-domain Quality of\nService: the MESCAL Approach,” IEEE Commun. Mag., vol. 43,\nno. 6, June 2005, pp. 129–37.\n[67] M. Howarth et al., “End-to-end Quality of Service Provision-\ning Through Inter-provider Traffic Engineering,” Comp. Com-\nmun., vol. 29, no. 6, Mar. 2006, pp. 683–02.\n[68] M.R. Gary and D.S. Johnson, Computers and Intractability: A\nGuide to the Theory of NP-Completeness, W.H. Freeman, 1979.\n[69] S. Uhlig and O. Bonaventure, “Designing BGP-based Outbound\nTraffic Engineering Techniques for Stub ASs,” ACM SIGCOMM\nComp. Commun. Rev., vol. 34, no. 5, Oct. 2004, pp. 89–106.\n[70] A. Akella et al., “A Measurement-Based Analysis of Multi-\nhoming,” Proc. ACM SIGCOMM 2003, pp. 353–64.\n[71] S. Lee et al., “Exploiting AS Hierarchy for Scalable Route\nSelection in Multi-Homed Stub Networks,” Proc. ACM IMC,\n2004, pp. 294–99.\n[72] R.K.C. Chang and M. Lo, “Inbound Traffic Engineering for\nMultihomed ASs Using AS Path Prepending,” IEEE Network,\nvol. 19, no. 2, Mar.\/Apr. 2005, pp. 18–25.\n[73] H. Wang et al., “Characterizing the Performance and stability\nIssues of the AS Path Prepending Method: Taxonomy, Mea-\nsurement Study and Analysis,” Proc. ACM SIGCOMM Asia\nWksp., 2005.\n[74] B. Quoitin et al., “A Performance Evaluation of BGP-based\nTraffic Engineering,” Int’l. J. Network Mgmt., vol. 15, no. 3,\nMay\/June 2005, pp. 177–91.\n[75] S.R. Sangli et al., “BGP Extended Communities Attribute,” Internet\ndraft, draft-ietf-idr-bgp-ext-communities-08.txt, Feb. 2005.\n[76] B. Quoitin et al., “Interdomain Traffic Engineering with Redis-\ntributed Communities,” Comp. Commun., vol. 27, no. 4, Oct.\n2003, pp. 355–63.\n[77] S. Kalyanaraman, “Load Balancing in BGP Environments using\nOnline Simulation and Dynamic NAT,” presented at the Inter-\nnet Statistic and Metrics Analysis Wksp. 2001.\n[78] A. Akella et al., “Multihoming Performance Benefits: An\nExperimental Evaluation of Practical Enterprise Strategies,”\nProc. USENIX Annual Tech. Conf., 2004.\n[79] S. Agarwal et al., “OPCA: Robust Interdomain Policy Routing\nand Traffic Control,” Proc. IEEE OPENARCH, 2003, pp. 55–64.\n[80] R. Gao et al., “Interdomain Ingress Traffic Engineering\nthrough Optimized AS-Path Prepending,” Proc. IFIP Network-\ning, 2005, pp. 647–58.\n[81] R. Mahajan et al., “Towards Coordinated Interdomain Traffic\nEngineering,” Proc. ACM HotNets-III Wksp., 2004.\n[82] R. Mahajan et al., “Negotiation-based Routing Between\nNeighboring Domains,” Proc. ACM\/USENIX Networked Sys.\nDesign and Implementation, 2005.\n[83] D. Awduche et al., “An Approach to Optimal Peering\nBetween Autonomous Systems in the Internet,” Proc. IEEE\nICCCN, 1998, pp. 346–51.\n[84] R. Johari and J.N. Tsitsiklis, “Routing and Peering in a Com-\npetitive Internet,” tech. rep. P-2570, MIT Lab. for Info. and\nDecision Sys., Jan. 2003.\n[85] G. Shrimali et al, “Cooperative Interdomain Traffic Engineer-\ning using Nash Bargaining and Decomposition,” Proc. IEEE\nINFOCOM, 2007.\n[86] B. Quoitin and O. Bonaventure, “A Cooperative Approach to\nInter-domain Traffic Engineering,” Proc. NGI Networks, 2005,\npp. 450–57.\n[87] Y. Liu and N. Reddy, “Multihoming Route Control among a\nGroup of Multihomed Stub Networks,” Comp. Commun., vol.\n30, no. 17, 2007, pp. 3335–45.\n[88] M. Kodialam et al., “Online Multicast Routing with Band-\nwidth Guarantees: A New Approach Using Multicast Network\nFlow,” IEEE\/ACM Trans. Networking, vol. 11, no. 4, Aug. 2003,\npp. 676–86.\n[89] A. Fei at al, “Aggregated Multicast with Inter-Group Tree\nSharing,” Proc. Int’l. Wksp. Networked Group Commun., 2001,\npp. 172–88.\n[90] B. Yang et al., “Multicasting in MPLS Domains,” Comp. Com-\nmun., vol. 27, no. 2, Feb. 2004, pp. 162–70.\n[91] B. Fenner et al., “Protocol Independent Multicast - Sparse\nMode (PIM-SM): Protocol Specification (Revised),” IETF RFC\n4601, Aug. 2006.\n[92] Y. D. Meisel et al., “Multicast Routing with Traffic Engineer-\ning: a Multi-Objective Optimization Scheme and a Polynomial\nShortest Path Tree Algorithm with Load Balancing,” Proc.\nCCIO, 2004.\n[93] N. Wang et al., “Traffic Engineered Multicast Content Deliv-\nery without MPLS Overlay,” IEEE Trans. Multimedia, vol. 9, no.\n3, Apr. 2007, pp. 619–28.\n[94] T. Przygienda et al., “M-ISIS: Multi Topology (MT) Routing in\nIS-IS,” RFC 5120, Feb. 2008.\n[95] P. Psenak et al., “Multi-Topology (MT) Routing in OSPF,” RFC\n4915, June 2007.\n[96] A. Nucci et al., “IGP Link Weight Assignment for Operational\nTier-1 Backbones,” IEEE\/ACM Trans. Networking, vol. 15, no. 1,\npp. 789–802.c\n[97] A. Sridharan et al., “Making IGP Routing Robust to Link Fail-\nures,” Proc. IFIP Networking, 2005, pp. 634–46.\n[98] D. Yuan, “A Bi-Criteria Optimization Approach for Robust\nOSPF Routing,” Proc. IEEE IPOM, 2003, pp. 91–97.\n[99] A. Kvalbein et al., “Post Failure Routing Performance with\nMultiple Routing Configurations,” Proc. IEEE INFOCOM, 2007.\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \nIEEE Communications Surveys & Tutorials • 1st Quarter 200856\n[100] E. Karasan et al., “Robust Path Design Algorithms for Traffic\nEngineering with Restoration in MPLS Networks,” IEICE Trans.\nCommun., vol. E86-b, no. 5, pp 1632–40.\n[101] M. Amin et al., “Making Outbound Route Selection Robust to\nEgress Point Failure,” Proc. IFIP Networking, 2006, pp. 233–46.\n[102] D. Applegate and E. Cohen, “Making Intra-Domain Routing\nRobust to Changing and Uncertain Traffic Demands: Under-\nstand Fundamental Tradeoffs,” Proc. ACM SIGCOMM, 2003,\npp. 313–24.\n[103] D. Applegate et al., “Coping with Network Failures: Routing\nStrategies for Optimal Demand Oblivious Restoration,” Proc.\nACM SIGMETRICS, 2004, pp. 270–81.\n[104] C. Zhang et al., “On Optimal Routing with Multiple Traffic\nMatrices,” Proc. IEEE INFOCOM, 2005, pp. 607–18.\n[105] D. Mitra and Q. Wang, “Stochastic Traffic Engineering for\nDemand Uncertainty and Risk-Aware Network Revenue Man-\nagement,” IEEE\/ACM Trans. Networking, vol. 13, no. 2, Apr.\n2005, pp. 221–33.\n[106] H. Wang et al, “COPE: Traffic Engineering in Dynamic Net-\nworks,” Proc. ACM SIGCOMM, 2006.\n[107] K.H. Ho et al., “A Robustness Approach to Inter-AS Out-\nbound Traffic Engineering,” Proc. IEEE ICC, 2006, pp. 560–65.\n[108] R. Zhang and N. Mckeown, “Designing a Predictable Inter-\nnet Backbone Network,” Proc. ACM HotNets, 2004.\n[109] M. Kodialam, T.V. Lakshmann and S. Sengupta, “Efficient\nand Robust Routing of Highly Variable Traffic,” Proc. ACM\nHotNets, 2004.\n[110] S. Agarwal et al., “The Impact of BGP Dynamics on Intra-\ndomain Traffic,” ACM SIGMETRICS Perf. Eval. Rev., vol. 32, no.\n1, June 2004, pp. 319–30.\n[111] K. H. Ho et al., “Joint Optimization of Intra- and Inter-\nAutonomous System Traffic Engineering,” Proc. IEEE\/IFIP\nNOMS, 2006, pp. 248–59.\n[112] J. Boyle et al., “Applicability Statement for Traffic Engineer-\ning with MPLS,” IETF RFC 3346, Aug. 2002.\n[113] H. Pham et al., “Hybrid Routing for Scalable IP\/MPLS Traffic\nEngineering,” Proc. IEEE ICC, 2003, pp. 332–337.\n[114] A. Bagula, “Hybrid Routing in Next Generation IP Networks,”\nComp. Commun., vol. 29, no. 7, Apr. 2006, pp. 879–92.\n[115] A. Bagula, “Hybrid IGP + MPLS Routing in Next Generation\nIP Networks: An Online Traffic Engineering Model,” Proc.\nQoSIP, 2005, pp. 325–38.\n[116] A. Elwalid, “Routing and Protection in GMPLS Networks:\nFrom Shortest Paths to Optimized Designs,” J. Lightwave\nTech., vol. 21, no. 11, Nov. 2003, pp. 2828–38.\n[117] Cisco white paper, “BGP Bandwidth Link,” http:\/\/www.cisco.\ncom\/univercd\/cc\/td\/doc\/product\/software\/ios122\/122newft\/122t\n\/122t2\/ftbgplb.htm\n[118] T. Bates et al., “Multiprotocol Extensions for BGP-4,” IETF\nRFC 4760, Jan. 2007.\n[119] L. Qiu et al., “On Selfish Routing in Internet-like Environ-\nments,” IEEE\/ACM Trans. Networking, vol. 14, no. 4, Aug.\n2006, pp. 725–38.\n[120] Y. Liu et al., “On the Interaction between Overlay Routing and\nTraffic Engineering,” Proc. IEEE INFOCOM, 2005, pp. 2543–53.\n[121] T. Griffin et al., “An Analysis of BGP Convergence Proper-\nties,” Proc. ACM SIGCOMM, 1999, pp. 277–88.\nBIOGRAPHIES\nNING WANG [M’01] (n.wang@surrey.ac.uk) received a B.Eng.\ndegree (Honors) in computing from Changchun University of Sci-\nence and Technology, China, in 1996, an M.Eng. degree in elec-\ntronic engineering from Nanyang Technological University,\nSingapore, in 2000, and a Ph.D. degree in electronic engineering\nfrom the University of Surrey, Guildford, United Kingdom, in\n2004. He is currently a postdoctoral research fellow in the Center\nfor Communication Systems Research, University of Surrey. His\nmajor research interests include traffic engineering and network\noptimization algorithms, Internet QoS provisioning, multicast\ncommunication, and overlay networks.\nKIN-HON HO (k.ho@surrey.ac.uk) is a research fellow at the Center\nfor Communication Systems Research, University of Surrey, United\nKingdom. He received his B.Sc. (Honors) in computer studies from\nthe City University of Hong Kong, his M.Sc. (Eng ) in data com-\nmunications from the University of Sheffield, United Kingdom,\nand his Ph.D. in electronic engineering from the University of Sur-\nrey. His research interests include Internet traffic engineering,\nQoS, and network planning and optimization.\nGEORGE PAVLOU [M’95] (g.pavlau@surrey.ac.uk) received a Diploma\ndegree in electrical and mechanical engineering from the National\nTechnical University of Athens, Greece, and M.Sc. and Ph.D.\ndegrees in computer science from University College London,\nUnited Kingdom. He is currently a professor of communication\nand information systems at the Centre of Communication Systems\nResearch (CCSR), Department of Electronic Engineering, University\nof Surrey, where he leads the activities of the Networks Research\nGroup. He was previously a senior research fellow and lecturer in\nthe Department of Computer Science, University College London,\nwhere he led research activities on network and service manage-\nment. His research interests focus on network management, net-\nworking, and service engineering. He has been a Chartered\nEngineer and member of the Technical Chamber of Greece since\n1984. He is on the Editorial Board of IEEE Transactions on Net-\nwork and Service Management, IEEE Communication Surveys and\nTutorials, and the Journal of Network and Systems Management.\nHe is Network and Service Management Series Editor of IEEE\nCommunications Magazine.\nMICHAEL HOWARTH (m.howarth@surrey.ac.uk) is a lecturer in net-\nworking at CCSR, University of Surrey. He holds a Bachelor’s\ndegree in engineering science and a D.Phil. in electrical engineer-\ning, both from Oxford University, and an M.Sc. in telecommunica-\ntions from the University of Surrey. Prior to joining Surrey he\nworked for several networking and IT consultancies. His research\ninterests include traffic engineering, QoS, security systems, proto-\ncol design, and optimization of satellite communications. He is a\nChartered Electrical Engineer and member of the U.K. IET.\nAuthorized licensed use limited to: University of Surrey. Downloaded on January 29, 2010 at 09:20 from IEEE Xplore.  Restrictions apply. \n"}