{"doi":null,"coreId":"10441","oai":"oai:eprints.gla.ac.uk:47872","identifiers":["oai:eprints.gla.ac.uk:47872",null],"title":"Testing the labour theory of value: An exchange","authors":["Cockshott, W.P.","Bichler, S.","Nitzan, J."],"enrichments":{"references":[{"id":18089192,"title":"A Revolution to Measure: The Political Economy of the Metric System in France.","authors":[],"date":"1995","doi":null,"raw":"Alder, Ken. 1995. A Revolution to Measure: The Political Economy of the Metric System in France. In The Values of Precision, edited by M. N. Wise. Princeton, N.J.: Princeton University Press, pp. 39-71.","cites":null},{"id":18089203,"title":"Capital. A Critique of Political Economy.","authors":[],"date":"1909","doi":"10.1215\/9780822390169-005","raw":"Marx, Karl. 1909. Capital. A Critique of Political Economy. 3 vols. Chicago: Charles H. Kerr & Company.","cites":null},{"id":18089205,"title":"Measuring the Wealth of Nations. The Political Economy of National Accounts. Cambridge and New York:","authors":[],"date":"1994","doi":"10.1017\/cbo9780511528330","raw":"Shaikh, Anwar M., and E. Ahmet Tonak. 1994. Measuring the Wealth of Nations. The Political Economy of National Accounts. Cambridge and New York: Cambridge University Press.","cites":null},{"id":18089195,"title":"Recent Developments in the Labor Theory of Value.","authors":[],"date":"2000","doi":"10.1016\/s0486-6134(00)88759-8","raw":"Foley, Duncan K. 2000. Recent Developments in the Labor Theory of Value. Reivew of Radical Political Economics 32 (1): 1-39.","cites":null},{"id":18089202,"title":"Reclaiming Marx’s Capital. A Refutation of the Myth of Inconsistency.","authors":[],"date":"2007","doi":"10.1163\/156920610x550668","raw":"Kliman, Andrew. 2007. Reclaiming Marx’s Capital. A Refutation of the Myth of Inconsistency. Lanham, MD: Lexington Books.","cites":null},{"id":18089201,"title":"Reply to Cockshott and Cottrell.","authors":[],"date":"2005","doi":"10.1093\/cje\/bei016","raw":"Kliman, Andrew. 2005. Reply to Cockshott and Cottrell. Cambridge Journal of Economics 29 (2, March): 317-323.","cites":null},{"id":18089194,"title":"Robust Correlations Between Prices and Labour Values: A Comment.","authors":[],"date":"2005","doi":"10.1093\/cje\/bei015","raw":"Cockshott, Paul, and Allin Cottrell. 2005. Robust Correlations Between Prices and Labour Values: A Comment. Cambridge Journal of Economics 29 (2, March): 309-316.","cites":null},{"id":18089208,"title":"Robust Correlations Between Prices and Labour Values: A Comment. Cambridge","authors":[],"date":"2005","doi":"10.1093\/cje\/bei015","raw":"(Cockshott and Cottrell, Robust Correlations Between Prices and Labour Values: A Comment. Cambridge Journal of Economics, Vol. 29, No. 2, March, 2005, pp. 312-313, emphases added.) The precise details of the procedure are often opaque, but the gist of it seems simple enough. First, being unable to know the quantity of socially necessary abstract labour hours embedded in commodities, Cockshott resorts to deducing this number from observable prices.[1] He does so by assuming that the direct number of hours (Marx’s v) is revealed by the dollar wage bill and that the indirect number of hours (Marx’s c) is revealed through iterative imputations of the dollar wage bill incurred in producing the non-labour inputs. And since, in and of themselves, labour values can never be known, this revelation, just like the neoclassical revelation of utility and ‘factor productivity’, can never be falsified. Second, Cockshott doesn’t correlate average unit price with average unit labour time (as revealed by average unit dollar cost with some transformation). Instead, he correlates total sales with total labour values (as revealed by total dollar cost with some transformation). This move from individual commodities to sectoral aggregates introduces the further hazard of spurious correlation (see the linked Excel file). Taken together, these assumptions enable Cockshott to show that there is a tight correlation between the aggregate dollar sales and the aggregate dollar costs of different sectors. What remains unclear is how these unsurprising price correlations relate to Marx’s labour theory of value – and, moreover, why Cockshott is convinced that they constitute a scientific proof of that theory. - 14 -- 15 -","cites":null},{"id":18089198,"title":"The Emergence of Probability. A Philosophical Study of Early Ideas about Probability, Induction and Statistical Inference. London and New York:","authors":[],"date":"1975","doi":"10.1017\/cbo9780511817557","raw":"Hacking, Ian. 1975. The Emergence of Probability. A Philosophical Study of Early Ideas about Probability, Induction and Statistical Inference. London and New York: Cambridge University Press.","cites":null},{"id":18089200,"title":"The Law of Value and Laws of Statistics:","authors":[],"date":"2002","doi":"10.1093\/cje\/26.3.299","raw":"Kliman, Andrew. 2002. The Law of Value and Laws of Statistics: Sectoral Values and Prices in the US Economy, 1977-97. Cambridge Journal of Economics 26 (3): 299-311.","cites":null},{"id":18089193,"title":"The Measure of All Things. The Seven-Year Odyssey and Hidden Error that Transformed the World.","authors":[],"date":"2002","doi":"10.1119\/1.1631891","raw":"Alder, Ken. 2002. The Measure of All Things. The Seven-Year Odyssey and Hidden Error that Transformed the World. New York: Free Press.","cites":null},{"id":18089207,"title":"The Rate of Surplus Value in Puerto Rico.","authors":[],"date":"1975","doi":"10.1086\/260370","raw":"Wolff, Edward N. 1975. The Rate of Surplus Value in Puerto Rico. Journal of Political Economy 83 (5, October): 935-950. . . .’ A Final Note by Bichler and Nitzan December 1, 2010 In his Open Letter, Cockshott claims that ‘In science competing theories are supposed to be evaluated on the basis of their ability to explain observed data’ and that ‘One can propose mechanisms for the labour theory to be confronted with evidence which might refute it’. He further argues that ‘It is much harder to see how the same might be done with the utility theory of value, whose scientific status is thus questionable’. The critique of the neoclassical utility theory of value is certainly correct. One key reason why this theory cannot be tested is that its elementary particle – the util – is unknowable. Neoclassicists bypass this problem – at least in their own minds – by going in reverse: they assume that dollar market prices ‘reveal’ utility and that dollar income flows reveal ‘factor productivity’. With this revelation, they can then go on to ‘measure’ (again, in their own minds) the util quantities of the so-called ‘real economy’ – from the ‘real’ flows of production and consumption to the ‘real’ stocks of assets and capital. Cockshott claims that this isn’t the case with Marx’s labour theory of value. Unlike the neoclassical util, the elementary particle of Marxism – socially necessary abstract labour time – can be objectively observed and measured. ‘It is possible’, he says, ‘to use input-output tables to work out how many hours of labour went into producing the total output of each industry’. But this claim is false. In fact – and as Cockshott knows full well – the only way to ‘know’ labour values is the neoclassical way: by revelation. Whereas neoclassicists assume that prices reveal utils, Marxists assume that prices reveal socially necessary abstract labour time. And that is it. As they stand, the quantities of utils and labour values exist not as empirical observations, but as religious-like visions. They emerge not from open-ended research and scientific exploration, but from circular rituals that make them true by definition. This is how Cockshott himself describe the process in one of his recent works: Unfortunately . . . we have no such independent data on values. This would require a fully disaggregated input-output table along with data on labour inputs in hours. When we - 13 -compute industry values in practice, our primary data are nothing other than industry costs: we infer values from these costs, with unavoidable error. There are three sources of divergence between the underlying true values and the estimates of values derived using industry cost figures. 1. Values are defined in terms of hours of socially necessary labour time, but in most empirical work direct labour hours are proxied by the wage bill. 2. The assumption that the rate of surplus value is uniform across sectors: most if not all empirical work on value employs this assumption, yet it is not likely to be strictly true. 3. The aggregation issue: each of the sectors or industries used in an empirical study represents the aggregation of a wide range of production processes. The aggregation is, of course, done in terms of monetary values. Thus the weights carried by each sub-sector in the formation of any given sector’s figures depend on market prices, which by assumption exhibit some degree of divergence from values.","cites":null},{"id":18089199,"title":"The Taming of Chance. Cambridge and New York:","authors":[],"date":"1990","doi":"10.1017\/cbo9780511819766","raw":"Hacking, Ian. 1990. The Taming of Chance. Cambridge and New York: Cambridge University Press.","cites":null},{"id":18089197,"title":"The Transformation of Prices into Values: Comments on the Chapters by Simon Mohum","authors":[],"date":"1998","doi":null,"raw":"Freeman, Alan. 1998. The Transformation of Prices into Values: Comments on the Chapters by Simon Mohum and Anwar M. Shaikh. In Marxian Economics. A Reappraisal. Volume 2: Essays on Volume III of Capital: Profit, Prices and Dynamics, edited by R. Bellofiore. London: Mcmillan, pp. 270-275.","cites":null},{"id":18089204,"title":"Values, Prices and Wage-Profit Curves in the U.S.","authors":[],"date":"1989","doi":null,"raw":"Ochoa, E. 1989. Values, Prices and Wage-Profit Curves in the U.S. Economy. Cambridge Journal of Economics 13 (3, September): 413-430. - 12 -Porter, Theodore M. 1995. Trust in Numbers. The Pursuit of Objectivity in Science and Public Life. Princeton, N.J.: Princeton University Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":null,"abstract":"Exchange on open letters on the methodologies for testing price value correlations","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Bichler and Nitzan Archives","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.gla.ac.uk:47872<\/identifier><datestamp>\n      2015-12-14T12:39:48Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D48:4842<\/setSpec><setSpec>\n      74797065733D6D6F6E6F6772617068<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><ali:license_ref>http:\/\/creativecommons.org\/licenses\/by-nc-nd\/3.0<\/ali:license_ref><dc:description>Exchange on open letters on the methodologies for testing price value correlations.<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/eprints.gla.ac.uk\/47872\/1\/47872.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>Bichler and Nitzan Archives<\/dc:publisher><dc:subject>HB<\/dc:subject><dc:title>Testing the labour theory of value: An exchange<\/dc:title><rioxxterms:author>Cockshott, W.P.<\/rioxxterms:author><rioxxterms:author>Bichler, S.<\/rioxxterms:author><rioxxterms:author>Nitzan, J.<\/rioxxterms:author><rioxxterms:type>Monograph<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":null,"topics":["HB"],"subject":["HB"],"fullText":""}