{"doi":"10.1243\/09544100JAERO50","coreId":"139912","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4963","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4963","10.1243\/09544100JAERO50"],"title":"Non-linear unsteady aerodynamic model for insect-like flapping wings in the\nhover. Part 2: implementation and validation","authors":["Ansari, S. A.","Zbikowski, Rafal","Knowles, K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-06-30T00:00:00Z","abstract":"The essence of this two-part paper is the analytical, aerodynamic modelling of\ninsect-like flapping wings in the hover for micro-air-vehicle applications. A\nkey feature of such flapping-wing flows is their unsteadiness and the formation\nof a leading-edge vortex in addition to the conventional wake shed from the\ntrailing edge. What ensues is a complex interaction between the shed wakes,\nwhich, in part, determines the forces and moments on the wing. In an attempt to\ndescribe such a flow, two novel coupled, non-linear, wake integral equations\nwere developed in the first part of the paper. The governing equations derived\nwere exact, but did not have a closed analytical form. Solutions were,\ntherefore, to be found by numerical methods and implemented in Fortran. This is\nthe theme of the second part of the paper. The problem is implemented by means\nof vortex methods, whereby discrete point vortices are used to represent the\nwing and its wake. A number of numerical experiments are run to determine the\nbest values for numerical parameters. The calculation is performed using a time-\nmarching algorithm and the evolution of the wakes is tracked. In this way, both\nflow field and force data are generated. The model is then validated against\nexisting experimental data and very good agreement is found both in terms of\nflow field representation and force prediction. The temporal accuracy of the\nsimulations is also noteworthy, implying that the underlying flow features are\nwell captured, especially the unsteadiness. The model also shows the similarity\nbetween two-dimensional and three-dimensional flows for insect-like flapping\nwings at low Reynolds numbers of the order of Re similar to 200","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139912.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1243\/09544100JAERO50","pdfHashValue":"8b864c65a2deb0e6bf68c29dece12813abd3a8dc","publisher":"Professional Engineering Publishing","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4963<\/identifier><datestamp>2012-06-28T14:51:55Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Non-linear unsteady aerodynamic model for insect-like flapping wings in the\nhover. Part 2: implementation and validation<\/dc:title><dc:creator>Ansari, S. A.<\/dc:creator><dc:creator>Zbikowski, Rafal<\/dc:creator><dc:creator>Knowles, K.<\/dc:creator><dc:subject>flapping wings aerodynamic modelling insect flight micro-air vehicle design vortex methods low reynolds-numbers leading-edge vortex kutta condition flow visualization flight vortices rotation force performance generation<\/dc:subject><dc:description>The essence of this two-part paper is the analytical, aerodynamic modelling of\ninsect-like flapping wings in the hover for micro-air-vehicle applications. A\nkey feature of such flapping-wing flows is their unsteadiness and the formation\nof a leading-edge vortex in addition to the conventional wake shed from the\ntrailing edge. What ensues is a complex interaction between the shed wakes,\nwhich, in part, determines the forces and moments on the wing. In an attempt to\ndescribe such a flow, two novel coupled, non-linear, wake integral equations\nwere developed in the first part of the paper. The governing equations derived\nwere exact, but did not have a closed analytical form. Solutions were,\ntherefore, to be found by numerical methods and implemented in Fortran. This is\nthe theme of the second part of the paper. The problem is implemented by means\nof vortex methods, whereby discrete point vortices are used to represent the\nwing and its wake. A number of numerical experiments are run to determine the\nbest values for numerical parameters. The calculation is performed using a time-\nmarching algorithm and the evolution of the wakes is tracked. In this way, both\nflow field and force data are generated. The model is then validated against\nexisting experimental data and very good agreement is found both in terms of\nflow field representation and force prediction. The temporal accuracy of the\nsimulations is also noteworthy, implying that the underlying flow features are\nwell captured, especially the unsteadiness. The model also shows the similarity\nbetween two-dimensional and three-dimensional flows for insect-like flapping\nwings at low Reynolds numbers of the order of Re similar to 200.<\/dc:description><dc:publisher>Professional Engineering Publishing<\/dc:publisher><dc:date>2011-03-18T10:01:32Z<\/dc:date><dc:date>2011-03-18T10:01:32Z<\/dc:date><dc:date>2006-06-30T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0954-4100<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1243\/09544100JAERO50<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4963<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0954-4100","issn:0954-4100"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["flapping wings aerodynamic modelling insect flight micro-air vehicle design vortex methods low reynolds-numbers leading-edge vortex kutta condition flow visualization flight vortices rotation force performance generation"],"subject":["Article"],"fullText":"Non-linear unsteady aerodynamic model for insect-like\nflapping wings in the hover. Part 2: implementation\nand validation\nS A Ansari\u0001, R Z˙bikowski, and K Knowles\nDepartment of Aerospace, Power, and Sensors, Cranfield University, Defence Academy of the United Kingdom,\nShrivenham, UK\nThe manuscript was received on 4 October 2005 and was accepted after revision for publication on 3 January 2006.\nDOI: 10.1243\/09544100JAERO50\nAbstract: The essence of this two-part paper is the analytical, aerodynamic modelling of\ninsect-like flapping wings in the hover for micro-air-vehicle applications. A key feature of\nsuch flapping-wing flows is their unsteadiness and the formation of a leading-edge vortex in\naddition to the conventional wake shed from the trailing edge. What ensues is a complex inter-\naction between the shed wakes, which, in part, determines the forces andmoments on the wing.\nIn an attempt to describe such a flow, two novel coupled, non-linear, wake integral equations\nwere developed in the first part of the paper. The governing equations derived were exact, but\ndid not have a closed analytical form. Solutions were, therefore, to be found by numerical\nmethods and implemented in Fortran. This is the theme of the second part of the paper. The\nproblem is implemented by means of vortex methods, whereby discrete point vortices are\nused to represent the wing and its wake. A number of numerical experiments are run to\ndetermine the best values for numerical parameters. The calculation is performed using a\ntime-marching algorithm and the evolution of the wakes is tracked. In this way, both flow\nfield and force data are generated. The model is then validated against existing experimental\ndata and very good agreement is found both in terms of flow field representation and force\nprediction. The temporal accuracy of the simulations is also noteworthy, implying that the\nunderlying flow features are well captured, especially the unsteadiness. The model also shows\nthe similarity between two-dimensional and three-dimensional flows for insect-like flapping\nwings at low Reynolds numbers of the order of Re \u0001 200.\nKeywords: flapping wings, aerodynamic modelling, insect flight, micro-air vehicle design,\nvortex methods\n1 INTRODUCTION\nIn thefirst part of this two-part paper [1], a non-linear,\nunsteady quasi-three-dimensional analytical model\nfor hovering flapping-wing flight was developed. In\nthe formulation, the flow associated with insect-like\nflapping flight was decoupled into wake-free (quasi-\nsteady) and wake-induced (unsteady) components.\nUsing the concept of radial chords and radial\ncross-planes [1, section 2.1.1], a blade-element-type\nmethod was used to extend the approach from\ntwo-dimensions to three-dimensions.\nBecause of the high angles of attack encountered in\ninsect flight, separation is observed fromboth leading\nand trailing edges [2–4] in the form of a leading-edge\nvortex (LEV) and the usual trailing-edge wake.\nThese wakes, together with the unsteady motion of\nthe wing, determine the forces and moments on the\nwing. By enforcing the Kutta–Joukowski condition\nat the wake-inception points and by observing\nKelvin’s law that the total circulation in a control\nvolume enclosing the wing and its wake is constant,\nthe flow equations were solved in accordance with\nLaplace’s equation.\n\u0001Corresponding author: Department of Aerospace, Power,\nand Sensors, Cranfield University, Defence Academy of the\nUnited Kingdom, Shrivenham SN6 8LA, UK. email: s.a.ansari@\ncranfield.ac.uk\n169\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nAs a result, two non-linear wake integral equations\nwere derived that, between them, described the flow\nin its entirety. Although these equations are exact,\nthey do not have a closed analytical form and must\nbe solved by numerical methods. Vortex methods\nare used to implement this solution and study the\nvalidity of the model. This is the aim of this part of\nthe paper.\nThis paper is organized as follows. In section 2,\na brief review of vortex methods shows the basic\nelements of the numerical method that are used to\nsolve the time-dependent problem. This is followed\nby a section dedicated to the numerical implemen-\ntation of the flapping-wing model (section 3). The\nconversion of the relevant equations to forms amen-\nable to numerical calculation is discussed together\nwith a description of the calculation procedure. A\nnumber of factors pertinent to the numerical pro-\ncedures are also addressed. The section concludes\nwith a discourse on numerical experiments that\nwere run to establish the values of various para-\nmeters. In section 4, the validation of the current\nmodel is discussed in detail. The first part of this\nsection considers comparison of flow-visualization\nfrom some existing experiments with results from\nthe current model. In the next part of this section,\nforce data are compared with experimental values\nfrom the literature. A description of the flow kin-\nematics is also presented and the section concludes\nwith the identification of some limitations of this\nmodel. Finally, in section 5, conclusions for the cur-\nrent paper as well as for the whole study are\npresented.\nIn what follows, frequent reference is made to the\nwork presented in the first part of this paper [1] and is\nreferred to as Part 1.\n1.1 Vortex methods\nAll real flows feature some form of rotational motion\ndeveloped in regions adjacent to flow surfaces or in\nthe downstream wake of bodies. Another feature of\nreal flows is separation, usually originating at sharp\ncorners or produced as a result of adverse pressure\ngradients. Vortex methods attempt to model these\nflows by discretization of the distributed vorticity or\nseparated shear layers by a finite number of small\ndiscrete vortex elements and this is the approach\nused to solve the non-linear integral equations\ndeveloped in Part 1 [1].\nHistorically, Rosenhead [5] was probably the first\nto study the unsteady motion of two-dimensional\nvortex sheets. In his method, a vortex sheet is\nreplaced by a (small) finite number of discrete\npoint vortices that are ‘free’ (they cannot sustain\nKutta–Joukowski forces) and, hence, move at the\nlocal Kirchhoff velocity [6]. The convection of\nthe vortices is governed by the Rott–Birkhoff\nnon-linear integro-differential equation [7, 8],\nwhich is essentially an extension of the Biot–Savart\nlaw and states that\nq(z) ¼ \u0002 {\n2p\nþ\nC\ndG0\nz(G, t)\u0002 z(G0, t)þ UE \u0002 {VEð Þ (1)\nwhere (UE, VE) are the components of the external\nirrotational velocity field evaluated at z, circulation G\nis the Lagrangian variable, and 0 (the ‘prime’ symbol)\nrefers to all vortices other than the one in question.\nA number of vortex convection schemes are\nfound in the literature. The most common is the\nsimple forward Euler scheme. This is a first-order\nscheme and is used here in a modified form to\ninclude sub-time-steps for increased accuracy, thus\nz(t þ dt) ¼ z(t)þ n\nXn\ni¼1\nqi(t)\ndt\nn\n(2)\nwhere dt represents the duration of each time-step\nand n is the number of substeps per time-step and\nwhere the convection velocity qi is evaluated at\neach sub-time-step.\nAs the distance between a pair of vortices\ndiminishes, the error of the Euler scheme increases,\nbecause induced velocities become very large (see\nequations (1) and (2)). It has, therefore, become\ncommonplace to use ‘desingularization’ schemes to\nremove the infinite velocities at vortex centres.\nProbably the most common approximation is to\nuse the Lamb–Oseen vortex, which is based on an\nexact Navier–Stokes solution of the one-dimensional\nlaminar flow around a single viscous vortex in an\nunbounded incompressible domain [9, 10]. In the\nmethod used here, the model proposed by Vatistas\net al. [1] is used, which gives a very good approxi-\nmation to the Lamb–Oseen vortex (Vatistas et al.\nactually gave a more generic form. The version\nquoted above is of order 2 and shows good agree-\nment with the Lamb–Oseen vortex.), thus\nvu(r) ¼ G\n2p\nrffiffiffiffiffiffiffiffiffiffiffiffiffiffi\nr4c þ r4\np (3)\nwhere vu(r) is the circumferential velocity at a dis-\ntance r from the vortex centre and rc is the vortex-\ncore radius.\nAnother way of limiting the effects of the unrealis-\ntically high induced velocities on vortices in close\nproximity is to amalgamate them, i.e. merge two or\nmore vortices into one representative vortex. This\nmethod is used here because of its added benefit\nof reducing computation time (CPU flops). The\nusual rules of vortex amalgamation are observed:\ncirculation and impulse of circulation are preserved\n170 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\nduring amalgamation [12–14]. Two vortices are\nmerged if they are of like-sign and when the distance\nbetween their vortex centres falls below a certain\nvalue. In this case, the criterion proposed by Spallart\n[12] was used; vortex merging began when\nGiGj\nGi þ Gj\n\u0002\u0002\u0002\u0002\n\u0002\u0002\u0002\u0002dij , 1 (4)\nwhereGi andGj are the circulations of the vortices tobe\nmerged, dij is their separation and 1 is a small number.\n2 IMPLEMENTATION\nThe current approach is formulated as an initial-\nvalue problem, in that, the initial conditions are\nknown and the flow is solved for all subsequent\ntimes using a time-marching algorithm.\nIn the unsteadymotion of an aerofoil, the kinematic\nboundary condition induces velocities over the\naerofoil surface. These upset the Kutta–Joukowski\ncondition that the trailing edge must be a stagnation\npoint. A similar condition holds for the leading edge\nwhere separation is also observed in insect-like\nflapping wings. The Kutta–Joukowski condition\nis, therefore, enforced by the ‘creation’ of bound\ncirculation.\nIn the current formulation, a pair of vortices is shed\nat every time-step, one each from the leading and\ntrailing edges in accordance with Kelvin’s law and to\nsatisfy the Kutta–Joukowski conditions there. Over\nthe duration of the time-step, these ‘free’ vortices\nconvect with the local Kirchhoff velocity, so that at\nthe next time-step, the Kutta–Joukowski condition is\ndisturbed once again. In addition, the kinematics of\nthe wing and the associated boundary condition may\nhave changed so that the velocity distribution on the\nwing isaltered further.TheKutta–Joukowskicondition\nis restored by shedding another pair of vortices from\nthe respective edges. The shed vortices are convected\nat the local velocity. This process repeats over time\nand wakes from both separation edges evolve. A spin-\noff of themethod is that a time history of the evolution\nof the wake is automatically generated, which is\nuseful in demonstrating the physics of the flow.\n2.1 Discretization of equations for numerical\nsolution\nSome of the equations derived in Part 1 [1, section 3]\nparticularly non-linear and do not have closed-form\nsolutions. Therefore, they must be solved using\nnumerical schemes. Before numerical methods can\nbe applied, however, the equations (as necessary)\nmust be converted to forms that are amenable to\nnumerical computation.\nThe equations for quasi-steady (wake-free) circu-\nlation are straightforward and can be computed\ndirectly from their derived forms (Part 1, equations\n(17) and (18)). The expression for wake-induced vor-\nticity (Part 1, equation (26)) is a little more complex\nas it involves non-linear wake integrals. In its discre-\ntized form, it is given by\ng1(u, t)jwkþlv ¼ \u0002\nG0(t)\n2pR\n\u0002 1\n2pR\n\u0003\nXnwk\ni¼1\n< Zwk þ Re\n{u\nZwk \u0002 Re{u\n\u0003 \u0004\ngwk dZwk\n\"\nþ\nXnlv\ni¼1\n< Zlv þ Re\n{u\nZlv \u0002 Re{u\n\u0003 \u0004\nglv dZlv\n#\n(5)\nwhere the subscripts wk and lv refer to the trailing-\nedge wake and LEV, respectively, and n refers to\nthe number of shed vortices. Before equation (5)\ncan be evaluated, however, all circulations dGwki\nand dGlvi must be known. This is true for all circula-\ntions except for the latest shed vortices dGwkn and\ndGlvn . The latter are computed by solving the two\nwake integral equations derived in Part 1 (Part 1,\nequations (22) and (25)). Although these equations\ninvolve non-linear integrals, upon discretization as\nin equation (5), they reduce to two linear simul-\ntaneous equations of the form Axþ By ¼ C, which\ncan be solved together for the circulations of the\nlatest shed vortices dGwkn and dGlvn (full details in\nreference [15, section 5.1.2]). Actually, two\n‘unknowns’, the positions of the latest shed\nvortices (Zwkn and Zlvn), still remain and these are\nestimated from the movement of the shedding\nedge and the position of the previous shed vortex\n(section 3.2.1).\n2.2 Calculation procedure\nThe calculation process, which is shown in Fig. 1,\nwas implemented by means of a Fortran routine\n(discussed subsequently). The basic procedure that\nis followed is outlined below.\n1. The computation is started by loading the various\nvariables, reading in simulation parameters, and\ninitializing them to the desired values.\n2. The wing planform to be solved for is divided into\nthe required number of wing sections (blade\nelements), using the radial chord concept intro-\nduced in Part 1 (Part 1, section 2.1.1).\n3. Because all wing sections are on the same wing,\nthey share common global kinematics in\nterms of sweep parameters (f, f˙), inclination\nparameters (u, u˙), and pitch parameters (a, _a).\nThese are computed next.\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 171\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\n4. The program then descends into calculations for\neach spanwise section.\n(a) First, the shape and coordinates of the aerofoil\nsection are computed.\n(b) Then, the specific kinematics for the wing\nsection are deduced from the global kin-\nematics computed earlier.\n(c) With the information deduced thus far, the\nquasi-steady (wake-free) vorticity and circula-\ntion can computed.\nThese substeps are repeated for each wing section.\n5. Now that all the basic and quasi-steady para-\nmeters for each wing section have been com-\nputed, the time-marching algorithm for the\nunsteady flapping-wing problem is invoked. All\ncomputations are carried out in the body-fixed\ncoordinate system (in the z- or Z-plane, as appro-\npriate). At each time-step, the following processes\nare undertaken.\n(a) The latest trailing-edge vortex and LEV are\nshed and positioned appropriately in the\nwake.\nFig. 1 Overview of calculation procedure\n172 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\n(b) The circulations of these latest wake and LEV\nvortices are then computed by simultaneously\nsolving the wake integral equations.\n(c) The presence of the new vortices upsets the\nzero-through-flow boundary condition at the\naerofoil surface, so this is corrected by\nadding additional bound vorticity. This is\ncomputed in this step using equation (5).\n(d) The circulation and positions of all bound\nand shed vortices are used to compute the\nimpulse and moment of impulse (for later\nforce and moment calculation) in the trans-\nlating aerofoil-inertia system.\n(e) Now that all computations for the current\ntime-step have been completed and all\nnecessary variables determined, the entire\nwake system is convected and re-oriented in\npreparation for the, subsequent time-step,\naccounting for any change in pitch angle (a)\nand wing location (l, h).\nThese above substeps are performed for each wing\nsection.\n6. Once time marching has been completed, forces\nand moments can be computed from the\nimpulses and moments of impulse, respectively,\nthat were computed earlier. This is done for\neach wing section.\n7. The performance of the entire wing is obtained by\nsumming the contributions of the individual wing\nsections.\n8. Finally, data and log files for the simulation are\nwritten to disk, all arrays are de-allocated to\nfree-up memory, and the simulation is\nterminated.\n2.2.1 Some aspects of the calculation procedure\nA number of aspects of the calculation need further\ndetailing.\n2.2.1.1 Forces and moments. Forces and moments\nare computed in the translating aerofoil–inertia\nsystem (z^-system in Part 1, Fig. 6) that moves with the\naerofoil and remains horizontal throughout and in\nwhich the origin coincides with the wing pitch axis.\nLift L is defined as the vertical force opposing gravity,\nacting in the direction of the positive h^-axis. Thrust T\nis defined as the horizontal force perpendicular to\nlift, but always acting in the direction of motion of\nthe wing (along the j^-axis) and drag D is the net\nhorizontal force (parallel to thrust, but always\nacting in the direction of the positive j^-axis).\n2.2.1.2 Aerofoil discretization. The aerofoil shape\nin the physical (z) plane is derived from a circle in\nthe Z-plane using a Joukowski-type transformation\n(Part 1, equation (1)). The aerofoil coordinates are\nequally spaced on the circle Z ¼ Re{u in the circle\nplane. The advantage of this is that, upon transform-\nation into the physical plane, the resulting aerofoil\nhas much tighter spacing in the leading- and trail-\ning-edge regions than elsewhere. This is useful for\naccurately enforcing the Kutta–Joukowski condition\nat the two flow-separation edges.\n2.2.1.3 Kinematics. The sweep angle at any point\nis defined by the angular displacement f from the\nmean position. f is generally positive at the start of\nthe downstroke and negative at the end of it\n(Fig. 2). The reverse is true for the upstroke. The\ntime rate of change of sweep is defined by the angu-\nlar velocity _f and the stroke amplitude is denoted by\nF. In a similar manner, the inclination angle above\nthe stroke plane is defined by u and the time rate of\nchange of inclination by the angular velocity _u\n(Fig. 2).\nUsing the radial cross-plane analogy (Part 1, sec-\ntion 2.1.1), sweep and inclination are converted\ninto lunge (l, _l ) and heave (h, _h), respectively,\nwhere the (_) refers to time rate-of-change. Pitch\n(or pitch rate) is defined as the angular displacement\n(or velocity) about the common pitch axis and is the\nsame for all wing sections.\n2.2.1.4 Vortex placement. Traditionally, the latest\nshed vortex is positioned along the path of the shed-\nding edge (leading or trailing edge) since the last\ntime-step [16, section 13.8.2]. The approach used\nhere is similar, but the latest vortex is placed instead\nat one-third of the distance from the shedding edge\nto the previous vortex (equation (6)) (Fig. 3).\nThe use of the one-third distance can be explained\nas follows. The discrete point vortices that are shed\nare an approximation to the vortex sheet emanating\nfrom the shedding (leading or trailing) edge. There-\nfore, each shed vortex actually represents a vortex\nelement of length, say dz, and is placed approxi-\nmately in the middle of this element. In this way,\nthe centre of the latest shed vortex is (1\/2)dz distant\nfrom the shedding edge (Fig. 3(a)).\nAt the next time-step, the last vortex has convected\nwith the flow and the aerofoil has moved some dis-\ntance. Assuming that the time-step is small enough,\nthe new vortex element is of similar length to the\nprevious one (\u0004dz) and, as before, the new discrete\nvortex is positioned at its centre (Fig. 3(b)). The\ndistance from the previous vortex to the shedding\nedge along the vortex sheet is then\u0004 (3=2)dz, whereas\nthe new vortex is \u0004 (1=2)dz from the same edge, i.e.,\nthe new vortex is located at about one-third of the\ndistance along the vortex sheet to the previous shed\nvortex from the shedding edge (Fig. 3(b)).\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 173\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nThe location of the new vortex is then approxi-\nmated by drawing a vector from the shedding edge\nto the previous shed vortex and taking the position\nat one-third this distance, that is\nzt ¼ zedge þ\n1\n3\nzedge \u0002 zt\u00021\n\u0005 \u0006\n(6)\nThe advantage of the current approach over the\ntraditional one is that account is taken not only of\nthe wing motion since the last time-step but also of\nthe convection of the previous shed vortex, giving\noverall a more accurate depiction of the flow.\nAs regards the first shed vortex, its position is\ndetermined from the local velocity at the shedding\nedge. If this complex velocity is q and time-step\nsize is dt, then the first vortex is placed at\nzt ¼\n1\n2\n\u0001qdt\nwhere \u0001q refers to the complex conjugate of q. As the\nsolution progresses, the accuracy of this initial place-\nment is of negligible consequence (provided time-\nstep size is reasonably small).\n2.2.1.5 Wake convection. At the end of each time-\nstep, the whole problem is converted to the inertial\ncoordinate system (~z-system in Part 1, Fig. 6) and\nthe wakes from each of the leading and trailing\nedges are convected using a discretized form of the\nRott–Birkhoff equation (equation (1)). During\nstroke reversals, the severity of the wing motions\nwarrants the need for finer resolution, and more\nsub-time-steps are used (section 4).\n2.2.1.6 Sub-time-steps. The sub-time-stepping\nscheme utilized in the current work is based on\nequation (2) with n set to 1, 2, or 4, depending on\nthe severity of the kinematics. A measure defined\nby the ratio of the normal kinematic velocity of the\nFig. 2 Definition of sweep (top) and inclination (bottom) parameters. Only port wing is shown\n174 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\ntrailing edge to the number of chord lengths it travels\nin a time-step is used to set the value of n. By defining\nthe ratio in this way, the number of sub-time-steps\nmay be different for each wing section, depending\non both chord length and local velocity.\n2.2.1.7 FORTRAN code. The aforementioned com-\nputational schemes were implemented bymeans of a\nFortran program. The choice of using Fortran as the\nprogramming language was mainly due to its intrin-\nsic capability of handling complex numbers, which\nmade for easy conversion of the complex-variable-\nbased analysis in the current work into computable\ncode. All computations were performed in\ndouble precision because of the extensive use of\ndifference formulae in the computation of forces\nand moments (Part 1, section 3.2).\nThe size of the compiled program was quite small\n(of the order of 2.0 MB). Memory requirements, how-\never, were determined at runtime, depending on the\nnumber of wing sections and time-steps. Typically,\n10 MB was required for 16 000 section-time-steps\n(e.g. eight wing sections with 2000 time-steps\neach). The program was compiled using the Intel\nFortran Compiler v. 8.0 on a Linux workstation run-\nning RedHat 9.0. The program was also run on the\nsame machine, which was a single-processor Dell\nPrecision 360 workstation with a 2.66 GHz Intel\nPentium 4 processor. A typical run with 6400 sec-\ntion-time-steps took \u000110 min to complete.\nThe bottleneck for the programwas the convection\nsubroutine, where approximately 4n 2 velocity com-\nputations were made at each time-step (where n is\nthe current time-step). Simulation times, however,\nscaled roughly as n 2.5 owing to the different\nnumber of sub-time-steps used by each wing sec-\ntion. Computation time also depended on the\nnumber of stroke reversals in the simulation (when\nmore sub-time-steps were required) and also on\nwhether vortex amalgamation was employed.\n2.2.2 Numerical modifications\nOwing to the nature of the numerical implemen-\ntations and the limitations of the inviscid potential\nmethod on which they were based, situations arose\nwhere the behaviour of the wakes gave rise to high\nfluctuations in the associated forces and moments\n(owing to unrealistically large wake deformations).\nIn reality, such variations are limited or dampened\nby viscosity. Therefore, it was necessary to introduce\nsuch limitations artificially as necessary.\n2.2.2.1 Kutta–Joukowski condition relaxation. During\nthe more extreme phases of insect-like flapping\nflight (such as stroke reversals), it was found that\nthe newly shed vortices acquired circulations that\ncould be as much as three orders of magnitude\nhigher than the previous shed vortex, all in an effort\nto satisfy the Kutta–Joukowski condition at the\nFig. 3 Vortex placement (wake deformations are exaggerated for clarity)\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 175\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nvortex-shedding edge. In such cases, the subsequent\nvortex that was shed was also of similarly large\nstrength but of opposite sense to ensure stagnation\nat the shedding edge, and the process continued for\na number of time-steps. The situation occurred\nmore commonly during wake re-entry when the\nwing’s leading and\/or trailing edge passed in close\nproximity to previously shed vortices.\nIt was, therefore, necessary to curb the circulation\nstrengths of the shed vortices in such situations,\nthereby temporarily not satisfying the Kutta–\nJoukowski condition (Crighton [17] considered the\nvalidity of the Kutta–Joukowski condition in un-\nsteady flows. In practice, the condition appears to\nhold [18], especially for helicopter aerodynamics\nwhere the kinematics are not too severe [19].) for\nthat particular time-step. In reality, viscosity is\nlikely to introduce similar limitations. Indeed, on\nthe basis of the assumption that the mean velocity\nof flow from the trailing edge is finite and non-zero,\nGiesing [20] was able to infer that the vortex sheet\nwas shed parallel to either the upper or the lower\nsurface of the trailing edge, depending on the\ndirection of shed vorticity. Maskell [21] later came\nto the same conclusion. Mook and Dong [22] applied\nthe Giesing–Maskell model and showed that the\nsurface of separation could be deduced from the\nrate of change of bound circulation dG=dt. When\ndG=dt . 0, the streamline along the lower surface\nleaves the aerofoil smoothly. Conversely, when\ndG=dt , 0, the flow relative to the aerofoil comes\nsmoothly off the upper surface. In the steady-state\ncase of dG=dt ¼ 0, the stagnation streamline bisects\nthe trailing-edge angle. Later experiments by Poling\nand Telionis [23, 24] corroborated these results.\nDuring stroke reversals, the velocity vector of the\nflow at the aerofoil-trailing edge, for example, is\ncloser to perpendicular to the aerofoil surface than\nit is parallel to it. In such cases, the smooth-flow\nKutta–Joukowski condition is likely to be tempor-\narily relaxed. Circulation strengths of shed vortices,\ntherefore, were curbed by imposing a circulation\nlimit. A recent computational fluid dynamics (CFD)\nstudy by Sun and Boyd [25] has shown that for a\nflat plate at a Reynolds number Re ¼ 135, the slip\nvelocity on the aerofoil surface, especially near the\nleading and trailing edges was significant. Therefore,\nthe concept of relaxing the Kutta–Joukowski\ncondition (as proposed here) is not unrealistic in\nthese flow regimes.\n2.2.2.2 Smoothing. Another artefact of the\nnumerical simulations was the appearance of\nspikes (both positive and negative) in the force and\nmoment data, each time the wing entered its own\nwake and, especially, during stroke reversals. This is\nan artefact of the method used for computing\nforces and moments (Kelvin’s impulse method).\nAs a wing traverses through a wake, the free vortices\npart to either side of it, so that some vortex positions\nthat were in ‘positive’ locations with respect to the\ntranslational aerofoil-inertia axis in one time-step\nsuddenly acquire ‘negative’ positions, and vice\nversa. This leads to large changes in impulses and\nmoments of impulse and, hence, artificial spikes in\nforce and moment data (forces and moments\nare computed as the time rate of change of impulse\nand moment of impulse respectively (Part 1,\nsection 3.2).\nSuch spikes increased as the number of flapping\ncycles increased owing to the increasing number of\nencounters with previously shed wakes. It was, there-\nfore, necessary to remove such spikes and this was\nachieved bymeans of a simple least-squares smooth-\ning technique.\n2.3 Numerical experiments\nThe analytical approach used in the current work\nrelies in its implementation on the use of numerical\ntechniques. Hence, it is inevitable that some depen-\ndence on numerical parameters exists. A study was,\ntherefore, conducted to describe these character-\nistics of numerical solutions with a view to determine\nthe best values for the numerical parameters. This\nwas achieved by running a number of numerical\nexperiments.\nTwo different wing shapes were used for this series\nof investigations – Dickinson’s Robofly wing\n(Fig. 4(a)) and a wing shape derived from four ellipti-\ncal arcs (similar to that of a hoverfly) see (Fig. 4(b))\nand referred to as generic from hereon. The reason\nfor using two wing shapes was to remove any\ndependence of the numerical parameters on\nwing geometry. The kinematics were provided by\nDickinson (private communication) from his Robofly\nexperiments [4, 26], and are henceforth referred to as\nDickinson’s data (Fig. 8).\n2.3.1 Effect of number of wing sections\nThe wing was radially divided into a number of sec-\ntions nsec and the overall effect achieved by summing\nthe individual contributions. A high number of wing\nsections gives better resolution in terms of force and\nmoment data but comes at the cost of computing\ntime and power. Hence, it was necessary to deter-\nmine the minimum number of wing sections that\ncould reasonably reproduce the results at high resol-\nution. A study on this effect showed that mean forces\nconverged for nsec 5 20, implying that this value of\nnsec would yield the best results within the accuracy\nof the model.\n176 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\n2.3.2 Effect of aerofoil discretization\nAerofoil discretization nfoil refers to the number of\nelements that the aerofoil is divided into. Apart\nfrom enforcing the zero-through-flow boundary con-\ndition more rigorously, higher aerofoil discretization\nreduces the chances of free vortices accidentally\npenetrating the wing during the convection phases\nof the computation. However, the investigation into\nits effect showed that aerofoil discretization had\nlittle influence on the overall result and a value of\nnfoil ¼ 50 was chosen conservatively.\n2.3.3 Effect of time-step size\nAlthough time-step size is bound to influence the\nsolution, it is not a universal parameter in that it\nshows different trends for the same wing shape at\ndifferent flapping frequencies. A faster wing moves\nfurther in the same time than a slower wing, and\ntherefore, demands higher time resolution to yield\naccurate results. A different parameter was, there-\nfore, defined, which would circumvent the limitation\nof the time-step: the mean angle swept by the wing\nper time-step.\nFor the cases investigated, the simulations were\nrun for one cycle (downstroke and upstroke), which\nswept two arcs of 1808 each as per Dickinson’s\nkinematics. The trend from this study showed that\nforce data generally got less peaky with decreasing\ntime-step size (or mean angle per time-step). Careful\nconsideration of the trend showed that a time-step\nsize of 0.01 s (mean angle per time-step of 0.68)\ngave the best compromise between large time-step\nsize and convergent results, and was chosen for all\nsubsequent simulations.\n2.3.4 Effect of vortex-core size\nIn the current implementation, the Vatistas vortex\nhas been used to desingularize the potential vortex\n(equation (3)) so that each vortex exhibits a solid-\nbody rotation near its centre and a constant vortex-\ncore size was used throughout the simulation. In\nthis study, vortex-core size appeared to have negli-\ngible effect on the overall performance except for\nvery large values where the force data began to\ndiverge from the ‘norm’ due to insufficient roll-up.\nThis argument would imply benefit in using small\nvortex cores. However, as vortex-core size reduces,\nthe potential vortex limit is approached and the\ninduced velocities near its centre become unrealisti-\ncally high. The result is that vortices in close proxi-\nmity begin to orbit each other, giving rise to jagged\nvortex sheets. Therefore, an intermediate value of\nvortex-core size was chosen for subsequent compu-\ntations as the best compromise for smooth vortex\nsheets and sufficient roll-up. This value of vortex-\ncore radius corresponded to approximately 2.5–5.0\nper cent of the wing section chord.\n2.3.5 Effect of vortex amalgamation\nThe benefit in computing time due to vortex amalga-\nmation comes at the cost of accuracy of the calcu-\nlations and of flow representation. It was, therefore,\nnecessary to determine the limit to which this pro-\ncess could be exploited before adverse effects on\nthe accuracy of the calculation surfaced. This\nnumerical experiment showed that savings in com-\nputation times only became significant for e .\n5\u0003 10\u00027 (where e is the amalgamation threshold)\n(equation (4)). As regards the effect on the accuracy\nof the computation (measured here in terms of devi-\nation from the amalgamation-free results), this\nbecame noticeable only beyond e . 10\u00026. In view of\nthis finding, a value of e ¼ 10\u00026 was used for the\namalgamation threshold e.\nOne aspect of vortex amalgamation that is not\nimmediately obvious is the possibility of abnormally\nlarge convection of adjacent vortices. Vortices of\nlike-sign merge to form stronger vortices. Therefore,\nit is possible for two groups of vortices of opposite\nsenses in close proximity to merge into two large\nvortices of opposite signs (Fig. 5), which may then\nconvect far away from the wing owing to mutual\nFig. 4 Wing planforms used for numerical\nexperiments\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 177\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nconvection. Therefore, vortex amalgamation must be\nimplemented with caution.\n3 VALIDATION\nThe model developed in the current work was tested\nand validated against experimental data for the\nassessment of its validity and limitations. Data\nfrom two sets of experiments were used for this\nmodel-verification process. The first data set was\nadapted from the experiment of Dickinson and\nGo¨tz [27] for flow field comparison to assess the\nverity with which the current theoretical model\ncaptured the physics of the flow. Force data from\nRobofly experiments provided by Dickinson (private\ncommunications) served as the second data set for\nthe validation of the lift and thrust predictions.\n3.1 Flow visualization comparison with\nDickinson and Go¨tz [27]\nThe original experiment was conducted by Dickinson\n& Go¨tz [27] in a glass aquarium filled with a 54 per\ncent sucrose solution. A rectangular wing with 5 cm\nchord and 15 cm span was traversed in a straight\nline and at constant angle of attack through this\nsolution between a pair of baffles to limit any\nthree-dimensional tip flow. The wing was impul-\nsively started, accelerated at 62.5 cm\/s2 to a constant\nspeed of 10 cm\/s, and then rapidly brought to rest\nafter travelling 37.5 cm (7.5 chord lengths). Experi-\nments were run for wing angle of attack ranging\nfrom 298 to þ908 in steps of 4.58. The Reynolds\nnumber for the experiment was 192 (based on chord).\nThe conditions for the Dickinson and Go¨tz experi-\nment were reproduced, and the flow equations were\nsolved for using the current inviscid potential model.\nThe wing was replaced by a thin, flat plate (The wing\nused in the Dickinson and Go¨tz experiment was\n1 mm thick giving it a thickness-to-chord ratio of 2\nper cent making the thin-wing assumption a valid\none.), and only the cases of large angles of attack\n(a5 22:58) were considered, where Dickinson and\nGo¨tz had identified the definite presence of a LEV.\nThe kinematics for the experiment are shown in\nFig. 6.\nDickinson and Go¨tz presented flow-visualization\nphotographs for the case of angle of attack of 458.\nThese are compared with the results from the current\nmodel in Fig. 7. Good agreement can be seen\nbetween the viscous experiment and the inviscid,\ntheoretical prediction, despite the very low Reynolds\nnumber.\nThe flow-visualization photographs were for fixed\ninstances in time ranging from one to four chord\nlengths of travel. After one chord length of travel,\nflow has begun to separate from both leading and\ntrailing edges (Fig. 7(a)). Flow from the leading\nedge has rolled up very tightly because of the influ-\nence of the bound vorticity on the wing. The trail-\ning-edge vortex has also rolled up albeit less than\nthe LEV, being ‘freer’ than the latter. As the wing\nmoves, roll-up continues in both vortices, but the\nLEV also grows significantly in size, lifting off slowly\nfrom the wing surface (Fig. 7(b)).\nAt this point, the original trailing-edge vortex has\nreached a near-constant size but continues to roll\nup. Owing to its growing size and strength, the LEV\ncauses flow from the trailing edge to roll up into a\nsecond trailing-edge vortex that spills forward onto\nFig. 5 Vortex amalgamation problems\nFig. 6 Translational motion kinematics used by\nDickinson and Go¨tz [27]\n178 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\nFig. 7 Comparison of flow-visualization results from the current inviscid theoretical model\n(left) with the Dickinson and Go¨tz [27] experiment at Re ¼ 192 (right). The numbers 1 to\n4 refer to the number of chord lengths travelled since impulsive start\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 179\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nthe wing surface (Fig. 7(c)). This roll-up eventually\nleads to the distortion of the LEV and finally vortex\nbreakdown occurs (Fig. 7(d)). The theoretical predic-\ntion even captures the triangular structure on the\nright-hand side of the rolled-up end of the distorted\nLEV after four chord lengths of travel (Fig. 7(d)).\nEventually, the LEV breaks away from the wing\n(data not shown) and a new one begins to form. As\nthis second LEV begins interaction with the existing\nsecond trailing-edge vortex, the wing is rapidly\nbrought to a halt. The result is the shedding of two\nstopping vortices, one each from the leading and\ntrailing edges.\n3.2 Force comparison with Robofly experiments\nThe comparison presented in this section is based on\nthe data provided by Dickinson (private communi-\ncation) from the setup that was used by Birch and\nDickinson [4]. A scaled-up model of the wing of the\nfruit fly Drosophila dubbed the Robofly was used\n(Fig. 4(a)), in which the wing executed an insect-\nlike flapping motion at a frequency of \u00010.17 Hz\nwith the wing tip tracing out a flat figure-of-eight.\nThe wing swept a semicircular arc (F ¼ 1808), this\nbeing possible, because only one wing was used\n(no mechanical interference from the ‘other’ wing).\nThe experiment was conducted in a tank of mineral\noil (of density 880 kg\/m3), which produced a\nReynolds number of 160 (based on mean chord and\nmean tip speed). Data were provided for four com-\nplete cycles (or eight halfstrokes) starting from rest\nand executing the kinematics shown in Fig. 8. The\nwing sweeping velocity is constant for most of the\nhalfstrokes, but reverses direction at each stroke\nreversal (Fig. 8(a)). Angle of attack also follows a simi-\nlar routine – it remains at 458 for most of the half-\nstrokes but goes through a 908 rotation at stroke\nreversal (Fig. 8(b)). The pitching motion of the wing\nleads the sweeping motion by about 6 per cent of\nthe flapping cycle (c.f. Figs 8(a) and (b)). Also, pitch\nrates are relative to the sweeping motion so that an\nincreasing angle of attack before stroke reversal\nbecomes a decreasing angle of attack once the sub-\nsequent halfstroke begins.\nThe computational simulations for the above\nexperiment were run using the best combination of\nthe parameters inferred from the numerical experi-\nments described earlier. This benchmark simulation\nwas one of the longest owing to the 48 000 section-\ntime-steps (¼20 wing sections \u0003 2400 time-steps)\nwith as many as four sub-time-steps per time-step.\nThe results from the simulation are compared with\nthe experimental data in Fig. 9.\nThe similarity between the experimental data\nand the results of the numerical simulation is\nimmediately obvious. The pair of opposite spikes at\nstroke reversals are particularly well captured by\nthe theoretical model. They occur at the same\npoints in time without any significant lag for both\nlift and thrust, thus accounting well for unsteadiness\nof the flow. Moreover, themagnitudes of the negative\nspikes for lift (and positive spikes for thrust) are con-\nsistent with the experimental data but the opposite\nspikes are overestimated. (Dickinson did not com-\nment on the accuracy of the instrumentation used\nin his experiments.) Of the two, the force predictions\nfor thrust are the better depicted.\nThese results are encouraging, because they show\nbetter agreement than the previously published\ncomparisons, e.g. the CFD study by Sun and Tang\n[28] showed relatively poor comparison with the\nexperiments of Dickinson et al. [29].\nThe spikes in lift (Fig. 9(a)) correspond to the latter\nphases of the halfstrokes when angle of attack\nincreases rapidly (Fig. 8(b)) as stroke reversal\noccurs. Almost immediately afterwards, the wing\nFig. 8 Kinematics of Dickinson’s Robofly. Because the\nwing swept a flat figure-of-eight, the inclination\nparameters (u, u) were zero and are not shown\n180 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\ntranslational velocity drops to zero, manifesting in a\nsharp decrease in lift. When wing motion begins in\nthe opposite direction, the angle of attack is still rela-\ntively high and a second spike in lift is observed. This\nis, however, short-lived because the angle of attack\ndrops rapidly as stroke reversal ends. As both lift\nand thrust derive from the same normal force, corre-\nsponding peaks and troughs are found in the thrust\nplot (Fig. 9(b)). A more detailed discussion of the\nflow physics is presented in section 4.2.1.\nAn estimate of the quality of the theoretical model\ncan be inferred by comparing the mean values of lift\nL and thrust T (as defined in section 3.2.1.1). These\nare shown in Table 1. Although no allowance has\nbeen made to incorporate any three-dimensional\ntip effects directly, the comparison is promising.\nAnother check is to compare the values for mean\nlift and thrust for the last cycle of the simulation\nwhere the forces are becoming reasonably\nperiodic (also shown in Table 1). This comparison\nis consistent, whereas the inviscid model underesti-\nmates both lift and thrust.\nFurther substantiation is offered by the trend in\ndrag D (the net horizontal force; section 3.2.1.1).\nThis must be close to zero for steady hovering.\nFrom Dickinson’s data, mean D for the last cycle is\n0.0055 N which makes it 0.9 per cent of mean T for\nthe same period. For the theoretical model, the\nrespective values are 6.29 \u0003 1024 N and a ratio of\nFig. 9 Comparison of force data for Robofly data from Dickinson (private communication) with\nresults from the current theoretical simulation\nTable 1 Comparison between experimental and theo-\nretical values for mean lift and mean thrust\nEntire simulation Last cycle\nLift (N) Thrust (N) Lift (N) Thrust (N)\nDickinson 0.4034 20.6011 0.4081 20.6106\nCurrent 0.4568 20.6445 0.3805 20.5904\nDiscrepancy (%) 13 7.2 6.8 3.3\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 181\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nabout 0.1 per cent – an even better condition for\nhover. The inference to be drawn here is that the\nforces are becoming reasonably periodic after four\ncycles.\nAnother noteworthy feature is the synchrony\nbetween the experimental measurements of\nDickinson and the theoretical predictions yielded\nby the current inviscid model. Irrespective of magni-\ntude, the positions of all peaks are consistent with\nthe experiment. The quality of this synchrony can\nbe better appreciated by considering the power\nspectral densities of the force data obtained from\ntheir fast Fourier transform (Fig. 10). As with force\ndata, the similarity between the experimental and\ntheoretical values here is remarkable, and more so\nfor thrust (Fig. 10(b)). This also shows that the\nsmoothing scheme used (section 3.2.2) preserves\nthe frequency content of the data.\nThe frequency content for Dickinson’s data shows\n0.3418 Hz as the dominant frequency, together with\na number of harmonics. This is the blade-passing fre-\nquency, arising from there being two halfstrokes per\ncycle. The sources for themain peaks and troughs are\nthe stroke reversals at the end of each halfstroke\nwhen vortices are shed and new ones form (dis-\ncussed subsequently). Recalling that the flapping\nfrequency for the motion was \u00010.17 Hz, the ‘vortex-\nshedding frequency’ is twice that or \u00010.34 Hz. In this\nmodel, the corresponding dominant frequency is\nfound to be 0.3483 Hz – a very close match to experi-\nment – together with similar harmonics. This fre-\nquency is not very clearly observed for the lift data,\nbecause the two large positive peaks in the second\nand fourth halfstrokes (Fig. 9(a)) dominate. However,\nhigher harmonics are clearly visible (Fig. 10(a)).\nThe fact that frequency content for the experi-\nmental and theoretical data is so similar signifies\nthat the underlying physical phenomena (e.g.\nvortex shedding) are captured well. Recalling that\nthe quasi-three-dimensional model uses a simple\nblade-element-type method, it implies that the\nthree-dimensional flow field associated with a\nflapping wing (at these Reynolds numbers) does\nnot differ much from an aggregation of the flow\nfield in each of its two-dimensional sections. This\nsubstantiates the use of the blade-element method.\nThe inference to be drawn from this discussion is\nthat the aerodynamic model developed in the current\nworks [1, 30] predicts with remarkable accuracy both\nthe forces and flow-field associated with insect-like\nflapping wings. The temporal accuracy of the predic-\ntion implies that the unsteadiness in the flow is also\nwell captured by the theoretical model. Further, for\nthe Reynolds numbers in question, the three-\ndimensional flow associated with such wings appears\nto be essentially equivalent to two-dimensional flow.\n3.2.1 Characteristics of the flow\nThe trend observed for lift force L is that upon\nstartup lift grows rapidly from zero (Fig. 9(a)). There-\nafter, it remains more or less constant for most of the\nhalfstroke. At the end of the halfstroke, there is a\nsteep negative spike, which is immediately followed\nby a sharp positive spike. This trend then repeats in\na similar fashion for all subsequent halfstrokes.\nAt startup, angle of attack is quite high but sweep-\ning velocity is low (Figs 8(a) and (b)) so that its effect\non lift is low. However, the newly formed LEV\nincreases lift significantly, which is manifested as\nan initial spike (Fig. 9(a)). As the wing accelerates\nfrom rest, a trailing-edge vortex is also shed, whose\nprimary effect is to limit the value of lift. The net\nresult is to keep lift more or less constant during\nmost of the halfstrokes (Fig. 9(a)).\nAt the end of the halfstroke, stroke reversal\noccurs – there is a simultaneous increase in angle\nof attack and a decrease in sweeping velocity\n(Figs 8(a) and (b)) with the net effect of reducing\nlift. Stroke reversal also causes vortices to be shed –\nthe leading edge sheds a stopping vortex, whereas\nthe dominating vortex for the trailing edge is the\nstarting vortex owing to the rotation. Both these\nFig. 10 Comparison of power spectral density of\nRobofly force data from Dickinson (private\ncommunication) with results from the\ncurrent theoretical simulation\n182 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\nvortices are of the ‘wrong’ sense for the current\nhalfstroke, resulting in a sharp dip in lift\n(Fig. 9(a)). However, as soon as the subsequent\nhalfstroke commences, these vortices are of the\nright sense for promoting lift. In addition, a new\nLEV is also formed, which further increases lift.\nThe rapidity of the stroke reversal ensures that the\nstarting vortex shed from the trailing edge is ejected\nfar away, thereby reducing its inhibitory effect on\nlift. At the same time, a decreasing angle of attack\nreduces lift. The overall result is a large increase\nin lift, seen as a positive spike at the start of each\nhalfstroke (Fig. 9(a)).\nThe forces on the flapping wing, as generated in\nthe current formulation, are all pressure-related;\nthere is no skin friction because themodel is inviscid.\nTherefore, the thrust component of force is extracted\nentirely from the same pressure distribution, as is lift.\nHence, the similarity between the lift and thrust time\nhistories (c.f. Figs 9(a) and (b)). The main contri-\nbution to thrust (or drag, in the conventional sense)\ncomes from the shed wake. As the ‘horizontal wake’\nis substantially greater than the ‘vertical wake’ (the\nkinematics being a flat figure-of-eight), thrust is\ngreater than lift (by almost 50 per cent).\nBecause of the blade-element methodology\nemployed in this work (Part 1, section 3.3), a phase\ndifference exists between wing sections, because\nthe sections travel different distances in the same\ntime depending on their radial position. Conse-\nquently, flow in the outboard regions is more devel-\noped and ‘older’ in terms of chord lengths travelled.\nAn important observation made in the current study\nis that flow behaviour is very strongly linked to the\n‘age’ of the flow in terms of number of chord lengths\ntravelled. It was probably for this reason that Wagner\n[31] (and later von Ka´rma´n and Sears [32]) in his\nseminal work used semi-chords travelled as the inde-\npendent variable instead of time. Our observation\nshows that a reduced-frequency-type parameter is\nstill relevant in this form of unsteady flow.\nA consequence of this phase lead–lag is that flow in\nthe outboard sections, having travelled more chord\nlengths, is more prone to vortex breakdown. A similar\nobservation was made by Ellington et al. [2, 33] from\nexperiments on his flapper. Ellington et al. reported\nthat the vortex breakdown caused the LEV to ‘lift off’\nthe wing surface in these outboard regions. In such\ncases, the outermost sections feature a von Ka´rma´n-\ntype vortex system composed of alternately shedding\nleading- and trailing-edge vortices. Although this has\nlittle effect on mean lift for the wing section, the\nthrust (drag) component can be significant.\nIn the current quasi-three-dimensional model, no\ntip vortex effects are included. Comparison with\nexperimental data, however, has shown good agree-\nment. The reason for this is that vortex breakdown\nin outboard sections of the wing (and the associated\nlower lift) produces an effect equivalent to the lower\nlift that would be expected from tip-vortex effects.\nA similar argument can be drawn for thrust data.\nThis observation further substantiates the claim\nmade earlier that, at least for the Reynolds\nnumbers in question, three-dimensional effects are\nsubdued and a strip-theory-type extension of the\ntwo-dimensional model is capable of reproducing\nthe true three-dimensional characteristics with\nreasonable accuracy. This was indeed the conclusion\ndrawn by Sane and Dickinson [26] when they com-\npared results from their three-dimensional experi-\nments with Dickinson’s earlier two-dimensional\nexperiments [34].\n3.3 Limitations of the model\nAlthough the model developed in the current study\nhas quite accurately matched experimental obser-\nvations (Figs 7 and 9), it remains an inviscid, poten-\ntial, and essentially a two-dimensional model and,\ntherefore, has its limitations.\nOne such limitation is exposed by the requirement\nfor relaxation of the Kutta–Joukowski condition at\nthe leading and trailing edges, especially during\nstroke reversals (section 3.2.2.1). In the absence of\nsuch a relaxation, the simulations were prone to cor-\nruption because of the creation of artificially strong\nvortices with unrealistically high convection vel-\nocities. In reality, it is likely that viscosity (and vis-\ncous dissipation) prevents such a situation from\narising in the first place, thus avoiding the need to\nartificially damp the Kutta–Joukowski condition.\nOf course, it is also possible that in situations such\nas insect-like flapping, the Kutta–Joukowski con-\ndition takes a somewhat modified form. In the\nconventional unsteady-flow problems, wing-pitch\nchanges are minimal so that it is reasonable to\nassume that the smooth-flow condition at the trail-\ning edge applies. During insect-like stroke reversals,\nhowever, the pitch manoeuvres are so acute that\nfluid is more likely to flow around the trailing edge\nrather than along it. In such cases, the validity of\nKutta–Joukowski condition in the conventional\nsense is, therefore, somewhat dubious. This would\nprovide support for the temporarily relaxed Kutta–\nJoukowski condition used here. More experimental\nevidence is required, however, before such a claim\ncan be substantiated.\nA comparison of Figs 9(a) and (b) shows that the\nbandwidth of the force-measuring equipment used\nby Dickinson may have been insufficient in the\nregion of the forces generated. The spikes are\nalways better captured in one direction (negative\nspikes for lift and positive spikes for thrust) than\nthose in the other direction. Dickinson does not\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 183\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\nreport on this characteristic of the experimental\nsetup. It is also possible that the peaks predicted by\nthe theoretical model are, in fact, not observed to\nthe same extent in the experiments because of\ndamping by viscosity and other effects. However,\nthis is unlikely, as this discrepancy occurs in both\nL and T measurements.\nRecent work by Leishman and co-workers [35, 36]\nhas revealed that tip-vortex effects are important and\nhave a downwash effect on the shed wake. Although\nsuch an influence cannot be incorporated in the\ncurrent modelling framework, an improved model\nwould be needed to resolve this issue. Like Ellington\net al. [2], Leishman et al. also noticed a significant\nspanwise motion of the LEV. The current model does\nnot account for this feature (The spanwise motion of\nthe LEV appears to be dependent on Reynolds\nnumber. For small Reynolds numbers (Re \u0001 200),\nonly weak spanwise flow has been observed [4, 37]\nwhereas studies involving higher Reynolds numbers\n(Re \u0001 5000 and higher) have revealedmore significant\nspanwise entrainment [2, 3, 35, 36].) and amethod for\nincluding it would be useful.\n4 CONCLUSIONS\nIn this paper, the analytical equations derived in Part\n1 [1] have been converted to forms that are amenable\nto numerical calculation. This has been necessary, in\nparticular, for the wake integral equations that are\nexact but do not have a closed analytical form\nbecause of their non-linearity.\nThe problem being solved is the flow associated\nwith insect-like flapping. Such flows are character-\nized by twin separation, one each from the leading\nand trailing edges. The shed wakes constitute\nvortex sheets that move freely at the local Kirchhoff\nvelocity, because they are unable to sustain Kutta–\nJoukowski forces. As a result of insect-like kin-\nematics, the flapping wing repeatedly interacts with\nits wake because of the back-and-forth motion.\nThe approach is formulated here as an initial-value\nproblem – using known initial conditions, the flow is\nsolved for all subsequent times using a time-\nmarching algorithm. The calculation relies on\nvortex methods to implement the solutions. In our\napproach, the aerofoil is represented by an array of\npoint vortices that are bound but whose strengths\nare time-varying. The shed wake (both leading and\ntrailing edges) is also represented by an array of\ndiscrete point vortices, but these are free and their\nstrengths are fixed by the wake-integral equations\nat the time of inception.\nThe method relies on the shed vortices convecting\naccording to the Rott–Birkhoff equation. Convection\nwas executed by means of a simple forward\nEuler scheme, and to alleviate the problem of infinite\nvelocities at vortex centres, a desingularization\nscheme was used. In addition to using Lamb–\nOseen-type vortices, a vortex amalgamation\nscheme, whereby vortices of like-sign in close proxi-\nmity to each other were merged, was also\nimplemented. During the rapid stroke reversals,\nsub-time-steps were used to increase the resolution\nof the calculation. It was also found, especially\nduring stroke reversals and wake re-entry, that\nartificially strong vortices were produced owing to\nthe strong velocity fields, which led to corruption\nof the solution. In such cases, the Kutta–Joukowski\ncondition was judiciously relaxed for that time-step.\nIn order to remove, as best as possible, any depen-\ndence on numerical parameters, a number of numeri-\ncal experiments were run. These investigated the\neffects of quantities such as number of wing sections\nand time-step-size on the outcome of the simulations.\nIn this way, the best values for the parameters were\nchosen both in terms of accuracy and practicality.\nThe entire numerical solution was implemented in\nFortran. The program size was of the order of\n2.0 MB and the memory requirements were deter-\nmined at runtime, depending on the number of\nwing sections and time-steps. The bottleneck for the\nsimulations was the convection routine which\nslowed as the number of vortices increased (varying\nroughly as n 2.5, where n is the number of time-steps).\nThemodel was validated both in terms of flow visu-\nalization and force prediction. Results from themodel\nshowed very good agreement with existing data for\nlow Reynolds number flows. Not only were the\nvortex structures similar but they were also tempo-\nrally accurate. Force prediction yielded by the current\nmodel was also similarly noteworthy, particularly for\nthrust data. Comparison of frequency content of this\ntime-dependent flow highlighted the temporal\nconsistency between model and experiment.\nThese results have shown that the analytical\nmodel proposed in Part 1 [1] and implemented\nhere is indeed capable of predicting, with notable\naccuracy, the forces and flow field generated by an\ninsect-like flapping wing, at least in the range of\nReynolds number studied (Re \u0004 200). The similarity\nbetween their frequency content shows that the\nunderlying flow features are also captured well.\nIn addition, the study has also shown the similarity\nbetween two-dimensional and three-dimensional\nflapping-wing flows at these Reynolds numbers.\nACKNOWLEDGEMENT\nThe authors are grateful to the EPSRC (through grant\nnumbers GR\/M78472\/01 and GR\/S23025\/01) and the\nUK Ministry of Defence for supporting this work.\n184 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\nREFERENCES\n1 Ansari, S. A., Z˙bikowski, R., and Knowles, K. A non-\nlinear unsteady aerodynamic model for insect-like\nflapping wings in the hover. Part 1: methodology and\nanalysis. Proc. IMechE, Part G: J. Aerospace Engineering,\n2006, 220(G2), 61–83.\n2 Ellington, C. P., van den Berg, C., Willmott, A. P., and\nThomas, A. L. R. Leading-edge vortices in insect flight.\nNature, 1996, 384, 626–630.\n3 Willmott, A. P., Ellington, C. P., and Thomas, A. L. R.\nFlow visualization and unsteady aerodynamics in the\nflight of the hawkmoth, Manduca sexta. Phil. Trans.\nRoy. Soc. Lond. Ser. B, 1997, 352, 303–316.\n4 Birch, J. M. and Dickinson, M. H. Spanwise flow and\nthe attachment of the leading-edge vortex on insect\nwings. Nature, 2001, 412(6848), 729–733.\n5 Rosenhead, L. The formation of vortices from a surface\nof discontinuity. Proc. Roy. Soc. Lond. Ser. A, 1931,\n134(823), 170–192.\n6 Betz, A. Verhalten von Wirbelsystemen. Zeitschrift fu¨r\nangewandte Mathematik und Mechanik, 1932, 12(3),\n164–174.\n7 Rott, N. Diffraction of a weak shock with vortex gener-\nation. J. Fluid Mech., 1956, 1, 111–128.\n8 Birkhoff, G. Helmholtz and Taylor instability. Proceed-\nings of the Symposium on Applied mathematics, 1962,\nvol. 13, pp. 55–76 (American Mathematical Society,\nProvidence, Rhode Island).\n9 Oseen, C. W. U¨ber die Stokes’sche Formel und u¨ber\neine verwandte Aufgabe in der Hydrodynamik. Arkiv\nfo¨r Matematik, Astronomi och Fysik, 1911, 7(1), 1–36.\n10 Lamb, S. H. Hydrodynamics, 6th edition, 1932\n(Cambridge University Press, New York).\n11 Vatistas,G.H., Kozel, V., andMih,W.C.A simplermodel\nfor concentrated vortices. Exp. Fluids, 1991, 11, 73–76.\n12 Spallart, P. R.Vortexmethods for separated flows, Tech-\nnical Memorandum 100068, N88-26342, NASA, 1988.\n13 Sarpkaya, T. Computational methods with vortices –\nthe 1988 Freeman Scholar Lecture. Trans. ASME,\nJ. Fluids Eng., 1989, 111, 5–52.\n14 Ting, L. and Klein, R. Viscous vortical flows, lecture\nnotes in physics, 1991, vol. 374 (Springer-Verlag, Berlin).\n15 Ansari, S. A. A nonlinear, unsteady, aerodynamic model\nfor insect-like flapping wings in the hover with micro air\nvehicle applications. PhD Thesis, Cranfield University\n(RMCS Shrivenham), September 2004.\n16 Katz, J. and Plotkin, A. Low-Speed aerodynamics, 2nd\nedition, 2001 (Cambridge Univeristy Press, Cambridge).\n17 Crighton, D. G. The Kutta condition in unsteady flow.\nAnn. Rev. Fluid Mech., 1985, 17, 411–445.\n18 Silverstein, A. and Joyner, U. T. Experimental verifica-\ntion of the theory of oscillating airfoils, Report 673,\nNACA, 1939.\n19 Leishman, J. G. Principles of helicopter aerodynamics,\n2000 (Cambridge University Press, Cambridge).\n20 Giesing, J. P. Vorticity and Kutta condition for unsteady\nmultienergy flows. Trans. ASME, J. Appl. Mech., 1969,\n36, 608–613.\n21 Maskell, E. C. On the Kutta–Joukowski condition in\ntwo-dimensional unsteady flow. TM ARC-33967, Royal\nAircraft Establishment, Farnborough, England, 1972.\n22 Mook, D. T. andDong, B. Perspective: numerical simu-\nlations of wakes and blade–vortex interaction. Trans.\nASME, J. Fluids Eng., 1994, 116(1), 5–21.\n23 Poling, D. R. and Telionis, D. P. The response of airfoils\nto periodic disturbances – the unsteady Kutta con-\ndition. AIAA J., 1986, 24(2), 193–199.\n24 Poling, D. R. and Telionis, D. P. The trailing edge of a\npitching airfoil at high reduced frequencies. Trans.\nASME, J. Fluids Eng., 1987, 109, 410–414.\n25 Sun, Q. and Boyd, I. D. Flat-plate aerodynamics at very\nlowReynoldsnumber. J. FluidMech., 2004,502, 199–206.\n26 Sane, S. P. and Dickinson, M. H. The aerodynamic\neffects of wing rotation and a revised quasi-steady\nmodel of flapping flight. J. Exp. Biol., 2002, 205,\n1087–1096.\n27 Dickinson, M. H. and Go¨tz, K. G. Unsteady aerody-\nnamic performance of model wings at low reynolds\nnumbers. J. Exp. Biol., 1993, 174, 45–64.\n28 Sun, M. and Tang, J. Unsteady aerodynamic force\ngeneration by a model fruit fly wing in flapping\nmotion. J. Exp. Biol., 2002, 205, 55–70.\n29 Dickinson, M. H., Lehmann, F.-O., and Sane, S. P.\nWing rotation and the aerodynamic basis of insect\nflight. Science, 1999, 284, 1954–1960.\n30 Ansari, S. A., Z˙bikowski, R., and Knowles, K. A non-\nlinear unsteady aerodynamic model for insect-like\nflapping wings in the hover. Part 2: implementation\nand validation. Proc. IMechE, Part G: J. Aerospace\nEngineering, 2006, 220(G3), 169–186.\n31 Wagner, H. U¨ber die Entstehung des Dynamischen\nAufftriebes von Tragflu¨geln. Zeitschrift fu¨r Angewandie\nMathematik und Mechanik, 1925, 5(1), 17–35.\n32 von Ka´rma´n, T. and Sears, W. R. Airfoil theory for\nnon-uniform motion. J. Aeronaut. Sci., 1938, 5(10),\n379–390.\n33 van den Berg, C. and Ellington, C. P. The three-dimen-\nsional leading-edge vortex of a ‘hovering’ model hawk-\nmoth. Phil. Trans. Roy. Soc. Lond. Ser. B, 1997,\n352(1351), 329–340.\n34 Dickinson, M. H. The effects of wing rotation on\nunsteady aerodynamic performance at low Reynolds\nnumbers. J. Exp. Biol., 1994, 192, 179–206.\n35 Ramasamy, M., Leishman, J. G., and Singh, B. Wake\nstructure diagnostics of a flapping wing MAV. In SAE\nInternational Powered Lift Conference, Texas, 3–6\nOctober 2005, IPLC 2005-01-3198, pp. 1–13.\n36 Tarascio, M. J., Ramasamy, M., Chopra, I., and\nLeishman, J. G. Flow visualization of micro air vehicle\nscaled insect-based flapping wings. J. Aircraft, 2005,\n42(2), 385–390.\n37 Sane, S. P. and Dickinson, M. H. The control and flight\nforce by a flapping wing: lift and drag production. J.\nExp. Biol., 2001, 204, 2607–2626.\nAPPENDIX\nNotation\nD horizontal drag force orthogonal to gravity\n(N)\nh heave displacement (m)\nNon-linear unsteady aerodynamic model. Part 2: implementation and validation 185\nJAERO50 # IMechE 2006 Proc. IMechE Vol. 220 Part G: J. Aerospace Engineering\n_h heave velocity (m\/s)\nl lunge displacement (m)\n_l lunge velocity (m\/s)\nL vertically upwards lift force parallel to\ngravity (N)\nM moment about wing pitch axis (Nm)\nq complex velocity (m\/s)\nr radial distance from centre (m)\nrc vortex-core radius (m)\nR radius of circle in Z-plane (m)\n< real part of\nt time (s)\nT horizontal thrust force, parallel to drag, but\nalways in the direction of motion (N)\nUE horizontal (~j) component of external\nirrotational velocity field (m\/s)\nVE vertical ( ~h) component of external\nirrotational velocity field (m\/s)\nvu circumferential component of\nvelocity (m\/s)\nx real-axis coordinate in circle (Z) plane (m)\ny imaginary-axis coordinate in circle (Z)\nplane (m)\nZ complex coordinates in circle plane\n(¼x þ {y) (m)\n\u0002A rotating coordinate system\nA^ translating coordinate system\n~A inertial coordinate system\n\u0001A complex conjugate of\nA˙ first derivative w.r.t. time (s21)\na angle of attack (rad)\n_a pitch rate (rad\/s)\ng vorticity (m\/s)\nd elemental value of\nG circulation (m2\/s)\ne amalgamation threshold (m3\/s)\nz complex coordinates in physical plane\n(¼jþ {h) (m)\nh imaginary-axis coordinate in physical (z)\nplane (m)\nu inclination angle (rad)\nu angle along circle in Z-plane\nQ inclination amplitude (rad)\n{ complex {(¼p\u00021)\nj real-axis coordinate in physical (z) plane (m)\nr fluid density (kg\/m3)\nf stroke angle (rad)\nF stroke amplitude (rad)\nSubscripts\nA0 wake-free (quasi-steady) component\nA1 wake-induced component\nAlv leading-edge vortex\nAwk trailing-edge wake\n186 S A Ansari, R Z˙bikowski, and K Knowles\nProc. IMechE Vol. 220 Part G: J. Aerospace Engineering JAERO50 # IMechE 2006\n"}