{"doi":"10.1017\/S0964028201000209","coreId":"15480","oai":"oai:dro.dur.ac.uk.OAI2:7170","identifiers":["oai:dro.dur.ac.uk.OAI2:7170","10.1017\/S0964028201000209"],"title":"Masks and madness : ritual expression of the transition to adulthood among Miskitu adolescents.","authors":["Jamieson,  Mark"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-10-01","abstract":"This article considers two forms of action among Miskitu adolescents, both of which encode in ritualised form anxieties and desires concerned with the imminent categorical transition from adolescence to adulthood. The first of these is a masked dance known as ‘mosko’ which is performed mainly by both young unmarried man and women in the village of Kakabila. The second is a supposedly culture-bound, and evidently contagious, condition known as ‘grisi siknis’ which afflicts mainly young unmarried women in Miskitu-speaking communities throughout eastern Nicaragua and Honduras. Analysis of this material suggests that where rituals directly enacting transformations to adulthood are absent, modes of action allowing individuals to express concerns surrounding this change of status are likely to be particularly dramatic","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15480.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7170\/1\/7170.pdf","pdfHashValue":"95bc8ba562bd83f58d7de08086ffe1a4c0884e4e","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7170<\/identifier><datestamp>\n      2010-08-11T09:05:22Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Masks and madness : ritual expression of the transition to adulthood among Miskitu adolescents.<\/dc:title><dc:creator>\n         Jamieson,  Mark<\/dc:creator><dc:description>\n        This article considers two forms of action among Miskitu adolescents, both of which encode in ritualised form anxieties and desires concerned with the imminent categorical transition from adolescence to adulthood. The first of these is a masked dance known as ‘mosko’ which is performed mainly by both young unmarried man and women in the village of Kakabila. The second is a supposedly culture-bound, and evidently contagious, condition known as ‘grisi siknis’ which afflicts mainly young unmarried women in Miskitu-speaking communities throughout eastern Nicaragua and Honduras. Analysis of this material suggests that where rituals directly enacting transformations to adulthood are absent, modes of action allowing individuals to express concerns surrounding this change of status are likely to be particularly dramatic.<\/dc:description><dc:publisher>\n        Cambridge University Press <\/dc:publisher><dc:source>\n        Social anthropology, 2001, Vol.9(3), pp.257-272 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2001-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7170<\/dc:identifier><dc:identifier>\n        issn:0964-0282<\/dc:identifier><dc:identifier>\n        issn: 1469-8676 <\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0964028201000209 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7170\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0964028201000209 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7170\/1\/7170.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0964-0282","issn: 1469-8676","0964-0282"," 1469-8676"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n11 August 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nJamieson, Mark (2001) ’Masks and madness : ritual expression of the transition to adulthood among Miskitu\nadolescents.’, Social anthropology., 9 (3). pp. 257-272.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0964028201000209\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nM A R K  J A M I E S O N\nMasks and madness. Ritual\nexpressions of the transition\nto adulthood among Miskitu\nadolescents*\nThe transition of persons from junior to more senior statuses has long constituted a\nimportant focus of anthropological inquiry, anthropologists mostly studying such\nchanges in status through examinations of rites of passage (La Fontaine 1985). Because\nthe transformations aimed at by these rites of passage are culturally sanctioned, they\nby and large do their work successfully, and so, provided initiands perform adequately,\nthey may, thereafter, consider themselves suitably transformed. Anthropologists have\ntheorised much less, however, about the attainment of majority status in contexts\nwhere the transition from junior to senior status is brought about by individual\nachievement and not by ritually sanctioned ascription. In contexts of this kind, juniors\nwishing to attain majority status have to undertake their own transformation, princi-\npally through demands for recognition.1\nMiskitu adolescents are one such group of people who have to undertake their\nown transitions to adulthood. Adolescent boys (wahma) and girls (tiara) are con-\nSocial Anthropology (2001), 9, 3, 257–272. © 2001 European Association of Social Anthropologists 257\n* This article is based mainly upon materials collected during eighteen months residence in Nicaragua\nin 1992 and 1993, fifteen of which were spent in the village of Kakabila in the Pearl Lagoon\nbasin.This work was conducted as a postgraduate student in the Anthropology Department of the\nLondon School of Economics, and as an associate researcher with CIDCA (el Centro de\nInvestigaciones y Documentación de la Costa Atlántica). I am most grateful to both institutions for\ntheir considerable assistance. This work was also made possible by fieldwork grants from the Wenner\nGren Foundation for Anthropological Research and the Emslie Horniman Trust, and I would like\nto thank the trustees of both for their confidence in my ability to carry out this research. I also con-\nducted shorter periods of fieldwork in the region, mostly spent in Kakabila, in 1997, 1998 and 1999-\n2000, courtesy of funds made available by the London School of Economics and the University of\nManchester. I would also like to express my gratitude to Philip Dennis, Galio Gurdian and Eduardo\nArchetti for thoughtful and helpful comments on an earlier draft of this article. Remaining\ndeficiencies are mine alone. Finally, I would like to thank Dr Marc Isler of Bluefields and the people\nof Kakabila and Raitipura – in particular Mr John and Miss Chavela Schwartz, their daughter and\nmy comadre Lorna Schwartz, the late Mr Bernardino Schwartz Garth, Miss Rachel Schwartz\nMacPherson, Miss Buelah Theodore and Miss Gollita Theodore, all of Kakabila – for wonderful\ncompany and patient explanations.\n1 This process is well described by Collier and Rosaldo (1981) for young men implicated in the poli-\ntics of brideservice. \nsidered children (tuktan) by their parents and other adults (almuk), and remain so\nuntil by their own efforts they successfully induce, from the adults around them,\nreconceptualisations of their personhoods that allow them to present themselves as\nadults. This renegotiation of one’s personhood is, however, fraught with difficulties.\nTo meet these difficulties, Miskitu children and adolescents of both sexes have devel-\noped, or modified, a number of forms of ritualised behaviour to represent their con-\ncerns with this particular aspect of their lives. In this article, I wish to focus on two of\nthese ritualised forms of behaviour: mosko, a masked dance which takes place in\nKakabila, a Miskitu village in Nicaragua’s Pearl Lagoon basin; and grisi siknis, a form\nof contagious hysteria principally affecting female adolescents that is found in Miskitu\ncommunities more widely.\nThe Miskitu\nThe Miskitu today probably number around 100,000, most of whom inhabit the vast\nisolated area of eastern Central America located between Rìo Tinto in Honduras and\nPearl Lagoon in Nicaragua. Most live in small nucleated villages located on the shores\nof the Caribbean and its hinterland of lagoons and small rivers. Others live in the vil-\nlages stretched out in a line along the Nicaraguan bank of the Rìo Coco which today\nconstitutes the border with Honduras. In the coastal villages farming and fishing are\nboth important, but in riverine Miskitu villages farming alone provides the only steady\nform of subsistence, with the sale of rice offering some a meagre and unreliable\nincome. The region’s principal towns – Puerto Cabezas, Waspam and Puerto Lempira\n– have majority Miskitu populations,while to the south and west sizeable Miskitu\nminorities are found in Bluefields, Corn Island, El Bluff, Managua, Kukra Hill, and\nthe mining towns of Bonanza, Rosita and Siuna. \nThe Miskitu were first reported in the accounts of late seventeenth-century\nEnglish and French buccaneers as living in the Cape Gracias a Dios and Sandy Bay\ndistricts.2 Around this time they began to attain prominence both as long range raiders\nfor slaves and booty, and as middlemen in a regional trade, both with other Indian\ngroups and Spanish setters to the south and west, and with English and Anglo-\nJamaican traders coming to the coast by sea. This trade crucially involved the exchange\nof locally produced goods for imports, including firearms. These allowed the Miskitu\nto extend their influence across much of the region. Later, during the second half of\nthe nineteenth and the first half of the twentieth centuries, many Miskitus became\nworkers in opportunist North American-run rubber, logging, banana and mining\ncamp enterprises, during which time they learned to be occasional proletarians and\ncame to experience in quick succession a series of localised booms and busts.3 Miskitu\nmen thus learned to be flexible, willing both to move around in order to take advan-\ntage of short-term opportunities and learn the English language spoken by their\ntrading partners and employers. Miskitu women, for their part, became accustomed to\n258 MARK  J AM IESON\n2 See, for example, those found in Dampier (1927), Exquemelin (1969), M. W. (1732) and Raveneau\nde Lussan (1930).\n3 See Roberts (1965), Floyd (1967), Helms (1971: 10–35; 1983), Dozier (1985), Olien (1988), Noveck\n(1988), Naylor (1989) for discussion of this history. De Kalb (1893), Vilas (1989) and Rivera and\nVernooy (1991) contain materials on the ‘company period’ in the late nineteenth and twentieth cen-\nturies.\ndoing without their menfolk for long periods and, as Helms (1970a; 1970b; 1976) sug-\ngests, matrilocality probably emerged as an adaptation to these circumstances.4\nOver the course of this history the Miskitu have developed what Hale (1994) has\ntermed an ‘Anglo affinity’, coming to regard British, English-speaking Caribbeans and\nNorth Americans as classificatory brothers-in-law (waika). At the same time they\nhave tended to hold the ‘Spaniards’ (Spanish-speakers) to the west, historically\nstrangers and enemies of their English-speaking allies, in deep distrust.5 This affinity\nwith English-speakers was reinforced in the last years of the nineteenth century by the\nmass Miskitu conversion to Moravian Protestantism, brought to the region initially by\nGerman and later by North American missionaries, and, more recently in the 1980s,\nthrough the involvement of armed Miskitu insurgents with the United States-spon-\nsored Contras (Bourgois 1986; Hale 1994). In the last three hundred years or so, the\nMiskitu have thus developed an acute awareness of the importance of the role played\nin social reproduction by powerful, mainly English-speaking foreigners, and this has\nproduced, or enhanced, a valorisation of exogamous marriages between Miskitu\nwomen and potentially useful and predominantly English-speaking strangers (e.g. M.\nW. 1732: 302; Roberts 1965: 109–10; Exquemelin 1969: 219; Holm 1978: 82; Jamieson\n1998). \nThis history, and the representations it has produced for the Miskitu, should be\nborne in mind as I come to consider mosko and grisi siknis as ritualised forms of behav-\niour associated with the individual’s transition from childhood to adulthood. First,\nhowever, I wish to present, as I understand them, Miskitu ideas concerned with the\ndistinction between tuktan and almuk, since the English language terms ‘child’ and\n‘adult’, glosses as I am using them here, carry a considerable amount of baggage. I then\nwish to unpack this transition to adulthood in terms of culturally specific ideas about\ngender. This is because an understanding of Miskitu ideas about gender is crucially\nimportant in making sociological sense of this transformation. Finally, I also wish to\nexplore the two gender identities termed in Miskitu wahma (male adolescent) and\ntiara (female adolescent), since it is usually individuals classified as wahma and tiara,\noccupying the liminal social space between tutkan and almuk, who turn out to be the\nprincipal actors in the Kakabila mosko and in grisi siknis attacks.\nTuktan and almuk\nAlthough there are a number of rites of passage other than those surrounding birth\nand death, considered important by the Miskitu, these have little obvious effect on the\nimmediate status of the individual. Baptism, confirmation and church weddings\nreceive ceremonial attention and are certainly reckoned to be important, but none of\nthese actually transform the status of the individual in terms of how he or she is treated\nby fellow villagers afterwards. Baptism, for example, is more concerned with the\nestablishment of ritual relationships between godparents and godchildren and\nMASKS  AND  MADNESS 259\n4 In recent decades, the sale of marine resources (turtle, fish, shrimp and lobster) to wealthy\nNicaraguan, Jamaican and Colombian buyers has offered the richest source of income, while the\ncultivation of sweet cassava and other cultigens provides, as it has always done, the basis of subsis-\ntence (Nietschmann 1973). \n5 See Jamieson (1998) for discussion of the ‘brother-in-law’ relationship between the Miskitu and\nEnglish-speakers.\nbetween adults compadres than it is about changing the status of the initiand in a soci-\netal sense,6 while confirmation and the church wedding (the latter usually taking place\nlong after the conjugal union is established) are essentially matters to do with the\nrelationship between the initiand and God (Dawan). In terms of day-to-day social\npractice the differences between the unbaptised child and the baptised child, between\nthe unconfirmed and the confirmed, and between the formally married and the unmar-\nried, are nothing like as significant as those deemed to hold between between children\n(tuktan) and adults (upla almuk), and between men (waitna) and women (mairin)\n(Jamieson 2000).7 In daily Miskitu life, it is these differences – between adults and chil-\ndren, and between women and men – which have salience as far as the treatment of the\nindividual is concerned. \nMiskitu people generally recognise that children, like adults, have intentions and\ndesires. However these are considered subordinate to those of the adults around them.\nChildren sometimes express their dissatisfaction by throwing tantrums or sulking but\nthese demonstrations rarely have any effect other than to provoke anger or amuse-\nment.8 Adults do not ask children for their views when making decisions, and cer-\ntainly do not feel that they are required to give reasons. Furthermore, adults rarely\nconverse with children and the latter are frequently shooed away, usually (though not\nalways) when the former are talking about important matters. Adults may on occasion\naccept a child’s plea that he or she does not want to do something, but they will rarely\nask the child for a reasoned argument why this is so. In other words, children may be\nseen and heard, but they are never listened to or consulted. \nThis subordination of children to adults, is strictly enforced, in part through the\nacquisition of norms which in Kakabila (the Miskitu village I know best),9 people call\n‘respect’ (rispik) or ‘manners’ (manars), and in part by the legitimate use of physical\ncoercion by parents. They learn, to a considerable extent through imitation of their\npeers, the proper ways to approach and greet adults respectfully, and, as they acquire\n‘sense’ (sins), acquire a habitus which naturalises this self-subordination. They also\nlearn that their subordination is enforced by the occasional application of parental\nbeatings (wipaia).10 Miskitu children thus come to understand that village life is con-\nstituted by two worlds: the world of adults to which they have little direct access, and\nthe world of children. Each is recognised as having its own distinct forms of sociality.11\n260 MARK  J AM IESON\n6 See also Helms (1971: 95–6) discussion of the libra relationship in Asang.\n7 See also Helms (1971: 93–4).\n8 Indeed, on occasion adults, grandparents in particular, sometimes amuse themselves by provoking\nthese tantrums. One way that they do this with babies is to hold two up to one another and make\nthem fight. \n9 In Kakabila, Raitipura and some other Miskitu villages, Nicaraguan English as well as Miskitu is\nspoken. I have placed English words, as these are used in the region, in inverted commas. Miskitu\nwords are given in italics.\n10 The belt is the usual instrument for beatings, though occasionally the flat side of a machete against\nthe calf is also used. In Kakabila these punishments are usually administered by mothers or fathers,\nthough in some villages, for example Awastara (Reyes 1992: 10), it is the mother’s brother, rather\nthan the father, who has the right to beat the child. Parents are evidently more lenient in Asang\n(Helms 1971: 96–7) than they are both in Kakabila, where I conducted fieldwork, and in Awastara\n(Dennis 1981: 478). \n11 In Kakabila this children’s world includes a number of secret languages based on the syllabic\nmanipulation of ordinary language words and collectively known as ‘gibberish’, which adults claim\nnot to be able to understand. \nAdulthood is widely believed to be attained when an individual can show that he\nor she has a spouse (maia) and offspring (luhpia) or, sometimes in the case of women,\nsimply by having a child. Those who have these, it is said, consider themselves the\nequals of others with similar responsibilities.12 Often enough, however, acceptance of\nthese responsibilities is only truly demonstrated when a man and a woman own their\nown house. Although this does not in itself offer the individual adult status, the house\nitself confirms the individual’s majority because it objectifies in visible form the con-\njugal and parental responsibilities theoretically given only with childbirth.\nConsequently, young men and women, having children but living in the house of one\nset of parents (usually the woman’s parents), are rarely entirely comfortable with their\nadult status. The building of a house, however, makes manifest that the man in par-\nticular has what in Kakabila is called ‘man’s brains’, that he is ‘serious’ about his\nspouse and children. House owners are therefore able to participate in village assem-\nblies with confidence and demand shares in village-wide distributions.\nOne such village-wide distribution that takes place in Kakabila is that of manatee\nmeat, an event which foregrounds the distinction between adults and children as\nclearly as any other. When Kakabila men catch a manatee, as they occasionally do in\nJune, the head is first cut off and the body meat, sometimes as much as 150 kg, is div-\nided between each conjugal partnership. Each of these, especially those with their own\nhouse, is entitled to demand an equal share. Children are given, on a first come first\nserved basis, the intestines, a childish delicacy which they take home to be fried. Meat\nfrom the head, however, is distributed in a rather different fashion. To begin with, the\nhead is given to an elderly man or women to boil. Its meat is then distributed as\ncooked food and is eaten exclusively by those considered adults (upla almuk).\nChildren are forbidden to eat this meat, since by doing so they would jeopardise the\nsuccess of future manatee hunts.13\nThe differing forms of consumption of manatee meat foreground differences\nbetween adults and children. The body meat, eaten by all, is equitably distributed in\nraw form and is transformed into cooked food by each household, while intestines are\nthrown to children in an entirely random manner. Meat from the head, however, is\nserved as cooked food only to adults. These distinctions foreground the ‘truth’ for\nKakabila villagers that children are essentially undomesticated beings who are only\nsocialised in the context of parental household authority. They are not deemed fit to\nparticipate in the important village-wide forms of sociality symbolised by the com-\nmensal eating of the manatee’s head.\nWahma and tiara\nAs I have said, it is the fact of childbirth and the establishment of a conjugal union\nwhich turns children into adults in Miskitu communities. Theoretically there is a\nproper way for this to happen. Ideally, the suitor approaches his intended’s parents\nand asks for a meeting with them. He then arrives with a crate of rum, possibly an\nengagement ring, and sometimes a ‘pilot’ or ‘testigo’, an older man who will speak on\nhis behalf, thereby obviating any ‘shame’ (swira) he might experience with his future\nMASKS  AND  MADNESS 261\n12 The woman unable to have children (biarapara) is in a difficult position in this respect. See also\nHelms (1971: 101).\n13 The hunt is a cooperative exercise, theoretically involving the village men (not boys). \nmother-in-law (Jamieson 2000). If the girl’s parents approve his courtship, the couple\nare then deemed to be betrothed and the suitor is given what in Kakabila is known as\n‘permission’ or the ‘privilege’ to visit the daughter during the evening hours. A date is\nset for a wedding and assurances are made to the parents that the groom’s house will\nbe built next to theirs. During the courtship the suitor performs small acts of brideser-\nvice for his future parents-in-law such as chopping firewood.14\nIn practice, however, events rarely unfold in this way. Parental rejection of a\ndaughter’s suitor is always a distinct possibility, sometimes because they feel that she\nshould continue going to school; sometimes because they feel that the boy in question\nis too young, too lazy or too immature;15 and sometimes because they feel that the\nman or boy in question is simply trying to ‘fool up’ (trik munaia) or ‘take a little\nsneeze’ with their daughter, an eventuality said in Kakabila to be all too common. \nWith parental disapproval and rejection of the boy’s suit a distinct possibility,\nyoung couples frequently conduct their courtships entirely clandestinely, secrecy from\nadults being upheld with the tacit cooperation of the other village children who often\nact as carriers of love letters handwritten in English. Frequently, as Amanda told me,\nreminiscing on her own courtship, it is the boy’s sister who acts as courier. This state\nof secrecy is often successfully maintained until the girl actually becomes pregnant, at\nwhich point she has to face her parents with a fait accompli, while he has to decide\nwhether he is going to recognise the child as his. If relations between his parents and\nhers are good, he may well find that his own parents put considerable pressure on him\nto acknowledge his responsibilities, regardless of his own wishes. If he decides he does\nnot wish to shoulder responsibility, and parental pressure has no effect on him, the girl\nis then placed in a difficult position. Unless she or, more likely, her parents arrange for\na discreet infanticide (generally blamed on death in childbirth or bibi kauhla, a form\nof ‘fresh cold’ which often kills babies), an option which attracts unpleasant gossip,\nshe will, in all likelihood, have to take responsibility without the ‘real’ father for what\nin Kakabila is known as an ‘outside child’. \nAlternatively, she may decide to elope, a big step since this is likely to be regarded\nas an serious act of disloyalty. Parents are generally particularly loathe to lose their\ndaughters since the labour of the latter is useful, so much so that mothers who are\n‘rich’ with daughters often lend them to favoured relatives. The theoretical advantage\nof having daughters in the first place is that, provided they marry properly, they will\nwork with, and for, their mothers for the rest of their lives.16 Parents want sons-in-law\n(dapna) who are prepared to live uxorilocally, offer respect (rispik), show their daugh-\nters ‘points’ (useful general knowledge), and perform brideservice, and to this end they\nconsider that they have the right to vet their daughters’ suitors. Elopement deprives\nthem of this privilege. \nElopement usually means that the girl goes to live in the house of the boy’s par-\nents or grandparents while the boy himself studiously avoids her parents, an arrange-\nment which rarely works out well in the long term. Miskitu people often talk about\n262 MARK  J AM IESON\n14 See Helms (1971: 85–7) for discussion of Miskitu courtship.\n15 In former times, I was told, if a girl’s father did not like a boy, he would humiliate him by saying\nto his wife (the girl’s mother), ‘Give this boy some wabul (banana porridge) and send him on his\nway’. In this way the girl’s father, by refusing to address him directly and suggesting he eat chil-\ndren’s food, would treat him like a child and thus reject his proposal. \n16 With sons, eventually ‘you lose the sweat (labour)’, as one man explained it to me, because they go\nto work for their parents-in-law. \nhouses in terms of their membership of small house clusters,17 and in those villages\nwhere uxorilocal postnuptial residence tends to be emphasised, these house clusters\nare usually imagined as being constituted by informal confederations of consan-\nguinally related women who work together. Finding herself a stranger in a house clus-\nter run by her mother-in-law and classificatory sisters-in-law, an eloping bride may\nwell find herself cast as an enemy, and eventually return to her own parents seeking\nforgiveness and protection. If she is lucky her groom will follow and her parents will\ncome to accept him, perhaps reluctantly, as a son-in-law. \nThe story of Becky and Bam Bam provides a fairly typical example of this. Bam\nBam, considered one of the ‘rudest’ (badly behaved) boys in Kakabila, was the ‘sweet-\nheart’ of Becky, the eldest daughter of Sibella and George. Neither parent had\napproved of Bam Bam’s courtship of Becky, and she eventually ran away to the other\nend of the village to live with him at his parent’s house. Eventually she became preg-\nnant and Bam Bam, aware that she was experiencing problems with his mother and his\nmother’s sisters (several of whom were neighbours), built a ramshackle house close by\nso she might keep away from them. By the time Becky had given birth to a second\nbaby, she had had enough of Bam Bam’s family and, obtaining her mother’s forgive-\nness, returned home. Later Bam Bam was permitted to join her in his in-laws’ house,\nbut he proved an unreliable son-in-law and Sibella eventually threw him out both for\nbeating Becky and disrespectfully announcing that he would never build his house\nnext to hers. Becky was sent away to a maternal aunt in Managua and only a year or\ntwo later was allowed to return to her parents, eventually moving into a house which\nBam Bam had built, by way of contrition, next to theirs. \nBecause adults are well aware that many girls become pregnant against their par-\nents’ wishes, they generally keep their tiara (female adolescent) daughters as close to the\nhouse and yard as possible, especially after dark. If a tiara is allowed to go out strolling\n(kirbi taukaia) in parts of the village where she has few family members and ‘bad boys’\nare known to loiter, she is usually expected both to take a chaperone (a reliable same-\nsex friend or sibling) and to exercise her capacity for ‘shame’ (swira), a speech style\nexhibiting avoidance of sexually explicit banter of the kind considered characteristic of\n‘courting’ (kut takaia) (Jamieson 2000). Although many girls experience this surveil-\nlance as constraining, most are also glad of it, being well aware that in some Miskitu dis-\ncourses the line between sexual consent and non-consent is anything but clearcut, a\ntheme examined below for the phenomenon of grisi siknis.18 A tiara may also face\nunwelcome parental pressure to marry a particularly suitable, usually older, man. If, for\nexample, a wealthy outsider (typically a middle-aged freightboat or fishboat owner)\nwishes to take a girl as his ‘wife’ (often one of several ‘wives’ dispersed in different vil-\nlages 19), her parents, aware of the possibility that he may offer them substantial help in\nlieu of brideserve, may well try and pressure her into going along with this, as Sibella\nand George unsuccessfully tried to do with their second daughter, Maisie, when an\nMASKS  AND  MADNESS 263\n17 Helms (1971: 54–5) considers similar clusters in the Rìo Coco village of Asang where they are\nknown as kiamp. \n18 The spectre of rape was particularly salient during the Contra War. Kakabila people blame some,\nthough not all, Contra units for a number of rapes in the Pearl Lagoon basin. For accounts of army\nrapes during the same period, see Reyes (1993: 60). \n19 See Roberts (1965: 109–10) for evidence of this type of polygyny from the early nineteenth\ncentury.\nelderly European businessman based in Bluefields took an interest in her. If she refuses,\nthey may even beat her, a course of action widely deemed entirely legitimate.\nMiskitu tiara are thus faced with a number of dilemmas. One the one hand their\nparents expect them to be sexually continent and demonstrate ‘shame’ until a suitable\ngroom is found. On the other, however, they are expected to use their sexual skills to\nsecure husbands of whom their parents approve. Miskitu girls also know, however,\nthat if they are to have any say at all regarding their conjugal futures, they must take\nmatters into their own hands, and in Kakabila most do, taking lovers on their own\ninitiative who, they hope, will eventually prove reliable husbands. In official dis-\ncourses wahma and tiara become adults through the acceptance and recognition of\nparents and parents-in-law, the solicitation of ‘permission’, the employment of ‘tes-\ntigo’ proxies, and appropriate demonstrations of ‘shame’. Unofficially, however, both\nknow that, unless they are lucky, they will probably have to manouevre themselves\ninto the kinds of adulthood they desire by using clandestine sexual intercourse as their\nprinciple instrument. Used, however, to both parental surveillance and a habitus of\n‘shame’, Miskitu tiara often find this daunting. \nMosko and grisi siknis\nThere are, among the Miskitu, rituals and forms of ritualised behaviour allowing par-\nticipants to express desire for the resolution of these dilemmas. I now describe and\nanalyse two of the most spectacular. This first is a masked dance performed in\nKakabila known as mosko;. the second is a contagious hysteria found throughout the\nMiskitu-speaking diaspora which periodically afflicts adolescent girls and young\nwomen, known as grisi siknis or fits.20\nMosko\nMosko is a event in which takes place in Kakabila, more or less every year in January.\nParticipants (or at least those who dance) disguise themselves with masks and \n264 MARK  J AM IESON\n20 ‘Fits’ is the term more commonly used in the bilingual English- and Miskitu-speaking communi-\nties of the Pearl Lagoon area. Although the great majority of instances of grisi siknis pertain to ado-\nlescent girls, it is also the case that other categories of person are known to have been afflicted. So,\nfor example, Dennis (1981: 452; 1985: 293) reports five men in Awastara as having suffered attacks.\nInterestingly, four of these were considered by Awastara people to be homosexuals. Grisi siknis\nsometimes also appears to afflict those experiencing problems with affines for whom ‘shame’ is the\nprescribed mode of behaviour. I encountered one such case in Kakabila where an older woman\nexperiencing problems with her son-in-law was afflicted. Dennis (1981: 482; 1985; 294) also reports\nattacks experienced in Krukira by both a man and his mother-in-law. Finally, it is also true that\nboth religious converts, both in the past and the present, and people facing immediate economic\nuncertainty have experienced attacks (see Schneider 1998: 331; and Dennis 1981: 472). During 1997,\nI attended a workship on health issues in Bluefields where it was reported that Miskitu male\nworkers digging the important canal at Layasiksa suffered grisi siknis attacks while, during a recent\nvisit to Kakabila in 1999 and 2000, I was told of a young adolescent girl who had ‘got the spirit’\nduring an assembly at the recently established evangelical Tabernacle church and become ‘really\ncrazy’ (‘real grisi takan’). These attacks on the economically insecure, the religiously ecstatic, and\nthose burdened with troublesome affines indicate interestingly that grisi siknis or ‘fits’ is a mode of\nexpression which allows a minority of its victims to express a rather wider range of concerns than\nthose expressed by the majority of its victims who are the subject of this article.\nill-fitting clothing and move through the village as a group.21 It is reckoned a joyous\noccasion and is generally considered part of the seasonal festivities which follow\nChristmas.22 It generally begins with the news, spread by word of mouth, that a par-\nticular individual, usually a young unmarried man, wishes to organise a mosko. This\nnews is usually accompanied by a provisional date and implies an invitation for those\nwho wish to dance to present themselves to him secretly. Although anyone may offer\nthemselves to the organiser as a dancer, and nobody is refused unless they are too\nyoung, it is by and large adolescents of both sexes who apply. The organiser also\napproaches those who might wish to provide musical accompaniment, in time assem-\nbling a group composed of one or two guitarists and a singer, as well as perhaps a har-\nmonica player and a coconut-grater player to provide rhythm. Finally, a character\nreferred to as the ‘doctor’ is also appointed.\nOn the day of the mosko, the participants make their way to the organiser’s\nhouse (usually that of his parents). It is important that the dancers do so discreetly\nbecause their identities should not, ideally, be known to the rest of the village.23\nInside the house the windows and door are shut, excited children shooed away, and\nthe dancers, doctor and organiser prepare themselves. The organiser considers the\nroute for the dance and tries as best he can to ensure the secrecy of the preparations,\nwhile the dancers, altogether around eight or ten, change into old clothes and boots.\nThe hands of the dancers are covered in old socks while their heads and faces are dis-\nguised with headcloths and large cardboard masks, the latter featuring holes for the\neyes and mouth and red marker-pen designs of no particular significance. The\ndancers also stuff rags into their clothes to disguise and render their body shapes\ncomic. Each then is provided by the organiser (or perhaps an assistant) with a switch\nfrom a tree or bush. Like the musicians and the organiser, the doctor does not change\nhis clothes or disguise his appearance but he does paint his face red and is issued with\na water bottle (to revive flagging dancers) and, sometimes, a comic doctor’s bag.24\nOutside the closed doors of the organiser’s house the musicians tune up and decide\non the calypsos and ‘palo de mayos’25 they will be playing. By this time hordes of\nchildren assemble in the yard and excitedly exchange news about who they believe is\ndancing, while those adults who happen to be sitting around complain that the\ndancers they believe they have already identified are too young to be performing\nmosko.\nMASKS  AND  MADNESS 265\n21 Superficially it is similar to the San Gerónimo masquerade in Bluefields, the Dixie Man dance\nfound in Miskitu villages on the Rìo Coco (Helms 1971: 194–6), the sikro dances performed in\nearlier times (Irias 1853: 164; Collinson 1970: 151–2; Conzemius 1932: 161–4), and the masked\ndancing associated with the coronation of the Miskitu king found in Awastara and other villages\nnorth of Puerto Cabezas (Dennis 1982). Its most significant elements, however, are probably\nderived from the wanáragawa or John Canoe dance brought to the Pearl Lagoon basin in the late\nnineteenth century by immigrant Black Caribs (or Garìfunas) from Honduras (Davidson 1980).\nSee Young (1947), Conzemius (1928: 192–3) and Kerns 1983: 187–9) for description of wanára-\ngawa.\n22 I have witnessed mosko twice, first in 1993 and again in 2000. \n23 Collinson (1870: 151), describing ceremonies which are probably sikros, writes that participants are\n‘decked out with feather and beads, and smeared over with paint, so as to become perfectly unrecog-\nnisable’ (my emphasis).\n24 Sometimes a ‘doctor’s wife’ is also appointed, but I have not seen this.\n25 ‘Palo de mayo’ (literally ‘maypole’) is a calypso-like music style sung in English popular in the\nregion.\nEventually the dancers emerge, switches in hand, and the children clambering\naround the house veranda and looking up from the yard begin to scream excitedly. A\ncouple of the dancers may even lash out with their switches at any close by, an action\nwhich provokes even more screaming. The whole troupe, dancers, doctor and organ-\niser, then join the musicians in the organiser’s yard, and the latter strike up a calypso.\nThe dancers gyrate and throw themselves around with rhythmic and comic effect, the\ncomedy enhanced by their body shapes made ridiculous by the rags stuffed into their\nclothing; occasionally one or two peel off to chase children who get too close. Some\ndancers dance in pairs and simulate copulation, a cause for much merriment, while\nothers (with lots of rags stuffed into the clothing in front of their stomachs) pretend\nfrom time to time that they are pregnant or giving birth, at which moments the red-\nfaced doctor arrives on the scene in order to lend comic assistance. The adults watch-\ning laugh and warn both the dancer ‘in labour’ and the doctor that they are doing it\nwrong, and will consequently provoke miscarriage. \nHaving danced to one or two songs at the organiser’s house, the troupe then walk\non to the next house, the dancers once again chasing away excited children. The organ-\niser approaches the owners of this next house and asks if they wish to buy a few dances\nat a fixed price per dance. The owner of the house may complain at the price but\nusually agrees to buy at least one and sometimes as many as five, and the musicians,\ndancers and doctor perform again. Adult members of the audience collude with the\nidea that the dancers are strangers, though in reality all the disguised children are well\nknown to them, and they remark jokingly to one another that these mosko are so good\nthat they must have come from Managua or even ‘the States’. Once the troupe have\nsatisfied the owner they move on to the next house, and thus continue until every\nhouse in the village (around 50 in the case of Kakabila) has been visited, a procedure\nwhich may take several hours.26\nOnce the dancers have completed their tour of the village they return to the\norganiser’s house and shut the doors and windows behind them in order to preserve\ntheir ritual secrecy in spite of the fact that their identities have generally been guessed\nsome hours earlier. They take off their masks, change out of their grotesque clothing\nand, with musical accompaniment, perform one or two dances purely for themselves.\nThe organiser counts the money and the troupe then make plans for a party in the vil-\nlage school or community building, to take place in a day or so’s time. This money\nthen buys both a chicken (to be cooked as a soup) and batteries for the party\n‘grabador’ (radio cassette recorder). The party itself is typically an adolescent affair\nwith an atmosphere considered extremely sexually charged. \nGrisi siknis\nI return to consider the significance of mosko further on. First, however, I wish to\nexamine grisi siknis. Grisi siknis (crazy sickness), or ‘fits’ as it known in Kakabila and\nRaitipura, is a culture-bound syndrome that mostly, though not exclusively, afflicts\nadolescent Miskitu girls. It is comprehensively described in an interesting series of\narticles by anthropologist Philip Dennis (1981; 1985; 1999), all of which emphasise \nthe psycho-sexual nature of this phenomenon within a culture in which hysteria is\n266 MARK  J AM IESON\n26 Conzemius (1928: 192–3), describing wanáragawa among the Black Caribs of Honduras notes,\nnotes that dancers go from house to house collecting money. \nconsidered a normal means of expression.27 In this article I draw on Dennis’ findings,\nas well as my own from Kakabila and Raitipura, to reach conclusions which are dif-\nferent but, I believe, complementary to his.28\nMany Miskitu girls never suffer grisi siknis attacks while others, like some of the\ngirls I knew in Kakabila, are affected very occasionally. Likewise in many villages\nattacks are rather sporadic. In Awastara, Dakura, Krukira, Raitipura and some other\nvillages, however, grisi siknis has, during particular periods, assumed an epidemic char-\nacter, spreading from girl to girl.29 In these villages grisi siknis has proved to be conta-\ngious and attacks have afflicted the same victims night after night.30\nGrisi siknis attacks usually take place around sundown. Victims generally become\nhysterical, shout and scream obscenities and threats, tear their clothes off, and run out\nof the house towards the bush or sea. In the Raitipura attacks of 1992 and 1993, wit-\nnesses often described victims ‘flying’ (palaia) from a window rather than running out\nof the door,31 while in Awastara, Dennis (1981: 464) reports that victims often bran-\ndished machetes or broken bottles.32 Victims often appear to be completely oblivious\nto their surroundings and therefore, people say, they have to be captured and\nrestrained for their own safety, sometimes with ropes. This job is generally performed\nby the young men of the village who generally regard grisi siknis attacks as a source of\ngreat excitement and amusement, though their participation is often a source of futher\nanxiety for parents who fear that their daughters might be gang-raped in the bush\n(Dennis 1981: 453, 482; 1985: 293). \nIn the accounts discussed by Dennis for Awastara and neighbouring communities\nand in the 23 interviews conducted by Dr Isler and myself in Raitipura, most victims\nsaid that attacks generally followed giddiness (bla) and headaches. Victims then claim\nto experience hallucinations, seeing fierce animals sometimes and inevitably devils or\n‘satans’ of various kinds who make them have sex. Often the perpetrator is described\nas an ugly, hairy, black demon of the kind known in Miskitu as uhlak, and typically\nthis figure carries his victim away into the bush. Attacks of this kind are described as\nMASKS  AND  MADNESS 267\n27 As Dennis (1981: 475) notes, grisi siknis is by no means an exclusively recent phenomenon. See, for\nexample, Bell (1862: 255) and Conzemius (1932: 123).\n28 Dennis’ grisi siknis material is certainly much more detailed than my own. My own ethnography\nis based on reports of a few isolated attacks in Kakabila and several interviews collected by Dr Marc\nIsler and myself in the Miskitu language with the victims and their families of the ‘epidemics’ which\ntook place in neighbouring Raitipura in both 1992 and 1993. I should make it clear that I have not\nwitnessed attacks first hand but have talked to Kakabila people at some length about such episodes\nand their aetiology. Barrett (1992: 28, 173, 210–11, 223–7) also contains some discussion of grisi\nsiknis, including an account of an earlier epidemic in Raitipura.\n29 Parents usually consult people knowledgeable about bush medicine and shamans (sukias or, in the\nRaitipura case, the Kakabila Prophet) in order to find cures. Typically, these individuals produce\nsweet-smelling medicines and also suggest that the victims are prohibited from smelling or eating\ncounteragents (waila) which might provoke further attacks. In Raitipura in 1993 these countera-\ngents typically included jack and tarpon because both kinds of fish, like victims during attacks, are\nnotoriously hard to catch. See also Dennis (1981: 470). \n30 Dennis (1985: 292) reports that in Awastara (pop. 664 at the time of his fieldwork) as many as 62\npeople were victims of grisi siknis attacks over the course of the previous twenty years. \n31 See Dennis (1981: 479) for interesting discussion of the relationship between a number of forms of\nMiskitu hysteria and the verb palaia. \n32 While the symptoms in different villages are very broadly the same, there are also variations\nbetween villages in the character of typical attacks. \nbeing extremely frightening (Dennis 1981: 473). On other occasions, however,\nespecially in the Dakura epidemic reported by Dennis (1981: 467), the perpetrator is\ndescribed as a handsome white man or Spaniard who takes the victim to a big town to\nenjoy expensive food and drink. These attacks are sometimes described by victims in\na more positive light. \nParents and sympathetic adults generally suspect molestation (though not pos-\nsession) by setan nani (satans) of one kind or another and consider their daughters to\nbe blameless victims. These setan nani are sometimes said to be liwa (water demons)\nor swinta (a bush demon) in Awastara and other northern Miskitu villages (Dennis\n1981: 471), though in Kakabila and Raitipura in the Pearl Lagoon basin, it is usually\nprahaku, a sky spirit of considerable power and malevolence, who is held responsible\n(see also Barrett 1992: 225). Other witnesses, however, are more cynical. Dennis (1981:\n453) reports, for example, that the Awastara school teacher ‘argued that grisi siknis was\nsimply an excuse for girls to sleep with men’, those men presumably sent to catch\nthem. Likewise, in Kakabila cynics told me that girls experiencing ‘fits’ are simply\n‘lovestroke’ (love-struck). \nDennis (1981: 479) argues that grisi siknis attacks are responses to stresses such as\n‘emotional upset, worry, fear and general anxiety’. These stresses, he argues (and I\nendorse this view), are brought about by tensions between the desire for excitement in\nmetropolitan settings, parental constraints on the expression of tiara sexuality organ-\nised through the politics of ‘shame’ (see also Jamieson 2000), and, I would add, a\nwidely held belief that men are intrinsically bad.33 He also maintains, significantly for\nthe purposes of this article, that the fact that Miskitu girls know that they must use\ntheir charms and sexual skills to attract their future spouses, is likely to be a key factor\n(Dennis 1981: 480).34 In my view, the symptoms and aetiology of grisi siknis are appar-\nently expressions of the anxieties experienced by tiara faced with an imminent, poss-\nibly welcome, possibly unwelcome, transition to adulthood, described in terms of a a\nculture-specific constellation of representations and beliefs associated with the notion\nthat sexual intercourse is a transformative device with the potential to turn girls into\nwomen.\nConclusion\nParents, particularly those described in Kakabila as ‘jealous’, recognise the transfor-\nmative power of unlicensed sexual intercourse and therefore try as far as possible to\nkeep their daughters under surveillance, both physically (making sure they wander no\nfurther than the yard) and through discourse regimes organised around ‘shame’\n(Jamieson 2000). Unsuitable suitors thought to be laying siege to their daughters are\nthus kept at bay or ‘run’ (chased away), practices which for many girls induce a sense\nof imprisonment. In Kakabila there is a humorous kisi (folktale) which nicely captures\nthis sense of siege and imprisonment. \nIn this story Jack (the Kakabila trickster) arrives at a town and obtains some\nmenial work for the king. The king has a beautiful daughter but she is kept locked up\n268 MARK  J AM IESON\n33 Kakabila people, speaking of male sexual appetities, often remark that ‘waitna ba setan’ (man is the\ndevil).\n34 To this end there is, in many Miskitu villages, a trade in ‘love medicine’. See also Helms (1971: 86)\nfor Asang, and Conzemius (1928: 201) for the Black Caribs of Honduras.\nin a high tower. The daughter sees Jack, likes him and ‘makes plenty sign’ (secretly sig-\nnals to him). She eventually lets down her hair from a high window and Jack climbs\nup it. They have sexual intercourse and she becomes pregnant. The king, eventually\naware of his daughter’s pregnancy, asks her what happened and she tells him. He then\nconfronts Jack and demands an explanation. Jack is defiant, however, and he tells the\nking that he only took the job on in the first place because he wanted his daughter. The\nKing is annoyed but knows that there is nothing he can really do now, other than\ndemand that Jack marry her. Jack agrees, and within a day or so the king discovers that\nJack has built a house of gold next to his (matrilocally, according to usual Miskitu\npractice and the king’s delight). Everyone is now happy.35\nThis story, I suggest, nicely lays bare the ‘truth’ that it is the consequences of\nsexual intercourse in the final analysis, and not the intentions of parents, which trans-\nform girls into wives and therefore adults. \nMosko, as it is practiced in Kakabila, and grisi siknis attacks of the type described\nabove are both, I believe, expressions of anxiety and desire surrounding the transition\nto adulthood. Mosko in Kakabila represents this transition in a ‘legitimate’ and ide-\nalised form. Strangers, or those who have previously been invisible because they were\nchildren, arrive at village houses offering to contract relationships with adults through\nthe sale of dances.36 These dancers may on occasion simulate both acts of sexual inter-\ncourse and childbirth, possibly hinting at an alternative and less palatable route to\nadulthood, but these acts are rendered safe by being lampooned. In any case mosko is\nless a ritual expression about the soliciting of parental permission for courtships than\na more generalised desire to engage with adults as equals.37 Grisi siknis, however, lays\nbare for all to see the ‘truth’ that, when all is said and done, it is a potentially perilous\nactivity, illicit sexual intercourse with boys or men, which turns girls into women.\nMiskitu tiara are normatively constrained from making this point, from both personal\nand general perspectives, through their inculcations of regimes of ‘shame’ (swira).\nAttacks by ‘satans’, however, allow them both to make this point and, furthermore, to\npresent themselves as victims rather than the perpetrators of sexual activity in the\ndramas of molestation in which this point is encoded.\nComparison of the details of mosko, as it is performed in Kakabila, with the aeti-\nology of grisi siknis attacks reveals some interesting contrasts. For example, mosko\ndancers cover themselves up completely, concealing faces and identities and thereby\nmaking themselves the idealised high-status strangers with whom, as I noted above,\nthe Miskitu have historically contracted relations. Grisi siknis victims, on the other\nMASKS  AND  MADNESS 269\n35 This story may well be a Miskitu-ized version of the Rapunzel fairy story, told by the Brothers\nGrimm (Grimm and Grimm 1993: 74–8).\n36 The music for these dances, calypso and ‘palo de mayo’, is preferred, along with country and west-\nern, by older adults. Children and younger adults generally favour reggae (‘rasta music’) and soca.\n37 Mosko, I should add, is also performed in January in neighbouring Creole villages, notably Pearl\nLagoon, the district’s administrative and economic capital 7 miles away. Interestingly, it is Kakabila\nadults rather than children who usually go there to take part. Almost always it is poorer adults who\ngo to Pearl Lagoon to perform, suggesting to me that, while in intra-village contexts Kakabila ado-\nlescents use mosko as a means of expressing the desire for majority status in the manner described\nabove, in other contexts Kakabila people from an ‘Indian’ village which is both economically\ndependent on Pearl Lagoon and rather low in status (Jamieson 1998), may understand the per-\nformance of mosko as a means of expressing the desire for engagement with the town’s high status\nCreoles.\nhand, tear their clothes off and become oblivious to those around them, onlookers\nbeing rendered invisible.38 In this nightmare spirit world victims become disengaged\nfrom the ‘real’ world of family members and fellow villagers, the perspectives of the\nlatter being invisible and therefore irrelevant. Thus while the audience view is fore-\ngrounded in mosko, it is the victim’s perspective which receives particular attention\nduring grisi siknis episodes. \nAs with mosko we find in grisi siknis, representations of mysterious strangers, some\nof kinds historically familiar to Miskitus, but in grisi siknis attacks strangers now appear,\nfrom the perspective of anxious girls, as dangerous sexual predators. Whereas the mosko\ndancers engage with adults for the first time, perhaps both as would-be village adults,\nbut more significantly as the benevolent mysterious strangers represented by the masks\nwhich hide the identities of the wearers, girls afflicted by grisi siknis see themselves as\nvictims of these mysterious strangers and they literally demonise them.39 And, while\nmosko dancers use switches to chase away children as a sign of their eagerness to\nembrace relations with adults, it is the grisi siknis victims themselves who are pursued,\ncertainly by the gangs of boys who deem it their duty to catch and restrain them, but\nmore significantly by the ‘satans’ of various forms who beat and possess them sexually.40\nReal life situations experienced by wahma and tiara in Miskitu villages rarely\ncome close to the ideal celebrated in mosko. Both know that if they wait for adults to\nlegitimate their transition to adulthood (symbolically encoded in mosko through the\nbuying of dances), they will either wait for ever or, in the case of many girls, be pres-\nsured into accepting men their parents consider suitable sons-in-law. Many adoles-\ncents therefore take the initiative and attempt to turn themselves into adults by\nproducing offspring and conjugal partnerships of their own accord. However, this is a\ntricky business. Girls in particular are aware of a number of complicating factors:\nparental surveillance, their own swira (shame), unwelcome suitors foisted on them by\nparents, and the possibility that they are left with ‘outside children’ (unrecognised by\ntheir fathers). Girls also know that beyond the confines of the household and the con-\njugal union are murkier dangers linked to the expression of female sexuality which a\nhabitus of ‘shame’ leave ill-defined. Miskitu girls also know that ‘waitna ba setan’\n(man is Satan), and that men are ‘trickifying fellows’ who seek women as ‘pass times’\nfor their own sexual gratification, often ‘fooling them up’ once they become pregnant.\nUnlike the essentially conservative antics of mosko, grisi siknis provides forums for the\nrepresentation of these anxieties, as the ‘shame’ which one might think would prevent\n270 MARK  J AM IESON\n38 The victims are only apparently aware of onlookers if they try to restraint them. \n39 This is not to say that mosko and grisi siknis are imagined as opposites in any sense. Indeed Miskitu\nvillages are probably more likely to have one or the other phenomenon, rather than both. Rather,\nboth are ritualised forms of action which make use of similar symbolic devices from a wider, more\ngeneralised Miskitu inventory, to make sense of a shared set of concerns, specifically those relating\nto the transition from childhood (tuktan) to adulthood (almuk). \n40 Dennis interestingly notes that the verb taibi briaia (literally ‘to possess and press down on’) is used\nto refer both to the act of tying up in the context of grisi siknis attacks and to generally controlling\none’s children. Taibi briaia means to restrict, or to have another person under one’s control.\nLiterally, it can refer to holding down and tying up a person having grisi siknis attacks. Less liter-\nally it can refer to the restriction implied in subordinate relationships – for example, ‘children as\nrestricted by their parents’ (Dennis 1985: 302; my emphasis). In Kakabila both taibaia and briaia,\nthe constituent verbs of the serial verb construction taibi briaia, can be used transitively to mean\n‘have sex with’. Briaia (to possess) is a euphemism, while taibaia (to press down on) has a more\ngraphic sense.\nsuch demonstrations is obviated through the displacement of blame on to male\ndemons. \nAs I noted above, the Miskitu lack institutionalised rituals which performatively\neffect the transformation of children into adults. There are no initiations into adulthood\nfor boys or girls and so, consequently, the project of reinventing oneself as an adult is\nlargely a matter for the individual. This project of reinvention, officially resting on the\nsolicitation of parental permission and unofficially on the employment of one’s sexu-\nality, is a tricky business; however, mainly because parents, by keeping their daughters\nphysically close at hand and by policing expressions of sexuality through the politics of\n‘shame’ (swira), leave little space for overt adolescent manouevre. Little wonder then\nthat adolescents, and adolescent girls in particular, have elaborated such spectacularly\norchestrated expressions of the desires and fears surrounding this process.\nMark Jamieson\nDepartment of Social Anthropology\nUniversity of Manchester\nRoscoe Building\nBrunswick Street\nManchester M13 9PL\nmark.a.jamieson@man.ac.uk\nReferences\nBarrett, Bruce. 1992. ‘The syringe and the rooster. Medical anthropology on Nicaragua’s Atlantic\nCoast’. (PhD dissertation, University of Wisconsin, Madison).\nBell, Charles Napier. 1862. ‘Remarks on the Mosquito territory, its climate, people, productions’,\nJournal of the Royal Geographical Society 32: 242–68.\nBourgois, Philippe. 1986. ‘The Miskitu of Nicaragua. Politicized ethnicity’, Anthropology Today 2: 4–9.\nCollier, Jane F. and Michelle Z. Rosaldo. 1981. ‘Politics and gender in simple societies’, Sherry Ortner\nand Harriet Whitehead (eds.), Sexual meanings. Cambridge: Cambridge University Press.\nCollinson, John. 1870. ‘The Indians of the Mosquito territory’, Memoirs read before the\nAnthropological Society of London 1867–9 3: 148–56.\nConzemius, Eduard. 1928. ‘Ethnographical notes on the Black Carib (Garif)’, American\nAnthropologist 30: 183–205.\n1932. Ethnographic Survey of the Miskito and Sumu Indians of Honduras and Nicaragua. Bureau of\nAmerican Ethnology Bulletin 106. Washington D.C.: U.S. Government Printing Office.\nDampier, William. 1927. A new voyage round the world. London: Argonaut Press. First published 1697.\nDavidson, William V. 1980. ‘The Garofuna of Pearl Lagoon: ethnohistory of an Afro-American\nenclave in Nicaragua’, Ethnohistory 27: 31–47.\nDe Kalb, Courtenay. 1893. ‘Nicaragua. Studies on the Mosquito Shore in 1892’, Journal of the\nAmerican Geographical Society 25: 236–83. \nDennis, Philip A. 1981. ‘Grisi siknis among the Miskito’, Medical Anthropology: 445–505. \n1982. ‘Coronation on the Miskito Coast’, Geographical Magazine 54:392–5. \n1985. ‘Grisi siknis in Miskito culture’, in Ronald C. Simons (ed.) The culture-bound syndromes. Folk\nillnesses of psychiatric and anthropological interest. Dordrecht: D. Reidel.\n1999. ‘Grisi siknis. Una enfermedad entre los Miskitos’, Wani 24: 5–12.\nDozier, Craig L. 1985. Nicaragua’s Mosquito Shore. The years of British and American presence.\nAlabama: University of Alabama Press. \nExquemelin, A. O. 1969. The buccaneers of America. Harmondsworth: Penguin. First published in\nDutch in 1678. \nFloyd, Troy S. 1967. The Anglo-Spanish struggle for Mosquitia. Albuquerque: University of New\nMexico Press. \nMASKS  AND  MADNESS 271\nGrimm, J.  L. C. and W. C. 1993. Grimm’s fairy tales. Ware: Wordsworth Editions.\nHale, Charles R. 1994. Resistance and contradiction. Miskitu Indians and the Nicaraguan state,\n1894–1987. Stanford: Stanford University Press. \nHale,CharlesR.andEdmundT.Gordon.1987. ‘Costeodemography:historicalandcontemporarydemog-\nraphy of Nicaragua’s Atlantic Coast’, CIDCA\/Development Study Unit (eds.), in Ethnic groups and\nthe nation state. The case of the Atlantic Coast in Nicaragua. Stockholm: University of Stockholm.\nHelms, Mary W. 1970a. ‘Matrilocality and the maintenance of ethnic identity. The Miskito of eastern\nNicaragua and Honduras’, Proceedings of the XXXVIII Congress of Americanists, Munich.\n1970b. ‘Matrilocality, social solidarity, and culture contact. Three case histories’, Southwest Journal\nof Anthropology 26: 197–212. \n1971. Asang. Adaptations to culture contact in a Miskito community. Gainesville: University of\nFlorida Press.\n1976. ‘Domestic organization in eastern Central America. The San Blas Cuna, Miskito and Black\nCarib compared’, In The Western Canadian Journal of Anthropology 6: 133–63. \n1983. ‘Miskito slaving and culture contact. Ethnicity and opportunity in an expanding population’,\nJournal of Anthropological Research 39: 179–97.\nIrias, Don Juan Francisco. 1853. ‘Rio Wanks and the Mosco Indians’, Transactions of the American\nEthnological Society 3: 161–6.\nJamieson, Mark. 1998. ‘Linguistic innovation and relationship terminology in the Pearl Lagoon basin\nof Nicaragua’, Journal of the Royal Anthropological Institute 4: 713–30.\n2000. ‘It’s shame that makes men and women enemies: the politics of intimacy among the Miskitu\nof Kakabila’, Journal of the Royal Anthropological Institute 6: 311–24.\nKerns, Virginia. 1983. Women and the ancestors. Black Carib kinship and ritual. Urbana: University of\nIllinois Press.\nLa Fontaine, J. 1985. Initation. Ritual drama and secret knowledge across the world. Harmondsworth:\nPenguin Books.\nM. W. 1732. ‘The Mosqueto Indian and his golden river. A familiar description of the Mosqueto king-\ndom in America with a relation of the strange customs, religion, wars &c. of those heathenish\npeople’, A. Churchill (ed.), A collection of voyages and travels, Vol. 6. London.\nNaylor, Robert A. 1989. Penny ante imperialism. The Mosquito Shore and the Bay of Honduras,\n1600–1914. A case study in British informal empire. London: Associated University Press. \nNietschmann, Bernard. 1973. Between land and water. The subsistence ecology of the Miskito Indians,\neastern Nicaragua. New York: Seminar Press.\nNoveck, Daniel. 1988. ‘Class, culture and the Miskito Indians. A historical perspective’, Dialectical\nAnthropology 13: 17–29.\nOlien, Michael. 1988. ‘After the Indian slave-trade. Cross-cultural trade in the western Caribbean rim-\nland, 1816–1820’, Journal of Anthropological Research 44: 41–66.\nRaveneau de Lussan. 1930. Raveneau de Lussan, buccaneer of the Spanish Main and early French fili-\nbuster of the Pacific. A translation into English of his journal of a voyage into the South Seas in\n1684 and the following years with the filibusters. Trans. and ed. M. E. Wilbur. Cleveland: Arthur\nH. Clark Co. First published in French in 1689. \nReyes, Reynaldo. 1992. Ráfaga. The life story of a Nicaraguan Miskito comandante. Norman:\nUniversity of Oklahoma Press. \nRivera, Virgilio and Ronnie Vernooy. 1991. ‘El Dama. Una historia laboral costeña’, Ronnie Vernooy\n(ed.), ¿Como vamos a sobrevivir nosotros? Aspectos de las pequeñas economías y autonomía de la\nCosta Caribe de Nicaragua. Managua: CIDCA-UCA.\nRoberts, Orlando W. 1965. Narrative of voyages and excursions on the east coast and in the interior of\nCentral America. Gainesville: University of Florida Press. First published in 1827. \nSchneider, Herman G. 1998. La Mosquitia. Historia de la Unitas Fratrum en la Mosquitia, 1849–1898.\nManagua: CIEETS. First published in German in 1899.\nVilas, Carlos M. 1989. State, class and ethnicity in Nicaragua. Capitalist modernization and revol-\nutionary change on the Atlantic Coast. Boulder: Lynne Rienner.\nYoung, Thomas. 1847. Narrative of a residence on the Mosquito Shore with an account of Truxillo, and\nthe adjacent islands of Banacca and Roaton. London: Smith, Elder and Cornhill.\n272 MARK  J AM IESON\n"}