{"doi":"10.1103\/PhysRevE.61.1170","coreId":"68631","oai":"oai:eprints.lancs.ac.uk:31903","identifiers":["oai:eprints.lancs.ac.uk:31903","10.1103\/PhysRevE.61.1170"],"title":"Resonances while surmounting a fluctuating barrier.","authors":["Iwaniszewski, J.","Kaufman, I. K.","McClintock, Peter V. E.","McKane, A. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"Electronic analog experiments on escape over a fluctuating potential barrier are performed for the case when the fluctuations are caused by Ornstein-Uhlenbeck noise (OUN). In its dependence on the relation between the two OUN parameters (the correlation time t and noise strength Q) the nonmonotonic variation of the mean escape time T as a function of t can exhibit either a minimum (resonant activation), or a maximum (inhibition of activation), or both these effects. The possible resonant nature of these features is discussed. We claim that T is not a good quantity to describe the resonancelike character of the problem. Independently of the specific relation between the OUN parameters, the resonance manifests itself as a maximal lowering of the potential barrier during the escape event, and it appears for t of the order of the relaxation time toward the metastable stat","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68631.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31903\/1\/PRE2000FluctBarrier.pdf","pdfHashValue":"15f982932c0ec55e5e532574608c038dc66ad1bb","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31903<\/identifier><datestamp>\n      2018-01-24T02:57:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Resonances while surmounting a fluctuating barrier.<\/dc:title><dc:creator>\n        Iwaniszewski, J.<\/dc:creator><dc:creator>\n        Kaufman, I. K.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        McKane, A. J.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Electronic analog experiments on escape over a fluctuating potential barrier are performed for the case when the fluctuations are caused by Ornstein-Uhlenbeck noise (OUN). In its dependence on the relation between the two OUN parameters (the correlation time t and noise strength Q) the nonmonotonic variation of the mean escape time T as a function of t can exhibit either a minimum (resonant activation), or a maximum (inhibition of activation), or both these effects. The possible resonant nature of these features is discussed. We claim that T is not a good quantity to describe the resonancelike character of the problem. Independently of the specific relation between the OUN parameters, the resonance manifests itself as a maximal lowering of the potential barrier during the escape event, and it appears for t of the order of the relaxation time toward the metastable state<\/dc:description><dc:date>\n        2000<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31903\/1\/PRE2000FluctBarrier.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevE.61.1170<\/dc:relation><dc:identifier>\n        Iwaniszewski, J. and Kaufman, I. K. and McClintock, Peter V. E. and McKane, A. J. (2000) Resonances while surmounting a fluctuating barrier. Physical Review E, 61 (2). pp. 1170-1175. ISSN 1539-3755<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31903\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevE.61.1170","http:\/\/eprints.lancs.ac.uk\/31903\/"],"year":2000,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW E FEBRUARY 2000VOLUME 61, NUMBER 2Resonances while surmounting a fluctuating barrier\nJ. Iwaniszewski,1,2,* I. K. Kaufman,1,3,† P. V. E. McClintock,1,‡ and A. J. McKane4,§\n1School of Physics and Chemistry, Lancaster University, Lancaster LA1 4YB, United Kingdom\n2Institute of Physics, Nicholas Copernicus University, Grudzia¸dzka 5, 87-100 Torun´, Poland\n3Russian Research Institute for Metrological Service, Ozernaya 46, 119361 Moscow, Russia\n4Department of Theoretical Physics, University of Manchester, Manchester M13 9PL, United Kingdom\n~Received 7 September 1999!\nElectronic analog experiments on escape over a fluctuating potential barrier are performed for the case when\nthe fluctuations are caused by Ornstein-Uhlenbeck noise ~OUN!. In its dependence on the relation between the\ntwo OUN parameters ~the correlation time t and noise strength Q! the nonmonotonic variation of the mean\nescape time T as a function of t can exhibit either a minimum ~resonant activation!, or a maximum ~inhibition\nof activation!, or both these effects. The possible resonant nature of these features is discussed. We claim that\nT is not a good quantity to describe the resonancelike character of the problem. Independently of the specific\nrelation between the OUN parameters, the resonance manifests itself as a maximal lowering of the potential\nbarrier during the escape event, and it appears for t of the order of the relaxation time toward the metastable\nstate.\nPACS number~s!: 05.40.2a, 82.20.Mj, 02.50.EyI. INTRODUCTION\nIn classical systems the escape of a particle from a local\npotential minimum over a potential barrier is possible due to\ninteraction with a thermal bath. Independently of the specific\nmeasure used to characterize the duration of the escape pro-\ncess, the average time T spent waiting for a successful jump\ndepends on the height of the barrier DU and the temperature\nT of the bath through the Arrhenius formula: T\n;exp(DU\/kT). Lately, it has been shown that this time may\nbe significantly reduced or prolonged by correlated stochas-\ntic perturbation of the barrier. In the context of recent interest\nin resonancelike phenomena in noisy dynamics, it is natural\nto look for a relationship between T and the characteristic\ntime of the perturbation given by its correlation time t. In\n1992, studying a triangle barrier switched randomly between\nthe two possible configurations, Doering and Gadoua @1# dis-\ncovered that T~t! may exhibit a minimum for t of the order\nof the escape time over the lower possible configuration of\nthe barrier. They therefore called this effect resonant activa-\ntion ~RA!. Later it was shown @2–5# that this resonant rela-\ntion between the time scales of the system is characteristic of\nthose cases where the potential barrier is disturbed by di-\nchotomic noise ~DN!. If a Gaussian correlated noise, i.e., an\nOrnstein-Uhlenbeck noise ~OUN!, is applied the resonant\nminimum of T occurs when t is of the order of the relaxation\ntime toward the metastable state @6,3–5,7#.\nIn @8# one of the present authors concluded that the oppo-\nsite effect—the occurrence of a maximum in the t depen-\ndence of T—can be observed, too ~see also @9#!, although its\npossible resonance origin remained unknown. This was\n*Author to whom correspondence should be addressed. Electronic\naddress: jan.iwaniszewski@phys.uni.torun.pl\n†Electronic address: ikaufman@df.ru\n‡ Electronic address: p.v.e.mcclintock@lancaster.ac.uk\n§ Electronic address: ajm@a3.ph.man.ac.ukPRE 611063-651X\/2000\/61~2!\/1170~6!\/$15.00called inhibition of activation ~IA!. Moreover, considering\nthe exact formulas for the mean first passage time ~MFPT!\nover a barrier disturbed by OUN, it was inferred that a non-\nmonotonic form for T~t! is generic and conditioned by the\nrelationship between t and the intensity of the noise Q. In\nparticular, RA occurs if Q is a linear function of t, i.e., if the\nvariation of the noise is constant. On the other hand, if Q is\nt independent one could expect IA to occur. These conclu-\nsions agree with the theoretical @10,6,4,7#, numerical @4,7#,\nand experimental @6,5# findings of other authors.\nIn @8# a more general class of noises, with Q being a more\ncomplicated function of t, was also considered and some\nuniversal criteria for the appearance of RA and IA were\nfound. In order to verify them we have performed experi-\nments on analog electronic circuits, the results of which are\npresented and discussed below ~Sec. IV!. The conclusions of\nthis study allow us to verify the reason for the appearance of\nthe extremes of T~t! and, if they are of a resonance nature,\nwhich quantities are in resonance ~Sec. V!. But we start ~Sec.\nII! by presenting a brief resume of the previous findings @8#\nand then ~Sec. III! specifying the model investigated and\ndiscussing some experimental details.\nII. THEORETICAL PREDICTIONS\nLet us consider the overdamped one-dimensional motion\nof a particle in a bistable potential U(x) in the presence of a\nheat bath. In our study the potential is also modulated in time\nby a stochastic perturbation which, for simplicity, does not\nalter the positions of extremes of the total potential. The\ndynamics of the particle is governed by the following Lange-\nvin equation:\ndx\ndt 52U8~x !2V8~x !z~ t !1j~ t !, ~1!\nwhere thermal fluctuations are represented by Gaussian\nwhite noise j(t) of zero mean and correlation function\n^j~ t !j~ t8!&52qd~ t2t8!. ~2!1170 ©2000 The American Physical Society\nPRE 61 1171RESONANCES WHILE SURMOUNTING A FLUCTUATING . . .The intensity q of the noise is linearly proportional to the\nbath temperature. The fluctuating part of the potential is\ndriven by OUN,\ndz\ndt 52\n1\nt\nz1\nA2Q\nt\nh~ t !, ~3!\nwhere h(t) is another Gaussian white noise independent of\nj(t), of zero mean and correlation function ^h(t)h(t8)&\n5d(t2t8). The relation between the two parameters of this\nnoise, namely, its strength Q and its correlation time t , ap-\npears to be crucial for the appearance of RA or IA, so, in\ngeneral, Q should be considered as a function of t . As was\nshown in @8#, the general tendencies in the dependence of\nMFPT on t can be found by analyzing the problem in the\nlimits of very fast ~t→0! and very slow ~t→‘! barrier fluc-\ntuations, only. We do not consider here the general form of\nQ(t) treated in @8#. To discuss all the main features of the\nescape problem it is enough to assume that for any t the\nnoise strength Q has the following form:\nQ~t!5Q0ta, 0,Q0,‘ , 0<a<1. ~4!\nIn the limit t→0 for a50 the noise z(t) becomes white,\nwhile for a.0 the noise intensity Q goes to zero, so z(t)\nvanishes. The opposite limit t→‘ can be discussed in a simi-\nlar way. However, a better quantity to use in the discussion\nbelow is the noise variance D given as\nD5Q\/t . ~5!\nThus, if a,1 the noise z(t) disappears since D→0. How-\never, if a51 then D→Q0, so we acquire an ensemble of\nstatic potentials spread according to a Gaussian distribution\nwith the variance D. Let us mention that the cases of a50\nand a51 are the commonly used variants of OUN: constant-\nstrength noise ~CSN! @Q(t)5Q0# and constant-variance\nnoise ~CVN! @Q(t)5tQ0# , respectively.\nThe main conclusions of @8# were as follows. First, inde-\npendently of the specific form of Q, we have\nT0<Ts<T‘ , ~6!\nwhere the indices 0 and ‘ refer to the appropriate limit of t ,\nand Ts is the MFPT for an unperturbed ~static! barrier. It is\nobvious that the equalities relate to the cases of vanishing\nnoise mentioned above. The analysis of the leading order\ncorrections of T for finite t shows that the inequalities ~6! are\nalso fulfilled in some proximity of these limits. Thus for\nsmall t when a.0 the escape time T always decreases with\nincreasing t, while for large t and a,1 a decrease of t\ncauses an increase of T. This assures that a minimum or a\nmaximum appears, respectively. The explanation of such be-\nhavior is very simple: if z(t) vanishes in a given limit then,\nfor a finite value of t, it does exist and causes an effect\nsimilar to that of a nonvanishing noise. When z(t) does not\nvanish, if we do not deal with certain specific forms of U(x)\nand V(x), then the escape time T always increases in the\nregion of small t, and so RA does not appear. On the other\nhand, since in this case a50, IA should be observed. A\nsimilar argument applies to the case of CVN ~a51!. Theexistence of RA is a generic property, while in the large-t\nregion T grows monotonically and IA is absent.\nIII. SYSTEM\nThe utility of the electronic analog technique for model-\ning stochastic dynamics has been demonstrated in many\ncases ~e.g., see the recent review @11#!. However, the prob-\nlem of escape over a fluctuating barrier seems to have been\ninvestigated in this way only in experiments of the Perugia-\nCamerino group @6,5#. The authors considered two kinds of\ncolored noises: DN and OUN, both in two variants: CSN and\nCVN. In our research we do not deal with DN; however, we\nconsider a much wider class of OUN’s. On the other hand\nthe potential V(x) used in @6,5# was a simple parabolic one,\nso it caused a permanent variation of the position of potential\nminima, leading even to the disappearance of the bistable\ncharacter of the total potential. Here we use another form of\nV(x) that avoids these inconsistencies.\nThe circuit used in our experiments has been based on a\nstandard electronic system simulating Langevin equation\nwith a quartic potential,\nU~x !5\n1\n4 x\n42\n1\n2 x\n2\n, ~7!\nwith a maximum at x50 and two minima at 61. The per-\nturbation has the form\nV~x !5 H U~x ! for uxu<10 for uxu.1, ~8!\nso it does not alter the positions of potential extremes and the\nfluctuations affect only the barrier itself.\nThe system was prepared at random in one of the poten-\ntial minima (x561). The time of its first appearance at\nthe top of the barrier t top was then measured. We observed\nalso the value of the colored noise at this moment\nz top[2z(t top), where minus is used for later convenience. At\nleast 2000 jumps from each well were recorded. The sym-\nmetry of the system was checked very carefully, so in fact\nwe dealt with the statistics of at least N54000 events. From\nthe data collected, we calculated the MFPT T and its stan-\ndard deviation DT, as well as the mean value Z of z top and its\nstandard deviation DZ .\nThe control parameter of the problem, the correlation time\nof the OUN, was varied within the interval 1022,t,103.\nThe measurements were repeated for five different relations\nbetween Q and t with a50, 0.25, 0.50, 0.75, and 1.0. The\nother parameters were kept constant: q50.067 and Q0\n50.73. In what follows we use scaled quantities in order to\nensure a simple form ~1! of the Langevin equation with the\npotential ~7!. The time unit of this paper corresponds to 1.02\nms of real time, so the measured value 110 ms of the MFPT\nover an unperturbed barrier gives Ts5107. Finally, the cor-\nrelation times of the noise generators were of the order of a\nfew ms, so effectively we are dealing with white noises.\n1172 PRE 61IWANISZEWSKI, KAUFMAN, McCLINTOCK, AND McKANEIV. EXPERIMENTAL RESULTS\nA. Escape time\nThe results of the experiments, collected for a50, 0.25,\n0.50, 0.75, and 1.0, are summarized in Figs. 1–5, respec\ntively. In the ~a! parts of the figures the MFPT and its stan-\ndard deviation are displayed. In accordance with the theoret-\nFIG. 1. Experimental data measured for an analog electronic\nmodel of Eqs. ~1!, ~3!, ~4!, ~7!, and ~8! vs decimal logarithm of t.\n~a! Relative MFPT T(t)\/Ts and its standard deviation DT(t)\/Ts for\na50.0. For reference the dotted line indicates the relative MFPT for\na static barrier. The values of the other parameters are q50.0674\nand Q050.734. ~b! The mean value Z(t) of the colored noise and\nits standard deviation DZ(t) as measured at the moment of crossing\nthe top of the barrier. For comparison the t dependence of the noise\nstandard deviation, SD5@Q(t)\/t#1\/2, is also displayed ~dotted line!.\nIn all figures the lines that connect the experimental points are\ndrawn to guide the eye, only.\nFIG. 2. The same as Fig. 1 but for a50.25.ical predictions for a.0, the escape time T~t! develops a\nminimum on the small-t side. Only for CSN does T~t! in-\ncrease monotonically in this region. Similarly, for a,1, a\nmaximum exists as expected on the large-t side of the figure;\nbut a monotonic increase characterizes the case with CVN.\nWe notice, however, that the minima are more clearly de-\nfined than the maxima.\nThe position of the minimum tmin depends strongly on a.\nAs a decreases the minimum shifts significantly toward\nsmaller values of t, e.g., tmin for a50.25 is about ten times\nsmaller than for a51. Simultaneously, the minimal values of\nthe MFPT Tmin change only slightly, while the width of the\nminimum increases. These properties of T~t! result simply\nfrom the t dependence of Q. If a.0 the OUN z(t) vanishes\nas t→0 and T(0)5Ts @8#. On the other hand, as a decreases\ncolored noise approaches CSN, which does not disappear in\nFIG. 3. The same as Fig. 1 but for a50.5.\nFIG. 4. The same as Fig. 1 but for a50.75.\nPRE 61 1173RESONANCES WHILE SURMOUNTING A FLUCTUATING . . .this limit, and for which T(0),Ts . Thus the nonmonotonic\ncurve T~t! for a.0 converges to the monotonic one with\na50, which means that tmin shifts toward zero. Since the\nposition of the minimum depends on the rate of variation of\nQ with t and may be located within an infinite ~on a loga-\nrithmic scale! interval, we cannot treat the appearance of a\nminimum of T(0)5Ts as the signature of a resonance be-\ntween the noise z(t) and any characteristic time of the sys-\ntem.\nAlthough the maxima are not so clear as the minima, one\ncan notice a very similar relationship between the value of a\nand the location of a maximum tmax : as a increases tmax\nalso increases. This is a consequence of the vanishing of z(t)\nin the limit t→‘ for a,1, while the CVN with a51 sur-\nvives. Consequently, the existence of a maximum in T~t!\nresults from the specific relation between Q and t and also is\nnot of a resonance nature.\nVery similar features are seen in the graphs of the stan-\ndard deviation of the escape time DT. For given a the\nminima and maxima appear in the same places as for T~t!.\nFurthermore, the maxima are much more distinct here. Com-\nparing the whole curves T~t! and DT~t! one can distinguish\ntwo regions. For t smaller than 10 for any given a the curve\nDT~t! follows T~t! almost exactly. Thus in this region the\nrate concept applies and the escape process can be character-\nized by a decay rate equal to the inverse of T~t! @4#. For\ngreater t, however, DT~t! exceeds T~t!. Since for larger a\nthe noise z(t) vanishes more gradually as t→‘, the larger a\nis, the greater becomes the difference between DT~t! and\nT~t!. This reflects the fact that for large t, especially when it\nis much larger than the MFPT, the potential remains almost\nstatic during any escape attempt and the problem may be\ntreated as an escape over an ensemble of static barriers with\nrandomly distributed heights ~the adiabatic approximation!.\nThe exponential dependence of the escape time on DU\ncauses higher barriers to dominate in the averaged expres-\nsions. Consequently, the MFPT is greater than for the static\nbarrier @8#. Also, DT exceeds T and, if a maximum exists, it\nis better seen for DT~t! than for T~t!.\nFIG. 5. The same as Fig. 1 but for a51.0.B. Position of the barrier\nParts ~b! of Figs. 1–5 show the results of measurements\nof z top , i.e., the value of the colored noise 2z(t) at the\nmoment when the system variable x(t) crosses the top of the\nbarrier. This relates to the configuration of the potential dur-\ning the escape event. In the figures we display its mean value\nZ(t) @12# as well as its standard deviation DZ(t). For com-\nparison, the standard deviation SD5AD of z(t) is also\nshown.\nThe most important observation is that in any case, for\nCSN also, Z(t) exhibits a maximum. It is located in the\nregion between t’0.3 for a50 and t’5 for a51.0, i.e., for\nt;O~1!. These maxima mean that, regardless of the type of\nnoise, for t of the order of unity the system prefers to escape\nwhen the barrier is in its lower position. For smaller or larger\nvalues of t escape events over higher barriers are relatively\nmore probable. The region of t for the occurrence of this\nmaximum is limited so one can ask whether this effect is of\na resonance nature. We will return to this question shortly.\nQuite different is the dependence of DZ on t. For any\nvalue of a it almost equals SD . A small deviation from this\nrule is noticeable only for large t where DZ(t) falls slightly\nbelow SD . Thus, z top is a random variable with the same\nstandard deviation as that of the process z(t), but with a\nnonzero mean Z(t).\nFor CSN the maximum of Z(t) lies under the line SD(t).\nWith increasing a , the maximum moves toward this line,\neventually just crossing it for the CVN case. In order to\nexplain this distribution, note that for t51 ~the maximum\nappears for t of the order of unity! the standard deviation of\nz(t) has the same value AQ0 for any a. Thus if t is slightly\nsmaller the amplitude of the fluctuations for smaller a is\nlarger. In contrast, for t.1 the larger a becomes the larger is\nthe amplitude of the fluctuations.\nThe different rate of increase or decrease of the fluctua-\ntion amplitude with variation of t for different a blurs the\nessence of this effect, however. In order to eliminate it we\nmust consider the relative rather than the absolute height of\nthe lowered barrier. The word ‘‘relative’’ means with respect\nto the actual possibilities, i.e., with respect to the amplitude\nof the barrier fluctuations for a given t. Such an approach\nseems obvious on looking, e.g., at Fig. 1~b!. At t’2, where\nZ(t)’AQ\/t , in order to escape over the barrier the system\nexploits much more the modulation of the barrier caused by\nthe colored noise than it does at t’0.3, where, although the\nmaximum of Z(t) appears, the possibilities are greater @Z(t)\nis only about (1\/2)SD]. In Fig. 6 we display the relative\nmean value of z top defined as follows:\nZ˜ ~t!5Z~t!\/AQ\/t . ~9!\nThe plots for different a differ only slightly. The maxima are\ndistributed within a very small interval, 2–4.6. Their heights\nare almost the same and of the order of unity. The plots are\nshifted slightly toward the right as a increases.\nAfter thus reducing the influence of the t dependence of\nthe SD of the OUN on the barrier fluctuation amplitude, we\nmay suppose that the occurrence of a maximum of Z˜ (t) is of\nresonance origin only. It appears for t of the order of a few\nunits and this is the time scale of relaxation in the system. To\n1174 PRE 61IWANISZEWSKI, KAUFMAN, McCLINTOCK, AND McKANEunderstand this relation, let us recall that for a small noise in\nthe standard ~static! Kramers problem the system fluctuates\nfor a very long time at the bottom of the well, waiting for a\nlarge enough fluctuation of the white noise j(t) to kick it\nover the top of the barrier. Because j(t) is a Gaussian pro-\ncess, the waiting time depends exponentially on the height of\nthe barrier, and hence a lower barrier is greatly to be pre-\nferred. When this large fluctuation ultimately happens, it\nshould persist for a duration at least of the order of the re-\nlaxation time tr of the system @13,11,4,5#, which assures that\nthe system has a long enough time to cross to the other side\nof the barrier. If the barrier rises during this stage, the system\nmay return back to its initial well, thus increasing the waiting\ntime. This explains why, in order to ensure the minimal es-\ncape time, the variation of the barrier, measured by the value\nof the correlation time t, should occur on a time scale longer\nthan tr . However, when t becomes too long, there will also\nbe enough time for a successful escape attempt over higher\nbarrier configurations. This results in an increase of the mean\nheight of the barrier at the moment of escape. Consequently,\nfor t;tr a minimum appears in z(t).\nFollowing this discussion we may explain also the depen-\ndence on a of the plots in Fig. 6: as a decreases the ampli-\ntude of the barrier fluctuations increases, and so lower barri-\ners can appear. This implies that a shorter time, albeit still of\nthe order of tr , will be required to cross to the other side of\nthe barrier. Thus the resonant value of t decreases.\nV. CONCLUSIONS\nIn this paper we have reported the results of our electronic\nanalog experiments on the problem of an escape over a fluc-\ntuating barrier of potential. The potential fluctuation were\nFIG. 6. Relative lowering of the barrier Z˜ (t) @Eq. ~9!# at the\nmoment of crossing over the top of the barrier for a50, 0.25, 0.50,\n0.75, and 1.0. The other parameters as in Fig. 1.caused by a few types of OUN with different relationships\nbetween the two parameters t and Q. We measured the\nMFPT T and its standard deviation DT for the threshold lo-\ncated at the top of the barrier. We also collected the mean\nvalue Z and standard deviation DZ of the value of colored\nnoise z(t) at the moment of crossing the threshold.\nOur main conclusion is that the resonance in the problem\ndoes not relate to the duration of correlation t of the barrier\nnoise and the escape time, as often believed when consider-\ning resonant activation problems. The resonance occurs be-\ntween t and the small part of the escape time during which\nthe system jumps from the region of the potential well to the\nother side of the barrier. Since this time is of the order of the\nrelaxation time of the system tr the resonance condition\nbriefly reads\nt;tr . ~10!\nIn the resonance the system maximally exploits the stochas-\ntic lowering of the barrier by z(t)—an escape event typically\nhappens through a relatively lower barrier.\nThis resonance may give rise to a minimum in T~t!,\nknown as resonant activation. But the resonance identified by\nus occurs also for CSN. In this case T~t! does not hit any\nminimum, implying that there is apparently no resonance for\nthis noise. However, as we have shown, the dependence of\nthe MFPT on t arises because of the dependence on t of two\nfactors: the mean relative height of the barrier Z˜ during the\nescape event, and the standard deviation SD of the barrier\nnoise. For CSN the decrease of SD is stronger than the in-\ncrease of Z˜ and consequently T~t! increases monotonically\nbeyond the resonant region Eq. ~10!.\nIn the region of large t a maximum of T~t! can appear,\nknown as an inhibition of activation @8#. Since the nature of\nthis feature was not clearly identified it was not referred to as\na resonance in @8#. According to the present analysis, and\nexploiting similarities between the two limits of t ~t→0 and\nt→‘! discussed in @8#, we can state that the appearance of\nthis maximum is not, in fact, of a resonance character. We\nhave not identified a corresponding time scale in the system.\nThus the inhibition of activation appears only as a conse-\nquence of the dependence of Q on t.\nWe believe that our findings are general in the sense that\nthey do not depend on a specific definition of the escape\ntime. Here we characterize it by means of the MFPT; we\nnote that other possibilities exist, e.g., the Kramers flux-\nover-population rate @14# or the lowest nonzero eigenvalue\n@15#. Our conviction is especially supported by the very re-\ncent paper of Reimann et al. @16# proving the equivalence of\nthe flux-over-population rate with the inverse of the MFPT.\nACKNOWLEDGMENTS\nThis research was supported by the Engineering and\nPhysical Sciences Research Council under Grants Nos. GR\/\nL69381 and GR\/L38875. J.I. and I.K.K. are very grateful to\nLancaster University for hospitality during their visit, when\nmost of the work was completed.\nPRE 61 1175RESONANCES WHILE SURMOUNTING A FLUCTUATING . . .@1# Ch. R. Doering and J. C. Gadoua, Phys. Rev. Lett. 69, 2318\n~1992!.\n@2# U. Zu¨rcher and Ch. R. Doering, Phys. Rev. E 47, 3862 ~1993!;\nC. Van den Broeck, ibid. 47, 4579 ~1993!; M. Bier and R. D.\nAstumian, Phys. Rev. Lett. 71, 1649 ~1993!; M. Bogun˜a, J. M.\nPorra, J. Masoliver, and K. Lindenberg, Phys. Rev. E 57, 3937\n~1998!.\n@3# P. Reimann, Phys. Rev. Lett. 74, 4576 ~1995!.\n@4# P. Reimann, Phys. Rev. E 52, 1579 ~1995!.\n@5# M. Marchi, F. Marchesoni, L. Gammaitoni, E. Menichella-\nSaetta, and S. Santucci, Phys. Rev. E 54, 3479 ~1996!.\n@6# F. Marchesoni, L. Gammaitoni, E. Menichella-Saetta, and S.\nSantucci, Phys. Lett. A 201, 275 ~1995!.\n@7# P. Reimann, R. Bartussek, and P. Ha¨nggi, Chem. Phys. 235, 11\n~1998!.\n@8# J. Iwaniszewski, Phys. Rev. E 54, 3173 ~1996!.\n@9# P. Reimann, Phys. Rev. E 49, 4938 ~1994!.@10# P. Ha¨nggi, Chem. Phys. 180, 157 ~1994!.\n@11# D. G. Luchinsky, P. V. E. McClintock, and M. I. Dykman,\nRep. Prog. Phys. 61, 889 ~1998!.\n@12# The nonmonotonicities of Z(t) at the high-t end in Figs. 1 and\n2 and at the small-t end in Figs. 4 and 5 must be understood as\nartifacts. The absolute value of Z in these cases is comparable\nwith the accuracy of the measurement, so that the logarithmic\nscale of the ordinate enhances experimental errors in a mis-\nleading way.\n@13# R. S. Maier and D. L. Stein, Phys. Rev. E 48, 931 ~1993!; D.\nG. Luchinsky and P. V. E. McClintock, Nature ~London! 389,\n463 ~1997!.\n@14# P. Reimann and T. C. Elston, Phys. Rev. Lett. 77, 5328 ~1996!.\n@15# P. Pechukas and P. Ha¨nggi, Phys. Rev. Lett. 73, 2772 ~1994!.\n@16# P Reimann, G. J. Schmid, and P. Ha¨nggi, Phys. Rev. E 60, 1\n~1999!.\n"}