{"doi":"10.1093\/bja","coreId":"96248","oai":"oai:eprints.lse.ac.uk:29087","identifiers":["oai:eprints.lse.ac.uk:29087","10.1093\/bja"],"title":"Non-technical skills in the intensive care unit","authors":["Reader, Tom W.","Flin, R","Lauche, K.","Cuthbertson, Brian H."],"enrichments":{"references":[{"id":17250149,"title":"A framework for understanding crew performance asessment issues.","authors":[],"date":"2002","doi":null,"raw":"Baker DP, Dismukes RK. A framework for understanding crew performance asessment issues. Int J Aviat Psychol 2002; 12: 205-22","cites":null},{"id":17250214,"title":"A look into the nature and causes of human errors in the intensive care unit. Crit Care Med","authors":[],"date":"1995","doi":"10.1097\/00003246-199502000-00015","raw":"Donchin Y, Gopher D, Olin M, et al. A look into the nature and causes of human errors in the intensive care unit. Crit Care Med 1995; 23: 294-230","cites":null},{"id":17250148,"title":"A safer place for patients: Learning to improve patient safety. London: National Audit Office,","authors":[],"date":null,"doi":null,"raw":"A safer place for patients: Learning to improve patient safety. London: National Audit Office,","cites":null},{"id":17250250,"title":"Acute decompensation after removing a central line: Practical approaches to increasing safety in the intensive care unit. Ann Intern Med","authors":[],"date":"2004","doi":"10.7326\/0003-4819-140-12-200406150-00013","raw":"Pronovost PJ, Wu AW, Sexton JB. Acute decompensation after removing a central line: Practical approaches to increasing safety in the intensive care unit. Ann Intern Med 2004; 140: 1025-1033","cites":null},{"id":17250238,"title":"Adverse Incident Reporting in Intensive Care. Anaesth Intensive Care","authors":[],"date":"1994","doi":null,"raw":"Hart GK, Baldwin I, Gutteridge G, Ford J. Adverse Incident Reporting in Intensive Care. Anaesth Intensive Care 1994; 22: 556-561","cites":null},{"id":17250248,"title":"al: Developing a Taxonomy of Anaesthetists' Nontechnical Skills (ANTS). Henriks K, ed: Advances in Patient Safety: From Research to Implementation. Washington: Agency for Healthcare Research and Quality:","authors":[],"date":"2005","doi":null,"raw":"Patey R, Flin R, Fletcher G et al: Developing a Taxonomy of Anaesthetists' Nontechnical Skills (ANTS). Henriks K, ed: Advances in Patient Safety: From Research to Implementation. Washington: Agency for Healthcare Research and Quality: 2005; 325-336","cites":null},{"id":17250222,"title":"Anaesthetists' Non-technical Skills (ANTS) System Handbook.","authors":[],"date":"2003","doi":"10.1037\/e576952012-027","raw":"Flin R, Fletcher, G, Glavin R, Maran, N & Patey, R. Anaesthetists' Non-technical Skills (ANTS) System Handbook. University of Aberdeen. 2003; (www.abdn.ac.uk\/iprc\/ants.shtml)","cites":null},{"id":17250216,"title":"Anaesthetists' Non-Technical Skills (ANTS): evaluation of a behavioural marker system.","authors":[],"date":"2003","doi":"10.1037\/e576952012-027","raw":"Fletcher G, Flin R, McGeorge P, Glavin R, Maran N, Patey R. Anaesthetists' Non-Technical Skills (ANTS): evaluation of a behavioural marker system. Br J Anaesth 2003; 90: 580-588 Published as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559.","cites":null},{"id":17250195,"title":"Building a safer NHS for patients – implementing an organisation with a memory. London: Department of Health,","authors":[],"date":"2001","doi":null,"raw":"Building a safer NHS for patients – implementing an organisation with a memory. London: Department of Health, 2001","cites":null},{"id":17250249,"title":"Building safety into ICU care.","authors":[],"date":"2002","doi":"10.1053\/jcrc.2002.34363","raw":"Pronovost  PJ, Wu A, Dorman T, Morlock L. Building safety into ICU care. J Crit Care 2002; 17: 78-85","cites":null},{"id":17250199,"title":"Crew resource management (CRM) training. Guidance for flight crew, CRM instructors (CRMIs) and CRM instructor-examiners (CRMIEs). London: Civil Aviation Authority,","authors":[],"date":"2003","doi":null,"raw":"Crew resource management (CRM) training. Guidance for flight crew, CRM instructors (CRMIs) and CRM instructor-examiners (CRMIEs). London: Civil Aviation Authority, 2003","cites":null},{"id":17250228,"title":"Crew Resource Management: Improving safety in high reliability industries. Team Performance Management","authors":[],"date":"2002","doi":"10.1108\/13527590210433366","raw":"Flin  R,  O'Connor  P,  Mearns  K.  Crew  Resource  Management:  Improving  safety  in  high reliability industries. Team Performance Management 2002; 8: 68-78","cites":null},{"id":17250154,"title":"Critical incident reporting in the intensive care unit. Anaesthesia","authors":[],"date":"1997","doi":"10.1111\/j.1365-2044.1997.094-az0085.x","raw":"Buckley T, Short T, Rowbottom Y, Oh T. Critical incident reporting in the intensive care unit. Anaesthesia 1997; 52: 403-409","cites":null},{"id":17250258,"title":"Critical incidents in the intensive therapy unit. Lancet","authors":[],"date":"1991","doi":"10.1016\/0140-6736(91)91243-n","raw":"Wright D, Mackenzie M, Buchan I, et al. Critical incidents in the intensive therapy unit. Lancet 1991; 14: 676-681","cites":null},{"id":17250225,"title":"Development of the NOTECHS (Non-Technical Skills) system for assessing pilots' CRM skills. Hum Factors and Aero Safety","authors":[],"date":"2003","doi":null,"raw":"Flin R, Martin L, Goeters K et al. Development of the NOTECHS (Non-Technical Skills) system for assessing pilots' CRM skills. Hum Factors and Aero Safety 2003; 3: 95-117","cites":null},{"id":17250256,"title":"Discrepant attitudes about teamwork among critical care nurses and physicians. Crit Care Med","authors":[],"date":"2003","doi":"10.1097\/01.ccm.0000056183.89175.76","raw":"Thomas EJ, Sexton JB, Helmreich RL. Discrepant attitudes about teamwork among critical care nurses and physicians. Crit Care Med 2003; 31:956-959","cites":null},{"id":17250230,"title":"Does critical incident reporting contribute to medication error prevention?","authors":[],"date":"2002","doi":"10.1007\/s00431-002-1055-0","raw":"Frey B, Buettiker V, Hug M et al. Does critical incident reporting contribute to medication error prevention? Eur J Ped 2002; 161: 594-599","cites":null},{"id":17250247,"title":"Emerging paradigms of cognition in medical decisionmaking.","authors":[],"date":"2002","doi":null,"raw":"Patel VL, Kaufman DR, Arocha JF. Emerging paradigms of cognition in medical decisionmaking. J Biomed Inform 2002; 35: 52-75","cites":null},{"id":17250239,"title":"Error and Crew Resource management. In:","authors":[],"date":"2001","doi":"10.1016\/b978-0-12-374946-8.10015-9","raw":"Helmreich RL, Wilhelm JA, Klinect JR, Merritt AC. Culture, Error and Crew Resource management. In: Salas E, Bowers CA, Edens E, eds. Improving Teamwork in Organizations: Applications of resource management training. Hillsdale, NJ: Erlbaum, 2001; 305-334","cites":null},{"id":17250151,"title":"Factors associated with reintubation in Intensive Care. Chest","authors":[],"date":"2001","doi":"10.1378\/chest.120.2.538","raw":"Beckmann U, Gillies DM. Factors associated with reintubation in Intensive Care. Chest 2001; 120: 538-542","cites":null},{"id":17250257,"title":"Helmreich R eds. Cockpit resource management.","authors":[],"date":"1993","doi":null,"raw":"Weiner E, Kanki B, Helmreich R eds. Cockpit resource management. San Diego, Academic Press, 1993","cites":null},{"id":17250232,"title":"Human error in anaesthetic mishaps.","authors":[],"date":"1989","doi":"10.1097\/00004311-198902730-00002","raw":"Gaba D. Human error in anaesthetic mishaps. Int Anesthesiol Clin 1989; 27: 137-147","cites":null},{"id":17250153,"title":"Human errors in a multidisciplinary intensive care unit: a 1-year prospective study. Intensive Care Med","authors":[],"date":"2001","doi":"10.1007\/s001340000751","raw":"Bracco D, Favre J, Bissonnette B, et al. Human errors in a multidisciplinary intensive care unit: a 1-year prospective study. Intensive Care Med 2001; 27: 137-145","cites":null},{"id":17250251,"title":"Human performance and patient safety.","authors":[],"date":"2005","doi":"10.1016\/b978-0-443-06959-8.00006-6","raw":"Rall M, Gaba D. Human performance and patient safety. In: Miller DR, ed. Anesthesia. Sixth ed. Philadephia: Churchill Livingstone, 2005; 3021-3072","cites":null},{"id":17250234,"title":"Iatrogenic complications in adult intensive care units: a prospective two-centre study. Crit Care Med","authors":[],"date":"1993","doi":"10.1097\/00003246-199301000-00011","raw":"Giraud T, Dhainaut J, Vaxelaire J et al. Iatrogenic complications in adult intensive care units: a prospective two-centre study. Crit Care Med 1993; 20: 40-51","cites":null},{"id":17250235,"title":"Identification and characterization of errors and incidents in a medical intensive care unit. Acta Anaesthesiol Scand","authors":[],"date":"2005","doi":"10.1111\/j.1399-6576.2005.00731.x","raw":"Graf J, von den Driesch A, Koch K, Janssens U. Identification and characterization of errors and incidents in a medical intensive care unit. Acta Anaesthesiol Scand 2005; 49: 930-939","cites":null},{"id":17250223,"title":"Identifying and training non-technical skills for teams in acute medicine. Qual Saf Health Care","authors":[],"date":"2004","doi":"10.1136\/qhc.13.suppl_1.i80","raw":"Flin R, Maran N. Identifying and training non-technical skills for teams in acute medicine. Qual Saf Health Care 2004; 13: 80-84","cites":null},{"id":17250152,"title":"Incidents relating to the intra-hospital transfer of critically ill patients. Intensive Care Med","authors":[],"date":"2004","doi":"10.1007\/s00134-004-2177-9","raw":"Beckmann U, Gillies DM, Berenholtz SM, Wu AW, Pronovost P. Incidents relating to the intra-hospital transfer of critically ill patients. Intensive Care Med 2004; 30: 1579-1585","cites":null},{"id":17250276,"title":"Non-technical skills for surgeons: A review of the literature. Surgery","authors":[],"date":"2005","doi":"10.1016\/j.surg.2005.06.017","raw":"Yule S, Flin R, Paterson-Brown S, Maran, N. Non-technical skills for surgeons: A review of the literature. Surgery 2005, in press Published as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559.","cites":null},{"id":17250274,"title":"Non-technical skills: repeated simulation exposure. Anaesthesia","authors":[],"date":"2005","doi":"10.1007\/bf03023171","raw":"Yee B, Naik V, Joo H et al. Non-technical skills: repeated simulation exposure. Anaesthesia 2005, 103: 241-248","cites":null},{"id":17250272,"title":"Objective measures of situation awareness in a simulated medical environment. Qual Saf Health Care","authors":[],"date":"2004","doi":null,"raw":"Wright MC, Taekman JM, Endsley M. Objective measures of situation awareness in a simulated medical environment. Qual Saf Health Care 2004; 13: 65-71","cites":null},{"id":17250252,"title":"Patient simulators.","authors":[],"date":"2005","doi":"10.1016\/b978-0-443-06959-8.00007-8","raw":"Rall M, Gaba D. Patient simulators. In: Miller DR, ed. Anesthesia. Sixth ed. Philadelphia: Churchill Livingstone, 2005; 3073-3103","cites":null},{"id":17250218,"title":"Rating non-technical skills: developing a behavioural marker system for use in anaesthesia. Cogn Tech Work","authors":[],"date":"2004","doi":"10.1007\/s10111-004-0158-y","raw":"Fletcher G, Flin R, McGeorge P, Glavin R, Maran N, Patey R. Rating non-technical skills: developing a behavioural marker system for use in anaesthesia. Cogn Tech Work 2004; 6: 165-171","cites":null},{"id":17250241,"title":"Some guidelines for conducting a cognitive task analysis.","authors":[],"date":"2000","doi":null,"raw":"Klein G, Mititello L. Some guidelines for conducting a cognitive task analysis. In Salas E, ed. Advances in Human Performance and cognitive engineering research. New York, JAI Press, 2000; 163-197","cites":null},{"id":17250254,"title":"stress and teamwork in medicine and aviation: cross sectional surveys. BMJ","authors":[],"date":"2000","doi":"10.1136\/bmj.320.7237.745","raw":"Sexton JB, Thomas EJ, Helmreich RL. Error, stress and teamwork in medicine and aviation: cross sectional surveys. BMJ 2000; 320: 745-749","cites":null},{"id":17250150,"title":"The Australian Incident Monitoring Study in Intensive Care: AIMS-ICU. An analysis of the first year of reporting. Anaesth Intensive Care","authors":[],"date":"1996","doi":null,"raw":"Beckmann U, Baldwin I, Hart GK, Runciman WB. The Australian Incident Monitoring Study in Intensive Care: AIMS-ICU. An analysis of the first year of reporting. Anaesth Intensive Care 1996; 24: 320-329 4  Beckmann U, Bohringer C, Carless R et al. Evaluation of two methods for quality improvement in intensive care: facilitated incident monitoring and retrospective medical chart review. Crit Care Med 2003; 31: 1277-1288","cites":null},{"id":17250253,"title":"The Critical Care Safety Study: The incident and nature of adverse events and serious medical errors in intensive care. Crit Care Med","authors":[],"date":"2005","doi":"10.1097\/01.ccm.0000171609.91035.bd","raw":"Rothschild JM, Landrigan CP, Cronin JW et al. The Critical Care Safety Study: The incident and nature of adverse events and serious medical errors in intensive care. Crit Care Med 2005; 33: 1694-1700","cites":null},{"id":17250243,"title":"The human factor: the critical importance of effective teamwork and communication in providing safe care. Qual Saf Health Care","authors":[],"date":"2004","doi":"10.1136\/qhc.13.suppl_1.i85","raw":"Leonard M, Graham S, Bonacum D. The human factor: the critical importance of effective teamwork and communication in providing safe care. Qual Saf Health Care 2004; 13: 85-90 Published as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559.","cites":null},{"id":17250246,"title":"The nature of constraints on collaborative decision making in health care settings.","authors":[],"date":"2001","doi":null,"raw":"Patel VL, Arocha JF. The nature of constraints on collaborative decision making in health care settings. In Salas E, Klein G eds. Linking Expertise and Naturalistic Decision Making. New Jersey, LEA, 2001; 383-405","cites":null},{"id":17250255,"title":"The performance of intensive care units: Does good management make a difference? Med Care","authors":[],"date":"1994","doi":"10.1097\/00005650-199405000-00009","raw":"Shortell SM, Zimmerman JE, Rousseau DM et al. The performance of intensive care units: Does good management make a difference? Med Care 1994; 32: 508-525 Published as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559.","cites":null},{"id":17250220,"title":"The role of non-technical skills in anaesthesia: a review of current literature.","authors":[],"date":"2002","doi":"10.1007\/s10111-004-0158-y","raw":"Fletcher G, McGeorge P, Flin R, Glavin RJ, Maran NJ. The role of non-technical skills in anaesthesia: a review of current literature. Br J Anaesth 2002; 88: 418-429","cites":null},{"id":17250245,"title":"Use of a fully simulated intensive care unit environment for critical event management training for internal medicine residents. Crit Care Med","authors":[],"date":"2003","doi":"10.1097\/01.ccm.0000089645.94121.42","raw":"Lighthall GK, Barr J, Howard SK et al. Use of a fully simulated intensive care unit environment for critical event management training for internal medicine residents. Crit Care Med 2003; 31: 2437-2443","cites":null},{"id":17250197,"title":"Using a prediction paradigm to compare levels of expertise and decision making among critical care nurses.","authors":[],"date":"2005","doi":null,"raw":"Cesna M, Mosier K: Using a prediction paradigm to compare levels of expertise and decision making among critical care nurses. In Montgomery H, Lipshitz R, Brehmer B, eds. How Professionals Make Decisions. Mahwah, NJ: LEA, 2005; 107-118","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-05","abstract":"In high-risk industries such as aviation, the skills not related directly to technical expertise, but crucial for maintaining safety (e.g. teamwork), have been categorized as non-technical skills. Recently, research in anaesthesia has identified and developed a taxonomy of the non-technical skills requisite for safety in the operating theatre. Although many of the principles related to performance and safety within anaesthesia are relevant to the intensive care unit (ICU), relatively little research has been done to identify the non-technical skills required for safe practice within the ICU. This review focused upon critical incident studies in the ICU, in order to examine whether the contributory factors identified as underlying the critical incidents, were associated with the skill categories (e.g. task management, teamwork, situation awareness and decision making) outlined in the Anaesthetists' Non-technical Skills (ANTS) taxonomy. We found that a large proportion of the contributory factors underlying critical incidents could be attributed to a non-technical skill category outlined in the ANTS taxonomy. This is informative both for future critical incident reporting, and also as an indication that the ANTS taxonomy may provide a good starting point for the development of a non-technical skills taxonomy for intensive care. However, the ICU presents a range of unique challenges to practitioners working within it. It is therefore necessary to conduct further non-technical skills research, using human factors techniques such as root-cause analyses, observation of behaviour, attitudinal surveys, studies of cognition, and structured interviews to develop a better understanding of the non-technical skills important for safety within the ICU. Examples of such research highlight the utility of these techniques","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96248.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29087\/1\/Non-technical_skills_in_the_Intensive_Care_Unit_%28LSERO%29.pdf","pdfHashValue":"a082bd5545ed201cf62f376b43fc1924e4bd9535","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29087<\/identifier><datestamp>\n      2016-06-20T11:17:58Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29087\/<\/dc:relation><dc:title>\n        Non-technical skills in the intensive care unit<\/dc:title><dc:creator>\n        Reader, Tom W.<\/dc:creator><dc:creator>\n        Flin, R<\/dc:creator><dc:creator>\n        Lauche, K.<\/dc:creator><dc:creator>\n        Cuthbertson, Brian H.<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        In high-risk industries such as aviation, the skills not related directly to technical expertise, but crucial for maintaining safety (e.g. teamwork), have been categorized as non-technical skills. Recently, research in anaesthesia has identified and developed a taxonomy of the non-technical skills requisite for safety in the operating theatre. Although many of the principles related to performance and safety within anaesthesia are relevant to the intensive care unit (ICU), relatively little research has been done to identify the non-technical skills required for safe practice within the ICU. This review focused upon critical incident studies in the ICU, in order to examine whether the contributory factors identified as underlying the critical incidents, were associated with the skill categories (e.g. task management, teamwork, situation awareness and decision making) outlined in the Anaesthetists' Non-technical Skills (ANTS) taxonomy. We found that a large proportion of the contributory factors underlying critical incidents could be attributed to a non-technical skill category outlined in the ANTS taxonomy. This is informative both for future critical incident reporting, and also as an indication that the ANTS taxonomy may provide a good starting point for the development of a non-technical skills taxonomy for intensive care. However, the ICU presents a range of unique challenges to practitioners working within it. It is therefore necessary to conduct further non-technical skills research, using human factors techniques such as root-cause analyses, observation of behaviour, attitudinal surveys, studies of cognition, and structured interviews to develop a better understanding of the non-technical skills important for safety within the ICU. Examples of such research highlight the utility of these techniques.<\/dc:description><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:date>\n        2006-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29087\/1\/Non-technical_skills_in_the_Intensive_Care_Unit_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Reader, Tom W. and Flin, R and Lauche, K. and Cuthbertson, Brian H.  (2006) Non-technical skills in the intensive care unit.  British Journal of Anaesthesia, 96 (5).  pp. 551-559.  ISSN 0007-0912     <\/dc:identifier><dc:relation>\n        http:\/\/bja.oxfordjournals.org\/<\/dc:relation><dc:relation>\n        10.1093\/bja\/ael067<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29087\/","http:\/\/bja.oxfordjournals.org\/","10.1093\/bja\/ael067"],"year":2006,"topics":["R Medicine (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nTom W. Reader, Rhona Flin, K. Lauche and Brian H. \nCuthbertson  \nNon-technical skills in the intensive care \nunit \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nReader, Tom W. and Flin, R and Lauche, K. and Cuthbertson, Brian H. (2006) Non-technical skills \nin the intensive care unit. British journal of anaesthesia, 96 (5). pp. 551-559.  \n \nDOI: 10.1093\/bja\/ael067\n \n© 2007 Lippincott Williams & Wilkins, Inc. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29087\/\n \nAvailable in LSE Research Online: March 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any article(s) \nin LSE Research Online to facilitate their private study or for non-commercial research. You may \nnot engage in further distribution of the material or use it for any profit-making activities or any \ncommercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE Research \nOnline website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, incorporating \nany revisions agreed during the peer review process.  Some differences between this version and \nthe published version may remain.  You are advised to consult the publisher’s version if you wish \nto cite from it. \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n1 \nNon-Technical Skills in the Intensive Care Unit \n \n \nTom W Reader PhD*, Rhona Flin PhD*, Kristina Lauche PhD*, Brian H Cuthbertson** MD FRCA,  \n*School of Psychology, University of Aberdeen, Kings College, Aberdeen, Scotland, UK, AB24 2UB \n**Health Services Research Unit, University of Aberdeen and Intensive Care Unit, Aberdeen Royal \nInfirmary, Foresterhill, Aberdeen, Scotland, UK, AB25 2ZD. \nShort title: Non-technical skills in the ICU \nName of institution where worked performed: University of Aberdeen, Aberdeen Scotland, UK.  \nAddress for correspondence: Dr Tom Reader, School of Psychology, University of Aberdeen, King’s \nCollege, Aberdeen, Scotland, UK, AB24 2UB \nPhone +44 1224 273212; Fax +44 1224 273211; E-mail tom.reader@abdn.ac.uk  \nFinancial support: This work was supported by a PhD studentship from the College of Life Sciences \nand Medicine (University of Aberdeen) and the Scottish Funding Council. \nReprints: Will not be offered. \nConflicts of interest: None.  \nFinancial interests: None of the authors have any financial interests relating to this work. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nKeywords:  \nintensive care unit; critical incidents; non-technical skills; \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n2 \nSummary \n \nIn high-risk industries such as aviation, the skills not directly related to technical \nexpertise, but crucial for maintaining safety (e.g. teamwork), have been categorised as \nnon-technical skills. Recently, research in anaesthesia has identified and developed a \ntaxonomy of the non-technical skills requisite for safety in the operating theatre. \nAlthough many of the principles related to performance and safety within anaesthesia \nare relevant to the ICU, relatively little research has been done to identify the non-\ntechnical skills required for safe practice within the intensive care unit. This review \nfocuses on ICU critical incident studies in order to examine whether the contributory \nfactors identified as underlying critical incidents are associated with the skill \ncategories (e.g. task management, teamwork, situation awareness and decision \nmaking) outlined in the Anaesthetists’ Non-technical Skills (ANTS) taxonomy. The \nreview found that a large proportion of the contributory factors underlying critical \nincident can be attributed to a non-technical skill category outlined in the ANTS \ntaxonomy. This is informative both for future critical incident reporting, and also as \nan indication that the ANTS taxonomy may provide a good starting point for the \ndevelopment of a non-technical skills taxonomy for intensive care. However, the ICU \npresents a range of unique challenges to the practitioners working within it. It is \ntherefore necessary to conduct further non-technical skills research, using human \nfactors techniques such as root-cause analyses, observations of behaviour, attitudinal \nsurveys, studies of cognition, and structured interviews to better understand the non-\ntechnical skills important for safety within the ICU. Examples of such research \nhighlight the utility of these techniques.  \n \n \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n3 \nThe Department of Health’s report on patient safety has encouraged healthcare \nproviders in areas such as anaesthesia and intensive care medicine to emulate high-\nrisk industries, for example aviation and nuclear power, in the application of human \nfactors research to enhance safety 9. In aviation, pilots’ skills not directly related to \ntechnical expertise, but crucial for maintaining safety are called non-technical skills, \nand include interpersonal skills such as communication, teamwork and leadership, and \ncognitive skills such as task management, situation awareness and decision-making 2, \n16\n. Within the nuclear power and aviation industries, the specific non-technical skills \nimportant for protecting against errors have been empirically identified and trained \nthrough Crew Resource Management courses 41. During the last 20 years, the \nimportance of non-technical skills for delivering safe and high-quality medical care \nhas been increasingly recognised, if not explicitly addressed in medical training 31.  \nMore recently, research has begun to identify the specific non-technical skills \nimportant for safety in medical domains such as Anaesthesia and Surgery 15, 21, 25, 45. \nEach working environment has its own unique non-technical requirements. Although \nthe principal skill categories may be generic and relatively transferable across \ndomains 19, the component behaviours that demonstrate proficiency in those skills \nwithin a particular environment (e.g. the operating room) will be specific to the needs \nand characteristics of a domain 27, 31. Rall and Gaba 34 have pointed out that many of \nthe principles related to performance and safety within anaesthesia are also pertinent \nto the ICU. The current article reflects on the relevance to the intensive care \nenvironment of the non-technical skills identified as being important for anaesthetists \nin the operating theatre.  \n \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n4 \n \nThe Anaesthetists’ Non-Technical Skills (ANTS) behavioural marker system  \nWithin anaesthesia, a taxonomy of the non-technical skills important for safety in the \noperating theatre, called the Anaesthetists' Non-Technical Skills (ANTS) behavioural \nmarker system, has been produced. This was developed from an analysis of data from \ncritical incident reporting systems, attitudinal surveys, theoretical models, \nobservations and the judgements of consultant anaesthetists 13, 35. The ANTS \ntaxonomy has 15 skill elements in four categories with observable examples of good \nand poor behaviours that demonstrate non-technical skill proficiencies or deficits (See \nFigure 1). This can be used to structure non-technical skills training for anaesthetists \n17\n, and the ANTS behavioural rating form can be used to assess anaesthetists’ non-\ntechnical skills in theatre or in the simulator. For example, Yee et al 44 have shown, \nusing the ANTS rating system in Canada, that taking part in anaesthesia crisis \nmanagement courses results in an improvement in the non-technical skills of \nanaesthesia residents. While many anaesthetists are involved in intensive care \nmedicine, the ANTS system was specifically designed to represent their non-technical \nskills in an operating theatre environment. To date, relatively little research has \nfocussed upon identifying the non-technical skills important for protecting against \nhuman error in the ICU. However, studies examining human performance in the ICU \nhave indicated the importance of non-technical skills such as teamwork and \ncommunication for safety and effective functioning 12, 22, 39.  \n \nWithin the intensive care literature there exist a number of data sources identifying \ncommon causal factors underlying critical incidents in the ICU. Frey et al 20 highlight \nthe fact that ICU critical incident reporting systems provide a source of information \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n5 \nthat can be used for quality improvement. However, a recent patient safety report 1 \npoints out that although lessons are learnt at a local level from UK incident \nmonitoring systems, these improvements do not tend to be shared more widely. By \nusing critical incident reporting data to identify behaviours that are commonly found \nto contribute to a critical incident, some insight can be gained into the non-technical \nskills important for safety in the ICU. The current article provides a summary of the \nnon-technical skill factors commonly associated with critical incidents in published \nICU studies. The emerging factors were compared to the non-technical skills \ncategories and elements identified by the ANTS behavioural marker system to see if \nthis provided a suitable fit. As the principles related to performance and safety within \nanaesthesia and the ICU are similar, the generic skill categories (e.g. teamwork) \nidentified as being important for anaesthesia may also be important for the ICU, even \nthough the setting and work tasks are different.  \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n6 \nMethod \nThe identification of research articles involved a comprehensive search of the \nMedline, Biomed Central and Web of Knowledge Psychology databases for English \nlanguage papers related to critical incidents and errors in the intensive care unit (see \nfigure 2 for a flow diagram of the review methodology). Search terms were: Intensive \ncare \/ non-technical skills \/ ICU \/ critical incidents \/ errors \/ adverse events. The \nsearch was limited to article titles and abstracts. Articles initially found (n=754) were \nscrutinised for possible inclusion through the relevance of their titles, and then \nabstracts. This left a total of 24 possible articles. The remaining articles were then \nfiltered for inclusion if they met the criteria of: i) using data collected exclusively in \nthe ICU; and ii) allowing for contributory factors referring to non-technical skills (as \nspecified by the ANTS taxonomy) to be documented in the analysis of critical \nincidents. A total of 11 articles met these criteria, and were then analysed using the \nANTS taxonomy 13. The ANTS behavioural marker system identifies four core \ncategories of non-technical skills (see figure 2), each comprised of several elements, \nand for each element, exemplar component behaviours relevant to actual practice in \nanaesthesia 13, 14, 16. The four core non-technical skill categories include: \nTask Management: ‘Managing resources and organising tasks to achieve goals…’ \nTeam Working: ‘Skills for working in a group context, in any role, to ensure \njoint task completion and team satisfaction…’ \nSituation Awareness: ‘Developing and maintaining an overall dynamic awareness of \nthe situation based on perceiving the elements in the \nenvironment… understanding what they mean and thinking \nahead…’ \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n7 \nDecision Making: ‘Making decisions to reach a judgement or diagnosis about a \nsituation, or to select a course of action, based on experience or \nnew information…’ \n \nEach article was reviewed in order to identify the contributing factors underlying \nincidents that were associated with non-technical skills. This was done by examining \nthe individual contributing factors identified in each article, and then assessing \nwhether they could be clearly identified as belonging to a particular non-technical \nskill category, as outlined in the Anaesthetists’ Non-Technical Skills (ANTS) \nhandbook 16. Each contributory factor was classified according to the overall skill \ncategory to which it was found to refer. For example, contributory factors such as \n‘inadequate assistance’ would be classified as being indicative of teamwork skills, \n‘distraction or inattention’ would be classified as indicative of situation awareness \nskills, ‘errors of judgement’ as decision making skills, and ‘failure to check \nequipment’ as task management skills. If suitable numerical data were included in the \narticle, the total number of contributory factors associated with non-technical skills \nwas calculated, as was the proportion that each individual factor contributed (see table \n1). Furthermore, for all of the studies reviewed, the proportion of contributory factors \nthat each of the four non-technical skill categories accounted for was calculated. To \navoid a bias towards studies reporting large numbers of contributory factors, \npercentage data was used instead of raw data. This involved a 2-stage process; where \nfor each study the total percentage of non-technical skill contributory factors that each \nskill category accounted for was calculated. These percentages were then aggregated, \nwith the mean percentage of contributory factors identified as belonging to each non-\ntechnical skill category being shown in figure 3. Lastly, the percentage of contributory \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n8 \nfactors, out of all possible contributory factors, associated with non-technical skills \nwas calculated (49%). The non-technical skill classification process was conducted by \nthree applied psychologists familiar with the non-technical skills literature. The \ncontributory factors underlying incidents were independently classified in terms of the \nnon-technical skills outlined in the ANTS handbook. For all of the factors in Table 1, \nthere was a 91% level agreement by at least 2 assessors for the underlying ANTS \ncategory, and 71% agreement by all 3 assessors. For factors where there was no initial \nagreement, the assessors collaboratively referred to the ANTS handbook in order to \nreach a final agreement on the underlying ANTS category. It is notable that the \ncontributory factors documented in the critical incident studies do not document one \nsingle practitioner role in the ICU (i.e. the role of both nurses and doctors are \nconsidered), and thus at this stage, the analysis is not role specific. Furthermore, each \nfactor does not refer to one incident, and thus a combination of factors may be \nunderlying any single critical incident.  \n \nResults and Discussion \nIt can be seen from table 1 that a wide range of contributory factors associated with \ncritical incidents can be accounted for by the non-technical skill categories outlined in \nthe ANTS taxonomy. Overall, out of 2677 incidents and 5610 total contributory \nfactors, 50% can be attributed to some form of non-technical skill deficit. These \nfigures do not include the Hart et al 24 study as it does not provide numerical data on \nthe contributory factors underlying incidents. Across all of the studies, Task \nManagement was found to account for the greatest proportion of non-technical skill \ncontributory factors (figure 3). The second greatest was Situation Awareness, the third \ngreatest was Team Working, and the fourth greatest was Decision Making. However, \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n9 \nthis breakdown is entirely constrained by the type of data the reviewed critical \nincident studies were designed to capture. For example, critical incident studies tend \nto vary in the different categories and types of data they collect, with some studies \ncollecting very minimal non-technical skills related data. This may explain the high \nproportion of incidents associated with task management, as critical incidents studies \ntend to show a bias for capturing technical contributory factors related to task \nmanagement skills, e.g. checking equipment, following protocols, inadequate \npreparation of patients. However, less provision may exist for capturing contributory \nfactors associated with non-technical skills such as decision-making, e.g. failing to \nconsider options, not asking others for suggestions, or being unwilling to revise \ncourses of action in the light of new information.  \n \nA further limitation of critical incident studies is that they lack a fine-grained analysis \nof the non-technical factors underlying incidents. In the current review, although \ncontributory factors such as ‘errors of judgment’ and ‘failure to follow protocol’ may \nshow face validity with skills such as ‘decision making’ and ‘task management’, the \nprecise details underlying those factors cannot be ascertained. For example ‘errors of \njudgment’ may arise due to deficiencies in recognizing and understanding information \n(i.e. situation awareness), ‘and failure to follow protocol’ might arise due to a lack of \nsupervision (i.e. teamwork\/leadership). Also, a considerable number of contributory \nfactors identified in the study were not possible to classify due to the underlying non-\ntechnical skill not being obviously apparent. For example, factors such as ‘insufficient \nstaff’ might be associated with task management, or may be more indicative of \nstaffing policies.  Lastly, it can be seen that although the Hart et al. 24 study does not \ninclude numerical data, it does provide some supporting evidence for the relevance to \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n10 \nthe ICU of the non-technical skills described in the ANTS taxonomy, as well as \nhighlighting the utility of including numerical data when analysing accident \ncausation.   \n \nDespite the above issues, the current review does demonstrate that even though a \nvariety of different contributory factors are captured by ICU critical incident studies, a \nlarge proportion of these can be attributed to the non-technical skill categories \noutlined in the ANTS taxonomy. This is both informative for the future development \nand use of data from critical incident reporting systems, as well as being indicative \nthat the ANTS taxonomy may provide a good starting point for the development of a \nnon-technical skills taxonomy for intensive care. However, it is also apparent that \nfurther research, using a range of techniques, is required for better identifying the \nnon-technical skills necessary for maintaining safety in the ICU.  The ANTS system \nused several techniques to collect data regarding practice in anaesthesia in order to \ngenerate a non-technical skills taxonomy tailored for the anaesthetists’ role in the \noperating room 14. \n \nThe techniques for gathering the basic skill set can include root-cause analyses, \nobservations of behaviours in real-time and simulated environments, attitudinal \nsurveys, studies of cognition, and structured interviews 2, 15, 26, 36. Each technique \nprovides different forms of data. For example, root-cause analysis describes in detail \nthe precise factors underlying critical incidents but can be limited to a specific \nscenario or procedure as well as the analysis procedure used to assess the incident. \nObservational approaches record behaviour as it occurs in a variety of conditions, for \nexample during an emergency procedure, although it is difficult in real-life studies for \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n11 \nobservers to capture all the events that occur within an environment, furthermore \nthere is the potential for participant behaviours to be altered by the presence of a \nresearcher. Attitudinal surveys highlight opinions on the importance of skills such as \nteamwork, and are informative about the social and organizational factors that affect \nperceptions of error and rule compliance, through generally do not provide specific \ninformation about the non-technical skills underlying good performance. Studies of \ncognition use experimental methods to model and understand the factors that affect \ncognitive processes (e.g. decision-making) within a particular environment, but are \nalso susceptible to participant behaviours being altered by the experimental paradigm, \ne.g. the use of a low fidelity simulator. Structured interviews utilize the knowledge \nand experience of domain experts in ascertaining the non-technical skills required for \ncoping with emergency and routine situations, although perceptions of confidentiality, \nand the relationship between the interviewer and interviewee, can affect the data \nobtained. \n \nThe techniques described above could provide a rich source of non-technical skills \ninformation for the ICU, as well as providing useful examples for developing training \nmaterials.  Although research focussing on non-technical skills in the ICU is still very \nmuch in its infancy, there are examples of research within both the critical care and \npsychology literatures that have used the human factors techniques described above. \nExamples of such studies were found during the earlier literature search, and whilst \nnot containing suitable data for inclusion in the critical incident review, are potentially \ninformative and are therefore discussed below. Included in the following four sections \nare examples of human factors research using root-cause analysis, observational \nstudies, studies of cognition, and attitudinal surveys, that have been found to yield \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n12 \ninformation regarding the non-technical skills required for safe practice in the ICU. \nAlthough the findings of such research does not explicitly describe in detail the non-\ntechnical skills required for the intensive care environment, and are insufficient for \ndeveloping a taxonomy of non-technical skills in the ICU, they do provide \ninformative data with respect to validating and describing the relevance to the ICU of \nthe non-technical skill categories outlined in the ANTS taxonomy. \n \nRoot-cause analysis of ICU adverse events \nRoot cause analysis identifies the fundamental causes of more serious critical \nincidents, and distinguishes the technical and non-technical contributory factors that \noriginated from both the local and organisational environment. In particular, root-\ncause analyses of adverse events in US ICUs published by Pronovost and colleagues \n32, 33\n underlined the importance of the non-technical skill category of team working, \nand specifically communication processes that support good team working, in the \nprevention of incidents. For example, in a case where a patient suffering hospital-\nacquired pneumonia was accidentally given an undiluted medication 32, a lack of \ncommunication and understanding between an ICU doctor and trainee nurse for the \nmedication handover procedure was identified as one of the main contributory factors. \nIn another case, where a patient being treated for heart and renal failures suffered an \nair embolism after a large central venous catheter was removed whilst the patient was \nsitting up 33, one of the main contributory factors identified as underlying the incident \nwas the reluctance of a nurse, who recognised that the catheter removal was being \ndone incorrectly, to speak up and correct the trainee doctor conducting the procedure. \nThus, root-cause analyses can provide non-technical skills information relating to \nboth a particular situation, such as a lack of shared understanding for team member \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n13 \nroles in a specific procedure, or a more general aspect of teamwork, such as the need \nfor open communication between doctors and nurses.  \n \nObservational studies of ICU teams in real-life and simulators \nNon-technical skill competencies in the ICU can be further investigated through \nobservational studies, which involves either observations of real-life environments, or \nof videotaped ICU scenarios that take place in medical simulators. Lighthall et al 28 \nobserved the performance of ICU staff on a training course which realistically \nsimulates the intensive care environment and presents cases which challenge both \nmedical and non-technical skills. Their analysis identified commonly occurring types \nof errors relating to the non-technical skill categories of situation awareness, decision \nmaking, teamwork and task management, and their specific impact upon the provision \nof care. Vigilance and fixation errors such as failing to recognise changes on \nmonitors, not responding to ventilator alarms, and failing to periodically check patient \nstatus whilst placing a line, resulted in unrecognised deteriorations in the simulated \npatient condition. Judgement errors such as placing a catheter in a deteriorating \npatient, and being complacent with abnormal vital signs, resulted in inappropriate \ndelays of therapy and clinical deterioration. Communication and task management \nerrors such as failing to communicate priorities, overloading nurses with requests, and \nnot following up inquiries on lab results resulted in insignificant tasks being done \ninstead of key tasks, tasks not being done in a timely manner, and forgotten requests \nnot being identified.  \n \nA real-life observational study conducted by Donchin and colleagues 12 has also \nunderlined the importance of detailing team competencies required for safe practice in \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n14 \nthe ICU. The study investigated the nature and causes of errors in an Israeli ICU \ncollected data over a period of 4 months, and involved observers noting all activities, \ninteractions and errors that occurred around patient bedsides. Out of the 8178 \nactivities recorded, approximately 1% were erroneous, with doctors being found to \ncommit around half of all errors despite being involved in just 4.7% of activities. In \nparticular, team working problems were highlighted as being an important factor in \nthe occurrence of errors, with verbal communication between nurses and doctors \nbeing reported in 37% of errors, despite being observed in only 2% of activities. \nDonchin and colleagues hypothesized that this may have occurred due to informal \ncommunication exchanges, and misunderstandings and misperceptions during \ncommunication. Therefore, observational studies in real-life and simulators can \nassociate certain non-technical skills (e.g. team working) with measurable outcomes \n(e.g. errors), as well as understanding the causes and environments in which \nbehaviours and errors occur. \n \nAttitudes towards non-technical skills in the ICU \nAttitudinal studies in the ICU have also focussed upon non-technical skills, with \nsurveys in the US examining the attitudes of ICU staff with respect to teamwork and \nerror. These studies have shown that the majority of both nurses and doctors feel that \njunior team members should be able to question senior members, and that decision-\nmaking should include more team member input 38. However, it has also been found \nthat more nurses than doctors report finding it difficult to speak-up in the ICU, and \nthat fewer nurses than doctors report feeling that their input about patient care is well \nreceived, that disagreements in the ICU are properly resolved, and that teamwork \nbetween nurses and doctors is well coordinated 40. Furthermore, whilst the majority of \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n15 \nICU staff acknowledge the importance of medical errors, they also report having \ndifficulty in openly discussing mistakes due to factors such as the expectations of \nother staff members and negative personal implications 38. Thus, attitudinal studies \ncan be useful in that they highlight the fact that a number of organisational factors \nmay influence the use of non-technical skills such as teamworking in the ICU. For \nexample a lack of perceived communication openness between nurses and doctors \nmay make nurses reticent to become involved in patient care decisions, and the \nnegative personal implications associated with discussing errors may result in the root \ncauses behind errors not being identified and addressed.  \n \nStudies of cognition in the ICU \nStudies of cognition in the intensive care unit have described the processes underlying \ndecision making by ICU staff during their provision of care to patients. Decision-\nmaking is a non-technical skill that has been researched by a number of psychologists, \nwith studies examining whether expert decision-making in the ICU relies on similar \ncognitive processes to other complex work domains. Patel and Arocha 29 have studied \ndecision-making processes by consultants in US surgical and medical ICUs, where \ncaregivers face different problems. An analysis of audiotape transcripts from the \nmorning rounds revealed that in the medical ICU (where it is necessary to diagnose \npatient conditions and then make treatment decisions) there was a tendency for \ndecisions to be made using ‘backwards driven reasoning’. This involved developing a \nhypothesis about a situation and then testing and refining it against the available data \nbefore coming to a solution. By contrast, in the surgical ICU (where patients were \nrecovering from a surgical procedure, and thus their diagnosis was better understood), \ndecisions were found to be made through ‘forwards driven reasoning’. This involved \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n16 \nfirst gathering information about a situation and then recognising the solution from \nthe perceived data. Likewise, Cesna and Mosier asked nurses how they would react to \nan emergency situation in the ICU 10. Expert nurses tended to immediately recognise \nthe best solution for the situation. In contrast, less experienced nurses were shown to \nhave a tendency to generate several options, with the best option not being generated \nfirst. In both studies, decision making was found to be consistent with recognition \nprimed decision-making 30, a form of naturalistic decision making where an expert \nrelies on their experience and knowledge to ‘pattern match’ or recognise a situation, \nand then recall a viable course of action without having to consider all the \nalternatives.  \n \nStudies of cognition can be highly useful for understanding the processes underlying \nnon-technical skills such as decision making, and whilst not providing a direct \nrelationship between non-technical skills and safety, insight can be gained with \nregards to training and enhancing non-technical skills. For example, as expert \ndecision makers are found to focus their attention on identifying situational features \nrather than choosing between options, training could focus on situation awareness \nskills such as altering scanning behaviours in accordance with patient conditions, and \nimproving communication and cross-checking amongst team members so that \ninformation necessary for decision-making is shared immediately. Alternatively, less \nexperienced decision makers could be trained to develop the mental models and \npatterns they require for recognising situations and associated solutions 43.  \n \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n17 \nConclusion  \nThe current review of contributory factors underlying critical incidents demonstrates \nan overlap between the non-technical skills requirements of the ICU and anaesthesia, \nwith both domains having a need for good teamwork, situation awareness, task \nmanagement and decision-making skills. This is consistent with other high-risk \ndomains, such as aviation, where non-technical skill competencies for the same skills \nare recognised as being crucial for safe practice, and are taught through tailored \ntraining packages. Furthermore, to teach and reliably assess non-technical skills \nwithin a particular domain it is necessary to identify the component behaviours that \ndemonstrate proficiencies of these skills within the domain 31. Each work environment \nhas its own particular needs and characteristics, and the behaviours that demonstrate \nnon-technical skill competencies within the ICU will be specific to the demands of \nintensive care medicine, as well as the roles and responsibilities of caregivers.  \n \nTherefore, it can be concluded that it is necessary to further research the non-technical \nskill proficiencies required for safe practice in the ICU, and to describe them in \nsufficient detail so that they can be taught and reliably assessed. Ideally, as non-\ntechnical skill training programmes are integrated with the technical aspects of a \ndomain, training packages are implemented once professionals have an adequate level \nof technical competence. This also reduces the cognitive load of having to learn both \ntechnical and non-technical skills simultaneously. The current review demonstrates \nthat the framework of non-technical skill categories identified in the ANTS taxonomy \nis also pertinent to the ICU, and thus provides a useful foundation for future \ninvestigations. Research using other investigation techniques, including root-cause \nanalysis, attitudinal surveys, structured interviews, observational studies, and studies \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n18 \nof cognition, could facilitate a greater understanding of the non-technical skills \nrequired for supporting safety in the ICU. Although research focussing specifically on \nnon-technical skill competencies for the ICU is limited, examples of research in the \nICU using human factors techniques can be found to both support the importance of \nthe non-technical skill categories outlined in the ANTS taxonomy, as well as \nproviding examples of how such research can aid in identifying the non-technical skill \ncompetencies required for intensive care. Through using a combination of all the \nresearch techniques described, future work can better understand the nature and key \nchallenges of the ICU environment, its’ non-technical skill requirements, the \nbehaviours that demonstrate non-technical skill proficiencies, and the organizational \nfactors that affect the quality of non-technical skills demonstrated by nurses and \ndoctors in the ICU.  \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n19 \nReferences \n  \n1. A safer place for patients: Learning to improve patient safety. London: National Audit Office, \n2005 \n2. Baker DP, Dismukes RK. A framework for understanding crew performance asessment \nissues. Int J Aviat Psychol 2002; 12: 205-22 \n3. Beckmann U, Baldwin I, Hart GK, Runciman WB. The Australian Incident Monitoring Study \nin Intensive Care: AIMS-ICU. An analysis of the first year of reporting. Anaesth Intensive \nCare 1996; 24: 320-329 \n4 Beckmann U, Bohringer C, Carless R et al. Evaluation of two methods for quality \nimprovement in intensive care: facilitated incident monitoring and retrospective medical chart \nreview. Crit Care Med 2003; 31: 1277-1288 \n5. Beckmann U, Gillies DM. Factors associated with reintubation in Intensive Care. Chest 2001; \n120: 538-542 \n6. Beckmann U, Gillies DM, Berenholtz SM, Wu AW, Pronovost P. Incidents relating to the \nintra-hospital transfer of critically ill patients. Intensive Care Med 2004; 30: 1579-1585 \n7. Bracco D, Favre J, Bissonnette B, et al. Human errors in a multidisciplinary intensive care \nunit: a 1-year prospective study. Intensive Care Med 2001; 27: 137-145 \n8. Buckley T, Short T, Rowbottom Y, Oh T. Critical incident reporting in the intensive care unit. \nAnaesthesia 1997; 52: 403-409 \n9. Building a safer NHS for patients – implementing an organisation with a memory. London: \nDepartment of Health, 2001 \n10. Cesna M, Mosier K: Using a prediction paradigm to compare levels of expertise and decision \nmaking among critical care nurses. In Montgomery H, Lipshitz R, Brehmer B, eds. How \nProfessionals Make Decisions. Mahwah, NJ: LEA, 2005; 107-118 \n11. Crew resource management (CRM) training. Guidance for flight crew, CRM instructors \n(CRMIs) and CRM instructor-examiners (CRMIEs). London: Civil Aviation Authority, 2003 \n12. Donchin Y, Gopher D, Olin M, et al. A look into the nature and causes of human errors in the \nintensive care unit. Crit Care Med 1995; 23: 294-230 \n13. Fletcher G, Flin R, McGeorge P, Glavin R, Maran N, Patey R. Anaesthetists' Non-Technical \nSkills (ANTS): evaluation of a behavioural marker system. Br J Anaesth 2003; 90: 580-588 \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n20 \n14. Fletcher G, Flin R, McGeorge P, Glavin R, Maran N, Patey R. Rating non-technical skills: \ndeveloping a behavioural marker system for use in anaesthesia. Cogn Tech Work 2004; 6: \n165-171 \n15. Fletcher G, McGeorge P, Flin R, Glavin RJ, Maran NJ. The role of non-technical skills in \nanaesthesia: a review of current literature. Br J Anaesth 2002; 88: 418-429 \n16. Flin R, Fletcher, G, Glavin R, Maran, N & Patey, R. Anaesthetists' Non-technical Skills \n(ANTS) System Handbook. University of Aberdeen. 2003; (www.abdn.ac.uk\/iprc\/ants.shtml) \n17. Flin R, Maran N. Identifying and training non-technical skills for teams in acute medicine. \nQual Saf Health Care 2004; 13: 80-84 \n18. Flin R, Martin L, Goeters K et al. Development of the NOTECHS (Non-Technical Skills) \nsystem for assessing pilots' CRM skills. Hum Factors and Aero Safety 2003; 3: 95-117 \n19. Flin R, O'Connor P, Mearns K. Crew Resource Management: Improving safety in high \nreliability industries. Team Performance Management 2002; 8: 68-78 \n20. Frey B, Buettiker V, Hug M et al. Does critical incident reporting contribute to medication \nerror prevention? Eur J Ped 2002; 161: 594-599 \n21. Gaba D. Human error in anaesthetic mishaps. Int Anesthesiol Clin 1989; 27: 137-147 \n22. Giraud T, Dhainaut J, Vaxelaire J et al. Iatrogenic complications in adult intensive care units: \na prospective two-centre study. Crit Care Med 1993; 20: 40-51 \n23. Graf J, von den Driesch A, Koch K, Janssens U. Identification and characterization of errors \nand incidents in a medical intensive care unit. Acta Anaesthesiol Scand 2005; 49: 930-939 \n24. Hart GK, Baldwin I, Gutteridge G, Ford J. Adverse Incident Reporting in Intensive Care. \nAnaesth Intensive Care 1994; 22: 556-561 \n25. Helmreich RL, Wilhelm JA, Klinect JR, Merritt AC. Culture, Error and Crew Resource \nmanagement. In: Salas E, Bowers CA, Edens E, eds. Improving Teamwork in Organizations: \nApplications of resource management training. Hillsdale, NJ: Erlbaum, 2001; 305-334 \n26. Klein G, Mititello L. Some guidelines for conducting a cognitive task analysis. In Salas E, ed.  \nAdvances in Human Performance and cognitive engineering research. New York, JAI Press, \n2000; 163-197 \n27. Leonard M, Graham S, Bonacum D. The human factor: the critical importance of effective \nteamwork and communication in providing safe care. Qual Saf Health Care 2004; 13: 85-90 \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n21 \n28. Lighthall GK, Barr J, Howard SK et al. Use of a fully simulated intensive care unit \nenvironment for critical event management training for internal medicine residents. Crit Care \nMed 2003; 31: 2437-2443 \n29. Patel VL, Arocha JF. The nature of constraints on collaborative decision making in health care \nsettings. In Salas E, Klein G eds. Linking Expertise and Naturalistic Decision Making. New \nJersey, LEA, 2001; 383-405 \n30. Patel VL, Kaufman DR, Arocha JF. Emerging paradigms of cognition in medical decision-\nmaking. J Biomed Inform 2002; 35: 52-75 \n31. Patey R, Flin R, Fletcher G et al: Developing a Taxonomy of Anaesthetists' Nontechnical \nSkills (ANTS). Henriks K, ed: Advances in Patient Safety: From Research to Implementation. \nWashington: Agency for Healthcare Research and Quality: 2005; 325-336  \n32. Pronovost  PJ, Wu A, Dorman T, Morlock L. Building safety into ICU care. J Crit Care 2002; \n17: 78-85 \n33. Pronovost PJ, Wu AW, Sexton JB. Acute decompensation after removing a central line: \nPractical approaches to increasing safety in the intensive care unit. Ann Intern Med 2004; 140: \n1025-1033 \n34. Rall M, Gaba D. Human performance and patient safety. In: Miller DR, ed. Anesthesia. Sixth \ned. Philadephia: Churchill Livingstone, 2005; 3021-3072 \n35. Rall M, Gaba D. Patient simulators. In: Miller DR, ed. Anesthesia. Sixth ed. Philadelphia: \nChurchill Livingstone, 2005; 3073-3103 \n36. Rogelberg, SG. Handbook of Research Methods in Industrial and Organizational Psychology. \nOxford, Blackwell Publishing, 2004 \n37. Rothschild JM, Landrigan CP, Cronin JW et al. The Critical Care Safety Study: The incident \nand nature of adverse events and serious medical errors in intensive care. Crit Care Med 2005; \n33: 1694-1700 \n38. Sexton JB, Thomas EJ, Helmreich RL. Error, stress and teamwork in medicine and aviation: \ncross sectional surveys. BMJ 2000; 320: 745-749 \n39. Shortell SM, Zimmerman JE, Rousseau DM et al. The performance of intensive care units: \nDoes good management make a difference? Med Care 1994; 32: 508-525 \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n22 \n40. Thomas EJ, Sexton JB, Helmreich RL. Discrepant attitudes about teamwork among critical \ncare nurses and physicians. Crit Care Med 2003; 31:956-959 \n41. Weiner E, Kanki B, Helmreich R eds. Cockpit resource management. San Diego, Academic \nPress, 1993 \n42. Wright D, Mackenzie M, Buchan I, et al. Critical incidents in the intensive therapy unit. \nLancet 1991; 14: 676-681 \n43. Wright MC, Taekman JM, Endsley M. Objective measures of situation awareness in a \nsimulated medical environment. Qual Saf Health Care 2004; 13: 65-71 \n44. Yee B, Naik V, Joo H et al. Non-technical skills: repeated simulation exposure. Anaesthesia \n2005, 103: 241-248 \n45. Yule S, Flin R, Paterson-Brown S, Maran, N. Non-technical skills for surgeons: A review of \nthe literature. Surgery 2005, in press \n \n \n \n \n \n \n \n \n \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n23 \nFigure 1. Anaesthetists Non-technical Skills Taxonomy 13, 14, 16. For more details please see the ANTS website  \n(www.abdn.ac.uk\/iprc\/ants.shtml). \n \nE.g.  behavioural markers \nfor poor practice \nE.g.  behavioural markers \nfor good practice \nCategories Elements \n \nTask  \u0001 Planning and preparing \nManagement  \u0001 Prioritising \n\u0001 Providing and maintaining standards \n\u0001 Identifying and utilising resources \n \nTeam  \u0001 Co-ordinating activities with team members \nWorking  \u0001 Exchanging information  \n\u0001 Using authority and assertiveness \n\u0001 Assessing capabilities  \n\u0001 Supporting others \n \nSituation \u0001 Gathering information \nAwareness  \u0001 Recognising and understanding \n  \u0001 Anticipating \n \nDecision \u0001 Identifying options \nMaking  \u0001 Balancing risks and selecting options \n  \u0001 Re-evaluating \n− Reduces level of monitoring \nbecause of distractions \n− Responds to individual cues without \nconfirmation \n− Does not alter physical layout of \nworkspace to improve data visibility  \n− Does not ask questions to orient self \nto situation during hand-over \n \n+ Confirms roles and \nresponsibilities of team members \n+ Discusses case with surgeons or \ncolleagues \n+ Considers requirements of others \nbefore acting \n+ Co-operates with others to achieve \ngoals \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n24 \n \nFigure 2. Literature review flow diagram \n \nStage 1: Initial Search \n \nElectronic Search:    Medline, Biomed Central and Web of Knowledge \nKeywords:                 Intensive care \/ critical incidents \/ ICU \/ error \/ adverse events \/ non technical skills  \nLimitations:              Articles in English  \nResults:                     754 articles \nStage 2: Screening of results \n \nFilter:  Titles examined for relevance to the ICU, critical incidents and non-technical skills \nFilter: Relevance of abstract examined in order to assess information presented in the \nstudy \nResults:  24 articles \nStage 3: Inclusion criteria \n \nInclusion criteria 1:  Study has data collected quantative data exclusively in the ICU \nInclusion criteria 2:  Study has allowed for non-technical skill causal factors associated with critical \nincidents to be documented \nResults:                      11 articles \n  \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n25 \nTable 1: Non-technical skill contributory factors (as detailed by the ANTS taxonomy) identified in ICU critical incident studies   \n \nNon-technical skill contributory factors \n \nPaper Identification Method \nNo. of  \nfactors %  Contributory factors \nAssociated  \nANTS Category \n      \nWright et al., 1991 \n(42) \nAnonymous questionnaires \n(137 incidents and 97 \ncontributory factors \nreported)  \n38 \n \n \n63% \n13% \n10% \n8% \n3% \n3% \nInexperience with equipment  \nFailure to check equipment   \nFailure to perform hourly checks   \nPoor communication   \nNot documenting changes  \nForgetting \n \nTask Management \nTask Management \nTask Management \nTeam Working \nTask Management \nSituation Awareness \nHart et al., 1994 \n(24) \nAnonymous questionnaires \n(390 incidents ) \n \nNA Deficiencies in communication  \nFailure to accept or adhere protocols \nAttention  \nDistraction  \nReduced vigilance  \n \nTeam Working \nTask Management \nSituation Awareness \nSituation Awareness \nSituation Awareness \nBeckmann et al., 1996 \n(3) \nIncident reporting forms \n(610 incidents and 1896 \ncontributory factors) \n701 \n \n23% \n18% \n13% \n13% \n13% \n12% \n8% \n \nError of recognition or anticipation  \nFailure to follow protocol  \nCommunication  \nError of judgement \nDistraction \/ inattention   \nFailure to check equipment  \nInadequate training  \n \nSituation Awareness \nTask Management \nTeam Working \nDecision Making \nSituation Awareness \nTask Management \nTask Management \nBuckley et al., 1997 \n(8) \nIncident reporting forms \n(281 incidents and 658 \ncontributory factors) \n454 19% \n17% \n17% \n16% \n14% \n6% \n6% \n2% \n2% \n1% \n \nInadequate assistance  \nDeviation from standard techniques   \nInexperience  \nError of judgement \nDistraction  \nInadequate communication  \nFailure to check  \nUnfamiliar environment  \nUnfamiliar procedure or equipment \nWrong technique chosen \n \nTeam Working \nTask Management \nTask Management \nDecision Making \nSituation Awareness \nTeam Working \nSituation Awareness \nTask Management \nTask Management \nDecision Making \nBeckmann et al., 2001 \n(5) \n \nIncident reporting forms of \nreintubations (143 incidents \nand 258 contributory \nfactors) \n \n165 54% \n20% \n18% \n8% \nError of judgement \nProblem recognition   \nInadequate patient assessment  \nInadequate training  \n \nDecision Making \nSituation Awareness \nSituation Awareness \nTask Management \nBracco et al., 2001 \n(8) \nIncident reporting forms \n(777 incidents and 777 \ncontributory factors) \n241 37% \n32% \n31% \n \nFailure to execute plan as intended  \nSurveillance errors   \nApplication of inappropriate plan   \n \nTask Management \nSituation Awareness \nDecision Making \n \nBeckmann et al., 2003 \n(4) \n \nIncident reporting forms  \nand medical chart review \n(211 incidents and 224  \ncontributory factors) \n83 17% \n14% \n12% \n10% \n10% \n8% \n8% \n8% \n7% \n6% \nCommunication problem  \nInattention or absent mindedness \nFailure to check equipment \nPoor teamwork \nInexperience or Inadequate training  \nInappropriate behaviour or action  \nPressure to proceed \nLack of supervision  \nTaking short cuts  or breaking rules \nFailure to provide\/enforce protocol or policy  \n \nTeam Working \nSituation Awareness \nTask Management \nTeam Working \nTask Management \nTask Management \nTeam Working \nTeam Working \nTask Management \nTask Man. \/ Team Wk \n \nBeckmann et al., 2004 \n(6) \n \nIncident reporting forms \nidentifying cases of intra-\nhospital transfers  (191 \nincidents and 900 \ncontributory factors) \n \n355 16% \n14% \n13% \n12% \n9% \n9% \n7% \n7% \n6% \n4% \n3% \nError of problem recognition \nError of judgement   \nCommunication problem \nFailure to follow protocol \nInadequate training \nPatient preparation inadequate \nPatient assessment inadequate \nFailure to check equipment  \nInexperience \nLack of supervision \nDistraction \/ inattention \n \nSituation Awareness \nDecision Making \nTeam Working \nTask Management \nTask Management \nTask Management \nSituation Awareness \nTask Management \nTask Management \nTeam Working \nSituation Awareness \nGraf et al., 2005 \n(23) \nIncident reporting forms (50 \nincidents and 81 \ncontributory factors) \n69 19% \n16% \n15% \n10% \n10% \n10% \n9% \n4% \n4% \n3% \n \nDisregard of standards, rules and orders \nCommunication insufficiency, misunderstanding \nDrug given but not prescribed \nWrong, incomplete or \/ delayed echocardiographic assessment \nDelayed intervention \nWrong dose \nLack of experience \nWrong, incomplete or \/ delayed electrocardiographic assessment \nWrong diagnosis \nOrder illegible \n \nTask Management \nTeam Working \nTask Management \nSit Aware \/ Task Man. \nTask Management \nTask Management \nTask Management \nSit Aware \/ Task Man. \nSituation Awareness \nTeam Working \nRothschild et al., 2005  \n(30) \n \nObservations, incident \nreporting forms, \ncomputerised ADE detection \nmonitors and medical chart \nreview (277 incidents 329 \ncontributory factors) \n295 57% \n17% \n13% \n4% \n3% \n2% \n2% \n1% \n1% \nMedication error in ordering or execution of treatment \nFailure to take precautions or follow protocol to prevent accidental injury \nInadequate reporting\/communication \nAvoidable delays in diagnosis \nInadequate patient assessment \nInadequate training \/ supervision \nInadequate reporting or communication \nAvoidable treatment delay \nFailure to check equipment or defective equipment \nTask Management \nTask Management \nTeam Working \nTask Management \nSituation Awareness \nTask Man. \/ Team Wk \nTeam Working \nTask Management \nTask Management \n \nTotal 2677 incidents (5610 \ncontributory factors) \n2401    \nPublished as: Reader, T., Flin, R., Lauche, K., & Cuthbertson, B. (2006). Non-technical skills in the Intensive Care Unit. British Journal of Anaesthesia, 96, 551-559. \n \n26 \n \nFigure 3. The proportion of contributory factors across all studies (see table 1) that each of the four non-\ntechnical skill categories accounts for. \n \n0\n10\n20\n30\n40\n50\n60\nDecision Making Situation\nAw areness\nTask Management Team Working\nNon-technical skill\n%\n \n \n \n \n \n \n.  \n"}