{"doi":"10.1103\/PhysRevC.75.017603","coreId":"100950","oai":"oai:epubs.surrey.ac.uk:351","identifiers":["oai:epubs.surrey.ac.uk:351","10.1103\/PhysRevC.75.017603"],"title":"Continuum description with pseudostate wave functions","authors":["Moro, A. M.","Rodríguez-Gallardo, M.","Crespo, R.","Thompson, I. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-17","abstract":"<p>Benchmark calculations are performed aiming to test the use of two different pseudostate bases on the multiple scattering expansion of the total transition amplitude scattering framework. Calculated differential cross sections for <i>p<\/i>-<sup>6<\/sup>He inelastic scattering at 717 MeV\/nucleon show a good agreement between the observables calculated in the two bases. This result gives extra confidence on the pseudostate representation of continuum states to describe inelastic\/breakup scattering.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:351<\/identifier><datestamp>\n      2017-10-31T13:57:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/351\/<\/dc:relation><dc:title>\n        Continuum description with pseudostate wave functions<\/dc:title><dc:creator>\n        Moro, A. M.<\/dc:creator><dc:creator>\n        Rodríguez-Gallardo, M.<\/dc:creator><dc:creator>\n        Crespo, R.<\/dc:creator><dc:creator>\n        Thompson, I. J.<\/dc:creator><dc:description>\n        <p>Benchmark calculations are performed aiming to test the use of two different pseudostate bases on the multiple scattering expansion of the total transition amplitude scattering framework. Calculated differential cross sections for <i>p<\/i>-<sup>6<\/sup>He inelastic scattering at 717 MeV\/nucleon show a good agreement between the observables calculated in the two bases. This result gives extra confidence on the pseudostate representation of continuum states to describe inelastic\/breakup scattering.<\/p><\/dc:description><dc:date>\n        2007-01-17<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/351\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Moro, A. M., Rodríguez-Gallardo, M., Crespo, R. and Thompson, I. J.  (2007) Continuum description with pseudostate wave functions   Physical Review C, 75 (017603).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.75.017603<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/351\/","10.1103\/PhysRevC.75.017603"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C 75, 017603 (2007)\nContinuum description with pseudostate wave functions\nA. M. Moro* and M. Rodrı´guez-Gallardo†\nDepartamento de Fı´sica Ato´mica, Molecular y Nuclear, Universidad de Sevilla, Apartado 1065, E-41080 Sevilla, Spain\nR. Crespo‡\nDepartamento de Fı´sica, Instituto Superior Te´cnico, Taguspark, Avenida Prof. Cavaco Silva, P-2780-990 Porto Salvo, Oeiras, Portugal\nI. J. Thompson§\nDepartament of Physics, University of Surrey, Guildford GU2 7XH, United Kingdom\n(Received 13 October 2006; published 17 January 2007)\nBenchmark calculations are performed aiming to test the use of two different pseudostate bases on the multiple\nscattering expansion of the total transition amplitude scattering framework. Calculated differential cross sections\nfor p-6He inelastic scattering at 717 MeV\/nucleon show a good agreement between the observables calculated\nin the two bases. This result gives extra confidence on the pseudostate representation of continuum states to\ndescribe inelastic\/breakup scattering.\nDOI: 10.1103\/PhysRevC.75.017603 PACS number(s): 24.10.−i, 24.50.+g, 25.40.Ep\nInelastic scattering at intermediate energies can be a useful\ntool to study multipole excitations of Borromean nuclei (such\nas 11Li and 6He). Because of their loosely bound nature, to\nproperly understand and interpret such reactions, it is crucial\nto take into account the few-body degrees of freedom. At\nhigh energies, the multiple scattering expansion of the total\ntransition amplitude (MST) is a convenient framework that has\nalready been applied to analyze such reactions for elastic [1,2]\nas well as for inelastic [3,4] scattering. In the latter case, the\nmethod can take into account spin excitations that occur when\nscattering from a spin target such as a proton. In these calcu-\nlations, it is formal and numerically advantageous to represent\nthe continuum states in terms of a basis of square-integrable\nfunctions, also known as pseudostates (PSs). Unlike the\ntrue scattering states, the PSs vanish at large distances and\nhence the method will be only useful if the calculated observ-\nables are not sensitive to the asymptotic region. Moreover,\ncalculations performed with different families of states should\nconverge to the same results, provided that enough states are\nincluded and that the basis is complete within the radial region\nrelevant for the process under study.\nGuided by this motivation, in this Brief Report we present\nbenchmark calculations of proton inelastic scattering from\n6He within the MST framework, making use of two different\nPS bases to describe the 6He continuum. We aim to check to\nwhat extent the calculated breakup observables depend on the\nchoice of the PS functions.\nFor a Borromean system, such as 6He, the wave function for\na total angular momentum J (with projection M) and energy\n\u0001, ϕJM\u0001 , can be expressed in terms of the Jacobi coordinates \u0001r\n*Electronic address: moro@us.es\n†Electronic address: mrodri@cii.fc.ul.pt; present address: Centro de\nFı´sica Nuclear, Universidade de Lisboa, Avenida Prof. Gama Pinto 2,\nP-1649-003 Lisboa, Portugal.\n‡Electronic address: Raquel.Crespo@tagus.ist.utl.pt\n§Electronic address: I.Thompson@surrey.ac.uk\n(the relative coordinate between the valence nucleons) and \u0001R\n(the relative coordinate from the center of mass of the neutron\npair to the core).\nIt is also convenient to introduce a set of hyperspherical\ncoordinates: the hyper-radius ρ and five hyperspherical polar\nangles \u00045 = {α, θx, φx, θy, φy}. The former is defined as\nρ =\n√\nx2 + y2 with scaled coordinates \u0001x = 2−1\/2\u0001r and \u0001y =\n(2\/√3) \u0001R. The angle α = arctan(x\/y) is the hyperangle and\nθx, φx, θy, φy are the angles associated with the unit spatial\nvectors xˆ and yˆ.\nWithin the PS method, the eigenstates ϕJM\u0001 (\u0001r, \u0001R) are\nobtained by diagonalization of the Hamiltonian in a basis of\nnormalizable states. These states are conveniently expanded in\na basis of hyperspherical harmonics of the form\nψJMnβ (\u0001r, \u0001R) = Rnβ(ρ)ϒJMβ (\u00045), (1)\nwhere ϒJMβ (\u00045) is the generalized angle-spin basis [5]\nϒJMβ (\u00045) =\n{YK\u000bx\u000byL(\u00045) ⊗ [χs2 ⊗ χs3]S}JM, (2)\nwith χsi the neutron spin functions and YK\u000bx\u000byL(\u00045) the\nhyperspherical harmonics,\nYK\u000bx\u000byLML(\u00045) = ψK\u000bx\u000by (α)\n[\nY\u000bx (xˆ) ⊗ Y\u000by (yˆ)\n]\nLML\n. (3)\nThe functions ψK\u000bx\u000by (α) have an explicit form in terms of\nJacobi polynomials of the hyperangleα [5]. The set of quantum\nnumbers β = {K\u000bx\u000byLS} defines a channel, with \u000bx and\n\u000by the orbital angular momenta associated with the Jacobi\ncoordinates \u0001x and \u0001y,K = \u000bx + \u000by + 2ν (ν = 0, 1, 2, . . .) the\nhyperangular momentum, \u0001L = \u0001\u000bx + \u0001\u000by the total orbital angu-\nlar momentum, and S the spin of the particles related by the\ncoordinate \u0001x. In Eq. (1), Rnβ(ρ) are the hyper-radial functions\nand n is an index that labels the basis states within a given\nchannel β. These functions are orthogonalized such that∫ ∞\n0\ndρρ5Rnβ(ρ)Rn′β(ρ) = δnn′ . (4)\n0556-2813\/2007\/75(1)\/017603(4) 017603-1 ©2007 The American Physical Society\nBRIEF REPORTS PHYSICAL REVIEW C 75, 017603 (2007)\nThe aim of the present work is to compare two different\nchoices for the functions Rnβ(ρ) in the calculation of breakup\nobservables within the MST framework. First, we consider\nthe Gauss-Laguerre (GL) basis [6], whose hyper-radial part,\nRGLn (ρ), is given by\nRGLn (ρ) = ρ0−3[n!\/(n + 5)!]1\/2L5n(z) exp(−z\/2) , (5)\nwith z = ρ\/ρ0, L5n the generalized Laguerre polynomials, and\nρ0 a parameter that sets the radial scale of the basis.\nThe second choice is the transformed harmonic oscillator\n(THO) basis, recently introduced in Ref. [7] for a three-body\nsystem. The THO method is based on the idea of transforming\nthe bound ground-state wave function of the system into the\nground-state wave function of the harmonic oscillator (HO),\ndefining a local scale transformation (LST). The ground-state\nwave function can be written as a linear combination of the\nbasis functions (1),\nϕ\nJ0M0\n0 (\u0001r, \u0001R) =\n∑\nβ\nR\n\u00010\nβ (ρ)ϒJ0Mβ (\u00045), (6)\nwhere we have introduced the abbreviated notation ϕJ0M00 ≡\nϕJ0M0\u00010 . Then, the equation that defines the LST for each channel\nβ is ∫ ρ\n0\ndρ ′ρ ′5\n∣∣R\u00010β (ρ ′)∣∣2 =\n∫ s\n0\nds ′s ′5\n∣∣RHO0K (s ′)∣∣2, (7)\nwhere RHO0K (s) is the hyper-radial part of the HO ground state\nfor the hyperangular momentum K. Then, the THO basis is\nconstructed for each channel by applying the LST, sβ(ρ), to\nthe HO basis\nRTHOnβ (ρ) = R\u00010β (ρ)LK+2n\n(\ns2β(ρ)\n)\n, (8)\nwhere LK+2n are generalized Laguerre polynomials of degree\nn. For channels not included in the ground state, information\nfrom one of the known (ground-state) channels with the closest\nquantum labels to the channel of interest is used to construct\nthe LST, as explained in Ref. [7].\nNeither the GL nor the THO functions are eigenstates of\nthe Hamiltonian, but they provide a complete and orthonormal\nset in which the Hamiltonian can be diagonalized. For\nthis purpose, the basis is truncated by setting a maximum\nvalue of the index n (n = 0, . . . , N ) as well as a maximum\nhyperangular momentum Kmax. Upon diagonalization in the\ntruncated basis, the eigenstates are obtained as\nϕJM\u0001i (\u0001r, \u0001R) =\n∑\nnβ\nC\nJ\u0001i\nnβ ψ\nJM\nnβ (\u0001r, \u0001R), (9)\nwhere {\u0001i} are their associated eigenvalues.\nFrom this derivation, it becomes apparent that the GL basis\nis obtained in a more straightforward way than the THO\nbasis. However, the latter has some appealing properties that\ncould make it more suitable in some situations. In particular,\nthe THO basis has the advantage of being constructed from\nthe ground-state wave function of the system. Thus, when\nwe diagonalize the Hamiltonian in a finite THO basis, the\nground state is recovered for any size of the basis. By contrast,\nin the GL representation a large basis may be required to\nobtain a good description of the ground state. Also, note that\nthe hyper-radial part of the GL basis is the same for all the\nchannels β whereas in the THO basis a different hyper-radial\npart is calculated for each channel, with the correct behavior\nat the origin (ρK).\nFor a meaningful comparison between the two bases, we\nuse the same three-body Hamiltonian to generate the GL and\nTHO eigenstates for 6He. In particular, we use the n-n potential\nof Gogny, Pires, and de Tourreil [8] with spin-orbit and tensor\ncomponents and we take the n-4He potential from Ref. [9].\nBesides the pairwise interactions, an effective three-body\npotential is included, with matrix elements of the form [5]\nV 3Bβ ′β(ρ) =\nδβ ′βV\n3B\nJ\n1 + (ρ\/5)3 . (10)\nThe J = 0 strength of this effective potential is tuned to\nreproduce the experimental three-body separation energy and\nthe J > 0 strength is adjusted to obtain the 2+1 resonance at\nthe experimental energy.\nWe now consider the scattering process of 6He, originally\nin its ground state, |ϕJ0M00 〉, to a final continuum state |ϕJM\u0001 〉,\nat excitation energy \u0001 and with total angular momentum\nJ (projection M), by means of its interaction with a proton,\nwith initial (final) linear momentum \u0001k1(\u0001k ′1) in the nucleon-\nnucleus c.m. frame and spin S1 = 1\/2 with projection σ (σ ′).\nThe double differential cross section for this process can be\nformally expressed as\nd2σJJ0\nd\u0004d\u0001\n= 1(Ŝ1)2\n1\n(Ĵ0)2\n[\nh¯2\n4π2µNA\n]2\n×\n∑\nσσ ′\n∑\nMM0\n∣∣〈\u0001k′1χσ ′S1 ; ϕJM\u0001 ∣∣T ∣∣\u0001k1χσS1 ; ϕJ0M00 〉∣∣2, (11)\nwhere T denotes the transition amplitude operator [10]. This\noperator can be expressed as a multiple expansion series in\nthe transition amplitudes tˆI for proton scattering from each\nprojectile subsystem I [11]. At high energies and for small\nmomentum transfers, this expansion is expected to converge\nquickly. If only the leading term of the series is retained, the\nsingle scattering approximation (SSA) is obtained [3,12]:\nT SSA =\n4∑\nI=2\ntˆ1I (12)\nwith I = 2, 3 for the halo neutrons, and I = 4 for the core.\nThe proton-I subsystem transition amplitude satisfies the\nLippmann-Schwinger equation\ntˆ1I = v1I + v1IG0 tˆ1I , (13)\nwith v1I the interaction between the nucleon and I subsystem.\nWithin the impulse approximation, the propagator G0 =(\nE+ − K)−1 contains the kinetic energy operators of the\nproton and all the projectile subsystems. Here E is the kinetic\nenergy, E = h¯2k21\/2µNA in the overall c.m. frame, and µNA is\nthe proton-projectile reduced mass.\nWithin the PS method, the scattering states ϕJM\u0001 in Eq. (11)\nare approximated by the pseudostates ϕJM\u0001i . Hence, the double\ndifferential cross section (11) becomes a single differential\n017603-2\nBRIEF REPORTS PHYSICAL REVIEW C 75, 017603 (2007)\ncross section for each pseudostate,\ndσ iJJ0\nd\u0004\n= 1(Ŝ1)2\n1\n(Ĵ0)2\n[\nh¯2\n4π2µNA\n]2\n×\n∑\nσσ ′\n∑\nMM0\n∣∣〈\u0001k′1χσ ′S1 ; ϕJM\u0001i ∣∣\n4∑\nI=2\ntˆ1I\n∣∣\u0001k1χσS1 ; ϕJ0M00 〉∣∣2,\n(14)\nwhere we have replaced the T matrix operator by its single\nscattering approximation. By making use of the impulse\napproximation [2], the matrix elements for the scattering\nfor each constituent can be further simplified, leading to the\nfollowing factorized form for the scattering from one valence\nnucleon (I = 2):〈\u0001k′1χσ ′S1 ; ϕJM\u0001i ∣∣tˆ12∣∣\u0001k1χσS1 ; ϕJ0M00 〉\n=\n∑\nbβ\nt[bβSpS ′p](ω12,\u0012) × ρ[bβ;ST S ′T \u0001i ]\n(\nm3\nM23\n\u0001\u0012, m4\nM234\n\u0001\u0012\n)\n,\n(15)\nwith M23 = m2 + m3 and M234 = m2 + m3 + m4 and where\nwe have introduced the momentum transfer \u0001\u0012 = \u0001k ′1 − \u0001k1 and\nthe energy parameter ω12 [2] and where Sp = {S1σ }(S ′p =\n{S1σ ′}) are the incoming (outgoing) spin of the nucleon\nand its projection and ST = {J0M0}(S ′T = {JM}) the initial\n(final) total spin of the halo valence pair. The amplitude\nt[bβSpS ′p] is given in terms of the tensor components of the\nnucleon-nucleon transition amplitude [2,13]. The transition\ndensity form factors, ρ[bβ;ST S ′T \u0001i ], depend exclusively on the\nstructure of the composite system. Its explicit expression as a\nfunction of the hyper-radial parts of the wave functions of the\ninitial and final states can be found in Ref. [2].\nThe scattering from the core, assumed here as spinless, can\nequivalently be written as〈\u0001k′1χσ ′S1 ; ϕJM\u0001i ∣∣tˆ14∣∣\u0001k1χσS1 ; ϕJ0M00 〉\n= t[00SpS ′p](ω14,\u0012) × ρ[00;ST S ′T \u0001i ]\n(\n0,\nM23\nM234\n\u0001\u0012\n)\n, (16)\nwhere, as before, ω14 is the appropriate energy parameter\n[2]. The angular differential cross section for 6He inelastic\nscattering (breakup) is then obtained by summing all excited-\nstate contributions,\ndσ inelJJ0\nd\u0004\n=\n\u0001maxi∑\n\u0001i\ndσ iJJ0\nd\u0004\n. (17)\nFor the evaluation of Eqs. (15) and (16) one needs\nthe (free) transition amplitudes for proton scattering from\nthe valence nucleons and the core. For the former, we\nused the NN Paris interaction. The transition amplitude for\nthe α core was generated from a phenomenological optical\npotential, of Woods Saxon form, with parameters obtained\nby fitting existing data for the elastic scattering of p+4He at\nEp = 700 and 800 MeV, as detailed in Ref. [2].\nWe first study the convergence of the breakup observables\nwith respect to the basis size. For this purpose, we consider the\nTHO basis, truncated at different values of N . The maximum\n0 5 10 15 20 25 30\nθ\nc.m.\n (deg)\n10-2\n10-1\n100\n101\n102\ndσ\nin\nel\n\/d\nΩ\n \n(m\nb\/s\nr) N=4N=3\nN=2\n6He(p,p’)6He*(0+) @ Ep=717 MeV THO basis\nFIG. 1. (Color online) Angular differential cross section for the\nbreakup of 6He on protons at 717 MeV per nucleon, leading to J π =\n0+ continuum states of the 6He nucleus. The three lines represent the\ncalculation with the THO basis, for several values of N (indicated by\nthe labels). Each curve includes the contribution from eigeinstates up\nto 10 MeV in excitation energy, according to Eq. (17).\nhyperangular momentum was set to Kmax = 20. This yields\nthe three-body force parameters V 3B0 = −2.4 MeV, for J = 0,\nand V 3BJ = −0.85 MeV, for J > 0.\nIn Fig. 1 we show the angular distribution of the calculated\ninelastic differential cross sections. For simplicity, only the\nJπ = 0+ continuum is included, and the Coulomb interaction\nbetween the proton and the α core is ignored. The three lines\nrepresent the SSA calculation for different values of the basis\nsize, according to the choice of the parameter N . The three\ncases are in almost perfect agreement, indicating that in this\nreaction the convergence with the basis size is very fast.\nNext, we study the dependence of the breakup observables\non the choice of the basis, by comparing the calculations in\nthe GL and THO representations. As before, the maximum\nhyperangular momentum was set to Kmax = 20, and only\neigenstates below 10 MeV are considered. The index n\nwas truncated to N = 20 and N = 4 for the GL and THO\nbases, respectively. With this model space, the number of\npseudostates in the GL (THO) basis is 31 (30) for 0+, 63(86)\nfor 1−, 53(49) for 1+, and 79 (81) for 2+. For the GL\nbasis, the range parameter was set to ρ0 = 0.25 fm, which\nprovides a basis that extends up to about 20 fm in the\nhyper-radius. With these parameters, the ground state obtained\nafter diagonalization of the Hamiltonian appears at −0.9781\nand −0.9549 MeV, for the GL and THO bases, respectively.\nIn Fig. 2 we compare the inelastic angular distributions\ncalculated in the GL and THO bases. The separate\ncontributions for Jπ = 0+, 1−, 1+, and 2+ final states are\nalso shown. As before, the Coulomb interaction is neglected.\nThe thick lines are the incoherent sum of all these Jπ\ncontributions. Solid and dashed lines correspond, respectively,\nto the calculations with the GL and THO bases. For each\ncurve, the contribution of eigenstates up to \u0001max = 10 MeV are\nadded incoherently, according to Eq. (17). We consider only\nthe forward angles θc.m. < 30◦ since the SSA is not expected\nto work well at large momentum transfers [2]. We see that, at\nthese angles, the dominant contribution to the breakup cross\nsection comes from the 1− states, whereas for θc.m. > 25◦,\n017603-3\nBRIEF REPORTS PHYSICAL REVIEW C 75, 017603 (2007)\n0 5 10 15 20 25 30\nθ\nc.m.\n (deg)\n10-2\n10-1\n100\n101\n102\ndσ\nin\nel\n\/d\nΩ\n \n(m\nb\/s\nr)\nTotal\n1-\n2+\n0+\n1+\nFIG. 2. (Color online) Calculated contributions for breakup dif-\nferential cross section leading to final states with J π = 0+, 1−, 1+,\nand 2+, using the SSA. Solid and dashed lines refer to the GL and\nTHO basis, respectively.\nthe 2+ excitation becomes dominant. Finally, the population\nof the unnatural parity 1+ states is almost negligible at all\nangles. We notice that this excitation mode requires spin-flip\ntransitions, which, according to these calculations, are very\nsmall in this reaction.\nFor all these contributions, the GL and THO bases provide\nvery similar results, suggesting that the calculated observables\ndo not depend on the choice of the continuum representation,\nprovided that enough states are included.\nIn summary, in this Brief Report we have calculated proton\ninelastic scattering from 6He at 717 MeV\/nucleon, using\nas scattering framework the single-scattering approximation\nand two different pseudostate representations of the 6He\ncontinuum: the GL and the THO. Provided that enough states\nare included, both bases predict essentially the same inelastic\ndifferential cross section. Furthermore, the studied observables\nconverge very quickly with the size of the basis. These results\nsupport the reliability of the pseudostate method as a useful\nand convenient tool to treat scattering problems dealing with\ncontinuum states. This analysis could be extended to other\nPS bases and reactions. Furthermore, it could be applied to\nother scattering frameworks, for which the PS method has also\nbeen implemented, such as the continuum discretized coupled\nchannels method [14,15].\nWe are grateful to J. Go´mez-Camacho and J. M. Arias for\nuseful discussions. This work was supported by the Fundac¸a˜o\npara a Cieˆncia e Tecnologia (Portugal) through Grant No.\nPOCTI\/1999\/FIS\/36282, by the Accio´n Integrada HP2003-\n0121, and in the U.K. by EPSRC Grant No. GR\/M\/82141.\nA.M.M. acknowledges a research grant by the Junta de\nAndalucı´a.\n[1] R. Crespo and I. J. Thompson, Phys. Rev. C 63, 044003 (2001).\n[2] R. Crespo, A. M. Moro, and I. J. Thompson, Nucl. Phys. A771,\n26 (2006).\n[3] R. Crespo, I. J. Thompson, and A. A. Korsheninnikov, Phys.\nRev. C 66, 021002(R) (2002).\n[4] R. Crespo, I. J. Thompson, and A. M. Moro, Phys. Rev. C 74,\n044616 (2006).\n[5] B. V. Danilin, I. J. Thompson, M. V. Zhukov, and J. S. Vaagen,\nNucl. Phys. A632, 383 (1998).\n[6] I. Thompson, F. Nunes, and B. Danilin, Comput. Phys. Commun.\n161, 87 (2004).\n[7] M. Rodrı´guez-Gallardo, J. M. Arias, J. Go´mez-Camacho, A. M.\nMoro, I. J. Thompson, and J. A. Tostevin, Phys. Rev. C 72,\n024007 (2005).\n[8] D. Gogny, P. Pires, and R. de Tourreil, Phys. Lett. B32, 591\n(1970).\n[9] J. Bang and C. Gignoux, Nucl. Phys. A313, 119 (1979).\n[10] C. J. Joachain, Quantum Collision Theory (North-Holland,\nAmsterdam, 1987).\n[11] K. M. Watson, Phys. Rev. 105, 1388 (1957).\n[12] R. Crespo and R. C. Johnson, Phys. Rev. C 60, 034007\n(1999).\n[13] R. Crespo and A. M. Moro, Phys. Rev. C 65, 054001\n(2002).\n[14] A. M. Moro, F. Pe´rez-Bernal, J. M. Arias, and J. Go´mez-\nCamacho, Phys. Rev. C 73, 044612 (2006).\n[15] T. Matsumoto, E. Hiyama, K. Ogata, Y. Iseri, M. Kamimura,\nS. Chiba, and M. Yahiro, Phys. Rev. C 70, 061601(R) (2004).\n017603-4\n"}