{"doi":"10.1080\/17454830701529567","coreId":"102934","oai":"oai:epubs.surrey.ac.uk:2566","identifiers":["oai:epubs.surrey.ac.uk:2566","10.1080\/17454830701529567"],"title":"Effects of different emotion terms on the size and colour of children's drawings","authors":["Burkitt, E","Barrett, MD","Davis, A"],"enrichments":{"references":[],"documentType":{"type":0}},"contributors":[],"datePublished":"2009","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2566<\/identifier><datestamp>\n      2017-10-31T14:05:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2566\/<\/dc:relation><dc:title>\n        Effects of different emotion terms on the size and colour of children's drawings<\/dc:title><dc:creator>\n        Burkitt, E<\/dc:creator><dc:creator>\n        Barrett, MD<\/dc:creator><dc:creator>\n        Davis, A<\/dc:creator><dc:date>\n        2009<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2566\/1\/IJAT_Burkitt_et_al_%282009%29_Barret_journalarticle-embargo.pdf<\/dc:identifier><dc:identifier>\n          Burkitt, E, Barrett, MD and Davis, A  (2009) Effects of different emotion terms on the size and colour of children's drawings   International Journal of Art Therapy, 14.  pp. 74-84.      <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/title~db=all~content=t716100706~tab=issueslist<\/dc:relation><dc:relation>\n        10.1080\/17454830701529567<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/epubs.surrey.ac.uk\/2566\/","http:\/\/www.informaworld.com\/smpp\/title~db=all~content=t716100706~tab=issueslist","10.1080\/17454830701529567"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1\nBurkitt, E., Barrett, M., & Davis, A. (2009). Effects of different emotion terms on the \nsize and colour of children's drawings. International Journal of Art Therapy, 14, 74-84. \n \n \nEffects of different emotion terms on the size and colour of children’s drawings \n \nEsther Burkitt1, Martyn Barrett2 and Alyson Davis3 \n \n1 Centre for Childhood, Development and Learning \nThe Open University \nUK \n \n2 & 3 Department of Psychology \nUniversity of Surrey \nUK \n \nAcknowledgements: The research team would like to thank all of the children and \nteachers who participated in this project. \n \n \n 2\nEffects of different emotion terms on the size and colour of children’s drawings \n \nAbstract \n \nRecent studies have shown that, when an affective characterisation is given to a \ntopic, children adjust the size and colour of those topics in their drawings: children \nincrease the size of drawings of topics characterised as “nice”, do not always decrease \nthe size of topics characterised as “nasty”, and use differential colouring systematically \nto distinguish between “nice” and “nasty” topics in their drawings (Burkitt, Barrett, \nDavis, 2003a, 2003b, 2004). The present experiment was designed to examine whether \nthese specific effects only occur with the terms “nice” and nasty”, or whether they also \noccur with another pair of positive and negative terms, “happy” and “sad”. 102 4-7 year \nolds were divided into two groups and asked to draw either a baseline, “nice” and \n“nasty” man, or a baseline, “happy” and “sad” man. It was found that the valence of the \ncharacterisation (positive vs. negative), as well as the specific pair of words which was \nused, systematically influenced both the size and the colour of the children’s drawings. \nThese results show the importance of understanding the exact emotions in question \nwhen interpreting children’s drawings on the basis of size and colour. \n \n \n \n \n \n \n \n 3\nKeywords:  \nChildren, emotion, drawing, interpretation, colour, size \n \nBiographies:  \nDr. Esther Burkitt is a lecturer in Developmental Psychology with The Open University \nand has a keen interest in the development of children’s understanding of, and \nexpression through, drawing and a keen interest in research methodologies in this area.  \n \nProf Martyn Barrett is a Professor of Developmental Psychology at the University of \nSurrey. One of his many interests is in the development of children's drawings, in \nparticular, the cognitive processes underlying drawing production and in the expression \nof emotions and feelings in children’s drawings. \nDr Alison Davis is currently a Reader in Psychology with The University of Surrey. Her \nmain interests lie within Experimental Developmental Psychology, young children's \nspatial representation and drawing and in the combined areas of children's imagination \nand pretence.  \n \nWord count: 7103 \n \n 4\nIntroduction \nIt has long been argued that children express their feelings about certain topics \nby altering specific features in their drawings of those topics (Craddick, 1961, 1963; \nHammer, 1958, 1997; Koppitz, 1964, 1968; Machover, 1949). More specifically, it has \nbeen argued that these alterations vary depending on whether the children regard the \ntopics positively or negatively (Fox & Thomas, 1990; Thomas, Chaigne & Fox, 1989). \nEarly research suggested that children often increase the size of positive topics \n(Craddick, 1961) and reduce the size of negative topics in their drawings (Craddick, \n1963; Koppitz, 1966; Machover, 1949), and that colouring is also used by children in \ntheir drawings to differentiate between depictions of positive vs. negative topics \n(Alschuler & Hattwick, 1943, 1947; Arnheim, 1956, 1974; Golomb, 1981; Hammer, \n1953, 1997). However, the majority of these claims have been based either upon \nexperiments with poor methodological controls, or were derived from single case \nstudies in which there were no independent assessments of the affective connotations of \nthe topics being drawn (see Burkitt, Barrett & Davis, 2003a, 2003b for an extended \ndiscussion of these problems).  \nHowever, in a series of recent experiments, Burkitt et al. (2003a, 2003b, 2004) \nemployed both rigorous experimental controls and independent manipulations and \nassessments of the affective connotations of drawn topics. They found that there were \nsystematic differences in the drawings of 4-11-year-old children when the topics which \nwere being drawn were characterised as “nice” vs. “nasty”. In particular, an increase in \nsize was found to occur when topics were characterised as “nice”. Furthermore, this \neffect occurred not only in a drawing task where a model was provided for the children \nto copy (Burkitt et al., 2004), but also in a drawing task in which the children were \n \n 5\nasked to draw the “nice” topic in the absence of any model (Burkitt et al., 2004). \nHowever, topics characterised as “nasty” were not always scaled down in size in these \ntwo studies. Burkitt et al. (2003a) also found that 4-11-year-old children use their most \npreferred colours for colouring in “nice” topics, their least preferred colours for \ncolouring in “nasty” topics, and colours rated intermediately for neutral topics. Black \ntended to be the most frequently chosen colour for “nasty” topics. By contrast, primary \ncolours were predominantly selected for neutral topics, while a wide range of mainly \nprimary and secondary colours were chosen for colouring in topics characterised as \n“nice”.  \nHowever, the particular terms which were used through this sequence of \nexperiments were restricted to a single pair of positive and negative terms in the main, \nnamely “nice” and “nasty” with the exception of one study which examined topic \nspecificity and children’s use of colour (Burkitt & Newell, 2005). The question \ntherefore arises as to whether the children in the majority of past experiments were \nresponding to the specific terms “nice” and nasty”, or whether the pattern of responding \nwhich was displayed is indicative of a more general tendency to respond differentially \nin their drawings to any positive vs. negative affective characterisation of the topics \nbeing drawn. The present experiment used the terms “happy” and “sad”, as used in a \nrelated project (Burkitt & Newell, 2005), as a comparison pair to “nice” and “nasty” in \norder to explore this issue. Because the characteristics of “nice” and “nasty” typically \nrelate to the perception by other people of the depicted figure, whereas the \ncharacteristics of “happy” and “sad” relate more to the internal affect state of the figures \nthemselves (as expressed through external signals such as facial expressions), it was \njudged that this direct comparison would provide an especially robust test of the \n \n 6\nprediction that similar size and colouring effects may occur with any pair of positive vs. \nnegative terms. The use of “happy” and “sad” in the present study was further motivated \nby the additional consideration that these are particularly important terms to explore \nfrom a clinical perspective, given their possible utility in the identification and \nmeasurement of childhood depression (cf. Herbert, 1998; Kazdin, 1990).  \nProfessionals continue to use and interpret children’s drawings and art work in a \nvariety of settings for various purposes, and the need to develop rigorous research \nmethodologies to assess emotional aspects of children’s drawings is currently \nrecognised (Burkitt & Newell, 2005; Hammer, 1997; Hunsley, Lee, & Wood, 2003). \nDrawings are often viewed a means to facilitate emotional expression and \ncommunication and are often interpreted in their own right for signs of the artist’s \nemotional adjustment (Hammer, 1997; Silver, & Carrion, 1991). The proposed research \nwas therefore partly motivated to expand upon existing research by systematically \nassessing possible differences in children’s drawings arising from the particular \nemotions in question in a specific drawing context. \nPrevious research into children’s recognition of human facial expressions of \nemotion has found that such recognition improves substantially with age (e.g. Beck & \nFeldman, 1989; Camras & Allison, 1985; Walden & Field, 1982). However, less \nattention has been given to children’s graphic depictions of emotional expressions such \nas “happy” and “sad”. The studies that have been conducted exploring drawing \nproduction suggest that primary school children possess a restricted graphic repertoire \nfor representing emotional facial expressions. Golomb (1992) studied children’s \nfreehand drawings of “happy”, “sad” and “angry” children, and found that children \nmodified mouths more easily than eyebrows to depict emotions, with younger children \n \n 7\nexperiencing difficulty in using oblique lines to depict eyebrows on “angry” faces. In \naddition, it has been found that children’s ability to produce and decode facial emotions \n(of happiness, sadness, fear and disgust) in their own drawings improves with age, and \nthat children are better at decoding their own drawings of “happy” and “sad”, rather \nthan “fearful” and “disgusted”, faces (Lakshman & Whissell, 1991). Sayil (1996) \ninvestigated 4-6-year-old children’s production and recognition of “happy”, “sad”, \n“surprised” and “angry” faces using facial completion drawing tasks, matched-\ndiscrimination tasks, and forced-choice labelling tasks. She found that whilst young \nchildren could recognise the range of emotions in the matched-discrimination tasks, \nthey were unable to differentiate emotional facial features within their own drawings. \nThis ability was observed to improve with age. Children were more successful at \ndrawing “happy” and “sad” faces compared with “angry” and “surprised” faces in their \nfreehand drawings. A comparable study with older primary school children (Sayil, \n1998) revealed that all age groups from grades 1 to 5 could draw “happy” features on \npre-drawn face outlines, with the ability to produce “sad”, “angry” and “surprised” \nfaces developing more slowly with age. It should be noted that Sayil’s studies examined \nfacial expressions, not the depiction of the entire figure (unlike the present study). \nChildren’s ability to produce “happy” and “sad” human figures has been \nextended to other topics. Ives (1984) asked children aged 4 to 16 years to draw “happy”, \n“sad”, “angry”, “quiet”, “loud” and “hard” trees and lines. The drawings were \ncategorised according to the use of literal, abstract and content strategies, and it was \nfound that younger children employed more literal features, such as drawing tears on \ntrees to represent sadness, whilst the older children adopted abstract strategies, such as \ndownward lines to indicate sad trees. This trend was replicated by Winston, Kenyon, \n \n 8\nStewardson & Lepine (1995), who found that the quality and quantity of expressive \nstrategies when drawing emotive scenes, such as representing themes of ageing, \ndeveloped with age. The relationship between children’s metaphorical awareness and \nability to produce abstract metaphorical symbols to express mood has been well \ndocumented (e.g. Carothers & Gardner, 1979; Jolley & Thomas, 1995; Jolley, Zhi & \nThomas, 1998). These studies indicate that whilst children can understand metaphorical \nexpressive features in drawings, they are more likely to represent mood using literal \nproperties in their own drawings. \n In contrast to these previous studies, the present study was designed to explore \nwhether children use size and colour in their drawings systematically to differentiate \nbetween “happy” and “sad” figures in a similar way to how they use these features to \ndifferentiate between “nice” and “nasty” figures in their drawings.  \n \nMethod \nParticipants \n102 children (53 boys and 49 girls) aged between 4 years 3 months and 7 years 6 \nmonths participated in the experiment. The children were divided into two age groups, \nand the children within each age group were randomly allocated to one of two condition \ngroups, either a nice\/nasty group (henceforward NN) or a happy\/sad group \n(henceforward HS). The mean age of the young age group (N = 51) was 5 years 1 \nmonth (range: 4 years 3 months to 5 years 11 months) while the mean age of the old age \ngroup (N = 51) was 6 years 9 months (range: 6 years 0 months to 7 years 6 months).  \n \nMaterials \n \n 9\n10 colour cards (red, orange, yellow, green, blue, purple, pink, white, brown and \nblack), 10 crayons of the same selection of colours as the cards, A4 plain white paper, \nand lead pencils were used. A five-point smiley-face Likert scale (showing faces with \nvery unhappy, unhappy, neither unhappy nor happy, happy, and very happy \nexpressions) was used to gather affect ratings towards each individual colour in Session \n1, and to gather affect ratings towards the completed drawings in Session 2.  \n \nProcedure \n All children completed two test sessions. The two sessions were presented in \ncounterbalanced order to control for possible order effects. Children were seen \nindividually in a quiet area of their school for both sessions, which were always \nconducted on two successive days. \n \nSession 1 \nIn Session 1, all children completed a colour preference task. The children were \nshown the ten colour cards in a random order. As each colour was presented, they were \nasked to rate how the colour made them feel, using the 5-point Likert scale. Responses \nwere scored between 1 and 5, with 1 = “very unhappy” and 5 = “very happy”. The \ninstructions were as follows: “I would like to find out how you feel about this colour. \nWhat I’d like you to do is point to the face to show how you feel about the colour. Here \nare the faces that you are going to be looking at (pointing to each face). The first one is \na very unhappy face; the next one is quite an unhappy face; the middle one is neither \nhappy nor unhappy. The fourth face is quite a happy face and the last one is a very \nhappy face. When you answer my question, I’d like you to point to the face that \n \n 10\ndescribes how you feel about the colour. OK?” The instructions were repeated in full if \nthe child indicated that they had not understood. Few children required additional \nprompting. \n \nSession 2 \n In session 2, children drew three pictures of a man. All children first drew a \nbaseline, affectively uncharacterised, figure. They then drew two affectively \ncharacterised figures in counterbalanced order; children in the NN group drew a “nice” \nand a “nasty” figure, while children in the HS group drew a “happy” and a “sad” figure. \nImmediately after drawing each individual figure, the child was asked to rate how \nhe\/she felt about the drawn figure by pointing to the appropriate face on the Likert \nscale. Responses were again scored between 1 and 5, with 1 = “very unhappy” and 5 = \n“very happy”. The drawing was then removed, and the child was given a fresh sheet of \nA4 paper for the production of the next drawing. The same range of crayons and the \npencil were left in place throughout the session. \nChildren in both groups were asked to draw a baseline, neutrally characterised, \nfigure using the following instructions: “I’d like you to draw a man. Use the pencil to \ndraw him, and just one of these colours to colour him in. Draw the whole man as well \nas you can and colour him in as well as you can”. \n Children in the NN group were then asked to draw a nice and a nasty figure (in \ncounterbalanced order), using the following instructions. Nice figure: “Now, think of a \nman who is a very kind nice man, and who is very pleasant and friendly to everyone. \nDraw the man, remembering what a nice person he is.  Use the pencil to draw him, and \njust one of these colours to colour him in. Draw the whole man as well as you can and \n \n 11\ncolour him in as well as you can.” Nasty figure: “Now, think of a man who is a very \nnasty horrible man who is very mean and unfriendly to everyone. Draw the man, \nremembering what a nasty man he is. Use the pencil to draw him, and just one of these \ncolours to colour him in. Draw the whole man as well as you can and colour him in as \nwell as you can”. \n Children in the HS group were asked to draw a happy and a sad figure (in \ncounterbalanced order), using the following instructions. Happy figure: “Now, think of \na man who is a very very happy man, and who is very pleasant and friendly to everyone. \nDraw the man, remembering what a happy person he is. Use the pencil to draw him, \nand just one of these colours to colour him in. Draw the whole man as well as you can \nand colour him in as well as you can”. Sad figure: “Now, think of a man who is a very \nvery sad man, and who is very mean and unfriendly to everyone. Draw the man, \nremembering what a sad man he is. Use the pencil to draw him, and just one of these \ncolours to colour him in. Draw the whole man as well as you can and colour him in as \nwell as you can”. \n \nDrawing ability \nDuring the test period, class teachers were asked to rate each child’s drawing \nability relative to a typical year group member’s ability using the following question: \n“Thinking of a typical Year {Year group of child}, please rate {child’s name} drawing \nability on the following scale: poor (1), below average (2), average (3), above average \n(4), good (5).” \n \nMeasurements \n \n 12\nThe height of each drawing was measured as the vertical distance from the top \nto the lowest extremity of the outlines drawn in lead pencil. Width was measured as the \nhorizontal distance between the farthest left and right extremities of the lead pencil \noutline of the figure. Surface area was measured using 0.5 centimetre squares. Squares \nwith greater than 50% covered were included, and squares with less than 50% coverage \nwere excluded. A second judge measured the surface area of all of the drawings from \neach age group. 97% inter-judge reliability was obtained. Discrepancies were resolved \nby recounting by both judges, and all drawings were included in the analysis. \n \nResults \nAll children successfully completed the range of tasks. Drawing ability was first \nanalysed using a 2 (age group) x 2 (NN vs. HS) ANOVA, and no main or interaction \neffects were found. This variable was therefore excluded from further analysis. The data \nwere also screened for potential order of counterbalancing effects, and none were found. \nThus, order of counterbalancing was also excluded from the following analyses.   \n \nSurface area \n**INSERT TABLE 1 ABOUT HERE** \nA 2 (age group) x 2 (NN vs. HS) x 3 (drawing type: baseline vs. positive vs. \nnegative) three-way mixed ANOVA was conducted on surface area scores, with \ndrawing type entered as the repeated measure, and independent groups on the other two \nfactors. A main effect was found for drawing type (F(2,196)=16.36, p<0.01), with high \npower and a large effect size (P=1.00, eta2 = 0.14). Post hoc paired t-tests (p<0.05) on \nthe means in Table 1 revealed that the positive drawings were larger than both the \n \n 13\nbaseline and negative drawings, and that the negative drawings were also larger than the \nbaseline drawings. However, an interaction effect was also found between drawing type \nand group (F(2,196)=5.32, p<0.05). High power was observed for this large effect (P= \n0.84, eta2 = 0.15) Post hoc paired and independent t-tests (p<0.05) revealed that the NN \ngroup drew both “nice” and “nasty” men larger than baseline men, whereas the HS \ngroup drew the “happy” men larger than the baseline men, and drew the “happy” men \nlarger than the “sad” men. There was no significant difference between baseline \ndrawing surface area between the two groups. A main effect was also found for group \n(F(1,98)=15.80, p<0.01), with the NN group drawing larger men than the HS group \noverall. Observed power was high for this large effect (P= 0.98, eta2 = 0.14). No other \nsignificant effects were found. \n \nHeight \nA 2 (age group) x 2 (NN vs. HS) x 3 (drawing type) three-way mixed ANOVA \nwas also conducted on the height scores. A main effect was found for drawing type \n(F(2,196)=20.42, p<0.01). High observed power was seen for this large effect (P=1.00, \neta2 = 0.18). Post hoc paired t-tests (p<0.05) indicated that positive drawings (M = \n15.38, SD = 6.89) were taller than both the baseline (M = 10.96, SD = 5.61) and the \nnegative (M = 13.25, SD = 6.88) drawings, and negative drawings were taller than the \nbaseline drawings. No further main or interaction effects were found. \n \nWidth \n A 2 (age group) x 2 (NN vs. HS) x 3 (drawing type) three-way mixed \nANOVA was conducted on the width scores. A main effect was found for drawing type \n \n 14\n(F(2,196)=22.14, p<0.01), with a small effect size with high observed power (P=1.00, \neta2 = 0.02). Post hoc paired t-tests (p<0.05) revealed that the positive drawings (M = \n9.38, SD = 4.28) were wider than both the baseline (M = 6.69, SD = 3.69) and negative \n(M = 7.95, SD = 4.72) drawings, and that the negative drawings were wider than the \nbaseline drawings. A main effect was also found for age group (F(1,98)=4.40, p<0.05), \nwith high power and a small effect size (P=1.00, eta2 = 0.03). The younger age group \n(M = 8.50, SD = 3.76) produced wider drawings than the older age group (M = 7.52, SD \n= 3.20). No other significant effects were found. \n \nAffect towards neutrally, positively and negatively characterised figures \n**INSERT TABLE 2 ABOUT HERE** \nThe affect ratings from the Likert scale towards the three drawn figures that \nwere produced in Session 2 were examined to investigate whether the children had \nassigned different affect to the differently characterised figures. A 2 (age group) x 2 \n(NN vs. HS) x 3 (drawing type) three-way mixed ANOVA revealed a main effect of \ndrawing type (F(2,196)=372.07, p<0.01). The effect size was large with high power \n(P=1.00, eta2 = 0.80) Post hoc paired t-tests (p<0.05) on the means shown in Table 2 \nrevealed that the positive drawings were given more positive ratings than both the \nbaseline and negative drawings, and the baseline drawings were given more positive \nratings than the negative drawings. Hence, the children did indeed rate the figures as \nanticipated, in the expected directions. \nIn addition, a main effect of NN vs. HS was also found (F(1,98)=14.91, p<0.01), \nwith the NN group giving more positive ratings than the HS group overall. The effect \nsize was moderate with high observed power (P=0.97, eta2 = 0.13). However, this effect \n \n 15\nwas qualified by a significant interaction between drawing type and NN vs. HS \n(F(2,188)=5.97, p<0.05), with a moderate effect size and high observed power (P=0.91, \neta2 = 0.07). Post hoc independent t-tests (p<0.05) showed that the NN group rated the \nbaseline drawings more positively than the HS group, whereas there were no significant \ndifferences in the NN and HS groups’ ratings of the positive and negative figures (see \nTable 2). \n \nAffect towards the colours chosen for the three drawing types \nThe ratings from the Likert scale gathered in Session 1 towards the particular \ncolours which the children had used to complete the three drawings in Session 2 were \nused to explore whether the children had systematically used differentially liked colours \nfor the three different drawing types. A 2 (age group) x 2 (NN vs. HS) x 3 (drawing \ntype) three-way mixed ANOVA revealed a main effect of drawing type \n(F(2,188)=74.30, p<0.01). The effect was large with high observed power (P=1.00, eta2 \n= 0.44). Post hoc paired t-tests (p<0.05) revealed that the children had assigned more \npositive ratings to the colours used for the positive drawings (M = 4.51, SD = 1.01) than \nthose used for the baseline (M = 3.78, SD = 1.30) and negative (M = 2.51, SD = 1.58) \ndrawings, and had assigned more positive ratings to the colours used for the baseline \ndrawings than those used for the negative drawings. A main effect was also found for \nNN vs. HS (F(1,94)=6.81, p<0.05), with a moderate effect size and fairly high observed \npower  (P=0.77, eta2= 0.07). The HS group (M = 3.77, SD = 0.79) gave more positive \naffect ratings to the colours which had been used in their drawings than the NN group \n(M = 3.28, SD = 0.97) overall. No other main or interaction effects were found. \n \n \n 16\nChildren’s colour choices for the three drawing tasks \nFrequency counts of the specific colours which had been used for the three \ndrawing types (baseline, positive and negative) were made. These frequencies were \nanalysed using correspondence analysis, in order to explore the specific colours which \nhad been used for the different drawings by different subgroups. Correspondence \nanalysis (Hammond, 1988, 1993) uses geometric principles to provide a pictorial \nrepresentation of the relationship between categories of response and groups of \nindividuals. It permits a multi-dimensional analysis of categorical data by providing a \nplot in which the geometric distance between the groups and the types of response gives \na direct measure of the relative degree of association between the groups and the \nresponse types. These plots therefore reveal those colour choices which are most closely \nassociated with each individual subgroup (be this drawing type, NN vs. HS, or age \ngroup) and which therefore best discriminate the behaviour of the children within each \nsubgroup. \nA series of individual correspondence analyses was run. Colours with a response \nfrequency count of less than 5 were not included in these analyses to avoid the results \nbeing biased by these low frequency responses (Hammond, 1988). In the first set of \nanalyses, the particular colours which had been used for the three drawing types were \nanalysed for the NN and HS groups separately. In the second set of analyses, the \ncolours that had been used by the NN vs. HS groups were analysed for each individual \ndrawing type separately (to directly compare the colour choices made by the two groups \nof children on each type of drawing). Finally, the colour choices of the younger age \ngroup were compared with those of the older age group; however, this third set of \nanalyses failed to reveal any significant associations with age. \n \n 17\n**INSERT PLOTS 1, 2 AND 3 ABOUT HERE** \nPlot 1: Colour choices for each drawing type by the NN group  \n The colour choices of the children in the NN group were analysed across \ndrawing type, and one significant dimension was found (χ2(8)=19.48, p<0.01). Plot 1 \nshows that blue, yellow, pink, red and purple were more closely associated with the \nbaseline and “nice” men than with the “nasty” men, and black and brown were more \nclosely associated with the “nasty” men rather than with the baseline or “nice” men. \n \nPlot 2: Colour choices for each drawing type by the HS group  \n Two significant dimensions were found for the colour choices of the children in \nthe HS group (χ2(10)=29.02, p<0.01; χ2(8)=15.75, p<0.05). Red, pink and green were \nmost closely associated with baseline drawings; orange, purple and yellow were most \nclosely associated with the “happy” drawings; and black was most closely associated \nwith the “sad” drawings (see Plot 2).  \n \nPlot 3: Colour choices for the negative figures by the NN vs. HS groups  \n Analyses were also run on each drawing type individually, directly comparing \nthe NN and HS colour choices for each type. No significant differences emerged \nbetween the two groups on the colours that had been used for the baseline and positive \ndrawing types. However, for the negative figures, two significant dimensions were \nfound (χ2(10)=35.65, p<0.01; χ2(8)=16.95, p<0.05). Plot 3 reveals that black was more \nclosely associated with the NN group than with the HS group, and red and purple were \nmore closely associated with the HS group. \n \n \n 18\nDiscussion \nSize \nThis study shows that the particular emotion terms used to describe a human \nfigure (“nice” vs. “happy”, “nasty” vs. “sad”), as well as the valence of the affective \ncharacterisation (i.e. positive vs. negative), can influence the size of children’s human \nfigure drawings. Children drawing “nice” and “happy” men systematically drew larger \nfigures than those drawing “nasty” and “sad” men. However, in addition, children \ndrawing “nice” and “nasty” men (NN group) produced larger drawings overall than the \nchildren producing “happy” and “sad” men (HS group). It should be noted that a \nsupplementary content analysis of the children’s use of additional details to depict the \ncharacteristics of the figures in their drawings did not reveal any group differences. \nHence, the differential sizes of the four types of figure were not attributable to the \ninclusion of a greater number of details in the larger figures (Freeman, 1980).  \nIt might be argued that children drawing the “nice” and “nasty” men exhibited \nmore positive affect overall towards their three drawings than the children drawing the \n“happy” and “sad” men, and this could therefore be the factor responsible for the \ndifferential figure sizes between the two groups. However, although children in the NN \ngroup did indeed exhibit higher positive affect towards the figures than the HS group \noverall, this trend was primarily due to the differential levels of affect displayed towards \nthe baseline figures across the two groups, rather than the levels of affect which were \ndisplayed towards the affectively characterised figures (see Table 2). Hence it is \nunlikely that differential levels of affect were responsible for the dramatically larger \nsizes of the “nice” and “nasty” figures compared with the “happy” and “sad” figures \n(see Table 1). \n \n 19\nAn alternative possible explanation of the much larger size of the drawings \nproduced by the NN group is that children are better able to depict the characteristics of \n“happy” and “sad” than the characteristics of “nice” and “nasty” because they have \nbetter developed planning and motor skills for graphically representing the former pair. \nIt is known that children are more successful with encoding “happy” and “sad” in their \ndrawings than other less basic emotions such as “anger” and “disgust” (Golomb, 1992; \nIves, 1984; Sayil, 1996, 1998). Hence, the differential sizes used for “happy” and “sad” \nvs. “nice” and “nasty” might reflect differences in the children’s ability to graphically \nencode and produce these two different sets of characterisations (Cleeve & Bradbury, \n1992; Fox & Thomas, 1990; Jolley, 1995; Thomas et al., 1989). In other words, children \nmay be more familiar with drawing “happy” and “sad” figures than “nice” and “nasty” \nfigures, the former therefore relying on better-rehearsed drawing schemata.  \nThat said, for both groups of children (and consistent with previous research, \ne.g. Burkitt et al., in press, submitted; Thomas et al., 1989), positively characterised \nfigures were drawn larger, wider and taller than baseline figures, whereas negatively \ncharacterised figures were not reduced in size from baseline figure size. This study \ntherefore provides further empirical support for the generalisability of the previously \ndocumented size effects across an additional set of positive and negative terms. This is \nin addition to our knowledge that these effects also occur across different drawing \ntopics (Burkitt et al. (2003a, 2003b, 2004) found that these effects occur not only in \nchildren’s human figure drawing but also in their drawings of dogs and trees). \nFurthermore, these findings once again confirm that size effects are more consistent for \npositively characterised figures than for negatively characterised figures, with positively \n \n 20\ncharacterised men consistently being increased in size from baseline drawing size, and \nnegatively characterised men not always being reduced from baseline drawing size.  \nAlso in line with previous findings, few age differences were uncovered in the \npresent study. The only age effect that was found consisted of the younger children \nproducing wider drawings overall than the older children (which in itself is not \nsurprising, given the literature attesting to children human figure drawing becoming \nsmaller with age due to increased planning and motor skills: see Cox, 1992; Freeman, \n1980). Presumably comparable age effects did not occur with surface area and height \nbecause of the tightly constrained experimental conditions which were employed in this \nstudy. \nThis study also shows that children’s sensitivity to the demand to portray a \nbinary contrast specified in the verbal instructions is not, on its own, a sufficient \nexplanation of why size effects occur in children’s drawings. While some aspects of \nchildren’s drawings may indeed be influenced merely by the provision of a single \ncontrast (Cox, 1981, 1985; Chen & Holman, 1989; Davis, 1983, 1985a, 1985b; Lewis, \nRussell & Berridge, 1993), the present study clearly shows that the children marked \n“nice” and “happy” differently in their drawings, and “nasty” and “sad” differently, \nimplying that they were responding on the basis of the specific emotion terms provided, \nnot merely to the provision of a binary contrast per se.  \nIn considering whether children might be responding to the positive and \nnegative characterisations on the basis of an acquired pictorial convention or an \nappetitive-defensive mechanism (see Burkitt et al., 2004, for a discussion of these two \npossibilities), it would appear that the data do not actually support either of these two \ninterpretations. If children were operating using a pictorial convention that “nice” \n \n 21\nfigures should be drawn larger than “nasty” figures, then age differences would have \nbeen expected as a consequence of the progressive acquisition of this convention with \nage (unless the acquisition process itself is complete by the age of four, which is not \nvery plausible); however, no such age effects were found. Alternatively, if an \nappetitive-defensive mechanism were to be responsible for these effects, then it would \nbe predicted that “nasty” drawings would be drawn smaller than “sad” drawings, as \nnastiness signals a greater level of potential threat than sadness. However, this effect \nwas also not found. Hence, while size changes clearly do occur in children’s drawings, \nthe present set of findings does not actually support either of the two existing theories \nwhich have been proposed to explain these effects. \n \nColour \nChildren in both the NN and the HS groups affectively rated the colours which \nthey used in their positive drawings more positively than the colours which they used in \ntheir baseline drawings, and the colours used in their baseline drawings more positively \nthan the colours used in their negative drawings. There was no evidence of any age-\nrelated trends in children’s use of colour in this study. All of these findings are \nconsistent with previous findings (Burkitt et al., 2003a, 2003b, 2004; Burkitt & Newell, \n2005), but additionally demonstrate the reliability of recent claims that colour effects do \nnot only occur with the terms “nice” and “nasty” (Burkitt & Newell, 2005). \nExamination of the particular colours which children chose for the three drawing \ntypes revealed differences between the two groups. For the NN group, blue, yellow, \npink, red and purple were associated with the baseline and “nice” drawings, and black \nand brown for the “nasty” drawings. However, for the HS group, children’s colour \n \n 22\nchoices for baseline and “happy” men were more clearly discriminated from each other. \nRed, pink and green were more closely associated with the baseline rather than the \n“happy” figure. Orange, purple and yellow were associated with the “happy” drawings. \nThis is consistent with trends noted in previous studies (e.g. Alschuler & Hattwick, \n1943, 1947; Brick, 1944; Winston et al., 1995). It could be that the use of “happy” as \nopposed to “nice” for the positive emotion term inspired a more discriminating response \nof colour associations from baseline colour choices. One possible explanation for this \neffect is that children are more familiar with the terms of “happy” and “sad” being \napplied to colours than the terms of “nice” and “nasty”. These effects have been found \nwhen children are not restricted to using only symbolic colours (Winston et al., 1995), \nimplying that even young children are indeed sensitive to the symbolic associations of \ncolours.  \nBlack was the principal colour used for the drawings of “sad” men, and black \nand brown for the “nasty” men. In other words, this study confirmed that children do \ntend to use darker colours for negative topics (as previously found by Burkitt et al., \n2003) and these darker colours are typically rated as the children’s least preferred \ncolours overall. It has frequently been argued in the clinical literature that darker \ncolours tend to be used to a greater extent by individuals who are less well emotionally \nadjusted, and for the depiction of negative topics (Alschuler & Hattwick, 1943, 1947; \nBrick, 1944; Miljkovitch de Heredia & Miljkovitch, 1998; Waehner, 1946). The present \nstudy provides further support for the idea that black and brown are indeed more closely \nassociated with the depiction of negative topics.  \nOnce again, it is not entirely clear why children come to associate different \ncolours with positive or negative topics. One possibility is that children acquire these \n \n 23\nassociations from the pictorial conventions which are used in colouring books and other \nmedia. This explanation has been suggested as the mechanism which is responsible for \nchildren’s associations of particular colours with facial expressions of emotions \n(Zentner, 2001). The same explanation might also account for why children come to use \ncolours differentially when drawing emotion-eliciting topics.  \nWhilst the specific context of the production of the drawings in the present study \nneeds to be borne in mind when assessing the generalisability of the present findings, \nthe present research does suggest that children display a graphic flexibility when \ndepicting specific positive and negative emotions. The applied value of this work would \nbe enhanced by gathering drawings in more naturalistic clinical and therapeutic settings \nwhere different emotions may be influential in shaping the specific features and formal \nproperties of children’s drawings. The features of the present research design could be \neasily modified for such applied research. \n In conclusion, this study has shown that children used both size and colour \ndifferentially in their drawings to represent positively and negatively characterised \ntopics. These effects occur not only occur with the terms “nice” and “nasty”, but also \nwith the terms “happy” and “sad”. However, these effects do differ depending upon the \nprecise terms which are used. Future studies will need to investigate the impact of other \nsets of contrasting emotion terms, and will also need to assess children’s use of colour \ncombinations, given that in the present and previous studies the children have been \nlimited to using just a single colour. Further manipulations of the specific positive and \nnegative terms which are used, in conjunction with the use of multiple colours, could be \nan especially interesting avenue to explore, especially if the findings are to be of \n \n 24\nrelevance to the clinical assessment of the child in situations where colour use may not \nbe restricted to the use of a single colour. \n \n 25\n \nReferences \n \nAlschuler, R., & Hattwick, L. A. (1943). Easel painting as an index of personality in \npre-school children. Journal of Orthopsychiatry, 13, 616-625. \n \nAlschuler, R., & Hattwick, L. A. (1947). Painting and Personality. Volumes I and II. \nChicago: The University of  Chicago Press. \n \nArnheim, R. (1956). Art and Visual Perception: A Psychology of the Creative Eye. \nLondon: Faber & Faber. \nArnheim, R. (1974). Art and Visual Perception: A Psychology of the Creative Eye. The \nNew Version. Berkeley, CA: University of California Press. \n \nBeck, L. & Feldman, R. S. (1989). Enhancing children’s decoding of facial expression. \nJournal of Nonverbal Behavior, 13, 269-278. \n \nBrick, M. (1944). The mental hygiene value of children’s art work. American Journal of \nOrthopsychiatry, 14, 136-146. \n \nBurkitt, E., Barrett, M. & Davis, A. (2003a). Children’s colour choices for completing \ndrawings of affectively characterised topics. Journal of Child Psychology and \nPsychiatry, 44, 3, 445-455. \n \n 26\n \nBurkitt, E., Barrett, M. & Davis, A. (2003b). The effect of affective characterisations on \nthe size of children’s drawings. British Journal of Developmental Psychology, 21, 565-\n584. \n \nBurkitt, E., Barrett, M. & Davis, A. (2004). The effects of affective characterisations on \nthe use of size and colour in drawings produced by children in the absence of a model. \nEducational Psychology, 24, 3, 315-343. \n \nBurkitt, E. & Newell, T. (2005). The impact of topic specificity on children’s depiction \nof emotional traits. International Journal of Art Therapy: Inscape, 10, 1, 15-22 \n \nCamras, L. & Allison, K. (1985). Children’s understanding of facial expressions and \nverbal labels. Journal of Nonverbal Behavior, 9, 84-94. \nCarothers, T. & Gardner, H. (1979). When children’s drawings become art: The \nemergence of aesthetic production and perception. Developmental Psychology, 15, 570-\n580. \n \nChen, M. J. & Holman, J. (1989). Emergence of drawing devices for total and partial \nocclusions: A longitudinal study. Perception, 18, 445-455. \n \nCleeve, H. & Bradbury, R. J. (1992). Children’s productions and judgements of \ndrawings of people of different importance. Poster presented at the 5th European \nConference  of Developmental Psychology, Seville, September. \n \n 27\n \nCox, M. (1981). One thing behind another: Problems of representation in children’s \ndrawings. Educational Psychology, 1, 275-287. \nCox, M. (1985). One object behind another: Young children’s use of array-specific or \nview-specific representation. In N. H. Freeman & M. V. Cox (Eds.), Visual Order: The \nNature and Development of Pictorial Representation, pp. 188-200. Cambridge: \nCambridge University Press. \nCox, M. (1992). Children’s Drawings. Harmondsworth: Penguin. \n \nCraddick, R. (1961). Size of Santa Claus drawings as a function of time before and after \nChristmas. Journal of Psychological Studies, 12, 121-125. \nCraddick, R. A. (1963). Size of Hallowe’en witch drawings prior to, on and after \nHallowe’en. Perceptual and Motor Skills, 16, 235-238. \nDavis, A. (1983). Contextual sensitivity in young children’s drawings. Journal of \nExperimental Child Psychology, 35, 478-486. \nDavis, A. (1985a). Conflict between canonicality and array-specificity in young \nchildren’s drawings. British Journal of Developmental Psychology, 3, 363-372. \nDavis, A. (1985b). The canonical bias: young children’s drawings of familiar objects. In \nN. H. Freeman & M. V. Cox (Eds.), Visual Order: The Nature and Development of \nPictorial Representation, pp. 202-213. Cambridge: Cambridge University Press. \nFox, T. & Thomas, G. (1990). Children’s drawings of an anxiety-eliciting topic: Effect \non size of the drawing. British Journal of Clinical Psychology, 29, 71-81. \n \n 28\nFreeman, N. H. (1980). Strategies of Representation in Young Children: Analysis of \nSpatial Skills and Drawing Processes. London: Academic Press. \nGolomb, C. (1981). Representation and reality: The origins and determinants of young \nchildren’s drawings. Review of Research in Visual Art Education, 14, 36-48. \nGolomb, C. (1992). The Child’s Creation of a Pictorial World. Berkeley: University of \nCalifornia Press. \nHammer, E. (1953). Frustration-aggression hypothesis extended to socio-racial areas: \nComparison of Negro and white children’s H-T-P’s. Psychiatric Quarterly, 27, 597-\n607. \nHammer, E. (1958). The Clinical Application of Projective Drawings. Springfield, Ills.: \nC. C. Thomas. \nHammer, E. (1997). Advances in Projective Drawing Interpretation. Springfield, Ills.: \nC. C. Thomas. \nHerbert, M. (1998). Clinical Child Psychology: Social Learning, Development and \nBehaviour (2nd edition). Chichester: John Wiley. \nHunsley, J., Lee, C. M., & Wood, J. M. (2003). Controversial and questionable \nassessment techniques. In S. O. Lilienfeld, S.J. Lynn & J. M. Lohr (Eds.), Science and \nPseudoscience in Clinical Psychology (pp. 39-76). New York: Guilford Press. \nIves, S. (1984). The development of expressivity in drawing. British Journal of \nEducational Psychology, 54, 152-159. \n \n 29\nJolley, R. (1995). Children’s production and perception of visual metaphors for mood \nand emotion in line drawings and in art. Unpublished doctoral thesis. University of \nBirmingham, Birmingham. \nJolley, R. & Thomas, G. (1995). Children’s sensitivity to metaphorical expression of \nmood in line drawings. British Journal of Developmental Psychology, 13, 335-346. \nJolley, R., Zhi, Z. & Thomas, G. (1998). The development of understanding of moods \nmetaphorically expressed in pictures: A cross-cultural comparison. Journal of Cross-\nCultural Psychology, 29, 358-376. \nKazdin, A.E. (1990). Childhood depression. Journal of Child Psychology and \nPsychiatry, 31, 121-160. \nKoppitz, E. M. (1966). Emotional indicators on human figure drawings of shy and \naggressive children. Journal of Clinical Psychology, 22, 466-469. \nKoppitz, E. M. (1968). Psychological Evaluation of Children’s Human Figure \nDrawings. London: Grune  and Stratton. \nLakshman, M. & Whissell, C. (1991). Children’s understanding of facial expression of \nemotion II. Drawing of emotion faces. Perceptual and Motor Skills, 72, 1228-1230. \nLewis, C., Russell, C. & Berridge, D. (1993). When is a mug not a mug? Effects of \ncontent, naming, and instructions on children’s drawings. Journal of Experimental \nChild Psychology, 56, 291-302. \nMachover, K. (1949). Personality Projection in the Drawings of the Human Figure. \nSpringfield, IL: C. C. Thomas. \n \n 30\nMiljkovitch de Heredia, R. & Miljkovitch, I. (1998). Drawings of depressed inpatients: \nIntentional and unintentional expression of emotion states. Journal of Clinical \nPsychology, 54, 1029-1042. \nSayil, M. (1996). Preschool children’s understanding and drawing of facial expression \nof emotions. Turkish Journal of Psychology, 11, 61-71. \nSayil, M. (1998). The development of emotional facial drawings in children. Journal of \nChild and Adolescence Mental Health, 4, 129-133. \nSilver, R. A. & Carrion, F.  (1991). Using the Silver drawing test in school and hospital. \nAmerican Journal of Art Therapy, 30, 36-43 \nThomas, G., Chaigne, E. & Fox, T. (1989). Children’s drawings of topics differing in \nsignificance: Effects on size of drawing. British Journal of Developmental Psychology, \n7, 321-331. \nWaehner, T. (1946). Interpretations of spontaneous drawings and paintings. Genetic \nPsychology Monographs, 33, 70. \nWalden, T. & Field, T. (1982). Discrimination of facial expression by preschool \nchildren. Child Development, 53, 1312-1319. \nWinston, A., Kenyon, B., Stewardson, J. & Lepine, T. (1995). Children’s sensitivity to \nexpression of emotion in drawings. Visual Arts Research, 21, 1-14. \nZentner, M. (2001). Preferences for colours and colour-emotion combinations in early \nchildhood. Developmental Science, 4, 389-398. \n \n 31\n \n \n \n \n \n \n 32\nTable 1: Mean surface area (cm2) for each drawing type for each group. \n \nGroup  Drawing Type   \n Baseline Positive Negative Grand Means \nNN \n \n27.51 \n(SD=34.27) \n68.50 \n(SD=68.21) \n61.79 \n(SD=78.55) \n52.60 \n(SD=48.24) \nHS \n \n18.39 \n(SD=22.25) \n35.67 \n(SD=40.99) \n20.25 \n(SD=20.23) \n24.77 \n(SD=22.22) \nGrand Means \n \n21.61 \n(SD=27.29) \n47.25 \n(SD=54.24) \n34.91 \n(SD=52.91) \n \n \n \n 33\nTable 2: Mean affect ratings for each drawing type for each group. \n \nGroup  Drawing Type   \n Baseline Positive Negative Grand Means \nNN \n \n3.75 \n(SD=0.80) \n4.67 \n(SD=0.84) \n1.25 \n(SD=0.44) \n3.22 \n(SD=0.41) \nHS \n \n2.93 \n(SD=0.99) \n4.36 \n(SD=0.97) \n1.31 \n(SD=0.64) \n2.87 \n(SD=0.44) \nGrand Means \n \n3.23 \n(SD=1.00) \n4.47 \n(SD=0.84) \n1.29 \n(SD=0.57) \n2.99 \n(SD=0.46) \n \n \n \n \n \n 34\n \n \nPlot 1: Colour choices for each drawing type by the NN group. \n \n \n \n \n 35\n \n \nPlot 2: Colour choices for each drawing type by the HS group. \n \n \n 36\n \n \n \nPlot 3: Colour choices for the negative figures by the NN vs. HS groups. \n \n \n \n"}