{"doi":"10.1109\/SPEEDHAM.2008.4581251","coreId":"54705","oai":"oai:eprints.lincoln.ac.uk:2459","identifiers":["oai:eprints.lincoln.ac.uk:2459","10.1109\/SPEEDHAM.2008.4581251"],"title":"Integrated multilevel converter and battery management","authors":["Wilkie, K.","Stone, D.","Bingham, C.","Foster, M."],"enrichments":{"references":[{"id":1012313,"title":"A Cascaded H-Bridge BLDC Drive Incorporating Battery Management,&quot; in EPE,","authors":[],"date":"2007","doi":"10.1109\/epe.2007.4417309","raw":"[6]  K. D. Wilkie, D. A. Stone, M. P. Foster, and C. M. Bingham, &quot;A Cascaded H-Bridge BLDC Drive Incorporating Battery Management,&quot; in EPE, Aalborg, 2007.","cites":null},{"id":1012919,"title":"Charge balance control schemes for cascade multilevel converter in hybrid electric vehicles,&quot;","authors":[],"date":"2002","doi":"10.1109\/TIE.2002.803213","raw":"[8]  L. M. Tolbert, F. Z. Peng, T. Cunnyngham, and J. N. Chiasson, &quot;Charge balance control schemes for cascade multilevel converter in hybrid electric vehicles,&quot; IEEE Transactions on Industrial Electronics, vol. 49, pp. 1058-1064, 2002. 0 10 20 30 40 50 60 70 80 90 100 2-Level Converter Test Data: Ia = 15A C e l l V o l t a g e ( V ) 0 10 20 30 40 50 60 70 80 90 100 C e l l C u r r e n t ( A ) 0 10 20 30 40 50 60 70 80 90 100 0.5 0.6 0.7 0.8 0.9 E s t i m a t e d S o C Time (min) Cell A Cell B Cell C (a) 0 10 20 30 40 50 60 70 80 90 100 7-Level Converter Test Data: Ia = 15A, SoC Controlled C e l l V o l t a g e ( V ) Cell A Cell B Cell C 0 10 20 30 40 50 60 70 80 90 100 -20 -10 C e l l C u r r e n t ( A ) 0 10 20 30 40 50 60 70 80 90 100 0.5 0.6 0.7 0.8 0.9 E s t i m a t e d S o C Time (min) (b)","cites":null},{"id":1011426,"title":"Energy storage devices for future hybrid electric vehicles,&quot;","authors":[],"date":"2007","doi":"10.1016\/j.jpowsour.2006.10.090","raw":"[2]  E. Karden, S. Ploumen, B. Fricke, T. Miller, and K. Snyder, &quot;Energy storage devices for future hybrid electric vehicles,&quot; Journal of Power Sources, vol. 168, pp. 2-11, 2007.","cites":null},{"id":1011299,"title":"Failure mode of valve-regulated lead-acid batteries under high-rate partial-state-of-charge operation,&quot;","authors":[],"date":"2004","doi":"10.1016\/j.jpowsour.2003.11.048","raw":"[1]  L. T. Lam, N. P. Haigh, C. G. Phyland, and A. J. Urban, &quot;Failure mode of valve-regulated lead-acid batteries under high-rate partial-state-of-charge operation,&quot; Journal of Power Sources, vol. 133, pp. 126-134, 2004.","cites":null},{"id":1011861,"title":"Multilevel converters-a new breed of power converters,&quot;","authors":[],"date":"1996","doi":"10.1109\/28.502161","raw":"[4]  L. Jih-Sheng and P. Fang Zheng, &quot;Multilevel converters-a new breed of power converters,&quot; Industry Applications, IEEE Transactions on, vol. 32, pp. 509-517, 1996.","cites":null},{"id":1012086,"title":"Multilevel DC link inverter for brushless permanent magnet motors with very low inductance,&quot;","authors":[],"date":"2001","doi":"10.1109\/ias.2001.955549","raw":"[5]  G. J. Su and D. J. Adams, &quot;Multilevel DC link inverter for brushless permanent magnet motors with very low inductance,&quot; Chicago, IL, 2001, pp. 829-834.","cites":null},{"id":1011680,"title":"Multilevel inverters: A survey of topologies, controls, and applications,&quot;","authors":[],"date":"2002","doi":"10.1109\/tie.2002.801052","raw":"[3]  J. Rodriguez, J.-S. Lai, and F. Z. Peng, &quot;Multilevel inverters: A survey of topologies, controls, and applications,&quot; IEEE Transactions on Industrial Electronics, vol. 49, pp. 724-738, 2002.","cites":null},{"id":1012558,"title":"Observer Techniques to estimate the State of Charge of Valve Regulated Lead Acid Batteries for Hybrid Electric Vehicles,&quot;","authors":[],"date":"2005","doi":"10.1109\/epe.2005.219601","raw":"[7]  B. S. Bhangu, P. Bentley, D. A. Stone, and C. M. Bingham, &quot;Observer Techniques to estimate the State of Charge of Valve Regulated Lead Acid Batteries for Hybrid Electric Vehicles,&quot; in IEEE Proceedings Vehicle Power and Propulsion, Chicago, 2005.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-06","abstract":"A cascaded H-bridge multilevel converter is proposed as a BLDC drive incorporating real-time battery management. Intelligent H-bridges are used to monitor battery cells whilst simultaneously increasing their performance by reducing the variation between cells and controlling their discharge profiles","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54705.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2459\/1\/wilkie_3.pdf","pdfHashValue":"597a20ce60dad3ee4e71bcdaf4d529f908292f7b","publisher":"Institute of Electronic and Electrical Engineering","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2459<\/identifier><datestamp>\n      2014-08-28T09:24:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2459\/<\/dc:relation><dc:title>\n        Integrated multilevel converter and battery management<\/dc:title><dc:creator>\n        Wilkie, K.<\/dc:creator><dc:creator>\n        Stone, D.<\/dc:creator><dc:creator>\n        Bingham, C.<\/dc:creator><dc:creator>\n        Foster, M.<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        A cascaded H-bridge multilevel converter is proposed as a BLDC drive incorporating real-time battery management. Intelligent H-bridges are used to monitor battery cells whilst simultaneously increasing their performance by reducing the variation between cells and controlling their discharge profiles.<\/dc:description><dc:publisher>\n        Institute of Electronic and Electrical Engineering<\/dc:publisher><dc:date>\n        2008-06<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2459\/1\/wilkie_3.pdf<\/dc:identifier><dc:identifier>\n          Wilkie, K. and Stone, D. and Bingham, C. and Foster, M.  (2008) Integrated multilevel converter and battery management.  In: Power Electronics, Electrical Drives, Automation and Motion, 2008. SPEEDAM 2008. International Symposium on, 11-13 June 2008, Ischia, Italy.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/SPEEDHAM.2008.4581251<\/dc:relation><dc:relation>\n        10.1109\/SPEEDHAM.2008.4581251<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2459\/","http:\/\/dx.doi.org\/10.1109\/SPEEDHAM.2008.4581251","10.1109\/SPEEDHAM.2008.4581251"],"year":2008,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":" Abstract-- A cascaded H-bridge multilevel converter is \nproposed as a BLDC drive incorporating real-time battery \nmanagement. Intelligent H-bridges are used to monitor \nbattery cells whilst simultaneously increasing their \nperformance by reducing the variation between cells and \ncontrolling their discharge profiles. \n \nIndex Terms— Multilevel Systems, Motor Drives \nI.  NOMENCLATURE \nVcell (A,B,C) – Cell voltage (A, B or C) \nIcell (A,B,C) –  Cell current (A, B or C) \nSoC -   State of Charge  \nII.  INTRODUCTION \nRecent publications have considered the relative \nmerits of battery technologies and have reported that a \nkey problem with the use of lead acid batteries (the \ncurrent favoured solution on the basis of cost) as the \nmain energy store within hybrid vehicles, is that they \nare subjected to high charge and discharge rates when \nunder partial state of charge (SoC) conditions. This \nleads to sulphate build-up, cyclic wear, and ultimately, \nto failure [1, 2].  In this paper, therefore, the mitigation \nof such problems is considered using ‘intelligent \ncontrol’ techniques to better utilize the battery and, \nthereby, enhance performance and longevity. \nThis paper investigates the integration of a cascaded \nH-bridge multilevel converter with real-time battery \nmanagement to control SoC. The cascaded H-bridge \nconverter facilitates superior electrical output behaviour \nwith reduced current ripple, when compared to \ntraditional six-switch inverter solutions.  \n \nIII.  MULTILEVEL CASCADED H-BRIDGE \nThe cascaded H-bridge multilevel converter \ntopology, Fig. 1, is formed by the series connection of a \nnumber of full H-bridge converters. This topology \nnaturally isolates each battery cell facilitating battery \nmanagement, for use in applications such as the hybrid \nvehicle where isolated battery cells are available. \nEach H-bridge cell is capable of producing 0, +Vcell or \n-Vcell, with or without pulse width modulation. The \noutput of the converter is the contribution from all the \nindividual cells.  \n                                                          \nThis work was supported by the UK EPRSC via the provision of a \nresearch studentship. \nThe reduced voltage levels produce more accurately \nsynthesized output waveforms with lower harmonic \ndistortion reducing filtering requirements, and switch \nvoltage stresses. These more widely known advantages \nto the multilevel topology are reported in literature [3, \n4].   \nCurrent ripple and its minimization is an important \nfactor in traction applications, where the associated \ntorque ripple is undesirable. The reduction in voltage \nlevels reduces the voltage seen by the inductive load \nand therefore current ripple. To achieve this with the \nstandard 2-level converter would require an increase in \nswitching frequency and associated switching losses. \nThis leads to the multilevel converter being suitable for \nlow inductance machines [5], or for reducing current \nripple in standard machines [6]. \nThis paper specifically investigates the battery \nmanagement aspects afforded by isolation of the battery \nsources. \nCell A\nCell B\nCell C\nVcellA\nVcellB\nVcellC\nVo\nIo\n \nFig. 1. 7-level cascaded H-bridge \n  Integrated multilevel converter and battery \nmanagement \nK. Wilkie, D. Stone, C. Bingham, M. Foster \nUniversity of Sheffield, EEE, Mappin Street, Sheffield S1 3JD, (UK) \n \nSPEEDAM 2008\nInternational Symposium on Power Electronics,\nElectrical Drives, Automation and Motion\n756\n978-1-4244-1664-6\/08\/$25.00 ©2008 IEEE\n IV.  PROTOTYPE SYSTEM \nA.  Prototype Hardware \nA BLDC drive system is realized with ‘intelligent’ \nH-bridge cells performing SoC estimation and capable \nof producing PWM. These, combined with a phase \ncontroller, achieve current control and battery \nmanagement. For comparison purposes, and as a proof \nof principle, only one phase is controlled in this manner, \nwith a 6-switch inverter then providing commutation, \nreducing the phase requirement of the multilevel \nconverter whilst facilitating the battery management.  A \nblock diagram of the system is shown in Fig. 2. \n \n \nPM\nMotor\nH Bridge \nCell 2\nCurrent Feedback\nEncoder\nDemand\nCommutation and Hardware Current limitingMultilevel Converter for current control\nH Bridge \nCell 3\nPhase\nController\n \nFig. 2. Prototype BLDC drive system \n \nExperimental results are obtained from a prototype 7-\nlevel multilevel converter using 3×12V, 45Ah lead acid \nbatteries, driving a 1.2kW BLDC machine. The \nexperimental setup is shown in Fig. 3. The BLDC \nmachine is used in a dynamometer rig, with a brushed \nDC machine and resistive load. \nThe prototype uses three identical cells on a common \nSPI interface bus, providing a modular, easily \nexpandable system. \nEach H-bridge cell comprises of an embedded micro-\nprocessor (PIC18F2431) producing PWM, sampling cell \nvoltage and current whilst performing SoC calculation. \nThe switching devices used are the FQA170N06 rated at \n60V, 170A, an opto-isolated communication bus, power \nsupplies and protection circuitry. \nThe phase controller is based on a dsPIC30F4011, \nwhich calculates the required cell states and duty cycle \nfor a given demand signal and maps this to the cell \npriority based on the battery management algorithm. An \nRS232 link is implemented so cell voltage, current and \nthe current integration can be communicated to \nSimulink, which acts as a data logger, and Stateflow, \nwhich implements the various battery management \ntechniques. \n \nB.  SoC Estimation \nSoC estimation in the form of current integration is \nimplemented on each of the H-bridge cells. This is \ncommunicated to the phase controller and passed on to a \nPC, which performs the battery management using \nStateflow.  \nInitial SoC is estimated from the open circuit cell \nvoltage before testing begins. A linear first order \napproximation of a lead acid model, consisting of a bulk \ncapacitance and series resistance, is used in the initial \nSoC estimate, and is a simplification of Randles’ model \npresented in  [7]. The model parameters are obtained \nfrom experimental drive cycle data. The SoC is then \ncalculated in Simulink using the estimated initial SoC \nand current integration value. \nUltimately the battery management will be \nimplemented on the phase controller, producing a \nsystem that incorporates battery management but the \nonly user required input is that of an analogue demand \nsignal. \n \n \nFig. 3. 7-level prototype hardware \n \nV.  BATTERY MANAGEMENT  \nThe hybrid electric vehicle utilizes a series \nconnection of batteries to form a battery pack. The \nelectrical performance of this pack can deteriorate over \ntime when exposed to differing charge and discharge \nrates as well as SoC variations within the pack. \nMethods for charge balancing within a multilevel \nconverter are presented in [8]. These are extended in [6] \nwith the application of SoC estimation and investigated \nwith simulations.  \nWithout battery management the cells will discharge \nunequally with the cell producing the lowest levels \ndischarging most quickly with no account being made \nfor initial conditions.  \n \nA.  Balanced Discharge \nThe first method investigated here is that of balanced \ndischarge or cell rotation where the load to each cell is \nbalanced by rotating the demand between the available \ncells. This is shown in Fig. 4(a). Literature suggests \nrotating the demand every half cycle of the output \nfrequency, when producing AC waveforms, to balance \nthe load. However, with a DC load, and due to the large \nelectrical time constant of the lead acid battery, it has \n757\n been found beneficial to perform the rotation at 30s \nintervals.  \nBalanced discharge, Fig. 4, equalizes the load to each \nbattery, as demonstrated by the parallel SoCs, but does \nnot take into account initial conditions. Cell C has the \nlowest SoC at the beginning and end of the test. \n \nB.  SoC Based Scheme \nThe variation of SoC due to initial conditions can be \nreduced with a SoC based scheme, where the SoC is \ntaken into account and the cell with the lowest SoC is \nused last, thus equalizing the SoC before applying a \nbalanced discharge. This is shown in Fig. 4(b) where the \ncells SoC converge. When cells become equal the \ndemand is rotated between them thereby balancing the \ndischarge. \nThe output of the converter is adjusted for both the \nbalanced discharge and SoC based scheme to produce a \nnominal DCLink current of 10A. \n \n \nVI.  COMPARISON WITH 2-LEVEL CONVERTER  \nTo demonstrate the improvements achievable with \nthe multilevel converter, the classical 2-level converter \nis presented for comparison. The motor phase current is \nadjusted to give the same current, Fig. 5, for both \nconverters. The power delivered to the load is 166W. \nFig. 5 also demonstrates the current ripple reduction by \nvirtue of using smaller voltage levels in the multilevel \nconverter when compared to a classical 2-level system. \n \n0 0.002 0.004 0.006 0.008 0.01 0.012\n0\n5\n10\n15\n20\n25\nTime (S)\nPh\nas\ne \nA\n M\not\nor\n C\nur\nre\nnt\n (A\n)\nMotor Phase Current for both 2 & 7-level Converters\n \n \n2-level\n7-level\n \nFig. 5. Motor phase current with 2-level and 7-level converters \n \n    1)  2-level Converter \nFirst the effects of differing initial conditions and cell \ndeterioration are investigated with the classical 2-level \nconverter. The battery cells are connected in series to \nform the DC link for a standard 2-level converter, the \nsame switching frequency, 20kHz, being used for both \nconverters. \n The battery used in cell A is aged and offers a \nreduced capacity to that of cells B and C. The battery \ncells voltage current and estimated SoC is shown in Fig. \n6(a). \n \n    2)  7-level Converter \nUnder the same conditions the 7-level converter test \ndata is shown in Fig. 6(b). \n \nThe initial SoC differs with both types of converter, \nhowever, with the 7-level converter they are equalized \nafter 19min of operation, whereas with the 2-level \nconverter they remain different. In the 2-level converter \nthe lower capacity cell A fails, the cell voltage falls \nrapidly, after 55min of operation. This is extended to \n~76min with the 7-level converter with the failure being \ngradual as the load is balanced between cells.  \n The battery management using the 7-level converter \ncan be extended further by taking remedial action \nshould any cell degrade. That cell can then be bypassed \nand the demand rotated between the remaining available \ncells. The maximum output will be reduced but the \ndrive can continue to operate. \n \n \n0 10 20 30 40 50 60 70\n0\n5\n10\n15\nC\nel\nl V\nol\nta\nge\n (V\n)\n7-Level Converter with Balanced Discharge Battery Management: IDC Link = 10A\n0 10 20 30 40 50 60 70\n0\n5\n10\n15\nC\nel\nl C\nur\nre\nnt\n (A\n)\n0 10 20 30 40 50 60 70\n0.6\n0.9\n0.8\n1  \n0.5\n0.7\nC\nel\nl S\noC\nTime (min)\n \n \nCell A\nCell B\nCell C\n(a) \n0 10 20 30 40 50 60 70\n0\n5\n10\n15\nC\nel\nl V\nol\nta\nge\n (V\n)\n7-Level Converter with SoC Based Battery Management: IDC Link = 10A\n0 10 20 30 40 50 60 70\n0\n5\n10\n15\nC\nel\nl C\nur\nre\nnt\n (A\n)\n0 10 20 30 40 50 60 70\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nC\nel\nl S\noC\nTime (min)\n \n \nCell A\nCell B\nCell C\n(b) \nFig. 4. Experimental results, (a) 7-level converter with balanced discharge, \n(b) 7-level converter with SoC based battery management \n758\n VII.  CLOSED-LOOP CONTROL \nPreliminary results with a PI current controller are \npresented in Fig. 7, demonstrating the capability to \ncontrol output current whilst incorporating the SoC \nbased battery management. This avoids the fall in \noutput current, caused by the reduction in cell voltage as \nbattery SoC decreases, as seen in Fig. 6(a,b). \n \n0 20 40 60 80 100 120 140 160\n0\n5\n10\n15\nD\nC\nLi\nnk\n C\nur\nre\nnt\n (A\n) 7-level Converter with Battery Management and PI Controller: IDC Link = 10A\n0 20 40 60 80 100 120 140 160\n0\n5\n10\n15\nC\nel\nl V\nol\nta\nge\n (V\n)\n0 20 40 60 80 100 120 140 160\n0\n5\n10\n15\nC\nel\nl C\nur\nre\nnt\n (A\n)\n0 20 40 60 80 100 120 140 160\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nC\nel\nl S\noC\nTime (min)\n \n \nCell A\nCell B\nCell C\n \nFig. 7. 7-level converter with SoC battery management and current \ncontrol \nVIII.  DISCUSSION \nExperimental results presented here use different \nbattery management techniques, both of which offer \nimprovements over the cascaded H-bridge without \nmanagement. Balance discharge between cells is \nachieved, before improvement, with a SoC based \nscheme that is capable of equalizing SoC before \nbalancing the discharge.  \nThe proposed 7-level BLDC drive, incorporating \nbattery management, has been demonstrated to increase \nbattery running time over the classical 2-level converter. \nExtensions to this work include the performing of \nremedial action should any cell fail, and improvements \nto SoC estimation, using observer techniques, to track \nthe initial SoC and to take into account variation of cell \nparameters. \n Further work will investigate the transfer of energy \nbetween cells, to facilitate an off-line equalization and \ncell conditioning routine, as well as the application of \nbattery management techniques to battery charging. \nIX.  CONCLUSIONS \nImprovement in battery performance has been presented \nin the cascaded H-bridge multilevel converter when \ncompared with the classical 2-level converter. This was \ndemonstrated by showing reduced variation between \ncells with real-time battery management techniques. \nACKNOWLEDGMENT \nThe authors would like to thank the EPSRC for \nsponsoring this work as part of a PhD study. \nREFERENCES \n[1] L. T. Lam, N. P. Haigh, C. G. Phyland, and A. J. Urban, \n\"Failure mode of valve-regulated lead-acid batteries under \nhigh-rate partial-state-of-charge operation,\" Journal of Power \nSources, vol. 133, pp. 126-134, 2004. \n[2] E. Karden, S. Ploumen, B. Fricke, T. Miller, and K. Snyder, \n\"Energy storage devices for future hybrid electric vehicles,\" \nJournal of Power Sources, vol. 168, pp. 2-11, 2007. \n[3] J. Rodriguez, J.-S. Lai, and F. Z. Peng, \"Multilevel inverters: \nA survey of topologies, controls, and applications,\" IEEE \nTransactions on Industrial Electronics, vol. 49, pp. 724-738, \n2002. \n[4] L. Jih-Sheng and P. Fang Zheng, \"Multilevel converters-a \nnew breed of power converters,\" Industry Applications, IEEE \nTransactions on, vol. 32, pp. 509-517, 1996. \n[5] G. J. Su and D. J. Adams, \"Multilevel DC link inverter for \nbrushless permanent magnet motors with very low \ninductance,\" Chicago, IL, 2001, pp. 829-834. \n[6] K. D. Wilkie, D. A. Stone, M. P. Foster, and C. M. Bingham, \n\"A Cascaded H-Bridge BLDC Drive Incorporating Battery \nManagement,\" in EPE, Aalborg, 2007. \n[7] B. S. Bhangu, P. Bentley, D. A. Stone, and C. M. Bingham, \n\"Observer Techniques to estimate the State of Charge of \nValve Regulated Lead Acid Batteries for Hybrid Electric \nVehicles,\" in IEEE Proceedings Vehicle Power and \nPropulsion, Chicago, 2005. \n[8] L. M. Tolbert, F. Z. Peng, T. Cunnyngham, and J. N. \nChiasson, \"Charge balance control schemes for cascade \nmultilevel converter in hybrid electric vehicles,\" IEEE \nTransactions on Industrial Electronics, vol. 49, pp. 1058-\n1064, 2002. \n0 10 20 30 40 50 60 70 80 90 100\n0\n5\n10\n15\n2-Level Converter Test Data: Ia = 15A\nC\nel\nl V\nol\nta\nge\n (V\n)\n0 10 20 30 40 50 60 70 80 90 100\n0\n5\n10\nC\nel\nl C\nur\nre\nnt\n (A\n)\n0 10 20 30 40 50 60 70 80 90 100\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nEs\ntim\nat\ned\n S\noC\nTime (min)\n \n \nCell A\nCell B\nCell C\n(a) \n0 10 20 30 40 50 60 70 80 90 100\n0\n5\n10\n15\n7-Level Converter Test Data: Ia = 15A, SoC Controlled\nC\nel\nl V\nol\nta\nge\n (V\n)\n \n \nCell A\nCell B\nCell C\n0 10 20 30 40 50 60 70 80 90 100\n-20\n-10\n0\n10\n20\nC\nel\nl C\nur\nre\nnt\n (A\n)\n \n \n0 10 20 30 40 50 60 70 80 90 100\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nEs\ntim\nat\ned\n S\noC\nTime (min)\n \n \n(b) \nFig. 6. Experimental results, (a) 2-level converter, (b) 7-level converter with \nSoC based battery management \n759\n"}