{"doi":"10.1002\/pssb.200776105","coreId":"70593","oai":"oai:eprints.lancs.ac.uk:11377","identifiers":["oai:eprints.lancs.ac.uk:11377","10.1002\/pssb.200776105"],"title":"Interlayer asymmetry gap in the electronic band structure of bilayer graphene.","authors":["McCann, Edward"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11","abstract":"The low-energy electronic band structure of bilayer graphene consists of four bands: a pair of bands split from zero energy by the interlayer coupling and a pair of bands which touch at zero energy in a nominally undoped system. The latter support massive, chiral quasiparticles with a parabolic dispersion and Berry phase 2. Asymmetry between the potential energies of the layers opens a tuneable gap between the conduction and valence bands. A self-consistent Hartree approximation is used to model the control of such an interlayer asymmetry gap induced by a transverse electric field in a graphene-based field-effect transistor","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70593.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11377\/1\/mccannPSSB.pdf","pdfHashValue":"1662ab84fe90637d34492916b1d12cbdd64278eb","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11377<\/identifier><datestamp>\n      2018-01-24T00:04:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Interlayer asymmetry gap in the electronic band structure of bilayer graphene.<\/dc:title><dc:creator>\n        McCann, Edward<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The low-energy electronic band structure of bilayer graphene consists of four bands: a pair of bands split from zero energy by the interlayer coupling and a pair of bands which touch at zero energy in a nominally undoped system. The latter support massive, chiral quasiparticles with a parabolic dispersion and Berry phase 2. Asymmetry between the potential energies of the layers opens a tuneable gap between the conduction and valence bands. A self-consistent Hartree approximation is used to model the control of such an interlayer asymmetry gap induced by a transverse electric field in a graphene-based field-effect transistor.<\/dc:description><dc:date>\n        2007-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1002\/pssb.200776105<\/dc:relation><dc:identifier>\n        McCann, Edward (2007) Interlayer asymmetry gap in the electronic band structure of bilayer graphene. physica status solidi (b), 244 (11). pp. 4112-4117. ISSN 0370-1972<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11377\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1002\/pssb.200776105","http:\/\/eprints.lancs.ac.uk\/11377\/"],"year":2007,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"pss header will be provided by the publisher\nInterlayer asymmetry gap in the electronic band structure of\nbilayer graphene\nEdward McCann∗\nPACS 73.63.-b, 73.43.Cd, 81.05.Uw\nThe low-energy electronic band structure of bilayer graphene consists of four bands: a pair of bands split\nfrom zero energy by the interlayer coupling and a pair of bands which touch at zero energy in a nominally\nundoped system. The latter support massive, chiral quasiparticles with a parabolic dispersion and Berry\nphase 2pi. Asymmetry between the potential energies of the layers opens a tuneable gap between the con-\nduction and valence bands. A self-consistent Hartree approximation is used to model the control of such an\ninterlayer asymmetry gap induced by a transverse electric field in a graphene-based field-effect transistor.\nCopyright line will be provided by the publisher\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, UK\n1 Introduction The discovery that electrons in graphene possess some of the features of relativistic\nparticles has generated huge interest. In monolayer graphene, the low-energy charge carriers are chiral\nparticles exhibiting Berry’s phase π with a linear energy-versus-momentum relation [1, 2, 3, 4, 5, 6]. The\nchirality is based on a ‘pseudospin’ quantum number arising from the relative phase of the electronic wave\nfunction on adjacent atomic sites of the hexagonal lattice and chirality means that the pseudospin always\nlies parallel or antiparallel to the electron’s momentum. The behaviour of low-energy particles in bilayer\ngraphene is perhaps even more remarkable [7, 8, 9]. They have a parabolic dispersion relation and a degree\nof chirality related to Berry’s phase 2π, with the pseudospin linked to, but turning twice as quickly as, the\ndirection of momentum.\nIt has been possible to describe the electronic band structure of bilayer graphene using both the tight-\nbinding model [10, 7, 11, 12, 13, 14] and density functional theory [15, 16, 17]. It has been predicted [7]\nthat asymmetry between the on-site energies in the layers will create a gap ∆ between the conduction and\nvalence bands. As the gap ∆ arises from layer asymmetry, there is a possibility of tuning its magnitude\nusing external gates. Indeed, a gate is routinely used in experiments to control the density of electrons\nn on the bilayer system [1, 2, 8] and, in general, this will produce a simultaneous change in ∆. The\ndependence of the gap on external gate voltage has been modelled taking into account screening within\nthe tight binding model [13, 14, 17]. It seems that such calculations produce good agreement with ARPES\nexperiments [9], measurements made in the regime of the quantum Hall effect [14], and density functional\ntheory calculations [17].\nIn the following, we review the tight-binding model of bilayer graphene in Section 2, including trigonal\nwarping effects. We obtain the effective low energy Hamiltonian of bilayer graphene in Section 3 and we\nshow that it is dominated by chiral quasiparticles with a parabolic dispersion and Berry phase 2π. Section 4\ndescribes the opening of a gap in bilayer graphene due to layer asymmetry, followed by a calculation using\na self-consistent Hartree approximation to describe the control of the gap in the presence of an external\ngate.\n2 The tight-binding model of bilayer graphene Bilayer graphene consists of two coupled hexagonal\nlattices with inequivalent sites A1, B1 and A2, B2 on the bottom and top graphene sheets, respectively,\n∗ Corresponding author: e-mail: ed.mccann@lancaster.ac.uk\npss data will be provided by the publisher\n2 E. McCann: Interlayer asymmetry gap in bilayer graphene\narranged according to Bernal (A2-B1) stacking: as shown in Fig. 1(a), every B1 site in the bottom layer\nlies directly below an A2 site in the upper layer, but sites A1 and B2 do not lie directly below or above\na site in the other layer. We use the tight-binding model of graphite [18] by adapting the Slonczewski-\nWeiss-McClure parameterization [19, 20] of relevant couplings in order to model bilayer graphene. In-\nplane hopping is parameterized by coupling γA1B1 = γA2B2 ≡ γ0 and it leads to the in-plane velocity\nv = (\n√\n3\/2)aγ0\/h¯ where a is the lattice constant. We also take into account the strongest inter-layer\ncoupling, γA2B1 ≡ γ1, between pairs of A2-B1 orbitals that lie directly below and above each other.\nSuch strong coupling produces dimers from these pairs of A2-B1 orbitals, leading to the formation of\nhigh energy bands [7]. In addition, weaker A1-B2 coupling γA1B2 ≡ γ3 is included, leading to an\neffective velocity v3 = (\n√\n3\/2)aγ3\/h¯ where v3 ≪ v. We write the Hamiltonian [7] near the centers of the\nvalleys in a basis corresponding to wave functions Ψ = (ψA1, ψB2, ψA2, ψB1) in the valley K [21] and of\nΨ = (ψB2, ψA1, ψB1, ψA2) in the valley K˜:\nH = ξ\n\n\n− 12∆ v3π 0 vπ†\nv3π\n† 1\n2∆ vπ 0\n0 vπ† 12∆ ξγ1\nvπ 0 ξγ1 − 12∆\n\n , (1)\nwhere π = px + ipy , π† = px − ipy , p = (px, py) ≡ p(cosφ, sinφ) is the momentum measured with\nrespect to the K point, ξ = +1(−1) labels valley K (K˜). The Hamiltonian takes into account asymmetry\n∆ = ǫ2 − ǫ1 between on-site energies in the two layers, ǫ2 = 12∆, ǫ1 = − 12∆.\nAt zero magnetic field, the HamiltonianH has four valley-degenerate bands [7], ǫ(α)± (p), α = 1, 2, with\nǫ\n(α)2\n± =\nγ21\n2\n+\n∆2\n4\n+\n(\nv2 +\nv23\n2\n)\np2 + (−1)α\n√\nΓ\nΓ = 14\n(\nγ21 − v23p2\n)2\n+ v2p2\n[\nγ21 +∆\n2 + v23p\n2\n]\n+ 2ξγ1v3v\n2p3 cos 3φ. (2)\nThey are plotted in Fig. 1(b) for ∆ = 0 (dashed lines) and ∆ = γ1 (solid) where, for simplicity, we neglect\nv3. The dispersion ǫ(2)± describes two bands with energies ǫ\n(2)\n+ ≥ γ1 and ǫ(2)− ≤ γ1: they do not touch at\nthe K point. These bands are the result of strong interlayer coupling γA2B1 ≡ γ1 which forms ‘dimers’\nfrom pairs of A2-B1 orbitals that lie directly below and above each other [7].\nThe dispersion ǫ(1)± (p) describes low energy bands that touch at the K point in the absence of layer\nasymmetry ∆ = 0. In the intermediate energy range, 14γ1(v3\/v)\n2, |∆| < |ǫ1| < γ1, it can be approximated\n[7] with ǫ(1)± ≈ ± 12γ1[\n√\n1 + 4v2p2\/γ21 − 1]. This interpolates between a linear spectrum |ǫ(1)± | ≈ vp at\nhigh momenta and a quadratic spectrum |ǫ(1)± | ≈ p2\/2m, where m = γ1\/2v2. Such a crossover happens\nat p ≈ γ1\/2v, which corresponds to the carrier density n∗ ≈ γ21\/(4πh¯2v2). This is lower than the density\nat which the higher energy band ǫ(2) becomes occupied n(2) ≈ 2γ21\/(πh¯2v2) ≈ 8n∗. Using experimental\ngraphite values [20] gives n∗ ≈ 4.36× 1012cm−2 and n(2) ≈ 3.49× 1013cm−2. The estimated effective\nmass m is light: m = γ1\/2v2 ≈ 0.054me.\nA 1\nB 2\nB 1\nv\nv\nA 2\nB 1\ng 1\nA 2\nA 1\nB 2\n( a )\ng 1\n1\n2\nv p \/ g 1\ne \/ g 1\n21- 1- 2\n- 1\n- 2\n( b )\nD\ne\n( 2 )\ne\n( 1 )\ne\n( 1 )\ne\n( 2 )\n+\n+\n-\n-\nFig. 1 (a) schematic of the bilayer lattice contain-\ning four sites in the unit cell: A1 (white circles) and\nB1 (grey) in the bottom layer, and A2 (grey) and B2\n(black) in the top layer. (b) schematic of the low en-\nergy bands near the K point obtained by taking into\naccount intralayer hopping with velocity v, B1A2\ninterlayer coupling γ1, with zero layer asymmetry\n∆ (dashed lines) and finite layer asymmetry ∆ (for\nillustrative purposes a very large asymmetry ∆ = γ1\nis used). For simplicity, we neglect A1B2 interlayer\ncoupling γ3.\nc© 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\npss header will be provided by the publisher 3\n3 Effective low-energy Hamiltonian The transport properties of bilayer graphene are conveniently\ndescribed by a low-energy Hamiltonian that describes effective hopping between the non-dimer sites, A1-\nB2, i.e. those that do not lie directly below or above each other and are not strongly coupled by γ1. This\ntwo component Hamiltonian was derived in [7] using Green’s functions. Alternatively (and equivalently),\none can view the eigenvalue equation of the four component Hamiltonian Eq. (1) as producing four simul-\ntaneous equations for components ψA1, ψB2, ψA2, ψB1. Eliminating the dimer state components ψA2,\nψB1 by substitution, and treating γ1 as a large energy, gives the two component Hamiltonian [7] describing\neffective hopping between the A1-B2 sites:\nHˆ2 = − 1\n2m\n(\n0\n(\nπ†\n)2\nπ2 0\n)\n+ hˆw + hˆa; (3)\nhˆw = ξv3\n(\n0 π\nπ† 0\n)\n, where π = px + ipy;\nhˆa = −ξ∆\n[\n1\n2\n(\n1 0\n0 −1\n)\n− v\n2\nγ21\n(\nπ†π 0\n0 −ππ†\n)]\n.\nThe effective Hamiltonian Hˆ2 is applicable within the energy range |ǫ| < 14γ1. In the valleyK, ξ = +1, we\ndetermine Ψξ=+1 = (ψA1, ψB2), whereas in the valley K˜, ξ = −1, the order of components is reversed,\nΨξ=−1 = (ψB2, ψA1). The Hamiltonian Hˆ2 describes two possible ways of A1 ⇀↽ B2 hopping. The first\nterm takes into account A1 ⇀↽ B2 hopping via the A2B1 dimer state. Consider A1 to B2 hopping as\nillustrated with the thick solid line in Fig. 1(a). It includes three hops between sites: an intralayer hop from\nA1 to B1, followed by an interlayer transition via the dimer state B1A2, followed by an intralayer hop\nfrom A2 to B2. Since the two intralayer hops are both A to B, the first term in the Hamiltonian contains\nπ2 or (π†)2 on the off-diagonal with the mass m = γ1\/2v2 reflecting the energetic cost γ1 of a transition\nvia the dimer state. This term in Hˆ2 yields a parabolic spectrum ǫ = ±p2\/2m with m = γ1\/2v2. It has\nbeen noticed [7] that quasiparticles described by it are chiral: their plane wave states are eigenstates of an\noperator σn2 with σn2 = −1 for electrons in the conduction band and σn2 = 1 for the valence band,\nwhere n2(p) = (cos 2φ, sin 2φ) for p = (p cosφ, p sinφ). Quasiparticles described by this term acquire\na Berry phase 2π upon an adiabatic propagation along a closed orbit, thus charge carriers in a bilayer are\nBerry phase 2π quasiparticles, in contrast to Berry phase π particles in a monolayer [5].\nThe second term hˆw in the Hamiltonian Eq. (3) describes weak direct A1B2 coupling, γA1B2 ≡ γ3 ≪\nγ1. This coupling γA1B2 ≡ γ3 leads to the effective velocity v3 = (\n√\n3\/2)aγ3\/h¯ where v3 ≪ v, Eq. (2).\nIn a similar way to bulk graphite [19, 22], the effect of coupling γ3 is to produce trigonal warping of the\nisoenergetic lines around each valley. At very low energies |ǫ| < ǫL = 14γ1(v3\/v)2 ≈ 1meV, the effect\nof trigonal warping is dramatic. It leads to a Lifshitz transition: the isoenergetic line is broken into four\npockets, which can be referred to as one “central” and three “leg” parts [22, 7]. For v3 ≪ v, we find\n[7, 20] that the separation of the 2D Fermi line into four pockets would take place for very small carrier\ndensities n < nL ∼ (v3\/v)2 n∗ ∼ 1 × 1011cm−2. For n < nL, the central part of the Fermi surface is\napproximately circular with area Ac ≈ πǫ2\/(h¯v3)2, and each leg part is elliptical with area Aℓ ≈ 13Ac.\nThe overlap between the conduction and valence bands is given by 2ǫL ≈ (γ1\/2)(v3\/v)2 ≈ 2meV [12]\nusing γ1 ≈ 0.4eV and v3\/v ≈ 0.1. Note that, at energies below the Lifshitz transition, the bilayer spectrum\nin each of the four Fermi surface pockets is linear, and the integral Berry phase 2π in bilayer graphene [7, 8]\nis divided into Berry phase π in each of the three side pockets and −π in the central one.\n4 Voltage-controlled gap in the spectrum of bilayer graphene The parameter ∆ takes into account\na possibly-externally-controlled asymmetry ∆ = ǫ2 − ǫ1 between on-site energies in the two layers, ǫ2 =\n1\n2∆, ǫ1 = − 12∆. The electronic bands near the K point, Eq. (2), are shown in Fig. 1(b) for a large value of\nc© 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n4 E. McCann: Interlayer asymmetry gap in bilayer graphene\nthe layer asymmetry ∆. For simplicity, we neglect A1B2 interlayer coupling γ3:\nǫ\n(α)2\n± ≈\nγ21\n2\n+\n∆2\n4\n+ v2p2 + (−1)α\n√\nγ41\n4\n+ v2p2 (γ21 +∆\n2),\nThe energies of the bands exactly at the K point are |ǫ(2)± (p = 0)| =\n√\nγ21 +∆\n2\/4 and |ǫ(1)± (p = 0)| =\n|∆|\/2: the low energy bands, ǫ(1)± , are split by the layer asymmetry ∆ at theK point [23]. In an asymmetric\nbilayer, the electronic densities on the individual layers, n1 and n2, are given by an integral with respect to\nmomentum p = h¯ |k| over the circularly symmetric Fermi surface, taking into account the relative weight\nof the wave functions: n1(2) = (2\/πh¯2)\n∫\np dp(\n∣∣ψA1(2)(p)∣∣2 + ∣∣ψB1(2)(p)∣∣2), where we have included a\nfactor of four to take into account spin and valley degeneracy. By determining the wavefunction amplitudes\non the four separate atomic sites we find\nn1(2) =\n∫\ndp p\n(\nǫ∓∆\/2\nπh¯2ǫ\n)[(\nǫ2 −∆2\/4)2 ∓ 2v2p2ǫ∆− v4p4\n(ǫ2 −∆2\/4)2 + v2p2∆2 − v4p4\n]\n, (4)\nwhere the minus (plus) sign is for the first (second) layer.\nIn the following we use a self-consistent Hartree approximation to determine the electronic distribution\non the bilayer and the resulting band structure in the presence of an external gate. We consider the graphene\nbilayer, with interlayer separation c0, to be located a distance d from a parallel metallic gate. The appli-\ncation of an external gate voltage Vg = end\/ε′rε0 induces a total excess electronic density n = n1 + n2\non the bilayer system where n1 (n2) is the excess density on the layer closest to (furthest from) the gate\n(we use SI units). Here ε0 is the permittivity of free space, ε′r is the dielectric constant of the material be-\ntween the gate and the bilayer, and e is the electronic charge. We assume that the screening of the effective\ncharge density ρ+ = en from the metallic gate is not perfect, leading to an excess electronic density n2\non the layer furthest from the gate. The excess density n2 gives rise to an electric field with magnitude\nE = en2\/εrε0 between the layers where εr is the nominal dielectric constant of the bilayer. There is a\ncorresponding change in potential energy ∆U = e2n2c0\/εrε0 that determines the layer asymmetry [13]:\n∆(n) = ǫ2 − ǫ1 ≡ e\n2n2c0\nεrε0\n. (5)\nIn terms of the capacitance of a bilayer of area L2, Cb = εrε0L2\/c0, this may be written ∆(n) =\ne2n2L\n2\/Cb.\nWe self consistently calculate the excess densities n1, n2, n = n1+n2, Eq. (4), and the gap ∆, Eq. (5).\nThis has been done numerically in Ref. [13]. Analytically, for moderately low density, 4πh¯2v2|n| < γ21 ,\nwe find\n∆ ≈ e\n2L2n\n2Cb\nfΛ\n(\nh¯2v2π|n|\nγ21\n)\n, (6)\nfΛ (x) ≈ 1\n1 + Λ\n(\nx− 12 lnx\n) .\nThe function fΛ(x) depends on the dimensionless parameter Λ = e2L2γ1\/(2πh¯2v2Cb) which describes\nthe effectiveness of the interlayer screening of the bilayer. The limit Λ→ 0 describes poor screening when\nthe density on each layer is equal to n\/2 whereas for Λ → ∞ there is excellent screening, the density\nlies solely on the layer closest to the external gate and ∆ = 0. Note that fΛ(x) → 0 as x → 0 because\nof the logarithm, meaning that the effectiveness of interlayer screening increases upon lowering density.\nUsing typical experimental parameters [20] we find Λ ≈ 1.3. We estimate that the addition of density\nn ∼ 1012cm−2 yields a gap ∆ ∼ 10meV [24].\nc© 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\npss header will be provided by the publisher 5\n5 Conclusions We reviewed the results of tight-binding model studies of bilayer graphene and its low-\nenergy electronic band structure. Inter-layer asymmetry creates a gap between the conduction and va-\nlence bands so that bilayer graphene is a semiconductor with a tuneable gap of up to about 0.4eV. A self-\nconsistent Hartree approximation was used to determine the density distribution of the two layers when the\ndensity n is varied using an asymmetrically placed gate, resulting in a density dependent gap ∆(n). Con-\ntrol of the gap has been modelled taking into account screening within the tight binding model [13, 14, 17].\nIt seems that such calculations produce good agreement with ARPES experiments [9], measurements made\nin the regime of the quantum Hall effect [14], and density functional theory calculations [17]. The use of\na single gate modulates the density and the gap simultaneously, but it should be possible to control them\nindependently by employing both a top and a bottom gate. This suggests a route to nanoelectronic devices\ndefined within a single sheet of gated bilayer graphene.\nAcknowledgements The author thanks D.S.L. Abergel, V.I. Fal’ko, A.K. Geim, K. Kechedzhi, K. Novoselov, and\nL.M.K. Vandersypen for useful discussions and EPSRC for financial support.\nReferences\n[1] K.S. Novoselov, A.K. Geim, S.V. Morozov, D. Jiang, Y. Zhang, S.V. Dubonos, I.V. Grigorieva, A.A. Firsov,\nScience 306, 666 (2004).\n[2] K.S. Novoselov, A.K. Geim, S.V. Morozov, D. Jiang, M.I. Katsnelson, I.V. Grigorieva, S.V. Dubonos, and\nA.A. Firsov, Nature 438, 197 (2005); Y.B. Zhang, Y.W. Tan, H.L. Stormer, and P. Kim, Nature 438, 201 (2005).\n[3] D. DiVincenzo and E. Mele, Phys. Rev. B 29, 1685 (1984).\n[4] G.W. Semenoff, Phys. Rev. Lett. 53, 2449 (1984).\n[5] F.D.M. Haldane, Phys. Rev. Lett. 61, 2015 (1988); Y. Zheng and T. Ando, Phys. Rev. B 65, 245420 (2002);\nN.M.R. Peres, F. Guinea, and A.H. Castro Neto, Phys. Rev. B 73, 125411 (2006); A.H. Castro Neto, F. Guinea,\nand N.M.R. Peres, Phys. Rev. B 73, 205408 (2006).\n[6] T. Ando, T. Nakanishi, and R. Saito, J. Phys. Soc. Japan 67, 2857 (1998).\n[7] E. McCann and V. I. Fal’ko, Phys. Rev. Lett. 96, 086805 (2006).\n[8] K. S. Novoselov, E. McCann, S.V. Morozov, V.I. Fal’ko, M.I. Katsnelson, U. Zeitler, D. Jiang, F. Schedin, and\nA.K. Geim, Nature Physics 2, 177 (2006).\n[9] T. Ohta, A. Bostwick, T. Seyller, K. Horn, and E. Rotenberg, Science 313, 951 (2006).\n[10] K. Yoshizawa, T. Kato, and T. Yamabe, J. Chem. Phys. 105, 2099 (1996); T. Yumura and K. Yoshizawa, J. Chem.\nPhys. 279, 111 (2002).\n[11] C.L. Lu, C.P. Chang, Y.C. Huang, R.B. Chen, and M.L. Lin, Phys. Rev. B 73, 144427 (2006); J. Nilsson,\nA.H. Castro Neto, N.M.R. Peres, and F. Guinea, Phys. Rev. B 73, 214418 (2006); M. Koshino and T. Ando,\nPhys. Rev. B 73, 245403 (2006); F. Guinea, A.H. Castro Neto, and N.M.R. Peres, Phys. Rev. B 73, 245426\n(2006); M.I. Katsnelson, Eur. Phys. J. B 51, 157 (2006); 52, 151 (2006).\n[12] B. Partoens and F. M. Peeters, Phys. Rev. B 74, 075404 (2006).\n[13] E. McCann, Phys. Rev. B 74, 161403 (2006).\n[14] E.V. Castro, K.S. Novoselov, S.V. Morozov, N.M.R. Peres, J.M.B. Lopes dos Santos, J. Nilsson, F. Guinea,\nA.K. Geim, and A.H. Castro Neto, cond-mat\/0611342.\n[15] S.B. Trickey, F. Mu¨ller-Plathe, G.H.F. Diercksen, and J.C. Boettger, Phys. Rev. B 45, 4460 (1992).\n[16] S. Latil and L. Henrard, Phys. Rev. Lett. 97, 036803 (2006).\n[17] H. Min, B.R. Sahu, S.K. Banerjee, and A.H. MacDonald, Phys. Rev. B 75, 155115 (2007).\n[18] P.R. Wallace, Phys. Rev. 71, 622 (1947); J.C. Slonczewski and P.R. Weiss, Phys. Rev. 109, 272 (1958).\n[19] M.S. Dresselhaus and G. Dresselhaus, Adv. Phys. 51, 1 (2002); R.C. Tatar and S. Rabii, Phys. Rev. B 25, 4126\n(1982); J.-C. Charlier, X. Gonze, and J.-P. Michenaud, Phys. Rev. B 43, 4579 (1991).\n[20] We use γ1 = 0.39eV [19, 9], v3\/v = 0.1, v = 8.0× 105m\/s [2], c0 = 3.35A˚, and εr = 1.\n[21] Corners of the hexagonal Brilloin zone are Kξ = ξ( 43pia−1, 0), where ξ = ±1 and a is the lattice constant.[22] G. Dresselhaus, Phys. Rev. B 10, 3602 (1974); K. Nakao, J. Phys. Soc. Japan, 40, 761 (1976); M. Inoue, J. Phys.\nSoc. Japan, 17, 808 (1962); O.P. Gupta and P.R. Wallace, Phys. Stat. Sol. B 54, 53 (1972).\n[23] Note that the “mexican hat” structure of the low energy bands means that the true value of the gap ∆˜ occurs at\nfinite momentum away from the K point. For huge values of the asymmetry |∆| ≫ γ1, the gap would saturate\nat ∆˜ ≈ γ1 although for modest asymmetry values |∆| ≪ γ1, the relation is simply ∆˜ ≈ |∆|.\n[24] In Section 4 we neglected the role of additional weak couplings, such as A1-B2 coupling γ3 that results in\ntrigonal warping, Section 3, and is relevant at low density n ∼ 1 × 1011cm−2. Indeed, trigonal warping should\nresult in a small overlap between the conduction and valence band of ≈ 2meV.\nc© 2003 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n"}