{"doi":"10.1016\/j.forsciint.2011.01.008","coreId":"51784","oai":"oai:eprints.lincoln.ac.uk:3957","identifiers":["oai:eprints.lincoln.ac.uk:3957","10.1016\/j.forsciint.2011.01.008"],"title":"Reversing microcrystalline tests: an analytical approach to recycling of microcrystals from drugs of abuse","authors":["Elie, Leonie","Baron, Mark","Croxton, Ruth","Elie, Mathieu"],"enrichments":{"references":[{"id":638862,"title":"Analysis of methadone and metabolites in biological fluids with gas chromatography-mass spectrometry,","authors":[],"date":"1982","doi":"10.1016\/S0378-4347(00)81856-3","raw":"G.I. Kang, F.S. Abbott, Analysis of methadone and metabolites in biological fluids with gas chromatography-mass spectrometry, Journal of Chromatography B 231 (1982), 311-319.","cites":null},{"id":639657,"title":"Chemical composition and structure of the microcrystals formed between silver(I) and γ-hydroxybutyric acid and γ-hydroxyvaleric acid,","authors":[],"date":"2006","doi":"10.1111\/j.1556-4029.2006.00156.x","raw":"S.C. Bell, L.S. Oldfield, D.M. Shakleya, J.L. Petersen, J.W. Mercer, Chemical composition and structure of the microcrystals formed between silver(I) and γ-hydroxybutyric acid and γ-hydroxyvaleric acid, Journal of Forensic Science 51 (2006) 808-811.","cites":null},{"id":639453,"title":"Comparative analysis of gamma-hydroxybutyrate and gamma-hydroxyvalerate using GC\/MS and HPLC,","authors":[],"date":"2007","doi":"10.1111\/j.1556-4029.2007.00392.x","raw":"J.W. Mercer, L.S. Oldfield, K.N. Hoffmann, D.M. Shakleya, S.C. Bell, Comparative analysis of gamma-hydroxybutyrate and gamma-hydroxyvalerate using GC\/MS and HPLC, Journal of Forensic Sciences 53 (2007), 383-388.","cites":null},{"id":638226,"title":"Drug proficiency test false positives: a lack of critical thought,","authors":[],"date":"1997","doi":"10.1016\/S1355-0306(97)72173-7","raw":"R.G. Nichols, Drug proficiency test false positives: a lack of critical thought, Science and Justice 37 (1997), 191-196.","cites":null},{"id":639046,"title":"Enhancement of microcrystalline identification of γ-hydroxybutyrate,","authors":[],"date":"2008","doi":"10.1111\/j.1556-4029.2007.00620.x","raw":"M.P. Elie, M.G. Baron, J.W. Birkett, Enhancement of microcrystalline identification of γ-hydroxybutyrate, Journal of Forensic Sciences 53 (2008), 147-150.","cites":null},{"id":639223,"title":"Isolation and Identification of Drugs,","authors":[],"date":"1969","doi":"10.1111\/j.2042-7158.1969.tb08319.x","raw":"E.G.C. Clarke, Isolation and Identification of Drugs, first ed., The Pharmaceutical Press, London, 1969.","cites":null},{"id":638424,"title":"Microcrystalline tests in forensic drug analysis, in: R.A. Meyers (Ed.), Encyclopaedia of Analytical Chemistry,","authors":[],"date":"2009","doi":"10.1002\/9780470027318.a9102","raw":"M.P. Elie, L.E. Elie, Microcrystalline tests in forensic drug analysis, in: R.A. Meyers (Ed.), Encyclopaedia of Analytical Chemistry, John Wiley & Sons Ltd., Larkspur, USA 2009.","cites":null},{"id":637975,"title":"Modern Microcrystal Tests for Drugs, first ed.,","authors":[],"date":"1969","doi":null,"raw":"C.C. Fulton, Modern Microcrystal Tests for Drugs, first ed., John Wiley & Sons, Inc., New York, 1969.","cites":null},{"id":638641,"title":"Simultaneous analysis of gamma-hydroxybutyric acid and its precursors in urine using liquid chromatography-tandem mass spectrometry,","authors":[],"date":"2004","doi":"10.1016\/j.chroma.2004.04.067","raw":"M. Wood, M. Laloup, N. Samyn, M.R. Morris, E.A. de Bruin, R.A. Maes, M.S. Young, V. Maes, G. De Boeck, Simultaneous analysis of gamma-hydroxybutyric acid and its precursors in urine using liquid chromatography-tandem mass spectrometry, Journal of Chromatography A 1056 (2004), 83-90.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04-15","abstract":"A combined analysis of microcrystalline tests followed by LC-MS or GC-MS analysis is described. Microcrystalline tests are shown to be non-destructive as addition products formed were easily dissociated after the application of an appropriate solvent. Subsequent analysis of the sample was done to quantify the recovery of the drug. Examples were performed using the date rape drug γ-hydroxybutyrate (GHB) and the synthetic opioid methadone","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/51784.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3957\/2\/Elie_et_al_Reversing_microcrystalline_tests_repository_copy.pdf","pdfHashValue":"729dd3a89e9c13a944c1bf95a04e7fe5d97aadfb","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3957<\/identifier><datestamp>\n      2013-12-06T08:56:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F46:6A6163735F46313531<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F46:6A6163735F46313030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F46:6A6163735F46313830<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3957\/<\/dc:relation><dc:title>\n        Reversing microcrystalline tests: an analytical approach to recycling of microcrystals from drugs of abuse<\/dc:title><dc:creator>\n        Elie, Leonie<\/dc:creator><dc:creator>\n        Baron, Mark<\/dc:creator><dc:creator>\n        Croxton, Ruth<\/dc:creator><dc:creator>\n        Elie, Mathieu<\/dc:creator><dc:subject>\n        F151 Pharmaceutical Chemistry<\/dc:subject><dc:subject>\n        F100 Chemistry<\/dc:subject><dc:subject>\n        F180 Analytical Chemistry<\/dc:subject><dc:description>\n        A combined analysis of microcrystalline tests followed by LC-MS or GC-MS analysis is described. Microcrystalline tests are shown to be non-destructive as addition products formed were easily dissociated after the application of an appropriate solvent. Subsequent analysis of the sample was done to quantify the recovery of the drug. Examples were performed using the date rape drug γ-hydroxybutyrate (GHB) and the synthetic opioid methadone.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2011-04-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3957\/2\/Elie_et_al_Reversing_microcrystalline_tests_repository_copy.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3957\/3\/FSI6308.pdf<\/dc:identifier><dc:identifier>\n          Elie, Leonie and Baron, Mark and Croxton, Ruth and Elie, Mathieu  (2011) Reversing microcrystalline tests: an analytical approach to recycling of microcrystals from drugs of abuse.  Forensic Science International, 207  (1-3).   e55-e58.  ISSN 0379-0738  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.forsciint.2011.01.008<\/dc:relation><dc:relation>\n        10.1016\/j.forsciint.2011.01.008<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3957\/","http:\/\/dx.doi.org\/10.1016\/j.forsciint.2011.01.008","10.1016\/j.forsciint.2011.01.008"],"year":2011,"topics":["F151 Pharmaceutical Chemistry","F100 Chemistry","F180 Analytical Chemistry"],"subject":["Article","PeerReviewed"],"fullText":" 1\nTITLE \nReversing microcrystalline tests - An analytical approach to recycling of microcrystals from \ndrugs of abuse \n \nAUTHORS \nLeonie E. Elie1 * \nDr. Mark G. Baron1  \nDr. Ruth S. Croxton1  \nMathieu P. Elie1  \n \n1 University of Lincoln, School of Natural and Applied Sciences, Lincoln, LN6 7TS, UK; phone: \n0044 1522 886855; email: lelie@lincoln.ac.uk \n* Corresponding author \n \nABSTRACT \nA combined analysis of microcrystalline tests followed by LC-MS or GC-MS analysis is \ndescribed. Microcrystalline tests are shown to be non-destructive as addition products formed \nwere easily dissociated after the application of an appropriate solvent. Subsequent analysis of \nthe sample was done to quantify the recovery of the drug. Examples were performed using \nthe date rape drug γ-hydroxybutyrate (GHB) and the synthetic opioid methadone. \n \nINTRODUCTION \nMicrocrystalline tests are chemical tests where microscopic crystals are formed upon the mix \nof a specifically chosen reagent together with a suspected drug sample. They provide a \nsimple answer as to whether the suspected drug is present or not and can be carried out at \nvery little cost. No specialist analytical instrumentation is required to perform a successful \ntest; only a microscope is needed in order to observe the result. Result interpretation is based \non direct crystal comparison with genuine drug standards which are carried out alongside [1]. \n \nMicrocrystalline tests, as well as colour tests, are commonly used for presumptive testing of \nsuspected drug samples [2]. Only a few grains of suspected drug are required for a positive \nresult. However, microcrystalline tests can be more than just a simple screening technique. A \nrecent publication suggests that microcrystalline tests can be used as a confirmation \ntechnique [3]. As microcrystals vary in appearance depending on the drug and the reagent, \ncharacteristics like crystal habit, colour and shape are specific enough to give confirmation of \na result.  \n \nMicrocrystals formed between drugs of abuse and their corresponding reagents have been \nreported to be the result of addition reactions where drug and reagent form a complex [3]. The \nbond between drug and reagent molecules could be broken easily by adding solvent onto the \ncrystals, dissolving the crystals and releasing the drug molecules back into solution. Solvents \nin which the analyte has optimum solubility are the most appropriate to chose.  \nFollowing this theory, microcrystalline tests would be reversible and non-destructive in the \nsense that the analyte molecule can still be detected by other techniques even though the \nsample may be contaminated with reagents. The recycling of samples could be of use where \nseized samples have been insufficient to carry out confirmation tests. \n \nThis study investigated a procedure to re-use microcrystalline tests for follow-up analysis by \nGC-MS or LC-MS. To demonstrate the effectiveness of the procedure two drugs of abuse, \nmethadone and γ-hydroxybutyric acid (GHB), were chosen. Quantification was done using \nGC-MS and LC-MS to investigate the drug recovery. \n \nMATERIALS AND METHODS \n Chemicals and materials \nγ-Hydroxybutyric acid sodium salt (99%) and methadone hydrochloride (> 98%) were \npurchased from Sigma-Aldrich (Gillingham, UK). GHB-d6 and methadone-d9 were purchased \nas ampoules (1 g\/L in methanol) from Cerilliant (Round Rock, Texas, USA). Silver nitrate \n(99.9999%) was purchased from Sigma-Aldrich, lanthanum nitrate (> 99%) from Fluka \n(Gillingham, UK) and mercuric chloride from BDH chemicals (Poole, UK). Methanol (HPLC-\ngrade) and formic acid (analytical reagent grade) were from Fisher Scientific (Loughborough, \n 2\nUK). All microcrystalline tests were carried out on standard microscope glass slides \npurchased from Fisher Scientific.  \n \n Microcrystalline test \nThe reagent for GHB is an aqueous solution of silver nitrate and lanthanum nitrate (10 g\/L \neach). Methadone was developed with an aqueous solution of mercuric chloride (10 g\/L). \nMicrocrystalline tests were set up by mixing 10 µL of drug (10 g\/L in water) with 10 µL of the \ncorresponding reagent on a glass slide. Progress of the microcrystal development was \nobserved with a Meji ML 5000 microscope (Axbridge, UK) at 100 x magnification. The tests \nwere left to fully dry at ambient temperature (drying time 15 minutes to 1 hour). \n \nSample recovery and preparation for instrumental analysis \nThe fully developed test slides were clamped onto a stand at an angle of approximately 10° to \nthe horizontal for easy collection of the liquid sample. The solvent for dissolving the \nmicrocrystals was deionised water for both methadone and GHB. A 1.4 mL screw-cap vial \nwas placed underneath one corner of the glass slide in order to catch the solvent running off \nthe slide. In aliquots of 200 µL deionised water was smoothly run down the slide to dissolve \nall solids. Dissolving was sometimes aided by a gentle scratching movement done with a \nplastic pipette tip. A total volume of 800–1000 µL of deionised water was applied. Visual \ninspection of the rinsed slides with a microscope at 100 x magnification showed no crystal or \nother solid residues. \nThe collected sample solution was blown down to dryness under a stream of nitrogen at 40°C \nwith a drying time of 60 to 90 minutes and reconstituted in water for GHB and methanol for \nmethadone. Final concentrations assuming full recovery were 100 mg\/L for GHB and 50 mg\/L \nfor methadone, respectively. The deuterated analogues GHB-d6 and methadone-d9 were \nadded directly before analysis of the recovered microcrystalline test samples resulting in final \nconcentrations of 100 mg\/L for GHB-d6 and 50 mg\/L for methadone-d9. \n \n LC-MS conditions \nGHB calibration standards were prepared in an aqueous solution ranging from 0 to 200 mg\/L. \nGHB-d6 was added as an internal standard just before injection resulting in a concentration of \n100 mg\/L. \nLiquid chromatography was performed on an Agilent Technologies LC-MS system using a \n1200 Series binary pump and an 1100 Series autosampler; it was operated by ChemStation \nsoftware from Agilent Technologies (2005). Separation was achieved on an Agilent \nTechnologies C18 column (Zorbax ODS 250 mm x 4.6 mm and 5 µm pore size) at ambient \ntemperature. The column was eluted isocratically with 0.05% formic acid: methanol (90:10) at \n0.5 mL\/min using an adapted version of a previously reported method [4]. The injection \nvolume was 1 µL. \nMass spectrometry was performed on an Agilent Technologies 6310 Ion Trap operated by \n6300 Series TrapControl software from Bruker Daltonik (2008) in smart mode. Ionisation was \nachieved using Electrospray in positive ionisation mode (ESI+). The ESI nebulizer was \noperated at 35.0 psi, drying gas nitrogen was run at 12.0 L\/min with a drying temperature of \n350 °C. The scan range was set to 50-2200 m\/z with a target mass at 105 m\/z for [M+1]. The \ntarget mass was changed accordingly when looking for GHB adducts. The compound stability \nwas set to 10% due to the fragility of the GHB molecule and the trap drive level was operated \nat 50%. \n \nGC-MS conditions \nMethadone calibration standards were prepared in methanol ranging from 0 to 100 mg\/L. \nMethadone-d9 was added as an internal standard just before injection resulting in a \nconcentration of 50 mg\/L. \nGas chromatography was performed using a Perkin Elmer Clarus 500 Gas Chromatograph \nequipped with an autosampler and a capillary injector operated at 250°C in split mode (10:1). \nUsing an adapted version of a previously reported method [5] separation was achieved on an \nAgilent Technologies DB-1MS column (30 m x 0.25 mm and 0.25 µm film thickness) starting \nat 150°C and increasing at 12°C\/min to a final temperature of 300°C giving a total run time of \n12.5 min. The carrier gas was helium at 1 mL\/min and the injection volume was 1 µL. \nMass spectrometry was performed using a Perkin Elmer Clarus 500 Mass Spectrometer \noperated with Perkin Elmer TurboMass (2008) software. The transfer line temperature was \n 3\nheld at 250°C. Ionisation was achieved using an Electron Impact (EI) source at 200°C with \nelectron energy of 70 eV. The multiplier was set to 480 V. After 2 minutes solvent delay the \nmethadone and methadone-d9 peaks were observed in total ion count (TIC) mode. \nQuantification was achieved by selected ion monitoring using the ions 72 m\/z and 78 m\/z at a \ndwell time of 0.2 s and a 0.1 s inter channel delay for methadone and methadone-d9, \nrespectively. \n \nRESULTS AND DISCUSSION \nThe chosen microcrystalline and instrumental methods were selected because samples could \nbe analysed underivatised which minimised sample loss, and saved preparation time and the \ncost for derivatisation reagents. \n \nMicrocrystalline testing of the drug sample \nThe microcrystalline test for GHB with silver nitrate and lanthanum nitrate as reagent showed \npreviously reported GHB right angle crystals which were slowly nucleating from the periphery \nof the liquid drop towards the centre [6] [Figure 1A]. When the drop was almost dry, reagent \ncrystals formed a coating layer upon all developed crystals. \nThe test for methadone developed differently. Methadone with mercuric chloride as reagent \nformed characteristic rosettes of branching rods [7]. When reagent and drug were mixed an \ninstantaneous formation of white particles occurred. After a few minutes the drug-reagent \ncrystals started to grow consuming the particle cloud as they increased in size. Only reagent \ncrystals could be seen at the drying solvent front as methadone crystals preferred nucleation \nwithin the drop [Figure 1B].  \nAll crystal test samples were left to dry completely to ensure maximum formation of drug-\nreagent crystals and to stay consistent throughout all experiments. However, it is normally \nadvised that tests are observed well before complete dryness is achieved to avoid false \nresults due to reagent crystal formation in the later stages of the test. \n \n \n100 µm\nA\nB\n \nFigure 1 \nMicrocrystals for A) GHB and silver-lanthanum nitrate reagent and B) methadone and mercuric chloride reagent \n \n 4\n \nRecycling of the microcrystalline test material \nIn order to break up the bond formed between drug and reagent and therefore re-dissolving \nthe drug molecules, solvent had to be applied. Deionised water was chosen because the \nmajority of microcrystalline tests are carried out using aqueous solutions. Moreover, the \nviscosity of water as well as its surface tension make it the perfect solvent for this recycling \nprocedure. The hydrophilic surface of microcrystals welcomed the applied water and \ndisintegration of most crystals happened almost instantaneously. Water was applied in small \naliquots of 200 μL to control the flow of solvent running over the edge of the slide [Figure 2]. \nSome crystal material did not dissolve in this step and was consequently washed off the slide \nin the stream of applied water. A total applied volume of 1000 µL deionised water was found \nto be sufficient to transfer the microcrystalline test sample analytically into a screw cap vial. \nOnce transferred the final recycling step was to mix the solution with a vortex mixer for \napproximately 30 seconds inside the vial in order to dissolve all crystal material. \nThe recovered samples were blown dry under nitrogen at low temperature. It was necessary \nto achieve complete dryness in order to monitor the recovered quantities of drug correctly. \nReconstitution solvents were chosen according to the instrumental analytical technique which \nwas carried out subsequently on the samples. \nNo deuterated internal standards were used to monitor the microcrystalline test recovery. \nGHB-d6 and methadone-d9 are only available as solutions in methanol. Organic solvents like \nmethanol have been found by the authors to interfere with the microcrystalline test. \nA sample clean-up in order to remove the reagents prior to the instrumental analysis was not \ndone and so reagents remained within the solutions throughout the analysis. Although \ninterferences could not be detected, a simple precipitation step may be done to remove the \nmetal cations by adding sodium iodide to form the insoluble complexes of silver iodide and \nmercury iodide which could then be easily filtered off. \n \n \nFigure 2 \nSchematic view of slide rinsing procedure for recycling of microcrystalline tests \n \nInstrumental analysis of the recovered sample \nConfirmation of the drug present was done via comparison of retention times and \nidentification of characteristic ions in mass spectra obtained with standards. The retention \ntimes were 8.5 minutes for GHB and 7.9 minutes for methadone. Furthermore, mass \nspectrometry was used to quantify the drug recovery. Specific masses were monitored for the \ncalibration and recovery study as pure drug standards were used throughout the experiments \n[Table 1]. The masses were chosen according to their high abundance in the standard mass \nspectra to give best sensitivity.  \n \n \n \n \n \n \n \n 5\nTable 1 \nRetention times and selected ions used for quantification of the microcrystalline test recovery \nCompound Retention time \n(min) \nIon \n(m\/z) \nGHB 8.5 87 \nGHB-d6 8.3 93 \nMethadone 8.0 72 \nMethadone-d9 7.9 78 \n \nLC-MS analysis of GHB \nThe mass spectra for GHB and its deuterated internal standard showed the molecular ion \n[M+1], one fragment due to the loss of water and common ESI+ adducts [Table 2].  \nThe base peak was used for quantification as it was the most abundant GHB ion in the \nspectrum. The molecular ion [M+1] was part of the background noise even at lowest \nionisation settings in the ion trap presumably because the analyte desolvation before the trap \nwas operated at 350°C. GHB was proven to be a thermally unstable molecule which \ndehydrates into a lactone [8]. The same behaviour was observed with the reconstituted \nmicrocrystalline samples which indicated that the bond formed between two GHB molecules \nand one silver ion (Ag+) to form the right angle GHB crystal was broken [9]. No silver or \nlanthanum adduct could be detected at concentrations analysed. \nCalibration linearity was achieved between 0 and 200 mg\/L with a correlation coefficient of \n0.993 [Figure 3A]. The sample recovery was calculated to be 103 % (n = 11 with CV% = 5 %). \n \nTable 2 \nTypical ESI+ ions for GHB and GHB-d6  \nIons  GHB  \n(m\/z) \nGHB-d6 \n(m\/z) \nMolecular ion [M+1] 105 111 \nBase peak 87 93 \nNa adduct 127 133 \nK adduct 143 149 \n \nGC-MS analysis of methadone \nThe mass spectra for methadone and its deuterated internal standard showed low abundance \nof the molecular ion but a high abundance for the m\/z of 72 and m\/z of 78 fragments, \nrespectively [Table 3]. The ion of 165 m\/z was common for both compounds and therefore not \nused for quantification. \n \nTable 3 \nTypical EI ionisation ions for methadone and methadone-d9  \nIons Methadone  \n(m\/z) \nMethadone-d9  \n(m\/z) \nMolecular ion 294 303 \nBase peak 72 78 \n \nThe 72 m\/z fragment was used for quantification even though on its own it is not sufficiently \ncharacteristic for methadone due to its small size. However, in conjunction with the \nbeforehand performed microcrystalline test, the comparison of retention times and analysis of \nthe TIC mass spectrum a definite identification was achieved.  \nCalibration linearity was achieved between 0 and 100 mg\/L with a correlation coefficient of \n0.999  [Figure 3B]. The sample recovery was calculated to be 105 % (n = 9 with CV% = 11%). \n \n 6\ny = 0.0082x\nR\n2\n = 0.993\n0\n0.4\n0.8\n1.2\n1.6\n2\n0 50 100 150 200\nGHB (mg\/L)\nP\nA\n r\na\nti\no\n G\nH\nB\n\/G\nH\nB\n-d\n6\n (\nm\n\/z\n 8\n7\n\/9\n3\n)\ny = 0.0237x\nR\n2\n = 0.9985\n0\n0.5\n1\n1.5\n2\n2.5\n3\n0 20 40 60 80 100\nMethadone (mg\/L)\nP\nA\n r\na\nti\no\n m\ne\nth\na\nd\no\nn\ne\n\/m\ne\nth\na\nd\no\nn\ne\n-d\n9\n (\nm\n\/z\n 7\n2\n\/7\n8\n)\nA\nB\n \nFigure 3 \nCalibration for A) GHB via LC-MS and B) methadone via GC-MS \nNote: Peak area ratio (PA) of analyte divided by internal standard; n = 3; standard deviation as error bars \n \nResult evaluation \nThe reagents themselves did not interfere with the GC or LC-MS results as only a few drug \nspecific mass-to-charge ratios were evaluated in data treatment. Other detection techniques \nsuch as UV detection were not found suitable as the microcrystalline reagents interfered by \nabsorbing in the UV. \n \nIt has been demonstrated in this study that the ionic bond formed during the process of \ncrystallisation could be easily broken by applying the appropriate solvent onto the \nmicrocrystalline test sample. The proposed procedure used 0.1 mg of the solid drug sample \nand delivered presumptive testing, screening, confirmation and quantification. Depending on \nthe sensitivity of the microcrystalline test applied and the purity of the tested sample, even a \nlower concentration of the drug sample can be used. \n \nCONCLUSIONS \nMethadone and γ-hydroxybutyrate were successfully recovered after performing \nmicrocrystalline tests. It was proven that microcrystalline tests are reversible and non-\ndestructive. It was possible to use the microcrystalline test technique in conjunction with \nseparation techniques to perform a successful qualitative and quantitative forensic drug \nanalysis. Paired up both techniques can deliver a fast and reliable result using only a few \nmicrograms of a suspected drug sample. \n \n 7\nAcknowledgement \nThe authors would like to express their gratitude to the University of Lincoln for supporting this \nresearch. \n \nREFERENCES \n[1] C.C. Fulton, Modern Microcrystal Tests for Drugs, first ed., John Wiley & Sons, Inc., New \nYork, 1969. \n[2] R.G. Nichols, Drug proficiency test false positives: a lack of critical thought, Science and \nJustice 37 (1997), 191-196. \n[3] M.P. Elie, L.E. Elie, Microcrystalline tests in forensic drug analysis, in: R.A. Meyers (Ed.), \nEncyclopaedia of Analytical Chemistry, John Wiley & Sons Ltd., Larkspur, USA 2009. \n[4] M. Wood, M. Laloup, N. Samyn, M.R. Morris, E.A. de Bruin, R.A. Maes, M.S. Young, V. \nMaes, G. De Boeck, Simultaneous analysis of gamma-hydroxybutyric acid and its precursors \nin urine using liquid chromatography-tandem mass spectrometry, Journal of Chromatography \nA 1056 (2004), 83-90. \n[5] G.I. Kang, F.S. Abbott, Analysis of methadone and metabolites in biological fluids with gas \nchromatography-mass spectrometry, Journal of Chromatography B 231 (1982), 311-319. \n[6] M.P. Elie, M.G. Baron, J.W. Birkett, Enhancement of microcrystalline identification of γ-\nhydroxybutyrate, Journal of Forensic Sciences 53 (2008), 147-150. \n[7] E.G.C. Clarke, Isolation and Identification of Drugs, first ed., The Pharmaceutical Press, \nLondon, 1969. \n[8] J.W. Mercer, L.S. Oldfield, K.N. Hoffmann, D.M. Shakleya, S.C. Bell, Comparative analysis \nof gamma-hydroxybutyrate and gamma-hydroxyvalerate using GC\/MS and HPLC, Journal of \nForensic Sciences 53 (2007), 383-388. \n[9] S.C. Bell, L.S. Oldfield, D.M. Shakleya, J.L. Petersen, J.W. Mercer, Chemical composition \nand structure of the microcrystals formed between silver(I) and γ-hydroxybutyric acid and γ-\nhydroxyvaleric acid, Journal of Forensic Science 51 (2006) 808-811. \n \n"}