{"doi":"10.1016\/j.jhydrol.2011.02.005","coreId":"52517","oai":"oai:nora.nerc.ac.uk:14084","identifiers":["oai:nora.nerc.ac.uk:14084","10.1016\/j.jhydrol.2011.02.005"],"title":"Pumping test analysis using a layered cylindrical grid numerical model in a complex, heterogeneous Chalk Aquifer","authors":["Mansour, M.M.","Hughes, A.G.","Spink, A.E.F.","Riches, J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-02-05","abstract":"A groundwater investigation including several pumping tests has been carried out by Thames Water Utilities Limited (TWUL) to improve the understanding of the distribution of hydraulic properties of the Chalk in the Swanscombe area of Kent in south-eastern England.  The pumping test behaviour is complicated by: the fractured condition of the Chalk, simultaneous pumping from adjacent boreholes, and variable pumping rates during the test.  In addition, the groundwater flow system is complicated by quarrying of the Chalk.  Analytical solutions for pumping test analysis fail to represent these complex flow processes and cannot reproduce the observed time drawdown curves.  A layered cylindrical grid numerical model has been applied to the results of the Swanscombe pumping test.  This model can represent the heterogeneity of the aquifer and the detailed flow processes close to the abstraction borehole such as well storage, seepage face and well losses.  It also includes a numerical representation of the moving water table using a grid that deforms to eliminate numerical instabilities.  The analyses of the test results demonstrate that they are significantly influenced by fracture flow, which needs to be included to improve the simulation of the groundwater system; not withstanding this, the layered cylindrical grid numerical model reproduced many of the features in observed time-drawdown, which allowed an assessment of the hydraulic characteristics of the aquifer as well as the investigation of the impact of quarries on the test results.  This has demonstrated that the numerical model is a powerful tool that can be used to analyse complex pumping tests and aid to improvement of the conceptual understanding of a groundwater system","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52517.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/14084\/1\/Mansouretal_2011.pdf","pdfHashValue":"aa8cd19350f383a312d597e0fa7d5b56043b30c0","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:14084<\/identifier><datestamp>\n      2012-11-22T12:19:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14084\/<\/dc:relation><dc:title>\n        Pumping test analysis using a layered cylindrical grid numerical model in a complex, heterogeneous Chalk Aquifer<\/dc:title><dc:creator>\n        Mansour, M.M.<\/dc:creator><dc:creator>\n        Hughes, A.G.<\/dc:creator><dc:creator>\n        Spink, A.E.F.<\/dc:creator><dc:creator>\n        Riches, J.<\/dc:creator><dc:description>\n        A groundwater investigation including several pumping tests has been carried out by Thames Water Utilities Limited (TWUL) to improve the understanding of the distribution of hydraulic properties of the Chalk in the Swanscombe area of Kent in south-eastern England.  The pumping test behaviour is complicated by: the fractured condition of the Chalk, simultaneous pumping from adjacent boreholes, and variable pumping rates during the test.  In addition, the groundwater flow system is complicated by quarrying of the Chalk.  Analytical solutions for pumping test analysis fail to represent these complex flow processes and cannot reproduce the observed time drawdown curves.  A layered cylindrical grid numerical model has been applied to the results of the Swanscombe pumping test.  This model can represent the heterogeneity of the aquifer and the detailed flow processes close to the abstraction borehole such as well storage, seepage face and well losses.  It also includes a numerical representation of the moving water table using a grid that deforms to eliminate numerical instabilities.  The analyses of the test results demonstrate that they are significantly influenced by fracture flow, which needs to be included to improve the simulation of the groundwater system; not withstanding this, the layered cylindrical grid numerical model reproduced many of the features in observed time-drawdown, which allowed an assessment of the hydraulic characteristics of the aquifer as well as the investigation of the impact of quarries on the test results.  This has demonstrated that the numerical model is a powerful tool that can be used to analyse complex pumping tests and aid to improvement of the conceptual understanding of a groundwater system.  <\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2011-02-05<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14084\/1\/Mansouretal_2011.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Mansour, M.M.; Hughes, A.G.; Spink, A.E.F.; Riches, J..  2011  Pumping test analysis using a layered cylindrical grid numerical model in a complex, heterogeneous Chalk Aquifer.   Journal of Hydrology, 401 (1-2). 14-21.  https:\/\/doi.org\/10.1016\/j.jhydrol.2011.02.005 <https:\/\/doi.org\/10.1016\/j.jhydrol.2011.02.005>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00221694<\/dc:relation><dc:relation>\n        10.1016\/j.jhydrol.2011.02.005<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/14084\/","http:\/\/www.sciencedirect.com\/science\/journal\/00221694","10.1016\/j.jhydrol.2011.02.005"],"year":2011,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"Accepted Manuscript\nPumping Test Analysis Using a Layered Cylindrical Grid Numerical Model in\na Complex, Heterogeneous Chalk Aquifer\nM.M. Mansour, A.G. Hughes, A.E.F. Spink, J. Riches\nPII: S0022-1694(11)00100-4\nDOI: 10.1016\/j.jhydrol.2011.02.005\nReference: HYDROL 17509\nTo appear in: Journal of Hydrology\nReceived Date: 2 February 2010\nRevised Date: 10 January 2011\nAccepted Date: 3 February 2011\nPlease cite this article as: Mansour, M.M., Hughes, A.G., Spink, A.E.F., Riches, J., Pumping Test Analysis Using\na Layered Cylindrical Grid Numerical Model in a Complex, Heterogeneous Chalk Aquifer, Journal of Hydrology\n(2011), doi: 10.1016\/j.jhydrol.2011.02.005\nThis is a PDF file of an unedited manuscript that has been accepted for publication. As a service to our customers\nwe are providing this early version of the manuscript. The manuscript will undergo copyediting, typesetting, and\nreview of the resulting proof before it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain.\n  \n 1\nTitle page: 1 \nPumping Test Analysis Using a Layered Cylindrical Grid Numerical 2 \nModel in a Complex, Heterogeneous Chalk Aquifer. 3 \nM. M. Mansour, A. G. Hughes, A. E. F. Spink, J. Riches 4 \nFirst author 5 \nFirst name: Majdi  6 \nMiddle Name:  M 7 \nLast Name: Mansour 8 \nAcademic degrees:  BSc, MSc, PhD. 9 \nAffiliation:  Senior Scientific Officer. British Geological Survey. Keyworth. 10 \nNottingham. UK 11 \nEmail: majm@bgs.ac.uk 12 \nAddress:  British Geological Survey 13 \n  Kingsley Dunham Centre 14 \n  Keyworth, 15 \nNottingham, UK 16 \nNG12  5GG 17 \n 18 \nContributing author 1 19 \nFirst name: Andrew  20 \nMiddle Name:  G 21 \nLast Name: Hughes 22 \nAcademic degrees:  BSc, MSc, PhD. 23 \nAffiliation:  Principal Scientist Officer. British Geological Survey. Keyworth. 24 \nNottingham. UK 25 \nEmail: aghug@bgs.ac.uk 26 \n 27 \n 28 \nContributing author 2 29 \nFirst name: Andrew  30 \nMiddle Name:  E.F. 31 \nLast Name: Spink 32 \nAcademic degrees:  BSc, MSc, PhD. 33 \nAffiliation:  Lecturer in Groundwater. The University of Birmingham. 34 \nBirmingham. UK 35 \nEmail: a.e.f.spink@bham.ac.uk 36 \n 37 \nContributing author 3 38 \nFirst name: Jamie  39 \nMiddle Name:   40 \nLast Name: Riches 41 \nAcademic degrees:  BSc, MSc. 42 \nAffiliation:  Groundwater Resources Consultant. Thames Water. Reading. UK 43 \nEmail: Jamie.Riches@thameswater.co.uk 44 \n 45 \n 46 \n  \n 2\nPumping Test Analysis Using a Layered Cylindrical Grid Numerical 47 \nModel in a Complex, Heterogeneous Chalk Aquifer. 48 \nM. M. Mansour, A. G. Hughes, A. E. F. Spink, J. Riches 49 \nAbstract 50 \nA groundwater investigation including several pumping tests has been carried out by 51 \nThames Water Utilities Limited (TWUL) to improve the understanding of the 52 \ndistribution of hydraulic properties of the Chalk in the Swanscombe area of Kent in 53 \nsouth-eastern England.  The pumping test behaviour is complicated by: the fractured 54 \ncondition of the Chalk, simultaneous pumping from adjacent boreholes, and variable 55 \npumping rates during the test.  In addition, the groundwater flow system is 56 \ncomplicated by quarrying of the Chalk.  Analytical solutions for pumping test analysis 57 \nfail to represent these complex flow processes and cannot reproduce the observed 58 \ntime drawdown curves.  A layered cylindrical grid numerical model has been applied 59 \nto the results of the Swanscombe pumping test.  This model can represent the 60 \nheterogeneity of the aquifer and the detailed flow processes close to the abstraction 61 \nborehole such as well storage, seepage face and well losses.  It also includes a 62 \nnumerical representation of the moving water table using a grid that deforms to 63 \neliminate numerical instabilities.  The analyses of the test results demonstrate that 64 \nthey are significantly influenced by fracture flow, which needs to be included to 65 \nimprove the simulation of the groundwater system; not withstanding this, the layered 66 \ncylindrical grid numerical model reproduced many of the features in observed time-67 \ndrawdown, which allowed an assessment of the hydraulic characteristics of the 68 \naquifer as well as the investigation of the impact of quarries on the test results.  This 69 \nhas demonstrated that the numerical model is a powerful tool that can be used to 70 \n  \n 3\nanalyse complex pumping tests and aid to improvement of the conceptual 71 \nunderstanding of a groundwater system.   72 \n1.0 Introduction 73 \nDuring the later part of 2002, a multiple borehole pumping test was conducted by 74 \nThames Water Utilities Limited (TWUL) to understand the hydraulic properties of the 75 \nChalk aquifer, in the Swanscombe area of Kent in south-eastern England, and to 76 \nassess abstraction sustainability (Fig. 1).  Pumping tests are controlled field 77 \nexperiments carried out to determine the hydraulic properties of an aquifer or to 78 \nvalidate a conceptual model of a groundwater system (BSI 1992).  Such tests yield 79 \nplots of time-drawdown values which exhibit a behaviour dictated by the hydraulic 80 \ncharacteristics of the aquifer.  Under ideal conditions, this behaviour can be 81 \nrepresented by analytical solutions to obtain the values of the hydraulic parameters of 82 \nthe aquifer.  Typical time-drawdown plots, produced by these analytical solutions, 83 \nhave been described by a number of researchers, for example Neuman (1971, 1979), 84 \nStreltsova (1972, 1973), Gambolati (1976), and Kruseman and de Ridder (1990). 85 \nPrevious studies of Chalk aquifer properties show that the transmissivity and storage 86 \ncoefficient vary spatially depending on the geological development of the Chalk 87 \n(Allen et al. 1997).  The development of fractures complicates the groundwater flow 88 \nbehaviour and solution processes greatly affect the characteristics of the Chalk and the 89 \nflow mechanisms within it, which is often referred to as dual-porosity.  It is, therefore, 90 \nanticipated that the hydraulic properties of the Chalk in the Swanscombe area will be 91 \nspatially variable, causing the time-drawdown curves to deviate from the typical plots.  92 \nThis deviation is potentially exacerbated by: the existence of large active sub-water 93 \ntable quarries (Fig. 2a); simultaneous abstraction from adjacent boreholes leading to 94 \ninterfering cones of depression; and because of the occurrence of generator outages 95 \n  \n 4\ncausing random interruption to abstraction and unplanned periods of groundwater 96 \nhead recovery.  Consequently, the commonly used analytical solutions such as 97 \nTheis (1935) solution and the Cooper and Jacob (1946) approximation for analysing 98 \npumping tests in confined aquifers, the Hantush-Jacob (1955) solution for leaky 99 \naquifers, Boulton’s (1954) model, Dagan’s (1967) solution and Neuman’s (1972) 100 \nequations for tests in unconfined aquifers cannot be applied effectively to the 101 \nSwanscombe pumping test.  Other analytical solutions such as the analytical solution 102 \nfor partially penetrating wells in unconfined aquifers (Neuman 1974) or (Moench 103 \n1993; 1994), the analytical solution that accounts for pumping from large diameter 104 \nwells in unconfined aquifers (Moench 1997), the solution for unsteady flows in 105 \nsingle-porosity or double-porosity confined aquifers (Barker 1988), etc. target specific 106 \nproblems and cannot simulate the flow processes of this complex pumping test.  A 107 \nnumerical layered cylindrical grid model is applied to improve the conceptual 108 \nunderstanding of the system, especially the impact of quarries and to determine the 109 \nvalues of the hydraulic parameters of the Chalk aquifer.  This paper demonstrates that 110 \nthis numerical model is a flexible tool that can be applied to answer questions 111 \nimposed by the conceptual model, in this case the effect of quarries, and improves it.  112 \nIt also demonstrates that despite the complexity of the Chalk groundwater system, the 113 \nnumerical model can reproduce satisfactorily much of the behaviour of the observed 114 \ntime-drawdown curves, allowing a better understanding of the aquifer hydraulic 115 \ncharacteristics.   116 \n 117 \n2.0 Materials and methods 118 \nThe Swanscombe area is located on the south-eastern side of the London Basin 119 \n(Fig 1).  It comprises the main valley of the River Thames, bordered by wide terraces, 120 \nand Palaeogene age deposits over a Chalk plateau, which is terminated by an 121 \n  \n 5\nescarpment to the south.  The Chalk has a maximum thickness of approximately 122 \n200 m and is partly covered by Palaeogene deposits comprising the Lambeth Group 123 \nand the Thames Group.  Along the Thames in the north of the area, the Chalk is 124 \noverlain by terrace deposits and riverine alluvium.  The regional hydraulic gradient 125 \nslopes from the North Downs escarpment northwards towards the Thames.  The area 126 \nis drained by the River Thames to the north, the Rivers Cray and Darent in the west 127 \nand the Rivers Ebbsfleet and Medway in the east.  For further information about the 128 \nregional hydraulic gradient refer to Darling et al (2010). 129 \nCharacteristic of the Swanscombe area is an abundance of raw materials that are 130 \nutilised by the cement industry: chalk, clay and alluvial deposits are worked and 131 \ngravel extraction is also common.  Several sub-water-table quarries have been 132 \nabandoned as the costs of dewatering have exceeded the rewards from quarrying.  133 \nOther quarries are reaching their maximum development depth and, when they close, 134 \npumping will cease.  Two quarries in particular form the focus of this study; the 135 \nEastern Quarry, which is ceased operating in late 2007 and the Western Quarry, which 136 \nhas now been developed into a shopping centre.   137 \nThe pumping test involved two abstraction wells plus four abstraction boreholes and 138 \nthirty-one observation boreholes (Fig. 2).  The two abstraction wells, defined as such 139 \non the basis of their large diameter size, are the Greenhithe abstraction well and the 140 \nSouthfleet abstraction well. Greenhithe abstraction well is located near the north-141 \nwestern corner of Eastern Quarry approximately 150 m from its western edge, and 142 \nSouthfleet abstraction well is close to the Eastern Quarry and located approximately 143 \n550 m from its eastern side (Fig. 2a).  These two pumping wells are approximately 144 \n2700 m apart.  The four abstraction boreholes, defined as such on the basis of their 145 \nrelatively small diameter size, are located in the area south of the quarries.  These 146 \n  \n 6\nboreholes are: Site A (the Western Bean Farm borehole), Site B (the West Drudgeon 147 \nFarm borehole), Site C (the Mid Drudgeon Farm borehole) and Site D (the West 148 \nBeacon Wood borehole).  Of the four abstraction boreholes, Site A is closest to the 149 \nGreenhithe well at a distance of 1800 m and Site C is the closest to Southfleet at a 150 \ndistance of 2000 m.  A distance of approximately 1300 m separates Sites A and C. 151 \nPumping started on 18 October 2002 at sites A, B, and C with abstraction rates of 152 \n19.0 l\/s, 12.7 l\/s and 77.5 l\/s respectively.  Abstraction at Site D started eight days 153 \nlater at a rate of 49.0 l\/s.  Abstraction at Greenhithe and Southfleet started 28 days 154 \nlater at rates of 46.0 l\/s and 37.0 l\/s respectively.  The abstraction at all sites ceased on 155 \nthe 16 December 2002 and the recovery at the abstraction boreholes was recorded for 156 \na further two days.  During the pumping phase, abstraction was interrupted randomly 157 \nat all the sites either because of generator failures or for generator maintenance, 158 \nleading to unplanned recovery periods. This paper focuses on the results obtained at 159 \nSite C and two of its neighbouring observation boreholes, boreholes 12 and 19, to 160 \nillustrate the complexity of the Chalk groundwater system and the advantages of using 161 \nthe numerical radial flow model to simulate this groundwater system and analyse the 162 \npumping test results.  The observed drawdown results are shown in Figures 5 and 6. 163 \n3.0 Theory\/calculation  164 \nThe layered cylindrical grid numerical model uses the finite-difference method to 165 \nsolve the basic equation describing flow through a porous medium under confined and 166 \nunconfined conditions.  To simulate groundwater flow converging to a pumped well, 167 \nthe three-dimensional basic flow equation is written in cylindrical coordinates and the 168 \naquifer is discretised using a grid illustrated in Figure 3.  For confined aquifers and in 169 \nterms of the drawdown (s) this equation is given by (Rushton 2003):  170 \nN\nt\nsS\nz\ns\nr\nKs\nr\nK\nr\ns\nr\nK\nr\nsK szrr +∂\n∂\n=\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n2\n2\n22\n2\n22\n2\nθ\nθ    Equation 1 171 \n  \n 7\nWhere: 172 \n  zr KandKK θ, are the hydraulic conductivities in the radial, the 173 \ncircumferential and the vertical directions respectively.   (LT-1) 174 \n  sS is the specific storage      (L\n-1) 175 \n  N  is an external source term.      (T-1) 176 \n  r  is the radius from the centre of the abstraction borehole to the point where 177 \nthe drawdown s is calculated     (L) 178 \nIn a layered system, the head values of Equation 1 are averaged over the layer 179 \nsaturated thickness and the horizontal hydraulic conductivity is replaced by the 180 \ntransmissivity of the layer.  This does not apply at the uppermost layer if the 181 \ngroundwater system is under unconfined conditions.  Under these conditions an 182 \nadditional numerical layer is created at the top of the uppermost layer of the model to 183 \nrepresent the presence of the water table (Fig. 3).   184 \nThe equation that describes the movement of the water table is discussed by Todsen 185 \n(1971) and Neuman (1972) and is given by:  186 \n⎟⎠\n⎞⎜⎝\n⎛\n∂\n∂\n−\n∂\n∂\n∂\n∂\n+\n∂\n∂\n∂\n∂−\n=\n∂\n∂\nz\nsKs\nr\nK\nrr\nsK\nnt zre θ\nϕ\nθ\nϕϕ θ\n2\n1     Equation 2  187 \nWhere: 188 \n  ϕ  is a function that represents the location of the water table and  (L) 189 \n  en  is the porosity of the aquifer.    (Dimensionless) 190 \nThe complexity of this non-linear equation can be reduced by assuming that the 191 \nproduct of the hydraulic gradients is small and can be neglected (Rushton and 192 \nRedshaw 1979).  In this case Equation 2 reduces to: ⎟⎠\n⎞⎜⎝\n⎛\n∂\n∂\n=\n∂\n∂\nz\nsK\nSt zy\n1ϕ  where the 193 \nporosity is considered to be approximately equal to the specific yield yS .  By changing 194 \n  \n 8\nthe subject, this equation can be written as: \nt\nS\nz\nsK yz ∂\n∂\n=\n∂\n∂ ϕ  and then by Darcy’s law: 195 \nt\nSq yz ∂\n∂\n=\nϕ , allowing the term zq  to be added to the right hand side of Equation 1, 196 \nwhich is then applied only to the water table nodes.  The radial interval between nodes 197 \nincreases in a logarithmic pattern from the centre of the abstraction borehole where 198 \nthe numerical grid is centred to the outer boundary.  This creates a large number of 199 \nnodes close to the abstraction well and improves the representation of the steep 200 \nhydraulic gradient as a result of pumping in the vicinity of the abstraction borehole.  201 \nIn contrast to a general saturated aquifer node, a water table node changes its location 202 \nvertically based on its head value calculated at the end of a time step (Fig. 3).  This 203 \nallows the aquifer to dewater as the water table moves downwards and the saturated 204 \nthickness of the uppermost layer becomes spatially variable.   The vertical flow 205 \nbetween nodes in different layers is determined by considering mass conservation at 206 \nthe interface between layers.   207 \nTo represent the water contained within the abstraction well, i.e. well storage, the 208 \nvalues storage coefficients of the nodes located inside the abstraction borehole and 209 \nwhere pumping is applied are all set to unity.  The occurrence of the seepage face is 210 \nrepresented by acknowledging that the aquifer nodes located at the abstraction 211 \nborehole face became subject to atmospheric pressure when the water levels inside the 212 \nabstraction borehole drops below the base of their corresponding layers.  When this 213 \nhappens the groundwater head values of these nodes are fixed to a value equal to the 214 \nbase elevations of their corresponding layers.     215 \nThe model code has been developed in C++ programming language and benefits from 216 \nthe object-oriented technology. Information on the application of this technology in 217 \ngroundwater modelling can be found in the work of Spink et al. (2003) and 218 \n  \n 9\nJackson et al. (2003).  For a full description of the model and its application refer to 219 \nMansour (2003) and Mansour et al. (2003).  This type of model is preferred to the 220 \nCartesian grid groundwater  models that allow grid refinement such as ZOOMQ3D 221 \n(Jackson et al. 2003) and MODFLOW 2005 (Harbaugh 2005) because of its better 222 \nrepresentation of the flow processes taking place next to the abstraction borehole, e.g. 223 \nwell losses, well storage, seepage face, etc.  In addition, although the Cartesian grid 224 \nmodels yield accurate solutions at the observation boreholes, the solution at the 225 \nabstraction borehole is less accurate. The inaccuracy at the abstraction borehole is 226 \nprimarily due to the structure of the Cartesian numerical grid, which does not allow 227 \nthe specification of nodes at the well face and consequently it is not possible to set the 228 \nhydraulic conductance values between the node inside the well and its surrounding 229 \naquifer nodes correctly.  In addition, it is not possible to set both the area and the 230 \nperimeter of a rectangular cell in a Cartesian model to be equal to the area and 231 \nperimeter of the actual circular abstraction borehole at the same time.  If the numerical 232 \ngrid is refined so that the area of the rectangular cell is equal to the area of the 233 \nabstraction borehole the rectangular cell will have a perimeter that is smaller than the 234 \nactual borehole perimeter.  As the area through which groundwater is flowing from 235 \nthe aquifer to the abstraction borehole in the numerical model is smaller than in 236 \nreality, it causes the simulated drawdown to be greater than the observed one.   237 \nThe preprocessor, RADMOD (Reilly and Harbaugh 1993), has been developed for 238 \nMODFLOW (McDonald and Harbaugh 1988) to simulate axi-symmetric flow to a 239 \nwell.  The radial flow model reported here has the advantage of simulating the moving 240 \nwater table, which cannot be done in RADMOD. 241 \n 242 \n  \n 10\n4.0 Results and discussion 243 \n4.1 Conceptual model 244 \nThe Chalk aquifer is partly overlain by Palaeogene strata in the Swanscombe area 245 \n(Fig. 1 and Fig. 2).  However, the water table is within the Chalk Formation almost 246 \neverywhere and the Chalk is the only source of groundwater available for abstraction.  247 \nWhile groundwater flow in the Chalk is complicated by the presence of fractures or 248 \nhigh conductivity zones as demonstrated in the analysis of an earlier individual 249 \npumping test (Spink and Mansour 2003), it has not been possible to determine the 250 \nsize, extents, and directions of these high conductivity zones.  Consequently, these 251 \nzones cannot be represented in details in the conceptual model and the Chalk aquifer 252 \nis represented here using two uniform hydro-geological layers.  The upper one, in 253 \nwhich the high conductivity zones are better developed, is in direct contact with the 254 \nabstraction borehole at Site C.  The lower layer, which represents the remainder of the 255 \nChalk and is less well developed, is also included as it may contribute to the total 256 \nwater abstracted (Fig. 2b).  Aquifer permeability values obtained from the analysis of 257 \nthe pumping test are related, therefore, to both the Chalk matrix and the fractures or 258 \nhigh conductivity zones within it.    259 \nThe layered cylindrical grid model can address conceptual complexities related to the 260 \nrepresentation of flow processes next to the abstraction borehole, the variation of 261 \npumping rates, and the simultaneous pumping from more than one borehole.  262 \nHowever, the effects of the quarries on the pumping test results are not fully 263 \nunderstood.  The quarries may cause an increase in drawdown because of the reduced 264 \naquifer thickness in the zone where the aquifer is missing and through which 265 \ngroundwater flows are converging towards the abstraction well.  Conversely, it may 266 \nbe also possible that the water held in the topographical depressions on the surface of 267 \n  \n 11\nthese quarries provides the system with a source of water which compensates the 268 \neffects of the missing part of the aquifer.  These two conceptual representations of the 269 \nquarries are investigated by the numerical model. 270 \n 271 \n4.2 Overview of the test results: preliminary assessment 272 \nThe time-drawdown curve of the first abstraction phase at Site C (Fig. 5 Phase 1) does 273 \nnot show the typical unconfined behaviour because of the step increases in the 274 \npumping rate at the start of the test.  The typical behaviour of a time-drawdown curve 275 \nin unconfined aquifers, as explained by Kruseman and de Ridder (1990), has an ‘S’ 276 \nshape (Fig. 4a) when plotted on logarithmic axes.  Each section of the S curve reflects 277 \nthe changes in the dominant process occurring in the aquifer.  At early times, the 278 \nabstracted water is released instantaneously from storage by the expansion of the 279 \nwater and the compaction of the aquifer.  The unconfined aquifer effectively behaves 280 \nas confined, but the time-drawdown curve may not match the Theis solution because 281 \nof well storage, which delays the start of drawdown at the observation boreholes 282 \n(Zone 1 of Fig. 4a).  Once the water table starts falling, the quantity of water released 283 \nfrom specific yield (Sy) reduces the gradient of the intermediate-time segment and the 284 \ntime-drawdown curve is comparable to that obtained from a leaky aquifer (Zone 2 of 285 \nFig. 4a).  In the third stage, the time-drawdown curve once again tends to conform to 286 \na Theis curve based on storage due to Sy.  At this time, the water table is the major 287 \ncontributor to the water abstracted from the aquifer (Zone 3 of Fig. 4a).   288 \nWhen plotted on logarithmic time and linear drawdown axes, the time-drawdown 289 \ncurve also takes a typical shape that can be divided into three segments.  The first is a 290 \nstraight line that matches the Theis solution, if well storage is small (last part of the 291 \ncurve in Zone 1 of Fig. 4b).  The second starts when the straight line changes gradient 292 \n  \n 12\nand flattens indicating that storage from water table is contributing to the system.  The 293 \nlength of the second segment depends on the vertical hydraulic conductivity and the 294 \nspecific yield of the aquifer (Zone 2 of Fig. 4b).  The third segment starts when the 295 \nrate of drawdown increases again reflecting the fall of the water table (Zone 3 of 296 \nFig. 4b).   297 \nThe plot of the first abstraction phase at Site C (Fig. 5 Phase 1) also shows a delayed 298 \nincrease in the drawdown values at the start of the test indicating the presence of a 299 \nsignificant source of water which is likely to be well storage.  The time-drawdown 300 \ncurves of the subsequent abstraction phases, however, show typical unconfined 301 \nbehaviour but do not reflect the expected water table movement at later times.  The 302 \npresence of a larger well storage component is evident in these phases and is reflected 303 \nby the delayed fall at the start of each phase.  The field data collected during the 304 \nrecovery phase (Fig. 5 Phase 7) show a delayed initial rise that is probably due to 305 \nproblems in the measuring device and cannot be used to confirm this large well 306 \nstorage.    307 \n 308 \n4.3 Numerical analysis 309 \nSite C abstraction borehole diameter is 0.42 m, with a depth of 137 m.  It is cased to a 310 \ndepth of 75 m below the ground surface.  A 43 m layer of Palaeogene deposits 311 \noverlies the Chalk at this site but the initial water level is recorded at a depth of 312 \n77.1 m from the ground surface indicating that the water table is not found within the 313 \nPalaeogene strata.  The pumping borehole is open along its full saturated depth.  314 \nWhile the casing of the Site C abstraction borehole has a diameter of 0.42 m, 315 \ngeophysical well logging (Buckley 2003) indicates that this borehole is larger than its 316 \nnominal size in the open section.  Accordingly, the well diameter used in the model is 317 \n  \n 13\nincreased to 0.6 m, which is the average diameter shown by the borehole logs.  The 318 \nfirst part of the Chalk aquifer, which is in direct contact with the abstraction well, is 319 \napproximately 60 m thick at this position (Fig. 2b).  It is represented numerically by 320 \nfour layers, the three uppermost layers are 10 m thick and the lower one is 30 m thick.  321 \nThe narrow thicknesses of the first three layers allow the formation of the seepage 322 \nface at the abstraction borehole wall.  The second, deeper Chalk layer, which is not in 323 \ncontact with the abstraction borehole (Fig. 2b), is approximately 108 m thick and 324 \nrepresented in the model by one numerical layer.   325 \nA three dimensional model was built to improve the representation of the quarries and 326 \nto improve the locations of the abstraction and observation boreholes within the 327 \nmodel.  In a single slice numerical model, i.e. assuming radial symmetry and 328 \nsimulating groundwater flow using the radial and vertical directions only, observation 329 \nborehole 12 coincides with Site D abstraction borehole and observation borehole 17 330 \ncoincides with Site B abstraction borehole.  Consequently, it is not possible to 331 \nsimulate the groundwater heads at the observation wells correctly as they coincide 332 \nwith the abstraction boreholes.  The three-dimensional numerical model is built by 333 \nreplicating the vertical cross section described above fourteen times along different 334 \nradial directions.  The 14 slices provided a line of nodes along the radial direction 335 \nnext to the abstraction and observation boreholes of interest (Fig. 2a).  In three-336 \ndimensional view the numerical model takes a form that is similar to the one shown in 337 \nFigure 3 but without the well casing.  While the groundwater flow processes at 338 \nborehole Site C are represented in detail, the remaining pumping boreholes are 339 \nincluded in the model by assigning the corresponding abstraction to the nearest model 340 \nnode (Fig. 2a).   341 \n  \n 14\nThe model was calibrated by modifying the values of the aquifer hydraulic parameters 342 \nuntil the simulated drawdown curves match the observed ones.  Many trial values for 343 \nthe aquifer parameters were used to match the simulated and field time drawdown 344 \ncurves.  Commencing with parameter values suggested by previous studies of the 345 \nChalk (Allen et al. 1997), each trial involved changing the value of one parameter, 346 \nbased on the effects that this parameter has on the relevant time-drawdown curves.  347 \nThe parameters modified are: the horizontal and vertical hydraulic conductivities, the 348 \nspecific yield and the specific storage of each layer of the model.  Possible values for 349 \nthe different hydraulic parameters can be established from this trial and error exercise.  350 \nTo improve the fit between the numerical and field results the parameter estimation 351 \npackage PEST (Doherty 2004) was used.  PEST is model-independent software that 352 \nmodifies the input files of the model and adjusts a preselected set of its parameters 353 \nuntil the discrepancy between the field and numerical results are reduced to a 354 \nminimum.  PEST undertakes many model runs to optimise the parameter values and 355 \nto perform uncertainty analysis.  PEST was used here to refine the hydraulic 356 \nparameter values and to estimate the uncertainty associated with these values.  357 \nInitially PEST was used without the inclusion of the quarries in the numerical model.  358 \nThe parameters modified by PEST were: the horizontal and vertical hydraulic 359 \nconductivities, the specific yield and the specific storage, and the well loss factor.   360 \nThe values of the hydraulic parameters optimised by PEST, as well as the estimated 361 \n95% confidence limits, are given in Table 1.  The optimised transmissivity value of 362 \nthe part of the Chalk that is in direct contact with the borehole is 1340 m2 day-1.  The 363 \noptimised vertical hydraulic conductivity value is 0.86 m day-1.  The optimised 364 \nstorage coefficient and specific yield are 5101 −× m-1 and 0.012 respectively.   365 \n  \n 15\nSubsequently, the quarries are added to the numerical model by altering the hydraulic 366 \nconnections between the nodes to either remove the volume represented by the 367 \nquarries completely, or by reducing the thickness of the first layer of the Chalk, but 368 \nassuming that the water stored within the quarry is significant and is available to be 369 \ndrawn by the abstraction boreholes.   Two additional runs were undertaken to 370 \nrepresent these conditions.  In the first run the quarries were included in the model by 371 \nintroducing internal impermeable boundaries along the quarry walls in the uppermost 372 \nnumerical layer (numerical link (H) in Figure 3).  The nodes located within the quarry 373 \narea, however, remained connected to the nodes underneath them by the mean of the 374 \nvertical hydraulic conductivity (numerical links (V) in Figure 3).  Simulated 375 \ndrawdown values produced from this run did not show significant differences from 376 \nthe results when the quarry is ignored, because the internal boundaries do not greatly 377 \naffect the results and the vertical hydraulic connection was enough to withdraw water 378 \nfrom the specific yield storage of the nodes located within the quarry area.  In the 379 \nsecond run the vertical connections between the nodes located within the quarries and 380 \nthe nodes underneath them were both disconnected (Fig. 3).  This run assumed that 381 \nthe quarried Chalk was absent.  The simulated drawdown values were influenced by 382 \nthe disconnection of the nodes within the quarries, especially at the end of the 383 \nabstraction phases.  These are the results presented in Figures 5 and 6.   384 \nFigure 5 shows a comparison between the simulated and observed drawdown values 385 \nat the abstraction borehole C.  The numerical model reproduced satisfactorily the 386 \nsteps in the time-drawdown curve of the first abstraction phase.  In addition, the 387 \nsimulated drawdown values and the gradient of the time-drawdown curve from 388 \n0.01days follow the observed ones, indicating that the hydraulic parameters used in 389 \nthe numerical model are representative to the overall hydraulic characteristics of the 390 \n  \n 16\naquifer.  The slight drawdown observed at approximately one day was produced after 391 \nthe inclusion of quarries in the numerical model.  The delayed decline recorded in the 392 \nfield data (Fig. 5 Phase 2) suggests the presence of a larger well storage component 393 \nthan is evident in the other phases.  The field data collected during the recovery phase 394 \n(Fig. 5 Phase 7) show a delayed initial rise, but this may be due to a problem with the 395 \nmeasuring device.  However, the numerical results do show an acceptable level of 396 \nrecovery compared to the field data when abstraction is interrupted in the fourth 397 \nabstraction phase (Fig. 5 Phase 4).  398 \nMany of the observation boreholes show little response to pumping at the abstraction 399 \nboreholes and some of the observation boreholes show fluctuations in groundwater 400 \nlevels that cannot be related to the pumping test.  The only time-drawdown curves that 401 \nshow reasonable correlation to abstraction at Site C are those at Bean Farm borehole 402 \nand Eastern Drudgeon Farm borehole, which are situated approximately 920 m and 403 \n240 m away from abstraction borehole C (Boreholes 12 and 19 in Fig. 2a).  The match 404 \nbetween the simulated and drawdown values of the first two abstraction phases is 405 \nacceptable, indicating that the hydraulic conductivity and the storage coefficient 406 \nvalues, which control the gradient of the time-drawdown curve and the start of 407 \ndrawdown respectively, are representative of the hydraulic characteristics of the 408 \naquifer (Fig. 6).  The behaviour of the simulated time-drawdown curves over the 409 \nremaining abstraction phases is comparable to the observed ones, but there are vertical 410 \nshifts between them.  This is caused by the sudden drop in drawdown values at the 411 \nend of the second abstraction phase and is particularly evident in the Eastern 412 \nDrudgeon Farm borehole.  This behaviour can be caused by the presence of fractures 413 \nthat dry up when the water table falls beneath them leading to significant change in 414 \nthe transmissivity of the Chalk aquifer.  Fractured or high conductivity zones can be 415 \n  \n 17\nmodelled using the layered cylindrical grid model.  However, in this instance it was 416 \ndecided to concentrate on the impact of the quarries on the groundwater system.  417 \n 418 \n5.0 Conclusion 419 \nThis paper discusses the analysis of a complex pumping test undertaken in the Chalk 420 \naquifer of the Swanscombe area, south-east London, using a numerical layered 421 \ncylindrical grid model.   The complexity of the Swanscombe pumping test arises from 422 \nfactors such as abstraction from a partially penetrating abstraction borehole, the 423 \nstepwise increase of abstraction, the unplanned intermittent stoppages of pumping 424 \nduring the test period and simultaneous pumping from adjacent boreholes.  In 425 \naddition, the test results were affected by the presence of major quarries in the area. 426 \nTwo scenarios are used to study the impact of the quarries on the test results.  In the 427 \nfirst scenario, a quarry is represented in the model by imposing internal impermeable 428 \nboundaries along the locations of its walls whilst allowing the water stored within it to 429 \ncontribute to the groundwater system. Quarries in this scenario did not impact the 430 \nsimulated results.  In the second scenario, in addition to the internal now flow 431 \nboundaries, the volume of water held by the quarries are completely removed from 432 \nthe model. This  quarry representation caused additional drawdown at the end of the 433 \nabstraction phases and improved the match between the observed and simulated time-434 \ndrawdown curves. This numerical configuration is used to estimate the hydraulic 435 \nparameter values of the aquifer.  436 \nThe numerical results showed that a transmissivity value of 1340 m2 day-1 of the part 437 \nof the Chalk that is in direct contact with the borehole, a vertical hydraulic 438 \nconductivity value of 0.86 m day-1, and a storage coefficient and a specific yield of 439 \n5101 −× m-1 and 0.012 respectively produce a good match between the observed and 440 \n  \n 18\nsimulated time drawdown curves. The use of the numerical model permitted the 441 \ndeployment of the parameter estimation software PEST (Doherty 2004) to optimise 442 \nthe values of the hydraulic parameters and to undertake uncertainty analysis.  It was 443 \nfound that the highest uncertainty was associated with the value of the storage 444 \ncoefficient with the 95% confidence limits being approximately 45% greater or 445 \nsmaller than the estimated value.  The second highest uncertainty is associated with 446 \nthe values of the specific yield and vertical hydraulic conductivity with the 95% 447 \nconfidence limits being approximately 25% greater or smaller than the estimated 448 \nvalues (Table 1). These values fall within the limits reported in the literature for Chalk 449 \naquifers (see for example Allen et al., 1997) and can be used to specify the hydraulic 450 \nparameter values for this site in a regional Cartesian model.  451 \nThis paper demonstrates that the layered cylindrical grid model used in this study  can 452 \nincorporate enough mechanisms to reproduce the complex behaviour of the time-453 \ndrawdown curve and has many advantages on the use of conventional analytical 454 \nsolutions and on the Cartesian models which are not designed to simulate 455 \ngroundwater flow converging to a pumped borehole. This work also demonstrates that 456 \nthe cylindrical grid numerical model is a powerful tool for analysing the pumping test 457 \nresults.  It provides useful information on both the well performance and the hydraulic 458 \ncharacteristics of the aquifer which helps improving the conceptual model of aquifers 459 \nsuch as the complex Chalk aquifer.   460 \n 461 \n 462 \n 463 \n 464 \n 465 \n  \n 19\n 466 \n 467 \n 468 \n 469 \n 470 \n 471 \n 472 \n 473 \n 474 \n 475 \n 476 \n 477 \n 478 \n 479 \n 480 \n 481 \n 482 \n 483 \n 484 \n 485 \n 486 \n 487 \n 488 \n 489 \nReferences 490 \n  \n 20\nAllen, D.J., Brewerton, L.J., Colbey, L.M., Gibbs, B.R., Lewis, M.A., Macdonald, A.M., 491 \nWagstaff, S.J., Williams, A.T,, 1997.  The physical properties of major aquifers in England 492 \nand Wales.  British Geological Survey Technical Report WD\/97\/34.  Environment Agency R 493 \n& D Publication 8 494 \nBarker, J., 1988. A generalised radial-flow model for pumping tests in fractured rock. Water 495 \nResources Research. 24, 10, 1796 – 1804. 496 \nBoulton, N.S., 1954. The drawdown of a water-table under non-steady conditions near a 497 \npumped well in an unconfined formation.  Proceedings of the Institution of Civil Engineers. 3, 498 \nPart 3, 564 – 579 499 \nBSI, 1992. Code of practice for Test pumping of water wells. BS 6316 : 1992. London, UK. 500 \nBuckley, D., 2003 Swanscombe Phase 2a Task 2.2 Geophysical Logging.  British Geological 501 \nSurvey Technical Report. CR\/01\/239C. 502 \nCooper, H.H., Jacob, C.E., 1946. A generalized graphic method for evaluating formation 503 \nconstants and summarizing well-field history.  Transactions of American Geophysical Union. 504 \n27, 4, 526 – 534. 505 \nDagan, G., 1967. Linearised solutions of free surface groundwater flow with uniform 506 \nrecharge. Journal of Geophysical Research. 72, 4, 1183 – 1193. 507 \nDarling, W.G., Gooddy, D.C., Riches, J., Wallis, I., 2010.  Using environmental tracers to 508 \nassess the extent of river–groundwater interaction in a quarried area of the English Chalk.  509 \nApplied Geochemistry. 25, 923 – 932. 510 \nDoherty, J., 2004. PEST: Model-independent parameter estimation user manual. Watermark 511 \nNumerical Computing 512 \nGambolati, G., 1976. Transient free surface flow to a well: An analysis of theoretical 513 \nsolutions. Water Resources Research. 12, 1, 27 – 39. 514 \n  \n 21\nHantush, M.S., Jacob, C.E., 1955. Non-Steady Radial Flow in an Infinite Leaky Aquifer. 515 \nTransactions of the American Geophysical Union. 36, 95 – 100. 516 \nHarbaugh, A.W., 2005. MODFLOW 2005, The U.S. Geological Survey modular ground-517 \nwater model-the Ground-Water Flow Process: U.S. Geological Survey Techniques and 518 \nmethods 6-16, variously p. 519 \nKruseman, G.P., de Ridder, N.A., 1990. Analysis and evaluation of pumping test data.  The 520 \nInternational Institute for Land Reclamation and Improvement.  Publication 47. 521 \nJackson, C.R., Hughes, A.G., Mansour, M.M., Spink, A.E.F., Bloomfield, J.P., Riches, J., 522 \nJones, M.A., 2003. Numerical modelling of a multiple-well pumping test using a locally 523 \nrefined, object-oriented regional groundwater model. MODFLOW and More 2003: 524 \nUnderstanding through modelling,  Conference Proceedings, Golden, CO, September 2003, 525 \n383 – 387. 526 \nMansour, M.M., 2003. Flow to wells in unconfined aquifers using mesh refinement and 527 \nobject-oriented technology. Ph.D. thesis.  The University of Birmingham, UK. 528 \nMansour, M.M., Spink, A.E.F., Riches, J., 2003. Numerical investigation of flow to pumped 529 \nwells in heterogeneous layered aquifers using radial flow models.  MODFLOW and More 530 \n2003: Understanding through modelling, Conference Proceedings, Golden, CO, September 531 \n2003, 388 – 392.   532 \nMcDonald, M.G., Harbaugh, A.W., 1988. A modular three-dimensional finite-difference 533 \nground-water flow model. Technical report, U.S. Geol. Survey, Reston, VA. 534 \nMoench, A.F., 1993. Computation of type curves for flow to partially penetrating wells in 535 \nwater-table aquifers. Ground Water, 31, 966 – 971.  536 \nMoench, A.F. 1994. Specific yield as determined by type-curve analysis of aquifer-test data. 537 \nGround Water 6, 2, 37 – 46. 538 \n  \n 22\nMoench, A.F. 1997. Flow to a well of finite diameter in a homogeneous, anisotropic water 539 \ntable aquifer. Water Resources Research, 33, 6, 1397 – 1407. 540 \nNeuman, S.P., Witherspoon, P.A., 1971. Analysis of non-steady flow with a free surface 541 \nusing the finite element method. Water Resources Research, 7, 3, 611 – 623. 542 \nNeuman, S.P., 1972. Theory of flow in unconfined aquifers considering delayed response of 543 \nthe water table. Water Resources Research, 8, 4, 1031 – 1045. 544 \nNeuman, S.P., 1974. Effect of partial penetration on flow in unconfined aquifers considering 545 \ndelayed gravity response. Water Resources Research, 10, 2, 303 – 312.  546 \nNeuman, S.P. 1979. Perspective on \"delayed yield\". Water Resources Research, 15, 899 – 547 \n908. 548 \nReilley, T.E., Harbaugh, A.W., 1993. Simulation of cylindrical flow to a well using the U.S. 549 \nGeological Survey modular finite-difference groundwater flow model. Ground Water, 31, 3, 550 \n489 – 494. 551 \nRushton, K.R., 2003. Groundwater Hydrology. Conceptual and computational model.  John 552 \nWiley and Sons Ltd, Chichester, UK. 553 \nRushton, K.R., Redshaw, S.C., 1979. Seepage and groundwater flow.  John Wiley and Sons, 554 \nChichester, UK. 555 \nStreltsova, T.D. 1972. Unsteady radial flow in an unconfined aquifer.  Water Resources 556 \nResearch, 8, 4, 1059 – 1066. 557 \nStreltsova, T.D., 1973. Flow near a pumped well in an unconfined aquifer under nonsteady 558 \nconditions.  Water Resources Research, 9, 1, 227 – 235. 559 \nSpink, A.E.F., Jackson, C.R., Hughes, A.G., Hulme, P.J., 2003. The benefits of object-560 \noriented modelling demonstrated through the development of a regional groundwater model. 561 \nMODFLOW and More 2003: Understanding through modelling, Conference Proceedings, 562 \nGolden, CO, September 2003, 336 – 340.  563 \n  \n 23\nSpink, A.E.F., Mansour, M.M. 2003. Swanscombe Phase 2.  Task 6: Preliminary Modelling.  564 \nReport prepared for the British Geological Survey. Wallingford, England. 565 \nTheis, C.V., 1935. The relation between the lowering of the piezometric surface and the rate 566 \nand duration of discharge of a well using groundwater storage.  Transactions of the American 567 \nGeophysical Union, 16th annual meeting, 519 – 524. 568 \nTodsen, M., 1971. On the solution of transient free-surface problems in porous media by 569 \nfinite-difference methods.  Journal of Hydrology, 12, 177 – 210. 570 \n 571 \n 572 \n 573 \n 574 \n 575 \n 576 \n 577 \n 578 \n 579 \n 580 \n 581 \n 582 \n 583 \n 584 \n 585 \n 586 \n 587 \n 588 \n  \n 24\n 589 \n 590 \nFigure 1: Regional setting of the Swanscombe area. 591 \nFigure 2: Conceptual model and numerical model setting at site C 592 \nFigure 3: Schematic representation of a multi-layered aquifer and the numerical 593 \nrepresentation of quarries. 594 \n 595 \nFigure 4: A typical time-drawdown curve obtained from pumping in unconfined 596 \naquifers. (a): log-log scale. (b): log-arithmetic scale. 597 \nFigure 5: Field and numerical time-drawdown curves at Site C abstraction borehole  598 \nFigure 6: Field and numerical time-drawdown curves at Bean Farm and Eastern 599 \nDrudgeon Farm observation boreholes 600 \nTable 1: Optimised hydraulic parameter values and the 95% confidence limits. 601 \n  \n 25\n 602 \n  \n 26\n603 \n 604 \n 605 \n 606 \n 607 \nX \nX \nSouthfleet\nGreenhithe \n(a) (b) \n  \n 27\n 608 \nUpper Layer \nLower Layer \nIntermediate Layer \nPartially penetrating \nborehole with casing \nWater table \nnodes (H) \n(V) (V) \nNumerical grid in \na vertical plane \nQuarry \nqz \n  \n 28\n 609 \n 610 \n(a)      (b)   611 \nFigure 5: A typical time-drawdown curve obtained from pumping in unconfined 612 \naquifers. (a): log-log scale. (b): log-arithmetic scale. 613 \nfinite-difference methods.  Journal of Hydrology, 12, pp 177–210 614 \n0.01\n0.1\n1\n10\n0.00001 0.0001 0.001 0.01 0.1 1\nTime (days)\nD\nra\nw\ndo\nw\nn \n(m\n)\nZone 1:\nWater released by \ngroundwater \nexpansion and \naquifer compaction. Zone 2:\nWater released \nfrom specific \nstorage and \nspecific yield. \nVertical gradient \nestablished from \nwater table.\nZone 3:\nWater \nreleased from \nwater table. \nCurve \nconforms with \nthe Theis \nsolution \nbased on Sy.\n(Curve conforms \nwith the Theis \nsolution based on \nSs but complicated \nby the contribution \nof the well storage).\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\n4\n0.00001 0.0001 0.001 0.01 0.1 1\nTime (days)\nD\nra\nw\ndo\nw\nn \n(m\n)\nZone 1:\nWater released by \ngroundwater expansion \nand aquifer compaction. \nCurve conforms with the \nTheis solution based on \nSs but complicated by the \ncontribution of the well \nstorage.\nZone 2:\nWater released \nfrom specific \nstorage and \nspecific yield.\nZone 3:\nWater \nreleased \nfrom water \ntable. Curve \nconforms \nwith the Theis \nsolution (Sy).\n(Vertical gradient \nestablished from \nwater table).\n  \n 29\n 615 \n 616 \n 617 \n 618 \n 619 \n  \n 30\n 620 \n 621 \n 622 \n 623 \n 624 \n 625 \n 626 \n 627 \n 628 \n  \n 31\n 629 \n95% confidence limits  Parameter Estimated value \nLower limit Upper limit \nHorizontal hydraulic \nconductivity Kh (m day-1) \n22.33 20.5 24 \nVertical hydraulic \nconductivity Kv (m day-1) \n0.086 0.065 0.107 \nSpecific storage Ss (m-1) 1e-05   5.5e-06 14.5e-5 \nSpecific yield Sy \n(dimensonless) \n 0.012 0.0087 0.015 \nWell loss factor \n(dimensionless) \n0.09 0.072 0.109 \n 630 \n  \n 32\nResearch highlights 631 \n 632 \n  A layered cylindrical grid model is used to analyse pumping test results 633 \nconducted in a quarried Chalk aquifer. 634 \n  Quarries did not show significant impact the results unless nodes they occupy 635 \nare completely disconnected. 636 \n  Numerical model is a powerful tool to test conceptual ideas. 637 \n   Numerical model produces useful information regarding the hydraulic 638 \ncharacteristics of the aquifer. 639 \n 640 \n 641 \n"}