{"doi":"10.1098\/rsta.2004.1426","coreId":"136134","oai":"oai:bradscholars.brad.ac.uk:10454\/3619","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3619","10.1098\/rsta.2004.1426"],"title":"Sediment transport over a flat bed in a uni-directional flow: simulations and validation.","authors":["Heald, J.","McEwan, I.K.","Tait, Simon J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2004","abstract":"NoA discrete particle model is described which simulates bedload transport over a flat bed of a unimodal mixed-sized distribution of particles. Simple physical rules are applied to large numbers of discrete sediment grains moving within a unidirectional flow. The modelling assumptions and main algorithms of the bedload transport model are presented and discussed. Sediment particles are represented by smooth spheres, which move under the drag forces of a simulated fluid flow. Bedload mass-transport rates calculated by the model exhibit a low sensitivity to chosen model parameters. Comparisons of the calculated mass-transport rates with well-established empirical relationships are good, strongly suggesting that the discrete particle model has captured the essential elements of the system physics. This performance provides strong justification for future interrogation of the model to investigate details of the small-scale constituent processes which have hitherto been outside the reach of previous experimental and modelling investigations","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3619<\/identifier><datestamp>\n                2016-07-25T16:47:04Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSediment transport over a flat bed in a uni-directional flow: simulations and validation.<\/dc:title><dc:creator>\nHeald, J.<\/dc:creator><dc:creator>\nMcEwan, I.K.<\/dc:creator><dc:creator>\nTait, Simon J.<\/dc:creator><dc:subject>\nSediment transport rate<\/dc:subject><dc:subject>\nDiscrete particle model<\/dc:subject><dc:subject>\nMomentum exchange<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nA discrete particle model is described which simulates bedload transport over a flat bed of a unimodal mixed-sized distribution of particles. Simple physical rules are applied to large numbers of discrete sediment grains moving within a unidirectional flow. The modelling assumptions and main algorithms of the bedload transport model are presented and discussed. Sediment particles are represented by smooth spheres, which move under the drag forces of a simulated fluid flow. Bedload mass-transport rates calculated by the model exhibit a low sensitivity to chosen model parameters. Comparisons of the calculated mass-transport rates with well-established empirical relationships are good, strongly suggesting that the discrete particle model has captured the essential elements of the system physics. This performance provides strong justification for future interrogation of the model to investigate details of the small-scale constituent processes which have hitherto been outside the reach of previous experimental and modelling investigations.<\/dc:description><dc:date>\n2009-10-06T10:58:37Z<\/dc:date><dc:date>\n2009-10-06T10:58:37Z<\/dc:date><dc:date>\n2004<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nHeald, J., McEwen, I.K. and Tait, S.J. (2004). Sediment transport over a flat bed in a uni-directional flow: simulations and validation.   Philosophical Transactions of The Royal Society A: Mathematical Physical and Engineering Sciences. Vol. 362, No. 1822, pp. 1923-1986.<\/dc:identifier><dc:identifier>\n90016418<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3619<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1098\/rsta.2004.1426<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1098\/rsta.2004.1426"],"year":2004,"topics":["Sediment transport rate","Discrete particle model","Momentum exchange"],"subject":["Article","No full-text available in the repository"],"fullText":null}