{"doi":"10.5194\/hess-6-797-2002","coreId":"54174","oai":"oai:nora.nerc.ac.uk:12301","identifiers":["oai:nora.nerc.ac.uk:12301","10.5194\/hess-6-797-2002"],"title":"Spring and surface water quality of the Cyprus ophiolites\\ud\n\\ud","authors":["Neal, C.","Shand, P."],"enrichments":{"references":[{"id":925117,"title":"A new type of strongly hydroxide-sodiumcalcium water at Kulasi (Bosnia)","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":922786,"title":"A sulfur isotopic profile through the Troodos ophiolite, Cyprus: Primary composition effects of seawater hydrothermal alteration.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":928448,"title":"An assessment of excess carbon dioxide partial pressures in natural waters based on pH and alkalinity measurements.","authors":[],"date":"1998","doi":"10.1016\/S0048-9697(98)00011-4","raw":null,"cites":null},{"id":926622,"title":"Bicarbonate estimation from alkalinity determinations for acidic low alkalinity natural waters: theoretical considerations.","authors":[],"date":"1988","doi":"10.1080\/02626668809491294","raw":null,"cites":null},{"id":927378,"title":"Calcium and magnesium hydroxide precipitation from alkaline groundwaters in Oman, and their significance to the process of serpentinization.","authors":[],"date":"1984","doi":"10.1180\/minmag.1984.048.347.07","raw":null,"cites":null},{"id":926150,"title":"Environmental isotope survey (Cyprus). Final Report of International Atomic Energy Agency,","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":927965,"title":"Forestry impact on upland water quality.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":923884,"title":"Geochemical evidence of present day serpentinization.","authors":[],"date":"1967","doi":null,"raw":null,"cites":null},{"id":923220,"title":"Geochemistry, groundwater and pollution.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":931251,"title":"Groundwater quality in the region between","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":927073,"title":"Hydrogen generation from mantle source rocks in Oman.","authors":[],"date":"1983","doi":"10.1016\/0012-821X(83)90144-9","raw":null,"cites":null},{"id":932349,"title":"Igneous Petrogenesis: A global tectonic approach.","authors":[],"date":"1989","doi":"10.1111\/j.1365-3121.1989.tb00357.x","raw":null,"cites":null},{"id":924293,"title":"Metamorphic assemblages and the direction of flow of metamorphic fluids in four instances of serpentinization.","authors":[],"date":"1972","doi":null,"raw":null,"cites":null},{"id":931795,"title":"Oxygen and hydrogen isotope studies of the serpentinization of ultramafic rocks in oceanic environments and continental ophiolite complexes.","authors":[],"date":"1973","doi":"10.2475\/ajs.273.3.207","raw":null,"cites":null},{"id":927514,"title":"Past and present serpentinisation of ultramafic rocks; an example from the Semail Ophiolite Nappe of Northern Oman. In:","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":924704,"title":"Present day serpentinization in","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":931358,"title":"Temperatures of serpentinization of ultramafic rocks based on 18O\/16O fractionation between co-existing serpentine and magnetite.","authors":[],"date":"1971","doi":"10.1007\/BF00643332","raw":null,"cites":null},{"id":929870,"title":"The alkalinity and the chemical composition of springs issuing from peridotites.","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":925586,"title":"The geochemistry of natural waters. PrenticeHall, Upper Saddle River,","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":925711,"title":"The geology and gravity anomalies of the Troodos Massif,","authors":[],"date":"1963","doi":null,"raw":null,"cites":null},{"id":932874,"title":"The geology of the XerosTroodos area.","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":930797,"title":"The Hydrogeology of the Oman Mountains.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":923444,"title":"The relationship between fluids in some fresh Alpine-type ultramafics and possible modern serpentinization, western United States.","authors":[],"date":"1971","doi":null,"raw":null,"cites":null},{"id":928950,"title":"The significance of dissolved carbon dioxide in major lowland rivers entering the North Sea.","authors":[],"date":"1998","doi":"10.1016\/S0048-9697(98)00012-6","raw":null,"cites":null},{"id":929416,"title":"Thermal mineral waters of Cyprus. Int. Cong. on thermal waters, geothermal energy and volcanism of the Mediterranean area.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":930305,"title":"User’s guide to PHREEQC -a computer program for speciation, reaction-path, advective-transport, and inverse geochemical calculations . Water resources investigations report 95-4227.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"A survey of surface, spring and borehole waters associated with the ophiolite rocks of Cyprus shows five broad water types (1) Mg-HCO3, (2) Na-SO4-Cl-HCO3, (3) Na-Ca-Cl-SO4-OH-CO3, (4) Na-Cl-SO4 and (5) Ca-SO4. The waters represent a progression in chemical reactivity from surface waters that evolve within a groundwater setting due to hydrolysis of the basic\/ultrabasic rock as modified by CO2-weathering. An increase in salinity is also observed which is due to mixing with a saline end-member (modified sea-water) and dissolution of gypsum\/anhydrite. In some cases, the waters have pH values greater than 11. Such high values are associated with low temperature serpentinisation reactions. The system is a net sink for CO2. This feature is related not only to the hydrolysis of the primary minerals in the rock, but also to CaCO3 or Ca-Mg-CO3 solubility controls. Under hyperalkaline conditions, virtually all the carbon dioxide is lost from the water due to the sufficiently high calcium levels and carbonate buffering is then insignificant. Calcium sulphate solubility controls may also be operative when calcium and sulphate concentrations are particularly high","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54174.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/12301\/1\/hess-6-797-2002.pdf","pdfHashValue":"928ec637b458bcd198373be869b2578f269d5084","publisher":"European Geosciences Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:12301<\/identifier><datestamp>\n      2012-11-22T12:16:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12301\/<\/dc:relation><dc:title>\n        Spring and surface water quality of the Cyprus ophiolites\\ud\n\\ud\n<\/dc:title><dc:creator>\n        Neal, C.<\/dc:creator><dc:creator>\n        Shand, P.<\/dc:creator><dc:description>\n        A survey of surface, spring and borehole waters associated with the ophiolite rocks of Cyprus shows five broad water types (1) Mg-HCO3, (2) Na-SO4-Cl-HCO3, (3) Na-Ca-Cl-SO4-OH-CO3, (4) Na-Cl-SO4 and (5) Ca-SO4. The waters represent a progression in chemical reactivity from surface waters that evolve within a groundwater setting due to hydrolysis of the basic\/ultrabasic rock as modified by CO2-weathering. An increase in salinity is also observed which is due to mixing with a saline end-member (modified sea-water) and dissolution of gypsum\/anhydrite. In some cases, the waters have pH values greater than 11. Such high values are associated with low temperature serpentinisation reactions. The system is a net sink for CO2. This feature is related not only to the hydrolysis of the primary minerals in the rock, but also to CaCO3 or Ca-Mg-CO3 solubility controls. Under hyperalkaline conditions, virtually all the carbon dioxide is lost from the water due to the sufficiently high calcium levels and carbonate buffering is then insignificant. Calcium sulphate solubility controls may also be operative when calcium and sulphate concentrations are particularly high.<\/dc:description><dc:publisher>\n        European Geosciences Union<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12301\/1\/hess-6-797-2002.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Neal, C.; Shand, P..  2002  Spring and surface water quality of the Cyprus ophiolites.   Hydrology and Earth System Sciences, 6. 797-817.  https:\/\/doi.org\/10.5194\/hess-6-797-2002 <https:\/\/doi.org\/10.5194\/hess-6-797-2002>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.hydrology-and-earth-system-sciences.net\/index.html<\/dc:relation><dc:relation>\n        10.5194\/hess-6-797-2002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/12301\/","http:\/\/www.hydrology-and-earth-system-sciences.net\/index.html","10.5194\/hess-6-797-2002"],"year":2002,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"797\nSpring and surface water quality of the Cyprus ophiolitesHydrology and Earth System Sciences, 6(5), 797–817   (2002)    ©   EGS\nSpring and surface water quality of  the Cyprus ophiolites\nColin Neal1 and Paul Shand2\n1Centre for Ecology and Hydrology, Maclean Building, Crowmarsh Gifford, Wallingford, OXON, OX10 8BB, UK\n2British Geological Survey, Maclean Building, Crowmarsh Gifford, Wallingford, OXON, OX10 8BB, UK\nEmail for corresponding author: cn@ceh.ac.uk\nAbstract\nA survey of surface, spring and borehole waters associated with the ophiolite rocks of Cyprus shows five broad water types (1) Mg-HCO3, (2)\nNa-SO4-Cl-HCO3, (3) Na-Ca-Cl-SO4-OH-CO3, (4) Na-Cl-SO4 and (5) Ca-SO4. The waters represent a progression in chemical reactivity from\nsurface waters that evolve within a groundwater setting due to hydrolysis of the basic\/ultrabasic rock as modified by CO2-weathering. An\nincrease in salinity is also observed which is due to mixing with a saline end-member (modified sea-water) and dissolution of gypsum\/\nanhydrite. In some cases, the waters have pH values greater than 11. Such high values are associated with low temperature serpentinisation\nreactions. The system is a net sink for CO2. This feature is related not only to the hydrolysis of the primary minerals in the rock, but also to\nCaCO3 or Ca-Mg- CO3 solubility controls. Under hyperalkaline conditions, virtually all the carbon dioxide is lost from the water due to the\nsufficiently high calcium levels and carbonate buffering is then insignificant. Calcium sulphate solubility controls may also be operative\nwhen calcium and sulphate concentrations are particularly high.\nKeywords: Cyprus, Troodos, ophiolite, serpentinisation, spring, stream, water quality, bromide, iodine, boron, trace elements, hyperalkaline.\nIntroduction\nThe overexploitation of groundwaters in Cyprus has led to\na deterioration of quality in the major aquifers and the\nincrease in demand has meant that exploitation of aquifers\nwith marginal water quality is an important economic factor\n(Wagner et al., 1990).  The water quality of spring and\nsurface waters is examined for one of the major ophiolite\nareas for research, the Troodos Massif of central Cyprus.\nThe aquifers of the Troodos region generally provide low\npotential yields and groundwater of variable quality, but\nrepresent the only source of water supply for many villages.\nThe Cyprus ophiolite represents a back-arc basin that was\nprobably lifted above sea level by the under thrusting of\noceanic crust, a process intensified by a mass of serpentinite\nunder what is now the centre of the Troodos Massif (Gass,\n1982). This area contrasts with localities where oceanic crust\nwas emplaced by major thrusting of ophiolite blocks onto a\ncontinental edge as a series of nappes (Gass, 1982; Lippard\net al., 1986) or in an island arc setting (Gass, 1982).\nMany of the largest rivers in Cyprus originate in the\nTroodos Massif. Spring discharge is generally highest in\nthe plutonic rocks of the Troodos and the pillow lavas often\ncontain saline water due to restricted circulation. The study\nextends understanding of how surface and groundwaters\nevolve in ophiolite areas in the context of the different\ngeological units present and the Cyprus data adds to the\nvery limited amount of data on hyperalkaline waters in the\nMediterranean region (Derkovic, 1973; Papastamataki,\n1977; Pantazis, 1978) and elsewhere (Barnes et al., 1978).\nA comparison is made between water quality data from\nCyprus and Oman, with contrasting geological settings,\nunder thrusting and nappe emplacement, respectively. Both\nthese systems are part of the “Tethyan” ophiolite sequence\nwhich stretches from the Alps through Cyprus, Bosnia,\nCroatia, Greece, Turkey, Iran, Oman, Pakistan and\nAfghanistan and through the Himalayas to Burma (Lippard\net al., 1986).\nOphiolites\nOphiolites, “fragments of oceanic crust on land”, provide\nmajor research areas for the study of the mechanisms of\nglobal plate tectonics and the formation of the ocean floor\nwithin a geologic perspective (Gass, 1982; Wilson, 1989).\nThe term ophiolite comes from the Greek ophis meaning\nsnake- or serpent-like and it has a related meaning to major\nColin Neal and Paul Shand\n798\nwater-rock alteration feature of ophiolites, the rock type\n‘serpentinite’, and the key minerals associated with it,\n‘serpentine’; the serpentine minerals, antigorite and\nchrysotile. Ophiolite exposures on land provide a picture of\n5 km or more of slices through the oceanic crust to the mantle\nand such exposures have been the focus of major research\nactivity for the past forty or more years, helping to elucidate\nthe mechanisms of ocean floor formation, deformation and\nhydrothermal activity.\nBroadly, the ophiolite sequence from surface to depth\ncomprises:\nz Deep-sea iron and manganese rich sediments.\nz Basaltic magma extruded onto the sea floor commonly\nforming characteristic structures known as ‘pillow\nlavas’ (~1 km thick).\nz Vertical dyke swarms (sheeted dyke complex), the\nconduits for basaltic magma transfer from depth to the\nsea floor at oceanic ridges (~2 km thick).\nz A layered sequence of gabbros and, at greater depth,\nperidotites (each about 1 km thick). These represent the\nproducts of geochemical fractionation of mantle-derived\nmelts in a magma chamber, which provided the basalts\nof the sheeted dyke complex and the pillow lavas of the\nsea floor.\nz The upper mantle of tectonised ultrabasic rocks such\nas hartzburgite, dunite and peridotite.\nWithin the igneous rocks of the ophiolite, there is a\nprogressive change in mineralogical and chemical\ncomposition. Near the surface, the basaltic lavas are classed\nas ‘basic’. They have a composition typically around 49%\nSiO2, 16% Al2O3, 11% Fe2O3+FeO, 7% MgO and 10% CaO\nand the mineralogy is dominated by plagioclase feldspar,\npyroxene and olivine. At depth, the upper mantle rocks are\nclassed as ultrabasic. The upper mantle is much more\nmagnesium rich and aluminium depleted (about 43% SiO2,\n5% Al2O3, 13% Fe2O3+FeO, 23% MgO and 11% CaO) and\nthe mineralogy is dominated by pyroxene and olivine with\nlittle or no feldspar.\nOphiolites have often been modified due to reactions\ninvolving hydrothermal activity during circulation of sea-\nwater through the newly formed hot oceanic crust and during\nsubsequent tectonic displacement. This hydrothermal\nactivity typically leads to the mobilization of transition\nmetals and sulphur. During ascent to the ocean floor, the\ntransition metal- and sulphur-laden waters deposit massive\nsulphide ores within the upper parts of the ophiolite, while\nat the ocean floor, precipitation of the iron and manganese\nrich sediments occurs in features such as ‘black smokers’\n(Wilson, 1989). In addition, parts of the ultrabasic rocks\nbecome hydrated and this leads to the formation of lower\ndensity serpentinised areas that enhances uplift.\nSecondary mineralisation can affect the whole of the\nophiolite sequence. This mineralisation occurs during ocean\nfloor evolution, during obduction and at the surface of the\nEarth. Thus, for example, the serpentinisation process, which\ncan completely alter the ultrabasic rocks, takes place over a\nrange of temperatures from several hundred degrees to those\nencountered at the Earth’s surface (Barnes and O’Neil, 1971;\nBarnes et al., 1967, 1972, 1978; Wenner and Taylor, 1971,\n1973). Indeed, the low temperature serpentinisation\nreactions can produce spring waters of a remarkable\nhyperalkaline character. These hyperalkaline waters are\ncalcium hydroxide bearing with a typical pH range of 10 to\n12 (Barnes et al., 1978; Neal and Stanger, 1984, 1985;\nStanger, 1986). Indeed, precipitates of magnesium and\ncalcium hydroxides can be found within hyperalkaline\nspring chambers (Neal and Stanger, 1984). In addition, they\ncan also be highly reducing. For example, the waters can be\nsulphide bearing and they can discharge hydrogen gas (Neal\nand Stanger, 1985).\nLocation\nCyprus lies in the north-eastern corner of the Mediterranean\nSea, about 75 km south of Turkey and about 100 km west\nof Syria; Egypt is about 400 km to the south. The island of\nCyprus is about 100 km north–south by 230 km east–west\n(Fig. 1). Topographically and geologically, Cyprus can be\ndivided into three regions (Gass and Masson-Smith, 1963):\n1. The Kyrenia Range. This is a long narrow range to the\nnorth and north-east of the island with width typically\n5 km and altitude up to about 910 m above sea level. It\nparallels and hugs the northern coast in an east-west\ndirection from Morphu Bay to Cape Andréas. It\ncomprises thrust slices of Permian to Cretaceous\nlimestone flanked by flysch deposits of Oligocene to\nMiddle Miocene age.\n2. The Troodos Massif. This area comprises a large\nproportion of the mid- to south- eastern side of the\nisland, a flattened oval, elongate in an east-west plane.\nThe range is between 25 and 35 km wide with, at Mount\nOlympus, a maximum height of about 1940 m above\nsea level. It comprises a full ophiolite sequence forming\na ‘dome like’ structure, the deeper ultrabasic core\ncropping out in the centre of the massif. The ophiolite\nsuite is highly altered (details of the geology are\nprovided by Wilson and Ingram, 1984). Partly\nsurrounding the ophiolite massif are foothills of\nCretaceous to Miocene age chalks.\n799\nSpring and surface water quality of the Cyprus ophiolites\n3.  The Mesaoria Plain. This plain extends east-west\nbetween the Kyrenia and Troodos ranges and is\ncomposed of Pliocene, Pleistocene and recent\nsediments. The elevation is typically less than 300 m\na.s.l.\nThe climate is typical Mediterranean with summers that are\nhot and dry (July\/August, 20 to 36oC) and a cool rainy season\nthat extends from October to March (6 to 18oC). The climate\nvaries across the island in relation to the relief. Thus, for\nexample, the annual rainfall is about 500 mm for the Kyrenia\nRange, between 1000 mm (at higher altitudes) and 500 mm\n(at lower altitudes) for the Troodos and 350 mm for the\nMesaoria Plain. There is also a strong temperature gradient\nwith altitude and, during the winter, there may be snow cover\non the higher parts of the Troodos. Population density is\nrelatively low outside the main towns of the coastal plain\nand the capital (Nicosia), at around 40 people per square\nkilometre. Approximately 17% of the land is under\ncultivation (potatoes, grapes, citrus fruits, olives, etc.) and\nlight industry is becoming of increasing importance in the\nlowland areas. The mining of copper, asbestos, iron pyrite\nand chromite in the Troodos is of declining importance. For\nthe mountainous areas, the soils tend to be peaty but shallow\nand stony soils on the slopes and forested areas are common\n(pine, cypress and cedar).\nSampling, chemical analysis and\nthermodynamic treatment\nStreams, springs and borehole waters were sampled from\n21 sites within the Troodos ophiolite area in mid-May 1985.\nThese sites represent the major waters of the area as assessed\npreviously by the Geological Survey of Cyprus (Pantazis,\n1978). The sites were chosen and samplings undertaken with\nthe help of Evangelos Makredes of the Geological Survey\nof Cyprus and advice from some of his colleagues. The\nsample locations are shown in Fig. 1 and site comments are\nprovided in Table 1. In the field, samples were filtered\nthrough 0.45 µM membrane filters and then stored for\nchemical analysis in glass and polypropylene bottles\ndepending upon the type of analysis. pH was determined\nelectrochemically in the field, using a combination electrode,\nat the time of sample collection, with minimum contact of\nthe water sample with the atmosphere (to avoid equilibration\nwith atmospheric carbon dioxide). On immediate return from\nthe field, alkalinity was determined by acidimetric titration\nto a pH of about 4.0 and was calculated using the method of\nNeal (1988); reduced sulphur was also determined using an\nion selective electrode. In the case of alkalinity and reduced\nsulphur, the samples collected were stored in filled bottles\nand the analyses were undertaken rapidly: in the former case,\nthis ensured minimal equilibration with atmospheric carbon\ndioxide; in the latter case, it minimised both hydrogen\nsulphide degassing and atmospheric oxygen contamination.\nFig. 1. Map of Cyprus outlining the ophiolite area and the sites sampled.\nColin Neal and Paul Shand\n800\nTable 1. Site comments\nSite Comment\n1 Kalopanayiotis (Stomachiko) Spring1 from metal pipes\n2 Thioucho A Spring 2\n3 Thioucho B Spring 3 metal pipes\n4 Psamiako (metal pipes) Spring 4 metal pipes\n5 Kalopanayiotis Water from small seepage in gabbro\n6 Chrysoursi spring Spring in serpentinite: highly smashed serpentine next to gabbro\n7 Ali Tsiaousis Stream near asbestos mine: completely serpentinised rock.\n8 Asbestos mine Spring water, Amiadon Dam, completely serpentinised rock.\n9 Asbestos mine Stream water\n10 Kannouris Water leaving chromite mine dunite and hartzburgite.\n11 Kannouris Stream draining hartzburgite\n12 Kannouris Stream draining serpentinite\/hartzburgite\n13 Hardji spring Spring\n14 Sarama cold spring Spring in serpentinised olivine gabbro: Mamonia complex\n15 Sarama hot spring Spring in Mamonia complex\n16 Argaka Artesian borehole in diabase\n17 Axia Varvara spring Spring in diabase along fault\n18 Ziziros Mixture of springs of low and high chloride content: salt deposits\nand gas. Pillow lavas\n19 Parsata Spring in pillow lavas\n20 Layia Artesian borehole in pillow lavas\n21 Ayaimamas borehole Artesian borehole in highly weathered ultrabasic lavas\nSamples were returned to the UK for further chemical\nanalysis (Neal et al., 1992 for information on analytical\nmethodologies). This analysis comprised colorimetric\nmethods for the major anions, bromide and total iodine\n(mainly iodide plus iodate). Analysis of the major cations,\nthe trace metals and boron was undertaken by inductively\ncoupled plasma optical emission spectroscopy. In the case\nof the metals, samples were stored in polypropylene bottles\ncleaned by pre-washing in 5% v\/v analar grade hydrochloric\nacid followed by high purity water and the samples were\npreserved in 1% v\/v high purity, aristar grade, nitric acid.\nFor the anion determinations, samples were stored in high\npurity water-cleaned glass bottles prior to analysis.\nFor the analysis of the data, carbon dioxide partial\npressures and mineral saturation levels were determined\nusing the following methods and rationale.\nDissolved carbon dioxide. The level of carbon dioxide in\nsurface and groundwater is linked to several key factors:\n1. The supplies of atmospheric- and biologically-derived\nsources of carbon dioxide to the groundwater area and\nthe stream channel.\n2. Weathering processes within the soil and groundwater,\nwhich affect the pH levels and the distribution of\nhydroxyl ions and dissolved inorganic carbon species\n(CO2\n0, HCO3\n–1 and CO3\n–2).\n3. The input of carbon dioxide enriched water from\ngroundwater and soil water sources to the stream.\n4. Photosynthesis during the day from plants: this reduces\ndissolved carbon dioxide levels within streams.\n5. Respiration by plants during the night and microbial\nbreakdown of organic matter during the day and night;\nthis increases carbon dioxide levels in streams.\n6. Gaseous transfer of carbon dioxide between the water\nbody and the atmosphere; this can increase or decrease\nthe dissolved carbon dioxide levels dependent upon the\ndegree of carbon dioxide saturation in the water.\n7. External inputs of CO2 from depth related to\nmetamorphic reactions or mantle degassing (Shand et\nal., 1995).\nThe level of carbon dioxide saturation thus provides a clue\nto the importance of each of these processes. The degree of\ncarbon dioxide saturation (EpCO2) has been measured\naccording to a thermodynamically based method developed\n801\nSpring and surface water quality of the Cyprus ophiolites\nby Neal et al. (1998a) using pH, calcium and alkalinity data\nto allow for bicarbonate, carbonate, calcium-carbonate and\ncalcium-bicarbonate species as well as hydroxyl. EpCO2 is\ndefined as the dissolved carbon dioxide concentration in a\nwater sample divided by the dissolved carbon dioxide\nconcentration in pure water in equilibrium with the\natmosphere at the same temperature and pressure (Neal et\nal., 1998a). Thus, values of EpCO2 of 0.1, 1 and 10 represent\na tenth saturation, equilibrium (i.e. saturation), and ten times\nsaturation with respect to atmospheric concentrations,\nrespectively.\nMineral saturation levels. The potential for solubility\ncontrols to be operative is assessed here by examining the\ndegree of saturation as calculated in terms of a saturation\nindex. For example, one potential control on calcium levels\nin the ophiolites is calcium carbonate solubility. For\nequilibrium with respect to this phase, the activity product\nfor calcium and carbonate ions ({Ca2+}*{CO3\n2-}) is a\nconstant at any given temperature and pressure: the ‘{}’\nbrackets represent activity rather than concentration. This\nactivity product is defined by an equilibrium constant KCaCO3\nthat varies as a function of temperature, pressure and ionic\nstrength. Several different forms of calcium carbonate occur\nin nature and each has a separate thermodynamic solubility\nconstant (KCaCO3), the values of which are well established\nin the literature. The saturation index is provided in\nlogarithmic form, and, in the case of calcium carbonate,\nSICaCO3, is defined by\nSICaCO3 = log10({Ca\n2+}*{CO3\n2-}) – log10(KCaCO3).\nFor this expression, a SICaCO3 value of zero corresponds\nto saturation, while values of +1 and –1 correspond to ten\ntimes and one-tenth saturation respectively. For other\nmineral components, the same approach is used although\nthe activity product will differ in form according to the\nspecific reaction. For example, for magnesium hydroxide,\nwhich usually precipitates as microcrystalline brucite in\nhyperalkaline waters, the activity coefficient is defined from\nthe equation\nMg(OH)2 < > Mg\n2+ +2(OH-)\nby {Mg2+}*{OH–}2 where\nSImicro crystalline brucite = log10({Mg\n2+}*{OH–}2) –\nlog10(Kmicro crystalline brucite).\nFor this study, the PHREEQC thermodynamic model was\nused to calculate the saturation indices (Parkhurst, 1995).\nOccasionally, the saturation indices could not be assessed\ndirectly because some of the determinands used for the\ncalculation had values less than the lowest quotable value.\nIn such cases, saturation indices have been calculated using\nvalues set at half of the lowest quotable value to compare\nwith the information where the lowest quotable value is not\nan issue. The data are presented in tabular form in a later\nsection. For the cases where lowest quotable values are an\nissue, the information is provided in the tables in italics and\nis explained in the table headings. The lowest quotable value\nis twice the detection limit. Since the only determinands of\nconcern in this regard are aluminium and magnesium, which,\nin essence, have terms in the numerator of the saturation\nequations, then the estimates represent an upper bound to\nthe degree of saturation.\nResults\nThe findings are described by a progressive analysis of the\ndata involving four aspects. Firstly, the general water quality\nvariations are discussed within a typology setting of waters\nwith distinct hydrogeochemical character. Secondly, the\nvariation in carbon dioxide saturation is examined to assess\nthe extent of carbon dioxide equilibrium with the atmosphere\nand inorganic carbon attenuation within the rock. Thirdly,\nthe inter-relationships between the various determinands are\npresented to provide key information on how the water\nquality varies from surface-runoff to spring-water supplies\nand to determine within-rock hydrogeochemical signatures.\nFourthly, the degree to which the waters are saturated with\nrespect to particular mineral phases is assessed to examine\nthe potential for solution or precipitation of key mineral\ncomponents within the system. These aspects are considered\nseparately below.\nGENERAL WATER QUALITY VARIATIONS\nThe waters collected from the ophiolite areas (Table 1)\ncomprise a wide range of water qualities (Table 2). All the\nwaters are moderate- to hyper- alkaline (pH from 7.9 to\n11.6), of moderate to high alkalinity (813 to 9433 µEq l–1)\nand the temperatures are around 22oC. The waters exhibit a\nwide range in major cation, major anion and trace element\nconcentrations. Broadly, they fit into five Types with some\nsub-groupings and are displayed on a PIPER diagram (Fig.\n2). The water types are as follows.\nMagnesium bicarbonate: Type 1\nDilute waters with respect to sodium, chloride, calcium and\nsulphate represent this type. The main cation is magnesium\nand the main anion bicarbonate: their concentrations are at\nColin Neal and Paul Shand\n802\nTa\nbl\ne \n2.\n T\nhe\n w\nat\ner\n q\nua\nlit\ny \nof\n C\nyp\nru\ns \nw\nat\ner\ns \nas\nso\nci\nat\ned\n w\nith\n th\ne \nop\nhi\nol\niti\nc \nar\nea\ns. \nTr\nac\ne \nel\nem\nen\nts\n le\nss\n th\nan\n 1\nµg\n\/l:\n C\nd,\n C\no,\n C\nu,\n L\na,\n M\nn,\n M\no,\n N\ni, \nPb\n, S\nc,\n V\n, Y\n, Z\nn,\n Z\nr.\nC\non\nce\nnt\nra\ntio\nns\n ar\ne o\nn \nan\n el\nem\nen\nta\nl b\nas\nis\n ex\nce\npt\n S\nO\n4 (\nm\ng-\nSO\n4\/l\n), \nal\nka\nlin\nity\n (µ\nEq\n\/l)\n an\nd \npH\n (d\nim\nen\nsi\non\nle\nss\n). \nA\nt t\nhe\n b\not\nto\nm\n o\nf t\nhe\n ta\nbl\ne,\n an\n an\nal\nys\nis\n fr\nom\n o\nur\n la\nbo\nra\nto\nrie\ns\nis\n a\nls\no \npr\nes\nen\nte\nd \nfo\nr a\n h\nyp\ner\nal\nka\nlin\ne \nsp\nrin\ng \nw\nat\ner\n in\n B\nos\nni\na,\n “\nB\nos\n”,\n (c\nf D\ner\nko\nvi\nc,\n 1\n97\n3)\n fo\nr c\nom\npa\nris\non\n.\nSi\nte\nN\na\nK\nC\na\nM\ng\nC\nl\nSO\n4\nS2\n-\nSi\nAl\nk\npH\nEp\nC\nO\n2\nAl\nBa\nB\nBr\nC\nr\nI\nLi\nSr\nFe\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nm\ng\/\nl\nµE\nq\/\nl\nAt\nm\nos\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nµg\n\/l\nTY\nPE\n 1\nA\n: M\ng-\nH\nC\nO\n3\n10\n3.\n29\n0.\n19\n3.\n45\n55\n.3\n7\n2.\n17\n0\n14\n.0\n60\n50\n8.\n5\n4.\n05\n<5\n1\n41\n24\n3\n3\n0\n11\n<0\n.5\n11\n4.\n06\n0.\n18\n4.\n42\n72\n.6\n8\n2.\n46\n0\n19\n.5\n53\n78\n7.\n9\n13\n.0\n6\n<5\n2\n31\n22\n<1\n2\n0\n15\n<0\n.5\n12\n4.\n73\n0.\n24\n3.\n30\n11\n2.\n0\n9\n3.\n06\n0\n7.\n5\n94\n33\n8.\n6\n4.\n38\n<5\n2\n19\n29\n<1\n5\n0\n12\n<0\n.5\nT Y\nPE\n 1\nB\n: M\ng-\nH\nC\nO\n3 W\nIT\nH\n C\nR\n6\n4.\n68\n0.\n30\n1.\n99\n70\n.7\n9\n3.\n64\n0\n1.\n15\n56\n98\n9.\n1\n0.\n89\n7\n1\n53\n30\n19\n3\n0\n  5\n<0\n.5\n7\n4.\n40\n0.\n24\n1.\n47\n65\n.1\n8\n2.\n71\n0\n0.\n30\n52\n63\n9.\n8\n0.\n10\n6\n3\n10\n6\n32\n25\n5\n0\n  5\n  2\n8\n3.\n96\n0.\n21\n5.\n10\n59\n.7\n8\n2.\n08\n0\n12\n.5\n51\n11\n8.\n4\n4.\n34\n5\n1\n74\n27\n13\n4\n0\n13\n  2\n9\n5.\n16\n0.\n23\n3.\n99\n67\n.9\n9\n2.\n89\n0\n5.\n3\n56\n56\n8.\n4\n3.\n88\n<5\n4\n16\n0\n28\n14\n6\n0\n11\n<0\n.5\nT Y\nPE\n 1\nC\n: M\ng-\nH\nC\nO\n3 W\nIT\nH\n N\nA\n-C\nL\n5\n52\n.0\n1.\n47\n41\n.1\n31\n.3\n45\n45\n.9\n0\n14\n.0\n45\n78\n8.\n7\n1.\n67\n15\n1\n85\n10\n5\n<1\n12\n16\n  3\n6\n  5\n13\n12\n.0\n0.\n89\n37\n.5\n45\n.0\n28\n14\n.8\n0\n5.\n5\n45\n06\n9.\n5\n0.\n21\n<5\n<0\n.5\n15\n70\n37\n5\n0\n10\n8\n<0\n.5\nTY\nPE\n 2\nA\n: N\na-\nC\nl-H\nC\nO\n3\n1\n17\n3\n5.\n34\n0.\n92\n0.\n2\n17\n0\n23\n.5\n1\n12\n.0\n32\n59\n9.\n7\n0.\n09\n17\n<0\n.5\n52\n9\n44\n0\n<1\n10\n7\n11\n3\n   \n2\n  4\n2\n17\n8\n5.\n41\n0.\n95\n0.\n1\n17\n0\n22\n.0\n2\n12\n.5\n53\n83\n9.\n7\n0.\n16\n15\n<0\n.5\n53\n8\n46\n0\n<1\n10\n5\n11\n4\n   \n2\n<0\n.5\n21\n14\n6\n0.\n24\n1.\n88\n0.\n1\n14\n0\n29\n.8\n1\n10\n.5\n24\n75\n9.\n5\n0.\n13\n<5\n<0\n.5\n58\n0\n38\n0\n<1\n63\n0\n   \n7\n<0\n.5\nT Y\nPE\n 2\nB\n: N\na-\nSO\n4-C\nL\n15\n13\n7\n0.\n39\n49\n.6\n0.\n0\n11\n6\n24\n9\n0\n14\n.0\n81\n3\n9.\n9\n0.\n01\n<5\n<0\n.5\n10\n32\n41\n0\n<1\n31\n0\n 2\n7\n<0\n.5\n14\n14\n2\n7.\n19\n47\n.9\n0.\n2\n11\n6\n24\n9\n0\n14\n.0\n83\n5\n9.\n6\n0.\n03\n53\n2\n10\n23\n40\n0\n<1\n25\n0\n 2\n8\n  8\n17\n17\n3\n0.\n78\n43\n.9\n0.\n1\n13\n0\n27\n3\n1\n11\n.0\n53\n7\n9.\n6\n0.\n02\n17\n<0\n.5\n17\n31\n43\n0\n<1\n19\n0\n 4\n1\n  4\nT Y\nPE\n 3\nA\n: N\na-\nC\nl-S\nO\n4-O\nH\n-C\nO\n3\n3\n38\n5\n14\n.9\n0.\n81\n0.\n1\n42\n0\n39\n3\n11\n24\n.0\n58\n56\n11\n.6\n0.\n00\n27\n9\n<0\n.5\n11\n08\n10\n50\n<1\n27\n5\n10\n83\n   \n1\n<0\n.5\n4\n38\n5\n15\n.3\n0.\n79\n0.\n6\n42\n0\n10\n9\n11\n24\n.5\n60\n63\n11\n.4\n0.\n00\n27\n5\n<0\n.5\n10\n92\n10\n50\n<1\n27\n0\n36\n   \n1\n  1\nTY\nPE\n 3\nB\n: N\na-\nC\na-\nC\nl-S\nO\n4-O\nH\n19\n16\n3\n1.\n23\n93\n.1\n0.\n0\n19\n0\n20\n7\n2\n3.\n4\n23\n33\n11\n.2\n0.\n00\n15\n5\n<0\n.5\n14\n50\n72\n0\n<1\n24\n0\n0\n11\n0\n56\n803\nSpring and surface water quality of the Cyprus ophiolites\nTY\nPE\n 4\n: N\na-\nC\nl-S\nO\n4\n18\n58\n00\n24\n.9\n64\n6\n1.\n2\n78\n00\n34\n90\n0\n9.\n0\n11\n41\n9.\n0\n0.\n21\n<5\n<0\n.5\n60\n30\n18\n00\n0\n<1\n21\n00\n14\n83\n0\n25\n8\n<0\n.5\nTY\nPE\n 5\n: C\na-\nN\na-\nSO\n4\n16\n15\n6\n0.\n82\n10\n37\n1.\n0\n13\n0\n25\n01\n0\n12\n.0\n71\n2\n9.\n0\n0.\n13\n<5\n<0\n.5\n16\n47\n42\n0\n<1\n19\n0\n  4\n1\n13\n20\n30\n2\n0.\n67\n46\n1\n0.\n1\n40\n0\n11\n00\n0\n9.\n5\n59\n0\n9.\n6\n0.\n02\n42\n<0\n.5\n39\n5\n13\n00\n<1\n79\n0\n13\n6\n18\nH\nY\nPE\nR\nA\nLK\nA\nLI\nN\nE \nSP\nR\nIN\nG\n W\nAT\nER\n F\nR\nO\nM\n B\nO\nSN\nIA\nB\nos\n33\n1.\n16\n98\n.0\n1.\n1\n18\n0.\n7\nN\nA\n2.\n4\n56\n20\n11\n.8\n<0\n.1\n63\n14\n0\n15\n2\n66\n<1\n17\n0\n32\n2\n39\ntheir highest for the Type 1 waters relative to the other waters\nmonitored across the sampling sites (Table 3). Although\nbicarbonate is not measured directly, the high alkalinity listed\nin Table 2 is primarily as bicarbonate since the pH is too\nlow for carbonate to dominate. The Type 1 waters can be\nsubdivided into three groups:\nz Mg-HCO3: 1a. For this sub-group, over 90% of the\ncation charge is from magnesium and a similar\nproportion of the anion charge is associated with\nbicarbonate alkalinity. pH is in the range 7.9 to 8.6.\nSilicon concentrations vary between 7 and 20 mg-Si l-1.\nz Mg-HCO3-Cr: 1b. This group is very similar to 1a\nalthough the waters are also chromium bearing (13–25\nµg l–1). pH shows a higher range from 1a (8.4 to 9.8).\nSilicon concentrations are typically lower than for 1a\n(range 0.3 to 12.5 mg-Si l–1) and silicon concentrations\ndecrease as pH increases.\nz Mg-HCO3 with Na-Ca-Cl-SO4: 1c. The remaining group\nin this category still has magnesium and bicarbonate as\nthe dominant ions in solution although magnesium\nconcentrations are lower than for 1a and 1b. However,\nthere are increased concentrations of other major cations\n(Na, K and Ca) and anions (Cl and SO4) as well as the\nFig. 2.  PIPER plot showing the relative proportions of major cations and anions.\nColin Neal and Paul Shand\n804\nTable 3. A summary of the charge proportions for the main anions and cations in relation\nto the five main water types sampled for the ophiolites of Cyprus. Ratios of Na:Cl and\nCa:SO4 are also provided, these ratios are on µEq l–1: µEq l–1 basis.\n1a 1b 1c 2a 2b 3a 3b 4 5\nNa %   2.5   3.4 21.3 97.7 72.9 97.4 60.0 88.4 21.0\nK %   0.1   0.1   0.5   1.3   0.8   2.3   0.3   0.2   0.0\nCa %   2.7   2.7 30.1   0.9 26.2   0.2 39.4 11.3 78.9\nMg % 94.7 93.8 48.1   0.2   0.1   0.1   0.4   0.0   0.1\nCl %   3.1   4.2 16.6 51.6 35.9 51.4 44.7 74.9 16.4\nSO4 %   0.7   1.0 10.2   6.0 56.4 22.7 35.9 24.7 82.1\nHCO3\/CO3 % 96.1 94.4 72.9 41.9   7.2 12.4   7.7   0.4   1.4\nOH %   0.03   0.4   0.3   0.5   0.5 13.5 11.8   0.0   0.0\nCations Na\/Cl   0.78   0.83   1.35   1.60   1.92   1.41   1.32   1.15  1.33\nAnions Ca\/SO4   3.49   2.66   3.11   0.12   0.44   0.01   1.08   0.44  1.00\ntrace element strontium. The enrichment in these\ncomponents is typically by a factor of about four.\nNa-enriched waters with either Cl-HCO3 or SO4-Cl as\nbalancing anions: Type 2\nFor this group, sodium concentrations range from 137 to\n178 mg l–1, over 30 times higher than in the 1a and 1b waters\nand over three times higher than in 1c. For Type 2 waters,\nboron, bromide and total iodine are up to about an order of\nmagnitude higher than in Type 1 waters.  Magnesium\nconcentrations, in contrast, are low and often close to the\ndetection limit. This group can be divided into two clear\nunits:\nz Na-Cl-HCO3: 2a. For this group, over 95% of the\ncationic charge is associated with sodium and an\napproximately equal proportion of bicarbonate and\nchloride represents the balancing anions.\nz Na-SO4-Cl: 2b. For this group, sodium contributes over\n70% of the cationic charge with calcium, at a\nconcentration of about 47 mg l–1, making up most of\nthe remainder. For this group, sulphate provides the\ndominant anionic charge with a concentration of about\n250 mg-SO4 l\n–1 followed by chloride. For this group,\ncalcium and sulphate concentrations are about 40 and\n10 times higher, respectively, than for 2a.\nHyperalkaline waters: Type 3\nThese waters have very high pH (11.2 to 11.6), at least one\nunit higher than all the others sampled, and they have very\nlow magnesium concentrations (near and in some cases\nbelow the detection limit). They are enriched in bromide\nand total iodine even relative to 2b. The boron levels are\nalso high at around 1000 µg l–1 — about the same as 2b.\nThey fall into two subgroups:\nz Na-Cl-SO4-OH-CO3: 3a. These waters not only have a\nhigher pH than the other waters, but they are also further\nenriched in sodium and chloride by a factor of about\ntwo over Type 2 and up to almost an order of magnitude\nenrichment compared to Type 1. Sodium represents over\n95% of the cationic charge, while the major balancing\ncation is chloride (about 50% of the charge) followed\nby sulphate or alkalinity. The waters are also rich in\nlithium (36 to 1083 µg l-1) and reduced sulphur (11 mg-\nS l–1). Silica concentrations are relatively high compared\nwith all the other types of water, at about 24 mg-Si l–1.\nz Na-Ca-Cl-SO4-OH: 3b. There is only one water sample\nfor this group. It is similar to the Type 3a waters except\nthat (a) the sodium and chloride concentrations are about\na half and (b) the calcium and strontium concentrations\nare considerably higher (93 compared to <1 mg l–1 for\ncalcium; 110 compared to 1 µg l–1 for strontium).\nCompared with all but two of the other types of water,\nthe silica concentration is relatively low at 3.5 mg-Si l–1\nand this concentration is only a seventh that of 3a.\nNa-Cl-SO4: Type 4\nType 4 water has particularly high concentrations of sodium,\nchloride and sulphate: it is represented at one site only.\n805\nSpring and surface water quality of the Cyprus ophiolites\nSodium makes up almost 90% of the cationic charge while\nchloride and sulphate make up about three quarters and one\nquarter, respectively, of the anionic charge. The brine is\nabout 40% of the strength of sea-water with respect to\nchloride (Table 4). Relative to the other water types, it is\nalso enriched in potassium, boron, bromide, total iodine\nlithium and strontium, typically by an order of magnitude\nor more. The pH is 9.\nIn terms of element enrichment and depletion, Table 4\ncompares the spring water and sea-water data normalised\nto chloride, under the assumption that chloride is relatively\nconservative within the water at the salinity of the spring\nwater. This approach indicates that calcium, sulphate and\nboron are moderately enriched by a factor of 3 to 4, and\ntotal iodine is considerably enriched (81 times) relative to\nsea-water. Smaller changes are observed for sodium and\nbromide: sodium is moderately enriched and bromide is\nmoderately depleted, both by about a third, relative to sea-\nwater. Potassium, magnesium, lithium and strontium are\nconsiderably depleted (by a factor of five to orders of\nmagnitude depending upon the particular element). The\nreasons for the enrichment and depletion of elements are\ndiscussed later.\nCa-Na-SO4: Type 5\nType 5 waters come from boreholes and they have high\nconcentrations (relative to all except the Type 4 water) of\ncalcium (the major cation with about 80% of the cationic\ncharge) and sodium (which makes up most of the remainder)\nwhile sulphate provides most of the anionic charge (about\n80%, with chloride making up most of the remainder). The\nwaters have a pH between 9.0 and 9.5.\nEPCO2\nThe levels of dissolved carbon dioxide vary from about\nthirteen times to less than a hundredth saturation with respect\nto the atmosphere (Table 2). The waters subdivide into two\ngroups.\n1. The Type 1 waters. This group shows carbon dioxide\nsaturation in the range 13 to a tenth saturation.\nOversaturation to moderate undersaturation occurs for\nmany surface waters that are relatively unpolluted\n(biological processes linked to photosynthesis and\nrespiration modifying the degree of saturation). The\nType 1 grouping reflects surface waters and spring\nwaters with near surface sources.\n2. The Type 2 to 5 waters. These waters show moderate to\nhigh degrees of carbon dioxide undersaturation (20%\nto less than 1% saturation). Such low saturations can\noccur within surface waters but only when\nphotosynthesis is particularly high (Neal et al., 1998b).\nSince the waters are primarily groundwater in origin,\nphotosynthetic activity cannot explain the very low\nlevels encountered. Furthermore, due to biological\nbreakdown of organic carbon in the soil and the aquifer\nor to degassing of carbon dioxide from greater depths\n(Appelo and Postma, 1993; Drever, 1997), many\ngroundwaters are oversaturated with respect to carbon\ndioxide, often by one or two orders of magnitude. The\nvery low levels encountered means that carbon dioxide\nfrom surface sources must be consumed within the rock.\nDETERMINAND INTER-RELATIONSHIPS\nStatistical analysis was undertaken using correlation matrix\nand factor analysis and this was backed up with visual\ninspection of graphed data where the determinands were\nplotted against each other (Fig. 3) and against Cl (Fig. 4).\nThis analysis was undertaken:\n1. To describe and explore the relationships between the\nvarious determinands.\nTable 4. The concentration of major and trace elements in site 18 spring water with respect to\nsea-water (Rsp\/SW) and the ratio of major and trace elements to chloride in site 18 spring water\nrelative to the corresponding ratio in sea-water (Rel:Cl-sp\/Rel:Cl-SW).\nElement Rsp\/SW Rel:Cl-sp\/Rel:Cl-SW Element Rsp\/SW Rel:Cl-sp\/Rel:Cl-SW\nNa 0.54 1.34 B 1.34   3.32\nK 0.06 0.15 Br 0.27   0.67\nCa 1.57 3.89 I                   32.81 81.40\nMg 0.00 0.00 Li 0.09   0.22\nSO4 1.29 3.19 Sr 0.03   0.08\nCl 0.40 1.00\nColin Neal and Paul Shand\n806\n2. To see if the groupings identified qualitatively earlier\nin the paper could also be characterised within a more\nrigorous statistical framework.\nCorrelation statistics\nThe analysis was subdivided into two parts. Firstly, the\ndataset was examined as a whole to describe the general\nbehaviour. Secondly, only type 1, 2 and 3 waters were\nFig. 3.  Inter-determinand plots for Type 1, 2 and 3 water groupings\nexamined as the type 4 and 5 waters represent a very limited\nnumber of samples with abnormally high concentrations of\nions such as sodium, calcium, chloride and sulphate:\ninclusion of these values would otherwise bias the statistical\nanalysis. The salient points are as follows.\nFor the full dataset, four groupings were observed with\nhigh correlations (N=21).\n1. The sea-salts (excluding Mg). High correlations were\nobserved for Na, K, Cl, SO4, B, Br, I, Li and Sr: the\n807\nSpring and surface water quality of the Cyprus ophiolites\nFig. 4. Selected concentrations of major and minor elements and δ18O plotted against chloride for each of the water types described in the text.\nThe solid line represents a sea-water dilution line.\nColin Neal and Paul Shand\n808\ncorrelation coefficient is in the range 0.77 to 0.95. This\ngroup also showed negative relationships with\nbicarbonate (r   -0.65).\n2. Calcium and sulphate. These determinands show a high\nr correlation coefficient of 0.90.\n3. Mg, alkalinity, EpCO2, HCO3 and Ba. For this group,\ncorrelations are in the range 0.70 to 0.91.\n4. pH, CO3, OH, Al and reduced-S. For this group, the\ncorrelations are in the range 0.73 to 0.84.\nFor the Type 1 to 3 subset (N =18), very similar groupings\nto the full dataset are observed although (a) the patterns are\nin most cases stronger, (b) the list of determinands is greater\nand (c) groupings 1 and 4 with the full dataset combine to\nform a single group. In detail, the correlations are\n1. The sea-salts (excluding Mg) plus Si, Al, pH, CO3, OH,\nAl and reduced-S. High correlations (r = 0.77 to 0.99)\noccur for the same determinands as with the full dataset\nexcept that the correlation with lithium is slightly lower\n(r  0.60) and the correlation with strontium is lost.\nRelative to the full dataset, this group is augmented by\nSi, Al, pH and reduced-S and these components are\nnegatively correlated with Mg (r  -0.79) and HCO3 (r   -\n0.84).\n2. Ca and Sr. Calcium and Sr are strongly related (r = 0.82)\nand to a lesser degree by B (r  0.54) and SO4 (r   0.47).\nThis group is negatively correlated with alkalinity (r   -\n0.64).\n3. Mg, alkalinity, EpCO2, HCO3 and Ba. This is the same\ngrouping as for the full dataset with correlation\ncoefficients in the range 0.67 to 0.90. This group is\nnegatively correlated with many determinands in the\nsea-salt group (Na, Cl, SO4, B and Br, (r = -0.67 to -\n0.79) as well as pH (r   -0.68).\nFactor analysis\nAs with the correlation study, the factor analysis is\nundertaken on the full dataset and the Type 1 to 3 subsets.\nFor the full dataset, four factors explain 88% of the\nvariance:\nz Factor 1. This is represented by the sea-salt components\n(excluding Mg): Na, K, Cl, SO4, B, Br, I, Li and Sr, and\n41% of the variance is explained. For this group, there\nis a negative relationship between the sea-salt\ncomponents and Mg, alkalinity, HCO3 and Ba.\nz Factor 2. Mg and HCO3 represent this, with a negative\nrelationship for pH, CO3, OH and reduced-S and 26%\nof the variance is explained.\nz Factor 3. This is represented by alkalinity and 14% of\nthe variance is explained.\nz Factor 4. Chromium represents this and 7% of the\nvariance is explained.\nFor the Type 1 to 3 components, three factors explain\n82% of the variance:\nz Factor 1. This is represented by the sea-salt components\n(excluding Mg): Na, K, Cl, SO4, B, Br, I, Li and Sr,\naugmented by pH, CO3, OH, Al, and reduced-S. These\ncomponents are negatively related to Mg and HCO3.\nThis factor explains 55% of the variance.\nz Factor 2. This is represented by alkalinity and is\nnegatively related to Ca and Sr. This factor accounts\nfor 19% of the variance.\nz Factor 3. Chromium represents this and 8% of the\nvariance is explained.\nPlotted data\nA visual analysis of determinand plots shows clear\ncorrelations between the sea-salt components, including Mg,\nalthough, as in the previous case, the Type 4 and 5\ncomponents provide outlier points. Considering the Type 1\nto 3 data (Fig. 3), three features emerge.\n1. The patterns for the sea-salts, excluding Mg, are linear\nand positive. There is also a positive and linear, but\nscattered relationship between the sea-salt components\n(except Mg) and pH.\n2. Mg exhibits an inverse relationship with the other sea-\nsalts and with pH.\n3. There is a positive and curvilinear relationship for pH\nwith Al and reduced-S: the relationship is exponential.\nTable 5 provides a statistical analysis of determinand\nrelationships with chloride.\nSummary\nThe statistical and graphical analysis (Figs. 3 and 4) shows\nthat the waters split broadly into the groupings outlined at\nthe start of the results section. The analysis also shows that\nthere are linear or curvilinear relationships between\nparticular determinands.\nBroadly, the results show the following patterns.\n1. Surface waters are of a dilute magnesium bicarbonate\ntype.\n2. Within the rock, the waters lose their magnesium\ncomponent and in the process pick up sea-salt\ncomponents (other than Mg). In the process, pH, OH,\n~~\n~~ ~~\n~ ~~\n~~\n~~\n~~\n809\nSpring and surface water quality of the Cyprus ophiolites\nCO3, Al and reduced-S increases while bicarbonate\ndecreases.\n3. As salinity increases further, to the level of brines,\nsodium-chloride and calcium-sulphate waters are\ngenerated that do not have the high pH, OH, CO3, Al\nand reduced-S character of the intermediate salinity\ngroup.\nMINERAL SATURATION LEVELS\nThe salient information on the saturation index, for the\nwaters studied, is presented in Tables 6, 7 and 8 as a series\nof specific mineral groupings linked to primary minerals in\nthe rock and secondary weathering products. The details of\nthe tables are as follows\nz The primary Mg-Al-silicate minerals and zeolites\n(Table 6). This table provides information on the\nprimary minerals within the various rocks of the area\nand zeolites that occur as secondary minerals within\nthe lavas. The primary minerals considered are the two\nend-members of the plagioclase feldspars, albite\n(NaAlSi3O8) and anorthite (CaAl2Si2O8), analcime\n(NaAlSi2O6:H2O), the pyroxenes clinoenstatite\n(MgSiO3) and diopside (CaMgSi2O6), and the olivine\nforsterite (Mg2SiO4). The zeolites included are\nlaumontite (CaAl2Si4O12:4H2O) and phillipsite\n(Ca2Al2Si3O10(OH)2; prehnite (Ca2Al2Si3O10(OH)2) is\nalso included.\nz Secondary calcium sulphate, carbonate minerals and\noxides\/hydroxides (Table 7). This table provides\ninformation on (a) the calcium sulphate minerals\nanhydrite (CaSO4) and gypsum (CaSO4:2H2O), (b) the\ncarbonate minerals aragonite (CaCO3), calcite (CaCO3),\ndolomite (CaMg(CO3)2), magnesite (MgCO3), huntite\n(CaMg3(CO3)4) and strontianite (SrCO3) and (c) the\noxides\/hydroxides brucite (Mg(OH)2), gibbsite\n(Al(OH)3) and quartz (SiO2).\nz Secondary magnesium and aluminium bearing\nsilicate minerals (Table 8). This group comprises\nchrysotile (Mg3Si2O5(OH)4), 14Å-chlorite (Mg5Al2Si3\nO10(OH)8), Illite (K0.6Mg0.25Al2.3Si3.5O10(OH)2), Ca-\nMontmorillonite (Ca0.165Al2.33Si3.67O10(OH)2), kaolinite\n(Al2Si2O5(OH)4), sepiolite (Mg2Si3O7.5OH:3H2O), talc\n(Mg3Si4O10(OH)2) and pyrophyllite (Ca2Al2Si3O10\n(OH)2)\nThe salient features for the main mineral groupings are\nas follows.\nPrimary Mg-Al-silicate minerals\nIn most cases, the waters are undersaturated with respect to\nthe primary Mg-Al-silicate minerals although for the\nhyperalkaline waters, the waters approach saturation or\nexceed it in the case of forsterite and, in particular,\nclinoenstatite: for the more calcic waters, oversaturation with\nrespect to diopside is observed. Thus, in general,\nz The waters have the potential to dissolve the feldspars,\npyroxenes and olivines except under hyperalkaline\nconditions.\nz Under hyperalkaline conditions, the waters have the\npotential to dissolve feldspars but they are in\napproximate balance for clinoenstatite and forsterite.\nz Diopside is close to saturation in the waters of high\ncalcium concentration.\nZeolites\nFor the zeolites, the waters are primarily undersaturated with\na few exceptions and typically there is the potential for\nmineral solution. The possible exceptions are the more calcic\nwaters of Types 1c and 2b when the waters are not\nhyperalkaline but aluminium concentrations are significant:\nwhile the extent of zeolites saturation increases with trivalent\naluminium concentration, all other things being equal, the\nTable 5. Linear regression analysis for the chemical\ndeterminands and chloride in Cyprus ophiolite waters: types\n1 to 4. N=18.\n        Grad Constant r2\nNa 0.937 ± 0.069 5 ± 37 0.979\nBr 2.58 ± 0.25 31 ± 134 0.964\nI 0.681 ± 0.139 -10 ± 75 0.856\nS 0.025 ± 0.005 -1.2 ± 2.8 0.849\nK 0.034 ± 0.008 -1 ± 4 0.812\nAl 0.629 ± 0.152 -23 ± 82 0.811\npH 0.007 ± 0.002 8.70 ± 1.05 0.764\nOH 6.98 ± 2.11 -331 ± 1136 0.733\nLi 1.58 ± 0.62 -82 ± 335 0.617\nMg -0.197 ± 0.098 54 ± 53 0.503\nB 2.95 ± 1.57 208 ± 846 0.469\nSi 0.0375 ± 0.0207 7 ± 11 0.451\nSO4 0.606 ± 0.367 23 ± 198 0.405\nBa -0.005 ± 0.004 1.5 ± 2.0 0.325\nCr -0.037 ± 0.038 10 ± 21 0.190\nFe 0.014 ± 0.050 3 ± 27 0.022\nSr -0.0000 ± 0.0001 0.027 ± 0.068 0.012\nCa -0.028 ± 0.126 27 ± 68 0.012\nColin Neal and Paul Shand\n810\nTable 6. Saturation indices for primary Mg\/Al-silicates and zeolites in surface and groundwaters of the Cyprus ophiolitic\nareas. The terms in italics represent upper limits of values of saturation indices values where there are issues of lowest\nquotable value: these saturations are provided for illustrative purposes only.\nPrimary Mg\/Al-silicates Zeolites\nAlbite Anorthite Analcime Clinoenstat     Diopside Forsterite Laumontite Phillipsite Prehnite\nTYPE 1A: Mg-HCO3\n10 -4.98 -9.78 -7.02 -0.74 -0.07 -3.85 -4.96 -4.04 -8.50\n11 -4.43 -9.36 -6.63 -1.56 -1.71 -5.65 -4.23 -3.54 -8.90\n12 -5.68 -10.47 -7.44 -0.47 0.14 -3.03 -6.18 -4.76 -9.23\nTYPE 1B: Mg-HCO3 WITH CR\n6 -5.52 -6.92 -6.43 -0.60 -0.16 -2.44 -4.37 -4.55 -5.86\n7 -8.01 -8.88 -8.12 0.00 0.90 -0.44 -7.93 -7.07 -7.36\n8 -5.58 -6.65 -6.54 -1.98 -2.41 -5.25 -3.97 -4.65 -6.44\n9 -6.06 -10.57 -7.68 -1.10 -0.81 -4.14 -6.59 -5.17 -9.66\nTYPE 1C: Mg-HCO3 WITH NA-CL\n5 -0.78 -2.67 -2.81 -0.52 1.69 -3.40 2.12 0.01 0.16\n13 -6.08 -9.94 -7.57 0.66 3.83 -0.49 -6.22 -5.08 -6.16\nTYPE 2A: Na-Cl-HCO3\n1 -1.00 -4.83 -2.76 -1.17 0.98 -4.42 -0.56 -0.19 -2.06\n2 -0.97 -4.96 -2.76 -1.35 0.72 -4.82 -0.64 -0.16 -2.27\n21 -4.10 -10.61 -5.89 -1.66 0.44 -5.43 -6.30 -3.93 -7.89\nTYPE 2B: Na-SO4-CL\n15 -4.26 -1.91 -6.01 -1.29 2.95 -4.65 -5.07 -3.97 -4.43\n14 -0.32 -3.12 -2.18 -1.18 2.67 -4.54 2.54 0.59 2.55\n17 -1.00 -5.18 -2.77 -1.57 2.05 -5.24 1.16 -0.61 1.12\nTYPE 3A: Na-Cl-SO4-OH-CO3\n3 -3.33 -4.71 -3.81 0.65 5.20 0.49 -3.48 -2.47 -0.02\n4 -2.53 -4.26 -3.28 0.48 4.78 -0.11 -2.48 -1.67 0.15\nTYPE 3B: Na-Ca-Cl-SO4-OH\n19 -5.10 -4.26 -5.19 -0.49 4.96 -1.39 -3.33 -4.59 1.81\nTYPE 4: Na-Cl-SO4\n18 -2.51 NA -4.36 -2.07 1.22 -6.31 -4.11 -2.15 -4.62\nTYPE 5: Ca-NA-SO4\n16 -3.78 -7.99 -5.69 -1.88 1.90 -6.03 -3.38 -3.34 -3.58\n20 -0.70 -1.83 -2.38 -1.81 2.68 -5.63  2.37 -0.47  3.38\nhigher total aluminium concentrations in the hyperalkaline\nconditions is offset and counteracted by aluminium\nspeciation changes which results in the dominance of\naluminate anions under extreme high pH.\nGypsum and anhydrite\nAll the waters are undersaturated with respect to anhydrite\nand gypsum except the highly sulphate rich ones where\nsulphate is the dominant anion. The sulphate rich waters\n(Types 4 and 5) are close to saturation with respect to both\nthese minerals, particularly for gypsum. Thus, for Types 1\nto 3, the waters have the potential to dissolve the calcium\nsulphate minerals and for Types 4 and 5 waters a calcium\nsulphate solubility control may be operative.\n811\nSpring and surface water quality of the Cyprus ophiolites\nTable 7. Saturation indices for sulphates, carbonates and hydroxide phases in surface and groundwaters of the Cyprus\nophiolitic areas. The terms in italics represent upper limits of values of saturation indices values where there are issues of\nlowest quotable value: these saturations are provided for illustrative purposes only.\nCa sulphates Carbonates Oxides\/hydroxides\nAnhydrite Gypsum Aragonite Calcite Dolomite Huntite Magnesite Strontianite Brucite Gibbsite Quartz\nTYPE 1A: Mg-HCO3\n10 -4.82 -4.59 -0.15  0.00 1.52  0.22 0.95 -2.02 -2.97 -3.09 0.71\n11 -4.68 -4.45 -0.62 -0.47 0.59 -1.64 0.49 -2.47 -3.95 -2.55 0.86\n12 -4.84 -4.61  0.07  0.22 2.29  2.10 1.51 -1.73 -2.42 -3.25 0.43\nTYPE 1B: Mg-HCO3 WITH Cr\n6 -4.90 -4.67  0.05 0.20 2.29  2.12 1.52 -1.89 -1.70 -0.98 -0.43\n7 -5.24 -5.01  0.26 0.41 2.85  3.37 1.87 -1.48  0.30 -1.79 -1.23\n8 -4.66 -4.43 -0.14 0.01 1.41 -0.15 0.83 -2.11 -3.13 -0.42 -0.37\n9 -4.66 -4.42 -0.13 0.01 1.58  0.36 0.99 -2.06 -2.91 -3.08 0.29\nTYPE 1C: Mg-HCO3 WITH Na-Cl\n5 -2.44 -2.21 1.00 1.15 2.50 0.86 0.78 -1.42 -2.74 -0.30 0.69\n13 -3.03 -2.80 1.49 1.63 3.70 3.49 1.50 -0.37 -1.02 -4.14 0.16\nTYPE 2A: Na-Cl-HCO3-0.89\n1 -4.40 -4.17 -0.09 0.06 -0.25 -5.24 -0.89 -2.05 -3.12 -1.21 0.43\n2 -4.51 -4.28  0.06 0.21 -0.07 -4.97 -0.85 -1.88 -3.33 -1.25 0.46\n21 -3.91 -3.68  0.03 0.18 -0.47 -6.11 -1.22 -1.74 -3.63 -4.09 0.45\nTYPE 2B: Na-SO4-CL\n15 -1.66 -1.43  0.87 1.02 -4.50 -8.09 -2.16 -1.76 -3.23 -1.43 0.41\n14 -1.68 -1.45  0.83 0.98 -0.14 -6.72 -1.69 -1.78 -3.23 -0.65 0.52\n17 -1.68 -1.45  0.55 0.69 -0.87 -8.35 -2.14 -1.86 -3.53 -1.10 0.44\nTYPE 3A: Na-Cl-SO4-OH-CO3\n3 -3.45 -3.22 -0.35 -0.21 -1.45 -7.99 -1.75 -2.60 -0.03 -1.95 -0.85\n4 -4.05 -3.82 0.00 0.15 -0.52 -6.36 -1.25 -2.17  0.54 -1.70 -0.59\nTYPE 3B: Na-Ca-Cl-SO4-OH\n19 -1.54 -1.31 1.46 1.61 0.24 -6.87 -1.95 -0.82  0.23 -1.74 -1.24\nTYPE 4: Na-Cl-SO4\n18 -0.31 -0.09 1.10 1.24 0.07 -6.63 -1.75 -1.69 -3.23 -3.67  0.51\nTYPE 5: Ca-Na-SO4\n16 0.03 0.26 1.22 1.36 0.00 -7.08 -1.94 -2.57 -4.11 -3.67 0.60\n20 -0.46 -0.23 1.15 1.30 -0.77 -8.24 -2.64 -1.76 -4.01 -0.79 0.35\nCarbonates\nA variety of patterns is observed according to both the water\ntypes involved and the chemistry of the carbonate minerals.\nThe patterns are as follows.\nz CaCO3:  aragonite and calcite. The waters are close to\nsaturation for Types 1a, 1b, 2a and 3a, and oversaturated\nfor the other Types. Thus, some of the waters may have\ncalcium carbonate solubility controls operative while\nmost others have the potential to precipitate aragonite\nand calcite.\nz CaMg(CO3)2: dolomite. The waters show a variable\nsaturation with respect to dolomite. Some waters,\nparticularly those high in magnesium are oversaturated\n(Types 1a, 1b, 1c), some are approximately saturated\nColin Neal and Paul Shand\n812\nTable 8. Saturation indices for secondary silicates (clays and layer lattice silicates) in surface and groundwaters of the\nCyprus ophiolitic areas. The terms in italics represent upper limits of values of saturation indices values where there are\nissues of lowest quotable value: these saturations are provided for illustrative purposes only.\nChrysotile Chlorite (14Å) Illite Kaolinite Ca-Mont Sepiolite Talc Pyrophyllite\nTYPE 1A: Mg-HCO3\n10 3.00 1.26 -6.48 -3.95 -6.08 2.35 7.19 -0.54\n11 0.38 -2.06 -5.27 -2.55 -4.40 0.86 4.89 1.18\n12 4.08 2.78 -7.54 -4.83 -7.44 2.61 7.73 -1.97\nTYPE 1B: Mg-HCO3 WITH Cr\n6 4.54 8.45 -4.79 -1.99 -5.17 1.49 6.47 -0.85\n7 7.14 11.41 -8.72 -5.22 -9.79 1.88 7.47 -5.67\n8 0.35 2.56 -4.20 -0.78 -3.84 -1.22 2.39 0.47\n9 2.35 0.34 -7.88 -4.78 -7.60 1.21 5.70 -0.85\nTYPE 1C: Mg-HCO3 WITH Na-Cl\n5 3.66 7.96 0.64 1.61 0.64 2.76 7.83 5.00\n13 7.76 7.29 -9.30 -7.16 -10.05 4.60 10.85 -4.87\nTYPE 2A: Na-Cl-HCO3\n1 1.99 3.44 -1.56 -0.75 -2.43 1.22 5.64 2.12\n2 1.41 2.38 -1.62 -0.77 -2.44 0.87 5.10 2.14\n21 0.50 -4.81 -9.18 -6.46 -9.07 0.25 4.18 -3.56\nTYPE 2B: Na-SO4-Cl\n15 1.65 -3.70 -9.79 -7.36 -9.80 0.96 5.62 -4.53\n14 1.86 4.30 0.05 0.55 -0.52 1.28 5.69 3.60\n17 0.77 1.62 -1.97 -0.51 -1.90 0.41 4.42 2.36\nTYPE 3A: Na-Cl-SO4-OH-CO3\n3 8.72 13.60 -5.57 -4.79 -8.25 3.56 9.80 -4.49\n4 7.95 12.74 -4.31 -3.76 -6.79 3.50 9.57 -2.93\nTYPE 3B: Na-Ca-Cl-SO4-OH\n19 5.71 9.12 -7.44 -5.15 -8.98 0.91 6.01 -5.63\nTYPE 4: Na-Cl-SO4\n18 -0.80 -6.15 -7.30 -5.51 -7.69 -0.52 3.01 -2.49\nTYPE 5: Ca-Na-SO4\n16 -0.33 -5.44 -7.84 -5.38 -7.35 -0.05 3.65 -2.18\n20 0.14 1.23 -1.64 -0.07 -1.35 -0.16 3.62 2.62\n(Types 4 and 5) and some are saturated to undersaturated\nwith respect to dolomite (Types 2a, 2b, 3a and 3b). Thus,\nfor the different water types, there is the potential for\nsolution or precipitation. In some cases, dolomite\nsolubility controls may be operative.\nz CaMg(CO3)4 and MgCO3: huntite and magnesite. The\nwaters show a variable saturation. The waters\nparticularly high in magnesium are generally\noversaturated (Types 1a, 1b, 1c) while the other waters\nare saturated to unsaturated.\nz SrCO3: strontianite. The waters are all undersaturated\nwith respect to this mineral.\nOxides\/hydroxides\nz Mg(OH)2: brucite. The waters vary from\n813\nSpring and surface water quality of the Cyprus ophiolites\nundersaturation to oversaturation with respect to brucite.\nThere is an approximate gradation from undersaturation\nto over saturation as pH increases and magnesium\ndecreases in concentration. This feature coupled with\nthe patterns shown in Fig. 4 for Mg and pH plotted\nagainst Cl, may well indicate that as pH increases, Mg\nis being lost from solution as brucite. However, there is\nno clear evidence that an equilibrium solubility control\nis operative.\nz Al(OH)3: gibbsite. The waters are undersaturated with\nrespect to this phase and there is a clear potential for\nsolubilisation.\nz SiO2: quartz, chalcedony, chrystobalite and amorphous\nsilica. The degree of silica saturation varies according\nto the extent of atomic structuring of the silica minerals.\nThe most crystalline form is quartz, intermediate\ncrystallinity is for chalcedony and chrystobalite and the\nhighest solubility is for amorphous silica. Only data for\nquartz are presented here (subtracting 0.44, 0.40 and\n1.29 from the saturation index for quartz can,\napproximately, allow the assessment of the saturation\nvalues for chalcedony, chrystobalite and amorphous\nsilica, respectively). There is no clear pattern to quartz\nsaturation: the waters vary between under- and over-\nsaturated. For chalcedony and chrystobalite, the waters\nare approximately saturated for the Type 1a, 2a, 2b, 4\nand 5 waters and undersaturated for the other water\nTypes. The waters are undersaturated with respect to\namorphous silica.\nSECONDARY Mg\/Al BEARING SILICATES\nThe solubility of this group of minerals is very variable and,\nin most cases, the minerals are either consistently\noversaturated or consistently undersaturated. The saturation\nindex relationships are as follows.\nz Chrysotile and sepiolite. The waters are oversaturated with\nrespect to these minerals for Types 1 and 2 with the largest\noversaturation occurring for Types 3a and 3b. For Types 4\nand 5, approximate saturation is encountered.\nz 14Å chlorite and talc. The waters are predominantly\noversaturated with respect to these minerals. However,\nin the case of 14Å chlorite, large undersaturation occurs\nfor the Type 2a, 2b, 4 and 5 waters when the aluminium\nconcentrations are particularly low.\nz Illite, kaolinite and montmorillonite. These clay types\nare mainly undersaturated.\nOf these minerals, chrysotile, sepiolite, chlorite and talc\noccur within the ophiolite sequence and clearly there is the\npotential for further precipitation. Illite, kaolinite and\nmontmorillonite comprise the main clay mineral types within\nsedimentary rocks and soils and these phases are usually\nsoluble.\nDiscussion\nTHE EVOLUTION OF WATER QUALITY IN THE\nOPHIOLITES\nThe water quality of surface and groundwaters associated\nwith the Cyprus ophiolites is of an alkaline type that is very\nvariable in terms of pH and dissolved salt content. This\nvariability can occur even within localised areas (e.g. springs\n1 to 5 are relatively close together). The stable isotopes (δ2H\nand δ18O) ratios also show a range, generally becoming\nheavier from Type 1 to Type 4 (Fig. 5). The isotopic ratios\nin precipitation show a negative correlation with elevation\n(Jacovides, 1979) and may partially explain the trend of\nδ18O with salinity within the groundwaters (Fig. 4). The\nchemistry of the waters is determined by the extent and\nnature of the weathering\/hydrolysis of the ophiolite and\nmixing with groundwaters already present in the bedrock.\nThere are broadly three main aspects.\n1. Where CO2 from the atmosphere and the soil is freely\navailable, the weathering of the primary minerals\n(magnesian silicates) leads to the production of\nmagnesium bicarbonate type waters of moderate\nalkalinity and pHs around 8.5. In some cases, chromium\nis leached from the rock to solution. Correspondingly,\nFig. 5. Relationship between δ2H and δ18O for the Troodos\ngroundwaters. Local meteoric water line from Jacovides (1979). The\nsample of Type 4 water is not plotted because of a potential spurious\nanalysis for δ2H.\nColin Neal and Paul Shand\n814\nfor components such as aluminium, the formation of\nsecondary minerals ensures that concentrations are close\nto or below the limits of detection. For these waters,\ndissolved carbon dioxide levels vary around saturation\nby about a factor of ten and this is probably quite normal\nfor surface waters where photosynthesis and respiration\nare active. Nonetheless, for the springs, some uptake of\nCO2 seems to have taken place and calcium carbonate\nor calcium-magnesium carbonate solubility controls\nmay be active. The magnesium carbonate waters have\nlow concentrations of Cl and SO4 indicating that the\nmajor geochemical control is water-rock interaction.\nThe low total dissolved solids in these waters is\nconsistent with tritium and stable isotope studies which\nshowed that the Mg-HCO3 waters are relatively young\nand derived from local catchment areas (Jacovides, 1979).\n2. Within the groundwater system, an evolutionary series\nof water types occurs (Neal and Stanger, 1984; Stanger,\n1986), for a system that is partially\/effectively “closed”.\nThe primary minerals within the rock dissolve partially\nto increase the calcium levels and to consume hydrogen\nions. In the process, the pH rises as CO2 is not freely\navailable to buffer hydrogen ion consumption. In turn,\nthis leads to conversion of dissolved carbon dioxide\nand bicarbonate to carbonate, the water becomes\nundersaturated with respect to carbon dioxide and\nsaturated\/oversaturated with respect to Ca, Ca-Mg and\nMg carbonates. Furthermore, the waters increase in\nhydroxyl concentration and this leads to oversaturation\nwith respect to Mg(OH)2, while carbonate buffering is\nlost. Due to this process, magnesium is progressively\nlost from solution (Fig. 3), while releases of calcium\nfrom primary mineral dissolution are compensated\npartly by secondary precipitation of carbonates. For the\nvery high pHs encountered, aluminium is present mainly\nas aluminate anions that are relatively stable in solution.\nBecause of this, the total aluminium concentration\nincreases with increasing pH (Fig. 3). This is in contrast\nto Al+3 concentrations that decline sharply as pH\nincreases.\n3. Within the groundwater, there is an increase in salinity\n(e.g. from formation waters, fluid inclusions or\nevaporites). Increases in salinity commonly occur due\nto mixing with a deeper formation water, through the\ndissolution of evaporite minerals (e.g. gypsum\/\nanhydrite, halite) or evaporation. The relative\nproportions of dissolved components to Cl can be used\nto discriminate the origin of salinity in groundwater\nsystems. However, in the case of non-conservative\nparameters, an understanding of water-rock interactions\nis essential in determining the relative importance of\nthe above processes e.g. the precipitation or dissolution\nof Ca and Mg salts or ion-exchange reactions may\nmodify simple mixing patterns.\nThe composition of Mg-HCO3 and hyperalkaline waters\nin Cyprus, a comparison with other areas.\nMg-HCO3 type waters\nTable 9 provides a summary of the Mg-HCO3 waters from\nthe different ophiolite study areas. For the table, the Cyprus\ndata is split into low- and high-salt categories. The low salt\nTable 9. A comparison of magnesium bicarbonate waters for Cyprus (this study), Greece\n(Papastamataki, 1977), Northern Oman (wadis with catchments wholly in ultramafic\nareas: Neal and Stanger, 1994) and the western USA (average data from Barnes and\nO’Neil, 1971 as summarized by Drever, 1997). The units are all mg-element l-1 except\nfor sulphate (mg-SO4 l\n-1) and pH (dimensionless).\nSite Cyprus Cyprus Greece Northern Western\n‘low sea salt’ ‘high sea salt’ Oman USA\npH  7.9 – 9.8 8.7 – 9.5 7.9 – 8.4 8.1 – 10.4 8.6\nNa  3.2 – 5.1 12 – 52 4.1 – 11.5 11 – 110 7.2\nK  0.2 – 0.3 0.9 – 1.5 0.0 1 – 6 0.7\nCa  1.5 – 5.1 37 – 41 12 – 39 7 – 34 7.9\nMg   55 – 112 31 – 45 81 – 117 17 – 59 126\nCl 7 – 9 28 – 45 7 – 11 11 – 181 12\nSO4 2.1 – 3.6 15 – 46 6.7 – 12.5 11 – 84 11\nSi   0.3 – 19.5 6 – 14 – 1.9 – 8.4 19\n815\nSpring and surface water quality of the Cyprus ophiolites\ncategory combines Types 1a and 1b that are very similar,\nother than in terms of the trace levels of Cr in the waters,\nwhile the high-salt category is represented by Type 1c\nwaters.\nAll of the Cyprus Mg-HCO3 waters are similar to the other\nophiolite study areas, but the high-salt group is closer to\nthat for Northern Oman, while the low-salt group is similar\nto that for Greece and the Western USA.\nHyperalkaline waters\nTable 10 provides a summary of the water chemistry of the\nhyperalkaline waters in Cyprus and elsewhere. The Cyprus\nhyperalkaline waters are split into two groups based on low-\nand high-calcium contents. The low calcium grouping has\nlow calcium concentrations relative to all the study areas\nand this may well reflect a greater extent of carbonate\nprecipitation or ion exchange. However, in most other\nrespects (pH, sea-salt and sulphate concentration) the Cyprus\nhyperalkaline waters are similar except for potassium where\nthere is a marked enrichment in the case of Type 3a. In\ncomparing the information for the different study areas, two\nfeatures emerge. Firstly, the Cyprus hyperalkaline waters\nhave a much higher salt content than for the other\nMediterranean areas as well as New Caledonia and the USA.\nSecondly, the waters are similar to those found in Northern\nOman, the exception being the low calcium Cyprus Type\n3a group which is also enriched in silica.\nFrom these observations and earlier publications:\n1. Cyprus hyperalkaline springs are similar to those in\nNorthern Oman with respect to the “sea-salt”\ncomponents. These require an additional “sea-salt”\ncomponent compared to the other areas.\n2. The Cyprus hyperalkaline springs can show particularly\nhigh sulphate concentrations.\n3. The Cyprus data is consistent with the pioneering work\nof Barnes et al. (1978), who explained hyperalkaline\nsprings in terms of low temperature serpentinisation\nreactions. In detail, the evolution of the waters is\nprobably closest to that described by Neal and Stanger\n(1984) and Stanger (1986) for Northern Oman.\nThe origin of increased salinity in the Cyprus\ngroundwaters\nThe groundwaters display both an extremely large range in\nCl concentration as well as in the relative abundances of\nmajor elements (Figs. 2–4).  Extensive evaporation cannot\nexplain the stable isotope signatures (Fig. 4), the low Cl in\nType 1 waters or the trends in groundwater chemistry\n(evaporation would lead to loss of major components e.g.\nCa, Mg, due to precipitation reactions).  The most saline\nsample (Type 4) was collected from the pillow lavas, which\nare known to have restricted groundwater circulation.  This\ngroundwater has a Br\/Cl ratio slightly lower than that of\nsea-water but too high to be derived from the dissolution of\nhalite.  There is a good correlation of Br with Cl in all waters,\nwhich is similar to the sea-water dilution curve (Fig. 4).\nThe most likely origin, therefore, for this saline water is a\ndilute sea-water which has not been sufficiently flushed from\nthe aquifer. This is also consistent with the general\ncorrelation of δ18O and salinity, variations from this trend\nbeing due to different recharge history. However, the\ngroundwater has been significantly modified from that of\nsea-water by chemical reactions (e.g. gypsum\/anhydrite\ndissolution) as well as dilution, giving rise to higher or lower\nsolute concentrations in non-conservative parameters (Fig.\n3) and should be described as a formation water rather than\na connate water (thus avoiding any generic connotation).\nThe water types display generally good trends when\nTable 10. A comparison of hyperalkaline data for Cyprus (this study), Greece (Papastamataki,\n1977), Bosnia (Derkovic, 1973), Oman (Neal and Stanger, 1984), New Caledonia and USA (Barnes\net al., 1978). The units are all mg-element l–1 except for sulphate (mg-SO4 l\n–1) and pH (dimensionless).\nCyprus Cyprus Greece Bosnia Oman New Western\nType 3a Type 3b Caledonia USA\npH 11.5 11.2 11.0 – 11.7 11.7 11.0 – 11.9 10.8 11.5\nNa 385 163 22 – 25 35 66 – 331 15 19\nK 15.1 1.2 0.4 – 2.0 1.5 6.0 – 15.6 3 1\nCa 1 93 33 – 35 29 23 – 91 14 40\nMg 0.3 0.5 0.1 – 0.5 7 0.0 – 2.6 2.3 0.3\nCl 420 190 16 – 18 20 160 – 415 22 63\nSO4 251 207 0 – 5 2 0 – 45 0.8 0.4\nSi 24 3.4 1.6 – 2.1 0.9 0.2 – 6.1 0.4 0.4\nColin Neal and Paul Shand\n816\nplotted against Cl indicating that mixing between young\nrecharge waters and an end-member similar to the type 4\nwater can largely explain the increase in salinity the Troodos\ngroundwaters.   However, many elements fall off a potential\nmixing line (Fig. 4) and this feature highlights the\nimportance of additional geochemical reactions for these\nhydrogeochemically reactive elements in the evolution of\nthe waters.\nThe Type 1 waters have been considered in detail above\nand represent relatively young waters, but some mixing with\nof a more saline water has occurred for Type 1c.  The Type\n2a and 2b waters plot in different fields on a PIPER diagram\n(Fig. 2). The Type 2a waters have relatively high Na\/Cl\nratios, high HCO3 and low Ca concentrations. Their\ncompositions are consistent with a reaction pathway that\ninvolves cation exchange of Ca for Na.  In contrast, the\nType 2b waters have much higher Ca and SO4 and lower\nHCO3, and can be best explained by dissolution of gypsum:\nsince the waters are saturated with respect to calcite, any\ndissolution of gypsum would force calcite to precipitate\n(hence lower than expected Ca and HCO3 proportions).\nLikewise the Type 3a and 3b waters show contrasting\nbehaviour on the PIPER diagram (Fig. 2).  The Type 3 waters\ncan also be explained by gypsum\/anhydrite dissolution with\nthe Type 3a waters having undergone ion exchange (in this\ncase probably driven by gypsum dissolution).  Silicate\nhydrolysis reactions are also extremely important for Type\n3 waters, leading to high pH, has been discussed previously.\nIt has been suggested that high SO4 in groundwaters of the\nTroodos are due to sulphide mineral oxidation (Wagner et\nal., 1990).  Sulphide minerals are present in certain parts of\nthe ophiolite sequence (up to 1.26 wt. %), particularly the\nupper dyke sequence, as are gypsum and anhydrite (Alt,\n1994).  Sulphide oxidation produces significant amounts of\nH+ which would lower the pH (acid waters are known in\nparts of the ophiolite where this has occurred) and the good\ncorrelation of Ca with SO4 makes it much more likely that\ngypsum or anhydrite is the dominant control on the excess\nCa and SO4 in these groundwaters.  The final group, the\nType 5 waters are of Ca-(Na)-SO4 type.  These have very\nhigh Ca and SO4 concentrations and Ca\/Cl and SO4\/Cl ratios\n(Fig. 4) indicating extensive gypsum\/anhydrite dissolution\nas well as a high component of formation water.\nConclusion\nThe ophiolites of Cyprus represent a highly dynamic phase\nof hydrothermal and earth surface temperature alteration of\nocean floor rocks. The water quality of surface and\ngroundwaters reflects this variability. The evolution of the\nwaters is tied strongly to the basic\/ultrabasic character of\nthe rocks that weather to consume hydrogen ions to increase\npH. This, in turn, leads to the removal of dissolved carbon\ndioxide as calcium and\/or Ca-Mg carbonates. The\ngeochemical evolution of the waters is also strongly\ncontrolled by mixing involving an older formation water\n(with a salinity approximately 40% that of sea-water) and\nthe dissolution of gypsum and\/or anhydrite present within\nthe ophiolite rocks. The water quality varies even over short\ndistances and this implies a fracture flow system that is\nheterogeneous with respect to both hydrology and chemical\nreactivity.\nBroadly, the water types encountered in Cyprus are similar\nto those found in other ophiolitic areas and\nhydrogeochemical processes described in earlier\npublications can be invoked to account for their\ncompositions (Barnes and O’Neil, 1971; Barnes et al., 1967,\n1972, 1978; Neal and Stanger, 1984, 1985; Stanger, 1986).\nHowever, salinity is much higher in some groups of the\nCyprus ophiolite groundwaters due to mixing with a saline\nend-member and dissolution of evaporite minerals. Indeed,\nthe Cyprus ophiolitic environment seems to provide a wide\nrange of alkaline to hyperalkaline water types that hopefully\nwill shed new light on the evolution of water quality in\nophiolitic areas. Thus, the water chemistry may well provide\nimportant clues to the history of the Cyprus ophiolites\nregarding groundwater circulation, mixing and sulphide\noxidation.\nThe data from this and an earlier study (Pantazis, 1978)\ncontribute to an understanding of the hydrogeochemistry\nof a remarkable ophiolite. Several areas can be highlighted\nwhere further research would help in the management of\nwater resources in the Cyprus ophiolite. The spatial and\ndepth variations with regard to the occurrence of saline water\nare not clearly understood. A more regionally extensive\nstudy of groundwaters, particularly with regard to chemical\nstratification with depth would help to highlight the\nmechanisms of groundwater mixing. The application of\nstable isotopes (d2H and d18O) and dating (e.g. using CFCs)\nshould further constrain mixing processes and the age of\nthe different groundwaters. The relative inputs of sulphate\nfrom different sources (e.g. sulphides, sulphates) needs to\nbe quantified in more detail and this should be possible by\na study of sulphur isotopes which show significant\ndifferences between these mineral phases. There is also little\ndata on the concentrations of trace elements that may have\nstatutory limits in these groundwaters, and may also help\nelucidate geochemical processes and reactions in the aquifer.\nIt is hoped that the study stimulates further work in the area.\n817\nSpring and surface water quality of the Cyprus ophiolites\nAcknowledgements\nThe authors thank G. Constantinou, A. Charalambides and\nE. Makredes of the Geological Survey of Cyprus for their\ninvaluable help and enthusiasm within the field visit. Dr B.\nDerkoviæ is thanked for the hyperalkaline spring water\nsample from Bosnia.\nColin Neal acknowledges the strong influence and\nenthusiasm of the late Professors Ian Gass and Ivan Barnes.\nThis paper is published with the permission of the\nDirector, British Geological Survey, NERC.\nReferences\nAlt, J.C., 1994. A sulfur isotopic profile through the Troodos\nophiolite, Cyprus: Primary composition effects of seawater\nhydrothermal alteration. Geochim. Cosmochim. Acta, 58, 1825–\n1840.\nAppelo, C.A.J. and Postma, D., 1993. Geochemistry, groundwater\nand pollution. Balkema, Rotterdam, The Netherlands, 536pp.\nBarnes, I. and O’Neil, J.R., 1971. The relationship between fluids\nin some fresh Alpine-type ultramafics and possible modern\nserpentinization, western United States. Bull. Geol. Soc. Am.,\n80, 1947–1960.\nBarnes, I., La Marche, V.C. Jr. and Himmelberg, G., 1967.\nGeochemical evidence of present day serpentinization. Science,\n156, 830–832.\nBarnes, I., Rapp, J.B., O’Neil, J.R., Sheppard, R.A. and Gude,\nA,J., 1972. Metamorphic assemblages and the direction of flow\nof metamorphic fluids in four instances of serpentinization.\nContrib. Mineral. Petrol., 35, 263–276.\nBarnes, I., O’Neil, J.R. and Trescases, J.J., 1978. Present day\nserpentinization in New Caledonia, Oman and Yugoslavia.\nGeochim. Cosmochim. Acta, 42, 144–145.\nDerkovic, B., 1973. A new type of strongly hydroxide-sodium-\ncalcium water at Kulasi (Bosnia) Yugoslavia. Bull. Acad. Sci.\nArts, Yugoslavia, Sect. A, 18, 134–135.\nDrever, J.I., 1997. The geochemistry of natural waters. Prentice-\nHall, Upper Saddle River, NJ 07458, USA: 436pp.\nGass, I.G., 1982. Ophiolites. Sci. Amer., 247, 122–131.\nGass, I.G. and Masson-Smith, D., 1963. The geology and gravity\nanomalies of the Troodos Massif, Cyprus. Phil. Trans. Roy. Soc.\nLondon. A. No. 1060, 255, 417–467.\nJacovides, J., 1979 Environmental isotope survey (Cyprus). Final\nReport of International Atomic Energy Agency, Vienna, 81pp.\nLippard, S.J., Shelton, A.W. and Gass, I.G., 1986. The ophiolite\nof Northern Oman. Memoir 11, Geol. Soc. London. Blackwell,\nOxford, UK, 178pp.\nNeal, C., 1988. Bicarbonate estimation from alkalinity\ndeterminations for acidic low alkalinity natural waters:\ntheoretical considerations. Hydrolog. Sci. J., 33, 619–623.\nNeal, C. and Stanger, G., 1983. Hydrogen generation from mantle\nsource rocks in Oman. Earth Planet. Sci. Lett., 66, 315–320.\nNeal, C. and Stanger, G., 1984. Calcium and magnesium hydroxide\nprecipitation from alkaline groundwaters in Oman, and their\nsignificance to the process of serpentinization. Min. Mag., 48,\n237–241.\nNeal, C. and Stanger, G., 1985. Past and present serpentinisation\nof ultramafic rocks; an example from the Semail Ophiolite\nNappe of Northern Oman. In: The Chemistry of Weathering,\nJ.I. Drever (Ed.). NATO ASI Series C: Mathematical and\nPhysical Sciences, 149, 249–275.\nNeal, C., Smith, C.J. and Hill, S., 1992. Forestry impact on upland\nwater quality. Institute of Hydrology Report Series No. 119,\nCEH, Wallingford, UK, 1–50.\nNeal, C., House, W.A. and Down, K., 1998a. An assessment of\nexcess carbon dioxide partial pressures in natural waters based\non pH and alkalinity measurements. Sci. Total Envir., 210\/211,\n173–186.\nNeal, C., House, W.A., Jarvie, H.P. and Eatherall, A., 1998b. The\nsignificance of dissolved carbon dioxide in major lowland rivers\nentering the North Sea. Sci. Total Envir., 210\/211, 187–204.\nPantazis, T.M., 1978. Thermal mineral waters of Cyprus. Int. Cong.\non thermal waters, geothermal energy and volcanism of the\nMediterranean area. National Technical University, Dept. Min.\nPet. Geol., 42, Patision St., Athens, Greece, T.T 142, 367-386.\nPapastamataki, A., 1977. The alkalinity and the chemical\ncomposition of springs issuing from peridotites. Ann. Geolog.\ndes pays Helleniques, 551–565.\nParkhurst, D.L., 1995. User’s guide to PHREEQC -a computer\nprogram for speciation, reaction-path, advective-transport, and\ninverse geochemical calculations . Water resources\ninvestigations report 95-4227. US Geological Survey, Earth\nSciences Information Section, Box 25286, MS 517, Denver\nFederal Center, Denver, CO80225. 151pp.\nShand, P., Edmunds, W.M., Chudaeva, V.A., Lutsenko, T.N.,\nChudaev, O.V. and Chelnokov, A.N., 1995.  High PCO2 springs\nof the Primorye region, eastern Russia. In: Water-Rock\nInteraction 8, Y.K. Kharaka and O.V. Chudaev (Eds.), Balkema,\nRotterdam, The Netherlands. 393–396.\nStanger, G., 1986. The Hydrogeology of the Oman Mountains.\nPhD Thesis, The Open University, Milton Keynes, UK, 2vols,\n800pp.\nWagner, W., Zomenis, S.L. and Plöthner, D., 1990. Groundwater\nquality in the region between Nicosia, Larnaca and Limassol,\nCyprus. Geologisches Jahrbuch, Reihe C, Heft 54, Hannover.\nWenner, D.B. and Taylor, H.P., Jr., 1971. Temperatures of\nserpentinization of ultramafic rocks  based on 18O\/16O\nfractionation between co-existing serpentine and magnetite.\nContrib. Mineral. Petrol., 32, 165–185.\nWenner, D.B. and Taylor, H.P., Jr., 1973. Oxygen and hydrogen\nisotope studies of the serpentinization of ultramafic rocks in\noceanic environments and continental ophiolite complexes.\nAmer. J. Sci., 273, 207-239.\nWilson, M., 1989. Igneous Petrogenesis: A global tectonic\napproach. Chapman and Hall, London, UK. 496pp.\nWilson, R.A.M. and Ingram, F.T., 1984. The geology of the Xeros-\nTroodos area. Ministry of Agriculture and Natural Resources,\nGeological Survey Department, Cyprus. Memoir No. 1, 184pp.\n"}