{"doi":"10.1080\/00438240600963031","coreId":"65998","oai":"oai:dro.dur.ac.uk.OAI2:3760","identifiers":["oai:dro.dur.ac.uk.OAI2:3760","10.1080\/00438240600963031"],"title":"Things to do in Doggerland when you're dead : surviving OIS3 at the northwestern-most fringe of Middle Palaeolithic Europe.","authors":["White,  M. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12-01","abstract":"This paper examines Neanderthal survival skills in Britain. Its starting point is that there are major tensions between the three main sources of relevant information - archaeological, palaeoanthropological and palaeoenvironmental data and their subsequent interpretation - that make our understanding of Neanderthal survival much more precarious than is generally supposed. The paper is speculative, and proffers questions not answers. It challenges us to look past the often mute material record, and to equip Neanderthals with a number of logically prerequisite but generally archaeologically invisible survival tools and practices, beyond the well-trodden paths of mobility, hunting and planning","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65998.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3760\/1\/3760.pdf","pdfHashValue":"0a9e915ce0d40dc7ee4ce919b17deb0f8cc3fb72","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3760<\/identifier><datestamp>\n      2011-08-30T14:36:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Things to do in Doggerland when you're dead : surviving OIS3 at the northwestern-most fringe of Middle Palaeolithic Europe.<\/dc:title><dc:creator>\n        White,  M. J.<\/dc:creator><dc:description>\n        This paper examines Neanderthal survival skills in Britain. Its starting point is that there are major tensions between the three main sources of relevant information - archaeological, palaeoanthropological and palaeoenvironmental data and their subsequent interpretation - that make our understanding of Neanderthal survival much more precarious than is generally supposed. The paper is speculative, and proffers questions not answers. It challenges us to look past the often mute material record, and to equip Neanderthals with a number of logically prerequisite but generally archaeologically invisible survival tools and practices, beyond the well-trodden paths of mobility, hunting and planning. <\/dc:description><dc:subject>\n        Middle Palaeolithic<\/dc:subject><dc:subject>\n         Neanderthal<\/dc:subject><dc:subject>\n         Archaeology<\/dc:subject><dc:subject>\n         Palaeoanthropology<\/dc:subject><dc:subject>\n         Palaeoenvironments<\/dc:subject><dc:subject>\n         Doggerland.<\/dc:subject><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        World archaeology, 2006, Vol.38(4), pp.547-575 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3760<\/dc:identifier><dc:identifier>\n        issn:0043-8243<\/dc:identifier><dc:identifier>\n        issn: 1470-1375<\/dc:identifier><dc:identifier>\n        doi:10.1080\/00438240600963031<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3760\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/00438240600963031<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3760\/1\/3760.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1470-1375","issn:0043-8243"," 1470-1375","0043-8243"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Middle Palaeolithic","Neanderthal","Archaeology","Palaeoanthropology","Palaeoenvironments","Doggerland."],"subject":["Article","PeerReviewed"],"fullText":"  \n \n \n \nDurham Research Online \n \nDeposited in DRO: \n15 April 2009 \n \nVersion of attached file: \nAccepted for publication \n \nPeer-review status of attached file: \nPeer-reviewed \n \nCitation for published item: \nWhite, M. J. (2006) 'Things to do in Doggerland when you're dead : surviving OIS3 at the \nnorthwestern-most fringe of Middle Palaeolithic Europe.', World archaeology., 38 (4). pp. \n547-575. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1080\/00438240600963031 \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n \n  1\nThings to do in Doggerland when you’re dead: \nSurviving OIS 3 at the northwestern-most fringe of Middle Palaeolithic Europe \n \nMark J White \n \nDepartment of Archaeology \nUniversity of Durham \nDurham \nDH1 3LE \nm.j.white@durham.ac.uk \n \n \nAbstract and Introduction \nThis paper examines Neanderthal survival skills in Britain.  Its starting point is that there are \nmajor tensions between the three main sources of relevant information- archaeological, \npalaeoanthropological and palaeoenvironmental data and their subsequent interpretation – \nthat make our understanding of Neanderthal survival much more precarious than is generally \nsupposed.  The paper is speculative, and proffers questions not answers.  It challenges us to \nlook past the often mute material record, and to equip Neanderthals with a number of \nlogically prerequisite but generally archaeologically invisible survival tools and practices, \nbeyond the well-trodden paths of mobility, hunting and planning. \n \nOpening Gambit \nThe British Middle Palaeolithic is largely an archaeology of absence.  Having abandoned the \nregion during the hostile conditions of the OIS6 glaciation, Neanderthals did not reappear on \nthe British landscape until OIS4\/3 (ca 60kya), some 120,000 years later (Ashton 2002; \nCurrant and Jacobi 2002; White and Jacobi 2002).  With very little else to discuss for this \nperiod, British specialists have quite understandably devoted much attention to the reasons \nfor this hiatus, and in doing so have become rather adept at finding environmental, \necological, adaptive, and social reasons as to why Neanderthals kept away for so long (e.g., \nGamble 1986, 1987, 1992; Ashton 2002; Ashton and Lewis 2002).  But as new discoveries \nand improved understandings of old sites enhance our knowledge of the Late Middle \nPalaeolithic occupation of Britain, it is time to shake off this obsession with absences and \nbarriers and attend to a different question: just how did Neanderthals actually survive the still \ninhospitable conditions they would have encountered upon their return, particularly the \nBritish winters?  \n \nThe question of survival strategies is particularly apposite given recent conclusions that the \nclassic Neanderthal morphology would not have given them the degree of biological \nbuffering previously thought (Aiello and Wheeler 2003).  As a result a conflict between: a) \nthe harsh and treeless environments inferred for OIS3 Britain and; b) the tenacious image of \nculturally and intellectually challenged Neanderthals (Speth 2004) - so often denied basic \ntools and seen as relying on physical robusticity alone – is thrown sharply into relief.   Many \nof the issues raised here go well beyond Britain in OIS3, but this provides a useful platform \nfrom which to start, offering a geographically-legitimate region with its own set of challenges, \na rich tradition of Quaternary research and a characteristic if somewhat impoverished \narchaeological record.   \n \nNeanderthal Environments in Britain during OIS3  \nA well-stocked but treeless grassland, with short, cool summers and long, cold winters \nmarked by blasting winds, frozen ground and persistent snow.   This is what Neanderthals \napparently faced as they headed northwest from their more southerly glacial refugia during \nOIS4\/3. \n \nOften referred to as a failed interglacial, the isotopic record shows that OIS3 was actually a \n  2\nperiod of extreme climatic instability, with dramatic alternations between milder and colder \nconditions at millennial or sub-millennial timescales (Dansgaard-Oeschger oscillations; \nDansgaard et al 1993; Van Andel 2003).  On a larger scale, the period can be divided into a \nnumber of broad sub-phases: 1) an early milder phase, ca 59-43kya; 2) a period of climatic \ndeterioration ca 42-37kya, showing more tightly-spaced clusters of cold D\/O events and; 3) a \ncold phase starting about 37kya during which conditions were similar to those of the Last \nGlacial Maximum (OIS2) (Van Andel 2003; Davies and Gollop 2003). \n \nThroughout this period, direct terrestrial access into Britain would have been practicable.  \nAlthough global ice volume was reduced from its OIS4 maximum, land-ice probably limited \nto local ice-caps (Shackleton 1987; Arnold et al 2002; Van Andel et al 2003a, 33), sea level \nwas still some 80m lower than present.  This was sufficient for Britain to remain a peninsula \nof NW Europe (Barron et al 2003, 58).  Mainland Britain would thus have been an ‘upland’ \nzone (at ~80m a.s.l plus land elevation) on the western fringe of the North European Plain, \npart of the region sometimes referred to as Western Doggerland (Coles 1998, McNabb \n2001).  This was bounded on the south and east by extensive, resource rich lowland basins \n(i.e. the present North Sea and Channel) into which several major British and European river \nsystems would have drained, some joining the westward-flowing Channel River en route to \nthe Atlantic, others flowing north into a greatly reduced North Sea (cf. Antoine et al 2003).   \n \nPalaeoenvironmental Reconstructions \nTable 1 provides a list of OIS3 archaeological sites that have also yielded some \npalaeoenvironmental data.  Although frequently coarse and rather patchy, these nonetheless \nprovide the most direct approximation of the environments Neanderthals actually \nencountered in OIS3 Britain.  These data can be supplemented by often better evidence \nfrom a growing number of non-archaeological sites claimed to be of OIS3 age (not listed \nhere, see overviews in Jones and Keen 1993; Lowe and Walker 1997).  What is most \nimportant to stress here, however, is that all apparently show a remarkably consistent and \npersistent set of generic environmental conditions, despite the fact that a long time period \nencompassing many climatic oscillations is undoubtedly represented.  Accordingly, and \ngiven the temporal resolution of the data, a time-averaged palaeoenvironmental \nreconstruction of earlier OIS3 has been derived from these data and is discussed below. \n \nMollusc and insect faunas from OIS3 sites uniformly show an open, treeless environment, \nwith taxa characteristic of grassland with local patches of marsh and bare sandy facies.  \nClimatic indicators suggest sub-arctic temperatures.  In a comprehensive review of insect \nassemblages from 27 British OIS 3 sites, Coope (2002) has shown that warmest month \ntemperatures were on average just ~10°C, with the coldest months seeing lows of -20 to -\n27°C; these may only represent the warm D\/O events and could be on the conservative side \n(ibid, 405-6).  A marked warm period is evident beginning 43kya, when temperatures \napproached modern values, although critical for the argument developed below the structure \nof the environments inferred from the insects remains the same (Coope et al 1997; Coope \n2002).  Coope insists that the environment was treeless throughout OIS3, the key reasons \npossibly being poor soils\/soil development, large herbivore grazing and slow colonisation \nrates combined with the rapid climatic fluctuations. \n \nLimited pollen data has been recovered from both cave and open-air OIS3 sites.  Although \nnot without its problems (Turner 1985; Coles et al 1985) and often subject to strong criticism \n(e.g., Jacobi, cited in Aldhouse-Green et al 1995) it nevertheless can be noted as \nconforming to other proxies, being dominated by open grassland species.  Arboreal pollen \ncounts are generally very low, and while species like pine, alder, spruce, birch and willow are \nsometimes present, they are usually dismissed as being very far-travelled or representative \nof dwarf species.  Based on the Lynford evidence, Boismier et al (2003) suggested that \nsome localised patches of woodland probably existed somewhere in the landscape, although \nthis has been disputed on the basis of the molluscs and insects neither of which show any \n  3\nobligate woodland species (D. Keen pers. comm. 23\/10\/03; Coope 2003).  Campbell (1971), \nthough, raises the intriguing possibility that trees may have occurred in sheltered situations, \nfor example the southern side of the Mendips or ravines like Creswell Crags.   \n \nThe OIS3 mammalian fauna was dominated by mammoth, woolly rhinoceros, horse, bison \nand reindeer (cf. Currant and Jacobi 1997, 2001, 2002). Designated the Pin Hole \nMammalian Assemblage-Zone, it shows a curious mixture of ostensibly warm-adapted (i.e. \nred deer, giant deer) and cold-adapted species (i.e. mammoth, woolly rhinoceros, arctic fox, \nreindeer).  None are obligate forest species, though, and the whole has again been taken to \nshow the (?exclusive) dominance of rich open grasslands with abundant but low quality\/high \nfibre graze (i.e. the Mammoth Steppe of Guthrie 1990).  Currant and Jacobi suggest that the \ncharacter of the OIS3 British fauna shows the existence of continental conditions right up to \nthe Atlantic Seaboard, with fairly warm summers but harsh winters.  The mixed mammalian \nassemblage may thus reflect seasonal variation, as well as the impact of the millennial-scale \nclimatic fluctuations, not all species being present all of the time (cf. Stewart 2005).  At \nLynford, large numbers of dung beetles were recovered from the archaeological horizons, \ndemonstrating that the cool-climate grassland-dwelling mammals were alive and present at \nthe same time as Neanderthals.   \n \nThe micromorphological studies relevant to Neanderthal occupation have provided no \nevidence of permanently frozen ground during the periods of Neanderthal presence, \nalthough the Lynford site shows the landscape was probably frozen solid in winter.  Large \nflint nodules found within the organic silts at this site are thought to have derived from the \nsurface of winter ice, sinking into the fine sediments during the spring thaw, while marginal \ndebris flows may also reflect the melting and mobilisation of seasonally-frozen ground (Lewis \n2003).  Unit ii at Prospect Park, Heathrow (Rose et al, 2001), on the same terrace and at the \nsame altitude as the  Sipson Lane bout coupe find spot, also showed small polygonal \nfissures formed by desiccation and vein ice; the structural properties of the sediments being \ndescribed as typical of poorly-drained frost sensitive sites under periglacial although not \nnecessarily permafrost conditions.   \n \nThe site derived palaeoclimatic data outlined above can be augmented by the generalised \nmodelled data generated by the OIS3 Project (Barron et al 2003, Huntley and Allen 2003; \nDavies and Gollop 2003).  For present purposes I have concentrated on their warm D\/O \nevent projections, reflecting conditions ca 45 kya and used to represent all such events \nbetween ca. 60-42 kya.  These arguably represent the most favourable conditions \nNeanderthals could be expected to have encountered, setting the lower limits on survival \ndemands.  Again, this scale of analysis is considered appropriate to the task at hand \nbecause 1) the structure of the environment appears to be very consistent throughout and 2) \nthe temporal resolution of the data prevents a finer examination. Dating of the OIS3 sites in \nTable 1 is based at best on OSL or 14C estimations, with statistical uncertainties of \ncomparable or greater magnitude to the millennial D\/O oscillations (cf. Huntley et al 2003), \nbut more often on coarse biostratgraphical or lithostratographical correlations.  At best it is \npossible to situate sites within one of the three phases of OIS3 outlined above, but not \npresently to a particular D\/O event, cold or warm.   \n \nModelled temperatures show average warm event values at least 7-10°C lower than \npresent.  Summer temperatures would rarely have exceeded 8-12°C, with winter \ntemperature ranges falling to -8°C and below.  The spring thaw came late, with temperatures \nnot exceeding 0°C until April had past (Barron et al 2003, 70).   These surface air-\ntemperatures would have been further reduced by wind-chill. Atmospheric circulation models \nproject strong westerly airflow over Europe, creating strong zonal winds north of the \ntransverse European mountain ranges (Barron et al 2003, 63).  In Britain, wind-chill factors \nreduced the effective temperatures to at least 8°C in summer and -13°C in winter (Aiello and \nWheeler 2003, 159; underestimates according to Coope’s beetle data).  (Modelled cold D\/O \n  4\nevent temperatures suggest summer values, with wind-chill, of –1°C and winter values of -\n27°C). \n \nIn terms of precipitation, the OIS3 project suggests that the period was not in fact terribly \narid.  Based on their projections of sea-surface-temperature, sea-ice coverage and \natmospheric circulation patterns, Barron et al (2003, 68) concluded that onshore airflow over \nNW Europe may have delivered similar annual precipitation to that witnessed today, \nalthough summers may have been drier.  In winter much of the precipitation would have \nfallen in the form of snow.  Snow coverage is estimated to have lasted between 3-6 months \nof the year, reaching depths of 10-50mm (ibid, 67); although drifting may have left much of \nthe landscape with a minimal coverage.  However, the models also suggest that substantial \nwinter precipitation was preceded by heavy autumn rains (ibid, 72), which, falling just as \ntemperatures began to drop would have created a particularly unpleasant cold, wet climate.  \nGiven this level of precipitation, cloud cover, precluding much in the way of direct heating by \ninsolation, was presumably another key factor.  \n \nHow the west was won and where it got us \nThe reconstructions outlined above depict an environment rather hostile to human \noccupation.  We must now return to the question: just how did Neanderthals cope with this \ncool-cold, treeless and moist steppic environment when they returned to Britain?  \n \nPhysical Adaptations \nIt is cherished palaeoanthropological doctrine that Neanderthals were able to survive in \nPleistocene Europe by virtue of their morphological adaptation to cold environments, \nwhereas modern humans buffered themselves by sophisticated cultural means.  This has \nrecently been questioned by Aiello and Wheeler (2003), who present us with a more \nvulnerable Neanderthal who might not have been able to simply ‘tough it out’.  \n \nThese authors argue that, despite their body shape conforming to theoretical models for \narctic adaptation in humans and other animals, Neanderthals actually had little \nthermoregulatory advantage over anatomically modern humans in dealing with low \ntemperatures.  Assuming metabolic rates similar to modern humans, they calculate that \nNeanderthals would have possessed only a 1°C advantage (27.3°C vs 28.2°C) in their lower \ncritical temperature1, while the minimal sustainable ambient temperature2 would have been \nabout 8°C for Neanderthals compared to 10.5°C for modern humans (Ibid, 148-9).  Adjusting \nthe model to give Neanderthals the elevated basal metabolic rates (BMR) documented \namongst modern arctic-adapted peoples (due to factors such as high protein diets and the \neffects of temperature and day length on thyroid function) and adding the insulating effects \nof the increased muscle mass inferred from their skeletons (providing up to 5% reduction in \nheat loss), still returns fairly moderate lower critical and minimum sustainable temperatures, \nof 25.3°C and 1.9°C, respectively. \n \nThere are, however, other ways of keeping warm.  If elevated BMR Neanderthals are given \n1 clo of additional insulation3 – from subcutaneous fat, hair or clothing – then the lower \ncritical temperature becomes 16.7°C and the minimum sustainable temperature -21°C.  \nAiello and Wheeler reject the possibility of heat conservation solely by storing fat, as the \namount required would have weighed ~52kg, and conclude that hair (1clo = 4cm of all-over \n                                                \n1 “the lower limit of the thermoneutral zone within which a mammal can regulate its core temperature solely by \ncontrolling its thermal conductance…as the temperature falls below this level homeostasis can only be \nmaintained by increasing internal heat production, and incurring additional energetic costs associated with this \nincrease in heat production” (Aiello and Wheeler 2003, 148).  \n2 The minimum temperature at which an animal can maintain normal body temperature by raising its basal \nmetabolic rate to its maximum sustainable level, in humans usually about 3 times normal BMR.   \n3 1 clo = a reduction in heat loss from the skin equivalent to 38kcal\/m2\/hr \n  5\nbody hair) but most probably clothing must have been present.  Short of a Neanderthal ice-\nmummy, the length and coverage of their body hair will never be known, and although \nGuthrie (1990) reminds us that most inhabitants of the Mammoth Steppe were essentially \n‘woolly’, excessively hirsute northern Neanderthals does raise certain issues regarding \nspecies recognition and mating networks between different regional populations of \nNeanderthals, and between Neanderthals and modern humans (cf. Smith et al 2005).  Aiello \nand Wheeler’s favoured solution of clothing is taken up further below.  \n \nThis stimulating re-evaluation obviously elides a great deal of added complexity. Steegmann \net al (2002) speculated that cold adaptation in Neanderthals may have depended not only on \nmorphology but on a complex suite of physiological and genetic adaptations, including: \nthermogenic brown adipose tissue; small amounts of subcutaneous fat; muscle-mass; \nelevated BMRs; enhanced vasoconstriction and localised vasodilation, all intensified by \naerobic fitness and ontogenetic acclimatisation.  These conclusions were based on a \nnumber of studies into cold adaptations in contemporary human and non-human primates, \nas well as ethnographical anecdotes of 19th century Tierra del Fuegian lifestyles.  \nInterestingly, with all this said they still hypothesised the use of a number of complementary \ncultural adaptations (ibid, Table 2).  \n \nFor present purposes, the most important points to take from these studies are: that all of \nthese biological solutions are energetically costly and can become maladaptive if food \nsupply is inadequate (Steegmann et al 2002) and; that even warm event summer \ntemperatures in OIS3 Britain are routinely below the lower critical temperatures for 1 clo of \nadded insulation.  In other words, with some biological buffering and a minimal level of \nartificial insulation, life in Britain would still have been regularly outside the thermoneutral \nzone, thermally stressed and energetically expensive.  Furthermore, warm event winters \nmay still have approached minimal sustainable temperatures, while cold event winters \nalmost certainly exceeded them.  The inferred highly active lifestyle of acclimatised \nNeanderthals would, of course, have helped them cope, but they could not keep this up \n24\/7; they could not have been constantly ‘on the go’, feeding as they went to fuel their \nenergetic needs, and the problems of keeping warm during ‘downtime’ continues to force the \nissue.  Indeed, while Neanderthals may have had the potential to survive extremely harsh \ncondition, Davies and Gollop’s (2003) survey of their temporal and spatial distribution \nindicate that they actually favoured the warmer times and places.  During the earlier stable \nphase of OIS3 they generally shunned areas with winter temperatures below -8˚C and snow \ncover >50cm\/60 days and preferred summer temperatures between 12-25˚C.   \n \nAccording to Ashton (2002), however, from the late Middle Pleistocene onwards European \nhominins were becoming increasingly adapted to the cooler, open environments of the \nMammoth Steppe.  Success was achieved via higher levels of mobility, hyper-carnivory \ninvolving more developed hunting of large herds, enhanced tool curation and greater social \nflexibility (Ashton 2002, Gaudzinski 1996, 1999a; Bocherens 1999, 2001; Richards et al \n2000; White and Ashton 2003).  These are all certainly valid aspects of such an adaptation, \nbut to sustain Aiello and Wheeler’s type of Neanderthal we surely need more sophisticated \ncultural solutions than just keeping on the move, looking after your tools and eating more \nmeat.    \n \nClothes  \nThe probability that Neanderthals clothed themselves is widely acknowledged (albeit often \ntacitly) and most pictorial reconstructions show -  even if just for the sake of modesty - some \nform of apparel.  We can also safely infer from the faunal record that Neanderthals had \naccess to animal skins, while microwear has demonstrated that hide scraping was a regular \nfunction of several stone tool types (e.g. Anderson-Gerfaud 1990).  Jenkinson (1994, 74) \nalso speculated that the frequency of scrapers in the very small Pin Hole Cave assemblage \nindicated skin working in a suitably cool, sheltered environment.  Hayden (1993), on the \n  6\nother hand, assuming biological buffering in temperate climates, sees no need for clothing, \nwhich he argues is linked to social status, and costly and time consuming to produce.  \nNevertheless, given the modelled environments and physical adaptations outlined above, \nNeanderthals in Britain realistically needed clothes for much of the year.   \n \nThe essential properties of cold-weather clothing are insulating the body, protecting it from \nthe elements, and allowing the maintenance of task efficiency (Stenton 1991).  Effective \ncold-weather clothing operates on the air-capture principal, which works best if the garments \nare loose fitting and the sides are closed to stop warm air being constantly replaced by cold \nair (Buijs1997).  Well-designed clothing will also allow surplus heat and moisture to be \nvented (often at the neck) thus avoiding overheating, excess sweating and dehydration \n(Stenton 1991; Buijs 1997; Osborn 2004). \n \nTo provide anything like the type of ‘personal portable environment’ (Watkins 1984) \ndescribed above, Neanderthal clothing would have needed to be more than the ragged \nloincloth, off-the-shoulder wrap or cape of popular depiction (the last of which would pin the \narms inside, preventing effective action).  Some form of tailoring would probably have been \nrequired (Aiello and Wheeler 2003), but the Middle Palaeolithic has thus far yielded no \nevidence of needlecraft technology, which first appears in the Upper Palaeolithic.  However, \nNeanderthals certainly had access to stone tools or bone splinters suitable for piercing holes \nand granting them the ability to bind these with a simple stitch using some other organic \nmaterial (no great leap from the bindings inferred for hafted stone tools, see Anderson-\nGaufaud 1990), they should have had little problem in provisioning themselves with suitable \nattire to cover their bodies and regulate their core temperature.  The air-capture system \nworks best when fur is retained and worn next to the body, any additional outer layers being \nworn the other way round (Bujys 1997). In this case, scrapers were probably used to remove \nfat rather than fur, and red ochre, seen in at least a dozen Mousterian sites across Europe \n(Mellars 1996), may have been used as an abrasive powder, a desiccant\/preservative or a \npesticide (Osborn 2004).  Thermal protection for infants could have been simpler but \nperhaps even more vital, with major implications for survival and mortality rates. \n \nThe short distal limb proportions of Neanderthals acted to keep the temperature at the \nextremities close to that of the core, restricting tissue damage and maintaining sensitivity \n(Aiello and Wheeler 2003). Yet given the evidence for seasonally frozen ground it seems \nrather incredible that Neanderthals in Britain would have endured the whole year without any \nform of artificial foot protection.  On the other hand, Trinkaus’s (2005) recent study of \nNeanderthal foot bones found no evidence for rigid footwear capable of conferring \nmechanical separation between the foot and the ground.   However, he admits that this does \nnot eliminate the possibility of soft-soled footwear, such as strap-bound furs packed with \ninsulating fibres.   \n \nAiello and Wheeler hypothesise a very conservative 1 clo of insulation.  Most Pleistocene \nmammal furs would have greatly exceed this level (cf. Stenton 1991, 11), meaning that a \nclothed Neanderthal could have remained comfortable at temperatures far below those \noutlined above. Reindeer hides are particularly valued by modern arctic peoples because \nthey are lightweight and their fur has excellent insulatory properties (clo value = 7, Ibid).  The \nbest time to procure reindeer hides is in the late summer, prior to the development of the \nheavy winter pelage and after the skin had repaired the damage caused by any summer \nparasites (Ibid, 6), which adds another interpretative dimension to the late summer\/early \nautumn mass killing of reindeer at Salzgitter-Liebenstedt (Gaudzinski and Roebroeks 1999); \nespecially if Bocherens et al (2005) are correct in their assertion that northern Neanderthals \nate a lot of mammoth and rhino, but little reindeer (the reverse being true for hyaenas).  One \nwonders whether some species were targeted as much for their hides and sinews as for \ntheir meat value (see Burch 1998 for caribou), and whether the classic ‘scavenging’ pattern \nof heads and lower limbs found in Middle Palaeolithic sites is in fact a signature testifying to \n  7\nthe preferential transport of hides away from the kill sites (cf. Chase 1986; Mellars 1996).  \nIndeed, such patterns find obvious parallels in medieval tanneries (Serjeantson 1989; \nGidney 2000).  The broad association of scraper-rich Quina assemblages with colder \nenvironments and reindeer bones is highly suggestive in this regard (cf. Mellars 1996, 329; \nDibble and Rolland 1992). \n \nSo, if we are prepared to speculate just a little beyond the actual data and grant \nNeanderthals a few simple habits, then just keeping warm in OIS3 Britain may not have \nbeen among their greatest challenges.  These lay elsewhere.   \n \nShelter \nCave and rock-shelter sites are practically absent in south-east Britain and while more occur \nin the north and south-west, these do not appear to have been used as long term residential \nfoci.  The well-known occurrences in the Mendips, Creswell Crags and South Wales \ngenerally contain small lithic assemblages comprising a few handaxes, scrapers and cores, \nwith limited evidence of extensive knapping but suggestions of maintenance and reworking \nof transported artefacts (Coulson 1990; Proctor et al 1996; Jacobi 2006, 54).  They actually \nseem to reflect very short visitations, perhaps ‘field camps’ (Binford 1980) where mobile \nhunters stopped for a short time while travelling through, or perhaps places to which small \ntask groups armed with a minimal survival kit went for very specific purposes.  The elevation \nof some sites (e.g., Coygan, 83m OD, overlooking the Bristol Channel plain) implies that \nthey would have been good spots for hunters to scan the local landscape for game, but this \nis not true in all cases. Some of the finds may represent items that were cached for an \nanticipated return visit (White and Jacobi, 2002).   \n \nOver large parts of their known British distribution, then, Neanderthals would appear to have \nbeen forced ‘out of doors’, hopelessly exposed to the elements on the treeless mammoth \nsteppe.  They may have sought out other naturally sheltered areas afforded by the local \ntopography to site their ‘base-camps’ – and it is perhaps to these areas that we should direct \nour searches for more evidence of Middle Palaeolithic occupation (whatever and wherever \nthey may be: see Kolen 1999, 151, for possible examples from Normandy and Britanny).  \nBut even so we might expect them to have used some form of artificial shelter during \ndowntime.   \n \nThis raises the contentious issue of Neanderthal architecture, the evidence for which is \nlimited and equivocal (Klein 1999; Kolen 1999; Gamble 1986).  A number of recent \nevaluations have questioned the anthropogenic nature of many putative structures or \ninterpreted them as unintentional (re-)arrangements of natural and cultural debris: the \nfamous ‘huts’ at Arcy-sur-Cure and Molodova I\/4, for example, have been re-interpreted as \nperipheral ‘enrichments’ formed by Neanderthals shoving debris out of their personal space, \nhumanly constructed but not formally structured (Kolen 1999; Gamble 1986)4.  Discussions \nof Neanderthal architecture also tend to become embroiled in philosophical worries about \nthe social and cognitive meaning of ‘home’, ‘dwelling’, ‘nesting’ and different types of \ngeography (Binford 1987; Kolen 1999).  Such approaches are no doubt important, but all too \noften they transmute into an entrenched viewpoint whereby Neanderthals simply didn’t (or \ncouldn’t) construct artificial shelters and didn’t (or couldn’t) organise themselves from base \ncamps.  At best, some of the open-air ‘arrangements’ might be accepted as deliberate \nwindbreaks (e.g, Ripiceni-Izvor, Romania, Gamble 1986, 256) or, if containing an integral \nhearth, a combination windbreak and storage heater (e.g., Vilas Ruivas, Portugal, Kolen \n1999, 152, 156).  \n \nNow, from the narrow but frankly vital perspective of survival, it almost beggars belief that \n                                                \n4 Interestingly, Binford (1983) describes similarly enriched and depleted zones in areas where clearance had \ntaken place so that hides could be laid out for processing \n  8\nNeanderthals managed to survive on the cold and open treeless steppe without some form \nof artificial shelter, nowhere to take refuge from the wind, rain and snow or to dry-off once \nwet, whether semi-naked or fully clothed.  Wet clothes are particularly hazardous, potentially \nincreasing heat loss by a factor of 5 (Stenton 1991; Osborn 2004; Curtis 1995).  Is the \napparent absence of evidence really evidence that Neanderthals lacked the social set-up \nand technical know-how to build structures of any kind, even if the alternative might be \nhypothermia?  Without shelter how did Neanderthals get through the night? \n \nOne recent suggestion is that they spent their evenings huddled together to share body heat \n(?under wraps) (Aiello and Wheeler 2003).  This might be reasonable in caves but not in the \nopen, exposed to the weather.  The problem is not helped by the fact that in truth we don’t \nreally know what we are looking for (see also Pettitt 1997).  There are numerous \nethnographic examples of simple tents that could be constructed with few resources, often \njust skins draped and anchored around a couple of low uprights (Faegre 1978, Lee and \nReinhardt 2003; Osborn 2004). Internally these form well-insulated heat traps, with skin or \nvegetal bedding used to raise individuals off the ground and reduce heat loss through \nconduction.  Any patterns left behind would depend largely on the duration of use, the \nactivities conducted within and the temporality of residential moves (cf. Binford 1980). One \nfurther consideration is that in OIS3 Britain the construction of even the simplest of \nstructures would be hampered by the lack of wood resources on the open steppe, although \nother materials like bone could form a viable substitute.  But with both props and hides being \nprecious and heavy, these must have either been centrally-organised from a base camp or – \naccepting the oft-promoted extreme levels of mobility and lack of base-camps (e.g., Stringer \nand Gamble 1993, 168) - curated and frequently transported, an added burden possibly \nrequiring some form of travois.  If so, then we are possibly looking for such extremely \nephemeral structures that the chances of them leaving any recognisable archaeological \nfootprint are vanishingly small.  As soon as they were dismantled and the bedding shaken \noff, very little would be left in the way of any characteristic patterning.  \n \nFire \nFire is a well established part of the Neanderthal tool kit, forming not only a source of heat \nand a mode of drying, but also providing light, a deterrent against predators, and the means \nfor cooking (externalising part of the digestive process and making food ‘less expensive’; \nAiello and Wheeler 1995).  Examples of Neanderthal fire use are diverse, ranging from the \nlarge ash deposits spread out to warm the ground at Kebara, Israel (Bar-Yosef et al 1992), \nthe arranged hearths at Abric Romani, Spain with associated pseudomorphs interpreted as \noverhanging wooden tripods (Castro-Curel and Carbonell 1995), to the tiny single hearth lit \nto accompany an ibex dinner in Grotte de l‘Hortus (Lumley 1972, Pettitt 1997).  Unhindered \naccess to fire would certainly have helped Neanderthals survive in OIS3 Britain, perhaps \neven attenuating the seemingly pressing needs for artificial shelter and all its concomitants.   \n \nThe lack of wood once again becomes the big issue in Britain.  Without it, it is difficult to see \nhow the necessary fires could have been routinely lit and sustained.  Possible hearths have \nbeen recorded at Coygan Cave (Aldhouse-Green et al 1995, 47-48) and Hyaena Den \n(Tratman et al 1971, 249), while Dawkins (1877, 594) talks of charcoal and calcined bone at \nRobin Hoods Cave, but these reports remain rather anecdotal; their association with Middle \nPalaeolithic occupation is not entirely secure and it is unclear precisely what material was \nbeing burnt.  In the absence of wood, alternative resources could have been used -  dung, \ngrass and shrubs or even green bone -  but these come at a cost.  The problem with the \nlatter is that it requires large quantities of other combustible material to generate heat \nsufficient for it to ignite in the first place (Thery-Parisot and Meignen 2000; Villa 2002; \nHoffecker 2004; Osborn 2004).  There is also the lack of significant deposits of calcined \nbone to consider (some was admittedly found at Robin Hoods Cave; Jacobi 2006), although \nthis may relate to the failure to locate any real settlements.  Scrubby vegetation might \nprovide a better source, dwarf birch being particularly valuable as it is high in resin and burns \n  9\nwell at high temperatures when fresh (Owen 2002).  However, very large quantities must \nhave been collected to maintain a scrub fire or to ignite bone, both time and energy \nconsuming and probably unsustainable in a landscape shared with herds of heavy-weight \ngrazers.  Here too, then, there is an uneasy relationship between the environmental \nreconstructions and survival needs  \n \nFood, Furs and the Energetics of Foraging \nAt the 2003 workshop of the Leverhulme Trust’s Ancient Human Occupation of Britain \nProject (AHOB), several influential British workers refused to accept that the Neanderthals at \nLynford hunted the large herbivores found there, particularly the mammoths.  The key \nreasons for this were: \no the taphonomic evidence for periods of carcass exposure and weathering \no the absence of cut-marks \no the lack of dry-flesh eating beetles or carrion fly pupae \no the lack of wood to make hunting weapons   \n \nNow, the exposure of bones at Lynford does not eliminate an active role for Neanderthals, it \njust means that the site was a place where bodies accumulated over a period of time, and \ncutmarks are often missing from modern unweathered examples of elephant and other \nanimal butchery (Gaudzinski 1999a).  The evidence from the insects is curious from any \nangle: if, as the combination of dung beetles and carcasses suggest, animals were living and \ndying in this location, you would expect to find flesh-eaters whether Neanderthals were \ninvolved or not.  Rapid and comprehensive carnivore processing, cold conditions, and\/or \ndeath in the water might go some way to providing answers, but clearly these data are not \nstraightforward.   \n \nThese comments notwithstanding and despite all participants accepting that the isotopic and \nfaunal data shows Neanderthals elsewhere routinely hunted a range of large herbivores \nincluding elephants (Gaudzinski 1996, 1999a; Bocherens et al 2005), many maintained that \nwhen Neanderthals returned to Britain the lack of wood from which to construct weapons left \nthem no other choice but to adopt a scavenging strategy.  For me it is difficult to see how this \ncould feasibly have worked.  \n \nSorensen and Leonard (2001) have effectively shown that the frequently twinned concepts \nof: 1) Neanderthals as inefficient foragers, and; 2) the elevated energetic costs of living in \ncold conditions and leading the mobile, physically active lives implied by their skeletons \n(e.g., Ruff et al 1993, 1994, Trinkaus 1989) are mutually incompatible.  They estimated that \nthe average, mid-sexed Neanderthal’s energy expenditure was between 3000-5500 \nkcal\/day, requiring a return from foraging of 4400-6700 kcal\/day just to sustain themselves at \nminimal subsistence level.  We can infer from recent isotopic work (Bocherens 1999, 2001; \nRichards et al 2000) that the majority of this came from animal protein and fat - the latter \nbeing “one of the metabolic keys” to success in cold environments (Steegmann et al 2002, \n571).  Taking high-end calorific values for meat of 3000 kcal\/kg (Diem 1962), the required \nintake of the average adult Neanderthal would therefore have required them each to have \neaten ~1.85kg of fat-rich meat every day5.  Given whole carcasses, and assuming a 60% \nmeat return on live weights (Peter Rowley-Conwy, pers. comm. 2006), this means that a \ngroup of 10 Neanderthals would need to acquire a reindeer-sized animal every 3 days \n(average weight  ~120kg, Banfield 1961) or horse-sized animal every 6 days (average \nweight ~250kg, Bökönyi 1974), not accounting for losses due to incomplete processing, \ndecomposition and other scavengers.   \n \n                                                \n5 In more familiar terms, this equates to a 65oz hamburger each.  In reality the required values would have \nvaried enormously depending on the age, condition and species of the animals involved; deer is generally much \nlower (see Diem 1962). \n  10\nIf scavenging the kills of other carnivores with lower returns, more frequent access to \ncarcasses would be demanded.  Now, the Mammoth Steppe was certainly a relatively rich \nenvironment with an abundance of herbivores, and other carnivores such as lion were \npresent to provide fresh kills.  Yet, as Guthrie (1990) points out, as rich as it probably was, \nthe Mammoth Steppe is unlikely to have played host to the density of game seen on the \nAfrican or Asian Savannah.  Based on the lack of elaborate social ornamentation (i.e. \nmanes) in Upper Palaeolithic depictions of lion, Guthrie infers small prides, with males and \nfemales hunting together over very large territories, all of which points to fairly low prey \ndensity.  It needs to be asked, then, whether scavenging would have even been a viable \noption in OIS3 Britain and whether the elevated metabolic costs of simply being there could \nhave been met via this strategy.  Remember too that Neanderthals were not the only \npotential scavenger in the guild, with significant competition undoubtedly coming from very \nsizable hyena populations which left dense accumulations of bones and probably excluded \nhumans from the rare cave sites during certain periods (A. Currant pers. comm. September \n2005).  Frozen carcasses may have been a readily available resource in winter (Gamble \n1987), but this raises the problem of defrosting, and hence attaining large quantities of fuel, \nin an environment with no wood and at a time of year when already heavily grazed plant \nresources were at a minimum.  During the spring thaw naturally defrosting carcasses would \nquickly putrefy; during the modern arctic thaw, carcasses are deep in fly pupae within days \n(Guthrie 1990).  \n \nAnother consideration is that hyper-carnivory and limited dietary breath might have caused \nnutritional deficiencies, meaning that as well as facing additional costs for all the reasons \noutlined above Neanderthals quite probably went through periods of poor condition and \nsusceptibility to disease, amplifying the problems of simply surviving at all (Hockett and \nHaws 2005, Trinkaus 1995; Pettitt 2000).  Consuming the stomach contents of ruminants to \naccess essential vitamins and minerals is one well-touted solution to this problem, and Owen \n(2002) has shown that a surprisingly large number of vegetal resources are available and \nindeed exploited by modern Alaskan hunters (including the leaves and stems of dwarf willow \nwhich have added medicinal properties), but these again require either early access to \ncarcasses or are highly seasonal.   \n \nFinally, if suggestions that the OIS3 survival package included skin clothing, bedding and \nperhaps even rudimentary shelters are taken seriously, then Neanderthals would have \nrequired access to good conditioned pelts, not the ravaged cast-offs from lion and hyaena \nkills.  Failure to acquire sufficient skins could quickly affect an individual’s health, mobility \nand, consequently, ability to obtain food and reproduce successfully (Stenton 1991).   This \nprovides yet another reason to suspect proactive hunting as the main mode of carcass \nacquisition.   But, to labour the point, without wood from which to fashion weapons could \nthey actually manage it? \n \nCan’t see the trees; can’t see the wood  \nOwen (2002) states that in wood-poor regions, modern hunter-gatherers are prepared to \ntravel long distances to collect resources, especially for the production of ‘long’ implements.  \nTo reach the nearest stands of wood, Neanderthals might have had to go well beyond the \ndistances over which they routinely moved stone resources (e.g. Féblot-Augustins 1999). \nBut, the well-known emphasis on using local resources where abundant should not be \nconfused with an inability to procure and transport all or any resources over much longer \ndistances as and when necessary, nor with limited planning depth (cf. Roebroeks et al 1992; \nRoebroeks 2001; Speth 2004).  Neanderthals might have collected driftwood brought down \nby the major European drainage systems into rivers that flowed through the now submerged \nlowland basins around the south and east coast, or from the seashores on the west coast.  \nWe must also seriously consider whether some areas of Britain, such as Creswell Crags or \nthe south slopes of the Mendips, acted as cryptic refugia where stands of trees survived (cf. \nStewart and Lister 2001). Indeed, Jacobi (2006, 52) has inferred that the notched artefacts \n  11\nfrom Robin Hoods Cave show woodworking was taking place in the Creswell Caves. This \ncould perhaps explain the type of short-term usage inferred for these and similar sites, which \nmay represent places to which people went primarily to gather wooden resources for \nweapons.   \n \nIt is equally conceivable that the currently favoured environmental proxies and consequent \nreconstructions might be leading us astray (e.g. Kenward 2006) and that we need to look \nmore critically using a unified multidisciplinary perspective.  Take the example of Wretton, an \nearly Devensian sequence (OIS5d-4) where the beetles show open grassland throughout, \nbut the pollen shows at least two woodland phases (West et al 1974).  Clearly we should not \nrely on very localised indicators alone to provide landscape pictures.  Another hint that trees \nmay have been present in situations where other proxies suggest open environments is \nfound at Cassington, where a channel incised into the top of gravel attributed to OIS4 \nproduced plant macrofossils and pollen that included tree birch and sporadic oak, alder and \nhazel, and was argued to represent trapped flood debris  (Maddy et al 1998).  One thing is \nclear, we will not progress very far if all pollen is written off as far travelled, and fragmentary \nwood charcoal is rejected as evidence for trees (Huntley and Allen 2003).   \n \nWithout wood, short weapons could have been manufactured from bone, something similar \nperhaps to the mammoth rib points described from Salzgitter-Leibenstedt (Gaudzinski \n1999b).  As hunting in the open often precludes more stealthy styles of attack (Guthrie 1990) \ndriving into natural traps and ambushing was one of the favoured Neanderthal tactics (e.g., \nas at Lynford and other European ‘multiple death’ sites, cf. Mellars 1996; Gaudzinski 1996).  \nShorter weapons could easily have serviced the close-quarter engagement this would have \nentailed.   Nothing similar is yet known from Britain, but an enigmatic sandstone block from \nLynford, similar to later prehistoric shaft-straighteners, shows an anthropogenic u-shaped \ngroove that could have been used to manufacture some form of thin projectile of bone or \nantler (pers. obs; d’Errico and Debreuil in press).  One of the horse bones from this site also \nshows a puncture wound quite conceivably produced by such a weapon (Schreve in press).  \nDepending on their length, though, such points might still have required a shaft, implying the \ntype of composite technologies long denied the Neanderthals but the acceptance of which is \nnow becoming almost unavoidable (e.g. Koller et al 2001; Anderson-Gerfaud 1990; Shea et \nal 2001; Mazza et al 2006)6.  Wood is again the ‘normal’ connective tissue in hunter-gatherer \ntechnology, but in wood-scarce settings a number of other raw materials might be expected \n(Osborn 2004).  We should note however that the anthropogenic origin of most claimed bone \npoints from early Palaeolithic sites has been strongly questioned (d’Errico and Villa 2001), \nwhile the ineffective use of ossiferous resources by Neanderthals is often cited as one of the \nkey differences between them and modern humans.  More recent claims may give us cause \nto reconsider the situation (e.g: Balver Höhle, Germany, Kindler 2005).  \n \nSeasons in the Sun \nMiserable conditions and a desperate lack of resources make OIS3 Britain an unlikely \nholiday destination, but those wishing to deny Neanderthals any or all of the above \ncapabilities have only one real route out of the developing paradox:  Neanderthals were \nsummer visitors only, moving into Britain for short periods and bringing the necessary \nequipment from elsewhere in their annual range.  Furthermore, these visits may have been \nlimited to only a few of the warmer oscillations of OIS3.  \n \nIn this account Neanderthals migrated north and west during the summer from winter \nretreats in the lowland basins or adjacent areas of Europe, following reindeer, mammoth etc \nonto the upland plain of Western Doggerland: for Neanderthals a well-stocked summer \n                                                \n6 If the early Upper Palaeolithic leaf-points seen at sites such as Beedings (Jacobi 1986, 1999) are also \nNeanderthal products, then these potentially provide further evidence of hafted technologies in Britain during \nOIS3.   \n  12\nfeeding ground.  As Guthrie (1990, 277) explains, at its most hostile extremes the mammoth \nsteppe would have made it an excellent place to hunt, but a poor place to live.  Externally \nprovisioned summer occupation might still have been challenging, but the demands would \nhave been greatly attenuated and perhaps required none of the ‘invisible’ cultural solutions \nhypothesised above.  As a package, however, such an operation would require a high \ndegree of long-term logistical planning; enhanced levels of co-operation; possible task \ndivisions; finely tuned knowledge of the landscape and prey behaviour; and final-dispatch \nweapons - a list of traits that includes much often deemed missing from the Neanderthal \nrepertoire (cf. Roebroeks 2001; Speth 2004). \n \nThis might nevertheless seem like an attractive solution, but does it actually work?  While \nthere are undoubted cultural links – OIS3 sites in both Britain and France seem to belong to \nthe MTA and bifaces are present in a number of other facies across Northern Europe – there \nare significant typological differences between the handaxes seen in Britain and the \ncontinent.  In Britain the bout coupé handaxe has been singled out as an almost unique \nregional variant (Roe 1981, Tyldesley 1987; White and Jacobi 2002;).  Conversely, other \ntypes - the exaggerated triangular form of NW France and the assorted ‘Micoquian’ variants \n- are largely absent from Britain.  Chronology may explain the typological absences from \nBritain, certain forms being used in Europe during periods when Britain was not visited, but \nthis cannot account for the absence of bout coupés in Europe, leaving the typological data \napparently contradicting the notion of a contiguous seasonal home-range. \n \nIt is of course possible that the uniqueness of the bout coupé handaxe is a fallacy, a mere \nartefact of classification (Coulson 1986), and that many examples sit unrecognised in French \nmuseums.  Recent broad surveys suggest that this is not the case (Soressi 2002); there are \na few possible examples in the Paris Basin 7 (Tyldesley 1987) but their overall occurrence \nand frequency is extremely low compared to the British situation.  It is also possible that the \nbout coupé was used exclusively in summer by peripheral task-groups – as Hopkinson \n(2004) has argued for the Altmühlian leaf-point -  although it is hard to imagine why this \nwould be the case for such a multi-purpose versatile object whose edges supported a \nnumber of different functions (cf. Soressi and Hays 2003).  Another possibility is that the \nterritory of the Neanderthals for whom Britain formed a summer hunting ground did not \nextend onto the southern and eastern ‘uplands’ of continental Europe, but remained fixed in \nthe now submerged Channel and North Sea Basins, bounded by the major rivers that once \nflowed west and north.  This certainly fits a number of known distance parameters, including \nthe 300km seasonal movements inferred from raw material transfers in central Europe and \nthe total area traversed by modern cold adapted hunter-gatherers over the course of several \ndecades (Gamble 1993; Binford 1983). Both further match onto the distribution of Middle \nPalaeolithic sites in mainland Britain.  However, it is still uncertain whether a sufficient \necological gradient existed between ‘upland’ Britain and the adjacent lowland plains to make \nwinter survival there any easier (see Barron et al 2003).   \n \nClosing Comments:  \nAfter more than a century of living in the shadow of the undeniably richer continental record, \nthe British Middle Palaeolithic is finally developing its own character.  New sites, re-\nevaluations of existing evidence and a host of wider Quaternary studies are at last helping to \nunravel the timing and nature of Neanderthal settlement on this northwestern-most fringe of \nthe Neanderthal world.  As this emerging personality is revealed, however, it is showing itself \nto be rather schizophrenic.  \n \nLooked at in terms of observed hunter-gatherer environmental and social frameworks \n                                                \n7 Likewise there are possible pre-Devensian examples in the UK, a case of inevitable convergence in form \n(White and Jacobi 2002).  Doubt also exists over the OIS3 context of some French material cited by Tyldesley, \ncf. Cliquet et al (2001) for Saint-Saens \n  13\n(Woodburn 1982; Binford 1980; Dale et al 2004), reconstructions of Neanderthal life in this \npart of Pleistocene Europe present some unique combinations.  They lived in (very) cool-\ntemperate, high-latitude environments, apparently formed small highly mobile groups \n(residentially and daily), and experienced conditions of extreme key-resource stress.  \nPhysically buffered to only a moderate degree, they are nonetheless widely believed to have \npracticed an immediate return system, used inferior and poorly organised technologies and \nresidential logistics, and failed to effectively exploit major components of their known \nresource base as a raw material (i.e. bone).  To some they were ineffective hunters, in \nBritain possibly obligate scavengers with no access even to hunting weapons.  In similar \ncircumstances and apparently with no great physiological disadvantage, Upper Palaeolithic \nhunters would be seen as being reliant on delayed return systems with socially organised \nstorage and a whole host of complex tools and facilities of different materials (Hoffecker \n2004).  Granted, parts of the Upper Palaeolithic record provide better and more direct \nevidence for such things, but even so double standards can be detected (Roebroeks and \nCorbey 2000). \n \nWhat I hope I have shown is that something, somewhere is not quite right.  The arguments \ngo round and round without any really satisfactory resolution, and while I have offered some \nsuggestions about survival in OIS3 Britain these are both imperfect and speculative.  Most \nare founded on physiological and environmental premises, but require us to make logical \ndeductions– or leaps of faith if you prefer – that go beyond the comfort of solid evidence and \nthere is no current possibility of satisfying the inevitable cries of habeas corpus.  The deeper \nPalaeolithic record is silent on many fronts.  Freaks of preservation such as the Middle \nPalaeolithic birch-bark pitch at Königsaue with its requisite technical know-how and \napparatus (Koller et al 2001), the pseudomorphs of wooden hearth furniture at Abric Romani \n(Castro-Curel and Carbonell 1995), and the mighty Lower Palaeolithic spears from \nSchoningen (Thieme 1997), provide precious direct evidence as to the true complexity of the \nNeanderthal and earlier hominin cultural repertoire.  Yet, these are really nothing that we \ncould not otherwise have inferred from the demands of hafting, heating and hunting, had the \nscepticism inherent in the dominant paradigms of the past 30 years left more of us receptive \nto such ideas.   \n \nThe challenge ahead is not to sit and wait for more amazing discoveries that will help fine-\ntune what we think we already know or provide us with new hard-evidence to satisfy the \nsceptics.   We must be prepared to re-assess the cogency of our environmental panoramas, \ntake yet another look at physical tolerances and reconsider the Neanderthal ‘settlement’ of \nOIS3 Britain.  We must also look to populate the Neanderthal world with people equipped \nwith knowledge, skills and material culture sophisticated enough to feasibly survive in it, \nwhatever form these need take.  Otherwise, they were already dead.   \n  14\nAcknowledgements \nI would like to thank Peter Rowley-Conwy, David Keen, Nick Ashton, Danielle Schreve, Terry \nHopkinson, Beccy Scott, Paul Pettitt and Chris Stringer for valuable comments on earlier \ndrafts of this paper and for helping me avoid some of the larger elephant traps.  The work on \nthis paper was done under the auspices of the Ancient Human Occupation of  Britain \nProject, funded by the Leverhulme Trust and I would like to thank them and my co-\ninvestigators on the project for the most stimulating research atmosphere that this project \nhas provided.  I dedicate this paper to two recently departed friends and colleagues: John \nWymer and David Keen.  \n \n  15\nBibliography \nAiello, L. C., and Wheeler, P. 1995. The expensive tissue hypothesis: the brain and the \ndigestive system in human and primate evolution. Current Anthropology, 36, 199-221. \n \nAiello, L. C. and Wheeler, P. 2003.  Neanderthal Thermoregulation and the Glacial Climate.  \nIn Neanderthals and Modern Humans in the European Landscape During the Last \nGlaciation: Archaeological Results of the Stage 3 Project. (eds  T. Van Andel and W. Davies. \nCambridge: McDonald Institute, pp. 147-166 \n \nAldhouse-Green, S., Scott, K., Schwarcz, H., Grün, R., Housley, R., Rae, A., Bevins, R. and \nRednap, M. 1995. Coygan Cave, Laugharne, South Wales, a Mousterian site and hyaena \nden: a report on the University of Cambridge excavations. Proceedings of the Prehistoric \nSociety, 61, 37-79. \n \nAnderson-Gerfaud, P. 1990. Aspects of behaviour in the Middle Palaeolithic: functional \nanalysis of stones tools from Southwest France. In The Emergenceof Modern Humans: An \nArchaeological Perspective. (ed. P. Mellars)  Edinburgh: Edinburgh University Press, pp. \n389-418. \n \nAntoine, P., Coutard, J.-P., Gibbard, P. L., Hallegouet, B., Lautridou, J.-P. and Ozouf, J.-C. \n2003. The Pleistocene Rivers of the English Channel Region. Journal of Quaternary \nScience, 18, 227-243. \n \nApSimon, A. M. 1986. Picken's hole, Compton Bishop, Somerset: Early Devensian bear and \nwolf den, and Middle Devensian Hyaena Den and Palaeolithic site. In  The Palaeolithic of \nBritain and its Nearest Neighbours: Recent Trends. (ed. S. N. Colcutt) Sheffield: University \nof Sheffield, pp. 55-56.. \n \nArmstrong, A. L. 1925. Excavations at Mother Grundy's Parlour, Creswell Crags, Derbyshire, \n1924. Journal of the Royal Anthropological Institute, 55, 146-178. \n \nArnold, N. S., Van Andel, T. H. and Valen, V. 2002. Extent and Dynamics of the \nScandinavian Ice Sheet during Oxygen Isotope Stage 3 (65,000-25,000 yr B.P.). Quaternary \nResearch, 57, 38-48.  \n \nAshton, N. and Lewis, S. 2002. Deserted Britain: Declining Populations in the British Late \nMiddle Pleistocene. Antiquity, 76, 388-396.  \n \nAshton, N. M. 2002. The absence of humans from Last Interglacial Britain.  In Le Dernier \nInterglaciaire et les occupations humaines du Paléolithique. (ed. W. Roebroeks and A. \nTuffreau.  . Lille: Centre d'Etudes et Recherches Prehistorique,  pp. 93-103.  \n \nBanfield, A. W. F. 1961. A Revision of the Reindeer and Caribou, Genus Rangifer. Ottawa: \nDepartment of Northern Affairs and National Resources (National Museum of Canada, \nBulletin 177). \n \nBarron, E., Van Andel, T. and Pollard, D. 2003. Glacial Environments II: Reconstructing the \nClimate of Europe in the Last Glaciation. In Neanderthals and Modern Humans in the \nEuropean Landscape During the Last Glaciation: Archaeological Results of the Stage 3 \nProject.  (eds. T. Van Andel and W. Davies). Cambridge: McDonald Institute, pp. 57-78. \n \nBar-Yosef, O., Vandermeersch, B., Arensburg, B., Belfer-Cohen, A., Goldberg, P., Laville, \nH., Meignen, L., Rak, Y., Speth, J. D., Tchernov, E., Tillier, A. M. and Weiner, S. 1992. The \nexcavations in Kebara Cave, Mt. Carmel. Current Anthropology, 33, 497-550. \n \n  16\nBinford, L. R. 1983. In Pursuit of the Past. London: Thames and Hudson. \n \nBinford, L. R. 1980. Willow smoke and dogs' tails: hunter-gatherer settlement systems and \narchaeological site formation. American Antiquity, 45, 4-20. \n \nBinford, L. R. 1985. Human ancestors: changing views of their behavior. Journal of \nAnthropological Archaeology, 4, 292-327. \n \nBinford, L. R. 1987. Searching for camps and missing the evidence? In The Pleistocene Old \nWorld. (ed.  O. Soffer)  London: Plenum Press, pp. 17-31. \n \nBocherens, H., Billiou, D., Mariotti, M., Toussaint, M., Patou-Mathis, M. Bonjean, D. and \nOtte, M. 1999. Palaeoenvironment and palaeodietary implications of isotopic biochemistry of \nlast interglacial Neanderthal and mammal bones in Scladina cave (Belgium). Journal of \nArchaeological Science, 26, 599-607. \n \nBocherens, H., Billiou, D., Mariotti, M., Toussaint, M., Patou-Mathis, M., Bonjean, D. and \nOtte, M. 2001. New isotopic evidence for dietary habits of Neanderthals from Belgium. \nJournal of Human Evolution, 40, 497-505. \n \nBoismier, W., Schreve, D. C., White, M. J., Robertson, D. A., Stuart, A. J., Etienne, S., \nAndrews, J., Coope., G. R., Field, M., Green, F. M. L., Keen, D. H., Lewis, S. G., French, C. \nA., Rhodes, E., Schwenninger, J.-L., Tovey, K. and O’Connor, S. 2003. A Middle Palaeolithic \nsite at Lynford Quarry, Mundford, Norfolk: Interim statement. Proceedings of the Prehistoric \nSociety, 69, 315-324. \n \nBökönyi, S. 1974. The Przevalsky Horse. London: Souvenir Press.   \n \nBuijs, C. 1997. Ecology and principle of arctic clothing.  In Braving the Cold: Continuity and \nChange in Arctic Clothing. (ed. C. Buijs and J. Oosten) Leiden: CNWS, pp. 11-33. \n \nBurch, E.S. 1998. The Inupiaq Eskimo Nations of Northwest Alaska. Fairbanks: University of \nAlaska Press. \n \nCastro-Curel and Carbonell, E. 1995.  Wood pseudomorphs from level I at Abric Romani, \nBarcelona, Spain.  Journal of Field Archaeology, 22, 376-84 \n \nChase, P. G. 1986. The Hunters of Combe Grenal: Approaches to Middle Palaeolithic \nSubsistence. Oxford: British Archaeological Reports International Series 286. \n \nColes, B. 1998. Doggerland: a speculative survey. Proceedings of the Prehistoric Society, \n64, 45-82. \n \nCoope, G. R. 2002. Changes in the thermal climate in Northwestern Europe during Marine \nOxygen Isotope Stage 3, estimated from fossil insect assemblages. Quaternary Research, \n57, 401-408. \n \nCoope, G.R. 2003.  Paper presented to Ancient Human Occupation of Britain Workshop, 16-\n17 September 2003, Bedford Square, London. \nhttp:\/\/www.nhm.ac.uk\/hosted_sites\/ahob\/Abstracts%202003%20Workshop.pdf \n \nCoope, G. R., Gibbard, P. L., Hall, A. R., Preece, R. C., Robinson, J. E. and Sutcliffe, A. J. \n1997. Climatic and environmental reconstructions based on fossil assemblages from Middle \nDevensian (Weichselian) deposits of the River Thames at South Kensington, Central \nLondon, UK. Quaternary Science Reviews  ,16, 1163-1195. \n  17\n \nCoulson, S. 1986. The bout  coupé  handaxe as a typological mistake.  In The Palaeolithic of \nBritain and its Nearest Neighbours: Recent Studies. (ed S. N. Collcutt)  Sheffield: University \nof Sheffield, pp. 54-56. \n \nCoulson, S. D. 1990. Middle Palaeolithic Industries of Great Britain. Studies in Modern \nArchaeology Vol 4. Bonn: Holos. \n \nCurrant, A. and Jacobi, R. M. 1997. Vertebrate faunas of the British Late Pleistocene and the \nchronology of human settlement. Quaternary Newsletter, 82, 1-8. \n \nCurrant, A. and Jacobi, R. 2001. A formal mammalian biostratigraphy of the Late Pleistocene \nin Britain. Quaternary Science Reviews, 20, 1707-1716. \n \nCurrant, A. and Jacobi, R. 2002. Human presence and absence in Britain during the early \npart of the Late Pleistocene. In Le Dernier Interglaciaire et les Occupations Humaines du \nPaléolithique (ed. W. Roebroeks and A. Tuffreau)  Lille: Centre d'Etudes et Recherches \nPrehistorique,  pp. 105-113. \n \nCurrant, A., and Jacobi, R. 2004. A Middle Devensian mammalian assemblage from the \nHyaena Den, Wookey Hole, Somerset. In The Quaternary Mammals of Southern & Eastern \nEngland. (ed.  D. C. Schreve). London: QRA, pp. 87-92. \n \nCurtis, R. 1995. Outdoor Action Guide to Hypothermia and Cold Weather Injuries \nhttp:\/\/www.princeton.edu\/~oa\/safety\/hypocold.shtml \n \nDale, D., Marshall, F. and Pilgram, T. 2004. Delayed-return Hunter-Gatherers in Africa?  \nHistoric perspectives from the Okiek and Archaeological perspectives from the Kansyore.  In \nHunters and Gatherers in Theory and Archaeology. (ed.  G. M. Crowthers) Carbondale: \nSouthern Illinois University Occasional Paper No. 31, pp. 340-375.  \n \nDansgaard, W., Johnsen, S. J., Clausen, H. B., Dahl-Jensen, D., Gundestrup, N. S., \nHammer, C. U., Hvidberg, C. S., Steffensen, J. P., Sveinbjornsdottir, H., Jouzel, J. and \nBond, G. 1993. Evidence for general instability of past climate from a 250-kyr ice-core. \nNature, 364, 218-20. \n \nDavies, W. and Gallop, P. 2003. The human presence in Europe during the Last Glacial \nperiod II: climatic tolerance and climatic preference of Mid- and Late Glacial hominids.  In \nNeanderthals and Modern Humans in the European Landscape During the Last Glaciation: \nArchaeological Results of the Stage 3 Project. (eds.  T. Van Andel and W. Davies). \nCambridge: McDonald Institute, pp. 131-146. \n \nDawkins, W. B. 1877. On the mammal fauna of the caves of Creswell Crags. Quarterly \nJournal of the Geological Society of London, 33, 389-612. \n \nDeim, K (ed.). 1962. Documenta Geigy Scientific Tables.  Manchester: Geigy \n \nDelair, J. B. and Shackley, M. L. 1978. The Fisherton Brickpits: their stratigraphy and fossil \ncontents. Wiltshire Natural History Society Magazine, 73, 3-19. \n \nDibble, H. L. and Rolland, N. 1992. On assemblage variability in the Middle Palaeolithic of \nWestern Europe: history, perspectives, and a new synthesis.  In The Middle Paleolithic: \nAdaptation, Behavior, and Variability. (eds. H.L. Dibble  and P. Mellars). Philadelphia: \nUniversity of Pennsylvania University Museum Monograph 72 , pp. 1-28 \n \n  18\nFaegre, T. 1979. Tents : Architecture of the Nomads. New York: Anchor Press. \n \nFéblot-Augustins, J. 1999. Raw material transport patterns and settlement systems in the \nEuropean Lower and Middle Palaeolithic: continuity, change and variability. In The Middle \nPalaeolithic Occupation of Europe. (eds. W. Roebroeks and C. Gamble).  Leiden: University \nof Leiden,  pp. 193 - 214. \n \nGamble, C. S. 1986. The Palaeolithic Settlement of Europe. Cambridge: Cambridge \nUniversity Press. \n \nGamble, C. 1987. Man the Shoveller. In The Pleistocene Old World. (ed. O. Soffer). London: \nPlenum Press, pp. 82-96.  \n \nGamble, C. 1992.  Comment on Roebroeks, W., Conard, N.J. and Van Kolfschoten, T.  \n“Dense Forests, Cold Steppes, and the Palaeolithic Settlement of Northern Europe”. Current \nAnthropology, 33, 551-586. \n \nGamble, C. S. 1995. The earliest occupation of Europe: the environmental background. In \nThe Earliest Occupation of Europe. (eds W. Roebroeks and T. Van Kolfschoten.  Leiden: \nUniversity of Leiden, pp. 279-295. \n \nGamble, C. 1999. The Palaeolithic Societies of Europe. Cambridge: Cambridge University \nPress. \n \nGamble, C. and Steele, J. 1999. Hominid ranging patterns and dietary strategies. In Hominid \nEvolution; Lifestyles and Survival Strategies. (ed. H. Ullrich). Edition Archaea. pp. 346-409 \n \nGamble, C., Davies, W., Pettitt, P. and Richards, M. 2004. Climate change and evolving \nhuman diversity in Europe during the last glacial. Philosophical Transactions of the Royal \nSociety of London, B359, 243-254. \n \nGao, C., Keen, D.H., Boreham, S., Coope, G.R., Pettit, M.E., Stuart, A.J. and Gibbard, P.L. \n2000. Last interglacial and Devensian deposits of the River Great Ouse at Woolpack Farm, \nFenstanton, Cambridgeshire, UK. Quaternary Science Reviews, 19, 787-810. \n \nGaudzinski, S. 1996. On bovid assemblages and their consequences for the knowledge of \nsubsistence patterns in the Middle Palaeolithic. Proceedings of the Prehistoric Society,62, \n19-39. \n \nGaudzinski., S. 1999a. The faunal record of the Lower and Middle Palaeolithic of Europe: \nremarks on human interference. In The Middle Palaeolithic Occupation of Europe. (ed.  W. \nRoebroeks and C. Gamble) Leiden: University of Leiden, pp. 215 - 233.  \n \nGaudzinski, S. 1999b. Middle Palaeolithic bone tools from the open-air site Salzgitter-\nLebenstedt (Germany). Journal of Archaeological Science 26:125-41. \n \nGidney, L. 2000. Economic trends, craft specialisation and social status: bone assemblages \nfrom Leicester. In Animal Bones, Human Societies. (ed. P. Rowley-Conwy). Oxford: Oxbow \nBooks, pp 170-178.. \n \nGreen, C. P., Keen, D.H., McGregor, D.F., Robinson, J.E. and Williams, R.B.W. 1983. \nStratigraphy and environmental significance of Pleistocene deposits at Fisherton, near \nSalisbury, Wiltshire. Proceedings of the Geologist's Association, 94, 17-22. \n \nGuthrie, R. D. 1990. Frozen Fauna of the Mammoth Steppe. Chicago: Chicago University \n  19\nPress. \n \nHarrison, R. A. 1977. The Uphill Quarry Caves, Weston-Super-Mare, A Reappraisal. \nProceedings of the University of Bristol Spelaeological Society, 14, 233-254. \n \nHayden, B. 1993. The cultural capacities of Neanderthals: a review and re-evaluation. \nJournal of Human Evolution, 24, 113-146. \n \nHedges, R. E. M., Pettitt, P. B., Bronk Ramsey, C. and Van Klinken, G. J. 1996. \nRadiocarbon dates from the Oxford AMS system: Archaeometry Datelist 22. Archaeometry, \n38, 391-415. \n \nHockett, B. and Haws, J. A. 2005. Nutritional ecology and human demography of \nNeanderthal extinction. Quaternary International, 137, 21-34. \n \nHoffecker, J. F. 2004. The Eastern Gravettian \"Kostenki Culture\" as an Arctic Adaptation. \nAnthropological Papers of the University of Alaska, NS 2, 115-136. \n \nHopkinson, T. 2004. Leaf points, landscapes and environment change in the European Late \nMiddle Palaeolithic. In, Settlement Dynamics of the Middle Paleolithic and Middle Stone Age \nVol II. (ed N. Conard),. Tübingen: Kerns Verlag. pp. 227-258 \n \nHousley, R., Gamble, C., Street, M. and Pettitt, P. B. 1997. Radiocarbon evidence for the \nLateglacial human recolonisation of Northern Europe. Proceedings of the Prehistoric \nSociety, 63, 25-54. \n \nHuntley, B. and Allen, P. 2003. Glacial Climates III: Palaeo-vegetation patterns in Late \nGlacial Europe. In Neanderthals and Modern Humans in the European Landscape During \nthe Last Glaciation: Archaeological Results of the Stage 3 project. (eds T. Van Andel and W. \nDavies).  Cambridge: McDonald Institute,  pp. 79-102.. \n \nJacobi, R. 1986. The contents of Dr. Harley's Showcase. In  The Palaeolithic of Britain and \nits Nearest Neighbours: Recent Studies. (ed. S. N. Collcutt). Sheffield: University of \nSheffield, pp. 62-68. \n \nJacobi, R. 1999. Some observations on the British Earlier Upper Palaeolithic.  In Dorothy \nGarrod and the Progress of the Palaeolithic: Studies in the Prehistoric Archaeology of the \nNear East and Europe. (eds W. Davies and R. Charles).  Oxford: Oxbow Books, pp. 35-40. \n \nJacobi, R. 2006 (for 2004). Some observations on the non-flint lithics from Creswell Crags. \nLithics 25, 39-64. \n \nJacobi, R. M., and Hawkes, C. J. 1993. Work at the Hyaena Den, Wookey Hole. \nProceedings of the University of Bristol Spelaeological Society,19, 369-71. \n \nJacobi, R. and Grun, R. 2003. ESR dates from Robin Hood Cave, Creswell Crags, \nDerbyshire and the age of its early human occupation. Quaternary Newsletter, 100, 1-12.  \n \nJacobi, R. M., Rowe, P.J., Gilmour, M.A., Grun, R. and Atkinson, T.C. 1998. Radiometric \ndating of the Middle Palaeolithic tool industry and associated fauna of Pin Hole Cave, \nCreswell Crags, England. Journal of Quaternary Science,13, 29-42. \n \nJenkinson, R. D. S. 1984. Creswell Crags.  Late Pleistocene Sites in the East Midlands. \nOxford: British Archaeological Reports, British Series 122. \n \n  20\nJones, R. L. and Keen, D. 1993. Pleistocene Environments in the British Isles. London: \nChapman and Hall. \n \nKenward, H. 2006. The visibility of past trees and woodland: testing the value of insect \nremains. Journal of Archaeological Science 33:1368-1380. \n \nKindler, L. 2005. Eine Höhle ihre Gäste. Archäologie in Deutschland, 2, 26-27  \n \nKlein, R. 1999. The Human Career: Human Biological and Cultural Origins. Chicago:Chicago \nUniversity Press. \n \nKolen, J. 1999. Hominids without homes: on the nature of Middle Palaeolithic settlement in \nEurope. In The Middle Palaeolithic Occupation of Europe. (eds W. Roebroeks and C. \nGamble). Leiden: University of Leiden Press, pp. 139-175. \n \nKoller, J., Baumer, U. and Mania, D. 2001. High-tech in the Middle Palaeolithic: Neanderthal-\nmanufactured pitch identified. European Journal of Archaeology, 4, 385-397. \n \nLawson, A. J. 1978. A hand-axe from Little Cressingham. East Anglian Archaeology, 8, 1-8. \n \nLee, M., and Reinhardt, G. A. 2003. Eskimo Architecture:  Dwelling and Structure in the \nEarly Historic Period. Fairbanks: University of Alaska Press. \n \nLewis, S. 2003. Paper presented at the Ancient Human Occupation of Britain Workshop, 16-\n17 September 2003, Bedford Square, London. \n(http:\/\/www.nhm.ac.uk\/hosted_sites\/ahob\/Abstracts%202003%20Workshop.pdf) \n \nLumley, M.-A. d. 1972. Le Néanderthaliens de la grotte de L'Hortus. In La Grotte de l'Hortus. \n(ed. H. de Lumley). Marsailles: Université de Provence, pp. 375-385. \n \nMaddy, D., Lewis, S. G., Scaife, R. G., Bowen, D. Q., Coope, G. R., Green, C. P., Hardaker, \nT., Keen, D. H., Rees-Jones, J., Parfitt, S. and Scott, K. 1998. The Upper Pleistocene \ndeposits at Cassington, near Oxford, England. Journal of Quaternary Science,13, 205-231. \n \nMazza, P. P. A., Martini, F., Sala, B., Magi, M., Colombini, M. P., Giachi, G., Landucci, F., \nLemorini, C., Modugno, F., and Ribechini, E. 2006. A new Palaeolithic discovery: tar-hafted \nstone tools in a European Mid-Pleistocene bone-bearing bed. Journal of Archaeological \nScience 33,1310-1318. \n \nMcNabb, J. 2001. An archaeological resource assessment and research agenda for the \nPalaeolithic of the East Midlands (part of Western Doggerland). East Midlands \nArchaeological Research Frameworks  \n \nMellars, P. 1996. The Neanderthal Legacy. Princeton: Princeton University Press. \n \nOsborn, A. J. 2004. Adaptive responses to cold stress on the periglacial Northern Great \nPlains. In  Hunters and Gatherers in Theory and Archaeology. (ed. G. M. Crothers). \nCarbondale: Southern Illinois University Occasional Paper No. 31, pp. 10-47. \n \nOwen, L. R. 2002. Reed tents and straw baskets? Plant resources during the Magdalenian \nof Southwest Germany. In Hunter-Gatherer Archaeobotany: Perspectives from the Northern \nTemperate Zone. (eds S. L. R. Mason and J. G. Hather). London: Institute of Archaeology, \npp. 156-172. \n \nPaterson, T. T., and Tebbutt, C. F. 1947. Studies in the Palaeolithic succession  in England \n  21\nNo. III. palaeoliths from St. Neots, Huntingdonshire. Proceedings of the Prehistoric Society, \n13, 37-46. \n \nPettitt, P. B. 1997. High Resolution Neanderthals? Interpreting Middle Palaeolithic Intrasite \nSpatial Data. World Archaeology, 29,208-224. \n \nPettitt, P. B. 2000. Neanderthal lifecycles: developmental and social phases in the lives of \nthe last archaics. World Archaeology, 31, 351-366. \n \nProctor, C. J. 1994. A British Pleistocene chronology based on uranium series and electron \nspin resonance dating of speleothem. Unpublished Ph.D Thesis, University of Bristol. \n \nProctor, C. J., Collcutt, S. N., Currant, A. P., Hawkes, C. J., Roe, D. A. and Smart, P. L. \n1996. A report on the excavations at Rhinoceros Hole, Wookey. Proceedings of the \nUniversity of Bristol Spelaeological Society, 20, 237-262. \n \nRichards, M. P., Pettitt, P.B., Trinkaus, E., Smith, F. H., Paunovic, M. and Karanic, I. 2000. \nNeanderthal diet at Vindija and Neanderthal predation: The evidence from stable isotopes. \nProceedings of the National Association for Science (USA), 97:7663-7666. \n \nRoe, D. A. 1981. The Lower and Middle Palaeolithic Periods in Britain. The Archaeology of \nBritain. London: Routledge and Kegan Paul. \n \nRoebroeks, W. 2001. Hominid behaviour and the earliest occupation of Europe: an \nexploration. Journal of Human Evolution, 41, 437-461. \n \nRoebroeks, W., and Corbey, R. 2000. Periodisations and double standards in the study of \nthe Palaeolithic. In  Hunters of the Golden Age. (eds  W. Roebroeks, M. Mussi, J. Svoboda, \nand K. Fennema). Leiden: University of Leiden, pp. 77-86. \n \nRoebroeks, W., Conard, N.J. and van Kolfschoten, T. 1992. Dense Forests, cold steppes, \nand the Palaeolithic settlement of Northern Europe. Current Anthropology, 33, 551-586. \n \nRuff, C. B., Trinkaus, E., Walker, A. and Larsen, S. C. 1993. Postcranial robusticity in Homo, \nI: temporal trends and mechanical interpretations. American Journal of Physical \nAnthropology, 91, 21-53. \n \nRuff, C. B., Walker, A. and Trinkaus, E. 1994. Post-cranial robusticity in homo III: Ontogeny. \nAmerican Journal of Physical Anthropology, 92, 35-54. \n \nSchreve, D. C. 1997. Mammalian biostratigraphy of the later Middle Pleistocene in Britain. \nUnpublished PhD Thesis, University of London. \n \nSchreve, D. C. 2001. Differentiation of the British late Middle Pleistocene interglacials: the \nevidence from mammalian biostratigraphy. Quaternary Science Reviews, 20, 1693-1705. \n \nSerjeantson, D. 1989. Animal remains and the tanning trade. In Diet and Crafts in Towns.  \n(ed. D. Serjeantson and T. Waldron).. Oxford: British Archaeological Reports British Series \n199, pp 129-146 \n \nShackleton, N. J. 1987. Oxygen isotopes, ice volumes and sea-level. Quaternary Science \nReviews, 6, 183-90. \n \nShea, J. J., Davis, Z. and Brown, K. 2001. Experimental tests of Middle Palaeolithic spear \npoints using a calibrated crossbow. Journal of Archaeological Science, 28, 807-16. \n  22\n \nSmith, F. H., Jankovic, I. and Karavanic, I. 2005. The assimilation model, modern human \norigins in Europe, and the extinction of the Neanderthals. Quaternary International, 137, 7-\n19. \n \nSorensen, M. V. and Leonard, W. R. 2001. Neanderthal energetic and foraging efficiency. \nJournal of Human Evolution, 40, 483-495. \n \nSoressi, M. and Hays, M. A. 2003. Manufacture, transport and use of Mousterian bifaces: a \ncase study from the Perigord (France). In Multiple Approaches to the Study of Bifacial \nTechnologies. (eds M. Soressi and H. Dibble). Pennsylvania: University of Pennsylvania \nMuseum Press, pp. 125-148. \n \nSpeth, J. D. 2004. News flash: negative evidence convicts Neanderthals of gross mental \nincompetence. World Archaeology, 36, 519-526. \n \nSteegmann, A. T., Cerny, F. J., and Holliday, T. W. 2002. Neanderthal cold adaptation: \nphysiology and energetic factors. American Journal of Human Biology, 14, 566-583. \n \nStenton, D. R. 1991. The adaptive significance of Caribou winter clothing for arctic hunter-\ngatherers. Inuit Studies,15, 3-28. \n \nStewart, J. 2005. The ecology and adaptation of Neanderthals during the non-analogue \nenvironment of Oxygen Isotope Stage 3. Quaternary International, 137, 35-46. \n \nStewart, J. and Lister, A. 2001. Cryptic northern refugia and the origins of the modern biota. \nTrends in Ecology & Evolution, 16, 608-613. \n \nStraw, A. 1996. The Quaternary record of Kent's Cavern: a brief reminder and update. \nQuaternary Newsletter, 80, 17-25. \n \nThery-Parisot, I. and Meignen, L. 2000. Economie des combustibles (bois et lignite) dans \nl'Abri Mousterien des Canalletes. Gallia Prehistoire,42, 45-55. \n \nThieme, H. 1997. Lower Palaeolithic Hunting Spears from Germany. Nature, 385, 807-810. \n \nTratman, E. K., Donovan, D.T and Campbell, J.B. 1971. The Hyaena Den (Wookey Hole), \nMendip Hills, Somerset. Proceedings of the University of Bristol Spelaeological Society,12, \n245-79. \n \nTrinkaus, E. 1989. The Upper Pleistocene Transition. In The Emergence of Modern \nHumans. (ed. E. Trinkaus). Cambridge: Cambridge University Press, pp. 42-66. \n \nTrinkaus, E. 2005. Anatomical evidence for the antiquity of human footwear use. Journal of \nArchaeological Science, 32, 1515-1526. \n \nTyldesley, J. A. 1987. The bout coupé  handaxe: a typological problem. Oxford: British \nArchaeological Reports British Series 170. \n \nVan Andel, T. 2003. Glacial environments I: the Weichselian climate in Europe between the \nend of the OIS5  interglacial and the Last Glacial maximum. In Neanderthals and Modern \nHumans in the European Landscape During the Last Glaciation: Archaeological Results of \nthe Stage 3 Project. (eds T. Van Andel and W. Davies). Cambridge: McDonald Institute, pp. \n9-20. \n \n  23\nVan Andel, T., Davies, W. and Weninger, B. 2003. Human presence in Europe during the \nLast Glacial Period I: Human migrations and the changing climate. In  Neanderthals and \nModern Humans in the European Landscape During the Last Glaciation: Archaeological \nResults of the Stage 3 Project. (eds T. Van Andel and W. Davies). Cambridge: McDonald \nInstitute, pp. 31-56. \n \nVilla, P. 2002. Fuel, Fire and Fireplaces in the Palaeolithic of Western Europe. Review of \nArchaeology, 23, 33-42. \n \nVilla, P. and D'Errico, F. 2001. Bone and ivory points in the Lower and Middle Paleolithic of \nEurope. Journal of Human Evolution 41:69-112. \n \nVranch, R. D. 1981. A note on Pleistocene material from Lime Kiln Hill Quarry, Mells, \nSomerset. Proceedings of the University of Bristol Spelaeological Society, 16, 70. \n \nWatkins, S. M. 1984. Clothing: The Portable Environment. Ames: Iowa State University \nPress. \n \nWest, R. G., Dickson, C. A., Catt, J. A., Weir, A. H. and Sparks, B. W. 1974. Late \nPleistocene deposits at Wretton, Norfolk II. Devensian Deposits. Philosophical Transactions \nof the Royal Society of London, B267, 337-420. \n \nWhite, M. J. and Jacobi, R. M. 2002. Two sides to every story: bout coupé handaxes \nrevisited. Oxford Journal of Archaeology, 21, 109-133. \n \nWhite, M. J. and Ashton, N. M. 2003. Lower Palaeolithic core technology and the origins of \nthe Levallois method in NW Europe. Current Anthropology 44:598-609. \n \nWymer, J. J. 1985. Palaeolithic Sites of East Anglia. Norwich: Geobooks. \n  24\nList of Tables \nTable 1: Middle Devensian localities which have yielded evidence of Middle Palaeolithic \noccupation and environmental data of some form.  14C assays cited in uncalibrated years BP \n \nList of Figures \nFigure 1:  Wish you were here?  Artist’s reconstruction of Norfolk during OIS3 (courtesy \nNorfolk Museum & Archaeology Service\/Nick Arber) \n  25 \nSite Environmental Indicators Environments indicated Dating of Middle Palaeolithic Levels (yrs \nBP) \nSignificant References \nAston Mills and Beckford, \nHereford & Worcester, \nCarrant Gravels \nPin Hole MAZ Cool, continental, steppic Mammalian biostratigraphy, \nlithostratigraphy: OIS3 \nWaite 1977 \nAsh Tree Cave, \nDerbyshire, Stony Cave \nEarth \nPin Hole MAZ Cool, continental, steppic C14: 40,900±1800 Armstrong 1956; Hedges et al \n1994 \nClubb’s Ballast Pit, \nSnodland, Kent \nPin Hole MAZ Cool, continental, steppic Mammalian biostratigraphy and terrace \nlithostratigraphy: OIS3 \nTyldesley 1987 \nCoygan Cave, Laugharne, \nS. Wales \nPin Hole MAZ Cool, continental, steppic C14: 38,684+2713\/-2024 \nU-series: 64k (TPQ for sediments \nbased on flowstone inclusions) \nAldhouse-Green et al 1995 \nCreswell Crags: Robin \nHood Cave \nPin-Hole MAZ \nPollen (? Assoc.  with fauna & MP \narchaeology) \nCool, continental, steppic \nOpen, grass & herb dominated, some trees \nC14: 30,000±2000 to 55,000±4000 \nMP occupation <55krs \nJacobi & Grun 2003 \nCreswell Crags: Pin Hole \nCave \nPin Hole MAZ Cool, continental, steppic C14:  >41,400 to 44,900±2800 \nESR: 38-50,000 \nU-Series: 63-64,000 (terminus post \nquem) \nJacobi et al 1998 \nCreswell Crags: Church \nHole Cave \nPin Hole MAZ Cool, continental steppic Mammalian biostratigraphy: OIS3 Currant & Jacobi 2001; Coulson \n1990; Dawkins 1877 \nCreswell Crags: Mother \nGrundy’s Parlour \nPin Hole MAZ Cool, continental, steppic Mammalian biostratigraphy: OIS3 Currant & Jacobi 2001; \nCoulson, 1990; Armstrong 1925,  \nFenstanton Pits, \nCambridgeshire, Middle \nDevensian Units \nPin Hole MAZ \n \nMolluscs  \n \n \nSedimentology \nCool, continental, steppic \n \nTerrestrial assemblage indicative of  open grassland \nconditions, no extreme cold indicators \n \nBraided river sediments laid down under cold \nconditions with sparse vegetation \nMammalian biostratigraphy, \nlithostratigraphy: OIS3 \nGao et al  2001 \nFisherton Brick Pit, \nSalisbury, Wilts \nPin Hole MAZ \n \nMolluscs \n \nCool, continental, steppic \n \nMixed assemblage, but showing cool climate & open , \nmarshy environment  \nMammalian biostratigraphy and \nlithostratigraphy: OIS3 \nDelair & Shackley 1978; Green \net al 1983.  \nHyaena Den., Wookey \nHole, Somerset, cave \nearth \nPin Hole MAZ \n \nPollen \nCool, continental, steppic \n \nSmall counts from upper sequence with ? association \nwith MP assemblage although dates appear OK.  \nShows open grass-herb landscape but with some trees \nC14: 40,400±400 for MP related fauna.  \n(using ultrafiltration method 45-48k BP); \n39,000±1300 for base of upper \nsequence \nJacobi & Hawkes 1993; Currant \n& Jacobi 2004; Hedges et al \n1996; Tratman et al 1971; \nRoger Jacobi, pers. comm..  \nKents Cavern, \nDevonshire, Loamy Cave \nEarth \nPin Hole MAZ \n \nPollen \nCool, continental, steppic \n \nLow counts, showing cold, open shrub-grassland, \nminimal tree pollen \nC14 on fauna from UP levels = \n34,620±800 (oldest date providing  \nTAQ) \nU-series & ESR: deposition of cave \nProctor 1994, Straw 1996; \nHedges et al 1996; Campbell \nand Sampson 1971. \n  26 \nearth commenced <74ka \nStraw suggests cave closed until \n60kyrs, MP levels between 60-34ka. \nLime Kiln Quarry, Mells, \nSomerset \nPin Hole MAZ Cool, continental, steppic Mammalian biostratigraphy: OIS3 Vranch 1981, Currant & Jacobi \n2002; Currant pers. comm. 2005 \nLittle Paxton, St Neots Pin Hole MAZ  Cool, continental, steppic Mammalian biostratigraphy and terrace \nlithostratigraphy: OIS3 \nPaterson and Tebbutt 1947, \nWymer 1985 \nLittle Cressingham, \nNorfolk \nPollen Very low counts ostensibly showing open grassland \nwith  betula & salix.  Correlated with Devensian \ndeposits at Wretton which showed similar vegetation \nwith a cold molluscan suite \nLithostratigraphy: OIS3 Lawson 1978; West et al 1974 \nLynford Quarry, \nMundford, Norfolk \nPin Hole MAZ \n \nInsects \n \n \nMolluscs \n \n \nPollen \n \nPlant Macros \n \nSedimentology \nCool, continental, steppic \n \nTreeless steppe, some bare ground; annual T° range \n13 to -10°C or below \n \nMostly aquatic – sub-arctic climates – facies related  \n \nCool, open grassland, some marshy areas\/acid heath.  \nSome tree pollen (10%) \n \nMarshy, acid heath \n \nNo micromorphological evidence of permafrost; \ncircumstantial evidence for winter freeze.  \nOSL: 64,000±5000 – 67,000±5000 Boismier et al 2003 \nPicken’s Hole, Compton \nBishop, Somerset, Level 3 \nPin Hole MAZ Cool, continental, steppic Mammalin biostratigraphy: OIS3 \nC14: 34,365+2600\/-1900 (oldest of 2 \ndates, new unpublished dates \nexceeding 40,000) \nApSimon 1986; Roger Jacobi \npers. comm \nRhinoceros Hole, \nWookey, Somerset \nPin Hole MAZ Cool, continental, steppic U-series: MP sediments probably \nyounger than 50kyr \nProctor et al 1996 \nUphill Quarry Caves, \nWeston-Super-Mare \nPin-Hole MAZ Cool, continental steppic Mammalian biostratigraphy: OIS3 Harrison 1977 \n \n \nTable 1: Middle Devensian localities which have yielded evidence of Middle Palaeolithic occupation and environmental data of some form.  C14 assays cited uncalibrated years BP \n \n \n"}