{"doi":"10.1111\/j.1365-246X.2006.03324.x","coreId":"64249","oai":"oai:nora.nerc.ac.uk:589","identifiers":["oai:nora.nerc.ac.uk:589","10.1111\/j.1365-246X.2006.03324.x"],"title":"An improved UK local magnitude scale from analysis of shear and lg-wave amplitudes","authors":["Booth, David"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The amplitudes of shear and Lg waves recorded at UK seismograph stations from local earthquakes in the range 0–600 km have been subjected to an analysis of variance, allowing separation of the effects of earthquake size, distance and station corrections for each recording site. The propagation paths sample mainly the central to western part of the UK, with good north–south coverage. The analysis of 385 amplitude readings at 28 stations from 40 earthquakes showed that the effects of both distance and station (site) corrections were statistically significant. Tables of corrections for both distance and station effects have been derived to allow local magnitude ML to be determined more accurately from horizontal and vertical component records. One set of tables allows the estimation of an ML which is consistent with the original Richter definition of ML, with a standard deviation which is smaller than that produced by the theoretical attenuation curve, defined according to attenuation in Southern California, which has customarily been used to calculate ML in the UK. The reduction in standard deviation\\ud\nis mainly due to the incorporation of station terms to correct for station effects, since the theoretical and observed variations of attenuation with distance are similar. This similarity implies that Southern California and the UK show a similar variation of distance-dependent\\ud\nattenuation for Lg waves, which was not expected in view of the differences in geology and tectonics. Another set of tables is provided to calculate an ML which is consistent with the body wave magnitude mb determined by the International Data Centre from station records\\ud\nof the Comprehensive Test-Ban Treaty Organization’s global monitoring network. The decay with distance of the predominantly Lg-wave amplitude values gives a value of 440 ± 50 for Lg Q at a frequency of 3 Hz, in agreement with estimates obtained from spectral displacement\\ud\namplitudes of Lg waves in the UK","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64249.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/589\/1\/Booth2007LocalMag.pdf","pdfHashValue":"b0b2192f6c93090ccb6252c673665541dd2cb10e","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:589<\/identifier><datestamp>\n      2012-11-22T12:07:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/589\/<\/dc:relation><dc:title>\n        An improved UK local magnitude scale from analysis of shear and lg-wave amplitudes<\/dc:title><dc:creator>\n        Booth, David<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The amplitudes of shear and Lg waves recorded at UK seismograph stations from local earthquakes in the range 0–600 km have been subjected to an analysis of variance, allowing separation of the effects of earthquake size, distance and station corrections for each recording site. The propagation paths sample mainly the central to western part of the UK, with good north–south coverage. The analysis of 385 amplitude readings at 28 stations from 40 earthquakes showed that the effects of both distance and station (site) corrections were statistically significant. Tables of corrections for both distance and station effects have been derived to allow local magnitude ML to be determined more accurately from horizontal and vertical component records. One set of tables allows the estimation of an ML which is consistent with the original Richter definition of ML, with a standard deviation which is smaller than that produced by the theoretical attenuation curve, defined according to attenuation in Southern California, which has customarily been used to calculate ML in the UK. The reduction in standard deviation\\ud\nis mainly due to the incorporation of station terms to correct for station effects, since the theoretical and observed variations of attenuation with distance are similar. This similarity implies that Southern California and the UK show a similar variation of distance-dependent\\ud\nattenuation for Lg waves, which was not expected in view of the differences in geology and tectonics. Another set of tables is provided to calculate an ML which is consistent with the body wave magnitude mb determined by the International Data Centre from station records\\ud\nof the Comprehensive Test-Ban Treaty Organization’s global monitoring network. The decay with distance of the predominantly Lg-wave amplitude values gives a value of 440 ± 50 for Lg Q at a frequency of 3 Hz, in agreement with estimates obtained from spectral displacement\\ud\namplitudes of Lg waves in the UK. <\/dc:description><dc:publisher>\n        Blackwell Publishing<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/589\/1\/Booth2007LocalMag.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Booth, David.  2007  An improved UK local magnitude scale from analysis of shear and lg-wave amplitudes.   Geophysical Journal International, 169. 593-601.  https:\/\/doi.org\/10.1111\/j.1365-246X.2006.03324.x <https:\/\/doi.org\/10.1111\/j.1365-246X.2006.03324.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwell-synergy.com<\/dc:relation><dc:relation>\n        10.1111\/j.1365-246X.2006.03324.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/589\/","http:\/\/www.blackwell-synergy.com","10.1111\/j.1365-246X.2006.03324.x"],"year":2007,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Geophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \n \nAn improved UK local magnitude scale from analysis of \nshear- and Lg-wave amplitudes \n \nDavid C. Booth \nBritish Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 3LA, UK.       \nE-mail: dcb@bgs.ac.uk \n \n \n \n \n \n \n \nAbbreviated title:   UK shear- & Lg-wave amplitudes  \n \n \nAuthor’s contact details: \nDr David C. Booth \nBritish Geological Survey \nMurchison House \nWest Mains Road \nEdinburgh EH9 3LA \nUK.  \n \nTel: 0131 650 0219 \nFax: 0131 667 1877 \nE-mail: dcb@bgs.ac.uk \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \nAn improved UK local magnitude scale from analysis of \nshear- and Lg-wave amplitudes \n \nDavid C. Booth \nBritish Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 3LA, UK.  E-\nmail: dcb@bgs.ac.uk \n \nSUMMARY \nThe amplitudes of shear-waves and Lg-waves recorded at UK seismograph stations from local \nearthquakes in the range 0-600km have been subjected to an analysis of variance, allowing \nseparation of the effects of earthquake size, distance and station corrections for each recording \nsite. The propagation paths sample mainly the central to western part of the UK, with good north \nto south coverage. The analysis of 385 amplitude readings at 28 stations from 40 earthquakes \nshowed that the effects of both distance and station (site) corrections were statistically \nsignificant. Tables of corrections for both distance and station effects have been derived to allow \nlocal magnitude ML to be determined more accurately from horizontal and vertical component \nrecords. One set of tables allows the estimation of an ML which is consistent with the original \nRichter definition of ML, with a standard deviation which is smaller than that produced by the \ntheoretical attenuation curve, defined according to attenuation in Southern California, which has \ncustomarily been used to calculate ML in the UK. The reduction in standard deviation is mainly \ndue to the incorporation of station terms to correct for station effects, since the theoretical and \nobserved variations of attenuation with distance are similar. This similarity implies that Southern \nCalifornia and the UK show a similar variation of distance-dependent attenuation for Lg waves, \nwhich was not expected in view of the differences in geology and tectonics. Another set of tables \nis provided to calculate an ML which is consistent with the body wave magnitude mb determined \nby the International Data Centre (IDC) from station records of the Comprehensive Test-Ban \nTreaty Organisation’s global monitoring network. The decay with distance of the predominantly \nLg-wave amplitude values gives a value of 440 ± 50 for Lg Q at a frequency of 3 Hz, in \nagreement with estimates obtained from spectral displacement amplitudes of Lg-waves in the \nUK.  \n \nKey Words: S-waves, surface waves, attenuation, statistical methods\n1 INTRODUCTION \nMagnitude is one of the most important parameters associated with a seismic event. It is an \nobjective measure of earthquake size, using instrumental measurements of ground motion with \ncorrections for epicentral distance. Seismic wave amplitude attenuates with increasing distance, \nand so an appropriate distance correction must be applied to a ground motion amplitude \nmeasurement to provide a magnitude estimate. In the distance range 0°-20°, attenuation occurs in \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nthe crust and upper mantle and is region-dependent, and therefore a distance correction which \ntakes account of regional attenuation characteristics is required in any procedure to generate a \nmagnitude value from wave amplitude measurements in this distance range. \nThe British Geological Survey (BGS) estimates the magnitude of earthquakes occurring in the \nregion of the UK using a local magnitude ML. This scale is the same as that defined by Hutton & \nBoore (1987), following earlier work by Richter (1935), which uses the maximum trace \namplitudes recorded on standard Wood-Anderson horizontal seismometers. The BGS uses \nWillmore Mk3 seismometers rather than Wood-Anderson seismometers, but using the responses \nof the two instruments, amplitudes are measured  from equivalent Wood-Anderson seismograms. \nThis is done by a process of deconvolving the  Willmore response from the Fourier transform of \nthe seismogram and convolving the result with the Wood-Anderson response, then taking the \ninverse Fourier transform to give the Wood-Anderson seismogram. \nBGS have always calculated local magnitude following Richter (1935) by calculating the \nlogarithm of the maximum wave amplitude recorded on each of two orthogonal horizontal \nseismometers, adding the same correction to each to allow for epicentral distance, and taking the \nmean of the two component magnitudes. The maximum trace amplitude is almost always in the \nshear-wave coda and corresponds to the crustal shear wave Sg, or the multiply reflected shear \nwave group Lg which follows the Sg wave onset. Some agencies form the average of the two \nmaximum horizontal component amplitudes, and use that to calculate the magnitudes; this \nconvention differs from that of Richter and will result in a systematic difference in magnitudes. \nRichter’s (1935) procedure differs from the modern recommendation which is given in the New \nManual of Seismic Observatory Practice (NMSOP) (Bormann 2002). NMSOP suggests that \nwhere horizontal component records are used, amplitudes should be measured at the same time, \nso that the amplitudes can be combined vectorially, and the largest vectorially combined value is \nused to form the magnitude. The latter approach should be adopted where a magnitude scale is \nbeing developed for a new station or network. However, for reasons of continuity in their \nearthquake bulletins, BGS continue to use Richter’s procedure as described above. \nHutton and Boore (1987) have published a correction for distance which is based on \nobservations in California, and the BGS has applied this correction when estimating local \nmagnitude using amplitude measurements from its UK seismic monitoring network stations. The \nBGS recognises that seismic wave attenuation characteristics are likely to differ between \nCalifornia and the UK, so that application of the Hutton and Boore correction for the effect of \nattenuation of amplitude with distance will result in calculated local magnitudes being biased in \nsome way with respect to those determined by independent global magnitude scales. \nThe UK region is seismically active, but earthquakes of magnitude greater than 4.0 are less \nfrequent than one per year (with the exception of the North Sea Graben region), and the UK \nseismic monitoring network is primarily designed for the detection and analysis of relatively low \nmagnitude seismic events. Until recently, technical limitations imposed by the low dynamic \nrange of the UK seismic network recording system meant that shear-wave amplitudes were often \nnot measurable at stations near the epicentre when any relatively large (ML>3.5) earthquake \noccurred, due to saturation of the recording system. For many years, this restriction limited the \namount of data available for wave amplitude studies over a wide distance range, since small \nseismic events are observable only over a limited distance range. However, as instrumentation \nhas improved, and a network of strong motion accelerometer stations has been installed, \nsufficient data have become available for such a study. \nOften local effects associated with a particular recording site are present, and these may also \nbias the determination of magnitude at a station. These include seismometer-ground coupling, \nsoil amplification, path azimuth, topographic and focussing effects, local geology and \nattenuation. These shall be referred to as station effects, and will be corrected for using station \ncorrections. In this report, I apply an analysis of variance technique used by Carpenter et al. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n(1967) and others to determine an amplitude-distance curve and station corrections for shear-\nwave amplitudes recorded at UK short-period seismic stations in the range 0-600km. I then use \nHutton and Boore’s criteria, adapted from Richter (1935), to calibrate the correction to give a \nlocal magnitude based on observed amplitude values at UK stations, which is consistent with \nRichter’s original definition. The corrections are also calibrated against independent \nmeasurements of mb derived for the UK earthquakes which are listed in the Reviewed Event \nBulletins of the International Data Centre (IDC), Vienna.  The result is a distance correction \ntable which is appropriate for estimating a local magnitude ML equivalent to mb(IDC). The table \nis derived not because the IDC magnitude is especially representative for UK earthquakes, but \nbecause there is no existing relation between UK ML and mb(IDC). \nThe IDC is operated by the Comprehensive (nuclear) Test Ban Treaty Organisation (CTBTO) \nfor the production and distribution of data for CTBT verification. The identification of a seismic \nevent as an explosion from the use of seismograms alone is vital in monitoring compliance with \nthe CTBT, since seismic techniques are required to monitor underground nuclear explosions.  \nExplosions must be discriminated from much more commonly occurring earthquakes; this is a \ndifficult task and no single discrimination technique has been found which is successful for all \nseismic events. Probably the most successful technique so far has been the mb:MS criterion \n(Marshall & Basham 1972) , which depends on the observation that for a seismic event with a \ngiven body wave magnitude mb, the surface wave magnitude MS is typically larger for an \nearthquake than for an explosion. Application of the criterion requires that accurate \nmeasurements of mb and MS are available. For small events, mb<4.0, few if any measurements of \nmb and MS may be available. For such events, the ability to determine an equivalent mb from \nlocally recorded amplitudes may be useful, particularly for a state signatory which wishes to \nprovide supporting discriminatory evidence in respect of a nearby event. It is therefore useful \nthat a reliable estimate of mb for local events can be made, using seismic wave amplitudes \nrecorded at local stations. Estimates of mb consistent with those obtained by the IDC are formed, \nand compared with those of the USGS National Earthquake Information Centre (NEIC), \nInternational Seismological Centre (ISC), and an empirical relation derived by Neilson & Burton \n(1985). \nThe decay of log A as a function of distance allows the calculation of an average Q for the \nUK for the measured waves of maximum amplitude. Examination of the particle motion of these \nwaves indicates that they are predominantly Lg waves, arriving shortly after the Sg phase, a \nsequence of shear waves multiply reflected within the crust, which can alternatively be described \nas a superposition of higher mode surface waves. There is a wealth of surface wave attenuation \nwork in the literature, such as Brune (1962), Nuttli (1973) and Burton (1974), following Ewing \net al. (1957), and many Lg attenuation studies exist, of which Ottemöller et al. (2002), Benz et al. \n(1997), Bowman & Kennett (1991), Herrmann (1980) are only a few examples. Lg waves \nprovide a good measure of path-averaged crustal properties, in particular S-wave velocity and \nattenuation. Studies of wave attenuation in the crust under the UK have mainly been confined to \nthe shallow crust. MacBeth and Burton (1985, 1986, 1987, 1988) conducted a series of surface \nwave studies in the UK. While most of these were based on data from explosions, and pertain to \nthe shallow crust, in one study (MacBeth and Burton, 1985), data from a 11 km deep earthquake \nobserved on a lithospheric seismic profile in Britain (LISPB) allowed a shear velocity-depth \nprofile to be determined, showing a consistent increase in velocity from 3.4 to 3.7 km s-1 in a \ndepth range from 2 to 17 km. The group velocities corresponding to the maximum amplitude \narrivals in the present study vary between 2.4 and 4.4 km s-1, with most values in the 3.2 to 3.6 \nkm s-1 range.  The focal depths of the UK earthquakes used in this study vary between 0.1 and \n26.4 km (the average depth was 11.7 km) and hypocentral distances range from 19 to over 800 \nkm, thus it is probable that the full range of crustal depths is sampled by the Lg waves. \nObservations of amplitude decay with distance are used to derive a value for Q for the dominant \nperiod of Lg waves over the distance range 110 and 390 km in the UK. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n2 METHOD OF ANALYSIS \nFollowing Carpenter et al. (1967) and Booth et al. (1974), we write the amplitude of the shear-\nwave or Lg wave recorded at a seismometer station as \nlog10A = b + s + r             (1) \nwhere A is the maximum wave amplitude recorded on the seismometer,  b is a term proportional \nto source size, s is a station effect, and r is a distance effect. The formula for local magnitude ML \naccording to Richter  (1935) is \nML = log10A  -   log10A0,            (2) \nwhere -log10A0 is a correction for the effect of distance, abbreviated here to the distance-\ndependent function B(Δ). To allow for the possible effect of local station effects we introduce a \nstation term S. Then  \nML = log10A + B(Δ) + S            (3) \nIt follows that  \nlog10A = ML - B(Δ) – S             (4) \nand log10A can be expressed as a sum of effects of source size, distance, and recording site.  \nTo analyse the data I follow Carpenter et al. (1967) and Booth et al. (1974) and make the \nassumption that if aijk is log10A for the j-th station and the i-th earthquake in the k-th distance \nrange then \naijk = bi + sj + rk + c + eijk            (5) \nwhere bi is a measure of the size (energy release) of the i-th earthquake, sj is the station effect for \nthe j-th station, rk is the effect of distance, c is a constant, and eijk is an error. bi, sj, rk and c can be \nestimated in the presence of this error by the method of least squares (on the assumption that the \nerrors have zero mean) with the conditions \nΣbi = Σsj = Σrk = 0,             (6) \nwhere bi  is summed over n earthquakes, sj  is summed over q stations, and rk is summed over l \ndistance ranges. Condition (6) is applicable due to the linear dependence of the terms in equation \n(5), and introduction of the constant c permits the application of this condition. The average \nvalues of bi , sj and rk are set to zero and their true values become a matter of definition. By \nmaking the additional assumption that the errors eijk are normally distributed, confidence limits \ncan be determined for bi , sj , and rk . The problem corresponds to an analysis of variance of three \neffects: earthquake size, distance and station. The distance correction B(Δ) and station correction \nS in (3) are derived from the distance and station effects,  sj  and rk  respectively. We can write  \nB(Δ) =  -rk + D,              (7) \nwhere D is a constant term which is added so that the magnitudes ML computed using the \nrevised curve agree on average with magnitudes computed by a specified agency. This gives the \nterm B(Δ) in (3); the station correction S which is to be added to log10A and B(Δ) in (3) to form \nML is – sj . Also, from (3), \nML = log10A – rk  + D – sj ,            (8) \nand from (5) \nlog10A – rk  – sj  = bi  + c,            (9) \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nso that for the i-th earthquake \nML = bi  + c + D.                       (10) \n3 DISTANCE AND STATION EFFECTS ON ML VALUES  \n3.1 Analysis of variance study \nMeasurements of the maximum amplitude recorded on vertical and N-S and E-W oriented \nhorizontal seismometers were made from 40 UK earthquakes in the period 1996-2002, as \nrecorded at 28 three-component stations in the BGS UK seismograph network. Examination of \nthe arrival time, signal character, and particle motion of these waves indicates that they are \npredominantly Lg waves, arriving shortly after the Sg phase and showing no dispersion. The \nlocations of the earthquakes and stations are shown in Figure 1, together with the propagation \npaths corresponding to the seismograms. The propagation paths mainly sample the western and \ncentral parts of the UK, with reasonably good north to south coverage. At least three stations \nrecorded each earthquake. Four stations (BCC, HBL2, KEY2, LDU) are strong motion \naccelerometer stations. The range of distances was 0-600km and this range was divided up into \n30 intervals of 20km length. As stated in section 1, BGS has consistently estimated ML using the \naverage of the magnitudes formed from the maximum wave amplitudes recorded on two \northogonal horizontal (H) seismometers, and the amplitudes and measurements of ML are \npublished in their annual bulletins of seismicity for the UK.  The present study has analysed \nindividual horizontal component wave amplitudes, as well as mean horizontal wave amplitudes, \nat each station. It has also used vertical (Z) component amplitudes in order to determine if \nconsistent local magnitudes can be determined from vertical records alone. Use of vertical \nrecords would allow more stations to contribute to magnitude determination, since there are \nmany more vertical stations than three-component stations in the BGS network. This is useful \nwhen small events generate measurable seismograms at only a few stations, since only one or \nnone of these may be three-component stations. \nIt was noted in Section 1 above that systematic differences arise between magnitudes calculated \nfrom average component magnitudes, and magnitudes calculated from the average component \namplitude. Both magnitudes were calculated for station data used in the analysis of variance, and \nthe values were compared. The average difference between the magnitudes over all the \nearthquakes was 0.007 units, the largest difference for a single earthquake was 0.019, and the \nlargest difference for a single station measurement was 0.057 (the average amplitude magnitude \nbeing greater). Thus the systematic differences between the magnitude calculation procedures \nare not likely to be significant when magnitude is calculated using records from three or more \nstations. \nThe analysis of variance procedure described in section 2 above was applied to the data using \na computer program developed by A Douglas (Carpenter et al. 1967). The program generates \ntables of station effects sj and distance effects rk for the stations, and distance intervals, \nrespectively.  Application of Snedecor’s F-test (Abramowitz & Stegun, 1972) to the station and \ndistance variances shows that both are highly significant at the 0.1 percent level, for both \nhorizontal and vertical component data. The statistics associated with the analysis are presented \nin Table 1. The variation of amplitude with distance (r in equation 1) for horizontal and vertical \namplitude measurements is shown in Figure 2, and the station corrections S are given in Table 2, \ncalculated for the average component amplitudes.  \nStation corrections calculated for individual components were also calculated, but the \ndifferences between them and the average amplitude corrections were not significant. The NS \nand EW horizontal component corrections differed by more than 0.2 magnitude units from the \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \naverage amplitude station correction at only the most northerly station (LRW), and at 23 stations \nout of 28 the difference was less than 0.1  \n3.2 Calibration of distance effect for Richter local magnitudes \nIt was noted in section 2 that a constant D must be added to the distance correction formed from \nrk so that the magnitudes ML computed using the amplitude-distance curve derived from \nobserved amplitudes agree on average with magnitudes computed by a specified agency. The \nbaseline for the distance correction was chosen so that the magnitudes ML are defined according \nto the Richter definition of local magnitude, subsequently modified by Hutton & Boore (1987), \nso that a ML 3 earthquake corresponds to 10mm of displacement on a Wood Anderson (WA) \nseismometer at 17km hypocentral distance. This magnitude is denoted MLR. In the UK, very few \nearthquakes are recorded at a distance of 17km, and so the equivalent original definition due to \nRichter (1935) is used, that a ML 3 earthquake will generate a 1mm displacement on a WA \nseismometer at 100km hypocentral distance. The WA gain is assumed to be 2080 (Bormann \n2002), so that 1mm WA displacement corresponds to 481nm actual displacement, and a logA \nvalue of 2.68.  Interpolating between the horizontal component distance effects determined for \nthe ranges 80-100km, and 100-120km, yields the value of 0.81 for the distance effect rk at \n100km. It follows that for a ML value of 3 at 100km hypocentral distance, the constant D to be \nadded to the distance correction, -rk , to form the distance correction B(Δ), must be 1.13 for \nhorizontal component measurements. A similar procedure yields a value of 1.08 for D for \nvertical component measurements. The distance correction B(Δ)R for evaluating the Richter \nmagnitude MLR is given for both horizontal (H) and vertical (Z) components in Table 3.  \nBGS uses the Hutton & Boore (1987) distance correction when estimating ML for local \nearthquakes. We shall refer to this ML as MLHB. The expression for MLHB, specified for a \nmeasured displacement A in nm at distance Δ km, (e.g. Walker 2000), is \nMLHB = log A + B(Δ)HB  = log A + 1.11 log(Δ) + 0.00189* Δ - 2.09           (11) \nThe B(Δ)R distance corrections and the Hutton & Boore (1987) corrections B(Δ)HB used to \ncompute MLHB  are compared in Figure 3. Discrepancies in the range 40-80km and 400-440 km \nare believed to reflect real differences in Lg wave propagation in the UK compared to California. \nOver the range 90 to 400 km the corrections are very similar, implying that the crustal \nattenuation properties of Southern California and the UK are similar for S-waves and Lg waves. \nThis is an unexpected discovery, as the geology and tectonics are quite different.  \nMLR values were calculated for each station and each earthquake which contributed the \namplitude values used in the analysis of variance study, using equation 8 above, for both \nhorizontal and vertical component amplitude values. Corresponding estimates of MLHB were \ndetermined from the same amplitude values. The mean earthquake magnitudes MLR and MLHB, \nand the corresponding standard deviations, are listed in Table 4 and MLR(H) is plotted against \nMLHB  for each earthquake in Figure 4. (MLR - MLHB) varies between 0.22 and –0.05 magnitude \nunits, and 0.19 and –0.09 magnitude units, for horizontal and vertical component data, \nrespectively. The respective average difference is 0.07 and 0.05 magnitude units. Note that the \nstandard deviations of the sets of MLR values for each earthquake are usually smaller than the \nstandard deviations of the MLHB values, and 35 standard deviations exceed 0.2 for MLHB \ncompared to only 4 for MLR, which indicates that MLR is more consistent than MLHB. The \nsimilarity between the distance corrections used for MLHB and MLR suggests that this is almost \nentirely due to the use of station corrections in the calculation of MLR.  It is seen that MLR(H) is \nlarger than MLR(Z) by about 0.2 magnitude units; this is due to the slight differences in the \namplitude-distance curves for horizontal and vertical component amplitudes, after applying the \ndefinition of ML at 100km distance. MLR(H) is plotted against MLR(Z) in Figure 5; the best \nfitting straight line to this plot, assuming the gradient is unity, provides the following equation \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nMLR(H)  = MLR(Z) + 0.21,                    (12) \nwhich allows a consistent magnitude to be determined from a combination of horizontal and \nvertical component records. Since the baseline for the MLR scale has been set according to values \nfor displacement for a specified magnitude observed in California, the MLR  magnitudes will still \nbe biased with respect to those determined by independent global body and surface wave \nmagnitude scales. \n3.3 Calibration of distance effect for IDC magnitudes \nThe constant D can also be computed so that the computed ML will be equivalent to the \nteleseismic body wave magnitude mb in the Reviewed Event Bulletin (REB) published by the \nInternational Data Centre (IDC) of the Comprehensive Test-Ban Treaty Organisation. Source \nparameters for seven earthquakes occurring in the UK region have been published in the IDC \nREB. The location accuracy of four of these earthquakes is relatively poor, as they occurred \noffshore, hence distance values for them may be inaccurate. Of the remaining three earthquakes, \none (5 in Table 5) was assigned an mb by only one IDC station, and the remaining two (1, 8 in \nTable 5) from observations at three or more IDC stations at different azimuths and distances. Of \nthe latter two earthquakes, I used the larger magnitude earthquake (mb 4.0) to calibrate the \ndistance effect for IDC mb (mbIDC), to avoid the possibility that background noise might bias the \nIDC estimate at the low magnitude of mb 3.3. The correction factors to be applied to calculate \nmbIDCML from horizontal amplitude values are given in Table 3.  \nIn order to determine whether mbIDCML is consistent with the mbIDC values, the station and \nsource corrections were used to estimate mbIDCML for seven local earthquakes for which mbIDC \nestimates are available. These estimates, together with MLR calculated using the corrections \nderived above, are presented in Table 5. Estimates of mb computed by the US NEIC and ISC are \nalso provided where available.  For one earthquake, there is an NEIC mb but not an IDC mb. \nDiscrepancies may occur between NEIC and IDC magnitudes, which depend on source type, \nsource depth, and magnitude, and are due to differences in the procedures used by the two \nagencies to calculate mb (Murphy & Barker 2003). For the earthquakes used here, the IDC mb \nmagnitudes are consistently lower than the NEIC mb estimates, by about 0.3-0.4 magnitude units \non average. Data from four of the earthquakes (1, 5, 6 and 8) were used in the above \ndetermination of the station and distance corrections. Table 5 shows that the mbIDCML estimates \nare generally close to mbIDC. A significant discrepancy of 0.4 magnitude unit is observed between \nmbIDCML and mbIDC for earthquake 5. This earthquake occurred in the Bristol Channel and mbIDC \nwas determined by a single station (ARCES). ML as determined by IDC from records at \ndistances less than 20º was 3.3, and the earthquake did not appear in the NEIC bulletin. Thus it is \nlikely that the true magnitude is lower than 3.6 and the mbIDC estimate is biased high due to path \nand site effects associated with this single station, or contamination by background noise at low \nsignal amplitude. \n The corrections in Table 3 give an mbIDCML equivalent to mbIDC. Other relations have been \ndetermined which give teleseismic mb from local seismograms in the UK. Jacob & Neilson \n(1977) provided a scale to measure mb*, equivalent to teleseismic mb, at ranges as short as \n200km. The equation is  \nmb* = log V + 2.3logR –2                   (13) \nwhere V is the ground velocity represented by the maximum trace amplitude in the P-wave train \nin microns per second and R is the distance in km. Jacob & Neilson (1977) matched mb* to ML \n(equivalent to MLR) with the relation  \nML = 0.72 mb* + 1                 (14) \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nusing a dataset consisting of low magnitude British earthquakes observed in central Scotland. A \nsubsequent study by Neilson and Burton (1985), using data from higher magnitude onshore \nBritish earthquakes, produced the relation \nML = 0.98 mb* + 0.31             (15) \nValues mb*JN and mb*NB derived from (13) and (15) above are shown in Table 5. Measured values \nof mb* from P-wave measurements on BGS UK stations show a large standard deviation, which \nis probably due to the asymmetry of the P-wave radiation pattern for earthquakes. Estimates of \nmb* obtained from values of MLR are better matched to mbIDC and mbNEIC, and have a much \nsmaller standard deviation, than estimates from P-wave velocity measurements. This is because \nLg-wave radiation for earthquakes shows less azimuthal variation than P-wave radiation. The \nmb* values lie between mbIDC and the NEIC mb values, generally nearest mbIDC, but this is \nprobably not significant since Jacob & Neilson (1977) found that the difference between mb \n(NEIC) and mb* could be of the order of 0.3 magnitude units, and Table 5 shows that for some \nearthquakes it can be even higher. For UK earthquakes it seems to be more reliable to scale to \nteleseismic mb using ML rather than mb*. \nThe absence of data from underground explosions recorded by BGS and the IDC together \nhas meant it has not been possible to compare mbIDCML with an IDC value of mb for such \nexplosions. However, in studies of Nevada and Semipalatinsk explosions, Nuttli (1986) and \nRingdal et al. (1992) respectively have shown that Lg-based source size estimators are reliable \nand provide a stable estimate of magnitude, and that these estimates show significantly less \nscatter between station pairs than estimates of mb (Hansen et al. 1990). Thus I believe that there \nis no reason to suggest that the relation derived above will not be applicable to underground \nexplosions. \n3.4 Discussion \nIt is difficult to interpret the variation in station effect between stations in terms of shear-wave \n(Sg and Lg) propagation characteristics. The station corrections in Table 2 differ significantly \nwithin groups of nearby stations and between horizontal and vertical components at individual \nstations. For example, the groups of nearby stations (BCC, BHH, ESK), (MCH, SSP, HBL2), \n(CWF, KEY2), and (HPK, LDU) all show wide disparity between horizontal station corrections, \nand BHH, CR2, HPK, MCH and ORE show very different sizes of correction for horizontal and \nvertical amplitudes.   \nNote that due to variations in the number of data samples at the different stations and distance \nranges, the corrections are not equally well constrained. The strong motion stations provided \nrecorded amplitudes only for the largest magnitude earthquakes, and in the 0-600km distance \nrange only two measurements were available at the northernmost station at Lerwick (LRW). \nDistances were well sampled from 20 km to 400km; only the largest earthquakes generated \nmeasurements beyond 400km. \n \n \n4  ESTIMATION OF QUALITY FACTOR, Q \n \nAfter applying a correction for geometrical spreading, it is possible to use the decay of log A to \nderive an expression for the attenuation due to anelastic absorption and the quality factor Q. \nNuttli (1973) proposed that the amplitude decay A(Δ) of the vertical component Lg wave with \nepicentral distance Δ can be written: \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nA(Δ) = A0 Δ-n  exp(-kΔ),                  (16) \n \nat small distances where earth curvature can be neglected, where A0 is a factor independent of \ndistance. Δ-n describes attenuation due to geometrical spreading and exp(-kΔ) describes \nattenuation due to anelastic absorption and scattering. Nuttli (1973) suggested that n=5\/6, which \nis appropriate for a non-dispersive Airy phase trapped in the crustal waveguide in the time \ndomain. If Δ is in km, the attenuation coefficient k = π\/QUT, where Q is the specific quality \nfactor for waves of period T, and U is the group velocity of the waves. Bowman & Kennett \n(1991) note that if the Moho is a gradient zone rather than a first order discontinuity, the \namplitude decrease due to geometrical spreading may not obey a simple power law. Then it is \ndifficult to separate the effect of geometrical spreading and those of anelastic absorption and \nscattering. In this work we make the assumption that the effects can be separated as in equation \n(16), and note from Bowman & Kennett (1991) that Q may then be underestimated, so that the \nderived value of Q would be a lower limit on the average Q for the UK for the average frequency \nat which Lg amplitudes are observed (f = 2.85Hz). For a given value of the period, the decay of \nlog A with distance, with a correction for geometrical spreading is, from (16): \n \nr(Δ) + 0.833 log Δ = -0.4343 kΔ + constant.               (17) \n \nThus when the decay of log A is corrected for geometrical spreading, the resulting curve should \nshow a linear decay with Δ. The corrected values of log A plotted against distance are shown in \nFigure 6, and it is seen that the curve is approximately linear with a slope of 0.29 ± 0.03 degree-1, \ngiving k as 0.668 degree-1. For the average Lg wave period observed on the short period \nseismograms, T = 0.35sec, f=2.85hz, and assuming a group velocity U = 3.4 km sec-1, the \nspecific quality factor Q is 440 ± 50.  \n   From independent spectral measurements, Sargeant & Ottemöller (2006, personal \ncommunication) have derived the expression Q = 337(f\/1.58) 0.45 for frequency-dependent Q in \nthe UK; for T=0.35s, f=2.85hz, Q is 440, which matches the estimate derived from the \namplitude-distance curve. It was noted that the corrections for distance in the 90-400km range \nare very similar to the Hutton & Boore (1987) corrections, which suggests that average Lg Q for \nthe UK is similar to that for Southern California. This is corroborated by spectral measurements \nof Lg for southern California derived by Benz et al. (1997), who deduced the frequency-\ndependent function Q = A(f\/1.5)0.59(±0.11) for frequencies f = 1.0 to 7.0 hz, where A ranges \nbetween a minimum of 256 and a maximum of 313. The average UK value found above (Q = \n440 ± 50) falls within the range Q = 345 to Q = 491 according to Benz et al. (1997), for f = 2.8 \nhz. \nThe similarity between Lg Q for the UK and Southern California was not expected, since the \nlatter is an active tectonic region whereas the UK is not. Similar unexpectedly low values of Lg \nQ were found by Bowman & Kennett (1991) in central Australia and Frankel et al. (1990) in \nSouth Africa. More relevantly in a geographical context, low values of Lg Q have been found in \nFrance (Campillo & Plantet, 1991). Bowman & Kennett (1991) showed that when the Moho is a \ngradient zone and not a first order discontinuity, as under central Australia, the actual \ngeometrical spreading may differ significantly from the simple power law Δ-5\/6. The Q \ndeterminations are sensitive to small changes in the geometrical spreading exponent (Frankel et \nal.  1990). \nIn the UK, the Moho is a relatively sharp interface (Clegg & England, 2003), but there are \nstrong lateral variations in crustal velocity structure (Barton 1992, Clegg & England 2003). \nThese may cause significant frequency-dependent wave scattering, which would increase \nattenuation above that of geometrical spreading and anelastic attenuation. Campillo & Plantet \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n(1991) showed a strong correlation between the attenuation of the multiply reflected Lg crustal \nphases and heterogeneity in the lower crust of NW France, as observed by a wide-angle \nreflection profile. Thus I suggest that wave scattering is likely to play an important part in \nexplaining the attenuation of Lg waves in the UK.  \n5 CONCLUSIONS \nAn analysis of shear-wave amplitudes from local earthquakes at stations of the UK seismic \nmonitoring network has generated correction tables which allow the estimation of local \nmagnitudes which are fully consistent with the Richter definition of local magnitude, as well as \nmagnitudes which are equivalent to the body wave magnitudes published in the bulletins of the \nCTBTO International Data Centre. 385 amplitude readings from 40 local earthquakes recorded at \n28 three-component seismometer stations and strong-motion accelerometer stations in the \ndistance range 0-600km were used in this study. The effects on amplitude of source size, \ndistance and near-station characteristics were separated using an analysis of variance technique. \nThe new amplitude-distance curve and station corrections allow an estimate of mb (IDC) from \nlocal shear-wave data which can be applied to event discrimination studies. It should be noted \nthat the NEIC and IDC do not calculate body wave magnitude mb in the same way. Thus when \ncomparing body wave magnitudes of UK earthquakes, mbIDC and mbIDCML may be underestimated \nby 0.3-0.4 units when compared with NEIC magnitudes.  \nLocal magnitude estimates of MLR determined according to the Richter definition of local \nmagnitude, using appropriately adjusted distance correction tables from the new amplitude-\ndistance curve and the new station corrections, show a smaller variance than the corresponding \nBGS values calculated from the Hutton & Boore (1987) formula. This is due to the application of \nstation corrections to the calculation of ML, which have not been included up until now in the \nstandard BGS procedure for determining local magnitude. Since the distance corrections closely \nmatch those of Hutton & Boore (Figure 3), adoption of the new corrections will produce average \nmagnitude estimates with smaller variance but no perceptible change in magnitude level.  \nAfter correcting for geometrical spreading following Nuttli (1973), the variation of wave \namplitude with distance curve produces an estimate of average Lg Q of 450 , which is similar to \nthat of Southern California and other active tectonic zones. The UK is not an active tectonic \nzone, and so this relatively low value was not expected. Since there appears to be no reason to \nassume that the geometrical spreading factor of r-5\/6 for Lg waves is smaller in the UK, or that \nlow-Q material exists in the crust, it is suggested that scattering from crustal heterogeneities \nunder the UK is a significant factor in Lg wave attenuation in the crust. \n \nACKNOWLEDGEMENTS \nThe author thanks Professor Alan Douglas for stimulating discussions and advice on the topic of \nthis report, and Alan and his colleague Mr John Young (AWE) for supplying the analysis of \nvariance program used in this study. Peter Marshall, Neil Selby (AWE), Brian Baptie, Lars \nOttemöller (BGS), and anonymous reviewers are also thanked for comments which significantly \nimproved it. This paper is published with the permission of the Executive Director of the British \nGeological Survey (NERC). \nREFERENCES \nAbramowitz, M. & Stegun, I.A., 1972. Handbook of mathematical functions.  Dover \nPublications, Inc. New York. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nBarton, PJ, 1992, LISPB revisited; a new look under the Caledonides of northern Britain: \nGeophys.J.Int., 110, 371–391. \nBenz, H.M., Frankel, A., & Boore, D.M., 1997. Regional Lg attenuation for the continental \nUnited States, Bull.Seism.Soc.Am., 87, 606-619. \nBooth, D.C., Marshall, P.D. & Young J.B., 1974. Long and short period P-wave amplitudes from \nearthquakes in the range 0-114˚, Geophys.J.R.astr.Soc., 39, 523-537. \nBormann, P., 2002.  Magnitude of seismic events.  IASPEI New Manual of Seismological \nObservatory Practice. Bormann, P. (editor). Potsdam: GeoForschungsZentrum. ISBN 3-\n9808780-0-7. \nBowman, J.R. & Kennett, B., 1991. Propagation of Lg waves in the North Australian craton: \ninfluence of crustal velocity gradients, Bull.Seism.Soc.Am., 81, 592-610. \nBrune, J. (1962) Attenuation of dispersed wave trains, Bull.Seism.Soc.Am., 52, 109-112. \nBurton, P.W. (1974). Estimations of Qγ-1 from seismic Rayleigh waves, Geophys.J.R.astr.Soc., \n36, 167-189. \nCampillo, M. & Plantet, J.L., 1991. Frequency dependence and spatial distribution of seismic \nattenuation in France: experimental results and possible interpretations, Phys. Earth Planet. Int., \n67, 48-64. \nCarpenter, E.W., Marshall, P.D. & Douglas, A., 1967. The amplitude-distance curve for short \nperiod teleseismic P-waves, Geophys.J.R.astr.Soc., 13, 61-70. \nClegg, B., & England, R.W. 2003. Velocity structure of the UK from a compilation of wide-\nangle and refraction data. Geol. Mag., 140, 453-467. \nEwing, M., Jardetzky, W.S., & Press, F., 1957. Elastic waves in layered media, McGraw-Hill, \nNew York. \nFrankel, A., McGarr, A., Bicknell, J., Mori, J., Seeber, L., & Cranswick, E., 1990. Attenuation of \nhigh-frequency shear waves in the crust: measurements from New York State, South Africa and \nSouthern California, J.Geophys. Res., 95, 17441-17457. \nHansen, R.A., Ringdal, F., & Richards P.G., 1990.The stability of RMS Lg measurements and \ntheir potential for accurate estimation of the yields of Soviet underground nuclear explosions, \nBull.Seism.Soc.Am., 80, 2106-2126. \nHerrmann, R.B., 1980. Q estimates using the coda of local earthquakes, Bull.Seism.Soc.Am., 70,  \n447-468. \nHutton, K.L. & Boore, D.M., 1987. The ML scale in southern California: Bull.Seism.Soc.Am., \n77,  2074-2094. \nJacob, A.W.B., & Neilson, G., 1977. Magnitude determination on LOWNET, British Geological \nSurvey Global Seismology Unit Report No. 206, 40pp. \nMarshall, P.D. & Basham, P.W., 1972. Discrimination between earthquakes and explosions \nemploying an improved MS scale, Geophys.J.R.astr.Soc., 28, 431-458. \nMacBeth, C.D. & Burton, P.W., 1985. Upper crustal shear velocity models from higher mode \nRayleigh wave dispersion in Scotland, Geophys.J.R. astr. Soc., 83, 519-539. \nMacBeth, C.D. & Burton, P.W., 1986. Propagation of 0.7-2.5 Hz Rayleigh waves in Scotland, \nGeophys.J.R.astr.Soc., 84, 101-120. \nMacBeth, C.D. & Burton, P.W., 1987. Single-station attenuation measurements of high \nfrequency Rayleigh waves in Scotland, Geophys J.R.astr.Soc., 88, 757-798. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nMacBeth, C.D. & Burton, P.W., 1988. Surface waves generated by underwater explosions \noffshore Scotland, Geophys.J.R.astr.Soc., 94, 285-294. \nMurphy, J.R. & Barker, B.W., 2003. Revised Distance and depth Corrections for use in the \nestimation of short-period p-wave magnitudes, Bull.Seism.Soc.Am., 93, 1746-1764. \nNeilson, G. & Burton, P.W., 1985. Instrumental magnitudes of British Earthquakes, in \n‘Earthquake Engineering for Britain’, pp 83-85, Thomas Telford Ltd., London. \nNuttli, O.W., 1973.  Seismic wave attenuation and magnitude relations for eastern North \nAmerica, J.Geophys.Res., 78, 876-885. \nNuttli, O.W., 1886. Yield estimates of Nevada test site explosions obtained from seismic Lg \nwaves, J.Geophys.Res., 91, 2137-2151. \nOttemoller, L., Shapiro, N.M., Singh, S.K., & Pacheco, J.F., 2002. Lateral variation of Lg wave \npropagation in southern Mexico, J.Geophys.Res., 107, 2008, doi:10.1029\/2001JB000206. \nRichter, C.F., 1935. An instrumental earthquake magnitude scale. Bull.Seism.Soc.Am., 25, 1-32. \nRingdal, F., Marshall, P.D., & Alewine, R.W., 1992. Seismic yield determination of Soviet \nunderground nuclear explosions at the Shagan River test site, Geophys.J.Int., 109, 65-77. \nWalker, A.B. (ed.), 2000. Bulletin of British earthquakes 2000, British Geological Survey \nTechnical Report WL\/00\/01. \n \nFIGURE CAPTIONS  \nFigure 1.   Map showing propagation paths between earthquakes (black dots) and three-\ncomponent UK seismometer stations (triangles), corresponding to the seismograms used in the \nanalysis of variance study.  \nFigure 2.   Amplitude-distance variation of shear-waves in the UK region, from mean maximum \namplitudes in horizontal (H) and vertical (Z) component records. The 95% confidence limits at \neach 20km distance interval are indicated for the H values by horizontal bars. \nFigure 3.   Comparison of distance corrections B(Δ)HB , and B(Δ)R for horizontal (H) and vertical \n(Z) amplitude measurements with associated error bars for H corrections,  for the distance range \n0 – 600km. \nFigure 4.  Comparison of MLR(H) and MLHB for the earthquakes used for the analysis of \nvariance study (values given in Table 5). The straight line fit to the data has a slope of 1.02 and \nan intercept of -0.14. \nFigure 5. Comparison of MLR(H) and MLR(Z) for the earthquakes used for the analysis of \nvariance study (values given in Table 5). The straight line fit to the data has a slope of 0.98 and \nan intercept of 0.25. \nFigure 6.  Decay of log (Amplitude) with distance after correction for the effects of geometrical \nspreading and dispersion, following Nuttli (1973).  The straight line fit to the data has a slope of \n-0.29 and an intercept of 1.00. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \nTable 1  Statistics associated with analysis of variance of the horizontal and vertical amplitudes \n \n          Horizontal  Vertical \n \nVariance of a Single Observation     0.0265  0.0282 \n \nTotal Degrees of Freedom       300   282 \n \nSum of squares attributable to distance effect   47.325  41.484 \n \nTotal degrees of freedom      29   28 \n \nAverage square attributable to distance effect   1.632   1.482 \n \nSignificance        <0.1%  <0.1% \n \nSum of squares attributable to station effect   9.553   3.322 \n \nTotal degrees of freedom      27   25 \n \nAverage square attributable to station effect   0.354   0.132 \n \nSignificance        <0.1%  <0.1% \n \nConstant         1.744   1.594 \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \nTable 2  Station Corrections with 95% confidence limits for application to log(Amplitude) \nmeasurements from horizontal (H) and Vertical (Z) component records.  Strong motion stations \nare identified by an asterisk. Note that errors depend on the number of station records available. \n \nStation Correction \n(H) \nError \n(H) \nRecords \nused (H) \nCorrection \n(Z) \nError \n(Z) \nRecords \nused (Z) \nBBO  0.03 0.07 29  0.06 0.07 29 \nBHH -0.24 0.07 30 -0.05 0.07 29 \nBCC* -0.02 0.20 3  0.09 0.18 4 \nBTA -0.16 0.07 24 -0.01 0.07 24 \nCR2  0.22 0.12 9  0.01 0.12 9 \nCWF  0.16 0.09 17  0.16 0.09 17 \nDYA -0.09 0.14 6 -0.11 0.15 6 \nEDI  0.12 0.08 21  0.19 0.08 18 \nESK  0.23 0.07 23  0.04 0.08 22 \nGAL  0.22 0.08 18  0.07 0.09 17 \nGIM  0.19 0.07 25  0.05 0.07 25 \nHPK  -0.37 0.10 12 -0.08 0.11 11 \nHBL2* -0.24 0.17 4 -0.20 0.20 3 \nHTL  0.05 0.10 12 -0.08 0.12 10 \nKEY2* -0.36 0.20 4 -0.17 0.25 3 \nKPL  0.18 0.09 15  0.09 0.09 15 \nLDU* -0.18 0.20 3    \nLMI  0.12 0.07 25  0.00 0.07 24 \nLRW  0.07 0.40 2    \nMCD -0.07 0.10 14 -0.20 0.11 13 \nMCH -0.03 0.09 14  0.18 0.10 13 \nORE -0.05 0.14 7 -0.23 0.14 7 \nPGB  0.04 0.09 17  0.13 0.09 16 \nRRR  0.15 0.13 7  0.10 0.14 7 \nSSP  0.16 0.09 16  0.05 0.09 16 \nSWN -0.20 0.11 10 -0.20 0.12 9 \nTFO -0.13 0.15 6 -0.04 0.15 6 \nWCB  0.21 0.08 23  0.15 0.08 22 \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nTable 3 Distance corrections B(Δ) for application to log(Amplitude) measurements from \nhorizontal (H) and vertical (Z) component records to calculate MLR from horizontal (H) and \nvertical (Z) amplitudes, with 95% confidence limits, and mbIDCML from horizontal amplitudes. \n \nDistance   \n(km) \nB(Δ)R \n(H) \nError \n(H) \nRecords \nused (H) \n B(Δ)R \n(Z) \nError \n(Z) \nRecords \nused (Z) \n B(Δ)IDC \n(H) \n0-20 -0.67 0.38 1  -0.76 0.43 1  -1.20 \n20-40 -0.26 0.13 9  -0.30 0.13 9  -0.79 \n40-60 0.19 0.10 16  0.20 0.10 15  -0.34 \n60-80 0.27 0.10 16  0.34 0.10 15  -0.26 \n80-100 0.25 0.09 19  0.28 0.10 17  -0.28 \n100-120 0.40 0.08 26  0.35 0.09 24  -0.13 \n120-140 0.42 0.08 31  0.43 0.08 30  -0.11 \n140-160 0.57 0.07 32  0.62 0.08 30  0.04 \n160-180 0.68 0.07 33  0.72 0.08 32  0.15 \n180-200 0.73 0.10 15  0.79 0.10 14  0.20 \n200-220 0.94 0.07 41  0.88 0.07 41  0.41 \n220-240 1.01 0.08 26  0.99 0.08 26  0.48 \n240-260 1.06 0.09 21  1.02 0.09 21  0.53 \n260-280 1.17 0.09 18  1.15 0.09 18  0.64 \n280-300 1.21 0.10 14  1.16 0.11 12  0.68 \n300-320 1.29 0.09 16  1.24 0.10 14  0.76 \n320-340 1.34 0.10 12  1.33 0.11 11  0.81 \n340-360 1.52 0.11 11  1.47 0.12 10  0.99 \n360-380 1.49 0.14 7  1.49 0.14 7  0.96 \n380-400 1.55 0.16 5  1.49 0.18 4  1.02 \n400-420 1.75 0.17 4  1.57 0.21 3  1.22 \n420-440 1.77 0.16 5  1.69 0.17 5  1.24 \n440-460 1.72 0.20 3  1.55 0.20 3  1.19 \n460-480 1.73 0.34 1  1.81 0.35 1  1.20 \n480-500 1.83 0.17 4  1.77 0.18 4  1.30 \n500-520 1.81 0.51 1  1.87 0.25 2  1.28 \n520-540 1.94 0.24 3      1.41 \n540-560 2.05 0.35 1  1.97 0.37 1  1.52 \n560-580 1.97 0.20 3  2.07 0.21 3  1.44 \n580-600 2.19 0.24 2  2.12 0.25 2  1.66 \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \nTable 4. Comparison of Richter local magnitudes MLR and MLHB and their standard deviations \n(S.D.) for all earthquakes used in the determination of station and distance corrections, for \nhorizontal (H) and vertical (Z) component amplitude data. \n \nEvt.DateTime \n \nMLR \n(H) \nS.D. MLR \n(Z) \nS.D. MLHB \n(H) \nS.D. MLHB \n(Z) \nS.D. \n9603072341 3.54 0.1 3.35 0.15 3.4 0.23 3.32 0.16 \n9604211828 2.22 0.13 1.81 0.15 2.07 0.13 1.76 0.17 \n9605060349 2.93 0.14 2.69 0.14 2.8 0.23 2.58 0.18 \n9605182101 3.2 0.13 3.03 0.15 3.13 0.14 3 0.2 \n9609200404 2.88 0.15 2.71 0.19 2.87 0.27 2.72 0.2 \n9610150542 1.88 0.24 1.78 0.23 1.75 0.28 1.6 0.12 \n9702042212 2.62 0.12 2.46 0.16 2.56 0.17 2.43 0.16 \n9702102309 2.77 0.11 2.5 0.06 2.81 0.18 2.48 0.08 \n9705172149 2.28 0.1 2.04 0.08 2.11 0.11 1.91 0.2 \n9707300834 2.84 0.15 2.65 0.2 2.75 0.23 2.58 0.31 \n9708261957 2.76 0.17 2.57 0.16 2.66 0.28 2.48 0.21 \n9710190242 2.5 0.07 2.26 0.18 2.51 0.16 2.28 0.15 \n9711080446 2.47 0.14 2.21 0.11 2.42 0.22 2.23 0.19 \n9802080551 2.34 0.09 2.18 0.09 2.28 0.18 2.16 0.11 \n9802171426 2.32 0.12 2.15 0.15 2.3 0.26 2.03 0.23 \n9803262051 2.69 0.14 2.45 0.15 2.56 0.29 2.34 0.34 \n9805030212 3.61 0.13 3.44 0.15 3.55 0.17 3.39 0.16 \n9805311255 2.53 0.07 2.29 0.07 2.44 0.1 2.25 0.16 \n9807200738 2.69 0.07 2.44 0.06 2.63 0.17 2.4 0.08 \n9807210716 2.17 0.14 1.91 0.14 2 0.21 1.76 0.2 \n9807311055 2.09 0.15 1.9 0.11 2.12 0.2 1.85 0.13 \n9808082207 2.05 0.17 1.91 0.17 2 0.24 1.81 0.2 \n9809150232 2.42 0.18 2.23 0.11 2.2 0.17 2.08 0.11 \n9901211110 2.99 0.11 2.78 0.12 2.97 0.24 2.78 0.13 \n9903040016 3.71 0.08 3.5 0.13 3.69 0.24 3.49 0.16 \n9906170220 2.7 0.06 2.47 0.07 2.66 0.18 2.45 0.12 \n9909010500 3.22 0.14 3.07 0.09 3.14 0.17 3.04 0.11 \n9910020350 2.59 0.17 2.42 0.09 2.54 0.27 2.35 0.18 \n9910251915 3.73 0.16 3.5 0.12 3.61 0.23 3.44 0.13 \n0002120851 3.03 0.19 2.91 0.19 2.95 0.29 2.83 0.29 \n0004240510 2.64 0.16 2.45 0.12 2.52 0.23 2.35 0.19 \n0006221436 2.65 0.08 2.54 0.12 2.59 0.14 2.51 0.09 \n0008080246 2.45 0.21 2.32 0.21 2.43 0.3 2.31 0.23 \n0009230423 3.84 0.11 3.55 0.08 3.84 0.22 3.56 0.13 \n0102251239 2.2 0.13 1.99 0.11 2.18 0.12 1.93 0.11 \n0105130826 3.27 0.19 3.09 0.21 3.15 0.27 2.98 0.38 \n0105312342 3.74 0.12 3.47 0.15 3.66 0.18 3.43 0.12 \n0110281625 4.02 0.1 3.81 0.14 3.98 0.23 3.82 0.22 \n0209222353 4.54 0.19 4.45 0.14 4.6 0.3 4.54 0.12 \n0210211141 3.85 0.13 3.74 0.16 3.81 0.22 3.74 0.19 \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \nTable 5.  Comparison of local magnitude MLR and mbIDCML (equivalent to IDC mb) with mb \nmagnitudes estimated by IDC, NEIC, ISC and mb* derived by measurement (Jacob & Neilson, \n1977) and from MLR (Neilson and Burton, 1985). \n \nNo. Date Time Lat. Long. MLR mbIDCML mbIDC mbNEIC mbISC mb*JN mb*NB \n1 23\/09\/00 04:23 52.280 -1.610 3.8 3.3 3.3  3.3 3.4 3.6 \n2 08\/12\/00 05:54 59.944  1.934 4.9 4.4 4.3 4.7 4.7 4.0 4.4 \n3 14\/03\/01 22:20 58.252  0.695 3.4 2.9 3.2 3.3 3.2 3.5 3.1 \n4 07\/05\/01 09:43 56.596  3.248 4.0 3.4 3.6 3.8 3.9 3.3 3.8 \n5 31\/05\/01 23:42 50.977 -4.531 3.7 3.2 3.6  3.6 3.3 3.5 \n6 28\/10\/01 16:25 52.846 -0.856 4.0 3.5 3.7 4.2  3.8 3.8 \n7 14\/02\/02 19:00 59.793  2.536 4.1 3.6  3.9 4.0 4.0 3.8 \n8 22\/09\/02 23:53 52.520 -2.150 4.5 4.0 4.0 4.8 4.5 3.8 4.4 \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \nFigure 1. Map showing propagation paths between earthquakes (black dots) and three-\ncomponent UK seismometer stations (triangles), corresponding to the seismograms used in the \nanalysis of variance study.\nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \n \n \n \n-1.5\n-1.0\n-0.5\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0 200 400 600\nDistance (km)\nLo\ng \n(A\nm\np)\n \nH\nZ\n \nFigure 2.   Amplitude-distance variation of shear-waves in the UK region, from mean maximum \namplitudes in horizontal (H) and vertical (Z) component records. The 95% confidence limits at \neach 20km distance interval are indicated for the H values by horizontal bars. \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \n \n \n \n \n-1.5\n-1.0\n-0.5\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n0 100 200 300 400 500 600\nDistance (km)\nC\nor\nre\nct\nio\nn \nto\n L\nog\n(A\nm\np)\nR(H)\nR(Z)\nHB\n \n \nFigure 3.   Comparison of distance corrections B(Δ)HB , and B(Δ)R for horizontal (H) and vertical \n(Z) amplitude measurements with associated 95% confidence error bars for H corrections,  for \nthe distance range 0 – 600km. \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \n1\n2\n3\n4\n5\n1 2 3 4 5\nMLR(H)\nM\nLH\nB\n \nFigure 4.  Comparison of MLR(H) and MLHB for the earthquakes used for the analysis of \nvariance study (values given in Table 5). The straight line fit to the data has a slope of 1.02 and \nan intercept of -0.14. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n \n1\n2\n3\n4\n5\n1 2 3 4 5\nMLR(Z)\nM\nLR\n(H\n)\n \n \nFigure 5. Comparison of MLR(H) and MLR(Z) for the earthquakes used for the analysis of \nvariance study (values given in Table 5). The straight line fit to the data has a slope of 0.98 and \nan intercept of 0.25. \n \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n0 0.5 1 1.5 2 2.5 3 3.5\nDistance (degrees)\nlo\ng \nA\n \nFigure 6.  Decay of log (Amplitude) with distance after correction for the effects of geometrical \nspreading, following Nuttli (1973). The straight line fit to the data has a slope of -0.29 and an \nintercept of 1.00. \nGeophys.J. Int. (2007) XXX, 000-000 \n  \n  \n \n"}