{"doi":"10.1016\/j.hrmr.2008.09.001","coreId":"95565","oai":"oai:eprints.lse.ac.uk:25224","identifiers":["oai:eprints.lse.ac.uk:25224","10.1016\/j.hrmr.2008.09.001"],"title":"Making the link between work-life balance practices and organizational performance","authors":["Beauregard, T. Alexandra","Henry, Lesley C."],"enrichments":{"references":[{"id":17242609,"title":"Added benefits: The link between work-life benefits and organizational citizenship behavior.","authors":[],"date":"2000","doi":"10.2307\/1556411","raw":"Lambert, S. J. (2000). Added benefits: The link between work-life benefits and organizational citizenship behavior. Academy of Management Journal, 43 (5), 801-815.","cites":null},{"id":17242484,"title":"All in a day's work: Boundaries and micro role transitions.","authors":[],"date":"2000","doi":"10.2307\/259305","raw":"Ashforth, B. E., Kreiner, G. E., & Fugate, M. (2000). All in a day's work: Boundaries and micro role transitions. Academy of Management Review, 25(3), 472-491.","cites":null},{"id":17242550,"title":"An examination of the perceived impact of flexible work arrangements on professional opportunities in public accounting.","authors":[],"date":"2001","doi":null,"raw":"Cohen, J. R., & Single, L. E. (2001). An examination of the perceived impact of flexible work arrangements on professional opportunities in public accounting. Journal of Business Ethics, 32, 317-328.","cites":null},{"id":17242600,"title":"Antecedents and outcomes of work-life conflict among employed women and men in Finland. Human Relations,","authors":[],"date":"1998","doi":"10.1177\/001872679805100203","raw":"Kinnunen, U. & Mauno, S. (1998). Antecedents and outcomes of work-life conflict among employed women and men in Finland. Human Relations, 51(2), 157-177.","cites":null},{"id":17242482,"title":"Antecedents and outcomes of work-life conflict among married professional women: Evidence from Singapore. Human Relations,","authors":[],"date":"1992","doi":"10.1177\/001872679204500804","raw":"Aryee, S. (1992). Antecedents and outcomes of work-life conflict among married professional women: Evidence from Singapore. Human Relations, 45(8), 813-837.","cites":null},{"id":17242693,"title":"Are “family-supportive” employer policies relevant to men? In","authors":[],"date":"1993","doi":null,"raw":"Pleck, J. H. (1993). Are “family-supportive” employer policies relevant to men? In J. C. Hood (Ed.), Men, Work, and Family: 217-237. Newbury Park, CA: Sage.","cites":null},{"id":17242594,"title":"Attitudes to flexible working and family life.","authors":[],"date":"2003","doi":null,"raw":"Houston, D. M., & Waumsley, J. A. (2003). Attitudes to flexible working and family life. York: JRF Policy Press.","cites":null},{"id":17242579,"title":"Attractiveness of child care and related employer-supported benefits and policies to married and single parents.","authors":[],"date":"1989","doi":"10.1007\/bf01086798","raw":"Goldberg, W. A., Greenberger, E., Koch-Jones, J., O’Neil, R., & Hamill, S. (1989). Attractiveness of child care and related employer-supported benefits and policies to married and single parents. Child and Youth Care Quarterly, 18, 23-37.","cites":null},{"id":17242496,"title":"Balancing employment and fatherhood: A systems perspective.","authors":[],"date":"1997","doi":"10.1177\/019251397018004002","raw":"Berry, J. O., & Rao, J. M.  (1997).  Balancing employment and fatherhood: A systems perspective.  Journal of Family Issues, 18, 386-402.                                                  Work-Life Practices and Organizational Performance 38 Blau, P. (1964). Exchange and power in social life. New York: Wiley.","cites":null},{"id":17242715,"title":"Best-evidence synthesis: An alternative to meta-analytic and traditional reviews.","authors":[],"date":"1986","doi":"10.3102\/0013189x015009005","raw":"Slavin, R.E. (1986). Best-evidence synthesis: An alternative to meta-analytic and traditional reviews. Educational Researcher, 15(9), 5-11.","cites":null},{"id":17242607,"title":"Bridging the work-family policy and productivity gap: A literature review.","authors":[],"date":"1999","doi":"10.1080\/13668809908414247","raw":"Kossek, E. E., & Ozeki, C. (1999). Bridging the work-family policy and productivity gap: A literature review. Community, Work and Family, 2(1), 7-32.","cites":null},{"id":17242619,"title":"Changing equality cultures to move beyond “women’s problems”.","authors":[],"date":"1997","doi":"10.1111\/1468-0432.00022","raw":"Liff, S., & Cameron, I. (1997). Changing equality cultures to move beyond “women’s problems”. Gender, Work and Organization, 4(1), 35-46.","cites":null},{"id":17242731,"title":"Child care assistance can improve employee attitudes and behavior.","authors":[],"date":"1984","doi":null,"raw":"Youngblood, S., & Chambers-Cook, K. (1984). Child care assistance can improve employee attitudes and behavior. Personnel Administrator, 29, 45-47. Figure 1: Model of proposed relationships between the provision of work-life balance practices and organizational performance Organizational worklife climate \/ Managerial support National context Gender; job level Provision of work-life balance practices Use of practices Longer work hours; increased control; more effort Lower wages; more investment Individual differences Anticipated organizational support Perceived organizational support Reduced work-life conflict Improved productivity Cost savings Improved retention Improved recruitment Organizational performance Organizational citizenship behaviour Individual-level explanations Improved job-related attitudes Organization-level explanations","cites":null},{"id":17242601,"title":"Consequences of work-home segmentation or integration: a person-environment fit perspective.","authors":[],"date":"2006","doi":"10.1002\/job.386","raw":"Kleiner, G. E. (2006). Consequences of work-home segmentation or integration: a person-environment fit perspective. Journal of Organizational Behavior, 27, 485-507.                                                   Work-Life Practices and Organizational Performance 45 Kodz, J., Harper, H., & Dench, S. (2002). Work-life balance: Beyond the rhetoric. Institute for Employment Studies Report 384. London: IES.","cites":null},{"id":17242726,"title":"Considering the role of personality in the work-life experience: Relationships of the big five to work-life conflict and facilitation.","authors":[],"date":"2004","doi":"10.1016\/s0001-8791(03)00035-6","raw":"Wayne, J. H., Musisca, N., & Fleeson, W. (2004). Considering the role of personality in the work-life experience: Relationships of the big five to work-life conflict and facilitation. Journal of Vocational Behavior, 64(1), 108-130.","cites":null},{"id":17242695,"title":"Constructing pluralistic work and career arrangements.","authors":[],"date":"1996","doi":"10.4135\/9781446280201.n10","raw":"Raabe, P. H. (1996). Constructing pluralistic work and career arrangements. In S. Lewis & J. Lewis (Eds.), The work-life challenge: Rethinking employment (pp. 128-141). London: Sage.","cites":null},{"id":17242574,"title":"Coverage and effectiveness of family-responsive workplace policies.","authors":[],"date":"2002","doi":"10.1016\/s1053-4822(02)00063-3","raw":"Glass, J. L., & Finley, A. (2002). Coverage and effectiveness of family-responsive workplace policies. Human Resource Management Review, 12, 313-337.","cites":null},{"id":17242623,"title":"Daily consequences of work interference with family and family interference with work.","authors":[],"date":"1994","doi":"10.1080\/02678379408259996","raw":"MacEwen, K. E., & Barling, J. (1994). Daily consequences of work interference with family and family interference with work. Work and Stress, 8, 244-254.","cites":null},{"id":17242665,"title":"Day care and selected employee work behaviors.","authors":[],"date":"1976","doi":"10.2307\/255451","raw":"Milkovich, G. T., & Gomez, L. R. (1976). Day care and selected employee work behaviors. Academy of Management Journal, 19(1), 111-115.","cites":null},{"id":17242565,"title":"Developing and testing an integrative model of the work-life interface.","authors":[],"date":"1997","doi":"10.1006\/jvbe.1996.1577","raw":"Frone, M. R., Yardley, J. K., & Markel, K. S. (1997). Developing and testing an integrative model of the work-life interface. Journal of Vocational Behavior, 50, 145-167.","cites":null},{"id":17242670,"title":"Development and validation of work-family conflict and family-work conflict scales.","authors":[],"date":"1996","doi":"10.1037\/0021-9010.81.4.400","raw":"Netemeyer, R. G., Boles, J. S., & McMurrian, R. (1996). Development and validation of work-family conflict and family-work conflict scales. Journal of Applied Psychology, 81(4), 400-410.","cites":null},{"id":17242558,"title":"Effects of family-friendly policies on business performance (Working Paper No. 22). Cambridge:","authors":[],"date":"2001","doi":null,"raw":"Dex, S., Smith, C., & Winter, S. (2001). Effects of family-friendly policies on business performance (Working Paper No. 22). Cambridge: University of Cambridge, Judge Institute of Management.","cites":null},{"id":17242593,"title":"Effects of public and private policies on return to work after childbirth.","authors":[],"date":"1996","doi":"10.1177\/0730888496023004004","raw":"Hofferth, S. L. (1996). Effects of public and private policies on return to work after childbirth. Work and Occupations, 23, 378-404.                                                  Work-Life Practices and Organizational Performance 44 Honeycutt, T. L., & Rosen, B. (1997). Family friendly human resource policies, salary levels, and salient identity as predictors of organizational attraction. Journal of Vocational Behavior, 50, 271-290.","cites":null},{"id":17242730,"title":"Employed carers and family-friendly employment policies. London: Joseph Rowntree Foundation","authors":[],"date":"2002","doi":null,"raw":"Yeandle, S., Crompton, R., Wigfield, A., & Dennett, J. (2002). Employed carers and family-friendly employment policies. London: Joseph Rowntree Foundation Policy Press.","cites":null},{"id":17242611,"title":"Employed parents' support from partners, employers, and friends.","authors":[],"date":"1998","doi":"10.1080\/00224549809600383","raw":"Lee, C. M., & Duxbury, L. (1998). Employed parents' support from partners, employers, and friends. Journal of Social Psychology, 138(3), 303-322.","cites":null},{"id":17242724,"title":"Employee benefits survey.","authors":[],"date":"2007","doi":null,"raw":"US Bureau of Labor (2007). Employee benefits survey. Retrieved 11 August 2007 from http:\/\/data.bls.gov\/cgi-bin\/surveymost.                                                   Work-Life Practices and Organizational Performance 50 Wang, P., & Walumbwa, F. O. (2007). Family-friendly programs, organizational commitment, and work withdrawal: The moderating role of transformational leadership. Personnel Psychology, 60, 397-427.","cites":null},{"id":17242688,"title":"Employee responses to flexible work schedules: An inter-organization, inter-system comparison.","authors":[],"date":"1982","doi":"10.1177\/014920638200800101","raw":"Pierce, J. L., & Newstrom, J. W. (1982). Employee responses to flexible work schedules: An inter-organization, inter-system comparison. Journal of Management, 8(1), 9-25.","cites":null},{"id":17242497,"title":"Employees’ use of work-family policies and the workplace social context. Social Forces,","authors":[],"date":"2002","doi":"10.1353\/sof.2002.0002","raw":"Blair-Loy, M., & Wharton, A. S. (2002). Employees’ use of work-family policies and the workplace social context. Social Forces, 80(3), 813-845.","cites":null},{"id":17242577,"title":"Employer supported child care, work\/family conflict, and absenteeism: A field study.","authors":[],"date":"1990","doi":"10.1111\/j.1744-6570.1990.tb00683.x","raw":"Goff, S. J., Mount, M. K., & Jamison, R. L. (1990). Employer supported child care, work\/family conflict, and absenteeism: A field study. Personnel Psychology, 43, 793-809.","cites":null},{"id":17242485,"title":"Employer-supported child care as a women-responsive policy.","authors":[],"date":"1990","doi":"10.1177\/019251390011004003","raw":"Auerbach, J. (1990). Employer-supported child care as a women-responsive policy.","cites":null},{"id":17242680,"title":"Factors related to supervisor work\/family sensitivity and flexibility.","authors":[],"date":"2002","doi":null,"raw":"Parker, L. B., & Allen, T. D. (2002, April). Factors related to supervisor work\/family sensitivity and flexibility. Paper presented at the Annual Conference of the Society for Industrial and Organizational Psychology, Toronto, Ontario.","cites":null},{"id":17242678,"title":"Family contributions to work commitment.","authors":[],"date":"1986","doi":"10.2307\/352043","raw":"Orthner, D. K., & Pittman, J. F. (1986). Family contributions to work commitment. Journal of Marriage and the Family, 48(3), 573-581.","cites":null},{"id":17242727,"title":"Family friendly policies: Distribution and implementation in Australian workplaces.","authors":[],"date":"1999","doi":"10.1177\/103530469901000205","raw":"Whitehouse, G., & Zetlin, D. (1999). Family friendly policies: Distribution and implementation in Australian workplaces. Economic and Labour Relations Review, 10(2), 221-239.","cites":null},{"id":17242613,"title":"Family Friendly’ employment policies: A route to changing organizational culture or playing about at the margins?","authors":[],"date":"1997","doi":"10.1111\/1468-0432.00020","raw":"Lewis, S. (1997). ‘Family Friendly’ employment policies: A route to changing organizational culture or playing about at the margins? Gender, Work and Organization, 4(1), 13-24.","cites":null},{"id":17242525,"title":"Family leave policies and devolution to the line.","authors":[],"date":"2003","doi":"10.1108\/00483480310454727","raw":"Bond, S., & Wise, S. (2003). Family leave policies and devolution to the line. Personnel Review, 32(1), 58-72.","cites":null},{"id":17242576,"title":"Family responsive policies and employee retention following childbirth.","authors":[],"date":"1998","doi":"10.1093\/sf\/76.4.1401","raw":"Glass, J. L., & Riley, L. (1998). Family responsive policies and employee retention following childbirth. Social Forces, 76(4), 1401-1435.","cites":null},{"id":17242729,"title":"Family-friendly management, organizational performance and social legitimacy.","authors":[],"date":"2008","doi":"10.1080\/09585192.2010.500484","raw":"Wood, S. J., & de Menezes, L.  (2008). Family-friendly management, organizational performance and social legitimacy. Mimeo, Sheffield: Institute of Work Psychology, University of Sheffield.","cites":null},{"id":17242567,"title":"Family-friendly policies, supervisor support, work-family conflict, and satisfaction: A test of a conceptual model.","authors":[],"date":"2004","doi":"10.1007\/s10869-004-0548-4","raw":"Frye, N. K., & Breaugh, J. A. (2004). Family-friendly policies, supervisor support, work-family conflict, and satisfaction: A test of a conceptual model. Journal of Business and Psychology, 19(2), 197-220.","cites":null},{"id":17242672,"title":"Family-responsive interventions, perceived organizational Work-Life Practices and Organizational Performance 47 and supervisor support, work-family conflict and psychological strain.","authors":[],"date":"2003","doi":"10.1037\/1072-5245.10.4.326a","raw":"O’Driscoll, M., Poelmans, S., Spector, P., Kalliath, T., Allen, T., Cooper, C., & Sanchez, J. (2003). Family-responsive interventions, perceived organizational                                                  Work-Life Practices and Organizational Performance 47 and supervisor support, work-family conflict and psychological strain. International Journal of Stress Management, 10(4), 326-344.","cites":null},{"id":17242483,"title":"Family-responsive variables and retentionrelevant outcomes among employed parents.","authors":[],"date":"1998","doi":"10.1177\/001872679805100105","raw":"Aryee, S., Luk, V., & Stone, R. (1998). Family-responsive variables and retentionrelevant outcomes among employed parents. Human Relations, 51(1), 73-87.","cites":null},{"id":17242476,"title":"Family-supportive work environments: The role of organizational perceptions.","authors":[],"date":"2001","doi":"10.1006\/jvbe.2000.1774","raw":"Allen, T. D. (2001). Family-supportive work environments: The role of organizational perceptions. Journal of Vocational Behavior, 58, 414-435.","cites":null},{"id":17242554,"title":"Father time: Flexible work arrangements and the law firm’s failure of the family.","authors":[],"date":"2001","doi":"10.2307\/1229496","raw":"Cunningham, K. (2001). Father time: Flexible work arrangements and the law firm’s failure of the family. Stanford Law Review, 53, 967-1008.","cites":null},{"id":17242591,"title":"Finding an extra day a week: The positive influence of perceived job flexibility on work and family life balance.","authors":[],"date":"2001","doi":"10.1111\/j.1741-3729.2001.00049.x","raw":"Hill, E. J., Hawkins, A. J., Ferris, M., & Weitzman, M. (2001). Finding an extra day a week: The positive influence of perceived job flexibility on work and family life balance. Family Relations, 50, 49-58.","cites":null},{"id":17242489,"title":"Flexible and compressed workweek schedules: A meta-analysis of their effects on work-related criteria.","authors":[],"date":"1999","doi":"10.1037\/\/0021-9010.84.4.496","raw":"Baltes, B. B., Briggs, T. E., Huff, J. W., Wright, J. A., & Neuman, G. A. (1999). Flexible and compressed workweek schedules: A meta-analysis of their effects on work-related criteria. Journal of Applied Psychology, 84(4), 496-513.","cites":null},{"id":17242713,"title":"Flexible work hours and productivity: Some evidence from the pharmaceutical industry,","authors":[],"date":"1996","doi":"10.1111\/j.1468-232x.1996.tb00398.x","raw":"Shepard, E., Clifton, T. & Kruse, D. (1996). Flexible work hours and productivity: Some evidence from the pharmaceutical industry, Industrial Relations, 35(1), January, 123-39.","cites":null},{"id":17242581,"title":"Flexible work schedules: What are we trading off to get them?","authors":[],"date":"2001","doi":null,"raw":"Golden, L. (2001). Flexible work schedules: What are we trading off to get them? Monthly Labor Review, 124(3), 50-67.","cites":null},{"id":17242557,"title":"Flexible working - the right to request and the duty to consider. Retrieved","authors":[],"date":"2007","doi":null,"raw":"Department of Trade and Industry (2007). Flexible working - the right to request and the duty to consider. Retrieved March 20, 2007, from http:\/\/www.dti.gov.uk\/employment\/employment-legislation\/employmentguidance\/page35662.html.","cites":null},{"id":17242478,"title":"Formal organizational initiatives and informal workplace practices: Links to work-life conflict and job-related outcomes.","authors":[],"date":"2002","doi":"10.1177\/014920630202800605","raw":"Anderson, S. E., Coffey, B. S., & Byerly, R. T. (2002). Formal organizational initiatives and informal workplace practices: Links to work-life conflict and job-related outcomes. Journal of Management, 28(6), 787-810.","cites":null},{"id":17242588,"title":"How time-flexible work policies can reduce stress, improve health, and save money.","authors":[],"date":"2005","doi":"10.1002\/smi.1049","raw":"Halpern, D. F. (2005). How time-flexible work policies can reduce stress, improve health, and save money. Stress and Health, 21(3), 157-168.","cites":null},{"id":17242595,"title":"Human Resources and Social Development Canada","authors":[],"date":"2006","doi":null,"raw":"Human Resources and Social Development Canada (2006). The business case for work-life balance. Retrieved December 1, 2006 from http:\/\/www.hrsdc.gc.ca\/en\/lp\/spila\/wlb\/16benefits_costs_businesscase.shtml.","cites":null},{"id":17242490,"title":"Human resources practices as predictors of worklife outcomes and employee turnover.","authors":[],"date":"2003","doi":"10.1111\/1468-232x.00287","raw":"Batt, R., & Valcour, P. M. (2003). Human resources practices as predictors of worklife outcomes and employee turnover. Industrial Relations, 42(2), 189-220.","cites":null},{"id":17242559,"title":"If you can use them: Flexibility policies, organizational commitment, and perceived performance.","authors":[],"date":"2003","doi":"10.1111\/1468-232x.00285","raw":"Eaton, S. C. (2003). If you can use them: Flexibility policies, organizational commitment, and perceived performance. Industrial Relations, 42(2), 145-167.","cites":null},{"id":17242592,"title":"Influences of the virtual office on aspects of work and work\/life balance.","authors":[],"date":"1998","doi":"10.1111\/j.1744-6570.1998.tb00256.x","raw":"Hill, E. J., Miller, B. C., Weiner, S. P., & Colihan, J. (1998). Influences of the virtual office on aspects of work and work\/life balance. Personnel Psychology, 51, 667-683.","cites":null},{"id":17242711,"title":"Integrating paid work and family work.","authors":[],"date":"2006","doi":"10.1080\/13668800600925027","raw":"Secret, M. (2006). Integrating paid work and family work. Community, Work and Family, 9(4), 407-427.","cites":null},{"id":17242534,"title":"Interactions between work-life balance practices and informal support: Differential effects on organizational commitments of men and women.","authors":[],"date":"2007","doi":null,"raw":"Butts, M. M., Ng, T. W. H., Vandenberg, R. J., Dejoy, D. M., & Wilson, M. G. (2007, April). Interactions between work-life balance practices and informal support: Differential effects on organizational commitments of men and women. Paper presented at the Society for Industrial and Organizational Psychology Conference, New York, NY.","cites":null},{"id":17242625,"title":"Investigating work-family policy aims and employee experiences.","authors":[],"date":"2005","doi":"10.1108\/01425450510612013","raw":"McDonald, P., Guthrie, D., Bradley, L., & Shakespeare-Finch, J. (2005). Investigating work-family policy aims and employee experiences. Employee Relations, 27(5), 478-494.","cites":null},{"id":17242597,"title":"Job and life attitudes of male executives.","authors":[],"date":"1994","doi":"10.1037\/\/0021-9010.79.5.767","raw":"Judge, T. A., Boudreau, J. W., & Bretz, R. D. (1994). Job and life attitudes of male executives. Journal of Applied Psychology, 79(5), 767-782.","cites":null},{"id":17242701,"title":"Job satisfaction and the parent worker: The role of flexibility and rewards.","authors":[],"date":"1994","doi":"10.1006\/jvbe.1994.1021","raw":"Rothausen, T. J. (1994). Job satisfaction and the parent worker: The role of flexibility and rewards. Journal of Vocational Behavior, 44(3), 317-336.","cites":null},{"id":17242598,"title":"Left behind? The impact of leaves of absence on managers’ career success.","authors":[],"date":"1999","doi":"10.2307\/256985","raw":"Judiesch, M. K., & Lyness, K. S. (1999). Left behind? The impact of leaves of absence on managers’ career success. Academy of Management Journal, 42(6), 641-651.","cites":null},{"id":17242686,"title":"Management as symbolic action: The creation and maintenance of organizational paradigms. In","authors":[],"date":"1981","doi":null,"raw":"Pfeffer, J. (1981). Management as symbolic action: The creation and maintenance of organizational paradigms. In L. L. Cummings and B. M. Staw (Eds.), Research in organizational behavior, vol. 3 (pp. 1-52). Greenwich, CT: JAI Press.","cites":null},{"id":17242498,"title":"Management practices, work-life balance, and productivity: A review of some recent evidence.","authors":[],"date":"2006","doi":"10.1093\/oxrep\/grj027","raw":"Bloom, N., & Van Reenan, J. (2006). Management practices, work-life balance, and productivity: A review of some recent evidence. Oxford Review of Economic Policy, 22(4), 457-482.","cites":null},{"id":17242694,"title":"Managerial decision making regarding alternative work arrangements.","authors":[],"date":"1999","doi":"10.1348\/096317999166482","raw":"Powell, G. N. & Mainiero, L. A. (1999). Managerial decision making regarding alternative work arrangements. Journal of Occupational and Organizational Psychology, 72, 41-56.                                                  Work-Life Practices and Organizational Performance 48 Premeaux, S. F., Adkins, C. L., & Mossholder, K. W. (2007). Balancing work and family: A field study of multi-dimensional, multi-role work-family conflict. Journal of Organizational Behavior, 28, 705-727.","cites":null},{"id":17242703,"title":"Managing multiple roles: Work-family policies and individuals’ desires for segmentation.","authors":[],"date":"2005","doi":"10.1287\/orsc.1050.0124","raw":"Rothbard, N. P., Phillips, K. W., & Dumas, T. L. (2005). Managing multiple roles: Work-family policies and individuals’ desires for segmentation. Organization Science, 16(3), 243-258.","cites":null},{"id":17242615,"title":"Managing work-family diversity for parents of disabled children: Beyond policy to practice and partnership.","authors":[],"date":"2000","doi":"10.1108\/00483480010324797","raw":"Lewis, S., Kagan, C., & Heaton, P. (2000). Managing work-family diversity for parents of disabled children: Beyond policy to practice and partnership.","cites":null},{"id":17242582,"title":"Narrative versus meta-analytic reviews of race differences in motivation: A comment on Cooper and Dorr.","authors":[],"date":"1995","doi":"10.3102\/00346543065004509","raw":"Graham, S. (1995). Narrative versus meta-analytic reviews of race differences in motivation: A comment on Cooper and Dorr. Review of Educational Research, 65(4), 509-514.","cites":null},{"id":17242499,"title":"Organization-level determinants of women in management.","authors":[],"date":"1994","doi":"10.2307\/256829","raw":"Blum, T. C., Fields, D. L., & Goodman, J. S. (1994). Organization-level determinants of women in management. Academy of Management Journal, 37(2), 241-268.","cites":null},{"id":17242723,"title":"Organizational attractiveness: An interactionist perspective.","authors":[],"date":"1993","doi":"10.1037\/\/0021-9010.78.2.184","raw":"Turban, D. B., & Keon, T. L. (1993). Organizational attractiveness: An interactionist perspective. Journal of Applied Psychology, 78(2), 184-193.","cites":null},{"id":17242480,"title":"Organizations and the intersection of work and family: A comparative perspective. In","authors":[],"date":"2006","doi":"10.1093\/oxfordhb\/9780199299249.003.0004","raw":"Appelbaum, E., Bailey, T., Berg, P., & Kalleberg, A. L. (2006). Organizations and the intersection of work and family: A comparative perspective. In S. Ackroyd, P. Thompson, P. Tolbert, & R. Batt (Eds.), The Oxford handbook of work and organizations (pp. 52-73). Oxford: Oxford University Press.","cites":null},{"id":17242728,"title":"Outcomes of reduced load work arrangements at managerial and professional levels: Perspectives from multiple stakeholders. Paper presented at the Annual Meeting of the Academy of Management,","authors":[],"date":"2000","doi":null,"raw":"Williams, M. L., Ford, L. R., Dohring, P. L., Lee, M. D., & MacDermid, S. M. (2000, August). Outcomes of reduced load work arrangements at managerial and professional levels: Perspectives from multiple stakeholders. Paper presented at the Annual Meeting of the Academy of Management, Toronto, ON.","cites":null},{"id":17242477,"title":"Parental leave of absence: Some not so family friendly implications.","authors":[],"date":"1999","doi":"10.1111\/j.1559-1816.1999.tb01380.x","raw":"Allen, T. D., & Russell, J. E. (1999). Parental leave of absence: Some not so family friendly implications. Journal of Applied Social Psychology, 29(1), 166-191.","cites":null},{"id":17242667,"title":"Politics, lack of career progress, and work\/home conflict: Stress and strain for working women. Sex Roles,","authors":[],"date":"1990","doi":"10.1007\/bf00289864","raw":"Nelson, D. L., Quick, J. C., Hitt, M. A., & Moesel, D. (1990). Politics, lack of career progress, and work\/home conflict: Stress and strain for working women. Sex Roles, 23(3\/4), 169-185.","cites":null},{"id":17242492,"title":"Predicting interference between work and home: A comparison of dispositional and situational antecedents.","authors":[],"date":"2006","doi":"10.1108\/02683940610659588","raw":"Beauregard, T. A. (2006). Predicting interference between work and home: A comparison of dispositional and situational antecedents. Journal of Managerial Psychology, 21(3), 244-264.","cites":null},{"id":17242491,"title":"Productivity and wage effects of “family-friendly” fringe benefits.","authors":[],"date":"2003","doi":"10.1108\/01437720310479723","raw":"Baughman, R., DiNardi, D., & Holtz-Eakin, D. (2003). Productivity and wage effects of “family-friendly” fringe benefits. International Journal of Manpower, 24(3), 247-259.","cites":null},{"id":17242587,"title":"Promoting work\/family balance: An organization change approach.","authors":[],"date":"1990","doi":"10.1016\/0090-2616(90)90060-3","raw":"Hall, D.T.  (1990).  Promoting work\/family balance: An organization change approach.  Organizational Dynamics, 18, 3, 5-18.","cites":null},{"id":17242705,"title":"Psychological contracts in organizations: Understanding written and unwritten agreements. Thousand Oaks,","authors":[],"date":"1995","doi":"10.4135\/9781452231594","raw":"Rousseau, D. M. (1995). Psychological contracts in organizations: Understanding written and unwritten agreements. Thousand Oaks, CA: Sage.","cites":null},{"id":17242682,"title":"Putting the work back into work\/family.","authors":[],"date":"1995","doi":"10.1177\/1059601195202009","raw":"Perlow, L. A. (1995). Putting the work back into work\/family. Group and Organization Management, 20, 227-239.","cites":null},{"id":17242590,"title":"Reactions to injustice: Factors affecting workers’ resentment toward family-friendly policies.","authors":[],"date":"2002","doi":"10.2307\/3090109","raw":"Hegtvedt, K., Clay-Warner, J., & Ferrigno, E. (2002). Reactions to injustice: Factors affecting workers’ resentment toward family-friendly policies. Social Psychology Quarterly, 65(4), 386-400.","cites":null},{"id":17242528,"title":"Reflexive fathers: Negotiating parental leave and working life.","authors":[],"date":"2002","doi":"10.1111\/1468-0432.00155","raw":"Brandth, B., & Kvande, E. (2002). Reflexive fathers: Negotiating parental leave and working life. Gender, Work and Organization, 9(2), 186-203.","cites":null},{"id":17242481,"title":"Share price reactions to work-family human resource decisions: An institutional perspective.","authors":[],"date":"2003","doi":"10.2307\/30040641","raw":"Arthur, M. M. (2003). Share price reactions to work-family human resource decisions: An institutional perspective. Academy of Management Journal, 46, 497-505.","cites":null},{"id":17242585,"title":"Sources of work-family conflict among two-career couples.","authors":[],"date":"1989","doi":"10.1016\/0001-8791(89)90010-9","raw":"(1989). Sources of work-family conflict among two-career couples. Journal of Vocational Behavior, 34(2), 133-153.","cites":null},{"id":17242552,"title":"Stress and strain from family roles and work-role expectations.","authors":[],"date":"1984","doi":"10.1037\/\/0021-9010.69.2.252","raw":"Cooke, R. A., & Rousseau, D. M. (1984). Stress and strain from family roles and work-role expectations. Journal of Applied Psychology, 69(2), 252-260.                                                  Work-Life Practices and Organizational Performance 40 Cooper, C. D., & Kurland, N. B. (2002). Telecommuting, professional isolation, and employee development in public and private organizations. Journal of Organizational Behavior, 23, 511-532.","cites":null},{"id":17242542,"title":"Supervisor referrals to work-family programs.","authors":[],"date":"2004","doi":"10.1037\/1076-8998.9.2.136","raw":"Casper, W. J., Fox, K. E., Sitzmann, T. M., & Landy, A. L. (2004). Supervisor referrals to work-family programs. Journal of Occupational Health Psychology, 9, 136-151.","cites":null},{"id":17242562,"title":"Telecommuting as a workplace alternative: An identification of significant factors at home in American firms’ determination of work-at-home policies.","authors":[],"date":"1993","doi":"10.1016\/0963-8687(93)90028-9","raw":"Frolick, M. N., Wilkes, R. B., & Urwiler, R. (1993). Telecommuting as a workplace alternative: An identification of significant factors at home in American firms’ determination of work-at-home policies. Journal of Strategic Information Systems, 2, 206-222.","cites":null},{"id":17242603,"title":"Telecommuting, control, and boundary management: Correlates of policy use and practice, job control, and work–family effectiveness.","authors":[],"date":"2006","doi":"10.1016\/j.jvb.2005.07.002","raw":"Kossek, E. E., Lautsch, B. A., & Eaton, S. C. (2006). Telecommuting, control, and boundary management: Correlates of policy use and practice, job control, and work–family effectiveness. Journal of Vocational Behavior, 68(2), 347-367.","cites":null},{"id":17242571,"title":"The","authors":[],"date":"1998","doi":"10.1023\/a:1016673911881","raw":"Galinsky, E., & Bond, J. T. (1998). The 1998 Business Work-Life Study: A sourcebook. New York: Families and Work Institute.                                                  Work-Life Practices and Organizational Performance 42 Galinsky, E., & Morris, A. (1993). Employers and child care. Pediatrics, 91(1), 209-217.","cites":null},{"id":17242479,"title":"The alternative workplace: Changing where and how people work.","authors":[],"date":"1998","doi":null,"raw":"Apgar, M. (1998). The alternative workplace: Changing where and how people work. Harvard Business Review, 76, 121-136.","cites":null},{"id":17242536,"title":"The ecology of the mobile workplace: Influence of household composition and home workspace on satisfaction, stress, and effectiveness.","authors":[],"date":"1995","doi":null,"raw":"Callentine, L. U. (1995). The ecology of the mobile workplace: Influence of household composition and home workspace on satisfaction, stress, and effectiveness.","cites":null},{"id":17242548,"title":"The effect of alternative work schedules on employee performance.","authors":[],"date":"2006","doi":null,"raw":"Chow, I. H., & Keng-Howe, I. C. (2006). The effect of alternative work schedules on employee performance. International Journal of Employment Studies, 14(1), 105-130.","cites":null},{"id":17242604,"title":"The effects of on-site child care on employee attitudes and performance.","authors":[],"date":"1992","doi":"10.1111\/j.1744-6570.1992.tb00857.x","raw":"Kossek, E. E., & Nichol, V. (1992). The effects of on-site child care on employee attitudes and performance. Personnel Psychology, 45, 485-509.","cites":null},{"id":17242572,"title":"The family responsive workplace.","authors":[],"date":"1997","doi":"10.1146\/annurev.soc.23.1.289","raw":"Glass, J., & Estes, S. (1997). The family responsive workplace. Annual Review of Sociology, 23, 289-313.","cites":null},{"id":17242569,"title":"The good, the bad, and the unknown about telecommuting: Meta-analysis of psychological mediators and individual consequences.","authors":[],"date":"2007","doi":"10.1037\/0021-9010.92.6.1524","raw":"Gajendran, R. S., & Harrison, D. A. (2007). The good, the bad, and the unknown about telecommuting: Meta-analysis of psychological mediators and individual consequences. Journal of Applied Psychology, 92(6), 1524-1541.","cites":null},{"id":17242717,"title":"The home as a workplace: Workfamily interaction and psychological well-being in telework.","authors":[],"date":"1999","doi":"10.1037\/\/1076-8998.4.4.368","raw":"Standen, P., Daniels, K., & Lamond, D. (1999). The home as a workplace: Workfamily interaction and psychological well-being in telework. Journal of Occupational Health Psychology, 4(4), 368-381.","cites":null},{"id":17242556,"title":"The impact of flexible scheduling on employee attendance and turnover.","authors":[],"date":"1990","doi":"10.2307\/2393395","raw":"Dalton, D. R., & Mesch, D. J. (1990). The impact of flexible scheduling on employee attendance and turnover. Administrative Science Quarterly, 35, 370-387.","cites":null},{"id":17242699,"title":"The impact of utilizing a flexible work schedule on the perceived career advancement potential of women.","authors":[],"date":"2004","doi":"10.1002\/hrdq.1089","raw":"Rogier, S.A., & Padgett, M. Y.  (2004).  The impact of utilizing a flexible work schedule on the perceived career advancement potential of women.  Human Resource Development Quarterly, 15, 89-106.","cites":null},{"id":17242602,"title":"The impact of work-life programs on firm productivity.","authors":[],"date":"2000","doi":"10.1002\/1097-0266(200012)21:12<1225::aid-smj135>3.3.co;2-v","raw":"Konrad, A., & Mangel, R. (2000). The impact of work-life programs on firm productivity. Strategic Management Journal, 21(12), 1225-1237.","cites":null},{"id":17242596,"title":"The relationship between work\/family benefits and earnings: A test of competing predictions.","authors":[],"date":"1995","doi":"10.1016\/1053-5357(95)90003-9","raw":"Johnson, N., & Provan, K. (1995). The relationship between work\/family benefits and earnings: A test of competing predictions. Journal of Socio-Economics, 24(4), 571-584.","cites":null},{"id":17242697,"title":"The relationship between worklife policies and practices and employee loyalty: A life course perspective.","authors":[],"date":"2001","doi":null,"raw":"Roehling, P. V., Roehling, M. V., & Moen, P. (2001). The relationship between worklife policies and practices and employee loyalty: A life course perspective. Journal of Family and Economic Issues, 22(2), 141-170.","cites":null},{"id":17242493,"title":"The relative contribution of formal and informal organizational work-family support.","authors":[],"date":"2005","doi":"10.1016\/j.jvb.2004.02.004","raw":"Behson, S.J. (2005). The relative contribution of formal and informal organizational work-family support. Journal of Vocational Behavior, 66(3), 487-500.","cites":null},{"id":17242530,"title":"The role of human resource systems in job applicant decision processes.","authors":[],"date":"1994","doi":"10.1177\/014920639402000301","raw":"Bretz, R. D., & Judge, T. A. (1994). The role of human resource systems in job applicant decision processes. Journal of Management, 20(3), 531-551.","cites":null},{"id":17242719,"title":"Unbinding time: Alternate work schedules and work-life balance.","authors":[],"date":"2001","doi":null,"raw":"Tausig, M., & Fenwick, R. (2001). Unbinding time: Alternate work schedules and work-life balance. Journal of Family and Economic Issues, 22(2), 101-119.","cites":null},{"id":17242589,"title":"Understanding the work-life conflict of never-married women without children.","authors":[],"date":"2006","doi":"10.1108\/09649420610676208","raw":"Hamilton, E. A., Gordon, J. R., & Whelan-Berry, K. S. (2006). Understanding the work-life conflict of never-married women without children. Women in Management Review, 21(5), 393-415.","cites":null},{"id":17242487,"title":"Unexpected connections: Considering employees’ personal lives can revitalise your business.","authors":[],"date":"1997","doi":null,"raw":"Bailyn, L., Fletcher, J. K., & Kolb, D. (1997). Unexpected connections: Considering employees’ personal lives can revitalise your business. Sloan Management Review, 38, 11-19.","cites":null},{"id":17242488,"title":"What is family friendly about the workplace in the home? The case of self-employed parents and their children.","authors":[],"date":"2003","doi":"10.1111\/1468-005x.00123","raw":"Baines, S., & Gelder, U. (2003). What is family friendly about the workplace in the home? The case of self-employed parents and their children. New Technology, Work and Employment, 18(3), 223-234.","cites":null},{"id":17242721,"title":"When work-life benefits are not enough: The influence of work-life culture on benefit utilization, organizational attachment, and work-life conflict.","authors":[],"date":"1999","doi":"10.1006\/jvbe.1998.1681","raw":"Thompson, C. A., Beauvais, L. L., & Lyness, K. S. (1999). When work-life benefits are not enough: The influence of work-life culture on benefit utilization, organizational attachment, and work-life conflict. Journal of Vocational Behavior, 54, 392-415.","cites":null},{"id":17242586,"title":"Who appreciates family-responsive human resource policies: The impact of family-friendly policies on the organizational attachment of parents and non-parents.","authors":[],"date":"1995","doi":"10.1111\/j.1744-6570.1995.tb01757.x","raw":"Grover, S. L., & Crooker, K. J. (1995). Who appreciates family-responsive human resource policies: The impact of family-friendly policies on the organizational attachment of parents and non-parents. Personnel Psychology, 48, 271-288.","cites":null},{"id":17242725,"title":"Who is a good organizational citizen? Social perception of male and female employees who use family leave.","authors":[],"date":"2003","doi":null,"raw":"Wayne, J. H., & Cordeiro, B.L.  (2003).  Who is a good organizational citizen?  Social perception of male and female employees who use family leave.  Sex Roles, 49, 233-246.","cites":null},{"id":17242546,"title":"Women-friendly HRM and organizational commitment: A study among women and men of organizations in Hong Kong.","authors":[],"date":"1999","doi":"10.1348\/096317999166806","raw":"Chiu, W. C. K., & Ng, C. W. (1999). Women-friendly HRM and organizational commitment: A study among women and men of organizations in Hong Kong. Journal of Occupational and Organizational Psychology, 72, 485-502.","cites":null},{"id":17242584,"title":"Work and family influences on departure from public accounting.","authors":[],"date":"1997","doi":"10.1006\/jvbe.1996.1578","raw":"Greenhaus, J. H., Collins, K. M., Singh, R., & Parasuraman, S. (1997). Work and family influences on departure from public accounting. Journal of Vocational Behavior, 50, 249-270.                                                   Work-Life Practices and Organizational Performance 43 Greenhaus, J. H., Parasuraman, S., Granrose, C. S., Rabinowitz, S., & Beutell, N. J.","cites":null},{"id":17242560,"title":"Work and family research in IO\/OB: Content analysis and review of the literature (1980-2002).","authors":[],"date":"2005","doi":"10.1016\/j.jvb.2003.11.003","raw":"Eby, L. T., Casper, W. J., Lockwood, A., Bordeaux, C., & Brinley, A. (2005). Work and family research in IO\/OB: Content analysis and review of the literature (1980-2002). Journal of Vocational Behavior, 66, 124-197.","cites":null},{"id":17242709,"title":"Work-family balance and job satisfaction: The impact of family-friendly policies on attitudes of federal government employees.","authors":[],"date":"2001","doi":"10.1111\/0033-3352.00049","raw":"Saltzstein, A. L., Ting, Y., & Saltzstein, G. H. (2001). Work-family balance and job satisfaction: The impact of family-friendly policies on attitudes of federal government employees. Public Administration Review, 61(4), 452-467.                                                  Work-Life Practices and Organizational Performance 49 Scandura, T. A., & Lankau, M. J. (1997). Relationships of gender, family responsibility and flexible work hours to organizational commitment and job satisfaction. Journal of Organizational Behavior, 18, 377-391.","cites":null},{"id":17242605,"title":"Work-family conflict, policies, and the job-life satisfaction relationship: A review and directions for organizational behaviorHuman Resources research.","authors":[],"date":"1998","doi":"10.1037\/\/0021-9010.83.2.139","raw":"Kossek, E. E., & Ozeki, C. (1998). Work-family conflict, policies, and the job-life satisfaction relationship: A review and directions for organizational behaviorHuman Resources research. Journal of Applied Psychology, 83(2), 139-149.","cites":null},{"id":17242621,"title":"Work-family linkages among self-employed women and men.","authors":[],"date":"1997","doi":"10.1006\/jvbe.1996.1576","raw":"Loscocco, K. A. (1997). Work-family linkages among self-employed women and men. Journal of Vocational Behavior, 50, 204-226.","cites":null},{"id":17242561,"title":"Work-family policies and gender inequality at work: A Sloan Work and Family Encyclopedia entry. Retrieved","authors":[],"date":"2005","doi":null,"raw":"Estes, S. B., & Michael, J. (2005). Work-family policies and gender inequality at work: A Sloan Work and Family Encyclopedia entry. Retrieved March 16, 2007 from http:\/\/wfnetwork.bc.edu\/encyclopedia_entry.php?id=1230&area=All.                                                   Work-Life Practices and Organizational Performance 41 European Network for Workplace Health Promotion (2006). Work-life balance: A balanced life - working healthily and more successfully. Retrieved December 1, 2006 from http:\/\/www.enwhp.org\/whp\/whp-topics-work-life-balance.php.","cites":null},{"id":17242540,"title":"Work-life benefits and job pursuit intentions: The role of anticipated organizational support.","authors":[],"date":"2004","doi":"10.1016\/j.jvb.2003.09.003","raw":"Casper, W. J., & Buffardi, L. C. (2004). Work-life benefits and job pursuit intentions: The role of anticipated organizational support. Journal of Vocational Behavior, 65, 391-410.","cites":null},{"id":17242544,"title":"Work-life benefits and organizational attachment: Self-interest utility and signaling theory models.","authors":[],"date":"2008","doi":"10.1016\/j.jvb.2007.10.015","raw":"Casper, W. J., & Harris, C. M. (2008). Work-life benefits and organizational attachment: Self-interest utility and signaling theory models. Journal of Vocational Behavior, 72, 95-109.","cites":null},{"id":17242663,"title":"Work-life benefits: Which ones maximize profits?","authors":[],"date":"2001","doi":null,"raw":"Meyer, C. S., Mukerjee, S., & Sestero, A. (2001). Work-life benefits: Which ones maximize profits? Journal of Managerial Issues, 13(1), 28-44.","cites":null},{"id":17242563,"title":"Work-life conflict, gender, and health-related outcomes: A study of employed parents in two community samples.","authors":[],"date":"1996","doi":"10.1037\/\/1076-8998.1.1.57","raw":"Frone, M. R., Russell, M., & Barnes, G. M. (1996). Work-life conflict, gender, and health-related outcomes: A study of employed parents in two community samples. Journal of Occupational Health Psychology, 1(1), 57-69.","cites":null},{"id":17242532,"title":"Work-life congruence and work-life concerns among nursing staff.","authors":[],"date":"1999","doi":"10.12927\/cjnl.1999.19074","raw":"Burke, R. J., & Greenglass, E. R. (1999). Work-life congruence and work-life concerns among nursing staff. Canadian Journal of Nursing Leadership, 12 (2), 21-29.","cites":null},{"id":17242684,"title":"Work-life human resource bundles and perceived organizational performance.","authors":[],"date":"2000","doi":"10.2307\/1556339","raw":"Perry-Smith, J. E., & Blum, T. C. (2000). Work-life human resource bundles and perceived organizational performance. Academy of Management Journal, 43(6), 1107-1117.","cites":null},{"id":17242708,"title":"Work-life policy implementation: Breaking down or creating barriers to inclusiveness? Human Resource Management,","authors":[],"date":"2008","doi":"10.1002\/hrm.20213","raw":"Ryan, A. M., & Kossek, E. E. (2008). Work-life policy implementation: Breaking down or creating barriers to inclusiveness?  Human Resource Management, 47(2), 295-310.","cites":null},{"id":17242617,"title":"Work-Life Practices and Organizational Performance","authors":[],"date":"2001","doi":"10.4135\/9781848608320.n7","raw":"Personnel Review, 29(3), 417-430.                                                  Work-Life Practices and Organizational Performance 46 Lewis, S., & Smithson, J. (2001). Sense of entitlement to support for the reconciliation of employment and family life. Human Relations, 54(11), 1455-1481.","cites":null},{"id":17242486,"title":"Work-Life Practices and Organizational Performance 37 Bailyn,","authors":[],"date":"1997","doi":null,"raw":"Journal of Family Issues, 11(4), 384-400.                                                  Work-Life Practices and Organizational Performance 37 Bailyn, L. (1997). The impact of corporate culture on work-family integration. In S. Parasuraman & J. H. Greenhaus (Eds.), Integrating work and family: Challenges and choices for a changing world (pp. 209-219). Westport, CT: Quorum Books.","cites":null},{"id":17242538,"title":"Work-Life Practices and Organizational Performance 39","authors":[],"date":"2007","doi":null,"raw":"Unpublished master's thesis, Cornell University, Ithaca, NY.                                                   Work-Life Practices and Organizational Performance 39 Carless, S. A., & Wintle, J. (2007). Applicant attraction: The role of recruiter function, work-life balance policies and career salience. International Journal of Selection and Assessment, 15(4), 394-404.","cites":null},{"id":17242599,"title":"Workplace Employment Relations Survey. London: Department of Trade and Industry.","authors":[],"date":"2005","doi":"10.1111\/j.1467-8543.2008.00690_6.x","raw":"Kersley, B., Alpin, C., Forth, J., Bryson, A., Bewley, H., Dix, G., & Oxenbridge, S. (2005). Inside the workplace: First findings from the 2004 Workplace Employment Relations Survey. London: Department of Trade and Industry.","cites":null},{"id":17242564,"title":"Workplace family-supportive programmes: Predictors of employed parents’ importance ratings.","authors":[],"date":"1996","doi":"10.1111\/j.2044-8325.1996.tb00621.x","raw":"Frone, M. R., & Yardley, J. K. (1996). Workplace family-supportive programmes: Predictors of employed parents’ importance ratings. Journal of Occupational and Organizational Psychology, 69, 351-366.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009","abstract":"The business case for work-life balance practices, as espoused by many organizations, rests on attracting better applicants and reducing work-life conflict among existing employees in order to enhance organizational performance. This review of the literature provides some evidence for the claim regarding recruitment, but there is insufficient evidence to support the notion that work-life practices enhance performance by means of reduced work-life conflict. We suggest that the business case may therefore need to be modified to reflect the number of additional routes by which work-life balance practices can influence organizational performance, including enhanced social exchange processes, increased cost savings, improved productivity, and reduced turnover. The impact of these processes may, however, be moderated by a number of factors, including national context, job level, and managerial support. The importance of further research into the effects of these practices is discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95565.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25224\/1\/Making_the_link_between_work_life_balance_practices_and_organizational_performance_%28LSERO_version%29.pdf","pdfHashValue":"f39024a3d4edb5ab731548782dd63b547699d83b","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25224<\/identifier><datestamp>\n      2012-06-06T17:04:58Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F456D705F52656C<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25224\/<\/dc:relation><dc:title>\n        Making the link between work-life balance practices and organizational performance<\/dc:title><dc:creator>\n        Beauregard, T. Alexandra<\/dc:creator><dc:creator>\n        Henry, Lesley C.<\/dc:creator><dc:subject>\n        HF Commerce<\/dc:subject><dc:description>\n        The business case for work-life balance practices, as espoused by many organizations, rests on attracting better applicants and reducing work-life conflict among existing employees in order to enhance organizational performance. This review of the literature provides some evidence for the claim regarding recruitment, but there is insufficient evidence to support the notion that work-life practices enhance performance by means of reduced work-life conflict. We suggest that the business case may therefore need to be modified to reflect the number of additional routes by which work-life balance practices can influence organizational performance, including enhanced social exchange processes, increased cost savings, improved productivity, and reduced turnover. The impact of these processes may, however, be moderated by a number of factors, including national context, job level, and managerial support. The importance of further research into the effects of these practices is discussed.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25224\/1\/Making_the_link_between_work_life_balance_practices_and_organizational_performance_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Beauregard, T. Alexandra and Henry, Lesley C.  (2009) Making the link between work-life balance practices and organizational performance.  Human Resource Management Review, 19.  pp. 9-22.  ISSN 1053-4822     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/locate\/humres<\/dc:relation><dc:relation>\n        10.1016\/j.hrmr.2008.09.001<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25224\/","http:\/\/www.elsevier.com\/locate\/humres","10.1016\/j.hrmr.2008.09.001"],"year":2009,"topics":["HF Commerce"],"subject":["Article","PeerReviewed"],"fullText":"  \nT. Alexandra Beauregard and Lesley C. Henry \nMaking the link between work-life balance \npractices and organizational performance \n \nArticle (Accepted version) \n(Refereed) \n \nOriginal citation: \nBeauregard, T. Alexandra and Henry, Lesley C. (2009) Making the link between work-life \nbalance practices and organizational performance. Human resource management review, 19 . \npp. 9-22. ISSN 1053-4822 \n \nDOI: http:\/\/dx.doi.org\/10.1016\/j.hrmr.2008.09.001 \n \n© 2009 Elsevier\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25224\/\nAvailable in LSE Research Online: September 2009 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \n                                                Work-Life Practices and Organizational Performance 1 \nRunning head: Work-Life Practices and Organizational Performance \n \n \n \n \n \n \n \nMaking the Link between Work-Life Balance Practices and Organizational \nPerformance \n \n                                                Work-Life Practices and Organizational Performance 2 \nAbstract \nThe business case for work-life balance practices, as espoused by many organizations, \nrests on attracting better applicants and reducing work-life conflict among existing \nemployees in order to enhance organizational performance. This review of the \nliterature provides some evidence for the claim regarding recruitment, but there is \ninsufficient evidence to support the notion that work-life practices enhance \nperformance by means of reduced work-life conflict. We suggest that the business \ncase may therefore need to be modified to reflect the number of additional routes by \nwhich work-life balance practices can influence organizational performance, \nincluding enhanced social exchange processes, increased cost savings, improved \nproductivity, and reduced turnover. The impact of these processes may, however, be \nmoderated by a number of factors, including national context, job level, and \nmanagerial support. The importance of further research into the effects of these \npractices is discussed.\n                                                Work-Life Practices and Organizational Performance 3 \nMaking the Link between Work-Life Balance Practices and Organizational \nPerformance \nDespite the popularity of work-life conflict as a topic of academic and \npractitioner debate, and the mounting prevalence of work-life balance practices (a.k.a. \nfamily-supportive or family-friendly policies) in organizations around the world \n(Kersley et al., 2005; US Bureau of Labor, 2007), research on the organizational \neffects of such practices is not well integrated. Competing demands between work and \nhome have assumed increased relevance for employees in recent years, due in large \npart to demographic and workplace changes such as rising numbers of women in the \nlabour force, an ageing population, longer working hours, and more sophisticated \ncommunications technology enabling near constant contact with the workplace. In \nresponse to these changes and the conflict they generate among the multiple roles that \nindividuals occupy, organizations are increasingly pressured to implement work \npractices intended to facilitate employees’ efforts to fulfil both their employment-\nrelated and their personal responsibilities (Rapoport, Bailyn, Fletcher, & Pruitt, 2002). \nWhile there is no one accepted definition of what constitutes a work-life balance \npractice, the term usually refers to one of the following: organizational support for \ndependent care, flexible work options, and family or personal leave (Estes & Michael, \n2005). Hence these practices include flexible work hours (e.g., flextime, which \npermits workers to vary their start and finish times provided a certain number of hours \nis worked; compressed work week, in which employees work a full week’s worth of \nhours in four days and take the fifth off), working from home (telework), sharing a \nfull-time job between two employees (job sharing), family leave programs (e.g., \nparental leave, adoption leave, compassionate leave), on-site childcare, and financial \nand\/or informational assistance with childcare and eldercare services.  \n                                                Work-Life Practices and Organizational Performance 4 \nOver the past two decades, the outcomes of these work-life practices have \nbeen discussed in publications representing a number of different academic \ndisciplines – economics (e.g., Johnson & Provan, 1995; Whitehouse & Zetlin, 1999), \nfamily studies (e.g., Hill, Hawkins, Ferris, & Weitzman, 2001; Raabe, 1990), gender \nstudies (e.g., Nelson, Quick, Hitt, & Moesel, 1990; Wayne & Cordeiro, 2003), \nindustrial relations (e.g., Batt & Valcour, 2003; Eaton, 2003), information systems \n(e.g., Baines & Gelder, 2003; Frolick, Wilkes, & Urwiler, 1993), management (e.g., \nKonrad & Mangel, 2000; Perry-Smith & Blum, 2000), social psychology (e.g., Allen \n& Russell, 1999; Hegtvedt, Clay-Warner, & Ferrigno, 2002), and sociology (e.g., \nBlair-Loy & Wharton, 2002; Glass & Estes, 1997). The most common approach is to \nview work-life balance practices through a business case lens: that is, by offering \nthese practices, organizations attract new members and reduce levels of work-life \nconflict among existing ones, and this improved recruitment and reduced work-life \nconflict enhance organizational effectiveness.  \nA review of the literature, however, questions this purported link between \nwork-life balance practices and organizational effectiveness. The majority of studies \ninvestigating the outcomes of work-life practices do not measure work-life conflict, \nand thus cannot support this proposed mediated relationship (Eby, Casper, Lockwood, \nBordeaux, & Brinley, 2005). The mechanisms by which the provision of work-life \npractices affects both employee behaviour and organizational performance remain \nunclear, and under-researched (Allen, 2001; Schutte & Eaton, 2004). The results of a \nnumber of studies reviewed in this paper appear to suggest that work-life balance \npractices do not necessarily influence levels of employee work-life conflict, but \ninstead improve organizational performance via other routes, such as reduced \noverheads in the case of employees working from home, improved productivity \n                                                Work-Life Practices and Organizational Performance 5 \namong employees working at their peak hours, or social exchange processes arising \nfrom perceptions of organizational support (e.g., Allen, 2001; Apgar, 1998; Shepard, \nClifton, & Kruse, 1996).  \nThis paper examines the literature to identify the various ways in which \norganizational work-life practices may influence organizational performance. Using a \nwide range of studies from a variety of disciplines, the empirical support available for \nthe link between work-life practices and organizational performance at both the \nindividual and organization level of analysis is reviewed. Integrating the literature in \nthis fashion provides us with important new insights regarding potential moderators \nand mediators of the link between work-life practices and organizational performance, \nand suggests new research questions that may further enhance our understanding of \nhow (or if) this link operates. Figure 1 illustrates the relationships identified and \nsuggested by this examination of the literature, and provides a structure for the \nframework of the paper.  \nFirst, the paper will focus on individual-level explanations for the link \nbetween work-life practices and organizational performance, such as reduced work-\nlife conflict, improved job-related attitudes and perceived organizational support, and \nuse of practices. Organization-level explanations will then be explored, such as \nimproved recruitment, retention, and productivity. Within each section, the literature’s \nmajor findings will be reviewed and the key implications drawn out. The paper \nconcludes by discussing the future of work-life balance practices, analyzing \ninadequacies in current research, and identifying directions for future research.  \n______________________________ \nINSERT FIGURE 1 ABOUT HERE \n______________________________ \n                                                Work-Life Practices and Organizational Performance 6 \nRationale for methodology \nBy conducting a comprehensive narrative review rather than a meta-analysis, \nwe are able to examine the different ways in which work-life practices and outcomes \nare conceptualized and measured in the literature, and explore the theory \nunderpinning the results. This is especially important when working in a field in \nwhich the literature is relatively young and not especially well developed, such as that \nconcerning the impact of work-life balance practices. Meta-analytic techniques have \nbeen criticized for their failure to consider heterogeneity in both subjects and \nmethods, and have also been accused of over-generalizing results and over-\nemphasizing quantitative comparisons of substantively different literatures (Graham, \n1995; Slavin, 1986). These concerns are particularly relevant given the wide variety \nof disciplines contributing to the work-life balance practice literature, the wide variety \nof definitions and measurements adopted in the research, and the diversity of study \nparticipants in terms of demographic characteristics and caregiving responsibilities.  \nPapers were selected for this review on the basis of their empirical \ninvestigation of the outcomes of work-life balance practices. Relevant articles were \nidentified using computerized searches on PsycInfo, Business Source Premier, Google \nScholar, PAIS International, and International Bibliography of the Social Sciences \nsearch indices. No specific journals were targeted, included, or excluded. The \nfollowing search terms were used: work-life, work-family, work-nonwork, family \nfriendly, and family responsive, in conjunction with policy, practice, and benefit; \nchildcare, dependent care, eldercare, flexible work schedules, flexible work hours, \ntelework, telecommuting, and performance.    \n                                                Work-Life Practices and Organizational Performance 7 \nIndividual-level explanations \nReduction of work-life conflict \nInterference between work and non-work responsibilities has a number of \nnegative outcomes that have been well established in the literature. In terms of job \nattitudes, employees reporting high levels of both work-to-life and life-to-work \nconflict tend to exhibit lower levels of job satisfaction and organizational commitment \n(Burke & Greenglass, 1999; Kossek & Ozeki, 1998). Behavioural outcomes of both \ndirections of conflict include reduced work effort, reduced performance, and \nincreased absenteeism and turnover (Anderson, Coffey, & Byerly, 2002; Aryee, 1992; \nFrone, Yardley, & Markel, 1997; Greenhaus, Collins, Singh, & Parasuraman, 1997; \nWayne, Musisca, & Fleeson, 2004). Both work-to-life and life-to-work conflict have \nalso been associated with increased stress and burnout (Anderson et al., 2002; \nKinnunen & Mauno, 1998), cognitive difficulties such as staying awake, lack of \nconcentration, and low alertness (MacEwen & Barling, 1994), and reduced levels of \ngeneral health and energy (Frone, Russell, & Barnes, 1996). While the majority of \nwork-life balance research focuses on employees’ family responsibilities, there are \nalso a number of studies that recognize commitments to friends and community \ngroups, expanding the affected population to virtually all employees (e.g., \nBeauregard, 2006; Hamilton, Gordon, & Whelan-Berry, 2006; Tausig & Fenwick, \n2001). The implications for organizations are clear: work-life conflict can have \nnegative repercussions for employee performance.  \nAccording to the business case as espoused by many firms and government \nbodies, these costs to organizations can be avoided by implementing programs to help \nemployees manage their work-life conflict (e.g., European Network for Workplace \nHealth Promotion, 2006; Human Resources and Social Development Canada, 2006). \n                                                Work-Life Practices and Organizational Performance 8 \nThis view proposes that work-life balance practices will assist employees in balancing \ntheir work and family demands, which can in turn lead to enhanced employee \nproductivity and significant business improvements. By enabling employees to \nschedule their time in order to better balance competing demands from work and from \nhome, and by helping employees to procure third-party assistance with caregiving \nresponsibilities, such practices are intended to reduce or eliminate levels of work-life \nconflict, and thereby augment employee performance and organizational \neffectiveness.  \nThere is mixed support in the literature for this proposition. In a study of male \nexecutives, Judge, Boudreau & Bretz (1994) rated the work-family policies available \nto these employees and found that more comprehensive benefits were associated with \nlower work-to-life conflict, but not life-to-work conflict. Thompson, Beauvais and \nLyness (1999) also found a significant, negative association between the availability \nof work-life practices and work-to-life conflict, while Frye and Breaugh (2004) \nidentified a negative relationship between perceptions of the usefulness of \norganizational work-life practices and work-to-life conflict. A number of researchers \nhave found that use of flexible working hours is associated with lower levels of work-\nto-life conflict (Anderson, Coffey, & Byerly, 2002; Hill et al., 2001) and non-\ndirectional work-life conflict (Lee & Duxbury, 1998; Saltzstein et al., 2001). Thomas \nand Ganster (1995) found that perceived control served as a mediating mechanism by \nwhich family-supportive policies influenced a non-directional measure of work-life \nconflict, and O’Driscoll et al. (2003) demonstrated that family-supportive \norganizational perceptions mediated the link between use of work-life practices and \nwork-to-life conflict.  \n                                                Work-Life Practices and Organizational Performance 9 \nOn the other hand, research by Blum, Fields, and Goodman (1994), Galinsky \nand Morris (1993), and Premeaux, Adkins, and Mossholder (2007) found no effects of \nwork-life practices on employees’ work-life conflict levels. Similarly, Goff, Mount, \nand Jamison’s (1990) study did not reveal any association between provision of an on-\nsite childcare centre and levels of work-life conflict. Providing work-life practices \ndoes not necessarily entail a reduction in levels of staff work-life conflict, then, and \neven where this is the case, there is a dearth of research investigating the mediating \nrole of work-life conflict in the link between work-life practice provision and \norganizational effectiveness. Furthermore, much of the research literature groups a \nnumber of work-life practices together when relating provision or use to attitudinal or \nbehavioural outcomes. This only clouds the issue of whether such a variety of work-\nlife practices can be expected to produce similar effects. Ashforth, Kreiner, and \nFugate’s (2000) work on boundary theory and role transition suggests that because \nworkers have different preferences for integration versus segmentation of work and \nfamily roles, certain work-life practices may be ineffective in reducing inter-role \nconflict if they do not cater to a worker’s particular values, needs, or preferences for \nmanaging multiple roles. For example, participating in telework arrangements has \nbeen shown to benefit some workers, whereas for others – particularly those with \ngreater family responsibilities – it appears to blur the boundaries between work and \nhome (see Hill, Miller, Weiner, & Colihan, 1998; Loscocco, 1997).  \nAnother issue with the existing research is that availability of work-life \npractices is often measured, as opposed to actual use of such practices. This, however, \nbrings us to another potential explanation for the link between work-life practices and \norganizational performance. Even when the practices are not used and therefore no \nreduction in work-life conflict is achieved, the mere presence of such practices can \n                                                Work-Life Practices and Organizational Performance 10 \neffect a number of beneficial outcomes to the organization in the form of positive job-\nrelated attitudes. We shall begin to explore these in the following section.  \nKey implications: While work-life conflict is generally held to be a mediator in \nthe link between provision of practices and performance outcomes, this proposition \nremains untested. Existing research designs often neglect to distinguish between \npractice availability and practice use, and largely fail to differentiate among work-life \npractices, rendering it difficult to reach conclusions regarding their common or \ndistinct effects.  \nImproved job-related attitudes and perceptions of organizational support \nWith regard to job attitudes, use of and satisfaction with work schedule \nflexibility has been associated with increased organizational commitment and reduced \nturnover intentions (Aryee, Luk, & Stone, 1998; Halpern, 2005; Houston & \nWaumsley, 2003), and voluntary reduced hours have been linked to greater job \nsatisfaction, loyalty, and organizational commitment (Williams, Ford, Dohring, Lee, \n& MacDermid, 2000). A number of studies have found that employees who benefit \nfrom childcare centres, referral services and other family-supportive practices report \nhigher levels of commitment to the organization (Goldberg, Greenberger, Koch-Jones, \nO’Neil, & Hamill, 1989; Grover & Crooker, 1995; Orthner & Pittman, 1986; \nYoungblood & Chambers-Cook, 1984). A meta-analysis by Baltes, Briggs, Huff, \nWright, and Neuman (1999) found that flexible work schedules had positive effects \non both job satisfaction and satisfaction with work schedule. In a study of the ‘virtual \noffice’, Callentine’s (1995) participants attributed an increase in job satisfaction to \nincreased flexibility in the location and timing of their work. Teleworkers in Quaid \nand Lagerberg’s 1992 study (cited in Standen, Daniels & Lamond, 1999) also \nreported higher levels of job satisfaction. In their 2007 meta-analysis, Gajendran and \n                                                Work-Life Practices and Organizational Performance 11 \nHarrison found that telework was associated with increased job satisfaction and \nreduced intentions to turnover, with these relationships partially mediated by lower \nlevels of work-life conflict.   \nAvailability of work-life balance practices, independent of actual use, appears \nto produce similarly positive results in terms of work-related attitudes. For instance, \nthe availability of organizational resources, including flexible work hours, has been \nlinked to job satisfaction and organizational commitment for women and for all \nemployees with family responsibilities, regardless of whether or not these resources \nare being used (Nelson et al., 1990; Scandura & Lankau, 1997). Similarly, Roehling, \nRoehling, and Moen (2001) found in a representative sample of 3,381 American \nworkers that the presence of flexible time policies and childcare assistance was \nassociated with employee loyalty for those with family responsibilities.  \nAvailability of work-life balance practices has also been related to increased \naffective commitment and decreased turnover intentions (Chiu & Ng, 1999; \nThompson, Beauvais & Lyness, 1999; Wood & de Menezes, 2008). Grover and \nCrooker (1995) found that parental leave, childcare information and referral, flexible \nwork hours, and financial assistance with childcare predicted both increased affective \ncommitment to the organization and decreased turnover intentions among all \nemployees, not just users of the practices.  \nA few studies have identified moderators of the practice availability – job \nattitude link. Kossek and Ozeki’s (1999) review suggests that the provision of flexible \nwork hours will be positively related to organizational commitment only if employees \nperceive the flexibility as increasing their control over their time. Similarly, Wang and \nWalumbwa (2007) found that the availability of flexible work arrangements was \nassociated with increased organizational commitment for banking employees in \n                                                Work-Life Practices and Organizational Performance 12 \nChina, Kenya, and Thailand only when employees perceived their supervisors to \nexhibit transformational leadership behaviours, including individual consideration. In \na 2008 study by Casper and Harris, the impact of work-life practice availability on \norganizational commitment was moderated by gender and by practice use. For \nwomen, the availability of work-life practices had a positive relationship with \ncommitment, mediated by perceived organizational support. For men, however, the \navailability of flexible schedules was positively related to commitment only when \nmen’s use of this practice was high. When use of flexible schedules was low, the \navailability of this practice was negatively related to commitment. Similarly, Butts, \nNg, Vandenberg, Dejoy, and Wilson (2007) found that for men, the availability of \nwork-life practices was associated with higher organizational commitment only when \nperceived organizational support was high. For women, there was a positive link \nbetween practices and commitment regardless of levels of perceived organizational \nsupport. \nThese results can be interpreted using social exchange theory (Blau, 1964). \nWhen treated favourably by the organization, employees will feel obliged to respond \nin kind, through positive attitudes or behaviours toward the source of the treatment. \nUsing the provision of work-life balance practices as an indicator of favourable \ntreatment, employees will reciprocate in ways beneficial to the organization – \nincreased commitment, satisfaction with one’s job, and citizenship behaviours. The \navailability of work practices designed to assist employees with managing their \nresponsibilities at home may also increase employee perceptions of organizational \nsupport, particularly if these work-life balance practices are seen as being useful \n(Lambert, 2000). Perceived organizational support can also be used as an indicator of \nfavourable treatment, prompting reciprocal positive actions from employees. This \n                                                Work-Life Practices and Organizational Performance 13 \nproposition finds support in the results of Allen (2001), which indicated that \nperceptions of the organization as being family-supportive mediated the link between \nwork-life practice availability and both affective commitment and job satisfaction. \nThis interpretation is, however, not without criticism. In the context of the \npsychological contract - the individual employee’s subjective belief in the reciprocal \nobligations between the employee and the organization (Rousseau, 1995) - it is \npossible that employees may not feel obliged to ‘repay’ their organization’s provision \nof work-life practices with an increase in positive, work-related behaviours or \nattitudes. Instead, they may perceive that access to such practices is an entitlement, \nrather than an example of favourable treatment. It is difficult to estimate the extent to \nwhich employees construe such practices as favours versus rights. Research \nconducted by Lewis and Smithson (2001) indicates that perceived entitlement to such \npractices is not widespread among European employees, particularly those in nations \nwith low levels of statutory regulations concerning the balance of work with family or \npersonal commitments. For instance, study participants in Ireland and the UK did not \nfeel entitled to employer support for child care, and perceived entitlement to flexible \nhours or parental leave was contingent upon the participants’ view of whether such \npractices were practical for the organization, in terms of time, operation and costs. \nGiven the current absence of compelling data to demonstrate perceived entitlement to \nwork-life practices, therefore, the social exchange explanation for the positive effects \nof work-life practices among non-users cannot be discounted. \nKey implications: The provision of work-life practices has the potential to \ngenerate improved attitudinal and behavioural outcomes among employees \nindependent of practice use. While this process is widely held to occur via social \nexchange, research has not yet explicitly tested this proposition, nor the possibility \n                                                Work-Life Practices and Organizational Performance 14 \nthat national context (in the form of varying statutory regulations) may moderate the \nlink between provision of practices and employee perceptions of organizational \nsupport.  \nUse of practices \nThe influence of work-life practices on organizational effectiveness may be \ncompromised by practices that fail to achieve their intended aims. An issue frequently \ncited in accounts of work-life practice implementation is lack of use. Research \nconducted amongst organizations in the UK suggests that employees often remain \nunaware of their work-life entitlements following the implementation of work-life \nbalance practices (Kodz, Harper, & Dench, 2002; Lewis, Kagan, & Heaton, 2000). \nFor example, in a survey of 945 employees in six different organizations across three \nsectors of employment (local government, supermarkets, and retail banking), Yeandle, \nCrompton, Wigfield, and Dennett (2002) found that 50% of employees were unaware \nof the family-friendly practices offered by their organizations.  \nEven when employees are fully informed of the practices available to them, \nmany display a reluctance to use them. Relative to female employees, few men make \nuse of family leave, choosing instead to take vacation or other discretionary days off \nupon the birth of a child or other family-related event (Berry & Rao, 1997; Pleck, \n1993). Hall (1990) refers to this as the ‘invisible daddy track’; if colleagues and \nsuperiors are not aware that an employee is taking time off work for family reasons, \nhe is less likely to be accused of having competing priorities and less likely to be \nperceived as uncommitted to his job. Gender role theory may help to explain this \nphenomenon. In a study by Wayne and Cordeiro (2003) examining perceptions of \ncitizenship behaviours among male and female employees who either took family \nleave or did not, female employees were not rated differently regardless of their use of \n                                                Work-Life Practices and Organizational Performance 15 \nfamily leave. Men who took family leave, however, were rated as being less likely to \nhelp their co-workers, to work overtime, and to be punctual than men who did not \ntake family leave, even in the presence of identical job performance ratings. Gender \nrole theory proposes that men are expected to place work before family, and are thus \nnot viewed as being good organizational citizens when they take leave. \nAccording to Liff and Cameron (1997), use of work-life leave provisions is \nlow among staff with career aspirations due to the belief that taking such leave will be \ninterpreted as a lack of commitment to the organization. This premise is supported by \nBrandth and Kvande (2002), who studied 1,360 Norwegian working fathers and found \nthat as men progress up the managerial career ladder, they exhibit a reduced tendency \nto use the paternity leave to which they are entitled. In a study of 463 professional and \ntechnical employees in biopharmaceutical firms, Eaton (2003) found that the \nprovision of work-life practices improved employees’ organizational commitment, but \nonly to the extent that employees felt free to use the practices without negative \nconsequences to their work lives - such as damaged career prospects. Similarly, \nCunningham (2001) cites an American Bar Association report that although 95% of \nAmerican law firms have a part-time employment policy, only 3% of lawyers have \nused it due to fear of career derailment. \nThe perception that using work-life balance practices will have a negative \nimpact on their career prospects appears to be a powerful demotivator for employees’ \nuse of these practices (Kodz et al., 2002). This perception is reinforced by \norganizational cultures unsupportive of work-life balance issues. According to Ryan \nand Kossek (2008), implementation attributes including supervisor support for use \nand universality of practice availability will affect the degree to which work-life \npractices are seen by employees as fulfilling their work-life needs and signalling \n                                                Work-Life Practices and Organizational Performance 16 \nsupport from the organization. Organizations featuring an entrenched long-hours \nculture and unaccommodating attitudes among managers and co-workers tend to \ndiscourage employees from making use of the work-life practices ostensibly available \nto them. As Bailyn (1997: 211) puts it, “putting in time – being visibly at work, often \nfor long hours – is seen as a sign of commitment, of loyalty, of competence and high \npotential, and in many cases as an indicator, in and of itself, of productive output”. \nEmployees who do not give the maximum amount of time possible to the organization \nare often defined as less productive and less committed, and are therefore less valued \nthan employees working longer hours; this view is reflected in the attitudes of many \nmanagers to the promotion of employees working reduced hours or non-standard \nschedules (Lewis, 1997).  \nEmployees are often demonstrably concerned that using flexible working \narrangements will damage their promotion prospects and perhaps their relationships \nwith co-workers and managers (Houston & Waumsley, 2003). These concerns are not \nalways unfounded. Frequent telework has been associated with professional isolation, \nimpeding professional development activities such as interpersonal networking, \ninformal learning, and participating in mentoring relationships (Cooper & Kurland, \n2002). Some work-life practices, such as voluntary reduced hours, are frequently \nunavailable in upper-level professional and managerial work. However, when they are \navailable to professionals and managers, their use is often associated with career \nderailment (Raabe, 1996). As time spent at the workplace is often used as an indicator \nof employees’ contributions and commitment to the organization, participation in \nwork-life practices that make employees less visible (such as telework, flexible hours, \nor family leave) has been associated with lower performance evaluations, smaller \nsalary increases, and fewer promotions (Bailyn, 1997; Perlow, 1995).  \n                                                Work-Life Practices and Organizational Performance 17 \nThere is an increasing amount of research supporting the notion that workers \nwho make use of work-life practices suffer negative perceptions from colleagues and \nsuperiors. An experiment conducted by Allen and Russell (1999) found that \nemployees who used work-life balance practices were perceived by co-workers as \nhaving lower levels of organizational commitment, which was thought to affect the \nsubsequent allocation of organizational rewards such as advancement opportunities \nand salary increases. Rogier and Padgett (2004) conducted an experimental study \namong 107 working MBA students, in which participants were given a packet of \nmaterials designed to simulate the personnel file of a female employee in an \naccounting firm who was seeking a promotion to senior manager. They found that \nparticipants perceived the job candidate who was using flexible work hours as being \nless committed to her job, less suitable for advancement, less ambitious, and less \ndesirous of advancement, despite no differences in her perceived capability compared \nto a candidate not using a flexible schedule. This finding was consistent with that of \nCohen and Single (2001), whose research showed that accountants working flexible \nschedules were perceived to be less likely to be promoted and more likely to leave the \nfirm. \nMoving from perceptions to reality, research by Judiesch and Lyness (1999) \namong 11,815 managers in an American financial services organization found that \nmanagers who took leaves of absence, both family and illness-related, received fewer \nsubsequent promotions and salary increases than those who did not take leave, even \nafter controlling for performance ratings. Regardless of type of leave, length of \nabsence, or when leave was taken, managers who took multiple leaves of absence \nreceived fewer rewards than managers who took only one leave of absence. It is \ntherefore not surprising that work-life practices tend to be under-utilized by male \n                                                Work-Life Practices and Organizational Performance 18 \nemployees, single employees, and career-oriented mothers (Bailyn, Fletcher, & Kolb, \n1997; Whitehouse and Zetlin, 1999), and that apprehension of negative career \nconsequences for using practices has been associated with increased levels of work-\nlife conflict (Anderson et al., 2002; Thompson et al., 1999).  \nFor those employees who are aware of the practices available to them and who \nwish to make use of them, other obstacles may exist. Drawing on evidence from case \nstudies of four companies in the Scottish financial sector, Bond and Wise (2003) \nreport that despite managerial discretion being built into a number of work-life \npractices and codified in staff handbooks, awareness of statutory family leave \nprovisions is variable and often quite poor among line managers, who frequently have \nlimited training in work-life related human resource policies. Similarly, Casper, Fox, \nSitzmann and Landy (2004) showed that supervisors generally had poor awareness of \nwork-life practices in their organization, and this influenced their ability to refer \nemployees to these practices. Research has also demonstrated that factors completely \nunrelated to employees’ requests to use work-life practices can have a profound \ninfluence on the likelihood of those requests being granted. For example, female \nmanagers are more likely than male managers to grant requests for alternative work \narrangements (Powell & Mainiero, 1999). Supervisors with greater parental \nresponsibility have been found to exhibit more flexibility in helping employees \nbalance their work and home commitments, while supervisors with a greater need for \ncontrol have been found to display less flexibility in this regard (Parker & Allen, \n2002).  \nKey implications: Managerial support and the work-life climate of an \norganization may moderate the link between work-life balance practice provision and \nboth employee use of practices and perceptions of organizational support. If \n                                                Work-Life Practices and Organizational Performance 19 \nmanagement is unsupportive of employees’ efforts to balance work and personal \nresponsibilities, and workers anticipate career penalties should they make use of the \navailable practices, organizations may find that perceptions of organizational support \nare not enhanced and outcomes such as improved citizenship behaviour and \norganizational performance are thus unrealized. Fear of harming their career prospects \nmay discourage employees from using the work-life practices on offer, which in turn \nmay nullify some of the intended beneficial effects of those practices.  \nOrganization level explanations \nImproved recruitment and retention \nAdopting a resource-based view of the organization, work-life practices may \nserve as a source of competitive advantage in a context in which their provision is \nlimited (Perry-Smith & Blum, 2000). Offering voluntary reduced hours has been \nassociated with increased recruitment and retention (Williams, Ford, Dohring, Lee, & \nMacDermid, 2000). The provision of onsite childcare centres has been associated with \nlower turnover intentions among employees (Milkovich & Gomez, 1976; Youngblood \n& Chambers-Clark, 1984), as has access to family-responsive policies in general \n(Grover & Crooker, 1995). In McDonald, Guthrie, Bradley, and Shakespeare-Finch’s \n(2005) qualitative study of employed women with dependent children, several of the \nparticipants stated that without access to flexible working hours, they would not \ncontinue to work full-time. Availability of flexible work hours predicted retention \namong employed new mothers in Glass and Riley’s (1998) study, and Hofferth (1996) \nfound that availability of flexible spending accounts to pay for child care predicted \nreduced turnover among working mothers. Studies have also shown that as levels of \nflexibility in terms of working hours decrease, turnover intentions are raised (Pierce & \nNewstrom, 1982; Rothausen, 1994).  \n                                                Work-Life Practices and Organizational Performance 20 \nThere is debate concerning the extent to which work-life practices encourage \nrecruitment and retention of all employees, or only those with caring responsibilities \nor other personal commitments requiring flexibility in their work hours. A number of \nstudies have demonstrated support for the “universal appeal” perspective. In a study \nof MBA alumni and students, Honeycutt and Rosen (1997) found that regardless of \nwhether their salient identities centred on family, balance, or career, individuals were \nmore attracted to organizations offering flexible career paths and policies than to more \ntraditional organizations. In a quasi-experimental study of young, inexperienced job \nseekers without caregiving responsibilities, Carless and Wintle (2007) found that \norganizations offering flexible career paths (with family supportive policies available \nto all employees) and dual career paths (with the option to either prioritize career, or \nbalance career and family) were perceived as significantly more attractive than those \noffering only traditional career paths.  Further support for the universal appeal \nperspective is provided by Bretz and Judge (1994), who found that levels of work-life \nconflict among employees did not predict their attraction to organizations offering \nwork-life practices. Similarly, in a survey of 120 employers in upstate New York, \nBaughman, DiNardi and Holtz-Eakin (2003) found that employers who had instituted \nflexible sick leave and childcare referral services five years ago or longer experienced \nsignificant subsequent decreases in turnover amongst all employees, while the work \nof Bretz, Boudreau, and Judge (1994) found that lack of access to work-life practices \npredicted turnover intentions among managers.  \nAn explanation for these findings can perhaps be found in the results of an \nexperiment among 371 current or recent job search candidates conducted by Casper \nand Buffardi (2004), which demonstrated that the provision of work schedule \nflexibility and dependent care assistance by organizations led to job pursuit intentions \n                                                Work-Life Practices and Organizational Performance 21 \namong participants. Levels of work-life conflict and family responsibilities had no \nimpact on the link between work-life practices and attraction to the organization, but \nthis relationship was fully mediated by perceptions of anticipated organizational \nsupport - job candidates’ expectations that an organization would provide them with \nsupport were they to become employed by the organization. Casper and Buffardi \n(2004) speculate that such perceptions of support are a psychological mechanism \nthrough which work-life practices influence behavioural intentions, explaining why \neven employees who have no need of work-life practices are still more attracted to \norganizations offering them. According to signalling theory, when decisions need to \nbe made with incomplete information available, individuals use observable \ncharacteristics to form inferences about unobservable characteristics (Spence, 1973). \nDuring the recruitment process, job candidates may therefore use the presence of \nwork-life balance practices as signals for work-related supports that are important to \nthem in choosing an organization (e.g., fair treatment, understanding supervision, and \nadequate provision of resources).  \nOn the other hand, there is also empirical support for the notion that work-life \nbalance practices are attractive only to individuals in need of assistance with \nbalancing their work and non-work responsibilities. In a study examining the effects \nof an onsite organizational childcare centre, Kossek and Nichol (1992) found that \nusers of the childcare centre had been with the organization longer and held more \npositive attitudes regarding the centre’s influence on recruitment and retention than \ndid employees who were on the waiting list. In another study related to onsite \nchildcare centres, Rothausen, Gonzalez, Clarke and O’Dell’s (1998) findings \nindicated that childcare provision had a positive effect on job-related attitudes only for \ncurrent users, past users, and future users of the childcare centre. A formal evaluation \n                                                Work-Life Practices and Organizational Performance 22 \nstudy of the childcare program at an American hospital found that parents using the \non-site childcare centre exhibited lower turnover rates than other employees (24% \ncompared to 33%), and much lower turnover rates than those of parents prior to the \nimplementation of the childcare centre, which averaged 40% (Auerbach, 1990).  \nIndividual differences have also been found to predict employee attraction to \nwork-life practices beyond childcare provision. Frone and Yardley (1996) determined \nthat employees with young children and those with higher levels of family-to-work \nconflict deemed organizational work-life balance practices as more important than did \nemployees without these characteristics. Rau and Hyland (2002) found that \nindividuals with high levels of work-family conflict were more attracted to \norganizations that offered flexible working hours, while individuals with lower levels \nof conflict between work and family were more attracted to organizations that \nprovided opportunities for telework. Research by Rothbard, Dumas, and Phillips \n(2001) found that employee preferences for segmentation versus integration of work \nand family roles predicted attraction to work-life practices, with employees who \npreferred to keep their work and family lives separate being more satisfied with the \nprovision of flexible hours rather than onsite childcare. \nThese studies suggest that individual differences among employees can \nmoderate the appeal of work-life balance practices offered by organizations. This is \nconsistent with the person-organization fit perspective, which posits that individual \ndifferences are key predictors of the qualities a job candidate will find attractive in an \nemploying organization (Turban & Keon, 1993). Unlike the universal appeal \nperspective, which sees organizational work-life balance practices as a boon to \nrecruitment and retention of all employees, the person-organization fit viewpoint \n                                                Work-Life Practices and Organizational Performance 23 \nsuggests that work-life practices will be more useful in recruiting and retaining \nworkers who will directly benefit from them.  \nKey implications: Individual differences such as caregiving responsibilities or \npreferences for integration vs. segmentation of work and life activities may moderate \nthe link between work-life balance practice provision and anticipated organizational \nsupport, influencing the ultimate effects of practice provision on recruitment and \nretention. Organizations seeking to maximize the impact of their work-life practices \non these outcomes may therefore wish to target practices to meet the specific needs of \ntheir current or anticipated workforce. \nImproved attendance and productivity \n \nIndividual level research. Research supports the notion that absenteeism rates \ncan be influenced by employees’ use of work-life balance practices. Flexible work \nhours and childcare centres have received particular attention in the literature. A study \nof female insurance company employees in Israel found lower levels of absenteeism \nin divisions with access to flexible work hours (Krauz & Freibach, 1983), while \nDalton and Mesch’s (1990) longitudinal assessment of a flexible scheduling \nintervention in a public service organization found that absenteeism decreased \nsignificantly among employees in the experimental group, but not the control group. \nTwo years after the program had ended, absenteeism levels had returned to pre-\nintervention levels. Using a nationally representative sample of working adults, \nHalpern (2005) found that employees using flexible work hours reported lower levels \nof absenteeism. Baltes et al.’s (1999) meta-analysis demonstrated a significant \nnegative relationship between flexible work schedules and absenteeism, as did Pierce \nand Newstrom (1983); the latter discovered that the effect was stronger when \n                                                Work-Life Practices and Organizational Performance 24 \nemployees were not required to obtain approval from their supervisors for the \nrequested flexibility.  \nEvidence for the effect of childcare provision on absenteeism is mixed. \nResearch from Milkovich and Gomez (1976) found that onsite childcare centre users \nmissed work less often than non-users, and in Auerbach’s (1990) study of an \nAmerican hospital’s childcare program, absenteeism rates dropped from 6% to 1% \namong eligible parents following the introduction of the childcare centre, whereas \nabsenteeism rates for other employees remained steady at 4%. In contrast, no \nrelationship between childcare centre use and absenteeism was found in empirical \nstudies conducted by Clark (1984), Goff, Mount, & Jamison (1990), Kossek and \nNichol (1992), and Thomas and Ganster (1995). Goff et al. (1990) propose a possible \nexplanation for their lack of findings; while non-directional work-life conflict appears \nto mediate the relationship between work-life practices and absenteeism, users of \nchildcare centres will not necessarily experience lower levels of conflict. Rather, \nwork-life conflict is decreased when employees express greater satisfaction with their \nchildcare situation. This line of thinking suggests that organizational childcare centres \nwill only be effective in improving employee attendance if they provide the most \nsatisfactory alternative to employees’ childcare options, a feat by no means \nguaranteed.  \nIn terms of performance, Kossek and Nichol’s (1992) study of onsite childcare \nfound no effects of childcare centre use on supervisor ratings of employee \nperformance, although self-ratings of performance among users indicated higher \nlevels of quality and greater ability to balance multiple roles than among non-users. In \na study of 55 firms that permitted administrative employees to bring their children to \nwork when childcare arrangements broke down or were otherwise unsustainable, \n                                                Work-Life Practices and Organizational Performance 25 \ncompany representatives reported that this work-life balance practice helped to \nmaintain employee productivity (Secret, 2006).  \nTelework is another practice that has received mixed support with regard to its \neffects on employee performance. Studies using self-report measures of productivity \noften find a positive association between telework and performance among employees \n(Callentine, 1995; Hill et al., 1998), and formal participation in telework programs has \nalso been related to improved performance ratings from supervisors (Kossek, Lautsch, \n& Eaton, 2006). In their review of telework studies, Pitt-Catsouphes and Marchetta \n(1991) found productivity increases of between 10% and 30%, and Frolick et al.’s \n(1993) qualitative research among teleworkers and their managers also yielded \npositive reports of increased performance. Gajendran and Harrison’s (2007) meta-\nanalysis reveals an association between telework and supervisor ratings or archival \nrecords of job performance. However, the results of Hartman, Stoner, and Arora \n(1991) indicate that more time spent teleworking is related to lower productivity, \nrather than increased performance. This relationship was moderated by responsibility \nfor initiation of telework arrangements; employees in employee-initiated or mutually-\ninitiated rather than supervisor-initiated telework arrangements reported higher levels \nof productivity.  \nStudies examining groupings of flexible working arrangements has associated \nemployee participation in these arrangements with higher levels of self-reported \nfocus, concentration, and motivation (Raabe, 1996; Williams et al., 2000), and \nLewis’s (1997) case study research found that working reduced hours on a voluntary \nbasis resulted in greater self-reported productivity and efficiency for chartered \naccountants. Chow and Keng-Howe’s (2006) study of workers in Singapore revealed \nthat the more flexible their schedules, the greater their self-reported productivity; \n                                                Work-Life Practices and Organizational Performance 26 \nBaltes et al. (1999) also found positive effects of flexible work schedules on \nproductivity in their meta-analysis. On the other hand, in reviewing the results from \nstudies conducted by Dunham et al. (1987) and Pierce and Newstrom (1982; 1983), \nKossek and Ozeki (1999) concluded that a more limited amount of flexibility was \noptimal in predicting improved performance, with employees specifying in advance \nwhat hours they would work, rather than varying their schedule on an ad hoc basis. \nWith regard to contextual performance, the perceived usefulness of available practices \nhas been found to predict increased organizational citizenship behaviour (Lambert, \n2000).  \nOrganization level research. Further support for the impact of work-life \nbalance practice usage is generated by the results of organization level research. \nShepard et al. (1996) collected information from 36 pharmaceutical companies in the \nU.S., covering an 11-year period, which indicated that the use of flexible work hours \nis associated with an increase of approximately 10% in firm productivity.  The work \nof Perry-Smith and Blum (2000) showed that in a national sample of 527 U.S. firms, \norganizations offering a greater range of work-life balance practices reported greater \nperceived market performance, profit-sales growth, and organizational performance. \nSimilarly, an analysis of the 1998 Workplace Employee Relations Survey by Dex, \nSmith, and Winter (2001) found that organisations offering parental leave enjoyed \nabove average labour productivity, and that the provision of flexible work hours and \ntelework was associated with reduced turnover.  \nThere are several different potential explanations for these results. According \nto Pfeffer’s (1981) symbolic action perspective, the provision of work-life balance \npractices promotes employee obligation and interest in organizations by serving as \nsymbols of special treatment and organizational concern for workers. Shepard et al. \n                                                Work-Life Practices and Organizational Performance 27 \n(1996) speculate that flexible work hours may increase organizational productivity \nbecause employees may choose to work during their peak hours in terms of personal \nproductivity. Another proposition given by the authors is that employees using \nflexible work hours may increase their work effort, because the costs of losing a job \nthat offers desired flexibility would be higher than those of losing a job without the \noption of flexible hours. McDonald et al. (2005) suggest that employees working \nflexible hours may enable organizations to keep up with a workload that is inherently \nvariable throughout the year; flexible working arrangements may invoke the principle \nof reciprocity, wherein employees work extra hours during peak times in exchange for \nthe ability to tailor their hours to suit their own needs at other times. Alternatively, \nthere may be direction of causality issues at play regarding the results of Perry-Smith \nand Blum’s (2000) and Dex et al.’s  (2001) cross-sectional analyses; successful firms \nmay be better able to afford work-life practices and thereby more likely to make them \navailable. Without longitudinal research, it is impossible to ascertain whether work-\nlife practices contribute to organizational performance, or whether organizational \nperformance contributes to the existence of work-life practices.  \nA study of the ‘100 Best Companies for Working Mothers’ by Meyer, \nMukerjee, and Sestero (2001) revealed that organizations offering work-life balance \npractices enjoyed increased profit rates. This was particularly the case for the \npractices of family sick leave and telework, which were related most strongly to \nincreased profits. The authors posited that telework encouraged longer work hours by \nemployees who were constantly available for work and who no longer needed to \ncommute. Another proposed explanation was that offering family sick leave might \nallow firms to pay lower wages, if workers viewed the leave as compensation for less \npay. This wage\/benefit tradeoff hypothesis is supported by the results of Baughman et \n                                                Work-Life Practices and Organizational Performance 28 \nal. (2003), who found in their survey of 120 organizations that the provision of \nflexible sick leave, flexible scheduling policies, and on-site childcare was associated \nwith significantly lower entry-level salaries. In his analysis of the May 1997 Current \nPopulation Survey, Golden (2001) found that an increase in the provision of flexible \nwork schedules was accompanied by a polarization of work hours (i.e., work weeks \nwere either very long, or very short). Long hours of work were particularly prominent. \nIn other words, in order to attain flexibility at work, employees sacrificed leisure time \nor compensation, both of which represented cost savings for the employing \norganizations.  \nIn a study of Fortune 500 firms, Arthur (2003) found that announcements of \nwork-life initiatives were associated with increased shareholder returns: \napproximately $60 million per initiative, per firm. Invoking institutional theory, \nArthur suggests that once a work-life practice becomes institutionalized among large \norganizations such as those featured in the Fortune 500 list, the adoption of that \npractice by an organization is a source of organizational legitimacy, and a signal that \nthe organization is conforming to social expectations. According to Meyer and Rowan \n(1977), legitimate organizations may have better access to financial resources such as \ninvestments, grants, and loans, hence the positive reaction from investors.  \nArthur’s (2003) research identified high-tech industries and industries that \nemploy large proportions of women as having slightly higher returns on work-life \npractice announcements, suggesting that benefits to firms offering such practices may \nvary according to industry or workforce demographics. Further support for this \nproposition comes from Konrad and Mangel (2000), whose research found that the \nrelationship between extensive provision of work-life practices and firm productivity \nwas stronger in organizations employing greater proportions of women, and those \n                                                Work-Life Practices and Organizational Performance 29 \nwhose workforce was predominantly composed of professionals. The authors \nconcluded that “for firms hiring less skilled, less autonomous, and less highly paid \nworkers, the productivity benefits of work-life initiatives may be negligible” (p. \n1235). \nBloom and Van Reenan (2006) offer a dissenting view regarding the causal \neffect of work-life practices on firm productivity. In a survey of 732 medium-sized \nmanufacturing firms in the USA and Europe, they found that while the number of \nwork-life balance practices on offer was positively associated with both higher \nproductivity and better management practices, the relationship with productivity \ndisappeared after controlling for the overall quality of management as evidenced by \npractices such as better shop-floor operations or performance-based promotion \nsystems. This would suggest that organizations offering a wider range of work-life \npractices to employees are also more likely to institute high quality management \npractices, which may be confounding the link between work-life practices and \norganizational performance.  \nKey implications: Organizations providing work-life balance practices may be \nable to generate cost savings by offering lower salaries and attracting greater \ninvestment. Productivity may be enhanced as a result of workers either exerting \ngreater effort in order to retain desirable benefits, or simply working at their peak \nhours. It appears that gender and job level may act as moderators of the link between \npractice provision and these outcomes, however, with organizations employing a \ngreater proportion of women and professionals exhibiting greater effects.  \nConclusions \nThe business case for work-life balance practices relies on their ability to \nenhance recruitment and retention, and reduce work-life conflict among employees. It \n                                                Work-Life Practices and Organizational Performance 30 \nmakes intuitive sense that offering work-life balance practices would attract \nindividuals to an organization, and that using these practices would result in improved \nemployee attitudes and behaviours within the organization. However, two things \nbecome clear after reviewing the literature on work-life balance practices and \norganizational performance. One, such practices do not necessarily reduce levels of \nemployee work-life conflict. Employee take-up may be low due to concerns that using \nwork-life practices will result in reduced advancement opportunities or perceptions of \nthe employee as being less committed to the organization. Employees who do make \nuse of these practices may or may not find they experience less work-life conflict. The \npresence of supportive managers and organizational climates may be at least as if not \nmore important in decreasing conflict (e.g., Behson, 2005; Premeaux et al., 2007).  \nTwo, regardless of effects on work-life conflict, work-life balance practices \nare often associated with improved organizational performance. Making practices \navailable to employees appears to give organizations a competitive advantage in terms \nof recruitment, by enhancing perceptions of anticipated organizational support among \njob seekers (Casper & Buffardi, 2004), particularly those who might require that \nsupport due to caregiving responsibilities (Frone & Yardley, 1996). The availability of \npractices may also increase positive job-related attitudes, work effort and contextual \nbehaviours by enhancing social exchange processes; as symbols of organizational \nconcern for employees, work-life practices promote employee interest in and \nobligation to the organization (Pfeffer, 1981). Providing work-life practices can allow \norganizations to offer lower wages in exchange (Baughman et al., 2003), and attract \ninvestors by signalling the organization’s legitimacy (Arthur, 2003).  \nHaving employees who make use of available work-life practices may also \nincur cost savings for organizations via longer work hours and enhanced productivity. \n                                                Work-Life Practices and Organizational Performance 31 \nEmployees may work longer hours because flexible arrangements increase their \navailability for work and reduce their commuting time, or because they are \nexchanging leisure time for flexibility (Golden, 2001; Meyer et al., 2001). They may \nchoose to work during their peak hours in terms of personal productivity (Shepard et \nal., 1996), or work extra hours during the organization’s peak times in exchange for \nflexibility at other times (McDonald et al., 2005). They may also increase their work \neffort to avoid losing a job that offers them the flexibility they desire (Shepard et al., \n1996).  \nCaveats to many of these conclusions exist. Until longitudinal research is \nconducted, we cannot discount the possibility that successful organizations are more \nlikely to offer work-life practices, and that the practices themselves are not exerting a \nfavourable effect on organizational performance. Equally, it may simply be that \norganizations offering work-life practices are more likely to engage in high-quality \nmanagement practices overall, generating positive effects on employee and \nperformance outcomes. The present review has also identified a number of \nmoderators of the link between practice provision and outcomes, meaning that \norganizations may only reap the benefits of work-life practices given particular \ncharacteristics of the employee, the organization, and the national context.  \nStill, in the absence of research conclusively demonstrating otherwise, if we assume \neven a minimal positive association between work-life practices and organizational \nperformance, the implications of the findings outlined in this paper are not \ninsignificant. Relying on the business case as traditionally stated to justify the \nimplementation or promotion of work-life balance practices may limit their potential \nappeal. Much of the evidence for return on investment in work-life balance practices \nis derived from case studies, which are not necessarily representative and therefore \n                                                Work-Life Practices and Organizational Performance 32 \ncannot be generalized to all organizations. However, it is generally agreed that many \nwork-life balance practices, such as flexible hours, telework, and informational \nassistance with dependent care services, have low financial costs that are associated \nprimarily with program administration and do not require an extensive initial outlay of \nresources. In a study of a nationally representative sample of U.S. firms employing \nmore than 100 people, Galinsky and Bond (1998) found that 36% of organizations \nreported their flexible work arrangements to be cost-neutral, with 46% claiming a \npositive return on investment in these practices. With regard to caregiving leave, often \nregarded as a costly endeavour, 42% of firms viewed them as cost-neutral, with \nanother 42% reporting a positive return on investment in their leave programs.  \nPresumably, more organizations would be interested in offering work-life \npractices were they aware that benefits may accrue to them regardless of whether or \nnot their employees made use of the practices. This is of particular relevance to \ncontexts not characterized by heavy regulation. Getting the business case ‘right’ is \nparticularly important in nations where public policy is not a key driver for \norganizational work-life balance practices. For instance, UK employment legislation \ndecrees that employees with caregiving responsibilities for young or disabled \nchildren, or for elderly dependents, have the right to request a flexible working \nschedule, and that their employers have a duty to consider that request seriously (DTI, \n2007). Across the rest of Europe and in Japan, public policy encourages flexible work \nhours, paid parental leave, and shorter weekly working hours in an effort to increase \nwomen’s participation in the labour force (Appelbaum, Bailey, Berg, & Kalleberg, \n2006). In comparison, countries such as the USA, Australia, and Canada rely to a \ngreater extent on the initiative of individual firms to implement work-life practices. In \n                                                Work-Life Practices and Organizational Performance 33 \nthese instances, the business case is the primary incentive for most organizations to do \nso. \nThere is an argument to be made that restating the business case and \ndisseminating more widely the alternative routes by which work-life practices \ninfluence organizational performance may have the unwelcome effect of directing \norganizations’ attention to the fact that work-life practices may deliver cost savings \nand improved reputation, both internally and externally, regardless of employee use or \nnet effect on work-life balance. This could potentially serve to dampen organizations’ \ninterest in addressing issues of eligibility for work-life practices and the work-life \nculture surrounding the use of those practices, actions essential to support their \nemployees’ work-life balance. Without necessary changes being made, users of work-\nlife practices will continue to be predominantly women, men will continue to \nanticipate negative repercussions arising from practice use, and career-oriented \nindividuals of both sexes will continue to think twice before availing themselves of \nthe practices on offer. This would be a considerable step backwards for all concerned, \nand lessen the benefits to organizations derived from improved employee perceptions \nof current or anticipated organizational support. However, it can be argued just as \nstrongly that the paucity of research evaluating the business case for work-life \npractices jeopardizes the effective implementation and use of those practices. If it \nremains unknown whether or not employees’ use of work-life practices actually \nreduces their work-life conflict, then there are no means of ensuring that practices are \ndesigned and implemented in such a way as to derive the greatest possible benefits \nfrom them for both organizations and employees. Without drawing attention to some \nof the potentially negative aspects of work-life practices, there is no basis from which \n                                                Work-Life Practices and Organizational Performance 34 \nto work for greater effectiveness in practice implementation and greater \nsupportiveness from organizations and their representatives.  \nFuture research \nAccording to Liff and Cameron (1997), many organizations neglect to conduct \nformal monitoring and evaluation of their work-life practices, assuming that because \nthe practices are being offered, they are being used to good effect. There is a scarcity \nof research based on systematic policy evaluation data to address the question of \nwhether work-life practices are achieving their intended aims (McDonald et al., 2005). \nFuture research exploring the effects of work-life practices on performance outcomes \nneeds to test more complex models of this relationship, and examine more closely \nhow use of practices translates into increased productivity. How credible are the \nexplanations identified earlier in this review of the literature? Does increased control \nover their schedules enable employees to plan their time more efficiently and achieve \nbetter performance? Do employees actually choose their optimal hours of productivity \nin which to work, and does this have a measurable effect on their performance?  \nGlass and Finley (2002) recommend that the evaluation of work-life practices \nbe enhanced by better measurement of specific practices and practice combinations, \nand by focusing on the function of the practice (e.g., reducing work hours, increasing \nschedule flexibility, or assisting with caregiving responsibilities). Future research \ninvestigating the effects of work-life practices would do well to measure each practice \nseparately and explore its impact on both work-to-life conflict and life-to-work \nconflict. Mediators and moderators of the relationships among work-life practices, \nwork-life conflict, and organizational performance should also be examined in greater \ndetail. For instance, employee preference for integration versus segmentation of work \nand life domains may act as a moderator of the link between work-life practices and \n                                                Work-Life Practices and Organizational Performance 35 \nwork-life conflict, and of the link between work-life practices and performance. \nWhich practices appeal to which employees, and which are most effective in allowing \nthem to meet their personal commitments and improve their performance on the job? \nIs work-life conflict a mediator in the link between practices and performance? Is \nperformance enhanced by use of work-life practices only when levels of management \nsupport are high, or when the organizational climate is supportive of work-life issues? \nIs social exchange the mechanism by which provision of practices translates into \nimproved job-related attitudes and behaviours?  \nThis review has sought to draw new insights and research directions from the \nextant literature on work-life balance practices and their relationship to organizational \nperformance. In identifying all the routes between work-life practices and \norganizational performance either proposed or implied by existing research, by \nidentifying processes at the level of the individual and of the organization, and by \nspecifying mediators and moderators that influence these linkages, this paper has \nattempted to contribute to model building in this area of study. The work-life conflict \nliterature has amassed a comprehensive account of antecedents, outcomes, mediators, \nand moderators so that the phenomenon can be better understood and coped with. \nNow it is time to do the same for the work practices designed to resolve that conflict \nbetween work and home.  \n \n \n                                                Work-Life Practices and Organizational Performance 36 \nReferences \nAllen, T. D. (2001). Family-supportive work environments: The role of organizational \nperceptions. Journal of Vocational Behavior, 58, 414-435.  \nAllen, T. D., & Russell, J. E. (1999). Parental leave of absence: Some not so family \nfriendly implications. Journal of Applied Social Psychology, 29(1), 166-191.  \nAnderson, S. E., Coffey, B. S., & Byerly, R. T. (2002). Formal organizational \ninitiatives and informal workplace practices: Links to work-life conflict and \njob-related outcomes. Journal of Management, 28(6), 787-810. \nApgar, M. (1998). The alternative workplace: Changing where and how people work. \nHarvard Business Review, 76, 121-136.  \n Appelbaum, E., Bailey, T., Berg, P., & Kalleberg, A. L. (2006). Organizations and \nthe intersection of work and family: A comparative perspective. In S. \nAckroyd, P. Thompson, P. Tolbert, & R. Batt (Eds.), The Oxford handbook of \nwork and organizations (pp. 52-73). Oxford: Oxford University Press. \nArthur, M. M. (2003). Share price reactions to work-family human resource decisions: \nAn institutional perspective. Academy of Management Journal, 46, 497-505. \nAryee, S. (1992). Antecedents and outcomes of work-life conflict among married \nprofessional women: Evidence from Singapore. Human Relations, 45(8), 813-\n837. \nAryee, S., Luk, V., & Stone, R. (1998). Family-responsive variables and retention-\nrelevant outcomes among employed parents. Human Relations, 51(1), 73-87. \nAshforth, B. E., Kreiner, G. E., & Fugate, M. (2000). All in a day's work: Boundaries \nand micro role transitions. Academy of Management Review, 25(3), 472-491. \nAuerbach, J. (1990). Employer-supported child care as a women-responsive policy. \nJournal of Family Issues, 11(4), 384-400. \n                                                Work-Life Practices and Organizational Performance 37 \nBailyn, L. (1997). The impact of corporate culture on work-family integration. In S. \nParasuraman & J. H. Greenhaus (Eds.), Integrating work and family: \nChallenges and choices for a changing world (pp. 209-219). Westport, CT: \nQuorum Books. \nBailyn, L., Fletcher, J. K., & Kolb, D. (1997). Unexpected connections: Considering \nemployees’ personal lives can revitalise your business. Sloan Management \nReview, 38, 11-19.  \nBaines, S., & Gelder, U. (2003). What is family friendly about the workplace in the \nhome? The case of self-employed parents and their children. New Technology, \nWork and Employment, 18(3), 223-234. \nBaltes, B. B., Briggs, T. E., Huff, J. W., Wright, J. A., & Neuman, G. A. (1999). \nFlexible and compressed workweek schedules: A meta-analysis of their effects \non work-related criteria. Journal of Applied Psychology, 84(4), 496-513. \nBatt, R., & Valcour, P. M. (2003). Human resources practices as predictors of work-\nlife outcomes and employee turnover. Industrial Relations, 42(2), 189-220.  \nBaughman, R., DiNardi, D., & Holtz-Eakin, D. (2003). Productivity and wage effects \nof “family-friendly” fringe benefits. International Journal of Manpower, \n24(3), 247-259. \nBeauregard, T. A. (2006). Predicting interference between work and home: A \ncomparison of dispositional and situational antecedents. Journal of \nManagerial Psychology, 21(3), 244-264. \nBehson, S.J. (2005). The relative contribution of formal and informal organizational \nwork-family support. Journal of Vocational Behavior, 66(3), 487-500. \nBerry, J. O., & Rao, J. M.  (1997).  Balancing employment and fatherhood: A systems \nperspective.  Journal of Family Issues, 18, 386-402. \n                                                Work-Life Practices and Organizational Performance 38 \nBlau, P. (1964). Exchange and power in social life. New York: Wiley. \nBlair-Loy, M., & Wharton, A. S. (2002). Employees’ use of work-family policies and \nthe workplace social context. Social Forces, 80(3), 813-845. \nBloom, N., & Van Reenan, J. (2006). Management practices, work-life balance, and \nproductivity: A review of some recent evidence. Oxford Review of Economic \nPolicy, 22(4), 457-482.  \nBlum, T. C., Fields, D. L., & Goodman, J. S. (1994). Organization-level determinants \nof women in management. Academy of Management Journal, 37(2), 241-268.  \nBond, S., & Wise, S. (2003). Family leave policies and devolution to the line. \nPersonnel Review, 32(1), 58-72. \nBrandth, B., & Kvande, E. (2002). Reflexive fathers: Negotiating parental leave and \nworking life. Gender, Work and Organization, 9(2), 186-203. \nBretz, R. D., & Judge, T. A. (1994). The role of human resource systems in job \napplicant decision processes. Journal of Management, 20(3), 531-551.  \nBurke, R. J., & Greenglass, E. R. (1999). Work-life congruence and work-life \nconcerns among nursing staff. Canadian Journal of Nursing Leadership, 12 \n(2), 21-29.  \nButts, M. M., Ng, T. W. H., Vandenberg, R. J., Dejoy, D. M., & Wilson, M. G. (2007, \nApril). Interactions between work-life balance practices and informal support: \nDifferential effects on organizational commitments of men and women. Paper \npresented at the Society for Industrial and Organizational Psychology \nConference, New York, NY.  \nCallentine, L. U. (1995). The ecology of the mobile workplace: Influence of household \ncomposition and home workspace on satisfaction, stress, and effectiveness. \nUnpublished master's thesis, Cornell University, Ithaca, NY.  \n                                                Work-Life Practices and Organizational Performance 39 \nCarless, S. A., & Wintle, J. (2007). Applicant attraction: The role of recruiter \nfunction, work-life balance policies and career salience. International Journal \nof Selection and Assessment, 15(4), 394-404. \nCasper, W. J., & Buffardi, L. C. (2004). Work-life benefits and job pursuit intentions: \nThe role of anticipated organizational support. Journal of Vocational \nBehavior, 65, 391-410.  \nCasper, W. J., Fox, K. E., Sitzmann, T. M., & Landy, A. L. (2004). Supervisor \nreferrals to work-family programs. Journal of Occupational Health \nPsychology, 9, 136-151. \nCasper, W. J., & Harris, C. M. (2008). Work-life benefits and organizational \nattachment: Self-interest utility and signaling theory models. Journal of \nVocational Behavior, 72, 95-109. \nChiu, W. C. K., & Ng, C. W. (1999). Women-friendly HRM and organizational \ncommitment: A study among women and men of organizations in Hong Kong. \nJournal of Occupational and Organizational Psychology, 72, 485-502. \nChow, I. H., & Keng-Howe, I. C. (2006). The effect of alternative work schedules on \nemployee performance. International Journal of Employment Studies, 14(1), \n105-130.  \nCohen, J. R., & Single, L. E. (2001). An examination of the perceived impact of \nflexible work arrangements on professional opportunities in public accounting. \nJournal of Business Ethics, 32, 317-328. \nCooke, R. A., & Rousseau, D. M. (1984). Stress and strain from family roles and \nwork-role expectations. Journal of Applied Psychology, 69(2), 252-260. \n                                                Work-Life Practices and Organizational Performance 40 \nCooper, C. D., & Kurland, N. B. (2002). Telecommuting, professional isolation, and \nemployee development in public and private organizations. Journal of \nOrganizational Behavior, 23, 511-532.  \nCunningham, K. (2001). Father time: Flexible work arrangements and the law firm’s \nfailure of the family. Stanford Law Review, 53, 967-1008. \nDalton, D. R., & Mesch, D. J. (1990). The impact of flexible scheduling on employee \nattendance and turnover. Administrative Science Quarterly, 35, 370-387. \nDepartment of Trade and Industry (2007). Flexible working - the right to request and \nthe duty to consider. Retrieved March 20, 2007, from \nhttp:\/\/www.dti.gov.uk\/employment\/employment-legislation\/employment-\nguidance\/page35662.html.  \nDex, S., Smith, C., & Winter, S. (2001). Effects of family-friendly policies on business \nperformance (Working Paper No. 22). Cambridge: University of Cambridge, \nJudge Institute of Management.   \nEaton, S. C. (2003). If you can use them: Flexibility policies, organizational \ncommitment, and perceived performance. Industrial Relations, 42(2), 145-\n167.  \nEby, L. T., Casper, W. J., Lockwood, A., Bordeaux, C., & Brinley, A. (2005). Work \nand family research in IO\/OB: Content analysis and review of the literature \n(1980-2002). Journal of Vocational Behavior, 66, 124-197.  \nEstes, S. B., & Michael, J. (2005). Work-family policies and gender inequality at \nwork: A Sloan Work and Family Encyclopedia entry. Retrieved March 16, \n2007 from \nhttp:\/\/wfnetwork.bc.edu\/encyclopedia_entry.php?id=1230&area=All.  \n                                                Work-Life Practices and Organizational Performance 41 \nEuropean Network for Workplace Health Promotion (2006). Work-life balance: A \nbalanced life - working healthily and more successfully. Retrieved December \n1, 2006 from http:\/\/www.enwhp.org\/whp\/whp-topics-work-life-balance.php.  \nFrolick, M. N., Wilkes, R. B., & Urwiler, R. (1993). Telecommuting as a workplace \nalternative: An identification of significant factors at home in American firms’ \ndetermination of work-at-home policies. Journal of Strategic Information \nSystems, 2, 206-222.  \nFrone, M. R., Russell, M., & Barnes, G. M. (1996). Work-life conflict, gender, and \nhealth-related outcomes: A study of employed parents in two community \nsamples. Journal of Occupational Health Psychology, 1(1), 57-69. \nFrone, M. R., & Yardley, J. K. (1996). Workplace family-supportive programmes: \nPredictors of employed parents’ importance ratings. Journal of Occupational \nand Organizational Psychology, 69, 351-366.  \nFrone, M. R., Yardley, J. K., & Markel, K. S. (1997). Developing and testing an \nintegrative model of the work-life interface. Journal of Vocational Behavior, \n50, 145-167. \nFrye, N. K., & Breaugh, J. A. (2004). Family-friendly policies, supervisor support, \nwork-family conflict, and satisfaction: A test of a conceptual model. Journal \nof Business and Psychology, 19(2), 197-220. \nGajendran, R. S., & Harrison, D. A. (2007). The good, the bad, and the unknown \nabout telecommuting: Meta-analysis of psychological mediators and \nindividual consequences. Journal of Applied Psychology, 92(6), 1524-1541. \nGalinsky, E., & Bond, J. T. (1998). The 1998 Business Work-Life Study: A \nsourcebook. New York: Families and Work Institute. \n                                                Work-Life Practices and Organizational Performance 42 \nGalinsky, E., & Morris, A. (1993). Employers and child care. Pediatrics, 91(1), 209-\n217.  \nGlass, J., & Estes, S. (1997). The family responsive workplace. Annual Review of \nSociology, 23, 289-313. \nGlass, J. L., & Finley, A. (2002). Coverage and effectiveness of family-responsive \nworkplace policies. Human Resource Management Review, 12, 313-337.  \nGlass, J. L., & Riley, L. (1998). Family responsive policies and employee retention \nfollowing childbirth. Social Forces, 76(4), 1401-1435. \nGoff, S. J., Mount, M. K., & Jamison, R. L. (1990). Employer supported child care, \nwork\/family conflict, and absenteeism: A field study. Personnel Psychology, \n43, 793-809. \nGoldberg, W. A., Greenberger, E., Koch-Jones, J., O’Neil, R., & Hamill, S. (1989). \nAttractiveness of child care and related employer-supported benefits and \npolicies to married and single parents. Child and Youth Care Quarterly, 18, \n23-37.  \nGolden, L. (2001). Flexible work schedules: What are we trading off to get them? \nMonthly Labor Review, 124(3), 50-67. \nGraham, S. (1995). Narrative versus meta-analytic reviews of race differences in \nmotivation: A comment on Cooper and Dorr. Review of Educational Research, \n65(4), 509-514. \nGreenhaus, J. H., Collins, K. M., Singh, R., & Parasuraman, S. (1997). Work and \nfamily influences on departure from public accounting. Journal of Vocational \nBehavior, 50, 249-270.  \n                                                Work-Life Practices and Organizational Performance 43 \nGreenhaus, J. H., Parasuraman, S., Granrose, C. S., Rabinowitz, S., & Beutell, N. J. \n(1989). Sources of work-family conflict among two-career couples. Journal of \nVocational Behavior, 34(2), 133-153.  \nGrover, S. L., & Crooker, K. J. (1995). Who appreciates family-responsive human \nresource policies: The impact of family-friendly policies on the organizational \nattachment of parents and non-parents. Personnel Psychology, 48, 271-288. \nHall, D.T.  (1990).  Promoting work\/family balance: An organization \nchange approach.  Organizational Dynamics, 18, 3, 5-18. \nHalpern, D. F. (2005). How time-flexible work policies can reduce stress, improve \nhealth, and save money. Stress and Health, 21(3), 157-168.  \nHamilton, E. A., Gordon, J. R., & Whelan-Berry, K. S. (2006). Understanding the \nwork-life conflict of never-married women without children. Women in \nManagement Review, 21(5), 393-415. \nHegtvedt, K., Clay-Warner, J., & Ferrigno, E. (2002). Reactions to injustice: Factors \naffecting workers’ resentment toward family-friendly policies. Social \nPsychology Quarterly, 65(4), 386-400. \nHill, E. J., Hawkins, A. J., Ferris, M., & Weitzman, M. (2001). Finding an extra day a \nweek: The positive influence of perceived job flexibility on work and family \nlife balance. Family Relations, 50, 49-58. \nHill, E. J., Miller, B. C., Weiner, S. P., & Colihan, J. (1998). Influences of the virtual \noffice on aspects of work and work\/life balance. Personnel Psychology, 51, \n667-683. \nHofferth, S. L. (1996). Effects of public and private policies on return to work after \nchildbirth. Work and Occupations, 23, 378-404. \n                                                Work-Life Practices and Organizational Performance 44 \nHoneycutt, T. L., & Rosen, B. (1997). Family friendly human resource policies, salary \nlevels, and salient identity as predictors of organizational attraction. Journal of \nVocational Behavior, 50, 271-290.  \nHouston, D. M., & Waumsley, J. A. (2003). Attitudes to flexible working and family \nlife. York: JRF Policy Press.  \nHuman Resources and Social Development Canada (2006). The business case for \nwork-life balance. Retrieved December 1, 2006 from \nhttp:\/\/www.hrsdc.gc.ca\/en\/lp\/spila\/wlb\/16benefits_costs_businesscase.shtml.  \nJohnson, N., & Provan, K. (1995). The relationship between work\/family benefits and \nearnings: A test of competing predictions. Journal of Socio-Economics, 24(4), \n571-584. \nJudge, T. A., Boudreau, J. W., & Bretz, R. D. (1994). Job and life attitudes of male \nexecutives. Journal of Applied Psychology, 79(5), 767-782.  \nJudiesch, M. K., & Lyness, K. S. (1999). Left behind? The impact of leaves of \nabsence on managers’ career success. Academy of Management Journal, \n42(6), 641-651. \nKersley, B., Alpin, C., Forth, J., Bryson, A., Bewley, H., Dix, G., & Oxenbridge, S. \n(2005). Inside the workplace: First findings from the 2004 Workplace \nEmployment Relations Survey. London: Department of Trade and Industry.  \nKinnunen, U. & Mauno, S. (1998). Antecedents and outcomes of work-life conflict \namong employed women and men in Finland. Human Relations, 51(2), 157-\n177. \nKleiner, G. E. (2006). Consequences of work-home segmentation or integration: a \nperson-environment fit perspective. Journal of Organizational Behavior, 27, \n485-507.  \n                                                Work-Life Practices and Organizational Performance 45 \nKodz, J., Harper, H., & Dench, S. (2002). Work-life balance: Beyond the rhetoric. \nInstitute for Employment Studies Report 384. London: IES. \nKonrad, A., & Mangel, R. (2000). The impact of work-life programs on firm \nproductivity. Strategic Management Journal, 21(12), 1225-1237. \nKossek, E. E., Lautsch, B. A., & Eaton, S. C. (2006). Telecommuting, control, and \nboundary management: Correlates of policy use and practice, job control, and \nwork–family effectiveness. Journal of Vocational Behavior, 68(2), 347-367.  \nKossek, E. E., & Nichol, V. (1992). The effects of on-site child care on employee \nattitudes and performance. Personnel Psychology, 45, 485-509.  \nKossek, E. E., & Ozeki, C. (1998). Work-family conflict, policies, and the job-life \nsatisfaction relationship: A review and directions for organizational behavior-\nHuman Resources research. Journal of Applied Psychology, 83(2), 139-149. \nKossek, E. E., & Ozeki, C. (1999). Bridging the work-family policy and productivity \ngap: A literature review. Community, Work and Family, 2(1), 7-32. \nLambert, S. J. (2000). Added benefits: The link between work-life benefits and \norganizational citizenship behavior. Academy of Management Journal, 43 (5), \n801-815. \nLee, C. M., & Duxbury, L. (1998). Employed parents' support from partners, \nemployers, and friends. Journal of Social Psychology, 138(3), 303-322. \nLewis, S. (1997). ‘Family Friendly’ employment policies: A route to changing \norganizational culture or playing about at the margins? Gender, Work and \nOrganization, 4(1), 13-24. \nLewis, S., Kagan, C., & Heaton, P. (2000). Managing work-family diversity for \nparents of disabled children: Beyond policy to practice and partnership. \nPersonnel Review, 29(3), 417-430. \n                                                Work-Life Practices and Organizational Performance 46 \nLewis, S., & Smithson, J. (2001). Sense of entitlement to support for the \nreconciliation of employment and family life. Human Relations, 54(11), 1455-\n1481. \nLiff, S., & Cameron, I. (1997). Changing equality cultures to move beyond “women’s \nproblems”. Gender, Work and Organization, 4(1), 35-46. \nLoscocco, K. A. (1997). Work-family linkages among self-employed women and \nmen. Journal of Vocational Behavior, 50, 204-226. \nMacEwen, K. E., & Barling, J. (1994). Daily consequences of work interference with \nfamily and family interference with work. Work and Stress, 8, 244-254.  \nMcDonald, P., Guthrie, D., Bradley, L., & Shakespeare-Finch, J. (2005). Investigating \nwork-family policy aims and employee experiences. Employee Relations, \n27(5), 478-494. \nMeyer, C. S., Mukerjee, S., & Sestero, A. (2001). Work-life benefits: Which ones \nmaximize profits? Journal of Managerial Issues, 13(1), 28-44. \nMilkovich, G. T., & Gomez, L. R. (1976). Day care and selected employee work \nbehaviors. Academy of Management Journal, 19(1), 111-115. \nNelson, D. L., Quick, J. C., Hitt, M. A., & Moesel, D. (1990). Politics, lack of career \nprogress, and work\/home conflict: Stress and strain for working women. Sex \nRoles, 23(3\/4), 169-185. \nNetemeyer, R. G., Boles, J. S., & McMurrian, R. (1996). Development and validation \nof work-family conflict and family-work conflict scales. Journal of Applied \nPsychology, 81(4), 400-410.  \nO’Driscoll, M., Poelmans, S., Spector, P., Kalliath, T., Allen, T., Cooper, C., & \nSanchez, J. (2003). Family-responsive interventions, perceived organizational \n                                                Work-Life Practices and Organizational Performance 47 \nand supervisor support, work-family conflict and psychological strain. \nInternational Journal of Stress Management, 10(4), 326-344. \nOrthner, D. K., & Pittman, J. F. (1986). Family contributions to work commitment. \nJournal of Marriage and the Family, 48(3), 573-581.  \nParker, L. B., & Allen, T. D. (2002, April). Factors related to supervisor work\/family \nsensitivity and flexibility. Paper presented at the Annual Conference of the \nSociety for Industrial and Organizational Psychology, Toronto, Ontario. \nPerlow, L. A. (1995). Putting the work back into work\/family. Group and \nOrganization Management, 20, 227-239. \nPerry-Smith, J. E., & Blum, T. C. (2000). Work-life human resource bundles and \nperceived organizational performance. Academy of Management Journal, \n43(6), 1107-1117. \nPfeffer, J. (1981). Management as symbolic action: The creation and maintenance of \norganizational paradigms. In L. L. Cummings and B. M. Staw (Eds.), \nResearch in organizational behavior, vol. 3 (pp. 1-52). Greenwich, CT: JAI \nPress.  \nPierce, J. L., & Newstrom, J. W. (1982). Employee responses to flexible work \nschedules: An inter-organization, inter-system comparison. Journal of \nManagement, 8(1), 9-25.  \nPleck, J. H. (1993). Are “family-supportive” employer policies relevant to men? In J. \nC. Hood (Ed.), Men, Work, and Family: 217-237. Newbury Park, CA: Sage.  \nPowell, G. N. & Mainiero, L. A. (1999). Managerial decision making regarding \nalternative work arrangements. Journal of Occupational and Organizational \nPsychology, 72, 41-56. \n                                                Work-Life Practices and Organizational Performance 48 \nPremeaux, S. F., Adkins, C. L., & Mossholder, K. W. (2007). Balancing work and \nfamily: A field study of multi-dimensional, multi-role work-family conflict. \nJournal of Organizational Behavior, 28, 705-727.  \nRaabe, P. H. (1996). Constructing pluralistic work and career arrangements. In S. \nLewis & J. Lewis (Eds.), The work-life challenge: Rethinking employment (pp. \n128-141). London: Sage. \nRoehling, P. V., Roehling, M. V., & Moen, P. (2001). The relationship between work-\nlife policies and practices and employee loyalty: A life course perspective. \nJournal of Family and Economic Issues, 22(2), 141-170. \nRogier, S.A., & Padgett, M. Y.  (2004).  The impact of utilizing a flexible work \nschedule on the perceived career advancement potential of women.  Human \nResource Development Quarterly, 15, 89-106. \nRothausen, T. J. (1994). Job satisfaction and the parent worker: The role of flexibility \nand rewards. Journal of Vocational Behavior, 44(3), 317-336. \nRothbard, N. P., Phillips, K. W., & Dumas, T. L. (2005). Managing multiple roles: \nWork-family policies and individuals’ desires for segmentation. Organization \nScience, 16(3), 243-258. \nRousseau, D. M. (1995). Psychological contracts in organizations: Understanding \nwritten and unwritten agreements. Thousand Oaks, CA: Sage. \nRyan, A. M., & Kossek, E. E. (2008). Work-life policy implementation: Breaking \ndown or creating barriers to inclusiveness?  Human Resource Management, \n47(2), 295-310. \nSaltzstein, A. L., Ting, Y., & Saltzstein, G. H. (2001). Work-family balance and job \nsatisfaction: The impact of family-friendly policies on attitudes of federal \ngovernment employees. Public Administration Review, 61(4), 452-467. \n                                                Work-Life Practices and Organizational Performance 49 \nScandura, T. A., & Lankau, M. J. (1997). Relationships of gender, family \nresponsibility and flexible work hours to organizational commitment and job \nsatisfaction. Journal of Organizational Behavior, 18, 377-391. \nSecret, M. (2006). Integrating paid work and family work. Community, Work and \nFamily, 9(4), 407-427.  \nShepard, E., Clifton, T. & Kruse, D. (1996). Flexible work hours and productivity: \nSome evidence from the pharmaceutical industry, Industrial Relations, 35(1), \nJanuary, 123-39. \nSlavin, R.E. (1986). Best-evidence synthesis: An alternative to meta-analytic and \ntraditional reviews. Educational Researcher, 15(9), 5-11. \nStanden, P., Daniels, K., & Lamond, D. (1999). The home as a workplace: Work-\nfamily interaction and psychological well-being in telework. Journal of \nOccupational Health Psychology, 4(4), 368-381. \nTausig, M., & Fenwick, R. (2001). Unbinding time: Alternate work schedules and \nwork-life balance. Journal of Family and Economic Issues, 22(2), 101-119. \nThompson, C. A., Beauvais, L. L., & Lyness, K. S. (1999). When work-life benefits \nare not enough: The influence of work-life culture on benefit utilization, \norganizational attachment, and work-life conflict. Journal of Vocational \nBehavior, 54, 392-415. \nTurban, D. B., & Keon, T. L. (1993). Organizational attractiveness: An interactionist \nperspective. Journal of Applied Psychology, 78(2), 184-193.  \nUS Bureau of Labor (2007). Employee benefits survey. Retrieved 11 August 2007 \nfrom http:\/\/data.bls.gov\/cgi-bin\/surveymost.  \n                                                Work-Life Practices and Organizational Performance 50 \nWang, P., & Walumbwa, F. O. (2007). Family-friendly programs, organizational \ncommitment, and work withdrawal: The moderating role of transformational \nleadership. Personnel Psychology, 60, 397-427. \nWayne, J. H., & Cordeiro, B.L.  (2003).  Who is a good organizational citizen?  Social \nperception of male and female employees who use family leave.  Sex Roles, \n49, 233-246. \nWayne, J. H., Musisca, N., & Fleeson, W. (2004). Considering the role of personality \nin the work-life experience: Relationships of the big five to work-life conflict \nand facilitation. Journal of Vocational Behavior, 64(1), 108-130. \nWhitehouse, G., & Zetlin, D. (1999). Family friendly policies: Distribution and \nimplementation in Australian workplaces. Economic and Labour Relations \nReview, 10(2), 221-239.  \nWilliams, M. L., Ford, L. R., Dohring, P. L., Lee, M. D., & MacDermid, S. M. (2000, \nAugust). Outcomes of reduced load work arrangements at managerial and \nprofessional levels: Perspectives from multiple stakeholders. Paper presented \nat the Annual Meeting of the Academy of Management, Toronto, ON. \nWood, S. J., & de Menezes, L.  (2008). Family-friendly management, organizational \nperformance and social legitimacy. Mimeo, Sheffield: Institute of Work \nPsychology, University of Sheffield. \nYeandle, S., Crompton, R., Wigfield, A., & Dennett, J. (2002). Employed carers and \nfamily-friendly employment policies. London: Joseph Rowntree Foundation \nPolicy Press.  \nYoungblood, S., & Chambers-Cook, K. (1984). Child care assistance can improve \nemployee attitudes and behavior. Personnel Administrator, 29, 45-47. \nFigure 1: Model of proposed relationships between the provision of work-life balance practices and organizational performance \n Organizational work-\nlife climate \/ \nManagerial support \nNational \ncontext \nGender; \njob level \nProvision of \nwork-life \nbalance practices \nUse of practices \nLonger work hours; increased \ncontrol; more effort \nLower wages; more investment \nIndividual \ndifferences \nAnticipated organizational support \nPerceived \norganizational support \nReduced work-life conflict\nImproved productivity \nCost savings\nImproved retention \nImproved recruitment \nOrganizational \nperformance \nOrganizational \ncitizenship behaviour \nIndividual-level explanations \nImproved job-related attitudes \nOrganization-level explanations \n"}