{"doi":"10.1016\/j.agsy.2010.03.010","coreId":"140811","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6476","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6476","10.1016\/j.agsy.2010.03.010"],"title":"Potential, spatial distribution and economic performance of regional biomass\nchains: The North of the Netherlands as example","authors":["van der Hilst, F.","Dornburg, V.","Sanders, J. P. M.","Elbersen, B.","Graves, Anil R.","Turkenburg, W. C.","Elbersen, H. W.","van Dam, J. M. C.","Faaij, A. P. C."],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2010-09-01T00:00:00Z","abstract":"This work assesses the viability of regional biomass chains by comparing the\neconomic performance of potential bioenergy crops with the performance of\ncurrent agricultural land uses. The biomass chains assessed are ethanol\nproduction from Miscanthus and from sugar beet in the North of the Netherlands.\nThe competitiveness of bioenergy crops is assessed by comparing the Net Present\nValue (NPV) of perennial crops, current rotations, and rotation schemes which\ninclude additional years of sugar beet. The current land use and soil\nsuitability for present and bioenergy crops are mapped using a geographical\ninformation system (GIS) and the spatial distribution of economic profitability\nis used to indicate where land use change is most likely to occur. Bioethanol\nproduction costs are then compared with petrol costs. The productions costs\ncomprise costs associated with cultivation, harvest, transport and conversion to\nethanol. The NPVs and cost of feedstock production are calculated for seven soil\nsuitability classes. The results show that bioenergy crops are not competitive\nwith current cropping systems on soils classed as “suitable”. On less suitable\nsoils, the return on intensively managed crops is low and perennial crops\nachieve better NPVs than common rotations. Our results showed that minimum\nfeedstock production costs are 5.4 €\/GJ for Miscanthus and 9.7 €\/GJ for sugar\nbeet depending on soil suitability. Ethanol from Miscanthus (24 €\/GJ) is a\nbetter option than ethanol from sugar beet (27 €\/GJ) in terms of costs. The cost\nof bioethanol production from domestically cultivated crops is not competitive\nwith petrol (12.34€\/GJ) production under current circumstances. We propose that\nthe method demonstrated in this study provides a generic approach for\nidentifying viable locations for bioenergy crop production based on soil\nproperties and cu","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140811.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.agsy.2010.03.010","pdfHashValue":"df53e6508a6d4813ff0e2f5a07cc4b9568f65300","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6476<\/identifier><datestamp>2011-10-18T13:50:13Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Potential, spatial distribution and economic performance of regional biomass\nchains: The North of the Netherlands as example<\/dc:title><dc:creator>van der Hilst, F.<\/dc:creator><dc:creator>Dornburg, V.<\/dc:creator><dc:creator>Sanders, J. P. M.<\/dc:creator><dc:creator>Elbersen, B.<\/dc:creator><dc:creator>Graves, Anil R.<\/dc:creator><dc:creator>Turkenburg, W. C.<\/dc:creator><dc:creator>Elbersen, H. W.<\/dc:creator><dc:creator>van Dam, J. M. C.<\/dc:creator><dc:creator>Faaij, A. P. C.<\/dc:creator><dc:description>This work assesses the viability of regional biomass chains by comparing the\neconomic performance of potential bioenergy crops with the performance of\ncurrent agricultural land uses. The biomass chains assessed are ethanol\nproduction from Miscanthus and from sugar beet in the North of the Netherlands.\nThe competitiveness of bioenergy crops is assessed by comparing the Net Present\nValue (NPV) of perennial crops, current rotations, and rotation schemes which\ninclude additional years of sugar beet. The current land use and soil\nsuitability for present and bioenergy crops are mapped using a geographical\ninformation system (GIS) and the spatial distribution of economic profitability\nis used to indicate where land use change is most likely to occur. Bioethanol\nproduction costs are then compared with petrol costs. The productions costs\ncomprise costs associated with cultivation, harvest, transport and conversion to\nethanol. The NPVs and cost of feedstock production are calculated for seven soil\nsuitability classes. The results show that bioenergy crops are not competitive\nwith current cropping systems on soils classed as “suitable”. On less suitable\nsoils, the return on intensively managed crops is low and perennial crops\nachieve better NPVs than common rotations. Our results showed that minimum\nfeedstock production costs are 5.4 €\/GJ for Miscanthus and 9.7 €\/GJ for sugar\nbeet depending on soil suitability. Ethanol from Miscanthus (24 €\/GJ) is a\nbetter option than ethanol from sugar beet (27 €\/GJ) in terms of costs. The cost\nof bioethanol production from domestically cultivated crops is not competitive\nwith petrol (12.34€\/GJ) production under current circumstances. We propose that\nthe method demonstrated in this study provides a generic approach for\nidentifying viable locations for bioenergy crop production based on soil\nproperties and cur<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-17T23:03:13Z<\/dc:date><dc:date>2011-10-17T23:03:13Z<\/dc:date><dc:date>2010-09-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>F. van der Hilsta, V. Dornburg, J.P.M. Sanders, B. Elbersen, A. Graves, W.C. Turkenburg, H.W. Elbersen, J.M.C. van Dam, A.P.C. Faaij, Potential, spatial distribution and economic performance of regional biomass\nchains: The North of the Netherlands as example, Agricultural Systems, Volume 103, Issue 7, September 2010, Pages 403-417.<\/dc:identifier><dc:identifier>0308-521X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.agsy.2010.03.010<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6476<\/dc:identifier><dc:rights>NOTICE: this is the author’s version of a work that was accepted for publication in Agricultural Systems. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Agricultural Systems, VOL 103, ISSUE 7, (2010) DOI: 10.1016\/j.agsy.2010.03.010<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0308-521X","0308-521x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":"1Potential, spatial distribution and economic performance of regional1\nbiomass chains; the North of the Netherlands as example2\n3\nF. van der Hilst1,2*, V. Dornburg1, J.P.M. Sanders2, B. Elbersen3, A. Graves4, W.C. Turkenburg1,4\nH.W. Elbersen5 , J.M.C. van Dam,1 A.P.C. Faaij15\n1 Copernicus Institute for Sustainable Development and Innovation, Utrecht University, The Netherlands6\n2 Valorisation of plant production chains, Wageningen University and Research centre, The Netherlands7\n3 Alterra, Wageningen University and Research centre, The Netherlands8\n4 Natural Resource Management Institute, Cranfield University, Cranfield, UK9\n5 Agrotechnology & Food sciences group, Wageningen University and Research centre, The Netherlands10\n* Corresponding Author, Utrecht University, Heidelberglaan 2, 3581 CS Utrecht, The Netherlands. Tel.: +31 (0)30 25311\n7609 Fax: +31 (0)30 253 7601 email: f.vanderhilst@uu.nl12\n13\nAbstract14\nThis work assesses the viability of regional biomass chains by comparing the economic performance15\nof potential bioenergy crops with the performance of current agricultural land uses. The biomass16\nchains assessed are ethanol production from Miscanthus and from sugar beet in the North of the17\nNetherlands. The competitiveness of bioenergy crops is assessed by comparing the Net Present Value18\n(NPV) of perennial crops, current rotations, and rotation schemes which include additional years of19\nsugar beet. The current land use and soil suitability for present and bioenergy crops are mapped20\nusing a geographical information system (GIS) and the spatial distribution of economic profitability21\nis used to indicate where land use change is most likely to occur. Bioethanol production costs are then22\ncompared with petrol costs. The productions costs comprise costs associated with cultivation,23\nharvest, transport and conversion to ethanol. The NPVs and cost of feedstock production are24\ncalculated for seven soil suitability classes. The results show that bioenergy crops are not competitive25\nwith current cropping systems on soils classed as “suitable”. On less suitable soils, the return on26\nintensively managed crops is low and perennial crops achieve better NPVs than common rotations.27\nOur results showed that minimum feedstock production costs are 5.4 €\/GJ for Miscanthus and 9.728\n2€\/GJ for sugar beet depending on soil suitability. Ethanol from Miscanthus (24 €\/GJ) is a better1\noption than ethanol from sugar beet (27 €\/GJ) in terms of costs. The cost of bioethanol production2\nfrom domestically cultivated crops is not competitive with petrol (12.34€\/GJ) production under3\ncurrent circumstances. We propose that the method demonstrated in this study provides a generic4\napproach for identifying viable locations for bioenergy crop production based on soil properties and5\ncurrent land use.6\n7\nKey words: bioethanol, economic analysis, crop production, spatial distribution, sugar beet,8\nMiscanthus9\n10\n1 Introduction11\nEnergy from biomass, including biofuels like ethanol, can play a major role in local, national and12\nglobal energy supplies depending on land availability, costs, and supply. However, in both13\nscientific and political arenas, it is seen that such bioenergy chains need to evolve in a way that is14\ncompatible with Sustainable Development.15\n16\nIn recent years, several studies (e.g. Hoogwijk, 2005; Dornburg 2008; Smeets 2007) have17\nassessed the world bioenergy potential and the contribution to the world energy demand. Other18\nstudies have focused on bioenergy potential and related costs at a European level (EEA 2006; van19\nDam et al. 2007; de Wit and Faaij 2010; Fischer et al. 2010a; Fischer et al. 2010b) or national20\nlevel (Broek et al. 2001; Batidzirai et al. 2006; Styles and Jones 2007). However, few studies21\ndescribe the spatial variation of bioenergy production potential and the cost of bioenergy supply22\nwithin a region. Since the physical environment is spatially heterogeneous, location is a key23\nfactor for the economic viability and environmental performance of bioenergy production.24\nBecause economic benefit is a major incentive for adoption, this paper focuses on the competitive25\n3advantage of bioenergy crops in relation to conventional land use in order to increase1\nunderstanding of where, and on which types of soils, such land use changes might occur.2\n3\nEthanol production from Miscanthus (Miscanthus x Giganteus) and sugar beet (Beta vulgaris L.)4\nin the North of the Netherlands is selected for our case study. This region is important as a test5\ncase, because of the high pressure on land for various uses including intensive agriculture. This6\nenables an extensive analysis of the economic viability of regional biomass chains. Sugar beet7\nand Miscanthus are selected because of their high potential yields and because they represent a8\ntypical first and second generation bioenergy chain. These are compared with current land use to9\ndetermine their relative economic viability.10\n11\nIn Section 2, we elaborate on the design of the bioenergy chains, the characteristics of the region12\nand the potential land availability in the region. In Section 3, the methods applied to asses the13\ncompetitiveness of new bioenergy crops compared to current land use and the methods to14\ncalculate the cost of feedstock and ethanol production will be discussed. The approach to15\ndetermine the soil suitability and the effect on the spatial variation of economic performance of16\npotential and current land use is described in section 3.3. In Section 4 the results of the17\nassessment are presented and the spatial variation is depicted in maps of the region. A sensitivity18\nanalysis shows the level of robustness of the results. In Section 5, the applied method, the data19\nused and the results are discussed, and in Section 6, conclusions are drawn.20\n21\n42 Case study description1\n2.1 Study region2\nThe Northern region of the Netherlands (Groningen, Friesland and Drenthe) was selected as the3\narea for our research for several reasons. Firstly, the Dutch government has provided clear targets4\nfor substitution of fossil fuel and green house gas emission reduction (Menkveld 2007; Ministerie5\nvan VROM 2007; Ministerie van Economische zaken 2008). Secondly, the pressure on land is6\nrelatively high due to a high population density, diverse land uses and an intensive agricultural7\nsector, resulting in intense competition between different land uses. Thirdly, access to sea8\ntransport through the Eemshaven ports facilitates the possible transport of biomass feedstock and9\nintermediate- or end-products to and from the rest of the world. Fourthly, this is a highly10\nproductive agricultural area with fertile soils, favourable climatic conditions, and advanced11\nagricultural management (Romkes and Oenema 2004) with a farming population that is interested12\nin alternative economic activities for the agricultural sector. Finally, several regional13\nstakeholders have also articulated on the need for sustainable development in the region (Costa14\nDue 2009; Energy Valley 2009).15\n16\nThe region has a mild maritime climate with average temperatures of 16 ºC during summer and 317\nºC degrees during winter (KNMI 2002). The most common soil types in the Northern region of18\nthe Netherlands are sand, clay, sandy clay and peat, and soils are generally fertile. Precipitation is19\nrelatively high as are ground water levels. The climate and soils are suitable for a wide range of20\ncrops (Christian et al. 2001)21\n22\nLand use in the region (1.1 Mha) is dominated by agricultural activities: 68% of the total area is23\nagricultural land of which 41% is used for agricultural crops and 57% for pastures. On parts of24\nthe pasture areas, silage maize is continuously cultivated by intensive cattle breeders. Cereals,25\n5potatoes, sugar beet and silage maize are the most dominant crops cultivated in rotation. Two1\ncommon rotations schemes for sandy soils and two rotations schemes for clay soils are selected to2\nrepresent current land use of arable land in the region and are depicted in Table 1.3\n4\nTable 15\n6\nDue to intensive livestock production, the Netherlands faces a manure surplus. Because of the7\ncosts of managing this surplus, the application of manure on agricultural land has negative costs.8\nTherefore, application rates are high in pasture areas with intensive cattle breeding.9\n10\nTransport infrastructure in the region is well developed. Whilst waterways and railways are11\navailable, road transport is most convenient way of transporting agricultural goods within the12\nregion due to the relatively short distances and the flexibility that multiple production sites13\nrequire (Hamelinck et al. 2005b). Rail and waterways and the Northern ports, connect this region14\nto the rest of Europe and beyond.15\n2.2 Biomass potential in the region16\nThe introduction of bioenergy crops to large areas of land would create competition with the food17\nand feed crops already being grown in the region. Thus, in order to define a limit to the arable18\nland available for bioenergy production, information provided by the EU Refuel project is used19\n(de Wit and Faaij 2010). One of the objectives of the Refuel project was to map the potential20\nproduction and costs of biomass crops in the EU for different time frames and for several land use21\nscenarios. The method used in this study is comparable the approaches used by (Smeets et al.22\n2007) and (van Dam et al. 2007). In the Refuel approach, projections are used to describe the23\nfuture dynamics of population growth, food intake per capita, agricultural production intensity,24\nlivestock intensity and land requirements for the growth of cities, villages and infrastructure25\n6(Fischer et al. 2010a; Fischer et al. 2010b). The land available for biomass production is1\ncalculated by subtracting the land needed for other land use functions (including nature) from the2\ntotal available land, assuming the self-sufficiency in food production in the region remains3\nconstant. In the Refuel study it is assumed that typical agricultural crops are only produced on4\narable land, while for herbaceous crops like Miscanthus it is assumed that pasture could also5\nbecome available.6\n7\nThe base case scenario of the Refuel assessment is derived from the Common Agricultural Policy8\n(CAP) of the EU. In addition, a more optimistic (high land availability) and a more pessimistic9\n(low land availability) variant have been developed.10\nIn Table 2, the amount of agricultural land that according to the Refuel results could become11\navailable for biomass production in the North of the Netherlands in 2015 and 2030 is depicted.12\nThe Refuel projections of land availability for biomass production in the North of the Netherlands13\nare somewhat higher but in the same order of magnitude as the projected land availability of the14\nEururalis project (Westhoek et al. 2006; Eickhout and Prins 2008)15\n16\nTable 217\nIn this study, the Refuel project is used to indicate what proportion of land could be converted for18\nbioenergy production without diminishing the region’s current self-sufficiency in food. In19\naddition, data in the Refuel project are used to estimate the appropriate scale of conversion plants20\nfor the region.21\n22\n2.3 Bioenergy chains23\nIn this study, we investigate ethanol production from sugar beet and Miscanthus. These two24\nbioenergy chains are selected because of their potential for high yields (Huisman et al. 1997;25\n7Elbersen et al. 2005; PPO et al. 2006; van der Voort et al. 2008) and because of the developing1\nmarket for ethanol in the Netherlands created by European biofuel policies. In addition, the two2\nbioenergy chains are chosen because they have very different cultivation requirements and3\nconversion technologies, since they are typical of first and second generation bioethanol supply4\nchains.5\n6\nSugar beet7\nSugar beet requires good quality soils and high inputs and is generally grown in rotation with8\ncereals and potatoes. In our study, it is assumed that sugar beet for ethanol production is9\ncultivated on land currently in use as arable land (as in the Refuel study, pasture is excluded for10\ntypical agricultural crops). This implies that the proportion of sugar beet needs to be increased11\nwithin the current rotation schemes. Because the excessive use of beet or other intensive crops12\nincreases the risks of diseases and yield loss (Kempenaar et al. 2003), it is assumed that the13\nproportion of sugar beet does not exceed 25% of the rotation, and that the total proportion of land14\nassigned to intensively managed crops does not increase from current levels.15\n16\nCurrent CAP regulations for sugar comprise of a quota and a price regime. The quota limits the17\nproduction of sugar per county and the price regime sets a guaranteed intervention price for this18\nquota. Sugar produced over the quota is sold on the world market, at considerably lower prices19\nthan EU quota prices. Since extra beet exceeds the quota for sugar production, sugar beet for20\nethanol production is less profitable than for sugar production. For this reason, it is assumed that21\nthe growth of sugar beet for ethanol is additional to that sold in sugar beet quota. Management22\nand transport of sugar beet for ethanol production is assumed to be similar to current practice in23\nthis region. Once harvested, sugar beet cannot be preserved. The harvest window lasts from24\nSeptember until the end of December, thus maximizing the load factor of the beet processing25\nplant. It is assumed the sugar beet, including 15% tare (soil attached to the beet), is transported by26\n8truck to a newly built ethanol plant close to the current sugar plant centrally located within the1\nagricultural area. Since long distance transport of sugar beet is not economically attractive, the2\nconversion plant is assumed to be of a size appropriate for the expected supply of sugar beets in3\nthe region, i.e. 700 kton (fresh weight) input per year (90 MWinput, 1.5 PJethanol). This figure is4\nderived from predictions made in the Refuel project on the maximum land available for arable5\nbioenergy crops in 2015 (9.6 kha, see section 2.2) and the attainable yield on very suitable soils6\n(73 tonfresh ha-1y-1, 23% dm, 16% sugar). In the ethanol plant, sugar beet is shredded into cossettes7\nand diffused in water to produce raw sugar beet juice and pulp. Pulp is further processed for8\nanimal feed and put on the market as a co-product. The raw juice is pasteurized, fermented, and9\ndistilled in order to produce ethanol.10\n11\nMiscanthus12\nMiscanthus is a perennial crop with a rotation of 20 years. It requires few inputs and is relatively13\ninsensitive to soil conditions (Venturi et al. 1999; Bullard 2001; Bullard and Matcalfe 2001;14\nLewandowski and Heinz 2003; Lewandowski et al. 2003; Khanna et al. 2008).15\n16\nIn our study, it is assumed that Miscanthus can be cultivated on agricultural land that is currently17\nin use as arable land and as pasture (as in the Refuel study )(de Wit and Faaij 2010). Although the18\nhighest yields are achieved when Miscanthus is harvested in autumn, harvest does not take place19\nuntil spring, when the highest dry matter content and quality is achieved. Due to nutrient20\nremobilization during winter, the removal of nutrients from the soil is lower in delayed harvests21\n(Himken et al. 1997; Ercoli et al. 1999; Lewandowski and Heinz 2003; Monti et al. 2008) and this22\nis preferable, since lower moisture, nutrient and ash contents are also beneficial for processing. It23\nis assumed that harvesting takes place using a self propelled chopper, as this has been identified24\nas the cheapest option in other studies (Smeets et al. 2009). In addition, chopped Miscanthus dries25\nmore easily and this improves future processing. Because ethanol production is assumed for the26\n9entire year, a continuous biomass supply is required. Therefore, an average storage time of 61\nmonths is assumed, with an average dry matter loss of 2% over this 6 months (Smeets et al.2\n2009). The ‘chips’ are assumed to be transported to a lignocellulose ethanol plant by truck.3\n4\nAfter physical size reduction, the cellulose is broken down into free glucose molecules by5\nenzymatic hydrolysis (Hamelinck and Faaij 2006). In the fermentation step, the free sugars are6\nconverted to ethanol. Within the timeframe considered by this study, dilute acid pre-treatment,7\non-site enzyme production, enzymatic cellulose hydrolysis, and an Simultaneous Saccharification8\nand Fermentation (SSF) configuration boiler and steam turbine, are expected to be the most9\nprominent technologies for converting lignocellose crops to ethanol (Hamelinck et al. 2005a).10\nThe characteristics of this conversion pathway are therefore assumed for this study. From an11\neconomic perspective, large scale facilities are preferable to small scale facilities and a capacity12\nof 400 MW is generally required to achieve reasonable production costs (Hamelinck et al. 2005a).13\nTherefore, it is assumed that Miscanthus is processed in a 400MW ethanol plant (640 kton odt14\nannual input, 4 PJethanol) that is located close to the port of Eemshaven. Since the expected15\nregional feedstock supply does not meet the input requirements of a plant of this size, it is16\nassumed that 70% of the lignocellulosic material will have to come from international supply17\nchains. It is assumed that the import of lignocellulose material from abroad is feasible because of18\nrelatively low production costs, because pre-treatment can be applied, and because of the19\nrelatively low cost of international sea transport (Hamelinck et al. 2005b).20\n21\nIn order to put these two bioenergy chains into context, other ethanol production chains are also22\nassessed. Ethanol from currently cultivated annual crops such as wheat and maize are considered23\nas are perennial crops like switchgrass and willow.24\n25\n10\nSpecific data regarding required field operations, seed fertilizer and pesticide application, yield1\nlevels and dry matter content, transport of biomass and conversion to ethanol are provided in the2\nsupplementary on-line material.3\n4\n3 Method5\nThe competitiveness of the bioenergy chains is assessed by comparison of the economic6\nperformance of the bioenergy crops with the current use of agricultural land and by comparison7\nof the production cost of bioethanol with average petrol prices. The way the spatial distribution8\nof soil suitability and current agricultural land use affect competitiveness of bioethanol chains9\nwill be addressed. First, calculation methods for the economic competiveness of crops and the10\nproduction costs are discussed. Thereafter, the method to determine the spatial distribution of soil11\nsuitability for individual crops and the effect on economic performance is considered.12\n13\n3.1 NPV calculations for crop production14\nIn order to compare both annual and perennial crops, all costs and benefits during the cultivation15\nphase are discounted and aggregated to provide their Net Present Value (NPV) (Equation 1). The16\nNPV of the various rotations are calculated by multiplying the NPV of the individual crops by17\ntheir proportional share in the rotation (see Table 1).18\n19\n   \n \n \n\n \n\n\n\nxY\nY\ny\nN\nn\nM\nm\nmmynny\ncr a\nCJBI\nNPV\n1\n1 1\n1 (Equation 1)\n20\n21\nNPVcr = Net Present Value of crop per ha [€\/ha]22\nI = occurrence positive monetary flow n in year y [# ]23\n11\nB = revenues of monetary flow n per ha [€\/ha]1\nJ = occurrence of negative monetary flow m in year y [ #]2\nC = cost of monetary flow m per ha [€\/ha]3\na = discount rate [%]4\ny = annuity period [y]5\n6\nThe annuity time period considered here is 20 years, which is in line with the lifetime of the7\nperennial crops and the lifetime of conversion plants (see Table A7 of the online supplementary8\nmaterial). A discount rate of 5.5% is assumed. This is a realistic interest rate for farmer loans9\n(Wolf and Klooster 2006; personal communication, J. Houtsma, da Vinci Finance Friesland) but10\nis considered to be low for commercial investment projects.11\n12\nFor pasture, the NPV of grassland is compared to the NPV of Miscanthus. The revenue from13\npasture is represented by the avoided cost of fodder and the benefits related to manure14\napplication. For arable land, the best rotation for the specific soil type (clay\/sand) is compared to15\na rotation with an increased proportion of sugar beet and to Miscanthus.16\n17\nThe costs and revenues of crop production depend on soil and climate, the economic18\nenvironment, and the farm management system. All these parameters are regionally specific. For19\nthe calculation of the economic performance of crop production, only costs and benefits directly20\nrelated to cultivation are taken into account. Overhead costs and general farm activities (e.g.21\nmaintenance of barns and farm area, cleaning, and administration) are not considered in this22\nstudy.23\n24\nThe costs related to crop production generally include four main categories of expenses:25\n land costs26\n12\n field operation costs (contractor, machinery, labour and diesel costs)1\n input costs (seeds, fertilizers and pesticides)2\n fixed costs (insurance, soil sample assessment, etc).3\nThe benefits of crop production are the revenue from:4\n selling the main product5\n selling the co-product6\n CAP subsidies for crop production7\nIn our study, all costs and revenue are based on price levels for 2006 and are included in the8\nsupplementary on-line material. The lease price of land is used to reflect the land cost for farmers.9\nA large variety of field operations need to be carried out for the production of crops: soil10\npreparation, seeding\/planting, fertilization, weed and disease control, harvesting, storage, and11\ndrying. Machine costs for field operations are derived from (PPO et al. 2006) and account for12\npurchase price, salvage value, lifetime, interest rate, average annual operating hours, maintenance13\nand repair, storage, insurance cost, and work rate of the specific field operation. The fuel use per14\nfield operation is related to the type of machine used for the operation and the work rate. The15\nmost commonly used tractor capacities for specific field activities are based on (Wolf and16\nKlooster 2006). For field operations that are commonly outsourced in this region (e.g. seeding17\nand harvesting beet and maize), contractor prices are incorporated. The contractor prices include18\ncosts for machinery, labour and fuel. For non-outsourced field activities, farmers’ labour costs are19\nassumed for the first worker, while for every additional worker, labour costs for an average20\nemployee are assumed.21\n22\nThe cost of harvesting perennial crops are related to the per hectare yield levels. The relationship23\nbetween yield levels and harvest costs is non-linear and is described for willow by the Wood24\n13\nSupply research Group of the University of Aberdeen (WSRG 1994). It is assumed that this1\nrelationship also applies for other perennial crops (Smeets et al. 2009).2\n3\n589,0133.4  YHC (Equation 2)4\n5\nHC =Harvest costs [€\/ha]6\nY = Yield [odt\/ha]7\n8\nThe fixed costs are a compilation of several costs that occur annually. These depend on the crop9\ntype, and include the costs for insurance, soil sample assessment, certifying and crop testing, tare,10\nprevention of erosion, and national product levy. The input costs consist of the cost for planting11\nmaterial, fertilizers, and pesticides and are determined by the application rates and costs per unit.12\nThe revenue for the farmer consists of the sale of products and CAP subsidies. For cereals, both13\nmain- and co-products have market value.14\n3.2 Cost of ethanol15\nIn order to calculate the ethanol production costs, all costs and benefits during all stages of the16\nsupply chain need to be taken into account. The specified cost calculation for perennial crops17\nmaking use of the NPV has been demonstrated by (Broek et al. 2000b). In general, only monetary18\nflows can be discounted. However, since the yield represents a monetary flow, it is legitimate to19\ndiscount this output too (Broek et al. 2000a). The allocation of feedstock production costs is20\nbased on the economic value of the main- and co-product (e.g. straw).21\n22\nAll costs related to loading, unloading and transport need to be calculated per ton of product. This23\nincludes the cost of labour, fuel and depreciation of machinery. Finally, the costs and revenue for24\nethanol production need to be taken into account. This includes investment costs (depreciated25\n14\nover the lifetime), operations and maintenance (O&M) costs and the costs for fuel, gas, electricity1\nand other inputs needed for the process. Benefits include revenue from co-products or electricity2\nproduced during processing. The scale, load factor and efficiency determine the annual input3\n(feedstock) and output (ethanol). Equation 3 shows how the ethanol production costs are4\ncalculated.5\n6\n     \neth\ny\nplant\neth AO\nCPECOM\na\naCC\nEDmDTrFsC\n\n\n\n\n\n\n\n\n\n\n\n\n11\/\n\n(Equation 3)7\n8\nCeth = Cost of ethanol [€\/GJ]\nFs = Feedstock costs [€\/ton (fresh)]\nTr = Feedstock specific transport costs [€\/ton\/km (fresh)]\nD = Distance to plant [km]\nDm = Dry matter content of feedstock [%]\nE = LHVdm feedstock [GJ\/odn]\nηplant = Efficiency plant (GJinput\/GJoutput) [%]\nCC = Capital costs [€]\na = Discount rate [%]\ny = Lifetime [y]\nOM = Annual O&M costs [€\/y]\nEC = Annual energy input costs [€\/y]\nCP = Annual revenues co-products [€\/y]\nAOeth = Annual output ethanol [GJ\/y]\n9\n3.3 NPV and costs of feedstock differentiated for soil suitability10\nCrop yields vary within the region due to different soil qualities. Therefore, the NPV of crops and11\nthe costs of feedstock are differentiated for different soil quality classes.12\n15\n1\nTo map the soil suitability and the related yield for the different crops in our assessment, we use2\nthe most recent HELP (Her-EvaluatieLandinrichtingsProject) system (Brouwer and Huinink3\n2002; Brouwer et al. 2003). In this method, physical yields are determined by a combination of4\nsoil characteristics (e.g. water holding capacity, clay-sand-peat contents, rooting depth and5\nstoniness) and water tables in summer and winter. The total yield reduction (Dtot) relative to the6\nmaximum potential yield is determined by the yield reduction caused by drought (Ddr) (mostly in7\nsummer) and the yield reduction caused by water surplus (Dwa) (mostly in winter) assuming no8\nirrigation. See equation 4.9\n10\n\n\n\n\n\n\n\n\n dr\nwa\nwatot D\nDDD\n100\n100\n(Equation 4)11\n12\nThe yield level reductions were produced for the most common arable crops and mapped by13\n(Brouwer and Huinink 2002) onto 25 x 25m grid using GIS (Geographic Information System).14\n15\nIn the present HELP system a large selection of crops is included, but perennial biomass crops are16\nmissing and so are seed potatoes, summer wheat, barley and rape seed (see table 3). Estimates of17\nyields losses of the missing crops ware made based on existing tables in combination with crop18\nneed knowledge. The expected yield loss of Miscanthus due to water and drought is based on19\n(Christian et al. 2001; Lewandowski et al. 2003) and personal communication with Wolter20\nElbersen A&F, Wageningen University and Research centre. The assumptions regarding yield21\nreductions due to water and draught stress of annual and perennial crops are summarised in Table22\n3.23\n24\nTable 325\n16\n1\nThe crop specific HELP tables are used to map the soil suitability for all individual crops. This2\nresults in separate map layers of crop specific yield reductions. The suitability classes used are3\ndepicted in Table 4. The potentially suitable area includes the whole agricultural area excluding4\nland used for greenhouses and land within Natura 2000 conservation areas.5\n6\nTable 47\n8\nYield statistics provided by (LEI CBS 2007) and (PPO et al. 2006) present average yield levels9\nfor the region, differentiated to sand and clay soils. These average yield levels are translated to10\nyield levels per suitability class by taking the yield reduction per suitability class and the relative11\nshare of suitability class per crop for current land use into account.12\n13\nThe management responses to yield reductions are not always clear. On the one hand, fertilizer14\ninputs may be lower, due to reduced crop removal from the field during harvesting. On the other15\nhand, the efficiency of fertilizer uptake may be decreased on poorer soils, resulting in increased16\napplication requirements. In the case of herbicides, applications may be higher on better soils,17\nsince weeds are likely to generate more biomass. However, since the crop canopies may close18\nearlier in the growing season on better soils, the crop is better able to compete with weeds, which19\ncould reduce herbicide requirements. Because the management response to yield reductions can20\nresult either in an increase or a decrease of inputs, and because management is also dependent on21\nlocal circumstances and individual decisions, no general rule regarding the level of input response22\nto yield reductions can be made (personal communication A.J. Haverkort, J.G. Conijn and J.J.23\nSchroder, 2008, Plant Research International, Wageningen University and Research centre).24\nTherefore, we assume that input levels remain constant over soils of different quality and that the25\nrevenue achieved determines whether a crop is grown at a specific location.26\n17\n1\nThe NPV of the crops for each soil suitability class are linked to the crop specific soil suitability2\nmaps. For the NPV of rotations, individual map layers of the crops are combined for a final NPV3\nmap and weighted by the proportion of that crop in the rotation (Table 1). In addition to the NPV,4\nthe cost of feedstock production of Miscanthus and Sugar beet for every soil suitability class are5\nlinked to the GIS maps.6\n7\nAll parameters used for the calculation of the competitiveness of bioenergy crops compared to8\ncurrent land use and the calculation of the cost of feedstock and ethanol production are provided9\nin the supplementary on-line material.10\n11\n4 Results12\nThe NPV of most agricultural crops, especially cereals, are found to be negative when all costs13\nare included. In Figure 1, the proportion of costs and benefits (excluding subsidies) in the NPV of14\nconventional crops, rotations, and perennial crops are shown for “very suitable” soils. Large15\ndifferences are evident between intensively managed crops like potatoes and sugar beet, for16\nwhich revenues are high but investments are high too, and less intensive crops like wheat and17\nbarley, which require far lower inputs and labour but do not provide high revenue.18\n19\nFigure 120\n21\nIn Figure 2, the NPV of perennial crops, typical rotations, and rotations with an increased22\nproportion of sugar beet are shown for the different soil suitability classes. This figure shows that23\nNPVs always decrease on less suitable soils and that the rate of decrease is greater for the crop24\nrotations than for the perennials. This is due to the intensive management requirements of annual25\n18\ncrops compared to perennial crops. Because it is assumed that inputs and work rates do not1\ndecrease for less suitable soils (except for yield related costs like harvest and drying), the2\neconomic performance of intensively managed crops declines more rapidly than the performance3\nof less intensively managed crops on less suitable soils.4\n5\nFigure 2 shows that an increased share of sugar beet in rotations generally has no significant6\neffect on the NPV, except for the ‘Clay II’ rotation. For this rotation, an increase in the proportion7\nof sugar beet in the rotation causes a lower NPV on very suitable soils, but achieves a less8\nnegative NPV on less suitable soils, because sugar beet substitutes for potatoes, which have very9\nhigh yield losses on less suitable soils. For less suitable soils (> 20% yield loss) the NPV of10\nperennial crops exceeds the NPV of rotations. However, at this point the NPV of perennials is11\nalso low compared to keeping the land fallow.12\n13\nFigure 214\n15\nCurrently, most farmers receive CAP (Common Agricultural Policy) support for cultivating16\nagricultural crops (up to 446€\/ha). Since energy crops receive little support (45 €\/ha) in contrast17\nto food and feed crops, the gap between the NPV of conventional crops and energy crops would18\nincrease on suitable soils. Thus, when subsidies would be included, the intersection between19\nperennial crops and conventional land use moves towards less suitable soils (> 30% yield loss).20\nAs noted previously, farmers often do not account for the cost of land, their own labour, and21\nmachinery. Omitting the cost of labour and machinery especially influences the NPV of22\nintensively managed crops, and in these circumstances, perennials are only competitive on low23\nand less suitable soils (> 50% yield reduction).24\n25\n19\nSince perennial crops are more tolerant to water and drought stress, it is possible that some areas1\ncould be suitable for perennial crops and less suitable for rotation crops. The significance of this2\ncan only be depicted spatially. Therefore, the NPV of all the crops (including all costs and3\nexcluding subsidies) were linked to the soil suitability maps for the individual crops. For the NPV4\nof rotations, individual map layers of the crops were combined for a final NPV map and weighted5\nby the proportion of that crop in the rotation. The mapped NPV of rotations on clay and sand,6\npasture and maize were then combined with a map of current land use and, for clay and sand, the7\nbest performing rotations were then selected. Then, over the whole agricultural area, the NPV of8\ncurrent land use was compared with the NPV of Miscanthus on a 25m x 25m grid map (Figure 3).9\nThe same was done for the increased sugar beet rotation, but since there is little difference10\nbetween the economic performance of extended sugar beet rotation and the conventional rotations11\n(see Figure 2), this map is not presented here.12\n13\nFigure 314\n15\nThe light areas in Figure 3 indicate where Miscanthus can compete with current land use because16\nof a higher NPV. Most of these areas are currently in use for pasture and are often too wet for17\narable crops. The dark areas reflect those zones in which current land use is most profitable.18\nThese zones have fertile soils and are well suited for cultivation of profitable crops like potatoes19\nand sugar beet. In these locations, it is very unlikely farmers will be willing to switch to energy20\ncropping systems, at least, from an economic perspective.21\n22\nTable 5 shows that cropping Miscanthus on land that is currently used for pasture is often more23\nprofitable than current practice, but that Miscanthus is almost never more profitable on land that24\nis currently used for maize. Table 5 also shows that Miscanthus is more likely to be competitive25\nwith rotations on sandy soils than rotations on clayey soils.26\n20\n1\nTable 52\n3\nThe distribution of those areas where Miscanthus is competitive with current land use is depicted4\nas a function of the soil suitability classes in Table 6. Most of the land on which Miscanthus is5\ncompetitive with current land use is moderately suitable for Miscanthus (90% of the total area is6\nlow to highly suitable for Miscanthus). This is plausible, since “very marginally suitable” and7\n“marginally suitable” soils are very rare, and “very suitable” soils are often more suitable for8\nconventional cropping systems, which achieve higher NPVs on these soils.9\n10\nTable 611\n12\nCost of biomass13\nThe cost of biomass is expressed per GJ feedstock (Lower Heating Value of dm whole crop) at14\nthe farm gate, and is differentiated for each crop and soil suitability class (Figure 4a). In the15\nNorthern region of the Netherlands, Miscanthus has a total potential energy yield of 155 PJ, if the16\nwhole agricultural area is dedicated to this crop. The lowest production cost is 5.4 €\/GJ on very17\nsuitable soils, the highest is 41.6 €\/GJ on very marginally suitable soils. The potential energy18\nyield from sugar beet for the whole agricultural land area (134 PJ) is smaller than for Miscanthus.19\nAlso, the cost of production (9.7 €\/GJ and above) is higher than for Miscanthus, but lower than20\nfor most other annual crops. However, in case it is assumed sugar beet is only cultivated on land21\ncurrently in use as arable land, as assumed in the Refuel study(de Wit and Faaij 2010), the22\npotential would greatly decrease. In addition, only a maximum share of 25% in the rotation is23\npermissible, which would decrease the potential even more. An additional issue is that biomass24\nproduction costs in the North of the Netherlands are likely to greatly exceed the cost of biomass25\nimported from abroad (Lewandowski and Faaij 2006), which in the case of lignocellulosic26\n21\nbiomass, are expected to vary from 3.0 - 3.5 €\/GJ for pellets from Latin America, 3.5 - 5.0 €\/GJ1\nfor pellets from Eastern Europe, and 4.5 - 6.5 €\/GJ for pellets from Scandinavia (Hamelinck et al.2\n2005b).3\n4\nFigure 4a5\n6\nFigure 4b7\n8\nTaking into account the figures presented in Tables 5 and 6, a cost supply curve can be9\nconstructed for Miscanthus for the area where its cultivation is competitive with current land use10\n(Figure 4b). The potential presented in the figure is relatively high. The data presented in the11\nRefuel study regarding land availability for bioenergy crops (see Section 2.2) indicate that only a12\nsmall part of this potential can be exploited for bioenergy crops, without diminishing the self-13\nsufficiency of the region (the ‘optimistic’ scenario of Refuel is presented by black dots in Figure14\n4b). Assuming that only the least cost production areas are likely to be dedicated to bioenergy15\ncrops (Figure 4b), this results in a potential supply of 2.7 PJ at a cost of 5.4 to 5.9 €\/GJ compared16\nwith a potential of 71 PJ at a cost of 5.4 to 9.4 €\/GJ if all the land where Miscanthus is17\ncompetitive with current land use is taken into account. A cost supply curve for bioenergy18\nfeedstock from sugar beet for the area where it is competitive with current land use can not be19\nmade, since rotations with out of quota sugar beet have lower returns than current rotations.20\n21\nThe cost of feedstock production is affected by the soil suitability. In Figures 5a and 5b, the22\nspatial distribution of the cost of sugar beet and Miscanthus production are given. Both crops23\nachieve lowest production costs in the Northern area of the region. A relatively large area24\nachieves comparatively low production costs for Miscanthus. The production costs of sugar beet25\nare generally higher and increase more rapidly in less suitable conditions. In Figure 5a, the26\n22\npotential cost of sugar beet cropping on land now used for pastures is depicted as well. However,1\nthese areas are considered to be unavailable for sugar beet production. In this figure, the land2\ncurrently used for pasture is mainly coloured dark (very high production costs).3\n4\nComparing Figure 3 with Figure 5b shows that for some locations where Miscanthus performs5\nbetter than current land use, production costs are very high. However, most areas where6\nMiscanthus has a higher NPV than current land use have relatively low production costs. These7\nare the most promising locations for Miscanthus production.8\n9\nFigure 5a10\n11\nFigure 5b12\n13\nCosts of ethanol14\nIn Figure 6, the cost of ethanol production [€\/GJ] from sugar beet and Miscanthus are15\nrepresented. This figure is based on the least cost feedstock produced on very suitable soils (all16\ncosts factors including land, labour and machinery are taken into account). For comparison, the17\ncost of ethanol from wheat and maize and the cost of petrol are depicted as well. The petrol prices18\ndo not include VAT, excise and margins. The difference between the cost of bioethanol and19\npetrol is significant (>182%) assuming an oil price level of 62 US$\/barrel. However, when oil20\nprice levels increase to 100 US$\/barrel (average level of 2008) (OECD and IEA 2008) or 15021\nUS$\/barrel (as projected for 2020 by OECD and IEA) (OECD and IEA 2008), bioethanol could22\nbecome competitive to petrol.23\n24\nThe bioenergy feedstock costs vary for the various crops produced at suitable soils (range 5 - 1025\n€\/GJ, see Figure 4a). Conversely, the cost range of ethanol production is relatively small (24 - 2726\n23\n€\/GJ, see figure 6). This is caused mainly by the fact that relatively expensive feedstock in the1\nform of sugar and starch crops require less advanced technology for the conversion to ethanol.2\nThe contribution of capital and operations and maintenance (O&M) cost are relatively large for3\nethanol production from lignocellulosic crops. The distance from field to processing plant is4\nassumed to be the same for all feedstock, but the share of transport costs for ethanol from sugar5\nbeet is large due to the high moisture content of sugar beet.6\n7\nFigure 68\n9\nFor production of ethanol from wheat, only the main product (grain) is used; straw is considered10\nto be a co-product used for other purposes. Currently there is a relatively high demand for straw11\nfor several purposes (stables, crop coverage, etc). Allocation of costs for production of the ‘main12\nproducts’ is based on economic value. Based on this allocation, the production cost of straw13\nexceeds the cost of Miscanthus (euro\/GJfeedtock). Therefore the cost of ethanol production from14\nstraw will be higher than from Miscanthus and will not be profitable. For this reason, it is15\nassumed that demand for straw for ethanol production is not yet an additional competitive factor16\nin the market for straw. The leaves and crowns of sugar beet are assumed to be left on the field,17\nand are therefore not considered to be co-products. For lignocellulose crops, the whole crop is18\nused for conversion to ethanol. If the total area where Miscanthus is competitive with current land19\nuse is dedicated to Miscanthus for ethanol, 25 PJ ethanol could be produced annually. However,20\nthe Refuel study indicates that only a minor share can be used for bioenergy crops before21\ncompromising self-sufficiency. This results in an annual production of 1 PJ of ethanol at a cost22\nbetween 24.4 and 25.9 €\/GJ, equivalent to 0.7 % of the energy in the petrol used in the23\nNetherlands (142 PJ) in 2006 (CBS, 2008).24\n25\n24\n4.1 Sensitivity analysis1\nIn this section the sensitivity of the NPV, the cost of biomass and the cost of ethanol for various2\nkey parameters is assessed. These have been selected because of expected fluctuations or3\nuncertainty in specific parameters (e.g. commodity prices, fuel prices and discount rate) and\/or4\nthe expected effect of the key parameter on the final result (e.g. biomass yield and labour wages).5\nIn Figure 7, the sensitivity of the NPV of Miscanthus and sugar beet cultivated on very suitable6\nsoils is presented using spider diagrams.7\n8\nThe NPV of Miscanthus and sugar beet are very sensitive to changes in yield levels and market9\nprices. The NPV of sugar beet is more sensitive to changes in labour and energy prices than10\nMiscanthus due to the relatively intensive management that is required. Biomass costs are11\nsensitive to changes in yield, especially in the case of lower yields, where costs increase12\nsignificantly. Miscanthus production cost is sensitive to changes in the discount rate. This is due13\nto the high initial investment required and to the relatively long period of time that it takes to14\nachieve high yields. For sugar beet the discount rate has little effect, since costs and benefits are15\napproximately equal every year. The cost of ethanol production is very susceptible to yield levels16\nand efficiency. The impact of higher energy prices is different for the cost of ethanol production17\nfrom Miscanthus and from sugar beet. When energy costs increase, the costs of ethanol18\nproduction from sugar beet also increases, due to higher feedstock and transport costs. For19\nMiscanthus these costs also increase, but the co-product of ethanol production of Miscanthus,20\nelectricity, increases in value too. Therefore, for lignocellulosic ethanol, the net effect is a21\ndecrease in ethanol production costs when energy prices increase. The sensitivity for yield level22\nrepresents the sensitivity for changes in soil suitability.23\n24\nFigure 725\n26\n25\n5 Discussion1\n5.1 Method and input data2\nIn this study it is assumed that economic performance is the main driver for the adoption of3\ndifferent agricultural crops by farmers. The personal preferences of farmers, which can also4\ninfluence land use, are not included in our study. Other factors that can influence the economic5\nperformance of land use, such as previous investment in crop specific machinery and equipment,6\nlong-term agreements with procurers of processing chains, individual management and rotation7\nchoices, and additional costs or benefits of specific land use due to locally enforced policy8\nmeasures and subsidies (e.g. to protect ecosystems and historic landscapes), are also not included9\nin this study.10\n11\nAn important assumption is that here inputs of seeds, fertilizers, pesticides, and field operations12\ndo not change for different soil suitability classes. The main reason for this is that poorer soils can13\nrequire both higher and lower levels of inputs and, that based on available data, no general trend14\ncan be distinguished. The contribution of input costs to the total feedstock costs is relatively low15\nfor perennial crops (about 6%) but more significant for annual crops (about 12% for barley and16\n30% for feeding potatoes). If it were to be assumed that fewer inputs would be applied to crops17\non less suitable soils, the feedstock costs would decrease for these poorer soils. A further issue18\nlies in the scale of analysis used in this study, which here, is based on a one-hectare comparison19\nof different crops. Farmers however, need to consider the whole farm business and the way in20\nwhich individual enterprises link with each other. For example, this could have implications for21\nthe analysis of the pasture areas, since only the replacement value of fodder and the application of22\nmanure are considered as economic benefits, and other benefits, such as subsidies and revenue23\nfrom cattle breeding have not been included. Although the NPV does not necessarily represent24\nevery individual farmer’s perspective, it does present a broad economic picture of the relative25\n26\nprofitability of different land uses and, as a result, provides an indication of how land use might1\nchange at a regional level. Therefore, we propose that those areas where bioenergy crop2\nproduction has been found to be relatively profitable in this study, could serve as a starting point3\nfor economic analysis of bioenergy production at a farm level.4\n5\nThere is little experience with the cultivation of perennial bioenergy crops in the Netherlands and6\nas a result, management practices have seen little development or optimisation in comparison7\nwith conventional crops, where management has been optimized over the decades. For8\nperennials, there are uncertainties regarding input requirements (e.g. rhizomes and fertilizer9\nneeds) and attainable yield levels, which have large implications for economic performance. This10\nuncertainty is also reflected by the large differences for input requirements in the literature. In11\naddition, since ethanol plants based on lignocellulose feedstock are not commercially running yet,12\nefficiency and investment costs used in this study come attached with some uncertainty.13\n14\n5.2 Results15\nThe NPV of crops are very sensitive to market prices of agricultural products. These prices have16\nfluctuated to a large extent over last few years. The FAO food price index increased from 116 to17\n219 between 2006 and spring 2008 and then decreased to 148 in December 2008 (FAO 2009).18\nTherefore, the results related to the prices used here need to be carefully interpreted.19\n20\nOur assessment indicates that Miscanthus could be competitive with current land use in a21\nrelatively large area (given a level playing field in terms of subsidies). The maps show that the22\narea where Miscanthus could be competitive with current land use, is dominated by pastures.23\nHowever, since there are uncertainties regarding management data of pastures and additional24\nbenefits, and differences in NPVs are small, this result should be interpreted with care. The25\n27\nRefuel study also indicates a marginal availability of land currently in use for pastures (de Wit1\nand Faaij 2010). Therefore, the actual area where bioenergy crops are competitive with pasture is2\nexpected to be very limited. The maps in Figure 3 and 5b give an indication of which areas could3\nbecome the most promising areas for energy crop production. These areas are likely to be the4\nones where the NPV of Miscanthus is higher than the NPV of current land use and the costs of5\nfeedstock production are low.6\n7\nThe European sugar market is protected by the European Union by a set quota and a guaranteed8\nintervention price. Intervention prices of white sugar were reduced from 63 €\/100kg sugar in9\n2006 to 42 €\/100kg sugar in 2009 (Berkhout and van Berkum 2005). The economic value of 1 ton10\nof sugar beet for sugar therefore decreased from 82 €\/ton in 2006 to 55 €\/ton in 2009 compared11\nwith an economic value of 53 €\/ton for ethanol (assuming an ethanol price of 0.60 €\/l). This12\nshows that the production of sugar has become less profitable over the years, as a result of the13\nreduced intervention prices for sugar. In addition, when the EU market opens to imports from14\nabroad, ethanol production (and other uses of sugar beet) could become more attractive. For15\nexample, sugar beet can be used for (potential) applications in food, feed and the biochemistry16\nindustry. More advanced products (e.g. amino acids) with higher market value could be produced17\nfrom sugar beet in combination with ethanol. This could also contribute to a larger greenhouse18\ngas and fossil fuel mitigation potential (Brehmer et al. 2009).19\n20\nProduction costs of bioethanol from Miscanthus are relatively high (24 €\/GJ) compared to current21\npetrol prices (12 €\/GJ). Feedstock production costs of domestic cultivated Miscanthus would22\nneed to be reduced by 38% to 3.33 €\/GJ to be able to achieve ethanol production costs that could23\ncompete with petrol prices (oil price 62$\/barrel). The ethanol production costs from Miscanthus24\nin the Netherlands are equivalent to the prices of ethanol imported form Brazil, mainly due to a25\nhigh import duty of almost 5 €\/GJ. With improvement in technology and management, ethanol26\n28\nproduction costs could be reduced to about 13.5 €\/GJ in the future (Hamelinck et al. 2005a;1\nHamelinck and Hoogwijk 2007; de Wit and Faaij 2010). In addition, according to the World2\nEnergy Outlook, oil prices are likely to increase (OECD and IEA 2008). Therefore, bioethanol is3\nexpected to become more competitive with petrol in the future.4\n5\nIn this study, we have compared the economic performance between current land use and6\nbioenergy crops. Although the influence of subsidies has been assessed, the main comparison is7\nbased on cost calculations that exclude subsidies. It should be noted however, that the current8\nland use is a result of (historical and current) agricultural policies and subsidies. In order to9\nachieve the feedstock production cost of 3.33 €\/GJ for Miscanthus (at which ethanol production10\ncould compete with petrol prices), a subsidy of 600 €\/ha is required. At that subsidy level,11\nMiscanthus is more profitable than pasture and all crop rotations (including subsidies) on every12\nsoil suitability class, except for clay rotations on very high and high suitability soils. For sugar13\nbeet, a subsidy of 1080 €\/ha is required to achieve a feedstock production cost (5.68 €\/GJ) at14\nwhich ethanol production costs could compete with petrol prices. At this subsidy level it is15\neconomically attractive to increase the share of sugar beet in all rotations for all soil suitability16\nclasses.17\n18\nThe potential contribution of domestically produced ethanol from Miscanthus and\/or sugar beet is19\nrelatively small (<1% of total energy use in the transport sector) assuming that only the ‘available20\nland’ as indicated by the Refuel study can be used for bioenergy crops. Therefore, the21\nNetherlands will have to rely on imported biomass\/bioenergy to meet its targets for biofuel use in22\ntransport (10% in 2020) and renewable energy (20% in 2020) (Projectgroep 'Duurzame productie23\nvan Biomassa' 2006).24\n25\n29\n6 Conclusions1\n2\nIn this paper, the potential and economic viability of bioethanol chains in the Northern region of3\nthe Netherlands has been assessed for different soil suitability classes. The results have been4\ncompared to current agricultural land use. In addition, the spatial distribution of feedstock5\nproduction and the production costs have been mapped. With this approach, we have assessed6\nwhere land use changes in favour of bioenergy crops are most likely to occur.7\n8\nThe results of the NPV calculations show that an increased share of sugar beet for ethanol9\nproduction cannot compete with current cropping systems under present quota conditions and10\ncommodity prices. The potential biomass production from sugar beet is lower than from11\nMiscanthus, since only arable land is assumed to be appropriate and less well suitable land is12\navailable for sugar beet cultivation. Most cost effective sugar beet production is on very suitable13\nsoils in the coastal area in the North and the East of the region. Ethanol from domestic produced14\nsugar beet is significantly more expensive than petrol or ethanol produced from feedstock15\nimported from abroad. Therefore, there are no economic incentives to produce sugar beet for16\nethanol production in the North of the Netherlands under current circumstances. However, when17\noil prices increase and ethanol production is combined with the production of more advanced18\nproducts (e.g. bulk chemicals), the competitiveness could increase.19\n20\nThe spatial analysis shows a large area in the North of the Netherlands where cultivation of21\nMiscanthus could compete with current land use when a level playing field is established (i.e.22\nwhen subsides are excluded). Ethanol production of Miscanthus appeared to be the least cost23\noption of bioenethanol production of domestically cultivated feedstock in this region, but is still24\nalmost twice as expensive (24.4 €\/GJ ethanol) than petrol (12.3 €\/GJ, at an oil price level of25\n30\n62US$\/barrel) or ethanol produced from feedstock imported from abroad. Therefore, there are no1\neconomic incentives for the production of Miscanthus is the North of the Netherlands for ethanol2\nproduction under current circumstances. However, if bioenethaol production costs decrease3\nbecause of technological learning and crude oil prices increase, bioethanol could become4\ncompetitive.5\n6\nTaking the land availability of the Refuel study into account, the contribution of ethanol from7\ndomestic cultivated feedstock would be less than 1% of the petrol use in the Dutch transport8\nsector. This indicates a marginal potential for biofuel chains in this particular region, but this can9\nstill contribute to meeting the fuel blending targets in the Netherlands for the near future.10\n11\nIn the analysis of the competitiveness of Miscanthus production with current land use, current12\npasture land appeared to be an important potential area for Miscanthus cultivation. However, as13\nindicated in the discussion, there are uncertainties regarding the economic performance of14\npastures at a farm level and additional research is required. Also a more in depth assessment15\nregarding the relation between management, soil suitability and yield levels is needed in order to16\ndraw firmer conclusions concerning the economic and practical viability of cultivation of17\nbioenergy crops in the identified promising areas. Since combined production of advanced18\nproducts and ethanol from biomass feedstock could be more beneficial than ethanol production19\nalone in terms of economic performance and greenhouse gas mitigation potential, innovative20\nbiomass supply chains could be an interesting topic for further research.21\n22\nThis study provides a generic methodology to identify promising locations for bioenergy crop23\nproduction based on soil properties and current land use. The method can therefore be applied in24\nother geographical regions and at higher levels of analysis. The most important conclusion from25\nthis assessment is that the spatial variation of economic viability of bioethanol production chains26\n31\nindicates where land use changes are most likely to occur. However, economic performance is1\njust one of the criteria needed to investigate the sustainability of bioenergy production. The2\nenvironmental impacts in relation to the spatial characteristics of regional bioenergy chains are3\nalso very important and need further investigation.4\n5\nAcknowledgements6\nThis study is part of the Climate changes spatial planning program and is funded by the Dutch7\ngovernment, the European commission and Shell. The authors gratefully acknowledge the8\ncontributions to data collection of management and inputs of crop systems, pastures and perennial9\ncrops of Remco Schreuder, PPO Lelystad, Wageningen University and Research centre; Aart10\nEvers and Peter Roelofs of Animal Science Group Lelystad of Wageningen university and11\nresearch centre; Anton Haverkort, Jaap Schroder and Sjaak Conijn of PRI Agrosystems research12\nof Wageningen university and research centre; Edward Smeets of the Copernicus institute,13\nUtrecht university. In addition, the authors sincerely thank the contribution to the construction of14\nthe GIS maps of Michiel van Eupen and Rob Schmidt of Alterra.15\n16\nReferences17\n18\nBatidzirai, B., A. P. C. Faaij and E. M. W. Smeets (2006). \"Biomass and bioenergy19\nsupply from Mozambique.\" Energy for sustainable development X(1): 28.20\nBerkhout, P. and S. van Berkum (2005). Hervorming suikermarktordening Gevolgen21\nvoor de suikerproducenten, de suikerverwerkers en de (sucro)chemische industrie.22\nDen Haag, LEI.23\n32\nBrehmer, B., R. M. Boom and J. P. M. Sanders (2009). \"Maximum fossil fuel feedstock1\nreplacement potential of petrochemicals via biorefineries.\" Chemical Engineering2\nResearch and Design In Press.3\nBroek, R. v. d., S. Teeuwisse, K. Healion, T. Kent, A. van Wijk, A. Faaij and W.4\nTurkenburg (2001). \"Potentials for electricity production from wood in Ireland.\"5\nEnergy 26(11): 991-1013.6\nBroek, R. v. d., T. van den Burg, A. van Wijk and W. Turkenburg (2000a). \"Electricity7\ngeneration from eucalyptus and bagasse by sugar mills in Nicaragua: A8\ncomparison with fuel oil electricity generation on the basis of costs, macro-9\neconomic impacts and environmental emissions.\" Biomass and Bioenergy 19(5):10\n311-335.11\nBroek, R. v. d., A. van Wijk and W. Turkenburg (2000b). \"Farm-based versus industrial12\neucalyptus plantations for electricity generation in Nicaragua.\" Biomass and13\nBioenergy 19(5): 295-310.14\nBrouwer, F., H. L. Boogaard and R. C. M. Merkelbach (2003). Waterkansenkaart voor de15\nfunctionele landbouw. een methode voor het vaststellen van geschiktheden en16\nkwetsbaarheden van relevante gewasteelten voor Noord Nederland. Wageningen,17\nAlterra, research instituut voor de Groene Ruimte: 91.18\nBrouwer, F. and J. T. M. Huinink (2002). Opbrengstdervingspercentages voor19\ncombinaties van bodemtypen en grondwatertrappen. Geactualiseerde help-20\ntabellen en opbrangstdepressiekaarten. Wageningen, Alterra, Research instituut21\ngroene ruimte en expertise centrum LNV: 38.22\n33\nBullard, M. (2001). Economics of Miscanthus Production. Miscanthus for energy and1\nfibre. M. B. Jones and M. Walsh. London, James & James (Science publishers)2\nLtd: 192.3\nBullard, M. and P. Matcalfe (2001). Estimating the energy requirements and CO24\nemissions from production of the perrenial grasses miscanthus, switchgrass and5\nreed canary grass., ADAS consulting Ltd on behalf of the Department of trade6\nand industry: 94.7\nChristian, D. G., E. Haase, H. Schwarz, C. Dalianis, J. C. Clifton-Brown and S.8\nCosentino (2001). Agronomy of Miscanthus. Miscanthus for energy ad Fibre. M.9\nB. Jones and M. Walsh. London, James & James (Science Publishers) Ltd: 192.10\nCosta Due. (2009). \"Costa Due.\" 2009, from http:\/\/www.costa-due.nl\/.11\nde Wit, M. and A. Faaij (2010). \"European biomass resource potential and costs.\"12\nBiomass and Bioenergy In Press, Corrected Proof.13\nDEFRA (2002). Growing short rotation coppice. Best practical guidelines for applicants14\nto DEFRA'S energy crops scheme. London, DEFRA Department for15\nEnvironment, Food & Rural affairs: 31.16\nEEA (2006). How much bioenergy can Europe produce without harming the17\nenvironment? Copenhagen, Denmark, EEA: 67.18\nEickhout, B. and A. G. Prins (2008). Eururalis 2.0 Technical Background and indicator19\ndocumentation. Wageingen, Bilthoven, Wageningen UR, MNP: 84.20\nElbersen, W. H., R. R. Bakker and B. S. Elbersen (2005). A simple method to estimate21\npractical field yields of biomass grasses in Europe. 14th European Biomass22\nConference Paris, France.23\n34\nEnergy Valley. (2009). \"Energy Valley.\" 2009, from http:\/\/www.energyvalley.nl\/.1\nErcoli, L., M. Mariotti, A. Masoni and E. Bonari (1999). \"Effect of irrigation and2\nnitrogen fertilization on biomass yield and efficiency of energy use in crop3\nproduction of Miscanthus.\" Field Crops Research 63(1): 3-11.4\nFAO. (2009). \"Food price Index.\" Retrieved January 2009, 2009, from5\nhttp:\/\/www.fao.org\/worldfoodsituation\/FoodPricesIndex\/en\/.6\nFischer, G., S. Prieler, H. van Velthuizen, G. Berndes, A. Faaij, M. Londo and M. de Wit7\n(2010a). \"Biofuel production potentials in Europe: Sustainable use of cultivated8\nland and pastures, Part II: Land use scenarios.\" Biomass and Bioenergy In Press,9\nCorrected Proof.10\nFischer, G., S. Prieler, H. van Velthuizen, S. M. Lensink, M. Londo and M. de Wit11\n(2010b). \"Biofuel production potentials in Europe: Sustainable use of cultivated12\nland and pastures. Part I: Land productivity potentials.\" Biomass and Bioenergy13\nIn Press, Corrected Proof.14\nHamelinck, C. N. and A. P. C. Faaij (2006). \"Outlook for advanced biofuels.\" Energy15\nPolicy 34(17): 3268-3283.16\nHamelinck, C. N. and M. Hoogwijk (2007). Future scenarios for first and second17\ngeneration biofuels. Utrecht Bilthoven, Ecofys MNP: 78.18\nHamelinck, C. N., G. v. Hooijdonk and A. P. C. Faaij (2005a). \"Ethanol from19\nlignocellulosic biomass: techno-economic performance in short-, middle- and20\nlong-term.\" Biomass and Bioenergy 28(4): 384-410.21\nHamelinck, C. N., R. A. A. Suurs and A. P. C. Faaij (2005b). \"International bioenergy22\ntransport costs and energy balance.\" Biomass and Bioenergy 29(2): 114-134.23\n35\nHimken, M., J. Lammel, D. Neukirchen, U. Czypionka-Krouse and H. W. Wolfs (1997).1\n\"Cultivation of Miscanthus under West European conditions: Seasonal changes in2\ndrymatter production, nutrient uptake and remobilization.\" Plant and soil 189:3\n117-126.4\nHuisman, W., P. Venturi and J. Molenaar (1997). \"Costs of supply chains of Miscanthus5\ngiganteus.\" Industrial Crops and Products 6(3-4): 353-366.6\nKempenaar, C., L. v. d. Brink, C. B. Bus, J. A. M. Groten, C. L. M. d. Visser and L. A. P.7\nLotz (2003). Gangbare landbouwkundige praktijk en recente ontwikkelingen voor8\nvier akkerbouwgewassen in Nederland. Wageingen, Plant Reasearch9\nInternational, BU Gewas & Productie-ecologie, Wageningen. Praktijkonderzoek10\nPlant & Omgeving, Cluser akkerbouw, groene ruimte & vollegrondsgroente,11\nLelystad: 38.12\nKhanna, M., B. Dhungana and J. Clifton-Brown (2008). \"Costs of producing miscanthus13\nand switchgrass for bioenergy in Illinois.\" Biomass and Bioenergy 32(6): 482-14\n493.15\nKNMI (2002). Klimatatlas; Langjarige gemiddelden en extremen, tijdvak 1971-200016\nKNMI.17\nLEI CBS (2007). Land- en tuinbouwcijfers 2007. Den Haag, LEI CBS: 270.18\nLewandowski, I. and A. P. C. Faaij (2006). \"Steps towards the development of a19\ncertification system for sustainable bio-energy trade.\" Biomass and Bioenergy20\n30(2): 83-104.21\n36\nLewandowski, I. and A. Heinz (2003). \"Delayed harvest of miscanthus--influences on1\nbiomass quantity and quality and environmental impacts of energy production.\"2\nEuropean Journal of Agronomy 19(1): 45-63.3\nLewandowski, I., J. M. O. Scurlock, E. Lindvall and M. Christou (2003). \"The4\ndevelopment and current status of perennial rhizomatous grasses as energy crops5\nin the US and Europe.\" Biomass and Bioenergy 25(4): 335-361.6\nMenkveld, M. (2007). Beoordeling werkprogramma Schoon en Zuinig; Effecten op7\nenergiebesparing, hernieuwbare energie en uitstoot van broeikasgassen. Petten,8\nThe Netherlands, ECN, MNP.9\nMinisterie van Economische zaken (2008). Energierapport 2008. Den Haag, The10\nNetherlands, Ministerie van economische zaken, Directoraat-Generaal voor11\nenergie en telecom: 126.12\nMinisterie van VROM (2007). Nieuwe energie voor het klimaat; werkprogramma schoon13\nen zuinig. VROM. den Haag, The Netherlands, Ministerie van VROM, Ministerie14\nvan Economische Zaken; Ministerie van Verkeer en Waterstaat; Ministerie van15\nLandbouw, Natuur en Voedselkwaliteit; Ministerie van Financiën; ministerie van16\nBuitenlandse Zaken.: 60.17\nMonti, A., N. Di Virgilio and G. Venturi (2008). \"Mineral composition and ash content18\nof six major energy crops.\" Biomass and Bioenergy 32(3): 216-223.19\nOECD and IEA (2008). World Energy Outlook 2008. Paris, France, IEA, OECD: 501 +20\nannexes.21\nPPO, M. d. Wolf and A. v. d. Klooster (2006). Kwantitatieve Informatie Akkerbouw en22\nVollegrondsteelt 2006. Wageingen, Wageningen Universiteit.23\n37\nProjectgroep 'Duurzame productie van Biomassa' (2006). Criteria voor duurzame1\nbiomassa productie, Task Force Energietranstie: 30.2\nRomkes, P. F. A. M. and O. Oenema (2004). Quick scan soils in the Netherlands,3\noverview of the soil status with reference to the forthcomming EU soil strategy.4\nWageningen, The Netherlands, Alterra: 96.5\nSmeets, E. M. W., A. P. C. Faaij, I. M. Lewandowski and W. C. Turkenburg (2007). \"A6\nbottom-up assessment and review of global bio-energy potentials to 2050.\"7\nProgress in Energy and Combustion Science 33(1): 56-106.8\nSmeets, E. M. W., I. M. Lewandowski and A. P. C. Faaij (2009). \"The economical and9\nenvironmental performance of miscanthus and switchgrass production and supply10\nchains in a European setting.\" Renewable and Sustainable Energy Reviews 13(6-11\n7): 1230-1245.12\nStyles, D. and M. B. Jones (2007). \"Current and future financial competitiveness of13\nelectricity and heat from energy crops: A case study from Ireland.\" Energy Policy14\n35(8): 4355-4367.15\nvan Dam, J., A. P. C. Faaij, I. Lewandowski and G. Fischer (2007). \"Biomass production16\npotentials in Central and Eastern Europe under different scenarios.\" Biomass and17\nBioenergy 31(6): 345-366.18\nvan der Voort, M. P. J., R. D. Timmer, W. v. Geel, W. Runia and W. J. Corre (2008).19\nEconomie van Energiegewassen. Wageningen, The Netherlands,20\nPraktijkonderzoek plant & omgeving. Akkerbouw, groene ruimte en21\nvollegrondsgroente, Wageningen Universiteit en research centrum: 79.22\n38\nVenturi, P., J. K. Gigler and W. Huisman (1999). \"Economical and technical comparison1\nbetween herbaceous (Miscanthus x giganteus) and woody energy crops (Salix2\nviminalis).\" Renewable Energy 16(1-4): 1023-1026.3\nWesthoek, H. J., M. van den Berg and J. A. Bakkes (2006). \"Scenario development to4\nexplore the future of Europe's rural areas.\" Agriculture, Ecosystems &5\nEnvironment 114(1): 7-20.6\nWolf, M. d. and A. v. d. Klooster (2006). Kwantitatieve Informatie Akkerbouw en7\nVollegrondsteelt 2006. Wageningen, PPO Wageningen Universiteit.8\nWSRG (1994). Harvesting Decision Support System. Aberdeen, Wood Supply Research9\ngroup, Department of Forestry, University of Aberdeen.10\n11\n12\n13\n39\nTables1\nTable 1: Two typical rotation schemes for sandy soils and two typical rotation schemes for clay soils2\nfor Northern region of the Netherlands derived from (LEI CBS 2007; van der Voort et al. 2008)3\nexpressed in share of individual crop in each of the rotations.4\n5\nShare of crop\nin rotation\nClay rotation Sand rotation\nI II I II\nwinter wheat 0.57 0.20 0.05\nsummer barley 0.10 0.28 0.25\nwinter barley 0.20 0.06\nseed potato 0.15 0.03 0.05\nindustrial potato 0.15 0.30 0.45\nsugar beet 0.14 0.10 0.20 0.20\nmaize 0.25 0.04\nother 0.06\nfallow 0.09 0.05 0.04\nTotal 1.00 1.00 1.00 1.00\n6\n7\n40\nTable 2: Share of land that could become available for biomass production in North of the1\nNetherlands according to three Refuel scenarios.2\n3\n4\n5\nType of\nland\nAvailability in % of land\nLow Medium High\n2015 2030 2015 2030 2015 2030\nArable 1.9 6.1 2.7 7.4 4.3 10.2\nPastures 0.5 8.6 0.5 8.6 0.5 8.6\n41\nTable 3: Crops included in the HELP system (Her-Evaluatie van LandinrichtingsPlannen – Re-1\nevaluation of spatial planning) and new crops introduced including their relative sensitivity to2\ndrought and water damage3\n4\n5\n6\nCrop Included\nin HELP\nAssumed water and drought sensitivity\nA\nnn\nua\nls\nsummer wheat No The same as winter wheat, but more sensitive to drought.\nwinter wheat Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\nsummer barley No The same specifications as winter wheat, but more sensitive to drought.\nwinter barley No The same specifications as winter wheat\nfeeding potatoes Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\nseed potatoes No More sensitive to both drought and water damage then feeding potato\nindustrial potatoes Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\nsugar beet Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\nrape seed No The same specifications as summer wheat\nmaize Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\npe\nre\nnn\nia\nls\nMiscanthus No The same sensitivity to excess water as maize (Christian et al. 2001),\nbut with slightly lower yield losses for dry conditions because of its\ndeeper rooting system.\nswitchgrass No It has a high tolerance to severe water stress conditions (Monti et al.\n2008). Therefore it is expected to be more drought tolerant then\nMiscanthus (and certainly willow) and similarly tolerant to wet\ncircumstances as Miscanthus.\nwillow No Willow can withstand seasonal flooding but not permanent water-\nlogging (DEFRA 2002). It is expected to be more tolerant to wet\ncircumstances and more sensitive to drought then Miscanthus and\nswitchgrass.\ngrass Yes Derived from (Brouwer and Huinink 2002; Brouwer et al. 2003)\n42\nTable 4: Classification soil suitability as function of yield reduction due to water and drought stress.1\n2\nSuitability classification Yield reduction\nvery suitable 0-10%\nhigh suitable 10-20%\nsuitable 20-30%\nmedium suitable 30-40%\nlow suitable 40-60%\nmarginally suitable 60-80%\nvery marginally suitable 80-100%\n3\n4\n43\nTable 5: The proportion of land that is more profitable under Miscanthus or more profitable under1\nthe current land uses of arable crop rotations on clayey soils and sandy soils, maize and grass2\nCurrent land\nuse\nRotation\nClay I\nRotation\nClay II\nRotation\nSand I\nRotation\nSand II Maize Grass Miscanthus\nRotation clay 0.00 0.85 0.15\nRotation sand 0.58 0.00 0.42\nMaize 0.97 0.03\nGrass 0.12 0.88\nTotal share of\nland of highest\nNPV 0.00 0.15 0.17 0.00 0.01 0.06 0.61\n3\n4\n44\nTable 6: Share of area where Miscanthus has better Net Present Value than current land use (ΔNPV 1\nis negative) in total and for different suitability classes.2\n3\n4\n1 total share of land where Miscanthus has better Net Present Value (NPV) than current land use5\ncorresponds with 0.61 of total agricultural area (see total table 5).6\n7\nMiscanthus on land\ncurrently in use for\nvery\nmarginally\nsuitable\nmarginally\nsuitable\nlow\nsuitable\nmoderately\nsuitable suitable\nhigh\nsuitable\nvery\nsuitable\nshare of area\nwhere NPV\nMiscanthus>\nNPV current\nland use\nMiscanthus-clay rotation 0.000 0.000 0.018 0.011 0.014 0.000 0.000 0.044\nMiscanthus-sand rotation 0.000 0.002 0.045 0.019 0.052 0.082 0.004 0.203\nMiscanthus-maize 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.001\nMiscanthus-pastures 0.005 0.007 0.196 0.079 0.191 0.192 0.083 0.753\nMiscanthus Total 0.005 0.010 0.259 0.109 0.257 0.273 0.087 11\n45\nFigure captions1\n2\nFigure 1: Individual contributions of cost items and benefits to Net present Value (NPV) of individual3\ncrops, crop rotations, and perennial energy crops excluding subsidies4\n5\nFigure 2: Net present value of perennials, typical rotation schemes and rotations schemes including6\nan extra share of sugar beet (ES) for different soil suitability classes (excluding subsidies).7\n8\nFigure 3: Map of ΔNPV (= NPV of current land use - NPV perennial energy crops) for the whole 9\nagricultural area of the North of the Netherlands. Negative value (light area) indicates where10\nMiscanthus has a higher NPV than current land use. All cost items are included and subsidies are11\nomitted.12\n13\nFigure 4a: Cost supply curves for various crops in the North of the Netherlands for the total of14\nagricultural land in the region. The first ‘step’ in the curves indicate the cost of biomass produced on15\nvery suitable soils, the second for high suitable…the last step of each curve indicates the cost of16\nbiomass produced on very marginally soils17\n18\nFigure 4b: Cost supply curve of Miscanthus based on land availability from ΔNPV (Net present 19\nvalue) and distribution over soil suitability and the potential related to the land availability according20\nto the Refuel study.21\n22\nFigure 5a: spatial distribution of sugar beet production costs in €\/GJ23\n24\nFigure 5b: spatial distribution of Miscanthus production costs in €\/GJ25\n26\n46\nFigure 6: Cost of ethanol production form various feedstock in the North of the Netherlands1\ncompared to petrol prices for various oil price levels (US$\/Barrel). Least cost feedstock produced on2\nvery suitable soils are incorporated.3\n4\nFigure 7: Sensitivity analysis for Net present value (NPV), cost of biomass and cost of ethanol of5\nMiscanthus and sugar beet. Key parameters, discount rate, energy prices, labour wages, yield levels,6\ncommodity prices and efficiency of conversion, are varied between -100% and +100% of the original7\nvalue8\n"}