{"doi":"10.1063\/1.2767227","coreId":"100673","oai":"oai:epubs.surrey.ac.uk:68","identifiers":["oai:epubs.surrey.ac.uk:68","10.1063\/1.2767227"],"title":"Formation and characterization of carbon nanowires","authors":["Kumar, A","Avasthi, DK","Tripathi, A","Filip, LD","Carey, JD","Pivin, JC"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08-15","abstract":"<p>This article reports on the formation and electronic characteristics of conducting carbon nanowires produced by swift heavy ion irradiation of a fullerene thin film. This study shows that it is possible to create arrays of carbon nanowires, which are perfectly parallel to each other and perpendicular to the substrate. As-deposited fullerene films exhibit poor field emission characteristics with breakdown fields as high as 51 V\/mu m, whereas low dose ion irradiated fullerene film produces a threshold field as low as 9 V\/mu m. The present approach of making conducting carbon nanowires by ion irradiation for potential field emitters and large area applications is also discussed.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:68<\/identifier><datestamp>\n      2017-10-31T13:56:31Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/68\/<\/dc:relation><dc:title>\n        Formation and characterization of carbon nanowires<\/dc:title><dc:creator>\n        Kumar, A<\/dc:creator><dc:creator>\n        Avasthi, DK<\/dc:creator><dc:creator>\n        Tripathi, A<\/dc:creator><dc:creator>\n        Filip, LD<\/dc:creator><dc:creator>\n        Carey, JD<\/dc:creator><dc:creator>\n        Pivin, JC<\/dc:creator><dc:description>\n        <p>This article reports on the formation and electronic characteristics of conducting carbon nanowires produced by swift heavy ion irradiation of a fullerene thin film. This study shows that it is possible to create arrays of carbon nanowires, which are perfectly parallel to each other and perpendicular to the substrate. As-deposited fullerene films exhibit poor field emission characteristics with breakdown fields as high as 51 V\/mu m, whereas low dose ion irradiated fullerene film produces a threshold field as low as 9 V\/mu m. The present approach of making conducting carbon nanowires by ion irradiation for potential field emitters and large area applications is also discussed.<\/p><\/dc:description><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2007-08-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/68\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Kumar, A, Avasthi, DK, Tripathi, A, Filip, LD, Carey, JD and Pivin, JC  (2007) Formation and characterization of carbon nanowires   JOURNAL OF APPLIED PHYSICS, 102 (4), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2767227<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/68\/","10.1063\/1.2767227"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Formation and characterization of carbon nanowires\nAmit Kumar, D. K. Avasthi,a\u0001 and A. Tripathi\nMaterials Science Group, Inter University Accelerator Centre, Post Box 10502, New Delhi-110067, India\nL. D. Filip and J. D. Carey\nAdvanced Technology Institute, University of Surrey, Guildford GU2 7XH, United Kingdom\nJ. C. Pivin\nCSNSM, Bâtiment 108, 91405 Orsay Campus, France\n\u0001Received 11 June 2007; accepted 17 June 2007; published online 21 August 2007\u0002\nThis article reports on the formation and electronic characteristics of conducting carbon nanowires\nproduced by swift heavy ion irradiation of a fullerene thin film. This study shows that it is possible\nto create arrays of carbon nanowires, which are perfectly parallel to each other and perpendicular to\nthe substrate. As-deposited fullerene films exhibit poor field emission characteristics with\nbreakdown fields as high as 51 V\/\u0001m, whereas low dose ion irradiated fullerene film produces a\nthreshold field as low as 9 V\/\u0001m. The present approach of making conducting carbon nanowires\nby ion irradiation for potential field emitters and large area applications is also discussed. © 2007\nAmerican Institute of Physics. \u0003DOI: 10.1063\/1.2767227\u0004\nI. INTRODUCTION\nOne of the main goals of nanotechnology is the ability to\ncontrol or engineer the structure and properties of materials\non the nanometer scale and to take advantage of the inherent\nproperties, such as enhanced reactivity or quantum confine-\nment. The construction of nanoelectronic devices is techno-\nlogically challenging and many different approaches are pos-\nsible. The controlled growth of a single nanowire or an\nensemble of nanowires, their growth direction, suitable\nalignment, and spacing on a substrate is of paramount impor-\ntance and critical to the realization of integrated electronic\nand photonic devices. Many methods have been developed\nfor the fabrication of nanowire arrays including template\nmethods,1,2 catalytic growth,3 Langmuir Blodgett, and\nelectrospinning.4 Ion beam methods are now emerging as a\ntool in nanofabrication for structuring material on the na-\nnometer scale.5,6 It is known that when a swift heavy ion\n\u0001SHI\u0002 i.e., a heavy ion with energy \u00021 MeV\/nucleon,\npasses through a material, it induces a continuous trail of\ndamage with several nanometers width and typically several\ntens of microns in length. Such ion tracks consist of material\nwith properties that are drastically changed when compared\nwith the surrounding virgin material. As a consequence this\nis a way to nanostructure a material and to change the local\nelectronic and structural properties on the nanometer scale.\nIn this article we report on the use of SHI to produce arrays\nof carbon nanowires and characterize the conduction and\nfield emission properties.\nThere has been considerable interest in field emission\nfrom nanostructured carbon-based system such as diamond,\ndiamond-like carbon, carbon nanotubes, fullerene, and nano-\nstructured carbon for field emission devices.7,8 Emission\nfrom carbon-based materials depends on various parameters,\nsuch as negative electron affinity, band gap, surface termina-\ntion, sp2 and sp3 content, etc., and is often reported as being\nlocalized rather than uniform.9–11 In the case of carbon nano-\ntubes and nanowires the effects of varying the aspect ratio\nand the proximity screening12 need also to be taken into ac-\ncount. Ion irradiation of fullerene thin films \u0003Fig. 1\u0001a\u0002\u0004 is\nknown to break the fullerene cages and within the nanosized\ntrack to form nanocrystalline graphite.13,14 From a techno-\nlogical viewpoint, one of the more important aspects is the\ndevelopment of large scale and controllable production\nmethods, especially for aligned nanowire production. Al-\nthough electron beam lithography15 allows the formation of\ncatalyst sites for aligned growth of nanowires, this serial\ntechnique is too slow for scalable mass production. Ion im-\nplantation is a well established method for transistor technol-\nogy and offers the possibility of large area production of\nemitters. This has prompted us to synthesize carbon nano-\nwire field emitters by ion irradiation.\nII. EXPERIMENT\nFullerene thin films of 500 nm thickness were deposited\non 50 nm thick Au layers on a Si substrate. The need for a\nAu layer was to facilitate the characterization of conducting\nchannels by conducting atomic force microscope \u0001C-AFM\u0002\nas shown in Fig. 1\u0001b\u0002. The gold films were deposited on Si\nsubstrate by resistive heating and the fullerene films were\ndeposited on these Au films by sublimation of a C60 pellet. A\nsmall area of the Au film was masked so that it can be used\nas a contact for conducting AFM. The evaporation was per-\nformed at pressure of 5\u000310−7 mbar, achieved by using a\ndiffusion pump with a LN2 trap. The thickness of the film\nwas monitored by a quartz crystal thickness monitor. The\nfullerene films were irradiated by 120 MeV Au ions at flu-\nence of 5\u0003109 ions\/cm2 using 15\u0003106 V Pelletron accel-\nerator at Inter-University Accelerator Centre, New Delhi, In-\ndia. The Au ion beam deposits \u000513 keV\/nm by electronic\na\u0002Author to whom correspondence should be addressed; electronic mail:\ndka@iuac.res.in\nJOURNAL OF APPLIED PHYSICS 102, 044305 \u00012007\u0002\n0021-8979\/2007\/102\u00024\u0001\/044305\/4\/$23.00 © 2007 American Institute of Physics102, 044305-1\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nenergy loss \u0001due to inelastic collision\u0002 and \u0005102.4 eV\/nm\nby nuclear energy loss \u0001due to elastic collision\u0002 as estimated\nby Monte-Carlo simulation \u0001SRIM\u0002.16 From the Monte Carlo\nsimulations, the electronic energy loss in the entire thickness\nof the film is uniform and ions get buried deep \u000123 \u0001m\u0002\ninside the Si substrate. The fluences were kept low so as to\nminimize the overlap of the ion tracks. The vacuum during\nirradiation was approximately 10−6 mbar and the current\nwas about 0.5 pnA \u00011 particle nA=6.25\u0003109 ions\/s\u0002. The\nion beam was scanned in area of 1 cm2 by an electromag-\nnetic scanner.\nThe C-AFM measurements were performed on the pris-\ntine and irradiated samples using the Digital Instrument\nNanoscope III. The field emission characteristics of pristine\nand irradiated films were examined using a sphere-to-plane\ngeometry in which a 5 mm stainless-steel ball bearing is\nsuspended above the surface at a high positive potential in a\nvacuum better than 4\u000310−6 mbar.17 Field emission mea-\nsurements are made by varying the relative separation be-\ntween the probe and sample using a high precision manipu-\nlator with a known step size. A threshold voltage\ncorresponding to an emission current of 1 nA is calculated at\neach position. A plot of the variation of the threshold voltage\nagainst relative probe separation \u0001not shown here\u0002 provides\nthe threshold field.\nIII. RESULTS AND DISCUSSION\nFigure 2 shows the conducting AFM scan of a film irra-\ndiated with 120 MeV Au ions at a fluence of 5\n\u0003109 ions\/cm2. The image shows that the current in the ion\ntracks is significantly higher than in regions not hit by the\nions. For a fluence of 5\u0003109 ions cm−2, a simple area esti-\nmate suggests that there should be 50 tracks per square mi-\ncron or seven tracks per micron. A current of approximately\n10 nA was measured \u0001for 4 V\u0002 in a cylindrical region with a\ndiameter of a few tens of nanometers, corresponding to an\nion impact. The sectional analysis reveals that the diameter\nof the semiconducting zone varies from 20 nm \u0001single or few\nimpacts\u0002 to 100 nm \u0001many impacts\u0002. The observed tracks\nshow some mismatching to incident ions. Mismatch between\nfluence and the ion track areal density may result from ran-\ndom ion impacts resulting in overlapping tracks and\/or lat-\neral conduction with the neighboring tracks. As a result not\nall of the nanowires are perpendicular to the substrate. In\naddition the finite size of tip may have influence. Fourier\ntransform infrared spectroscopy18 has previously revealed\nthat the track is surrounded by a polymerized annular cylin-\ndrical region. The carbon nanowires are predominantly par-\nallel to each other and perpendicular to the substrate, because\nthe irradiation has been performed perfectly perpendicular to\nfullerene films. The length of the CNW can be tuned by the\nthickness of fullerene film and its orientation can be engi-\nneered by simply changing the incidence angle of the ion\nbeam. No catalysts are required and only a few seconds are\nrequired for nanowire growth. This is one of the advantages\nof the ion beam approach. The other interest of using swift\nheavy ion irradiation with respect to chemical routes to fab-\nricate emission tips attached to a substrate is that all the tips\nare perfectly parallel to each other, their areal density and\nseparation to height ratio can be controlled simply by the ion\nfluence and film thickness. Therefore, we can say that the\npresent technique has definite advantages over the other\ntechniques. Nowadays some accelerator facilities are com-\nmercially used for the applications, which require low flu-\nFIG. 1. \u0001Color online\u0002 Schematic of the \u0001a\u0002 conducting carbon nanowires\nformation in fullerene films by energetic ion irradiation and \u0001b\u0002 conducting\natomic force microscopy measurement of carbon nanowires.\nFIG. 2. \u0001Color online\u0002 Conducting AFM image, of the irradiated fullerene\nthin film. The vertical rods represent the current flowing through the con-\nducting nanowires.\n044305-2 Kumar et al. J. Appl. Phys. 102, 044305 \u00022007\u0001\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nence and therefore small irradiation time. The creation of\nmicro filters\/ micropores by etching of the low fluence irra-\ndiated polymers, is one such example. The I−V measure-\nments on ion hit regions \u0003carbon nanowire \u0001CNW\u0002\u0004 in the\nirradiated film at fluence of 5\u0003109 ions\/cm2 is shown in\nFig. 3.\nThe vertical alignment and effective high aspect ratio of\nCNWs makes them attractive from a field emission perspec-\ntive. The field emission properties have been studied on the\nsynthesized CNWs as shown in Fig. 4\u0001a\u0002. A threshold field of\nabout 9 V\/\u0001m has been observed for CNWs where as the\npristine films shown breakdown behavior at 51 V\/\u0001m. The\ncurrent–voltage characteristics repeated for four times are\npresented with no significant difference between them, which\nindicates good stability. The field emission properties of pris-\ntine film are shown in the inset of Fig. 4\u0001a\u0002. The Fowler–\nNordheim representation of one of the field emission charac-\nteristics of the irradiated sample is shown in Fig. 4\u0001b\u0002. The\napparent linear fit allows estimate to the field enhancement\nfactor, \u0004. Assuming that the work function of the nanowires\nis approximately 5 eV, a value of \u0004=429 is estimated. At a\ntypical threshold applied field of 9 V\/\u0001m, the average local\nelectric field is 3.8 V\/nm, which is comparable to emission\nfrom carbon nanotubes.19 Lower values of applied field, cor-\nresponding to higher enhancement factors, are sometimes re-\nported from ideal aligned nanowires and nanotubes.12,19\nHowever, at high areal densities inter nanowire proximity\nscreening becomes a significant factor. In a similar work by\nNilsson et al.,12 they estimated that the ideal average separa-\ntion between nanowires should be about twice the length of\nnanowire. With typical nanowire lengths of 500 nm \u0001corre-\nsponding to the film thickness\u0002, the average separation be-\ntween impacts sites at this fluence is approximately 710 nm\nas estimated by section analysis. In such a situation, proxim-\nity screening is likely to be occurring to some extent. It\nshould also be noted that in the study by Schwen et al.,20\nlarger threshold applied fields of 30 V\/\u0001m were reported\nfor 350 MeV Au ion SHI into tetrahedral amorphous carbon\n\u0001a-C\u0002 grown by mass selected ion beam deposition. They\nattributed the high threshold field solely to the embedding of\nthe nanowires in the a-C matrix whose dielectric constant\nreduces the field experienced by the nanowire and conse-\nquentially larger applied fields are required for emission.\nHowever, in their study the mean separation between ion\ntracts was reported to be 80 nm and the length of the nano-\nwires to be no larger than 200 nm. In such a situation the\nnanowires will be very strongly electrostatic screened by\nother nanowires as the separation-to-length ratio is only 0.4.\nIn our study the nanowires are separated by, on average, 710\nnm and have an average length of 500 nm \u0001corresponding to\nthe film thickness\u0002. The higher average internanowire sepa-\nration to length ratio in this study \u00011.4\u0002 suggests the presence\nof less proximity screening and helps us to explain the lower\napplied field required for emission when compared with the\nstudy by Schwen and colleagues.20 The field enhancement\nfactor value of the synthesized carbon nanowires in fullerene\nmatrix is comparable to carbon nanohorn prepared by laser\nablation of graphite, chemical vapor deposition grown car-\nbon nanofibers and multi walled carbon nantubes.19,21 The\nimproved field emission arises due to the structural transfor-\nmation along the ion paths. Some of us have shown previ-\nFIG. 3. The current versus voltage \u0001I−V\u0002 characteristics of the nanowire as\nmeasured in conducting atomic force microscopy.\nFIG. 4. \u0001Color online\u0002 \u0001a\u0002. The emission current versus applied voltage of\nthe synthesized carbon nanowires by ion irradiation. Four curves are shown\nto demonstrate the reproducibility of emission. \u0001Inset\u0002 Emission from an\nunimplanted fullerene film. The inset shows the emission properties of pris-\ntine film. \u0001b\u0002 The Fowler–Nordheim representation of one of the curves in\n\u0001a\u0002 of the synthesized carbon nanowires by ion irradiation.\n044305-3 Kumar et al. J. Appl. Phys. 102, 044305 \u00022007\u0001\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nously that the conductivity of the SHI irradiated fullerene\nthin film increases significantly,12,22 which is attributed to the\nfact that the swift heavy ions create track in fullerene thin\nfilm, breaking the fullerene cages within the track to form\nnanocrystalline graphite embedded in a-C carbon,14 which is\nelectrically more conducting than the parent fullerene mol-\necule.\nIV. CONCLUSION\nIn summary, the fabrication of conducting carbon nano-\nwires in fullerene matrix by heavy ion irradiation is reported\nand their electrical and field emission properties are studied.\nNo catalyst or any further purification is required, unlike in\nthe case of carbon nanotubes. Irradiation using the mask of\ndesired geometry can create according geometry nanowires\nand the conductive AFM measurements show that the nano-\nwires are parallel to each other and perpendicular to sub-\nstrate. Irradiation only requires a short time, which allows for\nsynthesis in large quantities. Thus, the present approach of\nmaking carbon nanowires is quite promising and these\nCNWs may be useful for better field emitters and large scale\napplications.\nACKNOWLEDGMENTS\nTwo of the authors \u0001D.K.A. and J.C.P.\u0002 are thankful to\nthe Indo French Centre for Promotion of Advanced Research\nfor financial support to carry out work on “Generation of\nnanophase by energetic ion beams”. One of the authors\n\u0001A.K.\u0002 is thankful to Council of Scientific and Industrial Re-\nsearch \u0001CSIR\u0002, New Delhi, India for providing fellowship.\nThey are also thankful to DST for providing the financial\nsupport to procure AFM\/C-AFM under the IRPHA project.\nWork at Surrey is sponsored by the EPSRC.\n1S. J. Limmer and G. Z. Cao, Adv. Mater. 15, 427 \u00012003\u0002.\n2N. A. Melosh, A. Boukai, F. Diana, B. Gerardot, A. Badolato, P. M.\nPetroff, and J. R. Heath, Science 300, 112 \u00012003\u0002.\n3Z. F. Ren, Z. P. Huang, J. W. Xu, J. H. Wang, P. Bush, M. P. Siegal, and P.\nN. Provencio, Science 282, 1105 \u00011998\u0002.\n4X. D. Wang, C. J. Summers, and Z. L. Wang, Nano Lett. 4, 423 \u00012004\u0002.\n5S. Seki, K. Maeda, S. Tagawa, H. Kudoh, M. Sugimoio, Y. Morita, and H.\nShibata, Adv. Mater. 13, 1663 \u00012001\u0002.\n6S. K. Srivastava, D. K. Avasthi, and E. Pipple, Nanotechnology 17, 2518\n\u00012006\u0002.\n7M. W. Geis, J. C. Twichell, J. Macaulay, and K. Okano, Appl. Phys. Lett.\n67, 1328 \u00011995\u0002.\n8R. C. Smith, J. D. Carey, R. J. Murphy, W. J. Blau, J. N. Coleman, and S.\nR. P. Silva, Appl. Phys. Lett. 87, 263105 \u00012005\u0002.\n9T. Hara, J. Onoe, and K. Takeuchi, J. Appl. Phys. 92, 7302 \u00012002\u0002.\n10J. D. Carey, R. D. Forrest, R. U. A. Khan, and S. R. P. Silva, Appl. Phys.\nLett. 77, 2006 \u00012000\u0002.\n11W. Zhu, G. P. Kochanski, and S. Jin, Science 282, 1471 \u00011998\u0002.\n12L. Nilsson, O. Groening, C. Emmenegger, O. Kuettel, E. Schaller, L.\nSchlapbach, H. Kind, J.-M. Bonard, and K. Kern, Appl. Phys. Lett. 76,\n2071 \u00012000\u0002.\n13J. Kastner, H. Kuzmany, and L. Palmetshofer, Appl. Phys. Lett. 65, 543\n\u00011994\u0002.\n14N. Bajwa, A. Ingale, D. K. Avasthi, R. Kumar, K. Dharamvir, and V. K.\nJindal, J. Appl. Phys. 94, 326 \u00012003\u0002.\n15K. B. K. Teo et al., Nanotechnology 14, 204 \u00012003\u0002.\n16J. F. Zeigler, J. P. Biersack, and V. Littmark, The Stopping and Range of\nIons in Solids \u0001Pergamon, New York, 1985\u0002.\n17J. D. Carey, R. D. Forrest, and S. R. P. Silva, Appl. Phys. Lett. 78, 2339\n\u00012001\u0002.\n18A. Kumar, D. K. Avasthi, A. Tripathi, D. Kabiraj, F. Singh, and J. C.\nPivin, J. Appl. Phys. 101, 014308 \u00012007\u0002.\n19J.-M. Bonard, R. Gaal, S. Garaj, L. Thien-Nga, L. Forro, K. Takahashi, F.\nKokai, M. Yudasaka, and S. Iijima, J. Appl. Phys. 91, 10107 \u00012002\u0002.\n20D. Schwen, C. Ronning, and H. Hofsass, Diamond Relat. Mater. 13, 1032\n\u00012004\u0002; N. Koenigsfeld, H. Hofsass, and D. Schwen, ibid. 12, 469 \u00012003\u0002.\n21J.-M. Bonard, N. Weiss, H. Kind, T. Stockli, L. Forro, K. Kern, and A.\nChatelain, Adv. Mater. 13, 184 \u00012001\u0002.\n22A. Kumar, F. Singh, R. Kumar, J. C. Pivin, and D. K. Avasthi, Solid State\nCommun. 138, 448 \u00012006\u0002.\n044305-4 Kumar et al. J. Appl. Phys. 102, 044305 \u00022007\u0001\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n"}