{"doi":"10.1177\/0047287506291596","coreId":"101664","oai":"oai:epubs.surrey.ac.uk:1093","identifiers":["oai:epubs.surrey.ac.uk:1093","10.1177\/0047287506291596"],"title":"Tourism Demand Forecasting: A Time Varying Parameter Error Correction Model","authors":["Li, G","Wong, KKF","Song, H","Witt, SF"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"<p>The advantages of error correction models (ECMs) and time varying parameter (TVP) models have been discussed in the tourism forecasting literature. These models are now combined to give a new single-equation model, the time varying parameter error correction model (TVP-ECM), which is applied for the first time in the context of tourism demand forecasting. The empirical study focuses on tourism demand, measured by tourism spending per capita, by UK residents for 5 key Western European destinations. Based on the discussion of how the series considered related to most, the empirical results show that the TVP-ECM can be expected to outperform a number of alternative econometric and time series models in forecasting the demand for tourism. By measuring performance in terms of the accuracy of the forecasts of growth (rates of change) and showing that TVP-ECM performs very well for this as well as conventional assessment of the level of demand in this study, it is suggested that forecasters of tourism demand levels and growth rates can feel comfortable using TVP-ECM given that it is expected to perform well.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1093<\/identifier><datestamp>\n      2017-10-31T14:00:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1093\/<\/dc:relation><dc:title>\n        Tourism Demand Forecasting: A Time Varying Parameter Error Correction Model<\/dc:title><dc:creator>\n        Li, G<\/dc:creator><dc:creator>\n        Wong, KKF<\/dc:creator><dc:creator>\n        Song, H<\/dc:creator><dc:creator>\n        Witt, SF<\/dc:creator><dc:description>\n        <p>The advantages of error correction models (ECMs) and time varying parameter (TVP) models have been discussed in the tourism forecasting literature. These models are now combined to give a new single-equation model, the time varying parameter error correction model (TVP-ECM), which is applied for the first time in the context of tourism demand forecasting. The empirical study focuses on tourism demand, measured by tourism spending per capita, by UK residents for 5 key Western European destinations. Based on the discussion of how the series considered related to most, the empirical results show that the TVP-ECM can be expected to outperform a number of alternative econometric and time series models in forecasting the demand for tourism. By measuring performance in terms of the accuracy of the forecasts of growth (rates of change) and showing that TVP-ECM performs very well for this as well as conventional assessment of the level of demand in this study, it is suggested that forecasters of tourism demand levels and growth rates can feel comfortable using TVP-ECM given that it is expected to perform well.<\/p><\/dc:description><dc:date>\n        2006<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1093\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Li, G, Wong, KKF, Song, H and Witt, SF  (2006) Tourism Demand Forecasting: A Time Varying Parameter Error Correction Model   Journal of Travel Research, 45 (2).  pp. 175-185.      <\/dc:identifier><dc:relation>\n        10.1177\/0047287506291596<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1093\/","10.1177\/0047287506291596"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \nTourism Demand Forecasting: A Time Varying \nParameter Error Correction Model  \n \nGANG LI\na\n, KEVIN K. F. WONG\nb\n, HAIYAN SONG\nb1\n, AND STEPHEN F. WITT\nb\n  \n \n \na\n School of Management, University of Surrey, Guildford GU2 7XH, United Kingdom \nb\n School of Hotel and Tourism Management, The Hong Kong Polytechnic University, \nHung Hom, Kowloon, Hong Kong \n \n \nThe advantages of error correction models (ECMs) and time varying parameter \n(TVP) models have been discussed in the tourism forecasting literature. These models \nare now combined to give a new single-equation model, the time varying parameter \nerror correction model (TVP-ECM), which is applied for the first time in the context \nof tourism demand forecasting. The empirical study focuses on tourism demand, \nmeasured by tourism spending per capita, by UK residents for 5 key Western \nEuropean destinations. Based on the discussion of how the series considered related \nto most, the empirical results show that the TVP-ECM can be expected to outperform \na number of alternative econometric and time series models in forecasting the \ndemand for tourism. By measuring performance in terms of the accuracy of the \nforecasts of growth (rates of change) and showing that TVP-ECM performs very well \nfor this as well as conventional assessment of the level of demand in this study, it is \nsuggested that forecasters of tourism demand levels and growth rates can feel \ncomfortable using TVP-ECM given that it is expected to perform well.  \nKey words: time varying parameter, error correction model, tourism demand, ex post \nforecasting, Kalman filte \n \n                                                 \n1\n Corresponding author. Tel: +852 2766 6372; Fax: +852 2362 9362; Email: \nhmsong@polyu.edu.hk. \nGang Li is a Lecturer in Economics in the School of Management, University of Surrey, United \nKingdom. Kevin K. F. Wong is Associate Professor in the School of Hotel and Tourism \nManagement, The Hong Kong Polytechnic University, Hong Kong. Haiyan Song is a Chair \nProfessor of Tourism in the School of Hotel and Tourism Management, The Hong Kong \nPolytechnic University, Hong Kong. Stephen Witt is a Visiting Professor in the School of Hotel \nand Tourism Management, The Hong Kong Polytechnic University, Hong Kong, and is an \nEmeritus Professor at the University of Surrey, United Kingdom. The research was funded by \nthe Competitive Earmarked Research Grant (Project Account: G-T675) from The Hong Kong \nPolytechnic University for which the authors are very grateful. The first author thanks the \nSchool of Hotel and Tourism Management, The Hong Kong Polytechnic University, for \nproviding financial support and research facilities during his visit to the school as a Visiting \nAssistant Professor. \n 2 \nAccurate forecasting of tourism demand plays important roles in tourism planning of \nboth public and business sectors due to the perishable nature of tourism products.  As \nfar as government agencies are concerned, accurate forecasts of tourism flows \nfacilitate their policy projection in various areas, such as price regulation, \nenvironmental quality control, and provision of sufficient infrastructures. As for \ntourism businesses aiming to maximize their profits, accurate forecasts can “avoid the \nfinancial costs of excess capacity or the opportunity costs of unfilled demand” \n(Frechtling 2001, p6).   \nTourism demand forecasting has been attracting increasing attention in the last two \ndecades by both tourism researchers and tourism practitioners. A number of \nunivariate\/time-series and econometric forecasting techniques have been applied to \nthe tourism context. With regard to time-series forecasting, ARIMA model has won \nthe greatest popularity. It has shown sound performance in a number of tourism \nforecasting studies such as Chu (1998) and Lim and McAleer (2002). The naïve no-\nchange model showed its superior forecasting accuracy earlier tourism forecasting \nstudies such as Mattin and Witt (1989). Both of them are often used as benchmarks \nfor forecasting accuracy comparisons amongst other time-series or\/and econometric \nmodels. Exponential smoothing method was also used frequently for tourism \nforecasting in the 1980s, and they showed satisfactory performance in direction \nchange and trend change forecasting (see, for example, Witt and Witt, 1989 and 1991, \nrespectively). Another category of forecasting techniques—the econometric \napproach—have been developed well in tourism forecasting studies. Such modern \neconometric methods as the error correction model (ECM) and the time varying \nparameter (TVP) model have been applied to the tourism context over the last decade. \nA comprehensive review of the recent developments in tourism forecasting techniques \ncan be found in Li, Song, and Witt (2005a).  \nThe advantages of using the ECM in tourism demand forecasting lie in its ability to \ncapture the short-run dynamic characteristics of tourism demand given the long-run \ncointegration (equilibrium) relationship. In order words, the ECM reflects a dynamic \nself-correcting process of tourism demand behavior towards its long-run steady sate \n(Song, Witt, and Li 2003). In addition, ECMs can avoid the occurrence of spurious \nregression and multicollinearity problems, which may otherwise affect the reliability \nand accuracy of the econometric analyses.  \nSeveral ECM estimation methods have been used in tourism demand studies, for \nexample, the Engle-Granger (1987) two-stage approach (EG-ECM), the Wickens-\nBreusch (1988) one-stage approach (WB-ECM), and the Johansen (1988) maximum \nlikelihood approach (JML-ECM). All of these approaches have their merits (see, Song \nand Witt 2000 for detailed explanation), and no clear-cut evidence shows that one \napproach is consistently superior to the others. The EG-ECM is straight forward to \nestimate and it has been used frequently in recent studies on tourism demand \nforecasting (see, for example, Gonzalez and Moral, 1995, Kulendran and Wilson, \n2000, and Song, Romilly, and Liu, 2000). Recent applications of other ECMs to \ntourism demand analysis include Dritsakis (2004), Lim and McAleer (2001, 2002), \nNarayna (2004), Webber (2001).  \nAnother advance in econometric forecasting refers to the TVP technique. The TVP \nmodel relaxes the constancy restriction on the parameters to be estimated in a \n 3 \ntraditional fixed-parameter econometric model to take account of the possibility of \nparameter changes over time. Applications of the TVP model to tourism demand \nforecasting have shown its superiority over fixed-parameter econometric models in \nterms of short-run forecasting accuracy (see, for instance, Song, Witt, and Jensen \n2003; Witt, Song, and Louvieris 2003).  \nThere are two broad categories of econometric models that have been applied in \ntourism demand modeling and forecasting studies: the (usual) single-equation models \n(such as autoregressive distributed lag models (ADLMs) and ECMs) and (the much \nless common) system-of-equations models (such as the linear almost ideal demand \nsystem, or LAIDS). Amongst the single-equation tourism demand studies, so far the \nTVP technique has been applied only to static or long-run cointegration models. In the \ntourism forecasting literature, no publication has been found on the combination of \nthe TVP technique with the ECM. With regard to the system-of-equations models, \nthere has been only one study, by Li, Song, and Witt (2005b), which has introduced \nthe TVP-ECM into the LAIDS framework. This study has demonstrated the improved \nforecasting performance of the TVP-ECM in comparison with its static counterpart. \nThere has been no study in the tourism context which applies the single-equation \nTVP-ECM to demand forecasting and examines its forecasting ability relative to \nfixed-parameter single-equation econometric models. This paper therefore aims to \nbridge this gap in the tourism literature. For the first time, this study will introduce the \nsingle-equation TVP-ECM into tourism forecasting practice and present empirical \nevidence of enhanced forecasting accuracy over various fixed-parameter econometric \nmodels. With regard to tourism demand forecasting assessment, most studies have \nfocused on the prediction of demand levels, while the ability of models to forecast the \ngrowth of tourism demand has been ignored. In practice, the change of tourism \ndemand is of particular concern in tourism businesses, as in such a competitive \nenvironment of the tourism industry, business strategies need to be adjusted \nfrequently according to the dynamic changes of the demand of their products. In this \nstudy both the level of tourism demand and the growth of tourism demand are \nconsidered in the forecasting evaluation.  \nTHE MODELS \nThe TVP-Long-Run Model (TVP-LRM)  \nTVP models are normally specified in a state space form (SSF), and estimated by the \nKalman filter algorithm (Kalman 1960). State space modeling was developed in the \ncontrol engineering science and was introduced into economic analysis in the 1980s.  \nIt assumes that the dynamic features of the system under study are determined by the \nunobserved variables associated with a series of observations (Durbin and Koopman \n2001). The state space presentation allows unobserved variables to be included into, \nand estimated along with, the observable model. By inferring the relevant properties \nof the unobserved series from the knowledge of the observations, the evolution of the \nsystem can be more precisely described and predicted. A linear SSF can be written as:  \n,tttt Zy εα +′=  ),,0(~ tt HNε  Tt ,...,1=    (1) \n,1 tttt T ηαα +=+  ),(~ 111 PaNα , ),,0(~ tt QNη    (2) \n 4 \nwhere ty  is the dependent variable; tZ  is a vector of  independent variables; tα  is an \nunobserved vector called state vector; tε  refers to the temporary disturbance and tη  \nthe permanent disturbance, tε  and tη  are Gaussian disturbances, which are serially \nindependent and independent of each other at all time points; The matrices tT , tH  \nand tQ  are initially assumed to be known. Equation (1) is called the observation \nequation, and Equation (2) called the state equation. In most of the economic \napplications, the evolution of tα  is assumed to follow a multivariate random walk. i.e., \n.1 ttt ηαα +=+  This assumption is also applied in the current study. The initial value \nof tα , i.e., 1α , can be estimated by maximum likelihood from the first few \nobservations of ty  and tZ , and 1P  is its variance (Durbin and Koopman 2001; \nHarvey 1989). \nSince the observation equation (1) is based on the classical econometric model—the \nstatic or long-run cointegration model, the TVP specification of Equation (1) is \nknown as the TVP-LRM. The TVP-LRM only focuses on the variations of \ncoefficients over time. Whether there is any long-run stable relationship is not a \nconsideration. In other words, there is no short-run disequilibrium adjustment \nmechanism to be incorporated into the model specification. \nThe TVP model was not applied to tourism demand studies until the late 1990s, and \nits applications are still limited. Amongst these studies, Song and Witt (2000), Song, \nWitt, and Jensen (2003) and Witt, Song, and Louvieris (2003) have examined the \nTVP model’s performance in forecasting international tourism demand in comparison \nwith other fixed-parameter econometric models and time-series models. The first two \nstudies assess forecasting accuracy in terms of error magnitude using the measures \nmean absolute percentage error (MAPE) and root mean squared percentage error \n(RMSPE). In both studies, the TVP model outperforms all the competitors including \nthe autoregressive distributed lag model (ADLM), the vector autoregressive (VAR) \nmodel, ECMs and the naive no-change model in the one-year-ahead forecasting \ncomparison. With regard to the overall (from one- to four-years-ahead) performance, \nthe TVP model is still ranked top (evaluated by the RMSPE) in Song and Witt (2000) \nand above average in Song, Witt, and Jensen (2003). Witt, Song, and Louvieris (2003) \ninvestigate the forecasting performance of the TVP model in terms of both error \nmagnitude and directional change. The comparison results show that in both \nassessments the TVP model is ranked second best amongst 7 candidates in the one-\nyear-ahead forecasting competition. Li, Song, and Witt (2005b) develop the TVP-\nLAIDS and TVP-EC-LAIDS and compare their forecasting performances with the \nstatic AIDS. The empirical findings show that both TVP-LAIDS and TVP-EC-LAIDS \noutperform their static counterparts in all comparisons of one- to four-years-ahead \nforecasts. Since all of these empirical studies showed that the TVP technique is \nsuperior to the alternative econometric models for short-run tourism demand \nforecasting, further applications and developments of this approach should be \nencouraged. \nThe TVP-ECM  \nEngle and Granger (1987) show that in a system of two variables, if a long-run \nequilibrium relationship exists, the short-term disequilibrium relationship between the \n 5 \ntwo variables can be represented by an ECM. Such an ECM can accommodate an \nadjustment process that prevents economic variables from drifting too far away from \ntheir long-run equilibrium time path (see, for example, Thomas 1993, p.153). Such a \ntechnique is very useful in the situations where both long-run equilibrium and short-\nrun disequilibrium behavior are of interest. It should be noted that if there are more \nthan two variables in the system, it is possible that there will be more than one \ncointegrating relationships, and correspondingly the ECM becomes a vector, i.e., \nVECM. This case is beyond the discussion of this paper due to its irrelevance to the \nfollowing empirical study.  \nAccording to the Engle-Granger two-stage approach (EG-ECM), testing for the long-\nrun equilibrium relationship between a set of economic variables and modeling their \nshort-run dynamics via an ECM can be carried out in a two-step procedure. Most \neconomic variables are non-stationary or integrated of order 1, denoted as I (1), which \nmeans they need to be differenced before they become stationary. The first step of the \nEngle-Granger approach is to test for the cointegration relationship amongst the I(1) \nvariables, yt  and tZ , based on the static long-run equilibrium regression:  \n  ,ttt eZy +′= α       (3) \nwhere α (without a subscript) is a fixed parameter vector. After confirming the \nacceptance of a cointegration relationship, the second step is to estimate an ECM  \n tt\np\nj\njtj\np\ni\nitit ueyZy ++∆+∆=∆ −\n=\n−\n=\n− ∑∑ 1\n10\nˆλφβ    (4) \nwhere αˆˆ 111 −−− −= ttt Zye  are the OLS residuals from the cointegration function (3), \nrepresenting the error correction mechanism; p is the lag length; iβ , jφ and λ  are \nparameters to be estimated; the value of λ  implies that the system will adjust itself \ntoward equilibrium by removing λ  of a unit from the error made in the previous \nperiod (Song and Witt 2000).  \nThe EG-ECM has been employed widely for forecasting and policy evaluation. \nApplications of the EG-ECM started to appear in the tourism literature a decade ago. \nFor example, Kulendran and Wilson (2000) show that the EG-ECM performs better \nthan the other two competitors: the naive no-change model and seasonal ARIMA \nmodels, in the one-quarter-ahead forecasting comparison. Song, Romilly, and Liu \n(2000) illustrate that the EG-ECM generally outperforms all the other models in their \ncomparison including the VAR, AR(1), ARMA and naive models as far as one-year-\nahead forecasting is concerned. However, the EG-ECM does not perform well in the \nstudy by Gonzalez and Moral (1995) using monthly data. Its poor performance may \nbe associated with the different data frequency in use. Therefore, as far as forecasts of \nseasonal tourism demand are concerned, the EG-ECM should be used with caution, \nand alternative forecasting models including other forms of ECMs should be \nconsidered.    \n The specification of the conventional fixed-parameter ECM, Equation (4), implies \nthat the speed of short-run adjustment is constant over time. In the consistently \nchanging economic environment such an assumption seems to be too strict and \n 6 \narbitrary. In fact, “even assuming the existence of a stable long-run combination, one \nmay find signs of instability in the short-run adjustment mechanism” (Ramajo 2001). \nTherefore, it is more easily understandable to specify the TVP short-run dynamics \nwithin the long-run equilibrium framework, i.e., the TVP-ECM.  \nAs with the TVP-LRM, the TVP-ECM can be specified in an SSF. In the case where \nthe lag length of the different variables is zero, which has been proved to be \nappropriate in most tourism studies using annual datasets, the observation equation of \nthe TVP-ECM can be written as: \ntttttt veZy ++′∆=∆ −1ˆλβ      (5) \nwhere tβ  is the time-varying parameter vector, and tv  is the temporary disturbance \nterm. The state equation still takes the same form as Equation (2), and ),( ′= ttt λβα .  \nIt should be noted that dummy variables can be readily incorporated into both the \nTVP-LRM and the TVP-ECM in order to capture the effects of one-off events such as \nthe Gulf War and the Oil Crises. Since these one-off events are regarded as exogenous \nfactors for tourism demand, it is not necessary to estimate the parameters using the \nTVP technique and fixed parameters are appropriate for dummy variables in a TVP \nmodel. \nSo far there has been no application of the TVP-ECM to single-equation modeling \nand forecasting of tourism demand, and its forecasting performance, relative to other \nfixed-parameter single-equation approaches, has not been examined. This paper \nbridges this gap by applying the TVP-ECM to modeling and forecasting UK tourism \ndemand in some key Western European destinations and comparing its forecasting \nperformance with other single-equation econometric models.  \nEMPIRICAL RESULTS AND DISCUSSION \nWestern Europe is the most popular destination area for UK residents. Within this \narea, France, Spain, Italy, Greece and Portugal are the major destinations. Demand for \ntourism in these five destinations accounts for about 70% of the total in this region.  \nTherefore, a great deal of attention is paid to these nations by those tourism \nbusinesses operating in this region. This study will therefore focus on these five \ndestinations in Western Europe. It should be noted that demand for tourism in these \nfive destinations has different characteristics. Spain, Italy, Greece and Portugal \nfeature leisure destinations, while France receives a larger proposition of business \ntravelers as well as holiday makers. With regard to the magnitude of tourism demand, \nmeasured by tourism spending in these destinations, it spreads into three levels: \nFrance and Spain each receive more than 20% of the total spending by UK visitors in \nWestern Europe, Italy and Greece accounts for 8% or so, while only 4% goes to \nPortugal. As with most tourist destinations, demand in these five countries all \nexperience growth to some extent in the long run (see Figure 1). However, it presents \ndifferent growth patterns and speeds in these counties. For example, demand for \nFrance, Italy and Portugal shows gradual and stable evolvements, while that for Spain \nand Greece experiences more fluctuations. Since the destinations included in this \nstudy present a reasonably wide coverage of different scenarios, the empirical results \n 7 \nof this study are likely to be applied to analysis of tourism demand for other countries \nor regions.   \nFIGURE 1 \nTOURISM SPENDING BY UK RESIDENTS IN SELECTED DESTINATIONS \n \n \nData and Variables \nThe tourism demand function is written in the following form for each of the five \ndestinations: \n)91,74,,,( DUMDUMLRSPILRCPILHDIPIfLSPPI iii =    (5) \nwhere L in each variable indicates logarithm; SPPIi is tourism demand for destination \ni (i=1, 2, …, 5), measured by the real tourism spending per capita in the destination \ncovering all travel purposes and means. It is calculated by dividing the nominal \ntourism spending by the UK population, adjusted by the consumer price index (CPI) \nin destination i and the appropriate exchange rate; HDIPI is the income of UK tourists, \nmeasured by the index of household disposable income per capita in constant prices \n(1995=100); RCPIi and RSPIi are the relative price and substitute prices, respectively. \nThe relative price is calculated based on Song and Witt (2000), i.e., it is calculated by \ndividing the CPI in destination i by that of the UK, adjusted by the appropriate \nexchange rate. The substitute price for each of the five equations is calculated as the \nweighted average of relative prices of the other four destinations, with shares of \nspending in these potential substitute destinations being weights. In addition, two \ndummy variables (DUM74 and DUM91) are incorporated to account for the effects of \nthe Oil Crises in 1974-1975 and the Gulf War in 1991.  \n0\n1000\n2000\n3000\n4000\n5000\n6000\n72 74 76 78 80 82 84 86 88 90 92 94 96 98 00 02 04\nFRANCE\nGREECE\nITALY\nPORTUGAL\nSPAIN\n Year \nS\np\nen\nd\nin\ng\n (\n£\nm\nil\nli\no\nn\n) \n 8 \nSince the demand is measured by tourism spending within the destination, travel cost \nbetween the origin and destination countries is not included as an explanatory variable. \nBesides the above economic variables, other factors, such as destination imagery, \ncompeting travel modes and tourists’ demographic features, may also influence the \ndemand for tourism. However, due to the unavailability of the time series of these \nvariables, they are excluded from the econometric analysis at a macro level. Since the \npurposes of this study are to illustrate the evolvement of demand elasticities over a \nlong time period using the TVP technique and to examine the TVP models’ \nforecasting performance in the short to medium term (1-4 years ahead), annual data \nover the last 33 years (1972-2004) are used in this study. Based on annual data and \nthe specifications of the adopted TVP models which do not accommodate seasonal \neffects, this study therefore is not to analyze seasonality of tourism demand, while it is \nof interest of future studies. Tourism spending data (in nominal terms) are collected \nfrom the International Passenger Survey (IPS), published in Travel Trends (various \nissues), and income data are collected from Economic Trends (2001), both published \nby the Office for National Statistics (ONS), UK. The data on prices, exchange rates \nand population are collected from International Financial Statistical Yearbook \n(various issues) published by the International Monetary Fund. \nBefore model estimation, unit root tests need running to examine the stationary \nproperty of all the variables. Both Augmented Dickey-Fuller test and Phillips-Perron \ntest suggest that all the above variables excluding dummies are I (1) series. The \nhypothesis test for the optimal lag suture of the dynamic model (ADLM) for each \ndestination suggest lag length equal to one is appropriate for each variable. \nCorrespondingly, no lag terms of the differenced variables are required to be included \nin the ECMs. The further Johansen cointegration test shows that one cointegration \nrelationship exists in each model.\n2\n Therefore, ECM representations are to be used in \nthe following model estimations. \nKalman Filter Estimates of the TVP-LRM and TVP-ECM \nThe above tourism demand function (5) can be rewritten in the SSF and following the \nEngle-Granger two-stage approach, both the TVP-LRM and TVP-ECM can be \nestimated using the Kalman filter algorithm. The computing program of EViews 5.0 is \nadopted for the model estimation. The estimates of the TVP-LRM and the TVP-ECM \nfor each destination are shown in Tables 1 and 2, respectively. The parameters \nreported are the estimates at the end of the sample period. In such a log-log model, the \ncoefficients of income, own-price and substitute prices variables show the level of \nvarious demand elasticities respectively. Parallel to fixed-parameter econometric \nmodels, a well-specified TVP model should also pass various diagnostic tests. Three \ndiagnostic tests: non-normality, heteroscedasticity and predictive failure, are carried \nout in each estimated equation (technical illustrations of these tests are available in \nHarvey 1989, Chapter 5). Apart from the Greece TVP-LRM which suffers from \nheteroscedasticity, the other equations pass all the diagnostic tests. These results \nsuggest that the TVP specification is appropriate for the tourism demand data studied.  \n \n                                                 \n2\n The results of unit root tests and cointegration tests are not presented because of space constraints but \nare available from the authors upon request.  \n 9 \nTABLE 1 \n ESTIMATES OF FINAL TVP-LRMs (Dependent Variable: LSPPI) \n France Greece Italy Portugal Spain \nConstant -0.031 -0.139 -0.058 -0.055 -0.093 \nLHDIPI 2.817** \n(0.125) \n1.834* \n(0.821) \n1.935** \n(0.267) \n1.779** \n(0.678) \n2.220** \n(0.547) \nLRCPI -1.163** \n(0.286) \n-1.959** \n(0.345) \n-1.184** \n(0.217) \n-0.161 \n(0.540) \n-1.230* \n(0.489) \nLRSPI 0.997* \n(0.471) \n0.506 \n(0.849) \n-0.502** \n(0.121) \n-0.725* \n(0.348) \n-0.478 \n(0.853) \nDUM74 -0.081 -0.498  -0.177  \nDUM91     -0.176 \nLog likelihood 19.118 2.202 16.920 9.620 8.800 \nNO(2) 0.041 1.448 1.182 1.980 1.654 \nHE(9,9) 3.039 3.031 1.374 1.441 0.664 \nPF(8,20) 1.461 1.296 1.245 1.131 0.404 \nNote: values in parentheses are the root mean standard errors. Whether to include the dummy variables in \nthe above TVP-LRMs is decided by their statistical significance in the fixed-parameter \ncointegration models. NO refers to non-normality test, HE heteroscedasticity test, PF the Chow \npredictive failure test. For the statistical tests, the numbers in parentheses are the degrees of freedom.  \n*significant at the 5% level, and ** significant at the 1% level.  \n \nTABLE 2 \n ESTIMATES OF FINAL TVP-ECMs (Dependent Variable: ∆LSPPI) \n France Greece Italy Portugal Spain \n∆LHDIPI 1.321** \n(0.400) \n0.532 \n(1.633) \n1.531** \n(0.489) \n1.750 \n(2.910) \n2.418** \n(0.602) \n∆LRCPI -0.591 \n(0.320) \n-.1407** \n(2.900) \n-0.947** \n(0.2592) \n-1.170** \n(0.336) \n-0.238 \n(0.369) \n∆LRSPI -0.368 \n(0.233) \n0.214 \n(0.216) \n-0.231 \n(0.186) \n0.728 \n(0.997) \n-0.226 \n(0.286) \nEC (-1) -0.529** \n(0.129) \n-0.429** \n(0.108) \n-0.783** \n(0.174) \n-0.565** \n(0.0927) \n-0.602** \n(0.143) \n∆DUM74 -0.089 -0.485  -0.113  \n∆DUM91     -0.120 \nLog likelihood 25.147 10.262 18.756 8.506 12.939 \nNO(2) 1.274 0.633 1.207 1.483 1.166 \nHE(8,8) 1.096 1.100 1.591 0.554 0.161 \nPF(8,18) 1.153 0.648 1.329 0.823 0.226 \nNote: see Table 1. \n 10 \n  \nFIGURE 2 \nKALMAN FILTER ESTIMATES OF COEFFICIENTS IN THE FRANCE  \nTVP-ECM \n \n0.8\n1.2\n1.6\n2.0\n2.4\n2.8\n0.8\n1.2\n1.6\n2.0\n2.4\n2.8\n78 80 82 84 86 88 90 92 94 96 98 00 02 04\n-1.1\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n-1.1\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n78 80 82 84 86 88 90 92 94 96 98 00 02 04\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n-0.3\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n-0.3\n78 80 82 84 86 88 90 92 94 96 98 00 02 04\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n-0.3\n-0.2\n-1.0\n-0.9\n-0.8\n-0.7\n-0.6\n-0.5\n-0.4\n-0.3\n-0.2\n78 80 82 84 86 88 90 92 94 96 98 00 02 04\nC\no\ne\nff\nic\nie\nn\nt\nC\no\ne\nff\nic\nie\nn\nt\nC\no\ne\nff\nic\nie\nn\nt\nC\no\ne\nff\nic\nie\nn\nt\nYear Year\nYear Year\n  \nNote: since the diffuse initialization in the Kalman filter algorithm consumes a few observations at the \nbeginning of the data set, the valid plots start from 1978. \nFigure 2 presents the Kalman filter estimates of the coefficients in the France TVP-\nECM. The figures related to other destinations are also available from the authors \nupon request. The first three diagrams indicate the evolutions of the short-run income, \nown-price and cross-price elasticities over time. For example, diagram (1) suggests \nadecreasing short-run income elasticity, especially since the mid 1980s. The \nimplication is that with increasing disposable income, UK residents regard travel to \nFrance as less and less of a luxury. With regard to the short-run own-price elasticity, \ndiagram (2) indicates that UK residents’ demand for tourism in France has become \nless and less sensitive to price changes in general over the last twenty years, and this \ncan be seen from the decreasing (absolute) values of the own-price coefficients. This \nfinding reflects the phenomenon that mass tourism is losing its popularity in Western \nEurope and price reduction may no longer be a highly effective marketing strategy. \nOn the contrary, product differentiation and value added are more likely to be \neffective in the current state of competition in the tourism industry. The rising values \n(1) ∆LHIPI (2) ∆LRCPI \n(3) ∆LRSPI (4) EC \n 11 \n(from negative to positive) of the coefficient of substitute price suggest that both \nsubstitution and complementary effects exist amongst the relationships between \nFrance and the other four top UK destinations under investigation, and substitutability \nhas become more and more dominant especially during the last few years of the study. \nThis can be explained by the severe competition between France and Spain, the two \nmost popular destinations for UK tourists. This relationship was also apparent in \nprevious studies such as De Mello, Pack, and Sinclair (2002) and Li, Song, and Witt \n(2004). Diagram (4) refers to the evolution of the coefficient of the error term. The \nfluctuations confirm the earlier argument that it is more appropriate to assume \nchanging speeds of the short-run adjustment in the system.  \n \nEstimation of Fixed-Parameter Econometric Models \nIn order to assess the forecasting performance of the TVP-LRM and TVP-ECM \nrelative to fixed-parameter econometric models, the following models are included in \nthe comparison: the ADLM in a reduced form where only statistically significant \nvariables are kept in the final model; VAR model; Wickens and Breusch  ECM (WB-\nECM); Johansen maximum likelihood ECM (JML-ECM); and Engle Granger ECM \n(EG-ECM), all in the fixed-parameter framework. Due to space constraints, only the \nestimates of the France case are reported (see Table 3), while the others are also \navailable from the authors upon request. \nEx post Forecasting Comparison \nThe forecasting performances of the TVP-LRM and the TVP-ECM are compared \nwith those of the fixed-parameter econometric models discussed above. Two \nunivariate time series models (ARIMA and naive no-change models) along with the \nstatic econometric model are also included in the evaluation as benchmarks. All of the \nabove models used for the forecasting comparison are re-estimated, first using data \nfor the sample period 1972-1996, and the rest of data are used for ex post forecasting \naccuracy comparison. Then the sample period is extended to one year later each time \nuntil 2003 for model re-estimation and forecast projection. This study focuses on one- \nto four-years-ahead forecasting comparison, with the longer forecasting horizons \nbeing ignored due to fewer forecasts being available and lack of robustness in \ncomparison evaluation. The performance of the models in forecasting both demand \nlevels and growth (in relation to the levels and differenced dependent variables, \nrespectively) is evaluated. Forecasting errors are measured by both MAPE and \nRMSPE. Due to high consistency between the two measures in this study, only the \nresults of MAPE are reported (see Table 4). \n 12 \n \nTABLE 3 \nESTIMATES OF FIXED-PARAMETER ECONOMETRIC MODELS FOR \nFRANCE \n Dependent Variable: LSPPI  Dependent Variable: ∆ LSPPI \n Static ADLM VAR  WB-ECM JML-ECM EG-ECM \nConstant -0.100* \n(0.043) \n-0.064 \n(0.034) \n0.043 \n(0.055) \nConstant -0.069 \n(0.040) \n0.018 \n(0.030) \n \n \nLSPPI(-1)  0.425** \n(0.107) \n0.456* \n(0.238) \n∆ LRCPI -0.890* \n(0.400) \n -0.750* \n(0.314) \nLRCPI -2.258** \n(0.340) \n-1.150** \n(0.169) \n ∆ LRSPI -0.378 \n(0.381) \n -0.372 \n(0.303) \nLRCPI(-1)  -0.656* \n(0.311) \n-1.059* \n(0.626) \n∆ LHDIPI 1.596* \n(0.696) \n 2.130** \n(0.437) \nLRSPI 0.850* \n(0.319) \n  LSPPI(-1) -0.381* \n(0.148) \n  \nLRSPI(-1)  0.838** \n(0.219) \n0.361 \n(0.432) \nLRCPI(-1) -1.251* \n(0.510) \n  \nLHDIPI 2.200** \n(0.133) \n1.042** \n(0.256) \n LRSPI(-1) 0.508 \n(0.333) \n  \nLHDIPI(-1)    LHDIPI(-1) 0.662 \n(0.400) \n  \nDUM74 -0.232** \n(0.088) \n-0.151** \n(0.058) \n-0.181* \n(0.107) \n∆DUM74 -0.030 \n(0.070) \n-0.131 \n(0.901) \n-0.076 \n(0.071) \n    ECM(-1)  -0.282* \n(0.115) \n-0.484** \n(0.160) \n2R  0.979 0.991 0.976 2R  0.600 0.123 0.598 \nSC(1) 2.046 0.933 3.550 SC(1) 0.730 3.150 1.779 \nFF(1) 19.712** 9.859** 6.299* FF(1) 1.479 0.199 0.121 \nNO(2) 2.185 1.340 3.261 NO(2) 1.061 0.045 0.801 \nHE(1) 4.528 5.520 0.865 HE(1) 14.564 2.929 4.025 \nPF(df) 3.031* 0.787 0.525 PF(df) 1.573 0.464 1.180 \nNote: Values in parentheses are standard errors. SC(1) is the Lagrange multiplier test for serial correlation, \nNO(2) is the Jarque-Bera normality test, FF(1) is the Ramsey’s misspecification test, HE(1) is a \nheteroscedasticity test, PF(df) is the Chow predictive failure test, and df is the degrees of freedom. All apart \nfrom the Chow statistic are Chi-square statistics. The Chow test is an F statistic. Fore the statistical tests, the \nnumbers in parentheses are the degrees of freedom. \n** and * indicate the 1% and 5% significance levels. \n 13 \nTABLE 4  \nFORECASTING ACCURACY OVER DIFFERENT FORECASTING HORIZONS \nHorizon Measure Naive ARIMA Static ADLM VAR WB-ECM JML-ECM EG-ECM TVP-LRM TVP-ECM \n1-year-ahead MAPE 0.446 (8) 0.498 (9) 0.961 (10) 0.334 (4) 0.368 (6) 0.411 (7) 0.355 (5) 0.309 (3) 0.206 (1) 0.214 (2) \n2-years-ahead MAPE 0.602 (9) 0.592 (8) 0.929 (10) 0.388 (4) 0.432 (5) 0.565 (7) 0.265 (3) 0.460 (6) 0.174 (1) 0.222 (2) \n3-years-ahead MAPE 0.639 (10) 0.483 (8) 0.568 (9) 0.245 (3) 0.475 (7) 0.332 (5) 0.347 (6) 0.328 (4) 0.208 (2) 0.163 (1) \n4-years-ahead MAPE 0.702 (10) 0.476 (7) 0.610 (9) 0.282 (3) 0.524 (8) 0.420 (6) 0.374 (4) 0.391 (5) 0.218 (2) 0.164 (1) \nOverall MAPE 0.597 (9) 0.512 (8) 0.767 (10) 0.312 (3) 0.450 (7) 0.432 (6) 0.335 (4) 0.372 (5) 0.202 (2) 0.191 (1) \n1-year-ahead MAE 0.132 (8) 0.135 (9) 0.220 (10) 0.097 (4) 0.107 (5=) 0.111 (7) 0.107 (5=) 0.095 (3) 0.054 (1) 0.070 (2) \n2-years-ahead MAE 0.119 (8) 0.121 (9) 0.126 (10) 0.092 (3) 0.102 (6) 0.100 (4) 0.101 (5) 0.089 (2) 0.116 (7) 0.074 (1) \n3-years-ahead MAE 0.115 (7) 0.117 (8) 0.130 (10) 0.093 (3) 0.124 (9) 0.098 (4) 0.111 (6) 0.086 (2) 0.105 (5) 0.070 (1) \n4-years-ahead MAE 0.098 (4) 0.112 (8) 0.142 (10) 0.088 (2) 0.113 (9) 0.105 (7) 0.100 (5=) 0.100 (5=) 0.094 (3) 0.087 (1) \nOverall MAE 0.116 (8) 0.121 (9) 0.155 (10) 0.093 (4) 0.111 (7) 0.104 (5) 0.105 (5) 0.092 (2=) 0.092 (2=) 0.075 (1) \nNote: The upper half of the table refers to the forecasts of level variables, and the lower differenced variables. Figures in parentheses are rankings, and “=” indicates an equal rank. \n 14 \nWith regard to demand level forecasts, the TVP-ECM and TVP-LRM outperform the \nother models consistently over different forecasting horizons. Overall, they forecast at \nleast 35% more accurately than the other models in the comparison. In particular, the \nTVP-LRM predicts most accurately among all the candidate models in one-year- and \ntwo-years-ahead forecasting. The superiority of the TVP-LRM in short-term \nforecasting detected in this study is in line with the findings in previous studies such \nas Song and Witt (2000). As far as longer forecasting horizons are concerned, the \nTVP-ECM performs even better than the TVP-LRM. It has been observed that the \nreduced ADLM outperforms all the other fixed-parameter ECMs in the overall \nevaluation of demand level forecasting and in all but two cases for different \nforecasting horizons. These results are consistent with other economic forecasting \nexercises. As Clements and Hendry (1998)’s findings suggest, when level variables \nare forecast, the levels specification without CI relationship being imposed \noutperform the ECMs.  The naïve no-change model and the static econometric model, \nboth of which take no account of dynamics of tourism demand, and the ARIMA \nmodel which does not consider the explanatory power of various economic factors in \ntourism demand modeling, always performed poorly and are ranked the bottom three \namongst the ten competing models.  \nInsofar as tourism demand growth is concerned, the TVP-ECM and TVP-LRM appear \nto be top two again (and the EC-ECM performs equally well as the TVP-LRM) in \nterms of the overall performance. The TVP-LRM forecasts much more accurately \nthan the other in the one-year-ahead occasion, but it does not show the superior \nperformance in two- and three-years-ahead forecasting. The TVP-ECM shows greater \nconsistency in terms of its outstanding performance in demand growth forecasting. \nThe reduced ADLM and EG-ECM both predict consistently well over different \nforecasting horizons. As with demand level forecasting, the static and ARIMA models \nproject the least accurate forecasts overall. Although the naïve model shows above-\naverage performance in the four-years-ahead forecasting, its performance in other \noccasions is much poorer. As a result, its overall rank for demand growth forecasting \nis only higher than the static and ARIMA model.  \nWith regard to the overall performance of various models across different destinations \nunder the study, Table 5 shows that either TVP-ECM or TVP-LRM appears to best \nmodel for the five destinations concerned, and they always appear to be top three \namongst all the competitors. As for demand growth forecasting, the TVP-ECM gives \nthe best or the second best performance in all cases except Portugal, where the TVP-\nLRM appears to be the most accurate model. These results suggest that despite the \ndifferent characteristics of the demand for tourism in the five destinations, the TVP-\nECM and\/or TVP-LRM always present superior performance for forecasting both \ndemand level and growth. On the contrary, other models show divergent performance \nwhen different destinations are concerned. For example, although Table 4 shows the \noverall performance of the ADLM is satisfactory, it varies across different \ndestinations. It forecasts the demand for tourism in France and Italy relatively \naccurately, while poor performance appears in Spain’s case in both demand level and \ngrowth forecasting and in Portugal’s case as far as demand growth is concerned. Great \nfluctuations of forecasting performance between different destinations can also be \nseen in the JML-ECM and EG-ECM, although they show sound overall performance \nin demand level and growth forecasting, respectively, when the results for the \nindividual destinations are aggregated. \n 15 \nTABLE 5  \nOVERALL FORECASTING ACCURACY ACCROSS DIFFERENT DESTINATIONS  \nDestination Measure Naive ARIMA Static ADLM VAR WB-ECM JML-ECM EG-ECM TVP-LRM TVP-ECM \nFrance MAPE 0.410 (10) 0.339 (8) 0.322 (7) 0.146 (3) 0.355 (9) 0.261 (5) 0.291 (6) 0.155 (4) 0.119 (2) 0.116 (1) \nGreece MAPE 0.939 (8) 0.984 (9) 1.078 (10) 0.477 (5) 0.683 (7) 0.542 (6) 0.447 (4) 0.393 (3) 0.366 (2) 0.235 (1) \nItaly MAPE 0.467 (10) 0.380 (8) 0.191 (4=) 0.175 (2) 0.345 (7) 0.191 (4=) 0.399 (9) 0.227 (6) 0.154 (1) 0.190 (3) \nPortugal MAPE 0.623 (7) 0.522 (5) 1.989 (10) 0.439 (4) 0.561 (6) 1.250 (9) 0.293 (2) 0.964 (8) 0.220 (1) 0.297 (3) \nSpain MAPE 0.546 (10) 0.337 (8) 0.253 (5) 0.325 (7) 0.304 (6) 0.498 (9) 0.246 (4) 0.122 (2) 0.149 (3) 0.116 (1) \nFrance MAE 0.094 (6=) 0.113 (9) 0.130 (10) 0.077 (3) 0.099 (8) 0.094 (6=) 0.089 (4) 0.073 (2) 0.092 (5) 0.058 (1) \nGreece MAE 0.169 (8) 0.184 (9) 0.193 (10) 0.094 (2) 0.161 (7) 0.115 (4=) 0.135 (6) 0.096 (3) 0.115 (4=) 0.084 (1) \nItaly MAE 0.134 (8) 0.140 (10) 0.109 (5) 0.098 (3) 0.132 (7) 0.112 (6) 0.138 (9) 0.090 (2) 0.104 (4) 0.085 (1) \nPortugal MAE 0.089 (3) 0.092 (5=) 0.238 (10) 0.114 (7) 0.085 (2) 0.159 (9) 0.092 (5) 0.146 (8) 0.083 (1) 0.091 (4) \nSpain MAE 0.095 (8) 0.078 (5) 0.103 (9) 0.080 (6=) 0.080 (6=) 0.123 (10) 0.070 (3) 0.056 (1) 0.070 (3=) 0.058 (2) \nNote: See Table 4. \n 16 \n The above results in this study suggest that the TVP technique, especially in the \nspecification of TVP-ECM, contributes to consistent improvements of accuracy of \ntourism demand forecasting, regardless of forecasting horizons and destinations being \nconcerned. Therefore, tourism practitioners in this region can feel comfortable using \nTVP models to forecast future trends and growth rates of tourism demand by UK \nresidents in these destinations. Considering the increasingly competitive environment \nin the tourism market of this region, such as the strong competition between France \nand Spain in attracting UK visitors as discussed above, the more accurate forecasts of \nthe demand for these destinations can provide a clearer picture of the future trends of \ncompetition. Correspondingly, tourism businesses, such as those in transportation and \nhospitality sectors, can be more confident of adjusting the existing or taking new \nstrategies in order to win the competition. The predicted growth rates of tourism \ndemand for particular destinations can facilitate tourism businesses’ decision making \nin terms of identifying the optimal investment opportunity amongst alternative nations, \nor deciding the appropriate scale and pace of business expansion in a particular \ndestination if UK visitors are their key source market. In addition, the predicted future \nchange of tourism demand may indicate the positions of the current tourism products \nin their life cycles. Therefore, tour operators may need to consider modifying the \nexisting packages or designing new products in order to create or sustain their \ncompetitive advantages. As far as the public sectors (in both the origin and destination \nnations) are concerned, the potential socioeconomic effects of the future demand \nchanges need to be studied and the relevant policies should be reviewed and revised \naccordingly where necessary, in order to ensure the development of tourism follows a \nhealthy path.  \nCONCLUSIONS \nWithin the framework of single-equation econometric approaches to tourism demand \nforecasting, both the TVP model and ECM have generated relatively accurate \nforecasts. This paper, for the first time, combines these two approaches to develop the \nTVP-ECM for tourism demand studies. The forecasting performance of the TVP-\nECM is examined in comparison to several fixed-parameter single-equation \neconometric methods. The empirical study focuses on the demand for tourism by UK \nresidents at five key destinations in Western Europe. The one- to four-years-ahead ex \npost forecasting performance of the TVP-ECM and the TVP-LRM is compared with \nthe accuracy of forecasts generated by six commonly used fixed-parameter \neconometric models: the static model, reduced ADLM, VAR, WB-ECM, JML-ECM \nand EG-ECM. The naïve no-change and ARMA models also enter the comparison as \nbenchmarks. One- to four-years-ahead forecasts of demand levels and demand growth \nare examined. The comparison results show that the TVP-ECM and TVP-LRM are \nranked top two in general in both demand level and demand growth forecasting. In \nparticular, the TVP-ECM consistently shows its superior performance over other \nfixed-parameter econometric models and time-series models, regardless forecasting \nhorizons, destinations concerned, and whether demand level or demand growth being \nforecast. Consistent with previous studies, the TVP-LRM shows outstanding \nperformance in the short-run (one-year-ahead) forecasting of both demand level and \ngrowth. By contrast, the static model, taking no dynamics of tourism demand into \naccount, forecasts least accurately. The two univariate model benchmarks are \noutperformed by all the econometric approaches except the static model. Although the \nreduced ADLM and JML-ECM perform above average in demand level forecasting \n 17 \n(so do the EG-ECM and the reduced ADLM in demand growth forecasting) as far as \nthe aggregated forecasts over destinations are concerned, none of them performs \nconsistently well in each individual case of destination. These comparison results \nsuggest that the TVP models, especially the TVP-ECM, are superior over the other \nforecasting models in terms of both forecasting accuracy and consistency. Therefore, \nthey should be applied more broadly in tourism forecasting practice. It is plausible to \nexpect more accurate forecasts to be generated when the TVP-ECM is applied to other \ntourism regions, and this will contribute to more effective tourism policies and \nbusiness strategies projected by public and private sectors, respectively. \nIt should be noted that the forecasting accuracy comparisons in this study are assessed \nbased on the error measures MAPE and MAE, which do not have a statistical basis. In \norder words, these measures are unable to examine whether the differences between \nthe forecasting errors generated by alternative models are statistically significant. In \norder to draw more robust conclusions with regard to the superiority of the TVP \nmodels over their fixed-parameter counterparts, formal statistical tests of forecasting \ndifferences are required. Little attempt has been made in tourism forecasting so far \nand this suggests a new direction for further studies. Although Witt, Song, and \nLouvieris (2003) consider statistically significant differences in forecasting \nperformance as measured by directional changes, the examination of statistically \nsignificant differences in error magnitude measures should be of considerable interest. \nIn the current study, the total number of forecasts is extremely small (8 to 4 points in \none- to four-years-ahead forecasting horizons), and statistical tests tend to be biased as \nsmall sample sizes are concerned (Harvey, Leybourne, and Newbold 1997), therefore \nthe statistical test is beyond the discussion of this paper, but will be included in future \nstudies of forecasting comparison.  \nMoreover, to analyze the seasonal patterns of tourism demand in a particular \ndestination and to forecast future changes of seasonable patterns accurately are of \ngreat importance to tourism businesses. In order to achieve these, future studies \nfollowing this one are to extend the TVP models by introducing stochastic seasonal \nvariables into the TVP-LRM and TVP-ECM specifications and examining the \nforecasting performance of the developed models. Such studies can also facilitate \nstatistical tests for forecasting difference between various models, which will give \nmore robust conclusion with regard to the evaluation of forecasting performance. \n \n \nREFERENCES \nChu, F. L. (1998). “Forecasting tourism demand in Asian-Pacific countries.” \nAnnals of Tourism Research, 25: 597-615. \nClements, M. P. and D. F. Hendry (1998). Forecasting Economic Time Series. Cambridge: \nCambridge University Press. \nDe Mello, M., A. Pack, and M. T. Sinclair (2002). “A System of Equations Model of UK T \nourism Deand in Neighbouring Countries.” Applied Economics, 34: 509-21. \nDritsakis, N. (2004). “Cointegration Analysis of German and British Tourism Demand for \nGreece.” Tourism Management, 25: 111-19.  \n 18 \ndu Preez, J. and S. F. Witt (2003). “Univariate versus Multivariate Time Series Forecasting: \nAn Application to International Tourism Demand.” International Journal of Forecasting, \n19: 435-51. \nDurbin, J. and S. J. Koopman (2001). Time Series Analysis by State Space Methods. New \nYork: Oxford University Press. \nEngle, R. F. and C. W. J. Granger (1987). “Cointegration and Error Correction: \nRepresentation, Estimation and Testing.” Econometrica, 55: 251-76. \nFrechtling, D. C. (2001). Forecasting Tourism Demand: Methods and Strategies. Oxford: \nButterworth-Heinemann. \nHarvey, A. C. (1989). Forecasting, Structural Time Series Models and the Kalman Filter. \nCambridge: Cambridge University Press. \nHarvey, D., S. Leybourne, and P. Newbold (1997). “Testing the Equality of Prediction Mean \nSquared Errors.” International Journal of Forecasting, 13: 281-91. \nKalman, R. E. (1960). “A New Approach to Linear Filtering and Prediction Problems, \nTransitions ASME.” Journal of Basic Engineering, 82: 35-45. \nKulendran, N. and K. Wilson (2000). “Modelling Business Travel.” Tourism Economics, 6: \n47-59. \nLi, G., H. Song and S. F. Witt (2004). “Modelling Tourism Demand: A Dynamic Linear \nAIDS Approach.” Journal of Travel Research, 43: 141-50. \n——(2005a). “Recent Developments in Econometric Modeling and Forecasting.” Journal of \nTravel Research, 44: 82-99. \n——(2005b). “Time Varying Parameter and Fixed Parameter Linear AIDS: An Application to \nTourism Demand Forecasting.” International Journal of Forecasting, forthcoming. \nLim, C. and M. McAleer (2001). “Cointegration Analysis of Quarterly Tourism Demand by \nHong Kong and Singapore for Australia.” Applied Economics, 33: 1599-619. \n——(2002). “Time Series Forecasts of International Travel Demand for Australia.” Tourism \nManagement, 23: 389-96. \nNarayan, P. K. (2004). “Fiji’s Tourism Demand: The ARDL Approach to Cointegration.” \nTourism Economics, 10: 195-206. \nRamajo, J. (2001). “Time-Varying Parameter Error Correction Models: The Demand for \nMoney in Venezuela, 1983.I-1994.IV.” Applied Economics, 33: 771-82. \nSong, H. and S. F. Witt (2000). Tourism Demand Modelling and Forecasting: Modern \nEconometric Approaches. Oxford: Pergamon.  \nSong, H., P. Romilly and X. Liu (2000). “An Empirical Study of Outbound Tourism Demand \nin the U.K..” Applied Economics, 32: 611-24.  \nSong, H., S. F. Witt and T. C. Jensen (2003). “Tourism Forecasting: Accuracy of Alternative \nEconometric Models.” International Journal of Forecasting, 19: 123-41. \nSong, H., S. F. Witt and G. Li (2003). “Modelling and Forecasting the Demand for Thai \nTourism.” Tourism Economics, 9: 363-87. \nThomas, R. L. (1993). Introductory Econometrics, 2\nnd\n edition. London: Longman.  \nTucci, M. P. (1995). “Time-Varying Parameters: A Critical Introduction.” Structural Change \nand Economic Dynamics, 6: 237-60. \nWickens, M. R. and T. S. Breusch (1988). “Dynamic Specification, the Long-Run and the \nEstimation of Transformed Regression Model.” Economic Journal, 98 (Conference): \n189-205. \n 19 \nWitt, C.A. and S.F. Witt (1989). “Measures of Forecasting Accuracy: Turning Point Error v. \nSize of Error.” Tourism Management, 10: 255-60. \nWitt, S.F. and C.A. Witt (1991). “Tourism Forecasting: Error Magnitude, Direction of Witt, \nS.F., H. Song and P. Louvieris (2003). “Statistical Testing in Forecasting Model \nSelection.” Journal of Travel Research, 42: 151-58. \nWitt, S. F. and C. A. Witt (1991). “Tourism Forecasting: Error Magnitude, Direction of \nChange Error and Trend Change Error.” Journal of Travel Research, 30: 26-33. \n \n"}