{"doi":"10.1016\/j.advwatres.2004.01.004","coreId":"137828","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/908","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/908","10.1016\/j.advwatres.2004.01.004"],"title":"Water exclusion from tunnel cavities in the saturated capillary fringe","authors":["Youngs, E. G.","Kacimov, A. R.","Obnosov, Yu. V."],"enrichments":{"references":[{"id":38120772,"title":"Analytic formulae for rate of seepage ﬂow into drains and cavities.","authors":[],"date":"1998","doi":"10.1002\/(sici)1096-9853(199804)22:4<277::aid-nag918>3.0.co;2-c","raw":"Fujii, N., Kacimov, A.R., 1998. Analytic formulae for rate of seepage ﬂow into drains and cavities. International J. for Numerical and Analytical Methods in Geomechanics 22, 277-301.","cites":null},{"id":38120779,"title":"Analytical determination of seeping soil slopes of a constant exit gradient. Zeitschrift fur angewandte Mathematik und","authors":[],"date":"2002","doi":"10.1002\/1521-4001(200206)82:6<363::aid-zamm363>3.0.co;2-5","raw":"Kacimov, A.R., Obnosov Yu.V., 2002. Analytical determination of seeping soil slopes of a constant exit gradient. Zeitschrift fur angewandte Mathematik und Mechanik, 82, N6, 363-376.","cites":null},{"id":38120775,"title":"Applied and Computational Complex Analyis. Volume 3.","authors":[],"date":"1986","doi":null,"raw":"Henrichi, P., 1986. Applied and Computational Complex Analyis. Volume 3. John Wiley, New York.","cites":null},{"id":38120784,"title":"Asymptotic solutions of the seepage exclusion problem for elliptic-cylindrical, spheroidal, and strip- and disc-shaped cavities.","authors":[],"date":"1989","doi":"10.1029\/wr025i007p01531","raw":"Philip, J.R., 1989b. Asymptotic solutions of the seepage exclusion problem for elliptic-cylindrical, spheroidal, and strip- and disc-shaped cavities. Water Resour. Res. 25, 1531-1540.","cites":null},{"id":38120773,"title":"Boundary Value Problems.","authors":[],"date":"1977","doi":null,"raw":"7Gakhov, F.D., 1977. Boundary Value Problems. Moscow, Nauka (in Russian).","cites":null},{"id":38120777,"title":"Circular isobaric cavity in descending unsaturated ﬂow.","authors":[],"date":"2000","doi":"10.1061\/(asce)0733-9437(2000)126:3(172)","raw":"Kacimov, A.R., 2000. Circular isobaric cavity in descending unsaturated ﬂow. J. Irrigation and Drainage, ASCE 126, 172-178.","cites":null},{"id":38120781,"title":"Conformal Mapping.","authors":[],"date":"1975","doi":"10.2307\/2306832","raw":"Nehari, Z., 1975. Conformal Mapping. Dover, New York.","cites":null},{"id":38120790,"title":"Groundwater Mechanics.","authors":[],"date":"1989","doi":null,"raw":"Strack, O.D.L., 1989. Groundwater Mechanics. Prentice Hall, Englewood Cliﬀs.","cites":null},{"id":38120792,"title":"Mathematica. A System for Doing Mathematics by Computer.","authors":[],"date":"1991","doi":"10.2307\/2324863","raw":"Wolfram, S., 1991. Mathematica. A System for Doing Mathematics by Computer. Addison-Wesley, Redwood City.","cites":null},{"id":38120776,"title":"Problems of seepage to empty ditch and drain.","authors":[],"date":"1992","doi":"10.1029\/91wr02662","raw":"Ilyinsky, N.B., Kacimov, A.R., 1992. Problems of seepage to empty ditch and drain. Water Resour. Res. 28, 871-876.","cites":null},{"id":38120782,"title":"Solution of a mixed boundary-value problem in the theory of analytic functions.","authors":[],"date":"1981","doi":null,"raw":"Obnosov, Yu.V., 1981. Solution of a mixed boundary-value problem in the theory of analytic functions. Izv. VUZ. Mat. (Soviet Mathematics) No 10, 75-79.","cites":null},{"id":38120785,"title":"Some general results on the seepage exclusion problem.","authors":[],"date":"1990","doi":"10.1029\/wr026i003p00369","raw":"Philip, J.R., 1990. Some general results on the seepage exclusion problem. Water Resour. Res. 26, 369-377.","cites":null},{"id":38120791,"title":"Sopra alcune condizioni caratterstiche per le funzioni di variablie complessa.","authors":[],"date":null,"doi":"10.1007\/bf02580487","raw":"Volterra, V. 1883. Sopra alcune condizioni caratterstiche per le funzioni di variablie complessa. Ann. math. 11, Ser. 2, 1-55.","cites":null},{"id":38120789,"title":"Sopra on problema al contoro nella teoria della funzioni di variabile complessa.","authors":[],"date":"1916","doi":"10.1007\/bf02419705","raw":"Signorini, 1916. Sopra on problema al contoro nella teoria della funzioni di variabile complessa. Ann. mat. 24, Ser.3, 253-273.","cites":null},{"id":38120778,"title":"Steady seepage near an impermeable obstacle.","authors":[],"date":"1992","doi":"10.1016\/0022-1694(92)90153-m","raw":"Kacimov, A.R., Nicolaev, A.N., 1992. Steady seepage near an impermeable obstacle. J. Hydrology 138, 17-40.","cites":null},{"id":38120787,"title":"The seepage exclusion problem for parabolic and paraboloidal cavities.","authors":[],"date":"1989","doi":"10.1029\/wr025i004p00605","raw":"Philip, J.R., Knight, J.H., Waechter, R.T., 1989b. The seepage exclusion problem for parabolic and paraboloidal cavities. Water Resour. Res. 25, 16-28.","cites":null},{"id":38120783,"title":"The seepage exclusion problem for sloping cylindrical cavities.","authors":[],"date":"1989","doi":"10.1029\/wr025i006p01447","raw":"Philip, J.R., 1989a. The seepage exclusion problem for sloping cylindrical cavities.","cites":null},{"id":38120780,"title":"The seepage exclusion problem for spherical cavities.","authors":[],"date":"1989","doi":"10.1029\/wr025i001p00029","raw":"Knight, J.H., Philip, J.R., and Waechter, R.T., 1989. The seepage exclusion problem for spherical cavities. Water Resour. Res. 25, 29-37.","cites":null},{"id":38120793,"title":"The seepage exclusion problem for tunnel cavities in the saturated capillary fringe.In ”Environmental mechanics:","authors":[],"date":"2002","doi":"10.1029\/129gm07","raw":"Youngs, E.G., 2002. The seepage exclusion problem for tunnel cavities in the saturated capillary fringe.In ”Environmental mechanics: Water, Mass and Energy Transfer in the Biosphere”. Geophysical Monograph 129, 71-78, American Geophysical Union.","cites":null},{"id":38120788,"title":"Theory of Ground-water Movement.","authors":[],"date":"1977","doi":"10.1137\/1005089","raw":"Polubarinova-Kochina, P.Ya., 1977. Theory of Ground-water Movement. Nauka, Moscow (in Russian).","cites":null},{"id":38120786,"title":"Unsaturated seepage and subterranean holes: conspectus, and exclusion problem for circular cylindrical cavities.","authors":[],"date":"1989","doi":"10.1029\/wr025i001p00016","raw":"Philip, J.R., Knight, J.H., Waechter, R.T., 1989a. Unsaturated seepage and subterranean holes: conspectus, and exclusion problem for circular cylindrical cavities. Water Resour. Res. 25, 16-28.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-03","abstract":"The problem of water flow around a tunnel cavity located in the saturated\ncapillary fringe on top of a very permeable, freely-draining substratum is considered for\nthe critical non-leakage condition when there is uniform vertical downward flow through\nthe upper surface of the saturated region. In this critical condition the soil-water pressure\nis equal to zero everywhere on the cavity wall that is also a streamline. The conditions\nat the upper fringe boundary are that the soil-water pressure is equal to the air-entry\nvalue of the soil and the flux through this surface is the uniform infiltration rate. The\ncavity surface and the fringe boundary which is elevated above the cavity position,\nare found through conformal mapping and the use of integral representations of nonstandard\nmixed boundary-value problems. They are calculated for a range of infiltration\nrates and compared with those obtained by assuming the upper fringe boundary to be\nhorizontal. The exact analysis given here gives larger tunnel cavities than those given by\nthe approximate treatment of the problem. The results have application in the design of\nunderground repositories against entry of seepage water, the construction of protective\ncapillary barriers and in the design of interceptor drainage systems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/137828.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/908","pdfHashValue":"9b6b01860bd7d83aff4c5ea5b8fbdd903d381726","publisher":"Elsevier Science","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/908<\/identifier><datestamp>2010-04-22T09:08:23Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Water exclusion from tunnel cavities in the saturated capillary fringe<\/dc:title><dc:creator>Youngs, E. G.<\/dc:creator><dc:creator>Kacimov, A. R.<\/dc:creator><dc:creator>Obnosov, Yu. V.<\/dc:creator><dc:subject>Mixed boundary value problems<\/dc:subject><dc:description>The problem of water flow around a tunnel cavity located in the saturated\ncapillary fringe on top of a very permeable, freely-draining substratum is considered for\nthe critical non-leakage condition when there is uniform vertical downward flow through\nthe upper surface of the saturated region. In this critical condition the soil-water pressure\nis equal to zero everywhere on the cavity wall that is also a streamline. The conditions\nat the upper fringe boundary are that the soil-water pressure is equal to the air-entry\nvalue of the soil and the flux through this surface is the uniform infiltration rate. The\ncavity surface and the fringe boundary which is elevated above the cavity position,\nare found through conformal mapping and the use of integral representations of nonstandard\nmixed boundary-value problems. They are calculated for a range of infiltration\nrates and compared with those obtained by assuming the upper fringe boundary to be\nhorizontal. The exact analysis given here gives larger tunnel cavities than those given by\nthe approximate treatment of the problem. The results have application in the design of\nunderground repositories against entry of seepage water, the construction of protective\ncapillary barriers and in the design of interceptor drainage systems.<\/dc:description><dc:publisher>Elsevier Science<\/dc:publisher><dc:date>2005-11-23T13:03:32Z<\/dc:date><dc:date>2005-11-23T13:03:32Z<\/dc:date><dc:date>2004-03<\/dc:date><dc:type>Article<\/dc:type><dc:format>1946 bytes<\/dc:format><dc:format>116876 bytes<\/dc:format><dc:format>126047 bytes<\/dc:format><dc:format>text\/plain<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>E. G. Youngs , A. R. Kacimov and Yu. V. Obnosov, Water exclusion from tunnel cavities in the saturated capillary fringe, Advances in Water Resources, Volume 27, Issue 3, March 2004, Pages 237-243<\/dc:identifier><dc:identifier>0309-1708<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/908<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.advwatres.2004.01.004<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0309-1708","0309-1708"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Mixed boundary value problems"],"subject":["Article"],"fullText":"Water exclusion from tunnel cavities in the\nsaturated capillary fringe\nYoungs, E.G., Kacimov A.R., Obnosov Yu.V.\nShort title for running head: WATER EXCLUSION FROM TUNNEL CAVITIES\nSubmitted to Advances in Water Resources\nAddress for correspondence: Professor E.G.Youngs, Institute of Water and Environ-\nment, Cranfield University, Silsoe, Bedford MK45 4DT, England.\nWater exclusion from tunnel cavities in the\nsaturated capillary fringe\nE.G.Youngs, 1, A.R.Kacimov 2, and Yu.V.Obnosov 3\n1 Institute of Water and Environment, Cranfield University, Silsoe, Bedfordshire\nMK45 4DT, England\n2 Department of Soil and Water Sciences, P.O. Box 34, Al-Khod 123, Sultan Qaboos\nUniversity, Sultanate of Oman\n3 Institute of Mathematics and Mechanics, Kazan University, University Str., 17,\nKazan, 420008, Russia\nAbstract The problem of water flow around a tunnel cavity located in the saturated\ncapillary fringe on top of a very permeable, freely-draining substratum is considered for\nthe critical non-leakage condition when there is uniform vertical downward flow through\nthe upper surface of the saturated region. In this critical condition the soil-water pressure\nis equal to zero everywhere on the cavity wall that is also a streamline. The conditions\nat the upper fringe boundary are that the soil-water pressure is equal to the air-entry\nvalue of the soil and the flux through this surface is the uniform infiltration rate. The\ncavity surface and the fringe boundary which is elevated above the cavity position,\nare found through conformal mapping and the use of integral representations of non-\nstandard mixed boundary-value problems. They are calculated for a range of infiltration\nrates and compared with those obtained by assuming the upper fringe boundary to be\nhorizontal. The exact analysis given here gives larger tunnel cavities than those given by\nthe approximate treatment of the problem. The results have application in the design of\nunderground repositories against entry of seepage water, the construction of protective\ncapillary barriers and in the design of interceptor drainage systems.\nKeywords : Tunnel cavity; Water exclusion; Capillary fringe; Conformal mapping;\nMixed boundary value problems\n1. Introduction\nThe analysis of water flow around cavities in unsaturated soils shows the effect on\nsoil-water behaviour resulting from man-made excavations. It also facilitates the under-\nstanding of the role of macropores in unsaturated flow. Philip et al. (1989a) initiated\nanalytical studies of the perturbation of vertical unsaturated soil-water flow due to the\npresence of cavities, using the so-called quasi-linear model that assumes an exponential\ndependence of hydraulic conductivity on soil-water pressure, in an investigation of the\nflow around circular cylindrical cavities. These were developed further in a series of\npapers (Philip, 1989a, b; 1990; Philip et al., 1989a, b; Knight et al., 1989) concerned\n1E-mail: e.g.youngs@cranfield.ac.uk\n2E-mail: anvar@squ.edu.om\n3E-mail: Yurii.Obnosov@ksu.ru\n1\nwith the soil-water behaviour in the presence of two- and three- dimensional cavities of\nvarious shapes.\nWater will flow into a cavity when the soil-water pressure at any point on its wall\nbecomes greater than atmospheric. Philip’s analysis elucidated conditions under which\nan air-filled cavity (that has the same effect when not leaking water as an impermeable\nstone) excludes descending seepage water (the subcritical regime) or admits water (the\nsupercritical regime). In the critical regime some part of the cavity boundary is just\nless than atmospheric pressure so that any further increase leads to water seeping into\nthe cavity. There is a critical cavity shape where the soil-water pressure everywhere\non the cavity wall is atmospheric and the cavity wall is also a streamline. For an\ninfinite flow field and a soil having an exponential hydraulic conductivity function as\nassumed in Philip’s analysis, the cavity shape is parabolic-cylindrical for two dimensional\ntunnel cavities and paraboloidal for three-dimensional cavities (Philip et al., 1989b). The\nanalysis has been further developed by Fujii and Kacimov (1998) and Kacimov (2000).\nA different physical situation occurs when cavities are located in a saturated capillary\nfringe above a water table when there is infiltration from the unsaturated soil above,\nseeping downwards to a water table. Youngs (2002) calculated the critical shape of\ntunnel cavities for water exclusion in this situation. His analysis notes that the hydraulic\nconductivity in this tension-saturated region is the same as that of the saturated soil\nunder positive pressure and that the saturated region is bounded at its upper surface\nby the locus of points where the soil-water pressure is equal to the air-entry value of\nthe soil, as used in many problems discussed by Polubarinova-Kochina (1977). Youngs’\ncritical shape approximated to the parabolic form found by Philip et al. (1989b) for\nan exponential dependent hydraulic conductivity function that does not give a tension-\nsaturated capillary fringe above a water table.\nSince the hydraulic conductivity is uniform throughout the tension-saturated flow\nregion, the flow pattern in this region is obtained by solving Laplace’s equation so that in\nthe case of two-dimensional flows conformal mapping techniques can be used. This was\nused by Kacimov and Nicolaev (1992) in their investigations on subcritical flows around\nimpermeable holes and was also used by Youngs (2002). However, Youngs’ solution\nwas an approximation to the real situation for uniform precipitation in that his upper\nboundary was assumed horizontal, equivalent to assuming some variable accretion over\nthe upper surface. When there is uniform accretion, the upper fringe surface is elevated\nin the vicinity above the cavity and its shape is part of the mathematical solution. We\nnote further that the fringe height and hence the extent of the tension-saturated region\nincrease with the precipitation rate. In this paper a solution is given for this situation,\nusing conformal mapping and boundary-value problem theory techniques to obtain both\nthe critical tunnel shape and the fringe boundary. In particular, we calculate the width\nand height of the tunnel as functions of the infiltration intensity and the air-entry\npressure.\n2. Analytical Solution\nWe consider a homogeneous, isotropic soil, which is underlain by a horizontal highly\npermeable layer into which all percolated water drains and above which is located a\n2\ntunnel cavity D1CD2, as illustrated in Fig.1. The origin of coordinates (x, y) is at point\nO in the centre of the tunnel. Along E1D1 and E2D2 at the base of the soil region next\nto the highly permeable layer the soil-water pressure is atmospheric so that the pressure\nhead p is zero and hence the hydraulic head h = 0. The tunnelD1CD2 protrudes into the\ncapillary fringe. The upper surface of the fringe A1BA2 is a surface of constant pressure\nhead where p = P (P negative). Additionally, along A1BA2 water enters uniformly from\nthe unsaturated zone above the fringe with a constant rate q = q′k where 0 < q′ < 1\nand k is the hydraulic conductivity of the saturated soil, so that each segment of the\nfringe boundary receives an amount of water proportional to the horizontal projection\nof the segment. We assume that the soil-water pressure on the walls of the tunnel is\nmaintained at a negligibly small negative pressure −\u000f relative to atmospheric pressure\nso that no water leaks into the tunnel. We also assume that the shape of the tunnel\nis critical for the particular value of q so that the streamline along BC bifurcates at C\nand CD1 and CD2 are streamlines.\nWe introduce a complex position coordinate z = x + i y and designate the flow\ndomain as Gz. We also introduce the complex potential w = φ + iψ where φ = −kh\nis the seepage velocity potential and ψ the stream function. The specific discharge is\n~V = ∇φ. The Zhukovskii function θ = w − ikz = φ+ ky + i(ψ − kx) = θ1 + iθ2.\nThe boundary conditions in our problem are\nφ = 0, along E1D1 and E2D2\nφ = −ky, ψ = 0 along D1CD2\nφ = −kP − ky, ψ = qx along A1BA2\n(1)\nIn the w-plane the image of Gz is a strip Gw but with a cut D1CD2 and a curved\nunknown boundary A1A2, which is shown schematically in Fig.2a. In the θ-plane the\nimage of Gz is a strip Gθ (Fig.2b).\nWe map conformally Gθ onto the upper half-plane of an auxiliary plane ζ = ξ + iη\n(Fig.2c) by the function:\nθ =\ni kP\npi\nlog\na+ ζ\na− ζ (2)\nwhere the branch of the logarithm for −a < ζ < a is fixed in the upper half-plane. In\n(2) the parameter a is determined from the given maximum horizontal width xm of the\ntunnel (point D1) as\nxm\n|P | =\n1\npi\nlog\na+ 1\na− 1 (3)\nIn order to solve the flow problem we have to find the second characteristic analytic\nfunction. Youngs (2002) evaluated this function by conformal mapping of Gw onto\nGθ that is impossible in our case because A1BA2 in Fig.2a is unknown. Riezenkampf\n(see Polubarinova-Kochina, 1977, p.138-145) and Strack (1989, p.555) introduced an\nauxiliary function in which the real part is constant along the flow domain boundary.\nIn our case this function does not possess this property along D1CD2 and hence will\nnot help. Another option is to use the hodograph ~V . The hodograph domain GV is\nshown in Fig.2d where the cut E1A1M1BM2A2E2 is along the circumference of a radius\nk but shifted a distance −q along the v axis, and points M1 and M2 correspond to\n3\nthe inflexion points on the fringe boundary. As we can see from Fig.2d the hodograph\nplane is a circular sextagon. It would be a formidable task to map this sextagon onto ζ\neven by the Polubarinova-Kochina method of linear differential equations (Polubarinova-\nKochina, 1977, p.240-290) as we did in another problem concerning the design of drains\nand soil channels (Kacimov and Obnosov, 2002).\nInstead of conformal mapping of the second domain as in the hodograph method, we\nuse a different (simpler, as we believe) method based on the theory of boundary-value\nproblems (Gakhov, 1977, p.472-474) employed recently in other free-boundary problems\nin subsurface mechanics (Ilyinsky and Kacimov, 1992). Thus, we formulate the so-called\nmixed boundary value problem for an analytic function w∗(ζ) = iw = −ψ + iφ. This\nsatisfies the following boundary conditions along the real axis L of our auxiliary variable\nφ = 0 , − a < ξ < −1 and 1 < ξ < a,\nψ = 0 , − 1 < ξ < −1; ψ = g(ξ) , |ξ| > a (4)\nThe function g(ξ) in (4) is found from the following arguments. According to (2) at\n|ξ| > a\nψ − kx = −k|P |\npi\nlog\n∣∣∣∣∣a+ ξa− ξ\n∣∣∣∣∣ (5)\nOn the other hand, from the uniform infiltration condition x = ψ\/q. We substitute this\nexpression into (5) that yields along the fringe boundary\ng(ξ) =\nk|P |q′\n(1− q′)pi log\n∣∣∣∣∣a+ ξa− ξ\n∣∣∣∣∣ (6)\nAs (4) shows, at the transition points ±a,±1 the boundary condition type changes from\nRe w∗ to Im w∗; that is, we arrive at a mixed boundary value problem.\nThe simplest boundary-value problem for an analytic function w∗(ζ) is the Schwartz\none: given the real part φ(τ) of w (τ is an arc coordinate of L) along the boundary L\nof the domain D in which the solution is sought, to determine w in the whole domain.\nWhen D is the upper half plane, the solution to this Schwartz problem is given by a\nsingular (Cauchy-type) integral (Polubarinova-Kochina,1977, p. 202-211). A mathemat-\nically similar solution for a harmonic function in a unit circle is given by the so-called\nPoisson formula (Nehari, 1975, p.17). In mixed boundary-value problems the contour L\nis divided into segments along which either the real or the imaginary part of w is spec-\nified. The boundary functions and hence the whole function w may exhibit different\nproperties when they approach these transition points, and w may be finite or infinite.\nVolterra (1883) pioneered the solution of a mixed problem with two transition points\nin a half-plane, so that L in his problem was divided into three segments with Re(w)\nprescribed along one segment and Im(w) along the other two. Signorini (1916) derived\na formula for w∗(ζ) with an arbitrary number of points where ψ(ξ) condition changes\nto φ(ξ). Volterra and Signorini posited that w∗(ζ) is finite at all these points. In our\nproblem, w∗(ζ) → ∞ as ζ → ±a. Obnosov (1981) generalized the Signorini formula\nto the case when w∗(ζ) has integrable singularities at arbitrary transition points. This\nis the most general class including all known solutions to the mixed boundary problem\nfound by Volterra, Signorini, Keldysh and Sedov (1937) (see Gakhov, 1977, p.472-474).\n4\nAll approaches to solve the mixed problem are based on the reduction of this problem\nto the Schwartz problem (factually, to the Cauchy integral formula, see Nehari, 1975,\np.94) by a proper choice of extra multipliers (R0 and R\n+\n0 in (7) below) that must also\nguarantee that the function searched belongs to the class predetermined. (Detailed\nexplanations are given in Polubarinova-Kochina (1977, p.208-209)).\nThus, from (4) the analytic function w∗ in the upper half-plane is represented by\n(Obnosov, 1981)\nw∗(ζ) =\nR0(ζ)\npii\n∫\nM\n−g(τ, a)dτ\n(τ − ζ)R+0 (τ)\n+ i c0R0(ζ) (7)\nwhere M = (−∞,−a) ∪ (a,∞), c0 is a real constant to be determined later and the\nfunction R0(ζ) is given by\nR0(ζ) =\n√\nζ2 − 1\nζ2 − a2 (8)\nand R+0 (τ) is the limit value of the chosen branch on the real axis, selected so that it is\npositive in the half-plane ζ > 0 at ζ = ξ > a; . From this branch fixation we can conclude\nthat R+0 (τ) > 0 if |τ | > a and |τ | < 1, and Im[sign(τ)R+0 (τ)] < 0, Re[R+0 (τ)] = 0 if\n1 < |τ | < a. We evaluate the limit value of the integral (7) if ζ → ξ, |ξ| > |a| via the\nSokhotskij-Plemel formula (Henrichi, 1986, page 100). Recall that this formula gives the\nlimit of the Cauchy type integrals in (7) when ζ → ξ. In other words, when approaching\nL the Cauchy type integrals (Nehari, 1975) call for special treatment. We note that the\nprincipal value of the integral should be taken (Gakhov, 1977) so that a singularity at\nτ = ζ is isolated.\nA parametric equation for the shape of the tunnel wall follows from (7) at ζ → ξ,\n−1 < ξ < 1 as\nx(ξ) = −θ2(ξ)\/k = |P |\npi\nlog\n∣∣∣∣∣a+ ξa− ξ\n∣∣∣∣∣\ny(ξ) = −φ\/k = −\n√\n1− ξ2\na2 − ξ2\n 1\npi\n∫\nM\n√\nτ 2 − a2\nτ 2 − 1\ng(τ, a)\/kdτ\nτ − ξ + c0\n (9)\nand that for the fringe at ζ → ξ ∈M , (i.e., |ξ| > a) as\nx(ξ) = ψ(ξ)\/q =\n|P |\npi(1− q) log\n∣∣∣∣∣a+ ξa− ξ\n∣∣∣∣∣\ny(ξ) = |P | − φ\/k = |P | −\n√\n1− ξ2\na2 − ξ2\n 1\npi\n∫\nM\n√\nτ 2 − a2\nτ 2 − 1\ng(τ, a)\/kdτ\nτ − ξ + c0\n (10)\nIn the limit ξ → +a where x→ +∞ we have\ny(a) = H = |P |\/(1− q′) (11)\nAt ξ → a the limit value φ(a) must be finite and hence\nc0 = − 1\npi\n∫\nM\n√\nτ 2 − a2\nτ 2 − 1\ng(τ, a)\/kdτ\nτ − a\n5\nThus, in (10)\ny(ξ) = |P | −\n√\n(ξ2 − 1)(ξ − a)\nξ + a\n1\npi\n∫\nM\n√\nτ + a\n(τ 2 − 1)(τ − a)\ng(τ, a)\/kdτ\nτ − ξ (12)\n3. Computed Tunnel Shapes\nFigure 3 shows the computed critical tunnel shape and fringe surface for xm\/|P | = 0.5\nwhen q′ = 0.75, 0.5 and 0.25, obtained from (9) for the tunnel and from (10), after\nsome algebraic manipulation of (12) to avoid computational difficulties, for the fringe\n(see Appendix). They were found by fixing the hydrological parameters q and P and\nspecifying the tunnel half-width xm = xD1 . The height of the tunnel and the height of\nthe capillary fringe both increase as the accretion rate q increases.\nIn the approximate analysis of Youngs (2002) A1BA2 was assumed horizontal at an\nelevation H above E1E2, which requires a non-uniform distribution of infiltration across\nthe fringe, the distribution of which was found a posteriori in the solution with q′ a\nminimum above the apex of the tunnel. His tunnel cavity is described by\ny\n|P | =\n1\npi\n(1− H|P |) arccos\n(\n(1 + tL) cosh pix\/|P |+ tL − 1\n2\n)\n(13)\nwhere\ntL =\n3− cosh pixm\/|P |\n1 + coshpixm\/|P |\nThe tunnel cavity shapes given by (13) are compared with those given by (9) for\nxm\/|P | = 0.5 for q′ = 0.75, 0.5 and 0.25 in Fig.3, assuming H to be the fringe height at\nx→ +∞ given by H = |P |\/(1− q′). It is seen that (13) gives a slightly smaller cavity\nthan that given by the present analysis because of the different boundary conditions at\nthe top of the fringe used in the two cases.\nFigure 4 shows the critical tunnel shapes for q′ = 0.75, 0.5 and 0.25 when the tunnel\nheight is fixed at L\/|P | = 1.0. Note that by fixing L calls for a different procedure\nin computing the shapes than that used when xm is fixed. In the latter a was found\nfrom (3) and then used in (9) and (10). When L is fixed, a was obtained by solving the\nsecond of the equations in (9) at ξ = 0 when y(0) = 0. It is seen that as q′ increases the\ntunnel becomes narrower and the fringe surface becomes higher and flatter. Figure 5\nshows the effect on the tunnel shape for different tunnel heights for the same accretion\nrate. The tunnel size increases overall while the fringe boundary rises in the vicinity\nabove it, becoming more humped.\nIn Fig.6 the tunnel height L\/|P | calculated from (9)is plotted against xm\/|P | for\nq′ = 0.75, 0.5 and 0.25. Also shown in Fig.6 is the relationship given by Youngs’ (2002)\napproximate analysis. Figure 7 shows the calculated fringe height above the tunnel\ny0\/|P | at x = 0 for the same values of q′.\nYoungs (2002) suggested the approximate relationship\nxm\nL\n=\n1− q′\nq′\n(14)\n6\nto describe the width to height ratio of the tunnel cavity with the infiltration rate. This\nis shown in Fig.8 in which results from the present analysis are compared. It is seen\nthat (14) gives a good fit to the computed results, especially at large values of q′ for\nwhich it was suggested.\n4. Discussion\nThe analysis given here leads to the shape of tunnel cavities in the critical condition for\nwater exclusion when they are located in the saturated capillary fringe on top of a freely\ndraining very permeable stratum and there is uniform flow across the fringe boundary. It\nuses conformal mapping and integral representations of non-standard mixed boundary-\nvalue problems to find a solution for conditions presented at the fringe boundary, namely,\nfor the mixed boundary condition of a surface at constant soil-water pressure head and\nof uniform flux. The shapes of the cavity and the fringe surface, that is elevated in the\nvicinity above the cavity, are found in the solution for a given ratio of infiltration rate to\nsoil hydraulic conductivity. The cavity sizes obtained in the analysis differ only slightly\nfrom those given by Youngs’ (2002) approximate analysis in which the fringe surface is\nassumed to be horizontal. An interesting extension of Youngs’ (2002) analysis shows\nthat under certain conditions a cavity can span a water table and yet remain dry.\nThe situation considered is the exclusion of water from tunnel cavities of critical\nshape where the tunnel wall is a streamline. A wider tunnel of the same height with\nthe given flow rate would leak water while a narrower one might, but not necessarily,\ncontinue to exclude water seepage. When there is water entry, the boundary conditions\non the tunnel walls are mixed with a seepage surface that is unknown a priori and is\npart of the solution. The problem is thus mathematically more difficult. Knight et al.\n(1989) and Philip et al. (1989a, b) show that the flow pattern is governed primarily\nby the apical curvature of a cavity. A blunter apex than that for the critical situation\nwould leak water whereas a sharper one would divert the streamline from the stagnation\npoint at the apex away from the tunnel wall.\nThe engineering applications of this study are in the design of underground repos-\nitories, including the construction of protective capillary barriers and in the design of\ninterceptor drainage systems. It might also give an insight into the emergence and\ngrowth of stalactites in caves as well as providing a basic understanding of the role of\nmacropores in soil-water flow. The work is an example of the use of analytical tools to\nprovide solutions to practical problems.\nAcknowledgments. This study was supported by Sultan Qaboos University,\nproject IG\/AGR\/SOIL\/02\/04, by the Russian Foundation of Basic Research, grant\nN01-01-00888 and through the grant N 09-12\/2000(F) of the Tatarstan Academy of\nSciences.\nReferences\nFujii, N., Kacimov, A.R., 1998. Analytic formulae for rate of seepage flow into drains\nand cavities. International J. for Numerical and Analytical Methods in Geomechanics\n22, 277-301.\n7\nGakhov, F.D., 1977. Boundary Value Problems. Moscow, Nauka (in Russian).\n(English translation, Addison Wesley, New York,1966).\nHenrichi, P., 1986. Applied and Computational Complex Analyis. Volume 3. John\nWiley, New York.\nIlyinsky, N.B., Kacimov, A.R., 1992. Problems of seepage to empty ditch and drain.\nWater Resour. Res. 28, 871-876.\nKacimov, A.R., 2000. Circular isobaric cavity in descending unsaturated flow. J.\nIrrigation and Drainage, ASCE 126, 172-178.\nKacimov, A.R., Nicolaev, A.N., 1992. Steady seepage near an impermeable obstacle.\nJ. Hydrology 138, 17-40.\nKacimov, A.R., Obnosov Yu.V., 2002. Analytical determination of seeping soil slopes\nof a constant exit gradient. Zeitschrift fur angewandte Mathematik und Mechanik, 82,\nN6, 363-376.\nKnight, J.H., Philip, J.R., and Waechter, R.T., 1989. The seepage exclusion problem\nfor spherical cavities. Water Resour. Res. 25, 29-37.\nNehari, Z., 1975. Conformal Mapping. Dover, New York.\nObnosov, Yu.V., 1981. Solution of a mixed boundary-value problem in the theory\nof analytic functions. Izv. VUZ. Mat. (Soviet Mathematics) No 10, 75-79.\nPhilip, J.R., 1989a. The seepage exclusion problem for sloping cylindrical cavities.\nWater Resour. Res. 25, 1447-1448.\nPhilip, J.R., 1989b. Asymptotic solutions of the seepage exclusion problem for\nelliptic-cylindrical, spheroidal, and strip- and disc-shaped cavities. Water Resour. Res.\n25, 1531-1540.\nPhilip, J.R., 1990. Some general results on the seepage exclusion problem. Water\nResour. Res. 26, 369-377.\nPhilip, J.R., Knight, J.H., Waechter, R.T., 1989a. Unsaturated seepage and subter-\nranean holes: conspectus, and exclusion problem for circular cylindrical cavities. Water\nResour. Res. 25, 16-28.\nPhilip, J.R., Knight, J.H., Waechter, R.T., 1989b. The seepage exclusion problem\nfor parabolic and paraboloidal cavities. Water Resour. Res. 25, 16-28.\nPolubarinova-Kochina, P.Ya., 1977. Theory of Ground-water Movement. Nauka,\nMoscow (in Russian).\nSignorini, 1916. Sopra on problema al contoro nella teoria della funzioni di variabile\ncomplessa. Ann. mat. 24, Ser.3, 253-273.\nStrack, O.D.L., 1989. Groundwater Mechanics. Prentice Hall, Englewood Cliffs.\nVolterra, V. 1883. Sopra alcune condizioni caratterstiche per le funzioni di variablie\ncomplessa. Ann. math. 11, Ser. 2, 1-55.\nWolfram, S., 1991. Mathematica. A System for Doing Mathematics by Computer.\nAddison-Wesley, Redwood City.\nYoungs, E.G., 2002. The seepage exclusion problem for tunnel cavities in the satu-\nrated capillary fringe.In ”Environmental mechanics: Water, Mass and Energy Transfer\nin the Biosphere”. Geophysical Monograph 129, 71-78, American Geophysical Union.\nAppendix\n8\nIn order to compute values of y(ξ) from eq.(12) we make the transformations τ = a\/s\nand t = a\/ξ, to produce\ny(a\/t)\n|P | = 1−\nq′\npi2\n√\n(1− t)(a2 − t2)\n(1− q′)√1 + t\n∫ 1\n−1\n√\n1 + s\n(a2 − s2)(1− s) log\n(\n1 + s\n1− s\n)\nds\nt− s, −1 < t < 1\n(A1)\nBecause of symmetry, y(−a\/t) ≡ y(a\/t), and after algebraic manipulation eq.(A1) re-\nsults in\ny(a\/t)\n|P | = 1 +\nq′\npi2\n√\n(a2 − t2)(1− t2)\n(1− q′)\n∫ 1\n−1\nlog[(1 + s)\/(1− s)]√\n(a2 − s2)(1− s2)\nds\ns− t , 0 < t < 1 (A2)\nfor the right hand branch of the fringe boundary.\nThe integral in (A2) has three singularities. At s = ±1 it has regular singularities so\nthat we deal with common improper integrals. The singularity at s = t is more subtle.\nAt these internal points the improper integral does not exist in the common sense and\nwe take the principal value of the integral (Polubarinova-Kochina, 1977,p. 204). Thus,\nwe isolate the singular points and write∫ 1\n−1\n= I1 + I2 + I3 + I4 (A3)\nin which\nI1 =\n∫ −1+\u000f1\n−1\n, I2 =\n∫ t−\u000f2\n−1+\u000f1\n, I3 =\n∫ 1−\u000f1\nt+\u000f2\n, I4 =\n∫ 1\n1−\u000f1\n(A4)\nwhere \u000f1 \u000f2 are small constants. Integrals I2 and I3 in (A4) are found numerically\nby computer algebra routines (Wolfram, 1991). Integrals I1 and I3 can be evaluated\nasymptotically. Thus\nI4 \u0010 1√\n2(a2 − 1)(1− t)\n∫ 1\n1−\u000f1\nlog 2− log(1− s)√\n1− s ds (A5)\nor upon integration\nI4 \u0010 2\n√\n\u000f1[2 + log 2− log \u000f1]√\n2(a2 − 1)(1− t)\n(A6)\nThus, for the two end singularities we get\nI1 + I4 \u0010\n√\n2\u000f1√\n(a2 − 1)\n(\n2 + log 2− log \u000f1\n1− t +\nlog 2− 2 + log \u000f1\n1 + t\n)\n(A7)\nThe desingularised integrals are put into (A2) and values of y(a\/t)\/|P | computed.\nPractical computations showed that sufficiently small values of \u000f1 and \u000f2 were required\nin order for the fringe height to converge to the known value of y = |P |\/(1 − q′) as\nx→ +∞.\n9\nFigure Captions\nFig.1 Uniform precipitation flowing around a critical tunnel cavity located in the sat-\nurated capillary fringe on a water-bearing stratum at atmospheric pressure: the physical\ndomain Gz.\nFig.2. Flow in the capillary fringe: (a) the complex potential domain Gw; (b) the\nZhukovskii function domain Gθ; (c) the auxiliary half-plane ζ = ξ + iη; and (d) the\nhodograph domain GV .\nFig.3. The critical tunnel cavity and fringe surface calculated for xm\/|P | = 0.5 and\nfor q′ = 0.25, 0.5 and 0.75: the line of the cavity is eq.(9) and the dotted line is eq.(13).\nFig.4. The critical tunnel cavity and fringe surface calculated for q′ = 0.5 and\nL\/|P | = 0.5, 1.0 and 2.0.\nFig.5. The critical tunnel cavity and fringe surface calculated for L\/|P | = 1.0 and\nfor q′ = 0.25, 0.5 and 0.75.\nFig.6. The tunnel height L\/|P | plotted as a function of tunnel width xm\/|P | for\nq′ = 0.25, 0.5 and 0.75: the lines are the relationships given by eq.(9) for x = 0, the\ndotted lines are those given by eq.(13).\nFig.7. The fringe height y0\/|P | above the tunnel plotted as a function of tunnel\nwidth xm\/|P | for q′ = 0.25, 0.5 and 0.75, given by eq.(10) for x = 0.\nFig.8. The width-height ratio xm\/L of critical tunnel cavities plotted as a function\nof q′, the precipitation rate q expressed as a fraction of the hydraulic conductivity k:\nthe line is eq.(14); symbols are values calculated from eq.(9), circles xm\/|P | = 0.25,\ntriangles xm\/|P | = 0.5 and squares xm\/|P | = 1.0.\nFig.9. Water exclusion from a tunnel cavity spanning a water table maintained by\nartesian pressure in a lower very permeable substratum.\n10\nBC\nD1\nh = 0\nh = y + P\nE1\nsaturated soil\ntunnel cavity\nq\nh = y\nA1\nD2E2\ny\nx\nfringe\nO\nGz\nA2\n(a) (b) (d)\nA1 E1 E2 A2\nB\nE1E2\nC\nD2 D1\nM2 M1\nu\nGV\n-iq\n-ik\nv\nGω\nC B\nD2\nD1\nGθ\nφ\nψ\n1\nD2\nθ2\nθ1\nC D\nB\nA2 E2 E1 A1\n(c)\nζ = ξ + iη\nB B\nη\nξA2,E2 D2 C D1 E1 ,A1\n-a -1 1 a\n01\n2\n3\n4\n0 1 2 3 4 5 6\nx\/(P|\ny\/|P|\nq’ = 0.75\n0.5\n0.25\nq’ = 0.75\n0.5\n0.25tunnel\nfringe surface\n01\n2\n3\n4\n0 1 2 3 4 5 6\nx\/|P|\ny\/|P|\nfringe surface\nL\/|P| = 2.0\n1.0\n0.5\ntunnel L\/|P| = 2.0\n1.0\n0.5\n01\n2\n3\n4\n0 1 2 3 4 5 6\nx\/|P|\ny\/|P|\nq’ = 0.75\n0.5\n0.25\nq’ = 0.75\n0.5\n0.25\ntunnel\nfringe surface\n0.0\n2.0\n4.0\n0 0.5 1xm\/|P|\nL\/|P|\nq' = 0.75\n0.5\n0.25\n02\n4\n6\n0 0.5 1xm\/|P|\ny0\/|P|\nq' = 0.75\n0.5\n0.25\n02\n4\n6\n8\n10\n0 0.2 0.4 0.6 0.8 1\nq'\nxm\/L\nh = 0\nh = H + P\nsaturated soil\ntunnel cavity h = y\nfringe\nh = - H + Pa\nH\nH\n"}