{"doi":"10.1038\/ng.831","coreId":"197239","oai":"oai:lra.le.ac.uk:2381\/9476","identifiers":["oai:lra.le.ac.uk:2381\/9476","10.1038\/ng.831"],"title":"The role of a bioresource research impact factor as an incentive to share human bioresources","authors":["Cambon-Thomsen, Anne","Thorisson, Gudmundur A.","Mabile, Laurence"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-05","abstract":"This is the pre-print (i.e. not peer reviewed) of the article published as Nature Genetics, 2011, 43, pp. 503-504. The definitive published version is available on the publisher's webiste at: http:\/\/www.nature.com\/ng\/index.html ; DOI: 10.1038\/ng.83","downloadUrl":"http:\/\/www.nature.com\/ng\/journal\/v43\/n6\/full\/ng.831.html","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9476\/1\/PRE-PRINT%20Cambon-Thomsen%20et%20al%202011%20Role%20of%20BRIF.pdf","pdfHashValue":"80a452b92417abad854da65448570cb33f62446e","publisher":"Nature Publishing Group","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9476<\/identifier><datestamp>\n                2015-10-30T16:55:27Z<\/datestamp><setSpec>\n                com_2381_93<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_95<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe role of a bioresource research impact factor as an incentive to share human bioresources<\/dc:title><dc:creator>\nCambon-Thomsen, Anne<\/dc:creator><dc:creator>\nThorisson, Gudmundur A.<\/dc:creator><dc:creator>\nMabile, Laurence<\/dc:creator><dc:description>\nThis is the pre-print (i.e. not peer reviewed) of the article published as Nature Genetics, 2011, 43, pp. 503-504. The definitive published version is available on the publisher's webiste at: http:\/\/www.nature.com\/ng\/index.html ; DOI: 10.1038\/ng.831<\/dc:description><dc:date>\n2011-06-22T10:23:09Z<\/dc:date><dc:date>\n2011-06-22T10:23:09Z<\/dc:date><dc:date>\n2011-05<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:identifier>\nNature Genetics, 2011, 43, pp. 503-504.<\/dc:identifier><dc:identifier>\n1061-4036 (Print)<\/dc:identifier><dc:identifier>\n1546-1718 (Online)<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9476<\/dc:identifier><dc:identifier>\nhttp:\/\/www.nature.com\/ng\/journal\/v43\/n6\/full\/ng.831.html<\/dc:identifier><dc:identifier>\n10.1038\/ng.831<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nNature Publishing Group<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Journal Article"],"fullText":" 1 \nThe role of a bioresource research impact factor as an incentive to share human bioresources \nAnne Cambon-Thomsen1, 2, Gudmundur A. Thorisson3 and Laurence Mabile1, 2 on behalf of the BRIF workshop \ngroup*. \n  \n1. Inserm, UMR1027, Epidemiology and analyses in Public Health, Toulouse, F-31073, France \n2. Université de Toulouse - Université Paul Sabatier -Toulouse III, UMR 1027, Toulouse, F-31073, France \n3. Department of Genetics, University of Leicester, University Road, LE1 7RH Leicester, United Kingdom \n \n*Participants listed at the end of the correspondence \n \nNumerous health research funding institutions have recently expressed their strong will to promote data sharing1 \n(http:\/\/www.wellcome.ac.uk\/publichealthdata). As underlined in a recent editorial in Nature Medicine, an \noperational approach is needed to achieve this goal2. Bioresources such as biobanks, databases and \nbioinformatics tools are important elements in this landscape. Bioresources need to be easily accessible to \nfacilitate advancement of research. Besides technical and ethical aspects, a major obstacle for sharing them is the \nabsence of recognition of the effort behind establishing and maintaining such resources. The main objective of \nproposing a Bioresource Research Impact Factor (BRIF) is to promote the sharing of bioresources by creating a \nlink between their initiators\/implementers and the impact of scientific research using them3. A BRIF would make \nit possible to trace the quantitative use of a bioresource, the kind of research utilizing it, and the efforts of people \nand institutions that construct it and make it available. \nIn the context of EU projects, a BRIF working group has been set up, including so far 97 participants \n(http:\/\/www.gen2phen.org\/groups\/brif-bio-resource-impact-factor). The work involves several steps: creating a \nunique identifier, standardizing bioresource acknowledgement in papers, cataloging bioresource data access and \nsharing policies, identifying other parameters to take into account and prototype testing with the help of \nvolunteer bioresources and journal editors. \n \nThe first BRIF workshop was held in Toulouse, France (17-18 January 2011), gathering 34 people from 10 \ncountries, representing various domains: biobanks, genome databases, epidemiological longitudinal cohorts, \nbioinformatics, scientific publishing, bibliometry, health law and bioethics \n(http:\/\/precedings.nature.com\/collections\/brif-workshop-january-2011). The lack of objective measures of use of \nbioresources was recognized by all; we focused on shared aims, but underlined that each community had specific \naspects to consider and resolve. \n \nMain avenues explored and further steps \nBioresources need to be identified by a unique digital identifier (ID), ideally via existing mechanisms4. Digital \nObject Identifiers (DOIs) may be interesting (http:\/\/www.doi.org). Several issues must be considered, including: \nwhat to identify (biobank, collection, database, dataset, subset and version); identifier requirements (persistent \nover time, globally-unique, citable); and which international and independent body should be responsible for \nassigning bioresource IDs. Working subgroups were created to address those questions. Attribution of credit to \nscientists for different kinds of work (in addition to publications) using researcher IDs was also discussed. The \nORCID initiative (http:\/\/www.orcid.org) is building a new contributor ID framework which should in principle \nenable credit to be given to both bioresources and individuals involved in their creation and maintenance. \nStandardization of citation is necessary, but could be combined with existing referencing standards and \nconventions5, such as: citing marker papers, standardized sentences in Materials & Methods or \nacknowledgements section of papers, co-authorship when justified, and including resource name in paper title. \nSpecific requirements for citing bioresources are lacking in the Uniform Requirements for Manuscripts submitted \nto Biomedical Journals (http:\/\/www.icmje.org\/urm_main.html, version April 2010) and should be added. In \norder to enable automated tracking of bioresource use, the bioresource ID should ideally appear in or under the \nabstract section in order to be visible even without access to the full text of articles. \nBRIF should not be a citation index only. Factors such as time and domain of bioresources need to be considered \nin the calculation process and its weighting. Although the BRIF scope could be extended to measure many \ndifferent aspects of bioresource utilization, including economic implications, it was decided to concentrate first \non use and impact in research settings. \nAccess and sharing policies  have been developed over years6. However, the incentivisation of bioresources to \npromote access needs to be balanced with appropriate provisions compatible with all stakeholder interests, that \nis, proper recognition of scientific contribution and sustainability supported by the capacity of measuring their \nown resource use and impact. There are actually no mechanisms in place to measure this impact. Empowering \nbioresources with tools such as BRIF is, therefore, urgent. \n \nThe full impact of bioresources is wider than BRIF, but unique bioresource identifiers and metrics must be \nestablished as the first operational step. The present proliferation of ideas, statements and proposals around data \n 2 \nsharing from different perspectives and stakeholders1,2,3,7  favors the implementation of tools such as BRIF in \norder to make data sharing principles operational. Workshop participants and members of the working group \nurge concerned stakeholders to join our efforts in developing such an instrument. \n \nAuthors’ Email addresses \nA. Cambon-Thomsen: cambon@cict.fr \nG.A. Thorisson: gt50@leicester.ac.uk \nL. Mabile: mabile@cict.fr \n \nCorresponding author \nDr Anne Cambon-Thomsen, Inserm, UMR1027, Université de Toulouse - Université Paul Sabatier - \nToulouse III, Epidémiologie et analyses en santé publique \nFaculté de médecine. Equipe 4: \"Génomique, biothérapies et santé publique : approche interdisciplinaire\" \n37 allées Jules Guesde F-31073 Toulouse Cedex 7 France \nTel : +33 (0)5 61 14 59 59 \nFax : +33 (0)5 61 14 56 23 \nE-mail : cambon@cict.fr \n \nNamed Collaborators \nThe BRIF workshop group  \nSandrine Andrieu1,2 , Gabrielle Bertier3, Martin Boeckhout4, Anne Cambon-Thomsen1,2, Jane Carpenter5, \nGeorges Dagher6, Raymond, Dalgleish7, Mylène Deschênes8, Jeanne Hélène di Donato9, Mirella Filocamo10, \nMarcel Goldberg11,12, Robert Hewitt13, Paul Hofman14, Francine Kauffmann11,15, Liis Leitsalu16, Irene Lomba17, \nLaurence Mabile1,2, Bela Melegh18, Andres Metspalu16,19,20, Lisa Miranda21, Federica Napolitani22, Mikkel Z. \nOestergaard23, Barbara Parodi24, Markus Pasterk25, Acacia Reiche26, Emmanuelle Rial-Sebbag1,2, Guillaume \nRivalle27, Philippe Rochaix28, Guillaume Susbielle29, Linda Tarasova30, Mogens Thomsen1,2, Gudmundur A. \nThorisson7, Ma'n H. Zawati31, Marie Zins11,12. \n \n1 Inserm, UMR1027, Epidemiology and analyses in Public Health, Toulouse, France \n2 Université de Toulouse - Université Paul Sabatier -Toulouse III, UMR 1027, Toulouse, France \n3 Center for Genomic Regulation, Barcelona, Spain \n4 University of Amsterdam, Department of Philosophy, Amsterdam, The Netherlands \n5 Australian Breast Cancer Tissue Bank, University of Sydney, NSW, Australia \n6 Inserm, Public Health Institute, Paris, France \n7 Department of Genetics, University of Leicester, Leicester, United Kingdom \n8 P3G, Montreal, Quebec, Canada \n9 3C-R, Toulouse, France \n10 Laboratory of Pre-Postnatal Diagnosis and Metabolic Diseases, G. Gaslini Institute, Genova, Italy  \n11 Inserm U1018, Centre for Research in Epidemiology and Population Health, Villejuif, France  \n12 Versailles-Saint Quentin University, UMRS 1018, France \n13 European, Middle Eastern and African Society for Biopreservation and  Biobanking (ESBB), Aix en Provence, France \n14 Laboratory of Clinical and Experimental Pathology & Human Biobank, Pasteur Hospital, University of Nice Sophia, Nice, \nFrance \n15 Epidemiology and Population Health Research Centre, Villejuif, France \n16 Estonian Genome Center, University of Tartu, Tartu, Estonia \n17 HIV HGM Spanish BioBank, Madrid, Spain \n18 Department of Medical Genetics, University of Pécs, Pécs, Hungary \n19 Estonian Genome Center, Institute of Molecular and Cell Biology, University of Tartu, Tartu, Estonia  \n20 Estonian Biocentre, Tartu, Estonia \n21 Biobusiness Consulting, Inc., Massachussetts, USA \n22 Higher Institute of Health Research, Rome, Italy \n23 World Health Organization, Department of Health Statistics & Informatics, Geneva, Switzerland \n24 National institute for Cancer Research, Genoa, Italy \n25 International Prevention Research Institute, Lyon, France \n26 IMIM Foundation, Barcelona, Spain \n27 Thomson Reuters, France \n28 Claudius Régaud Institute, Toulouse, France \n29 Biomed central, UK \n30 Latvian Biomedical Research and Study Center, Latvian Genome Center, Latvia \n31 McGill University, Centre of Genomics and Policy, Montreal, Quebec, Canada \n \n \nCompeting Financial Interests Statement \nNone for the authors; XXX to be completed for the collaborators… \n \nAcknowledgements \n 3 \nThe BRIF workshop was funded by the European Community’s Seventh Framework project “ Biobanking and \nBiomolecular Resources Research Infrastructure” (BBMRI), Grant agreement 212111. The BRIF research also \nreceived funds from FP7 collaborative projects GEN2PHEN (Genotype-to-Phenotype Databases: A Holistic \nSolution), grant agreement 200754, and BioSHaRE-EU (Biobank Standardisation and Harmonisation for \nResearch Excellence in the European Union), grant agreement 261433. \nIn addition to thanking all the BRIF workshop participants for their active contribution, we wish to thank Elena \nBravo, Andres Garcia-Montero, Manuel Morente, Cameron Neylon, Christina Schröeder, Val Tate, Susan \nWallace and Martin Yuille for having provided input in the global debate through the BRIF online forum and for \ndiscussion. \n \nAuthor Contribution \nA. Cambon-Thomsen has been directing the BRIF initiative from the birth of concept. L. Mabile has been \ninvolved in organizing the working group and the workshop and has participated in the writing of this \ncorrespondence. G.A. Thorisson has been very active in commenting and amending this correspondence, and \nproposing references and relevant URLs. The workshop group participants have actively fuelled the whole \ndebate, part of which is reported in the present correspondence. \n \n \nREFERENCES \n \n1.  Walport, M. and Brest, P. Lancet. 377: 2011–2018 (2011). \n2.  Editors. Nat. Med. 17: 137 (2011). \n3.  Cambon-Thomsen, A. Nat. Genet. 34: 25–26 (2003). \n4. Kauffmann, F., and Cambon-Thomsen, A. JAMA. 299: 2316–2318 (2008). \n5.  Peterson, J., and Campbell, J. Nat. Genet. 42: 919 (2010). \n6.  Kaye, J., Heeney, C., Hawkins, N., de Vries, J., and Boddington, P. Nat. Rev. Genet. 10: 331–335 (2009). \n7.  Toronto International Data Release Workshop Authors. Nature. 461:168-170 (2009). \n"}