{"doi":"10.1016\/j.jue.2007.04.006","coreId":"209328","oai":"oai:eprints.lse.ac.uk:20479","identifiers":["oai:eprints.lse.ac.uk:20479","10.1016\/j.jue.2007.04.006"],"title":"Urban density and pupil attainment","authors":["Gibbons, Stephen","Silva, Olmo"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03","abstract":"We explore the association between urban density and pupil attainment using three cohorts of pupils in schooling in England. Although—as widely recognised—attainment in dense urban places is low on average, this is not because urban environments disadvantage pupils, but because the most disadvantaged pupils with low average attainments attend the most urbanised schools. To control for this, we exploit changes in urban density faced by pupils during compulsory transition from Primary to Secondary school, and measure educational progress at the end of the Secondary phase, relative to attainment at the end of Primary schooling. Our results suggest that there are small but significant benefits from education in schools in more densely urbanised settings. We detect this density advantage even amongst pupils moving relatively short distances between Primary and Secondary schools within urban areas, so we cannot attribute it to broad urbanisation effects experienced by pupils making rural–urban school moves. A more likely explanation lies in greater school choice and competition between closely co-located educational providers","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/209328.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/20479\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Gibbons%2C%20S_Urban%20density_Gibbons_Urban%20density_2015.pdf","pdfHashValue":"d0171ad87150840ba1495bb96e981cb5bd097615","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:20479<\/identifier><datestamp>\n      2015-01-20T09:47:38Z<\/datestamp><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3131<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/20479\/<\/dc:relation><dc:title>\n        Urban density and pupil attainment<\/dc:title><dc:creator>\n        Gibbons, Stephen<\/dc:creator><dc:creator>\n        Silva, Olmo<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:subject>\n        L Education (General)<\/dc:subject><dc:description>\n        We explore the association between urban density and pupil attainment using three cohorts of pupils in schooling in England. Although—as widely recognised—attainment in dense urban places is low on average, this is not because urban environments disadvantage pupils, but because the most disadvantaged pupils with low average attainments attend the most urbanised schools. To control for this, we exploit changes in urban density faced by pupils during compulsory transition from Primary to Secondary school, and measure educational progress at the end of the Secondary phase, relative to attainment at the end of Primary schooling. Our results suggest that there are small but significant benefits from education in schools in more densely urbanised settings. We detect this density advantage even amongst pupils moving relatively short distances between Primary and Secondary schools within urban areas, so we cannot attribute it to broad urbanisation effects experienced by pupils making rural–urban school moves. A more likely explanation lies in greater school choice and competition between closely co-located educational providers.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2008-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/20479\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Gibbons%2C%20S_Urban%20density_Gibbons_Urban%20density_2015.pdf<\/dc:identifier><dc:identifier>\n          Gibbons, Stephen and Silva, Olmo  (2008) Urban density and pupil attainment.  Journal of Urban Economics, 63 (2).  pp. 631-650.  ISSN 1095-9068     <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00941190<\/dc:relation><dc:relation>\n        10.1016\/j.jue.2007.04.006<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/20479\/","http:\/\/www.sciencedirect.com\/science\/journal\/00941190","10.1016\/j.jue.2007.04.006"],"year":2008,"topics":["HB Economic Theory","L Education (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nStephen Gibbons, Olmo Silva \nUrban density and pupil attainment \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nGibbons, Stephen and Silva, Olmo (2008) Urban density and pupil attainment. Journal of Urban \nEconomics, 63 (2). pp. 631-650. ISSN 1095-9068  \n \nDOI: 10.1016\/j.jue.2007.04.006 \n \n© 2007 Elsevier \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/20479\/ \n \nAvailable in LSE Research Online: January 2015 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n  \nURBAN DENSITY AND PUPIL ATTAINMENT \n \nStephen Gibbons*, Olmo Silva** \nMarch 2007 \n \nAuthor for correspondence: \nStephen Gibbons, \nDepartment of Geography and Environment \nLondon School of Economics \nHoughton Street \nLondon \nWC2A 2AE \n+44 (0)20 7955 6245 \nEmail s.gibbons@lse.ac.uk \n*Department of Geography and Environment and Centre for Economic Performance, London School of \nEconomics. \n**Centre for Economic Performance and Centre for Economics of Education, London School of Economics and \nIZA-Bonn. \nAcknowledgements: We have greatly benefited from several discussions with Joan Wilson. We also would like \nto thank Helena Holmlund, Steve Machin and participants at the International Conference on “Empirical \nMethods for the Study of Economic Agglomerations”, Kyoto (June 2006) and at the 3rd EEEPE-CEPR \nConference, Paris (October 2006) and seminars in Essex, IZA, Leicester and Reading. We are responsible for \nany errors or omissions. \nAbstract \nWe explore the association between urban density and pupil attainment using three cohorts of pupils in \nschooling in England. Although – as widely recognised – attainment in dense urban places is low on \naverage, this is not because urban environments disadvantage pupils, but because the most \ndisadvantaged pupils with low average attainments attend the most urbanised schools. To control for \nthis, we exploit changes in urban density faced by pupils during compulsory transition from Primary to \nSecondary school, and measure educational progress at the end of the Secondary phase, relative to \nattainment at the end of Primary schooling. Our results suggest that there are small but significant \nbenefits from education in schools in more densely urbanised settings. We detect this density \nadvantage even amongst pupils moving relatively short distances between Primary and Secondary \nschools within urban areas, so we cannot attribute it to broad urbanisation effects experienced by \npupils making rural-urban school moves. A more likely explanation lies in greater school choice and \ncompetition between closely co-located educational providers. \n \nKeywords: Urban Density and Agglomeration; School Choice and Competition; Pupil Achievement. \nJEL Classifications: I20, R20, J24 \n \n- 1 - \n1. Introduction \nCity schools in the UK, US and elsewhere are widely admonished by politicians, school inspectors, \nparents and academics for failing to provide pupils with high standards of education (Machin and \nVignoles [33], Murnane [36], Neal [39], Ofsted [41,42]). With the aim of redressing this situation, \ngovernments in many countries have targeted schools in disadvantaged urban areas. Just a few recent \npolicy interventions include the ‘Excellence in Cities’ program (Machin, McNally, and Meghir \n[32]), and the ‘Aimhigher’ initiative (Emmerson, Frayne, McNally, and Silva [10]) in the UK, and \nthe STAR experiment (Hanushek [20], Krueger [28]) in the US.  \nIn some ways, this critique comes as something of a surprise to economists interested in the \nbenefits of urbanisation and agglomeration. City schools can potentially draw from a diverse pool of \nhigh-quality teachers and are geographically placed in settings which should provide incentives \nthrough competition with other schools and which facilitate sharing of teaching know-how through \ncooperation. Of course, given the concentration of poverty in cities, it is also recognised that urban \nschools are building human capital on a lower base in terms of pupil characteristics, in particular \nhigher rates of hardship and lower initial ability. However, these facts rarely seem to be taken into \naccount when drawing inferences about the effectiveness of urban schools. The simple observation \nof a high concentration of low achievers in dense urban places is taken as evidence that urban \nenvironments disadvantage pupils. \nThis paper uses a census of over 1.2 million pupils in England, matched to records on their \nacademic progress, to assess whether pupils in city schools really show low-educational progress \nrelative to students in schools in lower density suburban, semi-rural and rural areas. We make use of \nthe fact that pupils in England have to switch schools at the end of the Primary phase when they start \ntheir Secondary education, and we look at how a pupil’s educational progress after this compulsory \ntransition depends on the change in contextual urban density experienced as a result of the change in \nschool. From these density changes we infer small but significant benefits from education in schools \n- 2 - \nin more densely urbanised settings. Pupils in schools in relatively dense places – measured in terms \nof school density and other urban indicators – progress faster than others in their cohort, although the \nelasticity is low, at around 0.02. We find this association even amongst pupils who move relatively \nshort distances between Primary and Secondary schools within urban areas. Therefore, we argue, our \nresults do not emerge from broad agglomeration and urbanisation effects experienced by pupils \nmaking rural-urban school moves. Instead, we interpret our findings as providing evidence on the \neffects of greater school choice, inter-school competition or cooperation between closely co-located \ninstitutions in more urban settings. \nThe paper has the following structure. The next section outlines some relevant literature and \nsets the work in the context of the studies on agglomeration economies. Section 3 sets out our \nempirical approach, while Section 4 describes data and institutions. Section 5 presents and discusses \nour results, while some concluding remarks are provided in Section 6. \n2. The literature \n“Conceptually, a city is just a dense agglomeration of people and firms. All of the benefits of cities \nultimately come from reduced transport costs for goods, people and ideas” (Glaeser [16]). This \nsimple intuition, borrowed from the seminal writings of Marshall [34, 35], is nowadays at the core of \nmost research on agglomeration and urbanisation processes. In a nutshell, the fundamental reason \nwhy firms and workers concentrate in geographically contained areas, giving rise to cities, is because \nspatial clustering generates some form of external economy of scale. As discussed in Glaeser [16] \nand Rosenthal and Strange [44], agglomeration benefits emerge from proximity in three factors: \nPeople, associated with labour market pooling and accessibility to a wider sets of customers; Goods, \ncoupled with input sharing and specialization of services for producers; Ideas, linked to the \n- 3 - \nemergence of knowledge and technological spillovers across firms\n1\n. Technological spillovers are \nalso often invoked as an explanation for the reason why cities not only exist, but prosper and grow \ntoo.  \nFor these reasons, the idea that urban schools fail to provide pupils with a high standard \nenvironment for learning comes as something of a surprise to researchers interested in economies of \nurbanization and agglomeration. City schools have the potential to exploit dense labour markets, \ntherefore attracting high-quality teachers. They are located in diversified areas where pupils and \nteachers can be more efficiently matched through the exercise of school choice. Pupils in urban \nschools may also benefit from learning spillovers associated with closer connections to a larger and \nmore diverse group of students. Further, city schools share better common infrastructures, e.g. faster \nconnections for information technologies or public transport. Finally, city schools are geographically \nplaced in settings that should provide incentives for improvement or adoption of new teaching \ntechnologies through competition with other schools, and that facilitate sharing of teaching know-\nhow through cooperation. What evidence is available? \nA growing body of research on the functioning of the labour market for teachers has been \nassembled over the past years. Using different methods and data, Dolton and van der Klaauw [9], \nHanushek and Rivkin [21], Hanushek, Kain, and Rivkin [22], Murnane and Olsen [37] and [38] \nshow that individuals respond to (relative) wage incentives in their decision to start teaching or leave \nthis occupation, and that teaching in urban areas might be a poor option compared to more \nremunerative alternatives available in these locations. Chevalier, Dolton, and McIntosh [5] and \nHanushek, Kain, and Rivkin [22] also report that working conditions in urban schools are perceived \nto be worse than in provincial areas, and that teachers changing schools within urban districts might \n                                                 \n1\n While proximity of goods and individuals is a natural requirement for of economies of scale to emerge in urban \nenvironments, knowledge spillovers might not constrained by distance or within the boundaries of urban areas. However, \nJaffe, Trajtenberg, and Henderson [29] provide evidence on the importance of proximity for know-how diffusion too. \n- 4 - \nseek out schools with easier to teach pupils, such as private schools. Whether this sorting results in \nlower teacher quality in urban state schools is unclear. Hanushek, Kain, O’Brien, and Rivkin [23] \nsuggest that the opposite is true: teachers moving from Texan urban state schools to suburban\/rural \nschools, as well as teachers leaving the state education system, are on average less effective at \nraising pupil attainments than teachers who stay. Additionally, Clotfelter, Glennie, Ladd, and Vidgor \n[6] show that a pecuniary bonus granted to the most qualified teachers in North Carolina greatly \nreduced their hazard rate for exit from high-poverty urban schools; similar evidence is provided by \nHanushek and Rivkin [21] and Lavy [30]. Overall, it seems that city schools are in a favourable \nposition to exploit urban labour markets to hire and retain high-quality educators. \nThere also appears to be greater scope for choice and competition among schools in urban areas. \nA large number of closely located schools implies that parents have a wider set of schools to choose \nfrom within feasible travel-distance. If pupils with many available schools can be more efficiently \nmatched to educational providers that suit their preferences and capabilities, average educational \nstandards should increase. Moreover, in a school market where parents can exercise choice and \nfunding follows pupils (as in the UK setting)\n2\n, schools have to provide the ‘quality’ that parents \ndemand or face falling enrolment, loss of money and ultimately closure. The empirical case on the \nbenefits of choice and competition is however mixed. On the one hand, research by Cullen, Jacob, \nand Levitt [7] and [8] shows no performance gains associated with greater parental choice in the \nChicago urban setting. On the other hand, Hoxby [25], [26] and [27] finds that competition in US \nmetropolitan areas is beneficial to pupil achievements. In England, Gibbons, Machin, and Silva [13] \nprovide evidence that Primary school competition is not generally associated with performance gains \nfor state school pupils, except for a minority enrolled in specific types of school that enjoy more \nfreedom in managing their governance and admission practices. \n                                                 \n2\n There is no strict attendance zoning in most of England: pupils can in principle attend any non-oversubscribed school \nof their choice, without restrictions regarding place of residence and school proximity (more detail in Section 4). \n- 5 - \nWhile inner-city school competition is commonly credited with inducing teaching-related \ninnovations and high school standards, know-how externalities may also emerge because closer \nproximity of schools facilitates cooperation and sharing of teaching practices and technology among \nneighbouring institutions. In fact, this is the rationale behind a recent policy initiative of the UK \ngovernment – the Beacon school scheme – providing incentives for outstanding institutions to work \nin partnership with other neighbouring schools to help those achieving similar standards\n3\n. \nWhy, then, are city schools so commonly associated with failure? On the one hand, this could \njust be because cities have a high concentration of children with fewer home resources and family \nbackground disadvantages who on average do worse at school (Glaeser, Kahn, and Rappaport [17]). \nWhilst this observation suggests that urban schools are building human capital on a lower base in \nterms of pupil characteristics, it does not have any bearing on the educational progress of students in \ncity areas or on the effectiveness of urban schools in educating their pupils. On the other hand, there \nare reasons why pupils might indeed do less well if they attend an inner-city school rather than a \nsuburban or rural one. Some of these are analogous to the dispersion forces that appear in standard \nagglomeration theories. Many congestion-related factors that accompany high urban density are \nlikely to be detrimental to pupil learning: overcrowding in schools and supporting services (such as \nlibraries), high levels of property crime, violence and other social\/emotional problems that cause \ndisruption directly and through peer group influence, and high pupil turnover because of \ndemographic mobility. The reports by Ofsted [42] and Lupton [31] present a range of such features \nthat are common to schools in urban areas in England, most of which could be broadly considered as \nnegative peer-group effects. \n                                                 \n3\n Under the Beacon program, schools that deliver outstanding teaching and are well managed are awarded a ‘beacon’ \nstatus (renewable every third year) to highlight examples of successful practice. Beacon schools are expected to \norganizing meetings, cross-institution working and pastoral support, as well as increasing teacher participation and \nretention, to help neighbouring schools improve their education standards. See GHK [12]. \n- 6 - \nUltimately, whether the combination of positive and negative factors characterizing city schools \nis beneficial or detrimental to pupil educational progress is an empirical question. Although levels of \nattainment in dense urban areas might be low because the most disadvantaged pupils attend the most \nurbanised schools, urban areas might provide better learning environments in terms of pupil \nacademic progress, relative to lower density suburban, semi-rural and rural areas. This issue is rarely \ntaken into account when assessing the performance of pupils in urban schools, and is the empirical \nproblem which we tackle in the next sections. \n3. Empirical methods: the value added model of attainment \nOur aim is to study the influence of urban density on pupil attainment in schools in England. We will \ninvestigate this relationship in the context of compulsory-age Secondary schooling between the ages \nof 11 and 16. At the beginning of this period, nearly all pupils in the state sector in England switch \nschools as they move from the Primary to Secondary phase. Our identification strategy will exploit \nchanges in school setting that occur on this transition. Compulsory school-transition offers an \nadvantage over most empirical strategies that exploit voluntary changes initiated by movers. \nEveryone here is a ‘mover’, so that the problem of endogeneity of the choice and direction of move \nis less acute. \nIn our empirical model, attainment ijy  of individual i  in school j  depends on unobserved \nindividual characteristics ( ia ) that are constant within individuals across schools and with age, \nobserved school characteristics ( jz ) and random individual-school specific factors ( ij ); we also \nallow for the possibility that an individual’s trend in attainment with age t  depends on observable \npersonal characteristics ix : \nijjiiijij ztxauy    (1) \nThe key variable of interest is a measure or vector of measures ju  describing the urbanisation of \nthe environment in which a school is located. The exact form of these proxies will be discussed later \n- 7 - \n(in Section 4), but the intention is to capture the general aspects of density, agglomeration and \nurbanisation that may influence pupil attainment. These forces may act through greater school \naccessibility and competition, a deeper pool of good teachers in urban labour market, better inter-\nschool networking, more efficient matching of pupils and teachers to schools, broadly defined \n‘neighbourhood’ effects, such as role models and expectations, and much else which might lead \npupils to perform better (or worse) in places where there are more schools, more infrastructure and \nmore people. In fact, we make no definite attempt at separating the impact of these indices on pupil \neducational achievement from other unobservable characteristics of urban schools, as we want to \ncapture general efficiency\/quality benefits associated with attending a school in dense urban areas. \nOur main concern, instead, is to take care of individual unobservable heterogeneity which may \nsimultaneously drive attainment and school of choice, creating a spurious link between measures of \nurbanization and pupil educational performance. Notice that this model is an analogous (but more \ngeneral) set up to that typically used to study agglomeration economies in firm or aggregate \nproductivity, where the dependent variable is individual pupil attainment, rather than productivity. \nConsistent estimation of   in (1) is not straightforward in the cross section because \nunobserved individual factors (such as family income and various forms of advantage\/disadvantage) \nare highly correlated with choice of residential location, and hence choice of school and the urban \ndensity of its surroundings. However, since an pupil is observed in two or more schools, at different \nages – namely Primary school j and Secondary school k  – it is (at least) possible to difference out \nfixed individual factors using the familiar transformation:  \njkijkijkijki\nijikjkiijikijik\nzxtuy\nzztxuuyy\n,,, )(\n)()()(\n\n\n\n\n \n(2) \nEquation (2) is a pupil educational production function in ‘value-added’ form, where the influence of \neducation in an urban setting leads to a gain (or loss) in attainment when a pupil changes school on \ncompulsory transition from the Primary to Secondary phase. Here, t  is the number of periods \n- 8 - \nbetween our observation of the pupil in school j  and k . In model (2), it is still possible that the \nchanges in unobservable individual-specific factors jki,  are correlated with the change in urban \ndensity. However, we can partly control for this source of bias by estimating fixed effects models \nthat allow for Primary or Secondary school influences on pupil progress that are common across \npupils within a school. Identification is achieved using either the variation in the change of urban \ndensity for pupils going to the same Secondary but coming from different Primary schools, or the \nvariation in the change of urban density for students attending the same Primary and moving to a \ndifferent Secondary school. We therefore condition out school-specific, and school location-specific \ninfluences on attainment growth that are common to all individuals within a school, including \nunobservable individual school preferences shared by schoolmates (components of jki, ). \nAdditionally, given that few Primary to Secondary school transitions involve long-distance \ngeographical mobility, school fixed effects also control for broader agglomeration effects which are \ncommon to both the Primary and Secondary phase. Note then, that we will mainly identify our \neffects off the change in the density between the urban environments in the immediate proximities of \nthe two schools (Primary and Secondary) that each pupil attends. \nTo go one step further, we also estimate models controlling for Primary or Secondary school \ninfluences, and including residential neighbourhood fixed effects. This can be done using detailed \ninformation on individual’s home postcodes (corresponding to 10-12 contiguous housing units) and \nallows us to control for unobservable characteristics, such as income or preferences over local \namenities and schools, common to families sorting into the same small residential neighbourhood. \nThe underlying assumption for obtaining an unbiased estimate of β after controlling for either \nPrimary or Secondary school influences and home postcode fixed effects, is that the differences in \nurban density between the Primary and Secondary phase are not systematically correlated with a \nchange in unobservable pupil characteristics that drives attainment growth between the two phases, \nbut only reflect changes in school quality\/effectiveness associated to more or less dense \n- 9 - \nenvironments. In the analysis that follows, we will spend considerable effort to assess the validity of \nour assumptions. \nAnother crucial assumption for our strategy to work is that pupils must have a range of schools \nthat they can choose to attend, given where they live. This condition is essential if there is to be any \nvariation in Secondary school urban density, conditional on Primary school and postcode of \nresidence (or variation in Primary school urban density conditional on Secondary school and \npostcode of residence). In fact, in the UK, unlike the US, parents and pupils are free to choose from \na number of schools and there is not anything like a one-to-one mapping from place of residence to \nschool attended. We give more details in the next Section.  \nIn conclusion, our main empirical results are based on estimates of Equation (2) in more or less \nrestricted forms, allowing for postcode and Primary or Secondary fixed effects. The main challenge \nto estimating these two-way fixed effects models (once the necessary data has been assembled) is the \nlarge number of school (around 14,000 Primaries and 2,800 Secondaries) and postcode fixed effects \n(more than 500,000) that need to be estimated or partialled-out, especially when we have a large \nnumber of pupil observations. Direct estimation of the complete model using group dummy \nvariables is infeasible on the full data. We therefore follow a step-by-step procedure inspired by a \nseries of papers by Abowd and co-authors (Abowd and Kramarz [1], Abowd Kramarz, and Margolis \n[2] and Abowd, Creecy, and Kramarz [3]) for firm and individual effects, We describe this method \nin Appendix Section 11. Implementing this strategy requires very rich data, with information on \npupil characteristics, schools attended and their exact location, attainment in at least two periods \narising from education in at least two different school settings, and detailed pupil residential address. \nThe next section describes how our data sources allow us to obtain all required information. \n- 10 - \n4. Data and institutional setting \n4.1. Schools, pupils and tests \nCompulsory education in England is organised into five stages referred to as Key Stages. In the \nPrimary phase, pupils usually enter school at age 4-5 in the Foundation Stage and then move on to \nKey Stage 1, spanning ages 5-6 and 6-7. At age 7-8 pupils move to Key Stage 2, sometimes – but \nnot usually – with a change of school. At the end of Key Stage 2, when pupils are 10-11, children \nleave the Primary phase and go on to Secondary school where they progress through Key Stage 3 to \nage 14. At the end of each Key Stage, prior to age-16, pupils are assessed on the basis of standard \nnational tests (SATS). At age 16, at the end of the compulsory schooling, pupils sit GCSEs \n(academic) and\/or NVQ (vocational) tests in a range of subjects.  \nThe UK’s Department of Education and Skills (DfES) collects a variety of data on school pupils \ncentrally, because the pupil assessment system is used to publish school performance tables and \nbecause information on pupil numbers and characteristics is necessary for administrative purposes – \nin particular to determine funding. A database exists from 1996 holding information on each pupil’s \nassessment record in the Key Stage SATS throughout their school career. For Key Stages 2 and 3 we \nhave information on pupil test scores in Maths, Science and English, while for GCESs\/NVQs, we \nmake use of pupil ‘Point Scores’ in a range of subjects – indicators of total achievement devised by \nthe Qualifications and Curriculum Authority (QCA) and used by the DfES in the performance \ntables\n4\n. These point scores are based on allocating points to different grades, and aggregating across \ntypes of qualification using appropriate weights (details available from the DfES or the QCA). To \nmake age-16 scores comparable to earlier Key Stage grades and construct measures of educational \n                                                 \n4\n Note that, although at age 16 pupils can choose to sit exams from a wide range of different subjects, Maths, Science \nand English are still compulsory. \n- 11 - \nprogress during the Secondary phase, we add pupil test scores across all subjects taken and then \nassign pupils a level which is their percentile ranking in the distribution across pupils. \nSince 2002, the DfES has also carried out a Pupil Level Annual Census (PLASC) which records \ninformation on pupil’s school, gender, age, ethnicity, language skills, any special educational needs \nor disabilities, entitlement to free school meals and various other pieces of information including \npostcode of residence (a postcode is typically 10-12 neighbouring addresses)\n5\n. PLASC is integrated \nwith the pupil’s assessment record (described above) in the National Pupil Database (NPD), giving a \nlarge and detailed dataset on pupils along with their test histories. Unfortunately, the length of the \ntime series in the data means that it is not, at present, possible to trace individuals through from their \nfirst tests (Key Stage 1) to their final tests (GCSE\/NVQ). It is however, possible to follow the \nacademic careers of three cohorts of children through from age-11 to age-16, and to join this \ninformation to PLASC data at age-16. We use information on these three cohorts – those aged 16 in \n2002, 2003 and 2004 – as the core dataset in this study. Various other data sources can be merged in \nat school level, including institutional characteristics (from the DfES) and information on the \ngeographical location of each school (down to postcode level). This allows us to geo-code the pupil \ndata based on school attended, and to perform spatial data operations using a Geographical \nInformation System (GIS). \nFrom this large and complex combined data set we are able to construct a balanced panel \nproviding information on three cohorts of over 400,000 pupils each, observed over three academic \nyears, attending more than 14,000 Primary schools (when aged 11) and around 2,800 Secondary \nschools (when aged 16). We include only those pupils who are in schools that do not admit students \non the basis of academic ability and we do not have data on pupils attending private schools\n6\n. We \nwill use this information to estimate the influence of changes in urban density resulting from \n                                                 \n5\n Prior to 2002 this information was collected only at school level. \n6\n Private schools educate around 6-7% of pupils in England as a whole. \n- 12 - \ncompulsory moves from the Primary to Secondary phase on pupils’ subsequent movement through \nthe attainment distribution\n7\n. In the next section we briefly discuss how school choice and primary-to-\nsecondary school transition operate in England. \n4.2. School choice and transition \nSince the Education Reform Act of 1988, the ‘choice’ model of school provision has been \nprogressively extended in the state-school system in England (Glennerster [18]). In this setting, \npupils can attend any under-subscribed school regardless of where they live, and parental preference \nis the deciding factor, All Local Education Authorities (LEAs, now LAs) and schools must organise \ntheir admissions arrangements in accordance with the current statutory DfES Admissions Code of \nPractice. The guiding principle of this document is that parental choice should be the first \nconsideration when ranking applications to schools. However, if the number of applicants exceeds \nthe number of available places, other criteria which are not discriminatory, do not involve selection \nby ability and can be clearly assessed by parents, can be used to prioritise applicants\n8\n.  \nHow much school choice is there in practice? Gibbons, Machin, and Silva [13] report that, for \nthe Greater London metropolitan area, less than one in four pupils have no Primary school – other \nthan the one they actually attend – within convenient travel distance from home. The figures for \nSecondary schools are similar (Briggs, Burgess, McConnel, and Slater [4]). Generally, less than 50% \nof pupils attend their closest school, and even in rural areas the figure is only 60%. This evidence \nshows that there is not a one-to-one mapping between where a child lives and where he or she goes \nto school. Hence, and crucial to our analysis, pupils will have a range of Secondary schools from \n                                                 \n7\n In the work that follows, pupils’ attainment is always measured in terms of their percentile ranking within their cohort \nat each Key Stage, using the distribution within pupils in this balanced panel. \n8\n These vary in detail, but preference is usually given first to children with special educational needs, next to children \nwith siblings in the school and to those children who live closest. For Faith schools, regular attendance at local \ndesignated churches or other expressions of religious commitment is foremost. \n- 13 - \nwhich to choose when making the transition from the Primary to the Secondary phase and urban \ndensity can vary quite considerably amongst these schools. \nNote however that, despite this flexibility in choice, most Primary to Secondary transitions \ninvolve relatively short distance moves. The typical distance between a pupil’s Primary and \nSecondary school is quite low: the median is only 1.67km. The distribution is however skewed, with \nmuch higher mean (6.6km) and top decile (above 7km). This distance will play an important role \nwhen interpreting the link between pupil achievement and measures of urban density of the school \nsetting. We describe these indices in the next section. \n4.3. Indices of urban density \nThere are obviously innumerable ways to describe the extent to which a school’s geographical \nsetting can be characterised in terms of urban density. We pick three that we think capture key \naspects relevant to our goals: the density of schools in the locality, the amount of local developed \nland and the residential population density. The first can be thought of as an ‘educational’ urban \ndefinition and mainly relates to school competition or cooperation, choice and accessibility. To \nconstruct this we use GIS to calculate the number of schools within predetermined distances of each \nschool using the matrix of inter-school distances. The second is an environmental definition, and \npicks out schools in dense metropolitan areas through built environment and infrastructure. To \nderive this index we turn to a land cover dataset – Landcover Map 2000 – based on Landsat satellite \nimagery for the late 1990s\n9\n. Using this data, we compute for each school the proportion of land, \nwithin a predetermined radius, that is defined as continuous urban or suburban\/semi rural according \nto the Landcover Map 2000 definitions. The third index identifies schools as urban if they are in \nplaces where there are high concentrations of people, and is derived from the 2001 Population \n                                                 \n9\n This data set records land cover type in 27 categories for 25m square tiles covering the whole of Great Britain. \nInformation is provided by the Centre for Ecology and Hydrology, Huntingdon, Cambridgeshire, England. \n- 14 - \nCensus. Again, we estimate the population density within predefined radii of each school using \npopulation counts and land areas of the smallest Census unit (Output Areas). With this data in hand \nwe next proceed to fit the models described in Section 3\n10\n. \n5. Results and discussion \n5.1. Descriptive statistics \nThe descriptive statistics on the main variables we will use in the regression analysis are presented in \nTable 1. As described in Section 4.1, attainment at age 16 and 11 is based on percentiles derived \nfrom pupil test\/point scores; by construction, descriptive statistics of these attainment percentiles are \nnot very interesting. More informative are the statistics for the change in achievement percentiles \nbetween ages 11 and 16 (educational progress). As expected, this is close to zero on average. \nMoreover, the scores at age 11 and 16 are highly correlated, with a correlation coefficient of 0.69. \nOur empirical goal is to see to what extent these movements in the achievement distribution are \nlinked to transition-related changes in the urbanisation of the school environment. The next four \nrows of Table 1 summarise the urban indices we set out in Section 4.3. We can see that there is a lot \nof variation in school setting in England: The number of neighbouring schools within 2km varies \nsubstantially ranging from 0 to 63, with a mean of 10 and standard deviation of 7.4. The map in \nFigure 1, which illustrates the number school per square kilometre in and around the Greater London \narea, suggests that school density is picking out inner city locations in particular. Yet even within \nLondon, the number of schools per square kilometre varies widely over short distances. The \nproportion of neighbouring land that is defined as continuously developed varies from 0 up to almost \n                                                 \n10\n Formally, these measures are all kernel estimates of school density, proportion of developed land and population \ndensity at the school site, using a uniform kernel. We investigated various bandwidths for estimating these indices – \n2km, 5km and 10km – but present results only for the 2km radii. Experimentation indicated unambiguously that there is \nno additional information in the 5km and 10km-based estimates that is relevant for the attainment models we estimate \nbelow. \n- 15 - \n90%, though on average schools are in locations where only 17% of land is urban under this \ndefinition. It should be pointed out that this definition mainly captures development in inner city \nsettings. Land that is a closely integrated combination of buildings and open spaces (e.g. gardens) is \nclassified as suburban and rural-developed. Finally, it can be seen that neighbouring population \ndensities vary widely too. \nThese findings are not wholly unexpected, since we know that England contains a wide mix of \nurban, suburban and rural schools. Perhaps more surprising is the range of variation in the change in \nschool setting that occurs when pupils move from Primary to Secondary school\n11\n. The change in the \nnumber of local schools varies between a decrease of 58 and an increase of 59, almost the whole \nrange possible. Similarly, pupils experiencing the biggest shift from high-density to low-density \nenvironments see an 84 percentage point fall in the proportion of developed land surrounding their \nschool, a change that is mirrored by pupils moving from low-density to high density locations. \nHowever, this variation is exceptional, while standard deviations are much more modest – at 4.5 and \n11 percentage points for the two variables, respectively. Importantly, most changes seem quite \nexaggerated considering that pupils typically move to Secondary schools that are fairly close to their \nPrimary schools.  \nIndeed, this distance is going to be important when it comes to interpreting our results: are the \nchanges in urban density predominantly the result of long-distance movements of pupils between \nrural and urban locations, or between inner and outer metropolitan locations; or are they the result of \nsmall shifts in urban context that occur within cities, towns and other localities? As we can see in the \nlast two rows of Table 1, the typical distance a pupil moves between Primary and Secondary school \nis low, with a median value of 1.67km. However, the distribution is highly skewed with a mean of \n                                                 \n11\n Though its average is close to zero, so apparently Secondary schools are not located in predominantly more urban \nareas. One caveat applies however: the results on urban development and population density might be slightly \nmisleading since Secondary schools usually have much larger sports grounds, and appear to be in lower density and less \ndeveloped locations than Primary schools. \n- 16 - \nnearly 6.6km, the top 10% moving over 7.6km and the most mobile 1% of pupils moving over \n160km. \n5.2. Estimates of the attainment models \nWe move now to regression estimates of the models described in Section 3. Table 2 presents the \nresults from various specifications incorporating the urban indicators described in Section 4.3. Note \nthat the rows report coefficients from three different regressions, one with school density (Row 1) as \nthe urban indicator, one with both types of developed land cover entered together (Rows 3 and 4), \nand lastly one in which population density enters individually (Row 5).  \nColumn (1) shows the raw Ordinary Least Squares (OLS) association between age-16 \nattainment percentile and the urban density of the school in which the pupil takes their GCSE\/NVQ \nexaminations. In this column there are no controls for pupil or school characteristics. It is \nimmediately clear that attainment is, on average, worse in schools in denser urban areas – regardless \nof which measure of urban density we use. The coefficient in the first row shows that an additional \nschool within 2km (i.e. an additional 0.08 schools per km\n2\n) is associated with a drop in pupil \nattainment of just under 0.28 percentiles. This estimate implies that children in schools in the densest \nurban areas are around 8.4 percentiles below others in their cohort who are in the least dense areas \n(based on a four standard deviation difference of 30 schools within 2km). Similarly, if we consider \nland-cover or population density (Rows 2-4), we see that schools in dense or more developed areas \nhave lower performing pupils. A four standard deviation increase in urban density is associated with \na six to seven percentile attainment gap. Moving to Column (2), we add controls for basic pupil \ncharacteristics – ethnicity, gender, and indicator of entitlement to free school meals (poverty) and an \nindicator that English is the pupil’s first language. This attenuates the coefficients slightly, but the \noverall picture is unchanged: pupils in dense areas are doing badly. \nAs discussed earlier, we conjecture that this association could be the result of sorting of more \ndisadvantaged children into urban areas. It is obvious and well known that the poor live, \n- 17 - \npredominantly, in cities. Moreover, the demographics of school attendance are driven to a large \nextent by local housing costs (especially social housing) and community characteristics, which are in \nturn determined by factors other than expected school quality only. The value-added attainment \nmodel in Column (3) shows that this conjecture is, by and large, correct. This specification \ndifferences within pupils between Primary (age-11) and Secondary (age-16) schools, and removes \nany (unobservable) factors that are fixed for individuals over time or for the same pupil in the two \ndifferent schools. These factors include innate abilities and family background, and, for the vast \nmajority of pupils who do not move house between the two schooling phases, neighbourhood \ninfluences from residential location too\n12\n. The results are striking: pupils experiencing a relative \nincrease in the density of their school location when they change from Primary school to Secondary \nschool move up the attainment distribution relative to other pupils in their cohort. The expected \nattainment gap for someone experiencing a two standard deviation increase in urban density relative \nto another experiencing two standard deviation decrease is around 2.5 – 2.8 percentiles. This is a \nsubstantial difference, and is comparable to the gap for poor pupils who are eligible for free school \nmeals, and only slightly less than the gender gap (4 percentiles), both of which have been the subject \nof much academic attention. Even so, the gains are not large enough to close the gap in the level of \nattainments of pupils in the most urban schools relative to students in more rural areas at the end of \nSecondary compulsory education (which we have shown remains as large as 8.5 percentiles). Note \nfinally, that the suburban\/rural developed land cover is not significant in the value-added models – it \nis the influence of central urban location (measured by continuous urban land cover) that is most \nclosely related to attainment. \nIn terms of magnitude, there is not much to choose between the various urban indicators \nemployed in these value-added specifications (except suburban\/rural developed, which is always \n                                                 \n12\n Based on information in our data, we can calculate that only 10% of pupils change their residential address between \nthe end of Primary school (age 11) and the end of the Secondary phase (age 16). \n- 18 - \nnon-significant), although interestingly the coefficient on our measure of school density is always \nmore statistically significant than the others. In the results in the next section, we will try to \ndisentangle the relative influence of these indices as best we can. \nNote finally that most schools in England have been established for a long time and their \nlocation is driven predominantly by long-standing housing and population patterns, so it is very \nunlikely that school density is endogenous to pupil attainment through school location decisions. \nThis is in contrast to the standard empirical models of agglomeration economies in production, \nwhere firms and employees choose where to locate, and hence employee and firm density is clearly \nendogenous to the productivity of those locations. Still, there are many potential explanations for a \ncorrelation link between density and attainment other than a causal one, and we delve further into \nthis in the following sections. \n5.3. Estimates of one and two-way fixed effects models \nTable 3 presents results of more fully specified models of age-11 to age-16 pupil attainment gains, \nincluding school and, in some cases, residential fixed effects. Since it does not seem theoretically or \nstatistically relevant (from Table 2), we drop the suburban land-cover indicator, but now include all \nthe other urban indicators together in the regression. In addition to the controls described in Table 2, \nwe include the mean age-11 attainment of the age-16 Secondary school pupils (unless the model has \nSecondary school fixed effects) and a dummy variable indicating if the pupil switched in or out of \nthe standard secular Community school sector, for example into or out of a Faith state school\n13\n.  \n                                                 \n13\n About 30% of Primary school pupils in England and 15% of Secondary school students are educated in religiously \naffiliated state-schools. These schools are funded by the central government, via Local Education Authorities, and have \nto comply with the national curriculum in terms of teaching and assessment of their students. Including these additional \ncontrols may be important because there are differences between the spatial distribution of Faith and secular schools and \nwe want to rule out the possibility that the association of attainment with urbanisation is driven by covert selection of \nhigher ability pupils into religious schools (West [46], Gibbons and Silva [14]). Moreover, other work on similar data \n- 19 - \nLooking at Column (1), with Primary school fixed effects, school density wins out convincingly \nin the ‘fight’ between our highly-correlated urban indices. The coefficient on population density is \nnear zero and completely insignificant. The coefficient on urban land cover is sizeable, but also \ninsignificant. Undoubtedly, there are many things that are correlated with school density that we \nhave not taken into account here, and we make no claim at this stage that it is actually school density \nthat has a causal impact on attainment. Yet our findings suggest that aspects of the urban \nenvironment associated with high school density – such as accessibility and choice, competition or \ncooperation – are conducive to higher attainment, a conjecture to which we will return later in \nSection 5.6. Column (2) repeats this analysis with Secondary school fixed effects, which makes little \ndifference to interpretation of the school density coefficient, though we have stronger evidence of a \nmore general association with urbanisation reflected in land cover. This finding might suggest that \nurban density in Primary schools has a larger effect on earlier age-11 attainments, than urbanization \nin Secondary schools has on age-16 achievements. On the other hand, we find a small but weak \nnegative association between educational progress and population density.  \nAppendix Section 11 outlines how we can estimate urban density influences whilst controlling \nfor Primary or Secondary influences and residential postcode fixed effects, and discusses methods of \nimplementation. This strategy controls for trends in educational achievements shared by individuals \nwithin the same Primary or Secondary schools, which may arise from school institutional features or \nunobservable school preferences shared by schoolmates and their parents. The strategy also controls \nfor unobservable characteristics common to families sorting into the same residential \nneighbourhoods, and other local unobserved amenities which may affect pupil value added.  \nColumns (3) and (4) of Table 3 present the results of this exercise with home postcode and \neither Primary school or Secondary school fixed effects. Even with these very stringent \n                                                                                                                                                                   \nhas shown that mean peer-group attainment at the start of Secondary school has a small but significant impact on pupil \nprogress through Secondary school (Gibbons and Telhaj [15]). \n- 20 - \nspecifications, we find a robust link between urban density and pupil attainment. The impact of \nschool density is almost unaffected in both size and significance relative to the earlier results, while \nproportion of urban land and population density still do not play a significant role. Overall, it seems \nthat the effect we are capturing in terms of density influences on attainment is not related to place of \nresidence (including residential neighbourhood effects and unobserved family background \ninfluences), but more genuinely to a change in school setting. \nGiven the results so far, we conclude that a relative increase in urban density on transition \nbetween Primary and Secondary school is linked to a small but significant improvement in expected \npupil attainment. The results and discussion in the next sections try to shed some light on the scope \nand sources of these gains from urban density. \n5.4. Geographical scope: who benefits? \nIn this section we uncover possible sources of the density attainment advantage by considering \nwhich groups of pupils gain and which groups lose after the transition between Primary and \nSecondary school. Table 4 shows the impact of urban density on attainment for various sub-groups \nof the population. All models are age-11 to age-16 value-added models, with the same controls as in \nTable 3, Column (1). Results for this baseline specification are repeated in the first column of the \nnew table for comparison.  \nA first question to ask is whether the density effect is driven predominantly by pupils moving \nfrom high-density (e.g. urban) locations or by those moving from low-density (e.g. rural) locations. \nWe consider this by splitting the sample into pupils originating in Primary schools in the bottom \n(Column (1)) and top (Column (2)) density quartile. Looking at the coefficients in the table we see \nthat the magnitude of the relationship between school density and attainment is similar for both \ngroups, though the point estimate is larger and more significant for pupils starting out in high-density \nPrimary school locations. This results is perhaps surprising: the gains arise not just from pupils \nmoving from low-density areas, but amongst pupils already schooled in high-density locations who \n- 21 - \neither: a) Lose out through moving to lower density Secondary school locations; or b) Gain by \nmoving into higher density locations within the top quartile\n14\n.  \nApparently, what we are seeing is not easily explained by simple agglomeration or urbanisation \nstories in which rural or semi-rural pupils gain from moving into urban locations for their Secondary \nschooling. We come to similar conclusions when we consider the distance between the Primary and \nSecondary schools that pupils attend, as in Columns (3) and (4). The first of these columns reports \nthe results for the sub-group of pupils whose Primary-Secondary distance is in the lowest quartile \n(<900m) and the second for the upper quartile (>3.6km). Surprisingly, there are positive attainment \nimpacts from school density for both groups, though as we would expect these are much larger and \nmuch more statistically significant for the long-distance movers. Even so, many of the moves in this \nupper quartile are still quite short and it is doubtful that many of the density changes in our data are \nreally the result of major transitions between rural and urban locations; they mainly capture more \nmarginal changes amongst lower and higher density places in urban settings.  \nThis pattern is revealed even more explicitly when we look at the distinction between pupils \nmoving schools within London and those moving within the rest of England in Columns (7) and (8). \nWe see here that school density is strongly linked to attainment even for pupils moving within the \nmetropolitan London region, moves that are clearly not in any way rural-urban. Finally, the same \nargument carries over to Columns (7) and (8) where we split the sample by pupils making the \nprimary-secondary transition within Local Education Authorities (by far the majority) and those \nmoving to secondary schools in a different LEA. Although the magnitude of the link between school \ndensity and achievement is bigger for pupils making between LEA-moves, the difference between \n                                                 \n14\n Coming at this from a different angle, we also split the sample into two other groups: those who make a school \ntransition that results in a top-quartile change (rise) in school location density, and those whose transition results in a \nbottom-quartile change (fall) in density. Again, we found that, although both groups seem to experience relative gains \nfrom density increases (or relative losses if density decreases), the effect is strongest amongst those whose Secondary \nschool is in a less dense location than their Primary school. \n- 22 - \nthese groups is not enough to suggest broad agglomeration forces and local labour markets as the \ndriving factors. \n5.5. Robustness checks: strategic behaviour, pre-transition trends, mean reversion, greater variance \nin cities? \nOne possible explanation for what we have found is that pupil attainment is measured \ninappropriately. Our measures at age 11 and at age 16 may not really be directly comparable, \nbecause pupil percentile score at age 11 is based on tests in Maths, Science and English only, whilst \nat age 16 it is based on a wide range of different tests in different subjects (though Maths, Science \nand English are compulsory). The exact mix of subjects taken by pupils at age 16 will depend to \nsome extent on school expertise and strategic behaviour. Schools tend to be evaluated on the basis of \nthe proportion of students passing at least 5 GCSE\/NVQ grade C exams (graded between G and A*), \nso there are incentives for schools to act strategically (encouraging pupils to qualify in many exams \nat moderate grade or take ‘softer’ options) to maximise the number of students reaching this target. \nClearly there would be a problem in terms of the interpretation of our results if they were driven by a \nlink between urbanisation and the incentives for schools (or pupils) to act deliberately in this way. \nWe go some way to allaying these fears in Columns (1) and (2) of Table 5, which present results for \nalternative measures of attainment\n15\n. In the first column, we look at pupil percentile based on mean \ngrade across all GCSE\/NVQ subjects, rather than on total points added up across subjects. In \nColumn 2 we instead use the age-16 percentile based on total points obtained in Maths, English and \nScience only, rather than added up across all subjects. The results here are almost identical to before, \nso it does not seem that strategic behaviour in terms of ‘numbers’ versus ‘grades’, or  ‘soft’ versus \n‘tough’ exams can explain our findings.  \n                                                 \n15\n To keep things simple we just consider school density as the urban index here, where we observe most of the action. \n- 23 - \nAnother argument against a causal interpretation of our urban density impact is that we cannot \nproperly account for pre-existing trends in pupil performance. Perhaps, what is happening is that \npupils on more rapidly rising attainment trajectories are also those who experience the biggest \nchange in urban density, through their choice of Primary and Secondary schooling. In fact, our \nprevious estimates imply that the pupils showing the fastest progress must both: a) Prefer lower \ndensity Primary schools, conditional on choice of Secondary school and place of residence; and b) \nPrefer higher density Secondary schools, conditional on choice of Primary school and residential \nneighbourhood. There is no obvious way to reconcile these patterns with any consistent preferences \nthat might be related to pupil attainment trends. However, we would clearly like to rule this selection \nprocess out as a candidate explanation for our findings. \nAs explained above, we do not have information on pupil attainment trends prior to the \nPrimary-Secondary school transition for these cohorts. We can however, provide a weaker test based \non the deviation of the age-11 to age-16 attainment gain from a linear trend, using an intermediate \nmeasure of attainment at age 14. This robustness check is presented in Column (3), where the \ndependent variable is the difference between age-16 and age-14 percentile, minus the difference \nbetween the age-14 and age-11 percentile – i.e. the acceleration in attainment. The coefficient in \nColumn (3) suggests that attainment does rise at a faster rate in more densely located schools, so our \nmain results are not solely due to sorting of pupils with heterogeneous linear attainment trends.  \nAs one further step, we devise an Instrumental Variable (IV) strategy based on differences in \ntravel costs at different home locations, which change behaviour over school choice in ways that are \nnot directly related to pupils’ expected growth in achievement. Our argument is that individuals \nhaving easy access to public transport in metropolitan areas are likely to travel longer distances to \nSecondary school and experience the biggest changes in urban density on transition from Primary to \nSecondary school. So, our strategy is to predict the change in urban density experienced by pupils on \ntransition from Primary to Secondary school using proximity between pupil homes and underground \n- 24 - \nor railway stations within a metropolitan area. To implement this approach, we confine our attention \nto pupils living in London and attending Secondary schools in London when they are aged 16. \nAlthough movements in either direction seem possible – i.e., either towards the centre or the \nperiphery of the metropolitan area – we argue that living near a station in London makes it more \nlikely that a pupil travels towards the centre of town; this is because it is only in this direction that \nthe rail network brings pupils anywhere close to Secondary schools\n16\n. So, we construct the following \ninstruments: two measures for (straight line) distance between individuals’ residential postcode and \nthe closest train and underground stations, within 2km of home and two dummies indicating whether \nthere are no railway or underground stations within 2km of residential location\n17\n.  \nResults from using these instruments for the change in school density are reported in Columns \n(4) and (5) of Table 5. Column (4) includes the set of controls detailed before, while in Column (5) \nwe add Postcode District fixed effects to control for broad geographical differences\n18\n. First stage \nstatistics are reported at the bottom of the table. For both the specifications, these test statistics show \nthat our instruments are powerful predictors of changes in urban density and not significantly \ncorrelated with unobservable characteristics which may affect educational progress. The second-\nstage IV estimates confirm that pupils tend to progress faster if they move to more densely located \nschools: the coefficient on the change in the number of schools within 2km is larger than before\n19\n, \n                                                 \n16\n This is simply a feature of the geographical density of schools and stations, which both increase towards the centre of \nLondon. This means that it is much more likely that a Secondary school can be reached by walking from a station in \ninner London, than by walking from a station in the outskirts. This intuition is borne out by our results. \n17\n Critical to this instrumental variable approach is the assumption that residential choice in relation to transport access is \nnot linked to unobserved individual and family characteristics or other local amenities that may affect pupil educational \nperformance. In our defence we should emphasize that our value-added models already deal with pupil unobservable \nattributes (including family background and preferences) that are fixed over time.  \n18\n Full UK postcodes are typically of the form AB# #CD, where # is numeric. Deleting the last three characters generates \na Postcode District code. There are more than 400 Postcode Districts in the extended London region. \n19\n Although it is comparable to the estimates for the number of schools only (Column 5, Table 2) and for the London \narea only (Column 8, Table 4). \n- 25 - \nthough its statistical significance is reduced. This finding lends further credence to the idea that a \nrelative increase in urban density on transition between Primary and Secondary school is linked to \nsmall but significant improvement in pupil attainment. \nMean reversion is another concern. As we have noted, pupils enrolling in urban schools tend to \nbe those with lowest attainments and from the most disadvantaged backgrounds. Pupils in urban \nPrimary schools may then experience the fastest value-added simply through reversion towards \nmean attainment at later stages in their education. Could this give rise to a spurious correlation \nbetween density and attainment in our value-added models? Since we consider how changes in \nattainment are correlated with changes in school density, our positive coefficients could only arise \nthrough mean reversion if pupils experiencing the biggest increase in density when they move school \nare also those starting from the lowest base in terms of their initial conditions, which would require \nthat urban pupils experience the biggest density increases. A priori, this does not seem likely because \nif mean-reversion is a feature of our value-added measure then it is just as likely to be a feature of \nthe school density index. So, a pupil with a very low test score in a very high density Primary is most \nlikely to end up next time with a somewhat higher test score in a lower density Secondary, leading to \na negative correlation between the change in performance and change in density\n20\n. Nonetheless, we \ninvestigate this issue directly by repeating our empirical analysis separately for high and low age-11 \nachievers in high density Primary schools, and high and low age-11 achievers in low density Primary \nschools. Appendix Table A1 reports the findings from this exercise. For all four groups we find that \nan increase in school density is associated to higher value-added during Secondary school, which \nmakes it unlikely that mean reversion in pupil attainment accounts for our main findings. \nFinally, we consider whether our regressions – based on what happens to pupils on average – \nmask heterogeneity in school quality that belies our general point that urban schools are not \nsystematically failing. Perhaps there really are many ‘very bad’ schools in dense places, but these are \n                                                 \n20\n This intuition is borne out by our results. See Appendix Table A1. \n- 26 - \nmore than compensated by many ‘very good’ schools in similar areas. This argument implies that the \nvariance in school quality is higher amongst schools in dense urban settings, a point which we can \neasily test by regressing the square of our regression residuals (from the specification in Column (1) \nof Table 3) against the urban indicators and other regressors (i.e. an à la White’s test for \nheteroscedasticty). The results of this exercise suggest that there is no statistically significant link \nbetween urban density and the variance in attainment; the F-test on our three urban indicators yields \nan F(3,2816) statistic of 0.18, with a p-value of 0.9085. In other words, higher urban density seems \nto be associated with a rightwards-shift throughout the distribution of school quality\n21\n. \n5.6. Looking for an explanation: school choice and competition, resources or policy? \nIn the discussion so far, we have shown that pupils progress faster between ages 11 and 16 when \nthey move school from low to high density locations, and that they progress more slowly when the \nchange is in the other direction. The results in Section 5.4 also seemed to rule out explanations based \non better functioning urban teacher labour markets, deeper pools of competent teachers in urban \nsettings, and other broad urbanisation, or agglomeration-based explanations. The distances between \nPrimary and Secondary schools are simply not large enough for these explanations to make much \nsense; moreover we can detect a density impact on attainment amongst pupils moving short \ndistances, within Local Education Authorities, and within metropolitan areas. We have also ruled out \nstrategic course choice selection and selection of pupils with stronger attainment trends into schools \nin denser settings. Rather, we have emphasised that school density seems to be the driving factor \nbehind our findings. In what follows, we try to unpick what aspects of school density matter and \nwhy, and to consider the role of local educational policies. \nAlthough we argued that the inter-school distances over which we detect an effect are not large \nenough for these schools to be operating in distinct teacher labour markets, they can be operating in \n                                                 \n21\n A better test would use quantile regressions, but this proved infeasible given our model specifications and sample size. \n- 27 - \nzones facing very different markets in terms of pupils and competing or cooperating schools. Indeed, \ntransport costs dictate that actual enrolment patterns for schools are geographically based and quite \nlocalised, so two schools just a few kilometres apart in an urban environment may face very different \nsets of potential pupils and different schools with which they are effectively competing. Similarly, \ntwo such schools may be linked to entirely different networks of other schools with which they \ncooperate and share knowledge. Such networking and cooperation in professional development is a \nheavily promoted aspect of current Government educational policy, e.g. through the ‘Beacon’ \nschools initiative (described in Footnote 3) and so called Networked Learning Communities (NCSL \n[40]). The underlying story may thus be one in which school density – and the competition or \nnetworking opportunities that it engenders – is the driver behind the density-attainment link. \nWe provide some evidence that is supportive of this interpretation in the first column of Table \n6, where we split up the school density index into two components: the number of Primary schools \nwithin 2km and the number of Secondary schools. What is apparent here is that all the impact of the \nchange in density on the change in attainment between ages 11 and 16 arises through the number of \nneighbouring Secondary schools, not the number of local Primary schools. This is exactly what we \nwould expect if it is choice, competition or cooperation among co-located schools that matters for \nour results, because, when we include Primary school fixed effects, it is only variation in the density \nof schools near the Secondary school of destination that identifies the coefficient on school density. \nIf school markets matter, only the density of Secondary schools should be relevant at the Secondary \nphase. Primary schools do not provide competition, and are unlikely to be closely networked with \nSecondary schools. This result is robust to the inclusion of postcode and Primary school fixed effects \nin the two-way fashion detailed before (not reported in Table 6). \nPupils in denser locations may also perform better because schools in these locations are better \nresourced and are part of Government initiatives to encourage collaboration and boost performance. \nIndeed, a recent raft of Government policies has been targeted specifically at ‘failing’ inner city \n- 28 - \nschools in disadvantaged areas in an effort to raise attainments and improve other school-related \noutcomes. Others have found evidence of benefits arising from these policies (Machin, McNally, and \nMeghir [32]). Perhaps then, what we observe is the benefit to pupils attending schools in locations \nsubject to these policy initiatives? In Columns (2) and (3) of Table 6, we answer this question by \nadding some controls for basic school resources to our attainment models. These are average \nexpenditure per pupil within the Local Education Authority that funds schools, the number of \nqualified teachers in the school, plus indicators of whether or not the Secondary school comes under \nthe umbrella of various city-related educational policy programmes; these initiatives are: ‘Excellence \nin Cities’ (EiC), which puts additional money into areas facing disadvantages, and was rolled out \nover three phases in 1999, 2000 and 2001 followed by a ‘Clusters’ scheme focussed on group of \nschools from 2001 onwards; and ‘Education Action Zones’, which are groups of schools in \ndisadvantaged areas which receive extra funding, face tougher targets and receive other assistance. \nAdditionally, we control for the number of pupils enrolled at the school, mainly because school \nfunding in England is linked to pupil numbers. Looking at Table 6, the signs of the coefficients on \nthe resources variables in the attainment models are as expected and the impact of additional \nteachers is statistically significant, but the EiC and Education Action Zone dummies are insignificant \nand unsystematically signed (not reported). The specifications in Columns (2) and (3) are otherwise \ncomparable to those in the first column. Moving right across these three, it can be seen that the \nimpact of Secondary school density is unchanged after controlling for resource differences. Clearly, \ndifferences in resources matter, but are not responsible for the difference in pupil attainment between \ndense and less dense school locations. \nFinally, in Column (4), we investigate whether co-operation among near-by schools and \nnetworks of local professionals lie behind our correlations. To do so, we include in our specification \nvariables counting the number of ‘Beacon’ schools (separately for Primaries and Secondaries) within \n2km of the school. We also include a term counting the number of Independent (private) schools \n- 29 - \nwithin a 2km range from the school. This variable should shed some light on whether the \ncompetitive threat posed by a large number of local private institutions raises educational standards \nin the public sector (Epple and Romano [11] and Hoxby [24]). It is still the number of Secondary \nschools that has the strongest association with pupil educational progress, though we also find some \nlink between local Beacon schools and pupil achievement. However, this link is mainly through the \nnumber of Primary Beacons, which and a causal impact from networking with Beacon Primaries \nseems unlikely. Finally, the number of Independent schools does not enter our specification \nsignificantly. At least in this context, private school competition does not raise state-school average \nperformance. The link between the change in urban density and pupil educational progress during \nSecondary school seems primarily related the competition forces that are in place among closely co-\nlocated state Secondary schools, or cooperation of a different sort from that set up through the \nBeacon scheme.  \n6. Conclusions \nAlthough pupil attainment in dense urban places is low on average, this is not because urban \nenvironments disadvantage pupils but because disadvantaged pupils with low average attainments \nattend the most urbanised schools. Our results show that comparable pupils progress better in \nschools located in denser urban settings, where we measure urban density in terms of density of \nschools, continuous urban land cover and population density. Interestingly, amongst these three \nfactors, school density generally dominates as an explanatory factor.  \nOur results additionally show that progress during Secondary school is linked explicitly to the \ndensity of local Secondary schools and conditionally unrelated to Primary school density. We argue \nthis is indicative of localised educational effects related to inter-school competition or cooperation. \nWe have also shown that the density impact on attainment can be measured amongst pupils moving \nbetween schools in quite close proximity, within Local Education Authorities and within urban \nareas. For this reason, it seems unlikely that these density economies can be attributed to teacher \n- 30 - \nlabour markets or other sources of urbanisation and agglomeration advantages cited in the context of \nfirm productivity. \nFrom our estimates, we can derive the elasticity of pupil attainment with respect to school \ndensity. This is low – less than 0.02 – but it still implies that pupils educated in the most dense \nenvironments could gain around 2-3 percentiles in the national pupil attainment distribution relative \nto others in their cohort educated in the least dense settings. The urban educational advantage is \nquite substantial in relation to the total contribution of schools to pupil attainment, considering that \npupils in the top 1-in-10 schools in terms of attainment are, on average, only 20 percentiles above \npupils in the bottom 1-in-10 schools. In economic terms, a rough assessment based on the returns to \nadditional years of education would put the value of this attainment gap at up to 2% on average \nearnings\n22\n. Even so, the gains are not large enough to close the attainment gap between pupils \neducated in urban schools and students in more rural areas at the end of the Secondary compulsory \nphase. This gap is due to city schools enrolling children with serious background disadvantages \nrather than urban school ineffectiveness, so sensible urban educational policy should aim to identify \nand tackle the disadvantages that urban children carry with them to school. \nInterestingly, but perhaps just coincidentally, the elasticity of pupil achievement to school \ndensity is at the lower end of the range of estimates on the effects of urban size and density on firm \nproductivity, in the 0.03 to 0.08 range\n23\n. \n                                                 \n22\n Estimates of the returns to an additional year of education in Britain are typically 7-10%. The point system used to \nmeasure pupil progress in our data allows us to deduce that 1 percentile in the pupil distribution of attainment is roughly \nequivalent to 0.067 of a year’s educational progress during compulsory schooling. Assuming equal labour market returns \nat the intensive and extensive margins, this means that 1 percentile advantage is worth around 0.67% on earnings. \n23\n See Rosenthal and Strange [45] for an international survey, and Rice and Venables [43] and Graham [19] for British \nevidence. \n- 31 - \n7. References \n[1] J. Abowd, F. Kramarz, Econometric analyses of linked employer-employee data, Labour Economics 6 (1999) 53-74. \n[2] J. Abowd, F. Kramarz, D. Margolis, High wage workers and high wage firms, Econometrica 67 (1999) 251-333. \n[3] J. Abowd, R. Creecy, F. Kramarz, Computing person and firm effects using linked longitudinal employer employee \ndata, mimeo INSEE, 2002. \n[4] A. Briggs, S. Burgess, B. McConnel, H. Slater, School choice in England: Background facts, CMPO working paper, \n06\/159, 2006 \n[5] A. Chevalier, P. Dolton, S. McIntosh, Recruiting and retaining teachers in the UK: An analysis of graduate \noccupation choice from the 1960s to 1990s, CEE discussion paper 21, 2002. \n[6] C. Clotfelter, E. Glennie, H. Ladd, J. Vidgor, Would Higher Salaries Keep Teachers in High-Poverty Schools? \nEvidence From a Policy Intervention in North Carolina, NBER working paper 12285, 2006. \n[7] J. Cullen, B. Jacob, S. Levitt, The Effect of School Choice On Student Outcomes: Evidence From Randomized \nLotteries, NBER working paper 10113, 2003. \n[8] J. Cullen, B. Jacob, S. Levitt, The Impact of School Choice on Student Outcomes: An Analysis of the Chicago Public \nSchools, Journal of Public Economics 89 (2005) 729-60. \n[9] P. Dolton., W. van der Klaauw, Leaving teaching in UK: A duration analysis, Economic Journal 105 (1995) 431-444. \n[10] C. Emmerson, C. Frayne, S. McNally, O. Silva, Aimhigher: Excellence Challenge: A Policy Evaluation using the \nLabour Force Survey, mimeo CEP-LSE, 2006. \n[11] D. Epple, R. Romano, Competition Between Public and Private Schools: Vouchers and Peer Effects, American \nEconomic Review 88 (1998) 33-62. \n[12] GHK, A Review of Beacon innovation activities, report for Department for Education and Skills, Birmingham, \n2005. \n[13] S. Gibbons, S. Machin, O. Silva, Choice, Competition and Pupil Achievement, IZA discussion paper 2214, 2006. \n[14] S. Gibbons, O. Silva, Faith Schools: Better Schools or Better Pupils?, CEE discussion paper 72, 2006. \n[15] S. Gibbons, S. Telhaj, Peer effects and pupil attainment: Evidence from Secondary school transition, CEE \ndiscussion paper 63, 2006. \n[16] E. Glaeser, Are cities dying?, Journal of Economic Perspectives 12 (1998) 139-160. \n[17] E. Glaeser, M. Kahn, J. Rappaport, Why do the poor live in cities?, NBER working paper 7636, 2000. \n[18] Glennerster, H. (1991), “Quasi-Markets for Education”, The Economic Journal, 101, 1268-76. \n[19] D. Graham, Wider economic benefits of transport improvements: link between agglomeration and productivity, \nstage 2 report, Department of Transport, London, 2005. \n[20] E. Hanushek, The Failure of Input-Based Schooling Policies, Economic Journal 113 (2004) 64-98. \n[21] E. Hanushek, S.G. Rivkin, How to improve the supply of high quality teachers, in: D. Ravitch (Ed.), Brooking \nPapers on Education Policy, Brookings Institution Press, Washington, DC, 2004, pp. 7-25. \n[22] E. Hanushek, J.F. Kain, S.G. Rivkin, Why public schools lose teachers, Journal of Human Resources 39 (2004) 326-\n354. \n[23] E. Hanushek, J.F Kain, D.M. O’Brien, S.G. Rivkin, The market for teacher quality, NBER working paper 11154, \n2005. \n[24] C. Hoxby, Do Private Schools Provide Competition for Public Schools?, NBER working paper 4978, 1994. \n[25] C. Hoxby, Does Competition Among Public Schools Benefit Students and Taxpayers?, American Economic Review \n90 (2000) 1209-38. \n[26] C. Hoxby, School Choice and School Productivity (Or, Could School Choice be a Rising Tide that Lifts All Boats?), \nin: C. Hoxby (Ed.), The Economics of School Choice, University of Chicago Press, Chicago, IL,  2003. \n[27] C. Hoxby, School Choice and School Competition: Evidence from the United States, Swedish Economic Policy \n- 32 - \nReview 10 (2004) 11-67. \n[28] A. Krueger, Economic Considerations and Class Size, Economic Journal 113 (2003) 1-34. \n[29] A. Jaffe, M. Trajtenberg, R. Henderson, Geographical Localization of Knowledge Spillovers as Evidenced from \nPatent Citations, Quarterly Journal of Economics 108 (1993) 577-598. \n[30] V. Lavy, Performance pay and teachers’ effort, productivity and grading ethics, mimeo Hebrew University of \nJerusalem, 2005. \n[31] R. Lupton, Schools in disadvantaged areas: Recognizing context and raising quality, CASE discussion paper 76, \n2004.  \n[32] S. Machin, S. McNally, C. Meghir, Resource and standards in urban schools, mimeo CEP-LSE, 2005. \n[33] S. Machin, A. Vignoles, What’s the good of education? The economics of education in the United Kingdom, \nPrinceton University Press, Princeton, 2005. \n[34] A. Marshall, Principles of Economics, MacMillan, London, 1890. \n[35] A. Marshall, Principles of Economics, eighth edition, MacMillan, London, 1920. \n[36] R. Murnane, Improving urban public schools: suggestions for teacher union leaders, conference proceedings, \nFederal Reserve Bank of Boston (2002) 297-303. \n[37] R. Murnane, R. Olsen, The effects of salaries and opportunity costs on length of stay of teaching: Evidence from \nMichigan, Review of Economics and Statistics 71 (1989) 347-352. \n[38] R. Murnane, R. Olsen, The effects of salaries and opportunity costs on length of stay of teaching: Evidence from \nNorth Carolina, Journal of Human Resources 25 (1990) 106-124. \n[39] D. Neal, The effects of Catholic Secondary schooling on educational achievement, Journal of Labor Economics, 15 \n(1997) 98-123. \n[40] NCSL, What makes a network a learning network?, National College for School Leadership and Department of \nEducation and Skills, http:\/\/www.ncsl.org.uk\/networked\/networked-introduction.cfm accessed June 2006. \n[41] Ofsted (Office for Standards in Education), Improving city schools, London, 2000. \n[42] Ofsted (Office for Standards in Education) Access and achievement in urban education, London, 2003. \n[43] P. Rice, T. Venables, Spatial determinants of productivity: Analysis of the regions of Great Britain, CEP discussion \npaper 642, 2004. \n[44] S. Rosenthal, W. Strange, The determinants of agglomeration, Journal of Urban Economics 50 (2001) 191-229. \n[45] S. Rosenthal, W. Strange, Evidence on the nature and sources of agglomeration economies, in: V. Henderson, J.F. \nThisse (Eds.), Handbook of Regional and Urban Economics, Vol. 4, Elsevier, Amsterdam, 2004, pp. 2219-2171. \n[46] A. West, School choice: The limits of quasi regulation, Consumer Policy Review, 15 (2005) 94-98. \n- 33 - \n8. Figures \nFigure 1: Density of schools, illustrated for the London area \n \nNotes: Figure shows Kernel density estimates for total school density in the Greater London region and environs. In our estimates we use information for the whole of England. \n- 34 - \n9.  Tables \nTable 1: Descriptive statistics for age-16 sample \nVariable Mean Std.Dev. \nPercentile attainment at age 16 49.939 28.842 \nChange in percentile age 11-16 -0.029 22.852 \n   \nNumber of schools within 2km 10.089 7.445 \nProportion continuous urban within 2km 0.172 0.180 \nProportion suburban\/rural developed within 2km 0.300 0.139 \nPopulation density within 2km (per hectare) 26.554 19.328 \n   \nChange in number of schools within 2km 0.014 4.590 \nChange in proportion continuous urban within 2km -0.014 0.108 \nChange in proportion suburban\/rural developed within 2km 0.013 0.109 \nChange in population density within 2km -0.711 11.977 \n   \nNumber of Primary schools within 2km 7.836 6.136 \nNumber of Secondary schools within 2km 2.343 1.593 \nChange in number of Primary schools within 2km -0.322 3.850 \nChange in number of Secondary schools within 2km 0.352 1.316 \n   \nDistance between Primary and Secondary school (km) Mean = 6.594 \nMedian = 1.676 \ns.d. = 28.984 \ni.q.r. = 2.750 \n   \nNote: Sample size 1,202,970 based on pupils with non-missing data from age 11 to age 16 in non-selective Secondary schools, \nexcluding special needs schools. Population density is based on output areas of the 2001 Census and is in persons per hectare. Change \nin pupil percentile is non-zero because percentiles are calculated on sample of 1,202,566 pupils, with some missing data; pupil \nattainment percentile is based on total GCSE\/NVQ points at age 16 and test scores in Maths, Science and English tests at age 11. \nNumber of primary schools: approximately 14500. Number if secondary schools: approximately 2800. Number of LEAs: 147. \n \n- 35 - \n \nTable 2: Urbanisation and pupil attainment percentile age-16; various urban indicators \n Separate regressions for each urban indicator groups \n (1) (2) (3) \n Level Level Age-11 to 16 Diff. \nSchool density:    \nNumber of schools  \nwithin 2km \n-0.279 \n(0.029) \n-0.210 \n(0.029) \n0.139 \n(0.017) \n    \nProportion developed  within 2km:    \nContinuous urban -9.069 \n(1.158) \n-7.044 \n(1.176) \n  6.322 \n  (0.785) \nSuburban\/rural developed -10.857 \n(1.466) \n-9.668 \n(1.336) \n  0.494 \n  (0.728) \nPopulation:    \nPopulation density  \nwithin 2km \n-0.093 \n(0.012) \n-0.071 \n(0.011) \n  0.050 \n  (0.007) \n    \nPupil characteristics No Yes Yes \nPrimary school effects No No No \nSecondary school effects No No No \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary school \nin Columns 1 to 4; clustered on Local Education Authority in Column 5). Underline significant at 1% or better. Dependent variable is \npupil’s percentile attainment at age-16, or percentile gain from age 11 to age 16. Pupil controls are ethnicity (8 categories), entitlement \nfor free school meals, English as additional language, male. Models include year dummies. Level of urbanisation is proportion of 2km \nradius around school that is classified as continuous urban in 2000 (Landcover map 2000). Population density is persons per hectare \nbased on population and land areas of 2001 Census Output Areas for which centroid is within 2km of school. Sample size \napproximately 1.2million. Number of primary schools: approximately 14500. Number if secondary schools: approximately 2800. \nNumber of LEAs: 147. \n \n- 36 - \n \nTable 3: Urbanisation and percentile attainment gains; alternative one and two-way fixed-effects strategies \n (1) (2) (3) (4) \n Primary fixed \neffects only \nSecondary fixed \neffects only \nResidential postcode and \nPrimary \nResidential postcode and \nSecondary \nNumber of schools \nwithin 2km \n0.087 \n(0.037) \n0.100 \n (0.028) \n0.083 \n (0.032) \n0.098 \n(0.025) \nProportion urban  \nwithin 2km \n1.103 \n(1.440) \n4.530 \n(0.795) \n0.846 \n(1.289) \n3.056 \n(0.809) \nPopulation density  \nwithin 2km \n0.004 \n(0.015) \n-0.015 \n(0.010) \n0.008 \n(0.013) \n-0.016 \n(0.009) \n     \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary \nschools in Columns 1 and 3; clustered on LEAs in Columns 2 and 4). Underline significant at 1% or better. Italics significant at 5% or \nbetter. Dependent variable is pupil’s percentile attainment gain from age 11 to age 16. Controls are pupil ethnicity (8 categories), pupil \nentitlement to free meals, English as additional language, male dummy, year dummies, Community school dummy, Secondary school \naverage age-11 attainment (Columns 1 and 3 only). Proportion continuous urban is proportion of 2km radius around school that is \nclassified as continuous urban in 2000 (Landcover map 2000). Population density is persons per hectare based on population and land \nareas of 2001 Census Output Areas for which centroid is within 2km of school. Sample size approximately 1.2million (about 900,000 \nin Columns 3 and 4, where a minimum of two observations per postcode is needed). Number of primary schools: approximately 14500 \nin one way fixed effects models and 13200 in two way fixed effects models. Number if secondary schools: approximately 2800. \nNumber of LEAs: 147. \n- 37 - \n \nTable 4: Urbanisation and percentile attainment gains; geographical scope \n - (1) (2) (3) (4) (5) (6) (7) (8) \n Whole \nsample \nPrimary school \nlow-density \nPrimary school \nhigh-density \nShort distance \nmove \nLong distance \nmove \nMove not \nwithin London \nMove within \nLondon \nMove within \nLEA \nMove outside \nLEA \nNumber of \nschools  \nwithin 2km \n0.087 \n(0.037) \n0.075 \n(0.029) \n0.099 \n(0.029) \n0.062 \n(0.035) \n0.088 \n(0.023) \n0.073 \n(0.019) \n0.092 \n(0.036) \n0.073 \n(0.019) \n0.110 \n(0.029) \nProportion \nurban  \nwithin 2km \n1.103 \n(1.440) \n-1.183 \n(1.300) \n1.076 \n(0.936) \n0.288 \n(1.529) \n0.732 \n(0.885) \n1.672 \n(0.723) \n-2.945 \n(1.982) \n1.472 \n(0.712) \n-0.294 \n(1.193) \nPopulation \ndensity \n(per hectare)  \n0.004 \n(0.015) \n-0.011 \n(0.010) \n0.018 \n(0.011) \n0.004 \n(0.011) \n0.003 \n(0.009) \n-0.004 \n(0.007) \n0.045 \n(0.016) \n0.003 \n(0.007) \n0.005 \n(0.011) \n          \nSample 1201894 327949 274365 314728 302363 1049819 135130 1082839 119055 \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary school). Underline significant at 1% or better \n(Italics significant at 5%). Dependent variable is pupil’s percentile attainment gain from age 11 to age 16. Controls are pupil ethnicity (8 categories), entitlement to free school \nmeals, English as additional language, male dummy, Community school dummy, Secondary school average age-11 attainment, year dummies, Primary (age-11) school fixed \neffects. Proportion continuous urban is proportion of 2km radius around school that is classified as continuous urban in 2000 (Landcover map 2000). Population density is persons \nper hectare based on population and land areas of 2001 Census Output Areas for which centroid is within 2km of school. Low and high density refers to bottom (5) and top (13) \nquartile of schools within 2km. Long and short distance refers to bottom (<0.9km) and top (>3.6km) quartile of distance between Primary and Secondary school attended. \n- 38 - \n \nTable 5: Urbanisation and percentile attainment gains; robustness of results \n     (1)     (2)    (3)    (4)     (5) \n Percentiles based \non mean age-16 \npoints \nPercentiles  based on \nEnglish, Maths and \nScience only \nAcceleration in \nattainment,                  \nages 11-14-16 \nInstrumental \nvariable \nestimates \nInstrumental \nvariable \nestimates \nNumber of schools  \nwithin 2km \n0 .082 \n(0.017) \n0.057 \n(0.016) \n0.067 \n(0.024) \n0.205‡ \n(0.108) \n[0.122] \n0.181 \n(0.113) \n[0.123] \n      \nFirst Stage Statistics      \nF-Statistics - - -      210.40 \n (0.0000) \n    198.41 \n (0.0000) \nHansen Statistics \n(p-value) \n- - - 3.515 \n(0.319) \n2.740 \n (0.4335) \nPupil characteristics Yes Yes Yes Yes Yes \nPrimary school \neffects \nYes Yes Yes Yes Yes \nSecondary school \naverage peer \nachievement \nYes Yes Yes Yes Yes \nPostcode Area effects No No No No Yes \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary \nschool, expect Columns 5 and 6). Underline significant at 1% or better (‡ significant at 6%). Dependent variable is pupil’s percentile \ngains from age 11. Controls are pupil ethnicity (8 categories), entitlement to free school meals, English as additional language, male \ndummy, Community school dummy, Secondary school average age-11 attainment, year dummies. Sample size approximately \n1.2million (Columns 1 to 4). Instrumental variable in Columns 5 and 6 for London metropolitan area only; sample size about 140,000 \nobservations. Instruments are: residential postcode distance from closest tube station and to closest rail station within 2km, plus \ndummies for no rail station and no train station within 2km of residential postcode. Column 6 additionally controls for postcode area \nfixed effects. First stage statistics from models with standard errors clustered at the postcode level (p-values in round brackets); second \nstage standard errors clustered at postcode level in round brackets and at the Secondary school level in square brackets. \n \n- 39 - \n \n \nTable 6: Urbanisation and percentile attainment gains; resources, policy interventions and school competition \n (1) (2) (3) (4) \n All schools All schools All schools All schools \nNumber of state Secondary schools  \nwithin 2km \n0.363 \n(0.101) \n0.363 \n(0.101) \n0.374 \n(0.102) \n0.332 \n(0.109) \nNumber of state Primary schools  \nwithin 2km \n0.016 \n(0.044) \n0.005 \n(0.044) \n0.005 \n(0.045) \n-0.026 \n(0.046) \nNumber of qualified teachers (FTE) - 0.065 \n(0.017) \n0.066 \n(0.017) \n0.064 \n (0.017) \nNumber of pupils x100 (FTE) - -0.321 \n(0.104) \n-0.324 \n(0.104) \n-0.321 \n(0.103) \nExpenditure per pupil in  \nLocal Education Authority (£00s) \n- 0.080 \n(0.034) \n0.093 \n(0.041) \n0.074 \n (0.034) \nNumber of Beacon Secondary schools - - - 0.039 \n(0.306) \nNumber of Beacon Primary schools - - - 0.419 \n(0.160) \nNumber of Independent Secondary schools - - - -0.106 \n(0.083) \nNumber of Independent Primary schools - - - 0.037 \n(0.120) \n     \nUrban land cover and population density Yes Yes Yes Yes \nUrban school policies No No Yes No \nPrimary school fixed effects Yes Yes Yes Yes \n     \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary \nschool). Underline significant at 1% or better (Italics significant at 5%). Dependent variable is pupil’s percentile attainment gain from \nage 11 to age 16. Controls are pupil ethnicity (8 categories), entitlement to free school meals, English as additional language, male \ndummy, Community school dummy, Secondary school average age-11 attainment, year dummies, Primary (age-11) school fixed \neffects. FTE means full time equivalent. Column 4 also controls for whether current Secondary is a Beacon. Sample size \napproximately 1.2million. \n \n- 40 - \n10. Appendix: Additional Tables \n \nTableA1: Urbanisation and percentile attainment gains; mean reversion \n (1) (2) (3) (4) \n High Achievers, High \nDensity \nHigh Achievers, Low \nDensity \nLow Achievers, High \nDensity \nLow Achievers, Low \nDensity \nNumber of schools  \nwithin 2km \n0.174 \n(0.016) \n0.091 \n(0.019) \n0.109 \n(0.0167) \n0.054 \n(0.020) \n     \nAverage density change -1.508 1.596 -1.429 1.465 \n     \nPupil characteristics Yes Yes Yes Yes \nPrimary school effects Yes Yes Yes Yes \nSecondary school peer \nachievement \nYes Yes Yes Yes \n     \nSample 287972 322916 321791 269215 \nNote: Table reports regression coefficients from pupil level regressions. Standard errors in parentheses (clustered on Secondary \nschool). Underline significant at 1% or better (Italics significant at 5%). Dependent variable is pupil’s percentile attainment gain from \nage 11 to age 16. Controls are pupil ethnicity (8 categories), entitlement to free school meals, English as additional language, male \ndummy, Community school dummy, Secondary school average age-11 attainment, year dummies, Primary (age-11) school fixed \neffects. High and low achievers refer to bottom (<50) and top (>=50) half of the KS2 percentile distribution. High and low density \nrefers to bottom (<9) and top (>=9) half of school density distribution. \n- 41 - \n11. Appendix: Estimation of two-way fixed effects \nThe main challenge to estimating the two-way fixed effects models described by equation (3) in \nSection 3 is the large number of school and postcode fixed effects that need to be estimated or \nabsorbed, especially when we have a large number of pupil observations.  \nIn the data for England (described above) we have over 14,000 Primary schools, over 2,800 \nSecondary schools, around 500,000 postcodes, and data on over 1.2 million pupils. The simplest \napproach to estimating the full model would be to include either the 2,800+ Secondary school or the \n14,000+ Primary school dummies as regressors, and de-mean the data using a within-groups \ntransformation to eliminate home postcode fixed effects. Since this is infeasible on the full dataset of \npupils, we follow a procedure inspired by a series of papers by Abowd and co-authors (Abowd and \nKramarz [1], Abowd Kramarz, and Margolis [2], and Abowd, Creecy, and Kramarz [3]) for firm and \nindividual effects. Our approach involves, as a first stage, using this estimator on sub-groups (A) of \nthe full data set in order to estimate the postcode fixed effects for each sub-group. When this is \ncomplete, we use the full sample to re-estimate the model, using the either within-Primary or within-\nSecondary school transformation on a model that includes the postcode fixed effects estimated from \nthe first stage as a regressor.  \nMore formally, consider the case of Primary and residential postcode fixed effects; we estimate: \n\n\nˆ'ˆˆ\n,)''()(\n,\n,,,,\nl\nsk\nl\njk\nl\njkil\njki\nl\nsksk\nl\njkijk\nl\njkijki\nduyn\nAidduuyy\n\n\n \n(4) \n for all subgroups A (defined below); then, on the full data set: \njki\nj\nll\nj\njkijk\nj\njkijki nnuuyy ,,,, )ˆˆ()(  \n \n(5) \n- 42 - \nIdeally, each subgroup A would be defined such that that it includes all pupils living in a \nspecific set of postcodes R, who all attend Primary schools within a set P, to which no other pupils \n(other than those in R) are admitted. All the relevant postcode and Primary fixed effects could then \nbe estimated consistently for each of these ‘autarchic’ systems using only data from pupils in each \nsubgroup A.  \nIn practice, school admissions systems are not so cleanly defined, but the process of \nidentifying suitable groups is aided by the fact that admission in England is organised geographically \nby Local Education Authorities (LEAs). In most cases, pupils attending a school within a given LEA \ncome from neighbourhoods within that LEA, or from a closely neighbouring LEA. So we form sub-\ngroups A on an LEA-by-LEA basis and proceed using the following steps: \n(a) For a given LEA L, draw all pupils who live in the set of postcodes R in that LEA, plus all \npupils in a set Primary schools P which intersects the set R through pupil Primary school \nchoice, i.e. pupils in a set of postcodes Q outside the LEA L, going to the same set of \nPrimary schools P as pupils in R. \n(b) Estimate (4) on this sub-sample of pupils (sub-group A), using dummy variables for the \nPrimary schools P, allowing for postcode fixed effects for the postcode set R plus the set Q of \npostcodes that intersect with P through pupil Primary school choice, but are outside the LEA. \n(c) Retrieve estimates for the postcode fixed effects for the set R, i.e. lnˆ  in (4). \n(d) Repeated for each LEA until all postcode fixed effects have been estimated. \n(e) Estimate (5) using the full England sample and the estimated postcode effects from step (c). \nNote that this is an approximate method, because at step (b) we have not used data on all pupils in \nthe set of postcodes Q that are outside the LEA in order to compute the fixed effects Q. However, \nthese postcode fixed effects will be estimated consistently if pupils in the set Q P  are a random \n- 43 - \nsample of all pupils living in postcode Q. Moreover, we do not use the estimates of effects Q in the \nlast stage (e), but re-estimate them when we reach the LEA in which they are located during step (d). \nSo, the only concern is that not estimating Q correctly (i.e. on the full set of pupils living in those \npostcodes) may bias our estimates of the Primary school effects P, which in turn could affect our \nestimates of postcode effects R. We checked the sensitivity of our results to these sorts of problems \nby re-defining our group A in various ways, for example by excluding Q completely and using only \nthe sample of pupils in R. A similar method can be used to control for residential postcode and \nSecondary school fixed effects. \n \n"}