{"doi":"10.1109\/TIE.2007.892743","coreId":"54967","oai":"oai:eprints.lincoln.ac.uk:2312","identifiers":["oai:eprints.lincoln.ac.uk:2312","10.1109\/TIE.2007.892743"],"title":"Observer-based tuning of two-inertia servo-drive systems with integrated SAW torque transducers","authors":["O'Sullivan, T","Bingham, Chris","Schofield, N"],"enrichments":{"references":[{"id":18444525,"title":"A load torque compensation scheme under the speed measurement delay,”","authors":[],"date":"1998","doi":"10.1109\/41.681227","raw":"K. Hong, “A load torque compensation scheme under the speed measurement delay,” IEEE Trans. Ind. Electron., vol. 45, no. 2, pp. 283–290, Apr. 1998.","cites":null},{"id":18444522,"title":"Automatic identiﬁcation and damping torsional vibration in high-dynamic drives,” in","authors":[],"date":"2000","doi":"10.1109\/isie.2000.930512","raw":"J. M. Pacas, A. John, and T. Eutebach, “Automatic identiﬁcation and damping torsional vibration in high-dynamic drives,” in Proc. IEEE ISIE, Dec. 2000, vol. 1, pp. 201–206.","cites":null},{"id":18444516,"title":"Basic consideration of vibration suppression and disturbance rejection control of multi-inertia system using SFLAC (state feedback and load acceleration control),”","authors":[],"date":"1994","doi":"10.1109\/pccon.1993.264165","raw":"Y. Hori, H. Iseki, and K. Sugiura, “Basic consideration of vibration suppression and disturbance rejection control of multi-inertia system using SFLAC (state feedback and load acceleration control),” IEEE Trans. Ind. Appl., vol. 30, no. 4, pp. 889–896, Jul.\/Aug. 1994.","cites":null},{"id":18444528,"title":"Comparison of speed acquisition methods based on sinusoidal encoder signals,”","authors":[],"date":"2002","doi":null,"raw":"A. Baehr and P. Mutschler, “Comparison of speed acquisition methods based on sinusoidal encoder signals,” J. Electr. Eng., vol. 2, no. 1, Jan.–Jun. 2002, CD-ROM.","cites":null},{"id":18444513,"title":"Control System Design Guide.","authors":[],"date":"2004","doi":"10.1016\/b978-012237461-6\/50004-7","raw":"G. Ellis, Control System Design Guide. New York: Academic, 2004.","cites":null},{"id":18444518,"title":"Cures for mechanical resonance in industrial servo systems,” in","authors":[],"date":"2001","doi":"10.1016\/b978-012237472-2\/50012-2","raw":"G. Ellis, “Cures for mechanical resonance in industrial servo systems,” in Proc. PCIM, Jun. 2001, pp. 187–192.","cites":null},{"id":18444523,"title":"De Doncker, “Evaluation of advanced algorithms for suppression-control of drivetrain-oscillations in electric vehicles,” in","authors":[],"date":"2001","doi":null,"raw":"G. Gotting and R. W. De Doncker, “Evaluation of advanced algorithms for suppression-control of drivetrain-oscillations in electric vehicles,” in Proc. EVS-18, Oct. 2001, CD-ROM.","cites":null},{"id":18444529,"title":"Dynamic rotary torque measurement using surface acoustic waves,”","authors":[],"date":"2001","doi":null,"raw":"A. Lonsdale, “Dynamic rotary torque measurement using surface acoustic waves,” Sensors, vol. 18, no. 10, pp. 51–56, 2001.","cites":null},{"id":18444533,"title":"Feedback Control of Dynamic Systems. Englewood Cliffs,","authors":[],"date":"2002","doi":null,"raw":"G. Franklin, J. D. Powell, and A. Emami-Naeini, Feedback Control of Dynamic Systems. Englewood Cliffs, NJ: Prentice-Hall, 2002. Timothy M. O’Sullivan received the M.Eng. degree in 2000 from the Department of Electronic and Electrical Engineering, University of Shefﬁeld, Shefﬁeld, U.K.,whereheiscurrentlyworkingtowardthePh.D. degree. His Ph.D. thesis is on the use of surface acoustic wave (SAW) torque transducers for improving the dynamic response of industrial servo-drive systems.O’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1091 Christopher M. Bingham (M’00) received the B.Eng. degree in electronic systems and control engineering from Shefﬁeld City Polytechnic, Shefﬁeld, U.K.,in1989,theM.Sc.(Eng.)degreeincontrolsystems engineering from the University of Shefﬁeld, Shefﬁeld, in 1990, and the Ph.D. degree from Cranﬁeld University, Bedfordshire, U.K., in 1994, for research on control systems to accommodate nonlinear dynamic effects in aerospace ﬂight-surface actuators. He was a Post-Doctoral Researcher at Cranﬁeld University until subsequently taking up a research position at the University of Shefﬁeld. Since 1998, he has been a Lecturer in the Department of Electronic and Electrical Engineering, University of Shefﬁeld. His current research interests include traction control\/ antilock braking systems for electric vehicles,electromechanicalactuationofﬂightcontrolsurfaces,controlofactive magnetic bearings for high-speed machines, sensorless control of brushless machines, and analysis and design of resonant converter systems. Nigel Schoﬁeld received the B.Eng. degree in electrical power engineering and the Ph.D. degree on the ﬁeld weakening of brushless permanent-magnet traction machines from the University of Shefﬁeld, Shefﬁeld, U.K., in 1990 and 1997, respectively. From 1993 to 1995, he was a Senior Experimental Ofﬁcer in the Department of Electronic and Electrical Engineering (EEE) before taking up the post of Design Engineer in industry. From 1997 to 2000, he was a Post-Doctoral Researcher in the Electrical Machines and Drives Research Group, Department of EEE, University of Shefﬁeld, and from 2000 to 2004, a Lecturer in the same department.OnJuly1,2004,hewasappointedtoaMechatronicsLectureshipat the School of Electrical and Electronic Engineering, University of Manchester, Manchester, U.K. His research interests include electromagnetic power trains for all- and hybrid-electric vehicles, the vehicular application of hydrogen fuel cell systems, aerospace machines and actuators, and industrial applications of electromagnetic devices.","cites":null},{"id":18444510,"title":"High-performance control of dual-inertia servo-drive systems using low-cost integrated SAW torque transducers,”","authors":[],"date":"2006","doi":"10.1109\/tie.2006.878311","raw":"T. M. O’Sullivan, N. Schoﬁeld, and C. M. Bingham, “High-performance control of dual-inertia servo-drive systems using low-cost integrated SAW torque transducers,” IEEE Trans. Ind. Electron., vol. 53, no. 4, pp. 1226–1237, Jun. 2006.","cites":null},{"id":18444515,"title":"Kalman ﬁlter and LQ based speed controller for torsional vibration suppression in a 2-mass motor drive system,”","authors":[],"date":"1995","doi":"10.1109\/41.475496","raw":"J. K. Ji and S. K. Sul, “Kalman ﬁlter and LQ based speed controller for torsional vibration suppression in a 2-mass motor drive system,” IEEE Trans. Ind. Electron., vol. 42, no. 6, pp. 564–571, Dec. 1995.","cites":null},{"id":18444521,"title":"LQG based speed controller for torsional vibration suppression in 2-mass motor drive system,” in","authors":[],"date":"1993","doi":"10.1109\/iecon.1993.339166","raw":"J. Keun, J. Dong, C. Lee, and S. K. Sul, “LQG based speed controller for torsional vibration suppression in 2-mass motor drive system,” in Proc. IEEE IECON, Nov. 1993, vol. 2, pp. 1157–1162.","cites":null},{"id":18444514,"title":"Observers in Control Systems: A Practical Guide.N e w Y o r k :","authors":[],"date":"2002","doi":"10.1016\/b978-012237472-2\/50002-x","raw":"——, Observers in Control Systems: A Practical Guide.N e w Y o r k : Academic, 2002.","cites":null},{"id":18444527,"title":"Performance evaluation of velocity observer for accurate estimation of servo motor drives,”","authors":[],"date":"2000","doi":"10.1109\/28.821803","raw":"S.-M. Yang and S.-J. Ke, “Performance evaluation of velocity observer for accurate estimation of servo motor drives,” IEEE Trans. Ind. Appl., vol. 36, no. 1, pp. 98–104, Jan.\/Feb. 2000.","cites":null},{"id":18444519,"title":"Resonant load control methods for industrial servo drives,” in","authors":[],"date":"2000","doi":"10.1109\/ias.2000.882073","raw":"G. Ellis and R. D. Lorenz, “Resonant load control methods for industrial servo drives,” in Proc. IEEE IAS Annu. Meeting, Oct. 2000, vol. 3, pp. 1438–1445.","cites":null},{"id":18444524,"title":"Sensitivity analysis of state variable estimators for two-mass drive system,”","authors":[],"date":"2004","doi":"10.1016\/j.neucom.2009.04.016","raw":"T. Orlowska-Kowalska and K. Szabat, “Sensitivity analysis of state variable estimators for two-mass drive system,” Acta Electrotech. Inform., vol. 4, no. 1, 2004, CD-ROM.","cites":null},{"id":18444531,"title":"Slow resonance ratio control for vibration suppression and disturbance rejection in torsional system,”","authors":[],"date":"1999","doi":"10.1109\/41.744407","raw":"Y. Hori, H. Sawada, and Y. Chun, “Slow resonance ratio control for vibration suppression and disturbance rejection in torsional system,” IEEE Trans. Ind. Electron., vol. 46, no. 1, pp. 162–168, Feb. 1999.","cites":null},{"id":18444530,"title":"Speed control of a two-inertia system by PI\/PID control,”","authors":[],"date":"2000","doi":"10.1109\/peds.1999.794627","raw":"G. Zhang and J. Furusho, “Speed control of a two-inertia system by PI\/PID control,” IEEE Trans. Ind. Electron., vol. 47, no. 3, pp. 603–609, Jun. 2000.","cites":null},{"id":18444520,"title":"Suppression of torsional oscillations in a high performance speed servo drive,”","authors":[],"date":"1998","doi":"10.1109\/41.661311","raw":"S. N. Vukosavic and M. R. Stojic, “Suppression of torsional oscillations in a high performance speed servo drive,” IEEE Trans. Ind. Electron., vol. 45, no. 1, pp. 108–117, Feb. 1998.","cites":null},{"id":18444532,"title":"The control techniques drives and controls handbook,”","authors":[],"date":"2001","doi":"10.1049\/pbpo057e","raw":"B. Drury, “The control techniques drives and controls handbook,” in IEE Power and Energy Series 35. Stevenage, U.K.: Inst. Electr. Eng., 2001.","cites":null},{"id":18444517,"title":"Torsional vibration suppression control in 2-mass system by state feedback speed controller,” in","authors":[],"date":"1993","doi":"10.1109\/cca.1993.348293","raw":"S. H. Song, J. K. Ji, S. K. Sul, and M. H. Park, “Torsional vibration suppression control in 2-mass system by state feedback speed controller,” in Proc. 2nd IEEE CCA, Sep. 1993, vol. 1, pp. 129–134.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-04","abstract":"This paper proposes controller design and tuning\\ud\nmethodologies that facilitate the rejection of periodic load-side disturbances applied to a torsional mechanical system while simultaneously compensating for the observer’s inherent phase delay. This facilitates the use of lower-bandwidth practically realizable disturbance observers. The merits of implementing full- and reduced-order observers are investigated, with the latter being implemented with a new low-cost servo-machine-integrated highband width\\ud\ntorque-sensing device based on surface acoustic wave\\ud\n(SAW) technology. Specifically, the authors’ previous work based on proportional–integral–derivative (PID) and resonance ratio control (RRC) controllers (IEEE Trans. Ind. Electron., vol. 53, no. 4, pp. 1226–1237, Aug. 2006) is augmented with observer disturbance feedback. It is shown that higher-bandwidth disturbance observers are required to maximize disturbance attenuation over the low-frequency band (as well as the desired rejection frequency), thereby attenuating a wide range of possible frequencies. In such cases, therefore, it is shown that the RRC controller is\\ud\nthe preferred solution since it can employ significantly higher observer bandwidth, when compared to PID counterparts, by virtue of reduced noise sensitivity. Furthermore, it is demonstrated that the prototype servo-machine-integrated 20-N · mSAWtorque transducer is not unduly affected by machine-generated electromagnetic\\ud\nnoise and exhibits similar dynamic behavior as a\\ud\nconventional instrument inline torque transducer","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54967.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2312\/1\/tim_observer_based.pdf","pdfHashValue":"8248bbdfd2e92ba7d9c0e90aab3e7024407a7666","publisher":"IEEE Industrial Electronics Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2312<\/identifier><datestamp>\n      2014-08-28T09:24:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2312\/<\/dc:relation><dc:title>\n        Observer-based tuning of two-inertia servo-drive systems with integrated SAW torque transducers<\/dc:title><dc:creator>\n        O'Sullivan, T<\/dc:creator><dc:creator>\n        Bingham, Chris<\/dc:creator><dc:creator>\n        Schofield, N<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        This paper proposes controller design and tuning\\ud\nmethodologies that facilitate the rejection of periodic load-side disturbances applied to a torsional mechanical system while simultaneously compensating for the observer’s inherent phase delay. This facilitates the use of lower-bandwidth practically realizable disturbance observers. The merits of implementing full- and reduced-order observers are investigated, with the latter being implemented with a new low-cost servo-machine-integrated highband width\\ud\ntorque-sensing device based on surface acoustic wave\\ud\n(SAW) technology. Specifically, the authors’ previous work based on proportional–integral–derivative (PID) and resonance ratio control (RRC) controllers (IEEE Trans. Ind. Electron., vol. 53, no. 4, pp. 1226–1237, Aug. 2006) is augmented with observer disturbance feedback. It is shown that higher-bandwidth disturbance observers are required to maximize disturbance attenuation over the low-frequency band (as well as the desired rejection frequency), thereby attenuating a wide range of possible frequencies. In such cases, therefore, it is shown that the RRC controller is\\ud\nthe preferred solution since it can employ significantly higher observer bandwidth, when compared to PID counterparts, by virtue of reduced noise sensitivity. Furthermore, it is demonstrated that the prototype servo-machine-integrated 20-N · mSAWtorque transducer is not unduly affected by machine-generated electromagnetic\\ud\nnoise and exhibits similar dynamic behavior as a\\ud\nconventional instrument inline torque transducer.<\/dc:description><dc:publisher>\n        IEEE Industrial Electronics Society<\/dc:publisher><dc:date>\n        2007-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2312\/1\/tim_observer_based.pdf<\/dc:identifier><dc:identifier>\n          O'Sullivan, T and Bingham, Chris and Schofield, N  (2007) Observer-based tuning of two-inertia servo-drive systems with integrated SAW torque transducers.  IEEE Transactions on Industrial Electronics, 52  (2).   pp. 1080-1091.  ISSN 0278-0046  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TIE.2007.892743<\/dc:relation><dc:relation>\n        10.1109\/TIE.2007.892743<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2312\/","http:\/\/dx.doi.org\/10.1109\/TIE.2007.892743","10.1109\/TIE.2007.892743"],"year":2007,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Article","PeerReviewed"],"fullText":"1080 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nObserver-Based Tuning of Two-Inertia Servo-Drive\nSystems With Integrated SAW Torque Transducers\nTimothy M. O’Sullivan, Christopher M. Bingham, Member, IEEE, and Nigel Schofield\nAbstract—This paper proposes controller design and tuning\nmethodologies that facilitate the rejection of periodic load-side\ndisturbances applied to a torsional mechanical system while simul-\ntaneously compensating for the observer’s inherent phase delay.\nThis facilitates the use of lower-bandwidth practically realizable\ndisturbance observers. The merits of implementing full- and\nreduced-order observers are investigated, with the latter being\nimplemented with a new low-cost servo-machine-integrated high-\nbandwidth torque-sensing device based on surface acoustic wave\n(SAW) technology. Specifically, the authors’ previous work based\non proportional–integral–derivative (PID) and resonance ratio\ncontrol (RRC) controllers (IEEE Trans. Ind. Electron., vol. 53,\nno. 4, pp. 1226–1237, Aug. 2006) is augmented with observer\ndisturbance feedback. It is shown that higher-bandwidth distur-\nbance observers are required to maximize disturbance attenuation\nover the low-frequency band (as well as the desired rejection fre-\nquency), thereby attenuating a wide range of possible frequencies.\nIn such cases, therefore, it is shown that the RRC controller is\nthe preferred solution since it can employ significantly higher\nobserver bandwidth, when compared to PID counterparts, by\nvirtue of reduced noise sensitivity. Furthermore, it is demonstrated\nthat the prototype servo-machine-integrated 20-N · m SAW torque\ntransducer is not unduly affected by machine-generated elec-\ntromagnetic noise and exhibits similar dynamic behavior as a\nconventional instrument inline torque transducer.\nIndex Terms—Filter noise, motion control, motor drives, ob-\nservers, resonance, state feedback, surface acoustic wave (SAW)\ndevices, velocity control.\nNOMENCLATURE\nJm Motor inertia (in kilogram square meters).\nJd Load inertia (in kilogram square meters).\nKmd Interconnecting shaft stiffness (in newton meters per\nradian).\nR Inertia ratio Jd\/Jm.\nJ˜m “Virtual” motor inertia (in kilogram square meters).\nR˜ “Virtual” inertia ratio.\nte Controller output electromagnetic torque demand (as-\nsumed to be equivalent to actual electromagnetic torque;\nin newton meters).\ntd Load-side torque (in newton meters).\nManuscript received December 21, 2005; revised October 2, 2006. Abstract\npublished on the Internet January 14, 2007. This work was supported in part by\nthe U.K. Engineering and Physical Sciences Research Council (EPSRC) and in\npart by Sensor Technology Ltd., Banbury, U.K.\nT. M. O’Sullivan and C. M. Bingham are with the Electrical Machines and\nDrives Group, Department of Electronic and Electrical Engineering, University\nof Sheffield, Sheffield S10 2TN, U.K. (e-mail: c.bingham@sheffield.ac.uk).\nN. Schofield is with the Department of Electrical Engineering and Electron-\nics, University of Manchester, Manchester M13 9PL, U.K.\nColor versions of one or more of the figures in this paper are available online\nat http:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/TIE.2007.892743\ntmd Torsional shaft torque (in newton meters).\nωn Mechanical resonant frequency (in radians per second).\nωa Mechanical antiresonant frequency (in radians per\nsecond).\nωm Motor angular velocity (in radians per second).\nωd Load angular velocity (in radians per second).\nωq Motor or load angular velocity (when motor and load\ninertias are connected via an infinitely stiff shaft; in\nradians per second).\nωr Reference angular velocity (in radians per second).\nωx Load-side closed-loop tracking bandwidth (in radians\nper second).\nKp Proportional gain.\nKi Integral gain.\nKd Derivative gain.\nKs Proportional shaft torque gain.\nKa Derivative shaft torque gain.\nKpd Proportional disturbance torque gain.\nKdd Derivative disturbance torque gain.\nωrj Rejection frequency (in radians per second).\nxm Measured state variables.\nxe State variables that need to be observed.\nxˆe Observed state variables.\ntˆd Observed load torque (in newton meters).\nG Observer gain matrix.\nωob Observer −3 dB bandwidth (in radians per second).\nI. INTRODUCTION\nLOW-FREQUENCY periodic disturbances to servo controlsystems are a common feature of industrial automation\nsystems. By way of example, web handling, where the material\nis unwound from a roll, processed (coating layer, cutting, etc.),\nand wound back onto another roll, often creates an increasingly\nelliptical roll profile that loads the servo system in a cyclic\nmanner [2]—the frequency being determined by the rotational\nspeed of the wind, which changes with the amount of material\non the roll in order to maintain a constant web tension. To ad-\ndress such difficulties, it is common to increase the aggressive-\nness of the servo-drive control action to overcome any tendency\nto deviate from a reference demand. However, constrained\ncontrol structures commonly employed in commercial servo-\ndrive systems, along with limited power capability and stability\nmargins, place upper limits on the achievable regulation and\ntracking performance. An alternative is to feed a measurement\nof load disturbance directly into the power converter (servo\namplifier) to provide a countering torque, thereby compensating\nfor the disturbance [2]–[7]—commonly referred to as feedfor-\nward disturbance decoupling.\n0278-0046\/$25.00 © 2007 IEEE\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1081\nRejection of periodic load disturbances in this manner consti-\ntutes a classical control problem when the torsional mechanical\nsystem interconnecting the motor and load can be considered\ninfinitely stiff, and dynamic load perturbations can be measured\nor estimated to a sufficiently high bandwidth, via a simple\nrigid-body observer [8]. In the majority of cases, however, me-\nchanical systems often exhibit low-frequency resonant behavior\nwith a fundamental frequency of < 300 Hz [9], load torque\ncannot be directly measured, due to either cost or environmental\nlimitations, and recourse to controllers employing higher-order\nobservers (termed disturbance observer) that provide a real-\ntime dynamic estimate of the disturbance is made [2]–[6],\n[10]–[13]. For the sake of simplifying the theoretical analysis,\nstate observer dynamics are assumed to be of sufficiently high\nbandwidth that they can be ignored. However, since feedfor-\nward compensation is applied directly into the servo amplifier,\nits effectiveness is heavily dependent on the ability of the\ndisturbance observer to provide a sufficiently high-bandwidth\ndelay-free estimate of load, since phase delays significantly\nimpede the ability of the controller to compensate effectively,\nand compromise stability [3], [14]. An unfortunate feature of\nclassical observer schemes is that they are inherently deriva-\ntive in nature (i.e., they amplify high-frequency sensor noise),\nand those employed for industrial motion-control applications\n(where a quantized position signal from an encoder is normally\nemployed) are therefore forced to have significant bandwidth\nconstraints, which is usually < 100 Hz [9] in order to attenuate\nhigh-frequency noise, unmodeled resonant modes, and com-\npensate for additional measurement delays [2], [3], [14], [15].\nMoreover, in such cases, the dynamics imparted by the use\nof a relatively low-bandwidth observer unduly influences the\nsystem dynamics, which ultimately affects the desired rejec-\ntion performance [2], [3], [14]. Consequently, more complex\nKalman state estimators have been proposed [4], [10], [13],\nwhere the unmodeled dynamics and noise are lumped together\nand modeled as a Gaussian process. Nevertheless, in practical\nsystems, other characteristics that cannot be modeled by a white\nnoise covariance are inevitably present [9], [16], such as reso-\nnant peaks and\/or speed-dependent mechanical eccentricities,\nas well as signal contamination from power-converter high-\nfrequency switching harmonics. Furthermore, the use of these\nis computationally expensive, and therefore, recently, emphasis\nhas returned to the use of classical observer structures and\nmethodologies to provide maximum benefit by appropriate gain\ndesign. However, few algorithms that compensate for the lim-\nitations imparted by a relatively low-bandwidth observer exist,\nparticularly in high-performance motion-control applications.\nUntil recently, difficulties in acquiring reliable low-noise\nlow-cost shaft torque transducers that are noninvasive to the me-\nchanical drive system have precluded the use of measured shaft\ntorque feedback for disturbance rejection in all but a minority of\nspecialized closed-loop servo-drive systems. Often, commonly\nemployed torque transducers, viz., strain gauge and optical and\ninductive devices, are too mechanically compliant when incor-\nporated in a drive system, thereby degrading stability margins\nand reducing closed-loop bandwidth. Moreover, the additional\ncost associated with their integration is prohibitive. Surface\nacoustic wave (SAW) devices are mechanically robust, exhibit\nFig. 1. PMSM with integrated 20-N · m SAW torque transducer. (a) Illustra-\ntion of the servo machine showing the location of SAW devices and RF module.\n(b) Prototype servo machine.\nFig. 2. Mechanical schematic. (a) Two-inertia representation of a servo-drive\nsystem. (b) Control block diagram.\nhigh sensitivity and bandwidth, and are largely unaffected by\nelectromagnetic noise. They can be directly integrated into an\nelectrical machine assembly without significantly affecting the\nmechanical stiffness of the motor shaft. For the study, SAW\ndevices and RF modules are mounted inside a commercial off-\nthe-shelf permanent-magnet synchronous machine (PMSM),\ndirectly onto the motor shaft between the front bearing and the\nrotor magnets, as illustrated in Fig. 1. Additionally, Fig. 1(b)\nshows the prototype PMSM with embedded SAW torque trans-\nducer and measurement display\/output unit.\nHere then, an investigation into improved tuning methodolo-\ngies for the design of classical control schemes, particularly\nproportional–integral–derivative (PID) and resonance ratio con-\ntrol (RRC), including the use of disturbance observers, is pre-\nsented along with an appraisal of their relative attributes when\nused with appropriate sensing technologies.\nII. GENERAL CONTROLLER STRUCTURE\nTypically, a mechanical motor\/load servo-drive system ex-\nhibits a fundamental resonant mode of < 300 Hz [9], which\noften overlaps with the closed-loop bandwidth imposed by\nthe servo-drive control algorithm. In such cases, the servo-\ndrive system can be modeled using a two-inertia approximation\n[1]–[14], [16], [18], [19]. Fig. 2(a) shows a schematic of a two-\ninertia servo-drive system consisting of two lumped inertias\nJm and Jd, which represent the motor and load, respectively,\ncoupled via a shaft of finite stiffness Kmd that is subject to\n1082 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nFig. 3. Controllers for a two-inertia mechanical model. (a) Classical PI controller. (b) Extended PI controller augmented with feedback of additional state\nvariables.\ntorsional torque tmd and excited by a combination of elec-\ntromagnetic torque te and load torque perturbations td. The\nmotor angular velocity is denoted ωm, and the load velocity is\ndenoted ωd. Since damping losses are usually considered to be\nrelatively low, they are neglected without significantly affecting\nthe accuracy of the forgoing analysis [1]–[14], [16], [18], [19].\nFig. 2(b) shows a dynamic block diagram representation of the\nsystem from which transfer functions describing the relation-\nships between the electromagnetic torque produced by the servo\nmachine, and the machine rotor angular velocity (1) and the\nload angular velocity (2), are obtained as\nωm(s)\nte(s)\n=\ns2 + ω2a\nJms3 + Jmω2ns\n(1)\nωd(s)\nte(s)\n=\nω2a\nJms3 + Jmω2ns\n(2)\nwhere the antiresonant frequency ωa and the resonant frequency\nωn are defined as\nωa =\n√\nKmd\n(\n1\nJd\n)\n(3)\nωn =ωa\n√\nR+ 1 (4)\nand the load-to-motor inertia ratio is\nR =\nJd\nJm\n. (5)\nFig. 3(a) shows a proportional and integral (PI)-type con-\ntrol structure and two-inertia mechanical model. It should be\nnoted that this control structure is equivalent to the classical\nPI controller, i.e., the closed-loop poles are identical in both\ncases. However, for the proposed structure, the closed-loop\ntransfer function from ωd\/ωr (the tracking response) does not\ncontain closed-loop zeros. This has the advantage of allowing\nthe tracking response to be completely defined by the location\nof the closed-loop poles. Moreover, the dynamics of the servo-\namplifier current controller, which are governed primarily by\ndelay time and −3-dB bandwidth, are assumed to be suffi-\ncient to have negligible effect on system response, thereby\nallowing the servo amplifier to be modeled by a unity gain,\nas shown in Fig. 3(a). A key limiting factor for raising the\ndynamic bandwidth of the two-inertia system is, ultimately, the\nresponse of the speed loop, which is limited by mechanical\nresonances and the attributes of the position feedback sensor, by\nthe effects of noise injection (since estimated angular velocity\nand acceleration are generally obtained from the derivative and\ndouble derivative of quantized position) and sensor resonance\ninduced by the physical mounting of the sensor to the motor\n(not specifically considered herein) [20].\nBy augmenting the basic controller with the feedback of\nadditional state variables, enhanced disturbance rejection per-\nformance can be achieved [1]–[12], [18], [19]. The general\nstructure of such an extended controller is shown in Fig. 3(b),\nwhere G(s) is the transfer function describing the relation-\nship between the observed tˆd and the actual load torque td,\nand Kpd and Kdd are the associated transfer feedback gains.\nFurthermore, Ks and Kd represent the transfer feedback gains\nassociated with shaft torque and the estimated motor acceler-\nation feedback (from second derivative of angular position),\nrespectively. For example, setting Kpd, Kdd, and Kd to zero\nprovides a PI controller with shaft torque feedback, referred to\nas RRC [1]. Alternatively, setting Kpd, Kdd, and Ks to zero\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1083\nprovides a classical PID control scheme [18] (i.e., employed\nwhen shaft torque feedback is not available). Notably, the\nresonant frequency of the experimental mechanical system is\n≈110 Hz, and the SAW torque sensor and associated electronics\nexhibit −3 dB > 2 kHz [1]. It is therefore assumed that the\nmeasured and real shaft torque are identical over the frequency\nof interest.\nBoth RRC and PID controller structures can be implemented\nwith the addition of disturbance feedback by setting the dis-\nturbance gains Kpd and Kdd to a nonzero value, i.e., when\nKpd = Kdd = 0, the disturbance feedback is inactive. By suit-\nable manipulation and assuming that the disturbance torque\n(as apposed to shaft torque) could be measured with a high-\nbandwidth sensor, i.e., G(s) = 1\nωd\ntd\n=\n(\nJ˜ms\n3+(Kp−KmdKdd)s2+(Ki+Kmd(1−Kpd)s\n)\n\/Jd\nJ˜ms4+Kps3+\n(\nJ˜mω2a(1+R˜)+Ki\n)\ns2+Kpω2as+Kiω2a\n(6)\nmodels the regulation dynamics imposed by the PID controller\nwith measured disturbance feedback, where J˜m = Jm +Kd,\nand R˜ = Jd\/J˜m. Furthermore, (7), which is shown at the\nbottom of the page, models the regulation dynamics imposed\nby the RRC controller with measured disturbance feedback,\nwhere J˜m = Jm, and R˜ = R(1 +Ks). The numerators of the\nregulation dynamics describe the assignment of the closed-loop\ntransmission zeros. If, at a particular frequency, the numerator\nequation is equal to zero, the transmission of a torque pertur-\nbation at that frequency is effectively blocked, i.e., completely\nrejected from the load speed. However, without disturbance\nfeedback, when Kpd = Kdd = 0, the assignment of zeros is\nsimultaneously dependent on the assignment of the closed-loop\npoles by the choice of Kp, Ki, and Kd for the PID, and Kp,\nKi, and Ks for the RRC controller. The inclusion of distur-\nbance feedback provides sufficient flexibility to independently\nassign the closed-loop zeros in the regulation dynamics without\naffecting the location of the closed-loop poles, since Kpd and\nKdd only appear in the numerator of (6) and (7). By adjusting\nthese gains, a pair of complex conjugate zeros are assigned to\nthe imaginary axis (no damping) for a user-defined frequency\nωrj , thereby rejecting periodic load-side disturbances at that\nfrequency.\nThe required disturbance torque gains for both PID and RRC\ncontrollers are given by\nKpd =\nKmd(1 +Ks)− ω2rj J˜m +Ki\nKmd\n(8)\nKdd =\nKp\nKmd\n(9)\nTABLE I\nPID AND RRC CONTROLLER GAINS FOR OPTIMAL LOAD-SIDE\nTRACKING PERFORMANCE\nwhere Ks = 0 and J˜m = Jm +Kd for the PID controller, and\nJ˜m = Jm for the RRC controller.\nThe closed-loop poles in (6) and (7) cannot be freely assigned\nsince there are only three adjustable control parameters to\nchange the four poles of the closed-loop denominator. However,\ngood damping performance and closed-loop bandwidth can be\nachieved [1] by assigning the closed-loop poles according to the\ncoefficients of the optimal fourth-order polynomial, as defined\nby the integral of time multiplied by absolute error (ITAE)\nperformance index using the gains in Table I [1].\nIII. EXTENDED OBSERVER-BASED CONTROL STRUCTURES\nA. Practical Disturbance Observer\nFor systems subject to periodic disturbances that cannot\nbe directly sensed, the extended control schemes in Fig. 3(b)\ncan be employed based on observer structures. Assuming the\ndisturbance torque to be a state variable that is slowly time\nvarying, implying that dtd\/dt→ 0, a simple augmented state\ncan be used to model the disturbance that is subsequently\nestimated by the observer, i.e.,\n(10)\nAlthough many techniques can be used to assign the state-\nerror convergence dynamics, the method attributed to Gopinath\n[5], [21] is employed here for simplicity. The state vector is\npartitioned into two parts, i.e.,[\nx˙m\nx˙e\n]\n=\n[\nA11 A12\nA21 A22\n]\n·\n[\nxm\nxe\n]\n+\n[\nB1\nB2\n]\nu (11)\nωd\ntd\n=\n(\nJms\n3 + (Kp −KmdKdd)s2 + (Ki +Kmd(1 +Ks −Kpd)) s\n)\n\/Jd\nJms4 +Kps3 +\n(\nJmω2a(1 + R˜) +Ki\n)\ns2 +Kpω2as+Kiω2a\n(7)\n1084 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nFig. 4. Block diagram representation of the observer structure.\nwhere xm represents directly measured states, i.e., xm = y,\nwhere y is the vector of measurable plant outputs, and xe\nrepresents the remaining states that need to be observed. In the\ncase of the PID controller, only the motor speed ωm is sensed,\nand the required partitions are represented by dotted lines in\n(10). For the RRC controller, both ωm and tmd are sensed, and\nthe partitions are represented as dashed lines in (10). Letting\nβ = xˆe −Gxm (where xˆe represents the observed states), and\nG is the observer gain matrix, the following is obtained from\nGopinath’s reduced-order theorem:\nβ˙ =xe(A22 −GA12) + xm(A21 −GA11) + (B2 −GB1)u\nxˆe =β +Gxm. (12)\nHence, the PID controller requires a third-order observer,\nand the RRC controller only requires a second-order observer.\nFor completeness, the dynamic structure of the observer is\nillustrated in Fig. 4, which shows all the observed output states.\nOf particular note is that neither the observed load speed ωˆd nor\nthe shaft torque tˆmd is employed by the proposed controllers.\nAlthough not specifically considered herein, the RRC controller\nwith disturbance feedback is realized without a shaft torque\nsensor by augmenting the controller with a third-order observer\nand utilizing tˆmd. This, however, often results in controller\ninstability as a result of noise injection, since two observed\nfeedback signals are utilized by the controller. Additionally, if\neither the PID or the RRC controller is augmented with addi-\ntional ωˆd feedback, the closed-loop poles can be freely assigned\nsince this results in full state variable feedback. However, good\nclosed-loop damping is achievable with the proposed PID and\nRRC controllers without the additional feedback of ωˆd, which\nultimately complicates system tuning and injects additional\ncontroller noise, leading to potential instability and poor closed-\nloop performance.\nThe transfer function G(s) in Fig. 3(b) that describes the\nrelationship between the observed tˆd and the actual load torque\ntd can be obtained from (12) [20] for the PID controller\ntˆd(s)\ntd(s)\n=\n−G3ω2a\nJms3 − s2G1 + s (ω2aJm +G2Kmd)−G3ω2a\n(13)\nand the RRC controller\ntˆd(s)\ntd(s)\n=\nG2ω\n2\na\ns2 − sG1Kmd +G2ω2a\n(14)\nTABLE II\nDISTURBANCE OBSERVER GAINS\nrespectively, where the denominator equations describe the\nobserver pole locations. The observer poles are now assigned\naccording to the coefficients of the optimal second- and third-\norder ITAE polynomials by the observer gains given in Table II,\nwhere ωob is the equivalent −3-dB observer bandwidth.\nIf the observer bandwidth (and therefore the observer poles)\nis (are) assigned to be much greater than the closed-loop zeros\nin (6) and (7), it can be assumed that the observer dynamics\ndo not unduly influence the performance of the closed-loop\nregulation dynamics, i.e., the complex zeros do not significantly\nmove from their assigned location. However, in practice, the\nobserver poles cannot be placed significantly higher since there\nexists a tradeoff between the bandwidth of the observer and\nthe filtering of high-frequency noise. Moreover, in the case of\nthe proposed control scheme, where the derivative of observed\nload torque is injected directly into the controller output [see\nFig. 3(b)], the attenuation of high-frequency noise is of greater\nimportance if the control scheme is to be practically realizable.\nTo examine the additional noise-amplifying attributes imparted\nby the observer structure, the transfer function from the sensed\nmotor speed ωm to the observed disturbance torque tˆd is derived\nfor the full-order observer as employed with the PID controller\ntˆd(s)\nωm(s)\nfull\n=\nJmG3s\n(\ns2 + ω2a(1 +R)\n)\nJms3 − s2G1 + s (ω2aJm +G2Kmd)−G3ω2a(15)\nand the reduced-order observer employed with the RRC\ncontroller\ntˆd(s)\nωm(s)\nreduced\n=\n−G2Kmds\ns2 − sG1Kmd +G2ω2a\n. (16)\nFrom (15) and (16), it can be seen that lims→∞ |(tˆd(s)\/\nωm(s))full| = |G3| and lims→∞ |(tˆd(s)\/ωm(s))reduced| = 0,\ni.e., at high frequencies, the full-order observer does not attenu-\nate the high-frequency spectra imposed on motor speed sensor\nfeedback, while the reduced-order observer imparts attenuation\nat the rate of −20 dB\/dec, thereby significantly attenuating\nthe noise contribution from the speed signal. Furthermore, the\nPID controller also requires a contribution of estimated motor\nacceleration feedback (obtained from the second derivative of\nmotor angular position), thereby further increasing the level of\ncontroller-induced noise.\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1085\nNevertheless, the reduced-order observer is also subjected to\na noise injection from the torque transducer, as described by\nthe transfer function from the sensed shaft torque tmd, to the\nobserved disturbance torque tˆd given by\ntˆd(s)\ntmd(s)\nreduced\n=\nG2\n(\ns2 + ω2a\n)\ns2 − sG1Kmd +G2ω2a\n(17)\nwhere it can be seen that lims→∞ |(tˆd(s)\/tmd(s))reduced| =\n|G2|, i.e., at high frequencies, the reduced-order observer can-\nnot attenuate high-frequency noise on shaft torque feedback.\nHowever, if the shaft torque is measured directly and exhibits\na good signal-to-noise ratio [1], its noise contribution is con-\nsidered small when compared with that of the speed signal.\nIt is therefore expected that the RRC controller will exhibit\nimproved noise immunity (and therefore improved robustness\ndue to increased attenuation of high-frequency unmodeled\ndynamics) compared to the PID counterpart.\nB. Controllers With Observed Disturbance Feedback\nConsider the case when G(s), which is the transfer function\ndescribing the relationship between the observed tˆd and the\nactual load torque given by (13) and (14), is included in the dis-\nturbance feedback. Equations (18) and (19), which are shown\nat the bottom of the page, provide the modified closed-loop\ntransfer functions describing the regulation dynamics for the\nPID and RRC controllers with observed disturbance feedback,\nrespectively. For the PID case (18), it can be seen that the\nnumerator is fifth order (excluding the s\/Jd multiplier term)\nand comprises one real and two pairs of complex zeros that\ncan be assigned by the selection of the observer bandwidth ωob\nand the disturbance feedback gains Kpd and Kdd. Similarly,\nfor the RRC case (19), the numerator is fourth order and\ncomprises two pairs of complex zeros that can be independently\nassigned. Hence, in each case, by proper adjustment of the\ngains, the closed-loop system dynamics can be tuned to reject a\nspecific user-defined frequency while eliminating the effects of\nobserver dynamics on rejection performance, i.e., a relatively\nslow disturbance observer can be realized that attenuates high-\nfrequency noise, without sacrificing the primary control objec-\ntive of attenuating a periodic disturbance from the load-side\nvelocity profile.\nThe following equation is a fifth-order polynomial factored\ninto two parts:\n(\ns2 + ω2rj\n) (\ns3 + as2 + bs+ c\n)\n= s5 + s4a+ s3(b+ ωrj)\n+s2\n(\nc+ ω2rja\n)\n+ sbω2rj + cω\n2\nrj . (20)\nThe first, which is a complex root, represents the user-defined\nrejection frequency ωrj , where the damping ratio equals zero.\nThe second factor, which is a third-order polynomial, defines\nthe arbitrary location of the other roots.\nEquating the numerator of (18) with the expanded polyno-\nmial in (20), expressions for the disturbance feedback gains\nKpd and Kdd can be derived for the PID controller that enables\nωrj and the observer bandwidth to be independently assigned,\nas shown in (21) and (22) at the bottom of the page.\nIn a similar manner, for the RRC controller, the numerator of\n(19) is equated to a factorized fourth-order polynomial\n(\ns2 + ω2rj\n)\n(s2 + bs+ c)\n= s4 + s3b+ s2\n(\nc+ ω2rj\n)\n+ sω2rjb+ cω\n2\nrj (23)\nwhich gives the resulting disturbance feedback gains in (24) and\n(25) at the bottom of the next page.\nωd\ntd\n=\ns\nJd\n\nJ˜ms\n5 + (Kp + 1.75ωobJ˜m)s4 +\n(\n2.15ω2obJ˜m + 1.75ωobKp +Ki +Kmd\n)\ns3\n+\n(\n2.15ω2obKp + ω\n3\nobJ˜m + 1.75ωob[Ki +Kmd]\n)\ns2\n+\n(\nω3obKp + 2.15ω\n2\nob[Ki +Kmd]− JdKddω3obω2a\n)\ns+ ω3ob[Ki +Kmd]− JdKpdω3obω2a\n{(\nJ˜ms4 +Kps3 +\n(\nJ˜mω2a(1 + R˜) +Ki\n)\ns2 +Kpω2as+Kiω2a\n)\n· (s3 + 1.75ωobs2 + 2.15ω2obs+ ω3ob)\n} (18)\nωd\ntd\n=\ns\nJd\n{\nJms\n4 + (Kp + 1.4ωobJm)s3 +\n(\nω2obJm + 1.4ωobKp + [Ki +Kmd(1 +Ks)]\n)\ns2\n+\n(\nω2obKp + 1.4ωob [Ki +Kmd(1 +Ks)]− JdKddω2obω2a\n)\ns+ ω2ob [Ki +Kmd(1 +Ks)]− JdKpdω2obω2a\n}\n{(\nJms\n4 +Kps3 +\n(\nJmω\n2\na(1 + R˜) +Ki\n)\ns2 +Kpω2as+Kiω\n2\na\n)\n· (s2 + 1.4ωobs+ ω2ob)} (19)\nKpd =\nω3ob(Ki +Kmd)− ω2rj\n(\nJ˜mω\n3\nob + 2.15ω\n2\nobKp + 1.75ωob(Ki +Kmd)− ω2rj(J˜mωob1.75 +Kp)\n)\nJdω3obω\n2\na\n(21)\nKdd =\nω3obKp + 2.15ω\n2\nob(Ki +Kmd)− ω2rj\n(\nJ˜m2.15ω2ob + 1.75ωobKp +Ki +Kmd − ω2rj J˜m\n)\nJdω3obω\n2\na\n(22)\n1086 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nTABLE III\nMECHANICAL PARAMETERS\nIV. REGULATION FREQUENCY RESPONSE\nA two-inertia test facility consisting of a 1.1-kW prototype\nPMSM with integrated SAW torque transducer [see Fig. 1(b)]\nand a similarly rated commercial PMSM (Control Techniques\nLtd. Unidrive SP), representing the motor and load inertias,\nrespectively, is now used for the experimental validation of the\npresented theoretical principles. The controllers and observers\nare implemented on a dSpace hardware-in-the-loop develop-\nment platform. Both machines are excited by identical servo\namplifiers (Control Techniques Ltd. Unidrive SP) and intercon-\nnected via an additional inline SAW-based torque transducer.\nThe mechanical parameters of the test facility are given in\nTable III. Using the presented control structures, dynamic sim-\nulation models of the experimental closed-loop system are now\nused to provide performance comparisons. Regulation perfor-\nmance is evaluated via the closed-loop system’s ability to reject\na sinusoidal load-side disturbance. By way of example, the\nload-side disturbance is a 3-N ·m 62.8-rad\/s (10-Hz) sine wave.\nA. Case (i)—Assume an Ideal (High-Bandwidth)\nDisturbance Observer\nIn this case, the dynamics of the observer are of sufficient\nbandwidth that the designer would normally neglect their in-\nfluence on the closed-loop system; hence, an ideal infinite\nbandwidth disturbance torque feedback is assumed. The gains\nKpd and Kdd are therefore chosen according to (8) and (9),\nwhere ωrj = 62.8 rad\/s. To illustrate the influence of the\nobserver dynamics (which have been ignored in this case)\non the resulting regulation performance, Fig. 5 compares the\nclosed-loop frequency response from disturbance torque td to\nload speed ωd as the observer bandwidth ωob is varied, see\nTable II. In particular, Fig. 5(a) shows the PID controller that\nemploys the full-order observer, while Fig. 5(b) shows the\nRRC controller that employs the reduced-order observer. Ad-\nditionally, for comparison, the regulation performance without\ndisturbance feedback is also shown and is notably identical for\nboth controllers. The results show that both control schemes\nimpart similar attenuation characteristics as ωob is reduced, and\nFig. 5. Regulation performance when disturbance gains are chosen assuming\ncase (i) as an ideal (infinite bandwidth) observer. (a) PID controller. (b) RRC\ncontroller.\nFig. 6. Regulation performance when disturbance gains are chosen assuming\ncase (ii) as a nonideal (finite bandwidth) observer. (a) PID controller. (b) RRC\ncontroller.\nin both cases, the dynamics attributed to the observer unduly\ninfluences the ability of the closed-loop system to attenuate ωrj ,\neven when relatively high-bandwidth observers are employed.\nNevertheless, it can be seen that, in general, the low-frequency\ndisturbance rejection performance is improved with the imple-\nmentation of disturbance feedback.\nB. Case (ii)—Assume a Nonideal Disturbance Observer\nIn this case, the disturbance torque feedback is assumed to\nbe nonideal, and the dynamics of the disturbance observer are\nincluded in the tuning procedure. The disturbance gains are\nchosen according to (21) and (22) for the PID controller and\nto (24) and (25) for the RRC controller, where again ωrj =\n62.8 rad\/s. Fig. 6(a) and (b) shows the regulation frequency\nresponse for the PID and RRC controllers, respectively, as ωob\nis varied. It can be seen that, for both controllers, reducing\nthe bandwidth of the observer does not significantly influence\nthe control objective, i.e., the attenuation at ωrj remains con-\nstant. However, a relatively low-bandwidth observer, in general,\nreduces the attenuation at low frequencies, i.e., when ω <\nωrj , as shown in Fig. 6(a) and (b). Furthermore, when the\nobserver bandwidth approaches, or is less than, the desired\nrejection frequency, low-frequency disturbances are amplified\nwhen compared with the case with no disturbance feedback.\nKpd =\nω2ob (Ki +Kmd(1 +Ks))− ω2rj\n(\nω2obJm + 1.4ωobKp +Ki +Kmd(1 +Ks)− ω2rjJm\n)\nJdω2obω\n2\na\n(24)\nKdd =\nω2obKp + 1.4ωob (Ki +Kmd(1 +Ks))− ω2rj(Kp + 1.4ωobJm)\nJdω2obω\n2\na\n(25)\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1087\nFig. 7. PID controller. (a) No disturbance feedback. (b) Disturbance feedback,\ncase (i), ωob = 2ωrj . (c) Disturbance feedback, case (ii), ωob = 2ωrj .\nIt is therefore desirable to employ an observer of sufficient\nbandwidth to ensure adequate rejection of the low-frequency\nband, particularly in the event of a variation in the disturbance\nfrequency. Moreover, it can be seen that, in general, the RRC\ncontroller improves the low-frequency attenuation for a given\nobserver bandwidth when compared with the performance of\nthe PID controller.\nFig. 7 shows an example time-domain response imparted by\nthe PID controller when subjected to a sinusoidal load-side\ndisturbance of 3 N ·m and 62.8 rad\/s (10 Hz), which shows\nboth the load speed ωd and the shaft torque tmd. In particular,\nFig. 7(a) shows the response with no disturbance feedback,\nand Fig. 7(b) and (c) shows the response with disturbance\nfeedback for cases (i) and (ii), respectively, where, in both\ncases, ωob = 2ωrj . It can be seen that significant improvement\nof the regulation performance is obtained in case (ii) [Fig. 7(c)],\nwhere load perturbations are almost completely rejected from\nthe load speed, compared with case (i) [Fig. 7(b)], where only\na small attenuation of the load perturbation is evident.\nV. EXPERIMENTAL RESULTS\nThe experimental results now presented are in response to\na 3-N ·m sinusoidal disturbance torque with a frequency of\n62.8 rad\/s (10 Hz), where the speed controller reference is\nchosen to be constant at 10 rad\/s. For all the results, shaft\ntorque measurements are obtained from the integrated torque\ntransducer [17]. Fig. 8 shows the time-domain regulation\nperformance imparted by the PID controller for case (i) as\nFig. 8. PID controller tuned assuming ideal disturbance observer.\n(a) No disturbance feedback. (b) Disturbance feedback, case (i), ωob = 2ωrj .\n(c) Disturbance feedback, case (i), ωob = 2.5ωrj .\nthe observer bandwidth is increased. The controller output te\n(which is assumed to be electromagnetic torque production)\nis also shown to demonstrate the levels of controller noise.\nSpecifically, Fig. 8(a) shows the response with no disturbance\nfeedback, and Fig. 8(b) and (c) shows the response with dis-\nturbance feedback for ωob = 2ωrj and 2.5ωrj , respectively.\nNotably, Fig. 8(a) and (b) depicts the same events used in the\nsimulation results of Fig. 7(a) and (b), respectively. From Fig. 8,\ntherefore, it can be seen that increasing the observer bandwidth\nωob significantly increases the controller-induced noise with\nonly a small improvement in disturbance attenuation.\nFig. 9 shows the PID controller responses for case (ii) as the\nobserver bandwidth is increased, where ωob = 0.5ωrj , ωrj , and\n1.25ωrj , respectively. It can be seen that load perturbations are\nrejected from the load speed, and rejection performance is not\nunduly influenced by the bandwidth of the observer. Further-\nmore, when the observer bandwidth is less than the rejection\nfrequency [Fig. 9(a)], i.e., when ωob = 0.5ωrj , the controller\nnoise is attenuated to levels comparable to that obtained with\nno disturbance feedback [Fig. 8(a)].\nOf note is that when ωob > 1.5ωrj (> 15 Hz), instability\noccurs when using the PID controller [for case (ii)] due to\nthe excitation of high-order dynamics by elevated noise levels.\nBy comparison, the RRC controller can employ an observer of\nmuch higher bandwidth before instability occurs, when ωob >\n3.5ωrj (> 35 Hz), by virtue of the reduced noise levels. By\nway of example, Fig. 10 shows the responses of the RRC\ncontroller for ωob = 2.5ωrj , i.e., when the torque feedback is\nderived from the integrated torque transducer (within the case\nof the motor) [Fig. 10(a)] and the conventional inline instru-\nment transducer (coupled between motor and load machines)\n[Fig. 10(b)], respectively. It can be seen that the use of the in-\ntegrated or inline transducer results in near-identical responses,\nthereby demonstrating their equivalent dynamic capability.\n1088 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nFig. 9. PID controller tuned assuming nonideal disturbance observer.\n(a) Disturbance feedback, case (ii), ωob = 0.5ωrj . (b) Disturbance feedback,\ncase (ii), ωob = ωrj . (c) Disturbance feedback, case (ii), ωob = 1.25ωrj .\nFig. 10. RRC controller tuned assuming nonideal disturbance observer.\n(a) Disturbance feedback, case (ii) (integrated transducer), ωob = 2.5ωrj .\n(b) Disturbance feedback, case (ii) (inline transducer), ωob = 2.5ωrj .\nFurthermore, Figs. 9 and 10 demonstrate the equivalence of\nthe PID and RRC controllers with observer disturbance feed-\nback. However, by virtue of increased observer bandwidth and\nimproved rejection performance [compare Fig. 6(a) and (b)],\nthe RRC controller, in general, imparts improved disturbance\nrejection over the low-frequency band, which results in “flatter”\nunperturbed load speed traces. By way of a further example,\nFig. 11 compares the responses of the PID and RRC con-\ntrollers with a 30% reduction in the frequency of the load\nperturbation (from 10 to 6.5 Hz). It can be seen that the\nRRC controller [Fig. 11(c)] almost completely rejects the low-\nfrequency perturbations from the load speed compared with\nthe PID controller [Fig. 11(b)], where only a small attenuation\nof the load perturbations is evident, when compared with no\ndisturbance feedback [Fig. 11(a)]. These results demonstrate\nthe requirement of a higher bandwidth observer to generally\nFig. 11. Controllers tuned assuming nonideal disturbance observer with\n30% reduction in frequency of disturbance perturbation. (a) No disturbance\nfeedback. (b) Disturbance feedback, case (ii), PID controller, ωob = ωrj .\n(c) Disturbance feedback, case (ii), RRC controller (integrated transducer),\nωob = 2.5ωrj .\nensure adequate rejection of low frequencies (see Fig. 6). As\npreviously discussed, this is of particular importance as the\nfrequency of the load perturbation is likely to vary in the field.\nIn such cases, therefore, an RRC controller is again the pre-\nferred solution.\nIt should be noted that to maintain clarity of the presented\nresults, only those of significant importance have been given ex-\nplicitly in Figs. 7–11. Nevertheless, other results of interest can\nalso be readily obtained from the data presented in Tables I –IV\nand (13), (14), (21), (22), (24), and (25), for instance.\nVI. CONCLUSION\nTo address the effects of periodic load-side disturbance\ntorques on the load speed profile, extended controllers, based\non classical feedforward compensation, have been proposed.\nFor the investigation, a SAW torque transducer is mounted\ninside a commercial off-the-shelf PMSM. The extended con-\ntrollers therefore retain the flexibility afforded by the PID and\nRRC control schemes [1] to simultaneously impart optimal\nclosed-loop damping by allowing the independent selection\nof virtual inertia ratio while additionally facilitating the in-\ndependent assignment of regulation transmission zeros such\nthat, when properly assigned, it enables the rejection of a\nperiodic disturbance torque from the load speed. It is shown\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1089\nTABLE IV\nGAINS EMPLOYED BY SIMULATED AND EXPERIMENTAL CONTROLLERS\n1090 IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, VOL. 54, NO. 2, APRIL 2007\nthat reducing the bandwidth of the disturbance observer, to\nsuppress noise, adversely affects the performance of the feed-\nforward compensation (since the zeros move away from their\nassigned location). To address this, appraisal has been given\nto the combined observer and controller dynamics, with the\nzeros reassigned, and demonstrating that the bandwidth of the\nobserver need not effect the rejection of a periodic disturbance,\nthereby enabling significantly lower-bandwidth observers to be\nemployed, i.e., the observer bandwidth can be lower than the\nrejection frequency.\nThe equivalence of the PID and RRC controllers with ob-\nserver disturbance feedback is demonstrated. However, for\napplications where the frequency of the periodic disturbance\nis varying, it is shown that higher bandwidth disturbance ob-\nservers are required to maximize the disturbance attenuation\nover all of the low-frequency band (as well as the desired\nrejection frequency), thereby attenuating a wide range of pos-\nsible frequencies. In such cases, therefore, it is shown that the\nRRC controller is the preferred solution since it can employ\nsignificantly higher observer bandwidths, when compared to\nPID counterparts, by virtue of reduced noise sensitivity. Fur-\nthermore, it is demonstrated that the 20-N ·m SAW torque\ntransducer integrated into the casing of the servo machine, as\nemployed by the RRC controller, is not unduly affected by\nmachine-generated electromagnetic noise and exhibits similar\ndynamic behavior as the conventional instrument inline torque\ntransducer (coupled between motor and load). Moreover, the\nreplacement of the conventional inline torque transducer in\nfavor of the machine-integrated solution eliminates the re-\nquirement of additional transmission couplings and ultimately\nincreases transmission stiffness. Furthermore, the mechanical\nmodifications to the commercial PMSM are minimal, which\nincreases the total machine cost by only a few percent.\nFinally, it should be noted that to provide a comparative\ntheoretical analysis of the presented control schemes, this paper\nis limited to considering only the linear region of system oper-\nation. Nevertheless, consideration of nonlinear saturation, for\ninstance, such as electromagnetic torque limits, is ultimately of\nimportant practical significance, albeit beyond the scope of this\npaper. This is currently the subject of further research activity\nbased on nonlinear control techniques and will be reported as\nan extension to this paper in due course.\nREFERENCES\n[1] T. M. O’Sullivan, N. Schofield, and C. M. Bingham, “High-performance\ncontrol of dual-inertia servo-drive systems using low-cost integrated\nSAW torque transducers,” IEEE Trans. Ind. Electron., vol. 53, no. 4,\npp. 1226–1237, Jun. 2006.\n[2] G. Ellis, Control System Design Guide. New York: Academic, 2004.\n[3] ——, Observers in Control Systems: A Practical Guide. New York:\nAcademic, 2002.\n[4] J. K. Ji and S. K. Sul, “Kalman filter and LQ based speed controller\nfor torsional vibration suppression in a 2-mass motor drive system,”\nIEEE Trans. Ind. Electron., vol. 42, no. 6, pp. 564–571, Dec. 1995.\n[5] Y. Hori, H. Iseki, and K. Sugiura, “Basic consideration of vibration sup-\npression and disturbance rejection control of multi-inertia system using\nSFLAC (state feedback and load acceleration control),” IEEE Trans. Ind.\nAppl., vol. 30, no. 4, pp. 889–896, Jul.\/Aug. 1994.\n[6] S. H. Song, J. K. Ji, S. K. Sul, and M. H. Park, “Torsional vibration\nsuppression control in 2-mass system by state feedback speed controller,”\nin Proc. 2nd IEEE CCA, Sep. 1993, vol. 1, pp. 129–134.\n[7] G. Ellis, “Cures for mechanical resonance in industrial servo systems,”\nin Proc. PCIM, Jun. 2001, pp. 187–192.\n[8] G. Ellis and R. D. Lorenz, “Resonant load control methods for indus-\ntrial servo drives,” in Proc. IEEE IAS Annu. Meeting, Oct. 2000, vol. 3,\npp. 1438–1445.\n[9] S. N. Vukosavic and M. R. Stojic, “Suppression of torsional oscillations\nin a high performance speed servo drive,” IEEE Trans. Ind. Electron.,\nvol. 45, no. 1, pp. 108–117, Feb. 1998.\n[10] J. Keun, J. Dong, C. Lee, and S. K. Sul, “LQG based speed controller for\ntorsional vibration suppression in 2-mass motor drive system,” in Proc.\nIEEE IECON, Nov. 1993, vol. 2, pp. 1157–1162.\n[11] J. M. Pacas, A. John, and T. Eutebach, “Automatic identification and\ndamping torsional vibration in high-dynamic drives,” in Proc. IEEE ISIE,\nDec. 2000, vol. 1, pp. 201–206.\n[12] G. Gotting and R. W. De Doncker, “Evaluation of advanced algorithms\nfor suppression-control of drivetrain-oscillations in electric vehicles,”\nin Proc. EVS-18, Oct. 2001, CD-ROM.\n[13] T. Orlowska-Kowalska and K. Szabat, “Sensitivity analysis of state vari-\nable estimators for two-mass drive system,” Acta Electrotech. Inform.,\nvol. 4, no. 1, 2004, CD-ROM.\n[14] K. Hong, “A load torque compensation scheme under the speed mea-\nsurement delay,” IEEE Trans. Ind. Electron., vol. 45, no. 2, pp. 283–290,\nApr. 1998.\n[15] S.-M. Yang and S.-J. Ke, “Performance evaluation of velocity observer\nfor accurate estimation of servo motor drives,” IEEE Trans. Ind. Appl.,\nvol. 36, no. 1, pp. 98–104, Jan.\/Feb. 2000.\n[16] A. Baehr and P. Mutschler, “Comparison of speed acquisition meth-\nods based on sinusoidal encoder signals,” J. Electr. Eng., vol. 2, no. 1,\nJan.–Jun. 2002, CD-ROM.\n[17] A. Lonsdale, “Dynamic rotary torque measurement using surface acoustic\nwaves,” Sensors, vol. 18, no. 10, pp. 51–56, 2001.\n[18] G. Zhang and J. Furusho, “Speed control of a two-inertia system by\nPI\/PID control,” IEEE Trans. Ind. Electron., vol. 47, no. 3, pp. 603–609,\nJun. 2000.\n[19] Y. Hori, H. Sawada, and Y. Chun, “Slow resonance ratio control for\nvibration suppression and disturbance rejection in torsional system,”\nIEEE Trans. Ind. Electron., vol. 46, no. 1, pp. 162–168, Feb. 1999.\n[20] B. Drury, “The control techniques drives and controls handbook,” in IEE\nPower and Energy Series 35. Stevenage, U.K.: Inst. Electr. Eng., 2001.\n[21] G. Franklin, J. D. Powell, and A. Emami-Naeini, Feedback Control of\nDynamic Systems. Englewood Cliffs, NJ: Prentice-Hall, 2002.\nTimothy M. O’Sullivan received the M.Eng. degree\nin 2000 from the Department of Electronic and Elec-\ntrical Engineering, University of Sheffield, Sheffield,\nU.K., where he is currently working toward the Ph.D.\ndegree. His Ph.D. thesis is on the use of surface\nacoustic wave (SAW) torque transducers for improv-\ning the dynamic response of industrial servo-drive\nsystems.\nO’SULLIVAN et al.: OBSERVER-BASED TUNING OF TWO-INERTIA SERVO-DRIVE SYSTEMS 1091\nChristopher M. Bingham (M’00) received the\nB.Eng. degree in electronic systems and control en-\ngineering from Sheffield City Polytechnic, Sheffield,\nU.K., in 1989, the M.Sc. (Eng.) degree in control sys-\ntems engineering from the University of Sheffield,\nSheffield, in 1990, and the Ph.D. degree from\nCranfield University, Bedfordshire, U.K., in 1994,\nfor research on control systems to accommodate\nnonlinear dynamic effects in aerospace flight-surface\nactuators.\nHe was a Post-Doctoral Researcher at Cranfield\nUniversity until subsequently taking up a research position at the Univer-\nsity of Sheffield. Since 1998, he has been a Lecturer in the Department of\nElectronic and Electrical Engineering, University of Sheffield. His current\nresearch interests include traction control\/ antilock braking systems for electric\nvehicles, electromechanical actuation of flight control surfaces, control of active\nmagnetic bearings for high-speed machines, sensorless control of brushless\nmachines, and analysis and design of resonant converter systems.\nNigel Schofield received the B.Eng. degree in elec-\ntrical power engineering and the Ph.D. degree on\nthe field weakening of brushless permanent-magnet\ntraction machines from the University of Sheffield,\nSheffield, U.K., in 1990 and 1997, respectively.\nFrom 1993 to 1995, he was a Senior Experimental\nOfficer in the Department of Electronic and Elec-\ntrical Engineering (EEE) before taking up the post\nof Design Engineer in industry. From 1997 to 2000,\nhe was a Post-Doctoral Researcher in the Electrical\nMachines and Drives Research Group, Department\nof EEE, University of Sheffield, and from 2000 to 2004, a Lecturer in the same\ndepartment. On July 1, 2004, he was appointed to a Mechatronics Lectureship at\nthe School of Electrical and Electronic Engineering, University of Manchester,\nManchester, U.K. His research interests include electromagnetic power trains\nfor all- and hybrid-electric vehicles, the vehicular application of hydrogen fuel\ncell systems, aerospace machines and actuators, and industrial applications of\nelectromagnetic devices.\n"}