{"doi":"10.1016\/j.camwa.2009.01.020","coreId":"69566","oai":"oai:eprints.lancs.ac.uk:26135","identifiers":["oai:eprints.lancs.ac.uk:26135","10.1016\/j.camwa.2009.01.020"],"title":"A quantitative probabilistic investigation into the accumulation of rounding errors in numerical ODE solution.","authors":["Mosbach, Sebastian","Turner, Amanda"],"enrichments":{"references":[{"id":16687644,"title":"[15] IEEE standard for binary ﬂoating-point arithmetic, ANSI\/IEEE Standard 754-1985. Institute of Electrical and Electronics Engineers,","authors":[],"date":"1985","doi":null,"raw":"[15] IEEE standard for binary ﬂoating-point arithmetic, ANSI\/IEEE Standard 754-1985. Institute of Electrical and Electronics Engineers, 1985. Reprinted in SIGPLAN Notices, 22(2):9-25, 1987. 16List of Figures 1 The phase portrait of an ordinary diﬀerential equation having a saddle ﬁxed point at the origin (taken from [14]). 18 2 Diagram showing how the Markov process XN t deviates from the stable solution φt(x0) for large values of t (taken from [14]). 19 3 Phase space for the saddlepoint ODE system (8) with sample trajectories and lines where hitting distributions are recorded (dashed lines). 20 4 Step size variation for Euler’s algorithm (double precision, step size h = 10¡4, L = 20001 repetitions each). 21 5 Observed hitting distributions (symbols with dotted lines) with theoretical ﬁts (solid lines) for Euler’s algorithm (∆h = 10¡10, L = 20001 repetitions each). 22 6 Parameter a in equation (11) as function of the time step size h for simple explicit methods (Euler and 4th order Runge-Kutta). 23 7 Hitting distributions for VODE. 24 U n s t a b l e M a n i f o l d Stable Manifold Stable Manifold U n s t a b l e M a n i f o l d","cites":null},{"id":1016830,"title":"Accuracy and Stability of Numerical Algorithms.","authors":[],"date":"1996","doi":null,"raw":"[2] N. J. Higham. Accuracy and Stability of Numerical Algorithms. Society for Industrial and Applied Mathematics, 1996.","cites":null},{"id":1019416,"title":"Anomalous transport in a model of Hamiltonian round-oﬀ.","authors":[],"date":"1998","doi":"10.1088\/0951-7715\/11\/5\/009","raw":"15[10] J. H. Lowenstein and F. Vivaldi. Anomalous transport in a model of Hamiltonian round-oﬀ. Nonlinearity, 11:1321-1350, 1998.","cites":null},{"id":1020507,"title":"Convergence of Markov processes near saddle ﬁxed points.","authors":[],"date":"2007","doi":"10.1214\/009117906000000836","raw":"[14] A. G. Turner. Convergence of Markov processes near saddle ﬁxed points. Annals of Probability, 35(3):1141-1171, 2007.","cites":null},{"id":1017649,"title":"Discrete Variable Methods in Ordinary Diﬀerential Equations.","authors":[],"date":"1962","doi":null,"raw":"[5] P. Henrici. Discrete Variable Methods in Ordinary Diﬀerential Equations. John Wiley & Sons, New York, 1962.","cites":null},{"id":1018461,"title":"Elements of Numerical Analysis.","authors":[],"date":"1964","doi":null,"raw":"[7] P. Henrici. Elements of Numerical Analysis. John Wiley & Sons, New York, 1964.","cites":null},{"id":1018204,"title":"Error Propagation for Diﬀerence Methods.","authors":[],"date":"1963","doi":null,"raw":"[6] P. Henrici. Error Propagation for Diﬀerence Methods. John Wiley & Sons, New York, 1963.","cites":null},{"id":1020752,"title":"for binary floating-point arithmetic, ANSI\/IEEE Standard 754-1985. Institute of Electrical and Electronics Engineers,","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":1017379,"title":"Numerical inverting of matrices of high order II.","authors":[],"date":"1951","doi":null,"raw":"[4] H. H. Goldstine and J. von Neumann. Numerical inverting of matrices of high order II. Proc. Amer. Math. Soc., 2:188-202, 1951.","cites":null},{"id":1019078,"title":"Pathologies generated by round-oﬀ in dynamical systems.","authors":[],"date":"1994","doi":"10.1016\/0167-2789(94)00103-0","raw":"[9] M. Blank. Pathologies generated by round-oﬀ in dynamical systems. Physica D, 78:93-114, 1994.","cites":null},{"id":1019701,"title":"Pseudo-randomness of round-oﬀ errors in discretized linear maps on the plane.","authors":[],"date":"2003","doi":"10.1142\/S0218127403008557","raw":"[11] F. Vivaldi and I. Vladimirov. Pseudo-randomness of round-oﬀ errors in discretized linear maps on the plane. Int. J. of Bifurcations and Chaos, 13:3373-3393, 2003.","cites":null},{"id":1017112,"title":"Reprint of a note on rounding-oﬀ errors.","authors":[],"date":"1959","doi":null,"raw":"[3] G. E. Forsythe. Reprint of a note on rounding-oﬀ errors. SIAM Rev., 1(1):66-67, 1959.","cites":null},{"id":1016587,"title":"Rounding Errors in Algebraic Processes,","authors":[],"date":"1963","doi":null,"raw":"[1] J. H. Wilkinson. Rounding Errors in Algebraic Processes, volume 32 of Notes on Applied Science. Her Majesty’s Stationery Oﬃce, London, 1963. Also published by Prentice-Hall, NJ, USA. Reprinted by Dover, New York, 1994.","cites":null},{"id":1020228,"title":"Solving Ordinary Diﬀerential Equations II. Stiﬀ and Diﬀerential-Algebraic Problems,","authors":[],"date":"1996","doi":"10.1137\/1032091","raw":"[13] E. Hairer and G. Wanner. Solving Ordinary Diﬀerential Equations II. Stiﬀ and Diﬀerential-Algebraic Problems, volume 14 of Springer Series in Computational Mathematics. Springer Verlag, Berlin Heidelberg New York, second revised edition, 1996.","cites":null},{"id":1018765,"title":"Test of probabilistic models for the propagation of roundoﬀ errors.","authors":[],"date":"1966","doi":null,"raw":"[8] T. E. Hull and J. R. Swenson. Test of probabilistic models for the propagation of roundoﬀ errors. Comm. ACM, 9(2):108-113, 1966.","cites":null},{"id":1019965,"title":"VODE, a variable-coeﬃcient ODE solver.","authors":[],"date":"1989","doi":"10.1137\/0910062","raw":"[12] P. N. Brown, G. D. Byrne, and A. C. Hindmarsh. VODE, a variable-coeﬃcient ODE solver. SIAM Journal on Scientiﬁc and Statistical Computing, 10(5):1038-1051, 1989.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04","abstract":"We examine numerical rounding errors of some deterministic solvers for systems of ordinary differential equations (ODEs) from a probabilistic viewpoint. We show that the accumulation of rounding errors results in a solution which is inherently random and we obtain the theoretical distribution of the trajectory as a function of time, the step size and the numerical precision of the computer. We consider, in particular, systems which amplify the effect of the rounding errors so that over long time periods the solutions exhibit divergent behaviour. By performing multiple repetitions with different values of the time step size, we observe numerically the random distributions predicted theoretically. We mainly focus on the explicit Euler and fourth order Runge–Kutta methods but also briefly consider more complex algorithms such as the implicit solvers VODE and RADAU5 in order to demonstrate that the observed effects are not specific to a particular method","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69566.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26135\/2\/CAM8767Revised.pdf","pdfHashValue":"894f2e8681a012ad768ce9f84929ee61b7a9197e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26135<\/identifier><datestamp>\n      2018-01-24T02:47:30Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A quantitative probabilistic investigation into the accumulation of rounding errors in numerical ODE solution.<\/dc:title><dc:creator>\n        Mosbach, Sebastian<\/dc:creator><dc:creator>\n        Turner, Amanda<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        We examine numerical rounding errors of some deterministic solvers for systems of ordinary differential equations (ODEs) from a probabilistic viewpoint. We show that the accumulation of rounding errors results in a solution which is inherently random and we obtain the theoretical distribution of the trajectory as a function of time, the step size and the numerical precision of the computer. We consider, in particular, systems which amplify the effect of the rounding errors so that over long time periods the solutions exhibit divergent behaviour. By performing multiple repetitions with different values of the time step size, we observe numerically the random distributions predicted theoretically. We mainly focus on the explicit Euler and fourth order Runge–Kutta methods but also briefly consider more complex algorithms such as the implicit solvers VODE and RADAU5 in order to demonstrate that the observed effects are not specific to a particular method.<\/dc:description><dc:date>\n        2009-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26135\/2\/CAM8767Revised.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.camwa.2009.01.020<\/dc:relation><dc:identifier>\n        Mosbach, Sebastian and Turner, Amanda (2009) A quantitative probabilistic investigation into the accumulation of rounding errors in numerical ODE solution. Computers and Mathematics with Applications, 57 (7). pp. 1157-1167. ISSN 0898-1221<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26135\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.camwa.2009.01.020","http:\/\/eprints.lancs.ac.uk\/26135\/"],"year":2009,"topics":["QA Mathematics"],"subject":["Journal Article","PeerReviewed"],"fullText":"A quantitative probabilistic investigation into\nthe accumulation of rounding errors in\nnumerical ODE solution\nSebastian Mosbach a;1, Amanda G. Turner b;2\naDepartment of Chemical Engineering, University of Cambridge, Pembroke Street,\nCambridge CB2 3RA, United Kingdom\nbDepartment of Mathematics and Statistics, Lancaster University,\nLancaster LA1 4YF, United Kingdom\nAbstract\nWe examine numerical rounding errors of some deterministic solvers for systems\nof ordinary di®erential equations (ODEs) from a probabilistic viewpoint. We show\nthat the accumulation of rounding errors results in a solution which is inherently\nrandom and we obtain the theoretical distribution of the trajectory as a function\nof time, the step size and the numerical precision of the computer. We consider,\nin particular, systems which amplify the e®ect of the rounding errors so that over\nlong time periods the solutions exhibit divergent behaviour. By performing multiple\nrepetitions with di®erent values of the time step size, we observe numerically the\nrandom distributions predicted theoretically. We mainly focus on the explicit Euler\nand fourth order Runge-Kutta methods but also brie°y consider more complex\nalgorithms such as the implicit solvers VODE and RADAU5 in order to demonstrate\nthat the observed e®ects are not speci¯c to a particular method.\nKey words: Rounding errors, Markov jump processes, numerical ODE solution,\nlimit theorem, saddle ¯xed point\n1 Introduction\nConsider ordinary di®erential equations (ODEs) of the form\n_xt = b(xt):\n1 Corresponding author, Email address: sm453@cam.ac.uk\n2 Email address: a.g.turner@lancaster.ac.uk\nPreprint submitted to Elsevier 13 March 2009\nThese can be solved numerically using iteration methods of the type\nxt+h = xt + ¯(h; xt);\nwhere ¯(h; x)=h! b(x) as h! 0.\nThe simplest example is the Euler method, where ¯(h; x) = hb(x). This\nmethod is generally not used in practice as it is relatively inaccurate and\nunstable compared to other methods. However, more useful methods, such as\nthe fourth order Runge-Kutta formula (RK4), also fall into this scheme.\nWhen solving an ordinary di®erential equation numerically, each time an it-\neration is performed an error ² is incurred due to rounding i.e.\nXht+h = X\nh\nt + ¯(h;X\nh\nt ) + ² (1)\n(discussed in more detail in section 2).\nRounding errors in numerical computations are an inevitable consequence of\n¯nite precision arithmetic. The ¯rst work thoroughly analyzing the e®ects of\nrounding errors on numerical algorithms is the classical textbook by Wilkin-\nson [1]. A recent comprehensive treatment of the behaviour of numerical al-\ngorithms in ¯nite precision, including an extensive list of references, can be\nfound in Higham [2]. Although rounding errors are not random in the sense\nthat the exact error incurred in any given calculation is fully determined (see\nHigham [2] or Forsythe [3]), in many situations probabilistic models have been\nshown to adequately describe their behaviour. In fact, statistical analysis of\nrounding errors can be traced back to one of the ¯rst works on rounding error\nanalysis by Goldstine and von Neumann [4].\nHenrici [5{7] proposes a probabilistic model for individual rounding errors\nwhereby they are assumed to be independent and uniform, the exact distri-\nbution depending on the speci¯c ¯nite precision arithmetic being used. Using\nthe central limit theorem, he shows that the theoretical distribution of the er-\nror accumulated after a ¯xed number of steps in the numerical solution of an\nODE is asymptotically normal with variance proportional to h¡1. By varying\nthe initial conditions, he obtains numerical distributions for the accumulated\nerrors with good agreement. Hull and Swenson [8] test the validity of the above\nmodel by adding a randomly generated error with the same distribution at\neach stage of the calculation, and comparing the distribution of the accu-\nmulated errors with those obtained purely by rounding. They observe that,\nalthough rounding is neither a random process nor are successive errors inde-\npendent, probabilistic models appear to provide a good description of what\nactually happens.\nWe shall concentrate on °oating point arithmetic, as used by modern com-\nputers. However, our methods can be used equally well for any ¯nite precision\n2\narithmetic. We use the model, discussed and tested by the authors cited above,\nwhereby under generic conditions the errors in (1) can be viewed as indepen-\ndent, zero mean, uniform random variables,\n²i » U [¡jXht;ij2¡p; jXht;ij2¡p];\np being a constant determined by the precision of the computer.\nThe purpose of this paper is to analyze the cumulative e®ect of these rounding\nerrors as the step size h tends to 0. Where previous authors have considered\nthe accumulated error at a particular point, we derive a theoretical model for\nthe entire trajectory. In order to do so it is necessary to consider long-time\nbehaviour which has been previously largely unexplored due to di±culties with\nrigorous analysis. We show for a particular system that on these time scales,\nthe trajectories exhibit genuine randomness. We obtain the distribution of the\ntrajectories analytically and verify our results in numerical experiments.\nIn general, using a smaller step size h reduces truncation errors. At the same\ntime this necessitates a larger number of steps in order to solve the ODE\nnumerically on a given compact time interval, thereby increasing the accumu-\nlation of round-o® errors. This gives rise to a central limit theorem as shown\nin [5{7]. However, randomness can be seen for time scales much longer than\nwould be expected purely from this theory. In order to observe the occurrence\nof randomness on large time scales it is necessary to consider ODEs whose\nsolutions cover a ¯nite distance in in¯nite time. This restricts us to systems\ncontaining a ¯xed point with either a periodic orbit or a stable manifold. Cases\nwith periodic orbits have been studied for example in [9], [10], and [11]. Fixed\npoints with only stable manifolds are of limited relevance in this respect as\nerrors are damped and so have little e®ect on the qualitative behaviour of the\nsystem. We therefore investigate the class of ODEs with a saddle ¯xed point\nand initial condition on the stable manifold. Even though, as in [11], the initial\ncondition is chosen on a set of measure zero, the solutions are of interest as\nthey appear to exhibit strong statistical properties.\nWe show for an ODE in R2 with a saddle ¯xed point at the origin that the\nstructure of the system ampli¯es the e®ect of the rounding errors and causes\nthe numerical solution to diverge from the actual solution. More precisely,\nthere exists a constant c, determined by the ODE system, such that for times\nmuch smaller than¡c log h the numerical solution converges to the actual solu-\ntion; for times close to ¡c log h the solution undergoes a transition, determined\nby a Gaussian random variable whose distribution is obtained; for times much\nlarger than ¡c log h the numerical solution diverges from the actual solution.\nIn the ¯rst half of the paper, we outline how rounding errors can be modelled\nas random variables with speci¯ed distributions. We then show that the accu-\nmulation of the rounding errors results in a random trajectory. By calculating\n3\nits theoretical distribution as an explicit function of time, the step size h, and\nthe precision of the computer, we explain the qualitative behaviour described\nabove.\nIn the second half of the paper, we carry out numerical simulations which illus-\ntrate this behaviour. By performing multiple repetitions with di®erent values\nof the time step size, the random distributions predicted theoretically are ob-\nserved. Where previous authors have obtained their numerical distributions\nby varying the initial conditions, we do so by introducing small variations in\nthe step size h. During the transition period described in the previous para-\ngraph, the numerical solution intersects straight lines through the origin and\nwe compare the theoretical and numerical distributions for the points at which\nthese intersections occur. Both the mean and the standard deviation of these\ndistributions are of the form ah°, where ° 2 (0; 1=2] is a constant determined\nby the ODE system, and a can be found explicitly in terms of the precision\nof the computer, i.e. the number of bits used internally by the computer to\nrepresent °oating point numbers. We mainly focus on the explicit Euler and\nRK4 methods, but show that the same behaviour is also observable for more\ncomplex algorithms such as the adaptive solvers VODE [12] and RADAU5\n[13].\n2 Theoretical background\nIn the paper by Turner [14], limiting results are established for sequences of\nMarkov processes that approximate solutions of ordinary di®erential equations\nwith saddle ¯xed points. We shall outline these results and then show that\nby modelling the rounding errors as random variables, the solutions obtained\nwhen performing numerical schemes for solving ordinary di®erential equations\ncan be viewed as a special case of this. This enables us to quantify how the\nrounding errors accumulate. The resulting numerical solutions exhibit random\nbehaviour, the exact distribution of which is obtained.\nIn Section 2.1 we summarize the results of Turner [14]. In Section 2.2 we de-\nscribe how rounding errors can be modelled as random variables with speci¯ed\ndistributions. The results of [14] are applied to obtain a qualitative descrip-\ntion of the accumulation of the rounding errors. The distribution is calculated\nexplicitly in Section 2.3.\n4\n2.1 Behaviour of stochastic jump processes\nWe are interested in ordinary di®erential equations of the form\n_xt = b(xt): (2)\nWe focus on R2 in the case where the origin is a saddle ¯xed point of the\nsystem i.e. b(xt) = Bxt + ¿(xt), where B is a matrix with eigenvalues ¸;¡¹,\nwith ¸; ¹ > 0 and ¿(x) = O(jxj2) is twice continuously di®erentiable. This\ncase is of particular interest as the structure of the system ampli¯es the e®ect\nof the rounding errors and causes the numerical solution to diverge from the\nactual solution over large times. Similar behaviour can be observed in higher\ndimensions where the matrix B has at least one positive and one negative\neigenvalue, although the corresponding quantitative analysis is much harder\nand we do not go into it here.\nThe phase portrait of (2) in the neighbourhood of the origin is shown in\nFigure 1. In particular, there exists some x0 6= 0 such that Át(x0) ! 0 as\nt!1, where Á is the °ow associated with the ordinary di®erential equation\n(2). The set of such x0 is the stable manifold. There also exists some x1 such\nthat Á¡1t (x1)! 0 as t!1. The set of such x1 is the unstable manifold.\n[Fig. 1 about here.]\nFix an x0 in the stable manifold and consider sequences X\nN\nt of Markov pro-\ncesses starting from x0, which converge to the solution of (2) over compact\ntime intervals. The processes are indexed so that the variance of the °uctua-\ntions of XNt is inversely proportional to N . If we allow the value of t to grow\nwith N as a constant times logN , XNt deviates from the stable solution to a\nlimit which is inherently random, before converging to an unstable solution\n(see Figure 2).\n[Fig. 2 about here.]\nMore precisely, we observe three di®erent types of behaviour depending on the\ntime scale:\nA. On compact time intervals,XNt converges to the stable solution of (2), the\n°uctuations around this limit being of order N¡\n1\n2 . The exact distribution\nof the °uctuations is asymptotically N¡\n1\n2°t where °t is the solution to a\nlinear stochastic di®erential equation, described in [14].\nB. Let v1 and v2 be the unit eigenvectors of B corresponding to ¡¹ and ¸\nrespectively. There exists some x0 6= 0, depending only on x0, and a Gaus-\nsian random variable Z1, such that if t lies in the interval [R; 12¸ logN ¡\n5\nR], then\nXNt = x0e\n¡¹t(v1 + ²1) +N¡\n1\n2Z1e¸t(v2 + ²2)\nwhere ²i(t; N) ! 0 uniformly in t in probability as R;N ! 1. In other\nwords, XNt can be approximated by the solution to the linear ordinary\ndi®erential equation\n_yt = Byt (3)\nstarting from the random point x0v1 +N\n¡ 1\n2Z1v2.\nC. Provided Z1 6= 0, on time intervals of a ¯xed length around 12¸ logN ,\nXNt converges to one of the two unstable solutions of (2), each with\nprobability 1=2, depending on the sign of Z1.\n2.2 Accumulation of rounding errors\nWe can apply the above results to describe quantitatively how rounding er-\nrors accumulate when solving ordinary di®erential equations of the form (2)\nnumerically. In particular we consider using iteration methods of the type\nxt+h = xt + ¯(h; xt) (4)\nwhere ¯(h; x)=h! b(x) as h! 0.\nEach time an iteration is performed, an error ² = ²(h; t) is incurred due to\nrounding, so we obtain a process (Xht )t2hN iteratively by\nXht+h = X\nh\nt + ¯(h;X\nh\nt ) + ²: (5)\nModern computers store real numbers by expressing them in binary as x =\nm2n for some 1 6 jmj < 2 and n 2 Z. They allocate a ¯xed number of bits\nto store the mantissa m and a (di®erent) ¯xed number of bits to store the\nexponent n [15]. When adding to x a number of smaller order, the size of\nthe rounding error incurred is between 0 and 2n¡p = 2blog2 jxjc¡p, where p is\nthe number of bits allocated to store the mantissa. Although it is possible\nto carry out the calculations below using the exact value of 2blog2 jxjc¡p, the\ncalculations are greatly simpli¯ed by approximating it by jxj2¡p. This results\nin the `e®ective' value of p di®ering from the actual value of p by some number\nbetween 0 and 1. Provided ¯(h;Xht ) is su±ciently small compared withX\nh\nt , the\nerrors ² can therefore be viewed as independent, mean zero, uniform random\nvariables with approximate distribution\n²i » U [¡jXht;ij2¡p; jXht;ij2¡p]\n(see Henrici [5{7]). The assumption that the ²i are independent is in general\nnot true. In fact, in certain pathological cases, for example where there is a\n6\nlot of symmetry in the components, the ²i can be strongly correlated. Nev-\nertheless, under generic conditions one would expect any correlations to be\nweak and so this is a reasonable assumption to make. We shall see by the\nagreement of our numerical and theoretical results that the e®ect of making\nthis assumption is indeed small.\nAlthough the above iterations are carried out at discrete time intervals, it\nis convenient to embed the processes in continuous time by performing the\niterations at times of a Poisson process with rate h¡1. As ¯(h; x) does not\ndepend on t, this does not a®ect the shape of the resulting trajectories. In this\nway Markov processes Xht are obtained that approximate the stable solution\nof (2) for small values of h. If, in addition, the assumption is made that\nh¡\n1\n2\nÃ\n¯(h; x)\nh\n¡ b(x)\n!\n! 0\nas h ! 0 (note that both the Euler and Runge-Kutta methods satisfy this\ncondition), then under the correspondence N » h¡1, the conditions needed to\napply the results in [14] are satis¯ed.\nOur numerical solution therefore exhibits the following random behaviour:\nA. For times of order much smaller than ¡ log h, Xht approximates the stable\nsolution of (2), the °uctuations around this limit being of order h\n1\n2 .\nB. There exists some x0 6= 0, depending only on x0, and a Gaussian random\nvariable Z1, such that if t lies in the interval [¡c log h;¡ 12¸ log h+c log h]\nfor some c > 0, then Xht is asymptotic to\nx0e\n¡¹tv1 + h\n1\n2Z1e¸tv2; (6)\nthe solution to the linear ordinary di®erential equation (3) starting from\nthe random point x0v1 + h\n1\n2Z1v2.\nC. Provided Z1 6= 0, in time intervals around ¡ 12¸ log h whose length is\nof much smaller order than ¡ log h, Xht approximates one of the two\nunstable solutions of (2), each with probability 1\n2\n, depending on the sign\nof Z1.\nThe random behaviour resulting from the accumulation of rounding errors is\nmost noticeable on time intervals of ¯xed lengths around ¡ 1\n2(¸+¹)\nlog h, as for\nthese values of t the two terms x0e\n¡¹t and h\n1\n2Z1e¸t in (6) are of the same order.\nDuring these time interval, the numerical solution undergoes a transition from\nconverging to the actual solution to diverging from it. During this transition,\nfor each value of µ 2 (0; ¼=2), Xht crosses one of the straight lines passing\nthrough 0 in the direction v1 cos µ§v2 sin µ. These intersections are important\nas they indicate the onset of divergent behaviour. The distribution of the\npoint at which Xht intersects one of the lines in the direction v1 cos µ§ v2 sin µ\n7\nis asymptotic to\nh\n¹\n2(¸+¹) jZ1j\n¹\n¸+¹ jx0j\n¸\n¸+¹ j tan µj ¹¸+¹ (v1 cos µ § v2 sin µ): (7)\nIn Section 2.3 we show how to evaluate the variance of Z1, doing so explicitly\nin the linear case and obtaining bounds in the non-linear case. In Section 3\nthese results are veri¯ed by numerically obtaining the predicted distribution\nfor hitting a line through the origin.\n2.3 Explicit calculation of the variance\nConsider a numerical scheme that satis¯es the above conditions, applied to\nobtain a solution to the ordinary di®erential equation (2), starting from x0\nfor some x0 in the stable manifold. In the non-linear case we require that\nx0 is su±ciently close to the origin such that ¿(x0) is small. In general, for\nsimplicity, we assume that jx0j 6 1.\nWe de¯ne the °ow Á associated with this system by\n_Át(x) = b(Át(x)); Á0(x) = 0\nand let xt = Át(x0).\nSuppose that v1, v2 2 R2 are the unit right-eigenvectors of B corresponding\nto ¡¹, ¸ respectively, and that v01; v02 2 (R2)¤ are the corresponding left-\neigenvectors (i.e. v0ivj = ±ij).\nDe¯ne\nx0 = lim\nt!1 e\n¹tv01Át(x0)\nand\nDs = lim\nt!1 e\n¡¸tv02rÁt(xs):\nIt is shown in [14] that these limits exist and that jx0j 6 2jx0j 6 2 and\njDsj 6 2.\nFinally, let\na(x) =\n1\n3\n2¡2p\n0B@x21 0\n0 x22\n1CA\nbe the covariance matrix of the multivariate uniform random variable ², de-\n¯ned in equation (5), when Xht = x. Then Z1 » N(0; ¾21), where it is shown\nin [14] that\n¾21 =\nZ 1\n0\ne¡2¸sDsa(xs)D¤sds:\n8\nNote that ¾21 6 23¸2¡2p.\nIn the general non-linear case, evaluating ¾21 explicitly is not possible as it\ninvolves solving (2). It is possible to obtain a better approximation than that\nabove, although the important observation is that ¾21 is proportional to 2\n¡2p.\nIn the linear case, Át(x) = e\nBtx and x0 = jx0jv1. Hence xt = jx0je¡¹tv1,\nx0 = jx0j, and Ds = v02, and so\n¾21 =\n1\n3(¸+ ¹)\n2¡2pjx0j2(v1;1v02;1)2:\nNote that the directions of v1 and v\n0\n2, relative to the standard basis, are critical.\nFor example, if either v1 or v\n0\n2 is parallel to one of the standard basis vectors,\nthen ¾21 = 0.\n3 Numerical experiments\nIn this section we solve ODEs numerically using deterministic solvers and\nobserve the predicted random distributions arising as a consequence of the\naccumulation of rounding errors. For simplicity, and in order to observe the\ndesired e®ects as clearly as possible, we mainly focus on the most elementary\nof all numerical ODE solution methods, the standard explicit Euler algorithm\nwith constant time step size. However, we observe similar behaviour for RK4\nand also brie°y mention results obtained with more complex solvers, such as\nVODE [12] and RADAU5 [13].\n3.1 The system\nFor x : [0;1)! R2, consider the linear ODE\n_x(t) = Bx(t);\nwhere\nB =\n0B@¡¹ 0\n0 ¸\n1CA\nfor ¯xed ¸; ¹ > 0. Introduce new coordinates\n¹x(t) = R(')x(t)\n9\nby rotating about the origin by a ¯xed angle ' 2 [0; ¼=2), i.e.\nR(') =\n0B@cos' ¡ sin'\nsin' cos'\n1CA :\nWe arrive at the transformed system\n_¹x(t) = ¹B(')¹x(t) (8)\nwith\n¹B(') = R(')BR(')>;\nwhich will be the system under consideration in the following. Throughout,\nthe initial value\n¹x(0) = R(')\n0B@1\n0\n1CA =\n0B@cos'\nsin'\n1CA (9)\nis used. The phase space evolution is sketched in Figure 3.\n[Fig. 3 about here.]\n3.2 Theoretical hitting distribution\nAs discussed in Section 2.2, the numerical solution to the above ODE system\nundergoes a transition from converging to the actual solution to diverging from\nit. During this transition, the numerical trajectory crosses one of the straight\nlines passing through 0 at an angle Á§ µ for each value of µ 2 (0; ¼=2). These\nintersections are important as they indicate the onset of divergent behaviour.\nThe hitting distributions also provide a means of measuring the random vari-\nable Z1, which determines the random variations in our solutions, and hence\nof verifying the theoretical results.\nEquation (7) gives the asymptotic distribution of the magnitude of the point\nat which the numerical solution hits the line through the origin at angle '§ ¼\n4\nas jZj ¹¸+¹ where Z is a Gaussian random variable with mean 0 and variance\n¾2 = h¾21 =\n1\n3(¸+ ¹)\nh2¡2p(cos' sin')2 (10)\ni.e. Z » N (0; ¾2). We obtain an explicit formula for the asymptotic distribu-\ntion by starting from the N (0; ¾2) distribution\np(x)dx =\n1p\n2¼¾\nexp\nµ\n¡ 1\n2¾2\nx2\n¶\ndx\n10\nand performing a change of variable given by y = jxj ¹¸+¹ . The result is\np(y)dy =\n2(¸+ ¹)p\n2¼¾¹\ny\n¸\n¹ exp\nµ\n¡ 1\n2¾2\ny\n2(¸+¹)\n¹\n¶\ndy:\nIn the case ¸ = ¹ = 1, which is considered below, setting a = 4p\n2¼¾\nproduces\nthe family of distributions\nf(y)dy = ay exp\nµ\n¡ ¼\n16\na2y4\n¶\ndy; y 2 (0;1); (11)\nwhich will be ¯tted to the numerical data to con¯rm the theoretical value of a.\n3.3 Choice of parameters\nRounding errors are deterministic in the sense that any given number of it-\nerations of a particular numerical scheme will generate the same solution. In\norder to obtain a distribution from the numerical solutions to (3), for each\nrepetition it is necessary to vary at least one parameter by a small amount. In\nthis section we discuss this issue as well as the choice of the ¯xed parameters\nof the system such as the eigenvalues.\nThe possible parameters that can be varied are the initial value x0, and the\ntime step size h. As x0 is constrained to be on the stable manifold, any variation\nis required to be in the direction of the eigenvector corresponding to eigenvalue\n¡¹. We have found that varying the initial value in a direction orthogonal\nto the stable manifold does not yield any interesting results as the chosen\ndistribution of initial values is reproduced exactly in the hitting distribution.\nVarying it within the stable manifold yields identical results to varying the\ntime step size, however in terms of the system we feel it is preferable to vary\nthe step size as this parameter is internal to the algorithm, whereas the initial\nvalue is a physical parameter of the system. We varied the time step size as\nfollows. Given a user-supplied value of h, de¯ne the step size hi for the i\nth\nrepetition by\nhi = h+¢h(i¡ 1¡ k); i = 1; : : : ; L;\nwhere the number of repetitions L = 2k+1 and 0 < ¢h¿ h are user-supplied.\nFor all simulations, we set k = 104.\nReasonable choices of h and ¢h are limited by several factors. The hitting\ndistribution predicted theoretically in Section 3.2 is asymptotic as h! 0 and\nhence, if h is too large (in the considered case, if h > 10¡1 for both single and\ndouble precision), the observed hitting distribution di®ers substantially from\nthe theoretical one. The onset of such e®ects can be seen for large values\nof h in Figure 6. Lower bounds on h are imposed by computational cost\n11\nand by the numerical precision of the computer. In practice, computational\nexpense becomes prohibitive for values of h much larger than the smallest\nvalues permitted by numerical accuracy. Our particular choice of step size\ndistribution requires that k¢h should be (much) smaller than h. The lower\nlimit for ¢h is determined solely by the numerical precision, i.e. ¢h=h must\nnot be smaller than the numerical precision.\nWe did not investigate in detail the dependence of our observations on the\ndistribution of step sizes. However, preliminary experiments with varying ¢h\nand even with non-uniform step size distributions suggest that this dependence\nis very weak for a wide range of conditions. Figure 4 shows that the shape of\nthe distribution exhibits no discernible systematic dependence on ¢h over at\nleast nine orders of magnitude. The deviations seen for values of ¢h smaller\nthan about 10¡19 are due to the fact that ¢h=h approaches the limits of\nnumerical precision.\n[Fig. 4 about here.]\nThe remaining parameters that we need to choose are the eigenvalues ¸;¡¹\nand the rotation angle '. Since the limit distribution is given by jZj ¹¸+¹ , for\nsome Gaussian random variable Z, if the values of ¸ and ¹ di®er signi¯cantly\nthen the distribution is hard to observe in a numerical experiment. This sug-\ngests choosing ¸ and ¹ of the same order of magnitude, and we therefore take\n¸ = ¹ = 1 for all simulations.\nThere is some subtlety in the choice of the rotation angle '. For certain values,\ntrivial trajectories or symmetry e®ects can occur which conceal the desired\naccumulation of rounding errors. For instance, for ' = 0 the second component\n¹x2 of the solution is always zero, and therefore the trajectory stays on the line\n¹x2 = 0 (or equivalently x2 = 0) with no °uctuations. Note that this is in\nagreement with ¾2 = 0 in equation (10). For ' = ¼=4, any rounding error\nthat appears in one component also appears in the other one, which implies\nthat, again, the trajectory always stays on the line ¹x2 = 0 (or equivalently\nx1 = x2). This case is pathological as it consistently violates our assumption\nthat the rounding errors for the di®erent components are independent. For\nthese reasons, we chose ' = ¼=5 throughout.\n3.4 Results and observations for explicit methods\nUsing the values of the parameters discussed above, we carried out multiple\nrepetitions of Euler's algorithm and RK4. In each run we noted the point at\nwhich the trajectory given by the numerical solution intersected one of the\nlines ¹x1 = §¹x2 (the dashed lines in Figure 3). Histograms were then produced\nby partitioning the interval [0; 1] into a given ¯xed number of subintervals of\n12\nequal length and counting how many times y fell into each subinterval, where y\ndenotes the distance of the point of intersection from the origin. The empirical\ndistributions shown in Figure 5 were obtained. The theoretical distribution\n(11) was ¯tted to the empirical distributions with very good agreement.\n[Fig. 5 about here.]\nFor each value of h, we obtained a value for the parameter a by ¯tting a\ndistribution of the form (11) to our numerical data. In Figure 6 the parameter a\nis plotted as a function of the time step size h, both for single (Figure 6(a))\nand double (Figure 6(b)) precision (4 and 8 bytes internal representation of\n°oating point numbers respectively). Error bars due to the ¯t are only about\n1% and hence insigni¯cant. In both cases, the dependence between a and h is\nwell described by a \/ ph.\n[Fig. 6 about here.]\nEquation (10) predicts the value of ah¡\n1\n2 to be\nah¡\n1\n2 =\n4\np\n3p\n¼ cos ¼\n5\nsin ¼\n5\n£ 2p = 8:220£ 2p:\nFor Euler's method, the above data give ah¡\n1\n2 = 9:411£107 for single precision\nand ah¡\n1\n2 = 4:956£ 1016 for double precision. For the 4th order Runge-Kutta\nmethod, the values are ah¡\n1\n2 = 9:27 £ 107 (with a relatively large error of\n§0:12£107) for single precision and ah¡ 12 = 4:746£1016 for double precision.\nUsing the approximation discussed in Section 2.2, the actual value of p is\nbetween 23 and 24, when working in single precision, and between 52 and\n53 when working in double precision. The particular value depends on the\nexact number being computed. Our theoretical results therefore predict ah¡\n1\n2\nlies between 6:895 £ 107 and 1:379 £ 108 for single precision and between\n3:702£ 1016 and 7:404£ 1016 for double precision.\nThere are three possible sources of error in our calculations. The ¯rst is the\nerror in ¯tting the numerical data to the theoretical model, the second is that\nour theoretical models are based on asymptotic results as h! 0, whereas we\nare applying them to values of h which are necessarily larger than the precision\nof the computer. The third source of error arises from the assumption that\nat each stage the rounding error can be viewed as an independent uniform\nrandom variable, depending on a ¯xed value of p. The above results show that\nthese errors are all small and that our theoretical model provides a very good\n¯t.\n13\n3.5 Adaptive solvers\nOur theoretical results cover ODE solvers which use algorithms of the form (4).\nIn practice, more sophisticated adaptive solvers are used, such as VODE [12]\nand RADAU5 [13]. For these solvers, the user inputs the error tolerances RTOL\n(relative) and ATOL (absolute) and the global time step hg (the time interval\nafter which the user requests solution output from the solver). However, the\nuser has no immediate control over the size of the actual steps taken. These\nare determined algorithmically as a function of the error tolerance parameters\nRTOL and ATOL, generally by trial-and-error methods using heuristics, rather\nthan by an explicit formula.\nAlthough it is not possible to analyze such adaptive solvers in the way that\nwe have analyzed explicit solvers above, it is still of interest to see whether\nthey exhibit the same qualitative random behaviour. We performed numerical\nexperiments similar to those discussed above and obtained the distributions\nshown in Figure 7 in the case where RTOL=0.\n[Fig. 7 about here.]\nExperiments do not readily suggest a simple relationship between the param-\neter a in equation (11) and any of the parameters ATOL, RTOL, and hg. This is\npossibly not surprising given the lack of direct control over the time step size.\nHowever, the fact that the results are qualitatively similar supports the asser-\ntion that the observed phenomena are not speci¯c to a particular algorithm,\nbut rather are general e®ects.\n4 Conclusion\nWe analyzed the cumulative e®ect of rounding errors incurred by deterministic\nODE solvers as the step size h! 0. We considered in particular the interesting\ncase where the ordinary di®erential equation has a saddle ¯xed point and\nshowed that the numerical solution is inherently random and also obtained its\ntheoretical distribution in terms of the time, step size and numerical precision.\nWe showed that as the step size h! 0, the numerical solution exhibits three\ntypes of behaviour, depending on the time: initially it converges to the actual\nsolution, it then undergoes a transition stage, ¯nally it diverges from the actual\nsolution.\nBy performing multiple repetitions with di®erent values of the time step size,\nwe observed the random distributions predicted theoretically. We demon-\nstrated that during the transition period described above the numerical solu-\n14\ntion intersects all the straight lines through the origin. The theoretical and nu-\nmerical distributions for the points at which these intersections occur showed\nvery good agreement. Both the mean and the standard deviation of these dis-\ntributions were found to be of the form ah°, where ° 2 (0; 1=2] is a constant\ndetermined by the ODE system, and a was found explicitly in terms of the\nprecision of the computer. We mainly focused on the explicit Euler and RK4\nmethods with constant step size, but also brie°y considered the implicit solvers\nVODE and RADAU5 with automatic step adaption in order to demonstrate\nthat the observed e®ects are not speci¯c to a particular numerical method.\nAcknowledgments\nThis work has been partially funded by the EPSRC (grant number GR\/R85662\/01)\nunder the title \\Mathematical and Numerical Analysis of Coagulation-Di®usion\nProcesses in Chemical Engineering\". The authors thank James R. Norris and\nMarkus Kraft for suggesting the project and the collaboration, and helpful\ndiscussions.\nReferences\n[1] J. H. Wilkinson. Rounding Errors in Algebraic Processes, volume 32 of Notes on\nApplied Science. Her Majesty's Stationery O±ce, London, 1963. Also published\nby Prentice-Hall, NJ, USA. Reprinted by Dover, New York, 1994.\n[2] N. J. Higham. Accuracy and Stability of Numerical Algorithms. Society for\nIndustrial and Applied Mathematics, 1996.\n[3] G. E. Forsythe. Reprint of a note on rounding-o® errors. SIAM Rev., 1(1):66-67,\n1959.\n[4] H. H. Goldstine and J. von Neumann. Numerical inverting of matrices of high\norder II. Proc. Amer. Math. Soc., 2:188-202, 1951.\n[5] P. Henrici. Discrete Variable Methods in Ordinary Di®erential Equations. John\nWiley & Sons, New York, 1962.\n[6] P. Henrici. Error Propagation for Di®erence Methods. John Wiley & Sons, New\nYork, 1963.\n[7] P. Henrici. Elements of Numerical Analysis. John Wiley & Sons, New York,\n1964.\n[8] T. E. Hull and J. R. Swenson. Test of probabilistic models for the propagation\nof roundo® errors. Comm. ACM, 9(2):108-113, 1966.\n[9] M. Blank. Pathologies generated by round-o® in dynamical systems. Physica\nD, 78:93-114, 1994.\n15\n[10] J. H. Lowenstein and F. Vivaldi. Anomalous transport in a model of\nHamiltonian round-o®. Nonlinearity, 11:1321-1350, 1998.\n[11] F. Vivaldi and I. Vladimirov. Pseudo-randomness of round-o® errors in\ndiscretized linear maps on the plane. Int. J. of Bifurcations and Chaos, 13:3373-\n3393, 2003.\n[12] P. N. Brown, G. D. Byrne, and A. C. Hindmarsh. VODE, a variable-coe±cient\nODE solver. SIAM Journal on Scienti¯c and Statistical Computing, 10(5):1038-\n1051, 1989.\n[13] E. Hairer and G. Wanner. Solving Ordinary Di®erential Equations II. Sti® and\nDi®erential-Algebraic Problems, volume 14 of Springer Series in Computational\nMathematics. Springer Verlag, Berlin Heidelberg New York, second revised\nedition, 1996.\n[14] A. G. Turner. Convergence of Markov processes near saddle ¯xed points. Annals\nof Probability, 35(3):1141-1171, 2007.\n[15] IEEE standard for binary °oating-point arithmetic, ANSI\/IEEE Standard 754-\n1985. Institute of Electrical and Electronics Engineers, 1985. Reprinted in\nSIGPLAN Notices, 22(2):9-25, 1987.\n16\nList of Figures\n1 The phase portrait of an ordinary di®erential equation having\na saddle ¯xed point at the origin (taken from [14]). 18\n2 Diagram showing how the Markov process XNt deviates from\nthe stable solution Át(x0) for large values of t (taken from [14]). 19\n3 Phase space for the saddlepoint ODE system (8) with sample\ntrajectories and lines where hitting distributions are recorded\n(dashed lines). 20\n4 Step size variation for Euler's algorithm (double precision,\nstep size h = 10¡4, L = 20001 repetitions each). 21\n5 Observed hitting distributions (symbols with dotted lines) with\ntheoretical ¯ts (solid lines) for Euler's algorithm (¢h = 10¡10,\nL = 20001 repetitions each). 22\n6 Parameter a in equation (11) as function of the time step size h\nfor simple explicit methods (Euler and 4th order Runge-Kutta). 23\n7 Hitting distributions for VODE. 24\n17\n0U\nns\nta\nbl\ne \nM\nan\nifo\nld\nStable Manifold Stable Manifold\nU\nns\nta\nbl\ne \nM\nan\nifo\nld\nFig. 1. The phase portrait of an ordinary di®erential equation having a saddle ¯xed\npoint at the origin (taken from [14]).\n18\n0x\nMarkov Process\nStable Solution\nUnstable \nSolution\nA\nC\nB\n0\nFig. 2. Diagram showing how the Markov process XNt deviates from the stable\nsolution Át(x0) for large values of t (taken from [14]).\n19\nx2\nx2\nx1\nx10\nj\n4\np\njcos\nsin j( )\n( )10\nFig. 3. Phase space for the saddlepoint ODE system (8) with sample trajectories\nand lines where hitting distributions are recorded (dashed lines).\n20\n01\n2\n3\n4\n5\n10-20 10-18 10-16 10-14 10-12 10-10\nPa\nra\nm\ne\nte\nr \na\n \n[10\n14\n]\nStep size variation ∆h\nFig. 4. Step size variation for Euler's algorithm (double precision, step size h = 10¡4,\nL = 20001 repetitions each).\n21\n00.5\n1\n1.5\n2\n2.5\n3\n3.5\n0 2 4 6 8 10\nh=1.0x10-4\nh=3.2x10-4\nh=1.0x10-3\nR\ne\nla\ntiv\ne\n \nfre\nqu\ne\nn\ncy\n d\ne\nn\nsi\nty\n p\n(y)\n \n[10\n7 ]\ny [10-8]\nFig. 5. Observed hitting distributions (symbols with dotted lines) with theoretical\n¯ts (solid lines) for Euler's algorithm (¢h = 10¡10, L = 20001 repetitions each).\n22\n3 106\n4 106\n5 106\n6 106\n7 106\n8 106\n9 106\n107\n10-3 10-2\nEuler\n4th order Runge-Kutta\n9.411x107*h1\/2\nPa\nra\nm\ne\nte\nr \na\nTime step size h\n(a) Single precision (¢h = 10¡8).\n1014\n1015\n1016\n10-5 10-4 10-3 10-2\nEuler\n4th order Runge-Kutta\n4.9563x1016*h1\/2\nPa\nra\nm\ne\nte\nr \na\nTime step size h\n(b) Double precision (¢h = 10¡10).\nFig. 6. Parameter a in equation (11) as function of the time step size h for simple\nexplicit methods (Euler and 4th order Runge-Kutta).\n23\n01\n2\n3\n4\n0 1 2 3 4\nh\ng\n=1.0x10-4\nh\ng\n=3.2x10-4\nR\ne\nla\ntiv\ne\n \nfre\nqu\ne\nn\ncy\n d\ne\nn\nsi\nty\n p\n(y)\n \n[10\n7 ]\ny [10-8]\nFig. 7. Hitting distributions for VODE.\n24\n"}