{"doi":"10.1016\/j.ibiod.2008.09.010","coreId":"138745","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3395","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3395","10.1016\/j.ibiod.2008.09.010"],"title":"Trametes versicolor: Potential for atrazine bioremediation in calcareous clay soil, under low water availability conditions.","authors":["Bastos, Ana Catarina","Magan, Naresh"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-06","abstract":"This study examined the feasibility of Trametes versicolor to actively degrade atrazine (0.5 μg g−1) in non-sterile calcareous clay soil (Algarve, Portugal) microcosms for up to 24 weeks (20 °C), under low water availability (soil water potentials of −0.7 and −2.8 MPa). Soil respiration, laccase activity, and atrazine quantification by high-performance liquid chromatography (HPLC) were assessed. Respiration was significantly (p < 0.05) enhanced in soil containing the inoculant, particularly in the presence of atrazine, indicating that it remained metabolically active throughout the study. Furthermore, up to 98% and 85% (at −0.7 and −2.8 MPa, respectively) of atrazine was degraded in soil containing both the atrazine and the inoculant, compared to 96% and 50% in soil containing atrazine only. The contribution of T. versicolor to atrazine degradation was only significant (p < 0.005) under the driest soil treatment conditions. The strategies used for enhancing colonisation and biodegradation capabilities of the inoculant, as well as the selection of sawdust as carrier, were thus effective. However, there were no differences (p > 0.05) in quantified laccase activity in soil containing the inoculant and the control. Overall, this study demonstrated that T. versicolor was a strong candidate for atrazine bioremediation in soil with low moisture and organic matter contents, such as that found in semi-arid and Mediterranean-like ecosystems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138745.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/3395","pdfHashValue":"ad0d3e1e6b82f1a4c09d31dc75bd04c4c53cddcb","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3395<\/identifier><datestamp>2009-05-18T15:12:06Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Trametes versicolor: Potential for atrazine bioremediation in calcareous clay soil, under low water availability conditions.<\/dc:title><dc:creator>Bastos, Ana Catarina<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:subject>Trametes versicolor<\/dc:subject><dc:subject>Biodegradation<\/dc:subject><dc:subject>Atrazine<\/dc:subject><dc:subject>Soil microcosms<\/dc:subject><dc:subject>Water potential<\/dc:subject><dc:subject>Soil respiration<\/dc:subject><dc:subject>Laccase activity<\/dc:subject><dc:description>This study examined the feasibility of Trametes versicolor to actively degrade atrazine (0.5 μg g−1) in non-sterile calcareous clay soil (Algarve, Portugal) microcosms for up to 24 weeks (20 °C), under low water availability (soil water potentials of −0.7 and −2.8 MPa). Soil respiration, laccase activity, and atrazine quantification by high-performance liquid chromatography (HPLC) were assessed. Respiration was significantly (p < 0.05) enhanced in soil containing the inoculant, particularly in the presence of atrazine, indicating that it remained metabolically active throughout the study. Furthermore, up to 98% and 85% (at −0.7 and −2.8 MPa, respectively) of atrazine was degraded in soil containing both the atrazine and the inoculant, compared to 96% and 50% in soil containing atrazine only. The contribution of T. versicolor to atrazine degradation was only significant (p < 0.005) under the driest soil treatment conditions. The strategies used for enhancing colonisation and biodegradation capabilities of the inoculant, as well as the selection of sawdust as carrier, were thus effective. However, there were no differences (p > 0.05) in quantified laccase activity in soil containing the inoculant and the control. Overall, this study demonstrated that T. versicolor was a strong candidate for atrazine bioremediation in soil with low moisture and organic matter contents, such as that found in semi-arid and Mediterranean-like ecosystems.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-05-16T12:57:47Z<\/dc:date><dc:date>2009-05-16T12:57:47Z<\/dc:date><dc:date>2009-06<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>A.C. Bastos, N. Magan, Trametes versicolor: Potential for atrazine bioremediation in calcareous clay soil, under low water availability conditions, International Biodeterioration & Biodegradation, Volume 63, Issue 4, June 2009, Pages 389-394<\/dc:identifier><dc:identifier>0964-8305<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3395<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ibiod.2008.09.010<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0964-8305","0964-8305"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Trametes versicolor","Biodegradation","Atrazine","Soil microcosms","Water potential","Soil respiration","Laccase activity"],"subject":["Postprint"],"fullText":"1Trametes versicolor: potential for atrazine bioremediation in calcareous clay soil,1\nunder low water availability conditions2\n3\nA. C. Bastos1 and N. Magan24\nCranfield Health, Cranfield University, Building 52, MK43 0AL Bedfordshire, UK.5\n6\n1 Corresponding author7\n1 Tel.: + 44 (0) 01234 7583308\n1 Fax: + 44 (0) 01525 8635409\n1 E-mail: a.bastos@cranfield.ac.uk10\n11\n2 Tel.: + 44 (0) 01234 75830812\n2 Fax: + 44 (0) 01525 86354013\n2 E-mail: n.magan@cranfield.ac.uk14\n15\nThis manuscript includes 2 figures and 3 tables.16\n17\nScientific relevance: We investigated the feasibility of T. versicolor for actively18\ndegrading atrazine (at usual field application rates) in non-sterile calcareous clay soil of19\nSouth Portugal, under low water availability (-0.7 and 2.8 MPa) and with scarce organic20\nmatter content. Results strongly suggested that this species could potentially be used for21\nbioremediation of soil treated with triazine herbicides in semi-arid and Mediterranean-22\nlike ecosystems. As far as we are aware, very little work has looked at the influence of23\nsoil water potential on triazine biodegradation rates by white rot fungi in non-sterile24\nsoil, T. versicolor in particular. We therefore consider our work to be an important25\ncontribution in the field of applied environmental microbiology.26\n2Abstract27\n28\nThis study has examined the feasibility of Trametes versicolor for actively degrading29\natrazine (0.5 µg g-1) in non-sterile calcareous clay soil (Algarve, Portugal) microcosms30\nfor up to 24 weeks (20oC), under low water availability (soil water potentials of -0.7 and31\n-2.8 MPa). Soil respiration, enzymatic (dehydrogenase and laccase) activities and32\natrazine quantification by high-performance-liquid-chromatography (HPLC) were33\nassessed.34\n35\nRespiration and dehydrogenase activity (DHA) were significantly (p<0.05) enhanced in36\nsoil containing the inoculant, particularly in the presence of atrazine, indicating that it37\nremained metabolically active throughout the study. Furthermore, up to 98 and 85% (at38\n-0.7 and -2.8 MPa respectively) of atrazine was degraded in soil containing both39\natrazine and the inoculant, compared to 96 and 50% in soil containing atrazine only.40\nThe contribution of T. versicolor to atrazine degradation was only significant (p<0.005)41\nunder the driest soil treatment conditions. The strategies used for enhancing42\ncolonisation and biodegradation capabilities of the inoculant, as well as the selection of43\nsawdust as carrier were thus effective. However, there were no differences (p>0.05) in44\nquantified laccase activity in soil containing the inoculant and the control. Overall, this45\nstudy demonstrates that T. versicolor is a strong candidate for atrazine bioremediation in46\nsoil with low moisture and organic matter contents, such as that found in semi-arid and47\nMediterranean-like ecosystems.48\n49\n50\nKeywords: Trametes versicolor; Biodegradation; Atrazine; Soil microcosms; Water51\npotential; Soil respiration; Enzymatic activity.52\n53\n54\n55\n56\n57\n58\n59\n31. Introduction60\n61\nThe widespread incorporation of herbicides into soil every year is of major concern,62\nsince they potentially can pose a threat to our health as well as to the quality of soil,63\nsurface water and groundwater resources (Häggblom, 1992; Kearney and Roberts, 1998;64\nKuo and Regan, 1999; Ashman and Puri, 2002). Atrazine is a chlorinated aromatic65\nherbicide heavily used worldwide for control of broad-leaved weeds in agricultural66\nproduce (Ghani et al., 1996; Houot et al., 1998; Ralebitso et al., 2002), as well as in67\nurban and recreational areas (Gadd, 2001).68\n69\nAtrazine and related triazines are moderately persistent in soil (Pointing, 2001) with70\nreported half-life values ranging from 35 to 50 days, depending largely on soil71\nenvironmental conditions (Topp, 2001; Rhine et al., 2003). Microbial metabolism has72\nlong been regarded as the most important mechanism of atrazine degradation in soil73\n(Armstrong et al., 1967; Gravilescu, 2005). Nevertheless, in conditions of low moisture74\nand nutrient contents, microbial metabolism is compromised and atrazine persistence75\nmay increase (Weber et al., 1993). Soil water potential has been widely recognised as a76\ndeterminant factor controlling soil microbial growth and activity rates. Yet, very little77\nresearch has looked at atrazine biodegradation in soil under low moisture regimes78\n(Moreno et al., 2007).79\n80\nThe application of white-rot fungi for bioremediation of common environmental81\ncontaminants looks promising. Similar to other white-rot species, T. versicolor has82\nshown to be able to metabolise a wide range of organic compounds (Bumpus et al.,83\n1985; Gadd, 2001). This ability is generally attributed to the production of extracellular84\nligninolytic enzymes such as laccase, which is non-specific in regard to its substrate85\n(Thurston, 1994; Youn et al., 1995; Pointing, 2001; Šašek et al., 2003; Baldrian, 2004).86\nWhite rot species can also tolerate a broad range of environmental conditions, including87\ntemperature, nutrient and moisture contents (Maloney, 2001; Magan, 2007). In previous88\nstudies, T. versicolor was shown to exhibit good tolerance to water stress conditions89\n(Mswaka and Magan, 1999; Fragoeiro and Magan, 2005) as well as to triazine90\npesticides (Gadd, 2001; Šašek et al., 2003; Fragoeiro and Magan, 2005). Further, the91\nmycelial growth habit and hyphal extension allow rapid substrate colonisation and92\n4utilization of compounds that are not otherwise readily available to the wider microbial93\ncommunity (Reddy and Mathew, 2001; Magan, 2007).94\n95\nSo far, most studies involving the use of ligninolytic fungi for bioremediation purposes96\nhave been carried out in liquid media (e.g. Ryan and Bumpus, 1989), often in97\nbioreactors (Novotný, 2004). T. versicolor has been seldom studied in the soil98\nenvironment although there are reports of its successful application in sterile soil99\n(Lamar, 1993) and soil extract broth (Fragoeiro and Magan, 2005). In non-sterile soil,100\nknowledge is limited on other factors which can influence pesticide degradation, such as101\ncompetitive interactions between the introduced fungi and native microbial populations102\n(Šašek et al., 2003).103\n104\nThis study aimed to (1) assess the potential of T. versicolor for actively degrading105\natrazine at 0.5 µg g-1 (usual field application rates) in non-sterile calcareous clay soil,106\nunder low water availability conditions (-0.7 and -2.8 MPa). Soil respiration,107\ndehydrogenase and laccase activities were determined in combination with atrazine108\nquantification by HPLC, under the study conditions. The selection of soil water109\npotentials had the water availability range for microorganisms and plants (i.e. -0.03110\nMPa, field capacity, to -1.5 MPa, wilting point) as reference.111\n112\n113\n2. Materials and methods114\n115\n2.1. Pre-incubation of T. versicolor (R26)116\nPre-incubation of the fungal inoculum involved growing the isolate in sterile jars on wet117\nsterile sawdust (50% water content, used as carrier) at 25oC for up to 3 weeks, until the118\nsubstrate was colonised by mycelium. The jar had a vented cap (polypropylene119\nmembrane 0.22 µm pore size) allowing adequate aeration. In order to avoid desiccation,120\nthe jars were placed inside a polyethylene box, where the equilibrium relative humidity121\nwas maintained by a glycerol\/water solution (400 ml).122\n123\n2.2 Soil preparation, conditions and treatments124\n5The soil used was a calcareous clay soil (top-soil, 0-20 cm) and was collected from an125\narable field plot in Lagoa, Algarve, Portugal. The soil had the following main126\ncharacteristics, analysed by the National Soil Resources Institute (NSRI, Cranfield127\nUniversity) and given as mg g-1 oven dried soil: soil organic carbon (SOC), 12.1; water,128\n353; sand, 320; clay, 470; silt, 210; pH 6.8; annual average values of precipitation (mm)129\nand temperature (oC) on site were 400 and 17 respectively; there is no history of130\npesticide inputs in the last 4 years. Plant residues and stones were removed manually at131\nthe time of collection and soil was sieved (2 mm) and air-dried at 20oC for 7 days prior132\nto use. Air-dried soil samples (10 g) were weighed into Universal (25 ml) bottles and133\ntarget soil water potentials of -0.7 and -2.8 MPa were set by reference to a soil134\nadsorption curve and the addition of sterile reverse osmosis (RO) water (Bastos, 2008).135\n136\ni) Atrazine addition to soil137\nAtrazine was dissolved in RO water and the solution was sonicated for 1 min until138\ncomplete dissolution of the herbicide. The amount of water used for dissolution was the139\nsame as that required for setting the target soil water potential treatment, calculated by140\nreference to the soil water adsorption curve (Bastos, 2008). The solution was then added141\nto soil (5 g), in order to obtain a final concentration of atrazine of 0.5 μg g-1. This142\nconcentration corresponds to usual field application rates of the herbicide (Ghani et al.,143\n1996; Abdelhafid, 2000). The fortified soils were thoroughly homogenised and kept for144\n1 day at 4°C allowing microbial activity to stabilise at the required water potential145\nlevels, before incubation and analysis.146\n147\nii) Soil supplemented with sterile sawdust148\nWet (50% w w-1) finely chopped sterile sawdust was kept overnight at 4°C. It was then149\nadded to air-dried soil (5 g) in order to obtain a concentration of 5% (w w-1) and150\nsamples were left equilibrating overnight at 4°C. Conditioning of the treated soil to the151\nrequired water potentials was then done by reference to a soil-sawdust calibration curve152\n(Bastos, 2008). The procedure followed that described in i).153\n154\niii) Soil supplemented with sterile sawdust + atrazine155\nSoil was amended with sterile sawdust as described in ii). Conditioning of the soil to the156\ntreatment water potentials was done by reference to a soil-sawdust adsorption curve and157\nthe addition of sterile RO water supplemented with atrazine, in order to obtain a final158\n6concentration of atrazine in soil of 0.5 μg g-1. The procedure followed that described in159\ni).160\n161\niv) Inoculation of T. versicolor into soil162\nSawdust colonised by the test isolate (0.5 g) was added to air-dried soil (5 g) in order to163\nobtain a concentration of 5% (w w-1) and mixed until a homogeneous mixture was164\nobtained. The procedure followed that described in ii).165\n166\nv) Incorporation of T. versicolor + atrazine in soil167\nThe preparation of the homogeneous mixture of T. versicolor with sawdust (5% w w-1)168\nand its incorporation into air-dried soil (5 g) was described previously. The procedure169\nfollowed that described in iii).170\n171\n2.3 Incubation of soil microcosms172\nTreated soil samples and non-treated controls were incubated at 20°C for up to 24173\nweeks within polyethylene boxes previously thoroughly cleaned. Each box also174\ncontained a glycerol\/water solution (400 ml), in order to maintain the equilibrium175\nrelative humidity within each microcosms the same as that of the soil treatments. All176\ntreatments involved in this work are summarised in Table 1.177\n178\n2.4 Temporal evaluation of soil respiration179\nCO2 evolved from total soil microbial respiration was determined by gas-180\nchromatography (GC) through static sampling. Following incubation, Universal bottles181\ncontaining soil samples were sealed and left for 3 h at 20oC prior to analysis, thus182\nensuring detectable volumes of CO2 in the soil headspace. Headspace (5 ml) was then183\ninjected into a gas chromatographer equipped with a packed column (Porapak Q packed184\nglass column) and a thermal conductivity detector (Carlo Erba Instruments, GC 8000185\nSeries MFC 800). Five replicates of each treatment were sampled. The GC settings were186\nthe following: column and injector temperatures, 100oC; detector temperature, 180oC;187\ncarrier gas (Helium) at a flow rate of 36 ml min-1; the calibration gas consisting of a188\nstandard mixture (10.01% v v-1 CO2 in N2) was injected three times at the beginning and189\nafter each set of 15 samples. Soil respiration rate was expressed as µg CO2 g-1 soil h-1.190\n191\n2.5 Temporal evaluation of dehydrogenase activity192\n7The method for DHA quantification was adapted from von Mersi and Schinner (1991).193\nIt is based on the incubation of soil with the substrate INT (2 (p-iodophenyl)-3-(p194\nnitrophenyl)-5-phenyl tetrazolium chloride), followed by the extraction and colorimetric195\nestimation of the reduction product INF (iodonitrotetrazolium formazan). The196\ncalibration curve (Y = 1.0657x + 0.0061) which was firstly produced using a standard197\nINF solution (100 µg INF ml-1), showed a good correlation (r2 = 0.998) between the198\nconcentration of INF and the optical density of the INF solution.199\n200\nThe INT solution was prepared by dissolving 500 mg of INT into 2 ml of N,N-201\ndimethylformamide, followed by the addition of 50 ml of RO water. The solution was202\nsonicated (2 min) and the volume was brought up to 100 ml using RO water. The final203\nconcentration of the substrate solution was 0.5% (w v-1). For every analysis, fresh INT204\nsolution was prepared and stored in the dark until use.205\n206\nSoil (0.5 g) at the treatment water potentials was weighed into sterile test tubes and207\nmixed with 740 µl of Tris-HCl buffer (1 M, pH 7.0) and 1 ml of the substrate solution.208\nTest tubes were sealed with sterile sponge stoppers and incubated in the dark at 40oC for209\n2 h. Following incubation, 5 ml of extraction solution (N,N-dimethylformamide:210\nethanol in a 1:1 ratio) were added to the mixture and samples were kept in the dark for 1211\nh. During this time, every sample was vigorously shaken (using the vortex) at 20 min212\nintervals, ensuring an efficient extraction of the product INF. Aliquots of 2 ml were then213\ntransferred to Eppendorf tubes and centrifuged for 2 min. The supernatant (200 µl) was214\nintroduced into microplate wells and the INF was determined spectrophotometrically at215\n450 nm using a Microplate reader (Dynex Technologies Ltd., UK).216\n217\nControls were also prepared for estimating the chemical reduction of INT under the218\nsame conditions. For each treatment, controls were prepared using autoclaved soil219\n(121oC, 20 minutes) and were treated like samples. Five replicates of each treatment220\n(including respective controls) were sampled. The INT reduction of the control was then221\nsubtracted to that of the samples and DHA was expressed as ng INF g-1 soil 2 h-1.222\n223\n2.6 Temporal evaluation of laccase activity224\nEstimating soil laccase activity involved 2 steps: i) extraction of laccase from soil; ii)225\nquantification of enzymatic activity based on the oxidation of the redox substrate ABTS226\n8(2,2-azino-bis-ethylbenthiazoline-6-sulphonic acid). The procedure described below227\nwas firstly calibrated and optimised using purified commercial laccase from Rhus228\nvernificera in crude acetone powder (50 Units mg-1 solid, minimum) as standard. The229\ncalibration curve obtained (Y = 26.33x + 1.643) showed a good correlation (r2 = 0.971)230\nbetween the concentration of commercial purified laccase (mg ml-1) and laccase activity231\n(U).232\n233\ni) Laccase extraction from soil234\nThe extraction method employed was based on the protocol described by Criquet et al.235\n(1999) with adaptations by Fragoeiro and Magan (2005). Sub-samples (2 g) of treated236\nsoil and non-treated controls were weighed into sterile test tubes and 8 ml of phosphate237\nbuffer in water (10 mM, pH 6.0) were added. The suspension was kept under agitation238\n(incubator shaker, 250 rpm) at 4°C for approximately 1 h. Aliquots of 1 ml were then239\nplaced into 1.5 ml Eppendorfs and centrifuged (3800 rpm) for 6 min at room240\ntemperature. The supernatant containing the enzyme was stored at -18°C until analyses.241\n242\nii) Quantification of laccase activity243\nThe method for determining laccase activity using an enzyme extract was based on the244\nprotocol described by Buswell et al. (1995) with adaptations by Fragoeiro and Magan245\n(2005). The reaction mixture performing a total of 300 µl was contained into a 96 well246\nmicrotitre plate. It was prepared with 150 µl sodium acetate buffer (0.1 M, pH 5), 50 µl247\nABTS (0.55 mM) and 100 µl enzyme extract. The procedure was carried out at ambient248\ntemperature, although the substrate ABTS and the buffer were at 40°C when added to249\nthe reaction mixture. The incubation was performed at 40°C for 1 h. Positive laccase250\nactivity was indicated by a green colourisation of the reaction mixture, characteristic of251\nthe ABTS oxidised form. The product was determined spectrophotometrically at 405252\nnm using a Microplate reader set in the Endpoint reading mode, with 5 seconds of253\nagitation at the beginning. Control samples were prepared using boiled enzyme (15254\nmin). Five replicates of each treatment including the respective controls were used. One255\nenzyme activity unit (U) was defined as the amount of enzyme required for producing a256\n0.001 increase in the optical density of the reaction mixture per minute, under the257\nconditions of the assay. Results were expressed as U g-1 soil.258\n259\n2.7 Monitoring atrazine concentration in soil260\n9A two-step procedure was involved in assessing the rate of atrazine degradation in soil261\nmicrocosms: i) pesticide extraction from soil and ii) HPLC analysis of soil extracts. The262\nmethod employed for atrazine extraction and quantification was adapted from that of263\nElyassi (1997) and Fragoeiro and Magan (2005).264\n265\ni) Atrazine extraction from soil266\nSoil samples corresponding to the SA and SAT treatments (at -0.7 and -2.8 MPa) were267\nweighed (2 g) into test tubes. Aliquots (3 ml) of methanol (100%) were added to soil,268\nthe tubes were sealed and shaken at 300 rpm in a circular motion shaker for 24 hours in269\nthe dark at room temperature. Following agitation soil was allowed to settle until a clear270\nsupernatant was obtained (30 min aprox.). Aliquots of supernatant (extract) was then271\nwithdrawn with a syringe and filtered using a nylon 0.22 µm syringe filter.272\n273\nii) HPLC analysis of soil extracts274\nExtracts were diluted with acetonitrile (75% sample: 25% acetonitrile). A volume of 50275\nµl was injected into a Gilson HPLC system equipped with a Gilson 117 UV detector276\noperating at 215 nm, a Gilson 231XL sampling injector, Gilson 306 pump, Gilson 811277\nC dynamic mixer and an Altima C18 5 mm column (4 mm x 250 mm x 4.6 mm). The278\ncolumn operated at ambient temperature with a flow rate of 1.5 ml min-1. An isocratic279\nmobile phase system was established using acetonitrile:water at a ratio of 70:30.280\nAtrazine eluted at approximately 9.8 min. The limit of detection281\n282\n2.8 Data handling and statistical treatment283\nFor comparison between means of treatments in respect to respiration, enzymatic284\nactivities and atrazine quantification, analysis of variance (ANOVA) was performed285\nusing STATISTICA (Version 7) at a significance level p = 0.05. Standard error of286\nmeans are shown as vertical bars in figures and indicated in Tables as ± SE.287\n288\n3. Results289\n290\n3.1. Temporal evaluation of microbial respiration291\nFigure 1 shows the respiration rate for the clay soil under different soil treatments292\nincubated at (A) -0.7 MPa and (B) -2.8 MPa (20oC) for up to 24 weeks. Generally, soil293\n10\ntreated with atrazine was shown to produce over 40% more CO2 than non-treated soil294\n(SS). Throughout the study, soil containing the inoculum alone (ST) showed a295\nsignificant (p<0.01) increase in respiratory rates compared to un-inoculated soil (S).296\nSurprisingly, differences between respiration rates of soil treated with atrazine (SA),297\nsawdust (SS) and T. versicolor (ST) individually, were often not significant298\n(0.05<p<0.16) under the treatment soil conditions. Overall, the highest CO2 evolution299\nrates (0.01<p<0.04) were achieved by soil containing both atrazine and the inoculum300\n(SAT). These were at least 20% higher than in the absence of the inoculant. Maximal301\nrespiration rates occurred generally after week 6, and were followed by a slow but302\nconsistent decrease. Under drier conditions and throughout the study, respiration rates303\nwere generally not statistically different (0.05<p<0.27) between treatments.304\n305\n3.2. Temporal evaluation of dehydrogenase activity306\nFigure 2 shows the DHA for the clay soil under different soil treatments incubated at307\n(A) -0.7 MPa and (B) -2.8 MPa (20oC) for up to 24 weeks. Regardless of soil treatment,308\nthe highest DHA levels were achieved under the wettest conditions (p<0.001). Non-309\ntreated soil had the lowest DHA but sawdust and atrazine supplements (individually or310\ncombined) enhanced this enzymatic activity by over 40% at both water potentials311\n(p<0.001) over the first 6 weeks. However, after 12 weeks and from then onwards, soil312\ncarrying the inoculum alone (ST) showed over 20% higher DHA compared to sawdust-313\ntreated soil whether atrazine was present or not. Activity rates peaked after 6 weeks but314\noverall, they remained high throughout the study, even under the driest soil conditions.315\nNevertheless, irrespective of water potential, there was no significant (p>0.09)316\ndifference between soil inoculated with T. versicolor in the presence (SAT) and absence317\n(ST) of atrazine from week 6 onwards.318\n319\n3.3. Temporal evaluation of fungal laccase activity320\nTable 2 shows ABTS oxidation levels in the clay soil under different soil treatments321\nincubated at (A) -0.7 MPa and (B) -2.8 MPa (20oC) for up to 24 weeks. Interestingly,322\nsubstrate oxidation was found to occur in non-treated clay soil in the absence of the323\nfungus at -0.7 MPa. Further, there was enhanced substrate oxidation (p<0.001) as a324\nresponse to atrazine (SA) and sawdust (SS) alone under both water regimes. Differences325\nbetween laccase activity in soil containing sawdust only and that carrying the inoculant326\nwere generally only significant (p<0.03) at -2.8 MPa, with the second treatment having327\n11\nover 96% higher laccase production than the first. Under the wettest conditions, the328\nSAT treatment had only minimal levels of this enzyme, when comparing to the329\nremaining treatments, including that of soil carrying the inoculum alone (ST). This was330\nmost evident after 6 weeks. Surprisingly, the opposite was observed under drier soil331\nconditions, with the SAT treatment having nearly 40% higher (p< 0.0004) laccase332\nactivity than that of ST, although differences between SAT and SA were not statistically333\nsignificant (p>0.06). Very little activity was found after 24 weeks, independent of the334\ntreatment conditions.335\n336\n3.4. Monitoring atrazine concentration in soil microcosms337\nTable 3 shows the remaining atrazine (µg g-1) in clay soil incubated for up to 24 weeks338\nat (A) -0.7 and (B) -2.8 MPa (20°C) in the absence (SA, SSA) and in the presence339\n(SAT) of T. versicolor. Two controls were used in order to reduce bias in respect to the340\ncontribution of the sawdust supplement for atrazine degradation under the study341\nconditions. The amount of atrazine present in the soil decreased with the incubation342\nperiod in all treatments, and this was more rapid during the first 6 weeks.343\n344\nIn the absence of the fungus, 0.071 µg g-1 of atrazine was recovered from sawdust345\nsupplemented soil after 6 weeks, corresponding to around 14% of its initial346\nconcentration. For the same time period, only 0.023 µg g-1 of atrazine (i.e. 4% of the347\ninitial concentration) was extracted from soil containing the inoculum. By the end of the348\nstudy, residues of the herbicide in soil were decreased to 0.019 and 0.011 in the absence349\n(SSA) and presence (SAT) of the inoculum, corresponding to 96 and 98% degradation350\nrespectively. At -0.7 MPa, the impact of T. versicolor on atrazine breakdown in soil was351\nonly significant (p<0.003) within the first 12 weeks. In contrast, at -2.8 MPa, there was352\nstill a significant (p<0.01) difference between both treatments at the end of the study.353\n354\n4. Discussion355\n356\nIn this study, T. versicolor was inoculated into non-sterile soil containing atrazine at357\nusual field application rates for up to 24 weeks under low water regimes. Atrazine358\nquantification by HPLC, combined with the assessment of soil microbial respiration and359\ndehydrogenase activity allowed estimating the feasibility of this white-rot species to360\n12\nremain metabolically active and degrade atrazine under the study conditions. Laccase361\nactivity was also determined as an indicator of T. versicolor relative activity, in order to362\nevaluate the contribution of this enzyme in the degradation process. An optimal363\nperformance of T. versicolor in terms of growth and enzymatic activity is dependent on364\nits capability to compete with native microflora in contaminated soil (Bumpus, 1993;365\nLevanon, 1993; Baldrian, 2004). According to Šašek et al. (2003), this is an important366\naspect since the interaction between both parts can result in either inhibition or367\ncooperation in the degradation process. In order to enhance T. versicolor colonisation368\nand activity under such conditions, two strategies were employed: pre-incubation of the369\nfungus on a ligninolytic substrate (wet sawdust) prior to inoculation into soil; use of370\nsawdust as carrier (5 g inoculant to 95 g soil) but also as nutrient source selective for the371\nfungus. Other authors have used different carriers and inoculant\/soil ratios, ranging372\nfrom 5% woodchips-based T. versicolor inoculum (Fragoeiro and Magan, 2005) to 50%373\nstraw-based inoculum (Novotnỳ et al., 2003). 374 \n375\nTemporal soil respiration376\nSoil respiration was used as an indicator of overall microbial activity and pesticide377\nbreakdown. Increased respiratory activity following incorporation of sawdust and378\natrazine (individually or combined) was not surprising as they provide nutrient sources379\nsuitable for native microorganisms (Mandelbaum et al., 1993; Haney et al., 2002;380\nMoreno et al., 2007). Our results were thus comparable to those in other studies which381\nused atrazine at similar concentrations (Dzantor and Felsot, 1991; Moreno et al., 2007).382\nFurther, sawdust addition may have also improved aeration throughout soil, favouring383\nmicrobial activity in ways equivalent to that reported by Boyle (1995) using alfalfa and384\nbran.385\n386\nRespiratory activity was also enhanced in soil containing the inoculum, indicating that387\nthe test isolate was able to remain metabolically active throughout the study. However,388\nfew significant differences were found between that and soil containing sawdust alone,389\nwhich suggests competitive interactions between the inoculant and native microflora.390\nThe highest CO2 evolution rates were obtained from soil containing both atrazine and391\nthe inoculant, indicating atrazine breakdown by the test isolate, even under limiting392\nwater potentials of -2.8 MPa. Comparable results were obtained by Fragoeiro and393\nMagan (2008), who employed T. versicolor for bioremediation of a pesticide mixture394\n13\n(simazine, dieldrin and trifluraline at 5 ppm) in soil microcosms. Using a sandy loam395\nsoil under similar water potentials, they have also reported maximal CO2 evolution from396\nsoil containing both the pesticide mixture and T. versicolor.397\n398\nOverall, respiration rates peaked at around 6 weeks, followed by a consistent decrease399\ntowards the end of the study due to nutrient exhaustion (Balba et al., 1998). There was400\nevidence that water potential was the limiting factor for soil respiration, as respiratory401\nactivity between treatments was generally not statistically different under the driest soil402\nconditions. This is consistent with Conant et al. (2004), who found that drier (-1.0 and -403\n1.5 MPa) soils have substantially lower respiration rates than those moist (-0.03 to -0.05404\nMPa), partially due to severely restricted bacterial activity.405\n406\nTemporal dehydrogenase activity407\nBiological dehydrogenation (oxidation) of organic matter under aerobic conditions is408\nultimately linked to the respiratory chain and the synthesis of adenosine triphosphate409\n(ATP) (Trevors, 1982; von Mersi and Schinner, 1991) and is catalysed by410\ndehydrogenases (Harris and Steer, 2003; Nannipieri et al., 2002, 2003). Besides organic411\nmatter decomposition, intracellular dehydrogenase activity has also been associated412\nwith other key soil functions such as xenobiotic degradation (Min et al., 2001; Acosta-413\nMartinez et al., 2003). This enzymatic activity has been widely recognised as a good414\nindicator of microbial activity, since it is linked to viable cells only and has shown to be415\npositively correlated to respiration under different soil conditions (e.g. von Mersi and416\nSchinner, 1991; Garcia et al., 1994; Jimenez et al., 2002). In this study, DHA was417\ndetermined in order to assess the overall soil oxidative status and this enzymatic activity418\nin relation to atrazine biodegradation.419\n420\nRegardless of soil treatment, the highest DHA levels were achieved under the wettest421\nconditions, which is supported by previous studies (Quilchano and Maranon, 2002).422\nFurther, supplement addition to soil (sawdust and atrazine, individually or combined)423\ngenerally enhanced DHA regardless of soil water potential. In contrast, the low DHA424\nlevels in soil containing the inoculum alone over the first 6 weeks, is likely to reflect425\ncompetitive interactions between the inoculant and native microorganisms, agreeing426\nwith respiration data. However, increased DHA from then onwards indicated that the427\ninoculum remained metabolically active, even under the driest soil conditions.428\n14\nSurprisingly, unlike that observed in the remaining treatments, DHA in the SAT429\ntreatment was the highest over 24 weeks, which is inconsistent with respiratory activity.430\nThis adding to the fact that the SAT treatment did not show improved levels of this431\nenzyme (when comparing to ST), suggested that atrazine degradation by this white-rot432\nspecies may not be coupled to the oxidative metabolism of the fungus. It is possible that433\nunder the treatment environmental conditions, atrazine was not being used by T.434\nversicolor for generation of ATP (Haney et al., 2002). This enzymatic activity has been435\nscarcely studied in relation to atrazine biodegradation by white-rot fungi in soil.436\n437\nPrevious work has linked single pesticide degradation and DHA activity in soil (e.g.438\nMin et al., 2001; Moreno et al., 2007). Moreno et al. (2007) reported enhanced DHA in439\nsoil containing atrazine in the range of 0.2 to 1000 mg kg-1 at 28oC. In contrast,440\nMcGrath and Singleton (2000) monitored pentachlorophenol (PCP) biodegradation in a441\nclay loam. While PCP concentration was found to decrease (from 250 to 2 mg kg-1) in442\njust 6 weeks, levels of DHA remained minimal throughout the study. They suggested443\nthat the generation of toxic PCP biodegradation products may have been inhibitory to444\nDHA (McGrath and Singleton, 2000). However, it is unlikely for that to explain the low445\nDHA obtained in this study in soil containing the inoculant. Previous work has shown446\nthat very few toxic simazine breakdown products were originated by this inoculant in447\nsoil extract broth at -0.7 and -2.8 MPa, using the luminescent bacterium Vibrio fischerie448\n(standard toxicity assay) (Fragoeiro, 2005).449\n450\nTemporal laccase activity451\nSince it is difficult to directly assess fungal growth in soil (Novotný et al., 1999, 2004),452\ncolonisation of white-rot fungi is usually determined indirectly through enzymatic453\nactivity. The ability of such fungi to degrade pesticides has been largely associated with454\nthe production of the glycoprotein laccase (polyphenol oxidase) in the presence of455\nadequate ligninolytic substrates (Häggblom, 1992; Paszczynski and Crawford, 2000;456\nNovotný et al., 1999, 2004). Such enzymes have broad substrate specificity towards457\naromatic compounds containing hydroxyl and amine groups. ABTS is considered to be458\na primary mediator for laccase and therefore its oxidation is generally regarded as an459\nindication of laccase activity (Youn et al., 1995; Podgornik et al., 2001).460\n461\n15\nABTS oxidation did occur in non-treated clay soil under the study water potentials,462\ncontrary to that found by Fragoeiro and Magan (2008) using a sandy loam. This may be463\nbecause other genera of fungi (e.g. Aspergillus, Rhizopus), actinomycetes (e.g.464\nStreptomyces) and also some bacteria (e.g. Pseudomonas, Bacillus) are known to465\nexpress laccase activity at some extent (Kearney and Roberts, 1998). It suggests that466\nthis enzymatic activity may not be suitable for assessing T. versicolor relative activity in467\nnon-sterile soil. The incorporation of sawdust (individually or combined with atrazine)468\nhas shown to stimulate LAC production, which might be a reflection of an active fungal469\nand actinomycete communities in such soil types (Brown, 1979; Wilson and Griffin,470\n1975; Harris, 1981; Magan, 1988, 1997; Halverson et al., 2000).471\n472\nVery little research has looked at the implications of soil water potential on LAC473\nactivity. In this study, whereas the incorporation of T. versicolor into soil did not474\nresulted in enhanced laccase activity at -0.7 MPa, that enhancement was obtained under475\ndrier soil conditions. This indicates that T. versicolor had ligninolytic activity under -2.8476\nMPa, similarly to that reported by Boyle (1995) and later by Fragoeiro and Magan477\n(2008). Further, that result suggests that LAC production by the inoculant may be478\ninfluenced by competitive interactions with native microflora (White and Boddy, 1992)479\nat -0.7 MPa, when the wider fraction of the microbial community was metabolically480\nactive. For example, there is evidence of total inhibition of ligninolytic activity in T.481\nversicolor when co-inoculated in soil with species of the genus Trichoderma (Freitag482\nand Morrell, 1992). According to Novotný (1999), such interactions may explain why483\nT. versicolor generally produces relatively low levels of laccase in non-sterile soil.484\n485\nUnder wetter soil conditions, soil containing both atrazine and the inoculant has shown486\nminimal levels of laccase, compared to soil containing sawdust and atrazine. In contrast,487\nthe opposite was found at -2.8 MPa. Overall, evidence suggests that atrazine488\ndegradation in this soil by T. versicolor may have had little or no contribution of laccase489\nactivity under the conditions studied. It is therefore likely that other enzymes may have490\nbeen involved at a larger scale. For example, Podgornik and co-workers (2001)491\ndefended that ABTS is also a good substrate for manganese peroxidase (MnP) in P.492\nchrysosporium and therefore there is the possibility of this ligninolytic enzyme to have493\nbeen equally responsible for ABTS oxidation to a certain degree. Additionally, those494\nsame authors confirmed that Mn(III) complex formation during cultivation of P.495\n16\nchrysosporium can provide a false-positive for laccase, when ABTS is used as substrate.496\nFurther research is needed on the link between ABTS oxidation and laccase activity497\nfrom T. versicolor, as well as between such enzymatic activity and pesticide degradation498\nby this species in non-sterile soil. Similarly, although it is known that T. versicolor499\nproduces both MnP and lignin peroxidise (LiP) in culture (reviewed by Tuor et al.,500\n1995), much remains to be done in order to evaluate the contribution of these enzymes501\nin atrazine biodegradation by T. versicolor in the soil environment.502\n503\nContradictory evidence has led to the role of laccase production in the co-metabolism of504\npesticides with lignin by white-rot fungi not yet to be well understood (Youn et al.,505\n1995). In this study, laccase production has shown to be highly impacted by soil506\ntreatment, particularly by soil water potential. Bending et al. (2002), who used T.507\nversicolor for biodegradation of atrazine in liquid culture for up to 42 days, have508\nreached similar conclusions. Similarly, Mougin et al. (1996) have also reported that the509\ndegradation of lindane in soil by Phanerochaete chrysosporium was independent of510\nlaccase production by the fungus. In contrast, Fragoeiro and Magan (2008) reported511\nextremely high laccase activity (797.8 units ml-1) by T. versicolor in a sandy loam soil512\n(25oC, -0.7 MPa) treated with a pesticide mixture (simazine, dieldrin and trifluralin, 5-513\n30 ppm). Besides having been associated also with interspecific interactions of the514\nfungus (White and Boddy, 1992), Novotný (1999) has further suggested that laccase515\nproduction may be influenced by the nature and concentration of the potential516\ncontaminant and soil environmental conditions (Tuor et al., 1995). It is also likely to517\nvary with the white-rot strain and perhaps with the carrier used (Mougin et al., 1996;518\nBoyle, 1997) or be dependent on the combination of the aforementioned factors.519\n520\nMonitoring atrazine concentration in soil microcosms521\nPesticide degradation in soil was estimated by determining the amount of herbicide522\nextracted from soil after 6-24 weeks (20oC, -0.7 and -2.8 MPa), compared to its initial523\nconcentration. The decrease in recovered atrazine in the SA and SSA treatments can be524\nexplained by the presence of active native microbial populations, capable of degrading525\nthe herbicide under the study conditions. This was consistent with the enhanced526\nmicrobial metabolic activity found for the same time period. Other studies (Haney et al.,527\n2002; Moreno et al., 2007) have reported similar results on the capability of native soil528\npopulations to degrade atrazine added at low concentrations. For example, Moreno et al.529\n17\n(2007) have recently demonstrated that 50% of the atrazine added (5 ppm) to clay loam530\nwith freely available water had been degraded by day 16 (28°C) and that no herbicide531\nwas recovered after 45 days.532\n533\nHowever, herbicide breakdown was substantially enhanced in soil containing the534\ninoculum, particularly within the first 12 weeks. It provides evidence that T. versicolor535\nwas able to grow and actively degrade atrazine in non-sterile soil under low water536\navailability conditions. It also suggests that the pre-incubation of the test isolate and the537\nuse of sawdust as carrier were effective for this species. In this case, it is likely that the538\nrelationship established between the inoculum and native degraders was mainly539\ncooperative, agreeing with earlier findings by Boyle (1995). In contrast, Tornberg et al.540\n(2003) reported that this species failed to remain viable once inoculated in non-sterile541\nsoil.542\n543\nOver 24 weeks, the contribution of T. versicolor was found to be no longer significant at544\n-0.7 MPa. In contrast, surprisingly, its contribution was still significant at -2.8 MPa,545\nwhen the remaining fraction of the microbial community had their metabolic activity546\nlimited by water restriction. This clearly shows that this white-rot species is able to547\nactively biodegrade potential contaminants under environmental conditions, which do548\nnot promote biodegradation by soil native microflora. It is likely to be partially549\nexplained by the mycelial growth habit, allowing rapid and efficient colonisation of soil550\nwhile maximising interactions between extracellular enzymatic activity and the551\nsurrounding environment (Maloney, 2001; Reddy and Mathew, 2001). Atrazine552\nbreakdown was less pronounced towards the end of the study, whether T. versicolor was553\npresent or not, due to nutrient exhaustion.554\n555\n5. Conclusion556\n557\nThis study has shown that T. versicolor has the potential to be used as a bioremediation558\nagent for atrazine and related triazine compounds in non-sterile calcareous clay soil,559\nunder low water availability conditions. This may be particularly relevant for560\nbioremediation strategies in semi-arid and Mediterranean-like ecosystems.561\n562\n563\n18\n564\nReferences565\n566\nAbdelhafid, R., Houot, S., Barriuso, E., 2000. Dependence of atrazine degradation on C567\nand N availability in adapted and non-adapted soils. Soil Biology and Biochemistry 32,568\n389-401.569\n570\nAcosta-Martinez, V., Zobeck, T. M., Gill, T. E., Kennedy, A. C., 2003. Enzyme571\nactivities and microbial community structure in semi-arid agricultural soils. Biology and572\nFertilily of Soils 38, 216-227.573\n574\nArmstrong, D. E., Chesters, G. and Harris, R. F., 1967. Atrazine Hydrolysis in Soil. Soil575\nScience Society of America 31, 61-66.576\n577\nAshman, M. R. and Puri, G., 2002. Essential Soil Science: a clear and concise578\nintroduction to soil science. Blackwell Science Ltd., Oxford, UK.579\n580\nBalba, M. T., Al-Awadhi, N., Al-Daher, R., 1998. Bioremediation of oil-contaminated581\nsoil: microbiological methods for feasibility assessment and field evaluation. Journal of582\nMicrobiological Methods 32, 155-164583\n584\nBaldrian, P., 2004. Increase of laccase activity during interspecific interactions of white-585\nrot fungi. FEMS Microbiology Ecology 50, 245-253.586\n587\nBastos, A., 2008. Microbial volatile fingerprints: potential use for soil\/water diagnostics588\nand correlation with traditional microbial parameters, PhD Thesis, University of589\nCranfield, Silsoe, UK.590\n591\nBending, G.D., Friloux, M. and Walker, A., 2002. Degradation of contrasting pesticides592\nby white rot fungi and its relationship with ligninolytic potential593\nFEMS Microbiology Letters 212, 59-63.594\n595\nBoyle D., 1995. Development of a practical method for inducing white rot fungi to grow596\ninto and degrade organopollutants in soil. Canadian Journal of Microbiology 41,597\n19\n345-353.598\n599\nBoyle, D., 1997. Nutritional factors limiting the growth of Lentinula edodes and other600\nwhite-rot fungi in wood. Soil Biology and Biochemistry 30, 817-823.601\n602\nBrown, A. D., 1979. Physiological problems of water stress. In: Shilo, M. (Ed.)603\nStrategies of microbial life in extreme environments. Dahlem Konferenze, Berlin, 1979.604\n605\nBumpus, J. A., Tien, M., Wright, D., and Aust, S. D., 1985. Oxidation of persistent606\nenvironmental pollutants by a white- rot fungus. Science 228, 1434-1436.607\n608\nBuswell, J. A., Cai, Y., Chang, S., 1995. Effect of nutrient nitrogen and manganese on609\nmanganese peroxidase and laccase production by Lentinula (Lentinus) edodes. FEMS610\nMicrobiology Letters 128, 81-88.611\n612\nConant, R. T., Dalla-Betta, P., Klopatek, C. C., Klopatek, J. F., 2004. Controls on soil613\nrespiration in semiarid soils. Soil Biology and Biochemistry 36, 945-951.614\n615\nCriquet, S., Tagger, S., Vogt, G., Iacazio, G., Le Petit, J., 1999. Laccase activity of616\nforest litter. Soil Biology and Biochemistry 31, 1239-1244.617\n618\nDzantor, E.K., Felsot, A.S., 1991. Microbial responses to large concentrations of619\nherbicides in soil. Environmental Toxicology and Chemistry 10, 649-655.620\n621\nEliassy, A., 1997. Bioremediation of the pesticides dieldrin, simazine and trifluralin622\nusing tropical and temperate white-rot fungi, PhD Thesis, University of Cranfield,623\nSilsoe, UK.624\n625\nFragoeiro, S., Magan, N., 2005. Enzymatic activity, osmotic stress and degradation of626\npesticide mixtures in soil extract liquid broth inoculated with Phanerochaete627\ncrysosporium and Trametes versicolor. Environmental Microbiology 7, 348-355.628\n629\nFragoeiro, S., Magan, N., 2008. Impact of Trametes versicolor and Phanerochaete630\ncrysosporium on differential breakdown of pesticide mixtures in soil microcosms at two631\n20\nwater potentials and associated respiration and enzyme activity. International632\nBiodeterioration and Biodegradation, article in press.633\n634\nFreitag, M., Morrel, J.J., 1992. Changes in selected enzyme-activities during growth of635\npure and mixed cultures of the white-rot decay fungus Trametes versicolor and the636\npotential biocontrol agent Trichoderma harzianum. Canadian Journal of Microbiology637\n38, 317-323.638\n639\nGadd, G. (Ed.), 2001 Fungi in Bioremediation. Cambridge University Press.640\nCambridge, UK.641\n642\nGhani, A., Wardle, D. A., Rahman, A., Lauren, D. R., 1996. Interactions between 14C-643\nlabelled atrazine and the soil microbial biomass in relation to pesticide degradation.644\nBiology and Fertility of Soils 21, 17-22.645\n646\nGravilescu, M., 2005. Fate of pesticides in the environment. Engineering in Life647\nSciences 5, 497- 505.648\n649\nHäggblom, M. M., 1992. Microbial breakdown of halogenated aromatic pesticides and650\nrelated compounds. FEMS Microbiology Reviews 103, 29-72.651\n652\nHalverson, L. J., Jones, T. M., Firestone, M., 2000. Release of intracellular solutes by653\nfour bacteria exposed to dilution stress. Soil Society of America Journal 64, 1630-1637.654\n655\nHaney, R. L., Senseman, S. A., Krutz, L. J., Hons, F. M., 2002. Soil carbon and nitrogen656\nas affected by atrazine and glyphosate. Biology and fertility of Soils 35, 35-40.657\n658\nHarris, J. A., Steer, J., 2003. Modern methods for estimating soil microbial biomass and659\ndiversity: an integrated approach. In: Collins, H. P., Robertson, G. P., Klug, M. J. (Eds.)660\nThe Utilisation of Bioremediation to reduce soil contamination: Problems and661\nSolutions. Kluwer Academic Publishers, Netherlands.662\n663\n21\nHarris, R., 1981. Effect of water potential on microbial growth and activity in soils in664\nwater potential relations in soil microbiology. Soil Science Society of America Journal,665\n23-96.666\n667\nHouot, S., Barriuso, E., Bergheaud, V., 1998. Modifications to atrazine degradation668\npathways in a loamy soil after addition of organic amendments. Soil Biology and669\nBiochemistry 30, 2147-2157.670\n671\nKearney, P., Roberts, T. (Eds.), 1998. Pesticide Remediation in Soils and Water Wiley672\nSeries in Agrochemicals and Plant Protection. John Wiley & Sons Ltd, UK.673\n674\nKuo, W., Regan, R., 1999. Removal of pesticides from rinsates by adsorption using675\nagricultural residues as medium. Journal of Science and Health B34, 431-447.676\n677\nLamar, R. T., Evans, J. W., Glaser, J. A., 1993. Solid-phase treatment of a678\npentachlorophenol-contaminated soil using lignin-degrading fungi. Environmental679\nScience and Technology 27, 2566-2571.680\n681\nLevanon, D., 1993. Roles of fungi and bacteria in the mineralization of the pesticides682\natrazine, alachlor, malathion and carbofuran in soil. Soil Biology and Biochemistry 25,683\n1097-1105.684\n685\nMagan, N., 1988. Fungal colonisation and decomposition of cereal straw. International686\nBiodeterioration 24, 435-443.687\n688\nMagan, N., 1997. Fungi in extreme environments. In: Wicklow & Soderstrom (Eds.),689\nThe Mycota IV. Environmental and Microbial Relationships. Springer-Verlag, Berlin.690\n691\nMaloney, S., 2001. Pesticide degradation. In: Gadd, G. (Ed.), Fungi in Bioremediation.692\nCambridge University Press, Cambridge, UK.693\n694\nMandelbaum, R., Hadar, Y., Chen, Y., 1993. Simple apparatus to study microbial695\nactivity in organic substrates under constant water potential. Soil Biology and696\nBiochemistry 25, 397-399.697\n22\n698\nMcGrath, R. Singleton, I., 2000. Pentachlorophenol transformation in soil: a699\ntoxicological assessment. Soil Biology and Biochemistry 32, 1311-1314.700\n701\nMin, H., Ye, Y.F., Chen, Z.Y., Wu, W.X., Du, Y.F., 2001. Effects of butachlor on702\nmicrobial populations and enzyme activities in paddy soil.703\nJournal of Environmental Science and Health, Part B – Pesticides, food contaminants704\nand agricultural wastes 36, 581-595.705\n706\nMollea, C., Bosco, F., Ruggeri, B., 2004. Fungal biodegradation of naphthalene:707\nmicrocosms studies. Chemosphere 60, 636 – 643.708\n709\nMoreno, J. L., Aliaga, A., Navarro, S., Hernández, T., Garcia, C., 2007. Effects of710\natrazine on microbial activity in semiarid soil. Applied Soil Ecology 35, 120-127.711\n712\nMougin, C., Pericaud, C., Malosse, C., Laugero, C., Asther, M., 1996.713\nBiotransformation of the insecticide lindane by the white-rot basidiomycete714\nPhanerochaete chrysosporium. Pesticide Science 47, 51-59.715\n716\nMswaka, A.Y., Magan, N., 1999. Temperature and water potential relations of tropical717\nTrametes and other wood-decay fungi from the indigenous forests of Zimbabwe.718\nMycological Research 103, 1309-1317.719\n720\nNannipieri, P., Ascher, J., Ceccherini, M. T., Landi, L., Pietramellara, G., Renella, G.721\n(2003). Microbial diversity and soil functions. European Journal of Soil Science 54,722\n655-670.723\n724\nNannipieri, P., Kandeler, E., Ruggiero, P., 2002. Enzyme activities and microbiological725\nand biochemical processes in soil. In: Burns, R. G., Dick, R. (Eds.) Enzymes and the726\nEnvironment. Marcell Dekker, New York.727\n728\nNovotný, C., Erbanova P, Sasek V, Kubatova A, Cajthaml T, Lang E, Krahl J, Zadrazil729\nF., 1999. Extracellular oxidative enzyme production and PAH removal in soil by730\nexploratory mycelium of white rot fungi. Biodeterioration 10, 159-168.731\n23\n732\nNovotný, C., Svobodová, K., Erbanová, P., Cajthaml, T, Kasinath, A., Lang, E., Šašek,733\nV., 2004. Ligninolytic fungi in bioremediation: extracellular enzyme production and734\ndegradation rate. Soil Biology and Biochemistry 36, 1545-1551.735\n736\nQuilchano, C., Mararon T., 2002. Dehydrogenase activity in Mediterranean forest soils.737\nBiology and Fertility of Soils 35, 102-107.738\n739\nPaszczynski, A., Crawford, R., 2000. Recent advances in the use of fungi in740\nEnvironmental Remediation and Biotechnology. In: Bollag, J.-M. & Stotzky, G. (Eds.)741\nSoil Biochemistry 10, 379-422. Marcel Dekker, New York.742\n743\nPodgornik, H., Stegu, M., Zibert, E., Perdith, A., 2001. Laccase production by744\nPhanerochaete chrysosporium – an artefact caused by Mn(III)? Letters in Applied745\nMicrobiology 32, 407-411.746\n747\nPointing, S., 2001. Feasibility of bioremediation by white-rot fungi. Applied748\nMicrobiology and Biotechnology 57, 20-33.749\n750\nRalebitso, T.K., Senior, E., van Verseveld, H.W., 2002. Microbial aspects of atrazine751\ndegradation in natural environments. Biodeterioration 13, 11-19.752\n753\nReddy, C., Mathew, Z., 2001. Bioremediation potential of white rot fungi. In: Gadd, G.754\n(Ed.), Fungi in Bioremediation. Cambridge University Press, Cambridge, UK.755\n756\nRhine, E. D., Fuhrmann, J. J., Radosevich, M., 2003. Microbial community responses to757\natrazine exposure and nutrient availability: linking degradation capacity to community758\nstructure. Microbial Ecology 46, 145-160.759\n760\nŠašek, V., Glaser, J. A., Bouveye, P. (Eds.), 2003. The utilisation of Bioremediation to761\nreduce Soil contamination: problems and solutions. Earth and Environmental Sciences762\n19. Nato Science Series. Kluwer Academic Publishers.763\n764\n24\nSchmidt, K. R., Chand, S., Gostomski, P. A., Boyd-Wilson, K., Ford, C., Walter, M.,765\n2005. Fungal inoculum properties and its effect on growth and enzyme activity of766\nTrametes versicolor in soil. Biotechnology Programs 21, 377-385.767\n768\nSomerville, L., Greaves, M. P. (Eds.), 1987. Pesticide effects on Soil Microflora. Taylor769\n& Francis, London, UK.770\n771\nTopp, E., 2001. A comparison of three atrazine-degrading bacteria for soil772\nbioremediation. Biology and Fertility of Soils 33, 529-534.773\n774\nTornberg, K., Baath, E., Olsson, S., 2003. Fungal growth and effects of different wood775\ndecomposing fungi on the indigenous bacterial community of polluted and un-polluted776\nsoils. Biology and Fertility of Soils 37, 190-197.777\n778\nTrevors, J. T., Mayfield, C. I., Inniss, W.E., 1982. Measurement of electron transport779\nsystem (ETS) activity in soil. Microbial Ecology 8, 163-168.780\n781\nThurston, C.F., 1994. The structure and function of laccases. Microbiology 140, 19-26.782\n783\nvon Mersi, W., Schinner, F., 1991. An improved and accurate method for determining784\nthe dehydrogenase activity of soil with iodonitrotetrazoliumchloride. Biology and785\nFertility of Soils 11, 216-220.786\n787\nWeber, J.B., 1993. Ionisation ande sorption of fomesafen and atrazine by soils and soil788\nconstituents. Pesticide Science 39, 31-38.789\n790\nWhite, N. A., Boddy, L., 1992. Extracellular enzyme location during interspecific791\nfungal interactions. FEMS Microbiology Letters 98, 75-80.792\n793\nWilson, J M., Griffin, D. M., 1975. Wayer potential and the respiration of794\nmicroorganisms in the soil. Soil Biology and Biochemistry 7, 199-204.795\n796\nYoun, H.-D., Hah, Y.C., Kang, S.-O., 1995. Role of laccase in lignin degradation by797\nwhite rot fungi. FEMS Microbiology Letters 132, 183-188.798\n25\n799\n800\n801\n802\n803\n804\n805\n806\n807\n808\n809\n810\n811\n812\n813\n814\n815\n816\n817\n818\n819\n820\n821\n822\n823\n824\n825\n826\n827\n828\n829\n830\n831\n832\n26\nTable 1. Summary of the soil treatments involved in this work. Key to treatments: WP,833\nwater potential; SD, sawdust; Atra, atrazine., Tv, T.versicolor.834\nRef WP (-MPa) Atra (ug) SD (%) SD+Tv835\nSoil S -0.7; -2.8 - - -836\nSoil + Atra SA -0.7; -2.8 0.5 - -837\nSoil + SD SS -0.7; -2.8 - 0.5 -838\nSoil + SD + Atra SSA -0.7; -2.8 0.5 0.5 -839\nSoil + Tv ST -0.7; -2.8 - - 0.5840\nSoil + Atra + Tv SAT -0.7; -2.8 0.5 0.5 0.5841\n842\nTable 2. Temporal laccase activity (U g\/soil) based on ABTS oxidation in clay soil843\nincubated for up to 24 weeks at 20oC at (A) -0.7 and (B) -2.8 MPa as a response to844\ndifferent soil amendments.845\nA)846\nIncubation time (weeks)\n0 6 12 24\nS 0.30 ± 0.29 2.55 ± 1.06 1.88 ± 0.88 0.67 ± 0.41\nSA 9.04 ± 1.41 12.0 ± 3.53 7.92 ± 1.57 0\nSS 9.50 ± 0.77 24.5 ± 9.60 16.4 ± 3.04 0\nSSA 10.3 ± 1.12 28.7 ± 0.79 19.9 ± 0.32 0\nST 8.49 ± 3.53 21.2 ± 9.11 13.3 ± 2.89 0\nSAT 18.5 ± 5.66 0.51 ± 0.22 0.50 ± 0.51 0\n847\nB)848\nIncubation time (weeks)\n0 6 12 24\nS 0.72 ± 0.11 1.97 ± 0.80 0.86 ± 0.23 0\nSA 0 21.5 ± 4.32 15.7 ± 2.03 0\nSS 6.50 ± 0.51 11.1 ± 3.88 0 0\nSSA 8.57 ± 1.01 13.4 ± 0.90 6.20 ± 0.56 0\nST 10.0 ± 1.06 14.6 ± 3.63 9.88 ± 1.54 0\nSAT 14.2 ± 1.90 23.1 ± 5.69 13.4 ± 2.01 0\n849\n27\nTable 3. Remaining atrazine (ug\/g) in clay soil at (A) -0.7 and (b) -2.8 MPa at 20oC850\nin the absence (SA, SSA) and presence (SAT) of T.versicolor.851\n(A)852\nIncubation (weeks) Treatment Remaining atrazine (µg g-1)\nSA 0.495 ± 0.01\nSSA 0.500 ± 0.030\nSAT 0.500 ± 0.02\nSA 0.080 ± 0.01\nSSA 0.071 ± 0.026\nSAT 0.023* ± 0.02\nSA 0.036 ± 0.03\nSSA 0.034 ± 0.0212\nSAT 0.016* ± 0.03\nSA 0.022 ± 0.06\nSSA 0.019 ± 0.0424\nSAT 0.011 ± 0.05\nB)853\nIncubation (weeks) Treatment Remaining atrazine (µg g-1)\nSA 0.480 ± 0.03\nSSA 0.495 ± 0.030\nSAT 0.490 ± 0.01\nSA 0.262 ± 0.04\nSSA 0.255 ± 0.016\nSAT 0.102* ± 0.03\nSA 0.258 ± 0.02\nSSA 0.242 ± 0.0212\nSAT 0.084* ± 0.02\nSA 0.254 ± 0.06\nSSA 0.237 ± 0.0424\nSAT 0.076* ± 0.03\n* Statistically different from both controls (SA and SSA) at p <0.05.854\n855\n856\n28\nFigure 1. Respiration rates for the clay soil under different soil treatments for up to 24857\nweeks at 20oC under (A) -0.7 and (B) -2.8 MPA. For key to treatments see Table 1.858\n859\n860\n861\n862\n0\n2\n4\n6\n8\n10\n12\n14\n0 6 12 24\nTime (weeks)i ( s)\n0\n2\n4\n6\n8\n10\n12\n14\n0 6 12 24\nTime (weeks)\nRe\nsp\nira\ntio\nn\n(m\ng\nCO\n2\ng-\n1\nso\nil\nh-\n1 )\nS\nSA\nSS\nSSA\nST\nSAT\nRe\nsp\nira\ntio\nn\n(m\ng\nCO\n2\ng-\n1\nso\nil\nh-\n1 )\n"}