{"doi":"10.1111\/j.1468-2230.2009.00785.x","coreId":"213960","oai":"oai:eprints.lse.ac.uk:26925","identifiers":["oai:eprints.lse.ac.uk:26925","10.1111\/j.1468-2230.2009.00785.x"],"title":"Harmonisation by example: European laws against unfair commercial practices","authors":["Collins, Hugh"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"This examination of the implementation of the European Union's Directive on Unfair Commercial Practices in the United Kingdom by the Consumer Protection from Unfair Trading Regulations 2008 assesses the likely impact on the national law governing the marketing practices of rogue traders, including its ambition to simplify and extend legal protection, and the likely success of the Directive in achieving the harmonisation of the laws and practices regulating marketing in Europe. In particular, the discussion evaluates the regulatory strategy of the Directive in its attempt to secure uniform laws through the combination of principles, rules, and concrete examples of prohibited practices. The paper also investigates the likely impact of the Regulations on the private law of contract and tort and the possibilities for improvements in a consumer's personal right of redress","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/213960.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/26925\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Collins%2C%20H_Harmonisation%20example_Collins_Harmonisation%20example_2014.pdf","pdfHashValue":"3a005d292a94b1d76e0dedde79406f262ca56ca9","publisher":"Wiley-Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:26925<\/identifier><datestamp>\n      2014-10-24T15:31:51Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4C4C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/26925\/<\/dc:relation><dc:title>\n        Harmonisation by example: European laws against unfair commercial practices<\/dc:title><dc:creator>\n        Collins, Hugh<\/dc:creator><dc:subject>\n        D901 Europe (General)<\/dc:subject><dc:subject>\n        K Law (General)<\/dc:subject><dc:description>\n        This examination of the implementation of the European Union's Directive on Unfair Commercial Practices in the United Kingdom by the Consumer Protection from Unfair Trading Regulations 2008 assesses the likely impact on the national law governing the marketing practices of rogue traders, including its ambition to simplify and extend legal protection, and the likely success of the Directive in achieving the harmonisation of the laws and practices regulating marketing in Europe. In particular, the discussion evaluates the regulatory strategy of the Directive in its attempt to secure uniform laws through the combination of principles, rules, and concrete examples of prohibited practices. The paper also investigates the likely impact of the Regulations on the private law of contract and tort and the possibilities for improvements in a consumer's personal right of redress.<\/dc:description><dc:publisher>\n        Wiley-Blackwell<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/26925\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Collins%2C%20H_Harmonisation%20example_Collins_Harmonisation%20example_2014.pdf<\/dc:identifier><dc:identifier>\n          Collins, Hugh  (2010) Harmonisation by example: European laws against unfair commercial practices.  Modern Law Review, 73 (1).  pp. 89-118.  ISSN 0026-7961     <\/dc:identifier><dc:relation>\n        http:\/\/www.modernlawreview.co.uk\/<\/dc:relation><dc:relation>\n        10.1111\/j.1468-2230.2009.00785.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/26925\/","http:\/\/www.modernlawreview.co.uk\/","10.1111\/j.1468-2230.2009.00785.x"],"year":2010,"topics":["D901 Europe (General)","K Law (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nHugh Collins \nHarmonisation by example: European laws \nagainst unfair commercial practices \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nCollins, Hugh (2010) Harmonisation by example: European laws against unfair commercial \npractices. Modern Law Review, 73 (1). pp. 89-118. ISSN 0026-7961  \n \nDOI: 10.1111\/j.1468-2230.2009.00785.x  \n \n© 2010 The Author. Journal Compilation © 2010 The Modern Law Review Limited \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/26925\/ \n \nAvailable in LSE Research Online: October 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1 \n \n \nHarmonisation by Example: European Laws against Unfair Commercial Practices  \n \n \n \n \nThe European Union is often presented as disunited and confused about it goals.  While \nthis perspective may be an apt description of the politics surrounding reforms to the \ngoverning treaties, it overlooks some of the important achievements of the European \nCommunity in laying the foundations for a competitive single market.  In particular, \nincreasingly comprehensive consumer protection measures are gradually transforming the \nlegal framework that regulates everyday transactions in all the Member States.  The \nboldest initiative enacted so far is the Unfair Commercial Practices Directive 2005.\n1\n  This \nlegislation creates uniform rules to govern all marketing practices which are designed to \ninduce consumers to purchase goods and services.  The regulation controls misleading \nadvertising, false claims about products and services, deceptive pricing, high pressure \nsales techniques, and similar sharp practices.  The Directive demonstrates an evolving \nconfidence and clear strategic approach shared by the Commission, the Council of \nMinisters, and the European Parliament.\n 2\n  Even more ambitious in some respects is the \nnext European legislation in the pipeline: the proposed Consumer Rights Directive.\n3\n  \nAlthough this latest proposal may be presented as a consolidation of more narrowly \nfocused existing European directives concerning amongst other matters consumer \nguarantees and unfair terms,\n4\n the sum is greater than the parts, because the draft directive \nenvisages a comprehensive law governing consumer contracts for the purchase of goods \nand services.  But will this new comprehensive European legislation succeed in its goal \nof harmonising the law of consumer protection across Europe in order to promote \nconsumer confidence in the single market? \nOne persistent reason to doubt that European measures will succeed in their goal \nof uniform laws is the obstacle presented by wide divergences in national traditions in \nlaw and regulation.\n5\n  To implement consumer directives, each Member State has to fit \n                                                 \n1\n Dir. 2005\/29 of the European Parliament and of the Council of 11 May 2005 concerning unfair business-\nto-consumer commercial practices in the internal market and amending Council Directive 84\/450\/EEC, \nDirectives 97\/7\/EC, 98\/27\/EC and 2002\/65\/EC of the European Parliament and of the Council and \nRegulation (EC) No 2006\/2004 of the European Parliament and of the Council, OJ L 149\/22, 11.6.2005.  \nUnless otherwise stated, all references to Articles below refer to this Directive. \n2\n See Commission, EU Policy Strategy 2007-2013: Empowering Consumers, Enhancing their Welfare, \nEffectively Protecting Them, Brussels, 13.3.2007, COM(2007) 99 final. \n3\n Com (2008) 614\/3, 8\/10\/2008.   \n4\n Dir. 93\/13 on unfair terms in consumer contracts [1993] OJ L95\/29; Dir. 1999\/44 on certain aspects of the \nsale of consumer goods and associated guarantees [1999] OJ L 171\/12.  \n5\n The possibility and desirability of uniform private laws in Europe, given the existing diversity, has been \nmuch debated in recent years, beginning with the controversy about convergence: e.g. B.S. Markesinis (ed), \nGradual Convergence: Foreign Ideas, Foreign Influences, and English Law on the Eve of the 21\nst\n Century \n(Oxford: Oxford University Press, 1994); P. Legrand, ‘European Legal Systems are Not Converging’ \n(1996) 45 ICLQ 52; P. Legrand, ‘Against a European Civil Code’ (1997) 60 M L R 44; T. Wilhelmsson, E. \nPaunio and A. Pohjolainen (eds), Private Law and the Many Cultures of Europe (The Hague: Kluwer Law \nInternational, 2007); O. Lando, ‘Can Europe Build Unity of Civil Law while Respecting Diversity?’ (2006) \n 2 \nthem into their existing regulatory and private law schemes.  Officials and judges \ninterpret the new laws in the light of national traditions and the context into which the \nEuropean measures are inserted.  It is not difficult to foresee that despite the harmonising \nefforts of the Directive, differences between national laws and practice will persist, and \nindeed that new divergences will arise.\n6\n   Acknowledging that such problems exist, the \nEuropean Commission has proposed that what is required, in addition to a clarification \nand consolidation of the existing legislation, is the development of a ‘Common Frame of \nReference’, which would provide common principles, concepts, and guidance for courts \nwhen interpreting legislation that implements Directives that affect private law.\n7\n   \nOne reason why consumer protection directives have in the past only achieved \npatchy harmonisation has been their limited ambition of only setting minimum standards.  \nMember States have been permitted to retain their existing laws in so far as they provide \nsuperior protection for consumers.\n8\n  This flexibility tolerates considerable divergence \nbetween national laws.  For instance, the control of unfair terms in consumer contracts \ndoes not apply according to the Directive to transparent terms concerning the ‘main \nsubject matter of the contract nor to the adequacy of the price or remuneration’.9 The \nminimum standard of the Directive permits national legislation to omit this restriction on \nthe scope of the law, with the possible implication in some jurisdictions that an unfair \nprice might be regarded as an unfair term, even if the term is transparent.\n10\n  Another \nreason for the persistence of differences between national laws in the context of \nconsumer law is the narrow, sector specific focus of many Directives, or their only partial \nregulation of a particular field.  Previous Directives have been confined, for instance, to \nparticular marketing techniques such as doorstep sales,\n11\n or to narrow market sectors such \nas package holidays.\n12\n  Similarly, the consumer guarantees Directive, though addressing \nsome of the principal concerns of consumers when they are disappointed with products \nwhich they have purchased, was certainly not comprehensive in its coverage of legal \nissues.  For instance, though it stresses the need for a right to repair of the goods, it \n                                                                                                                                                 \nEuropa e diritto privato 1; T. Wilhelmsson, ‘The Ethical Pluralism of Late Modern Europe and \nCodification of European Contract Law’, in J. Smits (ed), The Need for a European Contract Law: \nEmpirical and Legal Perspectives (Gronigen: Europa Law Publishing, 2005) 121; H. Collins, The \nEuropean Civil Code: The Way Forward (Cambridge: Cambridge University Press, 2008) 124.   \n6\n G. Teubner, ‘Legal Irritants: Good Faith in British Law or How Unifying Law Ends Up in New \nDivergences’ (1998) 61 Modern Law Review 11. \n7\n Communication from the Commission to the European Parliament and the Council, A More Coherent \nEuropean Contract Law: An Action Plan, Brussels, 12.2.2003, COM(2003) 68 final; Communication from \nthe Commission to the European Parliament and the Council, European Contract Law and the Revision of \nthe acquis: The Way Forward, Brussels, 11.10.2004, COM(2004) 651 final. \n8\n E.g. Art.8(2) Dir. 1999\/44, above n 4, ‘Member States may adopt or maintain in force more stringent \nprovisions, compatible with the Treaty in the field covered by this Directive, to ensure a higher level of \nconsumer protection.’ \n9\n Art. 4(1) Dir. 93\/13, above n. 4. \n10\n E.B. Capdevila and A. Gimenéz, ‘Unfair Terms in Contracts with Consumers in Spanish Law: \nInterpretation of the General Standard of Fairness and Effects of the List of Unfair Terms [2006\/2007] 8 \n(2\/3) Contemporary Issues in Law 200, 207; K.N. Christodoulou, ‘Standard Contract Terms in Greece’ \n[2006\/2007] 8 (2\/3) Contemporary Issues in Law 134, 137. \n11\n Dir. 85\/577 to protect the consumer in respect of contracts negotiated away from business premises \n[1985] OJ L372\/31.  \n12\n Dir. 90\/314 on package travel [1990] OJ L158\/59. \n 3 \ncontains no explicit reference to a remedy in compensatory damages for non-conforming \ngoods.\n13\n   \nIn these two respects, the Directive on Unfair Commercial Practices differs \nsignificantly from the earlier consumer law Directives. First, the legislation provides \ncomprehensive rules to prohibit unfair trading practices throughout Europe.  Such unfair \npractices may include misleading statements and advertising, aggressive selling \ntechniques, prevarication and obstruction in the face of complaints, and, potentially, all \nthe other tricks and devices used by dishonest traders to manipulate consumers’ \npurchasing decisions.  As well this broad coverage of all unfair commercial practices, the \nDirective differs from legislation during the past 20 years,\n14\n secondly, because it requires \nfull harmonisation or uniformity of national laws in accordance with its principles and \nrules, not merely conformity to minimum standards.  In combination, these features \nreveal that the Directive seeks to pre-empt national law in the whole field of business \npractices aimed at inducing consumers to purchase goods and services.  The proposed \nConsumer Rights Directive shares this character of providing comprehensive rules of full \nharmonisation.   \nWill this effort to pre-empt national laws succeed in achieving uniform laws \nthroughout Europe?  Even if all the Member States properly implement the Directive, \nperhaps in many cases simply by copying out its provisions verbatim, will this measure \nachieve uniformity in practice, or will the differences in language, traditions, \nphilosophies, and practice continue to provoke divergences in interpretations and \napplications of the law?   \nThe Directive on Unfair Commercial Practices strives hard to provide precise \nguidance to national authorities and courts about the scope of its provisions.  It employs \nall the implements in the legal tool-box to communicate precise requirements to national \nlegislators and courts.  As well as using general principles and standards to determine its \nscope of application, it uses more precise rules and standards that apply to particular \ntypes of marketing techniques.  Furthermore, this Directive employs unusually detailed \ndefinitions of many of its key concepts.  These definitions are striking for their avoidance \nof traditional legal concepts drawn from national traditions.  They create new concepts to \nwhich a special European meaning should be attributed, thereby reducing the risk that \nthey might be interpreted as synonymous with concepts in national legal systems.  In \naddition, the Directive creates a lengthy ‘black-list’ of prohibited commercial practices, \nwhich comprises simple, one sentence long, descriptions of unlawful marketing practices.  \nUniform practice throughout Europe is therefore sought not only by the application of \ncommon principles, standards and rules, the phrases in which often have precise technical \nmeanings, but also by the application of examples.    \nThe following discussion considers the likely degree of success of this bold \ninitiative from Europe to harmonise the law of the internal market with respect to the \nmarketing practices of businesses aimed at consumers.  We consider in detail the impact \non United Kingdom (UK) law of the implementation of the Directive by the Consumer \nProtection from Unfair Trading Regulations 2008, which entered into force on 26\nth\n May \n                                                 \n13\n M.C. Bianca and S. Grundmann (eds), EU Sales Directive Commentary (Antwerp:Intersentia, 2002) 175. \n14\n The most significant prior instance of full harmonisation is the much older directive on product liability, \nDir. 85\/374. \n 4 \n2008.\n15\n This particular example demonstrates the radical character of the Directive in its \nquest to find a way to harmonise the laws of European Member States.  For instance, to \nsatisfy the requirement of full harmonisation, these U.K. Regulations necessarily enacted \na major spring cleaning of the existing national consumer law.  Schedule 4 to the \nRegulations refers to 40 items of primary legislation and 36 statutory instruments which \nhad to be repealed or revised.  Repealed legislation includes some cornerstones of \ndomestic consumer protection law: the Trade Descriptions Act 1968 sections 1(1), 5-10, \n13-15, the Consumer Protection Act 1987 sections 20-26 (misleading price indications), \nand the Control of Misleading Advertising Regulations 1988.\n16\n  The list of repeals also \nincludes some quaint items, such as the Fraudulent Mediums Act 1951, a measure to \ncatch persons who, with intent to deceive, pretend to be in touch with dead relatives by \nspiritualistic methods.  The UK Government reported that the repeals include all the most \nimportant laws governing the regulation of commercial practices, judged by reference to \nthe fact that they accounted for over 95% of the prosecutions in the field.\n17\n The content of \nthe UK Regulations tracks closely the structure and words of the underlying Directive.  \nThe principal differences arise from the need to specify repeals of existing domestic \nlegislation and to provide the details of the methods of enforcement.   \nThrough an examination of the national implementing legislation, we will try to \nassess how successful this European initiative will prove in achieving full harmonisation \nacross the Member States.  This note examines the principal provisions of the \nRegulations and some of the controversial questions that they address.  In particular, we \nconsider the significance for UK law of two major innovations: the creation of two new \nbroad offences of ‘misleading omissions’ and ‘aggressive marketing practices’.  We shall \nalso consider the potential impact of the Directive on the private law of obligations, \nwhich may prove to be the Achilles heel for the project of harmonising the law of unfair \nmarketing practices.   \n \n \n1 The European Debate \n \nSuch a major piece of European legislation was not enacted, of course, without debates \nbetween the Member States.\n18\n  When the European Commission first proposed a \nDirective,\n19\n the UK government voiced some of the loudest objections.\n20\n  It was \n                                                 \n \n15\n SI 2008\/1277.  Unless otherwise stated, all references to Regulations below refer to these Regulations.  \n16\n S.I. 1988\/915. \n17\n DTI, Government Response to the Consultation Paper on Implementing the Unfair Commercial \nPractices Directive (December 2006) URN 06\/2121: ‘Following further consideration, and taking into \naccount the responses received to the consultation, the Government will repeal provisions in 22 of the 29 \nlaws affected. 13 of these laws will be repealed outright; 9 in part. This represents repeals in 75% of the \nlaws considered. These 22 arguably include the most important laws considered, as they account for over \n95% of prosecutions taken under all 29 between 2000-2005 (as notified to the OFT).’ \n18\n For discussion, see: H. Collins (ed), The Forthcoming EC Directive on Unfair Commercial Practices: \nContract, Consumer and Competition Law Implications (The Hague\/London: Kluwer Law International, \n2004).  S. Weatherill and U. Bernitz (eds), The Regulation of Unfair Commercial Practices under EC \nDirective 2005\/29: New Rules and New Techniques, (Oxford: Hart Publishing, 2007). \n19\n Commission, Green Paper on European Union Consumer Protection, 2 October 2001, COM(2001) 531. \n 5 \nsuggested the proposed law containing a general clause, such as a duty to bargain in good \nfaith or to trade fairly, was both dangerous and unnecessary.  It was dangerous because it \nwas so vague.  Businesses would not know what was - and what was not - lawful \ncommercial behaviour.  The legal risks in trading under such a vague standard would, it \nwas alleged, deter commerce and thereby harm the growth of the internal market.  At the \nsame time, it was asserted that the proposed Directive was unnecessary, at least in the \nUK.  Domestic consumer law already contained extensive prohibitions against unfair \ncommercial practices, such as misleading statements and advertising.  If there were any \ngaps in this legislation, a point strongly asserted by consumer interest groups and other \nprofessionals,\n21\n these could be better filled by tailored provisions that addressed \nparticular problems rather than by some sweeping general clause.\n22\n   \nBut the pressure for harmonisation at European level was compelling.  In \nparticular, the German government was in the process of reforming its domestic law and \nit wanted to generalise these new rules across Europe.  It could point to the risk, shared \nby other Member States with high levels of consumer protection laws, that these national \nmeasures might be undermined or avoided by the use of unfair commercial practices \nemanating from traders across the border.  It would be hard, for instance, for national \nauthorities to challenge misleading marketing statements to domestic consumers, such as \na claim that using a carbolic smoke ball prevents influenza, if those statements were \nproduced by a trader in a different jurisdiction where such statements were lawful.   To \npromote consumer confidence to shop abroad, particularly through the emerging Internet \nmarkets, a substantial majority of Member States agreed that it was necessary to have \nstrong, uniform laws that would weed out rogue traders wherever they might be located.\n23\n  \nIn many countries the rules on marketing do not distinguish between consumer \nprotection measures and unfair conduct by a business that harms competitors.  Indeed, an \nunfair commercial practice such as misleading advertising, if effective, should both harm \nconsumers and damage the profits of competitors.  In line with its domestic legislation, \nthe German government pressed for rules to govern unfair commercial practices, whether \nor not those practices were aimed at harming consumers or competitors.\n24\n   Application to \ncompetition between businesses was possible, because the Treaty basis for the Directive \nhad to be the internal market provision of Article 95EC in order to achieve full \n                                                                                                                                                 \n20\n Department of Trade and Industry, Green Paper on EU Consumer Protection: UK Government Response \n(London, Department of Trade and Industry, 2002); see H. Collins, ‘EC Regulation of Unfair Commercial \nPractices’, in Collins, above n 18, 1. \n21\n National Consumer Council, The Case for a General Duty – Evidence to support the NCC’s campaign \nfor a General Duty not to Trade Unfairly (London: NCC, 2002); Department of Trade and Industry, Report \nof DTI Workshop on the Evidence for a “general duty to trade fairly”.  (London: DTI, July 2003) \n22\n See, for instance, the rejection of an amendment to the Enterprise Bill that provided for a prohibition \nagainst unfair commercial practices: House of Commons, Standing Committee B, 23 April 2002, column \n248. \n23\n Commission, Follow-up Communication to the Green Paper on EU Consumer Protection, 11 June 2002, \nCOM(2002) 289 reported support from 12 Member States for a ‘framework directive’.    \n24\n The German unfair competition act of 2004 retained the approach that consolidates unfair competition \nharmful to competitors as well as consumers: J. Stuyck, ‘The Unfair Commercial Practices Directive and its \nConsequences for the Regulation of Sales Promotion and the Law of Unfair Competition’ in Weatherill and \nBernitz above n 18, 159, 169. \n 6 \nharmonisation.\n25\n Owing probably to its political origins within the Commission in the \nsphere of consumer protection, however, the Directive was confined to consumer \nprotection rather than extending to unfair competition between businesses.  As a practical \nmatter, the coverage of the Directive may prove almost as broad: if a trader markets or \npromotes products for sale to consumers in a way which creates confusion with any \nproducts, trade marks, trade names or other distinguishing marks of a competitor, this \npractice will be regarded as unfair.\n26\n In the UK, some of the prior national legislation \nsuch as the Trade Description Act 1968 applied to deceptions practiced against other \nbusinesses as well, so it was necessary to re-enact those laws in a separate statutory \ninstrument.\n27\n   \nPerhaps the deepest disagreement between the Member States during the passage \nof the Directive concerned the use of full harmonisation.\n28\n  Supporters of consumer \nprotection measures were concerned that some Member States might be forced to reduce \ntheir levels of protection.  For this reason, Denmark and Sweden ultimately opposed the \nDirective.\n29\n  A second ground for opposition to full harmonisation was a fear that the \nlegislation would lock the whole of Europe into a particular model of regulation of \nmarketing practices, which would be both hard to shift and would prohibit further \nexperimentation by Member States.\n30\n  This concern forms part of a more general \nsuspicion of the rigidity of codified laws, particularly when their transnational operation \neffectively prevents rapid reform.\n31\n  The Directive does permit some time-limited \npreservation of national consumer laws, provided that they provide better protection for \nconsumers and were measures designed to implement previous EC Directives.  But even \nsuch retentions may be challenged by the Commission as disproportionate measures.\n32\n  \nThe Directive is also stated to apply only a minimum standard for transactions in \nfinancial services and immoveable property, thereby permitting Member States to retain \n                                                 \n25\n The Recitals in the preamble to the Directive refer to the consumer protection dimension of the internal \nmarket in Art.153, but Art. 153 (5) limits consumer initiatives to minimum harmonisation and there is also \ndoubt about the question whether on its own Art.153 provides a sufficient legal basis for such qualified \nmajority measures: H-W. Micklitz and S. Weatherill, ‘Consumer Policy in the European Community: \nBefore and After Maastricht’ (1993) Journal of Consumer Policy 285; J. Stuyck, ‘European Consumer Law \nAfter the Treaty of Amsterdam: Consumer Policy in or Beyond the Internal Market?’ (2000) 37 Common \nMarket Law Review 367. \n26\n Dir Art 6(2)(a); Annex 1, para. 13.  Reg. 5(3), Sched. 1, para. 13. \n27\n The Business Protection from Misleading Marketing Regulations 2008 SI 2008\/1276; Dir.2006\/114 \nconcerning misleading and comparative advertising OJ L 376, 27.12.2006, p.21.  \n28\n H. Collins, ‘The Unfair Commercial Practices Directive’ (2005) 1 European Review of Contract Law \n417, 429-432. \n29\n Competitiveness Council, political agreement, Brussels, 25 May 2004, 9667\/04, Annex 2, para. 4. \nSimilar fears have been expressed about the proposed Consumer Rights Directive, above n 3, which, by \nbecoming full harmonisation, may remove some rights of consumers in the UK, such as the right of \nrejection of non-conforming goods. \n30\n G. Howells and T. Wilhelmsson, ‘EC Consumer Law: Has it Come of Age?’ (2003) 9 European Law \nJournal 370; G. Howells, ‘European Consumer Law- the minimal and maximal harmonisation debate and \npro independent consumer law competence,’ in S. Grundmann and J. Stuyck (eds), An Academic Green \nPaper on European Contract Law (The Hague: Kluwer Law International, 2002) 73.    \n31\n T. Wilhelmsson, ‘Private Law in the EU: Harmonised or Fragmented Europeanisation?’ (2002) 10 \nEuropean Review of Private Law 77.   \n32\n Art. 3(5); Collins, above n 28, 431. \n 7 \ntheir existing, sometimes more protective, laws in those fields.\n33\n  Apart from conceding \nthese exceptions, the Commission pressed hard for full harmonisation against the \nalternatives such as minimum harmonisation, perhaps combined with the ‘country of \norigin’ principle.  In so doing, it clearly prioritised the competitiveness of the internal \nmarket over concerns either for conserving even higher levels of consumer protection in \nsome countries or for reserving scope for national innovation.   \nIn a reference for a preliminary ruling, the European Court of Justice reinforced \nthe mandatory and pre-emptive quality of the Directive.\n34\n  It declared that a Belgium law \nthat prohibited the marketing practice of ‘combined offers’ (where the acquisition of one \nproduct is tied to the acquisition of other products) was contrary to the Directive because \nthe national law absolutely prohibited such practices, whereas the Directive requires the \nnational legislation merely to require an assessment of the practice according to the \nvarious definitions of unfair commercial practices.  Hence the Belgium law should have \nimitated the approach of the U.K. in respect of the prohibition against the misuse of the \nphrase ‘by royal appointment’ contrary to s.12 Trade Descriptions Act 1968, an offence \nwhich is preserved, but is committed only if the conduct  also satisfies the requirements \nof being an unfair commercial practice under the Regulations. \nHaving lost the debate over the need for the proposed Directive, the UK \ngovernment concentrated its efforts on improving the content of the legislation.  Instead \nof a positive duty to trade fairly, as originally mooted, the Directive creates a negative \nduty not to trade unfairly.  The central principle or general clause of Regulation 3.-(1) \nstates boldly: ‘Unfair commercial practices are prohibited…’  This shift to negative \nterminology fits more comfortably into the traditional British liberal perspective on the \nstate that what is not prohibited is therefore permitted, thereby avoiding the appearance of \nthe imposition on businesses of a vague positive duty to behave in ways dictated by the \ngovernment.      \nAs well as the general clause, the Directive achieves greater specificity by the \nintroduction of a more detailed description of the most likely forms of unfair commercial \npractices in Articles 6-9: the prohibitions against misleading practices, misleading \nomissions, and aggressive practices.  In addition, following the pattern set by Swiss law, \nSpanish law and the German legal reform, the Directive includes an Annex that provides \na lengthy description of commercial practices which ‘in all circumstances shall be \nregarded as unfair’.35  Given the wide disparity of the national laws of Member States,36 \n                                                 \n33\n Art 3(9). \n34\n Joined Cases C-261\/07 TB-NAB NV v Total Belgium and C-299\/07 Galatea BVBA v Sonoma Magazines \nBelgium NV, 23 April 2009.  \n35\n Art.5.5, referring to Annex 1. \n36\n The Commission obtained detailed information about the laws from a large research team led by H-W. \nMicklitz, which was put on the web: \nhttp:europa.eu.int\/comm.\/consumers\/policy\/developments\/fair_comm_pract\/.  See also: F. Henning-\nBodewig, Unfair Competition Law: European Union and Member States (The Hague: Kluwer Law \nInternational, 2006); R. W. de Very, Towards a European Unfair Competition Law: A Clash Between \nLegal Families (Leiden\/Boston: Martinus Nijhoff, 2006).  Another report obtained by the Commission, led \nby R. Schulze and H. Schulte-Nocke, investigated the potential impact of the Directive on national laws: \nhttp:\/\/europa.eu.int\/comm\/consumers\/cons_int\/safe_shop\/fair_bus_pract\/impact_assessment_en.pdf.  For \nan assessment of the likely impact in the UK: R. Bradgate, R. Brownsword, C. Twigg-Flessner, The Impact \nof Adopting a Duty to Trade Fairly, a report prepared for the Department of Trade and Industry by Institute \nfor Commercial law Studies, University of Sheffield (July, 2003). \n 8 \nagreement on all these detailed provisions was a considerable achievement.  It is expected \nthat these specific rules and examples will cover the vast majority of cases and that it will \nbe rare to have recourse to the general prohibition against unfair commercial practices.  \nAs well as the general clause in Regulation 3, the UK Regulations therefore include both \nthree more specific (though still broad) prohibitions – the ‘mini general clauses’ of \nmisleading actions (Regulation 5), misleading omissions (Regulation 6), and aggressive \ncommercial practices (Regulation 7) – and a ‘black list’ of 31 factually described \npractices that are automatically regarded as unfair practices (Schedule 1).    \nFrom an original position of scepticism with respect to the value of an initiative \ncontaining a general clause, the UK government has, after all, found merit in this \nEuropean law.  The legislation has been presented by the Ministry of Business Enterprise \nand Regulatory Reform (BERR) as a desirable modernisation and simplification of the \nlaw.  It will be ‘better regulation’, because it will be shorter and state general standards \nrather than endless complex detail.  ‘This follows the Government’s belief that the \nexisting consumer protection framework is complicated and fragmented and does not \nreflect the requirements of a simplified and modern legal framework’.37   The principal \nbenefits of the Directive and the Regulations are perceived to lie in the way uniform laws \nshould make it easier for UK businesses to market their products to consumers in other \nMember States without falling foul of local marketing regulations, whilst at the same \ntime contributing to a high standard of consumer protection.   \n \n2 The General Clause \n \nRegulation 3 (3) A commercial practice is unfair if- \n(a) it contravenes the requirements of professional diligence; and \n(b) it materially distorts or is likely to materially distort the economic behaviour \nof the average consumer with regard to the product. \n \nDoes this general clause in Regulation 3(3) have a significant role to play in the \napplication of the new law?  The legislation provides that there is no need to invoke the \ngeneral clause in Regulation 3(3) if a more particular provision is applicable.  The ‘mini-\ngeneral clauses’ and the ‘black list’ are self-standing offences, so that when they apply to \nthe facts of a case, no reference to the general clause is required.  Given that the black list \nidentifies the most common forms of deception and trickery in its list of 31 items and that \nthe mini general clauses have a wide range, it seems likely that the general clause will \nrarely be needed.  The case for having a general clause is to provide a means by which \nenforcement authorities can attack novel forms of unfair commercial practices that have \nnot been foreseen by the legislation.   The general clause is supposed to make the \nlegislation ‘future-proof’.  The prior UK law also had a mechanism for achieving this \ngoal in Part II of the Fair Trading Act 1973.  In theory, this legislation enabled the Office \nof Fair Trading (OFT) to introduce new statutory instruments to counter novel kinds of \nunfair commercial practices.  In practice, however, the mechanism proved cumbersome \nand fell into disuse.  It proved simpler for the OFT to publicise a new abusive marketing \ntechnique and then ask the relevant Minister to do something about it in the form of a \n                                                 \n37\n DTI, Government Response to the Consultation Paper on Implementing the Unfair Commercial Practices \nDirective (December 2006) URN 06\/2121.   \n 9 \nstatutory instrument.  The general clause in Regulation 3(3) should remove the need to \ncreate fresh regulations, provided that the impugned marketing technique falls within its \nscope.  We should recognise, however, that the existence of the general clause opens the \ndoor to the possibility that when a novel unfair marketing technique comes along, which \ndoes not appear to be covered by the more specific rules and examples, national courts \nmay differ in their applications of the general clause.   \nIt is worth considering, therefore, how far the European legislator has been able to \ncommunicate precise standards through the general clause.  In specifying the conditions \nto govern its scope, the general clause introduces the concepts of the breach of the \nrequirements of ‘professional diligence’, and ‘material distortion’ of economic behaviour \nof the ‘average consumer’.  In accordance with the Directive, the Regulations provide \ndetailed definitions of these three concepts.\n38\n  Some of these concepts are repeated in the \nmini general clauses, thus revealing how they inform the underlying philosophy and \npurpose of the legislation.   \n \nProfessional Diligence \n \nThe concept of ‘professional diligence means the standard of special skill and care which \na trader may reasonably be expected to exercise towards consumers which is \ncommensurate with either- (a) honest market practice in the trader’s field of activity, or \n(b) the general principle of good faith in the trader’s field of activity.’39  The concepts of \nspecial skill and care, honesty, and good faith are not further defined.  Despite its brevity, \nthis definition contains many intertwining strands.  Its first element comprises the notion \nthat ‘professionals’ (a poor translation of the French concept that includes all kinds of \nbusinesses) owe a duty to bargain and to behave with care when dealing with consumers.  \nThe standard of care itself is fixed by a combination of the reasonable expectations of \nconsumers and the idea that the trader should possess the appropriate skills for that line of \nbusiness.  But this standard of care is further specified by the minimum requirement that \nit must be either honest or comply with standards of good faith.  In trying to define this \nconcept of professional diligence, the legislature is struggling with two problems.  On the \none hand, it wants the standard of care to reflect the appropriate level of expertise for the \ntrader:  if the business holds itself out as having special expertise, the reasonable \nexpectation of the consumer rises, and so accordingly the standard of care should be more \ndemanding.  On the other hand, the legislation does not want to endorse the low level of \nexpectations which consumers may have when dealing with certain kinds of notorious \nrogue traders – perhaps used car salesmen or organisers of prize lotteries.  Thus the \nsliding scale of reasonable care may be adjusted according to the ‘field of activity’, but \nthere is an attempt to place a floor on acceptable behaviour by reference to honesty or \ngood faith.  The concept of professional diligence resembles the private law concept of \n‘culpa in contrahendo’ by its attempt to combine the private law ideas of a duty to \nbargain with care and a duty to bargain in good faith into a single formulation.  Has the \nattempt to impose a clear minimum standard on acceptable behaviour by use of the novel \nconcept of professional diligence been successful?   \n                                                 \n38\n Reg. 2(1). \n39\n Reg.2(1). \n 10 \nIf a rogue trader uses selling techniques that avoid outright dishonesty, but \nnevertheless seem misleading and rather sharp practice, will this conduct be caught by the \ngeneral clause?  The official guidance issued by BERR and the OFT argues that ‘poor \ncurrent practice that is widespread in an industry\/sector cannot amount to an acceptable \nobjective standard’ that meets the requirement of the reasonable expectation of the \nconsumer.\n40\n  This interpretation of the Regulations assumes that the concept of honesty \nhas an objective element that sets a standard of care that may rise above current market \npractice.  Although that view is likely to be correct with respect to the alternative concept \nof good faith, at least if it is awarded the meaning it usually has in European private law \nsystems, it is hard to interpret the concept of honesty in other than its common legal \nmeaning, which usually expresses a strong subjective element.  Dishonest behaviour \nrequires the person whose conduct is being impugned to appreciate that his behaviour is \ndeviant or falling below expected standards.  If a business merely follows standard \nmarket practices used by competitors, an unscrupulous trader may think this conduct is \nhonest enough.  This concern that the standard of honesty may permit low standards of \ncare by reference to subjective beliefs is further strengthened by the enforcement \nprovisions in the Regulations.  Unlike the strict liability rules of the remainder of the \nRegulations, in order to obtain a conviction for a criminal offence under the general \nclause, the prosecution must prove mens rea in the form of intention or recklessness.\n41\n  \nThis reinforcement of a subjective approach is, however, slightly diluted because a trader \nwill be regarded as reckless if he engages in a commercial practice without regard to \nwhether the practice contravenes the requirements of professional diligence, whether or \nnot the trader actually believes that the practice might contravene those requirements.\n42\n  \nEven so, the wording of the general clause does seem to allow considerable scope for \ntraders to insist that their practices, though perhaps rather sharp or unscrupulous, avoid \ndishonesty and are so common in the line of business that consumers have no reasonable \nexpectation of any different behaviour.   \nIf that rather pessimistic view of the meaning of professional diligence is correct, \nit tends to confirm the view that the general clause merely provides a safety net behind \nthe more particular provisions, one with a rather large mesh.  Furthermore, the \nambiguities in the concepts of good faith and honesty seem to provide considerable scope \nfor divergence between national legal systems.  It is worth noting, however, one final \nroute for tightening up the meaning of the clause, at least at a national level.  There is an \nincentive for honest traders to create and subscribe to a code of practice in the hope of \ninfluencing or even determining what a court might regard as honest practice, which will \nsimultaneously protect them from criticism under the general clause whilst flushing out \nrogue traders who do not sign up to the code of practice.\n43\n \n \nAverage Consumer \n \n                                                 \n40\n BERR\/OFT, Consumer Protection from Unfair Trading: Guidance on the UK Regulations (May 2008) \nimplementing the Unfair Commercial Practices Directive (2008) para.10.5. \n41\n Reg. 8(1).   \n42\n Reg.8(2). \n43\n The honest traders need to be careful, however, since the promotion of any unfair commercial practice in \na code of conduct is itself an unfair commercial practice: Reg. 4.  \n 11 \nThe second concept in the general clause regarding ‘the distortion of the economic \nbehaviour of an average consumer’ provoked considerable controversy.  The most \ncontentious problem concerned the definition of an ‘average’ consumer, a concept that is \nalso employed in the three mini general clauses.\n44\n  Since rogue traders may prey upon \nvulnerable groups, the question arose whether the concept should represent an average \nperson who would not be influenced by suspicious and misleading practices or should the \nlaw protect the gullible?   In its interpretation of previous European Directives in \nconsumer law, the European Court of Justice (ECJ) had favoured the concept of the \naverage consumer, who is presumed to be reasonably well informed, reasonably \nobservant and circumspect, though taking into account social, cultural and linguistic \nfactors.\n45\n  Critics of the proposed Directive were concerned that such a concept of the \naverage consumer would leave vulnerable groups unprotected against deceptive and \naggressive sales practices.  Following proposed amendments by the European Parliament, \nthe Directive modified the standard of the average consumer in two respects.  In the first \nplace, where the commercial practice is directed to a particular group, the concept of an \naverage consumer should be read as the average member of that particular group.\n46\n  \nSecondly, where a clearly identifiable group is particularly vulnerable to a commercial \npractice by reason of infirmity, age or credulity, and where the practice is likely to distort \nonly the behaviour of that group, the reference to the average consumer should be \nunderstood as referring to the average of that group.\n47\n   Suppose, for instance, a credit \nbusiness places advertisements in local papers offering in a misleading way low interest \nrate terms for home loans to those urgently needing to re-mortgage property in order to \navoid higher interest rates that commence at the end of a period of a fixed rate loan.  Such \nan advertisement is clearly directed at a particular group and so falls within the first \nexception to the average consumer test.  It is less clear that it falls into the second \nexception, unless it can be argued that this identifiable group of sub-prime borrowers is \nlikely to be particularly credulous.  A clearer example of the second group would be \nadvertisements that target persons with a particular illness or disability in order to sell \nsome new alleged wonder drug.\n48\n  One welcome effect of these new rules may be to \nplace a curb on some of the emotive advertising techniques aimed at children and young \npeople, who do not yet have the experience to know that if it sounds too good to be true, \nit is.  The concept of the ‘average consumer’ in the Directive now seems sufficiently \nprecise to achieve a high level of uniformity, because the legislators have sensibly built \non and articulated further the notions developed originally by the ECJ, rather than starting \nafresh. \n \nMaterial Distortion \n                                                 \n44\n S. Weatherill, ‘Who is the ‘Average Consumer’?’ in Weatherill and Bernitz, above n 18, 115. \n45\n Reg. 2(2) endorses this standard for unfair commercial practices, though omitting any express reference \nto social, cultural, and linguistic factors, which are sometimes important in cross-border trade: e.g. C-\n220\/98 Estée Lauder Cosmetics GmbH & Co OHG v Lancaster Group (Lifting) [2000] ECR I-117, ECJ.   \n46\n Reg. 2(4).  The Regulations, unlike the Directive, make it clear that these special concepts of the average \nconsumer should be applicable not only to the general test of unfairness but also to the more specific \nprohibitions against misleading and aggressive practices. \n47\n Reg. 2(5). \n48\n Schedule 1, paragraph 17 may also cover this case: ‘Falsely claiming that a product is able to cure \nillnesses, dysfunction or malformations.’ \n 12 \n \nThe final requirement under the general clause is that the commercial practice should be \nlikely ‘to materially distort the consumer’s economic behaviour’.  In the Regulations, this \nrequirement is further defined as ‘appreciably to impair the average consumer’s ability to \nmake an informed decision thereby causing him to take a transactional decision that he \nwould not have taken otherwise’.49  Much the same phrase referring to a transactional \ndecision that would not have been taken otherwise applies also to the three mini general \nclauses.  This definition (drawn from the Directive) is odd, because it seems to assume \nthat the only cause of a material distortion of economic behaviour is conduct that impairs \nthe consumer’s access to accurate information, whereas other factors such as aggressive \nsales techniques may disrupt the operation of a competitive market.   The Directive might \nhave been clearer without this particular definition.\n50\n A ‘transactional decision’ is defined \nextremely broadly to include not only a decision to purchase goods and services, but also \nthe selection of the terms of purchase, whether to make a purchase with this trader at all, \nwhether to pay a bill, whether to cancel the contract, and whether to exercise any \ncontractual rights.\n51\n  The purpose of the requirement of ‘material distortion’, which only \nappears in the general clause and not the mini general clauses, appears to be primarily to \nexempt unfair commercial practices that did not influence the consumer’s decision, \nperhaps because the claims were so far fetched that no one took them seriously.\n52\n  It is \nalso designed to exclude from the scope of the uniform European law any regulation \nbased on considerations of taste and decency, leaving national legislatures free to occupy \nthat field.\n53\n   However, the materiality requirement also appears to exempt statements \nregarding minor matters that are not commercially significant and do not affect the fitness \nof a product for its normal purposes.  In the Trade Descriptions Act 1968 there was also a \nrequirement that the false trade description should be ‘false to a material degree’,54 which \nsuggests that the notion of materiality also refers to the degree of error.  For example, if \nthe packaging states that a box contains 1000 nails, but in fact the box was one nail short \nof that number, the inaccuracy might not be regarded as ‘material’.  In the common law \nconcept of a ‘material misrepresentation’, the requirement of materiality is similar, \nthough with the additional element that the claimant must demonstrate a causal link \nbetween the misrepresentation and the decision that is sought to be avoided.  In the case \nof the Regulations, however, proof of such a causal link seems unnecessary, because the \ngeneral clause only requires the likely distortion of economic behaviour.   \nAlthough the materiality requirement seems reasonably clear in its meaning, from \na practical point of view it may serve to obstruct enforcement of the general clause.  \nAssuming that the general clause is employed as a safety net when the other prohibitions \ndo not apply, traders accused of committing an unfair commercial practice will certainly \ntry to insist that any impugned aspects of their conduct did not distort the economic \n                                                 \n49\n Reg. 2(1).  \n50\n For more detailed criticism to similar effect: H-W. Micklitz, ‘The General Clause on Unfair Practices’, in \nG. Howells, H-W. Micklitz, T. Wilhelmsson, European Fair Trading Law: The Unfair Commercial \nPractices Directive (Aldershot: Ashgate, 2006) 83, 106-8. \n51\n Reg.2(1). \n52\n Though such exaggerated statements that are not meant to be taken literally are exempted independently \nby Reg. 2(6). \n53\n Recital 7 to the preamble of Dir. 2005\/29.   \n54\n Trade Descriptions Act 1968 s.3(1). \n 13 \nbehaviour of consumers.  It may prove hard for the prosecuting authorities to produce \nevidence to the contrary.  That difficulty, which may be addressed differently in national \njurisdictions, may again provoke some divergence. \n \n3.  Misleading Actions \n \nThe mini general clauses should provide more determinate guidance for national \nlegislation and courts in relation to all the most common forms of unfair commercial \npractices.  The prohibition against misleading actions, which is implemented by \nRegulation 5, commences with a general principle, but then guides its detailed application \nthrough elaborate rules.  The central prohibition is against a commercial practice: \n(a) if it contains false information and is therefore untruthful in relation to any of \nthe matters in paragraph (4) or if it or its overall presentation in any way deceives \nor is likely to deceive the average consumer in relation to any of the matters in \nthat paragraph, even if the information is factually correct; and \n(b) it causes or is likely to cause the average consumer to take a transactional \ndecision he would not have taken otherwise.\n55\n \nRegulation 5(4) then provides a long list of the matters about which false information \nshould not be given: \n(a) the existence or nature of the product; (b) the main characteristics of the \nproduct (as defined in paragraph 5); (c) the extent of the trader’s commitments; \n(d) the motives for the commercial practice; (e) the nature of the sales process; (f) \nany statement or symbol relating to direct or indirect sponsorship or approval of \nthe trader or the product; (g) the price or the manner in which the price is \ncalculated; (h) the existence of a specific price advantage; (i) the need for a \nservice, part, replacement or repair; (j) the nature, attributes and rights of the \ntrader (as defined in paragraph 6); (k) the consumer’s rights or the risks he may \nface.   \nRegulation 5(5) further spells out in a detailed list what may be understood to be the \n‘main characteristics of the product’.  As well as expected items such as the composition \nof the product and its fitness for purpose, it also includes ‘(g) after-sale customer \nassistance concerning the product; (h) the handling of complaints about the product…(p) \ngeographical or commercial origin of the product; (q) results to be expected from use of \nthe product.’ \n This level of detail in the mini general clause turns it into an extensive set of \nprecise rules, leaving little scope for deviation between national legal systems.  \nDivergences may arise, however, with respect to the question of whether the ‘overall \npresentation’ ‘is likely to deceive the average consumer’.  Some legal systems may be \nmore solicitous of the consumer who is misled than others, though the application of the \naverage consumer test, with its insistence that such a consumer is circumspect, should \ncurtail excessive protectionism.  This approach to deliberately confusing statements \nseems much clearer than the prior UK law, which extended protection to statements \n                                                 \n55\n Regulation 5(3) also contains two further specific prohibitions: (a) marketing practices that create \nconfusion with any products, trade marks, trade names or other distinguishing marks of a competitor; or (b) \nany failure by a trade to comply with a commitment contained in a code of conduct with which the trader \nhas indicated that he has undertaken to comply. \n 14 \nwhich, though not false, were misleading.\n56\n  The concept of a misleading statement was \ndefined as one that was likely to be taken as a trade description that was false to a \nmaterial degree.  This confusing notion of deeming a true statement to be false on the \nbasis of its degree of falsehood is replaced by the more precise and relevant question of \nwhether the consumer is likely to be misled in the sense of being affected in a purchasing \ndecision.\n57\n   \n Although the prohibition against misleading actions is largely a restatement and \nmore detailed elaboration upon the prohibitions in the existing UK laws under the Trade \nDescriptions Act 1968, Consumer Protection Act 1987 ss. 20-26 (misleading price \nindications), and the Control of Misleading Advertising Regulations 1988, in several \nrespects the new Regulations are more extensive in their scope.  There is no longer the \nrequirement that the false description should be ‘applied’ to goods.58 Under that \nrequirement, precedents indicated that a false statement made after a sale of goods had \nbeen effected did not amount to a commission of an offence.\n59\n  Under the new legislation, \na post-sale statement may be an offence, as for example in an inaccurate statement about \nthe rights of the consumer in relation to a complaint.  Indeed, the new Regulations pay \nconsiderable attention to post-sales matters with a view to deterring the ‘customer is \nalways wrong’ strategy adopted by some traders.  This practice consists of never really \ndealing with complaints or telling the consumer that he or she needs to take some \nunnecessary or expensive remedial step such as replacement of a part.\n60\n   The rules on \nmisleading prices in the Consumer Protection Act 1987, Part III, did not generally apply \nto the prices of immoveable property,\n61\n though estate agents could be prosecuted for false \nstatements under separate legislation,\n62\n whereas the new Regulations, through the broad \ndefinition of the concept of a ‘product’, apply to statements and commercial practices \nregarding ‘immoveable property, rights and obligations’.63 The definition of what \namounts to a misleading price was detailed in the 1987 Act,\n64\n whereas the Regulation \napplies the two general tests recited above in Regulation 5(4)(g) and (h).  In so far as the \n1987 Act tries to expand its coverage by, for instance, explicitly including false \nstatements that the trader expects the price to go up (when he does not in fact have such \nan expectation), it is possible that Regulation 5(4) may not exactly cover this kind of \n                                                 \n56\n Trade Descriptions Act 1968 s.3(2). \n57\n The European formulation had already been introduced to UK law by the Control of Misleading \nAdvertising Regulations 1998, Reg.2(2). \n58\n Trade Descriptions Act 1968 s.1(1) and s.4. \n59\n Hall v Wickens Motors Ltd [1972] 1 WLR 1418; D. Oughton and J. Lowry, Consumer Law 2\nnd\n edn \n(London: Blackstone, 2000) 496. \n60\n H. Collins, Regulating Contracts (Oxford: Oxford University Press, 1999) 343; D.I. Greenberg, ‘Easy \nTerms, Hard Times: Complaint Handling in the Ghetto’, In L. Nader (ed.), No Access to Law: Alternatives \nto the American Judicial System (New York: Academic Press, 1980) 379. \n61\n S. 23.  \n62\n Property Misdescriptions Act 1991; Property Misdescriptions (Specified Matters) Order 1992, SI \n1992\/2834, Sched. Para.16. \n63\n Reg. 2(1). \n64\n S. 21. \n 15 \nmisleading statement.  However, this kind of deceptive practice is included independently \nin the black list of prohibited practices.\n65\n \n \n4. Misleading Omissions \n \nAlthough the prohibition on misleading actions seems likely to achieve a high degree of \nuniformity in the laws of Member States, building as it does on prior legislation and \nfitting fairly neatly into existing national provisions, the ban on misleading omissions \nfaces an uphill struggle.  One frequently noted divergence between national legal systems \nis the extent to which they permit liability for omissions.  UK law generally rejects such \nliability in cases, for instance, of a failure to disclose material information.  Departing \nfrom this principle, and indeed probably going further in this direction than most \nEuropean legal systems,\n66\n the Directive introduces the offence of committing an unfair \ncommercial practice by a misleading omission.    \nRegulation 6.-(1) A commercial practice is a misleading omission if, in its factual \ncontext, taking into account of the matters in paragraph (2)-  \n(a) the commercial practice omits material information, \n(b) the commercial practice hides material information, \n(c) the commercial practice provides material information in a manner which is \nunclear, unintelligible, ambiguous or untimely, or \n(d) the commercial practice fails to identify its commercial intent, unless this is \nalready apparent from the context, \nand as a result it causes or is likely to cause the average consumer to take a \ntransactional decision he would not have taken otherwise. \nParagraph (2) explains that the factual context should include the limitations of the \nmedium used to communicate the commercial practice (including limitations of space \nand time), taking into account other measures taken by the trader to make the information \navailable by other means.  Under this crucial qualification, therefore, the type or mode of \ncommunication might justify an omission of material information.  Bold claims on a \nchocolate bar wrapper that purchasers might win a luxury holiday, whilst omitting to \nmention the need to satisfy various onerous conditions, might avoid an offence either on \nthe ground that there simply was not space available on the wrapper to mention these \nconditions, or perhaps and with greater certainty of avoiding an offence by stating on the \nwrapper that the offer is subject to various conditions that can be discovered easily, for \ninstance, on a website.    \n \nDuty to Disclose Material Information \n  \nThe major innovation in this measure from the point of view of UK law is the duty to \ndisclose ‘material information’ in Regulation 6(1)(a).  The other examples of misleading \nomissions, such as the provision of partial or ambiguous information, could probably be \n                                                 \n65\n Schedule 1, para. 7 ‘Falsely stating that a product will only be available for a very limited time, or that it \nwill only be available on particular terms for a very limited time, in order to elicit an immediate decision \nand deprive consumers of sufficient opportunity or time to make an informed choice.’ \n66\n For a helpful comparative study: R. Sefton-Green (ed), Mistake, Fraud and Duties to Inform in European \nContract Law (Cambridge: Cambridge University Press, 2005).   \n 16 \nfitted into the existing notions of misleading trade practices or misleading price \nindications.  In the case of misleading price indications, for instance, the UK legislation \nspecified that an indication might be misleading if it omitted information that a consumer \nmight reasonably expect to have been included.\n67\n   Prior consumer protection law has not, \nhowever, imposed a general duty to provide material information.  Instead, legislation \nidentified particular instances where such information had to be supplied.  For instance, it \nwas a misleading price indication if a statement, though correct at the time it was given, \nsubsequently became false and the trader failed to take reasonable steps to prevent \nconsumers from relying on the indication.\n68\n  There were also sector specific duties to \nprovide information, such as the Tourism (Sleeping Accommodation Price Display) \nOrder of 1977 that required hotels to post the prices for rooms in the reception area, \nwhich is now revoked.\n69\n  \n Under the duty to provide ‘material information’, the crucial question is what in \nany particular circumstance should be regarded as material.  Regulation 6(3) explains that \n‘material information’ is ‘the information which the average consumer needs, according \nto the context, to take an informed transactional decision’.   But what information does a \nconsumer ‘need to know’ as opposed to ‘would like to know’? One assumes that such \nmaterial information includes the price and the main characteristics of the product or \nservice.  The health and safety risks of a product are also regarded as necessary \ninformation, though the existing rules on product safety and risks that must be disclosed \nare preserved by the Directive.\n70\n  With regard to price information, the Code of Practice \nfor Traders on Price Indications no longer has effect, but BERR has issued non-statutory \nbest practice guidance on pricing, which seeks to comply with the new Regulations.\n71\n  In \ntheir guidance on the Regulations, BERR and the OFT suggest other examples of \nmaterial information: the minimum length of a service contract, the need to make other \npurchases in addition to the contemplated transaction, whether or not the product is new \nor second hand, and whether a new television is ready for digital transmissions (i.e. \nwarnings of technological obsolescence).\n72\n  The requirement to disclose what the \nconsumer ‘needs’ is an objective requirement in addition to the requirement that an \naverage consumer would have been influenced in a transactional decision by the absence \nof that information.\n73\n  The information must be material in that transactional influence \nsense, but additionally it must have been in the view ultimately of a court also necessary \ninformation for the consumer to make an informed decision.   It is here that opportunities \n                                                 \n67\n Consumer Protection Act 1987, s. 21(1). \n68\n Consumer Protection Act 1987, s. 20(2). \n69\n SI 1977\/1877.  By virtue of Regulation 6(3)(b), sector specific duties to provide material information that \noriginate from EU Directives, such as the Package Travel, Package Holidays and Package Tours \nRegulations 1992 SI 1992\/3288, Electronic Commerce (EC Directive) Regulations 2002 SI 2002\/2013, The \nConsumer Protection (Distance Selling) Regulations 2000 SI 2000\/2334 as amended, but otherwise such \nduties to provide information have either been abolished or must be read in such a way as to ensure \nconformity with Regulation 6(1)(a) \n70\n Dir. 3.3.  The General Product Safety Regulations 1994, SI 1994\/2328, Reg. 8 requires producers to \nprovide consumers with the relevant information to enable them to assess the risks inherent in a product.   \n71\n BERR Pricing Practices Guide: Guidance for traders on good practice in giving information about \nprocess  URN 08\/918.   \n72\n BERR\/OFT,  above n. 40, para.7.18. \n73\n See: T. Wilhelmsson, ‘Misleading Practices’ in Howells, Micklitz, and Wilhelmsson, above n 50, 123, \n149. \n 17 \narise for divergences between national enforcement authorities.  Consider, for instance, \nenvironmental issues: is it necessary for the consumer to be given information about the \npower consumption of appliances, the emissions of cars, the potential for recycling, or the \nsustainable sourcing of an agricultural product?  Does the consumer need to know \nwhether eggs have been produced in factory conditions or from free range chickens?   \nNational courts will be required to make difficult decisions on such issues as whether \ninformation about environmental risks and humanitarian concerns was necessary material \ninformation in the circumstances.  It should be remembered, though, that even if a court \ndetermines that omitted information was both material and necessary for the consumer, \nthe trader may still avoid liability if the medium of communication and other \ncircumstances can justify the brevity of the communication. \n \nInvitation to Purchase \n \nThe potential uncertainty and divergence created by the duty to provide material \ninformation to consumers is considerably reduced, however, by more detailed regulation \nof omissions in the most common situation of an ‘invitation to purchase’.  An invitation \nto purchase is defined broadly to include any ‘commercial communication which \nindicates characteristics of the product and the price in a way appropriate to the means of \nthat commercial communication and thereby enables the consumer to make a purchase’.74  \nThis definition includes not only offers to sell, but also ‘invitations to treat’, such as \nputting goods with price labels on display in a shop, a price list in a bar or outside a \nparking garage, or an advertisement for the sale of goods in a magazine that includes an \norder form that can be completed and sent to the trader.    Owing to the broad definition \nof ‘product’, the duty to supply material information applies to goods and services.  In \nrelation to ‘invitations to purchase’, Regulation 6(4) specifies that the following \ninformation will always be deemed to be material: \n(a) the main characteristics of the product, to the extent appropriate to the medium \nby which the invitation to purchase is communicated and the product; \n(b) the identity of the trader, such as his trading name, and the identity of any \nother trader on whose behalf the trader is acting; \n(c) the geographical address of the trader and the geographical address of any \nother trader on whose behalf the trader is action; \n(d) either – (i) the price, including any taxes; or (ii) where the nature of the \nproduct is such that the price cannot reasonably be calculated in advance, the \nmanner in which the price is calculated; \n(e) where appropriate, either- (i) all additional freight, delivery or postal charges; \nor (ii) where such charges cannot reasonably be calculated in advance, the fact \nthat such charges may be payable; \n(f) the following matters where they depart from the requirements of professional \ndiligence- (i) arrangements for payment, (ii) arrangements for delivery, (iii) \narrangements for performance, (iv) complaint handling policy; \n(g) for products and transactions involving a right of withdrawal or cancellation, \nthe existence of such a right.    \n                                                 \n74\n Reg.2(1). \n 18 \nIt is possible, according to the nature of the transaction and the context, that other \ninformation will be regarded as material to an invitation to purchase: the above list is \nmerely a minimum set of requirements.  The Schedule of prohibited practices effectively \nadds an item to this list:  \nMaking an invitation to purchase products at a specified price without disclosing \nthe existence of any reasonable grounds the trader may have for believing that he \nwill not be able to offer for supply, or to procure another trader to supply, those \nproducts or equivalent products at that price for a period that is, and in quantities \nthat are, reasonable having regard to the product, the scale of the advertising of \nthe product and the price offered (bait advertising).\n75\n \nIn practice, of course, much of this information will be readily apparent without the need \nfor the trader to make a special communication.  When purchasing goods in a shop, for \ninstance, putting the goods on display with a clearly marked price should normally satisfy \nthe trader’s duty to provide information.   When traders seek to sell on the Internet, \nhowever, they will need to ensure that the above information is clearly displayed or at \nleast is readily discoverable by clear links posted to other pages of the website.   \n The most troublesome aspect of the list of material information that must be \ndisclosed with an invitation to purchase is likely to be item (f) above.   These are matters \nthat only must be disclosed in the communication of the invitation to purchase if they \ndiffer from what a consumer might reasonably expect from a trader, in accordance with \nhonest market practice or good faith.   Suppose, for instance, that the trader provides a \nremoval of furniture service and requires payment in advance for the work rather than \nonly after satisfactory completion; does the trader have to reveal this pre-payment \nrequirement prior to the consumer agreeing to contract for the service?  The answer to \nthat question depends rather unsatisfactorily on whether pre-payment is regarded as \nhonest or good faith practice in the removal of furniture trade.   Particularly odd is the \nnotion of a complaint handling policy that deviates from the requirements of professional \ndiligence.  If the trader handles complaints by never really doing anything about them or \nby demanding vast amounts of evidence to back up a complaint that few, if any, \nconsumers will bother to satisfy, assuming that this conduct falls below the standards of \nprofessional diligence, the trader will be under a legal duty to reveal this practice, which \nseems a very unlikely scenario.  It might have been better if the Directive and the \nRegulation had insisted that an accurate description of the complaint handling procedure \nshould be material information in invitations to purchase.   More generally, we can \npredict that the unfamiliarity of the concept of a duty of disclosure of material \ninformation combined with the reinsertion of the vague notion of professional diligence is \nlikely to permit considerable divergence between national applications of this regulation. \n \n \n \n5. Aggressive Commercial Practices \n \nPerhaps the greatest innovation of the Regulations from the point of view of UK \nconsumer law is the prohibition of aggressive commercial practices.   \n                                                 \n75\n Reg. Schedule 1. 5. \n 19 \nRegulation 7.-(1) A commercial practice is aggressive if, in its factual context, \ntaking account of all of its features and circumstances- \n(a) it significantly impairs or is likely significantly to impair the average \nconsumer’s freedom of choice or conduct in relation to the product concerned \nthrough the use of harassment, coercion or undue influence; and \n(b) it thereby causes or is likely to cause him to take a transactional decision he \nwould not have taken otherwise.  \nThe concept of ‘undue influence’ is further defined for this purpose as ‘exploiting a \nposition of power in relation to the consumer so as to apply pressure, even without using \nor threatening to use physical force, in a way which significantly limits the consumer’s \nability to make an informed decision.’76  The Regulations also add that, in determining \nwhether a practice is aggressive, account should be taken of ‘the exploitation by the \ntrader of any specific misfortune or circumstance of such gravity as to impair the \nconsumer’s judgment, of which the trader is aware, to influence the consumer’s decision \nwith regard to the product.’77  Taken together with the possible modifications to the \nconcept of the average consumer in the case of vulnerable consumers, these provisions \nintroduce a general offence that applies not only when the trader behaves in an aggressive \nor threatening manner, but also when the trader deviously takes advantage of a special \nweakness or predicament of the consumer to induce entry into a contract.   An offence \nmight be committed under this Regulation, for instance, where an undertaker takes \nadvantage of the distress and shock of a recently bereaved person to sell a package of \nexpensive funeral arrangements.     \n This welcome reform should catch a number of unsavoury practices that \nsomehow slipped through the consumer law net or were inadequately deterred by existing \nprovisions.  For example, there were cases reported in the UK media of traders visiting \nthe homes of elderly and frail consumers and effectively refusing to leave before a \ncontract was signed.\n78\n  In such circumstances, the consumer would have the right to \ncancel the contract.\n79\n  Failure by the trader to inform the consumer of the right to cancel \nthe contract is itself an offence.\n80\n Notwithstanding these protections, the consumer might \nreasonably fear another oppressive visit from the trader and so not exercise the right to \ncancel and not report the problem to the authorities.  As a result, the commercial practice \nwould probably go undetected and unpunished.  The new Regulations make it clear that \nthe practice itself is likely to be unlawful, which should help to deter it more effectively. \n                                                 \n76\n Reg. 7(3)(b).  There is no further elucidation of the concept of harassment, and with regard to coercion \nReg.7(3)(a) merely states that it does not have to be physical coercion. \n77\n Reg.7(2)(c). \n78\n ‘The NCC makes a particular issue of oppressive doorstep selling. The organisation told the story of an \nelderly lady who was visited, without invitation or appointment, by doorstep salesmen. They sold her a bed \nfor £3,000—with various gadgets—which was entirely inappropriate to her medical condition and far too \ncomplex for her to use. They stayed in her home for five hours, until she signed the contract. I do not think \nthat many elderly, frail ladies would be able to resist signing, if only to get rid of such ghastly people.’ Mr \nWaterson, House of Commons Standing Committee B, 23 April 2002, Column 228. \n79\n The Cancellation of Contracts made in a Consumer’s Home or Place of Work etc Regulations 2008, SI \n2008\/1816, Reg. 7 (reforming, extending and revoking The Consumer Protection (Cancellation of \nContracts Concluded Away from Business Premises) Regulations 1987 SI 1987\/2117,) made under power \nconferred by Consumers, Estate Agents, Redress Act 2007 s.59. \n80\n Ibid Reg. 17. \n 20 \n The general concept of aggressive commercial practices represents a novel and \nhitherto unexplored concept in national and European consumer protection laws.\n81\n  To \ngrasp the proper scope of the new offences, it is important to remember that Regulation \n7(1) only applies to aggressive practices that impair freedom of choice and induce \ntransactional decisions.  Irritating and annoying practices, such as automated phone calls \nand junk e-mails will probably fall outside the prohibition of Regulation 7(1), because \nthey are not likely significantly to impair freedom of choice or induce a consumer to buy \nsomething; on the contrary, such communications are surely usually counterproductive \nfor the trader.\n82\n  Similarly, threatening or abusive language, though undoubtedly relevant \nto a finding that there has been harassment or coercion,\n83\n will not in itself amount to a \nprohibited aggressive commercial practice unless it can be shown to have been likely to \ninduce the consumer to take a transactional decision he would not have taken otherwise.  \nAlthough this narrowing of the scope of the new offence by reference to the concept of \ninducing transactions provides some determinacy to the regulation, again the innovative \ncharacter of the law for many European legal systems including the UK creates the \npotential for considerable divergence in interpretations.     \n \n \n \n6. The Black List \n \nIn the above discussion of the mini general clauses, it becomes clear that the level of \ndetail and specificity of the Directive and the implementing Regulation only leaves a few \nareas where the national courts have much scope for striking out in different directions.  \nTheir flexibility in marginal areas is further confined, however, by the black list of \nprohibited practices.  These examples are not merely illustrations of the mini general \nclauses, but in several instances deliberately expand the scope of the prohibitions \nsignificantly.  Consider, for instance, the prohibited practices in the black list in Schedule \n1 that fall into the general area of aggressive practices.  \n24. Creating the impression that the consumer cannot leave the premises until a \ncontract is formed. \n25. Conducting personal visits to the consumer’s home ignoring the consumer’s \nrequest to leave or not to return, except in circumstances and to the extent \njustified to enforce a contractual obligation. \n26. Making persistent and unwanted solicitations by telephone, fax, e-mail or \nother remote media except in circumstances and to the extent justified to enforce a \ncontractual obligation.   \nPersistent telephone calls marketing the provision of electricity supplies might not fall \nwithin Regulation 7, as noted above, but they might be prohibited by item 26 on the list, \n                                                 \n81\n G. Howells, ‘Aggressive Commercial Practices’ in Howells, Micklitz, Wilhelmsson, above n  50, 167, \n170.  \n82\n Such practices are, however, likely to be prohibited under The Privacy and Electronic Communications \n(EC Directive) Regulations 2003, SI 2003\/2426 Regs. 19-22 (Based on Dir 2002\/58, 2002 OJ L 201\/37). \n83\n Reg. 7(2)(b). Such practices may fall within paragraph 26 of Schedule 1 of the Regulation by amounting \nto ‘persistent and unwanted solicitations’. \n 21 \nwhich is not qualified by the need to demonstrate that the consumer’s ability to make a \ntransactional decision was impaired. \n The black list illustrates a third technique of harmonisation: in addition to general \nprinciples and specific rules, the Directive seeks to confine national discretion by the use \nof binding examples.  It is as if a court had already set a number of precedents in the \napplication of the Directive to particular situations.  The generation of such precedents is \nnormally difficult under European law.  Under the procedure for making references to the \nECJ,\n84\n not only can the national courts effectively prevent the ECJ from making binding \nrulings by declining to refer issues of interpretation to the court,\n85\n but also the ECJ is \nextremely reluctant to apply its interpretations of European law to the facts of a particular \ncase as opposed to offering general guidance on the meaning of the words contained in a \nDirective.\n86\n  National decisions on the application of Directives and their implementing \nlegislation are unlikely to be known or cited in other national courts, and in any case \ncomprise doubtful value as precedents.   European law thus lacks what most legal \nsystems explicitly or more covertly use as a primary tool to establish certainty and \npredictability in the application of the law: the following of precedent decisions.  By \nproviding binding examples in the black list, the Directive on unfair commercial practices \nharnesses this tool for harmonisation, with a view to maximising the prospects for \nuniformity in application of the law.  \n \n \n7. Enforcement \nCriminal offences \n \nIn discussions in the UK regarding the implementation of the Directive on Unfair \nCommercial Practices, business interests raised the question whether it was necessary to \nemploy criminal proceedings as well as the system of injunctive relief, clearly mandated \nby the Directive,\n87\n and provided in the Enterprise Act 2002 Part 8.\n88\n   With only a couple \nof exceptions, however, like the preceding domestic law, the Regulations impose criminal \npenalties enforceable by local authority trading standards officers.\n89\n These exceptions are \nthe prohibitions against a trader who fails to live up to a commitment contained in a code \nof conduct which the trader has undertaken to comply with;\n90\n and two prohibitions in the \nAnnex of prohibited practices: \n                                                 \n84\n Art 234 EC. \n85\n C-350\/03, Schulte v Deutsche Bausparkasse Badenia AG [2005] I-9215 ECJ, para. 43. \n86\n C-237\/02, Freiburger Kommunalbauten GmbH Baugesellschaft & Co KG v Hofstetter [2004] ECR I-\n3403, ECJ; J. Rutgers, ‘Note’ (2005) 1 European Review of Contract Law 87; Collins, The European Civil \nCode, above n. 5, 200. \n87\n Art. 11. \n88\n See also Schedule 13 of the Act and Enterprise Act (Part 8 Community Infringements Specified UK \nLaws) Order 2003; the underlying EU law is Injunctions Directive 98\/27. \n89\n The government has also been piloting regional ‘Scambuster’ teams: Department of Trade and Industry, \nA Fair Deal for All: Extending Competitive Markets: Empowered Consumers, Successful Business URN \n05\/1303 (London: DTI, 2005) 21.  It plans to spend £7.5 million on these teams over 3 years. \n90\n Reg. 5(3)(b) and Reg. 9. \n 22 \n11. Using editorial content in the media to promote a product where a trader has \npaid for the promotion without making that clear in the content or by images or \nsounds clearly identifiable by the consumer (advertorial).  \n28. Including in an advertisement a direct exhortation to children to buy \nadvertised products or persuade their parents or other adults to buy advertised \nproducts for them. \nIt seems that the minister believes that parents should be able to withstand the demands \nof children to purchase heavily advertised junk food, computer games, and toys without \nthe help of the prosecuting authorities. \nIn response to a concern that the general prohibition against unfair commercial \npractices presents a rather vague offence, this prohibition has the special additional \nrequirement of proof of mens rea in the form of intention and recklessness.  For the other \noffences, including the prohibitions in the black list of Schedule 1, the trader has two \ngeneral defences.  Regulation 17 provides the customary ‘due diligence defence’ under \nwhich the trader can show that the commission of the offence was due to a mistake, \nreliance on information supplied to him by another person, the act or default of another \nperson, an accident, or another cause beyond his control, and that he took all reasonable \nprecautions and exercised all due diligence to avoid the commission of the offence.  \nRegulation 18 provides a defence to publishers of advertisements that they did not know \nand had no reason to know that its publication would amount to an offence.  \n \nInjunctions \n  \nThe new Regulations also provide that all the prohibitions should be subject to the \ninjunctions procedures, colloquially known as ‘Stop Now Orders’, in Part 8 of the \nEnterprise Act 2002.\n91\n Injunctions can only be obtained if the conduct of the trader harms \nthe ‘collective interests of consumers’.92  There is a question whether the injunctions \nprocedure of 2002 Act may not apply to a ‘one-off’ case of deception that seems unlikely \nto happen again.  In such a case a court might decline to issue an injunction.  The aim \nbehind the 2002 Act was certainly to prevent bad trade practices from continuing despite \nthe risk of prosecution.  It seems to have been assumed that the phrase ‘collective \ninterests’ of consumers would always be satisfied by such forward-looking measures.  \nAnother concern is that under the statutory framework, the task of seeking injunctions \nwas given to particular bodies such as the OFT, various regulators, and the consumers’ \nassociation known now as a result of reckless re-branding as ‘Which?’.93  These bodies \nwere thought to represent consumers in general.  As a result, the injunctive regime is not \nmade available to ‘competitors’, as envisaged in the Unfair Commercial Practices \nDirective Article 11(1).  The UK government believes that it has the option under the \nDirective to restrict the enforcers to the existing recognised bodies and not to include the \npossibility of competitors bringing actions for injunctions.\n94\n  The Regulations do, \nhowever, amend the Enterprise Act 2002 with respect to the burden of proof in injunction \n                                                 \n91\n Reg. 26.   \n92\n S.211(1)(c). \n93\n Enterprise Act 2002, s. 213. \n94\n That possibility may arise, however, as a result of a review of the law of intellectual property rights, \nwhich may recommend the strengthening of civil remedies available to competitors.   \n 23 \nprocedures, in order to give the courts the power to require proof by the trader of the \naccuracy of factual claims made in the commercial communication, failing which, the \ncourt may consider that the factual claim is inaccurate.\n95\n \n \n8. A Private Right of Redress? \n \nThe Directive states laconically that it ‘is without prejudice to contract law and, in \nparticular, to the rules on the validity, formation or effect of a contract’.96  Accordingly, \nthe Regulations are silent on the question whether individual consumers may obtain any \nprivate right of redress against a trader who commits an unfair commercial practice.  \nThere is no provision that transactions formed under the influence of an unfair \ncommercial practice should be voidable, unenforceable, or cancellable by the consumer.  \nUnlike some previous consumer protection laws,\n97\n nor do the new Regulations address \nthe question whether or not a consumer might bring a claim for compensation in tort for \nbreach of statutory duty.   On these matters, therefore, the Directive does not seek to \nachieve harmonisation.  National legal systems will therefore diverge on the issue of \nwhether a consumer has a right to claim compensation for losses caused by unfair \ncommercial practices.  Because some legal systems grant the consumer a right of action, \neither for rescission of a contract or compensation for losses for breach of statutory duty \nor in tort, the Directive will end up maintaining and provoking creating new divergences \nbetween the private law systems of Member States.\n98\n  For instance, in Ireland, which \nfollows closely the English common law, the new legislation provides for a consumer’s \naction for damages, including exemplary damages.\n99\n  Similarly, in Australia the Trade \nPractices Act 1974 s.82 provides for a claim in damages for a person who suffers loss as \nresult of a business having used misleading or deceptive practices contrary to s. 52(1), \nand consumers benefit from a further protection in against ‘unconscionable conduct’ in \nbusiness marketing practices.\n100\n  Two questions need to be considered: might the \nRegulations nevertheless have some effects on private law; and, should the UK \ngovernment introduce private rights of redress for individual consumers? \n \nImpact on Private Law \n \nIt is possible that the UK courts might decide that private rights of redress could be \nimplied into the Regulations.  That has happened many times before when the courts \n                                                 \n95\n Reg.27, inserting a new s.218 A into the Enterprise Act 2002, in order to implement Article 12 of the \nDirective.   \n96\n Art. 3(2). \n97\n Consumer Protection Act 1987 s.41.  \n98\n For a survey of national laws prior to the Directive: Henning-Bodewig, above n 36.  The survey reveals \nconsiderable diversity, ranging from the absence of the ability for consumers to make private claims to the \npossibility (in Germany) of collective claims on the part of consumers to strip a rogue trader of profits \nmade by use of the unfair commercial practice.   \n99\n Consumer Protection Act S.74.  This section excludes claims under the mini general clause regarding \nmisleading commercial practices, though these are likely to be covered by the private law of \nmisrepresentation. \n100\n S. 51AB; P. Heffey, J. Paterson, A. Robertson, Principles of Contract Law (Sydney: Lawbook Co., \n2002) Chapters 28, 33, 36. \n 24 \nhave implied statutory torts from health and safety regulations.\n101\n   But there is a general \npresumption against the view that a breach of a statutory duty gives rise to any private \nlaw cause of action, unless it can be shown, as a matter of construction of the statute, that \nthe statutory duty was imposed for the protection of a limited class of the public and that \nParliament intended to confer on members of that class a private right of action for \nbreach of the duty.\n102\n  This presumption against a statutory tort is likely to be stronger in \nthe context of unfair commercial practices where the losses will probably be mostly \neconomic rather than personal injury or property damage.   \nAlternatively, the courts may develop the common law in directions that \nharmonise the rules regarding the invalidity of contracts in the laws of misrepresentation, \nduress, and undue influence with the prohibitions in the Regulations.\n103\n  In some \nEuropean civil law jurisdictions, for instance, it is expected that a failure to disclose \nmaterial information contrary to statutory regulations of this kind will provide a ground \nfor avoidance of the contract on the ground of mistake and that other unfair commercial \npractices will amount to the ground of rescission and compensation known as ‘dol’.104   It \nwould be odd result, indeed, if the actions of an unscrupulous trader amounted to a \ncriminal offence, but the contract obtained by an unfair commercial practice were \nnevertheless to remain fully enforceable against the consumer.  This possible \ndevelopment of the common law seems particularly likely with regard to the law of \nduress. \nUnder the common law of duress, a contract may be avoided where an illegitimate \nact performed by one party causes the other to consent to the contract.  The precise scope \nof the concept of an ‘illegitimate act’ remains uncertain,105 but it is generally thought to \ninclude torts involving threats to the person or property and some threats of breach of \ncontract (economic duress).  But the illegitimate act can possibly be constituted by other \nwrongs such as breach of statutory duty or a criminal offence such as blackmail.  Given \nthat a breach of the Regulations constitutes a criminal offence and that often the \naggressive conduct may amount to an implicit threat to the person, it seems possible that \nan unlawful aggressive practice that causes the victim to consent to a contract will \nconstitute duress, so that the victim may avoid the contract.  The crucial issue will be \nwhether the aggressive conduct was an inducement to enter the contract or whether the \nconsumer had another course of action available, such as walking away, which could \nhave reasonably been taken to remove the coercion. \n  \nIntroduction of a Private Rights of Redress \n \n                                                 \n101\n Groves v Lord Wimborne [1898] 2 QB 402. \n102\n E.g. X (Minors) Bedfordshire County Council [1995] 2 AC 633; O’Rourke v Camden London Borough \nCouncil [1998] AC 188. \n103\n Collins, above n 28, 424.  For similar observations with respect to European contract law and French \ncontract law, see S. Whittaker, ‘The Relationship of the Unfair Commercial Practices Directive to \nEuropean and National Contract Laws’, in Weatherill and Bernitz, above n 18, 139. \n104\n C. Péres, ‘Contrats: Les pratiques commerciales trompeuses sur les sources du droit des contrats’ Revue \ndes Contrats, 01 Octobre 2008 no. 4, p. 1083. \n105\n Universe Tankships Inc of Monrovia v International Transport Workers’ Federation (The Universe \nSentinel) [1983] 1 AC 366, HL. \n 25 \nA private right of redress could comprise a right to rescission or a claim for compensation \nfor material (and perhaps non-pecuniary) losses incurred as a result of being misled or \nbullied into a transaction by an unfair commercial practice.  A major benefit of such a \nright of action would be to enhance the possibilities of the enforcement of the new \nstandards of the Directive.  It would fit into a broader regulatory strategy advocated by \nthe Macrory Review to use a flexible toolkit of measures designed to stimulate \ncompliance.\n106\n  A private right of redress would also serve the goal of restorative justice.  \nSimilar goals might also be achieved by permitting ‘enforcement undertakings’ to be \nadded to the remedies available to a criminal court under the Regulatory Enforcement \nand Sanctions Act 2008 Part 3,\n107\n though such a measure would not empower consumers \nin the same way as a private right of redress. But the UK Government is apparently \nconcerned that a private right of action might have ‘unintended and adverse \nconsequences, by potentially providing consumers with undesirable latitude to sue traders \nand by impacting on the law of misrepresentation.’108  .  \nWhat are these possible consequences?  The answer is that the new right of action \nwould in effect create a new kind of private law claim.  The current laws of \nmisrepresentation, duress, and undue influence could be supplemented by an action for \ncompensation for losses caused by unfair commercial practices.  The existing common \nlaw is cautious in providing compensation for actions during pre-contractual negotiations.  \nIt does not accept a general duty to bargain in good faith or with professional diligence \nand it imposes few duties of disclosure of information on businesses.  A private right of \nredress might introduce some significant changes.  For example, it might give the right to \nclaim compensation for misleading, but not false, statements.  Similarly, it might give the \nright to claim compensation for failure to disclose material information, a right that has \nbeen steadfastly denied by the common law judges for centuries.  A private right of \nredress might also create for the first time a remedy of compensation for undue influence \nor aggressive business practices, where the traditional remedy has been confined to \nrescission of the contract and restitution.  The Government has given the task of assessing \nthe implications of a civil action to the Law Commission.  Its preliminary advice,\n109\n \npending a full report, confirms the complexity of the issue of providing private redress.   \nThe report notes that the opportunity might be taken to reform the English law of \nmisrepresentation, both to rid the law of the unnecessary complexity of the duplication of \ncauses of action in tort, equity, and statute, and to clarify the appropriate measure of \ndamages.\n110\n  Such a reform would be welcome, but it would need to address the question \nof the availability of civil law remedies such as rescission for misrepresentation in \ncircumstances where the trader has not committed an offence, as for example where the \ntrader can rely on a due diligence defence.  With regard to the measure of damages for \n                                                 \n106\n Regulatory: Justice: Making Sanctions Effective  http:\/\/www.berr.gov.uk\/files\/file44593.pdf \n107\n Section 50(3). This provision makes clear that rescission of any contract and compensation to the victim \nof an offence, including a consumer, could be part of an enforcement undertaking. Under s. 50(4), if the \nbusiness complies with the enforcement undertaking, it avoids any criminal prosecution, but there is no \nindependent sanction for failure to comply with the enforcement undertaking. \n108\n Response to the Consultation Paper on implementing the Unfair Commercial Practices Directive \n(December 2006) Http:\/\/www.berr.gov.uk\/files\/file35750.pdf at p.7.   \n109\n Law Commission, A Private Right of Redress for Unfair Commercial Practices? (London: Law \nCommission, November 2008). \n110\n Ibid para. 2.37.   \n 26 \nmisrepresentation, the reform would need to consider not only the existing irrational \ndistinctions between the statutory measures and the common law measures damages, but \nalso assess the possibility of claims for non-pecuniary loss.  For instance, in case where a \ntrader misleadingly claims that a ‘scientifically tested’ product will restore hair for men \nor remove wrinkles for women, should the consumer’s remedy be confined to the return \nof the price of the goods or should the consumer receive compensation for \ndisappointment as well?   \nIn connection with liability for omissions of material information, the major \nimpact of a private right of action would probably concern the conduct of professionals in \nrelation to sales of land and to the conduct of businesses supplying services more \ngenerally.  The topic of the application of duties of disclosure or implied warranties to \nsales of land may prove to be a more fundamental issue than most governments may wish \nto tackle in view of the experience of the pressure to water down the requirements of \nHome Information Packs.    \nIn relation to aggressive market practices, a private right of redress would clarify \nthe scope of the law of duress and it might introduce a novel claim for compensation.  \nSuch a claim for damages would be particularly significant in circumstances where the \n‘transactional decision’ induced by the aggression was not one of entering a contract, \nwhere rescission and restitution might be available, but was instead one concerning such \nmatters as the repayment of a debt, or not to take legal action, or not to cancel a contract \nunder statutory cancellation rights.\n111\n  \nWith regard to the general clause of professional diligence, the Law Commission \nexpresses itself unable to assess in its preliminary report how far the common law \nprovides private redress.\n112\n  Indeed, the ramifications of permitting private law claims for \nredress on the basis of the standard of professional diligence seem daunting.  A claim for \ncompensation under this heading opens up the possibility that consumers might be \nawarded a remedy for a trader’s failure to bargain in good faith or with due care, a rather \nrevolutionary notion in the context of the common law.     \nEven from this preliminary advice from the Law Commission, it is evident that \nthe interaction between the Directive and national private law systems will provide fertile \nterritory for divergence.  Does this matter?  In the context of cross-border trade, a \nconsumer might be able to rely on his or her home law to mount a private law claim for \ncompensation, punitive damages, or cancellation of the contract that would not be \npermitted in the trader’s home state.113  Although the regulatory rules might be \nharmonised by the Directive, the disincentive for businesses to market their products and \nservices abroad might persist in the face of fears that consumers might enjoy unexpected \nrights to redress.  If so, we may anticipate that the European Commission will respond to \na call from the European Parliament and revert to the topic of harmonisation of private \nlaw with respect to unfair marketing practices before long.\n114\n    \n \n                                                 \n111\n Ibid, para. 2.77. \n112\n Ibid para. 2.97. \n113\n Relying on Art 6 of Regulation 593\/2008\/EC on the law applicable to contractual obligations (2008) OJ \nL177\/6. \n114\n Resolution of the European Parliament of 13 January 2009 on the transposition, implementation and \nenforcement of Directive 2005\/29\/EC concerning unfair business-to-consumer commercial practices \n(2008\/2114 (INI).  \n 27 \n \n8.  Harmonisation by Example \n \nWe can now return to our initial question: will the Directive on unfair commercial \npractices succeed in producing uniformity throughout the laws of the European Member \nStates?   There are three crucial features working in favour of this outcome.  First, the full \nharmonisation requirement compels Member States to review all their current legislation \nin the field of commercial practices in order to determine whether the rules are \nsufficiently comprehensive whilst not being overly protective of consumers.  In the UK, \nthe consequent legislative process has effectively rewritten the statute book in the field of \nconsumer protection.  In thirteen out of the fifteen Member States that initially approved \nthe Directive, their previous legislation with regard to fair trading was founded on a \ngeneral clause,\n115\n so they will need at least to introduce the more specific demands of the \nDirective such as the black list. The European Commission will certainly police \ncompliance carefully and require even small adjustments of non-conforming laws. \nSecond, the three ‘mini-general clauses’ achieve much better specificity than a single \ngeneral clause could have done.  In this respect it is likely to provide more determinate \nguidance than some previous Directives such as the prohibition against unfair contract \nterms.  Furthermore – and this is perhaps crucial – the mini general clauses for the most \npart eschew familiar legal terminology, such as good faith, good morals, honesty, \nmisrepresentation, and the like, so that when judges and officials have to interpret them, \nthe meaning of the provisions will not be weighed down or guided by national legal \ntraditions.   \nFinally, the major innovation in the technique of harmonisation consists of the \nblack list of prohibited practices.  The Directive on unfair terms possesses a ‘grey list’ of \nterms that will normally be regarded as unfair, but, in principle, terms that apparently fall \nwithin that list can be rescued by arguments that they do not in all the circumstances \nbreach the general clause about unfairness.\n116\n  In contrast, in the Directive on unfair \ncommercial practices, courts and officials are instructed to look only at the list of \nexamples.  If a case falls within one of the descriptions of prohibited behaviour, it is an \noffence, subject only to the general defences to criminal charges available for businesses \nsuch as due diligence.  We have also noted above at several points that the black list of \nprohibited practices appears to have a wider scope of application in some respects that the \ngeneral clause and the mini general clauses.  It can be anticipated that the black list will \nbe the first port of call for most courts and administrators when applying the new \nlegislation.  Interpretations of the meaning of those factual scenarios will provide the \nmeat of the precedents in determining the scope of the legislation.  For the purpose of \nEuropean harmonisation, what will unify the laws is not so much shared interpretations of \nconcepts in broad legal rules as agreement on examples of marketing practices that fall \nwithin the black list.  Consider, for example, the marketing practice of ‘bogofs’ (buy one, \nget one free): is this practice lawful?  The first question to ask is whether this example is \nprohibited in the black list?  Example 20 in the list is ‘Describing a product as ‘gratis’, \n‘free’, ‘without charge’ or similar if the consumer has to pay anything other than the \n                                                 \n115\n H-W. Micklitz, ‘A General Framework Directive on Fair Trading’, in Collins, above n 18, 43, 63. \n116\n In the proposed consumer rights directive, above n 4, some of these examples such as exclusions of \nliability for personal injury are transferred into a black list. \n 28 \nunavoidable cost of responding to the commercial practice and collecting or paying for \nthe delivery of the item.’  Using this example, one could argue that unless the product is \nsold at its normal or previous price, the second ‘free’ item is not in reality free, but rather \nthe consumer is paying a premium, contrary to the rule.  That conclusion seems \nreasonably clear, so there is no need to turn to the more general prohibition against \nmisleading actions, which includes rules against statements of a specific price advantage \nthat are likely to deceive the average consumer.  If that prediction of the legal process \nproves correct, the Directive will achieve harmonisation by example rather than rules.   \nIn these three respects, the Directive presents a much more aggressive approach \ntowards harmonisation of national laws than we have witnessed in previous consumer \nmeasures.  In all but name, this kind of full harmonisation is federal pre-emption.  In this \ninstance, the topic concerns regulation of competition in consumer markets, but the \nproposed Directive on consumer rights extends the approach to the ordinary private law \nof contract.  Will these measures achieve uniformity in the application of the law?  \nUltimately, given the divergences in national legal traditions and practices, complete \nuniformity seems an unlikely outcome.  In the case of misleading omissions, for instance, \nEnglish courts are much less familiar than their civil law counterparts with the notion that \nbusinesses should disclose material information, and as a consequence may adopt a \nnarrower view of what information is necessary for the consumer to be given.  \nFurthermore, the absence in the Directive of any determination of the private law \nconsequences of unfair commercial practices will permit considerable diversity to persist. \nEven so, sceptics regarding the ability of the institutions of the European Union to deliver \non its goals may discover that this Directive marks a turning-point that will confound \ntheir criticisms.   \n \n \n"}