{"doi":"10.1016\/j.geoforum.2006.12.008","coreId":"71701","oai":"oai:eprints.lancs.ac.uk:505","identifiers":["oai:eprints.lancs.ac.uk:505","10.1016\/j.geoforum.2006.12.008"],"title":"Cultural political economy : on making the cultural turn without falling into soft economic sociology.","authors":["Jessop, Bob","Oosterlynck, Stijn"],"enrichments":{"references":[{"id":16462350,"title":"10 On discursive selectivity, see Hay","authors":[],"date":"1996","doi":null,"raw":"10 On discursive selectivity, see Hay 1996 and Somers 1994; on structural selectivity, see Jessop 1990.   39 11 Space economy is a historically specific spatialization of economic relations.","cites":null},{"id":16462355,"title":"12 The relativization of scale involves a crisis of the primacy of the national scale and associated complex process of the rescaling of political and economic relations (Brenner","authors":[],"date":"1999","doi":null,"raw":"12 The relativization of scale involves a crisis of the primacy of the national scale and associated complex process of the rescaling of political and economic relations (Brenner 1999; Brenner 2004; Jessop 2002; Swyngedouw 1997). 13 The headquarters of SG were located in Koningsstraat.","cites":null},{"id":16462338,"title":"2 On spatio-temporal fixes, see Jessop","authors":[],"date":"2002","doi":"10.1002\/9780470773581.ch8","raw":"2 On spatio-temporal fixes, see Jessop (2002).","cites":null},{"id":16462346,"title":"9 A web of interlocution comprises metanarratives that reveal linkages between a wide range of interactions, organizations, and institutions and\/or help to make sense of whole epochs","authors":[],"date":"1994","doi":null,"raw":"9 A web of interlocution comprises metanarratives that reveal linkages between a wide range of interactions, organizations, and institutions and\/or help to make sense of whole epochs (Somers 1994: 614).","cites":null},{"id":16462078,"title":"A Critique of the cultural turn. In:","authors":[],"date":"2004","doi":"10.1002\/9780470996515.ch4","raw":"Barnett,  Clive,  2004.  A  Critique  of  the  cultural  turn.  In:  Duncan,  S.,  Nuala  N.C., Johnson, C., and Schein, R.H. (Eds.), A Companion to Cultural Geography. Blackwell, Oxford, pp. 38-48.","cites":null},{"id":16462216,"title":"A neo-Gramscian approach to the regulation of urban regimes. In","authors":[],"date":"1997","doi":"10.4135\/9781483327808.n4","raw":"Jessop, Bob, 1997. A neo-Gramscian approach to the regulation of urban regimes. In Lauria, Mickey (Ed.), Reconstructing Urban Regime Theory. Sage, London, pp. 51-73.","cites":null},{"id":16462172,"title":"Analysing Discourse. Textual Analysis for Social Research.","authors":[],"date":"2003","doi":"10.1017\/s0047404506230288","raw":"Fairclough, Norman, 2003. Analysing Discourse. Textual Analysis for Social Research. Routledge, London.","cites":null},{"id":16462236,"title":"Au nom de la Wallonie et de Bruxelles français. Les origines du FDF.","authors":[],"date":"2004","doi":null,"raw":"Kesteloot, Chantal, 2004. Au nom de la Wallonie et de Bruxelles français. Les origines du FDF. Editions Complexe, Bruxelles.","cites":null},{"id":16462319,"title":"België in stukken: bestaan Vlaanderen en Wallonië echt? In Subite, Mort (Ed.) Barsten in België: een geografie van de Belgische maatschappij.","authors":[],"date":"1990","doi":null,"raw":"Vandermotten, Christian, Piet Saey, and Christian Kesteloot, 1990. België in stukken: bestaan Vlaanderen en Wallonië echt? In Subite, Mort (Ed.) Barsten in België: een geografie van de Belgische maatschappij. EPO, Berchem.","cites":null},{"id":16462094,"title":"Beyond state-centrism? Space, territoriality and geographical scale in globalisation studies.Theory and","authors":[],"date":"1999","doi":null,"raw":"Brenner,  Neil,  1999. Beyond  state-centrism?  Space, territoriality  and  geographical scale in globalisation studies.Theory and Society 28, 39-78.","cites":null},{"id":16462230,"title":"Beyond the Regulation Approach: Putting Capitalist Economies in their Place.","authors":[],"date":"2006","doi":"10.1111\/j.1944-8287.2007.tb00359.x","raw":"Jessop, Bob and Sum, Ngai-Ling, 2006. Beyond the Regulation Approach: Putting Capitalist Economies in their Place. Cheltenham: Edward Elgar.","cites":null},{"id":16462207,"title":"Conceptualizing economies and their geographies: spaces, flows and circuits.","authors":[],"date":"2004","doi":"10.1191\/0309132504ph497oa","raw":"Hudson, Ray, 2004. Conceptualizing economies and their geographies: spaces, flows and circuits. Progress in Human Geography 28 (4), 447-471.   34 Huyse, Luc, 1980. De gewapende vrede. Politiek in België tussen 1945 en 1980. Kritak, Leuven.","cites":null},{"id":16462262,"title":"Contradictions of the Welfare State.","authors":[],"date":"1984","doi":"10.1007\/978-3-531-90400-9_91","raw":"Offe, Claus, 1984. Contradictions of the Welfare State. Hutchinson, London.","cites":null},{"id":16462179,"title":"Critical realism and semiosis. In","authors":[],"date":"2004","doi":"10.1558\/aleth.v5i1.2","raw":"Fairclough, Norman, Jessop, Bob, Sayer, Andrew, 2004. Critical realism and semiosis. In Fleetwood, Steven and Roberts, John M. (Eds.), Realism, Discourse and Deconstruction. Routledge, London, pp. 23-42.","cites":null},{"id":16462224,"title":"Critical semiotic analysis and cultural political economy.","authors":[],"date":"2004","doi":"10.1080\/17405900410001674506","raw":"Jessop, Bob, 2004. Critical semiotic analysis and cultural political economy. Critical Discourse Studies 1 (2), 159-174.","cites":null},{"id":16462112,"title":"Cultural Geography.","authors":[],"date":"1997","doi":"10.1080\/14649365.2012.728617","raw":"Crang, Mike, 1997. Cultural Geography. Routledge, London.","cites":null},{"id":16462135,"title":"De ideologie van de verankering.","authors":[],"date":"1995","doi":null,"raw":"Crols, Frans, 1995. De ideologie van de verankering. In Brockman, Hans (Ed.) 200 jaar filiaal. De Franse Greep op de Vlaamse Economie. Davidsfond, Leuven.","cites":null},{"id":16462161,"title":"De lessen van Lessius.","authors":[],"date":"2005","doi":null,"raw":"Desmet, Lieven, 2005. De lessen van Lessius. Trends, 48-50. 1 December.","cites":null},{"id":16462141,"title":"De paradox van het Belgische kapitalisme. Waarom bedrijven financieel goed scoren en toch strategisch slecht spelen.","authors":[],"date":"1998","doi":null,"raw":"Daems, Herman, 1998. De paradox van het Belgische kapitalisme. Waarom bedrijven financieel goed scoren en toch strategisch slecht spelen. Lannoo,Tielt.    33 Daems, Herman, de Weyer, Peter Van, 1993. Buitenlandse invloed in België - de gevolgen voor de strategische beslissingsmacht. Lannoo,Tielt.","cites":null},{"id":16462119,"title":"De zichtbare hand.","authors":[],"date":"1988","doi":null,"raw":"Crols, Frans, 1988a. De zichtbare hand. Trends, 9. 21 April.","cites":null},{"id":16462273,"title":"Deconstructing regions: notes on the scales of spatial life.","authors":[],"date":"1991","doi":"10.1068\/a230239","raw":"Paasi, Anssi, 1991. Deconstructing regions: notes on the scales of spatial life. Environment and Planning A 23 (2), 239-56.","cites":null},{"id":16462341,"title":"develops an interesting analysis of the hegemony of the social market economy in Germany and its re-invention in neo-liberal guise. Our approach nonetheless differs strongly from the sort of post-Marxist discourse analysis advocated by Laclau and Mouffe","authors":[],"date":"2006","doi":null,"raw":"4  For  example,  Nonhoff  (2006)  develops  an  interesting  analysis  of  the  hegemony  of  the  social market economy in Germany and its re-invention in neo-liberal guise. Our approach nonetheless differs strongly from the sort of post-Marxist discourse analysis advocated by Laclau and Mouffe (1986),  which  one-sidedly  valorizes  discourse  without  regard  to  extra-discursive  mechanisms  of selection and retention. For an interesting illustration of the lack of recognition of the CPE approach in any of its manifestations, see the general critique of the cultural turn in political economy by a leading  figure  in  cultural  studies,  Lawrence  Grossberg,  in  which  he  argues  that  cultural  studies cannot take ‘the path of political economy, even when it tries to take the cultural turn seriously, which is rare enough. In the end, it sees culture as a medium into which the economy is translated and through which it moves, but which has no real effects of its own’ (2006: 19). We claim that CPE can meet this challenge (see below).","cites":null},{"id":16462198,"title":"Does cultural studies have futures? Should it? (Or what’s the matter with","authors":[],"date":"2006","doi":"10.1080\/09502380500492541","raw":"Grossberg, Lawrence, 2006. Does cultural studies have futures? Should it? (Or what’s the matter with New York?) Cultural Studies 20 (1), 1-32.","cites":null},{"id":16462204,"title":"Economic nationalism as a challenge to economic liberalism? Lessons from the 19th century?","authors":[],"date":"2002","doi":"10.1111\/1468-2478.00235","raw":"Helleiner, Eric, 2002. Economic nationalism as a challenge to economic liberalism? Lessons from the 19th century? International Studies Quarterly, 46 (3), 307-329.","cites":null},{"id":16462279,"title":"Economic sociologies in space.","authors":[],"date":"2005","doi":"10.1111\/j.1944-8287.2005.tb00263.x","raw":"Peck,  Jamie,  2005.  Economic  sociologies  in  space.  Economic  Geography  81  (2), 129-176.","cites":null},{"id":16462293,"title":"Een nieuwe topklasse in Vlaanderen.","authors":[],"date":"1981","doi":null,"raw":"Roosens, Anton, 1981. Een nieuwe topklasse in Vlaanderen. De Nieuwe Maand 24 (2), 98-108.","cites":null},{"id":16462296,"title":"For a critical cultural political economy.","authors":[],"date":"2001","doi":"10.1111\/1467-8330.00206","raw":"Sayer, Andrew, 2001. For a critical cultural political economy. Antipode 33 (4), 637-708.   36 Somers,  Margaret,  1994.  The  narrative  constitution  of  identity:  a  relational  and network approach. Theory and Society 23 (4), 605-649.","cites":null},{"id":16462306,"title":"From Integral State to Integral World Economic Order: Towards a Neo-Gramscian Cultural Political Economy, Working Paper No. 7 of the Cultural Political Economy Research Cluster, Institute for Advanced Studies,","authors":[],"date":"2004","doi":null,"raw":"Sum,  Ngai-Ling,  2004.  From  Integral  State  to  Integral  World  Economic  Order: Towards a Neo-Gramscian Cultural Political Economy, Working Paper No. 7 of the  Cultural  Political  Economy  Research  Cluster,  Institute  for  Advanced Studies, Lancaster University, http:\/\/www.lancs.ac.uk\/ias\/polecon\/index.htm Sum,  Ngai-Ling,  2005.  'From  Regulation  Approach  to  Cultural  Political  Economy', Workpackage  1,  Discussion  Paper  on  the EU  Framework  6  DEMOLOGOS project, http:\/\/demologos.ncl.ac.uk\/wp\/wp1\/disc.php Swyngedouw, Erik, 1997. Neither global nor local: &quot;glocalization&quot; and the politics of scale. In Cox, Kevin R. (Ed.) Spaces of Globalisation. Guilford Press, New York, pp. 137-166.","cites":null},{"id":16462074,"title":"From the political economy of regions to regional political economy.","authors":[],"date":"2000","doi":"10.1191\/030913200676580659","raw":"Agnew,  John,  2000.  From  the  political  economy  of  regions  to  regional  political economy. Progress in Human Geography 24, 101-110.","cites":null},{"id":16462303,"title":"Globalization and its &quot;Other(s)”: Three new kinds of Orientalism and the Political Economy of Trans-border Identities. In","authors":[],"date":"2000","doi":null,"raw":"Sum,  Ngai-Ling,  2000.  Globalization  and  its  &quot;Other(s)”:  Three  new  kinds  of Orientalism and the Political Economy of Trans-border Identities. In Hay, Colin and Marsh, David (Eds.), Demystifying Globalization. Palgrave: Basingstoke, pp.105-126.","cites":null},{"id":16462257,"title":"Governing economic life.","authors":[],"date":"1993","doi":"10.1080\/03085149000000001","raw":"Miller, Peter and Rose, Nik, 1993. Governing economic life. Economy and Society 19 (1): 1-31.   35 Mitchell, Don, 2000. Cultural Geography: A Critical Introduction, Blackwell,. Oxford.","cites":null},{"id":16462238,"title":"Hegemony and Socialist Strategy.","authors":[],"date":"1986","doi":"10.5840\/studpracphil2000213","raw":"Laclau, Ernesto and Mouffe, Chantal, 1986. Hegemony and Socialist Strategy. Verso, London.","cites":null},{"id":16462290,"title":"Het klauwen van de leeuw. De Vlaamse identiteit van de 12de tot de 21ste eeuw. Uitgeverij Van Halewyck,","authors":[],"date":"1995","doi":null,"raw":"Reynebeau, Marc, 1995. Het klauwen van de leeuw. De Vlaamse identiteit van de 12de tot de 21ste eeuw. Uitgeverij Van Halewyck, Leuven.","cites":null},{"id":16462167,"title":"Het laatste gesprek. Herinneringen aan 40 jaar politiek leven. DNB\/Uitgeverij Pelckmans,","authors":[],"date":"1988","doi":null,"raw":"Eyskens, Gaston, 1988. Het laatste gesprek. Herinneringen aan 40 jaar politiek leven. DNB\/Uitgeverij Pelckmans, Brussel.","cites":null},{"id":16462123,"title":"Het non-event.","authors":[],"date":"1988","doi":null,"raw":"Crols, Frans, 1988b. Het non-event. Trends,  11. 21 January.","cites":null},{"id":16462314,"title":"Het nut van België.","authors":[],"date":"1993","doi":null,"raw":"Van Istendael, Geert (Ed.) 1993. Het nut van België. Atlas, Antwerp.","cites":null},{"id":16462241,"title":"Het ware verhaal van een openbaar overnamebod. De strijd om de Generale Maatschappij.","authors":[],"date":"1990","doi":null,"raw":"Lamy, René, 1990. Het ware verhaal van een openbaar overnamebod. De strijd om de Generale Maatschappij. Tielt: Lannoo.","cites":null},{"id":16462129,"title":"Houd de dief.","authors":[],"date":"1988","doi":null,"raw":"Crols, Frans, 1988c. Houd de dief. Trends, 19. 28 January.","cites":null},{"id":16462088,"title":"Ik stel vast'. Politiek taalgebruik in het tijdperk van vernieuwing.","authors":[],"date":"2000","doi":null,"raw":"Blommaert,  Jan,  2000.  'Ik  stel  vast'.  Politiek  taalgebruik  in  het  tijdperk  van vernieuwing.  EPO, Berchem.","cites":null},{"id":16462251,"title":"Institutional approaches in economic geography. In Sheppard, Eric","authors":[],"date":"2000","doi":"10.1002\/9780470693445.ch6","raw":"Martin, Ron, 2000. Institutional approaches in economic geography. In Sheppard, Eric and Barnes, Trevor J. (Eds.) Companion to Economic Geography.","cites":null},{"id":16462265,"title":"Interview with Frans Crols.","authors":[],"date":"2004","doi":null,"raw":"Oosterlynck, Stijn, 2004a. Interview with Frans Crols. 23 December.","cites":null},{"id":16462268,"title":"Interview with Luc Van den Brande.","authors":[],"date":"2005","doi":null,"raw":"Oosterlynck, Stijn, 2005a. Interview with Luc Van den Brande. 22 February.","cites":null},{"id":16462103,"title":"jaar filiaal. De Franse greep op de Vlaamse economie. Davidsfonds,","authors":[],"date":"1995","doi":null,"raw":"Brockmans, Hans, 1995, 200 jaar filiaal. De Franse greep op de Vlaamse economie. Davidsfonds, Leuven.","cites":null},{"id":16462186,"title":"Juridische instrumenten tot verankering van Belgische ondernemingen. Nieuw Tijdschrift voor Politiek,","authors":[],"date":"1995","doi":null,"raw":"Geens, Koen, Hellemans, Frans, Haelterman, Axel, and Bevernage, Piet, 1995. Juridische instrumenten tot verankering van Belgische ondernemingen. Nieuw Tijdschrift voor Politiek, 4-46.","cites":null},{"id":16462310,"title":"Knowing Capitalism.","authors":[],"date":"2004","doi":"10.1111\/j.1944-8287.2007.tb00335.x","raw":"Thrift, Nigel, 2004. Knowing Capitalism. Sage, London.","cites":null},{"id":16462083,"title":"L’invention paradoxale de la mode économique. In: Bayart, Jean-François, La réinvention du capitalisme. Éditions Karthala,","authors":[],"date":"1994","doi":"10.2307\/485812","raw":"Bayart,  Jean-François,  1994.  L’invention  paradoxale  de  la  mode  économique.  In: Bayart, Jean-François, La réinvention du capitalisme. Éditions Karthala, Paris, pp. 9-43.","cites":null},{"id":16462285,"title":"Les causes du déclin wallon: l'influence du pouvoir politique et des groupes financiers sur le développement régional. Vie ouvrière,","authors":[],"date":"1978","doi":null,"raw":"Quévit, Michel and Aiken, Michaël, 1978. Les causes du déclin wallon: l'influence du pouvoir politique et des groupes financiers sur le développement régional. Vie ouvrière, Bruxelles.","cites":null},{"id":16462193,"title":"Lob der Verschwendung.","authors":[],"date":"1994","doi":"10.1177\/096977649600300308","raw":"Grabher, Gernot, 1994. Lob der Verschwendung. Sigma, Berlin.","cites":null},{"id":16462182,"title":"Marx's Ecology. Materialism and nature. Monthly Review Press,","authors":[],"date":"2000","doi":"10.3917\/mouv.066.0155","raw":"Foster, John Bellamy, 2000. Marx's Ecology. Materialism and nature. Monthly Review Press, New York.","cites":null},{"id":16462298,"title":"More than a ‘War of Words’: Identity politics and the struggle for dominance during the recent political reform period in Hong Kong.","authors":[],"date":"1995","doi":"10.1080\/03085149500000003","raw":"Sum, Ngai-Ling, 1995. More than a ‘War of Words’: Identity politics and the struggle for  dominance  during  the  recent  political  reform  period  in  Hong  Kong. Economy and Society 24 (1), 68-99.","cites":null},{"id":16462157,"title":"Over Franse kolonisatie en Belgische verankering.","authors":[],"date":"1992","doi":null,"raw":"De Grauwe, Paul, 1992. Over Franse kolonisatie en Belgische verankering. Leuvense Economische Standpunten 16.","cites":null},{"id":16462276,"title":"Place and region: regional worlds and words.","authors":[],"date":"2002","doi":"10.1191\/0309132502ph404pr","raw":"Paasi, Anssi, 2002. Place and region: regional worlds and words. Progress in Human Geography 26:802-811.","cites":null},{"id":16462334,"title":"Politieke geschiedenis van Belgie van 1830 tot heden.","authors":[],"date":"1997","doi":null,"raw":"Witte, Eis, Craeybeckx, Jan, and Meynen, Alain, 1997. Politieke geschiedenis van Belgie van 1830 tot heden. VUB Press, Brussel. Endnotes 1  This  paper  has  benefited  from  our  participation  in  the  ‘Cultural  Political  Economy’  workshop organized by Ngai-Ling Sum and funded by Lancaster University’s Institute for Advanced Studies (2004-2006), in the long-established ‘Language, Ideology, and Power’ group at Lancaster, and from more general discussions with Norman Fairclough, Andrew Sayer, and Ngai-Ling Sum over many years.","cites":null},{"id":16462227,"title":"Pre-disciplinary and post-disciplinary perspectives in political economy.","authors":[],"date":"2001","doi":"10.1080\/13563460124331","raw":"Jessop, Bob and Sum, Ngai-Ling, 2001. Pre-disciplinary and post-disciplinary perspectives in political economy. New Political Economy 6 (1), 89-101.","cites":null},{"id":16462195,"title":"Selections from the Prison Notebooks. Lawrence","authors":[],"date":"1971","doi":"10.2307\/479844","raw":"Gramsci, Antonio, 1971. Selections from the Prison Notebooks. Lawrence & Wishart, London.","cites":null},{"id":16462233,"title":"Social justice and the region: grassroots regional movements and 'the English Question'.","authors":[],"date":"2004","doi":"10.1080\/1356257042000273940","raw":"Jones, Martin, 2004. Social justice and the region: grassroots regional movements and 'the English Question'. Space and Polity 8, 157-189.","cites":null},{"id":16462315,"title":"Speeltijd is voorbij.","authors":[],"date":"1988","doi":null,"raw":"van Waterschoot, Jerry, 1988. Speeltijd is voorbij. Financieel-Economische Tijd. 25 February.","cites":null},{"id":16462212,"title":"State Theory: Putting the Capitalist State in its Place.","authors":[],"date":"1990","doi":"10.1177\/03058298910200010814","raw":"Jessop,  Bob,  1990.  State  Theory:  Putting  the  Capitalist  State  in  its  Place.  Polity, Cambridge.","cites":null},{"id":16462244,"title":"The coming regional crisis (and how to avoid it).","authors":[],"date":"2001","doi":"10.1080\/00343400124009","raw":"Lovering, John, 2001. The coming regional crisis (and how to avoid it). Regional Studies 35, 349-354.","cites":null},{"id":16462247,"title":"The dialectic of class and region in Belgium.","authors":[],"date":"1963","doi":null,"raw":"Mandel, Ernest, 1963. The dialectic of class and region in Belgium. New Left Review 20, 5-31.","cites":null},{"id":16462145,"title":"The discursive construction of economic space.","authors":[],"date":"1991","doi":"10.1080\/03085149100000003","raw":"Daly,  Glyn,  1991.  The  discursive  construction  of  economic  space.  Economy  and Society 20 (1), 79-102.","cites":null},{"id":16462282,"title":"The economy as instituted process. In: Granovetter, Mark and Swedberg, Richard (Eds.). The Sociology of Economic Life.","authors":[],"date":"1982","doi":null,"raw":"Polanyi, Karl, 1982. The economy as instituted process. In: Granovetter, Mark and Swedberg, Richard (Eds.). The Sociology of Economic Life. Westview, Boulder, pp. 29-51.","cites":null},{"id":16462255,"title":"The Eighteenth Brumaire of Louis Bonaparte. In Carver,","authors":[],"date":"1996","doi":"10.1017\/cbo9780511810695.007","raw":"Blackwell, Oxford, pp. 77-94 Marx, Karl, 1996. The Eighteenth Brumaire of Louis Bonaparte. In Carver, Terrell (Ed.), Karl Marx: Later Political Writings. Cambridge University Press, Cambridge, pp. 31-127.","cites":null},{"id":16462189,"title":"The End of Capitalism (as we know it): a Feminist Critique of Political Economy.","authors":[],"date":"1996","doi":"10.2307\/144255","raw":"Gibson-Graham, Katherine-Julie, 1996. The End of Capitalism (as we know it): a Feminist Critique of Political Economy. Blackwell, Oxford.","cites":null},{"id":16462220,"title":"The Future of the Capitalist State.","authors":[],"date":"2002","doi":"10.1007\/s11615-003-0085-1","raw":"Jessop, Bob, 2002. The Future of the Capitalist State. Cambridge: Polity.","cites":null},{"id":16462202,"title":"The Limits of Capital.","authors":[],"date":"1982","doi":"10.4135\/9781446213742.n8","raw":"Harvey, David, 1982. The Limits of Capital. Blackwell, Oxford.","cites":null},{"id":16462301,"title":"The NICs and competing strategies of East Asian regionalism.","authors":[],"date":"1996","doi":null,"raw":"Sum, Ngai-Ling, 1996. The NICs and competing strategies of East Asian regionalism. In  Gamble,  Andrew  and  Payne,  Anthony  (Eds.),  Regionalism  and  World Order. Macmillan, Basingstoke, pp. 207-46.","cites":null},{"id":16462270,"title":"The political economy of new regionalism in Belgium: imagining and institutionalising the Flemish regional economy.","authors":[],"date":"2006","doi":null,"raw":"Oosterlynck, Stijn,  2006. The political economy of new regionalism in Belgium: imagining and institutionalising the Flemish regional economy. Lancaster University, Doctoral Thesis.","cites":null},{"id":16462259,"title":"The regional dynamics of language differentiation in Belgium. A study in cultural-political geography.","authors":[],"date":"1988","doi":"10.2307\/215542","raw":"Murphy, Alexander B., 1988. The regional dynamics of language differentiation in Belgium. A study in cultural-political geography. University of Chicago Press, Chicago.","cites":null},{"id":16462287,"title":"The Work of Nations. Preparing Ourselves for 21st Capitalism.","authors":[],"date":"1991","doi":"10.2307\/2151806","raw":"Reich,  Robert  B,  1991.  The  Work  of  Nations.  Preparing  Ourselves  for  21st Capitalism. Simon & Schuster, New York.","cites":null},{"id":16462151,"title":"Time and politics. In Debray, Regis, Prison Writings.","authors":[],"date":"1973","doi":"10.2307\/3183526","raw":"Debray, Regis, 1973. Time and politics. In Debray, Regis, Prison Writings. Allen Lane, London, pp. 87-160.","cites":null},{"id":16462098,"title":"Urban governance and the production of new state spaces in western Europe,","authors":[],"date":"2004","doi":"10.1080\/0969229042000282864","raw":"Brenner, Neil, 2004. Urban governance and the production of new state spaces in western  Europe,  1960-2000.  Review  of  International  Political  Economy  11, 447-488.","cites":null},{"id":16462107,"title":"Variation and selective retention in socio-cultural evolution.","authors":[],"date":"1969","doi":null,"raw":"Campbell,  Donald  T.,  1969.  Variation  and  selective  retention  in  socio-cultural evolution. General Systems 14, 69-86.","cites":null},{"id":16462329,"title":"Verankering voor beginners. Herman Gevaert,","authors":[],"date":"1987","doi":null,"raw":"Verankering voor beginners. Herman Gevaert, Brugge.   37 Wickham, Gary, 1987. Power and power analysis: beyond Foucault? Economy and Society 12 (4), 468-498.","cites":null},{"id":16462324,"title":"Vlaamse Culturele Koepel, and Vereniging Vlaamse Leerkrachten,","authors":[],"date":"1995","doi":null,"raw":"Vlaamse Culturele Koepel, and Vereniging Vlaamse Leerkrachten, 1995.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05-06","abstract":"This article explores the implications of making the cultural turn in the engagement of economic and political geography with issues of political economy. It seeks to steer a path between a fetishistic, reified economics that naturalizes economic categories and a soft economic sociology that focuses on the similarities between economic and other socio-cultural activities at the expense of the specificity of the economic. We show how combining critical semiotic analysis with an evolutionary and institutional approach to political economy offers one interesting way to achieve this goal. An evolutionary and institutional approach to semiosis enables us to recognize the semiotic dimensions of political economy at the same time as establishing how and why only some economic imaginaries among the many that circulate actually come to be selected and institutionalized; and Marxian political economy enables us to identify the contradictions and conflicts that make capital accumulation inherently improbable and crisis-prone, creating the space for economic imaginaries to play a role in stabilizing accumulation in specific spatio-temporal fixes and\/or pointing the way forward from recurrent crises. The paper illustrates these arguments with a case study on the Flemish â��anchoring strategyâ�� as a specific regional economic development strategy. It concludes with a set of guidelines for the further development of cultural political economy","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71701.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/505\/1\/%2D_E%2D2007b_CPE%2DGeoforum.pdf","pdfHashValue":"cf11ce9d25cc688f0cd41a707d5890333306fda1","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:505<\/identifier><datestamp>\n      2018-01-24T03:13:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D48:484D<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Cultural political economy : on making the cultural turn without falling into soft economic sociology.<\/dc:title><dc:creator>\n        Jessop, Bob<\/dc:creator><dc:creator>\n        Oosterlynck, Stijn<\/dc:creator><dc:subject>\n        HM Sociology<\/dc:subject><dc:description>\n        This article explores the implications of making the cultural turn in the engagement of economic and political geography with issues of political economy. It seeks to steer a path between a fetishistic, reified economics that naturalizes economic categories and a soft economic sociology that focuses on the similarities between economic and other socio-cultural activities at the expense of the specificity of the economic. We show how combining critical semiotic analysis with an evolutionary and institutional approach to political economy offers one interesting way to achieve this goal. An evolutionary and institutional approach to semiosis enables us to recognize the semiotic dimensions of political economy at the same time as establishing how and why only some economic imaginaries among the many that circulate actually come to be selected and institutionalized; and Marxian political economy enables us to identify the contradictions and conflicts that make capital accumulation inherently improbable and crisis-prone, creating the space for economic imaginaries to play a role in stabilizing accumulation in specific spatio-temporal fixes and\/or pointing the way forward from recurrent crises. The paper illustrates these arguments with a case study on the Flemish â��anchoring strategyâ�� as a specific regional economic development strategy. It concludes with a set of guidelines for the further development of cultural political economy.<\/dc:description><dc:date>\n        2008-05-06<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/505\/1\/%2D_E%2D2007b_CPE%2DGeoforum.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.geoforum.2006.12.008<\/dc:relation><dc:identifier>\n        Jessop, Bob and Oosterlynck, Stijn (2008) Cultural political economy : on making the cultural turn without falling into soft economic sociology. Geoforum, 39 (3). pp. 1155-1169. ISSN 0016-7185<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/505\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.geoforum.2006.12.008","http:\/\/eprints.lancs.ac.uk\/505\/"],"year":2008,"topics":["HM Sociology"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1 \nCultural Political Economy: on Making the Cultural Turn without Falling into \nSoft Economic Sociology \n \nBob Jessop and Stijn Oosterlynck \n \nAbstract: This article explores the implications of making the cultural turn in the \nengagement of economic and political geography with issues of political economy. It \nseeks to steer a path between a fetishistic, reified economics that naturalizes \neconomic categories and a soft economic sociology that focuses on the similarities \nbetween economic and other socio-cultural activities at the expense of the specificity \nof the economic. We show how combining critical semiotic analysis with an \nevolutionary and institutional approach to political economy offers one interesting \nway to achieve this goal. An evolutionary and institutional approach to semiosis \nenables us to recognize the semiotic dimensions of political economy at the same \ntime as establishing how and why only some economic imaginaries among the many \nthat circulate actually come to be selected and institutionalized; and Marxian political \neconomy enables us to identify the contradictions and conflicts that make capital \naccumulation inherently improbable and crisis-prone, creating the space for \neconomic imaginaries to play a role in stabilizing accumulation in specific spatio-\ntemporal fixes and\/or pointing the way forward from recurrent crises. The paper \nillustrates these arguments with a case study on the Flemish ‘anchoring debate’ as a \nspecific regional economic development strategy. It concludes with a set of \nguidelines for the further development of cultural political economy. \n \nKey words: Semiosis; critical discourse analysis; hegemony; cultural political \neconomy; Belgium; accumulation strategy; state project; nationalism; regionalization; \n \nBob Jessop is Professor of Sociology and Director of the Institute for Advanced \nStudies at Lancaster University.  \nStijn Oosterlynck is a post-doctoral research associate in the School of Geography, \nManchester University. \n \n 2 \nCultural Political Economy: on Making the Cultural Turn without Falling into \nSoft Economic Sociology \n \nThis contribution aims to redirect the cultural turn(s) in economic and political \ngeography by making and illustrating the case for a distinctive approach to ‘cultural \npolitical economy’ (hereafter CPE refers to this approach and not to the wider set of \ncultural turns in political economy).1 This combines concepts and tools from critical \nsemiotic analysis with others from critical political economy to produce a distinctive \npost-disciplinary approach to the analysis of capitalist social formations (cf. Jessop \nand Sum 2001). While it is not demonstrated here, CPE can also be applied to non-\ncapitalist economic and political orders by combining a critical analysis of the \nproduction of intersubjective meaning (i.e., semiosis) with concepts suited to such \norders and their institutional dynamics. One of the key differences between CPE and \nother approaches that make a cultural turn is its explicit integration of the general \nevolutionary mechanisms of variation, selection, and retention into semiotic analysis \nand, in particular, its concern with the path-dependent co-evolution of the semiotic \nand extra-semiotic aspects of actually existing political economies. In other words, \nwe take for granted the path-shaping potential of economic imaginaries (in their \ndifferent forms and varying content) and seek to explain why only some economic \nimaginaries among the many that circulate actually come to be selected and \ninstitutionalized and thereby come to co-constitute economic subjectivities, interests, \nactivities, organizations, institutions, structural ensembles, emergent economic \norders and their social embedding, and the dynamics of economic performance. We \nalso emphasize that these general evolutionary mechanisms are mediated in and \nthrough the distinctive forms and institutional dynamics of capitalism (or other forms \nof political economy) as well as through the general features of semiosis. Indeed, it \nseems that the relative importance of institutional materiality increases from the stage \nof variation in economic and political imaginaries through the stage when they are \nselectively translated into specific material practices and institutional dynamics to the \nstage when they are embodied in a structurally coherent set of social relations and a \nspatio-temporal fix compatible with continued accumulation (see below).  \n \nCombining the semiotic and extra-semiotic in this way facilitates two lines of \ninvestigation of particular relevance to economic, political, and cultural geography. \n 3 \nFirst, given the infinity of meaningful communications and (mis)understandings \nenabled by semiosis, how do extra-semiotic as well as semiotic factors affect the \nvariation, selection, and retention of particular instances of semiosis and their \nassociated practices in ordering, reproducing and transforming capitalist social \nformations and their various spatio-temporal features? Second, given the \ncontradictions, dilemmas, indeterminacy, and overall improbability of capitalist \nreproduction, especially during its recurrent crises, what role does semiosis play in \nconstruing, constructing, and temporarily stabilizing capitalist social formations at \nleast within specific spatio-temporal fixes and their zones of relative stability even as \nit displaces and defers conflicts, contradictions, and crisis-tendencies elsewhere \nand\/or into the future?2 In regard to both questions, we argue, as noted above, that \nthe relative weight of semiotic and extra-semiotic mechanisms changes over the \nanalytically distinct, but frequently empirically overlapping, steps of variation, \nselection, and retention. After elaborating the general case for CPE, we illustrate it \nfrom the emergence, selection, and attempted implementation of two successive \neconomic imaginaries that have informed economic policies in Belgium: the Belgian \nand Flemish ‘anchoring’ strategies. We conclude with a set of guidelines for the \nfurther development of cultural political economy. \n \nCultural Political Economy \n \nArguments in favour of ‘cultural political economy’ seem to have emerged in several \ncontexts during the 1990s as part of and\/or in response to the cultural turn. The \npresent version was developed by scholars at Lancaster University3 drawing on a far \nwider range of sources. But it was prefigured in some major versions of critical \npolitical economy and in some ‘old institutionalisms’ and it has significant parallels in \na range of contemporary disciplinary and trans-disciplinary endeavours.4 Among \nrecent geographical studies, for example, we can note the contrasting approaches of \nBarnett (2004), Crang (1997), Hudson (2004), Mitchell (2000), Sayer (2001), and \nThrift (2004). Our CPE approach has three defining features. First, like other currents \nin evolutionary and institutional political economy and unlike the more usual generic \nstudies of semiosis, CPE opposes transhistorical analyses, insisting that both history \nand institutions matter. This is where the strategic-relational dialectic of path-\ndependency and path-shaping and its associated emphasis on the evolutionary \n 4 \nmechanisms of variation, selection, and retention (Campbell 1969) have a key role in \nshaping the dynamics of semiosis. Second, unlike many currents in evolutionary and \ninstitutional political economy but like other variants of cultural materialism, CPE \ntakes the cultural turn seriously, highlighting the complex relations between \nmeanings and practices. For the production of intersubjective meaning is crucial to \nthe description, understanding, and explanation of economic and political conduct \njust as it is for other types of behaviour and their emergent properties. And, third, \nbuilding on these two features, CPE focuses on the co-evolution of semiotic and \nextra-semiotic processes and their conjoint impact on the constitution and dynamic of \ncapitalist formations. This general approach can be re-stated in terms of four broad \nclaims about the role of semiosis in the critique of political economy. \n \nOntologically, semiosis has a key role in the overall constitution of specific social \nobjects and social subjects and, a fortiori, in their co-constitution and co-evolution in \nwider ensembles of social relations. Thus CPE rejects two related tendencies in \northodox political economy: (a) the tendency to naturalize or reify its theoretical \nobjects (such as land, machines, the division of labour, production, money, \ncommodities, the information economy); and (b) the tendency to offer thin accounts, \nat most, of how subjects and subjectivities are formed and how different modes of \ncalculation emerge, come to be institutionalized, and get modified. For CPE, \ntechnical and economic objects are always socially constructed, historically specific, \nmore or less socially embedded in – or disembedded from – broader networks of \nsocial relations and institutional ensembles, more or less embodied and ‘embrained’ \nin individual actors, and require continuing social 'repair' work for their reproduction. \nThe same points hold for the objects of orthodox political science and (neo-)realist \ninternational relations theory. The former tends to treat the state as a set of \ngovernmental institutions used by state managers and other political forces to pursue \ninterests that are objectively grounded in their respective social positions. Realist and \nneo-realist international relations theory also naturalizes interests in explaining the \nnecessary logic of state action. In contrast, the Lancaster CPE approach follows \nMarx, Gramsci, and Poulantzas (among others) in studying the state in its inclusive \nsense (‘political society + civil society’) as a social relation. This approach regards \nstate power as the discursively- and institutionally-mediated condensation of a \nchanging balance of forces. It examines struggles to shape the identities, \n 5 \nsubjectivities, and interests of the forces engaged in political struggle as well as to \ntransform the state system and its various selectivities. Moreover, in revealing the \nsocially constructed nature of the phenomena of political economy, CPE involves a \nform of political intervention that goes beyond Ideologiekritik (which serves at best to \nuncover the ideal and material interests behind specific meaning systems and \nideologies) to explore the semiotic and extra-semiotic mechanisms involved in \nselecting and consolidating the dominance and\/or hegemony of some meaning \nsystems and ideologies over others (see below). \n \nEpistemologically, inspired by the Marxian critique of political economy, our approach \nto CPE not only critiques the categories and methods of orthodox political economy \nbut also emphasizes the contextuality and historicity of all claims to knowledge. It \nfollows that a self-consistent CPE calls for reflexivity on the part of social scientists \nabout the conditions of their own practices. At the same time, in stressing the \nmateriality of social relations and their emergent properties, CPE aims to avoid the \ntemptations of pure social constructivism, according to which social reality is \nreducible to participants’ meanings and understandings of their social world. This sort \nof reductionism generates an arbitrary account of the social world that ignores the \nunacknowledged conditions of action as well as the many and varied emergent \nproperties of action that go un- or mis-recognized by the relevant actors. It also \nignores the many and varied struggles to transform the conditions of action, actors’ \nmeanings and understandings, and to modify emergent properties. In short, CPE \nnotes both the constitutive role of semiosis and the emergent extra-semiotic features \nof social relations and their impact on capacities for action and transformation. \n \nMethodologically, CPE combines concepts and tools from critical semiotic analysis \nwith those from critical political economy. Semiosis is an umbrella term for different \napproaches to the cultural turn insofar as they assume both that semiosis is causally \nefficacious as well as meaningful. This implies that actual events and processes and \ntheir emergent effects can be explained, at least in part, as well as interpreted in \nterms of semiosis. Thus CPE studies the role of semiotic practices not only in the \ncontinual (re-)making of social relations but also in the contingent emergence \n(variation), privileging (selection), ongoing realization (retention), and subsequent \nreinforcement through structural coupling (consolidation) of their extra-semiotic \n 6 \nproperties. It is the continuing interaction between the semiotic and extra-semiotic in \na complex co-evolutionary process of variation, selection, and retention that gives \nrelatively successful economic and political imaginaries their performative, \nconstitutive force in the material world. Our case study illustrates this below (for other \nLancaster examples, see Jessop 2004; Sum 2004, 2005). \n \nSubstantively, CPE affirms the overall complexity of the social world and the cognate \nimportance of complexity reduction as a condition of social action. Adopting a \nstrategic-relational approach to this process, it assumes that complexity reduction \ninvolves discursively-selective ‘imaginaries’ and structurally-selective institutions. \nImaginaries are semiotic systems that provide the basis for the lived experience of an \ninordinately complex world; institutions provide the means of embedding lived \nexperience in broader social relations and, perhaps, rendering it consistent across \ndifferent social spheres. Transferring these abstract ideas to what orthodox \neconomics misleadingly describes as the macro-level, CPE distinguishes the \n‘actually existing economy’ as the chaotic sum of all economic activities (broadly \ndefined as concerned with the social appropriation and transformation of nature for \nthe purposes of substantive provisioning)5 from the 'economy' (or, better, 'economies' \nin the plural) as an imaginatively narrated, more or less coherent subset of these \nactivities occurring within specific spatio-temporal frameworks. The totality of \neconomic activities is so unstructured and complex that it cannot be an object of \neffective calculation, management, governance, or guidance. Instead such practices \nare always oriented to subsets of economic relations (economic systems, \nsubsystems, or ensembles) that have been semiotically and, perhaps \norganizationally and institutionally, fixed as appropriate objects of intervention. \n \nWe argue that economic imaginaries have a crucial constitutive role in this regard. An \neconomic imaginary is a semiotic order, i.e., a specific configuration of genres, \ndiscourses and styles and, as such, constitutes the semiotic moment of a network of \nsocial practices in a given social field, institutional order, or wider social formation \n(Fairclough 2003). Thus an economic imaginary (re-)articulates various genres, \ndiscourses, and styles around a particular conception of the economy and its extra-\neconomic conditions of existence. Economic imaginaries are always selectively \ndefined – due to limited cognitive capacities and to the discursive and material biases \n 7 \nof specific epistemes and economic paradigms. They typically exclude elements – \nusually unintentionally – that are vital to the overall performance of the subset of \neconomic (and extra-economic) relations that have been identified. Such exclusions \nlimit in turn the efficacy of economic forecasting, management, planning, guidance, \ngovernance, etc., because such practices do not (indeed, cannot) take account of \nexcluded elements and their impact. Moreover, if they are to prove more than \n‘arbitrary, rationalistic, and willed’ (Gramsci 1971: 376-7), these imaginaries must \nhave some significant, albeit necessarily partial, correspondence to real material \ninterdependencies in the actually existing economy and\/or in the relations between \neconomic and extra-economic activities. Similar arguments would apply, with \nappropriate changes, to so-called meso- or micro-level economic phenomena, such \nas industrial districts or individual enterprises (see below). \n.  \nImagined economies are discursively constituted and materially reproduced on many \nsites and scales, in different spatio-temporal contexts, and over various spatio-\ntemporal horizons. They extend from one-off transactions through stable economic \norganizations, networks, and clusters to ‘macro-economic’ regimes. While massive \nscope for variation typically exists at an individual transactional level, the medium- to \nlong-term semiotic and material reproduction requirements of meso-complexes and \nmacro-economic regimes narrow this scope considerably. The recursive selection of \nsemiotic practices and extra-semiotic processes at these scales tends to reduce \ninappropriate variation and to secure the ‘requisite variety’ (constrained heterogeneity \nrather than simple uniformity) that supports the structural coherence of economic \nactivities. Indeed stable semiotic orders, discursive selectivities, social learning, path-\ndependencies, power relations, patterned complementarities, and material \nselectivities all become more significant, the more that material interdependencies \nand\/or issues of spatial and intertemporal articulation increase in and across diverse \nfunctional systems and the lifeworld. Yet this growing set of constraints also reveals \nthe fragility and, indeed, improbability of the smooth reproduction of complex social \norders. This highlights the importance of retaining an appropriate repertoire of \nsemiotic and material resources and practices that can be flexibly and reflexively \ndeployed in response to emerging disturbances and crises (cf. Grabher 1994).  \n 8 \nEconomic imaginaries at the meso- and macro-levels develop as economic, political, \nand intellectual forces seek to (re)define specific subsets of economic activities as \nsubjects, sites, and stakes of competition and\/or as objects of regulation and to \narticulate strategies, projects and visions oriented to these imagined economies. \nThese forces tend to manipulate power and knowledge to secure recognition of the \nboundaries, geometries, temporalities, typical economic agents, tendencies and \ncounter-tendencies, distinctive overall dynamic, and reproduction requirements of \ndifferent imagined economies (Daly 1991; Miller and Rose 1993). They also seek to \ndevelop new structural and organizational forms that will help to institutionalize these \nboundaries, geometries, and temporalities in an appropriate spatio-temporal fix that \ncan displace and\/or defer capital’s inherent contradictions and crisis-tendencies. \nHowever, by virtue of competing economic imaginaries, competing efforts to institute \nthem materially, and an inevitable incompleteness in the specification of their \nrespective economic and extra-economic preconditions, each 'imagined economy' is \nonly ever partially constituted. There are always interstitial, residual, marginal, \nirrelevant, recalcitrant and plain contradictory elements that escape any attempt to \nidentify, govern, and stabilize a given 'economic arrangement' or broader 'economic \norder' (Jessop 2002). These provide important sources of resistance and help \npreserve a reservoir of semiotic and material resources that enable dominant \nsystems (through the agency of their associated social forces) to adapt to new \nchallenges through their re-articulation and recombination in the service of power. \n \nRelatively successful economic imaginaries have their own, performative, constitutive \nforce in the material world.6 For their operation presupposes a substratum of \nsubstantive economic relations and instrumentalities as their elements; in addition, \nwhere an imaginary is successfully operationalized and institutionalized, it transforms \nand naturalizes these elements and instrumentalities into moments of a specific \neconomy with specific emergent properties. For economic imaginaries identify, \nprivilege, and seek to stabilize some economic activities from the sum of economic \nrelations and turn them into objects of observation, calculation, and governance. \nTechnologies of economic governance, operating sometimes more semiotically, \nsometimes more materially,7 constitute their own objects of governance rather than \ngoverning already pre-constituted objects (Jessop 1990, 1997). \n \n 9 \nTaking for granted the general principles of critical semiotic analysis (Fairclough \n2003) to focus on broader evolutionary and institutional issues in political economy, \nwe note that there is constant variation, witting or unwitting, in apparently routine \nsocial practices. This poses questions about the regularization of practices in normal \nconditions and about possible sources of radical transformation, especially in periods \nof crisis. The latter typically lead to profound cognitive and strategic disorientation of \nsocial forces and a corresponding proliferation in discursive interpretations and \nproposed material solutions. Nonetheless the same basic mechanisms serve to \nselect and consolidate radically new practices and to stabilize routine practices. \nSimplifying the analysis of evolutionary mechanisms given in Fairclough et al. (2004) \nand extending it to include material as well as semiotic factors, a first cut at \nspecifying these mechanisms suggests the following: \n a) Continuing variation in discourses and practices, whether due to their \nincomplete mastery, their skilful adaptation in specific circumstances, new \nchallenges or crises, or other semiotic or material causes.  \nb) Selection of particular discourses (the privileging of just some available, \nincluding emergent, discourses) for interpreting events, legitimizing actions, and \n(perhaps self-reflexively) representing social phenomena. Semiotic factors \noperate here by influencing the resonance of discourses in personal, \norganizational and institutional, and broader meta-narrative terms and by limiting \npossible combinations of semiosis and semiotic practices in a given semiotic \norder. Material factors also operate here through conjunctural or institutionalized \npower relations, path-dependency, and structurally-inscribed selectivities. \nc) Retention of some resonant discourses (e.g., inclusion in an actor’s habitus, \nhexis, and personal identity, enactment in organizational routines, integrated into \ninstitutional rules, objectification in the built environment, material and intellectual \ntechnologies, and articulation into widely accepted accumulation strategies, state \nprojects, or hegemonic visions). The greater the range of sites (horizontally and \nvertically)8 in which resonant discourses are retained, the greater is the potential \nfor effective institutionalization and integration into patterns of structured \ncoherence and durable compromise. The constraining influences of complex, \nreciprocal interdependences will also recursively affect the scope for retaining \nresonant discourses.  \n 10 \nd) Reinforcement insofar as procedural devices exist that privilege these \ndiscourses and associated practices and also filter out contrary discourses and \npractices. This can involve both discursive selectivity (e.g., genre chains, styles, \nidentities) and material selectivity (e.g., the privileging of certain dominant sites of \ndiscourse in and through structurally-inscribed strategic selectivities of specific \norganizational and institutional orders). Such mechanisms recursively strengthen \nappropriate genres, styles, and strategies and selectively eliminate inappropriate \nalternatives and are most powerful where they operate across many different \nsites to promote complementary discourses within the wider social ensemble. \ne) Selective recruitment, inculcation, and retention by relevant social groups, \norganizations, institutions, etc., of social agents whose predispositions fit \nmaximally with the preceding requirements. \n \nThis list emphasizes the role of semiosis and its material supports in securing social \nreproduction through the selection and retention of mutually supportive discourses. \nConversely, the absence or relative weakness of one or more of these semiotic \nand\/or extra-semiotic conditions may undermine previously dominant discourses \nand\/or block the selection and retention of appropriate innovative discourses. This \nabsence or weakness is especially likely in periods of profound disorientation due to \nrapid social change and\/or crises that trigger major semiotic and material innovations \nin the social world. We should note here that the semiotic and extra-semiotic space \nfor variation, selection, and retention is contingent, not pre-given. This also holds for \nthe various and varying semiotic and material elements whose selection and \nretention occurs in this ‘ecological’ space. In a complex world there are many sites \nand scales on which such evolutionary processes operate and, for present purposes, \nwhat matters is how local sites and scales come to be articulated to form more global \n(general) sites and scales and how the latter in turn frame, constrain, and enable \nlocal possibilities (Wickham 1987). These interrelations are themselves shaped by \nthe ongoing interaction between semiotic and extra-semiotic processes.  \n \nIntegrating Critical Semiotic Analysis into Political Economy \n \nA particularly interesting moment in the development of economic imaginaries is the \nemergence of crises affecting economic identities and performance. A CPE approach \n 11 \nimplies that crisis is never a purely objective process or moment that automatically \nproduces a particular response or outcome. Instead a crisis emerges when \nestablished patterns of dealing with structural contradictions, their crisis-tendencies, \nand dilemmas no longer work as expected and, indeed, when continued reliance \nthereon may even aggravate the situation. Crises are most acute when crisis-\ntendencies and tensions accumulate across several interrelated moments of the \nstructure or system in question, limiting room for manoeuvre in regard to any \nparticular problem. Changes in the balance of forces mobilized behind and across \ndifferent types of struggle also have a key role in intensifying crisis-tendencies and in \nweakening and\/or resisting established modes of crisis-management (Offe 1984: 35-\n64). This creates a situation of more or less acute crisis, a potential moment of \ndecisive transformation, and an opportunity for decisive intervention. In this sense, a \ncrisis situation is unbalanced: it is objectively overdetermined but subjectively \nindeterminate (Debray 1973: 113). And this creates the space for determined \nstrategic interventions to significantly redirect the course of events as well as for \nattempts to 'muddle through' in the (perhaps forlorn) hope that the situation will \nresolve itself in time. In short, crises are potentially path-shaping moments.  \n \nSuch path-shaping is mediated semiotically as well as materially. Crises encourage \nsemiotic as well as strategic innovation. They often prompt a remarkable proliferation \nof alternative visions rooted in old and new semiotic systems and orders. Many of \nthese will invoke, repeat, or re-articulate established genres, discourses, and styles; \nothers may develop, if only partially, a ‘poetry for the future’ that resonates with new \npotentialities (Marx 1996: 32-34). Which of the proliferating alternatives, if any, is \neventually selected, retained and consolidated is mediated in part through discursive \nstruggles to define the nature and significance of the crisis and what might follow \nfrom it. If the crisis can be interpreted as a crisis in the existing economic order, then \nminor reforms and a passive revolution will first be attempted to re-regularize that \norder. If this fails and\/or if the crisis is already interpreted initially as a crisis of the \nexisting economic order, a discursive space is opened to explore more radical \nchanges. In both cases conflicts also concern how the costs of crisis-management \nget distributed and the best policies to escape from the crisis.  \n \n 12 \nIn periods of major social restructuring, diverse economic, political, and socio-cultural \nnarratives may intersect as they seek to give meaning to current problems by \nconstruing them in terms of past failures and future possibilities. Different social \nforces in the private and public domains propose new visions, projects, programmes, \nand policies and a struggle for hegemony grows. The plausibility of these narratives \nand their associated strategies and projects depends on their resonance (and hence \ncapacity to reinterpret and mobilize) with the personal (including shared) narratives of \nsignificant classes, strata, social categories, or groups affected by the postwar \neconomic and political order. Moreover, although many plausible narratives are \npossible, their narrators will not be equally effective in conveying their messages and \nsecuring support for the lessons they hope to draw. This will depend on the prevailing \n‘web of interlocution’9 and its discursive selectivities, the organization and operation \nof the mass media, the role of intellectuals in public life, and the structural biases and \nstrategically selective operations of various public and private apparatuses of \neconomic, political, and ideological domination.10 Such concerns take us well beyond \na concern for narrativity and\/or the constraints rooted in specific organizational or \ninstitutional genres, of course, into the many extra-discursive conditions of narrative \nappeal and of stable semiotic orders. That these institutional and meta-narratives \nhave powerful resonance does not mean that they should be taken at face value. All \nnarratives are selective, appropriate some arguments, and combine them in specific \nways. In this sense, then, one must consider what is left unstated or silent, what is \nrepressed or suppressed in official discourse.  \n \nThe strategic-relational analysis of structure and agency in struggles over hegemony \nrests on the general evolutionary distinction between variation, selection, and \nretention. First, there is continuing variation in discourses as actors intentionally or \nunintentionally redefine the sites, subjects, and stakes of action and articulate \ninnovative strategies, projects and visions. This is especially likely during crises, \nwhich often produce profound strategic disorientation and a proliferation of alternative \ndiscourses. Second, while most of this variation is arbitrary and short-lived, lacking \nlong-term consequences for overall social dynamics, some semiotic innovations are \nselected. This occurs because they resonate discursively with other actors and social \nforces and\/or because they are reinforced through various structural mechanisms. So \n 13 \nwe must explore the discursive and extra-discursive mechanisms that select some \ndiscourses for further elaboration and effective articulation with other discourses.  \n \nDiscourses are most powerful where they operate across many sites and scales and \ncan establish and connect local hegemonies into a more encompassing hegemonic \nproject. These discourses will be retained (discursively reproduced, incorporated into \nindividual routines, and institutionally embedded) when they are able to reorganize \nthe balance of forces and guide supportive structural transformation. Although any \ngiven economic or political imaginary is only ever partially realized, those that \nsucceed, at least in part, have their own performative, constitutive force in the \nmaterial world – especially when they correspond to (or successfully shape) \nunderlying material transformations, can mobilize different elites to form a new power \nbloc, can organize popular support, disorganize opposition, and marginalize \nresistance. They will be most successful when they establish a new spatiotemporal \nfix that can displace and\/or defer capital’s inherent contradictions and crisis-\ntendencies in the international political economy. In short, discourses and their \nrelated discursive chains can generate variation, have selective effects – reinforcing \nsome discourses, filtering others out, and contribute to the differential retention \nand\/or institutionalization of social relation through the recursive selection of certain \ngenres, performances, and strategies (Jessop 2004).  \n \nEconomic Imaginaries and Region-Building \n \n‘The new regionalism’ is an umbrella term for research on how regions are \nconstituted by, and constitutive of, social, economic and political relations and \nidentities, especially in response to globalization (Paasi 2002). This poses the \nquestion of what constitutes a region or regional economy because, as Jones notes, \nthe region has become a ‘slippery and somewhat meaningless concept for \ndiscussing differently scaled and territorialized economic, social, cultural and political \nassemblages’ (2004: 62). Approaching regions as historically and geographically \ncontingent entities offers an escape from this conundrum by situating them in a multi-\nscalar framework of administrative structures, functional economic and social ties \nand meanings invested in them by residents and outsiders. This solution can be \nenhanced by taking regional imaginaries and identities seriously as potentially key \n 14 \nfactors in the co-constitution of the political and economic during the creation and \ninstitutionalization of regional economies (Agnew 2000; Jones 2004; Paasi 1991). \nWe follow this approach in our study of Belgian and Flemish anchoring strategies, \nwhich rest on different conceptions of the Belgian space economy and its internal \ndifferentiation and have very different linkages with extra-economic values and \nidentities. In exploring the selection of these strategies we show that history and \ninstitutions matter because of the changing articulation, instantiation, and spatial \nimplications of three cleavages in the Belgian social formation: religion, language, \nand class. For economic imaginaries have been shaped by the social embedding of \nthe economic order within this broader formation and successful pursuit of their \nassociated strategies depends heavily on their extra-economic contexts and supports \nas well as on their purported economic feasibility. In this sense, CPE can contribute \nto the understanding of new regionalism because it promises to integrate semiotic \nfactors into the analysis of the institutionalization of regional economies without \nfalling into ‘soft economic sociology’. The latter tends to limit the cultural turn to the \nrole of cultural factors as business assets in underpinning regional growth strategies \nand regional competitiveness and to ignore issues of power (cf. Lovering 2001).  \n \nOur case study (conducted by Stijn Oosterlynck) develops a CPE account of the \nattempted restructuring of the Belgian space economy11 in response to globalization \nand its associated relativization of scale,12  focusing in this context on the Belgian \n‘anchoring’ concept and its subsequent translation into a distinctive but ambivalent \nFlemish ‘anchoring strategy’. In particular, it explores changing political and \neconomic imaginaries, their mobilization of alternative ideas of economic nationalism, \nand the resulting tensions\/convergences with more general political and economic \nrestructuring. Moreover, drawing on the distinction between variation, selection, and \nretention, it shows that, even when certain regional imaginaries are discursively \nselected from a wider array and are translated into regional strategies pursued by \nmajor social forces, they may prove ‘arbitrary, rationalistic and willed’. In other words, \nthey will not be retained (institutionalized) in a coherent set of sustainable, region-\nbuilding apparatuses and policies because they lack the necessary material and \ndiscursive supports to ensure their effective implementation and integration into a \nreproducible economic and political order. In such cases CPE suggests that there will \nbe a renewed search for a plausible and effective imaginary. This is certainly the \n 15 \ncase in Flanders, where the newly hegemonic imaginary, yet to be properly tested, \nappears to be liberalization (Oosterlynck 2006).  \n \nThe development of the Flemish region is rooted in the distinctive articulation of two \nstructural trends in Belgian history: (a) territorialization of the Belgian language \nconflict and (b) the changing forms of regional uneven economic development. The \ntwo economic imaginaries (see below) that have proved most resonant in the recent \nanchoring debate are rooted in these historical developments and have contributed \nto the rise of the Flemish space economy as an object of strategic intervention \nwithout, however, transforming it in line with the strategic objectives of either of the \ncorresponding anchoring strategies. We seek to explain this in CPE terms below. \n \nTerritorialization of Belgium’s language problem and uneven economic development \n \nThe ‘Belgian condition’ is commonly analysed in terms of three cleavages: language, \nreligion and class (Huyse 1980). While it is tempting to take these cleavages for \ngranted as primordial or objectively grounded in economic relations, a CPE approach \ninterprets them as socially constituted bases of personal and collective identity, social \npractices, and social mobilization. Their durability as alternative lines of cleavage \nnonetheless depends on their embedding in material as well as discursive practices \nthat are changing and changeable and whose relative weight and structural coupling \ncan vary (and, indeed, be made to vary through appropriate strategic interventions) in \nspace-time. Religion has been marginal in the anchoring debate but it was (and to \nsome extent remains) a major constitutive force in Belgian life through the powerful \nmaterial and ideological influence of the Christian church within the education \nsystem, in labour organization in Flanders (as opposed to its minor influence over the \nWalloon labour class), its support for Belgian francophone nation-building, and its \nlinks to moderate Flemish nationalism. Language is significant for the state as well as \ncivil society because of the traditional strong francophone bias in recruiting state \nmanagers, elite formation more generally, and the organization (and fracturing) of \npower blocs and subaltern groups. And class is grounded, of course, in social \nrelations of production that are differentially articulated with, and imprinted by, \nreligious and linguistic differences. \n \n 16 \nThese considerations open the space to explore the discursive and material factors \nand processes that shape the relative weight and differential articulation of these \ncleavages and their changing significance for social action in particular conjunctures. \nA CPE perspective would ask how social groups come to be constituted as collective \nsubjects with their own distinctive modes of calculation – whether these are \ndiscursively and materially based in class, religious or ethno-linguistic differences or \nsome combination thereof – and how these identities become consolidated as bases \nof social mobilization. An adequate answer requires a more critical and constructivist \napproach to the genealogy of these antagonisms. This is certainly more than we get \nin Mandel’s well-known analysis (1963) of the dialectic of region and class in \nBelgium. For, while we share his concern with the uneven economic development of \nthe capitalist space economy, Mandel fails to examine how regions and their \ninhabitants were imagined and institutionalised as objects of economic, political, or \nsocial and as subjects whose primary identity was as class, religious, or linguistic \nsubjects. He pre-supposes instead the historically immanent unification of the \nBelgian working class through the general logic of proletarianization and claims that \nthis was blocked in the case of Flanders as regional conflicts intensified.  \n \nTo show that there was nothing pre-given, let alone unchanging, about these three \ncleavages, we show how each emerged and has been transformed over time and \nhow all three have come to be articulated in different ways at different times. We also \nshow that changes in their relative significance and structural coupling are mediated \nnot only through emergent, unintended, and, perhaps, unacknowledged structural \nshifts but also through the mobilization of relevant social forces around competing \nsocial imaginaries. This requires a stylized CPE account of Belgian political economy \nas the history of the making, unmaking and remaking of collective subjects, their \nuneven institutionalisation, and the eventual consolidation into power structures. We \naddress economic, linguistic, and religious identities in turn without seeking to imply \nthrough this order of presentation that the economy is somehow determinant, \nwhether in the first or even last instance. \n \nFrom its emergence as a potential object of calculation and governance with the \nformation of an independent Belgian state in 1830, the Belgian economy experienced \nhighly uneven development. High energy transport costs and a pivotal role for the \n 17 \nsteel industry in economic development stimulated the rapid industrialization of the \ncoal-rich Walloon provinces with some spillover into light industry and consumption \ngoods (Vandermotten et al., 1990). In contrast, the Flemish provinces remained \nlargely rural and underdeveloped, except for some industrial small pockets around \nGhent (textiles) and Antwerp (port facilities). The seeds of change were planted in \nthe 1880 economic crisis, however, which was concentrated in Wallonia. This \ndestroyed the latter’s light industrial and consumer goods sectors and the resulting \nlack of diversification and investment became major factors in Walloon economic \ndecline in the 20th century. The trend towards uneven development was intensified \nthrough the second industrial revolution following the Great Depression (1929-32) \nbecause this particularly benefited the Antwerp region without bringing much \nadvantage to Wallonia. While the former gained from investments in non-ferrous \nmetals, carbon- and petro-chemicals, and electricity generation linked partly to its \nstrategic port location (Vandermotten, Saey and Kesteloot 1990). The selective \nnature of this industrialization wave and its close ties to the interests of frenchified \nnational capital prevented the rise during this period of an autonomous Flemish \nspace economy and an autonomous Flemish bourgeoisie. At the same time, the \nlegacies of previous rounds of investment in Wallonia left little social or geographical \nroom for an industrial restructuring policy. Accordingly Belgian national financial \ncapital sought a new spatial fix in response to lack of investment opportunities in this \nregard by resorting to foreign investments, mainly in the Congo and China (cf. the \ngeneral model in Harvey 1982). Paradoxically this pattern of uneven development \nbetween the Flemish and Walloon regions saw the final integration of a Belgian \nspace economy based on the Antwerp-Brussels-Charleroi industrial axis. This was \nachieved through the centralization of capital on the national level, in which the \nBelgian holding company, Sociéte Générale, played a key role, so that it viewed the \nwhole of the Belgian economy as a relatively unified object of economic calculation \nshaped by the dynamic of the so-called A-B-C axis.  \n \nRegarding language, although a majority of the population still spoke various Flemish \ndialects when the Belgian state was created in 1830, the new government decreed \nthat French would be the sole official language. This reflected the interests of the \nlargely francophone elite, including frenchified ‘Flemings’ (Murphy 1988). At this time \nthe language division was more social than geographical because the inhabitants of \n 18 \nFlanders and Wallonia saw themselves either as commoners with largely local \nidentities or else as members of the national elite (Murphy 1988; Reynebeau 1995). \nThe resulting primacy of social over regional-territorial division is reflected in the fact \nthat the ‘Flemish movement’ that emerged soon after independence among middle \nclass intellectuals pursued a liberal struggle for individual language rights and \nincreased bilingualism rather than calling for segregation into unilingual spaces. Only \nin the early 20th century did the latter approach replace the liberal conception, which \nhad envisaged the use of French in Flemish provinces. The turn against bilingualism \nwas due to frustration with the slow progress of the language laws, the diffusion of \nregional-linguistic ideas because of earlier legislative and political developments, the \nintroduction of universal male suffrage which increased the political power of the \nFlemings, and the associated wish to strengthen the Flemish movement’s social \nbase by stressing regional commonalities and continuities at the expense of national \nintegration under francophone dominance. It is important to note here that the \nregionalization of the language question was contingent on crucial political factors \nrather than something inscribed at birth in the very nature of the Belgian state. \n \nAfter the Second World War, ethno-linguistic consciousness expanded as issues only \nloosely linked with language gained regional sensitivity. The Royal Question and the \nsecond School Struggle are emblematic here. First, a sharp political controversy \nemerged in 1946 about King Leopold III’s political stance before and during the war \n(Reynebeau 2005). This was essentially an ideological confrontation between \nCatholics and atheist Socialists and turned on the strategy of the CVP, the Belgian \ncatholic (later Christian Democrat) party, to use its support for the King to win an \nabsolute political majority in the Belgian state by mobilizing the Flemish majority in \nBelgium as a whole and the Catholic majority in Flanders. A referendum was held in \nMarch 1950 on whether the King should step down or not; it gave Leopold III 57% of \nthe votes. This seemed to divide the country into a conservative and catholic \nFlanders and an atheist and leftist Wallonia but the division between urban-industrial \nand rural-agrarian groupings was actually more significant. For, while a majority of \nthe Flemings voted for the King, a majority of Walloons and Brussellois voted \nagainst. The ensuing stalemate was only resolved when Leopold III abdicated, \nsignifying the failure of the Catholics’ absolute majority strategy. Yet Flemish \n 19 \nnationalists often present this outcome as a defeat of the Flemish majority at Walloon \nhands, reinforcing thereby claims about the repressive ‘francophone’ Belgian state. \n \nThe ‘second school struggle’ was precipitated when the Christian-democrats (CVP), \nthe biggest political party in Belgium, were ousted in 1954 by a socialist-liberal \ncoalition government (Reynebeau 1995; Reynebeau 2005; Witte 1997). This \nreversed its predecessor’s pro-Catholic education policies, reactivating a crucial line \nof conflict between Belgium’s opposing political-ideological forces rooted in the \nnineteenth century competition between two cultural projects associated with the \nliberal (and later Socialist) party and the Catholic – later Christian-democrat – party \nrespectively. One project was to build a secular national state, the other to promote \nthe values of the catholic majority. This conflict was alleviated by a compromise that \nlaid the basis of the Belgian pillarisation system. Public finance was granted to \ndevelop a catholic socio-cultural pillar, allowing the Church to maintain ideological \ncontrol over its faith community, in return for its ceasing to contest Belgian nation- \nand state-building. The post-war development of mass education enabled Socialists \nand Liberals to break the resulting Catholic dominance in education by redirecting \npublic finance towards state education. The Catholic pillar responded by mobilizing \nits grassroots in hard extra-parliamentary action. The dispute was resolved through a \nschool pact in 1958 that increased resources for free (i.e., Catholic) education and \nrelaxing controls on the expansion of state education. While this mainly an \nideological conflict, it had a strong regional dimension because Catholics were over-\nrepresented in Flanders and Socialists in Wallonia.  \n \nSuch issues show how ideological conflicts among Socialists, Liberals and Catholics \ncould become intertwined with language politics (Huyse 1980; Reynebeau 1995). \nThe latter gradually developed into a conflict between geographically separated \ncommunities defending different societal models. In particular, once the School Pact \nsignificantly reduced tensions between the Catholic and secular groupings, political \nenergy in the 1960s and 1970s could turn to socio-economic issues and ethno-\nlinguistic conflicts (Witte 1997). These two conflicts converged in the strikes against \nthe Unity Law in 1960 and 1961, prompted by the severe economic crisis of the \n1950s and the shifting of the economic centre of gravity in the ABC-axis towards \nFlanders due to massive postwar investment in this region by multinationals \n 20 \n(Vandermotten, Saey and Kesteloot 1990). These developments finally led the \nWalloon working class to interpret structural economic decline in terms of a growing \npolarization between Flanders’ dominance and Wallonia’s semi-peripheral status. \n \nThe strikes against the Unity Law fused reactions to this regional uneven economic \ndevelopment with the ongoing territorialization of the language conflict. The Unity \nLaw was proposed in 1960 by the government of the Flemish Christian-democrat \nEyskens. It envisaged drastic cuts in social expenditures and higher indirect taxation \nto finance industrial modernisation and economic expansion, which were deemed \nnecessary to overcome the long-term economic crisis (Eyskens 1988; Witte 1997). \nThe proposal triggered a five-week general strike, paralysing industry in Wallonia and \nspreading to the Flemish ports of Antwerp and Ghent. The strike’s centre of gravity \nwas in the heavy industries and in Wallonia. While the Christian trade union ACV, \nwhich is dominant in Flanders, supported ‘their’ minister, the ill-prepared Flemish \nsocialist trade unionists and national socialist party never recognized the strike. \nDisillusioned by the Flemish reluctance to participate in the strike, some Walloon \nstrike leaders despaired at what they saw as the stranglehold of a Flemish \nconservative and catholic parliamentary majority. In a decisive turn, they campaigned \nfor the tools to pursue autonomous reforms of the Walloon industrial structure and \nthereby initiated the fusion of regional and labour movement struggles. This gave a \ndecisive political-economic content to divisions that had previously been expressed in \nWallonia in terms of Flemish ‘encroachment’ on the status of the French language. \nThis shift also led to a turn from defence of the linguistic status quo to an offensive \nstrategy to advance Walloon politico-economic interests in the new conjuncture.  \n \nThis conjuncturally-determined fusion of the Walloon working classes and the \nWalloon federalist movement was decisive in shaping the contrasting imaginaries \nthat came to inform Flemish and Walloon regionalisation strategies. In sum, the \ncombined force of regional uneven economic development and territorialization of the \nlanguage conflict triggered political and economic communitarianism on regional \nlines. This shift gradually led to Belgium’s legal transformation from a unitary into a \nfederal state between 1970 and 1993 (Van Istendael 1993) and provides the context \nfor the Flemish anchoring debate. This is one of the most important debates \nconcerning Flemish economic strategies in the last two decades and we now show \n 21 \nhow the cultural and institutional resources developed during two centuries of Belgian \nhistory have been (and are still being) articulated into two economic imaginaries as \ncompeting bases for constructing the Flemish regional space economy.  \n \nThe anchoring debate \n \nIn the late 1980s Belgium’s traditional welcome to multinational capital turned to fear \nabout losing economic self-determination. This crystallised in the Belgian anchoring \ndebate, triggered when the main Belgian holding company, Société Générale \n(hereafter SG), suffered a share raid in January 1988 by Carlo de Benedetti, an \nItalian investor. The debate concerned whether national decision-making power over \nthe economic infrastructure is desirable and necessary to maintain a strong economy \nand fund welfare (Brockmans 1995, Daems and Van de Weyer 1993, Geens 1995). \nIn this sense it turned on competing conceptions of the Belgian economy, its insertion \ninto the European, Atlantic, and global economic order, the changing nature of \neconomic competitiveness and its extra-economic conditions of existence, and the \nextent to which the ‘Belgian condition’ involved distinctive constraints and \nopportunities on the pursuit of national and regional economic strategies. What gave \nthe anchoring debate its specificity in a period of general concern about the ability of \nnational states to manage national economies in the interests of national citizens (cf. \nJessop 2002) was, of course, the relative fragility of the Belgian state, economy, and \nsense of citizenship due to the changing articulation of the religious, linguistic, and \nterritorial issues as well as the nature of Belgian bourgeoisie and other classes. \n \nThe raid on SG was a shock because it had a crucial role in integrating the Belgian \nspace economy and indirectly controlled over a third of the Belgian economy \n(Economist 1988). SG tried to stave off this hostile bid by (illegally) increasing its own \ncapital. A week later a Belgian businessman, André Leysen, proposed a \nredistribution of SG shares in order to provide a Belgian anchor for SG and thus keep \npart of its economic decision-making power in domestic hands (Cottenier, De \nBoosere and Gounet 1989, Lamy 1990). But Leysen’s co-operation with SG \nfoundered his Leysen’s financial and institutional links with the French holding \nParibas. Paribas is the long-time rival of Suez, a French holding which in 1987 had \nestablished cross-participations with SG as mutual protection against hostile take-\n 22 \novers. SG governor Lamy, who felt threatened by Leysens’ ambitions, asked Suez to \nintervene in the acquisition struggle, which it did after some hesitation – inter alia \nbecause it feared becoming de Benedetti’s next target. After Leysen’s failure, \nMaurice Lippens of AG, Belgium’s biggest insurance company, made a second \nBelgian anchoring attempt. Lippens did reach an agreement with Suez and together \nthey acquired a majority of SG. Belgian anchoring seemed to have been ‘realised’, \nalbeit with a majority of French shares (van Waterschoot 1988). \n \nThe Flemish business magazine Trends, a staunch promoter of Flemish as opposed \nto Belgian anchoring, initially welcomed the hostile bid on SG (Crols 1988b). For \nFlemish nationalists and politicians, SG was the symbol of the Belgian francophone \neconomic elite, which, they felt, had always disregarded Flemings and blocked \neconomic opportunities for Flanders. The then Trends chief editor, Frans Crols, wrote \nthat Flemings felt liberated after “having been pushed into a servant’s role for 165 \nyears by the rentiers of the Koningsstraat”13 and that “this does not concern the \nBelgian economy, the raid is concerned with one third of the Belgian economy, the \nmost outmoded and dormant”. Trends hailed the acquisition struggle as the final blow \nto the traditional Belgian francophone holding bourgeoisie and wrote optimistically \nabout the opportunities this new situation offered Flanders. When Suez entered the \nscene, however, the tone of the Trends commentaries changed (see e.g. Crols \n1988a). Its intervention was portrayed as a friend’s service within the same traditional \nfrancophone establishment and was seized on by Flemish anchorers to attack \nBelgian anchoring as a Trojan horse intended to keep francophone control over the \nFlemish economy (Brockmans 1995).  \n  \nThe strategy of Belgian anchoring failed for two main reasons. First, the takeover of \nSG removed the main anchor and guiding force of the Belgian space economy with \nthe result that it was harder to maintain a coherent strategy. Second, the strategy’s \nnational orientation was undermined as the Belgian economy and its social \nembedding experienced political-economic regionalisation on two fronts. For the \nWalloon and socialist labour movement blamed the deepening crisis of the Walloon \neconomy on the conservative economic strategy of SG and other Belgian holdings; \nand many Flemish politicians became disillusioned with the Belgian holdings \nbecause they had, it was felt, contributed little to Flemish economic development. \n 23 \nThis regionalisation process undermined the integrity of the Belgian political economy \nin which SG’s political-economic power was embedded and on which its social and \nsymbolic reproduction depended. This regionalisation of hearts and minds explains \nwhy the Belgian state found it hard to take effective Belgian anchoring action even \nthough Minister of Finance Eyskens and Minister for Economy Maystadt tried to \ndefend ‘vital Belgian interests’ against de Benedetti (Crols 1988b; Crols 1988c; \nFoster 2000; Lamy 1990). For there was no consensus within the government and \nBelgium’s political-economic elite on how to respond to the acquisition struggle.  \n  \nWhile the anchoring theme was not retained on the Belgian scale for lack of political-\ninstitutional and material supports, it still had strong discursive resonance in Flemish \ncircles. Thus it informed, albeit without great public fanfare, the industrial policy of the \nFlemish government (1988-1992); this was led for a fourth time by Geens, whom we \nencountered above as one of the contributors to the Belgian anchoring debate. \nFlemish anchoring gained a much higher public profile in the next Flemish \ngovernment, led by minister-president Van der Brande, from 1992, when it became \nofficial Flemish government policy. For it became the main economic imaginary \npromoted by various state agencies and public bodies (Oosterlynck 2006; Van den \nBrande et al. 1992). The central element in this imaginary was the ‘French threat’ as \nFrench companies were depicted as disproportionately present in ‘strategic sectors’ \nof the Belgian economy, such as utilities, banks, insurance companies and holdings \n(Brockmans 1995; Vlaamse Culturele Koepel and Vereniging Vlaamse Leerkrachten \n1995). Flemish anchorers also criticised the extended network of cross-participations \nthat included French investors active in Belgium as well as the French government’s \nsteering role in these networks. They even suggested that the French investors were \npart of a French geo-political strategy intended to bind the Belgian into the French \nspace economy in order to counter the growing influence of a re-unified Germany in \nconstructing Europe. ‘Christmas trees’ of interacting shareholderships were depicted \n(Oosterlynck 2005a) and autonomy indexes developed to highlight the perceived \nFrench threat (Vlaamse Culturele Koepel and Vereniging Vlaamse Leerkrachten \n1995). These indexes reveal Flemish anchorers’ mode of calculation. Flanders’ \nautonomy index was allegedly unbalanced because only 18.9% of companies \nlocated there are owned by Flemings, whereas Wallonia’s index is balanced because \n69.6% of the companies are in francophone ownership. Francophone here includes \n 24 \nWalloon, francophone Belgian and French. Thus Flemish anchorers assume some \nkind of ‘natural’ affinity between Wallonia, francophone Belgium (which also includes \nBrussels) and France. The use of this index and similar representations resonated \nwell with Flemish public opinion because the Flemish imaginaries treat all \nfrancophone Belgians as having the same values and interests. This is false \n(Oosterlynck 2005b; Quévit 1978). There have always been tensions between the \nWalloon movement, which focuses on economic issues and Walloon popular culture, \nand francophone Brussels, with its strong attachment to French high culture and the \ndefence of the pure French language (Kesteloot 2004). These tensions were \nreinforced by Walloon frustration with the withdrawal of francophone holding capital \nfrom its economy, especially after the strikes against the Unity Law in 1960\/1961.  \n  \nThe central position of the perceived French threat in the Flemish anchoring debate \nis one of two key dimensions of the Flemish economic imaginary, namely, the \nnarration of globalization in Flanders as French colonization. This imaginary proved \nquite powerful, although de Grauwe’s research on FDI between 1980 and 1990 \nshows that it was based on a selective reading of economic trends (De Grauwe \n1992). Although France had the biggest share of FDI in this period, namely 30%, the \nFDI stream was concentrated in 1988 and 1989, i.e. the years in which Suez bought \nthe Société Générale. Outside these two years, French FDI was in third place behind \nGermany (26.4%) and the Netherlands (21.2%). Daems similarly notes that the \nFrench were responsible for 59 of the 222 take-overs in 1985-90 compared to 57 \nmade by the Dutch (Daems and Van de Weyer 1993). In addition to its exaggerated \nfear of the French, the Flemish globalization imaginary is based on the idea of \nmutually exclusive spaces. This second dimension is rooted, like the first, in the \ndemand for linguistic territorial integrity and historic fear of French dominance. The \nspatially segregated unilingualism and the federal solution to manage a distinctive \n‘communautarian’ politics that are the legacy of the historical struggle of the Flemish \nmovement made the Flemish public opinion and elites more receptive to such \nimaginaries. Discourses based on the idea that two actors cannot occupy the same \nplace were transmitted from the cultural and political to the economic domain so that \nthe French economic presence was narrated as foreign ‘penetration’ that would \nundermine Flemish control over its economy.  \n \n 25 \nFlemish anchorers unsurprisingly rejected the arguments of Daems and De Grauwe \nand replied that it was not the relative share of foreign ownership that mattered but its \nconcentration in ‘strategic’ economic sectors (Oosterlynck 2004b). Strategic \nimportance was variously defined in terms of employment, technological and \ninnovative content, export volume, importance for social capital (e.g. media), \nimportance for underlying competitiveness and strategic needs of Flemish economy, \nand being part of Flemish industrial heritage (Crols 1995; Oosterlynck 2004a; \nVlaamse Culturele Koepel and Vereniging Vlaamse Leerkrachten 1995). Thus \nstrategic importance is a vague idea that can be applied to large parts of the Flemish \neconomy. This is especially clear in the discursive use of the term in the Flemish \ngeo-economic strategy developed by Van den Brande. As minister-president of the \nnew Flemish government, he was looking for ways to link Flemish state formation to \nFlemish nation formation (Blommaert 2000). With cultural and political autonomy \nalready largely acquired, like many Flemish nationalists, he felt that Flanders also \nneeded economic emancipation. His government’s anchoring strategy aimed to \ntransform Flanders from a nation of SMEs without home-grown multinationals into a \n‘real’ economic nation. The government believed that a Flemish majority or \ncontrolling ownership was needed to anchor a company (Vlaamse Culturele Koepel \nand Vereniging Vlaamse Leerkrachten 1995). This approach has been challenged by \nan alternative strategy based, not on ownership, but on strategic decision-making \npower. The Flemish economist, Daems, defines this as the ability to determine \ncompany strategy (product developments, production technologies and export \nmarkets) at local level (Daems 1998; Daems and Van de Weyer 1993). This would \nbe possible because, if companies were to apply corporate governance standards \n(thereby ending traditional holding structures that enable small minorities to control \nlarge blocks of shares), the separation between shareholders and managers would \ngive Flemish management enough autonomy to take strategic decisions.  \n \nThe preceding paragraph illustrates the existence of two approaches to Flemish \nanchoring, based on national ‘ownership’ and corporate governance respectively. \nThese concerns are rooted in different approaches to economic nationalism, i.e., to \nthe role of the national as an intermediate scale of interest between the individual \nand humanity (Helleiner 2002). The nationalist ontology asks how a given nation can \nattain power and prosperity, which implies that the people who comprise a nation \n 26 \nsomehow share a common economic fate and have an economic responsibility \ntowards their fellow citizens (Reich 1991). The ownership variant of anchoring \nstrategies is clearly informed by the traditional economic nationalist imaginary in \nwhich, in Reich’s words, ‘the well-being of citizens was linked to the success of the \nnational economy, which depended in turn on the success of its giant corporations’ \n(1991: 34). The corporate governance variant is, for Reich again, more attuned to a \nnew conception of economic nationalism as transformed by globalization. What \nmatters for the nation’s future wealth is not a company’s nationality but the skills of \nthe local workforce and managers. Thus this variant stresses the importance of local \nmanagement experience. To ensure that they can manage without shareholder \ninterference, they need good working capital markets, institutional investors and \ncorporate governance. The nationality of the company is of minor importance in this \nmodel, which is close to the Anglo-Saxon neo-liberal variety of capitalism.  \n \nThe institutionalization of the Flemish space economy \n \nSince its 1830 inception, the Belgian state had to deal with a protracted language \nconflict and uneven geographical development. The handling of these problems by \nvarious social and political actors has produced two regions – Flanders and Wallonia \n– and locked them into different socio-economic trajectories. This is reflected in the \nrescaling of Belgium’s economic, political, and socio-cultural space. Steadily \nincreasing geo-political rescaling over 150 years of Belgian history, e.g., through \npolitical and cultural struggles for regional autonomy and state restructuring, has \nfinally produced the decentralization of Belgian political space. The anchoring debate \nlikewise aims to transform Belgian economic space and is occurring just as geo-\neconomic rescaling is gathering pace through mechanisms such as European and \nworld market integration, the rise of multinational network firms, and the resurgence \nof regional economies. This has created the space for pursuing anchoring strategies.  \n \nFlemish nationalists have long considered the Flemish economy to be burdened by \nthe overall Belgian space economy (Brockmans 1995). Based on holding capital, first \nindustrial revolution firms, and other traditional sectors, the national economy is \nassociated with the declining industrial spaces in Wallonia. Flemish nationalists \ncriticized the close links between the Belgian political elite and the francophone \n 27 \nholding bourgeoisie, mainly organized around the Société Générale. These close \nlinks were partly based on the relations forged through the Belgian holdings’ strong \npresence in government procurement and infrastructure markets. Following the \neconomic crisis of the 1970s, Flemish nationalists argued that this holding structure \nwas blocking a thorough restructuring of outmoded or crisis-prone affiliated sectors \nand companies in the Belgian space economy. They also complained that these \ndelays in restructuring were reinforced by the state support that the holding \nbourgeoisie, the Walloon socialist party and the Walloon trade unions could secure \nfor loss-making companies through their privileged access to the Belgian \ngovernment. Such subventions were said to divert money from future-directed \neconomic investments, particularly for Flanders. Thus the foreign raid on the SG was \napplauded by Flemish nationalists because it would destroy the economic base of \nthe Belgian francophone bourgeoisie and cause the disintegration of the Belgian \nspace economy. It would also force SG to restructure and release its control over \nmany (also Flemish) companies, which could then regain their dynamism.  \n \nHowever, the Flemish nationalists also worried that the French acquisitions of SG \nand several big former state companies in the infrastructure and financial sector \n(e.g., Distrigas, Belgacom and ASLK) would actually increase francophone control \nover the strategic sectors of the Flemish economy. This shows that, despite the \nFlemish nationalist critique of the lack of dynamism and entrepreneurialism of the \nBelgian holdings, their economic imaginaries share the same traditional economic \nnationalist identification of national companies with national power. The fact that the \nFrench companies were especially targeting Belgian holdings closely related to the \ngovernment (infrastructure and public procurement) meant that the acquired \ncompanies such as Electrabel, Tractebel and Distrigas could not be used as vehicles \nfor Flemish geo-economic and geo-political purposes and\/or as the basis for an \nautonomous Flemish bourgeoisie and the advancement of Flemish economic nation-\nbuilding. This argument is based on the national ownership version of the anchoring \nstrategy. The corporate governance version also questioned the activities of Suez on \nthe grounds that it is a holding company rather than because it is French – and this \ndeviation from the best corporate governance standards mattered more than the \nnationality and political ties of the companies concerned.  \n \n 28 \nDespite the discursive resonance (and hence retention) of the Flemish anchoring \ntheme among a significant part of the Flemish political, intellectual and economic \nelites and its inclusion in the Flemish state project in the first half of the 1990s, the \nFlemish anchoring discourse has not been consolidated in institutional terms. \nEconomically, the strategy has failed to mobilize the social forces needed to realize a \nstructural transformation of the socio-economic relations of the economy in Flanders. \nFlemish capital is too small and insufficiently institutionalized to mobilize the financial \nresources to anchor the privatized state companies or holdings such as Société \nGénérale. The Flemish merchant bank Lessius was a case in point. It was \nestablished in 1988 to create the financial structures for Flanders to intervene in \nimportant economic events such as the acquisition struggle around SG. Trends’ chief \neditor, Crols, regarded Lessius as a triumphant part of the emerging ‘Generale \nMaatschappij van Vlaanderen’ (‘SG of Flanders’) and said that it signalled the \nprofessionalisation of the Flemish business world (Crols 1988d). Lessius never lived \nup to these expectations. Despite its strong embedding in Flemish economic \nnetworks such as the Vlerick network, it failed to gain the size required to play its \nintended strategic role and was dissolved in 2005 (Desmet 2005). Apart from the lack \nof institutionalisation of Flemish capital, much of its economic basis lies in the service \nand non-monopolized industrial sectors that depend on the presence of foreign \nmultinational companies in Flanders. Many Flemish economic decision-makers are \nthus more interested in maintaining the conditions for the reproduction of foreign \nmonopoly capital in Flanders than in developing an economic basis for the Flemish \nnation (Roosens 1981). Nor has introducing corporate governance into Flanders \nincreased Flemish strategic decision-making power. Recent economic events (see, \nfor example, Suez’s acquisition of Electrabel) show that majority shareholders call \nthe shots, however competent the local managers. More generally, one could argue \nthat economic imaginaries based on a strong sense of boundedness are likely to fail \nas economic spaces are increasingly linked by cross-border networks.  \n \nDespite the apparent failure of the Flemish anchoring strategy to fundamentally \nreconstitute Flemish economic space, it clearly belongs to a long-term and ongoing \nhistorical attempt to rescale economic relations and institutionalize an autonomous \nFlemish space for strategizing, interest formation and governance in Belgium. This is \ncontributing to the further disintegration of Belgian political space as Flemings try to \n 29 \nremove the burden of the financial transfers from Flanders to Wallonia caused by its \neconomic crisis and the strength of the Walloon socialist party and trade union. Thus \nthe Flemish economic region-building agenda essentially aims to create a more \nfavourable site of accumulation by eliminating an uncompetitive one. The \ninstitutionalization of the Flemish space economy therefore generates a new spatial \nand institutional fix, deferring the crisis-tendencies of global capitalism (literally) \nbeyond its own boundaries, i.e. into Wallonia. This allows Flanders, at least for now, \nto better address the competitive pressures of the global market by allowing it to \ninsert the Flemish space economy more favourably than the Belgian space economy \ninto the global strategies of capital. The creation of Flemish ‘institutional thickness’ \n(Martin 2000) involves more than creating business assets and competitive \ninstitutional arrangements, as soft economic sociologists would have it, and extends \nto shifting the geographies of capitalist political economy. \n \nConclusions \n \nGrossberg, a leading figure in cultural studies, argued that political economy cannot \nbe relied on to develop the potential of the cultural turn, even when it takes the latter \nseriously, which is rare enough. For it ‘always assumes a universal privilege (and a \ndecontextualized singularity) of the economy over politics and culture’ (2006: 19). \nInstead he recommends that the initiative be taken by scholars within cultural studies. \nSpecifically, it should \n• engage with economics as discipline and not just with a preferred theorist \nor theorists;  \n• address the concrete complexities of economic life, relations and \ndiscourses and not just treat theory as an adequate description of economic \ncontexts;  \n• get involved in collaborative work across disciplines rather than retreat into \nits own disciplinary boundaries; and  \n• not unreflectively privilege forms of academic knowledge and knowledge \nproduction (2006: 20-21).  \nWe would respond that political economy should follow the same recommendations. \nThus scholars of political economy should  \n 30 \n• engage with cultural studies as a whole and not just with one preferred \ntheorist or school,  \n• address the complexities of semiosis and explore the discursive and \nmaterial mechanisms that shape the manner and extent to which ‘ideas \nmatter’ in political economy rather than merely asserting that they do and\/or \nillustrating this with simple narrative accounts,  \n• commit themselves to trans-disciplinary interaction or, better, sui generis \npost-disciplinary research rather than mechanically additive ‘multi-\ndisciplinary’ team work (on different forms of disciplinarity, see Jessop and \nSum 2001), and \n• not unreflectively privilege forms of academic knowledge and knowledge \nproduction but examine in particular common sense economic imaginaries \nand actually existing struggles over their selection and retention. \n \nThe approach to CPE sketched above is one way to respond to these challenges. \nIndeed, it would seem to correspond almost perfectly to the research agenda set for \ncultural studies by Grossberg in his provocative call to theoretical arms: \n \nDoing a different kind of – conjunctural – economics involves recognizing \nthat the economy is not only overdetermined but also multiple, relational \nand discursive. For example, if we are to demystify both economies and \neconomics, we probably need to recognize at least four distinct \nproblematics: (1) economism, or the assumption that the economy (whether \nwe understand as a mode of production, class conflicts, entrepreneurialism, \ntechnology, finance or markets) is the motor force of history, has to be \ncriticized with the concept of overdetermination; (2) capitalocentrism -- or \nthe assumption that capitalism in a singular and singularly ubiquitous \nformation, has to be replaced with a recognition of the multiplicity, not only \nof capitalisms but also of economic practices and formations (Gibson-\nGraham 1996); (3) productivism or the assumption that production is the \nessence of economies and therefore, the fundamental; or even the only real \nsource of value, has to be replaced by a recognition of the dispersion and \ncontingency of value; and finally (4) economic essentialism or the \nassumption that there is a stable and universal distinction between \n 31 \neconomic and non-economic practices or relations, has to be replaced by a \nrecognition, not merely that economic relations are themselves partly \ndiscursive, but also that the economic is always a relationally produced \ncategory (Grossberg 2006: 21). \n \nWe have argued for the cultural turn in economic and political geography (as part of a \nbroader commitment, in our case at least, to a spatio-temporally sensitive political \neconomy) on the grounds that this enables an escape from ‘hard political economy’, \ni.e., the naturalization and fetishization of economic categories without regard to their \ndiscursively mediated, socially constructed character. But we have also argued that \nthe cultural turn should be combined with critical political economy, which we see as \na broad movement rather than one linked exclusively to just one theorist, school, or \ntradition. This is one way to resist the temptation of ‘soft’ economic or political \ngeographies characteristic of the new economic sociology and its importation into \nthese fields (for a critique, see Peck 2005). We use the term ‘soft’ here to describe \nthe subsumption of economic or political categories under general sociological (or \ncultural) analysis so that the analysis loses sight of the historical specificity and \nmateriality of economics and the dynamics of state power. In developing CPE we \nhave called for serious analysis of variation, selection, and retention in terms of \nsemiotic and extra-semiotic mechanisms. This enables us to distinguish cultural \npolitical economy from critical discourse analysis in terms of its ‘value-added’. For, \nwhereas critical discourse analysis tends to focus on specific texts, to undertake \nstatic comparative analyses of selected texts at different times, or to study linguistic \ncorpora over time, CPE is also interested in the variation, selection, and retention of \ndifferent discourses and, in this regard, is also concerned with their extra-semiotic as \nwell as semiotic features. Our case study of Belgium illustrates how these \nmechanisms operate to select, retain, and reinforce specific imaginaries and thereby \nshape the concrete, contextualized, and contingent dynamics of a particular economy \nin its specific social and cultural settings as this changes over time. It also shows \nthat, however resonant and persuasive an economic imaginary and its corresponding \nstrategies might be, this is not sufficient to ensure that they can be realized when \npath-dependent (material as well as semiotic) legacies and the conjunctures \n(including the capacities and strategies of social forces mobilized behind competing \nimaginaries) render then more or less ‘arbitrary, rationalistic, and willed’. \n 32 \n \nReferences \n \nAgnew, John, 2000. From the political economy of regions to regional political \neconomy. Progress in Human Geography 24, 101-110. \nBarnett, Clive, 2004. A Critique of the cultural turn. In: Duncan, S., Nuala N.C., \nJohnson, C., and Schein, R.H. (Eds.), A Companion to Cultural Geography. \nBlackwell, Oxford, pp. 38-48. \nBayart, Jean-François, 1994. L’invention paradoxale de la mode économique. In: \nBayart, Jean-François, La réinvention du capitalisme. Éditions Karthala, Paris, \npp. 9-43. \nBlommaert, Jan, 2000. 'Ik stel vast'. Politiek taalgebruik in het tijdperk van \nvernieuwing.  EPO, Berchem.   \nBrenner, Neil, 1999. Beyond state-centrism? Space, territoriality and geographical \nscale in globalisation studies.Theory and Society 28, 39-78. \nBrenner, Neil, 2004. Urban governance and the production of new state spaces in \nwestern Europe, 1960-2000. Review of International Political Economy 11, \n447-488. \nBrockmans, Hans, 1995, 200 jaar filiaal. De Franse greep op de Vlaamse economie. \nDavidsfonds, Leuven. \nCampbell, Donald T., 1969. Variation and selective retention in socio-cultural \nevolution. General Systems 14, 69-86. \nCottenier, Joe, De Boosere, Patrick, and Gounet, Thomas, 1989. De Generale: 1822-\n1992. EPO, Berchem. \nCrang, Mike, 1997. Cultural Geography. Routledge, London. \nCrols, Frans, 1988a. De zichtbare hand. Trends, 9. 21 April. \nCrols, Frans, 1988b. Het non-event. Trends,  11. 21 January. \nCrols, Frans, 1988c. Houd de dief. Trends, 19. 28 January. \nCrols, Frans, 1988d. Leysen & Leysen. Trends, 11. 28 January. \nCrols, Frans, 1995. De ideologie van de verankering. In Brockman, Hans (Ed.) 200 \njaar filiaal. De Franse Greep op de Vlaamse Economie. Davidsfond, Leuven. \nDaems, Herman, 1998. De paradox van het Belgische kapitalisme. Waarom \nbedrijven financieel goed scoren en toch strategisch slecht spelen. \nLannoo,Tielt.  \n 33 \nDaems, Herman, de Weyer, Peter Van, 1993. Buitenlandse invloed in België - de \ngevolgen voor de strategische beslissingsmacht. Lannoo,Tielt.  \nDaly, Glyn, 1991. The discursive construction of economic space. Economy and \nSociety 20 (1), 79-102. \nDebray, Regis, 1973. Time and politics. In Debray, Regis, Prison Writings. Allen \nLane, London, pp. 87-160. \nDe Grauwe, Paul, 1992. Over Franse kolonisatie en Belgische verankering. \nLeuvense Economische Standpunten 16. \nDesmet, Lieven, 2005. De lessen van Lessius. Trends, 48-50. 1 December. \nEyskens, Gaston, 1988. Het laatste gesprek. Herinneringen aan 40 jaar politiek \nleven. DNB\/Uitgeverij Pelckmans, Brussel. \nFairclough, Norman, 2003. Analysing Discourse. Textual Analysis for Social \nResearch. Routledge, London. \nFairclough, Norman, Jessop, Bob, Sayer, Andrew, 2004. Critical realism and \nsemiosis. In Fleetwood, Steven and Roberts, John M. (Eds.), Realism, \nDiscourse and Deconstruction. Routledge, London, pp. 23-42. \nFoster, John Bellamy, 2000. Marx's Ecology. Materialism and nature. Monthly \nReview Press, New York. \nGeens, Koen, Hellemans, Frans, Haelterman, Axel, and Bevernage, Piet, 1995. \nJuridische instrumenten tot verankering van Belgische ondernemingen. Nieuw \nTijdschrift voor Politiek, 4-46. \nGibson-Graham, Katherine-Julie, 1996. The End of Capitalism (as we know it): a \nFeminist Critique of Political Economy. Blackwell, Oxford. \nGrabher, Gernot, 1994. Lob der Verschwendung. Sigma, Berlin.  \nGramsci, Antonio, 1971. Selections from the Prison Notebooks. Lawrence & Wishart, \nLondon. \nGrossberg, Lawrence, 2006. Does cultural studies have futures? Should it? (Or \nwhat’s the matter with New York?) Cultural Studies 20 (1), 1-32. \nHarvey, David, 1982. The Limits of Capital. Blackwell, Oxford. \nHelleiner, Eric, 2002. Economic nationalism as a challenge to economic liberalism? \nLessons from the 19th century? International Studies Quarterly, 46 (3), 307-\n329. \nHudson, Ray, 2004. Conceptualizing economies and their geographies: spaces, \nflows and circuits. Progress in Human Geography 28 (4), 447-471. \n 34 \nHuyse, Luc, 1980. De gewapende vrede. Politiek in België tussen 1945 en 1980. \nKritak, Leuven. \nJessop, Bob, 1990. State Theory: Putting the Capitalist State in its Place. Polity, \nCambridge. \nJessop, Bob, 1997. A neo-Gramscian approach to the regulation of urban regimes. In \nLauria, Mickey (Ed.), Reconstructing Urban Regime Theory. Sage, London, pp. \n51-73. \nJessop, Bob, 2002. The Future of the Capitalist State. Cambridge: Polity. \nJessop, Bob, 2004. Critical semiotic analysis and cultural political economy. Critical \nDiscourse Studies 1 (2), 159-174. \nJessop, Bob and Sum, Ngai-Ling, 2001. Pre-disciplinary and post-disciplinary \nperspectives in political economy. New Political Economy 6 (1), 89-101. \nJessop, Bob and Sum, Ngai-Ling, 2006. Beyond the Regulation Approach: Putting \nCapitalist Economies in their Place. Cheltenham: Edward Elgar. \nJones, Martin, 2004. Social justice and the region: grassroots regional movements \nand 'the English Question'. Space and Polity 8, 157-189. \nKesteloot, Chantal, 2004. Au nom de la Wallonie et de Bruxelles français. Les \norigines du FDF. Editions Complexe, Bruxelles. \nLaclau, Ernesto and Mouffe, Chantal, 1986. Hegemony and Socialist Strategy. \nVerso, London. \nLamy, René, 1990. Het ware verhaal van een openbaar overnamebod. De strijd om \nde Generale Maatschappij. Tielt: Lannoo. \nLovering, John, 2001. The coming regional crisis (and how to avoid it). Regional \nStudies 35, 349-354. \nMandel, Ernest, 1963. The dialectic of class and region in Belgium. New Left Review \n20, 5-31. \nMartin, Ron, 2000. Institutional approaches in economic geography. In Sheppard, \nEric and Barnes, Trevor J. (Eds.) Companion to Economic Geography. \nBlackwell, Oxford, pp. 77-94 \nMarx, Karl, 1996. The Eighteenth Brumaire of Louis Bonaparte. In Carver, Terrell \n(Ed.), Karl Marx: Later Political Writings. Cambridge University Press, \nCambridge, pp. 31-127. \nMiller, Peter and Rose, Nik, 1993. Governing economic life. Economy and Society 19 \n(1): 1-31. \n 35 \nMitchell, Don, 2000. Cultural Geography: A Critical Introduction, Blackwell,. Oxford. \nMurphy, Alexander B., 1988. The regional dynamics of language differentiation in \nBelgium. A study in cultural-political geography. University of Chicago Press, \nChicago. \nNonhoff, Martin, 2006. Politischer Diskurs und Hegemonie. Das Projekt ”soziale \nMarktwirtschaft”. Transcript, Bielefeld. \nOffe, Claus, 1984. Contradictions of the Welfare State. Hutchinson, London. \nOosterlynck, Stijn, 2004a. Interview with Frans Crols. 23 December. \nOosterlynck, Stijn, 2004b. Interview with Hans Brockmans. 23 December. \nOosterlynck, Stijn, 2005a. Interview with Luc Van den Brande. 22 February. \nOosterlynck, Stijn, 2005b. Interview with Michel Quévit. 21 September. \nOosterlynck, Stijn,  2006. The political economy of new regionalism in Belgium: \nimagining and institutionalising the Flemish regional economy. Lancaster \nUniversity, Doctoral Thesis. \nPaasi, Anssi, 1991. Deconstructing regions: notes on the scales of spatial life. \nEnvironment and Planning A 23 (2), 239-56.  \nPaasi, Anssi, 2002. Place and region: regional worlds and words. Progress in Human \nGeography 26:802-811. \nPeck, Jamie, 2005. Economic sociologies in space. Economic Geography 81 (2), \n129-176. \nPolanyi, Karl, 1982. The economy as instituted process. In: Granovetter, Mark and \nSwedberg, Richard (Eds.). The Sociology of Economic Life. Westview, Boulder, \npp. 29-51. \nQuévit, Michel and Aiken, Michaël, 1978. Les causes du déclin wallon: l'influence du \npouvoir politique et des groupes financiers sur le développement régional. Vie \nouvrière, Bruxelles. \nReich, Robert B, 1991. The Work of Nations. Preparing Ourselves for 21st \nCapitalism. Simon & Schuster, New York. \nReynebeau, Marc, 1995. Het klauwen van de leeuw. De Vlaamse identiteit van de \n12de tot de 21ste eeuw. Uitgeverij Van Halewyck, Leuven. \nRoosens, Anton, 1981. Een nieuwe topklasse in Vlaanderen. De Nieuwe Maand 24 \n(2), 98-108. \nSayer, Andrew, 2001. For a critical cultural political economy. Antipode 33 (4), 637-\n708. \n 36 \nSomers, Margaret, 1994. The narrative constitution of identity: a relational and \nnetwork approach. Theory and Society 23 (4), 605-649. \nSum, Ngai-Ling, 1995. More than a ‘War of Words’: Identity politics and the struggle \nfor dominance during the recent political reform period in Hong Kong. \nEconomy and Society 24 (1), 68-99. \nSum, Ngai-Ling, 1996. The NICs and competing strategies of East Asian regionalism. \nIn Gamble, Andrew and Payne, Anthony (Eds.), Regionalism and World \nOrder. Macmillan, Basingstoke, pp. 207-46. \nSum, Ngai-Ling, 2000. Globalization and its \"Other(s)”: Three new kinds of \nOrientalism and the Political Economy of Trans-border Identities. In Hay, Colin \nand Marsh, David (Eds.), Demystifying Globalization. Palgrave: Basingstoke, \npp.105-126. \nSum, Ngai-Ling, 2004. From Integral State to Integral World Economic Order: \nTowards a Neo-Gramscian Cultural Political Economy, Working Paper No. 7 of \nthe Cultural Political Economy Research Cluster, Institute for Advanced \nStudies, Lancaster University, http:\/\/www.lancs.ac.uk\/ias\/polecon\/index.htm \nSum, Ngai-Ling, 2005. 'From Regulation Approach to Cultural Political Economy', \nWorkpackage 1, Discussion Paper on the EU Framework 6 DEMOLOGOS \nproject, http:\/\/demologos.ncl.ac.uk\/wp\/wp1\/disc.php \nSwyngedouw, Erik, 1997. Neither global nor local: \"glocalization\" and the politics of \nscale. In Cox, Kevin R. (Ed.) Spaces of Globalisation. Guilford Press, New \nYork, pp. 137-166.  \nThrift, Nigel, 2004. Knowing Capitalism. Sage, London. \nVan den Brande, Luc, De Batselier, Norbert, Kelchtermans, Theo, Weckx, Hugo, Van \nden Bossche, Luc, Sauwens, Johan, Detiège, Leona, and Demeester-De \nMeyer, Wivina, 1992. Vlaanderen-Europa 2002. \nVan Istendael, Geert (Ed.) 1993. Het nut van België. Atlas, Antwerp. \nvan Waterschoot, Jerry, 1988. Speeltijd is voorbij. Financieel-Economische Tijd. 25 \nFebruary. \nVandermotten, Christian, Piet Saey, and Christian Kesteloot, 1990. België in stukken: \nbestaan Vlaanderen en Wallonië echt? In Subite, Mort (Ed.) Barsten in België: \neen geografie van de Belgische maatschappij. EPO, Berchem. \nVlaamse Culturele Koepel, and Vereniging Vlaamse Leerkrachten, 1995. \nVerankering voor beginners. Herman Gevaert, Brugge. \n 37 \nWickham, Gary, 1987. Power and power analysis: beyond Foucault? Economy and \nSociety 12 (4), 468-498. \nWitte, Eis, Craeybeckx, Jan, and Meynen, Alain, 1997. Politieke geschiedenis van \nBelgie van 1830 tot heden. VUB Press, Brussel. \n \n 38 \n \n                                                 \nEndnotes \n \n1\n This paper has benefited from our participation in the ‘Cultural Political Economy’ workshop \norganized by Ngai-Ling Sum and funded by Lancaster University’s Institute for Advanced Studies \n(2004-2006), in the long-established ‘Language, Ideology, and Power’ group at Lancaster, and from \nmore general discussions with Norman Fairclough, Andrew Sayer, and Ngai-Ling Sum over many \nyears.  \n2\n On spatio-temporal fixes, see Jessop (2002). \n3\n The Lancaster CPE approach was prefigured in Jessop’s neo-Gramscian approach to the state \nand neo-Gramscian version of the regulation approach; and in Sum’s work on the discursive and \nmaterial dimensions of the 1997 transfer or Hong Kong to mainland China (Sum 1995) and East \nAsian economic strategies (Sum 1996, 2000). For a preliminary statement, see Jessop and Sum \n(2001). \n4\n For example, Nonhoff (2006) develops an interesting analysis of the hegemony of the social \nmarket economy in Germany and its re-invention in neo-liberal guise. Our approach nonetheless \ndiffers strongly from the sort of post-Marxist discourse analysis advocated by Laclau and Mouffe \n(1986), which one-sidedly valorizes discourse without regard to extra-discursive mechanisms of \nselection and retention. For an interesting illustration of the lack of recognition of the CPE approach \nin any of its manifestations, see the general critique of the cultural turn in political economy by a \nleading figure in cultural studies, Lawrence Grossberg, in which he argues that cultural studies \ncannot take ‘the path of political economy, even when it tries to take the cultural turn seriously, \nwhich is rare enough. In the end, it sees culture as a medium into which the economy is translated \nand through which it moves, but which has no real effects of its own’ (2006: 19). We claim that CPE \ncan meet this challenge (see below). \n5\n Polanyi (1982) distinguished substantive economic activities involved in material 'provisioning' \nfrom formal (profit-oriented, market-mediated) economic activities. The leading economic \nimaginaries in capitalist societies ignore the full range of substantive economic activities in favour of \na focus on formal economic activities. \n6\n Indeed, there is no economic imaginary without materiality (Bayart 1994: 20-1). \n7\n Although all practices are semiotic and material, the relative causal efficacy of these elements will \nvary. \n8\n Horizontal refers here to sites on a similar scale (e.g., personal, organizational, institutional, \nfunctional systems) and vertical refers to different scales (e.g., micro-macro, local-regional-national-\nsupranational-global). The use of both terms must be relative and relational. \n9\n A web of interlocution comprises metanarratives that reveal linkages between a wide range of \ninteractions, organizations, and institutions and\/or help to make sense of whole epochs (Somers \n1994: 614). \n10\n On discursive selectivity, see Hay 1996 and Somers 1994; on structural selectivity, see Jessop \n1990. \n 39 \n                                                                                                                                                     \n11\n Space economy is a historically specific spatialization of economic relations. \n12\n The relativization of scale involves a crisis of the primacy of the national scale and associated \ncomplex process of the rescaling of political and economic relations (Brenner 1999; Brenner 2004; \nJessop 2002; Swyngedouw 1997). \n13\n The headquarters of SG were located in Koningsstraat. \n"}