{"doi":"10.1002\/sia.1759","coreId":"102212","oai":"oai:epubs.surrey.ac.uk:1663","identifiers":["oai:epubs.surrey.ac.uk:1663","10.1002\/sia.1759"],"title":"Organic-inorganic hybrid nanoparticles: adsorption characteristics of polyester resins","authors":["Jesson, DA","Abel, ML","Arkhireeva, A","Hay, JN","Smith, PA","Watts, JF"],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2004-08-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1663<\/identifier><datestamp>\n      2017-10-31T14:02:41Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D6563686D65646165726F656E67696E656572696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1663\/<\/dc:relation><dc:title>\n        Organic-inorganic hybrid nanoparticles: adsorption characteristics of polyester resins<\/dc:title><dc:creator>\n        Jesson, DA<\/dc:creator><dc:creator>\n        Abel, ML<\/dc:creator><dc:creator>\n        Arkhireeva, A<\/dc:creator><dc:creator>\n        Hay, JN<\/dc:creator><dc:creator>\n        Smith, PA<\/dc:creator><dc:creator>\n        Watts, JF<\/dc:creator><dc:date>\n        2004-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1663\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Jesson, DA, Abel, ML, Arkhireeva, A, Hay, JN, Smith, PA and Watts, JF  (2004) Organic-inorganic hybrid nanoparticles: adsorption characteristics of polyester resins   SURFACE AND INTERFACE ANALYSIS, 36 (8).  pp. 765-768.      <\/dc:identifier><dc:relation>\n        10.1002\/sia.1759<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1663\/","10.1002\/sia.1759"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"  \nDavid Jesson, School of Engineering (H6), University of Surrey, \nGuildford, Surrey, UK, GU2 7XH  \nTel: 00 44 1483 689627   Fax: 00 44 1483 686291   e-mail: d.jesson@surrey.ac.uk \n \nORGANIC-INORGANIC HYBRID NANOPARTICLES: ADSORPTION \nCHARACTERISTICS OF POLYESTER RESINS \n \nD.A. Jesson1*, M.-L. Abel1, A. Arkhireeva2, J.N. Hay2, P.A. Smith1 and \nJ.F.Watts1 \n \n1The Surface Analysis Laboratory, School of Engineering,  \nUniversity of Surrey, Guildford, Surrey, GU2 7XH \n2Chemistry Division, SBMS, University of Surrey, Guildford, Surrey, GU2 7XH \n \nABSTRACT \nThe adsorption of polyester onto organically modified silicas (ormosils) and \n(commercial) fumed silica has been compared utilising ToF-SIMS.  The \nthermodynamics of each system was examined by constructing adsorption isotherm \nplots which indicated that the adsorption of polyester onto one of the modified \nsilicas used may be a two stage process.  Adsorption onto the fumed silica is in \naccord with the Langmuir model. \n  \n \nKEYWORDS \nToF-SIMS, silica, polyester, composites, adsorption \n \nINTRODUCTION \nIn recent years, organic-inorganic hybrids have been developed as potential \nsolutions to a wide array of problems including sensors1 and dye lasers2.  \nORganically MOdified SILicaS (ormosils) are one type of organic-inorganic \nhybrid1.  Work is currently underway to determine the efficacy of a range of \normosils (in nano-particulate form) as modifiers for polymers and polymer matrix \ncomposites.  To understand the effect that the ormosils have on the matrix system it \nis important to appreciate the interaction between the ormosils and the matrix.  This \nstudy presents an examination of the behaviour of two types of ormosil (ethyl and \nphenyl modified silicas), and a commercial fumed silica (of similar size to the \nnano-particulate ormosils).  The aim of the study is to derive adsorption isotherms \nfrom ToF-SIMS data.  Adsorption isotherms have been established as a reliable \nmethod for determining certain aspects of the chemistry between a substrate and an \nadsorbate, such as the strength of their interaction3-6. \n \n \n \n  \n \nEXPERIMENTAL \n \nMaterials \nEthyl (~60-70 nm diameter) and phenyl (~100-160 nm) modified silica \nnanoparticles were produced using a modified Stöber (hydrolytic) route7.  HDK \nN20 (Wacker) is a commercial fumed silica used as a thixotropic agent in the \nproduction of a commercial polyester resin which is a matrix system under \ninvestigation.  Samples of this resin, Crystic 2-406PA (Scott-Bader) were supplied \nwithout the fumed silica addition and this resin was used as the adsorbate.  Figure 1 \nshows an example of the structure of the polyester resin, although this is included \nfor illustrative purposes and cannot be assumed as to be completely characteristic.  \nThe model is based on statistical probability rather than a rigorous chemical \nanalysis.  Toluene (Fisher, T\/2250\/17, SpeciFied) was used to produce solutions of \nthe resin, ranging between 0.1 and 10vol%, and to rinse off specimens at the end of \nthe reaction time, thereby removing any poorly interacting or physically adsorbed \nmolecules.  Toluene was used following the technique of Fowkes8 whereby a \nsolvent is found that is neutral with reference to both the adsorbent and the \nadsorbate.  Another chemically suitable solvent would be for example CCl4, \nalthough this solvent poses difficulties from a Health and Safety standpoint. \n \n  \nThermodynamic Studies \n \nSolutions of polyester in toluene were prepared in concentrations of 0.1, 0.5, 1, 2.5, \n5, 7.5 10 vol%.  Samples of each of the three types of silicas massing 0.1±0.005g \nwere dispersed in solution for 30 minutes in an ultra-sonic bath, and were filtered \nusing a Büchner filter funnel.  The sample was filtered using excess toluene. \n \nAnalysis by ToF-SIMS \n \nToF-SIMS spectra over a range of 0-400 Da were produced using a VG Scientific \ntype 23 system, utilising a Poschenrieder time-of-flight analyser with a liquid metal \nion source.  Static SIMS conditions were used (i.e. ion dose < 1 x1013 ions cm-2) \nwith a pulsed primary ion beam (50 ns at 5 kHz) of 69Ga+ at 16 kV. \n \nRESULTS AND DISCUSSION \n \nAdsorption of the polyester onto ethyl modified and phenyl modified silicas as well \nas a commercial fumed silica was studied.  Figure 2a-c below compares the \npositive ion spectra of untreated samples of the three silicas.  The spectra have been \nplotted using the relative peak intensity (RPI), which is calculated by \n  \ntot\np\nI\nI\nRPI =  \nwhere Ip is the intensity of the peak of interest and Itot is the sum of the intensities \nof all the counts in the 5-200 Da region of the spectrum.  It will be noted that, as \nmight be expected, the spectrum of the commercial silica is comparatively very \nclean, with only 2 significant peaks at 28 (Si+) and 45 (SiOH+) and with little in the \nway of CxHy fragment ions.  The intensity of the 28 peak is much higher than in \neither of the two ormosils or in the case of the commercial silica upon which \npolyester has been adsorbed.  The significant peak in the ethyl modified silica is the \n29 peak (C2H5+) which in figure 1b is almost as dominant as the 28 peak.  By \ncontrast, the 77 peak (C6H5+) is comparatively small in figure 1c, of the phenyl \nmodified silica spectrum, (this is probably due to the difficulties associated with \nionising larger fragments) but the disintegration of the phenyl component into \nsmaller ring structures such as 39 (C3H3+) and 51 (C4H3+) also contributes to the \nspectrum.  Significant peaks were isolated in the spectra from the adsorption \nexperiments, and these were used to produce adsorption isotherms.  Figures 3a-c \nshow the polyester resin adsorption isotherm (trend lines have been added, \nalthough these have no mathematical significance and are simply a guide to the \neye) associated with the 82 peak (from an as yet uncharacterised hydrocarbon \nfragment from the polyester), on all three silicas examined.  Although the structure \nof m\/z = 82 Da has not yet been fully resolved (it is likely to be either C6H10+ or \n  \nC4H2O2+), it was chosen as a characteristic peak of the polyester which a) is not \nfound in any of the silicas and b) is unusually intense.  The test of whether or not \nadsorption data conform to the Langmuir model is to plot C\/RPI vs. C (where C is \nthe solute concentration), a linear relationship indicating that Langmuir conditions \nhave been met.  Linear regression has been carried out on the data produced from \nthe three nano-particulate substrates, and the results are presented in Table 1.  \nWhen these data are taken in conjunction with the adsorption isotherms, then in the \ncase of the fumed silica and the phenyl ormosil, the data support the Langmuir \nmodel.  The ethyl ormosil however seems to show multilayer adsorption.  Watts et \nal3, faced, apparently with the problem of multilayer adsorption (since one of the \nkey assumptions of the Langmuir model is that it applies only to monolayer \nadsorption), determined that they were in fact observing a conformational effect \ndue to increasing numbers of polymer-solvent interactions in high concentration \nsolutions, leading to perturbation of the polymer chains which in turn allows a \nhigher packing density when adsorbed onto a substrate.  The alternative would be \nthat the polymer chains were interacting in the higher concentration solutions.  The \nuse of the approach of Kurata and Tsunashima9 showed that all the solutions used \ncould be considered dilute and so the former argument was supported.  This \nargument could be applied in the case of the ethyl modified silica, which would at \nfirst seem to show multilayer adsorption.  Whilst it has not been possible to follow \nthe approach of Kurata and Tsunashima in this case (due to insufficient information \n  \nregarding the polyester) the molar concentrations are extremely small (10 vol% = \n5.55 x 10-3 M).  Therefore it is believed that the polyester is adsorbing onto the \nethyl modified silica, but that at around 1 vol% (5.55 x 10-4 M) the configuration of \nadsorbed polyester chains changes slightly.  This leads to an increase in the \nadsorbate on the substrate.  In all three cases however it is believed that a \nchemisorption process is taking place and that this is possibly an acid-base \ninteraction. \n \nCONCLUSIONS \nAdsorption of polyester onto ethyl and phenyl modified silica as well as onto a \ncommercial fumed silica has been carried out.  ToF-SIMS was utilised to produce \nspectra of the adsorbed surfaces, and characteristic peaksin the spectra were used to \nproduce adsorption isotherms.  The adsorption of the polyester onto the \ncommercial silica and phenyl ormosil appear to produce Langmuir-type isotherms, \nwhereas those produced from the ethyl ormosil were more complicated and suggest \na two stage adsorption process.  It is believed that this work, in parallel with \nmechanical testing of modified resin systems and composites, will lead to a \nsuccessful method for the optimisation of specific ormosil types as modifiers for \npolymer matrices composite systems. \n \n \n  \nAcknowledgements \nThe authors wish to thank the Engineering and Physical Sciences Research Council \n(EPSRC) and the Defence Science and Technology Laboratory (dstl) for their joint \nfunding of this project, Scott-Bader for their support of this project and Andrew \nBrown for his assistance with the ToF-SIMS analyses. \n \nREFERENCES \n1. Bescher E, Mackenzie JD, Materials Science and Engineering C, 1998; 6: \n145 \n2. Lebeau B, Sanchez C, Curr. Opinion Solid State Mater. Sci. 1999; 4: 11 \n3. Watts JF, Leadley SR, Castle JE, Blomfield CJ. Langmuir 2000; 16: 2292 \n4. Watts JF, Castle JE. Int.  J. Adhes. Adhes.  1999; 19: 435 \n5. Houssiua L, Betrand P. Appl. Surf. Sci. 2003; 203-204; 580 \n6. Abel M-L, Chehimi MM, Brown AM, Leadley SR, Watts JF. J. Mater. \nChem. 1995; 5: 845 \n7. Arkhireeva A, and Hay JN. J. Mater. Chem. 2003; 13, DOI: 10.1039 \n\/b306994j \n8. Fowkes FM, J. Adhes. Sci. Technol. 1987, 1, 7 \n9. Kurata M, and Tsunashima Y. In Polymer Handbook, 3rd.; Brandrup J, \nImmergut EH (eds). John Wiley and Sons: New York, 1989 \n \n  \nFigure 1.  Theoretical structure of the polyester.  This structure is based on \nstatistical probability of components present rather than a fully calculated series of \nchemical reactions. \n \nFigure 2. ToF-SIMS spectra comparing untreated (a) commercial silica (b) ethyl \nmodified silica and (c) phenyl modified silica \n \nFigure 3a.  Adsorption isotherm of polyester resin onto commercial silica \n \nFigure 3b.  Adsorption isotherm of polyester resin onto ethyl modified silica \n \nFigure 3c.  Adsorption isotherm of polyester resin onto phenyl modified silica \n \nTable 1. R2 values for C\/RPI against C where C is the molar concentration of the \nsolution plotted from the adsorption isotherms of peaks chosen from the ToF-SIMS \nspectra.  The closer the R2 value is to 1, the better the fit with the Langmuir type \nisotherm.  As can be seen the commercial silica and the phenyl ormosil conform \nreasonably well to the Langmuir isotherm whereas the ethyl modified seems to \nshow two sets of data. \n  \nOH\nO\nO OH\nO\nO\nO\nO\nO O\nO\nO\nO O\nO\nO\nO\nO\nOO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nFigure 1.  Theoretical structure of the polyester.  This structure is based on \nstatistical probability of components present rather than a fully calculated series of \nchemical reactions. \n \n  \n \nFigure 2.  ToF-SIMS spectra comparing untreated (a) commercial silica (b) ethyl \nmodified silica and (c) phenyl modified silica \n0\n0.1\n0.2\n0.3\n0.4\n0.5\nR\nPI\n \n0\n0.04\n0.08\n0.12\n0.16\nR\nPI\n \n0\n0.005\n0.01\n0.015\n0.02\n0.025\n35 40 45 50 55 60 65 70 75 80 85 90 95 100\nDaltons\nR\nPI\n \nb - ethyl modified silica \n0\n0.01\n0.02\n0.03\n0.04\n0.05\n35 40 45 50 55 60 65 70 75 80 85 90 95 100\nDaltons\nR\nPI\n \na - HDK N20 \n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n5 20 35 50 65 80 95 110 125 140 155 170 185 200\nDaltons\nR\nPI\n0\n0.005\n0.01\n0.015\n35 40 45 50 55 60 65 70 75 80 85 90 95 100\nDaltons\nR\nPI\n \nc - phenyl modified silica \n  \n0 1 2 3 4 5 6 7 8 9 10\nConcentration\/ vol%\n0.00\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0.08\n0.09\n0.10\n0.11\n0.12\n(E\n-\n1)\nR\nPI\nHDK N20 - 82 Peak\n \nFigure 3a  Adsorption isotherm of polyester resin onto commercial silica \n0 1 2 3 4 5 6 7 8 9 10\nConcentration\/ vol%\n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n0.80\n0.90\n(E\n-\n2)\nRP\nI\nEthyl Modified - 82 peak\n \nFigure 3b Adsorption isotherm of polyester resin onto ethyl modified silica \n  \n0 2 4 6 8 10\nConcentration\/ vol%\n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n0.80\n0.90\n1.00\n(E\n-\n2)\nR\nPI\nPhenyl modified - 82 peak\n \nFigure 3c.  Adsorption isotherm of polyester resin onto phenyl modified silica \n \nPeak R2 Peak R2 R2                R2               peak R2\n(0-2.5%sol) (2.5-10%sol)\n77 0.9713 77 0.3208 0.7779 0.9863 67 0.985\n82 0.9523 82 0.0745 0.9704 0.9889 82 0.9771\n87 0.9801 149 0.0288 0.8136 0.9999 104 0.9817\nfumed silica ethyl modified phenyl modified\n \nTable 1. R2 values for C\/RPI against C where C is the molar concentration of the \nsolution plotted from the adsorption isotherms of peaks chosen from the ToF-SIMS \nspectra.  The closer the R2 value is to 1, the better the fit with the Langmuir type \nisotherm.  As can be seen the commercial silica and the phenyl ormosil conform \nreasonably well to the Langmuir isotherm whereas the ethyl modified seems to \nshow two sets of data. \n \n \n  \n \n"}