{"doi":"10.1063\/1.2036815","coreId":"70921","oai":"oai:eprints.lancs.ac.uk:9462","identifiers":["oai:eprints.lancs.ac.uk:9462","10.1063\/1.2036815"],"title":"Brownian dynamics simulations of iconic current through an open channel","authors":["Tindjong, R.","Eisenberg, R. S.","Kaufman, I. Kh.","Luchinsky, Dmitry G.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"Ionic motion through an open ion channel is analyzed within the framework of self‐consistent Brownian dynamics. A novel conceptual model in which the ions motion is coupled to the vibrations of the pore walls is introduced. The model allows to include into simulations an important additional mechanism of energy dissipation and the effects of self‐induced strong modulation of the channel conductivity","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70921.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9462\/1\/ICNF2005BrownianDynamics.pdf","pdfHashValue":"668407ef4fa195e9bd76a488055e16bb7797c9f3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9462<\/identifier><datestamp>\n      2018-01-24T05:23:09Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Brownian dynamics simulations of iconic current through an open channel<\/dc:title><dc:creator>\n        Tindjong, R.<\/dc:creator><dc:creator>\n        Eisenberg, R. S.<\/dc:creator><dc:creator>\n        Kaufman, I. Kh.<\/dc:creator><dc:creator>\n        Luchinsky, Dmitry G.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Ionic motion through an open ion channel is analyzed within the framework of self‐consistent Brownian dynamics. A novel conceptual model in which the ions motion is coupled to the vibrations of the pore walls is introduced. The model allows to include into simulations an important additional mechanism of energy dissipation and the effects of self‐induced strong modulation of the channel conductivity.<\/dc:description><dc:date>\n        2005<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9462\/1\/ICNF2005BrownianDynamics.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2036815<\/dc:relation><dc:identifier>\n        Tindjong, R. and Eisenberg, R. S. and Kaufman, I. Kh. and Luchinsky, Dmitry G. and McClintock, Peter V. E. (2005) Brownian dynamics simulations of iconic current through an open channel. AIP Conference Proceedings, 780. pp. 563-566. ISSN 0094-243X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9462\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1063\/1.2036815","http:\/\/eprints.lancs.ac.uk\/9462\/"],"year":2005,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Brownian dynamics simulations of ionic current\nthrough an open channel\nR. Tindjong∗, R.S. Eisenberg†, I. Kaufman∗∗, D. G. Luchinsky∗ and\nP.V.E. McClintock∗\n∗Department of Physics, Lancaster University, Lancaster LA1 4YB, UK.\n†Department of Molecular Biophysics and Physiology, Rush Medical college,\n1750 West Harrison, Chicago, IL 60612, USA.\n∗∗VNII for Metrological Service, Gosstandart, Moscow, 119361, Russia.\nAbstract. Ionic motion through an open ion channel is analyzed within the framework of self-\nconsistent Brownian dynamics. A novel conceptual model in which the ions motion is coupled to the\nvibrations of the pore walls is introduced. The model allows to include into simulations an important\nadditional mechanism of energy dissipation and the effects of self-induced strong modulation of the\nchannel conductivity.\nKeywords: ion channels, Poisson equation, Langevin equation, self-consistent approach\nPACS: 87.16.Uv\nINTRODUCTION\nIon channels in the cell membrane are natural nanotubes that control a vast range of\nphysiological activity [1]. Understanding their structure-function relationship is the main\nchallenge. Much progress has been made in that direction in recent years. Theories rang-\ning from Poisson Nernst Planck (PNP) theory , Brownian dynamics (BD) simulations\nand Molecular Dynamics (MD) have been developed, each of them presenting its own\nparticular strengths and weaknesses [2]. In our model, we use a one dimensional ap-\nproximation of the ion dynamics inside the channel. To this end, we neglect the off-axis\nmotion of ions in the channel to be able to include in an effective way interaction with\nthe channel wall. One of the goals of the simulations is to infer the diffusion coefficient\nfor ionic motion in the channel, rather than assuming it to be known. To this end we\ntherefore integrate out fast degrees of freedom related to the ion motion perpendicular to\nthe channel axis. This effectively reduces the problem to that of one-dimensional motion\nalong the reaction coordinate, which is in our case the channel axis. And the reaction is\nthe transition of ion from the left to the right (or vice versa). This approach is standard in\nchemical kinetics, allowing self-consistent treatment of ionic diffusion in an open pro-\ntein pore at the level of the Brownian motion approximation. Our approach allows us to\nintroduce, in addition another very important degree of freedom related to the wall mo-\ntion. The latter is a source of both self-induced enhancement of transition probabilities\nand a real source of dissipation.\n563\nMATERIALS AND METHODS\nWe start our analysis by considering the Langevin equation for the i-th ion when the\nchannel walls are fixed, which takes the form:\nmiv˙i = −miγivi+ fi+\n√\n2γimikBT ξi(t), (1)\nwhere mi and vi are the mass and the velocity of the ion. The friction force is proportional\nto vi with a coefficient of proportionality miγi. The equation for a j-th different type of\nion is written in the same way, but with different mass and friction coefficient. The force\nacting upon the ion has a number of components\nfi = fD+ fE + fR, (2)\nwhere fD is the dielectric force due to the channel walls, fixed charge, and external\napplied potential, fE is the electrostatic force due to the Coulomb interaction between\nmoving ions, finally fR is a short range repulsive force. We accommodate the short range\nrepulsive potential through the following expression [3]\nUsr(r) =\nF0\n9\n(r1+ r2)10\nr9\n, (3)\nwhere r1 and r2 are the Pauling radii of the ions, r is the ion-ion distance, and F0 is a\nshort-range force constant taken to be F0 = 2×10−10N.\nEqs. (3) can be integrated simultaneously in the bulk solution. A snapshot of ions near\nthe channel mouth is shown in Fig.1\n0 0.5\n1\n1.5 2\n2.5\n3\n0\n0.5\n1\n0\n0.5\n1\nXY\nZ\n0 0.5 1 1.5 2 2.5 3\n0\n0.2\n0.4\n0.6\n0.8\n1\nX\nZ\nFIGURE 1. A snapshot of ions in the bulk solution obtained by simultaneous solution of Eqs. (1).\nThe line in the bottom figure is a representation of the one-dimensional approximation\nof the potential across the channel. The shift between the two ends is the potential drop\ndue to the applied voltage. As soon as an ion enters the channel we assume that its\nmotion is one dimensional along the axis of the channel. In particular this means that\nthe multiple interactions of the ion with the wall during its diffusion within the channel\n564\nare included in the unknown diffusion coefficient, which depends in turn on the position\nof the ion in the channel. We note that such an approximation is traditional in chemical\nphysics where reaction in a system with many degrees of freedom is often considered\nas a one-dimensional dynamics along the so-called “reaction coordinate”. In the present\ncase, reaction is the transition of an ion from the left volume to the right (or vice versa),\nand the reaction coordinate is the x-coordinate along the channel axis.\nFor the ion in the channel the main driving force is fD. Since we have assumed\nsymmetry of the system about the channel axis, we calculate the corresponding force by\nintegrating the Poisson equation using the Finite Volume Method in the system shown\nin the Fig.1, with only the ions within the channel taken into account.\nIn the bulk reservoir, we consider a symmetric concentrations of NaCl. We used a\nstochastic boundary condition. Each time that an ion cross the channel, it is re-injected\nback into a random location with zero velocity. This way, we maintain fixed the specified\nconcentrations in the reservoirs. The transmembrane potential which is generated by the\napplied electric potential across the membrane far away from the channel is explicitly\ntaken into account in the solution of Poisson’s equation.\nRESULTS AND DISCUSSION\nBefore using the Poisson’s equation solution, we make sure that the latter is sufficiently\nrobust by comparing the numerical potential with a simple electrostatic problem. For\nexample, the program reproduces accurately the potential created by one charge in a\nspace divided in two with two different dielectric coefficients. After this check, we\nfeel confident in using the numerical simulation of the Poisson equation to estimate the\nenergy faced by an ion entering the channel. A Na+ entering the channel is trapped in\nthe energy well created by a negatively charged ring located at the middle of the channel,\nas can be seen on Fig.2\n0 10 20 30 40 50\n−6\n−5\n−4\n−3\n−2\n−1\nPo\nte\nnt\nia\nl e\nne\nrg\ny, \nKT\nx, A\nR=4A \n \nR=5A \nFIGURE 2. Profile of the Energy faced by a N+a ion.\nFor each applied potential, the Langevin equation is solved. The trajectories of ions\ntraversing the channel are tracked. By counting all the transitions of ions crossing the\n565\nchannel during a given period of time, the current can be calculated for each applied\nvoltage. The current-voltage characteristic of the channel can thus be obtained. This can\nthen be compared with experiments. The position-dependent diffusion coefficient of the\nion as it moves across the channel has also to be calculated. As can be seen in Fig.2, the\nvariation of the channel radius due to its interaction with the ion moving in the channel\nhas a huge effect on the potential energy. The ion will face a smaller barrier for larger\nchannel radius. The equations of motion for the moving wall and for the single ion in\nthe channel can be written as:\nmix¨i = −miγix˙i+ fi+ q1q2 | (x−L\/2) |4piεε0 ˜R3\n+\n√\n2γimikBT ξi(t), (4)\nMδ ¨r˜+M ˜Γδ ˙r˜+ kδ r˜ = − q1q2δ r˜\n4piεε0 ˜R3\n+\n√\n2M ˜ΓkBT η˜(t˜), (5)\nHere ˜R =\n√\n(x−L\/2)2+δ r˜2 is the distance between moving ion on the channel axis\nand charged vibrating segment of the wall, and q1 and q2 are respectively the charge\nof the moving ion inside the channel and the charged ring located at the middle of the\nchannel.\nCONCLUDING REMARKS\nWe have presented a self-consistent method for determination of the current-voltage\ncharacteristic of the ion channel. So far, we have successfully calculated the energy\nbarrier faced by a Na+ ion traversing the channel. Studies of the bi-ionic solution and the\neffect of the flexible protein wall, as well as the space dependant diffusion coefficient,\nare in progress. As results, we expect the coupling of ionic motion with vibration of\nthe wall to introduce energy dissipation and self-induced modulation of the transition\nprobability through the ion channel.\nACKNOWLEDGMENTS\nThe work was supported by the Engineering and Physical Sciences Research Council\n(UK), The Russian Foundation for Basic Research, INTAS, and ESF.\nREFERENCES\n1. B. Hille, Ionic Channel Of Excitable Membranes, Sinauer Associates, Sunderland, MA, 1992.\n2. Gennady V. Miloshesvky and Peter C. Jordan, “Permeation in ion channels: the interplay of structure\nand theory ” TRENDS in Meurosciences 27 (6),pp. 308–314, 2004\n3. G. Moy, B. Corry, S. Kuyucak, and S.-H. Chung, “Tests of continuum theories as models of ion\nchannels. I. Poisson-Boltzmann theory versus Brownian dynamics,” Biophys. J. 78(5), pp. 2349–2363,\n2000.\n566\n\n"}