{"doi":"10.4236\/health.2010.21005","coreId":"102488","oai":"oai:epubs.surrey.ac.uk:1950","identifiers":["oai:epubs.surrey.ac.uk:1950","10.4236\/health.2010.21005"],"title":"Applicability of the P19CL6 cells as a model of cardiomyocytes - A transcriptome analysis","authors":["Khodadadi, I","Plant, NJ","Mersinias, V","Thumser, AE"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1950<\/identifier><datestamp>\n      2017-10-31T14:03:45Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1950\/<\/dc:relation><dc:title>\n        Applicability of the P19CL6 cells as a model of cardiomyocytes - A transcriptome analysis<\/dc:title><dc:creator>\n        Khodadadi, I<\/dc:creator><dc:creator>\n        Plant, NJ<\/dc:creator><dc:creator>\n        Mersinias, V<\/dc:creator><dc:creator>\n        Thumser, AE<\/dc:creator><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1950\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Khodadadi, I, Plant, NJ, Mersinias, V and Thumser, AE  (2010) Applicability of the P19CL6 cells as a model of cardiomyocytes - A transcriptome analysis   Health, 2 (1).  pp. 24-31.      <\/dc:identifier><dc:relation>\n        10.4236\/health.2010.21005<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1950\/","10.4236\/health.2010.21005"],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Vol.2, No.1, 24-31 (2010)             \ndoi:10.4236\/health.2010.21005 \n \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/\n                                                   Health \nOpenly accessible at\n \n \nApplicability of the P19CL6 cells as a model of  \ncardiomyocytes – a transcriptome analysis \nIraj Khodadadi1, 2, Nick J. Plant2, Vassilis Mersinias3, Alfred E. Thumser2* \n1Department of Biochemistry and Nutrition, Hamedan University of Medical Sciences, Hamedan, Iran \n2Division of Biochemical Sciences, University of Surrey, Guildford, United Kingdom \n3B.S.R.C. “Alexander Fleming”, Varkiza, Greece; a.thumser@surrey.ac.uk  \nReceived 15 November 2009; revised 4 December 2009; accepted 7 December 2009. \nABSTRACT \nThe P19CL6 cell-line, a clone of the P19 mouse \nembryonal carcinoma cell-line, has been exten-\nsively used as a model for cardiomyocytes as \nthese cells can be differentiated into a cardio-\nmyocyte phenotype upon incubation with di-\nmethyl sulfoxide. Uniquely, these cells can be \nobserved to “beat” when monitored by mi-\ncroscopy. We started investigating the response \nof P19CL6 cells to fatty acids, but highly vari-\nable results lead us to investigate the phenotype \nof the P19CL6 cells in more depth. In this study \nwe demonstrated that the P19CL6 cells are re-\nsponsive to adrenaline, but loose the “beating” \nphenotype after 16 passages in culture. Analysis \nof specific mRNA transcripts indicated that the \nP19CL6 cells express both cardiac- and skeletal \nmuscle-specific genes, while global analysis of \nmicroarray data showed clear differences be-\ntween the P19CL6 cells and cardiac tissue of \nembryonic or adult origin. In conclusion, our \nobservations suggest caution in the use of the \nP19CL6 cells as a model of cardiomyocytes \nunless rigorous validation for the intended \nanalysis has been undertaken. \nKeywords: Gene expression; Cardiomyocyte; \nP19CL6 Cell-line \n1. INTRODUCTION \nThere is a requirement for the development of realistic \ncell culture models both for basic research and the de-\nvelopment of novel therapeutic agents. However, for \nseveral tissues, including heart, no individual cell line has \nbeen successfully validated for these purposes; such a \nfailure is usually the result of the loss of one or more \nspecific phenotypic features associated with the target  \ntissue in the cell line. One approach to mitigate these \nissues has been the utilisation of chemically-stimulated \ndifferentiation of stem cells, with the hope that these cell \nlines will have a more realistic phenotype than cell lines \nderived from fully differentiated tissue. Pluripotent em-\nbryonic carcinoma cells have been reported as successful \nin vitro models of cardiac differentiation; for example, the \nP19 mouse embryonal carcinoma cell-line has been re-\nported to differentiate into an embryonic cardiac-muscle \nphenotype in vitro [1] upon the addition of dimethyl \nsulfoxide (DMSO) [2-5]. Differentiated P19 cells have \nbeen reported to retain the ability to spontaneously con-\ntract and shown to express transcripts in a temporal \nmanner during culture, suggestive of a cardiac-muscle \nphenotype [5-7], and as such these cells have therefore \nbeen extensively used to study cardiac cell physiology \n[1,2,5,6,8], although with the caveat that these cells are \nembryonic instead. However, in addition to these cardiac- \nmuscle-specific properties, P19 cells also display pluri-\npotent properties and can be differentiated into cells dis-\nplaying either a skeletal muscle or neural phenotype [1, \n3-5]. There has thus been some concern about the ho-\nmogeneity of DMSO-differentiated P19 cultures, with a \nheterogeneous cell population following differentiation \nsignificantly reducing the utility of these cells as a car-\ndiac-muscle-specific model: There has thus been much \ninterest in identifying subclones of P19 cells that more \nrobustly differentiate into cardiomyocytes. The P19CL6 \ncell-line, a sub-clone of P19 embryonal cells, has been \nreported to efficiently differentiate into beating cardio-\nmyocytes upon exposure to DMSO under adherent cul-\nture conditions [9] and has been widely used as an in vitro \nmodel of cardiovascular cells [1,2,10-16]. \nIt is clear that the P19CL6 cell line has potential as a \nmodel system for the study of cardiomyocyte develop-\nment and differentiation, and indeed they are currently \nused as such. However, full characterisation and valida-\ntion is required before they can be used for this purpose \nwith full confidence. A review of the literature, focusing \non P19CL6 and P19 cell culture conditions, shows that \ntwo separate methods are commonly used, namely ad-\nherent and non-adherent culture conditions [1,5,9,10,17]. \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/Openly accessible at  \n25\nIn addition, vitamins and hormones such as adrenaline \nhave been shown to act as potent inducers of P19 cell \ndifferentiation into cardiomyocytes in addition to the \naforementioned DMSO [1,5,7,9]. In this study we have \ncharacterized the P19CL6 cells in more detail under dif-\nferent culture conditions, focusing in particular on util-\nising microarray methodologies to compare the P19CL6 \ntranscriptome against native cardiac-muscle and skele-\ntal-muscle transcriptomes. These investigations represent \nthe first robust examination of both P19CL6 transcrip-\ntome and cardiac phenotype, and demonstrate that the \nP19CL6 cell-line displays only a limited cardiomyocyte \nphenotype that is dependent on passage conditions. As \nsuch we would advise caution in the use of this cell line as \na ‘complete’ in vitro model of cardiac-muscle cells. \n2. MATERIALS AND METHODS \n2.1. Materials \nCell culture media and reagents were obtained from In-\nvitrogen Corporation (Paisley, U.K.) and Sigma-Aldrich \nCompany Ltd. (Poole, U.K.). Materials and kits for RNA \nextraction, cDNA synthesis and RT-PCR were supplied \nby Promega Corporation (Southampton, U.K.), Amer-\nsham Biosciences (Chalfont St. Giles, U.K.) and Qiagen \nLtd. (Crawley, U.K.). Corning Life Sciences (Schi-\nphol-Rijk, Netherlands) supplied the ProntoPlus mi-\ncroarray kit. Ambion Ltd. (Huntingdon, U.K.) supplied \nmouse heart and embryonic total-RNA, whereas mouse \nskeletal muscle and embryonic heart total-RNA were \npurchased from Panomics Inc. (Redwood City, U.S.A.) \nand Zyagen (San Diego, U.S.A.), respectively. \n2.2. Cell culture \nP19CL6 cells were purchased at passage 9 from Riken \nCell Bank (Ibaraki, Japan) in growing flask and cultured \nin medium containing -MEM (minimal essential media) \nsupplemented with 10% FBS (foetal bovine serum) and \n1% penicillin-streptomycin (10,000 Units\/ml and 10 \nmg\/ml, respectively) [9]. To differentiate P19CL6 cells \ninto cardiomyocytes, cells were plated in 6-well culture \nplates (10 cm2) at a density of 2104 cells\/cm2 in standard \nmedium containing 1% DMSO [9]. Cells were cultured \nfor 15 days at 37C and 5% CO2 with medium refreshed \nevery second day. For culturing P19CL6 cells under \nnon-adherent conditions, cells were stimulated to form \naggregates by incubation in bacterial petri dishes (1106 \ncells\/dish; 78 cm2), containing a thin layer of 0.5% agar, \nfor 4 days with standard media containing 1% DMSO, \nbefore transfer to regular cell culture flasks for the re-\nmainder on the incubation period [5]. Cell aggregates \nwere collected by centrifugation and replated into culture \nflasks for 15 days at 37C and 5% CO2 in the presence of \n1% DMSO. The H9C2 (2-1) cell-line, a murine cell-line \nthat expresses a skeletal muscle phenotype, was obtained \nfrom the European Collection of Cell Cultures (ECACC; \nSalisbury, U.K.) and cultured under the same adherent \nconditions as the P19CL6 cells. \n2.3. Determination of mRNA Levels by  \nReverse Transcriptase Polymerase \nChain Reaction (RT-PCR) and cDNA  \nMicroarrays \nTotal RNA was isolated from cells with Trizol reagent, as \nper manufacturer's instructions (Invitrogen Corporation, \nPaisley, U.K.). Whole heart and skeletal muscle tissues \n(upper leg muscle) were dissected from 10 week old male \nCD1 wild-type mice (+\/+), homogenised in Trizol reagent \nusing an Ultra-Turrax T8 homogeniser, and total RNA \nisolated as per manufacturer’s instructions. Gene-specific \nforward and reverse primers used in the one-step RT-PCR \nor nested PCR reactions are shown in Table 1. In samples \nthat did not show detectable cDNA levels after an initial \nRT-PCR amplification the PCR products were reampli-\nfied by nested PCR [18]. PCR products were separated by \nelectrophoresis on 2% agarose gels containing ethidium \nbromide, and the identity of PCR products verified by \nsequencing.  \nMicroarray experiments were designed as \ndual-hybridisation optimal interwoven loops \n(http:\/\/exgen.ma.umist.ac.uk) [19-21]. cDNA was synthe-\nsised from purified total- RNA and labelled by a direct \nlabelling method in the presence of Oligo dT, nucleo-\ntide mixture, Cy3-\/Cy5- dCTP dyes, and SuperScript-II \nReverse Transcriptase, based on Human Genome Map-\nping Project protocols (http:\/\/www.hgmp.mrc.ac.uk\/). \nPurified Cy3- and Cy5- labelled cDNA samples (40 pmol \neach) were mixed in pairs (total volume 40 µl), according \nto the experimental plan, and hybridised to microarrays \nby incubation in hybridization chambers for 20 hours at \n50C, before post-hybridization washing and drying. \nMicroarray images were acquired using an Affymetrix \n428 scanner (Affymetrix, Santa Clara, USA) and ana-\nlysed with BlueFuse (BlueGnome Ltd., Cambridge, \nU.K.), including quantification of pixel intensities of the \nspots and excluding background intensity and artefact \nareas on the arrays. The data was filtered by eliminating \nlow quality array spots, as determined by BlueFuse’s spot \nuniformity and circularity measurements (spot uniformity \nand circularity >0.5 in at least 50% of the arrays), and \nnormalised by intensity-dependent per spot and per chip \n(LOWESS) normalisation with GeneSpring-7 data \nanalysis software (Agilent Technologies UK Ltd, Stock-\nport, UK).  \nAfter Lowess normalisation and filtering of microarray \ndata linear modelling (LLAMA; Live Linear Analysis of  \nMicroArray) was performed (http:\/\/exgen.ma.umist.ac.uk) \nto convert data from the loop experiment into a linear \nmodel and generate differential gene expression estimates \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/\n26 \nOpenly accessible at  \n \n(a) \n \n(b) \nFigure 1. Determination of the effect of (a) passage number \nand (b) adrenaline on the beating characteristic in P19CL6 \ncells cultured under adherent conditions. (a) P19CL6 cells \n(passage 12) were cultured with 0-20 M adrenaline and \npulse rate was recorded on day 15 of incubation. Linear re-\ngression analysis showed a correlation of pulse rate with \nadrenaline concentration (y = 1.1x + 21.8, R2 = 0.541, P < \n0.001) and one-way ANOVA confirmed a significant effect \nof adrenaline on pulse rate in P19CL6 cells (P < 0.001). Cells \nwere cultured in three biological repeats and beating was \nrecorded in at least six localized areas in the well. a, b, and c \nrepresent groups with a significant difference in average \npulse rate. (b) P19CL6 cells from different passage numbers \n(12-16) were cultured in the presence of DMSO and pulse \nrate (beats\/min) was recorded on day 15 of incubation. Linear \nregression analysis shows a significant effect of passage \nnumber on pulse rate (y = -2.58x + 63.3, R2 = 0.486, P < \n0.001) and two-way ANOVA confirmed significance differ-\nence between the different passage numbers of P19CL6 cells \n(P < 0.01). \nbetween contrast pairs, i.e. Cy3\/Cy5 ratios [20,21,33]. The \nP19CL6 samples consisted of three biological repeats, with \neach sample analyzed on at least three microarray slides \n(technical repeats), and these were reduced to a single \nsample during the LLAMA analysis. The data reduction \ngenerated by the LLAMA analysis was further evaluated \nby PCA (principal component analysis) and PLS (partial \nleast squares regression) (Simca-P+, Umetrics, New Jersey, \nU.S.A.). The PCA analysis generated correlations be-\ntween the different samples. In order to simplify the in-\nterpretation of the PLS analysis, the P19CL6 sample was \ncompared to skeletal muscle, adult and embryonic heart \nsamples, with the H9C2 (2-1) sample removed. The PLS \nanalysis was used to produce a variable importance (VIP) \nlist and all genes with a VIP > 1, i.e. having a significant \nimpact on the difference between the P19CL6 and other \nsamples, were further analysed with the DAVID software \nsuite (http:\/\/david.abcc.ncifcrf.gov\/home.jsp) for func-\ntional annotation clustering according to their biological \nfunctions [24]. \na, b, c\na, b\nc\nb a\n3. RESULTS \na, b\nIn a series of separate cultures of P19CL6 cells it was \nnoted that the cultures did not consistently display a \n“beating” phenotype, a characteristic that has previously \nbeen used as evidence of the cardiomyocyte properties of \nthis P19 sub-clone [9]. \nc\na\nb, c\n3.1. P19CL6 Cells Exhibit a            \nCardiac-Muscle-Like ‘Beating’     \nPhenotype under Specified Culture \nConditions \nA characteristic of the P19CL6 cells is that they display \nbeating in localised nodes following differentiation in the \npresence of DMSO [9]. The cardio-stimulatory chemical \nadrenaline elicited a dose-dependent linear increase in the \nobserved pulse rate with statistically significant increases \nobserved between 0-20 M adrenaline (Figure 1a). \nHowever, observation of P19CL6 cells over time in cul-\nture (passages 12-22) demonstrated that beating was \nconsistently only observed between passages 12-16, and \nquantification of this beating showed a significant inverse \ncorrelation of the pulse-rate with passage number (Figure \n1b). Microscopic analysis of DMSO-differentiated P19- \nCL6 cells demonstrated mono-nuclear cells with no evi-\ndence of cell fusion; these characteristics were distinct \nfrom the morphological characteristics of skeletal muscle \ncells, as typified by the H9C2 (2-1) murine cell-line \n(Figure 2), and added further weight to the assertion that \ndifferentiated P19CL6 cells exhibit a cardiac-specific \nmuscle phenotype [5,10,34]. The microscopic analysis \nand response to adrenaline provided an indication of a \ncardiac-type phenotype, although the loss of beating with \npassage number suggested that the phenotype may not be \nrobust with regards to culture duration.  \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/Openly accessible at  \n27\n(A) (B)\n \nFigure 2. Microscopic examination of P19CL6 and H9C2(2-1) \ncells. Cells were cultured on coverslips under adherent condi-\ntions in the presence of DMSO and collected on day 15 of \nincubation. Cells were fixed using paraformaldehyde and \nobserved by light microscopy under 40× magnification. (a) \nP19CL6 cells; (b) H9C2(2-1) cells. \n \n3.2. The P19CL6 Cell-Line Expresses both  \nCardiac- and Skeletal Muscle-Specific  \nTranscripts \nTo further examine the reported cardiac properties of the \nP19CL6 cell-line, mRNA transcript levels of -MHC, - \nMHC, MyoD and myogenin were determined by RT- \nPCR followed by nested PCR. The expression of these \ngene products are characteristic of cardiac- (-MHC, \n-MHC) and skeletal muscle (MyoD, myogenin) tissues \n[35-38]. Figure 3a shows that P19CL6 cells expressed \nsignificant levels of -MHC, -MHC, MyoD and myo-\ngenin transcripts, inconsistent with a cardiac only phe-\nnotype: To examine if the unexpected expression of \nskeletal muscle markers in P19CL6 cells was caused by \nthe culture conditions we also examined P19CL6 under \nnon-adherent culturing conditions; under these conditions \nwe once again observed both cardiac- and skeletal mus-\ncle-specific markers (Figure 3b), suggestive of a mixed \ncardiac\/skeletal-muscle transcriptome in P19CL6 cells \nregardless of culture conditons. The identity of the - \nMHC, -MHC, MyoD and myogenin transcripts was \nconfirmed by sequencing of the nested PCR products \n(data not shown). The marker transcript specificity was \nconfirmed using both the H9C2 (2-1) cell-line, which \nexpresses a skeletal muscle phenotype, and only ex-\npressed MyoD and myogenin transcripts and mouse car-\ndiac tissue, which only expressed the aforementioned \ntranscript markers of cardiac phenotype, -MHC and \n-MHC (Figure 3c). These data were thus consistent \nwith P19CL6 cells exhibiting a mixed cardiac\/skeletal \nmuscle phenotype, and therefore a global transcriptome \nanalysis was under-taken to examine this hypothesis, \ncomparing P19CL6 cells with the H9C2 (2-1) cell-line \nand mouse cardiac and skeletal muscle tissue. \n3.3. Characterisation of the P19CL6 \nCell-Line by Microarray Analysis \nTranscriptomes from three independent P19CL6 cultures \nwere compared by microarray analysis to the transcript- \nGAPDH -MHC  -MHC MyoD\nP19CL6\n500  bp\nMyogenin\n400  bp\n300  bp\n200  bp\nH9C2\n(2-1)\nP19CL6 P19CL6 P19CL6P19CL6 H9C2\n(2-1)\nH9C2\n(2-1)\nH9C2\n(2-1)\nH9C2\n(2-1)\n \na b\n(a) \nGAPDH\n500  bp\n300  bp\n400  bp\n-MHC -MHC MyoD Myogenin\n \n(b) \nMouse Heart \nG\nA\nPD\nH\n-M\nH\nC\n-M\nH\nC\nM\nyo\nD\nM\nyo\nge\nni\nn\n600\n500\n400\n \n(c) \nFigure 3 Expression of -MHC, -MHC, MyoD and myo-\ngenin, as detected by nested-PCR, in (a) P19CL6 and \nH9C2(2-1) cells, cultured under adherent conditions, (b) \nP19CL6 cells cultured under non-adherent conditions, upon \nexposure to 1% DMSO, and (c) mouse heart tissue. Cells \nwere cultured under adherent or non-adherent conditions for \n15 days in the presence of 1% DMSO, as described under \nMethods. Heart tissue was dissected from 10 weeks old CD1 \nwild type (+\/+) male mice. Total RNA was isolated and \nmRNA levels determined by RT-PCR followed nested-PCR. \nTheoretical sizes of PCR products are 275 bp or 413 bp \n(GAPDH), 302 bp (-MHC), 410 bp (-MHC), 392 bp \n(MyoD) and 337 bp (myogenin), as indicated by the arrows. \nFor Figure 3c the theoretical sizes of PCR products were: \n556 bp (GAPDH); 491 bp (-MHC); 587 bp (-MHC); 513 \nbp (MyoD); and 608 bp (Myogenin), as indicated by arrows. \nData shown of one experiment that is representative of three \nseparate biological experiments. \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/\n28 \nOpenly accessible at  \ntomes of mouse cardiac and skeletal muscle tissue, H9C2 \n(2-1) cells, and a reference sample, which was a mixture \nof cDNA from all the samples in equal proportions. An \ninterwoven loop design and data reduction by linear \nmodelling [21-23] was utilized to compare all samples to \nthe reference sample (Figure 4). The transcriptomes of \nall samples were initially analysed by PCA and showed a \nlow correlation between the P19CL6 cells and other \nsamples (Table 2, Figure 5). Only the embryonic heart \nsample did not differ significantly from the P19CL6 cells \n(P>0.05), although even this comparison showed a very \nlow correlation of 0.007 (Table 2). Subsequent PLS \nanalysis, excluding the H9C2 (2-1) samples in order to \nsimplify interpretation, showed that principal component \n1 (PC1) accounted for 52% of the total variance and \nclearly separated the P19CL6 sample from the heart and \nmuscle tissue (Figure 5). The loading factors for PC1 \nshowing a variable importance (VIP) of >1.0 represent \nthose transcripts driving the separation of P19CL6 cells \nfrom the other samples; these were put into a biological \ncontext by ascertaining Gene Ontology (GO) identifiers \nthat were significantly over-represented in the identified \ntranscript level changes, using the DAVID bioinformatics \nsuite [24]. Such over-representation is often indicative of \na significant biological effect in the pathway(s) associated \nwith the GO identifiers. Several annotation clusters with \nan enrichment score of greater than 1.0, i.e. showing \nsignificant enrichment, were identified (502 separate \ngenes) and the five main Biological Processes that were \nidentified are shown in Table 3. A more detailed analysis \nof the genes identified within the “Regulation of cellular \nprocesses” cluster showed that 57% (total number 146 \nseparate gene products) of the identified mRNA levels \nwere up-regulated in P19CL6 cells compared to embry-\nonic heart tissue, whereas the remainder were down- \nregulated (data not shown). The latter tissue was the \nprimary focus for comparison as P19-derived cardio-\nmyocytes are embryonic in nature and have previously \nbeen used as a model system for the embryonic heart \n[1,6,8]. However, in the original P19CL6 paper this \ncell-line was proposed to be a good model system for \nadult heart [9]. \n4. DISCUSSION \nThe P19CL6 cell-line, a derivative of P19 embryonal \ncarcinoma cells, is widely used as an in vitro model of \ncardiovascular cells [1,2,10,16], and has been shown to \ndifferentiate into a beating phenotype that is reminiscent \nof cardiomyocytes upon exposure to DMSO [9]. Data \npresented here confirm that differentiated P19CL6 cells \ndo exhibit some markers of a cardiac phenotype in the \nP19CL6 cells: a beating phenotype that is positively \nresponsive to adrenaline; expression of transcript markers \nof cardiac phenotype (-MHC, -MHC); microscopic \n3\n1\n2\nFigure 4: Khodadadi et al 2009\n \n2\n4 1\n3 \n7\n6\n3\n1\n2\n5\n44\nA\nC\nB\n \na b \nc\nFigure 4. Representation of dual-hybridisation optimal in-\nterwoven loop design for microarray experiments. Loop de-\nsigns showing three, four, and seven samples (nodes) that \nwere compared in three different experiments. The samples \nanalysed in each experiment were (a) P19CL6 cells, mouse \nembryonic heart and mouse adult heart tissue (b) P19CL6 \ncells, H9C2 (2-1) cells, mouse adult heart and mouse skeletal \nmuscle tissue (c) P19CL6 cells (two different biological \nsamples), H9C2 (2-1) cells, mouse embryonic heart tissue, \nmouse adult heart tissue, mouse skeletal muscle tissue and a \nreference sample, the latter containing cDNA from all the \nsamples. The samples at the start of the arrows were labelled \nwith Cy3 and the target samples with Cy5. \n \n-30\n-20\n-10\n0\n10\n20\n30\n-30 -20 -10 0 10 20 30\nPr\nin\nci\npa\nl c\nom\npo\nne\nnt\n 2\nPrincipal component 1\nPr\nin\nci\npa\nl c\nom\npo\nne\nnt\n 2\nP19CL6\nEmbryonic heart \ntissue\nSkeletal \nmuscle tissue\nAdult heat \ntissue\n \nFigure 5. Analysis of transcriptomic expression data (microar-\nrays) by PLS analysis. Gene expression data from microarray \nanalysis was reduced by linear regression, using the LLAMA \nalgorithm [19-21]. The data was further analysed by PCA and \nsubsequently PLS to demonstrate discrimination between the \nsamples (R2X for principal components 1 and 2 is 0.52 and 0.33, \nrespectively) and generate a list of variable importance that \ncould be used in the DAVID analysis. \n \nanalysis showing mono-nuclear cells with no evidence of \ncell fusion [1,5,8,25]. However, closer examination of \nthese features raises some concerns, and is suggestive of \nan unstable, mixed, cardiac\/skeletal muscle phenotype. \nWe demonstrated that the pulse-rate for beating was \nnegatively correlated with the passage number of the cells, \nwith no beating observed after passage 16, suggesting  \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/Openly accessible at  \n29\nTable 1. Sequences of oligonucleotide primers used for PCR. \nOligo name Sequences %GC TmC Application Productsize\nGAPDH-F \nATT CAA CGG \nCAC AGT CAA \nGGC \n52 59.8 \nGAPDH-R \nCAC ATT GGG \nGGT AGG AAC \nAC \n55 59.4 \nRT-PCR 556 bp\nGAPDH-F \nAGC TTG TCA \nTCA ACG GGA \nAGC \n52 59.8  \nGAPDH-R \nCTA AGC AGT \nTGG TGG TGC \nAG \n55 59.4  \nnested PCR 275 bp\nGAPDH-F \nGAC TCC ACT \nCAC GGC AAA \nTTC \n52 59.8 \nGAPDH-R \nAGT CTT CTG \nGGT GGC AGT \nGAT \n52 59.8 \nnested PCR 413 bp\n-MHC-F \nATG GAG CAG \nACC ATC AAG \nGAC \n52 59.8 \n-MHC-R \nTTG TGT ATT \nGGC CAC AGC \nGAG \n52 59.8 \nRT-PCR 491 bp\n-MHC-F \nAAG AGT GAG \nCGG CGC ATC \nAA \n55 59.4 \n-MHC-R \nCTG CTG GAG \nAGG TTA TTC \nCTC \n52 59.8 \nnested PCR 302 bp\n-MHC-F \nCTT CAA CCA \nCCA CAT GTT \nCGT G \n50 60.3 \n-MHC-R \nTCA CCC CTG \nGAG ACT TTG \nTCT \n52 59.8 \nRT-PCR 587 bp\n-MHC-F \nGAG GGC ATT \nGAG TGG ACA \nTTC \n52 59.8 \n-MHC-R \nCTT TCT TTG \nCCT TGC CTT \nTGC C \n50 60.3 \nnested PCR 412 bp\nMyoD-F \nAGT GAA TGA \nGGC CTT CGA \nGAC \n52 59.8 \nMyoD-R \nCTG GGT TCC \nCTG TTC TGT \nGT \n55 59.4 \nRT-PCR 513 bp\nMyoD-F \nTAC CCA AGG \nTGG AGA TCC \nTG \n55 59.4 \nMyoD-R \nGTG GTG CAT \nCTG CCA AAA \nGC \n55 59.4 \nnested PCR 392 bp\nMyoG-F \nAGC TGT ATG \nAGA CAT CCC \nCCT \n52 59.8 \nMyoG-R \nACG ATG GAC \nGTA AGG GAG \nTG \n55 59.4 \nRT-PCR 608 bp\nMyoG-F \nACC AGG AGC \nCCC ACT TCT \nAT \n55 59.4 \nMyoG-R \nGCG CAG GAT \nCTC CAC TTT \nAG \n55 59.4 \nnested PCR 337 bp\nF and R indicate forward and reverse primers, respectively. Tm: an-\nnealing temperature (C); bp: base pair. \nTable 2. Correlation matrix of mRNA expression levels in \nP19CL6 and H9C2 (2-1) cells, and skeletal muscle, adult heart \nand embryonic heart tissue samples, as analyzed by microarray \nanalysis. \nSamples H9C2 (2-1) Skeletal muscle Adult heart\nEmbryonic \nheart \nP19CL6 -0.058* -0.154** -0.210** 0.007 \nH9C2 (2-1) -- 0.031 0.175** -0.023 \nSkeletal muscle -- -- 0.299** -0.024 \nAdult heart -- -- -- 0.373**\nMicroarray data was reduced by linear analysis using LLAMA and the \ndata analyzed by PCA, with the data fitted to 5 components (explaining \n100% of the cumulative variance).  *P<0.05; **P <0.001. \n \nthat the P19CL6 cells are subject to phenotypic drift with \ntime in culture, and hence may not represent a stable \ncardiomyocyte phenotype. In addition, while P19CL6 \ncells expressed the aforementioned transcript markers of \ncardiac phenotype (-MHC, -MHC), they also ex- \npressed transcript markers for a skeletal muscle pheno- \ntype (MyoD and myogenin), again suggestive of a mixed \ncardiac\/skeletal muscle phenotype. Whereas examination \nof single markers can give an indication of the potential \nphenotype for a cell-line they are not necessarily indica-\ntive of a fully functioning biological system. For example, \nliver cell-lines such as HepG2 have been validated for use \nin drug screening as hosts for both reporter genes and \nmarker transcripts [26,27]; however, in-depth analysis \ndemonstrates that this validation is simplified, with \nHepG2 cells unable to support some genome-based \ntranscriptional activation and for the transcriptome to be \nmarkedly affected by culture conditions [28,29]. There-\nfore whereas low complexity measurements may be \nsuitable for validation of cell-lines for use in individual \nassays, approaches such as transcriptome\/proteome \nanalysis are more appropriate to fully characterize cell- \nlines [30]; anchoring this data to known phenotypic \nmarkers then allows an accurate assessment of the ap-\npropriateness of any cell-line to the in vivo system they \nare supposed to be modelling [31]. Transcriptome analy-\nsis of P19CL6 cells demonstrated significant differences \nin the transcript profile between these cells and other \nsamples, including importantly both embryonic and adult \ncardiac cells. Gene Ontology over-representation analysis \nsuggests that these transcripts are linked to biological \npathways associated with cellular metabolism, an inter-\nesting observation since it is generally accepted that car-\ndiac muscle cells have specific metabolic processes that \ndifferentiate embryonic and adult cardiomyocytes, and \nalso skeletal and cardiac muscle cells. \nIn conclusion, we have both undertaken physiological \nand transcriptome analysis of P19CL6 cells, assessing \ntheir suitability as models of cardiomyocytes for in vitro \nexperimentation. Our data suggests that whereas the \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                  http:\/\/www.scirp.org\/journal\/HEALTH\/\n30 \nOpenly accessible at  \nP19CL6 cell-line has some phenotypic similarities to \ncardiomyocytes (e.g. the ability to pulse) there exist sig-\nnificant differences between these cells and the in vivo \nsituation. Our observations clearly demonstrate that the \nP19CL6 cell line does not maintain a robust cardia- \nmyocyte phenotype as shown by the loss of cell beating \nwith time in culture. In addition, transcriptome analysis \nclearly shows that even freshly differentiated cells do not \nexhibit a clear cardiac or muscle transcript profile, further \nquestioning the utility of P19CL6 as a model system for \nthe study of cardiomyocyte physiology. \n5. ACKNOWLEDGMENTS \nTechnical advice and guidance on cDNA microarray work from Dr \nGiselda Bucca and Prof. Colin Smith, and Dr George Kass with mi-\ncroscopy, in the Faculty of Health and Medical Sciences, University of \nSurrey are gratefully acknowledged. Mr Ben Routley and Dr Mark \nMuldoon (The School of Mathematics, University of Manchester) \nprovided valuable assistance in the use and interpretation of Live Linear \nAnalysis of MicroArray (LLAMA) for analysis of microarray data. Mr \nPeter Kentish helped with the animal tissue studies. Financial support \nfor this study was provided by the Iranian Ministry of Health and \nMedical Sciences and the Hamedan University of Medical Sciences. \nREFERENCES \n[1] Van der Heyden, M.A. and Defize, L.H. (2003) Twenty \none years of P19 cells: what an embryonal carcinoma cell \nline taught us about cardiomyocyte differentiation. Car-\ndiovascular Research, 58, 292-302.  \n[2] Anisimov, S.V., Tarasov, K.V., Riordon, D., Wobus, A.M., \nand Boheler, K.R. (2002) SAGE identification of differ-\nentiation responsive genes in P19 embryonic cells induced \nto form cardiomyocytes in vitro. Mechanisms of Devel-\nopment, 117, 25-74.  \n[3] McBurney, M.W., Jones-Villeneuve, E.M., Edwards, M.K. \nand Anderson, P.J. (1982) Control of muscle and neuronal \ndifferentiation in a cultured embryonal carcinoma cell line. \nNature, 299, 165-167 \n[4] McBurney, M.W. (1993) P19 embryonal carcinoma cells. \nInternational Journal of Developmental Biology, 37, \n135-140.  \n[5] Skerjanc, I.S. (1999) Cardiac and skeletal muscle devel-\nopment in P19 embryonal carcinoma cells. Trends Car-\ndiovascular Medicine, 9, 139-143.  \n[6] Skerjanc, I.S., Petropoulos, H., Ridgeway, A.G. and Wil-\nton, S. (1998) Myocyte enhancer factor 2C and Nkx2-5 \nup-regulate each other's expression and initiate cardio-\nmyogenesis in P19 cells. Journal of Biological Chemistry, \n273, 34904-34910.  \n[7] Wobus, A.M., Kleppisch, T., Maltsev, V. and Hescheler, J. \n(1994) Cardiomyocyte like cells differentiated in vitro \nfrom embryonic carcinoma cells P19 are characterized by \nfunctional expression of adrenoceptors and Ca2+ channels. \nIn Vitro Cellular Development and Biology, 30A, \n425-434.  \n[8] Rudnicki, M.A., Jackowski, G., Saggin, L. and McBurney, \nM.W. (1990) Actin and myosin expression during devel-\nopment of cardiac muscle from cultured embryonal car-\ncinoma cells. Developmental Biology, 138, 348-358.  \n[9] Habara-Ohkubo, A. (1996) Differentiation of beating \ncardiac muscle cells from a derivative of P19 embryonal \ncarcinoma cells. Cell Structure and Function, 21, \n101-110.  \n[10] Van der Heyden, M.A., van Kempen, M.J., Tsuji, Y., Rook, \nM.B., Jongsma, H.J. and Opthof, T. (2003) P19 embryonal \ncarcinoma cells: a suitable model system for cardiac \nelectrophysiological differentiation at the molecular and \nfunctional level. Cardiovascular Research, 58, 410-422.  \n[11] Eaton, S., Chatziandreou, I., Krywawych, S., Pen, S., \nClayton, P.T. and Hussain, K. (2003) Short-chain \n3-hydroxyacyl-CoA dehydrogenase deficiency associated \nwith hyperinsulinism: a novel glucose-fatty acid cycle? \nBiochemical Society Transactions, 31, 1137-1139.  \n[12] Monzen, K., Hiroi, Y., Kudoh, S., Akazawa, H., Oka, T., \nTakimoto, E., Hayashi, D., Hosoda, T., Kawabata, M., \nMiyazono, K., Ishii, S., Yazaki, Y., Nagai, R. and Komuro, \nI. (2001) Smads, TAK1, and their common target ATF-2 \nplay a critical role in cardiomyocyte differentiation. \nJournal of Cell Biology, 153, 687-698.  \n[13] Paquin, J., Danalache, B.A., Jankowski, M., McCann, \nS.M. and Gutkowska, J. (2002) Oxytocin induces differ-\nentiation of P19 embryonic stem cells to cardiomyocytes. \nProceedings of the National Academy of Sciences USA, 99, \n9550-9555.  \n[14] Peng, C.F., Wei, Y., Levsky, J.M., McDonald, T.V., Childs, \nG. and Kitsis, R.N. (2002) Microarray analysis of global \nchanges in gene expression during cardiac myocyte dif-\nferentiation. Physioogical Genomics, 9, 145-155.  \n[15] Ridgeway, A.G., Wilton, S. and Skerjanc, I.S. (2000). \nMyocyte enhancer factor 2C and myogenin up-regulate \neach other's expression and induce the development of \nskeletal muscle in P19 cells. Journal of Biological \nChemistry, 275, 41-46.  \n[16] Young, D.A., Gavrilov, S., Pennington, C.J., Nuttall, R.K., \nEdwards, D.R., Kitsis, R.N. and Clark, I.M. (2004) Ex-\npression of metalloproteinases and inhibitors in the dif-\nferentiation of P19CL6 cells into cardiac myocytes. Bio-\nchemical and Biophysical Research Communications, 322, \n759-765.  \n[17] Morley, P. and Whitfield, J.F. (1993) The differentiation \ninducer, dimethyl sulfoxide, transiently increases the in-\ntracellular calcium ion concentration in various cell types. \nJournal of Cellular Physiology, 156, 219-225.  \n[18] Newton, C.A. and Graham, A. (1997) PCR. BIOS Scien-\ntific Publishers Ltd, Oxford.  \n[19] Goldsmith, Z.G. and Dhanasekaran, N. (2004) The mi-\ncrorevolution: applications and impacts of microarray \ntechnology on molecular biology and medicine. Interna-\ntional Journal of Molecular Medicine, 13, 483-495.  \n[20] Vinciotti, V., Khanin, R., D'Alimonte, D., Liu, X., Cattini, \nN., Hotchkiss, G., Bucca, G., de Jesus, O., Rasaiyaah, J., \nSmith, C.P., Kellam, P. and Wit, E. (2005) An experi-\nmental evaluation of a loop versus a reference design for \ntwo-channel microarrays. Bioinformatics, 21, 492-501.  \n[21] Wit, E. and McClure, J. (2004) Statistics for microarrays: \ndesign, analysis, and inference. John Wiley & Sons Ltd.. \nChichester, United Kingdom.  \n[22] Dobbin, K. and Simon, R. (2002) Comparison of mi-\ncroarray designs for class comparison and class discovery. \nBioinformatics, 18, 1438-1445.  \nI. Khodadadi et al. \/ HEALTH 2 (2010) 24-31 \nSciRes Copyright © 2010                                 http:\/\/www.scirp.org\/journal\/HEALTH\/Openly accessible at  \n31\n[23] Simon, R., Radmacher, M.D. and Dobbin, K. (2002) \nDesign of studies using DNA microarrays. Genetic \nEpidemiology, 23, 21-36.  \n[24] Dennis, G., Sherman, B.T., Hosack, D.A., Yang, J., Gao, \nW., Lane, H.C. and Lempicki, R.A. (2003) DAVID: Da-\ntabase for Annotation, Visualization, and Integrated Dis-\ncovery. Genome Biology, 4, 3.  \n[25] Rudnicki, M.A., Sawtell, N.M., Reuhl, K.R., Berg, R., \nCraig, J.C., Jardine, K., Lessard, J.L. and McBurney, M.W. \n(1990) Smooth muscle actin expression during P19 em-\nbryonal carcinoma differentiation in cell culture. Journal \nof Cellular Physiology, 142, 89-98.  \n[26] El-Sankary, W., Gibson, G.G., Ayrton, A. and Plant, N.J. \n(2001) Use of a reporter gene assay to predict and rank the \npotency and efficacy of CYP3A4 inducers. Drug Me-\ntabolism & Disposition, 29, 1-6.  \n[27] Morgan, K.T., Ni, H., Brown, H.R., Yoon, L., Qualls, \nC.W., Crosby, L.M., Reynolds, R., Gaskill, B., Anderson, \nS.P., Kepler, T.B., Brainard, T., Liv, N., Easton, M., \nMerrill, C., Creech, D., Sprenger, D., Conner, G., Johnson, \nP.R., Fox, T., Sartor, M., Richard,E., Kuruvilla, S., Casey, \nW. and Benavides, G. (2002) Application of cDNA mi \ncroarray technology to in vitro toxicology and the selec-\ntion of genes for a real-time RT-PCR based screen for \noxidative stress in Hep G2 cells. Toxicologic Pathology, \n30, 435-451.  \n[28] Morgan, K.T., Casey, W., Easton, M., Creech, D., Ni, H., \nYoon, L., Anderson, S., Qualls, C.W., Crosby, L.M., \nMacPherson, A., Bloomfield, P. and Elston, T.C. (2003) \nFrequent sampling reveals dynamic responses by the \ntranscriptome to routine media replacement in HepG2 \ncells. Toxicologic Pathology, 31, 448-461.  \n[29] Phillips, A., Hood, S.R., Gibson, G.G. and Plant, N.J. \n(2005) Impact of transcription factor profile and chroma-\ntin conformation on human hepatocyte CYP3A gene ex-\npression. Drug Metabolism and Disposition, 33, 233-242.  \n[30] Plant, N. (2004) Strategies for using in vitro screens in \ndrug metabolism. Drug Discovery Today, 9, 328-336.  \n[31] uo, W., Fan, W., Xie, H., Jing, L., Ricicki, E., Vouros, P., \nZhao, L.P. and Zarbl, H. (2005) Phenotypic anchoring of \nglobal gene expression profiles induced by N-hydroxy-4 \nacetylaminobiphenyl and benzo[a]pyrene diol epoxide \nreveals correlations between expression profiles and \nmechanism of toxicity. Chemical Research in Toxicology, \n18, 619-629.  \n[32] [Laderas, T. and McWeeney, S. (2007) Consensus \nframework for exploring microarray data using multiple \nclustering methods. OMICS, 11, 116-128 \n[33] Smyth, G.K. (2005) Linear Models and Empirical Bayes \nMethods for Assessing Differential Expression in Mi-\ncroarray Experiments. Statistical Applications in Genetics \nand Molecular Biology, 3, 1-26.  \n[34] Kimes, B.W. and Brandt, B.L. (1976) Properties of a \nclonal muscle cell line from rat heart. Experimental Cell \nResearch, 98, 367-381.  \n[35] Buckingham, M. (2001) Skeletal muscle formation in \nvertebrates. Current Opinion in Genetics & Development, \n11, 440-448.  \n[36] Gulick, J., Subramaniam, A., Neumann, J. and Robbins, J. \n(1991) Isolation and characterization of the mouse cardiac \nmyosin heavy chain genes. Journal of Biological Chem-\nistry, 266, 9180-9185.  \n[37] Metzger, J.M., Lin, W.I., Johnston, R.A., Westfall, M.V. \nand Samuelson, L.C. (1995) Myosin heavy chain expres-\nsion in contracting myocytes isolated during embryonic \nstem cell cardiogenesis. Circulation Research, 76, \n710-719.  \n[38] Sabourin, L.A. and Rudnicki, M.A. (2000) The molecular \nregulation of myogenesis. Clinical genetics, 57, 16-25. \n \n \n \nABBREVIATIONS \n \n \nANOVA: Analysis of variance;  \nDMSO: Dimethyl sulphoxide;  \nRT-PCR: Reverse transcriptase polymerase chain reaction;  \nPCA: Principle components analysis;  \nPLS: Partial least squares regression;  \nLLAMA: Live Linear Analysis of MicroArray.\n \n \n"}