{"doi":"10.1016\/S0022-5193(89)80073-6","coreId":"96947","oai":"oai:generic.eprints.org:527\/core69","identifiers":["oai:generic.eprints.org:527\/core69","10.1016\/S0022-5193(89)80073-6"],"title":"Splitting of cell clusters and bifurcation of bryozoan branches","authors":["Goldwasser, L.","Maini, P. K.","Murray, J. D."],"enrichments":{"references":[{"id":811596,"title":"A pre-pattern formation mechanism for animal coat patterns..\/,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":811201,"title":"A turn in the right direction: simulation of erect spiral growth in the bryozoans Archimedes and Bugula.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":809464,"title":"Branch geometry and effective leaf area: A study of Terminaliabranching pattern. 1. Theoretical trees.","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":813554,"title":"Branching and modular growth: Theoretical models and empirical patterns. In: Population Biology and Evolution of Cfonal Organisms","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":810037,"title":"Branching patterns, generating rules, and astogenetic rajectories in arborescent bryozoans.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":809010,"title":"Bud size alone does not control bifurcation in Schizoporella unicornisfloridana.","authors":[],"date":"1974","doi":null,"raw":null,"cites":null},{"id":810263,"title":"Cell migration and its directional guidance. In: Cell Interactions and Development: Molecular Mechanisms","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":812040,"title":"Cell traction models for generating pattern and form in morphogenesis.","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":809724,"title":"Computer modelling of branching rowth in the Bryozoan Stomatopora.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":812277,"title":"Computer simulations of early land plant branching morphologies: canalization of patterns during evolution?","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":809038,"title":"Computerized vegetative mobility in rhizomatous plants.","authors":[],"date":"1976","doi":null,"raw":null,"cites":null},{"id":810995,"title":"Contributions ~l'6tude du bourgeonnement t de la croissance des colonies chez Membranipora membranacea (Linn) Bryozoaire chilostome.","authors":[],"date":"1961","doi":null,"raw":null,"cites":null},{"id":810500,"title":"Coupling between reaction-diffusion prepattern and expressed morphogenesis, applied to desmids and dasyclads.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":810728,"title":"Die phototropische R aktion der Zoide von Bugula avicularia.","authors":[],"date":"1963","doi":null,"raw":null,"cites":null},{"id":811855,"title":"Generation of biological pattern and form.","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":811807,"title":"Mathematical Biology.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":812491,"title":"Mechanical aspects of mesenchymal morphogenesis.","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":812737,"title":"Normal and phototropic growth reactions in the marine bryozoan Bugula avicularia, in: The Lower Metazoa.","authors":[],"date":"1963","doi":null,"raw":null,"cites":null},{"id":811487,"title":"The Finite Difference Method in Partial Differential Equations.","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":813276,"title":"The secretion and structure of the skeleton of living and fossil bryozoa.","authors":[],"date":"1972","doi":"10.1098\/rstb.1972.0010","raw":null,"cites":null},{"id":809263,"title":"The simulation of branching patterns in modular organisms.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":810959,"title":"Turing's model and branching tip growth: relation of time and spatial scales in morphogenesis, with application to Micrasterias.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":813056,"title":"Wachstum und Phototropismus bei Moostieren.","authors":[],"date":"1964","doi":"10.1007\/bf00631145","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1989","abstract":"We present a cell mechanical model that exhibits the pattern-forming behaviour of a cluster of cells at the growing tips of bryozoan branches. The crucial event in the production of the overall branching pattern is the splitting of the cluster into two clusters, rather than the formation of the cluster from a uniform distribution. In simulations, the uniform cell distribution initially evolved, as indicated by a linear analysis, either to a spatially patterned state, or to a temporally oscillating state. We suggest that the same processes responsible for the formation and behaviour of the cell cluster may also be responsible for tip branching","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96947.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/527\/1\/10.pdf","pdfHashValue":"1f652d037c06f02e45d9b8ae27d08149e80efb40","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:527<\/identifier><datestamp>\n      2015-05-29T18:23:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/527\/<\/dc:relation><dc:title>\n        Splitting of cell clusters and bifurcation of bryozoan branches<\/dc:title><dc:creator>\n        Goldwasser, L.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Murray, J. D.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        We present a cell mechanical model that exhibits the pattern-forming behaviour of a cluster of cells at the growing tips of bryozoan branches. The crucial event in the production of the overall branching pattern is the splitting of the cluster into two clusters, rather than the formation of the cluster from a uniform distribution. In simulations, the uniform cell distribution initially evolved, as indicated by a linear analysis, either to a spatially patterned state, or to a temporally oscillating state. We suggest that the same processes responsible for the formation and behaviour of the cell cluster may also be responsible for tip branching.<\/dc:description><dc:date>\n        1989<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/527\/1\/10.pdf<\/dc:identifier><dc:identifier>\n          Goldwasser, L. and Maini, P. K. and Murray, J. D.  (1989) Splitting of cell clusters and bifurcation of bryozoan branches.  Journal of Theoretical Biology, 137  (3).   pp. 271-279.      <\/dc:identifier><dc:relation>\n        10.1016\/S0022-5193(89)80073-6<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/527\/","10.1016\/S0022-5193(89)80073-6"],"year":1989,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"Z theom BioL (1989) 137, 271-279 \nSplitting of Cell Clusters and Bifurcation of Bryozoan Branches \nLLOYD GOLDWASSER,t P. K. MAINI:~ AND J. D. MURRAY \nCentre for Mathematical Biology, Mathematical Institute, 24-29 St Giles, \nOxford OX1 3LB, U.K. \n(Received and accepted 24 May 1988) \nWe present a cell mechanical model that exhibits the pattern-forming behaviour of \na cluster of cells at the growing tips of bryozoan branches. The crucial event in the \nproduction of the overall branching pattern is the splitting of the cluster into two \nclusters, rather than the formation of the cluster f om a uniform distribution. In \nsimulations, the uniform cell distribution initially evolved, as indicated by a linear \nanalysis, either to a spatially patterned state, or to a temporally oscillating state. \nWe suggest that the same processes responsible for the formation and behaviour of \nthe cell cluster may also be responsible for tip branching. \n1. Introduction \nBranching structures uch as trees, corals and bryozoans are created by iteration of \ntwo separate processes: the growth of branches and the splitting of one branch into \ntwo. The characteristic and often striking differences in branching structure among \ntaxa result from differences in the timing and location of the splitting events. Those \ndifferences can be modelled phenomenologically b constructing rules for growth \nand branching, and then describing their resulting patterns (for example, Bell, 1976; \nFisher & Honda, 1979; Gardiner & Taylor, 1982; McK.inney & Raup, 1982; Niklas, \n1982; cf. Waller & Steingraeber, 1985; Bell, 1986; Goldwasser, 1988). Such models, \nhowever, do not answer, or even pose, questions about the actual processes that \nunderlie and determine the rules. Other models, such as those of reaction diffusion \nsystems (for example, Lacalli & Harrison, 1987; Harrison & Kolar, 1988), depend \non as yet undiscovered morphogens to establish the branching patterns. In this \npaper we present a mechanical model, based on cellular processes known to be \ninvolved in both branch growth and splitting in arborescent bryozoans, and show \nthat it exhibits both growth and splitting. \nMany models of cellular mechanics (for example, Oster et al., 1983; Murray & \nOster, 1984a, b) investigate the initial formation of pattern as deviations from initially \nuniform conditions; in such cases a linear stability analysis about the uniform steady \nstates provides a reasonably good prediction of the ultimate spatially heterogeneous \npattern formed. For bryozoan growth, however, the pattern-forming event is the \nsplitting of one cluster of cells into two (Schneider, 1963; Schneider & Kaissling, \n1964); and a stability analysis of a non-uniform distribution is rarely possible or \nt Present address: Department of Biological Sciences, Stanford University, Stanford, California 94305,\nU.S.A. \nPresent address: Department of Mathematics, University of Utah, Salt Lake City, Utah 84112, U.S.A. \n271 \n0022-5193\/89\/070271 +09 $03.00\/0 O 1989 Academic Press Limited \n272 L. GOLDWASSER ET AL .  \nfeasible. Here we have used s imulat ions of cell movements to investigate the events \nafter the cluster of  cells is formed. These s imulat ions d isplay not only the format ion \nof  the initial pattern predicted by the model,  but also the subsequent spl itt ing of  \none cluster into two. \n2. Branching in Bryozoans \nGrowth in bryozoans is distal, with new units (zooids) added to the end of  \nbranches regardless of  whether spl itt ing occurs (see Fig. 1). In one of  the few studies \nof  the growing tips of  bryozoans,  Schneider (1963) reported a group of  cells in \nBugula with striking behaviour:  \n\"While there is limited random movement of the individual cells, the degree of cell \nco-ordination is remarkable. All these cells are somehow oriented to the centre of the \ncell plate, which is rhythmically expanding or contracting, or even twisting.\" \nHe concludes, \"How this locomotive activity and co-ord inat ion is brought about \nis quite unknown.\"  Our model  specif ical ly addresses these questions. \nWe focus on the behaviour  of  these cells because o f the i r  effect on both the growth \nand spl itt ing of  the branches (Schneider,  1963; Kaissl ing, 1963; Lutaud, 1961, \nTavener-Smith & Wil l iams, 1972). The cells lie on the inner, domed surface of  a \ngrowing tip, where they secrete the cuticle as the branch grows (Tavener-Smith &\nWil l iams, 1972). The new cuticle is inserted directly into the existing cuticle, as \ni l lustrated in Fig. 2. Older  cuticle at the per iphery o f  the dome becomes calcif ied \nFIG. 1. Diagram of an arborescent bryozoan colony, such as Bugula sp., showing the cells at the \ngrowing tips. The cluster of cells on the rightmost branch has split, and that branch is beginning to form \ntwo daughter branches. For simplicity the branches are depicted as continua rather than as divided into \ndiscrete zooids (which occurs only proximally from the tip). \nBRANCHING IN BRYOZOAN T IPS  273 \nCell_ Adhesive site \n\/ \nMatrix New matrix \nFIG. 2. Diagrammatic cross section through the cuticle at the tip of a bryozoan branch, laid flat. The \ncells sit on the inside surface of the tip and secrete cuticle. The new cuticle is inserted irectly into the \nexisting cuticle, which spreads out, carrying with it the cells and adhesive sites. \nand, after being pushed outward and becoming part of the cylinder of the branch, \nfalls behind the forward-growing tip. The direction of branch elongation depends \non the location of the cells within the tip. Splitting of the cluster into two coincides \nwith the splitting of one branch into two daughter branches (Schneider, 1963). \nA few other details are known about hese cells. They do not themselves reproduce; \nnew cells are recruited proximally from within the branch (Schneider, 1963, Tavener- \nSmith & Williams, 1972). The motion of individual cells is rapid on the time scale \nof branch growth (personal observation). \nWe take the splitting of the cluster of cells to be the initial event in branching, \nand do not attempt o model the subsequent alterations in the shape of the dome \n(Fig. 1) or the establishment of the two independent daughter branches. \n3. Model for Cell Patterning at Tips of Bryozoan Branches \nFor mathematical simplicity, we construct a model on a one-dimensional domain \nto focus on the behaviour of the clusters of cells rather than on the more complex \ndome-like structure of the branch tips. We use r(x, t) for the density of the matrix, \nor cuticle; a(x, t) for the density of adhesive sites; and n(x, t) for the density of \nthe cells at each point x at time t. The cells and the matrix are both observable, \nwhile the adhesive sites are postulated. We introduce the adhesive sites because \nsome attractive ntity is necessary for the production of patterns. In itself, convection \nby the spreading matrix can only tend to break up patterns as it carries cells out of \nthe domain. \nOur model is based essentially on two processes: the spreading of the matrix with \nthe convection of cells and adhesive sites with it, and the secretion of matrix and \nadhesive sites by the cells. The cells thus follow a gradient in adhesive sites--of  \ntheir own creation--as they are carried by the matrix. This scheme is illustrated in \nFig. 2. The movement of cells up such a gradient, known as haptotaxis, is a general \nand widely observed phenomenon i cell behaviour (see, for example, Harris, 1983). \nThe model equations are: \n~n - Ar + c(rr~)x \nrt = (la) \nsecretion calcification convection \n274 L. GOLDWASSER ET AL .  \nbn - Ixa + c(ar,:),~ \na, = (lb) \nsecretion decay convection \nn,= dnxx - h(nax)x + c(nr,). ,  \n(lc) \ndiffusion haptotaxis convection \nwhere subscripts denote partial differentiation. The parameter c represents the rate \nat which the matrix spreads out as new matrix is inserted, and, in the similar terms \nin the second and third equations, the rate at which the adhesive sites and cells are \ncarded with it. The rate of secretion of matrix per cell is ~'; the loss of matrix by \ncalcification is h per unit of matrix. Similarly, in eqn (lb), b represents the rate of \nsecretion of adhesive sites per cell, and the decay of adhesive sites occurs at the \nrate Ix. In eqn (lc), d is the diffusion constant and h is the rate at which cells move \nup a gradient in adhesive sites. Because the cells are motile, unlike the matrix and \nadhesive sites, we include a diffusion term only for the cells. There is no term for \ncell recruitment because these cells are non-mitotic (Schneider, 1963; Tavener-Smith \n& Williams, 1972). We have chosen linear secretion and calcification or decay terms \nfor their simplicity; it is not necessary to invoke more complicated behaviour to \nproduce the patterns observed. \n4. Linear Analysis for Pattern Initiation \nWe denote the mean cell density throughout the domain by N, the original length \nof the domain by Lo, and its current length by L. We make the following non- \ndimensional substitutions: \nn* = n \/N ,  a* = ah\/( ixLo) ,  \nt* = t~LU t, 2, ~, = L~\/  Lo ,  \nb* = bhN\/ IX2L  2, \nr* = rc\/( ixL2), x* = x~ L, \ncN~\/( IX-Lo),  A* = A\/p., \nd* = d\/ ( ixLo) .  \n(2) \nThe resulting non-dimensional system becomes, on dropping the asterisks for nota- \ntional convenience, \nrt = y (~n-  Ar) +(rr~)x (3a) \na, = 3,(bn - a) + (arx)x (3b) \nn, = dnxx - (nax)x + (nrx)x. (3c) \nIf  n is constant over the domain, then the non-dimensionalization eqn (2) implies \nthat n = 1. The uniform steady states for (r, a, n) are (0, 0, 0) and (~'\/A, b, 1); the \nlatter is the biologically relevant one. We linearize about this steady state and look \nfor solutions of the form: \n1 \na -b  |ocexp [o-t+ ik.x], \n\/ n- l ]  \nwhere k is the wave number of the perturbation (which is inversely proportional to \nthe wavelength of the perturbation), and or the rate of growth of perturbation with \nwave number k. When Re (tr) is positive the perturbation grows; when Re (o-) is \nBRANCHING IN BRYOZOAN T iPS  275 \nnegative it decreases. Substitution of this form into the linear equations gives the \nfollowing dispersion relation between k and o-: \n0-3+ [(d + ~\/A)k2+ y(A + 1)]trz + [d¢k4\/A + k2y(~'\/A + dA + st+ d - b) + y2A ]o- \n+ [k*3~(d\/X + b - b\/X ) + k232(dX + ~ - bX)] = 0 (4) \nIn the spatially uniform situation, when k = 0, the dispersion relation reduces to \no-3+ y(X + 1)o'2+ y2Ao\" =0, \nwhich has the solution o- = 0 with the other two roots being negative. Because no \nroots are positive, the system is stable to spatially homogeneous solutions. When \nk ~ 0, the cubic eqn (4) has either three real roots for o- or one real root and two \n~- (a i  \nI I I * \nI I \ni \nI . . \/  I \n(b) \nt I * \nFIG. 3. (a) A typical dispersion relation. Parameter values: d = I0, b = 200, a =20, y = 12, ~'= 10. For \nlow values of k the real root ( ) is both positive and greater than the real part of the complex \nroots. For larger k, the real part of the complex roots ( . . . .  ) is greater than the real root but still \nnegative; these disturbances do not grow. (b) A dispersion relation in which a complex eigenvalue has \na real part positive and greater than the real eigenvalue of that wave number. The complex part suggests \ntemporal wave-like oscillations. \n276 L. GOLDWASSER ET AL .  \ncomplex conjugate roots. The behaviour of a disturbance with wave number k \ndepends on the sign of the real part of that root of eqn (4) (real or imaginary) \nwhose real part is greatest. When that greatest real part is positive, the disturbance \ngrows. For some values of the parameters, the root with greatest real part is real \nand positive for a range of k, suggesting that the initially uniform cell distribution \nwill evolve to a spatially heterogeneous one. Figure 3(a) shows a dispersion relation \nin such a case. For some values of the parameters, however, some values of k give \ncomplex roots cr whose real part is both positive and greater than the real root for \nthat k. In such cases, the complex root determines not only whether that mode \ngrows but also that its behaviour is oscillatory (cf. Murray, in press). Figure 3(b) \nshows a dispersion relation in which there is a range of k for which cr is complex \nand has a positive real part which is greater than the positive real root. \nAlthough we can identify the fastest-growing wave number, kin, linear growth is \nindicated with other wave numbers. From eqn (4) it can be shown that all modes with \n0 < k < [(ba - da - ~) l (d la  + b - b la  )]3,\/s r \nexhibit exponential growth. It is not possible to adjust the parameters, as is typical \nin linear theory of most pattern formation models (Murray, in press), to isolate one \nwave number for growth while all others decay. The dispersion relation tr = or(k) \npasses through the origin for all values of the parameters: this tethering to the origin \nis a direct consequence of the lack of mitosis (Schneider, 1963; Tavener-Smith &\nWilliams, 1972) among the tip cells. Here, whenever pattern can form, there is a \nrange of many growing wave numbers; the analysis can only single out the wave \nnumber that initially grows fastest. In this case the boundary conditions may play \na crucial role in determining which pattern develops. Although linear theory provides \na predictive guide, numerical simulations are required to produce the spatial patterns \nthat are solutions of the full non-linear system. \n5. Numerical Simulations for Spatial Patterns \nFor the simulations we used a simple upwind scheme--a type of Galerkin method \n(Mitchell & Griltiths 1980)--that we found to be stable for a wide range of parameter \nvalues. Considerable care is required in setting the boundary conditions to reflect \nthe developmental process. Although zero-flux conditions were appropriate for the \ncells, which remain within the domain of the tip, the matrix continually spreads \nout of the domain, carrying adhesive sites with it; it was both biologically and \nmathematically necessary for the flux of matrix and adhesive sites to be non-zero. \nStarting with small random perturbations about the non-trivial steady state, the \nsimulations produced the patterns predicted by the linear analysis: either one cell \ncluster, when km =r  r, or two clusters when k,,, =2rr. Although such results are \ncommon in studies of pattern formation, they are less informative here. The sig- \nnificant occurrence here is not the initial formation of a cluster--which exists for \nmost of the duration of a branch--but  the splitting of that cluster into two clusters \nthat subsequently diverge as the daughter branches grow out. Changes in a pattern \nafter its initial growth from uniform conditions can be due only to non-linearities \n(o)  \nBRANCHING IN  BRYOZOAN T IPS  \n\"W \n277 \n(b)  \nL \n(c )  \nFIG. 4. Simulation showing the formation, from initial conditions (a), of two clusters of cells (b), \ntheir merging (c), and their subsequent splitting (d). \nin the model; here, the non-linear convective matrix term alters the stability of the \ncluster of cells, making splitting possible. \nThe interesting and important feature of the model is that it produced splitting \nof a fo rmed cluster of cells. Unexpectedly, splitting occurred not only when k,, = 27r \n(two clusters form initially), but also when k,, = 7r (one cluster forms initially). Thus \na single set of parameter values can produce a single cluster arising from random \nperturbations about uniform initial conditions and its subsequent splitting into two \nclusters. \nThe presence of growing modes with complex eigenvalues indicates the possibility \nof oscillations or travelling waves. Indeed, in some simulations, two initial clusters \nmerged into a single cluster and then split into two again (Fig. 4). The model and \nsimulations can thus capture much that is known about he movements of these cells. \n6. Discussion \nMost models of pattern formation are concerned with the production of pattern \nfrom initially uniform conditions. This model exhibits such capabilities as well as \nthe more complex emergence of new patterns from an already patterned state. \n278 L. GOLDWASSER ET AL .  \nOur model suggests that the mechanism involved in the splitting of bryozoan \nbranches is the same as that involved in normal branch elongation: branching is \nthus a natural extension of growth. Importantly, splitting may occur without change \nin parameter values. \nMany of the patterns produced were transients rather than steady state solutions. \nBranching occurs whenever the cluster splits, even if the distribution is not a steady \nstate; the splitting is marked by daughter branches at that point. The transient \nbehaviour of the cells thus affects the subsequent form of a bryozoan colony, and \nthe colony preserves a history of their behaviour. \nOscillatory and wave behaviour have also been observed in the cells at the tips \nof the encrusting bryozoan Membranipora membranacea (Lutaud, 1961). Although \nthe cells are fixed on the inner surface of the cuticle, waves of cell movement sweep \nacross them from one side of the tip to the other. In this case splitting is associated \nwith the breaking up of one wave into two waves. \nThe co-ordination of movements of the cells, remarked upon by Schneider (1963), \nis produced in this model by each cell acting only according to its local conditions; \nthere is no need for long-range transmission of information or a single source of \ninformation to guide their movements. \nMost of the components of our model are well documented in the literature. We \npostulate the existence of adhesive sites to provide an aggregating force that counters \nthe convective ffects othe spreading matrix. The decay of the adhesive sites also \nseems plausible and is necessary for pattern formation. A chemo-attractant with \nsimilar behaviour would of course produce similar patterns. \nThe rate of convection may actually depend on the number of cells between each \npoint and the centre of the domain, rather than on the gradient in matrix density. \nHowever, we do not pursue this refinement at this stage. Nor does our model address \nthe subsequent events, triggered by the splitting of the cell cluster, that are responsible \nfor the establishment and geometry of the two independent daughter branches. \nIt is well known that widening the domain affects the formation of pattern (see, \nfor example, Murray, 1981, in press). In encrusting bryozoans the width of the tip \naffects the probability of branching (Banta & Holden, 1974), and a gradual widening \nof branches from one bifurcation to the next has been seen in some Bugula (personal \nobservation). Such changes can be reflected in our model by increasing % which is \na measure of scale [see eqn (2)], as a branch grows. \nAlthough the cells at the branch tips do not divide, their number is not constant: \nrecruitment from proximal regions of the branch balances the halving that occurs \nduring branching. Our non-dimensionalized variables ~ and b increase linearly with \nN, the mean density of cells; and the dispersion relation and fastest growing \nwavenumber km change with them. The magnitude and even the direction of the \nchange in km depends on the particular values of the other parameters. In the model \nhere we have kept N constant because the recruitment of cells is slow relative to \nthe time scale of their motions. In further studies we intend to investigate the patterns \nformed as N increases during branch growth. It would also be interesting to consider \na more realistic dome-shaped tip. The present model, however, seems to capture \nthe principal elements of tip branching. \nBRANCHING IN BRYOZOAN TIPS 279 \nL. G. and P. K. M. would like to acknowledge support of the Science and Engineering \nResearch Council of Great Britain through a grant (GR\/C\/13573) to the Centre for Mathe- \nmatical Biology, University of Oxford. We also wish to thank Professor Y. Hosono and Drs. \nV. S. Manoranjan and P. Grindrod for helpful discussions. \nREFERENCES \nBANTA, W. C. & HOLDEN, P. M. (1974). Bud size alone does not control bifurcation in Schizoporella \nunicornisfloridana. (Bryozoa, Cheilostomata). Chesapeake Sci. 15, 104-109. \nBELL, A. (1976). Computerized vegetative mobility in rhizomatous plants. In: Automata, Languages, \nDevelopment (Lindemayer, A. & Rozenberg, G., eds) pp. 3-14. Holland: North-Holland. \nBELL, A. D. (1986). The simulation of branching patterns in modular organisms. Phil. Trans. R. Soc. \nLond. B313, 143-159. \nFISHER, J. B. & HONDA, H. (1979). Branch geometry and effective leaf area: A study of Terminalia- \nbranching pattern. 1. Theoretical trees. Am. J. Bot. 66, 633-644. \nGARDINER, A. R. & TAYLOR, P. D. (1982). Computer modelling of branching rowth in the Bryozoan \nStomatopora. N. .lb. Geol. Palaont. Abh. 163, 389-416. \nGOLDWASSER, L. (1988). Branching patterns, generating rules, and astogenetic rajectories in arborescent \nbryozoans. Jr theor. Biol. 132, 179-201. \nHARRIS, A. K. (1983). Cell migration and its directional guidance. In: Cell Interactions and Development: \nMolecular Mechanisms (K. Yamada, ed.) pp. 123-151. New York: Wiley. \nHARRISON, L. G. & KOLAI~, M. (1988). Coupling between reaction-diffusion prepattern and expressed \nmorphogenesis, applied to desmids and dasyclads. J. theor. Biol. 130, 493-515. \nKAISSLING, K.-E. (1963). Die phototropische R aktion der Zoide von Bugula avicularia. L. Z. Vergl. \nPhysiol. 46, 541-594. \nLACALLI, T. C. & HARRISON, L. G. (1987). Turing's model and branching tip growth: relation of time \nand spatial scales in morphogenesis, with application to Micrasterias. Can. J. Botany. 65, 1308-1319. \nLUTAUD, G. (1961). Contributions ~l'6tude du bourgeonnement t de la croissance des colonies chez \nMembranipora membranacea (Linn) Bryozoaire chilostome. Ann. Soc. r. zool. Belg. 91, 157-300. \nMCKINNEY, F. K. & RAUP, D. M. (1982). A turn in the right direction: simulation of erect spiral growth \nin the bryozoans Archimedes and Bugula. Paleobiology 8, 101-112. \nMITCHELL, A. R. & GRIFEITHS, D. F. (1980). The Finite Difference Method in Partial Differential \nEquations. Chichester: Wiley. \nMURRAY, J. D. (1981). A pre-pattern formation mechanism for animal coat patterns..\/, theor. Biol. 88, \n161-199. \nMURRAY, J. D. (1988). Mathematical Biology. Heidelberg: Springer (in press). \nMURRAY, J. D. & OSTER, G. F. (1984a). Generation of biological pattern and form. IMA J. Math. Appl. \nin Medic. & Biol. l, 51-75. \nMURRAY, J. D. & OSTER, G. F. (1984b). Cell traction models for generating pattern and form in \nmorphogenesis. J. math. Biol. 19, 265-279. \nNIKLAS, K. J. (1982). Computer simulations of early land plant branching morphologies: canalization \nof patterns during evolution? Paleobiology 8, 196-210. \nOSTER, G. F., MURRAY, J. D., & HARRIS, A. K. (1983). Mechanical aspects of mesenchymal mor- \nphogenesis. J. Embryol. exp. Morph. 78, 83-125. \nSCHNEIDER, D. (1963). Normal and phototropic growth reactions in the marine bryozoan Bugula \navicularia, in: The Lower Metazoa. (E. C. Dougherty, ed.) pp. 357-371. Berkeley: University of \nCalifornia Press. \nSCHNEIDER, D. & KAISSLING, K.-E. (1964). Wachstum und Phototropismus bei Moostieren. Natur- \nwissenschaften 51, 127-134. \nTAVENER-SMITH, R. & WILLIAMS, A. (1972). The secretion and structure of the skeleton of living and \nfossil bryozoa. Phil. Trans. Royal Soc. Lond. B264, 97-159. \nWALLER, D. M. & STEINGRAEBER, D. A. (1985). Branching and modular growth: Theoretical models \nand empirical patterns. In: Population Biology and Evolution of Cfonal Organisms (J. B. C. Jackson, \nL. W. Buss & R. E. Cook, eds) pp. 225-257. New Haven: Yale University Press. \n"}