{"doi":"10.1063\/1.2757608","coreId":"100627","oai":"oai:epubs.surrey.ac.uk:21","identifiers":["oai:epubs.surrey.ac.uk:21","10.1063\/1.2757608"],"title":"Rearrangement of the oxide-semiconductor interface in annealed Al2O3\/4H-SiC structures","authors":["Avice, M","Diplas, S","Thogersen, A","Christensen, JS","Grossner, U","Svensson, BG","Nilsen, O","Fjellvag, H","Watts, JF"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-07-30","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:21<\/identifier><datestamp>\n      2017-10-31T13:56:22Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D6563686D65646165726F656E67696E656572696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/21\/<\/dc:relation><dc:title>\n        Rearrangement of the oxide-semiconductor interface in annealed Al2O3\/4H-SiC structures<\/dc:title><dc:creator>\n        Avice, M<\/dc:creator><dc:creator>\n        Diplas, S<\/dc:creator><dc:creator>\n        Thogersen, A<\/dc:creator><dc:creator>\n        Christensen, JS<\/dc:creator><dc:creator>\n        Grossner, U<\/dc:creator><dc:creator>\n        Svensson, BG<\/dc:creator><dc:creator>\n        Nilsen, O<\/dc:creator><dc:creator>\n        Fjellvag, H<\/dc:creator><dc:creator>\n        Watts, JF<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2007-07-30<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/21\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Avice, M, Diplas, S, Thogersen, A, Christensen, JS, Grossner, U, Svensson, BG, Nilsen, O, Fjellvag, H and Watts, JF  (2007) Rearrangement of the oxide-semiconductor interface in annealed Al2O3\/4H-SiC structures   APPLIED PHYSICS LETTERS, 91 (5), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2757608<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/21\/","10.1063\/1.2757608"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Rearrangement of the oxide-semiconductor interface in annealed\nAl2O3\/4H-SiC structures\nM. Avice, S. Diplas, A. Thøgersen, J. S. Christensen, U. Grossner,a\u0001 and B. G. Svensson\nPhysics Department and Centre for Materials Science and Nanotechnology (SMN), University of Oslo,\nP.O. Box 1048, Blindern, Oslo 0316, Norway\nO. Nilsen and H. Fjellvåg\nChemistry Department and Centre for Materials Science and Nanotechnology (SMN), University of Oslo,\nP.O. Box 1033, Blindern, Oslo 0315, Norway\nJ. F. Watts\nSurrey Materials Institute and School of Engineering, University of Surrey, GU2 7XH, Guildford, Surrey,\nUnited Kingdom\n\u0001Received 16 March 2007; accepted 21 June 2007; published online 31 July 2007\u0002\nAl2O3 films with different thicknesses have been deposited on n-type \u0001nitrogen-doped\u0002\n4H-SiC\u00010001\u0002 epitaxial samples by atomic layer chemical vapor deposition at 300 °C and\nsubsequently annealed in Ar atmosphere at temperatures up to 1000 °C. The Al2O3\/4H-SiC\nstructures were analyzed by x-ray photoelectron spectroscopy \u0001XPS\u0002, secondary ion mass\nspectrometry \u0001SIMS\u0002, and transmission electron microscopy \u0001TEM\u0002. The XPS and SIMS results\nindicate that the average composition in the wider interface area does not significantly change due\nto the annealing. However, as revealed by the TEM investigations in combination with XPS, the\nas-grown samples exhibit a double interface created by an intermediate suboxide SiOx layer\n\u0001x\u00012\u0002. After annealing, this intermediate suboxide layer breaks up and transforms into SiO2 islands,\nresulting in a rather rough interface region and a high concentration of pure Si in the Al2O3 film.\nFurthermore, a pronounced accumulation of H is found in the rough interface region and this may\nplay a key role for the low density of shallow electron states reported for annealed Al2O3\/4H-SiC\nstructures. © 2007 American Institute of Physics. \u0003DOI: 10.1063\/1.2757608\u0004\nBecause of its wide band gap \u0001\u00053.2 eV for polytype\n4H\u0002, SiC is suitable for applications related to high power,\nhigh frequency, and high temperatures. In recent years, in-\nvestigations for alternative dielectrics for device applications\nhave become of great interest. Al2O3 is one of the few pure\nmetal oxides exhibiting a high dielectric constant \u0001\u0002\u000510\u0002, a\nrelatively wide band gap \u0001Eg\u00056.2 eV\u0002, and a good thermal\nstability; moreover, compared to ZrO2 or HfO2 it displays\nhigher conduction and valence band offsets, \u0003Ec=1.7 eV\nand \u0003Ev=1.2 eV, relative to 4H-SiC.\n1,2 It has been shown\nthat high quality Al2O3 films can be grown on SiC by atomic\nlayer chemical vapor deposition \u0001ALCVD\u0002.3 In previous\nstudies,4–6 electrical characterization such as capacitance-\nvoltage \u0001CV\u0002 and thermal dielectric relaxation current mea-\nsurements of Al2O3\/4H-SiC capacitors were reported. In\nfact, annealing in Ar above the crystallization temperature\n\u0001\u0005900 °C\u0002 was found to significantly enhance the electrical\nproperties of the Al2O3\/SiC interface and promote formation\nof the \u0004 phase of Al2O3. Furthermore, it has been revealed\nthat the interface properties of those annealed structures are\nsuperior to the ones of SiO2\/4H-SiC interfaces, since the\ndensity of electron traps close to the conduction band mini-\nmum is reduced,4 as required for improved channel mobility\nin a metal-oxide-SiC field effect transistors. In this study, the\nAl2O3\/4H-SiC interface was investigated on as-grown and\nannealed samples using angle resolved x-ray photoelectron\nspectroscopy \u0001AR-XPS\u0002, transmission electron microscopy\n\u0001TEM\u0002, and secondary ion mass spectrometry \u0001SIMS\u0002. An\nultimate goal is to correlate the structural and compositional\nproperties of the interface with the previously reported elec-\ntrical characteristics.\nThe Al2O3 layers have been grown by ALCVD on Si-\nfaced, n-type 4H-SiC samples with a 10 \u0005m thick epilayer\n\u0001net doping level of 2\u00061015 cm−3\u0002 on a highly doped sub-\nstrate \u0001net doping level of 1\u00061018 cm−3\u0002, oriented 8° off the\n\u00010001\u0002 direction, purchased from Cree, Inc. Details of the\ncleaning and growth procedure can be found elsewhere.4,5\nFor the AR-XPS measurements, 5 and 8 nm thick Al2O3\nlayers were grown while thicker layers \u0001\u0005110–120 nm\u0002\nwere deposited for the TEM and SIMS measurements. An-\nnealing treatments have been carried out in Ar atmosphere at\n1000 °C for 15, 30, and 60 min.\nSIMS \u0001Cameca IMS 7F\u0002 analysis was performed for H,\nC, and Si using cesium as sputtering ions with an impact\nenergy of 15 keV. The ion beam current was 20 nA, and the\nbeam was rastered over an area of 100\u0006100 \u0005m2. Sample\ncharging effects were minimized by electron flooding. Cross-\nsection TEM samples were prepared by ion milling using a\nGatan precision ion polishing system with a 5 kV gun volt-\nage. High resolution images of the Al2O3\/SiC interfaces\nwere taken with an analytical 200 keV JEOL 2010F TEM.\nXPS was performed using a Thermo VG Scientific Sigma\nProbe spectrometer with monochromated Al K\u0007 radiation\n\u0001h\b=1486.6 eV\u0002. This spectrometer is fitted with an angle\nsensitive XPS facility that allows AR-XPS data to be ac-\nquired without repositioning the sample. Spectra were ac-\nquired from bulk and surface regions of the specimen, at\ntakeoff angles, relative to the surface normal, of 28±5° and\n78±5°, respectively, as well as in the so-called angle re-a\u0002Electronic mail: ulrike.grossner@fys.uio.no\nAPPLIED PHYSICS LETTERS 91, 052907 \u00012007\u0002\n0003-6951\/2007\/91\u00025\u0001\/052907\/3\/$23.00 © 2007 American Institute of Physics91, 052907-1\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nsolved mode of 53±18° which provides higher sensitivity at\nan intermediate takeoff angle. The spectra were corrected for\ncharging by using a C 1s value for adventitious carbon of\n284.8 eV.7\nFigure 1 shows Si 2p spectra obtained by AR-XPS in AR\nmode with both as-grown and annealed Al2O3\/4H-SiC\nsamples. We calculated the total thickness of the silicon sub-\noxide, assuming uniform distribution, following the ap-\nproach described in Watts and Wolstenholme8 and using an\ninelastic mean free path value for Si \u0001\tSi\u0002 in SiO2 of\n3.77 nm.9 Both bulk and angle resolved spectra \u0001bulk spectra\nnot shown\u0002 revealed a total thickness of \u00051.2 nm thick Si\nsuboxide between Al2O3 and SiC in the as-grown condition.\nThe intensity of the suboxide was more pronounced in the\nbulk mode indicating its formation at the Al2O3\/SiC inter-\nface. The apparent thickness of the interfacial Si suboxide\nincreases to \u00053 nm after annealing at 1000 °C indepen-\ndently of the annealing duration \u000115, 30, and 60 min\u0002, assum-\ning again uniform distribution. The formation of this interfa-\ncial layer in the as-deposited samples is attributed to the\nexposure of the Si face to O3 treatment prior to oxide depo-\nsition. Steric hindrance effect may also be enhanced by using\nSiC substrate orientated 8° off the \u00010001\u0002 direction in com-\nparison to the Si \u0001111\u0002 surface.\nSi 2p spectra of the annealed samples exhibit a more\nintense Si4+ peak compared to the suboxide peaks indicative\nof SiO2 formation. Hence, a further oxidation of the silicon\nsuboxide during the annealing procedure is suggested. Fur-\nthermore, the presence of pure Si after annealing is shown in\nFig. 1 by the peak at about 99 eV. Hence, it is concluded that\nduring annealing \u0001at 1000 °C in Ar\u0002 the 1 nm thick SiOx\ninterlayer, being less thermodynamically stable than SiO2,\ntransforms into SiO2; however, the oxygen supply needed to\nform SiO2 is limited and thus leading to the presence of\nexcess pure Si, as confirmed by SIMS measurements.\nThe O 1s spectra \u0001angle resolved mode\u0002 from as-grown\nand 1 h annealed Al2O3\/4H-SiC samples were investigated\n\u0001not shown here\u0002. The as-deposited sample exhibits a broader\npeak than the annealed samples indicating a diminution of\nOH groups after heat treatment. Among the annealed\nsamples \u000115, 30, and 60 min\u0002 the O 1s peak does not change.\nAn increasing hydroxide concentration towards the outmost\nsurface \u0001not shown\u0002 most likely results from the formation of\nAl\u0001OH\u00023 at the oxide outmost surface layer due to ambient\nwater vapor.\nSIMS measurements have been performed on as-grown\nand annealed samples. Here, we focus on the hydrogen and\nsilicon profile across the oxide into the bulk 4H-SiC \u0001Fig. 2\u0002.\nThe hydrogen profile exhibits a lower concentration in the\nbulk oxide after annealing but the concentration increases at\nthe Al2O3\/4H-SiC interface. Furthermore, the peak width of\nthe interfacial H peak is also increased after annealing, pos-\nsibly suggesting a thicker interfacial layer. The Si profile\nshows a significant out diffusion after annealing at 1000 °C.\nHere, it is obvious that Al2O3 is not an efficient diffusion\nbarrier for Si. Jakschik et al.10 observed a similar behavior\nupon annealing Al2O3 deposited on silicon expecting Si dif-\nfusion along the grain boundaries. The carbon profile \u0001not\nshown\u0002 was not affected by heat treatments even above the\ncrystallization temperature \u0001900 °C\u0002. The H profile in an as-\ngrown SiO2\/4H-SiC control sample is included for compari-\nson in Fig. 2 \u0001the SiO2 layer with a thickness of \u000550 nm was\ngrown by thermal oxidation at 1150 °C\u0002 and it shows a simi-\nlar distribution as in the as-grown Al2O3\/4H-SiC samples.\nFinally, TEM investigations have been conducted. In\nFig. 3\u0001a\u0002, the interfacial region of an as-grown sample is\nshown, whereas Fig. 3\u0001b\u0002 shows a similar sample annealed\nfor 60 min at 1000 °C. A combination of ion-beam thinning\nand electron beam exposure resulted in a rapid crystallization\nof the deposited films but did not affect the interface region.\nThe high-resolution transmission electron microscopy \u0001HR-\nTEM\u0002 images of the as-grown samples show an almost uni-\nFIG. 1. High resolution Si 2p spectra \u0001AR mode\u0002 showing presence of Si\nsuboxide for both as-grown and annealed in Ar atmosphere Al2O3 films\ndeposited on 4H-SiC\u00010001\u0002.\nFIG. 2. SIMS profiles of \u0001a\u0002 Si and \u0001b\u0002 H in both as-grown and 3 h annealed\nat 1000 °C Al2O3\/4H-SiC samples in Ar atmosphere. The H profile of the\nas-grown SiO2\/4H-SiC sample was displaced in order to compare the H\nconcentration at the SiO2\/4H-SiC interface with the Al2O3\/4H-SiC\ninterfaces.\n052907-2 Avice et al. Appl. Phys. Lett. 91, 052907 \u00022007\u0001\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nform and amorphous interfacial layer between the crystalline\nSiC substrate and the Al2O3 film with an approximate thick-\nness of 1 nm \u0003Fig. 3\u0001a\u0002\u0004 in very good agreement with the\nXPS measurements. In Fig. 3\u0001b\u0002, the HRTEM micrograph\nreveals that the originally uniform interfacial layer is broken\nup into islands along the interface after annealing, while the\naverage thickness did not increase significantly compared to\nthe as-grown sample. The islands have a height of\n0.4–1.3 nm and a lateral extension of 2–6 nm. The diffrac-\ntion pattern presented in Fig. 3\u0001b\u0002 mainly contains contribu-\ntions from the SiC substrate. The extra reflections are attrib-\nuted to the crystallized Al2O3 film. No amorphous rings have\nbeen imaged originating from the intermediate oxide islands.\nThe HRTEM images also revealed that the aluminum oxide\nthickness decreased during heat treatment. Whereas the\nAl2O3 oxide thickness for the as-grown sample was\n\u0005117 nm, that for the sample heat treated for 1 h was\n\u000595 nm, corresponding to an 18% decrease which is in\nagreement with a previous study based on x-ray methods.11\nIn the same study, the as-grown Al2O3 layer was found to be\namorphous whereas after annealing at 900 °C in Ar atmo-\nsphere the Al2O3 started to crystallize. As also reported by\nSnijders et al. the transition from amorphous to polycrystal-\nline Al2O3 layer is accompanied by a reduction of the free\nvolume in the oxide, resulting in an increase of the oxide\natomic density.12\nFor both XPS and SIMS, the recorded signals are inte-\ngrated over a certain surface plane parallel or in a specific\nangle to the sample surface\/interface and they do not provide\nlateral information, in contrast to that of TEM. In the light of\nthe presented results, it is concluded that a rather large rear-\nrangement occurs in the interface region during annealing\n\u0003see Figs. 3\u0001a\u0002 and 3\u0001b\u0002\u0004. The apparent increase in the thick-\nness of the SiOx intermediate layer as suggested by the XPS\nis, therefore, interpreted as being due to the formation of\nSiO2 islands with a lateral extension of a few nanometers\nyielding a rather rough interfacial region. This interpretation\nis consistent with the indications of SiO2 formation in Fig. 1\nand also with the SIMS result in Fig. 2. The H profile in Fig.\n2 can be used as an indicator for the interface position and\nwidth. For the annealed sample, the amount of H at the in-\nterface increases and is wider spread than for the as-grown\nsample, suggesting trapping in a wider depth region after\nannealing. In fact, this holds even more compared to the\nSiO2\/4H-SiC control sample and the high accumulation of H\nmay play a key role for the low density of shallow electron\nstates in annealed Al2O3\/SiC samples, due to efficient pas-\nsivation of the boundaries between the SiO2 islands and the\n4H-SiC substrate. Further, this interpretation implies that the\nshallow electron states do not form at the boundaries be-\ntween Al2O3 and 4H-SiC, in accordance with recent theoret-\nical findings,13,14 or that also these boundaries are passivated\nby H. A further optimization of the SiC surface treatment\nprior to deposition of Al2O3 is believed to improve the inter-\nface morphology and also the electrical properties. In par-\nticular, a strong attention should be given to minimization of\nthe SiOx formation at the interface.\nFinancial support by the Norwegian Research Council\n\u0001Strategic University Program on advance sensors for micro-\nsystems\u0002 and the University of Oslo \u0001FUNMAT program\u0002 is\ngreatly acknowledged.\n1M. D. Groner, J. W. Elam, F. H. Fabreguette, and S. M. George, Thin\nSolid Films 413, 186 \u00012002\u0002.\n2V. V. Afanas’ev, F. Ciobanu, S. Dimitrijev, and G. Pensl, J. Phys.: Con-\ndens. Matter 16, 1839 \u00012006\u0002.\n3G. S. Higashi and C. G. Fleming, Appl. Phys. Lett. 55, 1963 \u00011989\u0002.\n4M. Avice, U. Grossner, I. Pintilie, B. G. Svensson, O. Nilsen, and H.\nFjellvag, Appl. Phys. Lett. 89, 222103 \u00012006\u0002.\n5M. Avice, U. Grossner, O. Nilsen, J. S. Christensen, H. Fjellvåg, and B. G.\nSvensson, Mater. Sci. Forum 527, 1067 \u00012006\u0002.\n6M. Avice, U. Grossner, I. Pintilie, M. Servidori, O. Nilsen, H. Fjellvåg,\nand B. G. Svensson, J. Appl. Phys. \u0001to be published\u0002.\n7NIST X-ray Photoelectron Spectroscopy Database, http:\/\/srdata.nist.gov\/\nxps\n8J. F. Watts and J. Wolstenholme, An Introduction to Surface Analysis by\nXPS and AES \u0001Wiley, Chichester, 2003\u0002, pp. 82–86.\n9C. J. Powell and A. Jablonski, NIST Electron Inelastic Mean Free Path\nDatabase, Version 1.1, National Institute of Standards and Technology,\nGaithersburg, 2000.\n10S. Jakschik, U. Schröder, T. Hecht, D. Krüger, G. Bergmaier, C. Luhmann,\nand J. W. Bartha, Appl. Surf. Sci. 211, 352 \u00012003\u0002.\n11U. Grossner, M. Servidori, M. Avice, O. Nilsen, H. Fjellvag, R. Nipoti,\nand B. G. Svensson, Mater. Sci. Forum 556-557, 683 \u00012007\u0002.\n12P. C. Snijders, L. P. H. Jürgens, and W. G. Sloof, Surf. Sci. 589, 98 \u00012005\u0002.\n13J. M. Knaup, P. Deak, T. Frauenheim, A. Gali, Z. Hajnal, and W. J.\nChoyke, Phys. Rev. B 72, 115323 \u00012005\u0002.\n14S. Wang, S. Dhar, S. R. Wang, A. C. Ahyi, A. Franceschetti, J. R.\nWilliams, L. C. Feldman, and S. T. Pantelides, Phys. Rev. Lett. 98,\n026101 \u00012007\u0002.\nFIG. 3. HRTEM pictures of \u0001a\u0002 as-grown and \u0001b\u0002 1 h annealed \u00011000 °C,\nAr\u0002 Al2O3\/4H-SiC samples.\n052907-3 Avice et al. Appl. Phys. Lett. 91, 052907 \u00022007\u0001\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}