{"doi":"10.5194\/os-5-621-2009","coreId":"58885","oai":"oai:nora.nerc.ac.uk:8719","identifiers":["oai:nora.nerc.ac.uk:8719","10.5194\/os-5-621-2009"],"title":"Deep ocean exchange with west-European shelf seas","authors":["Huthnance, J.M.","Holt, J.T.","Wakelin, S.L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12-07","abstract":"We review mechanisms and studies of exchange between the north-east Atlantic and the adjacent shelf sea.  Well-developed summer upwelling and associated filaments off Portugal and north-west Spain give exchange O(3 m**2\/s per unit length of shelf).  Prevailing westerly winds further north drive exchange O(1 m**2\/s).  Poleward flow along most of the upper slope has associated secondary circulation O(1 m**2\/s), meanders and eddies.  Eddies are shed from slope waters into the Bay of Biscay, and local exchanges occur at shelf spurs and depressions or canyons (e.g. dense-water cascading of order 1 m**2\/s).  Tidal transports are larger, but their reversal every six hours makes exchange largely ineffective except where internal tides are large and non-linear, as in the Celtic Sea where solitons carry water with exchange O(1 m**2\/s).  These various physical exchanges amount to an estimated 2-3 m**2\/s per unit length of shelf, between ocean and shelf.  A numerical model estimate is comparable: 2.5 x 106 m**3\/s onto and off the shelf from Brittany to Norway.  Mixing controls the seasonal thermocline, affecting primary production and hence fluxes and fate of organic matter.  Specifically, CO2 take-up by primary production, settling below the thermocline before respiration, and then off-shelf transport, make an effective shelf-sea “pump” (for CO2 from the atmosphere to the deep ocean).  However, knowledge of biogeochemical fluxes is generally sparse, giving scope for more measurements, model validation and estimates from models","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/58885.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8719\/1\/DOESjmhOsdNORA.pdf","pdfHashValue":"8e55c2a5293ff10d716c2a1e6f215a252cb29adb","publisher":"Copernicus Publications","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8719<\/identifier><datestamp>\n      2013-06-28T13:44:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/<\/dc:relation><dc:title>\n        Deep ocean exchange with west-European shelf seas<\/dc:title><dc:creator>\n        Huthnance, J.M.<\/dc:creator><dc:creator>\n        Holt, J.T.<\/dc:creator><dc:creator>\n        Wakelin, S.L.<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:description>\n        We review mechanisms and studies of exchange between the north-east Atlantic and the adjacent shelf sea.  Well-developed summer upwelling and associated filaments off Portugal and north-west Spain give exchange O(3 m**2\/s per unit length of shelf).  Prevailing westerly winds further north drive exchange O(1 m**2\/s).  Poleward flow along most of the upper slope has associated secondary circulation O(1 m**2\/s), meanders and eddies.  Eddies are shed from slope waters into the Bay of Biscay, and local exchanges occur at shelf spurs and depressions or canyons (e.g. dense-water cascading of order 1 m**2\/s).  Tidal transports are larger, but their reversal every six hours makes exchange largely ineffective except where internal tides are large and non-linear, as in the Celtic Sea where solitons carry water with exchange O(1 m**2\/s).  These various physical exchanges amount to an estimated 2-3 m**2\/s per unit length of shelf, between ocean and shelf.  A numerical model estimate is comparable: 2.5 x 106 m**3\/s onto and off the shelf from Brittany to Norway.  Mixing controls the seasonal thermocline, affecting primary production and hence fluxes and fate of organic matter.  Specifically, CO2 take-up by primary production, settling below the thermocline before respiration, and then off-shelf transport, make an effective shelf-sea “pump” (for CO2 from the atmosphere to the deep ocean).  However, knowledge of biogeochemical fluxes is generally sparse, giving scope for more measurements, model validation and estimates from models.<\/dc:description><dc:publisher>\n        Copernicus Publications<\/dc:publisher><dc:date>\n        2009-12-07<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/1\/DOESjmhOsdNORA.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/2\/DOESjmhf01.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/3\/DOESjmhf02.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/4\/DOESjmhf03.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/5\/DOESjmhf04.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/6\/DOES2009-28.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Huthnance, J.M.; Holt, J.T.; Wakelin, S.L..  2009  Deep ocean exchange with west-European shelf seas.   Ocean Science, 5. 621-634.  https:\/\/doi.org\/10.5194\/os-5-621-2009 <https:\/\/doi.org\/10.5194\/os-5-621-2009>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.ocean-sci.net\/5\/621\/2009\/os-5-621-2009.pdf<\/dc:relation><dc:relation>\n        10.5194\/os-5-621-2009<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8719\/","http:\/\/www.ocean-sci.net\/5\/621\/2009\/os-5-621-2009.pdf","10.5194\/os-5-621-2009"],"year":2009,"topics":["Marine Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Deep ocean exchange with west-European shelf seas \n \nJ. M. Huthnance, J. T. Holt and S. L. Wakelin \nProudman Oceanographic Laboratory, 6 Brownlow Street, Liverpool L3 5DA, UK \nCorrespondence to: J. M. Huthnance (jmh@pol.ac.uk)\nDeep ocean exchange with west-European shelf seas \n \nJ. M. Huthnance, J. T. Holt and S. L. Wakelin \nProudman Oceanographic Laboratory, 6 Brownlow Street, Liverpool L3 5DA, UK \n \nAbstract \nWe review mechanisms and studies of exchange between the north-east Atlantic and the \nadjacent shelf sea.  Well-developed summer upwelling and associated filaments off Portugal \nand north-west Spain give exchange O(3 m\n2\n\/s per unit length of shelf).  Prevailing westerly \nwinds further north drive exchange O(1 m\n2\n\/s).  Poleward flow along most of the upper slope \nhas associated secondary circulation O(1 m\n2\n\/s), meanders and eddies.  Eddies are shed from \nslope waters into the Bay of Biscay, and local exchanges occur at shelf spurs and depressions \nor canyons (e.g. dense-water cascading of order 1 m\n2\n\/s).  Tidal transports are larger, but their \nreversal every six hours makes exchange largely ineffective except where internal tides are \nlarge and non-linear, as in the Celtic Sea where solitons carry water with exchange O(1 m\n2\n\/s).  \nThese various physical exchanges amount to an estimated 2-3 m\n2\n\/s per unit length of shelf, \nbetween ocean and shelf.  A numerical model estimate is comparable: 2.5 x 10\n6\n m\n3\n\/s onto and \noff the shelf from Brittany to Norway.  Mixing controls the seasonal thermocline, affecting \nprimary production and hence fluxes and fate of organic matter.  Specifically, CO2 take-up by \nprimary production, settling below the thermocline before respiration, and then off-shelf \ntransport, make an effective shelf-sea “pump” (for CO2 from the atmosphere to the deep \nocean).  However, knowledge of biogeochemical fluxes is generally sparse, giving scope for \nmore measurements, model validation and estimates from models. \n \n1 Introduction \nOcean-shelf exchange has important consequences for shelf-sea currents, flushing and the \nsupply of nutrients.  Conversely, shelf processes impact on the open ocean: they appear to \nexert some control of circulation around ocean basins (Hughes and Meredith, 2006) and \nmixing over slopes is suggested to contribute to the main oceanic density structure (Munk \nand Wunsch, 1998).  Topography constrains large-scale (geostrophic) flow from crossing the \nslope, creating interest in special processes enabling exchange (Huthnance, 1995). \nTransports of nutrients and carbon between shelf seas and the open ocean are critical parts of \nnutrient and carbon cycles, e.g. Wollast (1993), Liu et al. (2000), Muller-Karger et al., 2005).  \nAlthough budgeting this part of their cycles is generally inadequate, there is evidence that the \nnorth-west European shelf can make a significant contribution to the oceanic up-take of \ncarbon (Frankignoulle and Borges, 2001; Thomas et al., 2004).  This “draw-down” is most \nefficient over an annual cycle if carbon taken up by plankton growth in spring and summer \nsinks below the seasonal thermocline before respiration and is exported to the deep ocean \nbelow the permanent thermocline. \nObservational studies of ocean-shelf exchange have been carried out in several locations \nincluding the Middle Atlantic Bight (e.g. Biscaye et al., 1994), the US western shelf (e.g. \nJahnke et al., 2008; Kudela et al., 2008; Hickey and Banas, 2008) and the Gulf of Lions \n(north-west Mediterranean; Monaco et al., 1990).  Specific west-European margin studies \n(including multi-institutional experiments: MORENA, OMEX, SES) form the substance of \nreview in Sect. 3. \nModelling of physical variables on kilometre scales is now possible in 3-D with fair realism \nfor wind- and buoyancy-driven flow over realistic shelf and slope topography, albeit effects \nof smaller-scale internal waves and turbulence are parameterised (Samelson et al., 2008).  \nCoupling with ecosystem models has progressed, especially for primary production.  With \nhigher trophic levels, there are increasing issues of parameter estimation and trade-offs \n(between number of variables, coverage, resolution and run duration).  Modelling is also \nreviewed in Sect. 3. \nThese cited studies emphasise that net fluxes are hard to measure in unsteady conditions with \nalong-shelf variations.  An empirical approach to balancing a budget needs (in principle) \nsufficient spatial and temporal resolution covering all faces of a control volume.  Typically \nthis is not practical even for water; it is even harder to estimate net fluxes resulting from \ncorrelations of constituent concentrations with flow.  Hence there is a need for theory and for \nmodels to give practical effect to theory.  Models hold the prospect of 3-D representation of \ncomplex domains and processes, and inherent budgeting (if properly formulated).  However, \n(expensive) measurements are necessary at least to test hypotheses and models.  Such testing \nwas the purpose of many of the studies cited.  Then there may be more confidence in using \n(tested) models to estimate exchanges where measurements are not dense enough.  \nConfidence may be strengthened if models are shown to represent well the key processes \ncontributing to ocean-shelf exchange in a region of interest. \nThe aim here, in the context of the “Deep Ocean Exchange with the Shelf” overview, is to \nreview studies of exchange between the north-east Atlantic Ocean and west-European shelf \nseas.  In accord with the above discussion and issues, the emphasis is on a description of \nexchange processes occurring in this region, on their contributions to exchange in relation to \noverall estimates of exchange and on process representation in models which may give \nconfidence to model estimates elsewhere. \nWe outline the west-European context (Sect. 2), review observations and models with overall \nestimates of exchange in this region (Sect. 3), outline exchange processes (Sect. 4), \nsummarise by shelf sector (Sect. 5) and discuss progress and needs for future work (Sect. 6). \n \n2 Context: west-European margin \nIn global terms, these shelf seas are quite broad and irregular (Fig. 1), especially compared \nwith other eastern ocean margins. The shelf width varies: 10-60 km off Portugal and northern \nSpain, 50 km increasing to 100-150 km in eastern Biscay, approximately 500 km in the Celtic \nSea, 50-150 km around Ireland and 100-200 km around Scotland with a very irregular coastal \nboundary and many islands.  The Norwegian shelf broadens from about 20 km at 61 N to 200 \nkm at 65 -68 N before narrowing again to about 50 km around 70 N. \nTypical shelf depths are 100-150 m from Biscay to Scotland, increasing to more than 400 m \nin the Norwegian Trench.  The North Sea shoals southwards, to 20-30 m depth between \nsouth-east England and the near continent.  Depths on the Norwegian shelf are variable, \nextensively 200-300 m or more.   The continental slope is steep from Portugal to north-west \nScotland, and is indented with a few large canyons off Portugal and in southern Biscay.  \nThere are many smaller canyons north of Cape Ferret Canyon (44.7 N) as far as Goban Spur \n(49 N, 11 W).  The Porcupine Sea Bight is a 2000 m deep intrusion.  Porcupine Bank (depth \nshoaling to < 200 m) is a hydrographically semi-detached extension from the western Irish \nshelf.  Around Scotland the upper slope is relatively smooth, and less steep (~ 0.02 or less) \nnorth-east of the Wyville-Thomson Ridge.  Off Norway the shelf edge is less regular. \nThe region is subject to important forcing by (i) the adjacent oceanic density field (driving a \n“slope current”), (ii) winds, (iii) tides and (iv) other sources of buoyancy, Fig. 2.  In the \nadjacent upper ocean (i), warm North Atlantic water flows poleward past Ireland, Scotland \nand Norway.  Water formed by deep convection in northern Biscay flows slowly southwards \nto Iberia (van Aken, 2001).  In 500-1500 m against the slope, northward flow (as far as the \nentrance to Rockall Trough) includes a Mediterranean Water fraction which increases the \nsalinity.  Winds (ii) cause ocean-shelf exchange and are discussed further in Sect. 4.  Semi-\ndiurnal tides (iii) are large in the north Atlantic generally.  Tidal currents, primarily \nbarotropic, exceed 0.1 m\/s across the wide shelves of most of the north-east Atlantic margin, \ncreating significant turbulence and mixing.  Locally in straits and around headlands, tidal \ncurrents often exceed 0.5 m\/s.  Freshwater inputs are sources of buoyancy (iv).  Rivers’ \ninputs of freshwater to west-European shelf seas are small in global terms, and salinity in \nmost areas (except adjacent to Scandinavia) is within 1 or 2 of open-ocean values.  \nNevertheless, excepting west and north Scottish shelves with small-area river catchments, \nrivers add more freshwater to this region’s seas than rainfall-evaporation, which is within \n±200 mm\/year over much of the region.  Moreover, inputs from land and rivers drive anti-\ncyclonic flows around Ireland and Scotland.  The largest flux of fresher water is the \nNorwegian Coastal Current (originally from rivers into the Baltic Sea).  Summer heating and \nwinter cooling (iv) force a seasonal cycle of stratification in most areas. \nStratification is favoured by the buoyancy inputs but eroded by mixing due to tidal currents, \nwinds and waves (surface and internal).  Typically, in sequence from very shallow water out \nto the open shelf, there are (Fig. 2): a nearshore region mixed by waves, a region of \nfreshwater influence that may be stratified, shallow coastal water mixed by strong tidal \ncurrents and winds, and deeper shelf water which is thermally stratified in summer.  The \nsummer thermocline depth is O(50 m) or less.  On the north-west European shelf, the “tidal \nmixing” front between the mixed and summer-stratified areas is inshore of the shelf edge \n(Simpson, 1998a,b); the outer shelf is stratified in summer.  Inertial-internal waves also cause \nmixing at the bottom (for a favourable combination of slope, stratification and wave \nfrequency) and especially within the thermocline (via shear and large-wave breaking); these \nwaves are particularly active near the shelf edge (an area of their generation).  Surface waves \ncause much surface mixing and air-sea exchange in this region of strong winds and rough \nseas. \nThe depth of winter mixing exceeds shelf depths in the whole region, being more than 500 m \nin Biscay and as deep as 750-900 m around 50 -60 N west of Ireland and Scotland.  Water \nand its contents from below the seasonal thermocline are thus mixed to the surface during \nautumn and winter.  Winter cooling in the Nordic seas occurs as deep convection, in small \ncells but probably extensively, forming a cold dense bottom layer, which spills southwards \nover the sills between Greenland and Scotland. \nRivers’ inputs of sediments and sediment-bound nutrients and carbon to west-European shelf \nseas are small in global terms.  Riverine input of phosphorus is much less than exchanges \nwith the open ocean or transfers between shelf sectors.  As losses are small, overall net export \nto the ocean is inferred. Nitrogen input from rivers and atmosphere is less than de-\nnitrification, and much less than exchanges with the open ocean or transfers between sectors. \nPrimary production in the north-east Atlantic is described by (e.g.) Pingree et al. (1976) and \nLonghurst (1998).  A spring bloom begins when the light-determined critical depth for net \nalgal growth descends to the mixed-layer depth, which shoals as heating increases and wind \nstress decreases.  Spring bloom timing varies, inter-annually and locally, for example if fresh-\nwater inputs give a shallower surface layer, advancing the bloom, or if sediment suspension \nlimits light and delays growth.  The bloom becomes nutrient-limited when the initial near-\nsurface charge is exhausted.  Then summer growth depends on biologically regenerated \nnitrogen (as NH3), NO3 entrained through the thermocline by turbulence from winds, waves \nand internal waves, and Ekman suction from wind stress curl.  Additionally on the shelf, tidal \nmixing can supply nutrients to the euphotic zone.  Fronts between summer-stratified and \nmixed waters particularly favour phytoplankton growth (Pingree et al., 1978).  Mixed waters \nprovide nutrients directly from benthic regeneration.  An autumn bloom, usually weaker than \nthe spring bloom, may be fuelled by nutrients entrained in the deepening mixed layer.  \nTypical west-European shelf-sea production is O(100-250 g C m\n-2\n yr\n-1\n), somewhat greater \nthan in the adjacent north-east Atlantic.  Ultimately, except in riverine-influenced coastal \nregions, production is fuelled mostly by nutrients from the open ocean. \n \n3 Review of previous work and overall estimates of exchange \nOff-shelf transport processes have yet to be explicitly investigated in the context of multi-\nannual and shelf wide-scales.  Here we consider previous observations and modelling in turn. \n3a  Observations \nObservational campaigns are necessarily limited to a few seasons and a particular area.  The \nMalin-Hebrides shelf west of Scotland has been studied for internal tides (Sherwin, 1988) \nand ocean-shelf interaction (UK LOIS Shelf Edge Study (SES) 1995-96, e.g. Souza et al., \n2001).  The Ocean Margin EXchange project (OMEX) I, 1993-1996, was over Goban Spur \n(e.g. Wollast and Chou, 2001).  Celtic Sea studies include internal tides (e.g. Pingree and \nNew, 1989; New and Pingree, 1990), the slope current (Pingree et al. 1999) and residual \ncirculation (Pingree and Le Cann, 1989, 1990).  Iberian Margin studies include several of \nupwelling and larger-scale studies of current structure and biogeochemical exchanges: \nMORENA (e.g. Fiuza et al., 1998) and OMEX II (e.g. Huthnance et al., 2002; Joint and \nWassmann, 2001; van Weering and McCave, 2002). \nEmpirical estimates of total exchange across some sectors of shelf edge have been made on \nthe basis of (i) changing properties of water flowing along the slope, (ii) variance in cross-\nslope flow, (iii) cross-slope dispersion of drifters.  Thus along the Iberian slope, northward-\nflowing Mediterranean water has lateral diffusivity ~ 500 m\n2\n\/s (Daniault et al., 1994; basis i).  \nOff western Galicia, cross-slope current variance (19mm\/s)\n2\n (basis ii) implies cross-slope \nexchange ~ 3.8 m\n2\n\/s in 200 m, or equivalent lateral diffusivity also ~ 500 m\n2\n\/s taking the \noffshore scale as the distance from the coast to the 200 m depth contour (26 km; Huthnance \net al., 2002).  Also off western Galicia, drifters deployed in August 1998 and winter 1998\/99 \ndispersed with effective across-slope diffusivity 870 m\n2\n\/s and 190 m\n2\n\/s respectively, i.e. an \naverage 560 m\n2\n\/s (basis iii; Huthnance et al., 2002, Table 7).  West of Scotland, cross-slope \ncurrent variance ~ (33 mm\/s)\n2\n at the 200 m contour (Harikrishnan, 1998; basis ii) is \nequivalent to 6.6 m\n2\n\/s exchange.  Around Scotland, estimates of lateral diffusivity from \ndrogued-buoy dispersion (basis iii) are: ~ 700 m\n2\n\/s (Booth, 1988); ~ 360 m\n2\n\/s for both winter \nand summer (Burrows and Thorpe, 1999a).  North of Scotland and off Norway, cross-slope \ncurrent variances are of order (0.1 m\/s)\n2\n.  Analysis by process contributions is discussed in \nSect. 5, initially for west Iberia, and presented in Table 1. \nWater, nutrient and carbon cycling along the north-east Atlantic margin (Biscay to Norway) \nhas been reviewed for the JGOFS-LOICZ Continental Margin Task Team (Huthnance, 2009). \nThere have been North Sea studies of the seasonal cycle (Simpson, 1993). \n3b  Modelling \nThe North Sea has been the subject of modelling (Lenhart et al., 1995; Radach and Lenhart, \n1995; Iversen et al., 2002; Smith et al., 1996; Winther and Johannessen, 2006; Moll and \nRadach, 2003) and budgeting (Thomas et al., 2005) studies, albeit not directly addressing \nocean-shelf exchange.   \nTo simulate 1960-2004 exchange between the north-west European shelf and adjacent \nAtlantic, Holt et al. (2009) have used a 3-D physics-only “POLCOMS Atlantic Margin” \nmodel with ~ 12-km resolution, 42 s-levels and COARE3 bulk formulae for surface fluxes \n(Fairall et al., 2003).  The simulation used ERA40 forcing, lateral boundary conditions from a \n~1\no\n global model for 1958-2004 (NEMO; Smith and Haines, submitted) and river inputs \n(Young and Holt, 2007; grdc.bafg.de\/).  The overall pattern of across-shelf-edge transport is a \nnet downwelling circulation of about 1.2 Sv (1 Sv = 10\n6\n m\n3\n\/s).  This is the net result of \nsurface transport on to the shelf (variable, driven by prevailing winds) and an off-shelf \ntransport in a thin near-bed Ekman layer under the slope current (little variability on monthly \ntime scales).  Total on-\/off-shelf exchange (from Brittany to Norway) is larger, about 2.5 Sv, \nif all on-shelf flows are added and all off-shelf flows are added separately (Fig. 3).  Across-\nshelf-edge transport in the Amorican shelf and Celtic Sea is relatively weak and generally on-\nshelf, whereas there is strong off-shelf transport from the North Sea to the Norwegian Trench.  \nThese features are illustrated by tracer distributions in Fig. 4.  The figure shows some tracer \nadvance or entry of Atlantic water on to the shelf south-west of the UK and subsequently into \nthe English Channel, on to the shelf west of Scotland and in to the northern North Sea both \nwest and east of Shetland; there is a marked tongue along the west side of the Norwegian \nTrench.  Tracer also advances over Porcupine Bank west of Ireland and along the slope \naround Scotland (c.f. Sect. 4, slope current).  Strong tracer concentrations at 24 months \nsouth-west of the UK confirm the lack of off-shelf transport in this sector.  Elsewhere the off-\nshelf picture is more complex as reduced tracer values can derive from the various banks \nwest and north of Britain.  The initial tracer quantity equates to a mean density of 84.3 m\n-3\n, if \nspread over the whole domain.  The tracer over the shelf (water depth < 200m, volume \n91,000 km\n3\n) has mean density 12.8 m\n-3\n after 6 months, 57.4 m\n-3\n after 24 months. Allowing \nfor an initial delay for tracer to reach the 200 m contour, this is an approach to 84.3 m\n-3\n as 1 – \nexp(-0.65t) where t is time in years, i.e. about 1.9 Sv effective exchange rate for the tracer.  \nThis estimate is appropriately less than total exchange 2.5 Sv which includes some off-shelf \ntracer transport. \nThe fate of organic carbon settling to the bottom fraction of the water column was estimated \nby introducing tracer, each June, into the lowest model layer within the 200m depth contour, \nwith uniform concentration \/ area.  By the next March, typically 40% of tracer had left the \nshelf. Particularly for Irish and Scottish shelves, transport processes are very effective at \nremoving material from the bottom layer on the shelf (Holt et al., 2009).  This scenario forms \nthe basis for extending the North Sea CO2 “pump” concept (Sect. 6 and Thomas et al., 2004) \nto the wider west-European shelf. \nProctor et al. (2003) modelled a year (1995) of nutrient and phytoplankton fluxes across the \nshelf edge west of Scotland in 2-D with horizontal resolution ~ 1.2 km and 60 layers in the \nvertical.  The microbiological model represented nitrate, ammonium, oxygen, microplankton \nand detritus.  Results were validated by 1995 flux measurements in SES (Souza et al., 2001), \nwith fair agreement, but indicated a need to improve bottom boundary-layer processes in the \nmodel.  In general along-shelf variability influences ocean-shelf exchange (e.g. Kudela et al., \n2008; Hickey and Banas, 2008) and calls for a 3-D model. \nFor 3-D carbon cycling, POLCOMS as used in Holt et al. (2009) has been coupled with the \nEuropean Regional Seas Ecosystem Model ERSEM (Allen et al., 2001).  The 18 years 1988-\n2005 have been run with ERA40 and operational ECMWF surface forcing, about 300 river-\nflow inputs and time-varying (spatially-uniform) atmospheric pCO2.  A mean annual cycle \nwas used at ocean boundaries, for optical attenuation and for riverine concentrations of \nnutrient and dissolved organic carbon (DIC).  Inputs to the model budget (largest first) are \nfrom rivers and the atmosphere (inorganic carbon) and advection of organic carbon (Table 2 \nand Fig. 5).  These simulations are presented in detail by Wakelin et al. (in preparation).  \nPreliminary analysis shows that net burial 0.02 x 10\n12 \nmol C yr\n-1\n is the small difference \nbetween net settling of organic carbon and benthic respiration as inorganic carbon.  \nHorizontal advection is the dominant loss, an effective sink of carbon if it leaves the shelf to \nwater too deep to re-equilibrate with the atmosphere.  The net effect as a sink of (inorganic) \ncarbon from the atmosphere is 0.9 x 10\n12 \nmol C yr\n-1\n. \n \n4 Exchange processes \nEstimated process contributions to ocean-shelf water exchange are shown by sector in Table \n1.  Here we outline the contributing processes (deferring sector-specific aspects to Sect. 5).  \n[Italicised processes are shown in the table.  Others mentioned are relatively small]. \nWarm, saline North Atlantic Water (NAW) forms a poleward slope current along the \ncontinental slope, in most sectors from Portugal past Britain to Norway.  Its spatial continuity \nis shown by drifter observations and satellite altimetry  (Pingree et al., 1999; Skagseth et al., \n2004). The current is approximately barotropic, centred at ~500m on the slope (e.g. \nHuthnance, 1986, and references therein; Pingree and LeCann, 1989, 1990).  It is thought to \nbe forced by the dynamic height of warmer sub-tropical waters (Huthnance, 1984; Hill et al., \n1998a; Fig. 2).  Below the poleward slope current is a bottom Ekman layer (Huthnance, 1995, \nand Fig. 2), modified by the slope and stratification (e.g. Trowbridge et al., 1998), where \nfriction reduces the current to zero.  This Ekman layer is expected (with some evidence from \nobservations) to have off-shelf transport τ\/ρf  with maximum ghOs\/8f of order 1 m\n2\n\/s or 1 \nSv\/(1000 km) (Huthnance, 1995; Souza et al., 2001).  Here τ is the bottom stress arising from \nthe current, ρ is the water density, f the Coriolis parameter, s the slope of dynamic height as a \nresult of poleward density gradient through depth hO.  This Ekman transport is robust, being \nindependent of the detailed form of stress, and forms the basis of an “Ekman drain” concept \nfor off-shelf flux.  Model results for the north-west European shelf (Holt et al., 2009) show a \nstrong correlation (r~0.7) between the along-slope flux (across 56.5°N) and the lower layer \nflux across the 200m contour in 52.5°N to 57.5°N, substantiating the “Ekman drain” concept. \nThe irregular shelf, with capes, canyons and varied shelf width, may cause cross-slope flow \n(Trowbridge et al., 1998), slope-current meanders (Fig. 2) and eddies (detailed by sector in \nSect. 5). \nThe region is subject to strong wind forcing.  Except off Iberia in summer, winds are variable, \nusually associated with the passage of cyclones (depressions) driving storm surges (in the \nform of coastal Kelvin and continental shelf waves) and intermittent up- or down-welling.  \nThe surface flow can be estimated as an Ekman transport \nρa cD (W\n2cosθ + w'2) \/(ρwf) \nwhere ρa, ρw are the densities of air and water, cD is a drag coefficient, W is the monthly mean \nwind speed at an angle θ to the along-slope direction, w' is the wind's standard deviation \n(taken as isotropic) in the along-slope direction, and f is the Coriolis parameter. \nSummer upwelling is forced by northerly trade winds over the western Iberian shelf (Fig 6). \nWell-developed upwelling can form filaments with off- and on-shelf fluxes exceeding the \nEkman transport over the corresponding length of shelf.  Shelf irregularities (capes, canyons \nand varied width) may cause locally-enhanced up-\/down-welling. \nInternal tides are generated in many locations (Sect. 5) by tidal flow over steep slopes and \ncan strongly affect tidal currents.  Large-amplitude (non-linear) internal tides transport water \nin their wave-forms on the summer thermocline (Fig. 2).  Locally, strong tidal currents may \nbe rectified to along- and cross-slope flow, usually near small-scale features (e.g. headlands) \nand the upper slope.  Although generally small, such rectified flows may be significant for \nlong-term displacements (Holt and Proctor, 2008). \nShear dispersion, K, results from variations of tidal current with depth.  Observed spreading \nof caesium-137 on the north-west European shelf can be modelled by a horizontal dispersion \ncoefficient K = tDU\n2\n, where tD ~ 10\n3\ns and U (m\/s) is the tidal current amplitude (Prandle, \n1984). This approach suggests that shelf-edge exchange from tidal shear dispersion is \nrelatively small unless U > 0.5 m\/s, as west of Brittany but rarely elsewhere. \nDense water formed by winter cooling of shallow shelf seas may cascade down the slope \nunder gravity, eventually leaving the sloping bottom at its density level. Typical values of \nsuch cascading fluxes are estimated in Shapiro et al. (2003) as 0.5-1.6 m\n2\ns\n-1\n, significant when \nand where they occur but highly intermittent. \n \n5 Summary by sector \nThis section summarises exchanges and some particular aspects of nutrients and carbon \ncycling for the west-European margin sectors in turn from south to north.  Estimated process \ncontribution to ocean-shelf exchange of water are summarised in Table 1. \n5.1 West Iberia \nThis sector has moderate shelf width and significant inputs of fresh water.  Poleward along-\nslope flow comprises relatively warm and saline Eastern North Atlantic Central Water (e.g. \nFrouin et al., 1990).  It is manifested at the surface in winter, but present as an undercurrent \nfor much of the year, typically a few tens of kilometres offshore from the shelf break and \nreaching down to depths of some hundreds of metres.  Deeper again, warm saline \nMediterranean Water, often with two “cores” centred at levels above and below 1000m, \nflows generally northwards with progressive “dilution” by adjacent Atlantic Water (Fiuza et \nal., 1998). \nSeasonality is very strong.  In winter, winds are variable and upwelling can happen in any \nmonth, but (north-) westerlies prevail and give mixing and downwelling on average (NOAA \nupwelling index values analysed in Huthnance et al., 2002).  In spring, a shallow thermocline \ntypically develops, overlying thicker remnants of the mixed layer from the previous winter \n(e.g. May 1993; Fiuza et al., 1998).  In summer, long-periods of north-easterly winds give \nupwelling of cooler nutrient-rich water, along the north-south extent of the Iberian shelf and \nespecially around Finisterre (e.g. Joint and Wassmann, 2001) but less off the Algarve with \ndifferent coastal orientation.  Well-developed upwelling can form filaments taking surface \nwater off-shelf, with complementary on-shelf flow (beside and below).  Filament fluxes are \ntypically O(0.6 Sv) each (Barton et al., 2001) exceeding the Ekman transport over the (semi-\nregular) spacing between filaments. \nInternal tides having peak currents comparable with barotropic tidal currents are generated in \nsummer over steep slopes off Portugal (Jeans and Sherwin, 2001a, b). \nOverall estimated exchange across the 200 m depth contour is 3.1 m\n2\n\/s on the basis of cross-\nslope current variance (15.5 mm\/s)\n2\n (Huthnance et al., 2002) but differs between summer and \nwinter.  Contributions (Huthnance et al., 2002, and Table 1) come from up-\/down-welling, \nsecondary flow associated with the slope current (O(1 m\n2\/s) including the Ekman “drain”), \nnon-linear internal tides on the summer thermocline O(1 m\n2\n\/s), detaching eddies and cross-\nfrontal flow O(0.6 m\n2\n\/s combined).  The overall estimate 5.6 m\n2\n\/s for summer exceeds that \nfor winter (2.2 m\n2\n\/s), owing to non-linear internal tides and to filaments O(3 m\n2\n\/s) when \nupwelling is well-developed (Huthnance et al., 2002).  The summer-and-winter average is in \nfair agreement with the overall 3.1 m\n2\n\/s, and the summer enhancement is in fair agreement \nwith summer-enhanced drifter dispersion (870 m\n2\n\/s c.f. 190 m\n2\n\/s in winter, Sect. 3). \n5.2 Southern Biscay \nThis north Spanish shelf is relatively narrow. Freshwater input from rivers greatly exceeds \nnet rainfall-evaporation over this small shelf area.  Estimated ocean-shelf exchange ~ 1.6 m\n2\n\/s \nis dominated by wind-forced flow (Table 1).  Winds drive summer upwelling around Cape \nOrtegal and enhance production on the Cantabrian shelf (OSPAR, 2000).  Slope water eddies \nare shed into the ocean, especially around Cape Ortegal (Pingree and LeCann, 1992).  \nHuthnance et al. (2002) estimated about five eddies per year, of order 500 km\n3\n each, for a \nrelatively small exchange 0.16 m\n2 \ns\n-1\n in this sector. \nThe estimated ocean-shelf exchange is larger than along-shelf flows from\/to adjacent sectors.  \nProduction uses oceanic nutrient inputs greatly exceeding riverine and atmospheric sources. \n5.3 Eastern Biscay \nIn this sector, freshwater input from rivers (notably the Garonne, Dordogne and Loire) is \nestimated as more than six times (evaporation – rainfall).  Salinity on the shelf is close to \nopen-ocean values, indicating effective (mostly wind-forced) ocean-shelf exchange, larger \nthan along-shelf flows from\/to adjacent sectors.  Again, production greatly exceeds what can \nbe supported by riverine and atmospheric inputs and is inferred to depend on oceanic inputs \nto the shelf. \n5.4 Celtic Sea  \nThis is a very broad shelf sector between Brittany and south-west Ireland. \nLow-frequency circulation in the Celtic Sea is generally weak (Pingree and le Cann, 1989) \nexcept along the upper slope and where channelled or accelerated around promontories.  \nPingree et al. (1999) show a satellite image suggesting slope-current \"overshoot\" into the \nocean at Goban Spur.  This localised exchange, when it occurs, could be comparable with the \nslope current transport, O(1 Sv or 1m\n2\n\/s if attributed to the whole sector).  The discontinuous \ncoast allows on-shelf wind-forced flow to extend eastwards through the English Channel \n(about 0.1 Sv; Prandle et al., 1996) and northwards through the Irish Sea (about 0.1 Sv; \nKnight and Howarth, 1999).  Tidal currents exceed 0.5 m\/s at the shelf edge west of Brittany, \nwhere tidally-rectified flow reaches 0.1 m\/s.  Internal tides with comparable peak currents are \nparticularly strong at the Celtic Sea shelf edge (e.g. Pingree and New, 1989) and carry on-\noffshore exchange up to 1.3 m\n2\n\/s in their wave-forms on the summer thermocline (Huthnance \net al., 2001).  At the shelf edge, the internal tides mix and diffuse the seasonal thermocline, \nand cooler water brought nearer to the surface is exposed by wind mixing as a cool surface \nband.  There is evidence of dense winter-cooled water cascading (Cooper and Vaux, 1949). \nThese processes suggest a large ocean-shelf exchange O(3 m\n2\n\/s), greatly exceeding flows \nto\/from adjacent shelf sectors.  Most nutrients come from the ocean but much is exported to \nthe west of Ireland.  Production at the shelf edge (Joint et al., 2001) is enhanced by mixing \nacross the summer thermocline by internal waves.  OMEX I estimated nutrient and organic \ncarbon fluxes in a Goban Spur section (Wollast and Chou, 2001).  Turbid down-slope Ekman \nflow on the slope (McCave et al., 2001) suggests a route for sediment transport off the shelf. \n5.5 Western Ireland shelf \nOcean-shelf exchange is predominantly wind-forced.  Prevailing westerlies tend to drive on-\nshelf surface flow and hence downwelling on average.  Under the slope current, turbid down-\nslope Ekman flow on the outer slope of Porcupine Bank (Dickson and McCave, 1986) again \nsuggests a route for sediment transport off the shelf.  There is evidence of cascading at the \nnorth end of Porcupine Bank (Hill et al., 1998b).  River input of freshwater exceeds rainfall-\nevaporation, but large ocean-shelf exchange implies only a small salinity reduction, except in \nthe coastal current.  The nutrient budget is dominated by exchanges with the Celtic Sea and \nopen ocean. \n5.6 West Scotland (to Cape Wrath \/ Wyville-Thomson Ridge) \nIrish Sea outflow forms the northward-flowing Scottish Coastal Current (SCC) with branches \non both sides of the Outer Hebrides island chain.  As well as the Irish Sea outflow, river input \nand rainfall-evaporation are comparable in adding freshwater, but the effect on salinity is \nsmall except in the SCC.  Poleward along-slope flow, and some dispersion onto and away \nfrom the shelf around Scotland, were shown by hydrography, moorings (Souza et al., 2001) \nand drifters (Burrows et al., 1999b) in the SES.  Harikrishnan (1998) estimated a downslope \nEkman transport 0.46 m\n2\n\/s below the slope current.  Again, turbid down-slope flow near \n56.5 N (McCandliss et al., 2000) suggests a route for sediment transport off the shelf.  There \nis evidence of dense winter-cooled water cascading.  Tidal currents include a notable internal \ncomponent on the outer shelf (Sherwin, 1988).  The flux estimate in Table 1 is based on the \nmean-square vertical displacement (potential energy density) given therein, and a (very \napproximate) 10% non-linear element to give water flux.  Prevailing westerly winds tend to \ndrive on-shelf surface flow and hence downwelling on average.  Drifters moved across the \n200 m contour onto the shelf at mean speed 4 mm\/s in winter, 2 mm\/s in summer (Burrows \nand Thorpe, 1999a) corresponding to respective transports 0.8, 0.4 m\n2\n\/s if extrapolated \nthrough the whole depth.  Winds are the dominant forcing for ocean-shelf exchange, which \ngreatly exceeds flows from\/to adjacent shelf sectors.   \nRivers and atmospheric sources of nutrients are negligible compared with dominant oceanic \nsupply.  Nutrients from the Irish Sea also help to supply production and a large export to the \nnorth Scottish shelf.  CO2 uptake from the atmosphere is important in the Proctor et al. (2003, \nSect. 3) model for balanced carbon fluxes in the cross-slope section.   \n5.7 North Scotland \nThis sector is at the latitudes near 60 N of maximum wind forcing.  Aided by the south-west \nto north-east orientation of the shelf, prevailing westerlies tend to drive on-shelf surface flow.  \nDownwelling is implied on average, insofar as the coast provides a barrier; there is also \nsubstantial flow to the North Sea requiring net inflow from the ocean.  North Atlantic Water \nflows polewards as a (West Shetland) slope current.  Prominent meso-scale meanders and \neddies in the Faroe-Shetland Channel (probably generated locally by slope-current instability \nor from the Iceland-Faroe front) sometimes deflect much of the slope current into the central \npart of the Channel (2 Sv or more; Sherwin et al., 1999, 2006).  Sherwin et al. (2006) suggest \nthat possibly the variability helps (via mixing) to draw as much as 2 Sv of Modified North \nAtlantic Water into the Channel from the north.  The Table 1 value 1 m\n2\n\/s is somewhat less, \nreflecting the uncertainty.  The Wyville-Thomson Ridge is a source of internal tidal currents \nand waves (Sherwin, 1991).  Process-based estimates of ocean-shelf exchange show \ndominant wind-forced and eddy contributions to a large total 3 m\n2\n\/s.  Drifter-based estimates \nof dispersion as large as 700 m\n2\n\/s (Sect. 3) give estimated exchange 7 m\n2\n\/s across the 500 m \ncontour (Huthnance, 1995).  Burrows and Thorpe (1999a) estimated ~ 360 m\n2\n\/s across-slope \ndispersion around Scotland (west and north together). East of the Wyville-Thomson Ridge, \ntheir drifters moved across the 200 m contour onto the shelf at mean speed 10 mm\/s in \nwinter, -15 mm\/s in summer, or transports 2, -3 m\n2\n\/s if extrapolated through the whole depth. \nThere is relatively little river inflow; rainfall-evaporation provides most of the freshwater \ninput.  The overall effect on salinity is small.  Nutrient budgets are dominated by supply from \nthe ocean (with some from the West Scottish shelf), inferred uptake by production and \noutflow to the North Sea. \n5.8 North Sea \nExchanges are dominated by “Atlantic Water” inflows to the northern North Sea (by various \nroutes around Scotland, notably around Shetland and the Fair Isle Current between Orkney \nand Shetland) and a similar transport along the continental slope into the Norwegian Trench \n(Huthnance, 1997).  These northern transports total about 1.7 Sv, greatly exceeding the Dover \nStrait inflow ~ 0.1 Sv (Prandle et al., 1996) and combined river inputs (including those via \nthe Baltic).  The “Atlantic Water” may have been significantly modified by its long transit \nacross the shelf for the Dover Strait inflow.  Some of the inflow around Scotland may also \nhave come from the Celtic Sea shelf edge (Pingree et al., 1999).  The main transport out of \nthe North Sea is northwards in the Norwegian Coastal current (NCC). \nNutrient supply from rivers is significant locally in the southern and eastern North Sea, but \nfor the North Sea as a whole most nutrient input is via the “Atlantic Water”.  In the southern \nNorth Sea, strong tidal currents in shallow water prevent summer stratification and turbidity \ndelays the spring bloom in places.  However, the frontal regions and southern and eastern \nareas (off Belgium to Denmark) show large primary production (e.g. Howarth et al., 1993).   \nThe North Sea net carbon budget is dominated by carbon inputs from rivers, the Baltic Sea \nand the atmosphere.  Final export to the Atlantic Ocean accounts for more than 90% of the \nCO2 taken up from the atmosphere (Thomas et al., 2005), and the North Sea acts as a sink for \norganic carbon.  The uptake and sink is aided by large pCO2 draw-down as stratification \nseparates upper-layer production from respiration which increases CO2 in the subsurface \nlayer that is ultimately\n \nexported.  The stratified area more than offsets emission of respired \nCO2 in the vertically-mixed southern North Sea (Thomas et al., 2004). \n5.9 Norway \nNorthward flow comprises a slope current and the fresher Norwegian Coastal Current (NCC) \nnear the surface and coast (McClimans et al., 1999; Skagseth et al., 2004), fed by Atlantic \ninflow to the northern North Sea, cyclonic North Sea circulation and fresher water from the \nBaltic.  The NCC transports 1-2 Sv northwards from inflow across 61 N, with variability also \n1-2 Sv – current variance is 0.01-0.02 m2 s-2 (Poulain et al., 1996).  NCC salinity (reduced by \nBaltic outflow) is less than 33 at 61 N.  Despite much riverine freshwater (greatly exceeding \nprecipitation-evaporation), the salinity increases to about 34 off northern Norway as Atlantic \nwater is entrained.  The NCC is unstable, forming large eddies.  There is no clear estimate of \nan eddy separation-rate to the ocean interior but the value in Huthnance (2009) and Table 1 is \non the basis that much of the NCC transport is lost in O(1000 km) along the Norwegian shelf.  \nThe NCC also spreads under north\/easterly winds, while south\/westerlies confine it against \nthe coast.  Prevailing winds being westerly tend to drive on-shelf surface flow and hence \ndownwelling on average. Tidal currents are strong with a significant diurnal component off \nnorthern Norway. Process-based estimates of ocean-shelf exchange totalling approximately 3 \nm\n2\n\/s show dominant wind-forced and eddy contributions. \nNutrient input from the North Sea greatly exceeds riverine or atmospheric sources. By \nanalogy with North Scotland, oceanic input is probably comparable but we lack an estimate.  \nEstimated production would only use a small fraction of the nutrient supply, with the balance \nprobably exported to the Arctic.  Data and models suggest annual primary production of \nabout 120-160 g C m\n-2\n (Slagstad et al., 1999).  Integrated along the shelf, average organic \ncarbon production is small relative to import from the North Sea. \n 6 Discussion and future work \n6.1  Process contributions \nThe following characterise the west-European margin.  There is poleward along-slope flow, \nwhich is not uniform, may not be spatially continuous, e.g. there is less evidence for it around \nsouth-east Biscay, and may also lie under different surface flow, especially during upwelling.  \nStrong wind forcing with downwelling prevails north of Biscay and summer upwelling off \nIberia.  Well developed upwelling may form filaments increasing ocean-shelf exchange.  \nThere are strong tidal currents and mixing on wide shelves.  Eddy exchange is relatively \nsmall except in the north.  Freshwater influence is moderate except for the Norwegian \nCoastal Current.  There are local rectified tides, solitons and cascading.  Overall exchange is \nestimated as 2-3 m\n2\n\/s. \nThe combination of estimated exchange-process contributions in Sect. 5 (for W Iberia, Table \n1) is encouraging in relation to independent estimates of overall exchange and the summer \nenhancement.  However, exchanges from different processes are not necessarily additive.  \nPoleward flow along the slope may occur (as an undercurrent) with summer upwelling, but \ntheir effects on cross-slope flow will tend to cancel, or “at best” co-exist with upwelling \nabove the undercurrent and hence correspondingly reduced vertical extent and transport.  Or, \npoleward flow may be in part a response to wind forcing in a downwelling sense so that \nsimple addition has an element of double-accounting.  During summer upwelling off western \nIberia, the filaments probably take up most of the offshore wind-driven Ekman transport \n(shown under “Wind” in Table 1 but omitted from the summer “Total”).  Otherwise, eddy \nand filament entries in Table 1 are for discrete localised features and can probably be added \nto the more extensive slope current and wind-forced exchanges.  Internal tides are on a \nrelatively small scale (especially the non-linear solitons giving water transport) and are \nprobably additive on the basis of scale separation.  In principle, larger-scale flow might \nadvect internal waves and modulate their contribution, but on-offshore flows are relatively \nslow except locally in filaments and eddies (1 m\n2\n\/s corresponds to 0.01 m\/s in 100 m depth). \nThe encouragement from combining exchange-process estimates reinforces the use of \nmodels, when tested for their representation of processes.  In most locations, measurements \nare insufficient to determine exchanges; some basis is needed to extrapolate from measured \ncontexts.  Numerical models are potentially a rational basis for extrapolation, giving practical \neffect to theory, especially for 3-D representation of complex domains and processes.  \nBudgeting is inherent in models (if properly formulated). \n6.2  Variability \nThe model estimate 2.5 Sv (Sect. 3) for overall exchange from Brittany to Norway (about \n2000 km of shelf edge) is about half of the amount suggested by the Table 1 values (1.7 to 4 \nm\n2\n\/s per unit length of shelf) over this distance.  This is consistent with averaging in the \nmodel estimate: entries in Table 1 but averaged out in the model estimate include temporal \nreversals in wind-driven transports, internal tide contributions on spatial scales unresolved in \nthe model, and seasonal processes. \nSeasonality from the 1960-2004 model calculation is shown in Table 3 for the seven sectors \nillustrated in Fig. 3.  In most sectors (either upper or lower level) mean fluxes (and their \nstandard deviations) are rather larger in winter than summer.  This accords with Table 1 \nestimates for winds (the main contributor) from West of Ireland to North of Scotland, albeit \nthe winter-summer differences are less in the model results. \nInterannual variability in the model results is quite small.  Individual sectors, layers and \nseasons, from sections 4 to 7, and section 3 upper layer, have the same sign of seasonal flux \nevery year (except section 4 lower is just positive in winter 1969).  The overall exchange \nestimate 2.5 has standard deviation less than 0.4 over the 45 years 1960 to 2004. \n6.3  Relation to carbon budget \nThe overall circulation with downwelling O(1 Sv) north of Biscay has an important role in \nbiogeochemical cycles and specifically the carbon pump.  The along-slope current acts to \nreplenish on-shelf nutrients, aiding summer draw-down of CO2 in producing organic carbon.  \nModelled inorganic and organic carbon budgets for this region (47°-62°N) are outlined in \nTable 2.  Production is almost balanced by respiration within the water column (as a whole; \nproduction is biased to the upper layer and respiration to the lower layer during summer \nstratification).  These tidally active shelf seas lack 'export production' or burial (settling is \nalmost balanced by benthic respiration).  Hence (to conserve carbon) large air-sea CO2 flux \nimplies divergent dissolved inorganic carbon (DIC) transport.  Then the overall downwelling \nallows transport of dissolved material from river input and regions of high production to the \ndeep ocean.  In particular, near-bottom transport of DIC off the shelf, below the permanent \nthermocline on time scales less than a year, facilitates CO2 drawdown again in the next \ngrowing season.  [The off-shelf flow of near-bottom water is equivalent to evacuating the \nbottom quarter of the whole shelf in less than one year, or the whole shelf volume in ~ 3 \nyears.  The implied inorganic carbon concentration in the modelled 2.5 Sv exchange is about \n0.05 molC\/m\n3 \n(excess of export to the ocean over import from the ocean)].  This off-shelf \nflow is not uniform: the margin from Ireland to the Norwegian Trench and areas of the North \nSea are most effective.  \nThere is no simple relation between productivity and air-sea CO2 flux.  Modelling this flux in \nshelf seas requires accurate representation of the circulation, mixing, chemistry and biology; \nthese are all factors in the carbon “pump” concept.  The near-coastal region is particularly \nimportant: it can act as either a CO2 sink or a source.  However, this region is also the most \nchallenging in the need for model improvements to represent complex optics, fine horizontal \nresolution and uncertain land-sea fluxes. \nThe outcome is that the west-European shelf is a net sink of atmospheric CO2.  Within this, \nshelf edge regions tend to be strong sinks, open stratified regions are neutral or weaker sinks, \ncoastal regions are either sources or sinks. \n \nAcknowledgements \nThis work is primarily funded under the UK Natural Environment Research Council Oceans \n2025 programme.  The JGOFS-LOICZ Continental Margin Task Team instigated much of \nthis study.  J.M. Huthnance thanks SCOR for funding his participation in the “Deep Ocean \nExchange with the Shelf” workshop, Cape Town, October 2008, leading to this article.  We \nthank the three referees for constructive comments. \n \nReferences \nAllen, J. I., Blackford, J., Holt, J. T., Proctor, R., Ashworth M., and Siddorn, J.: A highly \nspatially resolved ecosystem model for the North West European continental shelf.  Sarsia, \n86, 423-440, 2001. \nBarton, E. D., Inall, M. E., Sherwin, T. J., and Torres, R.: Vertical structure, turbulent mixing \nand fluxes during Lagrangian observations of an upwelling filament system off Northwest \nIberia.  Prog. Oceanogr., 51, 249-267, 2001. \nBiscaye, P.E., Flagg, C. N., and Falkowski, P. G.: The Shelf Edge Exchange Processes \nexperiment, SEEP-II: an introduction to hypotheses, results and conclusions.  Deep-Sea Res. \nII, 41, 231-252, 1994. \nBooth, D.A.: Horizontal dispersion in the north east Atlantic.  Deep-Sea Res., 35, 1937-1951, \n1988. \nBurrows, M., and Thorpe, S. A.: Drifter observations of the Hebrides slope current and \nnearby circulation patterns.  Ann. Geophys., 17, 280-302, 1999a. \nBurrows, M., Thorpe, S. A., and Meldrum, D. T.: Dispersion over the Hebrides and Shetland \nshelves and slopes.  Continental Shelf Res., 19: 49-55, 1999b. \nCooper, L. N. H., and Vaux, D.: Cascading over the continental slope of water from the \nCeltic Sea.  J. Mar. Biol. Assoc. UK, 28, 719-750, 1949. \nDaniault, N., Mazé J. P., and Arhan, M.: Circulation and mixing of Mediterranean water west \nof the Iberian peninsula.  Deep-Sea Res., 41, 1685-1714, 1994. \nDickson, R. R., and McCave, I. N.: Nepheloid layers on the continental slope west of \nPorcupine Bank.  Deep-Sea Res., 33, 791-818, 1986. \nFairall, C. W., Bradley, E. F., Hare, J. E., Grachev, A. A., and Edson, J. B.: Bulk \nparameterization of air-sea fluxes: updates and verification for the COARE algorithm.  J. \nClimate, 16, 571-591, 2003. \nFiuza, A. F. G., Hamann, M., Ambar, I., Del Rio, G. D., Gonzalez, N., Cabanas J. M., and \nDiaz Del Rio, G.: Water masses and their circulation off western Iberia during May 1993.   \nDeep-Sea Res., 1, 45, 1127-1160, 1998. \nFrankignoulle, M. and Borges, A. V.: European continental shelf as a significant sink for \natmospheric carbon dioxide.  Global Biogeochem. Cycles, 15, 569-576, 2001. \nFrouin, R., Fiuza, A. F. G., Ambar I., and Boyd, T. J.: Observations of a poleward surface \ncurrent off the coasts of Portugal and Spain during winter.  J. Geophys. Res., 95, 679-691, \n1990. \nHarikrishnan, M.: Flow and water column structure at the Hebridean shelf-edge.  PhD thesis, \nUniversity of Wales, Bangor, xi + 86pp + figures, 1998. \nHickey, B. M. and Banas, N. S.: Why is the northern end of the California Current System so \nproductive?  Oceanography, 21(4), 90-107, 2008. \nHill, A. E., Hickey, B. M., Shillington, F. A., Strub, P. T., Brink, K. H., Barton E. D., and \nThomas, A. C.: Eastern Ocean Boundaries: Coastal Segment (E).  The Sea, 11 (A. R. \nRobinson, K. H. Brink, eds.), 29-67, 1998a.  \nHill, A. E., Souza, A. J., Jones, K., Simpson, J. H., Shapiro, G. I., McCandliss, R., Wilson, \nH., and Leftley, J.: The Malin cascade in winter 1996.  J. Mar. Res., 56, 87-106, 1998b. \nHolt, J. T. and Proctor, R.: The seasonal circulation and volume transport on the northwest \nEuropean continental shelf: a fine-resolution model study.  J. Geophys. Res., 113: \ndoi:10.1029\/2006JC004034, 2008. \nHolt, J. T., Wakelin, S. L., and Huthnance, J. M.: The downwelling circulation of the \nnorthwest European continental shelf: a driving mechanism for the continental shelf carbon \npump.  Geophys. Res. Lett., 36, L14602, doi: 10.1029\/2009GL038997, 2009. \nHowarth, M. J., Dyer, K. R., Joint, I. R., Hydes, D. J., Purdie, D. A., Edmunds, H., Jones, J. \nE., Lowry, R. K., Moffatt, T. J., Pomroy A. J., and Proctor, R.: Seasonal cycles and their \nspatial variability.  Philos. Trans. Roy. Soc. London, A 343, 383-403, 1993. \nHughes, C. W., and Meredith, M. P.: Coherent sea-level fluctuations along the global \ncontinental slope.  Philos. Trans. Roy. Soc. London, A364, 885-901, 2006. \nHuthnance, J. M.: Slope currents and JEBAR.  J. Phys. Oceanogr., 14, 795-801, 1984. \nHuthnance, J. M.: The Rockall slope current and shelf-edge processes, Proc. Roy. Soc. \nEdinburgh, 88B, 83-101, 1986. \nHuthnance, J. M.: Circulation, exchange and water masses at the ocean margin: the role of \nphysical processes at the shelf edge.  Prog. Oceanogr., 35, 353-431, 1995. \nHuthnance, J. M.: North Sea interaction with the North Atlantic Ocean.  Deutsche Hydrogr. \nZeit., 49, 153-162, 1997.  \nHuthnance, J. M.: The Northeast Atlantic Margins.  Pp. 215-234 in Subpolar Margins (ed. J. \nSharples), Continental Margins Task Team, in press, 2009. \nHuthnance, J. M., Coelho, H., Griffiths, C. R., Knight, P. J., Rees, A. P., Sinha, B., \nVangriesheim, A., White, M., and Chatwin, P. G.: Physical structures, advection and mixing \nin the region of Goban Spur.  Deep-Sea Res. II, 48, 2979-3021, 2001. \nHuthnance, J. M., van Aken, H. M., White, M., Barton, E. D., Le Cann, B., Coelho, E. F., \nFanjul, E. A., Miller, P., and Vitorino, J.: Ocean margin exchange – water flux estimates.  J. \nMar. Systems, 32, 107-137, 2002. \nIsemer, H.-J., and Hasse, L.: The Bunker climate atlas of the North Atlantic Ocean.  1: \nObservations.  Springer-Verlag, Berlin Heidelberg, vii + 218pp, 1985. \nIversen, S. A., Skogen, M. D., and Svendsen, E.: Availability of horse mackerel (Trachurus \ntrachurus) in the north-eastern North Sea, predicted by the transport of Atlantic water.  \nFisheries Oceanography, 11, 245-250, 2002. \nJahnke, R. A., Roman, M. R., and Brink, K. H.: Coastal Ocean Processes program: advancing \ninterdisciplinary research and technology development.  Oceanography, 21, 18-21, 2008.  \nJeans, D. R. G., and Sherwin, T. J.: The evolution and energetics of large amplitude nonlinear \ninternal waves on the Portuguese shelf.  J. Mar. Res., 59, 327-353, 2001a. \nJeans, D. R. G., and Sherwin, T. J.: The variability of strongly non-linear solitary internal \nwaves observed during an upwelling season on the Portuguese shelf.  Continental Shelf \nRes., 21, 1855-1878, 2001b. \nJoint, I., and Wassmann, P.: Lagrangian studies of the Iberian upwelling system - an \nintroduction. A study of the temporal evolution of surface production and fate of organic \nmatter during upwelling on and off the NW Spanish continental margin.  Prog. \nOceanogr., 51, 217-220, 2001. \nJoint, I., Wollast, R., Chou, L., Batten, S., Elskens, M., Edwards, E., Hirst, A., Burkill, P., \nGroom, S., Gibb, S., Miller, A., Hydes, D., Dehairs, F., Antia, A., Barlow, R., Rees, A., \nPomroy, A., Brockmann, U., Cummings, D., Lampitt, R., Loijens, M., Mantoura, F., Miller, \nP., Raabe, T., Alvarez-Salgado, X., Stelfox, C., and Woolfenden, J.: Pelagic production at the \nCeltic Sea shelf break.  Deep-Sea Res. II, 48, 3049-3081, 2001. \nJosey, S. A., Kent, E. C., and Taylor, P. K.: The Southampton Oceanography Centre (SOC) \nOcean-Atmosphere Heat, Momentum and Freshwater Flux Atlas.  SOC Report 6, 30pp. and \nfigures, 1998.  \nJosey, S. A., Kent, E. C., and Taylor, P. K.: Wind stress forcing of the ocean in the SOC \nClimatology: comparisons with the NCEP-NCAR, ECMWF, UWM\/COADS and Hellerman \nand Rosenstein datasets.  J. Phys. Oceanogr., 32, 1993-2019, 2002. \nKnight, P. J., and Howarth, M. J.: The flow through the north channel of the Irish Sea.  \nContinental Shelf Res., 19, 693-716, 1999. \nKudela, R. M., Banas, N. S., Barth, J. A., Frame, E. R., Jay, D. A., Largier, J. L., Lessard, E. \nJ., Peterson, T. D., and Vander Woude, A. J.: New insights into the controls and mechanisms \nof plankton productivity in coastal upwelling waters of the northern California Current \nSystem.  Oceanography, 21(4), 46-52, 2008. \nLenhart, H. J., Radach, G., Backhaus, J. O., and Pohlmann, T.: Simulations of the North Sea \ncirculation, its variability, and its implementation as hydrodynamical forcing in ERSEM.  \nNetherlands J. Sea Res., 33, 271-299, 1995. \nLiu, K.-K., Iseki, K., and Chao, S.-Y.: Continental margin carbon fluxes.  Pp. 187-239 In: \nThe Changing Ocean Carbon Cycle (Eds. R.B. Hanson, H.W. Ducklow and J.G. Field), \nCambridge University Press, Cambridge, 2000. \nLonghurst, A.: The Ecological Geography of the Sea, Academic Press, San Diego, xiii+398 \npp, 1998. \nMcCandliss, R., Jones, S. E., and Jago, C. F.: Distribution and fluxes of suspended particulate \nmatter at the Hebridean shelf edge.  Abstract, Exchange Processes at the Ocean Margins.  \n32\nnd\n International Liège Colloquium on Ocean Hydrodynamics, Liège, 8-12 May, 2000. \nMcCave, I. N., Hall, I. R., Antia, A. N., Chou, L., Dehairs, F., Lampitt, R. S., Thomsen, L., \nvan Weering, T. C. E., and Wollast, R.: Distribution, composition and flux of particulate \nmaterial over the European margin at 47º-50ºN: Results from OMEX I.  Deep-Sea Res. II, 48, \n3127-3139, 2001. \nMcClimans, T. A., Johnannessen, B. O., and Jenserud, T.: Monitoring a shelf edge current \nusing bottom pressures or coastal sea-level data.  Continental Shelf Res., 19, 1265-1283, \n1999. \nMoll, A., and Radach, G.: Review of three-dimensional ecological modelling related to the \nNorth Sea: Part 1 models and their results.  Prog. Oceanogr., 57, 175-217, 2003. \nMonaco, A., Biscaye, P. E., Soyer, J., Pocklington, R., and Heussner, S.: Particle fluxes and \necosystem response on a continental margin: the 1985-1988 Mediterranean ECOMARGE \nexperiment.  Continental Shelf Res., 10, 809-839, 1990. \nMuller-Karger, F. E., Varela, R., Thunell, R., Luerssen, R., Hu, C., and Walsh, J. J.: The \nimportance of continental margins in the global carbon cycle.  Geophys. Res. Lett., 32, \nL01602, doi:10.1029\/2004GL021346, 4 pp, 2005. \nMunk, W., and Wunsch, C.: Abyssal recipies II: energetics of tidal and wind mixing.  Deep-\nSea Res. I, 45, 1977-2010, 1998. \nNew, A. L., and Pingree, R. D.: Evidence for internal tidal mixing near the shelf break in the \nBay of Biscay.  Deep-Sea Res., 37, 1783-1803, 1990. \nOSPAR: Quality Status Report 2000 for the North-East Atlantic.  OSPAR Commission, \nhttp:\/\/www.ospar.org\/eng\/html\/qsr2000, 2000. \nPingree, R. D., and Le Cann, B.: Celtic and Armorican slope and shelf residual currents.  \nProg. Oceanogr., 23, 303-338, 1989. \nPingree, R. D., and Le Cann, B.: Structure, strength and seasonality of the slope currents in \nthe Bay of Biscay region.  J. Mar. Biol. Assoc. UK, 70, 857-885, 1990. \nPingree, R. D., and Le Cann, B.: Three anticyclonic slope water ocean eddies (SWODDIES) \nin the southern Bay of Biscay in 1990.  Deep-Sea Res., 39, 1147-1175, 1992.  \nPingree, R. D., and New, A. L.: Downward propagation of internal tidal energy into the Bay \nof Biscay.  Deep-Sea Res., 36, 735-758, 1989. \nPingree, R. D., Holligan, P. M., Mardell, G. T., and Head, R.N.: The influence of physical \nstability on spring, summer and autumn phytoplankton blooms in the Celtic Sea.  J. Mar. Biol. \nAssoc. UK, 56, 845-873, 1976. \nPingree, R. D., Holligan, P. M., and Mardell, G. T.: The effects of vertical stability on \nphytoplankton distributions in the summer on the northwest European shelf.  Deep-Sea Res., \n25, 1011-1028, 1978. \nPingree, R. D., Sinha, B., and Griffiths, C.R.: Seasonality of the European slope current \n(Goban Spur) and ocean margin exchange.  Continental Shelf Res., 19, 929-975, 1999. \nPoulain, P.-M., Warn-Varnas, A., and Niiler, P. P.: Near-surface circulation of the Nordic \nseas as measured by Lagrangian drifters.  J. Geophys. Res., 101, 18237-18258, 1996. \nPrandle, D.: A modelling study of the mixing of \n137\nCs in the seas of the European continental \nshelf.  Philos. Trans. Roy. Soc. London, A 310, 407-436, 1984. \nPrandle, D., Ballard, G., Flatt, D., Harrison, A. J., Jones, S. E., Knight, P. J., Loch, S., \nMcManus, J., Player, R., and Tappin, A.: Combining modelling and monitoring to determine \nfluxes of water, dissolved and particulate metals through the Dover Strait.  Continental Shelf \nRes., 16, 237-257, 1996. \nProctor, R., Chen, F., and Tett, P. B.: Carbon and nitrogen fluxes across the Hebridean shelf \nbreak, estimated by a 2D coupled physical-microbiological model.  The Science of the Total \nEnvironment, 314-316, 787-800, 2003.   \nRadach, G., and Lenhart, H. J.: Nutrient dynamics in the North Sea: fluxes and budgets in the \nwater column derived from ERSEM.  Netherlands J. Sea Res., 33, 301-335, 1995. \nSamelson, R. M., Allen, J. S., and MacCready, P.: Progress in coastal ocean modeling during \nCoOP.  Oceanography, 21(4), 136-140, 2008. \nShapiro, G. I., Huthnance, J. M., and Ivanov, V.V.: Dense water cascading off the continental \nshelf.  J. Geophys. Res., 108 (C12), 3390, doi:10.1029\/2002JC001488, 2003. \nSherwin, T. J.: Analysis of an internal tide observed on the Malin Shelf, north of Ireland.  J. \nPhys. Oceanogr., 18, 1035-1050, 1988. \nSherwin, T. J.: Evidence of a deep internal tide in the Faeroe-Shetland Channel.  Pp. 469-488 \nin Tidal Hydrodynamics, B.B. Parker, Ed., John Wiley & Sons, New York, 1991. \nSherwin, T. J., Turrell, W. R., Jeans, D. R. G., and Dye, S.: Eddies and a mesoscale deflection \nof the slope current in the Faroe-Shetland Channel.  Deep-Sea Res. I, 46, 415-438, 1999. \nSherwin, T. J., Williams, M. O., Turrell, W. R., Hughes, S. L., and Miller, P. I.: A description \nand analysis of mesoscale variability in the Faroe-Shetland Channel.  J. Geophys. Res., 111, \nC03003, doi:10.1029\/2005JC002867, 2006. \nSimpson, J. H.: The North Sea project: an overview and the way forward.  Philos. Trans. Roy. \nSoc. London, A343, 585-596, 1993. \nSimpson, J. H.: Tidal processes in shelf seas.  The Sea, 10 (K. H. Brink and A. R. Robinson, \neds.), 113-150, 1998a. \nSimpson, J. H.: The Celtic Seas.  The Sea, 11 (A. R. Robinson and K. H. Brink, eds.), 659-\n698, 1998b. \nSkagseth, Ø., Orvik, K. A., and Furevik, T.: Coherent variability of the Norwegian Atlantic \nSlope Current derived from TOPEX\/ERS altimeter data.  Geophys. Res. Lett., 31, L14304, \n2004. \nSlagstad, D., Tande, K. S., and Wassmann, P.: Modelled carbon fluxes as validated by field \ndata on the north Norwegian shelf during the productive period in 1994.  Sarsia, 84, 303-317, \n1999. \nSmith, J. A., Damm, P. E., Skogen, M. D., Flather, R. A., and Patsch, J.: An investigation into \nthe variability of circulation and transport on the North-West European shelf using three \nhydrodynamic models.  Deutsche Hydrogr. Zeit., 48, 325-347, 1996. \nSouza, A. J., Simpson, J. H., Harikrishnan, M., and Malarkey, J.: Flow structure and \nseasonality in the Hebridean slope current.  Oceanol. Acta, 24, S63-S76, 2001. \nThomas, H., Bozec, Y., Elkalay, K., and de Baar, H. J. W.: Enhanced open ocean storage of \nCO2 from shelf sea pumping.  Science, 304, 1005-1008, 2004. \nThomas, H., Bozec, Y., de Baar, H. J. W., Elkalay, K., Frankignoulle, M., Schiettecatte, L. S., \nKattner, G., and Borges, A. V.: The carbon budget of the North Sea.  Biogeosciences, 2, 87-\n96, 2005. \nTrowbridge, J. H., Chapman, D. C., and Candela, J.: Topographic effects, straits and the \nbottom boundary layer.  The Sea, 10 (K. H. Brink and A. R. Robinson, eds.), 63-88, 1998. \nVan Aken, H. M.: The hydrography of the mid-latitude north-east Atlantic Ocean: III.  The \nthermocline water mass.  Deep-Sea Res., I 48, 237-267, 2001. \nVan Weering, T. C. E., and McCave, I. N.: Benthic processes and dynamics at the NW \nIberian margin: an introduction.  Prog. Oceanogr., 52, 123-128, 2002. \nWinther, N. G., and Johannessen, J. A.: North Sea circulation: Atlantic inflow and its \ndestination.  J. Geophys. Res.-Oceans, 111, C12018, 2006. \nWollast, R.: Interactions of carbon and nitrogen cycles in the coastal zone.  Pp. 195-201 in \nInteractions of C, N, P and S biogeochemical cycles and global change (ed. R. Wollast, F. T. \nMackenzie and L. Chou), NATO ASI Series, I 4.  Berlin: Springer-Verlag, 1993. \nWollast, R., and Chou, L.: The carbon cycle at the ocean margin in the northern Gulf of \nBiscay.  Deep-Sea Res. II, 48, 3265-3292, 2001. \nYoung, E. F., and Holt, J. T.: Prediction and analysis of long-term variability of temperature \nand salinity in the Irish Sea.  J. Geophys. Res., 112,  doi:10.1029\/2005JC003386, 2007. \nFigure legends \nFigure 1.  Outline map of west-European shelf region, with 200m depth contour, 1000m \ncontours thereafter and divisions (red) between shelf sectors (Sect. 5). \n \nFigure 2.  Schematic of stratification and cross-slope exchange processes. \n \nFigure 3.  Fluxes (Sv) above 150m (blue) and below 150m depth (red).  All fluxes are across \nthe 200m contour shown; positive is onto the shelf except next to Norway (positive to north). \n \nFigure 4.  Evolution of modelled surface concentration of tracer during 2002-2003.  Initial \nconcentration (beginning of 2002) was 100 m\n-3\n everywhere where total depth > 2000 m, zero \nelsewhere. [Within and somewhat beyond the 150m isobath, concentrations homogenize \nthrough the water column each winter]. \n \nFigure 5.  Elements of shelf-sea carbon budget. \n \nFigure 6.  Sea-surface temperature off Iberia, 6-12 September 1998, showing upwelled water \n(coldest against coast) and filaments of cooler water extending offshore near (44°N, 9°W), \n(43°N, 10°W) and (42°N, 10°W).  Satellite data were received and processed by the NERC \nEarth Observation Data Acquisition and Analysis Service (NEODAAS) at Dundee University \nand Plymouth Marine Laboratory (www.neodaas.ac.uk). \n \n \nTable 1  Estimated process contributions to ocean-shelf water exchange (m\n2\n\/s) by sector.  \nExchange time = shelf volume \/ total exchange rate. \nUnder Slope current are estimated bottom Ekman layer transports (Sect. 4) based on the steric \nslope and stratification depth (Huthnance, 1995) relative to conditions off W Scotland (Sect. \n6) where there is direct estimate (Harikrishnan, 1998).  Under Wind are “winter” (November-\nApril) and “summer” (May-Octotber) averages of cross-shelf edge Ekman flux (Sect. 4); \nthese use monthly wind speeds from Josey et al.(1998; 2002) and wind directions and \nstandard deviations from Isemer and Hasse (1985); typical standard deviations of the six \nmonthly values about the given average are ± 25%.  However, North Sea fluxes (not at the \nshelf edge) are based on estimates of flow between Scotland and Norway, see Sect. 5.8.  For \nother contributions see respective sections as indicated. \n \nSector \n(see Sect. no.) \nSlope Current \n(Ekman layer) \nEddies Wind \nsummer \nWind \nwinter \nFilament Internal Tide \n(summer only) \n~ \nTotal \nExchange \ntime (yr) \nNorway (5.9) 0.5 1 0.90 1.48   3 0.21 \nNorth Sea (5.8) 2   2   4 1 \nN Scotland (5.7) 0.5 1 1.06 1.81   3 0.08 \nW Scotland (5.6) 0.5  0.80 1.73  0.3 2 0.20 \nW Ireland (5.5) 0.5  0.67 1.55   1.7 0.23 \nCeltic Sea (5.4) 0.5  0.78 1.09 1 1 3 0.28 \nE Biscay (5.3) 0.2  0.77 1.22   1.2 0.34 \nS Biscay (5.2) 0.5 0.16 0.64 1.26   1.6 0.05 \nW Iberia summer(5.1) 1 0.6 1.03  3 1 5.6 0.02 \nW Iberia winter (5.1) 1 0.6  0.99   2.2 0.05 \nTable 2  Model estimates of carbon budget elements, 47°-62°N from Wakelin et al. (in \npreparation). \nInorganic Carbon \nunits 1012 molC\/yr \nOrganic Carbon \nunits 1012 molC\/yr \n \nRespiration - Production -0.05 Production - Respiration +0.05  \nAdvection  -4.0 Advection +0.65  \nAir to sea +0.9    \nBenthic respiration +0.8 Erosion - settling -0.82 Difference is burial 0.02 \nRivers  +2.4 Rivers ? ?: model numerics \ngenerate some \n∂C\/∂t +0.05 ∂C\/∂t +0.01  \n \nTable 3  Model estimates of fluxes (Sv), above (upper) and below 150m (lower) across the \n200m contour, for the seven shelf sectors counting poleward, as in Figure 3.  Means and \nstandard deviations (StDv) are over the 45 years 1960 to 2004. \nSector Summer mean Winter mean Summer StDv Winter StDv \n7 upper 0.906 1.071 0.089 0.136 \n7 lower 0.246 0.346 0.086 0.125 \n6 upper 0.679 0.807 0.086 0.130 \n6 lower -0.129 -0.162 0.020 0.027 \n5 upper 0.317 0.483 0.085 0.136 \n5 lower -0.452 -0.588 0.075 0.112 \n4 upper 0.946 1.134 0.253 0.298 \n4 lower -0.358 -0.413 0.163 0.207 \n3 upper 0.143 0.132 0.039 0.043 \n3 lower 0.009 0.003 0.010 0.012 \n2 upper 0.071 0.167 0.156 0.168 \n2 lower 0.056 0.042 0.083 0.072 \n1 upper -0.163 -0.243 0.161 0.170 \n1 lower 0.009 0.011 0.021 0.021 \n \n Figure 1.  Outline map of west-European shelf region, with 200m depth contour, 1000m \ncontours thereafter and divisions (red) between shelf sectors (Sect. 5). \nτW\nUT\nρ\nQR\n- solar heating\nτW - wind forcing\nUT - tidal currents\nQR - river inflow\nρ - ocean density forcing\nROFI - region of\nfreshwater influence\n- wind and wave mixing\nSummer\nstratified\nTidal\nmixing\nfront \nMixed \nMixed \nROFI\nPoleward slope current\nEkman transport below\nInternal waves\nSeasonal thermocline\n(stratification)\nMeander\/eddy in\nalong - slope flow\nDownwelling circulation\n \nFigure 2.  Schematic of stratification and cross-slope exchange processes. \nFigure 3.  Fluxes (Sv) above 150m (blue) and below 150m depth (red).  All fluxes are across \nthe 200m contour shown; positive is onto the shelf except next to Norway (positive to north). \n Figure 4.  Evolution of modelled surface concentration of tracer during 2002-2003.  Initial \nconcentration (beginning of 2002) was 100 m\n-3\n everywhere where total depth > 2000 m, zero \nelsewhere. [Within and somewhat beyond the 150m isobath, concentrations homogenize \nthrough the water column each winter]. \n150 m depth \ncontour \nTracer concentration \n= 0.1m\n-3\n \nTracer concentration \n= 0.1m\n-3\n \nSea surface\nThermocline\nS\ne\nc\ntio\nn\nDeep Ocean\nShelf sea\nVertical asymmetry in\nproduction – respiration,\nhence air-sea CO2 difference.\nWell mixed in winter.\nCarbon removed laterally.\nPhotosynthesis\nRespiration Mixing\nAdvection\nRiversAir-\nsea\n \nFigure 5.  Elements of shelf-sea carbon budget. \nNEODAAS\n \nFigure 6.  Sea-surface temperature off Iberia, 6-12 September 1998, showing upwelled water \n(coldest against coast) and filaments of cooler water extending offshore near (44°N, 9°W), \n(43°N, 10°W) and (42°N, 10°W).  Satellite data were received and processed by the NERC \nEarth Observation Data Acquisition and Analysis Service (NEODAAS) at Dundee University \nand Plymouth Marine Laboratory (www.neodaas.ac.uk). \n \n"}