{"doi":"10.2752\/175183508X377609","coreId":"8264","oai":"oai:eprints.brighton.ac.uk:5636","identifiers":["oai:eprints.brighton.ac.uk:5636","10.2752\/175183508X377609"],"title":"I found myself inside her fur...","authors":["Harper, Catherine"],"enrichments":{"references":[{"id":42743412,"title":"Her Body, Himself: Gender in the Slasher Film. Representations, University of California Press, Fall 1987, 20:187-228 http:\/\/www.representations.org\/topic_body.php (accessed 1","authors":[],"date":"1987","doi":"10.2307\/2928507","raw":"London: Vintage Book Clover, C. (1987) Her Body, Himself: Gender in the Slasher Film. Representations, University of California Press, Fall 1987, 20:187-228 http:\/\/www.representations.org\/topic_body.php (accessed 1 March 2008) Croft, C. (2005) Aborted lambs are new fashion victims. The Sunday Times Style Magazine, 6 March www.timesonline.co.uk\/tol\/news\/uk\/article420528.ece da Cruz, E. (2005) Man-Eater in Bolton, A. Wild: Fashion Untamed. The Metropolitan Museum of Art, New York. Yale University Press: New Haven and London, pp.144-175 Dworkin, A. (1987) Intercourse. London: Secker & Warburg Entwistle, J. (2000) The Fashioned Body: Fashion, Dress and Modern Social Theory.","cites":null},{"id":42743414,"title":"Love and War: The Weaponized Woman. New York: Museum at FIT Veterinary Medical Association (2001) Panel on Euthanasia Report","authors":[],"date":"2006","doi":null,"raw":"Steele, V. (2006) Love and War: The Weaponized Woman. New York: Museum at FIT Veterinary Medical Association (2001) Panel on Euthanasia Report 2000, Journal of the American Veterinary Medical Association 218:669-696 von Sacher-Masoch, L. 1989. Venus in Furs. New York: Zone Books Williams, L. (1990) Hard Core: Power, Pleasure, and the ‘Frenzy of the Visible’.","cites":null},{"id":42743415,"title":"Silence of the Lambs","authors":[],"date":"1925","doi":null,"raw":"The Joyless Street (dir. G.W. Pabst, 1925) Butterfield 8 (dir. D. Mann, 1960) Rebecca (dir. A. Hitchcock, 1940) Silence of the Lambs (dir. J. Demme, 1991) Cat People (dir. P. Schrader, 1982) Snuff (dir. M. and R. Findlay, 1976) Miscellaneous The Bible, Genesis 111: 21 Velvet Underground (1966) Venus in Furs","cites":null},{"id":42743413,"title":"The Cultural Politics of Fur.","authors":[],"date":"1979","doi":null,"raw":"Cambridge: Polity Press Emberley, J.V. (1979) The Cultural Politics of Fur. Ithaca: Cornell University Press Emberley, J.V. (1998) Venus and Furs: the cultural politics of fur London: I.B. Tauris and Co. Ltd Ewing, E. (1981) Fur in Dress. London: B.T. Batsford Federman, R. (2001) Aunt Rachel’s Fur. Normal Tallahassee: FC2 Frankel, S. (1997) Fur's big comeback snares supermodel: objections to pelts may be just skin deep. The Guardian, 8 March Freud, S. (1995) trans., edited, introduced Brill, A.A. The Basic Writings of Sigmund Freud (Psychopathology of Everyday Life, the Interpretation of Dreams, and Three Contributions to the Theory of Sex). New York: Random House Garnett, D. (1922) Lady into Fox. Authorhouse Hamlyn, A. (2003) Freud, Fabric, Fetish. Textile: the Journal of Cloth and Culture, 1:1:9-27 Harper, C. (2005) Pelting Down. Selvedge magazine 8:(Nov\/Dec):20-21 Haven, P. (2002) Karzai’s Hat Made From Lamb Fetus. Associated Press, 23 April Hoffmann, M. (2006) It’s a battle of trapper tradition vs. animal protection. Milwaukee Journal Sentinel online, 2 April www.jsonline\/story\/index.aspx?id=411446 (accessed 20 October 2006) Hollander, A. (1995) Sex and Suits: The Evolution of Modern Dress. New York: Kodansha International Silverman, K. (1988) Acoustic Mirror: The Female Voice in Psychoanalysis and Cinema (Theories of Representation and Difference). Bloomington and Indianapolis: Indiana University Press Kardasis, B. 2005, telephone interview with author Konopnicki, S. (1995) Eloge de la fourrure: petit traité du poil lustré. Paris: Seuil Lurie, A. The Language of Clothes. London: Bloomsbury McVeigh, T. (1999) Naomi on the catwalk, looking sheepish in wolf's clothing. Express, 18 February Municchi, A. (1992) Ladies in Fur 1900-1940. Modena, Italy: Zanfi Nadeau, C. (2001) Fur Nation: From the Beaver to Brigitte Bardot. London: Routledge North, R.D. (1999) Fur and Freedom: a defence of the fur trade. December (British Fur Trade Association) http:\/\/www.richarddnorth.com\/books\/downloads\/F4Fweb.htm Quan, T. (1998) Pretty in Mink. www.salon.com\/feature\/1998\/05\/cov 26_ feature.html 26 May (accessed 17 November 2006) Sanders, E. (2002) The Family. New York: Thunder’s Mouth Press Sennett, R. (1992, first published 1976) The Fall of Public Man. New York: Norton Skov, L. (2005) The Return of the Fur Coat: a Commodity Chain Perspective. Current Sociology 53:1:(January):9-32 Steele, V. (1996) Fetish: Fashion, Sex and Power. Oxford: Oxford University Press.","cites":null},{"id":42743410,"title":"The Metropolitan Museum of Art, New York. Yale University Press: New Haven and London, pp.11; 42-79 and 80-115","authors":[],"date":"1984","doi":null,"raw":"Wild: Fashion Untamed. The Metropolitan Museum of Art, New York. Yale University Press: New Haven and London, pp.11; 42-79 and 80-115 Bourdieu, P. (1984) trans. Nice, R. Distinction: A Social Critique of the Judgement of Taste. Cambridge, Massachusetts: Harvard University Press Carter, A. (2006, first published 1979) The Bloody Chamber and Other Stories.","cites":null},{"id":42743409,"title":"The Sexual Politics of Meat. New York: Continuum Anon.","authors":[],"date":"1990","doi":null,"raw":"Adams, C. (1990) The Sexual Politics of Meat. New York: Continuum Anon. (1999) Jungle stuff. The Economist, 7 August Anon. (1998) Standard Guidelines for the Operation of Chinchilla Ranches. Ontario Ministry of Agriculture and Food, March Arnold, R. (2001) Fashion, Desire and Anxiety: Image and Mortality in the 20th Century. London: I.B. Taurus Baldwin, F.E. (1926) Sumptuary Legislation and Personal Regulation in England. Johns Hopkins University Studies in Historical and Political Science 44, Baltimore: Johns Hopkins University Press Bataille, G. (1986, first published 1957) Eroticism: Death and Sensuality. San Francisco: City Lights Books Bell-Price, S. (2005) Call of the Wild in Bolton, A. Wild: Fashion Untamed. The Metropolitan Museum of Art, New York. Yale University Press: New Haven and London, pp.12-41 Bell-Price, S., da Cruz, E. (2005) Tigress in Bolton, A. Wild: Fashion Untamed. The Metropolitan Museum of Art, New York. Yale University Press: New Haven and London, pp.116-143 Bolton, A. (2005) Introduction; The Lion’s Share and Birds of Paradise in Bolton, A.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11","abstract":"Fur is the ultimate “fabric of desire.” Humans covet the gorgeousness of the stuff on the backs of the wild and the caged, and from that desire to those enacted in the orgasmic moment of death, the climactic moment of consumption, the ecstatic moment of the performic enactment of fur through wearing it, fur is synonymous with desire. In this article, the author examines fur as both a fetish-fabric that disavows its bodily origin, a material fabric tied to seduction, sensuality, and somatic sensation, and a sadist-fabric that cannot be decoupled from the pornographic “snuff” violence of its manufacture. Catherine Harper was a founder member of the Animal Rights Movement of Northern Ireland in 1983","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Berg Publishers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:5636<\/identifier><datestamp>\n      2015-03-19T16:03:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D57303030:57393030:57393930<\/setSpec><setSpec>\n      7375626A656374733D57303030:57393030:57393930<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/5636\/<\/dc:relation><dc:title>\n        I found myself inside her fur...<\/dc:title><dc:creator>\n        Harper, Catherine<\/dc:creator><dc:subject>\n        W990 Creative Arts and Design not classified elsewhere<\/dc:subject><dc:description>\n        Fur is the ultimate “fabric of desire.” Humans covet the gorgeousness of the stuff on the backs of the wild and the caged, and from that desire to those enacted in the orgasmic moment of death, the climactic moment of consumption, the ecstatic moment of the performic enactment of fur through wearing it, fur is synonymous with desire. In this article, the author examines fur as both a fetish-fabric that disavows its bodily origin, a material fabric tied to seduction, sensuality, and somatic sensation, and a sadist-fabric that cannot be decoupled from the pornographic “snuff” violence of its manufacture. Catherine Harper was a founder member of the Animal Rights Movement of Northern Ireland in 1983.<\/dc:description><dc:publisher>\n        Berg Publishers<\/dc:publisher><dc:date>\n        2008-11<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        <\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/5636\/1\/harper_inside_her_fur_Textile_Jun08.pdf<\/dc:identifier><dc:identifier>\n          Harper, Catherine  (2008) I found myself inside her fur...  Textile, 6 (3).  pp. 300-314.  ISSN 1475-9756     <\/dc:identifier><dc:relation>\n        http:\/\/www.bergpublishers.com\/?tabid=518<\/dc:relation><dc:relation>\n        10.2752\/175183508X377609<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/5636\/","http:\/\/www.bergpublishers.com\/?tabid=518","10.2752\/175183508X377609"],"year":2008,"topics":["W990 Creative Arts and Design not classified elsewhere"],"subject":["Journal article","PeerReviewed"],"fullText":"I found myself inside her fur… \n© Catherine Harper, 2008  \n \nA\u2029final\u2029version\u2029of\u2029this\u2029text\u2029was\u2029published\u2029in\u2029the\u2029Skin\u2029Special\u2029Issue\u2029(editor:\u2029Caryn\u2029Simonson)\u2029of\u2029Textile:\u2029the\u2029\nJournal\u2029of\u2029Cloth\u2029and\u2029Culture\u20296:3,\u2029Autumn\u20292008,\u2029pp.300‐314.\u2029\n\u2029\nAn\u2029earlier,\u2029shorter\u2029version\u2029of\u2029the\u2029paper\u2029was\u2029published\u2029in\u2029selvedge\u2029magazine\u2029(2005),\u2029and\u2029a\u2029paper\u2029based\u2029on\u2029it\u2029\nwas\u2029presented\u2029at\u2029the\u202911th\u2029International\u2029foundation\u2029of\u2029Fashion\u2029and\u2029Technology\u2029Institutes\u2029(IFFTI)\u2029conference,\u2029\nLondon\u2029College\u2029of\u2029Fashion,\u2029April\u20292009.\u2029This\u2029essay\u2029has\u2029been\u2029developed\u2029as\u2029a\u2029chapter\u2029for\u2029Catherine\u2029Harper’s\u2029\nsecond\u2029book\u2029Fabrics\u2029of\u2029Design\u2029(Berg,\u20292010).\u2029\n \n \n \nFor the wild beasts, their ‘snuff’ moment is the trap’s slamming shriek, blood-red \nwhip-lashed etching, shuddering on virgin snow, until the orgasmic arching stops and \nstiffens. Racoon, beaver, bear, fox, lynx, mink, otter, wolf, ermine – such exquisite \nbeauty renders the excruciating pain somehow poetic…  \n \nFor the farmed creatures, their sacrificial ‘snuff’ is the sanity-shattering cage-slam, \nincarceration breeding intolerable distress: repeated baying, pacing, twitching until \nthe petit mort of anal\/vaginal electrocution, of asphyxiation or poisoning, of pressing, \nstrangling, stamping, bludgeoning, or the heightened ecstasy of being skinned alive…   \n \n \nAvoidance of death-marks on the fetish-fabric of the fur is vital, allowing the \ndisavowal needed by fetish-purists who seek the idealised and non-bodily material \npleasure of a ‘fur experience’. This paper asserts that it is the heady mix of sex, \nsadism, seduction and sensuality that keeps fur both perennially attractive and \nascendant in the fashion industry, and connects it powerfully to the production and \nconsumption of the most notorious and unsavory of pornography: ‘snuff’. Snuff, as a \nverb, means to extinguish, douse, smother, choke, blow out, quench, and it is used \ninformally as replacement for ‘kill’ (first coined in Ed Sander’s The Family, based on \nCharles Manson’s story, the word was employed subsequently in the Findlay partners’ \ncommercial film Snuff, released in 1976 shortly after the US confiscation of several \nSouth American underground films containing footage of women apparently killed on \ncamera and during climactic sexual action). Such filmic ‘snuff’ violently discloses the \nbody and its private parts, negating the disavowal of fetishism by insisting that its gift \nis essentially overt, violent and real. Somewhere within a territory of perversity, \ninformed and troubled by definitions and corruptions of fetishism and sadism, \nhowever, fur dynamically co-joins the fetishistic disavowing pleasure of its rich surface \nwith the overt deliberateness of suffering at its point of production (in turn informing \nits moment of consumption, where arguably it activates commodity fetishism again). \nFur fabric manages to perform this oscillation between the disclaimer of the fur \nfetishist and the de-fetishized knowingness of the fur sadist, corrupting both in its \ninsinuation that the deep and complex perversion of Western fur appreciation – \ncertainly post-1980s PETA – lies in the fetishist’s obverse acceptance of the ‘attraction \nof repulsion’, the inversion of the traditional male fetishist in the legions of fur-\nwearing femme fatales, and the Sapphic implications of such femmes’ somatic \ninsertion into the fur that still is inflected as female genitalia…    \n \nWith this potent oscillation in mind, the embodied nature of fur, its origin as a soft \ncover for a (once) living creature, arguably positions it as an essentially deathly fabric. \nIs it possible now to escape the ecstatic pleasure of the stroke of soft pelt passing \nacross one’s skin, or avoid the knowing acceptance of agony, to disavow desire for the \nsex-death nexus, or to critically subordinate emotion and empathy in making or taking \nfur? Fur, I contend, provides the true ‘stuff of snuff’, allowing what Linda Williams calls \nin relation to hard-core pornography “the perverse substitute of death spasm for \npleasure spasm: the replacement of orgasm’s ‘little death’ by real death” (Williams \n1990:192). My contention is that it is the actual deaths of fur’s birth that creates in \nfur the sheath-space of heightened pleasure for the sadist-fetishist (the former \nlooking directly at the slit-skin, the latter seeing no death-marks and choosing to \ndisavow in spite of what is seen. It is then the absence of death that makes even the \nextreme fineness of the best of micro fibres nothing other than a poor and sterile \nsubstitute for the ‘real snuff’.  \n \nThe anti-fur campaigns of the 1980s and since have left Western consumers in no \ndoubt as to where fur comes from, how it is obtained, who consumes it, and what the \ndishonourable cultural penalty might be of wearing it (Emberley 1998:21-42; Quan \n1998:1; Hoffmann 2006). The environmental, social and trans-cultural, economic, \ngender-related, post-colonial and neo-imperialist aspects of fur production, trade and \nconsumption are not the focus of this paper, and they are amply covered elsewhere. \nIt is not necessary here, for example, to review the English ‘sumptuary laws’ of the \nfourteenth to early seventeenth century, their restriction on all kinds of perceived \nexcess including the wearing of fur apparel (by those of lesser social rank than the \nhigher nobility), and their functions to preserve class distinction and privileged social \norder, regulate luxury and extravagance for moral purpose, and to encourage frugality \nand industry in the lower classes to support those in the upper classes (Emberley \n1998:8-9,43-44). Nevertheless, the tension between hedonism and restraint (Baldwin \n1926:10 in Emberley 1998:44), or critique versus practice of excess (Bourdieu 1984: \n24), illuminated by these laws in some way previews the pro-fur and anti-fur rhetorics \nof the late twentieth century wherein fur fashionistas accused the anti-fur lobby of \n“self-righteousness and ecological Puritanism” (Bolton 2005:68; Quan 1998:2), while \nthe anti-fur lobby counter-charged fur advocacy as decadent and selfish to the point \nof wilful cruelty and ecological destruction (Nadeau 2001:177). Specifically, it is what \nEmberley calls fur’s role as both a “libidinal fetish” and a “complex sign of political, \npoetic and … erotic power” (1998:4) that is central to this paper’s argument. In these \nwords, fur’s dynamic magic is captured, and its potency as a sexual signifier of great \nintricacy is established. The anti-fur campaigns that told us “It takes up to 40 dumb \nanimals to make a fur coat. But only one to wear it” (Lynx 1984), and the like, missed \nthe point of fur ethics entirely. As Skov (2004:24) notes, in spite of the vehemence of \nsuch opposition, and in spite of the now familiar tales of terror of how fur arrives on \nthe high street, “the erotically charged entwinement of fur, beauty and pain has \nsurvived”. Understanding and accepting that entwinement as shifting between denial \nand celebration of the perversions (fetishism on one hand, sadism on the other) of fur \nliberates us then to consider our principled position in relation to it. \n \nFur is sex, it is transgressive, it is perverse, it is about climactic dominance and it is \nabout death, it does conjure the magnetism and dynamism of sadomasochistic sexual \npractice. And, in parallel, it perversely disavows all this to be purely about the fetish-\nfur-iness of itself and its breath-taking affect. If fur-wearing lovers of fur know their \nbreach of the codes of compassion and the ethics of endearment (and even the most \ndisavowing fetishists must), then any punishment experienced at the hands of PETA \nactivists only liberates their enjoyment of fur’s purity and perversity. Williams argues \nin this vein within the complex and shifting expressions of the sadomasochistic \nscenario, but her sentiment – that punishment thus “serves a function: it absolves the \nsupposedly desireless woman of responsibility and blame for pleasures she \nnevertheless enjoys” (1990:213) – is arguably applicable to the fur-wearing woman \nwho deals with punitive activist scorn and strides onwards, fur-clad and bold, \npropelled by her conviction in North’s “urge to extravagance” (1999:unpaginated). As \na lone fetishist, she is more unusual in her gender; as a sadist, however, she finds a \nnumber of phallicized female fur-fellows with whom to stride. The depth of the \npleasure and power combination contained in the wearing of fur for such women is so \ngreat that no form of societal or cultural censure deflects it. It is effectively a \nsadomasochistic bond, rather than a strictly fetishistic one, with all the mobility of \nidentification that such SM bonds allow. As such, it echoes the intensity of the slow \ncoital strangulation of Kichi by the phallic female Sada in Oshima’s film In the Realm \nof the Senses (1976). As there, that ‘snuff’ is followed by absolute possession – of the \nstrength of that felt by the wearer for her fur – when Sada castrates Kichi (literally \n‘taking the phallus’, but here death-marked) in what Williams calls “an expression of \ntheir mutual desires carried to the limits of life itself” (1990:221). She owns his body \nby the chilling deathly action of her desire and its enactment. So too, the fur-woman \nowns her collection of bodies, represented in the punishingly potent, achingly poetic \nand sensually superior fabric of fur. Its rejection can, I argue, only be then made in \nspite of fur, and as an act of conscious denial of its ‘pleasure space’, rather than in \nopposition to it…  \n  \nMale fetishist Mockle’s description of his adolescent rite of passage into the ‘pleasure \nspace’ of fur ownership reads as a long-anticipated and delicious sexual initiation, \ncharged with secrecy, furtiveness, and a particularly intense sense of private \nautoeroticism:  \n \n…two of our female teachers had gorgeous long dark \nmusquash coats … except the initial contact in the school \nplayground, I had yet to feel a fur… \n \n…I acquired my first fur shortly before my eighteenth \nbirthday … I rushed home, smuggling it in past my parents, \nand remember spending much of the rest of the day \ntouching it, stroking it and, I have to admit, being sexually \naroused by it… \n(Mr Mockle, www.mrmockle.com, accessed 08.11.06). \n \n \nWhile fur’s silky soft handle and cool suppleness ensures the pelt’s material-fetishistic \ncapability for conjuring sexual excitement (Entwistle 2000:191-192), its “powerful \nerotic appeal” is especially characterised for Mockle and his like by its unique \ncombination of tactile, olfactory and visual stimulation (Steele 1996:143). \nEncountering fur therefore in that sphere becomes a ‘whole body’ sensual experience, \nand fur’s caress of the body – both how that privately feels to the wearer and how \nthat outwardly looks to the viewer – encourages heightened sensation, and invites – \nsymbolic or actual – erotic engagement (Hollander 1995:134). The private and \npreserved excitement of a fetishist results from refusal of the pelt’s association with \ndeath, loss, castration, even female genitalia: for the fur fetishist, fur’s touch, sight \nand smell conjure a powerful sensual experience, but I maintain that the whisper of \ndeath is also there to inflame other complex entanglements and to struggle with the \nfetishist’s disavowal through insistence on knowing. That whisper prompts a subtle \nshiver of the necromantic, the necrophilic, the sense of ‘deaths and maidens’, \nunderpinning the more acceptable, more savoury explanations of fur’s appeal. Thus, \nfur is bodily, and an embodiment of body-ness, and this is key to its position as the \nprimary fabric of desire. Nadeau (2001:8), for example, illuminates her own sensual \nand embodied fur-response as she “cannot help but seeing the feeling of the fur at the \ntips of [her] fingers … cannot help but feeling the skin that is wearing the fur”. Her \nwords merge her with the animal that once was, revealing that it’s about the purity of \nqualitative indulgence of personal desire, it’s about the pleasurable excess of the \nsensual pelt-touch of purest foxy-fur on bare bold flesh. It’s about gratifying the \ndecadent itch of a want so sexy it’s a rush, the breathy mouth-feel of the slink and \nglide of it, its oil-slick of sex… And more, it is the stillness of fur’s embodied body that \nis its erotic and deathly beauty. That which once rippled and writhed, is stilled, and by \nforce of action or of consumer will. That (phallic) devouring force, as a sadistic \ninstrument, the convoluted politics of desire acting around it, and the implications of \nthat enactment, require further exposition than mere fetishism allows... \n \nMy grandmother wore four peeled pelts to her Presbyterian kirk.  \n \nThe minks’ beady glass eyes and their tiny hooked claws unnerved the child-me, but – \nthrough the childish terror that provokes the onset of sexual fetishism – I ached for \nthe smooth sweep of their long, lustrous bodies, yearned for the lash of their perfect \ntail-whips, and burned for the imagined glamour of a God-fearing woman dripping \nfurs. No foxy vixen she, no Diana, no Dionysian diva or Bacchanalian fur-clad nymph, \nno earthy Amazon: for my grandmother her minks signalled social solidity, a lucky \nmarriage, and distance travelled from birth in a Belfast butcher’s shop. A lover of \nanimals, she hit men for hitting dogs, but neither she nor I – disavowing class-\nfetishists together – reflected the connection between suffering hounds and those four \ndead minks. My grandmother was no sex kitten: more a puritanical puppy, an Old \nTestament gal, for whom “the Lord God made coats of skins, and clothed [Adam and \nEve]”, concealing their shame (Genesis 111: 21). Hence, for her fur was modest and \nbiblical, arguably symptomatic of her religion’s smug operation of a notion of God-\ngiven leadership over lowly beasts. This staunch fur-clad matron was a world away \nsurely from the decadence of the Marquise de Fontenay, attending post-Revolution \nOpera clad only in the skins of tigers (Ewing 1981:100), entirely detached from Walter \nChin’s iconic model in au naturel Galliano fur and flesh-matching undergarments \n(Bolton 2005:74), light years from the Dalmatian-draped archetype of Cruella de Ville, \na key player in fur’s association with “human greed, extravagance, folly and even sin \n… the epitome of … depraved luxury” (Ewing 1981:26). Not my grandmother, surely? \nBut the ties that bind these unlikely protagonists are there, and they are the real ties \nof mink tails, stiffened sinews, coagulated bloodied arteries. I can mobilise \nKonopnicki’s question in relation to my grandmother’s minks, “Am I an accomplice to \nmurder by stroking the softness of animal fur with the tips of my fingers?” I can hear \nmy inner conscience ask am I a sinner for the sexy stirrings the feel of those minks \nelicited from me. I can reflect on Konopnicki’s answer: “I have no remorse and I \nrefuse to renounce the shiver of a body wrapped in fur…” (1995:9 in Nadeau 2001:7).  \n \nRefusal combined with knowing: a potent combination. \n \nImagine, fetish-sadist, being peeled… \nImagine a heap of carcasses, a peeled racoon raising your bloody dying head to stare \nat a camera, a racoon with gorgeous lashes, blinking but with your poor bleeding \nheart exposed, and your precious pelt flayed off over your head like a jumper... \nOh sweetness, imagine suffering to death…  \n \nOh my love, imagine your poor bleeding heart exposed for me… \nStrike dear mistress and cure his heart (Velvet Underground Venus in Furs 1966). \n \nBut, look, that racoon – not you, my heart – was in China, and we’re here together in \nthe humane West. We don’t believe in cruelty. We feel fur can be ethical. We’re in \nliberal London, the capital of Great Britain, known throughout the world for fair play, \nfair game, the love of dogs, cats, foxes, and little children, and the Parliamentary \nhome of the British Fur Farming Prohibition Bill of 2003. We’re not, as liberals, averse \nto a bit of cleaned up ‘snuff’, but we’re intellectually attracted only… That poor old \nracoon in pesky China should be the last of a dying breed… Let’s disavow together, \nhoney, and stroke the fur together, honey…  \n \nDisavowal? Fetishist, we don’t know whether our fur is ripped off a racoon’s shrieking \nframe in Hebei Province, excised from the cooling body of Finnish fox whose pacing up \nand down in a fur farm cage beat out a rapid rhythm of despair, or sliced off some \ngibbering abject creature whose last meal was part of its own leg as it tries to gnaw \nits flesh and bone from the steel jaws of a leg-trap in deepest Omaha. Fetishist, we \nreally won’t be able to tell if we’ve been naughty little fur consumers or if we’ve joined \nthe self-less fight against over-population by ‘pest species’...  \nAnd – honey – as for those darned proliferating baby harp seals on the ice floes of \nNewfoundland … damn their selfish fish-eating ways, honey...  \n \nImagine being a fish-eating fashion victim.  \nImagine wearing pure white baby fur.  \nImagine being a Newfoundland boy-man, steeling yourself for that first penetration. \nImagine being a fur virgin.  \nImagine that loss of innocence…  \n \nImagine having a fur coat and no knickers.  \nImagine being a turn-coat.  \n \nImagine being Naomi and Cindy, infamously posing in PETA’s ‘I’d rather go naked \nthan wear fur’ campaign, then popping on the second-hand coats of dead animals \n(Frankel 1997; McVeigh 1999, referring to Naomi Campbell and Cindy Crawford). \nOnce a fetishist…  \nImagine being Claudia and Melissa similarly ‘changing their spots’ (Fur Information \nCouncil of America, referring to Claudia Schiffer and Melissa Etheridge).  \nOnce a sadist…  \n \nFur’s ubiquity and versatility as seared, plucked, knitted and trimmed fabric as much \nas in swathes of the pure stuff, satisfies the ‘snuff’ enthusiasts as much as the lower-\nkey Mockles. Kardasis opines that farmed fur “doesn’t make this right, it just makes it \nthe best we can do”. Fur is, he asserts, “the first coverlet of your life” (Kardasis 2005: \nunpaginated), but his guilt-tripping validation of a primal infant attachment to the \n‘mother-fur’ is excruciating (he truly is the knowing-disavowing fetishist), and so far \naway from sexy sassy Kate Moss’ promenade of her fatal-foetal attraction in velvety \ndove grey broadtail, baby-wrinkled and severed straight from Mummy. That, is the \nsexy fetishist, never mind whether it’s the ‘best we can do’… \n \nImagine fur-lined fetish-knickers, Ms Moss \nImagine giving a damn...  \n \nFur farm footage shows cage-mad, stress-crazy foxes pacing, ducking, twitching, \nwhile excrement and filth builds up in layers below them; racoons incarcerated \nwithout cover or heating, but with the infected and cannibalised carcasses of their \ncage mates for company; a vixen with bone exposed in her ulcerated leg, her deeply \ninfected eyes waiting for death and accessories-use rather than full-pelt glory \n(www.petatv.com). It’s uber-porn, all the more delightful since its narrative evidences \nthat market-acceptable lush and luscious fur will grow even in the short life of a \ntraumatised, undernourished, dehydrated, infected creature, putting paid to the \nargument that if caged fur animals weren’t treated well, the fur would be poor.  \nLet’s disavow… sit back and enjoy the movie.  \nImagine it’s important that they aren’t treated well (damn their verminous fish-eating \nways…); imagine it’s important that we don’t think about it.  \nThis, essentially, is the expedient perversion of fur-loving: the oscillation of \ncontemporary Western fur-lovers between indulgence in not-knowing and enjoyment \nof the sheer pleasure of the fur (purist-fetishists), the impossibility of not-knowing but \nsomehow managing to turn away (disavowing fetishists), the rationalising of fur as \nnecessary in the grand scheme (masochistic moral apologists), and immersion in the \ndeathly delight and cruel excess of the ‘snuff’ (fur-sadists). This is the complexity and \ncharge of fur, more potent than any other fabric. \n \nA dog fox involuntarily bites on a metal pole as an electrically charged steel rod is \npushed upward deep into his rectum. The fox violently arches his back in orgasmic \necstasy, his insides fry, his teeth shatter, his heart slowly ruptures, he painstakingly \nshudders towards oblivion. It could be the best of ‘snuff’, an eloquent tale of climactic \ndeath inscribed with painful beauty, a noble guarantee that his fur, unmarked by \ncause of death (phew…), will provide a full pelt and a sublime bodily experience for its \nwearer. This is what Stella McCartney describes as “immeasurable suffering”, but – \nsomehow, sweetheart, it’s because I’m worth it.  \n \nImagine suffering immeasurably…  \nImagine suffering deliciously…  \nImagine lying naked in a cold space, while a thick and heavy blanket of finest dog-\nfoxy fur is slowly drawn up over each inch of your charged, enlivened body, your \nnipples like bullets, your clitoris rock hard (you bad phallic female fetishist, you), your \nheart racing, your pulse beating, your breath heavy and low...  \n \nRemember, dog fox, your fur equals sex, and more than one kind of sex. If it’s not the \ncontrolled pleasure of a spike-heeled, sheath-skinned, skin-sheathed dominatrix, it’s \nJ-Lo’s blinged-up, sexy, sharp, street ‘ho’, or Beyoncé’s hypnotising ass-shakin’ \nghetto-queen. It’s Liz Hurley’s sophisticated quintessentially English classic-fur charm, \nor Lizzie Jagger’s hot-red foxy femme fatale. It’s kitten-heeled, kitten-soft, Monroe-\nkittenish kitten-kitsch or it’s four minks on a puritan’s shoulder… Yes, Quan, you’re \nright when you note that a “woman in a fabulous fur coat looks arrogant and carnal \nbecause she obviously does not mind if a few animals have died to keep her warm” \n(Quan 1998:2), and yes, Lurie, you’re close to the essence when you state that “One \nof the most persistent specialized forms of erotic appeal is that which connects love \nand death, sometimes so closely that only what is damaged or dangerous can arouse \nthe passions” (Lurie 1992:256). But note please Williams’ arguing of complicity \nbetween those who witness cinematographic ‘snuff’, “in the flesh” even if on screen, \nand the abusive perversion of its mode of production (1990:185). Her contention that \n“going to a cinema to watch a death spasm is obscene” is surely no less dreadful than \nwearing its results (1990:186), and it provides a useful focus for reflection on the \n(porno)graphically described death of our dear dog fox above. So, with fashion \nproviding opportunity for enactment of specific fetishistic or ambiguous sadistic sexual \nfantasy, fur finds a top billing in the material construction of sexuality, its fabric sado-\nfetish operating to both focus desire on and disclose “the real object of curiosity and \ndesire”, arguably the human body and ultimately its genital prize beneath the animal’s \nfur (Hamlyn 2003:13)… \n \nNadeau asserts that “Skin, flesh, fur all act as interfaces of the female body [my \nemphasis]” (2001:8), and the association of fur and female genitalia as representing a \nhighly sexualised focus for the typically male fetishist is well documented (Freud \n2005:299). Such association is apparent in visual practice: Oppenheim’s dainty \nBreakfast in Fur (1933) invites erotic domestic oral consumption; Helen Chadwick’s I \nThee Wed (1993) encircles phallic vegetable forms in furry rings; Linda Dement’s In \nmy Gash (1995) explores the artist’s corporeal aggression, fleshly desire and \ndestructive fantasies in vulval digital fur imagery. Jana Sterbak’s pungent Vanitas: \nFlesh Dress for an Albino Anorectic (1987) may be closer to the real picture. Quan \n(1998:2) proposes that a “mink or sable worn half-open is reminiscent of ‘a woman’s \nlush, unwaxed outer labia”, and Helmut Newton’s Laura Dressed in a Fox Cape, \nAvenue George V, Paris (1974) pictorially activates just this concept. In the film \nPerformance (1970, UK, directed by Donald Cammell and Nicolas Roeg) the \npolysexual protagonist Pherber lies talking to her London Gangster while stroking her \nfur coat just above her naked crotch, and other commentators note the various fur \nreferences connected to colloquial or vulgar terms for the vulva or vagina – pussy \n(Bell-Price and da Cruz 2005:117), muff (Lurie 1992:234; Bolton 2005:72), beaver \n(Nadeau 2001:12), meat (Adams 1990), and just as fur \n \n…the emotion I felt being inside her fur, literally inside, \nbecause you see when she grabbed me to kiss me, her coat \nhalf-opened and suddenly I found myself inside her fur, so \nto speak … I suddenly remembered Tata Rachel’s black \npubic hair of my childhood dreams, and I started feeling \nsomething bulge inside my pants…  \n(Federman 2001:215) \n \n \n \nAngela Carter takes us further and darker, linking – in ‘cunning lingua’ – the intensely \noral aspect of female genitalia to the skinning of fur production and a form of erotic \nskinned rebirth as “each stoke of his tongue ripped off skin after successive skin … \nand left behind a nascent patina of shining hairs” (Carter 1979:75). So, as Quan \nnotes, “Fur had a bad reputation before PETA tried to give it one” (1998:1), and in \nmore general terms associations with selling, or at least trading, sex and the \nachievement of fur ownership are strong. Filmic representations of the prostitute (or \nequivalent) and her fur are many: in Pabst’s The Joyless Street (1925), Garbo’s fur \ncoat “functions as a soft currency of libidinal exchange” (Emberley: 1998:4), while in \nMann’s Butterfield 8 (1960), Taylor’s fur coat informs the viewer of her character’s \nsexual and moral degeneracy. The excessive consumption of fur by the current \n‘celebrity nobility’ is notable, and echoes the sex-charge and power-potency of these \nrelations. Liebovitz’s American Vogue image of P. Diddy Combs’ emergence from a \nwhite Mercedes, in a white fox fur coat, with a white ‘trophy’ woman (played child-like \nby Kate Moss) into a crowd of paparazzi showcases Combs as one of the fur-clad \naristocrats of the new Golden Age of Glamour (Bolton 2005:53). With his fox an \nencultured white, worn easily on confident shoulders of assured status, her fur is \n‘other’, a wilder ‘cat-spot’, clutched by this ambiguous woman-girl-creature for \nprotection from other predators. The sub-text relationship – wealthy male and fur-clad \nmistress; whore and pimp; cultured and animalistic; sadist and fetishist; black man \nand white woman – is linked to the archetypal iconography of fur particularly since the \nearlier twentieth century. Bolton (2005:53) mines fur’s other association of “virility, \nmachismo, and, ultimately, male dominance” via its “espousal and acquisition by \npimps”, referencing Tracy Funches’ Virgo Couple photograph (1998 from the \nPIMPNOSIS series, 1995-2001) in which a naked black woman clings to her pimp who \nis head to heel in white fur, diamonds and chain, bespoke suit and fur trilby. Bolton \ndescribes the fur’s role in mediating the relationship between possessor and \npossessed asserting that the “mink coat…along with a Cadillac or Rolls Royce, is a \npimp’s most palpable display of economic and sexual supremacy” (2005:53). Hot and \nheady ‘snuff’… \n \nThe pimp-whore power dynamic manifests also in the role of the fur in the clothed and \nunclothed gendered body scenario. Skov (2005:21) picks up on fur’s contested role in \nnavigating between historicised notions of individual personality expression through \nclothing and societal fears of “showing too much”, thereby “giving off signs of a \nsexuality at odds with the dominant perception of feminine morality”. Skov argues \nthat tension was resolved by the layering possible in adoption of the fur coat, which \nallowed a “new sexual layer to the dressed appearance” which has then focused fur \nexplicitly on the body underneath, whether dressed or not (Skov 2005, citing Sennett, \n1992: 188-9). This layering is essentially played out as a key theme in the iconic \nnarrative of von Sacher-Masoch’s Venus in Furs (originally published in 1870). \nProtagonist Wanda, in “Ermine furs [that] adorn the imperious” (Velvet Underground \nVenus in Furs 1966) cruelly and sadistically dominates the story’s male character. Key \nto reading her fur, we are compelled to understand that she is physically and \nemotionally icy, and it is the interface between her marble skin and the warm furs \nthat mobilise the sexual exchange between Wanda and Leopold. Nadeau argues that it \nis exactly the “carnal and intimate contact” between female and animal skin that \ncreates an enormous sexually-charged and sensually mesmeric force in Wanda, \nrendering her combination of self and fur as embodying desire for her slave, and \nenabling the exchange of heightened pleasure for devoted adoration (Nadeau \n2001:15). Leopold’s character Severin effortlessly connects sexual passion with \ntyranny and cruelty perpetrated by a fur-clad woman, describing the exquisite \npleasure of sexualised suffering and torture. So, the potency of the fur-clad female is \nrendered archetypal. The cruel coldness of Wanda informs a range of scenarios from \nthat of the trophy huntress (Lurie 1992:233) to the animalistic primitive, from that of \npretenders to being “a very expensive animal” (Lurie 1992:232) to the versatile and \nbrittle heroine-villainesses of 1940s film noir who “dripped furs over their severe \ntailor-mades … backless, slinky dresses … trenchcoats…” (Wilson 2003:143-144), from \nNew Yorker fur panache and “unrepentant, brash display” to Knightsbridge furs’ \n“badge of class” (Wilson 2003: 140), and from the ‘foxy lady’ of David Garnett’s Lady \ninto Fox novel (1922) to Bell-Price’s “sartorial barbarism” (2005:20,31). \n \nImagine being barbaric…  \n \nEd Gein (1906-1984) peeled his murder victims and exhumed corpses for the same \npurpose, fashioning a ‘woman suit’ in the USA of the late 1950s. His peelings informed \nthe fictional ‘Buffalo Bill’ Jame Gumb who starved and removed the skin of his victims \nto similarly construct a garment in Jonathan Demme’s film Silence of the Lambs \n(1991). How problematic would it be to raise an argument that the knowing use and \nwearing of fur must echo (at least) the viewing of (if not participation in) the most \nheightened versions of sadomasochistic pornography since the sensibility required to \npass the use of fur must either be that of the sadist (dominating the animal) or \nperhaps the masochist (in abject empathy with the animal), or wavering, as good \nperverts do, between them both? As in critiques of the spectatorship of such \npornography, might an argument hold that the user is only one step removed from \nthe bloody action of the means of production, which is implicit in the product? That is, \nis the wearer of fur only one remove from the barbarism, excess and orgiastic cruelty \nof its manufacture, and indeed is this absolutely understood by the consumer of fur \n(even if subsequently denied to allow return to the purist pleasure of the absolutist \nfetishist)? \n \nWriting of hard-core SM and ‘snuff’ porn, Williams examines the ‘slasher’ film genre \nwhich “like pornography … pries open the fleshy secrets of normally hidden things” \n(1990:191), and the ‘snuff’ film category comprising “a perverse displacement of \npornographic hard-core sexual activities, which typically end in penetration, onto the \npenetrating violation of the body’s very flesh” (1990:192). In describing  “the \nperverse pleasure of witnessing the involuntary spasm of death” (1990:193), Williams \nmight as readily be transposed onto a discourse of witnessing or wearing the fur \nevidence of the agonies of fur-bearing animals prior to and during their surrender of \ntheir fur. Might this be considered analogous to the witnessing of the execution or \ndischarge of ‘snuff’? Arguably, if a fur coat has some connection to pubic hair, then \nthe body of a dying animal or a dying woman exposes the hidden orgasm that hard-\ncore can never see but always seeks. Williams cites the “frenzy of the visible” in \n‘snuff’, which counteracts the “invisible involuntary spasm of orgasm that is so hard to \nsee in the body of the woman” (1990:194), that “intangible aspect” that for Bataille \n(1986:29) is the essence of human eroticism. Williams further queries the hidden \nnature of the female orgasm and the need for its disclosure: \n \nRead in the context of pornography … a flinch, a convulsion, \na welt, even the flow of blood itself, would seem to offer \nincontrovertible proof that a woman’s body, so resistant to \nthe involuntary show of pleasure, has been touched, ‘moved’ \nby some force  \n(Williams 1990:194). \n \n \nDoes a fur then allow us collective access to a moving experience, a body death, an \norgasmic climax, that is normally denied us? Might we further consider the ice maiden \nswathed in pelts as so essentially disembodied that her orgasm is only visible in the \nanimal’s death? I think here of da Cruz’s relation of how the quivering bristle of fur’s \ntexture signifies its connection to “animals aroused by passion or aggression… [and] \n…sexual gentility and ferocity” (2005:166). That arousal conjures the (detachable) \nphallus, and Williams reminds us that Andrea Dworkin (1987:63) defined “all sexual \nacts involving heterosexual penetration as real or symbolic aggression and thus as \nsadism” (Williams 1990:195). The sexualised ‘penetration’ of the fur-bearing animal \nvia the teeth of traps, through shock-inducing anal\/vaginal insertion, in asphyxiation’s \ngag or poison’s invasion, by bullet piercing, pressing, strangling, stamping, \nbludgeoning, or through the ‘skin flick’ of being peeled alive, enacts Kaja Silverman’s \n(1988:31 in Williams 1990:195) interrogation of Freud’s articulation of perverse \nsexuality, defined as not ending in coitus, and lacking “a genital goal or discharge or \n‘end-pleasure’”. Further, Williams’ description of a typical SM film: “There is no visible \nclimax, in either the dramatic or the sexual sense of the word, only a suspenseful \nspectacle of prolonged suffering” (1990:197) is telling if applied to the temporal and \nspatial distantiation enacted by even those fur-wearing consumers who acknowledge \nthe sexualised violence inherent in fur. That separation, fur’s “nihilistic desire for \nsensation” (Arnold 2001:57), is that which Williams describes thus: \n \n…we are watching (whether with fascination, pleasure, \nhorror, or dread) an act that seems real but with which we \nhave no physical connection ourselves (Williams 1990:188). \n \n \nSo, if normatively “Abject terror [is] gendered feminine” (Clover 1987:212, referenced \nin Williams 1990:207), is fur-wearing a means by which a woman achieves the high \ndrag of phallic supremacy, interfering with – though not overtly challenging – \nnormative hierarchies of male and female sexual and power relations?  \n \nImagine wearing a fur phallus… \n \nIn the ineffectual high camp of fashion speak, Valerie Steele asserts “designers today \nare increasingly channelling the spirit of warrior women, with female modernity \nconcerned with a fashion discourse of silk and steel” (Steele 2006:1). In this \nlanguage, fur operates specifically to conjure the intimacy, nakedness and sensuality \nof lingerie while simultaneously activating hard protection and powerful discipline. By \ndoing so, fashion’s female protagonist is situated as a delicate man-eater or femme \nfatale, a “conceptual fusion of woman and beast” however other she appears (da Cruz \n2005:145).  As Medusa, Siren, spider-woman, ‘black widow’, eroticised death, as the \nanimalistic and ferocious Irena of Cat People (1982), the feral savage, or Bell-Price’s \n“ancient Amazon, the voluptuous virago and divine huntress” (2005:13), or even as \nthe still-potent persona of Mrs Danvers, the depraved and secretive lesbian stroking \nthe dead Mrs de Winter’s fur coat over her cheek (Hitchcock’s Rebecca 1940), she is \nthe perpetrator of a sexualised act of terror and destruction. This is acknowledged \nrepeatedly: \n \nThe fur-bearing woman, as a class unto herself, collectively \ncomes to figure as a cold and cruel monstrosity, an \naccessory to the crime who would wear her capacity for \nterror and violence on her sleeve (Emberley 1998:25) \n \n \nBut darker again, Bell-Price and da Cruz reference pagan animism, witchery, “psychic \nfelinism”, and folkloric antiquity (2005:117) in relation for fur-wearing females, citing \nthe Bacchantes’ “infamous unbridled frenzy … murderous savagery … frolicking with \nanimals or wearing their skins …” (2005:130). Such excess becomes fur, with its \nthreat of extinction, its insatiable appetite, and its interconnectedness to death.  \n \nThe ravenous femme fatale is never more present, however, than with the unborn \nkarakul lambs of Central Asia whose unformed fur makes astrakhan (also known as \nbroadtail or Persian wool). As modelled by Madonna, this finest of fur requires firm \npressure on the ewe’s stomach or a quick slash to her throat, aborting her young up \nto thirty days before they are due without any death marking of the foetal-soft, curly-\ncute and terror-tender skin (Haven 2002). The “cruellest and most vicious fur” (Croft \n2005) is available from Lagerfeld, Fendi, Prada, Dolce & Gabbana and others. Nadeau \nasserts ”fur per se has no value without the raw materiality of skin, and the constant \nrearticulation and sexualized negotiation between skin and pelts, between the \napparent mobility of the body and the aberrant stillness of fur…” (2001:17). The \nmoment of death may be configured as rapturous, honourable, ecstatic, orgasmic, \ntranscendental, but ultimately it is truly and actually deathly, as is the best ‘snuff’. \nHere, where “killing functions as a form of rape”, the ultimate orgasm is the \n“penetrating violation of the body’s very flesh” (Williams 1990:191-192) in a ‘money \nshot’ combination of the foetal unborn and the already ‘snuffed’… \n \nDeath-marks on the fur represent the key to this essay. For some of the consumers – \nlovers, for that is the potency of the engagement – of fur I argue that the (symbolic) \nvisibility of those death marks is vital to their appreciation of their fur. These are the \nfur sadists, for whom terror, death, pain and abject suffering inform the fur they wear, \ninflect their enjoyment of it, and allows their dominion over the animals and their \npotency, phallic of otherwise, to be part of the enactment of their pleasure. I have \ntraced and exemplified those who are steeped in this aspect of fur’s particularity and \npleasure. And I have asserted that this form of fur-loving is close in essence to the \nextreme enjoyment of the real death action of ultimate ‘snuff’.  \n \nThis is not the whole story, however, and there is no question that fur’s position as \nthe ultimate fabric is desire is assured by a more complex and dynamic set of \nmeaning and articulations. For others who love fur the need to disavow its origins – in \nspite of not being able to avoid that knowledge – is essential to their fetish-purist \nappreciation of the idealised pleasure affect of fur fabric. It is their complete refusal of \nfur as a skinned beast that permits their fetishised relationship to it. \n \nBut this too is not the whole story.  \n \nI believe that fur is an extraordinary phenomenon in fashion in this time in human \ncultural history. It defines the wild complexity of human sexual perversion by \ncombining apparently opposite psychic forces – the will to destroy and the desire to \nappreciate. Enabling the perverse interconnection of sadistic and fetishistic drives, it \nreflects our collective capability for sexual decadence and the satiation of appetites \nregardless of cost. The death marks are always there, and cannot truly be ignored or \noverseen. This essay merely maps the field of fur-love, proposing that it is impossible \nnot to see the death-marks, and suggesting that the differences between the perverse \npositions of fur-lovers lie only in whether they choose to directly view or perform the \nheat of the ‘snuff’ or to delicately slide their eyes away to linger on the cooled pelt.  \n \n \n \nBibliography \n \nAdams, C. (1990) The Sexual Politics of Meat. New York: Continuum \n \nAnon. (1999) Jungle stuff. The Economist, 7 August  \n \nAnon. (1998) Standard Guidelines for the Operation of Chinchilla Ranches. Ontario \nMinistry of Agriculture and Food, March \n \nArnold, R. (2001) Fashion, Desire and Anxiety: Image and Mortality in the 20th \nCentury. London: I.B. Taurus \n \nBaldwin, F.E. (1926) Sumptuary Legislation and Personal Regulation in England. Johns \nHopkins University Studies in Historical and Political Science 44, Baltimore: Johns \nHopkins University Press  \n \nBataille, G. (1986, first published 1957) Eroticism: Death and Sensuality. San \nFrancisco: City Lights Books  \n \nBell-Price, S. (2005) Call of the Wild in Bolton, A. Wild: Fashion Untamed. The \nMetropolitan Museum of Art, New York. Yale University Press: New Haven and London, \npp.12-41 \n \nBell-Price, S., da Cruz, E. (2005) Tigress in Bolton, A. Wild: Fashion Untamed. The \nMetropolitan Museum of Art, New York. Yale University Press: New Haven and London, \npp.116-143 \n \nBolton, A. (2005) Introduction; The Lion’s Share and Birds of Paradise in Bolton, A. \nWild: Fashion Untamed. The Metropolitan Museum of Art, New York. Yale University \nPress: New Haven and London, pp.11; 42-79 and 80-115  \n \nBourdieu, P. (1984) trans. Nice, R. Distinction: A Social Critique of the Judgement of \nTaste. Cambridge, Massachusetts: Harvard University Press \n \nCarter, A. (2006, first published 1979) The Bloody Chamber and Other Stories. \nLondon: Vintage Book \n \nClover, C. (1987) Her Body, Himself: Gender in the Slasher Film. Representations, \nUniversity of California Press, Fall 1987, 20:187-228 \nhttp:\/\/www.representations.org\/topic_body.php (accessed 1 March 2008)  \n \nCroft, C. (2005) Aborted lambs are new fashion victims. The Sunday Times Style \nMagazine, 6 March www.timesonline.co.uk\/tol\/news\/uk\/article420528.ece \n \nda Cruz, E. (2005) Man-Eater in Bolton, A. Wild: Fashion Untamed. The Metropolitan \nMuseum of Art, New York. Yale University Press: New Haven and London, pp.144-175 \n \nDworkin, A. (1987) Intercourse. London: Secker & Warburg \n \nEntwistle, J. (2000) The Fashioned Body: Fashion, Dress and Modern Social Theory. \nCambridge: Polity Press  \n \nEmberley, J.V. (1979) The Cultural Politics of Fur. Ithaca: Cornell University Press \n \nEmberley, J.V. (1998) Venus and Furs: the cultural politics of fur London: I.B. Tauris \nand Co. Ltd \n \nEwing, E. (1981) Fur in Dress. London: B.T. Batsford  \n \nFederman, R. (2001) Aunt Rachel’s Fur. Normal Tallahassee: FC2 \n \nFrankel, S. (1997) Fur's big comeback snares supermodel: objections to pelts may be \njust skin deep. The Guardian, 8 March \n \nFreud, S. (1995) trans., edited, introduced Brill, A.A. The Basic Writings of Sigmund \nFreud (Psychopathology of Everyday Life, the Interpretation of Dreams, and Three \nContributions to the Theory of Sex). New York: Random House  \n \nGarnett, D. (1922) Lady into Fox. Authorhouse \n \nHamlyn, A. (2003) Freud, Fabric, Fetish. Textile: the Journal of Cloth and Culture, \n1:1:9-27 \n \nHarper, C. (2005) Pelting Down. Selvedge magazine 8:(Nov\/Dec):20-21  \n \nHaven, P. (2002) Karzai’s Hat Made From Lamb Fetus. Associated Press, 23 April  \nHoffmann, M. (2006) It’s a battle of trapper tradition vs. animal protection. Milwaukee \nJournal Sentinel online, 2 April www.jsonline\/story\/index.aspx?id=411446 (accessed \n20 October 2006) \n \nHollander, A. (1995) Sex and Suits: The Evolution of Modern Dress. New York: \nKodansha International \n \nSilverman, K. (1988) Acoustic Mirror: The Female Voice in Psychoanalysis and Cinema \n(Theories of Representation and Difference). Bloomington and Indianapolis: Indiana \nUniversity Press  \n \nKardasis, B. 2005, telephone interview with author \n \nKonopnicki, S. (1995) Eloge de la fourrure: petit traité du poil lustré. Paris: Seuil  \n \nLurie, A. The Language of Clothes. London: Bloomsbury \nMcVeigh, T. (1999) Naomi on the catwalk, looking sheepish in wolf's clothing. Express, \n18 February  \n \nMunicchi, A. (1992) Ladies in Fur 1900-1940. Modena, Italy: Zanfi  \n \nNadeau, C. (2001) Fur Nation: From the Beaver to Brigitte Bardot. London: Routledge \n \nNorth, R.D. (1999) Fur and Freedom: a defence of the fur trade. December (British Fur \nTrade Association) http:\/\/www.richarddnorth.com\/books\/downloads\/F4Fweb.htm \n \nQuan, T. (1998) Pretty in Mink. www.salon.com\/feature\/1998\/05\/cov 26_ \nfeature.html 26 May (accessed 17 November 2006)  \n \nSanders, E. (2002) The Family. New York: Thunder’s Mouth Press \n \nSennett, R. (1992, first published 1976) The Fall of Public Man. New York: Norton \n \nSkov, L. (2005) The Return of the Fur Coat: a Commodity Chain Perspective. Current \nSociology 53:1:(January):9-32  \n \nSteele, V. (1996) Fetish: Fashion, Sex and Power. Oxford: Oxford University Press. \n \nSteele, V. (2006) Love and War: The Weaponized Woman. New York: Museum at FIT \n \nVeterinary Medical Association (2001) Panel on Euthanasia Report 2000, Journal of \nthe American Veterinary Medical Association 218:669-696 \n \nvon Sacher-Masoch, L. 1989. Venus in Furs. New York: Zone Books \n \nWilliams, L. (1990) Hard Core: Power, Pleasure, and the ‘Frenzy of the Visible’. \nLondon: Pandora Press  \n \nWilson, E. (2003) Adorned in Dreams: Fashion and Modernity. London: I.B. Taurus \n \n \nWebsites \n \nBritish Fur Trade Association www.britishfur.co.uk \nFur is Dead www.FurisDead.com (www.furisdead.com\/feat\/ChineseFurFarms ; \nwww.furisdead.com\/feat-burberry.asp) \nFur Free Alliance www.infurmation.com \nFur Information Council of America www.fur.org \nInternational Fur Trade Federation www.iftf.com \nMr Mockle www.mrmockle.com \nPeople for the Ethical Treatment of Animals www.peta.org (www.JLowDown.com)  \n \n \nFilms \n \nIn the Realm of the Senses (dir. N. Oshima, 1976). \nThe Joyless Street (dir. G.W. Pabst, 1925) \nButterfield 8 (dir. D. Mann, 1960) \nRebecca (dir. A. Hitchcock, 1940) \nSilence of the Lambs (dir. J. Demme, 1991) \nCat People (dir. P. Schrader, 1982) \nSnuff (dir. M. and R. Findlay, 1976) \n \n \nMiscellaneous \n \nThe Bible, Genesis 111: 21 \nVelvet Underground (1966) Venus in Furs \n \n"}