{"doi":"10.1016\/j.envsoft.2009.10.003","coreId":"68865","oai":"oai:eprints.lancs.ac.uk:30822","identifiers":["oai:eprints.lancs.ac.uk:30822","10.1016\/j.envsoft.2009.10.003"],"title":"Development and testing of a risk indexing framework to determine field-scale critical source areas of faecal bacteria on grassland.","authors":["Oliver, David M.","Page, Trevor","Hodgson, Chris J.","Heathwaite, A. Louise","Chadwick, Dave R.","Fish, Rob D.","Winter, Michael"],"enrichments":{"references":[{"id":932679,"title":"A methodology to support multidisciplinary model-based water management.","authors":[],"date":"2007","doi":null,"raw":"Scholten, H., Kassahun, A., Refsgaard, J. C., Kargas, T., Gavardinas, C. and Beulens, A. J. M. 2007. A methodology to support multidisciplinary model-based water management. Environmental Modelling and Software 22, 743-759.","cites":null},{"id":933954,"title":"Culturable Escherichia coli in soil mixed with two types of manure.","authors":[],"date":"2006","doi":null,"raw":"Unc, A. and Goss, M. J. 2006. Culturable Escherichia coli in soil mixed with two types of manure. Soil Science Society of America Journal 70, 763-769.","cites":null},{"id":932069,"title":"Experiment on sandy soil at Woburn, England. Soil Use and","authors":[],"date":"2007","doi":null,"raw":"Experiment on sandy soil at Woburn, England. Soil Use and Management 20, 343-349. Refsgaard, J. C., van der Sluijs, J. P., Hoberg, A. L., and Vanrolleghem, P. A. 2007. Uncertainty in the environmental modelling process – a framework and guidance. Environmental Modelling and Software 22, 1543-1556.","cites":null},{"id":934760,"title":"Faecal indicator pollution from a dairy farm in Ayreshire, Scotland: source apportionment, risk assessment and potential of mitigation measures.","authors":[],"date":null,"doi":"10.1016\/j.watres.2007.09.015","raw":"Faecal indicator pollution from a dairy farm in Ayreshire, Scotland: source apportionment, risk assessment and potential of mitigation measures. Water Research 42, 997-1012.","cites":null},{"id":933273,"title":"Growing season surface water loading of fecal indicator organisms within a rural watershed.","authors":[],"date":"2009","doi":null,"raw":"Sinclair, A., Hebb, D., Jamieson, R., Gordon, R., Benedict, K., Fuller, K., Stratton, G. W, and Madani, A. 2009. Growing season surface water loading of fecal indicator organisms within a rural watershed. Water Research, 43, 1199-1206.","cites":null},{"id":932438,"title":"Nutrient cycling budgets in managed pastures.","authors":[],"date":"2007","doi":null,"raw":"Scholefield, D., Jewkes, E and Bol, R. 2007. Nutrient cycling budgets in managed pastures. Soil Biology 10 215-255.","cites":null},{"id":935780,"title":"Processes driving the episodic flux of faecal indicator organisms in streams impacting on recreational and shellfish harvesting waters.","authors":[],"date":"2006","doi":"10.1016\/j.watres.2005.11.001","raw":"Wilkinson, J., Kay, D., Wyer, M. and Jenkins, A. 2006. Processes driving the episodic flux of faecal indicator organisms in streams impacting on recreational and shellfish harvesting waters. Water Research 40, 153-161.","cites":null},{"id":934199,"title":"Soil Taxonomy. A basic system of soil classification fro making and interpreting soil surveys. Ag Handbook 436. Washington DC.","authors":[],"date":"1999","doi":null,"raw":"USDA-NRCS. 1999. Soil Taxonomy. A basic system of soil classification fro making and interpreting soil surveys. Ag Handbook 436. Washington DC. 869pp.","cites":null},{"id":935535,"title":"Spatial and time distribution of dairy cattle excreta in an intensive pasture system.","authors":[],"date":"2001","doi":"10.2134\/jeq2001.2180","raw":"White, S. L., Sheffield, R. E., Washburn, S. P., King, L. D., and Green, J. T. 2001. Spatial and time  distribution  of  dairy  cattle  excreta  in  an  intensive  pasture  system.  Journal  of Environmental Quality 30, 2180-2187.","cites":null},{"id":934485,"title":"Survival of Escherichia coli in cowpats in pasture and in laboratory conditions.","authors":[],"date":"2007","doi":null,"raw":"Van  Kessel,  J.  S.,  Pachepsky,  Y.  A.,  Shelton,  D.  R.,  and  Karns,  J.  S.  2007.  Survival  of Escherichia coli in cowpats in pasture and in laboratory conditions. Journal of Applied Microbiology 103, 1122-1127.","cites":null},{"id":935016,"title":"Survival of faecal bacteria in dairy cow manure.","authors":[],"date":"2004","doi":null,"raw":"Wang, L., Mankin, K. R., and Marchin, G. L. 2004. Survival of faecal bacteria in dairy cow manure. Transactions of the ASAE 47, 1239-1246.","cites":null},{"id":933557,"title":"Survival of indicator and pathogenic bacteria in bovine feces on pasture.","authors":[],"date":"2007","doi":null,"raw":"Sinton, L. W., Braithwaite, R. R., Hall, C. H. and Mackenzie, M. L 2007. Survival of indicator and pathogenic bacteria in bovine feces on pasture. Applied and Environmental Microbiology 73, 7917-7925 Strauss, P., Leone, A., Ripa, M. N., Turpin, N., Lescot, J. M., and Laplana, R. 2007. Using critical source areas for targeting cost-effective best management practices to mitigate phosphorus and sediment transfer at the watershed scale. Soil Use and Managment. 23S1 144-153.","cites":null},{"id":932147,"title":"Ten steps applied to development and evaluation of process-based biogeochemical models of estuaries.","authors":[],"date":"2008","doi":null,"raw":"Robson, B. J., Hamilton, D. P., Webster, I. T., and Chan, T. 2008. Ten steps applied to development and evaluation of process-based biogeochemical models of estuaries. Environmental Modelling and Software, 23, 369-384.","cites":null},{"id":933002,"title":"The electronic survey technique: an integration and assessment.","authors":[],"date":"2000","doi":null,"raw":"Simsek, Z. and Veiga, I. F. 2000. The electronic survey technique: an integration and assessment. Organisational Research Methods 3, 93-115.","cites":null},{"id":935251,"title":"Water balance modelling in Bowen, Queensland, and the ten iterative steps in model development and evaluation.","authors":[],"date":"2008","doi":"10.1016\/j.envsoft.2007.05.014","raw":"Welsh, W. D. 2008. Water balance modelling in Bowen, Queensland, and the ten iterative steps in model development and evaluation. Environmental Modelling and Software 23, 195-205.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"This paper draws on lessons from a UK case study in the management of diffuse microbial pollution from grassland farm systems in the Taw catchment, south west England. We report on the development and preliminary testing of a field-scale faecal indicator organism risk indexing tool (FIORIT). This tool aims to prioritise those fields most vulnerable in terms of their risk of contributing FIOs to water. FIORIT risk indices were related to recorded microbial water quality parameters (faecal coliforms [FC] and intestinal enterococci [IE]) to provide a concurrent on-farm evaluation of the tool. There was a significant upward trend in Log[FC] and Log[IE] values with FIORIT risk score classification (r2 =0.87 and 0.70, respectively and P<0.01 for both FIOs). The FIORIT was then applied to 162 representative grassland fields through different seasons for ten farms in the case study catchment to determine the distribution of on-farm spatial and temporal risk. The high risk fields made up only a small proportion (1%, 2%, 2% and 3% for winter, spring, summer and autumn, respectively) of the total number of fields assessed (and less than 10% of the total area), but the likelihood of the hydrological connection of high FIO source areas to receiving watercourses makes them a priority for mitigation efforts. The FIORIT provides a preliminary and evolving mechanism through which we can combine risk assessment with risk communication to end-users and provides a framework for prioritising future empirical research. Continued testing of FIORIT across different geographical areas under both low and high flow conditions is now needed to initiate its long term development into a robust indexing tool","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68865.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/30822\/1\/EMS_Oliver_et_al_accepted.pdf","pdfHashValue":"1688c12560ffab11f1cb2f797328ab1f211059b7","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:30822<\/identifier><datestamp>\n      2018-01-24T02:53:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Development and testing of a risk indexing framework to determine field-scale critical source areas of faecal bacteria on grassland.<\/dc:title><dc:creator>\n        Oliver, David M.<\/dc:creator><dc:creator>\n        Page, Trevor<\/dc:creator><dc:creator>\n        Hodgson, Chris J.<\/dc:creator><dc:creator>\n        Heathwaite, A. Louise<\/dc:creator><dc:creator>\n        Chadwick, Dave R.<\/dc:creator><dc:creator>\n        Fish, Rob D.<\/dc:creator><dc:creator>\n        Winter, Michael<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        This paper draws on lessons from a UK case study in the management of diffuse microbial pollution from grassland farm systems in the Taw catchment, south west England. We report on the development and preliminary testing of a field-scale faecal indicator organism risk indexing tool (FIORIT). This tool aims to prioritise those fields most vulnerable in terms of their risk of contributing FIOs to water. FIORIT risk indices were related to recorded microbial water quality parameters (faecal coliforms [FC] and intestinal enterococci [IE]) to provide a concurrent on-farm evaluation of the tool. There was a significant upward trend in Log[FC] and Log[IE] values with FIORIT risk score classification (r2 =0.87 and 0.70, respectively and P<0.01 for both FIOs). The FIORIT was then applied to 162 representative grassland fields through different seasons for ten farms in the case study catchment to determine the distribution of on-farm spatial and temporal risk. The high risk fields made up only a small proportion (1%, 2%, 2% and 3% for winter, spring, summer and autumn, respectively) of the total number of fields assessed (and less than 10% of the total area), but the likelihood of the hydrological connection of high FIO source areas to receiving watercourses makes them a priority for mitigation efforts. The FIORIT provides a preliminary and evolving mechanism through which we can combine risk assessment with risk communication to end-users and provides a framework for prioritising future empirical research. Continued testing of FIORIT across different geographical areas under both low and high flow conditions is now needed to initiate its long term development into a robust indexing tool.<\/dc:description><dc:date>\n        2010-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/30822\/1\/EMS_Oliver_et_al_accepted.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.envsoft.2009.10.003<\/dc:relation><dc:identifier>\n        Oliver, David M. and Page, Trevor and Hodgson, Chris J. and Heathwaite, A. Louise and Chadwick, Dave R. and Fish, Rob D. and Winter, Michael (2010) Development and testing of a risk indexing framework to determine field-scale critical source areas of faecal bacteria on grassland. Environmental Modelling and Software, 25 (4). pp. 503-512. ISSN 1364-8152<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/30822\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.envsoft.2009.10.003","http:\/\/eprints.lancs.ac.uk\/30822\/"],"year":2010,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"  1\n \n DEVELOPMENT AND TESTING OF A RISK INDEXING \nFRAMEWORK TO DETERMINE FIELD-SCALE CRITICAL \nSOURCE AREAS OF FAECAL BACTERIA ON GRASSLAND  \n \nDavid M. Oliver1*, Trevor Page1, Chris J. Hodgson2, A. Louise \nHeathwaite1, Dave R. Chadwick2, Rob D. Fish3 and Michael Winter3 \n \n \n1 Centre for Sustainable Water Management, Lancaster Environment Centre, Lancaster University, \nLancaster, UK, LA1 4AP \n2 North Wyke Research , Okehampton, Devon, UK, EX20 2SB \n3 Centre for Rural Policy Research, Department of Politics, University of Exeter, Exeter,  \nDevon, EX4 6TL \n \n \n \n \n \n \n \n \n \n \n \n \n*Corresponding author: David M. Oliver (d.m.oliver@lancaster.ac.uk). Tel: +44 (0)1524 510231, \nFax: +44 (0)1524 510217. Centre for Sustainable Water Management, Lancaster Environment \nCentre, Lancaster University, Lancaster, LA1 4AP, UK. \n \n \n \n  2\nABSTRACT \nThis paper draws on lessons from a UK case study in the management of diffuse microbial \npollution from grassland farm systems in the Taw catchment, south west England. We report on \nthe development and preliminary testing of a field-scale faecal indicator organism risk indexing \ntool (FIORIT). This tool aims to prioritise those fields most vulnerable in terms of their risk of \ncontributing FIOs to water. FIORIT risk indices were related to recorded microbial water quality \nparameters (faecal coliforms [FC] and intestinal enterococci [IE]) to provide a concurrent on-farm \nevaluation of the tool. There was a significant upward trend in Log[FC] and Log[IE] values with \nFIORIT risk score classification (r2 =0.87 and 0.70, respectively and P<0.01 for both FIOs). The \nFIORIT was then applied to 162 representative grassland fields through different seasons for ten \nfarms in the case study catchment to determine the distribution of on-farm spatial and temporal \nrisk. The high risk fields made up only a small proportion (1%, 2%, 2% and 3% for winter, \nspring, summer and autumn, respectively) of the total number of fields assessed (and less than \n10% of the total area), but the likelihood of the hydrological connection of high FIO source areas \nto receiving watercourses makes them a priority for mitigation efforts. The FIORIT provides a \npreliminary and evolving mechanism through which we can combine risk assessment with risk \ncommunication to end-users and provides a framework for prioritising future empirical research. \nContinued testing of FIORIT across different geographical areas under both low and high flow \nconditions is now needed to initiate its long term development into a robust indexing tool. \n \nKey-words: critical source area; diffuse pollution; E. coli; expert knowledge; faecal indicator \norganism; index; pathogens; risk; water quality \n \n \n \n \n \n \n  3\nINTRODUCTION \nCatchments dominated by agriculture have consistently been shown to generate high faecal \nindicator organism (FIO) pollutant concentrations in receiving waters (Sinclair et al., 2009; Kay \net al., 2008a). Consequently, farmers and land owners are under constant pressures and legal \nobligations to safeguard waterbodies and protect the environment. While nutrient management \nplanning and associated decision support and risk assessment frameworks (such as the \nPhosphorus index [PI]) are relatively well established (e.g. Lemunyon and Gilbert, 1993; Buczko \nand Kuchenbuch, 2007), no risk index tool exists to identify the relative risk of farmed land in \ncontributing microbial pollutants to water at the field scale. This is surprising given the inclusion \nof complementary directives such as the revised Bathing Waters Directive (rBWD) (CEC, 2006) \nwithin the WFD in Europe (CEC, 2000), microbial contaminants being a leading cause of \nimpairment of U.S. waterbodies (USEPA 2009), and that convenient non-pathogenic microbial \nparameters, known as faecal indicator organisms (FIOs), can be used as surrogate measures of \ninfection risk to humans throughout the world (Kay et al., 2007). \n \nContamination of watercourses with agriculturally-derived FIOs can occur through (i) direct \nroutes such as animal access and defecation into streams; and via (ii) rainfall-driven transfer from \nfarm systems to water through surface and subsurface hydrological pathways (Oliver et al., 2005). \nAn increased potential for the delivery of FIOs from agricultural land to water can be linked to \n‘ill-timed’ manure spreading activity and poor farm management such as excessive manure \napplication rates and spreading on frozen ground (Chadwick et al., 2008). Once excreted from \nlivestock, FIOs are not well adapted to survive in the farm environment and their numbers decline \nas a function of environmental variables (Sinton et al., 2007). However, variability in FIO die-off \nis such that there will often exist a period of increased risk for FIOs to be mobilised from a \nmanure or directly excreted source, transferred through farmed land and potentially delivered to a \nreceiving water while still in sufficient numbers to cause problems downstream and in coastal \nwaters (Wilkinson et al., 2006). There is an expanding (though immature relative to P and N) \nbody of empirical FIO-related science which can form the ‘evidence base’ for good regulatory \n  4\npractice (Kay et al., 2008b) and the conceptual framework outlined in this paper has been \ndesigned around the findings of existing research.  \n \nEfforts have been made to develop process-based deterministic catchment scale pathogen models, \nor budgets, through inclusion of land-based inputs, hydrological routing modules and GIS data \nlayers (e.g. Ferguson et al., 2005, 2007). In contrast, Goss and Richards (2008) have argued that \ndevelopment of a risk-based index of the potential for pathogens from agricultural activity to \nimpact on water quality is required as an interim stage in the establishment of a fully quantitative \nmicrobial risk assessment approach. The aim of this study was therefore to: (i) use established risk \nfactors (RFs) within the current evidence base to develop a conceptual framework for an FIO risk \nindexing tool that allows land managers to follow a procedure for logical risk assessment of \nrelative FIO loss from land to water on a field-by-field basis; (ii) assess the spatial and temporal \ndistribution of risk indices ; and (iii) provide a preliminary assessment of the reliability of FIORIT \non farm fields using the Taw catchment in Devon, southwest England, as a case study to \ndemonstrate the practical application of the index.  \n \nMETHODS \nConceptual Basis for the FIO Risk Indexing Tool \nThe basic premise of the conceptual framework for FIORIT was that FIO related pollution is \nderived from critical source areas (CSAs). By this we mean that source (availability) and transfer \n(mobilisation) factors must be combined and then coupled with connectivity (likelihood of \ndelivery) for a potential risk to become an actual risk. We have adopted and modified a \nframework similar to that proposed by Heathwaite et al. (2000) during the development of a \nphosphorus assessment tool. The risk indexing approach is intended to identify fields where the \npotential risk of FIO loss from land to water may be higher or lower relative to other spatial \nlocations in a farm boundary and across different seasons. Seasons (for the northern hemisphere) \nwere defined as: winter [December through February], spring [March through May], summer \n[June through August] and autumn [September through November].  \n  5\n \nKey transport, source and connectivity drivers thought to influence FIO loss from land to water \nare outlined in a preliminary risk framework (Tables 1 and 2). While the rationale for inclusion of \nthe RFs within each of the risk criteria is based on current empirical research, ascertaining their \nrelative importance when operating simultaneously at the farm scale is beyond the remit of most \nspecific research projects. In order for us to make some working assessments of how factors \nembedded in these risk criteria could be assigned significance, we initiated a process of expert \nconsultation (c.f. Simsek and Veiga, 2000). Thus, existing data and research cited in this paper \n(Table 1) formed the crux of the framework and expert judgement configured the relative \nimportance of the RFs. \n \nExpert Weighting Approach \nThis approach made use of an expert consortium comprising 16 members. Full details of the \nexpert elicitation approach are documented in Fish et al. (2009). Briefly, members were selected \non the basis of their research history, international standing and expertise in their field to ensure \nFIORIT was robust across a range of cognate scientific areas (c.f. Cornelissen et al., 2003). The \nweightings reflect the current perceptual understanding of microbiologists, soil and contaminant \nscientists, manure management experts, policy makers and geographers. The weighting for each \nRF varied on a continuous scale ranging from 0 (of no importance) through to 1 (of absolute \nimportance). Experts were requested to leave their score blank for any RFs that they felt unable to \nweight with confidence. This process was not intended to generate an extensive sample of views. \nRather, it developed indicative responses from relevant disciplines that could help make our risk \ntool operational. The sensitivities and uncertainties associated with the expert weightings were \nexplored in preliminary analyses. \n \nDescription of the FIO Risk Indexing Tool \nThe framework for the risk indexing tool was designed to use readily accessible field data, farmer \nknowledge and nationally available GIS databases (digital terrain models and digitised survey \n  6\nmaps: see Table 1). The FIORIT used parameters that have an influence on FIO availability \n(source), transfer and rapid connectivity to a watercourse (Table 1). It is recognised that a wide \nrange of parameters could have been incorporated but the index was designed to be parsimonious \nand to include only key RFs whose contribution could be justified (by the existing empirical \nevidence-base). A detailed rationale for the inclusion of each RF is also available (CSWM, 2009). \nBecause little empirical work has been undertaken to evaluate the role of mitigation and \nmanagement practices to reduce FIO loss at the field scale we were unable to justify the inclusion \nof risk-reducing factors within the FIORIT framework at this time. However, the conceptual \nframework is in a form such that future refinements are both encouraged and simple to \nimplement.  \n \nGenerating Risk Indices \nTo determine the in-field impact of each of the RFs identified in Table 1, the user must multiply \nthe RF Weighting (wtg) by the relative risk associated with the magnitude of each factor (RM): \n \nRF score = wtg x RM    (1) \n \nThe potential risk associated with each field was then calculated using the following procedure: \n(i) A field assessor, via a farm audit and detailed farmer survey, was required to rate the RM \nof each RF from ‘negligible’ through to ‘very high’ risk based on a pre-determined \ndefinition of each risk category (see Table 2). This defined framework, linked to a series \nof databases and data collection methods (Table 1) was a means of standardising a \nsubjective exercise into a more robust and replicable protocol. The corresponding score \nlinked to each RM was established manually using a series of scenarios (Table 3) rather \nthan automatic optimisation to avoid over constraint on sparse and uncertain data. .  \n(ii) The RM was then multiplied by the RF weighting to obtain the score associated with \neach individual RF (see Equation 1). \n  7\n(iii) The resulting RF score obtained by Equation 1 was summed for each risk criteria (i.e.. Σ \nsource RFs, Σ transfer RFs, Σ connectivity RFs). \n(iv) The FIO risk index (FIORI) for each field was then obtained by Equation 2: \n \n( ) ( ) ( )∑∑∑ ××= tyRFsconnectivistransferRFsourceRFsFIORI    (2) \n         \n \nThe framework was specifically designed in a multiplicative rather than additive fashion \nto ensure that field vulnerability was best represented. For example, if transfer potential \nwithin a field was negligible, its vulnerability would be low, regardless of manure \napplications or grazing activity (c.f. Heathwaite et al., 2000).  \n(v) The resultant score is arbitrary but provides a normalised scale upon which to assign \nrelative potential risk to each assessed field. Based on typical output from a range of \nfarms, risk categories were broken down into five classes of:  0 = negligible (but \ncrucially not zero risk); 1-100 = low-; 101-200 = medium-; 201-300 = high-; and > 300 = \nvery high- risk). Temporal and spatial changes in relative potential risk can then be \ncommunicated visually in a map format to the end-user by georeferencing risk indices \ninto a GIS (c.f. Defra 2005a). \n(vi) Although negligible risk fields were indexed as 0, this did not imply that the field would \nbe ‘risk free’ but that the observed criteria suggested a negligible potential risk attributed \nto a field. Furthermore, no fields were considered to be completely devoid of \nhydrological connectivity because slow pathways through the soil matrix were likely to \noperate when more direct routes of hydrological connectivity were absent. To account for \nthis, those fields that did not register a score for connectivity RFs within FIORIT were \nassigned a connectivity coefficient of 0.1 for multiplication with source and transfer \nrelated risk drivers. This ensured that an appreciation of slower delivery mechanisms \nremained within the indexing approach, though operating at a much reduced magnitude \ndue to the filtering capabilities of the soil matrix and in line with our conceptual \nunderstanding of FIO loss from land to water.  \n  8\n \nA case study from the Taw catchment, Devon \nThe Taw Catchment in Devon, UK is presented as a case study to contextualise the FIORIT and \ndemonstrate its practical application on agricultural land. The Taw catchment is 1200 km2 in area \nand typifies a major European catchment type with intensive livestock production on rural \ngrassland which accounts for >80% of the land use. The soils are moderately permeable and are \ncoupled with low groundwater storage resulting in rapid stream responses to rainfall and a \ncatchment hydrology dominated by near-surface runoff and rapid hydrograph recession (Jarvie et \nal., 2008). A sample of 162 grassland fields across 10 farms in the Taw catchment were assessed \nusing the FIORIT in order to derive a first-approximation of risk indices for winter, spring, \nsummer, and autumn scenarios and thus assess the distribution of spatial and temporal on-farm \nrisk within the geographic constraints on the case study area. To demonstrate potential \ndevelopment and testing of FIORIT we have included an evaluation of microbial water quality \ndata (collected at two of the 10 farms) against output from FIORIT and also included a set of risk \nindices linked to FIORIT modified with a rainfall likelihood coefficient (RLC) derived from 30 \nyear average rainfall records for the Taw catchment (Morris, 1999). The RLC served to scale risk \nindices relative to seasonal rainfall, working from the assumption that rainfall forms a crucial \ndriver of FIO mobilisation from land and delivery to water (Oliver et al., 2005a). Thus, ‘winter’ \n(highest rainfall) was normalised to an RLC of 1.0 (Taw catchment long term average monthly \nrainfall of 121 mm) and all other seasons were graded to derive RLC’s of 0.99, 0.65 and 0.63 for \nautumn, spring, and summer, respectively, in proportion to their relatively lower average rainfall \ntotals of 112 mm, 78 mm, and 76 mm. Such seasonal coefficients are spatially sensitive and can \nbe derived for any study area of the UK using this nationally available dataset. Elsewhere, \nequivalent nationally available long-term rainfall records can be used.  \n \nFarm and Field Description \nMicrobial water quality data were collected from monitoring sites located on two of the ten farms \n(see Fig 2 and Table 4 for field details) in the Taw catchment. The two farms differed in their \n  9\nphysical layout and general management, but were situated within close proximity to one another \nwith similar climatic conditions. Briefly, the mean temperature for winter, spring, summer and \nautumn (at both field sites) was 5.0, 8.3, 16.3, and 12.5oC, respectively. October was the wettest \nmonth with 151 mm of rainfall and July the driest with 26 mm rainfall. In January 2006 only one \nquarter of the typical average monthly rainfall was recorded. During 2006, annual rainfall for the \nsouth west of England was 1129 mm (Met Office, 2007), 7% lower than the 1961-1990 long term \naverage. Farm A was 120 ha in size and held 35 beef cows, 35 calves and 1150 sheep. Farm B \nwas 117 ha and stocked with 72 beef cattle and 1072 sheep. Both farms were predominantly \ngrassland (87% and 69% of total land area for Farm A and B, respectively). On-farm verification \nof a field scale tool is difficult to achieve at the un-replicated farm scale due to inherent \nuncertainties associated with FIO sources and pathways within farm systems. Subsequently, the \nfocus of the evaluation study was four contrasting seasons of management for two key \ncontributory grassland fields adjacent to the watercourse (one within each of the farm boundaries; \nField 1 on Farm A and Field 2 on Farm B). The two fields were chosen based on comprehensive \nfarm survey and assessment exercises, farmer knowledge, and through preliminary risk screening. \nThe aim was to minimise external FIO inputs from neighbouring farmed land due to favourable \nsurrounding land-use (woodland) and site location. A stream monitoring site at each field \nboundary was set up and samples collected during a 12-month period, allowing for estimates of \ntypical seasonal flux (CFU L-1s-1) for the year 2006. In the case of these two farms, no small \nfeeder streams intercepted the sample site, thus minimizing contributions of FIOs from other \nfields. For Farm B, water quality was measured at an upstream location before it entered Field 2 \nand FIO inputs were consistently negligible. Furthermore, the field assessed on Farm B was \nsituated on both sides of the stream negating the problematic role of extraneous inputs from a \nfield on the opposite stream bank. Field 1 on Farm A was in close proximity to the stream source \nand so limited input was considered to be attributed from above the farm and this was confirmed \nby upstream analysis. Additionally, the stream was surrounded on the opposite bank with riparian \nwoodland. We therefore judged that the two key fields we assessed for FIO loss vulnerability \nmust be considered the dominant contributors to the microbial water quality of the sample site.  \n  10\n \nInstrumentation \nStream discharge (Q) measurements were completed at each farm to obtain FIO flux data. Stream \nQ was estimated using the area-velocity method (Fetter, 2001). Flow velocity was measured using \na Valeport model 002 open channel flow meter (Valeport Ltd., UK). Cross sectional area of the \nstream as a function of water level was determined and a rating equation derived to describe the \nstage-discharge relationship. Precipitation data was collected at farm sites using a Skye Minimet \nmeteorological station (Skye Instruments Ltd., UK).   \n \nSample Collection and Analysis \nBoth faecal coliforms (FC) and intestinal enterococci (IE) were recorded to provide a comparative \nevaluation of FIORIT against two routine FIOs. Regular fortnightly grab sampling over one year \nwas augmented with a more intensive sampling campaign during key periods of the year thought \nto be associated with high risk of FIO delivery to water. Water samples were collected in pre-\nsterilised 500-mL, screw top polypropylene bottles, stored on ice in a cool box and analyzed in \nthe laboratory within 6 hr of collection. During the more intensive sampling campaign for each \nfarm, a mobile laboratory was utilised to aid timely plating of the samples. On these occasions the \ntime between collection of the water sample and laboratory analysis was 2 to 4 hr. All stream \nsamples were analyzed for presumptive FC, and presumptive IE using standard UK methods \nbased on membrane filtration (Anon, 2002).  \n \nStatistical Analysis \nMicrobial data were log-transformed and statistical analysis was performed using these \ntransformed data using Genstat 9.1 for Windows (VSN International, 2006). Instantaneous \nmicrobial flux (c.f. Oliver et al., 2005a) was calculated by multiplying discharge by concentration. \nComparisons of farm data (both flow and microbial) were made using a two-tailed t test. \nPearson’s product-moment correlation coefficients were derived to assess the association between \nmicrobiological variables and risk indices. Linear regression was used to discriminate the \n  11\npercentage of variance in FIO flux explained by FIORIT. Other regression models, including \nquadratic, were evaluated but did not provide significant improvement in the linear model.   \n \nRESULTS \nExpert weightings and associated sensitivity and uncertainty analyses \nThe expert weighted data provided information on the importance of RFs relative to one another.. \nThe mean values are shown within the matrix framework (Table 2). The average from the return \nof 16 weightings was accommodated within the risk index as the final weighting per RF so as not \nto desensitise upper and lower expert weightings. This was because experts only weighted RFs if \nthey were confident in their judgements, and so it was inappropriate to use the median. The ranges \nof the expert weightings are published elsewhere (Fish et al., 2009).  \n \nThe form of the FIORIT equation (Eqn. 2) is such that there are 3, 7 and 6 variables associated \nwith the transport, source and connectivity risk criteria, respectively. This means that these \ncriteria have relative implicit weightings of 1, 0.43 and 0.5, respectively. The actual sensitivity of \nthe expert weightings is however dependent upon the magnitude of the expert weighting in \nquestion, the magnitudes of the other expert weightings in each class and the magnitudes of the \nrisk scores in each class for any given field as shown in Equation 3. For example, for any given \nfield if the RM = 0 then the risk factor will be insensitive by definition.   \n \nii\nRIN\nj jj\nii\nRI\nwtg\nwtgwtg\nFIO\nRMwtg\nRMwtgkFIO\nSI\ni ∆×\n−\n\n\n\n\n\n\n\n\n×\n×\n×−+×\n=\n∑\n=1\n)1(1\n  (3) \n \n \nwhere: SIwtg is the sensitivity index for a given expert weighting, k is a multiplier in the sensitivity \nanalysis which determines the change in a given expert weighting and N is the number of \nweightings in wtgi’s class.  \n \n  12\nRFs attributed with the highest expert weighting but which also accommodated a large range (or \nlack of consensus) in expert scores (see Fish et al., 2009) are implicitly the most uncertain, and \nvice versa. Thus, ‘livestock access to streams’ and ‘livestock type’ were identified as the most and \nleast uncertain RFs within FIORIT. Following Livestock access to streams, the RFs contributing \nmost error intrinsic to the index were ‘overland Flow distance’ and ‘runoff potential’.  \n \nWater Quality Data and Field Risk Indices \nThere was a significant (P<0.001) difference in the average recorded stream flow (measured at \ntime of microbial sample collection) at both farms. Flow at Farm A averaged 22 L s-1 compared to \n50 L s-1 at Farm B. For Farm A, measured flux on sampling dates ranged between log104.0 and \nlog105.8 CFU L-1s-1 for FC, and for IE the range spanned from log103.46 to log105.77 CFU L-1s-1. \nOn Farm B, the range in FC values was of a higher magnitude (log105.4 to log107.6 CFU L-1s-1) as \nwas that associated with IE (log104.7 to log107.2 CFU L-1s-1). An example of FIO fluctuations \nthrough time and with respect to daily rainfall is shown in Figure 2. This shows measured FIO \nflux in time-series during ‘spring’ on both of the farms. The flux (and hence concentrations) of \nFC are consistently higher than that of IE at both Farm A and B. Neither FC nor IE flux exceeded \n1 x 106 CFU L-1s-1 on Farm A, which contrasted with CFUs exceeding this threshold on Farm B. \nThroughout the year, the average measured flux of FC and IE was significantly higher (P<0.0001) \nat Farm B.  \n \nThe microbial water quality data enabled calibration of RM categories within FIORIT. The \nscenarios shown in Table 3 provided r2 values for the unmodified and RLC modified FIORIT as \nshown in Table 5. Thus the arithmetric  progression of 0, 1, 2, 3, 4 was adopted for RM \ncategorisation within the FIORIT rather than a geometric progression. In turn, the FIORIT risk \nindices for Field 1 (Farm A) were 100 (low), 144 (medium), 112 (medium) and 197 (medium) for \nspring, summer, autumn and winter, respectively. When modified using the RLC, the risk indices \nfor those same seasons converted to 65 (low), 91 (low), 111 (medium) and 197 (medium). \nDerived risk indices for Field 2 (Farm B) were relatively high: 291 (high), 389 (very high), 325 \n  13\n(very high) and 168 (medium) for spring, summer, autumn and winter, respectively, converting to \n189 (medium), 245 (high), 385 (very high) and 168 (medium) when modified with the RLC. In an \nattempt to provide a preliminary quantification of the potential errors in FIORIT output stemming \nfrom the uncertainty in the expert weightings, we performed an uncertainty analysis of the \nunmodified FIORIT risk indices (Figure 3). The uncertainty assessment took the form of a \nsimplistic forward-propagation methodology using Monte Carlo sampling from normal \ndistributions generated using the mean and standard deviations from the elicited expert \nweightings.  Figure 3 shows the resulting ranges of predicted risk indices in the form of box and \nwhisker plots. where it can be seen that on average there is approximately +\/- 30% error between \nthe 50th and the 25th and 75th percentiles. Ideally this uncertainty analysis should be extended to \ninclude constraint of risk index estimates with field data (e.g. by using the GLUE method (Beven \nand Binley, 1992). We chose not to extend our uncertainty analysis in this case owing to limited \nfield data available for model constraint. \n \nThere was a significant (P<0.01) upward trend (Fig 4A) in both Log[FC] and Log[IE] values with \nincreasing risk indices derived by FIORIT using the unmodified framework. The intercept at the \nlowest level of risk corresponded to a greater than expected FIO flux of between 3-10 x 103 CFU \nL-1s-1. Adapting FIORIT based on the RLC allowed us to scale down field risk indices (potential \nrisk) associated with seasons during which rainfall is typically less likely. Evaluation of the \nrelationship between microbial water quality parameters and the modified FIORIT risk indices \n(Fig 4B) highlighted that the RLC did not alter the direction or significance of the previously \nobserved trend, though it did impact on the explained variance of the two microbial parameters. \n(Table 5).. \n \nExtending FIORIT for the Taw Catchment Case Study \nThe statistically significant relationship between microbial water quality parameters and FIORIT \nrisk indices was used to extend the application of FIORIT to a larger cross sample of fields to \ngauge the variability in field-scale risk of FIO delivery to water at the farm scale. The output of \n  14\nFIORIT is summarised as a frequency distribution of results from the seasonal assessment of 162 \ngrassland fields across 10 farms in the Taw Catchment, Devon (Fig 5). The data presented in Fig. \n5 are based on field assessment, GIS data and collected management information. Of the surveyed \nfields, the majority fell within the negligible and low risk category (88%, 87%, 85% and 90% for \nwinter, spring, summer and autumn, respectively). The seasons accommodating the highest \nproportion of ‘very high’ risk fields was found to be summer and autumn (both 1%) whereas \nwinter and spring were ranked as having no ‘very high’ seasonal risk. When FIORIT was \nmodified to include the RLC these distributions shifted slightly so that proportions of the medium \nto high risk fields were reduced (Fig 5). \n \nDISCUSSION \nDevelopment of practical and pragmatic approaches to mitigating microbial pollution from \nagriculture at the farm level requires identification of: (i) CSAs of FIO loss; (ii) reasons why \nCSAs exist; and (iii) management strategies to reduce risk. Clearly the importance of field sources \ndepends on the timing and extent of faecal deposition and die-off rates (Vinten et al., 2008), and \nland application of manures in spatially and temporally heterogeneous patterns (Scholefield et al., \n2007). While such FIO source burdens are clearly spatially and temporally complex, the study \nreported in this paper suggests that basic RFs, derived from field assessment, nationally available \ndatasets and farm survey, can be coupled with current scientific understanding and supported by \npublished research and professional judgement to offer an initial approximation of the relative risk \nof FIO loss from land to water without the need for quantitative risk assessment. The output of \nFIORIT can be complementary to other risk assessment management strategies. For example, in \nthe UK Defra manure management and soil management plans (Defra, 2003; Defra, 2005a) which \nare linked to environmental stewardship schemes (Defra, 2005b), help raise awareness of manure \nspreading strategies and other farm activities that could potentially cause pollution of \nwatercourses. Thus, the format represents a system which is familiar to farmers and landowners \nand this is likely to be advantageous for successful uptake or coupling of the tool with \n  15\ncomplementary management plans provided that a user-friendly interface is developed to facilitate \nintegration of the different input data sources.  \n \nUndoubtedly, the conceptual framework of FIORIT is constrained by existing knowledge, but this \nhas also been the case with the PI during development from its original conceptualization \n(Bechmann et al., 2007) and this applies to most models of diffuse pollution. We have \ndemonstrated the potential for modification of FIORIT via inclusion of the RLC; but additionally, \nas our understanding and associated wealth of research findings grow, end-users can further adapt \nthe tool to incorporate new knowledge, local factors and subsequent refinements. In the absence \nof conclusive field-scale evidence on the relative magnitudes of each RF, the elicited expert \nweightings provide a first-approximation and also hypotheses to be tested in the future but are, of \ncourse, subject to uncertainty as evidenced by Figure 3. However, the flexibility in tool structure \nserves to ‘future-proof’ FIORIT in a way that can facilitate adaptive modelling (Beven, 2007). As \nan example, die-off of FIOs is currently reflected within FIORIT via the ‘aged faecal material’ \nRF, and also links to risks attributed to different livestock types related to a combination of \nfactors such as volumes of faeces excreted and physical properties and release riskiness of the \nfaeces rather than strict relationship with die-off, where there exists much uncertainty. Little \nresearch has actually been reported on field scale die-off of E. coli or IE in different types of \nlivestock faeces through different months of deposition (Van Kessel et al., 2007). While FIORIT \nfunctions well enough using a simplistic surrogate for die-off without including seasonal die-off \ncorrections relating to UV and temperature fluctuations, development of an established database \nof such information would provide the foundation to refine FIORIT to accommodate such \ninclusions in the future. \n \nThe higher stream flow associated with Farm B was partly responsible for the elevated FIO flux \nregularly recorded at this farm (Fig 2). However, management practices and inherent landscape \nfeatures would clearly influence concentrations of cell export from land, and hence contribute to \nvariations in fluxes recorded in receiving streams. For example, the differences in flux observed \n  16\nin Figure 2 during spring at Farm A and B relate not only to stream flow but also to differences in \nanimal and manure application activity. Farm A received a single application of FYM in winter \nand spring and was not grazed until June, whereas Farm B received fresh faecal inputs from \ngrazing sheep and lambs throughout March to May. The upward trends shown in Figure 4 are \nconsistent with increasing influence of the FIO burden to land on microbial loads at monitoring \nsites (Lewis et al., 2005). This FIO burden was largely derived from grazing and stock \nmovements, particularly as animals were turned out from winter housing. However, the intercept \nwas higher than what we would expect. At lowest levels of risk, FIORIT indicated a stream flux \nof between 3-10 CFU mL-1s-1, which is not consistent with negligible flux risk. This higher than \nexpected intercept may be relate to: (1) the potential contribution of uncontrolled inputs derived \nfrom wild animals (Meays et al., 2006); (2) livestock access to watercourses that may re-suspend \nstream sediment which can contain historical FIO risk from past pollution events (Jamieson et al., \n2005); and (3),annual rainfall for the south west of England in 2006 being only 1129 mm (Met \nOffice, 2007), 7% lower than the 1961-1990 long term average. Microbial data presented within \nthis evaluation therefore represents the results from a particularly dry year during which storm \nflow events were scarce at the sampling sites. The FIORIT is used to identify potential risk of \nfields, but for potential risk to become an actual risk, rainfall is needed to act as a driving \nmechanism. We can speculate that had we obtained high flow event data, then the high risk \nindices may have been associated with microbial loads several orders of magnitude higher than \nthose reported (McDonald and Kay, 1981; Kay et al., 2008b), thus increasing the slope of the \nrelationship and reducing the intercept.. Similarly, the range of flux data for both farms would \nprobably have been much larger if wet weather had predominated.  \n \nInterestingly, the results show slight differences (in terms of biological variability) between the \ntwo FIOs monitored and their relation with increasing risk indices. However, as would be \nexpected, both follow the same upward trend. Such differences could be a reflection of their \ndifferential die-off patterns in various agricultural matrices (Wang et al., 2004). Others have \nshown that FC and IE exhibit significantly different release kinetics from manure sources and \n  17\nhave suggested that FC may have resided in more liquid parts of manure, whereas IE were \napparently present in less readily suspended, possibly solid, parts of manure (Guber et al., 2007); \nand this could also have contributed to differences in explained variance between the two \norganisms. So, the RLC derived indices are perhaps more reflective of runoff related risks and \nthis may explain the strengthening of the IE relationship with the modified FIORIT risk indices in \nFigure 4B.  \n \nThe frequency distribution data shown in Figure 5 is positive in that it highlighted that the \nmajority of fields (>85%) within our representative sample were deemed to be of negligible or \nlow risk throughout the year (through either limited source or transfer potential within fields). \nThis suggested that bacterial pollution was sourced from a small proportion of critical fields that \nfacilitate the routing of faecal bacteria through the environment to surface waters. Similar \nfindings, derived from nutrient management tools, have been reported for P (Coale et al., 2002) \nand others have documented that small agricultural areas (<20% of catchment area) can be \nresponsible for the majority of P pollution incidents (Heathwaite et al., 2000). While the highest \nrisk fields make up only a small proportion of the total fields assessed, their ability to link high \nFIO source areas to watercourses makes them a particular concern and a priority for mitigation. \nIncluding a temporal component in FIORIT was important because different agricultural activities \nwere typical of particular times of the year suggesting that an annual risk map would not be of an \nappropriate resolution to capture fluctuations in potential FIO loss from land to water. FIORIT \nprovided a simple means of identifying potentially high risk periods of the year and spatial \nhotspots of FIO loss from land to water on working farms.  \n \nFuture Potential and lessons learned \nAt present FIORIT remains prototypical in design, but its development has progressed following \nthe protocols proposed by Jakeman et al. (2006) and Refsgaard et al. (2007) with respect to \ndefinition of tool purpose and associated modelling context, tool conceptualisation, rationale for \nparameter inclusion within the tool structure and preliminary evaluation and uncertainty analysis. \n  18\nThis procedure, combined with model evaluation, has been well demonstrated for previous studies \n(Robson et al., 2008; Welsh, 2008). While we acknowledge uncertainties associated with expert \nweightings, we maintain that model uncertainty must be considered in the context of the purposes \nof the model (Jakeman et al., 2006). The FIORIT was designed to assist land-owners to make \ndecisions based on relative risk rather than to quantitatively predict water quality impairment \nwhere discrepancies in observed and predicted data would be much more critical. The implicit \nuncertainties that were translated from the expert consultation exercise will instead help us frame \npriorities for future research. For example, the three RFs contributing the greatest error intrinsic to \nthe risk index, namely cattle access to streams, overland flow distance and runoff potential should \nbe a priority for future research. The highest uncertainty, linked to cattle access to streams, \nequates to a lack of knowledge with regard to how effective stream bank fencing would be in \nrelation to improvements in microbial water quality. Uncertainty in overland flow accumulation \nand runoff potential highlights the lack of current understanding with regard to episodic runoff \nevents and their role in providing connectivity from source to stream. Indeed, flow connectivity \nsimulation has been advocated by others as a complementary modelling approach to pursue \nfurther (Kay et al., 2007).  \n  \nFurthermore, by applying FIORIT to a case study catchment it has become clear that next steps \nshould include the development of a user-interface for FIORIT so that end-users of this research \ntool are able to input associated data for farm environments in order to derive index output. This \nwould require a coupling of standard GIS software with a database of risk indices and those \ndatasets specified as pre-requisites for FIORIT. Additionally, scaling opportunities exist to \naccount for within-field variability of risk which would offer higher resolution determination of \ncritical source areas and provide a more targeted system of management or mitigation once high \nrisk fields have been identified. Perhaps a more interesting use of FIORIT is to use it as a device \nto aid thinking and generate discussions within focus groups of scientists, land managers and \nfarmers (c.f. Hewett et al., 2004). This would also allow for qualitative verification of the tool’s \ncapabilities with knowledgeable stakeholders and, should the tool function inappropriately for a \n  19\ngiven scenario, then the assumptions and weightings would need to be re-evaluated (Jakeman et \nal., 2006). Using FIORIT in this way would enable knowledge exchange, interactions and idea \nsharing between scientists and end-users but also ensure that the credibility of FIORIT would \ncontinue to evolve. In this respect FIORIT can therefore be used as a scenario testing tool, \nallowing changes in potential risk to be calculated based on changes in farm management.  \n \nWe reiterate that fields ranking as negligible risk will still pose a small risk of FIO loss to \nwatercourses via slower hydrological routes, but relative to other fields whereby visible and rapid \noverland flow pathways were connecting faecal sources directly to the watercourse, then a risk \nclassification of ‘negligible’ remains appropriate. Critically, this does not mean that such fields \ncan be over-burdened with manure applications because of being classified as negligible risk of \ncontributing FIOs to water. The key point is that holistic strategies of risk assessment for other \npollutants (e.g. P and N) should be employed so that FIORIT will be used in conjunction with \nrecommended guidelines for manure application rates and stocking densities.  \n \nCONCLUSIONS \nThis evaluation has highlighted the potential for FIORIT to rank farm fields according to their \nrelative risk of FIO contribution to watercourses. While preliminary analysis suggested that on \naverage there is approximately +\/- 30% error between the 50th and the 25th and 75th percentiles of \nthe FIORIT output this is a first approximation of an FIO risk indexing tool so future adaptation \nand modification must be encouraged and as with the PI, development will progress with the \nextension of our knowledge base..We have purposely structured FIORIT so as not to over-\ncomplicate the framework and to allow for a flexible and practical strategy for on-farm microbial \nvulnerability mapping. Indeed, complexity is not justified if all that is required is a general risk \nassessment framework for more specific, on farm advice (Strauss et al., 2007) and prioritization of \nmitigation strategies. However, the next phase is to test FIORIT in different geographical \nlocations beyond the case study catchment and gather more on-farm data to facilitate the widening \nscope of the tool’s capabilities (Scholten et al., 2007). Beyond this, further validation and \n  20\nmodifications of the tool will help ensure FIORIT serves its intended purpose, both in the short \nterm for framing research needs, as evidenced by the uncertainty in expert weighting, and in the \nlong term through development into a robust indexing tool.  \n \nACKNOWLEDGEMENTS \nThe authors would like to acknowledge the participation of the 16 anonymous experts for their \nvaluable contributions in the risk factor weighting exercise and Nick Bulmer for his valuable \nsupport and assistance with field work and analysis. We are grateful to both farmers who kindly \nallowed access to their land and sampling points and cooperated with farm survey requirements. \nThis work was funded as part of project RES-224-25-0086 by the Rural Economy and Land Use \n(RELU) programme who receive financial support from the Biotechnology and Biological \nSciences Research Council (BBSRC), the Natural Environment Research Council (NERC), the \nEconomic and Social Research Council (ESRC), the Department for Environment, Food and \nRural Affairs (Defra) and the Scottish Office. Finally, the constructive comments of Tony \nJakeman and three anonymous referees helped to significantly improve the quality of this \nmanuscript.  \n \nREFERENCES \nAbu-Ashour, J. and Lee, H. 2000. Transport of bacteria on sloping soil surfaces by runoff. \nEnvironmental Toxicology 15, 149-153.  \nAitken, M. N. 2003. Impact of agricultural practices and river catchment characteristics on river \nand bathing water quality. Water Science and Technology 48, 217-224. \nAnonymous. 2002. The Microbiology of Drinking Water Part 5 - A method for the isolation and \nenumeration of enterococci by membrane filtration. The Environment Agency, UK. \nBechmann, M. E., Stalnacke, P. and Kvaerno, S. H. 2007. Testing the Norweigan phosphorus \nindex at the field and subcatchment scale. Agriculture Ecosystems and Environment 120, \n117-128. \n  21\nBeven, K. 2007. Towards integrated models of everywhere: uncertainty, data and modelling as a \nlearning process. Hydrology and Earth System Sciences 11, 460-467. \nBeven, K and Binley, A. 1992. The future of distributed models – model calibration and \nuncertainty prediction. Hydrological Processes, 6, 279-298. \nBilotta, G. S., Brazier, R. E., and Haygarth, P. M. 2007. Processes affecting the transfer of \nsediment and colloids, with associated phosphorus, from intensively farmed grasslands: \nerosion. Hydrological Processes 21, 135-139. \nBuczko, U. and Kuchenbuch, R. O. 2007. Phosphorus indices as risk assessment tools in the USA \nand Europe – a review. Journal of Plant Nutrition and Soil Science 170, 445-460. \nCEC, 2000. Council of the European Communities. Council Directive 200\/60\/EC of the European \nParliament and of the council of 23 October 2000 establishing a framework for \ncommunity action in the field of water policy. Official Journal of European Union L327, \n1-72. \nCEC, 2006. Council Directive 2006\/7\/EC of the European Parliament and of the council of 15th \nFebruary 2006 concerning the management of bathing water quality and repealing Directive \n76\/160\/EEC. Official Journal of the European Union. L64, 37-51. \nChadwick, D. R., Fish, R. D., Oliver, D. M., Heathwaite, A. L., Hodgson, C. J. and Winter, M. \n2008. Management of livestock and their manure to reduce the risk of microbial transfers \nto water - the case for an interdisciplinary approach. Trends in Food Science and \nTechnology, 19 240-247. \nChambers, B. J., Nicholson, R. J., Smith, K., Pain, B. F., Cumby T. R., and Scotford, I. M. 2001. \nManaging Livestock Manures: Booklet 2 – Making better use of livestock manures on \ngrassland. 24 pp. Defra, Noble House, Smith Square, London SW1P 3JR. \nCoale, F. J., Sims, T., and Leytem, A. B. 2002. Accelerated deployment of an agricultural nutrient \nmanagement tool: The Maryland phosphorus site index. Journal of Environmental Quality \n31, 1471-1476. \nCollins, R., Elliott, S. and Adams, R. 2005. Overland flow delivery of faecal bacteria to a \nheadwater pastoral stream. Journal of Applied Microbiology 99, 126-132. \n  22\nCornelissen, A. M. G., van den Berg, J., Koops, W. J. and Kaymak, U. 2003. Elicitation of expert \nknowledge for fuzzy evaluation of agricultural production systems. Agriculture  \nEcosystems and Environment 95, 1-18. \nCrowther, J. Wyer, M. D., Bradford, M., Kay, D., Francis, C., A., and Knisel, W. G. 2003. \nModelling faecal indicator concentrations in large rural catchments using land use and \ntopographic data. Journal of Applied Microbiology. 94, 962-973. \nCSWM, 2009 http:\/\/www.lec.lancs.ac.uk\/cswm\/foodchains\/pd4.php. Viewed on 12th May 2009. \nCuttle, S. P., Macleod, C. J. A., Chadwick, D. R., Scholefield, D., Haygarth, P. M., Newell-Price, \nP., Harris, D., Shepard, M. A., Chambers, B. J. and Humphrey, R. 2007. An inventory of \nthe methods to control diffuse water pollution from agriculture (DWPA). Defra ES0203, \nLondon. \nDavies-Colley, R. J., Nagels, J. W., Smith, R. A., Young, R. G. and Phillips, C. J. 2004. Water \nquality impact of a dairy cow herd crossing a stream. New Zealand Journal of Marine and \nFreshwater Research 38, 569-576. \nDefra 2003. Manure management plan: a step by step guide for farmers. Viewed on 30th April \n2009. Available online at: \nhttp:\/\/www.defra.gov.uk\/corporate\/regulat\/forms\/agri_env\/nvz\/manureplan.pdf \nDefra, 2005a. Producing a soil management plan for environmental stewardship. Viewed on 30th \nApril 2009. Available online at: http:\/\/www.defra.gov.uk\/erdp\/pdfs\/es\/guidance\/es-soil-\nmanagement-plan.pdf \nDefra, 2005b. Entry Level Stewardship Handbook. Viewed on 30th April 2009. Available online \nat: http:\/\/www.defra.gov.uk\/erdp\/pdfs\/es\/els-handbook.pdf. \nFetter, C.W. 2001. Applied Hydrogeology. 4th ed. New Jersey: Prentice Hall. 598 p. \nFerguson, C. M., Croke, B., Ashbolt, N. J. and Deere, D. A. 2005. A deterministic model to \nquantify pathogen loads in drinking water catchments: pathogen budget for the \nWingecarribee. Water Science and Technology 52, 191-197 \n  23\nFerguson, C. M., Croke, B. F. W., Beatson, P. J., Ashbolt, N. J. and Deere, D. A. 2007. \nDevelopment of a process-based model to predict pathogen budgets for the Sydney \ndrinking water catchment. Journal of Water and Health 5, 187-208. \nFish, R. D., Winter, M., Oliver, D. M., Chadwick, D. R., Selfa, T., Heathwaite, A. L. and \nHodgson, C. J. 2009. Unruly pathogens: eliciting values for environmental risk in the \ncontext of heterogeneous expert knowledge. Environmental Science and Policy, in press \nGoss, M and Richards, C. 2008. Development of a risk-based index for source water protection \nplanning, which supports the reduction of pathogens from agricultural activity entering \nwater resources. Journal of Environmental Management 87, 623-632. \nGuber, A. K., Karns, J. S., Pachepsky, Y. A., Sadeghi, A. M., Van Kessel, J. S., and Dao, T. H. \n2007. Comparison of release and transport of manure-borne Escherichia coli and \nenterococci under grass buffer conditions. Letters in Applied Microbiology 44, 161-167. \nHeathwaite, A. L., Sharpley, A., and Gburek, W. 2000. A conceptual approach for integrating \nphosphorus and nitrogen management at watershed scales. Journal of Environmental \nQuality, 29 158-166. \nHewett, C. J. M., Quinn, P. F., Whitehead, P. G., Heathwaite, A. L., and Flynn, N. J. 2004. \nTowards a nutrient export risk matrix approach to managing agricultural pollution at \nsource. Hydrology and Earth System Sciences 8, 834-845. \nHutchison, M. L., Walters, L. D., Moore, A., Crookes, K. M., and Avery, S. M. 2004. Effect of \nlength of time before incorporation on survival of pathogenic bacteria present in livestock \nwastes applied to agricultural soil. Applied and Environmental Microbiology 70, 5111-\n5118. \nJakeman, A. J., Letcher, R. A. and Norton, J. P. 2006. Ten iterative steps in development and \nevaluation of environmental models. Environmental Modelling and Software 21, 602-\n614. \nJamieson, R. C., Joy, D. M., Lee, H., Kostaschuk, R., and Gordon, R. J. 2005. Resuspension of \nsediment-associated Escherichia coli in a natural stream. Journal of Environmental \nQuality, 34 581-589. \n  24\nJarvie, H. P., Haygarth, P. M., Neal, C., Butler, P., Smith, B., Naden, P. S., Joynes, A., Neal, M., \nWickham, H., Armstrong, L., Harman, S., Palmer-Felgate, E. J. 2008. Stream water \nchemistry and quality along an upland-lowland rural land-use continuum, south west \nEngland. Journal of Hydrology, 350, 215-231. \nJoy, D. M., Lee, H., Reaume, C. M., Whiteley, H. R. and Zelin, S. 1998. Microbial contamination \nof subsurface tile drainage water from field applications of liquid manure. Canadian \nAgricultural Engineering 40, 153-160. \nKay, D., Crowther J., Stapleton, C. M., Wyer, M. D., Fewtrell, L., Anthony, S., Bradford, M., \nEdwards, A., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., Watkins, J. and \nWilkinson, J. 2008a. Faecal indicator organism concentrations and catchment export \ncoefficients in the UK. Water Research, 42, 2649-2661. \nKay, D., Crowther, J., Fewtrell, L., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., \nStapleton, C. M., Watkins, J., Wyer, M. D. 2008b. Quantification and control of microbial \npollution from agriculture: a new policy challenge? Environmental Science & Policy 11, \n171-184. \nKay, D., Edwards, A. C.,  Ferrier, R. C., Francis, C., Kay, C., Rushby, L., Watkins, J., McDonald, \nA. T., Wyer, M., Crowther, J., and Wilkinson, J. 2007. Catchment microbial dynamics: \nthe emergence of a research agenda. Progress in Physical Geography 31, 59-76. \nKress, M and Gifford, G. F. 1984. Fecal coliform release from cattle fecal deposits. Water \nResources Bulletin 20, 61-66. \nLemunyon, J. L. and Gilbert, R. G. 1993. The concept and need for a phosphorus assessment tool.  \nJournal of Production Agriculture 6, 483-486. \nLewis, D. J., Atwill, E. R., Lennox, M. S., Hou, L., Karle, B., and Tate, K. W.  2005. Linking on-\nfarm dairy management practices to storm flow faecal coliform loading for California \ncoastal watersheds. Environmental Modelling and Assessment 107, 407-425. \nMcDonald, A., and Kay, D. 1981. Enteric bacterial concentrations in reservoir feeder streams: \nbaseflow characteristics and response to hydrograph events. Water Research 15, 961-968. \n  25\nMcDowell, R. W. 2006. Contaminant losses in overland flow from cattle, deer and sheep dung. \nWater Air and Soil Pollution. 174, 211-222. \nMcDowell, R. W.,Drewry, J. J., Muirhead, R. W. and Paton, R. J. 2005. Restricting the grazing \ntime of cattle to decrease phosphorus, sediment and E. coli losses in overland flow from \ncropland. Australian Journal of Soil Research 43, 61-66. \nMcLeod, M., Aislabie, J., Ryburn, J., McGill, A. 2008. Regionalizing potential for microbial \nbypass flow through new Zealand Soils. Journal of Environmental Quality, 37, 1959-\n1967. \nMeays C. L., Broersma, K., Nordin, R., Mazumder, A., and Samadpour, M. 2006. Spatial and \nannual variability in concentrations and sources of Escherichia coli in multiple \nwatersheds. Environmental Science and Technology 40, 5289-5296. \nMorris, D. G. 1999. Sub-set of UK time-series of monthly rainfall grids. NERC, Institute of \nHydrology, Wallingford. \nMuirhead, R. W. 2009. Soil and faecal material reservoirs of Escherichia coli in a grazed pasture. \nNew Zealand Journal of Agricultural Research, 52, 1-8. \nMuirhead, R. W., Collins, R. P., and Bremer, P. J. 2006. Interaction of Escherichia coli and soil \nparticles in runoff. Applied and Environmental Microbiology 72, 3406-3411. \nNguyen, M. L., Sheath, G. W., Smith, C. M., and Cooper, A. B. 1998. Impact of cattle treading on \nhill land 2. Soil physical properties and contaminant runoff. New Zealand Journal of \nAgricultural Research 41, 279-290. \nOliver, D. M., Heathwaite, A. L., Haygarth, P. M., and Clegg, C. D. 2005a. Transfer of \nEscherichia coli to water from drained and undrained grassland after grazing. Journal \nEnvironmental Quality 34, 918-925. \nOliver, D. M., Clegg, C. D., Haygarth, P. M., and Heathwaite, A. L. 2005b. Assessing the \npotential for pathogen transfer from grassland soils to surface waters. Advances in \nAgronomy 85, 125-180. \n  26\nOliver, D. M., Haygarth, P. M., Clegg, C. D., and Heathwaite, A. L. 2006. Differential E. coli die-\noff patterns associated with agricultural matrices. Environmental Science and Technology \n40, 5710-5716. \nOliver, D. M., Clegg, C. D., Heathwaite, A. L. and Haygarth, P. M. 2007. Preferential attachment \nof Escherichia coli to different particle size fractions of an agricultural grassland soil. \nWater Air and Soil Pollution, 185, 369-375. \nPachepsky, Y.A., Sadeghi, A. M., Bradford, S. A., Shelton, D. R., Guber, A. K. and Dao, T. 2006. \nTransport and fate of manure-borne pathogens: Modeling perspective. Agricultural Water \nManagement 86, 81-92  \nPreedy, N., McTiernan, K., Matthews, R., Heathwaite, L., and Haygarth, P. 2001. Rapid \nincidental phosphorus transfers from grassland. Journal of Environmental Quality 30, \n2105-2112. \nQuinton, J. N. and Catt, J. A. 2004. The effects of minimal tillage and contour cultivation on \nsurface runoff, soil loss and crop yield in the long-term Woburn Erosion Reference \nExperiment on sandy soil at Woburn, England. Soil Use and Management 20, 343-349. \nRefsgaard, J. C., van der Sluijs, J. P., Hoberg, A. L., and Vanrolleghem, P. A. 2007. Uncertainty \nin the environmental modelling process – a framework and guidance. Environmental \nModelling and Software 22, 1543-1556. \nRobson, B. J., Hamilton, D. P., Webster, I. T., and Chan, T. 2008. Ten steps applied to \ndevelopment and evaluation of process-based biogeochemical models of estuaries. \nEnvironmental Modelling and Software, 23, 369-384. \nScholefield, D., Jewkes, E and Bol, R. 2007. Nutrient cycling budgets in managed pastures. Soil \nBiology 10 215-255. \nScholten, H., Kassahun, A., Refsgaard, J. C., Kargas, T., Gavardinas, C. and Beulens, A. J. M. \n2007. A methodology to support multidisciplinary model-based water management. \nEnvironmental Modelling and Software 22, 743-759. \nSimsek, Z. and Veiga, I. F. 2000. The electronic survey technique: an integration and assessment. \nOrganisational Research Methods 3, 93-115. \n  27\nSinclair, A., Hebb, D., Jamieson, R., Gordon, R., Benedict, K., Fuller, K., Stratton, G. W, and \nMadani, A. 2009. Growing season surface water loading of fecal indicator organisms \nwithin a rural watershed. Water Research, 43, 1199-1206. \nSinton, L. W., Braithwaite, R. R., Hall, C. H. and Mackenzie, M. L 2007. Survival of indicator \nand pathogenic bacteria in bovine feces on pasture. Applied and Environmental \nMicrobiology 73, 7917-7925 \nStrauss, P., Leone, A., Ripa, M. N., Turpin, N., Lescot, J. M., and Laplana, R. 2007. Using critical \nsource areas for targeting cost-effective best management practices to mitigate \nphosphorus and sediment transfer at the watershed scale. Soil Use and Managment. 23S1 \n144-153. \nUnc, A. and Goss, M. J. 2006. Culturable Escherichia coli in soil mixed with two types of \nmanure. Soil Science Society of America Journal 70, 763-769. \nUSDA-NRCS. 1999. Soil Taxonomy. A basic system of soil classification fro making and \ninterpreting soil surveys. Ag Handbook 436. Washington DC. 869pp. \nU.S. EPA.  2009.  National Summary of Impaired Waters and TMDL Information.  U.S. \nEnvironmental Protection Agency, Washington, D.C.  Available at: \nhttp:\/\/iaspub.epa.gov\/waters10\/attains_nation_cy.control?p_report_type=T.  Accessed \nApril 30, 2009. \nVan Kessel, J. S., Pachepsky, Y. A., Shelton, D. R., and Karns, J. S. 2007. Survival of \nEscherichia coli in cowpats in pasture and in laboratory conditions. Journal of Applied \nMicrobiology 103, 1122-1127. \nVinten, A. J. A., Sym, G., Avdic, K., Crawford, C., Duncan, A. and Merrilees, D. W. 2008. \nFaecal indicator pollution from a dairy farm in Ayreshire, Scotland: source \napportionment, risk assessment and potential of mitigation measures. Water Research 42, \n997-1012. \nVSN International. 2006. Genstat 9.1. 9th Edi. VSN Int., Hemel Hempstead, UK. \nWang, L., Mankin, K. R., and Marchin, G. L. 2004. Survival of faecal bacteria in dairy cow \nmanure. Transactions of the ASAE 47, 1239-1246. \n  28\nWelsh, W. D. 2008. Water balance modelling in Bowen, Queensland, and the ten iterative steps in \nmodel development and evaluation. Environmental Modelling and Software 23, 195-205. \nWhite, S. L., Sheffield, R. E., Washburn, S. P., King, L. D., and Green, J. T. 2001. Spatial and \ntime distribution of dairy cattle excreta in an intensive pasture system. Journal of \nEnvironmental Quality 30, 2180-2187. \nWilkinson, J., Kay, D., Wyer, M. and Jenkins, A. 2006. Processes driving the episodic flux of \nfaecal indicator organisms in streams impacting on recreational and shellfish harvesting \nwaters. Water Research 40, 153-161. \nFigure captions \n \nFig 1: Boundary maps of Fields 1 and 2 showing 10 m contours, elevation and immediate \nsurrounding farmland. The white solid line represents the stream, with the solid white triangle \nindicating stream flow direction. The solid white circles identify stream monitoring locations \n(circle with superscript 2 denotes upstream monitoring site on Farm B). (© Crown Copyright \/ \ndatabase right 2007. An Ordnance Survey \/ EDINA supplied service). \n \nFig 2: ‘Spring’ time-series representation of faecal indicator organism (FC and IE) flux \nmeasurements and daily rainfall on Farm A and B (Chart A and B, respectively). \n \nFig 3: Preliminary uncertainty analysis of FIORIT risk indices for Fields 1 and 2 throughout all \nseasons of investigation where the boxes show the 25th, 50th and 75th percentiles and the whiskers \nthe 5th and 95th percentiles \n  \nFig 4: A) Relationship between FIORIT risk indices of contributing fields and calculated seasonal \naverage faecal coliform and intestinal enterococci flux at farm sampling sites B) Relationship \nbetween FIORIT risk indices of contributing fields modified using rainfall-likelihood coefficient \n(RLC) and calculated seasonal average faecal coliform and intestinal enterococci flux at farm \nsampling sites. Error bars represent 1standard error of logarithmic mean. CFU, colony forming \nunit. \n \nFig 5: Frequency distribution of FIORIT risk indices for 162 grassland fields across 10 \nrepresentative farms. Black profile depicts original FIORIT indices; gray profile [V2] (and \nassociated % in parentheses) depicts FIORIT output corrected using a rainfall-likelihood \ncoefficient. \n \n \n \n \n \n \n  29\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 1: Oliver et al. A risk indexing framework to evaluate the relative risk of fields contributing \nfaecal bacteria to water \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n¯\n0 160 320 480 64080\nMeters\nfield18\nValue\nHigh : 53.205\nLow : 21.209¯\n0 120 240 360 48060\nMeters\nExtract_high1\nValue\nHigh : 153.599\nLow : 117.104\nElevation (m) Elevation (m)\nField 1 Field 2\n2\n  30\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2:  \n \nOliver et al. A risk indexing framework to evaluate the relative risk of fields contributing faecal \nbacteria to water\n \n \n \n3\n4\n5\n6\n7\n8\n9\n24\n\/3\n\/2\n00\n6\n3\/\n4\/\n20\n06\n13\n\/4\n\/2\n00\n6\n23\n\/4\n\/2\n00\n6\n3\/\n5\/\n20\n06\n13\n\/5\n\/2\n00\n6\n23\n\/5\n\/2\n00\n6\n2\/\n6\/\n20\n06\nSampling date\nFI\nO\n \nflu\nx\n \n(lo\ng\n10\n \nCF\nU\n \nL\n-\n1  \ns-\n1 )\n0\n10\n20\n30\n40\n50\n60\n70\nD\naily\n rainfall\n (m\nm)\nFecal coliform Intestinal enterococci Daily rainfall\nA\n3\n4\n5\n6\n7\n8\n9\n24\n\/3\n\/2\n00\n6\n3\/\n4\/\n20\n06\n13\n\/4\n\/2\n00\n6\n23\n\/4\n\/2\n00\n6\n3\/\n5\/\n20\n06\n13\n\/5\n\/2\n00\n6\n23\n\/5\n\/2\n00\n6\n2\/\n6\/\n20\n06\nSampling date\nFI\nO \nflu\nx\n \n(lo\ng\n10\n \nCF\nU\n \nL\n-\n1  \ns\n-\n1 )\n0\n10\n20\n30\n40\n50\n60\n70\nD\naily\n rainfall\n (m\nm)\nFaecal coliform Intestinal enterococci Daily rainfall\nB\n  31\n \n \n \n \n \nFigure 3:  \nOliver et al. A risk indexing framework to evaluate the relative risk of fields contributing faecal \nbacteria to water\n \n  32\n \n \n \nFigure 4:  \n \nOliver et al. A risk indexing framework to evaluate the relative risk of fields contributing faecal \nbacteria to water\n \nA \nB \n  33\n \n1 \n  34\n \n1 \n \n2 \n \n3 \n \n4 \n \n5 \n \n6 \n \n7 \n \n8 \n \n9 \n \n10 \n \n11 \n \n12 \n \n13 \n \n14 \n \n15 \n \n16 \n \n17 \n  35\n \n1 \n \n2 \n \n3 \n \n4 \n \n5 \n \n6 \n \n7 \n \n8 \n"}