{"doi":"10.1016\/S0305-4403(03)00055-4","coreId":"135368","oai":"oai:bradscholars.brad.ac.uk:10454\/4158","identifiers":["oai:bradscholars.brad.ac.uk:10454\/4158","10.1016\/S0305-4403(03)00055-4"],"title":"Dental Microwear in Grazing and Browsing Gotland Sheep (Ovis Aries) and its Implications for Dietary Reconstruction","authors":["Mainland, Ingrid L."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2003","abstract":"NoMicrowear patterns and formation processes are examined in modern browsing and grazing Gotland sheep from Denmark. Clear differences in microwear patterning are identified between Gotland sheep, which included a high proportion of leaves, bark and twigs of deciduous trees and shrubs in their diet, and those which primarily had access to graze species, with the browsing group exhibiting enamel surfaces dominated by pitted microwear features, the grazers a predominance of striations. Analysis of abrasives in dung suggests that these trends can be attributed to higher levels of soil ingestion in the grazing population and are a consequence both of grassland management practices and height of feeding within the vegetation canopy. These findings question previous interpretations of microwear patterning in browsing and grazing ungulates, which have equated striated enamel features with the ingestion of high levels of opal phytoliths, and thus have significant implications for palaeodietary reconstruction in such species, both within archaeological and palaeontological contexts. To address further the implications of these results, comparison is made between the Gotland sheep and modern grazing and fodder-fed sheep and goats from elsewhere in Europe. It is concluded that dental microwear analysis has the potential to address questions relating to grassland management practices and the use of certain fodders, such as leafy-hay, but that it may ultimately prove more difficult to distinguish `fresh¿ browsing sheep from some grazing populations, specifically those in which levels of soil ingestion are reduced","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/4158<\/identifier><datestamp>\n                2016-08-18T17:06:52Z<\/datestamp><setSpec>\n                com_10454_152<\/setSpec><setSpec>\n                col_10454_6342<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nDental Microwear in Grazing and Browsing Gotland Sheep (Ovis Aries) and its Implications for Dietary Reconstruction<\/dc:title><dc:creator>\nMainland, Ingrid L.<\/dc:creator><dc:subject>\nDental Microwear<\/dc:subject><dc:subject>\nSheep<\/dc:subject><dc:subject>\nDiet<\/dc:subject><dc:subject>\nBrowsing<\/dc:subject><dc:subject>\nGrazing<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nMicrowear patterns and formation processes are examined in modern browsing and grazing Gotland sheep from Denmark. Clear differences in microwear patterning are identified between Gotland sheep, which included a high proportion of leaves, bark and twigs of deciduous trees and shrubs in their diet, and those which primarily had access to graze species, with the browsing group exhibiting enamel surfaces dominated by pitted microwear features, the grazers a predominance of striations. Analysis of abrasives in dung suggests that these trends can be attributed to higher levels of soil ingestion in the grazing population and are a consequence both of grassland management practices and height of feeding within the vegetation canopy. These findings question previous interpretations of microwear patterning in browsing and grazing ungulates, which have equated striated enamel features with the ingestion of high levels of opal phytoliths, and thus have significant implications for palaeodietary reconstruction in such species, both within archaeological and palaeontological contexts. To address further the implications of these results, comparison is made between the Gotland sheep and modern grazing and fodder-fed sheep and goats from elsewhere in Europe. It is concluded that dental microwear analysis has the potential to address questions relating to grassland management practices and the use of certain fodders, such as leafy-hay, but that it may ultimately prove more difficult to distinguish `fresh¿ browsing sheep from some grazing populations, specifically those in which levels of soil ingestion are reduced.<\/dc:description><dc:date>\n2009-12-18T07:42:54Z<\/dc:date><dc:date>\n2009-12-18T07:42:54Z<\/dc:date><dc:date>\n2003<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nMainland, I.L. (2003). Dental Microwear in Grazing and Browsing Gotland Sheep (Ovis Aries) and its Implications for Dietary Reconstruction. Journal of Archaeological Science. Vol. 30, No. 11, pp. 1513-1527.<\/dc:identifier><dc:identifier>\n90004865<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/4158<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1016\/S0305-4403(03)00055-4<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1016\/S0305-4403(03)00055-4"],"year":2003,"topics":["Dental Microwear","Sheep","Diet","Browsing","Grazing"],"subject":["Article","No full-text available in the repository"],"fullText":null}