{"doi":"10.1021\/es903258v","coreId":"57585","oai":"oai:nora.nerc.ac.uk:9833","identifiers":["oai:nora.nerc.ac.uk:9833","10.1021\/es903258v"],"title":"Comparison of batch mode and dynamic physiologically based bioaccessibility tests for PAHs in soil samples","authors":["Cave, Mark R.","Wragg, Joanna","Harrison, Ian","Vane, Christopher H.","Van de Wiele, Tom","De Groeve, Eva","Nathanail, C. Paul","Ashmore, Matthew","Thomas, Russell","Robinson, Jamie","Daly, Paddy"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"A fed state in vitro methodology capable of use in commercial testing laboratories has been developed for measuring the human ingestion bioaccessibility of polyaromatic hydrocarbons (PAHs) in soil (Fed ORganic Estimation human Simulation Test- FOREhST). The protocol for measuring PAHs in the simulated gastro-intestinal fluids used methanolic KOH saponification followed by a combination of polymeric sorbent solid phase extraction and silica sorbent cartridges for sample cleanup and preconcentration. The analysis was carried out using high pressure liquid chromatography with fluorescence detection. The repeatability of the method, assessed by the measurement of the bioaccessibility of 6 PAHs (benz[a]anthracene, benzo[b]fluoranthene, benzo[k]fluoranthene, benzo[a]pyrene, dibenz[ah]anthracene, and indeno[1,2,3-c,d]pyrene) in eleven gas works soils, was 10% RSD. The method compared well with the results from an independent dynamic human simulation reactor comprising of the stomach, duodenal and colon compartments tested on the same soils. The measured bioaccessible fraction of the soils varied from 10−60% for soils containing 10−300 mg kg−1 PAH (the sum of the six studied) with total organic carbon concentrations in the soils ranging from 1−13%. A multiple regression model showed that the PAH bioaccessible fraction could be explained using the PAH compound, the soil type and the total PAH to soil organic carbon content. The method described here has potential for site specific detailed quantitative risk assessment either to modify the risk estimation or to contribute to the risk evaluation","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57585.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9833\/1\/EST_V9.pdf","pdfHashValue":"eb02a7492af96c755be4744246d4ad2dc38f5b9b","publisher":"ACS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9833<\/identifier><datestamp>\n      2012-11-22T12:09:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9833\/<\/dc:relation><dc:title>\n        Comparison of batch mode and dynamic physiologically based bioaccessibility tests for PAHs in soil samples<\/dc:title><dc:creator>\n        Cave, Mark R.<\/dc:creator><dc:creator>\n        Wragg, Joanna<\/dc:creator><dc:creator>\n        Harrison, Ian<\/dc:creator><dc:creator>\n        Vane, Christopher H.<\/dc:creator><dc:creator>\n        Van de Wiele, Tom<\/dc:creator><dc:creator>\n        De Groeve, Eva<\/dc:creator><dc:creator>\n        Nathanail, C. Paul<\/dc:creator><dc:creator>\n        Ashmore, Matthew<\/dc:creator><dc:creator>\n        Thomas, Russell<\/dc:creator><dc:creator>\n        Robinson, Jamie<\/dc:creator><dc:creator>\n        Daly, Paddy<\/dc:creator><dc:description>\n        A fed state in vitro methodology capable of use in commercial testing laboratories has been developed for measuring the human ingestion bioaccessibility of polyaromatic hydrocarbons (PAHs) in soil (Fed ORganic Estimation human Simulation Test- FOREhST). The protocol for measuring PAHs in the simulated gastro-intestinal fluids used methanolic KOH saponification followed by a combination of polymeric sorbent solid phase extraction and silica sorbent cartridges for sample cleanup and preconcentration. The analysis was carried out using high pressure liquid chromatography with fluorescence detection. The repeatability of the method, assessed by the measurement of the bioaccessibility of 6 PAHs (benz[a]anthracene, benzo[b]fluoranthene, benzo[k]fluoranthene, benzo[a]pyrene, dibenz[ah]anthracene, and indeno[1,2,3-c,d]pyrene) in eleven gas works soils, was 10% RSD. The method compared well with the results from an independent dynamic human simulation reactor comprising of the stomach, duodenal and colon compartments tested on the same soils. The measured bioaccessible fraction of the soils varied from 10−60% for soils containing 10−300 mg kg−1 PAH (the sum of the six studied) with total organic carbon concentrations in the soils ranging from 1−13%. A multiple regression model showed that the PAH bioaccessible fraction could be explained using the PAH compound, the soil type and the total PAH to soil organic carbon content. The method described here has potential for site specific detailed quantitative risk assessment either to modify the risk estimation or to contribute to the risk evaluation.<\/dc:description><dc:publisher>\n        ACS<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9833\/1\/EST_V9.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9833\/2\/Supporting_information_V8.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Cave, Mark R.; Wragg, Joanna; Harrison, Ian; Vane, Christopher H.; Van de Wiele, Tom; De Groeve, Eva; Nathanail, C. Paul; Ashmore, Matthew; Thomas, Russell; Robinson, Jamie; Daly, Paddy.  2010  Comparison of batch mode and dynamic physiologically based bioaccessibility tests for PAHs in soil samples.   Environmental Science and Technology, 44 (7). 2654-2660.  https:\/\/doi.org\/10.1021\/es903258v <https:\/\/doi.org\/10.1021\/es903258v>     \n <\/dc:identifier><dc:relation>\n        http:\/\/pubs.acs.org\/toc\/esthag\/44\/7<\/dc:relation><dc:relation>\n        10.1021\/es903258v<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9833\/","http:\/\/pubs.acs.org\/toc\/esthag\/44\/7","10.1021\/es903258v"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"S1 \n \nSupporting information 1 \nA comparison of batch mode and dynamic physiologically based 2 \nbioaccessibility tests for PAHs in soil samples  3 \nMark R Cave*, Joanna Wragg, Ian Harrison, Christopher H Vane  4 \nBritish Geological Survey, Keyworth, Nottingham, NG12 5GG, UK 5 \nTom Van de Wiele, Eva De Groeve  6 \nLabMet, University of Ghent, Coupure Links 653, 9000 Ghent, Belgium 7 \nC.Paul Nathanail, Matthew Ashmore  8 \nUniversity of Nottingham, School of Geography, Sir Clive Granger Building, The University of 9 \nNottingham, University Park, Nottingham, NG7 2RD, UK 10 \nRussell Thomas, Jamie Robinson  11 \nParsons Brinckerhoff Queen Victoria House, Redland Hill, Bristol,  BS6 6US, UK 12 \nPaddy Daly  13 \nNational Grid Property, Warwick Technology Park, Warwick, CV34 6DA, UK 14 \nNumber of pages 12 15 \nNumber of Figures 1 16 \nNumber of Tables 2 17 \nS2 \n \nSoil Analysis 1 \nTotal Organic Carbon (TOC) 2 \nThe TOC content of the soils was determined using an Elementar VarioMax C\/N analyser. 3 \nSamples were dried to constant weight at 40⁰C and treated with excess acid (HCl, 50% v\/v) 4 \nuntil all effervescing stopped and oven dried at 105-110°C (at least 1.5 hours).  The TOC was 5 \nthen determined by high temperature combustion with subsequent analysis of evolved CO2.   6 \nTotal PAH Content 7 \nThe prepared soils were analysed to determine the concentrations of the six PAHs using an 8 \nextraction process routinely employed for sediments [1-5].  Thus, for each soil, a known 9 \nweight (ca. 0.2 g) was placed in a 125 ml amber glass bottle (with a polytetrafluoroethylene 10 \n(PTFE)-lined screw cap) and 100 ml of 1:1 acetonitrile\/tetrahydrofuran (THF) was added.  11 \nThe bottle was capped, heated to 50°C and sonicated in an ultrasonic bath (300W) for 45 12 \nminutes with periodic inversions to continually re-suspend the soil.  After cooling, a sample 13 \nof the supernatant was taken and injected into an HPLC system using an in-line syringe filter 14 \n(0.2 µm nylon Millex 13 mm) to remove particulates.  The quality of the PAH data was 15 \nverified by analysis of a well-characterised proficiency testing material (Laboratory of the 16 \nGovernment Chemist (LGC), Contaminated Land Proficiency Testing Scheme (CONTEST) 17 \nSoil 58.3c) which had comparable PAH concentrations to those in the soils.  All solvents 18 \nused for HPLC and SPE, including water, were of HPLC grade.   19 \nThe HPLC conditions were as follows:  Mobile phase (isocratic):  90% acetonitrile and 10% 20 \nwater;  Flowrate: 1ml min-1; Column configuration:  Hypersil filter 0.2µm, Phenomenex 21 \nSecurity guard C18, Hypersil PAH Guard (10 mm x 4 mm id), Hypersil PAH Analytical (100 22 \nmm x 4.6 mm id); Sample Loop: 5 µl Rheodyne;  Detection: Waters 474 Scanning 23 \nFluorescence Detector – Excitation 296 nm \/ Emission 408 nm  changing at 23.5 minutes to 24 \nExcitation 302 nm \/  Emission 506 nm (for IP detection).  The PAH and TOC data for the 25 \nsoils are presented in Table S1. 26 \n 27 \n 28 \nS3 \n \nTable S1 Soil concentrations of the 6 PAHs of interest and their summed totals (mg kg-1) and 1 \nthe total organic carbon content (%) 2 \n 3 \nSoil BaA BbF BkF BaP DBA IP Total TOC \n  \n1 2.25 2.18 1.45 2.21 0.41 1.43 9.93 1.27 \n2 11.8 15.8 8.75 15.0 2.79 13.3 67.4 8.84 \n3 22.1 30.3 17.2 25.0 4.39 22.3 121.3 8.24 \n4 55.9 66.7 38.0 68.0 11.1 46.8 286.6 6.94 \n5 28.7 29.3 17.4 30.1 4.63 19.1 129.3 3.29 \n6 18.0 23.3 14.3 23.7 3.80 17.7 100.8 11.64 \n7 56.7 70.3 42.7 56.7 9.01 43.1 278.5 7.76 \n8 30.6 50.9 23.5 54.1 7.76 33.7 200.5 12.91 \n9 26.8 52.0 25.4 56.4 8.34 34.1 203.0 3.85 \n10 61.1 44.1 29.4 49.3 6.60 29.9 220.4 4.91 \n11 55.5 52.0 33.7 64.3 8.22 36.0 249.7 5.04 \n 4 \nOperating conditions for the Dynamic bioaccessibility gastro-intestinal simulator 5 \nsystem (SHIME system):   6 \nSince toddlers are the most sensitive target groups, the physiological conditions of the 7 \nLabMET system were adjusted to simulate the conditions of a 6 to 24 months child.  For 8 \nfasted conditions the composition of the gastric solution was selected from Oomen et al. [6], 9 \nexcept that the medium was not acidified.  For the fed conditions nutrition (50.8 g L-1), 10 \nsunflower oil (3.2 ml L-1) and milli Q water (150 mL L-1) were added to the fasted gastric 11 \nmedium.  In both the batch and the dynamic methods, the composition of the nutrition (Hipp 12 \norganic creamy porridge®) was the same and representative for the diet of a small child.  The 13 \ncomposition of the pancreatic and bile fluid was applied as described by Van de Wiele et 14 \nal.[7].  No increase in enzyme and bile concentration was made for fed conditions [8].  The 15 \ntemperature inside the vessels was controlled at 37 °C.  16 \nBecause of the chemical characteristics of BaP (hydrophobic; logKOW = 6), specific 17 \nadaptations in the design of the system were necessary [9]. For this reason all tubings in 18 \ncontact with the BaP containing media (sampling tubes), inert PTFE-tubing was used.  19 \nIncubations according to the SHIME system: The PAH contaminated soils were incubated in 20 \ngastro-intestinal suspensions simulating the stomach and small intestine (and large intestine) 21 \nS4 \n \nfor fasted and fed conditions respectively.  Soil samples were processed in triplicate through 1 \nthe reactor. Also negative and positive (spiked) controls were performed.  2 \nSoil and stomach solutions were brought into the vessel (L\/S = 100 for fasted and 115 for 3 \nfed). Acid (1 M HCl) was gradually added to the suspension over 30 minutes till the pH was 4 \n2.5 for fasted conditions and 3.5 for fed conditions.  The fasted pH was slightly higher than 5 \nthe pH used in the SHIME model for adults [10].  The pH for fed conditions was slightly 6 \nhigher to average the postprandial peak. 7 \nAfter 1 hour imposing the stomach conditions, the intestinal digestion was started: a fixed 8 \nvolume pancreatic and bile fluid was gradually added over one hour which caused a pH rise 9 \nto 7 - 8.  After addition of the pancreatic fluid the suspension was incubated for a further 2 10 \nhours.  11 \nTo simulate in one of the replicates the conditions of the large intestine i.e. the colon 12 \ndescendens, SHIME suspension was added to small intestinal fluid in a ratio 30\/45.  This 13 \nsuspension was anaerobically incubated overnight. 14 \nSubsequently, gastric and intestinal incubation samples were taken and centrifuged at 3000 g 15 \nfor 5 minutes to remove the non-bioaccessible particles.  The supernatants were stored at -20 16 \n°C before analysis by the extraction method described in the Analysis of PAHs in the 17 \nbioaccessibility extracts section. 18 \n 19 \nExtraction and analysis of PAHs from the in-vitro Bioaccessibility Test 20 \nThe extraction vessels used were specially designed for the Fed ORganic Estimation human 21 \nSimulation Test (FOREhST) methodology: these were modified from heavy duty round 22 \nbottomed centrifuge tubes capable of withstanding 3000 g, rubber coated and adapted to 23 \naccept a 20 mm diameter PTFE-faced silicone rubber septa (3.25mm total thickness supplied 24 \nby Wheaton, UK) with a 20 mm unlined centre tear off aluminium seal (supplied by Grace-25 \nDivision, UK). 26 \nPrior to use extraction vessels were cleaned using the following protocol:  Tap-water rinsed 27 \nto remove residual sediment\/solid deposits; aqueous methanolic surfactant solution (10% v\/v 28 \nTeepol-L in 50:50 Methanol\/Pure Water) washed, completely filled with the surfactant 29 \nS5 \n \nsolution and placed in an ultrasonic bath at 50°C for 15 minutes; left overnight containing the 1 \nTeepol solution in order to remove and greasy deposits; rinsed several times with sufficient 2 \nreverse osmosis (RO) water to remove all of the Teepol (surfactant) solution; inverted and 3 \ndrained for at least 15 minutes to remove excess RO water; rinsed 3 times, each with a 10.0 4 \nml aliquot of HPLC grade Acetone to remove any organic contaminants from the glass 5 \nsurface; for removal of acetone, inverted to drain and dry for a minimum of 0.5 days.  6 \nThe extractor used for the purposes of both end-over-end agitation at 30 rpm and incubation 7 \nat 37°C has been previously described by Kelley et al [11].   8 \nA pH electrode specific for biological applications, including proteins and food samples, was 9 \nchosen for use with the FOREhST methodology because of the inclusion of food in the fed 10 \nstate simulation and the increased enzymatic status of the system.  A Thermo-Russell high-11 \nperformance glass bodied K-series thin stemmed electrode (KDCMAW11\/A), 120 mm in 12 \nlength and 4.50 mm in diameter was paired with a Russell RL060P meter for this specific 13 \napplication.  This electrode was chosen because of the polymer gel double junction reference 14 \nsystem, which results in a faster response, better reproducibility and stability in both sample 15 \nand buffer solutions in complex mixtures found in food applications. In addition, the 16 \ndimensions allowed for direct pH measurement of the solution in the extraction vessels 17 \nemployed. 18 \nThe simulated GI extraction fluids used were prepared as described by Wragg et al 2009 [12]. 19 \nIn comparison to the standard fasted state UBM, the FOREhST method is a fed state system 20 \nand eating foods stimulates physiological changes within the GI tract, such as increased 21 \nsecretions of gastric acid, bile and pancreatic fluids, changes in pH and modifications in 22 \ngastric and intestinal motility (Versantvoort et al, 2004).  The composition of the GI fluids, 23 \nsuch as the salival fluid, is influenced by the flow rate of the GI fluid, and for the salival fluid 24 \nproduction is stimulated by chewing. At higher salival flow rates the composition of this fluid 25 \nhas an increased amylase content, but decreased mucin concentration.  For other GI fluids the 26 \nincrease in enzyme concentration ranges by a factor of 2-5 depending on the activity of 27 \nspecific enzyme producing organs.  Pancreatin and lipase concentrations increase as these 28 \njuices are secreted in order to start the digestion of the major food groups (Brunner et al, 29 \n1974) and when fats begin to enter the duodenum, bile secretion is increased by the liver.  All 30 \nof the , additional modifications to the pH and the enzymatic concentrations in the individual 31 \nS6 \n \nextraction fluids, in order to simulate the fed state, were based on the work of Versantvoort et 1 \nal [13].  The pH of all gastro-intestinal fluids were increased compared to those used in the 2 \nBARGE UBM: the ‘Saliva’ pH was increased from 6.5 ± 0.5 to 6.8 ± 0.5; the ‘Gastric’ fluid 3 \nfrom 0.9-1.0 to 1.3 ± 0.5; the ‘Duodenal’ fluid from 7.4 ± 0.2 to 8.1 ± 0.2 and the ‘Bile’ fluid 4 \nfrom 8.0 ± 0.2 to 8.2 ± 0.2.  The pH adjustments were made by increasing the initial addition 5 \nof 1.0M NaOH (2.80 ml) or reducing the amount of 37% HCl (6.5 ml) to the saliva or gastric 6 \nfluids respectively or making minor adjustments to the pH of the prepared duodenal and bile 7 \nsolutions by the drop wise addition of 1.0M NaOH.  The ‘Saliva’ fluid contained double the 8 \namount amylase compared to the UBM methodology, conversely the mucin concentration 9 \nwas reduced by half in the FOREhST (fed state) methodology.  In comparison to the UBM 10 \n‘Gastric’ fluid, the concentration of both mucin and pepsin were increased by a factor of 3 11 \nand 2.5 respectively, requiring the addition of 9000 mg l-1 mucin and 2500 mg l-1 pepsin.  12 \nIncreases were also made to the concentrations of pancreatin and lipase (by a factor of 3) in 13 \nthe ‘Duodenal’ fluid and the bile concentration in the ‘Bile’ fluid (by a factor of 5).   14 \nAll reagents used in the FOREhST extraction were of analytical grade or better.  Each 15 \nindividual extraction fluid (Saliva, Gastric, Duodenal and Bile) was a composite of 500 ml 16 \neach of an ‘inorganic’ and an ‘organic’ fluid, which were then combined with additional 17 \nconstituents (enzymes etc) in 1000 ml glass Duran® bottles with polypropylene lids with 18 \n(PTFE) liners to form the final extraction solutions. All extraction fluids were prepared the 19 \nday prior to soil extraction, to ensure that all of the additional constituents had dissolved, and 20 \nstored at <8°C overnight.  Prior to undertaking the FOREhST extraction, the pH of each 21 \nextraction solution was adjusted with drop wise addition of 1.0M NaOH or 37% HCl to 22 \nensure that it was within the required tolerance (see above).  Additionally, the pH of the 23 \n‘Saliva & Gastric’ fluids (1.6±0.2) and the ‘Saliva & Gastric & Duodenal & Bile’ (6.0±0.2) 24 \nfluids at the ratio of 1:2 and 1:2:2:1 respectively were checked before carrying out the 25 \nextraction.  If the pH criteria of the mixed extraction fluids were not met, then the individual 26 \npH of one or more extraction fluids were adjusted (whilst remaining within the required 27 \ntolerances) to meet the necessary requirements. 28 \nThe test samples were extracted in batches of five unknown samples with one extraction 29 \nblank.  Each sample, including sample blanks, was extracted in triplicate, with the extraction 30 \ncarried out on separate days in order to estimate the repeatability of the extraction phase.  As 31 \nS7 \n \nthere are no reference materials currently available for the bioaccessibility of PAHs, no 1 \nreference materials were extracted in the current work.  2 \nFor the FOREhST method 0.3g of each prepared soil and 0.813g of HIPP organic creamy 3 \nporridge were accurately weighed into an extraction vessel (as described above).  2.45 ml of 4 \nde-ionised water, 50 µl of sunflower oil and 4.50 ml of ‘Saliva’ fluid were added via pipette.  5 \nThe samples were then capped with PTFE-faced silicone rubber septa in an aluminium seal 6 \nand rotated in a water bath at 37°C at 30 rpm for 5 minutes to ensure that the soil, food 7 \nconstituents and simulated fluid had thoroughly mixed.  On removal from the extractor, 9.00 8 \nml of ‘Gastric’ fluid was added, the extraction vessels re-capped and replaced in the extractor 9 \nand incubated for a further 2 hours to represent simulation of the ‘stomach’ phase.  After the 10 \n2 hour stomach phase extraction, the extraction vessels were removed from the extractor and 11 \nthe pH of each individual suspension measured.  The mean stomach pH, measured across all 12 \nextracted soils in triplicate was 4.15 ± 1.08 (1 sd) and 3.93 ± 1.14 including the measurement 13 \nof the extraction blanks.  By pipette, 9.00 ml of ‘Duodenal’ fluid and 4.50 ml of ‘Bile’ fluid 14 \nwere added to each extraction vessel and the pH of each suspension measured.  The mean 15 \nintestinal phase pH, measured across all soil samples in triplicate was 6.20 ± 0.59 and 6.16 ± 16 \n0.55 when the blanks measurements were included.  After re-capping each vessel was further 17 \nincubated for 2 hours, followed by rechecking of the ‘intestinal’ phase pH.  The final average 18 \n‘intestinal’ phase pH was 6.24 ± 0.46 and 6.23 ± 0.43 on the inclusion of the blank 19 \nmeasurements. The soil samples were then separated from the chime by centrifugation at 20 \n3000 g for 5 minutes. 21 \nAnalysis of PAHs in the bioaccessibility extracts 22 \nFollowing FOREhST extraction, the PAHs leached from the soils were contained in a matrix 23 \nthat included food constituents (e.g. lipids, proteins, carbohydrates etc.), natural organic 24 \nmatter (e.g. humic acids, humin etc.) colloidal soil particles (e.g. clays).  In order to release 25 \nthe PAHs from the various components of the FOREhST matrix saponification was 26 \nemployed, this process being generally regarded as a rigorous means of extracting PAHs into 27 \nsolution from otherwise intractable matrices e.g. Soils -[14-17] : Biota - [18]: Sewage sludges 28 \n– [19]: Food substances – [20, 21]. For each soil, after the FOREhST extract had been 29 \ncentrifuged (5 minutes at 3000 g) a 1 ml sample of the supernatant was transferred into a 30 \nHach chemical oxygen demand (COD) vial by means of a glass pipette. The pipette was 31 \nS8 \n \nrinsed into the tube with 1 ml methanol to ensure complete transfer of the PAHs. Then 3 ml 1 \nof saturated potassium hydroxide in methanol (ca. 5.6 M KOH –analytical reagent grade) 2 \nwere added and the screw cap tightened firmly onto the vial before placing in an oven at 3 \n100°C for one hour.  The resulting alkaline amber fluid was processed by SPE after cooling.  4 \nIt was found that once the methanolic KOH had been added the PAHs in the FOREhST 5 \nextracts remained stable (for about a week), whereas, if left in the FOREhST matrix or in 6 \ntheir final state after SPE, i.e. as an acetonitrile solution they were not stable even for 7 \nrelatively short periods; BaP appeared to be particularly susceptible to losses.   8 \n 9 \nFigure S1 Experimental set up for i) the for separation and preconcentration of 10 \nthe PAH from the saponified extract; ii) for elution of the separated and 11 \npreconcentrated PAHs 12 \nTo the 4 ml of cooled methanolic saponified FOREhST extract, water was added to give 10 13 \nml of diluted extract.  The diluted extract (ca. 40% aqueous methanol) was transferred to a 10 14 \nml glass syringe barrel inserted into a conditioned polymeric sorbent SPE cartridge (Waters 15 \nOASIS HLB Plus Sep-Pak®) and the Hach COD vial rinsed in with 1 ml 40% aqueous 16 \nS9 \n \nmethanol (Figure S1 i).  The cartridge had been conditioned immediately prior to use by the 1 \nconsecutive passage of 5 ml dichloromethane (DCM), 5 ml methanol and 2 x 5ml water. By 2 \nmeans of vacuum, the diluted extract was drawn through the cartridge at 1-2 ml min-1.  Once 3 \nthrough, the cartridge was washed with 5 x 2 ml of pure water and then allowed to dry by 4 \ndrawing air through for 10 minutes under maximum vacuum.   The dried cartridge was 5 \nconnected to a silica sorbent cartridge (Waters Plus Silica Sep-Pak®) such that the flow 6 \nthrough the polymeric cartridge was reversed compared with sample loading, i.e. it was 7 \nbackflushed by the eluting solvent into the silica cartridge [16]. After initiating flow with a 8 \nslight positive pressure the eluting solvent (1:1 DCM\/THF) was allowed to flow through the 9 \ncoupled cartridges under gravity and the eluate was collected in a 15 ml amber vial (Figure 10 \nS1 ii).  Following the collection of 6 ml of eluate the contents of the vial were blown-down 11 \nunder a gentle stream of nitrogen to dryness.  The residue was taken up in a known volume of 12 \nacetonitrile.  The volume employed, chosen to ensure on-scale chromatographic peaks, was 13 \nbased on the concentrations of PAHs in the soils previously determined by HPLC.  Thus, 14 \nsuitable volumes of acetonitrile were found to be 1 ml for soil 1, 2 ml for soils 2, 3, 5, 6 and 5 15 \nml for soils 4, 7, 8, 9, 10 and 11.  The same isocratic method was utilised for the analysis of 16 \nthe acetonitrile solutions of the FOREhST extracts.  The acetonitrile solutions were analysed 17 \nusing the same HPLC method as used for the soils. The method is equally applicable for use 18 \nwhen subsequent analysis by GC\/MS, rather than HPLC, is to be undertaken.  The residue 19 \nresulting from the nitrogen blow-down step merely needs to be dissolved in a GC\/MS 20 \ncompatible solvent (e.g. hexane) instead of acetonitrile.    21 \nComparison of the SHIME and FOREhST bioaccessibility results 22 \nTable S2 gives the BAF of the total PAH in the soil for each soil and each PAH as measured 23 \nby the FOREhST and SHIME methods.   24 \nS10 \n \nTable S2 Average values (n=3) for the bioavailable fraction of the totalPAHs as measured by the two 1 \nmethods. 2 \n   FOREhST SHIME \nSoil no PAH name MW BAF (%) RSD (%) BAF (%) RSD (%) \n       \n1 Benz(a)-anthracene 228 39.0 6.2 25.3 15.9 \n1 Benzo(b)-fluoranthene 252 32.2 8.5 19.9 9.2 \n1 Benzo(k)-fluoranthene 252 23.1 5.7 14.6 12.1 \n1 Benzo(a)-pyrene 252 33.1 5.9 18.2 21.8 \n1 Dibenz(ah)-anthracene 278 17.3 16.0 12.8 12.1 \n1 Indeno(123cd)-pyrene 276 35.6 15.5 18.6 8.9 \n2 Benz(a)-anthracene 228 39.2 4.0 53.0 3.6 \n2 Benzo(b)-fluoranthene 252 41.5 4.8 49.5 3.3 \n2 Benzo(k)-fluoranthene 252 30.2 1.9 34.7 1.9 \n2 Benzo(a)-pyrene 252 46.8 0.8 51.6 1.9 \n2 Dibenz(ah)-anthracene 278 26.3 2.1 30.6 0.2 \n2 Indeno(123cd)-pyrene 276 53.3 3.6 58.7 2.8 \n3 Benz(a)-anthracene 228 30.6 9.8 44.2 14.1 \n3 Benzo(b)-fluoranthene 252 33.9 11.3 41.5 11.8 \n3 Benzo(k)-fluoranthene 252 22.8 5.4 27.7 12.5 \n3 Benzo(a)-pyrene 252 34.5 7.0 39.9 11.1 \n3 Dibenz(ah)-anthracene 278 22.3 8.8 24.4 12.5 \n3 Indeno(123cd)-pyrene 276 41.2 5.4 45.5 11.5 \n4 Benz(a)-anthracene 228 41.2 4.9 35.1 13.6 \n4 Benzo(b)-fluoranthene 252 33.9 7.4 28.1 15.9 \n4 Benzo(k)-fluoranthene 252 26.2 5.5 20.9 17.8 \n4 Benzo(a)-pyrene 252 35.6 8.8 25.5 13.4 \n4 Dibenz(ah)-anthracene 278 21.4 2.4 20.4 12.5 \n4 Indeno(123cd)-pyrene 276 37.9 4.4 29.5 11.9 \n5 Benz(a)-anthracene 228 53.4 8.7 44.7 2.4 \n5 Benzo(b)-fluoranthene 252 43.0 4.3 33.6 4.9 \n5 Benzo(k)-fluoranthene 252 30.3 4.6 26.5 4.4 \n5 Benzo(a)-pyrene 252 36.2 5.2 32.3 3.9 \n5 Dibenz(ah)-anthracene 278 19.8 7.3 20.0 3.7 \n5 Indeno(123cd)-pyrene 276 42.6 3.4 36.0 6.6 \n6 Benz(a)-anthracene 228 55.6 6.5 43.0 15.9 \n6 Benzo(b)-fluoranthene 252 46.5 3.5 38.3 14.7 \n6 Benzo(k)-fluoranthene 252 34.3 5.4 27.8 15.9 \n6 Benzo(a)-pyrene 252 42.2 5.9 31.1 17.5 \n6 Dibenz(ah)-anthracene 278 28.3 9.1 23.6 13.8 \n6 Indeno(123cd)-pyrene 276 52.0 6.0 42.7 14.5 \n7 Benz(a)-anthracene 228 38.8 2.3 37.1 5.4 \n7 Benzo(b)-fluoranthene 252 34.7 2.2 33.5 4.4 \n7 Benzo(k)-fluoranthene 252 26.7 2.1 25.4 4.7 \n7 Benzo(a)-pyrene 252 20.7 3.5 17.8 7.1 \n7 Dibenz(ah)-anthracene 278 16.5 7.5 17.3 6.4 \n7 Indeno(123cd)-pyrene 276 33.4 1.3 30.3 7.9 \n8 Benz(a)-anthracene 228 32.8 9.8 35.5 11.6 \n8 Benzo(b)-fluoranthene 252 30.0 18.7 28.7 16.8 \n8 Benzo(k)-fluoranthene 252 19.1 9.5 20.1 12.7 \n8 Benzo(a)-pyrene 252 25.6 8.2 24.8 13.0 \n8 Dibenz(ah)-anthracene 278 12.1 12.5 14.5 11.4 \n8 Indeno(123cd)-pyrene 276 29.6 7.1 27.8 11.5 \n9 Benz(a)-anthracene 228 32.2 28.5 27.5 4.7 \n9 Benzo(b)-fluoranthene 252 30.9 28.2 22.3 5.3 \n9 Benzo(k)-fluoranthene 252 21.2 28.6 16.9 6.0 \n9 Benzo(a)-pyrene 252 25.6 31.3 19.1 3.0 \n9 Dibenz(ah)-anthracene 278 13.1 32.7 13.1 14.6 \n9 Indeno(123cd)-pyrene 276 31.3 31.3 24.0 6.3 \n10 Benz(a)-anthracene 228 60.9 13.3 53.7 26.3 \n10 Benzo(b)-fluoranthene 252 54.5 16.8 45.5 24.1 \n10 Benzo(k)-fluoranthene 252 37.4 10.7 32.4 25.3 \n10 Benzo(a)-pyrene 252 46.1 12.2 38.8 23.9 \n10 Dibenz(ah)-anthracene 278 29.2 10.2 25.5 19.4 \n10 Indeno(123cd)-pyrene 276 55.2 9.7 48.9 23.9 \n11 Benz(a)-anthracene 228 60.4 10.3 33.4 7.0 \n11 Benzo(b)-fluoranthene 252 53.1 13.8 29.4 5.4 \n11 Benzo(k)-fluoranthene 252 38.3 14.5 21.3 7.8 \n11 Benzo(a)-pyrene 252 50.4 15.9 27.0 6.8 \n11 Dibenz(ah)-anthracene 278 29.9 20.9 17.5 7.0 \n11 Indeno(123cd)-pyrene 276 59.3 16.8 32.9 5.5 \nS11 \n \nReferences 1 \n1. Vane, C. H.; Harrison, I.; Kim, A. W., Assessment of polycyclic aromatic hydrocarbons 2 \n(PAHs) and polychlorinated biphenyls (PCBs) in surface sediments of the Inner Clyde Estuary, UK 3 \nMarine Pollution Bulletin 2007, 54, 1301-1306. 4 \n2. Vane, C. H.; Harrison, I.; Kim, A. W., Polycyclic aromatic hydrocarbons (PAHs) and 5 \npolychlorinated biphenyls (PCBs) in sediments from the Mersey Estuary, U.K. . Sci. Total Environ. 6 \n2007, 374, 112-126. 7 \n3. Vane, C. H.; Harrison, I.; Kim, A. W., Assessment of polyaromatic hydrocarbons (PAHs) and 8 \npolychlorinated biphenyls (PCBs) in surface sediments of the Inner Clyde Estuary, UK. Marine 9 \nPollution Bulletin 2007, 54, (8), 1301-1306. 10 \n4. Vane, C. H.; Harrison, I.; Kim, A. W.; Moss-Hayes, V.; Vickers, B. P.; Hong, K., Organic 11 \nand metal contamination in surface mangrove sediments of South China. Marine Pollution Bulletin 12 \n2009, 58, 134-144. 13 \n5. Vane, C. H.; Harrison, I.; Kim, A. W.; Moss-Hayes, V.; Vickers, B. P.; Horton, B. P., Status 14 \nof organic pollutants in surface sediments of Barnegat Bay-Little Egg Harbor Estuary, New Jersey, 15 \nUSA. Marine Pollution Bulletin 2008, 56, (10), 1802-1808. 16 \n6. Oomen, A. G.; Rompelberg, C. J. M.; Bruil, M. A.; Dobbe, C. J. G.; Pereboom, D.; Sips, A., 17 \nDevelopment of an in vitro digestion model for estimating the bioaccessibility of soil contaminants. 18 \nArchives Of Environmental Contamination And Toxicology 2003, 44, (3), 281-287. 19 \n7. Van de Wiele, T.; Verstraete, W.; S.D., S., Polyaromatic hydrocarbon release from a soil 20 \nmatrix in the human gastrointestinal tract. Journal of Environmental Quality 2004, 33, 1343-1353. 21 \n8. Van de Wiele, T.; Boon, N.; Possemiers, S.; Jacobs, H.; Verstraete, W., Inulin-type fructans 22 \nof longer degree of polymerization exert more pronounced in vitro prebiotic effects. Journal of 23 \nApplied Microbiology 2007, 102, (2), 452-460. 24 \n9. Miller, C. A., A human aryl hydrocarbon receptor signaling pathway constructed in yeast 25 \ndisplays additive responses to ligand mixtures. . Toxicol. Appl. Pharmacol. 1999, 160, 297-303. 26 \n10. Van de Wiele, T.; Vanhaecke, L.; Boeckaert, C.; Peru, K.; Headley, J.; Verstraete, W.; 27 \nSiciliano, S., Human colon microbiota transform polycyclic aromatic hydrocarbons to estrogenic 28 \nmetabolites. Environmental Health Perspectives 2005, 113, (1), 6-10. 29 \n11. Kelley, M. E.; Brauning, S. E.; Schoof, R.; Ruby, M. V., Assessing Oral Bioavailability of 30 \nMetals in Soil. Battelle Press: Columbus Richland, 2002. 31 \n12. Wragg, J.; Cave, M. R.; Taylor, H.; Basta, N.; Brandon, E.; Casteel, S.; Gron, C.; Oomen, A.; 32 \nVan de Wiele, T. Inter-laboratory Trial of a Unified Bioaccessibility Procedure; OR\/07\/027; British 33 \nGeological Survey: 2009. 34 \n13. Versantvoort, C. H. M.; van de Kamp, E.; Rompelberg, C. J. M. Development and 35 \napplicability of an in vitro digestion model in assessing the bioaccessibility of contaminants from 36 \nfood; 3201020022004; RIVM: 2004. 37 \n14. Eschenbach, A.; Kastner, M.; Bierl, R.; Schaefer, G.; Mahro, B., Evaluation of a new, 38 \neffective method to extract polycyclic aromatic-hydrocarbons from soil samples. Chemosphere 1994, 39 \n28, (4), 683-692. 40 \n15. Hartman, R., Polycyclic aromatic hydrocarbons (PAHs) in forest soils: Critical evaluation of a 41 \nnew analytical procedure. International Journal of Environmental Analytical Chemistry 1996, 62, (2), 42 \n161-173. 43 \n16. Itoh, N.; Numata, M.; Yarita, T., Alkaline extraction in combination with microwave-assisted 44 \nextraction followed by solid-phase extraction treatment for polycyclic aromatic hydrocarbons in a 45 \nsediment sample. Analytica Chimica Acta 2008, 615, (1), 47-53. 46 \n17. Northcott, G. L.; Jones, K. C., Partitioning, extractability, and formation of nonextractable 47 \nPAH residues in soil. 1. Compound differences in aging and sequestration. Environmental Science & 48 \nTechnology 2001, 35, (6), 1103-1110. 49 \n18. Kelly, C. A.; Law, R. J.; Emerson, Methods for analysis for hydrocarbons and polycyclic 50 \naromatic hydrocarbons (PAH) in marine samples. . 2000; p 18pp. 51 \n19. Pena, M. T.; Pensado, L.; Casais, M. C.; Mejuto, M. C.; Cela, R., Sample preparation of 52 \nsewage sludge and soil samples for the determination of polycyclic aromatic hydrocarbons based on 53 \nS12 \n \none-pot microwave-assisted saponification and extraction. Analytical and Bioanalytical Chemistry 1 \n2007, 387, (7), 2559-2567. 2 \n20. Kishikawa, N.; Wada, M.; Kuroda, N.; Akiyama, S.; Nakashima, K., Determination of 3 \npolycyclic aromatic hydrocarbons in milk samples by high-performance liquid chromatography with 4 \nfluorescence detection. Journal of Chromatography B-Analytical Technologies in the Biomedical and 5 \nLife Sciences 2003, 789, (2), 257-264. 6 \n21. Grimmer, G.; Bohnke, H., Polycyclic Aromatic Hydrocarbons Profile Analysis of  High-7 \nProtein Foods, Oils and Fats by Gas-Chromatograhpy. Journal of the Association of Official 8 \nAnalytical Chemists 1975, 58, (4), 725-733. 9 \n 10 \n 11 \n"}