{"doi":"10.1117\/2.1201104.003682","coreId":"140805","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5750","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5750","10.1117\/2.1201104.003682"],"title":"Pizzicato excitation for wearable energy harvesters","authors":["Pozzi, Michele","Zhu, Meiling"],"enrichments":{"references":[{"id":37919166,"title":"Analysis of the transformation of mechanical impact energy to electric energy using piezoelectric vibrator,","authors":[],"date":"1996","doi":"10.1143\/jjap.35.3267","raw":"M. Umeda, K. Nakamura, and S. Ueha, Analysis of the transformation of mechanical impact energy to electric energy using piezoelectric vibrator, Jpn. J. Appl. Phys. 35, pp. 3267–3273, 1996. doi:10.1143\/JJAP.35.3267","cites":null},{"id":37919169,"title":"Plucked piezoelectric bimorphs for energy harvesting applications,","authors":[],"date":null,"doi":"10.1007\/978-1-4614-5705-3_5","raw":"M. Pozzi and M. Zhu, Plucked piezoelectric bimorphs for energy harvesting applications, Proc. SPIE 8066, 2011. Accepted as paper 8066–42 at the SPIE Microtechnol.: Smart Sensors, Actuators and MEMS Conf. in Prague, Czech Republic, 18–20 April","cites":null},{"id":37919167,"title":"Plucked piezoelectric bimorphs for knee-joint energy harvesting: modeling and experimental validation,","authors":[],"date":"2011","doi":"10.1088\/0964-1726\/20\/5\/055007","raw":"M. Pozzi and M. Zhu, Plucked piezoelectric bimorphs for knee-joint energy harvesting: modeling and experimental validation, Smart Mater. Struct. 20 (5), p. 055007, 2011. doi:10.1088\/0964-1726\/20\/5\/055007","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2012-07-25","abstract":"A new technique based on the plucking of flexible piezoelectric material can be\nused to boost energy harvested to power portable electronic devices","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140805.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1117\/2.1201104.003682","pdfHashValue":"17179325fcb262586cd81095807195e06d5126c3","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5750<\/identifier><datestamp>2012-07-25T10:38:31Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Pizzicato excitation for wearable energy harvesters<\/dc:title><dc:creator>Pozzi, Michele<\/dc:creator><dc:creator>Zhu, Meiling<\/dc:creator><dc:description>A new technique based on the plucking of flexible piezoelectric material can be\nused to boost energy harvested to power portable electronic devices.<\/dc:description><dc:date>2012-07-25T08:32:35Z<\/dc:date><dc:date>2012-07-25T08:32:35Z<\/dc:date><dc:date>2012-07-25<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Michele Pozzi and Meiling Zhu. Pizzicato excitation for wearable energy harvesters. Solar & Alternative Energy, 10 June 2011, SPIE Newsroom.<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1117\/2.1201104.003682<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5750<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2012,"topics":[],"subject":["Article"],"fullText":"10.1117\/2.1201104.003682\nPizzicato excitation for wearable\nenergy harvesters\nMichele Pozzi and Meiling Zhu\nA new technique based on the plucking of flexible piezoelectric mater-\nial can be used to boost energy harvested to power portable electronic\ndevices.\nRecent decades have witnessed the miniaturization of elec-\ntronic devices. The reduction in the feature size of gadgets’\ncomponents is beneficial not only because we can pack many\ntransistors in a small space, but also because compact devices\nconsume less power. Currently, a good proportion of the volume\nand weight of portable gadgets is taken up by batteries, which\nhave a size dictated by a difficult compromise between portabil-\nity and battery life. However, our dependence on batteries may\nbe close to an end. Since miniaturized electronics do not require\nmuch power, it is becoming viable to generate the necessary\nenergy within the device itself or with portable energy har-\nvesters (EHs). These systems supply an inexhaustible amount of\nenergy by converting vibrations or other mechanical movement,\nthermal gradients, or electromagnetic radiation into electricity.\nAmong the first EHs to be studied were scavengers of the vi-\nbrational energy naturally present in many environments. These\ndevices power wireless sensor nodes that constantly monitor\nimportant environmental parameters for an extended period of\ntime without maintenance or battery replacement. Most of these\nvibrational-energy harvesters are based on piezoelectric trans-\nducers, devices capable of converting energy between physical\ndomains such as electrical into mechanical or vice versa.\nWhen it comes to wearable EHs, that is, devices that can har-\nvest the energy generated naturally by the human body (through\nwalking, for example) we are faced with a mismatch. Human\nmovements have characteristically low frequencies (up to a few\nhertz) while piezoelectric technology can produce sizable power\nat high frequencies only. A viable solution is to employ fre-\nquency up-conversion techniques. These methods are used to\nconvert a low input frequency into a high output one through\nmechanisms such as gears and cams or through impact or\nplucking. In pianos, up-conversion is achieved when hammers\nstrike the wires that are then free to vibrate at resonance. For\nFigure 1. The pizzicato up-frequency conversion. A plectrum\napproaches a bimorph (1) and mechanical energy is stored elastically\nafter contact (2). Upon release, the bimorph vibrates at resonance\n(3) and voltage is produced across an electrical load (lower plot). PZT-\n5H: A ‘flavor’ of PZT (lead zirconate titanate) characterized by a spe-\ncific chemical composition.\nContinued on next page\n10.1117\/2.1201104.003682 Page 2\/3\nFigure 2. The knee-joint harvester. The plectra-carrying outer casing is\nfixed to the thigh of the wearer, and the bimorphs-bearing central hub\nis fixed to the shank. During normal walking, bimorphs are plucked by\nplectra and convert mechanical energy into electrical energy.\npiezoelectric EHs, this approach was pioneered by Umeda and\nothers with a steel ball impacting a piezoelectric disc.1 In harp-\nsichords and guitars, plectra slowly deflect the chords that\nvibrate at resonance upon release. This plucking of the strings\nof a musical instrument is known as the pizzicato technique, a\nconcept that can also be applied to up-conversion in piezoelec-\ntric transducers.\nWe are currently interested in the study of wearable EHs\nthat can be used to power personal electronic gadgets (mobile\nphones, blood-sugar monitors, and others). To boost the energy\nharvested, we employ the pizzicato up-conversion technique\nusing plectra and piezoelectric bimorphs. (The latter are de-\nvices with two separate layers of piezo-material that bend when\nenergized and, conversely, generate electrical energy when\ndeformed.) The upper panel of Figure 1 shows an implementa-\ntion of the plucking excitation. A plectrum and a bimorph move\nrelatively to each other. After contact, both deflect and mechan-\nical energy is stored as elastic deformation. Electrical energy\nis produced by the piezoelectric effect both during deflection\nand, in greater quantity, in the resonance vibrations that follow\nrelease. From the experimental curve of the voltage generated as\na function of time, the energy produced can be calculated (38\u0016J\nin the event reproduced in the figure).\nWith this principle as a starting point, we numerically mod-\neled the response of a bimorph and the power generated by\nplucking. We focused on the effects of several parameters, such\nas electrical loading, the interval between subsequent pluck-\ning actions, and the speed of deflection.2 With this knowledge,\nwe designed and prototyped a wearable knee-joint harvester.3\nThe device is made of two parts: an internal hub fixed to the\nshank of the wearer and an outer casing fixed to the thigh (see\nFigure 2). As the person walks, the hub and casing rotate\nrelatively to each other so that a large number of plectra (on the\ncasing) pass in front of each bimorph (on the hub) and pluck\nit. Every time this happens, each bimorph starts vibrating and\nproduces energy, until all of the mechanical energy is either con-\nverted or dissipated. Thus, energy follows a staircase-like curve\nas a function of time, with each step upwards associated to a\nplucking event. The height of the riser measures the energy pro-\nduced, while the length of the tread is linked to the spacing be-\ntween plectra.\nIn the case of a multi-bimorph harvester, an electrical com-\nplication arises. Since the time of release of each bimorph has\na random component, the voltage waveforms output by the\ndevices (similar to those in the lower panel of Figure 1) will not\nbe in phase. Since the signal oscillates between positive and neg-\native values, if the electrodes of the bimorphs were connected\ntogether, we would see electrical charges transferred among the\ndevices with a significant penalty in power output. Therefore, it\nis necessary to rectify each bimorph’s output individually before\nbringing them together. Fortunately, small rectifying bridges are\navailable as integrated circuits, and the output of a large number\nof bimorphs can be conditioned with very compact electronics.\nThe advantages of our design include mechanical simplicity.\nIn fact, precision engineering is not required to produce the har-\nvester because standard manufacturing tolerances are adequate.\nWhile the current prototype can accommodate a maximum of\nfour bimorphs, an industrially manufactured device would not\nhave this limitation. We estimate that tens of mW of useful\npower can be generated before further design optimization is\nrequired.\nThe drastic reduction in size and power requirements of\nportable electronics has spurred intense research in energy\nharvesting. We proposed a knee-joint harvester based on a pizzi-\ncato frequency up-conversion technique for wearable power\ngeneration. In addition, we designed a prototype capable of out-\nput powers in the order of mW, and we anticipate that larger\npowers can be made available with design improvements and\nfurther development. In the future, we plan to conduct tests\nusing bio-mechanical gait data and trials on human subjects. We\nwill also investigate a re-design of the harvester with magnetic\nplectra.\nAuthor Information\nMichele Pozzi and Meiling Zhu\nCranfield University\nCranfield, United Kingdom\nContinued on next page\n10.1117\/2.1201104.003682 Page 3\/3\nMichele Pozzi holds a diploma in physics, a MSc in materials sci-\nence and technology, and a PhD in mechatronics. Previously, he\nwas an assistant professor at Sirindhorn International Institute of\nTechnology, Thammasat University in Thailand and a researcher\nat Newcastle University in the UK. He is currently a research fel-\nlow in energy harvesting.\nMeiling Zhu received her PhD from Southeast University, Nan-\njing, China in 1995. She is currently working with the Depart-\nment of Materials at the School of Applied Science of Cranfield\nUniversity as a senior research fellow. Her scientific interests lie\nin the field of piezoelectric sensing and actuation, and energy\nharvesting. Her expertise is mainly in design, analysis, modeling\nand simulation, prototyping, and applications of macro\/micro\nsized piezoelectric devices.\nReferences\n1. M. Umeda, K. Nakamura, and S. Ueha, Analysis of the transformation of mechani-\ncal impact energy to electric energy using piezoelectric vibrator, Jpn. J. Appl. Phys. 35,\npp. 3267–3273, 1996. doi:10.1143\/JJAP.35.3267\n2. M. Pozzi andM. Zhu, Plucked piezoelectric bimorphs for knee-joint energy harvesting:\nmodeling and experimental validation, Smart Mater. Struct. 20 (5), p. 055007, 2011.\ndoi:10.1088\/0964-1726\/20\/5\/055007\n3. M. Pozzi and M. Zhu, Plucked piezoelectric bimorphs for energy harvesting applica-\ntions, Proc. SPIE 8066, 2011. Accepted as paper 8066–42 at the SPIE Microtechnol.:\nSmart Sensors, Actuators and MEMS Conf. in Prague, Czech Republic, 18–20 April\n2011.\nc\r 2011 SPIE\n"}