{"doi":"10.1111\/j.1468-0491.2010.01508.x","coreId":"218155","oai":"oai:eprints.lse.ac.uk:33215","identifiers":["oai:eprints.lse.ac.uk:33215","10.1111\/j.1468-0491.2010.01508.x"],"title":"Toward a new era of administrative reform? The myth of post-NPM in New Zealand","authors":["Lodge, Martin","Gill, Derek"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01","abstract":"This article explores the supposed shift from New Public Management (NPM) to a new era of “post-NPM” by looking at one critical case, New Zealand. It finds limited evidence of such a shift, suggesting that the wider literature needs to move to a more careful methodological treatment of empirical patterns. To contribute to such a move, this article applies a three-pronged approach to the study of changing doctrines in executive government. After setting out the broad contours of what NPM and post-NPM supposedly constitute, the article proceeds to a documentary analysis of State Services Commission doctrines; this is followed by an analysis of “Public Service Bargains” based on elite interviews and finally a case-study approach of the Crown Entities Act 2004. Far from a new era of administrative reform, the “messy” patterns that emerge suggest a continuation of traditional understandings and ad hoc and politically driven adjustments, leading to diversification","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/218155.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/33215\/1\/Lodge_Gill_Toward-a-new-era-of-administrative-reform_2010.pdf","pdfHashValue":"2bd769768dff38fe4cad26643b43d7d5176a6ec8","publisher":"Wiley-Blackwell Publishing, Inc.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:33215<\/identifier><datestamp>\n      2014-12-19T10:56:39Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F38<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/33215\/<\/dc:relation><dc:title>\n        Toward a new era of administrative reform? The myth of post-NPM in New Zealand<\/dc:title><dc:creator>\n        Lodge, Martin<\/dc:creator><dc:creator>\n        Gill, Derek<\/dc:creator><dc:subject>\n        JQ Political institutions Asia<\/dc:subject><dc:description>\n        This article explores the supposed shift from New Public Management (NPM) to a new era of “post-NPM” by looking at one critical case, New Zealand. It finds limited evidence of such a shift, suggesting that the wider literature needs to move to a more careful methodological treatment of empirical patterns. To contribute to such a move, this article applies a three-pronged approach to the study of changing doctrines in executive government. After setting out the broad contours of what NPM and post-NPM supposedly constitute, the article proceeds to a documentary analysis of State Services Commission doctrines; this is followed by an analysis of “Public Service Bargains” based on elite interviews and finally a case-study approach of the Crown Entities Act 2004. Far from a new era of administrative reform, the “messy” patterns that emerge suggest a continuation of traditional understandings and ad hoc and politically driven adjustments, leading to diversification.<\/dc:description><dc:publisher>\n        Wiley-Blackwell Publishing, Inc.<\/dc:publisher><dc:date>\n        2010-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/33215\/1\/Lodge_Gill_Toward-a-new-era-of-administrative-reform_2010.pdf<\/dc:identifier><dc:identifier>\n          Lodge, Martin and Gill, Derek  (2010) Toward a new era of administrative reform? The myth of post-NPM in New Zealand.  Governance, 24 (1).  pp. 141-166.  ISSN 0952-1895     <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/%28ISSN%291468-0491<\/dc:relation><dc:relation>\n        10.1111\/j.1468-0491.2010.01508.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/33215\/","http:\/\/onlinelibrary.wiley.com\/journal\/10.1111\/%28ISSN%291468-0491","10.1111\/j.1468-0491.2010.01508.x"],"year":2010,"topics":["JQ Political institutions Asia"],"subject":["Article","PeerReviewed"],"fullText":"  \nMartin Lodge and Derek Gill \nToward a new era of administrative reform? \nThe myth of post-NPM in New Zealand \n \nArticle (Published version) \n(Refereed) \n \n \n \n \nOriginal citation: \nLodge, Martin and Gill, Derek (2010) Toward a new era of administrative reform? The myth of \npost-NPM in New Zealand. Governance, 24 (1). pp. 141-166. ISSN 0952-1895 \nDOI: 10.1111\/j.1468-0491.2010.01508.x \n \n© 2010 The Authors. Published by Wiley Periodicals, Inc. \n \nOpen Access article under the terms of the Creative Commons Attribution License CC-BY 3.0 \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/33215\/ \nAvailable in LSE Research Online: December 2014 \nToward a New Era of Administrative Reform?\nThe Myth of Post-NPM in New Zealandgove_1508 141..166\nMARTIN LODGE* and DEREK GILL**\nThis article explores the supposed shift from New Public Management\n(NPM) to a new era of “post-NPM” by looking at one critical case, New\nZealand. It finds limited evidence of such a shift, suggesting that the wider\nliterature needs to move to a more careful methodological treatment of\nempirical patterns. To contribute to such a move, this article applies a\nthree-pronged approach to the study of changing doctrines in executive\ngovernment. After setting out the broad contours of what NPM and post-\nNPM supposedly constitute, the article proceeds to a documentary analysis\nof State Services Commission doctrines; this is followed by an analysis of\n“Public Service Bargains” based on elite interviews and finally a case-study\napproach of the Crown Entities Act 2004. Far from a new era of adminis-\ntrative reform, the “messy” patterns that emerge suggest a continuation of\ntraditional understandings and ad hoc and politically driven adjustments,\nleading to diversification.\nAfter more than three decades of widespread currency, the term “New\nPublic Management” (NPM) does not seem to want to go away. For every\ndeclaration that “NPM is dead,” another academic conference, edited\nvolume, or special issue is organized to reconsider administrative reform\ntrajectories, to “transcend” NPM, or to declare a move toward “post-\nNPM” (Christensen and Laegreid 2008, Laegreid and Christensen 2001,\n2007a, 2007b). What unites accounts of post-NPM (and related ideas) is a\ndiagnosis of the failures and shortcomings of earlier administrative\nreform attempts (NPM) and the availability of new technological and\nparticipatory tools to advance public management. But is NPM really\ndead? What is the actual content of its supposed successor, post-NPM?\nAnd to what extent is there any systematic evidence that would support\nthe argument of a shift from NPM to post-NPM?\nThis article explores the evidence for a shift from an age of “NPM” to an\nage of “post-NPM” in the case of New Zealand. Looking at New Zealand\n*London School of Economics and Political Science\n**Victoria University of Wellington\nThe copyright line in this article was changed on 31 July 2014 after online publication.\nGovernance: An International Journal of Policy, Administration, and Institutions, Vol. 24, No. 1,\nJanuary 2011 (pp. 141–166).\n© 2010 The Authors. Governance published by Wiley Periodicals, Inc., 350 Main St., Malden,\nMA 02148, USA, and 9600 Garsington Road, Oxford, OX4 2DQ, UK. ISSN 0952-1895\nThis is an open access article under the terms of the Creative Commons Attribution License,\nwhich permits use, distribution and reproduction in any medium, provided the original\nwork is properly cited.\nshould offer us maximum insights. New Zealand is regarded as the\nprimary example of an extensive and intellectually coherent attempt at\npublic sector reform that followed the key characteristics associated with\nNPM (Boston et al. 1996; Hood 1990). Furthermore, a number of studies\non New Zealand have suggested a move away from NPM (Boston and\nEichbaum 2007; Norman 2003). Developments since the turn of the\ncentury prompted Chapman and Duncan (2007) to pose the question: “Is\nthere a new New Zealand model?”\nIn contrast to these country-specific studies and those that argue more\nbroadly in favor of a shift toward post-NPM-type administrative reforms,\nthis article points to rather more diverse empirical and messy patterns.\nThese patterns suggest that NPM was never as purely implemented as the\nliterature has led us to believe, and post-NPM’s day is yet (if ever) to come.\nIndeed, the New Zealand case suggests considerable continuity mixed\nwith ad hoc and politically motivated changes that have generated diver-\nsification rather than a new era or paradigm.\nMore generally, this article warns against the adoption of ambiguous\nterms without proper empirical foundations. It contributes to the wider\nliterature by utilizing three methodological devices to explore what, if\nanything, has changed in thinking about core aspects of executive gov-\nernment in New Zealand over the last decade. First, we utilize the “admin-\nistrative argument” device (Hood and Jackson 1991) to investigate the\nextent of change in “machinery of government” (MoG) debates. Second,\nwe consider, through the concept of “Public Service Bargains” (PSBs),\nhow chief executives in ministerial departments perceive PSBs to have\nchanged over time. Third, we consider one critical case, namely, the Crown\nEntities Act 2004. The election of November 2008, which returned the\nNational Party to office, provides the cutoff point for this analysis.\nNPM, Post-NPM, and New Zealand\nAs with most divinities, defining NPM has been a problematic task (Hood\n2005). At its most general, it is an eclectic set of doctrines that draw on, not\nnecessarily consistent, ideas from new institutional economics and mana-\ngerialism. NPM was supposed to represent a move both “down grid” in the\nsense of relaxing procedural rules as well as “down group” in the sense of\nreducing the professional boundaries between public and private sectors.\nThis contrasts with the earlier age of “Progressive Public Administration”\n(PPA) with an emphasis on procedural controls and rules and on public\nsector distinctiveness (Hood 1994). More concretely, NPM-related reforms\nwere identified by “hands-on professional management,” explicit perfor-\nmance standards, output controls, organizational disaggregation, compe-\ntition and contractualization, private sector-style management practices,\nand an emphasis on parsimony in financial resource use (Hood 1991, 4–5).\nDunleavy et al. (2005, 471) suggest that NPM was characterized by disag-\ngregation, competition, and incentivization. Empirically, NPM has been\n142 MARTIN LODGE AND DEREK GILL\nassociated with a wide variety of interventions, trajectories, and reform\nintensities (Hood and Lodge 2006; Pollitt and Bouckaert 2004, ch. 8).\nIf it is already difficult to define what NPM is, then the case of post-\nNPM is even more problematic. As Christensen and Laegreid state:\n“. . . post-NPM reforms—which partly revived some neo-Weberian\nfeatures—have been blended with some NPM features” (Christensen and\nLaegreid 2008, 8; see also Dunleavy et al. 2005, 468). They diagnose a\nreassertion of “old public administration” in the light of failures, absent\nefficiency gains, and increased “insecurity” (Christensen and Laegreid\n2008, 9) in a post-9\/11 world. Similarly, Johan P. Olsen (2008) has pointed\nto the inherent advantages of bureaucratic organization that have been\nrediscovered after a period of marketization. Post-NPM is therefore\nlargely about overcoming the perceived NPM-generated weaknesses pro-\nduced by specialization, fragmentation, and marketization. In response,\npost-NPM is associated with a strengthening of coordination through\nmore centralized or collaborative capacity, whether it is called “whole of\ngovernment” or “joined-up government.” This emphasis on cooperation\nand collaboration is achieved, for example, through centralization at the\ncenter (Christensen and Laegreid (2008), through coordination within\nnetworks of diverse actors (Stoker 2006), or through reintegration and\ncoordination using digital technology (Dunleavy et al. 2005).\nIn sum, post-NPM is said to signify a greater emphasis on “high grid”\n(rules) and “high group” (collective public sector distinctiveness). Similar\nsuggestions are made by those authors who highlight that “public value”\noffers a paradigmatic change from NPM: Observers stress the distinctive-\nness of the public sector and its multiple, often contradictory objectives\n(O’Flynn 2007, 361; Stoker 2006, 416), the importance of network-based\ncollaborative public value generation, and the significance of outcome-\nrather than output-based assessments (Alford and Hughes 2008; Alford\nand O’Flynn 2009). In a similar vein, albeit mainly concerned with the\npotential of transformative change through technology, Dunleavy et al.\n(2005) argue that NPM “has essentially died in the water” (468) and\nsuggest that the emerging period of “Digital Era Governance” (DEG) is\ncharacterized by three related features: “reintegration,” “needs-based\nholistic structures,” and “digitalization” of administrative processes. The\nlatter is said to provide a transformation toward a new era of interaction\nbetween government and its subjects.1\nWhile representatives of the literatures on post-NPM, public value, and\nDEG may disagree about some aspects, the basic tendencies of the type of\nchange away from NPM are similar (Wegrich 2010). The following utilizes\nthe “post-NPM” label to bring together the key themes that emerge from\nthe above literatures. Differences are largely one of emphasis. We choose\nMoG questions, whereas public value is largely focused on the “delivery”\nside of policymaking. DEG is about the potential effects of enthusiastic\nuptakes of e-government solutions (which, in the case of New Zealand,\nhave been rather disappointing).\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 143\nThese literatures also broadly agree on the causes of this supposedly\nparadigmatic shift by pointing to a set of mechanisms that can be labeled\n“disappointment,” “surprise,” and “technology.” “Disappointment” leads\nto political pressure to “do something.” “Surprise” is linked to the idea\nthat particular sets of instruments have their own “black spots” and are\ntherefore unable to diagnose when things go wrong until it is too late\n(Hood and Peters 2004). “Technology” is said to trigger a “neo-Weberian”\nadministration (Hood 1994) in that feasibility boundaries change and\norganizational processes become redundant (such as typing pools) or can\nbe reviewed (e.g., online tax forms), thereby reducing the need for tradi-\ntional “paper factories” in public administration (Dunleavy et al. 2006).\nTable 1 brings together the ideas that have been associated with various\nages in public administration discussed above and notes the basic charac-\nteristics of post-NPM (in particular the emphasis on the move back to “high\ngroup\/high grid”) in contrast to the previous ages of NPM and PPA.\nIn what follows, we explore the proclaimed shift from NPM to post-\nNPM in one critical case, New Zealand. As noted, New Zealand’s public\nsector reforms have been widely seen as cutting edge in terms of their\nTABLE 1\nContrasting Key Themes across Three Administrative Reform Ages\nReform “Ages”\nPPA NPM Post-NPM\nPublic sector\ndistinctiveness\n(group\ndimension)\nUniform\/\ninclusive\npublic service\nUnbundling “Whole of\ngovernment”\nLoosely defined\nprovision\nContractualization\/\nmarketization\nReturn to mixed\npattern of in-house\nand marketized\nservices; delivery\nnetworks\nPublic sector\nethos\/career\nPrivate sector\nstyle\nClient based\/holism\nRules versus\ndiscretion (grid\ndimension)\nPolicy skills Hands-on\nmanagement\nskills\nBoundary-spanning\nskills\nImplicit\/\nqualitative\nperformance\nstandards\nExplicit\nperformance\nstandards\nJoined-up targets\nProcedural\ncontrols\nOutput\/outcome\ncontrols\nProcedural\/\ncentralized\ncontrols;\nimpartiality\/ethics\nrules\nNote: Based on Hood (1994), Dunleavy et al. (2005), and Christensen and Laegreid (2008).\nNPM, New Public Management; PPA, Progressive Public Administration.\n144 MARTIN LODGE AND DEREK GILL\ncontent and their extent (Aberbach and Christensen 2001; Boston 1987,\n1992; Boston et al. 1996; Goldfinch 1998; Pollitt and Bouckaert 2004).\nProminent examples include the contractual arrangements between\ndepartmental chief executives and the State Services Commission (SSC;\nthereby ending the idea of permanence), the adoption of an output\/\noutcome split in performance management, as well as the extensive dis-\naggregation of activities (including a split between “policy” and\n“delivery”) in order to allow for “focus” and “specialization.”\nNew Zealand’s reform experience has been widely reviewed. The Schick\nReport (Schick 1996) noted the extensive and coherent nature of the public\nsector reforms. It also raised some of the concerns that were later picked up\nin the post-NPM literatures, namely, the need for more central direction and\nmaintaining collaborative capacity in the light of government unbundling.\nIn response to these concerns and criticisms regarding standards of behav-\nior in the public sector, the “Review of the Centre” was commissioned by\nthe Labour government in 2001. This review advocated better integrated\nservice delivery, a rethinking of organizational fragmentation, and a strong\nemphasis on people and organizational culture.2 As a result, New Zealand\nis also said to be displaying “leading-edge” characteristics in terms of\npost-NPM (Boston and Eichbaum 2007; Gregory 2003a; Norman and\nGregory 2003; Whitcombe 2008). Dunleavy et al. (2005, 471) suggest that\nNew Zealand’s initial reforms directly contributed to its poor relative\neconomic performance (until the election of the Labour government in\n1999). They hail a working paper by the SSC, the central government\ndepartment tasked with civil service and MoG questions, that advocated\n“whole of government” doctrines to combat “fragmentation” as highlight-\ning a move away from “NPM” (Bhatta 2003).3 Norman (2003, 19) describes\nthe incoming Labour government (of 1999) as “consisting of skeptics\nand . . . opponents of NPM techniques.” Boston and Eichbaum (2007)\nsuggest that the 1999 Labour manifesto marked a distinct shift from “Phase\n1” to “Phase 2” public management reform, underpinned by a “social\ndemocratic” rather than a “neoliberal” philosophy.\nSupporters of the reforms of the late 1980s and 1990s also note a\nchange away from the supposedly coherent and consistent basis in which\nMoG questions were discussed and toward a far more politically “prag-\nmatic” line of justification (Scott 2001, 2008). Furthermore, the prior domi-\nnance of the Treasury is said to have been challenged by politicians and\nby other central agencies, in particular the SSC (Chapman and Duncan\n2007). In the wider context, the change in the electoral rules of the game\nfrom plurality to mixed-member proportional representation (MMP; 1996\nwas the first election under MMP) is said to have triggered a move from\n“decisive” single-party government to the “muddling through” of multi-\nparty governments.\nThe case of New Zealand should therefore offer maximum insight into\nthe supposed shift from NPM to post-NPM and should facilitate a better\nunderstanding of what the world of post-NPM might look like. In addi-\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 145\ntion, for those who regard New Zealand as a small, unimportant, and\noveranalyzed case, this article contributes to wider debates regarding the\nanalysis of MoG reform through the application of three methodological\ndevices. We look at administrative arguments, followed by PSBs, before\nmoving to a case study of the Crown Entities Act of 2004. This focus is\nwider than that usually provided in accounts pointing to “paradigmatic\nchange” in any single jurisdiction, but at the same time, we are conscious\nthat our focus is necessarily selective.\nChanging Administrative Doctrines?\nNearly two decades ago, Christopher Hood and Michael Jackson (1991)\nprovided a first step toward an encyclopedia of administrative doctrines\n(containing 99 doctrines covering key aspects of institutional design).\nBuilding on our discussion in the previous section, Table 2 summarizes\nkey differences between NPM and post-NPM utilizing Hood and\nJackson’s (1991, 34) list.\nGiven the diagnosed changes in New Zealand, we should expect sig-\nnificant differences in the observed argumentation patterns between NPM\nTABLE 2\nComparing Administrative Reform Doctrines\nNPM Post-NPM\nA2—use independent public\nbureaucracy\nA1—use classic public bureaucracy\nA3—use private\/independent\norganization\nA2—use independent public\nbureaucracy\nH2.1—differentiated ranks with one\nboss\nH2.2—prefer differentiated ranks with\ncollegial directorate\nJ1.2—separate policy and\nadministration\nJ2—consolidate work\nK2—managerial discretion K2—managerial discretion—but\nwithin greater constraints\nL1—give leaders best conditions L2—give leaders normal conditions\nM2—multisource supply M2—multisource supply\nN2—managerial\/executive skills N1&2—technical skills to be able to\n“span boundaries” and “managerial\nskills”\nO1—contracting out O1 & O2: in-house and contracted-out\nprovision\nP2.2B—promotion on subjective merit P2.2A promotion on objective\/\nprocedural judgment\nR2.2.C—performance related pay R2.1 fixed pay\nT2.1—fixed-term tenure T2 limit tenure\nX2.3—control by business methods X2—control by process\nX3.1—results orientation X3.2—outcome measures\nSource: Hood and Jackson (1991, 34). We utilize their codes.\nNPM, New Public Management.\n146 MARTIN LODGE AND DEREK GILL\nand post-NPM. We are interested in changing doctrines in MoG docu-\nments as put forward by the SSC before and after 1999. We concentrate on\nthe SSC as it is more flexible in its programmatic foundations than the\nother key public reform actor, the New Zealand Treasury. We seek to\nmaximize the observed change in argumentation by focusing on the SSC.\nOur analysis proceeds in three steps. First, we look at the overall prin-\nciples that the SSC proposed to apply to MoG reviews across all sectors.\nSecond, we analyze a range of policy recommendations that applied MoG\nprinciples to particular domains. Third, we consider the administra-\ntive doctrines as put forward in SSC briefing documents to incoming\nministers.\nWe used the SSC’s Web site for recent (post-2002) documents on MoG\nquestions. We relied on the SSC to provide documents for the period before\n2002 that relate to advice regarding MoG questions (i.e., those not available\non the Web site). These documents provide a valid indicator of overall\nMoG-related discussions during the period of interest. We independently\nanalyzed the documents and recorded separately what we regarded as the\nkey claims in these documents and then moderated and coded them\naccording to the frame provided by Hood and Jackson (1991, 35).\nTurning to the overall MoG principles first, Table 3 provides for an\noverview of the SSC’s underlying MoG principles and their associated\nadministrative doctrines (using the codes provided by Hood and Jackson\n1991). The SSC has undertaken a review of general MoG principles at least\nonce a decade. In 1987 and 1998, such reviews involved the commission-\ning of papers from inside and outside the SSC as well as active engage-\nment with the Treasury.\nTable 3 suggests that the principles are oriented at different MoG\ndimensions, but they point to similarities across time, although mixed\nwith a degree of reduced specificity in overall message. The 1987 prin-\nciples start with the fundamental question as to where a function should\nbe undertaken (the “scope of government” principle: inside or outside\ngovernment). They then deal with questions as to what kind of (govern-\nment) organization should manage particular functions (“decision-\nmaking principles”) and finally move to organizational design questions\n(which functions should be separated and which should be colocated). The\n1998 principles are solely interested at the decision-making level. The 2007\nmaterial starts with the scope of government question but thereafter\nclosely follows the 1998 principles. To some extent, these changes appear\nconsistent with an NPM\/post-NPM story. The 1987 principles placed\ngreater emphasis on focus and specialization with a preference for sepa-\nration of policy and service delivery. In 1998, reflecting experience of over\na decade of reform, these themes continued to persist but were presented\nin a more nuanced tone: “[C]ontestability is better, sometimes; functional\nseparation: sometimes yes, sometimes maybe.”\nTable 2 noted that one key distinction between NPM and post-NPM\nconcerns the use of “independent bureaucracy.” The New Zealand case\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 147\ndistinguishes between noncommercial functions and commercial trading\nactivities. There has been no change in SSC thinking regarding commer-\ncial activities since 1987: Commercial activities are to be provided within\ncommercial structures.4 For example, among the decisions included in the\nCrown Entities Act 2004 was the reorganization of three “crown entity\nTABLE 3\nOverview of MoG Principles over Time\n1987 Cabinet MoG\nPrinciples 1998 MoG Principles 2007 MoG Questions\nEnsuring the state does\nnot do what others\ncan do better (A3)\nEffectiveness and efficiency\nprinciple\nWhat role for central\ngovernment?\n(A1&3)\nClarifying departmental\npolicy objectives and\nfunctions (X3)\nContestable is better,\nsometimes (O1\/O2)\nWhat functions to\ncarry out that role?\n(J1\/V2)\nPlacing commercial\nfunction in\ncommercial structures\n(A3.1)\nFunction separation—\n“sometimes yes, sometime\nmaybe” (J1)\nWhat powers to carry\nout functions?\nSeparation of conflicting\nobjectives (V1)\nMultiple functions means\ndepartment (V2)\nWhat funding? (M1\/\nM2)\nSeparation where\npractical of policy\nadvice and service\ndelivery (J1.2)\nMatch commercial to\ncommercial (A3.1)\nWhat risk from\nfunctions and\npowers—strategic,\npolitical, fiscal,\ncontractual?\nSelection of appropriate\nstructures and\nmanagement\nframeworks\nManaging risk—departmental\nform is preferred (A1)\nwhen strategic risk is high\nWhat governance—\nwhat kind of\nministerial\ninvolvement (A1)\nPlacement of function\nthat need to be\nperformed close to\nministers (e.g., policy\nadvice) in\ndepartments rather\nthan Crown Entities or\nSOEs (J1)\n(SSC 2007b, 6)\n(Minister of State Services\n1998, para. 7)\nContractibility is low\nFlexibility (where the choice\nis not clear cut)\nConstitutional conventions\nClose ministerial oversight\nfavors departments (A1)\nNeed for independence\nfavors nondepartmental\nforms (A2\/A3)\n(SSC 2007b, 6)\nMoG, machinery of government.\n148 MARTIN LODGE AND DEREK GILL\ncompanies” into “companies under the State-Owned Enterprises Act”\nbecause they undertook commercial functions. In contrast, for noncom-\nmercial functions, the overall MoG principles display a degree of soften-\ning, namely, a move away from a presumption of separation in 1987 to a\n“sometimes yes, sometimes maybe” principle in 1998 and 2007.5\nTurning to advice in particular domains, Table 4 suggests that the pre-\n1999 period was characterized by considerable consistency, whereas the\npost-1999 period was distinguished by greater diversity. Table 4 provides\nfor important insights. One is that in the decade to 2008 there are no\nconsistent shifts in doctrines. Even those documents that point to the\nlimits of the reforms of the 1980s do not make claims that could be\ninterpreted either to be of the “one more heave” kind that demands\n“purer” NPM-type reforms or rejections of earlier doctrinal ideas in the\ndirection of post-NPM. The available documents suggest neither a “pure\nworld” of NPM pre-1999 nor a straightforward shift toward a post-NPM\n(post-1999). Individual documents provide evidence of the SSC’s position\nmorphing, but overall there is no clear-cut pattern. Similarly, in terms\nof justification, despite more use of the concept of “capability” (a\n“resilience”-type justification), an emphasis on “value for money” (i.e.,\n“efficiency”) was dominant throughout.\nFinally, we extended the documentary analysis to SSC briefing papers to\nincoming ministers. The 2002 Briefing to the Minister of State Services\narguably reflects the high point of post-NPM-related thinking with its\nemphasis on “integrated delivery” and the need to “address fragmenta-\ntion” and to encourage a “more long-term focus” as well as outcome\nspecification (SSC 2002). Subsequent briefing documents repeat some of\nthese themes. For example, the October 2005 postelection briefing empha-\nsizes the importance of “learning cultures,” “good conduct,” “networked\nservices,” and “managing for outcomes” (SSC 2005a). However, in the 2007\nbriefing for the new minister, one of the key objectives (that of “excellent\nstate servants”) had been replaced by “value for money state services” (SSC\n2007a). In other words, the broad intention and objectives that supposedly\nguided the SSC were hardly of a nature that would justify sweeping\nstatements regarding the sustained rise of post-NPM. Documents did\nreflect a growing emphasis on reduced fragmentation and closer “control”\nas well as procedural correctness. Nevertheless, the continued emphasis on\nefficiency points to a similar phenomenon that is evident in Table 4: We did\nnot find a single set of doctrines and justifications that were being applied\nto the state sector in New Zealand, nor were we able to identify a significant\nshift in doctrines and justifications over time.\nIn sum, a discussion that concentrates solely on identifying what is\nNPM and what is post-NPM cannot account for the variability of advice\nput forward by the SSC. While there are shifts in focus, it is difficult to\ndiscover any form of major shift in SSC argumentation. Instead, the pat-\nterns point to differentiated and diversified applications of administrative\narguments.\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 149\nTA\nB\nL\nE\n4\nO\nve\nrv\nie\nw\nof\nA\nd\nm\nin\nis\ntr\nat\niv\ne\nD\noc\ntr\nin\nes\nas\nP\nu\nt\nFo\nrw\nar\nd\nb\ny\nS\nS\nC\nD\noc\num\nen\nt\nSS\nC\n(n\nd\n)\nSS\nC\n(1\n99\n7b\n)\nSS\nC\n(1\n99\n9)\nSS\nC\n(2\n00\n3a\n)\nSS\nC\n(2\n00\n3b\n)\nSS\nC\n(2\n00\n3c\n)\nSS\nC\n(2\n00\n4a\n)\nSS\nC\n(2\n00\n4b\n)\nSS\nC\n(2\n00\n5b\n)\nSS\nC\n(2\n00\n6)\nSS\nC\n(2\n00\n7c\n)\nSS\nC\n(2\n00\n7d\n)\nSS\nC\n(2\n00\n7e\n)\nJu\nst\nifi\nca\nti\non\nE\nco\nno\nm\ny\nE\nco\nno\nm\ny,\nem\nph\nas\nis\non\n“p\nra\ngm\nat\nis\nm\n”\nE\nco\nno\nm\ny\nE\nco\nno\nm\ny\nan\nd\nre\nsi\nlie\nnc\ne\nE\nffi\nci\nen\ncy\nan\nd\nef\nfe\nct\niv\nen\nes\ns\nR\nes\nili\nen\nce\nan\nd\nef\nfic\nie\nnc\ny\nR\nes\nili\nen\nce\nR\nes\nili\nen\nce\nan\nd\nef\nfic\nie\nnc\ny\nE\nffi\nci\nen\ncy\nan\nd\nre\nsi\nlie\nnc\ne\nR\nes\nili\nen\nce\nE\nffi\nci\nen\ncy\nR\nes\nili\nen\nce\nE\nffi\nci\nen\ncy\nan\nd\nre\nsi\nlie\nnc\ne\nD\noc\ntr\nin\nes\nJ1\n.2\n:\nSe\npa\nra\nti\non\npo\nlic\ny\/\nad\nm\nin\nJ1\n:S\npe\nci\nal\niz\ne\nw\nor\nk\nJ1\n\/\nJ1\n.2\n:\nSp\nec\nia\nliz\ne\nw\nor\nk\/\nsp\nlit\nad\nm\nin\n\/\npo\nlic\ny\nJ2\n&\nV\n1:\nC\non\nso\nlid\nat\ne\nw\nor\nk:\nne\ned\nfo\nr\ngr\nea\nte\nr\nco\nor\nd\nin\nat\nio\nn\nof\nH\nR\npr\nac\nti\nce\ns\nC\n2:\nPu\nt\nlik\ne\nw\nit\nh\nlik\ne\nto\nge\nth\ner\n:M\nYA\nto\nbe\nm\ner\nge\nd\nin\nto\nov\ner\nal\nl\nM\nin\nis\ntr\ny\nof\nSo\nci\nal\nD\nev\nel\nop\nm\nen\nt\/\nM\nW\nA\nto\nbe\nke\npt\nse\npa\nra\nte\n.\nU\n2\n&\nJ1\n&\nV\n1.\n1:\nPl\nur\nif\nor\nm\nor\nga\nni\nza\nti\non\n,\nsp\nec\nia\nliz\ne\nw\nor\nk,\nin\ncl\nus\niv\ne\nho\nri\nzo\nnt\nal\nre\nsp\non\nsi\nbi\nlit\ny\nV\n1:\nIn\ncl\nus\niv\ne\nre\nsp\non\nsi\nbi\nlit\ny:\nen\nd\n“m\nax\nim\num\nau\nto\nno\nm\ny”\nJ2\n:\nC\non\nso\nlid\nat\ne\nw\nor\nk:\nla\nck\nof\nca\npa\nbi\nlit\ny\ndu\ne\nto fr\nag\nm\nen\nta\nti\non\nV\n2\n&\nJ1\n:N\no\nre\nco\nm\nm\nen\nda\nti\non\nof\nch\nan\nge\n:\nm\nai\nnt\nai\nn\nd\niv\nid\ned\nre\nsp\non\nsi\nbi\nlit\ny,\nsp\nec\nia\nliz\ne\nw\nor\nk\nB\n1,\nC\n2.\n1\n&\nV\n1.\n2:\nPr\nef\ner\nm\ner\nge\nr,\npu\nt\nlik\ne\nw\nit\nh\nlik\ne,\nan\nd\nco\nns\nol\nid\nat\nio\nn\nov\ner\nsm\nal\nl-\nsc\nal\ne\nco\nnt\nin\nui\nty\nV\n1\n&\nJ2\n:\nC\non\nso\nlid\nat\ne\nw\nor\nk\nan\nd\nin\ncl\nus\niv\ne\nre\nsp\non\nsi\nbi\nlit\ny\nA\n2,\nB\n2\n&\nV\n2.\n1\n&\nJ1\n:P\nre\nfe\nr\nin\nd\nep\nen\nd\nen\nt\npu\nbl\nic\nbu\nre\nau\ncr\nac\ny,\nsm\nal\nls\nca\nle\n,\nha\nve\nd\niv\nid\ned\nva\nri\ned\nre\nsp\non\nsi\nbi\nlit\ny\nan\nd\nsp\nec\nia\nliz\ne\nw\nor\nk\nV\n1\n&\nJ2\n:\nM\nai\nnt\nai\nn\nco\nns\nol\nid\nat\ned\nw\nor\nk\nan\nd\nin\ncl\nus\niv\ne\nre\nsp\non\nsi\nbi\nlit\ny\nJ1\n:S\nep\nar\nat\nio\nn\nbe\ntw\nee\nn\nsc\nho\nol\ns\/\nbo\nar\nd\ns\nan\nd\nm\nin\nis\ntr\ny\nJ1\n.2\n:S\npl\nit\npo\nlic\ny\/\nad\nm\nin\nN\n2:\nPr\nef\ner\nm\nan\nag\ner\nia\nl\nsk\nill\nV\n2:\nR\nes\npo\nns\nib\nili\nty\nsh\nif\nte\nd\nto\n“c\nlie\nnt\ns\/\nlo\nca\nl”\nB\n2:\nPr\nef\ner\nsm\nal\nls\nca\nle\nX\n3:\nC\non\ntr\nol\nvi\na\nou\ntp\nut\nX\n3:\nC\non\ntr\nol\nby\nou\ntp\nut\nm\nea\nsu\nre\ns\nC\n2.\n1:\nPu\nt\nlik\ne\nw\nit\nh\nlik\ne\nby\npu\nrp\nos\ne\nU\n2:\nPl\nur\nif\nro\nm\nst\nru\nct\nur\nes\nN\n2:\nPr\nef\ner\nm\nan\nag\ner\nia\nl\nsk\nill\ns\nF2\nal\nlo\nw\nch\noi\nce\nA\n2:\nIn\nd\nep\nen\nd\nen\nt\nbu\nre\nau\ncr\nac\ny\nF2\n:\nC\non\nte\nst\nab\nili\nty\nM\n2:\nM\nul\nti\nso\nur\nce\nsu\npp\nly\nO\n1:\nC\non\ntr\nac\nt\nou\nt\nU\n2:\nH\nav\ne\npl\nur\nif\nor\nm\nst\nru\nct\nur\ne\nX\n2:\nC\non\ntr\nol\nby\nou\ntp\nut\n150 MARTIN LODGE AND DEREK GILL\nChanging PSBs?\nPSBs are defined as the explicit and implicit rules and understandings\nregarding duties and expectations between public servants and the wider\npolitical system (Hood and Lodge 2006, 6). In this section, the focus is on\nthe PSB as applied to top bureaucrats, the chief executives, in ministerial\ndepartments. We explore PSB-related questions in terms of rewards (who\ngets what, when, and how), competency (what skills and competencies are\nexpected), and loyalty (to whom or what are public servants loyal).\nLooking at these key dimensions of any PSB for top bureaucrats, some\nkey features in terms of the age of NPM and the age of post-NPM stand\nout. The key differences lie in the competency dimension: Whereas an\nNPM-type PSB emphasizes the importance of “delivery” within any one\norganization (justified by the idea of “focus” and “specialization”), the\nunderlying competency ideas represented in the post-NPM literatures\nstress the importance of boundary spanning and collaboration. Public\nservices are said to require complex solutions to complex problems by\ndrawing on the offerings of highly complex and quickly developing tech-\nnologies. Therefore, competency becomes the knowledge to access and\nbring together expertise. Similarly, in terms of loyalty, the argument of a\n“re-Weberianization” of public administration has been advanced. A\ngrowing emphasis on “ethics” and “rules” is said to have replaced an\nNPM emphasis on “setting managers free to manage.” Finally, in terms of\nreward, post-NPM is expected to lead to a reduction in the extent to which\nperformance pay is provided overall and in the way it is being distributed,\nin particular moving away from individualized to more team-based incen-\ntive systems. The key PSB aspects are summarized in Table 5.\nThe empirical evidence for this section builds primarily on a series of\ninterviews (n = 22) with present and former public servants and other key\nTABLE 5\nChanging Emphases in Public Service Bargains\nNPM-Age PSB Post-NPM-Age PSB\nReward Emphasis on rivalry,\nindividualized\nperformance pay\nPullback of “hard edges” of\nperformance pay, emphasis on\ncollaboration\/team-based incentives\nCompetency Emphasis on delivery\nand getting things\ndone\nEmphasis on boundary spanning as\npart of “whole of government”\nactivities, ability to understand and\nprocure intelligent technical systems\nfor “joined-up” solutions\nLoyalty Executing set targets\/\nagreements within\ndiscretionary space\nCodification of rules\/ethics,\nstrengthening emphasis on\n“judge-type” character of public\nservice\nNPM, New Public Management; PSB, Public Service Bargains.\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 151\npolitical participants and observers of the PSB that one of the authors\nconducted in Wellington between November and December 2008.6 These\ninterviews were conducted under “Chatham House” rules (i.e., nonattrib-\nutability). Interviewees were selected on the basis of their representative-\nness for particular aspects of the PSB, allowing for insights from policy\nand operational administrative units, as well as from different “genera-\ntions” of chief executives and others.\nA seminal characterization of the PSB that traditionally applied to\nsenior public servants in New Zealand (under the 1912 Public Service Act)\nstates:\nWith the political parties the modern [New Zealand] civil service has struck a\nmutually beneficial bargain. By guaranteeing to public servants a life’s career\nand a pension, parties have foresworn the use of patronage and have guaranteed\nto the state’s employees their tenure of their jobs. In return the parties expect,\nand the public servants owe, equal loyalty to any government which the people\nhave placed in office. (Lipson 1948, 479)\nThe 1988 State Sector Act (especially in combination with the 1989\nPublic Finance Act) introduced core changes to the traditional PSB (as\nnoted above) for public servants in ministerial departments generally and\nchief executives in particular.7 One departure was the end of the career\nmodel and the introduction of higher and more flexible pay for specific\npositions in exchange for “performance” as evaluated by the State Services\nCommissioner. Related, more explicit competency demands were added\nto emphasize bureaucratic responsiveness: Chief executives were respon-\nsible for delivering on explicit performance expectations (and in doing so\nwere freed from the Public Service Manual and other input controls). The\nseparation between primarily policy departments and operational agen-\ncies was to facilitate a “specialization” effect between those chief execu-\ntives (and their departments) concentrating on “policy advice” and those\nfocusing on “service delivery and regulation.”\nLoyalty, in contrast, remained “serial”: Chief executives were to serve\nloyally the government of the day. Chief executive appointment and per-\nformance review processes were conducted by the State Services Commis-\nsioner on behalf of ministers. Thus, far from being a “managerial”\nrelationship in which ministers set performance targets and managers\nwere directed to achieve them, the relationship in New Zealand involved\na ménage-à-trois in which one party had a statutory trustee position in\nsafeguarding PSBs. There has been no demand for the “politicization” of\nappointments. Indeed, the State Services Commissioner has been\nappointed to conduct the selection of chief executives of departments\noutside the public service including the NZ Defence Forces and other\nsecurity agencies. The removal in 2000 of the so-called “face does not fit”\nclause in chief executive performance agreements, which previously had\nallowed ministers to ask for a removal of a chief executive, required the\nState Service Commissioner to perform some fancy footwork between the\ndifferent parties in case of irreconcilable differences.\n152 MARTIN LODGE AND DEREK GILL\nIn other words, in the late 1980s New Zealand moved to something\nresembling the ideal-type NPM-type PSB as outlined above. Performance\nwas supposedly incentivized through a significant performance element\nas part of total remuneration and the end of tenure, and through an\nincreased focus on organizational performance rather than policy advice.\nHowever, the continued strong emphasis on protecting serial loyalty pro-\nvided an important counterbalance to the idea of a “pure” NPM-type PSB.\nBut how did this PSB perform over the following two decades?\nOn the reward dimension, the key aspect of the post-1988 PSB, namely,\nthat security had been exchanged for private sector-type salaries, was\nnever fulfilled. Although salary levels remained “comfortable,” the link\nbetween private sector chief executive pay and chief executive pay was\nnever achieved. This led, in 1997, to a change in official policy, namely, that\nsalaries were to follow that of chief executives in the wider public sector\n(SSC 1997a). Subsequently, salaries climbed steadily, in particular for the\n“bigger” departments, leaving behind “smaller” departments with less\nthan 50 staff such as Women’s Affairs and Pacific & Island Affairs. This\nmarked to some extent a departure from earlier conventions of chief\nexecutive pay being relatively tightly clustered (see Gregory 2003b). Some\ninterviewees even suggested pay levels (and performance payments) were\nnot significant motivators: “I can remember one chief executive saying that\nhe did not want more money” (I14\/11).\nThe performance management aspect of the reward side of the PSB\nremained difficult to operate (see Lonti and Gregory 2007). One change\nthat broadly followed the expectations of a move to a post-NPM age\nwas increased talk about the importance of incentivizing outcomes and\nnot merely outputs (that were accused of generating a silo mentality).\nThese demands were reflected in the dropping of formal “performance\nagreements” between ministers and chief executives, the move from\nhard-edged contractualism of purchase agreements to softer-edged\nrelationships involved in output plans, as well as the introduction of\n“Statements of Intent.” This represented a change in the PSB for chief\nexecutives (see Baehler 2003) but maintained the NPM-related emphasis\non outputs\/outcomes established by the Public Finance Act 1989.8\nObservers noted that attempts at measuring outcomes failed to get\ntraction (Gill 2008), and some interviewees bemoaned the continued reli-\nance on output measures. The SSC performance evaluations downplayed\nex post performance reporting and increased the emphasis on feedback\nfrom 10 to 20 internal and external “stakeholders” to complement the\nminister’s views. Nevertheless, the relationship with the minister\nremained central: “[T]hey get 10–20 references, what matters is the view of\nthe minister” (I14\/11); “you either have the confidence of the minister or\nnot” (I12\/12a). One chief executive suggested that “if you make one big\nmistake, but [otherwise] performed beautifully and did something really\ninnovative, you’d still end up without your bonus” (I14\/11), while a\nfurther chief executive noted: “[I]f you perform, you get a certain amount.\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 153\nIf you perform exceptionally, you get a little bit more. If you perform badly,\nyou get a little bit less. But it really doesn’t make a difference” (I12\/12b).\nAnother chief executive argued that the output specifications were mean-\ningless because of an inability to control any of the inputs that affected the\norganization (I16\/12). In addition to the widely held view that the effects\nof performance pay and the end to tenure had hardly impacted on behav-\nior, one interviewee pointed to the administrative difficulty of devising\noutcome-oriented performance indicators. The continued reliance on an\noutput-oriented system “means if you don’t do what it is I want you to do,\nI can do something about you” but also provided for a “kind of straight-\nline accountability stuff that doesn’t work” and prevented “whole of\ngovernment” outcomes (I12\/12a).\nIn short, salaries had increased to reflect greater output-related risks,\nbut the system had neither moved toward a fully blown NPM-type reward\nunderstanding of substantial variable pay at a significant level nor moved\ntoward the post-NPM themes of incentivizing outcomes and collaboration\ndespite some official announcements.\nOn the competency side, the demand, since the early 2000s, for\nincreased attention toward “whole of government” collaborative work\ncould be interpreted as a shift toward post-NPM. Demands for boundary-\nspanning capacity were not only reflected in the typical justification that\n“increased policy complexity” but also required a move beyond a “silo\nmentality.” More widely, it could be seen as a result of the demands of\ncoalition government (namely, understanding and supporting the negoti-\nated solutions among politicians). Furthermore, the incoming Labour gov-\nernment of 1999 suspected an incapability, especially among Treasury\nstaff, to adjust advice to the preferences of a center-left party. It also\naccused public servants of showing too little creativity in illustrating how\noptions could be made to work rather than in developing “all reasons you\nshouldn’t do it” (I2\/12a). At the same time, public servants bemoaned a\nlack of willingness among politicians to rely on their expert and sage\nadvice. In contrast, others accused top bureaucrats for having too keenly\naccommodated their political “masters” in terms of delivering too politi-\ncally attuned advice, thereby compromising on their capacity to act as\n“free and frank” policy advisors and reality checkers (I2\/12c; I24\/11;\nI2\/12b).\nThe “sage” competency to advise on policy strategies remained at the\nheart of competency understandings, and it was the problem of how to\n“measure” policy advice that was also at the heart of a series of working\ngroups (Gregory and Lonti 2008). One former chief executive suggested a\nkey competency was to brief the minister during the (three-floor) lift\njourney from the ministerial to the prime ministerial office (I17\/11) in\nParliament (the “Beehive”). Equally, others saw their primary role as being\na “sage,” namely, to be aware of political context and to be able to engage\nministers with their department’s advice (I14\/11). Such abilities were also\nemphasized by those working within “operational departments.” Here,\n154 MARTIN LODGE AND DEREK GILL\none of the key problems diagnosed was that certain chief executives had\neither lacked or misunderstood the implicit but required “sage” compe-\ntencies, focusing more on their official competency requirements as\n“deliverers,” for example, of child protection. As one chief executive\nnoted, “you take a lot of risk, and it’s not the risk on your performance, it’s\nthe rest of the stuff [the managing of the political context], which is where\nending up stressed comes from” (I12\/12a).\nAnd even those who suggested that collaboration had become more\nimportant pointed to these ideas’ modest success: “[T]he focus of the last\ndecade has been co-ordination, co-operation and collaboration . . . I liken\nthat to learning to play nicely in the sandpit together . . . not kick sand in\neach other’s eyes . . . [now we need to] not play nicely but [learn to] play\ntogether” (I2\/12). In other words, as in the case of the reward dimension,\nthe competency dimension of the PSB was sharpened at the edges, first of\nall with a growing emphasis on “delivering outputs” (thereby following\nan NPM-type PSB), but what remained at the heart of competency\nrequirements was the traditional top bureaucratic competency of being a\nsage, even with the increase in political advisor numbers (Eichbaum and\nShaw 2007a, 2007b). Thus, the shift from the widely hailed “output pro-\nduction” to a collaborative “outcome management” was only limited.\nFinally, in terms of loyalty, developments from an NPM to a post-NPM\nbargain would be indicated by a move from an “executive” understanding\nin which public servants were given a zone of discretion to perform to an\nincreasingly codified relationship between politics and administration.\nAgain, the developments over the past decade and a half were somewhat\nmore complex. For one, policy-oriented departments in particular contin-\nued to rely on a considerable “partner” component in the PSB (an\nexchange relationship between the civil servant’s right to be heard and\ntrusted for the politician’s right to expect not to be politically embarrassed\nor surprised). It was this partner role that was said to have become increas-\ningly under challenge. One former chief executive put it like this: “[I]f they\nthink you are going to say something they don’t want, they make sure that\nyou’re not in the room” (I4\/12).\nFollowing more than a decade of Treasury dominance, the incoming\nLabour government of 1999 sought to make an explicit break with the past\ndecade. Politicians dismissed the quality of advice they had received from\nthe civil service and enhanced policy and political advice functions were\nsituated in ministerial offices. One key example of a powerful political\nadvisor was the former Labour prime minister’s chief of staff, Heather\nSimpson. Others saw political advisors as potentially helpful; they were\nseen as a result of a functional differentiation that required “political\nservants” to undertake the explicitly political coalition negotiations that an\n“apolitical” public service could not pursue (I25\/11; see also Eichbaum\nand Shaw 2007a, 2007b, who point to largely positive appreciation of the\nrole of political advisors). In addition, the potential consequences of\nfreedom of information under the 1982 Official Information Act meant that\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 155\npoliticians were widely accused of refusing “free and frank” advice that\ncould embarrass them in the media headlights at a later time: “[T]hey did\nnot want to see a Cabinet paper with which they did not agree” (I4\/12).\nWhile therefore some chief executives saw their main role as providing\ntheir minister with strategic “free and frank” advice and being in a\n“partner” role, others saw a change in their role toward an executive-type\n“do as you are told” understanding: “[T]hey expect obedience” (I25\/11).\nIt was, however, not just the presumed partner role that was under\nstrain but also the (NPM-related) “executive” understanding that politi-\ncians would grant their chief executives discretion to deliver outputs.\nConcepts drawn from agency theory of contractualized relations proved\novercomplex, insufficiently adaptable, and unenforceable: “[I]f I had gone,\ntold my Minister that I was about to sue the head of one of our agencies for\nnon-performance of their contract, I would have rapidly found that I was\non my own and I’d be renegotiating my own [contract]” (I4\/12). Further-\nmore, the other prerequisite of an executive-type understanding of\nloyalty—being provided with the sufficient resources to deliver the\nrequested outputs—was also said to have come under strain with politi-\ncians being accused of rejecting advice on the potential implications of\nresource constraints. Subsequent publicized failures and further inquiries\ninto departmental “misconduct” led to chief executives falling on their\nsword as no “smoking gun” evidence was produced. Finally, delivering\nwell on agreed outputs was hardly a guarantee for continued employ-\nment, especially if “the face didn’t fit.”9\nThe menage-à-trois arrangement also witnessed considerable strain. In\nparticular, it was argued that the SSC had not upheld its trustee role.\nInstead, the SSC was accused of too quickly following ministerial calls for\nan “inquiry” and thereby showing insufficient backbone to stand up to\nministerial demands for sackings. This led some to suggest that chief\nexecutives were being cheated: “because a number of CEs were held up\nand publicly given a telling off and then resigned for things that weren’t\n100 per cent clear from outside that it had been their fault” (I12\/12).\nOthers, however, pointed to the inherent problems in operating such an\narrangement per se, thereby questioning whether the SSC could positively\ncontribute to solving issues in the relationship between ministers and\nchief executives: “having the SSC come in is like having a marriage coun-\nselor in the bedroom, it takes away the magic” (I17\/11).\nTherefore, the different loyalty understandings, namely, those of being\na “partner” to the minister and that of being an “executive” to deliver on\nagreed outputs that became more prominent after 1988, were under con-\nsiderable strain. However, they were not under the sort of strain or dis-\nplayed the sort of dynamic that would be predicted by those diagnosing\nthe rise of post-NPM. If these two trends are solely about the thickening of\nethics and procedural guidelines, then despite some attempts by the SSC\n(in 2004 its mandate was extended to include integrity and conduct\nbeyond the public service department to include most of the wider state\n156 MARTIN LODGE AND DEREK GILL\nsector), no “thickening” of the rules occurred regarding the minister–chief\nexecutive relationship.10 Instead, developments displayed a highly vulner-\nable set of understandings with considerable scope for cheating.\nIn sum, it is difficult to diagnose a uniform trend in the PSBs that applied\nto chief executives. Some of the initial reforms under the 1988 Act followed\nthe idea of an NPM-type PSB, in particular, in terms of competency and\nreward. However, the trustee role of the SSC and the strong emphasis\nplaced on “serial loyalism” point to strong countervailing forces. In later\nstages, all three PSB dimensions—reward, competency, and loyalty—came\nunder strain, none of which clearly following the trajectory diagnosed by\nadvocates of post-NPM despite some rhetorical commitment to greater\noutcome reward orientation and boundary-spanning\/collaborative com-\npetency. In the loyalty aspect in particular, there was little to suggest that\nearlier attempts at codification or commitment to “serial loyalism” had any\nimpact. Indeed, developments occurred usually as the result of ad hoc\nresponses to “political heat,” convenience, and blame avoidance (“[chief\nexecutives] are paid a shit load of money, so they can bloody start to earn the\nmoney,” I2\/12) rather than the consistent application of a set of doctrines.\nThe inherent tensions within the PSB were more likely to cause friction and\ndevelopments than the force of post-NPM-related ideas.\nChanging Doctrines? The Crown Entities Act 2004\nFinally, we turn to the Crown Entities Act 2004.11 The Crown Entities Bill\nwas introduced as part of an omnibus public management amendment bill\nthat also included changes in the State Sector Act and the Public Finance\nAct.12 For Boston and Eichbaum (2007, 162), the legislative package includ-\ning this Act represented a key indicator of a wider shift in administrative\nreform doctrines, namely, toward a post-NPM Phase 2 of reform that had\ncome about from the “rupture” of the election victory of the Labour\ngovernment in 1999. Indeed, the introduction of a unified umbrella gov-\nernance and accountability statute for arm’s-length public bodies, created\nby NPM “fragmentation,” would seem to fit the bill for a post-NPM\ndevelopment. This section probes deeper into the process of Crown Enti-\nties Reform; it asks whether the diagnosed problems were related to\ncontinued problems that previous (NPM) reforms were supposed to have\nsolved or whether the problems were associated with previous reforms\ndirectly. In addition, this section asks whether the applied solutions were\ndirectly influenced by post-NPM doctrines.\nNonministerial or indirect administration had been a long-standing\nfeature of New Zealand public administration, as it is in most OECD\ncountries. Together with the various entities that had been created as part\nof the reforms of the late 1980s and early 1990s (40% of Crown Entities\nwere established in the reforms after the 1984 election), this created the\nperception of a cumbersome and confusing plethora of organizations that\nhad been established in an ad hoc fashion. Apart from statutory and legal\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 157\nstanding and listing under the Public Finance Act (the notion of Crown\nEntity was a creature of accrual accounting requirements), Crown Entities\ndisplayed considerable diversity in terms of functions, size, forms, and\npowers. In addition, incidents throughout the 1990s focused political\nattention on these Crown Entities.13 These incidents offered convenient\nreference points for the incoming Labour-led government to state their\nintentions to provide for a different approach toward MoG questions.14\nThe incoming minority Labour\/Alliance coalition government (of\n1999) identified a reduction in fragmentation as one of a handful of stra-\ntegic priorities for the first term. Following the 2001 Review of the Centre,\nwhich advocated, as noted, an overall review of governance arrange-\nments, the government introduced an omnibus legislative package, which\nincluded the Crown Entities Act and amended the Public Finance Act and\nthe State Sector Act. Indeed, the SSC’s 2002 “Briefing to the Minister for\nState Services” included “Priority III: Resolve Crown Entity Governance”\n(22–23). The long title of the omnibus bill emphasized raising standards of\nethics and integrity, increased coordination, and reduced fragmentation.\nAll these themes are consistent with post-NPM.\nHowever, the emergence of the Crown Entities Act reflects more\ncomplex origins that do not fit easily into the post-NPM category. First of\nall, it is difficult to suggest that the diagnosed problems of a proliferation\nof “arm’s-length” government bodies were a direct result of the reforms of\nthe 1980s and 1990s. The New Zealand state sector had, since at least the\nSecond World War, been largely characterized by arm’s-length govern-\nment. By 1984, only 24% of public employees operated within departments\nof the public service. In other words, far from being a theme of the NPM\nage, the steady move toward arm’s-length government and away from a\nunified public service was long standing and well under way before the\nreforms of the late 1980s.\nFurthermore, the decision to introduce the Crown Entity legislation to\nclarify the locus of control at the organizational level and the proposed\nclassification of individual entities under that legislation was announced\nin November 1998 by the then National Party Minister of State Services.\nThe proposed reforms were defined as “system incompleteness” and\n“unfinished business” at the time—in many ways they were a set of\nsolutions waiting for the proverbial “window” to open. The core features\nof the legislation were all well developed prior to Labour taking office and\nwere presented to Cabinet for approval within the first year in office. The\nsubsequent Review of the Centre resulted in the addition of a “whole of\ngovernment” power to “direct” groups of Crown Entities, but the overall\nchanges reinforced the locus of control at the individual organizational\nlevel.\nMoreover, the granting of ministerial power to direct Crown Entities\nreflected long-standing tensions between demands for ministerial over-\nsight and demands for granting a degree of autonomy to arm’s-length\nbodies. This tension was resolved by defining the minister’s role in the\n158 MARTIN LODGE AND DEREK GILL\ndevelopment of organizational “statements of intent” and constraining the\npower of ministers to direct individual entities. Following the “Review of\nthe Centre,” the initial bill introduced a “whole of government” power to\n“direct” that applied to classes of crown entities but not to individual\nentities. On the surface, this could be seen as compatible with post-NPM-\nrelated ideas. However, the key motivation was not to compensate for the\nperception of an overfragmented state. Instead, this power was included\nto accommodate the political desire to be able to shape individual\norganizations.15\nFinally, the ethics dimension of the legislation reveals a more complex\nset of motivations than post-NPM-type accounts would allow for. Post-\nNPM accounts stress the role of thickened procedural and ethical guid-\nance in appointment matters in order to reduce the risk of patronage. On\nthe one hand, the legislative package accompanying the Crown Entities\nAct did include an extension of the mandate of the State Services Com-\nmissioner to set standards for almost all employees in the wider state\nsector through a code of conduct. On the other, the concern with improv-\ning standards did not extend to board appointments. Appointment to\ngovernment boards has long been the last bastion of patronage in New\nZealand public administration, and this predates the reforms of the 1980\nand 1990s. Despite receiving advice to introduce the “merit” requirement\nfor board appointment, this criterion was watered down by the Cabinet to\n“appropriate knowledge, skills and experience.” This was interpreted as\ngranting ministers wider discretion to allow for the appointment of “our”\npeople with appropriate political connections and understandings.\nIn short, the Crown Entities Act was neither a response to problems\ngenerated by NPM nor a result of an application of solutions influenced by\npost-NPM-type ideas. Rather, it was the New Zealand response to the\nenduring problem of arm’s-length government that predates NPM-related\npublic sector reform across OECD governments (Gill 2002). The Crown\nEntities Act can therefore best be seen as an attempt to deal with long-term\nissues and a case of “unfinished business.” It emerged as a response to\nlong-standing concerns in New Zealand central government rather than\nas a response to side effects generated by NPM-type reforms. When\nlooking at the key choices that characterized the Act, it is difficult to find\nany straightforward application of administrative doctrines that were\nguided by post-NPM-related ideas. More broadly, the argument that the\nage of post-NPM has witnessed reduced fragmentation needs to be quali-\nfied. Despite the rhetoric about reduced fragmentation, there has been no\nsignificant reduction in the number of state sector bodies in New Zealand\n(Gill 2006).\nConclusion\nThis article has advanced three issues. First, it has contributed to the\ndebate regarding the study of administrative reform themes by offering a\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 159\nmultimethodological perspective. Second, it has contributed to the litera-\nture on changing fashions in the practice and rhetoric of administrative\nreform. Third, it has contributed to the wider understanding of ongoing\ndevelopments in New Zealand, a case that continues to attract consider-\nable attention as a reform “outlier.” In this conclusion, we deal with each\nof these points in reverse order.\nFirst, the New Zealand story suggests that the argument of a diagnosed\nmega-trend, from NPM to post-NPM, is difficult to sustain. Across all\nthree sections, considerable evidence suggests an entrenchment of ideas\nthat were initially formalized in the late 1980s. Indeed, the supposedly\nNPM-related reforms were far more diverse and varied than is often\nstereotyped—especially when looking at the way in which PSBs were\n“lived” in the perceptions of high bureaucrats and other actors. For\nexample, the continued importance of serial loyalism for chief executives\n(despite the end of tenure) was something that is not widely associated\nwith the NPM literature. The reforms that have been widely associated\nwith post-NPM point to long-standing concerns in executive government\nrather than problems generated by NPM alone; in other words, rather than\n“pendulum swings,” we are observing a process of “layering” (as high-\nlighted in the institutional literature) that is driven by more varied pro-\ncesses than solely that of disappointment generated by NPM.\nAs noted, the diverse arguments put forward by the SSC, the events\nthat led to changed understandings across PSBs, as well as the ideas\nunderpinning the Crown Entities Act 2004 did not constitute a reversal of\nearlier reforms; rather, they built on existing reforms and moderated and\ndiversified particular aspects of these reforms, leading to a more complex\nand diversified MoG that hardly constituted a “paradigm.” In other\nwords, the extent of change in New Zealand has been one of degree, not\none of shifting paradigms. Despite the claims of a new post-NPM para-\ndigm (and its “public value” and DEG relatives), no one set of coherent\nand consistent administrative doctrines reigns in New Zealand. Even the\nage of NPM appears more diverse than often allowed (especially when\nviewed through the lens of PSBs), and the trend in the 2000s has most\ncertainly been one of diversification. The diagnosis of diversification is one\nthat is shared by other comparative studies on developments in executive\ngovernment: Hood and Lodge (2006, ch. 10) similarly diagnosed a trend\ntoward diversification in the United Kingdom and Germany and sug-\ngested that such trends would continue.\nSecond, in order to move the contribution of this article beyond the\nspecifics of the New Zealand case, one further objective has been to\nencourage wider insights by utilizing various methodologies, ranging\nfrom “textual analysis” to interviews to the analysis of a critical case to\nsuggest a comprehensive research approach toward administrative\nreform. We looked at different sites, ranging from overall MoG discus-\nsions to change in the PSBs at the top of ministerial departments, to\nchange in the wider public sector, namely Crown Entities. All of these\n160 MARTIN LODGE AND DEREK GILL\nmethods have their own limitations; nevertheless, we regard this as a\nuseful exercise that should encourage other scholars to complement\nand challenge our analysis on New Zealand, and, more importantly,\ncross-nationally.\nThird, concepts such as NPM or post-NPM are academic inventions to\nsummarize wider empirical developments. For concepts to make a useful\ncontribution to the worlds of research and practice, the literatures need to\ndo better in terms of clarifying arguments. This article has attempted to do\nso by going “back to basics,” by trying to identify some of the “essence”\nthat drives sets of doctrines, and then by exploring, through different\nmethodological lenses, the strength of claims made in the wider literature\nin the light of one critical case, New Zealand. We acknowledge that rival\ninterpretations exist and invite challenge, but would emphasize that for\nthis debate to advance, the debate has to take place on the paths explored\nhere, namely, a clear definition of phenomena and the utilization of mul-\ntiple methodologies. In short, if the literature wishes to continue to engage\nwith ambiguous terms, then it needs to do so in a more careful way to\nallow for some degree of empirical relevance.\nNotes\n1. Indeed, the authors suggest that DEG offers a “perhaps unique opportunity\nfor self-sustaining change” (Dunleavy et al. 2005, 467).\n2. http:\/\/www.ssc.govt.nz\/display\/document.asp?DocID=2776 (accessed\nMay 12, 2010).\n3. Dunleavy et al. (2005) confuse the nature of a working paper that reflects the\nview of an individual author with a more formal organizational view by the\nSSC (with no named author). We solely focus on those documents that put\nforward “policy advice” or represent organizational positions.\n4. The SSC unsuccessfully opposed the Treasury-led drive for the establish-\nment of state-owned enterprises in 1984–1985.\n5. The SSC issued a revised set of MoG principles after the 2008 election. It\nincluded an emphasis on reduced state sector fragmentation and reduced\nuse of restructuring. However, the underlying administrative doctrines did\nnot reflect any major change; for example, questions regarding the use of\narm’s-length bodies were to be treated on a case-by-case basis: “[T]here\nshould be no a priori preference for splitting or joining funding and services\ndelivery roles so long as potential conflicts of interest can be managed\nappropriately” (SSC 2008).\n6. The interview codes reflect the date on which the interview was being held.\nBar one exception (a telephone interview), interviews were held in person\nin Wellington. To protect anonymity, no departmental designations are\nprovided.\n7. More broadly, the reforms amounted to a shift “down grid\/down group” in\nthe sense of a reduced public service distinctiveness with each public service\ndepartment becoming the employer, the repeal of the public service manual\nin toto, and the abolition of the unified public service. In addition, appoint-\nments were opened up to the private sector and to nonnationals.\n8. The Statement of Intents were, by the late 2000s, widely regarded as little else\nthan “glossy and . . . public relations focused” exercises (Minister of Finance\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 161\nquoted in Gill 2008, 36) and the associated Managing for Outcomes initiative\nis widely regarded by practitioners as “missing in action” (Gill 2008, 34).\n9. Most prominently, the Christine Rankin case, where the chief executive,\nhighly successful according to a range of her performance measures, was\nadvised by the SSC that she would have to reapply for her position (in\ncompetition with others) rather than being appointed for a second term. She\ntook the government to court, leading to embarrassing revelations regarding\nstatements made concerning her dress sense. She lost the court case but is\nstill regarded as a primary example for the importance of appointing chief\nexecutives who understand “the rules of the game.”\n10. For example, a reciprocal “statement of expectations and commitment to the\nstate sector” between chief executives and ministers that was signed by both\nparties in March 2001 was not actively re-endorsed by ministers following\nfurther elections.\n11. Crown Entity is the New Zealand term for arm’s-length public bodies that\nare not ministerial departments, or state-owned enterprises, or offices of\nparliament. They are analogous to nondepartmental public bodies in the\nUnited Kingdom or to agencies in Sweden (Gill 2002).\n12. There were technical amendments to the Public Finance Act (PFA) including\nincorporating the Fiscal Responsibility Act, new specific legislation relating\nto Crown entities, and provisions to increase flexibility through mechanisms\nsuch as multiclass output expense appropriations. There were also small\nmodifications to the State Sector Act (SSA) on leadership development,\nextending the commissioner’s mandate in the wider state sector. Overall, the\nbroad principles and main provisions (of the PFA and the SSA) have sur-\nvived largely unaltered since 1989 (Gill 2010).\n13. Most prominently, the Tourism Board, the Fire Service Commission, the\nLottery Grants Commission, and the NZ Qualifications Authority. Incidents\nrelated to inappropriate payments, the political nature of appointments, as\nwell as a “confused” relationship between ministers and crown entities.\n14. More generally, organizational restructuring has been a continuous feature\nin New Zealand over the last two decades. For example, a survey by the\nEthics Resources Centre (2007) (commissioned by the SSC) suggested that\n48% of Crown Entity staff and 57% of departmental staff had experienced\nrestructuring over the previous two years.\n15. So far, politicians have used the “whole of government” direction only\nonce—to require complementary e-government standards.\nReferences\nAberbach, Joel D., and Tom Christensen. 2001. “Radical Reform in New Zealand.\nCrisis, Windows of Opportunity, and Rational Actors.” Public Administration 79\n(2): 403–422.\nAlford, John, and Owen Hughes. 2008. “Public Value Pragmatism as the New\nPhase of Public Management.” American Review of Public Administration 20 (10):\n1–19.\nAlford, John, and Janine O’Flynn. 2009. “Making Sense of Public Value.” Interna-\ntional Journal of Public Administration 32: 171–191.\nBaehler, Karen. 2003. “ ‘Managing for Outcomes’: Accountability and Thrust.”\nAustralian Journal of Public Administration 62 (4): 23–34.\nBhatta, Gambhir. 2003. “Post-NPM Themes in Public Sector Governance.” Working\nPaper No. 17, State Services Commission. <http:\/\/www.ssc.govt.nz\/upload\/\ndownloadable_files\/Post-NPM_Themes_In_Public_Sector_Governance.pdf>.\n(March 2009).\n162 MARTIN LODGE AND DEREK GILL\nBoston, Jonathan. 1987. “Transforming New Zealand’s Public Sector: Labour’s\nQuest for Improved Efficiency and Accountability.” Public Administration 65:\n423–442.\n———. 1992. “Assessing the Performance of Departmental Chief Executives: Per-\nspectives from New Zealand.” Public Administration 70: 405–428.\nBoston, Jonathan, and Chris Eichbaum. 2007. “State Sector Reform and Renewal in\nNew Zealand: Lessons for Governance.” In The Repositioning of Public Gover-\nnance, ed. Gerald Caiden and Tsai-Tsu Su. Taipei, Taiwan: Best-Wise Publishing\nCo.\nBoston, Jonathan, John Martin, June Pallot, and Pat Walsh. 1996. Public Manage-\nment: The New Zealand Model. Auckland: Oxford University Press.\nChapman, Jeff, and Grant Duncan. 2007. “Is There Now a New ‘New Zealand\nModel’?” Public Management Review 9 (1): 1–25.\nChristensen, Tom, and Per Laegreid. 2008. “NPM and beyond: Structure, Culture\nand Demography.” International Review of Administrative Sciences 74 (1):\n7–23.\nDunleavy, Patrick, Helen Margetts, Simon Bastow, and Jane Tinkler. 2005. “New\nPublic Management Is Dead—Long Live Digital-Era Governance.” Journal of\nPublic Administration Research and Theory 16: 467–494.\n———. 2006. Digital-Era Governance. Oxford: Oxford University Press.\nEichbaum, Chris, and Richard Shaw. 2007a. “Ministerial Advisors, Politicisation\nand the Retreat from Westminster.” Public Administration 85 (3): 609–640.\n———. 2007b. “Ministerial Advisers and the Politics of Policy-Making: Bureau-\ncratic Permanence and Popular Control.” Australian Journal of Public Adminis-\ntration 66 (4): 453–467.\nEthics Resources Centre. 2007. New Zealand State Services Ethics and Conduct Survey.\nSummary of Findings, State Services Commission.\nGill, Derek. 2002. “Signposting the Zoo: From Agencification to a More Principled\nChoice of Organisational Form.” OECD Journal of Budgeting 2 (1): 34–92.\n———. 2006. “By Accident or by Design—Changes in the Structure of the State in\nNew Zealand.” Policy Quarterly 2 (4): 27–32.\n———. 2008. “Managing Performance in New Zealand: The Search for the\nHoly Grail?” In Holy Grail or Achievable Quest: International Perspectives on\nPublic Sector Performance Management, ed. KPMG International. Canada: KPMG\nInternational.\n———. 2009. “Reform of Arm’s Length Government through the Crown Entities\nAct (2004)—the Drunk and the Lamp Post?” IPS Working Paper 09\/12, Victoria\nUniversity Wellington.\n———, ed. 2010. “The Iron Cage Recreated.” Institute for Policy Studies, Victoria\nUniversity Wellington.\nGoldfinch, Shaun. 1998. “Remaking New Zealand’s Economic Policy: Institutional\nElites as Radical Innovators 1984–1993.” Governance 11 (2): 177–207.\nGregory, Robert. 2003a. “All the King’s Horses and All the King’s Men: Putting\nNew Zealand’s Public Sector Back Together Again.” International Public Man-\nagement Review 4 (2): 41–58.\n———. 2003b. “New Zealand—the End of Egalitarianism.” In Rewards for High\nPublic Office, ed. Christopher Hood, B. Guy Peters, and Grace Lee. London:\nRoutledge.\nGregory, Robert, and Zsuzsanna Lonti. 2008. “Chasing Shadows? Performance\nMeasurement of Policy Advice in New Zealand Government Departments.”\nPublic Administration 86 (3): 837–856.\nHood, Christopher. 1990. “De-Sir Humphreying the Westminster Model of\nBureaucracy.” Governance 3: 205–216.\n———. 1991. “A Public Management for All Seasons?” Public Administration 63:\n3–19.\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 163\n———. 1994. Explaining Economic Policy Reversals. Buckingham: Open University\nPress.\n———. 2005. “Public Management: The Word, the Movement, the Science.” In\nOxford Handbook of Public Management, ed. Evan Ferlie, Laurence Lynn, and\nChristopher Pollitt. Oxford: Oxford University Press.\nHood, Christopher, and Michael Jackson. 1991. Administrative Argumentation.\nAldershot: Dartmouth.\nHood, Christopher, and Martin Lodge. 2006. Politics of Public Service Bargains:\nReward, Competency, Loyalty—and Blame. Oxford: Oxford University Press.\nHood, Christopher, and B. Guy Peters. 2004. “The Middle-Aging of New Public\nManagement.” Journal of Public Administration Research and Theory 14 (3): 267–\n282.\nLaegreid, Per, and Tom Christensen, eds. 2001. New Public Management. The Trans-\nformation of Ideas and Practice. Aldershot: Ashgate.\n———, eds. 2007a. Transcending the New Public Management. Aldershot: Ashgate.\n———. 2007b. “The Whole-of-Government Approach to Public Sector Reform.”\nPublic Administration Review 67 (6): 1059–1066.\nLipson, Leslie. 1948. The Politics of Equality. Chicago: Chicago University Press.\nLonti, Zsuzsanna, and Robert Gregory. 2007. “Accountability or Countability?\nPerformance Measurement in the New Zealand Public Sector, 1992–2002.”\nAustralian Journal of Public Administration 66 (4): 468–484.\nMinister of State Services. 1998. Public Services Strategic Management and Structures.\nReport to the Prime Minister dated 15 July 1998.\nNorman, Richard. 2003. Obedient Servants? Management Freedoms & Accountabilities\nin the New Zealand Public Sector. Wellington: Victoria University Press.\nNorman, Richard, and Robert Gregory. 2003. “Paradoxes and Pendulum Swings:\nPerformance Management in New Zealand’s Public Sector.” Australian Journal\nof Public Administration 62 (4): 35–49.\nO’Flynn, Janine. 2007. “From New Public Management to Public Value: Paradig-\nmatic Change and Managerial Implications.” Australian Journal of Public Admin-\nistration 66 (3): 353–366.\nOlsen, Johan P. 2008. “The Ups and Downs of Bureaucratic Organization.” Annual\nReview of Political Science 11: 13–37.\nPollitt, Christopher, and Geert Bouckaert. 2004. Public Management Reform. Oxford:\nOxford University Press.\nSchick, Allen. 1996. “The Spirit of Reform: Managing the New Zealand State Sector\nin a Time of Change.” Report for State Services Commission. <http:\/\/www.\nssc.govt.nz\/display\/document.asp?docid=2845>. (November 2009).\nScott, Graham. 2001. Public Sector Management in New Zealand. Wellington: New\nZealand Business Roundtable.\n———. 2008. “After the Reforms: Some Questions about the State of the State in\nNew Zealand.” Policy Quarterly 4 (3): 7–13.\nSSC. 1997a. Annual Report. Wellington: SSC.\n———. 1997b. “MoG Design Project—The Three Tier State Model.” Internal\nmemorandum.\n———. 1998. Organizational Design and the Wider State Sector, December 8.\n———. 1999. “Crown Entities: Organisational Design.” Appendices 3 & 6, Occa-\nsional Paper No. 21, September 1999. September 1999, ISBN 0-478-08974-0.\n<http:\/\/www.ssc.govt.nz\/display\/document.asp?docid=2815>. (November\n2009).\n———. 2002. “Briefing for the Minister of State Services.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=115&DocID=2868>. (November 2009).\n———. 2003a. “Review of the Centre: State Sector Human Resources Framework.”\n<http:\/\/www.ssc.govt.nz\/display\/document.asp?NavID=218&DocID=3304>.\n(November 2009).\n164 MARTIN LODGE AND DEREK GILL\n———. 2003b. “Reviews of the Ministry of Youth Affairs and the Ministry of\nWomen’s Affairs, 6 August 2003.” <http:\/\/www.ssc.govt.nz\/display\/\ndocument.asp?NavID=218&DocID=3342>. (November 2009).\n———. 2003c. “Transport Sector Review, 10 December 2003.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=218&DocID=4006>. (November 2009).\n———. 2004a. “Ministry of Defence and Emergency Management.” <http:\/\/\nwww.ssc.govt.nz\/display\/document.asp?NavID=218&DocID=4224>. (Decem-\nber 2009).\n———. 2004b. “Consolidation of Regulatory and Dispute Resolution on Services\nConcerned with Housing and Building, 30 June 2004.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=218&DocID=4028>. (November 2009).\n———. 2005a. “Briefing for the Minister of State Services.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=115&DocID=4842>. (November 2009).\n———. 2005b. “Education Sector Review, 18 July 2005.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=218&DocID=4626>. (November 2009).\n———. 2006. “Machinery of Government Arrangements for the Delivery of Youth\nand Families Services.” <http:\/\/www.ssc.govt.nz\/display\/document.asp?\nNavID=218&DocID=5260>. (November 2009).\n———. 2007a. “Briefing for the Minister of State Services.” <http:\/\/www.ssc.\ngovt.nz\/display\/document.asp?NavID=115&DocID=6307>. (November 2009).\n———. 2007b. “Reviewing Machinery of Government February 2007.” <http:\/\/\nwww.ssc.govt.nz\/display\/document.asp?docid=5747&pageno=7#P53-6259>.\n(November 2009).\n———. 2007c. “Next Steps in Land Transport Sector Review, 25 May 2007.”\n<http:\/\/www.ssc.govt.nz\/display\/document.asp?NavID=218&DocID=5918>.\n(November 2009).\n———. 2007d. “Establishing of the New Zealand Food Safety Authority as a Public\nService Department.” <http:\/\/www.ssc.govt.nz\/display\/document.asp?\nNavID=218&DocID=6004>. (November 2009).\n———. 2007e. “Review of the Costs and Benefits of Demerging Traffic Enforce-\nment from the Police, 30 July 2007.” <http:\/\/www.ssc.govt.nz\/display\/\ndocument.asp?NavID=218&DocID=6077>. (November 2009).\n———. 2008. “Vision and Principles for Machinery of Government.” December\n2008.\n———. nd. The Education Sector: Before and After 1989. Wellington: SSC.\nStoker, Gerry. 2006. “Public Value Management.” American Review of Public Admin-\nistration 36 (1): 41–57.\nWegrich, Kai. 2010. “Post New Public Management.” In Handbuch zur Verwaltung-\nsreform, ed. Bernhard Blanke. Wiesbaden: VS Verlag.\nWhitcombe, Judy. 2008. “Contributions and Challenges of ‘New Public Manage-\nment’: New Zealand since 1984.” Policy Quarterly 4 (3): 7–13.\nAppendix\nThis paper represents the collaboration between two researchers with\ndifferent backgrounds (practitioner and academic). One (Gill) has consid-\nerable experience as a senior public servant in New Zealand with direct\nresponsibility for leadership of public management issues and therefore\npolicy developments under consideration in this paper. The other (Lodge)\nhas a purely academic background in the subject. A number of key ethical\nand methodological issues arise from this collaboration. First, the analysis\ndoes not in any form reflect any official views represented by the New\nZealand government. Second, the actual work on this paper required some\nTOWARD A NEW ERA OF ADMINISTRATIVE REFORM? 165\nadjustments across all three sections: (1) In the section utilizing the\n“administrative argument,” the documents provided by the SSC were\nthose identified as critical by Gill from his experience in the SSC. Lodge\nand Gill independently coded the documents and then moderated the\nresults. (2) The section on “Public Service Bargains” utilizes interviews\nconducted by Lodge. As Gill was not part of the interviews, and inter-\nviewees were not aware that a former colleague would be involved in\nutilizing the interview material, the section was written by Lodge alone.\n(3) The Crown Entity Act work was led by Gill. He therefore has unique\ninsight into this episode, although, of course, there are particular biases\ndue to individual participation. We provide these comments not just to\nincrease transparency regarding this particular paper; this collaboration\nraises wider research ethics issues for collaborative projects that involve\nresearchers with practitioner and purely academic backgrounds that have\nrarely been discussed in the wider literature.\n166 MARTIN LODGE AND DEREK GILL\n"}