{"doi":null,"coreId":"10631","oai":"oai:eprints.gla.ac.uk:44801","identifiers":["oai:eprints.gla.ac.uk:44801",null],"title":"Orthogonal learning particle swarm optimization","authors":["Zhan, Z-H.","Zhang, J.","Li, Y.","Shi, Y-H."],"enrichments":{"references":[{"id":746427,"title":"A computationally efﬁcient evolutionary algorithm for real-parameter optimization,”","authors":[],"date":"2002","doi":"10.1162\/106365602760972767","raw":"K. Deb, A. Anand, and D. Joshi, “A computationally efﬁcient evolutionary algorithm for real-parameter optimization,” Evol. Comput., vol. 10, no. 4, pp. 371–395, 2002.","cites":null},{"id":730138,"title":"A cooperative approach to particle swarm optimization,”","authors":[],"date":"2004","doi":"10.1109\/ijcnn.2001.939004","raw":"F. van den Bergh and A. P. Engelbrecht, “A cooperative approach to particle swarm optimization,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 225–239, Jun. 2004.","cites":null},{"id":735106,"title":"A hybrid of genetic algorithm and particle swarm optimization for recurrent network design,”","authors":[],"date":"2004","doi":"10.1109\/icsmc.2004.1400674","raw":"C. F. Juang, “A hybrid of genetic algorithm and particle swarm optimization for recurrent network design,” IEEE Trans. Syst., Man, Cybern. B, vol. 34, no. 2, pp. 997–1006, Apr. 2004.","cites":null},{"id":732188,"title":"A modiﬁed particle swarm optimizer,” in","authors":[],"date":"1998","doi":"10.1109\/icec.1998.699146","raw":"Y. H. Shi and R. C. Eberhart, “A modiﬁed particle swarm optimizer,” in Proc. IEEE World Congr. Comput. Intell., 1998, pp. 69–73.","cites":null},{"id":18091877,"title":"A new optimizer using particle swarm theory,” in","authors":[],"date":"1995","doi":"10.1109\/mhs.1995.494215","raw":"R. C. Eberhart and J. Kennedy, “A new optimizer using particle swarm theory,” in Proc. 6th Int. Symp. Micromach. Human Sci., 1995, pp. 39– 43.","cites":null},{"id":738769,"title":"A niching particle swarm optimizer,” in","authors":[],"date":"2002","doi":"10.1109\/icsmc.2002.1176019","raw":"R. Brits, A. P. Engelbrecht, and F. van den Bergh, “A niching particle swarm optimizer,” in Proc. 4th Asia-Paciﬁc Conf. Simul. Evol. Learn., 2002, pp. 692–696.","cites":null},{"id":746428,"title":"A note on the extended Rosenbrock function,”","authors":[],"date":"2006","doi":"10.1162\/evco.2006.14.1.119","raw":"Y. W. Shang and Y. H. Qiu, “A note on the extended Rosenbrock function,” Evol. Comput., vol. 14, no. 1, pp. 119–126, 2006.This article has been accepted for inclusion in a future issue of this journal. Content is final as presented, with the exception of pagination. 16 IEEE TRANSACTIONS ON EVOLUTIONARY COMPUTATION","cites":null},{"id":746432,"title":"Adaptive differential evolution with optional external archive,”","authors":[],"date":"2009","doi":"10.1109\/TEVC.2009.2014613","raw":"J. Q. Zhang and A. C. Sanderson, “JADE: Adaptive differential evolution with optional external archive,” IEEE Trans. Evol. Comput., vol. 13, no. 5, pp. 945–958, Oct. 2009. Zhi-Hui Zhan (S’09) received the Bachelors degree in computer science and technology from Sun YatSen University, Guangzhou, China, in 2007, where he is currently working toward the Ph.D. degree. His current research interests include particle swarm optimization, ant colony optimization, genetic algorithms, differential evolution, and their applications in real-world problems. Jun Zhang (M’02–SM’08) received the Ph.D. degree in electrical engineering from the City University of Hong Kong, Kowloon, Hong Kong, in 2002. From 2003 to 2004, he was a Brain Korean 21 Post-Doctoral Fellow with the Department of Electrical Engineering and Computer Science, Korea Advanced Institute of Science and Technology, Daejeon, South Korea. Since 2004, he has been with Sun Yat-Sen University, Guangzhou, China, where he is currently a Professor and the Ph.D. Supervisor with the Department of Computer Science. He has authored seven research books and book chapters, and over 80 technical papers in his research areas. His research interests include computational intelligence, data mining, wireless sensor networks, operations research, and power electronic circuits. Dr. Zhang is currently an Associate Editor of the IEEE Transactions on IndustrialElectronics. He is the Chair of the IEEE Beijing (Guangzhou) Section Computational Intelligence Society Chapter. Yun Li (S’87–M’90) received the B.S. degree in radio electronics science from Sichuan University, Chengdu, China, in 1984, the M.Eng. degree in electronic engineering from the University of Electronic Science and Technology of China (UESTC), Chengdu, in 1987, and the Ph.D. degree in computing and control engineering from the University of Strathclyde, Glasgow, U.K., in 1990. From 1989 to 1990, he was with the U.K. National Engineering Laboratory and with Industrial Systems and Control Ltd., Glasgow. In 1991, he was a Lecturer with the University of Glasgow, Glasgow. In 2002, he was a Visiting Professor with Kumamoto University, Kumamoto, Japan. He is currently a Senior Lecturer with the University of Glasgow and a Visiting Professor with UESTC. In 1996, he independently invented the “indeﬁnite scattering matrix” theory, which opened up a ground-breaking way for microwave feedback circuit design. From 1987 to 1991, he carried out leading work in parallel processing for recursive ﬁltering and feedback control. In 1992, he achieved the ﬁrst symbolic computing for power electronic circuit design, without needing to invert any matrix, complex-numbered or not. In 1992, he pioneered into design automation of control systems and discovery of novel systems using evolutionary learning and intelligent search techniques. He established the IEEE Computer-Aided Control System Design Evolutionary Computation Working Group and the European Network of Excellence in Evolutionary Computing Workgroup on Systems, Control, and Drives in 1998. He has supervised 15 Ph.D. students in this area and has over 140 publications. Dr. Li is a Chartered Engineer, and a member of the Institution of Engineering and Technology. Yu-Hui Shi (SM’98) received the Ph.D. degree in electronic engineering from South-East University, Nanjing, China, in 1992. He is currently a Professor with the Department of Electrical and Electronic Engineering, Xi’an Jiaotong-Liverpool University, Suzhou, China. He is also the Director of the Research and Postgraduate Ofﬁce, Xi’an Jiaotong-Liverpool University. Before joining Xi’an Jiaotong-Liverpool University, he was with Electronic Data Systems Corporation, Indianapolis, IN. His current research interests include the areas of computational intelligence techniques (including swarm intelligence) and their applications. Dr. Shi is the Editor-in-Chief of the International Journal of Swarm Intelligence Research, and an Associate Editor of the IEEE Transactions on Evolutionary Computation. He is the Chair of the IEEE Chief Information Ofﬁcer Task Force on Swarm Intelligence.","cites":null},{"id":730140,"title":"Adaptive particle swarm optimization,”","authors":[],"date":"2009","doi":"10.1109\/tsmcb.2009.2015956","raw":"Z. H. Zhan, J. Zhang, Y. Li, and H. S. H. Chung, “Adaptive particle swarm optimization,” IEEE Trans. Syst., Man, Cybern. B, vol. 39, no. 6, pp. 1362–1381, Dec. 2009.","cites":null},{"id":18091884,"title":"An approach to multimodal biomedical image registration utilizing particle swarm optimization,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826068","raw":"M. P. Wachowiak, R. Smolikova, Y. F. Zheng, J. M. Zurada, and A. S. Elmaghraby, “An approach to multimodal biomedical image registration utilizing particle swarm optimization,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 289–301, Jun. 2004.","cites":null},{"id":741906,"title":"An enhanced genetic algorithm with orthogonal design,” in","authors":[],"date":"2006","doi":"10.1109\/cec.2006.1688711","raw":"X. M. Hu, J. Zhang, and J. H. Zhong, “An enhanced genetic algorithm with orthogonal design,” in Proc. IEEE Congr. Evol. Comput., 2006, pp. 3174–3181.","cites":null},{"id":735108,"title":"An investigation into mutation operators for particle swarm optimization,” in","authors":[],"date":"2006","doi":"10.1109\/cec.2006.1688424","raw":"P. S. Andrews, “An investigation into mutation operators for particle swarm optimization,” in Proc. IEEE Congr. Evol. Comput., 2006, pp. 1044–1051.","cites":null},{"id":738778,"title":"An orthogonal genetic algorithm for multimedia multicast routing,”","authors":[],"date":"1999","doi":"10.1109\/4235.752920","raw":"Q. Zhang and Y.-W. Leung, “An orthogonal genetic algorithm for multimedia multicast routing,” IEEE Trans. Evol. Comput., vol. 3, no. 1, pp. 53–62, Apr. 1999.","cites":null},{"id":741905,"title":"An orthogonal genetic algorithm with quantization for global numerical optimization,”","authors":[],"date":"2001","doi":"10.1109\/4235.910464","raw":"Y.-W. Leung and Y. Wang, “An orthogonal genetic algorithm with quantization for global numerical optimization,” IEEE Trans. Evol. Comput., vol. 5, no. 1, pp. 41–53, Feb. 2001.","cites":null},{"id":741908,"title":"An orthogonal simulated annealing algorithm for large ﬂoorplanning problems,”","authors":[],"date":"2004","doi":"10.1109\/TVLSI.2004.831464","raw":"S.-Y. Ho, S.-J. Ho, Y.-K. Lin, and W. C.-C. Chu, “An orthogonal simulated annealing algorithm for large ﬂoorplanning problems,” IEEE Trans. Very Large Scale Integr. Syst., vol. 12, no. 8, pp. 874–877, Aug. 2004.","cites":null},{"id":730139,"title":"Chinese Acad. Sci., Orthogonal Design (in Chinese).","authors":[],"date":"1975","doi":null,"raw":"Math. Stat. Res. Group, Chinese Acad. Sci., Orthogonal Design (in Chinese). Beijing, China: People Education Pub., 1975.","cites":null},{"id":735104,"title":"Comparing inertia weights and constriction factors in particle swarm optimization,” in","authors":[],"date":"2000","doi":"10.1109\/cec.2000.870279","raw":"R. C. Eberhart and Y. H. Shi, “Comparing inertia weights and constriction factors in particle swarm optimization,” in Proc. IEEE Congr. Evol. Comput., 2000, pp. 84–88.","cites":null},{"id":18091880,"title":"Comparison between genetic algorithms and particle swarm optimization,” in","authors":[],"date":"1998","doi":"10.1007\/bfb0040812","raw":"Y. H. Shi and R. C. Eberhart, “Comparison between genetic algorithms and particle swarm optimization,” in Proc. 7th Int. Conf. Evol. Program., LNCS 1447. Mar. 1998, pp. 611–616.","cites":null},{"id":746426,"title":"Completely derandomized selfadaptation in evolution strategies,”","authors":[],"date":"2001","doi":"10.1162\/106365601750190398","raw":"N. Hansen and A. Ostermeier, “Completely derandomized selfadaptation in evolution strategies,” Evol. Comput., vol. 9, no. 2, pp. 159–195, 2001.","cites":null},{"id":732187,"title":"Comprehensive learning particle swarm optimizer for global optimization of multimodal functions,”","authors":[],"date":"2006","doi":"10.1109\/tevc.2005.857610","raw":"J. J. Liang, A. K. Qin, P. N. Suganthan, and S. Baskar, “Comprehensive learning particle swarm optimizer for global optimization of multimodal functions,” IEEE Trans. Evol. Comput., vol. 10, no. 3, pp. 281–295, Jun. 2006.","cites":null},{"id":738774,"title":"Dynamic multi-swarm particle swarm optimizer,” in","authors":[],"date":"2005","doi":"10.1109\/sis.2005.1501611","raw":"J. J. Liang and P. N. Suganthan, “Dynamic multi-swarm particle swarm optimizer,” in Proc. Swarm Intell. Symp., Jun. 2005, pp. 124–129.","cites":null},{"id":741913,"title":"Dynamic task scheduling with load balancing using parallel orthogonal particle swarm optimization,”","authors":[],"date":"2009","doi":"10.1504\/IJBIC.2009.024726","raw":"S. N. Sivanandam and P. Visalakshi, “Dynamic task scheduling with load balancing using parallel orthogonal particle swarm optimization,” Int. J. Bio-Inspired Comput., vol. 1, no. 4, pp. 276–286, 2009.","cites":null},{"id":18091879,"title":"Evolutionary Computation: Toward a New Philosophy of Machine Intelligence.","authors":[],"date":"1995","doi":"10.1002\/(sici)1099-0526(199703\/04)2:4<28::aid-cplx7>3.0.co;2-2","raw":"D. B. Fogel, Evolutionary Computation: Toward a New Philosophy of Machine Intelligence. Piscataway, NJ: IEEE Press, 1995.","cites":null},{"id":741914,"title":"Evolutionary programming made faster,”","authors":[],"date":"1999","doi":"10.1109\/4235.771163","raw":"X. Yao, Y. Liu, and G. M. Lin, “Evolutionary programming made faster,” IEEE Trans. Evol. Comput., vol. 3, no. 2, pp. 82–102, Jul. 1999.","cites":null},{"id":738775,"title":"Fitness-distance-ratio based particle swarm optimization,” in","authors":[],"date":"2003","doi":"10.1109\/sis.2003.1202264","raw":"T. Peram, K. Veeramachaneni, and C. K. Mohan, “Fitness-distance-ratio based particle swarm optimization,” in Proc. Swarm Intell. Symp., 2003, pp. 174–181.","cites":null},{"id":730132,"title":"Handling multiple objectives with particle swarm optimization,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826067","raw":"C. A. C. Coello, G. T. Pulido, and M. S. Lechuga, “Handling multiple objectives with particle swarm optimization,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 256–279, Jun. 2004.","cites":null},{"id":746430,"title":"Hybrid estimation of distribution algorithm for global optimization,”","authors":[],"date":"2004","doi":"10.1108\/02644400410511864","raw":"Q. Zhang, J. Sun, E. Tsang, and J. Ford, “Hybrid estimation of distribution algorithm for global optimization,” Eng. Comput., vol. 21, no. 1, pp. 91–107, 2004.","cites":null},{"id":735107,"title":"Hybrid particle swarm optimizer with breeding and subpopulations,” in","authors":[],"date":"2001","doi":null,"raw":"M. Lovbjerg, T. K. Rasmussen, and T. Krink, “Hybrid particle swarm optimizer with breeding and subpopulations,” in Proc. Genet. Evol. Comput. Conf., 2001, pp. 469–476.","cites":null},{"id":741907,"title":"Intelligent evolutionary algorithms for large parameter optimization problems,”","authors":[],"date":"2004","doi":"10.1109\/TEVC.2004.835176","raw":"S.-Y. Ho, L.-S. Shu, and J.-H. Chen, “Intelligent evolutionary algorithms for large parameter optimization problems,” IEEE Trans. Evol. Comput., vol. 8, no. 6, pp. 522–541, Dec. 2004.","cites":null},{"id":18091885,"title":"Learning to play games using a PSO-based competitive learning approach,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826070","raw":"L. Messerschmidt and A. P. Engelbrecht, “Learning to play games using a PSO-based competitive learning approach,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 280–288, Jun. 2004.","cites":null},{"id":738771,"title":"Locating and tracking multiple dynamic optima by a particle swarm model using speciation,”","authors":[],"date":"2006","doi":"10.1109\/tevc.2005.859468","raw":"D. Parrott and X. D. Li, “Locating and tracking multiple dynamic optima by a particle swarm model using speciation,” IEEE Trans. Evol. Comput., vol. 10, no. 4, pp. 440–458, Aug. 2006.","cites":null},{"id":738770,"title":"Locating multiple optima using particle swarm optimization,”","authors":[],"date":"2007","doi":"10.1016\/j.amc.2006.12.066","raw":"R. Brits, A. P. Engelbrecht, and F. van den Bergh, “Locating multiple optima using particle swarm optimization,” Appl. Math. Comput., vol. 189, no. 2, pp. 1859–1883, Jun. 2007.","cites":null},{"id":738773,"title":"Multiobjective optimization using dynamic neighborhood particle swarm optimization,” in","authors":[],"date":"2002","doi":"10.1109\/cec.2002.1004494","raw":"X. Hu and R. C. Eberhart, “Multiobjective optimization using dynamic neighborhood particle swarm optimization,” in Proc. IEEE Congr. Evol. Comput., 2002, pp. 1677–1681.","cites":null},{"id":730136,"title":"Neighborhood topologies in fully informed and best-of-neighborhood particle swarm,”","authors":[],"date":"2006","doi":"10.1109\/tsmcc.2006.875410","raw":"J. Kennedy and R. Mendes, “Neighborhood topologies in fully informed and best-of-neighborhood particle swarm,” IEEE Trans. Syst., Man. Cybern. C, vol. 36, no. 4, pp. 515–519, Jul. 2006.","cites":null},{"id":741912,"title":"Novel orthogonal momentum-type particle swarm optimization applied to solve large parameter optimization problems,”","authors":[],"date":"2008","doi":"10.1155\/2008\/827401","raw":"J.-L. Liu and C.-C. Chang, “Novel orthogonal momentum-type particle swarm optimization applied to solve large parameter optimization problems,” J. Artif. Evol. Appl., vol. 1, pp. 1–9, Jan. 2008.","cites":null},{"id":730137,"title":"On the computation of all global minimizers through particle swarm optimization,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826076","raw":"K. E. Parsopoulos and M. N. Vrahatis, “On the computation of all global minimizers through particle swarm optimization,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 211–224, Jun. 2004.","cites":null},{"id":741911,"title":"OPSO: Orthogonal particle swarm optimization and its application to task assignment problems,”","authors":[],"date":"2008","doi":"10.1109\/TSMCA.2007.914796","raw":"S.-Y. Ho, H.-S. Lin, W.-H. Liauh, and S.-J. Ho, “OPSO: Orthogonal particle swarm optimization and its application to task assignment problems,” IEEE Trans. Syst., Man, Cybern. A, vol. 38, no. 2, pp. 288–298, Mar. 2008.","cites":null},{"id":741910,"title":"Orthogonal methods based ant colony search for solving continuous optimization problems,”","authors":[],"date":"2008","doi":"10.1007\/s11390-008-9111-5","raw":"X. M. Hu and J. Zhang, “Orthogonal methods based ant colony search for solving continuous optimization problems,” J. Comput. Sci. Technol., vol. 23, no. 1, pp. 2–18, Jan. 2008.","cites":null},{"id":741909,"title":"OSA: Orthogonal simulated annealing algorithm and its application to designing mixed H2\/H8 optimal controllers,”","authors":[],"date":"2004","doi":"10.1109\/TSMCA.2004.832834","raw":"S.-J. Ho, S.-Y. Ho, and L.-S. Shu, “OSA: Orthogonal simulated annealing algorithm and its application to designing mixed H2\/H8 optimal controllers,” IEEE Trans. Syst., Man, Cybern. A, vol. 34, no. 5, pp. 588–600, Sep. 2004.","cites":null},{"id":730131,"title":"Particle swarm optimization approaches to coevolve strategies for the iterated prisoner’s dilemma,”","authors":[],"date":"2005","doi":"10.1109\/tevc.2005.856202","raw":"N. Franken and A. P. Engelbrecht, “Particle swarm optimization approaches to coevolve strategies for the iterated prisoner’s dilemma,” IEEE Trans. Evol. comput., vol. 9, no. 6, pp. 562–579, Dec. 2005.","cites":null},{"id":18091876,"title":"Particle swarm optimization,” in","authors":[],"date":"1995","doi":"10.1109\/icnn.1995.488968","raw":"J. Kennedy and R. C. Eberhart, “Particle swarm optimization,” in Proc. IEEE Int. Conf. Neural Netw., vol. 4. 1995, pp. 1942–1948.This article has been accepted for inclusion in a future issue of this journal. Content is final as presented, with the exception of pagination. ZHAN et al.: ORTHOGONAL LEARNING PARTICLE SWARM OPTIMIZATION 15","cites":null},{"id":730133,"title":"Particle swarm optimization: An introduction and its recent developments,” in","authors":[],"date":"2007","doi":"10.1145\/1274000.1274118","raw":"X. D. Li and A. P. Engelbrecht, “Particle swarm optimization: An introduction and its recent developments,” in Proc. Conf. Genet. Evol. Comput., 2007, pp. 3391–3414.","cites":null},{"id":18091883,"title":"Particle swarm optimization: Basic concepts, variants and applications in power system,”","authors":[],"date":"2008","doi":"10.1109\/tevc.2007.896686","raw":"Y. del Valle, G. K. Venayagamoorthy, S. Mohagheghi, J. C. Hernandez, and R. G. Harley, “Particle swarm optimization: Basic concepts, variants and applications in power system,” IEEE Trans. Evol. Comput., vol. 12, no. 2, pp. 171–195, Apr. 2008.","cites":null},{"id":18091881,"title":"Particle swarm optimization: Developments, applications and resources,” in","authors":[],"date":"2001","doi":"10.1109\/cec.2001.934374","raw":"R. C. Eberhart and Y. H. Shi, “Particle swarm optimization: Developments, applications and resources,” in Proc. IEEE Congr. Evol. Comput., 2001, pp. 81–86.","cites":null},{"id":738772,"title":"Particle swarm optimizer with neighborhood operator,” in","authors":[],"date":"1999","doi":"10.1109\/sis.2005.1501611","raw":"P. N. Suganthan, “Particle swarm optimizer with neighborhood operator,” in Proc. IEEE Congr. Evol. Comput., 1999, pp. 1958–1962.","cites":null},{"id":746431,"title":"Performance evaluation of an advanced local search evolutionary algorithm,” in","authors":[],"date":"2005","doi":"10.1109\/cec.2005.1554903","raw":"A. Auger and N. Hansen, “Performance evaluation of an advanced local search evolutionary algorithm,” in Proc. IEEE Congr. Evol. Comput., 2005, pp. 1777–1784.","cites":null},{"id":730135,"title":"Population structure and particle swarm performance,” in","authors":[],"date":"2002","doi":"10.1109\/cec.2002.1004493","raw":"J. Kennedy and R. Mendes, “Population structure and particle swarm performance,” in Proc. IEEE Congr. Evol. Comput., 2002, pp. 1671– 1676.","cites":null},{"id":746429,"title":"Problem deﬁnitions and evaluation criteria for the CEC","authors":[],"date":"2005","doi":null,"raw":"P. N. Suganthan, N. Hansen, J. J. Liang, K. Deb, Y.-P. Chen, A. Auger, and S. Tiwari, “Problem deﬁnitions and evaluation criteria for the CEC 2005 special session on real-parameter optimization,” in Proc. IEEE Congr. Evol. Comput, 2005, pp. 1–50.","cites":null},{"id":18091882,"title":"Recent advances in particle swarm,” in","authors":[],"date":"2004","doi":"10.1109\/cec.2004.1330842","raw":"X. H. Hu, Y. H. Shi, and R. C. Eberhart, “Recent advances in particle swarm,” in Proc. IEEE Congr. Evol. Comput., 2004, pp. 90–97.","cites":null},{"id":735109,"title":"Self-organizing hierarchical particle swarm optimizer with time-varying acceleration coefﬁcients,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826071","raw":"A. Ratnaweera, S. Halgamuge, and H. Watson, “Self-organizing hierarchical particle swarm optimizer with time-varying acceleration coefﬁcients,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 240–255, Jun. 2004.","cites":null},{"id":730134,"title":"Small worlds and mega-minds: Effects of neighborhood topology on particle swarm performance,” in","authors":[],"date":"1999","doi":"10.1109\/cec.1999.785509","raw":"J. Kennedy, “Small worlds and mega-minds: Effects of neighborhood topology on particle swarm performance,” in Proc. IEEE Congr. Evol. Comput., 1999, pp. 1931–1938.","cites":null},{"id":738777,"title":"Stereotyping: Improving particle swarm performance with cluster analysis,” in","authors":[],"date":"2000","doi":"10.1109\/cec.2000.870832","raw":"J. Kennedy, “Stereotyping: Improving particle swarm performance with cluster analysis,” in Proc. Congr. Evol. Comput., 2000, pp. 1507–1512.","cites":null},{"id":18091878,"title":"Swarm Intelligence.","authors":[],"date":"2001","doi":"10.1016\/b978-155860595-4\/50007-3","raw":"J. Kennedy, R. C. Eberhart, and Y. H. Shi, Swarm Intelligence. San Mateo, CA: Morgan Kaufmann, 2001.","cites":null},{"id":738776,"title":"The fully informed particle swarm: Simpler, maybe better,”","authors":[],"date":"2004","doi":"10.1109\/tevc.2004.826074","raw":"R. Mendes, J. Kennedy, and J. Neves, “The fully informed particle swarm: Simpler, maybe better,” IEEE Trans. Evol. Comput., vol. 8, no. 3, pp. 204–210, Jun. 2004.","cites":null},{"id":732190,"title":"The particle swarm-explosion, stability and convergence in a multidimensional complex space,”","authors":[],"date":"2002","doi":"10.1109\/4235.985692","raw":"M. Clerc and J. Kennedy, “The particle swarm-explosion, stability and convergence in a multidimensional complex space,” IEEE Trans. Evol. Comput., vol. 6, no. 2, pp. 58–73, Feb. 2002.","cites":null},{"id":732189,"title":"The swarm and the queen: Toward a deterministic and adaptive particle swarm optimization,” in","authors":[],"date":"1999","doi":"10.1109\/cec.1999.785513","raw":"M. Clerc, “The swarm and the queen: Toward a deterministic and adaptive particle swarm optimization,” in Proc. IEEE Congr. Evol. Comput., 1999, pp. 1951–1957.","cites":null},{"id":735105,"title":"Using selection to improve particle swarm optimization,” in","authors":[],"date":"1998","doi":"10.1109\/icec.1998.699327","raw":"P. J. Angeline, “Using selection to improve particle swarm optimization,” in Proc. IEEE Congr. Evol. Comput., 1998, pp. 84–89.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Particle swarm optimization (PSO) relies on its\\ud\nlearning strategy to guide its search direction. Traditionally,\\ud\neach particle utilizes its historical best experience and its neighborhood’s\\ud\nbest experience through linear summation. Such a\\ud\nlearning strategy is easy to use, but is inefficient when searching\\ud\nin complex problem spaces. Hence, designing learning strategies\\ud\nthat can utilize previous search information (experience) more\\ud\nefficiently has become one of the most salient and active PSO\\ud\nresearch topics. In this paper, we proposes an orthogonal learning\\ud\n(OL) strategy for PSO to discover more useful information that\\ud\nlies in the above two experiences via orthogonal experimental\\ud\ndesign. We name this PSO as orthogonal learning particle swarm\\ud\noptimization (OLPSO). The OL strategy can guide particles to\\ud\nfly in better directions by constructing a much promising and\\ud\nefficient exemplar. The OL strategy can be applied to PSO with\\ud\nany topological structure. In this paper, it is applied to both global\\ud\nand local versions of PSO, yielding the OLPSO-G and OLPSOL\\ud\nalgorithms, respectively. This new learning strategy and the\\ud\nnew algorithms are tested on a set of 16 benchmark functions, and\\ud\nare compared with other PSO algorithms and some state of the\\ud\nart evolutionary algorithms. The experimental results illustrate\\ud\nthe effectiveness and efficiency of the proposed learning strategy\\ud\nand algorithms. The comparisons show that OLPSO significantly\\ud\nimproves the performance of PSO, offering faster global convergence,\\ud\nhigher solution quality, and stronger robustness","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.gla.ac.uk:44801<\/identifier><datestamp>\n      2016-08-25T11:30:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><dc:description>Particle swarm optimization (PSO) relies on its\\ud\nlearning strategy to guide its search direction. Traditionally,\\ud\neach particle utilizes its historical best experience and its neighborhood’s\\ud\nbest experience through linear summation. Such a\\ud\nlearning strategy is easy to use, but is inefficient when searching\\ud\nin complex problem spaces. Hence, designing learning strategies\\ud\nthat can utilize previous search information (experience) more\\ud\nefficiently has become one of the most salient and active PSO\\ud\nresearch topics. In this paper, we proposes an orthogonal learning\\ud\n(OL) strategy for PSO to discover more useful information that\\ud\nlies in the above two experiences via orthogonal experimental\\ud\ndesign. We name this PSO as orthogonal learning particle swarm\\ud\noptimization (OLPSO). The OL strategy can guide particles to\\ud\nfly in better directions by constructing a much promising and\\ud\nefficient exemplar. The OL strategy can be applied to PSO with\\ud\nany topological structure. In this paper, it is applied to both global\\ud\nand local versions of PSO, yielding the OLPSO-G and OLPSOL\\ud\nalgorithms, respectively. This new learning strategy and the\\ud\nnew algorithms are tested on a set of 16 benchmark functions, and\\ud\nare compared with other PSO algorithms and some state of the\\ud\nart evolutionary algorithms. The experimental results illustrate\\ud\nthe effectiveness and efficiency of the proposed learning strategy\\ud\nand algorithms. The comparisons show that OLPSO significantly\\ud\nimproves the performance of PSO, offering faster global convergence,\\ud\nhigher solution quality, and stronger robustness.<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/eprints.gla.ac.uk\/44801\/1\/44801.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>IEEE<\/dc:publisher><dc:source>1089-778X<\/dc:source><dc:title>Orthogonal learning particle swarm optimization<\/dc:title><rioxxterms:author>Zhan, Z-H.<\/rioxxterms:author><rioxxterms:author>Zhang, J.<\/rioxxterms:author><rioxxterms:author id=\"http:\/\/orcid.org\/0000-0002-6575-1839\" >Li, Y.<\/rioxxterms:author><rioxxterms:author>Shi, Y-H.<\/rioxxterms:author><rioxxterms:publication_date>2010<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1109\/TEVC.2010.2052054<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":[],"fullText":""}