{"doi":"10.1063\/1.1739293","coreId":"100597","oai":"oai:epubs.surrey.ac.uk:1","identifiers":["oai:epubs.surrey.ac.uk:1","10.1063\/1.1739293"],"title":"Synthesis and Physical Properties of Arc Melted NiMnSb","authors":["Gardelis, S","Androulakis, J","Migiakis, P","Giapintzakis, J","Clowes, S K","Bugoslavsky, Y","Branford, W R","Miyoshi, Y","Cohen, L F"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01","abstract":"<p>Several polycrystalline samples of the half-Heusler alloy NiMnSb were grown by arc melting of stoichiometric and nonstoichiometric amounts of high-purity constituent elements. The structure and the phase-purity of the prepared samples were examined systematically by powder x-ray diffraction. The transport properties of the best sample, with saturation magnetization M-s(5 K)=4 mu(B)\/formula unit, were studied by measuring electrical resistivity, thermal conductivity, and thermopower. Features in both magnetic and transport data are consistent with NiMnSb being in a half-metallic state at low temperatures, i.e., the conduction electrons are fully spin polarized. However, point-contact Andreev reflection measurements on the same sample at 4.2 K demonstrate only similar to45% spin polarization.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:epubs.surrey.ac.uk:1<\/identifier><datestamp>\n      2017-10-31T13:56:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1\/<\/dc:relation><dc:title>\n        Synthesis and Physical Properties of Arc Melted NiMnSb<\/dc:title><dc:creator>\n        Gardelis, S<\/dc:creator><dc:creator>\n        Androulakis, J<\/dc:creator><dc:creator>\n        Migiakis, P<\/dc:creator><dc:creator>\n        Giapintzakis, J<\/dc:creator><dc:creator>\n        Clowes, S K<\/dc:creator><dc:creator>\n        Bugoslavsky, Y<\/dc:creator><dc:creator>\n        Branford, W R<\/dc:creator><dc:creator>\n        Miyoshi, Y<\/dc:creator><dc:creator>\n        Cohen, L F<\/dc:creator><dc:description>\n        <p>Several polycrystalline samples of the half-Heusler alloy NiMnSb were grown by arc melting of stoichiometric and nonstoichiometric amounts of high-purity constituent elements. The structure and the phase-purity of the prepared samples were examined systematically by powder x-ray diffraction. The transport properties of the best sample, with saturation magnetization M-s(5 K)=4 mu(B)\/formula unit, were studied by measuring electrical resistivity, thermal conductivity, and thermopower. Features in both magnetic and transport data are consistent with NiMnSb being in a half-metallic state at low temperatures, i.e., the conduction electrons are fully spin polarized. However, point-contact Andreev reflection measurements on the same sample at 4.2 K demonstrate only similar to45% spin polarization.<\/p><\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:date>\n        2004-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gardelis, S, Androulakis, J, Migiakis, P, Giapintzakis, J, Clowes, S K, Bugoslavsky, Y, Branford, W R, Miyoshi, Y and Cohen, L F  (2004) Synthesis and Physical Properties of Arc Melted NiMnSb   Journal of Applied Physics, 95 (12).  pp. 8063-8068.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1739293<\/dc:relation><dc:relation>\n        10.1063\/1.1739293<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1\/","http:\/\/dx.doi.org\/10.1063\/1.1739293","10.1063\/1.1739293"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Synthesis and physical properties of arc melted NiMnSb\nS. Gardelis\nInstitute of Electronic Structure and Laser, Foundation for Research and Technology-Hellas, P.O. Box 1527,\nVasilika Vouton, 711 10 Heraklion, Greece and Department of Materials Science and Technology,\nUniversity of Crete, P.O. Box 2208, 710 03 Heraklion, Greece\nJ. Androulakis\nInstitute of Electronic Structure and Laser, Foundation for Research and Technology-Hellas, P.O. Box 1527,\nVasilika Vouton, 711 10 Heraklion, Greece\nP. Migiakis\nInstitute of Electronic Structure and Laser, Foundation for Research and Technology-Hellas, P.O. Box 1527,\nVasilika Vouton, 711 10 Heraklion, Greece and Department of Physics, University of Crete, P.O. Box\n2208, 710 03 Heraklion, Greece\nJ. Giapintzakisa)\nInstitute of Electronic Structure and Laser, Foundation for Research and Technology-Hellas, P.O. Box 1527,\nVasilika Vouton, 711 10 Heraklion, Greece and Department of Materials Science and Technology,\nUniversity of Crete, P.O. Box 2208, 710 03 Heraklion, Greece\nS. K. Clowes, Y. Bugoslavsky, W. R. Branford, Y. Miyoshi, and L. F. Cohen\nBlackett Laboratory, Imperial College, Prince Consort Road, London SW7 2BZ, United Kingdom\n~Received 22 October 2003; accepted 22 March 2004!\nSeveral polycrystalline samples of the half-Heusler alloy NiMnSb were grown by arc melting of\nstoichiometric and nonstoichiometric amounts of high-purity constituent elements. The structure\nand the phase-purity of the prepared samples were examined systematically by powder x-ray\ndiffraction. The transport properties of the best sample, with saturation magnetization M s(5 K)\n54 mB\/formula unit, were studied by measuring electrical resistivity, thermal conductivity, and\nthermopower. Features in both magnetic and transport data are consistent with NiMnSb being in a\nhalf-metallic state at low temperatures, i.e., the conduction electrons are fully spin polarized.\nHowever, point-contact Andreev reflection measurements on the same sample at 4.2 K demonstrate\nonly ;45% spin polarization. © 2004 American Institute of Physics. @DOI: 10.1063\/1.1739293#\nI. INTRODUCTION\nIn recent years a technology called spintronics has\nemerged, which offers the potential for advanced devices that\nwill combine spin-dependent effects arising from the spin of\nthe electron with standard microelectronics. The advantage\nof the electron spin carrying the information in semiconduc-\ntor devices, instead of the conventional electron charge, is\nthe possibility of nonvolatility, lower power consumption,\nincreased data processing speed, and increased integration\ndensities.1\nThe proposal by Datta and Das2 for a spin-based transis-\ntor has prompted a vigorous search for establishing electrical\nspin injection from metallic ferromagnetic films into semi-\nconductors. Recently, electrical spin injection from ferro-\nmagnetic permalloy thin films into a two-dimensional elec-\ntron gas semiconductor system has been demonstrated.3 The\nobserved effect was, however, less than 1% of its optimum\nmagnitude and persisted only up to 10 K. The inefficiency of\nelectrical spin injection has been attributed partly to the elec-\ntrical conductivity mismatch of the ferromagnetic metal and\nthe semiconductor4 and partly to the low spin polarization of\nthe permalloy ~only 35%!. It has been proposed that using\nmaterials with 100% spin polarization, e.g., half-metallic fer-\nromagnets, as spin injectors may enhance significantly the\nefficiency of the spin injection.4\nBand structure calculations predict that the ternary half-\nHeusler alloy NiMnSb should exhibit 100% spin polarization\nat the Fermi level.5 Due to its high Curie temperature (TC\n5730 K) and its close structural similarity to zinc blende\nsemiconductors, NiMnSb is suitable to be used as a spin\ninjection material in spintronics.\nNiMnSb crystallizes in the C 1b structure,5 which con-\nsists of four interpenetrating fcc lattices equally spaced along\nthe @111# direction. In the ordered alloy Ni occupies the lat-\ntice site at 000, Mn occupies the site at 1\/4 1\/4 1\/4, Sb\noccupies the site at 3\/4 3\/4 3\/4, and the site at 1\/2 1\/2 1\/2 is\nunoccupied. The magnetic properties are due to magnetic\nmoments localized at the Mn atoms, which interact via itin-\nerant electrons in the conduction band.6 It has been calcu-\nlated that 9 out of total 22 valence electrons are located in\nspin-down bands, and thus the total spin magnetic moment\nof NiMnSb becomes exactly 4.0mB .7\nA literature search reveals that only a limited number of\nstudies have focused on the physical properties of bulk\nNiMnSb samples addressing the alleged half metallicity of\nthis compound.8,9 In this article we report on the identifica-\na!Author to whom correspondence should be addressed; electronic mail:\ngiapintz@iesl.forth.gr\nJOURNAL OF APPLIED PHYSICS VOLUME 95, NUMBER 12 15 JUNE 2004\n80630021-8979\/2004\/95(12)\/8063\/6\/$22.00 © 2004 American Institute of Physics\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\ntion of synthesis\/annealing conditions for the preparation of\nsingle-phase NiMnSb ingots using arc melting as well as on\nthe structural, magnetic, and transport properties of these\nmaterials. Our measurements demonstrate that it is possible\nto produce good quality bulk NiMnSb using arc melting,\nwhich is a faster, and easier method compared to the other\ntechniques commonly used to grow bulk NiMnSb such as rf\nmelting10 and solid-state reaction.11\nII. EXPERIMENT\nVarious samples of NiMnSb were grown by arc melting\nand subjected to different postannealing treatments in order\nto identify the optimum conditions that result to stoichio-\nmetric single-phase samples. Ni ~99.999% pure!, Mn\n~99.999% pure!, and Sb ~99.995% pure! powders were\nweighted in a glove box under an Ar ~99.999% pure! atmo-\nsphere and mixed thoroughly using an agate mortar and\npestle. The resulted powders were pressed into pellets of 15\nmm in diameter. The pellets were then placed in a water-\ncooled copper crucible and arc melted in Ar atmosphere sev-\neral times in order to improve the uniformity of the samples.\nSpecimens were synthesized using stoichiometric amounts of\nNi, Mn, and Sb ~1:1:1! as well as 3% and 5% excess of Mn,\nand being subjected to postannealing treatment in vacuum.\nPrior to the annealing the specimens were wrapped with tan-\ntalum foil in order to avoid any undesired oxidation and were\nplaced in quartz tubes that were pumped down to a pressure\nof 531026 mbar. The quartz tubes were hermetically sealed\nand placed in a box furnace at 750 °C for several hours.\nPowder x-ray diffraction patterns were recorded using a\nRigaku ~RINT 2000! diffractometer with monochromatic\nCu Ka1 radiation. dc magnetization measurements were per-\nformed in a commercial extraction magnetometer at tempera-\ntures ranging from 5 to 300 K. The resistivity was measured\nwith the standard ac four-probe method in the temperature\nrange 5<T<275 K. Simultaneous thermal conductivity and\nthermopower measurements were performed in the tempera-\nture range 70–320 K using the steady-state method. The\nsamples were glued with GE varnish to a copper cold finger\nthat served as a heat sink. A small homemade manganin re-\nsistor heater was attached to the free end of the samples that\nserved as a heat source. The samples had rectangular paral-\nlelepiped shape with typical dimensions 4.535.531.5 mm3.\nSmall temperature differences ~;0.5 K! across the samples\nwere measured using two chromel-constantan ~type-E! ther-\nmocouples attached to two well-separated positions along the\nsample. The systematic error of thermal conductivity k(T)\ndue to the uncertainty in the measurement of the sample size\nand the distance between the thermocouples was estimated to\nbe 8%–10%. Seebeck voltages were detected using a pair of\n0.05 mm diameter copper wires attached to the samples with\nsilver paste at the same positions as the junctions of the\nthermocouples. The contribution of the copper leads to the\nmeasured Seebeck coefficient was carefully subtracted. Fi-\nnally, an estimate of the transport spin polarization (Pt) of\nthe samples was obtained by point-contact Andreev reflec-\ntion ~PCAR! measurements12 using a mechanically formed\nsuperconducting Nb tip. Conductance (dI\/dV) spectra were\nrecorded using a standard four-point configuration with an ac\nlock-in amplifier.\nIII. RESULTS AND DISCUSSION\nA. Structure\nThe powder x-ray diffraction ~XRD! spectra of all inves-\ntigated specimens exhibited mainly peaks corresponding to\nNiMnSb phase. However, an extra phase, which was always\nidentified as NiSb, appeared in the XRD patterns of all speci-\nmens and its relative abundance depended on the molar ratio\nof the starting powders and the postannealing treatment. The\nXRD patterns were numerically analyzed13 using a\nThomson–Cox–Hastings pseudo-Voigt function to describe\nthe peak shape. In this analysis, the NiSb phase was also\ntaken into consideration in addition to the NiMnSb phase and\nthe background was defined by linear interpolation through a\nnumber of selected background points. Table I summarizes\nthe results obtained from several NiMnSb specimens that\nwere prepared under different conditions.\nFigure 1~a! shows the XRD pattern of sample No. 1\ngrown by arc-melting five consecutive times stoichiometric\n~1:1:1! amounts of Ni, Mn, and Sb powders. It can be seen\nthat the NiSb-related peaks are pronounced in this case. Fol-\nlowing annealing in vacuum at 750 °C for 50 h, the intensity\nof the NiSb peaks decreased considerably ~sample No. 2 in\nTable I!. Further annealing under the same conditions for an\nadditional 22 h ~total annealing of 72 h! resulted in a reen-\nhancement of the intensity of the NiSb peaks ~sample No. 3\nin Table I!. Therefore, the annealing time seems to be a criti-\ncal parameter in obtaining good quality materials.\nIn specimens grown with 3% excess Mn, the percentage\nof the NiSb phase is reduced significantly to about 3% rela-\ntive to the NiMnSb phase ~sample No. 4 in Table I!. Anneal-\ning of these specimens in vacuum at 750 °C for 50 h al-\nthough improved the magnetic properties of the material did\nTABLE I. Growth conditions for several samples accompanied by the lattice\nconstant and percentage of NiSb phase determined from analyzed powder\nXRD spectra as well as the saturation magnetic moment at RT and 5 K in\nsome cases.\nSpecimen\nNo. Growth conditions\nLattice\nconstant\n~Å!\nNiSb\nphase\n~%!\nMagnetic\nmoment\n(mB)\n1 Ni:Mn:Sb ~1:1:1! arc\nmelted five times\n5.931 17 3.24 at RT\n2 Annealing of sample\nNo. 1 in vacuum at\n750 °C for 50 h\n5.927 5 3.49 at RT\n3.68 at 5 K\n3 Further annealing of\nsample No. 2 for 72 h\nunder the same\nconditions\n5.926 11 3.18 at RT\n4 3% Mn in excess, arc\nmelted five times\n5.936 3 3.5 at RT\n5 5% Mn in excess, arc\nmelted five times\n5.922 2 3.52 at RT\n6 Annealing of sample\nNo. 5 in vacuum at\n750 °C for 50 h\n5.921 ,2 3.60 at RT\n4.02 at 5 K\n8064 J. Appl. Phys., Vol. 95, No. 12, 15 June 2004 Gardelis et al.\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nnot result in any detectable change in the XRD patterns. On\nthe other hand, sample No. 6 grown with 5% excess Mn and\nannealed in vacuum for 50 h at 750 °C showed the best XRD\nspectrum @Fig. 1~b!#, i.e., the NiSb phase was reduced to less\nthan 2%. The room-temperature lattice constant of the best\nsample No. 6 was measured to be 5.921~1! Å, similar to the\nvalues reported previously by Szytuła et al.11 and Otto et al.6\nThe best samples are, thus, obtained using 5% excess Mn in\nthe initial powder mixture and postannealing the multiply\narc-melted pellets in vacuum at 750 °C for 50 h.\nB. Magnetic properties\nAs can be seen from Table I, the specimen that shows\nthe best XRD spectrum exhibits an integer saturation mag-\nnetic moment at 5 K @M s(5 K)54.0060.02 mB \/f.u.; Fig. 2#,\nas expected for a half-metallic ferromagnet. In general, it is\nfound that the presence of the NiSb phase in the material\nleads to a rapid decrease of the value of M s . The fact that we\nhave to use at least 3% excess Mn in order to concurrently\ndecrease the amount of NiSb present in the sample and im-\nprove its magnetic properties, implies that Mn is most likely\nconsumed faster than Ni and Sb during arc melting leading\nto the formation of the undesired NiSb phase.\nFigure 3 depicts the temperature dependence of the satu-\nration magnetization M S for specimen No. 6 obtained in a\nmagnetic field of 20 kOe. The magnetization data up to 200\nK can be fitted well, as shown by the solid line in Fig. 3~a!,\nto the Bloch law\nM S5M S~0 !~12AT3\/2!,\nwhere M S(0) is the extrapolated saturation magnetization at\n0 K, and A5131025 K23\/2. The same power-law tempera-\nture dependence of the magnetization has been observed pre-\nviously, however, only up to 70 K.8 It is noteworthy that the\npresent magnetization data follow the Bloch T3\/2-law up to\n200 K; this is consistent with the fact that the Bloch law\nshould hold only up to T;TC\/3 ~for NiMnSb, TC5720 K).\nHence, at low temperatures the system behaves like a\nHeisenberg ferromagnet as expected for a half-metal ferro-\nFIG. 1. X-ray diffraction pattern obtained from specimens: No. 1 ~a! and\nNo. 6 ~b!. In all graphs the first raw of vertical lines corresponds to peaks\nexpected for NiMnSb and the second raw corresponds to peaks expected for\nNiSb.\nFIG. 2. Field dependence of the magnetization for specimen No. 6 at 5 K.\nFIG. 3. Fit of the temperature dependence of the saturation magnetic mo-\nment M s (emu) for specimen No. 6 measured in an applied magnetic field of\n20 kOe in the temperature range: 5–200 ~a! and 200–300 K ~b!.\n8065J. Appl. Phys., Vol. 95, No. 12, 15 June 2004 Gardelis et al.\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nmagnet. Using the value of A that resulted from the fitting\nprocedure, the spin wave stiffness coefficient is calculated\naccording to the following expression:14\nA52.612~V\/S !~kB\/4pD !3\/2,\nwhere V is the volume per magnetic atom, S is the spin of the\nmagnetic atom, and kB is the Boltzmann coefficient. Taking\ninto account the fact that the magnetic moments are well\nlocalized at the Mn sites15 we have used as V and S the\nvolume and the spin of the Mn atom, respectively. Thus, for\nV52.3310224 cm3 and S55\/2, we find D5270 meV Å2.\nThis value for D is close to values reported previously. For\nexample, based on neutron diffraction data, D was calculated\nto be 320620 meV A2 at 25 K.9 Hordequin et al. deduced\n305640 meV Å2 from the T3\/2 temperature dependence of\nthe magnetization in the temperature range 4–70 K,9\nwhereas Otto et al. deduced a value of 350640 meV A2 from\nthe T3\/2 variation of the magnetization in the temperature\nrange 4–300 K.8 For temperatures above 200 K @see Fig.\n3~b!#, a different T dependence of the magnetization was\nfound, M S\n2;T2. It is noteworthy that such a power-law T\ndependence of the magnetization has been predicted to occur\nin itinerant ferromagnets due to spin fluctuations.16 At these\nhigh temperatures both spin bands most likely contribute to\ntransport and individual spin reversals can occur, i.e., Stoner\nexcitations modify the temperature dependence of the mag-\nnetization. Therefore, the magnetization results are consistent\nwith a crossover from a Heisenberg ferromagnet to an itin-\nerant ferromagnet at T;200 K.\nC. Transport properties\n1. Resistivity\nThe temperature dependence of the zero-field resistivity,\nr(T), for specimen No. 6 in the temperature range 5<T\n<275 K is shown in the inset of Fig. 4. A pronounced\nanomaly occurs in the r(T) curve in the temperature range\n70–120 K. For temperatures below 70 K, the resistivity has\nbeen fitted successfully to the expression\nr~T !5r01AT21BT9\/2,\nwith r058.6 mV cm, A52.9831024 mV cm\/K2 and B\n51.131029 mV cm\/K9\/2. The deduced value of the residual\nresistivity, r0 , is amongst the lowest values reported for\nNiMnSb to date.8,9 It is well known that a reliable indicator\nof sample purity is the residual resistivity ratio ~RRR!, i.e.,\nthe ratio of the resistivities at 300 and 0 K. For the present\nsample RRR;3 which is amongst the highest values re-\nported for NiMnSb.8,9 This value is still low compared to the\nvalues characterizing very pure samples, indicating the pres-\nence of a relatively large defect concentration in our samples.\nThe T9\/2 term is attributed to two-magnon scattering,17 which\nis expected to occur in half metals for which electrons of\nonly one spin direction exist at the Fermi level. The T2 term,\non the other hand, could be attributed either to one-magnon\nscattering or to electron–electron scattering that is present in\na Fermi liquid. The presence of the T9\/2 term naturally con-\nstraints us to ascribe the T2 term to the latter effect. It is\nnoteworthy that the value of the prefactor, A, of the T2 term\nfalls within the accepted range of values for electron–\nelectron scattering. In the main panel of Fig. 4, the contribu-\ntions of the two T-dependent terms, T2 and T9\/2, are shown\nseparately.\nAn equally satisfactory fit of the resistivity data up to 70\nK can also be obtained using the expression\nr~T !5r01AT2.5,\nwith r058.6 mV cm and A54.15310211 mV cm\/K2.5. Note\nthat such a power law for the resistivity has been observed\nalso in manganites.18,19 Auslender et al.18 associated the T2.5\nterm with the scattering of holes by magnons without spin\nflip, whereas Schiffer et al.19 suggested the T2.5 term as an\nempirical fit to the resistivity data representing a combina-\ntion of electron–electron, electron-phonon, and electron-\nmagnon scattering.\nIt is noteworthy to point out that another satisfactory fit\nof the resistivity data up to 70 K can also be obtained using\nthe expression\nr~T !5r01AT21BT5,\nwith r058.6 mV cm, A5331024 mV cm\/K2, and B51.2\n310210 mV cm\/K5. In this expression the T5 term is due to\nthe electron-acoustic phonon scattering process.20 However,\nit is well known that the T5 term is dominant at temperatures\nlower than 0.1QD;25– 30 K21 ~the Debye temperature, QD ,\nof NiMnSb is estimated to be between 250 and 300 K!.9\nBased on this fact it is concluded that the equation contain-\ning the T9\/2 term is more appropriate for describing the\npresent resistivity data.\nAt temperatures above 120 K, the resistivity is propor-\ntional to T1.55. Such a power law has not been associated\nwith any particular scattering process. However, it is note-\nworthy to mention that the deduced exponent ~1.55! is very\nclose to the exponent 5\/3, which describes the temperature\ndependence of the resistivity of spin fluctuation magnets.22\nWe propose, therefore, that our high-temperature resistivity\ndata indicate that the investigated sample behaves as an itin-\nerant ferromagnet consistently with the observed high-\ntemperature magnetization behavior mentioned earlier. Both\nthe change in the temperature dependence of the resistivity\nFIG. 4. Temperature dependence of the resistivity for specimen No. 6 in the\ntemperature range 5–60 K. The contributions of both T2 and T9\/2 terms are\nshown. The inset shows fits of the resistivity vs temperature curve for the\nlow- and high-temperature range.\n8066 J. Appl. Phys., Vol. 95, No. 12, 15 June 2004 Gardelis et al.\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nand the fact that value of the residual resistivity derived from\nfitting the high-temperature resistivity data (T.120 K) is\nhigher than the value of the residual resistivity derived from\nfitting the low-temperature data (T,70 K), are consistent\nwith the scenario that both spin bands contribute to transport\nabove ;100 K due to the opening of the spin-flip scattering\nchannel at these temperatures. Therefore, the resistivity re-\nsults are consistent with a crossover from a half-metallic-like\nbehavior at low temperatures to a normal itinerant behavior\nat high temperatures.\n2. Thermal conductivity\nFigure 5 shows the temperature dependence of the ther-\nmal conductivity, k, for specimen No. 6 in the temperature\nrange 70–320 K. In general, the total thermal conductivity of\nmagnetic metals comprises an electronic (ke), a lattice (k l),\nand a magnon (km) contribution\nk5ke1k l1km .\nIt is well known that for T>QD , the electronic contribution\ncan be derived from the electrical resistivity, r(T), using the\nWiedemann–Franz law\nke5\nL0T\nr~T ! ,\nwhere L0 is the Lorentz number. A comparison of ke with k\nat room temperature indicates that the electronic contribution\nto thermal conductivity is the most dominant among the con-\ntributions outlined above (ke \/k;85%). ~For this calcula-\ntion we used the typical value of the Lorenz number L0\n52.4531028 W V\/K2 which is valid for T.QD .)\nWhile above 200 K k(T) is nearly constant, below 200\nK it decreases linearly on cooling down to 150 K with a\npositive slope; this behavior is characteristic of\nintermetallics.23 However, below 150 K we observe that the\nthermal conductivity decreases with a slower rate. This\nchange of slope may be taken as an indication that at tem-\nperatures lower than 150 K the scattering of the carriers is\nreduced. This effect in k(T) along with the features observed\nin the temperature dependence of both the magnetization and\nresistivity, are consistent with a possible crossover from half-\nmetallic behavior to normal ferromagnetic behavior in the\ntemperature region 80–150 K.\n3. Thermopower\nThe temperature dependence of the Seebeck coefficient,\nS(T), for specimen No. 6 is shown in Fig. 6. The most\nremarkable feature in the data is the change from a small\nnegative to a small positive thermopower at ;200 K. The\nnegative value of S in the low temperature range indicates\nthat the dominant entropy carriers at the Fermi surface are\nelectrons whereas the positive value of S above 200 K indi-\ncates that the dominant entropy carriers are holes. The sign\nchange could be attributed either to the larger number of the\nthermally excited holes or due to the higher mobility of the\ncontributing holes. The small absolute value of the Seebeck\ncoefficient, uSu,2 mV\/K, indicates that the two types of car-\nriers are nearly compensated. The present temperature varia-\ntion of the Seebeck coefficient agrees well with previously\npublished data.9 It is noteworthy that the thermopower data\nin the range 70–200 K ‘‘disagree’’ with the low-field Hall\neffect data, which indicate that the dominant charge carriers\nare holes throughout the investigated temperature range (5\n,T,300 K).8,9 These seemingly contradictory results are\nprobably caused by the complex Fermi surface of NiMnSb,\nwhich in addition to three anisotropic hole sheets contains\nelectron-like parts as well as parts with open orbits.8\n4. Transport spin-polarization\nmeasurements—Andreev reflection\nThe conductance spectra of nine different Nb\/NiMnSb\n~sample No. 6! contacts were measured and then fitted using\nthe extended Blonder–Tinkham–Klapwijk model.24 This\nprovided a value for the transport spin polarization, Pt , as a\nfunction of a dimensionless barrier parameter, Z ~the value of\nthe superconducting energy of Nb was fixed to 1.5 meV!.\nThe plot of Pt vs Z for sample No. 6 is shown in Fig. 7. Note\nthat for a clean interface (Z50) a value of Pt;45% has\nbeen measured. This much lower value of Pt compared with\nthe expected 100% spin polarization of the bulk, could be\nattributed to a number of reasons. Disorder at the surface,\nparticularly antisite defects, is well known that result in a\ndramatic decrease in the spin polarization. Additionally, re-\ncent theoretical analysis has shown that both Ni- and MnSb-\nterminated surface layers are not half metallic.25 Therefore,\nFIG. 5. Temperature dependence of the thermal conductivity of specimen\nNo. 6. FIG. 6. Temperature dependence of the thermopower of specimen No. 6.\n8067J. Appl. Phys., Vol. 95, No. 12, 15 June 2004 Gardelis et al.\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\nthe apparent disagreement between the indications coming\nfrom the bulk measurements for half-metallic behavior ~i.e.,\n100% spin polarization! at low temperatures and the results\nof PCAR could be attributed to the fact that PCAR is a\nsurface sensitive technique.\nIV. CONCLUSIONS\nIn summary, in this study we have identified the opti-\nmum conditions for synthesizing good quality NiMnSb bulk\nmaterial using arc melting. All investigated physical proper-\nties indicate that in the temperature region 80–150 K a cross-\nover most likely takes place from half metallic behavior to\nnormal ferromagnetic behavior. Half metallicity in our\nNiMnSb specimen is well supported by the integer saturation\nmagnetization value at 5 K, the temperature dependence of\nthe saturation magnetization which follows the T3\/2 Bloch\nlaw up to 200 K, and the T9\/2 contribution in the low-\ntemperature resistivity implying two-magnon scattering\n~identified experimentally!. On the other hand, PCAR, a sur-\nface sensitive technique, demonstrates only 45% spin polar-\nization.\nACKNOWLEDGMENTS\nThe authors gratefully acknowledge support from the\nFENIKS Project No. ~EC:G5RD-CT-2001-00535!. The au-\nthors would also like to thank Dr. G. Kastrinakis for useful\ntheoretical discussions.\n1 S. A. Wolf, D. D. Awschalom, R. A. Burham, J. M. Daughton, S. von\nMolna´r, M. L. Roukes, A. Y. Chtchelkanova, and D. M. Treger, Science\n294, 1488 ~2001!.\n2 S. Datta and B. Das, Appl. Phys. Lett. 56, 665 ~1990!.\n3 S. Gardelis, C. G. Smith, C. H. W. Barnes, E. H. Linfield, and D. A.\nRitchie, Phys. Rev. B 60, 7764 ~1999!; C.-M. Hu, J. Nitta, A. Jensen, J. B.\nHansen, and H. Takayanagi, ibid. 63, 125333 ~2000!.\n4 G. Schmidt, D. Ferrand, L. W. Molenkamp, A. T. Filip, and B. J. van\nWees, Phys. Rev. B 62, R4790 ~2000!.\n5 R. A. de Groot, F. M. Mueller, P. G. van Engen, and K. H. J. Buschow,\nPhys. Rev. Lett. 50, 2024 ~1983!.\n6 M. J. Otto, H. Feil, R. A. M. van Woerden, J. Wijngaard, P. J. van der\nValk, C. F. van Bruggen, and C. Haas, J. Magn. Magn. Mater. 70, 33\n~1987!.\n7 S. J. Youn and B. I. Min, Phys. Rev. B 51, 10436 ~1995!.\n8 M. J. Otto, R. A. M. van Woerden, P. J. van der Valk, J. Wijngaard, C. F.\nvan Bruggen, C. Haas, and K. H. J. Buschow, J. Phys.: Condens. Matter 1,\n2341 ~1989!; 1, 2351 ~1989!.\n9 C. Hordequin, D. Ristoiu, L. Ranno, and J. Pierre, Eur. Phys. J. B 16, 287\n~2000!.\n10 A. C. Rowe, Ph.D. thesis, Imperial College, London, 2000.; C. Grigorescu\net al., in Supermaterials, NATO Series, edited by R. Cloots, M. Ausloos,\nR. Pekala, and G. Vacquier ~Kluwer, Dordrecht, 2000!, p. 173.\n11 A. Szytula, Zˇ . Dimitrijevic´, J. Todorovic´, A. Kołodziejczyk, J. Szelag, and\nA. Wanic, Phys. Status Solidi A 9, 97 ~1972!.\n12 R. J. Soulen et al., Science 282, 85 ~1998!.\n13 A. Lebail, H. Duroy, and J. L. Fourquet, Mater. Res. Bull. 23, 447 ~1998!.\n14 W. Marshall and S. Lovesey, Theory of Thermal Neutron Scattering ~Ox-\nford University Press, Oxford, 1971!.\n15 I. Galanakis, P. H. Dederichs, and N. Papanikolaou, Phys. Rev. B 66,\n134428 ~2002!.\n16 V. Irkhin and M. I. Katsnelson, J. Phys.: Condens. Matter 2, 7151 ~1990!.\n17 K. Kubo and N. A. Ohata, J. Phys. Soc. Jpn. 33, 21 ~1972!.\n18 M. Auslender, A. E. Kar’kin, E. Rozenberg, and G. Gorodetsky, J. Appl.\nPhys. 89, 6639 ~2001!.\n19 P. Schiffer, A. P. Ramirez, W. Bao, and S.-W. Cheong, Phys. Rev. Lett. 75,\n3336 ~1995!.\n20 C. Kittel, in Introduction to Solid State Physics, 3rd ed. ~Wiley, New York,\n1967!, p. 220.\n21 J. Ziman, in Electrons and Phonons ~Oxford, London, 1960!, p. 365.\n22 K. Ueda and T. Moriya, J. Phys. Soc. Jpn. 39, 605 ~1975!.\n23 S. Y. Li et al., Phys. Rev. B 65, 064534 ~2002!.\n24 I. I. Mazin, A. A. Golubov, and B. Nadgorny, J. Appl. Phys. 89, 7576\n~2001!.\n25 G. A. de Wijs and R. A. de Groot, Phys. Rev. B 64, 020402 ~2001!.\nFIG. 7. Transport polarization vs dimensionless barrier parameter ~Z!, for\nspecimen No. 6.\n8068 J. Appl. Phys., Vol. 95, No. 12, 15 June 2004 Gardelis et al.\nDownloaded 10 Jun 2009 to 131.227.178.130. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n"}