{"doi":"10.1007\/BF00160165","coreId":"96920","oai":"oai:generic.eprints.org:500\/core69","identifiers":["oai:generic.eprints.org:500\/core69","10.1007\/BF00160165"],"title":"Pattern formation in generalised Turing systems: I. Steady-state patterns in systems with mixed boundary conditions","authors":["Dillon, R.","Maini, P. K.","Othmer, H. G."],"enrichments":{"references":[{"id":801618,"title":"A.: Pattern regulation in reaction-diffusion systems - the problem of size invariance.","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":805696,"title":"An algorithm for generalized matrix eigenproblems.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":808899,"title":"Applications of a model for scale-invariant pattern formation in developing systems.","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":806619,"title":"Applications of bifurcation theory in the analysis of spatial and temporal pattern formation.","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":803577,"title":"Control of gap junction permeability can control pattern formation in limb development.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":806428,"title":"Current problems in pattern formation.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":801865,"title":"Diffusion driven instability in an inhomogeneous domain.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":803305,"title":"Diffusion in embryogenesis.","authors":[],"date":"1970","doi":null,"raw":null,"cites":null},{"id":803897,"title":"Entwickhingsmechanische Studien.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":802595,"title":"Experimental evidence of a sustained standing Turingtype nonequilibrium chemical pattern.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":805226,"title":"I.R.: A chemical approach to designing Turing patterns in reaction-diffusion systems.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":808070,"title":"Interactions of reaction and diffusion in open systems.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":806217,"title":"Interactions ofReaction and Diffusion in Open Systems.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":803068,"title":"Large time behavior of solutions of nonlinear reaction diffusion equations.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":805973,"title":"Mathematical Biology.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":805452,"title":"Modes of Biological Pattern Formation.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":804151,"title":"New systems for pattern formation studies.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":802111,"title":"Pattern formation in heterogeneous domains.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":804397,"title":"Pattern regulation in epimorphic fields.","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":802806,"title":"Patterns and Problems of Development.","authors":[],"date":"1941","doi":null,"raw":null,"cites":null},{"id":810121,"title":"Positional information and pattern formation.","authors":[],"date":"1971","doi":"10.1002\/dvg.1020150607","raw":null,"cites":null},{"id":809830,"title":"Positional information and the spatial pattern of cellular differentiation.","authors":[],"date":"1969","doi":null,"raw":null,"cites":null},{"id":810346,"title":"Regeneration of the se~nent boundary in Oncopeltus.","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":802367,"title":"Retinoic acid modulates gap junction permeability: a comparative study of dye spreading and ionic coupling in cultured cells.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":807564,"title":"Scale invariance in reaction-diffusion models of spatial pattern formation.","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":804876,"title":"Size adaptation of Turing prepatterns.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":804600,"title":"Spatial harmonics and pattern specification i early Drosophila development. Part I. Bifurcation sequences and gene expression.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":801380,"title":"Spatial patterns in coupled biochemical oscillators.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":806888,"title":"Synchronized and differentiated modes of cellular dynamics.","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":809327,"title":"The chemical basis of morphogenesis.","authors":[],"date":"1952","doi":null,"raw":null,"cites":null},{"id":809550,"title":"The combination shift QZ algorithm.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":807362,"title":"The effects of cell density and metabolite flux on cellular dynamics.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":807134,"title":"The interaction of structure and dynamics in chemical reaction etworks.","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":805108,"title":"The regulatory capacity of Turing's model for morphogenesis with application to slime moulds.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":808637,"title":"Transition from a uniform state to hexagonal nd striped patterns.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":809134,"title":"W,: Turing instabilities with nearly equal diffusion coefficients.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1994","abstract":"Turing's model of pattern formation has been extensively studied analytically and numerically, and there is recent experimental evidence that it may apply in certain chemical systems. The model is based on the assumption that all reacting species obey the same type of boundary condition pointwise on the boundary. We call these scalar boundary conditions. Here we study mixed or nonscalar boundary conditions, under which different species satisfy different boundary conditions at any point on the boundary, and show that qualitatively new phenomena arise in this case. For example, we show that there may be multiple solutions at arbitrarily small lengths under mixed boundary conditions, whereas the solution is unique under homogeneous scalar boundary conditions. Moreover, even when the same solution exists under scalar and mixed boundary conditions, its stability may be different in the two cases. We also show that mixed boundary conditions can reduce the sensitivity of patterns to domain changes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96920.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/500\/1\/37.pdf","pdfHashValue":"8834e53e848d27119000438b0202ab9949c8a010","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:500<\/identifier><datestamp>\n      2015-05-29T18:23:21Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/500\/<\/dc:relation><dc:title>\n        Pattern formation in generalised Turing systems: I. Steady-state patterns in systems with mixed boundary conditions<\/dc:title><dc:creator>\n        Dillon, R.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Othmer, H. G.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        Turing's model of pattern formation has been extensively studied analytically and numerically, and there is recent experimental evidence that it may apply in certain chemical systems. The model is based on the assumption that all reacting species obey the same type of boundary condition pointwise on the boundary. We call these scalar boundary conditions. Here we study mixed or nonscalar boundary conditions, under which different species satisfy different boundary conditions at any point on the boundary, and show that qualitatively new phenomena arise in this case. For example, we show that there may be multiple solutions at arbitrarily small lengths under mixed boundary conditions, whereas the solution is unique under homogeneous scalar boundary conditions. Moreover, even when the same solution exists under scalar and mixed boundary conditions, its stability may be different in the two cases. We also show that mixed boundary conditions can reduce the sensitivity of patterns to domain changes.<\/dc:description><dc:date>\n        1994<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/500\/1\/37.pdf<\/dc:identifier><dc:identifier>\n          Dillon, R. and Maini, P. K. and Othmer, H. G.  (1994) Pattern formation in generalised Turing systems: I. Steady-state patterns in systems with mixed boundary conditions.  Journal of Mathematical Biology, 32  (4).   pp. 345-393.      <\/dc:identifier><dc:relation>\n        10.1007\/BF00160165<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/500\/","10.1007\/BF00160165"],"year":1994,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"J. Math. Biol. (1994) 32:345-393 Journalor \nMathemaUcal \nMology \n© Springer-Verlag !994 \nPattern formation in generalized Turing systems \nI. Steady-state patterns in ystems with mixed boundary \nconditions \nR. Dillon 1' *, P. K. Maini 1'2, H. G. Othmer t'* \n1 Department ofMathematics, University of Utah, Salt Lake City, UT 84112, USA \nz Centre for Mathematical Biology, Mathematical Institute, 24-29 St. Giles', Oxford OX1 3LB, \nUK \nReceived 13 October 1992; received in revised form 2 March 1993 \nAbstract. Turing's model of pattern formation has been extensively studied ana- \nlytically and numerically, and there is recent experimental evidence that it may \napply in certain chemical systems. The model is based on the assumption that all \nreacting species obey the same type of boundary condition pointwise on the \nboundary. We call these scalar boundary conditions. Here we study mixed or \nnonscalar boundary conditions, under which different species satisfy different \nboundary conditions at any point on the boundary, and show that qualitatively \nnew phenomena rise in this case. For example, we show that there may be \nmultiple solutions at arbitrarily small lengths under mixed boundary conditions, \nwhereas the solution is unique under homogeneous scalar boundary conditions. \nMoreover, even when the same solution exists under scalar and mixed boundary \nconditions, its stability may be different in the two cases. We also show that mixed \nboundary conditions can reduce the sensitivity of patterns to domain changes. \nKey words: Spatial pattern formations - Bifurcation - Turing systems \n1 Introduction \nIt is well known in developmental biology that the fate of a cell in a developing or \nregenerating organism is often determined not only by its genome, but also by its \nlocation relative to other cells. Thus the orderly specialization ofcell structure and \nfunction and the arrangement of cells into tissues and organs require mechanisms \n* Supported in part by NIH Grant #GM29123 \n346 R. Dillon et al. \nfor the spatial and temporal control of cellular activity. The simplest aspect of this \nproblem concerns pattern formation n an assemblage ofessentially identical cells. \nOne of the current hypotheses is that pattern formation results from the response of \nindividual cells to an underlying spatial pattern of one or more chemical species \ncalled morphogens, and a major problem is to discover mechanisms by which the \nspatial pattern of the morphogens can be generated and maintained. Wolpert's \nconcept of positional information 1-36] abstracted and formalized from earlier \ntheories 1-12, 13, 7] the notion that a cell in a developing or regenerating system \nmust \"know\" where it is relative to other cells in order to adopt the appropriate \ndevelopmental pathway. In this approach, the question of pattern formation \nbecomes that of discovering schemes that generate positional information. \nA number of models for pattern formation and regulation are based on the \nhypothesis that a diffusible morphogen supplies positional information that can be \ninterpreted by the cells. Such models fall into two main classes: source-sink models \nand Turing models. In source-sink models, specialized cells located at the bound- \nary of the developmental field maintain the concentration of the morphogen at \nfixed levels. In a one-dimensional system of about 1 mm in length, a linear \nconcentration distribution can be established in the time that is normally available \nfor commitment todifferentiation [37, 9]. Given fixed thresholds between different \ncell types, the tissue can be proportioned into any number ofcell types in a perfectly \nscale-invariant way. There are, however, two facts which limit the applicability of \nthis type of mechanism. While there are numerous systems that have one 'organ- \nizer' region that could serve as a source (or sink), such as the tip in the slug stage of \nDictyostelium discoideum or the ZPA in the avian limb bud, the simultaneous \noccurrence of two such regions at opposite ends of a developmental xis is \napparently rare. Secondly, the homeostatic mechanism that maintains the bound- \nary concentrations at fixed levels must be able to vary the production or consump- \ntion of morphogen over a wide range. For instance, if the ends are held at Co \nand cl respectively, then the morphogen distribution is given by c(x)= \n(cl - Co)(x\/L) + Co, and so the flux through the system must vary as 1\/L. \nTuring models [34] involve two or more morphogens that react together and \ndiffuse throughout the system. In Turing's original analysis no cells were distin- \nguished a priori; all could serve as sources or sinks of the morphogen. Moreover, \nTuring only considered periodic systems or closed surfaces, in which case no \nboundary conditions are needed. More generally, we call ny system of reaction- \ndiffusion equations for which the boundary conditions are of the same type for all \nspecies a Turing system. In certain situations to be discussed in detail ater, a spa- \ntially-homogeneous stationary state can, as a result of slow variation in parameters \nsuch as kinetic coefficients, become unstable with respect o small nonuniform \ndisturbances. Such instabilities, which Turing called symmetry-breaking because the \nhomogeneous locally-isotropic stationary state becomes unstable and therefore \nphysically inaccessible, can lead to either a spatially nonuniform stationary state or \nto more complicated dynamical behavior. Such transitions from uniform stationary \nstates to spatially- and\/or temporally-ordered states might in turn lead, via an \nunspecified 'interpretation' mechanism, to spatially-ordered differentiation. For \nmathematical simplicity most analyses of Turing models deal with instabilities of \nuniform stationary states, since numerical analysis is generally required for more \ngeneral reference states. However, Turing himself recognized the biological unreality \nof this in stating that 'most of an organism, most of the time is developing from one \npattern to another, ather than from homogeneity into a pattern' 1-34]. \nPattern formation i generalized Turing systems. I 347 \nGradient models and reaction-diffusion models have been proposed to account \nfor segmentation patterns along the antero-posterior axis of insects. However there \nare instances in which positional information models based on a simple \"reading \noff\" of morphogen concentration are clearly not sufficient to describe the results of \nobservations. For example, in Oncopeltus, Wright and Lawrence [38] found that if \ncells that were not normally neighbours were juxtaposed by surgical manipulation, \nthen a segment boundary would form at the interface when confronting cells came \nfrom sufficiently disparate positions in the antero-posterior axis of the same \nsegment, and otherwise the segment simply regenerated normally. The latter result \ncould be explained by the diffusive smoothing of a gradient, but the former equires \nthe generation of the extreme positional values that specify the segmental bound- \nary and these could not arise from a simple gradient mechanism. In Drosophila, \nsurgical manipulation 1-15] or gene mutation can lead to deletions and mirror \nsymmetrical duplications along the antero-posterior axis on length scales ranging \nfrom half the egg to within segments ( ee [16] for review). These results cannot be \nfully explained by a simple gradient model. \nReaction diffusion systems have been proposed to account for spatial pattern \nformation in several other biological systems and in chemical systems, but in many \nof these cases experimental evidence is lacking. Recently, however, Turing-type \nstructures have been found in the chlorite-iodide-malonic acid reaction \n[6, 31, 19, 14]. Aside from the difficulty of identifying morphogens and the reac- \ntions in which they participate in a biological context, there are several general \nproperties of Turing systems that limit their applicability. \n• The spatial patterns in a Turing system typically arise via an instability, and thus \nthe parameters must be tightly controlled to obtain the onset of the instability at \nthe desired point in parameter space. In particular, for a given kinetic mechanism, \nthe diffusion coefficients must have the proper relative magnitudes. \n• Because the instabilities result from the interaction of reaction and diffusion, the \npatterns that arise are sensitive to the overall scale of the system. As a result, it is \ndifficult to obtain the degree of scale-invariance that is observed in various \nbiological systems. However, modifications of Turing's model can circumvent this \ndifficulty [29, 32]. \n• Frequently there are multiple stable solutions that coexist in a Turing system \n(examples are given later), which raises the problem of pattern selection. Generally \ntight control of the initial conditions is needed to select he desired pattern. \nIn this paper we analyze the spatial pattern formation properties of a two- \ncomponent reaction-diffusion system in which the two species are subject to \ndifferent boundary conditions. For example, one species may be subject to \nNeumann conditions, whereas the other species may satisfy Dirichlet conditions. \nWe focus our attention on the size of the parameter domain in which multiple \nsolutions are exhibited, the control of the polarity of solutions, and the degree of \nscale-invariance of solutions. \nOne of the major points that emerges from our analysis is the following. Fixing \none (but not both) species at the boundary leads to less sensitive dependence of\npatterns on both the length and the initial conditions. In particular, for certain \ncombinations ofboundary conditions we find smooth transitions between different \nspatial patterns, and these transitions do not involve bifurcations. For example, we \nfind a transition from 1 to 2 to 3 stable pattern elements in a one-parameter family \n348 R. Dillon et al. \nparameterized by the length. Moreover, these solutions are apparently the only \nstable solutions. By contrast, for Turing systems a tortuous path in parameter \nspace would be required, because different stable patterns may coexist under \ncertain conditions. \nIn the following section we discuss ome general properties of reaction-diffusion \nsystems and describe some of the standard kinetic schemes that are used in pattern \nformation studies. In particular we point out that the popular terminology that \nlabels certain systems as activator-inhibitor systems is not sufficiently precise: any \ntwo-component system that can lead to diffusive instabilities is an activator- \ninhibitor system. The distinction that should be made is between what we call \na pure activator-inhibitor system and a cross activator-inhibitor system. Under \nconditions to be made precise later, we show that in the former type the gradients of \nthe two species are parallel sufficiently close to a bifurcation point, while in the \nlatter they are anti-parallel (both in one space dimension), and this seems to be the \nonly significant difference between the two types of systems. We then discuss in \nmore detail the parametric behavior of one representative example of a cross \nactivator-inhibitor mechanism. \nIn Sect. 3 we carry out a qualitative analysis of the solutions for mixed \nboundary conditions, and analyze the existence and stability of solutions in the \nlimit L ~ 0. In Sect. 4 we present some numerical results for various combinations \nof boundary conditions. The possible application of our results in the context of \nlimb development is discussed in the conclusions ection. \n2 General results for Turing systems \n2.1 The standard Turing model \nIn the following section we will discuss a specific model reaction mechanism, \nbut here we will simply assume that the temporal dynamics in a spatially uni- \nform system are governed by the solution of the system of differential \nequations \nde \ndt =\/~(c,\/5).. (1) \nHere the vector e = (el, c2 . . . .  , c,,) is the vector of chemical concentrations, and \nis therefore an element of the nonnegative cone C + of an m-dimensional real \nEuclidean vector space. The functions Ri give the net rate of production of the \ni th species and they are usually polynomial or rational functions in the ci's, in \nthe latter case having no poles in C + . The vector t5 is a parameter vector, which \ncan include the kinetic constants and perhaps species that appear in the kinetic \nmechanism but do not change significantly on the time scale of interest. To be \nwell-posed from the physical standpoint, the solution of (1) should exist and \nbe nonnegative and bounded for t ~ (0, oe ). Nonnegativity is guaranteed by the \nhypothesis that \nRi (C l ,  c 2 . . . . .  C i _ l ,  O, . . . , Cm, f i )  ~ O, (2) \nfor cj > 0,j__+ i. The solution through any initial point in Cm + will be unique if the \nfunctions R~ are locally Lipschitz continuous in c throughout Cm + . \nPattern formation in generalized Turing systems. I 349 \nLet ~ be a bounded region in 9tq, q < 3 with a smooth boundary and outward \nnormal n. Turing's model for pattern formation is described by the system of \nreaction-diffusion equations \n& = DVZc + R(c,~) in & \nn.OVc=H(c* -c )  on af2 \nc(r, O) = co(r), (3) \nwhere c* is a fixed concentration and D is usually assumed to be a constant \ndiagonal matrix. We assume for the present hat all D~ > 0. The matrix H of mass \ntransfer coefficients i also diagonal, and when Hi = oo one has Dirichlet data on \nthe ith species, whereas if Hi = 0 one has Neumann data. \nLet co- 1 be a time scale characteristic of the reactions, let L be a measure of the \nsize of the system, and let C~ be a reference concentration for the ith species. Suppose \nthat the species are ordered so that max~{Di} = D1. Define the dimensionless \nquantities u i= ci\/Ci, z= cot, g)i-= Di\/Dt, v-=D1\/coL 2, and (=r \/L ,  where \nr - (xl . . . .  , xq). The dimensionless governing equations are \nOu \n- - - -v~VZu+R(u ,p)  in f~ & \nn.  Vu  = P(u*  - u) on ~f~ \nu(~, 0) = Uo((), (4) \nwhere ~ = diag{1, fia . . . . .  ~\"}, Pi = LHJDi ,  and R(u,p) is the dimensionless \nform of\/~(u, p). \nProposition 1 of Ashkenazi and Othmer [1] shows that for most of the typical \nrate laws used, the condition (2) that guarantees invarianee of C + under the flow of \n(1) also guarantees that classical solutions of the reaction-diffusion system (4) will \nbe nonnegative for t > 0 provided that the initial data is nonnegative. Further- \nmore, these authors how that the solution of (4) exists and is unique for sufficiently \nsmall times and that the solution is bounded in Lt (f~) for t • [0, oo ) under minimal \nsmoothness conditions on the vectorfield. If the kinetic vectorfield admits an \ninvariant rectangle then one can also show that the solution exists for all time \npointwise in space [81. Thus the models we use are well-posed from a physical \nstandpoint (as well as being well-posed in the standard mathematical sense). \nIn the absence of reaction, the solution relaxes exponentially to the average \nconcentration set by the initial conditions under Neumann boundary conditions. \nThus one expects that a system will relax to a uniform state whenever the \nrelaxation time for diffusion of each species is sufficiently short compared to that of \nthe chemical reactions. The dimensionless quantity co-1\/(L2\/Di) is the ratio of \na kinetic relaxation time to a relaxation time for diffusion, and thus one expects \nthat when L is small enough the system will relax to a uniform state if all Di > 0. \nThis can be shown rigorously using a theorem in [24]. An order of magnitude \nestimate given there shows that for typical values of the diffusion coefficients and \nkinetic relaxation times it can be expected that systems of order two cell diameters \nin size will relax to a uniform state provided that all time-dependent species \ninvolved in the kinetic terms also diffuse. A similar result holds for the Dirichlet \nproblem provided that u* is such that R(u*, p) = 0 [8]. However, Turing showed \n350 R. Dillon et al. \nthat diffusion could destabilize a steady state that is stable in the absence of \ndiffusion, and when this occurs one calls it a diffusive instability. In order to define \nthis precisely, we have to consider the variational system associated with (4). \nSuppose that u s is a time-independent solutio~n of (4). If we linearize (4) around \nu s and let ~ = u - u ~,then we obtain the variational system \nwhere \n~3¢ v~V2~ + K~ \nn.V~ = - P~ \n~(;, 0) = ~o(0, (5) \nand k~ s = ORi\/c~uj(us)(O . This system has solutions of the form ~ = e~'q ~, which \nleads to the spectral problem \nv~V2W + (K - 2I)W = 0 \nn.  Vtg  = - Pq~. (6) \nThis is generally not a self-adjoint problem, and the eigenfunctions do not have \na simple form, even if u s is independent of (. Suppose however, that P = pI  for some \np e 9t +, in which case we say that the boundary conditions are scalar conditions. 1 \nIf in addition u s is a constant, then the eigenfunctions can be written ~sn = Yj, ¢ . ,  \nwhere ~n is a solution of the scalar eigenvalue problem \nV2~n = - -~2~b n in f~ \nn.  Yen  = -pC .  on  0f \/ .  (7) \nThe vector y~ e 91m is a solution of the algebraic eigenvalue problem \n(K  -- ,u,,~ - 2 I )y  = 0, (8) \nwhere\/~n - ~ v. In this case the eigenfunctions are complete and the solution of the \nlinear variational problem can be written \n~(~, Z) = ~ e(r-~\"~)~YnCn(() (9) \nn=0 \nwhere the y, e 91m are determined by the initial data. This case is particularly \nsimple, because the eigenfunctions of the variational problem are independent of \nthe parameter L, and one can characterize the solution of the full nonlinear \nproblem by specifying its amplitude spectrum relative to a basis comprised of those \neigenfunctions. When the underlying solution u s is not constant he eigenfunctions \nvary with L. If the eigenfunctions are complete one can still characterize the \nsolutions by their amplitude spectrum relative to the eigenfunction basis, but this \n1 In fact, we can allow the possibility that 8t2 has several connected components, on each of \nwhich the boundary condition is scalar, with a different p for each component of the boundary \nPattern formation in generalized Turing systems. I 351 \ncannot be done uniformly in L. However, one can still characterize solutions in \nterms of the number of maxima or minima, and this is adequate if it is only the \nthreshold levels of morphogens that are important. For some purposes it is \nappropriate to use a fixed basis, such as trigonometric functions, for the \nsolution of the variational problem, and this is done for the linear analysis in \nAppendix A. \nThe foregoing shows that stability in an L2(~) sense for the linear equations \nwith scalar boundary conditions is governed by the eigenvalues of the family \n{K - #,@ },% o, and it is well-known that the principle of linearized stability holds \nfor equations like (5). That is, asymptotic stability or instability for the zero \nsolution of the variational equations implies the same properties of the solution u s \nof the nonlinear equations. The spatial variation of any mode is given by ~b.(~), but \nin the case p = 0 (p = oe ) this can be written \n~b,(~) = ~b(~,~) = ~b (L  r ) ,  (10) \nwhere ~b solves the problem \nVZ~b= -q~ inf~ \nwith homogeneous Neumann (homogeneous Dirichlet) boundary conditions. That \nis, by scaling ~ by e, we obtain a universal pattern function, and the eigenfunctions \ndiffer from each other only by the dilation e, \/L  of the spatial scale. Thus homo- \ngeneous Dirichlet and Neumann boundary conditions play a distinguished role in \nthe context of Turing instabilities. \nAlthough { #. } is countable for a reasonable domain, it is convenient at present \nto replace #, with a continuous variable. Then stability of u s is governed by the \ncharacter of the eigenvalues ofthe one-parameter family of matrices {K - #~ } for \n# s 9t +, and a diffusive instability is defined as follows. \nDefinition 1 Suppose that u s is asymptotically stable as a steady-state solution of \n(1). We say that a zero-amplitude diffusive instability of u] exists if there exist #-+, \n0 < #- < #+ < oe, such that K - #~ has at least one eigenvalue with a positive \nreal part when # e (#-, #+). If for some #* e (#-, #+), K - #*N has a single real \npositive igenvalue the instability is stationary at #*, while if K - #*@ has complex \neigenvalues with a positive real part the instability is oscillatory at #*. \nOf course it is possible that K - #@ has real positive eigenvalues and complex \neigenvalues with a positive real part at some #*, or there may be several disjoint \nintervals of # in which K - #N has an eigenvalue with a positive real part. Usually \none is only interested in knowing whether the first eigenvalue to cross from the \nleft-half to the right-half plane is real or complex, and for this the above character- \nization suffices when the eigenvalue having the largest real part is simple. Station- \nary instabilities generically lead to bifurcation of a stationary solution from u s, \nwhereas oscillatory instabilities generically ead to bifurcation of periodic solutions \nfrom u s . \nLet K s denote the symmetric part of K, let a(K) denote the spectrum of the \nmatrix K, let LHP (LHP)  denote the open (closed) left-half complex plane, and let \nbl ° II denote the Euclidean orm in R\". Some general conditions on K and ~ that \npreclude diffusive instabilities are given in the following theorem. In this theorem \n352 R. Dillon et al. \nand the one that follows there is no reference to the type of boundary conditions \nimposed, but it is assumed that the boundary conditions are scalar conditions. \nTheorem 2 [27] Suppose that ~ is diagonal with @i > O. Then each of the following \nconditions is sufficient o preclude diffusive instabilities. \n• K and ~ are simultaneously triangularizable. \n• There exists a diagonal matrix W with Wi > 0 such that a(WK)  ~ ~ LHP. \n• K is either row or column quasi-diagonally dominant. \n• min i~i \/maxi~i  > 1 - l\/m, where m is such that II exp(Kt) [J < m exp( - ~t), and \nm> 1,7>0.  \n• The graph (¢(K) associated with K has no cycles of length greater than one. \nHowever, it is also well known that a diffusive instability is possible given the \nproper structure in the kinetic mechanism. The following theorem summarizes the \nnecessary conditions for stability, and from this one can understand the type of \nkinetic interactions that can give rise to diffusive instabilities. In the theorem, \nK[ i l ,  i 2 . . . .  , ip'] denotes a p x p principal submatrix of K formed from rows and \ncolumnsil ,  i2 , . . . , i  v fo r l<p<n-1 .  \nTheorem 3 [26-] Let ~ be diagonal with @i > O. In order that a(K - It~) ~ LHP \nfor all such ~ and all # e [0, oo ), it is necessary that \n• a(K) ~ LHP \n• a(K[ i l , i2 . . . .  ,ip]) c LHP  for all pth-order submatrices of K, where \nl<p<n-1 .  \nIt is clear that scalar boundary conditions greatly simplify the linear analysis, for \nthe eigenfunctions have a simple product form. Thus far little is known about (6) \nwhen the boundary conditions are not scalar conditions. General results on \nselected types of mixed conditions would be useful for understanding pattern \nformation in biological systems that have mixed conditions. \n2.2 Diffusive instabilities in a two-component Turing model \nSince we later restrict attention to two-species systems, we shall briefly review some \nof the known facts about such systems; for further details and generalizations see \n[23, 30, 24, 29, 22]. To simplify the notation, we let (u, v) denote the chemical \nspecies, we denote the reaction vector field by (f(u, v, p), g(u, v, p)), and we set \n62 = 6. We write the governing equations as \nOu \n- -  = vVZu + f (u ,  v, p) \nOr \nin P \nOv \n- -  = t~I,'V2u \"3 L g(u ,  U, p )  \n~z \nn.  Vu  = p(u*  - u) \non ~ \nn. Vv = p(v* - v). (i1) \nThen the stability of (u s, v ~) is governed by the character of the eigenvalues of the \nproblem \ndet(K - #~ -- A1) = 2 2 + c1(p)2 + c2(#) = 0. (12) \nPattern formation in generalized Turing systems. I 353 \nHere \nci(#) ---\/~ trace @ - trace K = #(1 + 6) - (kil + k2z) \nc2(\/~) -\/~2 det 9 +\/~(trace(Kg) - (trace K)(trace 9) )  + det K \n= 1~26 - #(k116 + kz2) + detK,  (13) \nand trace A (det A) stand for the trace and determinant, respectively, of any \nmatrix A. One is usually interested in how the eigenvalues change as some para- \nmeter p is varied, and in particular, in whether or not a diffusive instability is \npossible. \nThe solution (u s, v s) is asymptotically stable as a solution of (1) if trace K < 0 \nand det K > 0, and we assume that these conditions hold hereafter. Furthermore, it \nfollows from the definition of c1(#) that if c1(0) > 0, then an oscillatory diffusive \ninstability is impossible provided that the diffusion coefficients are nonnegative. \nOnly stationary diffusive instabilities can occur for D~ > 0, and it follows from (8) \nthat under the standing conditions on K, c2(p) can vanish only ifku > 0 for i = 1 or \n2. Without loss of generality we can assume that k22 > 0, and then it is necessary \nthat kit < 0 and that k12k2~ < 0 in order that trace K < 0 and det K > 0. The \nrange of dimensionless wave numbers in which c2(\/~) < 0 is (p-,\/~+), where \n#-+ = (k22 + ~kll _+ x\/(k22 + 6kil) 2 - 46detK)\/2(5, (14) \nand in this interval K - #9 has exactly one real positive eigenvalue. In order that \n\/~ be > 0, it is necessary that 6 __< 1, and since trace K < 0, there can never be two \nreal positive eigenvalues. \nWithin an arbitrary relabelling of species, any two-component kinetic mechan- \nism that can lead to a diffusive instability must give rise to a Jacobian at (u s, v s) with \none of the following patterns of signs. \nDefinition 4 A kinetic mechanism for which the Jacobian at u e C~- is of type \nKp (type Kc) is said to be a pure (cross) activator-inhibitor mechanism at u. \nClearly the type of a mechanism ay vary with u e C~-, but when it does not we \ncall the mechanism a global pure (cross) activator-inhibitor system. Comparison \ntheorems can be used to prove existence of the solution of (11) for all time for \nmechanisms whose type is global. In studying zero-amplitude iffusive instabilities \nthe interest is in the local behavior near a steady state, and Fig. 1 shows the only \npossibility for the local disposition of the isoclines f = 0 and g = 0 for each of the \ntwo types. As shown there, for a pure activator-inhibitor system the level sets f=  0 \nand g = 0 must lie in the first and third quadrants ufficiently close to the origin in \na coordinate system centered at (u s, vs), whereas they must lie in the second and \nfourth quadrants for a cross activator-inhibitor system. \nCurrently the terminology 'activator-inhibitor' is primarily used to describe \na global pure activator-inhibitor mechanism [20]. However it is clear (and well \nknown) that any two-component system that leads to a zero-amplitude diffusive \ninstability must contain both self-activation and mutual or cross activation and \ninhibition. The distinction between the two generic types hinges on whether the \nself-activating species activates or inhibits the other species. The major qualitative \nC2 C~ \nR 2 = 0 \nRI=0 \nC1 \nR2=0 \n354 R. Dillon et al. \nRx=0 \nCl \nFig. 1.a, b A schematic of the local behavior of the nullclines for the two generic types of \ntwo-component systems that support diffusive instabilities, a a cross activator-inhibitor system, \nb a pure activator-inhibitor system \ndifference in the concentration profiles for the two types of mechanism under \nhomogenous Neumann conditions is stated in the following proposition. \nProposition 5 Suppose that p = 0 in (11). I f  the kinetic mechanism is of global pure \n(cross) type and q = 1, then non-constant solutions that bifurcate from the uniform \nsteady state have the property that sgn(u~) = sgn(vg) (sgn(u~) = - sgn(v~)) in some \nneighborhood of the bifurcation point. In other words, the gradients are locally \nantiparallel (parallel). \nProof By differentiating the one-dimensional, time-independent version of (11) \none finds that \nv(u~)~ + Lu~ + f~v~ = 0 (16) \n3v(v0, ~ + g.u: + g~v c = O. (17) \nIt suffices to prove the result for either of the cases, for if one is proved the other \nfollows after the transformation v¢ w-~ - v¢. The conclusion is easily established \nnear a bifurcation point on the uniform steady state, whether or not the corres- \nponding eigenvalue is simple. This is done by solving the system at the bifurcation \npoint, where it has constant coefficients, and then applying a perturbation argu- \nment. \nAs we shall see later, the numerical results suggest that the conclusion is true on \nall primary bifurcating branches, not only near the bifurcation point, but it is not \ntrue on the secondary bifurcating branches. This result implies that to a first \napproximation, the only admissible phase differences between the two species are \n0 and ~ in a one-dimensional system. \nNext we analyze in more detail how the intervals of unstable wave numbers \ndepend on the linearized kinetic parameters and on the ratio of diffusion coeffic- \nients. It follows from the definition of c2(#) that #-+ > 0 only if 5 < - k22\/k11. \nPattern formation in generalized Turing systems. I 355 \nFurthermore, for fixed kij the discriminant of (13) is a quadratic in 6, the roots of \nwhich are \n6+-= \nIt can be shown that \ndetK - k12k21 _ 2x \/ -k12k21 detK \nkh \n-- k22 < \n0<6-< kll 6+' \nand therefore the maximum allowable 6 for which a zero-amplitude diffusive \ninstability occurs at some p > 0 is 6 ¢ - 6 -. Note that if trace K = det K = 0, then \n6 +- --* 1, which means that a diffusive instability can occur when the ratio of the \ndiffusion coefficients i arbitrarily close to one, provided that both eigenvalues of \nthe Jacobian for the kinetics are sufficiently close to zero. This conclusion carries \nover to n-component systems as well [33]. \nAt the critical value of 6 \n#+ = #-  ~ \/Z ¢ = k22 + 6¢kll (18) \n26 ¢ \nThe corresponding critical wave number is \nL = X\/ \/)1 \\ ; '  (19) \nThis is a natural or intrinsic wavelength at marginal instability, which Turing [34] \ncalled the chemical wavelength. In a one-dimensional system of length L \nwith homogeneous Neumann boundary conditions, ~, = mz, n = 0, 1 . . . .  and \ndp,=cos(n~\/L ) ( ,  while under homogeneous Dirichlet conditions ~,= \nn~, n = 1 . . . .  and ~b. = sin (mz\/L ) ( .  In either case the critical wave number is \nindexed by the integer n closest o [29-1 \nIf the entries of K and ~ are such that there is a positive real eigenvalue of K - #~ \nfor\/~ e [p - ,  #+], then the mode qS, is unstable whenever \nL e [L2 ,  L~ + ] = n~ , n~ . (20) \nThus the intervals of instability of the successive modes are disjoint if and only if \nn -1  #~+ - - <  \nn \ni.e., if and only if \n1 \nn<n*~ \n356 R. Dillon et al. \nAs L increases from zero the uniform steady state always loses stability with respect \nto q~l first and is linearly unstable with respect o q~l over the range \nAL l  =- L [  - L~ = rc \nVa~ \nThe foregoing results can also be applied to systems with scalar boundary \nconditions of the third type (i.e., when p ~: 0), and to arbitrary domains. In the \nformer case one simply replaces nrc by ~, in (20). In the latter case one regards L as \nsome measure of the size of the system, and one replaces nrc by the n th eigenvalue of \nthe Laplacian for the domain in question in (20). Of course real two- or three- \ndimensional growth can rarely be described by a single size parameter since \nproportions usually change during growth. The same sort of analysis that was done \nfor two-component systems can be done for n-component systems as well, although \nthe critical quantities cannot be computed explicitly in general [23, 30]. Further- \nmore, when n > 3 there may be more than one turning point on the curve \ndet(K - \/~)  in the p versus 6 i plane. \nA simple measure of the range of invariance of pattern formation in Turing's \nmodel with scalar homogeneous Neumann or Dirichlet conditions i the interval of \ninstability for the n trt mode, which is given by \nAL. \nThis criterion is similar to the one used in [18]. Clearly it depends on the mode \nnumber in question. Furthermore, when the intervals overlap, as they always do for \nlarge enough n or sufficiently small 6, the uniform state is unstable with respect o \nmore than one mode and it is possible that more than one solution is stable or that \nthe spatial distribution of the morphogens in the stable solution bears little \nresemblance tothe spatial variation of the eigenfunctions. Thus the foregoing linear \nanalysis gives little information about scale-invariance in the full nonlinear model \nin these cases. However, one can certainly conclude already that Turing's model \ndoes not show perfect scale-invariance (a conclusion reached by others \n[29, 32, 2, 17] and one that does not rest on any of the foregoing analysis). It is of \ncourse very difficult to say anything analytically about the behavior of the \nsolutions of the full nonlinear equations, except near certain degenerate points \ncorresponding to coincidence of an L f  and an L~- (cf. Fig. 4b). However some \ninsight into the changes in the spatial distributions that must occur as the para- \nmeter L varies can be gotten as follows. Time-independent solutions of (4) exist \nwhen the diffusion rate is balanced by the reaction rate at each point in space. As \nL increases the relaxation time for diffusion increases and at least one of three \npossible changes in the profiles must occur. Firstly, the local curvature of the \ndistributions could increase so as to maintain a constant diffusion rate. Secondly, \nthe local diffusion rate could decrease and the reaction rate could change corres- \npondingly. Finally, the local amplitude of the solution could increase, again so as to \nmaintain the diffusion rate constant. The last of these is only possible if the reaction \nrates are insensitive to changes in concentration, which can occur for enzymatic \nreactions only when the rate is saturated at maximal velocity. Of course a combina- \ntion of the foregoing changes is generally what occurs, but under any of them \nthe spatial profile varies with L and in particular, the spatial location of fixed \nPattern formation in generalized Turing systems. I 357 \nconcentration thresholds that are used to trigger differentiation i to different \ntypes of cells will generally move about in space. The precise amount of this drift \ncan only be determined on a case-by-case basis, but some general conclusions can \nbe derived from studies of model systems. In the following sections we study the \neffect of nonscalar boundary conditions on the intervals of instability and on the \ntypes of stable patterns that can arise. \n3 Systems with mixed boundary conditions \n3.1 Qualitative analysis \nWe saw in the previous ection how the intervals of instability for a linear Turing \nsystem depend on the parameters, and in particular, we determined when these \nintervals overlap as a function of the length. When the intervals are disjoint a single \nreal eigenvalue crosses the imaginary axis at L2,  and the uniform steady state \nbecomes unstable to a spatial pattern given by ~b(~) (cf. (10)). In general, a noncon- \nstant solution bifurcates at L, under a nondegeneracy ondition on the nonlin- \nearity (specific examples are given later). These conclusions hold in any number of \nspatial dimensions, but hereafter we restrict attention to one-dimensional systems. \nFor Neumann boundary conditions the spatial variation of the unstable mode is \n~b, = cos ( (n~\/L)x) .  As we observed earlier, in the linear approximation the spatial \nphase difference between the two components i  either 0 ° or 180 °, according as the \nmechanism is locally of pure or cross activator-inhibitor type. This phase relation- \nship is not precisely preserved in the solution of the full nonlinear problem, but \nresults from bifurcation theory show that spatial variation of the solution near the \nbifurcation point is dominated by the unstable igenfunction near the bifurcation \npoint, and numerical results given later show that the phase relations do not \nchange significantly, even far from the bifurcation point. \nTo gain some insight into the effects on time-independent spatial patterns of \nchanging the boundary conditions, we will consider different combinations of \nNeumann and Dirichlet conditions on the two components. In the following \nanalysis we only consider the cases in which (u*, v*) = (0, 0) and (u*, v*) = (u s, vS), \nbut in the next section we allow a more general nonhomogeneous term. The steady \nstate equations are \nvu~ + f (u,  v, p) = 0 \nin (0, 1) (21) \n6vv~; + g(u, v, p) = O. \nThe boundary conditions will be written in the form \n~u \n01 ~nn = p(1 - 01)(03 us - u) \nfor ~ = 0, 1 (22) \n#v \n602 ~n = 6p(1 - 02)(03v s - v), \nwhere 0i e [0, 1], i = 1, 2, 3, are homotopy parameters. Our strategy in the numer- \nical computations described in the following section will be to do a homotopy \nbetween various types of boundary conditions by varying the parameters 01. To \nfacilitate reference to various limiting cases of the homotopies, we first introduce \nsome terminology. \n358 R. Dillon et al. e2 \nD°D° ~ Os \nNDo ~ ND1 \n01 \nFig. 2. A schematic showing the relationship \nof various combinations f boundary condi- \ntions to the homotopy parameters \nWhen (0x, 02, 03) = (1, 1, ° ) the governing Eqs. (21) and (22) reduce to the pure \nhomogeneous Neumann problem, which we denote NN. If (01, 0z, 03) = (1, 0, 0), \nthen the problem has a homogeneous Neumann condition on u and a homogene- \nous Dirichlet condition on v. We denote this case by NDo. If (01, Oz, 03) = (0, 1, 0) \nwe have the mixed boundary problem DoN, and if (01, 02, 03) = (0, 0, 0) we have \nthe pure homogeneous Dirichlet problem DoDo. Similarly, if we fix \n(01, 02, 03) = (1, 0, 1) then (21) and (22) reduce to the mixed boundary problem \nwith a homogeneous Neumann condition on u and a nonhomogeneous Dirichlet \ncondition on v, denoted ND1. Finally, for (01,02, 03) = (0, 1, 1) we have the mixed \nboundary problem D1N, while for (01,02, 03) = (0, 0, 1) we have the pure non- \nhomogeneous Dirichlet problem D1D1. Figure 2 illustrates the relationship be- \ntween the various problems. We will expand on this figure later to summarize how \nthe solutions change as various edges are traversed. \nEquation (21) defines adynamical system in 9~ 4, and the solution of (21) sub- \nj~ct to (22) defines a curve F: [0, i] ~ C~ × 9~ 2. In the case D1D1 the endpoints of \nF lie in the two-dimensional manifold (u s, v'~ × ~R 2, while in the case NN the \nendpoints lie in C]  × (0, 0). The projection of F into 9~ 2 shows how the gradients \nvary along the solution, and the projection of F into C ~-, which we call F, reflects \nthe variation of (u, v). For example, consider the case NN. By integrating both \nequations in (21) over [0, 1] we find that \nand \nf j  f(u, v, p)d~ = 0 (23) \nf] g(u, v, p)d~ = (24) O. \nThus the average reaction rate must vanish. In the case NDi and DiN, for i = 0, 1, \nthe corresponding average rate must still vanish for the species that satisfies \na Neumann condition, irrespective of the boundary condition imposed on the other \nspecies. To see how these elementary facts enable us to get some insight into the \nbehavior of the curve F as the boundary conditions are changed, we must consider \na specific reaction mechanism. In the previous ection we showed that there are \nonly two generic types of two-component systems when viewed in the linear \nPattern formation in generalized Turing systems. I 359 \napproximation, and in the remainder of the paper we focus on one of these. We \nconsider a simplified version of a model for glycolysis, which is obtained from the \ngeneral model in the limiting case in which the enzymes are far from saturation \n[28, 13. \nThe vectorfield is \nf (u ,  v, p) = B --  tcu --  uv a \ng(bl, V, p)  = KU \"~ UV 2 - -  V, \n(25) \nwhere\/~ are ~ are parameters that we set to 1.0 and 0.001, respectively. A sketch of \nthe nullclines for this mechanism is shown in Fig. 3. 2 This system is a cross \nactivator-inhibitor mechanism whenever 2uv > 1, and in particular, this is true at \nthe steady state whenever\/~2 > ~c. For these values of\/~ and ~, 6c ~ 0.172, and #+- \nare as shown in Fig. 4a. If we also choose D1 = 10 _5 cm2\/sec and co = 0.01 sec -1, \nthen we can compute the range of unstable lengths for the various modes. The \nresults for the first four modes are shown as a function of 6 in Fig. 4b (cf. also Table \n1). Figures 4a, b both apply to homogeneous Neumann conditions and to homo- \ngeneous Dirichlet conditions. \nTo see how the boundary conditions affect F, we sketch the possibilities as \n(01, 0z, 03) varies using the glycolytic vectorfield. When (01, 02, 03) = (1, 1,.), the \nlocation of F is constrained only by the integral conditions given by (23) and (24), \nwhich imply that F cannot lie entirely on one side of either f = 0 or 9 = 0. One \nfeasible curve is shown in Fig. 5a. \nWhen (05, 02, 03) = (1, 0, 0) (case NDo) ,  F must cross f - -  0 at least once, and it \nmust terminate on the u-axis. One possibility that satisfies these conditions is \nFig. 3. The nullclines for the model of glycolysis \n2 It is easy to see that there is no invariant rectangle in C2 for the flow in 9t 2 defined by (1) when \n\/~ is given by (25). Therefore one cannot assert a priori that all solutions of the reaction-diffusion \nsystem are bounded. In fact, one can see from Fig. 3 that g > 0 for fixed u sufficiently large, and \nlarge v, and this suggests hat there may be solutions for which v is unbounded. However, this is an \nartifact hat arises from the simplification of the original model. If the positive feedback term uv 2 is \nreplaced by a function such as yuvZ\/(K + v 2) that saturates at large v, then it is easy to show that \nthe local dynamics has an invariant rectangle, and that all solutions of the reaction-diffusion \nsystem are bounded. Our interest here is in solutions of moderate amplitude, and solutions of (21) \nand (22) are small perturbations ofthe solutions of the more complete quations in this range. \nTherefore whether or not there are also large-amplitude solutions is irrelevant for our purposes \n360 R. Dillon et al. \n25 \n2O (zl \n~E \nz \n15 .< \ni . u  \n~ 10 \nz \no \nz \n:~ 5 \n0 \n0.00 \n0.40 \n0.35 \n0.30 \n\"~\" 0.25 \nv \ni 0 ,20  \nz \n~, o.15 \n0,10 \n0.05 \n0.00 \n0.00 \ngt  \ni i i \n0.05 0.10 0.15 0.20 \nDELTA \n3 \nlr l= l  \n\" i \n~ i r i r I \n0 .05 0 .10  0,15 U 0.20 \nDELTA \nFig. 4. a The locus of marginal \nstability for the glycolytic reactions \nin 3- wave number space, b The \nintervals of instability for the first \nfour modes in 6-L space \nTable 1. Numerical and analytical values of the endpoints of the instability intervals [L~-, L~ + ] \n(in cm) for the i da mode in case NN. The analytic values are obtained using (20); the numerical \nprocedures will be discussed in the following section \nNN L; L~ L] L + L~ L; L; L + L; \nComputed 0.047 0.080 0.093 0.159 0.140 0 .238 0.186 0.317 0.232 \nAnalytic 0.0465 0.0793 0.093 0 .159 0.140 0 .238 0.186 0.317 0.233 \nshown in Fig. 5b. Since g > 0 when v = 0, v;~ < 0 near 0 and 1. If F crosses f = 0 \nan odd number  of times there are an odd number of inflection points in the graph \nof u(O, and sgn(u~) must be the same near 0 and 1. It follows that sgn(u~) = sgn(v~) \nin some interval in [0, 1], even for this cross act ivator- inhibi tor  system. This is in \nconstrast with the case of Neumann data. When (01, 02, 0~) = (0, 1, 0) (case DON), \nthere are several possibil it ies for the disposit ion of F, as shown in Fig. 5c. In \npart icular,  one sees that there are two distinct possibil it ies as L ~ 0, one in which \nboth u and v approach zero throughout  [0, 1], and another in which u tends to zero \nV V \nPattern formation in generalized Turing systems. I 361 \nU \nV \n• r ¢ \nU \nFig. 5, The disposition of F in the phase plane for \nthe glycolytic reaction under various combinations \nof boundary conditions. (a) (0x, 02, 03) = (1, 1,.), \n(b) (01, 0 z, 03) = (1, 0, 0), (c) (01, 0 z, 03) = (0, 1, 0) \nbut v tends to infinity. (As we remarked earlier, the latter possibility is of no \ninterest.) The sketches for the cases Da N and ND1 can be gotten from (b) (respec- \ntively, (c)) by translating F to the line u = u ~ (respectively, v = v~). \n3.2 Existence and stability for small L \nAs we observed in Sect. 2, in cases NN and D1D1 all solutions converge to \na spatially-uniform solution at sufficiently small L. However, this is not true in \ngeneral for mixed boundary conditions, as we now show. We first establish the \nexistence of solutions at small L, and then we analyze their stability. In the cases \nNDI and D1N there is a spatially-uniform steady state solution. This is not true in \nthe cases NDo, DoN and DoDo. \nFirst consider the cases NDi, with i equal to zero or one. Recall that \nv - D~\/coL 2 and let $2 ~ p-1. Equations (21) and (22) then become \nu;: + e2f (u, v, p) = 0 \n~v~ + eZg(u, v, p) = O, \nin (0, 1) (26) \n362 R. Dillon et al. \nand \n~u = 0 \n~0,1  \n(27) \nV[0, 1 ~ CO, \nwhere Co is either zero or v s. As L ~ 0,\/3 ~ 0, and for classical solutions this is \na regular perturbation problem. Thus we may assume solutions of the form \nU=UoW\/3gu~ + • \" \"  \n(28) \n\/) = \/30 \"{- \/32\/31 \"}- \" \" \" \nAt lowest order one finds that Uo(~) = cl, Vo(O = Co, where cl is to be determined. \nThe solvability condition at (9(\/32) reduces to the condition that f(uo, Vo, p)= O, \nwhich yields c~, and the components at  order (9(\/32) are \nU 1 ~ C 2 \ng(Uo, Vo, p) \nVl = (~ _ ~z) 26 \n(29) \nwhere c 2 is a constant. The solvability condition at (9(e4) implies that \nL(Uo,  P) f~ vl (0 d~. (30) VO, c2 - fu(Uo, Vo, p) \nOne finds that at (9(\/3 ~) the u component of the solution has nontrivial dependence \non ~. \nIt follows that as L ~ 0 the solution converges to (u, v) = ( f -  1 (0), 0) if Co = 0 \n(case NDo), while if co = v s (case ND1) it converges to (u, v) = (u s, v s) (cf. Fig. 5b, c). \nIn the former case the solution is clearly not constant, but in the latter case it is easy \nto show that (u(\/3z), v(\/32))- (u s, v s) for sufficiently small ~. Note that the only \nproperty of the glycolytic model that is essential here is that f=  0 intersects the \nu-axis once (it cannot intersect more than once). Thus the conclusions hold for \na more general class of mechanisms. \nA similar kind of analysis can be done in the cases DoN and D1N. However, in \nthese cases there are two branches of solutions that exist at L = 0, because the \nvertical lines u = constant intersect #(u, v, p) = 0 at two points. These intersections \nare at (u, v) = (0, ) and (0, oo ) in the case DoN. We leave it to the reader to derive \nthe leading order terms in these cases. \nNext we shall determine the stability of the solutions that exist at small L. First \nconsider the cases ND1 and D1 N, for which there is the constant solution (u ~, v~). In \nboth cases the variational problem relative to this solution consists of the first \nequation of (5), and the appropriate boundary conditions. The spectral problem is \nO2~p \nv~-~-  + (K - 2I)W = 0 (31) \n- -~- - -0  \ndff at ~ = 0, 1 (32) \nu? 2 =0 \nPattern formation in generalized Turing systems. I 363 \nfor ND1, and (31) plus the boundary conditions \nq~l = 0 \nat ( = 0,1 (33) \nOqJ2 -0  a( \nfor D1N. We assume that 6 > 0 and define e: - v -1 as before. Then (31) becomes \n6J c3~ 2 + (e2K - ;~I)W = 0 (34) \nwhere ,~---- e22. At\/3 = 0 (L = 0) the kinetic contribution vanishes, and it is easy to \nsee that the eigenvalues and eigenfunctions for ND1 are \n(I) ,~= - -  (r iTZ) 2 ~rlL=(COS; 7z( ) n = O, 1 , . . .  \n(cos \n(II) )~= - (nTt)2 q~ = \\s in  nn~ J n = 1, 2 . . . .  3 \n(°) (III) 2= -6 (me)  2 ~P= sinn~( n=l ,2 , . . . .  \nThe zero eigenvalue is simple and the corresponding eigenfunction is (1, 0) r. In the \nD1N case the two components are reversed in the preceding eigenfunctions. \nSince 2 =\/322, all but the zero eigenvalue have a pole of order two at\/3 = 0 \n(L = 0), and therefore the perturbed eigenfunctions corresponding to these eigen- \nvalues lead to decaying solutions for\/3 sufficiently small. Thus we only have to \ndetermine how the zero eigenvalue perturbs for small L Since the problem is \ninvariant under the transformation L ~ -L ,  the zero eigenvalue cannot pass \nthrough zero transversally, and there is no change in stability at L = 0. \nBecause the zero eigenvalue is simple it perturbs smoothly, and we may write \n= \/3221 -q- B422 q- . . . \n~-\/ = KI\/0 -~ \/32ki-\/1 --~ • . • \nwhere qJo = (1, 0) 7, (respectively, qJo -- (0, 1) r) for the case ND1 (respectively, D1 N). \nOne easily finds that 21 = kl l  for ND1, and 21 = k22 for D1N. Since kl1 < 0 and \nk22 > 0, it follows that the solution (u s, v s) is stable for small L in case NDI and \nunstable for small L in case D1N. \nThe three remaining cases are NDo, DoN, and the branch of solutions of D1 N \nthat terminates at (u s, ~), where z3 given by \n~3 = 1 - x\/1 - 4to(uS) 2\n2u s \nIn these cases the basic solution is not constant, and the variational problem has \nspace-dependent coefficients. In particular, the matrix K - K(e 2, ~) in (34) is \nI - -  K, - -  1) 2 - -  2uv ] \nK = Ko +\/3ZK1 + . . . .  \ntc + v 2 2uv - 1 ' \n3 These solutions exist only for 6 = I \n364 \nTable 2. The stability characteristics of solutions that exist \nat small L \nCase Basic Solution Stability Characteristics \nND o (\/~\/~:, 0) Stable \nN D 1 (u s, v ~ ) Stable \nD O N (13, 0) Stable \nD 1N (u s, v s ) Unstable \nD a N (u s, ~) Stable \nR. Dillon et al. \nwherein u and v have the expansions given in (28). In all cases the expansion at \norder (9(e 2) leads to the equation \n+ (Ko - 21I)tPo = 0 (35) \nand therefore 21 is given by \n(~o,  KoWo) \n~'1 = (36) \n(q%, ~t'o) \nIn the case NDo, ~Po = (1, 0) r and (Uo, Vo) = (\/~\/x, 0), and one finds that 21 = - x. \nSince ~c > 0, NDo is stable at small L. For DoN, ~o = (0, 1) r, (Uo, Vo) = (0, 0), and \n21 = - 1. Thus DoN is also stable near L = 0. Finally, on the nonuniform branch \nwhich terminates at (u,v)=(uS, f) in the case D1N, Wo=(0,1)  r and \n(Uo, v0) = (u s, ~). It follows that 21 = 2uS~3 - 1, which, from the expression above for \n~3, is negative. Thus the solutions on this branch are stable for small L. \nThe conclusions concerning existence and stability of solutions at small L are \nsummarized in Table 2. The interested reader can gain further insight into these \nresults by a direct qualitative analysis of the evolution equations i  this limit. \nOne sees from this table that there are both similarities and differences between \nscalar and mixed boundary conditions. It follows from the results in [24] and [8] \nthat under homogeneous scalar Neumann conditions the solution (u, v) = (u s, v s) of \n(26) is unique and stable for sufficiently small L, and this is also true for the mixed \ncase ND1. However, the same solution is unstable (and not unique) in the mixed \ncase D1N. One can also show that this solution is stable in the scalar case D1D1, \n(this follows from the results in [8]), and thus there are several eigenvalue crossings \n(and possibly bifurcations) as one homotops the boundary conditions around the \nedges of the face ®3 = 1 in Fig. 2. Other differences will emerge from the numerical \nresults described in the following section. \n3.3 Linear analysis for general L \nAs we pointed out in Sect. 2, when the boundary conditions are not scalar \nconditions, the linear analysis is much more difficult because the eigenfunctions do \nnot have the simple product form. In Appendix A we consider the linear evolution \nequations associated with (21) for the case D1N. We show that in this case each \neigenfunction is an infinite sum of trignometric functions and that the growth rate \nPattern formation in generalized Turing systems. I 365 \nof each eigenfunction (given by the dispersion relation) is the solution of a general- \nized eigenvalue problem involving infinite-dimensional matrices. To solve this we \nconsider finite dimensional approximations (FDA) to this infinite dimensional \nsystem. We present some examples in A.1 to illustrate the procedure. The conver- \ngence properties of the FDA are studied numerically and it appears that for simple \ntypes of spatial patterns a low order FDA gives accurate approximations to the full \nsolution. We also show that the spatial eigenfunctions thus calculated agree very \nclosely with the corresponding solution to the steady state problem of the full \nnonlinear problem as calculated by AUTO (see Sect. 4 and Appendix B). \nIn A.2 we relate the eigenfunctions of the mixed boundary problem to those of \nthe NN case and in A.3 we illustrate how the FDA procedure can be adapted to \nlocate bifurcation points. \n4 Numerical results \nIn the preceding section we establish the existence of various branches of solutions \nof the steady-state Eqs. (21) at small L, and determined their stability. In this \nsection we present a more complete picture of the solution set as a function of L, \nobtained by using numerical continuation and bifurcation techniques. We first \npresent he solutions at six of the eight nodes in the homotopy cube shown in Fig. \n2, and compare the properties of the solutions as L varies under the different types \nof boundary conditions. We then discuss some results obtained by solving the \ncorresponding evolution equations. \nThe numerical results on steady-state solutions were obtained by discretizing \nthe differential equations using finite differences, and then solving the resulting \nnonlinear algebraic system using the software package AUTO [11]. The details of \nthe numerical methods used are given in Appendix B. \n4.1 Steady state solutions \nFigure 6 shows a schematic summary of the primary bifurcation structure as \na function of L for various combinations of boundary conditions. For simplicity \nnot all of the solutions are shown in the case D 1N. Some of the similarities and \ndifferences that emerge from this figure are as follows. \n• The structure of the solution set is quite similar in the cases NN and DIDo, \nwhich are the standard Turing cases. In both cases there is a basic constant solution \n(u, v) = (u s, vs), and the bifurcation points on these branches are identical. As we \nshall see later, the solutions on the primary bifurcating branches are dominated by \nthe mode that changes tability at the corresponding primary bifurcation point. \nThis fact accounts for the principle difference in the spatial distribution of the two \ncomponents in these cases, for in the NN case the eigenfunctions of the variational \nproblem relative to the basic solution are cosines, whereas in the D~D~ case they \nare sines. \n• In four of the six cases shown in this figure, the constant solution (u, v) -- (u s, v s) \nexists for all L, and the structure of the solution set is significantly more complex \nthan in the remaining cases. In particular, in the latter cases there are large intervals \nin which there are no bifurcation points, but as we will see later, the nodal structure \n366 R. Dillon et al. \n02 \nD.N ~S¢ ~¢~-~ -~ ' -  -~- - : '~- - -  \nP\/\"\" \/ \nFig. 6. Schematic illustration of homotopy relationships and a summary of the primary bifurca- \ntion structure for different sets of boundary conditions. The detailed bifurcation diagrams and \nsolution profiles for the different cases are presented in the following figures: NN (Figs. 7a nd 8); \nD1D 1 (Figs. 7b and 9); NDI (Figs. 10 and 11); DIN (Figs. 12 and 13); DoN (Figs. 14 and 15); ND o \n(Figs. 16 and 17). Here and hereafter we use the following otltion. For bifurcation diagrams the \nhorizontal axis is length, L (cm), and the vertical axis is the Euclidean norm, II (u, v) 115, of the \nsolution vector, where (u, v)~ R s2. denotes a stable branch, - -  -denotes an unstable \nbranch. For concentration profiles - -denotes  u and ---denotes v\nof the solutions can change nonetheless. Thus the imposition of zero boundary \nconditions on either of the species greatly reduces the admissible types of spatial \nprofiles for the two components. In particular, it will become clear from a later \ndiagram that the solution structure in case DoN is essentially that of case D1 N, \nminus the solutions associated with bifurcations from the basic branch. \nThe detailed bifurcation diagrams and the spatial profiles of selected solutions \nassociated with the summary given in Fig. 6 are given in Figs. 7-17. These are \ndiscussed in the following subsection, but some readers may wish to skip the details \nand go directly to the summary Sect. 4.3. \n4.2 A comparison of the results \nAs we indicated earlier, the bifurcation points in the NN and D1D1 cases can be \ncomputed analytically and Table 1 shows a comparison between the analytical and \nnumerical values in these cases. It is clear from the table that the bifurcation points \ncan be located accurately numerically. One can show analytically that the bifurca- \ntions are either subcritical or supercritical, i.e., they are all pitchfork bifurcations. In \nboth the NN and DD cases the nonconstant component of solutions on the jm \nprimary bifurcation branch (the branch that bifurcates from the constant solution \nPattern formation in generalized Turing systems. I \nII(~,v)llE \n9.70 \/ a \n9.60 t \n! \n9\"001 I *'LI I I I \n0.00 0.05 0.10 0.15 0.20  0 .25  0 .30  0 .35  \nLENGTH (cm) \nII(~,v)ll~ \n11.5 \n11.( \n10.5_ \ni0.0_ \n9.5, \n9,0. \n0,5 \n0 00 \n(a )  \nI \n' A (c )  \n(b ,, \ni -~  \\ \/  \/ \\  ,,'\" \ni___~-\/- ,,z'.'. \/ \nI I I I I I I \n0.10 0.20 0.30 0.40 \nLENGTH (cm) \n367 \nFig. 7. Bifurcation diagrams for NN \n(a) and for DiD 1 (b). Solution pro- \nfiles at selected points on the bifurca- \ntion diagrams are shown in Fig. 8 for \nNN and in Fig. 9 for D1D 1. The \nbifurcation diagram for NN is com- \nplete for the first three modes. The \nhorizontal line is the uniform steady \nstate and all other solutions hown \nbifurcate from it. There is no second- \nary bifurcation from the first mode; \nthe change in stability on this branch \nis a turning point. There is a second- \nary branch connecting modes 2 and \n3, and one connecting modes 3 and 4. \nNote that there is an interval in \nwhich stable solutions on the second \nand third branch coexist, and sim- \nilarly for the third and fourth branch. \nThere is also a small interval near \nL = 0.22 in which three stable solu- \ntions coexist. In the case of D1D 1 \nthere is a large interval around \nL = 0.15 in which three stable solu- \ntions coexist \nat L\/+- ) is dominated by the f  h mode. This follows from an asymptot ic  analysis near \nthe bifurcation points, but  holds far from these points as well. To i l lustrate this, \nTable 3 shows the ampl i tudes of the Four ier  cosine components for the solutions \nwhose spatial  profiles are given in Fig. 8. \nIn view of this dominance of the unstable mode, it is easy to characterize the \nnodal  structure for each component  at a given L, as long as the instabil ity intervals \ndo not overlap. However,  one sees in Fig. 7 that the intervals overlap at larger L, as \npredicted earlier, and that there may be secondary branches of solutions that \n368 R. D i l l on  et al. \nO \nif-. \n\/X \n0) \ne~O \n[ -  \no6 \n..= \nO \nO \nO . \nQ \n+11 I I I ~ I I I \nI I I I  \n+l  I I I I I I i I \nI l l  I \n+ l l l l l l l  \n+ 1 1 1 1 1 1 1  \nI I  I I \n+1111 \n+1111 \nI I \n+ I I \n~ ¢ ~ -  \n+ I I \ni I \nPattern formation in generalized Turing systems. I 369 \n2.0 2.0 \n1.6 \n1.2 \n0.8 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n0.4 \n0.0 I I I I I I L I \n0.0 0.2 0.4 0.6 0.8 1.0 0.2 0.4 0.6 0.8 1 +0 \nSCALED LENGTH (~) SCALED LENGTH (~) \n2.0 2.0 \n1.6 \n1.2 \n0.8 \n0,4 \n0.0 \n0.0 \n1+6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \nI I I I I I I I \n0.2 0.4 0.6 O.g 1.0 0+2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (() SCALED LENGTH ((} \nFig. 8. Panels a~l show the spatial profiles of the solutions at the points labeled a~l in Fig. 7(a). \nThe corresponding L values are 0.05, 0.1, 0.1482, and 0.2, respectively. Solutions on primary \nbifurcation branches corresponding to even modes are approximately symmetric about ~ = 0.5, \nand solutions on branches corresponding to odd modes are approximately anti-symmetric about \n= 0.5. The solution in panel c, which is a mixed-mode solution on a secondary branch, cannot \nbe characterized as having a uniform phase difference of 0 or \nconnect primary branches. On such branches the solution is typically a mix of the \ndominant modes that characterize the primary branches. An example is given by \nthe solution labelled (c) in Fig. 7, which lies on an unstable secondary branch \nconnecting the second and third primary branches. On the primary branches the \nspatial gradients are opposed, i.e., sgn(u~)= -sgn(v~),  but this is not true on \nsecondary branches. Similar statements apply to the other standard Turing case, \nnamely D1D1, and we do not elaborate on this further. \nEach of the branches for j odd in Fig. 7 corresponds to two solutions, one of \nwhich is transformed into the other under reflection across ~ = 1\/2. Of course both \nof these have the same norm. The two solutions corresponding to j even can be \nobtained by concatenating solutions for j \/2  in two combinations. In the continuous \nproblem the L2 norms of these solutions coincide, but that is not true for the \ndiscrete norm used here, because the number of mesh points is fixed. As a result, \nthere is another branch of solutions for j even that is not shown in Fig. 7. In any \ncase, the isotropy group of the solutions on these branches (i.e., the group of \nsymmetry transformations that leaves the solutions invariant), is constant on any \nconnected component of a branch that contains no bifurcation points [25]. \nThe number of primary bifurcation points is significantly reduced if instead of \na homogeneous Neumann condition on v one sets v = v S on the boundary. This is \nthe case ND1, for which the bifurcation diagram is shown in Fig. 10. In this case \nthere are only four bifurcation points on the basic solution for L e [t3, 0.5], \n370 R. Dillon et al. \n2.0  i i i J \n1.2 ~ \n0.8 \n0.4 \n0.0 ~ i i J \n0.0 0.2 0.4 0.6 0.8 \nSEALED LENGTH (~) \n1.0 \n2.0 \n1.6 \n1.2 \n0.8 \n0,4 \n0.0 \n0.0 \nI I I I \n0,2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) \n2.0 i , 2.0 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n\/ ' , ,  \/ ' , ,  \n\\ z  . . . .  \n1,6 \n1,2 \n0.8 \n0.4 \n0.0 \n0.0 0.2 0.4 0.6 0.8 1,0 0.2 0.4 0.6 0.8 \nSEALED LENGTH (~) SEALED LENGTH (~) \n1.0 \nFig. 9. Panel a~i  show the spatial profiles of the solutions at the points labeled a-d in Fig. 7b. The \ncorresponding L values are 0.05, 0.1, 0.2, and 0.3, respectively. On primary branches, even mode \nsolutions are approximately symmetric about ~ = 0.5, odd mode solutions are approximately \nanti-symmetric about ¢ = 0.5 \n[f(u,v)llz \n9.35 .  \n9,3q \n9 .25_  \n9 .20_  \n9 .15_  \n9.10_ \n9.05 \n9.00  \n0.00  \n(a) ~t. . . . . . . . . . . . . . . . . . . . . . .  \n(b) \nI I I I \n0.10  0.20  0 .30  0 .40  0.50  0.60  \nLENGTH (crn) \nFig. 10. The bifurcation diagram \nfor ND 1. There are 2 bifurcation \npoints from the uniform steady \nstate for L e(0.04, 0.36), one at \nL=0.216  and the other at \nL = 0.226. The bifurcation branch \nat L = 0.216 is a closed loop that \nintersects the uniform steady state \nat only one point. In this profile the \nbranch folds back on itself and re- \nturns to the bifurcation point. \nSolutions for this case at the \nlabeled points are shown in Fig. 11 \nPattern formation in generalized Turing systems. I 371 \n2.0 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n. . . .  ~ \/ ~  . . . .  ~ . . . .  \nI } I I \n0,2 0.4 0.6 0.8 \nSEALED LENGTH (~) \n1.0 \n2.0 F\" \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \nI I F I \n0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (() \n2.0 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n2.0 d \n1.6 \n1.2 - \nL\":_ \n0 .8  \n0.4 \n0.0  \n0.0 \nI I I I I I L L , _ _  \n0.2 0.4 0.6 0.8 1.0 0.2 0.4 0,6 0.8 1.0 \nSCALED LENGTH (~ SCALED LENGTH (~) \nFig. 11. Panels a--d show the spatial profiles of the solutions for ND t at the points labeled a-d in \nFig. 10. In panel a L = 0.219, in b L = 0.228, and in c and d L = 0.25 \ncompared with sixteen in either case NN or case D1 D 1. Furthermore, the global \nstructure of the solution set is much simpler in this range of L than it is in either of \nthe standard Turing cases. Thus two effects of these mixed conditions are that the \nuniform steady state is stable over a larger L interval, and the solution set is \nsimplified. \nSolutions on the first nonuniform branch are approximately, but not pre- \ncisely, anti-symmetric about'~ = 0.5, whereas on the second branch, solutions are \napproximately symmetric. If the two equations at (21) were not coupled via \nthe kinetic vectorfield, the eigenfunctions of the variational problem relative to \n(u s, v ~) would be of the form (cos(nn~), sin(mn~)), and thus it is natural to character- \nize the nonconstant solutions shown in Fig. 11 in terms of this basis. The results \nof this representation are shown in Table 4. Solutions (b) and (d), which lie on \nthe same branch, have a similar amplitude spectrum, but those of (a) and (c), which \nlie on different branches, are quite different. Of course one expects that all these \nsolutions can be characterized in terms of a dominant mode, and in essence the \nresults in the table show which trigonometric functions appear in those modes. As \nwe remarked earlier, one has to solve the coupled system directly to obtain these \nmodes. Several examples of the procedure are given in Appendix A for the case \nDiN.  \nSince the case ND t can be obtained from the case NN by a homotopy of one \nboundary condition, one may ask about the correspondence between bifurcation \npoints and nontrivial solutions in these cases. A generic perturbation of the \nboundary conditions for a Neumann problem would remove some or all of the \n372 R. D i l l on  et al. \n8 \nO \ng.., \nI \nA \n°~ \nO \nO \nO \n÷ I \no , ,d  \nI \n÷ I \neq t-'-i \nO O  \n+ [ \nO¢ 'q  \nO ¢',!. \nO ~  \nO ~  \nO O  \n÷ I \nt '~  \nt\"'.- O \n÷ [ \nI \nOO \n÷ I \n÷ i \noe - , i  \n~ o  \no ~  \noeq  \n+ i \neq~ \ni i i i i i i i i i i \ni i  i i i \nr i [ i  i l l l l l  \ni \n~ O O O O ~ O O O O  \nI I I  I I I I I I  \n1 I I  1 I l l  \nI I I  I I I I I I  \nO n  \nI I I I \nI I I  I \nI I I  I \nO O O ~ O ~ O  \nI I I  I \nI I I \nO O O O O ~ O O  \nI I f  I I I  \nI I  I J l ~ l l  \nI I  \nPattern formation in generalized Turing systems. I 373 \nII<~,,lll~ \n12.0 \n11.5 \nii.(] \n10.5 \n10.C \n9.5_ \n9.0_ \n8.5 \n0.00 \nr \n\/ \n\/ \ni \n- - ' r - - :  . . . . . . . . . . .  f - - '~\"  . . . . . . . . . . . . . . . . . . . . . . . .  \nt \nI I I I I \n0.10 0.20 0.30 0.40 0.50 0.60 \nLENGTH (cm) \n[l(u,v)llE \n30 ... \n25. \n20. \n15._ \ni0._ \n5._ \nb \n<'>\/\/ \n0.  \nI I I I \n0.00 0.10 0.20 0.30 0.40 0.50 \nLENGTH (cm) \nFig. 12. Bifurcation diagrams for case D1N. Panel a shows solutions that bifurcate from the \nspatially-uniform steady state, panel b shows the continuation of the branch discussed in Sect. 3. \nbifurcation points, but here they persist locally in a two-parameter family under \na small decrease in the homotopy parameter 02, because the basic solution (u% v ') \npersists under this homotopy. In Fig. 18 we show the loci traced out in the (L, 02) \nplane by fixed small amplitude solutions that lie near each of the bifurcation points \n374 R. Dillon et al. \nI1('~, v)IIE \n10 ,00  \n9.71 c \n9 .5  \n, . oo4-  ~ . . . . . . .  ¢ . . . .  . .  . . . . .  ~ _ : :  . . . . . . . . . .  : _ :  . . . . . . . . .  \n8\"50 t \n8 .2~ \n8.0  I I I I I \n0.10 0.15 0.20 0.25 0.30 0,35 0.41 \nLENGTH (cm) \nFig. 12. Bifurcation diagrams for case D1N. Panel c shows a blow-up of the composite. Solutions \nat the labeled points are shown in Fig. 13 \n3.0 \n2.5 \n2.0 \n1.5 \n1.0 \n0.5 \n0.0 \n0 .0  \nf I I I \n0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) \n0.0 0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) \n2.0 2.0 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0  \n0 .0  \n\/ \n0.2 0.4- 0.6 0.8 1.0 \nSCALED LENGTH (~1 \n1.6 \n1.2 \n0.8 \n0.4 \n0.0  \n0 .0  \n• ° ,  . -• \/ \\ \/' \nI ~, \/ \\ \ni x  \/ ,, \ni ',,..\/ ,,, , . \\ \n, so  \n- s° ,  I I I I .~-, \n0.2 0,4 0.6 0.8 1.0 \nSCALED LENGTH (~} \nFig. 13. Panels a--d show the spatial profiles of the solutions for DIN at the points labeled a-d in \nFig. 12b (at L = 0.1, 0.2, 0.2, and0.3, respectively) \n375 \n30._  \n25._  \n20.. \n15.  \nI0 .  \n5 .  \n0.. \n0 \n2.0 \n\/ \nL (d) \/ ,~ . . - - - .~-  \nI I I I \nO0  0. i0  0 .20  0 .30  0.40  \nLENGTH (era) \n0.50  \nFig. 14. Bifurcation diagram for \nthe D O N case, Note the similarity \nbetween this diagram and Fig. \n12(b) \n-,\\ \n1,6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n2.0 \n1.S \n1.2 \n0.8 \n0.4 \n0,0 \n2.0 \n0.2 0.4 0.6 0.8 1,0 0.0 0.2 0.4 0.6 0.8 \nSCALED LENGTH (~] SEALED LENGTH (~) \n2.0 I l i I i \nPattern formation in generalized Turing systems. I \nI I (u,v) l lE  \n35._ \n, . _  I \n16 16 , - .  ,-. \n, \\  \/ \\ \n0.8 0.8 \n0.4 0.4 \n0.0 0.0 ~__.¢~o I I I ~ ~ \n0.0 0.2 0.4 0.6 0.8 1.0 0,0 0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) SCALED LENGTH (~) \nFig. 15. Panels a-d show the spatial profiles of the solutions for DoN at the points labeled'a~d in \nFig. 14 (at L = 0.1, 0.2, 0.2, and 0.3, respectively) \n376 \n'fl('~,\")ll~: \n1-5, \nR. Dillon et al. \n1-4 ._  \n1-3 ._ \n]-2. \n11.  \n: l_O . _  \n(a) \nI \nu \nI \na \ni \na \nI \n(b) f-~ x (d) \n\\ \/ \\ (c) ~ __ .4  \n9,  \nI I I I \n0.00 0.10 0.20 0.30 0.40 \nLENGTH (crn)  \n0.50  \nFig r 16. Bifurcation diagram for \nthe ND o case. The global \ncontinuation of the branch \ndiscussed in Sect. 3 is shown. \nThere are at least two Hopf \nbifurcation points on this branch, \none at L = 0.00614, and the other \nat L = 0.0812. Solutions at the \nlabeled points are shown in Fig. \n17 \n2.0 \n1.6 \n0.8 \/ \", \no ~ • \nO. 4 \/ \/ \/  • '•~• fo \n0,0 , J J i F J ~ \n0.0 0.2 0.4 0,6 0.8 \nSCAI~ED LENGTH (~) \n1.0 \n2.0 13 ' i , i \/ o , ,  J ' i \n1.6 I f \"  \" \"~,, \n- '  \nI \\ k  \n0.4 • • \n0.0  [ ~ °~° ~_ I ~ [ r I ~ I \n0.0 0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) \n2.0 I I I ~ -  \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 L \n0.0 \n\/ , \/ k \ni \" ! ', n ~ u i \n,,, - -  , \n\/ \n0.2 0.4 0.6 0.8 1.0 \nSCALED LENGTH (~) \n2.0 ~ n i i , ~ \n1.6 \n1.2 \n0.8 \n0.4 \n0.0 \n0.0 \n\" -  \/ , ,  , - \ni \". i \" i : \nl I \nm I \" i a - \ni \\ \n0.2 0.4 0.6 0.8 1,0 \nSCALED LENGTH (~] \nFig. 17. Panels a--d show the spatial profiles of the solutions for ND o at the points labeled a--d in \nFig. 16 (at L = 0.05, 0.1, 0.2, and 0.4, respectively) \n02 \n1.00_ \n0.80_  \n0.60_  \n0,40 \n0.20 \n0.00  \n0 .00  \nI '  I I 1 I \nO. lO  0 .20  \nPattern formation in generalized Turing systems. I 377 \n0.30  \nLENGTH (cm) \nFig. 18. The locus of bifurcation \npoints on the uniform steady state in \nthe two-parameter L - 02 plane. \nNote that several pairs of bifurcation \npoints that exist in the NN case \ncoalesce as 02 is decreased, which \nleads to a much simpler bifurcation \ndiagram for ND 1 (cf. Figs. 7a and 10) \nat 02 = 1. To obtain these loci, we augment the algebraic equations obtained by \ndiscretizing the partial differential equations with the functional \np3 - { [u (O - ¢ ]2  + [v(~) - v ' ]  2} a~. \n0 \nWe then pick a solution near the bifurcation point (with P3 \"\" (9(10-'°)), and \ncontinue this solution in the two parameters (L, 02). We follow this procedure, \nrather than augment he equations to find zeroes of the determinant of the \nalgebraic system, because following the zeroes of the determinant is numerically \nvery sensitive. Given the above choice of P3, the results hould be indistinguishable \nin the two approaches, and this was verified by a separate computation at 02 = 1. \nOne sees from Fig. 18 that only two bifurcation points continue from case NN to \ncase ND t; the remainder disappear pairwise at intermediate values of 02. Further- \nmore, in the range of L shown there are no other bifurcation points at 02 = 0. In \ncase NN these points correspond to modes three and four, and while these modes \nare present in the solutions for ND~, other modes are present aswell. Thus there is \nlittle connection between the solutions in these cases. \nBy contrast with the case ND~, in which the mixed condition simplifies the \nsolution set as a function of L, imposing the Dirichlet condition on u has the \nopposite ffect. One sees in Fig. 12 that there are two disjoint components of the \nsolution set, one comprising solutions connected with the uniform steady state, and \nanother comprising solutions that are connected with the stable non-constant \nsolution that was discussed in Sect. 3. The second set is more interesting than the \nfirst, because there are stable solutions for all L > 0 on it. One may again \ninvestigate the correspondence b tween these solutions and those in case NN,  and \nthe results are shown in Fig. 19. The procedure for the continuation is the same as \n378 R. Dillon et al. \n01 \n1.00., \n0.80~ \n0.60_ \n0.40_  \n0.20 \nL \n\\\\ \n\\ \n0.20 \nLENGTH (~) \n\\ \n0.00  I I \n0.00  0.40 \nFig. 19. A homotopy of the \nbifurcation points between case NN \n((01, 02, 0a) = (1, 1, i)) and D1N \n((01, 02, 03) = (0, 1, 1)). The curves \nshow the locus of bifurcation points \non the uniform steady state as \n01 varies. There is a codimension- \ntwo bifurcation point at (0, 1), and \none curve of bifurcation points \nemanating from there terminates at \nL; \nused previously, and it succeeds for the same reason as before. One sees that in the \nrange L e (0, 0.4) only three of the fourteen bifurcation points that exist in case NN \ncontinue to case DaN. In addition, there are two bifurcation points on the basic \nsolution for D IN  that are not connected to bifurcation points for NN. \nSpatial profiles of the solutions labelled (a)-(d) in Fig. 12 are shown in Fig. 13, \nand the amplitude spectrum of these solutions relative to the basis {(sin(mzc~), \ncos(nn~))} is given in Table 5. The solutions labelled (a) and (b) have v ~ 0, and \nu g k sin n~ for some constant k. Solutions such as (c) and (d) are characterized by \na few cosine modes in u and a few sine modes in v. Generally speaking, u is \ndominated by a few even cosine modes whereas v is dominated by a few odd sine \nmodes in case DIN. \nThe transition from DaN to DoN involves a homotopy in 03. One sees from \na comparison of Figs. 12 and 14 that this transition prunes off all solutions \nconnected with the basic solution (u s, vS). The profiles along the remaining branch \nare remarkably similar at the same L values, except hat in case DoN u is pinned at \nzero at the endpoints, rather than at u ~ (cf. Figs. 13 and 15). \nThe last case considered is NDo, which can be gotten from case NN via \na homotopy in 02. One sees from the bifurcation diagram for this case (cf. Fig. 16) \nthat there is no apparent connection between the structure of the solution set in this \ncase and that in any of the other cases. The main branch shown in Fig. 16 begins at \nthe point (u, v) = (fl\/x), at L = 0, as was shown in Sect. 3 (cf. Fig. 5b). There are \nHopf bifurcation points on this branch at L = 0.00614 and L = 0.0812, and \nperiodic solutions bifurcate at these points. The periodic solutions are nearly \nsynchronized in space and are qualitatively similar to the periodic solutions that \nexist in the local dynamics at a slightly larger value of fl (cf. [1]). Aside from the \nshort secondary branch which shortcuts the turn in the main branch at about \nPattern formation in generalized Turing systems. I 379 \n.--k \n% \nO \n..a \n0 \nag \nA \nO \n+111111 \n+ l l l l l l  \n+ L I I I  \n+t111 \nI \nI I I I  \n++11 \ne¢3~ \n~ O  \nI I \nt-e3 \nO ~  \nq-q- \n~oo \n380 R. Dillon et al. \nL = 0.3, there is in fact a single branch of time-independent solutions in the range \nof L shown. Solutions on this branch can change their nodal structure without \npassing through a bifurcation point. We can characterize the \"mode\" for solutions \nof NDo, by the number of connected components in [0, 1] in which v > u. In this \nway the \"mode\" numbers increase with L. The solution at L = 0.05 is \"mode\" 0, the \nsolution at L = 0.1 is \"mode\" 1, the solution at L = 0.2 is \"mode\" 2, while that at \nL = 0.4 is \"mode\" 3. Except for a short interval at about L = 0.3, the \"modes\" do \nnot overlap, i.e., over a large range of L there is only one stable solution. In \ncomparison with the NN case, the problem of multiple stable solutions for a given \nL is greatly reduced. \n4.3 Summary \nSeveral important conclusions can be drawn from these results, and we summarize \nthem as follows. \n(i) Nodal structure of solutions: Tables 4-7, for the cases ND1, D1N, DoN and \nNDo, respectively, show that the spatial distribution of the species which satisfies \nNeumann conditions is dominated by cosine modes, while the species which \nsatisfies Dirichlet conditions is dominated by sine modes. Imposing Dirichlet \nconditions on one species appears, in many cases, to reduce the anti-symmetric \n(odd cosine) mode components ofthe species which satisfies a Neumann condition \n(see Tables 4-7). The concentration profiles are not precisely symmetric about \n= 0.5 due to the higher order modes of the nonlinear problem and to the presence \nof the anti-symmetric modes. Comparison with linear analysis for some typical \ncases is made in Appendix A. I, Examples 4and 5, and the relationship with the NN \ncase is discussed in Appendix A.2. The linear analysis done in Appendix A predicts \nthat eigenfunctions containing odd (even) sine components in the Dirichlet species \nare coupled with those in the Neumann species that contain even (odd) cosine \ncomponents. \n(ii) Symmetry properties: In Sect. 2 (Proposition 5) we proved that for a kinetic \nmechanism of global cross activator-inhibitor type with Neumann boundary \nconditions on both species the nonconstant solution profiles are out of phase, at \nleast in the vicinity of a primary bifurcation point. Our numerical solutions confirm \nthis, but Fig. 8c shows that this does not necessarily hold on secondary bifurcation \nbranches. \n(iii) In the case of mixed boundary conditions it becomes meaningless to talk of \nphase differences, ince one is then comparing the several dominant cosine modes \nof the Neumann species with the several dominant sine modes of the Dirichlet \nspecies (see for example, Figs. 13, 15, and 17). However, in this case, a maximum of \none species almost coincides with a minimum of the other species. This is also true \nfor the NN case and appears to be a general property of a kinetic mechanism of \nglobal cross activator-inhibitor type that holds regardless of the boundary condi- \ntions imposed. \n(iv) Complexity of the bifurcation diagram: The complexity of the bifurcation \nbehavior of the system can be greatly reduced by changing the boundary condi- \ntions. For example, over the interval L ~ (0, 0.5) there are sixteen bifurcation points \nfrom the uniform steady state for the NN case (Fig. 7) but only four bifurcation \nPattern formation in generalized Turing systems. I 381 \nO \nO \nb \nA \nO \n.=. \nO \nO \n_= \n0A \nG \n+111111 \nI I I I  \n+ + l l [ l [  \nI I I I I  \n++111 \nI I I I  \nI \ngg~ \n++[[  \nI I \n~ID ¢'q \n~g \n++ \n~tn  \nOO~ \n382 R. Dil lon et al. \nA \n~D \nQ \n~:t0 \no \n[.. \nt.z \nO \n• -= ~2 \nz~ \n+ + f l l l l [  \n+ l l l l l l l  \n+ + r i l l  \n+11111 \n++l l  \nr \n+111 \n++ \n~5,.z \n+ I \n,~ -o~ \n¢,-,I tr~ \nPattern formation i generalized Turing systems. I 383 \npoints for the ND1 case (Fig. 10). The reduction in the number of primary bifurca- \ntion points as 02 homotopies from NN to ND 1 is illustrated in Fig. 18, which shows \nthat as 02 decreases some pairs of bifurcation points coalesce into a single point, \nwhich then disappears. Others drift to the right with L. Hence fixing v = v s at the \nboundary increases the range in L over which the uniform steady state is stable. \nFigure 19 shows that the number of primary bifurcation points also decreases as \none homotopies from NN to DtN. Along with the reduction in the number of \nbifurcation points, changing the boundary conditions to mixed type can reduce the \nmultiplicity of stable solutions. For example, in the NDo case there is only one \nstable solution over a large range of L. Furthermore, there is only a very short \nrange of L over which multiple solutions exist, and these are not stable. This is \ngraphically illustrated in Fig. 20. \n(v) Behavior at small L: In the NN case, a minimum domain length is required for \na nonconstant steady state solution to exist (Sect. 2.2 and Fig. 7). However, for the \nmixed boundary problem D1 N, we showed in Sect. 3 that the constant solution is \nunstable at arbitrarily small L, and that there is a stable nonconstant solution at \nsmall L (cf. Fig. 13). In cases DoN and NDo there is no constant solution, but in \neach case there is a stable nonconstant solution at sufficiently small L. \n5 Discussion \nSince the seminal paper of Turing in 1952, a large number of Turing-type models \nhave been proposed for spatial pattern formation. It has been shown that such \nmodels exhibit a great variety of spatially patterned solutions and their properties \nhave been widely studied mathematically, while the mechanisms have been exten- \nsively proposed to account for spatial pattern formation i  a number of developmen- \ntal contexts. Although these models exhibit a bewildering range and complexity of \npatterns, nature appears to select only a relatively small number of these patterns. \nTherefore the essential feature of any realistic model for development is not so much \nthat of pattern generation but that of carefully selecting a small number of patterns in \na robust and controlled manner. It is already well-known that in Turing models, the \npattern selection process is very sensitive to initial conditions, cale, geometry, and \nparameter variation. As they stand, therefore, Turing models are inadequate to \naccount for robust patterning mechanisms such as those that underlie, for example, \nthe development of skeletal patterns in the tetrapod limb. \nIn this paper we have shown that in one space dimension the properties of the \nsolutions of a reaction-diffusion system can be profoundly affected by the nature of \nthe boundary conditions. In particular, we have shown that imposing nonscalar \nboundary conditions can lead, in a robust and controlled manner, to a sequence of \ntransitions that closely resembles those observed in skeletal patterning in the \ndeveloping limb, as shown in Fig. 20. We took the domain length L as the \nbifurcation parameter in this study. However, as this parameter occurs in a dimen- \nsionless group that involves diffusion coefficients and a characteristic reaction time, \nthe sequence of transitions shown in Fig. 20 could be generated in other ways. For \nexample, it could arise from a change in the permeability ofgap junctions between \nthe cells [5], which in a continuum description is reflected in a change in the \ndiffusion coefficients [29]. This possibility has recently been incorporated in \na two-dimensional model of limb development [10]. \n384 R. Dillon et al. \nI.[ \nO@ \n0.@ \n0A \n02 \nOl O.2 0.3 \nL \n0.8 \n0.6 \n0.4 \n0.2 \nO,%O \ni I \nI \n2 04 06 \nt \nFig. 20. a, b Shown here are the subintervals of (0, 1) in which the v-component of the solution \nexceeds a fixed threshold, as a function of the length L. a Case NN,  b Case ND o. In a only one of \nthe pairs of solutions which exist a  each L is shown. It is clear from b that a simple threshold \nmechanism can reliably produce the sequence 1, 2 . . . .  of pattern elements as the length i creases, \nwhereas this is impossible for the standard Turing model, as shown in a \nNote that our model solutions capture neither the anterior-posterior spatial \nasymmetries observed in the skeletal elements of the limb nor their temporal \nsequence of development along this axis. Recently, Benson et al. [3, 4] have shown \nthat a spatially varying diffflsion coefficient can produce such spatial asymmetry. \nThe temporal sequence of pattern formation may be due to cells responding to the \nspatial pattern in a time-specific fashion. \nComputations not reported here show that nonscalar boundary conditions also \nlead to pattern formation for a much larger atio of diffusion coefficients han in the \nscalar case, thereby enlarging the parameter domain over which certain patterns \nexist and hence lowering pattern sensitivity to small changes in the environment. \nA further consequence ofnonscalar boundary conditions is that, depending on the \nexact form of the conditions, the model can exhibit stable, spatially nonuniform \npatterns at very small lengths. This is in contrast o the Turing model, which only \nexhibits the spatially uniform steady state in this limit. \nIn summary, boundary conditions have a marked affect on the patterns exhib- \nited by reaction-diffusion models in one space dimension. We would expect his \neffect o be even more pronounced in two- and three-dimensions, because in these \ncases one has an even wider choice of different ypes of boundary conditions. \nA Appendix \nA.1 Linear stability analysis \nIn this appendix we consider the variational equation associated with (l 1) in more \ndetail. We write it in the form \n0~1 0241 \n~2 e 0242 ..~ k21~ 1 \"l- k22~2 , ~Z = OV \n( ~ (0, 1) (37) \nPattern formation in generalized Turing systems. I 385 \nand we first consider the boundary conditions \n¢~=0,  0~2=0,  a te=0,1  (38) \nwhich correspond to case DiN. Recall that we know from Sect. 3 that the \nspatially-uniform steady state (u s, v9 is unstable at small L in this case. (Recall that \nthere is also a nonconstant, stable solution in this case.) \nSince the boundary conditions are not scalar conditions, the eigenfunctions do \nnot have a simple product form. However, functions that vanish at the endpoints \nhave a sine expansion and those with a vanishing derivative at the endpoints have \na cosine expansion. Therefore, (37) and (38) have solutions of the form \n(~)  =ez~@~2 \nwhere \n@ 1 Am sin(rare() \n= . (39) \n\\.~=o B,,cos(n~) \/ \nBy contrast, in the classical inear problem with scalar homogeneous Neumann \nconditions, the n th eigenfunction is of the form \n(A\" )  cos(nrc~). (40) \n@= B, \nSubstituting (39) into (37) we obtain \n[2 + v(mrc) 2 -- k i l l  Am sin(rmz¢)= ~ klzB.cos(nrc() \nm=i .=o (41) \noo  0o  \n[2 + v6(nrc) 2 - k22] B.cos(nrc;) = E k2i A.,sin(mn;). \nn=0 m=l  \nMultiplying through by sin(rare() and integrating over [0, 1] leads to \n[2 + v(mTr) 2 - k l i ]  Am = ~ ki2B, e,m \n.=o (42) \noo  \nkzlAm = Z E2 + v6(nT\"c) 2 - kzz]Bn~nm \nn=O \nwhere \n(cos(nrc(), sin(mrc~)) I.i \ne.m = (sin(trot(), sin(mrc~)) and (f ,  0) = ou f(~)O(~)d(. \nSystem (42) is an infinite system of linear equations for the infinite number of \nunknowns Am, B., m = 1, 2, 3 . . . . .  n = 0, 1, 2, 3 . . . . .  To solve this system we \nmake a finite dimensional approximation (FDA) to it by considering only values of \nm up to M and truncating the sums at n = M - 1. This leads to a system of 2M \n386 R. Dillon et al. \nequations for the 2M unknowns (A1, A2,  • • • , AM, Bo, B1,  • • • ,  BM-1). We may \nrewrite the truncated system as the generalized eigenvalue problem \nPx = 2Qx (43) \nwhere x = (A1, Az, • • •, AM, B1, • • • \", BM-1)  and P and Q are 2M x 2M matrices \nwhich have the block structure \nI'°7 P-  Pa P,* ' Q=- 0 Q4 \" \nHere Pi and Qi are M x M matrices given by \n0 i f \/ :# j  \n(P1)ij = v(m~) 2 - kll  i f \/= j  \n(P2)ii = - kl2ai-l, i  Pa = k l z I  \n(P4)ij = (v6( j  -- 1)2n 2 -- k22)aj- 1,i \n(Q4)\/j = a i -1,~ \nwhere i, j -- 1, 2 . . . .  , M, and I is the M x M unit matrix. \nThe solution of (43) leads to 2M eigenvalues 2i with corresponding eigenvectors \nxi. Thus the M-dimensional approximation to the solution of (37) and (38) is \nAmi sin (mn( ) t  e ~ (44) \nwhere (Au ,  Azl . . . . .  AMi, Bo~,BI~ . . . .  , B(M-I~) is the eigenvector with eigen- \nvalue 2i. \nAs the dimension of the FDA is increased, the values of the previously cal- \nculated eigenvalues and eigenvectors will change and more eigenvalues and corres- \nponding eigenvectors will be generated. We use the following criteria as stopping \ntests. \n(i) The approximation for a chosen 2~ and its corresponding eigenvector must \nconverge as the dimension of the FDA is increased. In the case of the eigenvectors \nthis also means that higher order terms are insignificant. For any given 2 there is an \nMc such that the computed eigenvalue and eigenvector are sufficiently accurate \nfor M = Me. \n(ii) The eigenvalues introduced for M > Mc have real part negative, and thus \ncorrespond to temporally decaying solutions of (37). \nIf both these criteria are satisfied, then we are assured that the FDA only ignores \nexponentially decaying terms in time and insignificantly small terms in the trigon- \nometric expansion of the spatial component of the solution to (37). Furthermore, if \nsome of the eigenvalues obtained by the FDA have positive real part, then the \nuniform steady state of (37) is unstable and we postulate that the solution will \nevolve to a spatially varying solution of the form (44) with temporal growth rates \ngiven by the real part of the positive eigenvalues. \nPattern formation in generalized Turing systems. I 387 \nTo solve the generalized eigenvalue problem (43) we use the NAG library \nroutine F02BJF which essentially reduces both matrices to triangular form by \na coordinate transformation, solves the eigenvalue problem in the new coordinate \nsystem, then transforms the eigenvectors thus obtained back to the original \ncoordinate system (see [21, 35]). We can test the accuracy of our analytic approx- \nimation in several ways. \n1. We can solve the linear partial differential equation system (37) with the \nboundary conditions (38) using the NAG library routine D03PGF (which is based \non a method of lines procedure and uses Gear's method to integrate the resulting \nsystem of ordinary differential equations) to obtain the actual values of 41 and ~2. \nWe can then calculate the Fourier sine and cosine series for ¢1 and 42 respectively \nand compare them to the predictions made above. Furthermore, we can calculate \nthe linear growth rate of solutions and compare them with the positive igenvalues \nfrom the FDA. We carried this test out on a large number of examples and, in every \ncase, we found very good agreement between the analytical predictions and the \ncorresponding numerical solutions. \n2. Since (37) is the linearization about a uniform steady state of the nonlinear system \n(4), the FDA scheme gives a linear approximation to the full nonlinear problem. \nWhenever the linear analysis predicts exponentially growing solutions we cannot \ncompare growth rates of the two solutions, but we can compare the eigenfunctions of \nthe positive (unstable) eigenvalues with Fourier sine and cosine decomposition f the \nsolution to the nonlinear steady state problem as calculated from AUTO. \nWe illustrate the FDA procedure with two examples for the glycolysis model (25) \nwith 6 = 0.14 and the other parameter values fixed as stated: \nExample 1. With boundary condition (38) (the D~N case in Sect. 4) and L = 0.052, \nthere are two growing modes and the linear analysis predicts the solution \n(¢ t )= C~ ( sin ~ + 0.06 sin 3~ )eXl ' \n~2 - 1.09 - 0.02 cos 2~ + 0.01 cos 4rc~ \nsin2z~+0.10 sin47z~+0.03sin6rc( ~eX2 ~\n+ C2 - 9.5 cos re( - 0.1 cos 3~( - 0.01 cos 5rc(] \nto within terms of (9(10-2). Here 21 = 0.70, 22 = 0.39, and C~ = 0.42, C2 = 0.11, all \nto the same order. On the other hand, the steady state solution to the full nonlinear \nsystem is \n) =C1 -1 .23-0 .08cos2~ +C2 -11.79cosrc~ \nto the same order. \nExample 2. Suppose that the boundary conditions are ~¢1\/~ = 0 = ~2 at ~ = 0, 1, \nwhich correspond to the ND 1 case of Sect. 4. We consider different values of L. \n(a) L = 0.219. The solution of the linear problem to leading order is \n(~ l )  = C1 ( - 0\"13 c°s 7r~ + c°s 3rc~ - 0\"36 c°s 5~ - 0\"16 c°s 77z~ ~e~l~ \n42 \\0.65 sin 2zc~ - 1.67 sin 4rc~ + 0.33 sin 6zc~ + 0.07 sin 8~z~] ' \n388 R. Dillon et al. \nwhere \/~1 = 2.17 × 10 -4 and C1 = 0.47. The corresponding solution to the steady \nstate problem of the full nonlinear system, as calculated using AUTO, is \n(~)  ( cos3~r(-0.36cos5zc( ) ( 0 ) \n= C1 0.65 sin 2re( - 1.67 sin 4zc( + 0.31 sin 6zc( + C2 sin 5zc( \nto leading order. \n(b) L = 0.228:Linear analysis yields the solution \n(~1)  = C1 ~ \/0.11 + cos 2~( -  1.37 cos ere( + 0,25 cos 6re( + 0.04 cos 8~z(']e~: \n~2 ,, 0.05 sin re( - 2.06 sin 3re( + 2.29 sin 57r( + 0.05 sin 7~( J \n\/ - 0.05 cos n( + cos 3~( - 0.42 cos 5~( - 0.01 cos 7re( \"~ \n\/ e22~ + C2 \/ \n~0.57 sin 2~( - 1.67 sin 41r( - 0.43 sin 6~( + 0.08 sin 8~(J  \nwhere 21 = 4.62 x 10- 5, 22 = 4.95 x 10 -3, and C1 = 0.28, C2 = - 0.47. The steady \nstate solution of the nonlinear system is \n= C1 - 2.11 sin 3~( + 2.53 sin 5~ \nto leading order. \n(c) L = 0.230:Linear analysis predicts that \n~ \\ 0.03 sin zc~ - 2.1 sin 3re( + 2.0 sin 5rc~ + 0.04 sin 7zc~ e~: \n( - 0.04 cos zc~ + cos 3rc~ - 0.43 cos 5rc~ - 0.01 cos 7rc~ )e~2 ~ \n+ C2 0.55 sin 27c( - 1.68 sin 4zc( + 0.47 sin 6re( + 0.09 sin 8re( + 0.04 sin 10re( \nwhere 2a = 2.71 × 10 -3, 22 = 6.00 × 10 -3, and C1 = 0.27, C2 = 0.47. The steady \nstate solution of the nonlinear system is \n(~)=C1(  cos 2zc~ --1.52 cos 4~( 'X \n- 2.2 sin3~r( + 2.6 sin 5rc() + C2(0.55 cos3rc( -- 0.40cos5rc( \nsin 2re( -- 1.6 sin 4re( + 0.34 sin 6rc(J \nto leading order. \nThese two examples how that linear analysis provides a reasonable approxima- \ntion to the spatial variation of the solution of the full nonlinear system. The above \nexamples have at most two eigenvalues with positive real parts. The method, however, \nalso works in cases where there are more than two eigenvalues with positive real parts. \nThe analysis then predicts a superposition of several modes. We have compared the \npredictions of the analysis with the numerical solution of the corresponding linear \nreaction diffusion system for several cases of this type and found them to be in very \ngood agreement. This study, however, also highlights the shortcoming of linear \nanalysis in that if more than one eigenfunction grows the analysis cannot determine if\nthe final pattern of the full nonlinear system will be a combination of eigenfunctions or\ndominated by one eigenfunction. \nPattern formation in generalized Turing systems. I 389 \nExample 3. If we take the lowest order FDA (M = 1) we find from (42) that the \ntemporal growth rate 2 is given by \n22 -- kll d- k22 - vg 2 +__ [(kl i d- k22 - vg2) 2 - 4(klik22 - ki2k21 - k22vrc2)] 1\/2. \n(45) \nThe condition kil-F k22 <0 (from Sect. 2) implies that kil + k22-vrc 2 <0, \nbut the condition klik22-k12k2i>0 does not necessarily imply that \nkllk22 - ki2k21 - k22v~ 2> 0, unless k22 < 0. If k22 > 0, then for large enough v, \nkil k22 - ki2k2i - k22v~z 2 < 0 and the larger of the two roots (45) is positive. It may \nthus be possible for a uniform steady state which is stable in the standard case of zero \nflux boundary conditions on both species to be driven linearly unstable by boundary \nconditions of the form (38). This may be illustrated for the glycolysis model for the D1N \ncase at L = 0.045. For these parameter values the linear analysis predicts that the \nstandard Turing system (with zero flux boundary conditions on both species) is stable, \na result confirmed by numerically solving the partial differential equation system but \nthat the case with boundary conditions (38) should have a growing eigenfunction \nwhich at FDA of dimension 1 is \n(~: )= Ct ( -  0\"38: sin ~Z~)e °'694~. (46) \nAt the two-dimensional pproximation another positive eigenvalue appears and the \nFDA is now \n(~: )= C1( -  0\"387 sin ~)e°'696~ + C2( -  0.082 sin \n1 cos re( 2~(\/e°219~\" (47) \nAt the 16-dimensional pproximation these solutions have converged to \n( )41 = C1( - 0\"376sin~(-0\"020sin3~z~- 0\"004sin57z(+ (9(10-4)~e°75z~ \n~2 1 + 0.057 cos(2~) + 0.004 cos(4rc~) + (9(10 -4) J \nC2( - 0.081 sin(27t~) - 0.009 sin(4rc~) + (9(10-4)~ o.z42~ + (48) \ncos To( + 0.006 cos 3re( + (9(10 -4) )e  \no \n\\ \nEquation (45) also predicts that the value of the positive ,~ will increase as v decreases. \nThis is borne out by solving the generalized eigenvalue problem and also the linear \npartial differential equation system. \nThis example shows that boundary conditions can drive a reaction-diffusion \nsystem, which would otherwise be stable, to become unstable and exhibit spatial \npattern. This is to be expected intuitively because u is the inhibitor, thus setting it to \nzero on the boundary will tend to allow the activator to grow unbounded in a linear \nsystem. \nThe above examples how that even very crude, low dimensional, finite dimen- \nsional approximations provide a reasonably accurate solution to the infinite dimen- \nsional generalized eigenvalue problem (42). If we choose parameters which predict he \ngrowth of higher modes for the standard Turing system with zero flux boundary \nconditions on both species we find that higher dimensional FDA need to be used in \norder to obtain sufficient accuracy. \nAll the above analysis could have been carried out by taking the inner product with \ncosine in (42). The results are in good agreement with the above. \n390 R. Dillon et al. \nA.2 Further analysis \nWe can gain some insight into the connection with the Neumann problem as follows. \nNote that the system (42) may be reduced by eliminating A,, to \n~[ (2  + v(mrc) 2 - k11)(2 + vb(nff) 2 - k22) - kl2k21]o~n,nBn = 0 (49) \nn=0 \nfo rm= 1,2,3 . . . .  \nThis may be written as \n~{22 + [v(mn) z + 6v(nrc) 2 - trace K]2 + 3v2(mrc)2(nn) 2 - [k l l  v(m~) 2\nn=O \n+ k22v(nrc) 2] + detK}B,a ,m = O, \nwhich shows the connection with the Neumann problem more clearly, for in that case \n(9), \nv(mn) 2 + 6v(nz) 2 ~ (mrc) 2trace D. \nAs an,, = 0 for n + m = 2p, the infinite system represented by (49) can be written as \nHere Be = (Bo, B2 • • • )T  and Bo = (B~, B3 • • • )r. Thus det f~(2) = det f~l (2) det f~2(2) \nand the eigenvectors decompose into those with only Bj ~e 0 for j even and those with \nonly B~ + 0 for j odd. This explains the form of the eigenfunctions in Examples 1-3. \nA.3 Location o f  bifurcation points \nThe above analysis can be used to locate bifurcation points as a certain parameter p is \nvaried using the method of bisection as follows: we choose a low dimensional FDA, \na value of the parameter p say, Pl at which all eigenvalues have real part negative and \nanother value P2 at which at least one eigenvalue has positive real part. Assume, \nwithout loss of generality, that P2 > Pl. Clearly, an odd number of eigenvalues must \ncross the axis in (pl, P2)- By examining the signs of the eigenvalues at the midpoint \n(p~ + p2)\/2 of the interval we can easily determine in which half of the interval the \nbifurcation point lies. We can continue this procedure to find the bifurcation point to \nthe required egree of accuracy. By going to a higher dimensional FDA we may obtain \na more accurate value of the parameter at the bifurcation point. The results of this \nmethod agree closely with those from the package AUTO. For example, in Fig. 10 \nbifurcation points occur at L = 0.216 and L = 0.226. The above procedure predicts \nbifurcation at L = 0.219 and 0.228. \nB Appendix \nB.1 Numerical methods \nTo investigate the steady state solutions of (21) we discretise the system using central \ndifferences: \nPattern formation in generalized Turing systems. I 391 \nD1 \nh2-~L z (uj+l - 2u s + u~-l) + f (u  s, v s) = 0 \n6D1 , \n- - .  tvj+l - 2v s + vs-1) + g(v s, vs) = 0 \nh2o~L ~ \n(50) \nwhere Nh = 1, N ~ N, uj = u(jh), and v s = v(jh) j = 1, 2 . . . . .  N - 1. This is a system \nof 2N - 2 equations with 2N + 2 unknowns. To get the remaining four equations, we \nuse central differences for the first derivatives at the boundary and introduce the \n'fictitious' points (_ 1 = - h, and (N+ 1 = (N + l)h, in order to write the discretised \nboundary conditions as \n01 \n2-~ (u-1 - ul) + (1 - 01)Uo - 03  Ns) = 0 \n02 \n2-h (v-1 - vl) + (1 - O2)(Vo - 03 vs) = 0 \n2~(UN+ 1 --  UN-1) + (1 -- 01)(U N --  03 us) = 0 \n(5i) \n02(v~+1 vN-1)+(1--G)(vN 03v9 O. \n2h \nBy substituting (51) into (50) wi th j  = 0 and j  = N, we get \n201 D1 2D1 \nh2 ~ (ul - Uo) - ~ (1 - 01)(Uo - 03u s) + Olf(uo, Vo) = 0 \n202D2 2D2 (1 \nh2coL2 (vl - Vo) - ho)L 2 - 02)(vo - O~v s) + 02g(Uo, Vo) = 0 \n201 D1 , 2D1 \ntuN-1  - uN) - ~ (1 - 01)(uu - 03u') + Oxf(uN, vN) = 0 \n(52) \n202D2 2D2 \nh2o)L2 (VN-1 -- VN) -- ~ (1 -- 02)(\/) N -- 03 vs) --~ 02g(UN, ON) : 0. \nWe solved the discretized steady state problem (50) and (52) with AUTO [6J. This \nprogram detects bifurcation from a given steady state as the bifurcation parameter is\nvaried and can calculate solutions and their stability by continuation along bifurcating \nbranches. Throughout we fixed Di=lO-ScmZ\/sec ,  co=0.01sec -1, 6=0.14 ,  \nfl = 1.0, ~: = 0.001, and N = 40. As a check on the solutions, we computed several \nsolutions to the evolution equations corresponding to (21), with appropriate boundary \nconditions, using the method of lines and Gear's method. In all cases, the steady state \nsolutions obtained by AUTO and those obtained from the evolution equations were \nsimilar. \nIn the cases NN and D 1 D 1, the uniform steady state of the full system is simply \n(u s, v~). However, for the cases NDo, DoN, DoDo the problem of initially specifying \na steady state for AUTO is more difficult. The starting solutions were determined by \none of the following methods. \n392 R. Dillon et al. \n(i) Solve the corresponding time evolution problem and use the resulting steady state \nsolution as a starting point for AUTO. For example, we used such a method to obtain \nthe solution to the DoN case at L = 0.1 and then continued the solution with AUTO. \nThe bifurcation diagram thus derived is shown in Fig. 15. \n(ii) Use a homotopy from a known solution for a different set of boundary condi- \ntions. This may be done in several ways. For  example, to find an initial steady state for \nthe NDo case we used two different homotopy methods. For both methods, 01, was set \nto 1 so that u satisfied homogeneous Neumann conditions. In the first method we \nintroduced a parameter p and set the boundary values of v, namely v(0) and v(N), equal \nto p for a fixed value of L. The parameter p was initially set equal to v ~ and then used as \nthe continuation parameter. When p reaches zero, we have a steady state solution to \nthe NDo problem. This solution may then be continued in L to investigate its \nbifurcation structure under these boundary conditions. \nThe second method used 0z as the homotopy parameter in Eq. (22). The parameter \nwas initially set to 1 with the starting solution set at (u s, vS). Continuing in 02 with \nAUTO until 02 = 0 gives a homotopy between the homogeneous Neumann and \nhomogeneous Dirichlet conditions for v. \nNote that the starting solution for the homotopy in the second method need not \nnecessarily be (u s, vs). One may start with a spatially heterogeneous steady state \nobtained from the NN case. Several cross checks were carried out with these different \nhomotopy procedures and the solutions were found to agree. \nReferences \n1. Ashkenazi, M., Othmer, H. G.: Spatial patterns in coupled biochemical oscillators. J Math. Biol. \n5, 305-350 (1978) \n2. Babloyantz, A., Bellemans, A.: Pattern regulation in reaction-diffusion systems - the problem of \nsize invariance. Bull. Math. Biol. 47, 475-487 (1985) \n3. Benson, D. L., Sherratt, J. A., Maini, P. K.: Diffusion driven instability in an inhomogeneous \ndomain. Bull. Math. Biol. 55, 365-384 (1993) \n4. Benson, D. L., Maini, P. K., Sherratt, J. A.: Pattern formation in heterogeneous domains. In: \nOthmer, H. G., Maini, P. K., Murray, J. D. (eds.) Experimental and Theoretical Advances in \nBiological Pattern Formation. London: Plenum 1993 \n5. Brfimmer, F., Zempel, G., Buhle, P., Stein, J-C., Hulser, D. F.: Retinoic acid modulates gap \njunction permeability: a comparative study of dye spreading and ionic coupling in cultured cells. \nExp. Cell Res. 196, 158-163 (1991) \n6. Castets, V., Dulos, E., De Kepper, P.: Experimental evidence of a sustained standing Turing- \ntype nonequilibrium chemical pattern. Phys. Rev. Lett. 64(24), 2953-2956 (1990) \n7. Child, C. M.: Patterns and Problems of Development. University of Chicago Press, 1941 \n8. Conway, E., Hoff, D., Smoller, J.: Large time behavior of solutions of nonlinear reaction diffusion \nequations. SIAM J. Appl. Math. 35(1), 1-16 (July 1978) \n9. Crick, F. H.: Diffusion in embryogenesis. Nature 225, 420-422 (1970) \n10. Dillon, R., Othmer, H. G.: Control of gap junction permeability can control pattern formation in \nlimb development. In: Othmer, H. G., Maini, P. K., Murray, J. D. (eds.) Experimental and \nTheoretical Advances in Biological Pattern Formation. London: Plenum 1993 \nI 1. Doedel, E.: AUTO: Software for continuation and bifurcation problems in ordinary differential \nequations. Technical report, California Institute of Technology, 1986 \n12. Driesch, H.: Entwicklungsmechanische Studien. Z. Wiss. Zool. 53, 160-184 (•892) \n13. Driesch, H.: Entwickhingsmechanische Studien. z. Wiss. Zool. 55, 3~51 (1893) \n14. Epstein, I. R., Lengyel, I., Kfidfir, S., Kagan, M., Yokoyama, M.: New systems for pattern \nformation studies. Physica A, 188, 26-33 (1992) \nPattern formation in generalized Turing systems. I 393 \n15. French, V., Bryant, P. J., Bryant, S. V.: Pattern regulation in epimorphic fields. Science 193, \n969-981 (1977) \n16. Goodwin, B. C., Kauffman, S. A.: Spatial harmonics and pattern specification i early Drosophila \ndevelopment. Part I. Bifurcation sequences and gene expression. J. Theor. Biol. 144, 303-319 \n(1990) \n17. Hunding, A., Sorensen, P. G.: Size adaptation of Turing prepatterns. J. Math. Biol. 26, 27-39 \n(1988) \n18. Lacalli, T. C., Harrison, L. G.: The regulatory capacity of Turing's model for morphogenesis with \napplication to slime moulds. J. Theor. Biol. 70, 273-295 (1978) \n19. Lengyel, I., Epstein, I.R.: A chemical approach to designing Turing patterns in reaction-diffusion \nsystems. Proc. Natl. Acad. Sci. 89, 3977-3979 (1992). \n20. Meinhardt, H.: Modes of Biological Pattern Formation. London: Academic Press 1982 \n21. Moler, C. B., Stewart, G. W.: An algorithm for generalized matrix eigenproblems. SIAM J. Numer. \nAnal. 10, 241-256 (1973) \n22. Murray, J. D.: Mathematical Biology. Berlin Heidelberg New York: Springer 1989 \n23. Othmer, H. G.: Interactions ofReaction and Diffusion in Open Systems. PhD thesis, Minneapolis: \nUniversity of Minnesota 1969 \n24. Othrner, H. G.: Current problems in pattern formation. In: Levin, S. A. (ed.) ((Some mathematical \nquestions in biology VIII. Lect. Math. Life Sci., vol. 9, pp. 57-85) Providence, RI: Am. Math, Soc. \n1977 \n25. Othmer, H. G.: Applications of bifurcation theory in the analysis of spatial and temporal pattern \nformation. In: Gurel, O., R6ssler, O. K. (eds.) Bifurcation theory and applications in scientific \ndisciplines, pp. 64-77. New York: New York Academy of Sciences 1979 \n26. Othmer, H. G.: Synchronized and differentiated modes of cellular dynamics. In: Haken, H. (eds.) \nDynamics of Synergetic Systems. Berlin Heidelberg New York: Springer 1980 \n27. Othmer, H. G.: The interaction of structure and dynamics in chemical reaction etworks. In: \nEbert, K. H., Deuflhard, P., Jager, W. (eds.) Modelling of Chemical Reaction Systems, pp. 1-19 \nBerlin Heidelberg New York: Springer 1981 \n28. Othmer, H. G., Aldridge, J.: The effects of cell density and metabolite flux on cellular dynamics. J\nMath. Biol. 5, 169-200 (1978) \n29. Othmer, H. G., Pate, E. F.: Scale invariance in reaction-diffusion models of spatial pattern \nformation. Proc. Nat. Acad. Sci. 77, 4180~184 (1980) \n30. Othmer, H. G., Scriven, L. E.: Interactions of reaction and diffusion in open systems. Ind. Eng. \nChem. Fund. 8, 302-315 (1969) \n31. Ouyang, Q., Swinney, H. L.: Transition from a uniform state to hexagonal nd striped patterns. \nNature 352, 610-612 (1991) \n32. Pate, E., Othmer, H. G.: Applications of a model for scale-invariant pattern formation in \ndeveloping systems. Differentiation 28, 1-8 (1984) \n33. Pearson, J. E., Horsthemke, W,: Turing instabilities with nearly equal diffusion coefficients. \nJ. Chem. Phys. 90(3), 1588-1599 (1989) \n34. Turing, A. M.: The chemical basis of morphogenesis. Philos, Trans. R. Soc. Lond. Ser. B 237, \n37--72 (1952) \n35. Ward, R. C.: The combination shift QZ algorithm. SIAM J. Numer. Anal. 12, 835-853 (1975) \n36. Wolpert, L.: Positional information and the spatial pattern of cellular differentiation. J. Theor. \nBiol. 25, 1-47 (1969) \n37. Wolpert, L.: Positional information and pattern formation. Curr. Top. Dev. Biol. 6, 183-224 (1971) \n38. Wright, D. A., Lawrence, P. A.: Regeneration of the se~nent boundary in Oncopeltus. \nDev. Biol. 85, 317-327 (1981) \n"}