{"doi":"10.5194\/angeo-20-1921-2002","coreId":"11135","oai":"oai:eprints.lancs.ac.uk:35435","identifiers":["oai:eprints.lancs.ac.uk:35435","10.5194\/angeo-20-1921-2002"],"title":"An interhemispheric, statistical study of nightside spectral width distributions from coherent HF scatter radars","authors":["Woodfield, E.E.","Hosokawa, K.","Milan, S.E.","Sato, N.","Lester, M."],"enrichments":{"references":[{"id":759637,"title":"A Case Study","authors":[],"date":"2001","doi":"10.5194\/angeo-19-327-2001","raw":"Lester, M., Milan, S. E., Besser, V., and Smith, R.: A Case Study of HF Radar Spectra and 630.0 nm Auroral Emission in the Pre Midnight Sector, Ann. Geophysicae, 19, 327–339, 2001.","cites":null},{"id":756825,"title":"A new magnetic coordinate system for conjugate studies at high latitudes,","authors":[],"date":"1989","doi":"10.1029\/ja094ia07p09139","raw":"Baker, K. B. and Wing, S.: A new magnetic coordinate system for conjugate studies at high latitudes, J. Geophys. Res., 94, 9139– 9143, 1989. Baker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M., Newell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HF radar signatures of the cusp and low-latitude boundary layer, J.","cites":null},{"id":764832,"title":"An evaluation of range accuracy in the Super Dual Auroral Radar Network over-the-horizon HF radar systems,","authors":[],"date":"2001","doi":"10.1029\/2000RS002558","raw":"Yeoman, T. K., Wright, D. M., Stocker, A. J., and Jones, T. B.: An evaluation of range accuracy in the Super Dual Auroral Radar Network over-the-horizon HF radar systems, Radio Science, 36, 4, 801–813, 2001.","cites":null},{"id":758260,"title":"Auroral Plasma Waves, in Auroral Physics,","authors":[],"date":null,"doi":"10.1029\/gm025p0351","raw":"Gurnett, D. A.: Auroral Plasma Waves, in Auroral Physics, (Eds) Meng, C.-I., Rycroft, M. J., and Franck, L. A., Cambridge Univ. Press, New York, Ch. IV-6, pp. 241–254, 1991.","cites":null},{"id":16421246,"title":"C.J.: Meridian-scanningphotometer, coherentHF radar, and magnetometer observations of the cusp: a case study,","authors":[],"date":"1999","doi":"10.1007\/s005850050746","raw":"Milan, S. E., Lester, M., Cowley, S. W. H., Moen, J., Sandholt, P. E., andOwen, C.J.: Meridian-scanningphotometer, coherentHF radar, and magnetometer observations of the cusp: a case study, Ann. Geophysicae, 17, 159–172, 1999.","cites":null},{"id":758632,"title":"Correlated Low-Frequency Electric and Magnetic Noise Along the Auroral Field Lines,","authors":[],"date":"1984","doi":"10.1029\/ja089ia10p08971","raw":"Gurnett, D. A., Huff, R. L., Menietti, J. D., Burch, J. L., Winningham, J. D., and Shawan, S. D.: Correlated Low-Frequency Electric and Magnetic Noise Along the Auroral Field Lines, J. Geophys. Res., 89, 8971–8985, 1984.","cites":null},{"id":758120,"title":"DARN\/SuperDARN: A global view of the dynamics of the highlatitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones, T. B., Thomas, E. C., Villain, J.P., Cerisier, J.C., Senior, C., Hanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen, E., Pallinen, R., Walker, A. D. M., Sato, N., and Yamagishi, H.: DARN\/SuperDARN: A global view of the dynamics of the highlatitude convection, Space Sci. Rev., 71, 761–796, 1995.","cites":null},{"id":760369,"title":"Dynamics of MagnetosphereIonosphere Coupling Including Turbulent Transport,","authors":[],"date":"1983","doi":"10.1029\/ja088ia01p00365","raw":"Lysak, R. L. and Dum, C. T.: Dynamics of MagnetosphereIonosphere Coupling Including Turbulent Transport, J. Geophys. Res., 88, 365–380, 1983.","cites":null},{"id":763831,"title":"Effects of HighAltitude Conductivity on Observed Convection Electric Fields and Birkeland Currents,","authors":[],"date":"1980","doi":"10.1029\/JA085iA12p06811","raw":"Smiddy, M., Burke, W. J., Kelley, M. C., Saﬂekos, N. A., Gussenhoven, M. S., Hardy, D. A., and Rich, F. J.: Effects of HighAltitude Conductivity on Observed Convection Electric Fields and Birkeland Currents, J.Geophys. Res., 85, 6811–6818, 1980.","cites":null},{"id":760861,"title":"Electric ﬁeld ﬂuctuations and charged particle precipitation in the cusp,","authors":[],"date":"1993","doi":"10.1029\/92ja01791","raw":"Matsuoka, A., Tsuruda, K., Hayakawa, H., Mukai, T., Nishida, A., Okada, T., Kaya, N., and Fukunishi, H.: Electric ﬁeld ﬂuctuations and charged particle precipitation in the cusp, J. Geophys. Res., 98, 11225–11234, 1993.","cites":null},{"id":757616,"title":"Ground observations and possible source regions of two types of PC1-2 micropulsation at very high latitudes,","authors":[],"date":"1997","doi":"10.1029\/97ja02191","raw":"Dyrud, L. P., Engebretson, M. J., Posh, J. L., Hughes, W. J., Fukunishi, H., Arnoldy, R. L., Newell, P. T., and Horne, R. B.: Ground observations and possible source regions of two types of PC1-2 micropulsation at very high latitudes, J. Geophys. Res., 102, 27011–27027, 1997.","cites":null},{"id":763099,"title":"Ground-based imaging of Magnetospheric boundaries,","authors":[],"date":"2000","doi":"10.1016\/s0273-1177(99)00657-2","raw":"Rodger, A. S.: Ground-based imaging of Magnetospheric boundaries, Adv. Space Res., 25, 7\/8, 1461–1470, 2000.","cites":null},{"id":764101,"title":"HF radar observations of E-region plasma irregularities produced by oblique electron streaming,","authors":[],"date":"1987","doi":"10.1029\/JA092iA11p12327","raw":"Villain, J.-P., Greenwald, R. A., Baker, K. B., and Ruohoniemi, J. M.: HF radar observations of E-region plasma irregularities produced by oblique electron streaming, J. Geophys. Res., 92, 12327–12342, 1987.","cites":null},{"id":764350,"title":"High and variable spectral width in the pre-dawn sector: A case study involving CUTLASS, EISCAT, ESR and optical data,","authors":[],"date":null,"doi":null,"raw":"Woodﬁeld, E. E., Davies, J. A., Eglitis, P., and Lester, M.: High and variable spectral width in the pre-dawn sector: A case study involving CUTLASS, EISCAT, ESR and optical data, Ann. Geophysicae, 20, 501–509, 2002a.","cites":null},{"id":762605,"title":"High spatial and temporal resolution observations of the ionospheric cusp,","authors":[],"date":"1995","doi":"10.1007\/s00585-995-0919-9","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker, K. B.: High spatial and temporal resolution observations of the ionospheric cusp, Ann. Geophysicae, 13, 919–925, 1995.","cites":null},{"id":761377,"title":"Identiﬁcation of the magnetospheric cusp and cleft using PC1-2 ULF pulsations,","authors":[],"date":"1992","doi":"10.1016\/0021-9169(92)90069-w","raw":"Menk, F. W., Fraser, B. J., Hansen, H. J., Newell, P. T., Meng, C.-I., and Morris, R. J.: Identiﬁcation of the magnetospheric cusp and cleft using PC1-2 ULF pulsations, J. Atmos. Terr. Phys., 54, 1021–1042, 1992.","cites":null},{"id":762074,"title":"Initial backscatter occurrence statistics from the CUTLASS HF radars,","authors":[],"date":"1997","doi":"10.1007\/s005850050486","raw":"Milan, S. E., Yeoman, T. K., Lester, M., Thomas, E. C., Jones, T. B.: Initial backscatter occurrence statistics from the CUTLASS HF radars, Ann. Geophysicae, 15, 703–718, 1997.","cites":null},{"id":761639,"title":"Interhemispheric differences in the HF radar signature of the cusp region A review through the study of a case example, Adv. Polar Upper Atmos.","authors":[],"date":"2001","doi":null,"raw":"Milan, S. E. and Lester, M.: Interhemispheric differences in the HF radar signature of the cusp region A review through the study of a case example, Adv. Polar Upper Atmos. Res., 15, 159–177, 2001.","cites":null},{"id":757255,"title":"International Geomagnetic Reference Field: The Seventh Generation,","authors":[],"date":"1997","doi":"10.5636\/jgg.49.123","raw":"Barton, C. E.: International Geomagnetic Reference Field: The Seventh Generation, J. Geomag. Geoelectr., 49, 123–148, 1997.","cites":null},{"id":760148,"title":"Ion ﬂows and heating at a contracting polar-cap boundary,","authors":[],"date":"1988","doi":"10.1016\/0032-0633(88)90076-1","raw":"Lockwood, M., Cowley, S. W. H., Todd, H., Willis, D. M., and Clauer, C. R.: Ion ﬂows and heating at a contracting polar-cap boundary, Planet. Space Sci., 36, 11, 1229–1253, 1988.","cites":null},{"id":759609,"title":"Magnetic Impulse Events at high Latitudes: Magnetopause and Boundary Layer Plasma Processes,","authors":[],"date":"1990","doi":"10.1029\/ja095ia01p00097","raw":"Lanzerotti, L. J., Wolfe, A., Trivedi, N., Maclennan, C. G., and Medford, L. V.: Magnetic Impulse Events at high Latitudes: Magnetopause and Boundary Layer Plasma Processes, J. Geophys. Res., 95, 97–107, 1990.","cites":null},{"id":761108,"title":"Magnetospheric boundary dynamics: DE-1 and DE-2 observations near the magnetopause and cusp,","authors":[],"date":"1991","doi":"10.1029\/90ja02167","raw":"Maynard, N. C., Aggson, T. L., Basinka, E. M., Burke, W. J., Craven, P., Peterson, W. K., Suguira, M., and Weimer, D. R.: Magnetospheric boundary dynamics: DE-1 and DE-2 observations near the magnetopause and cusp, J. Geophys. Res., 96, 3505–3522, 1991.","cites":null},{"id":763365,"title":"Mapping the outer LLBL with SuperDARN double-peaked spectra,","authors":[],"date":"1997","doi":"10.1029\/97gl53304","raw":"Schifﬂer, A., Sofko, G., Newell, P. T., and Greenwald, R.: Mapping the outer LLBL with SuperDARN double-peaked spectra, Geophy. Res. Lett., 24, 3149–3152, 1997.","cites":null},{"id":758891,"title":"Mathematical representation of the auroral oval,","authors":[],"date":"1975","doi":"10.1029\/gl002i009p00377","raw":"Holzworth, R. H. and Meng, C.-I.: Mathematical representation of the auroral oval, Geophys. Res. Lett., 2, 377–380, 1975.","cites":null},{"id":761801,"title":"Meridian-scanning photometer, coherent HF radar, and magnetometer observations of the cusp: a case study,","authors":[],"date":"1999","doi":"10.1007\/s005850050746","raw":null,"cites":null},{"id":764589,"title":"Nightside studies of coherent HF radar spectral width behaviour, Ann. Geophysicae, in press,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-1399-2002","raw":"Woodﬁeld, E. E., Davies, J. A., Lester, M., Yeoman, T. K., Eglitis, P., and Lockwood, M.: Nightside studies of coherent HF radar spectral width behaviour, Ann. Geophysicae, in press, 2002b.","cites":null},{"id":757866,"title":"On morphology of auroral and magnetic disturbances at high latitudes,","authors":[],"date":"1963","doi":"10.1111\/j.2153-3490.1964.tb00164.x","raw":"Feldstein, Y. I.: On morphology of auroral and magnetic disturbances at high latitudes, Geomag. Aeron., 3 , 183–192, 1963.","cites":null},{"id":762353,"title":"On the collocation between dayside auroral activity and coherent HF radar backscatter,","authors":[],"date":"2001","doi":"10.1007\/s005850000302","raw":"Moen, J., Carlson, H. C., Milan, S. E., Shumilov, N., Lybekk, B., Sandholt, P. E., and Lester, M.: On the collocation between dayside auroral activity and coherent HF radar backscatter, Ann. Geophysicae 18, 1531–1549, 2001.","cites":null},{"id":756589,"title":"On the factors conditioning the Doppler spectral width determined from SuperDARN HF radars,","authors":[],"date":null,"doi":"10.5194\/angeo-20-1769-2002","raw":"Andr´ e, R., Pinnock, M., Villain, J.-P., and Hanuise, C.: On the factors conditioning the Doppler spectral width determined from SuperDARN HF radars, Int. J. Geomag. Aeronomy, 2, 1, 77–86, 2000b.","cites":null},{"id":756490,"title":"On the SuperDARN autocorrelation function observed in the ionospheric cusp,","authors":[],"date":"1999","doi":"10.1029\/1999gl003658","raw":"Andr´ e, R., Pinnock, M., and Rodger, A. S.: On the SuperDARN autocorrelation function observed in the ionospheric cusp, Geophys. Res. Lett., 26, 22, 3353–3356, 1999. Andr´ e, R., Pinnock, M., and Rodger, A. S.: Identiﬁcation of the low-altitude cusp by Super Dual Auroral Radar Network radars: A physical explanation for the empirically derived signature, J.","cites":null},{"id":757059,"title":"Simultaneous HF-radar and DMSP observations of the cusp,","authors":[],"date":"1990","doi":"10.1029\/gl017i011p01869","raw":"Baker, K. B., Greenwald, R. A., Ruohoniemi, J. M., Dudeney, J. R., Pinnock, M., Newell, P. T., Greenspan, M. E., and Meng, C.-I.: Simultaneous HF-radar and DMSP observations of the cusp, Geophys. Res. Lett., 17, 11, 1869–1872, 1990.","cites":null},{"id":762813,"title":"Simultaneous optical and HF radar observations of the ionospheric","authors":[],"date":"1934","doi":"10.1029\/95gl01797","raw":null,"cites":null},{"id":16421262,"title":"Simultaneous optical and HF radar observations of the ionospheric1934 E. E. Woodﬁeld et al.: A statistical study of nightside spectral width distributions cusp,","authors":[],"date":"1995","doi":null,"raw":"Rodger, A. S., Mende, S. B., Rosenberg, T. J., and Baker, K. B.: Simultaneous optical and HF radar observations of the ionospheric1934 E. E. Woodﬁeld et al.: A statistical study of nightside spectral width distributions cusp, Geophys. Res. Lett., 22, 2045–2048, 1995.","cites":null},{"id":759375,"title":"Small-scale vortices in the high-latitude F-region,","authors":[],"date":"2000","doi":"10.1029\/1999ja000417","raw":"Huber, M. and Sofko, G. J.: Small-scale vortices in the high-latitude F-region, J. Geophys. Res., 105, 20885–20897, 2000.","cites":null},{"id":759135,"title":"Statistical Characteristics of Spectral Width as Observed by the Conjugate SuperDARN Radars, Ann. Geophysicae, in press,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-1213-2002","raw":"Hosokawa, K., Woodﬁeld, E. E., Lester, M., Milan, S. E., Yukimatu, A. S., and Sato, N.: Statistical Characteristics of Spectral Width as Observed by the Conjugate SuperDARN Radars, Ann. Geophysicae, in press, 2002.","cites":null},{"id":759857,"title":"The electric ﬁeld response to the growth phase and expansion phase onset of a small isolated substorm,","authors":[],"date":"1997","doi":"10.1007\/s005850050443","raw":"Lewis, R. V., Freeman, M. P., Rodger, A. S., Reeves, G. D., and Milling, D. K.: The electric ﬁeld response to the growth phase and expansion phase onset of a small isolated substorm, Ann. Geophysicae, 15, 289–299, 1997.","cites":null},{"id":757520,"title":"The nightside ionospheric response to IMF By changes,","authors":[],"date":"1998","doi":"10.1029\/98gl01413","raw":"Dudeney, J. R., Rodger, A. S., Freeman, M. P., Pickett, J., Scudder, J., Sofko, G., and Lester, M.: The nightside ionospheric response to IMF By changes, Geophys. Res. Lett., 25, 14, 2601–2604, 1998.","cites":null},{"id":763586,"title":"The quantitative relationship between auroral brightness and solar EUV Pedersen conductance,","authors":[],"date":"2001","doi":"10.1029\/2000JA003002","raw":"Shue, J.-H., Newell, P. T., Liou, K., and Meng, C.-I.: The quantitative relationship between auroral brightness and solar EUV Pedersen conductance, J. Geophys. Res., 106, 5883–5894, 2001.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/11135.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35435\/1\/art_918.pdf","pdfHashValue":"22ab597299b823420d9635ba5bb56ed9ee4fc7a4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35435<\/identifier><datestamp>\n      2017-11-11T00:02:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        An interhemispheric, statistical study of nightside spectral width distributions from coherent HF scatter radars<\/dc:title><dc:creator>\n        Woodfield, E.E.<\/dc:creator><dc:creator>\n        Hosokawa, K.<\/dc:creator><dc:creator>\n        Milan, S.E.<\/dc:creator><dc:creator>\n        Sato, N.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:subject>\n        Q Science (General)<\/dc:subject><dc:date>\n        2002-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35435\/1\/art_918.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-20-1921-2002<\/dc:relation><dc:identifier>\n        Woodfield, E.E. and Hosokawa, K. and Milan, S.E. and Sato, N. and Lester, M. (2002) An interhemispheric, statistical study of nightside spectral width distributions from coherent HF scatter radars. Annales Geophysicae, 20 (12). pp. 1921-1934. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35435\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-20-1921-2002","http:\/\/eprints.lancs.ac.uk\/35435\/"],"year":2002,"topics":["Q Science (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2002) 20: 1921–1934 c© European Geosciences Union 2002\nAnnales\nGeophysicae\nAn inter-hemispheric, statistical study of nightside spectral width\ndistributions from coherent HF scatter radars\nE. E. Woodfield1, K. Hosokawa2, S. E. Milan1, N. Sato3, and M. Lester1\n1Department of Physics and Astronomy, University of Leicester, UK\n2Department of Geophysics, Graduate School of Science, Kyoto University, Japan\n3National Institute of Polar Research, Tokyo, Japan\nReceived: 22 February 2002 – Revised: 27 June 2002 – Accepted: 5 July 2002\nAbstract. A statistical investigation of the Doppler spec-\ntral width parameter routinely observed by HF coherent\nradars has been conducted between the Northern and South-\nern Hemispheres for the nightside ionosphere. Data from\nthe SuperDARN radars at Thykkvibær, Iceland and Syowa\nEast, Antarctica have been employed for this purpose. Both\nradars frequently observe regions of high (> 200 ms−1) spec-\ntral width polewards of low (< 200 ms−1) spectral width.\nThree years of data from both radars have been analysed\nboth for the spectral width and line of sight velocity. The\npointing direction of these two radars is such that the flow\nreversal boundary may be estimated from the velocity data,\nand therefore, we have an estimate of the open\/closed field\nline boundary location for comparison with the high spectral\nwidths. Five key observations regarding the behaviour of the\nspectral width on the nightside have been made. These are\n(i) the two radars observe similar characteristics on a statis-\ntical basis; (ii) a latitudinal dependence related to magnetic\nlocal time is found in both hemispheres; (iii) a seasonal de-\npendence of the spectral width is observed by both radars,\nwhich shows a marked absence of latitudinal dependence\nduring the summer months; (iv) in general, the Syowa East\nspectral width tends to be larger than that from Iceland East,\nand (v) the highest spectral widths seem to appear on both\nopen and closed field lines. Points (i) and (ii) indicate that\nthe cause of high spectral width is magnetospheric in origin.\nPoint (iii) suggests that either the propagation of the HF ra-\ndio waves to regions of high spectral width or the generating\nmechanism(s) for high spectral width is affected by solar il-\nlumination or other seasonal effects. Point (iv) suggests that\nthe radar beams from each of the radars are subject either\nto different instrumental or propagation effects, or different\ngeophysical conditions due to their locations, although we\nsuggest that this result is more likely to be due to geophysi-\ncal effects. Point (v) leads us to conclude that, in general, the\nboundary between low and high spectral width will not be a\nCorrespondence to: E. E. Woodfield\n(Emma.Woodfield@ion.le.ac.uk)\ngood proxy for the open\/closed field line boundary.\nKey words. Ionosphere (auroral ionosphere; ionospheric\nirregularities)\n1 Introduction\nThe Doppler spectral width parameter observed by the Su-\nper Dual Auroral Radar Network (SuperDARN) of coher-\nent HF radars has been subject to increasing scrutiny. In\nparticular, there are variations in spectral width as a func-\ntion of latitude and time which may relate to the ionospheric\nfootprint of magnetospheric regions. For example, regions\nof high and variable spectral width observed on the dayside\nare generally accepted as being associated with the low al-\ntitude cusp (Baker et al., 1990, 1995; Rodger et al., 1995;\nPinnock et al., 1995; Andre et al., 1999, 2000a; Milan et\nal., 1999; Moen et al., 2001; Rodger, 2000). Similar re-\ngions of high and variable spectral width frequently occur\non the nightside (Lewis et al., 1997; Dudeney et al., 1998;\nLester et al., 2001; Woodfield et al., 2002a, b) and the de-\nbate over which magnetospheric regions these may repre-\nsent is ongoing. There are two hypotheses regarding the\nmagnetospheric origin of nightside regions of high spectral\nwidth, more specifically, regarding the sharp gradient be-\ntween low spectral width (< 200 ms−1), at lower latitudes,\nand high spectral width (> 200 ms−1), at higher latitudes.\nThe first proposal suggests a link between this spectral width\ngradient and the boundary between the Central Plasma Sheet\n(CPS) and Boundary Plasma Sheet (BPS) (Dudeney et al.,\n1998), while the second proposes that the spectral width gra-\ndient could represent the Open\/Closed Field Line Boundary\n(OCFLB) (Lester et al., 2001).\nThere have been several suggestions for the physical ex-\nplanation for the generation of regions of high and variable\nspectral width. Andre´ et al. (1999; 2000a, b) simulated the\neffect of a time-varying electric field, with frequencies of the\norder of 0.1 to 5 Hz, on the complex autocorrelation func-\n1922 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\nFig. 1. A map in AACGM of the locations of the field-of-view of\nthe Iceland East radar (blue) and the CUTLASS statistics summary\nrange gates, C0 to C15. In yellow are the conjugately mapped field-\nof-view of the Syowa East radar and its statistical summary range\ngates, S0 to S15.\ntions (ACFs) derived from the HF coherent radars’ pulse se-\nquence and found that large spectral widths can be caused by\nsuch an electric field. The changing electric field causes the\nphase of the ACF to become nonlinear, which, in turn, gen-\nerates several large peaks in the power spectrum of the signal\n(the Fourier transform of the ACF). The standard software\nused to process the radar measurements (FITACF), which\nfits the power spectrum parameters directly using the ACF,\ntends to overestimate the spectral width when there are many\npeaks of comparable power in the power spectrum. The es-\ntimated errors in the spectral width and line of sight velocity\nare also seen to rise where there are many peaks in the spec-\ntrum. Andre´ et al. (1999; 2000a, b) then linked the large\nspectral widths observed in the cusp (e.g. Baker et al., 1995)\nto electromagnetic wave activity (0.2 to 2.2 Hz) observed by\nsatellites passing through the cusp (e.g. Maynard et al., 1991;\nMatsuoka et al., 1993) and ground magnetometer data show-\ning Pc1\/Pc2 wave activity underneath the cusp (Menk et al.,\n1992; Dyrud et al., 1997). They conclude that Alfve´n waves\nare likely to be the major energy source that causes the mea-\nsurement of high spectral width in the cusp. Similar Alfve´n\nwaves may also, therefore, be responsible for the regions of\nhigh and variable spectral width observed on the nightside,\nand such wave activity has been observed throughout the au-\nroral oval (Gurnett, 1991). No experimental study has yet\ndemonstrated conclusively the relationship between wave ac-\ntivity and large spectral width on the nightside.\nOther possible mechanisms for generating large HF spec-\ntral widths have been described by Schiffler et al. (1997) and\nHuber and Sofko (2000). Observations of the power spec-\ntra obtained from the low-latitude boundary layer using the\nmaximum entropy method indicated the presence of many\nspectra with two main peaks. Therefore, they propose the\npresence of vortices in the plasma flow, smaller than the radar\nrange cell and with a shorter lifespan than the integration\ntime of the radar beam. Modelling of these vortices (Huber\nand Sofko, 2000) suggests that they would be capable of gen-\nerating double-peak spectra. It is likely that FITACF overes-\ntimates the spectral width of the double-peak spectra. How-\never, the simulations of the autocorrelation function gener-\nated by a small vortex (∼ 5 km) by Andre´ et al. (2000b) sug-\ngest that several vortices would be required within a radar\nrange cell for more than one large peak in the power spec-\ntrum to be produced.\nThis paper investigates the statistical behaviour of the\nspectral width parameter measured by the Iceland East and\nSyowa East radars on the nightside, complementing work by\nHosokawa et al. (2002) regarding the dayside. These radars\nare part of, and form a conjugate pair within, the Super-\nDARN HF radar network. The approximately meridional\narrangement of the summary range gates employed in the\nstatistics database, and described below, is used with the aim\nof determining the statistical location of the spectral width\ngradient, i.e. the transition from high to low spectral width,\nover time. This, in turn, may reveal something of the nature\nand origin of the spectral width gradient.\n2 SuperDARN\nThe Super Dual Auroral Radar Network (SuperDARN) is a\ncollection of high-frequency coherent scatter radars in both\nthe Northern and Southern Hemispheres run cooperatively\nby many nations (Greenwald et al., 1995). Each radar uses\na multi-pulse scheme to transmit radio waves along 16 beam\ndirections, one at a time, with each beam returning informa-\ntion from a number of range gates (75 for Iceland East and 70\nfor Syowa East). In standard common mode the signal from\neach beam is integrated for 7 s, with a gate length of 45 km.\nThe whole scan is synchronized to start at 2-min intervals,\nwith each beam being 3.24◦ wide. At nearer ranges the prop-\nagation is supported by the 12 -hop mode, and at further ranges\nby 1 12 -hop (Milan et al., 1997). Although the exact rela-\ntionship between radar range and ground range is somewhat\ncomplex, the error in the range estimates for the radar beams\nis dependent upon the propagation mode; for 12 -hop the error\nis ∼ 15 km, and for 1 12 -hop the error is ∼ 60 km (Yeoman\net al., 2001). The data are routinely processed in real time\nby software (FITACF) used uniformly throughout the net-\nwork to produce a set of parameters which include backscat-\nter power, Doppler line of sight velocity and Doppler spectral\nwidth. The parameters are derived from the ACF of the re-\nturned signals for each range gate (Villain et al., 1987). A\nset of criteria are used to identify scatter from the ground\n(ground scatter is assumed to have a velocity< 50 m s−1 and\nspectral width < 20 m s−1). The fit is generally successful,\nalthough certain conditions giving rise to multi-peaked spec-\ntra may give rise to anomalies in the spectral width (Baker et\nal., 1995; Andre´ et al., 1999).\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1923\n0\n3\n6\n9\n12\n15\n18\n21\n24\n27+\nO\ncc\nu\nrr\nen\nce\n, %\n p\no\nss\nib\nle\n o\nb\nse\nrv\nat\nio\nn\ns\nWinter Spring\nSummer Autumn\n80o Lat 70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n80o Lat 70o Lat\n80o Lat 70o Lat 80o Lat 70o Lat\nFigure 2\nFig. 2. Colour-coded plots of the data occurrence observed by the Iceland East radar as a function of Northern Hemisphere season, MLT and\nlatitude for the three years of data. Each square of colour represents an interval of 15 min of MLT and one statistical summary point. The\ncolour scale indicates the number of observations of ionospheric scatter above 3 dB as a percentage of the total possible observations in that\nseason from the database used. A statistical auroral oval for a Kp of 2 is overlaid for comparison.\nThe SuperDARN radars used in this investigation are Ice-\nland East and Finland, situated in the Northern Hemisphere\nat Thykkvibær, Iceland (64.49◦ N, 68.48◦ E) and Hankasalmi\n(58.6◦ N, 104.9◦ E), respectively, and Syowa East situated\nin the Southern Hemisphere at Syowa Station, Antarctica\n(66.09◦ S, 71.65◦ E). Altitude Adjusted Corrected Geomag-\nnetic coordinates, AACGM, are used throughout this paper\nand are adapted from Baker and Wing (1989). The Iceland\nEast and Syowa East radars form a conjugate pair, as shown\nin Fig. 1 (the Syowa East field-of-view has been mapped into\nthe Northern Hemisphere using the IGRF95 model; Barton,\n1997).\nEach SuperDARN radar produces a large amount of data,\nmaking study of long-term variations in the observations\nproblematic in terms of data storage requirements and pro-\ncessing time. To overcome this a representative subset of\nthe observations from the Co-operative U. K. Twin Located\nAuroral Sounding System (CUTLASS) Finland and Iceland\nEast radars are routinely stored in a “statistics database”,\nwhich is kept on hard disk, allowing for easy analysis of the\n6 years of radar measurements made to date (January 2002)\nin the common mode operations of the radars. The database\nresulting from this extra processing contains all the normal\nradar parameters but for only 16 summary radar cells. Such\na database was originally introduced by Milan et al. (1997).\nIn that study the 16 summary radar cells were taken from\nbeam 7 of Iceland East, whereas in the present study we\nuse the summary points originally identified in the Finland\nradar field-of-view. Thus, the summary points for Iceland\nEast in this study are located approximately along a geomag-\nnetic meridian, and the gates used are chosen for the large\nrange of magnetic latitudes they encompass, 65◦ N to 81◦ N.\nThe location of the summary points are given as C0 to C15\nin Fig. 1. A similar set of summary range gates, spanning\nthe latitude range 70◦ S to 86◦ S has been determined for\nthe Syowa East radar data using the IGRF95 model (Barton,\n1997) to find magnetically conjugate positions. In order to\nproduce a more accurate comparison between the radar data\nsets, only mutual common time data (where the radars are run\nin the same mode) have been used for the interval 1 January\n1998 to 31 December 2000. For the majority of the data the\nfrequencies used in the common mode were consistent with\nIceland East running in the frequency band from 10.2 MHz\nto 10.7 MHz twenty-four hours a day from January 1998 un-\ntil October 2000. During November and December 2000,\nthe daytime frequency (08:00 to 18:00 UT) for Iceland East\nwas changed to the band from 12.1 MHz to 12.2 MHz. Com-\nparisons of the results using just 1998 and 1999 with those\npresented here show that this change in the frequency has no\nnoticeable effect on the results. The Syowa East radar was\nrun in the band 10.2 MHz to 10.5 MHz twenty-four hours a\nday for all the days, except the period from 6–10 February\n1998, where the daytime frequency (06:00 to 18:00 UT) was\nfrom the 11.1 MHz band. This also has very little apprecia-\nble effect on the results and the conclusions reached. Data\nwith a received power below 3 dB are not used (to eliminate\n∼ 75% of the noise), and data identified as ground scatter by\nthe FITACF software have also been removed. The analysis\npresented here takes the form of occurrence distributions of\nspectral width. The data have been sorted into 15-min in-\ntervals of MLT and spectral width bins which are 20 m s−1\nwide. The spectral width data have been restricted to the\nrange 0 to 500 m s−1; this removes a further ∼ 20% of the\nobservations. Since the fields of view of the radars do not\n1924 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18+\nO\ncc\nu\nrr\nen\nce\n, %\n p\no\nss\nib\nle\n o\nb\nse\nrv\nat\nio\nn\ns\nWinter Spring\nSummer Autumn\n-80o Lat -70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n-80o Lat -70o Lat\n-80o Lat -70o Lat -80o Lat -70o Lat\nFigure 3\nFig. 3. Colour-coded plots of the data occurrence observed by the Syowa East radar as a function of Southern Hemisphere season, MLT and\nlatitude for the three years of data. Each square of colour represents an interval of 15 min of MLT and one statistical summary point. The\ncolour scale indicates the number of observations of ionospheric scatter above 3 dB as a percentage of the total possible observations in that\nseason from the database used. A statistical auroral oval for a Kp of 2 is overlaid for comparison.\noverlap completely, there are some summary range gates that\ndo not have a close conjugate partner. For Iceland East points\nC0 to C3 fall into this category, while for Syowa East points\nS12 to S15 have no conjugate partner. The summary points\nare located along beam 9 of the CUTLASS Finland radar,\nwhich is almost meridional to the magnetic pole. The aim\nof having the points aligned with a large variation in invari-\nant latitude and a small variation in longitude (∼ 15◦ for the\npoints with conjugate partners) is that a long-term analysis of\nthe latitudinal location of the spectral width gradient can be\nachieved.\n3 Statistical observations\n3.1 Data occurrence\nFigure 2 shows the occurrence of ionospheric backscatter\nechoes over the three years of data used, split into sea-\nsons (winter consisting of November, December and Jan-\nuary, spring taken as February, March and April, etc., for the\nNorthern Hemisphere). Each colour-coded square represents\na 15-min interval of MLT for each statistical point for Iceland\nEast. The colour scale indicates the number of observations\nas a percentage of possible observations in that region and\nseason over the three years of data presented. The Iceland\nEast range gates coincident with the summary points vary\nbetween 39 and 48, equivalent to the 1935 km to 2340 km\nrange for normal mode operations. Thus, one expects mainly\nF-region scatter, with a mixture of 12 and 1\n1\n2 hop propaga-\ntion to have originated from these locations. However, there\nmay be some E-region contamination at these ranges result-\ning from 1 12 hop propagation. An analysis of Iceland East\nbackscatter similar to that conducted by Milan et al. (1997)\nshows a small population of Type 1 E-region scatter, iden-\ntified by a low spectral width and a velocity which is close\nto the local ion acoustic speed, observed in all of the Ice-\nland East summary points. An investigation of this Type 1\nscatter for the data used indicates that the contamination of\nthe F-region scatter is negligible. A similar analysis of the\nSyowa East data indicates no discernable Type 1 E-region\nscatter on the nightside. The largest number of observations\ntends to occur in winter, and the least in summer, agreeing\nwith work by Milan et al. (1997). Milan et al. (1997) found\nthat in summer most of the observations by the Iceland East\nradar involve 12 hop propagation and as such, are in the range\ngates close to the radar. The summary points employed in the\ncurrent study are all in the 1 12 hop distance range and, there-\nfore, the amount of data observed in the summer is less. The\npeak occurrence in winter is over 27% of the possible obser-\nvations in the 15-min interval and occurs between 75◦ N and\n80◦ N from 18:00 MLT to 20:00 MLT, followed by a brief lull\nbetween 20:00 and 22:00 MLT. The number of observations\nthen rises again, but at a lower latitude, with the maximum\nbetween 70◦ N and 75◦ N, until the occurrence begins to fall\noff again from 04:00 MLT. The situation in spring is simi-\nlar, although the maximum is smaller (approximately 24% of\nthe possible observations) and the change in latitude is more\ngradual. Autumn is very similar to spring in the distribution\nof data observations. The maximum number of observations\nin the summer months is only 9% to 12%, and this occurs\nmainly below 70◦ N and between 22:00 and 04:00 MLT.\nThe same analysis (except with Southern Hemisphere sea-\nsons) for the data from the Syowa East radar is presented\nin Fig. 3. The data distribution in the Southern Hemisphere\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1925\nFigure 4\nPoint 4, mean=145ms-1,\nnumber of points=962\nPoint 12, mean=182ms-1,\nnumber of points=2139\n0\n5\n10\n15\n%\n O\ncc\nu\nrr\nen\nce\n0 100 200 300 400 500\nSpectral Width, ms-1\nPoint 0, mean=160ms-1,\nnumber of points=481\nPoint 9, mean=221ms-1,\nnumber of points=1001\n0\n5\n10\n15\n%\n O\ncc\nu\nrr\nen\nce\n0 100 200 300 400 500\nSpectral Width, ms-1\n(a) Iceland East (b) Syowa East\nFig. 4. Histograms showing typical examples of spectral width distributions from (a) Iceland East and (b) Syowa East. These are taken from\nthe 04:00 to 06:00 MLT interval from the winter data from the respective hemispheres. The thick blue lines show the boxcar average of the\nshaded distributions and the thick red lines show the same for the unshaded distributions.\nwinter includes a similar peak at dawn to that of the North-\nern Hemisphere winter occurrence at dusk shown in Fig. 2.\nThe differences between the data occurrence at the two radars\nis not the subject of this investigation; however, we suggest\nthat they could be attributed to the different geographic loca-\ntions of the two radars, leading to different plasma and prop-\nagation characteristics. The amount of data is low (< 4%\nof the possible observations) from 18:00 to 20:00 MLT in\nFig. 3, when a region of maximum occurrence begins to be-\ncome clear at around 75◦ S. This continues until 03:00 MLT,\nwhen the occurrence increases to 10+% at the peak. The\nsituation in spring is very different, where the peak occur-\nrence from 18:00 through to 06:00 MLT is over 10%. The\nwidth of the maximum occurrence is approximately 7◦, cen-\ntred on ∼ 76◦ S from 18:00 to 21:00 MLT. After this there is\na smooth, but rapid motion of the region of maximum oc-\ncurrence equatorward with MLT, so that the region is centred\nnearer to 73◦ S, and this remains until 06:00 MLT. The pat-\ntern in the summer months is relatively uniform, with very\nfew data points poleward of 78◦ S. Equatorward of this there\nis a band of larger occurrence varying between 6% to12%.\nThe autumn picture is similar to that in the spring, although\nthe overall level of occurrence is lower.\nFigures 2 and 3 show that the distribution of available data\ncan be quite variable, although as will become apparent in\nthe following sections, the spectral width distribution results\nare not biased by this fact. Only in the Southern Hemisphere\nsummer, at the 4 summary points closest to the geomagnetic\npole, does an absence of a reasonable amount of data cause\nsignificant problems in interpreting the spectral width results.\n3.2 Spectral width distributions\nTypical examples of histograms of spectral width occurrence\nproduced from the statistics databases are presented in Fig. 4.\nThe spectral widths are separated into two-hour intervals of\nMLT and the data are put into bins 20 m s−1 wide. The distri-\nbution for each summary point is normalised using the total\nnumber of points observed at that summary point. Figure 4a\nshows the distributions of spectral width for the Iceland East\nradar from summary points C4 (69.7◦ N) and C12 (77.8◦ N),\nfor the Northern Hemisphere winter, 04:00 to 06:00 MLT.\nThe shaded histogram, depicting the spectral width distribu-\ntion for point C4, is narrower than the unshaded histogram\nrepresenting the distribution for point C12. The standard\ndeviations are 95 m s−1 and 106 m s−1, respectively, re-\nflecting the narrower nature of the distribution at point C4.\nThe means of the two distributions are also very different,\n145 m s−1 and 182 m s−1 for points C4 and C12, respec-\ntively. Both distributions have a sufficient number of points\nto be considered in a statistical manner and both the distri-\nbutions here resemble that found to be collocated with the\nlow-altitude, low-latitude boundary layer (LLBL) (Baker et\nal., 1995, Fig. 8). The mode of all these distributions is be-\nlow 150 m s−1, whereas the cusp distribution from Baker et\nal. (1995) has a mode of ∼ 200 m s−1. However, the more\nequatorward distribution from point C4 is more exponen-\ntial in shape than that from point C12. The broader distri-\nbution also resembles the spectral width distribution (mode\n230 m s−1) found in the Finland radar data above the pole-\nward edge of the 630.0 nm optical emission by Lester et\n1926 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\n12 M L T\n06 M L T\n00 M L T\n18 M L T\n18-20 MLT\n20-22 MLT\n22-24 MLT 00-02 MLT\n02-04 MLT\n04-06 MLT\n% Occurrence\nS\nta\nti\nst\nic\ns \nP\noi\nnt\nSpectral Width (ms-1)\n0 100 200 300 400\n0 100 200 300 400 500\n0 100 200 300 400 500 0 100 200 300 400 500\n0 100 200 300 400 500\nC0\nC5\nC10\nC15\n100 200 300 400 500\nSpectral Width (ms-1) Spectral Width (ms-1)\nSpectral Width (ms-1)\nS\nta\nti\nst\nic\ns \nP\noi\nnt\n15.0+ 13.5 12.0 10.5 9.0 7.5 6.0 4.5 3.0 1.5\n0\nmean width\nC0\nC5\nC10\nC15\nC0\nC5\nC10\nC15\nC0\nC5\nC10\nC0\nC5\nC10\nC15\nC0\nC5\nC10\nC15\n70oN\n80oN\n70oN\n80oN\n70oN\n80oN\n70oN\n80oN\n70oN\n80oN\nFigure 5\n70oN\n80oN\nFig. 5. Contour plots showing the Northern Hemisphere winter variation of spectral width distributions with MLT from Iceland East. The\npoints below the black dashed line do not overlap with the conjugately mapped Syowa East summary points. The 70◦ N and 80◦ N positions\nare indicated by the thin black lines. The white on black lines show the mean spectral width value for each point on the lower axis scale. The\ncolour scale indicates the occurrence at each width normalised to the total occurrence for each summary point.\nal. (2001). Both distribution types were also seen in the in-\nterval studied by Woodfield et al. (2002a), where the broader\ndistribution (mode 290 m s−1) occurred above the spectral\nwidth gradient found in the Finland data, and the narrower\ndistribution (mode 30 m s−1) occurred below the spectral\nwidth gradient. However, the distributions in these case stud-\nies were more distinct than those of Fig. 4a, which may be a\nresult of the averaging with the statistical database, or a re-\nsult of the more zonal pointing direction of the Iceland East\nradar compared to the Finland radar.\nThe distributions in Fig. 4b are from statistical points S0\nand S9 of the Syowa East radar, for Southern Hemisphere\nwinter (May, June and July), 04:00 to 06:00 MLT. These\npoints are approximately conjugate to the summary points C4\nand C12 from the Iceland East summary range gates (Fig. 1).\nThe unshaded distribution from point S9 is more Gaussian\nshaped than that of C12 in Fig. 4a, with a standard devia-\ntion of 117 m s−1 and a mean of 221 m s−1. This distribu-\ntion resembles a cusp-type distribution following Baker et\nal. (1995). The distribution at point S0 is very similar to\nthe conjugate distribution observed at point C4, though the\nmean and standard deviation for point S0 are much larger,\n160 m s−1 and 109 m s−1, respectively, than the values at\nthe conjugate point. There is also a noticeable peak in the\nrange 0 to 20 m s−1 in both of the Syowa East distributions.\nThis is a common feature in the Syowa East data and is most\nlikely caused by the inclusion of ground scatter that has been\nmisidentified as ionospheric scatter. The broader distribu-\ntion, with a larger mean at point S0 than that seen from the\nconjugate summary point C4 is also a regular feature. In\ngeneral, we find that the spectral width distributions from\nSyowa East are broader, with larger standard deviations and\nhigher means than for Iceland East. This is perhaps a com-\nmon feature of spectral widths in the Northern and Southern\nHemispheres as Milan and Lester (2001) suggested a simi-\nlar asymmetry in the spectral width observations of the Su-\nperDARN Goose Bay and Halley radars when observing the\ncusp region.\n3.2.1 Variation with latitude and magnetic local time\nThe variation of the spectral width at Iceland East summary\npoints as a function of latitude and magnetic local time is il-\nlustrated in Fig. 5. Here the distributions of spectral width\nfor the Northern Hemisphere winter months, between 18:00\nto 06:00 MLT on the nightside, are presented in bins with a\ntwo hour duration. The distributions are shown in the form\nof contour plots, with the colour scale representing the oc-\ncurrence frequency of the spectral width values. The distri-\nbution for each summary point is self-normalised to the total\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1927\n12 M L T\n06 M L T\n00 M L T\n18 M L T\n18-20 MLT\n20-22 MLT\n22-00 MLT 00-02 MLT\n02-04 MLT\n04-06 MLT\n% Occurrence\nS\nta\nti\nst\nic\ns \nP\noi\nnt\n0 100 200 300 400 500\n0 100 200 300 400 500\n0 100 200 300 400 500 0 100 200 300 400 500\n0 100 200 300 400 500\nS0\nS5\nS10\nS15\n100 200 300 400 500\nSpectral Width (ms-1) Spectral Width (ms-1)\nSpectral Width (ms-1)\nS\nta\nti\nst\nic\ns \nP\noi\nnt\n15.0+ 13.5 12.0 10.5 9.0 7.5 6.0 4.5 3.0 1.5\n0\nmean width\n70oS\n80oS\n70oS\n80oS\n70oS\n80oS\n70oSS\n80oS\n70oS\n80oS\n70oS\n80oS\nS0\nS5\nS10\nS15\nS0\nS5\nS10\nS15\nS0\nS5\nS10\nS15\nS0\nS5\nS10\nS15\nS0\nS5\nS10\nS15\nFigure 6\nFig. 6. Contour plots showing the Southern Hemisphere winter variation of spectral width distributions with MLT from Syowa East. The\npoints above the black dashed line do not overlap with the Iceland East points. The 70◦ S and 80◦ S positions are indicated by the thin black\nlines. The white on black lines show the mean spectral width value for each point on the lower axis scale. The colour scale indicates the\noccurrence at each width normalised to the total occurrence for each summary point.\nfor that point. The dashed black line indicates the lower limit\nof the overlap with the Syowa East field-of-view. The thin,\nsolid black lines indicate 70◦ N and 80◦ N, as labelled. The\nwhite on black line shows the mean value for the spectral\nwidth distribution from each summary point, with values on\nthe lower axis. The minimum number of points contributing\nto the spectral width distribution of a given summary point\nis ∼ 500 and the maximum is ∼ 4000. The 500 ms−1 limit\nset on the spectral width does not affect the contours, since\nthere are so few points at or above this level. A comparison\nof Fig. 2, showing the occurrence of data points, and Fig. 5\nshows that although the broadest spectral width distributions\nat first glance appear to follow the location of the most ob-\nservations, the spectral width distributions in the 04:00 to\n06:00 MLT bin of Fig. 5 are the most broad, but the maxi-\nmum number of observations is in the 18:00 to 20:00 MLT\nregion. Thus, the form of the spectral width distributions is\nnot biased by the data occurrence. The shape described by\nthe means of the distributions for each point varies as the\nMLT changes (the white on black line in Fig. 5). In the pre-\nmidnight sector the mean value of the spectral width varies\nslowly between ∼ 90 and 150 ms−1 across the 16 summary\npoints. The distributions here are also, in general, quite nar-\nrow, even where the occurrence is large. The observations\nfrom 00:00 MLT onwards are somewhat different. The distri-\nbutions become broader and the values of the means over the\nsummary points have larger ranges, from 90 to 220 m s−1,\nwith the spread greatest in the final nightside bin (04:00 to\n06:00 MLT). In addition, the location of the largest value\nof the mean progresses northwards as the MLT increases in\nthe post-midnight sector. Two distinct types of distribution\nemerge in the post-midnight sector, one narrow with a low\nmean, typically seen at low latitudes (e.g. summary point\nC0 in the 02:00 to 04:00 MLT bin), and the other broad with\na higher mean, typically seen at higher latitudes (e.g. sum-\nmary point C9 in the 02:00 to 04:00 MLT bin). These two\ntypes of distribution are shown in histogram form in Fig. 4a.\nThe changeover point between these two forms of distribu-\ntion in Fig. 5 represents the average position of the spectral\nwidth gradient for the Northern Hemisphere winter. The dis-\ntributions and mean values suggest that the regions of high\nspectral width in the pre-midnight sector are comparatively\nless common events for the Iceland East radar.\nThe general trend appears to be that the separatrix between\nnarrow, low-valued mean distributions and broader distri-\nbutions with higher means (>∼ 150 m s−1) appears after\n22:00 MLT, at which time it appears to be equatorward of\npoint C5, becoming clearer towards dawn. A similar picture\nis true for the other three seasons, although in summer the\ndistributions are much narrower overall; see the next section.\n1928 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\n0 100 200 300 400\n0\n100\n200\n300\n400\nSyowa East mean spectral width, ms-1\nIc\nel\nan\nd\n E\nas\nt \nm\nea\nn\n s\np\nec\ntr\nal\n w\nid\nth\n, m\ns-\n1\nFigure 7\nFig. 7. Scatter plot of simultaneous and co-located mean spectral\nwidths from the statistics databases of the Syowa East and Iceland\nEast radars. The diagonal line represents a one-to-one relationship\nfor comparison.\nFigure 6 shows a similar analysis for the Syowa East sum-\nmary range gates for the Southern Hemisphere winter (May,\nJune, July). The dashed line shows the upper limit of the\noverlap with the Iceland East summary points. The thin,\nsolid black lines indicate 70◦ S and 80◦ S, as labelled, and\nthe white on black line shows the mean spectral width. The\nfield-of-view from point S12 (82.1◦ S) and polewards shows\nsignificantly less observed ionospheric scatter compared with\npoints S11 and below (see Fig. 2). However, summary points\nS12 to S15 are polewards of the conjugate points of Iceland\nEast and, therefore, this lack of data is not overly detrimental\nto this study. The distributions of spectral width observed by\nSyowa East are much broader, with higher means than those\npresented in Fig. 5 from Iceland East. The latitudinal vari-\nation in the mean is for the most part small. In the 18:00\nto 20:00 MLT bin the mean spectral width decreases by ap-\nproximately 40 m s−1 between S0 and S11, as the latitudes\nbecome closer to the pole. The situation is the same from\n20:00 to 24:00 MLT. After midnight MLT the mean width\nshows no overall trend from S0 to S11, then from 02:00 to\n06:00 MLT, the mean increases slightly from S0 to S11, par-\nticularly in the 04:00 to 06:00 MLT interval. The similar-\nity to the Iceland East data is most noticeable in the change\nin the overall broadness of the spectral width distributions,\nwith narrower distributions before midnight MLT and much\nbroader ones as the morning sector is approached. A very\nsimilar set of contours is produced from the spring data, de-\nspite the different data occurrence between the two seasons\n(Fig. 3). This implies that the database is not biased (except\nat the latitudes closest to the pole, where there is very little\ndata from the Syowa East radar).\nFigure 7 presents a scatter plot of the simultaneous and\nconjugate mean spectral width values from the Syowa East\nand Iceland East statistics databases. The diagonal line repre-\nsents the centre line for a one-to-one relationship. The main\ncluster of points is below this line, indicating that, on aver-\nage, the Syowa East radar does have larger spectral widths,\nalthough not necessarily all the time. Keeping these differ-\nences in mind, the spectral width distributions in the region\nof overlap (Figs. 5 and 6) between the two sets of summary\npoints show the same trend from narrower to broader distri-\nbutions as 00:00 MLT is passed. The mean values increase\noverall from 22:00 MLT to 06:00 MLT, and the change in the\nshape of the distributions (as seen by looking at the modal\nvalues) is similar to that in Fig. 4.\nIn general, the separatrix between narrow and broad dis-\ntributions is harder to see in the Syowa East spectral width\ndistributions. Whether this is because the separatrix is sim-\nply equatorwards of the field-of-view or that it is not observ-\nable is unknown. Given the similarity of the trends between\nSyowa East and Iceland East, however, it is most likely to be\nthe former explanation.\n3.2.2 Variation with season\nIt has been suggested that the spectral width boundary is a\nproxy for the OCFLB. To test this we employ the flow re-\nversal boundary (FRB) as another proxy of the OCFLB, as-\nsuming purely reconnection-driven convection (Lockwood et\nal., 1988) and compare its co-location with the spectral width\ndistributions. The beams of the Iceland East radar point in a\ngenerally azimuthal direction; the line-of-sight velocity (l-\no-s) measurements are, therefore, ideally placed to locate\nthe FRB of twin-cell convection of plasma around the po-\nlar cap. The measurements of l-o-s velocity corresponding\nto the spectral widths already presented have also been col-\nlected into 15-min intervals of MLT. The mean velocity has\nthen been calculated and identified as towards or away from\nthe radar, ignoring the magnitude. The results are presented\nin the top four panels of Fig. 8, the red indicates westward\nand the blue indicates eastward flowing plasma. In all but\nthe Northern Hemisphere summer, there is a clearly defined\nchange in the direction of plasma flow with latitude. Statis-\ntical auroral ovals (Feldstein, 1963; Holzworth and Meng,\n1975) for a Kp value of 2 are overlaid for comparison (the\naverage Kp value over the three years was approximately\n2). In winter the poleward edge of the auroral oval matches\nthe FRB very closely, and the changeover between convec-\ntion cells at the Harang discontinuity is over a small range\nof MLT, ∼ 30 min. Although not shown here, the magni-\ntude of the l-o-s velocity in the changeover region is small,\nsince the plasma motion here is mainly out of the polar cap\nand directly across the radar beams. The spring and autumn\nFRBs are also clear. The spring FRB, from 18:00 MLT to the\nchangeover region, starting at ∼ 22:00 MLT, is ∼ 4◦ pole-\nward of the inner boundary of the statistical auroral oval.\nHowever, the FRB from ∼ 24:00 MLT once again lines up\nwith the poleward edge of the oval. A similar situation oc-\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1929\n0\n20\n40\n60\n80\n100\n120\n140\n160\n180+\nM\nea\nn\n W\nid\nth\n, m\ns-\n1\nWinter Spring\nSummer Autumn\n80o Lat 70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n80o Lat 70o Lat\n80o Lat 70o Lat 80o Lat 70o Lat\nWinter Spring\nSummer Autumn\n80o Lat 70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n80o Lat 70o Lat\n80o Lat 70o Lat 80o Lat 70o Lat\nWestwards\nEastwards\nVelocity \ndirection\nFigure 8\nFig. 8. The top four panels depict the direction of plasma flow observed by the near-azimuthal beams of the Iceland East radar. Red areas\nshow westward moving plasma and blue areas eastward moving plasma. The data are separated into Northern Hemisphere seasons, 15-min\nMLT intervals and one square for each summary point. A statistical Feldstein auroral oval is overlaid for comparison. The bottom four panels\nshow the similarly separated results for the mean spectral width, again with a statistical oval overlaid.\ncurs in the autumn. In the summer, the results of the anal-\nysis are unclear, probably due to the much smaller number\nof observations available. A comparison has been made with\nthe statistical merged vectors available for the Iceland East,\nFinland pair of overlapping SuperDARN radars. The l-o-s\nvelocities for the overlapping summary points are combined\nto give two-dimensional vectors. Both Iceland East and Fin-\nland must have data at the relevant summary points for a two-\ndimensional vector to be produced, making the question of\nhow much data is necessary to see the general pattern more\ncritical. This analysis is not shown, but indicates that the one-\ndimensional depiction of the FRB in Fig. 8 is generally real-\nistic for the two-dimensional vectors found using the over-\nlapping radars. It would appear however, that the seasonal\nvariation in the location of the one-dimensional FRB in the\npre-midnight sector is not valid in the two-dimensional pic-\nture, and is, therefore, likely to be a product of using just one\nradar.\nThe bottom four panels of Fig. 8 represent the mean spec-\ntral widths in each season, again in 15-min intervals of MLT.\nThe same statistical auroral ovals are overlaid on each of\nthese panels. By examining the winter results first, we note\nthat the highest mean values of spectral width, 160+ m s−1,\noccur from∼ 23:00 MLT through to 06:00 MLT, with a grad-\nual rise in latitude from ∼ 70 ◦ N to 76 ◦ N. Approximately\nhalf of the highest mean spectral widths occur within the\nauroral oval represented here, and since the FRB matches\nclosely to the poleward edge of the oval, this means that half\nof the large spectral widths observed occurred on closed field\nlines, and half on open field lines. The gradual increase in lat-\nitude of the maximum in the mean spectral width appears to\nfollow the motion of the auroral oval, so although it appears\nthe two are somehow linked, it would seem that (at least from\n∼ 22:00 MLT) the commonly observed spectral width gradi-\nent does not represent the OCFLB. A similar situation occurs\nin spring and autumn, although the start of the high spec-\n1930 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\nWinter Spring\nSummer Autumn\n-80o Lat -70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n-80o Lat -70o Lat\n-80o Lat -70o Lat -80o Lat -70o Lat\nWestwards\nEastwards\nVelocity \ndirection\n0\n20\n40\n60\n80\n100\n120\n140\n160\n180+\nM\nea\nn\n W\nid\nth\n, m\ns-\n1\nWinter Spring\nSummer Autumn\n-80o Lat -70o Lat\n24 MLT 02 MLT22 MLT\n20 MLT\n24 MLT 02 MLT22 MLT\n24 MLT 02 MLT22 MLT 24 MLT 02 MLT22 MLT\n20 MLT\n-80o Lat -70o Lat\n-80o Lat -70o Lat -80o Lat -70o Lat\nFigure 9\nFig. 9. The top four panels depict the direction of plasma flow observed by the near-azimuthal beams of the Syowa East radar. Red areas\nshow westward moving plasma and blue areas eastward moving plasma. The data are separated into Southern Hemisphere seasons, 15-min\nMLT intervals and one square for each summary point. A statistical Feldstein oval is overlaid for comparison. The bottom four panels show\nthe similarly separated results for the mean spectral width, again with a statistical oval overlaid.\ntral width region is further around in MLT, at ∼ 01:00 MLT.\nThe MLT sector between 18:00 and 21:00 MLT shows differ-\nent behaviour from the post-midnight sector in winter, spring\nand autumn. Here the highest mean spectral widths seem to\nbe mostly above the poleward edge of the auroral oval, with\nthe maximum being lower than that in the post-midnight sec-\ntor. The summer results show much lower widths throughout\nthe nightside, even where the velocity results are clearest and\nthe data occurrence is the largest.\nFigure 9 presents a similar analysis for the Southern Hemi-\nsphere seasons. The Syowa East radar beams are also az-\nimuthal, in general, and hence, we again see a clear indi-\ncation of the location of the FRB in the top four panels of\nFig. 9. The match to the velocity reversal in this case is close\nthroughout the Southern Hemisphere winter, spring and au-\ntumn. The observations in the post-midnight sector of the\nsummer data also line up closely to the auroral oval (there\nis more data here than for Iceland East, see Fig. 3). Unfor-\ntunately, for the time period used in the database, no over-\nlapping radar field-of-view was available for the Syowa East\nradar; therefore, no two-dimensional flow vectors are avail-\nable for the Syowa East data during this time. Given the good\nrelationship between the one- and two-dimensional flows for\nthe Iceland East radar it seems reasonable to assume that the\nSyowa East one-dimensional data is a good substitute. The\nmean spectral widths shown in the bottom four panels are, in\ngeneral, higher than those from Iceland East, as mentioned\npreviously. Similar to the Iceland East analysis, the highest\nspectral widths tend to occur from a little before midnight to\n06:00 MLT, although over a wider range of latitudes. Again,\nthe summer widths are much lower, bearing in mind that the\ndata poleward of 76◦ S is in very low abundance.\n4 Discussion\nThe results presented in the previous section reveal four key\npoints that require further comment.\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1931\n1. The spectral width gradient observed previously in case\nstudies (e.g. Woodfield et al., 2002a) is seen to persist\nin statistical studies of the spectral width.\n2. There is a variation in the latitude of the statistical gradi-\nent in the spectral width as MLT changes on the night-\nside. The highest widths seem to occur on both open\nand closed field lines, using the FRB obtained from the\nazimuthal velocity measurements as a guide.\n3. There is a seasonal effect seen in the data, where the\nbroader spectral width distributions do not appear to be\npresent in the summer months.\n4. The Southern Hemisphere spectral width values are typ-\nically larger than those from the Northern Hemisphere.\nThe change from low (< 200 ms−1) to high (> 200 ms−1)\nspectral width is a feature that occurs both on a case by\ncase and a statistical basis in the nightside ionosphere. The\nFITACF software produces two distinct forms of spectral\nwidth: high and variable, and low, which can be identi-\nfied using the distribution of spectral width over time. The\nlow spectral width regions are characterised by narrow dis-\ntributions dominated by a large peak close to 0 ms−1. The\nhigh and variable spectral width regions are characterised\nby a broader distribution, with a less prominent peak dis-\ntinctly removed from 0 ms−1, and a larger mean (well above\n100 ms−1). This is demonstrated in Fig. 4 of Woodfield et\nal. (2002a), which shows how the spectral width distribu-\ntion over just 5 hours shows a trend from one to the other of\nthese types of distribution described above. There is nearly\nalways a distinct latitudinal gradient in the value of spectral\nwidth between the two regions in individual cases, and this\noften moves with time, thus, averaging over time (as in Fig. 4\nof Woodfield et al., 2002a), the sharp gradient becomes a\nsmoother change between the two types of distribution. This\neffect is prominent in the statistical distributions presented in\nthis paper, which are greatly averaged; hence, the distinction\nbetween the idealised distributions for low and high spectral\nwidth becomes less obvious. Nevertheless, the trend from\none type of distribution to the other is still apparent. The\nsharp gradient in the width seen in individual cases is not, in\ngeneral, collocated with a sharp change in either backscatter\npower, l-o-s velocity or elevation angle. The broader spec-\ntral width distributions resemble those observed in the cusp,\nwhereas the narrower distributions are more like those ob-\nserved in the low-latitude boundary layer (Baker et al., 1995).\nThis implies that a similar mechanism that causes high and\nvariable spectral width in the cusp may also be manifest on\nthe nightside.\nIntense electric and magnetic field fluctuations of the or-\nder of 1 Hz have been observed over the auroral zone by\nlow-altitude, polar-orbiting satellites (Gurnett et al., 1984;\nGurnett, 1991; Dudeney et al., 1998). Two models for the\ngeneration of these 0.1 to 5 Hz fluctuations measured by low-\naltitude satellites have been put forward. The first model as-\nsumes that the fluctuations are observed due to the motion\nof the satellite through a system of static field-aligned cur-\nrent structures (FACs) embedded in the ionosphere (Smiddy\net al., 1980). This is a space\/time ambiguity problem in\nthe spacecraft data, not a wave in the ionosphere, and the\nscale size of these features would be small, approximately\n200 m, which is well below the size of a radar range cell.\nThese FACs are capable of producing vortex patterns in the\nplasma flow around them (Lanzerotti et al., 1990 and refer-\nences therein). Previous work with HF coherent radar spec-\ntra has attributed double-peaked spectra to vortices less than\nthe scale size of the radar range cells (∼ 45 km), such as\nthese static FACs could produce (Schiffler et al., 1997; Hu-\nber and Sofko, 2000). It is possible that double-peaked spec-\ntra may be observed with overestimated spectral widths, al-\nthough simulations by Andre´ et al. (2000b) suggest that there\nwould need to be several vortices smaller than the size of the\nradar range cell in order to cause high spectral widths.\nThe second model suggests that disturbances in the distant\nmagnetosphere are transmitted to the ionosphere as Alfve´n\nwaves, and it is these waves that are the Pc1 and Pc2 fre-\nquency range fluctuations observed by the low-altitude satel-\nlites (e.g. Goertz and Boswell, 1979; Lysak and Dum, 1983).\nThis would produce the kind of temporal electric field varia-\ntion required for the proposed cusp mechanism of Andre´ and\nco-workers (1999; 2000a; 2000b).\nThe variation of the spectral width distributions observed\nwith MLT indicates that the root cause of the high spectral\nwidth does not map to a constant magnetic latitude as MLT\nvaries. This encourages the idea of using the spectral width\nboundary as an ionospheric proxy, since both the OCFLB\nand CPS\/BPS boundaries move in latitude with MLT. The\nFRB identified using the azimuthal pointing directions of the\ntwo radars in Figures 8 and 9 shows that approximately half\nthe highest spectral widths are likely to be on closed field\nlines in the MLT sector from 23:00 to 06:00 MLT. This im-\nplies that, in this sector at least, the spectral width gradient\nis unlikely to represent the OCFLB, since this would require\nall the highest values to be above the poleward edge of the\nauroral oval and the FRB. This agrees with case study results\nin this region of MLT (Woodfield et al., 2002a, b). The spec-\ntral widths prior to 23:00 MLT are lower in magnitude, and\nthe distribution is such that the spectral width boundary ob-\nserved between 18:00 and 23:00 MLT could reasonably rep-\nresent the OCFLB, agreeing with Lester et al. (2001). This\nasymmetry of the spectral width magnitudes in the pre- and\npost-midnight sectors of the MLT indicates that the source\nregion for generating high and variable spectral widths on\nthe nightside is more prominent in the post-midnight sector.\nA seasonal variation is observed in the magnitude of the\nmean spectral widths; in an attempt to explain this we try\nto identify here what seasonal influences might control this\nvariation. One obvious seasonal factor to consider is the level\nof solar illumination. During the summer in the respective\nhemispheres, all the summary points are fully illuminated by\nthe Sun at 300 km altitude on the nightside. The plasma den-\nsity and, therefore, the plasma frequency is different in the\nsummer. It is unlikely that changes in the propagation of the\n1932 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\nHF radar signals in summer are the cause of the decrease in\nthe mean spectral widths. The decrease in the number of ob-\nservations available during the summer is due to this reason,\nbut the propagation itself would be unlikely to decrease the\nmean width unless the spectral width is height dependent.\nWoodfield et al. (2002a) examined the elevation angle data\nfor the spectral width gradient case that they were investigat-\ning, and found that there was no change in elevation angle\nassociated with the sudden change in spectral width values.\nThis implies that the altitude of the observations is not a fac-\ntor in the spectral width observations. Over the three years\nof data studied here there are enough data points available\nto assume that we see an accurate description of the summer\nspectral widths. It seems most likely that there is a seasonal\nvariation in either the source of the high spectral widths, or\nhow the different plasma conditions affect the propagation\nfrom the source. For example, if the high spectral widths\nare a result of a time-varying electric field (Andre´ et al.,\n1999; 2000a; 2000b), which originates from a down-tail dis-\nturbance in the magnetosphere and travels by Alfve´n waves\nalong magnetic field lines to the F-region ionosphere, then\nchanges in the plasma properties along the path will change\nfrom season to season. If vortices are the mechanism, then\nthe seasonal variation in the strength of FACs (e.g. Shue et\nal., 2001) is important. It is also possible, however, that the\nsource region for this mechanism does not exist, or does not\nmap to the same place in the summer months.\nOn a statistical basis the nightside spectral widths ob-\nserved by the Syowa East radar are larger and more var-\nied than those observed by its conjugate counterpart Iceland\nEast. A similar situation exists on the dayside (Hosokawa et\nal., 2002). There are several possible explanations for this:\n(a) the difference in ionospheric conditions in the two hemi-\nspheres, both in terms of the propagation of the radar beams\nand the local conditions affecting any generating mecha-\nnisms, (b) an inter-hemispheric\/seasonal difference in wave\nactivity, (c) a variation in field-aligned current activity, (d)\nthe difference in the dip-angle of the magnetic field lines\nfor the two sets of summary range gates, or (e) instrumental\nnoise levels. The fields-of-view of the two radars, although\nin conjugate geomagnetic positions, are not geographic mir-\nror images of each other. The geographic latitude ranges for\nSyowa East and Iceland East are 63◦ S to 72◦ S and 73◦ N to\n84◦ N, respectively. As such, the level of solar illumination\nthe summary points from each radar receive will be differ-\nent in their respective seasons. This will likely cause a small\ndifference in the propagation of the respective radar beams\nto the summary point locations, leading to a small difference\nin the height of the observations. However, even in the re-\nspective summers of each hemisphere, the Syowa East spec-\ntral width distributions are still broader, despite there being\nfull (all be it at a slightly different zenith angle) illumina-\ntion. Also, as mentioned previously, the spectral width ap-\npears to be independent of height. Points (b) and (c) amount\nto the same problem, where the mechanism for creating the\nhigh spectral width may itself vary between the hemispheres\nand also with season. Point d) relates to the difference in\nmagnetic field line dip-angle, which is ∼ 10◦, where the Ice-\nland East summary points are subject to more vertical field\nlines. The dip-angle is important since this determines where\nand at what height the radar beam will be orthogonal to the\nmagnetic field lines and hence, able to be backscattered by\nfield-aligned irregularities. However, 10◦ is a relatively small\ndifference, outweighed by the typical error in the range es-\ntimation of a radar range cell at 1 12 hops, which is 60 km(Yeoman et al., 2001). Instrumental effects, point (e), are an\nimportant consideration. Although the processing software\nused by both radars is identical throughout the data set, the\nnoise level in the readings could affect the overall output. A\npower level of 3 dB and spectral width limit of 500 ms−1 was\nset in the analysis of the data we conducted, to eliminate ap-\nproximately 95% of the data affected by low signal-to-noise\nratios. We also performed a check on the comparative noise\nlevels of the two radars and found that the amount of noise\nobserved by the Syowa East radar was significantly lower\nthan at Iceland East, likely due to the lack of local radio in-\nterference on Antarctica. If extra noise in the signals were\nthe cause of the broader widths (by the introduction of pow-\nerful multiple peaks into the spectra), then we would expect\nto see higher values in the Iceland East data and not, as we\nhave found, in the Syowa East data. It would, therefore, ap-\npear that the broader spectral widths in the Syowa East data\nare caused by a geophysical effect, but not one of radar prop-\nagation or processing of instrumental origin.\n5 Summary and conclusions\nA statistical study of SuperDARN radar spectral width data\nfrom the nightside in both hemispheres has been carried out\nusing data from the Syowa East and Iceland East radars.\nThese two radars often observe similar features in their spec-\ntral width data. This implies that the generating mecha-\nnism of high spectral width values is capable of travelling\ninto both the Southern and Northern Hemispheres from some\nmagnetospheric source region either on closed or open mag-\nnetic field lines. There is a definite latitudinal dependence\nof the spectral width distribution seen in both hemispheres\nthat shows a statistical location of the spectral width gradi-\nent. The magnetic local time affects the spectral width dis-\ntributions, notably in the location of the spectral width gradi-\nent, which reaches minimum latitude around magnetic mid-\nnight. Season also plays a part in the magnitude of the spec-\ntral width; in summer the spectral widths are decreased. The\nmost marked difference between the Syowa East and Iceland\nEast data is that the Syowa East spectral width distributions\nare, in general, broader and peaked at values greater than\nthose of Iceland East. This is thought to be due to a geophys-\nical rather than instrumental difference.\nAcknowledgements. The authors wish to thank those involved in\nthe deployment and operation of the CUTLASS HF radars run by\nthe University of Leicester with joint funding from the UK Particle\nPhysics and Astronomy Research Council (PPARC) grant number\nPPA\/R\/R\/1997\/00256, the Swedish Institute for Space Physics, Up-\nE. E. Woodfield et al.: A statistical study of nightside spectral width distributions 1933\npsala and the Finnish Meteorological Institute, Helsinki. The au-\nthors also wish to thank the Ministry of Education, Culture, Sports,\nScience and Techonology for supporting the Syowa HF radar sys-\ntems and the 39th and 40th Japanese Antarctic Research Expedi-\ntions (JAREs) for carrying out the HF radar operations at Syowa.\nEEW is indebted to PPARC for a research studentship. This study\nis funded by a part of ’Ground Research for Space Utilization’ pro-\nmoted by NASDA and Japan Space Forum. KH is supported by the\nGrant in Aid for Scientific Research (A:11304029) from Japan So-\nciety for the Promotion of Science (JSPS).\nThe Editor in Chief thanks C. Hanuise and I. McCrea for their\nhelp in evaluating this paper.\nReferences\nAndre´, R., Pinnock, M., and Rodger, A. S.: On the SuperDARN\nautocorrelation function observed in the ionospheric cusp, Geo-\nphys. Res. Lett., 26, 22, 3353–3356, 1999.\nAndre´, R., Pinnock, M., and Rodger, A. S.: Identification of the\nlow-altitude cusp by Super Dual Auroral Radar Network radars:\nA physical explanation for the empirically derived signature, J.\nGeophys. Res., 105, A12, 27 081–27 093, 2000a.\nAndre´, R., Pinnock, M., Villain, J.-P., and Hanuise, C.: On the\nfactors conditioning the Doppler spectral width determined from\nSuperDARN HF radars, Int. J. Geomag. Aeronomy, 2, 1, 77–86,\n2000b.\nBaker, K. B. and Wing, S.: A new magnetic coordinate system for\nconjugate studies at high latitudes, J. Geophys. Res., 94, 9139–\n9143, 1989.\nBaker, K. B., Dudeney, J. R., Greenwald, R. A., Pinnock, M.,\nNewell, P. T., Rodger, A. S., Mattin, N., and Meng, C.-I.: HF\nradar signatures of the cusp and low-latitude boundary layer, J.\nGeophys. Res., 100, A5, 7671–7695, 1995.\nBaker, K. B., Greenwald, R. A., Ruohoniemi, J. M., Dudeney, J.\nR., Pinnock, M., Newell, P. T., Greenspan, M. E., and Meng, C.-\nI.: Simultaneous HF-radar and DMSP observations of the cusp,\nGeophys. Res. Lett., 17, 11, 1869–1872, 1990.\nBarton, C. E.: International Geomagnetic Reference Field: The\nSeventh Generation, J. Geomag. Geoelectr., 49, 123–148, 1997.\nDudeney, J. R., Rodger, A. S., Freeman, M. P., Pickett, J., Scudder,\nJ., Sofko, G., and Lester, M.: The nightside ionospheric response\nto IMF By changes, Geophys. Res. Lett., 25, 14, 2601–2604,\n1998.\nDyrud, L. P., Engebretson, M. J., Posh, J. L., Hughes, W. J., Fukun-\nishi, H., Arnoldy, R. L., Newell, P. T., and Horne, R. B.: Ground\nobservations and possible source regions of two types of PC1-\n2 micropulsation at very high latitudes, J. Geophys. Res., 102,\n27 011–27 027, 1997.\nFeldstein, Y. I.: On morphology of auroral and magnetic distur-\nbances at high latitudes, Geomag. Aeron., 3 , 183–192, 1963.\nGoertz, C. K. and Boswell, R. W.: Magnetosphere-Ionosphere Cou-\npling, J. Geophys. Res., 84, 7239–7246, 1979.\nGreenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones,\nT. B., Thomas, E. C., Villain, J.P., Cerisier, J.C., Senior, C.,\nHanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen,\nE., Pallinen, R., Walker, A. D. M., Sato, N., and Yamagishi, H.:\nDARN\/SuperDARN: A global view of the dynamics of the high-\nlatitude convection, Space Sci. Rev., 71, 761–796, 1995.\nGurnett, D. A.: Auroral Plasma Waves, in Auroral Physics, (Eds)\nMeng, C.-I., Rycroft, M. J., and Franck, L. A., Cambridge Univ.\nPress, New York, Ch. IV-6, pp. 241–254, 1991.\nGurnett, D. A., Huff, R. L., Menietti, J. D., Burch, J. L., Winning-\nham, J. D., and Shawan, S. D.: Correlated Low-Frequency Elec-\ntric and Magnetic Noise Along the Auroral Field Lines, J. Geo-\nphys. Res., 89, 8971–8985, 1984.\nHolzworth, R. H. and Meng, C.-I.: Mathematical representation of\nthe auroral oval, Geophys. Res. Lett., 2, 377–380, 1975.\nHosokawa, K., Woodfield, E. E., Lester, M., Milan, S. E., Yuki-\nmatu, A. S., and Sato, N.: Statistical Characteristics of Spectral\nWidth as Observed by the Conjugate SuperDARN Radars, Ann.\nGeophysicae, in press, 2002.\nHuber, M. and Sofko, G. J.: Small-scale vortices in the high-latitude\nF-region, J. Geophys. Res., 105, 20 885–20 897, 2000.\nLanzerotti, L. J., Wolfe, A., Trivedi, N., Maclennan, C. G., and\nMedford, L. V.: Magnetic Impulse Events at high Latitudes:\nMagnetopause and Boundary Layer Plasma Processes, J. Geo-\nphys. Res., 95, 97–107, 1990.\nLester, M., Milan, S. E., Besser, V., and Smith, R.: A Case Study\nof HF Radar Spectra and 630.0 nm Auroral Emission in the Pre\nMidnight Sector, Ann. Geophysicae, 19, 327–339, 2001.\nLewis, R. V., Freeman, M. P., Rodger, A. S., Reeves, G. D., and\nMilling, D. K.: The electric field response to the growth phase\nand expansion phase onset of a small isolated substorm, Ann.\nGeophysicae, 15, 289–299, 1997.\nLockwood, M., Cowley, S. W. H., Todd, H., Willis, D. M., and\nClauer, C. R.: Ion flows and heating at a contracting polar-cap\nboundary, Planet. Space Sci., 36, 11, 1229–1253, 1988.\nLysak, R. L. and Dum, C. T.: Dynamics of Magnetosphere-\nIonosphere Coupling Including Turbulent Transport, J. Geophys.\nRes., 88, 365–380, 1983.\nMatsuoka, A., Tsuruda, K., Hayakawa, H., Mukai, T., Nishida, A.,\nOkada, T., Kaya, N., and Fukunishi, H.: Electric field fluctua-\ntions and charged particle precipitation in the cusp, J. Geophys.\nRes., 98, 11 225–11 234, 1993.\nMaynard, N. C., Aggson, T. L., Basinka, E. M., Burke, W. J.,\nCraven, P., Peterson, W. K., Suguira, M., and Weimer, D. R.:\nMagnetospheric boundary dynamics: DE-1 and DE-2 observa-\ntions near the magnetopause and cusp, J. Geophys. Res., 96,\n3505–3522, 1991.\nMenk, F. W., Fraser, B. J., Hansen, H. J., Newell, P. T., Meng, C.-\nI., and Morris, R. J.: Identification of the magnetospheric cusp\nand cleft using PC1-2 ULF pulsations, J. Atmos. Terr. Phys., 54,\n1021–1042, 1992.\nMilan, S. E. and Lester, M.: Interhemispheric differences in the HF\nradar signature of the cusp region A review through the study\nof a case example, Adv. Polar Upper Atmos. Res., 15, 159–177,\n2001.\nMilan, S. E., Lester, M., Cowley, S. W. H., Moen, J., Sandholt, P.\nE., and Owen, C. J.: Meridian-scanning photometer, coherent HF\nradar, and magnetometer observations of the cusp: a case study,\nAnn. Geophysicae, 17, 159–172, 1999.\nMilan, S. E., Yeoman, T. K., Lester, M., Thomas, E. C., Jones, T.\nB.: Initial backscatter occurrence statistics from the CUTLASS\nHF radars, Ann. Geophysicae, 15, 703–718, 1997.\nMoen, J., Carlson, H. C., Milan, S. E., Shumilov, N., Lybekk, B.,\nSandholt, P. E., and Lester, M.: On the collocation between day-\nside auroral activity and coherent HF radar backscatter, Ann.\nGeophysicae 18, 1531–1549, 2001.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker,\nK. B.: High spatial and temporal resolution observations of the\nionospheric cusp, Ann. Geophysicae, 13, 919–925, 1995.\nRodger, A. S., Mende, S. B., Rosenberg, T. J., and Baker, K. B.: Si-\nmultaneous optical and HF radar observations of the ionospheric\n1934 E. E. Woodfield et al.: A statistical study of nightside spectral width distributions\ncusp, Geophys. Res. Lett., 22, 2045–2048, 1995.\nRodger, A. S.: Ground-based imaging of Magnetospheric bound-\naries, Adv. Space Res., 25, 7\/8, 1461–1470, 2000.\nSchiffler, A., Sofko, G., Newell, P. T., and Greenwald, R.: Map-\nping the outer LLBL with SuperDARN double-peaked spectra,\nGeophy. Res. Lett., 24, 3149–3152, 1997.\nShue, J.-H., Newell, P. T., Liou, K., and Meng, C.-I.: The quan-\ntitative relationship between auroral brightness and solar EUV\nPedersen conductance, J. Geophys. Res., 106, 5883–5894, 2001.\nSmiddy, M., Burke, W. J., Kelley, M. C., Saflekos, N. A., Gussen-\nhoven, M. S., Hardy, D. A., and Rich, F. J.: Effects of High-\nAltitude Conductivity on Observed Convection Electric Fields\nand Birkeland Currents, J.Geophys. Res., 85, 6811–6818, 1980.\nVillain, J.-P., Greenwald, R. A., Baker, K. B., and Ruohoniemi,\nJ. M.: HF radar observations of E-region plasma irregularities\nproduced by oblique electron streaming, J. Geophys. Res., 92,\n12 327–12 342, 1987.\nWoodfield, E. E., Davies, J. A., Eglitis, P., and Lester, M.: High\nand variable spectral width in the pre-dawn sector: A case study\ninvolving CUTLASS, EISCAT, ESR and optical data, Ann. Geo-\nphysicae, 20, 501–509, 2002a.\nWoodfield, E. E., Davies, J. A., Lester, M., Yeoman, T. K., Eglitis,\nP., and Lockwood, M.: Nightside studies of coherent HF radar\nspectral width behaviour, Ann. Geophysicae, in press, 2002b.\nYeoman, T. K., Wright, D. M., Stocker, A. J., and Jones, T. B.: An\nevaluation of range accuracy in the Super Dual Auroral Radar\nNetwork over-the-horizon HF radar systems, Radio Science, 36,\n4, 801–813, 2001.\n"}