{"doi":"10.1080\/0968776020100207","coreId":"14224","oai":"oai:generic.eprints.org:381\/core5","identifiers":["oai:generic.eprints.org:381\/core5","10.1080\/0968776020100207"],"title":"Grounded Theory as an approach to studying students’ uses of learning management systems","authors":["Alsop, Graham","Tompsett, Chris"],"enrichments":{"references":[{"id":197966,"title":"A Grounded Theory investigation of students' perceptions of learning management systems',","authors":[],"date":"2002","doi":"10.3402\/rlt.v10i2.11402","raw":"Alsop, G. and Tompsett, C. P. (2002), 'A Grounded Theory investigation of students' perceptions of learning management systems', in Proceedings of the 9th Improving Student Learning Symposium, 2001, Oxford: Oxford Centre for Staff and Learning Development.","cites":null},{"id":197968,"title":"A model for predicting and individual's use of a telematics application for a learning-related purpose',","authors":[],"date":"2000","doi":null,"raw":"Collis, B. and Pals, N. (2000), A model for predicting and individual's use of a telematics application for a learning-related purpose', International Journal of Educational Telecommunications, 6 (1), 63-103.","cites":null},{"id":197974,"title":"An Introduction to the Evaluation of Learning","authors":[],"date":"2000","doi":null,"raw":"Oliver, M. (2000), An Introduction to the Evaluation of Learning Technology, Educational Technology and Society, 3 (4), http:\/\/ifets.ieee.org\/periodical\/vol_4_2000\/intro.html.","cites":null},{"id":197969,"title":"Constructive alignment to improve the quality of learning in higher education',","authors":[],"date":"2000","doi":null,"raw":"Entwistle N. (2000), 'Constructive alignment to improve the quality of learning in higher education', Paper presented at the Dutch Educational Research Conference, University of Leiden, 24 May 2000.","cites":null},{"id":197972,"title":"Qualitative Data Analysis: An Expanded Source Book,","authors":[],"date":"1994","doi":"10.1177\/002076409704300109","raw":"Miles, M. B. and Huberman A. M. (1994), Qualitative Data Analysis: An Expanded Source Book, London: Sage.","cites":null},{"id":197973,"title":"Some reflections on the application of activity theory',","authors":[],"date":"1996","doi":null,"raw":"Nardi, B. A. (1996b), 'Some reflections on the application of activity theory', in B. A. Nardi (ed.), Context and Consciousness: Activity Theory and Human-Computer Interaction, Cambridge, MA: MIT Press, 235-46.","cites":null},{"id":197967,"title":"Students' Reactions to Undergraduate Science,","authors":[],"date":"1977","doi":"10.1119\/1.11542","raw":"Bliss, J. and Ogborn, J. (1977), Students' Reactions to Undergraduate Science, London: Heinemann.","cites":null},{"id":197971,"title":"The Discovery of Grounded Theory: Strategies for Qualitative Research, London: Weidenfeld and Nicholson.","authors":[],"date":"1967","doi":"10.1097\/00006199-196807000-00014","raw":"Glaser, B. G. and Strauss A. L. (1967), The Discovery of Grounded Theory: Strategies for Qualitative Research, London: Weidenfeld and Nicholson.","cites":null},{"id":197970,"title":"Theoretical Sensitivity,","authors":[],"date":"1978","doi":null,"raw":"Glaser, B. G. (1978), Theoretical Sensitivity, Mill Valley, CA: Sociology Press.","cites":null},{"id":197975,"title":"Using Shared Workspaces","authors":[],"date":"2000","doi":"10.1080\/13558000110097073","raw":"Sikkel, K., Gommer, L. and van der Veen, J. (2000), Using Shared Workspaces in Higher Education, DOC 00-30 DINKEL, Institute University of Entchede, Netherlands.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"This paper presents the first phase of a qualitative study of students’ use of a Learning Management System (LMS). A group of students at Kingston University with experience of two different systems were afforded the opportunity to study the relationship between the interface to an LMS and the usability of the system","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14224.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/381\/1\/ALT_J_Vol10_No2_2002_Grounded%20Theory%20as%20an%20approach.pdf","pdfHashValue":"e3cd31e5b6885b8f27652cf1ccdb6cf74b760e90","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:381<\/identifier><datestamp>\n      2011-04-04T09:11:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/381\/<\/dc:relation><dc:title>\n        Grounded Theory as an approach to studying students’ uses of learning management systems<\/dc:title><dc:creator>\n        Alsop, Graham<\/dc:creator><dc:creator>\n        Tompsett, Chris<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper presents the first phase of a qualitative study of students’ use of a Learning Management System (LMS). A group of students at Kingston University with experience of two different systems were afforded the opportunity to study the relationship between the interface to an LMS and the usability of the system.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/381\/1\/ALT_J_Vol10_No2_2002_Grounded%20Theory%20as%20an%20approach.pdf<\/dc:identifier><dc:identifier>\n          Alsop, Graham and Tompsett, Chris  (2002) Grounded Theory as an approach to studying students’ uses of learning management systems.  Association for Learning Technology Journal, 10 (2).  pp. 63-76.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100207<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/381\/","10.1080\/0968776020100207"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Grounded Theory as an approach to studying\nstudents' uses of learning management systems\nGraham Alsop and Chris Tompsett\nLearning Technology Research Group, Kingston University\nemail: g.alsop@kingston.ac.uk, c.p.tompsett@kingston.ac.uk\nThis paper presents the first phase of a qualitative study of students' use of a Learning\nManagement System (LMS). A group of students at Kingston University with\nexperience of two different systems were afforded the opportunity to study the\nrelationship between the interface to an LMS and the usability of the system.\nA 'Grounded Theory' methodology (Glaser and Strauss, 1967) was selected to model the\nstudents' framework, as independently as possible from the views of other stakeholders in\nthe LMS. The approach still offered the potential for generalization despite working with\na small group of students. In Grounded Theory, data collection and theory-building drive\neach other reciprocally until a stable 'theory' is reached.\nIn an ideal world this research would be reported at the end of the whole process but it is\nconsidered that there is more value in producing less definitive results at this stage rather\nthan a complete theory in one year's time (Oliver, 2000). Even at this stage of the research,\nit is clear that the students' conception of an LMS is categorically different from that held\nby the other stakeholders responsible for implementing the system. Identification of these\ndifferences and integration of some findings into future developments are critical even if, in\nthe view of the researchers, further development of the 'theory' is required\nThe findings from this phase validate the use of a grounded approach. They suggest that\nsystemic issues regarding the integration of educational activities with other aspects of\neveryday life are fundamentally more important than issues in interface design. The\nstudents make effective use of remote access facilities but only where this offers a clear\ncomparison with activities that already form part of studying at university. Such\ncomparisons are pragmatic and are seldom defined in terms of 'educational' benefit.\nIntroduction\nThe study was designed to examine issues relevant to planning the full-scale implementa-\ntion of the Learning Management System (LMS) across the university. Two aspects of\n63\nGraham Alsop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nusability were of particular interest: whether the system could be improved through\nchanges in the design of the interface and whether a student's ability to use an LMS\nsuccessfully was determined by technical abilities developed either at, or before, university.\nStudents from two courses had experience of using both WebCT and Blackboard. A study\nusing these two groups offered the opportunity to investigate how differences in the\ninterface had affected the usability of the system for students with a relatively high degree\nof technical competence.\nAn LMS offers different benefits to the various stakeholders in the system. For manage-\nment an LMS can provide operational benefits, such as integration with other management\nsystems (student records and finance, etc.) as well as strategic opportunities, for example to\nincrease student numbers by decreasing the time spent by each student within the\nuniversity. Such benefits do not necessarily offer educational advantage to the students.\nFor a student an LMS would appear to offer few technical advantages beyond those that\nare available free through other Internet providers offering support for more generic on-\nline communities. Both WebCT and Blackboard provided similar functions as learning\nenvironments accessed through a Web portal. Each offered links to a number of integrated\nfunctions supporting document management, both synchronous and asynchronous\ncommunication, and integration with email services. Any educational advantages were\nessentially mediated by the design of the interface.\nThe arrangement and labelling of icons and links to the various facilities controls the\nstudents' expectations of what activities they could be engaged in. If the learning\nmanagement systems were substantially the same, then differences would only be realized if\nthe students could anticipate the benefits that might be available and could successfully\nnavigate to those different services. Simple differences in the usability of the interface could\nprovide significant educational gains. The researchers' own experiences with Blackboard\nsuggested that there was considerable potential for redesign.\nThis research focused on students studying Geographical Information Systems (GIS) in\ntheir final year of two courses, either for a B.Sc. or an HND. These students had all used\nBlackboard during 2001 and WebCT during 1999-2000. WebCT and Blackboard were both\noffered with the normal suite of services from within the university. Only Blackboard was\nmade available through remote access (with password protection). Although the students\nwere supported by an LMS at each stage, the courses were still structured as conventional\nundergraduate courses with attendance required for lectures and other workshop activities.\nMethodology\nThe researchers were aware that their perception of what was critical in the design of an\nLMS might not be seen as important by the students. The selection of a methodology that\nwas relatively immune to the expectations of the researchers was critical.\nSelection\nThe first stage in the research was the selection of a methodology appropriate to the\noutcomes that were required and the constraints of the particular study. The most critical\nrequirement was the importance of capturing the students' own perceptions and\nunderstanding of the systems that they were using.\n64\nALT-J Volume 10 Number 2\nMany research methodologies expect the research to be conducted within an objective,\nconceptual model that is framed by others external to the subject group. Several\nstakeholders, other than the students, have an interest in the performance of the LMS:\nuniversity managers, system designers, system implementers, course lecturers and, of\ncourse, ourselves as researchers. Research that is based on an external framework may well\nprovide evidence that a system is not working - but will seldom provide answers as to why\nor how the system fails to work. This requirement implied that a qualitative approach,\ngrounded in the students' own conceptual frameworks, would be essential.\nThe second requirement was that the methodology had to support the potential of\nbuilding a theory about what was being studied. This would enable the results of the\nresearch to inform the next stage of the development in the use of the LMS. This\nrequirement would exclude any methodologies, such as ethnography, which did not\nconform to this.\nA third class of methodologies was excluded by the constraints of the study. Some\nqualitative approaches use an initial subject-centred qualitative phase as grounds to\ngenerate relevant questions for a larger statistical analysis. The timing of the research in\ntwo phases would not produce any results over the time-scale available as all the students\nwith experience of both systems would have left by the end of the year and the group\nwould not have been large enough for a statistical analysis.\nOur principle interest lay in providing a rich description of the range and variety of\nstudent perceptions and the factors that could be altered to produce different behaviours.\nThe overall research model selected was Grounded Theory (Glaser and Strauss, 1967;\nGlaser 1978; Strauss and Corbin, 1990; Miles and Huberman, 1994). A more detailed\ndiscussion of this selection process is provided elsewhere (Alsop and Tompsett, 2002).\nGrounded Theory\nThe Grounded Theory method requires that the full research process is grounded in the\ndata that is collected. As with most qualitative methods it accepts that the researcher\ncannot remain external to the collection and interpretation of data but is inherently bound\nup in the process of research. The process of collection and interpretation is cyclical, with\nlow-level analysis of data providing grounds for simple levels of interpretation, which then\nprovide the basis for reinterpretation of existing data and collection of additional data. It\nis an iterative process that focuses on the subject's perspective but also accepts that the\nresearchers cannot approach the subject without bias or personal viewpoints. The\nimplication that the results will be dependent on the researcher's implicit involvement is\nmanaged through careful recording of the process of interpretation, where the researcher's\ninitial interests, subsequent comments and possible interpretations are treated not just as\ninformation external to the analysis, but are recorded as data within the project itself. The\npossibility that different researchers might not agree on results is as a logical consequence\nof a constructivist epistemology. The rigour of any resulting 'theory' is established by the\nability of other researchers to audit the stepwise sequence of interpretation, whilst\nrecognizing that individual bias and interpretation would not necessarily be the same. The\ndegree to which the researchers share (or should share) the same values and frameworks\nwill determine the extent to which different researchers would accept the same conclusions.\n65\nGraham Alsop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nThe development of a theory is cyclical too, using existing data to build a theory and using\nthe developing theory to guide data collection, increasing the depth of interpretation and\nthe coverage of the theory across subjects. The first stage is to generate a catalogue of the\nterms and concepts used by the subjects (termed 'open coding')- This catalogue is then\nused to generate an 'axial model' (Strauss and Corbin, 1990: 96), a time-sequenced\nframework that establishes the interrelationships between the concepts within the open\ncoding. This develops the interpretation of the subjects' perception of the problems that\nwere being solved, for example the conditions controlling what was possible, the choices\nthat were open to them and their assessment of what was successful and what was not.\nWhen this appears to be effective in structuring the data collected this model is then\nsummarized by the identification of a single bounding concept, termed the 'core category'.\nThis core category encompasses the framework within which all of the subjects'\nperceptions can be included. In reality there is a constant cycle between the last two stages;\nthe intention is to develop a theory for which the core category provides a summary that\nallows all the data to be interpreted within the axial model and hence the core category.\nThe axial model and core category are validated as a theory through a recursive process\ntermed 'theoretical sampling'. In this phase concepts and issues that are already relevant in\nthe current axial model are used to search for new cases to be integrated. The new data that\nis collected may well introduce new concepts or variables that enrich the open coding stage,\nprovide changes and complexity to the axial model or even require a reconsideration of the\ncore category. When this process stops, a process of uncertain length, the research is\nconsidered to be complete and the model is said to have reached 'theoretical saturation'.\nThe outline of the process suggests that existing literature in the field is ignored but this\nwould be illogical if the theory is, itself, to have predictive value. Concepts and models\nfrom literature are treated here as frameworks that have been created by other stakeholders\noutside the immediate focus of the research. There is no direct implication that they should\napply to the conceptual framework used by subjects. Existing literature is treated as a\nfurther source of material to be used in developing theoretical saturation. Awareness of\npossible frameworks from the literature, termed 'theoretical sensitivity', allows possible\nissues to suggest areas for data collection, as long as there is sufficient evidence from what\nhas been collected already.\nThe first phase\nThis paper covers the first stages of the analysis: the open coding, early axial coding and\nconsiderations for the core category. Whilst the research process is not complete, the\nconvergence of the cyclical method to a stable theory offers the opportunity to comment\non aspects of the developing theory at a stage at which those aspects become sufficiently\nwell defined to be of significance.\nIn this case the requirement to establish a definitive theory must be balanced against the\npotential utility of that information to stakeholders. Even at this stage of the research, it is\nclear that the students' conceptions of an LMS are categorically different from those held\nby the other stakeholders in the system. A delay in publication to develop and refine a\n'theory' will have little value if decision-makers proceed to implement large-scale systems\nunaware that their expectations of how students will use the system is far from reality.\n66\nALT-} Volume 10 Number 2\nData collection\nThe particular method for generating data was derived from an earlier qualitative study\n(Bliss and Ogborn, 1977) that used semi-structured interviews to collect and analyse the\nexperiences of first-year physics undergraduates.\nEach session was carried out during time allocated to a normal lecture or workshop. An\nintroduction was given to the purpose of the research and why the students had been\nchosen. The method was described as a technique for collecting their approaches to using\nthe LMS that was designed to avoid interference from the views of other stakeholders in\nthe university's system. Students were given details of the process by which their\ncontributions would remain anonymous and were allowed the option of withdrawing from\nthe process. Students were then asked to write an account, with as much detail as they\ncould remember, of the occasion on which the use of one particular LMS had been 'the\nmost rewarding educational experience'. As they completed their own individual account\nthey were asked to summarize this account with a single word or short phrase.\nAs four or five students finished they were formed into a group and completed the first\nphase by reviewing, without discussion, the accounts of the other students in the group,\nsummarizing each in turn. They then discussed the accounts between themselves to agree\non a common word or phrase to summarize the set of accounts within the group. This is\nless constrained than a semi-structured interview, but earlier experiments with a similar\ntopic by one of the researchers has demonstrated that it can produce remarkable\nconsistency between individuals and groups. Each of the groups then repeated the cycle\nwith a different starter question - the occasion on which the use of one particular LMS\nhad been 'the worst educational experience'. In general the method worked as anticipated,\nthough not all students confined themselves to single examples.\nIf time allowed, students were then asked to contribute in two further ways to building the\nmodel. The first asked for a specific comparison of the different interfaces. The second\nasked them to identify any issues to which they or their group had failed to refer but which\nmight indicate key issues that should be included in the model within the data collection\nprocess.\nThis open structure to the collection of qualitative data was designed to elicit responses\nthat would be framed within language understood by other students. Descriptions written\ndirectly for us could be filtered or adapted to make them appropriate for lecturers.\nRequesting a narrative account supported a simpler transfer to an axial model. The request\nfor individual summaries checks that the accounts make sense to the students and, with a\ncollective discussion, provides a starting point for developing a core category rooted in the\nsubjects' perceptions. The intention was for students to produce an account that was\nacceptable or understandable by the student community.\nThe data collection process was supplemented with field notes from the researchers\nthroughout the process. It is not possible to collect data and interpret it in separate phases,\nas interpretation of what is collected cannot be 'turned off': for example the comment 'not\nexclusively about the technology' was recorded after the first session of data collection even\nbefore transcription began. Contemporaneous notes on ideas that occur provide a\nmechanism for identifying these interpretations and, by recognizing the source, of tracking\nand auditing the influence of individual bias on the research. Notes are also kept on any\n_\nGraham Alsop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nextraneous issues affecting data collection. In the first session, for example, it was noted\nthat the offer of tea and coffee to students appeared to remove tension.\nThe discussion below focuses on the language used by the students in these accounts. Issues\nof 'theoretical sensitivity' were excluded at this stage.\nOpen coding\nThe analysis of the full sample collected so far (49 accounts) was conducted using the\nsoftware package Nudist 4. This provided effective facilities for tracking the progressive\nsearching and coding of accounts, the sorting and resorting of coding groups along with\nthe parallel recording of coding notes. Some of the students followed closely the request to\ndescribe a single event with some detail whilst others provided wider but shallower\naccounts. A typical account (transcribed with minor changes for legibility but with original\nspellings and expressions recorded) is presented in Figure 1.\nWhen using blackboard, groups can be set up so you can communicate with people in group work. This\ninvolves talking to the people directly using chat or emailing them, but also being able to exchange files.This\nis very useful especially as people work in different places and times to others. It also enables people to\ncommunicate easily without having to find the ID numbers. It also means people can continue to develop\nwork without actually having to meet up to exchange files, which is very useful for people who don't need\nto come into the building.\nPersonal summary: communication with others\nSummaries of this account by other members of group:\ncommunication facilities, easy communication, communication tool\nGroup summary (combining all four accounts): communication\nFigure I: A typical student account\nPerhaps the best experience of blackboard I have had is that I can get my lecture notes \/course materials\nfrom home (internet) which has been useful when I have not managed to get a print-out of the materials\nwhen in university.\nThis remote access proved useful when I needed some lecture notes to do a piece of work and I was able\nto get hold of, and print the course materials out at home thus meaning I didn't have to go into university\nto do it\nPersonal Summary: Access from home\nSummaries of this account by other members of group: Remote access of notes, copy and print the notes,\nlecture notes\nGroup summary (combining all four accounts): communication\nFigure 2: A further example of a student account\n68\nALT-J Volume 10 Number 2\nThe consistency within the summaries of the account in Figure 1 was repeated in almost all\ncases and gave a clear indication that the individual accounts were well understood within\nthe student community (see Figure 2 for an additional example). The consistency of\nlanguage and terminology used by the students in their individual accounts also provided a\nstrong indication that the particular model of data collection was working effectively.\nEven the simplest reading of the accounts reveals a terminology and language focused on\nbeing able to (or alternatively failing to) access resources in a remote-access mode when the\nstudents needed to or preferred to. One researcher specifically notes at this stage: 'stories\nseem to be about flexibility and choice - students are working in semi-distance mode.'\nWithin this common theme, the different resources available seem equally significant (for\nexample, lecture notes, assignment details, etc.), and the 'reasons' for access were varied.\nCoding and notes\nInterpretation (and recording of notes) inevitably occurs as soon as a researcher has access\nto the data (as with the comment above). Open coding progresses from that point through\na structured approach, interleaving analysis and coding of the data collected with\nrecording of notes and commentary.\nInterpretative comments were attributed to a specific point in the analysis and elaborated\nusing explicit terminology from the cases (for example, 'several students use \"choice\"\nwords - need, have to, useful, unable, wasting, access (choice), repair (missing lectures)').\nThis generated, in turn, a further analysis of the cases - for example a search through all\nthe cases for examples where that specific terminology is used and extending the\nclassification to a wider set of cases than those that triggered the initial comment. It was\nthen possible to re-examine these cases in more detail, or juxtapose the new coding with a\nprevious classification - or to review the cases where 'choice' did not seem to play a role.\nAbsence of specific language, where the researcher's personal expectation was not met in\nreviewing text, was also considered a valid starting point for search, such as, 'No student\nmentions learning specifically - why?' In such cases searches with no results were also\nrecorded (as with: 'August 1st 2001 searched for \"learning\" nothing found; August 15th\n2001 searched for \"learn*\" nothing found').\nAt this stage the study was most remarkable for the absence of significant categories of\nlanguage. Little comment or reference was made on specific issues that were assumed to be\nimportant in the original design, either interface issues or the relevance of technical skills.\nRemote access, the result of a policy decision at Kingston University, overrode any other\nconsideration of implementation or design.\nWhat the data did not say\nAs the students' accounts failed to produce anticipated commentary on either aspect of\nusability, careful consideration was given to whether this resulted from the design itself. As\ncommented above, the positive and negative accounts (described in what follows as 'open'\naccounts), omitted almost all terms or issues relating directly to human-computer interface\ndesign; only one, triggered by the 'worst experience' question, could be interpreted as a\nlack of closure (commenting on a lack of confirmation after an assignment was delivered\nelectronically through Blackboard). The extent to which this could be a consequence of the\nquestions that were asked was a consideration but was rejected after analysis of some of\n69\nGraham A\/sof> and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nthe additional comments that were requested. When asked for comments comparing the\ntwo systems, some of the students readily demonstrated an understanding of human-\ncomputer interface issues (see Figure 3).\nBlackboard is much better than WebCT, it has the modules separate in Buttons, calendar to show the\nsubmission date for the assignments\nor\nBb [Blackboard] better than webct - visually a mess - Bb very ordered\nFigure 3: Examples of students' comments addressing human<omputer interface issues\nClearly students are aware of the impact of an interface and can express preferences. There\nis, of course, indirect evidence from their accounts that they did use the interfaces\nsuccessfully.\nThe disregard of specific interface issues within the open accounts provides strong\nevidence that changes in interface design are of low priority for the students at this stage in\nthe use of the LMS. Arguing that the research process has failed to capture the relevance of\nthe interface would be to devalue what the students choose to report - apparently\ndevaluing a comment if it is not within a researcher's chosen category.\nThe second aspect of usability, understanding the relationship between the students'\ntechnical abilities and their use of an LMS, was also only reflected to a minor extent in the\naccounts and is not yet sufficient to feature in our models. The justification for this\nposition follows the same structure as before but is too detailed to present in this paper\nThe discussion of these two specific issues does not imply that technical ability and\ninterface design do not have an influence on the usability of the system - such a view would\nclearly contradict evidence from the general field of HCI design. What is called into\nquestion is the relative significance of these issues, from the students' point of view.\nThe open coding reveals a significant divergence in the issues and language used by the\nstudents, compared with the language anticipated in the original design of the research\n(usability) or the researchers' own personal interests in the potential of technology to\nimprove the learning process. The openness of the research process to capturing students'\nviews has redefined the focus of this research to what appears critical to the students, the\ndecision process by which they choose to exploit the facilities offered by an LMS.\nTo view this as a weakness in the research design would be to ignore what is fundamental\nto the principles of Grounded Theory methodology. The immunity of the data collection\nprocess to the expectations of the researchers is valuable evidence of a well 'grounded'\nstudy..\nThis divergence allows the range of subjects available to the study to be increased and\nstudied over a longer period of time, but does not imply a change in methodology. Indeed,\nthe effectiveness of a fully 'grounded' approach to capture the views of users of an LMS\nseems clearly established.\n70\nALT-J Volume 10 Number 2\nAxial model\nA storyline is constructed to provide an account of how the individual in each case\nperceives the problems that they encounter. This includes the causal conditions that led to\nthe problem, the particular context of each problem, the intervening events and behaviours\nthat provide a dynamic sense to the case, the strategies applied by the individuals them-\nselves and the eventual outcomes (Strauss and Corbin, 1990: 61-2).\nOne possible formulation of the account from Figure 1, represented here without a strict\ntypology of concepts for simplicity, could be as in Figure 4.\nFigure 4: A formulation of the account in Figure I\nWith further analysis of similar accounts a model is developed that provides more subtlety\nto the analysis and an understanding of the consequences that result when options fail.\nFigure 5, for example, includes an assessment to consider the possibility that a virtual\nmeeting is not sufficient.\nEven without a more rigorous approach there are evident gaps in the network that need to\nbe explored (theoretical sampling). What, for example, determines the choice of mode for a\nvirtual meeting? Or what could be the consequence, to match with 'avoid coming into\nuniversity', when a real meeting cannot be organized?\nCompleting an axial model to integrate all student accounts in the same, single model is the\nkey step in 'understanding' the students' behaviour. There will be contexts in which\nstudents have little opportunity to make decisions that affect the consequences for\nthemselves. Equally there will be contexts and circumstances when students can make\nchoices that they anticipate will produce greater benefits in their own terms.\nUnderstanding the relationships between these circumstances, actions and benefits helps us\nto understand why students perceive some patterns of behaviour as the rational pattern to\nchoose. Understanding these relationships can, ideally, allow the university to make\n_\nGraham Alsop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nFigure 5: A formulation of the account incorporating an assessment of sufficiency\nchanges to the context or circumstances in which the students find themselves, so that they\nchange their decision.\nCore category\nA core category should provide an overriding conceptual framework within which the\ndecisions taken in each case can appear rational to the individuals (Strauss and Corbin,\n1990:116).\nThe terms that were identified by students as summaries in the positive accounts were\nintended to provide a catalogue of concepts that could be considered as the candidate\nphenomena for a core category, with reinforcing evidence taken from the summaries of the\nnegative accounts. This has not directly applied to the accounts that have been collected.\nWithin the positive accounts the concept of 'accessibility' (including variations such as\nworking from home or remote access) was most consistently used and almost all the\nnegative accounts reflected failures of the system to support this. The summary terms used\nby the students appear to be chosen in terms of their instrumental value, identifying the\nsignificant change in circumstances that has most influence on outcome (as also with\n'communication' in the example used above).\nRemote access did not confer direct benefits to the students. It was the way in which that\naccess is exploited that was of benefit. This suggested that the summaries should primarily\nbe treated as intervening conditions rather than as possible core categories. Where the\nsystem works as students expect, the benefits cover a wide range of issues: avoiding\n72\nALT-} Volume 10 Number 2\njourneys into university (as in the example), the direct saving of time, starting academic\nwork sooner, catching up on study when behind, being aware of new and relevant\ninformation, etc. It was these stated benefits that became potential core categories.\nThe benefits themselves, as taken from the accounts of the students, were too varied to\nprovide a single 'core phenomenon' and generally could not be expected to show such\nconsistency. A stated benefit, such as 'avoiding travel to the university', could be stated in a\nmore general or specific form or be seen to have direct consequences that occur in other\naccounts, such as 'saving time' or 'having more time to work'.\nThe development of an axial model and core category is not yet complete. It is clear that\nthe relationships between the benefits can be constructed into a limited set of possible\nlattice structures which closely limit the range of what could act as a core category (see\nFigure 6, for example). Strauss and Corbin (1990) suggest that it is more effective to\nproduce alternative models where the balance between more than one type of benefit\noccurs, but this does not appear to be the case in this study. Please note that some of the\nconnections may not be obvious - this is a representation of the students' perceptions and\nnot our own interpretation.\nintegrating\nstudy with life J\nchoosing\n• where to work\n| avoiding i\nunproductive I\nI meetings J\nFigure 6: A possible lattice structure\ncatching up 1\n73\nGraham Alsop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nAs would be predicted from the minimal impact of usability in open coding, the network\nabove makes little reference to either technical skills or to aspects of interface design. The\nactions and approaches to comparing alternative solutions are functional in terms of life\nmanagement and ignore educational issues of effectiveness, learning style, etc. Even where\neducational terms are used (such as revision, catching up) the benefits are realized in more\nfunctional life-style gains.\nAn initial reaction to the students' use (or non-use) of the LMS might be to suggest that\nstudents are merely using it as a passive filing or messaging system, but this would fail to\nreflect that the students are actively engaged in using (or attempting to use) the different\nsystems to manage their learning. Remote access, rather than on-campus access, provides\nthem with a choice of how and where they can study.\nIt is interesting to note from this analysis that these students have provided a more critical\nassessment than most students who work within a full distance-learning framework. These\nstudents choose to meet their objectives by working remotely, by following a traditional\nmodel of full attendance at the university, or by managing a combination of both. From\nthe evidence in the accounts there is no simple solution; costs, benefits and reliability, rated\nin a number of different ways, have to be weighed against each other.\nContinuing research\nThis study is now continuing within the revised focus identified by the students. With the\ncontinuing promotion of the LMS across the university, the range of courses to be\nincluded covers six faculties with some cohorts of more than 400. Changes in the LMS\nsoftware and its use by staff should not invalidate the existing findings - it should provide\naccess to actual cases rather than hypothetical cases in the progress towards theoretical\nsaturation.\nThe overall consistency in the accounts that have been collected will now support\nconsideration of 'theoretical sensitivity' to provide additional direction to this phase of the\nstudy. Two aspects will need to be considered in introducing existing research, the issues\nthat are considered and the findings themselves.\nIssues that are of potential interest can be identified across a range of studies. Bacsich,\nAsh, Boniwell, Kaplan, Mardell and Caven-Atack (1999) identify the same financial issues\nbut suggest (p. 47) that students are not aware of the savings. Our study suggests that\nstudents are actively balancing the finance and time in how they choose to study. The 4E\nmodel (Collis and Pals, 2000; Sikkel, Gommer and van der Veen, 2000) also provides a\nuseful summary of issues. Although the model includes four 'dimensions', the resulting\nmeasures are not at the same level of granularity as used by students in the current study.\nThe lack of similarity in findings, as opposed to issues, is unsurprising in view of the nature\nof the research. Both survey techniques and mathematical modelling will cover the same\naspects of a problem but produce results on a different scale that are relevant to other\nstakeholders but not to individual students.\nMore challenging research comes, naturally, from Activity Theory (AT) (Nardi, 1996a),\nsince the epistemological model is consistent, even if Grounded Theory is considered by\nthose in AT to lack 'underlying principles' (Nardi, 1996b: 236). There are clear parallels\n74\nALT-J Volume 10 Number 2\nbetween the fundamental concepts of AT and the structure of an axial model. The\ndifference arises, of course, in whether accounts of the students must fit with AT, or\nwhether they actually do. Assuming that the accounts must fit appears to tackle the\nunderlying principle of Grounded Theory. If the model from AT fits, we may unwittingly\nhave provided an investigative model (at this stage at least) for researchers who start with\nAT as an underlying first principle.\nThe role for AT, perhaps more specifically as functional pragmatics (Tetscher, Meyer, Wodack\nand Vetter, 2000), will be to provide clarity to the potential meanings of goals, aims and\nactions where the narrative accounts appear unclear and where further discussion with the\nsubjects is not possible. In this context there are other theoretical approaches for text analysis\nthat claim equivalent respectability, even if from different principles. Tetscher et al. (pp.\n227-36) provide a useful summary with particular attention paid to underlying principles.\nConclusions\nThe research from this study is published at this early stage for three reasons that are as\nrelevant, or more relevant, at this stage as they will be at the end of the process.\nFirstly, a research process that set out to be grounded in the perceptions of the student\ncommunity has demonstrated, by confounding any expectations of the researchers, that it\nis able to achieve that objective.\nSecondly, a grounded approach has revealed that the underlying decision process used by\nstudents to determine how they use an LMS is considerably more complex than reported in\npositivist accounts. The categories used, and level of granularity with which students\nconsider them, are not those that arise within the design of most educational technology.\nStudents make case-by-case decisions whether to replace existing university-based\nactivities with equivalent activities based off-campus. If an LMS is to support change in\nstudent behaviour, the models used by designers must change. Such models must include\nan operational model of how students currently evaluate their choices in learning at\nuniversity. It must also ensure that the educational benefits that are anticipated translate\ninto benefits that can be recognized by the students.\nThirdly, decisions that extend the use of an LMS in further and higher education are being\ntaken daily, in a process that appears unstoppable. It is critical that we understand the\nimpact that these changes will have on students' learning before the possibility of revoking\nany decision is overridden by the scale over which the change would need to take place.\nThis argument appears similar to Patton's utilization-focused evaluation (Oliver, 2000) but\nthere is a potential conflict between the design of this research and the values of the\nstakeholders who take the decision. Will those who promote the use of an LMS be\nprepared to accept research that suggests that their models are not valid? We hope so!\nEntwistle provides a detailed analysis of some approaches to designing courses to\n'encourage student learning directed towards personal understanding' (Entwistle, 2000:1).\nThe models and constructs that he reviews are significantly different from those that are\nused by these students. If we are to include both sets of models into the design of online\ncourses then we have much to learn about how students achieve this. The answers on this\naspect, however, must depend on the further stages in the research.\n75\nGraham A\/sop and Chris Tompsett Grounded Theory for studying students' uses of learning management systems\nReferences\nAlsop, G. and Tompsett, C. P. (2002), 'A Grounded Theory investigation of students'\nperceptions of learning management systems', in Proceedings of the 9th Improving Student\nLearning Symposium, 2001, Oxford: Oxford Centre for Staff and Learning Development.\nBacsich, P., Ash, C, Boniwell, K., Kaplan, L., Mardell, J. and Caven-Atack, A. (1999), The\nCosts of Networked Learning, Sheffield Hallam University, School of Computing and\nManagement Sciences, http:\/\/www.shu.ac.uk\/cnl\/report1.html.\nBlackboard Inc. (2001), http:\/\/company.blackboard.com. Site last updated 4 January 2001.\nBliss, J. and Ogborn, J. (1977), Students' Reactions to Undergraduate Science, London:\nHeinemann.\nCollis, B. and Pals, N. (2000), A model for predicting and individual's use of a telematics\napplication for a learning-related purpose', International Journal of Educational\nTelecommunications, 6 (1), 63-103.\nEntwistle N. (2000), 'Constructive alignment to improve the quality of learning in higher\neducation', Paper presented at the Dutch Educational Research Conference, University of\nLeiden, 24 May 2000.\nGlaser, B. G. (1978), Theoretical Sensitivity, Mill Valley, CA: Sociology Press.\nGlaser, B. G. and Strauss A. L. (1967), The Discovery of Grounded Theory: Strategies for\nQualitative Research, London: Weidenfeld and Nicholson.\nMiles, M. B. and Huberman A. M. (1994), Qualitative Data Analysis: An Expanded Source\nBook, London: Sage.\nNardi, B. A. (ed.) (1996a), Context and Consciousness: Activity Theory and Human-\nComputer Interaction, Cambridge, MA: MIT Press.\nNardi, B. A. (1996b), 'Some reflections on the application of activity theory', in B. A.\nNardi (ed.), Context and Consciousness: Activity Theory and Human-Computer Interaction,\nCambridge, MA: MIT Press, 235-46.\nOliver, M. (2000), An Introduction to the Evaluation of Learning Technology, Educational\nTechnology and Society, 3 (4), http:\/\/ifets.ieee.org\/periodical\/vol_4_2000\/intro.html.\nSikkel, K., Gommer, L. and van der Veen, J. (2000), Using Shared Workspaces in Higher\nEducation, DOC 00-30 DINKEL, Institute University of Entchede, Netherlands.\nStrauss, A. L. and Corbin J. (1990), Basics of Qualitative Research: Grounded Theory\nProcedures and Techniques, London: Sage.\nTetscher, S., Meyer, M., Wodack, R. and Vetter, E. (2000), Methods of Text and Discourse\nAnalysis, London: Sage.\nWebCT, Inc. (2002), http:\/\/www.webct.com\/company.\n76\n"}