{"doi":"10.1103\/PhysRevB.65.125107","coreId":"66145","oai":"oai:dro.dur.ac.uk.OAI2:2898","identifiers":["oai:dro.dur.ac.uk.OAI2:2898","10.1103\/PhysRevB.65.125107"],"title":"Charge-density study of the nonlinear optical precursor DED-TCNQ at 20 K.","authors":["Cole, J. M.","Copley, R. C. B.","McIntyre, G. J.","Howard, J. A. K.","Szablewski, Marek","Cross, G. H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-03-13","abstract":"A charge-density study of the nonlinear-optical (NLO) precursor {4-[bis(diethylamino)-methylium] phenyl}dicyanomethanide (DED-TCNQ), space group P21\/c, a=11.174(2)Å; b=12.859(2)Å; c=12.486(2)Å; β=112.00(1)°, is presented. The results derive from a suitable combination of complementary 20 K x-ray and neutron diffraction data, the latter being important for locating the hydrogen atoms precisely. The compound is one in a series of TCNQ derivatives that exhibit varying degrees of quinoidal and zwitterionic character, these two electronic states being very close energetically. Bond-length-alternation type calculations show that the molecule at 20 K exists in a mixture of the two states, the zwitterionic ground state being dominant (63:37% zwitterionic: quinoidal). A topological analysis of the bonding density within the benzenoid ring provides for a more direct, alternative method to calculate this ratio which utilizes ellipticity values derived from the charge-density study. Results are identical thus corroborating the validity of the “strength-length” relationship implicitly assumed in bond-length-alternation type calculations. The ratio determined corresponds well to the electronic configuration needed to meet the requirements of the general rule for obtaining a maximum value of β (a measure of the NLO response on the molecular scale) as a function of bond-length alternation. The promise of this class of compounds for nonlinear optics also lies partly in their high molecular dipole moments and so the pseudoatomic charges derived from this study were used to evaluate the nature of the molecular charge transfer in detail and the solid-state dipolar vector moment μ. Such measurements of μ are otherwise difficult in the solid state. A value of |μ|=91×10-30Cm was deduced which compares with liquid and gas phase theoretical calculations of μ=66.71×10-30Cm and μ=33.36×10-30Cm, respectively. This comparison, combined with an analysis of the sense of this vector, show that local crystal-field effects are highly influential in the solid state","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66145.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2898\/1\/2898.pdf","pdfHashValue":"3856051a32476d2a626ad4e0bfe01ee0f1dd5c93","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2898<\/identifier><datestamp>\n      2015-04-27T12:14:19Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Charge-density study of the nonlinear optical precursor DED-TCNQ at 20 K.<\/dc:title><dc:creator>\n        Cole, J. M.<\/dc:creator><dc:creator>\n        Copley, R. C. B.<\/dc:creator><dc:creator>\n        McIntyre, G. J.<\/dc:creator><dc:creator>\n        Howard, J. A. K.<\/dc:creator><dc:creator>\n        Szablewski, Marek<\/dc:creator><dc:creator>\n        Cross, G. H.<\/dc:creator><dc:description>\n        A charge-density study of the nonlinear-optical (NLO) precursor {4-[bis(diethylamino)-methylium] phenyl}dicyanomethanide (DED-TCNQ), space group P21\/c, a=11.174(2)Å; b=12.859(2)Å; c=12.486(2)Å; β=112.00(1)°, is presented. The results derive from a suitable combination of complementary 20 K x-ray and neutron diffraction data, the latter being important for locating the hydrogen atoms precisely. The compound is one in a series of TCNQ derivatives that exhibit varying degrees of quinoidal and zwitterionic character, these two electronic states being very close energetically. Bond-length-alternation type calculations show that the molecule at 20 K exists in a mixture of the two states, the zwitterionic ground state being dominant (63:37% zwitterionic: quinoidal). A topological analysis of the bonding density within the benzenoid ring provides for a more direct, alternative method to calculate this ratio which utilizes ellipticity values derived from the charge-density study. Results are identical thus corroborating the validity of the “strength-length” relationship implicitly assumed in bond-length-alternation type calculations. The ratio determined corresponds well to the electronic configuration needed to meet the requirements of the general rule for obtaining a maximum value of β (a measure of the NLO response on the molecular scale) as a function of bond-length alternation. The promise of this class of compounds for nonlinear optics also lies partly in their high molecular dipole moments and so the pseudoatomic charges derived from this study were used to evaluate the nature of the molecular charge transfer in detail and the solid-state dipolar vector moment μ. Such measurements of μ are otherwise difficult in the solid state. A value of |μ|=91×10-30Cm was deduced which compares with liquid and gas phase theoretical calculations of μ=66.71×10-30Cm and μ=33.36×10-30Cm, respectively. This comparison, combined with an analysis of the sense of this vector, show that local crystal-field effects are highly influential in the solid state.<\/dc:description><dc:subject>\n        Bond-length alternation<\/dc:subject><dc:subject>\n         X-ray<\/dc:subject><dc:subject>\n         Diffraction data<\/dc:subject><dc:subject>\n         Hyperpolarizabilities<\/dc:subject><dc:subject>\n         Polarizabilities<\/dc:subject><dc:subject>\n         Molecule<\/dc:subject><dc:subject>\n         Systems.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review B, 2002, Vol.65(12), pp.125107 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-03-13<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2898<\/dc:identifier><dc:identifier>\n        issn:1098-0121<\/dc:identifier><dc:identifier>\n        issn: 1550-235X<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevB.65.125107<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2898\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevB.65.125107<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2898\/1\/2898.pdf<\/dc:identifier><dc:rights>\n        © 2002 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1098-0121"," 1550-235x","1098-0121","issn: 1550-235X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Bond-length alternation","X-ray","Diffraction data","Hyperpolarizabilities","Polarizabilities","Molecule","Systems."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n20 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCole, J. M. and Copley, R. C. B. and McIntyre, G. J. and Howard, J. A. K. and Szablewski, M. and Cross, G.\nH. (2002) ’Charge-density study of the nonlinear optical precursor DED-TCNQ at 20 K.’, Physical review B.,\n65 (12). p. 125107.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevB.65.125107\nPublisher’s copyright statement:\n2002 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nCharge-density study of the nonlinear optical precursor DED-TCNQ at 20 K\nJacqueline M. Cole*\nInstitut Laue Langevin, B.P. 156, 38042 Grenoble Cedex 9, France;\nDepartment of Chemistry, University of Durham, South Road, Durham DH1 3LE, United Kingdom;\nand Department of Chemistry, University of Cambridge, Lensfield Road, Cambridge CB2 1EW, United Kingdom\nRoyston C. B. Copley†\nDepartment of Chemistry, University of Durham, South Road, Durham DH1 3LE, United Kingdom\nGarry J. McIntyre\nInstitut Laue Langevin, B.P. 156, 38042 Grenoble Cedex 9, France\nJudith A. K. Howard\nDepartment of Chemistry, University of Durham, South Road, Durham DH1 3LE, United Kingdom\nMarek Szablewski and Graham H. Cross\nDepartment of Physics, University of Durham, South Road, Durham DH1 3LE, United Kingdom\n~Received 29 November 2000; revised manuscript received 24 May 2001; published 13 March 2002!\nA charge-density study of the nonlinear-optical ~NLO! precursor $4-@bis~diethylamino!-methylium#\nphenyl%dicyanomethanide ~DED-TCNQ!, space group P21 \/c , a511.174(2) Å; b512.859(2) Å; c\n512.486(2) Å; b5112.00(1)°, is presented. The results derive from a suitable combination of complemen-\ntary 20 K x-ray and neutron diffraction data, the latter being important for locating the hydrogen atoms\nprecisely. The compound is one in a series of TCNQ derivatives that exhibit varying degrees of quinoidal and\nzwitterionic character, these two electronic states being very close energetically. Bond-length-alternation type\ncalculations show that the molecule at 20 K exists in a mixture of the two states, the zwitterionic ground state\nbeing dominant ~63:37% zwitterionic: quinoidal!. A topological analysis of the bonding density within the\nbenzenoid ring provides for a more direct, alternative method to calculate this ratio which utilizes ellipticity\nvalues derived from the charge-density study. Results are identical thus corroborating the validity of the\n‘‘strength-length’’ relationship implicitly assumed in bond-length-alternation type calculations. The ratio de-\ntermined corresponds well to the electronic configuration needed to meet the requirements of the general rule\nfor obtaining a maximum value of b ~a measure of the NLO response on the molecular scale! as a function of\nbond-length alternation. The promise of this class of compounds for nonlinear optics also lies partly in their\nhigh molecular dipole moments and so the pseudoatomic charges derived from this study were used to evaluate\nthe nature of the molecular charge transfer in detail and the solid-state dipolar vector moment m. Such\nmeasurements of m are otherwise difficult in the solid state. A value of umu591310230 Cm was deduced\nwhich compares with liquid and gas phase theoretical calculations of m566.71310230 Cm and m533.36\n310230 Cm, respectively. This comparison, combined with an analysis of the sense of this vector, show that\nlocal crystal-field effects are highly influential in the solid state.\nDOI: 10.1103\/PhysRevB.65.125107 PACS number~s!: 61.10.2i, 61.12.2q, 42.65.2k\nI. INTRODUCTION\nHighly dipolar tetracyano-p-quinodimethane ~TCNQ! de-\nrivatives have shown considerable potential as second-order\nnonlinear-optical ~NLO! precursors on account of their desir-\nable structural attributes.1–5 On a molecular scale, high levels\nof charge-transfer and significant transition-state dipole mo-\nments are known to lead to good second-order NLO activity\nin organic materials. The well-known charge-transfer proper-\nties of TCNQ adducts, coupled with the fact that two ener-\ngetically close electronic configurations ~zwitterionic and\nquinoidal—see Fig. 1! constitute the overall ground-state of\nthese compounds, are the primary sources of their NLO be-\nhavior.\nThe relative balance between zwitterionic and quinoidal\ncharacter that exists in these materials is particularly impor-\ntant given bond-length-alternation ~BLA! considerations:\nBLA, defined as the average of the difference in length be-\ntween adjacent C-C bonds in a conjugated chain, has been\nshown to largely control the value of the molecular hyperpo-\nlarizability b, a measure of the second-order NLO effect on\nthe molecular scale.6,7 As a general rule, a small value of\nBLA, corresponding to a electronic configuration lying half-\nway between the fully delocalized state ~cyanine limit! and\neither the zwitterionic or quinoidal state, yields the largest b\ncoefficient and thus good NLO activity. Figure 1 illustrates\nthe general profile of this trend; such generality should be\nemphasized since the diagram is representative of an ideal-\nized conjugated chain8 and so a plot specific to the more\ncomplex molecules presented below the graph would natu-\nrally be more complicated than this simplified model.\nThe negative solvatochromatic behavior observed in\nPHYSICAL REVIEW B, VOLUME 65, 125107\n0163-1829\/2002\/65~12!\/125107~11!\/$20.00 ©2002 The American Physical Society65 125107-1\nmany of the TCNQ derivatives hitherto studied, including\nthe subject compound $4-@bis~diethylamino!-\nmethylium#phenyl%dicyanomethanide ~DED-TCNQ!,2 indi-\ncates that the electronic configuration of the subject com-\npound resembles more closely the zwitterionic form rather\nthan the quinoidal neutral state, i.e., the value of b lies on a\npoint on the right-hand-side of the graph in Fig. 1. A sub-\nstantial mix of the two states has been deduced from previ-\nous BLA-type studies.2 Thus, the compound possesses a low\nvalue of BLA, i.e., a b value close to the minimum point\n~maximum negative b! depicted in Fig. 1.\nThe highly dipolar nature of these species is also impor-\ntant for second-order NLO properties, since\nb}S mee2 ~mee2mgg!Ege2 D ~1!\nif we assume that a two-level model9–11 is valid, which is\nreasonable here given the closely planar nature of these com-\npounds. Suffixes e and g represent excited and ground states,\nrespectively.\nThe large values of m typically present in this class of\ncompounds usually force the molecules to pack centrosym-\nmetrically in a crystalline environment since the dipolar\ncharges oppose each other in close proximity. However, the\npresence of noncentrosymmetry is a prerequisite for the ob-\nservation of second-order NLO effects on the bulk scale,\nsince b and x (2) are third-rank tensors.12 Second-order NLO\nproperties are, therefore, not observed in such compounds in\nthe solid-state without the aid of an inert host matrix to suit-\nably align the molecules in a head-to-tail fashion such that\nthis crystalline symmetry restriction is overcome.\nAs a consequence, electric field-induced second harmonic\ngeneration ~EFISH! and hyper-Raleigh scattering ~HRS!\nmeasurements of such compounds in solution are utilized to\ndetermine the static hyperpolarizability b. EFISH measure-\nments have, however, proved problematic for this series of\ncompounds due to the finite optical absorption at 532 nm and\nthe problems of aggregation at the concentrations required\nfor this technique.13 On the other hand, HRS measurements\nhave proved successful and yield values of b~0! ~the zero\nfrequency value! of the order 3310228 esu ~Ref. 4!.\nAlthough the molecular structure of target compounds\nwhilst in an inert matrix or in solution can only be realized\nwith limited detail, single-crystal diffraction techniques can\nprovide a wealth of information regarding the molecular\nstructure, albeit within a crystalline framework. Moreover, a\ncomparison of the crystal state molecular polarization with\nfree-state or solution-state polarization, deduced from\ncomplementary theoretical studies is also important, since it\ncould provide a valuable insight into local-field effects that\nensue, these being of direct consequence on the macroscopic\nNLO response of a material since for second-harmonic gen-\neration\nx~2 !5N f I2v f Jv f Kv^b i jk& IJK , ~2!\nwhere N is the number of molecules per unit volume, f x are\nthe local field factors in the crystal frame IJK at the funda-\nmental and second harmonic frequencies, v and 2v, respec-\ntively, and ^b i jk& IJK is the expectation value of b i jk , i.e., the\nweighted sum of b in the molecular frame ijk over all orien-\ntations of a given molecule, with respect to the crystal\nframe.14,15\nA charge-density study on DED-TCNQ was conducted\nsince this methodology enables one to realize the most de-\ntailed and subtle structural features existing in the molecule\nthus allowing us to investigate the nature of BLA effects in\ndetail which is important since they directly affect b: see Fig.\n1. Such a study is not only superior to a conventional crys-\ntallographic refinement, that uses the independent atom\nmodel ~IAM! formalism, on account of the ability to model\nthe bonding density much better, but also, the IAM implicitly\nassumes no atomic charge. This renders such refinements\ninadequate for detailed bonding analysis particularly when\nhigh levels of polarization and thus charge-transfer effects\nprevail, as in nonlinear-optical compounds and their precur-\nsors. Furthermore, an additional advantage of incorporating\nsuch charges in the structural model of these materials is that\nan experimental value of the solid-state dipole moment can\nbe deduced. The evaluation of such a parameter in this phase\nis difficult by any other means and it is particularly important\nto deduce this value for NLO materials and precursors since\nb is highly dependent on m @see Eq. ~1!#. The fact that the\nsubject material is SHG active, while the molecules are in an\ninert matrix or in solution, makes this parameterization of m\nin the solid-state even more pertinent since its comparison\nwith calculated gas and liquid phase m values provides im-\nportant information for assessing the extent of local-field ef-\nfects. Such effects have a direct bearing on the relationship\nbetween molecular ~b! and macroscopic (x (2)) measures of\nFIG. 1. The general profile of the first hyperpolarizability coef-\nficient b as a function of BLA. Note that the plot represents a\ngeneric one but its derivation is based on known principles obtained\nfrom theoretical studies of the influence of BLA on b for a polyene\nsystem ~Ref. 8!. In such studies, b is defined as being negative\nwhere negative BLA is observed; however, this is simply a matter\nof definition as the measurable value of b can of course be only\npositive or null and thus the points I and II both represent local\nmaxima of b.\nJACQUELINE M. COLE et al. PHYSICAL REVIEW B 65 125107\n125107-2\nthe second-order NLO output @see Eq. ~2!#. The subject com-\npound DED-TCNQ was chosen since it represents one of the\nmost promising candidates for NLO application in the TCNQ\nseries studied thus far, on account of its low BLA value and\ndominating zwitterionic character.\nII. EXPERIMENTAL\nA. Synthesis\nDED-TCNQ was prepared by the reaction of TCNQ with\nN, N diethylamine in THF by methods analogous to those\ndescribed by Hertler and co-workers.16 Single-crystals were\ngrown from acetonitrile solution.\nB. Charge-density measurements\n1. Single-crystal x-ray diffraction\nA 0.2430.2430.14 mm crystal of DED-TCNQ was cen-\ntered on the Fddd cryodiffractometer at Durham, UK,17 a\ndevice equipped with a Mo rotating anode (l\n50.71073 Å), thus enabling data collection of weak or\nsmall samples and incorporating subliquid nitrogen tempera-\nture measurement capabilities via an Air Products 512 Dis-\nplex. The crystal was cooled at 0.75 K min21 to 150 K and\nthen at 0.14 K min21 to 20.0~1! K, the latter being the tem-\nperature of all intensity measurements. The very low tem-\nperature of data-collection is important for yielding the\nmaximum possible intensity of atomic scattering, (sin u\/l)max\nbeing of paramount concern in charge-density studies since\nthe high-angle ~weaker! data represent mostly the atomic\nscattering from the core electrons, thus making possible a\nmultipolar refinement of the structural data. It also enables\nthe largest number of reflections to be observed which is\nimportant since the multipolar refinement introduces a large\nnumber of parameters.\nThe cell parameters were obtained initially using 24 re-\nflections in the range 22.15°<2u<23.92° and refined sub-\nsequently using all low-angle ~,50°! data. Data were col-\nlected in bisecting mode using 2u\/v scans, the scan width\nbeing set from 1.3° in 2u below K-a1 to 1.6° in 2u above\nK-a2 , and a constant scan speed of 6° in 2u per minute was\nemployed. A sphere of data was collected out to 2u550° as\nwas a nearly complete hemispherical shell out to 2u595°.\nThis totaled 41 407 reflections over a period of one month.\nSeven standard reflections were measured every 193 reflec-\ntions except in the range 80–95° in 2u, where only five could\nbe reached due to the restricted angular range of the x circle.\nNo absorption correction was necessary due to the small size\nof the crystal and the small value of the absorption coeffi-\ncient.\nSeveral small areas of reciprocal space were contaminated\nby the presence of powder lines from the graphite pin used to\nmount the crystal. The corresponding data ~totalling 331 re-\nflections! were located using Crystal Logics software and a\nlocal program, and removed from the resulting data-set with-\nout adverse effect since redundancy was high and these data\nrepresent under 0.01% of the total reflections collected. The\ndata were reduced using a local program based on Lehmann\nand Larsen18 and the DREAM suite of programs.19 The result-\ning scaled and merged data yielded an R int of 0.0272. A\nsummary of crystal and data collection parameters is given in\nTable I.\n2. Single-crystal neutron diffraction\nA 1.031.031.0 mm crystal of DED-TCNQ was centered\non the four-circle diffractometer D9, at the Institut Laue\nLangevin ~ILL!, Grenoble, France. Indexing and subsequent\ndata collection was carried out at 20.0~1! K using Cu ~220!\nmonochromated neutron radiation @l50.8417(2) Å# . Half-\nwavelength contamination was removed with an erbium fil-\nter. The low temperature, employed to minimize possible\ndiminution of scattering due to thermal effects, was main-\ntained using an Air Products 512 displex. 3443 unique reflec-\ntions (1°,2u,70°) were measured according to a v-xu\nscanning procedure, with x chosen to keep the reflection in\nthe middle of the detector aperture and with a scan width\nDv, which was roughly twice the full width of the peak at\nbackground level. A standard reflection, measured every 50\nreflections, showed no variation in intensity. Data were re-\nduced using a local program20 and Lorentz corrections were\napplied. Absorption corrections were made by Gaussian\nintegration21 using the calculated attenuation coefficient m\n50.21 mm21 to give a transmission range 0.779–0.846. The\nmerged data yielded R int50.0583. The structure was refined\nby full-matrix least-squares refinement using SHELXL-93 ~Ref.\n22! against 3417 reflections. Atomic positional and aniso-\ntropic displacement parameters for all atoms were refined\nand a 50% probability thermal ellipsoid plot of the neutron\nderived structure is given in Fig. 2. Table I provides a sum-\nmary of all relevant crystal, data collection and refinement\nparameters.\nC. Multipolar refinement\nInitial atomic coordinates and thermal parameters were\ntaken from a conventional Independent Atom Model ~IAM!\nrefinement of the x-ray data, using SHELXL-93 ~Ref. 22! ~see\nTable I!. Multipolar refinement was applied to this model\nFIG. 2. A 50% probability thermal ellipsoid plot of the 20 K\nneutron structure of DED-TCNQ.\nCHARGE-DENSITY STUDY OF THE NONLINEAR . . . PHYSICAL REVIEW B 65 125107\n125107-3\nusing the XD suite of programs.23 This employs spherical and\naspherical atom-centred density functions to model the total\nelectron density of the structure in the following manner:\nratom~r!5Pcrcore~r !1Pvk3rvalence~kr !\n1(\nl50\nlmax\nk83Rl~k8r ! (\nm50\nl\nPlm,6dlm,6~r\/r !, ~3!\nwhere rcore and rvalence are Hartree-Fock spherical core and\nvalence densities, respectively, Pc and Pv are the populations\nof the core and valence shells, respectively, P1m6 are the\nmultipolar population parameters of each normalized associ-\nated Legendre function dlm6 of order l @monopolar (l50),\ndipolar (l51), quadrupolar (l52), octopolar (l53), hexa-\ndecapolar (l54)#, m corresponds to the orientation of l, k\nand k8 are the contraction-expansion coefficients for the\nspherical and multipolar valence densities, respectively, and\nRl(k8r) represents the Slater-type radial functions as defined\nby\nRl~r !5@~jn113!\/~nl12 !!#~r !n~ l ! exp~2jr !, ~4!\nwhere n.1 is required to satisfy Poisson’s electrostatic\nrequirements24 and j is the energy-optimized single Slater\norbital exponent for the electron subshells of isolated atoms\nj5(Z-s)\/n ~Z5charge, s5screening constant, n\nTABLE I. A summary of crystal, data collection, and IAM refinement parameters for the 20 K x-ray and\nneutron structure of DED-TCNQ.\nParameter 20 K x-ray ~IAM! study 20 K neutron ~IAM! study\nMolecular formula C18H24N4 C18H24N4\nFormula weight 296.41 296.41\na~Å! 11.174~2! 11.178(1)a\nb~Å! 12.859~2! 12.859(1)a\nc~Å! 12.486~2! 12.476(1)a\na~°! 90 90\nb~°! 112.00~1! 112.044(5)a\ng~°! 90 90\nCell volume ~Å3! 1663.4~5! 1662.2~4!a\nCrystal system monoclinic monoclinic\nSpace group P2(1)\/c P2(1)\/c\nZ 4 4\nCalculated density ~g cm21! 1.184 1.182\nTemperature ~K! 20.0~1! 20.0~2!\nWavelength ~Å! 0.71073 0.8417~2!\nAbsorption coefficient ~mm21! 0.072 0.2137\nCrystal morphology rectangular cubic\nCrystal color yellowy-brown yellowy-brown\nCrystal size ~mm! 0.2430.2430.14 1.031.031.0\nTotal number of reflections 41407 3773\nUnique reflections 14919 3443\nObserved reflections @I.2s(I)# 8562 2184\nR int 0.0272 0.0583\n(sin u\/l)max 1.037 0.681\nData\/parameters 14907\/295 3417\/415\nR(F)@I.2s(I)# 0.0604 0.0532\nR(F2)@I.2s(I)# 0.1018 0.0890\nGOFw 1.123 1.330\nWeighting scheme 1\/s2 1\/s2\nDr (max,min) 0.720\/20.447e Å23 1.108\/21.096 fm Å23\naAlthough these cell parameters are neutron derived, the 20 K x-ray determined cell parameters a\n511.174(2) Å, b512.859(2) Å, c512.486(2) Å, b5112.00(1)° were used in all correction and refine-\nment procedures since they are deemed more accurate than neutron derived values, as is usual. Moreover, the\nestimated standard deviation of the neutron wavelength was not used in the calculation of the neutron\nderived cell parameters:\nR~F!5\n(iF0u2uFci\n(uF0u\n; Rw~F2!5F(@w~F022Fc2!2#(@w~F02!2# G\n1\/2\n; GOF5F(@w~F022Fc2!2#\nn2p G\n1\/2\n; R int5\n(uF0\n22F0\n2~mean!u\n(F0\n2 .\nJACQUELINE M. COLE et al. PHYSICAL REVIEW B 65 125107\n125107-4\n5principal quantum number! and for each element it is taken\nfrom tabulated values25 and modified by the variable k8,\nsuch that j85k8j ~Ref. 26!.\nOnce the refinement of the initial parameters had con-\nverged, a k parameter for each atom was introduced. All k\nvalues relating to nonhydrogen atoms were initially set at 1.0\nand refined whereas the k value for hydrogen atoms was\nfixed to the Stewart-Davidson-Simpson27 ~SDS! value of\n1.16. The hydrogen coordinates and anisotropic displacement\nparameters in the XD refinement were then replaced by the\nrefined neutron derived values. While the coordinates di-\nrectly replaced the x-ray derived ones, the neutron hydrogen\nthermal parameters had to be scaled with respect to the x-ray\nones before substitution. The scaling parameter was deter-\nmined from the difference between the x-ray and neutron\nnonhydrogen anisotropic displacement parameters according\nto the weighted formula by Blessing28\nUXi j5UNi j1DUi j, ~5!\nwhere\nDUi j5(\na\nF(\na\nwUXi j2(\na\nwUNi jG Y (\na\nw\nand\nw51\/s2,\nwhere\ns5s~UXi j2UNi j!5@s2~UXi j1s2~UNi j!#1\/2. ~6!\nThe scaling parameter was small @25.4031024# , thus indi-\ncating that there is good agreement between the thermal pa-\nrameters derived from the two diffraction experiments at 20\nK. The scaling parameter was simply added to all hydrogen\natom thermal parameters to give the substituted values. The\nresulting hydrogen positions and thermal parameters were\nfixed in all subsequent refinements.\nMultipolar terms were then introduced starting with the\nrefinement of monopoles and dipoles ~bond-directed ones for\nhydrogen atoms! on all atoms. Once converged, quadrupolar\nand octopolar terms were refined for all nonhydrogen atoms.\nRefinement at the hexadecapolar level for all nonhydrogen\natoms was also attempted. However, the population of these\nfunctions was negligible @maximum hexadecapolar function\npopulation was less than twice its estimated standard devia-\ntion# and so were not included in final refinements.\nThe k parameters were then sub-divided into six values\nthat reflected the different chemical environments of a given\nelement. The six k values represented the six following\ngroups of atoms\nGroup 1: All sp hybridized nitrogen atoms @N~1! and\nN~2!#.\nGroup 2: All sp2 hybridized nitrogen atoms @N~3! and\nN~4!#.\nGroup 3: All sp hybridized carbon atoms @C~1! and C~2!#.\nGroup 4: All sp2 hybridized carbon atoms @C~3! to\nC~10!#.\nGroup 5: All sp3 hybridized carbon atoms @C~11! to\nC~18!#.\nGroup 6: All hydrogen atoms.\nk values for the first five groups were refined, as were the\nk8 parameters subsequently such that, for all of the multi-\npoles employed, the value of k8 in each k group was con-\nstrained to have the same value ~since k8 values for each\nmultipole are strongly correlated to each other!. For group 6,\nboth k and k8 were fixed at the SDS value of 1.16 ~see\nearlier!.\nIII. RESULTS AND DISCUSSION\nA summary of the multipolar refinement details is given\nin Table II while the bond distances from the charge-density\nstudy ~the C-H distances being those taken from the neutron\nrefinement! are provided in Table III. All nonhydrogen dis-\ntances are markedly more accurate than those derived from\nthe analogous IAM refinement, as expected. Moreover, there\nare significant discrepancies ~.2s! between IAM and\nmultipole-derived bond distances in areas of notable charge\ntransfer ~e.g., the nitrile groups and benzenoid ring! thus in-\ndicating the inadequacies of the IAM for structures of such\ncompounds. The neutron derived C-H distances are naturally\nmuch more precise than ones derived from x-ray diffraction\ndata. Such distances were used to confirm a previous\nhypothesis2 that the subject compound possesses no hydro-\ngen bonding in the crystalline state.\nA. Topological analysis of electronic structure\nThe topology of the charge-distribution was analyzed in\nthe three principal areas of the molecule: the benzenoid ring,\nTABLE II. A summary of refinement parameters for the charge density study of DED-TCNQ.\nParameter Value Parameter Value\nScale Factor 0.2480~6! Weighting scheme 1\/s2\nCriterion for observed\ndata\nF52s(F) Rw(F) 0.0400\nR(F) 0.0474 Rw(F2) 0.0713\nR(F2) 0.0517 GOFw 1.1666\nRall(F) 0.1566 Data\/parameter 6537\/609\nRall(F2) 0.0819 D\/s (min\/max) 2.131029\/3.231025\nGOF 1.1042 Dr (min\/max) 20.190\/0.097 eÅ23\nCHARGE-DENSITY STUDY OF THE NONLINEAR . . . PHYSICAL REVIEW B 65 125107\n125107-5\nits 2C(CN)2 substituent, and the para-substituent in the area\nimmediately vicinal to the ring. Figure 3 shows dynamic\nmodel maps Fmultipole2Fspherical , for the principal molecular\nfragments, which represent the contribution of the multipolar\nterms to the model. The corresponding static maps are not\ngiven here because they show very little difference since the\nthermal vibration in the molecule is so small. Residual den-\nsity maps of the molecule, also given in Fig. 3, show feature-\nless regions of only a little residual electron density, thus\nindicating that the electron distribution is well described by\nthe multipole model. The rigid-bond test,29 which was ap-\nplied to all bonds not involving hydrogen atoms during the\nrefinement, was satisfied throughout, all differences in the\nmean square displacement amplitudes ~DMSDA! being\n<631024 Å2 for bonds containing any p character, and\n<1131024 Å2 for those belonging to the ethyl groups, see\nHirshfeld’s criterion for carbon atoms DMSDA<0.001 Å2.\n1. Modelling of molecular charge-transfer\nSince an electroneutrality constraint is applied over the\nwhole asymmetric unit, the extent of charge transfer ensuing\nwithin the molecule can be derived wholly from the mono-\npole populations. The charge on a given atom is the differ-\nence between the monopole population for this atom, ob-\nserved from the charge-density study, and the number of\nvalence electrons present classically in the atom, e.g., four\nfor a carbon atom. The charges present on each nonhydrogen\natom in DED-TCNQ are given in Table IV.\nAll values of the derived charges conform to simple elec-\ntronegativity expectations. The charge-transfer properties of\nthe molecule appear to be dominated by the nitrogen atoms,\nsince they contain the bulk of the negative charge. This ren-\nders the entire 2C(CN)2 ring substituent negatively charged\nas one would expect for a molecule with predominantly zwit-\nterionic character in its ground state ~see Fig. 1!. The\ncomplementary localization of positive charge on the carbon\natoms, vicinal to N~3! and N~4!, and notably on C~10! since\nit is common to these nitrogen atoms and adjacent to the\nring, also resemble well the preponderance of the zwitteri-\nonic electronic form. The remaining negative charge is bal-\nanced principally by positive hydrogen-atom contributions,\ndue to the electron donating nature of C-H bonds. Thus, the\nalkyl side chains must also play a significant role in the good\nlevel of polarization obtainable in this compound. These\ncharge-transfer features, coupled with the null pseudoatom\ncharges of the phenyl ring atoms within experimental error,\nindicate that the electronic configuration of the molecule\nconforms well to the idealized charge-separated donor-\n~para!-acceptor ~DA! formalism, so desirable for NLO ap-\nplications of organic molecules.\n2. Polarization of electron density\nElectron deformation density ~EDD! maps for the planar\nparts of the molecule are given in Fig. 4. These plots show\nr-r IAM , thus yielding a topological representation of the va-\nlence electron density distribution of the molecule. The na-\nture and extent of the bonding and polarization ensuing in\nthe molecule can thus be inferred. All bond ~3,21! critical\npoints and ellipticity values found within the molecule are\ngiven in Table V. Bond critical points are the point of mini-\nmum overlap between two atoms ~with local maxima of elec-\ntron density curvature in the orthogonal directions to the\nbond vector! and ellipticity « is a measure of the amount of\np bonding present in the bond: «50 pertains to no\np-bonding electron density and a large value of « denotes a\nsubstantial amount of p bonding present.30 Note that the\nprincipal axes of the ellipse defined to measure this quantity\nlie perpendicular to the bond vector i.e., one is taking a cross\nsection of the bond. Therefore, if any triple-bonding charac-\nter is present in a bond, this will result in a deceptively lower\nvalue of « than expected since the combination of double and\ntriple bonding will make this cross section more spherical as\n« tends to zero.\nThe EDD map in Fig. 4~a! illustrates the high level of\ntriple-bonded character in each nitrile group. Corresponding\ncritical points lie noticeably closer to the carbon atom than\nthe nitrogen atom as expected and ellipticity values are\nsmall. The nitrogen lone pairs on both N~1! and N~2! can be\nseen clearly. Electron density in the adjoining C~1!-C~3! and\nC~2!-C~3! bonds appears to be polarized towards each nitrile\ngroup as expected from electronegativity arguments. Corre-\nsponding ellipticity values for these bonds and those for C~3!\nand C~4! are typical for a delocalized p-bonded system, thus\nindicating that there is a marked presence of the zwitterionic\nelectronic configuration, its formal negative charge being de-\nlocalised fairly evenly over all bonds emanating from C~3!.\nSuch a spread of delocalization lends the molecule well to\nTABLE III. Bond distances for DED-TCNQ as derived from the\ncharge-density study.\nBond Distance ~Å! Bond Distance ~Å!\nN(1)uC(1) 1.1720~16! C(11)uH(11A) 1.0840~9!\nN(2)uC(2) 1.1724~15! C(11)uH(11B) 1.0794~10!\nN(3)uC(10) 1.3431~12! C(12)uH(12A) 1.0981~11!\nN(3)uC(11) 1.4773~13! C(12)uH(12B) 1.0806~10!\nN(3)uC(13) 1.4812~13! C(12)uH(12C) 1.0870~12!\nN(4)uC(10) 1.3457~12! C(13)uC(14) 1.5275~13!\nN(4)uC(15) 1.4780~13! C(13)uH(13A) 1.0993~10!\nN(4)uC(17) 1.4813~13! C(13)uH(13B) 1.0876~10!\nC(1)uC(3) 1.4100~14! C(14)uH(14A) 1.0802~11!\nC(2)uC(3) 1.4072~14! C(14)uH(14B) 1.0793~10!\nC(3)uC(4) 1.4426~12! C(14)uH(14C) 1.1004~11!\nC(4)uC(5) 1.4211~13! C(15)uC(16) 1.5279~13!\nC(4)uC(9) 1.4204~13! C(15)uH(15A) 1.0811~10!\nC(5)uC(6) 1.3886~12! C(15)uH(15B) 1.0936~10!\nC(5)uH(5) 1.0824~10! C(16)uH(16A) 1.0962~10!\nC(6)uC(7) 1.4097~13! C(16)uH(16B) 1.0920~10!\nC(6)uH(6) 1.0920~10! C(16)uH(16C) 1.0897~11!\nC(7)uC(8) 1.4080~12! C(17)uC(18) 1.5263~14!\nC(7)uC(10) 1.4673~12! C(17)uH(17A) 1.0870~10!\nC(8)uC(9) 1.3870~12! C(17)uH(17B) 1.0816~10!\nC(8)uH(8) 1.0902~10! C(18)uH(18A) 1.0864~11!\nC(9)uH(9) 1.0869~10! C(18)uH(18B) 1.0894~11!\nC(11)uC(12) 1.5247~13! C(18)uH(18C) 1.0872~11!\nJACQUELINE M. COLE et al. PHYSICAL REVIEW B 65 125107\n125107-6\ncharge-transfer processes, especially since C~3! is vicinal to\nthe phenyl ring, thereby extending the usual conjugation to\nthe nearest neighbor of the ring from the phenyl group right\nthrough to the nitrile terminal substituents.\nThe EDD map of the phenyl ring @Fig. 4~b!# shows that\nthe zwitterionic ~aromatic! form is more favored over the\nquinoidal form, all bonds having fairly similar concentra-\ntions of electron density („2r) and relevant ellipticity values\nthat are typical for aromatic bonds. The ellipticity values\ncorresponding to the bonds C~4!-C~5! and C~4!-C~9!, are\nslightly lower than those of other bonds in the phenyl ring,\nbut presumably, this slight diminution in p-bonding is a sim-\nply a consequence of the conjugation with the C~3! atom. All\nC-C bond critical points lie at the centers of each respective\nbond thus implying no electronic polarization within the\nring. This moiety therefore acts as a passive medium for\nFIG. 3. Dynamic and residual\nmaps for the (a\/b) nitrile, (c\/d)\nphenyl, (e\/ f ) substitution point of\nthe -C(NEt)2 group in DED-\nTCNQ out to sin u\/l50.7 Å21\nand with contour levels of\n0.1 e\/Å. ~Solid lines are positive,\ndashed lines are negative, and dot-\nted lines are zero.!\nCHARGE-DENSITY STUDY OF THE NONLINEAR . . . PHYSICAL REVIEW B 65 125107\n125107-7\ntransferring charge from each side of the molecule as one\nwould expect. A ring ~3, 11! critical point was located at the\ncenter of the ring, positioned at 1.439, 1.398, 1.389, 1.406,\n1.396, and 1.406 Å from atoms C~4!, C~5!, C~6!, C~7!, C~8!,\nand C~9!, respectively. The local depletion of charge at this\ncenter („2r53.7) is typical for such an environment.\nIn common with the C~3! site, a substantial amount of p\nelectron density surrounds the C~10! atom, judging by the\nellipticity values. The ellipticity value for the bond C~7!-\nC~10!, implies that C~10! is conjugated with the phenyl ring.\nSuch a level of conjugation represents the presence of a fair\ndegree of the quinoidal state in the molecule. The slightly\nhigher ellipticity values for the N~3!-C~10! and N~4!-C~10!\nbonds and the very high level of local charge concentration\nin these bonds, as deduced from the highly negative „2r\nvalues and Fig. 4~c!, indicate that N~3! and N~4! are involved\nin stabilizing the formal positive charge in the zwitterionic\nform.\nIn summary, electronic delocalization appears to be\npresent throughout all of the planar component of the mol-\necule. This shows that there must exist a fair mixture of the\nquinoidal and zwitterionic states in the molecule at 20 K.\nB. Bond-length-alternation type calculations\n1. Calculations based on the ‘‘strength-length’’ analogy\nThe level of zwitterionic: quinoidal character of DED-\nTCNQ was quantified previously using calculations based on\nthe structure determined at 150 K using conventional single-\ncrystal diffraction techniques.2 These calculations were\nbased on the equations\nDTCNQ\nS 5(\ni51\nNb\nubi\ns2bi\nTCNQu\/Nb , ~7!\nxs5@~DTCNQ\nzwit 2DTCNQ\nS !\/DTCNQ\nzwit #3100, ~8!\nwhere bis is the ith bond length in structure S and biTCNQ is\nthe ith bond in the ideal TCNQ form. Nb is the number of\nbonds over which the average was derived. DSTCNQ is a mea-\nsure of the average deviation in bonding character of struc-\nFIG. 4. Model electron deformation density maps for the ~a! nitrile, ~b!\nphenyl, ~c! substitution point of the -C(NEt)2 group in DED-TCNQ with\ncontour levels of 0.1 e\/Å. The model is calculated from the Fourier trans-\nform of the calculated structure factors. ~Solid lines are positive, dashed\nlines are negative, and dotted lines are zero.!\nTABLE IV. Pseudoatomic charges for each nonhydrogen atom\nin DED-TCNQ.\nAtom Charge Atom Charge\nN~1! 20.17~12! C~8! 0.00~7!\nN~2! 20.20~12! C~9! 0.00~7!\nN~3! 20.30~9! C~10! 0.12~9!\nN~4! 20.36~9! C~11! 0.01~8!\nC~1! 20.13~13! C~12! 0.00~8!\nC~2! 20.13~13! C~13! 0.05~8!\nC~3! 20.09~9! C~14! 20.14~8!\nC~4! 0.07~7! C~15! 0.06~8!\nC~5! 0.00~7! C~16! 20.01~8!\nC~6! 20.08~7! C~17! 0.07~8!\nC~7! 0.06~7! C~18! 20.02~8!\nJACQUELINE M. COLE et al. PHYSICAL REVIEW B 65 125107\n125107-8\nture S compared to that in TCNQ and DTCNQZWIT is this level of\ndeviation in bonding character between the two extreme\nzwitterionic and TCNQ forms. xs signifies the percentage of\nquinoidal character that structure S possesses. In the previous\nstudy xDED-TCNQ was calculated to be 27~2!%, i.e., ;3:1\nzwitterionic:quinoidal in bonding character.\nxs was recalculated using data from this study in order to\n~a! assess the level of validity of these previous measure-\nments, based on the IAM rather than a multipolar model and\n~b! establish any temperature dependence of the relative bal-\nance in the two electronic configurations. Four values of xs\nwere evaluated for this assessment: two from the IAM x-ray\ndiffraction analysis ~20 and 150 K!, one from the 20 K IAM\nneutron diffraction data and the other from the 20 K multi-\npolar analysis. The reference bond-length values used for\nTCNQ and a zwitterion were the same as those used in the\nprevious study. Results are given in Table VI.\nThere is excellent agreement amongst all values derived\nfrom 20 K data, thus illustrating that such calculations do\nindeed produce accurate values using the IAM only and fur-\nthermore, the nature of the structural probe ~x rays or neu-\ntrons! does not alter the result. The 20 and 150 K IAM re-\nsults show a significant temperature dependence of\nxDED-TCNQ . The observed increase in TCNQ-like character\nwith a decrease in temperature implies that the quinoidal\nelectronic state is slightly more energetically favorable than\nthe zwitterionic configuration.\n2. Calculations based on bond ellipticities\nThe calculation of xs is based implicitly on the assump-\ntion of a ‘‘strength-length’’ relationship, the greater the p\nbonding present in a bond, the shorter the interatomic dis-\ntance. Since ellipticity values give a direct ‘‘topological’’\nmeasure of the level of p bonding present between a bond,\nthe reevaluation of xs using values of « in order to test the\n‘‘strength-length’’ assumption was deemed pertinent. The\ncalculations were the same as those given above except that\nbis and biTCNQ were replaced by « is and « iTCNQ. The refer-\nence values of « were taken from a previous charge-density\nstudy on TCNQ ~Ref. 31! where «50.23 for C~5!-C~6! and\nC~8!-C~9!, «50.11 for C~4!-C~5!, C~6!-C~7!, C~7!-C~8!, and\nC~4!-C~9!, and «50.17 for C~3!-C~4! and C~7!-C~10! using\nthe atom labeling scheme herein adopted. The reference val-\nTABLE V. Information regarding all bond ~3, 21! critical points located within the molecule of DED-TCNQ. ~l1 , l2 and l3 are the\neigenvalues of the second derivative of the electron density, r, at the bond critical point; „2r is the sum of these eigenvalues; « is the\nellipticity defined as «5(l12l2)\/l2 ; Ri j is the length of the bond path between the atoms; d1 and d2 represent the distance between the\nfirst and second atoms specified in the bond column and the critical point, respectively.!\nBond l1 l2 l3 r „2r « Ri j d1 d2\nN(1)uC(1) 227.70 226.05 28.33 3.292 225.425 0.06 1.17 0.752 0.421\nN(2)uC(2) 229.37 228.57 31.77 3.442 226.168 0.03 1.17 0.757 0.415\nN(3)uC(10) 219.40 215.83 11.14 2.340 224.091 0.23 1.34 0.794 0.549\nN(3)uC(11) 210.87 29.99 11.98 1.629 28.880 0.09 1.48 0.880 0.597\nN(3)uC(13) 211.93 210.55 12.26 1.669 210.227 0.13 1.48 0.867 0.613\nN(4)uC(10) 219.62 215.03 10.93 2.308 223.728 0.31 1.35 0.804 0.543\nN(4)uC(15) 210.47 29.71 11.98 1.578 28.202 0.08 1.48 0.871 0.608\nN(4)uC(17) 210.57 29.85 12.73 1.590 27.691 0.07 1.48 0.862 0.618\nC(1)uC(3) 214.10 211.55 12.03 1.963 213.616 0.22 1.41 0.744 0.667\nC(2)uC(3) 214.45 212.43 12.11 2.000 214.772 0.16 1.41 0.735 0.672\nC(3)uC(4) 213.33 211.43 11.22 1.868 213.552 0.17 1.44 0.739 0.704\nC(4)uC(5) 215.82 213.79 11.26 2.113 218.355 0.15 1.42 0.714 0.708\nC(4)uC(9) 214.18 212.05 11.73 1.990 214.502 0.18 1.42 0.722 0.698\nC(5)uC(6) 215.49 212.97 10.64 2.090 217.818 0.19 1.39 0.674 0.715\nC(6)uC(7) 215.04 212.51 11.23 2.035 216.324 0.20 1.41 0.717 0.693\nC(7)uC(8) 216.61 213.68 11.25 2.167 219.039 0.21 1.41 0.695 0.713\nC(7)uC(10) 212.61 211.09 10.93 1.789 212.779 0.14 1.47 0.688 0.780\nC(8)uC(9) 215.17 212.58 10.89 2.105 216.851 0.21 1.39 0.724 0.663\nC(11)uC(12) 29.96 29.25 11.00 1.540 28.215 0.08 1.52 0.791 0.734\nC(13)uC(14) 210.57 210.43 11.42 1.644 29.571 0.01 1.53 0.787 0.741\nC(15)uC(16) 210.70 210.19 11.26 1.632 29.634 0.05 1.53 0.796 0.732\nC(17)uC(18) 211.01 29.94 11.24 1.638 29.700 0.11 1.53 0.770 0.757\nTABLE VI. Calculations of relative levels of zwitterionic versus\nquinoidal character present in DED-TCNQ according to different\nmodels.\nRefinement model of diffraction data\n~probe\/temperature for experiment! Ds\nTCNQ xs(%)\nIAM ~x rays, 150 K! 0.038 ~Ref. 2! 27~2! ~Ref. 2!\nIAM ~x rays, 20 K! 0.034 37~2!\nIAM ~neutrons, 20 K! 0.032 39~2!\nMultipolar ~x rays, 20 K! 0.033 37~2!\nCHARGE-DENSITY STUDY OF THE NONLINEAR . . . PHYSICAL REVIEW B 65 125107\n125107-9\nues for « for bonds in the ring of the zwitterion extreme were\ntaken to be «50.17 ~derived by taking the midpoint between\nthe two different bonding types in the ring from the TCNQ-\nTTF reference study, «50.2320.11! and «50 was assumed\nfor bonds C~3!-C~4! and C~7!-C~10! since these should ex-\nhibit pure s bonding only in this canonical form, thus having\na spherical cross section of electron density between the re-\nspective bonds. The corresponding calculation of xs yielded\na value of 44~4!% which is identical to that deduced from\ncalculations based on the respective bond lengths at 20 K,\nwithin experimental error ~the difference is just over 1 esti-\nmated standard deviation!. Therefore, this confirms that the\nassumption of the ‘‘strength-length’’ analogy is entirely sat-\nisfactory. In addition, such consistency obtained between de-\nductions based on bond lengths and « values corroborates the\nconjecture that the results from the multipolar analysis are of\na very good level of accuracy.\n3. Relating bond-length-alternation type results\nto molecular hyperpolarizability\nThe 63:37 zwitterionic: quinoidal ratio lends the material\ngood potential with respect to NLO properties since such an\nelectronic configuration represents a BLA fairly close to the\nmidpoint between the cyanine limit ~i.e., a 50:50 zwitteri-\nonic: quinoidal mix! and the entirely zwitterionic form, the\nBLA at this point ~corresponding to a ratio of 75:25 zwitte-\nrionic: quinoidal! yielding a maximum as a function of b\n~see point II Fig. 1!. Since b is intrinsically dependent on m\n@see Eq. ~1!#, the ratio corresponding to the point of maxi-\nmum curvature of b will vary to some extent between de-\nrivatives with different levels of conjugation and\/or donor\nand acceptor groups, but the general profile of the function\nremains constant and the maximum will always lie at a BLA\nvalue in the vicinity of this midpoint. Moreover, the tempera-\nture effects of BLA observed ~the zwitterionic:quinoidal ratio\nrising to 73:27 at 150 K! indicate that the material could, in\nprincipal, be ‘‘temperature tuned’’ so as to obtain a BLA that\ncorresponds to the maximum point of curvature of b.\nC. Calculation of molecular dipole moment\nfrom the charge-density results\nCharge-density studies enable one to ascertain the values\nof multipolar moments in the molecule. The dipolar moment\nis calculated according to the equation32,33\nma5(j51\nn\na j~Z j2Pc2Pv!1q ja , ~9!\nwhere a j denotes the vector component x, y, or z ~Cartesian\nframe of reference! of atom j, Z j is the atomic charge on\natom j, Pv and Pc are the valence and core populations of\natom j, respectively, and q j is the contribution of the dipolar\nmoment to the overall charge distribution which is derived\nfrom the product of the integrated Slater-type radial function,\nthe associated Legendre function and the population\ncoefficient32,33\nq ja54P jlm~nl13 !!\/3k j8j~nl12 !!. ~10!\nBy specifying the origin as the molecular center of mass,\ntensorial coefficients of mx5223310230 Cm, my5237\n310230 Cm and mz580310230 Cm were derived from the\nexperimental results in this semiempirical fashion. The re-\nsulting dipolar vector lies almost directly along the molecu-\nlar axis, but tilted away from the molecular plane by 27~5!°.\nThe negative charge of the molecular dipole ~the charge-\ntransfer axis! is directed directly across the molecule, passing\nfrom the ethyl ~electron donating! end towards the cyano\n~electron withdrawing! groups, thus corroborating the pre-\ndominance of the zwitterionic molecular character ~the op-\nposite sense of m would be expected for a molecule of\nwholly quinoidal character, see Fig. 5!.\nThe near coincidence of charge-transfer and molecular\naxes is expected since the molecule is twofold symmetric\nabout the molecular axis and all p-electron density lies\nwithin the molecular plane. The slight tilt of the charge-\ntransfer axis from the molecular plane probably owes itself\nto strong local field effects. Indeed, the local field effects are\nevidently very strong given the particularly large magnitude\nof the total molecular dipole moment umu591310230 Cm:\nthis value is markedly larger than such values derived from\ncalculations of m in the gas and liquid phases: 33.36\n310230 Cm and 66.71310230 Cm, respectively.13 Strong\nlocal field effects would also account for the otherwise sur-\nprising lack of intermolecular hydrogen bonding in this com-\npound despite the prevalence of C-HflN nonbonded con-\ntacts in very similar materials, the terminal nitrile groups\nbeing the principal sources of hydrogen-bond acceptors.\nSuch information on local field effects is important a priori\ninformation for modelling studies of these materials when\nincluded in guest-host media and for understanding the SHG\nproperties of similar derivatives that crystallize in noncen-\ntrosymmetric space groups.\nIV. CONCLUSIONS\nThe charge-density distribution in this important NLO\nprecursor has been determined at 20 K and has revealed sev-\neral novel results. Our previous report on a series of these\nTCNQ derivatives, including the subject compound, gave a\nbond-length-alternation type analysis which is very relevant\nin the field of organic non-linear optics. Such analysis is\nbased on the basic assumption of a ‘‘strength-length’’ rela-\ntionship between bonds. This work takes this analysis further\nby assessing whether or not such a naive approach is robust\nin these materials via a new topological approach to these\nFIG. 5. The expected sense of dipole moment for a purely\nzwitterionic and purely quinoidal electronic configuration of\nDED-TCNQ.\nJACQUELINE M. COLE et al. PHYSICAL REVIEW B 65 125107\n125107-10\ncalculations and also if the bond-length-alternation effects\nare temperature dependent. By the careful combination of 20\nK x-ray and neutron diffraction data and extensive crystallo-\ngraphic modelling, using a multipole formalism, the\n‘‘strength-length’’ approach is shown to be valid in these\nderivatives, and is also found to be temperature dependent.\nThe topological approach exploits the ellipticity of the\nbonding density that is derived from the charge-density\nstudy. The remarkable agreement between the experimental\nmeasures of size ~bond lengths! and shape ~electron density\nof the bond cross sections! is very encouraging and is illus-\ntrative of the high regard that one can place upon the intrin-\nsic structure\/property relationships in organic nonlinear op-\ntics. The observed sensitivity of the bond-length-alternation\ntype calculations to temperature corroborates the fact the\nquinoidal and zwitterionic electronic configurations lie very\nclose in energy and also indicates the quinoidal form is the\nmore thermally stable.\nIn addition, this charge-density analysis also yields impor-\ntant information regarding the relative polarization of elec-\ntron density throughout the molecule. We have been able to\npartition this electronic distribution to isolate pseudocharges\non each atom and, from these, determine the level and de-\ntailed nature of the molecular charge transfer that dominates\nb ~the cause of the NLO effect on a molecular scale!. In\naddition, such partitioning has allowed us to determine the\nmagnitude and direction of the molecular dipole moment in\nthe solid state. The deduction of this property in the solid\nstate, and in particular its sense, is very difficult by any other\ntechnique. The results show that local crystal field effects\nstrongly affect the environment in the solid state. Given the\ninherent link of local field effects to the molecular ~b! and\nmacroscopic (x (2)) NLO origins, this information is impor-\ntant preliminary information for investigations of the NLO\neffects of these precursors when poled within an inert host\nmatrix.\nACKNOWLEDGMENTS\nThe authors wish to thank the Institut Laue Langevin,\nGrenoble, France ~J.M.C.!, St. Catharine’s College, Cam-\nbridge ~J.M.C.!, and the EPSRC ~J.A.K.H. and M.S.! for\nfinancial support.\n*Author for correspondence. Present address: Department of\nChemistry, University of Cambridge, Lensfield Road, Cambridge,\nCB2 1EW. UK. E-mail: jmc61@cam.ac.uk\n†Present address: CASS, SmithKline Beecham, NFSP~N!, 3rd Av-\nenue, Harlow, Essex, SM19 5AW, UK.\n1 J. C. Cole, J. A. K. Howard, G. H. Cross, and M. Szablewski,\nActa Crystallogr., Sect. C: Cryst. Struct. Commun. 51, 715\n~1995!.\n2 J. C. Cole, J. M. Cole, G. H. Cross, M. Farsari, J. A. K. Howard,\nand M. Szablewski, Acta Crystallogr., Sect. B: Struct. Sci. 53,\n812 ~1997!.\n3 J. M. Cole, Ph.D. thesis, University of Durham, UK, 1997.\n4 M. Szablewski, P. R. Thomas, A. Thornton, D. Bloor, G. H.\nCross, J. M. Cole, J. A. K. Howard, M. Malagoli, F. Meyers,\nJ.-L. Bredas, W. Wenseleers, and E. Goovaerts, J. Am. Chem.\nSoc. 119, 3144 ~1997!.\n5 M. Ravi, M. Szablewski, N.-A. Hackman, G. H. Cross, D. Bloor,\nA. E. Goeta, and J. A. K. Howard, New J. Chem. 23, 841 ~1999!.\n6 S. R. Marder, C. B. Gorman, L. Cheng, and B. G. Tiemann, Proc.\nSPIE 1775, 19 ~1993!.\n7 C. B. Gorman and S. R. Marder, Proc. Natl. Acad. Sci. U.S.A. 90,\n11297 ~1993!.\n8 F. Meyers, S. R. Marder, B. M. Pierce, and J.-L. Bredas, J. Am.\nChem. Soc. 116, 10703 ~1994!.\n9 J. L. Oudar and D. S. Chemla, J. Chem. Phys. 66, 2664 ~1977!.\n10 B. F. Levine and C. G. Bethea, J. Chem. Phys. 66, 1070 ~1977!.\n11 S. J. Lalama and A. F. Garito, Phys. Rev. A 20, 1179 ~1979!.\n12 W. G. Cady, Piezoelectricity ~McGraw-Hill, New York, 1946!.\n13 P. R. Thomas, Ph.D. thesis, University of Durham, UK, 1998.\n14 J. Zyss and J. L. Oudar, Phys. Rev. A 26, 2028 ~1982!.\n15 D. M. Burland, R. D. Miller, and A. Walsh, Chem. Rev. 94, 31\n~1994!.\n16 W. R. Hertler, H. D. Hartzler, D. S. Acker, and R. E. Benson, J.\nAm. Chem. Soc. 84, 3387 ~1962!.\n17 R. C. B. Copley, A. E. Goeta, C. W. Lehmann, J. C. Cole, D. S.\nYufit, J. A. K. Howard, and J. M. Archer, J. Appl. Crystallogr.\n30, 413 ~1997!.\n18 M. S. Lehmann and F. K. Larsen, Acta Crystallogr., Sect. A:\nCryst. Phys., Diffr., Theor. Gen. Crystallogr. 30, 580 ~1974!.\n19 R. H. Blessing, J. Appl. Crystallogr. 19, 412 ~1986!.\n20 C. Wilkinson, H. W. Khamis, R. F. D. Stansfield, and G. J. McIn-\ntyre, J. Appl. Crystallogr. 21, 471 ~1988!.\n21 P. Coppens, in Crystallographic Computing, edited by F. R.\nAhmed ~Munksgaard, Copenhagen, 1970!.\n22 G. M. Sheldrick, SHELXL-93: Program for the Refinement of Crys-\ntal Structures using Single Crystal Diffraction Data, University\nof Go¨ttingen, Germany, 1993.\n23 T. Koritsankszky, S. Howard, T. Richter, P. R. Mallinson, Z. Su,\nand N. Hansen, A Computer Program Package for Multipole\nRefinement and Analysis of Charge Densities from Diffraction\nData, Berlin, 1994.\n24 R. F. Stewart, Isr. J. Chem. 16, 124 ~1977!.\n25 E. Clementi and D. L. Raimondi, J. Chem. Phys. 38, 2686 ~1963!.\n26 N. K. Hansen and P. Coppens, Acta Crystallogr., Sect. A: Cryst.\nPhys., Diffr., Theor. Gen. Crystallogr. 34, 909 ~1978!.\n27 R. F. Stewart, E. R. Davidson, and W. T. Simpson, J. Chem. Phys.\n42, 3175 ~1965!.\n28 R. H. Blessing, Acta Crystallogr., Sect. B: Struct. Sci. 51, 816\n~1995!.\n29 F. L. Hirshfeld, Acta Crystallogr., Sect. A: Cryst. Phys., Diffr.,\nTheor. Gen. Crystallogr. 32, 239 ~1976!.\n30 F. W. Bader, Atoms in Molecules. A Quantum Theory ~Clarendon,\nOxford, 1994!.\n31 E. Espinosa, E. Molins, and C. Lecomte, Phys. Rev. B 56, 1820\n~1997!.\n32 M. A. Spackman, Chem. Rev. 92, 1769 ~1992!.\n33 T. Koritsanszky, S. Howard, P. R. Mallinson, Z. Su, T. Richter,\nand N. K. Hansen, XD. A computer program package for multi-\npole refinement and analysis of charge densities from diffraction\ndata, 1995.\nCHARGE-DENSITY STUDY OF THE NONLINEAR . . . PHYSICAL REVIEW B 65 125107\n125107-11\n"}