{"doi":"10.1080\/09687760108656779","coreId":"14095","oai":"oai:generic.eprints.org:756\/core5","identifiers":["oai:generic.eprints.org:756\/core5","10.1080\/09687760108656779"],"title":"Online interactivity: best practice based on two case studies","authors":["Boyle, Tom","Cook, John"],"enrichments":{"references":[{"id":194704,"title":"Cooperative problem-seeking dialogues in learning',","authors":[],"date":"2000","doi":"10.1007\/3-540-45108-0_65","raw":"Cook, J.  (2000),  'Cooperative problem-seeking dialogues in learning', ITS 2000 -  Fifth International  Conference  on  Intelligent  Tutoring  Systems,  19-23  June  2000,  Montreal, Canada.","cites":null},{"id":194700,"title":"Design for Multimedia Learning, London: Prentice Hall. I01 Tom 8oyle andJohn Cook Online interactivity: best practice based on two case studies","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":194699,"title":"Evaluating interactive technologies for learning',","authors":[],"date":"1993","doi":"10.1080\/0022027930250403","raw":"Atkins, M. (1993), 'Evaluating interactive technologies for learning', Journal  of Curriculum Studies, 25, 33342.","cites":null},{"id":1876995,"title":"I01 Tom 8oyle andJohn Cook Online interactivity: best practice based on two case studies","authors":[],"date":"1999","doi":"10.1080\/09687760108656779","raw":"I01 Tom 8oyle andJohn Cook  Online interactivity: best practice based on two case studies Boyle, T. (1999), 'Using the Web to enhance learning about multimedia design', Monitor, Journal of the CTI Centre for Computing,  11 (Winter 1999), 18-21.","cites":null},{"id":194705,"title":"Managing Multimedia.&quot; Project Management for Interactive Media, 2nd edn,","authors":[],"date":"1999","doi":null,"raw":"England,  E.  and  Finney,  A.  (1999),  Managing  Multimedia.&quot;  Project  Management for Interactive  Media, 2nd edn, Harlow: Addison-Wesley. JISC\/CALT (2000),  'Effective networked learning in higher education: notes and guidelines', available from h ttp  :  llcsalt, lanes,  ac. ukljiscladvice, htm.","cites":null},{"id":194703,"title":"Mentoring, metacognition and music: interaction analyses and implications for intelligent learning environments',","authors":[],"date":"1998","doi":null,"raw":"Cook,  J.  (1998),  'Mentoring,  metacognition  and  music:  interaction  analyses  and implications  for  intelligent  learning  environments',  International  Journal  of  Artificial Intelligence  in Education,  9, 45-87.","cites":null},{"id":194702,"title":"Pedagogical re-engineering: a pedagogical approach to course enrichment and redesign with the WWW',","authors":[],"date":"1997","doi":null,"raw":"Collis,  B.  (1997),  'Pedagogical  re-engineering:  a  pedagogical  approach  to  course enrichment  and  redesign  with  the  WWW',  Educational  Technology  Review,  8 (Autumn\/Winter 1997).","cites":null},{"id":194701,"title":"The design and evaluation of Web based multimedia learning resources',","authors":[],"date":"1999","doi":null,"raw":"Boyle, T.  and Payne,  L.  (1999),  'The design and  evaluation  of Web  based  multimedia learning  resources',  Proceedings  of  the  7th  Annual  Conference  on  the  Teaching  of Computing,  University of Ulster, August 1999.","cites":null},{"id":446560,"title":"Thinking in Education,","authors":[],"date":"1991","doi":"10.1017\/cbo9780511840272","raw":"Lipman, M. (1991), Thinking in Education,  New York: Cambridge University Press.","cites":null},{"id":446561,"title":"Why observing a dialogue may benefit learning',","authors":[],"date":"1998","doi":"10.1046\/j.1365-2729.1998.1420110.x","raw":"McKendree, J.,  Stenning, K.,  Mayes, T., Lee, J., and Cox, R.  (1998),  'Why observing a dialogue may benefit learning', Journal of Computer Assisted Learning,  14 (2), 110-19.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"The purpose of this paper is to identify and explore best practice in the effective support of online interactivity. Five key issues related to best practice are delineated, based on the experience derived from two case studies. The first case study involved online, collaborative work carried out by twenty-six conversion M.Sc. students following a module on‘Interactive Multimedia Systems'. The online group work was structured around the production of essay-style critiques and the development of prototype multimedia resources. The discussions were structured using the bulletin board facility in WebCT. The second study involved sixty-four second-year undergraduate students following a module on‘Communication via Multimedia’. These students were involved in assessed online discussion groups that aimed to foster a community in enquiry and provide an opportunity for vicarious learning. The assessed discussion groups were based on Netscape Collabra. A comparison of the experience of these two case studies led to the identification of a set of five key issues relating to best practice in the effective support of online interactivity. The first four issues concern the design and implementation of the online learning experiences. The fifth issue involves reflection and improvement on the interventions mad","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14095.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/756\/1\/ALT_J%2DVol09_No1_2001_Online_interactivity_best__pra.pdf","pdfHashValue":"bf4fc15769871e050b51fa03cb762b0b2ac1e162","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:756<\/identifier><datestamp>\n      2011-04-04T08:54:08Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/756\/<\/dc:relation><dc:title>\n        Online interactivity: best practice based on two case studies<\/dc:title><dc:creator>\n        Boyle, Tom<\/dc:creator><dc:creator>\n        Cook, John<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        The purpose of this paper is to identify and explore best practice in the effective support of online interactivity. Five key issues related to best practice are delineated, based on the experience derived from two case studies. The first case study involved online, collaborative work carried out by twenty-six conversion M.Sc. students following a module on‘Interactive Multimedia Systems'. The online group work was structured around the production of essay-style critiques and the development of prototype multimedia resources. The discussions were structured using the bulletin board facility in WebCT. The second study involved sixty-four second-year undergraduate students following a module on‘Communication via Multimedia’. These students were involved in assessed online discussion groups that aimed to foster a community in enquiry and provide an opportunity for vicarious learning. The assessed discussion groups were based on Netscape Collabra. A comparison of the experience of these two case studies led to the identification of a set of five key issues relating to best practice in the effective support of online interactivity. The first four issues concern the design and implementation of the online learning experiences. The fifth issue involves reflection and improvement on the interventions made<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/756\/1\/ALT_J-Vol09_No1_2001_Online_interactivity_best__pra.pdf<\/dc:identifier><dc:identifier>\n          Boyle, Tom and Cook, John  (2001) Online interactivity: best practice based on two case studies.  Association for Learning Technology Journal, 9 (1).  pp. 94-102.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760108656779<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/756\/","10.1080\/09687760108656779"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Online interactivity: best practice based on two \ncase studies \nTom Boyle and John Cook \nUniversity of North London \nernail: t.boyle@unl.ac.uk \nThe purpose of this paper is to identify and explore best practice in the effective support \nof online in teractivity. Five k y issues related to best practice are delineated, based on the \nexperience derived from two case studies. The first case study involved online, \ncollaborative work carried out by twenty-six conversion M.Sc. students following a \nmodule on \"Interactive Multimedia Systems'. The online group work was structured \naround the production f essay-style critiques and the development of prototype \nmultimedia resources. The discussions were structured using the bulletin board facility in \nWebCT. The second study involved sixty-four second-year undergraduate students \nfollowing a module on \"Communication via Multimedia'. These students wereinvolved in \nassessed online discussion groups that aimed to foster a community in enquiry and \nprovide an opportunity for vicarious learning. The assessed discussion groups were based \non Netscape Collabra. A comparison of the experience of these two case studies led to \nthe identification f a set of five key issues relating to best practice in the effective \nsupport of online interactivity. The first four issues concern the design and \nimplementation f the online learning experiences. Th  fifth issue involves reflection and \nimprovement on the interventions made. \nIntroduction \nThis paper compares the experiences of two studies in the use of network supported \ncollaborative learning. These studies aimed to enhance the learning experience of \ntraditional campus-based students. The courses used a hybrid of face-to-face contact and \ncollaborative work mediated through electronic networks. The aim of the studies was to \nprovide an enhanced educational experience tothese traditional student cohorts. \nThe paper presents a comparison of the experience of these two studies. Based on this \ncomparison a set of key factors is distilled that seem to influence strongly the nature and \n94 \nAIt-j Volume 9 Number I \nsuccess of networked learning. The first two sections of the paper, following the \nintroduction, describe the purpose and implementation f the two studies. The first study \nrepresents an intervention i a postgraduate course. The second study involved second- \nyear undergraduate students. The evaluation of these two studies, based on a mixture of \nobservation, questionnaire and focus groups, is then presented. Certain key factors that \ninfluenced the nature and success of the studies are distilled. The paper proposes that \nconsideration of these key factors is important for the successful implementation f\nnetworked learning, especially in a campus-based setting. \nFirst case study: enhancing group projects \nThe focus of this project was to provide integrated computer support o students of \neducational multimedia design. The students were following a unit on Interactive \nMultimedia Systems as part of an M.Sc. conversion course in computing. A significant \nobjective of the project was to bring together traditional strengths of the Web and \nmultimedia to pro'eide an enhanced learning environment that would instantiate many of \nthe principles being taught on the course. The project involved identifying the main layers \nof support required (Collis, 1997), providing computer-based assistance at each of these \nlayers, and integrating this support into major class activities. \nThe Interactive Multimedia Systems module ran for one semester with a lecture ach week \nfollowed by a practical session of three hours. The theory covered in the lectures was \nsupported by the use of the textbook, Design for Multimedia Learning (Boyle, 1997). For \nthe first five weeks the practicals were used to introduce multimedia-authoring skills. From \nabout Week 5 to the end of the module (twelve weeks), the students in the courseware for \nthe unit deployed these skills. \nThe assignment for the unit was conducted as a group-based collaborative project. The \nstudents were divided into groups of four or five, and each group was given a mini-project to \nconduct over approximately seven weeks. In previous years the project had consisted of \ndesigning and creating amultimedia prototype. This work was assessed through demonstra- \ntions and interviews with the students at the end of the semester. Since it was very difficult \nto keep track of the individual contributions to the group work the mark consisted of a \ngroup mark and a larger individual mark (usually around 70 per cent). The group work thus \nwas always structured to ensure significant, clearly identifiable individual components. \nIn the target semester two main changes were made to provide improved support for \nstudent learning. The main change at the courseware layer was the provision of a \nmultimedia Web site to complement the course textbook. The purpose of the DFML \n(Design for Multimedia Learning) Web site was not to replace the textbook or place course \nnotes on the Web. The aim was to provide a multimedia complement to the theoretical \nmaterial covered in the textbook (Figure 1). The book remains the main medium for the \ndetailed exposition of underlying concepts and theoretical structures. The site seeks to \nprovide xperiences and activities that cannot be provided in a book, including multimedia \ndemonstrations, interactive xamples and links to other Web sites. This enhanced \ncourseware should enable the learner to engage in richer learning experiences than can be \nprovided by the book alone (or indeed the Web site alone). \n95 \nTorn Boyle and john Cook Online interactivity: best practice based on two case studies \nFigure I: The DFML Web site, \nThe DFML site was designed to elicit the active engagement of students. This supported \nchanges made in how the assessed group project in the module was conducted. In the \ntarget semester the DFML site was introduced into the course and the coursework \ncomponent for the module was changed. The students were given access to a new Web site. \nThe home page for this site contained two main links. The first link was to the DFML Web \nsite; the second link was to the bulletin board facility in WebCT. The students were \norganized into small groups. Each group was set up as a separate discussion group in the \nWebCT bulletin board facility. The students were asked to work co-operatively tocomplete \ntwo subtasks, to produce: \n• online critiques of the chapters in the book\/site and to suggest enhancements and \nimprovements: The students were encouraged to identify and reference Web sites that \nmight later be incorporated as extra links in the main site; \n° a small multimedia resource to illustrate a topic in the book\/site which they could \nchoose. \nThe students were informed at the beginning of the concept of the site being updated by its \nusers. They were told that good features produced by the groups could be incorporated in\nthe site for use by future students. The students were asked to work collaboratively, using \nthe group bulletin board, to exchange ideas and organize the group's work. The \nproposition that one mark would be given to each group (with the possibility of individual \n96 \nAIt-] Volume 9 Number 1 \nmoderation of marks) was presented to the class. They agreed to this approach. The first \npart of the coursework involved the development of group plans; the second part entailed \nthe chapter critiques. Both the initial group plans and the chapter c itiques were submitted \nelectronically though WebCT. The final part of the coursework involved the creation and \ndemonstration f the multimedia resource. \nSecond case study: encouraging discussion skills \nThe second study involved sixty-four second-year undergraduate students who were \nstudying on a module called 'Communicating via Multimedia'. The students on this \nmodule were given access to various Web resources, such as the DFML Web site described \nabove, as well as a conferencing facility. Participants in the module were involved in \nassessed online discussion groups that aimed to foster a community of enquiry and provide \nan opportunity for vicarious learning. A community of enquiry (Lipman, 1991) is a \nteacher-guided approach to reflective education that places an emphasis on social \ninteraction and co-operative l arning; it also involves critical reasoning and judgement \nabout open-ended problems, i.e. problems and subject areas where there is no single correct \nanswer to a given problem (Cook, 2000). The starting assumption for vicarious learning \n(McKendree, Stenning, Mayes, Lee, and Cox, 1998) is that much real learning occurs \nthrough observation of other learners engaged in active dialogues. \nOn the module students had to complete two assessment tasks, each carrying equal \nweighting. There was no exam. The focus of this second case study was assessment 1,\nwhich involved groups of students co-operating o devise and apply criteria for Web site \nevaluation and a subsequent online debate about his evaluation task. The assessment task \nwas an open-ended one; i.e. there were many possible sets of criteria that could have been \nselected by the students to evaluate a Web site. We were particularly keen to design the \nonline interactions with students on the module in such a way that would promote critical \ndebate about he assessment task. \nA live debate relating to the assignment would not, in the authors' view, have taken place if \nstudents were not motivated in some way. Consequently, the marking scheme for the \nassignment, out of a total of fifty, included thirty marks for group work and twenty marks \nfor individual work. The individual marks for the online debate were ten marks fo r  \ndemonstrating an ability to answer questions and ten marks for taking a lead in the \ndiscussion and showing an awareness of the issues. \nStudents were asked to make at least hree postings to the online debate. The central focus \nin this study was thus the development of discussion and debating skills, and the \nassessment tasks reflected this target. By contrast, in the first study the online discussion \nwas a means to an end - producing online group critiques and multimedia resources. \nEvaluation \nStudy I \nThe evaluation entailed a mixture of quantitative and qualitative methods. This mixture of \nmethods provides summary numerical data supported by richer insights based on \ndiscussion (Atkins, 1993; England and Finney, 1999). A questionnaire was used to gather \n97 \nTorn Boyle andjohn Cook Online interactivity: best practice based on two case studies \ninformation on the students' assessment of the DFML site, and the use of electronic group \nwork using WebCT. This questionnaire was followed by focus group discussions. \nThe questionnaire results can be divided into three parts. These parts relate to the \nevaluation of respectively: the use of WebCT, the main DFML site, and the multimedia \nresources accessed through the site. This paper focuses on the results for the use of group \nonline conferencing. The evaluation of the DFML site and the multimedia resources it\ncontained are reported in Boyle (1999) and Boyle and Payne (1999). \nThe questions used a scale from one to four, where one indicates 'very poor' and four \nindicates 'very good'. The students found the group bulletin board facility in WebCT very \neasy to use. The overall median score was 3.5 out of 4 - 50 per cent of the students rated \nthe use of the group conferencing in WebCT as 'very good'. They also found it very easy to \nmove between the WebCT environment and the DFML site (median 4). The focus group \ndiscussions confirmed that the group conferencing was very popular. The part-time \nstudents especially appreciated the flexibility of structured electronic ommunication. It\nhelped them to keep in touch throughout the week with the full-time members of the \ngroup. \nFrom the tutor's point of view the use of WebCT was a very useful innovation. The tutor \nwas entered as a member of each group. He could thus keep track of the activities within \nthe groups. The students used the facilities to plan and co-ordinate group activities, send \ndrafts to each other, and comment on these drafts. From the tutor's point of view the \nability to 'see' the activities within the group was a marked improvement on the previous \nmethod of group working. The logging facilities in WebCT also made it easy to produce \nsummary reports on the students' activities. These activities included the number of \ncommunications sent and read in the group bulletin boards. This knowledge provided the \nbasis for greater confidence in allocating assessment marks to the groups. Group members \ncould also be asked about differences in the activities of individuals revealed by the online \nmonitoring, and this information often proved informative in ascertaining the reasons for \nvariations in overt activity. As a consequence, for the first time in the history of the module \nthe lecturer had the confidence to award a genuine single-group mark for the collaborative \nwork. In cases where there was some doubt, face-to-face discussions were held with the \ngroup to clarify the issue of individuals' contributions. These discussions were also used to \nconfirm that the students continued to be satisfied with the concept hat an overall group \nmark be awarded. \nStudy 2 \nThe evaluation of the module made use of an anonymous questionnaire. Sixty-one out of \nsixty-four students taking the module completed the questionnaire. As with study 1, the \nstudents were asked to respond to each question with a score between one and four, where \none was 'very poor' and four was 'very good', or some equivalent wording appropriate to \nthe question. The questionnaire l ft a space for additional comments after each question. \nFor the ten-day period of the assignment there were around 400 postings in the online \ndebate. The quality of dialogue varied, of course, but student feedback via the module \nevaluation was generally good. Most of the students were reasonably satisfied with the \nWeb pages and conferencing used on the module. Table 1 shows the total student responses \nto eleven questions, by score category (one to four) and expressed as a percentage of the \n98 \nAlt j Volume 9 Number I\ntotal number of question responses (the total being 11 x 61 = 671). Note that the scores \nhave been rounded up. On a range of issues a total of about 67 per cent of students rated \nthe Web site and conference as good to very good, i.e. the sum of Score 3 and Score 4. \nScore I Score 2 Score 3 Score 4 \n5.7 27.4 43.4 23.2 \nTable 1: Student scores for all \nquestions as a percentage of the total \nresponses, \nQuestions 5 and 6 in the questionnaire lated to the online debate: \n5. The module conference was meant to give you an opportunity to get involved in a \ncritical debate. To what extent did it succeed in this aim? \n6. How useful did you find the ability to read the debates that took place in the threads \nfor other groups? \nTable 2 shows the total student responses to each of the above questions, by score and \nexpressed as a percentage of the total number of responses to that question, i.e. sixty-one. \nThe response to Question 5 shows that about 56 per cent of the students thought hat the \nconference was 'good' or 'very good' at meeting its aim of giving the students exposure to a \ncritical debate. The response to Question 6 shows that about 69 per cent of the students \nthought that the ability to read other students' debates was a 'good' or 'very good' \nopportunity for students. The response to Question 6 is a positive indicator that students \nmay in future welcome work in the area of vicarious learning. \nQuestion Score I Score 2 Score 3 Score 4 \n5 6.6 37.7 39.3 16.4 \nQuestion 6 1.6 29.5 42.6 26.2 \nTable 2: Student scores for specific \nquestions on critical debate (Q5) and \nvicarious learning (Q6). \nHowever, the generally positive results must be seen in the context of additional comments \nmade by students on the questionnaire. These comments highlighted the fact that a major \nproblem faced by the students was the constant crashing of the network. This in turn \nfrustrated students as they tried to use the conferencing facility. Furthermore, individual \ncomments made by students were not always positive with respect to the module Web site \nand online debate. \nKey issues in the implementat ion  of networked on-campus learning \nReflection on the implementation a d evaluation of these two studies led to the distillation \nof five key issues that seem markedly to influence the effective delivery of networked \ncollaborative l arning. Briefly, the five issues are: \n• the task goal set by the tutor; \n• managing the relationship between new and traditional pedagogical techniques, \nincluding the changing role of the tutor; \n99 \nTom Boyle and john Cook Online interactivity: best practice based on two case studies \n• managing student motivation; \n• the delivery infrastructure; \n• evaluation and feedback. \nA first important issue is the task goal set by the tutor. The learning targets may be extrinsic to \nthe online discussion or embedded within it. In the first study the networked communication \nwas used as a means to an end. The assessed learning targets were the outputs of the groups - \nin terms of online reports or the multimedia rtifacts created by the groups. The online \ncommunication supported students in their project planning, co-ordination and sharing of \nresources. Furthermore, online monitoring allowed the tutor to get a much clearer insight into \nthe ongoing project development processes within each group. This gave the tutor the \nconfidence to make the assessment truly group-based. The use of networked communication \nthus enabled the tutor more effectively to realize 'traditional' goals for this module. \nIn the second study the tutor wanted to introduce a new emphasis on 'problem seeking' \n(Cook, 2000). The aim was to engage students in forming the problems they would tackle \nas well as proposing tentative solutions. This required a strong emphasis on discursive \nargumentative skills. The learning targets were thus intrinsic to the online discussion. \nTutors may wish to introduce networked collaborative l arning for a variety of purposes. \nThe role of the students, the tutor and the appropriate means of assessirig effectiveness are \nall affected by this primary choice. \nThe second issue with introducing networked communication concerns managing the \nrelationship between traditional and new pedagogical techniques, including the activities of \nthe tutor. The first study used a mixture of traditional (e.g. textbook) and new resources in \nthe learning environment. The detailed exposition of underlying theory and concepts was \nconveyed through the textbook. The Web site acted to complement the book by providing \naccess to multimedia illustrations and interactive examples. This combined courseware was \nin turn embedded in a class organization that was augmented through the use of electronic \ncommunication. The tutor did not usually intervene in the project group discussions except \nto provide general information and reminders of deadlines. \nIn study 2 the tutors were much more actively involved in promoting the quality (and \nquantity) of the online discussions. The skills required to act as an active online tutor seem \ndifferent from those required in face-to-face tutorials (see JISC\/CALT, 2000, for detailed \nguidelines). Tutors need to have a clear picture of the skills required when responding to a \nlarge number of students in a time-constrained, assessed, online debate, and liaison with \nother tutors, when involved, also needs to be orchestrated. \nThe tutors in study 2 developed a tactic of 'targeting', where weak contributors were \ntargeted with questions in order to help get heir number of postings up to the required \nminimum. Online tutors need to be aware that it is advisable for tutors to mix their \ninteraction style between targeting low contributors with short questions, and longer \n'quality time' style interactions. In this study, one tutor concentrated on the short directive \npostings, while the other focused more on engaging in reflective dialogue. \nA third issue is thus the management of motivation and assessment for a particular student \npopulation. Both studies used the assessment criteria .to some degree to motivate students \nI00 \nAle-] Volume 9 Number I \nto contribute to the online discussion groups. In the first study a set of clear, staged \ndelivery targets was set to support he emergence of group discipline. These deliverables \nwere formally assessed. The knowledge that the tutor had access to all the onlihe \ndiscussions also seemed to have a marked motivating effect. Within this structured \nframework the M.Sc. students established healthy online discussions. The deliberate \nfostering of group communication bythe tutor was not an important consideration. \nThe second study also used assessment asa motivating factor. In this case, the assessment \nwas used to enforce contributions to the group discussions. The students were required to \nmake a minimum number of contributions, and marks were awarded explicitly for this \nparticipation. There are a number of differences between the two studies in the nature of \nthe task and the students. However, it is clear that tutors need to be aware of the powerful \nmotivating effect of extrinsic motivators (e.g. assessment structure) and use these appropri- \nately. \nA fourth issue is the importance of the delivery support environment. In the second case \nstudy it was found that Netscape Collabra did not assist the course tutors in tracking \nstudents who were not making contributions tothe online debate. This was done 'manually' \nand then a list of the names of non-contributors was posted on the noticeboard. By the end \nof the ten-day period for the assignment in case study 2, only six out of sixty-four students \nfailed to make a contribution to the conference. However, thisis labour-intensive. High-level \nVirtual Learning Environments (VLEs) like WebCT provide essential tools that automate \nthe process of tracking students. These free the tutor from time-intensive administrative \ntracking and free time for more constructive use of the tutor's time. \nThe final issue is the careful evaluation of the effectiveness of the delivery of on-campus \nnetworked learning. This evaluation underpins proposals for improved redesign. The \nfeedback from the first study could not be immediately used to improve networked \ncommunication the module as the tutor moved institutions. This experience, however, \nhelped influence some d sign choices in the second study despite its different focus. \nIn terms of the second case study, the evaluation i dicates that the approach taken to the \nassignment on the module gave the students the opportunity to engage in serious critical \ndebate. However, there is also room for enhancing the learning experience. A future aim for \nthis module could be to make student dialogues reusable, as a new kind of learning \nresource. Unfortunately, student attitudes, as revealed by a questionnaire, do not give us \nany indication as to the quality of the debate that took place. The marks allocated, and \nfeedback given, by the tutors for individual student contributions do give some measure of \nthe 'quality' of the interactions. However, such feedback will not reveal potentially useful \ninformation on the patterns of exchange between tutors and students. Future work intends \nto address this issue by conducting dialogue analysis of the conference interactions u ing a \ntechnique described in Cook (1998). \nReferences \nAtkins, M. (1993), 'Evaluating interactive technologies for learning', Journal of Curriculum \nStudies, 25, 33342. \nBoyle, T. (1997), Design for Multimedia Learning, London: Prentice Hall. \nI01 \nTom 8oyle andJohn Cook Online interactivity: best practice based on two case studies \nBoyle, T. (1999), 'Using the Web to enhance learning about multimedia design', Monitor, \nJournal of the CTI Centre for Computing, 11 (Winter 1999), 18-21. \nBoyle, T. and Payne, L. (1999), 'The design and evaluation of Web based multimedia \nlearning resources', Proceedings of the 7th Annual Conference on the Teaching of \nComputing, University of Ulster, August 1999. \nCollis, B. (1997), 'Pedagogical re-engineering: a pedagogical approach to course \nenrichment and redesign with the WWW', Educational Technology Review, 8 \n(Autumn\/Winter 1997). \nCook, J. (1998), 'Mentoring, metacognition and music: interaction analyses and \nimplications for intelligent learning environments', International Journal of Artificial \nIntelligence in Education, 9, 45-87. \nCook, J. (2000), 'Cooperative problem-seeking dialogues in learning', ITS 2000 - Fifth \nInternational Conference on Intelligent Tutoring Systems, 19-23 June 2000, Montreal, \nCanada. \nEngland, E. and Finney, A. (1999), Managing Multimedia.\" Project Management for \nInteractive Media, 2nd edn, Harlow: Addison-Wesley. \nJISC\/CALT (2000), 'Effective networked learning in higher education: notes and guide- \nlines', available from h ttp :llcsalt, lanes, ac. ukljiscladvice, htm. \nLipman, M. (1991), Thinking in Education, New York: Cambridge University Press. \nMcKendree, J., Stenning, K., Mayes, T., Lee, J., and Cox, R. (1998), 'Why observing a\ndialogue may benefit learning', Journal of Computer Assisted Learning, 14 (2), 110-19. \n102 \n"}