{"doi":"10.1017\/S0954422407733073","coreId":"65507","oai":"oai:dro.dur.ac.uk.OAI2:5622","identifiers":["oai:dro.dur.ac.uk.OAI2:5622","10.1017\/S0954422407733073"],"title":"A systematic review of population and community dietary interventions to prevent cancer.\\ud\n\\ud","authors":["Thorogood, M.","Simera, I.","Dowler, E.","Summerbell, C.D.","Brunner, E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-06-01","abstract":"Diet is an important factor in the causation of cancer. Previous systematic reviews of one-to-one interventions to encourage dietary change have found that such interventions can achieve modest improvements in diet. However, such interventions are resource intensive and unlikely to be good value for money at a population level. Interventions that address groups, communities or whole populations may be less resource intensive and effect change in a wider population. We report a systematic review of such interventions. We set wide inclusion criteria, including before-and-after studies and studies with a non-randomized comparison group as well as randomized trials. We found eighteen studies based in the community, seventeen based on worksites, five based in churches and one based in a supermarket. Interventions which targeted fruit and vegetable intake were most likely to be successful, particularly in worksites and churches. There was also evidence of small positive effects on reducing fat intake in worksites and churches. Overall the community-based interventions showed little effect. The studies included in the present review were generally poorly reported. Dietary changes are reported in the relatively short-term studies reviewed here but may not be sustained in the long term. The effects that we have identified are small but the reach is potentially very wide, in some cases as wide as a whole country. The cost effectiveness of such strategies remains to be evaluated","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65507.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5622\/1\/5622.pdf","pdfHashValue":"67c3ae843a8c0b4c2927b45b18ee3542b7fcc526","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5622<\/identifier><datestamp>\n      2013-07-10T08:21:54Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A systematic review of population and community dietary interventions to prevent cancer.\\ud\n\\ud\n<\/dc:title><dc:creator>\n        Thorogood, M.<\/dc:creator><dc:creator>\n        Simera, I.<\/dc:creator><dc:creator>\n        Dowler, E.<\/dc:creator><dc:creator>\n        Summerbell, C.D.<\/dc:creator><dc:creator>\n        Brunner, E.<\/dc:creator><dc:description>\n        Diet is an important factor in the causation of cancer. Previous systematic reviews of one-to-one interventions to encourage dietary change have found that such interventions can achieve modest improvements in diet. However, such interventions are resource intensive and unlikely to be good value for money at a population level. Interventions that address groups, communities or whole populations may be less resource intensive and effect change in a wider population. We report a systematic review of such interventions. We set wide inclusion criteria, including before-and-after studies and studies with a non-randomized comparison group as well as randomized trials. We found eighteen studies based in the community, seventeen based on worksites, five based in churches and one based in a supermarket. Interventions which targeted fruit and vegetable intake were most likely to be successful, particularly in worksites and churches. There was also evidence of small positive effects on reducing fat intake in worksites and churches. Overall the community-based interventions showed little effect. The studies included in the present review were generally poorly reported. Dietary changes are reported in the relatively short-term studies reviewed here but may not be sustained in the long term. The effects that we have identified are small but the reach is potentially very wide, in some cases as wide as a whole country. The cost effectiveness of such strategies remains to be evaluated.<\/dc:description><dc:subject>\n        Cancer prevention<\/dc:subject><dc:subject>\n         Dietary interventions<\/dc:subject><dc:subject>\n         Population interventions.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Nutrition research reviews, 2007, Vol.20(1), pp.74-88 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5622<\/dc:identifier><dc:identifier>\n        issn:0954-4224<\/dc:identifier><dc:identifier>\n        issn: 1475-2700<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0954422407733073<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5622\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0954422407733073 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5622\/1\/5622.pdf<\/dc:identifier><dc:rights>\n        Copyright © The Author 2007. This paper has been published by Cambridge University Press in \"Nutrition research reviews\" (20: 1 (2007) 74-88) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=1053780\\ud\n\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0954-4224","issn:0954-4224","issn: 1475-2700"," 1475-2700"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Cancer prevention","Dietary interventions","Population interventions."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nThorogood, M. and Simera, I. and Dowler, E. and Summerbell, C. and Brunner, E. (2007) ’A systematic\nreview of population and community dietary interventions to prevent cancer.’, Nutrition research reviews., 20\n(1). pp. 74-88.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0954422407733073\nPublisher’s copyright statement:\nCopyright The Author 2007. This paper has been published by Cambridge University Press in ”Nutrition research\nreviews” (20: 1 (2007) 74-88) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=onlineaid=1053780\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n24 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nThorogood, M. and Simera, I. and Dowler, E. and Summerbell, C. and Brunner, E. (2007) 'A \nsystematic review of population and community dietary interventions to prevent cancer.', \nNutrition research reviews., 20 (1). pp. 74-88. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S0954422407733073  \n \nPublisher’s copyright statement: \nCopyright © Cambridge University Press 2007. This paper has been published by \nCambridge University Press in \"Nutrition research reviews\" (20: 1 (2009) 74-88) \nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=1053780 \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nA systematic review of population and community dietary interventions\nto prevent cancer\nMargaret Thorogood1*, Iveta Simera2, Elizabeth Dowler3, Carolyn Summerbell4 and Eric Brunner5\n1Warwick Medical School, University of Warwick, Coventry CV4 7AL, UK\n2Centre for Statistics in Medicine, University of Oxford, Linton Road, Oxford OX2 6UD, UK\n3Department of Sociology, University of Warwick, Coventry CV4 7AL, UK\n4School of Health, University of Teesside, Middlesbrough TS1 3BA, UK\n5Department of Epidemiology and Public Health, University College London, Gower Street Campus, 1-19 Torrington Place,\nLondon WC1E 6BT, UK\nDiet is an important factor in the causation of cancer. Previous systematic reviews of one-to-one\ninterventions to encourage dietary change have found that such interventions can achieve modest\nimprovements in diet. However, such interventions are resource intensive and unlikely to be good\nvalue for money at a population level. Interventions that address groups, communities or whole\npopulations may be less resource intensive and effect change in a wider population. We report a\nsystematic review of such interventions. We set wide inclusion criteria, including before-and-\nafter studies and studies with a non-randomized comparison group as well as randomized trials.\nWe found eighteen studies based in the community, seventeen based on worksites, five based in\nchurches and one based in a supermarket. Interventions which targeted fruit and vegetable intake\nwere most likely to be successful, particularly in worksites and churches. There was also evidence\nof small positive effects on reducing fat intake in worksites and churches. Overall the community-\nbased interventions showed little effect. The studies included in the present review were generally\npoorly reported. Dietary changes are reported in the relatively short-term studies reviewed here\nbut may not be sustained in the long term. The effects that we have identified are small but the\nreach is potentially very wide, in some cases as wide as a whole country. The cost effectiveness of\nsuch strategies remains to be evaluated.\nCancer prevention: Dietary interventions: Population interventions\nIntroduction\nIt has been estimated that diet accounts for 30% of all\ncancers in developed countries and up to 20% in developing\ncountries. It is important, therefore, to understand how\ndietary interventions can help to reduce the risk of cancer. A\nrecent review by Key et al.1 has summarized the evidence on\nthe dietary causation of cancer. The review concluded that\ndietary factors which convincingly increase cancer risk\ninclude overweight and obesity, intake of alcoholic\nbeverages, aflatoxin and highly salted (Chinese-style) fish.\nHigh intakes of preserved meat and red meat, salt-preserved\nfoods and salt, and consumption of very hot drinks and\nfoods probably increase some kind of cancers. Dietary\nfactors which probably reduce cancer risk include fruit and\nvegetables (F&V). Their recommendations in relation to\ncancer prevention are listed in Table 1 and, in most respects,\nare very similar to recommendations for reducing the risk of\nvascular diseases, including IHD and stroke.\nThe potential for reducing cancer and vascular risk through\neffecting changes in diet at community or population level is\nconsiderable. The question is how best to achieve the desired\nshift in dietary patterns and food-related behaviours, in terms\nof ‘what interventions work?’. Many evaluations of healthy\neating interventions have been published and there are\nalready a number of systematic reviews2–11.\nA recent Cochrane Collaboration review concludes that\nindividual-based interventions, such as dietary advice\noffered to healthy adults, can achieve modest improvements\nin diet and cardiovascular risk factors12. However, to our\nknowledge, no recent systematic review has been carried out\nof programmes aimed at group-, community- and\npopulation-level intervention, and it is these interventions\nthat are the subject of the systematic review described here.\nAbbreviation: F&V, fruit and vegetable.\n*Corresponding author: Dr Margaret Thorogood, fax þ44 24 7657 4509, email margaret.thorogood@warwick.ac.uk\nNutrition Research Reviews (2007), 20, 74–88\nq The Authors 2007\nDOI: 10.1017\/S0954422407733073\nMethods\nThe objective of the present review was to systematically\nidentify and critically appraise published systematic reviews\nand research papers reporting interventions that evaluate\ngroup, community and population dietary prevention\nprogrammes for cancer prevention. We carried out a\nsystematic search for relevant papers, extracted details of\nthe papers into an agreed proforma and then synthesized the\nresults in a narrative form. Where possible we also provided\na quantitative summary of effect sizes.\nIncluded studies\nWe included studies which evaluated group- or population-\nlevel dietary interventions to reduce cancer risk, which\nreport results at least 6 months from baseline, and which\nemployed one of the following study designs:\n(a) randomized controlled trials;\n(b) quasi-experimental studies and studies with a\ncomparison group;\n(c) uncontrolled before-and-after studies (pre-test–post-\ntest cohort studies).\nThe geographical focus of the present review is North\nAmerica, Europe, Australia and New Zealand.\nGroup- or population-level interventions may contain\nelements which are aimed at individuals, for example, take-\nhome leaflets or recipes, and we included studies of\ninterventions where there was some activity aimed at\nindividuals if the main focus of the intervention was at\ngroup level. The intervention design strategy had to focus on\nchanges at group, community or population level, such that\nsampling, selection of control groups (if present), and the\nmain delivery of the intervention were at a group level. We\nincluded studies carried out in the general population (in\ntowns, regions, countries), local communities, churches,\nworkplaces, catering facilities and retail outlets. We did\nnot include programmes delivered only through healthcare\nor school facilities. The ‘group’ may be opportunistic\n(for example, workplace), or self-selected (for example,\nchurch members) or geographic (all households living\nwithin an administrative area). Dietary interventions may\nalso be targeted at groups defined by socio-economic or\ndemographic characteristics, for example, a particular\nethnic group, age group, income band or type of housing.\nTypes of participants\nWe included studies with healthy adult participants (age\n.16 years) or communities where children were part of a\nhousehold. We excluded studies targeting individuals at\nincreased or high risk only (for example, cardiovascular\npatients, obese patients, cancer patients) or children only\n(school settings).\nTypes of interventions\nWe included studies with any population- or community-\nbased intervention encouraging dietary change believed to\nprevent cancer. We used the dietary recommendations for\ncancer prevention listed in Table 1, and included any\ninterventions that targeted at least one of those recommen-\ndations. Studies with multiple interventions aiming to\ninfluence factors other than diet (for example, smoking,\nphysical activity, lifestyle changes) were included if they\nprovided a clear description of activities relating to the\nnutrition component and sufficient dietary outcome data.\nWe excluded interventions aimed solely at reducing obesity,\nbut where weight reduction was a part of a multiple\nintervention including other dietary interventions related to\nreducing the risk of cancer we included the study.\nOutcome measures\nIn the present review we report only on those outcomes of\nthe interventions that are related to dietary change to prevent\ncancer. We also aimed to include information on cancer\nincidence and on the costs of interventions but we did not\nfind any such information reported. The outcome measures\nthat we identified were of two types: independently\nmeasured outcomes (such as sales data from a canteen)\nand self-reported data (such as information from a FFQ).\nSome studies report a wide range of outcomes, but most of\nthe data we found focus on one or more of four dietary\noutcomes relating to cancer prevention: consumption of\nF&V, fat, fibre and red meat. The present review therefore\nfocuses on these four outcomes.\nLiterature search strategy\nWe identified studies through systematic searching of\nelectronic databases. We searched MEDLINE, EMBASE,\nCochrane Library, CINAHL, PsychINFO, CAB Health,\nSocial Science Index, Eric, SIGLE, Health Technology\nAssessment database, the Database of Promoting Health\nEffectiveness Reviews (DoPHER), Department of\nHealth data and King’s Fund database (HMIS) and Health\nDevelopment Agency database (HDA website and Health\nEducation Authority publication). As earlier good-quality\nreviews had searched the literature up to 1995, we limited\nTable 1. Dietary recommendations in relation to cancer prevention1\n1 Maintain BMI in range of 18·5–25 kg\/m2, and avoid weight\ngain in adulthood\n2 Engage in regular physical activity\n3 Consumption of alcoholic beverages is not recommended: if\nconsumed, do not exceed two units per d (one unit is\nequivalent to approximately 10 g alcohol)\n4 Minimize exposure to aflatoxin in foods\n5 Highly salted fish should only be eaten in moderation,\nespecially during childhood. Overall consumption of salt-\npreserved foods and salt should be moderate\n6 Have a diet which includes at least 400 g total fruit and\nvegetables per d\n7 Meat: moderate consumption of preserved meat (for\nexample, sausages, salami, bacon, ham etc) and red\nmeat (for example, beef, pork, lamb). Poultry and fish\n(except highly salted fish) have been studied and found not\nto be associated with increased cancer risk\n8 Do not consume foods or drinks when they are at a very hot\n(scalding hot) temperature\nDietary interventions to prevent cancer 75\nour searches to the period January 1994 to August 2005.\nA combination of subject headings (MESH) and free text\nterms (including alternative spellings) was used for all areas.\nNo language restrictions were imposed. We did not\nundertake hand searching of any journals. We contacted\nexperts in the field for information about new or\nunpublished projects. We checked the reference lists of\nselected papers for further studies. Records identified from\nsearches were downloaded and managed using EndNote\nbibliographic software.\nSelection of studies\nTwo reviewers independently screened all identified titles\nand, where available, abstracts for potential relevant studies.\nTwo reviewers then independently evaluated each full text\npaper against predefined inclusion criteria, using an ‘in\/out\nform’. Differences between reviewers were resolved by\ndiscussion or in consultation with a third reviewer.\nData extraction\nOnce a list of included studies was agreed, two reviewers\n(not necessarily the same individuals who had included the\nstudies at the previous stage) independently extracted data\nfrom the included studies using a standard form. We\nextracted the following details:\n(a) study design;\n(b) description of study settings and population (includ-\ning data on measures of deprivation);\n(c) description of all intervention and control pro-\ngrammes, including any theoretical framework,\nmedium of intervention, and its duration;\n(d) outcomes;\n(e) measurement tools;\n(f) data analysis, attrition and survey response rates,\nnumber of outcome assessments, length of follow-up,\nand any negative or adverse effects.\nWhen there were not enough data for our purposes we\ncontacted the authors for further information. If a study was\npublished in more than one paper, we retrieved data from all\navailable papers. Any disagreement between reviewers was\nresolved by discussion.\nQuality evaluation\nTwo reviewers independently evaluated the methodological\nquality of studies, which included:\n(a) for randomized controlled trials – method and unit of\nrandomization, unit of analysis, clarity of description\nof methodology, including sampling for surveys,\nanalysis method, attrition and survey response rate;\n(b) for studies with a comparison group – unit of\nanalysis, clarity of description of methodology\nincluding sampling for surveys, group comparability,\nanalysis method, attrition and survey response rate;\n(c) for before-and-after studies – clarity of description of\nmethodology, before-and after-data reported for all\ngroups on all outcomes.\nData analysis\nWe grouped studies according to their settings. The mode of\nanalysis varied with study design. Where data were\nprovided for more than one time point, we included only\nthe results from the longest follow-up.\nRandomized controlled trials and studies with a comparison\ngroup. The net effect was calculated as the difference\nbetween the change in the control group and the change in\nthe intervention group. Outcomes were treated as continu-\nous variables. All the randomized trials identified had been\ncluster randomized and appropriately analysed.\nMeta-analysis was only possible in one case: for F&V\nintake in worksite studies. Weighted mean differences and\n95% CI were produced. The Cochrane Collaboration\nsoftware RevMan 4.2 (Metaview) was used to perform the\nanalysis. The sign of the mean change for both the\nintervention and control groups has been changed so\nthe direction of effect always shows the change favouring\nintervention on the left. Where the standard deviation of\nchanges was not reported in a paper, we used the method\nrecommended in the Cochrane Collaboration Handbook13\nto make allowance for within-participant correlation from\nbaseline to follow-up measurements, and estimated the\nstandard deviation of the change. In a few cases even this\nwas not possible and the studies appear on the graphs with\nthe note that the weighted mean difference is not estimable.\nBecause of substantial heterogeneity the summary statistic\nwas calculated using a random-effects model.\nWhen meta-analysis was not possible the net effect was\ncalculated for individual studies and displayed graphically\non forest plots, without a summary statistic. The number of\nparticipants (n) given on the forest plots represents the\nnumber of individuals analysed in the various studies.\nUncontrolled before-and-after studies. We report the net\neffect as the difference between the follow-up measurement\nand the baseline value.\nResults\nWe identified 19 570 titles and considered 227 abstracts\npotentially eligible for inclusion. After assessment of the\nfull papers ten systematic reviews and forty-nine primary\nstudies were selected. A further eight primary studies were\nexcluded during data extraction or following correspon-\ndence with the authors, leaving forty-one studies in the\nreview (Fig. 1).\nEarlier systematic reviews\nWe identified ten systematic reviews, which systematically\nsearched databases using predefined inclusion and exclusion\ncategories and which evaluated nutrition interventions in\nvarious settings including communities, workplaces, super-\nmarkets and catering. One important source is a series of\nreviews published by the former UK Health Education\nAuthority covering dietary intervention in the general\npopulation3, workplaces5, minority ethnic groups7, elderly\nindividuals4 and women of childbearing age6. Table 2 shows\nM. Thorogood et al.76\nthe number of studies in each of the systematic reviews that\nconsider interventions in groups, communities or whole\npopulations.\nThe review by Roe et al.3 summarizes the results of\nseventy-six interventions to promote healthy eating among\nthe general population published between 1985 and 1996.\nThe studies employed a wide range of intervention methods,\ntarget populations and outcome measures. The authors\ncomment on the serious limitations of design, description of\nmethodology and reporting of outcomes in many studies.\nThe review includes sixteen evaluations of community\ninterventions: ten large-scale multi-factorial before-and-\nafter studies (including The North Karelia Project,\nPawtucket Heart Health Program, Stanford Five-City\nProject and Minnesota Heart Health Project) and six\nrandomized trials of intensive dietary interventions in\nsmaller populations. The majority of the interventions\n(twelve of the sixteen studies) were based on a theoretical\nframework, mainly using social learning theory (seven of\nthe sixteen studies). Change in fat intake is reported in ten of\nthe sixteen studies. Six studies reported a decrease in fat\nconsumption in the range of 5–10% of energy and four\nstudies found no difference in fat intake. F&V consumption\nis reported in only one study, which did not find any positive\neffect.\nThe review included eight studies in supermarket settings,\nof which four were considered good-quality studies\ninvolving twenty to forty stores per study, and two of\nthose showed a positive effect on food purchases or sales.\nThere was little or no follow-up after the end of\ninterventions, and from the limited evidence available it\nappeared that interventions only had an effect for as long as\nthe intervention was in place.\nTen studies evaluated interventions in catering settings,\nall judged as mediocre quality. Positive effects were\nreported in sales of F&V (one study), decreased sales of\nconfectionery and crisps when moved away from tills (two\nstudies), and increased sales of low-fat meals and salads\nwhen labelled with appropriate signs (five studies). Point-\nof-purchase promotion led to an increase in sales of 2–12%\nbut the effect generally lasted only as long as the\nintervention was in place. The longer-term effect on food\nchoices was not assessed.\nRoe et al.3 argued that the following features of\ninterventions were associated with the most sustained\npositive effect on diet-related outcomes: a content which\nfocused only on diet, or on diet and exercise; an intervention\nstrategy based on theoretical frameworks rather than simple\ninformation giving; some degree of personalization of\nintervention characteristics; provision of feedback on\nindividual changes in behaviour; multiple contacts over a\nsubstantial period of time; interpersonal support. In the\nsupermarket and catering settings, the greatest effects were\nreported with the use of simple signs identifying healthier\nchoices, food composition changes and changes in food\navailability.\nA systematic review of health promotion interventions in\nthe workplace includes fifty outcome evaluations published\nup to 19975. Fifteen of the fifty included studies were judged\nto be sound, of which six targeted healthy eating. Three of\nthe six studies found no beneficial effect on fat intake or\noverall dietary habits. Two studies reported a decrease in fat\nconsumption and increase in F&V intake at 12 months’\nfollow-up. The authors of the review could not identify any\nclear trends in effectiveness in relation to certain types of\ninterventions.\nWhite et al.7 summarize the literature on interventions in\nindividuals from minority ethic groups. There were two\ncommunity-wide dietary programmes which both used a\nquasi-experimental design with a minimum of 1 year of\nFig. 1. Progress through the stages of a review.\nTable 2. Number of studies evaluating interventions at group, community or population level aiming at dietary\nchange in each systematic review\nReference Total\nCommunity\nor population Worksite Church\nRetail\nor supermarket\nRoe et al. (1997)3 34 16 10 – 8\nPeersman et al. (1998)5 6 – 6 – –\nWhite et al. (1998)7 4 4 – – –\nGlanz et al. (1996)2 10 – 10 – –\nJaner et al. (2002)11 7 – 7 – –\nCiliska et al. (2000)9 15 15 – – –\nBowen & Beresford (2002)10 33 12 16 1 4\nBrug et al. (1999)8 8 – – – –\nFletcher & Rake (1998)4 14 14 – – –\nVan Teijlingen et al. (1998)6 7 7 – – –\nDietary interventions to prevent cancer 77\nfollow-up. One intervention to increase low-fat milk\nconsumption was ineffective. An intervention to decrease\nfat consumption was partly effective. The reviewers\nconcluded that there is only limited and inconclusive\nevidence for the effectiveness of community-wide\ninterventions.\nThree other reviews concentrate on worksite health\npromotion programmes. Glanz et al.2 reviewed ten\neducation programmes relating to nutrition published\nbetween 1980 and 1995. Six studies used group education:\neither alone (two studies), in combination with individual\ncounselling (two studies) or in combination with cafeteria\nprogrammes (two studies). Four studies were solely\ncafeteria based. Only one of the ten studies randomized\nworksites. The authors of the review commented that it was\nimpossible to determine whether any observed positive\nchanges had been the results of interventions, of self-\nselection or self-reporting bias, or of secular trends in\ngeneral populations.\nA review of worksite interventions targeting major cancer\nrisk factors included nutritional interventions, and included\nboth individual and group interventions11. The aims of\nincluded interventions were commonly to increase con-\nsumption of fruits, vegetables and high-fibre foods, or to\ndecrease fat intake. Statistically significant increases in\nvegetable intake were observed in six of seven relevant\nstudies. An increase in vegetable servings per d is reported\nin three of the seven studies, with ranges from 0·09 to 0·19\nservings. Five of the studies also reported on fruit intake,\nand four found statistically significant increases, ranging\nfrom 0·11 to 0·24 servings per d. In three studies reporting\non total F&V intake, increases ranged from 0·18 to 0·5\nservings per d. Ten studies reported changes in fat intake\nand six of these found a statistically significant fall in intake.\nHowever, the size of the falls was small; the largest fall\nreported is 3·0% energy from fat. An increase in fibre intake\nranging from 0·005 to 0·406 g\/1000 kJ (0·02 to 1·7 g\/\n1000 kcal) was observed in three out of five relevant trials.\nWorksite trials involving food environmental interventions,\nsuch as changes in the worksite canteen or vending\nmachines, were no more effective than those without such\nenvironmental components. An increased duration of\nintervention, multiple contacts with participants, tailored\ninterventions, incentives, and continuous support were all\nseen to increase effectiveness, but the reviewers commented\nthat the data were not consistent.\nCiliska et al.9 reviewed fifteen studies of community-\nbased interventions aiming to increase F&V consumption,\nincluding two worksite-based interventions, and one\ncommunity-based programme focused on adults. The two\nworksite interventions achieved positive results in at least\none reported outcome. The first trial found a statistically\nsignificant difference in overall F&V consumption\n(P , 0·001); the intervention group achieved an increase\nof 0·2 servings per d compared with the increase of 0·02\nservings per d in the control group. The second trial reported\nan increase in vegetable consumption in the intervention\ngroup by 6·8 servings per month compared with a fall by 1·6\nservings per month in the control group (P , 0·02). The\nonly community-based programme included14 did not\nreport any positive changes. The authors of the review\nconcluded that the most effective interventions gave clear\nmessages about increasing F&V consumption; incorporated\nmultiple strategies that reinforced the messages; involved\nthe family; were more intensive; were provided over a\nlonger period of time, rather than one or two contacts; and\nwere based on a clear theoretical framework.\nA systematic review of dietary interventions published up\nto 2001 included thirty-eight interventions focused on\ngroups of adults rather than individuals. Fourteen of these\nstudies also met the inclusion criteria and were included in\nthe present review. Of the thirty-eight studies, sixteen were\nbased in worksites, and twelve in the community or general\npopulation. There were also four point-of-purchase studies,\nfour primary care-based studies, one study targeting\nreligious organizations and one study targeting families10.\nThe reviewers did not place any restrictions on the design of\nincluded studies. Consistent positive changes were observed\nin most of the worksite studies, but the effect size was often\nsmall, and follow-up was short term. Other community\nsettings, such as religious organizations and grocery stores,\nhad mixed records of success. The limitations of study\ndesigns and evaluation methods prevented the authors of the\nreview from drawing any firm conclusions.\nBrug et al.8 summarized limited inconclusive evidence on\ncomputer-tailored nutrition education from the findings of\neight studies.\nNone of these systematic reviews reached firm conclusions.\nMost interventions that were reviewed employed complex\nintervention strategies and a variety in evaluation designs,\nmaking it difficult to synthesize the data. However, there are\nsome characteristics of successful interventions that are noted\nrepeatedly in the reviews, and these are summarized inTable 3.\nThe use of a theoretical framework as a basis of intervention\nactivities is often discussed. Roe et al.3 stated that an\nintervention model incorporating behavioural theories and\ngoals rather than one based on the provision of information is\nmore likely to produce sustained effect on diet-related\noutcomes. Ciliska et al.9 also concluded that themost effective\ninterventions to increase F&V consumption in the USAwere\nbased on a theoretical framework,whileBowen&Beresford10\nnote the lack of information on the use of theoretical\nframeworks in individual studies.\nPrimary studies\nWe included forty-one primary studies. Table 4 shows the\ncountry of origin and setting of the interventions.\nTable 3. Characteristics of successful interventions as identified in\nthe systematic reviews\nAn intervention that focused only on diet, or diet and exercise\nDelivery of clear messages with multiple strategies to reinforce\nthem\nSome degree of intervention personalization to match\nindividual characteristics\nProvision of feedback to individuals on their changes in behaviour\nA longer duration of intervention, with multiple contact with\nparticipants\nProvision of incentives, and continuous support\nSimple signs identifying healthier choices, changes in food\navailability and composition, point-of-purchase display policies in\nsupermarket and catering settings\nM. Thorogood et al.78\nThe majority of studies, twenty-eight (68%), were\ncarried out in North America14–40 (DJ Bowen, personal\ncommunication), ten (24%) were carried out in Europe41–50\nand three (7%) in Australia and New Zealand51–53.\nEighteen studies targeted healthy adults in the\ngeneral population14–17,26–28,33,37,39,41–46,49,51. Seventeen\nstudies targeted worksite\nemployees18,19,21 – 23,25,29,31,32,34,35,38,47,48,50,52,53. Five\nstudies targeted adult church members20,30,36,54 (DJ\nBowen, personal communication) and one study was carried\nout in a food retail setting24. The intervention mechanisms\nemployed included: educational sessions; cooking demon-\nstrations; point-of-purchase displays; brochures, posters and\nother printed materials; videos; mass media advertising and\neducational programmes. Dietary outcomes reported\nincluded self-reported intake of fat, fibre, F&V, red meat;\nvarious behavioural scores related to healthy eating and sales\ndata from supermarkets and worksite cafeterias. Table 5\nsummarizes the main results.\nCommunity or population studies\nTwelve of the eighteen interventions in the general\npopulation are non-randomized studies with a comparison\ngroup15,26–28,33,39,41,43–45,49,51, five use a before-and-after\nevaluation design14,17,37,42,46, and one study is a cluster-\nrandomized controlled trial16, where community is the unit\nof randomization and analysis. There are three state or\nnationwide studies: two assessing the impact of programmes\npromoting F&V consumption in California17 and in the\nwhole of the USA37, and one evaluating HeartBeat Wales44.\nThe most commonly set dietary goals, apart from\n‘improving overall dietary behaviour’ which featured in\nseven studies, were a decrease in fat consumption (five\nstudies) and an increase in F&V consumption (three\nstudies). Studies varied greatly in the length of their\nintervention programmes and follow-up periods. The most\ncommon activities were the use of printed materials,\nsupermarket events such as store tours, food product\npromotion, purchase coupon distribution, food labelling,\ncooking demonstrations, distribution of recipes, educational\nsessions, and engagement of the community through\ncommunity leaders and local businesses. Mass media\nwere widely used, including local newspapers, television\nand radio.\nFruit and vegetable intake. Very few studies provide\ndetails of what was included in the definition of F&Vor the\nsize of one serving. Changes in F&V consumption are\nreported in six studies14,16,17,37,46,51. Three studies used a\nbefore-and-after design17,37,46 and report change in servings\nper d. Foerster et al.17 report the 2-year results of the\nCalifornian ‘5 a Day for Better Health’ campaign promoting\nconsumption of F&V. There was no significant change in\ncombined F&V consumption, although intake of vegetables\nincreased by 0·2 servings per d (P , 0·05), while fruit\nintake fell by a non-significant 0·1 servings per d. Stables\net al.37 report a 6-year evaluation of the national US ‘5 a\nDay for Better Health’ F&V promotion, which found an\nincrease of 0·23 servings per d (P ¼ 0·007). Wrigley et al.46\nassessed the impact of a new supermarket on F&V\nconsumption in a deprived community. There was no\noverall increase in F&V consumption, although there was an\nincrease in F&V consumption in the 45% of respondents\nwho had switched to using the new store (an increase of 0·23\nservings per d; P ¼ 0·03).\nThree studies report changes in scores based on F&V\nconsumption. Two 5-year community-based interventions16\nreport no significant effect in one community and a\nsignificant fall in F&V consumption (P , 0·01) in the\nother community, in comparison with control communities.\nA 5-year intervention in a low-income rural area in\nMissouri, USA had no significant effect on the percentage of\nrespondents consuming five or more portions per d14.\nA 2-year Heart Health Programme in a rural community in\nVictoria, Australia also had no effect on consumption of\neither fruit or vegetables51.\nFat intake. Seven studies report changes in fat intake. An\nintervention in California focused on the community and\nincluded education campaigns and initiatives in grocery\nstores in two communities. There were seven comparison\ncommunities. The researchers report no significant decrease\nin percentage of energy from fat16. Three non-randomized\nstudies with comparison groups, all from the Nether-\nlands41,43,49, report fat intake using different scoring\nsystems. There was no significant difference in fat\nconsumption in Maastricht after 3 years of a complex\nmultifactorial intervention which included encouraging a\nreduction in fat intake49. The ‘Fat Watch’ campaign in\nAlkmaar used a variety of activities mainly based on written\nmass media information but also using events such as\nTable 4. Country of origin and settings of included primary studies\n(Number of studies)\nCountry Total\nCommunity\nor population Worksite Church\nRetail\nor supermarket\nUSA 25 8 11 5 1\nThe Netherlands 4 3 1 – –\nUK 3 2 1 – –\nCanada 3 2 1 – –\nAustralia 2 1 1 – –\nNew Zealand 1 – 1 – –\nNorway 1 1 – – –\nDenmark 1 – 1 – –\nCzech Republic 1 1 – –\nTotal 41 18 17 5 1\nDietary interventions to prevent cancer 79\nTable 5. Summary of results for the main dietary outcomes*\nIntervention setting. . . Community and population studies Worksite studies Church studies\nRetail\nand super-\nmarket\nstudies\nF&V intake\nF&V (servings\/d) Three studies (B-A). Two studies\nwith NS findings. One study found\nincrease of 0·23 servings\/d\nEight RCT (eleven interventions). Results pooled in a meta-analysis\n(random-effects model), WMD 0·18 (95 % CI 0·04, 0·31)\nservings\/d; all but one study achieved results in a positive\ndirection\nThree studies (two RCT, one\nComp). Increase in a range\nof 0·13–0·18 to 0·85 ser-\nvings\/d\nOne study\n(RCT);\nNS find-\nings\nF&V (scores) One study (RCT); NS findings – – –\nNumber of individ-\nuals consuming five\nor more servings\nper d\nOne study (B-A); NS findings – – –\nPercentage of indi-\nviduals changing\ntowards healthy\ndiet\nOne study (Comp); NS findings – – –\nFat intake\nFat (% energy) One study (RCT) (two interventions);\nNS findings\nThree studies (two RCT, one Comp). One study (Comp) with NS\nfindings. Two studies (RCT) with decrease of 0·37 to 1 %\nTwo studies (RCT); NS findings –\nFat (g\/d) – Three studies. One study (RCT) with negative effect – significant\nincrease of 0·7 g\/d with intervention. One study (RCT) with NS\nfindings. One study (Comp) with decrease of 1·3 g\/d\nOne study (RCT); decrease of\n5·8 g\/d\n–\nFat (various scores) Three studies (Comp). One study\nwith decrease in fat intake of 0·9\npoints. Two studies with NS find-\nings\nThree studies (six interventions). One study with decrease with the\nintervention. Two studies (five interventions) with NS findings\nOne study (RCT); NS findings –\nFibre intake\nFibre (g) One study (RCT); NS findings – – –\nFibre (g\/1000 kcal) – Two studies (RCT) with increase of 0·13–0·50 g\/1000 kcal (0·03–\n0·12 g\/1000 kJ)\nOne study (RCT); NS findings –\nFibre intake (score) – – One study (RCT); NS findings –\nRed meat intake Two studies (one RCT, one Comp);\nNS findings\n– – –\nRed meat (servings\/\nweek)\n– One study (B-A); NS findings – –\nPercentage of individ-\nuals changing\ntowards healthy\ndiet\n– One study (B-A); NS findings – –\nF&V, fruit and vegetables; B-A, before-and-after study; RCT, randomized controlled trial; WMD, weighted mean difference; Comp, study with comparison group.\n* The intervention effect is given as the difference in change between the intervention and control group (for RCT and Comp), or the difference between pre- and post-study measurements (for B-A studies). Only significant\nchanges are quoted.\nM\n.\nT\nh\no\nro\ng\no\no\nd\net\na\nl.\n8\n0\nsupermarket tours to encourage a reduce intake of fat. The\nevaluation found no difference in fat consumed between the\nintervention and control communities at the 10-month\nfollow-up43. Another intervention, The Healthy Bergeyk\nprogramme, involved a multi-factorial health promotion\ninitiative in which healthy eating was one of four targets.\nAgain, the intervention design used a variety of activities\nmainly based on written mass media information and also\nused small group activities. There was a significantly greater\n(P , 0·001) fall in the ‘fat score’ in the intervention\ncommunity compared with the control community41.\nFibre intake. The intervention in California described\nearlier also reported fibre intake in the intervention and\ncontrol communities and found no statistically significant\ndifference16.\nRed meat intake. The intervention in California described\nearlier also reported red meat intake in the intervention and\ncontrol communities and found no statistically significant\ndifference16. There was no difference in frequency of eating\nred meat between control and intervention communities in a\nstudy of intervention to decrease high-fat food intake in\nSouth Carolina, USA15.\nWorksite studies\nTen of the seventeen studies set in worksites were randomized\ncontrolled trials, with worksite as the unit of randomiz-\nation18,22,23,29,31,34,35,38,50,52. Four studies used non-random-\nized comparison groups19,21,47,53, and three used a before-and-\nafter design25,32,48. One study included fewer than 100\nparticipants38, while five included more then 2000\nworkers18,23,34,35,52. In three studies the participants were\nmostly women, while eight studies involved mostly men, and\nthe rest involved roughly equal numbers ofmenandwomen. In\neight studies the participants are described as being mainly in\nblue-collar occupations21,22,29,31,32,34,38,53. Three studies\ndescribe participants as mainly white-collar workers25,47,50,\nand employees in six studies aremixed socio-economic status.\nThere was frequent use of printed materials (for example,\nposters, brochures, leaflets), educational sessions and\npresentations, self-help materials, various activities\n(games, contests), worksite cafeteria events (displays,\npromotions, menu changes) and availability of healthy\nvending machine choices. Many interventions used peer\nleaders. The most common dietary goals were overall\nimprovements in diet (eight studies), increased consumption\nof F&V (seven studies), and decreased consumption of fat\n(six studies). The most frequently used method of assessing\ndietary intake was a FFQ. The duration of the intervention\nprogrammes varied from 3 months to more than 1 year.\nFruit and vegetable intake. Eight randomized controlled\ntrials, with eleven intervention arms, evaluated interventions\nto increase consumption of F&Vmeasured in servings per d.\nWe have summarized the results of these trials in a meta-\nanalysis, which shows an increase in consumption of 0·18\nservings\/d. Only one study, a large Australian trial, does not\nreport an increase in consumption51 (JM Simpson, personal\ncommunication). The smallest trial recruited only\nthirty-three fire-fighters and was an outlier38, so we\nperformed a sensitivity analysis without this study. The\noverall effect did not change dramatically (Fig. 2).\nOne study compared consumption in servings per d at an\nintervention and control worksite and reported a signifi-\ncantly greater increase in the proportion of respondents\nreporting two to three daily servings of vegetables, but no\ndifference in fruit consumption at the intervention work-\nsite53. Two studies used a before-and-after design to\nevaluate interventions32,48. One small study of a single\nworksite found a small (0·25) but significant increase in\nservings of F&V at 9 months32, while another, larger, study\nof five worksites found significant increases in the sales of\nF&V (g per customer) in the works canteens at all sites48.\nOne study considered the impact of an award scheme for\nworkplace canteens that encouraged healthy eating (The\nHeartbeat Award scheme). The authors compared four work\ncanteens that were given the award with two that were\nrefused it. Employees in the successful workplaces reported\nan increase in fruit consumption in comparison with the two\nunsuccessful workplaces47.\nSome studies assessed F&V intake separately29,31,34,50.\nThe results of these studies were also pooled in a meta-\nanalysis. The summary results showed an increase in fruit\nconsumption of 0·19 servings per d and vegetable\nconsumption of 0·17 servings per d (Fig. 3).\nFat intake. Nine studies report changes in fat intake\nexpressed either as percentage of energy21,23,34, g per\nd18,19,31 or through various fat scores50,52,53 (JM Simpson,\npersonal communication). We have not performed a meta-\nanalysis because of the small number of trials and the\ndifferences in study designs. Mean differences in individual\nstudies and 95%CI intervals are shown in Fig. 4. The largest\nevaluation, theWorkingWell trial23, reports a decrease in fat\nconsumption of 0·37% energy, while the second largest trial,\n‘Next step’34, reports a decrease of 1 % in fat consumption.\nOne study evaluated an initiative to reduce the fat content\nof dishes offered in the canteen of one workplace and found\nno significant differences in sales figures for the modified\ndishes25. One study considered the impact of The Heartbeat\nAward scheme on fat intake and found a reduction in the\nconsumption of fried foods and an increase in consumption\nof low-fat milk in the four workplaces given an award\ncompared with the two who failed to win an award, but no\nother significant changes in fat consumption47.\nFibre intake. Both of the trials that considered fibre intake\nreported an increased intake in the intervention worksites\n(Fig. 5).\nRed meat intake. A small American intervention aiming at\ndietary change and smoking cessation in one worksite\nreports no significant difference in read meat intake32. The\nevaluation of the Heart Beat award scheme, described\nearlier, found no effect on meat consumption47.\nChurch studies\nAll five church-based interventions were carried out in the\nUSA20,30,36,54 (DJ Bowen, personal communication). Four of\nDietary interventions to prevent cancer 81\nthem took place in African-American churches, while the\nremaining one took place in a predominantly non-Hispanic\nWhite population. Three of the studies are randomized\ncontrolled trials. One trial54 (DJ Bowen, personal communi-\ncation) randomized forty religious organizations and\nincluded more then 2000 participants, the second40 recruited\nparticipants from fifteen churches and included about 1000\nparticipants. The third trial36 randomized sixteen churches and\nincluded about 500 participants. A non-randomized interven-\ntion with a comparison group30 was based in ten US counties\nwith a high proportion of minority ethnic population. The\nintervention used data collected from 2500 respondents.\nA smaller before-and-after study20 involved four churches in\nNorth Florida,with about 370 participants. Themajority of the\nparticipants in all the studies were women.\nFruit and vegetable intake. In one intervention that lasted\n20 months, counties in South Carolina, USA, were\nrandomized to control or intervention. In each intervention\ncounty, five African-American churches participated.\nFig. 2. Worksite studies. Fruit and vegetable intake (servings per d). WMD, weighted mean difference; I1, intervention 1; I2, intervention 2.\nFig. 3. Worksite studies. Fruit intake (A) and vegetable intake (B), analysed separately (servings per d). WMD, weighted mean difference; I1,\nintervention 1; I2, intervention 2; I3, intervention 3.\nM. Thorogood et al.82\nCommunity coalitions, consisting of church members,\ngrocers and farmers, were formed and organized activities\npromoting F&V consumption. After 2 years the consump-\ntion of F&Vwas higher in the intervention group by 0·85 (SE\n0·12) servings per d than in the control group\n(P , 0·0001)30. The ‘Body and Soul’ intervention was\nevaluated in a cluster-randomized trial where African-\nAmerican churches were the unit of randomization. The\nintervention consisted primarily of church-wide nutrition\nactivities, distribution of self-help materials and motiva-\ntional interviewing. At a 6-month follow-up, intervention\nparticipants showed significantly greater F&V intake; the\nadjusted post-test difference was 1·4 servings per d, the\ncorresponding estimated effect size 0·18 servings per d\n(P , 0·05)39. The ‘Eating for a Healthy Life’ project\nrandomized forty predominantly white religious organiz-\nations. The 9-month intervention included interpersonal\nsupport, mailings, motivational messages on healthy eating,\nsocial activities, healthy eating sessions and print adver-\ntisements. At 12 months there was an increase of 0·13\nservings of F&V\/individual per d in the intervention group\n(P ¼ 0·051)54 (DJ Bowen, personal communication). Fig. 6\nsummarizes the findings.\nFat intake. The ‘Eating for a Healthy Life’ project54 (DJ\nBowen, personal communication) reported a statistically\nsignificant decrease of 0·05 points (P ¼ 0·004) in a fat\nsummary score in the intervention group compared with the\ncontrol group, but no statistically significant difference in fat\nas a percentage of energy. ‘Project Joy’36 randomized\nAfrican-American churches to one of three interventions,\ndeveloped in partnership with lay church members and\ninvestigators. A ‘standard behavioural’ intervention\nincluded motivational sessions, individual results of base-\nline screening, and nutrition and physical activity sessions.\nIn the second intervention this was supplemented by a\nspiritual component, including group prayers. The partici-\npants in the ‘standard behavioural’ group spontaneously\nadded a spiritual component to their activities, so there was\nlittle difference between these two interventions. The third\n(control) self-help group involved personalised feedback\nfrom baseline screening, and a list of personal goals,\ntogether with healthy eating and physical activity printed\nmaterials. At 1-year follow-up, the intervention groups\nhad both reduced their fat intake by 8·1 g\/d while the self-\nhelp group had reduced theirs by only 2·3 g\/d (P ¼ 0·025).\nThe study investigators faced problems in the initial\nFig. 4. Worksite studies: fat intake. (A) Fat intake (% energy), (B) fat intake (g\/d), (C) fat intake (various fat scores). WMD, weighted mean\ndifference; I1, intervention 1; I2, intervention 2; I3, intervention 3.\nFig. 5. Worksite studies. Fibre intake (g\/1000 kcal). WMD, weighted mean difference.\nDietary interventions to prevent cancer 83\nrandomization phase, when most of the church leaders\nindicated a discomfort with the randomization process and\nwanted to be told the outcome of the randomization before\nthey would agree to church enrolment. Fig. 7 summarizes\nthe findings.\nFibre intake. The ‘Eating for a Healthy Life’ project\nreported an increase in fibre consumption by 0·06 of\nsummary score scale in the intervention group when\ncompared with the control (P , 0·001) (DJ Bowen,\npersonal communication). The authors also assessed fibre\nintake by 24 h recall, and reported an increase of\n0·311 g\/1000 kJ (1·3 g\/1000 kcal) in the intervention group\ncompared with the control. Fig. 8 illustrates the findings.\nRed meat intake. No church-based study provided data on\nred meat intake.\nRetail and supermarket studies\nOne study evaluated a supermarket point-of-purchase\nintervention24. Eight supermarkets in Iowa, USA, were\nrandomized to either an 8-month intervention promoting\nF&V consumption or no intervention. The intervention\nconsisted of flyers that identified F&Von sale, gave recipes,\nmenu ideas, and a store coupon towards the purchase of any\nfruit or vegetable. Store displays and food demonstrations\nsupported the promotion. F&V consumption was assessed at\n1-year follow-up in the sample of 120 shoppers in each\nstore. No statistically significant differences between the\nintervention and control groups were found. Fig. 9\nillustrates the findings.\nDiscussion and conclusions\nWe have identified and reviewed forty-one evaluations of\npopulation- or community-based dietary interventions\npublished since 1994 plus ten systematic reviews published\nsince 1996. The present review shows that dietary changes\nare achievable by means of programmes aimed at\npopulations, communities and groups in a variety of\nsettings. At a nationwide level, the US ‘5 a Day for Better\nHealth’ programme illustrates the potential of combined\npublic–private campaigns. At local level, positive dietary\nchanges are achievable through a range of initiatives in the\ncommunity. The success of interventions appeared to differ\naccording to the targeted outcome. Increases in F&V\nconsumption were obtained in eighteen studies in several\nsettings. By contrast, on the basis of limited evidence from\nfour studies, none of the interventions achieved a reduction\nin red meat intake. Findings were mixed for reduction in fat\nintake (seventeen studies) and increase in fibre intake (five\nstudies). In contrast to an earlier review that found that\nhealthy eating interventions aimed at F&V were ‘less\nFig. 6. Church studies. Fruit and vegetable intake (servings per d). WMD, weighted mean difference.\nFig. 7. Church studies: fat intake. (A) Fat intake (% energy), (B) fat intake (g\/d), (C) fat intake (fat scores). WMD, weighted mean difference.\nM. Thorogood et al.84\neffective’3 we found that promotion of F&V intake was a\npositive food-based intervention that was more likely to\nachieve health gain than interventions aimed at other dietary\ntargets.\nLimitations of the review\nWe limited our literature searches to electronic databases\nand websites. Although we also contacted experts in the\nfield and searched reference lists of the relevant studies, we\nmight have missed some relevant studies. We excluded\nmany potential evaluation studies because the research\ndesign was not adequately described in terms of selection\nand use of controls, sampling in before-and-after studies,\nmethods for measuring outcomes, and short duration. We\nmay have missed some potentially includable studies\nbecause we were unable to obtain grey literature reports in\nthe time available.\nIn some cases a study was described in more than one\npublished paper. We tried to obtain all papers reporting\nmethodology and outcome assessment but we might have\nmissed some data. This is particularly relevant in the\nassessment of the use of a theoretical framework in the\nstudies. When this information was missing in the study\ndescription we could only say with certainty that authors did\nnot report it.\nCommunity-based interventions are often complex and\nmultifactorial and difficult to evaluate by conventional\nrandomized controlled trials. To allow for this, we set wide\ncriteria for the inclusion of studies, but this inevitably means\nthat many of the evaluations had somewhat weak designs,\nwhich may have resulted in an overestimate or under-\nestimate of the effect of the intervention. Because so few\nstudies were randomized controlled trials we were limited in\nthe amount of meta-analysis we could carry out, and were\nalso unable to carry out any formal analysis to check for\nevidence of publication bias.\nNature and quality of included studies\nWe set out to systematically identify and summarize the\navailable evidence on community- and population-level\nprogrammes for diet-based chronic disease prevention. Of\nthe forty-one studies in healthy adult populations and\ncommunities (predominantly towns, and places of work and\nworship), most (twenty-five studies, 68%) were conducted\nin North America and reflect recent US trends in health\npromotion, with a focus on F&V consumption. Many\nstudies were based in the general population or community\nsettings (eighteen of the forty-one) and in workplaces\n(seventeen). A limited number of studies (five) targeted\nmembers of religious organizations. We found only one\nstudy that evaluated a health promotion programme in a\nsupermarket environment.\nWe found only a limited number of interventions that\nwere outside the three common settings: neighbourhood,\nplaces of work and places of worship. This is despite the fact\nthat we employed broad inclusion criteria, which were not\nlimited to controlled trials and required no more than one\nmeasured food or diet-related outcome relevant to cancer\nprevention. We found only two evaluations of population-\nwide programmes, one in the USA and one in Wales. We did\nnot, for example, find any evaluation of Norwegian food\npolicy, despite its high profile in the 1980s55.\nThe great variety in study design, target population, types\nof intervention activities and outcome measurement tools\nmade the evaluation of effectiveness a difficult process. The\nmajority of worksite and church-based studies were cluster-\nrandomized trials (ten of the seventeen worksite studies and\nthree of five of church-based studies). Most community-\nwide studies used relatively weak study designs: twelve of\nFig. 8. Church studies: fibre intake. (A) Fibre intake (g\/1000 kcal), (B) fibre intake (fibre score). WMD, weighted mean difference.\nFig. 9. Retail and supermarket studies. Fruit and vegetable intake (servings per d). WMD, weighted mean difference.\nDietary interventions to prevent cancer 85\nthe eighteen were non-randomized studies with a compari-\nson group and five studies used before-and-after evalu-\nations. The studies varied greatly in quality of reporting, and\nthe inadequate description of methodology made interpret-\nation difficult. Only five studies used objective methods for\noutcome assessment; three studies reported milk sales data\nfrom supermarkets; one study reported cafeteria sales data\nand one study assessed the weight of F&V consumed in a\nworksite cafeteria. Most of the studies relied on a self-\nreported assessment of dietary behaviours.\nTwenty-six of forty-one included studies implemented\nmultifactorial programmes aiming at complex behavioural\nchange which included not only dietary habits but also\nphysical activity and smoking. Sixteen of those twenty-six\nstudies reported at least one positive intervention effect in\nthe assessed dietary outcomes. The remaining fifteen studies\nfocused on one central dietary objective, such as an increase\nof F&V consumption. Three of those studies implemented a\nsimple intervention (for example, offering low-fat meals in\nworksite cafeterias) but most of them employed multiple\nintervention activities. Twelve of fifteen studies with one\ncentral dietary objective found a positive intervention effect\non dietary habits of the study participants.\nImplications for the design of effective interventions\nIt was not possible to draw firm conclusions about the\neffectiveness of individual intervention components because\nso many of the interventions employed a complex\ncombination of strategies. We could not identify a clear\nassociation of intervention components with dietary\nbehaviour changes. Common intervention activities in the\nstudies that were classified as successful were as follows:\n(a) printed materials including posters, brochures, flyers,\nself-help guides, educational sessions and presenta-\ntions;\n(b) events such as health fairs and contests;\n(c) cafeteria point-of purchase displays and promotions,\nhealthy choice offers on menus and in vending\nmachines;\n(d) mass media approaches including programmes and\nadvertising on national or local television, radio and\nnewspapers.\nImplementing organizational, environmental and policy\nchanges in addition to intervention activities in worksites\nand communities contributed to effectiveness. In common\nwith the earlier reviews (Table 3) we found that\ninterventions that lasted for a longer time (more than 1\nyear) were more successful.\nWorksites and churches seem to be promising settings for\nthe implementation of health promotion programmes. These\nsettings possess several characteristics that make them\nsuitable for health education activities. They are relatively\ncontained communities that provide a context for peer\nsupport, positive peer pressure and leadership, as well as\nopportunities for implementation of special activities and\nlasting changes relating to provision of food and drink.\nChanges in food supply and composition. The present\nsystematic review does not extend to the impact of generic\nchanges in the food supply, or food composition. If such\nfoods are important sources of nutrients with health\nsignificance, and they are affordable, there can be a major\ninfluence on population nutrition. For example, household\nfood purchase data show that the introduction of palatable\npolyunsaturated fat spread and the shift towards vegetable\ncooking oil during the 1980s contributed to a large and rapid\nincrease in the dietary PUFA:SFA ratio in Great Britain56.\nCost effectiveness. Although we included health econ-\nomics data in our list of outcome measure to be collected,\nnone of the papers that we reviewed reported any cost-\neffectiveness analysis. While it is intuitive to assume that\ncommunity programmes incur lower costs per individual\nreached by the programme, we are unable to comment\nfurther on the comparative cost effectiveness of community\nprogrammes as opposed to individual interventions.\nTheoretical framework. One of the most discussed\naspects of health promotion interventions is the extent to\nwhich a theoretical framework contributes to success.\nAlthough earlier reviews have made a strong case for the\nimportance of a theoretical framework3, we were unable\nto confirm this importance in the present review. More\nthan half of the included studies reported the use of one or\nmore theories as a basis for intervention activities. Most\ncommonly used were the transtheoretical model of\nbehaviour change (stages of change theory), social\nlearning theory (social cognitive theory), and community\norganization strategies. In a majority of the studies there\nwas a lack of detailed information about the links between\ntheoretical framework(s) and specific activities, and the\nextent to which activities were based on those theories.\nWe did not find any evidence from the information\navailable that theory-based interventions were more\neffective than others.\nImplications for research\nA major problem in the assessment of healthy eating\ninterventions continues to be the limitations of dietary\nintake measurement tools. We were unable to compare the\noutcomes of many of the evaluations that we reviewed\nbecause the authors used a variety of different scoring\nsystems to measure dietary change. Although it is 10 years\nsince an earlier review called for more reliable methods to\nbe developed3, this remains a problem.\nWe were frustrated by the lack of clarity with respect to\nthe nature of interventions, the methods employed for their\nevaluation, and the findings of many of the papers we\nreviewed. Both researchers and journal editors have a role to\nplay in ensuring adequate and clear reports of research.\nModels for research reports are readily available, including\nsystematic guidelines for reports of clinical trials57 and\ncohort studies (including before-and-after studies)58.\nWe did not find any papers in several important areas,\nparticularly the commercial and social marketing of healthy\nfoods, including: pricing strategies; structural interventions\nincluding regulation and planning of retail provision and\ntransport links; and national campaigns to promote healthy\nM. Thorogood et al.86\neating. In addition, little attention has been paid to the\npossibilities of employing technology such as point-of-sale\ndata capture to monitor dietary habits, provide feedback,\nand evaluate in-store health promotion activities.\nConclusions\nEvidence of effectiveness was strongest for interventions\nintended to increase F&V consumption. Further evaluations\nare needed of the effects of nationwide campaigns,\nadvertising and marketing strategies. The studies included\nin the present review, although selected for the quality of\ntheir design and execution, were generally poorly reported.\nValuable dietary changes are obtained in the relatively short-\nterm studies reviewed here but may not be sustained in the\nlong term, especially in the context of the multiple\ninfluences on food behaviour in urban societies. Many of\nthe wider determinants of food behaviour are pervasive, and\nthe interventions evaluated here are campaigns fought with\nlimited resources over a limited time span. The effects that\nwe have identified are small. However, since all these\ninterventions aimed to reach groups, and in some cases very\nlarge groups, the reach is potentially very wide. The cost\neffectiveness of such strategies remains to be evaluated.\nAcknowledgements\nThe present study was funded by the World Cancer\nResearch Fund. We are grateful to Deborah Bowen,\nTimothy Dobbins, Judy Simpson, Glorian Sorensen and\nIngrid Steenhuis who provided additional data for us. Helen\nMoore provided invaluable help with preparing the\nmanuscript.\nReferences\n1. Key TJ, Schatzkin A, Willett WC, Allen NE, Spencer EA &\nTravis RC (2004) Diet, nutrition and the prevention of cancer.\nPublic Health Nutr 7, 187–200.\n2. Glanz K, Sorensen G & Farmer A (1996) The health impact of\nworksite nutrition and cholesterol intervention programs. Am J\nHealth Promot 10, 453–470.\n3. Roe L, Hunt P, Bradshaw H & Rayner M (1997) Health\nPromotion Interventions to Promote Healthy Eating in the\nGeneral Population: a Review. London: HEA.\n4. Fletcher A & Rake C (1998) Effectiveness of Interventions to\nPromote Healthy Eating in Elderly People Living in the\nCommunity: a Review. London: HEA.\n5. Peersman G, Harden A & Oliver S (1998) Effectiveness of\nHealth Promotion Intervention in the Workplace: a Review.\nLondon: HEA.\n6. Van Teijlingen E, Wilson BJ, Barry N, Ralph A, McNeil G,\nGraham W & Campbell D (1998) Effectiveness of Interven-\ntions to Promote Healthy Eating in Pregnant Women and\nWomen in Childbearing Age: a Review. London: HEA.\n7. White M, Carlin L & Rankin J (1998) Effectiveness of\nInterventions to Promote Healthy Eating in People from\nMinority Ethnic Groups: a Review. London: HEA.\n8. Brug J, Campbell M & van Assema P (1999) The application\nand impact of computer-generated personalized nutrition\neducation: a review of the literature. Patient Educ Couns 36,\n145–156.\n9. Ciliska D, Miles E, O’Brien MA & Turl C (2000)\nEffectiveness of community-based interventions to increase\nfruit and vegetable consumption. J Nutr Educ 32, 341–352.\n10. Bowen DJ & Beresford SA (2002) Dietary interventions to\nprevent disease. Annu Rev Public Health 23, 255–286.\n11. Janer G, Sala M & Kogevinas M (2002) Health promotion\ntrials at worksites and risk factors for cancer. Scand J Work\nEnviron Health 28, 141–157.\n12. Brunner EJ, Thorogood M, Rees K & Hewitt G (2005) Dietary\ninterventions for reducing cardiovascular risk. Cochrane\nDatabase of Systematic Reviews CD002128. http:\/\/www.\nmrw.interscience.wiley.com\/cochrane\/clsysrev\/articles\/\nCD002128\/frame.html\n13. Higgins JPT & Green S (2005) Cochrane Handbook for\nSystematic Reviews of Interventions 4.2.5, section 8.5.2.10\n(updated May 2005). http:\/\/www.cochrane.org\/resources\/\nhandbook\/hbook.htm (accessed 10 October 2006).\n14. Brownson RC, Smith CA, Pratt M, Mack NE, Jackson-\nThompson J, Dean CG, Dabney S & Wickerson JC (1996)\nPreventing cardiovascular disease through community-based\nrisk reduction: the Bootheel Heart Health project. Am J Public\nHealth 86, 206–213.\n15. Croft JB, Temple SP, Lankenau B, Heath GW, Macera CA,\nEaker ED & Wheeler FC (1994) Community intervention and\ntrends in dietary fat consumption among black and white\nadults. J Am Diet Assoc 94, 1284–1290.\n16. Cheadle A, Psaty M, Diehr P, Koepsell T, Wagner E, Curry S &\nKristal A (1995) Evaluating community-based nutrition\nprograms: comparing grocery store and individual-level\nsurvey measures of program impact. Prev Med 24, 71–79.\n17. Foerster SB, Kizer KW, Disogra LK, Bal DG, Krieg BF &\nBunch KL (1995) California’s “5 a Day – for Better Health”\ncampaign: an innovative population-based effort to effect\nlarge-scale dietary change. Am J Prev Med 11, 124–131.\n18. Glasgow RE, Terborg JR, Hollis JF, Severson HH & Boles SM\n(1995) Take Heart: results from the initial phase of work-site\nwellness program. Am J Public Health 85, 209–216.\n19. Glasgow RE, Terborg JR, Strycker LA, Boles SM & Hollis JF\n(1997) Take Heart II: replication of a worksite health\npromotion trial. J Behav Med 20, 143–161.\n20. Turner LW, Sutherland M, Harris GJ & Barber M (1995)\nCardiovascular health promotion in north Florida African-\nAmerican churches. Health Values 19, 3–9.\n21. Dubois A, Strychar IM, Champagne F, Leblanc MP &\nTremblay C (1996) The effect of a worksite cafeteria program\non employees’ dietary fat intakes. J Can Diet Assoc 57,\n98–102.\n22. Sorensen G, Stoddard A, Peterson K, Cohen N, Hunt MK,\nStein E, Palombo R & Lederman R (1999) Increasing fruit and\nvegetable consumption through worksites and families in the\ntreatwell 5-a-day study. Am J Public Health 89, 54–60.\n23. Sorensen G, Thompson B, Glanz K, Feng Z, Kinne S,\nDiClemente C, Emmons K, Heimendinger J, Probart C &\nLichtenstein E (1996) Work site-based cancer prevention:\nprimary results from the Working Well Trial. Am J Public\nHealth 86, 939–947.\n24. Kristal AR, Goldenhar L, Muldoon J & Morton RF (1997)\nEvaluation of a supermarket intervention to increase\nconsumption of fruits and vegetables. Am J Health Promot\n11, 422–425.\n25. Perlmutter CA, Canter DD & Gregoire MB (1997) Profit-\nability and acceptability of fat- and sodium-modified hot\nentrees in a worksite cafeteria. J Am Diet Assoc 97, 391–395.\n26. Reger B, Wootan MG & Booth-Butterfield S (1999) Using\nmass media to promote healthy eating: a community-based\ndemonstration project. Prev Med 29, 414–421.\nDietary interventions to prevent cancer 87\n27. Reger B, Wootan MG & Booth-Butterfield S (2000) A\ncomparison of different approaches to promote community-\nwide dietary change. Am J Prev Med 18, 271–275.\n28. Reger B, Wootan MG, Booth-Butterfield S & Smith H (1998)\n1% or less: a community-based nutrition campaign. Public\nHealth Rep 113, 410–419.\n29. Buller DB, Morrill C, Taren D, Aickin M, Sennott-Miller L,\nBuller MK, Larkey L, Alatorre C & Wentzel TM (1999)\nRandomized trial testing the effect of peer education at\nincreasing fruit and vegetable intake. J Natl Cancer Inst 91,\n1491–1500.\n30. Campbell MK, Demark-Wahnefried W, Symons M, et al.\n(1999) Fruit and vegetable consumption and prevention of\ncancer: the Black Churches United for Better Health Project.\nAm J Public Health 89, 1390–1396.\n31. Campbell M, Tessaro I, DeVellis B, Benedict S, Kelsey K,\nBelton L & Sanhueza A (2002) Effects of a tailored health\npromotion program for female blue-collar workers: health\nworks for women. Prev Med 34, 313–323.\n32. Fries EA, Ripley JS, Fugueiredo MI & Thompson B (1999)\nCan community organization strategies be used to implement\nsmoking and dietary changes in a rural manufacturing work\nsite? J Rural Health 15, 413–420.\n33. O’Loughlin JL, Paradis G, Gray-Donald K & Renaud L (1999)\nThe impact of a community-based heart disease prevention\nprogram in a low-income, inner-city neighborhood. Am J\nPublic Health 89, 1819–1826.\n34. Tilley BC, Glanz K, Kristal AR, Hirst K, Li S, Vernon SW &\nMyers R (1999) Nutrition intervention for high-risk auto\nworkers: results of the Next Step Trial. Prev Med 28,\n284–292.\n35. Beresford SA, Thompson B, Feng Z, Christianson A,\nMcLerran D & Patrick DL (2001) Seattle 5 a Day worksite\nprogram to increase fruit and vegetable consumption. Prev\nMed 32, 230–238.\n36. Yanek LR, Becker DM, Moy TF, Gittelsohn J & Koffman DM\n(2001) Project joy: faith based cardiovascular health\npromotion for African American women. Public Health Rep\n116, 68–81.\n37. Stables GJ, Subar AF, Patterson BH, Dodd K, Heimendinger J,\nVan Duyn MA & Nebeling L (2002) Changes in vegetable and\nfruit consumption and awareness among US adults: results of\nthe 1991 and 1997 5 A Day for Better Health Program surveys.\nJ Am Diet Assoc 102, 809–817.\n38. Elliot DL, Goldberg L, Duncan TE, Kuehl KS, Moe EL,\nBreger RK, DeFrancesco CL, Ernst DB & Stevens VJ (2004)\nThe PHLAME firefighters’ study: feasibility and findings. Am\nJ Health Behav 28, 13–23.\n39. Huot I, Paradis G & Ledoux M; Quebec Heart Health\nDemonstration Project Research Group (2004) Effects of the\nQuebec Heart Health Demonstration Project on adult dietary\nbehaviours. Prev Med 38, 137–148.\n40. Resnicow K, Campbell MK, Carr C, McCarty F, Wang T,\nPeriasamy S, Rahotep S, Doyle C, Williams A & Stables G\n(2004) Body and Soul – a dietary intervention conducted\nthrough African-American churches. Am J Prev Med 27,\n97–105.\n41. Van Assema P (1994) Results of the Dutch community project\n‘Healthy Bergeyk’. Prev Med 23, 394–401.\n42. Albright CL (1996) Nutritional epidemiology: methods and\ninnovations used in a central European community-based\nprogram. Nutrition 12, 386–387.\n43. Van Wechem SN, Van Assema P, Brug J, Kistemaker C,\nRiedstra M, Hardeman W & Lowik MR (1997) Results of a\ncommunity-based campaign to reduce fat intake. Nutr Health\n11, 207–218.\n44. Tudor-Smith C, Nutbeam D, Moore L & Catford J (1998)\nEffects of the Heartbeat Wales programme over five years on\nbehavioural risks for cardiovascular disease: quasi-experimen-\ntal comparison of result from Wales and a matched reference\narea. BMJ 316, 818–822.\n45. Lupton BS, Fonnebo V & Sogaard AJ (2003) The Finnmark\nIntervention Study: is it possible to change CVD risk factors\nby community-based intervention in an Arctic village in\ncrisis? Scand J Public Health 31, 178–186.\n46. Wrigley N, Warm D & Margetts B (2003) Deprivation, diet,\nand food-retail access: findings from the Leeds ‘food deserts’\nstudy. Environ Plan A 35, 151–188.\n47. Holdsworth M, Raymond MT & Haslam C (2004) Does the\nHeartbeat Award scheme in England result in change in dietary\nbehaviour in the workplace? Health Promot Int 19, 197–204.\n48. Lassen A, Thorsen AV, Trolle E, Elsig M & Ovesen L (2004)\nSuccessful strategies to increase the consumption of fruits and\nvegetables: results from the Danish ‘6 a day’ Work-site\nCanteen Model Study. Public Health Nutr 7, 263–270.\n49. Ronda G, Van Assema P, Candel M, Ruland E, Steenbakkers\nM, Van Ree J & Brug J (2004) The Dutch Heart Health\ncommunity intervention ‘Hartslag Limburg’: results of an\neffect study at individual level. Health Promot Int 19, 21–31.\n50. Steenhuis I, Van Assema P, Van Breukelen G, Glanz K, Kok G\n& De Vries H (2004) The impact of educational and\nenvironmental interventions in Dutch worksite cafeterias.\nHealth Promot Int 19, 335–343.\n51. Dunt D, Day N & Pirkis J (1999) Evaluation of a community-\nbased health promotion program supporting public policy\ninitiatives for a healthy diet. Health Promot Int 14, 317–327.\n52. Simpson JM, Oldenburg B, Owen N, Harris D, Dobbins T,\nSalmon A, Vita P, Wilson J & Saunders JB (2000) The\nAustralian National Workplace Health Project: design and\nbaseline findings. Prev Med 31, 249–260.\n53. Cook C, Simmons G, Swinburn B & Stewart J (2001)\nChanging risk behaviours for non-communicable disease in\nNew Zealand working men – is workplace intervention\neffective? N Z Med J 114, 175–178.\n54. Bowen DJ, Beresford SA, Vu T, Feng Z, Tinkler L, Hart A Jr,\nChristensen AL, McLerran D, Satia-Abouta J & Campbell M\n(2004) Baseline data and design for a randomized intervention\nstudy of dietary change in religious organizations. Prev Med\n39, 602–611.\n55. Milio N (1981) Promoting health through structural change:\nanalysis of the origins and implementation of Norway’s farm-\nfood-nutrition policy. Soc Sci Med 15, 721–734.\n56. National Food Survey Committee (1991) Household Food\nConsumption and Expenditure 1990 Annual Report of the\nNational Food Survey Committee. London: Ministry of\nAgriculture, Fisheries and Food.\n57. Moher D, Schulz KF & Altman DG (2001) The CONSORT\nstatement revised recommendations for improving the quality\nof reports of parallel-group randomised trials. Lancet 357,\n1191–1194.\n58. Stroup DF, Berlin JA, Morton SC, Olkin I, Williamson GD,\nRennie D, Moher D, Becker BJ, Sipe TA & Thacker SB (2000)\nMeta-analysis of observational studies in epidemiology: a\nproposal for reporting. Meta-analysis of Observational Studies\nin Epidemiology (MOOSE) group. JAMA 283, 2008–2012.\nM. Thorogood et al.88\n"}