{"doi":"10.1016\/j.ahj.2007.06.016.","coreId":"191703","oai":"oai:lra.le.ac.uk:2381\/2686","identifiers":["oai:lra.le.ac.uk:2381\/2686","10.1016\/j.ahj.2007.06.016."],"title":"C-terminal pro-endothelin-1 offers additional prognostic information in patients after acute myocardial infarction.  Leicester Acute Myocardial Infarction Peptide (LAMP) study.","authors":["Khan, Sohail Q.","Dhillon, Onkar","Struck, Joachim","Quinn, Paulene A.","Morgenthaler, Nils G.","Squire, Ian B.","Davies, Joan E.","Bergmann, Andreas","Ng, Leong L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-09-22","abstract":"This is the authors' final draft of the paper published as American Heart Journal, 2007, 154(4), pp.736-742.  The final published version is available on Science Direct, doi:10.1016\/j.ahj.2007.06.016.Background: Endothelin-1 is elevated in heart failure (HF) and after acute myocardial infarction (AMI) and gives prognostic information on mortality. Another part of its precursor, C-terminal Pro-Endothelin-1 (CT-proET-1), is more stable in circulation and ex-vivo. We investigated the cardiovascular prognostic value post-AMI of CT-proET-1 and compared it to N-terminal B-type natriuretic peptide (NTproBNP), a marker of death and HF. Methods: We measured plasma CT-proET-1 and NTproBNP in 983 consecutive post-AMI patients (721 men, mean age 65.0±(SD)12.2 years), 3-5 days after chest pain onset. Results: There were 101 deaths and 49 readmissions with HF during follow up (median 343, range 0-764 days). CT-proET-1 was raised in patients with death or HF compared to survivors (median [range]pmol\/L, 119.0[14.0-671.0] vs. 73.0[4.6-431.0]; p<0.0001). Using a Cox proportional hazards logistic model, log CT-proET-1 (HR 6.82) and log NTproBNP (HR 2.62) were significant independent predictors of death or HF (along with age, gender, past history of AMI and therapy with beta blockers). The areas under the receiver-operating curve (AUC) for CT-proET-1, NTproBNP and the logistic model with both markers were 0.76, 0.76 and 0.81 respectively. Findings were similar for death and HF as individual endpoints. Conclusion: The endothelin system is known to be activated post-AMI. CT-proET-1 is a powerful predictor of adverse outcome along with NTproBNP. CT-proET-1 may represent a clinically useful marker of prognosis after AMI","downloadUrl":"http:\/\/hdl.handle.net\/2381\/2686","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/2686\/1\/ProETFinal.pdf","pdfHashValue":"f2bca0eee04a15ead2b0c482ee0841d11445a5a1","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/2686<\/identifier><datestamp>\n                2007-12-01T02:00:59Z<\/datestamp><setSpec>\n                com_2381_10<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_11<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nC-terminal pro-endothelin-1 offers additional prognostic information in patients after acute myocardial infarction.  Leicester Acute Myocardial Infarction Peptide (LAMP) study.<\/dc:title><dc:creator>\nKhan, Sohail Q.<\/dc:creator><dc:creator>\nDhillon, Onkar<\/dc:creator><dc:creator>\nStruck, Joachim<\/dc:creator><dc:creator>\nQuinn, Paulene A.<\/dc:creator><dc:creator>\nMorgenthaler, Nils G.<\/dc:creator><dc:creator>\nSquire, Ian B.<\/dc:creator><dc:creator>\nDavies, Joan E.<\/dc:creator><dc:creator>\nBergmann, Andreas<\/dc:creator><dc:creator>\nNg, Leong L.<\/dc:creator><dc:description>\nThis is the authors' final draft of the paper published as American Heart Journal, 2007, 154(4), pp.736-742.  The final published version is available on Science Direct, doi:10.1016\/j.ahj.2007.06.016.<\/dc:description><dc:description>\nBackground: Endothelin-1 is elevated in heart failure (HF) and after acute myocardial infarction (AMI) and gives prognostic information on mortality. Another part of its precursor, C-terminal Pro-Endothelin-1 (CT-proET-1), is more stable in circulation and ex-vivo. We investigated the cardiovascular prognostic value post-AMI of CT-proET-1 and compared it to N-terminal B-type natriuretic peptide (NTproBNP), a marker of death and HF. Methods: We measured plasma CT-proET-1 and NTproBNP in 983 consecutive post-AMI patients (721 men, mean age 65.0±(SD)12.2 years), 3-5 days after chest pain onset. Results: There were 101 deaths and 49 readmissions with HF during follow up (median 343, range 0-764 days). CT-proET-1 was raised in patients with death or HF compared to survivors (median [range]pmol\/L, 119.0[14.0-671.0] vs. 73.0[4.6-431.0]; p<0.0001). Using a Cox proportional hazards logistic model, log CT-proET-1 (HR 6.82) and log NTproBNP (HR 2.62) were significant independent predictors of death or HF (along with age, gender, past history of AMI and therapy with beta blockers). The areas under the receiver-operating curve (AUC) for CT-proET-1, NTproBNP and the logistic model with both markers were 0.76, 0.76 and 0.81 respectively. Findings were similar for death and HF as individual endpoints. Conclusion: The endothelin system is known to be activated post-AMI. CT-proET-1 is a powerful predictor of adverse outcome along with NTproBNP. CT-proET-1 may represent a clinically useful marker of prognosis after AMI.<\/dc:description><dc:date>\n2007-11-30T09:00:50Z<\/dc:date><dc:date>\n2007-11-30T09:00:50Z<\/dc:date><dc:date>\n2007-09-22<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAmerican Heart Journal, 2007, 154(4), pp.736-742<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/2686<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article"],"fullText":" 1\nC-terminal Pro-Endothelin-1 Offers Additional Prognostic Information in Patients After \nAcute Myocardial Infarction. Leicester Acute Myocardial Infarction Peptide (LAMP) \nStudy  \nSohail Q. Khan, MRCP, Onkar Dhillon, MRCP, Joachim Struck*, PhD, Paulene Quinn, \nMS, Nils G. Morgenthaler*, PhD, Ian B. Squire, MD, Joan E. Davies, PhD, Andreas \nBergmann*, PhD, Leong L. Ng, MD  \nUniversity of Leicester \nDepartment of Cardiovascular Sciences \nClinical Sciences Building \nLeicester Royal Infirmary \nLeicester LE2 7LX, UK \n \n*Research Department \nB·R·A·H·M·S Aktiengesellschaft \nNeuendorfstr. 25 \nD-16761 Hennigsdorf \nGermany \nCorresponding author:  Dr Sohail Q. Khan \nDepartment of Cardiovascular Sciences \nClinical Sciences Building \nLeicester Royal Infirmary \nLeicester, LE2 7LX, UK \nPhone:+1162523132 ; fax:+1162523108; e-mail:sqk1@le.ac.uk  \nWord count:  4765 \n \nShort Title: CT-proET-1 and prognosis in AMI \n \n 2\nConflicts of Interest: \nA Bergmann holds ownership in BRAHMS AG, patent rights to the markers of the study and is a \nmember of the board of directors of BRAHMS AG. \nJ Struck holds patent rights to the markers and is an employee of BRAHMS AG. \nN Morgenthaler is an employee of BRAHMS AG. \nBRAHMS is a mid-sized company, based in Hennigsdorf, Germany, commercializes \nimmunoassays and has developed the CT-proET-1 assay, for which it owns patent rights. \nThis study was not financed by BRAHMS AG. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 3\nAbstract  \nBackground Endothelin-1 is elevated in heart failure (HF) and after acute myocardial infarction \n(AMI) and gives prognostic information on mortality. Another part of its precursor, C-terminal \nPro-Endothelin-1 (CT-proET-1), is more stable in circulation and ex-vivo. We investigated the \ncardiovascular prognostic value post-AMI of CT-proET-1 and compared it to N-terminal B-type \nnatriuretic peptide (NTproBNP), a marker of death and HF. Methods We measured plasma CT-\nproET-1 and NTproBNP in 983 consecutive post-AMI patients (721 men, mean age \n65.0±(SD)12.2 years), 3-5 days after chest pain onset. Results There were 101 deaths and 49 \nreadmissions with HF during follow up (median 343, range 0-764 days). CT-proET-1 was raised \nin patients with death or HF compared to survivors (median [range]pmol\/L, 119.0[14.0-671.0] vs. \n73.0[4.6-431.0]; p<0.0001). Using a Cox proportional hazards logistic model, log CT-proET-1 \n(HR 6.82) and log NTproBNP (HR 2.62) were significant independent predictors of death or HF \n(along with age, gender, past history of AMI and therapy with beta blockers). The areas under the \nreceiver-operating curve (AUC) for CT-proET-1, NTproBNP and the logistic model with both \nmarkers were 0.76, 0.76 and 0.81 respectively. Findings were similar for death and HF as \nindividual endpoints. Conclusion The endothelin system is known to be activated post-AMI. CT-\nproET-1 is a powerful predictor of adverse outcome along with NTproBNP. CT-proET-1 may \nrepresent a clinically useful marker of prognosis after AMI. \n \nKeywords Myocardial infarction; heart failure; peptides; Pro-Endothelin; N-terminal pro B type \nnatriuretic peptide; prognosis  \n \n \n \n \n 4\nIntroduction \nAcute myocardial infarction (AMI) remains a challenging condition and prognosis of patients \nvaries. Prognostic information and the identification of patients at high risk of adverse events can \nbe gauged to some extent from clinical and biochemical data. Amongst the biochemical \ninformation that may offer useful prognostic information is natriuretic peptide levels such as N-\nterminal pro B type natriuretic peptide (NTproBNP) which provides information regarding the \nrisk of death and heart failure following AMI.1 The prognostic value of this biomarker compared \nto clinical features has been borne out in a range of acute coronary syndromes.2 Complementary \ninformation can however be obtained in a multi-marker strategy particularly with NTproBNP. \nHere we investigate C-terminal Pro-Endothelin-1 (CT-proET-1) as a potential peptide in a multi-\nmarker strategy. Endothelin-1 is a well known 21 amino acid potent vasoconstrictor peptide \nwhich was originally isolated from vascular endothelial cells.3 Subsequently ET-1 has been found \nin smooth muscle, renal and pulmonary cells.4\nET-1 exerts its vascular effects by activation of the ET(A) and ET(B) receptors on smooth muscle \ncells which cause an increase in cellular calcium. 5 ET-1 is synthesized as part of a larger \nprecursor molecule, termed preproendothelin-1. ET-1 is difficult to measure because of its \ninstability and it’s binding to receptors and plasma proteins. 6,7\nHowever an immunoluminometric assay for the measurement of the C-terminal endothelin-1 \nprecursor fragment in human plasma has been reported which indirectly estimates activity of the \nendothelin system. 8 This breakdown fragment is more stable than the active molecule and is \npresumably inactive in the circulation. 9 The biological activity of ET-1 in the cardiovascular \nsystem is varied. It has been implicated in the development of hypertension, 10 chronic heart \nfailure 11 and myocardial infarction, 12 including unstable angina and non q-wave myocardial \ninfarction. 13\nInterestingly plasma ET-1 is increased in AMI, in proportion to the severity of the disease12 \n \n 5\nPlasma ET-1 has been investigated previously in a small study as a prognostic marker \nwhere it was found to be an independent predictor of long-term mortality independent \nof clinical variables.14 The potential utility of the more stable prohormone fragment \nCT-proET-1 in prognostication after AMI is unknown.  \nWe postulated that plasma CT-proET-1 and NTproBNP would be useful in \ndetermining the prognosis following AMI, particularly for predicting death and heart \nfailure, and that CT-proET-1 would have incremental value for risk stratification to \nNTproBNP, a biomarker with established prognostic value in post AMI patients. 1,15,16  \n \nMethods \nStudy population \nWe studied 983 consecutive acute myocardial infarction patients admitted to the Coronary Care \nUnit of Leicester Royal Infirmary. The study complied with the Declaration of Helsinki and was \napproved by the local ethics committee; written informed consent was obtained from patients. \nAMI was diagnosed if a patient had a plasma creatine kinase-MB elevation greater than twice \nnormal or cardiac troponin I level >0.1 ng\/mL with at least one of the following, chest pain \nlasting >20 minutes or diagnostic serial electrocardiographic (ECG) changes consisting of new \npathological Q waves or ST-segment and T-wave changes. .17 AMI was sub-categorised into ST \nsegment elevation myocardial infarction (STEMI) or non-ST segment myocardial infarction \n(NSTEMI). The estimated GFR (eGFR) of these subjects was calculated from the simplified \nformula derived from the Modification of Diet in Renal Disease (MDRD) study, recently \nvalidated in patients with HF. 18 Exclusion criteria were known malignancy, or surgery in the \nprevious month.   \n \n \n \n \n 6\nPlasma samples \nBlood samples were drawn on one occasion  3 to 5 days after the onset of chest pain (patients \nwho did not have chest pain were included time zero was set as admission time) for determination \nof plasma CT-proET-1 and NTproBNP. After 15 minutes bed rest, 20mL blood was collected \ninto tubes containing EDTA and aprotinin. All plasma was stored at -70°C until assayed in a \nblinded fashion in a single batch. In a subgroup of 132 patients, blood sampling was performed \ndaily for 5 days from admission to discharge.  \n \nNTproBNP assay \nOur NTproBNP assay was based on a non-competitive assay as previously published.2 Sheep \nantibodies were raised to the N-terminal of human NTproBNP and monoclonal mouse antibodies \nwere raised to the C- terminal. The N-terminal IgG was affinity-purified and biotinylated. \nSamples or NTproBNP standards were incubated in C-terminal IgG–coated wells with the \nbiotinylated N-terminal antibody for 24 hours at 4°C. Detection was with methyl-acridinium ester \n(MAE)–labelled streptavidin on a MLX plate luminometer (Dynex Technologies Ltd., Worthing, \nUK). The lower limit of detection was 0.3 pmol\/L. There was no cross reactivity with atrial \nnatriuretic peptide, BNP, or C-type natriuretic peptide. \n \nCT-proET-1 assay \nCT-proET-1 was detected using a novel commercial assay in the chemiluminescence\/ coated \ntube-format (BRAHMS AG), as described.8  Briefly, tubes were coated with a purified sheep \npolyclonal antibody raised against a peptide representing amino acids 168–181 of pre-proET-1 \n(see figure 1). A purified sheep polyclonal antibody raised against a peptide representing amino \nacids 200–212 of pre-proET-1 was labelled with MACN-Acridinium-NHS-Ester (InVent GmbH, \nGermany) and used as tracer. Dilutions of a peptide representing amino acids 169–212 of pre-\nproET-1 in normal horse serum served as standards. The immunoassay was performed by \n \n 7\nincubating 50 µl of samples\/standards and 200µl tracer in coated tubes for 2 h at room \ntemperature. Tubes were washed 4 times with 1 ml of LIA wash solution (B.R.A.H.M.S AG), and \nbound chemiluminescence was measured using a LB952T luminometer (Berthold, Germany). \n \nEnd points \nWe assessed the value of both CT-proET-1 and NTproBNP for the prediction of the combined \nprimary endpoint of death and hospitalization for heart failure and for death or hospitalization for \nheart failure as individual secondary endpoints. Hospitalization for heart failure was defined as a \nhospital admission for which heart failure was the primary reason. Endpoints were obtained by \nreviewing the Office of National Statistics Registry and by contacting each patient. There was a \nminimum 60-day follow-up of all surviving patients. \n \nStatistical analysis \nStatistical analyses were performed on SPSS Version 14 (SPSS Inc, Chicago, Illinois). The \nComparisons of continuous variables were made using the Mann Whitney U test. Comparisons in \nthe daily sampling study were performed using the general linear model with repeated measures, \nwith correction for multiple comparisons using the Bonferroni method. To test the independent \npredictive power for death or heart failure of peptide levels Cox proportional hazards analyses \nwere conducted. We included as variables baseline patient characteristics (age, gender, eGFR, \nKillip class, territory of AMI, past history of myocardial infarction or heart failure, therapy with \nACE inhibitors, angiotensin receptor blockers, beta-blockers, and peptide markers CT-proET-1 \nand NTproBNP). Cox models were always constructed with the same variables entered \nsimultaneously (which included variables statistically significant in univariate analyses and those \nvariables that may have an effect on the end point on the basis of previous studies).  \nLevels of NTproBNP and CT-proET-1 were normalised by log transformation. Thus hazard \nratios refer to a tenfold rise in the levels of these markers. Spearman’s correlations were \n \n 8\nperformed for peptide values and continuous variables. To compare the accuracy of NTproBNP \nand CT-proET-1 receiver-operating characteristic (ROC) curves were generated and the area \nunder the curves (AUC) was calculated. Kaplan Meier survival curves were generated to visualise \nthe relationship between the peptides NTproBNP and CT-proET-1 and the primary and secondary \nendpoints. The Mantel-Cox log rank test was used to assess the significance of the stratification \nusing medians of CT-proET-1 (and log rank tests for linear trend of factor levels for stratification \nusing ordered quartiles of CT-proET-1) dichotomised according to NTproBNP median levels. A \ntwo-tailed p value of less than 0.05 was deemed to be statistically significant. All authors had full \naccess to the data and take responsibility for its integrity and accuracy of the analysis. All authors \nhave read and agree to the manuscript as written. \n \nResults \nPatient characteristics \nThe demographic features of the patient population are shown in Table 1. Median range of \nfollow-up was 343 days ranging from 0–764 days. No patient was lost to follow-up and the \nminimum length of follow-up for survivors was 60 days, enabling a censored primary end-point \nof death or HF to be determined at this time point for ROC analysis. During follow-up, 101 \n(10.3%) patients died and 49 (5.0%) were readmitted with heart failure. In 783 patients, the AMI \nwas a STEMI event. \n \nPlasma profile of CT-proET-1 and NTproBNP \nDaily blood samples were obtained for 5 days post-admission in a subgroup of 132 patients (102 \nmale, median age range] 64 [32-90] years), 16 of whom subsequently experienced the primary \nendpoint of death or heart failure. Figure 2a illustrates the time course of plasma NTproBNP \nshowing significant changes with day of sampling (p<0.001), with peak levels on day 2 (p<0.001 \nand 0.02 compared to day 1 and day 3 respectively using the Bonferroni correction).  In contrast, \n \n 9\nthe plasma CT-proET-1 rose to peak on day 2 (significantly elevated compared to day 1, p<0.001 \nusing the Bonferroni correction), before a plateau was reached between days 3-5 (figure 2b). \n \nCT-proET-1 levels in patients  \nPlasma levels of CT-proET-1 in patients with AMI ranged from 4.63- 671.0 pmol\/L with a \nmedian of 71.0 pmol\/L. CT-proET-1 was higher in patients who died (p<0.0001) or were \nreadmitted with heart failure (p<0.0001) compared to event free survivors. Levels were higher in \nfemales compared with males (p<0.0001), in patients with history of prior AMI (p<0.0001), \nhypertension (p<0.0001), those with a Killip class above 1 (p<0.0001) and in patients with prior \nhistory of heart failure (p<0.0001). CT-proET-1 levels were not significantly different between \nSTEMI and NSTEMI patients. CT-proET-1 was lower in patients who received thrombolytic \ntherapy (p=0.021) (see table 2). \nCT-proET-1 correlated with age (rs= 0.390, p< 0.0001), eGFR (rs = -0.481, p< 0.0001) and \nNTproBNP (rs =0.548, p< 0.0001).  \n \nNTproBNP levels in patients  \nNTproBNP obtained in the plateau phase was higher in patients who died (p<0.0001) or were \nreadmitted with heart failure (p<0.0001). Significant differences in NTproBNP levels were noted \nbetween males and females (p<0.0001) and those with Killip class above 1 (p<0.0001) and in \npatients with a prior history of heart failure (p<0.0001) or AMI (p=0.001) (see table 2). \n \nPrimary Endpoints: CT-proET-1 and NTproBNP as predictors of death and heart failure \nCT-proET-1 was raised in patients with death or heart failure compared to survivors (median \n[range] pmol\/L, 119; [14.0-671.0] vs. 73; [4.63-431]; p<0.0001).  \nWhen clinical and demographic characteristics (age, gender, eGFR, Killip class, territory of AMI, \npast history of myocardial infarction or heart failure therapy with ACE inhibitors, angiotensin \n \n 10\nreceptor blockers, beta-blockers, and peptide markers CT-proET-1 and NTproBNP) were entered \ninto a Cox proportional hazards model CT-proET-1 (HR 6.82, 95% CI: 3.01-15.42, p<0.0001) \nand NTproBNP (HR 2.62, 95% CI: 1.80-3.83, p<0.0001) independently predicted the primary \nendpoint along with age (HR 1.04), gender (HR for male vs. female 0.74), prior history of AMI \n(HR 1.74) and use of beta blocker (HR 0.69) (Table 3). Killip class and eGFR were no longer \nindependent predictors of death and heart failure. The area under the curves (AUC) of the \nreceiver-operating-characteristic curve for CT-proET-1 of 0.76 (95% CI: 0.71-0.82, p<0.0001) \nand NTproBNP AUC 0.76 (95% CI: 0.70-0.82, p<0.0001) were similar. The predicted \nprobability from the binary logistic model combining the 2 markers yielded an AUC of 0.81 \n(95% CI: 0.75-0.86, p<0.0001), which exceeded that of either peptide alone. \nThe bootstrapped C-statistic with 95% confidence intervals (computed from a bootstrap sample \nof 3000 repeated 50 times) was 0.75 (95% CI: 0.73-0.76) for NTproBNP and 0.75 (95% CI: 0.74-\n0.77) for CT-proET-1. \nKaplan-Meier survival analysis confirmed the findings obtained in the Cox regression model and \nrevealed a significantly better clinical outcome in patients with CT-proET-1 below the median \n(71 pmol\/L) compared with those with CT-proET-1 above the median (log rank 54.02, p<0.0001, \nfigure 3). This was also true for NTproBNP (log rank 68.98, p<0.0001, figure 4). In addition \nthere was a grading to the primary end point, which increased as the levels of CT-proET-1 or \nNTproBNP increased. A positive CT-proET-1 and NTproBNP (ie, both above their respective \nmedian values) was associated with a significantly higher rate of the primary end point than \nhaving either peptide level above their medians, or both peptides below their medians (log rank \n78.26, p<0.0001, figure 5). \n \n \n \n \n 11\nSecondary Endpoints: CT-proET-1 and NTproBNP as predictors of death or heart failure \nas individual endpoints. \nOn Cox proportional hazards modelling the strongest independent predictors of death were \nNTproBNP (HR 3.59, p<0.0001), age (HR 1.06, p<0.0001), therapy with beta-blockers (HR 0.54, \np=0.003) and CT-proET-1 (HR 4.00, p=0.005), the other independent predictors were prior \nhistory of AMI (HR 1.48, p=0.069) and therapy with ACE inhibitors or angiotensin receptor \nblockers (HR 0.76, p=0.059). Such modelling on heart failure readmissions yielded the following \nindependent predictors: CT-proET-1 (HR 5.71, p=0.002), NTproBNP (HR 1.66, p=0.044), Killip \nclass above 1 (HR 2.00, p=0.018), and PMH of HF (HR 3.11, p=0.001).  Kaplan-Meier analysis \non death or heart failure as individual endpoints revealed a significantly better clinical outcome in \npatients with CT-proET-1 below the median compared with those with CT-proET-1 above the \nmedian (log rank 31.02 and 27.68 respectively, p<0.0001).  \n \nDiscussion \nWe have shown using survival analysis that CT-proET-1 is a powerful independent predictor of \ndeath and heart failure, with combined levels of CT-proET-1 and NTproBNP performing better at \nidentifying patients with the highest risk of an adverse event than either marker alone. The \nprognostic ability of CT-proET-1 at predicting death or heart failure is independent of well \nestablished clinical and biochemical factors including the well established NTproBNP. This has \nbeen borne out in the multivariate analyses with Cox regression. \nWhen the combination of CT-proET-1 and NTproBNP was investigated in a multi-marker risk \nstratification approach this actually generated an increased area under the ROC curve than for \neither marker individually and greater predictive accuracy. This suggests that the two markers \nmay be giving complementary information after an AMI. Kaplan-Meier analysis revealed a \npositive CT-proET-1 and NTproBNP was associated with a significantly higher rate of the \nprimary end point than having one raised peptide level or two low levels of peptides. \n \n 12\n \nThere are some associations between CT-proET-1 and NTproBNP; both levels increase with age \nand both show higher levels in females. There is also a strong correlation between the two \npeptides raising the possibility of release of this peptide from the myocardium itself. Another \nalternative suggestion may be that the impaired LV systolic function increases left atrial pressures \nand this increase in pressure is then the stimulus for endothelin release. \nA multimarker strategy for post-AMI prognosis using independent biomarkers has been utilised \nand proposed previously as it provides complementary information through different mechanistic \npathways.19 Our data indicate that individually CT-proET-1 and NTproBNP have similar \nprognostic utility, however the two markers considered together provide complementary \ninformation. \nThe plasma profile of endothelin has been described previously showing a peak at around 6 hours \npost AMI before attaining normal levels by 24 hours after chest pain onset. 20 Interestingly those \npatients who then developed complications continue to get a sustained secretion of endothelin \nwhereas those with an uncomplicated AMI show declining levels. This has also been borne out \nfor unstable angina and non Q-wave myocardial infarction. 13 In contrast, the plasma profile for \nCT-proET-1 rises to a peak on day 2 before reaching a steady state. This is different to the \nsecretion pattern of both endothelin itself and to NTproBNP which has a biphasic type response.  \nIn a previous study investigating endothelin as a prognostic marker after an AMI it was found to \nbe predictive of 1-year mortality in a small cohort of 142 patients. 14 This study unlike ours \nhowever did not investigate the predictive power of endothelin for heart failure.  \nEndothelin is most likely to have a detrimental effect after an AMI possibly causing extension of \nthe infarct and has been shown to be grossly elevated in patients following cardiogenic shock.21\nEndothelin is known to significantly reduce coronary blood flow 22 and endothelin antagonists \nreduce the extent of experimental AMI. 23\n \n 13\nWe have measured activation of the endothelin system indirectly by measurement of the \nprohormone over the active peptide endothelin, which is elevated transiently post-AMI.  CT-\nproET-1 is not involved in receptor binding or protein interactions and the longer half-life results \nin higher easily measurable plasma levels which may act as an integral of activity of the \nendothelin system. \nLimitations of the study \nThis was a single centre study and the results need to be replicated in larger multicentre studies. \nThere was a preponderance of ST elevation AMI, as cut-points for non-ST elevation AMI may \nneed to be independently established. Our study employed blood samples in the recovery phase \nof AMI, and the utility of initial triage blood samples should be investigated for even earlier \nstratification of risk post-AMI. \nIn conclusion this report confirms activation of the ET system post AMI and CT-proET-1 to be a \npowerful new prognostic marker of death or heart failure in patients with AMI, independent of \nestablished conventional risk factors and newer plasma biomarkers such as NTproBNP. A \nmultimarker approach with CT-proET-1 and NTproBNP is more informative than either marker \nalone and may be useful for risk stratification in AMI patients. \n \n \n \n \n \n \n \n \n \n \n \n 14\nReferences \n1) Richards AM, Nicholls MG, Yandle TG, et al. Plasma N-terminal pro-brain natriuretic peptide \nand adrenomedullin: new neurohormonal predictors of left ventricular function and prognosis \nafter myocardial infarction. Circulation 1998;97:1921-9. \n2) Omland T, Persson A, Ng L, et al. N-terminal pro-B-type natriuretic peptide and long-term \nmortality in acute coronary syndromes. Circulation 2002;106:2913-18. \n3) Yanagisawa M, Kurihara H, Kimura S, et al. A novel potent vasoconstrictor peptide produced \nby vascular endothelial cells. Nature 1988;332:411-15. \n4) Inoue A, Yanagisawa M, Kimura S, et al. The human endothelin family: three structurally and \npharmacologically distinct isopeptides predicted by three separate genes. Proc Natl Acad Sci \nUSA 1989;86:2863-67. \n5) Haynes WG, Strachan FE, Webb DJ. Endothelin ET(A) and ET(B) receptors cause \nvasoconstriction of human resistance and capacitance vessels in vivo. Circulation 1995;92:357-\n63. \n6) Rossi GP, Seccia TM, Albertin G, et al. Measurement of endothelin: clinical and research use. \nAnn Clin Biochem 2000;37:608-26.  \n7) Brunner F, Stessel H, Watzinger N, et al. Binding of endothelin to plasma proteins and tissue \nreceptors: effects on endothelin determination, vasoactivity, and tissue kinetics. FEBS Lett \n1995;373:97-101. \n8) Papassotiriou J, Morgenthaler NG, Struck J, et al. Immunoluminometric assay for \nmeasurement of the C-terminal endothelin-1 precursor fragment in human plasma. Clin Chem \n2006;52:1144-51. \n9) Struck J, Morgenthaler NG, Bergmann A. Proteolytic processing pattern of the endothelin-1 \nprecursor in vivo. Peptides 2005;26:2482-86. \n10) Kiely DG, Cargill RI, Struthers AD, et al. Cardiopulmonary effects of endothelin-1 in man. \nCardiovasc Res 1997;33:378-86.  \n \n 15\n11) Wei CM, Lerman A, Rodeheffer RJ, et al. Endothelin in human congestive heart failure. \nCirculation 1994;89:1580-86. \n12) Tomoda H. Plasma endothelin-1 in acute myocardial infarction with heart failure. Am Heart J \n1993;125:667-72. \n13) Wieczorek I, Haynes WG, Webb DJ, et al. Raised plasma endothelin in unstable angina and \nnon-Q wave myocardial infarction: relation to cardiovascular outcome \nBritish Heart Journal 1994;72:436-41.  \n14) Omland T, Lie RT, Aakvaag A, et al . Plasma endothelin determination as a prognostic \nindicator of one year after acute myocardial infarction. Circulation 1994;89:1573-9. \n15) Omland T, de Lemos JA, Morrow DA, et al. Prognostic value of N-terminal pro-atrial and \npro-brain natriuretic peptide in patients with acute coronary syndromes. Am J Cardiol \n2002;89:463-5. \n16) Squire IB, O'Brien RJ, Demme B, et al. N-terminal pro-atrial natriuretic peptide (N-ANP) \nand N-terminal pro-B-type natriuretic peptide (N-BNP) in the prediction of death and heart \nfailure in unselected patients following acute myocardial infarction. Clin Sci (Lond) \n2004;107:309-16. \n17) Alpert JS, Thygesen K, Antman E, et al. Myocardial infarction redefined--a consensus \ndocument of The Joint European Society of Cardiology\/American College of Cardiology \nCommittee for the redefinition of myocardial infarction. J Am Coll Cardiol 2000;36:959-69. \n18) Smilde TD, van Veldhuisen DJ, Navis G, et al. Drawbacks and prognostic value of formulas \nestimating renal function in patients with chronic heart failure and systolic dysfunction. \nCirculation 2006;114:572-80. \n19) Sabatine MS, Morrow DA, de Lemos JA, et al. Multimarker approach to risk stratification in \nnon-ST elevation acute coronary syndromes: simultaneous assessment of troponin I, C-reactive \nprotein, and B-type natriuretic peptide. Circulation 2002;105:1760-63. \n \n 16\n20) Stewart DJ, Kubac G, Costello KB, et al. Increased plasma endothelin-1 in the early hours of \nacute myocardial infarction. J Am Coll Cardiol 1991;18:38-43. \n21) Cernacek P, Stewart DJ. Immunoreactive endothelin in human plasma: marked elevations in \npatients in cardiogenic shock. Biochem Biophys Res Commun 1989;161:562-67. \n22) Kurihara H, Yamaoki K, Nagai R, et al. Endothelin: a potent vasoconstrictor associated with \ncoronary vasospasm. Life Sci 1989;44:1937-43. \n23) Grover GJ, Dzwonczyk S, Parham CS. The endothelin-1 receptor antagonist BQ-123 reduced \ninfarct size in a canine model of coronary occlusion and reperfusion. Cardiovasc Res \n1993;27:1613-18. \n \n \n \n \nAcknowledgments \nDr Sohail Q Khan is supported by a British Heart Foundation Junior Research Fellowship \n(FS\/03\/028\/15486).  \n \n \n \n \n \n \n \n \n \n 17\nLegends \nFigure 1 Principle of the CT-proET-1 assay. A sketch of the Endothelin-1 precursor is shown, \nand amino acid positions in prepro-ET-1 are denoted, at which the precursor is proteolytically \nprocessed. Tracer- and solid phase-antibodies used in the sandwich immunoassay for the \ndetection of CT-proET-1 are indicated. Signal: signal peptide; ET-1: Endothelin-1; CT-proET-1: \nC-terminal pro-Endothelin-1. \nFigure 2 Time dependent changes (mean ± SE) 5 days post-AMI of plasma NTproBNP (a) and \nCT-proET-1 (b) (n=132) \nFigure 3 Kaplan-Meier Curve: Time to death or heart failure related to plasma CT-proET-1 \nFigure 4 Kaplan-Meier Curve: Time to death or heart failure related to plasma NTproBNP \nFigure 5 Kaplan–Meier curve: Time to death or heart failure related to low or high plasma CT-\nproET-1 and NTproBNP levels. (1) Low CT-proET-1 and NTproBNP, (2) Low CT-proET-1 and \nhigh NTproBNP, (3) High CT-proET-1 and low NTproBNP and (4) High CT-proET-1 and \nNTproBNP \n \n \n \n \n \n \n \n \n \n \n \n \n 18\nTable 1 Characteristics of the 983 patients in the study separated by CT-proET-1 quartiles. \nValues are means (SD) or numbers (%) \n 1st quartile 2nd quartile 3rd quartile 4th quartile p value \nAge (in years) 58.9 ± 11.7  63.5 ± 11.7  65.9 ± 11.3  71.7 ± 10.7  <0.0001 \nMale Sex 202 (84.2) 184 (75.7) 168 (70.0) 158 (64.8) <0.0001 \nPrevious Medical \nHistory  \n     \nAMI 26 (10.8) 40 (16.5) 38 (15.8) 60 (24.6) 0.001 \nAngina Pectoris 56 (23.3) 62 (25.5) 52 (21.7) 79 (32.4) 0.038 \nHypertension 82 (24.2) 106 (43.6) 101 (42.1) 131(53.7) <0.0001 \nDiabetes mellitus 34 (14.2) 47 (19.3) 51 (21.3) 79 (32.4) <0.0001 \nHigh cholesterol 47 (19.6) 52 (21.4) 66 (27.5) 60 (24.6) 0.176 \nCurrent\/Ex-Smokers 149 (62.1) 159 (65.4) 162 (67.5) 135 (55.3) 0.030 \nST-elevation AMI 196 (81.7) 179 (72.8) 209 (83.8) 208 (80.3) 0.284 \nThrombolytic 143 (59.6) 126 (51.9) 143 (59.6) 119 (48.8) 0.034 \nTerritory of Infarct     0.077 \nAnterior 105 (43.8) 102 (42.0) 102 (42.5) 102 (41.8)  \nInferior 103 (42.9) 89 (36.6) 98 (40.8) 83 (34.0)  \nOther 32 (13.3) 52 (21.4) 40 (16.7) 58 (23.8)  \nKillip Class on \nAdmission \n    <0.0001 \nI 162 (67.5) 132 (54.3) 114 (46.3) 84 (34.4)  \nII 68 (28.3) 93 (38.3) 104 (43.3) 109 (44.7)  \nIII 9 (3.8) 14 (5.8) 24 (10.0) 41 (16.8)  \nIV 1 (0.4) 0 (0) 0 (0) 9 (3.7)  \n \n 19\nPeak CK (IU\/L) 838.5± 794.9 895.4 ± \n1091.8 \n1261.5 ± \n1243.1 \n1273.0 ± \n1590.7 \n<0.0001 \neGFR (ml\/min\/1.73m2) 76.9 ± 16.0 74.5 ± 16.1 67.7 ± 17.5 52.7 ± 18.5 <0.0001 \nNTproBNP (pmol\/L) 1031.6 ± 2267.7 1224.9 ± \n1783.0 \n2141.5 ± \n2400.5 \n4350.6 ± \n3547.1 \n<0.0001 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 20\nTable 2 Table comparing CT-proET-1 and NTproBNP levels in different patient sub-groups \n Median CT-\nproET-1 \n(pmol\/L) \np value Median NTproBNP \n(pmol\/L) \np value \nDeath vs. Survivors 126.0 vs. 74.0 p<0.0001 5929.3 vs.802.4 p<0.0001 \nAdmission with HF vs. \nNo HF \n112 vs. 74.9 p<0.0001 3932.9 vs. 839.0 p<0.0001 \nMales vs. Females 73.0vs. 89.0  p<0.0001 788.7 vs. 1632.6 p<0.0001 \nPrevious AMI vs. No \nAMI \n85.0 vs. 75.0 p<0.0001 1332.3 vs. 844.4 P<0.001 \nHypertension vs. \nNormotensives \n84.0 vs. 73.2 p<0.0001 1105.6 vs. 802.4 p<0.0001 \nPrevious HF vs. No HF 108.0 vs. 75.9 P<0.0001 4160.1 vs. 856.6  P<0.0001 \nSTEMI vs. NSTEMI 78.1 vs. 72.9 p=NS 1017.9 vs. 624.6 P<0.002 \nKillip class above 1 vs. \nKillip class 1 \n88.9 vs. 70.0 p<0.0001 1595.1 vs. 631.5 p<0.0001 \n \n \n 21\nTable 3 Multivariate Cox proportional hazards regression model of significant predictors of death \nor heart failure. Variables entered into the regression model included age, gender, territory of \nAMI, past history myocardial infarction (PMH AMI), past history of heart failure (PMH HF), use \nof thrombolysis, Killip class>1, eGFR, use of beta blockers or ACE inhibitors\/Angiotensin \nreceptor blockers, log NTproBNP, log CT-proET-1 \n \nVariable Hazard Ratio 95% CI p value \nLog CT-proET-1 6.82 3.01-15.42 <0.0001 \nLog NTproBNP  2.62 1.80-3.83 <0.0001 \nAge 1.04  1.02-1.06 <0.0001 \nPMH of AMI 1.74  1.22-2.47 0.002 \nUse of beta blockers 0.69 0.49-0.98 0.049 \nGender 0.74 0.52-1.04 0.081 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 22\n \n \nFigure 1  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 23\n \nFigure 2a \n \n \n 24\n \nFigure 2b \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 25\n  \nCT-proET-1 < median  \nCT-proET-1 > median  \nFigure 3 \n \n \n \n \nNTproBNP < median  \nNTproBNP > median  \nFigure 4 \n \n \n 26\n \n1  \n2  \n3  \n4  \nFigure 5 \n \n \n \n \n \n \n \n \n"}