{"doi":"10.1080\/09669580208667154","coreId":"101701","oai":"oai:epubs.surrey.ac.uk:1131","identifiers":["oai:epubs.surrey.ac.uk:1131","10.1080\/09669580208667154"],"title":"The Disability Discrimination Act: Time for the Stick?","authors":["Miller, G","Kirk, E"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1131<\/identifier><datestamp>\n      2017-10-31T14:00:46Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1131\/<\/dc:relation><dc:title>\n        The Disability Discrimination Act: Time for the Stick?<\/dc:title><dc:creator>\n        Miller, G<\/dc:creator><dc:creator>\n        Kirk, E<\/dc:creator><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1131\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Miller, G and Kirk, E  (2002) The Disability Discrimination Act: Time for the Stick?   Journal of Sustainable Tourism, 10 (1).  pp. 82-88.      <\/dc:identifier><dc:relation>\n        10.1080\/09669580208667154<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1131\/","10.1080\/09669580208667154"],"year":2002,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"The Disability Discrimination Act: Time for the Stick?  \n 1 \n \nThe Disability Discrimination Act:  \nTime for the Stick? \n \nDr Graham A. Miller \nUniversity of Westminster \n35 Marylebone Road \nLondon \nNW1 5LS \nTel: +44 207 911 5000 ext 3054 \nFax: +44 207 911 5171 \nEmail: G.Miller01@wmin.ac.uk \n \nEmma Kirk \nSouth Bank University \nSouthwark Campus \n103 Borough Road \nLondon \nSE1 0AA \nThe Disability Discrimination Act: Time for the Stick?  \n 2 \n \nThe Disability Discrimination Act: Time for the Stick? \n \nAbstract \nThis paper explores the extent to which the UK tourism industry has accepted the increased \nstandards of performance under the new Disability Discrimination Act.  The research utilises \nthe mystery shopper technique to request basic information from two hundred and ten \nrandomly selected companies from various sectors of the tourism industry.  The request \nstated that the mystery shopper is visually impaired and would like to use the services \nprovided by the company.  Results show generally an extremely low ability of organisations to \nmeet the simple requests made, although some sectors of the industry were more able to \ncomply than others.   \n \nKeywords: Disability, Discrimination, Access    \n \nIntroduction \nHunter (1995) describes the dominant paradigm of sustainable tourism as being too “tourism-\ncentric” when what is needed is a less parochial approach to the topic.  Whether a narrow \ndefinition is taken, which relates more to the sustaining of the tourism industry, or the broader \ndefinition, which equates to tourism that promotes sustainable development, issues of equity \nand fairness are central (Miller 2001).  A key tenet of equity is social inclusion, although the \nsubject is more usually understood by attempts to limit exclusion.  As such, the study of the \nextent to which disabled tourists are able to enjoy an equal service to that enjoyed by non-\ndisabled tourists can be seen as an essential part of sustainable tourism and sustainable \ndevelopment. \n \nIn 1995, the UK government introduced the Disability Discrimination Act, which made it illegal \nto; \n• Refuse to serve a disabled person (S19)(1)(a) \nThe Disability Discrimination Act: Time for the Stick?  \n 3 \n• Provide disabled people with a lower standard of service, or a service in a worse \nmanner (S19(1)(c) \n• Provide a disabled person with a service on worse terms (S19(1)(d) \n \nSince then, the Act has been toughened, with the addition of the most recent part of the act in \nOctober 1999.  This requires organisations to; \n• Change practices, policies or procedures which make it impossible or unreasonably \ndifficult for disabled people to use a service. \n• Provide auxiliary aids or services which could make it easier, or enable, disabled \npeople to use a service. \n• Overcome physical features which make it impossible or unreasonably difficult for \ndisabled people to use a service, by providing the service by a reasonable method \ninstead. \n \nThe extent to which “access for all” has been recognised as a central element of sustainability \nis demonstrated by its inclusion in the UK government’s tourism policy, and so this research \naimed to test how far tourism organisations were adhering with the new policy and regulation.  \nIt is a rare sign of the government’s commitment to this aspect of the tourism policy that it \ncommands the backing of legislation rather than the more usual frameworks and guidelines.  \nThis legislative stick has become even heavier throughout the course of the year 2000, with \nthe introduction of the Disabilities Rights Commission.  This commission, as with those for \nracial and sexual discrimination, has the powers to investigate and bring charges against non-\nconforming organisations.  This research shows how far the threat of financial penalty for non-\ncompliance could be waved.   \n \nBackground \nCampbell (2000) explains how the new DDA represents both a stick and a carrot for tourism \ncompanies.  With upwards of 8 million disabled people in the UK and an ageing population, \ncatering for the needs of this population represents a considerable enticement to amend \ncurrent practices that exclude disabled people.   \nThe Disability Discrimination Act: Time for the Stick?  \n 4 \n \nThe valuation of this market varies, but the English Tourist Council (English Tourist Board, at \nthe time) estimates the market to be worth £6billion to the British Tourist Industry (Times \n1996).  Yet, 34% of disabled people did not take a holiday in 1998 and only 6% took a short \nbreak (ETC no date).  This is despite research showing 76% of disabled people thought \ntaking a holiday was important to them, a figure that rose to 84% of people aged between 16 \nand 44 years old (Inra 1999 cited in Royal National Institute for the Blind 2000a).  In addition \nto this potential market, must be added the financial benefit accrued from carers and family \nmembers who are likely to travel with disabled people.  Thus, for the organisation willing to \nmake the necessary changes to current practices, there is a large financial benefit to behold \nas well as advancing the rights of disabled people in society. \n \nHowever, Campbell (2000:A115) concluded his article by stating, “The current standards of \nprovision for disabled people vary enormously from company to company…on the whole \nthough, the present standards of service provision for disabled persons are far from \nsatisfactory and there is much to be done to address this…They will have to start to take an \nactive interest in the needs of disabled people and begin to work towards improvement”.  \n \nThe research conducted for this article tests how tourism companies in the UK have begun to \nwork towards compliance with the DDA, and examines just how much work there is to do. \n \nThe Research \nOf the 8 million disabled people in the UK, almost I million are blind or visually impaired, plus \na further 700,000 who have some difficulties in seeing, and with an ageing population this \nfigure is only set to increase (RNIB 2000b).  Research by the RNIB shows 60% of those blind \nor with a visual impairment can be enabled if the written information meets simple \nrequirements such as utilising large print, contrasting text and page colours and avoiding thin \nor glossy paper (see table one).   \n \nThe Disability Discrimination Act: Time for the Stick?  \n 5 \nInsert Table One Here \n \nThe RNIB argues, “Information is the key to independence.  Independence is power.  RNIB \nbelieves that blind and partially sighted people have a right to information in a format which is \nappropriate, without undue delay or additional charge” (RNIB 2000b).  While Wickham & \nSullivan (1999:44) state, “The most important omission from the point of view of visually \nimpaired visitors is the lack of access to printed information”. \n \nIndeed, in a world increasingly reliant on information, disabled people risk further social \nexclusion, not to mention frustration, by information not being available in a format that is \nappropriate to them.  Further, if disabled people are not made aware of the services that a \ntourism organisation provides, then the full benefits of any efforts made at the destination \nitself are likely to be wasted.  The DDA requires that auxiliary aids and services be provided \nto enable a disabled person to use a service, and the provision of information in a suitable \nformat would be included within this category.  As this would appear to be the most \nstraightforward requirement made of organisations, and yet also a requirement that could \naffect a vast number of people, this was the area of compliance tested.  It was anticipated that \nthe level of compliance with the DDA would not be high, and thus a very simple request was \nmade of all the organisations.   \n \nThe annually produced Travel and Tourism Directory divides the industry into seven \nconstituent parts.  Broadly reflecting the number of entries for each section, twenty companies \nwere randomly selected from the road, sea, air and rail companies, sixty from each of the \nattractions and hotels sections and ten from the tourist board entries.  Thus, in total, two \nhundred and ten companies providing tourism services were selected and written to, utilising \na mystery shopper approach, requesting basic information on prices, times and directions in \norder to be able to use the service of the organisation.  The letter stated that the sender was \nvisually impaired and would like the information to be sent in either a Braille or large print \nformat, and specified the size font that would be readable.  Although a mail merge facility was \nemployed to generate the letters, each was individually tailored to the specifics of the \nThe Disability Discrimination Act: Time for the Stick?  \n 6 \nrecipient.  The letter itself was sent in a large print format and in accordance with the RNIB’s \nClear Print Guidelines.     \n \nThe research adapted the Dillman total design method (Dillman et al 1974) and ten days after \nsending the letters, reminders were sent to those organisations who had not replied, after \nanother ten days a further round of reminders were sent, and then a final round of letters were \nmailed one month after the original request.  While this approach is derived from social \nscience to produce the maximum response rate, it was also felt that three letters would \nrepresent the number of times even the most patient of potential customers would persist with \na company.  A control group of requests made in standard print requesting the same \ninformation was not utilised, as it was assumed that all profit seeking organisations would \nrespond if possible to an inquiring customer.  Research by Wickham & Sullivan (1999) of UK \nheritage sites showed that 97% of sites visited had information available in standard format, \nwhile only 31% could produce Braille guides, 27% audio guides and just 15% were available \nin large print.  Thus, limited research funds were focused on testing the extent of \norganisations capabilities rather than their core competencies.  Future research may care to \nexamine this assumption.   \n \nThe Results \nOf the 210 letters sent to organisations, 32% (68) did not reply in any way, and a further 10 \nletters were returned to sender.  While a 68% response rate can be considered satisfactory, \ntable two shows the uneven distribution of these non-replies.  The low sample size prevents \nconclusive statistical evidence, but it would perhaps not be unreasonable to suggest that the \nvariation in replies is at least in part due to the ability of organisations to reply, and thus \ncomply with the DDA.  Of note are the third of hotels who did not reply, 45% of sea travel \norganisations and 55% of road travel companies, as compared to less than 12% of attractions \nwho did not reply.   \n \nInsert Table Two Here \n \nThe Disability Discrimination Act: Time for the Stick?  \n 7 \nTable three shows the responses of those who did reply.  There was a large variety in the \nquality of responses, as identified by Campbell’s (2000) comments at the beginning of the \narticle.  While no company was able to reply with Braille as the letter had requested, 35 \ncompanies did reply with a large print letter and a further 10 showed initiative and ran the \nstandard letter through the photocopier machine until it was larger.  Such simple steps are all \nthat are required to comply with the DDA.  The act requires only that “reasonable” steps be \ntaken to accommodate disabled people, there is no intention to bankrupt tourism \norganisations, but it would be a poor definition of reasonable that was not able to include a \nlittle extra thought and consideration.  Special mention must be given to the person at \nBrighton Pier who drew a wonderful map by hand on a large piece of paper and then included \ndirections in large print in the letter.  Such care and concern will prove invaluable in attracting \nand retaining disabled customers.   \n  \nInsert Table Three Here \n \nThe largest category of respondents replied with a large print letter, but a standard brochure.  \nIn some cases the letter acknowledged that the brochure was not appropriate but hoped that \nit would be better than nothing.  Often it wasn’t, as the extensive use of colour in brochures \nmeans the main problem is one of contrast rendering text over the top of photographs and \npictures illegible.  This problem is all the more frustrating as the plain text version of a \nbrochure is a necessary precursor to any colourful brochure produced.  Thus, with some \nforward planning and consideration, the plain text version could be retained and then \nreproduced in large print, or any other format, as requested. Other letters expressed their \nintention to pass the failing onto their marketing and communications departments in order to \naddress the deficiency.  Such replies reflected the recency of the DDA and a willingness of \norganisations to respond, and as such should be applauded.  Yet, while such organisations \nproduced amongst the better responses, they have still been unable to provide a disabled \ntourist with the same level service afforded to an able bodied tourist.   \n \nThe Disability Discrimination Act: Time for the Stick?  \n 8 \nFrom evidence of some consideration, the next categories of response showed little thought \nor effort.  Seven companies replied in standard print that they did not have a brochure in an \nappropriate format and so would have to refer the request, while 36 organisations ignored all \nrequests made in the letter and replied with a standard letter and standard brochure.  \nDisappointingly, four of these organisations were tourist boards, many of whom run disability \ntraining schemes.  This serves to demonstrate the need for training to permeate throughout \nan organisation and not just rest with a policy or the well intentioned few.  Indeed, a future \nresearch option is to request a copy of the company’s policy concerning the provision of \ninformation to disabled people independent of the mystery shopping research.  Wickham & \nSullivan (1999) adopted this methodology by asking about the level of alternative information \nprovision and then subsequently conducting a site visit.  The result was broadly similar data.  \nSuch an approach was not adopted for this research because without funds for site visits \nthere was an unknown risk of low response rates for the two separate requests not producing \nthe two separate pieces of data for analysis.  However, a satisfactory response rate for this \nresearch may indicate that, with funding, an approach checking policy against action is \npossible for the future. \n \nThe final groups of respondents included 11 organisations that sent hand-written replies, \nwhich were difficult for a fully sighted person to understand and the remaining 3 organisations \nsent what can only be described as truly “miscellaneous” replies that included one job \napplication form.   \n \nBy specifying in the letter to organisations the nature of the impairment and what format the \nreply should take, any organisations falling to meet those requests were in breach of the DDA \n1999. Thus, taking a strict interpretation of what was asked for, only 45 organisations were \nable to comply, although a further 40 made some effort and promised future improvements.  It \nwill be insightful to repeat the research in a year to determine which of these organisations \nhave responded to the challenge that they promised to investigate.  However, for the majority \nof those surveyed, even the simplest of request has proved to be too challenging and in the \nprocess displayed an inability to attract nearly 2 million visually impaired and ageing potential \nThe Disability Discrimination Act: Time for the Stick?  \n 9 \ncustomers.  Had the research been repeated for a more stringent or challenging request, \nwhere the defence of cost could be waved, then it is reasonable to assume that the levels of \ncompliance would have been even lower. \n \nAcross the industry categories there is a clear variety in quality of response and the \nattractions sector should be identified for praise.  Of concern is the mixed response from the \ntourist boards, who have a clear responsibility to promote social inclusion, quite apart from \ntheir private sector commitments to their members.  It will be interesting to test in future work, \nwhether the public sector is any better at meeting the DDA requirements through a sense of \nsocial responsibility, than the private sector has been through the motivation of access to a \nwider market.  Future areas of testing could also include those organisations that have been \nin receipt of government or lottery funding. \n \nConclusions \nMeeting the requests made by this research should not have been difficult, it requires only \nthought and awareness of the problems faced by a disabled person.  The overall picture is \none of non-understanding, or misunderstanding as to how to deal with requests from disabled \npotential customers.  Many of the companies surveyed can be described as excellent in the \nprovision of service to the able bodied customer, but this research has demonstrated a gap in \nthe quality of their total offering.  In the past, tourism organisations not addressing disabled \nissues were guilty of missing a market opportunity and a lack of social equity.  Now, if tourism \norganisations continue to fail to meet the often simple and reasonable needs of customers, \nwho are trying to use tourism services, then it would not be unreasonable to believe that the \nthreat of the stick, rather than the lure of the carrot will describe the future.  Unfortunately, the \nDDA does not go away by attempting to bury the corporate head in the sand and refusing to \ncome up until the awkward questions have gone away. \n \nThe Disability Discrimination Act: Time for the Stick?  \n 10 \nReferences \nCampbell, B (2000) Catering for Disabled People – The Carrot, the Stick and the Way \nForward.  Insights, January, A-111 – A115 \nDillman, D.A., Christensen, J.A., Carpenter, E.H., Brooks, R.M (1974) Increasing Mail \nQuestionnaire Responses: A Four State Comparison.  American Sociological Review, 39, \npp755 \nEnglish Tourism Council (no date) Welcoming Disabled Travellers.  ETC, London \nHunter, C (1995) On the Need to Re-conceptualise Sustainable Tourism Development.  \nJournal of Sustainable Tourism, 3 (3), pp155-165 \nMiller, G (2001) The Development of Indicators for Sustainable Tourism: Results of a Delphi \nSurvey of Tourism Researchers.  Tourism Management, 22, 4, pp351-362 \nRoyal National Institute for the Blind (2000a) Welcoming Your Visually Impaired Customers: \nTourism, RNIB, London \nRoyal National Institute for the Blind (2000b) Clear Print Guidelines.  \nhttp:\/\/www.rnib.org.uk\/wesupply\/fctsheet\/clearp.htm, 23\/03\/2000 \nThe Times (1996) New Disabled Law “will boost tourism”.  December 5th  \nWickham, C., Sullivan, P (1999)  Magical Mystery Tour: Access to Historic Sites and Buildings \nfor Visually Impaired Visitors.  University of Bristol Disability Unit. \nThe Disability Discrimination Act: Time for the Stick?  \n 11 \n \n \nTable One: Guidelines for Informational Products \n Source: Adapted from RNIB (2000b) \n \n \n \n \n  \nNo Reply Return to Sender Total \nRail Travel 3 1 4\/20 \nSea Travel 9 0 9\/20 \nAir Travel 6 3 9\/20 \nRoad Travel 11 3 14\/20 \nHotels 20 2 22\/60 \nAttractions 7 1 8\/60 \nCompany Type \nTourist Boards 2 0 2\/10 \nTotal 56 10 68\/210 \nTable Two: Non-respondents \n \n \n \nQuality of Responses \n  Large \nPrint \nLetter \nPhoto-\ncopied \nLetter \nLarge \nPrint \nLetter, \nStd \nBroch-\nure \nLarge \nPrint \nLetter, \nMatter \nFor-\nwarded \nStd \nLetter, \nMatter \nFor-\nwarded \nStd \nLetter \nStd \nbroch\n-ure \nHand-\nwritten \nreply \nMisc Total \nRail Travel  3 1 4 4 3  1 16\/20 \nSea Travel 4  1  1 4 1  11\/20 \nAir Travel 1 1 1   5 3  11\/20 \nRoad \nTravel 2     2 2  6\/20 \nHotels 9 3 13  1 10 1 1 38\/60 \nAttractions 15 3 19 1 1 8 4 1 56\/60 \nCo\nm\npa\nn\ny \nTy\npe\n \nTourist \nBoards 4     4   8\/10 \n \nTotal 35 10 35 5 7 36 11 3 142\/210 \nTable Three: Quality of Respondents \n \nPrinted Text Should Printed Text Should not \nBe a minimum of sized 14 font Exceed sized 20 font \nUse a medium to heavy weighted font Use glossy or thin paper \nProvide contrast with the colour of the page Print text in capital letters \nJustify paragraphs to the left  \nSpace words evenly  \nUse navigational aids such as headings  \nUse clear fonts e.g. sans serif   \n"}