{"doi":"10.1103\/PhysRevB.67.172506","coreId":"71650","oai":"oai:eprints.lancs.ac.uk:572","identifiers":["oai:eprints.lancs.ac.uk:572","10.1103\/PhysRevB.67.172506"],"title":"Logarithmic contribution to the density of states of rectangular Andreev billiards.","authors":["Kormanyos, Andor","Kaufmann, Z.","Cserti, J.","Lambert, Colin J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05-15","abstract":"We demonstrate that the exact quantum mechanical calculations are in good agreement with the semiclassical predictions for rectangular Andreev billiards, and therefore for a large number of open channels it is sufficient to investigate the Bohr-Sommerfeld approximation of the density of states . We present exact calculations of the classical path length distribution P(s), which is a nondifferentiable function of s, but whose integral is a smooth function with logarithmically dependent asymptotic behavior. Consequently, the density of states of rectangular Andreev billiards has two contributions on the scale of the Thouless energy: one which is well-known and is proportional to the energy, and the other which shows a logarithmic energy dependence. It is shown that the prefactors of both contributions depend on the geometry of the billiards but have universal limiting values when the width of the superconductor tends to zero","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71650.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/572\/1\/141.pdf","pdfHashValue":"213b97d66cc55b45ed969f5a5a484a8321bed038","publisher":null,"rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:eprints.lancs.ac.uk:572<\/identifier><datestamp>\n      2018-01-24T03:13:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Logarithmic contribution to the density of states of rectangular Andreev billiards.<\/dc:title><dc:creator>\n        Kormanyos, Andor<\/dc:creator><dc:creator>\n        Kaufmann, Z.<\/dc:creator><dc:creator>\n        Cserti, J.<\/dc:creator><dc:creator>\n        Lambert, Colin J.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We demonstrate that the exact quantum mechanical calculations are in good agreement with the semiclassical predictions for rectangular Andreev billiards, and therefore for a large number of open channels it is sufficient to investigate the Bohr-Sommerfeld approximation of the density of states . We present exact calculations of the classical path length distribution P(s), which is a nondifferentiable function of s, but whose integral is a smooth function with logarithmically dependent asymptotic behavior. Consequently, the density of states of rectangular Andreev billiards has two contributions on the scale of the Thouless energy: one which is well-known and is proportional to the energy, and the other which shows a logarithmic energy dependence. It is shown that the prefactors of both contributions depend on the geometry of the billiards but have universal limiting values when the width of the superconductor tends to zero.<\/dc:description><dc:date>\n        2003-05-15<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/572\/1\/141.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevB.67.172506<\/dc:relation><dc:identifier>\n        Kormanyos, Andor and Kaufmann, Z. and Cserti, J. and Lambert, Colin J. (2003) Logarithmic contribution to the density of states of rectangular Andreev billiards. Physical Review B: Condensed Matter, 67 (17). p. 172506. ISSN 1550-235X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/572\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevB.67.172506","http:\/\/eprints.lancs.ac.uk\/572\/"],"year":2003,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW B 67, 172506 ~2003!Logarithmic contribution to the density of states of rectangular Andreev billiards\nA. Korma´nyos,* Z. Kaufmann, and J. Cserti\nDepartment of Physics of Complex Systems, Eo¨tvo¨s University, H-1117 Budapest, Pa´zma´ny Pe´ter se´ta´ny 1\/A, Hungary\nC. J. Lambert\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n~Received 18 October 2002; published 15 May 2003!\nWe demonstrate that the exact quantum mechanical calculations are in good agreement with the semiclas-\nsical predictions for rectangular Andreev billiards, and therefore for a large number of open channels it is\nsufficient to investigate the Bohr-Sommerfeld approximation of the density of states. We present exact calcu-\nlations of the classical path length distribution P(s), which is a nondifferentiable function of s, but whose\nintegral is a smooth function with logarithmically dependent asymptotic behavior. Consequently, the density of\nstates of rectangular Andreev billiards has two contributions on the scale of the Thouless energy: one which is\nwell-known and is proportional to the energy, and the other which shows a logarithmic energy dependence. It\nis shown that the prefactors of both contributions depend on the geometry of the billiards but have universal\nlimiting values when the width of the superconductor tends to zero.\nDOI: 10.1103\/PhysRevB.67.172506 PACS number~s!: 74.45.1c, 03.65.Sq, 05.45.Mt, 74.50.1rWhen a normal quantum dot is placed in contact with a\nsuperconductor, the low-energy density of states n(E) of the\nresulting Andreev billiard is strongly modified compared\nwith the normal state.1 The energy dependence of n(E) is\nhighly nontrivial and provides a testing ground for current\nunderstanding of proximity effects of hybrid superconduct-\ning nanostructures and for theoretical tools such as semiclas-\nsical theory. Recently a number of conflicting results have\nbeen obtained for the density of states ~DOS! of ballistic\nAndreev billiards ~AB!. One example is shown in Fig. 1,\nwhich in the separable limit W5a was studied long ago in,2\nwhere it was found that for small E, n(E) is proportional to\nE. In contrast for W,a , the problem has only recently been\nstudied.1,3,4,6,5 In Ref. 3 it was found that n(E)5nE , where\nn is a universal constant, independent of E and W. In con-\ntrast, Ref. 4 predicted different values for n .\nIn this paper we resolve this discrepancy by showing that\nneither of these results is strictly correct in the limit E→0\nand instead predict that n(E) diverges logarithmically. This\ngeneric logarithmic contribution is significant for energies\nless than or of the order the Thouless energy.\nTo address this problem, we use both exact and semiclas-\nsical techniques to analyze the AB of Fig. 1. The exact cal-\nculation starts with a ballistic two dimensional normal dot of\narea A, described by a scattering matrix S0(E) and with a\nFIG. 1. A normal quantum dot of rectangular shape in contact\nwith a superconductor placed at the middle of the edge of the nor-\nmal region.0163-1829\/2003\/67~17!\/172506~4!\/$20.00 67 1725mean level spacing for the isolated normal system d\n52p\\2\/mA at the Fermi energy EF . Then, a supercon-\nductor of width W and bulk order parameter D is placed in\ncontact with such a billiard. The number of open channels in\nthe S region is the integer part of M5kFW\/p , and the en-\nergy levels of AB are the positive eigenvalues E ~measured\nfrom the Fermi energy! of the Bogoliubov–de Gennes\nequation.7 A secular equation of the exact energy levels of\nAB, in terms of the scattering matrix S0(E) of the normal\nregion, is derived by matching the wave functions at the\ninterface of the normal-superconducting (N-S) systems. The\nenergy levels are exact in the sense that no Andreev approxi-\nmation @D\/EF!1 and quasiparticles whose incident or re-\nflected directions are approximately perpendicular to the N-S\ninterface8 ~BS!# is assumed.\nWe also give the semiclassical Bohr-Sommerfeld approxi-\nmation of the DOS n(E) expressed by the classical return\nprobability P(s) of the electron. Our exact and semiclassical\ncalculations are applied to the integrable AB shown in Fig.\n1. We demonstrate that the integrated DOS agrees very well\nwith the exact calculations. We find that the integral of the\nreturn probability P(s) has a contribution depending on s\nlogarithmically in the asymptotic limit, s→‘ , which has to\ndate been overlooked. As a consequence, the small energy\ndependence of the DOS n(E) has also a logarithmic factor in\naddition to a contribution which depends linearly on the en-\nergy E as predicted in Refs. 3 and 4.9\nIn our earlier work5 we found that the exact energy levels\nof AB with arbitrary shape of normal region are the solutions\nof the following secular equation:\ndet@Im$gDe~E !Dh~E !%#50, ~1a!\nwhere\nDe~E !5Q~E !1K~E !G~E !, ~1b!\nDh~E !5@Q~2E !2K~2E !G*~2E !#21, ~1c!©2003 The American Physical Society06-1\nBRIEF REPORTS PHYSICAL REVIEW B 67, 172506 ~2003!G~E !5@12S0~E !#@11S0~E !#21. ~1d!\nHere g5e1iarccos(E\/D), Q and K are diagonal matrices with\nelements Qnm(E)5dnmqn(E) and Knm(E)5dnmkn(E),\nwhere qn(E)5kFA11iAD22E2\/EF2n2\/M 2 are the trans-\nverse wave numbers of the electron in the S region, and\nkn(E)5kFA11E\/EF2n2\/M 2 are the transverse wavenum-\nbers of the electron in the S region when D50. It is assumed\nthat the Fermi wavenumber, kF5A2mEF \/\\2, is the same in\nthe S and N regions. All the matrices are M3M dimensional.\nAll the information on the normal region are incorporated in\nthe matrix G via the scattering matrix S0(E). Note that the\nsecular equation ~1a! is an extension of that derived for box\nand disk geometries in Ref. 6.\nThe density of states in the semiclassical Bohr-\nSommerfeld approximation is written as5\nn~E !5ME\n0\n‘\nds P~s !F s\\vF 1 1AD22E2G\n3 (\nn50\n‘\ndX sE\\vF 2S np1arccosED D C. ~2!\nThis expression reduces to that of by Melsen et al.,3 Schom-\nerus and Beenakker,1 Lodder and Nazarov,1 and Ihra et al.,4\nin the limit E!D and when the coherence length in the\nsuperconductor, j05\\vF \/D!2d . In that case, the energy\ndependent phase shift 2arccos(E\/D), due to Andreev reflec-\ntions, was approximated by p\/2. However, our expression is\nvalid without such an approximation, and essentially im-\nproves the agreement between the exact and the Bohr-\nSommerfeld approximation of the DOS ~see also Ref. 5!.\nFrom Eq. ~2! one can find a simple expression for the\nintegrated DOS N(E)5*0En(E8)dE8:\nN~E !5M (\nn50\n‘\n$12F@sn~E !#%, ~3a!\nwhere\nsn~E !5\n~np1arccos E\/D!\nE\/D j0 , ~3b!\nF~s !5E\n0\ns\nP~s8!ds8, ~3c!\nwhere F(s) is the integrated distribution function of the re-\nturn probability of the electron. Note that P(s) is normalized\nto one, i.e., F(‘)51.\nTo obtain the exact energy levels of the AB shown in Fig.\n1, we need to calculate the scattering matrix S0(E) of the N\nregion. Following the same approach as Mortensen and\nco-workers,10 we obtain\nS0~E !5%R~X ,Q !%T21, ~4!\nwhere\nR~X ,Q !52~11Q !21$122X2@11X21Q~12X2!#21%.17250Here X is a diagonal matrix with elements Xmn\n5dmn exp(iknd), Q5%T% , and % is a @kFW\/p#3@kFa\/p#\ndimensional matrix with elements given by the overlap inte-\ngrals defined in Ref. 10 (@\u0095# stands for the integer part!.\nNotice that if W5a , then %51 and the scattering matrix\nS0(E)52X2 is a diagonal matrix. In this case, we obtain the\nsame secular equation for AB as that in Ref. 6 for box ge-\nometries.\nIn Fig. 2 the exactly ~numerically! computed integrated\ndensity of states obtained from Eq. ~1! and its evaluation in\nBohr-Sommerfeld ~BS! approximation using Eq. ~3! are\nshown for different widths W of the lead @for the calculation\nof P(s) see below#. This shows that the exact calculations\nand the semiclassical predictions are in very good agreement.\nCalculations for P(s) and F(s) start with unfolding the\ntrajectory of the electron, i.e., using the fact that the free\nmotion of the particle in the billiard is equivalent to its flight\nin a lattice of vertical intervals with length W and with lattice\nconstant 2d ~a! in the horizontal ~vertical! direction. In gen-\neral, one can calculate P(s) by using a large number of\ntrajectories and determining the distribution of their path\nlengths. An analytic form of P(s) and F(s) can be derived\nfor W>a\/2. As an example, these functions are plotted for\nd5a and W5a\/2 in Fig. 3. Clearly, for arbitrary W, P(s)\n50 for s,2d and for larger s it is a nondifferentiable func-\ntion possessing a singularity at s52d and peaks at multiples\nof 2d . Using Eq. ~2! one can calculate the DOS and pro-\nnounced peaks ~indeed singularities! arise due to the singu-\nlarity of P(s) at s52d . The positions of these singularities\nin the DOS are in perfect agreement with that obtained from\nthe general expression derived in Ref. 6.\nFIG. 2. The integrated density of states N(E) from exact quan-\ntum mechanical calculations ~solid lines! and from the Bohr-\nSommerfeld approximation given by Eq. ~3! ~dashed lines! as func-\ntions of E ~in units of D) for W50.8a ~a! and W50.5a ~b!. Insets\nshow the enlarged portions of N(E) from exact calculations ~solid\nline!, its BS approximation from Eq. ~3! ~dotted line!, and its\nasymptotic form from Eq. ~8a! ~dashed line!. In both cases d5a\nand the parameters are M555.5, D\/EF50.015.6-2\nBRIEF REPORTS PHYSICAL REVIEW B 67, 172506 ~2003!The integrated path length distribution F(s) is a smooth\nfunction of s allowing one to obtain its asymptotic form\nFa(s) for s→‘ ~see the inset of the top panel of Fig. 3!.\nFrom Eq. ~2! one can see that the large s behavior of P(s) is\nrelated to the low energy dependence of the DOS. Due to the\nrapid variation of P(s), it is difficult to define its asymptote.\nTo avoid this problem we first calculate the asymptotic be-\nhavior of F(s) and the asymptotic form of P(s) is then cal-\nculated from Pa(s)5dFa(s)\/ds ~see also the bottom panel\nof Fig. 3!. For s→‘ the analytical form of the asymptote of\nF(s) is found by considering how particles can travel a large\ndistance s without hitting the vertical intervals of length W in\nthe unfolded space. Such trajectories lie only in certain di-\nrections forming corridors with slopes u that are multiples of\na\/(2kd), where k5@W\/a# . The probability that a particle\nruns in such a corridor is proportional to 1\/(us2) for large u\nbut uuu,umax5s\/xmin , where xmin is a minimal displacement\nin the horizontal direction. Summation of the probabilities\nfor these corridors yields a term proportional to s22ln umax .\nDirections with slopes larger than umax should be treated\nseparately and the result contains a term s22ln xmin . The\nabove terms from the two regions sum up to s22ln s, and\nfinally we find\nF~s !’Fa~s ![12S C11C2ln sAA D As2 ~5!\nfor large s. Here C1 and C2 are functions of d\/a and W\/a .\nFor the case W>a\/2 the detailed calculation gives analytic\nexpressions also for C1 and C2:\nFIG. 3. Top panel: the return probability P(s) ~solid line! and its\nintegral F(s) ~dashed line! as functions of s\/d for W5a\/2 and d\n5a . In the inset F(s) ~solid line! and its asymptotic form Fa(s)\ngiven by Eq. ~5! ~dashed line! are plotted as functions of s\/d for\nlarge s. Bottom panel: P(s) ~solid line and left y axis! for larger s\nalong with the asymptotic expression of the return probability\nPa(s)5dFa(s)\/ds ~dashed line and right y axis!.17250C15\nd\na\nS 826W\na\nD1C2Fc2 12 ln~d\/a !G , ~6a!\nC25\n4d\nW S 12 Wa D\n2\n, ~6b!\nc5g1\n1\n2 12(j51\n‘\nK0S 4p j da D . ~6c!\nHere g is the Euler-Mascheroni constant and K0 is the modi-\nfied Bessel function of the second kind. Therefore, c is a\nweakly dependent function of d for d>a .\nIn the case of W,a\/2 additional passages with slopes\ncorresponding to noninteger multiples of a\/(2d) open and\nC1 ,C2 are modified. C1 is numerically determined, while for\nC2 we have the formula\nC25\n4d\nW (m51\n[a\/W] Nm\nm\nS 12m W\na\nD 2, ~7!\nwhere Nm is the number of those integers in the interval\n@0,m21# which are relative prime to m. ~Note that\nN151).\nUsing the smooth asymptote of F(s) given by Eq. ~5! and\nEqs. ~3!, an analytic expression can be found for the low\nenergy behavior of the DOS:\nNa~E !5\nM\n8p2\nS EETD\n2Fa1bS 12 2ln EETD G , ~8a!\nna~E !d5\n1\np\nE\nET\nS a2b ln EETD , ~8b!\na5\nW2\nA FC11C2S k1ln 2p2W\/AA D G , ~8c!\nb5\nW2\nA C2 , ~8d!\nk52\n1\n2 2\n4\n3 ln 22\n6\np2\nz8~2 !’20.854 235, ~8e!\nand ET5Md\/(4p) is the Thouless energy.3 Besides the term\nproportional to the energy ~which was also predicted in Refs.\n3 and 4!, there is an additional logarithmic factor. Moreover,\nin contrast to the above mentioned references the coefficient\na depends on W, a, and d. However, b depends only on\nW\/a . Note that W5a is a special case corresponding to the\nsystem studied by de Gennes and Saint-James.2 Then, C2\n50 and no logarithmic factor appears in the DOS and the\nresult is the same as in Ref. 6.\nIt is interesting to see the W!a limit for which one would\nexpect that P(s) has a universal limiting form, namely it is\nonly a function of W2\/A . In this case, the electron has\nenough time to explore the whole available phase space be-6-3\nBRIEF REPORTS PHYSICAL REVIEW B 67, 172506 ~2003!fore escaping ~even in an integrable billiard! and P(s) looses\nany detailed dependence on the geometry of the billiard.\nTherefore, two billiards with the same W2\/A but different\naspect ratio (d\/a) should have the same path length distri-\nbution for small enough W. From numerical calculations we\nfound that for W→0, a converges to a value a’3.62 inde-\npendent of the aspect ratio, i.e., it becomes a universal con-\n*Electronic address: kor@complex.elte.hu\n1 I. Kosztin, D. L. Maslov, and P. M. Goldbart, Phys. Rev. Lett. 75,\n1735 ~1995!; A. Altland and M. R. Zirnbauer, ibid. 76, 3420\n~1996!; G. B. Lesovik, A. L. Fauche`re, and G. Blatter, Phys.\nRev. B 55, 3146 ~1997!; A. Lodder and Y. V. Nazarov, ibid. 58,\n5783 ~1998!; H. Schomerus and C. W. J. Beenakker, Phys. Rev.\nLett. 82, 2951 ~1999!; W. Ihra and K. Richter, Physica E ~Am-\nsterdam! 9, 362 ~2001!.\n2 P. G. de Gennes and D. Saint-James, Phys. Lett. 4, 151 ~1963!.\n3 J. A. Melsen, P. W. Brouwer, K. M. Frahm, and C. W. J. Beenak-\nker, Europhys. Lett. 35, 7 ~1996!; J. A. Melsen, P. W. Brouwer,\nK. M. Frahm, and C. W. J. Beenakker, Phys. Scr., T 69, 223\n~1997!.\n4 W. Ihra, M. Leadbeater, J. L. Vega, and K. Richter, Eur. Phys. J.\nB 21, 425 ~2001!.\nFIG. 4. Top panel: a as a function of W\/a for d\/a\n51,2,1\/2,1\/4,1\/8. Bottom panel: b as a function of W\/a obtained\nfrom Eq. ~8d! using Eqs. ~6b! and ~7! for C2. The inset of the top\npanel shows the asymptotic DOS na(E) ~in units of 1\/d) for d\n5a , W\/a51,0.5,0.1,0.01 ~dot-dashed, dotted, long-dashed, and\ndashed lines, respectively! and the result from Ref. 3 ~solid line!.17250stant. Similarly we find that when W→0, b also tends to a\nuniversal constant b→8\/p2. These results are demonstrated\nin Fig. 4. In the inset of the top panel of Fig. 4 the asymptotic\nDOS na(E) obtained from Eq. ~8b! is plotted for different\nvalues of W along with the result from Ref. 3 for the sake of\ncomparison. Our results are in the same order of magnitude\nas that found in Melsen et al.3 and Ihra et al.4 However, from\nour analysis it turns out that the functional form of the\nasymptotic DOS is not just a linear function but involves a\nlogarithmic factor.\nIn conclusion, we have shown that exact quantum me-\nchanical calculations for the integrated DOS of rectangular\nAndreev billiards agrees well ~for the whole energy range\nbelow the gap! with that obtained from the Bohr-Sommerfeld\napproximation provided the energy dependent phase shift is\ntaken into account. From the exact analytic form of the as-\nymptote of the integrated return probability, we predict a\nnew, logarithmic contribution to the DOS on the scale of the\nThouless energy. In contrast to earlier results, we show that\nthe DOS at this energy range explicitly depends on W, a, and\nd but it has a universal limiting form for small enough W. We\nalso investigated the case when the superconductor is placed\nanywhere at the side of the rectangle and found that the\nlogarithmic contribution in the DOS is generic for rectangu-\nlar Andreev billiards.\nOne of us ~J.Cs.! gratefully acknowledges very helpful\ndiscussions with C. W. J. Beenakker. This work was sup-\nported in part by the EU’s Human Potential Program under\nContract No. HPRN-CT-2000-00144, the Hungarian-British\nIntergovernmental Agreement on Cooperation in Education,\nCulture, and Science and Technology, and the Hungarian\nScience Foundation OTKA TO34832. One of us ~Z.K.!\nthanks the Hungarian Academy of Sciences for its financial\nsupport as a Ja´nos Bolyai Research Fellowship.\n5 J. Cserti, A. Korma´nyos, Z. Kaufmann, J. Koltai, and C. J. Lam-\nbert, Phys. Rev. Lett. 89, 057001 ~2002!.\n6 J. Cserti, A. Bodor, J. Koltai, G. Vattay, Phys. Rev. B 66, 064528\n~2002!.\n7 P. G. de Gennes, Superconductivity of Metals and Alloys ~Ben-\njamin, New York, 1996!.\n8 C. J. Lambert and R. Raimondi, J. Phys.: Condens. Matter 10,\n901 ~1998!; O. Sˇ ipr and B. L. Gyo¨rffy, ibid. 8, 169 ~1996!: J.\nLow Temp. Phys. 106, 315 ~1997!.\n9 In Refs. 3 and 4 the geometry of AB can be obtained by cutting\nour AB at its symmetry axis. Our results are irrelevant to this\ngeometrical difference.\n10 N. A. Mortensen, A.-P. Jauho, K. Flensberg, and H. Schomerus,\nPhys. Rev. B 60, 13 762 ~1999!.6-4\n"}