{"doi":"10.1016\/j.econlet.2009.06.010","coreId":"95629","oai":"oai:eprints.lse.ac.uk:25514","identifiers":["oai:eprints.lse.ac.uk:25514","10.1016\/j.econlet.2009.06.010"],"title":"Looming stations: valuing transport innovations in historical context","authors":["Ahlfeldt, Gabriel M.","Wendland, Nicolai"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10","abstract":"We investigate the impact of transport innovations on the productivity of urban locations in 1890–1936 Berlin, Germany. We find an increase in land value of up to 2.5% per 100 m decline in distance to urban railway station","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95629.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25514\/1\/Looming_stations_%28LSERO_version%29.pdf","pdfHashValue":"0b3f0eb1f595850815f77509523fda007ada0e9a","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25514<\/identifier><datestamp>\n      2010-10-01T09:28:07Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25514\/<\/dc:relation><dc:title>\n        Looming stations: valuing transport innovations in historical context<\/dc:title><dc:creator>\n        Ahlfeldt, Gabriel M.<\/dc:creator><dc:creator>\n        Wendland, Nicolai<\/dc:creator><dc:subject>\n        HE Transportation and Communications<\/dc:subject><dc:description>\n        We investigate the impact of transport innovations on the productivity of urban locations in 1890–1936 Berlin, Germany. We find an increase in land value of up to 2.5% per 100 m decline in distance to urban railway station.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2009-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25514\/1\/Looming_stations_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Ahlfeldt, Gabriel M. and Wendland, Nicolai  (2009) Looming stations: valuing transport innovations in historical context.  Economics Letters, 105 (1).  pp. 97-99.  ISSN 0165-1765     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/locate\/ecolet<\/dc:relation><dc:relation>\n        10.1016\/j.econlet.2009.06.010<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25514\/","http:\/\/www.elsevier.com\/locate\/ecolet","10.1016\/j.econlet.2009.06.010"],"year":2009,"topics":["HE Transportation and Communications"],"subject":["Article","PeerReviewed"],"fullText":"  \nGabriel M. Ahlfeldt and Nicolai Wendland \nLooming stations: Valuing transport \ninnovations in historical context \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nAhlfeldt, Gabriel M. and Wendland, Nicolai (2009) Looming stations: valuing transport \ninnovations in historical context. Economics letters, 105 (1). pp. 97-99. ISSN 0165-1765 \n \nDOI: 10.1016\/j.econlet.2009.06.010\n \n© 2009 Elsevier\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25514\/\n \nAvailable in LSE Research Online: October 2009 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nGabriel M. Ahlfeldta and  Nicolai Wendlandb \nLooming Stations:  \nValuing Transport Innovations in Historical \nContext‡ \nAbstract: We investigate the impact of transport innovations on the productivity of urban locations in 1890 – \n1936 Berlin, Germany. We find an increase in land value of up to 2.5% per 100 m decline in distance to urban \nrailway station. \nKeywords:  Transport Innovations, Land Values, Location Productivity, Economic History \nJEL classification: N7,N9, R33 \nVersion: June 2009 \n                                            \na\n  University of Hamburg, Department of Economics, Von Melle Park 5, 20146 Hamburg, Germany. \nTel. + 49 40 42838 5569. Fax. + 49 40 42838 6251. ahlfeldt@econ.uni-hamburg.de \n(corresponding author) \nb\n  Technical University Darmstadt, Department of International Economics, Marktplatz 15-\nResidenzschloß, 64283 Darmstadt, Germany, wendland@vwl.tu-darmstadt.de \n‡\n We thank an anonymous referee and participants at the KOF research seminar for valuable comments \nand suggestions. Andreas Matschens from the Landesarchiv Berlin is gratefully acknowledged for excel-\nlent archival support. Ahlfeldt also thanks the Swiss Economic Institute of the E.T.H. Zurich for its gen-\nerous hospitality. \nI Introduction \nSome of the economically most essential technological advances since the industrial \nrevolution comprise transport innovations that brought economic agents closer together. \nThe reduction of transport cost amplified agglomeration economies and economic \ngrowth along new major transport lines and, hence, sustainably reshaped the economic \ngeography of regions and cities. On an urban scale, increased location productivity, \nwhich mirrors in land value, may arise, e.g. from lower input prices due to reduced \ntransport cost, increased communication and human capital spillovers between firms. \nReduced labor market frictions or improved worker efficiency due to reduced \ncommuting effort (Gibbons and Machin, 2005) may further contribute to an increase in \neconomic wealth. Rapid transit networks constituted by metrorail and suburban or \ncommuter railway lines represent the backbone of urban mass transportation in many \nmodern metropolitan areas, particularly in Europe. The impact of rail transit on property \nprices has attracted much scholarly attention (Bowes and Ihlanfeldt, 2001; Gatzlaff and \nSmith, 1993; Gibbons and Machin, 2005; Mcmillen and Mcdonald, 2004).  \nWe follow an empirical approach that shares the basic ideas with Gibbons and Machin \n(2005) and reveals the marginal value of reduced distance to the next urban railway \nstation by application of a time-difference estimation strategy. Our analysis however, \ndiffers in at least three important aspects. In contrast to Gibbons and Machin (2005) we \nuse archival land values similar to McMillen (1996). There is no need for an adjustment \nfor housing characteristics. Also, the sample is strictly restricted to commercial areas \naccording to zoning regulations instead of using residential property data. Most \nimportantly, our analysis investigates the impact of new stations during the peak time of \nindustrialization, when the inauguration of the rapid transit network represented a major \nshock on intra-urban transport costs, accessibility, and hence, location attractiveness and \nproductivity.  \nFrom 1890 to 1910, 871 of 1,473 considered commercial areas experienced a decline in \ndistance to station, while from 1910 to 1936 679 of 1,678 locations were affected. \nDistance only increased at very few locations where stations were disconnected or \nLooming Stations 2 \n \nslightly moved along the network. For a detailed description of the data set see Ahlfeldt \nand Wendland (2008). \nII Empirical Strategy \nThe starting point of our empirical analysis is a simple monocentric city model (Alonso, \n1964), which can be estimated using the well-established log-linear specification. Our \nstandard setup assumes the value of urban land (LV) to be an exponential function of \ndistance to the city center (distCBD).2 We extend the basic monocentric model by \ndistance to the nearest railway station (distST) and allow for unobserved location effects \n(f). \ntiiitttttit fdistSTdistCBDLV εγβα ++++=)log(  (1) \nAssuming that the marginal benefit of having a railway station close by remained \nunchanged over time (γ = γt = γt-1), we obtain the following time-difference form: \n)()(\n)()()log()log(\n11\n111\n−−\n−−−\n−+−+\n−+−=−\ntitiitit\nittttitit\ndistSTdistST\ndistCBDLVLV\nεεγ\nββαα\n (2) \nExisting evidence suggests a flattening of the land gradient over time, owing to changes \nin the production and transportation technology (Ahlfeldt and Wendland, 2008; Atack \nand Margo, 1998; Margo, 1996; Mcmillen, 1996; Smith, 2003). Our specification \ntherefore allows the gradient to vary over time. Periods t-1 and t refer either to 1890-\n1936, 1890-1910 or 1910-1936. It can be shown that our first difference estimate \nsatisfies quasi experimental conditions. Considering a control group (C) of locations \nthat remain unaffected by transport innovations, parameter γ provides a difference-in-\ndifference estimate distinguishing between time as well as control and treatment (T) \nlocations. \n                                            \n2\n  We build on the 1936 CBD identified by Ahlfeldt and  Wendland (2008). Accordingly, the CBD is \nlocated between Pariser Platz and the intersection of boulevards Friedrichstrasse and Unter den Linden. \nLooming Stations 3 \n \n)())log()(log())log()(log( 111 −−− −=−−− ititCititTitit distSTdistSTLVLVLVLV γ  (3) \nIII Results \nResults corresponding to equation (2) are presented in column (1) of Table (1) for the \nlong difference 1890 – 1936. The positive coefficient on distCBD indicates the typical \nprocess of decentralization in industrializing cities, which reflects in a flattening land \ngradient. Accordingly, the marginal cost of locating farther away from the CBD is \nreduced by almost 40 percentage points. At the same time, the negative coefficient on \ndistST points to a marginal increase in land value by approximately 22.3% per km \nreduction in distance to station.               \n[Table 1 about here] \nIn order to capture land value decentralization more flexibly, we use binomial and \ntrinomial forms of distance to the CBD (columns 2 and 3) as well as mutually exclusive \n1 km distance rings (column 5 and 6). Anecdotal evidence (Leyden, 1933) highlights \nthe emergence of a strong subcenter along the boulevards Kurfürstendamm and \nTauentzienstrasse at the beginning of the 20th century. Indeed, the respective dummy \ncoefficient (KU) indicates a relative increase in land value of more than 50% (column 4 \nand 6) with the relative 1 km impact area estimated by Ahlfeldt and  Wendland (2008). \nThe key coefficient of interest on distST is estimated consistently in all specifications. \n[Table 2 about here] \nTables 2 and Table 3 repeat Table 1 estimations for 1890-1910 and 1910-1936 \nrespectively. Our estimates suggest that the increased land value following transport \ninnovations observed for the whole study period is almost entirely attributable to an \nadjustment during the first period. While the coefficient estimates on distST are similar \nin Table 1 and 2, Table 3 reveals no significant impact of distance to station. Results \nalso indicate that the emergence of the Kurfürstendamm area as a strong subcenter took \nplace after 1910, as the respective coefficient is insignificant for 1890-1910. \n[Table 3 about here] \nLooming Stations 4 \n \nIV  Discussion \nBuilding on the work of Gibbons and Machin (2005), we provide the first archival \nevidence for the value of transport innovations during European industrialization.3 Our \nresults reflect the willingness of landlords to bid higher prices for commercial properties \ndue to infrastructural improvements. The estimated effect is a net effect of travel time \nsavings to and from the respective locations and environmental changes arising, e.g. \nfrom increased noise. Our estimated impact for a 100 m decrease in distance to railway \nstation of 2.0% to 2.5% is relatively large compared to the findings of Gibbons and \nMachin (2005), whose estimates range from 0.15% to 0.55% per 100 m reduction. \nSeveral explanations may account for this difference. First, the impact on commercial \nland is probably larger compared to residential properties investigated by Gibbons and  \nMachin, since the marginal cost of locating farther away from customers, employees \nand business partners together potentially exceed residents’ opportunity cost of \ncommuting.4 At the same time, commercial land value may be less sensitive to the \ndepreciating impact of environmental factors such as noise. A lower impact of station \nproximity on residential relative to commercial land value has recently been shown for \nthe present-day Berlin (Ahlfeldt and Maennig, 2008). Other explanations refer to the \nhistorical context of our analysis. The marginal value of having a station close by \ncritically depends on the transport mode employed for moving to and from stations. \nThus, a decrease in marginal cost over time is expected from an increasing availability \nof cars, buses and bikes. Also, we would expect much uncertainty in the market as our \nstudy covers the pioneering period of rapid transit innovations. While our time-\ndifferences span enough time to account for anticipation effects (Mcmillen and \nMcdonald, 2004), uncertainty might have led to a considerable overestimation of the \nexpected impact of new stations’ real estate price effects during the first period from \n                                            \n3\n  LeRoy and Sonstelie (1983) develop a theoretical model that predicts where high-income residents \nlocate depending on the affordability of high-speed intra-city transport. They also provide interesting \nevidence for U.S. cities in support of their model. \n4\n  The market potential concept states that firms value access to customers and employees (Crafts, 2005; \nHarris, 1954) while localized production externalities explain why firms attract each other (Fujita and \nOgawa, 1982; Lucas, 2001). \nLooming Stations 5 \n \n1890 to 1910.5 Amplified by the troubled environment of World War One and the Great \nDepression, the following disillusion may have led to an exaggerated downward \nadjustment of expectations.  \n                                            \n5\n  Anecdotal evidence points to much speculation in the market for real estate, in particular with respect \nto new rapid transit lines (Ribbe, 1987). \nLooming Stations 6 \n \nLiterature \nAhlfeldt, G. M., and W. Maennig, (2008), Impact of Sports Arenas on Land Values: \nEvidence from Berlin, The Annals of Regional Science, \nhttp:\/\/dx.doi.org\/10.1007\/s00168-008-0249-4. \nAhlfeldt, G. M., and N. Wendland, (2008), Fifty Years of Urban Accessibility: The \nImpact of the Urban Railway Network on the Land Gradient in Industrializing \nBerlin, KOF Working Paper, 208. \nAlonso, W., (1964), Location and Land Use: Toward a General Theory of Land Rent. \nCambridge, Massachusetts: Harvard University Press. \nAtack, J., and R. A. Margo, (1998), Location, Location, Location! The Price Gradient \nfor Vacant Urban Land: New York, 1835 to 1900, Journal of Real Estate \nFinance & Economics, 16(2), 151-172. \nBowes, D. R., and K. R. Ihlanfeldt, (2001), Identifying the Impacts of Rail Transit \nStations on Residential Property Values, Journal of Urban Economics, 50(1), 1-\n25. \nCrafts, N., (2005), Market Potential in British Regions, 1871-1931, Regional Studies, \n39(9), 1159-1166. \nFujita, M., and H. Ogawa, (1982), Multiple Equilibria and Structural Transition of Non-\nMonocentric Urban Configurations, Regional Science and Urban Economics, \n12(2), 161-196. \nGatzlaff, D. H., and M. T. Smith, (1993), The Impact of the Miami Metrorail on the \nValue of Residences near Station Locations, Land Economics, 69(1), 54-66. \nGibbons, S., and S. Machin, (2005), Valuing Rail Access Using Transport Innovations, \nJournal of Urban Economics, 57(1), 148-169. \nHarris, C. D., (1954), The Market as a Factor in the Localization of Industry in the \nUnited States, Annals of the Association of American Geographers, 44(4), 315-\n348. \nLeroy, S. F., and J. Sonstelie, (1983), Paradise Lost and Regained: Transportation \nInnovation, Income, and Residential Location, Journal of Urban Economics, \n13(1), 67-89. \nLeyden, F., (1933), Groß-Berlin. Geographie Der Weltstadt. Breslau: Ferdinand Hirt. \nLucas, R. E., Jr., (2001), Externalities and Cities, Review of Economic Dynamics, 4(2), \n245-274. \nMargo, R. A., (1996), The Rental Price of Housing in New York City, 1830?1860, The \nJournal of Economic History, 56(03), 605-625. \nMcmillen, D. P., (1996), One Hundred Fifty Years of Land Values in Chicago: A \nNonparametric Approach, Journal of Urban Economics, 40(1), 100-124. \nMcmillen, D. P., and J. F. Mcdonald, (2004), Reaction of House Prices to a New Rapid \nTransit Line: Chicago's Midway Line, 1983-1999, Real Estate Economics, \n32(3), 463-486. \nRibbe, W., (1987), Geschichte Berlins. München: Verlag C.H.Beck. \nSmith, F. H., (2003), Historical Evidence on the Monocentric Urban Model: A Case \nStudy of Cleveland, 1915-1980, Applied Economics Letters, 10(11), 729. \n \n \n \n"}