{"doi":"10.1016\/j.apenergy.2006.03.001","coreId":"140601","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1355","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1355","10.1016\/j.apenergy.2006.03.001"],"title":"Farm mechanization leading to more effective energy-utilizations for cassava and\nyam cultivations in Rivers State, Nigeria","authors":["Nkakini, S. O.","Ayotamuno, M. J.","Ogaji, S. O. T.","Probert, S. D."],"enrichments":{"references":[{"id":37941771,"title":"Continuing Controversies on Tillage Mechanization in","authors":[],"date":"1991","doi":null,"raw":"Odigboh E. U. (1991) “Continuing Controversies on Tillage Mechanization in Nigeria, J. Agric. Science and Technology p 41-49.","cites":null},{"id":37941774,"title":"Energy and Food Production.","authors":[],"date":"1976","doi":"10.1016\/0306-9192(75)90009-3","raw":"Leach, G. (1976), Energy and Food Production.  IPC Science and Technology Press, Guildford, England.","cites":null},{"id":37941773,"title":"Energy for World Agriculture,","authors":[],"date":"1979","doi":null,"raw":"Stout, B.A, Myers C.A., Hurand A. and Faidley L.W., (1979): Energy for World Agriculture, FAO, Agricultural Series No. 7, Rome.","cites":null},{"id":37941769,"title":"Mechanised Agriculture for Sustainable Agricultural Development for Nigerian in the year 2010: Journal of the South-East Regional Chapter of the Nigerian Institution of Agricultural Engineers,","authors":[],"date":"2000","doi":null,"raw":"Meshack-Hart E.T. (2000), Mechanised Agriculture for Sustainable Agricultural Development for Nigerian in the year 2010: Journal of the South-East Regional Chapter of the Nigerian Institution of Agricultural Engineers, 2000 p 39.","cites":null},{"id":37941770,"title":"Overview and Evaluation of Existing Data on Agronomy \/ Agro-economics in the Niger Delta. Report Submitted to Eurconsult, Managing Consultants, Niger Delta Environmental Survey,","authors":[],"date":"1995","doi":null,"raw":"Allison-Oguru, E. A. (1995), Overview and Evaluation of Existing Data on Agronomy \/ Agro-economics in the Niger Delta.  Report Submitted to Eurconsult, Managing Consultants, Niger Delta Environmental Survey, Phase 1.","cites":null},{"id":37941772,"title":"Profitable Farm-Mechanization,","authors":[],"date":"1975","doi":null,"raw":"Culpin, C. (1975), Profitable Farm-Mechanization, Granada Publishing Co., London, p 7","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12-01T00:00:00Z","abstract":"Surveys have been conducted, under the auspices of the Ministry of Agriculture\nand Agricultural Development Projects (ADPs), in the 23 local-government areas\nof the Rivers State, Nigeria. A structured questionnaire, personal visits to\nfarms and interactions with information repositories were used. The quantities\nof energy consumed by tractors used in activities associated with the growing of\ncassava and yam crops in those areas were compared with traditional operations,\nusing just manual labour. Within the period of 1986–2004, the total energy\nutilizations in the production of these crops, in the 23 local government areas,\nwere 2738.87 and 33.5 MJ for tractor-power and traditional-manual operations,\nrespectively. The tractorization intensity (TI) dropped from 0.352 hp\/ha in 1986\nto 0.345 hp\/ha in 2004. This result was below the presently advocated 0.5 hp\/ha\nfor agricultural operations in order to increase crop production. This study\nidentified the causes of this shortfall and recommended, at least for the short-\nterm future, that farm industrialization of all sectors should be subsidiz","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140601.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.apenergy.2006.03.001","pdfHashValue":"4a6f6b633fb71b6b01f2da52b0e29a14d42c64c0","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1355<\/identifier><datestamp>2011-10-21T09:23:11Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Farm mechanization leading to more effective energy-utilizations for cassava and\nyam cultivations in Rivers State, Nigeria<\/dc:title><dc:creator>Nkakini, S. O.<\/dc:creator><dc:creator>Ayotamuno, M. J.<\/dc:creator><dc:creator>Ogaji, S. O. T.<\/dc:creator><dc:creator>Probert, S. D.<\/dc:creator><dc:subject>Farm mechanization<\/dc:subject><dc:subject>Energy utilization<\/dc:subject><dc:subject>Rivers State<\/dc:subject><dc:description>Surveys have been conducted, under the auspices of the Ministry of Agriculture\nand Agricultural Development Projects (ADPs), in the 23 local-government areas\nof the Rivers State, Nigeria. A structured questionnaire, personal visits to\nfarms and interactions with information repositories were used. The quantities\nof energy consumed by tractors used in activities associated with the growing of\ncassava and yam crops in those areas were compared with traditional operations,\nusing just manual labour. Within the period of 1986–2004, the total energy\nutilizations in the production of these crops, in the 23 local government areas,\nwere 2738.87 and 33.5 MJ for tractor-power and traditional-manual operations,\nrespectively. The tractorization intensity (TI) dropped from 0.352 hp\/ha in 1986\nto 0.345 hp\/ha in 2004. This result was below the presently advocated 0.5 hp\/ha\nfor agricultural operations in order to increase crop production. This study\nidentified the causes of this shortfall and recommended, at least for the short-\nterm future, that farm industrialization of all sectors should be subsidize<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-09-29T17:40:41Z<\/dc:date><dc:date>2011-09-29T17:40:41Z<\/dc:date><dc:date>2006-12-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>S.O. Nkakini, M.J. Ayotamuno, S.O.T. Ogaji and S.D. Probert, Farm mechanization leading to more effective energy-utilizations for cassava and yam cultivations in Rivers State, Nigeria, Applied Energy, Volume 83, Issue 12, December 2006, Pages 1317-1325.<\/dc:identifier><dc:identifier>0306-2619<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.apenergy.2006.03.001<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1355<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0306-2619","issn:0306-2619"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Farm mechanization","Energy utilization","Rivers State"],"subject":["Article"],"fullText":" 1\nFARM MECHANIZATION LEADING TO MORE EFFECTIVE ENERGY-\nUTILIZATION FOR CASSAVA AND YAM CULTIVATION IN RIVERS STATE, \nNIGERIA \n \n \n \nS.O. Nkakini a, M.J. Ayotamunoa, S.O.T. Ogajib+, S.D. Probertb \n \na Agricultural & Environmental Engineering Department, Rivers State University of Science & \nTechnology, Port Harcourt. P.M.B. 5080, Rivers State, Nigeria \nb School Of Engineering, Cranfield University, Bedfordshire. United Kingdom. MK43 OAL  \n+ Corresponding author \n \n \nABSTRACT \n \nSurveys have been conducted, under the auspices of the Ministry of Agriculture and \nAgricultural Development Projects (ADPs), in the 23 local-government areas of the \nRivers State, Nigeria.  A structured questionnaire, personal visits to farms and \ninteractions with information repositories were used.  The quantities of energy consumed \nby tractors used in activities associated with the growing of cassava and yam crops in \nthose areas were compared with traditional operations, using just manual labour.  Within \nthe period of 1986 → 2004, the total energy utilizations in the production of these crops, \nin the 23 local government areas, were 2738.87 MJ and 33.5 MJ for traditional manual \nand tractor power operations respectively. The tractorization intensity (TI) dropped from \n0.352 hp\/ha in 1986 to 0.345 hp\/ha in 2004.  This result was below the presently \nadvocated 0.5 hp\/ha for agricultural operations in order to increase crops production. This \nstudy identified the causes of this shortfall and recommended, at least for the short-term \nfuture, that farm industrialization of all sectors should be subsidized.   \n \nKeywords:  farm mechanization, energy utilization, Rivers State. \n \nNomenclature \/ Abbreviations \n \nAc Total land-area subjected to mechanization \nADP Agricultural Development Project \nFCMS Farmers’ Cooperative Management System  \nFGOMS Federal-Government Owned Management-System \nh Weighted average size of tractors \nh\n−\nP  Average tractor power  \nIOMS Individual Owned Management System \nm 4 group  of tractors with respect to capacity  \nN Number of tractors available \nn Number of tractors in a capacity range \nPu Total tractor power in use \nSGOMS State-Government Owned Management-System \nTI Tractorization intensity \n 2\n%0p Percentage of operational tractors \n∑ Summation \n \n \nHISTORIC PERSPECTIVE \n \nIn the pre-independence era of Nigeria, the dominant role of agriculture in the nation’s \neconomy was taken for granted. The first decade, after the country’s independence, was a \nperiod during which Regional Governments became involved directly in agricultural \nproduction in order to enhance the output of the private sector, peasant farmers and \nfishermen [1]. During this period, the main agricultural productions were mainly for \nexport crops, e.g. cocoa in the Western Region, groundnuts and cotton in the Northern \nRegion, as well as palm produce and rubber in the Eastern Region. Also national self-\nsufficiency in food production did not pose any problems worthy of public attention. \nHowever, after two decades of independence, despite the greater involvement of the \nGovernment, there was a rapid deterioration in the national and Rivers State’s \nagricultural situation. Food shortages worsened as a result of the “Oil Boom” which led \nto the migration of labour from the agricultural sector.  Before 1971, Rivers State \npractised both subsistence and cash-crop agriculture and relied solely on human beings as \nthe source of power. Among the major crops grown were rubber, oil palm, cassava, yam, \ncocoyam and pepper. However, their productivities were low, because, as Liljedahl et al \n[2] stated, human beings are limited to less than 0.1 kW continuous power output. To \novercome this limitation, the introduction of agricultural mechanization in the State \nstarted during the period of the first military administration (1967-1976) with the \nprocurement of the first batch of tractors and associated farm implements in 1971. The \nState established several farms and tractor-hiring programmes, as well as trained the \nrequisite manpower at the Agricultural Mechanization Training Centre in Oyo State in \n1971 to handle the machinery fleet. Thereafter, successive military and civilian \ngovernment administrations procured various tractors as the need arose.  \n \nIn Rivers State, the farm holdings are small, ranging from 0.25 to 5 ha. They are owned \nand operated by farmers and their households but often widely dispersed spatially [3, 4]. \nEach farmer and his household cultivated between 2 and 4 non-contiguous plots in a \nfarming season. During this period under review in Rivers State, the land-preparation \noperations, namely tillage and cultivation, break and stir up the soil in readiness for crop \nplanting [5] were predominantly manual operation actions using universally accepted \nimplements. \n \nAccording to Kepner et al [6], the increased production that has been achieved during the \npast century resulted from the growing of better crop varieties, the more effective use of \nfertilizers, improved cultural practices, and, more importantly, the increased utilization of \n(i) more appropriate non-human energy and (ii) employing functionally-appropriate  \nmachines and implements.  \n \nThus, the objective of this investigation was to collate information on the present \nacceptances of farm mechanization energy-utilization and TI in the Rivers State. This \n 3\nknowledge it is hoped will assist the government in encouraging Nigerian farmers to \nadopt the more profitable utilization of machine power.  \n \nTHE INFORMATION \n \n The main sources of evidence for this investigation were obtained from the State \nMinistry of Agriculture, through personal visits to the farms and discussions with record \nholders.  Field surveys were conducted in the 23 local-government areas of the State. \nFurther data were obtained from answers to a structured questionnaire concerning \nagricultural mechanization procedures; farm sizes, cultivation practices; use of tractors \nand implements; labour utilization and requirements; energy utilization; timeliness of \nagricultural operations, availability of credit facilities; farmers’ social conditions, such as \neducation, knowledge of farm machines; availability of repair facilities; as well as make, \nmodel, number, capacity and year of purchase of each tractor. \n \nDATA COLLECTION AND PROCESSING \n \nInformation collected for each of the 23 local-government areas, using both primary and \nsecondary sources, have been analysed. The primary data were obtained from the \nstructured questionnaire, personal contact and oral interviews. Some physical inspections \nwere also undertaken.  By a secondary method, relevant information was obtained from \nagricultural documents (such as bulletins), workshops and seminars. \n \nThe assessment of the degree of mechanization achieved was accomplished in two ways. \nThe first was the method whereby the current tractorization intensity (TI) in hp\/ha units \nin the State was computed using the definition proposed by Anazodo et al. [7], viz: \n    \nTI = \nC\nU\nA\nP                                            (1) \n \nThe second assessment was based on an energy analysis. Suitable energy equivalents for \nhuman and tractor powers were used to convert the man-hr and tractor-hr expenditures \ninto MJ of energy consumed [8] as kWh = 3.600 x 106J and 0.5hp\/ha = 0.373kW\/ha. \n \nFor the important crops grown in Rivers State, the energy utilized in the various \noperations namely land-clearing, ridging, mound making, planting, weeding and \nharvesting were analysed from the gathered information. \n \n \nDISCUSSION \n \nAn appraisal of tractor acquisitions (1971→2004) revealed those that were available for \nfarming in Rivers State are shown in Table I: 17 different designs of tractors were used in \nthe State. Table 2 shows the percentage distribution of purchases according to models: a \ntotal of 10 different tractor makes were used. \n \n 4\nIn Table 3, tractor procurement, by the State government, has been grouped into three \ndecades, 1971→1980, 1981→1990, and 1991→2000 as the first, second and third \ndecades respectively because ten-year service life was expected of each tractor [9].  \nOverall, FIAT tractors were the most common in Rivers State, Nigeria.  \n \nThe appalling statistic revealed in Table 4, concerning actual tractor availability, could be \nattributed to the poor maintenance-programmes and repair facilities with respect to \nfarming Nigeria. \n \nTILLAGE AND CULTIVATION  \n \nTable 5, compares the field operation rates by farmers in Rivers State using either (i) \nhand-tools or (ii) machine power.  The total of mean manual and machine indicated field \nworks of 317.0 man-days\/ha and 1.04 machine-days\/ha, respectively, to achieve the same \ntask, are shown.  An analysis indicated that 32.6 man-days\/ha of manual labour were \nused for land preparation to achieve the same as 0.10 machine days\/ha when machine \npower was employed.  The ridging and cassava planting field work utilized 0.24 \nmachine-days\/ha or 43.8 man-days\/ha.  Mound making and yam planting used 57.8 man-\ndays\/ha or 0.18 machine-days\/ha to achieve the same end. The field work which \ninvolved, first, general weeding used 40.0 man-days\/ha or 0.14 machine–days\/ha. After \nwhich root weeding consumed 36.7 man-days\/ha or 0.12 machine-days\/ha. Manual field \nwork is time-consuming and requires a large amount of human labour. This situation \nwidespread amongst Rivers State farmers, who were predominantly hand-tool farmers.  \n \n \nENERGY UTILIZATION IN HUMAN AND MACHINE POWERED \nAGRICULTURAL TECHNOLOGIES \n \nMost traditional technologies practised in Rivers State are highly ineffective.  From Table \n5, it is clear that for the same cassava production per hectare, a total of 1468 MJ and 18 \nMJ of energy was expended for manual and machine power, respectively.  The \nproduction of yam per hectare utilized a total of about 1524 MJ and 18 MJ for manual \nand machine power, respectively. This makes an overwhelming case for the use of \ntractors, in these agricultural operations. \n \nFigures 1 and 2, showed that overall manual labour energy utilization for the same end-\nproduct was approximately 83 times the energy required when using the tractor.  Energy \nutilization for tillage and cultivation operations in regards to land preparation, weeding \nand harvesting was far greater when supplied by manual labour rather than by machine. \n \nStout et al [10], reported specific human energy consumption for bush clearing as \n1680MJ, and 19.4 man-days were required to prepare a hectare of land, whereas for the \nsame task, the machine required as 0.88MJ energy utilization and 0.019 machine-days \nper hectare. \n \n 5\nEnergy utilization for manual weeding was 1320MJ and 2.29 MJ for machine field \noperation: 32.6 man-day\/ha and 0.015 MJ machine effort were reported [10].  Energy-\nrelated data from a number of tropical cultivation systems and products for which cassava \nwas one of them have been averaged by Leach [11] as 0.749 MJ for manual labour and \n0.0487MJ when using machine power.   \n \nCONCLUSIONS  \n \nFarmers in the Rivers State employed only a low level of mechanization. The resulting \nlow productivities were due to: poverty; ignorance; lack of incentive to use of machinery \nin agricultural practices; and traditional tools being cheap, simple and readily available to \nthe poor farmer.  However, the latter was very time consuming. The total energy \nutilizations for the manual and machine operations per hectare for achieving the same \noutcome were 2738.9MJ and 33.5MJ.  The human energy utilization was so much for \nmanual methods that farmers are reduced to subsistence levels. The cultivations of yam \nand cassava crops require more energy expenditure per hectare of land for manual than \nmechanical operations in Nigeria.  \n \nTractorization intensity (T.I) decreased from 0.352hp\/ha in 1986 to 0.345hp\/ha in 2004 \nbecause agricultural activities in Rivers State were in decline.  The 0.345hp\/ha tractor-\npower utilization remained far below the 0.5hp\/ha, as recommended for effective \nagriculture operations [12].  Hence the much needed food self-sufficiency has continued \nto elude the State. A similar conclusion applies for the entire country. Planting and \nharvesting of all the major crops need to be mechanized and more land used for \nagriculture. \n \nA concerted effort towards achieving standardization of the components for tractors \nsuited for the peculiar agro-physical and climatic conditions is needed in Nigeria, as this \nwould ensure that tractors are more likely to function well throughout their service lives.  \n \nGovernment encouragement and incentives for farmers to use farm machinery is a \ndesirable challenge.  \n \n \nTABLE 1: TRACTORS PURCHASED BY THE RIVERS STATE GOVERNMENT \n(1971 → 2004) \n \nYEAR TRACTOR \nMANUFACTURER \nMODEL POWER \n(kW) \nQUANTITY TOTAL NUMBER \nOF TRACTORS \nPURCHASED IN \nTHE SPECIFIED \nYEAR \n1971 MASSEY FERGUSON \nMASSEY FERGUSON \nFORD \n135 \n165 \n5000(D) \n48 \n60 \n48 \n20 \n3 \n2 \n25 \n1972 MASSEY FERGUSON 165 60 8 8 \n1976 JOHN DEERE \nDAVID BROWN \n- \n1990 \n60 \n53 \n12 \n7 \n19 \n 6\n1977 DAVID BROWN 1990 60 3 3 \n1978 FIAT \nFIAT \n80 (DT) \n640 (DT) \n- \n82 \n10 \n15 \n25 \n1984 STEYR \nSTEYR \n8120A \n8080A \n80 \n52 \n3 \n10 \n13 \n1985 STEYR \nSTEYR \nFIAT 666 \n768 \n52 \n52 \n5 \n15 \n20 \n1986 STEYR \nSTEYR \nSTEYR \nMARSHAL \/ LEYLAND \nMARSHAL \/ LEYLAND \nMARSHAL \/ LEYLAND \n768 \n8130 \n8075 \n- \n- \n- \n97 \n52 \n52 \n52 \n52 \n60 \n5 \n9 \n9 \n7 \n3 \n8 \n41 \n1989 STEYR 8075 52 50 50 \n1990 BELORUS - 60 50 50 \n1992 ZETOR 7745 60 21 21 \n1996 FIAT 8066 (DT) 60 20 20 \n1997 FIAT \nFIAT \n8066 \n70.56 \n52 \n52 \n14 \n10 \n24 \n2001 FIAT \n \n70.56 52 3 3 \n2002 NEW HOLLAND 70.56 52 10 10 \n2003 - - - - - \n2004 - - - - - \nTOTAL 332 \n \n \n \nTABLE 2: NUMBER OF TRACTORS (ACCORDING TO MANUFACTURER) \nPURCHASED BY RIVERS RIVERS STATE GOVERNMENT IN THE PERIOD \n1971→2004 \n \nTRACTOR  MANUFACTURER NUMBER  % OF TOTAL \nMASSEY FERGUSON  31 9.32 \nFORD 2 0.60 \nJOHN DEERE 2 3.61 \nDAVID BROWN 10 3.10 \nFIAT 77 23.18 \nSTEYR 101 30.40 \nMARSHALL \/ LEYLAND  18 5.41 \nBELORUS  50 15.05 \nZETOR  21 6.32 \nFIAT \/ NEW HOLLAND  10 3.01 \nTOTAL 332 100 \n \n \n \n \n \n \n \n 7\nTABLE 3: TRACTORS PURCHASED BY THE RIVERS STATE GOVERNMENT \nWITHIN SPECIFIED PERIODS \n \nYEARS TRACTOR MAKE NUMBER PERCENTAGE OF TOTAL \nNUMBER PURCHASED \nWITHIN THE DECADE \n(%) \n1971 → 1980 \n \nMASSEY FERGUSON \nFORD \nJOHN DEERE \nDAVID BROWN \nFIAT \n31 \n2 \n12 \n10 \n25 \n38.75 \n2.50 \n15.00 \n31.25 \n12.50 \nSUB TOTAL FOR THE 1ST DECADE 80 100 \n1981 → 1990 \n \n \nSTEYR \nMARSHAL \/ LEYLAND \nFIAT \nBELORUS \n101 \n18 \n5 \n50 \n58.05 \n10.34 \n2.87 \n28.74 \nSUB TOTAL FOR THE 2ND DECADE 174 100 \n1991 →2000 \n \nZETOR \nFIAT \n21 \n44 \n32.30 \n67.70 \nSUB TOTAL FOR THE 3RD DECADE 65 100 \n2001 → 2004 FIAT \nNEW HOLLAND \n \n3 \n10 \n23.08 \n76.92 \nSUB TOTAL FOR YEARS 2001 - 2004 13 100 \nGRAND TOTAL 332  \n \nTABLE 4: SOME FARMS IN RIVERS STATE AND THEIR LEVELS OF \nINVOLVEMENT IN MECHANIZATION \n \nName of Farm \n \nType of  \nmanagement \nsystem \nSize of farm \n(Hectares)  \nNumber \nof \ntractors \navailable  \nStaff \nStrength  \n \nNumber of \nTractors  \nin \noperational \ncondition  \nNumber of \nTractors in \nday-to-day \nuse \nSchool-to-land Authority Farm, \nIriebe, Obio\/Akpor L.G.A.  \n \nSGOMS \n \n150 \n \n6 \n \n>25 \n \n4 \n \n1 \nAgricultural Development \nProgramme Farm, Okoro-Odo, \nObio\/Akpor L.G.A.  \n \n \nSGOMS \n \n \n100 \n \n \n4 \n \n \n>25 \n \n \n2 \n \n \n1 \nNigeria Prosins Farm, Eleme, \nIkwerre L.G.A.   \nFGOMS 80 4 >25 1 1 \nZuru Farm, Rumuigbo,  \nOdo, Obio\/Akpor L.G.A. \n \nIOMS \n \n20 \n \n- \n \n<10 \n \n- \n \n- \nJoel Nwala Farm, Omuma, \nOmuma L.G.A. \n \nIOMS \n \n30 \n \n- \n \n<10 \n \n- \n \n- \nChief N. U. Njoku Farm, Etch, \nEtche L.G.A. \n \nIOMS \n \n30 \n \n- \n \n<20 \n \n- \n \n- \nBionu Bangha Farmers, \nCooperative Society Ltd. Bionu \nBangha, Khana L.G.A.  \n \n \nFCMS \n \n \n90 \n \n \n- \n \n \n<10 \n \n \n- \n \n \n- \n 8\nAmadi Electrical \/ Farms, \nIgwurata, Ikwerre  L.G.A. \nIOMS  \n20 \n \n- \n \n<10 \n \n- \n \n- \nAntali Farm Atali  \nObio\/Akpor L.G.A. \nSGOMS 100 2 >25 1 1 \nRupheiza Farms, Atali,  \nObio\/Akpor L.G.A. \nIOMS 15 - <10 - - \nAreta Farm, Atali, \nOdo, Obio\/Akpor L.G.A. \nIOMS  \n20 \n \n- \n \n<10 \n \n- \n- \nTotal   655 16 - 8 4 \n   \nTABLE 5: COMPARISON OF THE FIELD-OPERATION RATES AND \nMANUAL ENERGY UTILIZATUION WITH THE MECHANIZED \nALTERNATIVES IN RIVERS STATE \n \nTotal energy used  \nper ha \nField \noperations \nMean manual \nfield-work rate \n(man days \/ ha) \nMean machine \nfield-work rate \n(machine-\ndays\/ha) for \nachieving the \nsame previous \nsection \nCrop  \nManual \n(MJ) \n \nMachine \n(MJ) \nLand clearing 32.6 0.10 Yam \/ Cassava 281.66 3.22 \nRidging for \ncassava \nplanting \n43.8 0.15 Cassava 378.43 4.83 \nMound making \nfor yams \n57.8 0.18 Yam 499.39 5.80 \nCassava \nplanting \n57.8 0.18 Cassava 244.51 2.90 \nYam planting 17.3 0.06 Yam 149.47 1.93 \nWeeding \n(root crops) \n36.7 0.12 Yam \/ Cassava 317.09 3.87 \nWeeding \n(General) \n40.0 0.14 - 345.60 4.51 \nCassava \nharvesting \n28.5 0.09 Cassava 246.24 2.90 \nYam harvesting 32.0 0.11 Yam 276.48 3.54 \nTotal 346.5 1.14  2738.87 33.50 \n  \n \n  \n 9\n0\n50\n100\n150\n200\n250\n300\n350\n400\nLand Clearing Ridging for\ncassava\nplating\nCassava\nPlanting\nWeeding\n(General)\nCassava\nHarvesting\nField Operation\nEn\ner\ngy\n (M\nJ\/\nha\n)\nManual\nMachine\n \n \nFig.1:  Energy utilization in cassava cultivation in Rivers State. \n \n \n \n0\n100\n200\n300\n400\n500\n600\nLand Clearing Mould making for yams Yam Planting Weeding Root Crops Yam Harvesting\nField Operation\nEn\ner\ngy\n (M\nJ\/\nha\n)\n     Manual\n       Machine\n \nFig.2:  Energy utilization in yam cultivation in Rivers State. \n \n \n \n \n \n \n \n \n 10\nREFERENCES \n \n1. Meshack-Hart E.T. (2000), Mechanised Agriculture for Sustainable Agricultural \nDevelopment for Nigerian in the year 2010: Journal of the South-East Regional \nChapter of the Nigerian Institution of Agricultural Engineers, 2000 p 39. \n2. Liljedahl, J. B. Cariton, W. M., Turnquist P. K. and Smith, D. W. (1979), Tractors \nand their Power Units (3rd ed.) John Wiley and Sons Inc., Ottawa, Canada. \n3. Allison-Oguru, E. A. (1995), Overview and Evaluation of Existing Data on \nAgronomy \/ Agro-economics in the Niger Delta.  Report Submitted to Eurconsult, \nManaging Consultants, Niger Delta Environmental Survey, Phase 1. \n4. Allison-Oguru, E. A.,  Zuofa K, and Berepubo N. A. (1999), “Agriculture” in \nAlagoa, E.J. (ed). Land and People of Bayelsa State: Central Niger Delta. Port \nHarcourt, Onyoma Research Publication.  p 283-300. \n5. Odigboh E. U. (1991) “Continuing Controversies on Tillage Mechanization in \nNigeria, J. Agric. Science and Technology p 41-49. \n6. Kepner, R. A. Bainer, R and Barger, E. L. (1978), Principles of Farm Machinery (3rd \nedition) AVI Publishing Company Inc. Connecticut, USA. \n7. Anazodo, U. G. N, Abinbola, T. O. and Dairo, J. A. (1986) “Agricultural Machinery \nInventory: Type and Condition in Nigeria (1975→85)” Federal Department of \nAgriculture, Nigeria. \n8. Ojah, T. P., and Michael,A. M. (1988), Principles of Agricultural Engineering, Vol. 1 \nJain Brothers Publishing Co., New Delhi. p 623. \n9. Culpin, C. (1975), Profitable Farm-Mechanization, Granada Publishing Co., London, \np 7 \n10. Stout, B.A, Myers C.A., Hurand A. and Faidley L.W., (1979): Energy for World \nAgriculture, FAO, Agricultural Series No. 7, Rome. \n11. Leach, G. (1976), Energy and Food Production.  IPC Science and Technology Press, \nGuildford, England. \n12. Igbeka J.C, (2002) “Agricultural Engineering and Society” Nigerian Institution of \nAgricultural Engineers Quarterly (3): 3-11. \n"}